{
  "id": "10",
  "title": "What do you think of the new Typophile?",
  "forum": "Home",
  "tags": [

  ],
  "content": "This is amazing!\n\n60% (97 votes)\n\nPretty good. I've seen better.\n\n23% (37 votes)\n\nAt least it's better than the old one.\n\n8% (13 votes)\n\nThis sucks. Bring back the double posts!\n\n9% (15 votes)\n\nTotal votes: 162\n\n",
  "author": "Christian Robertson",
  "time": "26 April, 2005 - 8:29am",
  "uid": "1",
  "comments": [
    {
      "time": " 5 May, 2005 - 6:08pm",
      "content": "nice work boys!\n\n"
    },
    {
      "time": " 5 May, 2005 - 6:31pm",
      "content": "Excellent, guys - thanks for all the hard work!\n\n"
    },
    {
      "time": " 5 May, 2005 - 7:49pm",
      "content": "All the free time I thought I had, is now dedicated to Typophile RSS feeds, Typophile Instant Messaging, Typophile WikiWikiWacking, and, um… Typophile. Excellent work!\n\n"
    },
    {
      "time": " 5 May, 2005 - 7:56pm",
      "content": "Very elegant and nice new features. Exelente trabajo!!\n\n"
    },
    {
      "time": " 5 May, 2005 - 8:28pm",
      "content": "WikiWikiWacking! I am so there.\n\n"
    },
    {
      "time": " 5 May, 2005 - 8:43pm",
      "content": "Elegant, indeed. Love how…type is front and center. Thank you.\n\n"
    },
    {
      "time": " 5 May, 2005 - 9:20pm",
      "content": "Looks great. Great work! I had to vote for the last option just for fun since I laughed out loud about the double post thing. No, it doesn’t really suck, though.\n\n"
    },
    {
      "time": " 5 May, 2005 - 10:05pm",
      "content": "Love it! Can’t wait till all features are up and running and the kinks are worked out.\n\n"
    },
    {
      "time": " 6 May, 2005 - 12:28am",
      "content": "amazing!\n\n"
    },
    {
      "time": " 6 May, 2005 - 1:05am",
      "content": "wonderful, now i know why i have to wait so long for my typophile t-shirts …\n\n"
    },
    {
      "time": " 6 May, 2005 - 1:37am",
      "content": "WOW! and love idea of Typowiki!\n\n"
    },
    {
      "time": " 6 May, 2005 - 2:19am",
      "content": "It tries to be elegant, but fails. I voted for the last option, though I don’t think it sucks. The previous design was just more solid.\n\n"
    },
    {
      "time": " 6 May, 2005 - 2:31am",
      "content": "Its quite nice - on large screens only. For my taste a bit over designed is the head. It takes too much space!\n\n"
    },
    {
      "time": " 6 May, 2005 - 6:04am",
      "content": "I think this is a bit ironic: [http://www.thisandagain.com/pollpic.gif](http://web.archive.org/web/20051111085118/http:/www.thisandagain.com/pollpic.gif)\n\n(Screen shot from my Mac)\n\n"
    },
    {
      "time": " 6 May, 2005 - 7:58am",
      "content": "I have not been around awhile…but, hope to be back soon…I know these efforts are huge labors of luv…so, thanks for the hard work.\n\n"
    },
    {
      "time": " 6 May, 2005 - 8:23am",
      "content": "I try to avoid Flash as much as possible, but still, I like the thread titles set in Gotham.  \nI do agree with Andreas, though.\n\n"
    },
    {
      "time": " 6 May, 2005 - 8:30am",
      "content": "Overall nice. Two things:\n\nAgree about the size thing—I’m getting horizontal scrollbars at 1024x768—\n\nand\n\nIs it just me or does the server run \\*real\\* slow?\n\n"
    },
    {
      "time": " 6 May, 2005 - 10:40am",
      "content": "Good work, I have two comments to add. I liked the forward (& back) to next topic at the top and bottom of the thread and identities instead of just usernames.  \nTim\n\n"
    },
    {
      "time": " 6 May, 2005 - 10:58am",
      "content": "Liked the critique topics sorted by date instead of alpha. Scanning for the most recent post is tedious since the dates are “T minus” expressions. Agree on the fixed width, it’s really a bit too wide, but I like how the over-bloated images flop over the width of the text. That is a good thing.\n\n"
    },
    {
      "time": " 6 May, 2005 - 12:49pm",
      "content": "Fantastic and Its great to be back home (Typophile), with this new layout. Cheers to all.\n\nRicardo\n\n"
    },
    {
      "time": " 6 May, 2005 - 1:19pm",
      "content": "¡¡¡ Absolutely Gorgeous Fabulous !!!\n\n"
    },
    {
      "time": " 6 May, 2005 - 6:15pm",
      "content": "Two things:\n\n1. On the registration page, keep the form fields white. Keeping them the same color as the background with a thin outline only a few shades lighter isn’t very user-friendly. Keep the boxes white or alternately, make the outlines black.\n\n2. Don’t hide the page name for the RSS (as it stands now it’s just typophile.com/rss/INSERT\\_PAGENAME\\_HERE.rdf/xml). This way, people with RSS browsers can copy the URL into their respective program. It would also be helpful if you offered the RSS on your main page such that my little orange RSS icon will show up in my Firefox browser.\n\n"
    },
    {
      "time": " 6 May, 2005 - 8:29pm",
      "content": "not bad, earliar was better as far as usability is concerned\n\n"
    },
    {
      "time": " 7 May, 2005 - 1:04am",
      "content": "I love how integrated all the features are — I just assumed I could reference my wiki entry for [sans serif](http://web.archive.org/wiki/sans%20serif) from my blog, and it just worked! Awesome! I also can’t wait to see how the wiki and the forums tie together in practice; my hope is that the number of rehashed threads will drop precipitously as more FAQ-type material migrates to the wiki.\n\nI could use a little less flash to the interface and a little more functionality, though. The wiki’s still a little flaky in some respects and the UI could stand to be streamlined a bit. That said, this is a huge improvement and the new architecture seems ready to grow in ways that the old just never would have. Good work!\n\n"
    },
    {
      "time": " 7 May, 2005 - 4:39am",
      "content": "I was very impressed when I first saw the redesign, generally still am, it is beautiful. But looking at this forum, after actually using it, wish to share these opinions.\n\n1. Lack of visual contrast and cues  \nI think the old layout may be more visually clear. Now, because all posts share the same gray background and especially the username/posting date line’s close proximity along with its lack of strong visual contrast with the actual post, it makes the page harder to scan, when scrolled the page seem to gel into one gray mass with less visual cue to differentiate between posts. The old alternating gray / white rows, avatar together with the user’s post length seems clearer and might help users remember post positions on a page better.\n\n2. Text color, size and contrast  \nAlso the text is dark grey, small and on a gray background, I think it hampers prolonged reading a little because of lesser overall contrast.\n\n3. Why so grey?  \nThe whole grey color scheme makes this forum seem a little solemn maybe, somehow less fun then the old one.\n\n4. Smilies are fun, would be nice to have back …\n\nJust my 0.02 cents.\n\n"
    },
    {
      "time": " 7 May, 2005 - 12:33pm",
      "content": "i love being able to go back and edit old posts and even thread taglines!!!\n\n"
    },
    {
      "time": " 9 May, 2005 - 1:24pm",
      "content": "Herculean effort guys - thanks!\n\nOne big question [for now]:  \nHow can I get email delivery of posts?\n\nhhp\n\n"
    },
    {
      "time": " 9 May, 2005 - 4:33pm",
      "content": "there is no longer email delivery, hrant. you need to get a newsreader.\n\n"
    },
    {
      "time": " 9 May, 2005 - 10:05pm",
      "content": "Some guidance on that, please!  \nI’m on WinXP-Home. Oh, and I’m lazy.\n\nhhp\n\n"
    },
    {
      "time": " 10 May, 2005 - 2:10am",
      "content": "Yes, can someone also explain (in a manner even a simpleton can understand) how to post links as well.  \nTim\n\n"
    },
    {
      "time": " 10 May, 2005 - 3:20am",
      "content": "Hrant,\n\nTry [FeedReader](http://web.archive.org/web/20051111085118/http:/www.feedreader.com/) for Win XP. It’s nice, simple and free.\n\nI tried out a few different RSS readers for PC and this one was the best one I found…\n\n"
    },
    {
      "time": " 10 May, 2005 - 3:26am",
      "content": "Tim,\n\nTry this:  \n`<a href=\"http://www.website.com/page.html\">Link Description</a>`\n\n"
    },
    {
      "time": " 10 May, 2005 - 1:05pm",
      "content": "I have a very fast internet connection, but the website is slow… I hope this will be improved when the site leaves the Beta stage.\n\nOther then that I have to get used to the new layout and search a bit, but I’m very sure I will love this in some days. It looks at least great, and that’s all we graphic designers want. :D\n\nRegards,  \n®ené\n\n\\*\\*\\* C H A R A C T E R S { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": " 11 May, 2005 - 6:25am",
      "content": "Just a note for Hrant:  \nEven with the RSS reader you will only get notification of _new_ threads.  \nMeanwhile you can use the “tracker”:  \n [http://typophile.com/tracker/](http://web.archive.org/web/20051111085118/http:/typophile.com/tracker/)\n\n"
    },
    {
      "time": " 12 May, 2005 - 7:03am",
      "content": "Great redesign and glad to don’t see anymore Arial (or whatever) on css :)\n\nWelcome Georgia, Verdana, and some Hoefler fonts (how you do that?, Flash?) too (+some I miss?)\n\n"
    },
    {
      "time": " 12 May, 2005 - 11:23pm",
      "content": "I’ve been using computers since friggin’ 1977, and you guys still manage to make me feel retarded! On Tuesday I finished catching up with (nevermind actually reacting to…) all the pre-relaunch posts that I’d missed; so now I guess I need to:  \n1) Get that RSS thing working. I hope it’s versatile… Like I really don’t want to fall into the fast & furious world of type-IDs again.  \n2) Use the Tracker to get at the posts that were made after the relaunch but before my RSS hookup.\n\nPlease correct me if I’m missing something…\n\nhhp\n\n"
    },
    {
      "time": " 13 May, 2005 - 5:04am",
      "content": "Do you use Thunderbird?  \nIt reads RSS feeds too.\n\nYou can subscribe to specific areas of the forum; receiving feeds only from the areas you are interested in. See here: [http://typophile.com/feeds](http://web.archive.org/web/20051111085118/http:/typophile.com/feeds)\n\n"
    },
    {
      "time": " 13 May, 2005 - 8:12am",
      "content": "Yeah, I’ve been using Thunderbird (and Firefox) for a few months now. I just found a nice page about it\\*, and it’s looking promising! My favorite part is “Thunderbird lets you view RSS content in a way that is very similar to reading email”! You young guns who eat and sleep technology don’t get what it means to be a lethargic, content-focused old fart who’s “been there, done that, can’t remember”… :-/\n\n\\* [http://kb.mozillazine.org/Thunderbird\\_:\\_FAQs\\_:\\_RSS\\_Basics](http://web.archive.org/web/20051111085118/http:/kb.mozillazine.org/Thunderbird_:_FAQs_:_RSS_Basics)\n\nhhp\n\n"
    },
    {
      "time": " 13 May, 2005 - 9:10am",
      "content": "OK, I don’t want this to become a tech support thread or anything, but I need help! I installed the RSS thing into Thunderbird, and fired it up. Problem #1: I only got 15 messages, the first from 4/17, 7:20AM (“Troubleman”) and the last from 5/12, 12:11PM (“Information Design, information architecture”). Problem #2: It doesn’t look like it wants to load up new posts. Yes, I’ve set it to download new messages: every 1 minute; and upon startup. Problem #3: The busy bar (at the bottom-right) is acting funny now - sometimes it gets stuck in the middle, sometimes it won’t stop churning.\n\nIf anybody is willing/able to help me in private [instead]:  \nhrant\\_thatsymbol\\_inverselogic\\_dot\\_com\n\nThanks. Type is my blood.\n\nhhp\n\n"
    },
    {
      "time": " 14 May, 2005 - 3:49am",
      "content": "It would be good if we could see the pics in the Type ID board instead of clicking the attachment text.\n\nWhy does the intro text have to be so large? We’re not blind.\n\nNick Cooke\n\n"
    },
    {
      "time": " 15 May, 2005 - 8:49am",
      "content": "This is great.\n\n"
    }
  ]
}
