{
  "id": "100042",
  "title": "nine top-rated NGO's websites: 6 Arials",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Inviting commentary on this.\n\nI found a list of top 100 NGOs, and I checked websites for 9 of the top 10, looking at design and layout. While I was at it, I noticed that the text size on nearly all of them was very small -- and column width too wide for the small text. And I found that 6 of them used Arial, 1 Verdana, 1 Trebuchet, and 1 Proxima Nova.\n\nMY commentary: \"blech.\"\n\nIf you'd care to recommend, I'm interested in your opinion on a great sans typeface for web body text. Assume delivery over Typekit, Google Web Fonts, or comparable service. Neutral, readable; up-to-date, professional. Used at a slightly smaller size than you would probably want to suggest.\n\nThese sites frequently use the same face for Heading and Subheadings -- in other words, the whole page is one face, with the exception of the logo (which is whatever). In case that's relevant to your recommendation.\n\nWhat's solid?\n\n",
  "author": "Amado",
  "time": "25 Jan 2013 — 6:52am",
  "uid": "99380",
  "comments": [
    {
      "time": "25 Jan 2013 — 8:47am",
      "content": "It's probably because most NGOs are stingy.\n\nSmaller size? Narrow it down (pardon the pun) to wide fonts.\n\nhhp\n\n"
    },
    {
      "time": "25 Jan 2013 — 10:42am",
      "content": "Well, for \"stingy\" there's always Google Web Fonts. Open Sans's x-height ( [http://www.google.com/webfonts/specimen/Open+Sans](http://web.archive.org/web/20130907222808/http:/www.google.com/webfonts/specimen/Open+Sans \"http://www.google.com/webfonts/specimen/Open+Sans\")) makes it very good at small sizes. I like Lato, though. ( [http://www.google.com/webfonts/specimen/Lato](http://web.archive.org/web/20130907222808/http:/www.google.com/webfonts/specimen/Lato \"http://www.google.com/webfonts/specimen/Lato\"))\n\nBut I already know what I'VE seen. What I really wanna know is, what have YOU seen? What do you think are currently some of the best neutral, readable, up-to-date, professional sans faces, for body text, for websites targeted to web browsers on computer screens?\n\nI know there's always an \"it depends\" in there, but, what do you like these days?\n\n"
    },
    {
      "time": "25 Jan 2013 — 11:05am",
      "content": "Tisa is nice.\n\nhhp\n\n"
    },
    {
      "time": "25 Jan 2013 — 1:34pm",
      "content": "Observation: it seems to me the more successful web fonts for body copy are all a bit slabby -- with a vertical slab on glyphs like the f, r, c, and so on. Tisa is an example of this, and so it skolar.\n\nDo you think these slabs are, um, \"performance oriented\"? Which it to say, the vertical slab on the f, for example, would take to hinting better than if the f ended in a thin stroke.\n\n?\n\n"
    },
    {
      "time": "28 Jan 2013 — 8:26am",
      "content": "One bump?\n\n"
    }
  ]
}
