{
  "id": "100064",
  "title": "Numbers in circles or any other shape",
  "forum": "Sans Serif",
  "tags": [
    "numbers",
    "Sans Serif"
  ],
  "content": "Hi everyone --\n\nLooking to find some nice numbers to use for a list inside of a textbook - ideally i'm looking for numbers that are inside circles or squares or some other shape, - should go with thesans font, if possible - thanks in advance for any thoughts.\n\n",
  "author": "Palindrome",
  "time": "25 Jan 2013 — 6:39pm",
  "uid": "207361",
  "comments": [
    {
      "time": "26 Jan 2013 — 6:29am",
      "content": "Searching MyFonts for \"circled numbers\" gets you stuff like [Fyra.](http://web.archive.org/web/20150414095903/http:/www.myfonts.com/fonts/jonathan-hughes/fyra/) But if you don't anticipate your lists being that long, there are more choices.  \n① to ⑳ and ❶ to ⓴ are in encoded in Unicode. [Here's all the fonts on MyFonts that contain the character ⑨.](http://web.archive.org/web/20150414095903/http:/www.myfonts.com/search/char%3A%E2%91%A8/fonts/) Some of them don't go up to ⑩ but you can see there is a lot to choose from.\n\n"
    },
    {
      "time": "26 Jan 2013 — 2:02pm",
      "content": "Thanks so much for your help Cerulean --\n\nIf I many ask -- how were u able to find all of the fonts that have numbers in circles? And how do I get to see what all the numbers in circles look like in the various fonts? I'm fairly new to myfonts, and having trouble seeing them -- thanks for your help.\n\n"
    },
    {
      "time": "26 Jan 2013 — 3:01pm",
      "content": "Find Fonts, Advanced Search, available characters, contains, ...and paste in a character the font needs to have (from whatever source is most handy, like the character map application, unicode.org charts, Wikipedia... I'm working on a font family that has them, so I copied it out of the Metrics window in Fontlab).\n\nOne way would be to click through to each specific font's page and select the tab that says Glyphs, which shows you the whole character set. But to make it much easier to compare them all, just copy from this: ①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳ and paste it into the sample text field at the top of the list, the place where it probably says \"[Pangrams]\".\n\n"
    },
    {
      "time": "26 Jan 2013 — 3:19pm",
      "content": "ah wonderful - thank you so much!\n\n"
    }
  ]
}
