{
  "id": "100096",
  "title": "Join the LAD Project",
  "forum": "General Discussions",
  "tags": [
    "#ladproject #foundtypography #handmadetype",
    "General Discussions"
  ],
  "content": "HI guys,  \nI've started a project called the LADproject, it's a \"letterform a day\" exercise. I was hoping to see if anyone else would like to join me in this experiment/project. The basics of it are, to \"find\" or make a letterform a day for 50 days. It can be found anywhere or in anything. You can make one or draw one. Paint one or just find one that's already made. I consider it an exercise to open up the possibilities of what can be considered typography, or where we can find typography.  \nInspired by Stefan Sagmeister and Michael Beirut, I've dedicated myself to find or make a letterform a day. You can follow the progress here...http://nicolascervantes.wordpress.com/ Post your letterforms there and also comment. Thanks guys, here's aB that jumped out at me today.\n\n ![](http://web.archive.org/web/20140713205652im_/http:/typophile.com/files/b_small_4135.jpg)\n\n",
  "author": "nicolas.cervantes",
  "time": "27 Jan 2013 — 1:14am",
  "uid": "171730",
  "comments": [
    {
      "time": "27 Jan 2013 — 8:16am",
      "content": "_…what can be considered typography…_\n\nHardly.  \nBy the same token all sounds are music, anything one puts in one’s mouth food.  \nNot that I have anything against your proposed activity—just the terminology!  \nAt any rate, it’s always good to see images at Typophile, as well as talk about type.  \nLet’s see how far you can stay this course.\n\n"
    },
    {
      "time": "27 Jan 2013 — 9:36am",
      "content": "I agree with Nick: if it ain't type, it ain't typography. Which is not to say it isn't interesting in its own right, as a way of looking at the world through the filter of letter shapes. And if you were to collect all these images into a [Photofont](http://web.archive.org/web/20140713205652/http:/www.photofont.com/), _then_ it would be type and you could make typography, of a kind, with it.\n\n"
    },
    {
      "time": "27 Jan 2013 — 10:03am",
      "content": "What they said.\n\nRelated:  \n [http://typophile.com/node/20111](http://web.archive.org/web/20140713205652/http:/typophile.com/node/20111 \"http://typophile.com/node/20111\")\n\nhhp\n\n"
    },
    {
      "time": "27 Jan 2013 — 10:43am",
      "content": "When I ﬁrst started teaching type design at York University, about 10 years ago, it was rather open-ended, meaning that students came up with their own ideas for typefaces—and this method (photo-found letter forms) was used by several to kick-start their projects, generally because they weren’t inspired directly by the world of type, not because of any Sagmeister inﬂuence.\n\n"
    },
    {
      "time": "28 Jan 2013 — 10:48pm",
      "content": "Very true, maybe I chose the wrong words to describe the project. I like the way you put it as a filter through which to see the world. It's a good filter, wouldn't you agree? While I do love letterforms that are traditional, this exercise is just to keep my mind open to the possibilities. I do like the inspiration it's been garnishing. In the right context, these found letterforms could work.\n\n"
    }
  ]
}
