{
  "id": "100068",
  "title": "Lombard Condensed Heavy",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hello Typophiles, its been a while since I have posted on here.\n\nThis is the first time I have seriously tried to design a font, I'm 20 and a student, previously I have flirted half-heartedly or edited existing faces. So I would really appreciate some feedback (please be gentle, this is my first time at the rodeo).\n\nThe working title for this font is Lombard, but I have a feeling I am going to change it. I was inspired by a pair of unique street signs in my home town of Wellington, but through further development I found myself looking at the type used in the Tintin magazines of my childhood. I can also definitively say Colophone's incredible [Raisonne](http://web.archive.org/web/20150416032432/http:/www.colophon-foundry.org/fonts/raisonne/about-font) and [Grilli Type's entire catalogue](http://web.archive.org/web/20150416032432/http:/www.grillitype.com/) were guiding hands as to the boundaries between feature and distraction.\n\nI am placing this post in the Display section, for obvious reasons. I position this as an interesting alternative to the many condensed slabs that people use perhaps a little too often these days.\n\nOverall I'm quite happy with the result, but I know that there is a fair amount of work left to do; small caps, a lighter weight and perhaps an outlined version is in order I think.\n\nPlease let me know what you think, dying to hear.\n\n ![](http://web.archive.org/web/20150416032432im_/http:/typophile.com/files/lombard_12_6170.gif)\n  \n\n ![](http://web.archive.org/web/20150416032432im_/http:/typophile.com/files/lombard_11_4857.gif)\n  \n\n ![](http://web.archive.org/web/20150416032432im_/http:/typophile.com/files/lombard-head_3427.gif)\n  \n\n ![](http://web.archive.org/web/20150416032432im_/http:/typophile.com/files/lombard-head2_3848.gif)\n  \n\n ![](http://web.archive.org/web/20150416032432im_/http:/typophile.com/files/lombard_8_3942.gif)\n  \n\n ![](http://web.archive.org/web/20150416032432im_/http:/typophile.com/files/lombard_7_5020.gif)\n  \n\n ![](http://web.archive.org/web/20150416032432im_/http:/typophile.com/files/lombard_6_4818.gif)\n  \n\n ![](http://web.archive.org/web/20150416032432im_/http:/typophile.com/files/lombard_5_4222.gif)\n  \n\n ![](http://web.archive.org/web/20150416032432im_/http:/typophile.com/files/lombard_4_4456.gif)\n  \n\n ![](http://web.archive.org/web/20150416032432im_/http:/typophile.com/files/lombard_3_4724.gif)\n  \n\n ![](http://web.archive.org/web/20150416032432im_/http:/typophile.com/files/lombard_2_5538.gif)\n  \n\n ![](http://web.archive.org/web/20150416032432im_/http:/typophile.com/files/lombard_1_3451.gif)\n\n",
  "author": "hello seb",
  "time": "25 Jan 2013 — 10:28pm",
  "uid": "76609",
  "comments": [
    {
      "time": "20 Mar 2013 — 11:46am",
      "content": "I'm not sure if you are still looking for a critique, but here is mine.\n\nAt first glance the font didn't impress me, but the more I looked at it the more I liked it. I like that the K is so much wider than the R and P, and that the bottom of the R sticks out further than the top. I think that is what gives it it's quiet and simple charm. My only problem is the W, every time I read through your samples it stops me, it just seems to heavy. I don't know how to solve it, lucky for me that is the designers job.\n\nI wish my first font would have turned out this nice. I would really love to see the finished version.\n\n"
    },
    {
      "time": "25 Mar 2013 — 1:35pm",
      "content": "I like the playfulness of this. For some reason the 'A' stands out to me as not quite fitting. Not that there is any problem with the 'A', just that it does not have the same character as the other letters.\n\n"
    }
  ]
}
