{
  "id": "100186",
  "title": "Font for dissertation",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Forgive me if this question gets posted here all the time. I'm coming to the end of my dissertation for a DMA (Doctorate of Musical Arts), and it has come to my attention recently that apparently only squares and idiots use Times New Roman ever ever ever. I'd like to not be a square or idiot, but I also need something that (even I know this phrase is heard too often) \"looks like Times New Roman.\" I.e. conservative, serif, doesn't draw attention to itself. Doesn't look clever or pretentious. I'd love to use Garamond, especially given that my dissertation is about a 1627 piece of music, but its italic Qs give me pause.\n\nFurther, I'd like to not just be novel, but readable, especially on screen, since if anybody eventually reads this dissertation it will probably be electronically.\n\nThanks for your time!\n\n",
  "author": "AbdiViklas",
  "time": "29 Jan 2013 — 7:41pm",
  "uid": "208016",
  "comments": [
    {
      "time": "29 Jan 2013 — 8:28pm",
      "content": "Free for non-commercial use:  \n [http://www.brill.com/author-gateway/brill-fonts](http://web.archive.org/web/20130819161622/http:/www.brill.com/author-gateway/brill-fonts \"http://www.brill.com/author-gateway/brill-fonts\")\n\nWhat's the music?\n\n"
    },
    {
      "time": "29 Jan 2013 — 9:43pm",
      "content": "> apparently only squares and idiots use Times New Roman ever ever ever.\n\nMusic to our ears! :-)  \nTo be fair though, you could do worse than Times. Although it's still rarely a very good choice.\n\nIf the Italic \"Q\" in your Garamond (which one is it?) is the main thing bothering you, you can always have it modified to suit your taste.\n\nhhp\n\n"
    },
    {
      "time": "29 Jan 2013 — 9:16pm",
      "content": "The piece is Carlo Farina's _Capriccio Stravagante_, which uses violin-family instruments to imitate things like trumpets, shawms, hurdy-gurdies, cats and dogs.\n\nI should also mention that the official formatting instructions, while leaving it open to \"an appropriate typeface,\" also specify margins of 1.5 inch top and 1.5 left (1 right and bottom), which makes for a narrower than usual page, and \"a 10 pt minimum for the text.\" Right now I'm using 11 pt for body and 10 pt for footnotes.\n\nAlso that of course free is good, and that I've tried Lido STF, and for whatever reason it just does not render well on my screen at 11 pt and 88% document size! Near illegible.\n\nMy Garamond just says \"Garamond.\" It's not something I paid for, so either standard with Win 7 or Office Pro 2010. It's not the italic Q _per se_, though that's what I noticed most. It's just that I don't want anybody saying, \"Hey, this isn't TNR, is it?\" Plus, although I'm a sucker for extremely overt faces (as an early music person I make heavy use of Chapbook), for my money Garamond isn't as screen-friendly as TNR. Oh, and maybe it's just because I used it a lot in undergrad, but for some reason Palatino feels amateurish to me.\n\nThanks for the Brill tip; I'll try that out.\n\n"
    },
    {
      "time": "29 Jan 2013 — 9:28pm",
      "content": "Actually Garamond sounds too staid for the music you describe... Maybe a Fleischmann would be better, although it would be hard to translate its eclecticism to the screen.\n\nBTW a measure of 7\" might be narrower that we're (sadly) used to seeing on a letter-size page, but it's not narrow in terms of good readability; in fact at 10 point it's probably too wide (so it's good you're using 11 - you could even go to 12 with something like Baskerville).\n\nPalatino: part of its problem is the x-height being too big - it's really not a bona fide text face. Try Aldus, its more bookish sister.\n\nBut let me understand: you want something that can be mistaken for Time, but isn't Times?\n\nhhp\n\n"
    },
    {
      "time": "29 Jan 2013 — 9:37pm",
      "content": "Yes, basically. Something that would cause a non-type-oriented reader not to say, \"Hey, what weird font is this? Is he trying to be cute?\" but just to subconsciously think, \"Gee, nice and readable.\" What I use for the Powerpoint in my oral defense is another matter!\n\n"
    },
    {
      "time": "29 Jan 2013 — 10:37pm",
      "content": "You have to be mindful of not engaging in design for its own sake: changing the font just so you can semi-privately gloat that you changed the font... Whatever typeface you choose, there has to be a rational reason why it's better than Times, even if confusability with Times is indeed a desirable parameter.\n\nThat said, most laymen are shockingly insensitive to differences in fonts that we consider chasmic, at least consciously. I always fondly remember the story of the test subject in a legibility study being asked to compare Georgia to some other serif font, and saying something like \"This Times looks bigger than that Times.\" :-)\n\nAnd this can extend beyond laymen as well. I remember the first time I made a high-quality output of my Patria\\* at a service bureau, I eagerly asked the owner what she thought of it: she felt a little bit put on the spot, because she confessed to thinking it wasn't much different than Times... And I almost hugged her, because that's exactly the sort of _conscious_ evaluation a text face designer wants to hear.\n\n\\* [http://themicrofoundry.com/ad/CR.pdf](http://web.archive.org/web/20130819161622/http:/themicrofoundry.com/ad/CR.pdf \"http://themicrofoundry.com/ad/CR.pdf\")\n\nErgo: You have more freedom on this than you might think.\n\nhhp\n\n"
    },
    {
      "time": "30 Jan 2013 — 5:54am",
      "content": "Andy, I used to run the recording studio at the Biddle Music Building. I doubt there is anyone left in the department I knew -- or vice versa -- but if you want, I'll give you a hand with your type.\n\nNot going to put our phone number on the web, but call Amy Ruth Ruchanan at Duke Press. The press's number should be in your Duke phone directory. She'll give you our number, and you can check my <cite>bona fides</cite> if you want.\n\nCharles Ellertson\n\n"
    },
    {
      "time": "30 Jan 2013 — 8:32am",
      "content": "How about that! I grew up in that building and teach there now. However, my degree is coming from UNCG. I'm honored by your input; a little Googling turns up _bona fides_ enough.\n\nIncidentally, there's a small section in this dissertation about seventeenth-century letterpress printing, although it's about the printing of music. Specifically how cutting-edge musical techniques pushed printers' abilities to represent practice in print. The printer in this case wound up hand-inking some notes because he wasn't equipped to print two pitches \"stacked\" on one staff (\"double stops\"). A Venetian contemporary managed it with a couple of other composers, but he seemed to be financially comfortable, because he cut entirely new characters for the occasion.\n\n"
    },
    {
      "time": "30 Jan 2013 — 11:43am",
      "content": "Actually, I go back to the old music building -- Asbury, wasn't it? Frank Tirro was chairman at the time, and Giorgio was first violin in the Ciompi Quartet....\n\nAnyway. If the the Brill fonts that John Hudson mentioned seem to meet all your needs & desires, I think it would be a good font family. Because of both its newness & license (most everything I do would be considered commercial), I've not used it. Without use, all that's left is one's eye.\n\nIf you'd like something with a more Venetian flavor, I can maybe help. Things I'd rather not post on Typophile, because of issues like \"why didn't you mention this one\" rather than \"that's no good.\" Harder to recommend something you haven't used.\n\nI've also been know to cut the odd character or two if that's needed. Anyway, I extend the offer. It's a case of \"willing,\" not \"want,\" so it's up to you. & if you do want, Amy will give you my phone number -- my personal number is unlisted, & I'd like to keep it that way. I guess you could look up Tseng Information Systems in the Durham phone book...\n\n"
    },
    {
      "time": "30 Jan 2013 — 11:52am",
      "content": "I printed out sample pages in several options I had at hand--Garamond, Georgia, Cambria, and PT Serif, and liked the latter best, though I'd still love to blend a little whimsy back in.\n\nActually, the region in question is Dresden. The piece is written by Carlo Farina, a Mantuan, who was employed in Dresden at the time, and was printed by one Gimel Bergen (a Jr.; his grandfather apparently set out to name his progeny after the entire Hebrew alphabet, but didn't get far). It occurs to me it could be fun to try to find something--at least for headers, perhaps--inspired by Bergen's typeface; it can be seen [here,](http://web.archive.org/web/20130819161622/http:/digital.slub-dresden.de/werkansicht/dlf/823/5/cache.off) with a few Roman words scattered among the Fraktur, or with lots of italics [on this page.](http://web.archive.org/web/20130819161622/http:/digital.slub-dresden.de/werkansicht/dlf/823/31/cache.off)\n\n"
    },
    {
      "time": "30 Jan 2013 — 12:20pm",
      "content": "I think you'd find John Hudson's Brill fonts have a little more \\*authority\\* than PT Serif. Nor would I mix whimsy in with the headers, as you call them. Not without some thought, anyway.\n\nA different tack would be something like Espinosa Nova\n\n[http://www.myfonts.com/fonts/estudio-ch/espinosa-nova/](http://web.archive.org/web/20130819161622/http:/www.myfonts.com/fonts/estudio-ch/espinosa-nova/ \"http://www.myfonts.com/fonts/estudio-ch/espinosa-nova/\")\n\n\\* \\* \\*\n\nBTW, last time I paid attention to dissertations, they essentially ended up on microfilm. When you say \"readable on the screen,\" I assume you're talking about PDF, and not EPUB, right?\n\n"
    },
    {
      "time": "30 Jan 2013 — 8:10pm",
      "content": "How about [Sabon](http://web.archive.org/web/20130819161622/http:/www.myfonts.com/fonts/linotype/sabon/)? In my experience it's very good as a \"not Times but not _too_ obviously different to a layman\" font.\n\nGiven that you've already expressed a liking for Garamond, it might be a good choice for you here. It's based on one of Garamond's types, but looks a little more business-like than certain others. It's also highly readable down to 10 point or so.\n\n(And its italic 'Q' is actually more similar to Times's than to Garamond's...)\n\n"
    },
    {
      "time": "2 Feb 2013 — 7:38pm",
      "content": "Some other possibilities: Linux Libertine (free), Gentium SIL (free), Lyon Text, Minion, Iowan OldStyle, and Whitman.\n\n"
    },
    {
      "time": "3 Feb 2013 — 6:14am",
      "content": "I heartily recommend Kris Sowersby's fantastic [Newzald](http://web.archive.org/web/20130819161622/http:/klim.co.nz/retail-fonts/newzald/), which I used for my dissertation at Reading and was a pleasure to use.\n\n"
    },
    {
      "time": "4 Feb 2013 — 10:59am",
      "content": "\\> only squares and idiots use Times New Roman\n\nI rarely use it myself, but I'm curious why it's so disliked. Overuse?\n\n"
    },
    {
      "time": "4 Feb 2013 — 1:09pm",
      "content": "[http://www.myfonts.com/fonts/storm/lido-stf/](http://web.archive.org/web/20130819161622/http:/www.myfonts.com/fonts/storm/lido-stf/ \"http://www.myfonts.com/fonts/storm/lido-stf/\")\n\n\"Times with a Human Face\".\n\nAnd it's free for personal use.\n\n"
    },
    {
      "time": "5 Feb 2013 — 3:34am",
      "content": "@JamesM – Almost certainly overuse, same reason as why Helvetica, Arial, Courier, Papyrus and Comic Sans get the noses-turn-up treatment, too.\n\nWhy? They were for a long time the standard load-out on MacOS and Windows computers. One serif font, one sans-serif, one monospace and one informal... oh, and no incentive to look for more. No wonder they got labelled as uncool and plebeian.\n\n"
    },
    {
      "time": "5 Feb 2013 — 8:43am",
      "content": "I would put Papyrus and especially Comic Sans in a separate \"special\" category... :-)\n\nhhp\n\n"
    },
    {
      "time": "7 Feb 2013 — 7:47am",
      "content": "For what is worth, I used Sabon for my dissertation. I was happy with the end result. I also used Gill Sans as a partner sans serif for the main headers and captions.\n\nAlthough, you would probably look for something you can actually download and use i.e. a free licence one? Check out font squirrel in that case: [http://www.fontsquirrel.com/fonts/list/style/Serif/50/](http://web.archive.org/web/20130819161622/http:/www.fontsquirrel.com/fonts/list/style/Serif/50/ \"http://www.fontsquirrel.com/fonts/list/style/Serif/50/\")  \nthere are a huge amount of 'silly' ones and ones unfit for proper body text typesetting, but worth a look.\n\n"
    },
    {
      "time": "11 Feb 2013 — 3:11am",
      "content": "\\> … you want something that can be mistaken for Time, but isn’t Times?  \n\\>\\> Yes, basically. Something that would cause a non-type-oriented reader not to say, “Hey…\n\nI find this very interesting. One wants to have it look “times-ish” because that look is what people are used to, yet on the other hand one wants to avoid the very typeface, because people are too much used to it. A nice paradoxon!  \n– I think that was quite the briefing Fr. Storm’s Lido was based on. And I think Lido is an excellent candidate here.  \nI follow this conversation because I happened to have thoughts of the kind myself. Some fellows may recall what I [showed here](http://web.archive.org/web/20130819161622/http:/typophile.com/node/95053) a half year ago. Andy, I’d be interested to learn wat you would think about a typeface like that.\n\n"
    },
    {
      "time": "11 Feb 2013 — 4:43am",
      "content": "–› [Concorde](http://web.archive.org/web/20130819161622/http:/www.myfonts.com/fonts/berthold/concorde-be/) by G. G. Lange.\n\n"
    },
    {
      "time": "12 Feb 2013 — 5:17am",
      "content": "I'm rather fond of Alegreya myself, but it may be a bit too \"pretty\" for a dissertation...?\n\n[http://www.fontsquirrel.com/fonts/alegreya](http://web.archive.org/web/20130819161622/http:/www.fontsquirrel.com/fonts/alegreya \"http://www.fontsquirrel.com/fonts/alegreya\")\n\n"
    },
    {
      "time": "12 Feb 2013 — 8:20am",
      "content": "Indeed. BTW the [semi-]official term is \"mannered\". :-)\n\nhhp\n\n"
    },
    {
      "time": "13 Feb 2013 — 4:28am",
      "content": "To me, Alegreya is a teller of sword&sorcery tales.\n\n"
    },
    {
      "time": "2 Mar 2013 — 7:08am",
      "content": "Sina Nova and Scala Sans are pretty neutral.  \n(not necessarily best for a dissertation on baroque music, though)\n\nYou could also consider ITC Mendoza (no small caps, though), Verdigris, or Merlo which are modern but based on older fonts.\n\n"
    },
    {
      "time": "1 Mar 2013 — 2:03pm",
      "content": "\"You could also consider ITC Mendoza\"... actually, the Opentype Std version does:  \n [http://www.fonts.com/font/itc/itc-mendoza-roman/complete-family-pack](http://web.archive.org/web/20130819161622/http:/www.fonts.com/font/itc/itc-mendoza-roman/complete-family-pack \"http://www.fonts.com/font/itc/itc-mendoza-roman/complete-family-pack\")\n\n"
    },
    {
      "time": "1 Mar 2013 — 4:44pm",
      "content": "I have not been able to find them in the \"private area\" and InDesign will not pull them with character style set to opentype small caps.\n\n"
    },
    {
      "time": "2 Mar 2013 — 11:24am",
      "content": "What version do you have? Where did you license it? Fonts.com has them in the opentype std version; check this page:  \n [http://www.fonts.com/font/itc/itc-mendoza-roman/complete-family-pack](http://web.archive.org/web/20130819161622/http:/www.fonts.com/font/itc/itc-mendoza-roman/complete-family-pack \"http://www.fonts.com/font/itc/itc-mendoza-roman/complete-family-pack\")  \n and as a separate cut here:  \n [http://www.fonts.com/font/itc/itc-mendoza-roman/book-sc/web-font](http://web.archive.org/web/20130819161622/http:/www.fonts.com/font/itc/itc-mendoza-roman/book-sc/web-font \"http://www.fonts.com/font/itc/itc-mendoza-roman/book-sc/web-font\")\n\nThe cut available at Adobe doesn't have them.\n\n"
    },
    {
      "time": "2 Mar 2013 — 5:21pm",
      "content": "Mine was bought from Adobe the end of last year. Maybe that is the problem. (they were opentype standard, so I assumed it was the same as from other sources). There are some other weird things about the Adobe version of the font (where it shows up in InDesign, Font Book, and Word) which are unconventional. But occasionally there are strange things in how OSX handles certain commercial fonts that are different from Windows.\n\nI just checked, and the price was the same as fonts.com. I guess this is another strike against Adobe. (not my favorite company anyway)\n\n"
    },
    {
      "time": "3 Mar 2013 — 4:20am",
      "content": "I suspect that the deficiencies in the Adobe version have to do with licensing issues. I get the impression that their agreements with ITC have changed.\n\nIn their defense, Adobe offers pdfs for their fonts which show the glyph complement. Caveat emptor!\n\n"
    },
    {
      "time": "3 Mar 2013 — 10:45am",
      "content": "I guess it was my fault for not checking closer, but I now know that fonts with the same name and price may be different on fonts.com, myfonts.com, fontfont.com, and adobe.com. Maybe all the Monotype sites might not have this issue, though.\n\nWarning to others: do not assume non Adobe fonts sold on Adobe's site with the same name and price as on Monotype owned sites will the the same font. It may be older and incomplete and if you do not check soon enough if the euro symbol, small caps, etc are complete, refunds will not be available.\n\n"
    },
    {
      "time": "6 Mar 2013 — 2:19am",
      "content": "> I suspect that the deficiencies in the Adobe version have to do with licensing issues.\n\nThe Adobe licensed versions of fonts for which they do not hold intellectual property rights, such as ITC Mendoza, remain fairly static within their collection, to the best of my knowledge. When licensing a font that has been sub-licensed by another foundry or developer, common practice during the heyday of Postscript in the late 80s, it is often worth doing some research around the available versions.\n\nA search for ITC Mendoza on MyFonts will bring up three distinct versions, ITC, Adobe and Monotype. The rights to most (if not all) ITC intellectual property now resides with Monotype and as such those two versions are effectively Monotype intellectual property and subject to update and change, whereas the Adobe version most likely has and will remain fairly static, and other than the update to OpenType is unlikely to have changed greatly since its Postscript Type 1 version.\n\n"
    }
  ]
}
