{
  "id": "100150",
  "title": "This is not a TypeID request",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Well, not really!  \nI stumbled across this lettering in a fifties advert:\n\n ![](http://web.archive.org/web/20150414043123im_/http:/typophile.com/files/sensitive_3986.JPG)\n  \nAs far as I know there are no digitizations of this style (House Industries' Studio Sable is similar). I want to make a font out of it, and was wondering if anybody knows of any lettering specimen where I might find a full alphabet of this style, or similar, to get a feel for how the other letters should look, rather than just expanding the charset myself by guesswork. I'm in Thailand so any physical book is going to be hard to get hold of. Maybe there's a flickr or other online resource that I've not been able to find? It won't be a straight revival, so even low res images would be helpful. I just want to get a feel of how it should look, then make it from scratch.  \nCheers,  \nDave \n",
  "author": "daverowland",
  "time": "28 Jan 2013 — 6:46pm",
  "uid": "44740",
  "comments": [
    {
      "time": "28 Jan 2013 — 7:49pm",
      "content": "If you haven't already, I would check fontbros dot com first to make sure they haven't done something similar in the Filmotype collection.\n\n"
    },
    {
      "time": "28 Jan 2013 — 8:02pm",
      "content": "The problem with hand lettering and research is there may not be a complete specimen of lettering you wish to digitize. Often lettering styles were handed down from a \"master\" (for lack of a better term) to apprentices with no formal specimen. Sometimes styles were the personal invention of the sign-writer cobbled together from pieces they picked up. Others were the adaptation of print letters to hand lettered brushwork. Some styles of lettering were completely regional. Worse, sign-writers could vary the letters from one basic format to produce cursive scripts, casuals (or money strokes), italics, or calligraphy on the fly. Each would have the same characteristics but with a different brush or treatment each would be a completely different font by modern standards. There are several books covering hand lettering available, Speed Ball, Atkinson, Becker, etc., but don't be surprised if you can't find this variation. The end result will generally be a collection of specimens and samples. From this you will build your font. Another possibility is to find an old sign painter or calligrapher to make a specimen and hope that he or she can duplicate this lettering.\n\nEven if you find a complete specimen, there is no way to copy it verbatim. Such demonstration specimens were meant as guides only. The artists were expected to adjust each character to fit the application. I've heard purest say that their font was a true representation of the font as presented in the specimen. This means that it is crap. Hand lettered specimens are not composed as iron clad rules but rather as guides. Stroke widths, x-heights, character width, etc. will look great as long as all you do is spell out the glyphs as originally rendered. Anything else will need correction.\n\nSo, good luck and good hunting. Please don't listen to me. There is probably a real expert around here somewhere who will completely refute everything I've written, and he or she is probably right. I only know from personal experience. I am still working on my script and I had a decent specimen.\n\nJames\n\n"
    },
    {
      "time": "28 Jan 2013 — 8:33pm",
      "content": "Yeah, I've looked through the Filmotype collection and Sudtipos Bluemlein collection. I don't think I'd be stepping on anyone's toes too much by digitizing this (as a font, not a perfect tracing of lettering!). I figured a near exact match in a lettering style guide would not exist; I was just after something close enough to help me deal with the typical problem letters like x, z, k and then maybe find something that could work as a matching upper case. I've gathered a collection of lettering styles (via Google image search) from 30s to 60s, and hopefully I'll have enough to do a kind of mash-up, but keep it a consistent looking face. I'm not into revivals, I just really like the feel of this sample. We'll see how it goes...\n\n"
    },
    {
      "time": "29 Jan 2013 — 9:05am",
      "content": "Sounds like you are on the right path. If you run into any serious problems, there are at least a couple of sign builder forums that still have sign painters involved. They might be able to come up with a good specimen. There are some excellent hand letterers on this sight, but they haven't chimed in yet. You may need to revise your post title to get their attention.\n\n"
    },
    {
      "time": "29 Jan 2013 — 10:04am",
      "content": "Then go for it! It is a nice style, well done; I like it.\n\n"
    },
    {
      "time": "7 Mar 2013 — 10:04pm",
      "content": "Hi Dave,\n\n> and was wondering if anybody knows of any lettering specimen where I might find a full alphabet of this style, or similar, to get a feel for how the other letters should look\n\nMaybe this can help, as the basic structure of the letters are quite similar....  \nScanned from the book called \"Scripts\" by Rand Holub, 1950. Keep in mind that Ale Paul already digitized it (and expanded by adding ligatures, swashes, etc, etc, etc...) as Hipster Script.  \n ![](http://web.archive.org/web/20150414043123im_/http:/f.cl.ly/items/2h1R3X330b0b1A3g1U0v/hipster-original.jpg)\n\nBTW: I love Pastiche Brush! (and Kwaktur too)!\n\n"
    },
    {
      "time": "29 Jan 2013 — 5:06pm",
      "content": "Another Scan:  \n ![](http://web.archive.org/web/20150414043123im_/http:/f.cl.ly/items/3H0Q19261L3T40373s3L/scan02-holub.jpg)\n\n"
    },
    {
      "time": "29 Jan 2013 — 5:46pm",
      "content": "Thanks, Pablo  \nThat's really helpful. I'd looked at Hipster Script already as a similar style. I think the sample I found has a more condensed and bolder feel, but these scans will be really useful in working out some basic letter shapes before seeing where the design goes. It was the g and y in the advert that got me liking it so much, so hopefully I can get a lot of the feel of those letters into the others. I think if I use these scans together with some samples I've already found for inspiration, I can make something new, which won't look like a Hipster Script rip-off.\n\n> and Kwaktur too\n\nThanks! That puts you in a very select group ;)\n\n"
    },
    {
      "time": "29 Jan 2013 — 6:13pm",
      "content": "-- Really off topic (probably), but if the typographic ex-pats in Thailand hang out in the same bar, look up Jim Wageman. Thinking on it, he could probably give you some hints with your current project...\n\n"
    },
    {
      "time": "29 Jan 2013 — 6:23pm",
      "content": "Thanks. I'll see what I can find out. I'm on Koh Samui so it's pretty unlikely any type people will be around here, but you never know. Would be good to meet some like minded people. If anyone else is ever in the area, you're welcome to pop round for a Chang!\n\n"
    },
    {
      "time": "29 Jan 2013 — 6:48pm",
      "content": "Make sure you're in Bangkok at the end of July, for the big Granshan non-Latin conference.\n\nhhp\n\n"
    },
    {
      "time": "29 Jan 2013 — 7:27pm",
      "content": "Yeah, I'll try and make it. Hopefully will have learnt some Thai by then!\n\n"
    },
    {
      "time": "7 Mar 2013 — 7:16pm",
      "content": "Dave, I've been looking at some others Zonite ads, and there is a big chance that they where handletterd by Holub himself.\n\n"
    },
    {
      "time": "7 Mar 2013 — 8:23pm",
      "content": "They certainly seem to have his signature style. This one's on the back burner for a while as I struggle with a sans family. I'm wondering if it's even worthwhile with Hipster Script already out there. I'll have a play around and see if I can come up with something different enough to warrant the effort (and not be subject to takedown requests from Sudtipos)\n\n"
    },
    {
      "time": "8 Mar 2013 — 12:35am",
      "content": "They can't complain as long as you don't use their digital outlines.  \nIf you use the original book scans as your source, everything is fine.\n\nDifferent people can do their own version of the same source material.  \nA recent sample of this are Medusa\\* and Bellisima Script\\*\\*, both independent digitization based on the same Stirling's book, released with only a few weeks of difference.  \nAnd each one added his own vision to Stirling's calligraphy. Ale added a lot of crazy swashes and sing-painter's style alternates, while Ramiro added perfect connecting letters, wonderful decorative caps and a useful smallcaps companion.\n\n\\* Medusa: [http://typophile.com/node/101122](http://web.archive.org/web/20150414043123/http:/typophile.com/node/101122 \"http://typophile.com/node/101122\")  \n\\*\\* Bellisima Script: [http://typophile.com/node/99939](http://web.archive.org/web/20150414043123/http:/typophile.com/node/99939 \"http://typophile.com/node/99939\")\n\nOthers samples will be all the different digital incarnations of Garamonds, Caslons, Baskervilles, Bodonis, Didots, Clarendons, etc... Recent Caslons, for example, are FB Williams Caslon Text and DaMa Kings Caslon\n\n"
    },
    {
      "time": "7 Mar 2013 — 11:02pm",
      "content": "But is the original now \"ownerless\"?\n\nNobody might complain, but it might still be shady.\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 5:04am",
      "content": "> But is the original now \"ownerless\"?\n\nThe original sources have become public domain. Now the entire world population is the \"owner\".  \nFoundries can claim ownership of his own digital version, but not on the original source design. And anyone can make a new version if its based on the source material.\n\n> Nobody might complain, but it might still be shady.\n\nAre you referring to Holub, Stirling, Garamonds, Caslons, Baskervilles, Bodonis or Didots?\n\nAlso, why shady? Not at all.  \nIf someone does a revival, why would you deny the same possibility to everyone else? No ones gets to get exclusivity on public domain revivals. If you want to get exclusivity, you should do something completely new instead.\n\nPersonally, I welcome diversity and I like very much that there are a lot of different version of each revival. So you can choose, for example, the Caslon or the Baskerville that best fit your taste or your intended use, or the one that gives you best results under different printing methods, or the one that renders best on the screen, etc...\n\n"
    },
    {
      "time": "8 Mar 2013 — 6:51am",
      "content": "I'm referring to anybody who had a hand in making something. But I admit there's a usefulness to things going into the public domain eventually.\n\nShady: what I was saying is that a person not hearing complaints about something he did doesn't make it OK.\n\n> why would you deny the same possibility to everyone else?\n\nI didn't mean that - I was thinking _all_ of them might be shady (but I'm pretty sure they're not).\n\nBTW, I welcome diversity very much. Like not making revivals. :-)\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 8:15am",
      "content": "> Shady: what I was saying is that a person not hearing complaints about something he did doesn't make it OK.\n\nSorry, I didn't fully understand the meaning of this part of your comment. Can you expand/clarify?\n\n"
    },
    {
      "time": "8 Mar 2013 — 8:34am",
      "content": "Let's say you make a revival of a font that's not in the public domain (which you might or might not realize) and the people who still have rights to the design don't notice, so they don't complain. It's still not OK. This often happens when the guy who made the font is dead/dying and his heirs/agents -who are accountants and waiters- do not follow the type design scene.\n\nRichard at P22 for example makes it a point to pursue potential rightful owners of fonts he'd like to revive before; he tells me they often say \"thanks for asking - go ahead - don't even worry about paying us anything\" - but of course that doesn't make his desire for correctness less honorable.\n\nIs Cancelleresca Bastarda in the public domain?\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 9:32am",
      "content": "> Let's say you make a revival of a font that's not in the public domain (which you might or might not realize) and the people who still have rights to the design don't notice, so they don't complain. It's still not OK. This often happens when the guy who made the font is dead/dying and his heirs/agents -who are accountants and waiters- do not follow the type design scene.\n\nWe agree. But Holub drawings are certainly on the public domain. They are form USA 1950, and in USA the Copyright is for 25 years only.\n\n> Richard at P22 for example makes it a point to pursue potential rightful owners of fonts he'd like to revive before; he tells me they often say \"thanks for asking - go ahead - don't even worry about paying us anything\" - but of course that doesn't make his desire for correctness less honorable.\n\nWe also agree here too\n\n> Is Cancelleresca Bastarda in the public domain?\n\nGood question on a very interesting topic :)  \nI think it is. Other people think it's not. Each one has different arguments, so it's not entirely clear yet.\n\n"
    },
    {
      "time": "8 Mar 2013 — 9:36am",
      "content": "That's OK as long as anybody making a CB revival is duly diligent in arriving at a tenable position. It's an honorable thing to avoid the easy way out.\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 9:41am",
      "content": "We agree on that too\n\n"
    },
    {
      "time": "8 Mar 2013 — 10:59am",
      "content": "<cite>But Holub drawings are certainly on the public domain. They are form USA 1950, and in USA the Copyright is for 25 years only.</cite>\n\nNot true. In 1978 and 1998 the copyright act was amended.  \nSee: [http://www.copyright.gov/help/faq/faq-duration.html](http://web.archive.org/web/20150414043123/http:/www.copyright.gov/help/faq/faq-duration.html \"http://www.copyright.gov/help/faq/faq-duration.html\") and [http://en.wikipedia.org/wiki/Copyright\\_Term\\_Extension\\_Act](http://web.archive.org/web/20150414043123/http:/en.wikipedia.org/wiki/Copyright_Term_Extension_Act \"http://en.wikipedia.org/wiki/Copyright\\_Term\\_Extension\\_Act\")\n\n"
    },
    {
      "time": "8 Mar 2013 — 11:51am",
      "content": "There you go. \"Clouds rolling in, with a chance of shadiness.\"\n\nSo, and actually to me in any case: contact Holub's heirs/estate for an OK.\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 4:41pm",
      "content": "So, hypothetically speaking, Holub heirs (if they exist) would be in position to claim copyright over Hipster and Feel Script?\n\n"
    },
    {
      "time": "8 Mar 2013 — 5:02pm",
      "content": "I guess so. But it's possible Paul already has their OK. Or he did some research and concluded that it's an acceptable risk, and in the worst case he might have to share the profits in the future. For some people it's just a business decision.\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2013 — 11:38am",
      "content": "What jurisdiction would a US court have on a Argentine citizen?\n\nNot a challenge, just a question.\n\n"
    },
    {
      "time": "11 Mar 2013 — 11:44am",
      "content": "Countries have all kinds of mutual agreements\\* including involving copyright. Plus I assume sales of offending products can be barred on home soil (although in this age that's a pretty neutered thing). Venezuela, different story. :-)\n\n\\* Like when I get a royalty payment from Linotype the US income tax is already taken out! :-/\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2013 — 12:06pm",
      "content": "I'm certain that the heirs could embargo payments from Myfonts or other US based distributors to Ale, but what about damages? I doubt they could do much about that.\n\nI believe I read somewhere that that royalties paid to non-us citizens have 30% US tax withheld, but you can file to have it released(?)\n\nAll hypothetical anyhow.\n\n"
    }
  ]
}
