{
  "id": "100137",
  "title": "Walleye: My new multilingual, multifeatured, all-original text font",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hello, everyone—\n\nI'm happy to announce now that Walleye, the culmination of over two years of (often intense) effort, is finally finished and available to buy! You can find it at [MyFonts](http://web.archive.org/web/20150415050203/http:/www.myfonts.com/fonts/looseleaf-fonts/walleye/) or [Veer](http://web.archive.org/web/20150415050203/http:/marketplace.veer.com/font/Walleye-Volume-CTT0000654).\n\n ![](http://web.archive.org/web/20150415050203im_/http:/typophile.com/files/WalleyePoster1_6006.png)\n\nI've put everything into this font that I thought I could legitimately make. Walleye supports the Latin, Cyrillic, and polytonic Greek alphabets, and includes a full complement of small caps for each of them. Combined, these alphabets support nearly all languages of Europe, as well as many from outside it, such as Mongolian and Lushootseed. Besides standard ligatures, there are **special forms** to prevent (or gracefully manage) collisions between pairs like `f”`, `(j`, and `gj`. There are all the **local features** (such as for Romanian) that are needed for graceful display of sometimes neglected languages. Walleye also has case variants for punctuation.\n\n**Numerals** are also full-featured: both lining and old-style figures are available in monowidth and proportional variants, and super- and subscripts and on-the-fly fractions are available.\n\nIn **Cyrillic,** there are alternate forms for the preferred Serbian shapes of letters. The **Greek** is worth a bit of special attention. It has enough different display options to satisfy even a demanding classicist. And moreover, the design of the letters is a unique contemporary take on the old-fashioned calligraphic style of Greek fonts that was used everywhere until (often ugly) Latinized, \"modern\" alphabets began getting popular around the beginning of computer typesetting.\n\nI also think, and I hope you do too, that the **design** itself is no boring slouch. It's a friendly and entirely original design that doesn't try to fit in with any particular historical predecessors; it gets a lot of its character through luxuriously long scroll-shaped terminals and faceted shaping of round bowls. I've also made an effort to unclutter the design for easy reading by simplifying shapes like `a`, `k`, and `s` that would otherwise be crowded with serifs or finials.\n\nCheck it out—and I hope you enjoy it!\n\n",
  "author": "Number3Pencils",
  "time": "28 Jan 2013 — 11:30am",
  "uid": "7642",
  "comments": [
    {
      "time": "28 Jan 2013 — 12:04pm",
      "content": "Congrats on the herculean effort. A crisp beauty.\n\nhhp\n\n"
    },
    {
      "time": "28 Jan 2013 — 12:23pm",
      "content": "Congrats! Good to see this released.  \nI really appreciate the originality of this. I especially like the roman /b/s, italic /k/s, all the /c/s, and italic /Vv/ through /Zz/.  \nI find the spacing and color of the regular weights more satisfying than the bold.  \nGood luck with it!\n\n"
    },
    {
      "time": "28 Jan 2013 — 5:16pm",
      "content": "You should fill in some tags at MyFonts or people will not be able to search for it ;)  \nI agree with Craig, the bold italic especially looks too loosely spaced, but maybe it looks better at text sizes. Overall, it's very nice. Good luck with it!\n\n"
    },
    {
      "time": "28 Jan 2013 — 8:35pm",
      "content": "Thanks, guys! And Dave, thanks for the tip on tags. I'm new using MyFonts—it's my first font with them.\n\nSorry the bold weights aren't pleasing everyone. I believe I did my best, but I suppose since bolds are farther afield from my original inspirations, maybe they lose something in traveling into the new weight bracket. But I'm glad to hear that the regular weights are striking a chord. (I never thought of the /b/ as being particularly remarkable, but maybe I wasn't giving it enough credit!)\n\n"
    }
  ]
}
