{
  "id": "100118",
  "title": "type foundries in the beginning of print",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "Renaissance",
    "type foundries"
  ],
  "content": "I'm currently working on an essays about the christian Hebrew typographer named Guillaume Le Be from the 16th century, and i want to elaborate about the profession of type design and type foundries. As i understood, the first type designers were craftsmen, often jewelers who were commissioned to create the letters by the printers/publishers. Then, in some point in history, type foundries were created and supplied type for the printers.\n\nWhat i need is a good online source which i can cite and reference, dealing with this transition from sole craftsmanship to the commercial type foundry.\n\n",
  "author": "Yaronimus-Maximus",
  "time": "27 Jan 2013 — 8:31pm",
  "uid": "9203",
  "comments": [
    {
      "time": "28 Jan 2013 — 4:50pm",
      "content": "Whenever a process which previously requires craftsmanship can be mechanized, it generally has been: it's called Industrial Capitalism. Scottish weavers fiercely resisted the Industrial Revolution as long as they could, but the cheaper prices brought about by mass production did them in. Doubtless, the process of founding type followed a similar arc…\n\n"
    },
    {
      "time": "28 Jan 2013 — 5:19pm",
      "content": "If you don't find an online source, take an offline source, put it on your own site, and refer to it. :-)\n\nhhp\n\n"
    },
    {
      "time": "28 Jan 2013 — 5:56pm",
      "content": "Printing was from the beginning mass production for sale. It was the first industrial production.\n\n"
    },
    {
      "time": "28 Jan 2013 — 8:08pm",
      "content": "Nick, the industrial capitalism phase of type making -- i.e. the period in which the means of type production are owned by people whose engagement in the enterprise is wholly financial and not enacted in labour -- didn't really come about until the 19th Century. In the 18th Century, one can see the end of the transition from the itinerant craft tradition of the renaissance and early baroque periods to that of foundries. One could say that the distinction is between the punchcutter travelling to the customer and the type travelling to the customer. But unlike, say, the introduction of mechanised weaving, the early foundries tended to be established by punchcutters, sometimes in partnership with publishers who had been their customers, or with other financial investment. So, for example, if you look at the Dutch punchcutters of the 18th Century, such as Fleischmann, you see him first working as a punchcutter for publishers and for other type founders, and then setting up his own type foundry.  \n\\_\\_\\_\\_\\_\n\nBill, how are you defining 'industrial production'? Is 'mass production' in itself a sufficient criterion, or is the method of production to be considered also? Or some ratio of the quantity of production to the quantity of labour?\n\nSetting type, even by hand, and printing books on a wooden handpress is surely more efficient than having scribes produce individual copies, but in terms of production it seems to me on a level with producing cloth on a handloom: more efficient than knitting, but not really industrial.\n\n"
    },
    {
      "time": "29 Jan 2013 — 8:25am",
      "content": "yes hrant, of course, you are right.  \nbut i was afraid that i would not find a good source about this in israel. not that there aren't books, libraries, etc here, it's just that you might recommend on something i can't reach. therefor i asked for an online source.\n\nbut if you kind folks have some book or an essay about this, and you are willing to scan some of it, i would be thankful :)\n\n"
    },
    {
      "time": "29 Jan 2013 — 8:25am",
      "content": "how do you flag spammers here?\n\n"
    },
    {
      "time": "29 Jan 2013 — 8:35am",
      "content": "hi John Hudson.  \nhave you any good online/offline source about this?\n\nbtw i have read that garamond had his type foundry (am i right?),  \nalso Guillaume le be (which was his successor).  \ni am still unsure about the notion of type foundry versus the craftsman in the renaissance, because i lack a good source. i understood that type was used and sold and resold. Famous printer Christof Plantin bought 21 fonts (i.e. metal sets of letters) in 1555 and brought them to Antwerp in order to open his print house -\"the golden compass\". that may show that type was still rare at that time, and often re-used for long periods.\n\nthat was quite common with hebrew types that were even rarer and used until the letters crumbled.\n\n"
    },
    {
      "time": "29 Jan 2013 — 8:38am",
      "content": "> how do you flag spammers here?\n\nWith a white flag? :-/\n\nhhp\n\n"
    },
    {
      "time": "29 Jan 2013 — 10:18am",
      "content": "William,\n\nI would argue that printing was the first mass **medium** ; however, as John Hudson pointed out, the capitalists didn’t get involved in type founding as early as they did with other enterprises. Most likely, there wasn’t enough demand until more of the population became literate: people who can’t read aren’t likely to buy too many books…\n\n"
    },
    {
      "time": "29 Jan 2013 — 11:07am",
      "content": "William, the Arsenale in Venice was an earlier example of industrial production, an assembly line for boats.\n\nKilns were an ancient form of industrial production, with bricks pressed in wooden forms being the uniform mass-produced object—although hand-turned amphorae were consistent in size and shape.\n\nPottery perhaps preceded salt making in industrial production, as ceramic bowls were required to reduce the salt. Solnitsata, the oldest town in Europe, was founded on the production of salt 6,000 years ago. I don’t know whether there was a standard form for salt cake distribution, as there was later with the sugar loaf.\n\nAnd of course monetary coins were an early form of standardized industrial production.\n\n"
    },
    {
      "time": "29 Jan 2013 — 11:10am",
      "content": "[_The Scythe and the Rabbit_](http://web.archive.org/web/20150414190701/http:/ritpress.rit.edu/publications/books/scythe-and-rabbit-simon-de-colines-and-culture-book-renaissance-paris.html)  \nThis new book, a collection of essays on Simon de Colines by Kay Amert, edited by Robert Bringhurst, is vert good on the development of type casting and printing in renaissance Paris, and includes quite a lot about Le Be's famous 'Memorandum', a kind of memoir of the Parisian typographic scene in the early 16th Century.\n\nThe massive Enchedé/Carter _Typefoundries in the Netherlands_ book provides a very good insight into the kinds of relationships that existed between punchcutters, printer publishers and foundries from the 16th to the 18th Centuries.\n\n"
    },
    {
      "time": "29 Jan 2013 — 2:18pm",
      "content": "John, Nick, I confess I don't know the history. But printing does seem to be significantly different from most crafts in terms of standardized ingredients, specialization of individual jobs, and mass distribution of products. Also I'm wondering if Venice quickly becoming the center for printing had anything to do with the rise of capitalism, as if I remember correctly Venice was a pioneer in that as well.\n\n"
    },
    {
      "time": "29 Jan 2013 — 2:32pm",
      "content": "One thing I learned (or maybe re-learned) from Lane's \"The diaspora of Armenian Printing, 1512-2012\"\\* is that Venice was the destination of refugees from the sack of Mainz (the cradle of Western printing). Why they ended up going there though I have no idea.\n\n\\* [http://www.oakknoll.com/detail.php?d\\_booknr=109505](http://web.archive.org/web/20150414190701/http:/www.oakknoll.com/detail.php?d_booknr=109505 \"http://www.oakknoll.com/detail.php?d\\_booknr=109505\")\n\nAlso, I just found this:  \n [http://www.library.manchester.ac.uk/firstimpressions/Spread-of-Print-thr...](http://web.archive.org/web/20150414190701/http:/www.library.manchester.ac.uk/firstimpressions/Spread-of-Print-through-Europe/ \"http://www.library.manchester.ac.uk/firstimpressions/Spread-of-Print-through-Europe/\")\n\nhhp\n\n"
    },
    {
      "time": "29 Jan 2013 — 2:41pm",
      "content": "John,  \nthank you very much.  \ni know Bringhurst from the massive \"the elements of typographic style v3.0\".  \nso this book is surely comprehensive.\n\n"
    },
    {
      "time": "29 Jan 2013 — 2:52pm",
      "content": "if i recall correctly,  \nfrom my history studies of the time of the pre - french revolution (which is about two centuries after the 16th century), especially what i read in hobsbaum's book, most of the \"industries\" were more like workshops, not the heavy industries we know from the 19th century onwards. it doesn't mean that there were not massive undertakings, but usually these escapades were directed from the rulers, not by manufacturers of the market.\n\nhowever i also know that Christoff Plantin hired 200 workers in order to print the polyglot bible. so he must have been quite busy.\n\nabout 4000 hebrew books were printed alone in the 16th century. this is certainly not the \"industry\" of the modern times onwards, so our question is dealing with the definition of industrialism.\n\n"
    },
    {
      "time": "29 Jan 2013 — 3:05pm",
      "content": "from wiki,  \n [http://en.wikipedia.org/wiki/Industrial\\_capitalism#Industrialism](http://web.archive.org/web/20150414190701/http:/en.wikipedia.org/wiki/Industrial_capitalism#Industrialism \"http://en.wikipedia.org/wiki/Industrial\\_capitalism#Industrialism\")\n\n-Mercantilism-\n\nThe period between the sixteenth and eighteenth centuries is commonly described as mercantilism. This period, the Age of Discovery, was associated with geographic exploration being exploited by merchant overseas traders, especially from England and the Low Countries; the European colonization of the Americas; and the rapid growth in overseas trade. Mercantilism was a system of trade for profit, although commodities were still largely produced by non-capitalist production methods.\n\nWhile some scholars see mercantilism as the earliest stage of capitalism, others argue that capitalism did not emerge until later.\n\n"
    },
    {
      "time": "29 Jan 2013 — 3:08pm",
      "content": "Nick, was the assembly line for boats a commercial business, or created by the government/military.  \ncorrect me if i'm wrong, but it's one thing for a singular or governmental phenomenon - such as these are old as the pyramids and earlier.  \nit's another thing for a recurring phenomenon powered by private market.\n\n"
    },
    {
      "time": "29 Jan 2013 — 3:31pm",
      "content": "_While some scholars see mercantilism as the earliest stage of capitalism, others argue that capitalism did not emerge until later._\n\nIn either case, a useful distinction can still be made between mercantile capitalism (or proto-capitalism) and industrial capitalism. One is centred on a market of manufactured goods; the other is centred on a market of capital goods. The latter is formalised in the modern stock market system, in which it becomes the norm for the people who own shares in the means of manufacture to be completely uninvolved in the process of manufacture, even in a managerial role. When this model is applied to banking, it leads to the third phase: finance capitalism, which is centred on a market of debt.\n\n"
    },
    {
      "time": "30 Jan 2013 — 4:54am",
      "content": "The only real difference between Mercantilism and Capitalism is the _means_ by which small groups of individuals accumulate massive amounts of wealth; likewise, shipbuilding served both commercial and political ends, although—as the history of the East India Company reveals—there really is precious little difference between the two…\n\n"
    },
    {
      "time": "29 Jan 2013 — 8:13pm",
      "content": "Very interesting numbers in the [Wikipedia article on the printing press](http://web.archive.org/web/20150414190701/http:/en.wikipedia.org/wiki/Printing_press#Mass_production_and_spread_of_printed_books):\n\n\"By 1500, the printing presses in operation throughout Western Europe had already produced more than twenty million copies. In the following century, their output rose tenfold to an estimated 150 to 200 million copies.\n\n\"European printing presses of around 1600 were capable of producing 3,600 impressions per workday. By comparison, movable type printing in the Far East, which did not know presses and was solely done by manually rubbing the back of the paper to the page, did not exceed an output of forty pages per day.\"\n\nThis confirms my feeling that printing was mass production on a scale never seen in history. It was hand powered until the 19th century, but the specialization and mass production were similar to what energy-powered manufactures were, and must have been a model for it.\n\n"
    },
    {
      "time": "30 Jan 2013 — 4:59am",
      "content": "quite impressive, William.\n\n"
    },
    {
      "time": "30 Jan 2013 — 6:18am",
      "content": "> \"did not exceed an output of forty pages per day.\"\n\n\"... at the hands of a conjoined twin, during a famine.\"\n\nDon't believe everything you read.\n\nhhp\n\n"
    },
    {
      "time": "30 Jan 2013 — 6:50am",
      "content": "> i understood that type was used and sold and resold. Famous printer Christof Plantin bought 21 fonts (i.e. metal sets of letters) in 1555 and brought them to Antwerp in order to open his print house -\"the golden compass\". that may show that type was still rare at that time, and often re-used for long periods.\n\nThere seems to be some confusion about this 'trading'… What Plantin bought were sets of matrices, eg the base needed for casting type (it is more complicated than stated here; the process could result in multiple matrices — Smeijers's Counterpunch is an enlightening book on this matter).\n\nThe Enschedé story is similar: they acquired matrices from various sources during an extended period.\n\n"
    },
    {
      "time": "30 Jan 2013 — 7:58am",
      "content": "Just thinking about it, I'm pretty sure that the mass production of coins much earlier, in Europe and Asia, and also of ceramics in China was on the scale of printing, in the millions. One of the features of industrial production that is pointed to is the production of identical parts, to be assembled later. That is a feature of type, so maybe that is an innovation (of the Chinese). The history of mass production looks pretty interesting, but I haven't read anything on it.\n\n"
    },
    {
      "time": "30 Jan 2013 — 9:35am",
      "content": "_Nick, was the assembly line for boats a commercial business, or created by the government/military._\n\nThe Arsenale was run by the state, but produced boats for both the navy and merchants.  \nNo doubt Venice’s ruling class proﬁted from it.  \nA military-industrial complex that could be compared with those of today, such as Boeing.\n\n"
    },
    {
      "time": "30 Jan 2013 — 3:09pm",
      "content": "William,\n\nThe production of standardized coinage began in Lydia in the seventh century BCE, by none other than King Croesus—hence the expression, “As rich as Croesus” (him having invented money and all). The actual means of production (hammering a planchet between two dies) didn’t change for two thousand years, give or take. Screw presses emerged around the Renaissance, but the process of minting didn’t become fully mechanized until James Watts’ steam engine was applied to the process in 1801—about the same time that virtually every other means of production amenable to steam power exploded…\n\n"
    },
    {
      "time": "2 Feb 2013 — 5:41am",
      "content": "Hi -\n\nElizabeth L. EISENSTEIN:  \nDie Druckerpresse. Kulturrevolutionen im frühen modernen Europa.  \nSpringer, 1997.  \nISBN 3211828486\n\nED: Just found the original US version in two volumes:\n\nElizabeth L. EISENSTEIN:  \nThe Printing Press as an Agent of Change -  \nCommunications & Cultural Transformations in pre-modern Europe.  \nCambridge University Press, 1980.  \nISBN 978-0521299558\n\nHE\n\n"
    },
    {
      "time": "3 Feb 2013 — 6:16pm",
      "content": "Thanks!\n\n"
    },
    {
      "time": "5 Feb 2013 — 1:38pm",
      "content": "\\>the christian Hebrew typographer\n\nWhy is christian lc and Hebrew uc?\n\n"
    },
    {
      "time": "5 Feb 2013 — 2:05pm",
      "content": "I presume because Hebrew is a proper noun in this context, referring to the Hebrew language, while christian is an adjective, referring to the typographer.\n\n"
    },
    {
      "time": "5 Feb 2013 — 3:05pm",
      "content": "You have a whole lot of dictionaries against you on that one John.\n\nThe \"he\" is always lower-cased:  \n [http://www.youtube.com/watch?v=lFWA1A9XFi8](http://web.archive.org/web/20150414190701/http:/www.youtube.com/watch?v=lFWA1A9XFi8 \"http://www.youtube.com/watch?v=lFWA1A9XFi8\")\n\n"
    },
    {
      "time": "5 Feb 2013 — 3:05pm",
      "content": "John,\n\nSo, “the british Empire” is proper form, “british” being an adjective in this case? I think not; methinks there’s an agnostic—or, perhaps, even an atheist in the house…\n\n"
    },
    {
      "time": "5 Feb 2013 — 6:11pm",
      "content": "because my english writing is poor?\n\n"
    },
    {
      "time": "5 Feb 2013 — 6:57pm",
      "content": "Capitalisation is a convention, one that hopefully captures useful information from language that assists understanding. English capitalisation used to be pretty random, but useful in the sense that it indicated words that the writer thought Very Important. These days, capitalisation is governed by style guides, some of them called grammars because that sounds more impressive, but no less conventional for that.\n\nIn this case, I think the meaning of the description of Le Bé is clarified by the lack of capitalisation. Consider, does the phrase 'Christian Hebrew typographer' refer, as intended, to a typographer of Hebrew text who happened to be a Christian, or to a typographer of something called Christian Hebrew. By not capitalising christian in this context, it is clear that the word is an adjective referring to 'Hebrew typographer', and not part of a proper noun.\n\nGenerally, I like to restrict use of capitalisation to proper nouns, which is why I regularly offend people by writing of the Catholic churches and the protestant churches. Why? Because Catholic is part of the proper name of the institutions in question -- the Roman Catholic Church, the Chaldean Catholic Church, the Maronite Catholic Church, etc. --, whereas with \\>34,000 independent protestant sects operating under a great diversity of names almost none of which actually include the word Protestant, it seems obvious to me that there is no such thing as Protestant as a proper noun except in very rare cases; protestant is an adjective, as is christian in the context of the comment about Le Bé, and catholic when referring to one of the four marks of the Church (the latter a proper noun in this case, to distinguish it from the church around the corner).\n\nSome people capitalise adjectives that they think are Important. But that's pretty Random.\n\n"
    },
    {
      "time": "11 Feb 2013 — 9:19pm",
      "content": "In English, unlike French, words like \"Christian\", \"Fahrenheit\", \"Hamiltonian\", or \"Newtonian\" which contain a proper name, are _always_ capitalized, no matter what part of speech they are.\n\n"
    },
    {
      "time": "12 Feb 2013 — 5:08am",
      "content": "Thank you, John: quite Enlightening…except that, technically speaking, “Christian” is an adjective referring to a specific person’s honorific, which is to say _Iesu Christe_. It is unlikely that any self-respecting copy editor would let “Henry the eighth” fly…\n\n"
    },
    {
      "time": "12 Feb 2013 — 7:37am",
      "content": "Yaronimus indicated, he is not familiar with the intricacies of English capitalization. There's nothing more to it...\n\n"
    },
    {
      "time": "12 Feb 2013 — 7:53am",
      "content": "> In English, unlike French, words like \"Christian\", \"Fahrenheit\", \"Hamiltonian\", or \"Newtonian\" which contain a proper name, are always capitalized, no matter what part of speech they are.\n\nohm really? :-)\n\n"
    },
    {
      "time": "12 Feb 2013 — 11:50am",
      "content": "Craig, tell me if it hertz to be such a smart alec.\n\n"
    },
    {
      "time": "12 Feb 2013 — 12:21pm",
      "content": "I am watt I am.\n\n"
    },
    {
      "time": "12 Feb 2013 — 12:59pm",
      "content": "John (Q), you're quite right that the convention in most English usage is to preserve the capitalisation in words derived from proper names, with the caveat illustrated by Craig and Nick S that this only persists so long as the words remain commonly associated with the person. The personal association of many words diminishes over time, especially if the original name was foreign and unfamiliar to English speakers. It is akin to what can happen to trademark names if they become common parlance: how Kleenex becomes kleenex.\n\nT'other Nick pondered whether the failure to capitalise christian was some sort of atheistical gesture. I pointed out that, whatever the reason, in the context of the particular construction the lack of capitalisation avoided the ambiguity so often potential in English when a capitalised adjective is joined with a proper noun.\n\n"
    },
    {
      "time": "12 Feb 2013 — 1:07pm",
      "content": "Ohm = Ω  \nHertz = Hz  \nJames Watt loses out.  \nbritish Empire?\n\n"
    },
    {
      "time": "12 Feb 2013 — 3:09pm",
      "content": "> It is akin to what can happen to trademark names if they become common parlance: how Kleenex becomes kleenex.\n\nThat's an interesting subject; learn more about trademark dilution by [googling it](http://web.archive.org/web/20150414190701/http:/www.google.com/search?hl=&q=googling+trademark+dilution).\n\n"
    }
  ]
}
