{
  "id": "10013",
  "title": "Help!!",
  "forum": "Design",
  "tags": [

  ],
  "content": "Help please!!   \n   \nThere's this dingbat font which has the accessibility symbol (guy on chair :P) on it. But i don't rememer which one and i need it urgently.   \n   \nDo you guys know which font has it??   \n   \nThanx in advance!\n\n [‹ Arial OTF and Arial TT in InDesign HELP!!!](http://web.archive.org/web/20071103083931/http:/www.typophile.com/node/10189 \"Go to previous forum topic\") [Font sugestions for webmagazine ›](http://web.archive.org/web/20071103083931/http:/www.typophile.com/node/10257 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071103083931/http://www.typophile.com/user/5414\" title=\"View user profile.\">inverse</a>",
  "time": "<br>",
  "uid": "5414",
  "comments": [
    {
      "time": " 30.Mar.2005 5.18am",
      "content": "[http://www.myfonts.com/fonts/linotype/warning-pi/](http://web.archive.org/web/20071103083931/http:/www.myfonts.com/fonts/linotype/warning-pi/)   \nuppercase S\n\n"
    },
    {
      "time": " 30.Mar.2005 6.40am",
      "content": "\"has the accessibility symbol\"   \n   \nThat's not an accessibility symbol. It's a 'handicapped' symbol or 'wheelchair accessible' symbol.   \n   \naccessibility \\> physical disability. I'd seriously consider trying to come up with your own if you can. Check out what Apple use's for their icon.   \n   \nI co-opted it for a quick icon on our site:   \n [http://www.courts.state.mn.us/](http://web.archive.org/web/20071103083931/http:/www.courts.state.mn.us/)   \n   \nNow, if you're trying to design a sign for handicapped parking, then it makes a lot of sense, but for accessibility in general, not so much.\n\n"
    },
    {
      "time": " 31.Mar.2005 5.21am",
      "content": "@ Tim Daly   \n   \nThanx a ton! :D   \n   \n@ darrel   \n   \nThanx for the information! But please do update with terminology in the world of usability. :D\n\n"
    },
    {
      "time": " 31.Mar.2005 5.31am",
      "content": "----   \n   \nSorry for these extra posts. My connection was a little dodgy!\n\n"
    },
    {
      "time": " 31.Mar.2005 6.53am",
      "content": "No, that would be the capricious ways of the Typophile boards. It gives false errors sometimes.\n\n"
    },
    {
      "time": " 31.Mar.2005 10.45am",
      "content": "\"Thanx for the information! But please do update with terminology in the world of usability. :D\"   \n   \nWhat do you mean? Are we talking about accessibility here or usability?\n\n"
    },
    {
      "time": " 2.Apr.2005 2.03am",
      "content": "@ Chris - That makesme feel better! Thanx for letting me know :D   \n   \n@ darrel- Well in both areas, as far as I know.\n\n"
    },
    {
      "time": " 4.Apr.2005 7.31am",
      "content": "Well, I guess I'm lost unless I know a bit more about the context of situation. My point was that using the wheelchair symbol is not a good icon for the broader concept of 'accessibility' outside of the basic handicapped parking space and wheelchair ramp.\n\n"
    },
    {
      "time": " 4.Apr.2005 9.55am",
      "content": "Darrel,   \nI think the clue was in the question, [accessibility symbol (guy on chair :P)], which led me to my suggestion, but it was an ungracious remark by inversarium to someone who was trying to help him/her. On the other hand I don't think the icon you pointed to would have indicated accessibility without the word next to it.   \nTim\n\n"
    },
    {
      "time": " 4.Apr.2005 11.31am",
      "content": "Tim:   \n   \nI agree that the icon I linked to in no way is a great icon for accessibility. But it's arguably much better than the wheelchair icon.   \n   \nThe main issue is that accessibility is so much more than just accomodating physical impairements and the wheelchair icon just carries a lot of baggage with it that doesn't really fit into the whole accessibility concept.   \n   \nI'd love to see push for more a universally agreed upon standard for accessibility rather than just the wheelchair.\n\n"
    },
    {
      "time": " 6.Apr.2005 10.16am",
      "content": "Darrel,   \nI think we are in agreement over this, though I cannot offhand think of a simple icon that would indicate accessibility.   \nTim\n\n"
    },
    {
      "time": " 10.Apr.2005 3.41pm",
      "content": "@ Tim & Darrel   \n   \nIm so sorry to have put my words across in the wrong manner. Do forgive me for sounding ungracious, Darrell. It was wrong on my part to come out with a lash like that. Thanks for the help once again ![:-)](http://web.archive.org/web/20071103083931im_/http:/www.typophile.com/forums/clipart/happy.gif)!\n\n"
    },
    {
      "time": " 10.Apr.2005 4.13pm",
      "content": "This is a little funny! The accessibility [guy on the wheelchair :P] symbol sits right with the other symbols in Photoshop 7 default shapes and it's only now that I notice it! Anyways, thought i'd share the alternative to the font for the sumbol. ![:-)](http://web.archive.org/web/20071103083931im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 12.Apr.2005 9.19am",
      "content": "Out of curiosity, how/what are you using this symbol for?\n\n"
    },
    {
      "time": " 12.Apr.2005 2.55pm",
      "content": "Hehe.. Just drop by my site. It's still in coming soon mode though as it has been for a long time. It's a part of my logo really!   \n   \n [www.inversarium.com](http://web.archive.org/web/20071103083931/http:/www.inversarium.com/)\n\n"
    }
  ]
}
