{
  "id": "100135",
  "title": "Printer recommendation?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello,\n\nI'd like to invest in a printer for testing fonts... do you have recommendations?\n\n",
  "author": "Graphirus",
  "time": "28 Jan 2013 — 10:36am",
  "uid": "206220",
  "comments": [
    {
      "time": "28 Jan 2013 — 3:32pm",
      "content": "Whatever you do, don't get an inkjet unless you are independently wealthy. The cost of ink will eat you alive. Get a laser.\n\n"
    },
    {
      "time": "28 Jan 2013 — 5:15pm",
      "content": "Yes, and at least 1200 dpi true resolution (in both dimensions), plus true PostScript.\n\nhhp\n\n"
    },
    {
      "time": "28 Jan 2013 — 8:10pm",
      "content": "I'm going to go on a bit. You may find you're not interested, and that's fine.\n\nIt kind of depends on what the fonts you're testing are for, and what kinds of testing you are willing to do.\n\nI imagine most fonts aimed at paper rather than the web are also aimed for use with laser printers. That kind of limits the control you have, because you can't control the eventual printing device your fonts run on -- they will vary widely. In that case, get the best laser printer you can afford, so that if your customer is using a good printer, your fonts will also look good.\n\nSadly, \"best\" here has two aspects.\n\nThe first is rounding errors, which affect spacing, including kerning. I have never had a laser printer where I trusted the printouts to give me final information on spacing and kerning. A laser printer may be advertised as \"600 dpi\" or \"1200\" dpi, but the results with spacing were less consistent that the old Linotype 202 typesetting machine, which output to photographic paper. That machine had a resolution of 960 lines per inch.\n\nUltimately the lowest resolution value of the entire system is at play, and you don't know what that is. There is the resolution of the laser, the resolution of the belt, the resolution of the ink, the paper, etc. I'll bet you a fair sized wad that \"1200 dpi\" refers to the capability of the laser, or maybe the laser + belt, and that they're not asserting a test of the whole system. But in the end, it's the whole system you have to live with.\n\nThe second aspect is the way the ink is put on paper. That is in part resolution too, but also tied to ink spread, ink absorption, paper show-through, and a few more things..\n\nStart here: For years, book people have complained about type being \"too thin.\" This goes back to photocomp, around 1970 or so. It got worse when the output of the typesetting machines was film negatives that were directly stripped up to burn a plate, without the intervening repro stage (repro = a paper positive used to make a film negative). That's from the time you sent the printer \"application files.\" It got worse still when output became direct to plate.\n\nNone of this was the printer's fault, though the printer was usually blamed. \"Printer\" here referring to either the machine, or the entire process by which type was used on an offset press.\n\nIt was the fault of the type designer not understanding the entire process; not having a working knowledge of the materials and processes at play.\n\nI know **a lot** fonts that look good on a laser printer as found at most offices or homes, that look poor when printed offset, on either a coated or uncoated sheet. Here, I'm thinking of fonts that are too thin.\n\nThere are a number of fonts that look OK on a laser printer, and OK when printed offset on a coated stock, but are just too heavy printed on an uncoated stock. Merlo is one of those. I'll mention it by name because it **is** a good font for printing with coated sheet. Just don't use it on an uncoated sheet for text if the type size is over 10 points. And 10-point Merlo is pretty small...\n\nThere are fonts that look good on all three. Miller is one. I suspect the ability to get the weight and balance of the letterforms just right comes from years of experience, an understanding of materials & processes whereby ink is put on paper. I know of no mathematical formula.\n\nSo, no help if what you want is a \"buy this\" recommendation. I hope some help in understanding why any \"buy this\" advice will have limitations.\n\nIf your font's print use is aimed primarily at the laser/inkjet audience, test it on as many as you can. (\"Hey, can I print this out on your machine?\") For evaluating spacing, try a few machines advertised as high resolution, and look at the same letter pair as it (they?) occurs several times on a couple pages of type, set justified. If the kerning looks different at some of those different places, and you can rule out your psyche (harder to do than one might imagine), you know the rounding to the printer is getting you.\n\nIf your font's primary use is for books, esp. books printed on an offset press (not on-demand), see if you can get someone to give it a try. A press test is $250-300, you'll want to avoid that, or at least save that until you're pretty sure you're very close.\n\nGood luck with it.\n\n"
    },
    {
      "time": "28 Jan 2013 — 8:18pm",
      "content": "Excellent comment, Charles.\n\nI purchased a reasonably cheap Brother HL-5370DW laser printer a couple of years ago, and I've been pretty happy with it. The 1200 dpi mode is good (and instructively contrastable with the 600 dpi mode); avoid the asymmetric 600x1200 mode. It isn't true PostScript, but the emulation seems pretty good; truth be told I tend to use PCL mode most of the time because it is faster, but then most of the fonts I make are more likely to be used by people printing to PCL printers than people outputting to PS imagesetters and offset printing. [The Brill fonts were a notable exception, but for that project I had access to pretty much unlimited press testing.]\n\n"
    },
    {
      "time": "2 Feb 2013 — 10:56am",
      "content": "Thanks for the comments guys, specially Charles'... great information! After some research I decided to go with the 5370DW )\n\n"
    }
  ]
}
