{
  "id": "10016",
  "title": "Student Typeface: Couther Sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Okay, so this a little daunting, putting this out for some people with experience to see, but here it is:   \n   \n\\<img\\>   \n   \nCouther Sans is a typeface I am designing for the DIA (Design Institute of Australia) Student Design Awards, I've explained the brief and my rationale in the pdf further below.   \n   \nAs this is for a competition, I chose only the weight I thought most elegant: light. I am trying to work off stereotypes of uncouth Aussies (thus, Couther Sans), and wanted the most sleek and modern feel I could get. However, this would be used more for display sizes, thus the \"display\" tagged on the end, although the face is intended also for body copy.   \n   \nThere are little ink traps in it (very small) because it is intended for display sizes.   \n   \nPlease, I would love any and all feedback, even harsh critiques are welcome. I've done a handful of other fonts before, a hand script, a type revival and a typeface that was half-done and then lost in a hard drive incident, but nothing designed for body text.   \n   \nThis incarnation must be ready by the end of next week, however more detailed feedback for when I develop the complete family is also welcome. The alphabet and numerals are done and ready for tweaking, the analphabetic glyphs including punctuation are yet to be done, or we just thrown together for this sample sheet.   \n   \nSorry if I've rambled.\n\n<!--attachment: couther_sample-68355.pdf*mime_pdf.gif*application/pdf*303.2*Sample+Sheet+including+full+alphabet+and+numerals*couther_sample%2epdf --><!--attachment: couther_sample-68355.pdf*mime_pdf.gif*application/pdf*303.2*Sample+Sheet+including+full+alphabet+and+numerals*couther_sample%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131013064420im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Sample Sheet including full alphabet and numerals<br><a href=\"http://web.archive.org/web/20131013064420/http:/www.typophile.com/forums/messages/29/couther_sample-68355.pdf\" target=\"_blank\"><b>couther_sample.pdf</b></a> (303.2 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "linusans",
  "time": "30 Mar 2005 — 6:39am",
  "uid": "5458",
  "comments": [
    {
      "time": "30 Mar 2005 — 6:52am",
      "content": "Two things, it's late here (12:38am) so there's some typos in the pdf \"is may be developed?\". Secondly, please forgive my lack of image posting skill. You can find a gif here:   \n   \nhttp://lunchtimelegend.com/images/couther\\_sample.gif   \n   \nWhy this forum prevents any html or image changes in an edited post, I don't know, but it's frustrating.   \n   \nThanks in advance.   \n\\_Linus\n\n"
    },
    {
      "time": "30 Mar 2005 — 7:05am",
      "content": "![Couther Sample](http://web.archive.org/web/20131013064420im_/http:/www.typophile.com/forums/messages/29/68360.gif)\n\n"
    },
    {
      "time": "30 Mar 2005 — 7:09am",
      "content": "_( To display images on Typophile, you may have to use the ' [Upload Attachment](http://web.archive.org/web/20131013064420/http:/www.typophile.com/cgibin/discus.pl?pg=formatting#images)' 'feature'..   \nSee.: ' [Typophile Help](http://web.archive.org/web/20131013064420/http:/www.typophile.com/cgibin/discus.pl?pg=help)'.. )_\n\n"
    },
    {
      "time": "1 Apr 2005 — 3:54am",
      "content": "Thanks for your help Dav. Please, feedback anyone?\n\n"
    },
    {
      "time": "1 Apr 2005 — 4:31am",
      "content": "First of all, il really like this kind of post-modern sans serif typeface. However, I'd suggest somethings.   \n   \nWhy did you choose to have two kind of end letter: round on both side, like (K P R, U, 3, d) and round/square (C, X, Y). To me it seems unstable.   \n   \nAlso, the top bowl of the UC and lc s is to much to the left side.   \n   \nGood work\n\n"
    },
    {
      "time": "1 Apr 2005 — 4:45am",
      "content": "Thanks for your feedback Andr\n\n"
    },
    {
      "time": "1 Apr 2005 — 4:56am",
      "content": "Let us know about the result of this contest.\n\n"
    },
    {
      "time": "1 Apr 2005 — 11:41am",
      "content": "Linus,   \n   \nI understand the reasoning behind the varying terminals, which don\n\n"
    },
    {
      "time": "1 Apr 2005 — 5:45pm",
      "content": "Thanks Ricardo, will have a look at the Cs again. I wanted something not quite vertically symmetrical, if you know what i mean, kind of like a vertically flipped version of Rotis' Cs, but i might need to re-think this. Never been the biggest fan of Rotis myself.   \n   \nAnyone know of a good face with a balanced, vertically asymmetrical C?   \n   \nAnd I do need to exaggerate the triangular cust in the counters of P & R. Even though they're not truly closed counters already, it is such a small gap and small angle, that when printining it out, it fills in on a laser printer.   \n   \nThanks for all your feedback so far guys, it's very much appreciated. And I will let you know how the competition goes.\n\n"
    },
    {
      "time": "6 Apr 2005 — 7:19pm",
      "content": "Linus, have you seen [Barry Deck's](http://web.archive.org/web/20131013064420/http:/www.barrydeck.com/) **Caustic Biomorph** and **Canicopulis**?   \n   \nAlso, have a look at [Max Kisman's](http://web.archive.org/web/20131013064420/http:/www.identifont.com/show?M0) **Fudoni**.   \n   \nAll of these fonts have a **C** or some other letter that is a bit asymmetrical, vertically speaking.\n\n"
    },
    {
      "time": "13 May 2005 — 6:39pm",
      "content": "Due to bugs with the forum, I've had to create a new account. Fun. Anyway, the contest is finished.\n\nI won third place. Although I still haven't seen the other place winning entries, as this was held interstate and they didn't send images with the letter I received. Hopefully they will soon add it to their website.\n\nOh, and apparently we **can't** include attachments any more.  \nHere is [a pdf of my presentation](http://web.archive.org/web/20131013064420/http:/www.lunchtimelegend.com/files/dia_boards.pdf) for the competition including a near-full character set.\n\n"
    },
    {
      "time": "16 Jul 2005 — 5:19pm",
      "content": "Linus, I'd been meaning to crit this font. Congrats on the \"podium finish\". It's pretty rare that a font is recognized in a general design competition - good going. So/but let me ask: are you still looking for crits?\n\nhhp\n\n"
    }
  ]
}
