{
  "id": "100114",
  "title": "Please help with this serif font",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi all -- hoping to get some help with the serif font on these images - thanks in advance.\n\n| Attachment | Size |\n| --- | --- |\n| [image copy.jpeg](http://web.archive.org/web/20131017050610/http:/typophile.com/files/image%20copy.jpeg) | 80.75 KB |\n| [image.jpeg](http://web.archive.org/web/20131017050610/http:/typophile.com/files/image_1.jpeg) | 104.85 KB |\n\n",
  "author": "Palindrome",
  "time": "27 Jan 2013 — 2:27pm",
  "uid": "207361",
  "comments": [
    {
      "time": "27 Jan 2013 — 2:37pm",
      "content": "ITC Mendoza  \n(looks like two weights)\n\n[http://store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=...](http://web.archive.org/web/20131017050610/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1073 \"http://store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1073\")\n\n"
    },
    {
      "time": "27 Jan 2013 — 2:43pm",
      "content": "wow - that was fast - thanks so much.\n\n"
    },
    {
      "time": "27 Jan 2013 — 2:58pm",
      "content": "btw - there seem to be two versions of mendoza for sale -- the adobe and the elsner and flake -- any idea the differences / which one is better? I would prefer the higher quality one - don't mind the price.\n\n"
    },
    {
      "time": "27 Jan 2013 — 3:09pm",
      "content": "no idea, unfortunately. i tend toward adobe if there's a question but if you have to match exactly and there are character differences, go with your gut.\n\n"
    },
    {
      "time": "27 Jan 2013 — 3:21pm",
      "content": "Besides quality, also mind the [no-]modification clause in each EULA: Adobe's is very lenient - you won't get stuck if you ever need to perform/commission mods.\n\nhhp\n\n"
    },
    {
      "time": "27 Jan 2013 — 3:26pm",
      "content": "one more question for you, if you don't mind --\n\nany opinions on using mendoza for the main body text of an academic book?\n\n"
    },
    {
      "time": "27 Jan 2013 — 3:37pm",
      "content": "Related to that last question, if anyone knows of any books set in Mendoza that I could look at, I'd appreciate it --\n\nHrant -- I've read your many comments about pirating, and though I'm not in your business I can understand your cause and support it --\n\nOn the consumer end, and being a novice consumer at that, I must say that it's a challenge to figure out a lot about these fonts before I buy them (maybe I just don't know how to research well enough) -- the little bit that one can see in the window of fontshop or myfonts or whatever is just not enough for someone like me to know what a font is really going to look like -- In the last few months, I've spent quite a lot of money on fonts that ultimately I don't have a ton of use of for -- in large part, this is because there is no way for a basic person like me to know what different fonts look like set in a page of text, or whatnot -- I looove that fontsinuse website -- if there were a similar sort of site that gave examples of different fonts in use in books, it would be of huge use to us end users.\n\nThanks again to all of you on this site -- I've learned a lot from it, and it's been amazingly helpful.\n\n"
    },
    {
      "time": "27 Jan 2013 — 3:44pm",
      "content": "Its stylistic suitability needs to be considered, but in terms of readability, it's rock solid. You do also have to worry about it having all the \"parts\" though - like the right kind(s) of numerals, smallcaps that work for you, and other things your text might need. But if you get the Adobe version you can always get me to make any mods you end up needing. :-\\>\n\nConcerning piracy, I'm actually a pragmatist, and a big believer in Good Intentions. I hope you know what I'm getting at without me having to spell it out... The good news is increasingly there are ways of trying out fonts without taking out a second mortgage, like SkyFonts.com - and they happen to have Mendoza!\n\nhhp\n\n"
    },
    {
      "time": "27 Jan 2013 — 3:46pm",
      "content": "Hrant - how would you describe this style?\n\nThe books are study guides for standardized exams -- the font should be erudite but approachable, which I know is not an easy combination -- I've written the books, and they are currently set in minion -- I know that that's supposed to be the no-fail font, and who the hell am I to say it's not right for me, but it's just not right for me -- I'm looking for something else, and unfortunately I've been going through a painful buy and try approach -- hoping to get some guidance before buying the next one to try.\n\n"
    },
    {
      "time": "27 Jan 2013 — 3:47pm",
      "content": "I do hrant - thanks for the website tip and the advice.\n\n"
    },
    {
      "time": "27 Jan 2013 — 3:58pm",
      "content": "Wow - skyfonts is amazing - I cannot believe with all the time that I have wasted online I did not find that myself - thats so much hrant for the suggestion.\n\n"
    },
    {
      "time": "27 Jan 2013 — 9:58pm",
      "content": "> erudite but approachable\n\nI think Mendoza actually sounds like a good match. But hopefully others will suggest faces that are even better.\n\nBTW, SkyFonts is very new so don't beat yourself up too much.\n\nhhp\n\n"
    }
  ]
}
