{
  "id": "10017",
  "title": "Switching to OSX",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I\n\n",
  "author": "keith_tam",
  "time": "21 Feb 2003 — 6:26pm",
  "uid": "1202",
  "comments": [
    {
      "time": "21 Feb 2003 — 8:17pm",
      "content": "I am scared to move. I still use, and _love_ Quark. (bastards)   \n   \n-smc\n\n"
    },
    {
      "time": "22 Feb 2003 — 9:37am",
      "content": "I am in the same boat and after about the 10th customer complaint I have decided my business cannot continue without some OS X tools to test with so I have to upgrade.   \n   \nI get most complaints from OS X users and Win XP users making an OT solution something I'm going to very seriously have to consider in the coming years. Not for the coolness of ligature substitution, but because of the need to develop a font file that won't error out on a newer machine.   \n   \nI would agree with your assumption that most applications and file types will remain supported under OS X and I believe you'll still be able to launch classic apps but you won't be able to boot in classic mode.   \n   \nOtherwise, you can get Adobe's studio pack for $999 with Photoshop, Illustrator, In Design, and Acrobat which seems like a sweet deal to me.   \n   \nAs far as the set-up goes, I'm not sure if I'm better off getting a new box and monitor or a 17\" iMac with the adjustable LCD monitor. I need to get away from the mind melting, eye burning CRT monitor.   \n   \nI think I'll make a trip to the Apple Store and see what I like best. I'm pretty sure I'll be jumping back and fourth between both computers till I figure out how to work efficiently in OS X.   \n   \nGood Luck!   \nStuart :D\n\n"
    },
    {
      "time": "22 Feb 2003 — 9:46am",
      "content": "HI Keith:   \n   \nI have a BW G3 / 350 with 792 Mb Ram.   \n   \nI installed 10.2 and found it too slow. So i upgraded to an Other World Computing G4 processor for around $240 (ithink) and find it much faster. It was unusable without the additional processing power. If you have a rev 1 B&W (which you might at 300Mhz), you should read [http://www.xlr8yourmac.com](http://web.archive.org/web/20131011013302/http:/www.xlr8yourmac.com/) to familiarize yourself with the issues. Your machine may not be capable of using OSX well.   \n   \nThat said, there are so many things to upgrade. I think it will end up costing me around $1500 to really be set again. Buit I was lagging on upgrades and needed to buy stuff anyway.   \n   \nI moved because I found 9.1 and 9.2 very frustrating, all the crashing and what not. 10.2 is very stable, and Freehand 8 (my key app) runs very VERY quickly in classic mode. Classic is FINE for most things. I only need to reboot in OS9 to get anything scanned. That could be fixed with a new $99 OSX compatible scanner. So much else is a LOT easier in OSX I wouldn't even consider going back.   \n   \nHere's how I did it:   \n   \nInstalled 10.2 and ran it for fun when I was bored. I did this for 2 months. Gradually, some of the newer apps hooked me and over the holidays, I decided to make OSX my default system. The ones worth switching for include:   \nSafari, iTunes3, iCal, and even the look of it.   \n   \nI found OSX mushy at first, but it is SO much easier on my eyes. I think the type is much too mushy still, but I've adjusted. It look s best on an LCD.   \n   \nJoe   \n [www.joevanderbos.com](http://web.archive.org/web/20131011013302/http:/www.joevanderbos.com/)\n\n"
    },
    {
      "time": "22 Feb 2003 — 10:19am",
      "content": "One day at work in the not too distant past ... I was bored, it was slow ... I decided to upgrade to OS X Jaguar. I have a Grey G4 (400MHz, 1.5Gb Memory). _(How do you know which generation you have?)_ I realized I hadn't really been using Quark that much anymore. I had really grown accustomed to the way Illustrator handles things and noticed that it was serving almost all of my needs. For all intensive purposed I was fine in OS 9 -- so I suppose it came down to boredom. Or, maybe jealousy, I wanted bouncing icons too. ![:-)](http://web.archive.org/web/20131011013302im_/http:/www.typophile.com/forums/clipart/happy.gif)  \n  \nAfter switching I haven't looked back. It is a slower system. I'll admit to disliking (fearing) technology speak and so I haven't tried to figure out if there are ways to make my machine faster. I am a speed freak, but I'm also a book worm.   \n  \nI tried Font Reserve and Font Agent. Twice. The one thing I wasn't happy about with OS X is the way it handles fonts. That said, I have now settled with Font Reserve and have found ways to make Font Reserve feel a bit more homey (ATM).   \n  \nI can understand the Quark Dilemma. I have opened Quark a couple of times through Classic, and it seems to be steady and not tooooo slow. But, I've just purchased the Design Collection and am happy to pronounce that I am now a card-carrying InDesign user! I love it. And another bonus about spending most of my days in Adobe apps is that it takes advantage of the font handling mechanism now built into OS X. Ergo no real need for Type Reunion anymore either. I was told my new friend at Font Reserve that Apple has the necessary bits and bobs, and the software simply needs to take advantage of it. (how's that for tech speak?)   \n  \nI did upgrade to 10.2.4 and haven't had any of the problems that have plagued others. Luckily (knock on wood).   \n  \nOne thing that I have done is download something called 'mouse zoom' from techtracker. It can amplify your mouse to crazy insane speeds. And I also use CandyBar. I didn't really like those folders that came in the Jaguar can.   \n  \nOne question I would like to know is about the speed issue. And I guess I'll have to check out xlr8yourmac too. I have a really old monitor. _(The type IS to mushy!)_ I do. But I do have an ATI 8500 Mac graphics card. Shouldn't this help the speed?   \n  \nFor all of you Quark lovers (which I once was.) I'd suggest downloading the 30-day trial of InDesign. Check out what's under their \"typographic\" hood. It truly is an app for the typographically retentive personality (like me). ![:-)](http://web.archive.org/web/20131011013302im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nOh and one more thing. If anyone at Epson happens to read this ... **_Where are the updated drivers for our printers? You should be totally and utterly ashamed of yourselves!_**\n\n"
    },
    {
      "time": "22 Feb 2003 — 11:33am",
      "content": "_I am scared to move. I still use, and love Quark._   \n   \nUgh, how can you love anything that doesn't support ligatures or pixel-perfect on-screen previews? ![:-)](http://web.archive.org/web/20131011013302im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nPaul\n\n"
    },
    {
      "time": "22 Feb 2003 — 12:14pm",
      "content": "Thanks, guys, for your insights. It looks like it's not really worth it to switch to OSX for my G3... I'll have to spend money to add RAM, add a G4 card etc. I probably should get a new machine, but I can't afford that right now. What I really can't stand any more though is my CRT monitor...   \n   \nI learned Quark at school, and I hated it! I really can't see why people don't want to try InDesign. I really love it. It's the best by far! I looked at the Quark web site yesterday, and it seems like they have an identity crisis right now... they are trying to turn it into a web design program! I think Quark has had it! It's dead! Where's the OpenType support? And multi-line composer? Optical alignment? I can't work without those now! But of course, for an average graphic designer who mostly designs ads and stuff, these features don't really mean much...\n\n"
    },
    {
      "time": "22 Feb 2003 — 2:08pm",
      "content": "Quark\n\n"
    },
    {
      "time": "22 Feb 2003 — 9:13pm",
      "content": "Keith   \nAlways worth maxing out on on RAM, cheapest and best thing you can do to improve your computer's performance. But G3's do run on OSX. You don't need a G4 card.   \n   \nNever had much use for Quark either. Just kept it up for clients. Hopefully, one of these days soon, I can just delete the prick.\n\n"
    },
    {
      "time": "24 Feb 2003 — 1:38am",
      "content": "Keith, I have exactly the same 500mhz iBook configuration, but with 640meg of Ram.   \n   \nI run only 10.2 now, I dont even have classic installed. Speedwise, things are _different_ to MacOS 9 - down to the way that pre-emptive multitasking works. In some ways X is faster, in others its slower.   \n   \nFontLab is easily fast enough, and Photoshop is ok too, but I have found that Freehand 10 is painful to work with. The demo of Freehand MX I recently downloaded seems to be better though.   \n   \nThere is a performance hit, due to all the pretty eyecandy Mr Jobs insist we experience (which I actually like, but then I like lots of things), but there are also definite benefits.   \n   \nIts far more reliable - in the last 20 months it has only crashed on me about 5 times - unimaginable for MacOS 9.   \n   \nOne thing to be aware of is the driver issue. Make sure that any peripherals that you own have drivers for MacOS X - it is possible to use some devices through the Classic environment, but its often not much fun, and you really want to be using Classic as little as possible (ideally not at all).   \n   \nOh yes, and Mr Lange is bang on the button. More memory the better. 384meg is going to be ok, but 192 might be a tad painful.\n\n"
    },
    {
      "time": "24 Feb 2003 — 3:02am",
      "content": "Hi Keith, I was very sceptic for a long time - I liked the my computer/OS as it was. I saw no need to change and I thought I would loose all my extra software (like FinderPop).   \n   \nBut after New Years I took one week to try install OSX, still sceptic, but I thought I at least should try it out.   \n   \nNow I can honsestly say I never want to go back.   \nFontographer was a bit slow with OS 10.2.3, but with OS 10.2.4 it works much better.   \nAll my old extra software is also available.   \n   \nSome things are different and a bit annoying before you understand them. I also bought a really great book to help with the transition/switch:   \n [http://www.amazon.com/exec/obidos/tg/detail/-/0596004508/qid=1046084164/sr=8-1/ref=sr\\_8\\_1/002-0725822-3825621?v=glance&s=books&n=507846](http://web.archive.org/web/20131011013302/http:/www.amazon.com/exec/obidos/tg/detail/-/0596004508/qid=1046084164/sr=8-1/ref=sr_8_1/002-0725822-3825621?v=glance&s=books&n=507846)   \n   \nAnd as Mr Lange and Mr earls said - get more RAM.   \nIt's very cheap these days.   \n   \n/peter\n\n"
    },
    {
      "time": "26 Feb 2003 — 8:20pm",
      "content": "I just bought a used 350MHz iMac with 512Mb of ram and I installed OSX 10.1 so that I could get my bearings before I install it on my main Mac.   \n   \nI haven't messed with it too much at this point, but so far I don't notice it being slow.   \n   \nAnother thing to consider; even if you install it, you don't have to use it....I have OSX and 9.1 on my comp. at work and I use OS 9 99% of the time.\n\n"
    },
    {
      "time": "26 Feb 2003 — 11:34pm",
      "content": "Thanks for all your tips! And I have already successfully moved over to OS X (10.2)! I had to first upgrade my RAM (from 192 to 384 MB) and hard drive (from 6 to 66 GB). Pretty much everything is running as they should be and I'm quite pleased with the new look and feel. I'm still trying to get used to it, but it's not as difficult as I thought. The filing system is quite a mess but I think it's just a matter of habits. I have yet to get used to all the text being anti-aliased though... but I think it's beginning to grow on me. I find it better for my eyes... softer. This hefty OS (an install of over 1 GB!) seems to be quite sluggish though, probably because of those bells and whistles that Steve Jobs put in to make it seductive... I love them though :-P   \n   \nOne thing I do miss, though, is Outlook Express, which isn't available for OS X. I'm using Apple's Mail, which isn't too bad. But I couldn't import my emails from Outlook Express. When I launch Classic and Outlook Express, my 'identity' is lost, so I can't import. But the funny thing is if I start up in OS 9 it's all there! Any ideas?   \n   \nFont Reserve is not too bad, but I still prefer ATM Deluxe. The competitive upgrade was nice. Fonts are confusing in X!   \n   \nOh, one problem I haven't managed to solve is the Traditional Chinese input method... the order of the characters seem to be inverted, with the least common characters coming up first! It's a pain trying to type in Chinese! Any ideas? Or do anyone here use Chinese at all?   \n   \nK.\n\n"
    },
    {
      "time": "3 Mar 2003 — 7:37am",
      "content": "I was in CompUSA this weekend and found myself drooling over the 17\" iMac - It was superfast, the LCD monitor was pixel sharp and looked much nicer than the LCD Cinema Displays I've been eyeing up for some time.   \n   \nDoes anybody have any insight on this one? I was originally thinking of going to a separate CPU and monitor but with a minor RAM upgrade, this machine could easily whizz through Photoshop which I see as the most memory intensive application.   \n   \nStuart :D\n\n"
    },
    {
      "time": "4 Mar 2003 — 6:39am",
      "content": "Hey, Keith:   \nIf you don't mind, can you tell me why you chose FontReserve?   \n   \nI've be on OS X for about a week now, and can't decide whether to get FontReserve or FontAgent.   \n   \nThanks, John\n\n"
    },
    {
      "time": "4 Mar 2003 — 1:37pm",
      "content": "John -- I switched back to Font Reserve because I didn't have to leave it open. From what I could find while trying to use FontAgent -- well, it had to be left open for the cute little app to work correctly. I e-mailed them and suggested with the next version they incorporate this feature.\n\n"
    },
    {
      "time": "4 Mar 2003 — 2:05pm",
      "content": "Tiffany, on Mac X, I use font reserve too, and the other day, I try to install it on a Mac 9, to see how it work compared to ATM. I have noticed a presence of a invisible part of FR who open at start up. I think it does similar thing in Mac X despite its not clear how it do it! (for me).\n\n"
    },
    {
      "time": "4 Mar 2003 — 9:19pm",
      "content": "Jean -- I've actually just e-mailed them about a few font questions and that was one of them. The best explanation I can give is that it is some kind of cache that it uses. I do recall that they've asked me to delete this before when I have had problems, but I couldn't tell you exactly what it does.   \n   \nJohn -- One thing that FontAgent has that Font Reserve does not is a built in font doctor-like application.\n\n"
    },
    {
      "time": "5 Mar 2003 — 8:42am",
      "content": "Jean -- The \"invisible\" item that runs at start-up is part of the preferences for Font Reserve. If you have \"turn on at startup\" checked, this is what is happening at startup. It is unnecessary. To get rid of it, simply turn that preference off.   \n   \nHas anyone played with Font Doctor?\n\n"
    },
    {
      "time": "11 Mar 2003 — 11:45am",
      "content": "New Question. Or maybe just digging up an old one.   \n   \nOS X and Browsers. Preferences? Speed?\n\n"
    },
    {
      "time": "11 Mar 2003 — 12:13pm",
      "content": "I downloaded Apple's Safari Beta and it's the fastest browser by far! And the interface is just really simple and elegant (as expected from Apple). I really like it. But you can't disable Quartz font smoothing, which is annoying. When I work on web sites I don't test it on Safari because it looks quite different with the smoothed text. Chinese sites look a LOT better though, thanks to Quartz smoothing (!)... Do you know how hard it is to read aliased Chinese text on screen?\n\n"
    },
    {
      "time": "11 Mar 2003 — 12:36pm",
      "content": "Well, I finally broke down and ordered a 17\" iMac from MacMall since their having a major price mark-down.   \n   \nIt's actually a pretty sweet deal with the all in one and monitor - Which ironically enough due to its wider aspect ratio makes it perfect for kerning :D   \n   \nAny suggestions for getting comfortable with the new files and folders interface?   \n   \nStuart :D\n\n"
    },
    {
      "time": "11 Mar 2003 — 12:46pm",
      "content": "\\> Well, I finally broke down and ordered a 17\" iMac from MacMall since \\> their having a major price mark-down.   \n   \nWow, I wish I had one of those... But I've just upgraded my G3! My CRT is killing my eyes... I need to get an LCD. Do you guys have any suggestions for a good and inexpensive brand? I would like to get an Apple one, but they are too expensive. Are the colours good on LCDs? Everything looks pale on my iBook... How are LCDs in terms of colour accuracy?   \n   \nStuart, how does the wider aspect ration help your kerning?!   \n   \nI think I've got used to the new filing interface now. It's actually quite logical. And the good thing is, if you want it to behave like the traditional interface, you could. Just get rid of the bar at the top of each window (click on the button on the right of the windows), then you don't have use the column view.\n\n"
    },
    {
      "time": "11 Mar 2003 — 2:45pm",
      "content": "It was my monitor that forced the upgrade - The contrast was too hot and the pixels were no longer sharp, so I originally decided to get a new monitor.   \n   \nAfter looking at the Apple Cinema Displays, I was very disappointed at how blurry everything looked vs the 17\" iMac monitor so it seemed like it was worth the entire upgrade.   \n   \nRegarding color accuracy, I don't believe at this point it's as bad as it was back in the late 90s so I bet most any LCD display will have a profile with it that will sync with a Mac. Go to a CompUSA and look at monitors, there are many much cheaper than Apples that I feel are sharper.   \n   \nRegarding the wider aspect ratio and kerning, since I still use FOG, I am limited by how wide I can open the metrics window and kern the letters and adjust the data below, so I'll have perhaps an additional 25% width gain which will give me more room to see the kerning of the font as well as to enter the metric data.   \n   \nThanks for the OS X tip!   \n   \nStuart :D\n\n"
    },
    {
      "time": "12 Mar 2003 — 6:16pm",
      "content": "_Any suggestions for getting comfortable with the new files and folders interface?_   \n   \nStuart--   \nThe main thing to remember about folders in OSX is to put all your stuff in your \"home\" folder. This is the one with your user name on it in the Users folder. When you're running Classic or booting into OS9 (for FOG), resist the temptation to put files in the old Documents folder in the main hard drive window, or anywhere else, for that matter, outside your home folder. It makes things easier to get to when you're running OSX.   \n   \nAs for the Finder, I would suggest hiding the toolbar that shows up at the top of Finder windows by clicking on that little lozenge-shaped button on the right side of the title bar. This causes the windows to behave pretty much the same as in the old Finder. You also may want to avoid the column view (although some people seem to like it).   \n   \nThe Finder is more noticeably different in OSX than other applications, which work pretty much the same as before, except you never have to think about how much memory they use.   \n   \nI've been using OSX since it was released. At first just once in a while, more when 10.1 came out, and full-time since Jaguar was released. I'm very comfortable with it now. I still use 9 part of the time on a different Mac, and there are some things I like better about 9 compared to X, but it just isn't in the same league anymore.\n\n"
    },
    {
      "time": "12 Mar 2003 — 6:33pm",
      "content": "_The main thing to remember about folders in OSX is to put all your stuff in your \"home\" folder._   \n   \nI can't do that! My OS is on a 6 GB hard drive, and it only has very little space left. So I created a folder called 'Documents 2' on my 66 GB HD, and made it a favourite item so I can get to it easily. Does this work? Is there a way to work around this?   \n   \n_You also may want to avoid the column view (although some people seem to like it)._   \n   \nI'm one of those people who really resisted the column view at first but have learned to like it. It is actually very convenient because you can keep track of the paths. Many people might not know this, but in the earlier OSs (OS X too for that matter) if you hold down command and click on the window title, a menu pops up, showing you where you are in the hierarchical file system. The column view and the back/forward button do exactly the same thing, only more accessible.   \n   \n_but it just isn't in the same league anymore._   \n   \nWell, OS X is terribly sluggish, at least on my G3! I don't like how I can't keep track of how much RAM I'm using. Yeah, I have 384 MB RAM, but I feel like I have less because of the overall sluggishness and the automatic RAM allocations. At least all the bread-and-butter tasks in OS 9 were quick! I'm just talking about opening windows and switching apps and stuff. Everything feels 'sticky'! Too much shadows and transparency, I think. Are there any ways to disable them?\n\n"
    },
    {
      "time": "12 Mar 2003 — 10:06pm",
      "content": "One thing I've notice as well is how slow it is to open windows. Two things I've done to work around this: (1) Instead of double clicking on either of my drives to open them you can use command-N to open the drive. Much quicker. (2) Column view is quicker to navigate. For instance. Opening a file in Illustrator (or any other app) once the open window is up hit the tab key and with the column view active you can scroll exactly where you need to go.   \n   \nUsing the favorites window (cmd-shift F I think) with aliases and the column view gets you around much quicker to. I think anyway.   \n   \nOS X is slow. I'm on a G4 with 1.5G of ram ... I sat on one of our OS9 machines today and screamed out loud at how fast some things happened. But, I won't go back. I only hope they can fix some of the sluggishness. And the faultiness.\n\n"
    },
    {
      "time": "13 Mar 2003 — 3:50pm",
      "content": "_...put all your stuff in your \"home\" folder.   \n   \nI can't do that!_   \n      \n   \nI should have clarified that: The rule applies only to your start up drive. Additional drives are used same as before.   \n   \nAs for speed, yes, in some ways OS9 is faster and more responsive. I find that OSX makes up for it in other ways though:   \n- Better multitasking so you aren't forced to wait for operations to finish before doing something else. You can, for example, check your email or start another program while saving or opening a large file.   \n- System crashes are rare, so no time wasted on restarts. Once in a while an application may crash, but you can start it right up again immediately with no ill effects, and such crashes have no effect on other applications. I once browsed MacFixit while an installer was \"hung\" and was able to fix it and get it working again without restarting, or even quitting the browser.   \n- Putting the computer to sleep and waking it up again is almost instantaneous.   \n   \nAs for memory, you don't have to think about it at all. Applications will use as much as they need, up to almost the total RAM you have installed, regardless of how many other applications are running. In fact, you can run as many as you like, regardless how much RAM they want. There is a short delay when switching between applications in such a situation, but if it becomes a problem, just install more RAM. No need to monitor or optimize anything.   \n   \nIn general, plenty of RAM and a fast G4 does help. I've used it on a 500mhz G4 Cube with 896mb RAM and a 1ghz G4 Powerbook with 512mb RAM and it runs well on both, but better on the Powerbook.   \n   \nThere are things I dislike about OSX, but they are potentially fixable. The things that are wrong with OS9 will never be fixed.   \n   \nI will say, though, that OSX is not as good (yet) as OS9 for font development unless you embrace FontLab. FOG can be run in Classic mode, but it's happier running on 9 or earlier. Also, I don't know of any way to work with font suitcases in OSX or Classic.\n\n"
    },
    {
      "time": "13 Mar 2003 — 4:57pm",
      "content": "I'll throw Quark back into the thread. I guess quark 6 is supposed to be out in June. Will it? Who knows. From what I've read, it's looks like it will still be playing catch-up to InDesign. I own InDesign and Quark, but have not used InDesign because many of the projects I do are things like newsletter templates that will be passed on to quark users. I'm itching though.   \n   \nOn X vs. 9   \n   \nI'm lucky enough to have two G4s. One running 9 the other X. The X machine is for webdesign/databasing, the 9 machine for print. I have to say, X is better in virtually every aspect. The one that hasn't been mentioned: THE COMMAND LINE! I've discovered a whole world I didn't know existed. Though, with my limited skills the command line has been only usefull for web development.   \n   \nAnyone seen the 20\" apple display in person. It comes in at about standard market price. Also, has anyone seen formac monitors. They are aesthetically worthy of the G4 box, but cheeper than apple monitors. [www.formac.com](http://web.archive.org/web/20131011013302/http:/www.formac.com/) Are they any good?   \n   \nR\n\n"
    },
    {
      "time": "13 Mar 2003 — 9:11pm",
      "content": "\\> THE COMMAND LINE!   \n   \nAfter all these years, Apple wakes up.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Mar 2003 — 11:08pm",
      "content": "Remember that you can put favorites folders in the top part of your windows, so, available all the time! save lot of time during work. And the computer interface finally more close to your own use.\n\n"
    },
    {
      "time": "14 Mar 2003 — 7:42am",
      "content": "So Mark, when my apps crash, does it reak havok on the application preferences file?   \n   \nAlso, is there any need to \"rebuild the desktop\" in X?\n\n"
    },
    {
      "time": "14 Mar 2003 — 8:07am",
      "content": "While it's not a true equivalent to rebuilding the desktop, repairing permissions using Apple's Disk Utility serves the same purpose in my superstitious understanding of OSX.   \n   \nLook under Utilities/DiskUtlity/Repair(tab)   \n   \nI've heard it recommended to repair permissions after an installation.   \n   \nHalf-understod and probably wrong, but 2 minutes to spare to share it with you all.   \n   \nJoe   \nHey, my newest font is up at Myfonts: see it at:   \n [http://www.myfonts.com/fonts/joevanderbos/beachbuoy/](http://web.archive.org/web/20131011013302/http:/www.myfonts.com/fonts/joevanderbos/beachbuoy/)\n\n"
    },
    {
      "time": "14 Mar 2003 — 2:14pm",
      "content": "_So Mark, when my apps crash, does it reak havok on the application preferences file?   \n   \nAlso, is there any need to \"rebuild the desktop\" in X?_   \n      \n   \nI've never had to do it, but the \"repairing permissions\" thing Joe describes is similar. It's more like Disk First Aid for when you have trouble trashing files, etc. But there is no desktop file anymore.   \n   \nI also haven't had any havok reaked from crashing applications. But, just as in earlier Mac systems, messed up preference files are sometimes the cause of problems. Or so I read on MacFixit. I haven't run into any of this myself.   \n   \nI must say that one of the apprehensions I had about switching to OSX was that my nearly 20 years of Mac system troubleshooting voodoo skills would become obsolete. So it has. But, so far, and maybe I'm just lucky, I have found less need for such skills in OSX.\n\n"
    },
    {
      "time": "14 Mar 2003 — 2:19pm",
      "content": "Guys, it's \"wreak\".   \n   \nhhp\n\n"
    },
    {
      "time": "14 Mar 2003 — 8:02pm",
      "content": "Thanks, Hrant. It's \"havoc,\" too. ;)\n\n"
    },
    {
      "time": "16 Mar 2003 — 7:12am",
      "content": "Sorry, I thought this was the Typo-phile Forums. ;-)\n\n"
    },
    {
      "time": "16 Mar 2003 — 8:21am",
      "content": "Phourehmz I think :D\n\n"
    },
    {
      "time": "16 Mar 2003 — 12:14pm",
      "content": "Command line\n\n"
    },
    {
      "time": "31 Mar 2003 — 9:39am",
      "content": "For those interested. An article all about type and OS X from   \n [http://www.kennethwoodruff.com/type\\_in\\_OSX.htm](http://web.archive.org/web/20131011013302/http:/www.kennethwoodruff.com/type_in_OSX.htm)   \n_Typesetting and OS X   \n(or: How I Wasted 30 Hours in One Weekend)_\n\n"
    },
    {
      "time": "11 Sep 2003 — 9:05pm",
      "content": "\\> _the newest version of Suitcase, that_   \n\\> _is Suitcase XI, seems a bit peppier._   \n   \nI was always wishing that SuitCase X was a bit more spritely when I had to use it. I leapt at the chance to upgrade when I saw the XI announcement. The installation went fine, and it \\*did\\* seem peppier. That is until it started quitting unexpectedly every time I attempted to add or remove a set with more than a hundred fonts in it. Oh, and there was also the problem with the font information windows displaying the wrong foundry copyright string. Hmmm, and then it wouldn't preview any Adobe, E+F or Fontek typefaces. Peppier yes, but not very polished. I'd recommend holding off until version XI.1   \n   \nRight now, I'm still waiting for a response from Extensis tech support - two days into their promised 24 hours turn-around. Hmmph.\n\n"
    },
    {
      "time": "12 Sep 2003 — 11:48am",
      "content": "You're absolutely correct about some programs not being able to handle _massive_ collections of typefaces. And I suppose I'm in that camp. With all the libraries we juggle at [Veer](http://web.archive.org/web/20131011013302/http:/www.veer.com/), I'm dealing with 4,000+ suitcases containing well over 6,400 individual weights. (And that's not including system fonts.) However, my point is that I didn't have any capacity limitations or font management issues prior to switching to OS X. I hate hitting walls like this, because I truly believe that OS X is fundamentally better than OS 9 as an operating system. It's just not as robust a design environment at this stage in its life. I mean, ATM Deluxe never even used to break a sweat...   \n   \nAt least Panther feels a bit perkier.\n\n"
    },
    {
      "time": "12 Sep 2003 — 2:32pm",
      "content": "Keith the bottomline is by the next release of Photoshop, Illustrator and any other Adobe product you might use you will have to upgrade. I've been happy and smiling since I switched in January. An application may quit but the system doesn't. But you do have to reboot once in a while like two or three weeks. Applications tend to get strange when open to long. I use Font Reserve and since Quark didn't get onboard until its most recent release I switched to InDesign and I love the way it handles typography (can you say hang puncuation). Bite the bullet and switch. Dan\n\n"
    },
    {
      "time": "19 Oct 2003 — 3:18pm",
      "content": "For those of you who are hesitant to switch, MacOS X 10.3 (out next week) is supposed to be noticeably \\<em\\>faster\\</em\\> than previous iterations of OSX, especially on older hardware.   \n   \nThere is also a new feature ( [http://www.apple.com/macosx/features/fontbook/](http://web.archive.org/web/20131011013302/http:/www.apple.com/macosx/features/fontbook/)) which may or may not obviate the necessity of Suitcase or Font Reserve. I can't seem to find many details on it other than what's on the page. It sounds like you (Grant) have had some experience with it, and I suppose you would have mentioned it if Fontbook can replace a standalone type manager.   \n   \nWe'll see, I guess.\n\n"
    },
    {
      "time": "19 Oct 2003 — 7:54pm",
      "content": "\"Ugh, how can you love anything that doesn't support ligatures or pixel-perfect on-screen previews?\"   \n   \nMy thoughts exactly.\n\n"
    },
    {
      "time": "22 Jan 2004 — 9:11am",
      "content": "Everyone seems to like InDesign here...   \n   \nIs InDesign as stable as Quark? I have heard rumors that text moves from time to time...\n\n"
    },
    {
      "time": "22 Jan 2004 — 9:45am",
      "content": "Since I am not an InDesign user, I can only tell you what I've heard (and they may be nothing more than urban legends)   \n   \nI've heard from some of my service bureaus that some of the functions (ie hanging punctuations, optical alignment, verrtical alignment, etc...) can react differently on different computers. I guess it would be similar to having a preferences mismatch. The rumor is that InDesign will change things without necessarly asking first.   \n   \nAnyway, that is what I've heard...\n\n"
    },
    {
      "time": "22 Feb 2003 — 4:21pm",
      "content": "My experience is very much the same as Joe's and Tiffany's.   \n   \nOne thing to add: because OS X's allocation system is   \nso advanced, applications can all be open at once,   \nregardless of your RAM (provided you have enough for   \nthe OS and the front application, of course).   \n   \nAlso: You can work while apps launch! C'mon!\n\n"
    },
    {
      "time": "26 Feb 2003 — 10:23am",
      "content": "If your Epson, HP, Canon or Lexmark printer(s) are not supported in OS X, you might want to check out [Gimp-Print](http://web.archive.org/web/20131011013302/http:/www.versiontracker.com/moreinfo.fcgi?id=15970&db=mac) at VersionTracker. It saved my bacon.   \n  \nThey also maintain a list of [supported printers](http://web.archive.org/web/20131011013302/http:/gimp-print.sourceforge.net/p_Supported_Printers.php3).\n\n"
    },
    {
      "time": "11 Mar 2003 — 8:53pm",
      "content": "_you can't disable Quartz font smoothing, which is annoying._  \n  \n [Good news](http://web.archive.org/web/20131011013302/http:/www.mozillazine.org/weblogs/hyatt/archives/2003_03.html#002636): this might change by the time Safari is released.\n\n"
    },
    {
      "time": "12 Mar 2003 — 10:40pm",
      "content": "Browsers:   \nSafari rocks. Just keep in mind it's still a beta. (I still have to   \nuse IE for about 15% of the sites I frequent.) Netscape? I   \ngave up on Netscape a long time ago.   \n   \nG3s:   \nYou need **much** more RAM than 384MB if you're   \ngoing to do heavy lifting on a G3 with OS X. Most people   \nrecommend 500+ MB as a minimum for G4s even. There   \nare hacks for disabling the shadows and shading. I hope   \nyou've turned off the dock's \"genie\" effect.   \n   \nUsing the old finder style:   \nIf you're disabling the tool bar on the finder windows you   \nmay have a more OS 9-like experience, but you're missing   \nout on some of the best perks of the new finder. Do   \nyourself a favor and spend one awkward day with the   \ncolumns view and you won't ever go back.   \n   \n- Gone are the days of 30 open windows on the desktop.   \n   \n- The columns view allows you to preview the first page of   \nPDFs, Flash movies, Quicktime movies, MP3s, QTVRs, and   \neven Illustrator files without having to open them. Genius.   \n   \nApplications and RAM:   \nYeah, you can no longer control the amount of RAM   \nallocated to each app. But you don't need to. The OS uses a   \nwhole new method. Open apps no longer take up a solid   \nblock of RAM just by being open. (I admit I don't know the   \ntechnical reasons behind this.)\n\n"
    }
  ]
}
