{
  "id": "100259",
  "title": "Petition for a sane EULA",
  "forum": "Release",
  "tags": [
    "EULA",
    "font license",
    "licencing",
    "Release"
  ],
  "content": "Hi Typophiles,\n\nI'd very much like to support independent type foundries. However, it seems that they generally have more restrictive licenses than the big names. Maybe this is because they're unaware if that is legally enforcable or not?\n\nI'd like to propose the following EULA, inspired by the VIllage / Incubator EULA. Comments are given in {COMMENT}:\n\nThis is an agreement between you, the purchaser, and [FOUNDRY]. In accepting the terms of this agreement, you acknowledge understanding and promise to comply with its terms. If you do not accept the terms, please do not complete the purchase transaction.\n\nWhat you are purchasing from [FOUNDRY] is the license to use digital typeface software – hereafter “fonts” – on a certain number of computers within your organization; you are not purchasing the copyright to the design of the fonts, but the rights to use the fonts.\n\nThe fonts are provided in [FORMAT]. Additional formats may be available upon demand, and may require the purchase of supplemental licensing.\n\nWhen purchasing licensing for fonts, you may use the fonts on the maximum number of computers within your organization as specified in the license table. You can purchase additional licenses at any time, which grant you the rights to use the fonts on additional computers.\n\nThe fonts may not be used with any webfont replacement technologies without the purchase of supplemental licensing. Webfonts are provided in [FORMAT]. Please contact us for details.\n\nThe fonts may only be embedded if they are hard to extract, and are non-editable. For other applications the purchase of supplemental licensing is required. Please contact us for details.  \n[ORIGINAL: The fonts may not be embedded in other documents, such as Portable Document Format (PDF), Flash files (including sIFR), Word or PowerPoint without the purchase of supplemental licensing. Please contact us for details. COMMENT: This is absolute craziness. With the move to digital embedding in non-editable formats should be permitted.}\n\nYou may make archival copies of the fonts for your own purposes. You may not distribute the fonts to people outside of your organization. A copy of the fonts may be sent as part of a file release to a prepress bureau, if absolutely necessary.\n\nYou may only modify, convert, adapt, decompile, or otherwise reverse engineer the fonts for compatibility reasons. Any derivative words that you create may not be shared with others unless they also have a license. {ORIGINAL:  \nYou may not modify, convert, adapt, decompile, or otherwise reverse engineer or create derivative works of the fonts. NOTES: Again, this is completely ridiculous. Reverse engineering for compatibility reasons is expressly permitted by fair use law. Things such as adding glyphs can be argued to also fall under this, as they are necessary for compatibility with unicode ranges of various programmes.}\n\nWe have done everything we can to produce our fonts to the highest and most up-to-date technical standards, and we test the fonts extensively in the latest versions of technically-compliant applications. If you do experience any difficulties with our fonts, we will work with you to resolve any technical issues in the fonts. If, after we have worked to resolve any technical issues, you are still not satisfied with our software, we will be pleased to refund your money, which shall be the limit of our liability in this transaction. {NOTE: In some countries this won't be enforceable.}\n\nWe grant the rights of use of our fonts to you in good faith, and request that you adhere to the terms of this agreement to the best of your ability, and in good faith.\n\n[NAMES] is a copyright of [FOUNDRY].\n\n-------\n\nBut, you know, maybe I should just not bother with this. With open-source this is just as much an issue, because you need to be careful your work doesn't suddenly turn open source as well. However, you don't need to read through wads and wads of legalese, most of which is not enforceable anyway.\n\nCheers,  \nK\n\nPS. Some nice reading before you're deciding on a EULA:  \n [http://www.businessweek.com/news/2012-07-03/oracle-can-t-stop-software-l...](http://web.archive.org/web/20150414122435/http:/www.businessweek.com/news/2012-07-03/oracle-can-t-stop-software-license-resales-eu-court-says \"http://www.businessweek.com/news/2012-07-03/oracle-can-t-stop-software-license-resales-eu-court-says\")  \nand the case  \n [http://curia.europa.eu/juris/liste.jsf?language=en&num=C-128/11](http://web.archive.org/web/20150414122435/http:/curia.europa.eu/juris/liste.jsf?language=en&num=C-128/11 \"http://curia.europa.eu/juris/liste.jsf?language=en&num=C-128/11\")\n\n",
  "author": "karasu",
  "time": "31 Jan 2013 — 2:58pm",
  "uid": "208173",
  "comments": [
    {
      "time": "31 Jan 2013 — 7:44pm",
      "content": "[Here's a page](http://web.archive.org/web/20150414122435/http:/typophile.com/node/13840) which contains more fun links to other conversations we've had here in the past on our old friend the EULA.\n\n"
    },
    {
      "time": "31 Jan 2013 — 11:49pm",
      "content": "<cite>However, it seems that they generally have more restrictive licenses than the big names.</cite>\n\nNot sure that this is the truth. How many have you compared?\n\n<cite>The fonts may only be embedded if they are hard to extract</cite>\n\nWhat does that even mean? It's pointless to have ambiguous statements in a legal document.\n\n<cite>This is absolute craziness. With the move to digital embedding in non-editable formats should be permitted</cite>\n\nNo, you got that wrong. You are citing print licenses here. They don't apply to digital publishing, because print licenses are made for 1 to 5 local users, but for digital publishing you have thousands of users at once. That's why there are separate licenses for that.\n\n<cite>Again, this is completely ridiculous. Reverse engineering for compatibility reasons is expressly permitted by fair use law. </cite>\n\nWhich country are you talking about? Font licensing doesn't just happen in the US.\n\n<cite>Things such as adding glyphs can be argued to also fall under this, as they are necessary for compatibility with unicode ranges of various programmes.</cite>\n\nA very bold statement. And that's a great example of why EULAs are so specific in there restrictions. Otherwise it's all a matter of opinion. And again: a legal document like an EULA is pointless if it's not clear.\n\n"
    },
    {
      "time": "1 Feb 2013 — 2:18am",
      "content": "Have you seen [our licensing terms](http://web.archive.org/web/20150414122435/https:/monokrom.no/page/about_us/licensing_terms)?\n\n"
    },
    {
      "time": "1 Feb 2013 — 6:48am",
      "content": "It's important to respect how the maker of a font wants it to be used. However, society isn't about a large number of wild animals not always eating each other, and there are two things commonly seen in EULAs that disrespect other people -hence society- and should not be included:  \n- Scare tactics. Things that are not enforceable or that the maker has no intention of enforcing. Obfuscating legalese can be seen as part of this issue.  \n- No-modification clauses. Besides bordering on extortion (since it leaves the customer at the mercy of the maker's abilities and desires, often concerning defects that are the maker's fault) it ignores the role of the precedents that the maker necessary mined to make his own design.\n\nRalf, although I agree with everything you wrote, it would be nice if you could nonetheless acknowledge that something is indeed rotten in the state of Denmark.\n\nThe Monokrom EULA rules.\n\nhhp\n\n"
    },
    {
      "time": "2 Feb 2013 — 12:24am",
      "content": "As a word of caution, it is never good policy to adopt a EULA written by someone who is not a lawyer. The problems that Ralf have pointed out - and there are others, too - are significant.\n\n"
    },
    {
      "time": "2 Feb 2013 — 11:28am",
      "content": "\"This is absolute craziness. With the move to digital embedding in non-editable formats should be permitted\n\nNo, you got that wrong. You are citing print licenses here. They don't apply to digital publishing, because print licenses are made for 1 to 5 local users, but for digital publishing you have thousands of users at once. That's why there are separate licenses for that.\"\n\nWhat is the difference between using a book and using a pdf or app on an iPad? You look at content and your brain tells your hand to move so you can manipulate what you are seeing into changing to the next page. I don't get the difference?\n\n"
    },
    {
      "time": "2 Feb 2013 — 11:57am",
      "content": "<cite>What is the difference between using a book and using a pdf or app on an iPad?</cite>\n\nWe are not talking about how it looks. It's about what “font use” means – because this is what you pay for.  \nIf you license InDesign you, and you alone have the right to use that software on 1 or 2 machines. You are not allowed to distribute it on a DVD, so thousands of other people can use it to see the InDesign files you have created. You are also not allowed to give to 50 colleagues on your companies’ intranet. The price of the software is based on the numbers of users. Everyone who wants to work with the software, needs to pay for it.\n\nFor fonts, “font use” is also using the fonts as software. Which means rendering text, by extracting single glyphs from the font, applying spacing, kerning, OpenType features, hinting and the like. THAT’s the use. If you use a font this way and later export an image or vector graphic of your design, you can do whatever you like with it. It a static image. You don't need to pay for the use of that static image, just for the use of the font file while you create your design.  \nAnd that's why you cannot embed the print font in an ebook or put it on a webserver. In this case, every single reader becomes a “user of that font software”, because the font is again rendered live on the device of the user, just as it would be rendered in InDesign.  \nAnd just as you cannot redistribute InDesign as part of your work, you cannot simply redistribute fully-working fonts with your websites, apps or ebooks. You need a license that accommodates the fact, that the font is not used by 1 to 5 users in a design studio, but by possible tens of thousands of readers of an app or ebook.\n\n"
    },
    {
      "time": "2 Feb 2013 — 12:14pm",
      "content": "For real? Wow, that just does not make sense, and sound very 1998? If I license inDesign, I can make pdfs for print, web, ebook, app, whatever. If Adobe said \"you can not publish the pdfs you make online, for that you need E-In-Design\" I would say go and die and buy Quark.\n\nAs a e-book user you use the text JUST the same way as on paper. That a designer has to pay more for the 'right to use' a font because the text is drawn up from lighting pixels instead of drying ink is still way beyond my limit of reason, and as a designer (type foundries main buyers) it makes me annoyed and angry and inclined to go for free fonts rather than hassle through the legal muddy waters of these EULAs and the lack of reason behind it. The reasons you give sound, to my ears (and will all due respect) like ice-block sellers talking about a refrigerator.\n\n"
    },
    {
      "time": "2 Feb 2013 — 12:53pm",
      "content": "Have you even read what I said?  \nOf course you can create anything with InDesign and redistribute it however you like. You have paid for USING the software, not for publishing the results. But you cannot redistribute the tool (InDesign) itself.\n\nNow just replace “InDesign” with ”font”. Its a tool to create design work and you pay for using the tool, not for publishing the results.  \nText on pages in a printed book: not a \"font use\". It’s the result of a font use. Do whatever you like with it.  \nA PNG with text in it on a website or on a Kindle: not a \"font use\". It's the result of a font use. Do whatever you like with it.  \nBUT:  \nA website with webfonts or an eBook with embedded fonts: that's \"font use\". The tool itself(!) is distributed to thousands of readers and used on their devices as if they were installed. You republish the tool itself, instead of just a static image as a result of design work. And that redistribution and use on possibly millions of devices needs a special license. It's no new idea. Software is licensed per user since there is commercial software. The same is true for fonts.\n\n"
    },
    {
      "time": "2 Feb 2013 — 1:52pm",
      "content": "But if I publish a pdf of a magazine online then I'm not letting the user use the font I use for anything else but consume the content I made, just like with a printed book? Can I outline the font and be clear? Maybe I should just make jpgs and collect it to a pdf? Its less user friendly, worse design, sure, but it will protect the intellectual property at least. If you go through the hassle of \"breaking\" a typeface out of a pdf or ebook, then you are easier off going to pirate bay.\n\nAgain, sorry, but this seems like the very first music DRM-solutions the music businesses introduced. Look how that turned out. These solutions strike me as very hostile to the costumer, the designers and the consumers.\n\n"
    },
    {
      "time": "2 Feb 2013 — 2:59pm",
      "content": "<cite>Its a tool to create design work and you pay for using the tool, not for publishing the results.</cite>\n\nYes. But RE the Monokrom license, which says you can't send the fonts to the printer. But no one does that anymore, they send a pdf with fonts embedded (and subsetted). As best I can tell, the Monokrom license is not specific on that. If that's not allowed, no one in book publishing will use the fonts.\n\n"
    },
    {
      "time": "2 Feb 2013 — 3:32pm",
      "content": "Our (Monokrom’s) EULA is not perfect, but we intend to make it as reasonable and understandable as we can. You are allowed to send a PDF to the printer, but you are not allowed to send font files to the printer. I had to do that very thing a few days ago, so I don’t buy the “no one does” argument.\n\n"
    },
    {
      "time": "2 Feb 2013 — 5:08pm",
      "content": "I'm just going to add I just had a brief email conversation with Frode above here that clarified it a bit for me personally.\n\nI also get that its a hard thing to discuss properly, as no-one seem to agree on what a typeface really is. Is it a design (intellectual property), software (which I kind of still don't get, but ok) or is it a tool? The answers will differ quite a bit depending on which of these three you pick.\n\nI do think, in this day and age, that if you want as many designers as possible to use commercial fonts from the start, some steps towards clarity and accessibility should be addressed. Since Monokrom already has been called out there (or, did it themselves) they have done a great step to linguistically make the eula easy to understand.\n\nThen again, I paid about 25.000 $ a year for a design school that sent us to Dafont.com - so maybe I'm just a bit challenged on this =/\n\n"
    },
    {
      "time": "2 Feb 2013 — 5:21pm",
      "content": "BTW Tiffany, are you thinking what I'm thinking? For Typecon? :-)\n\nhhp\n\n"
    },
    {
      "time": "2 Feb 2013 — 6:32pm",
      "content": "A \\*typeface\\* is the design. A \\*font\\* is the software, the file.\n\nIn my experience with EULAs, the small “independent” foundries have more widely varying terms than the big ones, both more permissive and more restrictive. I would not label them as all one way or another.\n\nSondre: The answers to all your questions are substantially dependent on the specific license (EULA) in question.\n\nThere is no single generic set of rules about “what is permitted”; it is all down to the specific licenses involved. The Monotype agglomeration wants to charge you extra for embedding fonts in commercial ebooks and PDFs. Adobe does not. A few foundries will charge extra for any embedding, or depending on the number of copies of the ebook or PDF distributed....\n\nSo, check your license, and make buying decisions based on your needs and what the license permits.\n\n"
    },
    {
      "time": "2 Feb 2013 — 7:29pm",
      "content": "<cite>I had to do that very thing a few days ago, so I don’t buy the “no one does” argument.</cite>\n\nYeah, I didn't put it well. At best, all it really shows is who I know. If you don't mind, & just out of curiosity (& to maybe learn something), would you mind sharing the situation where you had to send fonts?\n\n(BTW, I'd never send the printer InDesign files to print from. \"Disturbing the wax\" can happen in unexpected ways, even if you've made no changes in a story, or relinked any images. And \\*that\\* means reflow is possible. Not just theory for me, we had to pay half the bill for reprinting a book because that happened -- a $2,000+ lesson.)\n\nEdit:\n\nAnother thing \"nobody does anymore\" is to check bluelines -- partly because it isn't in the conventional workflow anymore, & so is quite expensive. You can get fake blues; I guess because they're fake, \"nobody does that\" either. Because the publisher didn't get blues, we split the reprinting bill. The error wasn't caught until the books were bound, and was such that copy was lost. To make a long story even longer, what we now go through at each proof stage to make sure unwanted reflow didn't occur is a pain, but we've caught several books where this happened.\n\n"
    },
    {
      "time": "2 Feb 2013 — 10:45pm",
      "content": "<cite> would you mind sharing the situation where you had to send fonts?</cite>\n\nPersonalized prints, like catalogues with the person's name in it or personalized seasons greetings. The print shop wants a CSV or Excel file with the names and the fonts used for setting those names .\n\n<cite>Again, sorry, but this seems like the very first music DRM-solutions the music businesses introduced.</cite>\n\nThis has nothing to do with protection. Font licenses are based on the number of users since the 1980s. Now with electronic publishing the reader becomes the user, because on his device is where the use (the text rendering using the font file) happens. The definition of font use hasn't changed. It works like it has worked in the last 30 years.\n\n<cite>But if I publish a pdf of a magazine online then I'm not letting the user use the font I use for anything else but consume the content I made … </cite>\n\nSure, that's why the licenses for electronic publishing are vastly cheaper (per user) then regular desktop licenses. But it's still “font use”, i.e. “software use”.\n\n<cite>… just like with a printed book? </cite>\n\nAgain: no, it's not like a printed book. Think of my example of using InDesign vs. redistributing InDesign to every possible viewer of your InDesign files.\n\n"
    },
    {
      "time": "3 Feb 2013 — 4:59am",
      "content": "I'll start by saying I am running a typefoundry, just to give some perspective about where I'm coming from.\n\n\"- No-modification clauses. Besides bordering on extortion (since it leaves the customer at the mercy of the maker's abilities and desires, often concerning defects that are the maker's fault) it ignores the role of the precedents that the maker necessary mined to make his own design.\"\n\nI think it's the third or fourth time I read something like this from you hrant. I respect your opinion, but I have the right to disagree. Presenting your view as an absolute truth doesn't make it a truth.  \nWhen you spend 2 years on your curves and your design, getting the weight, the spacing and everything right, you don't want somebody opening your font and creating a customized version out of your work, and claiming they are font designers now. If it is so easy to \"mine precendents\", then DO IT. The difference between being inspired by Times New Roman, and opening Times New Roman in Fontlab to create a new font is HUGE.  \nAlso, you don't want people messing with your fonts, adding glyphs and such, and generating new files with broken kerning and whatever. Then your font gets printed with missing kerning and people think you've made a lousy job, and the guy who modified it won't even realize it was his fault, he might even accuse you to sell him shit.  \nOf course, sometimes these non-modification clause are limiting creativity. Sometimes the designer just wants to modify the font to create a nice poster. That is the problem of contracts and EULAs, it is very hard to protect your ass and leave space for every possible usage.  \nBut write to the foundry and explain your case and see if they will make an exception! I would.\n\nRalf H is explaining how \"it is\", and sonde is questioning the \"how it is\"  \nUntil you aknowledge that, you're just going to speak past each other.\n\nThe \"it is\" situation is not ideal, therefore the points made by sonde are not lacking sense.  \nYes an ebook is using a font vs a book where only the designer needed to buy a license.  \nBut obviously you can also understand why a publisher doesn't understand why he needs to worry about buying font licenses when before it was the designer's problem, and why it costs him more, when in the end, he doesn't necessarely sell more books.\n\nTo balance this, you could say that it doesn't make sense that somebody has to pay the same amount to design a business card for a barber and for the design of a book that will be printed 200'000 times or for the logotype of a large corporation, that can still be designed by a sole designer and converted into outlines in illustrator.  \nFont licenses are based on the amount of users, but it is mainly a way for foundries to reflect the importance of a typefaces's usage. If foundries could sell their foundries \"per print\", they would. A bit like, say, photographers, who normally get royalties each time their pictures get printed.  \nClearly, it is almost impossible for foundries to track the use of their typeface, and to license them in such way. Imagine the EULA then, that would be some mess.\n\nWhat we are experiencing is a real change in the way typefaces are considered and sold/licensed.  \nAnd the outcome is not clear yet.  \nBut what changes is that with digital it is easier to track each \"print\" of the typeface, through app downloads, product sales, etc... and foundries are trying to profit from this.\n\nBut this is normal! In the 90s, some foundries made a lot of money licensing their fonts for desktop and embedding, they were much fewer than now, and fonts were more expensive. Now you have a larger market, but definitly the amount of foundries and fonts has expanded more. The competition is fierce for a foundry to get visibility. The quality of fonts has increased, and the prices have decreased a lot. You have people with great work that don't get no money, not because their work is not worth it, but because of marketing reasons. On the other side you have people with BS fonts that know how to put these fonts in the designers faces and how to present their BS in an appealing way. So it is normal that type designers are trying to get some value back somewhere, and the digital shift is where this value is going to be, especially for quality work. On top of that you have \"free\" fonts that are adding to this mess, with, most of the time, very questionable quality.\n\nFor the people complaining about EULAs: you need to understand this situation! Making sure the EULA is covering their ass properly is difficult. Nobody wants to miss the train. An error could cost a lot to a foundry. Not every foundry has the money to pay a lawyer that will also write the EULA in simple language.  \nYou don't understand an EULA or you're not happy about it? Write to the foundry! It will take you 10 minutes and help more than complain on \"the internet\" about foundries and how annoying they are. There are people behind these websites and PDF files. Improve communication, give feedback and start the conversation! This is what most foundries want. You will also need to get their perspective.  \nWhen somebody spend 2 years on a typeface, he might be able to explain you why he doesn't want to let his work be used in a certain way, and why he sees that as detrimental.\n\n"
    },
    {
      "time": "3 Feb 2013 — 5:03am",
      "content": "_would you mind sharing the situation where you had to send fonts?_\n\nI had to prepare a test print of a magazine. We were testing the printers image post production abilities, and due to a short time frame it was easier to just send them the entire document rather than send them the images for adjustment, return them to us for insertion and before we generated a pdf to send back.\n\n"
    },
    {
      "time": "3 Feb 2013 — 8:16am",
      "content": "There are 20 posts in this thread, and I don't see anyone changing their opinion. With that in mind, Thomas summed it perfectly:\n\n<cite>So, check your license, and make buying decisions based on your needs and what the license permits.</cite>\n\nThat works for the buyer. A little harder on the font publisher. In my world, there are several book publishers that won't allow the use of any font product from certain foundries. The reasons have to do with pricing and EULAs, but that information never gets to the foundry. So for those who do publish fonts, know your markets.\n\nIn that vein, I'm not going to post to Typophile anymore. In my opinion, it is no longer a place friendly to users of type. There are some wonderful people here I intend to remain in touch with, but there are too many who treat any post from a user as grist for their agenda. I have better ways to spend my time.\n\n"
    },
    {
      "time": "3 Feb 2013 — 8:31am",
      "content": "<cite>but there are too many who treat any post from a user as grist for their agenda</cite>\n\nReally? Where?\n\n"
    },
    {
      "time": "3 Feb 2013 — 2:07pm",
      "content": "Peter, your opinion on modification is actually the majority one, so there's little pressure on you to agree with me! Plus anything I say is only ever just my opinion. But that's just like anything anybody else ever says... To me a \"fact\" is simply an opinion that's beyond a certain threshold of reliability. Anyway, I digress...\n\n> you don't want somebody ....\n\nTo me \"want\" is a four letter word. Wanting is over-rated. I _want_ people to erect a temple in honor of Patria's \"g\", and sacrifice juicy sheep there, every Friday. But that's vain and unrealistic. So I don't actually try to make that happen; I don't even pretend it ever could. Certain EULA clauses are a result of vanity or -much more often- scare tactics. Some people put a no-mod clause simply because they can get away with it - it's the trend, so nobody can point the finger only at them.\n\nIt's not a pleasant feeling worrying that some poser is going to mess with your work. But it comes with the territory, not least because -to some extent- you're \"messing with\" your sources of inspiration. And most of all, putting a no-mod clause mostly only hurts the people who are on your side, who respect you. The rest will do it anyway.\n\nNow, I certainly agree that outline theft is not the same as bona fide inspiration, and it's not OK. In fact _distributing_ even a minutely modified font is not OK (unless of course it's open-source) whether the EULA permits modification or not.\n\n> Then your font gets printed with missing kerning and people think you've made a lousy job\n\nLike Charles, who apparently completely dumps all the kerning in any font not made by Carter. In a previous age Ferrari required a buyer to prove their driving skills before being sold one of their gems. Sadly Capitalism has made that sort of thing immoral.\n\n> I don't see anyone changing their opinion.\n\nA lot of that stuff is subvisible. People might change their mind about something and not admit it (especially not in public and/or immediately). More often people will _moderate_ their position, often because they're exposed to an idea they simply hadn't considered before. Lastly, as a rule people will at a minimum learn how others feel, and refine their handling of situations.\n\nAs for what Thomas wrote, it is indeed a great Part 1. Part 2 is: If you believe a clause in a EULA is unjust, ignore it. But be prepared to face any consequences for your beliefs.\n\n> it is no longer a place friendly to users of type.\n\nActually it's friendlier to users of type than it's ever been - in fact much more often than ever before people who come to Typophile for help don't end up having to actually support type design. So maybe you mean usurpers of type... Anyway, never forget that without makers of type (sorry, I'm not counting any delusions that InDesign is a font editor...) there are no users of type, and there is no Typophile.\n\nThe truth is, you don't like most type designers, so you shouldn't expect to have a jolly ol' time here. Nobody should ask you to leave (or even keep an opinion to yourself) especially since you often contribute things of value, but whining and making a dramatic exit is neither endearing nor productive.\n\nhhp\n\n"
    },
    {
      "time": "4 Feb 2013 — 4:09am",
      "content": "<cite>Certain EULA clauses are a result of vanity or -much more often- scare tactics.</cite>\n\nPlease give examples. I really don't see any of that.\n\n<cite>Some people put a no-mod clause simply because they can get away with it</cite>\n\nPhrasing it »to get away with it« makes it sound like a crime. It's one of many possible restrictions and the license agreement is the place to put these restriction. In a clear and legally effective way. There is nothing phony about it.\n\nAnd I have said this in an older thread: That modification clause might be interesting to you, but it is not interesting to most font users. So I don't know why you emphasize it over and over again. Software is made to be used, not recompiled and modified. Only a tiny fraction of users ever needs to modify font files themselves, and another tiny fraction of those users is able to do this without breaking something in the font.  \nIf a user needs a modification, they can just ask. There is a good chance, especially with smaller foundries, they might receive a new file within 24 hours.  \nThe alternative is: they mess around with the font in FontLab. That file then gets spread around on hundreds of computers in a company. User's complain because something doesn't work. They call the foundry, which then spends hours trying to replicate that error –&nbsp;without success, only to find out later, maybe, that someone messed with the files …  \nNo one needs this. Not the foundry and not the user. If you really need to modify the fonts, just ask. If it's not allowed, then you might use other fonts. But being a type user myself I don't need to force all foundries to remove their no-modifcation clauses, just because I would be able to do minor modifications myself. It's not standard type use and that's why a standard license agreement doesn't have to reflect that.\n\n"
    },
    {
      "time": "4 Feb 2013 — 4:44am",
      "content": "_Another thing \"nobody does anymore\" is to check bluelines -- partly because it isn't in the conventional workflow anymore, & so is quite expensive_\n\nNot necessarily; if you have a CTP/RIP-once-print-many system in place, you will get reliable “bluelines” or “Chromalins” from inkjet or laser printers calibrated for the system, at nomimal cost…\n\n"
    },
    {
      "time": "4 Feb 2013 — 6:33am",
      "content": "> Please give examples.\n\nI can't give examples - it's just my interpretation.\n\n> Phrasing it »to get away with it« makes it sound like a crime.\n\nI wouldn't call it a \"crime\", but it _is_ opportunism = taking advantage of people's situation.\n\n> In a clear and legally effective way. There is nothing phony about it.\n\nIn the US at least, I can't accuse the legal system of being clear and sincere...\n\n> [the no-modification clause] is not interesting to most font users.\n\nThe whole EULA is not interesting to most users! Most users don't even know what a EULA is... But we make them anyway. I guess the reason I emphasize the no-mod clause is the good news: it's the only really sore spot for me. But users \"simply asking\" to be allowed to modify a font is a non-starter: why would a foundry put a no-mod clause if it didn't generally mind? And your scenario about a modified version causing problems doesn't make sense: if that happens, the foundry can easily tell it's been modified, and either sue the client or charge a lot of money to fix the problem. The foundry wins!\n\n> I don't need to force all foundries to remove their no-modifcation clauses\n\nYou're right. You just need to ignore the clause.\n\nThe only reason I'm \"lobbying\" this is because I think it's unethical. Because I'm not a lawyer.\n\nhhp\n\n"
    },
    {
      "time": "4 Feb 2013 — 7:04am",
      "content": "<cite>if that happens, the foundry can easily tell it's been modified …</cite>\n\nNo, because the user will usually just complain about a problem and not start the phone call with »we modified your font and now have problems with it«. The actual user who has the problem might not even know that file was changed. I am speaking from experience here. The user's don't care where that file comes from or what version number is has. They just have a problem and want it fixed.\n\n<cite>why would a foundry put a no-mod clause if it didn't generally mind?</cite>\n\nThey do mind. But it's most helpful for both sides, if both sides know, what's going on. If the user just wants to add a new currency sign or correct a kerning pair, the foundry might just do that and send the new fonts for free. It might even be helpful feedback for the foundry. But if they don't know and the user messes around with the fonts, this might cause the user endless hours of testing and bug-fixing.  \nIf the user happens to be a type-designer who can do stuff like that without breaking the font, then the foundry might just give him the permission to do it.  \nIn both cases, starting a dialogue with the foundry takes just minutes and helps both sides.\n\n<cite>You're right. You just need to ignore the clause. The only reason I'm \"lobbying\" this is because I think it's unethical. </cite>\n\nSigning a contract with the intention not to honor it would be very unethical. So you ask the foundry before you purchase the license and then base your purchase decision on their answer. It's simple.  \nI don't see why we need to make such a fuzz about it and change 100% of the contracts, so 0.1% of the users are freed from the requirement to ask before they make a change to a font.\n\n"
    },
    {
      "time": "4 Feb 2013 — 9:15am",
      "content": "It's certainly true that we often pay for user ignorance. But a EULA doesn't really prevent that much.\n\nHere's how your scenario should work:  \n- Client modifies a font, messes it up, and gets stuck.  \n- They call you.  \n- You ask for a copy of the problem font, and can prove it's been modified. That's pretty much the only up-front cost you need to incur - sort of like a car mechanic giving you a free estimate to fix the problem.  \n- You tell them they broke the EULA, but you'll be nice and not sue them, and fix the problem for $X.\n\nNow, in the case of a company like MS that doesn't directly make money from fonts (and has much dumber users) the PR damage isn't worth it, so a no-mod clause makes sense there (which however does not mean it should always be respected - life happens). But for a font business, the money offsets that handily.\n\n> starting a dialogue with the foundry takes just minutes\n\n... and can cause the foundry to say \"no\", and keep a close eye on you.\n\n> It's simple.\n\nNo, life is not simple.\n\nEverybody pays for being unreasonable. When a foundry has an unreasonable clause in their EULA, they pay for it, one way or another. Fighting unethical behavior is exactly what I'm talking about. I don't want to live like a lawyer, sorry.\n\nhhp\n\n"
    },
    {
      "time": "4 Feb 2013 — 9:55am",
      "content": "<cite>When a foundry has an unreasonable clause in their EULA</cite>\n\nProbably.  \nBut since font modification is (again) no regular font use and only interesting to a small percentage of users, I don't see the »unreasonable part«. Quite the opposite: It's very reasonable to exclude unusual use.  \nThat's the whole point of standard EULAs: They cover what is allowed and not allowed in regular scenarios. And the regular fonts with regular EULAs are only this cheap, because they don't need to accommodate every possible use, but only the regular use. That's why we have invented them in the first place, instead of negotiating every license separately.  \nJust like with renting a car. There is a standard contract based on standard use and if you have special requirements, you need to negotiate this separately. Simple.\n\nSo, I understand that you as a single user might have the personal requirement to be able to edit the fonts you license. But that is then just a personal requirement. »Unethical« and »unreasonable« are terms that need some sort of community who agrees, that a certain regulation is unethical or unreasonable. A restriction is not unethical or unreasonable just because it's a restriction. There might be good reasons for it.  \nRestricting uncommon use in standard software agreements is very reasonable to me. I don't expect to be allowed to modify a rental car, I just want to drive it. I don't expect to modify InDesign, I want to use it. I don't expect to modify fonts, I want to use them. That's AFAIK very human.  \nAnd if I should ever run into a situation where I need to make modifications, I would just ask, and not brand all car rentals or software makers unethical, because they didn't allow me those modifications in the first place …\n\n(That's my final statement. I am not interested to continue this discussion for 10 pages. I would delete my subscription for this thread now, if that shitty Drupal board would have that option.)\n\n"
    },
    {
      "time": "4 Feb 2013 — 1:16pm",
      "content": "_There are 20 posts in this thread, and I don't see anyone changing their opinion._\n\nWell, if anyone goes into a discussion with the objective to change the others mind then we'll never get anywhere. Me, amongst others I'm sure have certainly got a more nuanced view on this thanks to both critical designers and spokespersons from foundries clearing up some whys. Isn't that the ultimate goal of being on a forum in the first place? The pooling of ideas, experiences and opinion of a diverse group of people, so as many as possible can share their views and everyone comes out on the other side with a more nuanced view, even if they change their opinion or not.\n\nI know I've gotten some invaluable information and views here, so – don't attack the form.\n\nMy personal opinion is still a bit frustrated that fonts are looked upon so strongly as intellectual, non-transferable property, and not tools. But, I get it. And it's frustrating for everybody.\n\n"
    },
    {
      "time": "4 Feb 2013 — 1:17pm",
      "content": "Here's my long reply for all the points raised in this thread: [http://pastebin.com/98LZp2b0](http://web.archive.org/web/20150414122435/http:/pastebin.com/98LZp2b0 \"http://pastebin.com/98LZp2b0\")\n\nThe short version:\n\nThe EULA page on Typophile is interesting. We should add a list of foundries with permissive EULAs to this list (I just did). Monokrom.no is a good first nominee. Feel free to add any more foundries you know that fit the requirements.\n\nMany licenses disallow resale, although this is allowed by EU law. I would consider this an unethical EULA at it covers up user rights.\n\nWhether or not a EULA allows modifications is a good 'litmus paper' for checking the general reasonability of the EULA as well as the designer. Most designers will feel protective of their 'children', but modifications are just a fact of life.\n\n@ Ralf H. \"That's my final statement. I am not interested to continue this discussion for 10 pages.\" Way to go. But I think we can indeed see the discussion as closed, as you're not going to change your mind, and neither is xy. I've made a list of friendly EULAs at [http://typophile.com/node/13840](http://web.archive.org/web/20150414122435/http:/typophile.com/node/13840 \"http://typophile.com/node/13840\"). Unfortunately a list of unfriendly EULAs would be too unwieldy.\n\nPlease see the linked PasteBin on top for the full replies to individual posters, as I did not feel that a post of 10 pages would be seen as very agreeable.\n\n"
    },
    {
      "time": "4 Feb 2013 — 1:22pm",
      "content": "/ My personal opinion is still a bit frustrated that fonts are looked upon so strongly as intellectual, non-transferable property, and not tools. But, I get it. And it's frustrating for everybody. /\n\n@ sondre m\n\nThis is my frustration exactly. They are more like tools than painting.\n\nIf you live in the EU you can live happily in the knowledge that if you bought a desktop version of a font, you're probably entitled to resell it. (See the Oracle v. UsedSoft case.)\n\nAlso, indeed the forum is a good place to at least understand other people and their motivations, even if we don't agree with them in the end.\n\n"
    },
    {
      "time": "4 Feb 2013 — 1:44pm",
      "content": "_Many licenses disallow resale, although this is allowed by EU law. I would consider this an unethical EULA at it covers up user rights._\n\nBut if a typeface is intellectual property then resale of the digital file isn't covered by EU law, like a physical item? You can't resell an mp3? I know the ownership of digital files is still a grey area ALL OVER, far beyond typography, so maybe the wrong tree to bark at?\n\n"
    },
    {
      "time": "4 Feb 2013 — 1:46pm",
      "content": "_This is my frustration exactly. They are more like tools than painting._\n\nI guess this is where graphic designers and type designers never will see 100% eye to eye, what is a design and what is a design-tool? Slippery slope.\n\n"
    },
    {
      "time": "4 Feb 2013 — 1:50pm",
      "content": "Replies to Typophile posts should be on Typophile - don't feel bad about copying that PasteBin stuff here.\n\nhhp\n\n"
    },
    {
      "time": "4 Feb 2013 — 2:24pm",
      "content": "> Here's how your scenario should work:  \n> - Client modifies a font, messes it up, and gets stuck.  \n> - They call you.  \n> - You ask for a copy of the problem font, and can prove it's been modified.\n\nBut technically, they can't send you a copy of the problem font without violating the EULA! ;-)\n\n"
    },
    {
      "time": "4 Feb 2013 — 2:43pm",
      "content": "@ hrant: I thought about attaching it as a file to my post, but unfortunately the forum uses some kind of Flash app, which I do not have installed for security reasons. Feel free to attach it to a post of yours.\n\n@ sondre m: Please read this: [http://www.businessweek.com/news/2012-07-03/oracle-can-t-stop-software-l...](http://web.archive.org/web/20150414122435/http:/www.businessweek.com/news/2012-07-03/oracle-can-t-stop-software-license-resales-eu-court-says \"http://www.businessweek.com/news/2012-07-03/oracle-can-t-stop-software-license-resales-eu-court-says\")\n\n"
    },
    {
      "time": "4 Feb 2013 — 3:24pm",
      "content": "_@ sondre m: Please read this_\n\nInteresting. I won't go too far with this, because this thread shouldn't stray too far into the \"what is ethical?\"\n\nBut, I do want to defend the foundries on this. A typeface (hopefully) doesn't date, the same way a version of Adobe software does. So, transferable licenses would signify quite the loss for type foundries, and a big vote of trust that everyone who sold a license would delete their copy. It would also mean that sooner or later, type foundries will invent a font-DRM. And, all things considered, a whole lot of technical headache.\n\nBut again, maybe a foundry or type designer can come and set the record straight here. The article refers to production software. But if the design and intellectual property is trademarked and owned by the designer then a license to use it is different, right? (not claiming anything here, just asking to understand, sorry for prodding)\n\n"
    },
    {
      "time": "4 Feb 2013 — 3:34pm",
      "content": "@ sondre m\n\nIn principle the type of software shouldn't matter. What matters is that the software is sold for an indeterminate amount of time. The legal argument is that the economic value has been caught in the transaction. This legal ruling will mean that either: a) prices are raised, b) DRM is implemented (this can probably can and will be legally circumvented), c) you get temporary licenses (these are non-resellable), d) we move to cloud licenses (this has already happened for a lot of software), e) we continue as is.\n\n"
    },
    {
      "time": "4 Feb 2013 — 3:59pm",
      "content": "If foundries get to charge 10$ or even only 5$ for every time a designer uses their fonts to produce a book that is printed and bound for thousands of dollars, instead of the scandalous 30 or 50$ that it costs now for a lifetime license, oh boy I'm so in!\n\n"
    },
    {
      "time": "4 Feb 2013 — 4:19pm",
      "content": "@ hrant\n\n/ BTW Tiffany, are you thinking what I'm thinking? For Typecon? :-) /\n\nEnlighten us :)\n\n"
    },
    {
      "time": "4 Feb 2013 — 6:36pm",
      "content": "_If foundries get to charge 10$ or even only 5$ for every time a designer uses their fonts to produce a book that is printed and bound for thousands of dollars, instead of the scandalous 30 or 50$ that it costs now for a lifetime license, oh boy I'm so in!_\n\nWhat happens when I use it for my design agency stationary for example? 5$ per invoice I print out? Or for the \"design project\"? Seems like even more of a minefield – legally, ethically and as a service product.\n\n"
    },
    {
      "time": "4 Feb 2013 — 11:11pm",
      "content": "<cite>Many licenses disallow resale, although this is allowed by EU law. I would consider this an unethical EULA at it covers up user rights.</cite>\n\nKeep in mind, that this was ruled for one specific case (UsedSoft vs. Oracle) in 2012. You can't expect that all software makers are monitoring each and every law suit in every country and adapt their EULAs all the time based on local laws. Then the EULAs would be 10 times and longer and do we really want that?  \nWe will have to see how this Oracle case ruling will affect software sales and use in general and how similar cases are handled in future lawsuits. The ruling itself is very understandable from the user’s point of view. From the vendor’s point of view it makes things pretty complicated, because anyone can claim support for software without having a license on file with the vendor …\n\n<cite>Way to go. But I think we can indeed see the discussion as closed, as you're not going to change your mind, </cite>\n\nI was referring to the discussion of no-modification clauses with Hrant, not discussing EULAs in general.\n\n<cite>I've made a list of friendly EULAs at …</cite>\n\nWhat exactly is more reasonable in the Monokrom EULA than any other EULA? The only difference I see is the general layout of using the casual »you may …« and »you may not …« statements.  \nIt even has restrictions other EULAs don’t: »No, you may not: Use the font software in the creation of alphabet products.«\n\nAnd it is short, which is nice, but since it is short, it doesn't answer typical questions: What about PDF or SWF embedding? What about font management servers? It's not mentioned.\n\nSo before you devide EULAs in sane/ethical and insane/unethical please check the facts. An EULA doesn't favor the user just because it is short and avoids typical lawyer terms.  \nIn fact, it might even be the other way around: as a user you can only claim your rights, if you find them specifically mentioned in the EULA and if they are written in a way that is legally enforceable.\n\n"
    },
    {
      "time": "5 Feb 2013 — 7:34am",
      "content": "_So before you devide EULAs in sane/ethical and insane/unethical please check the facts. An EULA doesn't favor the user just because it is short and avoids typical lawyer terms._\n\nMaybe not, but it's much more **user friendly** – which is a factor that seems many foundries don't really care about. Selling font is a service, and communicating the EULA is part of that service (a touch point if you are into service design). The Monokrom EULA touches upon the **main issues encountered by a designer** (99% of their buyers), and for most people will be everything they ever need to know. If you have a special need, their e-mail is easily accessible and you can ask in special cases.\n\nWhat is or isn't included I'm not going to comment about, I'm relatively new to this game (at least on this level) and still finding my way to working within the actual limits of EULAs. What I feel as a designer is that Monokrom has gone a long way making the license more accessible to their customers, and having a good direct dialogue with designers such as myself who has questions regarding it. I'm not saying its perfect, but at least shows a good attitude to the service part of running a business.\n\n"
    },
    {
      "time": "5 Feb 2013 — 8:59am",
      "content": "There are at least two great things about the Monokrom EULA:  \n- It allows modification.  \n- It treats the user with respect, not as somebody who needs to be tricked.\n\nThe large of number of \"just ask us\" endings might seem like a weakness, but it could also be seen as a sign that Monokrom is open to dialog, to treating people case-by-case. Now, this is not very scalable, but if/when Monokrom grows it can acquire a more elaborate EULA. Although that's sort of like a country discovering it has a lot of oil: be careful it doesn't end up ruining you!\n\nYou know what else is great about Monokrom? The prices are round numbers. None of that tacky \"99\" business (which I've avoided myself from day one). That also conveys respect.\n\nhhp\n\n"
    },
    {
      "time": "5 Feb 2013 — 5:16pm",
      "content": "Huhu, random with the reference to oil nation, eh? (Ref. Monokrom beeing Norwegian) :P\n\n"
    },
    {
      "time": "6 Feb 2013 — 7:56am",
      "content": "It would be interesting to know which lawyer was consulted to create the monokrom license.\n\nFoundries are not using complicated EULAs for the pleasure of being annoying and user-unfriendly.  \nBut because everybody says you should go see a lawyer for your license, and they do, and the lawyer prepares a document, which the foundry can't just take apart and rewrite for the sake of being nice, without taking risks.  \nMaybe monokrom got a great lawyer who understands that people have a hard time reading such legalese.  \nOr they decided to take this risk of having a less safe eula for them, to make something user-friendly.  \nSounds very nice, but if they have a big lawsuit one day, and they loose because the eula was not solid enough, no doubt that the next eula will not be as easy-going.  \nYou can appreciate that they take such risk, but you can't blame everybody else who doesn't want to expose their fragile business.\n\nYou make an eula not for the 99.9% of normal and nice customers who just want to use the font, you prepare it in such a way to avoid leaving loopholes for the 0.1% of customers who might want to f### you if they can.\n\nAs for the \"monokrom is so nice because they say \"just aks us\"\", that is exactly what I have said about every eula. Have a question, write an email to the foundry. Monokrom is not more open to dialog than any other foundry. Write to anybody about their eula, they will answer too. This is getting a bit ridiculous.\n\n"
    },
    {
      "time": "6 Feb 2013 — 8:44am",
      "content": "Monokrom has a business guy on board. But as nice as that guy might be, the magnanimity is coming from Frode and Sindre.\n\nRisks? Yes!\n\n> Foundries are not using complicated EULAs for the pleasure of being annoying and user-unfriendly.\n\nYou can't make such a blanket statement - there are all kinds of foundries out there. But I wouldn't use those two terms; it's more like \"obfuscating\" and \"intimidating\".\n\nOne thing I would ask here is: why is a no-mod clause the norm now whereas it was the exception a few years ago?\n\n> Monokrom is not more open to dialog than any other foundry.\n\nIt think they're more open than average, but anyway my point was that Monokrom seems more willing to treat users as people rather than wallets. Basically they (and foundries like Shinn Type and Adobe) are a _good influence,_ plain and simple.\n\nRidiculous? That's what lawyers are for.\n\nhhp\n\n"
    },
    {
      "time": "6 Feb 2013 — 9:54am",
      "content": "<cite>but if they have a big lawsuit one day, and they loose because the eula was not solid enough, no doubt that the next eula will not be as easy-going.</cite>\n\nBy the way: that risk is also on the user’s side!  \nThere have been plenty of EULA related law-suits in the last couple of years. Some foundries claimed a damage in the millions, because of uses that broke the EULA. Understandably, especially larger clients now are very cautious about that. They want each and every possible use specifically mentioned in there, so they have it in ink that their font uses are covered. A short and friendly EULA like the one of Monokrom won't help those companies at all. Those companies want that kind of EULA everyone here seems to hate.\n\n<cite>… my point was that Monokrom seems more willing to treat users as people rather than wallets.</cite>\n\nI don't see how that conclusion can be drawn from the tone or simplicity of an EULA. I don't want to criticise their EULA in any way, but I am surprised about the reception of it. If I rent a car, it might be nice if they just hand over the keys and say »drive carefully! If something goes wrong, just call us, we figure something out«. That's friendly, but it's not how a license should or can work. Both parties need to agree up front about the details of the use. That the best way to go for both sides! If I have read my obligations as user of that rental car in ink, I know how to handle it and I know what to expect, should something go wrong. There might be a much bigger risk in signing a contract that isn't clear about the details …  \nAnd looking at the details in the Monokram EULA (at least the ones that are mentioned) I don't see much difference to the EULA of other independent foundries. So I am a little bit puzzled here. For years I hear that EULA clauses are “insane”, but if you have the same clauses, but say them in a soothing tone, then everything is okay?\n\nI have heard many things here about EULA clauses: absolute craziness, ridiculous, unethical, scare tactics, obfuscating, intimidating, and so on …  \nI don't know if we have read the same EULAs or talking about a parallel universe. I am suggesting, that for further discussion, those EULA clauses are actually quoted here, so we can actually compare the clauses and talk about the facts instead of creating a scary mythological EULA beast, that came from the depths of the sea, send by lawyers to scare the poor font users and to take all their money.  \nMaybe we can then bust some myths, instead of helping them to grow.\n\n"
    },
    {
      "time": "6 Feb 2013 — 10:03am",
      "content": "> A short and friendly EULA like the one of Monokrom won't help those companies at all.\n\nWhich is when they send an email to the foundry.\n\nBTW, long does not have to equate to unethical.\n\n> If I have read my obligations as user of that rental car in ink\n\nYou read your rental car agreements?! Come on.  \nWhy do you think they're so nasty? So you don't read them! :-/\n\nMaybe in Germany the profession of law isn't so unethical, but in the US (which happens to be the biggest font market) it's arguably the worst thing in society. It's nothing short of crippling, and is part of the reason China is passing us.\n\nPractically speaking however, the main Good Thing about the Monokrom EULA that stands out is the allowing of modification. It's not a huge deal to most people, but it's better than the other way around.\n\nBTW, have you read the Emigre EULA? (Unless they changed it.)\n\nhhp\n\n"
    },
    {
      "time": "6 Feb 2013 — 10:30am",
      "content": "<cite>Which is when they send an email to the foundry.</cite>\n\nAn email stating, that certain things would be allowed doesn't replace a contract. That's why you have a lawyer prepare an EULA in the first place …\n\n<cite>but in the US (which happens to be the biggest font market) it's arguably the worst thing in society.</cite>\n\nAgain, you make very general statements, accusing lawyers in general and the foundries who hire them. Let’s talk about what is actually in certain EULAs.\n\n<cite> the main Good Thing about the Monokrom EULA that stands out is the allowing of modification. </cite>\n\nWe started our foundry in 2004 and allowed font modifications from day one. It's not such a big deal.  \nThings like “posting static PDFs online” only for an additional fee is a much more controversial subject –&nbsp;because that actually can be considered common font use today.\n\n"
    }
  ]
}
