{
  "id": "100207",
  "title": "Semplicita - display only?",
  "forum": "Design",
  "tags": [
    "architect",
    "logo",
    "Semplicità",
    "Design"
  ],
  "content": "Dear Typophiles, I'm in the process of setting up my own architectural firm and contemplating about using Canada Type's Semplicita for the logo - and potentially for more. I'm intrigued by its combination of Futura geometry and the humanist shapes - somehow sits well with my ideals of modern Architecture, rooted in the modernist era of the early 20th century but less rigid and ideological.\n\nHaving said that, I'm less sure about suitability of Semplicita as a text font, say for brochures, letters, certificates and the like. Any comments on that? And if not suitable in your eyes, what would a good complementary sans serif text font be?\n\n",
  "author": "filoug",
  "time": "30 Jan 2013 — 9:55am",
  "uid": "11291",
  "comments": [
    {
      "time": "30 Jan 2013 — 10:07am",
      "content": "Any sans will have trouble carrying a lot of text. However one thing that helps Semplicità here is its modest x-height, since ascenders contribute a lot to immersive reading. So: you could do worse! But if you're set on using a sans, and must deliver a lot of text, do also consider Legato - see the last entry here:  \n [http://typographica.org/on-typography/our-favorite-typefaces-of-2004/](http://web.archive.org/web/20130819162328/http:/typographica.org/on-typography/our-favorite-typefaces-of-2004/ \"http://typographica.org/on-typography/our-favorite-typefaces-of-2004/\")\n\nWhat would be ideal is if you could commission a large–x-height version of Semplicità for uses besides running text. If you could come up with a budget for that, there are a number of people here who could do that for you, including Claudio Piccinini\\*... and yours truly\\*\\*. :-)\n\n\\* [http://www.typophile.com/user/1316](http://web.archive.org/web/20130819162328/http:/www.typophile.com/user/1316 \"http://www.typophile.com/user/1316\")\n\n\\*\\* hpapazian at gmail dot com\n\nBTW:  \n [http://www.typophile.com/node/79597](http://web.archive.org/web/20130819162328/http:/www.typophile.com/node/79597 \"http://www.typophile.com/node/79597\")\n\nhhp\n\n"
    },
    {
      "time": "30 Jan 2013 — 11:05am",
      "content": "They have a specimen pdf that shows text settings - it seems to work ok - has some of the feel of Gill Sans in text setting.\n\n"
    },
    {
      "time": "30 Jan 2013 — 12:05pm",
      "content": "I wish to thank Hrant, for the heads-up, but I think that for the branding of an architectural firm makes more sense, and is also more economical, to license a pre-existing typeface. At least that’s my opinion, I have never done type design on commission, and I generally feel uncomforable about the idea of designing a typeface, albeit derived, on a schedule.\n\n@filoug: I don’t know how much you care about faithfulness, but Canada Type Semplicita doesn’t represent a faithful adaptation of Semplicità: there are forms – even signature forms – modified and arbitrarily straying from the original alphabet. If you have to choose an existing font family to licence, there would be Durotype Simplo, but some letters are really badly drawn (i.e. the [a], for which it seems they took a single size as a model, possibly a small one, and then redrawn it quite loosely.\n\nRather than using either of those, I’d suggest you to look for the qualities you are looking for in a recent design. Kris Sowersby’s [Karbon](http://web.archive.org/web/20130819162328/http:/klim.co.nz/retail-fonts/karbon), for example, blends very skillfully different influences – Butti’s Semplicità being among them, and is also very well drawn and produced. May be more costly, but always less costly than commissioning a custom typeface. :)\n\n"
    },
    {
      "time": "30 Jan 2013 — 2:15pm",
      "content": "Is there a name for this genre of type with “truncated stem endings” in the lower case?\n\nBernhard Gothic introduced the idea.\n\n"
    },
    {
      "time": "30 Jan 2013 — 2:24pm",
      "content": "Hmmm, maybe fixing/modifying Durotype Simplo is the best avenue.\n\n> less costly than commissioning a custom typeface.\n\nBut you _do_ get to own/use something unique, which is central to identity/branding.\n\nNick, I think it's called \"stemless\".\n\nhhp\n\n"
    },
    {
      "time": "3 Feb 2013 — 4:51am",
      "content": "Hrant, thanks for pointing me towards [/node/79597](http://web.archive.org/web/20130819162328/http:/www.typophile.com/node/79597) which I had overlooked during my search. Very interesting indeed. I do go with Piccic though and think that commissioning my own font would probably be slightly over the top in my case.\n\nPiccic, I hate to say it, but faithfulness to the original Semplicità is not on the top of my list of priorities (I'm an architect, not a typographer after all!). I've had a look at Simplo which as you say may be closer to the original; it seems slightly 'over the top' for me though (the [t] for example) - not really that 'simple' as the name suggests?\n\nThanks for pointing me towards Karbon which I had not come across before. Looks nicely assembled and as you say well produced, but I really don't like the bold [e] which is too much of a Gill offspring, and the [m] generally doesn't work for me.\n\nIn case I end up with Canada Type's Semplicita, what would in your eyes be a good complementary _serif_ text font?\n\n"
    },
    {
      "time": "15 Feb 2013 — 6:56pm",
      "content": "Any suggestions: a serif text face that works well with Canada Type's Semplicita?\n\n"
    },
    {
      "time": "16 Feb 2013 — 11:20am",
      "content": "Candida.\n\n"
    },
    {
      "time": "25 Feb 2013 — 3:05am",
      "content": "Nick, Candida is a great choice - the [a] with the fat stomach in particular! Really like them together. Just wish it was a little more up to date as a font, e.g. will miss things like the € symbol, old style figures and the like.\n\n"
    },
    {
      "time": "25 Feb 2013 — 12:21pm",
      "content": "I’m surprised it hasn’t been updated.\n\n"
    },
    {
      "time": "25 Feb 2013 — 8:56pm",
      "content": "[Linotype's Candida](http://web.archive.org/web/20130819162328/http:/www.linotype.com/44146/candidaroman-font.html) has the Euro symbol.\n\nAdobe hasn't produced a Pro version, and who knows what Bitstream has or does or is doing.\n\n- Herb\n\n"
    },
    {
      "time": "26 Feb 2013 — 2:38am",
      "content": "Just saw that [Bitstream's Candida](http://web.archive.org/web/20130819162328/http:/www.myfonts.com/fonts/bitstream/candida/) also has the [€] symbol plus the added benefit of no weird strike through the [7].\n\n"
    }
  ]
}
