{
  "id": "100289",
  "title": "Failed Font Experiment",
  "forum": "Build",
  "tags": [
    "fontlab",
    "Python",
    "Robofab",
    "Build"
  ],
  "content": "I recently completed a failed font experiment, and, although I don't know if it's of any interest to anyone, I thought I'd share it anyway. If my wasted time fuels someone else's creative endeavors, then it wasn't entirely wasted.\n\nThe concept was weighting glyphs in a font based on their frequency of use in a given text canon. So, for example, my plan was to have a Shakespeare version of the font, a Brontë version of the font, etc. The less frequently a character is used in the canon, the darker the character would be in the font.\n\nIn any case, a more detailed writeup that includes python scripts and examples [can be read here.](http://web.archive.org/web/20140810043640/http:/www.fogbound.net/archives/2013/01/30/failures-in-typographical-experimentation/)\n\n",
  "author": "writlarge",
  "time": "1 Feb 2013 — 11:02am",
  "uid": "184504",
  "comments": [
    {
      "time": "1 Feb 2013 — 12:13pm",
      "content": "Cool idea.  \nIt ostensibly (but probably not really :-) helps readability.\n\nhhp\n\n"
    },
    {
      "time": "4 Feb 2013 — 2:06am",
      "content": "Given the application to literature it may well have yielded intriguing results (in that context) if applied to whole words and then if tweaked for frequency analysis based on selectable criteria, such as words containing particular letters, or more unusual words. It would be a nice feature in an e-reader and could possibly aid accessibility and readability, as Hrant notes.\n\nI am also reminded of the article _About the Typefaces Not Used in This Edition_ by, Jonathan Safran Foer:\n\n[http://www.guardian.co.uk/books/2002/dec/07/guardianfirstbookaward2002.g...](http://web.archive.org/web/20140810043640/http:/www.guardian.co.uk/books/2002/dec/07/guardianfirstbookaward2002.gurardianfirstbookaward \"http://www.guardian.co.uk/books/2002/dec/07/guardianfirstbookaward2002.gurardianfirstbookaward\")\n\n"
    },
    {
      "time": "4 Feb 2013 — 10:27am",
      "content": "> applied to whole words\n\nOr boumas! Although those are too shifty.\n\nThank you for sharing that Guardian piece - very funny!\n\nhhp\n\n"
    },
    {
      "time": "5 Feb 2013 — 7:53am",
      "content": "> Thank you for sharing that Guardian piece - very funny!\n\nGlad you enjoyed, and nice to see something archived so well on the web! If only we could do the same for Typophile!\n\n"
    }
  ]
}
