{
  "id": "100226",
  "title": "Left Handed Design",
  "forum": "Design",
  "tags": [
    "hand writing",
    "Left Handed",
    "Design"
  ],
  "content": "So, I've begun designing a typeface which mimics left handed characteristics. The way I see it I have two options: create a curled hand (crabclaw) or an uncurled hand.\n\nSome characteristics include a reversed ductus for the \"curled\" hand.\n\nIf it is uncurled, which is the the way I'm leaning (pun intended) I am also considering a left leaning \"roman\" to incorporate the left leaning writing that occurs when writing on a horizontal page. Currently I am working towards this left leaning \"roman\" (is that the right term?) and a more upright italic. Because the strokes are pushed in this situation, I am considering a contrast that thins proportionately from the start of the upstroke.\n\nSO\n\nI was wondering if anyone knew of anything attempted like this before? Any special characters that are unique to left handed writing (I've heard whispers of the K), and any general thoughts.\n\n",
  "author": "qkeave",
  "time": "31 Jan 2013 — 12:34am",
  "uid": "197936",
  "comments": [
    {
      "time": "31 Jan 2013 — 3:16am",
      "content": "Oh, and the cross bars are drawn from left to right. Such as on t, f, A, E, F, H, T, X.\n\n"
    },
    {
      "time": "31 Jan 2013 — 6:09am",
      "content": "Interesting stuff. Visuals?\n\nBTW you might like to read this:  \n [http://www.typophile.com/node/48843](http://web.archive.org/web/20130819221120/http:/www.typophile.com/node/48843 \"http://www.typophile.com/node/48843\")  \nEspecially John Hudson's experiments on page three.\n\nhhp\n\n"
    },
    {
      "time": "2 Feb 2013 — 10:29pm",
      "content": "...that thread spiraled out of control.\n\n\\>You want fervor, you got it.  \n.... wow\n\nHrant: Can I see, can I see?!  \nJohn Hudson: Can't you imagine, can't you imagine? :)  \nMe: I have so much more to imagine now\n\nVisuals are secret (embarrassed since I learnt so much in the last 8 hours and need to rework it:\\)\n\nbut here's a 1549 reverse italic (thats early right?)\n\n ![](http://web.archive.org/web/20130819221120im_/http:/typophile.com/files/IMG_0067edit_5825.jpg)\n\n ![](http://web.archive.org/web/20130819221120im_/http:/typophile.com/files/IMG_0058-1edit_4069.jpg)\n\n"
    },
    {
      "time": "2 Feb 2013 — 10:37pm",
      "content": "Wow. Was there a hurricane when the guy wrote that?\n\nhhp\n\n"
    },
    {
      "time": "3 Feb 2013 — 10:21am",
      "content": "there was also a \"thread\" of anamorphic painting during the renaissance, eg the skull in Holbein's Ambassadors, or Parmigiano's self-portrait in a sphericall mirror.\n\n"
    },
    {
      "time": "3 Feb 2013 — 1:19pm",
      "content": "@Nick  \ndo you mean to say the 1549 reverse italic might have been inspired by that interest in reflections?\n\n"
    },
    {
      "time": "3 Feb 2013 — 3:54pm",
      "content": "it's imposible To know where inspiration comes from, all one can note is similarities.\n\n"
    },
    {
      "time": "4 Feb 2013 — 2:22pm",
      "content": "It's not early for writing and I think the page is set at a 45 degree angle and it was written with a right hand. It's a great find. I wonder who wanted read it enough to write it, and why.\n\n"
    }
  ]
}
