{
  "id": "100224",
  "title": "Thoughts on my business card?",
  "forum": "Design",
  "tags": [
    "Business card",
    "logo",
    "Design"
  ],
  "content": "Hi there. I'm new here, I'm from Brazil and, as the business card I attached says (in portuguese), I'm a psychologist. I just graduated and I decided to print my business cards in letterpress, but my budget is pretty tight, so I have to design them myself. Now I don't expect anybody to work for free, but since I have barely any experience at all with design I thought maybe you guys could take a look and tell me if I'm making any gross mistakes, maybe point me in the right direction. The same goes for the logo itself, the little couch, I designed it myself and it's my first attempt at something of the sort. Any help would be really appreciated.  \nThanks in advance,  \nDaniel\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/sofa3_5041.jpg)\n\n",
  "author": "danielbmarques",
  "time": "30 Jan 2013 — 9:34pm",
  "uid": "208114",
  "comments": [
    {
      "time": "30 Jan 2013 — 9:38pm",
      "content": "Ah, I should have added a border. This might be better:\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/sofa_6103.jpg)\n\n"
    },
    {
      "time": "31 Jan 2013 — 7:59am",
      "content": "I would use a bolder type (perhaps the same used on the numbers) for your name to reinforce the hierarchy. Maybe vertically the card will look more elegant, if it is something you are triying to achieve.\n\nI very like the cleaness.\n\nBest wishes,\n\nSergio\n\n"
    },
    {
      "time": "31 Jan 2013 — 12:05pm",
      "content": "Thank you very much for the suggestions.  \nI thought of printing it in portrait instead of landscape, but I think it looks sort of too modern. I'm young and my clients will mostly be younger people, so that's not my main concern, but I want the card to look relatively professional and the little armchair already looks a little too childish for my taste (but I can't manage to make it look any better), so I thought having the card in landscape orientation would get a more classic feel.  \nHere's an attempt at a portrait version:\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/3vertical_6230.jpg)\n\nAnd the same goes for the weight of my name, when I use a heavier type the card seems even more childish to me, and using a serif typeface seems a little off next to the armchair. What I tried here (on the portrait version and the one below) is to have the numbers in a lighter weight instead, maybe it could achieve the same result you're suggesting and reinforce the hierarchy. What do you think? And do you like the portrait version better considering what I said?\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/3lighter_4533.jpg)\n\nAny other tips, anyone?\n\nThanks again,  \nDaniel\n\n"
    },
    {
      "time": "31 Jan 2013 — 12:24pm",
      "content": "imho, it looks gorgeous, and I think you have avoided making the armchair looking even remotely \"childish\". My first impression at the chair was more \"mature and classy\" in fact (looks like a great chair for a good book and a glass of Scotch).\n\nThe only nitpicking I have right now is the contrast between the numbers and the email-adress. I think bold/regular is enough to contrast the lines, I think the inclusion of the sudden italic breaks the simple flow of the card.\n\n"
    },
    {
      "time": "31 Jan 2013 — 3:18pm",
      "content": "Wow, thank you, I'm really flattered. That's exactly the feel I wanted to get through with the armchair.  \nI guess you're right about the italic. There was something telling me that at the back of my head but I was resisting it just because I like the variety, but it doesn't fit the card very well.  \nSo here's where we're at, the card without the italic and with the numbers in semibold (instead of bold):\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/3lighterroman_5809.jpg)\n\nI'm still thinking of keeping the numbers in full bold, though, even more without the italic. I'm not sure. And my phone number might actually more important than my name. Although I guess everything will already look slightly heavier in letterpress. With the numbers in bold and without the italic it looks like this:\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/3roman_3903.jpg)\n\nAnyway, dissuading me of the italic was already a great help. Thank you. And any other feedback would be great. I'll post a picture of the card when I make up my mind and get it printed. I'm thinking of using a sort of creamy, natural color card stock. We'll see.\n\n"
    },
    {
      "time": "1 Feb 2013 — 10:25am",
      "content": "I would recommend a little more space around your name and chair device, move your details a little further down and increase the leading between the entries. This would be more improving on the portrait format.\n\nI would also consider another typeface for those details since the bold is overwhelming the e-mail address.\n\nYou also appear to have a different font for one of the 6s in the bottom line of the last entry (but that may be a screen glitch).\n\nTim\n\n"
    },
    {
      "time": "1 Feb 2013 — 3:03pm",
      "content": "Thanks, Tim. And what typeface would you suggest for the details? Wouldn't the bold be overwhelming the e-mail address anyway? And no bold at all seems a little bland I think.  \nAnd I think I'll go with the landscape version, but I'll try to add some more space like you said.  \nThanks again!  \nDaniel\n\nEdit: Oh, and that six really looks terrible. But it's just the rendering when exporting to jpeg I guess. In the pdf it looks good.\n\n"
    },
    {
      "time": "1 Feb 2013 — 7:53pm",
      "content": "I prefer the original version with the email address in italic. It helps break up that block, thus bounce your eye to the more important lines -- your name and occupation. Just another opinion... I'd agree the numbers are too bold. Is there a semi-bold? And if you lighten the numbers, maybe the email address should be not be italic...\n\nWatch how your eye moves, and where it winds up as you make changes.\n\nAs mentioned, space will also have an effect. What happens if you stay with the original size & leading, but move the numbers/email block down just a point or so? I would try that, too.\n\nFinally, I've been at this 30+ years, and will still trim a test printout to final size before being assured I have all the spaces/sizes right. It is so easy to fool yourself.\n\n\\* \\* \\*  \nDon't normally comment on business cards, but I like this. Well done.\n\n\\* \\* \\*\n\nEdit: Should have added that the internal space is most important, because they will mis-trim some of the cards. Yes, the \"margin\" space is important, just don't get it too critical, so the piece falls apart if it's mis-trimmed by a 1/16 inch or so.\n\n"
    },
    {
      "time": "1 Feb 2013 — 11:19pm",
      "content": "I played around with it a bit and ended with this.  \nNot sure if I like it better or not - but here it is:\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/DanielBMarques_4089.jpg)\n\n"
    },
    {
      "time": "1 Feb 2013 — 11:33pm",
      "content": "Thank you for the compliment, Charles. I'm really glad you guys liked it. Really. And thank you for the comments. Now I'm not sure about the italic again. I'm very volatile. :)\n\nHere's the card with more space, more leading and the numbers in semi-bold. Also the armchair is smaller and I made the \"@\" smaller in my email address:\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/3lighterromantracking_4089.jpg)\n\nAnd then the same but with the email in italics:\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/3lighteritalictracking_4470.jpg)\n\nAnd I don't know why, but when I convert the text to outlines (which the guy who will print it insists I do) everything looks even lighter, so the semi-bold looks even less bold.\n\n"
    },
    {
      "time": "2 Feb 2013 — 5:30am",
      "content": "Imho, I would have a go on a portrait card. Since you are young and you have young customers I would prefer a more modern approach e.g. The first line: \"Hi, I'm Daniël.\" It would give you a headstart on your introduction and 'forcing' the person who get's the card to introduce him/herself too. If not it might let the other person smile a bit. In any case, your first name will be remembered more easily.\n\nLike the logo very much, don't change it\n\n"
    },
    {
      "time": "2 Feb 2013 — 8:10am",
      "content": "Hello Daniel\n\nLooks good to me - I would suggest putting some letter spacing throughout - the letterpress process benefits from letter spacing for business cards where obvious impression (debossing) is desired.\n\n- David\n\n"
    },
    {
      "time": "2 Feb 2013 — 8:40am",
      "content": "Yes, I'm still considering the portrait version, I don't know. It's just that since my clients and I are already young I don't want to put off the older ones. I thought of having something like that, \"Hi, I'm Daniel\", but in portuguese it doesn't sound as good. \"Oi, meu nome é Daniel\". I don't know, it seems silly in portuguese. What I thought of doing was to write \"Fale mais sobre isso\" on one of the sides of the card, which is something like \"Can you say more about that?\"  \nBut then it would get too expensive to print on both sides of the paper, I'd need thicker stock, and I also want to have some space on the card to write notes and whatever. And then I couldn't manage to make it look good with all that on the same side of the card, it starts getting too crowded, and I want to keep it simple. But I'm still thinking about it. It would be great in a situation when, for instance, someone it sharing too much about their personal lives with a stranger or something like that, they could just hand them my card: \"Can you say more about that? Daniel Marques. Psychologist.\"\n\nSomething like this:\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/falemais_4815.jpg)\n\nBut I'm not sure. I like the simplicity of the landscape version. And this looks a little top-heavy too, I don't like the composition.\n\nI've been playing around with the landscape version, here's another option:\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/4_6732.jpg)\n\nI think the previous one is still my favorite, though. On the one hand I think my name in a bigger face would look nice in letterpress, and it has a more of a \"bam!\" effect. But on the other hand it sacrifices some of the simplicity too, and it looks a little more standard to me. The other version, without so much emphasis on my name, seems a little more challenging, in a good way.\n\nAh, I don't know, I don't know! What do you guys think?\n\n"
    },
    {
      "time": "2 Feb 2013 — 8:43am",
      "content": "Thanks for the tip, David. On these last versions I posted I have set the tracking to +10, but I don't know if it's enough. The difference isn't that noticeable, but I didn't want to mess with it too much. Maybe I'll still set it a bit higher.\n\n"
    },
    {
      "time": "2 Feb 2013 — 12:15pm",
      "content": "In all examples so far, the chair appears to be a bit left of center.\n\n"
    },
    {
      "time": "2 Feb 2013 — 1:48pm",
      "content": "The chair is actually quite a bit left of center... when I set it to the exact center it seems to be way too much to the right, so I tried to align it optically, but I might have overdone it. I've been looking at it for too long and I can't even tell anymore what looks right and what doesn't, I thought nobody would notice it was a little to the left. Thanks for telling me you did! I'll send it back to the right a bit.\n\n"
    },
    {
      "time": "2 Feb 2013 — 2:49pm",
      "content": "Couple quick points -- As you already observed, your business card is for business, and your business is not graphic design. The portrait layout stands a better chance of getting into a museum, not your goal. Do what's best for business.\n\nThe second is when you moved the bottom block, it was more like centimeters. Way too far. A point is 1/72 of an inch, about 0.3 millimeters. And yes, that can matter.\n\nYou don't want either too close to the edge of the card, as I said, trimming won't be that exact.\n\nIn passing -- I guess there is no semi-bold in the fonts you're using?\n\n"
    },
    {
      "time": "2 Feb 2013 — 3:10pm",
      "content": "I prefer the landscape version. If you should go with vertical, I wouldn't mix flush left type (the text above the illustration) with centered type; keep the alignment consistent.\n\nDon't forget that unless you plan to do all correspondence by email, you'll need matching letterheads, envelopes, any business forms you plan to use (like invoices), and perhaps a mailing label for oversize envelopes and packages.\n\nI like your chair; would be cool if you had one like that in your office.\n\n"
    },
    {
      "time": "2 Feb 2013 — 4:15pm",
      "content": "Thanks again, Charles. That's just what I'm thinking, looking too much like a designer piece could be actually a disadvantage for me. I think I'll do that and go with the landscape version.  \nAbout the leading and space between the blocks, I know I added more than you said, I just thought it would look better like that since I made the chair smaller too. Here's a little less space:\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/3lighteritalictracking_5521.jpg)\n\nAs for the numbers, except on my first post, where they were in bold, the others versions are already in semi-bold. Here:\n\nBold:\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/bold_6041.jpg)\n\nSemi-bold:\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/semi_3521.jpg)\n\nSo even with the numbers in semi-bold maybe the e-mail address would be better in italics. I don't know.\n\nAnd James, yes, I'm already thinking of the rest of my stationery, but I think it'll be a while until I need all that and right now don't have the money to spare. When I get to that I'll post it here too.\n\nThank you all for your help. I'll try to send the card for print on monday if I can make up my mind about the italics until then.\n\n"
    },
    {
      "time": "2 Feb 2013 — 6:29pm",
      "content": "\\> I think it'll be a while until I need all that [stationery]  \n\\> and right now don't have the money to spare\n\nI understand, but it might be easier to design them all at the same time so you have a nice coordinated system, rather than designing them in a rush some evening when you suddenly need them. You can just print the letterhead and envelopes on your office printer until you can afford professional printing.\n\n"
    },
    {
      "time": "7 Feb 2013 — 12:36pm",
      "content": "I guess you're right, James, thanks for the advice. I'll do that.  \nAnd now I sent the design for print, I'll get the cards after Carnaval, we'll see how it goes. I'll post it here then. I went with the semi-bold numbers and no italics. Thank you all again for all the help.\n\n"
    },
    {
      "time": "23 Feb 2013 — 10:31am",
      "content": "Here it is:\n\n ![](http://web.archive.org/web/20140329070218im_/http:/typophile.com/files/1_5440.jpg)\n\nThanks again for all your help.\n\n"
    },
    {
      "time": "24 Feb 2013 — 2:09pm",
      "content": "Nice one!\n\n"
    },
    {
      "time": "25 Feb 2013 — 6:57am",
      "content": "Thanks. :)\n\n"
    },
    {
      "time": "3 Mar 2013 — 8:25am",
      "content": "Daniel - looks great, very classy - I wonder why you decided to opt for letterpress rather than the cheap quickprint option?\n\n- David\n\n"
    },
    {
      "time": "3 Mar 2013 — 1:09pm",
      "content": "@Daniel: probably to get that “very classy” look ;-)\n\n"
    },
    {
      "time": "3 Mar 2013 — 1:16pm",
      "content": "Thank you very much, David. And that's a good question. Being a psychologist I'll call it fetishism, in the sense of an emotion that is displaced to a physical object instead of it's usual target. In my case that object is stationery and paper goods and writing instruments and all that... I just love those things, not even for what they mean or represent, but just the things themselves (hence the term fetishism), the smell of the paper, the texture of the ink. You know when you buy a new book and the pages are kind of sticking to each other and you have to run your finger through the page's edge to separate them? That's almost like an \\*\\*\\*\\* to me. Haha.\n\n"
    },
    {
      "time": "3 Mar 2013 — 1:18pm",
      "content": "And yeah, to get that \"very classy\" look too!  \nMy picture doesn't even do it justice, I have to take a better one.\n\n"
    },
    {
      "time": "4 Mar 2013 — 3:03am",
      "content": "I just wonder how many people who aren't involved in print/design/typography would appreciate this - or even notice the difference from the cheap stuff...\n\n"
    },
    {
      "time": "4 Mar 2013 — 8:45am",
      "content": "Don't discount the relevance of _feeling_ a difference, as opposed to merely noticing it consciously. When I do letterpress (which is sadly rare these days) I avoid gaudy over-impression. I don't want my stuff to look like a harlot.\n\nhhp\n\n"
    }
  ]
}
