{
  "id": "100210",
  "title": "help with nike track and field font",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "athletic",
    "nike",
    "Type ID Board [OLD]"
  ],
  "content": "Need help identifying this font used by Nike on their track and field shirt.\n\n[http://store.nike.com/us/en\\_us/?l=shop,pdp,ctr-inline/cid-1/pid-655557](http://web.archive.org/web/20131012021814/http:/store.nike.com/us/en_us/?l=shop,pdp,ctr-inline/cid-1/pid-655557 \"http://store.nike.com/us/en\\_us/?l=shop,pdp,ctr-inline/cid-1/pid-655557\")\n\n| Attachment | Size |\n| --- | --- |\n| [Screen Shot 2013-01-30 at 10.31.09 AM.png](http://web.archive.org/web/20131012021814/http:/typophile.com/files/Screen%20Shot%202013-01-30%20at%2010.31.09%20AM.png) | 221.82 KB |\n\n",
  "author": "tonypaves",
  "time": "30 Jan 2013 — 11:06am",
  "uid": "42941",
  "comments": [
    {
      "time": "31 Jan 2013 — 5:34am",
      "content": "Similar:\n\n[ca-oskar](http://web.archive.org/web/20131012021814/http:/myfonts.us/bNKtaS)\n\n[atrament](http://web.archive.org/web/20131012021814/http:/myfonts.us/YrzBZD)\n\n[driver-gothic](http://web.archive.org/web/20131012021814/http:/myfonts.us/rRD1HY)\n\n"
    },
    {
      "time": "31 Jan 2013 — 9:03am",
      "content": "As almost all letterings coming from Nike, it could be a proprietary typeface. If I had to recreate it, I would probably start with some font like [Canby](http://web.archive.org/web/20131012021814/http:/www.myfonts.com/fonts/jnlevine/canby/)/ [Liquorstore](http://web.archive.org/web/20131012021814/http:/www.myfonts.com/fonts/chank/liquorstore/)/ [Berber](http://web.archive.org/web/20131012021814/http:/www.letterbox.net.au/berber)/ [Olifant](http://web.archive.org/web/20131012021814/http:/www.myfonts.com/fonts/hipopotam/olifant/)/ [Berlin Email](http://web.archive.org/web/20131012021814/http:/www.peter-wiegel.de/Fonts/index.html) and rework the all thing.\n\n"
    },
    {
      "time": "31 Jan 2013 — 3:29pm",
      "content": "I would think twice before recommending/using a font by Peter Wiegel.\n\nhhp\n\n"
    },
    {
      "time": "1 Feb 2013 — 10:38am",
      "content": "Why the hell is that, Hrant? Herr Wiegel offers revivals of lots of old Deutsche typefaces - some of which are available nowhere else digitally. I'm _grateful_ that people like him exist. A niche typographer with with some really cool offerings from the past. Making fonts few people care about any more.\n\nI am fascinated to know the reason for your gastrointestinal distress (AKA \"gut feeling\"). Is it the crappy website? Erm ... highly suspicious. Something else?\n\nThis guy is a commercial type person, too. Small-time and with weak website development skills? Yep. Does he deserve your totally unsupported disdain on a public forum? Nope. An apology is what Herr Wiegel deserves (yeah, right ... ).\n\nFolks - I would think twice before listening to Hrant asking _you_ to think twice. _Demand_ at least some shred of supporting evidence.\n\n"
    },
    {
      "time": "1 Feb 2013 — 12:04pm",
      "content": "Definitely ask for an explanation (I only hold that back to save time - favoring instead merely the raising of a red flag) but _evidence_ is often too much to expect. People don't typically make decisions -especially not important ones, like who to marry- based on hard evidence; people don't tread cautiously -which is all I'm asking- because they're _sure_ something is wrong. And it's a fruitful act of humility to admit that somebody else's experience/instincts are superior to yours when it comes to smelling rotten fish; just like I have the humility to freely admit that I suck at IDing fonts, and sometimes that does indeed cause me trouble.\n\nIn this particular case I'm seeing enough similarities between many of Wiegel's fonts and other existing commercial designs to simply suggest that people do more research. If somebody does the research and comes to believe all his work is legitimate, that's not a wasted effort - they can feel more comfortable supporting him, and they can tell others about their findings. Have you done the research?\n\nIn fact, Wiegel, being an actual type designer (unlike virtually everybody IDing fonts...) might appreciate the sort of caution I'm expressing, and elect to merely reassure people that he's not one of the _majority_ of people who produce a large number of fonts dishonorably.\n\nBTW Mike, I'm better at apologizing that most people I know, and most people here, and you. You need to be paying more attention to how my efforts have helped people here be more mindful of not hurting type designers. I can tell because I'm having to intervene far less often now than 2-3 weeks ago.\n\nhhp\n\n"
    }
  ]
}
