{
  "id": "100230",
  "title": "Bold fun font",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I know i've seen this font before.. maybe a free one?\n\n| Attachment | Size |\n| --- | --- |\n| [engisolda.jpg](http://web.archive.org/web/20131101173657/http:/typophile.com/files/engisolda.jpg) | 9.43 KB |\n\n",
  "author": "desmetadata",
  "time": "31 Jan 2013 — 3:03am",
  "uid": "199187",
  "comments": [
    {
      "time": "31 Jan 2013 — 3:15am",
      "content": "Tabasco  \n [http://bowfinprintworks.com/BauhausFaces6.html](http://web.archive.org/web/20131101173657/http:/bowfinprintworks.com/BauhausFaces6.html \"http://bowfinprintworks.com/BauhausFaces6.html\")\n\n"
    },
    {
      "time": "31 Jan 2013 — 3:20am",
      "content": "Thank you :)\n\n"
    },
    {
      "time": "31 Jan 2013 — 6:16am",
      "content": "[http://typophile.com/node/54383](http://web.archive.org/web/20131101173657/http:/typophile.com/node/54383 \"http://typophile.com/node/54383\")  \nDon't go for the crappy and illegitimate free ones.\n\nhhp\n\n"
    },
    {
      "time": "31 Jan 2013 — 11:40am",
      "content": "Tabasco is a very old font, digitized by various people (as well as many other Letraset and metal typefaces). Some digital versions are free, some are commercial, some has better quality, some others are crappy... but none of them is more legitimate or illegitimate than the others (As long as they are original digitalizations from scans, and not duplication of an existing digital version).  \nAssuming that a font is illegitimate just because it's free, it's a wrong assumption.\n\n"
    },
    {
      "time": "31 Jan 2013 — 3:16pm",
      "content": "Agreed. But are you sure the original design is now public domain? Just because many people have jumped on a bandwagon doesn't mean it's a good bandwagon. If you're not sure I think it's better to be safe than sorry. It's better to hurt one guy looking for an ID than potentially hurt somebody who went to the trouble to design a font.\n\nhhp\n\n"
    },
    {
      "time": "1 Feb 2013 — 11:01am",
      "content": "And so you link to a post which links to Paratype's commercial version? Being commercial makes it more legitimate? Their 'version' is Tavrida - \"The typeface was designed at SoftUnion in 1994 by Nikita Vsesvetsky.\"\n\nThe original is actually Tabasco - by John Schaedler, late 1960's.\n\nSo .. the basis of your dissent is really ignorance and bias. And you have linked to a version of Tabasco that has zero legitimacy. How seedy of you.\n\nIf anyone has the rights to Tabasco, it would be Letraset - and they have mounted no protest to lots of digital recreations of such arcane blasts-from-the-past which they have not seen prudent to digitize.\n\n"
    },
    {
      "time": "1 Feb 2013 — 11:50am",
      "content": "> Being commercial makes it more legitimate?\n\nNo, but it _is_ more likely to be legitimate, hence a safer recommendation. Also, the free ones that I saw _were_ much lower in quality. Lastly, it's nice to get people to support type designers financially; something being free/cheap does not make it more worthy - saving money for its own sake is very capitalistic.\n\nAnd I suggest you desist from the rampant personal attacks - they're dishonorable and counter-productive.\n\nhhp\n\n"
    },
    {
      "time": "1 Feb 2013 — 1:16pm",
      "content": "> Lastly, it's nice to get people to support type designers financially\n\nSo now we finally know what this is all about. It’s not ethics.\n\n> And I suggest you desist from the rampant personal attacks - they're dishonorable and counter-productive.\n\nThis of course only applies to people other than Hrant.  \n [http://typophile.com/node/99822](http://web.archive.org/web/20131101173657/http:/typophile.com/node/99822 \"http://typophile.com/node/99822\")\n\n> And I have to wonder if Jan (and Mike, and whoever else) knew this little detail but were keeping quiet. Because it sure is what they usually do!\n"
    },
    {
      "time": "1 Feb 2013 — 3:39pm",
      "content": "It's not honorable to pick out one thing that makes me look bad (to some people) and pretend that's my only motivation. And is wanting to see effort rewarded really unethical? What's unethical is ignoring the dedication and effort that goes into making a font for the base personal pleasure of IDing a font, often for somebody who might use the information to pirate the font. You conveniently ignore everything else I wrote, some of which you might even agree with, but might not have the strength to admit (a pattern I've consistently seen before). Clearly you have no idea what makes me tick (probably because you never leave the ID section). Unless I'm giving you too much benefit of doubt...\n\nBut you're right about the second part - I've actually been feeling mildly bad about that (even though I wasn't being nearly as aggressive as Mike). When I formulate a proper reply in that thread (soon) I'll correct that.\n\nhhp\n\n"
    },
    {
      "time": "1 Feb 2013 — 5:45pm",
      "content": "Glad that you're attacking font IDers and not outside font designers.\n\nAll Font Makers should know the business model they are working under does not protect them.\n\nGood words to live by: \"And I suggest you desist from the rampant personal attacks - they're dishonorable and counter-productive.\"\n\n"
    },
    {
      "time": "2 Feb 2013 — 7:26am",
      "content": "Everybody is different, and not all people who ID fonts are hedonistic vultures.\n\nHow conveniently you ignore who made this place you're usurping.\n\nhhp\n\n"
    },
    {
      "time": "1 Feb 2013 — 6:11pm",
      "content": "Hrant, it is allllll yours.... ???\n\nTime to retire and pass the reins to your juniors.\n\nWe're ready! And able!!\n\n"
    },
    {
      "time": "1 Feb 2013 — 8:39pm",
      "content": "I thought the Paratype’s version and the SoftMaker’s version of it are doubtful, so I showed the page at Mike Yanega’s site. I dare not to mention the versions.  \nI don’t recommend low-quality knock-offs. I’d not like to show unauthorized fonts.  \nYou shouldn’t digitize typefaces without permission even if the original designers don’t protest against it.\n\n"
    },
    {
      "time": "1 Feb 2013 — 9:25pm",
      "content": "Akira, thank you for your mindfulness. You might be right about Paratype's version (and everything else). The important thing is to care about doing the right thing\\*, as opposed to IDing a font merely because you can. You clearly prove that some people who ID fonts are highly honorable.\n\n\\* Which includes confronting problems head-on:  \n [http://typophile.com/node/51355](http://web.archive.org/web/20131101173657/http:/typophile.com/node/51355 \"http://typophile.com/node/51355\")\n\nhhp\n\n"
    },
    {
      "time": "2 Feb 2013 — 7:32am",
      "content": "Come one people... there is no need to fight to each other.  \nWe are all passionate about type! And I guess we can all agree that the history of type is so coiled and complicated, that's is very difficult to know exactly which font is the original one, which ones are original digitalizations (based on scans), and which ones are rip-offs (digitally duplicated and renamed).\n\nTo make things even more complicated, pretty much all the Letraset fonts have been digitized by URW in the early days of Ikarus (in many cases without the consent of the designers, and without paying royalties to the designers), and URW have sub-licensed that font data to a lots of other people... So, many of the so called rip-off, are actually sub-sub-sub-licensed versions of the URW data... while other are simple revivals based on scans. Those fonts are still floating around and will continue to be online forever (both for sale and for free), and the legal versions of the digitized Letraset fonts are in many cases much more illegitimate than the free versions.\n\nTo make things much more complicated.. in the US is completely legal to digitize fonts from old specimens scans.. so there are many digitalizations done, not only by amateurs but mostly by foundries (big and small). Some foundries ask for permission (which is great) but not all, since it's not a requirement to do so. And in many cases the designers are death also, so there is no one to ask permission for. As a result, about 90% (or more) of commercial digital fonts are revivals, or \"modernizations\" of old designs.\n\nAlso, the fact that there are many \"legal clones\" (think Helvetica/Arial, Palatino/Book Antiqua, etc...) make it really hard to understand how all this things works for the people that are not deep into this subjects (the average user).\n\nUsers are typically accused of piracy... but what about the foundries? They started it all :)  \n\"One of the most important methods of mechanical development to affect typefounding was the invention of a method where the matrices could be made by the electrotyping process. This practice bypassed the cutting of punches, allowing a foundry to duplicate a competitors type by simply purchasing a font and then molding each character in wax and obtaining by electro-deposit a copy from which to manufacture a set of matrices.  \nPerfected in 1845 by Edwin Starr in Philadelphia, the method initiated the pirating of printing types on a large scale. It also contributed greatly to the difficult of identifying a type, as the same design appeared under a dozen of different names.  \nThe final mayor contribution to the multiplication of new types was the matrix-engraving machine. Invented by Linn Boyd Benton in 1885, this device eliminated the need for hand-cutting a steel punch.\"  \nAnatomy of a Typeface, Alexander Lawson\n\nBTW: Harassing users for asking type ids, it's like abusing the most defenseless of the herd. Most of the people asking for font ids and searching for downloads are not \"hedonistic vultures\", they are simply people that don't know enough about how typefaces are made, basically because they think that fonts \"just come on the computer\" (as I used to think a few years ago). Once that people learn more about type, and learn about the designers, they start caring and buying fonts (as I do now). Educating those user in a friendly way is much better than harassing them.\n\n"
    },
    {
      "time": "2 Feb 2013 — 7:55am",
      "content": "You're right that it's all very complicated, and large companies are indeed often guilty. But that does not excuse anybody else being guilty (it's highly irresponsible to encourage others to act unethically by pointing out guilty people\\*) and this is not about specifics: we can discuss -even argue about- what font has what sort of legitimacy; everybody makes mistakes, and everybody should be open to changing his mind, and even apologizing. That's not the point. The point is when you don't care about the people whose work you so enjoy identifying, the people who happen to be the reason the place you're enjoying exists, you will find yourself confronted by people who do care about those things. Caring is a Good Thing. _That_ is not complicated.\n\n\\* And you of all people should appreciate the difference between legal and ethical.\n\nBTW: You should have noticed that I haven't been \"harassing\" the people who _ask_ for IDs (except when they boast of pirating fonts, which is rare) because as you say they mostly have no idea (and are -individually- too transitory to matter). They're not the ones who make Typophile. The people I confront are those that are doing damage by not caring. The people who recommend fonts without caring about their legitimacy, who _never raise a finger_ to correct any sort of damaging behavior, caring only about satisfying their personal pleasure.\n\nhhp\n\n"
    },
    {
      "time": "2 Feb 2013 — 12:11pm",
      "content": "Hrant - Working a long stretch of 13 hour night shifts has made it difficult to defend myself against your accusations - especially regarding disrespect to those I'll call font-makers. This has been especially hurtful. If you find the time, please see [this running MyFonts WTF thread](http://web.archive.org/web/20131101173657/http:/old.myfonts.com/WhatTheFont/forum/viewthread.php?threadid=129006). If you do a browser Search on 'Mike', there will be lots of hits - but, starting at about the 17th hit, who I am typographically will become evident. It includes **the utmost respect for type designers and makers.** Add to that plenty of posts trying to educate errant posters and literally hundreds of moderator edits removing references in posts to ripoff clones and bad links.\n\n_What's unethical is ignoring the dedication and effort that goes into making a font for the base personal pleasure of IDing a font, often for somebody who might use the information to pirate the font._\n\nHere is the heart of the problem between us. You clearly think that identifying fonts for a large group of posters is tantamount to disrespecting commercial font-makers. Who makes up that group? Well ... among many others, that would be the home scrapbooker, the fellow looking to mimic an album cover for a friend and - the really hard nut for you - the small-time designer with zero budget.\n\nYou assume that they will not buy an identified commercial font. In the case of the first two, odds are high that you are right. These are people knowing little about fonts in general and totally ignorant of font ethics. They are probably not going to buy a font for their little home project - and, in my view, so what? By providing an ID and commercial link, there's a chance they might make the expenditure. If, instead, they go out and download the font from the Internet without paying, the font-maker has lost nothing. This user was never a potential customer.\n\nYou think that this situation cheapens Typophile ... but _how_ exactly? Do you imagine that future posters seeking IDs scan through prior posts at all? No, they don't. Thinking this is a place to get fonts identified (imagine that), they simply post and await an answer. No idea of what Typophrant stands for.\n\nThat leaves the small-time designer with zero budget. My argument is exactly the same except that this poster is at least a little more likely to pay for a font.\n\nIn any case, I see two approaches to how you would prefer we handle the posts by this group of posters (the majority of posters, I believe):\n\n1) Challenge them up front about their intentions (how did that go for you?). Yeah, that will make font buyers out of them and improve the perception of this forum. I don't think so.\n\n2) Ignore their requests. I suspect that this is what you'd like us to do with those you consider \"suspect\".\n\nWhich would you have us do? You claim to be a pragmatist. I say that I am more pragmatical. Your approach pretty much negates any possible font purchase. Mine makes it a possibility. We font ID hobbyists are clearly held in much disdain by you - and yet we provide much more potential income for font-makers than your extreme approach. Friendly and helpful versus confrontational and nonhelpful. Which further aids font-makers, eh?\n\nRegarding two other accusations thrown my way ...\n\n1) Why haven't I posted challenges to those who have shown clear intent to pirate or against obvious pirate fonts?\n\nReally simple: My work schedule is stretches of 13-hour night shifts - which allows me to, um, binge-post when _not_ working and by the time I see them, those posts have already been challenged. Redundancy is pointless.\n\n2) If my disdained-by-you group of hobbyist font IDers had ever actually made a font, we'd have more empathy with font-makers.\n\nI played around plenty with creating fonts. Sought out lots of educational info from lots of sources -including Typophile forums. Eventually, I made [Gradl Max](http://web.archive.org/web/20131101173657/http:/www.myfonts.com/fonts/freshair/gradl-max/). After basic, very time-consuming fontmaking, I had to learn kerning (not perfect, I know) and worked hard on extrapolating lots of glyphs that didn't exist in Gradl's lettering.\n\nIn conclusion, I practice my hobby in a way I believe best respects font-makers. I do so, as well, in a way that respects the posters you seem to see as horrible lowlifes.\n\n"
    },
    {
      "time": "2 Feb 2013 — 2:05pm",
      "content": "mike,\n\nlove your post. i agree wholeheartedly. those who visit infrequently or just to have a font id'ed may even discover an interest and learn more, especially if not attacked as some sort of felon in the making.\n\n"
    },
    {
      "time": "2 Feb 2013 — 2:20pm",
      "content": "Mike, I'm sorry, I can't afford to waste time following the antics in Mos Eisley. I pick my fights very carefully. This is not a crusade - it's a defensive action (even if it's long overdue).\n\nIt's not just about you (just like it's not just about me). In fact I think you're far better than most. But yet you fail to see the problem. I say this not only based on how you react to me actions, but because of your _lack_ of action in certain telling situations.\n\n> You clearly think that identifying fonts for a large group of posters is tantamount to disrespecting commercial font-makers.\n\nIncorrect.  \nBesides being illogical, that would be far too dogmatic. You're reading things into my posts that make it easier to attack me; you're not actually addressing my contentions. When I say -and it's clear to anybody paying attention- that I haven't been confronting people merely _asking_ for type IDs and you still come back with the same false accusation\\*, I don't know what to think about your clarity of thought. Although I personally don't feel comfortable IDing fonts for strangers, I don't expect people to follow suit. I'm not asking anybody to stop doing that. That's what I call pragmatic.\n\n\\* Which, as you can see, is contagious.\n\n> Which would you have us do?\n\nWhat I _do_ expect (and only because it's a big way of making this place healthy) is for people to care about the making of type, not just satisfying their urge to ID type. When somebody with a good nose says \"be cautious\", don't have a raging reaction. Don't use ideas like \"All Font Makers should know the business model they are working under does not protect them\" to justify riding roughshod over the rights of designers. That sort of thing. Simple, old-fashioned mindfulness. Minding the community, the vehicle that allows you to derive the pleasure, not just the pleasure itself.\n\nAnd I've stated all this before (in a reply to Ryuk about a week ago) but clearly not enough people are paying enough attention.\n\nYou seem to care about more than IDing\\*. But some people here clearly don't. And _you_ need to confront them just as much as I do - in fact perhaps more, so you avoid people thinking that _all_ type-ID people are scum.\n\n\\* [http://typophile.com/node/100241](http://web.archive.org/web/20131101173657/http:/typophile.com/node/100241 \"http://typophile.com/node/100241\")\n\nWhy do you think there's near-zero interaction between people who frequent the ID section versus people who frequent the other sections? Is this a healthy situation? No. Is it correctable? Yes.\n\n> I made Gradl Max\n\nWhich explains why you're more sensitive than most. But you're not the only one here, and you shouldn't align yourself fully with one group, while only ever attacking the other group. I've seen many cases where somebody like you should have been on my side; but you only ever defend people who -from your own characterization of yourself- you should not blindly agree with, or even turn a blind eye to.\n\nhhp\n\n"
    },
    {
      "time": "3 Feb 2013 — 10:41am",
      "content": "I worked 13 hours last night and don't have time to respond to your whole post (and who, including you, should care if I do?)\n\nStill ...\n\n_When somebody with a good nose says \"be cautious\", don't have a raging reaction._\n\nThe trouble is, your self-vaunted \"good nose\" has yet to prove itself.\n\n\\>\\> \"might be\", \"suspect\", \"probably\" \\>\\> You use lots of words like this. Several people have asked you for _any_ evidence to back up your splendid sense of smell - and then you are silent.\n\nIt would seem obvious to me that font identification skills would contribute greatly to sniffing out ripoffs of commercial fonts - yet you freely admit to not being very good at font identification.\n\nCombine my last two paragraphs, and your \"I smell a rat\" posts look absurd.\n\nHrant - I have read lots of posts of yours in (yes!) other Typophile forums and been astounded by your typographical erudition - especially related to readability. Why haven't you \"seen\" me there? Because I've nothing to contribute. I'm simply learning. My respect for you was high until the present crusade. In this forum, however, you have created a bully's whirlwind that truly accomplishes nothing except an ill wind.\n\nIn my view, your stance is based upon a belief that identifying fonts for people who may not or probably will not buy a font diminishes the integrity of this forum and respect for font-makers. And font ID folk who do that identifying as a silly hobby lack respect for font-makers.\n\nI strongly disagree with those premises and will continue to post IDs - as time allows - for all those seeking IDs - except those who openly indicate that they will find a commercial font without paying.\n\n"
    },
    {
      "time": "3 Feb 2013 — 3:55pm",
      "content": "You're still not listening to much more than your own voice.\n\n> who, including you, should care if I do?\n\nMaybe the ID crowd you so blindly protect? But too many of them only care about IDing for its own sake.\n\n> your self-vaunted \"good nose\" has yet to prove itself.\n\nYou're not giving me enough credit. And you remain silent in that significant thread I pointed out to you.\n\nAnd when I'm wrong, I lower the flag - no problem.\n\n> font identification skills would contribute greatly\n\nWhich is why -as I said in that reply to Ryuk- we need each other. I sniff, maybe raise a red flag, and others help figure out if the flag is warranted. How many people do you know who have a good nose for plagiarism _and_ hang out in the ID section? Without the red flags people who make fonts will continue to see the ID section as a lost cause. Soon I might join them.\n\n> your stance is based upon a belief that identifying fonts for people who may not or probably will not buy a font diminishes the integrity of this forum and respect for font-makers.\n\nI repeat, yet again: that's not the main issue; if it were I would confront virtually all ID requests. The main issue is a pervasive lack of respect _for the things being IDed and the people who make them, in a place that wouldn't exist without them._ To me that's plain disgusting.\n\n> will continue to post IDs\n\nI'm not going to try to stop you -or anybody else- form doing that. But I'm also loathe to let anybody get away with promoting plagiarism and piracy, knowingly or unknowingly, on Typophile.\n\n> except those who openly indicate that ....\n\nWhat about the ID regulars who don't mind recommending illegitimate fonts? I've never seen you raise a finger, which makes your \"I care\" seem toothless.\n\nhhp\n\n"
    },
    {
      "time": "3 Feb 2013 — 3:41pm",
      "content": "@hrant: “_What about the_ ID regulars _who don't mind recommending illegitimate fonts?_”\n\nPlease email me suspect user ID’s.\n\n[typographer@gmail.com](mailto:typographer@gmail.com)\n\n"
    },
    {
      "time": "3 Feb 2013 — 3:56pm",
      "content": "I guess I should, although it's not my style. In all these years and all these forums, I have only requested disciplinary action against one person (many years ago) and only because he was conducting a full-on defamation campaign against me, and had stopped contributing anything of value. There's currently nobody remotely like that on Typophile - in fact there never has been.\n\nSo to decide whether to go down this dangerous road, I have to ask:  \n- How do you plan on handling such reporting?  \n- What do you consider \"illegitimate\" to mean?\n\nhhp\n\n"
    },
    {
      "time": "3 Feb 2013 — 6:45pm",
      "content": "“_How do you plan on handling such reporting?_”  \nTBD. I would suggest, however, that the piracy &c issue in question be brought to the attention of the copyright holder, and the parties involved take it from there.\n\n“_What do you consider “illegitimate” to mean?_”  \nIn this context I would consider “illegitimate” to mean not authorized by law.\n\n"
    },
    {
      "time": "4 Feb 2013 — 8:18pm",
      "content": "Are we here to help or to be the font police?\n\n"
    },
    {
      "time": "4 Feb 2013 — 9:15pm",
      "content": "Sometimes those go together. Who should we be helping?\n\nNonetheless I do believe that nothing beats self-regulation.\n\nhhp\n\n"
    },
    {
      "time": "6 Feb 2013 — 7:37pm",
      "content": "> your self-vaunted \"good nose\" has yet to prove itself.\n\n[http://typophile.com/node/100223#comment-542223](http://web.archive.org/web/20131101173657/http:/typophile.com/node/100223#comment-542223 \"http://typophile.com/node/100223#comment-542223\")  \nFrankly though that was an easy one.\n\nhhp\n\n"
    }
  ]
}
