{
  "id": "100202",
  "title": "Typecast: Monotype’s New Browser-Based Design Tool",
  "forum": "Home",
  "tags": [
    "fonts",
    "monotype",
    "News",
    "typecast",
    "web fonts"
  ],
  "content": " ![](http://web.archive.org/web/20140713044345im_/http:/typophile.com/files/Typecast%20logo%20and%20strapline_3723.jpg)\n\nRead Typecast Blog – [http://bit.ly/TypCas](http://web.archive.org/web/20140713044345/http:/bit.ly/TypCas \"http://bit.ly/TypCas\")  \nView Condé Nast Case Study – [http://bit.ly/CondeN](http://web.archive.org/web/20140713044345/http:/bit.ly/CondeN \"http://bit.ly/CondeN\")  \nView Happy Cog Case Study – [http://bit.ly/HapCog](http://web.archive.org/web/20140713044345/http:/bit.ly/HapCog \"http://bit.ly/HapCog\")\n\nMonotype Imaging Holdings Inc. has announced the commercial launch of its [Typecast](http://web.archive.org/web/20140713044345/http:/typecast.com/)™ application, a browser-based tool for designing Web pages with Web fonts.\n\nThe Typecast application launches commercially after a year and a half in private and public beta programs, bringing the design community a tool that helps to save time and create better quality Web typography.\n\nTypecast lets Web designers combine, compare and style Web fonts quickly without performing screen captures in third-party applications or through hand coding. Users are able to visually style text directly within the browser, which offers more scope for creative experimentation, better typographic control and a simplified workflow. As designers work, Typecast generates production-ready HTML and CSS code behind the scenes. When designers are ready to start building their sites, they can export that HTML and CSS, plus generate embedded code that will serve their project’s typefaces to their site.\n\nDesigners can set styles such as font size, line spacing and coloring, and also apply OpenType® features such as ligatures, small caps, fractions, lining and old style figures, and swash characters. Designers are able to try fonts on real, full-length project content, not just short snippets. Using side-by-side comparison and testing, designers can see at a glance what’s working and what’s not. Styles can be adjusted across entire projects with just a few clicks.\n\nTypecast is available at four subscription levels, each with monthly, yearly and tri-yearly billing options. Prices start at $29 per month for an individual plan, and all plans include a free standard subscription to [Fonts.com Web Fonts](http://web.archive.org/web/20140713044345/http:/www.fonts.com/web-fonts) worth $10 per month, enabling Typecast subscribers to use more than 20,000 Web fonts on their live sites. Typecast is available as a free trial for 14 days.\n\nTypecast allows designers to experiment with fonts from Typekit®, Fontdeck®, Webtype® and Google® Web Fonts as well as Monotype’s [Fonts.com Web Fonts](http://web.archive.org/web/20140713044345/http:/www.fonts.com/web-fonts), which features thousands of typefaces, including timeless classics such as the Trade Gothic®, Avenir® and ITC Avant Garde Gothic® families, as well as cutting-edge designs and hand-tuned fonts.\n\nFurther information about [Typecast](http://web.archive.org/web/20140713044345/http:/typecast.com/), including a [video](http://web.archive.org/web/20140713044345/http:/typecast.com/experiment-with-type/play#home-link) that details the application, is available at [http://typecast.com](http://web.archive.org/web/20140713044345/http:/typecast.com/ \"http://typecast.com\"), where visitors can also view customer videos from [Happy Cog](http://web.archive.org/web/20140713044345/http:/typecast.com/customers/happy-cog), one of the world’s most respected design agencies, and international publishing company [Condé Nast](http://web.archive.org/web/20140713044345/http:/typecast.com/customers/conde-nast), which used Typecast to redesign vogue.co.uk.\n\nA public beta program for Typecast began one week prior to Monotype’s Oct. 30, 2012 acquisition of Design by Front Limited, the company behind the Typecast application. The product continues to be developed from Belfast, Northern Ireland, where Monotype now holds an office.\n\nAbout Monotype  \nMonotype is a leading global provider of typefaces, technology and expertise that enable the best user experience and ensure brand integrity. Based in Woburn, Mass., Monotype provides customers worldwide with typeface solutions for a broad range of creative applications and consumer devices. The company’s library and e-commerce sites are home to many of the most widely used typefaces – including the [Helvetica](http://web.archive.org/web/20140713044345/http:/new.fonts.com/font/linotype/Helvetica)®, [Frutiger](http://web.archive.org/web/20140713044345/http:/new.fonts.com/font/linotype/frutiger)® and [Univers](http://web.archive.org/web/20140713044345/http:/new.fonts.com/font/linotype/univers)® families – as well as the next generation of type designs. Further information is available at [www.monotype.com](http://web.archive.org/web/20140713044345/http:/www.monotype.com/ \"www.monotype.com\").\n\n",
  "author": "JLH",
  "time": "30 Jan 2013 — 7:56am",
  "uid": "30653",
  "comments": [

  ]
}
