{
  "id": "100389",
  "title": "Can I align numerals in Freight Sans",
  "forum": "General Discussions",
  "tags": [
    "alignment",
    "General Discussions",
    "numerals"
  ],
  "content": "Can anyone help here? I'm trying to persuade a client to use Freight Sans which I believe fits better with their brand, however they've got hung up on the non-aligning numerals and I can't seem to find an easy way to set them aligned in our print. Maybe it's not possible... if that's the case, does anyone have a work around or any ideas to help sell them back to the client?!\n\nAny thought appreciated.\n\nBest,  \nHugo\n\n",
  "author": "HugoKing",
  "time": "6 Feb 2013 — 9:13am",
  "uid": "75501",
  "comments": [
    {
      "time": "6 Feb 2013 — 9:26am",
      "content": "Indeed it has lining and oldstyle numerals:\n\n ![](http://web.archive.org/web/20150115065933im_/http:/typophile.com/files/freightsans_4812.jpg)\n  \nIf you're in InDesign, go to Character menu \\> OpenType \\> Tabular Lining. \n"
    },
    {
      "time": "6 Feb 2013 — 9:51am",
      "content": "I think I must have a different version as the Tabular Lining option has a bracket around it. Is there a particular version of Freight Sans which allows this?\n\nThanks for your quick reply.\n\n"
    },
    {
      "time": "6 Feb 2013 — 10:17am",
      "content": "You licensed this from Phil's Fonts.  \n [https://philsfonts.com/index.php/results/strip?q=freight+sans&mysubmit=&...](http://web.archive.org/web/20150115065933/https:/philsfonts.com/index.php/results/strip?q=freight+sans&mysubmit=&type=3 \"https://philsfonts.com/index.php/results/strip?q=freight+sans&mysubmit=&type=3\")\n\nThe options are the Pro version, with small caps and alternate ﬁgures integrated as OpenType features, or the plain version, with oldstyle ﬁgures as default, and lining ﬁgures in a separate small caps font.\n\nI would suggest you either “upgrade” by licensing the Small Caps version to add to what you already have, or license the OpenType version; perhaps the distributor will give you a discount on this.\n\n\\*\\*\n\nThis customer service is provided by a disinterested party at no charge, but really you should be contacting the distributor from whom you licensed the font, or the foundry that made it. Why didn’t you do that, rather than asking at Typophile?\n\n"
    },
    {
      "time": "6 Feb 2013 — 10:29am",
      "content": "I'm guessing the font hasn't been purchased [yet].  \nMaybe rendering grabs are being used.\n\nhhp\n\n"
    },
    {
      "time": "6 Feb 2013 — 1:22pm",
      "content": "Actually, what offends me is the stupidity of the question. _Of course_ you can choose tabular or lining figures so _why are you bothering us_?\n\n"
    },
    {
      "time": "6 Feb 2013 — 1:31pm",
      "content": "Wow. If there's anything <cite>offensive</cite> here it's the needless rudeness. Asking about something you don't know is not stupid: learning new things is how people get smarter. Why bother commenting if you're just going to be antagonistic?\n\n"
    },
    {
      "time": "6 Feb 2013 — 3:50pm",
      "content": "You Don't Know Joe.™\n\nHugo, don't mind him.\n\nhhp\n\n"
    },
    {
      "time": "12 Feb 2013 — 2:36pm",
      "content": "I've had some very nice interactions with Darden studio. If you've already licensed one version, send them an email. Good people.\n\n"
    }
  ]
}
