{
  "id": "100358",
  "title": "A new great logo from the Italian Institute for Nuclear Physics (INFN)",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This logo is not mine I just received it in an email from the PR office of the institute. I would like to know what real designers think about it, and what do you generally understand from that logo.  \nWhen I saw it the first time it looked to me a logo for a campaign against the INFN, with that \"NO INFN\" written on it.\n\n ![](http://web.archive.org/web/20150418212001im_/http:/typophile.com/files/noname_3539.jpg)\n\n",
  "author": "Caffeinomane",
  "time": "5 Feb 2013 — 6:15am",
  "uid": "201897",
  "comments": [
    {
      "time": "5 Feb 2013 — 8:01am",
      "content": "As an English speaker, it looks like a campaign to enforce privacy -- NO INFO\n\n"
    },
    {
      "time": "5 Feb 2013 — 8:09am",
      "content": "English speakers like me will read _INFO_, a common abbreviation for _information_. Italian speakers may read this differently. Nuclear physicists might see the little circle as a subatomic particle instead of the letter **O**.\n\nWhat strikes me most about this logo is how playful it is. Maybe they're trying to say, \"Hey, we're not just a bunch of science geeks. We like to have fun too!\" But if I'm going to trust people to handle radioactive materials, I'd like to think they take their jobs very, very seriously.\n\n"
    },
    {
      "time": "5 Feb 2013 — 9:00am",
      "content": "Are you sure that's their official logo? When I google them I see a different logo.\n\nThat long red rule makes me wonder if someone was just having fun with the letter's header. I've seen office staff in other organizations send out mail that violated their organization's design standards.\n\n"
    },
    {
      "time": "5 Feb 2013 — 9:18am",
      "content": "I agree with HVB.  \nSo to me the opposite of \"great\", sorry. :-/\n\nAs you might agree though, they should've asked us first:  \n [http://typophile.com/node/98558](http://web.archive.org/web/20150418212001/http:/typophile.com/node/98558 \"http://typophile.com/node/98558\")  \n:-)\n\nhhp\n\n"
    },
    {
      "time": "5 Feb 2013 — 1:40pm",
      "content": "I took me a while to figure that the real meaning of that logo is \"INFN INFO,\" which is a new campaign of the INFN to popularize our work. (I think)\n\n_@JamesM_ No, it is not the official logo of INFN, it is the logo of this campaign.  \nTheir official logo is  \n ![](http://web.archive.org/web/20150418212001im_/http:/img33.imageshack.us/img33/4585/logosinfn.png)  \nand, on a side note, this is the old logo  \n ![](http://web.archive.org/web/20150418212001im_/http:/img855.imageshack.us/img855/7029/infntr2.gif)  \n_@hrant_ Well my \"great\" was ironic, I really do not like that logo.\n\n"
    }
  ]
}
