{
  "id": "100347",
  "title": "Identify a 1972 Sans Font",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,\n\nI'd like to know what is the typeface that is used for the main titles of _The Streets of San Francisco_ (1972)?  \nIt looks inspired by the Herbert Bayer and Ed Benguiat. Find below a jpg file of the main titles artwork.  \nThanks in advance.\n\n| Attachment | Size |\n| --- | --- |\n| [1\\_frisco-open.jpg](http://web.archive.org/web/20150416012549/http:/typophile.com/files/1_frisco-open_0.jpg) | 94.09 KB |\n\n",
  "author": "Garamondus",
  "time": "4 Feb 2013 — 1:48pm",
  "uid": "202995",
  "comments": [
    {
      "time": "4 Feb 2013 — 1:59pm",
      "content": "Advertiser’s Gothic.  \nEarly 20th Century, American.\n\n"
    },
    {
      "time": "7 Feb 2013 — 1:21pm",
      "content": "Thank you again.  \nI read it was designed by Robert Wiebking in 1917 but what about the artistical leaning of the font.  \nIs it influenced by Art Nouveau or by Art Deco in your opinion?\n\n"
    },
    {
      "time": "7 Feb 2013 — 3:06pm",
      "content": "Art Nouveau, without question. From Wikipedia…\n\n> The first use of the term Art Deco has been attributed to architect Le Corbusier who penned a series of articles in his journal _L'Esprit nouveau_ under the headline **1925 Expo: Arts Déco**. He was referring to the 1925 Exposition Internationale des Arts Décoratifs et Industriels Modernes (International Exposition of Modern Decorative and Industrial Arts).\n"
    },
    {
      "time": "8 Feb 2013 — 12:02am",
      "content": "There are also fonts by Jim Parkinson which share some traits with this one.\n\n"
    },
    {
      "time": "8 Feb 2013 — 2:21pm",
      "content": "No doubt the idea of curving the straight bits came from Art Nouveau, but it evolved into Art Deco, through the efforts of people like Wiebking.\n\nLooking at the history of the Mennen brand, it adopted a version of this bendy style in the teens, and used it for the wordmark—and still do!—and in packaging and advertising typography in the teens and twenties.\n\n ![](http://web.archive.org/web/20150416012549im_/http:/typophile.com/files/!BvRnOtg!Wk~%24(KGrHqMOKjkEvOYsWMqGBMD5z53J3w~~_35_5728.JPG)\n\nAdvertiser's Gothic is a tour de force by Wiebking, in which he managed to successfully integrate three design themes—curved straights, stencil, and vestigial descenders.\n\nAnother face from the same era, Poor Richard, has the similar stencil effect:\n\n ![](http://web.archive.org/web/20150416012549im_/http:/typophile.com/files/RedRooster-31299-s_3958.png)\n  \n [http://www.ascenderfonts.com/font/poor-richard.aspx](http://web.archive.org/web/20150416012549/http:/www.ascenderfonts.com/font/poor-richard.aspx \"http://www.ascenderfonts.com/font/poor-richard.aspx\")  \nAlso stencil: Auriol.  \nAlso very short descenders: Hobo.\n\nAll those styles, or parts thereof, were lettered in ads, posters and packaging before being made into type, and again, who knows where they originated? They may even be considered design by a cadre of lettering artists bouncing themes around. “Poor Richard” was hand lettered on many a silent movie intertitle.\n\nAlso in the same vein: Arts & Crafts lettering, e.g. by Rennie Macintosh and Dard Hunter (1908):\n\n ![](http://web.archive.org/web/20150416012549im_/http:/typophile.com/files/dardhunterbrainsweb_6551.jpg)\n\nIt’s doesn’t do justice to Advertiser’s Gothic to pigeon-hole it as inﬂuenced by Art Nouveau. All one can do is point out similarities—who knows what went through Wiebking’s head? Not even him, no doubt, and the only way he could ﬁnd out was to draw and cut the face, and then see what it looked like.\n\nPerhaps it could be said that it was inﬂuenced by Art Deco from the future — an emergent principle.\n\n"
    },
    {
      "time": "8 Feb 2013 — 2:41pm",
      "content": "You mean the font entitled \"Diablo\".  \n [http://www.identifont.com/show?5EJ](http://web.archive.org/web/20150416012549/http:/www.identifont.com/show?5EJ \"http://www.identifont.com/show?5EJ\")\n\nDo you consider John Schaedler's \"Tabasco\" in the same vein of Robert Wiebking's \"Advertisers Gothic\"?  \n [http://www.myfonts.com/fonts/softmaker/tabasco/](http://web.archive.org/web/20150416012549/http:/www.myfonts.com/fonts/softmaker/tabasco/ \"http://www.myfonts.com/fonts/softmaker/tabasco/\")\n\nHow do you differentiate Art Nouveau from its German counterpart known as Jugendstil in the context of typeface and Robert Wiebking in particular?\n\n"
    }
  ]
}
