{
  "id": "100345",
  "title": "Scripto, a singularly rythmical script face",
  "forum": "Home",
  "tags": [
    "bureau des affaires typographiques",
    "franck jalleau",
    "News",
    "script",
    "scripto"
  ],
  "content": "Designed by Franck Jalleau, Scripto is the fruit of a work on gesture and its resulting trace, along with the research on new rhythms. It steers away from usual cursive typefaces through bold and radical choices.\n\n ![](http://web.archive.org/web/20140713055911im_/http:/typophile.com/files/Scripto_press_4s_5716.jpg)\n\nAs a reaction to statism of typography, the dynamics and freedom of handwriting are a vast field of research to typeface designers. Franck Jalleau designed Scripto as a mean to address those ancient concerns by unubiquituous proposals. Scripto is the fruit of a work on gesture and its resulting trace, along with the research on new rhythms. It steers away from usual cursive typefaces and takes some liberty in that respect: in Scripto, slope angle is not steady, instead it features a great variety of shapes, steepness angles and counterangles. The silhouette of each word is made by assembling characters with different energies and slopes.\n\nIn order to create a rich and lively pace, characters are not systematically ligatured. Many so-called ligatures in Scripto are born from the plain connection of characters and their respective shape designs. However, a few rare characters, combined or doubled, have been ligatured to emphasize animation and differences in the setting.\n\nScripto is a contemporary typographic writing, vivid and brisk reflecting its author's personality. It is also a timeless typeface that has its roots and influences in some of Antique Rome cursive alphabets.\n\nA charming demonstration of Franck Jalleau's skills, Scripto is meant for display copy or short texts.  \nInitially designed in 1996, the typeface was awarded a first prize at the Morisawa competition.\n\n[http://www.batfoundry.com/catalogue\\_7\\_scripto\\_.html](http://web.archive.org/web/20140713055911/http:/www.batfoundry.com/catalogue_7_scripto_.html \"http://www.batfoundry.com/catalogue\\_7\\_scripto\\_.html\")\n\n ![](http://web.archive.org/web/20140713055911im_/http:/typophile.com/files/Scripto_press_1s_6251.jpg)\n\n",
  "author": "B.A.T",
  "time": "4 Feb 2013 — 12:52pm",
  "uid": "84539",
  "comments": [

  ]
}
