{
  "id": "100397",
  "title": "Opinion on Elena font for print",
  "forum": "General Discussions",
  "tags": [
    "Elena",
    "General Discussions"
  ],
  "content": "Elena is an attractive font for mobile devices, but I am curious how it works for printed output for books or papers. It seems to have a nice italic, and many of the classic typefaces have only fair (Baskerville, minion, documenta) or poor (old style 7) italic fonts. I personally like quadraat, dolly, and mercury, And trinite italics. Since I have only seen Elena on an iPad, I do not know how it would work in print. Thanks.\n\n",
  "author": "Delete",
  "time": "6 Feb 2013 — 1:52pm",
  "uid": "27645",
  "comments": [
    {
      "time": "6 Feb 2013 — 2:36pm",
      "content": "Why not just look at the font details at the source - [Process Type Foundry](http://web.archive.org/web/20150307043526/http:/processtypefoundry.com/fonts/elena/) and make your own judgement. - Herb\n\n"
    },
    {
      "time": "6 Feb 2013 — 5:46pm",
      "content": "Visualization in web does not always correlate with experience in print output.\n\n"
    },
    {
      "time": "6 Feb 2013 — 6:07pm",
      "content": "Why not download the PDF specimen document on the PTF website and print it out? True, not the same as actual print, but it should give you a better idea.\n\n"
    },
    {
      "time": "18 Feb 2013 — 4:33pm",
      "content": "Printing the pdf helped some, but I purchased it and am pleased. It has a generous x-height but on printout is something like Collis. (I have printed specimens of collis from Enschedé but do not own the fonts). It seems to work best as a book font around 11/14.5.  \n [![Elena photo Elena_zps01241ab2.jpg](http://web.archive.org/web/20150307043526im_/http:/i1297.photobucket.com/albums/ag36/IsleofGough/Elena_zps01241ab2.jpg)](http://web.archive.org/web/20150307043526/http:/s1297.beta.photobucket.com/user/IsleofGough/media/Elena_zps01241ab2.jpg.html)\n\n"
    },
    {
      "time": "18 Feb 2013 — 1:58pm",
      "content": "I just love that /j/.\n\n"
    },
    {
      "time": "18 Feb 2013 — 3:48pm",
      "content": "I thought Enschedé doesn't give out PDFs.\n\nhhp\n\n"
    },
    {
      "time": "18 Feb 2013 — 4:06pm",
      "content": "I'm not sure what they do now. They used to give out a high quality bitmapped pdf version of their fonts and they would send you a printed copy if you asked or purchased a different set of typefaces. That was about six years ago, and I haven't purchased anything from them recently. The image above is in Elena, but is roughly the text they used in their Collis display (except for my typos).\n\nTheir type is not only pricy, but they (like DTL) have very few opentype pro versions of their fonts. As far as I know, none of their fonts can be embedded legally in a pdf. For that reason, I have trinité, which has no equivalent, but have only printouts of their other type designs.\n\n"
    },
    {
      "time": "18 Feb 2013 — 5:06pm",
      "content": "The text is in German, but you can have a closer look at Collis [here](http://web.archive.org/web/20150307043526/http:/www.agenturtschi.ch/t3/fileadmin/download/fachartikel/Collis.pdf).\n\n"
    },
    {
      "time": "18 Feb 2013 — 5:09pm",
      "content": "I printed the pdf of Elena, and it looks very nice indeed.\n\n"
    },
    {
      "time": "19 Feb 2013 — 2:18pm",
      "content": "Elena is very nice. The only problem I have with it is the lack of true superiors or superscript. As academic and research texts use to have several footnotes, this is a major failure to my needs.\n\n"
    },
    {
      "time": "19 Feb 2013 — 2:16pm",
      "content": "Oh my, you are right (even in the pro version)!\n\n"
    }
  ]
}
