{
  "id": "1003",
  "title": "Workflow (best practice)?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "hi. i hope this is no best kept secret:   \ni was wondering about your workflow. like how to do start when designing a new digital font. draw it by hand, which sizes, which pens, digitize it or build it from scratch in illustrator, fontlab, fontographer, how you test the single letters for use in words and so on ... i just started my first sketches on my first font i like to digitize and i still have no a idea what would be an productive workflow for doing so. everyone gotta learn but i dont wanna go through all possible bugs, gaps and errors everyone else has gone trough before. if this is a well kept secret i'll fully understand it and would take some book sugestions instead ![:-)](http://web.archive.org/web/20131106070117im_/http:/www.typophile.com/forums/clipart/happy.gif) thanks in advance, lars\n\n",
  "author": "lars",
  "time": "22 Aug 2003 — 3:23am",
  "uid": "2145",
  "comments": [
    {
      "time": "22 Aug 2003 — 6:03am",
      "content": "Hey Lars: I would tell you my workflow secret...but then I'd have to kill you. ![](http://web.archive.org/web/20131106070117im_/http:/www.typophile.com/forums/messages/4101/14569.gif)   \n   \nActually, it's no big secret at all. At least not for me. Everyone has a different approach to designing fonts and there is no ONE WAY of doing things. My personal preference is to start on paper. I usually don't sketch out the entire library. I normally just do 10-12 key characters. After scanning the sketches, I use them as a template in Illustrator where I do a bulk of my drawing. (I posted my Illustrator files earlier in this forum).   \n   \nI normally try to finalize my drawings here before importing into FontLab. I don't like to jump back and forth. Just recently, I have been using ScanFont to copy the glyphs from my Illustrator file to FontLab. This seems to work very well as it sizes each glyph properly then places them in their corresponding FL cells.   \n   \nOnce in FontLab, it's usually just a matter of adjusting the metrics, kerning, and some of the outlines. I made this sound easy but for me, it's really the most painful part of the process.   \n   \nThis is just one method for designing a font. It may not be the \"proper\" way, but it works fine for me. I am always learning new methods and techniques...mostly from the intelligent folks here at Typophile!!\n\n"
    },
    {
      "time": "22 Aug 2003 — 8:04am",
      "content": "FYI:   \n [http://www.typophile.com/forums/messages/30/13556.html](http://web.archive.org/web/20131106070117/http:/www.typophile.com/forums/messages/30/13556.html)   \n   \nhhp\n\n"
    }
  ]
}
