{
  "id": "100382",
  "title": "\"Web-enabled\"?!",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "My recently released font \"Octant\" is listed on MyFonts' \"Recent Fonts\" page, but it never appears on the MyFonts front page in the \"Recent Fonts\" column. I've refreshed the page dozens of times, and have seen other fonts that were released at the same time as Octant show up regularly (e.g., Sjiq). I've asked MyFonts about this, and they said a font has to be \"web-enabled\" to appear on the home page.  \nHow do I web-enable my font?! Any ideas? Is that a matter on MyFonts' side, or on mine?\n\nI've already asked MyFonts, but they haven't responded yet. There are already 30 fonts that appeared after Octant since its release; if this reaches 50, it will no longer be a \"Recent Font\" and my opportunities to get some exposure on the home page will be over. \\>:(\n\n",
  "author": "Catharsis",
  "time": "6 Feb 2013 — 3:52am",
  "uid": "188621",
  "comments": [
    {
      "time": "6 Feb 2013 — 3:54am",
      "content": "Forgot the link, if that helps:\n\n[http://www.myfonts.com/fonts/catharsis-fonts/octant/](http://web.archive.org/web/20150420093210/http:/www.myfonts.com/fonts/catharsis-fonts/octant/ \"http://www.myfonts.com/fonts/catharsis-fonts/octant/\")\n\n"
    },
    {
      "time": "6 Feb 2013 — 4:16am",
      "content": "Your font is only available for standard 'Desktop' licensing/usage as opposed to having the option to license it for web font usage as well. If you look under 'Buying Choices' for Slapjack for example, it is available for both 'Desktop' and 'Web Font' usage. I can only assume that this is what they mean...\n\n"
    },
    {
      "time": "6 Feb 2013 — 4:19am",
      "content": "Yeah, I think that's what it means. But how can I make Octant available for web use? I don't suppose it's something I need to change about the OTF file?\n\n"
    },
    {
      "time": "6 Feb 2013 — 4:28am",
      "content": "Generating web font versions can be achieved in a number of ways. Font Squirrel offer a free online service which has a certain level of customisation but I would highly recommend testing the resulting formats before releasing them commercially. [FontLab have just released a beta version of Trans Type 4](http://web.archive.org/web/20150420093210/http:/typophile.com/node/99688) which has the ability to create web fonts, well WOFF and EOT anyway. FontForge is able to generate both WOFF and SVG fonts. Birdfont can generate both EOT and SVG fonts. There are also command line tools that can be set up to generate these formats and the page linked to below within the MyFonts site may help point you in the right direction:\n\n[http://www.webfonts.info/node/382](http://web.archive.org/web/20150420093210/http:/www.webfonts.info/node/382 \"http://www.webfonts.info/node/382\")\n\n"
    },
    {
      "time": "6 Feb 2013 — 6:12am",
      "content": "Hi Karl,\n\nthanks for your information!\n\nMeanwhile, I got a reply from MyFonts. It seems I just have to fill in an online addendum to my contract in order to make my fonts available as webfonts. I have done that now, so I'm hoping the issue should be resolved soon...\n\n"
    },
    {
      "time": "6 Feb 2013 — 6:24am",
      "content": "Does that mean that they perform the conversion for you?\n\n"
    },
    {
      "time": "6 Feb 2013 — 6:49am",
      "content": "Karl: Yes, MyFonts does the webfont conversion for you. And provides their own installation kit.\n\n"
    },
    {
      "time": "6 Feb 2013 — 6:54am",
      "content": "Thanks, David. Good to know.\n\n"
    },
    {
      "time": "6 Feb 2013 — 9:28am",
      "content": "How does MyFonts do the conversion?\n\n> I just have to fill in an online addendum\n\nIt would be nice for them to alert you in advance.\n\nhhp\n\n"
    },
    {
      "time": "6 Feb 2013 — 8:31pm",
      "content": "MyFonts will not promote fonts that aren't available as webfonts from MyFonts.\n\n"
    }
  ]
}
