{
  "id": "10039",
  "title": "Fenix De Los Ingenios Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi Everyone,   \n   \nThis is a logo I am working on for a Spanish Baroque Vocal group called \"Fenix De Los Ingenios\", meaning something to the effect of \"The Fool of the Ingenius\"   \n   \n ![Here is the logo:](http://web.archive.org/web/20131023030413im_/http:/www.typophile.com/forums/messages/29/68438.jpg)\n\n",
  "author": "goldfishSarah",
  "time": "30 Mar 2005 — 4:52pm",
  "uid": "5739",
  "comments": [
    {
      "time": "30 Mar 2005 — 4:58pm",
      "content": "Answers to three main questions, as well as any other comments would be appreciated:   \n   \n1.) Is the Typeface too distracting? :/   \n   \n2.) What do you think of it's balance, reducability, recognizability..   \n   \n3.) Does it feel Spanish or Baroque to you?   \n   \n   \nPlease really let me have it in this critique. I've never been good at logos and I need to learn the hard way. My professors are way too nice and I need some harsh words from astute individuals.   \n   \nThank you!\n\n"
    },
    {
      "time": "30 Mar 2005 — 5:10pm",
      "content": "Hi there,   \n   \nI guess I'm not the kind of astute person you're looking for to critique this, but my personal opinion is that the vector ornament/logo is very centered and symmetrical, but your choice of the enlarged caps kind of breaks that symmetry, I'd be interested to see what it looks like in uniform caps (all of the same either totally small caps or all caps).   \n   \nI'm not too sure if the typeface says \"Spanish Baroque\" either, but then again I haven't seen a font that says \"Spanish Baroque\". I like the colors you've used but if I had composed this I would have shrunk the text to about 85-75% of it's current sized and moved it a little closer to the graphic, however that may be personal taste with tight compositions.   \n   \nHope this helps in someway. I know what it can be like to work in a feedback vacuum!\n\n"
    },
    {
      "time": "30 Mar 2005 — 5:22pm",
      "content": "Linus,   \n   \nThanks so much for your comments! I would have to agree with you about the type being too large. I actually did this on accident- I had a previous version with smaller type that got mixed up before I posted.   \n   \nAs far as the typeface goes, I don't think it needs to be Spanish Baroque as long as it complements the design. I actually want the whole mark to be very clean, simple, and contemporary. The challenge with this is that everything from the Baroque era is very ornate and complicated. My struggle is going to be one of balance I think.\n\n"
    },
    {
      "time": "30 Mar 2005 — 9:37pm",
      "content": "If you are keeping the design/logo above the type I would suggest keeping to simpler forms below for better contrast with the form above. If you were integrating them that would be different. It's an iteresting shape above & works to suggest a stage in a way - interesting, albeit baffling. If you do keep the Small caps thing Loose some of the space between L & O in 'Los'!\n\n"
    },
    {
      "time": "31 Mar 2005 — 6:23am",
      "content": "Sarah, make a decision what is most important the name or the dingbat. Right now they are equal importance. Create a level of importance to each element.\n\n"
    },
    {
      "time": "1 Apr 2005 — 7:21am",
      "content": "I tend to agree with Daniel. Perhaps you shouldn't worry about a Spanish baroque typeface and instead select a type that is more \"neutral\" -- possibly allowing your mark to be more dominant (and baroque).\n\n"
    }
  ]
}
