{
  "id": "100451",
  "title": "Presentation software",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Having coughed up a large sum for the Creative Suite Master Collection, on the principle that although I would never use a lot of the apps, it’s always good to be prepared, I was rather disappointed that when such a situation recently arose, it didn’t have what I needed.\n\nIn particular, I was expecting some designer-friendly alternative to PowerPoint. Up to now, I’ve always used PDFs, made in InDesign, to create a “slide show”, but now I want to include sound, movies, and dissolves.\n\nAnyway, $20 for Keynote is OK. The canned transitions are a bit cheesy but should be ﬁne used with discretion, and simpler than Flash, Fireworks or After Effects.\n\nHowever, there is one HUGE problem (for a typophile): unless I’m mistaken it doesn’t support font kerning metrics!\n\nI have several options:\n\n1. Use Keynote, but import bitmapped kerned text blocks made in InDesign or Photoshop.\n2. Use Keynote, manually kerning the most obvious letter combinations.\n3. Do the whole thing in InDesign.\n4. Use a monospaced font.\n5. Some other application.\n\nWhat do you recommend?\n\n",
  "author": "Nick Shinn",
  "time": "10 Feb 2013 — 10:20am",
  "uid": "2021",
  "comments": [
    {
      "time": "10 Feb 2013 — 10:50am",
      "content": "Nick - Acrobat can do all that - and you still can do your slides in Photoshop or InDesign. Granted it takes a bit of looking to find the right menus etc.\n\n"
    },
    {
      "time": "10 Feb 2013 — 11:35am",
      "content": "\\> import bitmapped kerned text blocks  \n\\> made in InDesign or Photoshop\n\nOr you can create the entire slide that way and import it.\n\n"
    },
    {
      "time": "10 Feb 2013 — 12:08pm",
      "content": "Keynote definitely supports kerning and OpenType features in the usual Apple way, as in TextEdit. Not sure if it works with each in every font as in InDesign though.\n\nInDesign PDFs can support page transitions, if you set it up:  \n [http://help.adobe.com/en\\_US/indesign/cs/using/WSE9637270-6B1C-4287-A97B-...](http://web.archive.org/web/20150110032649/http:/help.adobe.com/en_US/indesign/cs/using/WSE9637270-6B1C-4287-A97B-0EC73859A3EB.html \"http://help.adobe.com/en\\_US/indesign/cs/using/WSE9637270-6B1C-4287-A97B-0EC73859A3EB.html\")\n\nas well as interactive content such as movies and audio.\n\n"
    },
    {
      "time": "10 Feb 2013 — 4:05pm",
      "content": "Alternately...\n\n[http://www.investintech.com/powerpoint/?gclid=CMSTwav6rLUCFQqk4AodxUUAIw](http://web.archive.org/web/20150110032649/http:/www.investintech.com/powerpoint/?gclid=CMSTwav6rLUCFQqk4AodxUUAIw \"http://www.investintech.com/powerpoint/?gclid=CMSTwav6rLUCFQqk4AodxUUAIw\")\n\n"
    },
    {
      "time": "11 Feb 2013 — 2:56am",
      "content": "I am about to start experimenting with Prezi:\n\n[http://prezi.com/](http://web.archive.org/web/20150110032649/http:/prezi.com/ \"http://prezi.com/\")\n\nHowever I do not yet know how well it handles fonts and signing up for a standard free account means that all of your content will be publically available, privacy settings being introduced for paid accounts.\n\n"
    },
    {
      "time": "11 Feb 2013 — 5:18am",
      "content": "Hi,\n\nAs far as I'm concerned, I use now reveal.js | [http://lab.hakim.se/reveal-js/#/](http://web.archive.org/web/20150110032649/http:/lab.hakim.se/reveal-js/#/ \"http://lab.hakim.se/reveal-js/#/\")\n\nIt is based on HTML, so with modern browsers, you can have OpenType features support.\n\n"
    },
    {
      "time": "11 Feb 2013 — 8:03am",
      "content": "InDesign supports movies and sound files\n\nWindow\\>Interactive\\>Media\n\nYou can do dissolves when exporting a pdf Adobe PDF (Interactive) rather than (Print) or use Window\\>Interactive\\>Page Transitions\n\nYou can use it to create SWF files too – but they will not run on iPads, which means buttons do not work, without a workaround in Acrobat which can be tiresome – especially if you have to amend one –&nbsp;all the links seem to go up the spout.\n\nI haven’t really explored the possibilities extensively, but I am sure you can get a decent presentation from it.\n\n[http://help.adobe.com/en\\_US/indesign/cs/using/WS188C0BC9-4FED-4b4a-BC8C-...](http://web.archive.org/web/20150110032649/http:/help.adobe.com/en_US/indesign/cs/using/WS188C0BC9-4FED-4b4a-BC8C-7E7C6E2BA7E1.html \"http://help.adobe.com/en\\_US/indesign/cs/using/WS188C0BC9-4FED-4b4a-BC8C-7E7C6E2BA7E1.html\")\n\n[http://help.adobe.com/en\\_US/indesign/cs/using/WSE9637270-6B1C-4287-A97B-...](http://web.archive.org/web/20150110032649/http:/help.adobe.com/en_US/indesign/cs/using/WSE9637270-6B1C-4287-A97B-0EC73859A3EB.html \"http://help.adobe.com/en\\_US/indesign/cs/using/WSE9637270-6B1C-4287-A97B-0EC73859A3EB.html\")\n\nTim\n\n"
    },
    {
      "time": "11 Feb 2013 — 9:04am",
      "content": "Nick, is this for a presentation made on your computer and you have control over the software and fonts, or does it need to be usable on other folk's computers as well?\n\n"
    },
    {
      "time": "11 Feb 2013 — 9:47am",
      "content": "PPT does have some basic kerning / tracking controls, on the PC side at least. Be aware that the PC and Mac versions of PPT will vary quite a bit in features, but more-so in interface and controls. In PPT 2010 you can find some basic options by selecting your text or text frame and clicking the tiny little box / arrow underneath the character color icon (in the Font section of the ribbon). This will open up the \"Font\" window, which has some more \"advanced\" type features, the second tab of which is kerning / tracking. Also bear in mind that in general, PPT does not play well with OTF fonts.\n\nAs a matter of fact MS just released a service pack a few weeks ago that made OTF fonts disappear when you put the presentation in \"present\" mode. They have since fixed the issue I believe. Not 100% sure, as I had to roll back my system.\n\n"
    },
    {
      "time": "11 Feb 2013 — 11:19am",
      "content": "Thanks for your input everyone.  \nI will be running the ﬁle off my MacBook.\n\n"
    },
    {
      "time": "11 Feb 2013 — 12:32pm",
      "content": "You can place PDFs into Keynote.\n\nI do this frequently. I do all my typesetting in InDesign, export as PDFs, and place into Keynote to add animations. (Though, yes, Keynote actually does have some pretty decent typography controls itself.)\n\nBut I, too, have been wishing Adobe would create a presentation application that works basically like InDesign, but provides some of the keyframe and timeline controls of Keynote (or, say, After Effects).\n\n"
    },
    {
      "time": "11 Feb 2013 — 2:49pm",
      "content": "This may be a dumb question (my “speciality”), but doesn't your CS Master Suite have Flash in it? It’s got all the bells and whistles you need…as long as you aren't giving your presentation from a iPhone, that is…\n\n"
    },
    {
      "time": "11 Feb 2013 — 7:09pm",
      "content": "I haven't used flash in a decade but i recall it was quite complex and has no doubt evolved so that i would struggle now. it seems the route to take is to make static pages in InDesign, which I am very comfortable in, then import pages into Keynote and add sound and transitions.\n\n"
    },
    {
      "time": "11 Feb 2013 — 9:33pm",
      "content": "<cite>But I, too, have been wishing Adobe would create a presentation application that works basically like InDesign, but provides some of the keyframe and timeline controls of Keynote (or, say, After Effects).</cite>\n\nThat application is called Flash. ;-)\n\nAnd by the way: more and more of those animation functions came to InDesign already. Since CS5 you can do all sorts of animations directly from within InDesign. Of course, those features are not part of the PDF standard, so they won't export to PDF directly. You can however export an SWF and embed that in a PDF again …\n\n"
    },
    {
      "time": "11 Feb 2013 — 11:50pm",
      "content": "Not all of the features are Flash only, you can do a remarkable amount within InDesign and combine it with interactive effects within Acrobat, or you can export from InDesign as a Flash file using the bells and whistles, and not have to touch it in Flash.\n\nTim\n\n"
    },
    {
      "time": "12 Feb 2013 — 1:35am",
      "content": "FWIW, in a quick test on Mac OS 10.8.2 Keynote shows kerning for OpenType CFF fonts.\n\nWhat I find a more severe limitation is that Keynote is not able to embed fonts into a presentation, so if you present from a different computer, you need to install your fonts first (and hopefully find the time to delete them again afterwards).\n\n"
    },
    {
      "time": "12 Feb 2013 — 11:32am",
      "content": "I checked Keynote’s kerning support on a variety of fonts, and can’t ﬁgure out why it works for some but not others, which kern correctly in applications such as Text Edit.\n\n"
    }
  ]
}
