{
  "id": "100469",
  "title": "Logo font, possibly custom.",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20131017173607im_/http:/typophile.com/files/Funerlhomesign_5818.JPG)\n\nJust need the main name's font. \"Rupell.\" I tried WhatTheFont and FindMyFont with no luck.\n\nThanks!\n\n",
  "author": "TheAL",
  "time": "11 Feb 2013 — 11:50am",
  "uid": "201336",
  "comments": [
    {
      "time": "11 Feb 2013 — 1:54pm",
      "content": "Here's larger sample.\n\n ![](http://web.archive.org/web/20131017173607im_/http:/typophile.com/files/rupell_5045.jpg)\n\n"
    },
    {
      "time": "11 Feb 2013 — 5:15pm",
      "content": "(did I say something wrong?)\n\n"
    },
    {
      "time": "11 Feb 2013 — 5:58pm",
      "content": "{Edited to remove (repeating) references to plagiarized fonts.}\n\nSo what are the chances that XXXXX made that (and XXXXX\\*) himself?\n\n\\* {Link to illegitimate Aachen clone removed.}  \nHey, ever heard of Aachen?\n\nAllen, I know it's hard, but try to resist using stolen goods.\n\nhhp\n\n"
    },
    {
      "time": "11 Feb 2013 — 2:27pm",
      "content": "The fonts in the two images aren’t the same, Dick.\n\n"
    },
    {
      "time": "11 Feb 2013 — 3:09pm",
      "content": "Tips on choosing a name for your cloned font:\n\n- Look in the dictionary for another word that begins with similar letters ( [Aachen](http://web.archive.org/web/20131017173607/http:/www.myfonts.com/search/aachen/fonts/) -\\> Aardvark)\n- Keep only the consonants and replace the vowels ( **[Bembo](http://web.archive.org/web/20131017173607/http:/www.myfonts.com/search/bembo/fonts/)** -\\> Bambi)\n\n"
    },
    {
      "time": "11 Feb 2013 — 5:21pm",
      "content": "Jan: Would a company like Rupell have two very similar fonts for their logo?\n\nHrant: it's not reasonable to track a designer's life work in a single IDing thread. You've been at this for 13 years or so.\n\nThought Dafont was considered an authentic source? You need to discuss these issues with them.\n\n"
    },
    {
      "time": "11 Feb 2013 — 6:01pm",
      "content": "Justin, good one! :-/  \n(BTW, you might consider now removing the references to the Aachen and Bembo clones.)\n\nDick, thank you for removing the reference to the plagiarized font; no need to pretend nothing was going wrong. And I've edited my post accordingly.\n\nI'm not sure what you mean about \"tracking a designer's life work\". When I saw the font you linked to, I immediately had to suspect plagiarism. I did a few minutes of research, and my suspicion was reinforced enough to issue the warning. And I've been like this for 44 years, not 13.\n\nAs for Dafont being an \"authentic source\", I really have no idea how somebody could think that... And there's no way I'm wasting time trying to convert bottom-feeders.\n\nBTW, the people who made the sign are probably not the people who made the web graphics, so it's actually common to end up with different (if similar) fonts.\n\nhhp\n\n"
    },
    {
      "time": "11 Feb 2013 — 6:06pm",
      "content": "Well, I'm confused. Neither one of those images, with their slanted tops/serifs looks anything at all like Aachen.\n\n"
    },
    {
      "time": "11 Feb 2013 — 6:08pm",
      "content": "The Aachen reference only concerned another ethical violation on the part of the person who plagiarized Bembo (which is the font in Dick's image - although not Allen's).\n\nhhp\n\n"
    },
    {
      "time": "11 Feb 2013 — 6:21pm",
      "content": "So after all that, what is the name of the OP font?\n\n"
    },
    {
      "time": "11 Feb 2013 — 6:30pm",
      "content": "Best I could guess from the first tiny image is [Caslon Black](http://web.archive.org/web/20131017173607/http:/www.myfonts.com/search/caslon+black/fonts/) stretched horizontally.\n\n"
    },
    {
      "time": "11 Feb 2013 — 6:36pm",
      "content": "In the big scheme of things that's secondary. The important thing is that nobody is getting away pretending that naming a plagiarized font is OK, especially when they hide the real reason they removed the offending reference.\n\nhhp\n\n"
    },
    {
      "time": "11 Feb 2013 — 11:10pm",
      "content": "I'm sure the OP was very satisfied to secondarily participate with the children of Typophile.\n\n"
    },
    {
      "time": "12 Feb 2013 — 2:27am",
      "content": "> Jan: Would a company like Rupell have two very similar fonts for their logo?\n\nObviously. Look at the leg on the |R| and the overall weight.\n\n"
    },
    {
      "time": "12 Feb 2013 — 4:28am",
      "content": "> I'm sure the OP was very satisfied to secondarily participate with the children of Typophile.\n\nHrant is not being childish and if you genuinely think this sort of exchange is childish then I politely suggest it’s your attitude that needs adjusting.\n\n"
    },
    {
      "time": "12 Feb 2013 — 4:39am",
      "content": "Allen, it’s hard to be definitive with such a small sample and the reflective quality of the 3D letters isn’t helping any. First thing I thought of was a black weight of Bodoni.\n\n"
    },
    {
      "time": "12 Feb 2013 — 8:25am",
      "content": "Whoa! First of, I apologize for starting such a ruckus!\n\nI am remaking the logo for that company, but the only reference they have is their sign. I ended up approximating it with a free font. The gold logo that was posted above is what I myself made after I posted this (the name of the place was likely Googled and the new logo found after I uploaded it).\n\nThanks to all who have helped, and apologies again for all of the hassle.\n\n"
    },
    {
      "time": "12 Feb 2013 — 9:31am",
      "content": "No need to apologize. Some of us (although not nearly enough of us lately) make it a point to remind people that the effort that goes into making a font (and by \"making\" I don't mean plagiarizing...) is worth rewarding.\n\nWhat font(s) did you use?\n\nhhp\n\n"
    }
  ]
}
