{
  "id": "100441",
  "title": "Pirates and blackletter",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Why did pirates use blackletter type for their logos? Was it because that was the only type available to them? Is that pirate/blackletter association just a fairy tale? They didn't even know how to read.\n\n",
  "author": "etahchen",
  "time": "8 Feb 2013 — 11:19pm",
  "uid": "42411",
  "comments": [
    {
      "time": "9 Feb 2013 — 4:24am",
      "content": "Not sure what logos you are referring to. Do you have some images?\n\n"
    },
    {
      "time": "9 Feb 2013 — 6:22am",
      "content": "Quite a few years ago, an illustrator (whose name, alas, I have forgotten) sent me a portfolio that included one of my favorite art-director-and-client cartoons ever. It shows a pirate captain seated at a table surrounded by his pirate crew. Across the table, a man is holding up a picture of a skull and crossbones. In the caption, the pirate captain says, \"Sure, it's a nice bold graphic, but does it really say 'piracy'?\"\n\n"
    },
    {
      "time": "9 Feb 2013 — 9:06am",
      "content": "Why do you think they used blacketter (or anything else, for that matter)? The only blackletter Pirate \"Logos\" I know of are for contemporary software pirates. In fact, I can't think of anybody like Blackbeard even having anything you'd consider to be a 'logo', except for their ships' flags, mostly black or variations of the skull and crossbones.\n\n"
    },
    {
      "time": "9 Feb 2013 — 7:55am",
      "content": "Real pirates, like most criminals, were probably careful to avoid using fonts of any kind, lest they create a paper trail of their activities.\n\nThe pirates depicted in books and movies are based on 19th-Century stories about the pirates who preyed on merchant vessels in the Atlantic and Caribbean in the 17th and early 18th Centuries. My guess is that 19th and 20th-Century publishers used blackletter fonts for the titles of these stories for much the same reason they used them for stories about Robin Hood or the Knights of the Round Table. At least in English-speaking countries, blackletter is often used to cue readers that the story took place a long, long time ago.\n\nI'd like to think that if Adobe had been around 350 years ago, pirates would have used Photoshop.\n\n ![](http://web.archive.org/web/20150419104253im_/http:/typophile.com/files/dither_4474.jpg)\n\n"
    },
    {
      "time": "9 Feb 2013 — 9:55am",
      "content": "I'm not sure that blackletter is even the style most commonly associated with stories about pirates. I know it was used sometimes, but it seems a bit formal.\n\n ![](http://web.archive.org/web/20150419104253im_/http:/typophile.com/files/pirates_4949.jpg)\n\n"
    },
    {
      "time": "9 Feb 2013 — 12:08pm",
      "content": "When I think about pirates, I tend to think of Fifteenth Century, later misnamed \"Caslon Antique\", and similar styles of printing. Not used by the pirates themselves so much as by the society around them in which they lived.\n\n"
    },
    {
      "time": "9 Feb 2013 — 1:35pm",
      "content": "When a pirate even heard the word \"logo\" he reached for his cutlass.\n\n"
    },
    {
      "time": "9 Feb 2013 — 7:01pm",
      "content": "> When I think about pirates, I tend to think of Fifteenth Century, later misnamed “Caslon Antique”, and similar styles of printing.\n\nDoes the liquor label typography generate those [subconscious] associations? ![](http://web.archive.org/web/20150419104253im_/http:/www.cutty-sark.com/sites/default/files/advertising-gallery/main_image/Cuttyposter.jpg) ![](http://web.archive.org/web/20150419104253im_/http:/www.rum.cz/galery/nam/ca/seagram/img/ca162.jpg) ![](http://web.archive.org/web/20150419104253im_/http:/cdn2.bigcommerce.com/server4600/57a31/products/13044/images/84890/captainmorganlongislandtea175__66554.1353106609.1280.1280.jpg) ![](http://web.archive.org/web/20150419104253im_/http:/www.thestudio203.com/rumalbum/images/15_jpg.jpg)\n\n"
    },
    {
      "time": "9 Feb 2013 — 7:18pm",
      "content": "That's quite possible, and other pop culture things besides liquor labels likely played a part as well. I was doing some searching, and the time of Blackbeard, for example, coincided with the use of Caslon itself, not the significantly different types which preceded it by two centuries.\n\n"
    },
    {
      "time": "10 Feb 2013 — 9:01am",
      "content": "... the awkward scrawled notations found across the pages of the captain's book of charts -- Forming an 'X' to mark the spot.\n\n"
    },
    {
      "time": "11 Feb 2013 — 8:21am",
      "content": " ![](http://web.archive.org/web/20150419104253im_/http:/typophile.com/files/blackbeard-pirates-flag_4418.jpg)\n\nCorporate identity (not so corporeal) for Blackbeard. Needs no translation either.\n\nTim\n\n"
    },
    {
      "time": "11 Feb 2013 — 8:26am",
      "content": "I guess even pirates wanted people to know they're coming. But did ninja houses have IDs?\n\nhhp\n\n"
    },
    {
      "time": "11 Feb 2013 — 9:13am",
      "content": "Pirates of high and low Cs, featuring Tom Waits and Keith Richards, have announced their new LP, Son of Rogues Gallery ...\n\n![](http://web.archive.org/web/20150419104253im_/http:/www.graphicdeclaration.com/images/blackletterpirate.jpg)\n\n...Pirate Ballads, Sea Songs & Chanteys\n\n[http://www.npr.org/2013/02/10/171309504/first-listen-son-of-rogues-galle...](http://web.archive.org/web/20150419104253/http:/www.npr.org/2013/02/10/171309504/first-listen-son-of-rogues-gallery-pirate-ballads-sea-songs-chanteys?sc=tumblr&cc=tumb_music \"http://www.npr.org/2013/02/10/171309504/first-listen-son-of-rogues-gallery-pirate-ballads-sea-songs-chanteys?sc=tumblr&cc=tumb\\_music\")\n\nn.\n\n"
    },
    {
      "time": "21 Feb 2013 — 5:33pm",
      "content": "> Is that pirate/blackletter association just a fairy tale?\n\nThe fonts used on the maps of the day were of blackletter ...so naturally the pirates associated themselves with blackletter in their logos.\n\n:)\n\nn.\n\n"
    },
    {
      "time": "21 Feb 2013 — 11:32pm",
      "content": "<cite>The fonts used on the maps of the day were of blackletter .</cite>\n\nI doubt that. The maps were either hand-written or (when printed) had the typical wood cut or (later) copperplate style using Latin script. I don't think I have ever seen a sea map using blackletter. Not that it was not done at all, but I doubt that is was typical at that time.\n\n[http://upload.wikimedia.org/wikipedia/commons/4/42/1696\\_Danckerts\\_Map\\_of...](http://web.archive.org/web/20150419104253/http:/upload.wikimedia.org/wikipedia/commons/4/42/1696_Danckerts_Map_of_Florida,_the_West_Indies,_and_the_Caribbean_-_Geographicus_-_WestIndies-dankerts-1696.jpg \"http://upload.wikimedia.org/wikipedia/commons/4/42/1696\\_Danckerts\\_Map\\_of\\_Florida,\\_the\\_West\\_Indies,\\_and\\_the\\_Caribbean\\_-\\_Geographicus\\_-\\_WestIndies-dankerts-1696.jpg\")\n\n"
    },
    {
      "time": "22 Feb 2013 — 11:10am",
      "content": "I don't recall having ever seen blackletter on sea charts, but I saw it today on a section of an Ordnance Survey map of a town named Lewes in East Sussex. Looked like fraktur, at that.\n\n"
    },
    {
      "time": "22 Feb 2013 — 11:35am",
      "content": "And another source would of been the broad sheets, news sheets, newspapers of the day...\n\n![](http://web.archive.org/web/20150419104253im_/http:/www.graphicdeclaration.com/images/blackletter_pirates_1.jpg)\n\n...I can just image a dockside broad sheet wanted poster plastered up all over the place with the pirates name in blackletter.\n\nn.\n\n"
    },
    {
      "time": "22 Feb 2013 — 12:13pm",
      "content": "@Neil - Nobody questions the fact that blackletter was (and still is) widely used. There's just nothing to associate it with Piracy any more than with anything else.\n\n"
    },
    {
      "time": "22 Feb 2013 — 1:45pm",
      "content": "Herb, I'm beginning to be convinced that pirates themselves did not use blackletter but did use broad nibbed lettering all the same with more formal and exaggerated expressions. Here's a couple of grabs from a Spanish nautical chart of late 17th century...\n\n![](http://web.archive.org/web/20150419104253im_/http:/www.graphicdeclaration.com/images/blackletter_pirates_2.jpg)\n\n...a have little doubt that these notorious captains were well educated and knew a thing or two about expressive penmanship.\n\nPerhaps it is more likely that if blackletter is to be strongly associated with pirates it is due to the periodicals of the day such as in my above post, and not used by the captains themselves. But, having looked into this most intriguing matter a little further there was for a brief time a pirate's government formed. Located in the Caribbean it must of had some form of printed material, perhaps even a charter of independence. Whether or not such material used blackletter or even exaggerated swashes as above I would really like to see.\n\nn.\n\n"
    },
    {
      "time": "22 Feb 2013 — 7:34pm",
      "content": "Someone's got to say it, and it might as well be me: It's only natural that pirates liked exaggerated swashes, since they did so much swashbuckling.\n\n"
    },
    {
      "time": "24 Feb 2013 — 6:56am",
      "content": "/me groans.\n\n"
    },
    {
      "time": "9 Mar 2013 — 12:38am",
      "content": "lol. me groans too.\n\n"
    },
    {
      "time": "27 Jan 2015 — 7:19am",
      "content": "I like so many blog writing tips but this blog is providing the information is very different and is very helpful to all the blog [pay for a research paper](http://web.archive.org/web/20150419104253/http:/www.topbritishessays.com/) writers. So that I am utilizing these all services for my future education life.\n\n"
    },
    {
      "time": "27 Jan 2015 — 1:59pm",
      "content": "If I were a criminal on the assault, contraband and piracy business I would certainly avoid brands of any kind... I would probably use the government's flags.\n\n"
    }
  ]
}
