{
  "id": "10044",
  "title": "Caption Display Subhead Regular?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Apologies if this has been covered before; I couldn't seem to get the forum search to work.   \n   \nIn many of my Pro families - Warnock, Jenson, etc - there are, in addition to all the various weights, faces for Caption, Subhead, Display, and other programmatic descriptions.   \n   \nWhat's the deal with these? How do they differ from the Regular face (I see differences in kerning, but I don't know the rhyme or reason to them), and if they only do differ in terms of spacing, what's the reasoning that makes, say, the 'Caption' face more tightly spaced than the Display, and so on?\n\n",
  "author": "<a href=\"/web/20120108081738/http://typophile.com/user/3424\" title=\"View user profile.\">cruxdestruct</a>",
  "time": "<br>",
  "uid": "3424",
  "comments": [
    {
      "time": "",
      "content": "You can find information about these faces on [http://store.adobe.com/type/opentype/main.html#adv](http://web.archive.org/web/20120108081738/http:/store.adobe.com/type/opentype/main.html#adv) under \"Advanced Typography\".   \n   \nOne citation from there: \"Historically, some of the highest quality typefaces have included different designs for different print sizes. Several of Adobe's OpenType fonts include four optical size variations: caption, regular, subhead and display. Called \"Opticals,\" these variations have been optimized for use at specific point sizes. Although the exact intended sizes vary by family, the general size ranges include: caption (6-8 point), regular (9-13 point), subhead (14-24 point) and display (25-72 point).\"   \n   \nThere has been a more detailed info about the \"Pro\" features some weeks ago, but since the adobe-website was redesigned meanwhile I couldn't find that yet.   \n   \nMichael\n\n"
    },
    {
      "time": "",
      "content": "Here, I've found it:   \n   \n [http://studio.adobe.com/us/type/main.jsp?xhtml=topics/opticalsize](http://web.archive.org/web/20120108081738/http:/studio.adobe.com/us/type/main.jsp?xhtml=topics/opticalsize)   \n   \nMichael\n\n"
    },
    {
      "time": "",
      "content": "Cheers; quite fascinating.\n\n"
    }
  ]
}
