{
  "id": "100408",
  "title": "A serif partner to Akkurat",
  "forum": "Design",
  "tags": [
    "Akkurat",
    "branding",
    "font pairing",
    "serif",
    "Design"
  ],
  "content": "Hi folks,\n\nAppreciate anyone who chips in to this. Fleshing out a branding/identity project and looking for pairing a serif typeface with Akkurat:\n\n[http://lineto.com/The+Fonts/Font+Categories/Text+Fonts/Akkurat/](http://web.archive.org/web/20141030072126/http:/lineto.com/The+Fonts/Font+Categories/Text+Fonts/Akkurat/ \"http://lineto.com/The+Fonts/Font+Categories/Text+Fonts/Akkurat/\")\n\nAkkurat is already established, used in the logo and has been used for body text. It is for a design agency. The challenge I've had is choosing a serif face to partner it. Why? When creating documents with longer passages of text, I'd rather not use Akkurat for absolutely everything. A lot of the clients are Universities and in the Education sector, and I always feel they prefer serifs as well (albeit ungrounded research).\n\nI've been looking for character shapes that match Akkurat (and the usual elements like x-height, descender/ascender height). I feel the old classics just aren't doing it: Baskerville, garamond, bembo, sabon, century, even bodoni – they just seem too big a jump. I feel it will be something more 'modern'. Even slab serif.\n\nSo far, I've liked FM by A2 type. I like how it shares the square dots i.e. full stop, 'i', 'j'. I am a fan of Publico and Mercury as well, but don't feel they are right for this.\n\nSo that's the pairing challenge – appreciate any help.\n\nThanks,\n\nLewis\n\n",
  "author": "Public Spaces Design",
  "time": "7 Feb 2013 — 8:17am",
  "uid": "98417",
  "comments": [
    {
      "time": "7 Feb 2013 — 8:23am",
      "content": "Maybe Adelle-Serif.\n\nhhp\n\n"
    },
    {
      "time": "7 Feb 2013 — 8:33am",
      "content": "That's nice, I did not know of Adelle-Serif. The samples are useful that came up on the type together site. And there's a free version – great, will try it out. Thanks!\n\n"
    },
    {
      "time": "8 Feb 2013 — 3:53am",
      "content": "An update on this. I have found a good, working example of Akkurat with a serif face:\n\n[http://heydays.no/2009/premiss/](http://web.archive.org/web/20141030072126/http:/heydays.no/2009/premiss/ \"http://heydays.no/2009/premiss/\")\n\nI think that's exactly what I was looking for. I regard myself as very good at identifying sans serifs but not as good with serifs, so I can't figure out what has been used for this. It is quite similar to Tiempos (Village) but not quite - a thinner version for one.. I like the rounded off finishes at the end of some of the stems as opposed to a regular serif (in the italic).\n\nWell, any help in identifying would be much appreciated.\n\n"
    },
    {
      "time": "8 Feb 2013 — 4:19am",
      "content": "This is [Mercury](http://web.archive.org/web/20141030072126/http:/www.typography.com/fonts/font_overview.php?productLineID=100017&path=head) (which you excluded in your first post ;-)).\n\n"
    },
    {
      "time": "8 Feb 2013 — 7:15am",
      "content": "Sweet Irony. I actually did suspect that when I was looking at it, but it was hard to tell. Are you certain? It seems quite thin... maybe it is the 'G1' version of it?\n\n---\n\nUpon closer inspection I think it must be. That'll teach me to be so dismissive. It is always amazing how many different ways a typeface can \"look\" and \"feel\" even though we usually think of the character of a face has creating a particular, consistent \"feel\". Context is key. That's why I love type!\n\nSo lesson learnt – Mercury goes well with Akkurat.\n\n"
    }
  ]
}
