{
  "id": "100455",
  "title": "ARABIC FoNT ID",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20130821041106im_/http:/typophile.com/files/64894_10151441310833249_1960548073_n_5603.png)\n\nThanks in Advance!\n\n",
  "author": "manyaldesign",
  "time": "10 Feb 2013 — 11:55pm",
  "uid": "200834",
  "comments": [
    {
      "time": "12 Feb 2013 — 1:16am",
      "content": "deleted\n\n"
    },
    {
      "time": "12 Feb 2013 — 9:01pm",
      "content": "{Edited following Alexandru's gracious removal of reference to plagiarized font.}\n\nI'm sorry to say that this raises a large red flag - I have to suspect a case of outline theft (possibly involving Rotis).\n\nIn fact, please do not recommend or use any fonts by XXXXX since it's become pretty clear that he doesn't respect fellow designers, based on his comments on a recent Typophile thread.\n\nAlexandru, if you could please remove your recommendation I believe that would be good for typeface design in general and Typophile in particular.\n\nhhp\n\n"
    },
    {
      "time": "12 Feb 2013 — 8:14pm",
      "content": "Thanks hrant and Alexandru! I'm still looking for the arabic font's name. Anyone that's familiar with arabic typeface? Thanks again\n\n"
    },
    {
      "time": "12 Feb 2013 — 8:57pm",
      "content": "While the font referenced above appears to fit the \"Abdulhamid\" text it does not contain Arabic characters -- Russian yes. There is likely a second font associated with your sample.\n\n"
    },
    {
      "time": "12 Feb 2013 — 9:13pm",
      "content": "Dick, Alexandru kindly removed the reference to the offending font.\n\nAs for the Arabic font, it sort of reminds me of the Latin typeface FF Profile.\n\nhhp\n\n"
    },
    {
      "time": "13 Feb 2013 — 9:01am",
      "content": "From what I can see the FF Profile has squared strokes, whereas the OP has angled pointed tails. The problem is the other font which is a fixed width design with \"flaired\" or \"wedge\" ends.\n\n"
    },
    {
      "time": "13 Feb 2013 — 5:06pm",
      "content": "@WhatFontIs: hrant does not speak on behalf of Typophile. You are under no obligation to edit your posts based on his suspicions.\n\n"
    },
    {
      "time": "13 Feb 2013 — 5:41pm",
      "content": "Indeed that's true. But nobody should ignore his conscience, especially when the chances of plagiarism are so high.\n\nhhp\n\n"
    },
    {
      "time": "14 Feb 2013 — 1:19am",
      "content": "Hello  \nThank you Chris.  \nThe font I recommended is also included in google web fonts.  \nI'm not very good with this copyright problems.  \nAlex\n\n"
    },
    {
      "time": "14 Feb 2013 — 5:10am",
      "content": "Google makes an extra effort to avoid tainted goods, so it's probably OK.\n\nhhp\n\n"
    },
    {
      "time": "4 Mar 2013 — 2:39pm",
      "content": "So the result of this banter is that Harif still has no font id - good bad or indifferent.\n\n"
    }
  ]
}
