{
  "id": "100491",
  "title": "Rieven Roman by Steven Skaggs",
  "forum": "Release",
  "tags": [
    "contemporary",
    "Delve Fonts",
    "fonts",
    "new",
    "Rieven",
    "Roman",
    "Skaggs",
    "Text",
    "typeface",
    "wide",
    "Release"
  ],
  "content": "For Immediate Release:  \nAlameda, CA- February 12th, 2013\n\nDelve Fonts presents Rieven™ Roman, by Steven Skaggs.  \nAvailable now at: [http://www.delvefonts.com/rieven\\_roman.html](http://web.archive.org/web/20150415033148/http:/www.delvefonts.com/rieven_roman.html)\n\nIn order to address those instances where the more contemporary letterforms are preferred, designer Steven Skaggs has expanded the Rieven family by creating a Roman version that can be used hand-in-hand with its predecessor, Rieven Uncial.\n\nUncial-specific forms were replaced by Skaggs with more conventional venetian forms and the lowercase of the accompanying italic is almost entirely re-drawn. With these features, Rieven Roman is ideal for lengthier passages of text in magazines, books, and websites. It can be used in tandem with Rieven Uncial for a consistent style, and optimal readability.\n\nIncluded in the Rieven Roman package is Rieven Ornaments, a font comprised of over 180 useful symbols, circled numbers, arrows, and decorative ornaments.\n\n ![](http://web.archive.org/web/20150415033148im_/http:/typophile.com/files/rieven_roman_specimen_3774.jpg)\n\nA type specimen (PDF) for Rieven Roman can be downloaded at: [http://www.delvefonts.com/pdf/specimen\\_rieven\\_roman.pdf](http://web.archive.org/web/20150415033148/http:/www.delvefonts.com/pdf/specimen_rieven_roman.pdf)\n\nSteven Skaggs studied calligraphy and typography under Hermann Zapf. His calligraphic artworks are in the collections of the Klingspor Museum, Offenbach Germany, the Sackner Archive of Visual and Concrete Poetry in Miami, and the Akademie der Künst, Berlin. He has been active giving workshops and teaching throughout the United States as well as Canada, Italy, Switzerland and Germany. Steven Skaggs lives in Louisville, Kentucky where he is Professor of Design at the Hite Art Institute, University of Louisville.\n\nDelve Fonts is a full-service type foundry in Alameda, CA offering new, original typefaces and type design services including: Custom Type Design, Foreign Language Fonts, fonts for Games, Apps, and Mobile Devices.\n\nSign up to receive the Delve Fonts newsletter: [http://eepurl.com/ikNr](http://web.archive.org/web/20150415033148/http:/eepurl.com/ikNr)\n\nFollow Delve Fonts on Twitter: [http://www.twitter.com/delvew](http://web.archive.org/web/20150415033148/http:/www.twitter.com/delvew)\n\nLike Delve Fonts on Facebook: [http://www.facebook.com/delvefonts](http://web.archive.org/web/20150415033148/http:/www.facebook.com/delvefonts)\n\nRieven Roman is a trademark of Delve Fonts. All rights reserved.\n\n###\n\n",
  "author": "delve",
  "time": "12 Feb 2013 — 8:19pm",
  "uid": "910",
  "comments": [

  ]
}
