{
  "id": "10040",
  "title": "Question concerning the lowercase \"g\" and \"a\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello.   \n   \nI'm not a typographer, but the craft has always interested me. Something that I've wondered about for a long while is why there seem to be two distinct (but identifiable) versions of the lowercase \"g\".   \n   \nI'm unfamiliar with the lexicon for discussing type, so I'll do my best with a visual description. In some fonts, the \"g\" is composed of a bulb, a loop that drops below the baseline, and a slight vertical protrusion at the top right corner. In other fonts, the \"g\" is composed of two bulbs, one below the baseline and attached to the other with a short loop, and a horizontal or diagonal protrusion at the top right corner. Whether a font has one \"g\" or the other is seemingly totally independent of its style. Two examples of these \"g\"s are in the fonts Futura and Trebuchet MS.   \n   \nWhy is there this duality? And how did the double-bulbed variety come about? I've been pondering this over with friends; we feel that they both must have developed from one variety in the past. We also realized that the same duality occurs with the letter \"a\", though not necessarily in the same font as the \"g\".   \n   \nDoes anyone know how these dualities came about? ![(some \"g\"s)](http://web.archive.org/web/20131108005550im_/http:/www.typophile.com/forums/messages/30/68446.jpg)\n\n",
  "author": "rezmason",
  "time": "30 Mar 2005 — 5:13pm",
  "uid": "6265",
  "comments": [
    {
      "time": "30 Mar 2005 — 6:32pm",
      "content": "These dualities stem from the derivation of type from written forms, and represent two historical ways in which these letters developed prior to the invention of printing from moveable type. These are not, by the way, the only forms of g and a encountered in [palaeography](http://web.archive.org/web/20131108005550/http:/www.newadvent.org/cathen/11403a.htm), there are other forms which did not influence the development of typographic forms, or whose influence was short-lived or localised. A good example of localised influence is the traditional Irish g. You can see some examples in Michael Everson's digitisations of [historical Irish types](http://web.archive.org/web/20131108005550/http:/www.evertype.com/celtscript/csmain.html).\n\n"
    },
    {
      "time": "8 Apr 2005 — 12:35pm",
      "content": "I think John did a good job of answering the question concisely. But I'd like to add a little more, if I may\n\n"
    },
    {
      "time": "9 Apr 2005 — 10:59pm",
      "content": "Correct me if I'm wrong, but...   \n   \nThe double-storied g and a are commonly features of serifed roman fonts, wheras the single-story forms are more characteristic of an italic or a cursive font (or writing style).   \n   \nfor your consideration: does the following glyph look more like the double-storied g? or a single-story g?   \n   \n ![???](http://web.archive.org/web/20131108005550im_/http:/www.typophile.com/forums/messages/30/69268.gif)\n\n"
    },
    {
      "time": "9 Apr 2005 — 11:10pm",
      "content": "I think the distinction is really about how the bottom part of the g connects to the top part, and what we think of as single-storey is a class of form in which the bottom part of the letter comes off a right stem.\n\n"
    },
    {
      "time": "9 Apr 2005 — 11:16pm",
      "content": "here's another interesting question related to these 2 letters... take a look at Paul's post (#8) in this thread: [http://www.typophile.com/forums/messages/4100/68949.html?1113004951](http://web.archive.org/web/20131108005550/http:/www.typophile.com/forums/messages/4100/68949.html?1113004951).   \n   \nwhat do you make of this? is it really harder for young children to \"read\" these letters? or is it just that we teach the simpler forms first?\n\n"
    },
    {
      "time": "10 Apr 2005 — 1:31am",
      "content": "Nobody has addressed printing problems of the various g's which have had so much influence and about which there must be many who can speak much more authoritatively than me. The major reason for the simplified g of Helvetica (and the a) is that they are much less likely to clot, not just in metal, but also in digital type, at small sizes. (Look at the Meta bold g in Fowler MEU 3 for a terrifying example of this problem in modern printing and this using a supposedly rational font. Why does anybody ever believe anything that a manufacturer or designer ever says about a font?)   \n   \nOne miscellaneous point: many metal fonts with beautiful g's have had short lives and limited usage for the simple reason that the character broke too easily.\n\n"
    },
    {
      "time": "10 Apr 2005 — 10:51am",
      "content": "_is it really harder for young children to \"read\" these letters? or is it just that we teach the simpler forms first?_   \n   \nI was talking about this with Sue Walker, head of the typography department at the University of Reading and an expert on the typography of childrens' books. She says that there is no evidence that children cannot easily recognise and accept two forms of a/g, even at an early age.\n\n"
    },
    {
      "time": "10 Apr 2005 — 11:13am",
      "content": "Hi Paul,   \n   \n\"Correct me if I'm wrong, but...   \nThe double-storied g and a are commonly features of serifed roman fonts, wheras the single-story forms are more characteristic of an italic or a cursive font (or writing style).\"   \n   \nThis is generally true, though there are certainly always exceptions. Double-story \"a\" and \"g\" are also fairly common in sans serif Roman fonts as well. But of course, in an effort to simplify the structure, many sans serif designers opt for a single-story character.   \n   \n\"for your consideration: does the following glyph look more like the double-storied g? or a single-story g?\"   \n   \nAs always, this is one of those cases where one could argue it falls under either category. (Sort of like, is the movie a drama with comedy, or a comedy with drama.) Within the branch of Gothic characters, it was also quite common to find \"a\"s that appear to be in both categories at the same time.   \n   \nBut if one wanted to be a historic stickler, the\"g\" example you show would more technically come under the heading of a single-story character. This is because it is a Textura character following the same principle as the Italic (and other manuscript hands of that era) lowercase \"g.\" The lowercase \"g\" of that time was always closed (i.e., the descender hooked back up to the nadir of the body). This was done to prevent it from being confused with a \"q,\" which back then was written like we make today's \"hooked-g.\" This enclosed Italic \"hooked-g\" was a single-story \"g\" (even though it appears to fall into either category) because within the same Italic alphabet there was also a version (sometimes multiple versions) of \"linked-g\" (double-story g) as well. Both \"g\"s were freely used side by side.\n\n"
    },
    {
      "time": "10 Apr 2005 — 11:29am",
      "content": "_As always, this is one of those cases where one could argue it falls under either category._    \n   \nexactly what i was getting at. i think especially looking at the scripts that predated printing types you can see where either of our modern forms of the letter could be derived from the same script form.   \n   \n_But of course, in an effort to simplify the structure, many sans serif designers opt for a single-story character._   \n   \nwhat i think is really interesting is that the sanserif italic has particular freedom in adapting any of the letter styles for it's particular needs. The first time I saw it, I was fascinated by Bringhursts table of the Italicization Quotient of Thirteen Unserifed 'Italics' in _Elements_.\n\n"
    }
  ]
}
