{
  "id": "100453",
  "title": "Miller Display vs Playfair Display",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "What are your thoughts when comparing the two?\n\n![](http://web.archive.org/web/20141012212336im_/http:/f.cl.ly/items/182H312V0P3o2p0a2N1l/playfair-font.png)\n\n![](http://web.archive.org/web/20141012212336im_/http:/f.cl.ly/items/273O2d2c3n3a1c033G1S/Image%202013-02-10%20at%207.18.14%20PM.png)\n\n![](http://web.archive.org/web/20141012212336im_/http:/f.cl.ly/items/29091I2J42103O0B0c2E/Image%202013-02-10%20at%207.18.42%20PM.png)\n\n![](http://web.archive.org/web/20141012212336im_/http:/f.cl.ly/items/1I3L2e460u0b3d01123y/miller-display-J.gif)\n\n![](http://web.archive.org/web/20141012212336im_/http:/f.cl.ly/items/3x1x3m2e1o1C1h3w3V3z/Image%202013-02-10%20at%207.19.21%20PM.png)\n\n",
  "author": "chrisburton",
  "time": "10 Feb 2013 — 4:29pm",
  "uid": "199209",
  "comments": [
    {
      "time": "10 Feb 2013 — 5:23pm",
      "content": "They are both nice designs, but I think I like Miller the best.\n\n"
    },
    {
      "time": "10 Feb 2013 — 5:31pm",
      "content": "> but I think I like Miller the best\n\nDefinitely agree. I just think Playfair was a bit inspired by Miller. Although, in the description, Playfair doesn't mention Miller when talking about their inspiration.\n\n"
    },
    {
      "time": "10 Feb 2013 — 6:08pm",
      "content": "I think they just both come from the same place.  \nSørensen knows better than to take unfair advantage.\n\nhhp\n\n"
    },
    {
      "time": "10 Feb 2013 — 7:47pm",
      "content": "They're in related styles, both referencing historical models. Hence they have some things in common, but to my eye at least, much more not in common.\n\n"
    },
    {
      "time": "10 Feb 2013 — 9:03pm",
      "content": "> I think they just both come from the same place> They're in related styles, both referencing historical models\n\nYeah, I certainly agree with the both of you after further research. But instantly I thought it heavily resembled Miller which is why I wanted to ask for your opinions.\n\n> but to my eye at least, much more not in common\n\nYou're not alone there. I can see the differences between the two but there are similarities for obvious reasons.\n\nHopefully I didn't come across as attacking Claus or his hard work.\n\n"
    },
    {
      "time": "13 Feb 2013 — 2:53pm",
      "content": "I think Claus is better than Carter.\n\n:)\n\n"
    },
    {
      "time": "14 Feb 2013 — 2:56am",
      "content": "Hi there. I started design on what became Playfair, as my first stab at typeface design for Gerard Unger’s class when he was teaching at the Rietveld. That was back in 2008. At that time I knew nothing of Carter’s Miller, only Georgia I did know, and later found out how it was derived from the Miller design (or was it the other way around?). In any event, at that time there was no particular inspiration for my proto-design.\n\nWhere Miller is much closer to the historical ‘scotch romans’, my Playfair is much more of a conglomerate. You can read more about the sources of inspiration on my website, but I did not mention there that also Caslon was an inspiration (eg. the C). What I did do was to think that the large x-height and slightly condensed letter shapes of goût hollandais would probably also be a good idea for a typeface meant primarily for screens, and that I hadn’t seen that done before (not really counting something like ITC Garamond et al.) done in a transitional design.\n\nSo was Playfair inspired by Miller? No is the short answer. If anything, it’s present form was inspired by the original specimens of Caslon, Baskerville, Fry, Miller, and Wilson which I viewed at St. Brides.\n\n"
    },
    {
      "time": "13 Feb 2013 — 4:20pm",
      "content": "Much appreciated, Claus. Thanks for explaining in detail.\n\n"
    },
    {
      "time": "19 Feb 2013 — 8:37am",
      "content": "is it possible to obtain an OTF version via Google or otherwise? I've been able to download the TTF files (which look great!), but it said somewhere other formats should be available as well... Google's instructions were no help either:\n\n> You can also download specific source files directly from this Google Code Project website.  \n> The 'browse' interface of the Google Code Project website doesn't handle as many sub-directories as this repository uses.  \n> However, there is a work around - you can guess the folder name of the font family, and add it to the end of the browse URL, like this:  \n> [http://code.google.com/p/googlefontdirectory/source/browse/nobile](http://web.archive.org/web/20141012212336/http:/code.google.com/p/googlefontdirectory/source/browse/nobile \"http://code.google.com/p/googlefontdirectory/source/browse/nobile\")  \n> Note you can navigate to the 'src' directory on the left to find SFD, VFB and OTF source files.\n\n...my various attempts at guessing the folder name failed (»nobile« causes a 404 as well).\n\n"
    },
    {
      "time": "19 Feb 2013 — 10:49am",
      "content": "This is the correct url for the source files  \n [http://code.google.com/p/googlefontdirectory/source/browse/ofl/playfaird...](http://web.archive.org/web/20141012212336/http:/code.google.com/p/googlefontdirectory/source/browse/ofl/playfairdisplay \"http://code.google.com/p/googlefontdirectory/source/browse/ofl/playfairdisplay\")  \nand  \n [http://code.google.com/p/googlefontdirectory/source/browse/ofl/playfaird...](http://web.archive.org/web/20141012212336/http:/code.google.com/p/googlefontdirectory/source/browse/ofl/playfairdisplaysc \"http://code.google.com/p/googlefontdirectory/source/browse/ofl/playfairdisplaysc\")  \nfor the small caps\n\n"
    },
    {
      "time": "21 Feb 2013 — 6:46am",
      "content": "awesome, thanks!\n\n"
    },
    {
      "time": "21 Feb 2013 — 1:37pm",
      "content": "I've updated the text to remove that because its confusing :) I recommend using Mercurial.\n\n"
    }
  ]
}
