{
  "id": "100548",
  "title": "U8 – an early modernist, geometric sans serif",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Dear typophiles,\n\nWe recently released U8, a new typeface designed by Anton Koovit that has taken him through the Berlin subway system to research the signs used on the line 8 (U-Bahn 8 = U8 as it is called in Berlin).\n\nBelow is the slightly more formal presentation text, as well as some images.  \nAlso note that all our typefaces can now be downloaded in trial versions.  \nDon't hesitate to give them a try.\n\n![](http://web.archive.org/web/20150414005735im_/http:/www.fatype.com/fatype/U8_650/U8_1.jpg)  \n ![](http://web.archive.org/web/20150414005735im_/http:/www.fatype.com/fatype/U8_650/U8_2.jpg)  \n ![](http://web.archive.org/web/20150414005735im_/http:/www.fatype.com/fatype/U8_650/U8_4.jpg)  \n ![](http://web.archive.org/web/20150414005735im_/http:/www.fatype.com/fatype/U8_650/U8_6.jpg)  \n ![](http://web.archive.org/web/20150414005735im_/http:/www.fatype.com/fatype/U8_650/U8_8.jpg)  \n ![](http://web.archive.org/web/20150414005735im_/http:/www.fatype.com/fatype/U8_650/U8_9.jpg)\n\nWe are very pleased to present the latest addition to our growing collection of retail typefaces: U8, a new geometric sans serif, with seven weights, designed by Anton Koovit.\n\nAnton started U8 as a research project about the Berlin subway system signage and particularly the U8 line that connects the northern borough of Reinickendorf with Neukölln in the south of the city, through the Alexanderplatz junction. His goals were to restore a piece of history, research a link between the DIN and Bauhaus, and translate the lettering of individual handcrafted station signage into a formal typeface. Apart from the regular weight’s upper and lower case, glyphs such as numbers, and other weights, had to be created by the designer, allowing for his contemporary interpretation. The result is an early modernist typeface, with wider proportions than most common geometric sans, a strong character, and a clean design. Initially intended for display purposes, U8 has proven to work well in text sizes. The typeface comes with a full character set for western and eastern european languages, and a number of OpenType features such as ligatures, smaller figures for text, tabular figures and fractions. Italic styles will also be released in a few months.\n\n[http://www.fatype.com](http://web.archive.org/web/20150414005735/http:/www.fatype.com/ \"http://www.fatype.com\")\n\n",
  "author": "Fatype",
  "time": "15 Feb 2013 — 3:25am",
  "uid": "30187",
  "comments": [
    {
      "time": "15 Feb 2013 — 8:45am",
      "content": "Congrats, and good luck!\n\nBTW, I love the \"Z\" in DERZEIT.\n\nhhp\n\n"
    },
    {
      "time": "18 Feb 2013 — 1:42am",
      "content": "Thank you hrant!\n\nManuel Schibli deserves the credit for coming up with that Z shape.  \nThe previous typeface also had a very unusual Z, it became part of the identity of the magazine:  \n [http://www.typophile.com/node/87612](http://web.archive.org/web/20150414005735/http:/www.typophile.com/node/87612 \"http://www.typophile.com/node/87612\")  \n [http://typophile.com/node/76479](http://web.archive.org/web/20150414005735/http:/typophile.com/node/76479 \"http://typophile.com/node/76479\")\n\n"
    }
  ]
}
