{
  "id": "10051",
  "title": "Fontlab tutorials",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello All --   \n   \nWould anyone be able to point me in the direction of some good tutorials for fontlab. I'm most concerned with getting the most out of the drawing tools at the moment. I've seen the video tutorials on their site, and I'm not all that impressed :-s   \n   \nIt's greatly appreciated.   \n   \nL\n\n",
  "author": "<a href=\"/web/20091119090653/http://typophile.com/user/2193\" title=\"View user profile.\">dux</a>",
  "time": "<br>",
  "uid": "2193",
  "comments": [
    {
      "time": " 31.Mar.2005 11.16am",
      "content": "There is Leslie Carbarga's book, [Learn FontLab Fast](http://web.archive.org/web/20091119090653/http:/www.logofontandlettering.com/).   \n   \nHis [Logos, Fonts and Lettering Bible](http://web.archive.org/web/20091119090653/http:/www.logofontandlettering.com/) doesn't discuss FontLab much, but I did learn some good things about letter drawing from it (digital and other wise).\n\n"
    },
    {
      "time": " 31.Mar.2005 8.38pm",
      "content": "Does Learn Fontlab Fast have in depth explanations on correct encoding tables and how to output a font that works flawlessly?\n\n"
    },
    {
      "time": " 1.Apr.2005 1.49am",
      "content": "They're reasonably in-depth; Leslie and Adam Twardoch give a good, concise explanation of encodings, some good heuristics on how to build up Western fonts, and then tell you to study some existing fonts to see how they do it (which happens to be the way I work anyway, so that works out well for me).   \n   \nAs far as 'works flawlessly', I'm not sure there's anybody who knows how to do that the first time. Cabarga and Twardoch do scatter a lot of tips for how to get your fonts to work properly throughout the book, and point out a lot of common pitfalls. Fontlab's still going to be a really complicated program, no matter what, but it seems to me (as someone who's still in the evaluation phase) it has 95% of what you need to make your first few families inside FontLab.\n\n"
    },
    {
      "time": " 1.Apr.2005 2.15am",
      "content": "\\>95%   \n   \nWhat's the missing 5%?   \nHow does do it, if not in FontLab?\n\n"
    },
    {
      "time": " 1.Apr.2005 2.19am",
      "content": "I meant _Learn Fontlab Fast_ has about 95% of what you need to make fonts with Fontlab; there's inevitably going to be something tricky you're going to have to figure out yourself, ask someone about, or (yikes!) get out of the actual Fontlab manual.\n\n"
    },
    {
      "time": " 1.Apr.2005 9.16am",
      "content": "cheers for this -- I knew of leslie carbarga's books already. I have his Logos Fonts and Lettering Bible, but Learn Fontlab fast isnt on sale in the uk yet :-s   \n   \nDoes anyone know of anymore online tutorials?   \n   \ncheers fellas\n\n"
    },
    {
      "time": " 1.Apr.2005 9.38am",
      "content": "_but Learn Fontlab fast isnt on sale in the uk yet_   \n   \nWell, you could order it through Leslie's site. He says, \"Price for shipping to Europe is $9. per copy, or $33.\"\n\n"
    },
    {
      "time": " 1.Apr.2005 11.36pm",
      "content": "\"Does Learn Fontlab Fast have in depth explanations on correct encoding tables and how to output a font that works flawlessly?\"   \n   \n:\n\n"
    },
    {
      "time": " 2.Apr.2005 1.34am",
      "content": "Luke, you can order the book directly from Leslie Cabarga. He shipped it to me and it took a little to make its way to Italy.   \nIf not for other reasons, LFF (Learn Fontlab Fast) has the merit of being the first compact book giving the basics in a clear way (i.e. unlike FL own manual), although it will take a lot of trial and error to determine a good naming strategry for Opentype Fonts supposed to work smoothly in cross-platform environments.   \n   \nPersonally, I still keep generating bad OTF files from typefaces which I started originally to draw in FontStudio or Fontographer and then brought into FL, and I have not yet solved this basic problem.   \n   \nSince you seem to be interested mostly in the drawing environment, let me know which difficulties bugs you most, and I'll try to tell you have I became familiar with it.   \nKeep in mind that, before FL, I came from drawing faces in Fontstudio and I never used Fontographer if not for final files.\n\n"
    },
    {
      "time": " 4.Apr.2005 5.02pm",
      "content": "[http://groups.msn.com/fontlab](http://web.archive.org/web/20091119090653/http:/groups.msn.com/fontlab) is also a very good place to get information about various things in FontLab, although it's not a tutorial as such.   \nI made myself few pages of references about FontFamily naming and also about preparing fonts drawings in AI to use in FontLab. Although it's not fully ready I am willing to share it if someone is interested. ( [sigurarm@islenska.is](mailto:sigurarm@islenska.is))\n\n"
    }
  ]
}
