{
  "id": "100528",
  "title": "A ligature for s/he usage.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello everyone,\n\nI'm currently polishing my PhD thesis and my work involves human operators using robotic devices. I'm using a lot of \"he or she\", \"s/he\" or whatnot to obey the Political correctness police. I've summarized why I feel kind of sour about this issue on our TeX and friends Q&A site TeX.SE. The link to my question is\n\n[http://tex.stackexchange.com/questions/97429/a-ligature-for-she-he](http://web.archive.org/web/20130819215732/http:/tex.stackexchange.com/questions/97429/a-ligature-for-she-he \"http://tex.stackexchange.com/questions/97429/a-ligature-for-she-he\")\n\nIn one of the comments, I've been adviced to consult your expertise on this issue. I'm not replicating the thread here to keep this simple but I would like to ask about your opinion on how I should proceed.\n\nMy excuses at the outset for my mediocre attempts :)\n\nThank you,\n\nAnd using this opportunity, I invite you also join us and share your expertise on TeX.SE too\n\n(I hope you don't take this as a promotional statement but we have a quite friendly community and would love to have your answers about typographical issues with our documents.)\n\n",
  "author": "percusse",
  "time": "14 Feb 2013 — 6:37am",
  "uid": "208873",
  "comments": [
    {
      "time": "14 Feb 2013 — 10:20am",
      "content": "An interesting idea, although I'm not sure how practical it actually is.\n\nStill, I scribbled a few ideas.\n\n ![](http://web.archive.org/web/20130819215732im_/http:/typophile.com/files/she1_4404.png)\n\nI'm not really sure the third one works; I quite like the first, but it would really depend on how skilfully executed it is.\n\nThe second one (possibly the first as well) has some possibilities for melding the joining curve into the ascender serif. I tried detailing it a bit more:\n\n ![](http://web.archive.org/web/20130819215732im_/http:/typophile.com/files/she2_6020.png)\n\nThat said, the usual compromise nowadays seems to be alternating pronouns rather than trying to 'slash' them all the time (which can really stretch a text beyond readibility).\n\n"
    },
    {
      "time": "14 Feb 2013 — 10:25am",
      "content": "Shouldn’t it be “sh/h+e”?\n\n"
    },
    {
      "time": "14 Feb 2013 — 10:34am",
      "content": "Frode, no parentheses? ;-)\n\nNice little thing to work on. My first thought would be a linguistic solution: add a word to English that means \"a person of unspecified gender\". Maybe \"hse\". But this _is_ Typophile, so let's give a visual solution a shot! Stay tuned...\n\nBTW: [http://typophile.com/node/16343](http://web.archive.org/web/20130819215732/http:/typophile.com/node/16343 \"http://typophile.com/node/16343\")\n\nhhp\n\n"
    },
    {
      "time": "14 Feb 2013 — 10:41am",
      "content": "Since the human operator, in the context of your thesis, is a literary construct, my inclination is to give her a personality, however minimal, and assume a specific sex. Heck, you could even give her a name. This can be explained by a very short note at the beginning of the text, and thereafter you can refer to her by a sex-appropriate pronoun.\n\n"
    },
    {
      "time": "14 Feb 2013 — 10:50am",
      "content": "Pat.\n\n"
    },
    {
      "time": "14 Feb 2013 — 12:51pm",
      "content": "Thank you all for your responses, this is a great discussion. Let me clear one thing; after seeing the comments here and in TeX.SE I think I'll just go with the \"he\" and don't bother with it unless somebody slaps me in a conference or something (I don't think anybody would read it anyway but you know how it goes right ?).\n\nAnyways the starting point for me was first checking the Unicode lists and look for gender related ones. I've found out that U+26A6 and U+26A7 (⚧ and ⚦) means in some context transgender and whatnot stuff. So I thought instead of this one can also find a nice ligature, as ∛ is much better than typing out cubic root all the time or ½ instead of 1/2 etc.\n\nTrust me I'm not after a Unicode revolution, I was just curious :)\n\nAgain, thanks a lot!\n\n"
    },
    {
      "time": "14 Feb 2013 — 5:25pm",
      "content": "\\> I think I'll just go with the \"he\"\n\nThat's what I'd suggest; maybe the first time mention that both men and women operate the robotic devices.\n\nOr you could use \"he\" and \"she\" in alternate chapters, or refer to the operator as \"the operator\", although both those solutions seem awkward.\n\n"
    },
    {
      "time": "14 Feb 2013 — 7:34pm",
      "content": "The problem is the slash. Here's one solution: $he.\n\n(With an old-style dollar sign when lower case is needed.)\n\nI'd leave it alone and just pick one gender for the human operator. As for Unicode revolutions, well, why not? We already have [http://codepoints.net/U+1F4A9](http://web.archive.org/web/20130819215732/http:/codepoints.net/U+1F4A9 \"http://codepoints.net/U+1F4A9\")\n\n"
    },
    {
      "time": "14 Feb 2013 — 8:01pm",
      "content": "Sometimes you can avoid the problem by writing your sentences in a way that's gender neutral. You can find some tips here:\n\n[http://styleguide.yahoo.com/writing/be-inclusive-write-world/write-gende...](http://web.archive.org/web/20130819215732/http:/styleguide.yahoo.com/writing/be-inclusive-write-world/write-gender-neutral-copy \"http://styleguide.yahoo.com/writing/be-inclusive-write-world/write-gender-neutral-copy\")\n\n"
    },
    {
      "time": "14 Feb 2013 — 9:42pm",
      "content": "I agree with some of the comments that there are various workarounds that one can use in some contexts, but sometimes nothing but a clearly inclusive pronoun will do. For example, when I make handouts for students, I wouldn't want anyone to get a subtle message that they don't really count, and I want to implement that policy in every sentence--alternating won't do. \"They\" works sometimes, but I want to encourage good grammatical usage too .... There are a variety of proposed alternative pronouns ( [http://en.wikipedia.org/wiki/Gender-neutral\\_pronoun#Modern\\_alternatives\\_...](http://web.archive.org/web/20130819215732/http:/en.wikipedia.org/wiki/Gender-neutral_pronoun#Modern_alternatives_to_gender-neutral_pronoun \"http://en.wikipedia.org/wiki/Gender-neutral\\_pronoun#Modern\\_alternatives\\_to\\_gender-neutral\\_pronoun\")), but few of my students would have any idea what they meant. I was the person who suggested typophile.com to percusse, and as you can see, I'm very interested in what folks her come up with. Nice ideas, altsan. Love the \"$he\" proposal, cebg--anyone can use it right away. Then again, I'm not sure it will help communicate to students.\n\n"
    },
    {
      "time": "14 Feb 2013 — 11:18pm",
      "content": "There are many invented gender-neutral pronoun systems (\"xe\" and so on), and the problem with them is that they will never seem anything less than jarringly alien to a general audience. So, in practice, these are only ever used by people who identify outside the gender binary, and really only among each other.\n\nInstead, there has been a natural rise in acceptance of the singular \"they\", which has a lot more precedent in historical use than one would expect. Grammar prescriptivists may recoil, but it's how people actually talk.\n\nA good writer can skirt the problem entirely, rewriting sentences to employ \"one\", passive voice, a consistent plural, or second person, for example. With practice, it isn't very hard.\n\nBut when you come down to it, is \"he or she\" really so ugly? Is it much more unwieldy than anything else in a technical document? Or does it just seem that way because it represents something you transparently resent?\n\n"
    },
    {
      "time": "15 Feb 2013 — 3:30am",
      "content": "Sometimes one can find a word one knows works for everyone, if one knows what one means.\n\n"
    },
    {
      "time": "15 Feb 2013 — 5:29am",
      "content": "<cite>Love the \"$he\" proposal, cebg--anyone can use it right away. </cite>\n\nAh, but there is a nuance -- associating the need for money with the female gender. The twin side of the women's movement.\n\nWhen I was a boy -- this was the 1950s -- there was never any talk of having meaningful work. The talk was about the responsibility to find work to support a family. Why my father, who was a research chemist, took a job in management. He loved research, but management paid more.\n\nWithout \"meaningful,\" which led to \"enjoyable,\" I imagine we'd have fewer happy people, both men and women. On the other hand, we might have fusion power instead of 1,000,000 typefaces.\n\nBe careful what you wish for.\n\n"
    },
    {
      "time": "15 Feb 2013 — 6:20am",
      "content": "Some pro fonts include a full super/subscript alphabet. Here, Fayon Pro:\n\n ![](http://web.archive.org/web/20130819215732im_/http:/typophile.com/files/heshe_5469.png)\n\n"
    },
    {
      "time": "15 Feb 2013 — 7:56am",
      "content": "> A good writer can skirt the problem entirely, rewriting sentences to employ \"one\", passive voice, a consistent plural, or second person, for example. With practice, it isn't very hard.> But when you come down to it, is \"he or she\" really so ugly? Is it much more unwieldy than anything else in a technical document? Or does it just seem that way because it represents something you transparently resent?\n\nFor me, the answer would be: Of course not. If I resented inclusive language, I would just use \"he\". No one is policing that aspect of my writing. I do care about communication, rhythm, flow, and awkward phrasing, in addition to making all readers feel welcome. (Sometimes the right typeface helps.) I use rephrasing to avoid pronouns, I use \"she or he\", etc., but these methods involve tradeoffs, and sometimes are less than optimal. I use \"they\", but don't like it, despite historical precedent. Once in a while it's even ambiguous. Any composition of standard pronouns such as \"s/he\" or \"he or she\" is not fully inclusive, either. I agree that the novel pronouns are impractical outside of small communities, but perhaps that will change, eventually. percusse asked an interesting typographical question, in any event; it seems worth exploring possible answers.\n\nI agree that the dollar sign in \"$he\" has potential to be inappropriately suggestive, although in multiple respects; what gets subtly suggested, if anything, will depend on the reader and context. It's a simple solution despite this. The he/she fraction may be better.\n\n(my 2/100 of a $)\n\n(When $^{\\mbox{\\scriptsize he}}$/$\\_{\\mbox{\\scriptsize she}}$ wants to use \\LaTeX\\ in a gender-neutral manner, the fraction method is readily available to $^{\\mbox{\\scriptsize her}}$/$\\_{\\mbox{\\scriptsize him}}$, by the way.)\n\n"
    },
    {
      "time": "15 Feb 2013 — 8:27am",
      "content": "Well, this issue bothered me because it's written in English and I have no knowledge over it's contemporary status about these nuances. For once, I thought, it might a good idea to be a little more aware.\n\nIs it ugly to write \"he or she\"? My answer is yes. It shouldn't be a problem which pronoun I might have chosen. But it was there when I've arrived. Heh.\n\nAvoiding these pronouns seems more problematic to me because then you kind of accept the fact that this is a genuine problem which is not from my point-of-view. I sincerely don't believe this would equate man woman inbalance. For me it's just childish complain to rant about \"man on the moon\" etc. especially people know exactly what the context is. But anyway, that's another story.\n\nAlso I was thinking that this must have come up in a legal context and similar cases where every pronoun means something particularly important so \"he or she\" written consecutively n times should have pushed people to come up with a solution already but I guess not.\n\nIf you are interested, alternating he/she automatically is possible for LaTeX users via a package written by Alan Munn. You can find the link in the TeX.SE question.\n\n"
    },
    {
      "time": "15 Feb 2013 — 9:36am",
      "content": "The last picture of the Alstsan's post looks appealing also to me. But I'm a little concerned about the horizontal spacing I've manually tried a ct/st type ligature and slashed both h and s but it wasn't satisfactory either.\n\nNevertheless, thank you all for the ideas. It seems much more involved than it looks indeed.\n\n"
    },
    {
      "time": "15 Feb 2013 — 3:20pm",
      "content": "[This Wickipedia article](http://web.archive.org/web/20130819215732/http:/en.wikipedia.org/wiki/Gender-neutral_pronoun) has some interesting comments and historical sidelights.\n\n"
    },
    {
      "time": "15 Feb 2013 — 3:35pm",
      "content": "What happens when you get possessive…or objective, even? Then, you have to contend with **his/her** and **him/her** to boot. Perhaps, it would be better—or, at the very least, easier—simply to use bad grammar, and refer to **they, theirs** and **them** , even if the case is singular…\n\n"
    },
    {
      "time": "17 Feb 2013 — 8:15am",
      "content": "My feeling about this issue of what pronouns to use is that in practice, there are subtle influences on our thinking that come and go and interact with other aspects of social life. We can say that using exclusively male pronouns is meant to include women as well, and that is one tradition that has been handed down to us. In practice, though, I think that this practice subtly or not-so-subtly influences cognitive processes so as to suggest that men count, men are included, and women aren't. I think that when _I_ read \"he\", what comes to mind is a man. I think this happens to most people at least some of the time, and we don't even notice it. I am not trying to please some \"political correctness\" police. I think there is a real effect of using only male pronouns, and it helps support thought processes that views women as less able to contribute to society. I don't think that that idea--that women are less able to contribute--is objectively true. I think women and men can contribute equally, sometimes in different ways, on average, but sometimes in the same ways. In addition that, there are people who are neither clearly male or female--that's who they are, and that's OK. They should not feel less able to contribute either. Society benefits from diversity of contributions. So I'm in favor of gender-neutral pronouns, in the abstract. As it happens, there is not an ideal solution for communication of gender-neutrality at this time.\n\n"
    },
    {
      "time": "18 Feb 2013 — 5:50am",
      "content": "Incognito,\n\nI think that the London Summer Olympics—or, for that matter, Danica Patrick at Indy today—put paid to the notion of male superiority as a given…\n\n"
    },
    {
      "time": "18 Feb 2013 — 4:49am",
      "content": "For the mix: **[Shim](http://web.archive.org/web/20130819215732/http:/www.urbandictionary.com/define.php?term=shim)** is a term I learnt several years ago while working with the queer community. At the time, it was a combination of “she” and “him” and was most often used to refer to individuals who identified as [intersex](http://web.archive.org/web/20130819215732/http:/en.wikipedia.org/wiki/Intersex), transexual, or transgendered. I found it somewhat cumbersome to use in parlance _and_ print due to conflicting tense. Grammatically, you can say “She went to the store,” but you can’t say “Him went to the store,” so “Shim went to the store” is a bit clunky. Then again, this _was_ ~10 years ago, so perhaps it has a radically different usage and meaning. Maybe it’s not even “correct” anymore. a quick Google showed me a few references to it being a derogatory term, as opposed to the “politically correct and inclusive” term I was originally exposed to it as.\n\nFun facts!\n\n"
    },
    {
      "time": "18 Feb 2013 — 8:51am",
      "content": "These seem like typographical solutions to something that is not a typographical problem. \"He or she,\" if it is clumsy, is not clumsy in how it looks but rather in how it \"reads,\" and a new glyph or superscripting or a dollar sign or whatever doesn't help the sentence read more smoothly.\n\n"
    },
    {
      "time": "18 Feb 2013 — 9:12am",
      "content": "But this context is a typographic one, and I for one believe that a typographic solution (even though it's \"second class\" in this case) is much more achievable than a linguistic one, hence more of a solution.\n\nhhp\n\n"
    },
    {
      "time": "20 Feb 2013 — 8:23pm",
      "content": "It's unlikely that a typographic innovation--or a linguistic one--will solve the problem on its own. But it might. Sometimes change comes because someone just happens to come up with something that catches everyone's fancy. Who knows?\n\n"
    },
    {
      "time": "21 Feb 2013 — 10:40am",
      "content": "We just set a book -- first proof going out tomorrow -- where the author(ess) decided that \"Filipino\" was unacceptable, and each instance should be \"Filipina/o\", with the plural \"Filipinos/as\". Notice the fairness , as the feminine form is first in singular, second in plural.\n\nFine. Except the designer chose Arno to set the text in, and the kerning of the regular slash in Arno needs to be in keeping with normal usage. Slash\\_o has other uses -- as with either/or. And it's a long slash...\n\nSolution: make up a separate slash, name it slash.gender (keeps the code in the file correct), put it in a stylistic set, and kern it for Filipina/o (and Latino/a + plurals, etc.) By the time it's all said & done, 2 hours time, so charge the client $120 extra. A different font might have avoided this, but interior book designers don't usually think (that way).\n\nMy earlier $he ain't so far off, it seems. One has to pay for one's afflictions...\n\nEdit:\n\nI was working on arbitrary fractions for a font this morning, and saw/remembered another one. Someone decided to use the @ symbol for gender neutrality, as in Latin@. Except to make a passable ligature, it had to be completely redrawn. Roman and italic...\n\nLet's call everybody \"it.\"\n\n"
    },
    {
      "time": "21 Feb 2013 — 10:48am",
      "content": "Cool story. At least they were willing to pay for the treatment! BTW $60/hr is I think pretty much in the ballpark of what many \"dedicated\" (so to speak) type designers would charge.\n\n> slash.gender\n\nYou could've called it \"circumcision\". ;-)\n\nBTW it's actually not very hard to draw a glyph that could be both an \"a\" or an \"o\".\n\nhhp\n\n"
    },
    {
      "time": "21 Feb 2013 — 10:46am",
      "content": "<cite>BTW $60/hr is I think pretty much in the ballpark of what many \"dedicated\" (so to speak) type designers would charge</cite>\n\nHmm. As in, I need that font installed on my machine, working as needed, in 2 hours from **right now**? Just let me know who.\n\nEdit:\n\nActually, since Arno is an Adobe font, that wouldn't work. Only the end user can modify the font...\n\n"
    },
    {
      "time": "21 Feb 2013 — 10:51am",
      "content": "I thought you meant two hours of work. Because I don't charge clients for waiting for me to reply to their email. :-) I myself charge $80/hr for something like that. But rush charges might indeed kick in!\n\n> Only the end user can modify the font...\n\nNot exactly. The end user can hire a third party who also has a license to make a derivation. I know because I've done that to Garamond Premier, and I got my OK from David Lemon. There's actually been a discussion on Typophile about that. Maybe two.\n\nhhp\n\n"
    },
    {
      "time": "21 Feb 2013 — 11:01am",
      "content": "<cite>TW it's actually not very hard to draw a glyph that could be both an \"a\" or an \"o\".</cite>\n\nDidn't say it was hard. Except for this part: Usually, the text used to set the print edition will also be used for the ebook, where the reader selects the font (EPUB). That's the hard part -- figuring out what should be in the file.\n\nThen too, if there are scholarly pretenses for the work, there will need to be an XML file for research purposes. All characters should be correct in Unicode. We're back to U+1F4A9\n\n"
    },
    {
      "time": "21 Feb 2013 — 7:36pm",
      "content": "> , Danica Patrick at Indy today...\n\nIndy? And Daytona?\n\n!WOW!\n\nn.\n\n"
    },
    {
      "time": "22 Feb 2013 — 9:30am",
      "content": "\\> Indy? And Daytona?\n\nIt was Daytona for Danica, but incidentally there have been drivers that have competed in TWO races in one day — the Indianapolis 500 and the Coca-Cola 600 (in Charlotte, North Carolina).\n\nThe two races are organized by separate sanctioning bodies (IndyCar and NASCAR). Drivers do the Indianapolis 500 first, then fly to Charlotte for the 2nd race that same day. Three drivers have done it —&nbsp; John Andretti, Robby Gordon, and Tony Stewart.\n\nhttp://en.wikipedia.org/wiki/Double\\_Duty\\_(auto\\_racing)\n\n"
    },
    {
      "time": "27 Feb 2013 — 5:49am",
      "content": "Typographically, here is an option... Pronunciation can be left to the imagination.  \nIt's just a quick sketch, so overall width could be condensed, and serifs altered.  \nI used Rockwell because it is relatively easy to manipulate and has low contrast.\n\n![](http://web.archive.org/web/20130819215732im_/http:/johnwyffelsillustration.com/wp-content/uploads/2013/02/she-01.jpg)  \n ![](http://web.archive.org/web/20130819215732im_/http:/johnwyffelsillustration.com/wp-content/uploads/2013/02/she-02.jpg)\n\n"
    },
    {
      "time": "28 Feb 2013 — 5:34am",
      "content": "\"Typographically, here is an option...\"\n\nPractically, who would read that as an \"or\"?\n\n"
    },
    {
      "time": "28 Feb 2013 — 11:05am",
      "content": "\"Practically, who would read that as an \"or\"?\"\n\nI see your point and you're right; it doesn't really read as a he \"or\" she. It should really be read as he and/or she.\n\nSo in that sense it's more of a new glyph, which makes it both an adaptation of language and the simplification of a ligature.\n\nThe question is, would a new glyph be able to change the way we think? What other glyphs would be appropriate?\n\nOf course, it's a huge headache because there are other words... his, her etc. I know, but it seems like something that will be tackled sooner or later.\n\n"
    },
    {
      "time": "28 Feb 2013 — 11:00am",
      "content": "Since it can't be an \"and\"\\* what could it be besides an \"or\"?  \nBut there's a bigger problem: it says \"ahe\". :-/\n\n\\* Unless it's about Caster Sermenya...\n\nhhp\n\n"
    },
    {
      "time": "28 Feb 2013 — 11:21am",
      "content": "I think the point of saying \"he or she\" is essentially to include any sex, so it would make sense to use a word that isn't \"it\" (not personal) or \"they,\" and should essentially mean a singular person regardless of sex, because otherwise you'd just use either he or she (one or the other). So I think and/or is correct.\n\nIt would be easier to make a new word though, rather than invent a new glyph... easier on the typographer.\n\n"
    },
    {
      "time": "28 Feb 2013 — 11:29am",
      "content": "Sadly we need to avoid explicit learning/teaching of any new word or glyph. And since I think making a new glyph that can be deduced as being \"he or she\" is easier than making a new word that means that, the former is the way to go.\n\nhhp\n\n"
    },
    {
      "time": "28 Feb 2013 — 2:51pm",
      "content": "Various ways to combine he/she in English have been tried for many years and have never caught on. It's not because it's hard to write, it's because it's awkward when pronounced.\n\n"
    },
    {
      "time": "28 Feb 2013 — 4:44pm",
      "content": "I'm OK with pronouncing it as _shlashy_ :)\n\n"
    },
    {
      "time": "6 Mar 2013 — 12:17pm",
      "content": "My proposed solution to this now to be former problem is both linguistic and typographical conjointly.\n\nFor my typographical solution, see image \"DKheSheLigaturePictureTwoLineJPEG\", which contains a ligature of the letters S and H, with the initial of the pronoun either lower case or capitalised as upper case. Since ligatures are often discretionary, this proposal should hardly be considered unconventional. The versions shown here are based on the Libertine open source font. To Original Poster, this font should be familiar to your TeX application.\n\nMy linguistic solution, which I thought of several years ago, is to take the third person plural pronouns, which never specify gender, and convert them to neutral animate singular pronouns by changing the first phoneme from the voiced dental or interdental fricative in the plural pronoun to the unvoiced or voiceless dental or interdental fricative in the singular.\n\nBut for the third person singular subject neutral animate pronoun, in addition its vowel could be pronounced the same as for the corresponding masculine and feminine pronouns \"he\" and \"she\", rather than as in the plural pronoun \"they\", in order to emphasize that it is to be singular rather than plural.\n\nSince the phonetic distinction between the voiced and unvoiced phonemes is not large, it would be acceptable to pronounce the initial phonemes unvoiced in the pronouns that I propose in ordinary speech without sounding too strange. Possibly, the listener would not even notice without paying attention, yet would still understand. I recommend that you may test this in conversation with your friends and colleagues.\n\nThe reason that I base these third person singular neutral animate pronouns on the third person plural pronouns is that those plural pronouns are nowadays routinely used for gender-neutral contexts, even where to do so would be ungrammatical. Hence, to use my suggested pronouns instead would be in accordance with modern practice, yet would avoid being ungrammatical.\n\nNote also that the third person singular neutral animate pronoun should be conjugated with singular rather than plural verbs.\n\nThe reason that I use the unvoiced rather than voiced initial phoneme is that the initial phonemes of the singular masculine and feminine pronouns are unvoiced or voiceless.\n\nThe unvoiced dental or interdental phoneme can be represented in spelling using the Old English letter thorn þ, as I have shown in the table (see image \"DK3rdPersonPronounsTableJPEG\"). To use my linguistic solution in conjunction with the typographical approach, simply substitute that letter thorn by the ligatures that I have designed.\n\nIn order to remind the reader to pronounce the initial phoneme of the singular pronouns unvoiced rather than voiced, it would be acceptable to design the lower case ligatures in such a way that they would have descenders to resemble the letter thorn þ. But the upper case varieties should not have descenders. I have also considered italic versions of the ligatures, and these would have a greater propensity to imply the forward slant as the oblique stem between the letters S and H. The italic version should also have a tendency towards becoming graphically symmetrical, but such a glyph would in my ideal system of writing denote a different phoneme than the unvoiced dental fricative.\n\n ![](http://web.archive.org/web/20130819215732im_/http:/typophile.com/files/DKheSheLigaturePictureTwoLineJPEG_4924.jpg)\n\n ![](http://web.archive.org/web/20130819215732im_/http:/typophile.com/files/DK3rdPersonPronounsTableJPEG_3914.jpg)\n\n"
    },
    {
      "time": "8 Mar 2013 — 3:09am",
      "content": "I actually quite liked this one. I'm trying to replicate it in my thesis font now. Regarding your grammatical comments, I have to disappoint you that I can't follow the train-of-thought just due to my ignorance on the subject but our in-house linguist Alan Munn from TeX.SE also enjoyed the ligatures and commented as below. I'm including it here just to be able to reflect some thoughts on your proposition since I'm not able to provide.\n\nThank you very much.\n\nAlan Munn :\n\n_The ligatures are cute, although the lowercase one looks too much like he. The use of [θ] for the pronunciation will violate a deep lexical generalization about English: the voiced interdental fricative is only found in function words and the voiceless one in non-function words. There's likely a historical explanation for this, since the voiced and voiceless versions used to be allophones of a single phoneme. (I.e. they were two pronunciations of the same mental sound)._\n\n[http://chat.stackexchange.com/transcript/message/8409319#8409319](http://web.archive.org/web/20130819215732/http:/chat.stackexchange.com/transcript/message/8409319#8409319 \"http://chat.stackexchange.com/transcript/message/8409319#8409319\")\n\n"
    },
    {
      "time": "9 Mar 2013 — 9:54am",
      "content": "Your appreciation alias percusse gladdens me. You are welcome to choose to show us a snippet of your result or progress.\n\nI may be responsible if not all of what I wrote was accessible to everyone. In a future post I may illustrate by further examples some of the points that I was explaining. But please forgive me if some technicality will be necessary for the sake of brevity in this post. I have much more to say, but which I omit for the mean time.\n\nI also liked to hear of the astute observations of Alan Munn that you sent us. I remark on his impressions forthwith.\n\nThe same impression in the lowercase ligature has occurred to me. The lowercase ligature could be made to look less like the masculine and more like the feminine by extending the swash-like curve for the \"s\" leftwards from the stem, and perhaps slightly upwards without gaining the full height of an ascender, as, I tell you, it appeared in my original hand-drawn design sketches. There is leeway for variation, and font designers or typographers could adjust the proportions to preference. Whilst effort should be made to satisfy feminists, care should be taken to avoid unintentional connotations. Overt emphasis of the female gender to the exclusion of the male should be avoided as that would defeat the whole purpose of the ligature, which is to be gender-neutral or mutually inclusive. I hasten to add that no particular known identifiable individual person should be discussed by anyone else using a neutral pronoun, whether inanimate or animate.\n\nAlthough it may be true that all instances of an initial voiced dental or interdental fricative in the English language occur in \"function words\", this does not imply that all instances of initial unvoiced dental or interdental fricatives must by law occur in non-function words. According to the ever-trustworthy Wikipedia, ehem,\n\n[http://en.wikipedia.org/wiki/Function\\_word](http://web.archive.org/web/20130819215732/http:/en.wikipedia.org/wiki/Function_word \"http://en.wikipedia.org/wiki/Function\\_word\")  \n [http://en.wikipedia.org/wiki/Function\\_word](http://web.archive.org/web/20130819215732/http:/en.wikipedia.org/wiki/Function_word)  \n\"The following is a list of the kind of words considered to be function words:\n\narticles — the and a. In some inflected languages, the articles may take on the case of the declension of the following noun.  \npronouns — inflected in English, as he — him, she — her, etc.  \nadpositions — uninflected in English  \nconjunctions — uninflected in English  \nauxiliary verbs — forming part of the conjugation (pattern of the tenses of main verbs), always inflected  \ninterjections — sometimes called \"filled pauses\", uninflected  \nparticles — convey the attitude of the speaker and are uninflected, as if, then, well, however, thus, etc.  \nexpletives — take the place of sentences, among other functions.  \npro-sentences — yes, okay, etc.\"\n\nSo if adpositions are function words, then presumably prepositions, which belong to the set of adpositions, are function words. The word \"through\" is a preposition, but it is pronounced with an initial unvoiced rather than voiced dental or interdental fricative. Perhaps, however, one could disregard that as an anomaly because the initial phoneme is followed by a rhotic one, even though a rhotic phoneme would be voiced by default (although I would sometimes pronounce the word \"rhotic\" and certain other words of Greek etymology with a voiceless r, such as the letter \"rho\" itself in order to distinguish it from the otherwise homophonic words \"row\" and \"roe\"). But this is hardly tenable.\n\nMany phonemes have arisen historically by differentiation of allophones. This can happen by dialectal variation (such as the pronunciation of the initial phoneme of the words \"which\" and \"whether\" as unvoiced in contrast to voiced in their otherwise homophonic words \"witch\" and \"weather\". The pronunciation of unvoiced \"wh\" can still be heard today sometimes where I live, even though it would violate a rule that sonorant phonemes in English can no longer be unvoiced unless by allophonic variation); importation of foreign words (such as the French word \"genre\" into English); grammatical inflexion (such as generation of verbs from nouns by conversion of final unvoiced dental fricatives to their voiced counterparts, as in the verb \"breathe\", whose final phoneme is voiced, from the noun \"breath\", whose final phoneme is unvoiced. An example in which there is no other phonetic change is with the verb \"loathe\", pronounced with a voiced final, and the adjective \"loath\", with unvoiced codal phoneme); or by gradual change. For example, there is a tendency in historical linguistics for lenition by increasing sonority of unvoiced to voiced, especially intervocalically, that is, medially between two vowel phonemes. An allophonic pronunciation should be predictable from the context and is not contrastive, such that it is not responsible for the sole phonetic difference between any words or morphemes that differ in meaning. But once they become true phonemes, their pronunciations cannot necessarily be predicted from any prescriptive grammatical rule, though they would still of course be subject to allophonic mutation in accordance with the phonological context, such as assimilation with the voicing or lack of voice of adjacent phonemes, unless they are themselves the trend-setters.\n\nWe should know that the unvoiced and voiced dental fricatives are phonemes in English because the unrelated words \"thy\" and \"thigh\" of different meaning differ in sound solely by their initial dental fricatives. You could argue that \"thy\" is a function word, but it might be that the dental fricatives are voiced in function words because they are old and have been used frequently such that they have become voiced by lenition.\n\nExcuse me if I do not know the full textual evidence, but as for the historical linguistic explanation, I would have thought that it can be debated whether the voiced and unvoiced versions were allophones rather than separate phonemes immediately before the introduction of our current orthography. We have no audio recordings of speech from hundreds of years ago. Let me argue by a hypothetical scenario as follows. If we today were to begin to re-introduce the Old English letters thorn þ and eth ð, and use them for respectively the unvoiced and voiced dental fricatives, as they used to be used, and if we further suppose that in some distant time in the future all audio recordings that we still have in our present time should be lost or destroyed, such as by planned obsolescence if your imagination calls for a reason, then it would seem reasonable that people of the future would infer from the textual evidence that would remain with them that what to them would be written as two separate phonemes used to be written as though they were a single phoneme pronounced the same way, by the single digraph, or two letters in combination, \"th\". Therefore, the people of the future would deduce that the two phonemes must have arisen by differentiation of two allophones of the same phoneme. The same kind of argument can be extended to our past. Regard much of this paragraph as somewhat tongue-in-cheek.\n\nWhat I am saying is to ponder whether it is possible that there were at some time in the past two phonemes, one voiced and the other unvoiced, but that the phonemic distinction was forgotten or lost to some extent because of the removal of the Old English letters thorn and eth by the Normans, who seemed to favour only the Latin alphabet (They also removed the two other non-Latin letters wynn and yogh that were useful). Consider the second verse stanza of the poem Beowulf. How else would you explain \"syððan ærest wearð\"; \"oðþæt\"; and \"Þæt wæs god cyning\" and all of the other examples?\n\nIn summary, phonemes can arise from allophones, but they can also merge and be lost. The process happens both ways in the evolution of language, which is not constrained to obey any etymological rationalisation and theoretical categorisation. The deep lexical relationship that you raise may have been caused orthographically by Norman vandalism to the Old English alphabet.\n\n"
    },
    {
      "time": "11 Mar 2013 — 5:55am",
      "content": "Here are two more versions of the lowercase ligature with more emphasis on the feminine (See picture \"DKheSheLigaturePicture1JPEG\").\n\n ![](http://web.archive.org/web/20130819215732im_/http:/typophile.com/files/DKheSheLigaturePicture1JPEG_4634.jpg)\n\n"
    },
    {
      "time": "11 Mar 2013 — 6:33am",
      "content": "Great direction, just the right stem of the \"h\" needs to look more like part of the \"s\", otherwise it's a \"ch\".\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2013 — 6:38am",
      "content": "Yes hrant, that was what I was getting at when I wrote \"The italic version should also have a tendency towards becoming graphically symmetrical\" in the post of 6 Mar 2013 — 12:17pm. I guess you must mean removal of the serif of the right half-stem of the \"h\", and replacement with a curl.\n\n"
    },
    {
      "time": "11 Mar 2013 — 7:10am",
      "content": "Something like that - just be careful not to make it end up looking like a really happy \"s\" on a chaise longue... ;-)\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2013 — 7:28am",
      "content": "Or a Cherokee letter \"So\".\n\nHere is an example of where it can go wrong and look too much like a \"ch\" (See \"DKheSheChLigaturePicture1JPEG\").\n\n ![](http://web.archive.org/web/20130819215732im_/http:/typophile.com/files/DKheSheChLigaturePicture1JPEG_5378.jpg)\n\n"
    },
    {
      "time": "11 Mar 2013 — 2:55pm",
      "content": "Very interesting read. dudefellow's ligature I think is an elegant approach, and an interesting idea. I just played around a bit to try two ideas to make the S more prominent with less of a \"c\" look.\n\nFor what it's worth, here are two slightly different ideas. The compressed \"sh\" one just has some of the left serif of the h removed to make it work. The sideways S one, I imagine, would work better if it was built from scratch, but the mockup was just to visualize using the bottom of the S as the shoulder/leg of the \"h\".\n\nSet in Adobe Caslon Pro Regular\n\n ![](http://web.archive.org/web/20130819215732im_/http:/typophile.com/files/he-she_6664.jpg)\n\n"
    },
    {
      "time": "11 Mar 2013 — 3:25pm",
      "content": "Tristan, I like your ligature on the left. Maybe it will be easier to read and understand, since it does not seem to have any suggestion of a letter \"c\".\n\n"
    }
  ]
}
