{
  "id": "100587",
  "title": "Tarent Medium / Font Critique",
  "forum": "Sans Serif",
  "tags": [
    "Akzidenz",
    "bold sans serif",
    "futura",
    "geometric",
    "kerning",
    "Sans Serif",
    "sans-serif",
    "spacing",
    "typedesign"
  ],
  "content": "Hi,\n\nfor developing my first typeface I wanted to create a geometric typeface that posesses the advantages of such fonts but is more ‘robust', especially in the caps, than for example Futura.\n\n![Glyphs](http://web.archive.org/web/20130912085300im_/http:/content.screencast.com/users/aTremulant/folders/Jing/media/0f59a587-7655-4166-be69-64a3bba9b425/00000633.png)\n\nCurrently I am working on spacing my first complete draft. I don't want to presume full capability for continous text with this font-style, but a test to see if the glyphs relate nicely to each other was more of a pleasant surprise than I thought:\n\n![Continous Text](http://web.archive.org/web/20130912085300im_/http:/content.screencast.com/users/aTremulant/folders/Jing/media/d7332b63-df45-4169-ad08-16dfdc6d9f96/00000634.png)\n\n![Example](http://web.archive.org/web/20130912085300im_/http:/content.screencast.com/users/aTremulant/folders/Jing/media/13f17efc-9287-47e8-84e0-007ae83def88/00000632.png)\n\nI know that especially the upper-case S, K, W and Y and lower-case s and y are still very shaky. I would really appreciate overall and specific critique.\n\nThanks,  \nJesse\n\nP.S.: I will be working on a Book-style too.\n\n",
  "author": "jbenjamin",
  "time": "16 Feb 2013 — 7:17am",
  "uid": "175515",
  "comments": [
    {
      "time": "18 Feb 2013 — 9:39am",
      "content": "I allways like this kind of fonts. I can write you few of my observations:  \n- /e make the upper part tighter and the lower part wider.  \n- /s middle part should be the widest from the whole body  \n- /k and /K should be realted in line angles  \n- /o and /O is not good idea to make it a perfect circle (I can't see if you made them like that or not from this previews). In your case, they can be more wider at top and bottom, to make it opticaly stable.  \n- /S is falling to left  \n- /2, /3, /5, /? should have same stroke ends as C  \n- the angle of /4 is weird, try it like 7\n\nLooking forward to see the changes. It is a fact, that in this area is really tough to make something new.  \nJan\n\n"
    },
    {
      "time": "18 Feb 2013 — 11:05am",
      "content": "Thanks for the quick input! /o and /O are not actual perfect circles, but the difference to one might be too subtle:\n\n[http://screencast.com/t/jfMLOcVBs](http://web.archive.org/web/20130912085300/http:/screencast.com/t/jfMLOcVBs \"http://screencast.com/t/jfMLOcVBs\")\n\nDo you have a suggestion how to avoid the ‘falling’ to the left of /S? I heard that the middle axis of the two circles used to make it should be aligned...\n\nAnd I know that introducing something new to geometric fonts is hard, basically what I am lookign for is more sturdiness and less ‘all-over-place’-feeling then Neutra or Futura. Citing those two is not supposed to sound as stuck-up as it reads :)\n\nI will work on the changes and keep you and everyone else that is interested posted.\n\n"
    },
    {
      "time": "18 Feb 2013 — 2:41pm",
      "content": "I think you will have to \"push harder\" with the /o. Here at [/O comparision](http://web.archive.org/web/20130912085300/http:/jancharvat.cz/temp/o.png) there are three /o - the black one is yours, the red one is Futura, the green one is Avantgarde and the blue circle is prefect circle. So you can see even the most geometrical fonts don't have /o as a perfect circle. The most geometrical one - Avantgarde has slightly more mass to the sides. Your /o is nearly perfect circle - it has 1px difference on 400px scale. So I would push bit more to at least 5-10px each side. But not by moving the side nodes more outside, only by moving the bottom and upper tangents more out.\n\n/S I find nearly most difficult letter to design. It is so different from others. I think the bottom part is ok, so I would move the upper part more to the right. It's nearly at same vertical line with left bottom stroke , but at right side there is big space. On [Futura /S](http://web.archive.org/web/20130912085300/http:/origin.myfonts.net/116/fs/u/7a/c4a9a9f910ac6d7e4110e433fab64f.gif) you can see the upper part is somehow aligned to middle, while having small space on both sides.\n\nJan\n\n"
    },
    {
      "time": "25 Feb 2013 — 4:26am",
      "content": "Hm, Typophile seems to have thought my previous answer was spam. Well here it goes.\n\nSo the updated /O and /o:\n\n[http://screencast.com/t/Y0r9VpoVIp](http://web.archive.org/web/20130912085300/http:/screencast.com/t/Y0r9VpoVIp \"http://screencast.com/t/Y0r9VpoVIp\")\n\nThe altered /4, which I think is a better approach:\n\n[http://screencast.com/t/O9fl6r4TzgJM](http://web.archive.org/web/20130912085300/http:/screencast.com/t/O9fl6r4TzgJM \"http://screencast.com/t/O9fl6r4TzgJM\")\n\nAnd /S and /s:\n\n[http://screencast.com/t/zjoECfLYG](http://web.archive.org/web/20130912085300/http:/screencast.com/t/zjoECfLYG \"http://screencast.com/t/zjoECfLYG\")\n\nWith the latter, I feel it's getting better, but I'm not there yet.\n\nI am also working on a Book weights at the moment, and wanted to know if you guys had any suggestions on the appropriate conversion between my bold Medium and light Book, or between any two weights for that matter:\n\n[http://screencast.com/t/l1fJ2W7hx](http://web.archive.org/web/20130912085300/http:/screencast.com/t/l1fJ2W7hx \"http://screencast.com/t/l1fJ2W7hx\")\n\n[http://screencast.com/t/H8EEc9hO9EFn](http://web.archive.org/web/20130912085300/http:/screencast.com/t/H8EEc9hO9EFn \"http://screencast.com/t/H8EEc9hO9EFn\")\n\n[http://screencast.com/t/Hv4dV9UehAp](http://web.archive.org/web/20130912085300/http:/screencast.com/t/Hv4dV9UehAp \"http://screencast.com/t/Hv4dV9UehAp\")\n\nMy Medium weight has a stem-width of 100pt, my Book has 70pt. I'm especially interested in how curves and their positioning changes, like with the 2 /R.\n\nThanks for your help, and sorry about all the links.\n\nJesse\n\n"
    },
    {
      "time": "4 Mar 2013 — 9:13am",
      "content": "New glyphs and texts! Reworked /S from scratch, already feels a lot better. Texts already feel pretty good, or on the right way at least.\n\n ![](http://web.archive.org/web/20130912085300im_/http:/typophile.com/files/tarent_glyphs_4783.jpg)\n\n ![](http://web.archive.org/web/20130912085300im_/http:/typophile.com/files/tarent_text_3579.jpg)\n\n ![](http://web.archive.org/web/20130912085300im_/http:/typophile.com/files/tarent_titling_3838.jpg)\n\nI would really appreciate further critique.\n\nThanks  \nJesse\n\n"
    },
    {
      "time": "5 Mar 2013 — 10:51pm",
      "content": "I think the new versions of O, Q and o have gone too far in trying not to be perfectly circular, and now look as though they're veering towards superellipses. You want them to look like perfect circles, but perfect circles don't 'look' like perfect circles! S is leaning backwards slightly, to my eyes.\n\n"
    },
    {
      "time": "7 Mar 2013 — 4:33am",
      "content": "I agree that I might have gone a bit too far with /O, /o and /Q; I am actually glad to go back to more rounded shapes. If you have seen the previous version of /S, I think you'd agree with me that this is a better approach, but I will alter the upper bow a bit. One can definitely tell that it leans backward when it's at the beginning of a word or standing on its own.\n\nWhat does everybody think of /W and /4? Any idea for a more regular version of /Ü? And lastly, what about the conversion to a lighter weight?\n\nThank you so much  \nJesse\n\n"
    },
    {
      "time": "18 Mar 2013 — 8:35am",
      "content": "Glyph update! I am fairly satisfied with the new direction of /S and the cap-version of /ß...\n\n![Glyphs](http://web.archive.org/web/20130912085300im_/http:/content.screencast.com/users/aTremulant/folders/Jing/media/5682543e-f577-4010-b854-0db2d092f538/00000711.png)\n\n![Text](http://web.archive.org/web/20130912085300im_/http:/content.screencast.com/users/aTremulant/folders/Jing/media/90a3e1b7-e8ce-48de-a872-b09cba714090/00000712.png)\n\nI am planning to use this font in a major (for me at least) job next month, so let me know what you think.\n\nThanks  \nJesse\n\n"
    },
    {
      "time": "12 Apr 2013 — 12:41pm",
      "content": "I'm a bit late but :  \nthe e still weird to me, probably because of his short tail (or spur or terminal, I don't know how to say it in english)  \nThe W is really black in the middle, you just have to enlight it.  \nThe middle stroke of the N is too black.  \nThe S is too pinch in the top of the spine... You just have to open it a little, make it more \"smooth\"...  \nNice font anyway with some great glyphs, and the font is already good, original and clean.\n\nBest regards\n\n"
    },
    {
      "time": "13 Apr 2013 — 6:49am",
      "content": "Hey Matthieu,\n\nthanks for the input! I did apply some changes to /W, /S and /N, plus a bunch of new glyphs. I have kept the /e, though I understand the critique I am fond of it for some reason...see the second image, it feels included and adds some more ›flow‹ to my static font.\n\n ![](http://web.archive.org/web/20130912085300im_/http:/typophile.com/files/tarent_glyphs_4641.png)\n  \n\n ![](http://web.archive.org/web/20130912085300im_/http:/typophile.com/files/tarent_una_histora_4732.png)\n\nThe ›major‹ release has indeed passed, but I think it was mostly ready to print as it had been, since it was mostly used for captions and small credits so I could do a lot manually.\n\n ![](http://web.archive.org/web/20130912085300im_/http:/typophile.com/files/tarent_release_1_5675.png)\n  \n\n ![](http://web.archive.org/web/20130912085300im_/http:/typophile.com/files/tarent_release_2_5138.png)\n\nWould appreciate further critique! And I really love the serifs on your blog Matthieu.\n\nThanks  \nJesse\n\n"
    },
    {
      "time": "14 Apr 2013 — 4:15am",
      "content": "Really cool, I unterstand for the e (it's better in the text than in the specimen anyway). The hyphen and the emdash seems to be really above the middle x line... (why not with all caps but with lowercase it's too much maybe) I love the braces, nice ampersand and at ! The S still pinchy but it's much better.  \nMy blog is really old now, I did a lot of stuffs since then (a lot of fonts, much better). I'm working on a website on my own... If you're interested in, I send you some sample of new fonts.  \nHave a nice week !\n\n"
    },
    {
      "time": "15 Apr 2013 — 4:43am",
      "content": "For the hyphen and emdash I sort of followed Hoefler Text, where it's a nice uncommon feature I think...but I'm not dead-set on it, so I'll think about it.\n\nI am planning to release the font sometime in May, with two (pulp) short stories that will work as the specimens and a poster. Would you have any advice on licensing? I would like to just do like a paypal thing on my website, but I have no idea about the legal ramifications...\n\nAnd yes, I'd absolutely like to check out your fonts, the only serifs I regularly use are Hoefler and Caslon, the rest is mostly boring. Don't know if the forum considers this spam but email me here: [hi@jesse-benjamin.com](mailto:hi@jesse-benjamin.com)\n\n"
    },
    {
      "time": "12 Aug 2013 — 2:33pm",
      "content": "very nice! is that eszett common? do German readers like it?\n\n"
    }
  ]
}
