{
  "id": "100563",
  "title": "Need help designing my first font",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello all,  \nI'm a university student studying graphic design. A couple years ago I got the typography bug and now it's probably a full blown obsession. As a directed study for school, I've selected to create my own typeface. My plan is to create roman lower and upper and italics by the end of the semester. One of the problems has been finding a process getting good feedback because of the lack of people experienced people around me. So I've come here to hopefully learn and get good critique.\n\nMy current plan is to do all the letters on paper with pencil, then ink, which will be scanned in to take to a yet undecided program and fixed. Is there a standard program that would allow me to do kerning tables and such? I've looked into FontLab and Font Forge, but haven't used anything yet.\n\nSecondly, I would like to ask for some feedback on my preliminary letters. I've attached a couple images of my first forms. The plan is to create a contemporary serif, with a little humanist feel. I've been experimenting also with a very high x-height and some features that would be interesting at display size but disappear as body text. Please don't hold back!\n\n ![](http://web.archive.org/web/20130819161659im_/http:/typophile.com/files/img002_4296.jpg)\n  \n\n ![](http://web.archive.org/web/20130819161659im_/http:/typophile.com/files/img004_3525.jpg)\n  \n\n ![](http://web.archive.org/web/20130819161659im_/http:/typophile.com/files/img008_6220.jpg)\n  \n\n ![](http://web.archive.org/web/20130819161659im_/http:/typophile.com/files/img006_5928.jpg)\n  \n\n ![](http://web.archive.org/web/20130819161659im_/http:/typophile.com/files/img010_4039.jpg)\n  \n\n ![](http://web.archive.org/web/20130819161659im_/http:/typophile.com/files/img005_4305.jpg)\n\n",
  "author": "LukeP",
  "time": "15 Feb 2013 — 10:40am",
  "uid": "208334",
  "comments": [
    {
      "time": "15 Feb 2013 — 11:46am",
      "content": "{Duplicate}\n\n"
    },
    {
      "time": "15 Feb 2013 — 11:45am",
      "content": "Good luck! And welcome to the dark side... :-)\n\nI think your basic drawings above are pretty sound (except that last \"o\" :-). One thing you might do is look at the Yellow font by Jürgen Weltin.\n\nhhp\n\n"
    },
    {
      "time": "18 Feb 2013 — 12:24pm",
      "content": "Let's just say I'm a type design enthusiast, rather than a type designer. So keep that in mind when reading this.\n\nI attended a week long type design workshop recently. What I learned is that although I love handwork, and meticulously drawing and inking each letterform at large sizes -- it might not be the best workflow to get to a coherent typeface design. Why? Because there's a tendency to make each glyph look very nice, but that workflow doesn't allow you to see how the glyphs interact with each other at a more regular size, be it 12 pixels or 9 points.\n\nI found that sketching on cheap paper was a way to quickly test out shapes. If a shape looks OK, then quickly redraw it in your font editing software. If you redraw it without bothering to scan your sketch you might find that you quickly become better with bezier curves, and that you can iterate at a faster pace.\n\nThis also means you don't have to spend time drawing every glyph perfectly on a larger sheet of paper. You just need to start with some base glyphs, space them as well as you can, and then print them out to see if they are or are not working together. If you post your tests to typophile you will get some good feedback. As it is, these large letterforms you've posted -- they're not a typeface. They're just nice drawings.\n\nSearch this forum for which glyphs to start with. It will be something like:\n\nLowercase:  \nStart with \"o\" an \"n\" then do print tests of \"onononon\" and adjust/correct spacing.  \nFill in the rest of the glyphs in the word \"adhesion.\" This contains most of the DNA for the rest of the glyphs.\n\nUppercase:  \nHAQR (as, similarly, these will contain alot of DNA for the other caps)\n\nOnce you have a few glyphs you can use this tool to generate words:  \n [http://www.adhesiontext.com/](http://web.archive.org/web/20130819161659/http:/www.adhesiontext.com/ \"http://www.adhesiontext.com/\")\n\nIn this way, you are prototyping a typeface design, rather than drawing letters on paper. This was a revelation to me, as I admit that I tend to get too precious with my drawings, which is a barrier to rapid prototyping and fast improvement.\n\nSoftware:  \nIf you decide to buy Glyphs do not buy it from the Apple App store. I implore you! Don't make the mistake I did. Apple is extremely slow at approving software updates so those of us who stupidly purchased from the app store are stuck with older versions (my version doesn't work well on OS 10.6.8).\n\nEveryone has a different workflow and this one may or may not work for you!\n\n"
    },
    {
      "time": "20 Feb 2013 — 8:58am",
      "content": "Todd, great advice from a self-described beginner! :-)\n\nBTW: [http://typophile.com/node/100708](http://web.archive.org/web/20130819161659/http:/typophile.com/node/100708 \"http://typophile.com/node/100708\")\n\nhhp\n\n"
    },
    {
      "time": "21 Feb 2013 — 6:09pm",
      "content": "I should mention that the workshop I was at was put on by Dave Crossland, Eben Sorkin, and Octavio Pardo.\n\nThere's another one coming to Portland (although it's shorter). I give it a big \"recommend.\"\n\n[http://www.typophile.com/node/100112](http://web.archive.org/web/20130819161659/http:/www.typophile.com/node/100112 \"http://www.typophile.com/node/100112\")\n\n"
    }
  ]
}
