{
  "id": "100530",
  "title": "Lui les Hébreux moi Pharaon - a chronotext experiment mixing spoken voice and written text",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "An invitation to run my latest creation for Mac and PC: [http://chronotext.org/chanson](http://web.archive.org/web/20131016103221/http:/chronotext.org/chanson)\n\nBased on a French poem by Guillaume Apollinaire, it is among other things an exercise in readability:\n\nHow can the spoken and written versions of the same text interact together?\n\nFeedback is welcome,  \nAriel\n\n| Attachment | Size |\n| --- | --- |\n| [chanson\\_600\\_1.png](http://web.archive.org/web/20131016103221/http:/typophile.com/files/chanson_600_1.png) | 70.31 KB |\n| [chanson\\_600\\_4.png](http://web.archive.org/web/20131016103221/http:/typophile.com/files/chanson_600_4.png) | 60.68 KB |\n\n",
  "author": "arielm",
  "time": "14 Feb 2013 — 7:02am",
  "uid": "40421",
  "comments": [
    {
      "time": "15 Feb 2013 — 9:01am",
      "content": "Very cool stuff. You should contact SoTA about showing it at the TypeCon conference in August.\n\nhhp\n\n"
    },
    {
      "time": "15 Feb 2013 — 12:35pm",
      "content": "Thanks for the feedback and suggestion!\n\n"
    },
    {
      "time": "15 Feb 2013 — 12:46pm",
      "content": "Very clever, and the 3D imagery is spectacular, but I ﬁnd the effect of parallel visual-spoken text to be trite (fol-low the boun-cing ball) and annoying, like subtitles in the same language or teletext captioning if you don’t require it.\n\nIt’s difﬁcult to pay attention to both visual and spoken text at the same time. Hit over the head with redundancy—a dilemma.\n\nIf one or the other or both were at the threshold of comprehension, then they would each have a raison d’être.\n\nI would be quite happy with the pacing provided by the music, as the text unfolds, and no spoken verse.\n\n"
    },
    {
      "time": "15 Feb 2013 — 5:43pm",
      "content": "Hi Nick,\n\nI'm aware of the \"follow the bouncing ball\" problematic. I usually don't appreciate much the usual kinetic typography videos for the same reasons.\n\nSo yes, you definitely put the finger on the kitschy side of this work. Hopefully, I hope the work will be appreciated for its \"other qualities\"...\n\nLet's take in count that this is experimental. By definition, the goal is to explore new directions and eventually make some interesting discoveries.\n\nOne aspect that I wanted to explore is the mapping of a recorded speech into some visual representation:\n\nFor that purpose, I used the concept of bricks: those are are either empty (corresponding to music or a pause in the speech) or filled with a word. Basically, the whole spatial layout is a direct representation of the soundtrack...\n\nEach of the 4 episodes is proposing a different spatial layout and a different unfolding of the intersection between the spoken and the written.\n\nI don't know of any other work exploring this direction (the artist Gary Hill have worked in the 80's on speech and visual representation, but without text rendering...)\n\nAnyway, I feel that the potential is huge, and that I have only scratched to top of an iceberg...\n\nA last parenthese: How did the idea of using bricks originated?\n\nSome strophes in the poem of Apollinaire's are metaphors based on the Bible: the narrator is like Pharaoh, pursuing his love, who is like the Hebrews...)\n\nThe passage in the Bible treating of this episode is known as the Song of the Sea. Quoting Wikipedia:\n\n<cite>It is one of only two sections of the Sefer Torah that is written with a different layout to the normal simple columns. The layout is similar to bricks in a wall: the alternating words are supposed to represent the two walls of the split sea with Israel walking down the middle.</cite>\n\nI find it fascinating that a couple of thousand years ago, scribes already used some kind of metaphorical text layout (which is what I'm trying to achieve in my work for a decade...)\n\n"
    }
  ]
}
