{
  "id": "100524",
  "title": "Editing FL's metric's sample text string???",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello there!\n\nIs there any way in which I could edit the text string samples that appear in the metrics window when selecting a glyph??  \nThis is the text string I'm talking about:\n\n ![](http://web.archive.org/web/20150427113058im_/http:/typophile.com/files/Screen%20Shot%202013-02-14%20at%204_4456.47.22%20PM.png)\n\nThanks!\n\n",
  "author": "Graphirus",
  "time": "14 Feb 2013 — 4:49am",
  "uid": "206220",
  "comments": [
    {
      "time": "14 Feb 2013 — 6:31am",
      "content": "Switch to kerning mode.\n\n"
    },
    {
      "time": "14 Feb 2013 — 7:13am",
      "content": "Switch? What for??\n\nI think I wasn't understood... in my screen capture the ampersands stand between 4 different text strings:\n\nHOH\\*HOH  \nHHH\\*HHH  \nOOO\\*ooo  \nXHX\\*xox\n\nIn the FL metrics window, whenever you select a glyph from the Kerning or Metrics Table, it will appear between those 4 text strings in the position where the \\* is.\n\nMy question is, how can I edit those text strings, even add a few ones? For example one line with cyrillic characters?\n\n"
    },
    {
      "time": "14 Feb 2013 — 1:17pm",
      "content": "You switch to kerning mode to reveal the text preview box. Either type in your new text, or click on the Options button to change or add options for the preview box, or to point it to an external text file that contains your text strings. Then you can select your appropriate base string and drag glyphs from the Font window and drop them into the Metrics window where you want them to appear.\n\n"
    },
    {
      "time": "14 Feb 2013 — 1:35pm",
      "content": "From the manual:\n\n> You can customize the context by editing the Metrics.txt file located in the Application user data/Data folder.\n\nAlthough it doesn't go into any detail on the syntax used in the file, or how to add new contexts for different languages. From what I can tell, the actual strings are composed using glyph names preceded by a slash, with the @ character representing the selected glyph, and \\n (_backslash_ n) for a newline.\n\n"
    },
    {
      "time": "14 Feb 2013 — 1:38pm",
      "content": "Adam provided some useful info in these previous threads:  \n [http://typophile.com/node/52204](http://web.archive.org/web/20150427113058/http:/typophile.com/node/52204 \"http://typophile.com/node/52204\")  \n [http://typophile.com/node/58279](http://web.archive.org/web/20150427113058/http:/typophile.com/node/58279 \"http://typophile.com/node/58279\")\n\n"
    },
    {
      "time": "14 Feb 2013 — 1:53pm",
      "content": "gargoyle got it right!! Thanks a lot for the provided links! I will read them as soon as I get some free time )\n\n"
    }
  ]
}
