{
  "id": "100568",
  "title": "Anyone here work with AutoCAD?",
  "forum": "General Discussions",
  "tags": [
    "AutoCAD",
    "General Discussions"
  ],
  "content": "Ever notice how it is not an application to set type with? There is apparently, a complete absence of kerning - Glyphs are set side bearing to side bearing. Amazing.\n\n",
  "author": "russellm",
  "time": "15 Feb 2013 — 1:00pm",
  "uid": "13076",
  "comments": [
    {
      "time": "15 Feb 2013 — 7:04pm",
      "content": "I haven't used AutoCAD in a while, but as far as the vector drawing is concerned there is a lot of things I like. As a lefty it was easier for me to use their shortcuts system, with the striking of one or two keys then pressing the spacebar, unlike the right-handed dominant Adobe and Fontlab system.\n\nI also think the way AutoCAD uses construction lines and such could be a benefit in Fontlab. Using tools like Line, Offset, Mirror, Fillet, Trim, Extend...despite the simple spline tool (and no Em measure) I bet you could knock out a font pretty quickly with AutoCAD.\n\n"
    },
    {
      "time": "15 Feb 2013 — 9:59pm",
      "content": "My reason for asking here is that I happen to be reviewing a set of consultant's drawings with a number number of large dimensional-letter architectural signs - Part of a project going out for tender. The sign layouts were prepared in AutoCAD and the kerning is terrible. I thought, OK, no sweat -- Just report back that someone \"turned the kerning off\". Fix it and we're good to go. Easy, right? I looked a little deeper.\n\nUsually the graphic design work is done with graphic design tools and brought into construction CAD drawings later. But it appears it was done in AutoCAD, and it Appears that AutoCAD does not read kerning tables. I could be wrong, but I have AutoCAD on my work computer. I spent some time trying to get a decent looking string of text and it was not happening. there is no mechanism (that I could find) to make it happen.\n\nI used to use an AutoCAD based program many years ago to run vinyl cutting plotters and a CAD-CAM router -- Back when it was DOS based. They made it 'user friendly' and I was lost. Thankfully vector based graphics applications like CorelDraw and Illustrator came along because I couldn't draw a box with AutoCAD anymore. As it happens I took a refresher course yesterday. How's that for serendipity?\n\nIt has some nifty tricks but it is not meant for graphics. When I bring an architectural or civil CAD drawing of a building floor or site plan into Illustrator What I get is thousands of line segments, a bloated file and a headache.\n\n"
    },
    {
      "time": "16 Feb 2013 — 4:13am",
      "content": "I ran into this working on the signage and controls for a boat. The type design eventually had all the minor kerning removed, and the major pairs \"AW\" e.g. had to be made into slugs like the olden days and then subbed in at output. I also talked the builders into using a 1:1 scale so the type sizes would be understandable. This was accepted because no one actually measures off the drawings anymore, preferring to pass .dwg files around and measure in screen.\n\n"
    }
  ]
}
