{
  "id": "100533",
  "title": "Wikipedia, Bell and Scotch Roman",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "Richard Austin",
    "Scotch Roman",
    "Wikipedia"
  ],
  "content": "I was looking at the Wikipedia entry on [Bell](http://web.archive.org/web/20150425022521/http:/en.wikipedia.org/wiki/Bell_%28typeface%29) and some of what it says seems a bit weird. First of all, it describes it as \"the first Scotch Roman face\". Does that seem right? I thought Scotch Roman specifically referred to descendents of Miller's mid-nineteenth-century Pica Roman No. 2 and close facsimiles. Bell is a late-eighteenth-century transitional with many features in common with Scotch, but I wouldn't personally classify it as one.\n\nI know Richard Austin is often credited with designing the Miller face (although as far as I can tell this is entirely based on T.C Hansard, who made the claim with little or no substantiation). I wonder if whoever wrote this part of the Wikipedia article was confusing this latter type with Austin's much earlier Bell type.\n\n(It also lists one of Bell's characteristics as \"square dot over the letter i\"... ???)\n\nThat brings me to the article on [Scotch Roman](http://web.archive.org/web/20150425022521/http:/en.wikipedia.org/wiki/Scotch_Roman) itself. Um. It actually barely says anything (a travesty on its own), and what it does say seems quite inaccurate:\n\n> These typefaces were modeled on an original 1839 design by Samuel Nelson Dickinson, founder of the Dickinson Type Foundry in Boston, who had the design cut by Richard Austin, and cast by Alexander Wilson and Son in Glasgow, Scotland.\n\nThe quoted sentence cites [this Typefoundry article](http://web.archive.org/web/20150425022521/http:/typefoundry.blogspot.ca/2007/02/scotch-roman.html) as a source. Yet a careful reading of the latter actually contradicts it almost entirely:\n\n- The 1939 Dickinson design, which is nowhere said to have been cut by Austin, is only the origin of the \"Scotch face\" name, but is _not_ the model for the Scotch Roman typefaces themselves.\n- The actual model, Miller Pica Roman No.2, is the one claimed by Hansard to have been cut by Austin, but the article specifically casts doubt on that claim.\n\nI get the distinct impression that the Wikipedia article author just hastily skimmed the source article without properly understanding what it said.\n\nI'm hardly an expert on these matters, so I'm reluctant to simply start editing the Wikipedia articles myself... not at least without getting some informed opinions. Can anyone comment?\n\n",
  "author": "altsan",
  "time": "14 Feb 2013 — 8:07am",
  "uid": "192788",
  "comments": [
    {
      "time": "14 Feb 2013 — 9:41am",
      "content": "Mildly related:  \n [http://typophile.com/node/2253](http://web.archive.org/web/20150425022521/http:/typophile.com/node/2253 \"http://typophile.com/node/2253\")\n\nhhp\n\n"
    },
    {
      "time": "14 Feb 2013 — 10:48am",
      "content": "Let sleeping dogs lie.  \nThis is the kind of issue that is beyond wiki.\n\n"
    },
    {
      "time": "14 Feb 2013 — 11:35pm",
      "content": "[to follow]\n\n"
    },
    {
      "time": "15 Feb 2013 — 12:00am",
      "content": "Nick, wiki is not a single person... it is a pool of knowledge, its water is contributed by anyone and everyone with their specific perceptions of what is true for them... I would think that you might have very specific and strong waters of knowledge to contribute (here and in wiki references), particularly in light of your \"Scotch Modern\" typeface designs.\n\nPerhaps you might review your seemingly dismissive opinion about wiki, and enlighten us all...\n\n"
    },
    {
      "time": "15 Feb 2013 — 8:09am",
      "content": "\"I'm hardly an expert on these matters, so I'm reluctant to simply start editing the Wikipedia articles myself\"\n\nThis made my day. You truly are amongst the 1%. Thanks!\n\n"
    },
    {
      "time": "15 Feb 2013 — 8:19am",
      "content": "> it is a pool of knowledge, its water is contributed by anyone and everyone with their specific perceptions of what is true for them\n\nDoesn’t seem like that to me ... for example when I wondered why [Stephen Coles’ in-depth criticism about Roboto](http://web.archive.org/web/20150425022521/http:/typographica.org/on-typography/roboto-typeface-is-a-four-headed-frankenstein/) isn’t mentioned in [Roboto’s Wikipedia entry](http://web.archive.org/web/20150425022521/http:/en.wikipedia.org/wiki/Roboto), I found out that it is considered «self-published» (as opposed to a newspaper article &c.) and thus not reliable. Furthermore, that Stephen once worked for FontShop apparently doesn’t make him an expert, but only biased. So the only remaining evaluation of the font is now that it is «clean and modern, but not overly futuristic – not a science fiction font». Wow.\n\nI don’t put much trust (or anger) in Wikipedia typography articles anymore. Life is easier that way ;)\n\n"
    },
    {
      "time": "15 Feb 2013 — 10:18am",
      "content": "Wikipedia simply isn't a reliable source of info. I've seen too many glaring errors, biased articles, info that is unsourced, and I've seen people with fringe opinions take over an article and repeatedly delete anyone who disagrees with them.\n\n"
    },
    {
      "time": "15 Feb 2013 — 10:42am",
      "content": "Michael, it would take me several days’ work to write a Wiki entry on Scotch Roman.  \nI’m afraid I don’t have the time or inclination to do that.  \nNow you might say, it wouldn’t have to be very long—but ﬁguring out in words what one knows tacitly and distilling that down is the very problem.  \nAs it is, I’ve spent far too long writing this post!\n\nScotch Roman is a nebulous concept that is best understood by reading James Mosley’s lengthy (for a blog) illustrated essay at his [Typefoundry](http://web.archive.org/web/20150425022521/http:/typefoundry.blogspot.ca/2007/02/scotch-roman.html) site.\n\nI’m not dismissive of Wiki—I use it all the time—but it’s an encyclopædia for goodness sake, and as such has limitations.\n\n"
    },
    {
      "time": "15 Feb 2013 — 12:06pm",
      "content": "Michael, it would take me several days’ work to write a Wiki entry on Scotch Roman.  \nI’m afraid I don’t have the time or inclination to do that.  \nNow you might say, it wouldn’t have to be very long—but ﬁguring out in words what one knows tacitly and distilling that down is the very problem.  \nAs it is I've spent far too long writing this post!\n\nScotch Roman is a nebulous concept that is best understood by reading James Mosley’s lengthy (for a blog) illustrated essay at his [Typefoundry](http://web.archive.org/web/20150425022521/http:/typefoundry.blogspot.ca/2007/02/scotch-roman.html) site.\n\nI’m not dismissive of Wiki—I use it all the time—but it’s an encyclopædia for goodness sake, and as such has limitations.\n\n"
    },
    {
      "time": "15 Feb 2013 — 12:05pm",
      "content": "Sorry for the repeat post—I was tagged as spam!\n\n"
    },
    {
      "time": "15 Feb 2013 — 12:14pm",
      "content": "I've been getting some of my posts tagged as spam also.\n\n"
    },
    {
      "time": "15 Feb 2013 — 12:15pm",
      "content": "[http://typophile.com/node/100558](http://web.archive.org/web/20150425022521/http:/typophile.com/node/100558 \"http://typophile.com/node/100558\")\n\nhhp\n\n"
    },
    {
      "time": "15 Feb 2013 — 12:38pm",
      "content": "I'm glad they're working on spam blocking, but you'd think the software could be set up to focus on posts from newer accounts. Almost all spam comes from new accounts, not from people who've been posting here for years.\n\n"
    },
    {
      "time": "16 Feb 2013 — 8:58am",
      "content": "@Nick Indeed, that's the very article that the Wikipedia entry cites as its principal source, and which it then proceeds to thoroughly mis-cite. It does take a few readings to properly understand, but the information is excellent.\n\nI'm not (personally) proposing to write a comprehensive description of Scotch Roman. OTOH I am thinking to make some simple corrections so that the entry actually agrees with the source it cites. That appears to be a pretty clear-cut error in the entry. The purely subjective stuff I don't mind leaving be, for now. :)\n\n"
    },
    {
      "time": "16 Feb 2013 — 9:45am",
      "content": "Here's what I'm thinking of replacing the second and third sentences of the first paragraph on Wikipedia with:\n\n> These typefaces were modeled on a nineteenth-century design from the Edinburgh foundry of William Miller: his \"Pica Roman No. 2\". Some accounts suggest that Miller's type, the oldest surviving specimen of which dates to 1813, was cut by Richard Austin.\n> \n> The name \"Scotch Roman\", which entered use in the United States late in the same century, was applied to a slightly modified recasting of Miller's type by the A.D. Farmer foundry of New York. It is believed to derive from \"Scotch-face\", a term which was originally used by a different type designed in 1839 by typefounder Samuel Nelson Dickinson of Boston, and cast for him by Alexander Wilson and Son in Glasgow.\n\nAll under the citation to Mosley's essay. I'll leave the remainder unchanged, at least for now.\n\n"
    },
    {
      "time": "16 Feb 2013 — 10:13am",
      "content": "@altsan... great that you are taking this one on... I am curious, though, about the following:\n\n1. Even though the term \"Scotch Roman\" generally refers back to Farmer/Wilson's \"Scotch-face\", we novices tend, and perhaps the evolution(s) of Scotch Roman seems to flow more from the Miller designs than the Farmer/Wilson designs. Is this a fair observation?\n\n2. Even the Miller designs are fluid. His earlier designs maintains the chiseled lowercase \"t\"... where his later designs (and most Scotch Romans since) adopted the flattop \"t\" (using just one example).\n\n3. Simply from a historical sense, I get the feeling that Scotch Romans were truly a \"transitional\" typeface... attempting to blend the artistry and readability of the Baskervilles/Bells, etc., with leanings toward the \"business-mercantilism\" feel that America was experiencing in the late 18th and early 19th centuries. \"Scotch-face\" seems a bit more business-like than Pica No. 2 ?\n\n4. The revivals of the Scotch Romans seem to take a multitude of paths emanating from both Wilson and Miller's visions... besides Carter's Miller, Escrow, Whittingham, FF Clifford (?), Georgia, Nick's Scotch Modern (which leans a bit toward the didones ?... sorry Nick if I misstate this)... what others fit into this genre, and from what are their designs derived. I've always been confused how to \"mentally\" interpret a specific typeface design when the inspirations are multiple and diverse.\n\nWasn't sure whether any of this was relevant to your possible editing of the wiki entry...\n\n"
    },
    {
      "time": "16 Feb 2013 — 10:36am",
      "content": "I consider the Modern (Didone, e.g. Bodoni, Didot), the Scotch (Roman), and the Scotch Modern to be quite distinct categories.\n\nHowever, although I have presented the idea of the Scotch Modern as a separate category, it hasn’t caught on. Perhaps it’s not a good idea, or perhaps I haven’t promoted it well enough. Or perhaps people think it’s just a marketing gimmick.\n\nTherefore I am reluctant to edit the wiki on Scotch Roman, or even to start a fresh wiki page for Scotch Modern.\n\n ![](http://web.archive.org/web/20150425022521im_/http:/typophile.com/files/Scotches_5400.png)\n\n"
    },
    {
      "time": "16 Feb 2013 — 10:50am",
      "content": "So I see the Scotch Roman as transitional, leading from the Didone to the Scotch Modern, even though transitionals are considered, chronologically, to be Baskervillian, leading from Garalde to Didone.\n\nTwo meanings for Transitional, whether Phylogentic (evolutionary/historical) or Taxonomic (physical features).\n\nAccordingly, a 20th century transitional such as Dwiggins’ Caledonia (with its clever “Scottish” name), not being a revival or pointedly weighted to either the Baskervillian or ScoMo historical era, might be considered post-modern.\n\n"
    },
    {
      "time": "16 Feb 2013 — 5:16pm",
      "content": "@oobimichael: Interesting remarks, thanks. Any changes I make to the Wikipedia entry, however, must contain only information from the cited reference, in this case the Mosley article. I'm not planning to start a wiki-war about what constitutes Scotch. :)\n\n@Nick: Thanks for the explanations. An interesting and probably quite useful way of defining these categories, indeed.\n\nPersonally, from what I've seen I'd been inclined up to now to call Scotch Roman a modern, because it has those horizontal almost-unbracketed serifs (which indeed distinguish it from something like Bell, to refer back to my earlier remark). You're quite right about the gentler transition, though.\n\n"
    },
    {
      "time": "17 Feb 2013 — 9:02am",
      "content": "OK, [the Scotch roman Wikipedia entry](http://web.archive.org/web/20150425022521/http:/en.wikipedia.org/wiki/Scotch_Roman) has been updated. (I tweaked the text a little more.)\n\nIt'd be nice if there was an actual sample image, but that's beyond the scope of what I'm prepared to attempt just now.\n\n"
    }
  ]
}
