{
  "id": "100593",
  "title": "Din Modernization",
  "forum": "Sans Serif",
  "tags": [
    "din",
    "DIN 1451",
    "Modernization",
    "modification",
    "Project work",
    "Sans Serif"
  ],
  "content": "I did intend to post here before it was finished asking for comments and alike, but now it's done already.  \n [http://www.behance.net/gallery/Din-1451-modernization/7182369](http://web.archive.org/web/20150414210101/http:/www.behance.net/gallery/Din-1451-modernization/7182369)\n\nFor learning fontlab studio I took my favourite font DIN 1451 and added some ligatures. When the course entitled \"Project work\" came around I had already set my mind to either doing my own complete font, or modernizing DIN as far as time would allow me to. The course gave me 100 hours, but I likely put in closer to twice that.\n\n",
  "author": "seen",
  "time": "16 Feb 2013 — 10:31am",
  "uid": "201403",
  "comments": [
    {
      "time": "16 Feb 2013 — 10:42am",
      "content": "Typophile forums beeing somewhat unintuitive, I wanted to save-mid writing and ended up posting that.\n\nWhat I actually did was  \nAdding glyphs to make it support Unicode Basic latin, latin-1 supplement & Latin Extended-A  \nAdded and coded 13 ligatures, alternate ligatures (and made two stylistic alternate of ligatures)  \nAdded a few (poorly implemented) characters and glyphs, alpha, omega, florin and a few others.  \nAdded stylistic alternates (rounded letters with dieresis and i dots / dashed 0 and unimplemented alternate ligatures)  \nAdded a few kerning classes & exceptions.\n\nBoth myself and my teacher/handler enjoyed this project.  \nI'll gladly take comments, critique or whatever you'd like to say.\n\nI'd also like to point out that this was my first real typographic work / time using fontlab and that I was 17 when I made this.\n\n"
    },
    {
      "time": "16 Feb 2013 — 10:44am",
      "content": "If this were to be released, wouldn't it be in violation of FontShop's EULA as a derivative work?  \n - Herb\n\n"
    },
    {
      "time": "16 Feb 2013 — 10:51am",
      "content": "It's based on Adobe's DIN 1451 mittelschrift, and it's very unlikely that it'll ever be released.  \nQuite sure they allow derivative work for personal use and my handler did say that I could ask Adobe to license it from me (about as likely as that it'll ever be released)\n\n"
    },
    {
      "time": "16 Feb 2013 — 11:04am",
      "content": "Yes, Adobe's EULA is a bit more flexible. It's a pity that such innovative work must remain underground. Your handler's suggestion to contact Adobe sounds reasonable. One never knows! - Herb\n\n"
    },
    {
      "time": "16 Feb 2013 — 11:11am",
      "content": "I'm in favor of this sort of thing... but it must not be released.\n\nThere is however a gray area, at least when it comes to _certain_ Adobe fonts: if all parties involved buy a license to the original, they should be OK in acquiring the derivative as well.\n\nhhp\n\n"
    },
    {
      "time": "17 Feb 2013 — 3:30pm",
      "content": "I can see few problems in diacritics, that you should solve before trying to do anything more with it:\n\n- Polish ogonek is not a some addon or accent like acute or slash, it is a intergral part of a letter. So in most cases it's smoothly connected to the letter. See polish diacritics at bottom.  \n- Caron should be in optical middle of the letter. See diacritics.eu at bottom.  \n- Caron with /t, /d, /l (ť, ď, ľ) should be more closer to the letter and tighter.  \n- Ring over letter like Ů should be much more stronger.  \n- Circumflex above h should be above the stem in the middle. See ilovetypography.com at bottom.  \n- I think breve is too wide.  \n- Double crossed t? (9th line at the end)  \n- tcedilla should be tcommaacent  \n- udieresis is missing (or it isn't on behance) uhungarumlaut is only for hungarian language  \n- commaaccent diacritics is missing - letters like R, N, G, T, r, n, g, t\n\nLinks to study:  \n [http://www.twardoch.com/download/polishhowto/index.html](http://web.archive.org/web/20150414210101/http:/www.twardoch.com/download/polishhowto/index.html \"http://www.twardoch.com/download/polishhowto/index.html\")  \n [http://www.diacritics.eu/en/](http://web.archive.org/web/20150414210101/http:/www.diacritics.eu/en/ \"http://www.diacritics.eu/en/\")  \n [http://ilovetypography.com/2009/01/24/on-diacritics/](http://web.archive.org/web/20150414210101/http:/ilovetypography.com/2009/01/24/on-diacritics/ \"http://ilovetypography.com/2009/01/24/on-diacritics/\")  \n [http://diacritics.typo.cz/](http://web.archive.org/web/20150414210101/http:/diacritics.typo.cz/ \"http://diacritics.typo.cz/\")\n\nFeel free to ask any question.  \nJan\n\n"
    },
    {
      "time": "19 Feb 2013 — 10:31am",
      "content": "Jan, I greatly appreciate you taking the time to write all this help.  \nMy project wasn't to re-make anything DIN 1451 has, it was to extend and modernize it, hence I didn't do üÜ/ß (even if I could perhaps do a lowercase eszett).\n\nFrankly, in my unknowing pursuit of making something acceptable for personal use, I just went after Latin extended-A and the parts of Latin-1 Supplement I had time for.  \n(these exact lists  \n [http://www.decodeunicode.org/en/latin\\_extended-a](http://web.archive.org/web/20150414210101/http:/www.decodeunicode.org/en/latin_extended-a \"http://www.decodeunicode.org/en/latin\\_extended-a\")  \n [http://www.decodeunicode.org/en/latin-1\\_supplement](http://web.archive.org/web/20150414210101/http:/www.decodeunicode.org/en/latin-1_supplement \"http://www.decodeunicode.org/en/latin-1\\_supplement\")  \n)\n\nExplaining both Ŧ/ŧ and Ű/ű\n\nKnowing quite little about languages that actually use most of these accents and how they use them I generally just went with what fontlab gave me and tried to align it to the optical midpoint, fix anything I found aesthetically unpleasing and hint it.\n\nIf I find the time and/or motivation for it I'll fix these problems now, but in a few months it'll almost guaranteed to be fixed.\n\n"
    },
    {
      "time": "19 Feb 2013 — 4:23pm",
      "content": "Fontlab sometimes give you misadvice with the accents, so it is better for you to find out how to do it properly.  \nThe changes I wrote are for few hours.\n\nGood luck with finishing this project.  \nJan\n\n"
    }
  ]
}
