{
  "id": "100569",
  "title": "font mixing - does this work, or do I need a different sans?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi, all.\n\nI'm testing out another combination. I'd appreciate your thoughts on whether these two faces are co-existing peaceably, or are jarring your eyeballs. (Or, any other critique you'd care to lob at me. Go for it. I can take it.)\n\nIf it's the case that another sans would work where this doesn't, let me know.\n\n(I know, I know, you're gonna ask \"what's this for?\" I'll tell ya later.)\n\n ![](http://web.archive.org/web/20130819204907im_/http:/typophile.com/files/mixing-faces_4404.jpg)\n\n",
  "author": "Amado",
  "time": "15 Feb 2013 — 1:06pm",
  "uid": "99380",
  "comments": [
    {
      "time": "15 Feb 2013 — 2:12pm",
      "content": "Hey, I like it!  \nJust the descenders on the sans are too long.\n\nBTW, check this out:  \n [http://www.daidala.com/intlife.html](http://web.archive.org/web/20130819204907/http:/www.daidala.com/intlife.html \"http://www.daidala.com/intlife.html\")\n\nhhp\n\n"
    },
    {
      "time": "15 Feb 2013 — 2:05pm",
      "content": "\"\"what's this for?\"\n\n\"\"\"I'll tell ya later\"\"\"\n\nThen ask me again later. It's a waste of time now.\n\n"
    },
    {
      "time": "18 Feb 2013 — 4:52am",
      "content": " **Client:** Jazz/Blues vocalist and composer, who also does a lot of work with Funk/Rock rhythms and thick, interwoven vocal harmony.\n\n**Products:** Visual identity. Logo. Business cards. Posters. Album art. Liner notes. Brochures. Bumper stickers. Newsletters. Probably even t-shirts, down the line.\n\nIs that enough, or do you need the brand messages that we're hoping to reinforce with these typefaces? I mean, if these two faces flat-out don't work together, then describing the brand messages to you might be an unproductive use of my time. What do you see in it?\n\n"
    },
    {
      "time": "18 Feb 2013 — 4:55am",
      "content": "hrant: oooo, conflict of similarity is what I see. On quick scan, I didn't see that they were two (three?) different faces.\n\nDo you know what the faces are?\n\n"
    },
    {
      "time": "18 Feb 2013 — 5:59am",
      "content": "Context is everything, much more than a short sentence on a business card and one might not even notice that the typefaces are different, one might pick up on the weight but then you might achieve the same effect using a regular and book weight of the same typeface.\n\nTim\n\n"
    },
    {
      "time": "18 Feb 2013 — 6:42am",
      "content": "I don't know what fonts those are. But the fact that the difference doesn't jump out at you, it creeps up under you, is what I like.\n\nhhp\n\n"
    },
    {
      "time": "18 Feb 2013 — 1:28pm",
      "content": "The Metro-ish sans is slightly too dark in color (eg too fat) & the x-heights could be more equal (the slight variation there is currently is distracting too much).\n\n"
    },
    {
      "time": "19 Feb 2013 — 2:02pm",
      "content": "So far, people aren't bothered by a stylistic mismatch -- just the proportions?\n\nI was trying to split the difference between matching the x-height and matching the cap-height. The sans I'm trying here has an x-height that is much smaller than the serif's.\n\nThis sans I'm trying has a wide variety of weights; the serif I'm using has none. I used the one that looked a little darker b/c I thought, in this example, that it could stand for STRONG or BOLD.\n\nBut you confirm my fears: the vertical proportions are just a little bit too far off. I haven't yet found a sans in this genre that matches like I'd like; this is the closest I've gotten.\n\nAnybody know how I can get in touch with Wolfgang Homola? The other candidate was [http://www.myfonts.com/fonts/type-together/soleil/](http://web.archive.org/web/20130819204907/http:/www.myfonts.com/fonts/type-together/soleil/ \"http://www.myfonts.com/fonts/type-together/soleil/\") , but I would be interested in customizations.\n\n"
    },
    {
      "time": "19 Feb 2013 — 2:06pm",
      "content": "Contact TypeTogether - they're very accessible people.\n\nhhp\n\n"
    },
    {
      "time": "19 Feb 2013 — 8:38pm",
      "content": "What about this:  \n [http://www.myfonts.com/fonts/stone/magma/](http://web.archive.org/web/20130819204907/http:/www.myfonts.com/fonts/stone/magma/ \"http://www.myfonts.com/fonts/stone/magma/\")\n\nhhp\n\n"
    },
    {
      "time": "20 Feb 2013 — 4:09am",
      "content": "Magma: nice, but flared doesn't appeal. Looking for more cross between Avenir and Metro, leaning Avenir.\n\nlike\n\n ![](http://web.archive.org/web/20130819204907im_/http:/typophile.com/files/How-I-Looped-Each-From-There_4749.jpg)\n  \nand  \n\n ![](http://web.archive.org/web/20130819204907im_/http:/typophile.com/files/hack-edits_4960.jpg)\n  \nor  \n\n ![](http://web.archive.org/web/20130819204907im_/http:/typophile.com/files/sans-for-doves-x-height_3813.jpg)\n\nBut licensed, and not an amateurish hack job like I've done.\n\n"
    }
  ]
}
