{
  "id": "100551",
  "title": "Advice to young typophiles who want to marry",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "For young font makers, who want to marry, and also for punch-cutters, who want to undertake the risky adventure of a marriage, I uploaded a hires scan of a beautiful large-scale Renaissance woodcut-flyleaf by Hans Sachs dated 1549 and cut in a Schwabacher blackletter typeface.\n\nTop half of flyleaf: Woodcut with this heading:  \n**\"A useful advice to those apprentices who want to marry\"**  \nsee [http://www.sanskritweb.net/fontdocs/hans-sachs-rat1.gif](http://web.archive.org/web/20131015041526/http:/www.sanskritweb.net/fontdocs/hans-sachs-rat1.gif \"http://www.sanskritweb.net/fontdocs/hans-sachs-rat1.gif\")\n\nBottom half of flyleaf: Poem with this heading:  \n**\"Advice concerning three types of marriage\"**  \nsee [http://www.sanskritweb.net/fontdocs/hans-sachs-rat2.gif](http://web.archive.org/web/20131015041526/http:/www.sanskritweb.net/fontdocs/hans-sachs-rat2.gif \"http://www.sanskritweb.net/fontdocs/hans-sachs-rat2.gif\")\n\nThe three types of marriage for punch-cutters are these:  \n- Firstly, marriage of a young and beautiful, but poor maiden.  \n- Secondly, marriage of a rich widow, who was married once.  \n- Thirdly, marriage of a very rich widow, who was married twice.  \nGuess, which type of marriage is considered by Hans Sachs as least troublesome for font-makers and punch-cutters?\n\n",
  "author": "Uli",
  "time": "15 Feb 2013 — 6:54am",
  "uid": "11274",
  "comments": [
    {
      "time": "15 Feb 2013 — 7:29am",
      "content": "Blissfully married to #1 for 16 years now.\n\n"
    },
    {
      "time": "15 Feb 2013 — 10:52am",
      "content": "Fourth type: hire Mrs Eaves…\n\n"
    },
    {
      "time": "15 Feb 2013 — 6:29pm",
      "content": "no <cite>respectable</cite> person with advice to offer on the subject and the temerity to offer it has ever advised a young man to marry a poor maiden.\n\n"
    },
    {
      "time": "15 Feb 2013 — 3:28pm",
      "content": "It has been said: the first time you marry, it’s for sex; the second time you marry, it’s for love; the third time you marry, it’s for money. This advice appears to be all number one or number three…\n\n"
    },
    {
      "time": "17 Feb 2013 — 7:37am",
      "content": "The couple should be well kerned.\n\n"
    }
  ]
}
