{
  "id": "100586",
  "title": "Looking for a serif font that matches DIN (LightAlternate)",
  "forum": "Typography / Composition",
  "tags": [
    "din",
    "Typography / Composition"
  ],
  "content": "Hello everybody,\n\ni am currently writing a tutorial book about 3D design with an artistic spirit in design and typo and so on. Most of the papers in categories that have a lot to do with computers etc are not that much enjoyable to read according to layout and design :)  \nwhich i cannot understand because 3D professionals actually should provide a certain sense for design!\n\nhowever, i decided to use DIN LightAlternate or RegularAlternate for text and now am looking for a nice contrasting serif font for headlines!  \nI already considered Big Caslon, Mrs Eaves and Perpetua Titling but I don't know... probably they are still too boring (?)  \nThe headlines can be a little squiggy because the book itself will be kind of classic (which is also the reason why i would not like the text to be in a serif font too because i like the contrast between classic and simplicity (DIN) )\n\nThank you in advance!!\n\n ![](http://web.archive.org/web/20150417091314im_/http:/typophile.com/files/Bildschirmfoto%202013-02-16%20um%2015_4731.31.25.png)\n  \nBig Caslon  \n\n ![](http://web.archive.org/web/20150417091314im_/http:/typophile.com/files/Bildschirmfoto%202013-02-16%20um%2015_6387.45.20.png)\n  \nPerpetua Titling  \n\n ![](http://web.archive.org/web/20150417091314im_/http:/typophile.com/files/Bildschirmfoto%202013-02-16%20um%2015_4668.32.13.png)\n  \nMrs Eaves \n",
  "author": "Skadivore",
  "time": "16 Feb 2013 — 7:13am",
  "uid": "208987",
  "comments": [
    {
      "time": "16 Feb 2013 — 8:13am",
      "content": "Some opinions:  \n- Are you sure it's a good idea to use DIN for the text? Is there not a lot of text?  \n- Caslon and Perpetua are very old-fashioned. Mrs Eaves is more interesting, but it's horribly spaced, so you would need to manually respace every single setting.  \n- I don't know what \"squiggy\" means. :-)  \n- Instead of extreme contrast between text and titles I might aim for more harmony, choosing a squarish face for the titles (maybe Melior, or preferably something more recent). But first make sure you want to use DIN.\n\nhhp\n\n"
    },
    {
      "time": "16 Feb 2013 — 12:20pm",
      "content": "Frutiger’s [Egyptienne F](http://web.archive.org/web/20150417091314/http:/www.myfonts.com/fonts/linotype/egyptienne-f/) may be a good serif match for DIN, but unlike Melior (which I love) it doesn’t look so old-fashioned, at least to me. And I second Hrant, you may want to consider using the serif face for text and DIN for the headlines.\n\n"
    }
  ]
}
