{
  "id": "100627",
  "title": "Training the anti-spam engine",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "We've put some automated anti-spam measures into Typophile recently, and the good news is that it is really helping keep the spammers at bay.\n\nHowever, a lot of you seasoned Typophiles are getting legitimate posts flagged by the spam engine. As frustrating as this is, we're going through an essential period of training the engine to know which comments are legitimate and which are not. Bear with us, and this will soon be behind us.\n\nIf you are seeing specific patterns about why your posts are being flagged, please share them below.\n\nThanks-\n\n",
  "author": "Jared Benson",
  "time": "17 Feb 2013 — 11:19pm",
  "uid": "3",
  "comments": [
    {
      "time": "18 Feb 2013 — 5:09am",
      "content": "Nick Shinn made a good point in one of his posts -- the new filters don't seem to take into account how long someone has been registered at Typophile, yet most spammers have a quite new registration.\n\n"
    },
    {
      "time": "18 Feb 2013 — 5:46am",
      "content": "Charles,\n\nThank you for pointing that out. How about considering a very simple rule: anyone who posts more than four times in the first twenty-four hours he or she is registered should be flagged for human inspection, and anyone who posts more that a dozen times in the same time period should be sent to Hell, forthwith...\n\n"
    },
    {
      "time": "18 Feb 2013 — 6:42am",
      "content": "I've been thinking about this and believe a good solution would be: if the account is less than six months old, the posts have to go through moderation.\n\n"
    },
    {
      "time": "18 Feb 2013 — 8:45am",
      "content": "As others have mentioned (and as I've been saying for a long time), most spam is from new accounts.\n\nFocus on screening posts from new accounts, and give older accounts an automatic pass unless there is a major red flag. On the rare occasions when an old account is used for spam, it can be deleted manually later.\n\n"
    },
    {
      "time": "18 Feb 2013 — 11:52am",
      "content": "Yes - the antispam modules don't take into account the user account's age, except for catching new accounts as they are created. I'll continue to look into other modules that might dovetail in that might support this function.\n\n"
    },
    {
      "time": "18 Feb 2013 — 12:23pm",
      "content": "I'd echo James' thought. It seems most spamming on here is drive-by. No idea on the ease of implementation, but seems that one option would be that all new user posts have to be moderated.\n\nOf course, if the moderation can't happen in a timely manner, that'd frustrate new legitimate users so perhaps is a big drawback.\n\n"
    },
    {
      "time": "18 Feb 2013 — 7:28pm",
      "content": "@Jared\n\nDoes your filtering module have the capability to establish whitelists? If so that might be the best way.\n\nI agree that moderation is the worst solution because new users will post multiple times, not understanding what is happening.\n\n"
    },
    {
      "time": "18 Feb 2013 — 8:14pm",
      "content": "\\> new users will post multiple times, not  \n\\> understanding what is happening\n\nYes that can happen, but you can reduce it by explaining the delay clearly to the poster. I've posted at sites where you get an automatic message like: \"Your post will appear after it's approved by a moderator (usually within 24 hours)\". But posts from whitelisted accounts actually appear immediately, it's only the new member posts that get reviewed.\n\n"
    },
    {
      "time": "19 Feb 2013 — 9:41am",
      "content": "I agree with JamesM: As a new user, my first post today got flagged as spam, and that surprised me. If the message had said \"waiting for mod approval since this is your first post\", it would feel much more welcoming :)\n\n"
    },
    {
      "time": "19 Feb 2013 — 9:48am",
      "content": "Thanks, Jared. It had just been depressingly impossible before you made the new changes. I agree that new posters are almost always the culprits.\n\n"
    },
    {
      "time": "19 Feb 2013 — 10:03am",
      "content": "does it allow users to flag spam?\n\nF Randall Farmer, who's a world authority on community systems, recommends this. he did it for Yahoo Answers, and it was highly effective. the idea being, you don't have to get rid of all spam outright, just slow the spammers down enough to make it uneconomical.\n\n"
    },
    {
      "time": "19 Feb 2013 — 11:41am",
      "content": "Marking the spam is not the problem, it is deleting each and every spam and blocking the user a billion times that kills you. Spambots are quite automated SOBs.\n\n"
    },
    {
      "time": "20 Feb 2013 — 5:11am",
      "content": "users should remove spam as well. from his book, Building Web Reputation Systems.\n\n> Yahoo! Answers decided to let users themselves remove content from display on the site because of the staff backlog. Because response time for abusive content complaints averaged 12 hours, most of the potential damage had already been done by the time the offending content was removed. By building a corporate karma system that allowed users to report abusive content, Yahoo! Answers dropped the average amount of time that bad content was displayed to 30 seconds. Sure, customer care staff was still involved with the hardcore problem cases of swastikas, child abuse, and porn spammers, but most abusive content came to be completely policed by users.> With the final iteration, the designers had incorporated all the desired features, giving historically trusted users the power to hide spam and troll-generated content almost instantly while preventing abusive users from hiding content posted by legitimate users. This model was projected to reduce the load on customer care by at least 90% and maybe even as much as 99%. There was little doubt that the worst content would be removed from the site significantly faster than the typical 12+ hour response time.\n"
    },
    {
      "time": "20 Feb 2013 — 2:11pm",
      "content": "could you put me on the whitelist, if there is one? i can't post links.\n\n"
    },
    {
      "time": "21 Feb 2013 — 1:08pm",
      "content": "Let me try :^)\n\n[Training the anti-spam engine](http://web.archive.org/web/20131023173257/http:/typophile.com/node/100627)\n\n[Edit] In reply to Hrant, below, I just pressed \"Edit\" and got the old familiar \"Edit comment\" box. Where does one get into a waiting queue?\n\n[Edit #2] Nope. Sorry, Hrant, it seems to work dandy for me!\n\n"
    },
    {
      "time": "21 Feb 2013 — 11:34am",
      "content": "Every time I want to edit a post (in any thread) the time I need to wait increases. And I think it might even carry over from previous days... Right now in one thread I'm being told to wait 413 seconds before I can fix a spelling mistake...\n\nHmmm, it actually seems to affect new posts too. For this one I was asked to wait 1106 seconds (over 18 minutes).\n\nhhp\n\n"
    },
    {
      "time": "21 Feb 2013 — 1:41pm",
      "content": "I'm guessing that there's a timing trigger for posters who post many messages in a short period of time.\n\nBut this was my second post in about five minutes, and no 'please wait'. (Yet) - Herb\n\nAnd then my second edit in less than a minute. Another theory down the drain :)\n\n"
    },
    {
      "time": "21 Feb 2013 — 3:13pm",
      "content": "i can't use the src tag for images at the moment, either.\n\nany idea how long the training or settings change is going to take?\n\n"
    },
    {
      "time": "22 Feb 2013 — 8:11am",
      "content": "Yes, there is a whitelist, of sorts. Not sure what this new delay thing is; I've not seen it anywhere in the settings.\n\n@Chris Hunt: Done\n\n(The rest of you in this thread are already on the whitelist.)\n\n"
    },
    {
      "time": "22 Feb 2013 — 9:35am",
      "content": "Several times when I've edited one of my posts, I've gotten a message saying I need to wait a number of seconds. Here's an example from this morning.\n\n ![](http://web.archive.org/web/20131023173257im_/http:/typophile.com/files/edit2_6085.jpg)\n\n"
    }
  ]
}
