{
  "id": "100651",
  "title": "Italicize occasional Cyrillic and Greek in text?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Should occasional Cyrillic or Greek be italicized in an otherwise Latin-script text? The usual practice for English text is to italicize Latin-script words in non-English languages, _comme ça_. Hebrew, Arabic, Coptic, Gothic, Devanagari, and the like are never italicized to my knowledge, partly because there is no real italic in those languages, and partly because the writing systems are different enough that they don’t need to be otherwise distinguished from the body text. But what about Greek and Cyrillic? In the old days of metal type I guess people just used whatever they had for those scripts, but in the modern era of Unicode and digital type it’s typical to have typefaces with harmonized Greek, Cyrillic, and Latin. Are they different enough to not need to be set off from the body, or should they be italicized?\n\nI note that italics can problematic for Cyrillic which has distinctively different letterforms in its italic incarnations. How many people who can read Cyrillic will actually recognize an italicized yat?\n\n",
  "author": "jcrippen",
  "time": "18 Feb 2013 — 12:51pm",
  "uid": "25436",
  "comments": [
    {
      "time": "18 Feb 2013 — 2:09pm",
      "content": "I would say italicize Greek as one would French etc.  \nMany letters of the Greek alphabet look like Latin letters although they do not correspond.  \nSo remove the possibility that nu will be read as /v, or rho as /p, and so on.  \nAlso, scholars will appreciate that this degree of contrast between upright and slanted forms is old-school (when the default Greek fonts had a slanted lower case).  \nFurthermore, this would give Greek the same _typographic_ treatment as French etc., so would be consistent in an English document that quoted both French and Greek extracts.\n\nAnd especially for that last reason, I would say italicize Cyrillic also.\n\n"
    },
    {
      "time": "19 Feb 2013 — 8:51am",
      "content": "Italicize as seldom as possible, especially when it's a different script, especially especially when it's a script that has no -or a problematic- Italic tradition.\n\nhhp\n\n"
    },
    {
      "time": "19 Feb 2013 — 6:48am",
      "content": "As much as i agree with Nick’s opinion i don’t see the necessity to italicize a different script. The reason why it is better to italicize different languages within the Latin alphabet, is to indicate clearly to the reader that there is a loan word or citation from a different language following. A different script is enough visible change.  \nIf, however one had to set several words in different languages and scripts within the same text, i would italicize also the other scripts.\n\n"
    },
    {
      "time": "19 Feb 2013 — 8:45am",
      "content": "James, do you by any chance have a piece of text at hand which we could use to make testings about your interesting issue?\n\n"
    },
    {
      "time": "19 Feb 2013 — 11:32am",
      "content": "Try this:\n\n> The Waste Land\n> \n> by T.S. Eliot\n> \n> \"Nam Sibyllam quidem Cumis ego ipse oculis meis vidi  \n> in ampulla pendere, et cum illi pueri dicerent: Σιβυλλα  \n> τι θελεις; respondebat illa: αποθανειν θελω.\"\n> \n> For Ezra Pound  \n> il miglior fabbro.\n> \n> I. The Burial of the Dead\n> \n> April is the cruellest month, breeding  \n> Lilacs out of the dead land, mixing  \n> Memory and desire, stirring  \n> Dull roots with spring rain…\n"
    },
    {
      "time": "19 Feb 2013 — 12:02pm",
      "content": "Here's a less lyrical one, and with Armenian, not Greek or Cyrillic:  \n\"  \nHowever in the Armenian text all surnames are subjected to the conventions of the reformed Eastern spelling (for example Փափազյան instead of the correct Փափազեան).  \n\"  \nFor one thing, do you really want that ն to be in \"Italics\" fighting with the closing parenthesis?\n\nhhp\n\n"
    },
    {
      "time": "19 Feb 2013 — 12:35pm",
      "content": "Here’s a short example from some of my text.\n\n> Similar in meaning to Hebrew אָמֵן _ʔāmēn_ and hence Greek ἀμήν _amḗn_ and Russian ами́нь _amínʼ_ (the Russian reflecting shift of Greek η _ē_ to _i_), though not actually used in translations of religious materials.\n\nHere’s another longer example with only Cyrillic.\n\n> The scientific names all come from Russian, and were originally given by Johann Julius Walbaum during his time in the Russian Far East. The name _O. tshawytscha_ is from Russian чавы́ча /tɕaˈvɨtɕa/ which is itself from Itelʼmen _čevičev_. _O. nerka_ is in Russian не́рка /ˈnʲerka/, but in Siberian dialects ня́рка /ˈnʲarka/, and which appears to be from Proto-Samoyedic _\\*nʸʌrkə_, compare Nganasan _nʸorə_. _O. kisutch_ is Russian ки́жуч /ˈkʲiʐutɕ/ but in Siberian dialects ки́зуч /ˈkʲizutɕ/, coming from Itelʼmen _kizuez_; the dialectal form is the source of the scientific name. _O. keta_ is particularly interesting: in Russian it is ке́та /ˈkʲeta/ but this is again not native; rather, the source is probably Evenki _keːta_ ‘_O. keta_’ or perhaps Even _qæta_ ‘dead salmon after spawning’ (unrelatedly, Tlingit also has _xein_ /xeːn/ ‘spawned-out salmon’ \\< Pre-Tlingit _\\*xaʰyn_, cognate with Eyak _xaːnih_; also cf. PA _\\*xʸaːn_ ‘old age’, cognate with Tlingit _shaan_ /ʃaːn/ ‘old, elderly’ \\< Pre-Tlingit _\\*šaʰn_) both of which are themselves probably from Chukchi-Koryak, e.g. Chukchi _qetaqet_ ‘_O. keta_’. The Russian for O. gorbuscha is simply горбу́ша /gorˈbuʂa/ derived from горб /gorb/ ‘hump’ and describing the pronounced hump that develops on the backs of males during spawning.\n\nOf course this looks unpleasant here because Georgia doesn’t have all the appropriate characters and browsers substitute various fonts badly.\n\n"
    },
    {
      "time": "19 Feb 2013 — 1:28pm",
      "content": "In the short example, putting the non-Latin script in upright form, and the pronunciation in italic, works very well.\n\n"
    },
    {
      "time": "19 Feb 2013 — 1:50pm",
      "content": "James, I think both criteria are plausible. But in linguistic texts, you handle several groups of information: the contemporary form of a word, variations through time, its ancient form and pronunciation, loan originals, non-Latin roots and so on. From a practical point of view, I would use regular Greek and Cyrillic as the general rule and reserve their italic styles to specific groups (as pronunciation or an ancient form). Hence, you have one more option to distinguish things.\n\n"
    },
    {
      "time": "19 Feb 2013 — 2:01pm",
      "content": "\\> … this looks unpleasant here because Georgia doesn’t have all the appropriate characters and browsers substitute various fonts badly.\n\nWell, on my screen (Mac, Firefox) it doesn’t look all that badly.  \nHowever, lets have a look on it with another font:\n\n ![](http://web.archive.org/web/20130819200844im_/http:/typophile.com/files/andron_LGK_jcrippen_1_5411.png)\n  \n.  \n\n ![](http://web.archive.org/web/20130819200844im_/http:/typophile.com/files/andron_LGK_jcrippen_2_5742.png)\n  \n.  \n\n ![](http://web.archive.org/web/20130819200844im_/http:/typophile.com/files/andron_LGK_jcrippen_3_5929.png)\n  \n.  \n\n ![](http://web.archive.org/web/20130819200844im_/http:/typophile.com/files/andron_LGK_jcrippen_4_6087.png)\n  \n.  \n(I’d say there are some spacing issues to be fixed…). \n"
    },
    {
      "time": "20 Feb 2013 — 11:38am",
      "content": "Given that your text involves systematic use of Latin italics for phonetic notation, I would say do not italicise the Greek and Cyrillic. Where you have a sequence like this 'Russian ами́нь _amín_', I'd say it is more important to distinguish the Russian words from the italicised Latin pronunciation than to further visually distinguish the Cyrillic from the Latin.\n\n"
    }
  ]
}
