{
  "id": "100609",
  "title": "Identify typewriter 1953-1955 from number font attached.",
  "forum": "Design",
  "tags": [
    "Identifyl typewrite",
    "Design"
  ],
  "content": "Can you help me? Sample of typing shows only a few letters and numbers ... I cannot find a number typeface online that matches this example.\n\n ![](http://web.archive.org/web/20130819142842im_/http:/typophile.com/files/TYPEWRITEscan0001_5630.jpg)\n\n",
  "author": "RusskieRuss",
  "time": "17 Feb 2013 — 11:40am",
  "uid": "209011",
  "comments": [
    {
      "time": "17 Feb 2013 — 2:44pm",
      "content": "To clarify — are you trying to determine what model of typewriter was used to type this, or are you looking for a digital font that looks similar? Is that the best image you have?\n\n"
    },
    {
      "time": "18 Feb 2013 — 7:31am",
      "content": "Russ, welcome to Typophile. You'll find that most users of this site are happy to help a fellow professional (or non-professional) tackle a creative problem. On other hand, most of us are wary of providing litigation support without compensation, and without even knowing whether we're witnesses for the plaintiff or the defendant. I think you'll get more helpful responses if you share a bit of why you need to identify these letters.\n\n"
    },
    {
      "time": "18 Feb 2013 — 7:35am",
      "content": "Good nose, Victor.\n\nAnd if you want the expert on \"forensic typography\", Thomas Phinney is your man.\n\nhhp\n\n"
    },
    {
      "time": "18 Feb 2013 — 6:21pm",
      "content": "I wouldn't have any particular qualms about helping you if I could, but the image is so fuzzy and pixelated, and the text so short, that narrowing it down to a specific model seems nearly impossible.\n\nWhen do you think this document was typed? Is there a particular machine that you're trying to prove could or could not have typed it?\n\nAnd, yes, letting us know what this is all about might help — not only to put our consciences at ease, but also to help us look at your question from the right direction.\n\n"
    },
    {
      "time": "18 Feb 2013 — 7:42pm",
      "content": "The closest I've been able to find are:\n\n1) A font based on the Splendid Olympia Typewriter, named [Splendid 66](http://web.archive.org/web/20130819142842/http:/www.dafont.com/splendid66.font). The unique combination of that particular '5' and the open '4' tends to eliminate most candidates.\n\nand, not as close,\n\n2) [Royal 200 typewriter](http://web.archive.org/web/20130819142842/http:/www.dafont.com/typewriter-royal-20.font). There's a current digital font by \"Mr. Fisk\" named Typewriter Royal 200 .\n\nThe text (Jan and Apr) in your image is too garbled to be of any use.\n\n- Herb\n\n"
    },
    {
      "time": "19 Feb 2013 — 9:36am",
      "content": "\\> most of us are wary of providing litigation  \n\\> support without compensation\n\nI could see opinions posted here being used to guide a lawyer's thinking about a case, but its unlikely that they'd be submitted as evidence in a trial. A lawyer would need to present the poster's credentials to establish them as an expert witness, plus these posts are not made under oath, and the poster cannot be cross-examined.\n\nA member of my family frequently works as an expert witness and it's a gruelling process, done under oath, and his opinions are always challenged and must be defended.\n\n"
    }
  ]
}
