{
  "id": "100672",
  "title": "Color Of Body Text",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "is there guidance for the use of color for body text?\n\nin Stop Stealing Sheep, Spiekermann uses red for type in the sidebars. i believe the thinking goes, it's ok to use pure hues when there's only a small amount of text.\n\ndoing testing, contrast is important -- if there's not enough, it's hard to read, thus black on white is good for this reason.\n\nBut is black on white an artefact of the printing press? color paper being more expensive, so white -- or off-white -- paper is often used for cost reasons?\n\nthe Financial Times is counter to this. they print on salmon pink stock, with black text. and it needs to be readable -- there's dense information with stock prices.\n\nModernist posters are another example, with an array of colors: both text and background. but this is a different situation. it's larger display type. i'm thinking specifically for long form writing, blog posts, books, and magazines.\n\n",
  "author": "Chris Hunt",
  "time": "19 Feb 2013 — 4:54am",
  "uid": "39800",
  "comments": [
    {
      "time": "19 Feb 2013 — 6:32am",
      "content": "I think it mostly comes down to contrast, and black on white is some of the highest contrast possible; one could argue for complementary colours providing more contrast but that’s a different kind of contrast, I think personally it’s mainly about light and dark, not colour v. colour even though human vision is so centred on colour.\n\nI’m reading a book at the moment where each chapter has a different colour for the title and some related text, many of the colours picked are strong enough that legibility even at around 14pt is fine but they went far too light in a few cases and it’s a struggle to read.\n\nA general observation I’ve made over the years: yellow text on white is rarely a good thing. It can work for headings, especially with a blocky face and a darker yellow, but a light yellow like a single pass of process yellow can make type that’s incredibly hard to see properly much less read.\n\n"
    },
    {
      "time": "19 Feb 2013 — 9:09am",
      "content": "i've noticed that about yellow, also.\n\n ![](http://web.archive.org/web/20141002201421im_/http:/typophile.com/files/yellow-on-white_4935.png)\n\nit looks ok on red.\n\n ![](http://web.archive.org/web/20141002201421im_/http:/typophile.com/files/yellow%20on%20red_6631.png)\n\nwhich for color theory follows the triad rule.\n\n ![](http://web.archive.org/web/20141002201421im_/http:/typophile.com/files/yellow%20triad_4561.png)\n\nreducing the saturation for Process Yellow makes it less dazzeling.\n\n ![](http://web.archive.org/web/20141002201421im_/http:/typophile.com/files/less%20saturation%20yellow%20on%20red_5074.png)\n\n"
    },
    {
      "time": "19 Feb 2013 — 10:07am",
      "content": "\\> i'm thinking specifically for long form  \n\\> writing, blog posts, books, and magazines.\n\nThere are many factors that go into good design, and readability is only one of them. Otherwise we'd always use the easiest-to-read fonts and discard the rest. But in long-form documents, readability becomes a higher priority. I think putting a few paragraphs in reversed type (like white type on a colored background) is fine, or maybe even a whole page that way in a magazine article, but I wouldn't advise a whole book done that way. However I've seen blogs done that way that looked fine, but in those you're reading in smaller chunks.\n\nVery low contrast combinations, like yellow on white, are generally hard to read, although it might work for a large headline.\n\nIt's important to consider the age of the target audience, as vision generally gets worse as we age. I wouldn't use tiny type or hard-to-read color combinations in an article aimed at seniors, but I might consider it for an article written for young folks.\n\n"
    },
    {
      "time": "19 Feb 2013 — 10:08am",
      "content": "I think there's a case to be made for staying a back from maximum contrast, especially for onscreen work.\n\nhhp\n\n"
    },
    {
      "time": "19 Feb 2013 — 10:51am",
      "content": "\"There are many factors that go into good design, and readability is only one of them. Otherwise we'd always use the easiest-to-read fonts and discard the rest. But in long-form documents, readability becomes a higher priority.\"\n\nagreed. that's why i'm focusing on long form, blog posts, books, and magazines here. As an example, Found Typography may be well designed, but it's not the most readable.\n\n![](http://web.archive.org/web/20141002201421im_/http:/24.media.tumblr.com/tumblr_l15ljyKCn01qzyqwlo1_500.jpg)\n\n\" I think putting a few paragraphs in reversed type (like white type on a colored background) is fine, or maybe even a whole page that way in a magazine article, but I wouldn't advise page after page done that way.\"\n\na good example of reverse type is in this article: [http://ilovetypography.com/2013/01/12/a-firm-turn-toward-the-objective-j...](http://web.archive.org/web/20141002201421/http:/ilovetypography.com/2013/01/12/a-firm-turn-toward-the-objective-josef-muller-brockmann-1948-1981/ \"http://ilovetypography.com/2013/01/12/a-firm-turn-toward-the-objective-josef-muller-brockmann-1948-1981/\")\n\n\"Very low contrast combinations, like yellow on white, are generally hard to read, although it might work for a large headline.\"\n\nthe headline below certainly looks darker than the body text.\n\n![](http://web.archive.org/web/20141002201421im_/http:/typophile.com/files/yellow-on-white_4935.png)\n\n\"It's important to consider the age of the target audience, as vision generally gets worse as we age. I wouldn't use tiny type or hard-to-read color combinations in an article aimed at seniors, but I might consider it for an article written for young folks.\"\n\nthat's a great point.\n\non the other hand, i've seen enough hard-to-read text, particularly on the web, to make me err on the side of readability as a fanatical default.\n\ni wrote a bookmarklet in javascript which changes body text to 16px/24px, because of this.\n\n"
    },
    {
      "time": "19 Feb 2013 — 10:53am",
      "content": "\"There are many factors that go into good design, and readability is only one of them. Otherwise we'd always use the easiest-to-read fonts and discard the rest. But in long-form documents, readability becomes a higher priority.\"\n\nagreed. that's why i'm focusing on long form, blog posts, books, and magazines here. As an example, Found Typography may be well designed, but it's not the most readable.\n\n![](http://web.archive.org/web/20141002201421im_/http:/24.media.tumblr.com/tumblr_l15ljyKCn01qzyqwlo1_500.jpg)\n\n\" I think putting a few paragraphs in reversed type (like white type on a colored background) is fine, or maybe even a whole page that way in a magazine article, but I wouldn't advise page after page done that way.\"\n\na good example of reverse type is in this article: can't link to it because of the spam filter. it's called, \"A Firm Turn Toward the Objective: Josef Müller-Brockmann 1948–1981\"\n\n\"Very low contrast combinations, like yellow on white, are generally hard to read, although it might work for a large headline.\"\n\nthe headline below certainly looks darker than the body text.\n\n![](http://web.archive.org/web/20141002201421im_/http:/typophile.com/files/yellow-on-white_4935.png)\n\n\"It's important to consider the age of the target audience, as vision generally gets worse as we age. I wouldn't use tiny type or hard-to-read color combinations in an article aimed at seniors, but I might consider it for an article written for young folks.\"\n\nthat's a great point.\n\non the other hand, i've seen enough hard-to-read text, particularly on the web, to make me err on the side of readability as a fanatical default.\n\ni wrote a bookmarklet in javascript which changes body text to 16px/24px, because of this.\n\n"
    },
    {
      "time": "19 Feb 2013 — 11:27am",
      "content": "_…it's ok to use pure hues when there's only a small amount of text._\n\nThink solid spot color, rather than process or screened, which reduce the sharpness of type.\n\n"
    },
    {
      "time": "19 Feb 2013 — 3:25pm",
      "content": "\"I think there's a case to be made for staying a back from maximum contrast, especially for onscreen work.\"\n\nnot using maximum contrast?\n\ni've heard it said contrast should be at least 80%. are you saying contrast shouldn't be 100%?\n\nis this just with color, or black and white text, as well?\n\n"
    },
    {
      "time": "19 Feb 2013 — 3:36pm",
      "content": "\"Think solid spot color, rather than process or screened, which reduce the sharpness of type.\"\n\ndoes this have the implication that colored text should be used more sparingly when done with process color and on screen, as it's less sharp compared to black?\n\n"
    },
    {
      "time": "19 Feb 2013 — 3:44pm",
      "content": "Well, 100% contrast can only exist between total light (pure white) and total darkness (pure black), neither of which exists. What I was talking about is that historically people haven't had enough contrast (especially concerning the whiteness of the paper\\*) so more was always better; but I think these days we might in fact have too much contrast sometimes. So on screen using a dark gray for the text or a very light gray (or tint) for the background might be beneficial.\n\n\\* Which for example motivated Baskerville to make his special paper.\n\nhhp\n\n"
    },
    {
      "time": "19 Feb 2013 — 4:18pm",
      "content": "\"I think it mostly comes down to contrast, and black on white is some of the highest contrast possible; one could argue for complementary colours providing more contrast but that’s a different kind of contrast, I think personally it’s mainly about light and dark, not colour v. colour even though human vision is so centred on colour.\"\n\nthis is what process yellow on white looks like, when converted to grayscale. not very readable.\n\n ![](http://web.archive.org/web/20141002201421im_/http:/typophile.com/files/g-yellow-on-white_4935_5963.jpg)\n\nhere's yellow on blue. first before grayscale, then after. readable.\n\n ![](http://web.archive.org/web/20141002201421im_/http:/typophile.com/files/blue-yellow_3857.png)\n  \n\n ![](http://web.archive.org/web/20141002201421im_/http:/typophile.com/files/g-yellow-on-blue_4684.jpg)\n\nhere's green on red. first before grayscale, then after. way less readable than yellow on blue.\n\n ![](http://web.archive.org/web/20141002201421im_/http:/typophile.com/files/red-green_6644.png)\n  \n\n ![](http://web.archive.org/web/20141002201421im_/http:/typophile.com/files/g-green-on-red_5683.jpg)\n\ngrayscale can be used as a test for the color blind.\n\nand, looking at these, a test for readability when color is used.\n\n"
    },
    {
      "time": "19 Feb 2013 — 5:06pm",
      "content": "If you're going to reverse out the type, I'd made the type white or a very light color. So in your yellow/blue test I'd make the yellow much lighter. Same thing with your gold/red test. Will be more attractive and more readable.\n\n\\> does this have the implication that colored text should  \n\\> be used more sparingly when done with process color [on the web]...\n\nNick was exactly right that using spot colors on printed materials will give superior results rather than using screen tints. (So for example gray type would ideally be printed with solid gray ink, rather than as a screen tint of black.) But when type is viewed on a computer monitor you're working with a totally different process, and its simply not going to be a sharp as text from a printing press. You just need to look at it onscreen and use your own judgement.\n\n"
    },
    {
      "time": "19 Feb 2013 — 8:45pm",
      "content": "Do be aware of the colour-independent contrast between fore and background. Don't rely on hue alone to distinguish them.\n\nI used to work on UI design with someone who was partially colour-blind; many combinations which looked perfectly distinct to me were virtually monotone to him. I got into the habit of testing my designs by taking screen captures and converting them to greyscale to see if readability suffered.\n\n"
    },
    {
      "time": "19 Feb 2013 — 11:12pm",
      "content": "_…does this have the implication that colored text should be used more sparingly when done with process color and on screen, as it's less sharp compared to black?_\n\nIn print, it depends whether it’s screened.  \nThe worst is a beige with middle values of C and M. Those colors will have ragged edges in type, and if the registration is not bang on, even fuzzier.  \nBut colors that are mostly C, M or K, with a touch of Y, are most sharp.\n\n100% Magenta or Cyan can be very nice in a Light type.\n\n"
    },
    {
      "time": "20 Feb 2013 — 4:13am",
      "content": "\"If you're going to reverse out the type, I'd made the type white or a very light color. So in your yellow/blue test I'd make the yellow much lighter. Same thing with your gold/red test. Will be more attractive and more readable.\"\n\nin this case, attractiveness is unimportant. it's the principle i was concerned with.\n\ni also used the default typeface: Arial.\n\n"
    },
    {
      "time": "20 Feb 2013 — 4:22am",
      "content": "\"Do be aware of the colour-independent contrast between fore and background. Don't rely on hue alone to distinguish them.\"\n\nredundancy's important. it can be seen in everyday things; such as traffic lights.\n\n\"I used to work on UI design with someone who was partially colour-blind; many combinations which looked perfectly distinct to me were virtually monotone to him. I got into the habit of testing my designs by taking screen captures and converting them to greyscale to see if readability suffered.\"\n\nyes. i'll be doing it for every UI i design, from here on out.\n\n"
    },
    {
      "time": "20 Feb 2013 — 4:28am",
      "content": "\"So on screen using a dark gray for the text or a very light gray (or tint) for the background might be beneficial.\"\n\ndark gray text is common. not seen the background changed very often, but it makes sense that it achieves the same effect, i.e. reduces contrast.\n\n"
    },
    {
      "time": "20 Feb 2013 — 4:49am",
      "content": "\"100% Magenta or Cyan can be very nice in a Light type.\"\n\ni'll keep an eye out for that.\n\n"
    },
    {
      "time": "20 Feb 2013 — 6:04am",
      "content": "Hrant \"I think there's a case to be made for staying a back from maximum contrast, especially for onscreen work.\"\n\nYou can't explain.\n\n"
    },
    {
      "time": "20 Feb 2013 — 6:33am",
      "content": "Do you mean I'm wrong or just inept? :-)\n\nhhp\n\n"
    },
    {
      "time": "20 Feb 2013 — 6:36am",
      "content": "\\>You can't explain.\n\nI don’t think you need to, anyone who is working with text to appear on screen or, even worse, projected, surely only has to look at the results to draw that conclusion.\n\nRather than a white background, a pale tinted background (on screen) can be the equivalent to printing on uncoated stock.\n\nTim\n\n"
    },
    {
      "time": "20 Feb 2013 — 8:45am",
      "content": "\\>\\> Will be more attractive and more readable  \n\\> in this case, attractiveness is unimportant\n\nOkay, but it'll be easier to read if the text is lighter.\n\n ![](http://web.archive.org/web/20141002201421im_/http:/typophile.com/files/colortest2_5177.jpg)\n\n"
    },
    {
      "time": "20 Feb 2013 — 1:22pm",
      "content": "80% contrast ( [light reflectance value](http://web.archive.org/web/20141002201421/http:/www.rowmark.com/MARK/techhelpdocs/ADA%20color%20contrast%20charts/ada%20color%20contrast%20guides.asp))\n\nIt's my personal observation (bordering on sort of a feeling) that as your eye scans through a body of text, slight afterimages tend to distract and interfere with legibility. Less contrast reduces the effect.\n\n"
    },
    {
      "time": "20 Feb 2013 — 1:53pm",
      "content": "\"Okay, but it'll be easier to read if the text is lighter.\"\n\nit is. because of the contrast of value (light/dark). which was shown by removing the color.\n\n ![](http://web.archive.org/web/20141002201421im_/http:/typophile.com/files/colortest_5982.jpg)\n\nand it may be easier to read if i used a different color combinations, or a different line height, or measure, or typeface, or size, additional white space, aligned differently, saved the file differently, not used latin, or turned on ligatures, but for the purpose of testing what Gräfenberg said, i.e. it's light and dark that matters, the choices were fairly arbitrary.\n\n"
    },
    {
      "time": "22 Feb 2013 — 1:03am",
      "content": "Try [this](http://web.archive.org/web/20141002201421/http:/snook.ca/technical/colour_contrast/colour.html).\n\n"
    }
  ]
}
