{
  "id": "100708",
  "title": "Hagmann Goes Uniwidth",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "So I just saw Sybille Hagmann's Axia typeface  \n [http://tinyurl.com/aoupbe9](http://web.archive.org/web/20150319115602/http:/tinyurl.com/aoupbe9 \"http://tinyurl.com/aoupbe9\")  \nand one notable thing is that both Roman and Italic in all four weights (plus two stencil styles) are what I call uniwidth, meaning a given glyph is the same set-width across the board. I'm a fan of that sort of thing, but I thought that beyond a narrow range of color it backfires (based on my work on Patria, where I made the Regular and Demi uniwidth, but resorted to what I call \"fixed-offset\"\\* for the Light and Bold\\*\\*). Any opinions from users or observers welcome.\n\n\\* Which is where two fonts become uniwidth when a certain tracking value is applied.\n\n\\*\\* Which is even pretty light for a Bold.\n\nhhp\n\n",
  "author": "hrant",
  "time": "20 Feb 2013 — 8:47am",
  "uid": "1250",
  "comments": [
    {
      "time": "20 Feb 2013 — 11:36am",
      "content": "That’s what i have done with [Mantika Sans](http://web.archive.org/web/20150319115602/http:/typematters.de/tmt_MS.html), by the by. Consistent width across four weights.  \nWhich is not possible within the Cyrillic script due to some different italic forms, but possible in Latin and Greek.\n\n"
    },
    {
      "time": "21 Feb 2013 — 6:18pm",
      "content": "Linotype Office Alliance set of fonts\\* and Asap by Omnibus Type also have the same feature.\n\n\\* Metro Office, Neuzeit Office, Times Europa Office and Trump Mediaeval Office\n\n"
    },
    {
      "time": "21 Feb 2013 — 11:20pm",
      "content": "As well as Mantika Sans, except for the Cyrillic script due to the different italic forms.\n\n"
    },
    {
      "time": "22 Feb 2013 — 3:28am",
      "content": "Ah. You don't mean monospaced, you mean like Linotype.\n\n"
    },
    {
      "time": "24 Feb 2013 — 9:08pm",
      "content": "Pablo, Jürgen, I'm embarrassed to say I didn't know about those being uniwidth! Thank you.\n\nLinotype has a nice history of \"normalization\" (e.g. Compatil) and Kobayashi is a major talent so I'm sure they did a good job with those. However Axia's weight range (from Light to Black) is a good deal bigger than those (as well as Asap's and Mantika's), which is why I wonder how well it works. In my experience the _widths_ of the \"outlying\" weights have to strain too much to accommodate being uniwidth; the Light becomes too wide, and the Black too narrow. But maybe I'm missing something.\n\n> you mean like Linotype\n\nIf you mean the 18-unit (or later 54-unit) system, not that either; what I mean is that the \"a\" for example is the same set width in any weight/style. Or maybe you meant Linotype's \"duplexing\", where the Italic glyphs matched the set widths of the Roman ones; that's closer, but nothing to do with _weight_ throwing a wrench in it.\n\nhhp\n\n"
    },
    {
      "time": "24 Feb 2013 — 9:27pm",
      "content": "In some cases a bold, rather than an italic, was duplexed with the roman in Linotype matrices.\n\n"
    },
    {
      "time": "24 Feb 2013 — 9:40pm",
      "content": "Ah, good to know. In those cases were the Italics also duplexed? Or was there only room/need for two at a time?\n\nhhp\n\n"
    },
    {
      "time": "24 Feb 2013 — 9:54pm",
      "content": "There was only room for two faces on a mat as far as I know. But in some cases both a weight difference and an italic of the same typeface might be offered as the alternate in two different sets of matrices--so for example you could get Memphis Medium duplexed with its Italic, or you could get Memphis Medium duplexed with Memphis Bold. So they'd all share advance widths.\n\n"
    },
    {
      "time": "25 Feb 2013 — 5:22am",
      "content": "> But in some cases both a weight difference and an italic of the same typeface might be offered as the alternate in two different sets of matrices [.&nbsp;.&nbsp;.] So they'd all share advance widths.\n\nA fact still in evidence in some of the digitizations — Sabon, for example:\n\n ![](http://web.archive.org/web/20150319115602im_/http:/typophile.com/files/Sabon-widths_3484.png)\n\n"
    },
    {
      "time": "5 May 2013 — 7:14am",
      "content": "BTW, just to link things up, here's an older related thread, with links to others too:  \n [http://www.typophile.com/node/61252](http://web.archive.org/web/20150319115602/http:/www.typophile.com/node/61252 \"http://www.typophile.com/node/61252\")\n\nhhp\n\n"
    },
    {
      "time": "31 May 2014 — 11:20am",
      "content": "[Else](http://web.archive.org/web/20150319115602/http:/www.myfonts.com/fonts/adobe/else-npl/)\n\n"
    },
    {
      "time": "31 May 2014 — 11:24am",
      "content": "Ah, good one.\n\nhhp\n\n"
    },
    {
      "time": "1 Jun 2014 — 12:23pm",
      "content": "Just to add to the list: Delicious ( [http://www.exljbris.com/delicious.html](http://web.archive.org/web/20150319115602/http:/www.exljbris.com/delicious.html \"http://www.exljbris.com/delicious.html\")).\n\n"
    }
  ]
}
