{
  "id": "100713",
  "title": "When to use an acroynm in logo design",
  "forum": "Design",
  "tags": [
    "acroynm",
    "Company Logo",
    "five word logo design",
    "Identity Design",
    "long company name",
    "Design"
  ],
  "content": "Hello,  \nCreative Director here tasked with coming up with a logo for a very long newly merged company. The company name is North American Home Furnishings Association- do you go with an acronym NAHFA? Or do you attempt something with the entire name spelled out? Or both? All of the companies involved in the new company previously had some sort of acronym in their logos, NHFA, HFIA, WHFA.\n\nAnd if designing using acronym - any design tips for something long and awkward?\n\n",
  "author": "tilleymonster",
  "time": "20 Feb 2013 — 1:51pm",
  "uid": "209114",
  "comments": [
    {
      "time": "20 Feb 2013 — 1:59pm",
      "content": "Change the name of the company. It's no longer Merril Lynch, Pierce, Fenner and Beane ... or even International Business Machines ... shorter is better. After a year or two the old names that are fit into the new name no longer are important.\n\n"
    },
    {
      "time": "20 Feb 2013 — 3:18pm",
      "content": "1) A logo does not have to be readable text!  \n2) You can certainly use an acronym, except if it might be confused for something else.  \n3) Maybe emulate Yves Saint Laurent  \n [http://www.yourlogoresources.com/wp-content/uploads/2012/02/yves-saint-l...](http://web.archive.org/web/20150307184906/http:/www.yourlogoresources.com/wp-content/uploads/2012/02/yves-saint-laurent-logo.jpg \"http://www.yourlogoresources.com/wp-content/uploads/2012/02/yves-saint-laurent-logo.jpg\")  \nbut certainly not Price Waterhouse Coopers.  \n [http://www.ideaconnection.com/docs/2098/pwc-logo.jpg](http://web.archive.org/web/20150307184906/http:/www.ideaconnection.com/docs/2098/pwc-logo.jpg \"http://www.ideaconnection.com/docs/2098/pwc-logo.jpg\")\n\nhhp\n\n"
    },
    {
      "time": "20 Feb 2013 — 4:08pm",
      "content": "I agree completely tried to get the board to approve The Furnishings Association, but was voted down. Crazy impossible to design anything decent with a five letter senseless acronym  \n.\n\n"
    },
    {
      "time": "20 Feb 2013 — 4:11pm",
      "content": "hrant thanks for the insight- I like the direction\n\n"
    },
    {
      "time": "20 Feb 2013 — 4:20pm",
      "content": "What would Herb Lubalin have done?\n\n"
    },
    {
      "time": "20 Feb 2013 — 5:51pm",
      "content": "One other approach would be to create a _texture_ with the complexity: use all that text to fill out a shape. See the amazing Unilever logo for what I mean.\n\nhhp\n\n"
    },
    {
      "time": "20 Feb 2013 — 6:29pm",
      "content": "\\> Crazy impossible to design anything decent  \n\\> with a five letter senseless acronym\n\nSorry but I've got to disagree with you. \"CBS\" is an acronym, but that didn't stop them from having a great logo. Other acronym companies include ABC, NBC, KFC, AT&T, NASA, and a gazillion others, and many of them have excellent logos.\n\nCome up with an elegant symbol that graphically represents what the organization does. (Yeah, I know, easier said than done. :)\n\nSince \"NAHFA\" is an unfamiliar acronym to the general public, you'll probably need to spell out the full name in small type below or beside the logo. I'd suggest breaking the long name into multiple lines, and maybe you can get away with abbreviating \"association\".\n\nAs for the symbol itself, I'd start with research and make a collection of logos (both good and bad) from other organizations in similar lines of business. Obviously you don't want to copy anyone, but it may help give you ideas, help you see what works and what doesn't, and will help to prevent you from accidentally coming too close to an existing logo.\n\n"
    },
    {
      "time": "21 Feb 2013 — 3:49am",
      "content": "\"Sorry but I've got to disagree with you. \"CBS\" is an acronym, but that didn't stop them from having a great logo\"\n\nbecause it's a five letter acronym, not just an acronym.\n\nthe first thing i would think is to use a san serif, to reduce the complexity.\n\nthen be further reductive, by reducing, and joining the letter forms. a bit like the old nasa logo.\n\n"
    },
    {
      "time": "21 Feb 2013 — 10:02am",
      "content": "Five letters isn't a long name, and it's no more senseless (to use the OP's term) than many other company acronym names.\n\nGEICO — Government Employees Insurance Company  \nAFLAC — American Family Life Assurance Company  \nQUANTAS — Queensland and Northern Territory Aerial Services\n\nAnd in fact, some companies use names that are totally made-up or are deliberately misspelled. For example, \"Google\" is a deliberate misspelling of \"Googol\", and for all practical purposes is a nonsense word, but things have worked out pretty well for them.\n\nI know it can be easier if the company name is more descriptive, but I'm just saying that lots of companies face this challenge.\n\n"
    },
    {
      "time": "21 Feb 2013 — 10:18am",
      "content": "This is the direction I have been trying, and breaking up the name into two sections, North American, followed underneath by Home Furnishings Association. Using simple font such as Helvetica Neue or AvantGarde. Still blocky and busy, but I do agree with your suggestion...\n\n"
    },
    {
      "time": "21 Feb 2013 — 3:02pm",
      "content": "here's a five letter acronym done by Rand for the IIT Research Institute.\n\n ![](http://web.archive.org/web/20150307184906im_/http:/typophile.com/files/iitri-logo_5651.gif)\n\n"
    },
    {
      "time": "22 Feb 2013 — 6:54am",
      "content": "Maybe it would be helpful to step back and re-frame the problem. Instead of asking \"how can I deal with the length of this name aesthetically?\" ask yourself \"how can I communicate the identity of this organization in a way that is effective for the target audience?\" An effective solution will depend a lot more on the impression you are trying to make than on some universal idea of what looks nice. Ask the visionaries in the company why the name must be exactly that to effectively communicate who they are.\n\nAs for acronyms in general, unless they spell something memorable (but not necessarily a real word), you can always throw a bunch of money into marketing to make it remembered. The trouble usually comes when companies don't have the budget, marketing team, or insight to make this work. I think Paul Rand has more insight into this than Lubalin. But remember that he worked with huge corporations who assumed they would spend millions on marketing to make their brand recognizable. So he said:\n\n“It is only by association with a product, a service, a business, or a corporation that a logo takes on any real meaning. It derives its meaning and usefulness from the quality of that which it symbolizes.”\n\n“A logo is less important than the product it signifies; what it means is more important that what it looks like.”\n\n"
    },
    {
      "time": "22 Feb 2013 — 12:54pm",
      "content": "Quotes I would do well to remember, thank you for bringing it back to earth. I am glad I discovered this site, all of you who have illuminated my challenge with your wisdom have helped me grasp the direction I needed to get started.  \nThank you,  \nLisa\n\n"
    },
    {
      "time": "23 Feb 2013 — 8:37am",
      "content": "“A logo is less important than the product it signifies; what it means is more important that what it looks like.”\n\ni like this quote. he often talked about form & content. content being the idea.\n\n"
    }
  ]
}
