{
  "id": "100760",
  "title": "Type foundries offering iOS embeddable fonts?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "ios",
    "mobile",
    "software"
  ],
  "content": "Hello everyone - first post here.\n\nI was wondering if anyone had a list of Type foundries offering iOS embeddable fonts? I've been doing alot of research lately on fonts and applications and there is so much mixed information out there on the licenses. I design a good amount of apps and want to make sure I'm giving the foundries their credit.\n\nI'd be interested in creating a list here for paid, open source, etc in iOS fonts?\n\nThanks.\n\n",
  "author": "chrisgillis",
  "time": "22 Feb 2013 — 6:31am",
  "uid": "209180",
  "comments": [
    {
      "time": "22 Feb 2013 — 7:39am",
      "content": "So here is one option - [http://www.mobilefontfonts.com](http://web.archive.org/web/20141012030920/http:/www.mobilefontfonts.com/ \"http://www.mobilefontfonts.com\") - about $179-$239 a license for a full app per font.\n\n"
    },
    {
      "time": "22 Feb 2013 — 7:51am",
      "content": "We do: [www.monokrom.no](http://web.archive.org/web/20141012030920/http:/www.monokrom.no/ \"www.monokrom.no\")\n\n"
    },
    {
      "time": "22 Feb 2013 — 8:10am",
      "content": "Most foundries will offer it and create an individual quote for a certain project. Therefore a simple list will be hard to compile.\n\n"
    },
    {
      "time": "22 Feb 2013 — 8:28am",
      "content": "Thanks for the thoughts Ralf H. - try Googling 'fonts to be embedded in iOS apps' and you'll get alot of different views on this including some complete disregards for the type designer - I thought making a list might help that out.\n\nI'm still trying to figure out if fonts on Google fonts are available for iOS - getting nowhere.\n\nTypekit just got back to me - \" Typekit is only licensed for web use; to embed in an app you'll need to purchase license from the foundry.\" - says nothing about that on their site. No one is really tackling this but I see a huge opportunity for Type designers.\n\nI don't know but this thread may serve a nice purpose if we can get it ranked up high enough on search.\n\n"
    },
    {
      "time": "22 Feb 2013 — 8:53am",
      "content": "> I'm still trying to figure out if fonts on Google fonts are available for iOS - getting nowhere.\n\nYes, they are. They are Libre fonts. You are free to do pretty much anything you want, except reselling the fonts by itself\n\n"
    },
    {
      "time": "22 Feb 2013 — 9:23am",
      "content": "<cite>different views on this including some complete disregards for the type designer </cite>\n\nWhat does that mean?\n\nIt's very simple: Embedding software in an app is “software distribution”. If you purchase a print license, you are allowed to use the font on local machines, not to distribute it with an app. Just as you are not allowed to distribute Dreamweaver, Xcode or whatever software tools you use to create your work. You have a license to use them, not to redistribute them. Not even in a “hidden” way, which is not directly usable by the user of the app.\n\nWebfont license are supposed to be called from web servers by browsers. You might call those fonts from a web server from within a web browser in your app, but you are not allowed to embed the font files in an app.\n\nOFL licenses are very liberal. You can do a lot with them, including app embedding.\n\n"
    },
    {
      "time": "22 Feb 2013 — 9:37am",
      "content": "Thanks for clearing that up Ralf.\n\nWhat was meant by the above is that the information is not clear at all and that the type designer may not be getting compensated - for example take a look at Font Squirrel - there's nothing on there about iOS apps but it says 100% free for commercial use. It's a very grey area although I know Apple is turning down apps without licenses.\n\nI'll get a blog post going also in the upcoming weeks and will include any Type Designers posting in here that are offering iOS embeddable fonts.\n\n"
    },
    {
      "time": "22 Feb 2013 — 9:49am",
      "content": "Font Squirrel is just a directory of free fonts. They don't license fonts. A user needs to check the individual EULAs or contact the designer.\n\n"
    },
    {
      "time": "23 Feb 2013 — 3:20am",
      "content": "> So here is one option - [http://www.mobilefontfonts.com](http://web.archive.org/web/20141012030920/http:/www.mobilefontfonts.com/ \"http://www.mobilefontfonts.com\") - about $179-$239 a license for a full app per font.\n\nThe price you quoted is not per font, but per set of 4 fonts.\n\n"
    },
    {
      "time": "23 Feb 2013 — 5:13am",
      "content": "fontspring have app licenses [http://www.fontspring.com/app-fonts](http://web.archive.org/web/20141012030920/http:/www.fontspring.com/app-fonts \"http://www.fontspring.com/app-fonts\")\n\nand here's some from fontshop [http://www.fontshop.com/fontlist/applications/mobile\\_fonts/](http://web.archive.org/web/20141012030920/http:/www.fontshop.com/fontlist/applications/mobile_fonts/ \"http://www.fontshop.com/fontlist/applications/mobile\\_fonts/\")\n\n"
    },
    {
      "time": "23 Feb 2013 — 2:34pm",
      "content": "And independent foundries are generally run by real human beings, most of with whom you can discuss and negotiate…\n\n"
    },
    {
      "time": "24 Feb 2013 — 6:29am",
      "content": "Sure, all Bold Monday fonts can be licensed for iOS apps. (In fact they can be licensed for anything. :)\n\nA real life example is [iA Writer](http://web.archive.org/web/20141012030920/http:/www.iawriter.com/) for iOS and OSX, that uses [Nitti](http://web.archive.org/web/20141012030920/http:/boldmonday.com/en/nitti/) as its main typeface.\n\nJust get in touch, and we are happy to discuss conditions and pricing.\n\n-Paul\n\n"
    },
    {
      "time": "24 Feb 2013 — 6:59am",
      "content": "Nitti! (What a great face!)\n\n"
    },
    {
      "time": "24 Feb 2013 — 9:35pm",
      "content": "Chris, although such a list would indeed be \"hard to compile\", it's certainly possible to do, and -even if it's not comprehensive- it would be quite helpful to many people. Please do share your results.\n\n> They are Libre fonts. You are free to do pretty much anything you want, except reselling the fonts by itself\n\nWith the exception of libre fonts under the Apache license (most notably Droid and Roboto) which do allow outright reselling.\n\n> Font Squirrel is just a directory of free fonts. They don't license fonts.\n\nWhich however is no liberation from ethical obligations.\n\nhhp\n\n"
    },
    {
      "time": "25 Feb 2013 — 12:51pm",
      "content": "[http://www.fontsquirrel.com/fonts/Crimson](http://web.archive.org/web/20141012030920/http:/www.fontsquirrel.com/fonts/Crimson \"http://www.fontsquirrel.com/fonts/Crimson\")\n\nhhp\n\n"
    }
  ]
}
