{
  "id": "100785",
  "title": "Kaiti SC",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "packaging",
    "PDF embedding",
    "restrictions on fonts"
  ],
  "content": "I am using Kaiti SC in InDesign. When I try to create a PDF or Package the finished product, I receive the error message saying the font could not be embedded due to licensing restrictions. The font is NOT restricted and can be embedded. I am using Mac with InDesign CS6. Any thoughts on a work around will be greatly appreciated as I have 78 pages of copy using this ttc. :(\n\n",
  "author": "dcinchina",
  "time": "23 Feb 2013 — 12:16am",
  "uid": "207292",
  "comments": [
    {
      "time": "23 Feb 2013 — 7:49am",
      "content": "How do you know the font is not restricted? What are the specific embedding bits set to in the fonts OS2 table?\n\nIf the font is set to no-embedding then you might want to contact Apple. If it is embeddable you probably want to check with Adobe. It's possible that there's something about the font that InDesign's PDF export doesn't like. Does it work with other TTCs?\n\n"
    },
    {
      "time": "23 Feb 2013 — 8:44am",
      "content": "FYI, on a relatively new mac, the version of Kaiti SC (8.0d1e2; 2012-06-20) (8,079 characters) which is part of OS X install is DEFINITELY RESTRICTED. However, when Creative Suite 6 is installed, Adobe installs \"5.016;ADBE;AdobeKaitiStd-Regular;ADOBE\" (30,610 characters) which IS NOT RESTRICTED. The only downside (I think) of the Adobe Creative Suite version is that Bold and Black weights are not provided (I am not familiar with Chinese characters, so I'm not sure whether this is important or not).\n\n"
    },
    {
      "time": "23 Feb 2013 — 10:22am",
      "content": "@oobimichael Why do say that this font is Restricted? In FontBook \\> Preview \\> Show Font Info \\> Embeddable it says Yes for all three weights.\n\n"
    },
    {
      "time": "23 Feb 2013 — 11:13am",
      "content": "Tom,\n\nHere is the metadata info I have here:  \nVersion: 8.0d1e2  \nCopyright: © 1991-1998, 2012 Changzhou SinoType Technology Co., Ltd. All rights reserved. 常州华文印刷新技术有限公司　版权所有  \nEmbedding Rights: Preview & Print Embedding not Allowed\n\nFor the hell of it, I converted the ttc to 3 separate OTFs with FontXChange, and before it would allow me to convert the fonts, the message generated by FontXChange:\n\n\"Permission Required:  \nThe font file 楷体.ttc contains a restricted license and cannot be converted without the permission of the legal owner...\"\n\nI bought this present MacBook Pro just a couple of months ago in the Netherlands... maybe EU requirements are different?\n\n"
    },
    {
      "time": "23 Feb 2013 — 11:26am",
      "content": "oobimichael -- does the Embeddable item in your Fontbook Show Font Info entry also say No? Perhaps Apple has messed this one up somehow.\n\n"
    },
    {
      "time": "23 Feb 2013 — 11:39am",
      "content": "aha... this might be the issue: I don't use fontbook (I haven't deinstalled, just don't use it). I use Monotype FontExplorer X Pro. FontExplorer says the font is restricted, but fontbook says \"Yes\" to being Embeddable... so there seems to be a discrepancy between how font management programs view specific fonts. Don't which one correct, though...\n\n"
    },
    {
      "time": "23 Feb 2013 — 2:13pm",
      "content": "I created a document in TextEdit with this font and saved it as PDF without problem. Adobe Reader says the font is embedded (subset). Odd that it would embed that way but throw up a warning in InDesign.\n\n"
    },
    {
      "time": "23 Feb 2013 — 9:29pm",
      "content": "Thanks guys for your comments and your time to investigate this issue.\n\nTom, I think you are right in that Apple has messed up with this one somehow because Font Book definitely says it is embeddable. It is very strange that you could create a PDF using TextEdit but InDesign refuses to embed it. I presume Adobe are more wary of copyright infringement and hence check into the metadata more thoroughly?\n\nOobimichael, I have an early 2012 MacBook Air bought in Malaysia, so it does not seem to be an EU specific issue. 'Black' and 'Bold' are an important part of my document, which is why Adobe's Creative Suit version of the font is not suitable for this project.\n\nIn doing some research online, it seems there is an Apple Thai font (Thonburi) that has caused similar problems.\n\nThis thread [http://m10lmac.blogspot.com/2007/11/os-x-105-leopard-fixing-thai.html](http://web.archive.org/web/20150420061530/http:/m10lmac.blogspot.com/2007/11/os-x-105-leopard-fixing-thai.html \"http://m10lmac.blogspot.com/2007/11/os-x-105-leopard-fixing-thai.html\") discusses the font and its problems.\n\nUnfortunately, I am in China and the Government blocks pretty much all blogs, so I cannot read what it says. :(\n\nAny ideas on where I might be able to source a similar font that can be embedded?\n\n"
    },
    {
      "time": "24 Feb 2013 — 9:15am",
      "content": "The Thai font issue from 6 years ago you reference was not connected with embedding, just a font which would not display anywhere.\n\nNormally I think the fonts provided by Apple with OS X are always embeddable, so perhaps in this case it is the metadata used by Adobe apps that was not changed as it should have been.\n\nIs there any way for you to use Apple apps like Pages or TextEdit for this project?\n\nI would also suggest searching/asking in the Adobe forums about this problem. Adobe apps should be able to use these fonts just like Apple apps do.\n\n"
    },
    {
      "time": "24 Feb 2013 — 10:14pm",
      "content": "Thanks again Tom.\n\nThe thread below cut from a 2009 post by Adove seems to address the issue from Adobe's view point.\n\nI have not used Pages or TextEdit. My 78 page document is at printing stage when I discovered this issue. I have substituted the troubled font(s) (bold & black included) just to get this out the door to the printers today.\n\nThanks again.\n\nDennis\n\n35. Dov Isaacs, Nov 16, 2009 12:42 PM in reply to wvperegrine Report  \nJeff,\n\n(1) There was absolutely no change in how InDesign (or any other Adobe application) embeds fonts between CS3 and CS4. In fact, InDesign has been very consistent in terms of what fonts it allows to be embedded in exported PDF files since InDesign 1.0!\n\n(2) There is a signficant difference between having a \"licensed font\" and a font for which the license permits embedding of the font within an output file such as PDF. Furthermore, there are differences between what the physical font file indicates are embedding restrictions and what may actually be provided in writing in the font's EULA (End User License Agreement). Thus, you may be \"licensed\" for a font, but that doesn't necessarily mean that your license permits embedding of such a font in another file. Note that these are not as you put it Adobe licensing agreements (see 4 below).\n\n(3) For TrueType and OpenType fonts, there are embedding privilege flags inside the font. These range from the most liberal embedding (allowing installation of such embedded fonts on a \"receiving\" system) to moderate restriction (editable - allows you to edit documents that have the embedded font) to further restrictive (preview and print - allows you only to display and print documents using the embedded font) to full restriction (no embedding of the font permitted). Adobe applications do honor those embedding privilege flags. Note that Type 1 fonts (in ancient times referred to as \"PostScript fonts\") do not have such embedding privilege flags and as such, we have no way of knowing the intent of the font supplier. Thus, such fonts are not restricted by Adobe applications in terms of embedding.\n\n(4) Just so that you understand the context of why Adobe abides by the embedding restriction flags inside of TrueType and OpenType fonts, please understand that this wasn't Adobe's effort at protecting Adobe's or anyone else's turf. All fonts that you may license from Adobe have at least \"preview and print\" embedding privileges; those fonts from Adobe that are of our own design provide the more liberal \"editable embedding\" privileges. Adobe has been very consistent in urging other font foundries not to put unreasonable barriers to font embedding in PDF files, but we cannot control the business practices of these other foundries. In fact, it was in response to lawsuits against Adobe by some of these other font foundries that we started enforcing embedding restrictions!\n\n(5) If all this isn't bad enough, even if a font does physically permit embedding, what really governs a font's legal status is the EULA. An OpenType or TrueType font may not physically indicate that a font may not be embedded, but if the EULA prohibits embedding, as the licensee you are legally bound to not embed such fonts in a PDF or any other type of file. Furthermore, some EULAs allow embedding, but the license provides that you must pay a royalty fee to the font foundry for each copy of the resultant PDF file that you distribute. Read your EULAs very carefully.\n\n(6) As I and others indicated earlier in this thread, there are indeed fonts distributed with operating systems and other applications that do have licensing restrictions. Sorry, but Adobe can't do anything about that!\n\n- Dov\n\n"
    },
    {
      "time": "25 Feb 2013 — 8:30am",
      "content": "Thanks, Dennis, very useful. Could you provide the url of that thread?\n\nTom\n\n"
    },
    {
      "time": "26 Feb 2013 — 12:30pm",
      "content": "This is the URL Tom;\n\n[http://forums.adobe.com/thread/455293](http://web.archive.org/web/20150420061530/http:/forums.adobe.com/thread/455293 \"http://forums.adobe.com/thread/455293\")\n\nThanks again for your input and time.\n\nDennis\n\n"
    },
    {
      "time": "27 Feb 2013 — 4:29am",
      "content": "\\*blink\\* \\*blink\\* Did they really say '_physical_ font file'?\n\n"
    },
    {
      "time": "27 Feb 2013 — 7:06am",
      "content": "Té, Dov Isaacs indeed did:\n\n> Furthermore, there are differences between what the physical font file indicates are embedding restrictions and what may actually be provided in writing in the font's EULA ..\n\nThe point is, _independent_ of the settings in the font file, you should really check the EULA. Which is in a different file. Or on a print-out. Or it's an URL.\n\n"
    },
    {
      "time": "27 Feb 2013 — 7:07am",
      "content": "Thanks for the link, Dennis. Interesting how a weirdly broken Apple Thai font generated such trouble. In any case, that one has been fixed for a while now I think.\n\n"
    },
    {
      "time": "28 Feb 2013 — 8:56pm",
      "content": "I think Apple needs to address the issue of providing fonts that say they are unrestricted when in fact they are.\n\n"
    },
    {
      "time": "1 Mar 2013 — 5:26am",
      "content": "Agreed. Ideally all fonts provided with the OS should be embeddable, as users are not much interested in checking this out whenever they use one. I think that has probably always been Apple's intention, but they have missed some. They could either upgrade their license or leave the restricted fonts out or put them in an optional install with a warning.\n\n"
    },
    {
      "time": "1 Mar 2013 — 9:59pm",
      "content": "I agree. I will notify them and hope they address it.\n\n"
    }
  ]
}
