{
  "id": "100759",
  "title": "Geometric Textura experiment",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "I recently stumbled upon some hand-painted blackletter capitals by Sasha Prood (in orange, towards the end of the sequence):\n\n[http://www.sashaprood.com/art/Scroll\\_Portfolio\\_02.jpg](http://web.archive.org/web/20150317234436/http:/www.sashaprood.com/art/Scroll_Portfolio_02.jpg \"http://www.sashaprood.com/art/Scroll\\_Portfolio\\_02.jpg\")\n\nThey inspired me to start experimenting with a very geometric approach to a textura font myself. In particular, I'd like to stick to (quasi-)circular arcs and straight lines with either horizontal, vertical, or 45° diagonal stroke cuts. Here's what I have so far:\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/zukunft_5914.png)\n\nIt feels strangely complementary to my previous work on Octant, where I applied blackletter features to a humanist serif chassis, whereas here I'm applying features from geometric sans to a blackletter chassis.\n\nWhaddya think?\n\nI was toying with the name \"Zukunft\", in the line of Futura and Avenir, but that seems to be taken already. :\\\n\n",
  "author": "Catharsis",
  "time": "22 Feb 2013 — 6:30am",
  "uid": "188621",
  "comments": [
    {
      "time": "22 Feb 2013 — 7:20am",
      "content": "I think it's a great idea to pursue!\n\nOne thing I think that might help for the ones thus far is if you would give the base of /d the same 45°-cut-off as /D..? Don't know if its possible to maintain width though, blackletter is not really my expertise.\n\nI'm excited to see more though. What about ›Nach‹, ›Vorgriff‹, ›Ferne‹...›Fraktura‹ :\\>\n\n"
    },
    {
      "time": "22 Feb 2013 — 1:59pm",
      "content": "Hi Jesse,\n\nthanks for your interest and feedback! I agree that the |d| looked wonky, it's been my least favorite character of the experiment. Meanwhile, I've given in to \"cheating\" a bit to make an acceptable shape for |o|, and I've adopted the same shape for the |d| to relieve it of its awkwardness.\n\nI've made it to down to |O| so far:\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/zukunft2_5047.png)\n\nNone of the name suggestions have \"clicked\" for me so far. I'll have to keep looking. Too bad **Zeitgeist** is already taken; it would have been perfect.\n\n"
    },
    {
      "time": "22 Feb 2013 — 3:47pm",
      "content": "I was going to suggest Tamara, after Deco painter [Tamara de Lempicka](http://web.archive.org/web/20150317234436/http:/en.wikipedia.org/wiki/Tamara_de_Lempicka), but it looks like that has been [taken](http://web.archive.org/web/20150317234436/http:/www.myfonts.com/fonts/wiescherdesign/tamara/). Lempicka?\n\n"
    },
    {
      "time": "22 Feb 2013 — 3:55pm",
      "content": "The letters in the portfolio jpg seems to be this one [http://www.myfonts.com/fonts/virusfonts/bastard/](http://web.archive.org/web/20150317234436/http:/www.myfonts.com/fonts/virusfonts/bastard/ \"http://www.myfonts.com/fonts/virusfonts/bastard/\")\n\n"
    },
    {
      "time": "23 Feb 2013 — 3:56am",
      "content": "@ Pablo: Thanks for pointing that out! I wasn't aware there was already a font out with those shapes. Luckily, I think my approach takes the concept into a different direction than Bastard, so there's no reason not to pursue the project further.\n\n@ Craig: I'd rather not name my work after another artist, unless my work is actually derived from theirs (as it is in the case of Eau de Garamond).\n\nIt seems to be difficult to find a catchy name somewhat related to Futura. Maybe I should try to highlight the clean and geometric cuts instead. **Skalpell** , maybe? Too morbid? **Feinmechanik**? Oh, wait, how about **Uhrwerk**? That's clean, geometric _and_ time-related.\n\n"
    },
    {
      "time": "23 Feb 2013 — 5:11am",
      "content": "Mhhh. ›Uhrwerk‹ seems a bit off for this I feel like. Maybe something with a mathematical ring to it, like ›Fraktion‹, where you'd have math and fraktur. Or opening the dreaded Bauhaus-catalogue, like ›Weimar Fraktur‹...›Werkstatt Fraktur‹...\n\n"
    },
    {
      "time": "23 Feb 2013 — 7:01pm",
      "content": "This nights progress:\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/pqrstf_3616.png)\n\nI've made a more conventional |f| and built the |t| in the same way, but I'm not very happy with the results. Any suggestions on how to fix them?\n\n@ Jesse: «Werkstatt» sounds old and dusty to me. Maybe something like «Weitblick» or «Fernblick»? Or maybe «Nietzsche», in allusion to its rationalism...\n\n"
    },
    {
      "time": "25 Feb 2013 — 5:23am",
      "content": "Alright, I've finished a first draft of the basic alphabet. I love that |z|. :)\n\nNumbers next... then the mind-numbingly boring task of filling in all the non-letter characters... :P\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/end_6371.png)\n\n"
    },
    {
      "time": "25 Feb 2013 — 6:12am",
      "content": "I would clean up that near miss at the bottom of /v/ and /w/.\n\n"
    },
    {
      "time": "25 Feb 2013 — 7:06am",
      "content": "@ Craig: Good catch! I'll see what I can do.\n\nI have a similar situation at the apex of |a| and |q|, but it looks more graceful there because I lowered the vertical stem from the x-height. I'm not sure I can do the same thing for |v w| without creating a hovering impression.\n\nBTW, do you think the current |a q| are acceptable? I'd like to keep the circular stroke as long and unharmed as possible, and I'm loath to cut the vertical stroke along the wrong diagonal.\n\n"
    },
    {
      "time": "25 Feb 2013 — 8:49am",
      "content": "a and q aren't so bad because it looks more purposeful and the white notch is bigger. I think you could just slice off the bottoms of v and w stems in the opposite direction \\ to make a nicer pointed bottom. I know that violates the pen logic you're using on the straights, but rules are made to be broken.\n\nI think you should raise your ascender height.\n\n"
    },
    {
      "time": "25 Feb 2013 — 4:57pm",
      "content": "Hi Craig,\n\nI found a somewhat more aggressive solution for |v w|, which however preserves the logical diagonals. What do you think?\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/uw2_3997.png)\n\nI've also replaced the somewhat awkward aperture of |d| and |p| (old and new):\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/d_4527.png)\n  \n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/p_5427.png)\n\nActually, on second thought, the new |d| might be a step backwards. Maybe I should find a solution with a diagonal cut at the top of the bowl.\n\nAs for the ascender height: My impulse would also be to raise the lowercase ascenders above the cap height, but I'm using Wilhelm Klingspor Gotisch as a coarse reference, and there they even look a tad lower than the caps...\n\n"
    },
    {
      "time": "25 Feb 2013 — 4:55pm",
      "content": "Alright, I changed the |d| almost all the way back. I did close the top off a bit more and make the curves a bit more rounderer, though. It goes well with the |o| now.\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/newd_5001.png)\n\n"
    },
    {
      "time": "25 Feb 2013 — 5:47pm",
      "content": "I think that last /d/ works pretty well. The new /v/ and /w/ look kind of rotated to me.\n\n"
    },
    {
      "time": "28 Feb 2013 — 4:22pm",
      "content": "I turned the arc in |v w| a bit more upright. Does that help?\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/newvw_4645.png)\n\n"
    },
    {
      "time": "1 Mar 2013 — 5:19pm",
      "content": "I'm thinking of departing from the urge of forcing a pun on \"Futura\", and just naming the font after the lake near which I grew up, in its mediæval spelling:\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/gryffensee_3614.png)\n\nIt's a pretty good showcase word for the font, too.\n\n@ Craig: I ended up raising the ascenders a bit. I guess it's for the best.\n\n"
    },
    {
      "time": "1 Mar 2013 — 8:02pm",
      "content": "Great name, and even better when you have some connection to it I figure. Puns don't last anyway.\n\nI really like the solution you found for /s. The last version of your /Q that I've seen feels less thought-out, there seem to be too many angles coming together on opposite sides, maybe you could try to have the ‘tail’ happening externally…? It just feels convoluted is what I am trying to say I guess.\n\nAnd /S looks a little out of place, maybe a bridge along these lines owuld work better:\n\n[http://screencast.com/t/3nGjhnGoV](http://web.archive.org/web/20150317234436/http:/screencast.com/t/3nGjhnGoV \"http://screencast.com/t/3nGjhnGoV\")\n\nAgain, don't know much about blackletter. Great approach!\n\n"
    },
    {
      "time": "2 Mar 2013 — 2:34am",
      "content": "Can you find a way to let /f/ and /t/ thin out somewhere? They -- and esp. /ff/ -- feel clunky.\n\n"
    },
    {
      "time": "2 Mar 2013 — 4:58pm",
      "content": "@ Jesse: You're right, that |Q| ain't exactly a beaut'. It strikes me as too futuristic compared to the other round capitals. Klingspor Gotisch has a rather tiny tail attached to an otherwise unmodified |O|, but if I try that here, the tail basically falls off. I'll try out a different architecture, with a larger tail under rather than next to the body of the |Q|. That happens to be my favorite solution for |Q| in general.\n\nI rather like my |S| so far — maybe a bit on the wide side. Luckily Textura isn't meant to be used in all-caps... I'll push it together a bit and see if it looks more harmonious that way, though. I don't want to make the double piping vertical because it might look too much like a dollar sign.\n\n@ Craig: I know exactly what you mean. I tried several other designs for that junction, though, and they all looked crumbly and disjointed. Maybe now that I've increased the ascender height, I can find a better solution again...?\n\n"
    },
    {
      "time": "2 Mar 2013 — 5:55pm",
      "content": "Three version of |f|:\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/a_4910.png)\n  \n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/b_4531.png)\n  \n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/c_4429.png)\n\nFrankly, I still prefer the solid solution (bottom). The top one falls apart, whereas the middle one insists on too massive a spur to the left. The solid |f| also harmonizes best with the |t|, which requires a heavy crossbar to be recognizable as such, especially in absence of other identifying features such as a curved bottom or a unique top terminal. By the way, I widened that |P|; it had it coming.\n\nI do like the new |Q| and |S|:\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/Q_4336.png)\n  \n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/S_4826.png)\n  \nYou can also see the newest |w| in there, which makes the curved counter slightly larger than it was before to bring it in line with the standard |n| counter. \n"
    },
    {
      "time": "2 Mar 2013 — 6:24pm",
      "content": "D'oh! I had forgotten to optically correct the weight of the horizontal bars with respect to the verticals. I made them 10% lighter now, and I think that solved the problem:\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/lightened_5313.png)\n\n"
    },
    {
      "time": "2 Mar 2013 — 8:27pm",
      "content": "Good changes. Would you want to raise the bottom of the bowl of P? The way the arc comes low and aligns with the diagonal cut at the bottom of the stem makes it look kinda like a D.\n\n"
    },
    {
      "time": "8 Mar 2013 — 6:55am",
      "content": "I've finished a complete character set now, and did most of the spacing and kerning, though not yet for all-caps use. I figure I should kern that too, although Textura is really not recommended for all-caps. Expect a larger PDF specimen soon.\n\n@ Jesse: I've changed the |S| once more, following your advice. It does look much nicer now. Thanks! :)\n\nI've also made a number of alternates for the least legible capital letters. I'm going to include them as ss01 alternates in the main font, as well as offer an alternative font with these alternates as defaults. I'll make sure you can buy both fonts together at an only marginally higher price than the base font.\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/alts_4824.png)\n\nI've also installed a calt feature that replaces |I| by its slimmer alternate in non-initial positions. That should slightly improve legibility of all-caps, although it's still not recommendable... if anything, one should probably use all ss01 alternates to save as much legibility as possible.\n\n"
    },
    {
      "time": "8 Mar 2013 — 6:52am",
      "content": "@ Craig: I always parsed the |P| as such rather than as a |D|, but I've added a small change to make it clearer (right is new):\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/PP_3849.png)\n\n"
    },
    {
      "time": "8 Mar 2013 — 7:54am",
      "content": "Problem solved. Nice job.\n\n"
    },
    {
      "time": "8 Mar 2013 — 8:48am",
      "content": "Beautiful /Q and I really like the /S as well, maybe put in an alternate for that one too though, something close to your 2nd version of your original design? Great job.\n\n"
    },
    {
      "time": "8 Mar 2013 — 10:33am",
      "content": "Here are some PDF specimens:\n\n[http://www.cinga.ch/type/gryffensee\\_specimen.pdf](http://web.archive.org/web/20150317234436/http:/www.cinga.ch/type/gryffensee_specimen.pdf \"http://www.cinga.ch/type/gryffensee\\_specimen.pdf\")  \n [http://www.cinga.ch/type/gryffensee\\_alt\\_specimen.pdf](http://web.archive.org/web/20150317234436/http:/www.cinga.ch/type/gryffensee_alt_specimen.pdf \"http://www.cinga.ch/type/gryffensee\\_alt\\_specimen.pdf\")\n\nAnd full character inventories:\n\n[http://www.cinga.ch/type/gryffensee\\_inventory.pdf](http://web.archive.org/web/20150317234436/http:/www.cinga.ch/type/gryffensee_inventory.pdf \"http://www.cinga.ch/type/gryffensee\\_inventory.pdf\")  \n [http://www.cinga.ch/type/gryffensee\\_alt\\_inventory.pdf](http://web.archive.org/web/20150317234436/http:/www.cinga.ch/type/gryffensee_alt_inventory.pdf \"http://www.cinga.ch/type/gryffensee\\_alt\\_inventory.pdf\")\n\nI figure I'm close to release now. I'll get a comprehensive round of feedback from various sides and then hopefully put it on MyFonts before long.\n\nDoes $20 for a single font and $25 for both together sound fair?\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/weisskron_3996.png)\n\n"
    },
    {
      "time": "8 Mar 2013 — 10:43am",
      "content": "The bowl of /d/ looks too short.  \nAny way to narrow the /x/?  \nMy eye gets hung up on the /s/ - I think it's the least successful lowercase letter.  \n/6/ looks like it floats up from the baseline.  \nThat more \"legible\" /K/ is unhandsome to my eye.  \nThe more \"legible\" /G/ actually looks more old fashioned, which feels like the reverse of the other alternates.\n\n(those links should say .pdf, not .png)\n\n"
    },
    {
      "time": "8 Mar 2013 — 4:28pm",
      "content": "@ Craig: Thanks for the feedback! Let's see:\n\nI've raised the bowl of the |d| a bit more, as you suggested... it has to be the most-edited glyph in the font. :P\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/ddd_3682.png)\n\nNarrowed the |x|:\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/xx_4199.png)\n\nI'm not sure what you mean about the |6|, it looks aligned with the |1|s, for example... Most of Gryffensee's characters have pointy feet, so that \"hovering\" sensation is not unusual.\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/6_5420.png)\n\nYou're right about the unhandsome alternate |K|. The new one looks significantly better while still keeping a bit of the gruff blackletter attitude. ;o)\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/KK_5535.png)\n\nThe alternate |G| is a bit more difficult. I disagree that the previous version looked more old-fashioned than the default |G| — the tailed shape is still common in contemporary script and calligraphy fonts, whereas the default Fraktur |G| is positively alien. Personally, I find it the least recognizable letter in Klingspor Gotisch.\n\nIn any case, I've made some experimental variations of the alternate |G|. I like the diagonal connection in the interior — it gives the |G| a crossbar, though it also evokes a lightning-bolt shape in the glyph that may through the reader's eye off track. The right-most version works pretty well; I'm considering that as the new alternate. However, I happen to have a particular soft spot for tailed |G|s, so I might still go for the second or third version instead...\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/GGGGG_5790.png)\n\nAs for the |s|... I actually quite like it that way. It's in a way the most \"futuristic\" glyph of the font, and that's an intentional connotation of the font concept. However, I'm open to suggestions. Do you have any ideas on how to improve it...? (Otherwise, you can always use the long |ſ|! ;o)\n\nThanks again for the insights!\n\n"
    },
    {
      "time": "8 Mar 2013 — 8:45pm",
      "content": "Those changes look good. On the six, maybe I'm seeing things. Or maybe the four is too low or something. Generally I think those figures are not nearly as polished as the letters, but I know from experience that getting Arabic numbers to mesh with blackletter style is stuffing square pegs into round holes. On the /G/, I think it's the nearly complete monoline circle in the original glyph that makes it look less old fashioned - by that I mean not that it looks like a familiar structure, but just that it has more of the modernist flavor. Any of those other /G/s work I think, but I kinda think that tail structure is a bit of a signature characteristic for this typeface from its appearance in the descending lowercase letters, so maybe the second is best. On the /s/, I would do some sketches from scratch, maybe building around a thick spine that goes this way \\ instead of the hairline that goes /.\n\n"
    },
    {
      "time": "9 Mar 2013 — 9:12am",
      "content": "@ Craig: Thanks again for your feedback! The crossbar on the |4| was indeed quite irresponsibly low. It looks better now:\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/44_3645.png)\n\nI find it harder to come up with a satisfactory |s|. I found a solution with a heavy dexter diagonal as you suggested (second row), and while I really like the airy effect it has in the middle of words, it seems to fall apart a bit at the beginning and end of words. I've also made a third version more closely based on the Wilhelm Klingspor |s|, which looks very fraktury indeed, but after the sober minimalism of the second |s| I find it a bit hard to get used to its aggression. It might very well end up as my |s| of choice, though. I guess I could still offer the other |s|s as stylistic alternates.\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/3s_3828.png)\n\n"
    },
    {
      "time": "9 Mar 2013 — 9:22am",
      "content": "Here's a side-by-side comparison of the two candidate |s|s. Maybe I should make the slim version the default |s| of Gryffensee Alternate (to go with the more \"legible\" capitals), and adopt the Klingspor-style version for Gryffensee?\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/comparison_3663.png)\n\n"
    },
    {
      "time": "9 Mar 2013 — 10:30am",
      "content": "FWIW I quite like that third /s/. If you could narrow it a bit I think it could be even stronger.\n\n"
    },
    {
      "time": "9 Mar 2013 — 4:13pm",
      "content": "I've made some slight changes to both new |s| design — narrowed down the Fraktur-style version as you suggested, and reduced the height of the slim version to make it fit better into the x-height optically. I like the idea of shipping the default Gryffensee with the Fraktur-style |s| and Gryffensee Alternate with the slim |s| — it gives each font a bit more individual character.\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/newcomparison_5571.png)\n\nI've also uploaded updated versions of the PDF samples. I feel the font is pretty much ready now, so I'm probably going to submit it to MyFonts in the next week or so.\n\n"
    },
    {
      "time": "10 Mar 2013 — 1:01am",
      "content": "Just chiming in to say that it would be a pity to lose the unusual original /s/, which seems to be the character most clearly embodying this typeface's dual character. The Klingsporish /s/ leans over way too far away from the geometric, those sides do not feel remotely like curve segments.\n\n"
    },
    {
      "time": "10 Mar 2013 — 6:41am",
      "content": "I concur, I like these two a lot more:\n\n![](http://web.archive.org/web/20150317234436im_/http:/content.screencast.com/users/aTremulant/folders/Jing/media/e0bbb6d0-6cc1-44fe-bfc8-3c1aab551b8c/00000688.png)\n\nMaybe you could try an upwards arch instead of a diagonal for the second one...? That said, I think both of those fit better to your actual goal.\n\n"
    },
    {
      "time": "11 Mar 2013 — 2:57am",
      "content": "OK, I'm getting very mixed responses about those |s|es, here and on TypeDrawers, and I also find my allegiances fluctuating a lot. I've always liked the slim |s|, though — it has a certain understated elegance and embodies the font's geometric, reductionist philosophy very well. I am certainly going to keep it, perhaps even for both cuts of the font.\n\nThe Klingspor |s| is pretty, but as Johan remarks, it feels highly non-geometric (although it technically adheres to the rules I've set up); in fact, I find it even somehow manages to undermine the geometric feel of entire words it appears in, yielding the impression of a traditional fraktur font. That can be desirable, of course, but I don't think it should be the main aim of the font.\n\nConversely, though, my original |s| looks very geometric indeed, almost a bit too freaky. It has no relation whatsoever to established blackletter shapes... and it's too heavy, too.\n\nAlright, then. How about I release the font in three versions? One with the traditional caps and Klingspor |s|, one with the legible caps and the slim |s|, and a third one with the geometric |s| (and possibly the traditional caps?).\n\nI also intend to make one of the three the master font and add all variations in as stylistic alternates, so professionals can mix and match the styles freely. Which of the three do you think should be the default...?\n\nBy the way, I've made spine of the slim |s| a bit heavier, I think it meshes better with the other letters now:\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/sweight_5791.png)\n\n"
    },
    {
      "time": "11 Mar 2013 — 3:10am",
      "content": "I removed some weight off the original |s| and find it much more pleasant now. :)\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/eclheavy_6126.png)\n\n"
    },
    {
      "time": "11 Mar 2013 — 3:55am",
      "content": "Some progress on |c| and |r|, thanks to Georg Seifert...\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/cr_5269.png)\n\nFuzzy version:\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/crfuzzy_4942.png)\n\n"
    },
    {
      "time": "11 Mar 2013 — 4:30am",
      "content": "I hadn't seen this coming, but the \"legible\" version lends itself surprisingly well to all-caps usage:\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/coracoes_5765.png)\n\n(I'm double-posting to TypeDrawers at the moment since I can't upload files to my FTP where I am now.)\n\n"
    },
    {
      "time": "11 Mar 2013 — 6:08am",
      "content": "Looks very promising! Seeing the pervious posts, I would definitely go with your first version of /s. It is just so much more coherent when looking at the big picture.\n\n"
    },
    {
      "time": "14 Mar 2013 — 4:25pm",
      "content": "There have been a few new developments on Gryffensee based on discussions on the TypeDrawers forum. In the interest of not double-posting everything, here's the link:\n\n[http://typedrawers.com/discussion/262/gryffensee-the-futura-of-blacklett...](http://web.archive.org/web/20150317234436/http:/typedrawers.com/discussion/262/gryffensee-the-futura-of-blackletter#latest \"http://typedrawers.com/discussion/262/gryffensee-the-futura-of-blackletter#latest\")\n\n"
    },
    {
      "time": "1 Apr 2013 — 7:28am",
      "content": "I wrapped Gryffensee up and sent it to MyFonts. Expect to see it up for purchase soon!\n\nMeanwhile, I find myself daydreaming about expanding Gryffensee into the cyrillic parameter space. There seem to be almost no cyrillic blackletters available, which could mean it's really hard to pull off, but also that it could be a big untapped market.\n\nUnfortunately, I have no practical experience with cyrillic apart from knowing what the basic letters sound like in Russian. I'd probably need some coaching in legibility matters from native readers.\n\nWhaddya think? Worth the effort?\n\n"
    },
    {
      "time": "1 Apr 2013 — 8:02am",
      "content": "How's this for a start? :)\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/kirillica_4338.png)\n\nI figure I should base my letter shapes on the cyrillic italic. It tends to cramp the x-height less badly than the book version and lends itself better to pen rules.\n\n"
    },
    {
      "time": "1 Apr 2013 — 11:15am",
      "content": "First draft of full Russian lowercase. I'm having trouble with the |я|, it just won't look right. The |э| was also a tough nut, but I think it looks acceptable now. No idea whether it's legible, though!\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/kirilc_6524.png)\n\n"
    },
    {
      "time": "3 Apr 2013 — 3:29am",
      "content": "Complete Russian character set. Is anyone willing to do a legibility test for me? First (competent) offer gets a free font license.\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/allcaps_5969.png)\n  \n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/alllc_3460.png)\n\n"
    },
    {
      "time": "3 Apr 2013 — 12:57pm",
      "content": "I have just registered to Typophile to express my admiration to your blackletter. My comments about your Cyrillic are layman's -- I have only designed two letterforms in my life: a capital and lowercase |yogh| to get along with Alcuin. Moreover, I am a Pole but I have read my share of Russian books and own Шрифты, a Soviet book with specimens of hundreds of typefaces. The bottom line: I offer you my comments in good faith without aspiring for the prize.\n\nThe minuscule looks good. I think |з| usually has no descender, and never has it |я|. Also, the left bar of |ъ| should protrude.\n\nThe |Д| should have two distinct vertical serifs at the bottom. Now I might mistake it for |А|. I would suggest that you go with a roman |Т| (you already have a non-cursive |Д|). This would also allow you to make |М| more typical. Also, you might think of a way to connect the two parts of |Ч| more visibly. Finally, the |Э| is very unusual -- you might try to base it on a circle.\n\nI have also minor comments to:  \n|В|: I know it's taken from the Latin version, but it looks a bit like cursive |Д|.  \n|Ж|: Although I find it legible, you might experiment with moving the top left and bottom right slanted strokes closer towards the mean line.  \n|Л|: The angle between the left and the top strokes is usually straight or even obtuse.  \n|У|: You might experiment with making the descender open to distinguish it better from |Ц|.\n\nFeel free to ignore any part of my grumbling, especially when real natives speak up. Do you plan to design also non-Russian Cyrillic letterforms?\n\n"
    },
    {
      "time": "4 Apr 2013 — 3:15am",
      "content": "Hi Marcin, welcome to the forum and thanks for your comments!\n\nMinuscule: Latin blackletter often has some descenders where antiqua usually doesn't, such as in |h|, |z|, |x|, |f|, |ß|, and some capitals. As a result, I feel entitled to do the same thing to Cyrillic... but if it just comes across as weird or illegible, I'll try to work around it. My main problem is that my x-height is awfully cramped, what with my wide stroke and geometric constraints. Cyrillic exacerbates the problem by stuffing a lot of pen-unfriendly forms and tiny distinctions into the x-height. I'm taking every chance I have to break free from that space (I even used to have a descender on |в| but found that too weird in the end).\n\nAs for the |ъ|, I know it's supposed to protrude to the left, but that will create a gaping hole of white space in a word. Maybe Cyrillic expects this sort of white space for legibility, but in a blackletter that relies on blackness for texture, it sticks out like a sore thumb... anyway, I'll try to come up with something. Maybe if I had it protrude diagonally to the upper left...?\n\nI see what you mean about the |Д| — it's annoying to have to rely on serifs when I'm trying to avoid serifs in general. I'll try an alternate structure based on the Roman |L|; hopefully that will also work for |Л|. I'm fine with using the Roman |T|. Do you think my Roman |M| will be recognizable as such, or will it look too much like a cursive |T|?\n\nI also see what you mean for |Ч|. Do you think the problem is less pronounced in |И|, which shares the same connective tissue? If I can find a good shape for |Ч|, maybe that will also solve the |У| problem that you mention.\n\nI did try a circular form of |Э| first, but found it looked out of character with the blackletter. I might just go back to that.\n\nNon-Russian characters: Yes, I've been looking to fill in the \"Adobe Extended\" range as provided in the Glyphs application. I noticed I'll have to make the |E| angular so as to distinguish it from |Є| — that's rather annoying...\n\n"
    },
    {
      "time": "4 Apr 2013 — 9:03am",
      "content": "Thank you for the warm welcome, Christian!\n\nFWIW, pre-1708 Cyrillic (полуустав) solved the bar problem in |ъ| by inclining the vertical stroke to the right ( [http://irmologion.ru/fonts.html](http://web.archive.org/web/20150317234436/http:/irmologion.ru/fonts.html \"http://irmologion.ru/fonts.html\")). I do know it is rather unacceptable in blackletter.\n\nI understand your aversion to serifs but those in |Д| are special. Even sans-serif fonts usually have them.\n\nIMHO, your Latin |М| would do fine -- Cyrillic cursive |T| has a solid bar on its top. I see no problems with your |И|. Maybe you could overcome the |E| vs |Є| problem by making |Є| more similar to |ᗕ (Canadian syllabics carrier wa)|, minus the ugliness, of course.\n\n"
    },
    {
      "time": "4 Apr 2013 — 11:20am",
      "content": "Hi Marcin,\n\nhow do these changes look? I prefer the version of |Д| with only one curly serif. Is it legible enough?\n\nI kept the |Л| for now — I wouldn't want to make the top part look too much like |П|, or to break the left half of the glyph into two strokes.\n\nI like the new |У| so much I'm replacing my convoluted Latin |Y| with it as well. |Э| still looks somewhat out of place, but the slant in the crossbar lends it some organic warmth.\n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/changes_6211.png)\n  \n\n ![](http://web.archive.org/web/20150317234436im_/http:/typophile.com/files/dosto_6532.png)\n\n"
    }
  ]
}
