{
  "id": "100862",
  "title": "Typecast + Fonts.com Bundle: The Perfect Type Pairing",
  "forum": "Home",
  "tags": [
    "font",
    "fonts",
    "Fonts.com",
    "News",
    "typecast",
    "web design",
    "web fonts",
    "webfonts"
  ],
  "content": " ![](http://web.archive.org/web/20140712202613im_/http:/typophile.com/files/fontspro2_4340.jpg)\n\nRead The Fonts.com Blog: [http://bit.ly/13KE7DT](http://web.archive.org/web/20140712202613/http:/bit.ly/13KE7DT \"http://bit.ly/13KE7DT\")  \nSubscribe Here: [http://www.fonts.com/web-fonts](http://web.archive.org/web/20140712202613/http:/www.fonts.com/web-fonts \"http://www.fonts.com/web-fonts\")  \nView a Typecast Demo: [http://vimeo.com/43763778](http://web.archive.org/web/20140712202613/http:/vimeo.com/43763778 \"http://vimeo.com/43763778\")\n\n[Fonts.com](http://web.archive.org/web/20140712202613/http:/www.fonts.com/) has redefined its Professional Fonts.com Web Fonts plans to make them more affordable, while adding a free [Typecast](http://web.archive.org/web/20140712202613/http:/typecast.com/) subscription (worth $29 per month). The new professional plans start at just $40 per month and include 1 million page views per month, but additional page-view packages are available, as needed.\n\nLike before, professional plans also include the self-hosting option and desktop fonts for creating website mockups. Current Web Font Professional plan subscribers, as well as 1 million, 1.5 million or 2 million page view Web Font Standard plan subscribers will be upgraded automatically to make life easy.\n\nTypecast is a powerful, browser-based design app that takes the pain out of designing with Web fonts. It lets designers, pair and compare Web fonts in the browser on full-length text without having to create screenshots, assemble comps or hand-code CSS.\n\nSliders, drop menus and simple inputs make it easy to set text in precise detail, and because you’re designing in the browser, you’re able see changes in real time and make better, faster decisions about quality, style and rendering.\n\nAs you design, standards-compliant HTML and CSS is produced behind the scenes, allowing for the quick sharing of Web-ready designs with developer colleagues, which leads to more accurate prototypes.\n\nBest of all, Fonts.com and Typecast work great together. All of Fonts.com’s 20,000 plus Web fonts are available in Typecast. All Fonts.com accounts are linked to Typecast, so getting the Web fonts used in your Typecast design onto your website is simple. When it’s time to export your designs and start prototyping, Typecast will determine which fonts to serve up and provide an embed code that includes them. Going forward, you can continue to use Typecast to manage the font selections in your Fonts.com Web Fonts projects.\n\nFonts.com aims to reshape typography on the Web, and believes this combination will help Web designers make sound typographic decisions and refinements with their favorite typefaces.\n\n",
  "author": "JLH",
  "time": "25 Feb 2013 — 2:48pm",
  "uid": "30653",
  "comments": [

  ]
}
