{
  "id": "10082",
  "title": "How do you make a font?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Is there a way to make a font FOR FREE?\n\n",
  "author": "smiley_1",
  "time": "2 Apr 2005 — 10:51am",
  "uid": "6285",
  "comments": [
    {
      "time": "22 Apr 2005 — 8:46am",
      "content": "There is one free program that handles TrueType/OpenType (including Kerning, etc.)   \n   \nFontForge, a simple google search will find it. It is very difficult to get set up and working on a Windows system (it was designed for Linux), and is not the most intuitive design program I'm sure. I have not yet started to work on hinting/instructing the font's I've made in it, but it does seem to be capable of hinting. It can export both OpenType and Apple specific Kerning data in TrueType Fonts, and it can handle glyph substitutions as well (though I have yet to use this). It can also export to other font formats besides TrueTypes. I can't say how good a quality font you can make with it (I am not a professional font designer), but I have already created my own handwriting font with it, and I'm working on a Times New Roman style Serif font.\n\n"
    },
    {
      "time": "22 Apr 2005 — 8:20pm",
      "content": "this is what i started with:   \nFont Maker, a TT editor from [http://high-logic.com/](http://web.archive.org/web/20131020085515/http:/high-logic.com/). Their program is a free download and is fully functional for 1 month, after which time you must register (for something like $50).   \nFor Windows Only.\n\n"
    },
    {
      "time": "23 Apr 2005 — 4:54am",
      "content": "Interesting to me that we want to begin by recommending a piece of software. That was my first reaction too.   \n   \nIf you want to make quality fonts, I'd suggest investing time and alas, money in a class from somebody who knows what they're doing. I see you are not too far from new york city. Type Director's Club offers a masterclass on type design over 4 saturdays (intro to drawing glyphs), see [www.tdc.org](http://web.archive.org/web/20131020085515/http:/www.tdc.org/). SVA offers several type related options (but coming down for a semester on weekdays might be an issue) [www.sva.edu](http://web.archive.org/web/20131020085515/http:/www.sva.edu/).   \n   \nWithout spending money, you can get some type education by visiting:   \n [http://briem.ismennt.is/](http://web.archive.org/web/20131020085515/http:/briem.ismennt.is/)   \n [http://www.typeworkshop.com](http://web.archive.org/web/20131020085515/http:/www.typeworkshop.com/)   \n [http://typophile.com/articles/typefacedesign110/index.html](http://web.archive.org/web/20131020085515/http:/typophile.com/articles/typefacedesign110/index.html)   \n [http://just.letterror.com/ltrwiki/SketchingType](http://web.archive.org/web/20131020085515/http:/just.letterror.com/ltrwiki/SketchingType)   \nBrowsing around here at typophile (take all comments with a grain of salt). We speak hyperbole.   \n   \nThere is no substitute for flesh and blood instruction.   \n   \nHappy drawing.   \nRandy\n\n"
    },
    {
      "time": "8 May 2005 — 7:50am",
      "content": "Yea, and start calling it a TYPEFACE. You wont sound so amateur.\n\n"
    },
    {
      "time": "10 May 2005 — 6:05am",
      "content": "Of course, typeface it is :)\n\nBut, now that we are on the subject as well, can anyone recommend a good typeface editor for OS X?\n\nAs Fontographer is still in Classic...\n\nCheers.\n\n"
    },
    {
      "time": "10 May 2005 — 11:00am",
      "content": "Manutius (for windows):  \n [http://mywebpage.netscape.com/yeahnoah/manutius.htm](http://web.archive.org/web/20131020085515/http:/mywebpage.netscape.com/yeahnoah/manutius.htm \"http://mywebpage.netscape.com/yeahnoah/manutius.htm\")\n\n"
    },
    {
      "time": "22 Nov 2005 — 3:30pm",
      "content": "Installing and using Fontforge is **not extremely difficult!**\n\nAlthough it's still not ready, check out the **Document Section on How to Install Fontforge on Windows, OSX or Fedora Linux.**\n\n[Typeforge Documents Section](http://web.archive.org/web/20131020085515/http:/www.typeforge.net/cms/index.php?option=com_content&task=category&sectionid=4&id=24&Itemid=31)\n\nThis website will be concentrating on how to (start to) Type Design featuring the whole sketch-to-digital typeface . For now, Akzidenz revival - we are currently sketching...\n\nActually, I think using Open Source software is the best way to learn some subjects (like Typography and Webdesign) and to motivate people to push forward. Otherwise people tend to stick to the available commercial solutions... and sometimes fail to see the true principles of the art/craft behind the software mask. Even if sometimes Open Source software is quirky, technicaly challenging and hard to master...\n\nOn the other hand, if you do want to take it to the professional level you should use professional level editor like Fontlab. You shouldn't go for the $50 solutions.\n\nCheers,  \nPedro\n\n——  \n [www.typeforge.net](http://web.archive.org/web/20131020085515/http:/www.typeforge.net/)\n\n"
    },
    {
      "time": "22 Nov 2005 — 6:09pm",
      "content": "Caspar, stay tuned for Fontographer for OS X. It is presently in Beta, and works pretty much exactly as it always has. (Using it is like stepping back in time. Very odd sensation.)\n\nI heartily recommend FontLab, which is the Concorde to Fontographer's Sopwith Camel. Which is purely my opinion; some people swear by RoboFog, which is a Python-fueled version of an even older generation of Fontographer.\n\nThere is a \"diet\" version of FontLab called TypeTool, which might be the right tool for someone wanting to try on the FontLab editing environment. And it only costs $99.\n\nFontLab makes all of the above-mentioned sotware, and they do a great job.  \n [http://www.fontlab.com/](http://web.archive.org/web/20131020085515/http:/www.fontlab.com/ \"http://www.fontlab.com/\")\n\nOh, and I forgot to say: You can download trial versions of their software, so you can get the applications for free, but there will be limits when you generate the fonts.\n\n"
    },
    {
      "time": "22 Nov 2005 — 6:22pm",
      "content": "Chester,  \nIs the OS-X build of FOG just a port to OS-Xor are there new features like OTF suport?\n\nI still like the \"cleanup path\" command in FOG better than FL.\n\nChrisL\n\n"
    },
    {
      "time": "22 Nov 2005 — 6:29pm",
      "content": "Chris, it's a straight port. It really is like stepping back in time. There was a cartoon I used to watch in which a family falls through a whirlpool into prehistory, with dinosaurs walking around. Using FogX is like that.\n\nPS; IOUe.\n\n"
    },
    {
      "time": "22 Nov 2005 — 8:06pm",
      "content": "Does FogX use Quartz for the Bézier curves and previews? or is it still all jaggedy?\n\n"
    },
    {
      "time": "22 Nov 2005 — 8:25pm",
      "content": "\\>It really is like stepping back in time.\n\nYeah, and trying to run it in Classic does indeed cause one to step back in time whenever it freezes.\n\n"
    },
    {
      "time": "22 Nov 2005 — 9:41pm",
      "content": "Nick, no need for Classic, fortunately...  \nMark, it's pretty crunchy:\n\n ![](http://web.archive.org/web/20131020085515im_/http:/typophile.com/files/FogX_001.png)\n\n ![](http://web.archive.org/web/20131020085515im_/http:/typophile.com/files/FogX_002.png)\n\n ![](http://web.archive.org/web/20131020085515im_/http:/typophile.com/files/FogX_003.png)\n\n ![](http://web.archive.org/web/20131020085515im_/http:/typophile.com/files/FogX_004.png)\n\n"
    },
    {
      "time": "22 Nov 2005 — 9:45pm",
      "content": "\"Holy time travel, Batman!\"\n\nWell, it's not like I was expecting to switch back...\n\n"
    },
    {
      "time": "4 Apr 2005 — 10:02am",
      "content": "This question is a bit of a sticky wicket. How much text do you need to set? If it isn't more than a paragraph, you could always use pen, paper and photocopier. Just teasing. I believe that FontLab has 30 day trial versions that might get you started. You might look at their comparison page and perhaps find that you don't need FontLab and can make due with one of their other software packs. You could also scour ebay for a copy of something used, Fontographer for instance. Unfortunately, to make quality typefaces isn't something that can be done for free.   \n   \nDownloads: [http://www.fontlab.com/Font-utilities/Try-out-FontLab-Products/](http://web.archive.org/web/20131020085515/http:/www.fontlab.com/Font-utilities/Try-out-FontLab-Products/)   \nCompare: [http://www.fontlab.com/Font-tools/Product-Comparison-Chart/](http://web.archive.org/web/20131020085515/http:/www.fontlab.com/Font-tools/Product-Comparison-Chart/)\n\n"
    }
  ]
}
