{
  "id": "100835",
  "title": "Fonts with best metrics/kerning?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi!\n\nMany times I've read that studying fonts with great spacing is an excellent way to learn and achieve good spacing in your own fonts. Based on this, what do you guys think are fonts with flawless letter spacing?\n\nThanks for the suggestions!\n\n",
  "author": "Graphirus",
  "time": "25 Feb 2013 — 2:48am",
  "uid": "206220",
  "comments": [
    {
      "time": "25 Feb 2013 — 4:54am",
      "content": "[http://typophile.com/node/91972](http://web.archive.org/web/20150418211402/http:/typophile.com/node/91972 \"http://typophile.com/node/91972\")\n\n"
    },
    {
      "time": "27 Feb 2013 — 4:16pm",
      "content": "Thanks for the link! Nevertheless, only one or two fonts are recommended, so I'm still looking for good candidates.\n\n"
    },
    {
      "time": "27 Feb 2013 — 7:12pm",
      "content": "I have a feeling that \"good spacing\" is like \"good music\": largely a matter of personal taste, not to mention highly dependent on the situation.\n\nI truly do not understand why the Western world insists on proportional fonts and kerning tables, when East Asia seems to get along quite happily with its characters fitting neatly into uniform cells. (Korea's variation on this is kind of cool, I think: each _syllable_ fits into a cell, and the letters within that syllable are squished to fit.) But then, I seem to expect different things of characters than other people do. When I see a number like 21500 appear proportionally spaced, I want to say to the left-hand digits, \"Get in your cells and stay there! Only the thousands' digit should be in the space for the thousands' digit! The ten-thousands' digit has its own space!\" Similarly with words: sometimes I see the letters all mashed together. Hey folks, you're not exactly writing on goatskin: you can _afford_ not to smoosh the letters together!\n\nI leave you with a sin: monospaced text figures (from eulerarchive.com).\n\n ![](http://web.archive.org/web/20150418211402im_/http:/typophile.com/files/euler_3874.png)\n\n"
    },
    {
      "time": "27 Feb 2013 — 7:29pm",
      "content": "I like a lot of things about the Chinese writing system. But every symbol being made to fit in a square is _not_ one of them...\n\nBTW: [http://typophile.com/node/64079](http://web.archive.org/web/20150418211402/http:/typophile.com/node/64079 \"http://typophile.com/node/64079\")\n\nAs for OS nums being fixed-width, I actually think they look better that way than lining ones!\n\nhhp\n\n"
    }
  ]
}
