{
  "id": "10084",
  "title": "Shakira logo",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi, new here. Could anyone ID this font please?   \nThanks a lot.   \n ![the SHAKIRA logo](http://web.archive.org/web/20130820082914im_/http:/www.typophile.com/forums/messages/83/6863.jpg)\n\n",
  "author": "koeiekat",
  "time": "23 Feb 2003 — 7:07am",
  "uid": "1533",
  "comments": [
    {
      "time": "23 Feb 2003 — 9:15am",
      "content": "YIKES!\n\n"
    },
    {
      "time": "23 Feb 2003 — 10:13am",
      "content": "I won't be able to eat anything all day...   \n   \nhhp\n\n"
    },
    {
      "time": "23 Feb 2003 — 10:22am",
      "content": "Are these... worms?\n\n"
    },
    {
      "time": "23 Feb 2003 — 10:24am",
      "content": "The \"a\" and \"i\" look like something straight out of a porn movie for aliens. ![:-)](http://web.archive.org/web/20130820082914im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "23 Feb 2003 — 10:28am",
      "content": "Hey Koeiekat, om misverstanden te vermijden: we zijn echt niet met jou aan het lachen. Je moet nu niet denken dat we een bende onopgevoede Neanderthalers zijn of zo. ;)\n\n"
    },
    {
      "time": "23 Feb 2003 — 11:42am",
      "content": "Never mind, when I saw this forum I was under the impression I found some people that knew about type. But, ...\n\n"
    },
    {
      "time": "23 Feb 2003 — 11:55am",
      "content": "Well, you can hardly call _that_ \"type\", can you? I'm betting a euro that this won't ever get identified. This _must_ be custom drawn.   \n   \nOnce again, we're certainly not making fun of you.\n\n"
    },
    {
      "time": "23 Feb 2003 — 1:09pm",
      "content": "If you knew about type - whatever shape is has and irrelevant wheter you like it or not - you might have noticed the the A shape is the same.   \nYou might also have noticed that by the way the H, K and I shapes are constructed, that we are here indeed talking about a type. Like it or not.\n\n"
    },
    {
      "time": "23 Feb 2003 — 1:43pm",
      "content": "Just because there are identical letters and there's a design throughline, if you want to call it that, it doesn't necessarily mean it's a font.   \n   \nAt any rate, I went through a pretty good collection of the free fonts available around the Web and didn't find it. I can't imagine it's a commercial face, though I could be wrong.\n\n"
    },
    {
      "time": "23 Feb 2003 — 1:46pm",
      "content": "You should also know that fonts are often commissioned, which means the only people who know about it could be the people who made it and the people who use it.\n\n"
    },
    {
      "time": "23 Feb 2003 — 2:15pm",
      "content": "Koeiekat, we're just having fun, don't worry.   \n   \nYves would have helped out if he knew what it was, and   \nsince he doesn't know what it is, it might very well not exist!   \n   \nhhp\n\n"
    },
    {
      "time": "23 Feb 2003 — 4:25pm",
      "content": "I find it rather fun. The \"biomorphic but not quite\" shapes   \nremind me of some of the things we could find in Massin.   \nIsn't there someone here who once posted an alphabet   \nwhere every letter was over a little 'pedestal'? So? That   \n'I' could be there. And the \"alien porn\" tagline? Wonderful.\n\n"
    },
    {
      "time": "23 Feb 2003 — 8:03pm",
      "content": "ALIEN PORN MOVIE... hahaha.. i was thinking the same thing\n\n"
    },
    {
      "time": "25 Feb 2003 — 2:44pm",
      "content": "it must be porn! the \"I\" loooks like a strap-on dildo .... jeeees, it's late ...   \n   \npeter, don't you have one of those?\n\n"
    },
    {
      "time": "25 Feb 2003 — 3:17pm",
      "content": "All, thanks for your wholeheatedly cooperation. You made a 12 years young girl very happy. One idol down the drain. Keep the good works up folks!   \n   \nBy the way Stephan rethink \"Type geeks are suckers when it comes to playing Name that Font. Scan in a sample and post it here. Nine times out of ten, you'll have your answer within the hour.\"   \n   \nI'm not gone though. I love kids.\n\n"
    },
    {
      "time": "25 Feb 2003 — 3:37pm",
      "content": "Harrumph. In this forum there are 56 threads. Of the very few where the specimens were not positively identified, most of them were, for all intents and purposes, unidentifiable. By my count, there were only three or four that should have been able to be identified, but we just weren't able to.   \n   \nA little math: 9/10 of 56 is six if you're being generous, five if you're being stingy. If we nailed all but three or four, that's better than 9/10.   \n   \nNow, if you're being picky about the one-hour part, we fall a little below. But given all the three-minute ids, if you take an average, the one-hour mark is probably right.   \n   \nFinally, note that it says \"you'll have your answer within the hour.\" It doesn't say whether you'll be happy with the answer.   \n   \nAgain, I say, harrumph.\n\n"
    },
    {
      "time": "25 Feb 2003 — 4:24pm",
      "content": "Well Cheshire, that's not only an easy but also a bit childish way out. If these gurus don't recognize a type, OK. Just say so. If they don't like it fine with me. That, however, was not the question.   \nBut if you count all the \"I don't know but I'll make a funny remark to hide that there is someting I don't know remarks\", not just in this thread, but in many other threads too - thoughout this form, as an answer ... well the helpful/cooperative answers are limited. To say the least. I am aware that most of the funny remarks came from Belgium. In itself that's no surprise. Looked at the site? Who does what? Nobody does anything. But again, Belgium. By the way, remember one click navigation? Communicare nessese est! But let's not try to make it too easy. A true masterpiece of design prevailing over usability. I am afraid this little agency will not get my costom.   \n   \nBut, as said, I love kids,   \n   \nHave fun and ... be nice to the cats\n\n"
    },
    {
      "time": "25 Feb 2003 — 4:39pm",
      "content": "Childish? Show me a child who understands percentages like I do. I mean, a child who's enrolled in the terribly underperforming American public school system.   \n   \nOther than that, I refuse to get dragged further into this argument. I've said all I need to say.\n\n"
    },
    {
      "time": "26 Feb 2003 — 12:40am",
      "content": "Dear Koeiekat,   \n   \nWe sincerely regret that we can't identify the typeface used for the \"Shakira\" logotype. Several of our voluntary, unpaid type identifiers have done some research, amongst them Cheshiredave who \"went through a pretty good collection of the free fonts available around the Web and didn't find it.\"   \nWe have come to the conclusion that the \"Shakira\" logotype probably is custom drawn. It is likely that no existing typeface, available commercially or as share- or freeware, has characters that match the corresponding characters in this logotype.   \nIf in the future this would appear to be incorrect and a existing typeface should be found that matches the \"Shakira\" logotype, you won't be entitled for a refund.   \n   \nI can assure you that we DO love children and would like to help you out, but unfortunately we can't in this specific case. Furthermore, I would like to stress that our friendly banter was solely aimed at the character(s) of the logotype, certainly not yours nor Shakira's.   \n   \nLast but not least, I would like to apologize for our misplaced jokes and sorry (lack of) sense of humour. I can guarantee you that in the future we will restrict ourselves to helping our fellow men, women AND children in an efficient and orderly fashion.   \n   \nYours truly,   \n   \nYves Peters\n\n"
    },
    {
      "time": "26 Feb 2003 — 12:42am",
      "content": "Simon, who's this \"Peter\" you're talking to who's supposed to have \"one of those\"?\n\n"
    },
    {
      "time": "26 Feb 2003 — 1:53am",
      "content": "What's wrong with Belgium anyway?   \n   \n(Besides the very ugly & unusable highway-signalisation and the lack of a decent graphic-design association)\n\n"
    },
    {
      "time": "26 Feb 2003 — 7:38am",
      "content": "\\> our friendly banter was solely aimed at the character(s) of the logotype, certainly not yours nor Shakira's.   \n   \nI don't know - I would definitely consider aiming something at Shakira.   \n   \nBTW, Belgium rules.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Feb 2003 — 7:57am",
      "content": "_I don't know - I would definitely consider aiming something at Shakira._   \n   \nShhh, me too: manufactured commercial pop stars are one of the main reasons why the music industry is going down the drain. But don't you start now and ruin my attempt to kiss and make up with koeiekat!   \n   \n_BTW, Belgium rules._   \n   \nYes and no. :/ Three of the main reasons why we (and France and Germany) are resisting the United States of Agression are: Elf Total Fina. We _do_ care for world peace, but our motivations aren't always clear cut. Then again, nothing's black nor white in the world these days (except maybe a page of well set type ;) ).\n\n"
    },
    {
      "time": "26 Feb 2003 — 8:05am",
      "content": "\\> manufactured commercial pop stars   \n   \nThat's not what I meant... :-)   \n   \n\\> Yes and no.   \n   \nBut your food/drink is the best in the world. Well, after the Mediterranean.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Feb 2003 — 8:26am",
      "content": "Hrant, it looks like we're on totally different wavelengths here. Listen to me blabbering about socio-economic issues, international politics and the state of the world today, while you're obviously only interested in eating, drinking and a good lay.   \n   \n=D\n\n"
    },
    {
      "time": "26 Feb 2003 — 8:38am",
      "content": "Or at least [obliquely] talking about it...   \nPlus I really need to lose some weight.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Feb 2003 — 9:01am",
      "content": "Seems to be the sperm of our ex-president son.   \n(who is the boyfriend of this latin trash bitch).   \n   \n-Sorry for the language, but there are political feelings on that-\n\n"
    },
    {
      "time": "27 Feb 2003 — 6:47am",
      "content": "Alastair, THX for the support, really, but my mommy always told me it's best to ignore childish remarks. You'll only make it worse. I was so happy he shut up the past 2 days!   \n   \nAlthough you're right about his \"bratty petulance\": I do feel that dissing someone who voluntarily sticks his neck out to help others is pretty sad. Furthermore the \"Looked at the site? Who does what?\" remark and cheap stabs at Belgium are quite rich from someone who provides no information at all in [his own profile](http://web.archive.org/web/20130820082914/http:/www.typophile.com/cgibin/board-profile.pl?action=view_profile&profile=koeiekat-users). Lame!\n\n"
    },
    {
      "time": "27 Feb 2003 — 10:31am",
      "content": "I feel so..._used_...\n\n"
    },
    {
      "time": "25 Feb 2003 — 3:24pm",
      "content": "Hehe. Well, my name's _Stephen_ and I didn't write that   \nintro. I think it was Jared Benson's doing. Glad to have you   \nhere, koeiekat.\n\n"
    },
    {
      "time": "25 Feb 2003 — 3:38pm",
      "content": "Don't look at me! It was Joe.   \n   \nOkay, okay. It was me.\n\n"
    },
    {
      "time": "26 Feb 2003 — 12:44am",
      "content": "And I am _always_ nice to cats! Here is [mine](http://web.archive.org/web/20130820082914/http:/stewf.com/foto/mew/pippi.jpg).\n\n"
    },
    {
      "time": "27 Feb 2003 — 6:07am",
      "content": "koeiekat , I'm astounded at your bratty petulance, but when I see the kelly osbourne link in your newer posting it all makes pefect sense.   \n   \nbtw, if you had looked properly on Yves' site, you'd have noticed that the 'who does what' section does actually contain info.   \n   \nI doubt that shakira text is an actual typeface too, but feel free to dispute away and sulk.\n\n"
    },
    {
      "time": "27 Feb 2003 — 10:10am",
      "content": "[This might also answer some questions.](http://web.archive.org/web/20130820082914/http:/koeiekat.itrini.com/)\n\n"
    },
    {
      "time": "27 Feb 2003 — 10:41am",
      "content": "nice.   \n   \ntypophile - watch your back. There's a hungry new playa on the block.\n\n"
    }
  ]
}
