{
  "id": "100822",
  "title": "Help! - trying to approximate Helvetica Neue Rounded Light",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello, I'm having a frustrating font problem that perhaps someone here could help with. I created some text in Photoshop using Helvetica Neue Ultralight. Then I added a faux bold to it which made it look very similar to Neue Light. However, for some reason the faux bold also added a rounded appearance to the text which I really like. You can see the text here: [www.moderncharms.blogspot.com](http://web.archive.org/web/20150424024517/http:/www.moderncharms.blogspot.com/ \"www.moderncharms.blogspot.com\") it's the \"MODERN CHARMS\" at the top of the page. Now I'm working on a print layout and I want the text to look like this, but I can't use text from photoshop because it is not a vector program so the text will not look sharp when printed. I can't even convert this text into shapes in photoshop because the program refuses to convert anything to shape that utilizes a faux bold. So i figured I would just purchase the font Helvetica Neue Rounded Light, but it turns out there is no such thing. So I'm trying to find a good alternative. I considered Arial Rounded Light, but the capital 'R' is quite different which I don't like and since it occurs twice in \"MODERN CHARMS\" I'm hoping not to have to use this font. If anyone has any suggestions or recommendations I would greatly appreciate them.\n\nMark\n\n",
  "author": "Mark Palm",
  "time": "24 Feb 2013 — 5:12pm",
  "uid": "209242",
  "comments": [
    {
      "time": "24 Feb 2013 — 8:51pm",
      "content": "If all you need is \"MODERN CHARMS\" just render the text in Helvetica Neue Ultralight using Illustrator and modify the outlines (or scan, trace and clean up a rendering/printout of the bold/rounded version). If you want an actual font you would ideally open Helvetica Neue Ultralight in a font editor (like FontLab) and make a new font that's just how you like it. However I think Linotype's EULA forbids modification, at least not without permission. Personally I actually don't mind people violating such a \"no-mod\" clause, as long as they make sure the derivative font doesn't get distributed; and if does get distributed and they get caught, they need to pay for the consequences. So: taking personal risks, and accepting the associated responsibilities.\n\nhhp\n\n"
    },
    {
      "time": "24 Feb 2013 — 9:21pm",
      "content": "Thanks for the advice. There is going to be a great deal of text in the project I'm working on so just modifying the outlines of \"MODERN CHARMS' won't really solve the problem, but using a font editor to create an entire alphabet is a great idea. I will look into FontLab right away.\n\n"
    },
    {
      "time": "24 Feb 2013 — 9:46pm",
      "content": "And if you find font editing to be too tedious or treacherous, that's what type designers are for. :-) There are quite a number of Typophile regulars who could do the job for you\\* including yours truly: hpapazian at gmail dot com.\n\n\\* After getting permission from Linotype, since it would necessarily involve \"distribution\".\n\nhhp\n\n"
    }
  ]
}
