{
  "id": "100821",
  "title": "What are the best free fonts to write a book?",
  "forum": "General Discussions",
  "tags": [
    "best",
    "book",
    "font",
    "Free",
    "General Discussions",
    "libre",
    "Open Source",
    "publish",
    "write"
  ],
  "content": "Hello everybody,\n\nwhich free fonts do you consider the best to publish books? I will self publish books under CC, that's why they must be free. There are some amazing ones that are non-free, especially from Adobe, but I couldn't fine anyone that was clean, light and elegant enough to provide a pleasant reading. So maybe you know some. ;)\n\nBy the way [this website](http://web.archive.org/web/20131012154000/http:/www.webdesignerdepot.com/2011/02/30-of-the-best-font-foundries/) contains a description of \"Stone Type Foundry\", the same font in the attached image. I was astonished how beautiful and elegant it is, and I think it must be perfect to publish a book. Unfortunately it's paid. But what do you think of it? Just curious.\n\nThanks!\n\n ![](http://web.archive.org/web/20131012154000im_/http:/typophile.com/files/stonetype_4910.jpg)\n\n",
  "author": "mattmax",
  "time": "24 Feb 2013 — 2:22pm",
  "uid": "209238",
  "comments": [
    {
      "time": "24 Feb 2013 — 3:06pm",
      "content": "Sorry, your \"best\" question doesn't make sense. If there were a \"best,\" everyone would be using it; it would be all over the net. So first step is \"best\" for what? Romantic poetry? Historical fiction? Social sciences? Physics? And ink on paper or pixels on screen? If on screen, PDF or EPUB?\n\nMoving on, I know current publishers call themselves \"content providers.\" Which is silly, the author is the content provider. The publisher's role is, say, that of \"content assurer.\" The work of editors and designers (and typesetters) adds a level of quality few authors can bring to their content. Think about that.\n\nI'd assume by \"free\" you mean what's generally meant by \"libre.\" \"Libre\" with fonts means, usually, that the license permits unlimited use, except for (re)selling the fonts. But licenses vary, you need to understand them.\n\nAll of that said, I'm an advocate of libre fonts. And almost all of them need some work to be brought up to first-class status. \"Best of the ho-hum\" isn't a particularly good place.\n\n\\* \\* \\*\n\nSumner Stone's done fine work over the years. A polished professional. What you would expect from the guy who, when at Adobe, hired Slimbach & Twonbly & generally built Adobe's font department in earlier days...\n\nHowever, most of his fonts were drawn when ink was put on paper in a slightly a different way, and have not been re-weighted for DTP printing. Some find that a problem. But web and ink are different...\n\nYou sure you don't want some quality assurance?\n\n"
    },
    {
      "time": "24 Feb 2013 — 3:21pm",
      "content": "Why does self-publishing books under a CC-license require a free font, and what are the specific terms? As I understand it CC-licenses have multiple levels.\n\nBtw: When judging a typeface, you need to look at it in context. The letterforms of Sator might look beautiful up close and alone, but it tells you nothing about how it will preform in your book. And that list, while it contains some interesting foundries, is utter bull crap. Never trust those lists. That’s the road to perdition.\n\n"
    },
    {
      "time": "24 Feb 2013 — 6:17pm",
      "content": "There certainly are some fine fonts for printing books among those which are open-source. Fanwood and Linden Hill, both from The League of Movable Type, are two I can recommend unreservedly.\n\n"
    },
    {
      "time": "24 Feb 2013 — 7:44pm",
      "content": " **cebg:**  \nBy \"best\" I mean fonts that are \"clean, light and elegant enough to provide a pleasant reading\", in other words: fonts that are beautiful and do not cause our eyes to get tired. The books will be non-fiction, mostly social sciences. They will be released only in PDF.\n\nI don't understand anything about professional publishing and the structure behind it, however publishing books will be mainly a hobby to me, and I still have plenty of time to study more about the field.\n\nYes, by \"free\" I mean \"libre\".\n\nThank you for your opinion on Sumner Stone's work, it is much appreciated.\n\n**Frode Bo Helland:**  \nA CC-license does not require a libre font, I just want to use them because I want to make the work entirely free, from the content to the font, and (correct me if I am wrong) I think that depending on the font you use you have to embed it in the PDF file.\n\nThanks for the tip about the website, I agree with you. I think website owners worry more about making profit than delivering good content these days, lol.\n\n**quadiblock:**  \nThose fonts are beautiful, especially Linden Hill, but I think they are very small. They only looked a little better at 14 pt. Anyway, thank you for your help, I liked the website and the fonts look cool.\n\n"
    },
    {
      "time": "24 Feb 2013 — 8:44pm",
      "content": "<cite>The books will be non-fiction, mostly social sciences. They will be released only in PDF.</cite>\n\nFWIW, I have used a reworked version of Charis-SIL in this context. Two books set in Charis, designed by Cherie Westmoreland, were selected for the AAUP Book Show. To the best of my knowledge, these are the only Libre fonts ever used in an AAUP Book show selection.\n\nCharis-SIL is esentially the same as Bitstream Charter, a font family designed by Matthew Carter (a MacArthur grant recipient). It is not, perhaps, generally regarded as an elegant font, but is eminently readable.\n\nModifications we made were basically in spacing, and cutting old-style numbers -- not particularly needed for social sciences.\n\nA good companion sans, if you want one, is Lato.\n\nI can look tomorrow for an Amazon \"Look Inside\" to show it's use...\n\nEdit:\n\nIn the meantime:\n\n[http://www.bing.com/images/search?q=charis+SIL&qpvt=charis+SIL&FORM=IGRE](http://web.archive.org/web/20131012154000/http:/www.bing.com/images/search?q=charis+SIL&qpvt=charis+SIL&FORM=IGRE \"http://www.bing.com/images/search?q=charis+SIL&qpvt=charis+SIL&FORM=IGRE\")\n\n[http://www.bing.com/images/search?q=Lato+fonts&qs=n&form=QBIR&pq=lato+fo...](http://web.archive.org/web/20131012154000/http:/www.bing.com/images/search?q=Lato+fonts&qs=n&form=QBIR&pq=lato+fonts&sc=8-10&sp=-1&sk= \"http://www.bing.com/images/search?q=Lato+fonts&qs=n&form=QBIR&pq=lato+fonts&sc=8-10&sp=-1&sk=\")\n\n"
    },
    {
      "time": "24 Feb 2013 — 10:12pm",
      "content": "[Gentium Book](http://web.archive.org/web/20131012154000/http:/scripts.sil.org/cms/scripts/page.php?item_id=Gentium&_sc=1) is quite attractive but perhaps it's a bit archaic-looking for your criteria.\n\n[Linux Libertine](http://web.archive.org/web/20131012154000/http:/www.linuxlibertine.org/index.php?id=1&L=1) is quite readable and decent-looking, if not particularly \"beautiful\".\n\n[Sorts Mill Kis](http://web.archive.org/web/20131012154000/http:/chemoelectric.deviantart.com/art/Sorts-Mill-Kis-snapshot-181216490) is very looks very nice, although I haven't used it myself so I can't say much more.\n\n"
    },
    {
      "time": "25 Feb 2013 — 3:35am",
      "content": "Of course, given the books are non-fiction, you may indeed want something plain and not fancy.\n\nIn which case, you may just want to go [here](http://web.archive.org/web/20131012154000/http:/www.gust.org.pl/projects/e-foundry/tex-gyre/) for open-source lookalikes to some _very_ popular typefaces - thus, Pagella, Schola, and even Termes might be of interest.\n\n"
    },
    {
      "time": "25 Feb 2013 — 5:17am",
      "content": "What is it about your CC-license that makes a free font a requirement? Do you allow people to edit and reprint/republish the book? Do you provide source files for them?\n\n_I think that depending on the font you use you have to embed it in the PDF file._  \nYes, most likely, but there is no reason why you can’t embed a commercial font in a PDF, as long as the EULA allows it or you negotiate a special deal with the foundry.\n\nI don’t mind if you want to use a free font, I’m just curious as to why.\n\n"
    },
    {
      "time": "25 Feb 2013 — 6:11am",
      "content": "In progress — [http://readthetype.com/ost](http://web.archive.org/web/20131012154000/http:/readthetype.com/ost \"http://readthetype.com/ost\")\n\n"
    },
    {
      "time": "25 Feb 2013 — 3:28pm",
      "content": "@Frode Bo Helland:  \n<cite>Do you allow people to edit and reprint/republish the book? Do you provide source files for them?</cite>\n\nWell, the answer _has_ to be \"yes\" to those questions if the book itself is under an open-source license. So you have to be able to do those things to every part of the book in the format (i.e. .doc, .odt, .pdf) in which it will be distributed - and that includes the fonts.\n\nNow, why he would need to make his book open-source instead of just free as in beer is unclear. Perhaps it's a nonfiction book to which others could usefully add. Or perhaps it includes extensive quotation from another book that's under an open-source license, in which case it _must_ be open-source. Or perhaps he chose to have that license to support the open-source movement.\n\n"
    },
    {
      "time": "25 Feb 2013 — 3:45pm",
      "content": "I ask because Matt said it would be distributed as PDF only, and PDF is not an easily editable format.\n\n"
    },
    {
      "time": "26 Feb 2013 — 8:22pm",
      "content": " **altsan:**  \nGentium fonts look really nice, especially Gentium Basic and Gentium Book Basic, unfortunately you are right that they look kinda archaic. :/ But... who knows? Maybe they work well. ;)\n\n**quadiblock:**  \n<cite>\"Now, why he would need to make his book open-source instead of just free as in beer is unclear.\"</cite>\n\nI want to make the books \"free as in freedom\" (aka \"libre\"), under CC-BY and CC-BY-SA. The books will be computer manuals. You're right, in this case it's not obligatory to use libre fonts, I could use commercial fonts \"with exceptions\", but as I support software libre, I want to make them completely libre if possible, from the font until the content. That's the reason.\n\n**quadiblock** and **Frode Be Helland:**  \nThe books will be released in PDF to the general public, but they will also be released in ODF format in case others want to modify it. ;)\n\n...\n\nI will look at the websites and fonts you provided and post my opinion here. If you have any more suggestions please post here. Your help is very appreciated!\n\nThank you!\n\n"
    },
    {
      "time": "1 Mar 2013 — 12:19pm",
      "content": "Alegreya is a very good libre book type. Rosarivo also.\n\n"
    },
    {
      "time": "1 Mar 2013 — 1:02pm",
      "content": "Alegreya seems quite capable and solid, but Rosarivo looks to be pretty poorly spaced (besides being very old-fashioned).\n\nhhp\n\n"
    },
    {
      "time": "15 Mar 2013 — 1:13pm",
      "content": "[http://typographica.org/features/our-favorite-typefaces-of-2012/](http://web.archive.org/web/20131012154000/http:/typographica.org/features/our-favorite-typefaces-of-2012/ \"http://typographica.org/features/our-favorite-typefaces-of-2012/\")  \nSo, out of 54 selections there are a whopping total of... **one** open-source fonts. And that's by Adobe! \"It's an evil Font Mafia CONSPIRACY, I tell you!!\"\n\nhhp\n\n"
    },
    {
      "time": "15 Mar 2013 — 3:03pm",
      "content": "Hrant, since you mentioned Alegreya, it’s on the Typographica list, and it’s also Open Source – but there’s a paid version too.\n\nYou can [get 6 fonts for free at Google](http://web.archive.org/web/20131012154000/http:/www.google.com/webfonts/specimen/Alegreya) – or [10 fonts for $400](http://web.archive.org/web/20131012154000/http:/www.myfonts.com/fonts/huertatipografica/alegreya-ht-pro/). Hmmm.\n\n"
    },
    {
      "time": "15 Mar 2013 — 4:58pm",
      "content": "The free fonts have a little less that 500 glyphs each, the fonts that are sold $65 each have about 840 glyphs each, including small caps that are not to be found in the free fonts. Maybe someone that has $400 loose can check for the other differences...\n\n"
    },
    {
      "time": "15 Mar 2013 — 5:37pm",
      "content": "Alegreya SmallCaps are also included in Google Webfonts  \n [http://www.google.com/fonts/specimen/Alegreya+SC](http://web.archive.org/web/20131012154000/http:/www.google.com/fonts/specimen/Alegreya+SC \"http://www.google.com/fonts/specimen/Alegreya+SC\")\n\n"
    },
    {
      "time": "16 Mar 2013 — 4:09am",
      "content": "> The free fonts have a little less that 500 glyphs each, the fonts that are sold $65 each have about 840 glyphs each, including small caps that are not to be found in the free fonts.\n\nWell that's just not true. For example, Linux Libertine has 2000 glyphs, Junius Unicode has 3280, and both have small caps.\n\n"
    },
    {
      "time": "16 Mar 2013 — 6:54am",
      "content": "Junius Unicode, or Junicode, is another very nice one - but like 1911 Goudy Bookletter, it doesn't function well in WordPad, even though it seems to have the necessary encoding settings.\n\n"
    },
    {
      "time": "16 Mar 2013 — 7:25am",
      "content": "Bogdan, Michel was talking specifically about Alegreya.\n\nOK guys, I'll give you 1.5 open-source fonts among 54. Yippee.\n\nhhp\n\n"
    }
  ]
}
