{
  "id": "1008",
  "title": "Refused logos/works",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Another shame gallery ![:-)](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/clipart/happy.gif) Does anyone had logos or works that were refused by the client? Here's one I did last year (a low budget logo creation). See the one they accepted by other company...   \n ![](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/messages/4100/14584.gif)\n\n",
  "author": "adriano",
  "time": "22 Aug 2003 — 9:35am",
  "uid": "1735",
  "comments": [
    {
      "time": "22 Aug 2003 — 9:55am",
      "content": "Ugh. Everyone is a designer! That is quite an \"S\"!!\n\n"
    },
    {
      "time": "22 Aug 2003 — 10:08am",
      "content": "check Nescafe!   \n [http://www.typophile.com/forums/messages/83/14508.html?1061559188](http://web.archive.org/web/20131017115900/http:/www.typophile.com/forums/messages/83/14508.html?1061559188)   \n   \nrefused logo stories are always sad ones\n\n"
    },
    {
      "time": "22 Aug 2003 — 10:28am",
      "content": "I'm not sure they've rejected this already, but they never got back to me, so...   \n   \n ![nareg.gif](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/messages/4100/14586.gif)   \n   \nAbove is the semi-finished proposed logo for an upcoming festival for an Armenian saint - it's a ligation of the five-letter name \"Nareg\", set below for reference.   \n   \nhhp\n\n"
    },
    {
      "time": "22 Aug 2003 — 10:54am",
      "content": "Hrant: Looks like it could be used as a weapon! ![](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/clipart/wink.gif)\n\n"
    },
    {
      "time": "22 Aug 2003 — 11:14am",
      "content": "Hey, I guess so! Maybe by the Armenian Beastmaster.   \n(Figures...)   \n   \nSpeaking of shapes that \"feel\" very different in different cultures, check out the image here, taken in a Bangkok temple complex:   \n   \n(~120K) [http://www.themicrofoundry.com/other/bang.jpg](http://web.archive.org/web/20131017115900/http:/www.themicrofoundry.com/other/bang.jpg)   \n   \nhhp\n\n"
    },
    {
      "time": "22 Aug 2003 — 12:24pm",
      "content": "I see some \"klingon\" in that there ligation.   \n   \n ![:-)](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nhildebrant.\n\n"
    },
    {
      "time": "22 Aug 2003 — 2:28pm",
      "content": "Haha. I can spot a Trekkie from a mile away! I was thinking the same thing...scary! The infamous \"Batleth\"!!\n\n"
    },
    {
      "time": "22 Aug 2003 — 2:38pm",
      "content": "What about your picture, Hrant? What shapes?   \nIt's a beautiful place, nothing strange there.\n\n"
    },
    {
      "time": "22 Aug 2003 — 2:46pm",
      "content": "Tom, you mean me? I'm not a Tekkie. But I'd be curious to find out if the guy who invented Klingon (no, I don't mean the Klingons) based it on Armenian (or maybe Ethiopian).   \n   \nEduardo, aren't there shapes in there that you see as somewhat \"demonic\"? Like the ngao (the spikes at the edges of roofs), an archetypal Thai shape. BTW, how Japanese are you?   \n   \nhhp\n\n"
    },
    {
      "time": "22 Aug 2003 — 4:49pm",
      "content": "Hrant: Actually, no, I was referring to Kyle. When he mentioned the [Klingons](http://web.archive.org/web/20131017115900/http:/www.kli.org/), I was surprised because it was my first visual impression. I think you are correct though; there are a lot of references to different cultures in Star Trek.   \n   \nEduardo: It is merely a tongue-in-cheek reference. Not to be taken seriously.\n\n"
    },
    {
      "time": "22 Aug 2003 — 8:58pm",
      "content": "\\>Not to be taken seriously.   \n   \nOh, I see. :-)   \nAnyway, I can't see anything \"demonic\" there.   \nHow Japanese I am? Hard to tell.\n\n"
    },
    {
      "time": "22 Aug 2003 — 9:14pm",
      "content": "Eww, Tiffany, is the last one the one they chose?   \n   \nGod, normal people need to have their graphical decisions made for them...the first one was great! Like that out of the whole bunch.   \n   \nAnd if not that one, the second one, but maybe without Dalliance.\n\n"
    },
    {
      "time": "22 Aug 2003 — 9:25pm",
      "content": "Very nice, Tiffany. I particularly like the second one.   \n   \nI recently had my own first really difficult clients. At the beginning, they were open to anything. After I submitted a few options, they decided they wanted this really ugly sketch of a triangle and several mismatched fonts inside it. Here are my initial designs (the clients were Alaskan, by the way):   \n ![1](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/messages/4100/14619.jpg)   \n   \nThis is what they eventually purchased, from another designer:   \n   \n ![2](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/messages/4100/14620.gif)   \n   \nPaul\n\n"
    },
    {
      "time": "22 Aug 2003 — 10:23pm",
      "content": "It's got speed, a swoosh _and_ a mountain! Your stuff only had a star.   \n   \nhhp\n\n"
    },
    {
      "time": "22 Aug 2003 — 11:41pm",
      "content": "Tiffany: I love the first one! Too bad the family got involved.   \n   \nPaul: That is scary! They should be flogged with their own logo!\n\n"
    },
    {
      "time": "23 Aug 2003 — 1:54am",
      "content": "Paul, what font did you use for the last version, the one with prime in blue and tech in green.\n\n"
    },
    {
      "time": "23 Aug 2003 — 5:20am",
      "content": "Tiffany, what's the sans font used on the first one?\n\n"
    },
    {
      "time": "23 Aug 2003 — 2:00pm",
      "content": "Chris, that's good ol' Stone Informal. ![:-)](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/clipart/happy.gif) I think I may be on a Stone kick right now.   \n   \nTiffany, exactly. My project went downhill when the guy's wife took over, and then all the employees put in their, ahem, ideas.\n\n"
    },
    {
      "time": "23 Aug 2003 — 3:33pm",
      "content": "exactly, that \"family\" also ruined the SIRMAF logo... they \"loved\" the old S so they just did a change to the color I presented.\n\n"
    },
    {
      "time": "29 Aug 2003 — 3:14pm",
      "content": "Tiffany, I'm in your camp I love Emigre fonts!\n\n"
    },
    {
      "time": "8 Sep 2003 — 2:11pm",
      "content": "[http://www.typophile.com/forums/messages/4100/15588.html?1062975429](http://web.archive.org/web/20131017115900/http:/www.typophile.com/forums/messages/4100/15588.html?1062975429)   \n   \nMy refusal. ![:-(](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": "9 Sep 2003 — 2:03pm",
      "content": "Here a logo for a ballooning company. My client is more conservative. He found this to much 'Harley Davidson' which I can understand. Anyway I like the logo.   \n   \n ![ballooning](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/messages/4100/15837.jpg)   \n   \nRen\n\n"
    },
    {
      "time": "9 Sep 2003 — 2:13pm",
      "content": "Or maybe the question mark was too unnerving for a balooning company... :-)   \n   \nhhp\n\n"
    },
    {
      "time": "22 Aug 2003 — 5:17pm",
      "content": "Well. I'll join this party. The logos I'm about to show you ... well, the client was great. He's an endodontist that managed to find excuses to go golfing all of the time. He had a good sense of humor and realized that what he does for a living scares some people to death. We went through many wild rounds of ideas. These I think are the best.   \n   \nFirst. He showed me the negative of one of the roots. They file them in separate sleeves with information. That is from whence came this concept:   \n   \n ![](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/messages/4100/14613.gif)   \n   \nAnd then there was the \"old-time\" dentist, but a little on the morbid side:   \n   \n ![](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/messages/4100/14614.gif)   \n   \nBut in the end...after the family had there vote :wink: the only thing that seemed to stay constant was Perpetua.   \n   \n ![](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/messages/4100/14615.gif)\n\n"
    },
    {
      "time": "23 Aug 2003 — 7:21am",
      "content": "Yes. The fear that is put into all designer's is that the family will get involved. However, it is a reality. I make a point of always talking very openly about who will be involved in the decision making from the beginning. I ask about there likes and dislikes. We discuss why this is good or bad. Etc. Being open from the beginning helps everyone. Even with bigger companies. Granted I'm not sure it works that way with corporations, but I'm sure within the larger realmn (so to speak) you still have an equivalent with which you have to deal.   \n   \nBJ, the sans is Cholla. ![:-)](http://web.archive.org/web/20131017115900im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    }
  ]
}
