{
  "id": "100896",
  "title": "Do these three specifics sound like a font you know?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm currently working on a website for a new industrially designed product and have an oddly specific client font request.\n\nIn the client's words:  \n\"The capital M must have straight sides and the bottom of the point must be in line with the two arms.  \nThe capital A's uppermost point must be slightly flattened rather than ending in a sharp point.  \nThe lowercase a should be of the kind that does not have an arm over the top of it but rather looks more like an o with a line in the back.\"\n\nSome background on the job:  \nThis is for use throughout the site in both headings and body copy.  \nFonts I had in mind for use were (one of the following) Formata, Myriad Pro or Open Sans\n\nThe only font I can find that meets this criteria is [Muli](http://web.archive.org/web/20150419010134/http:/www.google.com/webfonts/specimen/Muli) but with no bold weight it's rather limited for comprehensive use.\n\nAnyone think of any alternatives?\n\n",
  "author": "eatingcrayons",
  "time": "26 Feb 2013 — 5:16pm",
  "uid": "38074",
  "comments": [
    {
      "time": "26 Feb 2013 — 5:33pm",
      "content": "Here's one... [http://www.myfonts.com/fonts/typeart/golden-days/](http://web.archive.org/web/20150419010134/http:/www.myfonts.com/fonts/typeart/golden-days/ \"http://www.myfonts.com/fonts/typeart/golden-days/\")\n\nSearched \"schoolbook sans\" on myfonts.\n\n"
    },
    {
      "time": "26 Feb 2013 — 5:38pm",
      "content": "Must it be a sans?\n\n"
    },
    {
      "time": "26 Feb 2013 — 5:47pm",
      "content": "Avante Garde Gothic\n\n"
    },
    {
      "time": "26 Feb 2013 — 6:01pm",
      "content": "Those specs -especially for the \"a\"- do point to a sans, but you might want a serif font anyway. FYI serif fonts that have an \"a\" like that are often termed \"Primary\" since they're supposed to be reading-learner–friendly.\n\nBTW for clients that are this picky it's worth a shot pitching a custom -or at least customized- font, since they typically always find _something_ they don't like in an existing font no matter how many you show them!\n\nhhp\n\n"
    },
    {
      "time": "26 Feb 2013 — 6:55pm",
      "content": "I have really only considered using sans so far due to the nature of the product. I really want a modern, clean feel to the site, well as much as possible with client requirements!\n\n"
    },
    {
      "time": "26 Feb 2013 — 6:58pm",
      "content": "Cheers Si\\_Daniels and hrant. Both \"primary\" and \"schoolbook sans\" are useful classifications in my search. Golden Days is a great place to start as well, will test it out for body copy and see how it feels.\n\nNot so sure about Avante Garde Gothic as a body copy font, might start to get a bit busy to read large chucks.\n\nBTW. My wife is a new entrants teacher and she professes a love for comic sans for beginner readers.\n\n"
    },
    {
      "time": "26 Feb 2013 — 7:09pm",
      "content": "Using identifont.com, filtering on MAa, it came up with this serif font  \n [Odile](http://web.archive.org/web/20150419010134/http:/tinyurl.com/b9hcbs3)\n\n"
    },
    {
      "time": "27 Feb 2013 — 4:43am",
      "content": "Charis SIL Literacy is a possibility.\n\n"
    },
    {
      "time": "27 Feb 2013 — 5:57am",
      "content": "Avantgarde\n\n"
    },
    {
      "time": "27 Feb 2013 — 6:22am",
      "content": "> Not so sure about Avante Garde Gothic as a body copy font\n\nYes, please don't!\n\n"
    },
    {
      "time": "27 Feb 2013 — 6:48am",
      "content": "@eating crayons:  \n<cite>My wife is a new entrants teacher and she professes a love for comic sans for beginner readers.</cite>\n\nActually, one of the few legitimate applications of Comic Sans is for informal printing somehow associated with children.\n\n"
    },
    {
      "time": "27 Feb 2013 — 8:47am",
      "content": "Damning with faint praise!\n\nHowever, CS is the perfect face for all those (such as CERN scientists) who want to demonstrate a lack of spin in their publications—and that’s a broad swath of legitimacy, even if the naïveté CS represents is faux to the congnescenti.\n\n"
    },
    {
      "time": "27 Feb 2013 — 9:13am",
      "content": "The [Heinemann Collection](http://web.archive.org/web/20150419010134/http:/www.myfonts.com/search/heinemann/fonts/) fits your needs. [Apertura](http://web.archive.org/web/20150419010134/http:/www.fontshop.com/fonts/foundry/betatype/) by Betatype, too, but haven’t found a Webfont option …\n\n"
    },
    {
      "time": "27 Feb 2013 — 11:40am",
      "content": "\\> an oddly specific client font request\n\nWow, \"oddly specific\" is right. I've had picky clients but never to that degree. I hope your client is knowledgable about design and has good taste, or else you might be in for a rough job!\n\n"
    },
    {
      "time": "27 Feb 2013 — 11:50am",
      "content": "In my experience, clients who know exactly what they want often don’t…\n\n"
    },
    {
      "time": "27 Feb 2013 — 12:12pm",
      "content": "Fantastic, cheers for the recommendations. Apertura and Heinemann are really nice! The web version of Heinemann will work well with my design.\n\nI do like Charis SIL Literacy but it's not quite the right feel for this job.\n\noldnick, I totally agree with your comment. Fingers crossed for the rest of the job!\n\nThanks everyone for the help.\n\n"
    }
  ]
}
