{
  "id": "100909",
  "title": "Books on practicalities of learning calligraphy",
  "forum": "General Discussions",
  "tags": [
    "books",
    "callygraphy",
    "General Discussions"
  ],
  "content": "Hello everyone,\n\nI'd love to delve into murky waters of calligraphy but I'm struggling to find a good book on the practical side of it. I'm reading The Stroke: Theory of writing but it is what it says on the cover - theory. I was wondering if there's some sort of a calligraphy bible that is field tested and approved by the community.\n\nAny guidance would greatly appreciated.\n\n",
  "author": "SCRL",
  "time": "27 Feb 2013 — 5:56am",
  "uid": "170297",
  "comments": [
    {
      "time": "27 Feb 2013 — 9:08am",
      "content": "Do you mean calligraphy, or calligraphic (better termed chirographic) type? If it's the former, Typophile isn't the best place to ask, since it's about type, which is essentially different than calligraphy. If it's the latter, Gerrit Noordzij is in fact the doyen of chirographic type (although you will actually find a great deal of discussion about such things on Typophile).\n\nThat said, my favorite book on calligraphy is Claude Mediavilla's monumental \"Calligraphy\" (which I have in the French, but I believe has been made available in an English version as well).\n\nhhp\n\n"
    },
    {
      "time": "27 Feb 2013 — 8:54am",
      "content": "Hermann Zapf: Creative Calligraphy. A great little primer on calligraphy\n\nAlso Charles Pearce: The Anatomy of Letters.\n\nBoth are wonderful little books on calligraphy with varying degrees of instruction.\n\n"
    },
    {
      "time": "27 Feb 2013 — 10:02am",
      "content": "There is a nice new little book I recently came across called: The Art of Calligraphy and Lettering by Walter Foster which starts with basic calligraphic step by step alphabets and moves to unique modern characters. It features four lettering artists, one of them being John Stevens which is the reason I personally bought the book.\n\n"
    },
    {
      "time": "8 Mar 2013 — 5:09am",
      "content": "Thank you all for your feedback!  \nJust got The art of calligraphy and lettering. This one was the easiest to get my hands on at the moment.\n\n@hrant I'm perfectly aware that this forum is not concerned with calligraphy but I thought I'll try my luck here first. It's my go to place when it comes to researching type related problems and it worked (:\n\nThanks again!\n\n"
    },
    {
      "time": "10 Mar 2013 — 6:38pm",
      "content": "Odd that the two non biting responses came from calligraphers/lettering artists who happen to be font designers.  \nCalligraphy is the accepted term!\n\n"
    },
    {
      "time": "10 Mar 2013 — 6:42pm",
      "content": "Hey, I can rhyme that! Calligraphy is the accepted turd.\n\nhhp\n\n"
    },
    {
      "time": "12 Mar 2013 — 10:59am",
      "content": "I see your ill behaved children are playing with the computer Hrant.\n\n"
    },
    {
      "time": "12 Mar 2013 — 11:54am",
      "content": "Hang on a sec lads ... I'm going to grab some popcorn for the upcoming entertainment ...\n\nn.\n\n"
    },
    {
      "time": "12 Mar 2013 — 11:55am",
      "content": "I'm so proud of my oldest son: he was around 5 when he realized that good letters are made from outlines, not painted.\n\nhhp\n\n"
    },
    {
      "time": "22 Mar 2013 — 4:49pm",
      "content": "Sounds like the sign of an oppressive mentor.\n\n"
    },
    {
      "time": "22 Mar 2013 — 4:51pm",
      "content": "Sounds like a frothing stalker.\n\nhhp\n\n"
    },
    {
      "time": "22 Mar 2013 — 6:15pm",
      "content": ":-)\n\n"
    }
  ]
}
