{
  "id": "100975",
  "title": "New Consulting Logo - Suggestions Please",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm in the process of setting up a new consulting business and welcome any suggestions on the design of my new logo. It's a consulting business that helps other businesses to grow and overcome difficult situations.\n\nBelow is a rough layout of what I was thinking. I'm open to suggestions on the layout and the best fonts to you use for this type of logo. The brand is about being professional, modern and mature.\n\n ![](http://web.archive.org/web/20150418205443im_/http:/typophile.com/files/logo_5915.png)\n\nThanks!\n\n",
  "author": "shanemackintosh",
  "time": "28 Feb 2013 — 8:12pm",
  "uid": "209414",
  "comments": [
    {
      "time": "28 Feb 2013 — 10:24pm",
      "content": "My first thought is that making the icon male may not be a good idea. I'd avoid identifying a company with a particular gender unless there was a very good reason to do so.\n\nOr is this maybe a one-person company and the icon represents you and the way you dress?\n\n"
    },
    {
      "time": "1 Mar 2013 — 8:16am",
      "content": "It is really important to put a lot of thought into what exactly you want to communicate. This makes me think of secret agents of the government like the movie 'Men in Black'. The tippy toes almost says ballet or floating. It feels like a 1940's idea of what business is, and I wouldn't be surprised at all if your clients are more interested in a more cutting edge approach. The name says entourage, but there is only one guy - this is a little confusing. The name almost suggests that you will get a bunch of people working on your business.\n\nAs for the look, the leading could use a lot of work. Too tight for me. Also consider how this reproduces at 1cm x 1cm. I think you will find that many of the small details are lost.\n\n"
    },
    {
      "time": "1 Mar 2013 — 9:53am",
      "content": "Forget the green, worry about colour later. Do it in B&W for now.\n\nIncrease inter-letter spacing of “CONSULTING” to fill horizontal space.\n\nEliminate inter-letter spacing of “the business renovators” and increase type size to match width of “entourage.”\n\nThen work on vertical spacing.\n\n_Then_ start colour selection.\n\n"
    },
    {
      "time": "1 Mar 2013 — 9:55am",
      "content": "And remove all gender references. Potential for miscommunication too risky.\n\nFinalize type first, then think about mark.\n\n"
    },
    {
      "time": "1 Mar 2013 — 6:33pm",
      "content": "Thanks for all the comments! There's some really good points that have been raised that I hadn't thought. I now see that the current logo I posted may cause too much confusion.\n\nI've attached some other designs that I had done up. What are some opinions on these and what stands out to you?\n\n ![](http://web.archive.org/web/20150418205443im_/http:/typophile.com/files/concepts_4651.png)\n\n"
    },
    {
      "time": "1 Mar 2013 — 9:34pm",
      "content": "The type is cramped. Work on some layouts that give it room to breath.\n\nI'm also not a fan of the suited person. It doesn't really say anything about your business (other than you maybe wear wing tips? ;)\n\nThe other designs are all rather generic and don't add much.\n\nI'd really just focus on your type for now. Get that right first. Then see if you even need a mark to go with it.\n\n"
    },
    {
      "time": "2 Mar 2013 — 3:58am",
      "content": "Ok I'll just focus on the type of the moment. Do you have any recommendations?\n\n"
    },
    {
      "time": "2 Mar 2013 — 9:14am",
      "content": "I'd agree that the type seems cramped (both the letter spacing and the space between lines). To me the lower case versions are more interesting visually.\n\nAs for the mark, frankly I'm not sure you even need one; a nice type treatment might be enough. But to comment on the ones you're showing, for 1-2 if you're going to show a bar graph, show it going up, not down (because you're improving their business). 3-4 seem too abstract. 5-6 an icon of people could definitely be a direction to explore, but it's also a symbol that's overused and neither of the treatments you show seem very interesting to me. 7-10 a stylized \"e\" is certainly a possibility, but none of those seem very interesting to me. Like I said, try some typographic solutions and you may find that's all you need.\n\nYour tag line (the business renovators) is tiny; it'll be hard to read when the logo is small.\n\n"
    },
    {
      "time": "2 Mar 2013 — 9:48am",
      "content": "Shane, I think you have some good ideas floating around, but to be brutally honest: you're probably good at your consulting business - hire somebody who's good at designing logos... :-/ Of course he will need to listen to your ideas to do a good job of it - that's basically your main role in the design of your logo. Unless you see this as a way of learning how to become a graphic designer, mostly to me you're wasting time compromising the visual effectiveness of your identity.\n\nThat said, one thing Typophile _can_ help you with is finding some fonts that convey ideas that mesh with your business. Plus critique the work of a _professional_ graphic designer, in order to identity problems or refine things a bit. But really, that's about it.\n\nhhp\n\n"
    },
    {
      "time": "2 Mar 2013 — 11:30am",
      "content": "I’m totally with hrant on this one. Give a designer money in exchange for their knowledge, training, skills, and experience. The same way you intend clients to approach you. This sort of “self surgery” is an inefficient consumption of your resources. Hire a professional who can produce greater quality in less time, and redirect the energy you would spend trying to do it yourself back into your business. In the collective time we have spent talking, your business cards would be in your wallet.\n\nThat said, I think you’re moving farther away from a solution and over complicating things. Ignore all marks entirely. Ignore colour. Only focus on the type in black and white. You might not even need a mark after the type is sorted.\n\nI strongly recommend you take the “pay a professional” route though. People here are capable of doing in seconds what you would not ever be able to accomplish alone. Such as my father prescribing medication. Trust me. There are _highly_ specialized professionals here. Some of the best in the world. You can contact anyone of them directly by clicking on their name.\n\n"
    },
    {
      "time": "2 Mar 2013 — 4:43pm",
      "content": "Hi guys, Thanks for the feedback, I really appreciate it. While I've always dabbled in design and like to do little bit on the side, I'm by no means an expert, especially when it comes to types and logo design.\n\nI completely agree about having a professional do the design, it's just I've hit boiling point with frustration trying to get designers to get this logo right. In the past I've been able to have high-end designers or creative agencies work on logo concepts but I'm in a different position this time. Against my better judgement I thought I would get a cheaper designer to come up with concepts but as you've seen, they are less than acceptable.\n\nThis seems a great forum with some real experts on type and logo design so I was hoping I could get some advice on a good type I could use for a short term logo so I can at least get my website live. Then when I have a bigger budget I can get a professional to do the logo and other design work I require.\n\nJust out of curiosity, what ballpark price do you guys charge for logo design?\n\n"
    },
    {
      "time": "2 Mar 2013 — 7:03pm",
      "content": "“…_what ballpark price do you guys charge for logo design?_”\n\nThat will vary depending on the designer and deliverable. I would not expect to see people posting their hourly rates however. Typophile isn’t really a job-board.\n\nI would recommend contacting some local design firms and speaking with them in person so you can provide them with an accurate description of your context, from which they can prepare you a proposal.\n\n[http://www.yellowpages.com.au/find/graphic-designers/broadbeach-qld](http://web.archive.org/web/20150418205443/http:/www.yellowpages.com.au/find/graphic-designers/broadbeach-qld \"http://www.yellowpages.com.au/find/graphic-designers/broadbeach-qld\")\n\n“_I've hit boiling point with frustration trying to get designers to get this logo right_.” and “_Against my better judgement I thought I would get a cheaper designer to come up with concepts but as you've seen, they are less than acceptable_.”\n\nIf I am reading this correctly, you paid less money for a sub-par solution which isn’t working for you. The cause of your frustration most likely stems from an incomplete project brief. Don’t shoot the messenger, but it sounds to me like you need to go back to the drawing board and start over with a thorough brief for sign-off before you proceed any further.\n\nWithout this **signed off and legally binding document** in place, you and your designer will simply end up going in circles debating who’s favourite colour is best. The end result will be an unhappy you with less money and a mark you don’t like, as well as a frustrated designer. Everybody loses. We have all seen this happen more times than we would like, but that’s what you get when you take an aesthetic shot from the hip, hoping to get lucky, compared to following a clearly documented process and making informed decisions _by design_ as opposed to by chance.\n\nI don’t know of any professional design organizations in Broadbeach, but you might have some luck asking other Typophiles on the **[General Discussions board](http://web.archive.org/web/20150418205443/http:/typophile.com/forum/4)**. I bet we’ve got a few Ausies in here somewhere…\n\n"
    },
    {
      "time": "2 Mar 2013 — 8:50pm",
      "content": "I agree with what Chris said. Talk to a number of designers, look carefully at their portfolios (especially logos), ask for references (the names of some clients you can phone to discuss how the jobs went), and get a written estimate.\n\nIf there are any local companies that have nice logos, ask them who designed it.\n\nKeep in mind that \"designing a logo\" can mean different things to different designers. For a low-bid designer it might just means spending an hour cranking out some top-of-his-head concepts. For a higher-priced designer it might mean spending a ton of time — having in-depth conversations with you about your business, spending many hours coming up with concepts, several meetings with you and lots of logo fine-tuning, design of your stationary (including getting printing bids for you and inspecting the proofs) and maybe designing your website, etc. The old saying \"you get what you pay for\" is often true.\n\n"
    },
    {
      "time": "2 Mar 2013 — 10:06pm",
      "content": "Hi Shane, to a potential client or even to a first glace viewer of your logo what do you want to impart?\n\nStart there. That's the key. From there your brand will unfold.\n\nIs it open friendly strong no nonsense? How about deep determined thoughtful? Stylish conservative modern and tech savvy? Or is it simply all about trust?\n\nWrite it down, make a list, develop a hierarchy of characteristics. Those characteristics that you understand your business/client relationship to be are those that you can comfortably promote. It's not something you can buy off the rack ...what makes E.C. unique to you?\n\nIt seems to me you were lost from the beginning ...but not anymore :)\n\n5star's version of amazing grace ...lol.\n\nn.\n\n"
    }
  ]
}
