{
  "id": "1009",
  "title": "Press Release 6/7/02: TypeCon2002 Programming Information Now Available Online.",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "FOR IMMEDIATE RELEASE   \n---------------------   \nTypeCon2002 Programming Information Now Available Online.   \n   \nBUFFALO, NY, JUNE 7, 2002 - The Society of Typographic Aficionados (SOTA) has published detailed information regarding its program for TypeCon2002. To be held in Toronto, Ontario, Canada, July 12-14, the fourth annual event is presented by SOTA and The Type Club of Toronto.   \n   \nThe conference website, located at [http://www.typecon2002.com](http://web.archive.org/web/20131020030246/http:/www.typecon2002.com/), now features a detailed timeline of programming and social activities. The timeline also lists topics and participants scheduled for each session. Additional speakers have also been added to the lineup. TypeCon2002 includes three full days of workshops, presentations, panel discussions and other activities designed for type and graphic design professionals, students and other aficionados of the communication arts.   \n   \nTypeCon2002 will take place at the Courtyard by Marriott in downtown Toronto. Discounted hotel room rates are available to conference attendees. Please visit the conference website for details.   \n   \nTypeCon2002 is the annual event of the not-for-profit Society of Typographic Aficionados, an international organization dedicated to the promotion, study, and support of typography and related arts. Secure conference registration and further information is available at [http://www.typecon2002.com](http://web.archive.org/web/20131020030246/http:/www.typecon2002.com/), or by email at mailto: [info@typecon2002.com](mailto:info@typecon2002.com). For more information about SOTA, please visit the website at [http://www.typesociety.org](http://web.archive.org/web/20131020030246/http:/www.typesociety.org/), or email mailto: [info@typesociety.org](mailto:info@typesociety.org).\n\n",
  "author": "tamye",
  "time": "7 Jun 2002 — 2:44am",
  "uid": "107",
  "comments": [

  ]
}
