{
  "id": "100930",
  "title": "Seeking Interesting Typography for Digital Clocks",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Greetings All,\n\nI'm a software developer that's created a clock app that lets users upload digital clock designs and share them with others. In the app, the designs are pulled from the web and the clock representation changes periodically to give you something interesting to look at. As typography professionals and enthusiasts, I thought some of you may appreciate seeing numerals rendered in different styles, and maybe even have an idea for a design of your own. Currently the app is available for iOS devices (iPhone/iPod/iPad), and I am giving it away free for a while.\n\nIf you are interested in checking it out, you can learn more here:  \n [https://www.clockton.com](http://web.archive.org/web/20131017052530/http:/typophile.com/wiki/https%3A/%252Fwww.clockton.com)\n\nIf anyone has any feedback on the overall look and feel of the app, I would be happy to hear your thoughts!\n\nSincerely,  \nEvan\n\np.s. I am also running a clock design competition on 99designs right now. If you think you have an award-winning design, you might want to consider submitting it.  \n [http://99designs.com/other-art-illustration/contests/create-digital-clock-clockton-199820](http://web.archive.org/web/20131017052530/http:/99designs.com/other-art-illustration/contests/create-digital-clock-clockton-199820)\n\n",
  "author": "k.evan.nowak",
  "time": "27 Feb 2013 — 5:16pm",
  "uid": "209358",
  "comments": [
    {
      "time": "27 Feb 2013 — 6:10pm",
      "content": "You don't explicitly state exactly _what_ the clock is to show, nor _how_ it is to show it.\n\nHere is something I made for my Windows computer desktop. It shows me the date and day of the week as well as the time, and it uses an \"odometer\" animation for the minutes.\n\nI do not intend this as an entry into your contest, of course, as it is not only too small (not nearly enough pixels), but also much too amateurish. I just want to show you what is possible. This is my solution to a problem of \"minutes are too coarse; seconds are too anal-retentive\".\n\n ![](http://web.archive.org/web/20131017052530im_/http:/typophile.com/files/clock-demo_3684.png)\n\n"
    }
  ]
}
