{
  "id": "10093",
  "title": "Hand-drawn in 2 .5 hours",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi guys,   \n   \nFirst post! As part of my ordinary secondary-level (high school) education, I do Art. One of our four exams is a design project. We get the brief a week before the exam but all the work must be done from scratch in two-and-a-half hours.   \n   \nI did this by way of practice for this exam. No computers allowed! It was all graph paper and steel rules, done finally in Indian Ink on an A3 sheet of cartridge paper. It was my first experience drawing lettering in any meaningful way.   \n   \nThe brief was to design a logo for a costume hire company.   \n  \nWhat do you think? I'm sure there's room for improvement!   \n   \n ![Costume hire company logo](http://web.archive.org/web/20131023033721im_/http:/www.typophile.com/forums/messages/29/68660.gif)\n\n",
  "author": "martin_mckenna",
  "time": "3 Apr 2005 — 10:22am",
  "uid": "6296",
  "comments": [
    {
      "time": "5 Apr 2005 — 1:01pm",
      "content": "First off, welcome to Typophile.   \n   \nSecondly, your logotype has a decent concept and layout in this drawing, so that's good, but the strokes are weak. It's a very tricky but extremely important part of drawing type, particularly script faces.   \n   \nWithout going into too much detail, what you want to do is draw the skeleton of the type, then apply the strokes to that, rather than drawing the outline. The strokes (in 'Queen') are meant to appear drawn with a brush or pen with which you can control the thicks and thins, right?. Right now, the strokes don't feel like fluid, organic, modulating line. I'd either get a Speedball pen or a brush and play around, or visit the site of Underware (a Dutch font house). They have some great curvy, full-bodied script fonts you could look at, such as [Bello](http://web.archive.org/web/20131023033721/http:/www.underware.nl/site2/index.php3?id1=bello&id2=overview). They also have a site where they archive their [student workshops](http://web.archive.org/web/20131023033721/http:/www.typeworkshop.com/index.php?id1=type-basics), that may help you understand how letters are constructed and designed (without buying a book on the subject).   \n   \nFocus on 'Queen' first. Fix the strokes, close the space between the 'Q' and the 'U', and let that 'n' have a slightly more dramatic finish.   \n   \nDo that, then go back and tweak 'DRAMA'.\n\n"
    },
    {
      "time": "6 Apr 2005 — 7:27am",
      "content": "To help with the drawing process you might want to buy/borrow a set of french curves and some elipse tempates. Two and a half hours is a tight deadline, so you need to make it as easy on yourself as possible. On a type front the letters with curves at the top and bottom aceos etc should have a slightly larger x-height than the others.   \nGood luck   \nTim\n\n"
    },
    {
      "time": "6 Apr 2005 — 9:33am",
      "content": "I misinterpreted your post. I thought you meant that this was the result of the exam and you wanted to tweak it. I agree with Tim on the french curves, if you aren't going to try a brush.   \n   \nA few more tweaks: Maybe this is just me, make your 'e's more e-like. They're a tad bit too vertical for my taste. Also, splay the legs of the 'A's a bit more to open up the counter (the space inside the 'A'). Make your 'D' less pointed and more bowled and curved. [Trade Gothic Bold No.2](http://web.archive.org/web/20131023033721/http:/www.myfonts.com/fonts/linotype/trade-gothic/bold-no-2/) is probably a good model for the 'DRAMA'.   \n   \nGood luck.\n\n"
    },
    {
      "time": "7 Apr 2005 — 10:50am",
      "content": "Thanks, Chris and Tim, for the helpful advice. I'm going to get the pens/brushes/set-of-curves you suggested and will give it another go taking your suggestions into consideration. I'll keep you posted with the results. ![:-)](http://web.archive.org/web/20131023033721im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nP.S. That Underware resource is fantastic! I've been on their mailing list for ages but never spotted those diagrams. Thanks!\n\n"
    },
    {
      "time": "7 Apr 2005 — 11:21am",
      "content": "Yes, a rapidograph pen and french curves are going to help. You can jack your curves up with some thin label stickers so the ink won't run underneath the curves. Apply the stickers to the side that sits against your coated illutration board so they lift the curve up from the surface.   \n   \nBest of luck.\n\n"
    }
  ]
}
