{
  "id": "10090",
  "title": "Historical accuracy: what is it?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am a doctoral candiate at Hong-Ik university, Korea. My interest is a certain typographic composition which, assumably, started in the early twenties(1920's). But it is not easy to find some available references and even know of the accurate term for it.   \n   \nBelows are typical samples, which show the certain structure that use the same alphabet among two or more words.   \n   \nIn fact I am in trouble because I am planning to set it as a thesis theme. My thesis is about some possibilty that this can be adapted to Korean Typography. It has not been considered because the Korean, Hangul structure is quie different from the English's.   \n   \nIn the early stage of my thesis, the terminoloy and references about it is absolutely in need. It will be thankful if you give me even a simple comment on it.   \n   \nBjornz Li   \n   \n ![sampes of the structure](http://web.archive.org/web/20081117201510im_/http:/www.typophile.com/forums/messages/30/68650.jpg)\n\n [‹ Visual communication](http://web.archive.org/web/20081117201510/http:/www.typophile.com/node/9982 \"Go to previous forum topic\") [Pixel fonts ›](http://web.archive.org/web/20081117201510/http:/www.typophile.com/node/10311 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081117201510/http://www.typophile.com/user/6294\" title=\"View user profile.\">bjornz</a>",
  "time": "<br>",
  "uid": "6294",
  "comments": [
    {
      "time": " 3.Apr.2005 5.55am",
      "content": "\\>assumably, started in the early twenties   \n   \nIn a way. Crossword puzzles were a huge fad at that time, which is probably related.   \n   \nBut actually, they go right back to ancient Rome:   \n   \nSATOR   \nAREPO   \nTENET   \nOPERA   \nROTAS   \n   \n...and have a long cult history.   \n   \nI've recently seen an astonishing Christian \"poster\" from 1500(?) years ago which was composed of a massive grid-field of normal-reading text from which various significant diagonal and vertical phrases are highlighted in different colours. Unfortunately, I am not the world's best note-taker, so I can't give you any further information, other than it was in an exhibition at the Fitzwilliam Museum in Cambridge about 4 months ago.   \n   \nThere is also the traditional genre of \"acrostic\" verse, where the Initial character of each line, read vertically, spells out a message.   \n   \nCheck out \"The Oxford Book of Word Games\" and Willard R. Espy, \"An Almanac of Words at Play\", to approach this phenomenon from the literary angle, which is, I believe, equally, if not more relevant than that of design.\n\n"
    },
    {
      "time": " 3.Apr.2005 6.32am",
      "content": "Thank you for your help.   \n   \nI guessed it can be considered as \"crossword puzzle, word game, and word play\". But I meant it was revealed in the 1920's in terms of typography(printed type).   \n   \nNow I am checking out more about your mentioned references. And I'd like you to suggest more relvant information in a typograhic way.\n\n"
    },
    {
      "time": " 4.Apr.2005 10.15am",
      "content": "If you fail to find a decent term for it, make one up. If it were me, I might call it \"Scrabble setting\". :-)   \n   \nBTW, it seems to me that Korean would be much better suited to this sort of thing than Latin.   \n   \nhhp\n\n"
    },
    {
      "time": " 4.Apr.2005 11.05am",
      "content": "\\> \"Scrabble setting\". :-)   \n   \nApart from the obvious trademark issue, you could also use the Scrabble scoring system to give each example a rating.\n\n"
    },
    {
      "time": " 4.Apr.2005 7.13pm",
      "content": "Thinking about it purely from a functional standpoint (rather than its uses in games), you might call it \"intersecting typography.\" Though in the Cinzano ad you showed, there's an extra element: the fact that (in that typeface) what's an N on one axis is a Z on another.   \n   \nJohn Berry\n\n"
    },
    {
      "time": " 4.Apr.2005 7.37pm",
      "content": "I was so sure that there must be a specific term for it in the western typography. Is there any relevant theoretic research about this?   \n   \nBjornz Li\n\n"
    },
    {
      "time": " 4.Apr.2005 9.08pm",
      "content": "Hi John, welcome to Typophile.   \n   \nBjorn, you might want to do a spot of research on Prof. Michael Twyman's 'Schema for graphic language', as I recall it covers every conceivable form of text layout. He did talk about it (most recently perhaps) at the 2002 Thessaloniki conference.   \n   \nCheers, Si\n\n"
    },
    {
      "time": " 4.Apr.2005 10.16pm",
      "content": "Mistress of patterns and mean Scrabble player Marian Bantjes prepared this test setting of Restraint, a sort of nouveau Victorian display face that she designed in collaboration with Tiro partner Ross Mills. [I believe the plan is to market the font later this year, but I have not kept up on its development. Yes, all the squiggles are part of the font.]   \n   \n ![Restraint specimen](http://web.archive.org/web/20081117201510im_/http:/www.typophile.com/forums/messages/30/68813.gif)\n\n"
    },
    {
      "time": " 5.Apr.2005 12.08am",
      "content": "Hey, that's pretty nice.   \n   \n(And welcome, John B!)   \n   \nhhp\n\n"
    },
    {
      "time": " 5.Apr.2005 1.57am",
      "content": "\\>\\>you might call it \"intersecting typography.\" Though in the Cinzano ad you showed, there's an extra element: the fact that (in that typeface) what's an N on one axis is a Z on another.   \n   \nMaybe the Cinzano ad should be 'eschersecting typography'?\n\n"
    },
    {
      "time": " 5.Apr.2005 7.16am",
      "content": "For those of you who missed my earlier post:   \n   \nTraditionally, going back centuries, the genre of characters doing double duty in horizontal and vertical words is known as \"Acrostic\", in poetry.   \n   \nSince the 1920s US puzzle craze, (still well established in one's daily paper), the common usage is \"Crossword\".   \n   \nNo need to reinvent the wheel merely because some graphic designers \"revealed\" a \"new\" kind of layout; of the two \"Crossword\" seems to be the no-brainer.\n\n"
    },
    {
      "time": " 5.Apr.2005 8.19am",
      "content": "Hi NIck, thank you again.   \n   \nI know that typography is closely linked with poetry, as Lissitzky's \"About Two Square\" was kind of a typographic interpretation of Russian Futurist poetry.   \n   \nIn 1920's the notion of orthogonality was influential. So we can see it at the every(not some) other famous graphic work. Muller Brockman's work is typical case which spreaded Swiss international typographic style.   \n   \nI think that your \"Acrostic \" style has played a major role to maximize typographic vision without help of image. So it is ubiquitious. I am focusing that it is a typographic view/phenomenon/principle, not merely a word game for no brainer.\n\n"
    },
    {
      "time": " 5.Apr.2005 8.33am",
      "content": "![sampes of the composition](http://web.archive.org/web/20081117201510im_/http:/www.typophile.com/forums/messages/30/68843.jpg)   \nDid Lissitzky want to get the most out of \"Acrostics\" to make his monumental work?\n\n"
    },
    {
      "time": " 5.Apr.2005 9.38am",
      "content": "Bjornz, I don't know if there is an existing term for the sorts of thing you show in your posted images. You might try the term typogramme, which has links to the para-typographical experiments described in Herbert Spencer's \\_The Liberated Page\\_ under the term 'calligramme' (Guillaume Apolinnaire) and 'id\n\n"
    },
    {
      "time": " 5.Apr.2005 9.55am",
      "content": "The ones you seem particularly interested in could be called 'acrostic typogrammes'.\n\n"
    },
    {
      "time": " 5.Apr.2005 10.17am",
      "content": "\\>I am focusing that it is a typographic view/phenomenon/principle   \n   \nYes, this is more apparent with your second set of illustrations, where the layouts are driven by Constructivism.   \n   \n\\>Did Lissitzky want to get the most out of \"Acrostics\" to make his monumental work?   \n   \nI suspect that the acrostic element was serendipitous, and followed from Lissiztky's adherence to his constructivist/suprematist principles.   \n   \nIf he had set out to produce a constuctivist work with plastic elements composed purely of meaningful words running up, down, and diagonally, he must have been confronted with the problem of what to do at the intersection of perpendiculars: the acrostic would have strongly suggested itself to his receptive mind.   \n   \nBTW, I'm now liking \"acrostic\" more than \"crossword\": -- it sounds more intellectually impressive, ennit?\n\n"
    },
    {
      "time": " 5.Apr.2005 1.43pm",
      "content": "\\>The ones you seem particularly interested in could be called 'acrostic typogrammes'.   \n   \nIt sounds more reasonable.^^   \n   \n\\>the acrostic element was serendipitous.   \n   \nYes, I agree. It should be also manipulative, serendipitous in making it's samples with Korean.   \nRecently my friend showed me various sampes which ancient chinese poets did in the similar ways. It was gorgeous! As you might know, Chinese itself is very expressive and meaningful.   \n   \nAnyhow I'd like you to show some Korean samples someday.\n\n"
    },
    {
      "time": " 15.Apr.2005 9.29am",
      "content": "Anyone who knows and recommends the adequate theoretician about this? Actually I sent a couple of mails to Ellen Lupton,etc. But no answers. I might have the wrong email addresses. Hope you to give me some info.\n\n"
    }
  ]
}
