{
  "id": "10098",
  "title": "Resonance Display Typeface In Progress",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Still have a few numbers and punctuation to do but any crits would be appreciated.   \n ![resonance](http://web.archive.org/web/20130819205542im_/http:/www.typophile.com/forums/messages/29/68695.jpg)\n\n<!--attachment: RESONANCE-68696.pdf*mime_pdf.gif*application/pdf*508.3*resonancepdf*RESONANCE%2epdf --><!--attachment: RESONANCE-68696.pdf*mime_pdf.gif*application/pdf*508.3*resonancepdf*RESONANCE%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20130819205542im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">resonancepdf<br><a href=\"http://web.archive.org/web/20130819205542/http:/www.typophile.com/forums/messages/29/RESONANCE-68696.pdf\" target=\"_blank\"><b>RESONANCE.pdf</b></a> (508.3 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "kreative",
  "time": "3 Apr 2005 — 4:20pm",
  "uid": "6287",
  "comments": [
    {
      "time": "10 Apr 2005 — 2:42am",
      "content": "Hi there. I guess my last post didn't make it. My laptop ran out of juice during my upload. Well moving along. I think this is a very innovative design, I have seen this direction in type design before and I have been racking by brain trying to figure out where I saw similar type of work. Regardless this type of work is very interesting as an artistic expression. I am wondering if there is any (for lack of a better term) sacred geometry applied. I see repetition of circles and angular strokes. Kris could you please elaborate on your general concept. Was a few of the forms from a logo you created and then decided to expand on the design and build a full face?\n\n"
    },
    {
      "time": "10 Apr 2005 — 2:56am",
      "content": "I think perhaps the late 1980's/Early 1990's work of Berlin based Ott+ Stein used a character or two similar to your work in their designs.\n\n"
    },
    {
      "time": "10 Apr 2005 — 3:41am",
      "content": "_\\> [www.typophile.com/forums/messages/29/69107.html](http://web.archive.org/web/20130819205542/http:/www.typophile.com/forums/messages/29/69107.html)_\n\n"
    },
    {
      "time": "10 Apr 2005 — 8:10pm",
      "content": "Thank you for the comments and critiques. This display typeface was actually conceived for a graduate class in Typography. The general idea came out of looking at Wolfgang Weingart's My Way to Typography, a book on Frank Lloyd Wright, and various other sources like Metropolis magazine. In addition I was looking at research by Nikola Tesla and his theories on acoustic resonance--hence the name.   \n   \nAll of these sources seem to \"resonate\" something to me and came together through my sketches. I wanted to create an original typeface that reflected my interests in several areas of contemporary design. And even though my background is not in architecture, I often draw from other media and disciplines for inspiration.   \n   \nAlso, I can perhaps see the resemblance to Ott & Stein's work, but this was not a source I looked at when researching.   \n   \nKeeping a consistent look and feel for each letter and number is difficult and I will continue to develop my designs. Again, I appreciate any and all comments/crits.\n\n"
    },
    {
      "time": "9 Apr 2005 — 12:24am",
      "content": "I have seen similar type design before, although this one is certainly unique. I wonder why you created it. Was it project specific, a partial alphabet design from a branding/identity job,   \na consumer face or just experimental. As you may have anticipated the critique would be with regards to consistancy.   \nSome character need a bit more work. The numerals are great, why not add old style numerals. I will try to think of where I have seen this type of design before.\n\n"
    },
    {
      "time": "8 Apr 2005 — 11:39am",
      "content": "I'm sorry to see no one has commented yet. I think this is remarkable.   \nI love the drafting/architectural feel. It's like techno-deco.   \nThere is room to create useful alternates like an A that leans the   \nother direction (a la Avant Garde Alts) for fitting with upright   \nletters to its right.\n\n"
    }
  ]
}
