{
  "id": "101091",
  "title": "A Serif Pairng for Frutiger?",
  "forum": "General Discussions",
  "tags": [
    "Frutiger pairing serif",
    "General Discussions"
  ],
  "content": "Hi, I'm working on website that helps users find and understand treatments for their medical and psychological conditions. For example, if you have an aneurysm, the website will recommend you either surgery or statins, and explain to you which is the best treatment for you, based on your history and preferences.\n\nI chose Frutiger as the base typeface for this site because I feel it no-nonsense but without being stiff and unfeeling. People coming to the site are trying to find their way, and need vital information at a personal level. Also, I like the look of Frutiger.\n\nMy question is - is there is suitable serif pairing for Frutiger in this context? It will be used for titles, but also some body copy, like captions and blockquotes and like.\n\nI was leaning towards Apollo or maybe Minion, because they look great with Frutiger, but I'm not sure if either of those two serve as a good fit for the subject matter of the site.\n\nThanks!\n\n",
  "author": "herereadthis",
  "time": "4 Mar 2013 — 12:00pm",
  "uid": "207490",
  "comments": [
    {
      "time": "4 Mar 2013 — 12:17pm",
      "content": "If you want high readability on a website, your choices narrow down a bit, with many normally go-to print faces (like Minion) not cutting it. In contrast, check out something that renders very well onscreen:  \n [http://ernestinefont.com/](http://web.archive.org/web/20150305002612/http:/ernestinefont.com/ \"http://ernestinefont.com/\")  \n(Disclaimer: I had a hand in it.)\n\nhhp\n\n"
    },
    {
      "time": "4 Mar 2013 — 12:30pm",
      "content": "When I was a student, Meridien (1957) was considered a standard partner. Now we have Frutiger Serif (2008). They are quite similar, with Frutiger Serif being a slightly “toned down” Meridien. A make-work project in my opinion. I’d kick it old-school and go with Meridien. Better for your street cred.\n\n"
    },
    {
      "time": "4 Mar 2013 — 12:31pm",
      "content": "Yes I just realized I mispelled \"Pairing\"\n\n"
    },
    {
      "time": "4 Mar 2013 — 12:37pm",
      "content": "It’s nothing to be ashamed of. It will happen more and more as you get older ;)\n\n"
    },
    {
      "time": "4 Mar 2013 — 1:59pm",
      "content": "Clearly a typo and not a misspelling.\n\n"
    },
    {
      "time": "4 Mar 2013 — 2:00pm",
      "content": "It's kinda hard to earn typography street cred when the people paying you can only claim Arial and Times New Roman as their Typography knowledge.\n\n"
    },
    {
      "time": "4 Mar 2013 — 3:19pm",
      "content": "Is your client religious?\n\n ![](http://web.archive.org/web/20150305002612im_/http:/typophile.com/files/ghtnr_4261.jpg)\n\n"
    }
  ]
}
