{
  "id": "101046",
  "title": "Typing in Yiddish",
  "forum": "General Discussions",
  "tags": [
    "Font Creator",
    "General Discussions",
    "glyphs",
    "Right to left",
    "Yiddish"
  ],
  "content": "Dear Forum\n\nI am very brand new to this.\n\nI really wish to create a PROPER Yiddish font, since I  \n type a whole lot in that language.\n\nI won't go into details now.\n\nI am trying to use Font Creator to make the font.\n\nBut I have a whole lot of problems.\n\nI want to use the font with Microsoft Word\n\nI need a lot of help, especially with the left to right - right to left problem.\n\nI have no trouble creating the glyphs I need. They are based on a simple  \nHebrew font with about 10-15 additional glyphs, which are used only  \nin Yiddish.\n\nI do not need any Latin characters, but I want to be able to use both  \nupper case and lower case to create the needed new glyphs\n\nIf you think you can help me,  \nI would VERY MUCH  \nlike to have somebody as a kind of mentor to get me through this.\n\nI am willing to spend a lot of time with this, but I need some direction,  \nespecially at first.\n\nContact me at\n\n[caspari@tx.technion.ac.il](mailto:caspari@tx.technion.ac.il)\n\nI will surely reply to any responses,\n\nThanks a lot\n\nDavid Tal\n\nHaifa, Israel.\n\n",
  "author": "David Tal",
  "time": "3 Mar 2013 — 4:05am",
  "uid": "209489",
  "comments": [
    {
      "time": "3 Mar 2013 — 9:42am",
      "content": "You should not have any problem if you just follow the pattern of any standard Hebrew font and put your glyphs in the Unicode range 0590-05FF.\n\nI can't understand what you are referring to by upper/lower case.\n\nSome info on how Unicode does special Yiddish things is at\n\n[http://world.std.com/~yv/uyip/combinations.html](http://web.archive.org/web/20150415061603/http:/world.std.com/~yv/uyip/combinations.html \"http://world.std.com/~yv/uyip/combinations.html\")\n\n"
    },
    {
      "time": "3 Mar 2013 — 9:45am",
      "content": "> I do not need any Latin characters\n\nYou don't _have_ to make a Latin (for one thing it's certainly a ton more work) but since many people will need a Latin font to use alongside, you should choose an existing one to be compatible with in certain ways, such as color (darkness), apparent size (how big each script looks), etc. And if you've already settled on all those things, it's worth the effort finding a Latin font that harmonizes with your design, to recommend to people.\n\nhhp\n\n"
    }
  ]
}
