{
  "id": "101059",
  "title": "Retail Tea boutique branding",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "brand logotype",
    "branding",
    "logo",
    "Logos / Corporate ID Design"
  ],
  "content": "Hey guys,  \nthis is my very first attempt at a fully custom logotype. any feedback on the typeface would be awesome.\n\nthe client is looking for something \"fresh, adaptable, and clean\" ; I feel a wide-set humanist sans-serif balances well with the classical themes evoked by the graphics floral theme and circular shape (based on a Kamon), but with no formal training in type design, only a ferocious interest, I want to to my best to ensure that it can stand up to the critical eyes of the most well trained type-designers, and so I arrive here.\n\nMy major concerns lie with the 'm' 'o' and 'r': specifically, the join at the center of the 'm', the \"angle\" of the 'o' and the terminal angle of the 'r'\n\n| Attachment | Size |\n| --- | --- |\n| [TeaAmoreLogo.png](http://web.archive.org/web/20150418211259/http:/typophile.com/files/TeaAmoreLogo.png) | 139.57 KB |\n\n",
  "author": "treezrppl2",
  "time": "3 Mar 2013 — 2:24pm",
  "uid": "28850",
  "comments": [
    {
      "time": "3 Mar 2013 — 2:52pm",
      "content": "The font seems to fight with the artwork. The uniform stroke weight and sharp edges are at odds with the graceful lines of the drawing, and the elliptical shapes of the **a** and **e** are jarring below the round shape. I would use something softer, with a bit of variation in the stroke weight and flared or rounded stroke ends. Maybe something with a little of the Art Nouveau/Art Deco feel of the artwork.\n\nPersonally, I am a Goudy disciple when it comes to letterspacing lowercase, but _chacun à son goût_.\n\n"
    },
    {
      "time": "3 Mar 2013 — 3:40pm",
      "content": "Thanks for the rapid reply Mojo,  \nWhile the input on stroke weight and collision of shapes are appreciated for their pinpoint accuracy (I'll try to soften it up a bit and get back to you all), I personally don't know of any Goudy fonts that fall into the \"contemporary, fresh and modern\" category.  \nIt's important to me to contrast the softness and grace of the logo with a bit of modernist or contemporary freshness so that the branding from then forward can aspire toward something fresh (apologies for the lack of a less buzzy). My hope was to use an updated version of early 20th century wide-set gothics (i was thinking a thin-weight extended-width Gotham, or [Sweet Sans Pro](http://web.archive.org/web/20150418211259/http:/www.myfonts.com/fonts/sweet/sans-pro/)), and the packaging will eventually lean towards a Japanese aesthetic.\n\nthat said, if you've got a font recommendation to save me from myself, I'd be quite thankful.\n\nsincerely,  \nNathan\n\n"
    },
    {
      "time": "5 Mar 2013 — 11:10am",
      "content": "It's a lovely illustrated mark. I think the issues I see first have to do with the composition and balance more than typeface, although I agree with the above comment. The text is too small and flat for the mark, and being below it is not helping the balance because it makes the mark seem heavy and overpowering. I would try to set the text to the right and make it a lot larger. Maybe explore some small decorative terminals like [http://www.myfonts.com/fonts/hvdfonts/pluto/](http://web.archive.org/web/20150418211259/http:/www.myfonts.com/fonts/hvdfonts/pluto/ \"http://www.myfonts.com/fonts/hvdfonts/pluto/\") or [http://www.myfonts.com/fonts/laura-worthington/mandevilla/](http://web.archive.org/web/20150418211259/http:/www.myfonts.com/fonts/laura-worthington/mandevilla/ \"http://www.myfonts.com/fonts/laura-worthington/mandevilla/\")\n\nLovely start with that great mark!\n\n"
    },
    {
      "time": "5 Mar 2013 — 12:36pm",
      "content": "I pretty much agree with the comments above. I might try reversing the image so the flower is facing right (since we read left to right, images that face left like the flower does can subtly seem to be pointing backwards).\n\n"
    }
  ]
}
