{
  "id": "101083",
  "title": "Thesis Fonts Basics",
  "forum": "Design",
  "tags": [
    "Dissertation",
    "thesis",
    "Design"
  ],
  "content": "We see a number of thesis/dissertation fonts discussions. I have never done one, and am curious about the underlying assumptions, which never seem to be discussed.\n\nWho is the target audience? Is it a small group of professors who evaluate the thesis? Or every one in the design, chemistry, whatever program at the school? Or everyone in the world interested in that subject? Or the kind people who paid for the schooling? Or other? Is there a primary and secondary audience?\n\nAre we talking about a printed document, or a pdf document viewed on a screen, or both? If both, does it get re-typeset for a different medium? Are these professionally typeset or mostly done by the student?\n\nIs it offset printed, or professionally digital printed, or printed on a friend's nice printer. Is it a book, and if so how is it bound? Is it just a bunch of loose papers clipped together. Or in a bigger document of collected theses?\n\nWhy is this stuff never mentioned in the discussion? Just curious. Thanks.\n\n",
  "author": "J. Tillman",
  "time": "4 Mar 2013 — 9:13am",
  "uid": "48632",
  "comments": [
    {
      "time": "4 Mar 2013 — 9:15am",
      "content": "Good thinking.\n\nhhp\n\n"
    },
    {
      "time": "4 Mar 2013 — 5:33pm",
      "content": "Generally, the only person you should be concerned about pleasing is the person who will be assigning your grade. And, quite frankly, unless your thesis is about typography, your professor is likely to give a rat’s ass about what font it’s in, as long as it’s readable…IMHO. BTW, ditto for résumés…\n\n"
    },
    {
      "time": "5 Mar 2013 — 1:16pm",
      "content": "Unless it is in Baskerville, in which case it will be slightly more believable. :-)\n\nBTW, there is a large cottage industry in thesis and dissertation publishing - with some high prices (since most will have only a few copies made). The days of submitting double spaced typed 8.5x11 inch copies are over.\n\n"
    }
  ]
}
