{
  "id": "101013",
  "title": "Space between words and between after a dot in abbreviations",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Are there any regulations which recommend what kind of space (Unicode symbol) is used for space between words and what kind of space should be used after the dot in abbreviations such as Ph. D.\n\nI have only recently found out that French typographic rules demand a four-per-em space, and not your usual one, after « and before ».\n\nSo I was wondering whether any such advice exists for interword space.\n\n",
  "author": "Sylph",
  "time": "2 Mar 2013 — 3:07am",
  "uid": "29977",
  "comments": [
    {
      "time": "2 Mar 2013 — 3:16am",
      "content": "Oops, that title turned into a mess, but hopefully someone will correct it.\n\nI forgot to ask whether there are any considerations for spaces before and after the en dash.\n\n"
    },
    {
      "time": "2 Mar 2013 — 3:51am",
      "content": "There are \\*conventions\\* -- not regulations. They also change over time, and with general style.\n\nFor example, the four-to-em space you mention with guillemots in French wouldn't be right if someone were setting ragged right and was using a font where four-to-em was a normal word space. Remember, you get a 4-to-em space with a spaceband value of 250 units (with a 1000 unit em).\n\nMost newer fonts use a smaller nominal value than 250 units for the spaceband -- I've seen 190 units a fair bit, and that's smaller than a 5-to-em. If you use a hard 4-to-em between the guillemots and a word, the resulting space would be larger than the nominal word space when set with many fonts.\n\nAs to periods after initials -- it is a matter of style. Chicago style is to us a word space with initials, as in\n\nG. E. M. Anscombe\n\nAssociated Press style is to not use any extra space\n\nG.E.M. Anscombe\n\nEtc. in other constructions.\n\nSo -- you get a lot of theories from typographers, but rarely the assumptions they are based on -- e.g., how big is a wordspace. Moreover, in the largest portion of the world of words, editorial style is the determining factor. Typographer's opinions are often marked \"P.E.\"\n\n"
    },
    {
      "time": "2 Mar 2013 — 9:52am",
      "content": "In the case of an abbreviation such as Ph.D., the answer to the question of what kind of space to put after the period inside the abbreviation is usually \"none\", at least in the United States. In most editorial styles, for such abbreviations the periods are closed up or else omitted: \"Ph.D.\" or \"PhD\", with the latter being the more common nowadays.\n\n"
    }
  ]
}
