{
  "id": "101087",
  "title": "Please help! problem when generating font in FontLab Studio 5.04",
  "forum": "General Discussions",
  "tags": [
    "fontlab studio kerning generating font",
    "General Discussions"
  ],
  "content": "Hi! I'm very very new to building fonts and kerning fonts, was asked to do this project of kerning font files with out any knowledge on the software (FontLab Studio version 5.0.4 and have been learning/teaching myself as I go along for the past couple of months...\n\nI'm wondering if anyone could help me with the problem I am experiencing... which is basically when I generate the font I've created/kerned the kerning does not appear in all softwares or when I double click on the .ttf file and it shows the open type file it does not show the kerning I've done to the font. (I hope I'm explaining this correctly, like I said this is all very new to me!)  \n(the open type file)\n\n ![](http://web.archive.org/web/20131022113406im_/http:/typophile.com/files/fontFile_4115.jpg)\n  \n(the font being used in Illustrator)  \n\n ![](http://web.archive.org/web/20131022113406im_/http:/typophile.com/files/illustrator_5829.jpg)\n\nI've done kerning to 7 font files, 2 of which I'm experiencing this issue... these 2 font files that I'm experiencing issues with I have applied an .afm kerning file to so I could just use kerning I've already done with one font to these fonts. That is the only different thing I know of for sure that I have done when compared to the 5 font files I haven't had issues with when generating. I started off with .ttf files that were given to me, so something could have been already done to these files to create this issue to start with. However, I tried rebuilding the font by starting with a new font file and copying and pasting the glyphs then reapplying the .afm kerning file, only to receive the same problematic result. (The .afm file that I'm using is from one of the fonts that I didn't have any issues with when generating.)\n\nI've been trying selecting/un-selecting items in the options menu when going to generate the font such as the \"generate \"kern\" feature if it is not defined\" as I saw in another post on here that that seemed to resolve the problem for someone else. but it did not work for me. I'll continue to try and track down some other forums where people have stated they've been having issues similar to this and try different things. But I thought maybe someone might read this and instantly know what I'm doing wrong or have a suggestion of what I should be doing, or could direct me to a post where this happened to someone else.\n\nany help is very much appreciated and I apologize in advance for my lack of knowledge of the software and terminology and procedures when building a font.\n\nthanks!!\n\n",
  "author": "ninga",
  "time": "4 Mar 2013 — 10:53am",
  "uid": "209526",
  "comments": [

  ]
}
