{
  "id": "10112",
  "title": "Gill Sans and Joanna",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I read somewhere recently that if Eric Gill had called Joanna \"Gill Serif\" instead he would have been the first to make a serif/sans family. I can't find it in Elements of Typographic Style, Anatomy of a Typeface, Letters of Credit, Counterpunch, or Paul Renner: The Art of Typography. I don't think I've read any other type related books I've read recently, (other than R.R. Kelly's American Wood Type, but it's not in there. Is it?) so where is it? I know this is a stretch, thinking that someone would kow the source right off the bat, but I also know that typophiles are a strange and mysterious bunch.   \n   \n   \nSo, anyone... ?\n\n",
  "author": "Isaac",
  "time": "4 Apr 2005 — 3:18pm",
  "uid": "540",
  "comments": [
    {
      "time": "4 Apr 2005 — 3:23pm",
      "content": "I don't remember ever reading that anywhere.   \n   \nAnd really, it's not the name that makes a family; Joanna   \nand Gill Sans are largely unrelated designs, to me at least.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Apr 2005 — 3:23pm",
      "content": "\\>the first to make a serif/sans family   \n   \nMorris Benton, Clearface, when the sans version was released in 1910.\n\n"
    },
    {
      "time": "4 Apr 2005 — 5:10pm",
      "content": "Who's going around spreading rumors about Eric Gill? This is killing me. If I read it in a book (which I'm pretty sure I did), who would have written it and not known about Clearface? Anyway, it's not all that important, I just couldn't remember. Thanks guys.\n\n"
    },
    {
      "time": "4 Apr 2005 — 8:27pm",
      "content": "My guess is you're thinking of \"My Type Design Philosophy,\" by Martin Majoor, in which he discusses the relationship of Scala and Scala Sans.   \n   \nHere is a partial quote from his article: \"Had Eric Gill planned Joanna and Gill Sans as one family he would have been the first in history to design a family of serif and sans, but he made them as separate designs with separate names.\"   \n   \n [http://www.typotheque.com/articles/my\\_type\\_design\\_philosophy.html](http://web.archive.org/web/20131014160225/http:/www.typotheque.com/articles/my_type_design_philosophy.html)\n\n"
    },
    {
      "time": "5 Apr 2005 — 7:42am",
      "content": "Bringhurst suggests Gill and Joanna together in Elements. You have to adjust the sizes to get the weights to match, and kern well.\n\n"
    },
    {
      "time": "5 Apr 2005 — 10:45am",
      "content": "Gill Sans works well with Perpetua -- I used them for many years in a marketing newsletter. The range of the Gill Sans was very useful, especially the bold condensed, and even Ultra. Perpetua Titling was good for initials and, er, titles. I had to make a beefed-up \"small\" version of Perpetua for footnotes, though.\n\n"
    },
    {
      "time": "5 Apr 2005 — 8:43pm",
      "content": "YES! Mark Foster RULES!   \n   \nI guess what this means is that I don't read enough actual books and read too much from the web.\n\n"
    },
    {
      "time": "5 Apr 2005 — 11:50am",
      "content": "I've used them together as well. I always like to use the Ultra a a sort of small cap. I would extend it by 2%-3% and letterspace them.\n\n"
    }
  ]
}
