{
  "id": "101147",
  "title": "logo mock ups for investment company, I d be grateful for feedbacks, thx!",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "elegant",
    "finance",
    "logo feedback",
    "Logos / Corporate ID Design",
    "serious"
  ],
  "content": "Hi everyone,\n\nI am making a logo for a friend who is starting a business in investment consultancy. They are two partners. Young people, smart and openmined.\n\nThey wanted to get dynamic, modern but serious looking at the same time. Also trustworthy with elegant or luxurious touch. They don t want any tag line explaining the business which I think is a shame.\n\nDef. not an easy task. I ve been busy with it for 3 weeks. All should be ready in a week and I am just stuck with too many ideas! All is explained in the entouchments. Thank you for feedback! A d really appretiate it.\n\nKristin\n\n| Attachment | Size |\n| --- | --- |\n| [inviz\\_selection.png](http://web.archive.org/web/20150419164441/http:/typophile.com/files/inviz_selection.png) | 175.1 KB |\n| [inviz\\_01.png](http://web.archive.org/web/20150419164441/http:/typophile.com/files/inviz_01.png) | 2.49 KB |\n\n",
  "author": "kristin006",
  "time": "6 Mar 2013 — 2:22am",
  "uid": "209566",
  "comments": [
    {
      "time": "6 Mar 2013 — 4:32am",
      "content": "My opinions for what they’re worth.\n\nThe graphical elements in **03.1** , **03.2** and **03.1a** do nothing for me. I can’t figure what they’re supposed to represent — stylised |W|? in which case what's with **03.1a**? — and I don’t think any of them hang together particularly well.\n\nQuestion: any specific reasoning behind not making the graphic a more direct representation of that graph? Straight-line elements only for some reason?\n\nAs far as the type goes, I much prefer that in **02** over that in **01**. I think it just looks more dynamic here however I’m not sure if that’s due to an innate preference for points on the |W|, but the wider spacing is definitely part of it; I do prefer the type in **03** over **01** for this reason.\n\nJust to mention, the graphic in **01** (and **01.1** , which I prefer) may have unintended nautical associations for some viewers.\n\n"
    },
    {
      "time": "6 Mar 2013 — 5:07am",
      "content": "To: Gräfenberg\n\nThank you very much for comments. I have to admit I see some points you mentioned. Some letter spacing is wrong (I will take care of all details once I am close to final version). I know it s not an excuse.\n\n03.1, 03.2 and cosists of elements representing rise as well as letters I and W. But it s prob too many combinations. 03.1a should stand for some sort of securement. So that s to explain.\n\nQuestion: any specific reasoning behind not making the graphic a more direct representation of that graph? Straight-line elements only for some reason?\n\nI did try to make it more like the graph but at the end it looked like 2 bumerangs not forming nice shapes, but I suppose I dropped the idea too soon heading for more simplified elements. I didn t want to go too much into detail but maybe its too simple to make any impression at all. Good for pointing the nautical direction. And with all this blue. I will try to avoid the feeling.\n\nSo, now I have my enthusiamsm back thx to your useful comments.  \nLet s see what I manage to do from the graph.\n\nThank you again.\n\n"
    },
    {
      "time": "6 Mar 2013 — 9:42am",
      "content": "Are you open to changing the font? Because the opposing values you mention in your first post nicely reminded me of this:  \n [http://ernestinefont.com/](http://web.archive.org/web/20150419164441/http:/ernestinefont.com/ \"http://ernestinefont.com/\")  \n(Disclaimer: I had a hand in it.)\n\nhhp\n\n"
    },
    {
      "time": "6 Mar 2013 — 11:26am",
      "content": "I'm having a hard time understanding what sine waves have to do with investment consultancy. That said, I wouldn't have ever thought of anything like that graph from your icons. If that means that you took it that much farther beyond your inspiration then good. But don't forget to get back to your brief and ensure you are communicating the core message of the brand. What I am seeing in 01 is arrows pointing back and forth, a kite, skewed bowtie, triangles intersecting, and a graph depicting a slow rise followed by a sharp drop and another slow rise.\n\nHave you tried to make a W from the letters IN. Seems like a simple type solution and possibility a allusion to WIN. It could easily take a form much like your graph ideas.\n\n"
    },
    {
      "time": "8 Mar 2013 — 2:03pm",
      "content": "Hi,  \nthanks all for their feedback! Much appreatiated.  \nI tried to think about what you wrote. Some of the suggestions I could not quite get, but it developed into some different forms. So, pls. take a look and let me know what you think!\n\nThanks a lot.  \nK.\n\n ![](http://web.archive.org/web/20150419164441im_/http:/typophile.com/files/inw_8_3_update_6107.png)\n\n"
    },
    {
      "time": "8 Mar 2013 — 9:19am",
      "content": "So no comments?\n\n"
    },
    {
      "time": "10 Mar 2013 — 11:58am",
      "content": "The second image appears to have a graph with a downward trend. Certainly NOT the image you want to present to potential investment customers. The logo graphic in the first one has no connotations at all - it's just a pretty picture, which shouldn't be where it is. Instead, it should be vertically centered with the text, or else (with some resizing, possibly) be over the text, left aligned, or below the text, right-aligned.  \n- Herb\n\n"
    },
    {
      "time": "10 Mar 2013 — 2:19pm",
      "content": "Thank you for your feedback Herb.  \nThe triangls in the first one should express movement. The idea was just to make it dynamic.\n\nIn enclosed attachement I made the triangls appear more like a graph, by one I was inspired earlier. But it seemed a bit empty (1 to 4), that s why I picked the full form triangls (catch attention also).\n\nThank you also for the layout suggestions. It has to be horizontal. So, I changed the layouts by your suggestions. Hope I got it right this time...\n\nK.\n\n ![](http://web.archive.org/web/20150419164441im_/http:/typophile.com/files/inwiz_layout_6630.png)\n\n"
    },
    {
      "time": "10 Mar 2013 — 3:29pm",
      "content": "I prefer the solid version of the 'two triangles', and I don't think that the graphic should go beyond the top or bottom of the text. It should be a bit smaller and closer, it now looks very disconnected. In the outline version, the weight doesn't balance well with the weight of the text. It might imply motion a bit better if the central line were very slightly sloped. I don't like the one that looks like a lambda at all!  \n - Herb\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:22am",
      "content": "Thank you Herb\n\n"
    },
    {
      "time": "14 Mar 2013 — 3:08pm",
      "content": "The solid versions certainly seems more dependable. I wonder why you began exploring the triangles as movement. It also paints a nice story of zig and zag ... zig when then market zags etc ... though I don't know if that's wise investment advice, it seems like a nice story.  \nI also wonder why you decided to switch to outlined versions? They seem to begin suggesting a loop. I understand the infinity symbol is a strong icon, but it is lost in this approach.\n\nPretty much getting:  \nsmart, modern, serious\n\nA little bit of:  \ntrustworthy, luxurious\n\nNot really getting:  \nyoung, openmined, dynamic\n\n"
    },
    {
      "time": "17 Mar 2013 — 12:36pm",
      "content": "Thank you for such descriptive answer :)  \nI switched to outline version, to show where the idea was heading, but it was a bit weak.\n\nI made some changes. The guy chose the in in negative at the end.\n\n"
    },
    {
      "time": "17 Mar 2013 — 12:59pm",
      "content": "Hi there,\n\nthe logo is chosen, but the guys came up with aditional word (trading) at the last moment...:(\n\nCan someone try to choose which font fits the best? And also position? They wanted to have the word trading aligned with inwiz above. But in my view it feels a bit squeezed.\n\nI wanted to make helvetica (I know but it s the only font that really fullfils my needs) more interesting. But the guys are quite conservative, so I included a version Helvetica/Helvetica as well.\n\nI tried Garamond but they said it seems too romantic :(. I dont think so, but ...  \nAnyway...  \nIt s not yet aligned, will do it all than (after I buy the font) for the word trading.\n\nSo what do you think?\n\nThank you for any critique!  \nK.\n\n ![](http://web.archive.org/web/20150419164441im_/http:/typophile.com/files/f_4047.jpg)\n\n"
    },
    {
      "time": "16 Apr 2013 — 3:11am",
      "content": "Helvetica all upper cased\n\n"
    }
  ]
}
