{
  "id": "101178",
  "title": "Automatic Ligatures for MS Word",
  "forum": "General Discussions",
  "tags": [
    "18th Century",
    "fraktur",
    "General Discussions",
    "historical",
    "ligatures"
  ],
  "content": "I have been using the Unifraktur Maguntia font in Microsoft Word, and had this idea to use a macro to automatically insert ligatures and special characters such as the long s. Does anyone know if this has been done before and if there is already such a tool in existence? David Manthey used the same idea on his 18th century Caslon font:  \n [http://www.orbitals.com/self/ligature/ligature.htm](http://web.archive.org/web/20150414054022/http:/www.orbitals.com/self/ligature/ligature.htm \"http://www.orbitals.com/self/ligature/ligature.htm\")\n\nOne of the nice things about Unifraktur Maguntia is that it includes all the necessary ligatures and historic characters. Here is some more information:  \n [http://unifraktur.sourceforge.net/maguntia.html](http://web.archive.org/web/20150414054022/http:/unifraktur.sourceforge.net/maguntia.html \"http://unifraktur.sourceforge.net/maguntia.html\")\n\n",
  "author": "hessenkassel",
  "time": "6 Mar 2013 — 6:17pm",
  "uid": "209214",
  "comments": [
    {
      "time": "6 Mar 2013 — 6:40pm",
      "content": "Since said macro would be nothing more than a long sequence of search and replace actions, why not just record it yourself?\n\nA much better solution would be to use an app that understands OpenType, so that it can do it for you automagically. I hear that InDesign and current versions of Word have the necessary smarts, and I know that XeTeX does, so you have options.\n\n"
    },
    {
      "time": "7 Mar 2013 — 6:00am",
      "content": "Which version of Word are you using? Word 2010 and newer can use automatic OpenType ligatures. The usage of ſ can’t be automated (at least in German) because the rules are too complex.\n\n"
    },
    {
      "time": "7 Mar 2013 — 12:24pm",
      "content": "That must be the problem then; I was using the 2007 version. Using a different app that supports OpenType would help a lot, even if I would still have to manually change some things.\n\n"
    }
  ]
}
