{
  "id": "101146",
  "title": "Handwriting font - problem with connecting glyph pairs",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hello  \nWe need to make several books with handwriting text. This is textbook book for teaching childs in first class how to write.  \nWe have one font for this purpose (look in attachment) but problem is that we need to choose \"link glyph\" (underline glyphs in attached picture) between every two glyphs and manually adjust kerning. This is looser work. We use indesign cs4 or cs6.\n\nWhat solution I have to can easy type text without manual kerning work? How to rebuild this font and use indesign tools for easy job?\n\nthanks\n\n| Attachment | Size |\n| --- | --- |\n| [Untitled-1.png](http://web.archive.org/web/20131108074146/http:/typophile.com/files/Untitled-1_22.png) | 28.89 KB |\n\n",
  "author": "foler",
  "time": "6 Mar 2013 — 2:21am",
  "uid": "209579",
  "comments": [
    {
      "time": "6 Mar 2013 — 8:40am",
      "content": "This is one of the reasons why ligatures and OpenType features exist. If your font has \"link glyphs,\" as you imply, chances are it already has this support and all you need to do is enable them in InDesign. If said font lacks the features logic, it's a pain but not that hard to write a basic features file to enable them.\n\nIdeally, your font should automagically insert predesigned ligatures for many sequences of letters, using the link glyphs only as needed for exceptional cases.\n\nIt might be easier to choose a different font that has these capabilities -- doing it by hand can give great results (and you'll need to tweak it manually anyway) but it's a major pain, more trouble than it's worth.\n\n"
    },
    {
      "time": "6 Mar 2013 — 9:52am",
      "content": "Foler, if the font in question is deficient in terms of automatically connecting as you need, it can be fixed. If you have a budget for this sort of work there are many people on Typophile\\* who can carry out such a modification.\n\n\\* Including yours truly: hpapazian at gmail dot com\n\nhhp\n\n"
    }
  ]
}
