{
  "id": "1011",
  "title": "Black wheights funnier than light wheights?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "It was just a thought, but am i wrong?\n\n",
  "author": "fonthausen",
  "time": "22 Aug 2003 — 12:43pm",
  "uid": "829",
  "comments": [
    {
      "time": "22 Aug 2003 — 1:21pm",
      "content": "Makes sense.   \nWe already associate light weights to \"elegance\"/\"seriousness\" anyway.\n\n"
    },
    {
      "time": "22 Aug 2003 — 2:14pm",
      "content": "Interesting topic. Maybe they usually end up \"funny\" because the femimine Carolingian foundation of most contemporary work makes dark weights chubby and cute. But if you picture a really dark fraktur for example (or anything angular), I'd say it's the opposite of funny.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Aug 2003 — 10:57pm",
      "content": "Maybe because black weights suffer major deformations in the shape to fill the inner space\n\n"
    },
    {
      "time": "24 Aug 2003 — 7:26am",
      "content": "H\n\n"
    },
    {
      "time": "24 Aug 2003 — 7:48am",
      "content": "When a typeface gets very bold, its features become more   \nexaggerated until it becomes almost a caricature of the   \n\"normal\" weight. I think exaggeration is the key. It is, after   \nall, one of the basic elements of humor.\n\n"
    },
    {
      "time": "24 Aug 2003 — 1:04pm",
      "content": "Does everything have to be funny?   \n   \nhhp\n\n"
    },
    {
      "time": "24 Aug 2003 — 1:23pm",
      "content": "What do you mean?\n\n"
    },
    {
      "time": "24 Aug 2003 — 1:29pm",
      "content": "I don't think a Black weight _has_ to be a funny caricature, and sometimes it plain shouldn't be - it depends on the character of the face. Galliard for example is a very \"joyous\" design, so its Black is perfect. But Patria's Black should be (and will be) austere.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Aug 2003 — 2:19pm",
      "content": "I would agree with that. I should have said that features   \n**can** become exaggerated to the point of caricature.   \nI was just speculating why some very bold faces do look   \n\"funny.\" I didn't mean to imply that all of them do.   \nI'm thinking of things like Cooper Black or Gill Kayo, for   \nexample.\n\n"
    },
    {
      "time": "24 Aug 2003 — 2:45pm",
      "content": "...Blackoak anyone?   \n   \n ![](http://web.archive.org/web/20131012195436im_/http:/www.typophile.com/forums/messages/30/14686.gif)\n\n"
    },
    {
      "time": "24 Aug 2003 — 4:12pm",
      "content": "why not mike ?\n\n"
    },
    {
      "time": "24 Aug 2003 — 5:11pm",
      "content": "I stand corrected!!\n\n"
    },
    {
      "time": "24 Aug 2003 — 5:19pm",
      "content": "If there's one font that totally dessimates the \"we read best what we read most\" claptrap, it's FF Extra.   \nPaul Neville, _thank you!_   \n   \nhhp\n\n"
    },
    {
      "time": "24 Aug 2003 — 5:25pm",
      "content": "Mike, the more a situation is desperate, the more people will \"appropriate\" unrelated channels to voice their dissenting opinions. You could say that's a natural and useful \"automatic\" tool for fighting injustice, since the more desperate a situation the more urgent help humanity needs.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Aug 2003 — 5:50pm",
      "content": "Also, during the run-up to the invasion of Iraq, Typophile's moderators invited participants to express their political views by modifying their avatars/portraits/monograms/logos.\n\n"
    },
    {
      "time": "24 Aug 2003 — 11:12pm",
      "content": "Hrant said:   \n\"If there's one font that totally dessimates the \"we read best what we read most\" claptrap, it's FF Extra.\"   \n   \nI too consdier this prhase is tricky, considering that familiarity is only one of the factors which aid type legibility, but how does this font particularily tears down the saying.   \n   \n ![Extra Black](http://web.archive.org/web/20131012195436im_/http:/www.typophile.com/forums/messages/30/14697.gif)\n\n"
    },
    {
      "time": "25 Aug 2003 — 1:24am",
      "content": "Sorry guys,   \nI started this thread, but I couldn't react myself sooner.   \n   \nI was just wondering this question myself. Because as you commented right, when a face is made bold, it starts becoming a caricature. Several people have tried different theories to make type more bold. But most of them didn't loose the caricature factor. Why is this?   \n   \nCouldn't there be a way to make type bold, whitout this effect?   \n   \nAnd I have a second question. Now we take bold type for granted, but it is a 'modern' feature of faces.\n\n"
    },
    {
      "time": "25 Aug 2003 — 11:34am",
      "content": "RE: Political messages.   \n   \nSorry. I did not realize that it was invited by the moderators. I am happy to abide by the rules ...etc.   \n   \nI made the comment because for me type and books are a way to relax and find some small enjoyment in a difficult world. It is a minor irritation to be reading along with a smile and then encounter a slogan that slams 'my president'. I just do not want to deal with that while I am here.   \n   \nPlease do not make the assumption that I am not active, engaged or that I am somehow creating a lifestyle of avoidance, as that would not be correct.   \n   \nI have invested a great deal of time researching this who Iraq situation, talking about it and staying abreast of it. I read a number of publications that deal with word issues, events, politics, policy and so on.   \n   \nTypophile and type related pursuits are a break for me. That is all.   \n   \nThank you for the polite and helpful responses and I am glad my question did not derail the topic of this tread!   \n   \n;)\n\n"
    },
    {
      "time": "25 Aug 2003 — 12:01pm",
      "content": "As much as I disagree with the Bush Administration and it's policies, I tend to agree with Mike. Let's talk type and leave political discussion to the folks at the [FreeRepublic](http://web.archive.org/web/20131012195436/http:/www.freerepublic.com/) or [Democratic Underground](http://web.archive.org/web/20131012195436/http:/www.democraticunderground.com/). (Whichever suits your taste!)\n\n"
    },
    {
      "time": "25 Aug 2003 — 1:15pm",
      "content": "Dont worry mike i\n\n"
    },
    {
      "time": "25 Aug 2003 — 8:45pm",
      "content": "H\n\n"
    },
    {
      "time": "25 Aug 2003 — 9:36pm",
      "content": "\\> but how does this font particularily tears down the saying.   \n   \nH\n\n"
    },
    {
      "time": "26 Aug 2003 — 11:37am",
      "content": "\\>Is a bold wheigth just a 'normal' wheight made   \n\\>fatter, or can is it a totally different design   \n\\>which can be use a bold version of a lighter   \n\\>wheight?   \n   \nA good example of a bold different from the regular is Frantisek Storm's [Lexon Gothic](http://web.archive.org/web/20131012195436/http:/www.myfonts.com/fonts/storm/lexon-gothic/).   \nThere's a short explanation on this design, written by Storm himself, scrolling down the page.   \n   \nI think it's more interesting when bold and regular actually have different designs, but like Hrant said, it depends on the overall design.\n\n"
    },
    {
      "time": "22 Aug 2003 — 2:03pm",
      "content": "In many ways I think black weights are more human than light weights, but I'm not so sure they are always more funny. I'd like to see what you are thinking. Can you post some examples?\n\n"
    },
    {
      "time": "24 Aug 2003 — 4:01pm",
      "content": "_\\>...Blackoak anyone?_   \n   \nYou call that a black face? [This](http://web.archive.org/web/20131012195436/http:/www.philsfonts.com/detail.html?sku=FF00909801P1) is a black face!   \n   \nCitation adapted from Paul Hogan in _[Crocodile Dundee](http://web.archive.org/web/20131012195436/http:/www.imdb.com/Title?0090555)_\n\n"
    },
    {
      "time": "25 Aug 2003 — 11:46am",
      "content": "Invitation is not quite true- modifying user icons really came from user request (during a Typophile Lunchbox, I believe), and we said \"OK, go for it\"\n\n"
    }
  ]
}
