{
  "id": "101106",
  "title": "Font ID: serif, with numbers only",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "numbers",
    "serif",
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20131016092514im_/http:/typophile.com/files/11_5258.png)\n\nAnyone have any ideas? I ran this sample through a couple of other font ID sites with no matches yet.\n\nThe story behind this font, in case it helps in any way:\n\nMy boss had me redo a set of business cards for a number of new recruits, but he doesn't have the originals, so I'm tasked with recreating them from scratch. I scanned his card in and re-arranged the numbers so as to not reveal addresses/phone numbers.\n\nThe curious thing is that all the alphabetical letters were done in Century Gothic, but the numbers were done in this unknown font, and thus I only have the numbers as a sample.\n\nThe closest match I've found so far is Courier, but differences are still there.\n\nAny insights are much appreciated!\n\nThank you in advance,  \nRyan\n\n",
  "author": "a12e",
  "time": "4 Mar 2013 — 7:01pm",
  "uid": "209537",
  "comments": [
    {
      "time": "4 Mar 2013 — 7:23pm",
      "content": "i'm sure it's not correct, but i did find a font called [Buttzilla](http://web.archive.org/web/20131016092514/http:/www.myfonts.com/fonts/buttfaces/buttzilla/) while looking. just thought i'd share :)\n\n"
    },
    {
      "time": "4 Mar 2013 — 7:26pm",
      "content": "and to be more of use check out [Levinim](http://web.archive.org/web/20131016092514/http:/www.whatfontis.com/Levenim-MT.font). maybe the alphas were this, and not CG?\n\n"
    },
    {
      "time": "4 Mar 2013 — 7:53pm",
      "content": "If Levinim had the texture of Buttzilla, it would be a perfect image match. :)\n\nThanks, defiantone!\n\n"
    },
    {
      "time": "4 Mar 2013 — 7:58pm",
      "content": "hopefully you aren't trying to match the texture. that's just dots from the printing process. looks like the text sample you have was printed at oh, maybe 80% instead of 100% black.\n\nand i still want to know where the name came from, relative to naming a font like that. made me giggle after reading a blog about farts in yoga class.\n\n"
    }
  ]
}
