{
  "id": "101171",
  "title": "Choosing a typeface for a novel",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello everyone,\n\nI'm a final year Graphic Design Student working on a Final Major project. I'm redesigning a book most of you will know; G u l l i v e r ' s T r a v e l s . I'm choosing a typeface/font, and wanted some advice as to what would be best..\n\nThe story is based in the 1800s, the book reads in the first person. Gulliver is educated, has a passion for voyage and shows no Emotion - A suitable typeface, in my opinion, would be a Sans Serif, possibly found in Geography text books?  \nAnother option could be - Serif typeface found in Dictionaries from the 1800s?  \nAnother - A readable, monotone, Serif typeface from that period?\n\nAny suggestions welcome..\n\nThanks for reading!\n\n",
  "author": "MrMaximilian",
  "time": "6 Mar 2013 — 2:40pm",
  "uid": "209605",
  "comments": [
    {
      "time": "6 Mar 2013 — 3:26pm",
      "content": "Have you read the book? I think you will find that it is set in the 1700s, not the 1800s. It was published in 1726 (revised 1735).\n\nHere's the [titlepage of the first edition](http://web.archive.org/web/20131019111429/http:/www.computerhistory.org/atchm/wp-content/uploads/2012/11/JSW003_31.jpg), predictably set in Caslon's types (with perhaps engraved letters used for the largest sizes on the page). If you wanted to move away from that obvious model, into perhaps something that captures the mid-1700s rationalist culture that Swift satirises in the book, consider [New Fournier BP](http://web.archive.org/web/20131019111429/http:/www.swisstypefaces.com/fonts/new-fournier-bp/).\n\nBTW, your Random Capitalisation is very 18th Century.\n\n"
    },
    {
      "time": "6 Mar 2013 — 3:43pm",
      "content": "Don't use a sans for a lot of text.\n\nImportant questions:  \n- Who is the target reader?  \n- What's the proportion/nature of the illustrations?\n\nhhp\n\n"
    },
    {
      "time": "6 Mar 2013 — 4:06pm",
      "content": "Thanks for the reply. Yeah, I've read the book, and thanks for pointing that out. To be precise, the book is set in the late 1600s into the early 1700s. Could you explain how 'New Fournier BP' captures/reflects the mid-1700s rationalist culture? I'm not quite sure I see you what you mean, I don't see Swift's parody for the mid-1700s.\n\n"
    },
    {
      "time": "6 Mar 2013 — 4:11pm",
      "content": "The book will be aimed at a new generation of visually aware readers, or in other words, graphic designers/creatives. So every solution must be rational and must communicate a message to the reader. The brief is completely open to any interpretation, we must just avoid creating a pastiche..\n\n"
    },
    {
      "time": "6 Mar 2013 — 5:42pm",
      "content": "<cite>The book will be aimed at a new generation of visually aware readers, or in other words, graphic designers/creatives.</cite>\n\nThen it won't sell.\n\nFirst of all, there aren't very any of \"them.\"\n\nSecondly, \"they\" have a lot of varying opinions about \"what's right\" or \"what's best.\" Just read these pages. All you'll occasion is \"Well, <cite>I</cite> would have used...\"\n\nBeyond that:\n\nHere's the analogy. You are a set designer. You want to use an open set with a Shakespearean play. What else has to be there in order for your set to work?\n\n"
    },
    {
      "time": "6 Mar 2013 — 5:59pm",
      "content": "To emphasize the Gulliver-Lilliputians relative size, possibly a font with a very small x-height and very large ascenders ... - Herb\n\n"
    },
    {
      "time": "6 Mar 2013 — 6:00pm",
      "content": "I see your point, but fortunately, this won't be going on sale, it is a university project. I agree, every designer will react differently, hence, why I am here, starting this thread to see your opinions.\n\nTo your analogy: There has to be scenery, colour, lighting/mood, a curtain, some actors, sound...\n\n"
    },
    {
      "time": "6 Mar 2013 — 7:15pm",
      "content": "In other words, you want help with your homework...\n\n"
    },
    {
      "time": "6 Mar 2013 — 7:22pm",
      "content": "<cite>I see your point, but fortunately, this won't be going on sale, it is a university project</cite>\n\nAh. Afraid I can't help then, haven't been at university for over 40 years. Of course, I've spent the last 30 setting and designing books for university presses, but they do care about sales...\n\nThe point about the set analogy is, you don't usually build the production around the set. The set designer has to adapt. But if perchance you do build a production around the set, don't stop there. It is, after all, a whole.\n\n"
    },
    {
      "time": "6 Mar 2013 — 11:15pm",
      "content": "Charles, just because a publication is designed to appeal to a certain group doesn't mean nobody else will buy it. There _is_ the content, after all! :-) Also, designers don't just buy/acquire things with which they agree; the good ones also acquire things they don't agree with (in order to learn) especially if other people think it's culturally significant.\n\nRamping up HVB's idea: choose different -but harmonious- fonts for each of Gulliver's voyages. There are typeface systems with multiple styles. Hmmm, what about Compatil?\n\nhhp\n\n"
    },
    {
      "time": "7 Mar 2013 — 2:06am",
      "content": "You may find the [GraphicDesign& treatment of Great Expectations](http://web.archive.org/web/20131019111429/http:/www.graphicdesignand.com/outputs/bliss/page-1) inspiring. It includes contributions from Phil Baines and Erik Spiekermann amongst many others. It might help you to imagine presenting your idea to this particular group of professionals...\n\n"
    },
    {
      "time": "7 Mar 2013 — 5:04am",
      "content": "Just to be contrary, may I suggest a sans that doesn't look like a sans…  \n [http://www.myfonts.com/fonts/itc/goudy-sans/](http://web.archive.org/web/20131019111429/http:/www.myfonts.com/fonts/itc/goudy-sans/ \"http://www.myfonts.com/fonts/itc/goudy-sans/\")\n\n"
    }
  ]
}
