{
  "id": "101122",
  "title": "ReType font release: Medusa",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "![](http://web.archive.org/web/20150415103340im_/http:/www.re-type.com/newsletter/retype/images/medusa-logo.png)\n\nNew from ReType, Medusa is Ramiro Espinoza’s homage to one of the most renowned masters of Spanish calligraphy, Ramón Stirling, who was active in Barcelona during the 19th century. Not much is known about his life, and there is even some doubt as to his real name, but his Bellezas de la Caligrafía (Beauties of Calligraphy) is one of the most exquisite English roundhand manuals ever produced.  \nThe starting-off point in the creation of the typeface was an analysis of the historical models of formal English handwriting and the ways in which those styles had been adapted to the typographic technologies of different eras. A representative example of such adaptations involves the group of letters which, in connected scripts, join from near the top of their x-height, namely “b”, “o”,  \n“v” and “w”.\n\n![](http://web.archive.org/web/20150415103340im_/http:/www.re-type.com/newsletter/retype/images/bickham-sample.png)\n\n_Model from The Universal Penman (1740)_\n\nUp to now, all typefaces derived from the roundhand have been simplified so that the above letters connect with the following glyphs from the middle of their x-height. Unfortunately, this solution produces an artificial, awkward appearance, far removed from the beauty of the canon of the golden age of commercial handwriting.\n\n![](http://web.archive.org/web/20150415103340im_/http:/www.re-type.com/newsletter/retype/images/newsletter-img-01.png)\n\n_Letters typically adapted for typography A more authentically calligraphic approach_\n\nNowadays, the OpenType format affords the possibility of solving this problem. Instructions can be programmed into a font to automatically select the appropriate alternate glyphs as the user types. Despite the existence of this option, no one has yet published a copperplate typeface that is a faithful reflection of historical writing models, connecting “b”, “o”, “v” and “w” in the correct manner. Extra effort is required to program and design the many alternate character sequences necessary, and this has not been implemented by type foundries accustomed, as also are type users, to the familiar faux convention.  \nAt ReType we decided to move in the opposite direction. We didn’t force the shape of hard-to-format letters into the service of technology, but rather resolved to press technology into the service of respecting the original graceful quality of those letters.  \nMedusa is much more than a mere digital transfer of Ramón Stirling’s model. Several of the original letters, such as “f”, “s” and “z,” whose appearance was somewhat weaker, have been replaced by designs based on Espinoza’s own accomplished pointed nib calligraphy.\n\n![](http://web.archive.org/web/20150415103340im_/http:/www.re-type.com/newsletter/retype/images/newsletter-img-02.png)\n\nIn addition, numerous elements lacking in Stirling’s book have been added. The fantastically ornate capitals were redrawn in order to strike a greater balance and enhance the consistency of the set of letters as a whole. Several swashes and ligatures were also created from scratch, but with an unwavering respect for the formal rules of pointed pen calligraphy to ensure that their ductus was correct. Perhaps the most unusual feature of Medusa is its small caps, which have been carefully designed to produce an all-cap setting that is stylistically harmonious with the classic copperplate script, something which has up to now been missing from this genre of typeface.  \nFinally, we are offering a separate set of modular swashes that enable complex decorative headings and cartouches.  \nWe are pleased to say that Medusa is a complete script system the unique features of which will lend elegance and sophistication to a wide variety of design projects.\n\n[www.Re-Type.com](http://web.archive.org/web/20150415103340/http:/www.re-type.com/ \"www.Re-Type.com\")\n\n![](http://web.archive.org/web/20150415103340im_/http:/www.re-type.com/newsletter/retype/images/medusa-newsletter-news.png)\n\n",
  "author": "Ramiro Espinoza",
  "time": "5 Mar 2013 — 9:59am",
  "uid": "1137",
  "comments": [
    {
      "time": "5 Mar 2013 — 10:16am",
      "content": "Hi ramiro, awesome to finally see this finished :) I could tell you it's a beautiful typeface, but you already know that. The thing is, I never really cared for script fonts, and you just changed that. This is a revolution in script typography. Cheers!\n\n"
    },
    {
      "time": "5 Mar 2013 — 2:48pm",
      "content": "Magniﬁcent!  \nIt’s good to see your own historically informed penmanship expressed in these letters and ﬂourishes, providing a rare degree of authenticity.\n\n"
    },
    {
      "time": "5 Mar 2013 — 3:08pm",
      "content": "Lovely! Best of luck with it!\n\n"
    },
    {
      "time": "6 Mar 2013 — 12:49am",
      "content": "Thanks, guys :)\n\n"
    },
    {
      "time": "6 Mar 2013 — 10:58am",
      "content": "Looks very beautiful and elegant!\n\n"
    },
    {
      "time": "6 Mar 2013 — 6:46pm",
      "content": "This is absolutely gorgeous. Obviously very well-researched, and the small capitals are such a nice (and useful) touch!\n\n"
    }
  ]
}
