{
  "id": "101168",
  "title": "Rock ’n’ Roll: correct apostrophe usage",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "All, what is correct apostrophe usage when abreviating \"and\" to ’n’? (for US grammar)  \nI've seen all kinds of versions out there.\n\n",
  "author": "Richard L",
  "time": "6 Mar 2013 — 12:26pm",
  "uid": "208878",
  "comments": [
    {
      "time": "6 Mar 2013 — 1:04pm",
      "content": "You have it right: the apostrophe takes the place of both missing letters a and d, just as it does in words like \"I'll\" and \"can't.\"\n\nNot-that-smart \"smart\" quotation features assume that a typed apostrophe beginning a word is intended to be an open single quote, but they are wrong in cases like '68 Olympics, 'Tis the season, and rock 'n' roll.\n\n"
    },
    {
      "time": "6 Mar 2013 — 1:26pm",
      "content": "Isn’t it about time the poor apostrophe had its own Unicode?\n\n"
    },
    {
      "time": "6 Mar 2013 — 1:31pm",
      "content": "But is such use of two apostrophes grammatically correct to begin with? If it's not, \"anything goes\" works out fine anyway.\n\n[http://www.in-n-out.com/](http://web.archive.org/web/20150426204448/http:/www.in-n-out.com/ \"http://www.in-n-out.com/\")\n\nBTW auto-quotes also mess up the Hawai‘ian ‘okina diacritic.\n\nNick, the apostrophe does have its own Unicode number; but I'm not sure how much it's actually referenced.\n\nhhp\n\n"
    },
    {
      "time": "6 Mar 2013 — 1:55pm",
      "content": "Hrant,\n\nIf you're thinking of U02BC, that's only appropriate where the apostophe serves either as a phonetic modifier or as a letter in its own right, so this would be appropriate for words like _b'ak'tun_ or _Qur'an,_ but not for words like _'n'._\n\nAndré\n\n"
    },
    {
      "time": "6 Mar 2013 — 2:17pm",
      "content": "Strictly speaking, I believe U+0027 _is_ the apostrophe. It's only typists' convention (and the limitations of ASCII) which causes most word processors to use it as a synonym for the right single quote.\n\nI see the Unicode standard describes U+2019/right single quote as also being the 'preferred' apostrophe character (goodness knows why), but it doesn't change that U+0027 is the character officially assigned as the apostrophe...\n\n"
    },
    {
      "time": "6 Mar 2013 — 2:19pm",
      "content": "André, I didn't know that! Thank you.\n\nAlex, I think 0027 is best seen as a non-directional single quote.\n\nhhp\n\n"
    },
    {
      "time": "6 Mar 2013 — 3:17pm",
      "content": "U+0027 is a deliberately ambiguous character intended to represent a left quote, a right quote and an apostrophe. It reflects the fact that computer keyboards typically follow typewriter keyboards -- as opposed to, say, typesetter keyboards --, and these had only one ' key. I don't consider U+0027 to be a character at all in the sense of something to be displayed as a text entity; I consider it a (not very good) input mechanism for other characters.\n\nNick: _Isn’t it about time the poor apostrophe had its own Unicode?_\n\nIt already has two. U+2019 is the right quote character that, following writing practice, is normally indistinguishable from the apostrophe, hence Unicode's annotation that this is the preferred apostrophe character on the grounds that, unlike U+0027, it actually looks like an apostrophe. The other apostrophe character is U+02BC, but as André notes this is properly used only in some forms of transcription where it typically indicates a glottal stop.\n\nIs there a need for an apostrophe character distinct from the right quote character? I don't think so: written and typographic practice is for these two characters to be identical, and I can't think of any behaviour distinctions. The problem is not lack of a separate codepoint for apostrophe, but the general shittiness of keyboard layouts derived from typewriters and the inability of 'smart' quote substitution to handle all the instances in which the input mechanism U+0027 needs to be displayed as U+2019.\n\n"
    },
    {
      "time": "6 Mar 2013 — 3:40pm",
      "content": "Actually it would be nice to have a proper apostrophe code point, simply because an apostrophe is not a quote! They have a different meaning. Just because writers and typographers have been too lazy to show a difference doesn't mean they never will. Remember, some people like quotes to point in a different direction than an apostrophe (not to mention the size potentially being different). I personally believe the ideal closing quotes point upward (and inward) and have in fact made a font like that (Cristaal). Nobody _has_ to do that, but not having an apostrophe code point obstructs that choice.\n\nhhp\n\n"
    },
    {
      "time": "7 Mar 2013 — 6:56am",
      "content": " ![](http://web.archive.org/web/20150426204448im_/http:/typophile.com/files/dontlookback_4838.jpg)\n\nWe don’t need no apostrophes.\n\nTim\n\n"
    },
    {
      "time": "7 Mar 2013 — 10:37am",
      "content": "Hrant: _Actually it would be nice to have a proper apostrophe code point, simply because an apostrophe is not a quote! They have a different meaning._\n\nUnicode does not encode semantics, it encodes text entities. This $ has a different meaning in various countries, despite often having the same name, but is a single character.\n\nYour Cristaal example would be evidence for possible disunification, but idiosyncracy tends not to be very convincing in what is, after all, systems built on conventions and standardisation. You'd need to present a variety of examples in real-world use and make the case this these merit requiring updates of all software to handle the new apostrophe character.\n\n"
    },
    {
      "time": "7 Mar 2013 — 10:35am",
      "content": "Bob D'ylan might not need apostrophes but [greengrocer's do](http://web.archive.org/web/20150426204448/http:/en.wiktionary.org/wiki/greengrocer%27s_apostrophe).\n\n"
    },
    {
      "time": "7 Mar 2013 — 11:12am",
      "content": "John, is producing examples of precedents the only way to achieve disunification? What about if I could robustly explain the _future_ benefits?\n\nhhp\n\n"
    },
    {
      "time": "7 Mar 2013 — 11:29am",
      "content": "Unicode does not encode glyphs, and so each Unicode point actually does represent a \"meaning\". So f, f, and i can become the ffi ligature, Arabic letters appear only once, and so on.\n\nIn ASCII, U+0027 is supposed to be the apostrophe and closing quote, and U+0060 is supposed to be the opening quote. In practice, though, U+0027 was available before U+0060, since that character was only added when lower-case was added to ASCII, so the practice of using U+0027 like the symmetrical symbol on a typewriter was well established.\n\nSo there ought to be a _different_ Unicode codepoint for the cases where one actually _wants_ the typewriter-style symbol!\n\nOn the other hand, U+0022 is **officially** a typewriter-like ambiguous double quote. So single and double quotes are handled very differently in the basic 256-character set. On the other hand, guillemets are handled properly in Unicode.\n\nThis is a mess, and the response has been for each operating system and application to handle U+0027 in whatever way fits its own needs. Since the \"right\" Unicode character is usually one that our keyboards won't let us type, I don't know if this can be \"fixed\" in a way that won't just make things worse.\n\n"
    },
    {
      "time": "7 Mar 2013 — 11:49am",
      "content": "_...each Unicode point actually does represent a \"meaning\"_\n\nNo. Meaning is semantic content of language. Writing systems capture various aspects of language as text, but outside of the Chinese ideographic system semantics are generally the least commonly captured aspect of language (English orthography only captures semantics via some punctuation, notably in the distinction between _its_ and _it's_, i.e. a distinction of meaning that is phonetically absent).\n\nUnicode encodes text entities for plain text processing, which means, as you note, that it does not usually encode glyph variants (ironically, the two examples you give of ffi ligature and Arabic positional forms are exceptions, since these have encoded presentation forms for backwards compatibility). But not encoding glyph variants does not mean that what Unicode encodes is _meaning._ Even in the case of East Asian ideographs, what Unicode encodes are the text entities needed for plain text processing, not the meaning of the characters (obviously, since some characters have multiple meanings or have diverged in their meaning in different cultures).\n\n_In ASCII, U+0027 is supposed to be the apostrophe and closing quote, and U+0060 is supposed to be the opening quote._\n\nU+0060 is a spacing grave accent, and is clearly identified as such in the Unicode Standard. It is not an opening quote and is not intended to be used as such. [BTW, there is no such thing as an 'opening quote' character outside of the conventions of particular punctuation systems. The 'left quote' character is a closing quote in the German system.]\n\n"
    },
    {
      "time": "7 Mar 2013 — 11:59am",
      "content": "Hrant: _John, is producing examples of precedents the only way to achieve disunification? What about if I could robustly explain the future benefits?_\n\nProviding examples of existing use is by far the easiest means to get any character encoded in Unicode. In the case of disunifications, the bar is higher than for new characters, because stability is one of the principle goals of any technical standard. In the case of Unicode, stability can also be a strict requirement due to signed agreements with other standards organisations that rely on Unicode not changing certain things. So, for example, Unicode has agreed with the [IETF](http://web.archive.org/web/20150426204448/http:/www.ietf.org/) not to introduce any more characters with canonical decompositions. Some disunifications are likely to be subject to such agreements.\n\nReally, I think your idea is likely a non-starter, because you're talking about disunifying characters that have been part of ASCII or ANSI for a heck of a long time. This is the sort of stuff that software developers consider core library stuff that no one has had to think about for decades. With regard to 'future benefits', pushback is much more likely to focus on future disruptions.\n\n"
    },
    {
      "time": "7 Mar 2013 — 12:06pm",
      "content": "Sadly I have to agree that it's pretty hopeless.\n\nWhat about co-opting an existing seldom-used apostrophe-like code point? Like U02BC.\n\nOr even adding a new one: \"Apostrophe We Never Knew We Really Needed\". :-)  \n(And just for the memories: [http://typophile.com/node/69010](http://web.archive.org/web/20150426204448/http:/typophile.com/node/69010 \"http://typophile.com/node/69010\"))\n\nhhp\n\n"
    },
    {
      "time": "7 Mar 2013 — 12:16pm",
      "content": "Well, yes, you could take the uppercase eszett approach, and encode a new character without changing any official behaviour for existing characters. The argument in that case is along the lines of 'Some people want to be able to distinguish an apostrophe from a right quote, so without changing the existing dual identity of U+2019, we'd like to encode a distinct apostrophe character'.\n\nAnd I'm 99.9% certain that the response in that case would be 'Such people should use U+02BC'.\n\n"
    },
    {
      "time": "7 Mar 2013 — 12:25pm",
      "content": "Jeez: talk about a tempest in a teapot…\n\nThe hell with the rules: we’re talking about **Rock ‘n’ Roll** here, so what **looks cool** rules, and especially more so if it rhymes. Sheesh…\n\n"
    },
    {
      "time": "7 Mar 2013 — 1:38pm",
      "content": "Röck ‚n‘ Röll\n\n"
    },
    {
      "time": "7 Mar 2013 — 2:56pm",
      "content": "@John Hudson:  \n<cite>U+0060 is a spacing grave accent</cite>\n\nBack in the old days of ASCII, U+0060 was a grave accent only to the same extent as U+0022 was an umlaut and U+0027 was an acute accent. That is, one possible unconventional coding was to overstrike those characters, and have their shape altered on sophisticated systems, or their meaning recognized by humans for output fr0m unsophisticated ones, to attain accents.\n\nThat this exotic coding is now claimed as the primary meaning of the character in the Unicode standard... is, I suppose, possible, but if so it does not give me great confidence in the committee responsible.\n\nOn the other hand, I _will_ admit that U+005E was changed from an exponentiation symbol or up-arrow to a spacing caret back when ASCII-64 gave way to ASCII-68 (and lowercase was added). So this trend could indeed have continued when Unicode came along.\n\nHowever, it does appear you are basically right, the story being made plain here:\n\n[http://www.cl.cam.ac.uk/~mgk25/ucs/quotes.html](http://web.archive.org/web/20150426204448/http:/www.cl.cam.ac.uk/~mgk25/ucs/quotes.html)\n\nbut as you can see, this situation is a changed compared to long-established usage... and not just in the X Window System either, but in countless ASCII terminals.\n\n"
    },
    {
      "time": "7 Mar 2013 — 3:19pm",
      "content": "Just so I'm clear: Is an apostrophe in text _always_ encoded as a RIGHT SINGLE QUOTE MARK?\n\nWhat are the chances somebody would write a Word and/or InDesign plug-in that goes through a text and changes the \"intended apostrophes\" to U+02BC? And/or some custom code point.\n\nhhp\n\n"
    },
    {
      "time": "7 Mar 2013 — 3:09pm",
      "content": "I simply cannot believe a British typographer would claim the following:\n\n> Is there a need for an apostrophe character distinct from the right-quote character? I don't think so: written and typographic practice is for these two characters to be identical, and I can't think of any behaviour distinctions.\n\nYet here we are.\n\nDo I have to look up any of several of my photographs of sentences (and, worse, lines) using half-assed British quotation-mark rules that end in ’ and you cannot figure out what it means until the next line starts?\n\nHave you never had to convert British quotes to U.S./Canadian quotes and found it next to impossible without manually inspecting the closing half of every quotation?\n\nI thought Bringhurst was the only British typographer with a tendency to decree that real-world scenarios are impossible by definition so follow my advice and please stop bothering me.\n\n"
    },
    {
      "time": "7 Mar 2013 — 3:13pm",
      "content": "Joe, I for one would love to see your collection of examples of -what might be called- \"apostrophe envy\".\n\nhhp\n\n"
    },
    {
      "time": "7 Mar 2013 — 3:27pm",
      "content": "Joe: _Do I have to look up any of several of my photographs of sentences (and, worse, lines) using half-assed British quotation-mark rules that end in ’ and you cannot figure out what it means until the next line starts?_\n\nBut it is precisely because written and typographic practice is for the right quote and apostrophe to be identical that such ambiguities occur. I'm not saying that there might not be reasons to want to distinguish them, I'm saying that's not how our writing system works. Sure, make the case that they should be distinguished, using the many examples you can surely find: that way lies spelling reform, alphabet reform, and tinfoil hats.\n\nAnyway, who you callin' a typographer?\n\n"
    },
    {
      "time": "7 Mar 2013 — 3:45pm",
      "content": "Hrant: _Just so I'm clear: Is an apostrophe in text always encoded as a RIGHT SINGLE QUOTE MARK?_\n\nNo. Very often it is encoded as the generic U+0027. I'm guessing that's probably the most common encoding simply because that's what the keyboard makes convenient. In order to encode U+2019, whether as apostrophe or quote mark, one either needs to input it directly (ALT+0146 on Windows, custom keyboard, etc.) or rely on 'smart quote' algorithms, which work a lot of the time and provide work for proofreaders the rest of the time.\n\n_What are the chances somebody would write a Word and/or InDesign plug-in that goes through a text and changes the \"intended apostrophes\" to U+02BC?_\n\nI think you could expect such a plug-in to be about as accurate as smart quote algorithms. In other words, it would get it right almost all the time, but would get it wrong in some ambiguous circumstances. As Joe rightly points out, it is likely to get it wrong more often in British usage.\n\n"
    },
    {
      "time": "7 Mar 2013 — 3:47pm",
      "content": "Just noticed this earlier comment:\n\nHrant: _BTW auto-quotes also mess up the Hawai‘ian ‘okina diacritic._\n\nThe proper character for this really should be U+02BB MODIFIED LETTER TURNED COMMA, but I'm sure it occurs encoded in many instances as either U+0027 or U+2018, and doubtless also U+2019 whether as the result of smart quote algorithms or ignorance.\n\nI wouldn't classify it as a diacritic: it represents a glottal stop, which means it is a full consonant and considered a letter in the alphabet. And to be fair to the ignorant, in other orthographies the ’ is much more commonly found as a glottal stop than the ‘ shape.\n\n"
    },
    {
      "time": "7 Mar 2013 — 3:54pm",
      "content": "> that's not how our writing system works.\n\nIn terms of an informal -if pervasive- tradition, I would have to agree. But where does it say \"they must look the same\"? It's just a lazy fallback (one that can cause confusion) and I don't think making the apostrophe and single right quote look different is any kind of \"reform\" - it's just a result of believing that's Good Design.\n\nWhen I made Cristaal's right quote(s) point up, that was not Wrong, but neither was I following some formal system. And others can see it (or hear about it) and possibly follow suit, creating a new tradition. For a while -thanks largely to ATF- mirrored quotes (where the left quotes point down) were quite common (and interestingly the old MS Core Fonts did that too) but that was not some act of sedition.\n\nThanks for the correction/elaboration on the ‘okina. One thing I value BTW is that it's supposed to point up (because that makes it less confusable with the apostrophe).\n\nhhp\n\n"
    },
    {
      "time": "7 Mar 2013 — 4:40pm",
      "content": "_For a while -thanks largely to ATF- mirrored quotes (where the left quotes point down) were quite common (and interestingly the old MS Core Fonts did that too) but that was not some act of sedition._\n\n[Unless you're a German](http://web.archive.org/web/20150426204448/http:/www.unicode.org/mail-arch/unicode-ml/y2006-m06/0030.html) whose [punctuation system](http://web.archive.org/web/20150426204448/http:/www.heckmeck.de/computerstuff/anfzeichen/) is [messed up](http://web.archive.org/web/20150426204448/http:/webdesign.crissov.de/Typografie/Zitieren#lieberandersrum) by [such designs.](http://web.archive.org/web/20150426204448/http:/www.unics.uni-hannover.de/nhtcapri/quotation-marks.html)\n\nI don't think it's a 'lazy fallback' that the apostrophe and right quote look the same. Its the outcome of an historical decision that this little mark ’ has more than one usage in text. Yes, it might sometimes result in confusion, but it's not at all uncommon for writing systems to contain such confuseables. Heck, we're talking about capturing natural language here: ambiguity, confusion, multiple meanings -- these are the very hallmarks of human communication.\n\n"
    },
    {
      "time": "7 Mar 2013 — 5:05pm",
      "content": ""
    },
    {
      "time": "7 Mar 2013 — 5:45pm",
      "content": "I remember that German situation being mentioned recently. I'm curious, would my upward (and inward) pointing quotes also not work out? Also, would German-localized versions of the quote glyphs solve the problem, or are language tags not well-supported?\n\nAmbiguity is natural, but so are warts. Let's treat them.\n\nhhp\n\n"
    },
    {
      "time": "7 Mar 2013 — 10:14pm",
      "content": "Letters:  \nʹ — U+02B9 Modifier Letter Prime  \nʻ — U+02BB Modifier Letter Turned Comma  \nʼ — U+02BC Modifier Letter Apostrophe  \nˊ — U+02CA Modifier Letter Acute Accent  \nˋ — U+02CB Modifier Letter Grave Accent\n\nPuncutation:  \n' — U+0027 Apostrophe  \n‘ — U+2018 Left Single Quotation Mark  \n’ — U+2019 Right Single Quotation Mark  \n′ — U+2032 Prime  \n‵ — U+2035 Reversed Prime\n\nSymbols:  \n` — U+0060 Grave Accent  \n´ — U+00B4 Acute Accent\n\nThe Unicode standard defines these three categories according to their expected behaviours in various writing systems and other forms of written communication (math, etc.). Letters are alphabetic elements, like the use of ʻ U+02BB Modifier Letter Turned Comma in Hawaiian to represent the glottal stop /ʔ/. Punctuation is an element that is paralinguistic, used for indicating textual phenomena that are not necessarily part of the spoken language. (So e.g. commas have an associated intonation contour in English, but commas don’t always occur where this intonation is found in speech and vice versa. The previous sentence is an example.) Symbols are something else entirely, and are kind of hard to define I guess.\n\nThere’s a pretty good argument to be made for the use of ʼ U+02BC Modifier Letter Apostrophe in English where we use apostrophes for contraction and possession: ‹ donʼt › and ‹ dogʼs ›. It is in essence an orthographic element that distinguishes different lexical items, and that’s what we usually think of as a “letter” even though the apostrophe doesn’t have an independent sound of its own. But it’s hard enough to get people to use ’ U+2019 Right Single Quotation Mark instead of ' U+0027 Apostrophe, so that asking people to differentiate the quotation ’ and letter-apostrophe ʼ is just tilting at windmills.\n\nAs for rock ’n’ roll, I think it’s best with the two apostrophes pointing the same way. Logically they are both apostrophes and not quotation marks, and English doesn’t have an apostrophe that points in the other direction. (Actually I don’t think any LGC orthography does, but I could be wrong). Writing ‹ rock ‘n’ roll › makes me think at first that the ‹ n › is being scare-quoted.\n\n"
    },
    {
      "time": "7 Mar 2013 — 10:34pm",
      "content": "Nice details and analysis. I think U+02BC is sounding pretty solid indeed.\n\nJust one thing:\n\n> But it’s hard enough to get people to use ’ U+2019 Right Single Quotation Mark instead of ' U+0027 Apostrophe, so that asking people to differentiate the quotation ’ and letter-apostrophe ʼ is just tilting at windmills.\n\nIt's not \"people\" that need to worry - they can't type anything more a \"dumb\" quote/apostrophe anyway; we need the software to automatically map to U+02BC (as best it can) as needed.\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 9:06am",
      "content": "Hrant: _Also, would German-localized versions of the quote glyphs solve the problem, or are language tags not well-supported?_\n\nThey are unevenly supported. Also, punctuation substitutions are unreliable in OpenType because there is a tendency in some software not to roll punctuation into glyph runs with adjacent text. Remember, OpenType Layout proceeds from script to language system to glyph, but the decision about what constitutes a character in a given script is made by the software, not by the font. Since a lot of punctuation is script-neutral, it can only pick up a script identity by algorithmic analysis of adjacent or surrounding text content. But that doesn't happen everywhere, while some software might simply presume common punctuation characters = Latin, which might help your German quote situation, but is a pain in the neck when trying to e.g. kern tall Thai vowels to preceding quote marks or parentheses!\n\nWith regard to the German quote issue, the desirable form of the 'left quote' U+2018, i.e. the German closing quote, is a 180 degree rotated and raised form of the opening baseline quote with which it corresponds.\n\n"
    },
    {
      "time": "8 Mar 2013 — 9:10am",
      "content": "Great insights - thanks.\n\nBTW, every passing day, I like guillemets more. :-)\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 9:20am",
      "content": "John (Q):\n\n> Back in the old days of ASCII, U+0060 was a grave accent only to the same extent as U+0022 was an umlaut and U+0027 was an acute accent. That is, one possible unconventional coding was to overstrike those characters, and have their shape altered on sophisticated systems, or their meaning recognized by humans for output fr0m unsophisticated ones, to attain accents.\n> \n> That this exotic coding is now claimed as the primary meaning of the character in the Unicode standard... is, I suppose, possible, but if so it does not give me great confidence in the committee responsible.\n\nYou are confusing things by referring to U+0060, U+0022, etc. and then talking about ASCII. The prefix U+ indicates a Unicode codepoint, i.e. a character in the Unicode Standard, not some other standard. So it makes no sense to talk about e.g. U+0060 'back in the old days of ASCII'. The Unicode 'C0 Controls and Basic Latin' block provides a one-to-one mapping of Unicode characters to ASCII characters, which is not the same thing as _being_ the ASCII standard. As you say, the ASCII standard deliberately enabled the interpretation of some codes as representing multiple characters. A principal -- and principle -- goal of Unicode's larger character set was to avoid such confusions, so I think the UTC was eminently sensible and responsible in assigning only one meaning to the Unicode character U+0060, allowing the other interpretations of the corresponding ASCII code to have their own unique Unicode assignments. I also think they made the right choice in selecting the spacing grave as the identity of this character given that the same block includes a corresponding spacing acute character, and the single quote character is handled as deliberately direction agnostic in almost all software -- note as a 'right single quote' and as a vertical glyph in almost all fonts, and there would be in any case no corresponding 'left double quote' if U+0060 were interpreted as a 'left single quote'.\n\nI still occassionally get emails from people that are punctuated like `this'. It is so obviously a mistake, I have to wonder what combination of software and font they might be using that doesn't display it as such, or if they are blind.\n\n"
    },
    {
      "time": "8 Mar 2013 — 9:54am",
      "content": "> I have to wonder what combination of software and font they might be using that doesn't display it as such, or if they are blind.\n\nThat is the way to get the right thing in LaTeX. Also ``word'' gives the right double quotes.\n\nIf you want to get that behaviour in XeLaTeX, you need to specify `Mapping=tex-text` when setting the font, for instance:  \n`\n\\setromanfont[Mapping=tex-text]{Chaparral Pro}\n`\n\n"
    },
    {
      "time": "8 Mar 2013 — 9:54am",
      "content": "John, that chaps my hide too.\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 12:02pm",
      "content": "Smart quote software could be made smarter, to include a dictionary of \"exceptions\" such as the first apostrophe in rock 'n' roll. After all, look at the way the new Blackberry reads people's minds and finishes their sentences for them.\n\n"
    },
    {
      "time": "11 Mar 2013 — 1:44pm",
      "content": "I think the reason that’s not caught on – outside of Microsoft Word, perhaps – is because you have to have a different set of exceptions for each language. If all you care about is English and French then it’s not too hard, but once you start including even other big languages like Spanish, German, Dutch, and Italian you’ve got a huge pile of databases to build and maintain.\n\n"
    },
    {
      "time": "11 Mar 2013 — 7:13pm",
      "content": "@John Hudson:  \nOn considering the matter more, I can see that the Unicode Consortium decision probably was quite reasonable.\n\nI didn't want to start referring to Unicode ' as U+0027 and ASCII ' as X'27' as that would confuse people.\n\nSince ' was used as the only quote much more than ` and ' were used as paired quotes - ` was, and is, so little used that I kind of wish that codepoint were used for, say, the degree symbol - I can somewhat see the logic of using ` for a grave accent.\n\nBut that just felt wrong, simply because accents were far to exotic to be part of the primary 7-bit ASCII set. I also felt that ^ should never have been changed from the up-arrow, so useful as an exponentiation operator.\n\nThus, when ISO 8859-1 came along, with all those accented letters, but without desperately needed symbols such as ≤, ≥, and ≠, I could only wonder what they were thinking. (On the other hand, placing × and ÷ on codepoints obviously more suitable for Œ and œ simply further compounded the insanity in the opposite direction. After all, \\* and / were perfectly good for multiplication and division, unless one was writing grade school arithmetic textbooks.)\n\nOf course, the whole world doesn't speak English. So a character set like ISO 8859-1 was indeed a good idea. But it should have been the -2 set, as it were, in my opinion. There already were alternate versions of 7-bit ASCII for the major European languages; what would make sense from my perspective would have been to allow any of those to have a supplementary set of high-bit characters bolted on. (And, thus, characters likely to be replaced - @, [, \\,], ^, \\_, `, {, |, }, ~ - would end up being copied/moved to the high-bit side) since, in general, after all, people only use one language at a time.\n\nAnd people who speak different languages clearly aren't able to communicate with each other, and so having the same character coding for areas where different languages are spoken... could wait until we went to 16 bits with Unicode (although, again, a set like 8859-1 for the specialized and exotic purpose of international communication certainly would be of _some_ use).\n\nOf course, strange to relate, in Continental Europe, people don't share the view of people living in, say, North America or Australia that anyone who speaks a different language either lives thousands of miles away or is a poor immigrant who is going to be learning your language instead of the other way around - because of the disparity in the economic value of the effort required.\n\n"
    },
    {
      "time": "2 Apr 2015 — 1:49am",
      "content": "Dear John,  \nCan I ask a bit more about the okina. I place myself on the ignorants wanting to learn... ;)  \nMy question then, this ‘ shape is the correct use of the okina for Hawaiian words that require that consonant?\n\nthank you for your kind answer.  \nWith respect & aloha.\n\nG. J.\n\n"
    },
    {
      "time": "2 Apr 2015 — 6:54am",
      "content": "<cite>For a while -thanks largely to ATF- mirrored quotes (where the left quotes point down) were quite common</cite>\n\nI thought that this depended on the typeface. In Bodoni, the left quote is a mirrored right quote, but in most other typefaces the left quote points up. So we're dealing with stylistic variants of the _same_ character, which\n\na) must not be given separate Unicode codepoints (from one another), and\n\nb) means that the left quote character cannot be relied upon to be either up-pointing or mirrored down-pointing.\n\nWhich, incidentally, explains why the character used for the glottal stop in Hawai‘i **must** have a separate code point.\n\n"
    },
    {
      "time": "2 Apr 2015 — 3:53pm",
      "content": "The best use of U+0027 -- the single quote -- can vary with the type of font.  \nFor a connected script I can't think of any other use than as the apostrophe.  \nIf one sets the character width of U+0027 to zero it can be used for an apostrophe that does not interrupt the smooth connections between the letters of the script.  \nThe following is a connected script, as typed, with no kerning, no contextual alternates or ligatures.\n\n ![](http://web.archive.org/web/20150426204448im_/http:/typophile.com/files/Punctuation1_4789.jpg)\n  \nThe idea here is to distinguish the apostrophe from both single and double quotes as much as possible and reduce the ambiguity faced by the reader when apostrophe, single and double quotes are stacked together.  \nDon\n\n"
    },
    {
      "time": "2 Apr 2015 — 4:12pm",
      "content": "Differentiating from the apostrophe is why I made the quotes in my Cristaal all point up (they're also mirrored). But using guillemets is even better.\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2015 — 5:08pm",
      "content": "Perhaps the reader who is not a typoguru does not notice any of the fine points such as whether right quotes point up or down, but merely wants to avoid being confused by a proliferation of little marks around and within the words. Bad enough in a language like English which has few accents, but a real jungle where the Latin alphabet is encrusted with accents such as Polish or Vietnamese.  \nAs for guillemets, they meet the distinctiveness test, but to the non-francophone world may not be recognized as quotes, and could be seen -- at least by anglophone readers -- as meaning double larger and double smaller.  \nWell, it's time for a nap in the famous bed of the ancient Greek Procrustes.  \nDon\n\n"
    },
    {
      "time": "2 Apr 2015 — 5:40pm",
      "content": "> guillemets […] to the non-francophone world may not be recognized as quotes\n\nIf by “non-francophone” you mean “anglophone”:  \n [http://en.wikipedia.org/wiki/Guillemet#Uses](http://web.archive.org/web/20150426204448/http:/en.wikipedia.org/wiki/Guillemet#Uses \"http://en.wikipedia.org/wiki/Guillemet#Uses\")\n\n"
    },
    {
      "time": "3 Apr 2015 — 2:43am",
      "content": "Impressive list of the guillemet-o-sphere.  \nTo shift emphasis from quotes back to the apostrophe, it's interesting to observe that the appropriate use of the apostrophe is moot in places like Québec where the language police prosecute and obtain convictions against businesses that use apostrophes in their signs.  \nPerhaps the use of the apostrophe is another anglophone exceptional case?  \nEnglish certainly has picky rules about the use of the apostrophe. In the sentence above I used an apostrophe to show the contraction of \"it is\" but I would not have used it to show that something is possessed by \"it.\" I would have been required to use the formula: The Sahara is hot, its climate is also dry.  \nDon\n\n"
    },
    {
      "time": "3 Apr 2015 — 7:31am",
      "content": "What bothers me in English is that quite often when an apostrophe is used to contract an \"is\" it often looks like a possessive at first and you end up having to backtrack.\n\nBTW in Armenian we use the apostrophe (\"abatarts\") for omitting a single letter, the –now archaic– \"badiv\" for abbreviating words, and –my favorite– the \"boot\" for omitting multiple (implied) words.\n\nhhp\n\n"
    },
    {
      "time": "3 Apr 2015 — 8:30am",
      "content": "I reading a language like German, which does not use the apostrophe for possessive nouns, I generally have no difficulty in understanding that when a noun ends in an \\_s\\_ I should expect it to be possessive.\n\nBut, unlike English, German does not rely on the terminal \\_s\\_ to state that a noun is plural -- plural nouns are preceded by \\_die\\_ and generally have a different ending than the singular noun. However the preceding \\_die\\_ can also be confusing because the same \\_die\\_ is used for feminine nouns. This is only the tip of the iceburg in the complexity of German syntax, which is a barrier to persons attempting to learn German, although probably minor compared to the uncertainty of a run-on sentence that waits for the action verb to finally be disclosed at its conclusion. By comparison, English is a walk in the park -- nouns lack any attribute of gender and the verb usually pops up near the start of a sentence.\n\nThe moral for the grammar of various languages is that there is no free lunch. Simplification fights with complexity, formal consistency, unambiguity etc.\n\nIn English, \\_Johns school\\_ means a school for Johns, i.e. a school to re-educate men who purchase the services of sex-trade workers, while \\_John's school\\_ means the school that John attends, or owns.\n\nI suppose, that in English at least, we are stuck with continuing to use the apostrophe.\n\nDon\n\n"
    },
    {
      "time": "3 Apr 2015 — 12:00pm",
      "content": "I'll have to admit that the fact that the posessive \"its\" doesn't take an apostrophe is annoying to me, since that means the pronoun it doesn't follow the same rules as ordinary nouns.\n\nThat it would happen to be spelled exactly the same as the contraction for \"it is\", though, doesn't bother me, as context makes it unambiguous in any case (or there would be a problem with the two words in speech).\n\nHowever, at one point, I proposed that a period might be used in the middle of a word to indicate where two vowels together are two separate vowel sounds instead of a dipthong - so that one didn't have to use the apostrophe for that purpose as well, as in Mont Follick's proposed phonetic spelling. So using a different unambiguous character for the possessive isn't a _bad_ idea; of course, the problem is that we don't have any suitable alternate characters conveniently available.\n\nThat is, something like Bill\"s tricycle, or Bill,s tricycle, or Bill/s tricycle would be too jarring and too visually distracting... and Bill`s tricycle works on computer keyboards, but not on classic typewriters.\n\nBill(s) tricycle wouldn't do either as that construction has a different, existing meaning. Of course, there are other constructs... BillS tricycle? Maybe with a small capital S in print... Bill:s tricycle? Bill-s tricycle?\n\nOf course, we could stick with Bill's tricycle in ordinary typing, and in print, where there are more character choices, do the posessive this way: Bill′s tricycle, with a prime, to indicate we're not using an apostrophe to dig into the word to remove a letter.\n\nWhen a word ends in s, whether or not it is a plural, an apostrophe following the s indicates the possessive, although one can omit the apostrophe if one uses the noun as an adjective - English, without case endings and a drastically simplified verb conjugation, lends itself to functional change.\n\n"
    }
  ]
}
