{
  "id": "101236",
  "title": "Sans Serif to go with Trinite",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Could you recommend a san serif to go with TEFF Trinite Roman Wide for a resume? I have used DTL Caspiri in the past, but its limited weights, cost, and imperfect match got me to thinking about a change. I have considered Whitney (maybe too large x-height and too small descenders), Ideal Sans (but the lowercase g would match more a transitional typeface, and Syntax (since it is based loosely on Stempel Garamond and has lowercase a and g that sort of match Trinite). Any suggestions from someone with a better eye than I have?\n\n",
  "author": "IsleofGough",
  "time": "8 Mar 2013 — 2:05pm",
  "uid": "27645",
  "comments": [
    {
      "time": "8 Mar 2013 — 2:27pm",
      "content": "Also considering Scala Sans Pro. What comes closed to Trinité's letterforms is DTL Documenta Sans, but it has only one weight.\n\n"
    },
    {
      "time": "8 Mar 2013 — 2:13pm",
      "content": "You're using Trinité for a résumé? Are you a cellist? ;-)\n\nhhp\n\n"
    },
    {
      "time": "13 Mar 2013 — 4:39pm",
      "content": ".\n\n"
    },
    {
      "time": "8 Mar 2013 — 5:29pm",
      "content": ":-)  \nIt's just so... lyrical. When's the last time an emotional job interview resulted in a hire?\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2013 — 3:39pm",
      "content": "That is why the sans has to be business like (so not Cronos, but perhaps Whitney). Using the bold version of Trinité is the usual solution in books. Leaving aside the purpose, can you recommend a complimentary sans?\n\n"
    },
    {
      "time": "8 Mar 2013 — 8:07pm",
      "content": "[Foundry Sans](http://web.archive.org/web/20130819220213/http:/www.foundrytypes.co.uk/the-foundry-typefaces/sans/params/foundry-sans)?\n\n"
    },
    {
      "time": "8 Mar 2013 — 8:56pm",
      "content": "Thank you!\n\n"
    },
    {
      "time": "8 Mar 2013 — 9:22pm",
      "content": "If you like Foundry Sans also look at the venerable Syntax, which AFAIK was the \"official\" inspiration for Foundry Sans; their main difference is that Syntax is very gently inclined (1/2 a degree I think) whereas Foundry Sans is fully upright (partly to avoid funny jaggies/anti-aliasing onscreen I think). And since Trinité is inclined, Syntax might actually be a better choice. If you like that sort of thing. :-)\n\nIf you really want a super neutral sans check out Kievit.\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2013 — 9:45am",
      "content": "Thank you for the suggestions.\n\nRegarding Trinité: It is calligraphic and not a general workhorse like Iowan Old Style or Minion (the latter really isn't so invisible, but its multilanguage support might make it good enough to use as a generic text font).  \nAlthough Trinité is a good choice in the book \"Turning over a New Leaf: Change and Development in the Medieval Book\", and is good for poetry (as was suggested in \"Book Typography: a designer's manual\", I think it is more versatile than that. It is hampered by its high price, older format (postscript), lack of ligatures, and weights (the medium is too bold). I think those are the major reasons one does not see it used more. In smaller sizes, the peculiarities of its calligraphic elements are diminished. Like various Garamonds, it requires some care in size, leading, layout, etc - maybe more than some other fonts, but that does not make it limited to poetry and whimsical text.\n\nMatching a sans is not easy. Maybe that is why Microsoft substituted Calibri for Times/Arial for its default Office (on the Windows side): it was good enough for short text, tables, and headings and pretty versatile in just four weights.\n\nI have seen the recommendations in \"The Big Book of Font Combinations\" for matching serif and san serif. Personally, the only nearly perfect match I've seen is with Scala. (It is my favorite for books that require a lot of tables and text). Even Documenta and Haarlemmer sans/serif variants clash a bit. When the Sans and Serif are clearly from different periods and very different, they can go fairly well together; and as they get closer, they start to clash. It is like colours.\n\nFoundary Sans is the closest I see to Trinité in letterforms, but the lowercase \"a\" has a slanted bowl that really doesn't fit with the other letters nor with Trinité. Syntax has a very different x-height and the \"a\" is even more different and the angled feet on \"M\" and \"N\" doesn't work for me.\n\nSo, if there is not a good letterform match between a Sans and Serif, how does one pick a good match that is complementary and not clash? Arial/Helvetica and Times or Myriad and Minion are complementary but not even close to the same letter forms or even vintage but they work more or less.\n\n"
    },
    {
      "time": "9 Mar 2013 — 10:36pm",
      "content": "There are various styles of matching. Some people go for extreme contrast (easy), others go for extreme harmony like choosing a serif and sans from the same superfamily (also easy), but the most challenging and often most fruitful approach is to choose fonts that are harmonious in spirit (which means they will also have some differences). Easier said than done!\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2013 — 3:03pm",
      "content": "Finding typefaces that are \"harmonious in spirit\" is difficult, because that requires a real understanding of the essence of several typeface families. So assuming one is looking for a humanistic sans, if one wants to keep with Dutch typeface families, once comes up with one list, but Dutch typefaces are too broad to be the only limiter. Caligraphic typefaces would be another starting point, but that doesn't seem to work (Cronos or Beorcana for example). Scala Sans is not bad, and both derive from French old style, but some of the choices in modernization that went into Scala Serif are quite different than Trinité. Whitney is what Myriad should have been, and is the opposite: fairly bland and corporate looking. Ideal sans is not so ideal, because although it may be one of the most readable sans, many serifs are more readable, and most of the subtle curves get lost at small sizes. (it also has a distinctive \"M\" and \"g\" which make it not blend well with other fonts, and I think its individual letter forms look better than words using it.) Probably that is why finding good graphic designers is neither easy nor cheap.\n\n"
    },
    {
      "time": "9 Mar 2013 — 1:36pm",
      "content": "It does indeed require a certain kind of instinct (one I myself don't have BTW).\n\n> Dutch typefaces are too broad\n\nNot lately, I'm sad to say. A guy from Upper Waziristan could go to KABK and he'd still end up producing the typographic equivalent of Geert Wilders. :-/ That's a bit much actually, sorry, but you get my gist.\n\nhhp\n\n"
    },
    {
      "time": "16 Mar 2013 — 4:17pm",
      "content": "Foundry Sans ended up looking the best. The kerning isn't as good as Whitney or Caspari unfortunately, but this is correctable. Thanks for the suggestion.\n\nBTW, I hear an opentype version of Trinité may be available this summer.\n\n"
    },
    {
      "time": "16 Mar 2013 — 4:25pm",
      "content": "Wow. Maybe Pablo's Cancelleresca Bastarda is having a softening effect? :-)\n\nhhp\n\n"
    },
    {
      "time": "16 Mar 2013 — 5:15pm",
      "content": "Competition is good. The Bastarda has passing similarity with Trinite but does not look like documenta. (i.e. there are at least two different Dutch typefaces in the world) Most people who spent a lot of money on anything will be biased in favor of it, so maybe that is why I really really like Trinite, not just like it. It is important to believe we have used our money wisely, whether it is true or not.\n\n"
    }
  ]
}
