{
  "id": "101212",
  "title": "Font \"Forensics\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "OK, typographic private-i's, whip out your magnifying glasses!\n\nSomebody has asked me to figure out if the screengrab below might have been doctored...\n\n ![](http://web.archive.org/web/20131023183101im_/http:/typophile.com/files/grab_4669.jpg)\n  \nIt looks legit to me, but maybe one of you guys can spot something funny. For example, what setup would produce that particular text rendering quality?\n\nhhp\n\n",
  "author": "hrant",
  "time": "7 Mar 2013 — 11:23pm",
  "uid": "1250",
  "comments": [
    {
      "time": "7 Mar 2013 — 11:52pm",
      "content": "It’s Arial with [Anti-aliasing](http://web.archive.org/web/20131023183101/http:/en.wikipedia.org/wiki/Anti-aliasing) off. See the Whatfont-Screenshot:\n\n ![](http://web.archive.org/web/20131023183101im_/http:/typophile.com/files/arial_4203.png)\n\nHrant, why don’t you post it in the TypeID-board, as it is one?\n\n"
    },
    {
      "time": "8 Mar 2013 — 6:28am",
      "content": "You can’t expect us to help you if you’re so illiterate, typographically and otherwise, that you call us <cite>private-i's</cite> (sic).\n\n"
    },
    {
      "time": "8 Mar 2013 — 1:08pm",
      "content": "I'm not asking for a font ID (I could figure out it was Arial). What I'm trying to find out is whether that screenshot was an actual screenshot or something put together \"synthetically\". So for example, can you get that exact anti-aliasing/subpixeling with an OS/browser, and one that makes sense here?\n\nJoe:  \n1) I tried not putting an apostrophe but it looked worse. I wish I could fix English.  \n2) Do you think the hyphen is incorrect?  \n3) Is an entire brain inhibited from addressing a problem when it sees disagreeable punctuation? Heres one that I hope will not prevent you from answer _these_ questions.\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 7:21am",
      "content": "Private eyes\n\n"
    },
    {
      "time": "8 Mar 2013 — 8:41am",
      "content": "So \"eyes\" for \"investigators\"? I think I'd actually seen that a while back, but blocked it out because it's so lame. So are all the instances of \"private i\" on the web incorrect? It wouldn't be the first time of course. And it certainly wouldn't be the first time Joe has tried to impose a fascist view of typography and pretend there's only one way to do something. But anyway, thanks for the [desire for] correction. Frankly I'd rather use \"PI\" though.\n\nBTW since I can't edit the original post I'm hoping that humans can in fact adapt to spelling mistakes enough to help me figure this out. After all, I'm adapting fine to unprovoked vicious personal attacks!\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 11:01am",
      "content": "Hrant, you need to take into account the image format of the screen capture. This is a jpeg, so there are compression artifacts that mean you are not looking at a clean image of the original text rendering.\n\n"
    },
    {
      "time": "8 Mar 2013 — 11:20am",
      "content": "@hrant, this should help explain it:\n\nThe Pinkerton National Detective Agency  \nThe agency's logo, an eye embellished with the words \"We Never Sleep\" inspired the term \"private eye.\"  \n [http://en.wikipedia.org/wiki/Pinkerton\\_National\\_Detective\\_Agency](http://web.archive.org/web/20131023183101/http:/en.wikipedia.org/wiki/Pinkerton_National_Detective_Agency \"http://en.wikipedia.org/wiki/Pinkerton\\_National\\_Detective\\_Agency\")\n\n[edit]: And for the record, I frequently see American English words used on the internet that are spelled phonetically, and even after notifying the party of such, they tend to ignore it and leave it as it was. Frustrating to me personally since I do know how to spell, if nothing else.\n\n"
    },
    {
      "time": "8 Mar 2013 — 11:26am",
      "content": "Visiting [the URL in the address bar](http://web.archive.org/web/20131023183101/http:/www.youtube.com/all_comments?threaded=1&v=EPeoWhWtojA) confirms the text content to be legitimate. What exactly in the image is being questioned as possibly fake?\n\n"
    },
    {
      "time": "8 Mar 2013 — 12:11pm",
      "content": "John, I did notice it was a pretty high-compression JPEG (from the cruddy white-on-gray text on the left) but I'm assuming that can be reproduced reliably enough to be able to reverse-engineer it.\n\nGeorge, thanks for that - interesting.\n\nJustin, some offensive/incriminating (live) content has been removed since the screengrabs were made, and some people are hoping to salvage the reputation of a certain (minor) political aspirant by casting doubt on the authenticity of the screengrabs. My image above judiciously avoids the offending passage.\n\nThe more interesting aspect of this story BTW is that apparently this person's YouTube account was an anonymous one when the alleged offensive comments were made, but some time after Google acquired YouTube he decided to link the two accounts... not realizing that would cause all his old YouTube comments to get a real name! :-/ I wonder if somebody will sue somebody for that \"privacy violation\". Check that: I wonder _when_ somebody will sue somebody for that \"privacy violation\". I personally don't think anonymous people should have privacy rights - that's like eating your cake and having it too.\n\nSo the moral of the story might be: Don't make anonymous comments - it's better to face the consequences of your desire to express your controversial opinions immediately... Or an even a better one: Don't run for public office because even if you did nothing wrong Democracy will make you pay.\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 12:36pm",
      "content": "Hrant: _I personally don't think anonymous people should have privacy rights - that's like eating your cake and having it too._\n\nUh, no. It's like taking proactive steps to be private. Are you saying that a right to freedom of movement should only be had by people who don't move?\n\nNow, I happen to think that being anonymous on, say, Typophile, is lame, but there are plenty of places in the world in which anonymity or pseuodonymity is a matter of personal safety, and is a necessity in part because privacy rights are abused or denied. And as the Google/YouTube account linking debacle shows, there may be good reason to be anonymous even in places where you don't think what you say might get you into trouble.\n\n"
    },
    {
      "time": "8 Mar 2013 — 12:44pm",
      "content": "I think I was unclear: what I meant is you shouldn't be able to sue somebody for violating your privacy for finding out who was behind your anonymous comment. Anonymity is indeed a valuable part of society sometimes. Lawyers, more rarely. :-)\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 12:52pm",
      "content": "Well if it helps, here's a screen grab from the latest Firefox on Windows 7. The rendering inside the browser appears pretty much the same. The minor differences in surrounding browser chrome suggest an earlier version of Firefox, which had a default \"Forward\" button and a wider \"New tab\" button.\n\n![Firefox screenshot](http://web.archive.org/web/20131023183101im_/https:/dl.dropbox.com/u/118821/2013-03-08_133759.png)\n\n"
    },
    {
      "time": "8 Mar 2013 — 1:01pm",
      "content": "_The rendering inside the browser appears pretty much the same._\n\nI'm not sure. Your new screenshot is very obviously GDI ClearType. The image Hrant posted has very similar pixel patterns, but completely different colour values. Comparison:\n\nHrant's screenshot:\n\n ![](http://web.archive.org/web/20131023183101im_/http:/typophile.com/files/hrant_4285.png)\n\nGDI ClearType:\n\n ![](http://web.archive.org/web/20131023183101im_/http:/typophile.com/files/GDICT_6110.png)\n\n"
    },
    {
      "time": "8 Mar 2013 — 1:06pm",
      "content": "Justin: Thanks. Let me see if saving that as a JPEG that reproduces the original's white-on-gray text artifacts results in something very close to the black-on-white text. Although maybe I should wait, since:\n\nJohn: Interesting. Does this affect the evaluation of its authenticity?\n\nOne assumption I'm making is -if it _is_ a doctored screengrab- they used Photoshop, which produces very different text rendering. On the other hand it's pretty easy to change the original HTML and get a bona fide Firefox rendering of fake _content..._\n\nI realize this stuff might be pretty hopeless - I just have to try for a friend.\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 2:48pm",
      "content": "> I'm not sure. Your new screenshot is very obviously GDI ClearType. The image Hrant posted has very similar pixel patterns, but completely different colour values.\n\nRight, by \"pretty much the same\" I meant the pixel patterns and glyph widths/alignment. I would imagine that jpeg compression could account for the overall desaturation and other color artifacts.\n\n> On the other hand it's pretty easy to change the original HTML and get a bona fide Firefox rendering of fake _content..._\n\nThat would indeed be the way to go if one were trying to create a fake screenshot of a website. Any site's content can easily be altered right inside the browser using built-in developer tools or extensions like Firebug—no Photoshop required—and result in something indistinguishable from the real thing.\n\n"
    },
    {
      "time": "8 Mar 2013 — 3:02pm",
      "content": "But most people know Photoshop more than HTML. They often carry out shoddy doctoring and can't tell that others can tell.\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2013 — 6:14pm",
      "content": "OK, so when I save out Justin's image with a quality level of 4 in Photoshop (CS) I get something pretty close to my image (and the filesizes are comparable too). The subpixel coloring does indeed get very unsaturated. But -as we said- the HTML text could still have been forged...\n\nhhp\n\n"
    }
  ]
}
