{
  "id": "101215",
  "title": "A Bowl with 2 fish",
  "forum": "Arabic Typography & Type Design",
  "tags": [
    "Arabic Typography & Type Design"
  ],
  "content": "[http://www.maryamsoft.com/](http://web.archive.org/web/20150416031622/http:/www.maryamsoft.com/ \"http://www.maryamsoft.com/\")  \nWhat does it stand for?\n\n",
  "author": "AzizMostafa",
  "time": "8 Mar 2013 — 2:04am",
  "uid": "12550",
  "comments": [
    {
      "time": "8 Mar 2013 — 8:51am",
      "content": "I don't understand your question.\n\nBut looking at that product, I have a question myself: should it be necessary to manually position stuff when OpenType can handle that?\n\nThen there's Decotype of course.\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2013 — 10:50am",
      "content": "I assume he's asking about the meaning of this animated image.\n\n ![](http://web.archive.org/web/20150416031622im_/http:/typophile.com/files/Bowl2Fish_6055.jpg)\n  \n - Herb \n"
    },
    {
      "time": "10 Mar 2013 — 7:53am",
      "content": "A bowl with 2 fish (symbolizing life) is the Herald of Hope + New Beginning to those who celebrate the first day of Spring (last day of Winter) as the beginning of a new year.\n\nBy typographically translating (Happy + Prosperous 1392) into the bowl-shaped letter Qaf and its 2 fish-like dots, MaryamSoft.com is encouraging Font Lovers to get Qalambartar before its price goes higher 2 weeks after 01.01.1392 (Wednesday March 20th).\n\n"
    },
    {
      "time": "10 Mar 2013 — 7:55am",
      "content": "Funny, at my house a bowl with two fish means two dead fish in two days. :-/\n\nBTW the timing of your post with respect to Western astrology is interesting!\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2013 — 9:33pm",
      "content": "\\> Funny, at my house a bowl with two fish means two dead fish in two days.\n\n... and what does a bowl with a single fish means? Live single successfully?!  \n [http://www.7seen.com/seen1392/seen10-fish-1392.php](http://web.archive.org/web/20150416031622/http:/www.7seen.com/seen1392/seen10-fish-1392.php \"http://www.7seen.com/seen1392/seen10-fish-1392.php\")  \n... and what does the aquarium of fish mean at a Japanese house? Hiroshima?!\n\n"
    },
    {
      "time": "10 Mar 2013 — 9:47pm",
      "content": "A bowl with a single fish means one dead fish in two days. Keeping fish in a bowl is like keeping a human in a ziploc bag.\n\nWe actually kept a number of goldfish alive for 4-5 years (first in a backyard stream/bog system and then in an aquarium) but with all the elaborate equipment & materials and the constant monitoring I felt like a nurse at a retirement home.\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2013 — 10:17pm",
      "content": "\\> We actually kept a number of goldfish alive for 4-5 years?!  \n\\> ... I felt like a nurse at a retirement home.\n\nThat's a lesson for All policy makers?! By the way:\n\nHave you not regarded him who argued with Abraham about his Lord, because God had given him kingdom? When Abraham said, My Lord is He who gives life and brings death, he replied, I [too] give life and bring death. Abraham said, Indeed God brings the sun from the east; now you bring it from the west. Thereat the faithless one was dumbfounded. And God does not guide the wrongdoing lot.\n\n"
    },
    {
      "time": "10 Mar 2013 — 10:23pm",
      "content": "You lost me.\n\nIf it matters: my favorite kind of fish is sushi.\n\nhhp\n\n"
    },
    {
      "time": "12 Mar 2013 — 12:22am",
      "content": "\\> my favorite kind of fish is sushi.\n\nO that kind of fish makes a man feeling like (a nurse at a retirement home) run as if he were a terrified zebra fleeing from a lion?!\n\n"
    },
    {
      "time": "12 Mar 2013 — 6:27am",
      "content": "When it's bad, and the lion is the opposite of a toilet, yes.\n\nhhp\n\n"
    },
    {
      "time": "13 Mar 2013 — 12:19am",
      "content": "O that reminds of my prison mate when I was in Taping jail/Malaysia, spending my 6-month sentence for 7 years overstay. One day, thanks to the 7/24 free time there and then, he asked me, Aziz, what is the sweetest time in your life?  \n...  \nWhen my basket ran out of answers, he said, The time when it's bad and one discharges in time!  \nThen, he asked me again, what is the hardest time in your life?  \n...  \nWhen my basket ran out of answers, he said: The time when it's bad, and a long-missed dear friend suddenly appears opposite of a toilet...  \n-  \nAnd I lost my toilet-minded mate twice as I have lost Hrant, admittedly, twice.\n\n"
    }
  ]
}
