{
  "id": "101262",
  "title": "Clarendon for reading",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello, I'm looking for a type that looks similiar Clarendon but with a more humanistic and opened look to it, for printed long reading. Can anyone give me suggestions?  \nThank you.\n\n",
  "author": "XRaphaelX",
  "time": "10 Mar 2013 — 7:47am",
  "uid": "209703",
  "comments": [
    {
      "time": "10 Mar 2013 — 8:34am",
      "content": "Sentinel\n\nI have a fondness for Clarendon's as they were used commonly in Scotland along with Helvetica in the early 1970s, and I associate them with happy times climbing around mountains there. I also have a pocket Oxford English Dictionary from 1939 that I really like - which is all in Clarendon. It may not be the most readable but is a lot better looking than the ugly Parable font. The problem is, I don't really know when Clarendon's are useful. I think they are better in advertising than for prolonged reading. I don't think they are as popular as they were in a more industrial time, and polishing up Clarendon may defeat that industrial look.\n\n"
    },
    {
      "time": "10 Mar 2013 — 9:57am",
      "content": "From the Sentinel blurb: \"[Clarendons are] tough to use — out of the question for setting text — because they lack italics.\"\n\n1) Some Clarendons do have Italics. Just because the first ones didn't doesn't set that in stone. There's nothing \"anti-Italic\" in the Clarendon genre, at least not more than many other genres.  \n2) That sounds very dogmatic. With enough weights one can avoid Italics, which I myself actually find unintelligent. Look at Typo magazine (still?) to see how. It's not that Italics is useless, but saying \"out of the question\" is a bit much.\n\nAnyway, is Sentinel \"humanist\" enough? It looks like just another Clarendon (albeit very complete and polished). That said, I think we need some more parameters, Rafael.\n\nBTW I think Parable is very beautiful in a more important way than mere looks: reading. To me Pretty has little place there.\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2013 — 8:49am",
      "content": "It works best in unreadable sizes. Note the proportions of the \"a\" and \"e\" and ascenders:  \n [![Parable photo Parable_zps1415a618.jpg](http://web.archive.org/web/20150414153801im_/http:/i1297.photobucket.com/albums/ag36/IsleofGough/Parable_zps1415a618.jpg)](http://web.archive.org/web/20150414153801/http:/s1297.beta.photobucket.com/user/IsleofGough/media/Parable_zps1415a618.jpg.html)\n\n"
    },
    {
      "time": "10 Mar 2013 — 8:54am",
      "content": "I know that I've seen Bibles typeset in typefaces of the Clarendon type for high legibility.\n\n"
    },
    {
      "time": "10 Mar 2013 — 8:57am",
      "content": "Yes, thank you, I'll add it to my research.  \nWell, I'm aiming at Clarendon, because it was a type common in the prints of time and space of the book I'm working on, (1850s in Rio de Janeiro). And I figured it would give the feeling of that time. Main topics of the story is slavery, humanism, family and liberty, so I was looking for a slightly more open/free look. But it's like you said, it can lose the whole Clarendon look.  \nThe Sentinel and Clarendon's light weight are good for what I want, if you can name others that you think to fit better the topics, I thank you.\n\n"
    },
    {
      "time": "10 Mar 2013 — 9:57am",
      "content": "People sometimes need to set small text, and strange things happen down there (like you need a truly horsey x-height). Unlike pretty fonts that necessarily wilt away, Parable can deliver in such conditions.\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2013 — 9:37am",
      "content": "There's an essay online by Mitja Miclavčič which may be of interest, \"Three Chapters in the Development of Clarendon/Ionic Typefaces\".\n\nAlso, I found [this example](http://web.archive.org/web/20150414153801/http:/www.evangelicalbible.com/cambridgecameo.htm) of a typeface of this sort, Medieval Clarendon, used for a Bible.\n\n"
    },
    {
      "time": "10 Mar 2013 — 9:43am",
      "content": "Not Clarendons, but somewhere in the same universe and VERY readable:  \nArcher, H&FJ  \n [http://www.typography.com/fonts/font\\_overview.php?productLineID=100033](http://web.archive.org/web/20150414153801/http:/www.typography.com/fonts/font_overview.php?productLineID=100033 \"http://www.typography.com/fonts/font\\_overview.php?productLineID=100033\")\n\nParry Pro, OurType  \n [https://ourtype.com/#/try/font-info/parry/](http://web.archive.org/web/20150414153801/https:/ourtype.com/#/try/font-info/parry/ \"https://ourtype.com/#/try/font-info/parry/\")\n\n"
    },
    {
      "time": "10 Mar 2013 — 9:58am",
      "content": "Archer is indeed very texty for a slab, thanks in large part to its modest x-height. Because of that it doesn't work ideally for smaller text (plus I'm personally not a big fan of its Italic) so for such use I'm tempted to shamelessly plug something I had a hand in: [http://ernestinefont.com/](http://web.archive.org/web/20150414153801/http:/ernestinefont.com/ \"http://ernestinefont.com/\")  \nBut I'm not sure either one of those is what Rafael is looking for.\n\nParry on the other hand might be just the ticket.\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2013 — 11:47am",
      "content": "I really think Parry has that look I was looking for.  \nThanks oobimichael, hrant and all of you for the help.\n\n"
    },
    {
      "time": "10 Mar 2013 — 6:32pm",
      "content": "I should have noted that the PDF I referenced above mentions an obvious example that I overlooked: good old Ionic No. 5 - which illustrates that the use of a Clarendon type face for readability under adverse circumstances is a long-established idea.\n\n"
    },
    {
      "time": "11 Mar 2013 — 3:14am",
      "content": "@quadibloc, or others: is Medieval Clarendon specifically a letterpress type? I cannot find a specific mention of \"Medieval\" Clarendon in digital format... Further, Canada Type's Clarendon Text documentation says that it is excellent for small print (8pt), but relative to other digital offerings of Clarendon, such as Lintotype/Monotype or URW, are these types suitable for small print as is pictured in the Cambridge Bible example (Medieval Clarendon, 8pt)?\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:03am",
      "content": "és mesmo fixe\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:13am",
      "content": "What would be wrong with the good ol’ Bookman?\n\n ![](http://web.archive.org/web/20150414153801im_/http:/typophile.com/files/Eccl_Sm_Bookman_5507.gif)\n  \nOr Cushing, for that matter?\n\n ![](http://web.archive.org/web/20150414153801im_/http:/typophile.com/files/Eccl_Sm_Cushing_5791.gif)\n\n"
    },
    {
      "time": "22 Apr 2014 — 5:46am",
      "content": "I've seen more detailed references to that typeface now; it was used in the Cameo edition of the Bible from the press of the University of Cambridge, and it was called Petit Mediaeval Clarendon 1159. I suspect that the number means it is a Monotype face.\n\nEDIT: I've seen no references to a Monotype Series 1159. However, the Cambridge Bible catalogue does refer to another Bible as being set in Goudy Old Style Bold (the displayed sample doesn't look like it) 441, and that _is_ a Monotype series number.\n\nOther Bibles are set in faces from Miller and Richards, such as their Antique Old Style (the face by Henry Taylor Wyse that was later revived by Alexander Phemister as Bookman) and their Modern Roman No. 2.\n\nEDIT: It was the Fann Street Foundry of Reed and Fox that was the successor to Belsey, so they had the right to the name Clarendon; and I see they used the name Mediaeval for their version of the Phemister Old Style, and, in addition, they had a Mediaeval Egyptian.\n\nSo, although I can't find their later specimen books - or even, at the moment, a reference to indicate what their name was in 1920, if they were still in business - at the moment I am now going to suspect it was from them that Petit Mediaeval Clarendon was obtained.\n\nEDIT: Well, MyFonts tells me that Stephenson Blake took their stuff in 1906, so that settles it.\n\nEDIT: If one leaves off the Petit, the Flinsch typefoundry had a typeface called Mediaeval Clarendon which was designed in 1878 by one W. Kirkwood.\n\nAh, here he is:\n\n[http://luc.devroye.org/fonts-41678.html](http://web.archive.org/web/20150414153801/http:/luc.devroye.org/fonts-41678.html)\n\nand I've seen Windsor in a recent Letraset catalogue.\n\nEDIT: I've seen a showing of a specimen in a magazine about printing. Schmale Mediæval-Clarendon, from Flinsch, is highly condensed, and so it isn't the Petit Mediæval Clarendon used in Cambridge Bibles, which is quite wide.\n\n ![](http://web.archive.org/web/20150414153801im_/http:/typophile.com/files/Kirkwood_4135.jpg)\n\nHowever, there is still hope. Perhaps while Schmale means condensed, Petit doesn't, and is the name for the point size (as illustrated in this image!) used by mistake.\n\nUnlike any other Clarendon I've seen before, it does have one important characteristic of the Bible face in question: a capital J that descends below the line.\n\n"
    },
    {
      "time": "21 Apr 2014 — 4:14am",
      "content": "I do agree with Maxim about Cushing being an option to consider — on the whole it has the right historic feel, if that's what you're aiming at.\n\n"
    },
    {
      "time": "22 Apr 2014 — 7:26am",
      "content": "Incidentally, I think I have finally identified the example that made me think of Clarendons as legibility faces for the Bible.\n\nLanston Monotype 76J, Modern Antique Condensed.\n\n ![](http://web.archive.org/web/20150414153801im_/http:/typophile.com/files/76j_5211.jpg)\n\nThis appears to be the face used in the St. Joseph New Catholic Edition, by the Catholic Book Publishing Co. of New York, in an octavo edition of the Confraternity-Douay version of the Bible published from 1941 to around 1962.\n\n ![](http://web.archive.org/web/20150414153801im_/http:/typophile.com/files/books005_4448.jpg)\n\nBefore being replaced by a different version, the New American Bible (very shortly after the Confraternity version was completed, so it no longer had to rely on the Douay Old Testament) it was used widely in Catholic schools. (Actually, the next common Bible in Catholic schools used the New Testament from the New American Bible with the now-completed Old Testament from the Confraternity version.)\n\nWhat had made me so confident that it was a Lanston Monotype face to persevere till I found it was that the footnotes\n\n ![](http://web.archive.org/web/20150414153801im_/http:/typophile.com/files/books006_5759.jpg)\n\nclearly matched Lanston Monotype's No. 2.\n\nIncidentally, the Cincinnati Type Foundry used the name Modern Antique Condensed for a completely different typeface, which was a Latin (wedge serif) rather than a Clarendon.\n\nIn looking for legible typefaces used in Bibles, I found Lucerna, Veritas, and Lexikon, none of them Clarendons. (The first two were specifically designed for Bible translations; the third, for a dictionary, and later used in Bibles.) Continuing on with the search, I encountered Nimrod - and Minion and Monticello, beautiful typefaces, but, not being designed for super-high values of optical legibility, stowaways in my search results.\n\n<cite>is Medieval Clarendon specifically a letterpress type? I cannot find a specific mention of \"Medieval\" Clarendon in digital format</cite>\n\nI didn't know the answer to that, but now I've found a page,\n\n[http://www.cambridge.org/index.php?cID=81572](http://web.archive.org/web/20150414153801/http:/www.cambridge.org/index.php?cID=81572)\n\nwhich gives me some insight into the matter. The edition of the Bible in question is a photographic reproduction of one printed by letterpress means in 1920. However, it has been retouched to be as sharp and clear as if it were newly typeset.\n\nI had thought the face might be a proprietary digital one, because before I had thought this might be an entirely new edition, even if the style of printing is reminiscent of older Bibles. I think I have seen Bibles in a typeface which much more strongly resembles this particular face than Modern Antique Condensed does.\n\nA search finds several Bibles in this typeface, all from Cambridge. The Cambridge catalog also references one Monotype face, Goudy Old Style Bold 441, and two from Miller and Richards, Modern Number 2 and Old Style Antique. But the names Mediaeval and Clarendon are not used by them - but they are used by the Fann Street Foundry of Reed and Fox.\n\nMonotype New Clarendon and URW++ Volta are interesting light wide Clarendons.\n\nAh, I've found a Clarendon Bible formerly published by Oxford, now brought out by R. L. Allan. And Domine, a Google Web Font with some Clarendon influence.\n\nAh, I've found some references to a typeface called \"Brevier Blackface\".\n\nAlso, I've seen one Bible set in Bookman Old Style, which seems to resemble a traditional legibility face.\n\nEDIT: I have now found this specimen book, from Bauer, which eventually bought Flinsch, online,\n\n[https://archive.org/details/hauptprobeingedr00baue](http://web.archive.org/web/20150414153801/http:/typophile.com/wiki/https%3A/%252Farchive.org/details/hauptprobeingedr00baue)\n\nwhich contains a typeface at least similar to the Mediaeval Clarendon:\n\n ![](http://web.archive.org/web/20150414153801im_/http:/typophile.com/files/bauer_med_5024.jpg)\n\nInterestingly enough, they have Jenson Old Style in that book too, and they call it Elzevir!\n\nHowever, the Petit size (8 Didones) of this face is number 1026; 1159 is a Petit as well, but of Enge Antiqua, a completely different and very condensed face.\n\nThis is a 1938 specimen book, so it is after Flinsch and Bauer merged.\n\nNote that neither the Reed & Fox Mediaeval Egyptian nor their Mediaeval Egyptian No. 2 resembles this.\n\n"
    },
    {
      "time": "9 Dec 2014 — 2:57pm",
      "content": "Lanston Monotype also had a Modern Antique which was not condensed, although it doesn't look that much wider...\n\n ![](http://web.archive.org/web/20150414153801im_/http:/typophile.com/files/26_modantique_4018.jpg)\n\nFor comparison, Modern Antique Condensed from the same source:\n\n ![](http://web.archive.org/web/20150414153801im_/http:/typophile.com/files/76_modantcond-good_4616.jpg)\n\nOne can see that the lower case alphabet doesn't quite span as much of the upper case alphabet in the condensed version, but the difference is subtle.\n\nOf course, the note that the Condensed one uses the C1 case arrangement, and the regular one the C2 case arrangement, means that the metrics are fully specified:\n\nC1:\n\n5) il  \n6) fjt  \n7) I r  \n8) csz  \n9) $ 0123456789 J aegopqvxy  \n10) bdhknu  \n11) FLSZ  \n12) ABCEPTVXY  \n13) RU w  \n14) DGKOQ  \n15) H m  \n18) MW\n\nC2:\n\n6) il  \n7) fj  \n8) I rst  \n9) $ 0123456789 cevxz  \n10) J agoy  \n11) S bdkpq  \n12) EFLPZ hu  \n13) ABCTV  \n14) DNOQRUY w  \n15) HKX  \n18) MW m\n\nIn the book \"The Monotype System\", C1 is described as applying to normal boldfaces, \"those not extended\", and C2 to the extended boldfaces. However, one can change the set width for a condensed or wide face with any matrix-case arrangement, of course.\n\n"
    },
    {
      "time": "9 Dec 2014 — 9:43pm",
      "content": "Sentinel is of course very very good, but I will say it's more an \"Antique\" than a \"Clarendon\", since the serifs are not bracketed.\n\n"
    },
    {
      "time": "2 Feb 2015 — 7:00am",
      "content": "But on the other hand, it has stroke contrast, so it isn't a typical \"Egyptian\".\n\nEDIT: Incidentally, I came across (or rather, was reminded of) a book typeset in Ionic No. 5.\n\nThe book was \"A Guide to Fairy Chess\" by A. S. M. Dickins.\n\nAs the book was originally published in a short print run, I'm thinking the likely cause is that it was simply the only typeface the typesetter chosen had in a small point size - and economy was sought.\n\n"
    }
  ]
}
