{
  "id": "101251",
  "title": "Creating 3D Type",
  "forum": "General Discussions",
  "tags": [
    "3d",
    "General Discussions",
    "typography"
  ],
  "content": "Hello All!  \n This is my first post on Typophile, diggin' the site so far! I came to this  \nsite in search of an answer. I have been using Illustrator and Photoshop  \ntrying to create 3D typography and it seems to not be going in the right  \ndirection. Can anyone tell me what programs were used to create text like  \nthis:\n\n[http://media-cache-ec2.pinterest.com/550x/0c/af/db/0cafdbe637cb6b8af36c6...](http://web.archive.org/web/20150331232350/http:/media-cache-ec2.pinterest.com/550x/0c/af/db/0cafdbe637cb6b8af36c66aadc1d50dd.jpg \"http://media-cache-ec2.pinterest.com/550x/0c/af/db/0cafdbe637cb6b8af36c66aadc1d50dd.jpg\")\n\n[http://media-cache-ec3.pinterest.com/550x/33/14/d4/3314d4d8196f3702fe5b7...](http://web.archive.org/web/20150331232350/http:/media-cache-ec3.pinterest.com/550x/33/14/d4/3314d4d8196f3702fe5b779cd65ead57.jpg \"http://media-cache-ec3.pinterest.com/550x/33/14/d4/3314d4d8196f3702fe5b779cd65ead57.jpg\")\n\nThanks,  \nAbe\n\n",
  "author": "AbeZ",
  "time": "9 Mar 2013 — 3:36pm",
  "uid": "209691",
  "comments": [
    {
      "time": "9 Mar 2013 — 3:48pm",
      "content": "That sort of thing is done with bona fide 3D rendering software, like Maya for example.\n\nCheck out the cool stuff this friend of mine -and fellow Typophile- does:  \n [http://www.flickr.com/photos/whinger/sets/72157630637179352/](http://web.archive.org/web/20150331232350/http:/www.flickr.com/photos/whinger/sets/72157630637179352/ \"http://www.flickr.com/photos/whinger/sets/72157630637179352/\")\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2013 — 3:46pm",
      "content": "That is definitely done in a 3D program and they used a fair amount of ambient occlusion. You can create passable 3D text in Photoshop and Illustrator these days, but it will not have the slightly rounded edges you showed in your examples.\n\n"
    },
    {
      "time": "9 Mar 2013 — 4:16pm",
      "content": "Xara 3D does a pretty credible job, and it's relatively inexpensive.\n\n"
    },
    {
      "time": "9 Mar 2013 — 4:30pm",
      "content": "thanks hrant! his work is awesome! do you know what he used for this?\n\n[http://www.flickr.com/photos/whinger/7603629918/in/set-72157630637179352/](http://web.archive.org/web/20150331232350/http:/www.flickr.com/photos/whinger/7603629918/in/set-72157630637179352/ \"http://www.flickr.com/photos/whinger/7603629918/in/set-72157630637179352/\")\n\n"
    },
    {
      "time": "9 Mar 2013 — 4:32pm",
      "content": "Yea IsleofGough I hear ya, I'm pretty well versed in Illustrator and Photoshop, but I really want to get into  \ndoing more experimental 3D rendered type. Seems like all these programs are quite pricey though (and I'm still in college) I'll have check out this Xara program for sure!\n\n"
    },
    {
      "time": "9 Mar 2013 — 4:54pm",
      "content": "About 30 seconds in Cinema 4D:\n\n ![](http://web.archive.org/web/20150331232350im_/http:/typophile.com/files/Albertina_3573.jpg)\n  \nIn your second example, again, any 3D program would work. In C4D, one would use Mograph. From his comments, I would guess he used C4D and a step effector. (you can use Google and see what that does on youtube.\n\nBTW, Maya, Softimage, and 3Ds max are free for educational use. Blender is free even if you are not in school. I have used them all, but prefer C4D as I do most of my work on a Mac, and it is the most stable on OSX.\n\n"
    },
    {
      "time": "9 Mar 2013 — 5:05pm",
      "content": "I used to use Lightwave before it was called Lightwave. But that was a lightyear ago. :-)\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2013 — 5:25pm",
      "content": "You are showing your age. FWIW, pretty much all the 3D programs will create equivalent output for this sort of thing (Autodesk programs, Modo, Lightwave, Houdini, Xara, and so on). If you learn the techniques in one, the ability to learn another is not that hard. It is only on higher end issues where programming is needed or one is dealing with animating millions of objects that there are substantial differences in what one can do. After one learns the theory, it is mostly just figuring out where the commands or menus are to do what one wants.\n\n"
    },
    {
      "time": "9 Mar 2013 — 5:47pm",
      "content": "> ...do you know what he used for this?\n\nC4D (step effector)\n\nn.\n\n"
    },
    {
      "time": "9 Mar 2013 — 8:01pm",
      "content": "IsleofGough is right, that can be done in any 3d program really.\n\nFor my example, I used C4D and render using Vray. As both IsleofGough and 5star said, it's a step effector applied to a cloner — the step effector allows me to change the size of the A, along with rotating it a little with each clone.\n\n"
    },
    {
      "time": "17 Mar 2013 — 9:20am",
      "content": "Nice work and good rendering. That takes some skill and experience. The designs are good and knowing the mechanics of a 3d program does not substitute for that. (Especially good is the \"C\") Trying to do this thing outside of a real 3d program is an exercise in frustration. The only exception is zaxwerks in after effects. The cheats in proanimator are easy and look pretty good.\n\nBtw, for those wanting good enough without learning any 3d, [http://m.youtube.com/watch?v=CvtluKm6P-0](http://web.archive.org/web/20150331232350/http:/m.youtube.com/watch?v=CvtluKm6P-0 \"http://m.youtube.com/watch?v=CvtluKm6P-0\") is not bad. It will not give final gathering, bump, displacements, advanced materials, advanced control of bevels, area lighting, etc, but it is good for a commonly owned program.\n\n"
    }
  ]
}
