{
  "id": "10125",
  "title": "Fonts popular in US during '40s, early '50s",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hello,   \nanyone know the typefaces typicaly used in the US during 1944-52? (particularly for print-use)   \nand/or good typographic designers at this time in the US.   \nthanks!\n\n",
  "author": "curious_orange",
  "time": "5 Apr 2005 — 4:01am",
  "uid": "6319",
  "comments": [
    {
      "time": "5 Apr 2005 — 6:43am",
      "content": "Alternate Gothic   \nFranklin Gothic   \nFutura (especially bold and condensed weights)   \nGaramond, Baskerville, Century or Caslon (for text)   \nNews Gothic/Trade Gothic   \nBrush scripts of all kinds (especially in advertising, often done by hand)   \nStymie/Memphis/Beton   \nPoster Bodoni and Onyx   \n   \nRemember, too, that it's not just the type, it's how it's used. A good reference, at least for advertising, is \"All-American Ads: 40s\" published by Taschen.\n\n"
    },
    {
      "time": "5 Apr 2005 — 11:31am",
      "content": "thank you!\n\n"
    },
    {
      "time": "5 Apr 2005 — 12:31pm",
      "content": "Also, regarding faces like Franklin Gothic, Garamond, etc., avoid anything that also has \"ITC\" or \"Adobe\" in the name. Those would be more recent versions, sometimes completely different from what they used in the '40s.\n\n"
    },
    {
      "time": "5 Apr 2005 — 12:34pm",
      "content": "A popular sans serif I forgot to add to the list: Metro.\n\n"
    },
    {
      "time": "5 Apr 2005 — 3:11pm",
      "content": "Stephen, you are an employer's dream. ![:-)](http://web.archive.org/web/20150218044705im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "5 Apr 2005 — 4:04pm",
      "content": "oh what about poor little Lightline Gothic ( the brother of News Gothic and Franklin Gothic) death to ITC Franklin Gothic..and Impostor\n\n"
    },
    {
      "time": "5 Apr 2005 — 4:15pm",
      "content": "Bradbury Thompson art directed Mademoiselle in this post-war era. He combined modernist layouts with classical Didone types. Alexi Brodovitch (Vogue) and Paul Rand were also fond of their didones at that time.   \n   \n   \nThe Onyx/Bodoni Ultra thing that Mark mentioned was peculiar to that era, and Bodoni was also used as text, and Bank Script to complete a very stiff, formal look.   \n   \nCipe Pineles art directed Seventeen magazine with the same ultra smart look. So, even though the layouts were very modern, the type was super-traditional, refined.   \n   \n [http://www.d.umn.edu/~jkmetz/GDH/04-17-01\\_4.html](http://web.archive.org/web/20150218044705/http:/www.d.umn.edu/~jkmetz/GDH/04-17-01_4.html)\n\n"
    },
    {
      "time": "5 Apr 2005 — 7:59pm",
      "content": "Please remember that in this time frame \"type\" refers to 72pt and more likely 48pt and below. Everything in else in display was hand rendered.\n\n"
    },
    {
      "time": "5 Apr 2005 — 8:49pm",
      "content": "What about the typefaces designed by Goudy, Dwiggins, G.W.Jones and Middleton? Weren't they hot in the 1940s and 1950s? For reference, check _Books and Printing: A Treasury for Typophiles_ (Paul A. Bennett, ed.; Cleveland: World, 1951) where every essay is set in a different typeface.\n\n"
    },
    {
      "time": "5 Apr 2005 — 10:08pm",
      "content": "If you look at _books_ printed in that era, a significant fraction are in Linotype [Baskerville](http://web.archive.org/web/20150218044705/http:/www.myfonts.com/fonts/ef/baskerville/) (I chose the EF cut as being fairly close to the metal versions; many of the other digital versions have vastly higher stroke contrast) or [Caledonia](http://web.archive.org/web/20150218044705/http:/www.myfonts.com/fonts/linotype/caledonia/). Another display font I associate with the era is [Lydian](http://web.archive.org/web/20150218044705/http:/www.myfonts.com/fonts/bitstream/lydian/). Towards the early side of that timeframe, I believe [Bernhard Gothic](http://web.archive.org/web/20150218044705/http:/www.myfonts.com/fonts/spiecegraphics/bernhard-gothic-sg/) was quite popular.\n\n"
    },
    {
      "time": "5 Apr 2005 — 10:35pm",
      "content": "What a bunch of experts we have here. Thank you, Raph, for mentioning Caledonia. Sheesh! In this time period, every other book was printed in Caledonia, and what wasn't, was printed in Granjon. These types are almost unknown to today's cognescenti because they did not have happy transitions either to photo or digital, but they were utter mainstays of the day. So was Electra. And Vinnie, congratulations for reading Types Best Remembered/Best Forgotten, but, as someone who has actually made a Franklin Gothic from the ATF originals, and as someone who has some experience typesetting with ITC Franklin Gothic, I have to say that ITC FG is one of the best implemented digital types there is. For overall quality and fitting, very few sans serifs come close. The design isn't really the important thing here. It's how well it works. This is one of the most functional types in the entire digital universe.\n\n"
    },
    {
      "time": "5 Apr 2005 — 10:57pm",
      "content": "\\> These types are almost unknown to today's   \n\\> cognescenti because they did not have happy   \n\\> transitions either to photo or digital   \n   \nI don't think that's the reason; there's a twist here that one must note: text fonts have less presence in \"conscious memory\" than display fonts\\*. Type that's easy to read (conventional, set small, etc.) is by nature harder to appreciate stylistically; laymen -the main point of our concern, hopefully- can't really tell the difference between Caledonia and Granjon and Times\\*\\*, unless you hold their noses to the page and force them to notice differences. In this way, display fonts are in effect more representative of time periods (at least in the conscious realm).   \n   \n\\* This is also probably why they last longer than display fonts.   \n   \n\\*\\* Also, one would think that newspaper fonts would be even more significant here than book faces - but I think both are secondary.   \n   \nAs for Lightline Gothic, it was designed by MFB too, right?\\* If so, it seems misguided to lay any kind of blame on Franklin Gothic. Plus I can't find any reference to this stuff in the \"Types Best Remembered\" contents list... What page is it on?   \n   \n\\* Unless it was a pre-ATF font that Benton is now erroneously given credit for?   \n   \nhhp\n\n"
    },
    {
      "time": "6 Apr 2005 — 12:29am",
      "content": "Not bad quality but ITC FG has made every student think Franklin Gothic is the family when actually it was the Lightline Gothic (light) News Gothic (regualr) and Franklin Gothic the (Heavy).   \n   \nSo that is why I don't like it because Franklin Gothic was a fat boy not a whole family.\n\n"
    },
    {
      "time": "6 Apr 2005 — 1:00am",
      "content": "Benton's gothics are rarely given the credit they deserve. I consider Franklin Gothic and friends to be the first true modern sans fonts; they were a dramatic improvement over their successors. Gaze upon these scans from the 1912 ATF book in awe: [42-96pt](http://web.archive.org/web/20150218044705/http:/levien.com/type/atf_1912/p0738_sm.jpg), [5-36pt](http://web.archive.org/web/20150218044705/http:/levien.com/type/atf_1912/p0739_sm.jpg)   \n   \nIn particular, I do not consider the fit of the ITC devival [impressive](http://web.archive.org/web/20150218044705/http:/www.myfonts.com/fonts/linotype/itc-franklin-gothic/heavy/testdrive.html?s=newspaper&p=72). (and yes, the myfonts.com test drive _does_ use the kern pair info from the font).\n\n"
    },
    {
      "time": "6 Apr 2005 — 1:03am",
      "content": "\\>So that is why I don't like it because Franklin Gothic was a fat boy not a whole family.   \n   \nOh, well that makes more sense. But two things: has anyone ever really analyzed all these fonts and discerned what the relationships might be? I just give as one example, News Gothic. I did a two weight multiple master for Bitstream of this, rather limited. I think it was regular to bold, and normal to narrow? Don't exactly remember. Anyway, what I noticed at once was that the type was not really a good candidate for interpolation as is easily illustrated as soon as I tried to extrapolate to lighter and heavier or wider or more condensed versions. They all looked horrible, without exception. Extrapolation revealed the extent to which the extreme masters I used were not really compatible designs. But I did not do any historical research. I just used Bitstream's masters - the whole thing had to be done in a couple of weeks. I don't remember if we did an italic. Was the News Gothic bold I used really a bold designed as a companion for NG? Or was it in reality the base weight of Franklin Gothic?   \n   \nNow we come to Franklin Gothic. To what extent is that a unified, rationalized design? To what degree is it interpolable?   \n   \nAnd that brings me to my second point about ITC FG, which is that the condensed and compressed weights are incredibly reliable and useful for tabular material where space is really at a premium. Is there anything to beat these rather late additions to the family for pure functionality?   \n   \nAs so often with ITC fonts, it's the name, rather than the design, that seems to get peoples' dander up. Perhaps if ITC FG had been called something else, people would have nothing but praise for it. Rather like ITC Garamond. If only it hadn't been called Garamond, it might have won endless praise as a superbly designed high x-height oldstyle. It, by the way, \\_has\\_ proven to be rationally enough configured that a successful (and strikingly functional) multiple master was made, apparently without too much compromise of the original design elements, and without too very much technical difficulty. (I think it was the first MM to use an intermediate master, which I think, again, was only used for one letter.) You could do some very nice pseudo-optical scaling with ITC Garamond -- in fact, by manipulating weight and width, you could probably come up with some variants that would be more successful than the rather bogus optical axes Adobe experimented with.   \n   \nRe Martin Majoor: I read that paper with interest, but isn't it striking how much life there is in the old, irrational sans serifs - those based on AG, and those based on NG/FG/LL? They are still going strong a hundred years later, yet after only ten years, nobody ever, ever, ever wants to see Scala again even though it was a breath of the freshest air in the early 90s. Also: Scala may have been the first intentionally designed serif/sans family but Today Sans was the first after metal with different optical sizes. Absolutely the first sans superfamily. (Optical sizes, ligatures, small caps, OS figs, the lot.) Mac McGrew clearly illustrated how useful optical scaling could be in even rather crude sans serifs. Finally, isn't it rather bogus to keep on prattling on about how great it is to have unified sans/serifs in text composition? FG and Scotch have little to do with one another, yet they hold up so well. (Or am I wrong? Majoor makes an interesting case that AG is based on Walbaum, which is a cousin of Scotch; on the other hand, how close is the relation of the American Gothics to AG, obvious letters such as a and g aside?)\n\n"
    },
    {
      "time": "6 Apr 2005 — 1:20am",
      "content": "Finally, nobody mentioned Linotype Janson, very widely used by many publishers in those years. If you want to know what was commonly used in type in the US in those years, the answer is, the best Lino faces because it was cheaper to do Lino than Mono. So the stars were the most functional of the Lino faces which are, presumably, Caledonia, Granjon, Janson, Garamond 3 or whatever it was called, Electra - have I forgotten anything obvious? What is striking, again, is that these faces, the lingua franca of an important era, made unconvincing transitions to digital and aren't any longer widely used. The single typeface of the lot that was successfully revived was Caledonia, and that not in the Lino version, but in Time Caledonia, which Matthew Carter made for Time Magazine, where it is still used. I guess Fairfield came a little too late to be included in this list?   \n   \nOne more thing: Granjon included logotypes to eliminate the clumsy f, but these were very rarely used. Were such logotypes available for other of these popular Lino faces?   \n   \nFinally, Granjon was the original interpolated typeface: optically interpolated by Jones (?) using Garamond on one side and Caslon on the other. It is not an authentic Garamond as Beatrice Warde claimed and a hundred thousand parrots have since chirped. This is clearly documented (and is obvious to anyone who actually looks at the type) in one of MacMurtrie's (?) books. It would seem that it remains the one truly successful interpolation of two typefaces to this day, even though with Font Chameleon, we could accomplish semi-convincing interpolations at the press of a button. Hey, does anyone have Chameleon 2? I seem to have lost my copy.\n\n"
    },
    {
      "time": "6 Apr 2005 — 6:02am",
      "content": "\\>Everything in else in display was hand rendered.   \n   \nBut often, as in Mademoiselle, the large type has the look of letterpress, complete with artefacts.   \nPerhaps a galley was printed as large as possible from metal type, blown up on a stat machine, then cleaned up a bit, but still retaining the \"metal\" quality (as a desirable feature)?\n\n"
    },
    {
      "time": "6 Apr 2005 — 6:02am",
      "content": "\\>Everything in else in display was hand rendered.   \n   \nAnd what of process lettering?\n\n"
    },
    {
      "time": "6 Apr 2005 — 9:30am",
      "content": "I almost included Caledonia in my list, but I was thinking more of typography in advertising and job printing. I would agree that it fits the era in a broader sense, along with the other Linotype book types mentioned.   \n   \nBTW Bill, someone pointed out somewhere here recently that Bitstream's News Gothic is in fact Trade Gothic under an assumed name. Compare the Q's and see for yourself.\n\n"
    },
    {
      "time": "6 Apr 2005 — 11:57am",
      "content": "Wow, is it really true that Bitstream NG is TG? I remember asking Jim Lyles why the Q wasn't what I expected, and I forgot what he said but it didn't have anything to do with TG. Anyway, I changed the Q to what I thought it should be in my NG. Can anyone tell me what type I actually digitized? It's awfully humiliating not to know. Like I said, it was a very hurried affair. My files are in total chaos, but I seem to have found an MM in Win format I can send to anyone who wants it. What I can't find is exactly what we released, because I can't find the Bistream CD. Has anybody rigorously analyzed the differences between LLG, FG, NG, TG?\n\n"
    },
    {
      "time": "6 Apr 2005 — 12:18pm",
      "content": "Here's the thread where it came up:   \n   \n [http://www.typophile.com/forums/messages/30/65007.html](http://web.archive.org/web/20150218044705/http:/www.typophile.com/forums/messages/30/65007.html)\n\n"
    },
    {
      "time": "6 Apr 2005 — 1:07pm",
      "content": "Bill: for God's sake get an ATF specimen book and take a close look at Benton's gothics yourself. News and Franklin gothics are closely related stylistically, but they are not two (interpolable) weights of the same basic skeleton. Trying to force that is one of the mistakes made by the ITC version, in my opinion (it comes out as a relatively narrow 'c', and wide 'a' and 's', while Benton's version is beautifully harmonious). Franklin and News both come in condensed and extra condensed forms, every bit as useful as ITC's. The normal-width gothics also harmonize well with the Alternate Gothic series, which is based on the same fundamental lettershapes but an 'o' which is two vertical stems with rounded joins at the ends, rather than an oval as in the Franklin and News Condensed.   \n   \nYou can get a 1934 ATF book for $10 on abebooks, but the 1912 and 1923 editions are worth the expense.\n\n"
    },
    {
      "time": "6 Apr 2005 — 1:49pm",
      "content": "And there is Benton Sans ...\n\n"
    },
    {
      "time": "6 Apr 2005 — 2:03pm",
      "content": "Benton Sans is from Font Bureau though\n\n"
    },
    {
      "time": "6 Apr 2005 — 2:15pm",
      "content": "How about [Venus](http://web.archive.org/web/20150218044705/http:/www.linotype.com/1582/venus-family.html), [Excelsior](http://web.archive.org/web/20150218044705/http:/www.linotype.com/387/excelsior-family.html), and [Coronna](http://web.archive.org/web/20150218044705/http:/www.linotype.com/292/corona-family.html)?   \n   \nSlipping in right at the end of your timeframe is [Salto](http://web.archive.org/web/20150218044705/http:/www.linotype.com/9475/salto-font.html), probably one of the last typefaces the über-creative Klingspor foundry ever released. It was a popular display face in Germany during its day, but might not have gotten any press in the US before the digital era. (anybody know?)\n\n"
    },
    {
      "time": "6 Apr 2005 — 3:07pm",
      "content": "Excelsior and Coronna would have been used in newspapers in the '40s. I don't think Venus was generally available in the U.S. until the '50s, but was a minor hit when it arrived. Not sure about Salto.\n\n"
    },
    {
      "time": "6 Apr 2005 — 6:07pm",
      "content": "_It was a popular display face in Germany during its day, but might not have gotten any press in the US before the digital era. (anybody know?)_   \n   \nDan, at least in New York City there was a campaign (\n\n"
    },
    {
      "time": "6 Apr 2005 — 7:25pm",
      "content": "\\>Dan, at least in New York City there was a campaign (\n\n"
    },
    {
      "time": "6 Apr 2005 — 9:58pm",
      "content": "Maxim,   \n   \nAlthough it was heavily damaged, the Klingspor foundry survived WWII. It closed down in the 1950s\n\n"
    },
    {
      "time": "6 Apr 2005 — 10:17pm",
      "content": "The revival of the Beetle is in fact quite relevant to the field of type, especially blackletter.   \n [http://news.bbc.co.uk/2/hi/uk\\_news/magazine/3104469.stm](http://web.archive.org/web/20150218044705/http:/news.bbc.co.uk/2/hi/uk_news/magazine/3104469.stm)   \n   \nhhp\n\n"
    },
    {
      "time": "5 Apr 2005 — 1:34pm",
      "content": "Stellar list, Mark. Here are some links:   \n   \n [Alternate Gothic](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=SG.118946.0.0) / [Alpin Gothic](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=C.6541.0.0&)   \n [Futura](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=UR.109843.0.0)   \n [Garamond](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories=1&font_categories_search=font_name_search&searchstr=garamond), [Baskerville](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories=1&font_categories_search=font_name_search&searchstr=baskerville), [Century](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories=1&font_categories_search=font_name_search&searchstr=century), [Caslon](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories=1&font_categories_search=font_name_search&searchstr=caslon)  \n [News Gothic](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=M.103923.0.0) / [Trade Gothic](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=LH.108133.0.0)  \n [Stymie](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=UR.110017.0.0) / [Memphis](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=LH.77.0.0) / [Beton](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=EF.1068.0.0)  \n [Poster Bodoni](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=C.107078.0.0)   \n [Onyx](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=M.196.0.5)   \n [Metrolite](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=LH.108065.0.1), [Metromedium](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=LH.108066.0.1), [Metroblack](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=LH.108064.0.1)   \n   \nI'll add:   \n   \n [Rockwell](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=M.99.0.0)   \n [Kaufmann](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=M.99.0.0)   \n [Balloon](http://web.archive.org/web/20150218044705/http:/www.fontshop.com/showfont.cfm?fid=SG.101897.0.0)\n\n"
    },
    {
      "time": "5 Apr 2005 — 3:17pm",
      "content": "Haha. Whatever I can do to justify Typophile-surfing during my work day.\n\n"
    }
  ]
}
