{
  "id": "101278",
  "title": "Ideas for book body text paired with Proxima Nova",
  "forum": "General Discussions",
  "tags": [
    "body",
    "book",
    "General Discussions",
    "Proxima Nova"
  ],
  "content": "I'm designing a trade paperback: it's approximately 200 pages with the title & headings set in Proxima Nova. The book is non-fiction and about progressive religion/spirituality.\n\nAny ideas of a good body font to use? Something clean, modern, forward-looking and extremely readable. Thanks for your suggestions!\n\n",
  "author": "dan121",
  "time": "11 Mar 2013 — 7:52am",
  "uid": "209723",
  "comments": [
    {
      "time": "11 Mar 2013 — 8:17am",
      "content": "Try [Greta](http://web.archive.org/web/20150405011149/http:/www.typotheque.com/fonts/greta_text) by Typotheque.\n\n"
    },
    {
      "time": "11 Mar 2013 — 8:24am",
      "content": "<cite>about progressive religion/spirituality.</cite>\n\nFor several reasons -- at least, if the religion makes any appeal to one of the core religions -- I prefer something like Iowan Oldstyle. Something that arguably looks both ways. Also prefer a 2-tiered lower-case g, which Proxima doesn't have...\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:22am",
      "content": "Thanks for the suggestions...both good options. I appreciate the Iowen Oldstyle suggestion in relation to the subject matter.\n\nAny one else?? :)\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:32am",
      "content": "Two strikes against Iowan here: you said \"progressive\", something to me a Jenson can't be; chances are his point size isn't low enough to justify the large x-height (although I guess it could be).\n\nI would look to the new child prodigy on the block: Turnip.  \n [http://www.fontbureau.com/fonts/turnip/](http://web.archive.org/web/20150405011149/http:/www.fontbureau.com/fonts/turnip/ \"http://www.fontbureau.com/fonts/turnip/\")  \nAlthough I'm not sure it harmonizes with Proxima Nova.\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:16am",
      "content": "I would second Mr. Ellerton's suggestion for Iowan oldstyle pro, not only because he has a lot of experience and good taste, but because proxima nova has a lot of personality and Iowan OS is quiet and elegantly unobtrusive. I would be careful about two typefaces with too much personality competing. A font without too narrow a vintage would be desirable, especially for prolonged reading.\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:37am",
      "content": "I think Proxima Nova would've been seen as having a lot of personality a decade or two ago - these days I think it's relatively sedate (which can be a good thing as you imply). I guess we need to get a better grasp of what \"progressive\" means here, and how much risk is desirable. To me every typesetting job is an opportunity to contribute something to cultural progress... sometimes covertly. :-)\n\nBTW a good match to Proxima Nova might be Archer (although I'm personally not a big fan of its Italic) or some other serif font where the \"a\" has a bouncy bowl.\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:56am",
      "content": "Interesting discussion regarding the subject matter of the text in relation to the font.  \nHere's some more background: the book is basically an extended case against the status quo in regards to certain religious beliefs. Since it's making a book-length argument, the typography needs to be clear and not distracting. The last thing I'd want is for someone to open it up and think \"wow--that's an odd font\" or even just be left with the feeling that something seems \"off\" in with text as compared with other books. I'm not looking to make a huge statement with the typography...the meaning of the text is doing it well enough. But I would like something that steps beyond the usual choices, that seems fresh and new and maybe even inspiring. And a nod to the past is fine as well. Just because a religious tradition is being questioned doesn't mean that all connections with the past must be severed.\n\n"
    },
    {
      "time": "11 Mar 2013 — 11:10am",
      "content": "> against the status quo\n\nAll aspects of the typography needs to harmonize with this - including the text font. But that doesn't mean it needs to scream \"look at me\" - in fact it almost never should. The thing is, text fonts work \"under the radar\" to make us _feel_ things (as opposed to merely see things). Turnip for example certainly does look idiosyncratic when set/viewed large; but at text sizes that effect recedes and is replaced with a -judiciously- unconventional _texture_ - that's the magic of text fonts. Does it recede enough? I don't know. That depends on a number of things, not least the point size.\n\nTo me the worst thing you can do is give up and just revert to something the Pope would use. (I mean the next one. :-)\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2013 — 11:10am",
      "content": "And Iowan Oldstyle does seem like a very good choice...\n\n"
    },
    {
      "time": "11 Mar 2013 — 12:01pm",
      "content": "Perhaps [Antwerp](http://web.archive.org/web/20150405011149/http:/vllg.com/A2-Type/Antwerp#panel=usage-poster) is a viable alternative for body copy? If you're still open to explore hints of history... it feels quite nice and familiar.\n\n"
    },
    {
      "time": "13 Mar 2013 — 4:41pm",
      "content": ".\n\n"
    },
    {
      "time": "11 Mar 2013 — 12:31pm",
      "content": "I'm curious, what fonts are those? Do remember though: you're a designer, so you suffer from the Bane of Awareness. :-)\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2013 — 1:34pm",
      "content": "There was a mention of Archer a few responses back, and while Archer is certainly a good match for Proxima Nova, it has the penchant off coming off too quaint or overly-friendly if not used in it's proper context. I would tend to look at a few contemporary geometric slabs that are constructed for better readability than their historical counterparts. **Sanchez** by Latinotype: [http://www.latinotype.com/#/gallery-sanchez](http://web.archive.org/web/20150405011149/http:/www.latinotype.com/#/gallery-sanchez) is a slab I have experimented with that pairs fairly well with Proxima Nova, has a warmer personality than a traditional slab, and provides decent readability.\n\nIf you do go decide to try this pairing, I would also suggest you use the alternate lowercase \"a\" in Sanchez (accessible via OpenType) to match Proxima Nova's double story lowercase \"a\" since by default Sanchez uses a single story.\n\nOverall, look into contemporary slabs, including those that lean towards Humanist characteristics if you want a font that is a bit more distinguished from Proxima Nova without straying too far from it's common underlying structure.\n\n"
    },
    {
      "time": "11 Mar 2013 — 1:44pm",
      "content": "> The book is non-fiction and about progressive religion/spirituality\n\nreligion/spirituality both include a bit of fiction :)\n\n"
    },
    {
      "time": "11 Mar 2013 — 2:16pm",
      "content": "Another good \"tough love\" :-) slab is: [http://ernestinefont.com/](http://web.archive.org/web/20150405011149/http:/ernestinefont.com/ \"http://ernestinefont.com/\")  \n(Disclaimer: I had a hand in it.)\n\nhhp\n\n"
    },
    {
      "time": "12 Mar 2013 — 6:29am",
      "content": "Thanks all!\n\n"
    }
  ]
}
