{
  "id": "101234",
  "title": "Desperately need to know this cracked serif font",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "bold",
    "cracked",
    "font",
    "serif",
    "Type ID Board [OLD]"
  ],
  "content": "I'm looking for the font I lost that I used in a design. I'm pretty sure I downloaded or paid for it somewhere but I've lost the file and have been searching online for the font for 17 hours. Please help! I don't know the name. I need it for a couple products I'm making for a client and the deadline is by tomorrow. The font has to match, as I used it as his logo on all his other products. It will be a huge let down if I can't reproduce this for him. Here's my email address: [SpittingImageGraphics@gmail.com](mailto:SpittingImageGraphics@gmail.com)  \nTHANKS FOR ANY HELP OR INFO!\n\n| Attachment | Size |\n| --- | --- |\n| [dj d.jpg](http://web.archive.org/web/20140116142839/http:/typophile.com/files/dj%20d.jpg) | 14.61 KB |\n\n",
  "author": "Randy L D W",
  "time": "8 Mar 2013 — 12:32pm",
  "uid": "209670",
  "comments": [
    {
      "time": "9 Mar 2013 — 6:20pm",
      "content": "ok, i think [Nightmare 5](http://web.archive.org/web/20140116142839/http:/www.dafont.com/nightmare-5.font?text=DJ+DURTY&psize=l) is the one you want, with a great deal of vertical scaling going on.\n\n"
    },
    {
      "time": "12 Mar 2013 — 11:38am",
      "content": "THANK YOU SO MUCH!!! You are 100% correct! How did you come to this conclusion? Luckily my customer decided to change their business name at the last minute to POWERHOUSE ENTERTAINMENT, so I was able to talk him into a different font. I'm still glad that you told me that it was Nightmare 5 because he said he wants to use it in the future and It's just cool.\n\n"
    },
    {
      "time": "12 Mar 2013 — 4:56pm",
      "content": "i just hate unsolved puzzles. kept tracking categories of cracked/corroded etc and looking for telling characteristics. the shape of the D makes it easy to scan through and quickly eliminate possibilities.\n\n"
    }
  ]
}
