{
  "id": "101281",
  "title": "Intriguing design anecdotes",
  "forum": "General Discussions",
  "tags": [
    "Factual",
    "funny",
    "General Discussions",
    "interesting",
    "intriguing",
    "past",
    "present",
    "share stories"
  ],
  "content": "Hello all,\n\nWe are currently gathering research for a compendium of graphic design miscellany. We would greatly appreciate any anecdotes you may know of. The publication will be targeted at designers of all ages as an kind of amusing factual compilation of tales and facts.\n\nExamples include:- John Baskerville insisting on being buried standing upright. In 1820, his body was dug up and used as a sort of local peepshow. The curious could view it for the sum of 6 pence.\n\nWe would be extremely grateful for any contributions, the more entertaining the better!\n\n",
  "author": "Jennifer and Rebecca",
  "time": "11 Mar 2013 — 8:41am",
  "uid": "209724",
  "comments": [
    {
      "time": "11 Mar 2013 — 9:03am",
      "content": "There once was a star constellation named [The Printing Office](http://web.archive.org/web/20140418080720/http:/en.wikipedia.org/wiki/Officina_Typographica).\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:06am",
      "content": "Thankyou!\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:10am",
      "content": "Check out the [Double Crown Club](http://web.archive.org/web/20140418080720/http:/en.wikipedia.org/wiki/Double_Crown_Club). Last I attempted to communicate with them, they were still a bit secretive and elitist.\n\nAlso, contact [Mike Parker](http://web.archive.org/web/20140418080720/http:/www.fontbureau.com/people/MikeParker/) and ask him if he wouldn’t mind telling you his Starling story. Set aside at least 30 mins.\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:12am",
      "content": "Brilliant we'll definitely look into these!\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:31am",
      "content": "Oh, re Starling, I believe Mike intends to publish this himself. Be **very** clear about this.\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:32am",
      "content": "Is this personal, professional, or academic work?\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:36am",
      "content": "Academic, its a final major project for our final year at university\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:38am",
      "content": "Where do you study?\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:39am",
      "content": "Northumbria university in Newcastle\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:47am",
      "content": "Edward Johnston always carried a piece of toast in his shirt pocket so he wouldn't waste time when he felt a wee bit peckish.\n\nFrancesco Griffo was hanged for the murder of his son-in-law.\n\nOtl Aicher died when a car hit his lawn-mowing tractor because he liked to drive into the road to overshoot his field to make the turns so the lines would be straight.\n\nAsk somebody to tell you about Eric Gill...\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:46am",
      "content": "Thanks for that!\n\nWe know enough about Eric Gill to know that he wont be featured!\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:56am",
      "content": "I heard Matthew Carter tell a funny story about buying a bottle of Scotch in an airport duty-free shop.\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:58am",
      "content": "Thankyou!\n\n"
    },
    {
      "time": "11 Mar 2013 — 9:58am",
      "content": "Thankyou!\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:05am",
      "content": "So, you're asking us to write a book for you?\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:12am",
      "content": "We're collecting research, you don't finds things out if your don't ask...\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:17am",
      "content": "Indeed. Just make sure to credit Typophile!\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:19am",
      "content": "We will make to.\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:20am",
      "content": "\\* We will make sure to.\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:33am",
      "content": "Be certain to properly cite Typophile in the references section of your paper. A failure to do so would constitute academic plagiarism. APA 6.0 format:\n\nDean, C. (2013, March 11). Re: Intriguing design anecdotes [Online forum comment]. Retrieved from [http://typophile.com/node/101281](http://web.archive.org/web/20140418080720/http:/typophile.com/node/101281 \"http://typophile.com/node/101281\")\n\nYou will need to do this for **every** comment you reference. Better yet, it would be best to use these comments to help direct you to a primary source (book, journal, something published &c) so you can research it more thoroughly and double check the authenticity of the comment(s). It is highly likely that comments are simply inaccurate. If you track down a primary source, you don’t _have_ to cite Typophile. However, on principle, I would make a statement to the effect of “special thanks to the members of Typophile for assisting in our research.”\n\nPeople can point you in the right direction and save you some Google/library time, but they can’t always be relied upon to provide you with accurate, verifiable information. This is especially relevant to an important final project such as yours. Knowing how to conduct a literature review is a significant portion of being capable to conduct quality research. It is also a significant amount of work. If I had to review a paper, and the bulk of the references were forum comments, I probably wouldn’t mark it as it would be extremely to difficult and time consuming to double check them all. I’d simply pass it back and ask them to provide me with proper references. It’s kind of like passing the buck to other researchers and your professor.\n\nIs this undergraduate or graduate research?\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:29am",
      "content": "Thanks Dean thats really helpful, we will definitely make sure to reference all of our work properly. It's undergraduate research. We're writing and designing a book rather then an academic paper.\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:35am",
      "content": "Depending on the institution, most thesis (including undergrad’s) will be stored in a database that can be accessed by other researchers, so you want to wear your Sunday best, just in case!\n\nOh, and it’s Lastname, First initial.\n\nChris Dean = Dean, C.\n\n"
    },
    {
      "time": "11 Mar 2013 — 10:34am",
      "content": "Thanks for all your help we'll keep that in mind!\n\n"
    },
    {
      "time": "12 Mar 2013 — 3:41am",
      "content": "Anymore for anymore?!\n\n"
    },
    {
      "time": "12 Mar 2013 — 5:45am",
      "content": "if you can track this down, there might be some good stuff\n\n[http://www.amazon.co.uk/Types-Best-Remembered-Forgotten-Observations/dp/...](http://web.archive.org/web/20140418080720/http:/www.amazon.co.uk/Types-Best-Remembered-Forgotten-Observations/dp/1884606008 \"http://www.amazon.co.uk/Types-Best-Remembered-Forgotten-Observations/dp/1884606008\")\n\n"
    },
    {
      "time": "12 Mar 2013 — 6:44am",
      "content": "Brilliant thank you!\n\n"
    },
    {
      "time": "12 Mar 2013 — 9:03am",
      "content": "\\> Dean, C. (2013, March 11). Re: Intriguing design anecdotes  \n\\> [Online forum comment]. Retrieved from [URL]\n\nSince web pages often change or disappear, many editors I work with include the date the URL was last accessed. And if an old document is updated or republished, they check every URL again to confirm the web page is still there.\n\nHowever this practice may vary depending on the style guide the editor is using.\n\n"
    },
    {
      "time": "12 Mar 2013 — 9:07am",
      "content": "BTW there are URL shortcut services that archive the page you link to so if it disappears/changes you don't get stuck (but I think they charge for that). I'm not sure about copyright issues on that, although it would be their problem and not yours.\n\nhhp\n\n"
    },
    {
      "time": "12 Mar 2013 — 9:17am",
      "content": "\\> amusing factual compilation of tales and facts\n\nYou might find more interesting tales from the field of advertising and ad agencies.\n\nFor example, at Ken Segall's blog (he used to design ads for Apple) he talks about the time that Steve Jobs wanted his ad agency to audition comedian Phyllis Diller for an Apple ad, and the less-than-satisfactory result:\n\n[http://kensegall.com/2012/04/steve-jobs-crazy-idea-for-the-crazy-ones/#m...](http://web.archive.org/web/20140418080720/http:/kensegall.com/2012/04/steve-jobs-crazy-idea-for-the-crazy-ones/#more-17662 \"http://kensegall.com/2012/04/steve-jobs-crazy-idea-for-the-crazy-ones/#more-17662\")\n\n"
    },
    {
      "time": "12 Mar 2013 — 9:17am",
      "content": "We'll have a look at that thank you!\n\n"
    },
    {
      "time": "12 Mar 2013 — 9:21am",
      "content": "@Jennifer and Rebecca: Not including what you have been told here, what else have you discovered so far? It would be a shame if the title of your paper ended up being “Things people from Typophile.com told us.” (we promise to cite you properly ;)\n\n@JamesM: “_Since web pages often change or disappear, many editors I work with include the date the URL was last accessed_.”\n\nCan you show me an example? I’m not sure I follow. In the APA example I illustrated, the date the URL was accessed appears directly after my name.\n\n"
    },
    {
      "time": "12 Mar 2013 — 9:30am",
      "content": "\\> URL shortcut services that archive the page\n\nInteresting, I didn't know that. I thought that shortcut sites simply provided a shorter URL to the original page.\n\nAnother option for finding web pages that are gone is the non-profit Internet Archive [http://archive.org/web/web.phps]. It visits sites periodically and archives the pages. You enter a URL and it lists the dates that it has archived versions of that page, and then you can view the archived page.\n\n"
    },
    {
      "time": "12 Mar 2013 — 9:45am",
      "content": "\\> In the APA example I illustrated, the date the URL  \n\\> was accessed appears directly after my name\n\nSorry Chris, I didn't notice that. I'm used to seeing the access dates next to the URL.\n\n\\> Can you show me an example? I’m not sure I follow.\n\nI don't have an example of a discussion group cite, but here's one for a book that was accessed online:\n\nKurland, Philip B., and Ralph Lerner, eds. The Founders’ Constitution. Chicago: University of Chicago Press, 1987. Accessed February 28, 2010. [http://press-pubs.uchicago.edu/founders/](http://web.archive.org/web/20140418080720/http:/press-pubs.uchicago.edu/founders/ \"http://press-pubs.uchicago.edu/founders/\").\n\nLike I said, this probably varies depending on the style guide used, but I see that style used a lot. I supposed the reason is that if the original page is gone, a date might help you locate the appropriate archived version.\n\n"
    },
    {
      "time": "12 Mar 2013 — 11:07am",
      "content": "John Tenniel lost the sight of one eye as a lad in 1840, fencing with his father.  \nAccording to his biographer, Frances Sartzano in Sir John Tenniel (1948).\n\nMany rock and rollers went to art school, but only Freddie Mercury designed an heraldic crest for his band.\n\n"
    },
    {
      "time": "12 Mar 2013 — 11:49am",
      "content": "Hey Nick, do you remember Doug and the Slugs? Doug Bennett (from TO.) did all their early stuff and created visuals for a lot of other bands too. He was a graphic designer turned pop star... and even did the cover art for his first solo lp ...\n\n[http://4.bp.blogspot.com/\\_8nIQOVfvkGI/TAaivm5pQ1I/AAAAAAAADU0/ePpkIWqwUX...](http://web.archive.org/web/20140418080720/http:/4.bp.blogspot.com/_8nIQOVfvkGI/TAaivm5pQ1I/AAAAAAAADU0/ePpkIWqwUXQ/s1600/R-2083514-1263114678.jpeg \"http://4.bp.blogspot.com/\\_8nIQOVfvkGI/TAaivm5pQ1I/AAAAAAAADU0/ePpkIWqwUXQ/s1600/R-2083514-1263114678.jpeg\")\n\n...mixing type and cuttin' tracks.  \nn.\n\n"
    },
    {
      "time": "12 Mar 2013 — 12:45pm",
      "content": "The correspondence between Baskerville and Benjamin Franklin, including the \"Caslon anecdote\" (Franklin tricking an acquaintance into pointing out perceived flaws in Caslon, under the misapprehension that it was Baskerville). This one should be pretty easy to track down.\n\nMichael & Winifred Bixler told me a fascinating story about the origin of the typeface Sachsenwald. They are also a fantastic source of stories, specifically related to Monotype and letterpress.\n\nRead the Book _Type: The Secret History of Letters._ Essentially a compendium of interesting and quirky stories about typography. And of course _Just My Type_ contains a bunch of random type anecdotes, though with a questionable standard of accuracy — check it against another source. Oh, and watch the _Linotype_ film.\n\nI'll be very interested to see your finished project. I really like to use anecdotes in beginning typography workshops to start getting across the idea that typefaces are made by people, and there are stories behind them.\n\n"
    },
    {
      "time": "13 Mar 2013 — 5:55am",
      "content": "Thankyou for those, and also Joshua Langman we will keep you updated!\n\n"
    },
    {
      "time": "13 Mar 2013 — 7:02am",
      "content": "Langman do you have any a contact detail for Michael & Winifred Bixler? I cant seem to get ahold of one?\n\n"
    },
    {
      "time": "13 Mar 2013 — 8:10am",
      "content": "If you Google “Bixler Type” is should be first hit.\n\n"
    },
    {
      "time": "13 Mar 2013 — 8:22am",
      "content": "I found that but the email it says to contact them with doesnt work.\n\n"
    },
    {
      "time": "13 Mar 2013 — 8:32am",
      "content": "Their website lists their number as 315-685-5181. But I wouldn't just call them up and expect them to unexpectedly give you loads of their time, because they're very busy. It might be best to see if they're willing to set aside some time to show you their shop in person, and then you can chat all you want.\n\n"
    },
    {
      "time": "13 Mar 2013 — 8:48am",
      "content": "We live in England so that wont be possible!\n\n"
    },
    {
      "time": "13 Mar 2013 — 8:51am",
      "content": "Ah!\n\nWell, you can (a) call them up anyway, or (b) see if you can find any small letterpress or typefounding shops near you, which might be run by people who have been around a long time and are willing to share their stories.\n\n"
    },
    {
      "time": "13 Mar 2013 — 9:00am",
      "content": "I just got off the phone following a very pleasant conversation with Michael (the telephone number on their website is accurate).\n\nThey have in fact changed their email address and he gave me permission to post it:\n\n[winnie@mwbixler.com](mailto:winnie@mwbixler.com)\n\nHis wife primarily deals with email, and he likes to speak on the phone.\n\n"
    },
    {
      "time": "13 Mar 2013 — 9:16am",
      "content": "Thankyou so much for your help thats brilliant!\n\n"
    },
    {
      "time": "13 Mar 2013 — 9:45am",
      "content": "Well, I wouldn’t call that brilliant research. All I did was make a telephone call. The only reason I did so was to bring to their attention — one professional to another — that their email may not be functioning, and ask for their permission to post it here. A task anyone could have performed. Just remember to be polite. I always begin such conversations with “Hello, my name is… I am calling from… Regarding… Am I catching you at a bad time? Do you have a few minutes to talk?” And end with “Thank you very much for your time \\_say their name\\_ you have been very helpful.”\n\nIf they are too busy to talk, ask if there is another time that is more convenient for them.\n\nHave questions prepared in advance.\n\nMake an effort to keep your conversation \\<15 minutes.\n\n"
    },
    {
      "time": "13 Mar 2013 — 9:38am",
      "content": "Dont worry we will make sure to be very polite.\n\n"
    },
    {
      "time": "13 Mar 2013 — 11:56am",
      "content": "Hey Neil, I only remember Doug and the Slugs vaguely.  \nHe left Toronto before I arrived in 76.  \nThe Toronto bands I recall from the Crash N Burn days were the Diodes, Drastic Measures, Rough Trade, the Dishes, the Poles, Teenage Head (from Hamilton, but close enough) and of course the Viletones.  \n\\*\\*  \nGiven that there has been so much promiscuity between the design and music scene, the only reason Freddie Mercury is “intriguing” in that respect is because he became so famous—I also thought the Queen crest would make a good visual for the compendium, although it’s not really an anecdote.\n\n"
    }
  ]
}
