{
  "id": "10135",
  "title": "Identify the Design/Style",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi, sorry it's not about type but I need some help to identify the style (painting/design) of the crate label. I have seem this style used on the vintage labels and posters, and could anyone please tell me what the style is called? Is there a specail term? Thank you! Howard   \n   \n ![](http://web.archive.org/web/20050516054642im_/http:/www.typophile.com/forums/messages/83/68877.jpg)\n\n",
  "author": "disneylandkid",
  "time": "Tue, 2005-04-05 11:19",
  "uid": "6323",
  "comments": [
    {
      "time": " Tue, 2005-04-05 12:05",
      "content": "I don't know a term for it but it shows the influence of serigraphy and Japanese printmaking. It uses areas of solid color/shading to produce a 3D effect. The pastel colors of the background compared to the darker and more saturated foreground is a standard method of creating perspective. I think I've seen that same mountain in a book of Adobe Illustrator tips (not sure I can find it though).\n\n"
    },
    {
      "time": " Tue, 2005-04-05 12:07",
      "content": "pastel colors .. _are_ a standard method   \n   \nAnd me an editor!\n\n"
    },
    {
      "time": " Tue, 2005-04-05 13:18",
      "content": "I'm not sure what the particular style in your example is called, but I believe it is a typical example of guache painting, quite popular in commercial illustration in the early to mid 20th century. It is a kind of opaque watercolor which dries fairly quickly. This is probably why you usually see lots of flat color.\n\n"
    },
    {
      "time": " Tue, 2005-04-05 13:32",
      "content": "Actually these fruit labels were probably lithographs. But may have been based on original gouache illustrations.   \n   \nSee [here](http://web.archive.org/web/20050516054642/http:/www.scripophily.net/clicherforol.html).   \n   \nI'm also not sure there's a name for the style.\n\n"
    },
    {
      "time": " Tue, 2005-04-05 13:53",
      "content": "We should rename this board to \"Type Identification and General Art Trivia\" ![:-)](http://web.archive.org/web/20050516054642im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n - Lex\n\n"
    },
    {
      "time": " Tue, 2005-04-05 16:44",
      "content": "![:-)](http://web.archive.org/web/20050516054642im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nThanks for everyone's help! And I am going to do some more research now ![:-)](http://web.archive.org/web/20050516054642im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nHoward\n\n"
    },
    {
      "time": " Tue, 2005-04-05 22:22",
      "content": "I would describe that as \"posterization\".   \n   \nA term coined to describe the result of reproducing a con-tone image as set of spot colours.   \n   \nAs Tom mentioned, it certainly was a common technique for screen printers, particularly in the days of paper stencils before photo-emulsion and consistant fine grade polyester mesh.   \n   \nGoogle offers lots of hits.\n\n"
    },
    {
      "time": " Wed, 2005-04-06 04:03",
      "content": "In the old times these labels were done in lithography (drawing on stones...).   \nDutch designer Gielijn Escher (no relation to M.C., as far as I know) has a very extensive collection and is the author of a book about this -- it was privately published in 1976 in the Netherlands by Rosbeek Printers as a 'goodwill publication' and probably unavalaible (I may have it somewhere in storage). Title: The Wonderfull world of American Fruit-Crate-Art\n\n"
    },
    {
      "time": " Wed, 2005-04-06 04:32",
      "content": "Of interest?   \n   \n [www.fruitcratelabels.com](http://web.archive.org/web/20050516054642/http:/www.fruitcratelabels.com/)\n\n"
    },
    {
      "time": " Thu, 2005-04-07 15:48",
      "content": "Thank you for all the information!\n\n"
    }
  ]
}
