{
  "id": "101426",
  "title": "Edvard - the handwriting font of Edvard Munch",
  "forum": "Release",
  "tags": [
    "handwriting",
    "Munch",
    "release",
    "Release"
  ],
  "content": " ![](http://web.archive.org/web/20150415105507im_/http:/typophile.com/files/edvard_flags_200x200_6038.png)\n\nHello everyone!\n\nThis is my new release Edvard:\n\n ![](http://web.archive.org/web/20150415105507im_/http:/typophile.com/files/edvard_heft2_neu_6380.jpg)\n  \n\n ![](http://web.archive.org/web/20150415105507im_/http:/typophile.com/files/edvard_heft5_5325.jpg)\n  \n\n ![](http://web.archive.org/web/20150415105507im_/http:/typophile.com/files/edvard_heft7_4849.jpg)\n\nThis font is based on the handwriting of Norwegian painter Edvard Munch. Using his many letters, drafts, note- and sketchbooks as reference (source: Archive of Edvard Munch's writings), this font characterizes the elegant yet sometimes quite irregular writing style Munch had. To resemble naturalistic writing and remain as authentic as possible, a combination of extended ligatures and alternates has been included, as well as Swash characters (accessible via open-type). Additionally, several of Munch‘s paintings and woodcuts are embedded as extras. Available at [Fontspring](http://web.archive.org/web/20150415105507/http:/www.fontspring.com/fonts/julia-bausenhardt/edvard) and [Myfonts](http://web.archive.org/web/20150415105507/http:/www.myfonts.com/fonts/julia-bausenhardt/edvard).\n\n[More info and pictures on my site](http://web.archive.org/web/20150415105507/http:/juliabausenhardt.de/Edvard)\n\n",
  "author": "Julia.",
  "time": "15 Mar 2013 — 4:36am",
  "uid": "209848",
  "comments": [
    {
      "time": "15 Mar 2013 — 6:15am",
      "content": "Nice work!\n\n"
    },
    {
      "time": "15 Mar 2013 — 11:31am",
      "content": "Well done! Did you plan an alternate lower case |t|?\n\n"
    },
    {
      "time": "15 Mar 2013 — 12:16pm",
      "content": "Thanks!\n\nsim, I included some |t| variations in the ligatures, so with OT ligatures turned on there are 12 or so different lower case t's. Most of them don't feature the cross stroke - it's just the way he wrote and I wanted to preserve that.\n\n"
    },
    {
      "time": "15 Mar 2013 — 2:37pm",
      "content": "Can I ask if you have permission from the Munch heirs? Some of these ‘woodcuts’ are seriously mangled. I was a bit surprised to see your Kafka font, since FF Mister K have gotten so much attention lately. A closer look reveals auto-tracing artifacts, yet they both Edvard and Kafka are much more normalized than the actual handwriting. Can you elaborate on how you made these?\n\n"
    },
    {
      "time": "16 Mar 2013 — 2:30am",
      "content": "Frode, you don't need a permission to digitize a handwriting.  \nAs for the working process, it's not much different than with any other handwritten font, and it's of course a personal decision how much you normalize the curves.\n\n"
    },
    {
      "time": "16 Mar 2013 — 6:57am",
      "content": "I don’t know anything about the legalities, but I would think including his art is worth asking about. As for normalizing: just curious. I don’t necessarily think a particular method is ‘better’.\n\n"
    },
    {
      "time": "16 Mar 2013 — 7:49am",
      "content": "Julia, there are different flavors of permission. A handwriting being a very personal thing, it's worth getting permission to avoid people being upset at you/society.\n\nhhp\n\n"
    },
    {
      "time": "18 Mar 2013 — 8:34am",
      "content": "Well I did of course ask the archive which stores the letters. Otherwise I wouldn't have released this font. With the permission for using the paintings/woodcuts, I wasn't sure who to contact, so I left that in a kind of limbo. But you're right of course, and I will look into it.\n\n"
    }
  ]
}
