{
  "id": "101482",
  "title": "Dutch(?) thick font circa 1973 - help!",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "All the sample I have.\n\n ![](http://web.archive.org/web/20140831050036im_/http:/typophile.com/files/group_sample_4213.jpg)\n\n",
  "author": "idiotcountry",
  "time": "17 Mar 2013 — 4:47pm",
  "uid": "38820",
  "comments": [
    {
      "time": "17 Mar 2013 — 5:01pm",
      "content": "it's not an exact match, but [Pasadena](http://web.archive.org/web/20140831050036/http:/www.fonts.com/font/the-font-company/pasadena/heavy) may be something you can start from.\n\n"
    },
    {
      "time": "18 Mar 2013 — 9:26am",
      "content": "Aside from the uppercase 'G' - I think Pasadena is pretty spot on as long as it would be a more heavy/expanded wieght. Since 'Pasadena' was originally digitized by \"The Font Company\" [http://typophile.com/node/69469](http://web.archive.org/web/20140831050036/http:/typophile.com/node/69469 \"http://typophile.com/node/69469\") I'm guessing the original was a film type and likely not currently owned or administered by anyone?\n\nI wonder if the 'G' was an alternate of the original font, but either not digitized or ? Any advise on what the original non-digital font would be?\n\n"
    },
    {
      "time": "18 Mar 2013 — 9:39am",
      "content": "A film type might not have a legal owner in the US, but it can have one in much of the rest of the world, plus it usually does have a \"moral\" owner anywhere, arguably forever. That thread Jodie linked to looks like a must-read in terms of figuring out who one might ask for permission.\n\nhhp\n\n"
    },
    {
      "time": "18 Mar 2013 — 9:43am",
      "content": "Flip the /A head-to-tail, close up the /O, and…  \n [http://www.myfonts.com/fonts/nicksfonts/mister-bones-nf/](http://web.archive.org/web/20140831050036/http:/www.myfonts.com/fonts/nicksfonts/mister-bones-nf/ \"http://www.myfonts.com/fonts/nicksfonts/mister-bones-nf/\")\n\n"
    },
    {
      "time": "18 Mar 2013 — 3:46pm",
      "content": "Close, but the 'R' is not right on Alpha Midnight or your interpretation. Getting closer to an origin though, particularly if the Alpha Midnight Solotype origin is from a Filmotype (or similar) source.\n\nBTW Hrant, based on the comments that \"The Type Company\" simply closed up shop and effectively abandoned their work, I would not consider paying any of the aforementioned font vendors for a license. I do find it hard to believe that any individual or entity would fully abandon a wealth of digital IP. I'll keep looking for the source.\n\n"
    },
    {
      "time": "18 Mar 2013 — 3:54pm",
      "content": "It might indeed be too much to expect for somebody to track down a disinterested party and say \"_please_ let me pay you!\" :-) but that's still what honor is made of.\n\nhhp\n\n"
    },
    {
      "time": "18 Mar 2013 — 4:37pm",
      "content": "I am not disagreeing with you. I am simply stating that fonts.com and other sellers of (in this example) Pasadena are not paying royalties to anyone but themselves. I see no reason to pay fonts.com - hence my search for the underlying creator of the work.\n\n"
    },
    {
      "time": "18 Mar 2013 — 6:41pm",
      "content": "Good move.\n\nhhp\n\n"
    }
  ]
}
