{
  "id": "101490",
  "title": "Advice on font choice",
  "forum": "General Discussions",
  "tags": [
    "font alternatives",
    "General Discussions"
  ],
  "content": "Hi,\n\nFirst I want to say hello. This is my first post here and I have to admit that I'm actually not at all a pro when it comes to typography, but I have a question where I think input from typophiles would really help me make a design decision.\n\nI am currently developing an iOS toy app. Now, near the end I've let a couple of friends test it and one of my friends' feedback was that he absolutely hated the font I used for my captions. I was using Cochin-BoldItalic until now and personally liked it, But since his feedback was so harsh I'm now unsure about it. A graphics artist friend of mine suggested using a font without serifs, so now I'm thinking about using HelveticaNeue-Light or its italic version. That's also the font I use for normal text.\n\nI've attached an image comparing the three fonts in their typical use cases (in game, selection and about screen). Which one would a typophile prefer? Or maybe I should use a completely different font? I'm trying to limit myself to fonts listed on [http://iosfonts.com/](http://web.archive.org/web/20131018114921/http:/iosfonts.com/ \"http://iosfonts.com/\") because they come built in with the devices (The site is only viewable on a Mac).\n\nI know that taste is really subjective, but maybe my original choice really was very bad from a typography point of view? (Personally I am now tending towards HelveticaNeue-LightItalic.)\n\nThanks for your input,  \nGottfried\n\n| Attachment | Size |\n| --- | --- |\n| [font\\_choice.png](http://web.archive.org/web/20131018114921/http:/typophile.com/files/font_choice.png) | 1.59 MB |\n\n",
  "author": "gottfired",
  "time": "18 Mar 2013 — 5:34am",
  "uid": "209913",
  "comments": [
    {
      "time": "18 Mar 2013 — 5:49am",
      "content": "You can’t do anything wrong with Helvetica. (I bet the friends didn’t like the l/c d in Cochin Italic. It’s _»gewöhnungsbedürftig_«)\n\nYou could also try Avenir Next as a clean grotesk face.\n\nIf you’d like to use an italic serif typeface I’d recommend Georgia Italic.\n\n"
    },
    {
      "time": "18 Mar 2013 — 6:12am",
      "content": "There is nothing 'wrong' with Helvetica, except ... it's such a default choice! So indeed try Avenir (/Next) as well -- I see in your list that iOS has a good range of weights, which can help a lot. You could, for example, use Black or Heavy for those top titles.\n\n"
    },
    {
      "time": "18 Mar 2013 — 6:42am",
      "content": "Helvetica is a multi-faceted disaster. Only the lightest weights are usable, and only at 4 feet high. Especially considering your app seems to be about something emotive (providing more details would be very useful here BTW) you need something more compelling.\n\nAnd/but always remember: you can never satisfy everybody.\n\nhhp\n\n"
    },
    {
      "time": "18 Mar 2013 — 7:05am",
      "content": "Helvetica works much better in print than on screen IMO. It has small apertures which can hamper legibility at small sizes unless you're using a very good quality renderer and/or a high resolution screen.\n\nOut of that list, I dunno... Avenir or Gill Sans might work.\n\n"
    },
    {
      "time": "18 Mar 2013 — 10:48am",
      "content": "Your captions are huge. They are not a major problem regardless, it's a matter of taste/preference.\n\nThe body text in Helvetica is a problem. You could consider Gill Sans or Verdana as good options. Maybe Optima, but it might be a little light.\n\nRenko: “You can’t do anything wrong with Helvetica.”\n\nWell, a lot of people who care about legibility, and are familiar with the research in that area, might disagree.\n\nRenko: “You could also try Avenir Next as a clean grotesk face.”\n\nWell, it would be better than Helvetica. But it’s a geometric sans, not a grotesk sans.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "18 Mar 2013 — 4:43pm",
      "content": "Though I don't know exactly what feel you're going for, I like the Cochin in the screen shots. It's much nicer than the Helvetica, at any rate. If you're going for old-fashioned, elegant, playful, quirky, or magical, your Cochin example suggests all of these things to me. Your Helvetica example doesn't suggest anything other than iOS.\n\n"
    },
    {
      "time": "19 Mar 2013 — 1:07pm",
      "content": "Thanks for all the comments.\n\n@hrant: You're right, I try to make an emotive app. It's hard to describe, I want it to be like a mixture between a toy and a gem. Something to carry around and be soothing. So I try to make it as polished as possible. It should feel like a nice crafted piece of wooden furniture (if you know what I mean). I've got an early teaser trailer here: [http://deltaorange.com/gallery/pocket-nature/](http://web.archive.org/web/20131018114921/http:/deltaorange.com/gallery/pocket-nature/ \"http://deltaorange.com/gallery/pocket-nature/\"). But I made that after only 2 weeks into development, so now it's a lot more advanced. There are fish in the water and you can summon a unicorn, spawn flowers, etc.\n\nThe goal to have it feel like a nice piece of handicraft is also the reason, why font choice seems so important to me. I am using icons now in app from this guy: [http://adamwhitcroft.com/](http://web.archive.org/web/20131018114921/http:/adamwhitcroft.com/ \"http://adamwhitcroft.com/\") And his page also made me aware how font choice can make a very simple web design shine.\n\n@Joshua: Yes, I liked Cochin for exactly those reasons in the beginning, because it felt polished, old fashioned and not as over the top as Zapfino.\n\nMaybe I should do the same as Adam Whitcroft and do serif-font for the text and sans-serif for the captions? This seems to be a quite common choice. Is the reasoning that serifs make a font more readable?\n\nScreen resolution is not a problem since the majority of iOS devices is going to be about 300dpi sooner or later.\n\n"
    },
    {
      "time": "19 Mar 2013 — 1:14pm",
      "content": "If I understand the attached image with choices correctly, you are asking for a font for a title bar, in which case you should seriously consider not just the aesthetics of the in-app experience, but the overall consistency with native iOS look and feel. Case in point - the light Helvetica in the size that you have in screenshots make the UI look like Metro from the Windows Phone.\n\nConsistency of the _device_ experience is FAR more important than a fancy-shmancy evocative feel of a half a dozen letters that stick out like a sort thumb, because they are set in exotic ultra-light cursive or what have you.\n\nIn other words - Helvetica, and in a standard iDevice size. Not because glyph shapes are awesome, but because they make your _iOS_ app look better on the _iOS_.\n\n"
    },
    {
      "time": "19 Mar 2013 — 1:24pm",
      "content": "I don't buy that at all. Looking like a corporate drone is anti-branding.\n\nThe best thing about such an app might exactly be helping people _forget_ it's running on a device by a big, nasty -and emotionless- corporation.\n\nhhp\n\n"
    },
    {
      "time": "19 Mar 2013 — 2:17pm",
      "content": "hrant, let me ask you a leading question :)\n\nDo you have an iPhone?\n\n"
    },
    {
      "time": "19 Mar 2013 — 2:43pm",
      "content": "The gods forbid. But I do have a big-brand phone (Galaxy Note 2) except it doesn't matter, because branding is branding. And an iPhone is just another computer, something I've been using since 1977. And I've never believed a software developer's job is to prop up the particular platform's aesthetics.\n\nAnd here's a better question for you: if he makes an Android version, should it look different or the same?\n\nhhp\n\n"
    },
    {
      "time": "21 Mar 2013 — 7:27am",
      "content": "A number of the fonts on the iOS site are not displaying correctly for me (on a mac).\n\nGeeza looks a better choice to me.\n\n"
    }
  ]
}
