{
  "id": "101456",
  "title": "Old-looking, outlined font.",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "color",
    "looking",
    "old",
    "outlined",
    "script",
    "solid",
    "white",
    "Type ID Board [OLD]"
  ],
  "content": "I've been trying to look for this font for ages.  \nThe first time I saw it was in a title card in an animated series, and I thought that it was custom made, and thus impossible to find on the Internet, but not very long ago, I found it used in a bar's facade, which led me to think that it was a pre-existing font.\n\nThe font was white with a black outline, but the TV version had some kind of \"reflections\". You'll understand better if you look at the image. However, the version I saw in the bar (which I assume is the original font) didn't have them.\n\nThe top image is one of the title cards I first saw the font in, and the bottom part is my own (badly-made, I know) recreation of the original look of the font, without the \"reflections\" seen in the first one, just as I saw it in the bar.\n\nAny ideas? Thanks in advance ^^\n\n| Attachment | Size |\n| --- | --- |\n| [OLD SCRIPT.png](http://web.archive.org/web/20130822231553/http:/typophile.com/files/OLD%20SCRIPT.png) | 265.44 KB |\n\n",
  "author": "Ultimate Hammer Bro",
  "time": "16 Mar 2013 — 4:09am",
  "uid": "209868",
  "comments": [
    {
      "time": "16 Mar 2013 — 7:31am",
      "content": "This looks like a customized version of (Hammer) Uncial, with the addition of the outlining. See [Neue Hammer Unziale](http://web.archive.org/web/20130822231553/http:/www.myfonts.com/fonts/linotype/neue-hammer-unziale/) from Linotype, as one version.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "16 Mar 2013 — 4:03pm",
      "content": "Wow, thanks! It certainly looks like it, even more when I look at number 5, which I also have a sample of.  \nI've looked at [American Uncial (Mecanorma)](http://web.archive.org/web/20130822231553/http:/www.identifont.com/show?BDR), following your suggestions, and I think it must be this one.\n\nSo thanks again for having found it!\n\nDo you know if there is any version of it with the outlining? I know that the reflections were custom-made for TV, but the version I saw in the bar had exactly the same outlining, which isn't just in the outside borders of the font, but also in some inside parts (for example, A or T).\n\n"
    },
    {
      "time": "16 Mar 2013 — 8:19pm",
      "content": "[Kelt Caps Freehand](http://web.archive.org/web/20130822231553/http:/www.dafont.com/kelt-caps-freehand.font?text=EL+CAZADOR+DE+PIRATAS) looks like a match for the TV title, with an added outline/shadow.\n\n"
    },
    {
      "time": "17 Mar 2013 — 3:10am",
      "content": "Official statement: I love you both.\n\nThe only problem there is is that while American Uncial has an international character set, Kelt Caps Freehand does not. I was specifically looking for a Spanish character set (whose only differences with the English one are the ÁÉÍÓÚ, the letter Ñ and the ¿ and ¡ symbols) but I think that with a bit of playing around with the font and having a look at my source material, I'll be able to make them.\n\nAgain, thanks!\n\n"
    }
  ]
}
