{
  "id": "101470",
  "title": "Stile. True Cursive with Style.",
  "forum": "Release",
  "tags": [
    "Cursive",
    "cursives",
    "Italic",
    "italics",
    "true",
    "Release"
  ],
  "content": " ![](http://web.archive.org/web/20150414124245im_/http:/typophile.com/files/font_stile_4765.png)\n\nToday italic fonts are assuming a marginal role in typography and are mainly used for emphasising purposes. Filippo Salmina from FSdesign believes they deserve more and pursuits a personal philosophy in the development of italic fonts.\n\n“Stile”, the new font family, has been developed particularly for being used as copy font. While common italics with an angle of approximately 8 degrees while reading make your eyes quickly exhausted, “Stile” preserves them from fatigue. Due to its moderate inclination it is easily readable, really flexible and universally applicable. The cursive character of “Stile” has more to do with writing-speed than to its (moderate) inclination and is responsible also for its particularly homogenous text colour.\n\n“Stile” is a true cursive and not a simple slanted version of an upright font like for the most part of the font families of the competitors.\n\nA dedicated website has just been set up in order to highlight the potential of italic fonts. Stile and other true cursives are available there free of charge for testing purposes:\n\n[www.italicfonts.com](http://web.archive.org/web/20150414124245/http:/www.italicfonts.com/typophile_index.htm)\n\nBring a personal style into your work, with Stile.\n\n",
  "author": "fs",
  "time": "17 Mar 2013 — 6:50am",
  "uid": "50717",
  "comments": [
    {
      "time": "9 Apr 2013 — 1:23pm",
      "content": "I forgot to mention the 40% introduction discount on the font family \"Stile\".\n\n[www.italicfonts.com](http://web.archive.org/web/20150414124245/http:/www.italicfonts.com/40typophile_index.htm)\n\n"
    },
    {
      "time": "9 Apr 2013 — 2:02pm",
      "content": "I'm curious, what angles do you use?\n\nhhp\n\n"
    }
  ]
}
