{
  "id": "10148",
  "title": "Font suggestions for children's book",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi everyone,   \n   \ni ll be designing/typesetting a 'fairy taleish' Kid's book which is based on hand-drawn illustrations.   \n   \nI'd like some suggestions for suitable fonts (headlines & captions).   \n   \nThanks for your help,   \n   \nSeb\n\n",
  "author": "allaboutseb",
  "time": "Wed, 2005-04-06 04:14",
  "uid": "6119",
  "comments": [
    {
      "time": " Wed, 2005-04-06 06:50",
      "content": "Sebastian why not making the type as unnoticible as possible to allow the illustrations to be the star of your book. Just a nice clean legible (forgetable) serif for the text. And if you want the headlines to be fun I'd look at something from Font Diner or House Industries.\n\n"
    },
    {
      "time": " Wed, 2005-04-06 15:13",
      "content": "Sebastian,   \n   \nSome of the MRF typefaces might fit for this project?   \nHave a look yourself; [http://www.macrhino.com](http://web.archive.org/web/20050515203406/http:/www.macrhino.com/)   \nLet me know if you have any questions?   \n   \nCheers/SH\n\n"
    },
    {
      "time": " Wed, 2005-04-06 15:38",
      "content": "[sassoon](http://web.archive.org/web/20050515203406/http:/www.clubtype.co.uk/sassoon.html) is a font-family designed specially for children reading.   \n   \n- g.\n\n"
    },
    {
      "time": " Wed, 2005-04-06 16:20",
      "content": "I would think that it is important first to see the style of the illustrations, and the space they take up, how the type will fit in, and how much text you have. Also the emotional tone. Is it warm and fuzzy, or scary or funny? Then you could narrow down what would work a lot better.\n\n"
    },
    {
      "time": " Thu, 2005-04-07 03:26",
      "content": "Thanks for all your suggestions and links.   \n   \nVery helpful indeed.   \n   \nI'll post a sample page for some feedback very soon.\n\n"
    },
    {
      "time": " Fri, 2005-04-08 17:02",
      "content": "Sorry to come late to the party. But as a parent can I make a plea. Please consider whether this is (1) a book to be read by children or (2) a book to be read to children. If it is a book to be read to children then remember you are actually setting type for adults to read.   \n   \nIn any event, I have observed that my 6 year old son seems to have very little trouble with \"adult\" letters (two-storey a, hourglass g), and even with script types. He gets puzzled if type is made to run in weird patterns, where it is physically hard to read (e.g., on dark backgrounds), where it is highly condensed. He seems to like large word-spaces, which I suppose makes sense since he definitely reads word-by-word still.   \n   \nWhatever you do please, please, please do not use Bembo Schoolbook. My other pet hate is scribbly looking scripts, which get very monotonous. OK for a little display I suppose, but if people want a short story to look handwritten, could they not try ... writing it by hand?\n\n"
    },
    {
      "time": " Wed, 2005-04-13 05:21",
      "content": "Paul,   \n   \nthanks for sharing your experiences - i appreciate your 'real world' feedback.   \n   \nSeb\n\n"
    },
    {
      "time": " Wed, 2005-04-13 15:56",
      "content": "Could someone still help me finding out this ?   \n [http://www.typophile.com/cgibin/show.pl?83/63692](http://web.archive.org/web/20050515203406/http:/www.typophile.com/cgibin/show.pl?83/63692)   \n   \nTomorrow I'm going at the fair !   \n [http://www.bookfair.bolognafiere.it/Illustratori05/Fiction/images/Kino\\_Akiko.JPG](http://web.archive.org/web/20050515203406/http:/www.bookfair.bolognafiere.it/Illustratori05/Fiction/images/Kino_Akiko.JPG)   \n   \nCiao,   \nAS\n\n"
    }
  ]
}
