{
  "id": "101545",
  "title": "Font for a Sushi Restaurant",
  "forum": "Design",
  "tags": [
    "sushi font logo",
    "Design"
  ],
  "content": "I'm a student making a website for a sushi restaurant, and I'd like some help choosing fonts for the logo and for text.\n\nTo give some background: The restaurant owner said he wanted to use white, green, and orange, \"fresh\" colors that emphasize the freshness of his sushi, and the light atmosphere of his small, hole-in-the-wall restaurant where sunlight pours into a mostly white room with a green/orange/white tiled ceiling.\n\nCompared to other sushi restaurants, his sushi is very creative, and very flavorful; their tagline is \"Rockin' Sushi\". At the same time, he is a very masterful chef who has many years of experience as a head chef in California.\n\n**I want to choose a font to pair with their logo, but I'm having a hard time finding one that will look good on a light color scheme, fit well with his fish symbol, and also give the impression of quality fitting of an experienced chef.**\n\nMost sushi restaurants go for \"brushstroke\" fonts and put them on very dark backgrounds, since they want to convey a traditional and high-class atmosphere, but I don't think that will work too well. At the same time many other fonts look too commercial to be appetizing; Singo Sushi is known around here as a hidden jewel that nobody knows about, yet is of the best quality.\n\nAny suggestions for a font to use on their logo? Should I consider not using the fish symbol?\n\nAttached is their old logo, my rerender of it, and an attempt at combining the symbol with Clarendon/Open Sans.\n\n| Attachment | Size |\n| --- | --- |\n| [Singo current logo.jpg](http://web.archive.org/web/20140720183454/http:/typophile.com/files/Singo%20current%20logo.jpg) | 57.65 KB |\n| [Singo Logo Rerender.png](http://web.archive.org/web/20140720183454/http:/typophile.com/files/Singo%20Logo%20Rerender.png) | 10.08 KB |\n| [Singo Web Comp B.png](http://web.archive.org/web/20140720183454/http:/typophile.com/files/Singo%20Web%20Comp%20B.png) | 1.01 MB |\n\n",
  "author": "Hayang",
  "time": "19 Mar 2013 — 11:54am",
  "uid": "209965",
  "comments": [
    {
      "time": "19 Mar 2013 — 2:33pm",
      "content": "Rockin’ letterforms...  \n [http://www.myfonts.com/fonts/nicksfonts/slugfest-nf/](http://web.archive.org/web/20140720183454/http:/www.myfonts.com/fonts/nicksfonts/slugfest-nf/ \"http://www.myfonts.com/fonts/nicksfonts/slugfest-nf/\")\n\n"
    },
    {
      "time": "19 Mar 2013 — 2:38pm",
      "content": "How secure is the shark's job?\n\nhhp\n\n"
    },
    {
      "time": "19 Mar 2013 — 3:34pm",
      "content": "The owner said he is open to changing the shark symbol, although he likes the feeling it carries, as do I. Singo Sushi has attitude in both flavor and atmosphere. They've been using that logo for about 4 years now.\n\n"
    },
    {
      "time": "19 Mar 2013 — 3:54pm",
      "content": "I for one actually like the idea of a shark. But I'm unsure of the execution; and the particular execution will help determine what font(s) to use.\n\nhhp\n\n"
    },
    {
      "time": "19 Mar 2013 — 10:27pm",
      "content": "I don't know a lot about sushi, but to me the style of the shark drawing seems off. You might want to experiment with versions that retain the attitude but have more of an oriental (if that's the right word) style.\n\n\\> Should I consider not using the fish symbol?\n\nSince they've used it for years, if you decide to eliminate it you might want to phase it out gradually. Maybe use it small for awhile before eliminating it, or take it out of the logo but use it as a graphic element in the menus, etc. Maybe I'm being overcautious but restaurants often operate with very small profit margins and I'd be cautious about totally eliminating a symbol they're associated with.\n\n"
    },
    {
      "time": "20 Mar 2013 — 3:25am",
      "content": "Your description of the colour scheme and modern \"fresh\" approach reminded me of [Marc Newson's Talby design for KDDI](http://web.archive.org/web/20140720183454/http:/www.behance.net/gallery/Talby-by-Marc-Newson-mobile-phone-Interface-design/459087), the only phones that I have ever viewed as desirable (fun) objects. Another aspect of those designs that I like are the simple icons. Perhaps the shark could be subtly updated to clean up and simplify the design and perhaps change the colours to bring it in line with everything else, it seems to me more jaunty than edgy at the moment.\n\n"
    }
  ]
}
