{
  "id": "10150",
  "title": "Typeface to base a brand on?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,   \n   \nI'm looking for a type face for the company I work for. We are a press cuttings agency, which means we provide clients with information and summaries of the coverage they receive in the printed press (whether they're liked, who's writing about them etc.) Our product is naturally quite abstract and we tend to change image frequently. I would like to find a type face to use as a solid foundation to build a complete branding on.   \n   \nI suppose almost everyone wants to look professional and business-like, but in addition I want to convey a sense of honesty, simplicity and accuracy.   \n   \nThe font will have to be comfortable on screen as that's where it will be seen most often (pdfs & website), it will also have to stand up to being faxed (we send out 50-100 faxes a day). Occasionally it may be used in small scale advertising but far less frequently than our everyday use.   \n   \nI envisage use as body type with probably a variety of weights to allow one to be used for display.   \n   \nI like the look of avenir: [http://www.veer.com/products/typedetail.aspx?image=ADT0003224](http://web.archive.org/web/20051111040259/http:/www.veer.com/products/typedetail.aspx?image=ADT0003224) but I'm a little unsure and wondered if anyone favoured an alternative.   \n   \nThe budget doesn't exist yet as I want something to present when I ask my boss for money. If it's not too pricey, I may pay for it myself.   \n   \nI would greatly appreciate suggestions.\n\n",
  "author": "poab",
  "time": "6 April, 2005 - 4:40am",
  "uid": "865",
  "comments": [
    {
      "time": " 6 April, 2005 - 4:53am",
      "content": "_Soo, you like 'Avenir'.._ What about ' [Gotham](http://web.archive.org/web/20051111040259/http:/www.typography.com/catalog/gotham/index.html)', by Tobias Frere Jones and Jesse Ragan.?   \n   \n_( Oh, and there would be ' [Avenir Next](http://web.archive.org/web/20051111040259/http:/www.linotype.com/6-2090-6/avenirnext.html)', as well.. )_\n\n"
    },
    {
      "time": " 6 April, 2005 - 7:07am",
      "content": "I would think that a newspaper headline font would be appropriate. Fontbureau has lots.\n\n"
    },
    {
      "time": " 6 April, 2005 - 7:24am",
      "content": "Mark Simonson's Proxima Sans has some Avenir-like qualities and a nice range of weights.   \n   \n [http://www.ms-studio.com/FontSales/proximasans.html](http://web.archive.org/web/20051111040259/http:/www.ms-studio.com/FontSales/proximasans.html)\n\n"
    },
    {
      "time": " 6 April, 2005 - 8:58am",
      "content": "I want to avoid the newspaper font route, I want a clear distinction between information we're supplying and the information we author. Also, the industry now monitors more than just newspapers so I don't want to date us.   \n   \nI like proxima sans, but I think Gotham may be what I'm looking for.   \n   \nThanks for your suggestions ![:-)](http://web.archive.org/web/20051111040259im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 6 April, 2005 - 3:04pm",
      "content": "Benjie,   \n   \nYou might find some of the typefaces from MAC Rhino Fonts   \ninteresting enough? [http://www.macrhino.com](http://web.archive.org/web/20051111040259/http:/www.macrhino.com/)   \nLet me know if you find anything or have questions?   \n   \nCheers/SH\n\n"
    },
    {
      "time": " 7 April, 2005 - 8:42am",
      "content": "I like the look of a few, but I'm not sure they're appropriate, was there one in particular you thought might work?\n\n"
    },
    {
      "time": " 7 April, 2005 - 9:19am",
      "content": "If you want something that is clearly not newspaper, and has a kind of efficient, tech aura but with some warmth you might look at [Klavika](http://web.archive.org/web/20051111040259/http:/www.processtypefoundry.com/typefaces/klavika/index.html).\n\n"
    },
    {
      "time": " 7 April, 2005 - 9:28am",
      "content": "Benjie,   \n   \nThanks for positive response on some of my typefaces. Well to judge from your first pick (Avenir), I think both Stalemate and Sophisto could do well and meet your requets. Stalemate was made to fit well, both in print and on the web. You might find some limitation in weights, it all depends on the size of this project and graphic profile? Sophisto on the other hand has many weights and addtionla features. Also a set of 5 dingbats and patterns which could be very useful is mastered with cleverness. Pdf-files are availabe for download at the MRF website. Please take a moment and let me know if you ahve further questions.   \n   \nCheers/SH\n\n"
    },
    {
      "time": " 8 April, 2005 - 10:03am",
      "content": "I kinda wish the choices were more limited (make it easier).   \n   \nI can see possibilities wth all the suggestions. Price is likely to come in a bit (because I'll be buying multiple licenses) but I'll stick them all on the shortlist and muse on it over the weekend.   \n   \nThanks for taking the time ![:-)](http://web.archive.org/web/20051111040259im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    }
  ]
}
