{
  "id": "101561",
  "title": "Crown -- Grandchildren are the crown of their grandparents",
  "forum": "Hebrew Typography & Type Design",
  "tags": [
    "Hebrew Typography & Type Design"
  ],
  "content": "For about 30 years, I researched the original design that was imitated and popularized by Mr Eliyahu Koren (may he rest in peace). See [http://en.wikipedia.org/wiki/Eliyahu\\_Koren](http://web.archive.org/web/20150317112138/http:/en.wikipedia.org/wiki/Eliyahu_Koren \"http://en.wikipedia.org/wiki/Eliyahu\\_Koren\") for detail about his life.\n\nKoren (Hebrew: אליהו קורן; July 23, 1907 — February 17, 2001), of the original Koren Publishing House, was a noted Israeli type designer in the fifties and sixties. But he did not produce many original typeface designs. As such, Koren really was not \"a master typographer\", although he definitely was a great type technician. I don't even feel that he was an outstanding graphic artist, the likes of the late wonderful graphic designer, Mr. Tzvi Narkiss, or the late phenomenal Mr. Isamar David. David, and less so, Narkiss, were great Jewish type designers. But the greatest, in my professional view was Mr. Henri Friedlander, who Ifotunate to be taught from.\n\nKoren studied in Nuremberg, Germany. He later immigrated to Palestine in 1933. Koren was employed as the director of the graphics department of Keren Kayemet, the Jewish National Fund, from 1936 to 1957. Please post his works from that period, as I am only familiar with classic Koren typeface, originally long before he was born, and the mediocre design he create for his Jewish prayer book. Each time I see it, I cringe, and can not believe a great person as he created it. Perhaps, Koren is larger than life.\n\nKoren founded Koren Publishers Jerusalem in 1961. His company published the Koren Bible in 1962. \"He published the Koren Siddur in 1981, and various religious texts until his death.\"\n\nKoren really was a poor designer, but an outstanding researcher. Mr. xxx Guttman's version of the reflects brilliance and originality, but Guttman was a humble religious and didn't pursue his greatness in the Israeli courts against the inheritors of the Koren Publishers Jerusalem, Had he acted as Narkiss, and brought a massive suit against KPJ, there would be word today by them to dishonor Guttman's memory.\n\nFor that token, I releasing Kesser(TM) which is a derivative of my older design called Crown. I decided to incorporate Guttman's brilliant innovations in his version of the same design that Koren used as the basis of his cloned design. In addition, Kesser contains other innovations, and is subject to US Copyright (I registered it at the Library of Congress in Washington, signed by the State of Israel in the International Convention (see [http://www.wipo.int/wipolex/en/text.jsp?file\\_id=128063](http://web.archive.org/web/20150317112138/http:/www.wipo.int/wipolex/en/text.jsp?file_id=128063 \"http://www.wipo.int/wipolex/en/text.jsp?file\\_id=128063\")). If there is a lawsuit, I will countersue in US Federal Court in Brooklyn, and cite as a precedence the case of Adobe versus Swifte, which Adobe won, citing my correspondence with the US Copyright Office, which I won.\n\nWhat are the remarkable innovations?\n\n",
  "author": "gohebrew",
  "time": "20 Mar 2013 — 1:58am",
  "uid": "18444",
  "comments": [
    {
      "time": "20 Mar 2013 — 2:34am",
      "content": "Let's look at the letter Aleph of Koren, Guttman's version, and my Kesser.\n\nKoren  \nSee [http://en.wikipedia.org/wiki/Koren\\_Type](http://web.archive.org/web/20150317112138/http:/en.wikipedia.org/wiki/Koren_Type \"http://en.wikipedia.org/wiki/Koren\\_Type\")\n\n ![](http://web.archive.org/web/20150317112138im_/http:/typophile.com/files/aleph_4291.jpg)\n\nGuttman's\n\nSee [http://www.typophile.com/node/76489](http://web.archive.org/web/20150317112138/http:/www.typophile.com/node/76489 \"http://www.typophile.com/node/76489\")\n\n ![](http://web.archive.org/web/20150317112138im_/http:/typophile.com/files/aleph_g_5989.jpg)\n\nThey look alike, right?  \nBut there are some subtle differences between them.\n\nLook at middle diagonal bar.  \nThe top and bottom have very important improvements, which is lacking.\n\nThe top is better curved, with a smoother transition from the curve at the top to the body of the middle stroke. Look at the bottom! The eye gently reaches the bottom, in Guttman's design, but ends abruptly on the top tip of the bottom.\n\nNow, look at the bottom or third lower piece of the aleph.\n\nKoren's ends again poorly, abruptly, and inconsiderate of the viewer's eye. Do you see that?\n\nI decided to incorporate Guttman's great improvements in the lower two strokes, and introduce another advantage in the top stroke as well.\n\n"
    }
  ]
}
