{
  "id": "101570",
  "title": "Moderne Schriften",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "Here is a typeface I have been working on for a couple of weeks and could really use some fresh eyes. It is based on the image below from the book [Scripts: Elegant Lettering from Design's Golden Age](http://web.archive.org/web/20150317224151/http:/observatory.designobserver.com/entry.html?entry=26848) by Louise Fili and Steven Heller.\n\n ![](http://web.archive.org/web/20150317224151im_/http:/typophile.com/files/Scripts-ModerneSchriften_525_4634.jpg)\n  \nNow here is my version  \n\n ![](http://web.archive.org/web/20150317224151im_/http:/typophile.com/files/sample_1_5178.png)\n  \nSample of it used in text  \n\n ![](http://web.archive.org/web/20150317224151im_/http:/typophile.com/files/sample_2_5652.png)\n  \nThanks \n",
  "author": "Michael Wallner",
  "time": "20 Mar 2013 — 12:27pm",
  "uid": "19370",
  "comments": [
    {
      "time": "31 Mar 2013 — 3:01pm",
      "content": "Nice work—although, honestly, I wouldn’t recommend it for text. It’s a nice blend of blackletter forms with Art Deco sensibilities. My only gripes are with the /a and the /d…\n\n"
    },
    {
      "time": "10 Apr 2013 — 5:51am",
      "content": "The choices you made are logical, I have the same problem with the d which seems really weird. But you're far from the model and the caps are too \"obvious\" I don't know... Nice work anyway\n\n"
    },
    {
      "time": "24 May 2013 — 11:59am",
      "content": "I apologize for not replying earlier, but I started a new set of capitals which took much more work than I had expected.\n\nMatthieu, I assume that \"obvious\" meant you didn't like what I had done. Below are the new capitals that I have that I like. They still need a lot of refinement, but I think they are heading in a direction that I really like, and feel that they work well with the lowercase. I thought I would leave the original capitals as the default and place the new one under ss01, or maybe the other way.\n\n ![](http://web.archive.org/web/20150317224151im_/http:/typophile.com/files/ms-alt-caps_5626.png)\n\nHere they are in use.\n\n ![](http://web.archive.org/web/20150317224151im_/http:/typophile.com/files/ms-alt-caps-sample_4219.png)\n\nNick, what is it about the \"a\" that you don't like? I can understand the \"d\", I knew it was an odd shape but I like it for some reason. Here is a redesign of the \"a\" and \"d\", they are much more traditional. For now I have moved the older letters into alternative characters.\n\n ![](http://web.archive.org/web/20150317224151im_/http:/typophile.com/files/ms-alt-a-and-d_3891.png)\n\nFinally here is a [.pdf](http://web.archive.org/web/20150317224151/http:/typefetish.com/downloads/ModerneSchriften-catalog.pdf) to look at everything I have so far. The .pdf shows alternative characters and ligatures that are in the works. I still need to flush them out a bit and expand them to complete the character set.\n\n"
    },
    {
      "time": "28 May 2013 — 12:04pm",
      "content": "It's such a refined work. I like the typeface very much.\n\n"
    },
    {
      "time": "29 May 2013 — 9:20am",
      "content": "Thanks for the comment Frida, is there anything about the typeface you would change or think needs work?\n\n"
    },
    {
      "time": "29 May 2013 — 10:15am",
      "content": "Sorry to be the party pooper here...\n\nI find the original quite charming, but your digital recreation feels somewhat off to me. Blackletter is all about consistency, but your letters point here and there — just look at your {e} and {a} next to each other in \"Breaking\". Your {u} and {n} look like they're joined at the wrong end. The swashes in the capital letters are completely out of character — the font is made to look like glyphs carved into wood. The little geometric details like the \"thumbtack\" on the left side of the capitals feel at odds with the rough chunkiness of the font at large scales. The top of the {d} looks weird. The {D} of your first version of the capitals was illegible.\n\nIn general, the thickness and angles of the \"strokes\" that make up the glyphs look haphazard and often unnaturally spiky, whereas the original respects the \"pen logic\" of blackletter glyph architecture even though the glyphs are build from wedges and rhomboids rather than pen strokes.\n\n"
    },
    {
      "time": "30 May 2013 — 2:06pm",
      "content": "Thanks for your honesty Catharsis.\n\nI do agree with a lot of what you said. I had given myself a deadline to finish the typeface which let to some bad decisions and poor execution. The deadline has been cancelled. The swashes have been scraped, as I agree they really didn't fit with the rest of the letters. I can see where the \"n\" and \"u\" look like they are joined incorrectly, but I have to force myself to see it - that could be because I drew them and know what they are. I added a gap to help clarify the letter forms.\n\n ![](http://web.archive.org/web/20150317224151im_/http:/typophile.com/files/ms-nualt_5666.png)\n\nHere are a few alternative \"D\"s I had laying around. The first one is the original, the middle two are based on the uncial form and the fourth is more of a standard roman.\n\n ![](http://web.archive.org/web/20150317224151im_/http:/typophile.com/files/ms-Dalt_5864.png)\n\nI drew most of the lowercase on a 11x9 grid and I wanted all the points to end at intersections which caused the letters to lose some consistency in stroke width, but I thought that added some charm and character to a very gridded design.\n\nI'll post again when I have more done.\n\nThanks\n\n"
    },
    {
      "time": "30 May 2013 — 3:25pm",
      "content": "Hi Michael,\n\nthe gapped versions of {u} and {n} are certainly more legible. I don't think a gap is absolutely necessary, but the problem with your original version was that the contact on the \"open\" side of the glyphs looked heavier than on the closed side, misleading the eye. Even in your gapped versions, the bottom left foot of the {n} looks heavier than the top right shoulder. Imagine drawing that glyph with a broad-nib pen — you'd have trouble recreating that join on the top right. Now look at the {n} in your source image... that join actually makes sense in \"pen logic\"; you'd simply draw it as a short down-right diagonal stroke continuing straight downwards.\n\nNow, clearly, the original lettering isn't made to look like penwork. It looks more like the glyphic kind of letters intended for cutting into wood or stone — but it still respects pen logic as far as possible in order for the shapes to make \"sense\" as blackletters. I also broke pen logic here and there in my geometric blackletter, [Gryffensee](http://web.archive.org/web/20150317224151/http:/www.myfonts.com/fonts/catharsis-fonts/gryffensee/), especially when it comes to those circular arcs.\n\nThat's also why I found these thumbtack ornaments and concave circular serif bracings a bit jarring. They fit neither the pen nor the carver logic — if anything, they look wrought from metal. If the whole font was like that, no problem... but you mix it with those carved glyphs and the occasional pen stroke, and that's what feels off to me.\n\nEDIT: Oh, and I like that third {D} best. It's just that the glyphic stroke on the top grates with the metallic ornamentation on the sides...\n\n"
    },
    {
      "time": "3 Jun 2013 — 12:00pm",
      "content": "OK, I went through and corrected the \"pen logic\" in the lowercase. I added a new \"a\" and \"d\" design and reworking the \"f\" to be closer to the source \"f\". Using the \"pen logic\" changed the design of the \"k\", which is great because I didn't like the old version. I then lightened the connections of the \"m\" \"n\" and \"u\" at the open end and made the closed end heavier.\n\n ![](http://web.archive.org/web/20150317224151im_/http:/typophile.com/files/ms-modern_4474.jpg)\n\nHere is the new design in a text sample\n\n ![](http://web.archive.org/web/20150317224151im_/http:/typophile.com/files/ms-modern-sample_5866.jpg)\n\nWhile looking at the source image again I realized that I had removed some of the elements that originally attracted me to the letters. Some were removed to prevent it from looking like a rip off and some where removed as I went to a cleaner design. The ascenders and descenders have been redesigned to widen as they ascend or descend. I made the \"f\" and \"c\" closer to the originals and brought the bottom of the \"e\" and \"r\" back.\n\n ![](http://web.archive.org/web/20150317224151im_/http:/typophile.com/files/ms-old-style_6662.jpg)\n\nHere is the new design in a text sample\n\n ![](http://web.archive.org/web/20150317224151im_/http:/typophile.com/files/ms-old-style-sample_3750.jpg)\n\nI really like both versions and plan on making one of them alternatives.\n\nIt is currently called Moderne Schriften, which I don't like. If any one has any name ideas I would love to hear them.\n\n"
    }
  ]
}
