{
  "id": "101520",
  "title": "[GlobalType] A Sneak Preview",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Dear typophile people!\n\nNow, for the first time, you can see something concrete from GlobalType. Here is a first layout consisting out of six POIs (Points Of Interest).\n\nRequirements:\n\n1. GoogleEarth has to be installed in an actual version.\n\n2. The oceanographic map of Marie Tharp and H. C. Berann should be activated. If you don't use it yet, you may find it here:\n\n3. The KMZ file that you can download using the following URL can, after the download, be opened with a double-click. This should open GoogleEarth and imports the GlobalType POIs into the sidebar. This should work with Windows, Macintosh and Linux.\n\nI hope somebody of you may find the time for making expeditions in this collection, telling me your impressions here. Don't care that the text is in German language, you later will find localized versions. Please tell me if you are running into problems.\n\n",
  "author": "Lars Kähler",
  "time": "18 Mar 2013 — 10:21pm",
  "uid": "182905",
  "comments": [
    {
      "time": "18 Mar 2013 — 10:29pm",
      "content": "Sorry, here are the missing links:\n\nThe map of Dr. Tharp and Berann:\n\n[http://www.google.de/gadgets/directory?synd=earth&hl=de&preview=on&cat=terrain\\_elevation&id=896376123364](http://web.archive.org/web/20131018224835/http:/www.google.de/gadgets/directory?synd=earth&hl=de&preview=on&cat=terrain_elevation&id=896376123364)\n\nThe KMZ file of the Sneak Preview:\n\n[http://www.global-type.org/fileadmin/user\\_upload/GoogleEarth/GlobalType.kmz](http://web.archive.org/web/20131018224835/http:/www.global-type.org/fileadmin/user_upload/GoogleEarth/GlobalType.kmz)\n\n"
    },
    {
      "time": "19 Mar 2013 — 8:05am",
      "content": "Mac OS X 10.8.3  \nI get this when trying to open the KMZ file:\n\nFile Error: This file is from a previous version of Google Earth or it is not a Google Earth file.\n\n"
    },
    {
      "time": "20 Mar 2013 — 6:40am",
      "content": "Oops! Please try again, I have downloaded a new copy of GoogleEarth on my machine and I’ve overwritten the KML file.\n\n"
    },
    {
      "time": "20 Mar 2013 — 9:07am",
      "content": "Same result. The file, when double-clicked, opens (or attempts to) in PhotoShop, then displays the error message.\n\n::edit:: Got it to work by dropping the file onto Google Earth app rather than double-clicking.\n\n"
    },
    {
      "time": "22 Mar 2013 — 4:33am",
      "content": "And what is your impression?\n\n"
    }
  ]
}
