{
  "id": "101505",
  "title": "Asian web font equivalents of Helvetica Neue and Baskerville Italic?",
  "forum": "Build",
  "tags": [
    "Baskerville",
    "Chinese",
    "Helvetica",
    "japanese",
    "Korean",
    "webfonts",
    "Build"
  ],
  "content": "I'm an Asian font newbie utterly flummoxed with trying to find appropriate web fonts for a website.\n\nFor western European languages the site will use Helvetica Neue Light, Helvetica Neue Bold and Baskerville Italic.\n\nBut the site will also appear in Mandarin, Cantonese, Japanese and Korean, and I'm trying to find web fonts for those languages that are appropriate equivalents of Helvetica Neue and Baskerville Italic.\n\nGoogling for recommendations has just confused me further. Some people even suggest there's no sense using web fonts for Asian character sets because the file sizes would be impractically large. Others suggest that italic fonts aren't appropriate.\n\nCan anyone help suggest what approach I should take here?\n\nAny advice very much appreciated.\n\n",
  "author": "winterveg",
  "time": "18 Mar 2013 — 10:04am",
  "uid": "209925",
  "comments": [
    {
      "time": "18 Mar 2013 — 10:08am",
      "content": "First, dump Helvetica.\n\nhhp\n\n"
    },
    {
      "time": "18 Mar 2013 — 10:10pm",
      "content": "Mandarin and Cantonese are dialects and do not refer to the written language. For written Chinese there are two forms: traditional and simplified. Simplified Chinese is used only in the PRC.\n\nKorean has fewer characters than there are letters in the English alphabet, so file size wouldn't be an issue there regarding web fonts.\n\nThis site may be useful (turn Google translator on):  \n [http://www.justfont.com](http://web.archive.org/web/20150215223847/http:/www.justfont.com/ \"http://www.justfont.com\")\n\n"
    },
    {
      "time": "19 Mar 2013 — 4:50am",
      "content": "Thanks Dave, that's really helpful. justfont.com looks promising.\n\nI also discovered that fonts.com uses 'dynamic subsetting' to only download the characters you need for the current page, mitigating the problem of large file sizes.\n\n"
    },
    {
      "time": "19 Mar 2013 — 1:00pm",
      "content": "Yes, please take a look at our [Fonts.com Web font service](http://web.archive.org/web/20150215223847/http:/www.fonts.com/web-fonts). It has both the Neue Helvetica and Baskerville web fonts you are looking for. And Fonts.com has an extensive selection of Simplified Chinese and Traditional Chinese web fonts as well (along with many other languages too).\n\nAs you pointed out, the Fonts.com Web font service uses dynamic subsetting for all Chinese, Korean and Japanese fonts. Dynamic subsetting automatically detects and instantly delivers the Web fonts for only the characters that are used, thus dramatically reducing font file size and web font download times. I hope you find this to be a solution that will solve your problem.\n\n"
    }
  ]
}
