{
  "id": "101559",
  "title": "Ancient Talmud",
  "forum": "Hebrew Typography & Type Design",
  "tags": [
    "Hebrew Typography & Type Design"
  ],
  "content": "The ancient Talmud is as old as the Jewish Bible. According one of the greatest thinkers of all times, the Talmud actually corresponds to the Bible, and explains to us the meaning of the very words and innuendos.\n\nMaimonides writes this in the Introduction to his final work, called: משנה תורה, which means a concise review of everything found in the Torah, or Bible.\n\nDuring his generation, Maimonides was cast as a heretic for suggesting that his work could an easy to read summary of the encyclopedic Talmud. Later, all his writings, from medical, philosophical, mathematical, and Talmudic, were recognized until this very day as truthful, unrefutable, and utterly amazing. Few humans that have walked this earth can compare to Maimonides, including, Jesus, Einstein, and contemporary Jewish leaders.\n\nGetting back to the Talmud, the Talmud is consideration the most profound wisdom of the Jewish people, being comprised of the writings and teachings of the most brilliant 1% of Jewish leaders of all times.\n\nEven the very great reconstructionist, reform, conservative, or even modern Orthodox have never made it into the Talmud. They simply are not great and profound enough to fit into the ranks of the Talmud's greatest 'stars'.\n\n",
  "author": "gohebrew",
  "time": "19 Mar 2013 — 9:33pm",
  "uid": "18444",
  "comments": [
    {
      "time": "20 Mar 2013 — 7:30pm",
      "content": "Recently, a new generation of intelligent people, who claim to be scholars (and they truly are scholars in their own eyes,) has risen up and assert that they are experts about the printing of the Romm family Talmud, and the typeface technology that was employed about 200 years ago.\n\nTheir statements are ludicrous, suggesting that they either do not know how to read Hebrew (to be facetious. they are truly great Talmud experts who read the ArtScroll Talmud in English), or never even read the account published in back of the every printing of a complete Romm Talmud or in the beginning of the famous Meorus Talmud.\n\nWhat is source of the ridiculous words? Wikipedia?\n\n"
    },
    {
      "time": "19 Mar 2013 — 11:21pm",
      "content": "The Romm Talmud was an outgrowth of the earlier Shlavita Talmud of the late 18th century, printed in Poland by two brothers, the sons of a very great Chassidic rabbi. It was originally financed by the Baron Gansbourg, himself a reknown Chassidic Jew, and extremely wealthy.\n\nThe Romm family itself were also extremely wealthy, and thought that they did not need any benefactor to produce the first edition of the Talmud.\n\nThe first edition of the Talmud took seven years to produce before the the Romm family went totally bankrupt, and had their dream of producing a Lithuanian Talmud absolutely shattered. The Romm family did not know what to do. The Talmud was not completed, and they became paupers.\n\nThe Romm family then consulted with the sons of the Vilna Gaon and the great Rabbi Akiva Eiger, the Vilna's Gaon's brilliant son-in-law, and Rabbi Chaim Halevy, the Voloziner (not to confused with his grandson, Rabbi Chaim the Beis Levy of Volozhim, later known simply as the Grach). They advised to approach the greatest and richest benefactors, particularly my great-grandfather's great-father, Rabbi Boruch Halevy Zeldovich zatzal, Mr. Horenstein zal, and Rabbi Gurary zatzal, even though they were Lubavitchers and members of the hated Ket, or cult.\n\nGurary paid for the binding, and distribution. Horenstein and others finished paid for the typesetting. And Zeldovich who had a massive wood and paper enterprise sold the Romm family an exclusive contact for all their future paper needs, with a 100 year payment plan. In exchange for a graphic dedication depicting two lions, representing Boruch and his brother Rabbi Dovber Halevy, Zeldovich shipped to the Romm family the best possible paper, representing about 60% of the Romm family's overall cost to produce the Talmud.\n\n"
    },
    {
      "time": "3 Apr 2013 — 4:31pm",
      "content": "would you care to elaborate - what kind of ludicrous statements are being said by the new generation of intelligent people?\n\n"
    },
    {
      "time": "19 May 2013 — 2:17pm",
      "content": "There is a historical account of how the previous Talmud was produced by the Romm family in ~Vilna, Lithuania, during the early 19th century.\n\nThis is published at the end of the 20th volume in the Hebrew language, known appropriately as the \"Acharit Davar\", which means \"The Latter Matter\".\n\nRecently, scholars by their own perception have suggested a fantasy account of these matters which contradicts those which are reported by the children of the publishers themselves in the English language. These so-called scholars assume that their readers do not study the Talmud in its original, not even read Hebrew. As a result, they advance their nonsense as if were a great work of scholarship.\n\nIn my view, these so-called scholars harm both the stature of modern scholarship, and their very intelligent readership.\n\nI think the very first step of true scholarship about the history of the printing of the Talmud in Vilna, Lithuania, is read the writings of the account printed by the Romm family, in the Romm Vilna Talmud.\n\n"
    },
    {
      "time": "25 May 2013 — 4:49pm",
      "content": "_Recently, scholars by their own perception have suggested a fantasy account of these matters which contradicts those which are reported by the children of the publishers themselves in the English language._\n\nIsrael, you have not said either who these scholars are or what it is that they have said that is so wrong or ridiculous. Without citing references to which the rest of us can refer, you give us no way to understand about what you are talking or to what you are objecting. Which is a pity, because it all sounds quite interesting.\n\n"
    },
    {
      "time": "26 May 2013 — 12:20pm",
      "content": "John: \"Israel, you have not said either who these scholars are or what it is that they have said that is so wrong or ridiculous.\"  \n\"Without citing references to which the rest of us can refer, you give us no way to understand about what you are talking or to what you are objecting.\"\n\nOK, I am sorry for being vague.  \nLet me do some due diligence.  \nOK, on the next post, I cite the article.\n\n"
    },
    {
      "time": "26 May 2013 — 4:54pm",
      "content": "[http://www.yivoencyclopedia.org/printarticle.aspx?id=2210](http://web.archive.org/web/20150317094009/http:/www.yivoencyclopedia.org/printarticle.aspx?id=2210 \"http://www.yivoencyclopedia.org/printarticle.aspx?id=2210\")\n\n[http://www.yivoencyclopedia.org/article.aspx/Romm\\_Family](http://web.archive.org/web/20150317094009/http:/www.yivoencyclopedia.org/article.aspx/Romm_Family \"http://www.yivoencyclopedia.org/article.aspx/Romm\\_Family\")\n\nRomm Family\n\nWhen Yosef Re’uven died, his eldest son, David (1825–1860), inherited the business, though the title pages continued to use the phrase “In the Printing Shop of Yosef Re’uven Romm.” In 1858, publication of a new edition of the Talmud was begun by the Shapira family in Zhitomir; a year later, David Romm also began publication of an edition of the Talmud. The Zhitomir edition was completed in 1864; the Romm edition in 1866. Sales of the latter proceeded slowly. After David’s death, his widow, Devorah (d. 1903), began to manage the company, assisted at first by her scholarly father, Yosef Betsal’el Harkavy (d. 1864). The company’s income was divided among Devorah, who received 40 percent, and David’s brothers, Ḥayim Ya‘akov and Menaḥem Gavri’el, who each received 30 percent. (Menaḥem also took over the Russian-language printing business when the Russian authorities demanded the separation of the Russian and Hebrew printing operations, for purposes of taxation and so that the government could more easily control the number of books published.) From 1871, the title pages of books published by the company carried the words “The Printing House of the Widow and the Brothers Romm” (see image at left).\n\nAlexander II rescinded the limitations on Hebrew printing in 1862: in exchange for an annual tax of 20 rubles for every manual printing press, the industry was open to all. (For rapid, steam-driven presses, the price was 120 rubles for a small press, 240 for a large one.) Three former Romm employees thereupon opened their own, rival press in Vilna together with Shemu’el Fuenn. Fuenn wanted to print Haskalah literature, but the production of daily and holiday prayer books—in direct competition with the Romms—proved more lucrative. In response, the Romm house, which was on a firm financial footing, lowered the prices of their books almost to their cost. Thus, the price of the prayer book Korban Mosheh was reduced from 2.5 rubles to 0.5 rubles. Romm also began to print Haskalah books, but these generally had poor sales.\n\nCompetition with rival printers in Vilna, however, did less harm to the Romm firm than an internal rivalry that broke out in 1866 between the brothers and Devorah. Eventually the business was divided among them, and it dwindled considerably in importance. Devorah turned to Feigenzohn in 1867 and asked him to take over management of the firm. He worked to resolve the differences among the owners and simultaneously to overhaul and modernize the technologies and procedures. Feigenzohn introduced stereotype printing, the process by which pages are cast in sheets of lead, making it possible to preserve editions of books and reprint them rapidly if demand arose without having to set the text in type again. He traveled to Berlin to buy the new machinery and hired professionals to operate it. A six-week strike by typesetters, alarmed at the prospect of losing their jobs, was resolved by means of an increase in their salary.\n\nFeigenzohn also worked to overcome the obstacles posed by the censor—at that time, the convertIakov Brafman—by providing him with a regular “salary,” in exchange for which Brafman would examine every book intended for publication before it was printed. Feigenzohn introduced the policy of proofreading material three times to ensure the accuracy of the texts. Books were redesigned to attract buyers, and a policy of acquiring exclusive rights to publication was put in place.\n\nFeigenzohn directed the project of what came to be known as the Vilna Talmud, a production characterized by scrupulous proofreading and the addition of many variant readings and commentaries. At his behest, manuscripts held by various libraries were copied in order to add early, previously unpublished commentaries to the new edition. At the height of its production, more than 100 printers and 14 learned proofreaders were involved in the project.\n\nThere was a substantial response to the appeal for subscribers in the fall of 1879. Demand for the new edition was so great that 22,000 copies of the first volume were sold in the first year (1880). Sales were hindered by pogroms in southern Russia the next year and by fires that damaged the plant and books in the warehouses. A decline in the number of subscribers and sales ensued, but there were still 13,000 subscribers when the final volume was printed in 1886.\n\nMenaḥem Gavri’el transferred management of the Russian-language press to outside administrators in 1901. When the new managers gave printing materials to revolutionaries, the authorities became aware of the practice. Badly frightened, Menaḥem Gavri’el sold the Russian part of the business for a pittance.\n\nAfter Feigenzohn left the printing house in 1888, it had gone into a period of decline, producing just a single new edition, the prayer book Kolbo (1895). Subsequently, Feigenzohn resumed management of the firm in 1903, the year of Devorah’s death. At the time of his return, the printing house held thousands of folio pages of the most important canonical works in stereotype, 15 presses were still in operation, and the firm held the rights to print classics of Jewish literature. What it lacked was capital.\n\nA small investment came from Bentsiyon Aharonovitsh, who financed the printing of several orders of the Mishnah, but more than his assistance was needed. At a meeting of Jewish leaders in Saint Petersburg, the rebbe of the Lubavitch Hasidic movement, Shalom Dov Ber Shneerson, horrified at the prospect of the closure of the Romm house, persuaded Baron David Gintsburg to rescue the shop, and Gintsburg invested 75,000 rubles. Feigenzohn paid the debts of the firm, but additional backing dissolved when Gintsburg died in 1910. World War I caused a further decline in the firm’s fortunes, and it passed into the hands of its creditors, who operated it until 1940. - this needs a proven source because it contradicts many established facts.\n\nThe importance of the Romm press in the cultural history of the nineteenth century cannot be overstated. During its existence, the Romm printing house published more than 1,400 books in both Hebrew and, to a lesser extent, Yiddish, in a variety of literary genres. Books devoted to Kabbalah andhalakhah appeared alongside the novels of Avraham Mapu and the stories of Ayzik Meyer Dik. Romm published Yitsḥak Ber Levinzon’s prolegomenon, Igeret ha-besorah (1824), to his extended program for the reform of Jewry, Te‘udah be-Yisra’el (1827, 1856). ‘Azaryah dei Rossi’s sixteenth-century translation into Hebrew of the Letter of Aristeas (Greek, second century BCE) was printed in 1818 and entitled Haderat zekenim. Translations from world literature into Hebrew and Yiddish soon followed. The first of these was a translation of the journal of a seventeenth-century Dutch traveler to the Far East, W. Bontekoe, into Hebrew, apparently by Menaḥem Mendel Lefin, Oniyah so‘arah (1823), published together with a translation of one of Joachim Heinrich Campe’s works, Masa‘ot ha-yam, byMordekhai Aharon Gintsburg. The latter’s translation of Campe’s Masa‘ Kolumbus was published the same year, but the name of the publisher did not appear on the title page. A year later, Romm published Gintsburg’s Yiddish translation of the same work.\n\nRomm published Sefer ha-berit by Pinḥas Eliyahu Hurwitz (1765–1821) in 1818. This was an idiosyncratic, encyclopedic work combining philosophical and kabbalistic topics with reports on scientific discoveries. It was an important source of scientific information for many readers who knew only Hebrew and Yiddish. Much farther from normative literature was the introduction to algebra,Mosde ḥokhmah by the maskil Ḥayim Zelig Słonimski (1834). Much of the Haskalah literature failed to find a wide market, often remaining unsold.\n\nThe Romm house continued to print rabbinic literature alongside works calling for reform. Several collections of the teachings of Eliyahu, the Gaon of Vilna, were printed as well as a number of editions of Ḥaye adam (1810, 1819, 1834), the popular halakhic work by Avraham Danzig. All this was in addition to canonical works such as the Talmud and the Shulḥan ‘arukh, prayer books, and Pentateuchs.\n\nRomm printed some Yiddish books as well, including Eli‘ezer Paver’s Gdulas Yoysef, which they reprinted several times (1817, 1822, 1833). Tkhines were published in Tikun shelosh mishmarot(1833). A complete list of Romm publications would reflect well the trends and cultural developments of East European Jewry in the nineteenth and early twentieth centuries.\n\n"
    },
    {
      "time": "26 May 2013 — 12:22pm",
      "content": "Suggested Reading  \nSamuel Shraga Feigensohn, “Le-Toldot Defus Rom,” in Yahadut Lita, vol. 1, pp. 268–302 (Tel Aviv, 1960); Bernhard (Ḥayim Dov) Friedberg, Toldot ha-defus ha-‘ivri be-Polanyah (Tel Aviv, 1950), pp. 99, 125–131; Zeev Gries, Ha-Sefer ke-sokhen tarbut ba-shanim 460–660 (1700–1900) (Tel Aviv, 2002), pp. 117–126, 133–134, 179–180, also in English as The Book in the Jewish World, 1700–1900 (Oxford, 2007), pp. 113–123, 129–130, 173; Pinḥas Kahn, “‘Al devar ha-defus shel Rom be-Vilnah,” Kiryat sefer 10 (1933–1934): 249–250; Pinḥas Kahn, “Le-Korot Bet ha-Defus shel Rom be-Vilnah,” Kiryat sefer 12 (1935–1936): 109–115; Ḥayim Lieberman, “‘Al defus ha-‘almanah veha-aḥim Rom,” Kiryat Sefer 34 (1959): 527–528; Raphael Nathan Neta Rabbinovicz, Ma’amar ‘al hadpasat ha-Talmud; Toldot hadpasat ha-Talmud (Jerusalem, 1951/52), pp. 134–135, 156–180, 223–245, 250.\n\nAuthor  \nZeev Gries\n\nTranslation  \nTranslated from Hebrew by Jeffrey Green\n\n"
    },
    {
      "time": "26 May 2013 — 12:34pm",
      "content": "These are important publications:\n\nSamuel Shraga Feigensohn  \n“Le-Toldot Defus Rom,” in Yahadut Lita  \n(Tel Aviv, 1960)  \nvol. 1, pp. 268–302\n\nBernhard (Ḥayim Dov) Friedberg  \nToldot ha-defus ha-‘ivri be-Polanyah  \n(Tel Aviv, 1950)  \npp. 99, 125–131\n\nZeev Gries  \nHa-Sefer ke-sokhen tarbut ba-shanim 460–660 (1700–1900)  \n(Tel Aviv, 2002)  \npp. 117–126, 133–134, 179–180\n\nalso in English as  \nThe Book in the Jewish World, 1700–1900  \n(Oxford, 2007), pp. 113–123, 129–130, 173\n\nPinḥas Kahn  \n“‘Al devar ha-defus shel Rom be-Vilnah,”  \nKiryat sefer 10 (1933–1934): 249–250\n\nPinḥas Kahn  \n“Le-Korot Bet ha-Defus shel Rom be-Vilnah,”  \nKiryat sefer 12 (1935–1936): 109–115;\n\nḤayim Lieberman  \n“‘Al defus ha-‘almanah veha-aḥim Rom,”  \nKiryat Sefer 34 (1959): 527–528;\n\nRaphael Nathan Neta Rabbinovicz,  \nMa’amar ‘al hadpasat ha-Talmud;  \nToldot hadpasat ha-Talmud  \n(Jerusalem, 1951/52)  \npp. 134–135, 156–180, 223–245, 250.\n\n"
    },
    {
      "time": "26 May 2013 — 1:49pm",
      "content": "Please post these articles. Apparently, the sources may be compromised, or I may have misunderstood my own source material, actually printed in Vol. 20 of the Romm Talmud. But why was this important document not cited?\n\n"
    },
    {
      "time": "26 May 2013 — 2:48pm",
      "content": "Note: Many hundreds of different editions of the classic Babylonian Talmud were published over the years since the conclusion of World War II.\n\nThe largest in size is known as the \"Chosen Shas\", named after the very old custom for the father of the bride to gift a large beautiful set as a wedding gift to his new son-in-law. There are many other smaller sets used by yeshiva students, and other adults in their Talmud studies. Not all of these smaller sets have included the \"Acharis Davar\", written by the Romm descendents, cited earlier.\n\nPerhaps, in their jealous research, this important document was neglected by honest error, and not by intentional rewriting of history, as I earlier suspected.\n\nI found most questionable in this information presented as factual is that much of it, if not all of it, is composed and published long after the events occurred. If so, are they not theories and speculations, and not actual facts?\n\n"
    },
    {
      "time": "26 May 2013 — 4:18pm",
      "content": "[http://printingthetalmud.org/essays/10.pdf](http://web.archive.org/web/20150317094009/http:/printingthetalmud.org/essays/10.pdf \"http://printingthetalmud.org/essays/10.pdf\")\n\nThe “Vilna Shas” and East European Jewry  \nby Michael Stanislawski\n\nI N 1880 the first volumes of an extraordinary edition of the Babylonian Talmud were  \npublished in Vilna, the center of rabbinic learning in eastern Europe for almost half a  \nmillenium. Known colloquially as the “Vilna Shas”  \n(the latter term an acronym for shishah sedarim, literally the six orders of the Mishnah, but  \nused since the late-sixteenth century to refer to the entire Talmud),\n\nthis edition, published by the firm  \nof “The Widow and Brothers Romm” and completed in 1886, has been used to this day throughout  \nthe Jewish world as the authoritative, traditional edition of the Talmud and its commentaries.1\n\n1. The most important  \nstudy of the history of the  \npublication of the Talmud,  \nincluding the Slavuta and  \nVilna editions, remains  \nRaphael Rabbinovicz,  \nMaamar al Hadpasat ha-  \nTalmud (Munich, 1877).  \nThis was supplemented  \nby the posthumously published  \nmemoir of the director  \nof the Romm Press, in  \nYahadut Lita (Jerusalem,  \n1960), which also contains  \nthe editor’s bibliographical  \ncitations of other twentieth-  \ncentury studies on the  \nRomm Talmud. Very valuable,  \ntoo, is the entry on  \n“Romm” in the Russian-  \nJewish encyclopedia, Evreiskaia  \nEntsiklopediia (St.  \nPetersburg, n.d.), vol.13, pp.  \n602–603.\n\nThe Vilna Shas followed the classic layout of the printed Talmud, with the text of the Talmud—  \nboth the Mishnah and the Gemara—in the center of the page, and with commentaries running  \ndown the length of both margins. Within these margins and at the back of the volumes of each tractate  \nthere appeared an unprecedented number of rabbinic exegeses, glosses, and interpolations to  \nthe ancient text, ranging in time and place from tenth-century Kairouan, Tunisia, to mid-nineteenthcentury  \nPosen, Germany. Thus, although the Talmud is usually spoken of as having been completed  \n(or “sealed”) in the sixth century, it in fact remained the site of a continuing conversation  \namong Jewish scholars lasting to our very times, most recently aided and abetted  \nby new computer technologies that were inconceivable even a decade ago.2\n\n2. See for example, www.  \ne-daf.com, which allows  \none to access any page of  \nthe Talmud in its original  \nformat, as well as an English  \ntranslation of the page.\n\nThe story of how the Vilna Shas appeared, the controversy surrounding it, and the  \nhistory of the Romm publishing house as a whole, is but one crucial episode in the  \nlong and fascinating history of the printing of the Talmud—a tale full of mystery  \nand intrigue, as well as remarkable scholarship and piety. The inventiveness and  \ningenuity of the fifteenth-century German Catholic Johann Gutenberg and his successors  \nmade possible a reality that the leaders of rabbinic Jewry in earlier centuries  \nhad only dreamt of in their wildest dreams—the spread of talmudic study not only  \namong the learned elite, but also to the broad spectrum of the (male) laity of Jewish  \nsociety. With the advent of printing, the rabbinic dictum, “ve-talmud Torah ke-neged  \nkulam” (conventionally interpreted as “the study of Torah is equal to all the other  \ncommandments”), was now within the reach of multitudes of Jews throughout the  \nworld, including the lands of eastern Europe, which from the sixteenth century on  \nconstituted by far the largest Jewish community in the world.\n\nThe Jews of eastern Europe were also the most politically secure Jewish community  \nin Christendom, enjoying the support of the Polish monarchy against pressures  \nboth domestic and foreign, including the attacks on the Talmud from the Vatican  \nand, by extension, the Polish Catholic Church. Thus, the papal assault on the Talmud  \nthat began in 1553, and which led to the burning of the Talmud in Rome two years  \nlater, was responded to in Lublin by the publication of a new edition of the Talmud  \nin 1559. This enterprise lasted a decade and a half, but resulted (for reasons we do  \nnot know) in only two tractates being issued. To the best of our knowledge, in the second half of the  \nsixteenth century, Polish-Lithuanian Jews were, like their brethren in other lands, using the several  \nexcellent editions of the Talmud published in Salonika and Constantinople, far outside the orbit of  \nthe Roman Catholic Church.\n\nYet these editions were soon outdone by the first east European publication of the entire, and  \nunexpurgated, Talmud, issued in Cracow in 1602–1605, with a second edition published in 1616–  \n1620. This milestone of east European Jewish publishing history remained in use throughout the  \nworld, even as its homeland was devastated. At precisely this time, the region experienced wave after  \nwave of violence, culminating in the 1648 Cossack uprising led by Bogdan Chmielnicki in which  \nhundreds of thousands of Jews and Poles were slaughtered. This was followed by multiple invasions  \nfrom Russia, Sweden, and other powers. In these di¥cult decades, known in Poland as the “Deluge,”  \nit is not surprising that there were no new editions of the Talmud published in eastern Europe, as  \nopposed to the relatively more peaceful west, which produced the important Amsterdam (1644–  \n1648 and 1714–1719), Frankfurt-am-Oder (1697–1699), and Frankfurt-am-Main (1720–1722)  \neditions of the Talmud. These printings were in large measure based on the earlier Cracow editions,  \nand thereby obviated the need for a new, east European edition.\n\nBy the turn of the nineteenth century, the twin dynamics of Talmud printing came into play once  \nmore. There was the need for an intersection of a su¥cient body of new commentaries deemed  \nauthoritative (and all-but canonical) to be included either on the margins of the Talmud text itself  \nor in appendices to the main text. Equally crucial was the existence of economic, political, and religious  \nrealities that made a new publication of the Talmud possible. Thus, right at the  \nstart of the nineteenth century, a new edition of the Talmud was printed in Slavuta,  \nUkraine, in 1801–1806, 1808–1813, and 1817–1822, and a competing edition in  \nVilna in 1835.3\n\n3. My remarks on the Slavuta  \nPress and its Talmud follow  \nShaul Ginzburg’s essay, “Tsu  \nder geshikhte fun der yidisher  \ndrukvezn,” in his Historishe  \nVerk (New York, 1937), vol.1,  \npp. 48–62. His popularized  \nseries on the subject, published  \nin the late 1930’s in the  \nForverts, has recently been  \ntranslated into English as Saul  \nMoissevich Ginsburg, The  \nSlavuta Drama, translated  \nfrom the Yiddish by Ephraim  \nH. Prombaum with introductory  \nand concluding remarks,  \nglossary, and suggested readings  \n(Lanham: University  \nPress of America, 1991).  \nAlthough clearly an act of  \nfilial piety by a descendant of  \nthe Shapira family, this translation  \nis a further popularization  \nof an already popularized  \ntext, and should be used with  \nthis in mind.\n\nBehind these raw facts, however, there lies a compelling and to some extent mysterious  \ndrama. First and foremost, by the time the Slavuta Talmud first appeared,  \nthe political conditions that had existed for the previous centuries were no longer  \nextant. The Polish-Lithuanian Commonwealth was destroyed by its three powerful  \nneighbors, Russia, Austria, and Prussia, in the partitions of Poland of 1772, 1793,  \nand 1795. Thus, the area in which approximately a million and a half Jews resided  \nwas now annexed to the Russian Empire, the Habsburg Empire, and the growing  \nPrussian state. This political change, and especially the fact that now the largest  \nand most rapidly growing Jewish population in the world was under the control  \nof the Russian tsars, was to have far-reaching implications on all aspects of Jewish  \nlife, including the history of Talmud publishing. At the very same time, the internal  \nlife of east European Jewry was utterly transformed by the religious and spiritual  \nrevolution brought about by the rise of Óasidism, which spread rapidly from its  \norigins and base in the Ukrainian lands to all other regions of eastern Europe,  \nincluding Congress Poland, Belorussia, and Lithuania. As is well known, even the  \nbans of excommunication levied against the òasidim by the rabbinic leadership of  \nLithuanian and Belorussian Jewry, including the greatest talmudic authority of the age, Elijah Gaon  \nof Vilna (1720–1797), ultimately had little e√ect.\n\nParadoxically, perhaps, the victory of Óasidism is evidenced by the fact that its opponents now  \ncame to be called mitnagdim (opponents) by both groups, the clear implication being that Óasidism  \nwas in late-twentieth-century parlance the default position of east European Jewry.4\n\n4. This was entirely parallel  \nto the adoption, several  \ncenturies earlier, of the term  \n“Protestant” by those who  \nrebelled against the Roman  \nCatholic Church. They were  \nfirst derided as those who protest—  \nthe protestants—and  \nthen came to call themselves  \nby this very same term.\n\nTo what extent  \nÓasidism’s many theological and sociological innovations derived from or caused a diminution of  \nthe role of Talmud study in traditional Jewish life has been a subject of scholarly analysis and debate  \nfor more than a century.5\n\n5. See the excellent collection  \nof articles on Óasidism  \nedited by Gershon Hundert,  \nEssential Papers on Hasidism:  \nOrigins to Present (New York:  \nNYU Press, 1991).\n\nWhat seems clear is that two processes were taking place simultaneously,  \nwhich appear at first to be contradictory but were in fact actually complementary. On the one hand,  \nit is indisputable that the core of òasidic theology in its many manifestations and permutations  \nregarded mystical experience and theosophical teachings as the highest stages of religious life, leading  \nto the greatest goal of all, union with, or cleavage to, the divine. Most revolutionary was the possibility  \nthat this salvific state could be reached by ordinary (though once again, only male) Jews, and  \nnot simply by the elite that had throughout Jewish history studied not only the Talmud and other  \nhalakhic works, but also mystical and esoteric Jewish texts. However, the rabbinical elite through the  \ncenturies had clearly understood the danger posed by mystical exegeses of the Bible and other sacred  \ntexts. Teachings that asserted that the meaning of a word or the fulfillment of a commandment were  \nto be found not in their obvious definition or performance, but rather in their esoteric interpretation  \nor motivation, could undermine the very foundations of rabbinic civilization, leading to nonnormative,  \nand even antinomian, behavior. Therefore, they limited the study of Kabbalah and the  \nperformance of mystic rites to those already ensconsed within the talmudically-trained elite. Even  \nthen further guidelines were established permitting access to this realm of knowledge only to those  \nwho were, among other things, married and over forty years old. Thus, the very core of the òasidic  \nrevolution, the popularization of kabbalistic study and mystic observance, not only departed from  \nprevious traditions, but also invariably led to a diminution of traditional talmudic study in òasidic  \nJudaism. “Talmud Torah,” as previously understood, hardly remained “ke-neged kulam.” This displacement  \nof the ontological status of Talmud study has often been misunderstood or deliberately  \nmischaracterized as a “democratization” of Judaism. Not only was the concept  \nof democracy unknown to the leaders of Óasidism (and extraordinarily di¥cult,  \nif not impossible, to conceive of in regard to women), it was also utterly belied by  \nperhaps the central tenet of Óasidism. This core sociological innovation was the  \nbelief that there was a special type of Jew, the tzaddik, who by divine selection was  \nempowered with extraordinary supernatural powers and wisdom unobtainable to  \nthe average man. Indeed the role of the tzaddik was precisely to serve as spiritual  \nmaster to ordinary Jews, who were charged with emulating, as far as was possible,  \ntheir master’s teachings and actions. Crucial was the fact that these teachings did  \nnot need to be, and generally were not, based on talmudic or other rabbinic texts  \nexpertly interpreted. Many òasidic masters were not, and never pretended to be,  \ntalmudically trained; and many were never ordained as rabbis, as opposed to their  \ncharismatic status as “rebbes.”\n\nAs Óasidism spread and conquered vast segments of east European Jewry, it became as much a  \npart of the “establishment” of east European Jewry as rabbinic Judaism, and not surprisingly, its  \nmore radically kabbalistic and anti-intellectual trends were significantly muted. Indeed, the appearance  \nof the Slavuta Talmud in 1791 already signaled the possibility of the intersection of Óasidism  \nand Talmud study. Not only was Slavuta located in the heart of the overwhelmingly òasidic Ukraine,  \nbut the founder of this press, Moses Shapira, was the son of the great òasidic master, Rabbi Pinòas  \nof Korets (1726–1791), who himself hailed from the more rationalist north but soon became one of  \nthe most devout and enthusiastic adherents and masters of the new movement. It was only natural  \nfor the Slavuta press to publish, alongside the Talmud and other halakhic, homiletic, and liturgical  \nworks, hundreds of òasidic titles, covering the entire spectrum of òasidic genres, from simple (or  \nseemingly simple) tales of rebbes to the most arcane and esoteric mystical texts, including the Zohar.  \nThis extraordinary publishing e√ort contributed, in turn, to the popularization of òasidic beliefs  \nand practices, including the acceptance by a large proportion of east European Jews of the so-called  \nLurianic liturgy (Nusaò ha-Ari), spread through the publication of prayerbooks. In and of itself,  \nthis liturgical departure from the centuries-old traditions of Polish-Lithuanian-Ukrainian Jewry was  \none of the cardinal points condemned as heresy by the mitnagdic leaders from the late-eighteenth  \ncentury on. This essentially became more widely accepted as Óasidism spread throughout eastern  \nEuropean Jewry.\n\nThus, by the 1820’s, the battle between the mitnagdim and the òasidim had all but died down, but  \nthere were still many cases of mitnagdic figures denouncing Óasidism to the Russian and Austrian  \ngovernments as a dangerous, superstitious, radical, and untrustworthy sect. Óasidim answered in  \nkind with denunciations of the mitnagdic leaders to the tsarist regime, usually on the count of corruption  \nof the communal leadership, and especially fraudulent management of taxes and military  \nconscription. Russian authorities confessed that they saw no essential di√erence between one brand  \nof Jews and another; they were all perfidious enemies of Christianity, and hence were to be treated  \nthe same. It was only far later in the nineteenth and the beginning of the twentieth century that  \nthere emerged an unstated coalition between the tsarist regime and representatives of traditionalist  \nJudaism in Russia, both òasidic and mitnagdic, as they faced the revolutionary movements so prevalent  \namong the Jews.\n\nFrom the 1820’s on, however, followers of the nascent Haskalah, the Hebrew Enlightenment  \nmovement, entered into the fray. They attacked Óasidism with even greater fervor than the traditionalist  \nmitnagdim, and sent petition after petition both to the provincial and central governments  \ncondemning the òasidim as obscurantist and dangerous fanatics. Indeed, in the second quarter of the  \nnineteenth century it was often di¥cult to distinguish between mitnagdim and maskilim, and this  \nconfusion was especially important in the realm of access to printing presses and publishers.  \nBy this time, there were a remarkable number of printing presses and publishers among eastern  \nEuropean Jewry, from Vilna in the north, Warsaw in the center, and Odessa in the south. Of these  \nHebrew publishers, only one dared to confront the Slavuta press on its most prestigious turf, the  \npublication of the Talmud. In 1789, the Romm press was founded in Grodno (its actual plant was  \nin a village outside town) by Barukh ben Yosef Romm. This press soon became famous throughout  \n100 p ri n t i ng t h e tal m u d: f rom bom be rg to sc hot t e nst e i n  \nthe Jewish scholarly world for its many publications of halakhic and homiletic, but decidedly not  \nòasidic, works. Following its move to Vilna in 1799, and under the ownership of the founder’s son,  \nMenaòem Mann Romm, the Romm publishing house embarked on a period of astonishing growth  \nand prestige, merging with and acquiring several other publishing houses in Vilna, Grodno, and  \nenvirons. Now, alongside its halakhic and homiletic works, the Romm publishing house began to  \nprint maskilic books as well, albeit those approved by local rabbinic figures.  \nIn 1835, the appearance of the first Romm Talmud led to a fierce battle with the Slavuta press and  \nthe Shapira family, which claimed that the Romms had infringed upon their rabbinically endorsed  \nmonopoly on publishing the Talmud. Soon, a war of rabbinic opinions ensued, with literally hundreds  \nof rabbis involved on both sides, and with no clear resolution possible. The outcome of this  \nfight came from a distinctly di√erent source, the Russian government. First, the body of one of the  \nworkers at the Slavuta press was discovered in its plant. The Shapira family claimed that this was  \na tragic suicide, but others believed it to be a murder, since the worker in question had allegedly  \ndenounced his bosses for publishing books without the permission of the local state censor. A formal  \ninquiry was launched, which led to the conviction of the Shapira brothers, their subjection to corporal  \npunishment, and their banishment to Siberia. The famous Slavuta Hebrew publishing house  \nwas no more.\n\nThis cause célèbre contributed to the decision of the Russian government to shut down all the  \nexisting Hebrew presses in the Empire as a means of better controlling the obviously fractious Jewish  \npopulation. The monopoly on Hebrew (and Yiddish) publishing was then assigned to two publishing  \nhouses, one in Vilna and one in Kiev, to service the mitnagdic-cum-maskilic north and the òasidic  \nsouth.6\n\n6. On this decision, as well  \nas the overall policy of the  \nRussian government regarding  \nthe Jews, see my Tsar  \nNicholas I and the Jews: The  \nTransformation of Jewish  \nSociety in Russia, 1825–1855  \n(Philadelphia: Jewish  \nPublication Society, 1983).\n\nThese monopolies were to be funded by a bidding process in which the winning firm would  \nagree to pay a stipulated tax to the government, raised from the already existing candle and koshermeat  \ntaxes, as well as by tari√s on Hebrew and Yiddish books imported from abroad. Since the  \nreading audience of east European Jews was enormous—the population grew from one and a half  \nmillion in 1800 to approximately six million by the end of the century—obtaining these monopolies  \nwas a guarantee of very substantial income. Not surprisingly, the Vilna monopoly was successfully  \nbid for and obtained by the Romm family. However, all was not well for this family, as their plant  \nburned down (for reasons unknown) in 1840. Nevertheless, the brothers Romm (now led by Yosef  \nand then by his son David) persisted and rebuilt an even larger and more modern publishing house.  \nDavid Romm died in 1862, and his place was taken, rather remarkably for this patriarchal society,  \nby his widow Deborah. The name of the firm changed to the “Widow and Brothers Romm.”\n\nMeanwhile, in the south, the site of the one legal Hebrew publishing house was  \nquite sensibly moved by the government from Kiev, which at this time had a very  \nsmall legal Jewish population due to the restriction of Jewish settlement in the  \ncity. It was moved to Zhitomir, which was far more central to the huge Ukrainian  \nJewish population and, not coincidentally, the site of the second governmentsponsored  \nRabbinical Seminary (the first was in Vilna). Given this de facto connection  \nbetween the Rabbinical Seminary and the projected publishing house,  \nthe prospect of entering into a formal relationship with the Russian government  \nwas anathema to the òasidic leaders. The Seminary’s book publishing needs were su¥ciently met  \nby the Hebrew presses across the various borders in Warsaw, Lemberg, and Czernowitz, where new  \neditions of the Talmud were printed as well.\n\nHowever, none of these editions could compete with the Vilna Shas, which soon added commentaries  \nthat only increased its centrality to traditional Jewish learning across the world. The last  \nedition of the Vilna Talmud was published in 1897—the year in which the Zionist movement was  \nfounded in Basle, Switzerland, and the Jewish Labor Bund was founded in Vilna. Clearly, eastern  \nEuropean Jewry had entered a new phase of its history, during which traditional Judaism, whether  \nmitnagdic or òasidic, had to fight an uphill battle against the forces of modernity. After the death  \nof the “Widow Romm” in 1903 and the emigration of three of her sons to New York, the Romm  \npress continued to function. The remaining heirs had no interest in continuing in the publishing  \nbusiness, however, and the press was sold in 1910 to Baron David Guenzburg, the learned scion of  \nthe richest and most powerful Jewish family in the Russian Empire. For the next three decades the  \nfirm still called “The typography of the Widow and Brothers Romm” continued to publish Hebrew  \nand Yiddish books, both traditional and modernist, until it was destroyed in 1940 in the Soviet  \noccupation of Vilna.\n\nThrough these turbulent times, as the Romm Talmud’s plates and templates were transferred both  \nto the Land of Israel and to the United States,7\n\n7. See Yahadut Lita (n.1 above).\n\nthe Vilna Shas retained its centrality throughout the  \nJewish world, still referred to and honored by its original site of publication, the  \n“Jerusalem of Lithuania.”\n\n"
    }
  ]
}
