{
  "id": "101527",
  "title": "CE Marking Character",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is there any prospect that the »CE marking« symbol ( [http://en.wikipedia.org/wiki/CE\\_marking](http://web.archive.org/web/20141008164125/http:/en.wikipedia.org/wiki/CE_marking \"http://en.wikipedia.org/wiki/CE\\_marking\")) will ever be part – at least – of standard body face character sets?  \nI need it very often, especially for corporate profiles, annual reports and brochures. I know that it hasn’t been encoded as a character. – However, this shouldn’t be an obstacle for type designers to add it.\n\n",
  "author": "Vertex",
  "time": "19 Mar 2013 — 4:14am",
  "uid": "16092",
  "comments": [
    {
      "time": "19 Mar 2013 — 5:12am",
      "content": "Due to the very precise requirements about how the characters should be drawn and scaled and how the use of the logo is approved as part of a greater process, including it in a font would likely not meet with the requirements of the standard, as shown and described below:\n\n ![](http://web.archive.org/web/20141008164125im_/http:/typophile.com/files/ce_marking_logo_3689.jpg)\n\n_The various components of the CE marking must have substantially the same vertical dimension, which may not be less that 5 mm. If the CE marking is reduced or enlarged, the proportions given in the above graduated drawing must be respected._ ( [http://ec.europa.eu/enterprise/policies/single-market-goods/cemarking/pr...](http://web.archive.org/web/20141008164125/http:/ec.europa.eu/enterprise/policies/single-market-goods/cemarking/professionals/manufacturers/affix-ce-marking/index_en.htm?filter=12 \"http://ec.europa.eu/enterprise/policies/single-market-goods/cemarking/professionals/manufacturers/affix-ce-marking/index\\_en.htm?filter=12\"))\n\n"
    },
    {
      "time": "19 Mar 2013 — 5:57am",
      "content": "Thank you so much for this essential information, Karl! Nevertheless, the specified minimum vertical size is – as I learned now – 5mm, which means ca. 14 DTP points (hopefully I’m right). I think the set point size (as specified in vertical mm) should be user responsibility and not responsibility of the type designer, foundry or reseller. – Important is the availability of this character in the character set of a body face.\n\n"
    },
    {
      "time": "19 Mar 2013 — 9:27am",
      "content": "Your number of 14 is correct, rounded; the point size to set would be 19-20 pt depending upon the font.\n\n"
    },
    {
      "time": "19 Mar 2013 — 10:52am",
      "content": "It doesn't look like it has a Unicode position, plus since it's so strictly defined that a font's style will have no bearing on it. So it's not very desirable as a character in a font. Why not just have/use it as a stand-alone EPS? It's not like you need to type a bunch of them at a time.\n\nAdditionally, there's a risk concerning that minimum size, possibly leading to a textbook frivolous lawsuit, which is how people roll these days, at least here in the US. If a font publisher says something like \"it must be 14 point to meeting the 5mm minimum requirement\" some people will think the font has to be set at 14 point, but as George said that's not true, because type designers don't make their glyphs span the full height, so the mark will end up too small, and the lawsuit cascade might lead to the font designer... And for a type designer with a large library of fonts, unless he does decide to make the CE mark the whole height of the Em for all his fonts, he'll have to figure out the height proportion for each one of his fonts... Messy stuff.\n\nBTW is that thing spaced horribly, or what?! But if you try to make it look nicer by bringing the \"C\" and \"E\" closer, Interpol might come after you!  \n [http://www.electronicsweekly.com/blogs/test-and-measurement/2011/02/whic...](http://web.archive.org/web/20141008164125/http:/www.electronicsweekly.com/blogs/test-and-measurement/2011/02/which-ce-badge-have-you-got.html \"http://www.electronicsweekly.com/blogs/test-and-measurement/2011/02/which-ce-badge-have-you-got.html\")\n\nhhp\n\n"
    },
    {
      "time": "19 Mar 2013 — 11:54am",
      "content": "It should be encoded, and I'm surprised if it is not already in Unicode. Even though I don't think it is something that needs to be included in more than a handful of fonts, since the shape is standard, being able to include it as a text entitity rather than as an embedded graphic seems useful. The estimated symbol is also a standard shape, but is encoded in Unicode and hence included in at least some fonts.\n\n"
    },
    {
      "time": "19 Mar 2013 — 11:58am",
      "content": "BTW what's the minimum size for Estimated?\n\nhhp\n\n"
    },
    {
      "time": "21 Mar 2013 — 2:26pm",
      "content": "<cite>3.1. the nominal quantity (nominal weight or nominal volume), expressed in kilogrammes, grammes, litres, centilitres or millilitres, and marked in figures at least 6 mm high if the nominal quantity exceeds 1 000 g or 100 cl ; 4 mm high if it is from 1 000 g or 100 cl inclusive down to but not including 200 g or 20 cl, and 3 mm high if it is not more than 200 g or 20 cl, followed by the symbol for the unit of measurement used or where appropriate by the name of the unit in accordance with Directive 71/354/EEC;</cite>\n\nLooks as if it depends upon the bottle size.\n\n"
    },
    {
      "time": "21 Mar 2013 — 2:40pm",
      "content": "Figures it's not a simple answer... (Thanks for checking.)\n\nhhp\n\n"
    }
  ]
}
