{
  "id": "101582",
  "title": "matching fonts for line spacing",
  "forum": "Design",
  "tags": [
    "glyph width match",
    "proportional fonts",
    "Design"
  ],
  "content": "Are any two fonts (that are NOT monospaced) known to be matched in terms of the width of every glyph? I mean one that is serif, and the other is sans-serif.\n\nMy goal is not to pair or match fonts for aesthetics and use them together, but to find two that are interchangeable without having a single glyph need more or less space. If I need to purchase fonts, realize I'm on a schoolteacher budget but the investment would be worth it.\n\nHere's my situation: When I introduce students to a printed material (yes, the dreaded \"worksheet\"), it's often helpful to display and review the entire thing on an overhead digital projector. For the print version, I believe serif is the most readable and looks nicer. For the display board, with some students straining to see from the back of the room, going with a simpler, more screen-readable sans serif would be ideal. Yet to throw off the line spacing (and therefore pagination) causes other woes. Right now the only reliable solution I have is to use hard returns and keep each line safely short of the margin.\n\nIf my basic idea is flawed, stop me here and tell me to go home. I apologize also if this question has already been answered. My lack of technical vocabulary in this area makes typing search strings a bit futile.\n\nJoseph Woodard\n\n",
  "author": "JosephWoodard",
  "time": "20 Mar 2013 — 3:35pm",
  "uid": "210008",
  "comments": [
    {
      "time": "20 Mar 2013 — 3:49pm",
      "content": "I don't know of any (but I've been proven wrong before).  \nMy feeling is that a well-spaced, nice and readable serif _can't_ have the same metrics as a well-spaced, nice and readable sans-serif, because the serifs introduce elements that affect the spacing.\n\n"
    },
    {
      "time": "20 Mar 2013 — 4:59pm",
      "content": "Compatil is probably the most extreme such \"uniwidth\" system:  \n [http://www.linotype.com/2603-19089/amodulartypesystem.html](http://web.archive.org/web/20140721195852/http:/www.linotype.com/2603-19089/amodulartypesystem.html \"http://www.linotype.com/2603-19089/amodulartypesystem.html\")  \nI love it.\n\nRelated and recent: [http://typophile.com/node/100708](http://web.archive.org/web/20140721195852/http:/typophile.com/node/100708 \"http://typophile.com/node/100708\")\n\nhhp\n\n"
    },
    {
      "time": "20 Mar 2013 — 5:19pm",
      "content": "There may be superfamilies designed to do this, but if you find one it will probably cost you a lot.  \nI think there would be some comprehension value in the materials looking exactly the same. I suggest you compromise with a slab serif, which would serve well for both close and distance reading. I remember a handful of books from when I was young that were set in Rockwell or Memphis and it never bothered me. You might consider Museo Slab.\n\n"
    },
    {
      "time": "20 Mar 2013 — 5:22pm",
      "content": "Or -shameless plug- this:  \n [http://ernestinefont.com/](http://web.archive.org/web/20140721195852/http:/ernestinefont.com/ \"http://ernestinefont.com/\")\n\nhhp\n\n"
    },
    {
      "time": "20 Mar 2013 — 5:48pm",
      "content": "[ASAP](http://web.archive.org/web/20140721195852/http:/www.google.com/webfonts/specimen/Asap), available through google webfonts, says that it offers matching serif and sans-serif fonts that do not reflow when one is changed for the other.  \n-- Herb\n\n"
    },
    {
      "time": "20 Mar 2013 — 6:15pm",
      "content": "Good find. Plus it's made by a real type designer. But where's the serif version?\n\nhhp\n\n"
    },
    {
      "time": "20 Mar 2013 — 7:22pm",
      "content": "> ASAP, available through google webfonts, says that it offers matching serif and sans-serif fonts that do not reflow when one is changed for the other\n\nWhere do you see that, about serif and sans? The link seems to me to be talking about reg/bold/italic/bold italic uniformity.\n\n"
    },
    {
      "time": "20 Mar 2013 — 10:32pm",
      "content": "Oops.. Mea Culpa. I misread something very badly! I think it was in the link that got me there in the first place. Sorry for the false positive. Herb\n\n"
    },
    {
      "time": "21 Mar 2013 — 6:23am",
      "content": "I vote the basic idea is flawed. I think more important for readability is a balance of size and weight.\n\nWhat you could do, with the font mentioned, is to try the different weights for screen and print. My guess is that with the ASAP fonts, the normal for print & bold for projection might work. You'd have to experiment. I believe there may be other fonts that have the same setwidth for different weights, at least, to a point.\n\nYou could also experiment with one of the old Adobe Multiple Masters fonts, changing the width axis to, in effect allow the type to be larger/heavier for screen usage with the same character widths. The \"optical size\" axis in MM could also help; use a 6-7 point for the screen & a 10-12 point for print.\n\nNot sure that will work technically, or for that matter, to solve your problem, but if you're willing to try, it could be worth a shot.\n\n"
    },
    {
      "time": "21 Mar 2013 — 6:27am",
      "content": "I certainly agree (with Craig as well) that it's a marked compromise, but the proof is in the pudding: when you look at a setting of Compatil, can you point out cases of damage being done? Maybe when the compromises are properly managed the end-result is within a threshold of acceptability? Which is, of course, a variable thing, but I'd like to be shown that \"the 'i' is too tight/loose/wide/narrow\" for example. With that \"wide/narrow\" nicely reminding us that serifs can vary in size (something I did in Patria). Which of course brings us to the perennial existential question: What is a serif? :-)\n\nhhp\n\n"
    },
    {
      "time": "21 Mar 2013 — 7:36am",
      "content": " ![](http://web.archive.org/web/20140721195852im_/http:/typophile.com/files/Picture_5106.png)\n  \nCompare spacing and counter widths. In the serif versions, the straight-sided letters look cramped and narrow compared to the round-sided letters.\n\nTo my eye it seems like most of the compromising was borne by the serif versions. I wonder if the thinking is that the serifs make nonoptimal spacing more forgiveable. Or maybe they just had the sans face to start with.\n\nThanks for calling my attention to this typeface Hrant; I'd never encountered it before.\n\n"
    },
    {
      "time": "21 Mar 2013 — 9:21am",
      "content": "Good analysis, but I have to worry: how reliable is the MyFonts rendering?\n\nI happen to have the Compatil specimen booklet, but I haven't looked at it for years and it's now in deep storage (read: garage :-). Maybe I should take up the kind offer by Otmar Hoefer -who knows I admire Compatil- of sending it over for review/promotion purposes...\n\nhhp\n\n"
    },
    {
      "time": "21 Mar 2013 — 4:21pm",
      "content": "In the olden days some combinations of fonts were duplexed (eg Linotype — in which cases identical glyphs would have the same widths). I know there is some evidence somewhere in my library… : (\n\nI also remember that some corporate fonts use the measures of standard fonts (such as Times or Helvetica), to make sure that texts — in fall back situations, where the corporate fonts are unavailable — have the same lengths. Which is a concern for legal texts and such.\n\n"
    },
    {
      "time": "21 Mar 2013 — 6:10pm",
      "content": "> In the olden days some combinations of fonts were duplexed (eg Linotype — in which cases identical glyphs would have the same widths).\n\nBest I can recall, these were pretty much limited to roman duplexed with italic, or once in a while, roman duplexed with bold.\n\nAgain, I'd be be tempted to use MM technology, to get a larger x-height (on the optical axis) and a bit bolder for the projection fonts.\n\n"
    },
    {
      "time": "21 Mar 2013 — 7:45pm",
      "content": "I've seen references to Linotype offering pairs like Gothic No. 13 duplexed with Cheltenham Bold Condensed. (That's just for the historical record; of little use to the original poster.)\n\n"
    },
    {
      "time": "22 Mar 2013 — 6:59am",
      "content": "It wasn’t the norm, but neither was it unheard of — especially with combinations useful for newspaper and jobbing work. For example:\n\n ![](http://web.archive.org/web/20140721195852im_/http:/typophile.com/files/CoronaWGothic_3846.jpg)\n\n"
    },
    {
      "time": "22 Mar 2013 — 11:25am",
      "content": "Interesting. Thanks Kent.\n\n"
    },
    {
      "time": "22 Mar 2013 — 11:49am",
      "content": "However, in the olden days paper wasn’t _really_ pus-colored.\n\n"
    }
  ]
}
