{
  "id": "101667",
  "title": "Food Fight !! Why Choose a Forgery?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This has been bugging me for a while, so I thought to seek counsel and wisdom from the Typophile Circle of Wise People...\n\nIf the sanskritweb.net section on font forgeries is somewhere near to being accurate (rather than just shark baiting), then the following questions seem relevant to ask:\n\n1. Take Bitstream fonts as an example. It seems that a large percentage of Bitstream fonts are forgeries of Linotype fonts. See this for a comparison of Bitstream-to-Linotype font names: [http://www.sanskritweb.net/forgers/bitstream2.pdf](http://web.archive.org/web/20150123121009/http:/www.sanskritweb.net/forgers/bitstream2.pdf \"http://www.sanskritweb.net/forgers/bitstream2.pdf\") . How is this legally possible? And why does it persist? One of the universal messages that comes through loud and clear in sites such as Typophile is that designers (font & creative) are pretty proud and protective of their work. How would Nick S. or Mark S. feel if someone systematically forged their libraries? Not only does the forgery-thing seem to be widely tolerated, the industry treats people like M. Carter as celebrities. Why?\n\n2. In various design-related forums, including Typophile, Bitstream typefaces are highly regarded. In fact, often they are preferred over conventional Linotype/Monotype offerings... say, Univers versus Zurich, or several of the historical types. Is it truly because Bitstream fonts are exceptionally well designed, or that some social-psychological reaction is occurring which triggers a David vs. Goliath image within us? And now that Goliath (Monotype) has acquired the twin Davids of Bitstream and Linotype, what is to eventually happen to what forgeries?\n\n",
  "author": "oobimichael",
  "time": "24 Mar 2013 — 2:35am",
  "uid": "204281",
  "comments": [
    {
      "time": "24 Mar 2013 — 6:46am",
      "content": "Ah, so you like big business. You're going to love the new Monotype conglomeration.\n\nThere is so much nonsense in the article you cite, I'll make just one of many possible comments:\n\nYup, Bitstream \"copied\" Linotype fonts. Probably because most of the top talent in the drawing room at Linotype U.S. (mainly the artistic guys, not the corporate) left to form Bitstream. (Aside: I believe that David Berlow left Linotype to start FontBureau without a stint at Bitstream. And while not designers, I wouldn't call either Cherie Cone or Mike Parker \"corporate.\")\n\nSince (1) corporate strategy at Linotype, at the time a subsidiary of Allied Chemical, was simply to rake in profits (which included doing the bare minimum to the old fonts to sell them in the new digital world), and (2) since you cannot patent a type design, (3) Bitstream did the work.\n\nIt was pretty generally felt at the time that the Bitstream PostScript fonts were far better than the Linotype, but not as complete -- At that time, Bitstream rarely offered old-style numbers, small caps, etc.\n\nYeah, I was there in the 1980s, and a locked-in Linotype customer. Before PostScript, high-end Linotype fonts were locked to a particular typesetting machine. \"Particular\" here means not only brand, but individual machine. If you bought a new machine, you bought the fonts all over again, albeit with a discount. BTW, a maintenance agreement for the $20,000+ machine was about 1/5 the purchase price. In other words, you bought it all over again every 5 years, even if nothing went wrong.\n\nOf course, you didn't have to have a maintenance agreement. But parts carried quite a markup, and could be hard to get except from the parent company. And if you weren't on contract, time went for $100/hour as I remember, & started when the technician left for the airport... I believe you picked up the plane ticket...and technician availability was such that maintenance agreement customers came first... In other words, most everyone bought a maintenance agreement after the first breakdown.\n\nLinotype, Monotype, etc. were not about \"artistic integrity...\" What in this world is?\n\nBTW, did you know that when Sumner Stone opened the Stone Type Foundry, he had to license the \"Stone\" family from ITC in order to be able to sell it with the \"Stone\" name?\n\n"
    },
    {
      "time": "24 Mar 2013 — 7:06am",
      "content": "None of that makes it ethical to plagiarize. Which is exactly why some years ago Bitstream delivered a heartfelt public apology at an ATypI conference (Leipzig?) and announced they would no longer stoop so low. I fondly remember being one of the first audience members to applaud them, and to this day I remain impressed and proud.\n\nDamage has been done, but to me at least the case is closed.\n\nhhp\n\n"
    },
    {
      "time": "24 Mar 2013 — 8:23am",
      "content": "Ethics:\n\n> No, no, just the stuff I can add Armenian to and sell. As far as I can tell only the Apache license (does the version matter?) would allow that.\n\n[http://typophile.com/node/99972](http://web.archive.org/web/20150123121009/http:/typophile.com/node/99972 \"http://typophile.com/node/99972\")\n\nLegal, sure. Can't see how it's ethical. Probably I'm missing something in my understanding of ethical principles. I can't understand a lot, like with the far right in the U.S., who want to go back to the good old days and favor life-saving medial practices (now that we've gone beyond the relatively cheap blood-letting) only for those who can afford them, or the far left, who will help their neighbor only if it can be done through some anonymous program that limits total liability. No doubt a defect in me that Hrant will expound on, and I will ignore.\n\n\\* \\* \\*\n\nAs for type in the 1980s, how many of you know how it was sold? Who designers worked for? How much work was needed aside from the \"design\"? That was the climate that gave rise to Bitstream. Also, a bit earlier, to Compugraphic, A-M, etc.\n\nBTW, \"Compugraphic\" was also the format recommended by Bringhurst's publishers, Hartley & Marks, for storing all text data, until Quark came along. At that point, they recommended storing all data in Quark. And that made such great sense to everyone -- those of us who said \"wait a minute\" were shouted down. Our company stuck with ASCII, & guess whose files are most easily convertible today? Times and technologies do seem to matter.\n\n"
    },
    {
      "time": "24 Mar 2013 — 12:38pm",
      "content": "First of all, I didn't call you unethical. Why are you making a personal attack? And don't pretend you're ignoring me when you're addressing things I write.\n\nI can't assume that somebody who released a font under the Apache license (especially as recently as Roboto) was unaware of other options, specifically ones that forbid resale. What I can assume is they were thinking what I've been thinking (which I've explained on Typophile but you seem to be conveniently ignoring): the Apache license brings in people (like me) who otherwise would have trouble justifying lending their efforts to -further- improving typographic social justice. I do it enough already! Do you think I can house and feed four kids just by selling Armenian fonts? Not having to make a usable Latin font for an Armenian+Latin system saves so much time, it's not even funny. Please, Charles, just try making a text font! And you'll see what I mean.\n\nAnd guess what I would do if somebody who released an Apache font regrets it and asks me not to make money from it? What about you? If the designer of a libre font you rely on wants to switch it to proprietary and asks you to buy it or stop using it (even though he would have no legal or practical basis) what would you do?\n\nBut enough about me. Do you think Bitstream was wrong to apologize?\n\nBTW I started designing type (if only bitmap fonts) in 1982, but frankly didn't start \"mingling\" until the late 90s. However I've read/talked about previous eras with many people. Many of those people lost respect for Bitstream; some of those regained it when they apologized.\n\nhhp\n\n"
    },
    {
      "time": "24 Mar 2013 — 11:27am",
      "content": "You're right. If I accept Bitstream's work as not being a matter of ethics, and I do, yours in the quoted context has the same status. My brain's become like an old data-retrieval system that doesn't work quite right. The word I wanted to pull up was \"hypocritical,\" not \"unethical.\"\n\n"
    },
    {
      "time": "24 Mar 2013 — 12:18pm",
      "content": "How am I hypocritical?\n\nhhp\n\n"
    }
  ]
}
