{
  "id": "101617",
  "title": "\"Earthbound\" font (as far as an amateur could go with it)",
  "forum": "Sans Serif",
  "tags": [
    "beginner",
    "blend",
    "development",
    "Hybrid",
    "mr giacco bold",
    "Sans Serif",
    "ubuntu bold"
  ],
  "content": "Hello!\n\nBeginner here, playing with font development tools. I made (so far as my skill is able) and released a font yon:\n\n[URL removed my moderator]\n\nAs it says there, it is a \"blend\" of \"Ubuntu Bold\" and \"Mr. Giacco Bold.\"\n\nI welcome comments and feedback, as I'm curious what may need help with this. Although I probably wouldn't be able to implement feedback; my hope is that if anyone has a fancy for this, they'll use it as inspiration or a basis for something production-grade (whether it's usable for production, I have no idea).\n\nAll of the source files are in the .zip distribution archive yon; attached here is a (very many-page) .pdf sample, as well as a .png sample showing all the glyphs.\n\nThanks!\n\n[Attachments removed my moderator]\n\n",
  "author": "r_alex_hall",
  "time": "21 Mar 2013 — 11:08pm",
  "uid": "210037",
  "comments": [
    {
      "time": "22 Mar 2013 — 3:59am",
      "content": "Did you ask Diego Giaccone for feedback on your release? I think his opinion would be of particular interest. You will find his e-mail address on the Sudtipos website.\n\nbart\n\n"
    },
    {
      "time": "22 Mar 2013 — 6:36am",
      "content": "I assume by \"blend\" you don't mean that you used the actual outlines of Mr. Giacco in some way, correct?\n\nhhp\n\n"
    },
    {
      "time": "22 Mar 2013 — 8:34am",
      "content": "Hrant, did you read the EarthboundExtraBoldFontSample PDF?\n\n> [Earthbound] was created by doing a 50/50 vector blend of the fonts “Ubuntu Bold” and “Mister Giacco Bold,” and it was tweaked from there. [...] I found Giacco Bold by running the title logo from the Super Nintendo video game of the same name through online font identification tools (such as whatfontis.com and whatthefont, I believe). I thought I might use Mister Giacco Bold as the logo and header font for my web site earthbound.io, partly just because I like it, but also because it's stylistically similar in ways to the font of said video game. I was very close to using it, however, I took another look through my font collection, and noticed it is strikingly similar to Ubuntu Bold. I was then undecided whether to use Giacco or Ubuntu, which led to the idea to blend them into one font, which I tried, and I love the result. I hope you may enjoy and find uses for it as well. If you do, please credit me and link to earthbound.io.\n"
    },
    {
      "time": "22 Mar 2013 — 8:54am",
      "content": "I didn't, sorry.\n\nAlex, it's probably an honest mistake (one that many people unwittingly make) but re-using the outlines of a commercial font is not OK. Even if a person thinks it's ethically OK (which I personally don't) it's actually legally not OK because the outlines are essentially code that define a font, so they're copyrighted. You're OK on the Ubuntu end, but not the Giacco end... So unless you get permission from Diego Giaccone and Sudtipos, to do the right -and legal- thing, you'd have to pull it, and redraw it (or not). Sorry for the bad news. :-/\n\nAnd of course somebody making a derivative of Earthbound isn't OK either.\n\nHere's an idea: put Giacco in the background layer, and modify Ubuntu while referring to Giacco.\n\nhhp\n\n"
    },
    {
      "time": "22 Mar 2013 — 10:20am",
      "content": "hrant, no apology is necessary for saving me potential legal trouble :)\n\n(I'm frankly floored that sending outlines through an algorithm--no matter how much it alters the outline--I'm floored that this may not be OK. But on the other hand, if I had personally spent a lot of time and care creating an outline that someone else did that with, I can imagine myself not being OK with that.)\n\nAlso, your suggestion (hrant) for reworking it sounds doable. (I was also thinking of redrawing guide contours from scratch, with both fonts as reference, and stroking those with a uniform width--if I'm using the right terms there--because I wonder if the stroke widths are uneven.)\n\nMeanwhile it looks like I better take down the release, and the .pdf sample here, which I think has the font embedded, and upload a revision at openfontlibary.org that only uses \"Mr. Giacco\" as visual reference.\n\nBart, I frankly read that as a snarky way to expose me to potential trouble I was unaware of (I don't know whether I misread you there), but I may have a mind to call your bluff (if indeed you were having fun with me as I suppose), and find out Diego Giaccone's opinion directly.\n\nAssuming the attached .png image as a conceptual sketch could safely remain here (the image is of little or no practical use other than reference), I remain curious about any design feedback.\n\n"
    },
    {
      "time": "22 Mar 2013 — 10:39am",
      "content": "Very honorable plan of action - thank you. I think once you pull the current version you can/should contact both Giaccone and Sudtipos and explain yourself. Unless they're crazy protectionists (of which there certainly are some out there, believe me) they will forgive your mistake and respect your corrective action.\n\nTo be honest, if you don't announce that you re-used outlines it's hard for people to prove it; they can certainly _feel_ it, but it's not actionable. So much of the junk on Dafont, etc. is covertly plagiarized, it's sad. And doubly sad when you have to watch people on the ID section of Typophile -which is essentially the watering hole of type design- suggest such fonts... And when you merely raise a red flag, they even have the gall to whine about being bullied... Clearly they don't want ethics cramping their style! But of course keeping such a shady genesis secret wouldn't make it OK - it might in fact make it less OK.\n\nBTW if Bart was indeed sending you into a trap, I can see where he's coming form. There's so much cavalier, remorse-less plagiarism going on, and so few people willing to change their attitude, that it can feel like the only way to get people to stop is to scar them. Me, I try the soft touch first (not that that always works either).\n\nhhp\n\n"
    },
    {
      "time": "22 Mar 2013 — 10:45am",
      "content": "The soft touch seldom works with a pirate :)\n\nArr!\n\n"
    },
    {
      "time": "22 Mar 2013 — 11:34am",
      "content": "I don't know how to delete the .pdf attachment from my post here.\n\nSent an email to the proper folks at openfontlibrary.org (I don't know how to remove the font from the site). Attempted and email to Mr. Giaccone, and it bounced. Seem to have sent an email okay to the general contact at Sudtipos.\n\n"
    },
    {
      "time": "22 Mar 2013 — 2:51pm",
      "content": "Alex, I think you're doing the right thing now. Respect.\n\nAs to my previous post: I found it quite unbelievable that anyone should know about kerning pairs but not about copyrights. You released a font with issues. You asked for feedback and you got some. Not to send you into a trap, but to make you think. You should not feel offended.\n\nAnd, without any snarkiness, I must say I really am impressed by your willingness to learn.\n\nAll best,  \nbart\n\n"
    },
    {
      "time": "22 Mar 2013 — 3:04pm",
      "content": "I guess removing the PDF matters because it's possible to extract the font from it. I'll alert a moderator.\n\nhhp\n\n"
    },
    {
      "time": "22 Mar 2013 — 4:03pm",
      "content": "Thanks Bart.\n\nI'd call it a finer point of copyright?\n\nAnd--I suppose that's that.\n\nHere's my email exchange with Sudtipos.\n\nModerators: please delete my .pdf here. 'Tis demanded by the GODS, it is! /JarJar  \n--------  \nFrom: [me]  \nTo: [sudtipos]  \nRe: An amateur font designer's legal goof\n\nTo whom it concerns,\n\nI have attempted to contact Mr. Giaccone with the following, but it seems the email bounced or was blocked. I hope that this reaches you.\n\n----  \nMr. Giaccone,\n\nI reused your work (and/or your company's work) on \"Mr. Giacco Bold,\" in combination with \"Ubuntu Bold,\" by way of the \"Blend\" tool in FontLab. I was very pleased with the result, and further adapted it to a font which I released at openfontlibrary.org --\n\n[URL removed my moderator]\n\n-- and I notified the community about this work, at typophile.com --\n\n[URL removed my moderator]\n\n-- to discover their wise caution that I have perhaps done something illegal (although that was certainly never my intent).\n\nPlease advise. I will happily remove the font from openfontlibrary.org if that is your wish (and on the presumption that this is best, I have already sent an email to the site owners there, advising them to take it down).\n\nI will also happily make the source files available to you if you are unable to find them at openfontlibrary.org by the time you read this.\n\nI would of course also be happy to find any legal arrangement that would allow for the distribution of a derivative work, such as what I had developed for a font entitled \"Earthbound.\"\n\nWith admiration for your work,\n\nAlex Hall  \nAmateur font designer\n\n----  \nTo: [me]  \nFrom: [sudtipos]  \nRe: [SPAM] An amateur font designer's legal goof\n\nHello  \nWe do not allow any modification of our fonts and of course we do not  \nallow free distribution. The use of our outlines for derivative work is  \nprotected by law.  \nI assume you don't have the original MrGiacco license too.  \nPlease remove all the fonts from everywhere as soon as possible we would  \nnot like to take any legal action on that.\n\n----  \nFrom: [me]  \nTo: [sudtipos]  \nRe: [SPAM] An amateur font designer's legal goof\n\nAs my previous email stated, I have notified openfontlibrary.org that it is advisable they take down the font (it seems that their infrastructure provides no facilities for a submitter to take down what they have posted). I have seen no reply from them; perhaps it's only a matter of time before they see my email (it's only been half a day). I have given as much effort to openness and honesty about the circumstance as could reasonably be expected, and it is now out of my hands.\n\nIt's a great looking derivative work, in my opinion, and I'm disappointed that an admiring inquiry about the potential use of it (and if I may say so, my brazen confession about my genuine lack of awareness of the legal ramifications of my work) would be marked as [SPAM]. I'm attaching the sources. I hope you will reconsider adapting this work which is rightfully yours, and if you do so, I wouldn't be offended if you send me a complimentary personal font license of the result :)\n\nConveniently, if indeed my inquiry was \"spam,\" or unsolicited email, I suppose your reply is also, which makes it public domain, so that I may amuse myself to publicly post my inquiry, with your company's cold reply :)  \n----\n\n"
    },
    {
      "time": "22 Mar 2013 — 4:16pm",
      "content": "You should forward the Sudtipos reply to Open Font Library. But it's probably just a matter of waiting a little bit.\n\nBTW you might think their reply was \"cold\", but:  \n- If I were you I would buy a license to MrGiacco if you don't already have one (which is basically piracy, so not OK) to make up for the damage.  \n- Consider yourself lucky: there are people out there who would have simply sent you a bill for MrGiacco plus a letter from a lawyer, without even replying to your email.\n\nhhp\n\n"
    },
    {
      "time": "22 Mar 2013 — 4:42pm",
      "content": "UGH. I pressed \"post\" too soon. They sent a kind reply. I hope that I will now cease spamming this thread :)\n\n"
    },
    {
      "time": "23 Mar 2013 — 1:00pm",
      "content": "You also have to delete that zip file and references to it, which contains an illegally re-distributed version of Mr. Giacco and other material.\n\n"
    },
    {
      "time": "24 Mar 2013 — 5:50pm",
      "content": "Well, that's the thing, HVB--if you mean the .zip file at openfontlibrary.org, that's what it seems I have no way to delete (so that I'm waiting on their response). (And thanks for editing that, Chris. I'd actually prefer my posted emails be snipped, too . . .)\n\n@hrant true that, and I'm doubly embarrassed to have misread Sudtipos (and Bart).\n\nI'll take solace in that I've done my best to repair my blunder.\n\nI've looked into pulling together a quick and dirty rework using only the \"Ubuntu\" font, in compliance with their license, to post an update which would replace it with such a revision (effectively deleting the old), but it turns out the change wouldn't be substantial enough to warrant renaming the font per their license terms (it would have to be \"Ubuntu revision X by Y\" or something like that), so that it would have to end up at a different URL (and therefore not overwrite the old version).\n\nSo I think my last comment would be that if you bold \"Ubuntu\" by 35 em and condense it by 88 percent, it looks pretty cool. (And it's legal to do so, if you follow their license terms!) Not as cool as it might look to blend the vectors from that with \"Mr. Giacco,\" but whoops--we can't do that! :/\n\n"
    },
    {
      "time": "24 Mar 2013 — 6:27pm",
      "content": "If you have concerns, requests &c. regarding this thread, please email them to me directly:\n\n[typographer@gmail.com](mailto:typographer@gmail.com)\n\n"
    },
    {
      "time": "27 Mar 2013 — 10:40am",
      "content": "I have reworked this legitimately from scratch, and updated the distribution with that reworking, which should now be clear to download:  \nhttp:/www.openfontlibrary.org/font/earthbound-extrabold\n\nI took your suggestion, hrant/hhp (and thank you for the suggestion) of modifying the \"Ubuntu\" font, with \"Mr. Giacco\" as reference. This round, I only directly used Ubuntu outlines, and actually entirely redrew many glyphs, by making new beziers, along hand-drawn paths chosen from what my eye liked between Ubuntu and Mr. Giaccone's fine work :) I then expanded those beziers (and oh how fun it was to discover how to expand a line to an outline!) to the same dimensions as Ubuntu.\n\n(I have still seen no reply from openfontlibrary.org, by the way--even after I asked Sudtipos to forward my email to them--and they still list the prior, illigitimate version. The \\*newest\\* version is legitimate--I can't do anything about the old version; I've done my very best due diligence to have it removed . . . I hope they wake up to my request . . . )\n\nAccordingly (and after that perhaps arduously too long preamble), here are samples which I welcome anyone to pick apart; if you wish, please tell me what may work and not work for you in the fonts. I beleive they're different enough to warrant a new font name (and I believe my release files etc. comply with the Ubuntu Font License). Extensive .pdf samples are in the distribution yon.\n\nYou may only notice the differences from the Ubuntu fonts if you examine both closely (well, I don't know, to my eyes they look quite different at a glance), so I'm including a sample of Ubuntu and Ubuntu Bold.\n\nThank you again, y'all for your kind help.\n\nEarthbound Regular and Semi-condensed ExtraBold:\n\n ![](http://web.archive.org/web/20150415093746im_/http:/typophile.com/files/EarthboundRegular-and-Semi-condensed-ExtraBold-FontSamples_5902.jpg)\n\nUbuntu Regular and Bold, for comparison:\n\n ![](http://web.archive.org/web/20150415093746im_/http:/typophile.com/files/UbuntuRegular-and-Bold-FontSamples_3608.jpg)\n\n"
    },
    {
      "time": "27 Mar 2013 — 5:48pm",
      "content": "Good going. But what's the hang-up with the ofl.org people? Are they philosophically opposed to correct behavior?\n\nBTW your Regular is too loose and the other is -way- too tight.\n\nhhp\n\n"
    },
    {
      "time": "27 Mar 2013 — 7:03pm",
      "content": "Haha, yeah I don't know what's up with the no-response. I hope it's a technical thing, like they get too much spam to have seen my emails, or their programmers are saying \"Oh, crud, yeah, let's make it easier to delete a font than to manually delete entries from a database . . . \" :)\n\nRe the spacing, I agree and have had no luck so far adjusting that (global bearing or kerning percent changes have butchered the spacing or crashed editors). This font simply copied new or changed glyphs directly onto the original Ubuntu spacing and kerning tables (I think--it seems Ubuntu Regular is itself very loose). I wouldn't release them thus, except for my hurry to at least post any kind of legit update.\n\nIf/when I get the spacing improved, I may post the word \"blurt\" here.\n\n"
    },
    {
      "time": "30 Mar 2013 — 1:25am",
      "content": "\"Blurt.\"\n\nThey emailed me a notification that it is flagged for review, and encouraged me to upload my legitimate version anew; I've also got the font spacing (bearing) in a way I like now, and the release includes that.\n\nNo offense intended, but in a way I'd like to part from this thread; I'll simply post a sample and link under a new thread without any other explanation or ado.\n\n"
    },
    {
      "time": "16 Apr 2013 — 2:38pm",
      "content": "Just wanting to tie up a loose end:  \nSo did OFL end up removing the offending font?\n\nhhp\n\n"
    },
    {
      "time": "16 Apr 2013 — 3:00pm",
      "content": "Who are “the OFL People?”\n\n"
    },
    {
      "time": "16 Apr 2013 — 3:44pm",
      "content": "[http://openfontlibrary.org/](http://web.archive.org/web/20150415093746/http:/openfontlibrary.org/ \"http://openfontlibrary.org/\")\n\nhhp\n\n"
    },
    {
      "time": "26 Apr 2013 — 10:28pm",
      "content": "Sorry I missed your query, hhp--\n\nLast I heard from them, they flagged it for review.\n\nI posted a revision of my font in a new thread a bit back, and kinda wish I'd just done it here now :/\n\nBut if/when I revise it again, I'll post the update yonder:  \n [http://typophile.com/node/101854](http://web.archive.org/web/20150415093746/http:/typophile.com/node/101854 \"http://typophile.com/node/101854\")\n\n"
    }
  ]
}
