{
  "id": "101651",
  "title": "Canberra Typeface Design Competition for $10,000 AUD",
  "forum": "General Discussions",
  "tags": [
    "australia",
    "Canberra",
    "competition",
    "General Discussions",
    "spec",
    "speculative"
  ],
  "content": "A [competition](http://web.archive.org/web/20131013200308/http:/www.canberra.edu.au/typeface)\n\n> …  \n> the University of Canberra has launched The Canberra Centenary Typeface Design Competition - an international challenge to the world’s finest typeface designers to capture the style, spirit, prestige and character of Australia’s capital city.\n> \n> The winning design, which will receive AUD$10,000, will be selected by a jury of distinguished Typographers and Designers.  \n> …\n\nWhat does Typophile think of this? Anyone plan on entering?\n\n",
  "author": "oneweioranother",
  "time": "23 Mar 2013 — 4:33am",
  "uid": "16341",
  "comments": [
    {
      "time": "23 Mar 2013 — 9:35am",
      "content": "[http://typophile.com/node/101598](http://web.archive.org/web/20131013200308/http:/typophile.com/node/101598 \"http://typophile.com/node/101598\")\n\nI have trouble stopping myself from competing in anything, but the entry fee might be a deal-breaker for me. I _do_ have a sneaky plan for a low-effort entry with a decent chance, but before I commit I need to know who the jury is.\n\nhhp\n\n"
    },
    {
      "time": "23 Mar 2013 — 9:45am",
      "content": "How is this not a spec work?\n\nIn the end, there's 1 winner and a bunch of losers. So the organizers effectively ask all but one participant to work for free. So just ask yourself if you want to get involved with people that think this is an acceptable arrangement (even if you are OK with not winning and writing off the time spent on this).\n\n"
    },
    {
      "time": "23 Mar 2013 — 9:41am",
      "content": "Should we boycott the Olympics too?\n\nhhp\n\n"
    },
    {
      "time": "23 Mar 2013 — 9:49am",
      "content": "Don't get me started on Olympics.\n\n"
    },
    {
      "time": "23 Mar 2013 — 10:52am",
      "content": "OK, what about an ice hockey tournament? Do you really believe that any kind of competition is bad?\n\nI think spec work is bad for only part of the design industry: the establishment, that wants to make sure there are affordable beginners to recruit (read: indenture) who are not afforded shortcuts to success. To me that's worse than an organization allowing non-establishment people to potentially get taken advantage of.\n\nThe main problem with things like this is usually that the people choosing the winner suck. But that's fixable to a good extent.\n\nWhat do you think about how Oak Knoll arrived at its new logo?\n\nhhp\n\n"
    },
    {
      "time": "23 Mar 2013 — 10:20am",
      "content": "I'm opposed to spec work too, although in this case I assume that losing entries would still be marketable fonts, unlike many design contests (like designing a poster for an event) where a losing entry can't easily be repurposed.\n\nI can understand the appeal of a contest to someone just starting out, or if there's a big prize (which isn't typical), but in general spec work is an odd setup that's virtually unheard of in other professions. If you asked ten accountants to do your taxes and you'll only pay the one who got you the biggest refund, you'd get laughed at. Same thing in most other professions. Professionals should be paid for their work.\n\n"
    },
    {
      "time": "23 Mar 2013 — 10:33am",
      "content": "Ah, but other professions do have things like price-matching; for example in tax preparation some outfits \"guarantee\" a maximum return. In any field there are different ways people compete. Design is not particularly \"corrupt\".\n\nProfessionals should be paid for their work when they insist on being paid for their work. Some of them willingly give up guaranteed pay for the chance to compete for something better.\n\nhhp\n\n"
    },
    {
      "time": "23 Mar 2013 — 10:38am",
      "content": "> OK, what about an ice hockey tournament? Do you think any kind of competition is bad?\n\nDecided by jury?\n\nIt's pathetic to see a capital city beg for entry fees. No Australian company would want to front this effort? But on the other hand since the city itself was designed via an international design competition I guess it's in keeping with what little tradition it has.\n\nn.\n\n"
    },
    {
      "time": "23 Mar 2013 — 10:44am",
      "content": "What do you mean, jury? Yes, there's a jury. Do you think a jury is necessarily bad? Even a footrace has a jury (the guys watching for violations).\n\nBut I agree that having an entry fee is not OK.\n\n> No Australian company would want to front this effort?\n\nWhy limit it like that? Do you refuse work outside Vancouver?\n\nBTW, do you think the design of Canberra is flawed in some way? Without specifics (which I don't expect somebody with zero city-planning expertise to be able to point out) you can't complain.\n\nhhp\n\n"
    },
    {
      "time": "23 Mar 2013 — 11:04am",
      "content": "Battlefields of engagement decided by jury ...what a concept. Perhaps with social media they already are.\n\nOne's own skill (or a team's skill) decides the outcome on the battlefield of engagement. But where one cannot directly engage the opponent then sure, jury/committee decision is a tried and true way. But who then sits on the jury?\n\nAs far as planned cities go I'm of a Usonian theory of 'grandeur'. And without you having any apparent depth of architectural understanding Hrant, it's best for you to leave it at that ...and simply enjoy a ride with Google :)\n\nn.\n\n"
    },
    {
      "time": "23 Mar 2013 — 11:01am",
      "content": "\\> In any field there are different ways people compete\n\nCompetition and price matching, sure, but that's not the same thing as working for free in the hope of \"winning\" and getting paid for your time.\n\n"
    },
    {
      "time": "23 Mar 2013 — 11:14am",
      "content": "I find the idea that every moment spent must result in material gain very peculiar.\n\nSpeculation is part of life. Think deeply about why the design establishment opposes it.\n\nWe're very lucky that \"spec work\" in type design almost always results in something supremely re-usable. This marks another big difference between type design and graphic design; we make _tools._\n\nhhp\n\n"
    },
    {
      "time": "23 Mar 2013 — 11:36am",
      "content": "_It's pathetic to see a capital city beg for entry fees._\n\nNote that this competition is not being organised or even endorsed by any government entity: it is an initiative of the University of Canberra. This means, of course, that not only is it spec work that you have to pay to have considered by the judges, there is no guarantee that the winning selection will ever be used in any official capacity as the typeface of the city, although the university will assume 'an exclusive, royalty-free and irrevocable license in perpetuity' for the so-called winner.\n\nHrant, the design _profession_ opposes spec work because it undermines the profession as a whole when people work for nothing. It creates an environment in which customers and clients expect and then demand free work. It encourages the structuring of what should be fairly paid creative labour as 'competitions', which are simply a way for corporations and other institutions to avoid paying proper fees to designers (and in some cases actually collect fees from them!)\n\nYour attempts to draw parallels with sporting competitions do not work, because generally speaking athletes are not being asked to invest in training, practice, equipment, etc. in order to participate in competitions: they are doing these things for the sake of participation in their chosen sports and the competitions exist to provide a showcase. If the athletes are professionals, they are paid for their participation, not for winning (although in some sports there are bonuses for winners); if they are amateurs then they are not paid whether they win or not.\n\nA better parallel would be this: ten people pay a fee to be allowed to work in a restaurant kitchen, they all work a nine hour shift, and then the chef decides which one of them will be paid. That should sound ridiculous, but something like it probably happens -- perhaps advertised as a 'competitive internship' --, because businesses are constantly trying to organise the labour market in a way that suits them rather than suits workers. To which I say ORGANISE! ...and if that means that professional design associations, like other forms of guild or union, prevent their members from engaging in spec work, that's a fair restriction to make for the good of the profession.\n\n"
    },
    {
      "time": "23 Mar 2013 — 11:56am",
      "content": "> there is no guarantee that the winning selection will ever be used in any official capacity as the typeface of the city\n\nOh, you mean like Unger's Capitolum and LettError's Twin? :-) Note BTW that Capitolum now has a great life. Any \"losing\" font from this competition could too.\n\nYou explain yourself well, but I just don't buy that official party line (and I don't think you should equate \"the profession\" with all its members). I maintain that only the big boys (and those dreaming of being among them one day) really suffer from the existence of spec work. And the big boys determine what position AIGA etc. take.\n\nBTW, I think your restaurant scenario is just fine (it's just that kitchens aren't usually big enough for such parallelism; if they were it would save time). But the winner won't just be paid for those nine hours, he'll be given a job, presumably because he deserves it.\n\nhhp\n\n"
    },
    {
      "time": "23 Mar 2013 — 11:59am",
      "content": "I don't think uncompensated labour is 'just fine', and the fact that there are people desperate enough to engage in such competitions is simply evidence of the success of businesses in organising the labour market to suit themselves.\n\nYour notion that 'only the big boys' -- who they? -- suffer from spec work is laughable. If they're that big, they probably aren't suffering at all. The people who are suffering are always the people who are being taken advantage of and doing work -- work that contributes value or profit to someone else -- while not being paid.\n\n"
    },
    {
      "time": "23 Mar 2013 — 12:07pm",
      "content": "The establishment suffers because the shortcut to success threatens the pool of desperate but talented beginners who will work like slaves for cheap. _They_ want to be the ones to take advantage of the desperates!\n\nOrganize labor any way you want. But don't punish the non-peons.\n\nhhp\n\n"
    },
    {
      "time": "23 Mar 2013 — 12:16pm",
      "content": "BTW John, why not organize a font labor union that forbids free fonts? Don't free fonts \"create an environment in which customers and clients expect and then demand free work\"? At least this competition will be awarding good money.\n\nhhp\n\n"
    },
    {
      "time": "23 Mar 2013 — 1:19pm",
      "content": "I've certainly made the case to Dave Crossland and other libre font developers that they're serving the interests of corporations like Google far more than they are serving the interests of either their colleagues or of end users. Dave and I have had some good conversations about this, and I made the same case when he and some nice people from Google took me out for dinner at TypeCon last year. [I also think that webfonts will get a bad name from being used for tracking, but that's another discussion.]\n\n"
    },
    {
      "time": "23 Mar 2013 — 1:48pm",
      "content": "\\> the shortcut to success threatens the pool of  \n\\> desperate but talented beginners\n\nAn unemployed beginner wouldn't turn down a job at a design firm so he could continue entering spec contests. You can't make a living working spec; most of time you'll lose and get nothing, and contests with big payoffs are rare.\n\nProfessionals oppose spec work for a number of reasons, but I think the fundamental one is that if it isn't opposed it may someday become a common practice even with everyday jobs. Doing an occasional spec job in your spare time is one thing, but trying to work that way for a living isn't practical since you won't get paid for most of the hours you work.\n\n"
    },
    {
      "time": "23 Mar 2013 — 3:24pm",
      "content": "Of course you can't live on spec.  \nBut there are two \"good\" reasons design firms oppose it:  \n- When a beginner wins recognition, his price goes up.\\* The more than happens, the more money the firms have to spend hiring.  \n- A spec bid takes the place of a traditional bid = less money for the design firm.\n\n\\* It's the same reason many established design firms enter competitions, and brandish a win like a club.\n\nhhp\n\n"
    },
    {
      "time": "23 Mar 2013 — 4:27pm",
      "content": "Thanks John, shame on the University of Canberra for promoting spec work.\n\nn.\n\n"
    },
    {
      "time": "27 Mar 2013 — 6:38pm",
      "content": "FWIW, I had asked them who the jurors are, and here is the [relevant] part of their reply:  \n\"  \nMike Chandler, the doyen of Australian Typographers  \nRod Quinn, Editor in Chief of the Canberra Times newspaper  \nGemma Obrien, Typeface designer, illustrator and art director  \nMatt Johnson, Creative Director (and type lover) Grey Advertising  \n\"  \nA fifth juror is being selected/confirmed.\n\nhhp\n\n"
    },
    {
      "time": "27 Mar 2013 — 6:44pm",
      "content": "As a designer who studied and worked in Melbourne I've never heard of Mike Chandler…\n\n"
    },
    {
      "time": "27 Mar 2013 — 7:29pm",
      "content": "Well, Australia is not known for its typography. Which makes it hard -but not impossible- to find good jurors locally. What are some big[ger] names?\n\nhhp\n\n"
    },
    {
      "time": "29 Mar 2013 — 3:37am",
      "content": "[Stephen Banham](http://web.archive.org/web/20131013200308/http:/www.letterbox.net.au/),  \n [Dominic Hofstede](http://web.archive.org/web/20131013200308/http:/www.hofstede.com.au/),  \n [Mark Gowing](http://web.archive.org/web/20131013200308/http:/www.markgowing.com/),  \n [Stuart Geddes](http://web.archive.org/web/20131013200308/http:/www.chaseandgalley.com/),  \n [Warren Taylor](http://web.archive.org/web/20131013200308/http:/www.thenarrows.org/),  \n [Brad Haylock](http://web.archive.org/web/20131013200308/http:/www.bradhaylock.com/).  \n [Niko Spelbrink](http://web.archive.org/web/20131013200308/http:/en.wikipedia.org/wiki/Edenspiekermann)  \n [Dan Pike](http://web.archive.org/web/20131013200308/http:/www.theletterd.com.au/)\n\nI think might be better qualified – but probably less enamoured about judging \"spec work\"… There are probably a few more people in education who I'm not so familiar with.\n\nDan Milne & Wendy Ellerton are also t]m grads\n\n[edit: added links]\n\n"
    },
    {
      "time": "28 Mar 2013 — 10:10am",
      "content": "My fonts sell quite well in Australia and New Zealand, so there is obviously a highly informed typographic culture “down under”.\n\n"
    },
    {
      "time": "28 Mar 2013 — 4:04pm",
      "content": "Interesting. BTW have you noticed whether your sales are weak, average or strong in the Netherlands?\n\nhhp\n\n"
    },
    {
      "time": "28 Mar 2013 — 10:11pm",
      "content": "BTW it looks like the winning designer gains the rights to sell the typeface after three years. So the ~$10K isn't embarrassingly low after all.\n\nhhp\n\n"
    },
    {
      "time": "28 Mar 2013 — 11:48pm",
      "content": "Hrant, I’m afraid I don’t pay much attention to how my sales fare in different countries, so although I did notice Australia was good with one major vendor, I can’t say how Netherlands sales are in general.\n\n"
    },
    {
      "time": "29 Mar 2013 — 1:18am",
      "content": "[to follow]\n\n"
    },
    {
      "time": "29 Mar 2013 — 10:00am",
      "content": "_it looks like the winning designer gains the rights to sell the typeface after three years._\n\nThey changed the original terms of the competition, which were exclusive perpetual rights to exclusive rights for three years, doubtless in response to complaints from potential entrants.\n\n"
    },
    {
      "time": "29 Mar 2013 — 10:20am",
      "content": "Kudos to them for being responsive and reasonable. If they indeed got enough such complaints, I wonder if that means many people who are supposedly against \"spec work\" will now secretly enter... :-)\n\nNow if they can only be convinced to give back the entry fees in some generous way (see below); it's probably too late, but it would have been better to lower the award amount and do that.\n\n--\n\nI remain unconvinced that \"spec work\" reduces overall earnings, especially in type design. Here's why:  \n- A typeface, being a tool and not an end-product, is eminently re-purposable.  \n- In this case the winner gets ~$10K for three years of exclusivity, which isn't bad for many people. Not every type designer lives in the West...  \n- Many organizations can't justify the sorts of budgets\\* that large studios demand (because they have a lot of expenses, like a clothing store in Beverly Hills versus one that sells the same stuff in Downey) but they can afford ~$10K. Imagine every city about the size of Canberra or larger paying for a typeface (that can be resold after a few years) - that's a lot of money coming into the field (it just doesn't end up in the pockets of the big studios). Remember, most people still think all fonts are supposed to be free...\n\n\\* I remember how people were outraged that British Airways paid $100K for their custom typeface.\n\nThis anti-spec talk reminds me of the classical delusion that font piracy has a large impact on income. There is no evidence, only protectionist paranoia, promulgated by the big players.\n\nAlso, I've been thinking about the entry fee, and there's actually a good reason not to make entry free: they would be swamped. HOWEVER there was a better way to handle it, so they don't look like cheapskates: pass along all the entry fees to the winner (or distribute it among honorable mentions) or donate it to SoTA, ATypI or a local typographic non-profit.\n\nhhp\n\n"
    },
    {
      "time": "29 Mar 2013 — 2:46pm",
      "content": "FYI, as part of the technical research I am doing for a new book on economics, I'm tracking \"spec work\" as it applies to several fields... in 2012, alone, an average of 4,695 graphic-design (which includes logo design) spec RFPs were issued per week throughout 7 countries of western Europe... and this is an increase of 425% from 2011. Median average compensation per transaction: 950 Euros. Dozens of web sites are emerging to exploit this growing trend...\n\nIf a car manufacturer solicits ideas for new energy saving technology, do they pay all the various companies, universities, or individuals who attempt to develop new technology, but were not ultimately chosen by the car manufacturer?\n\nWhy should anyone get paid for anything that ultimately is not used... whether the anything is technology, or logos or fonts?\n\nEven the advertising industry is evolving toward results-based compensation.\n\n"
    },
    {
      "time": "29 Mar 2013 — 4:25pm",
      "content": "“_If a car manufacturer solicits ideas for new energy saving technology, do they pay all the various companies, universities, or individuals who attempt to develop new technology, but were not ultimately chosen by the car manufacturer?_”\n\nIs that a rhetorical question? Of course they do. It’s called “funded R&D.”\n\nAnd if car a company _does_ put a shout out to the tune of “design us some parts, but if we don’t use them, you don’t get paid” that’s still garbage spec work.\n\nNot a single field in academia — that I know of — pure or applied, follows this spec-style practice. And if they do, this is a sad day for me indeed.\n\n"
    },
    {
      "time": "29 Mar 2013 — 5:18pm",
      "content": "\\> Why should anyone get paid for  \n\\> anything that ultimately is not used\n\nBecause they did the job they were hired to do.\n\nAnytime you hire a consultant — whether it's a designer, accountant, architect, business consultant, or whatever — there's a chance you won't like the results. That's why it's important to chose the consultant carefully. But as long as they meet the contract's specifications and do the job in a professional manner, they are entitled to be paid.\n\n"
    },
    {
      "time": "29 Mar 2013 — 8:13pm",
      "content": "I wonder what the percentage is of those who actually earn a living from responding to spec work and spec work alone?\n\nOut of 100 who take the bait ... how many go on to earn a living? Um ...only one?\n\nSo, what is the average response to those 4,695 RFPs per week that you cite? In total how many fools are there that fall by the wayside? Or I guess a better way to phrase it is ... In total how many fools are there that get run over by spec work.\n\nCan you imagine ... doing spec work all day for a month or two.\n\nThat's a tough way to live the dream.\n\nShame on the University of Canberra for promoting spec work.\n\nn.\n\n"
    },
    {
      "time": "29 Mar 2013 — 8:23pm",
      "content": "> Not a single field in academia — that I know of — pure or applied, follows this spec-style practice. And if they do, this is a sad day for me indeed.\n\nI would love to hear the response from the University of Canberra teacher's union when the entire student body issue RFPs for their courses.\n\nThen perhaps the University of Canberra would begin to get feel / taste for spec work! And they could give the potential profs a break ... by having only a 10 dollar submission fee.\n\nTurnabout is fair play ...no?\n\nSpec work ... live the dream!\n\nn.\n\n"
    },
    {
      "time": "29 Mar 2013 — 8:31pm",
      "content": "What's the percentage of people who play poker who earn a living playing poker? Since when is a person supposed to have only one way of making money? And since when is money the only reward?\n\nhhp\n\n"
    },
    {
      "time": "29 Mar 2013 — 9:26pm",
      "content": "Hrant, I hope every time there is the slightest chance of you doing anything at all ... you are denied payment after you have submitted the work. Sorry, but they simply chose someone else.\n\nThen go walk over ... because you can't afford transportation ... to the grocery store and tell them you'll pay them after you have eaten their food.\n\nAnd as for rent, hydro, internet, etc., etc...\n\nSpec work ... live the dream!\n\nn.\n\n"
    },
    {
      "time": "30 Mar 2013 — 2:32am",
      "content": "Some are missing the bigger picture here:\n\nWe've merely accepted and adopted the doctrine that anything that adds to the Gross Domestic Product of the marketplace is a good thing. But since automation has replaced human labor in the agriculture, mining, and manufacturing sectors, human labor has shifted toward services. Services now accounts for 72% of the global output. But exactly how effective is the output? Harvard Business Review published a paper, as an example, that showed US markets spending US$ 50 billion in \"change management consulting\" services... and that a full 70% of those services failed in their original objectives.\n\nThe reason services often fail in their objectives is that we live (and produce/consume) believing that \"quantity\" is the key of success. Quantity of apples. Quantity of cars.\n\nBut, in services... \"quality\", not quantity is the key to success. Problem is, we don't know how to do \"quality\"... we are still stuck in Marx's theory of \"labor value\"...\n\nAnd BTW, very little of today's US intellectual property originates from \"funded R&D\"... Stanford University, as an example receives no federal funding of consequence. The bulk of its funding comes from commercialized intellectual property (such as 2% of all IBM Global Services revenues). I wrote the business plan and contract.\n\nAnd, if I remember correctly, the Dutch retailer Designstoel24 a few months ago, ran a facebook campaign to redesign their logo:  \n [http://www.facebook.com/Designerchairs24](http://web.archive.org/web/20131013200308/http:/www.facebook.com/Designerchairs24 \"http://www.facebook.com/Designerchairs24\")\n\nAnd here is an example of crowd-sourced creativity:  \n [http://99designs.com/](http://web.archive.org/web/20131013200308/http:/99designs.com/ \"http://99designs.com/\")\n\nSo, how to compete with the future? Or, do you hold on tight to orthodoxy for as long as you can?\n\n"
    },
    {
      "time": "30 Mar 2013 — 9:23am",
      "content": "\\> But, in services... \"quality\", not quantity is the key to success.\n\nAre you implying that professional, experienced designers can't do quality work? That's news to the thousands of designers who make a good living and have happy clients.\n\nDoes a university pick the one \"best\" professor to pay in each department and the rest get nothing? Does a retail store pick the one \"best\" employee to pay and the rest get nothing? Of course not. People are hired to do a job and they get paid for their work.\n\nOrganizations asking for spec work think they are getting a great deal, but generally they aren't. Most participants will be beginners or designers having trouble making a living. A professional designer with a successful business has little reason to enter a contest. It's simply not a practical way to make a living. And rarely does winning a spec contest carry any prestige.\n\n"
    },
    {
      "time": "30 Mar 2013 — 9:23am",
      "content": "The reality is that you can't never pay people (although I will point out that in many countries -where people don't have a lot of expenses, and have family members who can support them- people do go unpaid for _months_ because it's better to go to work than simply offer your job to somebody more desperate) but you can certainly not pay them when they're initially proving themselves. As Michael implies, you have to adapt to reality.\n\nI think an organization can indeed get good results from spec work (hey, good results aren't even guaranteed when you hire a big studio, plus you've spent a ton more money) as long as they have qualified people choosing the winner. This is admittedly usually lacking.\n\nLet me ask -again- what do people think of the Oak Knoll logo? They paid $500 _store credit_ for it. It's peanuts, but it's better than not being able to afford Landor.\n\nAlso, again, when it comes to type design attempting a spec bid isn't very wasteful at all; unless it's a very unusual project the results are usually entirely re-usable. Plus remember, in this case it's only for three years.\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2013 — 9:53am",
      "content": "JamesM,\n\nI certainly do not imply that \"professional\" (insert any occupation here) do not do quality work. But Francis Ford Coppola once commented about \"professional\" film-making that he dreams of the day when “One day some little fat girl in Ohio is going to be the new Mozart.”\n\nSee short video clip here:  \n [http://www.youtube.com/watch?v=iSePbQVR284](http://web.archive.org/web/20131013200308/http:/www.youtube.com/watch?v=iSePbQVR284 \"http://www.youtube.com/watch?v=iSePbQVR284\")\n\nIn short, you need to get over your ego that you or anyone else is a \"professional\" and thus, better than some \"non-professional\"...\n\nThe world is full of Mozarts... and by the way... they are transforming the world...\n\nWatch out! THEY are coming !\n\nOh yeah... to neatly tie two threads together: Papyrus typeface may not be the preferred cup of tea by so-called \"professionals\", but I have yet to hear anyone from 20th Century Fox or even \"non-professional\" audience members complain that Papyrus was a crappy choice for the Poster design...\n\nQuality is in the eye of the beholder, not the artist.\n\n"
    },
    {
      "time": "30 Mar 2013 — 9:54am",
      "content": "> So, how to compete with the future? Or, do you hold on tight to orthodoxy for as long as you can?\n\nThe only orthodoxy worth bringing forward is the tried and true. Recognize exploitation for what it is and who it benefits and who gets run over.\n\nHow many people earn a living responding to RFPs day in and day out ...that's the proof. Our way of life ... that is the change of money for staple goods (ie food, hydro, etc.,) is built on the foundation that all people can earn a living.\n\nSo, answer the question ... how many people earn a living responding to RFPs day in and day out? Of those 4,695 RFPs per week that you cite ...how many of those who respond to those RFPs earn a living from doing spec work? That business 'model' is obviously unsustainable. Or else you would have answered the question in your favor.\n\nStop speculating! Stop exploiting the vulnerable in our society.\n\nAre your research services awarded via spec work?\n\nn.\n\n"
    },
    {
      "time": "30 Mar 2013 — 9:57am",
      "content": "> Quality is in the eye of the beholder, not the artist.\n\nPure 100% ignorance.\n\nn.\n\n"
    },
    {
      "time": "30 Mar 2013 — 10:07am",
      "content": "5star... not everyone's cup of tea, I understand, but go back to read Schiller, Kant, Hagel, and Burke... and each of these non-ignorant folks understood that there is a relationship between subject and object... it is the energy flowing between subject and object that determines beauty or sublimity...\n\nEven Michelangelo once commented that that his job was to chip away pieces of stone to reveal the art that God Himself had designed... the artist's job was, in his view, to get out of the way of God...\n\nLike I said, not everyone's cup of tea...\n\n"
    },
    {
      "time": "30 Mar 2013 — 10:19am",
      "content": "Michael, people don't have to explicitly complain about something for it to be bad. Papyrus wouldn't have been a bad choice if people complained; Papyrus _was_ a bad choice because it cheapens the end-result (since it's so over-used). Consider that Cameron paid $100K for a language to be invented for Avatar, and that made the movie better; nobody would have complained if he had just used English. But it was still a great investment. A custom -or at least rare- font would have been the same.\n\nNeil, we've been suffering _exploitation_ at the hands of the big studios for decades.\n\n> how many people earn a living responding to RFPs day in and day out?\n\nYou answer my stupid question (about playing poker) and I'll answer yours.\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2013 — 10:38am",
      "content": "Hrant, my question is not stupid ... but thanks anyway for trying to lower the discussion to your level.\n\nAnd I asked first... I still wait Micheal's answer ...sorry not yours because you're not doing the research, he is.\n\nIf you want the stats on poker payouts etc., get in touch with those who drive the industry.\n\nDid your grocery store accept your RFP?\n\nn.\n\n"
    },
    {
      "time": "30 Mar 2013 — 10:44am",
      "content": "oobimichael , the passage you cite is typical of Michelangelo who places himself as THE instrument of God. Hence the painting...\n\nSo ya, Van Gogh changed his brush strokes to appease spec work ... thanks for the laugh oobimichael!\n\nn.\n\n"
    },
    {
      "time": "30 Mar 2013 — 10:54am",
      "content": "5star... I think you are confusing a few different issues.\n\nFirst of all, we no longer live in an economy where we stick to Adam Smith's doctrine of mechanistic specialization and \"division of labor\"... it is entirely possible for someone to have multiple occupations, some being more full time, and some being part time...\n\nIt is entirely possible for a blue collar joe six pack type of person who on Monday is earning revenue from fixing someone's plumbing, and on Tuesday is earning revenue from creating a logo...\n\nThe concept of \"professional\" is old hat, man... get with the NEW program... diversify... live life... and contribute anything to anyone at anytime... no pretenses... no judgements... no ego... just true authentic service... where \"value\" is moment-to-moment...\n\nBTW, I am one of the weird folks who happened to answer an RFP which changed my life... you just never know...\n\n"
    }
  ]
}
