{
  "id": "101652",
  "title": "What's wrong with this? Chiseled C looks bad.",
  "forum": "Design",
  "tags": [
    "Chiseled",
    "effect",
    "illustration",
    "type",
    "Design"
  ],
  "content": "Dear Typophile\n\nI'm trying to use my mark as in an illustration, where I'd like the A & C part seem as if it was chiseled.  \nIf I may say so myself, I think my A is quite okay. But the C is driving me mad!\n\nI'd like to convey the effect in only two colours, and all the c's presented seems a bit off to me. Number 4, of course, is the most sketchy one. Just wanted your take on it, before I go on.\n\nbest regards  \nMads\n\n ![](http://web.archive.org/web/20140720164031im_/http:/typophile.com/files/acccc_4963.png)\n\n",
  "author": "mads",
  "time": "23 Mar 2013 — 5:17am",
  "uid": "1025",
  "comments": [
    {
      "time": "23 Mar 2013 — 5:26am",
      "content": "Sorry - this picture is better:\n\n ![](http://web.archive.org/web/20140720164031im_/http:/typophile.com/files/acccc_6441.png)\n\n"
    },
    {
      "time": "23 Mar 2013 — 6:30am",
      "content": "With the \"A\" I can understand how the light is hitting it, with the \"C\" I can't. You were maybe approaching that with #4, but the logic isn't consistent yet. I'd need to see the implied peak running through the spine of the letter for it to make sense.\n\n"
    },
    {
      "time": "23 Mar 2013 — 8:16am",
      "content": "Are they supposed to be inset (engraved) or outset (relief)? Judging from the shading on the A it appears outset (which is fine, as long as that's the effect you want).\n\nWith the C you seem to be having trouble visualizing which direction the light is shining from. Going by the A it seems to be shining from straight above (12 o'clock), so in that respect #1 is actually closest to the right track. But you need to rethink the transition of shading from one side of the curve to the other. Try starting with an angled transition as follows:\n\n- On the outside curve, a transition in the \\ direction, from dark to light, with the inner end starting at about 7 o'clock.\n- On the inside curve a parallel transition from light to dark, with the inner end starting at about 11 o'clock.\n- The outside ends of these two angled transition should both hit the edge of the letter at 9 o'clock.\n- During this transition, the centre spine will be unmarked (invisible).\n\nThat'll give you the basic idea. Then you'll obviously want to tweak the angle of the transition so that it appears to reflect the curve of the letter (rather than being a straight line).\n\n"
    },
    {
      "time": "23 Mar 2013 — 9:50am",
      "content": "Light, shmight.\n\nhhp\n\n"
    },
    {
      "time": "23 Mar 2013 — 10:27am",
      "content": "Your first one is close to how I would do it. I would also add a shadow in the ball terminal, like this:\n\n ![](http://web.archive.org/web/20140720164031im_/http:/typophile.com/files/acccc_6441_5637.png)\n\nI would also tend to do the shadow transitions on curves at 45 degrees. For this kind of effect, it tends to look better if the light is coming at a 45 degree angle, rather than straight vertically or horizontally. Those can work too, but you get less satisfying modeling of forms.\n\n"
    },
    {
      "time": "23 Mar 2013 — 4:04pm",
      "content": " ![](http://web.archive.org/web/20140720164031im_/http:/typophile.com/files/ball_4212.png)\n\nNo matter how you flip it, I suspect the ball terminal will give you problems. Why not change it to a vertical serif?\n\n"
    },
    {
      "time": "23 Mar 2013 — 7:43pm",
      "content": "Here are some references that may or may not help:\n\n[http://www.myfonts.com/fonts/castletype/shango-chiseled/](http://web.archive.org/web/20140720164031/http:/www.myfonts.com/fonts/castletype/shango-chiseled/ \"http://www.myfonts.com/fonts/castletype/shango-chiseled/\")  \n [http://typophile.com/node/84573](http://web.archive.org/web/20140720164031/http:/typophile.com/node/84573 \"http://typophile.com/node/84573\")\n\nHere is what I would do:\n\n ![](http://web.archive.org/web/20140720164031im_/http:/typophile.com/files/cshade_4565.png)\n\n"
    },
    {
      "time": "24 Mar 2013 — 7:39am",
      "content": "Thank you all for contributing - and in such a thorough manner. I admire quite a few of you, so I'm flattered you would take time to look at this. I also like that you all have a different take on it - makes me think that the task isn't easy :)\n\n@altsan - you're right: it actually does look outset. And I was in fact trying to do inset. Sadly, my lack of time and limited abilities will probably make me settle with this.\n\n@Mark Simonson & @Frode Bo Helland:  \nI like both of your versions, and have drawn inspiration from both of them. Thanks a lot!\n\n@Luma Vine: Thanks for the references - very helpful.\n\nThis is what I ended up with:\n\n ![](http://web.archive.org/web/20140720164031im_/http:/typophile.com/files/Sk%C3%A6rmbillede%202013-03-24%20kl_3883.%2015.27.13.png)\n\nbest regards  \nMads\n\n"
    },
    {
      "time": "24 Mar 2013 — 7:54am",
      "content": "The two top-right curves are malformed - too flat.  \nOtherwise it looks great (to me).\n\nhhp\n\n"
    }
  ]
}
