{
  "id": "101656",
  "title": "MyFonts – to get non-Latin sister sites?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Recently Nick Shinn proposed [(here)](http://web.archive.org/web/20130817162649/http:/typophile.com/node/101331) a Greek version of MyFonts, in order to make Greek fonts better accessible for users of Greek. I found that a very interesting suggestion and asked John Collins of MF, if this vision could become reality.  \nHe answered, I take the liberty to cite from his message: “we have not been able to convince ourselves that the cost of making MyFonts available in any other languages would produce a reasonable return on the investment. If that changes, we will of course move in that direction.”  \nAs reasonable as this sounds, I still wonder if there could be a chance to see a hellenic MyFonts site come into life. Or perhaps, something similar to [MyFonts.de](http://web.archive.org/web/20130817162649/http:/www.myfonts.de/) which is a kind of MF digest journal adressing German readers.  \nThere are currently over 200 fonts listed when the tag ‘Greek’ gets clicked. I believe they would sell more if they would be visible in a Greek language environment. It’s not just for Greeks in Hellas or Cyprus but also for the many scholars in Greek studies worldwide.\n\nLast but not least, the same question arise for Cyrillic; maybe for other script systems as well in the future?\n\n",
  "author": "Andreas Stötzner",
  "time": "23 Mar 2013 — 12:34pm",
  "uid": "17347",
  "comments": [
    {
      "time": "23 Mar 2013 — 3:36pm",
      "content": "It's like choosing a foreign language to learn for doing business: you learn one that has an affluent population with low penetration of the languages you already know. So for example I'm sad to say that an Armenian version of MyFonts doesn't make sense in at least three ways: we don't spend a lot of money on fonts; we all know a second -major- language; and we almost all know a _third_ language that's bigger than ours. :-) And frankly a Greek version of MyFonts doesn't make a lot of sense to me either.\n\nhhp\n\n"
    },
    {
      "time": "23 Mar 2013 — 8:34pm",
      "content": "Even Parachute.gr is English only.\n\n"
    },
    {
      "time": "24 Mar 2013 — 12:09pm",
      "content": "No one is stopping you.\n\nIt may not make sense for TYPE to do it, but an individual could set up a country specific type site fairly quickly at minimal initial cost and with some hard work may be able to make decent money.\n\nMay I suggest you treat the designers of type well? Say, 70% royalty rate?\n\n"
    }
  ]
}
