{
  "id": "10160",
  "title": "Alchion design lab businesscard",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "This is the business card for my studio Alchion Design Lab (formerly Design Alchemy). Fonts used are Wedding Sans (modified) and Normetica (modified). I did a set of old style numerals based on Wedding Sans, as well as new @ symbol based on my logo+ a few alternate characters.   \nColor-Orange will be custom mix of flourecent and standard orange, this will be more vibrant that straight orange but not quite flourecent (I have not done this type of tweak in orange yet, but it worked well last time I did this type of mix in yellow.   \nPaper is still a consideration- I like Yupo and well as Touch\n\n",
  "author": "designalchemy",
  "time": "6 Apr 2005 — 10:59am",
  "uid": "804",
  "comments": [
    {
      "time": "6 Apr 2005 — 11:21am",
      "content": "here is a detail shot...   \n ![Alchion Desing Lab business card detail](http://web.archive.org/web/20150415105336im_/http:/www.typophile.com/forums/messages/29/69004.jpg)\n\n"
    },
    {
      "time": "10 Apr 2005 — 5:59pm",
      "content": "I have a similar logo (the way it looks on my business card if you take off the 3d effect) and layout for my personal identity. I like the simplicity. I don't think you need the web address since you have an email. It is obvious you have a domain and if people want to put out the effort to look you up they won't have a problem.   \n   \nI don't like the line between the icon and type. It feels uneccessary. A solution may be to make your icon black and alchion white. If you do decide to use a line make it go straight up. It is fighting with the icon being diagonal.   \n   \nI would like to \"design\" spread under Alchion to the exact width. It feels too small and since the type is leaning against the icon it seems justifying it to the right doesn't seem---right.   \n   \nI don't know if any of these suggestions will work, I would just like to see more options.\n\n"
    },
    {
      "time": "11 Apr 2005 — 1:46am",
      "content": "I think the diagonal looks pretty good the way it separates the icon from the address info, so I'd keep it.\n\n"
    },
    {
      "time": "11 Apr 2005 — 2:26am",
      "content": "I'd suggest you move the 'Logo' on the back for about one or two mm to the bottom ... it looks a little 'lighter' than the text and therefore needs a stronger relation to the bottom.   \n   \nbesides that i kinda like your design ... although it looks very 'techy'\n\n"
    },
    {
      "time": "11 Apr 2005 — 4:36am",
      "content": "I'm with Tom on the diagonal line.   \n   \nCould you have the ole@ in one color and alchion.com in a different color? So that even the dimmest client could realize what your site was.\n\n"
    },
    {
      "time": "13 Apr 2005 — 1:19pm",
      "content": "Thanks for the advice. My intention with using the diagonal was   \npartial stylistic, and part practical. It seperates the information and serves as a \"loader\" on my site (which is still in the works) by sliding back and forths as information loads (using flash). I am taking Tom's advice however and will post various versions later today showing color as being switched as well as the diagonal gone and straight. back on the diagonal topic, I have notices a few sites that use diagonals as shading and loading-example a inch or so of repeating small diagonal stripes even animated. When was this micro-trend started?\n\n"
    },
    {
      "time": "13 Apr 2005 — 7:47pm",
      "content": "I think the line would work if you made it entirely vertical.   \n   \nI went to your website and I expected it to be more of the style of your card. Your card has a very clean tech feel and the website has so much going on with no definitive logo. I would make your card look more like your website with type going vertically and horizontaly, or make your website look like your card (which I would prefer to see) with a clean style. I know you aren't finished with it yet, but I just wanted to throw that out.   \n   \nOne more thing- I see what you are doing with the corners of your card, making them the same shape that is in your logo. I think it may come off the viewers like the printer did a poor job of rounding the corners instead of noticing it has the same edges as the icon. I would just round them off. It will be cheaper also.\n\n"
    },
    {
      "time": "14 Apr 2005 — 9:22am",
      "content": "Here is a series on mods starting with flash screen shots of the   \ndiagonal line (discussed in past posting) in use for loading logo   \nand (not shown) used in loading menus and portfolio. ![alchion diagonal loader](http://web.archive.org/web/20150415105336im_/http:/www.typophile.com/forums/messages/29/69742.jpg)\n\n"
    },
    {
      "time": "14 Apr 2005 — 9:49am",
      "content": "Here is the first card mods.   \nI find that when I make the \"Design Lab\" same width as   \n\"Alchion\" by inceasing letter size (vs.spacing letter out), that they do not blend well together, the problem seems to lessen if the \"ALCHION\" type is lower in height. I have experimented with re-cutting the \"ALCHION\" letter to lower verticals and leaving horizontals intact ( a few optical adjust ments were made in the process as well).   \n ![Alchion letters](http://web.archive.org/web/20150415105336im_/http:/www.typophile.com/forums/messages/29/69745.jpg)\n\n"
    },
    {
      "time": "14 Apr 2005 — 10:14am",
      "content": "Here is a closer look at the issue of height discussed in previous post.. ![height](http://web.archive.org/web/20150415105336im_/http:/www.typophile.com/forums/messages/29/69751.jpg)\n\n"
    },
    {
      "time": "14 Apr 2005 — 10:29am",
      "content": "3 more card versions.   \n ![3 more cards](http://web.archive.org/web/20150415105336im_/http:/www.typophile.com/forums/messages/29/69759.jpg)\n\n"
    },
    {
      "time": "14 Apr 2005 — 11:13am",
      "content": "Here are the 3 more versions. Most changes on these wereTom's suggestions. It is always good to experiment, and I think I have to say I still like the slanted line vs. the straight vertical.   \nCorners will be angular as shown as I have already ordered a   \ncustom portfolio case to be fabricated with these angles. As for the printing. round is usually a lot less, but have mu sources and   \nget the custom die very inexpensively.   \n ![3 more versions](http://web.archive.org/web/20150415105336im_/http:/www.typophile.com/forums/messages/29/69767.jpg)\n\n"
    },
    {
      "time": "25 Apr 2005 — 7:04pm",
      "content": "I prefer the asymetrical logotype, though I would align the left edge underneath the H in Alchion. And I would ditch the unicase. That lower case e and n are bugging me. See what an all caps DESIGN LAB looks like. I just don't like the discontinuity between the two N's.\n\n"
    },
    {
      "time": "29 Apr 2005 — 2:20pm",
      "content": "i really like the design. really good road you're on.   \n   \nok ... i'm not a fan of your letterspacing ... i think \"alchion\" would need some fine retouching .. especially between the ALC ... the rest seems kinda fine. And I'm really not sure about the design lab with incredibly spaced kerning. Especially not in the adresse and phone number like on one of the examples. Coz now it kinda looks like little non readable dots ....... maybe a little bigger type... or a different type.... but i would work on that ...   \n   \nAnd a last thing ... maybe it's my screen ... but i don't like the Orange color ... has too much magenta in it ... looks like a salmon color.\n\n"
    },
    {
      "time": "29 Apr 2005 — 2:21pm",
      "content": "i really like the design. really good road you're on.   \n   \nok ... i'm not a fan of your letterspacing ... i think \"alchion\" would need some fine retouching .. especially between the ALC ... the rest seems kinda fine. And I'm really not sure about the design lab with incredibly spaced kerning. Especially not in the adresse and phone number like on one of the examples. Coz now it kinda looks like little non readable dots ....... maybe a little bigger type... or a different type.... but i would work on that ...   \n   \nAnd a last thing ... maybe it's my screen ... but i don't like the Orange color ... has too much magenta in it ... looks like a salmon color.\n\n"
    },
    {
      "time": "30 Jun 2005 — 11:34am",
      "content": "I like what you first posted the most. I like the die cut, matches the mark.\n\nthe diagonal line works better due to how it relates with the mark.\n\ndon't letterspace DESIGN LAB under the logotype. At least not for this one.\n\nAnd I'm right there with you on not needing the URL...I always try and talk my clients (at least some of them) out of using it if there's an email.\n\nI like the salmon, what's the pms?\n\nI second ecco's comments on the logotype. Loosen the LC or tighten the AL. Perhaps the logotype could use some more love. You have some diagonal angles that aren't being incorporated into the letters.\n\ngood work though. if tech modern is what you are aiming for, then bullseye to you\n\n"
    }
  ]
}
