{
  "id": "10167",
  "title": "HTF Didot vs. Linotype Didot",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Can anyone tell me when small caps became a regular fixture of the typographic landscape? I am asking because I am in something of a quandry over which Didot to license for a personal project setting French poetry from the turn of the 19th century.   \n   \nI've narrowed my wish list down to either Linotype Didot (which has small caps) or HTF Didot (which has optical sizes). I'm leaning toward HTF Didot, but the absence of small caps strikes me as a limitation I would likely regret later... but perhaps NOT if it was standard period practice to use roman caps where today we would use small caps.   \n   \nThis question was prompted by a series of specimens on the H&F-J website in which the first line of a body of text was set in roman capitals - possibly implying that the designer was following period practice in not supplying small caps. For example:   \n   \n [http://www.typography.com/catalog/didot/light.html](http://web.archive.org/web/20150308211432/http:/www.typography.com/catalog/didot/light.html)   \n   \nI have already perused the very informative \"Which Bodoni\" thread from some time ago, which mentioned both typefaces very favorably, but am also interested in your thoughts on the specific tradeoff - given that the use I have in mind places a premium on \"authenticity.\"\n\n",
  "author": "Mark Foster",
  "time": "6 Apr 2005 — 2:05pm",
  "uid": "5237",
  "comments": [
    {
      "time": "6 Apr 2005 — 2:40pm",
      "content": "_Can anyone tell me when small caps became a regular fixture of the typographic landscape?_   \n   \nSmallcaps were very definitely part of the typographic landscape by the time of the Didot and other romantic types of the later 18th and early 19th centuries.   \n   \nMargaret M. Smith wrote an excellent essay for the Printing Historical Society journal (No.22, I think), on the 'pre-history' of smallcaps, tracing their development in early renaissance printing, beginning with the use of caps from smaller fonts, and progressing to properly designed smallcaps as we know them.\n\n"
    },
    {
      "time": "6 Apr 2005 — 3:14pm",
      "content": "Tiffany, I think that's a better way to fake small caps than simply reducing the size. In effect, that was what was done before proper small caps were made since optical sizing was the norm.\n\n"
    },
    {
      "time": "7 Apr 2005 — 11:19am",
      "content": "About typographical landscape, at the time of Didot, there was serious anti ligatures punchcutters -- Ren\n\n"
    },
    {
      "time": "7 Apr 2005 — 11:28am",
      "content": "Demoting ligatures fits perfectly with the Rationalist/Modernist ideology inherent in Didot.   \nBut I for one love ligatures.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2005 — 1:04pm",
      "content": "But surely Fermin Didot had royalist sympathies, otherwise he would have shouted \"off with their serifs\" and produced a sans serif typeface.\n\n"
    },
    {
      "time": "7 Apr 2005 — 1:08pm",
      "content": "Thank you all for your thoughts. But now, sigh, I've discovered Ambroise. Quel bijou!   \n   \nUnless I'm mistaken, Ambroise does not offer small caps either. Perhaps because it is intended more for display than for text?\n\n"
    },
    {
      "time": "8 Apr 2005 — 12:10pm",
      "content": "Since nobody, other than Didot, has figured out how to make his types work in text (one reason being that the digital revivals are all based on display models, not text models), why not use one of only three Didone types that actually do work in text? These are, Lange's Bodoni Old Face, Stone's ITC Bodoni, and Berthold's Walbaum STANDARD, a text font not to be confused with Berthold Walbaum BUCH which, in spite of its name, is a display font. I think all of these faces have small caps. In any case, the problem isn't having small caps. The problem is having a text font that actually works as a text font. Oh - and of course - the obvious digital choice for a Didone with a thousand bells and whistles: Kepler MM, with three unbelievably extensive axes (weight, width, optical size). Though I can't really say I like it, and although I don't think the optical axis has been well-implemented, and although it is of course a Didone rather than a Didot, it cannot be gainsaid that Kepler is the most flexible digital font ever made. It is less like having a typeface, more like having an entire type library. If you don't have a problem with the fundamental design, there is not a conceivable composition problem that it cannot solve.   \n   \nFinally I must say that the single ugliest bit of typography I have ever seen in my life was an issue of Serif magazine set in Hoefler Didot. Maybe there's a way of using it in text that works adequately, but if there is, Don Hosek sure didn't find it.   \n   \nIt is interesting that an easily usable text Didot (as opposed to a Didone) has never been revived in the entire history of type. That shows how difficult it is, and that it simply isn't an appealing task for designers and manufacturers. Didot's own text types are much more readable than anything we have seen revived but, looking at them, it is difficult to summon any great enthusiasm when his followers such as Bodoni, Walbaum, Prillwitz (whose work has been revived in a still very rare digital font) and the English school, have done such a much better job with text. Nevertheless, this remains an interesting unfilled gap. (I am sorry to speak of Didot as if there were only one but it is convenient to do so; in fact it is a dynasty with several key players and several different punchcutters with unique styles producing a wide range of continuously evolving and disparate designs from roughly 1780 to 1830.)   \n   \nThe Didot type usable at text sizes that I have been designing for a million years, without yet actually releasing, would not be describable as a Didone type, but as a French oldstyle-based transitional. In any case, it has never been a straight revival. There is a real need, especially in French publishing, for a usable text face that looks like a Didot but acts, as to legibility, like a Jannon.   \n   \nSomewhere I have a version of Adagio Didot that I attempted to optimize for text. It is stiff, amateurish and unconvincing in my opinion. But anyone who wants to have a look at this embarassing thing just has to email me. At the very least, it illustrates some of the problems of the genre. Isn't it strange that Frutiger didn't figure a way out of this problem? I wonder what the type was really intended for. Perhaps I haven't adequately studied it.\n\n"
    },
    {
      "time": "8 Apr 2005 — 3:46pm",
      "content": "\\> the digital revivals are all based on display models, not text models   \n   \n\\> In any case, the problem isn't having small caps. The problem is   \n\\> having a text font that actually works as a text font.   \n   \nAh, of course. And ironically the one Didot that was mentioned here that does have small caps - Frutiger's Linotype version - isn't on your list of workable text Didones.   \n   \n\\> why not use one of only three Didone types that actually do work   \n\\> in text?   \n   \nIf I tell you that one night years ago I had the extraordinary pleasure of staying in a very old ch\n\n"
    },
    {
      "time": "8 Apr 2005 — 4:16pm",
      "content": "Mark, re. Diderot, I have a set of pages from two sections (writing and alphabets), and can check the type used. I'll upload some photos shortly. If I recall correctly, the Diderot was not set in a romantic (Didone) type, although obviously there is a cultural relationship between the rationalisation of knowledge and the rationalisation of type design.   \n   \nAt the 1998 ATypI in Lyons, I spoke about Fournier's cataloguing of non-Latin writing systems in his Manual\\*, and likened it to Diderot's project. Cataloguing and organising knowledge -- even dubious knowledge, such as the supposed angelic alphabet -- was very much the programme of the day.   \n   \n\\* Most of Fournier's examples (woodblocks, not type) originate with the Breitkopf foundry in Leipzig, a reminder of the longstanding international nature of the type business. Thanks to James Mosley for bringing this to my attention.\n\n"
    },
    {
      "time": "8 Apr 2005 — 4:34pm",
      "content": "Oh yes, that would be wonderful! And I appreciate your comments about the rationalization of knowledge and of type design - and rationalization in general being de rigeur in those days. You've put your finger on one of the reasons for my abiding interest in the period.   \n   \nNot to be greedy, but would your 1998 ATypI presentation be available in a PDF, or for purchase? I should very much like to read it if I may.\n\n"
    },
    {
      "time": "8 Apr 2005 — 5:18pm",
      "content": "John is right to bring up Fournier for at least two reasons. First, there are some wonderful historical types there. Second, there is the issue he touches on indirectly, that it is not necessary, as to historical correctness, to set a book in a type exactly contemporaneous with its publication; it can easily and appropriately be set in one from say fifty years before. Mixtures of type shouldn't be out of the question either. For example, F.A. Didot & his collaborators created some extraordinary transitional types, but they were always rather large, 14 points at least. If a book set in these types also required a smaller type, Didot would use Jannon. This is hardly ideal, but it was certainly practised. (Fournier would have actually been a better choice than Jannon, one must say! But the Didots were terrible misers, it seems, and perhaps it would have cost too much.)   \n   \nAs to Fournier, there is no adequate digitization, and one is needed. However, given the excellence of Monotype's metal revival, which is especially impressive in the smallest sizes (the 8, or is it the 9 point? is absolutely gem like, a miracle of precision, readability and beauty, much more impressive than the larger sizes in my view), why not use that if the budget allows? There are some printers who can still do this, and the price might be surprisingly reasonable. It is hardly a seller's market.   \n   \nMark, you are right, it is astounding to handle these gems of 18th century French printing, which seem to leap from the page. The brilliance of the bookwork is often astounding to this day.   \n   \nYet much of this richness and impact can be achieved today by the simple expedient of employing a printer with a monotype. And just think - you won't have to worry about kerning, and bogus optical kerning systems. You just have the type.   \n   \nI really don't know why type enthusiasts don't focus a little more on throwing work the way of the printers who still use mono and linotypes. Can it be that few of us have any actual publishing projects? If so, one wonders, why on earth are we so interested? Isn't the final goal of it all to produce beautiful books?\n\n"
    },
    {
      "time": "11 Apr 2005 — 6:29pm",
      "content": "Mark, a truncated version of my ATypI 1998 paper is available in the member section of the ATypI website; however, this does not include the discussion about Fournier's cataloguing of non-Latin writing systems, which was introductory to my main topic, included as an historical parallel to the research project I had been doing for Microsoft that year.   \n   \nHere are the Diderot images though. As I remembered, Diderot did not set his encyclopaedia in romantic types of the Didot/Bodoni manner, but in more established baroque types:   \n   \n ![Diderot 1](http://web.archive.org/web/20150308211432im_/http:/www.typophile.com/forums/messages/30/69486.jpg)   \n   \n ![Diderot 2](http://web.archive.org/web/20150308211432im_/http:/www.typophile.com/forums/messages/30/69487.jpg)   \n   \n ![Diderot 3](http://web.archive.org/web/20150308211432im_/http:/www.typophile.com/forums/messages/30/69488.jpg)   \n   \nWhere the romantic style of lettering does appear is in the engraved plates, but remember that this is not type: the lettering is engraved in the plate. Of course, engraved lettering had a huge impact of the development on both neo-classical and romantic type design (Baskerville had been an engraver, and Bodoni was a writing master in the newly fashionable split-nib styles, still called 'copperplate' in Britain and North America in acknowledgement of its engraved origins).   \n   \n ![Diderot 4](http://web.archive.org/web/20150308211432im_/http:/www.typophile.com/forums/messages/30/69489.jpg)   \n   \n ![Diderot 5](http://web.archive.org/web/20150308211432im_/http:/www.typophile.com/forums/messages/30/69490.jpg)   \n   \n ![Diderot 6](http://web.archive.org/web/20150308211432im_/http:/www.typophile.com/forums/messages/30/69491.jpg)   \n   \n ![Diderot 7](http://web.archive.org/web/20150308211432im_/http:/www.typophile.com/forums/messages/30/69492.jpg)   \n   \nNowhere is this more evident, of course, than in the plates for _l'ecriture,_ where the fashionable romantic styles of writing are the only forms illustrated.   \n   \n ![Diderot 8](http://web.archive.org/web/20150308211432im_/http:/www.typophile.com/forums/messages/30/69493.jpg)\n\n"
    },
    {
      "time": "11 Apr 2005 — 6:32pm",
      "content": "PS. The photos make the paper look grey, which it is not. I didn't have time to adjust the colour in Photoshop.   \n   \nThe blank spot in the right column of the first image is not a printing error: a piece of wet paper from another sheet has become fused to this one.\n\n"
    },
    {
      "time": "11 Apr 2005 — 7:59pm",
      "content": "Absolutely stunning, and simply fascinating to see the two styles in juxtaposition!   \n   \nBased on what I see here, I could perhaps achieve a similar effect with Monotype Fournier (that f especially, also the b, p, q, v and others; but not the g, alas), which I already have, for the text. Since none of the digital moderns I can find online closely replicate any of these engravings, I suppose the door is open simply for something harmonious in the modern vein, for any ancillary material.   \n   \nAh, what fun. You and Bill and Tiffany have given me much to think about. Thank you so much for taking the time.\n\n"
    },
    {
      "time": "11 Apr 2005 — 8:59pm",
      "content": "On the subject of Fournier, does anyone have any specimens of Monotype Barbou? This was the 'wrong Fournier', produced by the Monotype works at Salfords, which Morison rejected in favour of Monotype Fournier. It was produced, and available for years, but I'm not certain that I've ever seen it. If anyone can post pictures, that would be splendid.\n\n"
    },
    {
      "time": "11 Apr 2005 — 10:50pm",
      "content": "I have the small specimen in Talley of Types, but I don't think it's really that good, and in any case I have lent the book to someone. The main difference is that it is slightly heavier than Fournier. I honestly think the 1970s Talley is overinked and does not show any of the MT types at their best. I realize that is a little heretical, but .... I also honestly think the best MT sizes are generallly in the 8-11 range, and then in the above 36 pt range. Anyway, there must be a better sample of Barbou than what I have. If I recall correctly, it was only cut in one size. Looking again at one of my favourite books set in Fournier, 'The Contemplative Life' by Sister Edna Mary, Penguin, 1968 (which is incidentally the first (and for that matter the only) book I have ever read to suggest that the Redeemer was clearly bisexual, a claim which for some reason raised no fuss at the time), I see that the thinness does cause colour and fitting problems. It becomes clear why revival is such a difficult task. One understands why MT had so much trouble with the digital revival, and left it until quite late, why Typoart made so many changes in its interesting adapatation, and why Carter started out with the assignment of making a Fournier revival and somehow wound up with Charter instead. Although I like Fournier's weight, I can now finally see why 'Barbou' would have been much easier to deal with and a better starting point. I can now finally understand Stanley Morison's point. There are so many Fournier types - is the Diderot one of them? It seems well within that style - post Romain du Roi, more practical, etc. However, the italic of Fournier is a straight copy of the italic of Romain du Roi as we all have posted a hundred thousand times in the past. So much for collective wisdom and the continuity of community. James Mosley had to print a book in digital Fournier and was unhappy; I attempted to revise it for him but was not successful - at that time I had some idea there was a problem but no clue as to what was really wrong, and James was not particulary good at explaining what was wrong. He just knew it was unconvincing. I do think the text type you show is too loosely fitted. I am not suggesting you do this, as it would be agony, but it would be so interesting to see a few lines of text in which one did some meticulous splicing to decrease the spaces slightly.\n\n"
    },
    {
      "time": "12 Apr 2005 — 1:33am",
      "content": "About favorite books typeset in Fournier, you might for fun check to see if your local bookstore has a hardcover copy of Precarious Life, by Judith Butler (Verso, 2004, ISBN 1-84467-005-8), which I purchased solely for the beautiful type - a combination of Fournier text and ITC Franklin Gothic headings. Personally, I would prefer to read more books in Fournier and fewer in Baskerville, but that's just my particular heresy.   \n   \nAs for my experiment in Monotype Fournier, so far it really seems quite crisp and workable in comparison with many other historic fonts in my digital library. And it even has small caps. ![:-)](http://web.archive.org/web/20150308211432im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "6 Apr 2005 — 2:45pm",
      "content": "I would suggest licensing Didot from H&FJ simply because it is G-O-R-G-E-O-U-S and I have used--as evil as this may sound--the optical weight in different sizes to fake small caps. Oh. Please don't hate me for that indiscretion.\n\n"
    },
    {
      "time": "6 Apr 2005 — 3:28pm",
      "content": "Excellent article suggestion, John. I had forgotten about that.   \n   \nMark, of course, I hadn't thought of it that way. I don't feel so guilty now. :^)\n\n"
    },
    {
      "time": "7 Apr 2005 — 1:11pm",
      "content": "Yes. I would say that Ambroise isn't the most ideal for text settings as the contrast is quite high and again, no smallcaps. I'd say your best bet is still H&FJ Didot.\n\n"
    },
    {
      "time": "13 Oct 2011 — 2:04am",
      "content": "Here at [http://johntranter.com/00/fournier.html](http://web.archive.org/web/20150308211432/http:/johntranter.com/00/fournier.html)  \nare three samples of various ways of typesetting a nineteenth-century French poet, Arthur Rimbaud. After a preamble concerning Fournier, there is an image of a scan of page 218 from Oliver Bernard’s excellent translation of Rimbaud’s Collected Poems. It was originally set by Clays Ltd, Bungay, St Ives, UK, in Monotype Fournier in 1965. The proofs were photographed and printed photo-litho.\n\nThen a modern setting of the same text in digital Fournier. Note how anaemic the font appears.\n\nThen the same text set in Corundum, a font cut by Joshua Darden in Brooklyn USA. The font has issues with InDesign, as it is not a fully OpenType font, but it works.\n\nI hope this helps.\n\nJohn Tranter, Sydney\n\n"
    }
  ]
}
