{
  "id": "101666",
  "title": "TypeDrawer?",
  "forum": "General Discussions",
  "tags": [
    "forums",
    "General Discussions",
    "typedrawer"
  ],
  "content": "This is strange, having to do parallel postings on the web, I don't like this bifurcation of the online type design community… what's up with TypeDrawers?\n\n",
  "author": "hashiama",
  "time": "24 Mar 2013 — 1:24am",
  "uid": "16341",
  "comments": [
    {
      "time": "24 Mar 2013 — 3:28am",
      "content": "Why do you HAVE to do double-posting? Different sites have different users and a different focus. And freedom of choice is a great thing about the internet. Typophile is probably the largest typography board on the internet, but it's a private endeavor with no “official” status. There is nothing wrong with having alternatives.\n\n"
    },
    {
      "time": "24 Mar 2013 — 5:47am",
      "content": "I had always assumed that typophile was a site for people working with and interested in type. There are more people professionally involved with type who are not type designers than who are. Then there are those, whatever their profession, with a general interest in type.\n\nSo far, at least from the people who post and the categories available, TypeDrawers, is primarily aimed at type designers. Typography for example, has only History and Education as subcategories. Nothing there for users, generally -- except, maybe, under \"business\" as as potential customers?\n\nSort of implicit in your post --hopefully unintended -- is that the non-designers who frequent typophile should go away.\n\n"
    },
    {
      "time": "24 Mar 2013 — 12:47pm",
      "content": "Ralf, you certainly have a point. But it's also not very efficient, because -unless you just want a social fix- you basically do have to post both places, and read both places. Also, I personally believe in freedom _from_ choice too! :-)\n\nNot everything on Typophile belongs on TypeDrawers, but I think everything on TypeDrawers does belong on Typophile... Which means it could have been some sort of sub-forum, at least in theory. But that wasn't meant to be, for a number of reasons.\n\nAlso, I value the mingling of makers and users that Charles mentions. I guess what some makers mind though is being distracted by the \"noise\" that non-practitioners can cause. On TypeDrawers, even when a post by a maker isn't \"tight\" enough, sparks fly.\n\nIn the end, some people are not open to changing their attitudes - they just want to get better/faster at what they do, and they don't want ideological confrontation to impede that. For others, things like this  \n [http://typophile.com/node/101331](http://web.archive.org/web/20150420123756/http:/typophile.com/node/101331 \"http://typophile.com/node/101331\")  \nare the best thing on the planet.\n\nBTW, in case not everybody knows this: I (along with at least one other person, but probably more) am not allowed to participate on TypeDrawers. One of the triggers was that I confronted the friend and former teacher of its owner on Typophile, when this person started \"digitally vandalizing\" Typophile, and randomly abusing members in the harshest manner. I felt it was my duty to try to stop that; I wish others weren't so detached. What's quite ironic BTW is that this person has been flagged a Troll six times on TypeDrawers, and I'm not even there! :-/ Looking for scapegoats is for weaklings.\n\nTo me TypeDrawers does fill a role, one that sadly seems necessary. However I don't respect its genesis (as others on TypeDrawers itself have actually opined) and I don't have faith in its owner on a number of levels. But none of that makes TypeDrawers pointless.\n\n> Typophile is .... a private endeavor with no “official” status.\n\nThis part I don't get. Is TypeDrawers any different? In fact isn't it _more_ private?\n\nhhp\n\n"
    },
    {
      "time": "24 Mar 2013 — 12:21pm",
      "content": "I think James's TypeDrawers is to be applauded ...I know first hand how hard it is to develop and maintain an online community. He's obviously feeling his way through ...take for instance his March 9th Real Name issue. Where was that insight when he first started to invite Typophiles???\n\nBut hey. I learn from most everybody. Although his forum doesn't allow the entire Typophile community to post up what they think is great about type and letter shapes in general, I still think it's a useful resource.\n\nLOL, I wonder how many TypeDrawer members look to their post's emoticons as a means of their own acceptance.\n\n+1 :) :( ;) -1 -1 -1\n\nn.\n\n"
    },
    {
      "time": "24 Mar 2013 — 12:39pm",
      "content": "I joined Typedrawers only recently, when there seemed a general lull in anything of any interest on Typophile and massive spam problems. That in itself, I think, explains part of the reason why Typedrawers exists: people who for various reasons were frustrated with Typophile wanted a different place with a different structure.\n\nSo far, I'm pretty happy with Typedrawers but it hasn't yet reached anywhere near the quality of Typophile at its best, but then neither has Typophile recently. I appreciate the focus on professional type design over there, and the absence of 'Can anyone tell me what this font is?', and I do think both forums are different and necessary. There will be times when the same topic -- the Canberra competition, for instance -- gets aired in both place, but I suspect this will happen less often than one might think, and it might be interesting to see the ways in which the actual discussions differ.\n\n"
    },
    {
      "time": "25 Mar 2013 — 6:54am",
      "content": "I think Hrant should be allowed to join TypeDrawers. It would be interesting to see how fast his Troll credits would rise. I'm actually surprised I only have 6. I just can't seem to piss 'em off like I used to.\n\n"
    },
    {
      "time": "25 Mar 2013 — 7:10am",
      "content": "However the value of your contributions has remained quite constant.\n\nhhp\n\n"
    },
    {
      "time": "25 Mar 2013 — 7:19am",
      "content": "Good to hear you are a fan!\n\n"
    },
    {
      "time": "25 Mar 2013 — 8:10am",
      "content": "[to follow]\n\n"
    },
    {
      "time": "25 Mar 2013 — 6:34pm",
      "content": "> Sort of implicit in your post --hopefully unintended -- is that the non-designers who frequent typophile should go away.\n\nAbsolutely not, I think people are free to go where they wish. I'm not troubled by the type of people on either forums.\n\nHrant, I've joined your club (momentarily!) I was banned for a short period of time because an Admin thought I was a troll…\n\n(\"offending\" threads: [one](http://web.archive.org/web/20150420123756/http:/typedrawers.com/discussion/comment/3916) and [two](http://web.archive.org/web/20150420123756/http:/typedrawers.com/discussion/comment/3904/))\n\n"
    },
    {
      "time": "25 Mar 2013 — 8:11pm",
      "content": "Well, I _do_ spot a troll on that first one! :-)\n\nhhp\n\n"
    },
    {
      "time": "25 Mar 2013 — 8:17pm",
      "content": "I seemed to have been kicked off typedrawers for a while too. I signed up again and they let me back in. Perhaps no one can believe that an actual person would do TrueType hinting.\n\n"
    },
    {
      "time": "27 Mar 2013 — 6:33pm",
      "content": "As it says in the READ THIS FIRST: \"The moderators know who the real experts are.\"\n\nJames Puckett (as far as I can tell the one and only moderator) has been in the field for about 4 years, and he knows exactly who knows what.\n\nhhp\n\n"
    },
    {
      "time": "28 Mar 2013 — 6:13pm",
      "content": "Experts? That leaves me out.\n\nSuch is life...\n\n"
    },
    {
      "time": "29 Mar 2013 — 1:33pm",
      "content": "BTW there seem to be threads on TypeDrawers that are invitation-only (I mean even for registered users) with apparently no mechanism to request an invitation... Can you say Old Boys Club?\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2013 — 4:04am",
      "content": "I don't speak for either forum, but only for myself. And I mall ears. What's up with coming from outerspace and thinking that your opinion of the bifurcation of any online community should matter?\n\nMaybe it sounds harsh, but one of the things that's clear in onlinedness of the elderly, when you hear the same ?s over and over and over: Don't you have search tools out there? And how long does it take for our posts to reach you?\n\n"
    },
    {
      "time": "29 Mar 2013 — 5:05pm",
      "content": "How can you search for something you don't know exists? People do browse.\n\nBTW doesn't everybody's opinion matter more than zero?\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2013 — 7:48am",
      "content": "The most worrying thing about Typeboard is that it's an autocracy masquerading as a meritocracy.\n\nFrom the site's Read This First page: <cite>Moderators are exempt from the rules</cite>. That's glaringly evident when you consider that despite the fact that ad hominem attacks are explicitly not allowed, they are happily tolerated when the subject is , say, Hrant. The whiff of hypocrisy is all over it.\n\n"
    },
    {
      "time": "30 Mar 2013 — 9:12am",
      "content": "Puckett's personal friends are also exempt from the rules sometimes. Only two of Montalbano's six Troll flags are visible; this is because the first four were quietly removed, but when the recording of Troll flags became an explicit issue (partially because he got two more, partially because he complained about not being able to mark any Troll flags himself, but possibly also because I brought up the issue here\\*) the _number_ was -again quietly- reinstated.\n\n\\* [http://www.typophile.com/node/52576#comment-545229](http://web.archive.org/web/20150420123756/http:/www.typophile.com/node/52576#comment-545229 \"http://www.typophile.com/node/52576#comment-545229\")\n\nNone of this makes TypeDrawers useless, but cronyism does make it markedly less useful, because some people have principles concerning what kind of people they associate with, principles that over-ride any benefit they might draw from participating. To be fair, there are also people who participate because they're vying -or at least hoping- for improvement. That actually describes my own participation on Typophile: loyalty makes me want to weather spam attacks, lack of ethics in the ID forum, and personal attacks. I would say this sort of \"family loyalty\" is somewhat lacking among creative people in general (partly because of difficulty handling criticism) and I feel this is strongly reflected in the genesis of TypeDrawers.\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2013 — 10:28am",
      "content": "Well, I am running a online-forum for over 12 years now and I can tell you from experience (like anyone else who runs a larger online discussion board) that a successful forum just needs to be an autocracy. Someone is paying for that board and maybe is putting in hundreds of hours of work every year to make it flourish. That someone needs to protect this work, even if that means deleting posts, banning members and so. Thousands of online boards work this way since the 1990s.\n\nI am convinced, that the demise of the reputation of Typophile over the last years was specifically caused by the fact, that no one here set and executed clear rules.  \nAnd this eventually lead to the creation of alternatives. So what? If you don't like the way those boards are run, don't use them. Move on. At best: don't even read the public forums there. Continue to use Typophile or any other board.\n\nBut do the users of this »house« really need to peak over the neighbor’s fence and complain about every step the people there are doing? That seems a bit childish. Especially since many users of TypeDrawers continue to be active here. It's just two boards. No one is at war. No one is fighting about profits or the most users. It's just people interested in typography and type design who like to exchange their thoughts. Live and let live.\n\n"
    },
    {
      "time": "30 Mar 2013 — 10:02am",
      "content": "<cite> […] when the recording of Troll flags became an explicit issue (partially because he got two more, partially because he complained about not being able to mark any Troll flags himself, but possibly also because I brought up the issue here*) the number was -again quietly- reinstated.</cite>\n\nThis is not true. You can mark comments as “troll”, but the number in your profile does not go down when those comments get deleted. Two of James’ troll-flags are by me – and he returned the favour – but his comments where so inappropriate and personal attacking that I asked the forum/moderator/Puckett to delete them alltogether. This is why four of the six are not visible anymore, neither are my two which were deleted with the same part of the thread, but they are still on the profile counter, though not influenced or “reinstated” by the moderator.\n\n"
    },
    {
      "time": "30 Mar 2013 — 11:21am",
      "content": "Ralf, I'm actually a monarchist - I don't believe in Democracy. But the King/Queen must be honorable. So I agree that there has not been enough moderator activity on Typophile; however an imbalanced application of rules has its own problems. And your \"live and let live\" doesn't really mesh with any of that.\n\nAnd there's nothing childish about worrying about the state of public discourse on type design; Typophile and TypeDrawers are both part of that, together (along with many other things). It's all related. And if you can't see the various levels of confrontation (maybe not a war, but certainly a network of battles) I don't know what to say.\n\nIndra, I can assure you that Montalbano's Troll count went down from two to zero; that's when I wrote my comment on that thread I mentioned; then it jumped to six after your two. So I actually missed what happened to the two in between, and I might be making an incorrect -if safe- assumption on those. But qualitatively two is still infinitely more than zero. BTW the point isn't to nitpick - the point is that the person who was a catalyst of the birth of TypeDrawers was himself a big part of the problem on Typophile; sadly some people prefer to demonize a single individual. And actually this person has been anti-online\\_fora at least since I first started, in 1998. Not everybody is fit for every kind of social interaction, and living with something one considers a necessary evil for too many years eventually explodes.\n\nAlso, marking somebody a Troll merely in retaliation should not be tolerated.\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2013 — 10:35am",
      "content": "Why would anyone mark a post they don't like as a \"troll.\" So you don't like it, get over it. Hrant seems like an honorable, honest, stand up guy, and I find that to be very annoying. Every time he goes off on yet another rant about No Mod clauses and giving back to the community, I want to scream. It doesn't mean I think he or anyone else should get demerits for their thoughts.\n\nBut, let me get this straight, at typedrawer, regular forum users get to set demerits? Are these reviewed by a moderator? And, each user can retaliate by setting demerits for his or her critic? That makes sense.\n\nSo, can anyone set their own restricted invitation only post?\n\n"
    },
    {
      "time": "30 Mar 2013 — 10:56am",
      "content": "Thanks for the kind words.\n\nBut does it makes sense for a moderator to allow a retaliatory Troll (or any negative) flag? I think those should be based on content.\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2013 — 11:07am",
      "content": "@hrant Either you are poking fun at me or my sarcasm needs polishing. No, it makes no sense at all. Any such system should be reviewed by a Moderator.\n\n"
    },
    {
      "time": "30 Mar 2013 — 11:16am",
      "content": "You said some nice things. Thank you. That's all. And I don't mind making people angry sometimes as long as I'm also making them think sometimes. I really hate cocktail parties.\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2013 — 11:49am",
      "content": "I meant about the issue of a demerit system. No Mod review and trolls in retaliation are a Bad idea.\n\n"
    },
    {
      "time": "30 Mar 2013 — 12:13pm",
      "content": "> I don't mind making people angry sometimes as long as I'm also making them think sometimes.\n\nHave you considered that what makes people angry is this, which looks very much like arrogance?\n\nIn the threads in which you make people angry -- by questioning their motivation or characterising them as blinkered or hidebound when their thinking disagrees with yours -- do you see any evidence that this results in thinking? It seems to me always to spell the end of discussion and, increasingly, devolution into name calling.\n\nIt seems to me that there are a wide areas of interaction between the polite banalities of a 'cocktail party' and people spitting at each other. I don't consider you always culpable, Hrant, in individual situations, but over the years you've built up massive credit in the animosity account which puts a lot of people on a hair trigger. If you know that you bring out the worst in people, and that they in turn bring out the worst in you, shouldn't you mind making people angry?\n\n"
    },
    {
      "time": "30 Mar 2013 — 6:37pm",
      "content": "John, that post is so 2005. As some people have noted, I don't anger people the way I used to. The relatively recent incident with the Jameses frankly I see not as my failure, but a failure of others, who didn't bother coming to Typophile's defense. Of course that's just my view, but it remains that my stance was not an act of aggression or even self-defense, but an act of defending a community I value.\n\nBut since the past isn't irrelevant, I'll try to address your major points.\n\nYou can't predict people's reactions. Or at least I can't. For example I can't figure out how what I wrote above could be considered \"arrogant\". It's not that I think angering people is OK, it's that it's often an unavoidable pothole on a worthwhile path - it comes with the territory of making people think (which does not mean those two things always coincide). At least where I come from (which I don't necessarily mean geographically or ethnically). Remember, we're from different -personal- cultures; your \"civilized\" is often my \"deceptive\".\n\n> If you know that you bring out the worst in people\n\nI don't see it like that. I bring out -unwittingly- what's inside, good or bad (including from myself). And/but we can then deal with it. To me the alternative _is_ essentially a cocktail party.\n\nI believe the key to fruitful discourse is always to focus on the content, not the style. Which, of course, is why I personally prefer text fonts to display fonts. :-)\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2013 — 7:27pm",
      "content": "As someone who literally just signed up just over two hours ago, TyperDrawer seems quite flawed with new users. I posted a topic about an issue with Webtype and how it seems they do not protect their product. David messaged me and told me that...well actually, read the post and then take a look at what he said.\n\nPost: [http://typedrawers.com/discussion/296/is-webtype-aware](http://web.archive.org/web/20150420123756/http:/typedrawers.com/discussion/296/is-webtype-aware \"http://typedrawers.com/discussion/296/is-webtype-aware\")  \nDavid's message: _removed_\n\nThe back-story of why I posted the discussion:\n\nI found that you can easily download Webtype's **entire library** for free. I tweeted them to make it aware (without compromising how it can be done) without any reaction or reply. Could I have emailed them? Sure but it isn't my responsibility. Therefore, it seemed that a) they don't care or b) they are aware of the issue and didn't want to respond in case others read through their tweets. Even then I would have at least emailed the person that found a loophole in my business. I was looking for discussion on the topic of why a distributor wouldn't use the basic methods of protecting their content.\n\nSo, in my opinion, it appears they heavily control what people can and cannot say. Like you're walking on eggshells to make sure you don't say/do anything that could result in a negative consequence. Seems quite limiting and overboard. Then again, China's method might work for some.\n\n"
    },
    {
      "time": "30 Mar 2013 — 7:10pm",
      "content": "Chris, I'm mostly with you (although I will note that it's a weekend, and Easter weekend) but it's not OK to post a private message in public (unless of course you already got David's permission).\n\nAnyway I think the Webtype issue deserves (and needs) to be a separate thread.\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2013 — 7:29pm",
      "content": "2005, Hrant? I was thinking of your fairly regular spitting contests with Michael, including some within the last ten days. As I wrote, I do not consider you always culpable, but given how you know these things will go I'm disappointed that you don't find a way to avoid them. Obviously, I would say the same to Michael.\n\nI agree entirely that the key to fruitful discourse is to focus on the content, but that is precisely why I get frustrated when you start speculating as to people's motivation and psychology instead of either engaging with the content of their ideas or acknowledging a disagreement in good faith. When you write 'I bring out -unwittingly- what's inside, good or bad', that looks to me like more of the same.\n\n"
    },
    {
      "time": "30 Mar 2013 — 7:42pm",
      "content": "hrant,\n\nForgive me for posting that (which I removed). I just found it very disrespectful what was said. As for the Webtype issue, I think I'll have a private conversation with them by email instead of dragging this out.\n\n"
    },
    {
      "time": "30 Mar 2013 — 7:53pm",
      "content": "Chris, you're right it was very disrespectful and very bold of him to say so. Has he tried to intimidate you over here?\n\nSorry I clicked on the link ...and no I didn't take a screen shot of it ...honest.\n\nn.\n\n"
    },
    {
      "time": "30 Mar 2013 — 8:04pm",
      "content": "> I get frustrated when you start speculating as to people's motivation and psychology\n\nAlthough I maintain that there is no separating what people state from where they're coming from, I actually haven't done that sort of thing much at all lately.\n\nMichael I think is a special case. For example when you use \"chirography\" it's no problem, but when I use it he thinks I'm taunting him. And if you look carefully you'll see that he's developed a nasty habit of stalking me, and I only offer token resistance, lest total silence is misconstrued. And I'm careful to totally avoid threads like this: [http://typophile.com/node/101770](http://web.archive.org/web/20150420123756/http:/typophile.com/node/101770 \"http://typophile.com/node/101770\")\n\nChris: I agree it was a bit domineering. BTW private conversations certainly aren't pointless, but there's also nothing like a public debacle to get a company (and others paying attention) to do the right thing, if a private approach fails.\n\nRemember, everybody strikes a different balance between business and culture.\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2013 — 8:05pm",
      "content": "Haha. I've never really had issues with anyone here except Nick. And those issues were merely Nick being mildly antagonistic.\n\n"
    },
    {
      "time": "30 Mar 2013 — 9:01pm",
      "content": "It's slightly disturbing that this topic has more responses than any particular topic about type. I suppose people are attracted to the drama of politics?  \nWhen I need an answer about, say, vertical metrics, or problems with a FL python script, I just go to wherever I think I might get the best answer.\n\n"
    },
    {
      "time": "30 Mar 2013 — 9:12pm",
      "content": "Ironic. A thread that started about “Why TypeDrawers?” has spiraled downwards into all but name-calling. Really?\n\n"
    },
    {
      "time": "31 Mar 2013 — 12:19am",
      "content": "That was always going to become what this thread is about.  \nAnd the fact that it’s happening here explains why Typedrawers exists—for type, not meta-discussion.\n\n"
    },
    {
      "time": "31 Mar 2013 — 5:34am",
      "content": "> If you have something to say to Webtype then contact them directly. Stop trying to create Internet drama around yourself.\n\nIs a bit antagonistic I agree.\n\nThere even seems to be a discussion about Hrant over there...\n\n"
    },
    {
      "time": "31 Mar 2013 — 7:22am",
      "content": "> I just go to wherever I think I might get the best answer.\n\nBut is the point only to get an answer for yourself? Sure that's the primary motivation, but it's very nice to also help create a \"library\" of answers/discussions for anybody to conveniently use. And one library is more efficient than two.\n\nChris (Dean), I'm actually not seeing a lot of name-calling, just frank criticism. That said -as a moderator- I think you should feel free to censure/censor anything.\n\nNick, to me such \"existential\" discussions cannot be separated from the cultural future of type; they can only be irrelevant to making more money (and only in the short term). And money isn't _everything_ to anybody. You can tell because even on TypeDrawers such discussions might be truncated, but they can't be entirely avoided.\n\nWei, that quote is quite disturbing; so is the closing of that thread. But I'll be nice and not air my speculations. I do hope that -if Chris (Burton) cannot resolve the issue in private- he does air it on Typophile, where it's safe.\n\nBTW Ralf (\"rhe\"), why are you so upset as to obfuscate your profile info?\n\nhhp\n\n"
    },
    {
      "time": "31 Mar 2013 — 7:28am",
      "content": "_removed_\n\n"
    },
    {
      "time": "31 Mar 2013 — 8:37am",
      "content": "> it's very nice to also help create a \"library\" of answers/discussions for anybody to conveniently use. And one library is more efficient than two.\n\nSurely you have to concede that, with search functions broken, it has been years since Typophile has been such an efficient library.\n\n"
    },
    {
      "time": "31 Mar 2013 — 8:42am",
      "content": "...and speaking of safety, don't ever forget that this site is just not safe for the vast majority of the type industry, for whom the endless anarchical and idle speculations, as well as topical hijacks, personal and business attacks, are unacceptable company, much less worthy of comment.\n\n\"And one library is more efficient than two.\"\n\nBut since there are zero \"libraries\", a half dozen type forums, and fifty other major sites related to type, the statement fails to even perch on speculation's searching shoulder.\n\nIt should also not be forgotten that these are the closing years of just the first generation of online forums. Finding a whole industry of perfectly self-moderating contributors who still stimulate each other, may take generations and a 1,000 forums. Meanwhile, thanks to Jared and Punchcut for everything they've done so far, none of this could have happened otherwise.\n\n"
    },
    {
      "time": "31 Mar 2013 — 9:18am",
      "content": "Google searching of Typophile was blocked for a few months (apparently due to a spam \"lock-down\" of sorts) but it's been up again for a few months now. I can find things pretty easily these days. You might say something like TypeDrawers can be searched via Google too, but quite often people look for something they know -or strongly suspect- is on Typophile (remember that it's by far the biggest repository, even if it's chaotic) they just need to locate it. So I put \"site:typophile.com\" in Google to narrow things down, and I'm set. Frankly it's not a disaster having multiple fora, but when it comes to the \"library\" concept it's not ideal either.\n\nDavid, I agree that Typophile is much more dangerous for business than something like TypeDrawers (and I alluded to that above). But maybe that's why Typophile seems better for cultural progress. That's not everybody's cup of tea, but nobody should think it should be nobody's.\n\nShould Typophile evolve? I love evolution a great deal, but there's no reason to throw out the baby with the bathwater. It's completely possible to \"re-configure\" all the built-up material and the -legitimate- membership. And is it crazy to suggest that the internal search can be fixed? Whether Punchcut is willing to do any of that is another matter. But if they're not, they just might be gracious enough to pass the baton.\n\nMost of all, I have zero faith in something like Twitter leading to any kind of progress. Without reading a great deal (and writing a good deal) all one can achieve is a deeper trench. What I do have faith in is loyalty, resilience, patience and open discourse.\n\nhhp\n\n"
    },
    {
      "time": "31 Mar 2013 — 10:46am",
      "content": "Ah, glad to see at least googling works again. It had been down for so long I had given up on it.\n\n"
    },
    {
      "time": "31 Mar 2013 — 12:54pm",
      "content": "Not surprisingly, Chris's Webtype thread on TypeDrawers just went poof. It was bad for business. Hey, there's no denying that business is very important. It's just better not to pretend. And thankfully Typophile is here to be our WikiLeaks.\n\nhhp\n\n"
    },
    {
      "time": "31 Mar 2013 — 2:51pm",
      "content": "\"It's just better not to pretend\"\n\nStrongly agree, get on with it then. These escalating delusions of the concept of a library vs what one finds through the search of a place, pretends that what one finds via searching is something that it is not. The delusion that a forum like this benefits from the verbal violence by making it less hospitable to business via it being a source of hidden secrets, that's pretend too.\n\nBut hey, its Forum Hrantus now. So, in a way, I'm hoping that typedrawers develops a broader arc of participants through peace, even if that happens to also mean having participation from the successful and humble who just can't stand it here.\n\n"
    },
    {
      "time": "31 Mar 2013 — 3:32pm",
      "content": "Why is it impossible for you to accept that people can have different objectives in life, and we each contribute things that makes type design not merely a financial rat race? Are the people who invite me to speak at conferences and pay me to consult on their non-Latin designs retarded? Should I get on your case that you prefer starting threads about conferencing software instead of sharing your insights in threads like this?:  \n [http://typophile.com/node/101331](http://web.archive.org/web/20150420123756/http:/typophile.com/node/101331 \"http://typophile.com/node/101331\")\n\nI don't believe Typophile would have been valuable to as many people in as many ways all these years if it were run the way you seem to want (which is not at all to say that it's perfect). It would have been more valuable to _you,_ but pardon the world for not being at your service. BTW, Typophile has been like this for many years now; why did it take so long for a \"business-friendly\" forum like TypeDrawers to be launched -by a beginner in the field no less- and in the \"closing years of just the first generation of online forums\"? Maybe because sharing insights isn't exactly a good business move... Could you reveal exactly how _you_ have helped people with _their_ businesses on TypeDrawers? Note: I'm not saying you must do so. Or is TypeDrawers really just a \"social fix\" tool? To some people Typophile is -at least partly- that. Which is OK, as long as we don't pretend.\n\nMost of all, I don't think making me the scapegoat just because I don't share your goals in life is honorable or productive.\n\nhhp\n\n"
    },
    {
      "time": "31 Mar 2013 — 8:03pm",
      "content": "> Not surprisingly, Chris's Webtype thread on TypeDrawers just went poof.\n\nI was banned.\n\n"
    }
  ]
}
