{
  "id": "101766",
  "title": "18c Script?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi! any ideas on this one please guys?.. There's an italic I'm having trouble with too.\n\nMany thanks, James.\n\n| Attachment | Size |\n| --- | --- |\n| [The-script.png](http://web.archive.org/web/20150418105529/http:/typophile.com/files/The-script.png) | 27.87 KB |\n| [Ales-Italic.png](http://web.archive.org/web/20150418105529/http:/typophile.com/files/Ales-Italic.png) | 22.86 KB |\n\n",
  "author": "James Eden",
  "time": "27 Mar 2013 — 5:39am",
  "uid": "10528",
  "comments": [
    {
      "time": "27 Mar 2013 — 7:19am",
      "content": "THE is Chopin Script, AKA Polonaise  \n - Herb\n\n"
    },
    {
      "time": "5 Mar 2014 — 1:51am",
      "content": "Even if some letters differ, Chopin Script is considered by many people here as a rip-off of Polonaise by Phil Martin. See [here](http://web.archive.org/web/20150418105529/http:/www.google.com/search?hl=en&source=hp&q=site%3Atypophile.com%2Fnode+polonaise+chopin) for previous discussions on this topic.\n\nEDIT: text edited after Herb's post. Was \"Chopin Script is a well-known rip-off of Polonaise\". Thanks Herb for the precision, was too hasty to conclude.\n\n"
    },
    {
      "time": "27 Mar 2013 — 8:47am",
      "content": "It depends on what one considers a rip-off vs. legitimate revivals. While Phil Martin designed Polonaise as photo lettering in the early 1970's , there is a Type Revivals digitization named Chopin Script TR with an internal creation date of 1992. The earliest digitization named Polonaise I can find is URW's from 1999.\n\nAFAIK, Claude Pelletier's Chopin Script (1999?) is based on the original printed design.\n\nI know that the 1992 date is accurate, because Soft Horizons/Vertisoft cloned the TR version as ChaseCallas in 1993.\n\nIf it's Phil Martin that was ripped off, who's to say that the digitized Polonaise is any less a rip-off than Chopin? Unless somebody KNOWS whether he gave permission, sold rights, or has an interest in any of these.\n\n- Herb\n\n"
    },
    {
      "time": "27 Mar 2013 — 9:22am",
      "content": "Chopin! Right. I'll look into that. Thanks!\n\n"
    },
    {
      "time": "27 Mar 2013 — 6:06pm",
      "content": "Thank you, Ryuk.\n\nhhp\n\n"
    }
  ]
}
