{
  "id": "10173",
  "title": "TYPO 13 - Continued",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "this is continued from:   \n [http://www.typophile.com/cgibin/show.pl?30/67250](http://web.archive.org/web/20050524130844/http:/www.typophile.com/cgibin/show.pl?30/67250)   \n   \nThe paper at this link:   \n [http://www.kringelbach.dk/papers/NI\\_Pammer2004.pdf](http://web.archive.org/web/20050524130844/http:/www.kringelbach.dk/papers/NI_Pammer2004.pdf)   \ntakes the discussion of the 'visual word form area' referenced in my \\_Typo#13\\_ contribution significantly further than McCandliss, et. al., (see my footnote #32). The interesting results, from a perceptual processing in reading point of view, are on pdf page 3 (1821). The 'discussion' is framed according to a 'letter recognitional' model of word recognition, so my conclusions--favouring a more direct 'visual wordform resolutional' model--might look somewhat different than those of the authors. But I post this here, because the 'understanding reading' discussion Hrant champions must be engaged at this level if we want to go beyond 'intuitive confidence' to 'grounded beliefs'.   \n   \nAlso important to this end might be the paper at this link:   \n [http://www.psy.vanderbilt.edu/faculty/palmeri/vita/pwg04-tics.pdf](http://web.archive.org/web/20050524130844/http:/www.psy.vanderbilt.edu/faculty/palmeri/vita/pwg04-tics.pdf)   \nThe paper provides a nice map of the presumed stages of visual information processing (and an interesting chart of 'representational changes' occurring with the development of perceptual expertise).   \nI include the link because of Hrant's earlier comments about where Kevin, Hrant and I stand in relation to each other. As I understand it Hrant differs from Kevin and myself in placing much (about 66%) of the burden of perceptual processing in reading on the far right path (relative to parafoveal material). Kevin and I take a greater interest in what happens on the left path (heading off of the retinal image) in central vision. Kevin and I diverge in our understanding of what happens at the 'component-tuned units' level and beyond.   \nMy previous post was an attempt to fill out my notion of what happens to 'word[s] n+1' when 'word n' is in central vision (and I had to sharpen somewhat my view of the left-hand side processes).   \nThe first paper linked to in this post focuses closely on the areas where Kevin and I diverge.\n\n",
  "author": "enne_son",
  "time": "Wed, 2005-04-06 20:04",
  "uid": "6083",
  "comments": [

  ]
}
