{
  "id": "10172",
  "title": "Law Office",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I don't usually post this early in my project, but I've got a serious issue that I need some help on. This is one for you intellectuals and ultra-business-minded communicators.   \n   \nI am struggling to even come up with a concept for my client because of the nature of his business direction (which we need not spend time debating here). He has decided to make a career alteration which will include returning to practicing law (mostly estate planning type stuff) and real estate brokering. In my experience developing solutions for both of these types of professionals, I have discovered many dynamics that are unique to each type. I am not successfully thinking of a concept that will satisfy both.   \n   \nI know that there are some great minds out there, so I'm hoping that some of you might have some stellar ideas on how to merge a legal practice and a real estate brokerage into one identity. Before I share any of my current considerations (which are weak) I will wait to hear your untainted response(s).   \n   \nThank you.\n\n",
  "author": "squeeze",
  "time": "6 Apr 2005 — 4:19pm",
  "uid": "2236",
  "comments": [
    {
      "time": "7 Apr 2005 — 4:42am",
      "content": "Scott, stick with a type solution. Take the high road with this one. Just use the firms' name and the abbreviation for Attorneys at Law. Use some elegant printing process for the stationary like blind emboss or foil stamp. Just some thoughts\n\n"
    },
    {
      "time": "8 Apr 2005 — 7:09am",
      "content": "I agree with Daniel. I'd err on the side of a lawyer identity. If you want or the client wants a mark, I'd go very, very subtle and even then tend towards typographic (monogram) designs.\n\n"
    },
    {
      "time": "8 Apr 2005 — 9:03am",
      "content": "Dan and Chris:   \n   \nI both hoped and expected to see posts from you. Thank you for the \"counsel\" (this job has put me in lawer mode). After abandoning an ambulance as an image, I developed some directions that are somewhat in line with what you've both suggested. I will create a primarily typographical logo which will probably, but not necessarily have some associated imagery that leans more toward the lawerly side.   \n   \nI spent a lot of time brainstorming to come up with an image, voice and communicated purpose for The Law Office of Gary Saunders. After a couple of hours of scribbling notes and sketches, I found a couple of directions that successfully merge these two business interests (law / real estate). The first direction, and the one that I favor, focuses on \"commitment\" (contracts, pen, ink, paper, etc.), with a visual emphasis on people and reliability. The second approach also focuses on \"agreement\", with a visual emphasis on handshakes and good old fashioned trust. I prefer the first, because it is serious and believable and the visuals I am coming up with are lawerly; while the second seems like it could be perceived as too old fashioned (handshakes are no longer trusted) and clich\n\n"
    },
    {
      "time": "8 Apr 2005 — 11:17am",
      "content": "With regard to printing, consider engraving. It has been classicly popular with Lawers for some time. It's a little more spendy, but will produce some great results. Results which are also difficult to reproduce cheaply in turn reducing the potential for fraud.   \n   \nHildebrant.\n\n"
    },
    {
      "time": "8 Apr 2005 — 11:39am",
      "content": "A couple of you have suggested some nice specialty production treatments that I did/do intend to implement. Now that I've started getting somewhere with the design direction, it definitely makes sense to do something like that. If anyone's interested here is a good source\n\n"
    },
    {
      "time": "8 Apr 2005 — 12:21pm",
      "content": "Scott can you get away with just: Gary Saunders LLC   \n   \nMake that the main emphsis and put Attorney\n\n"
    },
    {
      "time": "9 Apr 2005 — 2:22am",
      "content": "I was actually pushing for Saunders Law Firm, but it didn't fly. I'm stuck with the mouthful, however, I was able to eliminate the LLC, which clients could care less about.   \n   \nMy client paid me a visit today and saw the logo directions that I had posted earlier today, and he wants to push the third design, so that'll be the direction that I pursue from here on. Below is a JPEG rendering of a stationary suite utilizing that logo\n\n"
    },
    {
      "time": "11 Apr 2005 — 6:10am",
      "content": "That is pretty radical for a law office! But I like everything but the pen.\n\n"
    },
    {
      "time": "11 Apr 2005 — 8:27am",
      "content": "John (or anyone else):   \n   \nI am trying to convey the contractual agreement with the pen. Ya'know, the \"in ink\", \"on paper\", \"in writing\", thing. This lawer's service is primarily based on protecting assets, investments, transactions (primarily real estate), etc. This contractual agreement was one of the only things I could come up with that was common between the two businesses (law / real estate). Can you think of some other image(s) that might work better than the pen? Do you not like this pen, or any pen?   \n   \nMahalo!   \nScott\n\n"
    },
    {
      "time": "15 Apr 2005 — 10:29am",
      "content": "I love the pen! Gives it a bit of whimsy. Keep it bro.\n\n"
    },
    {
      "time": "15 Apr 2005 — 12:03pm",
      "content": "Here's what's goin' to print. I made a few tweaks, and there was some undesireable client intervention that brought it to this point. Personally, I preferred the first direction better.   \n   \nThe yellow represents the gold foil stamping that will accompany a lightly embossed logo. \"Lightly\" so that it doesn't significantly alter the surface of the backside.   \n   \n ![Saunders stationary](http://web.archive.org/web/20131020073004im_/http:/www.typophile.com/forums/messages/29/69866.jpg)\n\n"
    },
    {
      "time": "15 Apr 2005 — 12:46pm",
      "content": "Scott, just make sure that the gold stamping is compadible with their lazer printers or you might have a problem. Also Scott you know you are making custom envelopes for this project. To achieve that effect they have to be printed then converted. Its more expensive and takes longer to get done. As long as the client is okay with that its a moot point. Are you going to print that color on the envelope (Background) or is it a stock color from a paper swatch. As for the pen I like it.\n\n"
    },
    {
      "time": "16 Apr 2005 — 7:59pm",
      "content": "The problem I see with the pen is that it makes them look like a publishing company.\n\n"
    },
    {
      "time": "18 Apr 2005 — 10:01am",
      "content": "but it does seem like everywhere there is a pen, there's also \"the law office of...\" which makes it pretty clear it's \\*not\\* a publishing company...\n\n"
    },
    {
      "time": "18 Apr 2005 — 11:34am",
      "content": "I agree.. the context is there. The pen isn't too off radar for a law firm.\n\n"
    },
    {
      "time": "18 Apr 2005 — 2:11pm",
      "content": "\"The problem I see with the pen is that it makes them look like a publishing company.\"   \n   \nWell, except that the logo clearly states that it's a law office. ;o)   \n   \nI like it. Nice job.\n\n"
    },
    {
      "time": "18 Apr 2005 — 2:30pm",
      "content": "Well, my bad. The pen is \\*clearly\\* the way to go then.\n\n"
    },
    {
      "time": "20 Apr 2005 — 5:59am",
      "content": "Scott, nice work! (I fell off the radar for a bit, so this is the first I'm seeing of it.)   \n   \nI agree with Tom and John, I like everything but the pen. Part of it is the fade on the pen. It makes it look like pre-fab stationary to me. For a law firm, I envision a crisp image, with defined edges. Essentially, I see it as grey & fuzzy vs. sharp & clean, and the latter wins.   \n   \nSo, I'm not anti-pen, but I'm not feeling the execution. As it is, I think it'd be stronger without than with. The fountain pen is a good choice for a law firm, so I'd develop that. Perhaps make the body of the pen glossy, so you have reflections to work with in the mark to make it end cleanly? Not sure.   \n   \nIt's definitely interesting that the firm wanted such a visually active stationary set, but I wouldn't be surprise if law firms start to open up their visual identities a bit, as the twentysomethings of today become the partners of tomorrow. Again, Scott, nice work.\n\n"
    },
    {
      "time": "20 Apr 2005 — 3:52pm",
      "content": "\"The pen reads as \"author\" or \"writer\"\"   \n   \nIsn't that mainly what lawyers of this nature do? Write/author legal documents?\n\n"
    },
    {
      "time": "21 Apr 2005 — 6:51am",
      "content": "Obviously, generic iconography, in and of itself, means different things to different people. There's no getting around that. Short of putting a cliche scales of justice on the page, no imagery will literally convey 'lawyer' to everyone.\n\n"
    },
    {
      "time": "21 Apr 2005 — 7:16am",
      "content": "Which is a good argument for using the scales (clich\n\n"
    },
    {
      "time": "21 Apr 2005 — 8:59am",
      "content": "Wow! Who would've thought that this pen would cause so much controversy?   \n   \nFirst of all, I should let you all know that the job is going to print looking like the last posted art, for the most part\n\n"
    },
    {
      "time": "21 Apr 2005 — 9:27am",
      "content": "For whatever reason I couldn't successfully get all of these images to load at once. Also, I meant to say that the final product will be 2-color engraved (gold and PMS), no foil stamping or embossing.   \n   \n ![pen 2](http://web.archive.org/web/20131020073004im_/http:/www.typophile.com/forums/messages/29/70444.jpg)   \n ![pen 3](http://web.archive.org/web/20131020073004im_/http:/www.typophile.com/forums/messages/29/70445.jpg)\n\n"
    },
    {
      "time": "21 Apr 2005 — 10:42am",
      "content": "My opinion: (for what it is worth)   \nIf possibly to not use the pen, you are better off.   \nIt just seems to disctract and cheapen the image.   \nIt is so much stronger with out it. If the client has a gun to your head (ie: his money, his project, his choice) then go with the more illustrative pen. The more photographic, the cheaper it looks.   \n   \nHildebant.\n\n"
    },
    {
      "time": "21 Apr 2005 — 3:55pm",
      "content": "It just looks like STOCK PHOTOGRAPHY. It feels that it brings down the rest of your work. I suggest using just type.   \n   \n\"Obviously, generic iconography, in and of itself, means different things to different people.\"   \n   \nThe goal of an icon is to have recognition visually as to what you do. I am not saying that all icons are immediately recognized, but I feel that the pen is a mixed message. I don't think on every job there has to be an icon, especially if there isn't one that fits.   \n   \nI know some of you argue that there is type that will be with the icon. But that backs up what many on here are saying- why have an icon at all. Why force something to work when it doesn't, especially when you have a classy clean type solution already. The pen will draw attention away from the foil stamp.   \n   \nEven with the pen, your work looks good as always Scott. Have a good weekend.\n\n"
    },
    {
      "time": "6 May 2005 — 10:02pm",
      "content": "Test\n\n"
    },
    {
      "time": "20 Apr 2005 — 3:14pm",
      "content": "Isn't LLC some sort of legally needed thing for such ventures?   \n   \nI like everything but the pen as well. The pen reads as \"author\" or \"writer\" and even \"lettering\" or \"calligraphy\".\n\n"
    },
    {
      "time": "20 Apr 2005 — 3:54pm",
      "content": "pff. :^P ok. so. i wasn't as \"articulate\" I meant \"author of books\" or \"writer of books\". sheesh! semantics.\n\n"
    }
  ]
}
