{
  "id": "101797",
  "title": "Unbound pages – design for reading onscreen",
  "forum": "General Discussions",
  "tags": [
    "ebooks",
    "flexible layout",
    "General Discussions",
    "reading",
    "responsive design",
    "screen typography",
    "text typography"
  ],
  "content": "Some on this list might be interested in the article I just wrote for _The Magazine_ about the typography of ebooks and design for the screen – or rather, for a plethora of screens:\n\n[http://the-magazine.org/13/unbound-pages](http://web.archive.org/web/20131014223504/http:/the-magazine.org/13/unbound-pages \"http://the-magazine.org/13/unbound-pages\")\n\nAlthough _The Magazine_ is subscription based, non-subscribers can read the full text of one article a month.\n\nJohn\n\n",
  "author": "johndberry",
  "time": "28 Mar 2013 — 12:27am",
  "uid": "5871",
  "comments": [
    {
      "time": "28 Mar 2013 — 2:39am",
      "content": "John, it's always interesting reading your pieces, and this one is intriguing as well, althought, paradoxically, on my screen it doesn't look good at all - in The Magazine site I see very long lines of text and no margins!\n\nThat said, about the specific issue of your article, the few reading experiences I had with e-books (even those made by corporate publishers) were disappointing. I wonder if there isn't a way to transfer (translate?) a book design layout made with, say, Indesign, to a tablet or an e-reader device, for example using the pdf format which still seems to be the best for rendering books layout (by the way, didn't Amazon introduce a sort of \"as printed\" e-books format?)\n\n"
    },
    {
      "time": "28 Mar 2013 — 9:28am",
      "content": "Nicola – You can certainly do that, but then what you get is a _static_ layout, which only works if you're viewing it on an appropriately sized and oriented screen. What I’m talking about is _flexible_, adaptive layout. And having the tools to design that well.\n\n"
    },
    {
      "time": "28 Mar 2013 — 12:27pm",
      "content": "\\> I see very long lines of text and no margins\n\nThe margins look fine on my computer (Mac using Safari).\n\n"
    },
    {
      "time": "5 Apr 2013 — 10:05am",
      "content": "Very clearly written and expressed, without being condescending - nicely done. I certainly agree that it's high time reading software took layout seriously. BTW, I like the \"return-from-footnote\" links!\n\nOne thing I'd love to see properly implemented is multiple columns. The main question there is: how do you reconcile that with vertical scrolling? Here's an idea: don't. Scroll _horizontally_ instead! :-) In fact the human existence -including our reading \"hardware\", from the acuity of the retina to the structure of the neck- is much stronger in the horizontal dimension. The ancient scroll was right on.\n\nhhp\n\n"
    },
    {
      "time": "5 Apr 2013 — 11:58am",
      "content": "Hrant – Pagination based on the actual screen you’re reading on would eliminate the need for “scrolling” as we use it now. Instead, you’d page down (or over) from one multi-column page (if that’s appropriate to the screen size & shape) to the next.\n\nBut you’re quite right that multiple columns on a “page” larger than the screen makes no sense whatsoever.\n\nJohn\n\n"
    }
  ]
}
