{
  "id": "101800",
  "title": "Help me with a logo!",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am working on a logo of firm called \"footprints\".. It is basically an engineering competition which includes all the technical events pertaining to each and every engineering field.. i want to know which typeface will go with th logo that i have attached\n\n| Attachment | Size |\n| --- | --- |\n| [logo](http://web.archive.org/web/20140721195258/http:/typophile.com/files/Untitled-1_117.jpg) | 185.23 KB |\n\n",
  "author": "mehtaib",
  "time": "28 Mar 2013 — 3:42am",
  "uid": "209860",
  "comments": [
    {
      "time": "28 Mar 2013 — 7:52am",
      "content": "Maybe FF Primary.\n\nBTW, maybe it's my background, but I'm seeing a guy on an anti-aircraft gun...\n\nhhp\n\n"
    },
    {
      "time": "28 Mar 2013 — 8:00am",
      "content": "Has to be your background, 'coz I see a lightning with a pantograph.\n\n"
    },
    {
      "time": "28 Mar 2013 — 9:38am",
      "content": "Maybe no one else would think this, but my first thought was a stylized hammer & sickle symbol.\n\n ![](http://web.archive.org/web/20140721195258im_/http:/typophile.com/files/logo-smaller_5111.jpg)\n  \nMehtaib could you explain your logo a bit more? What do the elements represent? \n"
    },
    {
      "time": "28 Mar 2013 — 11:36am",
      "content": "It is a guy on a lightning bolt.. which portrays.. the exponential growth of the even in the last few years.. i have to actually revamp the logo for this years event.. and it will be \"Footprints X4\" It is the fourteenth consecutive year of the event and hence X4..\n\nP.S. The tagline of the event is \"Think Beyond\"\n\n"
    },
    {
      "time": "28 Mar 2013 — 12:10pm",
      "content": "\\> the exponential growth\n\nIf you keep that general look, you might consider reversing it so the lightening bolt is pointed to the right. Two reasons — since we read from left to right, objects that point to the left can seem to be pointing backwards, and also if the lightening bolt represents growth in the sense of a graph, you want the graph going up.\n\n ![](http://web.archive.org/web/20140721195258im_/http:/typophile.com/files/logo-flopped_4785.jpg)\n\n"
    },
    {
      "time": "28 Mar 2013 — 12:10pm",
      "content": "okay thanks for that suggestion! and what combination of typefaces should i use for \"footprints\", \"x4\" and \"think beyond\"\n\n"
    },
    {
      "time": "29 Mar 2013 — 1:35pm",
      "content": "You could use Univers, condensed.\n\n"
    },
    {
      "time": "29 Mar 2013 — 1:35pm",
      "content": "You could use Univers, condensed.\n\n"
    },
    {
      "time": "29 Mar 2013 — 1:46pm",
      "content": "I think a true Modernist must repeat a mantra _three_ times. ;-)\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2013 — 3:21pm",
      "content": "I don't know if universe would be appropriate for this logo, but I would like to see it first to make sure.\n\n"
    }
  ]
}
