{
  "id": "101846",
  "title": "Digitizing Peignot Specimen Book",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "At my local public library they have a pretty extensive collection on printing.\n\n[http://www.provlib.org/spc-updikeephemera](http://web.archive.org/web/20131017134637/http:/www.provlib.org/spc-updikeephemera \"http://www.provlib.org/spc-updikeephemera\")\n\nI've been looking for something to digitize and distribute online to promote the collection and that would also just be cool for people to have/have access to. I came across a specimen book for Peignot that was printed in an edition of 50, one for this collection specifically. I was wondering if anyone had any information on the copyright of this document? I'm attaching what I think to be the colophon, and title page. After running it through Google Translate it seems to not contain the information, as an American, I usually think of defining a copyright.\n\nIs it legal for me to scan this document and put it online? Does anyone know who I could contact to get permission or find out?\n\nAlso, is this something people would be interested in seeing? As Peignot is available as a digital font it seems like this might not be as compelling as some of the other stuff in their collection. However, it does seem kind of unique because of the low print run, and it's really nice to see in person (which I know is sort of contradictory to digitizing it, but maybe it would compel people to visit). Is there anything else people could recommend looking for in that collection that may be of more interest to people? There's some 20th century stuff, but I think the bulk of the collection is 19th and 18th century –&nbsp;which may be more uncommon? The collection is pretty extensive, and I'm not too familiar with typographic history, especially stuff that hasn't been digitized. Any advice on the matter and how to approach the collection is greatly appreciated.\n\nThanks.\n\n| Attachment | Size |\n| --- | --- |\n| [IMG\\_2289.JPG](http://web.archive.org/web/20131017134637/http:/typophile.com/files/IMG_2289_0.JPG) | 581.03 KB |\n| [IMG\\_2290.JPG](http://web.archive.org/web/20131017134637/http:/typophile.com/files/IMG_2290_0.JPG) | 744.75 KB |\n\n",
  "author": "Mersault",
  "time": "29 Mar 2013 — 3:34pm",
  "uid": "32121",
  "comments": [
    {
      "time": "29 Mar 2013 — 3:47pm",
      "content": "No legal help here, but am I right in assuming that you mean to create a digital copy of the book, and not to digitize the typefaces as fonts? - Herb\n\n"
    },
    {
      "time": "29 Mar 2013 — 3:55pm",
      "content": "I know nothing about French copyright law, but the book appears to be over 70 years old, which would make it public domain material in the U.S.\n\n"
    },
    {
      "time": "29 Mar 2013 — 4:04pm",
      "content": "<cite>No legal help here, but am I right in assuming that you mean to create a digital copy of the book, and not to digitize the typefaces as fonts? - Herb</cite>\n\nHi Herb, Yes, a copy of the book, not digitizing the typeface as a font.\n\nThanks for checking, it's something definitely worth clarifying.\n\n"
    },
    {
      "time": "29 Mar 2013 — 5:59pm",
      "content": "> Hi Herb, Yes, a copy of the book, not digitizing the typeface as a font.\n> \n> Thanks for checking, it's something definitely worth clarifying.\n\nWell, in the States (California's still one of 'em), digitizing the typeface to make fonts would be perfectly legal, even if the drawings had been done yesterday. Digitizing the book, on the other hand, would be a copyright issue. I believe heirs can maintain copyright, for a while. You'd need to check.\n\n"
    },
    {
      "time": "29 Mar 2013 — 7:36pm",
      "content": "> I know nothing about French copyright law, but the book appears to be over 70 years old, which would make it public domain material in the U.S.\n\nNo longer true, unfortunately, due to Mickey Mouse. (Insert usual disclaimer that you really need to ask a lawyer, not us.) The copyright term in France is life of author plus 70 years (this probably counts as a corporate work by D&P, so it has probably been public domain in France after 2007), but the peculiarities of (1) how the US applies copyright law to foreign works and (2) the Mickey Mouse extensions to copyright term in the US mean that because it was published after 1926, it won't be public domain in the United States before 2032:  \n [http://copyright.cornell.edu/resources/publicdomain.cfm](http://web.archive.org/web/20131017134637/http:/copyright.cornell.edu/resources/publicdomain.cfm)\n\n"
    },
    {
      "time": "29 Mar 2013 — 8:52pm",
      "content": "So just host it on a server in France. :-)\n\nWho would own that copyright now? I think I used to know back when I was researching a Deberny font from the turn of the century, but now I can't remember. Anyway it should be possible to get their permission, since it's a worthy project (at least I think so).\n\nBTW if you're really serious you could produce (in addition to a scanned\\* PDF) a letterpress edition (of 50 copies :-) using photopolymer plates, and maybe even sell some copies for good money.\n\n\\* At least 600 dpi, please.\n\nhhp\n\n"
    },
    {
      "time": "29 Mar 2013 — 11:23pm",
      "content": "[http://diybookscanner.org](http://web.archive.org/web/20131017134637/http:/diybookscanner.org/ \"http://diybookscanner.org\")\n\n"
    },
    {
      "time": "31 Mar 2013 — 3:00pm",
      "content": "Thanks everyone for your thoughts.\n\nIt's a bummer I'll have to wait until after 2037. I suppose I'll contact the now owners of D&P, which seems to be Monotype, and see what I can do. These copyright issues are pretty astounding (especially that the font wouldn't be, but the specimen book would be copyrighted!), judging from the general consensus I hear online and in the media, it's become a pretty odd and imbalanced thing at the moment.\n\n@Chris Dean I am planning to use a DIY Book Scanner, they seem really great and accessible.\n\nIf anyone has requests for other things to scan or advice on what to look out for, I'd really appreciate it. Thanks!\n\n"
    },
    {
      "time": "2 Apr 2013 — 8:20pm",
      "content": "You guys are forgetting about [Fair Use](http://web.archive.org/web/20131017134637/http:/en.wikipedia.org/wiki/Fair_use). If the library reproduced the Updike Collection it would certainly be under the categories of “commentary, search engines, criticism, news reporting, research, teaching, library archiving and scholarship.”\n\n"
    },
    {
      "time": "2 Apr 2013 — 8:50pm",
      "content": "But isn't Fair Use limited to excerpts? I thought reproducing an entire work is never Fair Use.\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2013 — 10:51pm",
      "content": "Yes, each case is weighed against four factors, one of which is “quantity or percentage of the original copyrighted work”, but that is only one quarter of the balancing test. It’s true that the law is quite fuzzy on Fair Use and there are many examples of two similar cases that have fallen on either side of the fence in court rulings, so of course it’s best to first ask permission of the copyright holder. But I think the exception could apply to this project.\n\n"
    },
    {
      "time": "3 Apr 2013 — 3:53am",
      "content": "You are allowed to scan it for personal use (and the limited distribution that goes with that\\*). Do NOT use the scan for any commercial purpose, and you should be safe (legally wise).\n\n\\* Which means you can ‘give’ it to family and friends, as long as they don’t redistribute.\n\n"
    },
    {
      "time": "3 Apr 2013 — 3:57am",
      "content": "Bert –&nbsp;Did you read the question? The purpose is to make the document available to everyone (by posting it online), not to sell it but to raise awareness of the non-profit collection.\n\n"
    },
    {
      "time": "3 Apr 2013 — 7:00am",
      "content": "Publicly giving away a reproduction of the whole specimen book without permission, assuming it is still in copyright, is almost certainly not fair use. The case law is really not fuzzy at all on nontransformative use of whole works that the copyright holder could potentially sell (even if they are not currently attempting to). I would certainly not attempt it without consulting an attorney.\n\n"
    },
    {
      "time": "3 Apr 2013 — 7:25am",
      "content": "@Stephen: Who’ll tell if the link for that private document gets out? ; ) Not me.\n\n"
    },
    {
      "time": "3 Apr 2013 — 8:03am",
      "content": "Don't do something just because you think you can get away with it. Do something you believe in, whether you think you'll get away with it or not.\n\nhhp\n\n"
    },
    {
      "time": "3 Apr 2013 — 2:36pm",
      "content": "_I was wondering if anyone had any information on the copyright of this document? I'm attaching what I think to be the colophon, and title page. After running it through Google Translate it seems to not contain the information, as an American, I usually think of defining a copyright._\n\nLinotype would own the rights to the Deberny & Peignot library, which means now that ultimately Monotype does; I would get in touch with them. The page you scanned isn't the copyright page (if there is one); it's just the traditional note at the end of French books about where and when it was printed.\n\nJohn\n\n"
    }
  ]
}
