{
  "id": "101895",
  "title": "Legal use of typefaces",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "legal",
    "typeface",
    "use"
  ],
  "content": "Hi,  \nFirst post. New designer.\n\nI have a question regarding the legality of using typefaces.\n\nLet's say I use Adobe CS to design a poster/brochure/logo for a company, for which I will be paid. Can I use any of the fonts installed on my Mac (such as Futura, Helvetica, Hoefler ...) without any issues or should either the client or the designer (me) purchase a licence for the specific usage of the chosen font?\n\nEssentially, can all the fonts that come with the OS or the design software be used for any reason?\n\nThanks,\n\n",
  "author": "jai",
  "time": "1 Apr 2013 — 6:40am",
  "uid": "210324",
  "comments": [
    {
      "time": "1 Apr 2013 — 9:38am",
      "content": "“to design a poster/brochure/logo for a company, for which I will be paid”? Generally, yes: they’re working tools for working professionals.\n\n“can all the fonts that come with the OS or the design software be used for any reason?”  \nGenerally, no: they can“t be resold, “sublet” (made available to others on a publicly-accessible server), used on the web or embedded in anything other than a PDF.\n\n"
    },
    {
      "time": "1 Apr 2013 — 9:47am",
      "content": "Thanks,\n\nYou mention that only a PDF can be output, but what happens if I want to create a jpeg web banner with Helvetica or printed work in Futura... ?\n\n"
    },
    {
      "time": "1 Apr 2013 — 9:52am",
      "content": "He said embedded in a PDF. Images are fine as the fonts cannot be accessed by the public.\n\n"
    },
    {
      "time": "2 Apr 2013 — 3:39am",
      "content": "> Can I use any of the fonts installed on my Mac\n\nAdobe applications generally install a number of fonts in the Library/Fonts folder depending on how you have configured the installation. For example, [Adobe CS6 installs a variety of fonts depending on which applications and combination of applications are installed](http://web.archive.org/web/20150322145932/http:/www.adobe.com/type/browser/fontinstall/cs6installedfonts.html). The license typically permits you to use the bundled fonts with the application to produce documents in line with the capabilities of that application.\n\nOther fonts installed as standard with your operating system are licensed in line with the operating system and its standard application software, which does not cover third party applications, such as Adobe's CS6 suite. As such I would assume (though I am not asserting) that you would require a separate commercial license in order to use those fonts as part of an Adobe CS workflow. Annoyingly no real distinction is made in Adobe's (or any other applications) font menus and so it is left to the user to understand licensing restrictions and make that judgement.\n\n"
    },
    {
      "time": "2 Apr 2013 — 9:13am",
      "content": "Karl -- I have never heard of anyone needing an additional license to use the fonts supplied with OS X just because the app running on the OS and using them was not made by Apple. I think in that case at least, which is what jai is asking about, your assumption is not correct.\n\n"
    },
    {
      "time": "2 Apr 2013 — 9:39am",
      "content": "Generally speaking, font licenses permit the things that fonts are normally used for (documents, brochures, posters, etc). I believe that fonts that come with the operating system or with Adobe CS tend to have few restrictions, other than the obvious one that you can't give copies of the fonts to other people.\n\nSome fonts can't be embedded in PDFs and you'll get an error message when you try to make it. I believe it's because they were concerned that someone might extract the font from the PDF. I think most designers would avoid buying fonts that have that restriction since PDFs are a common way to email layouts and proofs to clients, but if that happens on a job and you can't switch fonts, just save it in another format.\n\nSome fonts may also carry specific restrictions, such as you can't use them in logos. Just read the font license to be sure.\n\n"
    },
    {
      "time": "2 Apr 2013 — 9:34am",
      "content": "Tom, I am referring specifically to content generated for commercial output but if you have information to the contrary that would be great as I have always found the OS EULAs frustratingly non-specific and as such taken a cautionary approach. Additionally, the versions of fonts distributed with an OS often differ from those available commercially and as such can cause problems when working with third parties.\n\n"
    },
    {
      "time": "2 Apr 2013 — 10:48am",
      "content": "Karl -- Personally I'd want to see a specific warning from Apple before I told someone who is creating content for commercial output using OS X fonts that he needs to buy an additional font license if he wants to use InDesign instead of Pages.\n\n"
    },
    {
      "time": "2 Apr 2013 — 12:27pm",
      "content": "The Mac OS licence agreement is very clear about fonts:\n\n> E. Fonts. Subject to the terms and conditions of this License, you may use the fonts included with the Apple Software to display and print content while running the Apple Software; however, you may only embed fonts in content if that is permitted by the embedding restrictions accompanying the font in question. These embedding restrictions can be found in the Font Book/Preview/Show Font Info panel.\n\n[http://images.apple.com/legal/sla/docs/OSX1082.pdf](http://web.archive.org/web/20150322145932/http:/images.apple.com/legal/sla/docs/OSX1082.pdf \"http://images.apple.com/legal/sla/docs/OSX1082.pdf\")\n\n"
    }
  ]
}
