{
  "id": "101886",
  "title": "Arrows",
  "forum": "General Discussions",
  "tags": [
    "arrows",
    "General Discussions",
    "mac",
    "Word"
  ],
  "content": "Hi, Typophilers,\n\nI use mac and word 2011. Sometimes I place directional arrows into word documents to indicate direction or flow and was wondering. In the fonts I am using, I can see that they have encodings for the following:\n\nU+2190 arrowleft  \nU+2191 arrowup  \nU+2192 arrowright  \nU+2193 arrowdown  \nU+2196 arrowupleft  \nU+2197 arrowupright  \nU+2198 arrowdownright and  \nU+2199 arrowdownleft\n\nWhen I use the symbol inserter (see screen.png) a symbol is inserted, however, it is not from the font I am using, rather wingdings (see word doc.png) . Is there a way to get word to recognise the font, or shortcuts that can override the limitations? I have already tried double hyphen lessthan ( --\\> ) to make a right arrow, however, this creates another type of arrow that is not editable (it does not appear to be part of any font).\n\nThanks for the help.\n\n| Attachment | Size |\n| --- | --- |\n| [Word Doc.png](http://web.archive.org/web/20131015131713/http:/typophile.com/files/Word%20Doc.png) | 44.83 KB |\n| [Screen.png](http://web.archive.org/web/20131015131713/http:/typophile.com/files/Screen.png) | 65.04 KB |\n\n",
  "author": "peterfwyang",
  "time": "31 Mar 2013 — 12:14pm",
  "uid": "163060",
  "comments": [
    {
      "time": "31 Mar 2013 — 2:48pm",
      "content": "Dumb question (my specialty): are you certain that the font you are using actually has those characters in it?\n\n"
    },
    {
      "time": "31 Mar 2013 — 7:05pm",
      "content": "To insert the arrows from your font, you can use the OS X character viewer. In the following grab, the top line is the Wingdings obtained from the Word symbol inserter, the line below is arrows from Cambria inserted using the character viewer.\n\n ![](http://web.archive.org/web/20131015131713im_/http:/typophile.com/files/charview_4460.png)\n\nI selected the unicode range, to be sure the characters are in the font, but you get a larger choice when you select \"Arrows\" in the pane on the left.\n\nNote: the grab shows the OS X 10.8 character viewer but you could do the same on previous versions of the OS.\n\n"
    },
    {
      "time": "31 Mar 2013 — 9:07pm",
      "content": "Hello, OldNick, yes I am sure, as I have to manually insert using the glyph palate in InDesign and Illustrator.\n\nHello Michel, thanks, is there a way to isolate a particular font? From my view (OSX 10.8.3) the character viewer shows every arrow from every font\n\n"
    },
    {
      "time": "1 Apr 2013 — 5:54am",
      "content": "Don't mean to hijack the thread, just generalize it a bit.\n\nAre you guys saying that \"modern\" (Unicode) versions of MS Word may get a character from whatever font it decides to, regardless of whether or not that character is in the font selected by the user for the document?\n\nSo, for example, if you need a d with underdot, and both the U+1E0D character (from the Latin Extended Additional set) and the combining diacritic U+0323 are in the font you're using, Word might decide to go and get the character (or string) from a different font?\n\nExtending that, are their any circumstances when Word might change the Unicode assignment of a character, deciding something should be a \"symbol\" even if the Unicode number for, say, a spacing modifier or combining diacritical has been keyed, or is in a file keyed by someone else?\n\n"
    },
    {
      "time": "1 Apr 2013 — 8:04am",
      "content": "> Hello Michel, thanks, is there a way to isolate a particular font? [peterfwang]\n\nThat could be done on OS X 10.6; I don't think it can be done with the character viewer that comes with 10.8.\n\n> are their any circumstances when Word might change the Unicode assignment of a character [Charles]\n\nI don't think so. So far as I know, Word will just use some fallback mechanism to display the missing characters instead of displaying some \"missing glyph\" symbol.\n\nWhat happens with the Word symbol inserter is that, at least in the case of the arrows, it is programmed to insert symbols from Pi fonts, not unicode symbols. Here is what happens if I write in Word the first line with Cambria, copy and paste it underneath, then select the second line and select Bauhaus 93\n\n ![](http://web.archive.org/web/20131015131713im_/http:/typophile.com/files/arrows_3585.png)\n\nFor the first arrows on the second line, Times new roman was used as fallback font; for the last four, Dejavu sans bold was used. I don't know how those choices are made.\n\n"
    },
    {
      "time": "1 Apr 2013 — 8:47am",
      "content": "To isolate a particular font, it seems [Ultra Character Map](http://web.archive.org/web/20131015131713/http:/www.x04studios.com/ultracharactermap.html) does it. I could find no review.\n\n"
    },
    {
      "time": "1 Apr 2013 — 9:19am",
      "content": "> I don't know how those choices are made.\n\nPANOSE  \n [http://en.wikipedia.org/wiki/PANOSE](http://web.archive.org/web/20131015131713/http:/en.wikipedia.org/wiki/PANOSE \"http://en.wikipedia.org/wiki/PANOSE\")\n\n"
    },
    {
      "time": "1 Apr 2013 — 9:31am",
      "content": "@PabloImpallari\n\nI was thinking about it too. But why Word prefer Times New Roman to a sans-serif font as a fallback to Bauhaus 93? It doesn't make too much sense.\n\nOf course, if one of these 3 fonts lack proper PANOSE information, that could be explained easily.\n\n"
    }
  ]
}
