{
  "id": "101896",
  "title": "good font collections / learning to become a typographer",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI hope it's ok to post these questions here.\n\n- Aside from the OS typefaces and the ones that come with Adobe CS, are there other collections which are deemed \"must haves\" (either free or that can be purchased as a collection)?\n\n- I'm interested in learning the art of actually creating typefaces. What are considered the best learning material (books/online) and tools (Fontlab?)?\n\nThanks,\n\n",
  "author": "jai",
  "time": "1 Apr 2013 — 6:54am",
  "uid": "210324",
  "comments": [
    {
      "time": "2 Apr 2013 — 3:54am",
      "content": "Although fonts are not neccesarily bought as collections – more often they are bought one font or family at a time – but you could start here:\n\n[http://typophile.com/node/30047](http://web.archive.org/web/20131015110212/http:/typophile.com/node/30047 \"http://typophile.com/node/30047\")\n\nThere are no such things as must have fonts though, it all depends on what you do with them, what you like, and what’s your budget. You could do searches on Typophile for threads on what people consider the best or essential typefaces. What you will see though is that these lists are different from person to person.\n\n"
    },
    {
      "time": "2 Apr 2013 — 2:50pm",
      "content": "If you are a student, there are some additional options available to you for inexpensive font collections.\n\nRegarding books, currently I suggest the following as the optimal $100 type designer’s starting library:\n\nFontographer: Type by Design by Stephen Moyes (out of print, used)  \nThe Stroke by Gerrit Noordzij  \nThe Elements of Typographic Style (4th edition) by Robert Bringhurst  \nDesigning Type by Karen Cheng  \nAnatomy of a Typeface by Alexander Lawson\n\nNotes:\n\nI would have Letters of Credit by Walter Tracy on the list, but it is not only out of print, but horribly expensive.\n\nThe Fontographer book may seem very software-specific, but it is actually a great general intro to how to work with bezier curves and the like.\n\nKaren Cheng’s book is a bit polarizing for some folks, but most of us seem to think it is useful. Yes, you can do most of the same analysis on your own with a decent library of fonts and a font editing program, but it would take a bunch of work; somebody else doing that for you is helpful, IMO.\n\nFinally, other books may come into play depending on what font editing tool you use. The software manual itself may be of use....\n\n"
    }
  ]
}
