{
  "id": "101824",
  "title": "Line spacing inconsistency?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is it me or is there a major inconsistency with Old Standard's line spacing? I'm using it via Typekit with many complications in my layout.\n\n ![](http://web.archive.org/web/20130825214646im_/http:/typophile.com/files/old-standard-line-spacing_5267.png)\n\n",
  "author": "chrisburton",
  "time": "28 Mar 2013 — 8:02pm",
  "uid": "199209",
  "comments": [
    {
      "time": "29 Mar 2013 — 9:04am",
      "content": "Anyone care to comment on my question?\n\n"
    },
    {
      "time": "29 Mar 2013 — 9:57am",
      "content": "Line-spacing issues usually involve more than one line of type. Rather, are you asking about the apparent lack of kerning in the font?\n\n"
    },
    {
      "time": "29 Mar 2013 — 9:57am",
      "content": "What do you mean by 'line spacing'? That normally suggests interline spacing, i.e. leading, but your illustration shows only one line of text, so perhaps people are too confused to respond?\n\n"
    },
    {
      "time": "29 Mar 2013 — 11:44am",
      "content": "Okay so perhaps my terminology is incorrect. My apologies. I'm specifically speaking about the difference of the gaps between the very top where the blue starts and the cap-height compared to the baseline and where the blue ends (see red arrows).\n\n ![](http://web.archive.org/web/20130825214646im_/http:/typophile.com/files/inconsistent_5681.png)\n\n"
    },
    {
      "time": "29 Mar 2013 — 12:13pm",
      "content": "Most capitals won't sit vertically centered in their space because that space is set up to accommodate descenders of the lowercase (and potentially Q and J). Maybe that accounts for what you're seeing.\n\n"
    },
    {
      "time": "29 Mar 2013 — 12:24pm",
      "content": "That's what I initially figured. It's just incredibly difficult to set a line-height and it output equivalent space above and below. I was hoping to not have to result to padding or margins.\n\n"
    },
    {
      "time": "29 Mar 2013 — 1:07pm",
      "content": "Related: [http://typophile.com/node/9482](http://web.archive.org/web/20130825214646/http:/typophile.com/node/9482 \"http://typophile.com/node/9482\")\n\nhhp\n\n"
    },
    {
      "time": "29 Mar 2013 — 1:17pm",
      "content": "The variation in the distance that is displayed may also come from counters that extend below the baseline and above the capital height.\n\n ![](http://web.archive.org/web/20130825214646im_/http:/typophile.com/files/offshoot_4067.png)\n  \n[The percentage here is that of the capital height] \n"
    },
    {
      "time": "29 Mar 2013 — 1:51pm",
      "content": "Really appreciate the help, guys.\n\n"
    },
    {
      "time": "30 Mar 2013 — 4:41am",
      "content": "> I was hoping to not have to result to padding or margins.\n\nYou could try using a {vertical-align: -6%;} attribute to baseline shift. Not sure if this is more desirable than adding padding-top.\n\n"
    },
    {
      "time": "30 Mar 2013 — 5:30am",
      "content": "After God finished designers, he (she?) was heard to mutter \"Another half-baked idea. Now I've got to make typesetters, or nothing will ever get done.\"\n\n"
    },
    {
      "time": "30 Mar 2013 — 8:16am",
      "content": "> You could try using a {vertical-align: -6%;}\n\nAh. I wasn't aware if you could use the vertical-align property on block-level elements.\n\n> After God finished designers\n\nGod?\n\n"
    },
    {
      "time": "31 Mar 2013 — 6:16am",
      "content": "> God?\n\nIt's a feel-good explanation. If you use a Darwin-based model, designers would be just another failed mutation.\n\n"
    }
  ]
}
