{
  "id": "10182",
  "title": "(x) Amica Magazine - Cheltenham (custom version) {Mark S}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "There is a good chance it is custom, but even then there could be some typeface which looks similar?   \n ![amica](http://web.archive.org/web/20110622210149im_/http:/www.typophile.com/forums/messages/83/69080.jpg)\n\n",
  "author": "<a href=\"/web/20110622210149/http://typophile.com/user/4623\" title=\"View user profile.\">hackum</a>",
  "time": "<br>",
  "uid": "4623",
  "comments": [
    {
      "time": "",
      "content": "From the C and A especially, it must have been based on a Caslon.   \nTim\n\n"
    },
    {
      "time": "",
      "content": "I disagree about Caslon, because it seems to me only the A and C have any sort of Caslon similarity -- the other letters are much more like a classic Roman titling type. (My copy of the FontBook is not handy, or I might suggest a few similar ones.)   \n   \nFWIW, AMICA is listed as a client of Font Bureau, although this typeface doesn't resemble any FB styles I have seen.\n\n"
    },
    {
      "time": "",
      "content": "Thank you both for your input.   \n   \nFrom what I was able to find online, there are several Amica magazines; one of which is German:   \n [http://www.madonnatribe.com/images\\_covers/amica\\_2000.JPG](http://web.archive.org/web/20110622210149/http:/www.madonnatribe.com/images_covers/amica_2000.JPG)   \n   \nProbably FontBureau worked with them? The mast looks like Agenda to me.\n\n"
    },
    {
      "time": "",
      "content": "This looks to me like a reduced-weight [Cheltenham Oldstyle](http://web.archive.org/web/20110622210149/http:/www.myfonts.com/fonts/linotype/cheltenham-old-style/cheltenham-old-style/testdrive.html?s=AMICA&p=48). I believe Font Bureau did something like that for the New York Times Magazine, but I don't know if this is the same one.\n\n"
    },
    {
      "time": "",
      "content": "Mark is right - it looks very much like the NYT mag's redesign of Cheltenham, which is not (as far as I know) commercially available.   \n   \n [http://www.typophile.com/forums/messages/83/25489.html](http://web.archive.org/web/20110622210149/http:/www.typophile.com/forums/messages/83/25489.html)\n\n"
    },
    {
      "time": "",
      "content": "Went out and bought the magazine today. Here is a scan from one of the pages. I am almost sure now it is the custom work by FontBureau Mike and Mark mentioned. It is a beautiful and exquisite face in my opinion.   \n   \nThe other FontBureau typefaces used in the magazine: FB Agenda Light and FB Agenda Regular (for captions and short paragraphs), FB Giza Seven Five (from what I can tell) for some of the titles.   \n   \nCan anyone provide a scan of the NY Times version of the font?   \n   \n ![2](http://web.archive.org/web/20110622210149im_/http:/www.typophile.com/forums/messages/83/69155.gif)\n\n"
    },
    {
      "time": "",
      "content": "I'd be happy to scan the NYT magazine font (which I don't think is quite as light as this) but it won't arrive on my doorstep until saturday morning, hope you can wait until then.   \n   \nThat lower case g is definitely Cheltenham.\n\n"
    },
    {
      "time": "",
      "content": "I'd be happy to scan a sample of the NY Times mag font but hope you can wait until saturday when my copy arrives. I don't think it's quite as light as this.   \n   \nThat lower case g confirms its Cheltenham origins.\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Patricia.\n\n"
    },
    {
      "time": "",
      "content": "Here as promised is a sample from the New York Times. It's very close but not quite as delicate.   \n   \nNote to the Europeans: please ignore the content. I apologize for my stupid country.   \n ![](http://web.archive.org/web/20110622210149im_/http:/www.typophile.com/forums/messages/83/69211.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Thanks!   \n   \nIt looks like both typefaces are the same, the one in Amica being a little thinner(or it might be bad scanning on my part.) Mystery solved ![:-)](http://web.archive.org/web/20110622210149im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    }
  ]
}
