{
  "id": "101873",
  "title": "Tips-n-tricks for chalkboard typography?",
  "forum": "General Discussions",
  "tags": [
    "chalkboard",
    "General Discussions"
  ],
  "content": "Last week I've been commissioned to create a typographic image on a big chalkboard door in a cooking store. I can hardly wait to get my hands dirty, but I was wondering if any of you have any experience doing such a job.\n\nI already found some useful tips-n-tricks on various blogs.  \nThis door is freshly painted, so first thing I'll do is totally cover it in chalk and then clean it - this to avoid any scratching.  \nFurthermore, I'll keep the door wet whilst drawing, wetting the chalk too.\n\nAnd yes, I've already seen Dana Tanamachi's vimeo's. Great stuff!\n\nMore tips-n-tricks are highly appreciated!\n\n",
  "author": "Jean Paul Beumer",
  "time": "31 Mar 2013 — 2:09am",
  "uid": "22445",
  "comments": [
    {
      "time": "31 Mar 2013 — 12:41pm",
      "content": "(It’s a lettering image, not typographic.)\n\nI did some chalk stuff recently, but worked dry.  \nI found that spritizing with a detergent solution spray then wiping with a damp synthetic cloth was a better way to clean than dry wiping, or wet wiping without detergent, which left streaks.\n\n"
    },
    {
      "time": "31 Mar 2013 — 3:54pm",
      "content": "I've never tried it, but I wonder if people ever prepare a small-scale version ahead of time and then project it onto the surface as a guide?\n\n"
    },
    {
      "time": "31 Mar 2013 — 8:38pm",
      "content": "Sounds like a good idea.\n\n"
    },
    {
      "time": "1 Apr 2013 — 1:26am",
      "content": "True, it's lettering, not typographic, I stand corrected.  \nI'll get some detergent. Also one tip was to not use paper to wipe because is leaves residue, cloth is better.  \nThe design will be made in advance off course.  \nProjection seems a good way of enlarging the design, but since I don't have a overhead projector, a grid will have to do (besides, will projection work on a black surface?).\n\nThanks so far!\n\n"
    },
    {
      "time": "1 Apr 2013 — 6:39am",
      "content": "I don't have any tricks for you but I would recommend contacting Drew Melton ( [http://twitter.com/justlucky](http://web.archive.org/web/20130820170955/http:/twitter.com/justlucky \"http://twitter.com/justlucky\")) for tips. He's done a few chalk pieces for Sevenly which you can see in the link below along with progress shots (including a rough idea on paper).\n\n[http://yourjustlucky.com/#/people-matter/](http://web.archive.org/web/20130820170955/http:/yourjustlucky.com/#/people-matter/ \"http://yourjustlucky.com/#/people-matter/\")\n\n"
    },
    {
      "time": "1 Apr 2013 — 10:28am",
      "content": "\\> but since I don't have a overhead projector\n\nIt's possible that you could borrow one from your local library or a church or other organization that has one.\n\nThere are also multimedia projectors that can be connected to a laptop computer (that's how PowerPoints are projected). They usually cost several hundred dollars but again maybe you can borrow one. There are also devices called sketch projectors or tracing projectors that artists use sometimes. You can find those in the ballpark of $50 at Amazon, but I've never tried one.\n\n\\> will projection work on a black surface?\n\nIt should work if the drawing is white lines on a black background, and the room isn't overly bright.\n\n"
    },
    {
      "time": "23 Apr 2013 — 10:50am",
      "content": "Result [here](http://web.archive.org/web/20130820170955/http:/pinterest.com/pin/512917845031230145/)...\n\n"
    },
    {
      "time": "23 Apr 2013 — 3:59pm",
      "content": "Use a fairly hard pencil to draw a lineature, with the aid of a ruler that is long enough to cover the width. I guess doing this with two or three persons would be easier.\n\nDefine x-height for a start, maybe also cap-height.\n\nThe pencil lines are fairly invisible, but will remain when the chalk text is removed, in case correction or new text is needed.\n\n(Edit: sorry, just noted this is a fairly old thread.)\n\n"
    },
    {
      "time": "24 Apr 2013 — 12:32am",
      "content": "Thanks Bert.  \nI find that using a grid wasn't really neccessary. Mind you, I did draw it with chalk, which made the grid very wobbly. Not a good idea on my part.\n\nThought I'd use lowtack tape for straight lines in stead of pencil, that won't be visible after removal. And I'll be shopping for chalk in pencil form if there is such a thing :)\n\n"
    },
    {
      "time": "25 Apr 2013 — 10:54pm",
      "content": "Redid a bit: see [here](http://web.archive.org/web/20130820170955/http:/pinterest.com/jeanpaulbeumer/blackboard-lettering-by-us/).\n\n"
    },
    {
      "time": "26 Apr 2013 — 1:18pm",
      "content": "Chalk in pencil form? This is the next best thing: [http://www.aduis.nl/krijt-houder-1-stuk-art500252.aspx?ih=1](http://web.archive.org/web/20130820170955/http:/www.aduis.nl/krijt-houder-1-stuk-art500252.aspx?ih=1 \"http://www.aduis.nl/krijt-houder-1-stuk-art500252.aspx?ih=1\")\n\n"
    },
    {
      "time": "26 Apr 2013 — 7:33pm",
      "content": "See _A Topological Picturebook_ by George K. Francis. A couple of years ago one could have it for $10 new. Unfortunately, I made presents of all the copies I had, and now when I need it, it is about $30…\n\nThe book consists of 3 interleaved topics:\n\n- how to design 2D visualizations of complicated 3D structures,\n- tips on putting the visualizations on paper/blackboard,\n- math one can deduce from the example visualizations in the book.\n\nThe mathematical part is, I suppose, mostly a little bit dense for a non-enthusiast. However, I suspect that the other two parts may be of much more general interest.\n\n"
    }
  ]
}
