{
  "id": "101810",
  "title": "Emoji fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Apart from system fonts is anyone aware of any fonts that support the full set of emoji characters?\n\nCheers, Si\n\n",
  "author": "Si_Daniels",
  "time": "28 Mar 2013 — 8:34am",
  "uid": "1049",
  "comments": [
    {
      "time": "28 Mar 2013 — 8:59am",
      "content": "{To Follow}\n\n"
    },
    {
      "time": "28 Mar 2013 — 9:23am",
      "content": "What’s “the full set” of emoji characters?  \nAny Unicode character can be drawn in color and Apple’s “Emoji character set” is also an arbitrary selection.\n\n"
    },
    {
      "time": "28 Mar 2013 — 9:39am",
      "content": "Sorry for not being clear. I mean support for the 722 code-points listed in the \"Emoji in the Unicode standard\" section listed here... [http://en.wikipedia.org/wiki/Emoji](http://web.archive.org/web/20150418090011/http:/en.wikipedia.org/wiki/Emoji \"http://en.wikipedia.org/wiki/Emoji\")\n\nCheers, Si\n\n"
    },
    {
      "time": "28 Mar 2013 — 9:44pm",
      "content": "Ralf, do you mean in any _one_ color? Because Emoji are actually multi-colored bitmaps.\n\nhhp\n\n"
    },
    {
      "time": "28 Mar 2013 — 11:28pm",
      "content": "Other fonts with characters in those Unicode ranges:  \nSymbola: [http://users.teilar.gr/~g1951d/](http://web.archive.org/web/20150418090011/http:/users.teilar.gr/~g1951d/ \"http://users.teilar.gr/~g1951d/\")  \nAndroid Emoji: [https://github.com/android/platform\\_frameworks\\_base/tree/master/data/fonts](http://web.archive.org/web/20150418090011/https:/github.com/android/platform_frameworks_base/tree/master/data/fonts \"https://github.com/android/platform\\_frameworks\\_base/tree/master/data/fonts\")\n\n"
    },
    {
      "time": "29 Mar 2013 — 4:16am",
      "content": "Thanks!\n\nSi\n\n"
    },
    {
      "time": "29 Mar 2013 — 6:08am",
      "content": "I see almost every emoji on the Wiki page (except the two-glyph flags and the Apple PUAs). I do have Symbola 6.02 and a small assortment of CJK fonts installed.\n\n"
    },
    {
      "time": "29 Mar 2013 — 6:57am",
      "content": "I guess Emoji isn't only on OSX? But isn't there some kind of IP obstacle? Maybe I'm remembering things wrong.\n\nhhp\n\n"
    },
    {
      "time": "29 Mar 2013 — 6:15pm",
      "content": "Because the emoji are part of Unicode anyone is free to make a distribute a Unicode encoded emoji font. Apple does have the only color Unicode encoded font as far as I'm aware, but Windows 8 (and Windows 7 via an update) have traditional monochrome support, as does Windows Phone, and there are probably others. Some apps, like the mail and messenger apps in Windows 8 will in some cases switch out the glyph for a color bitmap when they hit an emoji in a mail or message.\n\n"
    },
    {
      "time": "29 Mar 2013 — 11:27pm",
      "content": "(And Microsoft's are much better-looking and stylistically stringent than Apple's mess.)\n\n"
    },
    {
      "time": "30 Mar 2013 — 10:20am",
      "content": "From what I recall of previous discussions, the Apple Color Emoji are more of a trade secret than anything, complete with undocumented tables.\n\n"
    },
    {
      "time": "30 Mar 2013 — 1:09pm",
      "content": "Previous: [http://typophile.com/node/83760](http://web.archive.org/web/20150418090011/http:/typophile.com/node/83760 \"http://typophile.com/node/83760\") (abstract); [http://typophile.com/node/96671#comment-523935](http://web.archive.org/web/20150418090011/http:/typophile.com/node/96671#comment-523935 \"http://typophile.com/node/96671#comment-523935\") (concrete).\n\nI don't run Windows at home, but if I can get my hands on the \"Segoe Symbol\" font I'll take a peek to see if this works the same as Apple's (ugly!) hack.\n\n> But isn't there some kind of IP obstacle? Maybe I'm remembering things wrong.\n\nThis forum software doesn't like them, that's for sure. It may have to do with the ultra-wide UTF encoding, or maybe not.\n\n:-)\n\n"
    },
    {
      "time": "31 Mar 2013 — 6:07pm",
      "content": "posted in error\n\n"
    },
    {
      "time": "1 Apr 2013 — 1:30am",
      "content": "Interestingly, Google's Gmail appears to have a full set of (bad) color Emoji available, including the rice balls and everything, but they're encoded and sent as images. Which rather defeats the purpose, you might as well have any set of smilies then.\n\n"
    },
    {
      "time": "2 Apr 2013 — 1:54am",
      "content": "Just tested on my Win 7 machine. It's updated to the latest Segoe UI Symbol font, but, alas, it doesn't appear to contain _color_ emoji's (at least, not in the same format as Apple's -- a few non-standard tables and a couple of megabytes of PNG images).\n\n ![](http://web.archive.org/web/20150418090011im_/http:/typophile.com/files/segoeuisymbol_4716.png)\n\nAre they in color on its \"native\" platform, Windows 8?\n\n"
    },
    {
      "time": "2 Apr 2013 — 8:07am",
      "content": "No, see my March 29th post above...\n\n\"Apple does have the only color Unicode encoded font as far as I'm aware, but Windows 8 (and Windows 7 via an update) have traditional monochrome support, as does Windows Phone, and there are probably others.\"\n\n"
    },
    {
      "time": "2 Apr 2013 — 8:38am",
      "content": "Apologies, Si, must've overlooked your post.\n\n> Some apps, like the mail and messenger apps in Windows 8 will in some cases switch out the glyph for a color bitmap when they hit an emoji in a mail or message.\n\n... must be the reason I kept finding images of colored emojis in Windows apps.\n\n"
    },
    {
      "time": "3 Apr 2013 — 11:01am",
      "content": "One more almost-a-font instance: Facebook supports some emoji, and displays properly encoded unicode emoji as embedded images. Doesn't copy-paste though.\n\n"
    },
    {
      "time": "3 Apr 2013 — 11:04am",
      "content": "Question: Has anybody noticed any download lag due to color Emoji? Aren't they a bit big, or does subsetting handle that fine? What I'm getting at is: Would it be viable to deliver colored _text_ instead?\n\nhhp\n\n"
    },
    {
      "time": "3 Apr 2013 — 1:43pm",
      "content": "Normally you would have to have the color emoji font on your machine, so no downloading is involved. But perhaps you are referring to systems which send you graphics to make up for not having a font?\n\n"
    },
    {
      "time": "3 Apr 2013 — 1:56pm",
      "content": "Hrant: _Would it be viable to deliver colored text instead?_\n\nWhat does that mean?\n\n"
    },
    {
      "time": "3 Apr 2013 — 2:30pm",
      "content": "What I'm talking about is hijacking the mechanism to deliver a color bitmap font (which could be installed, but maybe even \"streamed\").\n\nhhp\n\n"
    },
    {
      "time": "3 Apr 2013 — 3:16pm",
      "content": "Ah, now I sort of get you. The phrase 'deliver colored text' had me confused, because text is just character codes. So let's say that you're talking about delivering colour bitmap glyphs to represent those character codes. But what's the mechanism you propose 'hijacking'?\n\nWould you anticipate much performance difference between serving emoji colour bitmap image files and serving emoji colour bitmap images stored within a font file?\n\n"
    },
    {
      "time": "3 Apr 2013 — 10:23pm",
      "content": "I say \"hijack\" because I think it's all hush-hush. Has Apple published the font spec for color bitmaps? And how could it be made to work on Windows? Without being sued?\n\nPerformance: Back in the mid-90s I made the prototype of Mana-16, a bunch of tiny GIFs of grayscale letterforms coupled to a script that took a raw text file and generated an HTML file of hundreds of image declarations, thus rendering running text using grayscale bitmaps... The main performance problem was the size of the resultant HTML file! So an actual font was -and I suspect still must be- the only way to make this sing.\n\nBut this is all probably pointless anyway. Text size is too variable these days. Hmmm, unless a hand-made grayscale (or even better, subpixel) bitmap font can be rendered by collaging small hand-made elements that can be slid around, scaled, layered, to produce a range of sizes from a single master set... Man, I really have to stop thinking like a hacker.\n\nhhp\n\n"
    },
    {
      "time": "5 Apr 2013 — 7:16am",
      "content": "There's always a bit of lag while the bitmaps are fetched, but it shortens a lot once they're in the cache. If you have ever edited a post on a phpBB-based board, you'll know already. The editor has a bitmap (GIF or PNG) emoji insert feature, y'see.\n\n"
    },
    {
      "time": "7 Apr 2013 — 8:00am",
      "content": "I tried to insert live text of one of these creatures into the text here and the whole post disappears.\n\n"
    },
    {
      "time": "7 Apr 2013 — 8:26am",
      "content": "😉 (but this one is not live, I used the [HTML Entry](http://web.archive.org/web/20150418090011/http:/www.fileformat.info/info/unicode/char/1f609/index.htm))\n\n"
    },
    {
      "time": "7 Apr 2013 — 8:43am",
      "content": "Not showing on Windows (XP, FireFox) or OSX (FireFox or Safari). On Android (4.1) I actually get the little winking robot head though!\n\nhhp\n\n"
    },
    {
      "time": "7 Apr 2013 — 10:37am",
      "content": "👍👎\n\nTesting. I do see Boyer's emoji in color with Safari in OS X 10.7.\n\nDecimal works but hex not: &#x1f44d;\n\n"
    },
    {
      "time": "7 Apr 2013 — 10:41am",
      "content": "The one I use is 10.6.8 so maybe that's why. What version of Safari? What about FireFox?\n\nhhp\n\n"
    },
    {
      "time": "7 Apr 2013 — 10:57am",
      "content": "I don't think the Apple Color Emoji font works with any app in OS X 10.6. Do you have a black/white font like Symbola installed? It may work in Firefox if you set the default font to that.\n\n"
    },
    {
      "time": "7 Apr 2013 — 12:07pm",
      "content": "On 10.6.8, the only font I have that contains emoticons is DejaVu Sans. You can easily see using the character viewer or Apple's ftxinstalledfonts\n\n    % ftxinstalledfonts -f -U 0x1F609 | grep YES\n    56\tYES\tDejaVu LGC Sans Bold\n    135\tYES\tDejaVu LGC Sans Condensed\n    543\tYES\tDejaVu LGC Sans Condensed Bold\n    572\tYES\tDejaVu LGC Sans Bold Oblique\n    573\tYES\tDejaVu LGC Sans\n    580\tYES\tDejaVu LGC Sans Oblique\n    637\tYES\tDejaVu LGC Sans Condensed Oblique\n    703\tYES\tDejaVu LGC Sans Condensed Bold Oblique\n\nThose are all the fonts I have on 10.6 containing the winking face. If I set the default font in Firefox to Dejavu LGC Sans and override the font chosen by Typophile (Georgia), I see the winking face in Firefox on 10.6.8\n\n"
    },
    {
      "time": "7 Apr 2013 — 12:26pm",
      "content": "Wow, you didn't even have to do an incantation with worm's blood.\n\nhhp\n\n"
    },
    {
      "time": "7 Apr 2013 — 3:03pm",
      "content": "Well, if you are willing to resort to risky incantations, here is what you can get in Safari on OS X 10.6.8.\n\n ![](http://web.archive.org/web/20150418090011im_/http:/typophile.com/files/safari_3467.png)\n\nHow did I do that? I modified the system file `DefaultFontFallbacks.plist` and added ` DejaVuLGCSans` (postscript name) in the fallback fonts for serif.\n\nThe file is in this folder  \n/System/Library/Frameworks/ApplicationServices.framework/Versions/Current/Frameworks/Coretext.framework/versions/current/resources\n\nI had to reboot to get it working.\n\nMichel\n\nPS On 10.6.8 with the modified file `DefaultFontFallbacks.plist` the winking face also shows up in Firefox, without overriding Georgia, and in Google Chrome.  \n On 10.8.3, Google Chrome displays no winking face at all (colored or not).\n\n"
    },
    {
      "time": "8 Apr 2013 — 6:29am",
      "content": "Winky and the Thumbs show up on my rig (XP Pro; K-Meleon 1.6; DejaVu LGC Sans 2.33, Symbola 6.02)\n\n"
    },
    {
      "time": "8 Apr 2013 — 11:31am",
      "content": "BTW what's the webfont situation with emoji?\n\nhhp\n\n"
    }
  ]
}
