{
  "id": "101897",
  "title": "Coexist Foundation Competition",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "FOR IMMEDIATE RELEASE\n\nLONDON (Reuters) — In response to grassroots outrage against the lowercase \"t\" in the [Avant Garde type-font](http://web.archive.org/web/20141115074443/http:/en.wikipedia.org/wiki/ITC_Avant_Garde), the Coexist Foundation ( [www.coexistfoundation.net](http://web.archive.org/web/20141115074443/http:/www.coexistfoundation.net/ \"www.coexistfoundation.net\")) has launched a competition to amend two letters in said type-font, in order to promote better understanding between Jews, Christians, Muslims, Christians and Jews.\n\nAccording to Isabella Ward of the Coexist Foundation:  \n• Competition entrants may replace any two letters with a crescent and a Star of David, in both lowercase and uppercase forms.  \n• The letter \"K\"/\"k\" however must be left intact.  \n• In the further spirit of fairness the uppercase \"T\" must be modified to have the vertical element project above the horizontal element.  \n• In the Italic styles the \"T\", \"t\" and new letter shapes must remain upright, in order to avoid a skewed view of religion.  \n• No shapes from the tainted type-font Bookshelf Symbol 7 may be re-used.  \n• Consultation with Herb Lubalin is optional but encouraged.  \n• The competition entry fee is in the form of a modest tithe of 10% of year 2012 income.  \n• The winner of the competition will be awarded 10,000 blessings.\n\nThe Coexist Foundation competition has attracted controversy however. Type-font designer Matthew Margarinck has voiced his opposition to \"spec work\", the practice of providing servicing with no guarantee of compensation. Margarinck states: \"Although it is unfortunate that Avant Garde exhibits a provocative Christian cross where the second-most-frequent English letter should reside, it remains that speculation is contrary to all major religions.”\n\nHowever no controversy has arisen concerning any possible impact on the legibility of the resultant type-font. According to attorney Nick Femurr this is because Avant Garde is already impossible to read.\n\nIn order to facilitate submissions to the competition, the Coexist Foundation has produced a “before & after” sample showing one possible approach:\n\n ![](http://web.archive.org/web/20141115074443im_/http:/typophile.com/files/abrilmeg_6073.gif)\n\nRepresentatives from Hinduism, Buddhism, Sikhism, Baha'i, Shinto, Jainism and Zoroastrianism were unavailable for comment.\n\nhsp\n\n",
  "author": "hrant",
  "time": "1 Apr 2013 — 6:54am",
  "uid": "1250",
  "comments": [
    {
      "time": "1 Apr 2013 — 7:38am",
      "content": "April 1st.\n\n"
    },
    {
      "time": "1 Apr 2013 — 7:46am",
      "content": "Fools gold ;-)\n\n"
    }
  ]
}
