{
  "id": "101970",
  "title": "New Monotype eText Typefaces Optimized for e-Reading",
  "forum": "Home",
  "tags": [
    "Baskerville",
    "etext",
    "font",
    "fonts",
    "Helvetica",
    "malabar",
    "montoype",
    "News",
    "palatino",
    "sabon",
    "Ysobel"
  ],
  "content": " ![](http://web.archive.org/web/20140713053224im_/http:/typophile.com/files/new_4561.jpg)\n\nView eText Fonts: [http://bit.ly/XovVvK](http://web.archive.org/web/20140713053224/http:/bit.ly/XovVvK \"http://bit.ly/XovVvK\")  \nRead Press Release: [http://bit.ly/10wWpry](http://web.archive.org/web/20140713053224/http:/bit.ly/10wWpry \"http://bit.ly/10wWpry\")  \nRead Blog Post: [http://bit.ly/Z8lPcS](http://web.archive.org/web/20140713053224/http:/bit.ly/Z8lPcS \"http://bit.ly/Z8lPcS\")\n\nToday, Monotype announced the release of a [collection of typefaces](http://web.archive.org/web/20140713053224/http:/www.fonts.com/search/all-fonts?searchtext=etext) designed for digital reading environments, including e-books, web content, mobile applications, digital publications and online newspapers. Device manufacturers, digital publishers and Web designers can now turn to a selection that includes some of the most popular text faces used in print – designed and tuned for exceptional readability on e-readers, tablets, smartphones and other web-enabled devices.\n\nMonotype’s initial collection includes multiple weights of nine typeface families, designated for digital publishing:\n\nAmasis™ eText  \nMonotype Baskerville™ eText  \nPMN Caecilia® eText  \nITC Galliard® eText  \nMalabar™ eText  \nNeue Helvetica® eText  \nPalatino® eText  \nSabon® eText  \nYsobel™ eText\n\nTimeless designs such as Monotype Baskerville, ITC Galliard and Sabon were redrawn to improve readability on screen. Monotype typeface designers worked to impart a richer contrast, an even color, and slightly taller lowercase characters, all while ensuring that the typefaces appear as unmistakable cousins of their original print designs. The designs also include small caps and old style figures for professional-quality publishing design.\n\nAll typefaces in the collection have been hand-hinted to display with exceptional clarity cross mobile devices from smartphones to tablets and e-readers. The fonts also take advantage of Monotype’s Edge™ tuning technology, enabling publishers to create and deliver high-quality, readable text across various platforms, formats and devices, including E Ink® screens. The fonts look and perform best with devices that use Monotype’s iType® font engine for rendering text.\n\nThe new typefaces can be integrated in a number of ways:  \n- The fonts may be embedded in consumer devices for use as system fonts that can be custom-tuned for optimal display and performance to meet specific OEM device requirements.  \n- The fonts may be bundled within the source code of an e-book or digital publication title, enabling publishers to preserve intended design, branding and layout requirements. Displays that use either e-paper or LCD technology are supported.  \n- The fonts may be licensed as Web fonts from [Fonts.com Web Fonts](http://web.archive.org/web/20140713053224/http:/www.fonts.com/web-fonts)for HTML-based content, enabling high-quality reading experiences across various Web-enabled devices.\n\nTo view the new collection, visit [http://bit.ly/XovVvK](http://web.archive.org/web/20140713053224/http:/bit.ly/XovVvK \"http://bit.ly/XovVvK\") or contact Monotype for more information at [etext@monotype.com](mailto:etext@monotype.com).\n\nAbout Monotype  \nMonotype is a leading global provider of typefaces, technology and expertise that enable the best user experience and ensure brand integrity. Based in Woburn, Mass., Monotype provides customers worldwide with typeface solutions for a broad range of creative applications and consumer devices. The company’s library and e-commerce sites are home to many of the most widely used typefaces – including the [Helvetica](http://web.archive.org/web/20140713053224/http:/new.fonts.com/font/linotype/Helvetica)®, [Frutiger](http://web.archive.org/web/20140713053224/http:/new.fonts.com/font/linotype/Frutiger)® and [Univers](http://web.archive.org/web/20140713053224/http:/new.fonts.com/font/linotype/univers)® families – as well as the next generation of type designs. Further information is available at [www.monotype.com](http://web.archive.org/web/20140713053224/http:/www.monotype.com/ \"www.monotype.com\").\n\nMonotype, iType, Palatino, Sabon, PMN Caecilia, Neue Helvetica, Helvetica, Frutiger and Univers are trademarks of Monotype Imaging Inc. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. Edge and Ysobel are trademarks of Monotype Imaging Inc. and may be registered in certain jurisdictions. Galliard is a trademark of Monotype ITC Inc. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. Malabar is a trademark of Monotype GmbH and may be registered in certain jurisdictions. Monotype Baskerville and Amasis are trademarks of The Monotype Corp. and may be registered in certain jurisdictions. E Ink is a registered trademark of E Ink Corp. All other trademarks are the property of their respective owners. ©2013 Monotype Imaging Holdings Inc. All rights reserved.\n\n",
  "author": "JLH",
  "time": "3 Apr 2013 — 10:11am",
  "uid": "30653",
  "comments": [

  ]
}
