{
  "id": "101919",
  "title": "Typophile merchandise?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Thoughts for Typophile merchandise? Pitch in if you like. Just a fun idea sparked from another thread. You never know, we may end up with cool matching jackets. Like a bad-ass gang, only with fonts instead of ghetto-weapons (mine is “length of chain.”)\n\nSo far, someone has mentioned “letter sweater.”\n\nFollowing that logic, I would opt for [varsity jackets](http://web.archive.org/web/20150415105651/http:/www.jacketsinside.com/varsity-jackets-for-men/red-white-classic-varsity-jacket-for-men.html) (we can deal with embroidery later).\n\n ![](http://web.archive.org/web/20150415105651im_/http:/typophile.com/files/Typophile_jacket_5968.jpg)\n  \n_Figure 1_: A potential (unembroidered) red and white Typophile varsity jacket.\n\nAnd I’m not joking. Kickstarter could **easily** help produce an initial run.\n\n",
  "author": "Chris Dean",
  "time": "2 Apr 2013 — 12:57am",
  "uid": "/web/20150415105651/http://typophile.com/readthetype",
  "comments": [
    {
      "time": "2 Apr 2013 — 7:11am",
      "content": "This would be a perfect reward on Kickstarter to revamp the forum.\n\n"
    },
    {
      "time": "2 Apr 2013 — 7:13am",
      "content": "I’ll bring it to Jared’s attention next time I make a report. And I need a new jacket too. This one here has cotton sleeves, Not sure you can customize the leather sleeved jackets. I have a request in as we speak.\n\n"
    },
    {
      "time": "2 Apr 2013 — 7:39am",
      "content": "Can we pick custom texts on the back? Something like  \n\"Born to lead\"  \n\"Full metal body\"\n\n"
    },
    {
      "time": "2 Apr 2013 — 8:17am",
      "content": "Chris,\n\nI've been talking to Jared in private recently about a revamp that he'll hopefully share with the community. I hope it works out.\n\nAnyway, what will the design of the letter be?\n\n"
    },
    {
      "time": "2 Apr 2013 — 8:58am",
      "content": "Not sure what the design of the letter would be. Not even sure if it’s a jacket. I was more interested in generating different ideas for merchandise, not jacket logo design per-sé. We could debate logo design ’till the cows come home, and still be stuck on jacket. Kind of like putting the horse before the cart, or as I do, pick a font before I write the paper.\n\nHow about a paper-weight for those of us who still like paper? My grandfather left me a really nice gold one.\n\nI don’t need another coffee mug.\n\nAn apron like the kind letterpress printers wear would be pretty sweet.\n\nAny other ideas?\n\n(and best to use my last name too when there is more than one Chris in the thread ;)\n\n"
    },
    {
      "time": "2 Apr 2013 — 9:22am",
      "content": "Something to declare one's allegiance to type. Using this:  \n [http://www.flickr.com/photos/48413419@N00/6289279499](http://web.archive.org/web/20150415105651/http:/www.flickr.com/photos/48413419@N00/6289279499 \"http://www.flickr.com/photos/48413419@N00/6289279499\")\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2013 — 9:31am",
      "content": "A flag. Very cool. I’d fly that.\n\nA badass patch to sew on to the back of a jean-jackat would be an other clothing-bassed idea.\n\nI could use a new canteen or water bottle, I’m now trying to think or other utilitarian objects that have some sort of typographic association that aren’t like event-related swag (landfill).\n\nRemember, at this point in the game, there are no stupid ideas. Just throw them out there. Oftentimes they interact and spark new ideas.\n\n\\*ponder\\*\n\n"
    },
    {
      "time": "2 Apr 2013 — 9:41am",
      "content": "I need a wool hat, mittens, and scarf. All kinds of camping gear…\n\n"
    },
    {
      "time": "2 Apr 2013 — 9:46am",
      "content": "A tea pot with a letter T on it would be cute. Get it? “T” pot? We use something somewhat like this when we go camping/at the cottage:\n\n ![](http://web.archive.org/web/20150415105651im_/http:/typophile.com/files/can-stock-photo_csp0069219_4265.jpg)\n\n"
    },
    {
      "time": "2 Apr 2013 — 9:50am",
      "content": "Pillows. Use Biome.  \n [http://typophile.com/node/92450](http://web.archive.org/web/20150415105651/http:/typophile.com/node/92450 \"http://typophile.com/node/92450\")\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2013 — 9:55am",
      "content": "I actually need pillow covers believe it or not. And a new bath towel, dish cloth…\n\nA small pillow when camping is a real treat, but I do canoe camping, which means your kit can be significantly different from an ultralight hiking kit.\n\nFor example, we can bring a big cast-iron frying pan for cooking breakfast. Luxury. In canoe-camping land, the extent of your foot-travel is usually a short portage, so weight and bulk aren’t as much of a factor.\n\n"
    },
    {
      "time": "2 Apr 2013 — 9:58am",
      "content": "Not covers - that's boring. Pillows. Shaped like letters.\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2013 — 10:01am",
      "content": "There are those u-shaped ones people take on planes I think? I never really knew what the genesis for those was. Something neck related, but I don’t see myself sleeping with one. What are they for anyway?\n\n ![](http://web.archive.org/web/20150415105651im_/http:/typophile.com/files/pillow_3486.jpg)\n\n"
    },
    {
      "time": "2 Apr 2013 — 11:03am",
      "content": "Letter pillows sounds like a good idea. However, it depends on the quality and stitching to make them look appealing, in my opinion. Personally, I don't care for really full stuffing (as shown above).\n\nI prefer this sort of fill:\n\n![](http://web.archive.org/web/20150415105651im_/http:/cdn.blogs.babble.com/being-pregnant/files/letter-pillows/07-pillow.jpg)\n\nIt would also be nice if people could create their own design and we could vote on them.\n\n"
    },
    {
      "time": "2 Apr 2013 — 11:14am",
      "content": "And they need colophons.\n\nChris, it's for keeping your head upright when you sleep in a chair. But put ends on it and you have a cool Omega.\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2013 — 12:20pm",
      "content": " ![](http://web.archive.org/web/20150415105651im_/http:/typophile.com/files/877449524_c4bbb47398_o_5829.jpg)\n\n"
    },
    {
      "time": "2 Apr 2013 — 12:50pm",
      "content": "Chris,\n\nAre you sure that the pillow you showed is for necks and not for rear ends? I looks an awful lot like a hemorrhoid cushion to me…which, come to think of it, would be appropriate…\n\n"
    },
    {
      "time": "2 Apr 2013 — 1:23pm",
      "content": "Close. Large ones of those are used for nestling babies.\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2013 — 2:14pm",
      "content": "Chris, the U-shaped pillows wrap around your neck so they are unlikely to shift or fall, which is useful when you're sleeping sitting up in a car or plane.\n\n"
    },
    {
      "time": "2 Apr 2013 — 4:33pm",
      "content": "Hrant, I made one prototype pillow at sort of half-size, but I never got any produced. I'll send a pic if you want. The idea of making neck pillows that are really Biome c shapes is fun. But an e or s is no longer a neck pillow, for a human anyway.\n\nI would also be interested in other ideas for typeface swag. I think we're all a little bored with tees, mugs, stress balls and the like. What gets people excited? Felt coasters? Scarves (like Veer used to do)? Anything more utilitarian like furniture? Kitchen stuff?\n\n"
    },
    {
      "time": "2 Apr 2013 — 4:57pm",
      "content": "@crossgrove: Why not post the pillow photo for all to see? And I agree with anti-swag. Kitcher things are always useful. Keep price point in mind. I looked into hackets and found some up to $300 with leather sleeves and custom embroidery. Even if we could Kickstarter the initial run, we’d still have to buy them. I don’t think I can afford a $300 jacket right now, but I’ll keep looking.\n\nA small stool would be handy. I agree with scarf and kitchen. A cookbook where we all pick our favourite recipe (that you are capable of preparing) and design the page? Might be an opportunity for members who are also type designers to allow others to use their fonts for this purpose.\n\nUtilitarian, something we all need and use, food, hopefully a clever type correlation, capable of recieving custom treatment such as a silk-screen or embroidery, not landfill, not too expensive…\n\nCan anyone else think or other pragmatics?\n\nI find listing them to be helpful in idea generation (for me at least).\n\nFountain pen  \nBusiness card holder  \nBookmark (nice and cheep)\n\n(and of course after a month or so we'll have to make a decision and actually do it.)\n\n"
    },
    {
      "time": "2 Apr 2013 — 5:03pm",
      "content": "Carl, I'd love to see a photo - post it here!\n\nA \"C\" pillow (with a colophon about Biome) would be a great item for people traveling to/from a type conference... And an \"E\" for couples. :-) There's a reason that in Spanish the word for \"spouse\" is the same as \"handcuffs\". ;-)\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2013 — 5:39pm",
      "content": "What about chaps, anyone still wear those?\n\n"
    },
    {
      "time": "2 Apr 2013 — 6:09pm",
      "content": "> What about chaps, anyone still wear those?\n\nHey, thanks for reminding me ... Hrant you left your assless chaps under my bed.\n\nn.\n\n"
    },
    {
      "time": "2 Apr 2013 — 6:42pm",
      "content": "A gift for you next customer.\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2013 — 6:46pm",
      "content": "Haha.\n\nOn a serious note, what about totes? I'm always meaning to buy some but most are quite feminine.\n\nHere is one I like\n\n[Click to see product page ![](http://web.archive.org/web/20150415105651im_/http:/cdn.shopify.com/s/files/1/0167/4484/products/uppercase_tote_1024x1024.png)](http://web.archive.org/web/20150415105651/http:/shop.ugmonk.com/products/uppercase-tote-bag)\n\nThere's also coasters\n\n[Click to see product page ![](http://web.archive.org/web/20150415105651im_/http:/cdn.shopify.com/s/files/1/0167/4484/products/coasters_460c_1024x1024.png)](http://web.archive.org/web/20150415105651/http:/shop.ugmonk.com/products/punctuation-coasters-set-of-5)\n\nI like what UGMONK has been doing as a brand.\n\n"
    },
    {
      "time": "2 Apr 2013 — 7:07pm",
      "content": "I actually have a container fetish, but for some reason totes just don't do it for me. But messenger bags, OMG.\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2013 — 7:16pm",
      "content": "How about that custom cut carpet thing that Jessica made for her studio?  \nMaybe a little involved, I guess.\n\n"
    },
    {
      "time": "2 Apr 2013 — 7:27pm",
      "content": "I wasn't really a fan of those carpets she made. Now messenger bags I can agree with.\n\n"
    },
    {
      "time": "2 Apr 2013 — 8:37pm",
      "content": "Sticker packs!!\n\nn.\n\n"
    },
    {
      "time": "2 Apr 2013 — 8:38pm",
      "content": "Custom Swatch!!\n\nn.\n\n"
    },
    {
      "time": "2 Apr 2013 — 8:43pm",
      "content": "Belt buckle!!\n\nn.\n\n"
    },
    {
      "time": "2 Apr 2013 — 8:47pm",
      "content": "Custom sneeks!!\n\nVans:  \n [http://www.vans.com/customculture/](http://web.archive.org/web/20150415105651/http:/www.vans.com/customculture/ \"http://www.vans.com/customculture/\")\n\nConverse:  \n [http://www.converse.com/#/products/shoes/converseOne/scratch/all](http://web.archive.org/web/20150415105651/http:/www.converse.com/#/products/shoes/converseOne/scratch/all \"http://www.converse.com/#/products/shoes/converseOne/scratch/all\")\n\nn.\n\n"
    },
    {
      "time": "2 Apr 2013 — 8:48pm",
      "content": "Neon light!!\n\nn.\n\n"
    },
    {
      "time": "2 Apr 2013 — 8:51pm",
      "content": "> A gift for you next customer.\n> \n> hhp\n\nTHX!!\n\nn.\n\n"
    },
    {
      "time": "2 Apr 2013 — 10:44pm",
      "content": "A ball cap could be a good place to start. Not the most exciting choice, but inexpensive, one size fits all, and might appeal to a fairly wide group of people.\n\n"
    },
    {
      "time": "3 Apr 2013 — 6:26am",
      "content": "My “case” t-shirt is looking rather worse for wear now, I would like a replacement. The “body” t-shirt is still happy and I think the stickers are somewhere on a shelf.\n\nIt might be time for a type battle or at least a trawl through the archives.\n\nDo we all need bags for our make up?\n\n[http://www.oliverbonas.com/homeware/homeware\\_favourites/beauty\\_fragrance...](http://web.archive.org/web/20150415105651/http:/www.oliverbonas.com/homeware/homeware_favourites/beauty_fragrance/product_slug_9899.htm \"http://www.oliverbonas.com/homeware/homeware\\_favourites/beauty\\_fragrance/product\\_slug\\_9899.htm\")\n\nTim\n\n"
    },
    {
      "time": "3 Apr 2013 — 7:37am",
      "content": " **@ALL** : Does anyone know a Typophile who can knit?\n\n"
    },
    {
      "time": "3 Apr 2013 — 8:31am",
      "content": "All Typophiles can knit. But will they?\n\nAren't all chaps \"assless\"?\n\nI don't have a 3rd koan for you today. Just a photo.\n\n ![](http://web.archive.org/web/20150415105651im_/http:/typophile.com/files/Biomepillow_5444.jpeg)\n\n"
    },
    {
      "time": "3 Apr 2013 — 9:12am",
      "content": "_Aren't all chaps \"assless\"?_\n\nExcept for the ones that chap your ass, I suppose so…\n\n"
    },
    {
      "time": "3 Apr 2013 — 9:22am",
      "content": "I can sew but I can't knit (there's a difference).\n\n"
    },
    {
      "time": "3 Apr 2013 — 10:12am",
      "content": "\\> Kickstarter could easily help produce an initial run\n\nBut isn't Kickstarter mainly a way to make a financial appeal to a wide group of people? I don't know why anyone outside of Typophile regulars would want Typophile-branded merchandise.\n\n"
    },
    {
      "time": "3 Apr 2013 — 10:46am",
      "content": "That's why stuff with something like this  \n [http://www.flickr.com/photos/48413419@N00/6289279499](http://web.archive.org/web/20150415105651/http:/www.flickr.com/photos/48413419@N00/6289279499 \"http://www.flickr.com/photos/48413419@N00/6289279499\")  \nwould be better.\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2013 — 12:24pm",
      "content": "> @ALL: Does anyone know a Typophile who can knit?\n\nIf you want to outsource ... Nepal has some awesome knitting co-ops which make high quality sweaters (and other knitted goods) knitted to your specific design requirements. I don't know if they would do one offs or not.\n\nn.\n\n"
    },
    {
      "time": "4 Apr 2013 — 4:48pm",
      "content": "What about a coffee mug? And not just any ordinary coffee mug either, what about a coffee mug that has miraculous powers?\n\nn.\n\n"
    },
    {
      "time": "4 Apr 2013 — 5:26pm",
      "content": "> What about a coffee mug?\n\nUnless the coffee mug had an ampersand handle, there's enough of them floating around. Don't you think?\n\n"
    },
    {
      "time": "4 Apr 2013 — 5:37pm",
      "content": "What are the chances of getting a tea mug that's a \"T\"?\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2013 — 5:41pm",
      "content": "> What are the chances of getting a tea mug that's a \"T\"?\n\nYou mean the whole thing or just the handle?\n\n"
    },
    {
      "time": "4 Apr 2013 — 5:44pm",
      "content": "Ampersand handle would be neato, but no I don't there's enough of them floating around.\n\nEspecially one that would have letter's fill in when the temp of the mug changed or one that went from fill to outline as the coffee level lowered.\n\nBut none of the above is what I'm talking about. I'm talking about a Typophile coffee mug with such miraculous powers that it could cure bad kerning all by itself!\n\nAs the legend of the Typophile coffee mug grew I'm sure lots of reports would come in from all around the globe ...perhaps even seen on ISS!\n\nn.\n\n"
    },
    {
      "time": "5 Apr 2013 — 3:29am",
      "content": "A compiled list to date:\n\nLetter sweater  \nVarsity jacket  \nPaper weight  \nApron  \nFlag  \nJean jacket patch  \nHat  \nMittens  \nScarf  \nCamping kit  \n“T” pot  \nLetter-shaped pillows  \nT-shirt  \nMug  \nFurniture  \nKitchen tools  \nStool  \nCookbook  \nFountain pen  \nBusiness card holder  \nBookmark  \nChaps (with assless option)  \nTote  \nCoasters  \nMessanger bag  \nCarpet  \nStickers  \nSwatch  \nBelt buckle  \nSneakers  \nLighting  \nBall cap  \nT shirt  \nMug (with ampersand handle & magical powers option)  \n“T” cup\n\nKeep going.\n\n"
    }
  ]
}
