{
  "id": "101932",
  "title": "LATIN AMERICAN TYPE BOOK RELEASE (30% OFF)",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "30% de descuento en \"Tipografía Latinoamericana\" 42 diseñadores, tipógrafos, investigadores y docentes, que narran sus experiencias, reflexiones, procesos y resultados. ¡No se lo pierdan!\n\n[![Tlatam](http://web.archive.org/web/20150414164048im_/http:/lamonaca.org/wp-content/uploads/2013/02/jpg.jpg \"Tlatam\")](http://web.archive.org/web/20150414164048/http:/lamonaca.org/tipografia-latinoamericana/)\n\n[**\"http://lamonaca.org/tipografia-latinoamericana/\"**](http://web.archive.org/web/20150414164048/http:/lamonaca.org/tipografia-latinoamericana/)\n\n**For English speakers** : this book is a collection of 42 designers, typographers, researchers, and teachers that narrate their experience, reflections, process and results. Personally I think it's one of the most important book releases in regional typeface design :)\n\n**Authors: Zalma Jalluf, Ewan Clayton, Julio Ferro, Eduardo Rodríguez Tunni, Fernando Díaz, Lautaro Hourcade, Viviana Monsalve, Patricia Benítez, Fabio Ares, María Laura Fernández, Miguel Catopodis, Alejandro Valdez, Juan Heilborn, César Puertas, Ignacio Martínez-Villalba, Felipe Cáceres, Francisco Calles, Cristóbal Henestrosa, María Teresa Bruno, Juan Pablo del Peral, Fábio Lopez, Fábio Haag, Tony de Marco, Francisco Gálvez, Marcela Romero, Aldo de Losa, Henrique Nardi, Gustavo Wojciechowski, Marina Chaccur, Juan Carlos Darias, Víctor García, Marina Garone Gravier, Juan Pablo de Gregorio, Cláudio Rocha, Cecilia Consolo, Pablo Cosgaya, Alejandro Paul, Rubén Fontana, Diego Vainesman, Oscar Yáñez, Dave Crossland.**\n\n**Prologue:** José de los Santos\n\n**Compilator: Vicente Lamónaca**\n\n**Thanks in advanced for spreading the word**\n\n",
  "author": "ferfolio_2",
  "time": "2 Apr 2013 — 11:27am",
  "uid": "209335",
  "comments": [
    {
      "time": "2 Apr 2013 — 11:36am",
      "content": "Great, but we need an English version. I would offer to do the translation, as I did for Rault's book on Excoffon: [http://www.adverbum.fr/roger-excoffon-rault-david-atelier-perrousseaux\\_o...](http://web.archive.org/web/20150414164048/http:/www.adverbum.fr/roger-excoffon-rault-david-atelier-perrousseaux_ouvrage-perrousseaux_4itkob6k386b.html \"http://www.adverbum.fr/roger-excoffon-rault-david-atelier-perrousseaux\\_ouvrage-perrousseaux\\_4itkob6k386b.html\")\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2013 — 11:49am",
      "content": "Thanks Hrant.\n\nLet's talk about this in a few months  \nOK?\n\nhug from Montevideo, Uruguay\n\n"
    },
    {
      "time": "2 Apr 2013 — 11:51am",
      "content": "Any time - thank you for considering it.  \nIn the meantime, I will buy this one! :-)\n\nhhp\n\n"
    }
  ]
}
