{
  "id": "10209",
  "title": "Usage of AE and OE ligatures",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is there a set of rules for the use of AE and OE ligatures in English? I realize that modern English does not use these ligatures, but if I chose to use them, would I substitute them for EVERY occurrence of \"ae\" and \"oe\", or would it be selective?   \ne.g. what if the 'o' and the 'e' belong to separate syllables?\n\n",
  "author": "Jonathan Clede",
  "time": "25 Feb 2003 — 5:26am",
  "uid": "1315",
  "comments": [
    {
      "time": "25 Feb 2003 — 6:30am",
      "content": "The\n\n"
    },
    {
      "time": "25 Feb 2003 — 7:57am",
      "content": "Curriculum Vit\n\n"
    },
    {
      "time": "25 Feb 2003 — 9:30am",
      "content": "\\>\\>Curriculum Vit\n\n"
    },
    {
      "time": "25 Feb 2003 — 10:40am",
      "content": "These letter combinations constitute diphthongs, i.e. two vowels pronounced as a single vowel. Their use in modern English is largely limited to words of French origin, but they can now always be replaced by the sequences ae and oe. Conversely, they cannot be used in all contexts that ae and oe occur. Languages with phonetic spelling systems typically treat all combinations of two vowels as diphthongs unless marked otherwise by a diaeresis; English, with its etymological spelling system, does not have this consistency and generally fails to visually distinguish diphthongs.   \n  \nTraditionally, the\n\n"
    },
    {
      "time": "25 Feb 2003 — 10:45am",
      "content": "\\>\\>Curriculum Vit\n\n"
    },
    {
      "time": "25 Feb 2003 — 10:57am",
      "content": "Just wondering, fusing this and another recent topic: how is \"Hoefler\" correctly pronounced?\n\n"
    },
    {
      "time": "25 Feb 2003 — 11:48am",
      "content": "(1) yay for this topic (have been trying to learn about ligatures) and;   \n   \n(2) uh, \"heff-ler?\"\n\n"
    },
    {
      "time": "25 Feb 2003 — 12:32pm",
      "content": "Still along the same subject line: where can I find a good resource detailing ligatures? I just assumd that the ct and st ligatures could be used at your own discression.\n\n"
    },
    {
      "time": "25 Feb 2003 — 12:48pm",
      "content": "H\n\n"
    },
    {
      "time": "25 Feb 2003 — 1:32pm",
      "content": "Koeiekat: you mean bastardization of \"pronunciation\". \\*cough\\* ![:-)](http://web.archive.org/web/20131022005735im_/http:/www.typophile.com/forums/clipart/happy.gif)  \n  \nThe German\n\n"
    },
    {
      "time": "25 Feb 2003 — 3:09pm",
      "content": "Correct. Thus ... bastardization\n\n"
    },
    {
      "time": "25 Feb 2003 — 8:07pm",
      "content": "See? This is why I hate saying proper names aloud (still smarting from that ugly Sotheby's incident in college).   \n   \nI might be tempted to blame our (American) manglings not only on a lousy language curriculum but also on some latent bitterness from those folks at Ellis Island taking liberties with the spelling of great-great grandaddy's last name.\n\n"
    },
    {
      "time": "26 Feb 2003 — 8:50am",
      "content": "Tracy, do not feel ashamed. Despite all the learned discourse on German pronunciation (and the bastardization of same -- which I can't dispute), as far as I know, Jonathan has never winced at \"Heff-ler\".   \n   \nIn fact, if you call up HTF, you'll hear Jonathan himself on the message thanking you for calling the \"Heff-ler\" Type Foundry. 212-777-6640.   \n   \nWhen in doubt, go to the source.   \n   \n-- K.\n\n"
    },
    {
      "time": "26 Feb 2003 — 12:38pm",
      "content": "Thank you; I think the redness may have finally left my cheeks...\n\n"
    },
    {
      "time": "26 Feb 2003 — 12:46pm",
      "content": "There's a healthy, archived thread on ligatures here:   \n [http://www.typophile.com/forums/messages/4100/1097.html](http://web.archive.org/web/20131022005735/http:/www.typophile.com/forums/messages/4100/1097.html)\n\n"
    }
  ]
}
