{
  "id": "10203",
  "title": "(x) NY Times Magazine skinny slab serif - Stymie {George Gozum}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "This face is used throughout last week's Design Special Issue. They've used it before and now I just gotta know.   \n   \nAny thoughts? ![NY Times Magazine Specimen](http://web.archive.org/web/20141114185328im_/http:/www.typophile.com/forums/messages/83/69176.jpg)\n\n",
  "author": "Kyle Talbott",
  "time": "8 Apr 2005 — 10:53am",
  "uid": "2493",
  "comments": [
    {
      "time": "8 Apr 2005 — 11:03am",
      "content": "Perhaps a customized version of [Memphis?](http://web.archive.org/web/20141114185328/http:/www.myfonts.com/fonts/linotype/memphis/light/testdrive.html?s=High-rise&p=72)\n\n"
    },
    {
      "time": "8 Apr 2005 — 11:23am",
      "content": "I would argue for a customized [Lubalin](http://web.archive.org/web/20141114185328/http:/www.myfonts.com/fonts/bitstream/itc-lubalin-graph/extra-light/testdrive.html?s=High+rise&p=48) but I'm sure its probably a different font.\n\n"
    },
    {
      "time": "8 Apr 2005 — 11:24am",
      "content": "Looks more Lubalin Graph than Memphis.   \n   \nI can't find a lighter versi\n\n"
    },
    {
      "time": "8 Apr 2005 — 11:30am",
      "content": "Thanks James.   \n   \nGood call. I can totally see that... (linotype.com).   \n   \nDamn. If I could just get the wonderful line weight right out of the box...   \n   \nLet's see what others come up with.   \n   \nKyle\n\n"
    },
    {
      "time": "8 Apr 2005 — 11:33am",
      "content": "[ITC's version](http://web.archive.org/web/20141114185328/http:/www.myfonts.com/fonts/itc/lubalin-graph/xlit/testdrive.html?s=High+rise&p=72) has the correct r. So does Linotype's, but Bitstream has a hook on the r.   \n   \nIt still looks customized.\n\n"
    },
    {
      "time": "8 Apr 2005 — 11:38am",
      "content": "I have a friend at the Times special mags, I can ask him if it's a commercially available font. But since the Times tends to get original/proprietary fonts drawn, like their lovely light Cheltenham, it may not be for sale to us peons.\n\n"
    },
    {
      "time": "8 Apr 2005 — 12:12pm",
      "content": "Dear Patricia,   \n   \nThat would be great.   \n   \nAs the above research (and mine - I've got both Memphis, Lubalin & Calvert open right now) demonstrates we can get close but not perfect.   \n   \nIt's a beautiful redraw.\n\n"
    },
    {
      "time": "8 Apr 2005 — 8:53pm",
      "content": "The Times has been using Stymie. It must be an Ultra Light version, as I only have up to a Light weight, but it seems like the same characters. Bitstream's version appears to be the closest - the lower-case 'r' seems to vary with different foundries, with the previously mentioned hook.   \n   \n [http://www.myfonts.com/fonts/bitstream/stymie/light/testdrive.html?s=High-rise&p=72](http://web.archive.org/web/20141114185328/http:/www.myfonts.com/fonts/bitstream/stymie/light/testdrive.html?s=High-rise&p=72)   \n   \nI've been besotted with those self-same slab serif fonts since last Fall's special issue of the Times' T magazine, and I called and asked the art directors ..er... directly, and they were very helpful. The irony is that I've had the font in my company's library all this time...\n\n"
    },
    {
      "time": "8 Apr 2005 — 11:02pm",
      "content": "Stymie was my first guess too but no version/weight I could find had that distinctive vertical dot on the i.\n\n"
    },
    {
      "time": "10 Apr 2005 — 2:36pm",
      "content": "So George, how many beers do I have to buy for the NYTimes staff to get a license for the font?   \n   \nPatricia, if he can't answer that one, what say your friend?   \n   \n ![:-)](http://web.archive.org/web/20141114185328im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n--   \nEveryone, thanks for the invaluable help. Stymie was off the radar and I was about to redraw Lubalin Graph, and then I came across Lubalin Graph XLit it has the closest line weight but with a higher x-height than the specimen [http://www.myfonts.com/fonts/itc/lubalin-graph/xlit/](http://web.archive.org/web/20141114185328/http:/www.myfonts.com/fonts/itc/lubalin-graph/xlit/).   \n   \nI am all the more knowlegeable but still coveting the face. Besotted, indeed.\n\n"
    },
    {
      "time": "11 Apr 2005 — 3:37pm",
      "content": "Kyle,   \n   \nI finally heard back from my friend and he confirmed that yes, it is a Times custom font.   \n   \nNot the answer you wanted I know.\n\n"
    },
    {
      "time": "11 Apr 2005 — 8:27pm",
      "content": "Ah Kyle - I wish I knew that answer - I've had quite a few font infatuations meself! I usually wait until I find another obsession and move on - unsatisfied but renewed! ;)   \n   \nLubalin Graph XLit approximates the weight, but I do prefer Stymie's lowercase \"a\" - it just makes it more approachable, I think. This reminds me of how I was obsessed with Teleneue and then saw the XLit version in \\*surface magazine, which brought the need to a whole new level...!\n\n"
    },
    {
      "time": "12 Apr 2005 — 6:43am",
      "content": "There was an ITC face called L&C Stymie Lightline which was similar to this, but there are differences such as the dot on the i. Also, it has not been digitized (AFAIK).\n\n"
    },
    {
      "time": "12 Apr 2005 — 8:31am",
      "content": "Image Club had ITC Stymie Hairline in the last couple of its Letterpress CD's (5.0 and 6.0, which I have). Does that sound like the same thing Mark? I can make a sample from it, if you'd like to see it.\n\n"
    },
    {
      "time": "12 Apr 2005 — 8:43am",
      "content": "Yes, I think it would be the same thing. It was part of the initial set of typefaces ITC released, all display faces, some picked up from VGC designs done by the ITC people before ITC was formed in 1970. The L&C (which stands for Lubalin and Carnase) may have been dropped at some point.\n\n"
    },
    {
      "time": "12 Apr 2005 — 8:44am",
      "content": "Patricia- Thank you very much. Until my infatuation subsides I will just continue to enjoy the Times Magazine each Saturday. What a treat...   \n   \nGeorge- Your trailing love for type sounds familiar. I think that it one of the reasons why we continue to appreciate, use and make these things.   \n   \nMike- Yes, Please make a sample. If it scratches the itch I will press ITC for more info.   \n   \nThanks y'all.\n\n"
    },
    {
      "time": "12 Apr 2005 — 8:59am",
      "content": "Here's High-rise in Stymie Hairline (the i-dot is not a line and the r shape is wrong).   \n ![Stymie Hairline sample](http://web.archive.org/web/20141114185328im_/http:/www.typophile.com/forums/messages/83/69562.gif)\n\n"
    },
    {
      "time": "12 Apr 2005 — 9:33am",
      "content": "Whoa. That's close. Thanks for the search and display.   \n   \nPardon my ignorance, is Image Club @ [www.imageclub.com](http://web.archive.org/web/20141114185328/http:/www.imageclub.com/) ? Should I contact them? Would it be wise to contact ITC first?   \n   \nKyle\n\n"
    },
    {
      "time": "12 Apr 2005 — 12:47pm",
      "content": "Stymie's definitely experiencing a resurgence in popularity (assuming it was ever popular, considering it's not that new a font). I've seen posters as well as logos using the font in the West Village, and I just became aware of it because of the New York Times' T magazine usage.\n\n"
    },
    {
      "time": "12 Apr 2005 — 2:49pm",
      "content": "Kyle,   \nSorry for the delay, but I've been gone all day. Image Club fonts are now sold by Monotype Imaging (Fonts.com), but Stymie Hairline is no longer in their collection. As I understand it you can still get some of the old Letterpress 6.0 CD's (Typophile Grant Hutchinson recently had some, if you want to get in touch with him.)   \n   \n [Serifa](http://web.archive.org/web/20141114185328/http:/www.myfonts.com/fonts/urw/serifa/thin/testdrive.html?s=High-rise&p=72), by Adrian Frutiger, has Thin weight, which is about as close in something commercial that I know. You could also write to me (off thread) for other ideas.\n\n"
    },
    {
      "time": "14 Apr 2005 — 9:03am",
      "content": "Dear Mike,   \n   \nThanks for the thoughtful responses. I will follow through with Mr. Hutchinson as time permits. Thank you for the lead.   \n   \nEveryone else, thank you very much for your help.   \n   \nI'll probably be seeing some of you at TypeCon2005.   \n   \nKyle\n\n"
    },
    {
      "time": "18 Oct 2005 — 12:18pm",
      "content": "can someone put a post in the general discussion area on how to post images???\n\n"
    },
    {
      "time": "18 Oct 2005 — 3:15pm",
      "content": "Not possible yet -- this is a revived old thread which predates version 2.\n\n"
    }
  ]
}
