{
  "id": "102067",
  "title": "Typography to reflect swedish furniture design",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello typhofiles,  \nI am a graphic design student that could use some help. At the moment I am working on an assignment where I am to create a visual identity for a design hotel which has swedish furniture design as it's theme. It should reflect both the contemporary design and the design history.\n\nWhen I think of swedish furniture design I think of functionalism, rational design, clean and stylistically pure furniture. I immediately thought of Futura for the typography, and therefore chose the classic combination Futura and Bodoni.\n\nMy teacher however had this to say about my choices: Excepted+safe=boring. He told me to explore the world of typography and come up with something that feels more modern.\n\nAny suggestions on where to start looking? Any hands-on suggestions on which fonts to try? Any help is appreciated. Thanks!\n\n",
  "author": "decipher",
  "time": "6 Apr 2013 — 10:12am",
  "uid": "210446",
  "comments": [
    {
      "time": "6 Apr 2013 — 10:26am",
      "content": "You teacher is right. Futura, shmutura.\n\nTry _these_ on for size:  \n [http://typographica.org/typeface-reviews/fenland/](http://web.archive.org/web/20140720173115/http:/typographica.org/typeface-reviews/fenland/ \"http://typographica.org/typeface-reviews/fenland/\")  \n [http://fountaintype.com/typefaces/satura-suite/](http://web.archive.org/web/20140720173115/http:/fountaintype.com/typefaces/satura-suite/ \"http://fountaintype.com/typefaces/satura-suite/\") (It's even made it Sweden!)\n\nhhp\n\n"
    },
    {
      "time": "6 Apr 2013 — 12:50pm",
      "content": "Another Swedish foundry: [Letters from Sweden](http://web.archive.org/web/20140720173115/http:/lettersfromsweden.se/).\n\nA word of advice: Make concious choices! Just choosing something because someone here says ‘try this’, or because it irks your teacher, is not good for your education. Try to understand why a particular typeface works better or worse in the context.\n\n"
    },
    {
      "time": "6 Apr 2013 — 12:57pm",
      "content": "Good advice; hence \"try\", not \"just use\" (the latter being the typical mindframe of many who use/recommend things like Futura or Helvetica). And remember, giving recommendations without elaboration does not make it a thoughtless recommendation; it often means the guy is too busy.\n\nhhp\n\n"
    },
    {
      "time": "6 Apr 2013 — 12:59pm",
      "content": "{Duplicate}\n\n"
    },
    {
      "time": "6 Apr 2013 — 2:25pm",
      "content": "Remember that typography is much more than choosing a typeface. How you use it is of vital importance. Learning how to use it is not a five minute task, either. Search for contemporary typography which has a modern edge that suits the furniture. Mostly, look at he shapes of the furniture. What typefaces work best with those shapes?\n\n"
    },
    {
      "time": "6 Apr 2013 — 3:26pm",
      "content": "That was neither meant as critique against you, Hrant, nor the OP. Just my gut reaction to the teacher sending students on a search for something more “modern”. For one thing, Bodoni is the defining face of the _modern_ genre and Futura is the … “future” :)\n\nMore importantly, a great typeface doesn’t stop being great just because it’s (relatively) old.\n\n"
    },
    {
      "time": "6 Apr 2013 — 3:53pm",
      "content": "I think Henrik's use of \"modern\" (which might have come from his teacher) could be throwing things off, especially if we don't know if he meant to capitalize it or not. :-) It's a supremely over-loaded term. In Spain for example \"el modernismo\" refers to things like Gaudí's crazy-amazing stuff! I have a feeling he just meant \"contemporary\" but -very humanly- wanted to save three syllables.\n\nAge however indeed has nothing to do with it; ubiquity on the other hand does.\n\nhhp\n\n"
    },
    {
      "time": "6 Apr 2013 — 9:43pm",
      "content": "_He told me to explore the world of typography…_\n\nWell why don’t you?  \nRather than ask for the answer, ask where to look and how to look.  \nPerhaps your teacher could give you some help with that, as “explore the world of typography” is not much help when you’re looking for a typeface!  \nLike saying “explore the dictionary” when you’re looking for a word.\n\n"
    },
    {
      "time": "7 Apr 2013 — 2:11am",
      "content": "Thank you for the advices guys! I think my teacher wants to push me to go beyond the obvious choices here.\n\nThis is kind of the mood I was thinking of in the first place:  \n [http://www.lammhults.se/](http://web.archive.org/web/20140720173115/http:/www.lammhults.se/)\n\nMy teacher didn't say my choices for the typography was wrong, he just said it was what one would expect, and therefore kind of boring. It doesn't stand out of the crowd, if you know what I mean.\n\nThe world of typography is quite enormous so therefore I felt a bit overwhelmed. Thats why I wanted to see what associations other people got when they thought of the theme. I wasn't expecting a ready-to-use solution here, I just wanted to find a spot in the world of typography were I could start looking. :)\n\nThe suggestions in this post is slowly giving me a new perspective of things. Thanks!\n\n"
    },
    {
      "time": "7 Apr 2013 — 6:49am",
      "content": "To my eye, the Swedish lines are both clean and sexy, in a gently sinuous way. Why not exploit that characteristic, and go with a sexy, sinuous typeface. Oddly, Goudy Sans comes to mind…\n\n"
    },
    {
      "time": "7 Apr 2013 — 8:12am",
      "content": "Swedish and furniture of course screams IKEA... And they used Futura for a long time, before swithcing to Verdana, for whatever reason. So any combination of especially the bolder weights of Futura and furniture feels comfortable, coz you've seen it so many times already.\n\nI would 2nd Nick Shinn here and say: live a little, explore, try out. Try out things you never have seen and see what works, and what does not. You might well just start by using the fonts already on your computer, and you would hardly ever see or use otherwise. Try to find the characteristics in typefaces for yourself.\n\nIf you want to look for pay-fonts, possibly scandinavian, I would have a look at Fountain:\n\n[http://www.fountaintype.com/catalogue](http://web.archive.org/web/20140720173115/http:/www.fountaintype.com/catalogue \"http://www.fountaintype.com/catalogue\")\n\n"
    },
    {
      "time": "7 Apr 2013 — 8:14am",
      "content": "(if you want my personal tip: try Satura from Fountain, especially the ‘parts’ version. I have long admired it, but never have found a real use for it. This might just be perfect)\n\n"
    },
    {
      "time": "7 Apr 2013 — 1:16pm",
      "content": "As the relationship between contemporary and historical design is in the brief, you should investigate historical branding of Swedish furniture businesses, going back beyond Ikea.\n\nThat poses a problem you need to resolve, as Danish mid-century modern furniture is the recognized historical brand in that genre. Can Swedish design be differentiated from Scandinavian in general, other than by using Swedish-designed typefaces?\n\n[http://typophile.com/node/89250](http://web.archive.org/web/20140720173115/http:/typophile.com/node/89250 \"http://typophile.com/node/89250\")\n\n"
    },
    {
      "time": "7 Apr 2013 — 2:37pm",
      "content": "Re. Scandinavian design: I have designed [a typeface](http://web.archive.org/web/20140720173115/https:/monokrom.no/) that I envisioned used for this kind of work.\n\n"
    },
    {
      "time": "8 Apr 2013 — 2:40am",
      "content": "On a tangent, how about [Dala Floda](http://web.archive.org/web/20140720173115/http:/commercialtype.com/typefaces/dala_floda/)? It's at least named after a Swedish town, and it's naked constructedness feels very furniture.\n\n"
    },
    {
      "time": "8 Apr 2013 — 6:55am",
      "content": "Nothing says Swedish furniture like IKEA Sans, IKEA Serif, and IKEA Script. The company stopped using those fonts about four years ago, but I see that IKEA Sans is again being used in the 2013 catalog, along with Verdana ... - Herb\n\n"
    },
    {
      "time": "9 Apr 2013 — 2:33pm",
      "content": "Wow, it's quite amazing to get all this opinion, advice and suggestions in such short time. This forum is great!\n\nAs some of you and also my teacher pointed out, using Futura is not very creative for this assignment. It's suitable cause It makes you think of Ikea (Ikea sans looks almost identical to Futura) and numerous other swedish furniture companies, but good graphic design is not about reproducing whats already out there. If you want to stand out you need to find new and exciting approaches to things.\n\nSo… I've left the safe Futura-harbour behind and am doing some exploring right now. Fountain and Monokrom, for example, are new and pleasant acquaintances. Thanks a lot you guys.\n\n"
    },
    {
      "time": "9 Apr 2013 — 4:52pm",
      "content": "I see I'm beaten to the race here, but you can't get closer to scandinavian 'funkis' than Monokrom's Telefon, which is based on Norwegian functionalism archtectual lettering. Futura-esque but more modern and softer at the same time.\n\nFor a more scandinavian-contemporary feel, maybe something in the same ballpark but lighter, thinner?\n\nI also agree Dala Floda would be a cool face to use for swedish modernist furniture.\n\n"
    },
    {
      "time": "10 Apr 2013 — 1:31am",
      "content": "Like the Swiss design style from the 1950s, the Scandinavian design style has a _halo effect_ that reaches beyond borders and time. There are even similarities (due to the roots and influences of the time) in both styles, in terms of clarity and simplicity of design solutions.\n\nSwiss design refers more to graphics than furniture and has a strong industrial tendency. A great distinction of Nordic design is the warmth of bright colours in contrast with dark elements, materials like birch wood and soft, organic shapes found in Swedish furniture design.\n\nI believe that a designer’s understanding of Swedish design today is more influenced by contemporary interior styles than [what people recognize](http://web.archive.org/web/20140720173115/http:/www.houzz.com/swedish-style-chairs) as Swedish Design today. It certainly doesn’t stop at Ikea.\n\nFutura is a post WWI font influenced by Art Deco and the Bauhaus philosophy. Aside of graphical shapes, it has almost nothing in common with what I would classify as modern Swedish furniture style.\n\nIf warmth, organic shapes, bright wood and a lot of white are style elements of Swedish interior design, then I would look into a Humanist Sans Serif typeface. Certainly nothing industrial, like Helvetica Neue and nothing too close to Bauhaus or Art Deco, like Futura.\n\n[Open Sans](http://web.archive.org/web/20140720173115/http:/www.fontsquirrel.com/fonts/open-sans) comes to my mind, as well as [Freight Sans Pro](http://web.archive.org/web/20140720173115/http:/www.myfonts.com/fonts/garagefonts/freight-sans-pro/) (this is the new Facebook font). A great balance provides [Samo Sans Pro](http://web.archive.org/web/20140720173115/http:/www.myfonts.com/fonts/carnoky/samo-sans-pro/), which isn’t commonly used, but well designed. Another option would be [Gesta](http://web.archive.org/web/20140720173115/http:/www.myfonts.com/fonts/r-type/gesta/) – maybe because it has this dry approach with a subtle softness and narrow characters.\n\n"
    },
    {
      "time": "10 Apr 2013 — 5:08am",
      "content": "The name Dala Floda seems to hint at a connection to Dalarne in Sweden. There’s even an area in Dalarne called Dala-Floda. You might know the famous wooden [Dala horse](http://web.archive.org/web/20140720173115/http:/creativeroots.org/wp-content/uploads/2010/12/swedish-dala-horse.gif).\n\n"
    }
  ]
}
