{
  "id": "102101",
  "title": "grotesk",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hi everybody-\n\nI'm not a big expert in font and in graphics but I love typography. I write a lot for my job (something similar to a lawyer) and until now I've used folio. I'm getting a little bored with it so i'm looking for something new.\n\nI really love grotesk and I've maybe found some replacement for folio: [supria sans](http://web.archive.org/web/20130821054047/http:/www.myfonts.com/fonts/hvdfonts/supria-sans/), [klim's founders grotesk](http://web.archive.org/web/20130821054047/http:/klim.co.nz/retail-fonts/founders-grotesk/) and of course basic commercial.\n\nI like a lot these fonts but I'm afraid they seems too much fancy, polished and refined for the every-day writing.\n\nyou agree? any \"plain\" grotesk to suggest?\n\nthanks.\n\n",
  "author": "stagna",
  "time": "8 Apr 2013 — 2:48am",
  "uid": "210476",
  "comments": [
    {
      "time": "8 Apr 2013 — 8:00am",
      "content": "Franklin Gothic?\n\n"
    },
    {
      "time": "8 Apr 2013 — 9:35am",
      "content": "It's good you're moving away from Folio: besides being boring it's not particularly readable (although it's much better than Helvetica).\n\nI don't think those fonts you mention are too fancy. One thing you should keep in mind is that \"fancy\" details don't pop out at small (read: text) sizes - they just blend into a -hopefully- pleasant texture.\n\nAlso look at TypeTogether's library.\n\nhhp\n\n"
    },
    {
      "time": "8 Apr 2013 — 11:10am",
      "content": "I'm not sure how Supria would work typeset for regular document styles. I've never set it that way, and it wouldn't have come to my mind. You'll have to try it out.\n\nNote that Chris Sowersby recently issues Founders Grot Text, as the original Founders was found to work poorly at small sizes.\n\nNational ( [http://vllg.com/Klim/National#panel=about](http://web.archive.org/web/20130821054047/http:/vllg.com/Klim/National#panel=about \"http://vllg.com/Klim/National#panel=about\") ) is a great option that I have found to work well at regular and smaller sizes.\n\nYou probably have specific requirements for the typesetting you are doing. Those requirements will help reduce your options!\n\nCheers.\n\n"
    },
    {
      "time": "9 Apr 2013 — 6:38am",
      "content": "thanks everybody.\n\nthe text version of founder grotesk seems fine, a little more streched out and larger than the other. I don't like national, altought they're very different it unacceptably reminds me calibri.\n\nI'll see how to spend this big money.\n\n"
    },
    {
      "time": "11 Apr 2013 — 1:53am",
      "content": "[Benton Sans](http://web.archive.org/web/20130821054047/http:/www.myfonts.com/fonts/fontbureau/benton-sans/) – you can see it applied on [The Next Web](http://web.archive.org/web/20130821054047/http:/thenextweb.com/).\n\n"
    }
  ]
}
