{
  "id": "102128",
  "title": "Fraction setting with complications",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": " ![](http://web.archive.org/web/20130821065852im_/http:/typophile.com/files/frax_5790.jpg)\n\nTypesetting a new condo owner's manual in English and French which includes some measurements in inches. Client says the fractions must be typeset as in B.\n\nI'm almost dead certain you never set fractions with a hyphen in English text, unless there's a convention about doing this in the building trades that I don't know about. I would always set a number and fraction together as in A.\n\nI'm not as dead certain about French. This is in Quebec, not France (where of course this would be metric and so much simpler).\n\n(I am also reminded those should be double primes, not close quotes. But they're not the issue.)\n\nI've looked long and hard for French typesetting norms but this specific circumstance isn't covered by anything I've found.\n\n",
  "author": "elzadra",
  "time": "8 Apr 2013 — 6:45pm",
  "uid": "13035",
  "comments": [
    {
      "time": "8 Apr 2013 — 7:56pm",
      "content": "Somebody's confused. Possibly because fractions written as words use a hyphen as in two-thirds. In years of reading mathematical texts I have never seen the hybrid (read bastardized) form that your client favors. - Herb\n\n"
    },
    {
      "time": "8 Apr 2013 — 11:04pm",
      "content": "Certainly in English that is somewhere between bizarre and just plain wrong. I can't speak to French typesetting norms.\n\n"
    },
    {
      "time": "9 Apr 2013 — 6:05am",
      "content": "Style A is the correct one. Style B might be something that would be generated from a plotter program but that does not in any way qualify as typography. For an Owner's Manual, Style A is the only correct way to do it.\n\nYou could refer your client to the Chicago Manual of Style as a confirmation. You may be able to find it at your local library.\n\n"
    },
    {
      "time": "9 Apr 2013 — 6:48am",
      "content": "The hyphen is sometimes used to advantage when fractional numbers have to be displayed using regular sized (typewriter, for example) figures, such as 1-3/4. In English, not when fractions ure used.\n\nBut Canada's a strange country. Once stayed in a hotel in Toronto where the instructions on how to use the coffee maker were entirely pictures. No words. So, of course, and I suppose by law, the pictures were there twice -- once for English, once for French...\n\n"
    },
    {
      "time": "9 Apr 2013 — 7:24am",
      "content": "Inanest case, you could tell your client that putting hyphens where subtraction is not intended and using double quotes instead of double primes to signify inches Does Not Conform To Law. That it happens to be Strunk's Law...\n\n"
    },
    {
      "time": "9 Apr 2013 — 9:37am",
      "content": "As Charles said, hyphens are used sometimes with fractions that are made using regular-sized numbers. Probably started back in the typewriter days, and is still seen today sometimes when type is set amateurishly or in things like emails.\n\nI see it a lot on the web, and the Yahoo Style Guide even tells how to do it: \"...if coding the fraction is impractical, use numerals for the whole number, followed by a hyphen and the fractional part written as x/y (as in 1-1/2 or 2-3/8).\"\n\n\\> Client says the fractions must be typeset as in B.\n\nHe's seen it done that way and assumes it's correct. Show him examples of correct fractions in books, magazines, etc.\n\n"
    },
    {
      "time": "9 Apr 2013 — 9:52am",
      "content": "According to this [Style Guide and Reference for Medical Transcriptionists](http://web.archive.org/web/20130821065852/http:/www.mtdesk.com/Writing+fractions+as+numbers)\n\n> NOTE: The AHDI Book of Style 3rd Ed. places a hyphen (i.e., 6-½, 1-¼, etc.) and the AMA Manual of Style does not. If your word processor does not have the appropriate symbols for the fractions, then the hyphen is necessary (i.e., 6-1/2, 1-1/4, etc.).\n\nAHDI stands for \"Association for Healthcare Documentation Integrity\".\n\n"
    },
    {
      "time": "9 Apr 2013 — 10:07am",
      "content": "The Fraction feature in many OpenType fonts (e.g. from Shinntype) enables text set “ﬁgure space ﬁgure slash ﬁgure” to be globally programmed in a style sheet to set correctly, with the space character being replaced by a (very) thin space.\n\nBut not text set “ﬁgure hyphen ﬁgure slash ﬁgure”.\n\n"
    },
    {
      "time": "9 Apr 2013 — 11:06am",
      "content": "[http://www.catb.org/jargon/html/writing-style.html](http://web.archive.org/web/20130821065852/http:/www.catb.org/jargon/html/writing-style.html) – This incidentally explains why I prefer to write 6+1/2 or 1+1/4 rather than hyphenate them.\n\n"
    },
    {
      "time": "9 Apr 2013 — 11:26am",
      "content": "Another alternative is to write numbers in decimal form, such as 3.25\".\n\n"
    },
    {
      "time": "9 Apr 2013 — 11:43am",
      "content": "Decimal form is not a substitute. Fractional forms and decimal forms each have their place, but in most contexts they are not interchangeable. - Herb\n\n"
    },
    {
      "time": "9 Apr 2013 — 11:58am",
      "content": "This entire discussion may be moot. Back in the day, we had this curious saying: “The Customer is Always Right”…no matter how wrong-headed his or her whims may be…\n\n"
    },
    {
      "time": "9 Apr 2013 — 12:28pm",
      "content": "One thing the dash does though is prevent for example the first one from looking like a 13/8. Improper fractions are people too! ;-)\n\nhhp\n\n"
    },
    {
      "time": "9 Apr 2013 — 12:23pm",
      "content": "Your “client” is or is influenced by some kind of draftsman or similar Windows-using community-college graduate and is wrong in both languages.\n\n"
    },
    {
      "time": "9 Apr 2013 — 1:20pm",
      "content": "I tend to agree that the customer is always right. But I would desperately try to avoid the confusion caused by a hyphen also looking like a minus sign.\n\nSo instead of 6-1/2, I would try 6\\_1/2, 6&1/2, or, as suggested, 6+1/2.\n\nOne can't do 6,1/2 since in most European languages the comma, rather than the period, serves as the decimal point, thus being even more confusing than a hyphen. (Note, too, that in typeset material, the minus sign tends to look more like an em dash than a hyphen, so this may not be as bad as it seems from typed material where - is the minus sign for programming languages.)\n\n"
    },
    {
      "time": "9 Apr 2013 — 1:33pm",
      "content": "I doubt if folks would mistake a hyphen for a minus sign in a measurement. It's fairly common to see fractions written that way on the web, in emails, etc.\n\n"
    },
    {
      "time": "11 Apr 2013 — 7:52pm",
      "content": "As a compromise, in context where dash is required, I would try to use 1·¼; if this would not help, I would use hyphen-bullet ⁃ U+2043, as in 1⁃¼. But, of course, this is confusable with multiplication…\n\n"
    },
    {
      "time": "11 Apr 2013 — 8:15pm",
      "content": "Just in case another voice is helpful, yes, A is standard, though as mentioned it should have primes and preferably some thin space between the full size numerals and fractions.\n\nI have never seen B except when done on a typewriter. Though even then, sometimes just a space is used, not a hyphen.\n\n"
    },
    {
      "time": "13 Apr 2013 — 8:34pm",
      "content": "The dash in example B does not, at least, look like a minus sign.\n\nAs for this use of a dash, I believe it is standard on architectural drawings. I have also seen a computer program for making engineering drawings that uses the hyphen-minus character in _both_ senses: -1/2\" is exactly 4 inches away from 3-1/2\".\n\nThe way I see it, things would be much easier if the meanings of the plus and minus signs were swapped.  \nSee: [http://en.wikipedia.org/wiki/Counting\\_rods#Rod\\_numerals](http://web.archive.org/web/20130821065852/http:/en.wikipedia.org/wiki/Counting_rods#Rod_numerals \"http://en.wikipedia.org/wiki/Counting\\_rods#Rod\\_numerals\") (you might have to scroll down a bit)  \nAlas, it is far too late to change things from the way they now stand.\n\nAs for \"the customer is always right\": I would at least get their specifications in writing, so in case there is trouble, your hands are clean.\n\n"
    },
    {
      "time": "13 Apr 2013 — 9:33pm",
      "content": "3-1/2\" makes sense, but 3-½\" does not. There's a huge difference between using actual fractions and using ordinary numbers with a virgule.  \n - Herb\n\n"
    },
    {
      "time": "13 Apr 2013 — 9:53pm",
      "content": "But if the super-/sub-script numerals are big enough those two cases come visually pretty close...\n\nFor example let's revisit that \"1-3/8\" above: let's say it's \"1-3/16\", and the font happens to have a rather steep virgule and rather large super-script numerals... So what's worse: some typographic pedant whining at you about \"correctness\", or your plumber buying 300 feet of the wrong piping?\n\nA miniature ampersand, anyone? :-)\n\nhhp\n\n"
    },
    {
      "time": "15 Apr 2013 — 2:23am",
      "content": "> 3-1/2\" makes sense, but 3-½\" does not.\n\nLike this, written with old-style figures, 3-½\" might look as 3 raised to the power of minus one half...\n\n"
    }
  ]
}
