{
  "id": "102169",
  "title": "Font with bold, condensed/narrow, cyrillic glyphs, and square angles",
  "forum": "General Discussions",
  "tags": [
    "bold",
    "General Discussions",
    "glyphs",
    "narrow",
    "square angles"
  ],
  "content": "Hi, I am new here, and I am already searching for a very particular font:  \nThe features I need are:  \n - narrow/condensed (width similar to Myriad Pro Bold Condensed one): I have to put long texts in small areas  \n - bold/black  \n - square or 45° angles  \n - contains all the glyphs I need (listed at the end of the message)\n\nI have to put an overlay that simulates a LCD pattern (pixels), so I need a font with strong angles, 0, 45, 90, to avoid\n\nannoying antialiasing glitches.  \nDo you think such a font exhists?\n\nGlyphs list:  \n£$€¥łрубŧĄąĆćĘęŁŃńÓóŚśŹźŻżÄäÖöÜüßÁáÂâÃãÀàÇçÉéÊêÍíÔôÕõÚú  \nΑαΒβΓγΔδΕεΖζΗηΘθΙιΚκΛλΜμΝνΞξΟοΠπΡρΣσςΤτΥυΦφΧχΨψΩω  \nАаБВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРСсТтУФфХхЦцЧчШшЩщЪъЫыЬьЭэЮюЯя  \nÈèÌìÒòÙùÑñABCDEFGĞHIİJKLMNOPRSŞTUVYZabcdefgğhıijklmnoprsştuvyz  \nĂăÎîQqŢţWwXxČčĎďĚěŇňŘřŠšŤťŮůÝýŽžĹĺĽľŕ\n\n",
  "author": "GiGBiG",
  "time": "10 Apr 2013 — 3:13am",
  "uid": "210562",
  "comments": [
    {
      "time": "10 Apr 2013 — 3:29am",
      "content": "Try for yourself:\n\nKeywords: sans, condensed, cyrillic, greek at [MyFonts.com](http://web.archive.org/web/20140115074205/http:/www.myfonts.com/search/text%3Asans+text%3Acondensed+text%3Acyrillic+text%3Agreek/fonts/)\n\nLanguage Filter at Fontshop.com: [Greek (Monotonic/Polytonic), Russian and Sans Serif](http://web.archive.org/web/20140115074205/http:/www.fontshop.com/fonts/category/sans/?language_filter=50%2C945%2C111).\n\n"
    },
    {
      "time": "10 Apr 2013 — 4:29am",
      "content": "Well, I forgot to specify: a free font ;)\n\n"
    },
    {
      "time": "10 Apr 2013 — 5:41am",
      "content": "Well, good luck then.\n\n"
    },
    {
      "time": "10 Apr 2013 — 5:57am",
      "content": "Thank you\n\n"
    },
    {
      "time": "10 Apr 2013 — 6:17am",
      "content": "You could try looking at DejaVu LGC, but I suspect you'll have to roll your own.\n\n"
    },
    {
      "time": "10 Apr 2013 — 6:40am",
      "content": "Why does it have to be free?\n\nhhp\n\n"
    },
    {
      "time": "10 Apr 2013 — 7:38am",
      "content": "Open Sans and Open Sans Condensed at [www.google.com/fonts/](http://web.archive.org/web/20140115074205/http:/www.google.com/fonts/ \"www.google.com/fonts/\")  \nThere may be others, use the search filters on the left.\n\n"
    },
    {
      "time": "10 Apr 2013 — 7:40am",
      "content": "Well, I could ask my boss to buy it, but I should try it before buying.\n\nI have created 3 characters that could belong to the font I need  \n [http://www.myfonts.com/WhatTheFont/results?ch%5B0%5D=A&ch%5B1%5D=V&ch%5B...](http://web.archive.org/web/20140115074205/http:/www.myfonts.com/WhatTheFont/results?ch%5B0%5D=A&ch%5B1%5D=V&ch%5B2%5D=S&wtfserver=rsc_wtf3&id=0000e99e515eeb32000ada2c0000054f&glyphcount=3&imageid=0&x=44&y=39 \"http://www.myfonts.com/WhatTheFont/results?ch%5B0%5D=A&ch%5B1%5D=V&ch%5B2%5D=S&wtfserver=rsc\\_wtf3&id=0000e99e515eeb32000ada2c0000054f&glyphcount=3&imageid=0&x=44&y=39\")  \nbut noone of the resulting fonts contains cyrillic and greek, apart for the dotted one, that I'd prefer to avoid.  \nAny suggestions?\n\n"
    },
    {
      "time": "10 Apr 2013 — 8:31am",
      "content": "Yes, don't assume it's a bad idea to spend money on fonts.\n\nBTW:\n\n> condensed (width similar to Myriad Pro Bold Condensed one): I have to put long texts in small areas\n\nActually narrowness doesn't always lead to economy. If the text has a lot of linebreaks a wide font can be set smaller, saving _vertical_ space without wasting horizontal economy -an average of half a line- every time a linebreak happens.\n\nAlso, it depends on the point size.\n\nhhp\n\n"
    },
    {
      "time": "10 Apr 2013 — 9:34am",
      "content": "No, I am not saying it is a bad idea, fonts are software and art, and I am a programmer and a graphic designer, so I know what this means.  \nThe problem is that my boss started with \"with thousands of (free) fonts around the web... how can you think we can't find the right one?!\".\n\nWell, he has just dumped all the results of my research, so I have to start all from the beginning...\n\n"
    },
    {
      "time": "10 Apr 2013 — 11:05am",
      "content": "Not to pester, but: you put \"free\" in parentheses... If he didn't actually say it, why assume it? Ask him what the budget is - that's a big determinant in terms of narrowing a search.\n\nBTW for somebody who wants to fight the perception that fonts should be free it's worth \"training\" a boss by avoiding a free font even if it does the job. You're not the one with the budget - it doesn't hurt to try your luck! One day you might discover a non-free font you really want to use only to find that your boss is committed to never paying for a font... He might even ask you to pirate it, and if you refuse he might -perversely- think less of you.\n\nHere's something:  \n [http://www.myfonts.com/fonts/parachute/pf-din-text-cond-pro/](http://web.archive.org/web/20140115074205/http:/www.myfonts.com/fonts/parachute/pf-din-text-cond-pro/ \"http://www.myfonts.com/fonts/parachute/pf-din-text-cond-pro/\")\n\nhhp\n\n"
    },
    {
      "time": "10 Apr 2013 — 12:16pm",
      "content": "\\>Well, he has just dumped all the results of my research, so I have to start all from the beginning...\n\nI assume you are being paid to do this research? Finding a suitable free font seems like it's going to be more expensive. Perhaps you should let your boss's boss know. ;-)\n\n"
    },
    {
      "time": "10 Apr 2013 — 5:59pm",
      "content": "[Impossibility Alert]\n\n\"- narrow/condensed (width similar to Myriad Pro Bold Condensed one):\"  \nNo problem...\n\n\" I have to put long texts in small areas\"  \nNot great for the older and younger reader...\n\n\"so I need a font with strong angles, 0, 45, 90, \"  \n I'm not sure this is entirely possible. 90 and 0 are gained by not using italic, but 45 degrees so as not to have uneven steps, bold and narrow and long reading...\n\nEven if you are just a programmer, designer or milk man familiar with Myriad Pro Bold Condensed, and you know that a 45 degree line of any thickness will occupy as much horizontal space as it does vertical space, (making an \"N\" with a 45 degree angle similar in width to a square), you can see that a narrow or condensed AKMNQRVWXYZ and many more, are not going to have 45 degree features without becoming highly unfamiliar to readers of all ages and time zones over long text.\n\nHope that helps, try not to hurt your boss, and Good luck!\n\n"
    },
    {
      "time": "12 Apr 2013 — 1:03am",
      "content": "At the end I explained the problems to my boss, and he incredibly understood: the winner font is Codename Coder Free 4F, that I already suggested the day before (and was dumped).  \nI found a few nice commercial fonts too, but they all had a problem in my environment. CCF4 is perfect at 95%, if we consider that I had to abandon the bold and condensed style (for readability problem, as suggested here by someone of you).  \nTo put long text I have to change spacing and horizontal scaling a bit, but the texts look nice anyway.\n\nAnyway I rebuilt the layout engine, and now is very fast to switch between fonts by XML, so if want to try another font or use different fonts on different apps it while be a matter of minutes!\n\nThank you all :)\n\n"
    }
  ]
}
