{
  "id": "102138",
  "title": "alpha",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I am doing a sans serif, nothing new or fancy, but i would like to get some inputs before i move forward to doing the next font style. I’m intending to do a “Bold” and may be an “Oblique”.\n\nWould you be so kind and give me a feed back to my former work and may be a short explanation to you opinion.\n\nThank you very much in advance.\n\n| Attachment | Size |\n| --- | --- |\n| [alpha.pdf](http://web.archive.org/web/20150424022240/http:/typophile.com/files/alpha.pdf) | 37.79 KB |\n\n",
  "author": "37DMK",
  "time": "9 Apr 2013 — 6:39am",
  "uid": "210260",
  "comments": [
    {
      "time": "9 Apr 2013 — 9:51am",
      "content": "Let me start by saying that I'm not an expert. I like the font. I see a few areas that trouble me...\n\nThe upper case \"S\" seems visually too wide compared to the rest of the character set. And, for some reason I can't fathom, it looks like it is tilted slightly.\n\nThe lowercase \"w\" the negative space in the center seems too open compared to the negative spaces to the left and right. It almost looks like two \"v's\" moved together.\n\nIn the current usage of the \"#\" symbol, the glyph is the same height and baseline as the \"l\" or \"X.\" As hashtags, they take up about the same space as other uppercase glyphs.\n\nJust for aesthetics, the dollar sign should take up approximately the same space as a zero or eight glyph.\n\nJust my opinion and it is worth what you paid for it.\n\n"
    },
    {
      "time": "9 Apr 2013 — 10:38am",
      "content": "Yes thanks a lot phrostbyte64.\n\nI am glad that you see similar flaws in it as i do, i’ve been correcting the shapes you’ve mentioned many times, so i think i’ve lost a bit of my objectivity about it. Currently i am still working on the font, so i will upload another version, after may be one or two more critics.\n\nbest regards\n\n"
    },
    {
      "time": "10 Apr 2013 — 6:02am",
      "content": "It seems to me that all diagonals bars are too heavy (K, k, V etc.) and the t is too tall (it should be not as tall as the l) The B is corriged optically but not the E, F, H. The x and y are weird maybe because of kind f inktraps you've made... For the rest I agree with James. I don't know if it's help but good luck anyway\n\n"
    },
    {
      "time": "10 Apr 2013 — 7:58am",
      "content": "Looks nice overall, a few potentially awkward areas, though.\n\n/X, /x look very odd... you've staggered the upper-left-to-lower-right diagonal, which is something I've never seen before. Usual practice is to stagger the other diagonal, due to the way the eye moves while reading. IMHO the amount of offset is also rather extreme, at least for the lowercase /x.\n\nNot sure that /a isn't a tad on the wide side. Agree with others about /S and /w though.\n\nFinally there's something that bothers me about the /k... I think the diagonals look a bit top-heavy. Maybe extending the lower leg (or bringing in the top one) a bit, and/or lowering the junction just a touch, would be worth trying.\n\n"
    },
    {
      "time": "11 Apr 2013 — 8:06am",
      "content": "Wow! Thanks guys. Those are a lot of great inputs.  \n@ Matthieu Cannavo:  \nYou’re right, i was experimenting with the sizes of the diagonal bars. I figured to make them bigger, because they would have been a lot too thin at first. But i probably over did it. I did not even realise the E, F and H middle bars are on the geometrical middle and not how supposed to be a little higher =) i made that by accident just pushing the E bar up and down until i thought it was right. I corrected the B too, because if B and E are supposed to be about at the same hight, it’s probably better to find something in between, the F would look a bit weird otherwise.  \n@ altsan:  \nI knew there was something fishy about the X characters, i must have accidentally mixed up the left and the right side (i’m a bit of a legasthenic) and started it off the wrong way never realising why things look weird. I’ll have a look at the k.\n\nNow i have to work on it for a while until i’ll upload another version. You are a real help. All of you.  \nbest regards\n\n"
    },
    {
      "time": "11 Apr 2013 — 3:56pm",
      "content": "Perhaps the most obvious problem is found in /y/. The junction of its diagonals is faa(...)aar too high. Make them join near the baseline.\n\nYou should definitely make the overshoot at the bottom of /a/ more prominent.\n\nI really dig the inverted trapezoid tittles, and how they match the idea you came up with for the terminals of /T/, /E/, etc., but they don't pair well with the angled cuts of diagonal stems IMO. I would suggest that you first try out 'normal' cuts and then consider if it is worth to diverge from conventional.\n\nCut /t/'s hair. It's starting to look like Marge Simpson.\n\nFix the width of /w/, /S/ and /r/. You will never see a /r/ grow that far to the right. The width of the tabular figures forces shapes to be more squarish than the other characters.\n\nYou _could_ make ink-traps for /V/, /W/, /M/, /G/ and alike. Do as you think is best. Overall I think you've done a good job regularizing the weight (...with the exception of /4/, which appears to be darker than for instance its neighbors; the diagonal stroke of /Q/ is also too heavy).\n\n/j/ is the only character that creases at the bottom.\n\nNice /ß/!\n\n/S/ and /s/ look stretched partly because the cuts are not perpendicular to the strokes.\n\nSorry that almost all of my observations are negative. But hey, critique is ment to be useful, not flattering ;-)\n\n"
    },
    {
      "time": "12 Apr 2013 — 3:01am",
      "content": "@ LexLuengas:  \nThat’s fine with me. After all i asked for it. I’ve tried with non angled cuts in my first two fonts, which i don’t consider worth talking about. This time i went with the angled cuts because i was curious how it would work out and i liked the combination but i also respect your opinion. The junction of the lower case y is indeed a bit high, but i haven’t seen that before so i only changed it a bit and not the whole way down to the baseline, i just did what felt right. And i want to add, that i don’t think that constructive criticism is negative. Not at all it is a very important part of progress.\n\nI had a look at all of the suggested changes and i truly appreciate that you guys have taken your the time to have a close look. The result of my further work you see down below. I am sure that i will not satisfy all of you, because i think that is neither possible, nor necessary. In the end i must admit i am a lot more pleased with the result than before, so thanks again. And i’ll come back and post the bold (i’ve started working on).\n\nbest regards\n\n ![](http://web.archive.org/web/20150424022240im_/http:/typophile.com/files/alpha%20test-02_5821.jpg)\n\n"
    }
  ]
}
