{
  "id": "102155",
  "title": "Minority Scripts - Present versus Future (Was: Huronia)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Branched from: [http://typophile.com/node/101953](http://web.archive.org/web/20130818165820/http:/typophile.com/node/101953 \"http://typophile.com/node/101953\")\n\nhhp\n\n",
  "author": "hrant",
  "time": "9 Apr 2013 — 2:17pm",
  "uid": "1250",
  "comments": [
    {
      "time": "9 Apr 2013 — 2:30pm",
      "content": "For the sake of more continuity from the original thread I'm reproducing the two posts that I'll be directly addressing soon (and I would encourage others to do the same -where relevant- so that people don't have to flip back and forth).\n\ncharles ellertson:  \n\"\n\n> But most of all, few cultures sufficiently foster the critically important technical aspects of type design.\n\nThat's certainly true. Look at how many fonts print so poorly, or display on the screen so poorly -- those being the only \"critically important\" aspects of type design. Or maybe it's not true. Is this paucity of function the culture's fault, or the type designers? Or the culture's fault for spawning so many useless designers?\n\nMakes my head hurt. Maybe Typophile should just give Hrant his own forum.  \n\"\n\nRoss Mills:  \n\"Hrant, I think you're chasing your own tail, but that's not a judgement—I've seen others perfectly entertained doing this. I'm not in general disagreement with your sentiment, but I think the nature of your discussion is in conflict with what the priorities ought to be in the present and immediate future.\n\nYes, it would be nice for a script's future to be fought for. However, the only thing that is going to enable that is the future of the language, so what would really be nice is a concerted fight for that language—and as far as it relates to a writing system this implies publishing. If anyone wishes to support the continued existence of the America's (or anywhere else for that matter) truly threatened, endangered languages, then first you should look to creating—or assisting to create—written material for those languages\\*. Otherwise, both the language and the novel writing system becomes nothing more then a anthropological curiosity. Then it truly is academic.\n\nIn any case, this is a release thread. If more discussion on such subjects is wanted, perhaps a different thread should be used.\n\n\\*Of course, oral literatures are the foundation of American languages, and play an important part of continuing use, but we're talking about scripts and fonts, so are principally concerned with the transcription process and presentation of language. And, although literature of any sort is all well and good, the future of some languages may now be rooted in current modes of communication: kids texting in their grandparent's language.  \n\"\n\nhhp\n\n"
    }
  ]
}
