{
  "id": "102154",
  "title": "Too many alternates?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm working on a project in which I have almost two complete sets of A through Z in upper and lower case. I can probably come up with number alternates also. They are all viable glyphs. So, is it better to go with two fonts or one font with an alternate range - through the miracle of open type. Which is preferable to the type and font using community?\n\n",
  "author": "phrostbyte64",
  "time": "9 Apr 2013 — 2:05pm",
  "uid": "37869",
  "comments": [
    {
      "time": "9 Apr 2013 — 6:43pm",
      "content": "-- Pro version (Both sets, for OT users)  \n---- Basic Set 1 (1st set)  \n---- Basic Set 2 (2nd set)\n\n"
    },
    {
      "time": "11 Apr 2013 — 3:37pm",
      "content": "Well, here's one way to think about it, from a potential user's perspective. If the glyphs are intended to interact, they should be in one font, so kerning is possible. If not, two fonts is easier.\n\nWhen, early on, Adobe put out \"Adobe Garamond\" with the titling glyphs in the font, & you were suppose to turn them on with an OT feature, I took them out & made a separate font. You would not want the two to interact, and accidents happen when setting type...\n\n"
    },
    {
      "time": "13 Apr 2013 — 3:36am",
      "content": "Today, if they are \"alternates\", why would they want to be in a different font?\n\n"
    },
    {
      "time": "13 Apr 2013 — 8:27am",
      "content": "@bbg: Not all software applications recognize opentype features - sign specific and some CAD software for instance. There are a lot of users who can't afford the huge cost of upgrades to opentype friendly software. Some people simply don't want the hassle of applying said features.\n\nThe glyphs themselves have no opinion.\n\n"
    },
    {
      "time": "13 Apr 2013 — 12:19pm",
      "content": "If you return to your question, I would answer it the same. If you don't make a single font, no one has the choice.\n\n"
    },
    {
      "time": "14 Apr 2013 — 4:39am",
      "content": "Where there is never more than one alternate, another (if rather labour-intensive) way would be to make two fonts where one font's regular set is the other's alternate set.\n\n"
    },
    {
      "time": "14 Apr 2013 — 6:59am",
      "content": "@Té Rowan  \nThat is an interesting solution.\n\n@bbg  \nLimited choices limit your market. The question is are there enough older and CAD only systems to justify the inclusion of more choice.\n\nMy apologies for my grammar. I think I slipped a gear somewhere.\n\n"
    }
  ]
}
