{
  "id": "102156",
  "title": "Font Bureau or All Designers",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm creating a \"webfonts-in-use\" colophon on my website and was wondering what would be best, to list the foundry or the designer(s)? There's not enough room to list both so I was thinking it might be best to link the foundry so others can find the webfonts if they choose to use them.\n\nExample:\n\n![]()\n\n",
  "author": "chrisburton",
  "time": "9 Apr 2013 — 2:40pm",
  "uid": "199209",
  "comments": [
    {
      "time": "9 Apr 2013 — 2:43pm",
      "content": " **Edit**\n\nExample:\n\n![](http://web.archive.org/web/20130821085251im_/http:/f.cl.ly/items/453a1U123Z0Y3V34291A/Image%202013-04-09%20at%206.41.25%20AM.png)\n\nNote: I know that Old Standard isn't served by Font Bureau (Webtype), it's just an example.\n\n"
    },
    {
      "time": "9 Apr 2013 — 2:52pm",
      "content": "Strictly an amateur speaking here, but either way loses something. If you show only the font name and designer, it's possible that the user will locate and purchase a different version of the font than you're using.\n\nOn the other hand, the original designer is, to me, more important than the foundry. And what IS the foundry? It's often difficult, if not impossible, to separate resellers from font makers.\n\nSo i guess it comes down to the way you show it - the designer name (if known).\n\n- Herb\n\n"
    },
    {
      "time": "9 Apr 2013 — 3:06pm",
      "content": "Good point, HVB. I think what I can do here is link to the distributor under the name of the typeface (Old Standard in this case would link to its Typekit page). And under each designer I could link to their personal site or maybe even the people pages that Font Bureau set up: [http://www.fontbureau.com/people/TobiasFrereJones](http://web.archive.org/web/20130821085251/http:/www.fontbureau.com/people/TobiasFrereJones)\n\nAlso, I meant distributor on my initial post, not foundry. Sorry for the confusion.\n\n"
    },
    {
      "time": "9 Apr 2013 — 6:51pm",
      "content": "AFAIK, Old Standard was included in the 1st bacth of fonts released by Google Webfonts. You can link to [http://www.google.com/fonts/specimen/Old+Standard+TT](http://web.archive.org/web/20130821085251/http:/www.google.com/fonts/specimen/Old+Standard+TT \"http://www.google.com/fonts/specimen/Old+Standard+TT\")\n\n"
    },
    {
      "time": "9 Apr 2013 — 10:17pm",
      "content": "Pablo,\n\nTrue. And as far as I know, Typekit will occasionally make adjustments to the fonts in their library if need be. Even though I highly doubt they will be the one to do this, I'm still hoping Old Standard will one day be improved (kerning is awful). Google doesn't make any improvements or am I incorrect on that? That's one particular reason why I use Typekit.\n\n"
    },
    {
      "time": "10 Apr 2013 — 6:57am",
      "content": "Google does improvement to the many of the fonts, including iKerning, Char-set extension, new weights/styles, hand-hinting, etc... Those improvement are usually not advertised, but they are happening all the time, in particular to the ones that have better ranking on the stats.\n\nOld Standard does have kerning (as show in the attached image), but for some weird reason it's not working on some browsers (I will investigate it). But I agree, it needs to be fixed so all browsers can use it (I will try to release a fixed version, if time allows).  \n ![](http://web.archive.org/web/20130821085251im_/http:/f.cl.ly/items/3j16350G1p1x1K0k2T3s/Screen%20shot%202013-04-10%20at%2010.48.22.png)\n\n"
    },
    {
      "time": "10 Apr 2013 — 12:20pm",
      "content": "Thanks Pablo. I wasn't aware of that about Google. Is there a specialized team that does this or is it the type designers themselves?\n\nI am using the following to enable OT features such as kerning and ligatures.\n\n    text-rendering: optimizeLegibility;\n\n**Before:**  \n ![](http://web.archive.org/web/20130821085251im_/http:/f.cl.ly/items/33391M2O2Y321L0r1q1e/Image%202013-04-06%20at%203.37.59%20PM.png)\n\n**After:**  \n ![](http://web.archive.org/web/20130821085251im_/http:/f.cl.ly/items/3k0E3J1w270s0F2C1t2a/Image%202013-04-06%20at%203.36.07%20PM.png)\n\nHowever, there's still issues. Noticeably when the text is set to a large font size.\n\n"
    },
    {
      "time": "10 Apr 2013 — 1:19pm",
      "content": "> Is there a specialized team that does this or is it the type designers themselves?\n\nAFAIK, when there is something to improve, the original designer is contacted/commissioned first. If he is not able to make it, other designers will be contacted/commissioned as second option.\n\nIn my own fonts, as a small example:\n\n- Alexi (Cyreal.org) was commissioned to add Cyrillic to Lobster.\n- Irina Kheyso was commissioned to add hand-hinting to Cabin.\n- I was commissioned to expand Matt McInerney's Raleway-Thin into a 9 weights family.\n- I'm also commissioned to expand my own fonts, or to develop new ones.\n- Igino Marini's iKern was commissioned for Spacing/Kerning all of them.\n\n"
    },
    {
      "time": "10 Apr 2013 — 1:37pm",
      "content": "BTW, I forget: does iKern replace the sidebearings, or can it be used to only add kerning? Also, a designer of a Google font isn't _forced_ to use iKern, is he? In fact looking at the \"LT\" in Old Standard, I have to assume not...\n\nhhp\n\n"
    },
    {
      "time": "10 Apr 2013 — 2:24pm",
      "content": "> does iKern replace the sidebearings, or can it be used to only add kerning?\n\nAFAIK, it does both as the same time.  \nFor auto-kerning only (keeping side-bearings untouched) you can try DTL Kernmaster.\n\n> Also, a designer of a Google font isn't forced to use iKern, is he?\n\nNo, no one is forced to use it. But is available if the designer want to use it.\n\n"
    },
    {
      "time": "10 Apr 2013 — 2:40pm",
      "content": "Shame about it dumping the sidebearings. I _have_ heard however that good initial sidebearings do make a difference in the end-result... If that's true then iKern is _adjusting_ them instead of dumping them.\n\nSo iKern is available for free to any Google font designer? That's nice of them. I guess they realized that most people mess up the spacing... :-) I wonder if Marini is giving a discounted price per font to Google, or is charging a (yearly?) all-you-can-eat fee.\n\nhhp\n\n"
    },
    {
      "time": "10 Apr 2013 — 2:58pm",
      "content": "Very interesting. I have quite a few questions regarding how Google handles everything regarding webfonts. I might save that for another thread, though.\n\nIs there a \"special\" form to request improvements to fonts? I would contact Typekit but I have doubts it will get done by this year. It seems they are trying to rapidly build their library and I just don't think they would have the time.\n\n"
    },
    {
      "time": "10 Apr 2013 — 3:08pm",
      "content": "> I wonder if Marini is giving a discounted price per font to Google, or is charging a (yearly?) all-you-can-eat fee.> Very interesting. I have quite a few questions regarding how Google handles everything regarding webfonts. I might save that for another thread, though.  \n> Is there a \"special\" form to request improvements to fonts?\n\nYou can ask Dave directly, [http://typophile.com/user/16849](http://web.archive.org/web/20130821085251/http:/typophile.com/user/16849 \"http://typophile.com/user/16849\")\n\n"
    },
    {
      "time": "11 Apr 2013 — 5:00am",
      "content": "> Is there a \"special\" form to request improvements to fonts?\n\nAll of the Google web fonts come with a very permissive licence. If you have special requirements, you could hire any type designer/font engineer to modify the fonts for you. You can also host them yourself, no need to use the Google hosting.\n\n"
    },
    {
      "time": "11 Apr 2013 — 6:05pm",
      "content": "Pablo,  \nThanks for the contact info.\n\n> You can also host them yourself, no need to use the Google hosting.\n\nJens,  \nEventually I think I'll end up doing just that.\n\n"
    },
    {
      "time": "12 Apr 2013 — 12:56pm",
      "content": "Try to design your list so that it contains information without needing active hyperlinks. Something I can copy and paste years from now. And as far as “there’s not enough room…” of course there is, you’re the designer. Just make some!\n\n"
    }
  ]
}
