{
  "id": "10214",
  "title": "Thin slab serif",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hi everyone,   \n   \nThe inspiration for this one came after seeing a scan in the Type Identification Board:   \n [http://www.typophile.com/forums/messages/83/69176.jpg](http://web.archive.org/web/20150123123318/http:/www.typophile.com/forums/messages/83/69176.jpg)   \n   \nHere is a draft of the lowercase + the letter H to set the cap height:   \n [sample1](http://web.archive.org/web/20150123123318/http:/www.hackum.com/fonts/test1.gif)   \n   \nAs usual, the \"s\" is no good (yet) and there are \"rough\" looking characters, so any comments appreciated.   \n   \nThanks,\n\n",
  "author": "hackum",
  "time": "10 Apr 2005 — 3:45am",
  "uid": "4623",
  "comments": [
    {
      "time": "10 Apr 2005 — 3:51am",
      "content": "This is nice.. I like it..   \n_( In particular your 'g' is lovely.. )_   \n   \n( I think you are right about the 's' needing some more work.. It seems slightly leaning towards the left, and the middle part may seem a bit uneven.. _Oh, and there is something about the lower part of the 'a' that 'bothers' me, but I cant really describe what that may be.. Maybe thats just me.._ )\n\n"
    },
    {
      "time": "10 Apr 2005 — 4:18am",
      "content": "Stephen, I just noticed the \"t\" and fixed it, thanks. As for the Didot's \"g\" ... well, I thought it might work in a font like this one and give it some character.   \n   \nDav, I am not quite happy with the \"a\" either, there are some variations with smaller counters, which I am still considering. And the \"s\" is always hard for me. I will probably get back to it afer the capitals.   \n   \nMy idea was to draw one more weight apart from this one - (25% thinner) and another one with shorter serifs.\n\n"
    },
    {
      "time": "10 Apr 2005 — 11:22am",
      "content": "Cool.   \nFor the \"g\", try a join that's a straight vertical\\* instead of that half-oval.   \n   \n\\* Maybe with a rightward serif at the bottom connection though.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Apr 2005 — 3:59am",
      "content": "Whoa! I Firmin Didot 'g' in a Lubalin Graph. Very interesting.   \nDid you mean to dip your 't' below the baseline?\n\n"
    }
  ]
}
