{
  "id": "102172",
  "title": "How to sell logo design with only typo",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What do you do when you are designing a logo with just typographic elements, so no illustrations are involved. How do you sell this to your client, because I think they would think “so you threw 2 fonts together and I’m paying a lot of money for that?”  \nThank you !\n\n",
  "author": "AnaBanana",
  "time": "10 Apr 2013 — 5:37am",
  "uid": "205515",
  "comments": [
    {
      "time": "10 Apr 2013 — 6:11am",
      "content": "Well, it could use modified fonts or custom lettering. And it probably should.\n\n"
    },
    {
      "time": "10 Apr 2013 — 6:30am",
      "content": "Well, did you just throw two fonts together?\n\n"
    },
    {
      "time": "10 Apr 2013 — 6:44am",
      "content": "You can tell them that you don't get paid for mouse clicks and keystrokes, but what's in your head.\n\nBTW big stinky studios have charged hundreds of thousands of dollars a pop making logos out of two Helvetica letters...\n\nhhp\n\n"
    },
    {
      "time": "10 Apr 2013 — 6:54am",
      "content": "Well I did a lot of reasearch to get the look I wanted, and it's just strong with 2 great fonts together ... So yeah I threw them together, but it took me a while.  \nMight be me who is slow, but I checked out \"lavin\", \"celine\", \"balenciaga\" and their logo's are all just type... and that's what my client wants: \"simple but sophisticated\".\n\n"
    },
    {
      "time": "10 Apr 2013 — 7:22am",
      "content": "I would tell them about the research and why you think this is the best solution. Designers are not only paid to design, but also to figure out what to design and why.\n\n"
    },
    {
      "time": "10 Apr 2013 — 7:43am",
      "content": "Thanks for the feedback\n\n"
    },
    {
      "time": "10 Apr 2013 — 8:41am",
      "content": "You need to sell it to them the same way you would with any logo — by doing a nice presentation in which you explain the thought process behind the logo, why it communicates the ideas that their logo needs to communicate, and how it differentiates them from their competition.\n\nAlso it might be helpful to show them mockups of how the logo could be used on their stationery, website, signage, products, etc. (these mockups don't need to be finished designs at this point, the idea is just to help them visualize how the logo would look in actual use).\n\nIf presenting a type-only concept makes you nervous (and apparently it does), you may want to have some other concepts ready as alternatives. In most logo projects I've been involved with we typically presented several different concepts.\n\n"
    },
    {
      "time": "10 Apr 2013 — 8:42am",
      "content": " ![](http://web.archive.org/web/20140721210616im_/http:/typophile.com/files/16077a33b197619ec8b4d24c99842820_3497.jpg)\n\nJust wanted to show this to explain a little what I mean.  \nMy client wants a logo like it would be for a fashion brand ... so all type would be nice.\n\n"
    },
    {
      "time": "10 Apr 2013 — 8:47am",
      "content": "Yes indeed JamesM, it makes me pretty nervous. I charged her for a day worth of work on this logo and I've been breaking my head over it for 2 days now. I'm gonna be underpayed, but that's not the worst part. I think the worst part is that it will seem like I overpriced this logo in her eyes.\n\nI'm still struggling with how much to ask etc., thanks for the help.  \nI will definately put the logo on some signage or products!\n\n"
    },
    {
      "time": "10 Apr 2013 — 8:50am",
      "content": "If you're going to be underpaid, at least don't let a client's delusions bug you.\n\nhhp\n\n"
    },
    {
      "time": "10 Apr 2013 — 10:02am",
      "content": "\\> I charged her for a day worth of work....\n\nYou may have underbid, but once you give a client a price you can't increase it unless the scope of the project changes. A deal's a deal. But hey, you're still making some money and getting a portfolio piece. And maybe this can lead to other projects with her (brochures, web site, etc.)\n\n\\> the worst part is that it will seem like I  \n\\> overpriced this logo in her eyes\n\nI understand how you feel, but if you've given this logo some careful thought and feel an all-type solution is the best approach, then you need to make your presentation with confidence and explain your reasoning.\n\nAnd if she doesn't like your approach, go back to the drawing board and come up with something else. I've been in presentations by big design firms where the client hated the initial logo concepts; it happens sometimes. That's why it's often a good idea to present multiple concepts, or at least have a few alternatives in your briefcase that you can pull out if the client doesn't like your main idea.\n\n"
    },
    {
      "time": "10 Apr 2013 — 10:14am",
      "content": "@AnaBanana: Selling someone a minimalist typographic concept is a common challenge. Be it a wordmark, layout, website &c. Primarily because it looks so simple, they think “I could have done that myself” and “it must have been easy for you to make that, so it’s not worth much.”\n\nTo make the sell easier, begin by clearly articulating your understanding of their context. Goals, clients, competition &c. This will create in them a sense of “this person understands me.”\n\nThen, lead them through your thought process, starting with concept sketches, various choices &c. Explain why these selections didn’t make the cut.\n\nAfter leading them through this process, _then_ show them your final concept. You will find them to be far more receptive if they know you were making informed decisions due to your understanding of their context, and that you explored alternatives which lead you to your final selection. It is this process that is of greatest value. Not the fact you appeared to have simply “chosen a font.”\n\nThrough trial and error, I have found this method to be significantly more effect then simply showing them the final concept and asking them for feedback. This tends to result in the “that looks boring and simple” outcome. Back to the drawing-board. If they understand how you got there, they will see more value in your work — “Wow! I get it! This guy clearly but a lot of thought and consideration into this. I understand how he got there and how this seemingly simple design has inherent value. I feel smart.”\n\nWhen showing a potential client my portfolio, almost all of which is minimalist type, it can be a hard sell at times. Showing them a “boring” business card, possibly one of the strongest pieces, almost always results in “Really? You think that’s impressive?” But, if I start by showing the original which I was asked to redesign, identified its shortcomings, explored longest and shortest names, factored across multiple degrees, long and short job titles, 2-4 phone numbers, 1–3 line address and so on, resulting in an automated in use by at least 3,000 employees at any given time over the course of a over a decade without breaking, and in order for a new employee to get cards, all they need to do is go to form on their intranet, enter their data, which is then sent to the printer, produced, and shipped back to them so they have cards waiting for them on their desk first thing Monday morning, all without human hands even touching them, the response is far closer to “Holy crap that’s awesome! How can I get one of those!” Every time.\n\nI also strongly recommend against the “show them three and let them pick their favourite” meth0d. Ninety percent of the time you’ll get the “a little from each” result. Additionally, it undermines your authority. **You** are the expert with the ability to make informed decisions _by design_ as opposed to by chance. To put the power of decision making in their hands takes this away from you and lessens their perception of your value. Upon entering into a business contract with you in which they are giving you money in exchange for knowledge, ability, and skills you possess and they do not, this should not be an issue, provided the process has been managed properly.\n\nI opt for a process based approach, allowing for revisions. It has been my experience that I seldom need more than three to arrive at a final solution—provided there is a thorough brief which the client has signed off on, clearly stating what they understand, and what they intend you to deliver.\n\nIf they make a comment, suggestion, observation &c which you honestly did not consider, always say “I did not think of that. Thank you for bring that to my attention. I will be mindful of that during my next round of revisions” or something to that effect. Understand that your client knows more about their context they you can. Humility goes a long way in fostering trust and respect between client and designer, which in turn results in a more efficient process. If they make a comment about something you _did_ consider, but chose not pursue, explain how and why. If they insist, there’s not really a lot you can do. You put your best foot forward, empowered them to make informed decisions by explaining your work, but you can’t take away their ability to choose. Going around in circles is bad for everyone. Everyone will get tired and frustrated, the work and relationship will suffer, and you probably won’t see them again (at this point, you probably won’t want to though either. Be mindful that time = money for all parties involved.\n\nCertainly have some fall-backs in place, and when all else fails, sell them their favourite colour, get sign-off, and move on to the next job.\n\n"
    },
    {
      "time": "10 Apr 2013 — 10:15am",
      "content": "You should be aware many of those logos are custom drawn words.\n\n"
    },
    {
      "time": "10 Apr 2013 — 1:04pm",
      "content": "I thought the title of this thread was about selling wordmarks with a typo ...lol. I just finished doing some work for ferrari dot com and caught a huge typo!\n\nn.\n\n"
    },
    {
      "time": "10 Apr 2013 — 1:28pm",
      "content": "\\> You may have underbid\n\nYeah, I still don't know how to calculate my working hours + inspiration hours + idea hours + experience ...  \nI will learn from my mistakes I guess\n\n"
    },
    {
      "time": "10 Apr 2013 — 2:20pm",
      "content": "\\> it looks so simple, they think ...  \n\\> “it must have been easy for you to make that\n\nYep. Taking complex ideas and distilling them into a simple solution can be very difficult, but clients often don't realize that.\n\n\\> I still don't know how to calculate my working hours\n\nThat's a common problem. I've been doing this for 30 years and I still miscalculate all the time. But it helps to break it down into categories. How much time will I spend talking/meeting with the client? How long doing research? Concepts? Final art? Revisions? (Or as one of my design professors once said, carefully calculate how long the job will take; then multiply by 3 ;)\n\n"
    },
    {
      "time": "10 Apr 2013 — 9:35pm",
      "content": "You sell it like how you sell any design solution. You show how the solution meets their business needs. How it fits into their target market, objectives and strategy.\n\n"
    },
    {
      "time": "11 Apr 2013 — 1:15am",
      "content": "@Chris Dean : thanks for that extended comment. Interesting point of view. I will definately do the \"how I got there\" approach! How ever I think I will show a few options, I can't resist :)\n\n@Frode Bo Helland: What about the helvetica logo's etc. Those aren't custom drawn words right? Sometimes it can really just be the font.\n\n@JamesM : very interesting the \"multiply by 3\", might be very accurate in my case ;)\n\nExtra question: you think it would help if I let clients know that these fonts cost a lot of money too. Or is this irrelevant?\n\nThanks all !\n\n"
    },
    {
      "time": "11 Apr 2013 — 2:22am",
      "content": "> What about the helvetica logo's etc. Those aren't custom drawn words right? Sometimes it can really just be the font.\n\nYes, but where off the shelf typographic solutions have been used it is often in conjunction with a brand where it makes sense. If you can explain and justify your reasons for an off the shelf solution then go ahead.\n\n"
    },
    {
      "time": "11 Apr 2013 — 2:23am",
      "content": "> Extra question: you think it would help if I let clients know that these fonts cost a lot of money too. Or is this irrelevant?\n\nThat is very relevant, particularly if your design solution is not the only consideration for how they will use the typeface. In a large corporation a brand redesign incorporating a typeface could result in that typeface being used for every conceivable kind of output, including digital embedding, web fonts, broadcasting, all of which they will need to license for. If they are going to be paying for it, and considerably more than your consultation fee (possibly year on year), they will want to know that up front.\n\n"
    },
    {
      "time": "11 Apr 2013 — 2:38am",
      "content": "@ Karl Stange: Thanks for the feedback.  \nAbout off the shelf typo: do you think for example BMW and JEEP wanted to relate their brand with a ready made font?  \nI wonder how the ad men explained this off the shelf font for what is supposed to be a luxury car?  \nWhat do you think?\n\n ![](http://web.archive.org/web/20140721210616im_/http:/typophile.com/files/helvetica_logos1_3569.jpg)\n\n"
    },
    {
      "time": "11 Apr 2013 — 3:26am",
      "content": "To my mind neither Jeep nor BMW are good examples, as I would imagine that most people (e.g., people buying the cars or consuming media in which these brands would likely show up) see a car before they see the typeface. With that in mind I would imagine that the primary concern with any update to those brands would focus on emphasising the core traits of those brands, embracing their history as much as their contemporary perception by consumers, jobs for which I would imagine many existing typefaces serve that purpose. You could _probably_ choose a number of similar typefaces to do the job without greatly changing perception of the logo/logotype.\n\n"
    },
    {
      "time": "11 Apr 2013 — 8:59am",
      "content": "\\> you think it would help if I let clients know  \n\\> that these fonts cost a lot of money too.\n\nThere are two issues here. If you mean you want to impress them that you paid a lot of money out-of-pocket for those fonts, reducing your profit because your bid included any expenses, well that's up to you.\n\nBut if you mean that THEY will need to purchase copies of those fonts, that's a separate issue. They won't need fonts to reproduce the logos because you'll provide finished logos in formats that don't require them to have the fonts on their computer (bitmapped, or vector art where the type has been converted to paths). So they would only need the fonts if you're recommending that they also use those same fonts when setting text (in ads, for example). In that case the cost of fonts would be highly relevant, since they'll need to purchase copies.\n\n"
    },
    {
      "time": "11 Apr 2013 — 8:56am",
      "content": "\\> I wonder how the ad men explained this off the  \n\\> shelf font for what is supposed to be a luxury car?\n\nI doubt if the subject even came up. The designers' jobs included picking appropriate fonts. They showed their layouts and the clients approved.\n\n"
    },
    {
      "time": "11 Apr 2013 — 11:51am",
      "content": "AnaBanana, in all your designer / client relationships this is all you'll ever need to do...\n\nDon't sell the steak, sell the sizzle!\n\n;)\n\n[http://www.youtube.com/watch?v=eUmxGqsuKmY](http://web.archive.org/web/20140721210616/http:/www.youtube.com/watch?v=eUmxGqsuKmY \"http://www.youtube.com/watch?v=eUmxGqsuKmY\")\n\nn.\n\n"
    },
    {
      "time": "12 Apr 2013 — 6:07am",
      "content": "The logo is the sizzle – the identity is the steak.\n\nA logo on its own is only half a job –&nbsp;you should also demonstrate how it works in practice either with mockups or visuals.\n\nFor example a clothing line will need packaging – even if it is only a bag or stationery or a mocked up embroidered logo, how and where you apply it – what colours you use it on; whether you have to develop a small-use logo with simpler more open features; how small it can go how it would work on an illuminated sign. Demonstrate that you have considered the production processes.\n\nA couple of mood or concept boards showing thought process, a couple of logo presentation boards (1 showing the logo in all its glory, 1 showing the minimum size, exclusion zones, colour and mono versions) and a couple of boards of visuals or mockups.\n\nIf the logo is accepted the development for all the collateral can be used to cover your costs.\n\nTim\n\n"
    },
    {
      "time": "14 Apr 2013 — 10:41am",
      "content": "> The logo is the sizzle – the identity is the steak.\n\nNo.\n\nDifferent cuts of steak have different identities, t-bone, sirloin, etc.. The 'logo' is an integral element to a particular cut of steak. Think of the logo as the marbling of fat content, or the bone in the t-bone, etc.. The rest of the identity is defined by texture, shape, colors, etc..\n\nPaul Rand added character to IBM's branding/identity by simply adding a few horizontal lines to the existing capital letters. Think of those few horizontal lines as the marbling of fat in a sirloin steak. Those lines define IBM's identity. And how those lines are PERCEIVED is the sizzle of the steak.\n\nIn Rand's words 'a logo can only be successful by association'. How that association is perceived is the sizzle. It is how YOU perceive the mark. Not the other way around.\n\nDon't sell steak, sell the sizzle.\n\nLogos in general (and the overall identities too, and to a certain extent graphic design in general) have become trite and stale just because of the failure to teach that simple principle on the college or university level!\n\nIn my humble opinion of course.\n\n"
    },
    {
      "time": "14 Apr 2013 — 10:50am",
      "content": "No, no, no.\n\nThe steak is product, and the plate is the identity. The broccoli is the logo. And the napkin is the...uh...style guide? Wait, no. That's not right. What's for dessert?\n\n"
    },
    {
      "time": "14 Apr 2013 — 4:24pm",
      "content": "\\> The logo is the sizzle – the identity is the steak.\n\nI honestly don't know what the traditional thinking on this is, but to me the steak is the company's product or service, and the sizzle is customer's benefit (often hyped to an absurd level in the ads) from that product or service.\n\nOr something like that. These are expressions used more by ad agencies than by identity designers.\n\n\\> A logo on its own is only half a job\n\nAgree completely. It always annoys me when I see designers doing identity projects and at the end they just hand over a logo and consider the project done. That's only a fraction of the work that needs to be done to build an identity system.\n\n"
    },
    {
      "time": "15 Apr 2013 — 6:01am",
      "content": "Hahaha, I love how this conversation is going ;)\n\nAnyway, I just had my meeting with the client and she loved the steak and the sizzle!  \nI showed her my process from her moodboard to mine, to the final logo and put it on a shop sign and a small add.  \nShe chose the logo I loved the most which was an all font logo where I adapted the letters a little bit.\n\nThanks all for the advice and the support !!\n\n"
    },
    {
      "time": "15 Apr 2013 — 6:20am",
      "content": "Good going!\n\nhhp\n\n"
    },
    {
      "time": "15 Apr 2013 — 7:46am",
      "content": "Glad to hear it went well.\n\n"
    },
    {
      "time": "16 Apr 2013 — 3:06am",
      "content": "Oh dear. I'm a vegetarian. What do I do? Can I use tofu instead?\n\n"
    },
    {
      "time": "17 Apr 2013 — 7:16am",
      "content": "I'm sure tofu could sizzle and the best gyoza I have had were avocado and tofu and they definitely sizzled!\n\nOh dear, now I'm hungry.\n\n"
    }
  ]
}
