{
  "id": "102105",
  "title": "A font to use with DIN?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi guys,\n\nIm tidying up my Resume and using DIN Bold for my name and DIN regular for job title...any suggestions on a font to go with Din that is suitable for body text other than DIN regular??\n\nThanks\n\n",
  "author": "Joe90",
  "time": "8 Apr 2013 — 5:52am",
  "uid": "48376",
  "comments": [
    {
      "time": "8 Apr 2013 — 8:51am",
      "content": "Why did you choose DIN?  \nWhat kind of job are you looking for?\n\nhhp\n\n"
    },
    {
      "time": "8 Apr 2013 — 7:04pm",
      "content": "Hi hrant,\n\nIve always been a huge fan of Din but never had much a chance to use it before. Ive used some Din condensed for other work Im branding myself on. Its to send out to various companies I see advertising, including design agencies. This is the first time 'rebranding' myself since college 3 years ago...so dont be fooled by my D.OB on here :)\n\nOk Im getting scared now and going to run back under my helvetica shell lol\n\n"
    },
    {
      "time": "8 Apr 2013 — 7:55pm",
      "content": "If you think DIN says something about you because you like it, then it sounds like a solid choice.\n\nAs for a companion: I've been recommending Axia\\* a lot lately (hey, maybe I should use it on _my_ résumé :-). But it might be too strong.\n\n\\* [http://typographica.org/typeface-reviews/axia/](http://web.archive.org/web/20140720181621/http:/typographica.org/typeface-reviews/axia/ \"http://typographica.org/typeface-reviews/axia/\")\n\nhhp\n\n"
    },
    {
      "time": "9 Apr 2013 — 3:02am",
      "content": "Hrant, would your résumé be bilingual? As soon as I saw your comment I was imagining it in Armenian and French!\n\nJoe, are you familiar with the history of the, [Deutsches Institut für Normung](http://web.archive.org/web/20140720181621/http:/www.din.de/cmd?lang=en&level=tpl-home&contextid=din&languageid=en) as a standards body? I am intrigued that you identify with the fonts on a personal level. Whatever you do, don't run back to Helvetica!\n\n"
    },
    {
      "time": "9 Apr 2013 — 6:35am",
      "content": "Sadly, no. Even if I were applying for a job in Armenia (I'm in LA) I would probably end up using either English or Russian.\n\nhhp\n\n"
    },
    {
      "time": "9 Apr 2013 — 7:17am",
      "content": "Hi Karl, yeah Ive been on that site before, sure its all about Din you silly billy ;)\n\n ![](http://web.archive.org/web/20140720181621im_/http:/typophile.com/files/din_5036.jpg)\n\nOn a personal level I just love how my name sits in Din bold...I could look at it every night, in fact thats exactly what I do. I wish there was a town in Germany named Joe90..just so I could have a sneaky perv driving by the sign in my V-Dub :)\n\nDas DIN vertritt die nationalen Interessen in Europa und weltweit.\n\n"
    },
    {
      "time": "9 Apr 2013 — 7:15am",
      "content": "Screw it...Im going with Arial Black. I see a job going at Procter and Gamble.\n\n"
    },
    {
      "time": "9 Apr 2013 — 7:17am",
      "content": "> Screw it...Im going with Arial Black. I see a job going at Procter and Gamble.\n\nNo!!! Well, if the pay is good...\n\n"
    },
    {
      "time": "9 Apr 2013 — 7:22am",
      "content": "> Even if I were applying for a job in Armenia (I'm in LA) I would probably end up using either English or Russian.\n\nOut of interest, which fonts would you be inclined to use for those?\n\n"
    }
  ]
}
