{
  "id": "1022",
  "title": "Trapping",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Kent,   \n   \nYou have put it well.   \n   \nDo you mind if I insert (AND UNITIZING) and see if it meets with your approval. I am using uppercase to show it is not your words but mine. I am \"not\" rewriting your sentence, I am just asking if you agree with my insertion?   \n   \n.....   \n   \n\"But Tschichold had to adapt to both constraints -- duplexing (AND UNITIZING) for Lino, unitizing for Mono. So he made the choice to make the two 'a's fit the 9 units (which yields a noticeably wide roman 'a') instead of cramping the italic in the 8-unit slot.\"   \n   \n........   \n   \nUnless systems in Europe were not equal to America? I refer you to Mike Parker\n\n",
  "author": "gerald_giampa",
  "time": "27 Aug 2003 — 7:03am",
  "uid": "2094",
  "comments": [
    {
      "time": "27 Aug 2003 — 7:07am",
      "content": "Kent,   \n   \nWonderful illutration of the problem. Thank you.   \n   \nWe were both posting at the same time. Obviously I have wasted my time.   \n   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "27 Aug 2003 — 7:41am",
      "content": "Kent, nice experiment!   \n   \n\\> If Sabon had been designed solely for Monotype, the roman 'a' could have been put on 8 units   \n   \nMy problem with that is I think the cramping of the 8-unit Italic \"a\" is so slight that making the Roman \"a\" so much better would have made more sense.   \n   \n\\> If Sabon had been designed solely for Monotype, the roman 'a' could have been put on 8 units, which would have given a more traditionally Garamondesque proportion; while the italic 'a' could have been placed on 9 units, so as not to be too narrow.   \n   \nConversely, if Sabon had been designed solely for Linotype (with no Monotype issues), the two \"a\"s would have been duplexed, but to a more satisfying compromise width.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Aug 2003 — 8:07am",
      "content": "BTW, I assume Sabon was optically graded. What size is that digital Sabon based on? I ask because the width decision on the \"a\" (9 versus 8) would have depended on the target point size.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Aug 2003 — 8:21am",
      "content": "Hrant,   \n   \nI am not so sure about that. First we must understand the meaning of this.   \n   \nMike Parkers words.   \n.....   \n\"The idea was to replace linotype operators with faster tape drives. In order to justify lines predictably, each character had to have a predictable width. Fairchild established a standard width for each character expressed in a single fixed set of eighteen units to the set width em to be used for all typefaces regardless of typeface design. The wider the column width, the larger the eighteen unit set width required.\"   \n   \n.....   \n   \nI read this to mean: Unlike Monotype where the units were based on the em of the type, The units in Linotype were simple a fixed formulae giving truth to predictability of column width regardless of type design. In otherwords the column width is more important than the type width. In any event, it appears to be quite cumbersome. And I predict your solution would not be quite that simple.   \n   \nPerhaps I am wrong! I don't think so.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "27 Aug 2003 — 8:26am",
      "content": "Hrant,   \n   \nMy comment was intended to be above your last.   \n   \nThose are the issues I am addressing. Actually I think my comments still applies. So it can follow both of your last two posts.   \n   \nGerald Giampa   \n   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "27 Aug 2003 — 10:13am",
      "content": "_\\>Do you mind if I insert (AND UNITIZING) and see if it meets with your approval._   \n   \nGerald --   \n   \nActually, I do not agree, in this instance. I think you are misinterpreting Mike's reference to TTS. The development of TTS machines led to the introduction of unitizing systems within the Linotype line, but these units were not subsequently applied to all projects. TTS was used only (or at least predominantly) in the transmission and setting of newspaper copy. TTS units would only have been used on faces intended for newspaper composition.   \n   \nThis is my understanding, but you might double-check with Mike. I don't have his new number since he moved.   \n   \nNow, news faces were the large bulk of Linotype's bread and butter in the late 1950s and 1960s, as newspaper comp was the last bastion of Lino's market. (Mike has said that Jackson Burke lamented that most of his tenure at the head of the MLCo. type department was spent forever revising faces for ever-narrowing newspaper columns.)   \n   \nBut it was not the entirety of Lino's type output. Sabon would have been targeted toward the book composition market, and those houses would not have had TTS machines nor any need to conform to TTS standards. So I do not think it is reasonable to assume that Sabon needed to be designed to any unitized system on account of Linotype composition.   \n   \nSabon would have been developed while Mike was at the helm of the American MLCo. type dept., I believe. The face was cut by Stempel (who were essentially German Linotype), but Mike might have some direct recollections. You could ask him.   \n   \nHrant --   \n   \nI do not know which size this digital Sabon (Adobe's BTW) would have been based upon. I would presume the 12 point, based on what I know of the general transition of designs from metal to photo to digital. But I can only assume.   \n   \nYou may be right and the decision about which unit width to assign the 'a' to could have varied by size -- wider for the smaller sizes, narrower for display. On the other hand, I doubt that Tschichold would have made a different decision. Just a practical matter. Text would have been set primarily by machine comp; display would usually have been set by hand, I imagine. So all of the Lino and Mono sizes would probably all have the same wide 'a'. I suppose that the foundry display sizes could have been cut without these restrictions, but I don't know. I don't have information about what sizes were released in each medium.   \n   \nClearly, you would have made a different decision under the same circumstances -- sacrificing the italic 'a'. Tschichold made the other decision.   \n   \nObviously, Sabon was ripe for revision in digital without all the constraints, as aptly demonstrated by Jean-Fran\n\n"
    },
    {
      "time": "27 Aug 2003 — 10:19am",
      "content": "Everyone: Posted on Monday, August 25, 2003 - 11:16 pm:   \n   \nA Linotype face, on the other hand, have both the roman and italic \"A, B C & so on\" punched into the same matrix.   \n   \nShould have read something like this.   \n   \nA Linotype face, on the other hand, had both the roman \"A\" and italic \"A\" and Bold \"A' punched into the same matrix etc.   \n   \nWe already know that. But just for the record.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "27 Aug 2003 — 10:23am",
      "content": "\\> I would presume the 12 point   \n   \n\\> all of the Lino and Mono sizes would probably all have the same wide 'a'.   \n   \nI don't get it: Did Sabon have optical scaling or not?   \n   \nhhp\n\n"
    },
    {
      "time": "27 Aug 2003 — 10:35am",
      "content": "I don't know. But I don't think I'm understanding what you're trying to get at.   \n   \nHere's my point: If the design is based on an 18-unit system and the 'a' is allocated to 9 units, then even if there is slight adjustment overall, wider or narrower, for optical compensation at varying sizes, the 'a' will still be relatively wide.   \n   \nIt's all relative. The 'a' will always appear relatively wide, compared to the general proportions of the design, if none of the letters are reassigned to different unit widths.   \n   \nThis makes sense to me. Does it to you? Or are you driving at something different?   \n   \n-- K.\n\n"
    },
    {
      "time": "27 Aug 2003 — 10:43am",
      "content": "Kent,   \n   \nI certainly hope you are right. I have already written Mike Parker for clarity on the matter.   \n   \nBut you must agree that this, (\"for all typefaces regardless of typeface design.\") does not make that distinction.   \n   \nI will get back to you on that.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "27 Aug 2003 — 11:35am",
      "content": "Kent what software are the screenshots from?\n\n"
    },
    {
      "time": "27 Aug 2003 — 11:44am",
      "content": "Folks forgive me.   \n   \nGezzads. correcting, corrections. Will this never cease.   \n   \nI will stick to \"pairs of letters\" of the alphabet punched into a single linotype matrice. Don't say anything folks. This might be wrong.   \n   \nNow I am not sure about anything this evening.   \n   \nBut I expect to hear from Mike by morning. But I am not sure about that?   \n   \nGerald Giampa   \nDon't wait up for me!\n\n"
    },
    {
      "time": "27 Aug 2003 — 12:51pm",
      "content": "Kent, I agree.   \nWhat I'm thinking though (and I'd have to carefully look at many glyphs in Sabon to be sure) is that the width discretization going on simply affected the \"a\" the most (or at least a lot more than average), and that we can't judge the \"a\" adequately without knowing the target point size. Kind of hard to explain - or maybe I'm imagining it.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Aug 2003 — 2:12pm",
      "content": "H\n\n"
    },
    {
      "time": "27 Aug 2003 — 2:53pm",
      "content": "I think the reason you gave (the combination of style duplexing and \"width snapping\") makes total sense.   \n   \nThis all started when I said Monotype has at least that limitation which foundry (and digital) don't - something that's pretty obvious to anybody not religious about Monotype- and the blame for the width of the Sabon \"a\" can be attributed to that limitation, at least partially. When it comes to the Monotype \"width snapping\" limitation, Sabon is not a special case qualitatively, just quantitatively: the \"a\" would still have been too wide (just less), or maybe too narrow, even if JT didn't have to factor in the Linotype's limitation (duplexing) as well.   \n   \nMy other line of thought was just an attempt at analyzing JT's design decisions.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Aug 2003 — 2:53pm",
      "content": "Gerald --   \n   \nA picture may be worth several words. Here's what a Linotype matrix looks like, for those who've never seen one. Sorry the photo isn't better.   \n   \n ![Linotype Matrix](http://web.archive.org/web/20150416140222im_/http:/www.typophile.com/forums/messages/4100/14919.jpg)   \n   \nThis is a 14-point 'w' matrix (I don't recall which face), roman duplexed with italic. This matrix is shown in its operating position -- i.e., \"upside down\". If you turned it over, you'd notice that the letters are actually right-reading, and the roman would be on the bottom and the italic on the top. Obviously, each letter must have the same set width.   \n   \nGenerally speaking, a roman letter would be duplexed with the corresponding letter in either italic or bold. (This was not the case, however, with small caps, which duplexed with other sorts. There was a standard scheme of what went with what, but I don't have a map handy.)   \n   \nI hope this helps folks trying to make sense of this thread.   \n   \n-- K.\n\n"
    },
    {
      "time": "27 Aug 2003 — 4:29pm",
      "content": "_\\>When it comes to the Monotype \"width snapping\" limitation, Sabon is not a special case qualitatively, just quantitatively: the \"a\" would still have been too wide (just less), or maybe too narrow, even if JT didn't have to factor in the Linotype's limitation (duplexing) as well._   \n   \n   \nMissed this post earlier, as I guess we were cross-posting.   \n   \nI don't disagree that the 18-unit system was a limitation. Absolutely. It certainly was.   \n   \nIt seems to me type design is always about confronting one technical limitation or another. I actually think that's part of the challenge and the fun.   \n   \nStill, I'm not so sure that Tschichold couldn't have made a completely acceptable 'a' if the Lino duplexing constraint was removed. It would be an interesting experiment to do an adaptation that still conforms to Mono unitizing, but without Lino duplexing, just to see.   \n   \nFor instance, the 'a' in my first example above seems almost completely fine in an 8-unit width. A little more tweaking throughout the alphabet and I bet you could come up with a version in which the 'a' appeared neither too wide nor too narrow, while still being Mono-friendly.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "27 Aug 2003 — 6:09pm",
      "content": "Kent,   \n   \n_I don't know. I don't have information about what sizes were released   \nin each medium._      \n   \nand Hrant,   \n   \n_Did Sabon have optical scaling or not?_   \n   \nlet me quote from\n\n"
    },
    {
      "time": "27 Aug 2003 — 6:29pm",
      "content": "_optical scaling or not?_   \n   \nLooking at it again here, Hrant, the sizes shown for Stempel\n\n"
    },
    {
      "time": "27 Aug 2003 — 8:03pm",
      "content": "Interesting.   \nI think the Lino boys applied their optical scaling expertise to the drawings. Would JT have allowed that? What about the small Monotype sizes? I have (actually _will_ have, in January) access to a good size range of metal Sabon, but I don't know if it's Stempel or Monotype. Should be easy to tell, even without pin marks: the former would have a dark lustre, while the latter would look tinny.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Aug 2003 — 8:24pm",
      "content": "\\> the Penrose Annual, 1968   \n   \nI'm going to try to pick that up tomorrow at UCLA. That and a bunch of other goodies...   \n   \nhhp\n\n"
    },
    {
      "time": "28 Aug 2003 — 12:36am",
      "content": "Hrant,   \n   \nMonotype should be easy to distinguish from Stemple, assuming Stemple has a pin mark. Odds are, with a Monotype, there will be no pin mark.   \n   \nTinny, it could be, we ran hard foundry metal, which meant running slow and hot. Our type would not be distinguishable from foundry type by colour alone.   \n   \nKent   \n   \nThe picture of the Linotype Matrix, is exactly what I was, poorly, trying to say. Thank you.   \n   \nI agree that the unit system had limitations, but it was an engineering puzzle, not a method of soliciting customer complaint. It was a challenge as you say, but for the most part, the engineers did a very fine job.   \n   \nMonotype houses were noted for typographical expertise or they would have purchased a lessor system. More skill was required in running Monotype Systems than Linotypes. Monotypes were the system of choice for both trade typographers and book houses. Not so often, run of the mill print shops or newspapers. There were many exceptions.   \n   \nLanston used typographers and fine book printers as, \"Beta Testers\". Bruce Rogers was amongst them. I can assure you, non were shy with comment, each trying to out do one another as a method of showing off their typographical finikitiness. (Is that a word?) And they didn't give a tinkers dam about punchcutters problems, or unit rows, they just wanted the typeface to pass their highest standards.   \n   \nThat was the primary goal of Lanston's punchcutting department. To satisfy production oriented owners and cranky artistic and very opinionated personalities. They did so, for the most part, very well.   \n   \nWith \"multiple typesetting system planning\" the Sabon \"roman and italic a' is not illustrative of English Monotypes finest capabilities, probably the same is true for Linotype.   \n   \nCriticism should be kept in perspective. This face is an exception, not a rule. This experiment in joint development was doomed to have \"some fall out\".   \n   \nCharacters of the alphabet in the Monotype System, were not out of necessity, \"too wide\" or \"too narrow\" or as some would suggest, never quite right. In most cases adjustments were made and the type designer would never see the difference. Either did the fussy customers after their complaints had vanished. I know the problem with the Sabon roman and italic \"a\" could have been minimized to the point this discussion would never take place. This is a grossly exaggerated example.   \n   \nHowever the Linotype duplex problem is an efficiency that is bound to cause problems.   \n   \nBut the secret to making Sabon \"roman a\" and the italic \"b\" appear correct in the Linotype version may lie in\n\n"
    },
    {
      "time": "28 Aug 2003 — 6:50am",
      "content": "Kent,   \n   \nAnd finally the old news is good news. Mike Parker has reported.   \n   \nBelow is Mike Parker\n\n"
    },
    {
      "time": "28 Aug 2003 — 9:49am",
      "content": "_Let us revisit Sabon, if Sabon has no bold, draw one. Who cares what it looks like? Lets fix that \"roman a without messing up the italic a\" and be done with it!_   \n   \nIt's been done, Gerald. Jean-Fran\n\n"
    },
    {
      "time": "28 Aug 2003 — 1:16pm",
      "content": "Hrant,   \n   \n_I think the Lino boys applied their optical scaling expertise to the drawings.   \nWould JT have allowed that? What about the small Monotype sizes?_      \n   \ngoing back to what Dreyfus wrote (\"as well as modifying the design in its larger   \nsizes for the type founder\"), it would seem that the small-size design was the first   \nto be done, no? And that's exactly what's stated at the Linotype page on Sabon next   \nthat John Hudson linked to: \"a design originally made in two versions for different   \nsystems. The first was designed for use on Linotype and Monotype systems. The second   \nversion of Sabon was designed for Stempel handsetting\". In any case the drawings   \nreproduced in the Penrose Annual article (that you may have in your hands now) are   \nof the \"Stempel\" variety (long extenders, narrow 'a'). Interestingly, they also conform   \nto the Monotype 18-unit width grid.   \n   \nIn the image below, a comparison of a Stempel foundry Sabon showing (scanned from a   \nxerox copy) and Adobe's digital Sabon:   \n   \n ![Sabon](http://web.archive.org/web/20150416140222im_/http:/www.typophile.com/forums/messages/4100/14974.gif)   \n   \nIt seems to my eyes that in Porchez's Sabon next the extenders are not quite as long as   \nin the Stempel design:   \n   \n [http://www.fontexplorer.com/isroot/FontStore/content/00\\_home/images/home\\_06/home\\_06b/sabon\\_next/sample03.gif](http://web.archive.org/web/20150416140222/http:/www.fontexplorer.com/isroot/FontStore/content/00_home/images/home_06/home_06b/sabon_next/sample03.gif)\n\n"
    },
    {
      "time": "28 Aug 2003 — 1:22pm",
      "content": "And, Hrant, coming back to something you wrote earlier in this thread:   \n   \n_\\> Which 7-unit typeface(s) are you referring to?   \n\\> [http://www.themicrofoundry.com/other/lino7.gif](http://web.archive.org/web/20150416140222/http:/www.themicrofoundry.com/other/lino7.gif)_      \n   \nSince you have there characters at 2.5 and 3.5 unit widths, this is in effect   \na 14-unit design.\n\n"
    },
    {
      "time": "28 Aug 2003 — 9:45pm",
      "content": "\\> (I don\n\n"
    },
    {
      "time": "29 Aug 2003 — 2:02am",
      "content": "Hrant,   \n   \nActually it is a simple mistake. It reads \"Seven unit sizes\". But it is based on 14 units. You can have 18 monotype units and have only 1 or 2 unit sizes, such as the 3 unit type for train schedules we custom cut for American Eastern Railways. Actually digitized the face in 1989, imagine!   \n  \n.......   \nRodolfo Capeto words,   \n   \n\"The first was designed for use on Linotype and Monotype systems. The second version of Sabon was designed for Stempel handsetting\". In any case the drawings reproduced in the Penrose Annual article (that you may have in your hands now) are of the \"Stempel\" variety (long extenders, narrow 'a'). Interestingly, they also conform to the Monotype 18-unit width grid.\"   \n........   \n   \nThis gives strength to my understanding of this particular cutting. Without more \"surprise knowledge\" of Stempel systems I would not think using Monotype's 18 unit grid would have been standard practice.   \n   \nMeasures of \"harmonious typesetting standardization\" appear to be the very underpinning of intention for the \"Sabon Project\". It would seem to me, all parties were attempting to co-ordinate usage of Sabon to service some special objective.   \n   \nFew examples are so clearly illustrate the old adage, \"the exception proves the rule\".   \n   \n   \n   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "29 Aug 2003 — 2:19am",
      "content": "Hrant,   \n   \nFurther note, that the railway type was on Monotype's 18 unit grid, although it was a \"3 unit size\". But the railway type could be viewed, in a mathematical context, as 8 unit type. Confusing isn't it.   \n   \nAlso, even though it was 12pt type, the 18 units only totalled 10pts!   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": "29 Aug 2003 — 9:37am",
      "content": "Rodolfo, Kent: I haven't read it yet, but here's a 300-dpi scan of a page from Lawson & Bidwell's \"Specimens of Type\" (1981) that might explain things a bit. Note however that this deals with ATF, not Linotype.   \n   \n(~330Kb) [http://www.themicrofoundry.com/other/self\\_spc.gif](http://web.archive.org/web/20150416140222/http:/www.themicrofoundry.com/other/self_spc.gif)   \n   \nhhp\n\n"
    },
    {
      "time": "29 Aug 2003 — 3:30pm",
      "content": "Hrant:   \n   \n_You darling little Modernist you!_   \n   \nThanks for the compliment!   \n   \n_\\> the small-size design   \nWhen you say that, you're implying there was one design for all the text   \nsizes, i.e. no optical scaling except to provide two cuts, one for text and   \nthe other for display. So is that the case?_      \n   \nAs far as I can gather from the images I\n\n"
    },
    {
      "time": "29 Aug 2003 — 3:52pm",
      "content": "\\> Do you know the date of that system?   \n   \nNope. The 1981 book is like a collage of a bunch of previous specimens, so there's no date. But maybe some smart investigation (like seeing what fonts were used in those pages) could narrow it down a lot.   \n   \nWhat I can tell you is that one ATF specimen book I have which seems to be from 1904 doesn't show anything like that, but the 1923 does. In fact the '23 shows a 4-unit system! But again, not \"units\" like you mean.   \n   \nIn terms of Monotype, like you implied, discretization there plays a different role than in handsetting: it's an issue of mechanical simplcity/economy, as opposed to heuristic efficiency. A human couldn't really work well with an 18-unit system.   \n   \nMore interesting is the comparison with Linotype, with their TTS. Machine composition, still, but discretization for humans.   \n   \n\\> Or maybe Tschichold simply couldn\n\n"
    },
    {
      "time": "30 Aug 2003 — 12:01am",
      "content": "Hrant,   \n   \nYour example of heuristic efficiency.   \n   \n [http://www.themicrofoundry.com/other/self\\_spc.gif](http://web.archive.org/web/20150416140222/http:/www.themicrofoundry.com/other/self_spc.gif)   \n......   \n   \nWhat do you like about it? The fact the it reduces heuristic \"trail and error\" tasks. Frankly your example is of \"hideous typography\" to put it \"pleasantly\". You don't like 18 units on a keyboard because it eliminates heuristic \"trail and error\" tasks.   \n   \nSo where is that line between good and evil?   \n   \nBoy there has got to be something you are not telling us.   \n   \nThe TTS Machine problems were compound. There were problems, big ones. It resembles your 7 unit error.   \n   \nMike Parker\n\n"
    },
    {
      "time": "30 Aug 2003 — 12:22am",
      "content": "Rodolfo Capeto   \n   \n\"Or maybe Tschichold simply couldn\n\n"
    },
    {
      "time": "30 Aug 2003 — 4:41am",
      "content": "_\\>More interesting is the comparison with Linotype, with their TTS._    \n   \nJust to clarify, TTS did not belong to Linotype. As I understand it, the TeleTypesetting System was an independent technology for transmitting wire stories to newspapers. Those publishers who subscribed to the service would receive stories via wire, which came out as punched tape. These tapes were then fed into the composing machine and produced typeset stories for the newspaper to publish. The device that interpreted the punched tape would be fitted to any of the various composing systems. Linotype was only one (arguably the most common).   \n   \nThe point of the unitized standard for typefaces used with the TTS was that the stories would always run to the exact same characters per line and, consequently, an exact column length regardless of the layout of the paper -- specifically, regardless of the column width of the newspaper's grid.   \n   \nThus, a wire service could wait until the last possible hour to file a late-breaking story by indicating in advance that they would have the story run to X column inches and the papers could then continue to lay out their editions by holding open X inches of space for that story. This kind of just-in-time publishing depended upon reliable, consistent character counts, and column lengths.   \n   \nIt had nothing to do with justification _per se._   \n   \nThe Linotype machine required no unit-system in order to achieve effortless justification. It employed a mechanical system that I think was ingenious, but I don't think I can describe it fully here. Basically, it employed wedge-shaped spacebands that adapted automatically to fill out the line.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "30 Aug 2003 — 7:03am",
      "content": "_\\>But maybe some smart investigation (like seeing what fonts were used in those pages) could narrow it down a lot._   \n   \nWell, obviously, the fonts used were self-spacing types. ;-)   \n   \nHere's some research along different lines:   \n   \nLinn Boyd Benton took out his patent for a system of self-spacing type in 1883. The United States Type-Founders' Association defined the American point system of type sizes in 1886. Notice that this article still cross-references the old, named body sizes.   \n   \nUpdike (Vol. I pg. 34) mentions that \"In 1894 a western firm introduced this system of self-spacing types, every type in their entire output being placed on a body the width of which was equal to an even division of the standard 'pica em.'\" This term 'pica em' was apparently soon replaced by the term 'point-set'. Note that your article still refers to divisions of the Pica em.   \n   \nGiven this, I am going to assert that this article dates from between 1886 and around 1896, somewhere thereabouts.   \n   \nThe first typeface issued by (American) Lanston Monotype was in 1896 and it was for the Model C keyboard, which I believe was the arrangement that introduced the 18-unit system. I do not know if this configuration was utilized prior to that.   \n   \nHrant, is this article specifically identified by Lawson & Bidwell as an ATF piece? Updike does not name the \"western firm\" he refers to. I would have thought that if it was ATF, he would have simply said so. ATF was formed in 1892 and Benton, Waldo & Co. was one of the original founders that merged into it. I can't imagine there was any other sizable foundry left after that to introduce such a system, especially given Benton's patent on the scheme. Yet, Updike says that every type was adapted to this system, which certainly does not describe ATF.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "30 Aug 2003 — 8:25am",
      "content": "This 1981 book is a facsimile of an older ATF specimen book. I had to read the intro to get at the original's date (what a drag, eh? ;-) and it says it's the Philadelphia edition of the 1896 (or maybe 1895) book.   \n   \nI suspect Updike is talking not about ATF, but the Bentons' foundry before the ATF merger.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Aug 2003 — 11:10am",
      "content": "Hrant --   \n   \nThe 1923 specimen refers to the Specimen of 1895. So that must be what you have a facsimile of. There you go then.   \n   \nRe: Updike. The problem I have with understanding Updike to be referring to Benton's foundry is that his date of 1894 would have been two years \\*after\\* Benton merged his foundry into the formation of ATF. Now, I think I may have heard that some members of ATF continued to operate semi-independently, so I suppose this could reconcile the matter.   \n   \nJim Rimmer:   \n_\\>I was not really aware that Liontype even worked on a unitizes system._   \n   \nI feel I must reiterate (because perhaps some of Gerald's intervening posts may have muddied things) -- the Linotype system (metal) **did not** require the type designer to work within fixed unit-widths. There were a few particular situations where a typeface would be unitized -- for reasons having nothing to do with the Linotype system _per se._ The foremost examples were TTS typefaces, for specialized newspaper setting, and special faces for setting tabular matter (which, as Jim pointed out, was a real pain on the Linotype).   \n   \nLet me be clear, I do not think that Linotype was superior to Monotype because of the lack of a unitizing constraint. Nor do I think that Monotype was superior to Linotype because it lacked duplexing constaints. I think both were marvelous inventions and amazing examples of mechanical ingenuity. I think the type designers and letter draftsmen (and women) did a remarkable job in both systems. Each had its strengths and its weaknesses. Both brought us, happily, to where we are now.   \n   \n_\\>It's Saturday morning and I have just spent the last five days cutting [...]_   \n   \nJim, best of luck fitting that 'f'.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "30 Aug 2003 — 8:58pm",
      "content": "\\> Goudy ... found it a long and difficult task   \n   \nAnd isn't it true that Goudy wasn't... uh... the sharpest tool in the shed when it came to technical stuff?   \n   \n\\> jumbo Monotype speciman books   \n   \nBTW, I've seen the landmark specimen books for ATF and Linotype, but -besides the \"Tally of Types\" thing- nothing for Monotype. What are some dates for those, and which is the \"best\" one? For one thing, I'd like to see how [well] they did their optical scaling.   \n   \n\\> .... the racetrack promoter ....   \n   \nGreat memories!   \n   \n\\> What I suggest is that with Linotype and   \n\\> Monotype the unit system did not cause   \n\\> any typeface to be a failure because   \n\\> of the restrictions of width.   \n   \nWhat constitutes a \"failed typeface\"?   \n   \n\\> I am ignorant of the Sabon a too-wide problem   \n   \nIt's interesting how some people (like me) would consider knowing about the \"textbook\" Sabon case central to good type appreciation, while others may not. Obviously, you're living proof that you don't have to know about Sabon (or that \"class\" of insight in general) to do great work. But still.   \n   \n--   \n   \n\\> I think I may have heard that some members   \n\\> of ATF continued to operate semi-independently   \n   \nSome tibdits from the 1981 book:   \n- The American Point System was adopted in 1886.   \n- ATF was formed in 1892.   \n- First collective specimen book (with no mention of ATF) was in 1893.   \n- First formal ATF specimen book: 1895.   \n- ATF consolidates its manufacturing facilities in 1903.   \n   \nSo Updike's \"1894\" is about a year before ATF used its own name in any specimen, and about 9 years before ATF made all its fonts in one place.   \n   \n\\> I do not think that ....   \n   \nBut you do think that foundry was superior to both?   \nI mean in terms of type design integrity.   \n   \nWhat did JvK think?   \n   \nhhp\n\n"
    },
    {
      "time": "30 Aug 2003 — 11:11pm",
      "content": "Good morning from Finland,   \n   \nKent,   \n   \nI thought my special efforts to have Mike Parker speak of the matter was appropriate, and as such did not muddy waters. Perhaps Jim Rimmer just missed the posting. I have included extra text of Parker's words which I feel may give \"weight\". Therefore more memorable.   \n   \nE-mail excerpt sent to Gerald Giampa about Linotype units by Mike Parker, these are his words.   \n   \n.....   \nThe typefaces redrawn for teletypesetter use were a TINY group of popular newstext and classified designs, and NOTHING ELSE.   \n   \nHowever, since Fairchild monkeyed with the standard ratio of set size to column width every few years, this small group of typefaces had to be redrawn over and over again just to maintain simple legibility on the current standard.   \n  \nTTS was a black curse to all designers of linecaster newstext and classified typefaces from 1940s to 1980s.   \n  \nWhile this group of types made up a tiny section of the library of fonts, it made up a majority of matrices sold to constantly feed batteries of roaring teletypesetter high speed text machines smashing matrices together at speeds undreamt of by Ottmar Mergenthaler. They ate matrices for breakfast, lunch, dinner, with snacks in between.   \n  \nThis dreadful exercise provided Mergenthaler with a large slice of annual profit, hence its importance to the company.   \n   \nMike Parker   \n..........\n\n"
    },
    {
      "time": "1 Sep 2003 — 9:28am",
      "content": "{I tried to post this in the Optical Scaling thread, but it wouldn't let me.}   \n   \nWould Monotype Centaur\\* be a really good example of the optical scaling expertise of Monotype? If not,   \nwhat's the latest & greatest Monotype specimen book where I could find such expertise most manifest?   \n   \n\\* BTW, I only own the 1996 facsimile of the Centaur specimen book - I know that letterform outline fidelity and typographic color might be thrown off, but would it be safe to assume that the _relative_ color between sizes, as well as the set-widths and vertical proportions are faithful to the real thing?   \n   \nhhp\n\n"
    },
    {
      "time": "1 Sep 2003 — 11:54am",
      "content": "Probably you are not asking me. Also I can not speak for another company. However this face was jointly developed. My instincts are that if there is a failure it would be because too many cooks could spoil the broth. The face was jointly developed by Monotype and Lanston.   \n   \nBut my suspicions are they did a \"good\" job. I suspect it will be very hard to find a sample of Lanston's Metropolitan because it was a private cutting for the Metropolitan Museum of Art.   \n   \nYou would have to look for theirs. I think the real question is, how is the optical scaling in Metropolitan and Centaur in the digital version? Not very good in either case, as there isn't any. I wonder why?   \n   \nWhere are all those sharp blades in the software industry?   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "2 Sep 2003 — 8:42am",
      "content": "{It's really frustrating being prevented from posting to the correct thread...}   \n   \nSo I did some preliminary analysis of Monotype Centaur, by eyeballing the vertical proportions of enlargements of all the sizes, and it seems that there were different masters for the following size ranges:   \n   \n6   \n8, 9   \n10-12   \n14, 16   \n18-72   \n   \nFive masters seems like a good amount (I've heard it was usually three), so they did take optical scaling pretty seriously, at least in the case of Centaur.   \n   \nOn the other hand, I don't know yet if the compensation is linear or better. If it's linear, it would put Monotype slightly below Linotype in terms of optical compensation (since it seems the latter used progressive scaling for each size, but linear math - Kent might correct me). If it's better than linear, it would put Monotype at least as good as Linotype, and probably better depending on how you look at it and/or what actual point size you're looking at. But neither would be as good as ATF, where they used progressive parabolic-looking compensation.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Sep 2003 — 10:46am",
      "content": "Hrant,   \n   \nIf Centaur did not have 11 pt patterns, I am surprised. Anything is possible but without question a goodly collection of patterns were made for Centaur/Metropolitan/Arrighi.   \n   \nRight hand column:   \n [http://www.lanstontype.com/Burgess5.html](http://web.archive.org/web/20150416140222/http:/www.lanstontype.com/Burgess5.html)   \n   \nCutting cards are in existence, it is a matter of access. They would complete the story.   \n   \nIf Bruce Rogers and Frederick Warde were happy, I would be happy. I have never heard they were not.   \n   \nI am not convinced that merely using every trick in the book makes for a good type face. A body of evidence supports the contrary. Some might say that is a matter of taste. I say, yes it is.   \n   \nLegibility and readability were not the predominant determining factors in this cutting. Bruce Rogers did not subscribe, either do I, to all of Stanley Morison's dictums of readability. Looking at Morison's own work, either did he. The point is, the adjustments were not made so that it could be read when \"overinked\", or readable for the \"nearly blind\". This cutting was designed for \"Book Arts\" production.   \n   \nThe intent was to make this type face \"look right\" in different point sizes. I know it will seem crass to some of you readers, but I must dare use the word \"art\".   \n   \n [http://www.lanstontype.com/Metropolitan.html](http://web.archive.org/web/20150416140222/http:/www.lanstontype.com/Metropolitan.html)   \n   \nThis cutting stands as exemplary type craftsmanship. Patterns for optical adjustments were made for many different point sizes. Cutting cards would certainly complete the story of this fine production.   \n   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": "2 Sep 2003 — 3:48pm",
      "content": "OK, I did some more calculations of Monotype Centaur. I measured the width of the word \"the\" (from leftmost black to rightmost black) in each size, normalized the measures by size, and then normalized to the 14 point (since that was the single original foundry size). Here are the [rounded] precentages:   \n   \n 6: 121%   \n 8: 114%   \n 9: 107%   \n10: 100%   \n11: 100%   \n12: 103%   \n14: 100%   \n16: 106%   \n18: 84%   \n22: 90%   \n24: 95%   \n30: 95%   \n36: 94%   \n42: 96%   \n48: 96%   \n60: 97%   \n72: 97%   \n   \nWhat I can tentatively conclude is that:   \n1) The groups are: 6; 8; 9-16; 18-72   \n2) The spacing was done [totally] by eye (hence the sloppy fluctuations).   \n   \nhhp\n\n"
    },
    {
      "time": "2 Sep 2003 — 4:41pm",
      "content": "Rodolfo,   \n   \nSpeaking of optical compensation.... I'm curious, what point size of Stempel's foundry Sabon did you pull that from? It is so much more delicate that I'm suspecting it's something noticeably bigger than the 12 point size that the digital version was optimized for.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "2 Sep 2003 — 6:01pm",
      "content": "_\\>But neither would be as good as ATF, where they used progressive parabolic-looking compensation._   \n   \nHrant, I need to back up a minute and re-examine this with you.   \n   \nYou have said that Linotype's optical grading was linear. I presume you are saying this based on a sample graph that I posted to some other thread a while back, in which a few parameters appeared to be essentially linear. Correct me if I'm mistaken.   \n   \nWhat parameters are you examining in ATF faces that lead you to the \"parabolic\" comment?   \n   \nThe Linotype parameters that I presented were the few that I had data for immediately at hand (from the Advance Proofs for Dwiggins's Falcon) -- size of face (i.e., measurement from top of ascender to bottom of descender), height of the capital H, and length of lowercase alphabet.   \n   \nI am looking at the waterfall of ATF Garamond that you sent me. We can, of course, discount the first parameter, since the face on the body in any given design is practically guaranteed to be linear by point size. Since this sample you sent shows only lowercase, I cannot measure the cap H height. But I can -- and did -- measure the lowercase alphabet length. Here is my graph. (Apologies for the large image.)   \n   \n ![ATF Garamond alphabet graph](http://web.archive.org/web/20150416140222im_/http:/www.typophile.com/forums/messages/4100/15270.gif)   \n   \nMy data --   \nPoint size (l.c. alphabet length in points):   \n6 pt (86.5)   \n7 pt (94.25)   \n8 pt (103)   \n10 pt (117.25)   \n12 pt (133)   \n14 pt (148)   \n18 pt (192)   \n24 pt (250.5)   \n30 pt (305.5)   \n36 pt (362)   \n48 pt (476)   \n   \nThe y-axis is 1:1, but the x-axis is in a ratio of 10 points for every 1 point size increase; I did this so that it would be readable. Thus you can't infer anything necessarily from the angle of the line, but this doesn't affect its essential linearity. There does seem to be a shift in slope at the 14-point mark. We've noted that there is a shift in the underlying master design at this point, so I'm not surprised.   \n   \nAside from that, however, this data is essentially **linear**. Certainly no less so than the Falcon data (which only ranged from 6 to 12 point, BTW). I do not see any parabolic compensation. At least not in set-width: character widths combined with fitting. In this respect, in these cases, ATF and Linotype do not seem very different.   \n   \nFor comparison:   \n   \n ![Falcon Alphabet Graph](http://web.archive.org/web/20150416140222im_/http:/www.typophile.com/forums/messages/4100/15271.gif)   \n   \n6 pt (90)   \n7 pt (98)   \n8 pt (107)   \n9 pt (115)   \n10 pt (124)   \n11 pt (132)   \n12 pt (141)   \n   \nI am open to the possibility that other parameters -- stem weight, cap-height, x-height, extender proportions -- may not be linear. I will be interested to see data on these.   \n   \nBut I will ask you to extend the same openness to considerations of Linotype (or even Monotype) until we have data to examine. I have no personal stake in defending the Linotype drawing office. Linotype just happens to be an object of my study. I remain open to whatever results might turn up.   \n   \nBut let's gather more evidence before drawing conclusions.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "3 Sep 2003 — 3:37pm",
      "content": "Hmmm...   \nI'm not sure exactly what's going on. Let me show you what I have, and maybe we can figure things out.   \n   \nFirst of all, though: You're right, some of what I said is pretty tentative - I'm sorry if I jumped the gun. And some of my [provisional] conclusions are guided by what may be called \"quasi-scientific hunches\". I'll try to explain that bit as I go along.   \n   \n--   \n   \nMy intentions in this process are to arrive at guidelines for digital type designers wishing to make different cuts of a given design optimized for different sizes. So what I'm looking for is the set of deviations from some \"deliberative ideal\" that needs to be applied to a given size. The deviations are in width, color, letterspacing, vertical proportions and a bunch of other things. In my (still-ongoing) ATF Garamond analysis I'm measuring 10 parameters, but all in relation to the largest size I have at hand, the 48. This means that my values are scalar. Below is some of the data, for lc alphabet width:   \n   \n 6: 241   \n 7: 225   \n 8: 215   \n10: 196   \n12: 185   \n14: 177   \n18: 179   \n24: 173   \n30: 170   \n36: 168   \n48: 166   \n   \nAnd here's what it looks like:   \n   \n ![ATF-G_length.gif](http://web.archive.org/web/20150416140222im_/http:/www.typophile.com/forums/messages/4100/15332.gif)   \n   \nSome observations:   \n- There are two parts: 6-14, and 18-48.   \n- However, the 14 is suspicious (see below), so the cutoff might in fact be between 12/14 instead.   \n- The smaller-size section is not linear, it's curved. I'm not sure it's _quadratic_\\* as opposed to cubic or something else (and the data is probably too sparse and jumpy to ever know), but I gravitate to that because of three things: the next heuristically logical step after linear is quadratic; type is two-dimensional; and Luc[as] de Groot has found that weight gradation proceeds quadratically with respect to the horizontal scale.   \n- The larger-size section looks mostly linear.   \n   \n\\* I'm now using this instead of \"parabolic\".   \n   \nOne big caveat: unlike the Centaur and Falcon specimens, my ATF Garamond stuff is \"unofficial\": Mr Benton wasn't there to assure me that each size of what I used is the real stuff. Of the 11 sizes I used, two of them look suspicious: the 14, which is somewhat too narrow; and the 7, which is obviously too light. I'm tempted to pull those out of my study, but there are some good reasons not to, and instead just give this caveat as needed.   \n   \nThe other nine parameters I've studied even less, but the ones dealing with width seem to behave in exactly the same way as above, while:   \n- Vertical proportions also largely seem to follow the quadratic+linear combination.   \n- Weight seems to be one single quadratic curve.   \n- Stroke contrast looks... hard to describe right now.   \n   \nTo be fair, I guess if you applied this technique to Falcon you'd get the same non-linear behavior! And as you say, your Falcon data (which was indeed my source) only spans the text sizes.   \n   \nSo yes, it's too early to say with all confidence that ATF was better than Linotype at optical scaling. _On the other hand_, I've seen a body of anecdotal evidence (as well as just plain tangential observations) that seem to indicate that the Bentons were in fact on another level. I've revealed these to you in private recently, but if people here are interested I'll try to collect my thoughts enough for public delivery.   \n   \n--   \n   \nBTW:   \n\\> the face on the body in any given design is practically guaranteed to be linear by point size.   \n   \nI've found that this is not always the case.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Sep 2003 — 5:07pm",
      "content": "Hmm. I'd like to be able to follow you here, but you lost me with your data. Can you describe how you arrived at those numbers -- give them units or relate them to something known or measureable? I can't figure what those numbers represent, so I can't assess the curve.   \n   \nI think the Bentons were possibly on another level with regard to optical compensation. But it's hard to separate that aspect from the other aspects that differentiate foundry from linecasting.   \n   \n_\\>\\> the face on the body in any given design is practically guaranteed to be linear by point size.   \n   \n\\>I've found that this is not always the case._   \n      \n   \nWell, then we can measure this parameter too, if you think it's important.   \n   \nI derived some formulae from my graphs. The interesting thing is that the ATF Garamond is pretty linear from 6 to 14, but from 14 to 48 is not -- \\*unless\\* you take out the 14. From 18 to 48 is strictly linear.   \n   \nIn the following, y is lowercase alphabet length in points, x is nominal point size.   \n   \nATF Garamond, text sizes [6-14]: y = 7.6875 (x + 5.252)   \nATF Garamond, display sizes [18-48]: y = 9.5 (x + 2.2105)   \nFalcon, text sizes: y = 8.5 (x + 4.588)   \n   \nThese are descriptive rather than prescriptive, so I'm sure they won't help you. But they do describe linear relationships. It is interesting to see just how accurately the results for y conform to the data measured. ATF Garamond 8 point is the only real outlier.   \n   \nWhen I have a better idea what you're doing, I'll have a better idea how what I'm doing compares.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "3 Sep 2003 — 5:58pm",
      "content": "The way I got those numbers (which have no value on their own, just in relation to one-another) is that I measured in pixels from the 600 dpi scan, and then divided by point size. So what you get is a non-dimensional view, like in digital type design.   \n   \n\\> differentiate foundry from linecasting   \n   \nAre you saying that the Linotype had optical scaling limitations? I can see the Monotype with a problem like that (because of its unitization issue), but not the Lino.   \n   \n\\> we can measure this parameter too   \n   \nWhat I'm doing for the ATF Garamond is measuring the three lc zones separately, and I'll graph those stacked, to clearly show the changes in proportion. So you should be able to see if/how\\_much the size-on-body changes, as well as things like how the baseline moves.   \n   \n\\> These ... do describe linear relationships.   \n   \nIn fact the slopes (7.6875 and 9.5 versus 8.5) can be very useful.   \n   \nhhp\n\n"
    }
  ]
}
