{
  "id": "102218",
  "title": "P22, correct, but a slap in the face",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[http://www.p22.com/license.php?face=HWT%20New%20Release%20Special&mac=SP...](http://web.archive.org/web/20140730014659/http:/www.p22.com/license.php?face=HWT%20New%20Release%20Special&mac=SPECMONTHLYM&win=SPECMONTHLYW \"http://www.p22.com/license.php?face=HWT%20New%20Release%20Special&mac=SPECMONTHLYM&win=SPECMONTHLYW\")\n\nThis may be legally and morally correct, but I regard it as a slap in the face. \"We rule, you suck, don't like it, don't buy it.\" And I didn't.\n\n",
  "author": "Renaissance Man",
  "time": "11 Apr 2013 — 10:35am",
  "uid": "15371",
  "comments": [
    {
      "time": "11 Apr 2013 — 10:40am",
      "content": "Is there a part of it that you disagree with, or is it the whole idea of a EULA that ticks you off? They even allow modification (which is rare these days).\n\nhhp\n\n"
    },
    {
      "time": "11 Apr 2013 — 10:58am",
      "content": "I have no problem with EULAs. But whether we're talking about a font or a religion, anyone who slaps me the the face with legalisms before I even get in the front door, I find offensive.\n\n"
    },
    {
      "time": "11 Apr 2013 — 11:00am",
      "content": "So that page comes up before you have a chance to see the font, or before you can pay for it, or what?\n\nhhp\n\n"
    },
    {
      "time": "11 Apr 2013 — 11:15am",
      "content": "It comes up when you hit the \"Order\" button on a P22 product. Guess they had someone going: \"EULA? Wot EULA?\"\n\n"
    },
    {
      "time": "11 Apr 2013 — 11:27am",
      "content": "I think force-showing the EULA before a purchase is actually more honorable than not. Would you rather the legalese be hidden, like almost every other sales outfit?\n\nhhp\n\n"
    },
    {
      "time": "11 Apr 2013 — 11:36am",
      "content": "Possibly with a mind to protecting their customers from more of this:\n\n[http://blog.extensis.com/font-compliance/nbc-universals-wizarding-world-...](http://web.archive.org/web/20140730014659/http:/blog.extensis.com/font-compliance/nbc-universals-wizarding-world-of-harry-potter-and-p22-type-foundry-settle-lawsuit.php \"http://blog.extensis.com/font-compliance/nbc-universals-wizarding-world-of-harry-potter-and-p22-type-foundry-settle-lawsuit.php\")\n\n"
    },
    {
      "time": "11 Apr 2013 — 11:37am",
      "content": "This is the dumbest way of going about EULA.\n\nThose who care about following EULAs will search for it before purchasing. Those who don't, will just click through this page and get the fonts. There are also those who are oblivious to the existence of EULA, but showing them a wall of fine print is a sure way to force them to click through without reading. So, essentially, this page is useless, but it clearly rubs some people the wrong way.\n\nWhat would've worked better is a summary of EULA in few sentences of human speak + a link or an expandable page section with full EULA document.\n\n"
    },
    {
      "time": "11 Apr 2013 — 2:16pm",
      "content": "Karl: On the other hand there might be more money to be made by catching people messing up! :-) But like I said: honorable.\n\nAlex, I think there are large groups of people you're ignoring - like people who don't know what a EULA is... But I do agree that a \"human-readable\" version (which however can't be binding) is a good idea. This is a great model: [https://monokrom.no/page/about\\_us/licensing\\_terms](http://web.archive.org/web/20140730014659/https:/monokrom.no/page/about_us/licensing_terms \"https://monokrom.no/page/about\\_us/licensing\\_terms\")\n\nRelated: [http://typophile.com/node/100259](http://web.archive.org/web/20140730014659/http:/typophile.com/node/100259 \"http://typophile.com/node/100259\")\n\nhhp\n\n"
    },
    {
      "time": "11 Apr 2013 — 12:03pm",
      "content": "Presenting the EULA up front seems to me eminently sensible, and I don't see anything in asking people to acknowledge the terms of the license they are purchasing before they purchase it as 'a slap in the face'. This license is what you are choosing to purchase or not, so giving you an explicit choice regarding its terms is sensible, and should have been the norm for software licensing from the beginning.\n\n"
    },
    {
      "time": "11 Apr 2013 — 12:44pm",
      "content": "I want to graciously invite you into my home. On these conditions: You must first take off your shoes, and then promise to kiss my ass. Then we shall be equals. But I will not, under any circumstances kiss your ass. Welcome to my not so humble abode.\n\n_Err, never mind. I think I have another appointment._\n\nSelf-respect is the highest form of spirituality. —Frances Cress Welsing\n\n"
    },
    {
      "time": "11 Apr 2013 — 12:41pm",
      "content": "A business is not a home. Now, if you're running a whorehouse you can certainly have rules that customers have to follow, including in relation to posteriors.\n\nhhp\n\n"
    },
    {
      "time": "11 Apr 2013 — 4:50pm",
      "content": "This has nothing to do with inviting someone into your home, or with 'being equals'. This is a company offering to sell you something, and what they are offering to sell you is _that license_ to use their font software. That is what you are considering buying, so asking you to look at it and agree to its terms before you pay for it strikes me not only as sensible but what all software vendors should be doing. Isn't that better than the common model in which you pay for a software license but don't actually see and agree to the license until you go to install the software?\n\n"
    },
    {
      "time": "11 Apr 2013 — 5:36pm",
      "content": "I have known Richard Kegler for many years, he has handled my fonts with care and due diligence. His approach to showing the EULA up front is a credit to his business acumen... inform the buyer before he has a chance to screw up!\n\nI do not see your \"in your face\" inference at all. When all is said and done if you find \"getting all the details out of the way\" offensive then go some where else. Simple as it gets!\n\n"
    },
    {
      "time": "11 Apr 2013 — 5:55pm",
      "content": "I don't see anything wrong with that page ...at least it's not their front page / store front.\n\nn.\n\n"
    },
    {
      "time": "11 Apr 2013 — 5:59pm",
      "content": "My only problem is the type is too small. That could be my browser.\n\n"
    }
  ]
}
