{
  "id": "102273",
  "title": "Typesetting and Layout + Inferior text.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "Layout",
    "ordinals and scientific inferiors",
    "subscript",
    "text formatting."
  ],
  "content": "Hi Typophilers,\n\nI am keen to seek your feedback on the below problem.\n\nWhen setting text in a document and the sentence ends with a scientific inferior number (SINF) / Subscript (SUBS), or writing a list of items that contain SINF characters, is it better to write using general punctuation, or use the punctuation provided in SINF/SUBS lookup?\n\nI have provided a sample sentence in the image attached. The sentence at the top used general punctuation for all, whereas the lower uses all SINF/SUBS punctuation. Style Manauals do not provide advice on this particular topic, hence, my question.\n\nThanks in advance.\n\n| Attachment | Size |\n| --- | --- |\n| [SINF v Normal.png](http://web.archive.org/web/20130821160320/http:/typophile.com/files/SINF%20v%20Normal.png) | 14.15 KB |\n\n",
  "author": "peterfwyang",
  "time": "14 Apr 2013 — 6:35am",
  "uid": "163060",
  "comments": [
    {
      "time": "14 Apr 2013 — 8:10am",
      "content": "Just as you would set punctuation in roman following italic or bold (presuming the entire text or paragraph is not italic or bold), you should follow the same practice here. Unless the punctuation is actually part of the special notation itself, use normal punctuation.\n\n"
    },
    {
      "time": "14 Apr 2013 — 4:43pm",
      "content": "Agreed.\n\n"
    },
    {
      "time": "14 Apr 2013 — 7:19pm",
      "content": "Yep, normal punctuation.\n\n"
    },
    {
      "time": "15 Apr 2013 — 1:02am",
      "content": "Actually, for italics it’s often better to do the opposite. Primarily for spacing purposes. For your example, normal punctuation is better.\n\n"
    },
    {
      "time": "15 Apr 2013 — 2:02am",
      "content": "To David, Joshua, James and Frode,\n\nThank you for your feedback. Good to see that there is consensus. Your contributions are much appreciated.\n\nPete\n\n"
    },
    {
      "time": "15 Apr 2013 — 6:02am",
      "content": "Frode is incorrect about italics except for _bangs!_ which indeed should be italicized. [(Be careful of <cite>!”</cite> and <cite>!)</cite> and <cite>!”)</cite> sequences.] If you typeset, for example, a film title inside parentheses, the parens are not italicized: (<cite>Iron Man 3</cite>) not <cite>(Iron Man 3)</cite>.\n\nView italics, bold, subscripts, and the like as strictly delimited attributes, not something so contagious they infect whatever surrounds them.\n\n"
    },
    {
      "time": "15 Apr 2013 — 11:08am",
      "content": "But avoiding ungainly -hence often distracting- proximities (especially collisions\\*) is generally more important than tickling the fancy of grammarians.\n\n\\* Remember that there's no kerning between fonts.\n\nhhp\n\n"
    },
    {
      "time": "15 Apr 2013 — 11:30am",
      "content": "Great question/answers. Mental note.\n\n"
    },
    {
      "time": "15 Apr 2013 — 11:59am",
      "content": "Some of the better of the perennial threads on similar topics:  \n [http://typophile.com/node/45276](http://web.archive.org/web/20130821160320/http:/typophile.com/node/45276 \"http://typophile.com/node/45276\")  \n [http://www.typophile.com/node/97410](http://web.archive.org/web/20130821160320/http:/www.typophile.com/node/97410 \"http://www.typophile.com/node/97410\")\n\n"
    },
    {
      "time": "15 Apr 2013 — 12:30pm",
      "content": "On a professional job with a copy editor, it's not \"ticking their fancy\", it's the editor's job to specify the proper style in those matters.\n\nIf bad spacing resulted in a prominent place like a headline, I'd discuss it with the editor and see if they're willing to bend a little or if they could reword it to avoid the problem. If it happened in text and looked bad enough that I noticed, I'd probably just manually adjust the kerning.\n\n"
    },
    {
      "time": "15 Apr 2013 — 12:44pm",
      "content": "Indeed, editors aren't useless. But the best ones realize that rules are always a means and never the objective. The best ones realize that the end-result shapes are what count (since humans won't grind to a halt due to a \"parsing error\").\n\n> I'd discuss it with the editor\n\nWhy waste so much time? And is having to change the text just to not break a short-sighted rule a good compromise?\n\n> I'd probably just manually adjust the kerning.\n\nTry that with an \"f)\" where the first is Italic and the second Roman, and avoiding a collision = huge gap at the bottom.\n\nhhp\n\n"
    },
    {
      "time": "15 Apr 2013 — 1:52pm",
      "content": "\\> Why waste so much time?\n\nBecause I don't want to anger the copy editor by ignoring their instructions. Far better to explain why you want to change it. If you've got a good relationship with them they're often willing to help fix the problem.\n\n\\> Try that with an \"f)\"\n\nYes, I agree there are tough combinations. If I couldn't fix it with kerning, I'd talk to the editor.\n\nCan't say that this issue has been a big problem in my work, though. Usually when I have a problem with the copy its due to its length.\n\n"
    },
    {
      "time": "15 Apr 2013 — 1:53pm",
      "content": "Just italicize the parens dude.\n\nhhp\n\n"
    },
    {
      "time": "15 Apr 2013 — 6:33pm",
      "content": "from another recent hhp post:\n\n> Since I don't use fonts much ...\n\nAh. Probably the notation P.E is unknown to him. You set the paren following the f (or l, or d, or whatever) in the font the customer requires (i.e., the publisher, whose house style is established by editors). Whining that \"hhp told me otherwise\" gets you a repeat P.E., and a lost customer, if customers come from those who <cite>use</cite> type. But really, you're only suppose to hang type on museum walls, right?\n\nAnother hhp quote from this thread:\n\n> Remember that there's no kerning between fonts.\n\nTrue indeed. That's why writing a script in the layout program that puts in a kern saves handwork. Otherwise, you perform the necessary handwork. For the fun of it, consider the other choice, making the following punctuation italic.\n\nFrom altomuch <cite>[sic]</cite> lots...\n\nNow the italic letter doesn't collide with the bracket (or if it does, you can kern it); instead, the following word space tends to disappear, depending of course on the font, the wordspace assignments, and justification settings used. Even if the space doesn't optically disappear (which gets another P.E.), you get the \"use even space\" mark from the proofreader. Editors care about results, not excuses. To say \"but really, there **is** a space there gets you the 1,000 yard stare.\n\nThe really good type designers I know, while they may not know all that much about using type, always seem to listen to those who do. Some even get their work in museums, MacArthur grants, etc...\n\nTo the Original Poster: for a sentence-ending period following scientific notation -- or any superiors/subscripts, for that matter, every style I know requires the regular period. You may have to kern it some to keep the meaning clear.\n\n"
    },
    {
      "time": "15 Apr 2013 — 9:59pm",
      "content": "Type designers, being makers of tools as opposed to makers of end-products should listen to all feedback avidly - but all of it does need to be filtered. Feedback from other type designers must be filtered for ideology; for example if you don't believe in chirography you should ignore a chirographic type designer telling you that your stroke weights are \"wrong\" - but that person can still give you good advice on other aspects (for example telling you that the join of your binocular \"g\" is cramped). Feedback from type _users_ must be filtered for a weak grasp of readability; most typographers developed a hermetic microcosm of rules -and a limited set of favorite fonts- that help them get the job done, \"compartmentalizing\" the complexities of reading.\n\nEditors who don't understand that abutting Italic and Roman can _sometimes_ cause serious trouble will never produce the best work. Asking for a rewrite is inefficient and disrespectful of the author. Hey, I might actually pretend to agree with an editor to live to fight another day, but I will not respect him, and his results will be inferior.\n\n> depending of course on the font\n\nBingo. Maybe you shouldn't use so many free/libre fonts. Oh wait, you're the guy who says he blindly dumps all the kerning in any font that's not by Carter... You're also the guy who wants people to believe that type designers are useless because you can do anything you ever need to type in InDesign. Nevermind this: [http://typophile.com/node/99141](http://web.archive.org/web/20130821160320/http:/typophile.com/node/99141 \"http://typophile.com/node/99141\")\n\nBTW, no matter how many times I've agreed with you that type isn't meant for museums, you just can't help propping me up as a straw man and flinging that at me. I guess you think it's a defense against me exposing your mistakes.\n\nObserve this condescending, smug, and utterly wrong analysis:  \n [http://typophile.com/node/100581#comment-543757](http://web.archive.org/web/20130821160320/http:/typophile.com/node/100581#comment-543757 \"http://typophile.com/node/100581#comment-543757\")  \nYou see a young, unknown-to-you type designer, and you're so eager to strike him down you can't even be bothered to look at the text cut instead of the display cut when judging it for text... And you won't even admit you made a mistake. And you speak of _listening_ to people? BTW did you end up buying Harriet as you said you would? And FYI, I've saved that thread, and this one.\n\nDon't trust anybody in a trench deeper than his height.  \nAnd don't trust anybody run by his emotions:  \n [http://typophile.com/node/100311#comment-542002](http://web.archive.org/web/20130821160320/http:/typophile.com/node/100311#comment-542002 \"http://typophile.com/node/100311#comment-542002\")  \nI know flaming artistes who can handle criticism better.\n\nBTW Charles, what's your connection to Donald Dickson?\n\nhhp\n\n"
    },
    {
      "time": "16 Apr 2013 — 9:40am",
      "content": "@charles ellertson: What does “P.E.” mean?\n\n"
    },
    {
      "time": "16 Apr 2013 — 9:51am",
      "content": "[Printer's (i.e. typesetter's) Error](http://web.archive.org/web/20130821160320/http:/www.wiley.com/WileyCDA/Section/id-302991.html).\n\n"
    },
    {
      "time": "16 Apr 2013 — 10:14am",
      "content": "P.E. used to be a common proofreading notation. It told the printer/typesetter \"don't charge me for this change, it's to correct your error\".\n\n"
    },
    {
      "time": "16 Apr 2013 — 10:19am",
      "content": "So it's no longer used? Figures.\n\nhhp\n\n"
    },
    {
      "time": "16 Apr 2013 — 10:46am",
      "content": "Since designers generally do their own typesetting these days, there's less reason to mark P.E. since you're not going to get a typesetter's bill.\n\nBut some clients may use it occasionally. A few years ago I had a client who had a 200 page job that went through 4 rounds of revisions, and she wanted to go through every page and add up which changes were her fault and which were mine. Fortunately I convinced her to use a ballpark estimate instead.\n\n"
    },
    {
      "time": "16 Apr 2013 — 11:08am",
      "content": "> Since designers generally do their own typesetting these days, there's less reason to mark P.E. since you're not going to get a typesetter's bill.\n\nActually, while a lot of designers do set the text these days, they tend to be freelance designers. They do this because setting the type gets them more money than the design work, even if they do both the covers and the text interior. And of course, they send a bill to the publisher...\n\nDesigners at larger presses often don't set the type. The time they would spend setting the text is effectively lost for design work. What with Asian typesetters thrown into the mix, it's a real hodge podge.\n\nIn case you're wondering about alterations:\n\nThe fewest you typically see in an academic book is about 100 in first proof. Average is about 250, and I've worked on books where there are more than 1,500. Cost usually runs from $0.75 to $1.25 each. What we do at our shop is to charge hourly if the number of alterations, billed singly, would be higher than our standard hourly charge. Not everyone follows this practice, though.\n\nBack in the days when typesetting was always started by keyboarding from copy, I knew of shops who would bill for every alteration on a page, even if than wound up being more than the page rate for setting from copy. We always limited the amount to what it would cost to set the page from scratch.\n\nMany publishers give the author an allowance. Anything over 100 changes, the author pays for. Or, the editor may disallow some of the author's alterations if they feel it doesn't significantly change the work.\n\nSorting the alterations charges is usually broken down into three or four categories (1) AAs (author's alterations), (2) EAs (editor's alterations), (3) DA or BK (designer's alterations), and (4) PEs (printers errors). (Note that only they typesetter can make an \"error.\") The publisher pays for the first three kinds, the typesetter absorbs the cost of fixing their errors.\n\n"
    },
    {
      "time": "16 Apr 2013 — 12:04pm",
      "content": "It's remarkable just how few designers today -- type designers or graphic designs -- know about professional typesetting or have experience of it. Unless you've actually done the typesetting of at least one decent size and reasonably complex publication, I wonder if you are qualified to be a type designer? I fully understand that a type designer might not make a good graphic designer, in terms of producing inventive and striking layouts, but anyone designing text type should have experience as a typesetter, and should be good at it.\n\n"
    },
    {
      "time": "16 Apr 2013 — 12:13pm",
      "content": "It's definitely helpful, but it can be substituted by paying attention to typesetters (sort of how you can make a typeface in a writing system you don't know, but it's very helpful to get native feedback). And for a typesetter it's helpful to know what role type designers play in a quality end-product (and why for example good type designers don't make more weights by using automatic algorithms on the Regular).\n\nhhp\n\n"
    },
    {
      "time": "16 Apr 2013 — 1:59pm",
      "content": "I'm glad that the advice was consistent, and correct: the commas should be normal, as they're not part of the subscript, but instead are part of the primary sentence thread.\n\n"
    },
    {
      "time": "16 Apr 2013 — 3:15pm",
      "content": "\\> while a lot of designers do set the text these days,  \n\\> they tend to be freelance designers.\n\nMost design firms I know do their typesetting in-house for most jobs, although it may be a production person rather than a designer. But I'm talking mostly about brochures, mailers, posters and other routine design jobs, not book publishing, which is something most designers normally don't get involved in, it's more of a specialty.\n\n\\> It's remarkable just how few designers today...  \n\\> know about professional typesetting or have experience of it.\n\nAgree completely.\n\n"
    },
    {
      "time": "16 Apr 2013 — 6:59pm",
      "content": "> I fully understand that a type designer might not make a good graphic designer, in terms of producing inventive and striking layouts ...\n\nMaybe for advertising or small, intricate pieces, but the really good type designers I know have an sense of space, and that can be used for striking layouts, at least in bookwork (which includes part pages, title pages, even complex chapter openings).\n\nI think designers setting type is more a matter of patience with small details. There are a couple Royal Designers for Industy I know who are polar on this. Richard Eckersley had infinite patience, and would change the measure on a single page if it gave him better line breaks. A change of 3 points with a 22-pica measure just won't show, but might give different line breaks, or even make/save a line for banishing orphans or widows. It would take Richard several weeks to set a book, working late into the night. But he'd do it.\n\nGeorge Mackie, on the other hand, would specify a book by saying \"set it in 10/13 Baskerville, 25 pica measure, 39 lines per page.\" The comp was suppose to be good enough to get the rest of the details -- extracts, epigraphs, maybe subheads, etc. It wasn't that George wouldn't pay attention to the proofs, and you'd better do a good job or he'd catch it & bring you up short. But he didn't expect to have to pay attention to what was another person's job.\n\nAnyway, personally, I'm very limited in what I can be effective with in in terms of book design. I have to rely almost completely on space for dramatic tension & release. But when that fits a particular text, people seem to like it.\n\nI'd think type designers would be superb at this kind of text design, and even the setting, if they have the needed patience...\n\n"
    }
  ]
}
