{
  "id": "10223",
  "title": "(x) Type terminology question - flourishes, ornaments {Mark S}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "WELL,opps....ok well I'm new to Typophile. Now that that is over I want to know what the little decorative swirls and floral that are put around letters. I couldnt figure out how to post a picture so I hope everyone understands what I mean. Are they a form of font. Theyre usually on or around elegant words. If anyone gets what I'm talking about, could you help me, I just have a great interest in learning how to do them well.\n\n",
  "author": "muffinmanbrander",
  "time": "10 Apr 2005 — 3:44pm",
  "uid": "6376",
  "comments": [
    {
      "time": "10 Apr 2005 — 4:29pm",
      "content": "Daliance by Emigre is a good font to look at. Lots of font enhancements\n\n"
    },
    {
      "time": "10 Apr 2005 — 5:18pm",
      "content": "Flourishes? Swashes? Engrossing?\n\n"
    },
    {
      "time": "11 Apr 2005 — 12:07pm",
      "content": "Flourishes maybe, swashes no, engrossing no. Ok not the stuff that attaches to the type but the decorations around it. ![sorta like this](http://web.archive.org/web/20131023145434im_/http:/www.typophile.com/forums/messages/83/69441.jpg) i just did an ugly quick one, Stuff like that ^^^^.\n\n"
    },
    {
      "time": "11 Apr 2005 — 1:33pm",
      "content": "Ornament? Ornamentation? Filigree?   \n   \n(I'm putting question marks after all my suggestions because I'm not exactly sure what the proper name for this is, whether there is one, or if I understand precisely what you are referring to. Still, one of them might fit.)\n\n"
    },
    {
      "time": "11 Apr 2005 — 8:05pm",
      "content": "I apologize, I'm searching each example, thanks for everyhting.\n\n"
    },
    {
      "time": "12 Apr 2005 — 3:34am",
      "content": "Fleuron would answer some of the question   \n [http://www.myfonts.com/search?search%5Btext%5D=fleurons](http://web.archive.org/web/20131023145434/http:/www.myfonts.com/search?search%5Btext%5D=fleurons), generally I would refer to these marks as ornaments.   \nTim\n\n"
    }
  ]
}
