{
  "id": "102209",
  "title": "Student Licensing from Linotype",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello I'm new to the forum, long time reader, first time poster.  \nI'm a Graphic Design student producing a publication about The Shining, in relation to Sigmund Freud's seminal paper The Uncanny, as my end of degree project. I've thought long and hard about what typefaces are most appropriate to produce the book and concluded that Futura [Kubrick's favourite font] and Perpetua [designed the year he was born] would work really well for this project. Obviously I want to utilise Perpetua's wonderful open type features, discretionary ligatures, small caps etc but I'm finding the family package price range a little out of my budget. Can anybody here please tell me if Linotype offers a student licensing discount?  \nThanks in advance, all the best  \nMatt\n\n",
  "author": "MDWoodman",
  "time": "11 Apr 2013 — 6:44am",
  "uid": "210597",
  "comments": [
    {
      "time": "11 Apr 2013 — 7:31am",
      "content": "If you cannot buy the font package at a discount through your educational institution student store, then a student licensing discount probably is not available.\n\n"
    },
    {
      "time": "11 Apr 2013 — 9:17am",
      "content": "Before you decide whether you can or can't afford something, make sure it's a good choice. The director's favorite font isn't necessarily a good choice (like to me Futura isn't) and certainly the coincidence of a birth year seems like a total gimmick. Note that Perpetua was very aptly used for the most recent royal British wedding...\n\nhhp\n\n"
    },
    {
      "time": "11 Apr 2013 — 9:37am",
      "content": "In the case of Perpetua, I’d ask Monotype’s British office because that’s the foundry where Perpetua actually comes from. I’ve had several students who wanted to have certain typeface families for their student projects. In most (if not all) cases they got a kind of student license from the foundry. Some of the foundries wanted to see something of the project in advance. Others came up with a licence agreement which allowed the student to use the typeface for the time they were a student only.\n\n"
    },
    {
      "time": "11 Apr 2013 — 10:04am",
      "content": "Futura is definitely the typeface most associated with Kubrick; he used it in several movies.\n\nI read once that he started using it with 2001: A Space Odyssey because it resembled fonts often used by NASA, and liked it so well that he stuck with it.\n\n"
    },
    {
      "time": "11 Apr 2013 — 10:11am",
      "content": "I guess one needs to figure out whether the typography is supposed to evoke the topic, or the movie director. Futura is about control. Does it fit the former? Kubrick seems to have made sense with 2001, but maybe he gave that initial success too much credit. Above all else, let's not be a Vignelli. :-)\n\nhhp\n\n"
    },
    {
      "time": "11 Apr 2013 — 11:34am",
      "content": "Design\n\nThroughout our creative lives we [Lella, my wife and professional partner, and I] have sifted through everything to select what we thought best. We sifted through materials to find those for which we have the closest affinity. We sifted through colors, textures, typefaces, images, and gradually we built a vocabulary of materials and experiences that enable us to express our solutions to given problems—our interpretations of reality.\n\nIt is imperative to develop your own vocabulary of your own language—a language that attempts to be as objective as possible, knowing very well that even objectivity is subjective.\n\nI love systems and despise happenstance.\n\nI love ambiguity because, for me, ambiguity means plurality of meanings. I love contradiction because it keeps things moving, preventing them from assuming a frozen meaning, or becoming a monument to immobility.\n\nAs much as I love things in flux, I love them within a frame of reference—a consistent reassurance that at least and at last I am the one responsible for every detail.\n\nAnd that is why I love Design.\n\nMassimo Vignelli, “Conclusion,” The Vignelli Canon  \n [www.vignelli.com/canon.pdf](http://web.archive.org/web/20130821154355/http:/www.vignelli.com/canon.pdf \"www.vignelli.com/canon.pdf\")\n\n"
    },
    {
      "time": "11 Apr 2013 — 11:47am",
      "content": "Building a vocabulary is great. But subverting the world to a personal vocabulary is anti-Design. Vignelli is worse than the worst font pirate; at least the latter cares enough about fonts to steal them.\n\nSee: [http://typophile.com/node/19950](http://web.archive.org/web/20130821154355/http:/typophile.com/node/19950 \"http://typophile.com/node/19950\")\n\nhhp\n\n"
    },
    {
      "time": "11 Apr 2013 — 1:29pm",
      "content": "@MDWoodman: +49 (0) 6172 484-418\n\nThat should get you to a real person in legal/licensing.\n\nAsk if they have student licensing options.\n\n"
    },
    {
      "time": "11 Apr 2013 — 2:00pm",
      "content": "Thanks so much for all the input everyone.  \nSpecial thanks to Chris Dean for the contact information I will get on that first thing tmrw!\n\n@hrant The theme of Freud's 'The Uncanny' places a lot of emphasis on mirror images, symmetry and body doubles, as far as my limited knowledge goes I had a good think about how I could make fonts relate to both the subject matter of Stanley Kubrick and his films and also Freud's essay. I chose Futura because not only is it Kubrick's favourite font but it also has a lot of symmetry in the letterforms. I was reluctant to say because I'm sure someone's going to tear me a new one for stating that my tutors have encouraged me to pick recognisable 'common' fonts and distort them slightly in fontographer to create and Uncanny effect (ie recognisable but something is not quite right). As far as Perpetua goes, (I've always been slightly entertained by the story of Eric Gill's debauchery) but the addition that the typeface was designed in the year of Stanley Kubrick's birth was a coincidence I was rather proud of stumbling across. I must say part of what influenced my decision also was meeting the RCA grads Murray & Sorrell of Fuel design and seeing how they had put Purpetua to use for their work on the Chapman Bros publication Bedtime Tales for Sleepless Nights. In my own opinion theres a sorted of a twisted logic to the use there and it always stuck in my mind as looking fantastic in that book: [http://fuel-design.com/media/uploads/thumbs/uploads/homepage/10-11\\_jpg\\_4...](http://web.archive.org/web/20130821154355/http:/fuel-design.com/media/uploads/thumbs/uploads/homepage/10-11_jpg_460x306_q95.jpg \"http://fuel-design.com/media/uploads/thumbs/uploads/homepage/10-11\\_jpg\\_460x306\\_q95.jpg\")\n\nHaving said all this, I do of course value the opinions of everybody here so if you have any other suggestions I am very open to hearing them at this stage!\n\nAlso I agree with this \"I love systems and despise happenstance.\" Hence my choices, I always make an effort to make as many connections as I can when choosing typefaces :)\n\n"
    },
    {
      "time": "11 Apr 2013 — 6:54pm",
      "content": "I don't think any Kubrick film has generated as many theories about hidden meanings as The Shining did.\n\nMost of them, in my opinion, are rather wacky, and in some cases try to draw meaning from continuity bloopers and other normal oddities of filmmaking (like interiors not matching exteriors), but they are interesting none the less.\n\nMatt, you've probably seen this already, but there's an interesting video shot by Kubrick's daughter about the making of the movie. I think it's also available on YouTube.  \n [http://www.slashfilm.com/votd-the-making-of-the-shining/](http://web.archive.org/web/20130821154355/http:/www.slashfilm.com/votd-the-making-of-the-shining/ \"http://www.slashfilm.com/votd-the-making-of-the-shining/\")\n\n ![](http://web.archive.org/web/20130821154355im_/http:/typophile.com/files/shining_6149.png)\n\n"
    },
    {
      "time": "12 Apr 2013 — 4:42am",
      "content": "@JamesM yes I imported a US version of the film and ripped it from the disc (in the process I had to change the region of my mac optical drive, which you can only do 5 times) because little did I know that the version of the film shown here in the UK is actually 22 minutes shorter than the full American cut. In fact until Halloween last year the US version had only been shown in the UK once, inadvertantly by ITV. The documentary came as an extra on the disc but thanks for the heads up :)\n\n"
    },
    {
      "time": "12 Apr 2013 — 9:05am",
      "content": "I've never seen the shorter version, but I've read that Kubrick tightened up the film after its initial release in the U.S. and considered the shorter version to be better.\n\nHe did something similar with 2001, making it shorter after seeing audience reaction to the first few showings, but I don't think the original, longer version of 2001 is available anywhere.\n\n"
    }
  ]
}
