{
  "id": "102394",
  "title": "Two space, or not two space?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A little something I wrote and posted for a colleague. I can’t seem to open comments on my website and prevent span the way Jared does, so I thought I’d share it here as well. If you have any additional references, feel free to add to the list.\n\n————\n\nMost likely in response to yet another client insisting on riddling their pages with holes created by double spaces after their periods, a colleague asked me for advice. In an effort to provide her with some ammunition to help bring down offending parties, I composed for her the following:\n\n**Question** :  \n“_Is there some definitive statement that I can quote these days about NOT putting two spaces after each period in a paragraph? At first I thought it was just those who grew up with typewriters without proportional lettering that had merely developed a habit, but I see it in some things and I would just like to know if there is any basis for routinely hitting the spacebar twice anymore?_”\n\n**Response(s)**:  \n“After the period at the end of a sentence or abbreviation, the space should be the normal one used between the words of the line. Only in widely spaced lines is it permitted to leave a larger gap, and in this case, commas and hyphens should be treated the same way (Tschishold, 1937, pp 95–96).”\n\n_and…_\n\n“In the nineteenth century, which was a dark and inflationary age in typography and type design, many compositors were encouraged to stuff extra space between sentences. Generations of twentieth-century typists were then taught to do the same, by hitting the spacebar twice after every period. Your typing as well an your typesetting will benefit from unlearning this quaint Victorian habit. As a general rule, no more than a single space is required after a period, a colon or any other punctuation. Larger spaces (e.g., en spaces) are themselves punctuation (Bringhurst, 2004, pp 29–30).”\n\n_and…_\n\n“Words should also be kept at a safe, regular distance from eachother, so that you can rely on the next one to appear when you’re ready for it (Spiekermann, 1993, p. 123).”\n\n_and…_\n\n“One rule to remember about line space is that it needs to be larger than the space between words, otherwise your eye would be inclined to travel from the word on the first line directly to the word on the line belowWhen the space is correct your eye will first make the journey along one line before it continues on to the next (Spiekermann, 1993, p. 125),”\n\n_and…_\n\n“The perceptive senses take in shapes which are related together by proximity and contour. We are taught to read our code system horizontally from left to right and it is primarily this ‘conditioning’ that enables the eye to follow badly spaced copy where the interlinear space appears less than that between words. The horizontal left to right movement can clearly be differentiated from the vertical downward movement by keeping the word space to a minimum (Swann, 1969, p. 41).”\n\n_and…_\n\n“The opening out of lines to create a clear difference between the interlinear gap and the word-spacing is common practice when ease of reading is requited. In this way, the danger of optical bridging between lines is reduced (Hartley, 1978, p. 22).”\n\n_and…_\n\n“The typewriter tradition of separating sentences with two word spaces after a period has no place in typesetting. The custom began with the characters of monospaced typefaces used on typewriters were so wide and so open that a single word space—one the same width as a character, including the period—was not wide enough to create a sufficient space between the sentences. Proportionately spaced fonts, though, contain word spaces specifically designed to play the sentence-separating role perfectly. Because of this, a double word space at the end of creates an obvious hole in the line (Felici, 2003, p. 80).”\n\n_and finally…_\n\n“What? you say! Yes—for years you’ve been told to hit two spaces after periods, and on a typewriter, you should. But this is not a typewriter.\n\nOn a typewriter, all the characters are monospaced; that is, they each take up the same amount of space—the letter [i] takes up as much space as the letter [m]. Because they are monospaced, you need to type two spaces after periods to separate one sentence from the next. But…\n\nOn a Macintosh, (unless you”re using the fonts Monaco or Courier, which are monospaced just like a typewriter and what you would want to use anyway) the characters are proportional; that is, they each take up a proportional amount of space—the letter [i] takes up about one fifth the space as the letter [m]. So you no longer need extra spaces to separate the sentences (Williams, 1990, p. 13),”\n\n**Final answer** :  \nUnless you are using a monospaced typeface such as Courier, do _ **not** _ use two spaces after a period! If the that’s is not enough to muscle a client into submission, lay down your arms and surrender. That, or you could [call in the big guns](http://web.archive.org/web/20150415105823/https:/www.youtube.com/watch?v=Flt9K8vlJGE). At the end of the day, sh\\*tty type costs them the same as good type.\n\n**References** :  \nBringhurst, R. (2004). _The elements of typographic style_. Hartley & Marks Publishers Inc, Washington, United States.\n\nFelici, J. (2003). _The complete manual of typography_. Peachpit Press, California, United States.\n\nHartley, J. (1994). _Designing instructional text_. Kogan Page, London, England.\n\nSpiekermann, E. & Ginger, E. (1993). _Stop stealing sheep and find out how type works_. Adobe Press, California, United States.\n\nSwann, C. (1969). _Techniques of typography_. Watson-Guptill Publications, New York, United States.\n\nTschichold, J. (1937). House rules for typesetting: the Publisher’s standard instructions for the typesetter (as cited by Tschichold, J. 1975/1991). _The form of the book. Essays on the morality of good design_. Hartley & Marks Publishers Inc. Washington, United States.\n\nWilliams, R. (1990). _The Mac is not a typewriter_. Peachpit Press, California, United States.\n\n————\n\nOriginally posted at [http://readthetype.com/twospace/](http://web.archive.org/web/20150415105823/http:/readthetype.com/twospace/ \"http://readthetype.com/twospace/\") (2013).\n\n",
  "author": "Chris Dean",
  "time": "18 Apr 2013 — 1:45pm",
  "uid": "/web/20150415105823/http://typophile.com/readthetype",
  "comments": [
    {
      "time": "18 Apr 2013 — 2:52pm",
      "content": "Donald Knuth's TeX considers the space after a period more \"stretchable\" than regular inter-word spaces, something like by a third more or so. I used to have a copy of \"The TeXbook\" (Reading, Massachusetts: Addison-Wesley, 1984) on my desk for years on end but now I appear to have misplaced it! Will go a-browsing, given time, so I can look up the exact quote.\n\nSince it's an automatism of TeX, the writer has to apply tricks to _defeat_ this behaviour whenever unwanted; i.e. when dealing with abbrev. and initials. Typing two spaces is neither en- nor dis-couraged when using TeX. No matter what your personal preference is, it simply discards extra spaces in the input.\n\n"
    },
    {
      "time": "18 Apr 2013 — 4:44pm",
      "content": "In TeX, `space-factor` is governed by `\\sfcode` tables. (Chapter 12 of TeXBook.) The code of a character sets the target value for the current `space-factor` (with a few ramifications on how the target is translated to an actual value). The current `space-factor` can also be set by `\\spacefactor=NUM`.\n\nIn Plain TeX, `\\sfcode`.=3000`, so the extendability of space is tripled after a dot, the shrinkability is decreased 3×, and “an extra space” is inserted (since `space-factor≥2000`). (In `cmr10` the normal space is 3⅓pt, and the extra space is 1⅑pt.)\n\nBTW, IMO, the quoted by Chris rules on the width of spaces make absolutely no sense. Unless they are designed for reading texts which you do not care about reading. These rules make sense only if reading is a linear process, when it is enough to note ends-of-sentences “as they appear”. Most of the time, my reading is non-linear. I go back to find a stuff which I discover I missed/misunderstood — or the text I had deliberately skipped, and now time has come to read it. And with non-linear reading, I must find start-re-parsing points quickly.\n\nMaybe it is my vision, but for me having dot+normal\\_space is not enough help to quickly identify beginnings of sentences. With text typeset with (La)TeX, reading is _significantly_ easier.\n\n"
    },
    {
      "time": "18 Apr 2013 — 5:19pm",
      "content": "@ilyaz: Not sure I follow. Perhaps you can help clarify. Theunis de Jong writes “_No matter what your personal preference is, it simply discards extra spaces in the input_.”\n\nI interpret this as TeX removing double spaces by default.\n\nYou then write “_With text typeset with (La)TeX, reading is significantly easier._”\n\nI interpret this as (La)TeX using a double space (or more than a single space) after a period by default.\n\nBefore we continue, are you using the terms (La)TeX and TeX interchangeably?\n\nRegarding your previous statement, do you in fact mean “_I find locating the beginning of a sentence_ significantly _easier when there are two spaces following a period compared to one_.” ?\n\nI was also reading a bit about your background. Do you still teach mathematics, and are you still an active software programmer? I am particularly interested in your frequency of exposure to coding and programming, which to the best of my knowledge, is done on terminals using monospaced fonts. _ **If** _ you spend significantly more time coding than the lay-person (or lay-programmer for that matter), _ **and** _ you work with monospaced fonts, _ **perhaps** _ this supports your preference for double spaces?\n\n"
    },
    {
      "time": "18 Apr 2013 — 6:33pm",
      "content": "TeX and LaTeX base the extra space to be put after the period on the parameter \\fontdimen7 which is in the font. This behaviour is disabled after the command `\\frenchspacing`. For instance, I installed Arno Pro to use with LaTeX and here is what is to be found in the tfm file of the regular:\n\n    (FAMILY TEX-ARNOPRO-REGULAR)\n    [...]\n    (FONTDIMEN\n       (SLANT R 0.0)\n       (SPACE R 0.19)\n       (STRETCH R 0.095)\n       (SHRINK R 0.0633335)\n       (XHEIGHT R 0.398)\n       (QUAD R 1.0)\n       (EXTRASPACE R 0.031667)\n       )\n\nNow here is a LaTeX input file, to test\n\n    \\documentclass[10pt]{article}\n    \\usepackage{arno}\n    \\setlength\\parindent{0pt}\n    \\newlength{\\myl}\n    \\newcommand\\dispwidth[1]{#1\\quad\\settowidth{\\myl}{#1}\\the\\myl}\n    \\begin{document}\n    \n    space = \\the\\fontdimen2\\font\\\\\n    stretch = \\the\\fontdimen3\\font\\\\\n    shrink = \\the\\fontdimen4\\font\\\\\n    extraspace = \\the\\fontdimen7\\font\\\\\n    \n    \\dispwidth{A word. Two words. And then more just to see.}\\\\\n    \\frenchspacing\n    \\dispwidth{A word. Two words. And then more just to see.}\n    \\end{document}\n\nAnd here is a grab of the output:\n\n ![](http://web.archive.org/web/20150415105823im_/http:/typophile.com/files/spacingArno10pt_4439.png)\n  \nThe first line uses the \"English spacing\" with the extra spacing. The second line uses no extra spacing. The difference in length is equal to twice the displayed value of extraspace. I would not call that double spacing.\n\nThe stretch parameters are used for justification. Here, there was none.\n\n"
    },
    {
      "time": "18 Apr 2013 — 6:42pm",
      "content": "@Michel Boyer: For the thread and future participants, can you clarify the terms TeX, and LaTeX? Wikipedia does a poor job distinguishing the two for the lay-person (non-coder).\n\n"
    },
    {
      "time": "18 Apr 2013 — 6:55pm",
      "content": "My understanding is that (La)TeX was used as a regular expression to write both LaTeX and TeX in a single expression.\n\nLaTeX and TeX both come with texlive. It is possible (but not recommended) to write TeX macros in LaTeX files (LaTeX has its own syntax for macros).\n\n"
    },
    {
      "time": "18 Apr 2013 — 6:55pm",
      "content": "Whoops! It would appear as though I was editing a post while you were responding. I understand (La)Tex now, that makes good sense. However, I’m still not clear on the relationship between TeX and LaTeX.\n\nWikipedia defines TeX as “_…a typesetting system designed and mostly written by Donald Knuth and released in 1978_.”\n\nAnd LaTeX as “…_a document markup language and document preparation system for the TeX typesetting program_.”\n\nIf I were to throw out an analogy, I would say that TeX is InDesign, and LaTeX is a style sleet? Am I close?\n\n"
    },
    {
      "time": "18 Apr 2013 — 6:58pm",
      "content": "And [TeX Live](http://web.archive.org/web/20150415105823/http:/www.tug.org/texlive/) is a bundle?\n\n"
    },
    {
      "time": "18 Apr 2013 — 7:12pm",
      "content": "Never noted that \"reply\" link....\n\nLaTeX is much more sophisticated that just a style sheet. As for texlive, it is many text formatting programs, including XeTeX, XeLaTeX, LuaTeX and LuaLaTeX.\n\n"
    },
    {
      "time": "18 Apr 2013 — 7:15pm",
      "content": "I don’t think the “Reply” link works.\n\nCan you perhaps provide an alternative analogy for the TeX/LaTeX relationship?\n\n"
    },
    {
      "time": "18 Apr 2013 — 7:24pm",
      "content": "On my mac, the command `which latex` gives `/usr/texbin/latex` as its location. If I go in the directory `/usr/texbin` and type the command `ls -l latex` I get as answer:\n\n    lrwxr-xr-x 1 boyer wheel 6 12 Jul 2012 latex -> pdftex\n\nwhich means that latex \\*\\*is\\*\\* pdftex. It is my understanding that calling latex or pdftex loads different initialization files but I don't know the inner workings.\n\n"
    },
    {
      "time": "18 Apr 2013 — 7:32pm",
      "content": "\\*chuckle\\*\n\nI am clearly out of my element here. I’m afraid that doesn’t make much sense to me.\n\nCode and programming aside, do you know of any writings that speak to the convention of double spacing after a period?\n\nDo you work in mono-spaced fonts a lot and/or have a preference for single versus double spaced periods?\n\nPerhaps my hypothesis of “programmers like double spaced periods because their frequency of exposure to monospaced typefaces is significantly higher than their exposure to proportionally spaced fonts, _and_ the layperson’s exposure to monospaced fonts” might have something to it.\n\n"
    },
    {
      "time": "18 Apr 2013 — 7:54pm",
      "content": "I don't put two spaces after periods in my LaTeX input files.\n\nAs for spacing in the outputs, I sometimes find that that LaTeX shrinks spaces too much when justifying but I never took the time to adjust the parameters. I just manually add space when I feel it is needed (using backslash commands or \\kern if necessary).\n\nConcerning documentation, I never took the time to look at the references in the wiki articles on the subject\n\n[http://en.wikipedia.org/wiki/Sentence\\_spacing](http://web.archive.org/web/20150415105823/http:/en.wikipedia.org/wiki/Sentence_spacing \"http://en.wikipedia.org/wiki/Sentence\\_spacing\")  \n [http://en.wikipedia.org/wiki/Sentence\\_spacing\\_studies](http://web.archive.org/web/20150415105823/http:/en.wikipedia.org/wiki/Sentence_spacing_studies \"http://en.wikipedia.org/wiki/Sentence\\_spacing\\_studies\")\n\nMichel\n\n"
    },
    {
      "time": "18 Apr 2013 — 9:06pm",
      "content": "Dean —\n\nI don't know much about TeX, but it sounds like you might be closer with something like:  \nTeX is InDesign and LaTeX is IDML (InDesign Markup Language)?  \nI.e., the latter is the language that the former speaks.\n\n( [http://www.adobe.com/content/dam/Adobe/en/devnet/indesign/cs5\\_docs/idml/...](http://web.archive.org/web/20150415105823/http:/www.adobe.com/content/dam/Adobe/en/devnet/indesign/cs5_docs/idml/idml-cookbook.pdf \"http://www.adobe.com/content/dam/Adobe/en/devnet/indesign/cs5\\_docs/idml/idml-cookbook.pdf\"))\n\n"
    },
    {
      "time": "18 Apr 2013 — 11:42pm",
      "content": "Chris, sorry that I was so terse — I thought most people here have at least some cursory knowledge about TeX/LaTeX. There are many issues relating to my answer. Sorry if this post just adds confusion instead of decreasing this.\n\n- What I was discussing was reading _printed_ text designed by humans for human consumption. [And: I do teach and do develop software — but these are not related to what I was discussing.] So what I said has no relationship to monospaced fonts (though in many situation I consider them superior to proportional ones, so would use lynx instead of firefox).\n- By default, **on input** , TeX (and LaTeX) treat multiple whitespace characters the same as one. (Do not remember the command which disables this; usually people use `\\verbatim` which does a lot of actions simultaneously). So what I said did not concern what happens with the input: i.e., typing two spaces to achieve certain goals.\n- By default, TeX (and LaTeX) **typeset** whitespace differently after certain punctuation marks (depending how how the font sets certain dimensions, and depending how the current table of character properties is set). I explained the particular details of the algorithm. The default boils down to widening the interword gap after period, exlamation mark, semicolon etc (in different degrees for each of them), and manages to remember “the intent to widen” over some intertwining characters (so that PERIOD SPACE looks similar to PERIOD CLOSEPAREN SPACE).\n\nSo what I was discussing was: text typeset to pretty high quality (as (La)TeX does), but not designed to read-and-forget mode of consumption. (Not necessarily a technical discourse: for “fiction” books I read, I find the amount of context given by 7in e-books to be suitable only for the most trashy subjects — and yes, I do read a lot of this! And given my need of context, I deduce the degree of non-linearity of my reading must be significant.)\n\n"
    },
    {
      "time": "19 Apr 2013 — 12:09am",
      "content": "About TeX vs LaTeX. There is a lot of confusion here, especially since Knuth himself did not invent a proper naming system.\n\nThere is so called “TeX’ guts”, which is a typesetting engine modelled on rectangular (possibly with a slop, if one takes _italic correction_ into account) boxes. The flow of characters-to-typeset and “commands” fed into the guts is converted to a sequence of boxes which are accumulated into other boxes, are split as needed (both via both hyphenation and justification), and eventually fill the vertical stack(s) of typeset lines.\n\nTime to time the “output routine” inspects the formed stacks, and when it decides that there is enough of them to fill a page (e.g., an an end-the-page command arrives ;-), it rearranges them again, ships out the page, and keeps the stuff which did not fit in the boxes; then the accumulation of input happens again.\n\nIn XX century, shipping out was happening in an internal TeX format, DVI. Nowadays, PDF is used much more often. Why many stacks? There is the main text, footnotes, margin notes etc. AFAIK, the TeX guts is a very capable typesetting engine (at least or English); AFAIK, it remains the best even now, 30 years after it was written. (But since what Knuth learned was the English-specific typography, it may be weakier for other languages.) The math typesetting subsystem is, IMO, quite weak — but still it is (again, hearsay) many heads above any competition.\n\nWhere the input to the guts comes from? Here comes the major defect of TeX: the engine is fed by a macro-expansion language. And this macro-expansion is the ONLY way to feed the guts. And this language is extremely idiosyncrasic, fragile, and with only very primitive tools for debugging. What Knuth also did was shipping a certain “user-friendly” packet of macros (Plain TeX) which made it possible to feed the guts in a way not immediately killing the writer.\n\nSo when people say TeX, sometimes they mean “TeX guts”, sometimes they mean “guts + Plain TeX”.\n\nLaTeX and ConTeXT are two alternative macro packages designed to address the problem of feeding the guts in different ways than Plain TeX. Both hide a lot of details under the hood, and make it extremely easy to e.g., auto-number the sections and formulae etc. Oftentimes these extra levels of hiding make things easier, but sometimes they make control harder; so people often use lower-lever commands inside LaTeX documents (in a certain sense, they put chunks of TeX input inside LaTeX input — more often than not this “just works”).\n\n"
    },
    {
      "time": "19 Apr 2013 — 12:18am",
      "content": "\\> _AFAIK, it remains the best even now, 30 years after it was written_\n\nHmm, I think that I did not put the proper credit where it is due: while TeX was written “then”, it is the microtypography (and other improvements) added in pdfTeX which (as I've heard) keep the TeX in front of the competition. My knowledge of these changes is much more cursory, though….\n\n"
    }
  ]
}
