{
  "id": "10239",
  "title": "Translation please...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Can someone translate this text to english?   \nIt was published in the French ATypI Web site...   \nThanks!   \n   \n\"Cher Fred Nader,   \nJe ne vous crois pas lorsque vous dites avoir num\n\n",
  "author": "Ramiro Espinoza",
  "time": "25 Feb 2003 — 9:19am",
  "uid": "1137",
  "comments": [
    {
      "time": "25 Feb 2003 — 10:11am",
      "content": "Not perfect, but I think this will do:   \n   \n\"Dear Fred Nader,   \nI do not believe you when you say you have digitized the Guyot (published under the name Day Roman). I am sorry to say that in spite of the differences between you and many others in the international typographical scene, you continue to use the shapes of other type designers and distribute/publish their designs under your own name. The Devroye family (0182) is a pure copy and manipulation of Fran\n\n"
    },
    {
      "time": "25 Feb 2003 — 12:21pm",
      "content": "Thanks Stephen. I have a more complete perspective now.   \n   \nBTW, I think someone removed the original Devroye font (0182) from The Lab ( [http://www.hardcovermedia.com/lab/Pages/Fontpages/dayroman.html](http://web.archive.org/web/20131102052857/http:/www.hardcovermedia.com/lab/Pages/Fontpages/dayroman.html)). This is not \"Devroye\" font...\n\n"
    },
    {
      "time": "25 Feb 2003 — 4:02pm",
      "content": "Ramiro   \n   \nYou can use Altavista translate... or call porchez by phone :P\n\n"
    },
    {
      "time": "25 Feb 2003 — 6:12pm",
      "content": "Dear Ale: very frecuently I hear comments on piracy and related topics.   \nIMHO, it's more interesting to debate this issues openly. I don't see any reason to not talk about this things in a open forum.\n\n"
    },
    {
      "time": "26 Feb 2003 — 3:36pm",
      "content": "_..JFP's comment in response to Fred Nader's comment at Typographica._   \n   \nWow! Now that _is_ a debate! It's a brave man that'll tackle Jean-Fran\n\n"
    },
    {
      "time": "25 Feb 2003 — 12:05pm",
      "content": "Ramiro, this text was taken from JFP's comment in response   \nto Fred Nader's comment at [Typographica](http://web.archive.org/web/20131102052857/http:/typographi.ca/000511.php). (You'll have to wade   \nthrough a lot on the page to find it.) Sorry I didn't get to   \nyour question sooner so koeiekat woun't have to translate.   \nThe kat did a fine job, though!\n\n"
    }
  ]
}
