{
  "id": "102301",
  "title": "Tips on how to keep fonts organised between multiple computers",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've started working between my office and home computer half and half lately and need to keep my fonts consistent between both. Is there any way to keep them both in sync and also any recommended programmes to keep them organised?\n\n",
  "author": "robbief",
  "time": "15 Apr 2013 — 10:25am",
  "uid": "210697",
  "comments": [
    {
      "time": "15 Apr 2013 — 12:03pm",
      "content": "Extensis Suitcase version 12 (“Fusion”) has worked at my office since about 2007. It takes some configuring and some getting used to, but once that’s through it’s fantastic. Each of our computers is usually working on several projects at once, so we need quick activation and deactivation of font sets.\n\nIn order to reduce conflicts, uninstall or remove as many system fonts as you can; you can activate them as you need them through Suitcase.\n\nI’d recommend _against_ Linotype Font Explorer — every computer that I’ve seen it installed on has been riddled with conflicts and phantom fonts. Usually the system font software is better.\n\nAs for keeping your computers in sync and organized, for me that’s more of a personal choice. Any method of transferring files should work, right?\n\n"
    },
    {
      "time": "16 Apr 2013 — 4:45am",
      "content": "If the computers can connect with each other, some form of 'rsync' may work. If not, a USB stick and a file system browser/explorer might help.\n\n"
    },
    {
      "time": "16 Apr 2013 — 6:11am",
      "content": "I have worked with FEX in various forms, and I am very satisfied. I don’t know how the server version compares, but I would certainly recommend FEX\n\n"
    },
    {
      "time": "16 Apr 2013 — 6:15am",
      "content": "Sync your fonts folder via Dropbox?\n\n"
    },
    {
      "time": "17 Apr 2013 — 3:33am",
      "content": "@pica pusher - Thanks, going to check that out, I remember seeing it ages ago but never tried out.\n\n@Té Rowan & @Jens Kutilek - I think I'll go with Dropbox, my internet is terrible at home so uploading from there will be a pain but once the whole library is initially synced I guess it won't be much trouble after.\n\n@Queneau - Can you link me to that please, can't see anything on Google for it.\n\n"
    },
    {
      "time": "18 Apr 2013 — 5:51am",
      "content": "I am sorry, I meant Linotype Fontexplorer Pro, often shortened to FEX... :)\n\n"
    }
  ]
}
