{
  "id": "102304",
  "title": "Webfont displays on Mac but not Windows.",
  "forum": "Build",
  "tags": [
    "problem",
    "webfonts",
    "Build"
  ],
  "content": "Hi there,  \nI converted a font to a webfont through fontsquirrel that was tweaked/manipulated in fontlab. The files/css work fine on Mac's but don't display on any windows machines. Has anyone had any issues with this?\n\nCheers\n\n",
  "author": "Giles",
  "time": "15 Apr 2013 — 11:57am",
  "uid": "12033",
  "comments": [
    {
      "time": "15 Apr 2013 — 12:50pm",
      "content": "Can we get a link to the website?\n\n"
    },
    {
      "time": "15 Apr 2013 — 4:57pm",
      "content": "do you mean that they work with ALL mac browsers but NONE of the Windows browsers?\n\nor they just don't display in IE?\n\n"
    },
    {
      "time": "16 Apr 2013 — 12:11am",
      "content": "They just kind of fall apart, here's a screenshot. Unfortunately the site is on a developers server so I can't share a link.\n\n ![](http://web.archive.org/web/20150419054439im_/http:/typophile.com/files/Screenshot01_5378.png)\n\n"
    },
    {
      "time": "16 Apr 2013 — 2:55am",
      "content": "Here's a better screen shot.\n\n ![](http://web.archive.org/web/20150419054439im_/http:/typophile.com/files/Screen%20Shot%202013-04-16%20at%205_6212.17.05%20PM.png)\n\nThe blue select type shows best.\n\n"
    },
    {
      "time": "16 Apr 2013 — 7:10am",
      "content": "It looks like a hinting problem, but I wonder about the “loose dirt”. Is this a distressed font? That would probably explain why it renders as it does. If the EULA permits it, can you send me font file?\n\n"
    },
    {
      "time": "16 Apr 2013 — 8:57pm",
      "content": "Frode's right, this is a hinting issue. I assume that in your TrueType generating preferences you have \"autohint unhinted glyphs\" checked. Try unchecking that and re0-generating the fonts. If this is a distressed font, it probably won't benefit from autohinting.\n\n"
    },
    {
      "time": "17 Apr 2013 — 4:14am",
      "content": "\"...won't benefit from autohinting.\"\n\nMight no even benefit from either unautohintng, de autohinting or hinting ;). Hard to tell...\n\n"
    },
    {
      "time": "17 Apr 2013 — 11:46pm",
      "content": "Yes it is a distressed font, I had to take it into illustrator to tidy up un-closed vectors and clean it up but seems to still have the issue. I'm just about to retry and test.\n\n"
    },
    {
      "time": "17 Apr 2013 — 11:48pm",
      "content": "Could you let us know what the original font is? Looking at the pictures you have posted I am (perhaps hastily) assuming that you did not part with cash or haggle over license terms...\n\n"
    },
    {
      "time": "18 Apr 2013 — 12:26am",
      "content": "The original font is Pound ( [http://www.myfonts.com/fonts/typodermic/pound/](http://web.archive.org/web/20150419054439/http:/www.myfonts.com/fonts/typodermic/pound/ \"http://www.myfonts.com/fonts/typodermic/pound/\")), And yes it was purchased with license for the client.\n\n"
    },
    {
      "time": "18 Apr 2013 — 7:39am",
      "content": "Have you tried contacting Ray Larabie? He regularly posts here and over on TypeDrawers.\n\n"
    },
    {
      "time": "18 Apr 2013 — 12:03pm",
      "content": "Yeah, I've just sent him an email. Hopefully he'll be able to sort it and huge thanks to Frode for his help. He was spot on.\n\n"
    }
  ]
}
