{
  "id": "102476",
  "title": "retro computer font",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "ad computer logo",
    "computer",
    "retro",
    "Type ID Board [OLD]"
  ],
  "content": "I need some help identifying the font used for the AD Computer logo.\n\n ![](http://web.archive.org/web/20150317202205im_/http:/typophile.com/files/ad_comp_logo_5809.jpg)\n  \nthe letterforms are a bit wonky on this image because it's an auto-trace of a screen grab from their website here:\n\n[http://www.adcomputer.com](http://web.archive.org/web/20150317202205/http:/www.adcomputer.com/ \"http://www.adcomputer.com\")\n\nAny leads identifying this or similar font suggestions would be very much appreciated.\n\n",
  "author": "Dus10k",
  "time": "23 Apr 2013 — 9:02am",
  "uid": "210922",
  "comments": [
    {
      "time": "23 Apr 2013 — 9:30am",
      "content": "your autotrace doesn't look too bad! took a snap from a pdf they had available.\n\n ![](http://web.archive.org/web/20150317202205im_/http:/typophile.com/files/snap_5549.png)\n\ncouple of similars (for the cut in characters quality):  \n [Alpine OT](http://web.archive.org/web/20150317202205/http:/www.fontshop.com/fonts/singles/club21/alpine_ot/)  \n [Plan B](http://web.archive.org/web/20150317202205/http:/www.myfonts.com/fonts/characters/plan/b/)\n\n"
    },
    {
      "time": "30 Jul 2014 — 2:10am",
      "content": "If I had to guesstimate, I'd say this is 70's/80's phototype. Edges seem a little too smooth/rounded, which can occur when exposure and focus are a little out. Or if you've made multiple copies and the repeated photographic process has smoothed out the once sharp corners.\n\nLooks similar to a SignLab font called Spaceage. Only available in .VEF format, so not really usable outside SignLab.\n\n ![](http://web.archive.org/web/20150317202205im_/http:/typophile.com/files/spaceage_vef_3915.png)\n\nThere is a remake called Gayatri Pro which is available in regular TTF & OTF formats. It also seems to share quite a lot with Gamer/Chisel, only more rounded.\n\nAgain, there are a lot of unidentified phototypes that were used in films, tv, print ads, etc... from the 60's through to the 90's. The entire trade of creating typographic elements with phototype was wiped out with the digital revolution and a lot of the original film strips containing the typefaces were either phased out and trashed or forgotten about and thrown into storage. Thankfully people like Dan X Solo and a few others published catalogs containing samples of these faces so that they would not be completely lost forever.\n\nIt took me years of research to find out that the original Nintendo Entertainment System and Nikon Coolscan film scanners used a typeface known as Limited View, simply because it was an obscure phototype that was only digitized as an OPTIFont by Castcraft who no longer exist today.\n\nHopefully some of the alternatives I've listed help.\n\n"
    },
    {
      "time": "30 Nov 2014 — 3:00pm",
      "content": "The fan website galactiguise.com notes that spaceage.vef was [the \"standard\" font used on much of the standing sets of the 2003-2009 version of Battlestar Galactica](http://web.archive.org/web/20150317202205/http:/www.galactiguise.com/welcome/sets/signs-icons/).\n\nAs for Gayatri Pro, I haven't been able to find that. Although there's a \"Gayatri Regular\" that seems to be available at some of the free-font sites.\n\n"
    }
  ]
}
