{
  "id": "102406",
  "title": "Where did the sail on the lowercase t originate?",
  "forum": "Design",
  "tags": [
    "font history",
    "lowercase",
    "sail",
    "T",
    "Design"
  ],
  "content": "I was wondering if anyone knows where the sail on the lowercase t originated from.\n\n ![](http://web.archive.org/web/20140720180829im_/http:/typophile.com/files/Screen%20Shot%202013-04-19%20at%208_4418.17.02%20AM.png)\n\nI get that its an attempt to unify the t into one stroke, but is their anymore to it than that? Why is the sail on the left? Why does the stroke begin at the right and move left (opposed to the left --\\> right motion we use to cross our \"t\"s and \"f\"s)?\n\n ![](http://web.archive.org/web/20140720180829im_/http:/typophile.com/files/Screen%20Shot%202013-04-19%20at%208_3544.19.24%20AM.png)\n (not too strange)\n\n ![](http://web.archive.org/web/20140720180829im_/http:/typophile.com/files/Screen%20Shot%202013-04-19%20at%208_5610.20.35%20AM.png)\n (very strange) \n",
  "author": "qkeave",
  "time": "19 Apr 2013 — 6:21am",
  "uid": "197936",
  "comments": [
    {
      "time": "19 Apr 2013 — 6:25am",
      "content": "Sorry for the \"its\" and \"their\"...\n\n"
    },
    {
      "time": "19 Apr 2013 — 10:08am",
      "content": "It derives from calligraphy, which was the driving stylistic element for the [Carolingian Miniscule](http://web.archive.org/web/20140720180829/http:/en.wikipedia.org/wiki/Carolingian_minuscule):\n\n_“The script ultimately developed from Roman half uncial and its cursive version, which had given rise to various Continental minuscule scripts, which were combined with features from the \"Insular\" scripts that were being used in Irish and English monasteries.”_\n\nThe quill pen was cut so it provided a flat area. Due to the position of the right hand, the quilt’s tip was causing an angled stroke, which provided strong strokes downwards and softer strokes sideways, although the goal was probably to keep both strokes equal in force.\n\nThe minuscle “t” derives from the _Roman Capitalis_ “T”, and the first stroke of the quill was downwards, followed by the second stroke sideways from left to right. Slight inaccuracy caused a little bump on the top where the T-downstroke began, which led to the slightly crossed shape. The sail shape in serif fonts, as you have shown it, is a result of both angled strokes melting into one area at some point of type development. Just like the curve at the bottom of the lowercase “t” and the lowercase “a” derives from swift motions when writing minuscule scripts.\n\n"
    },
    {
      "time": "23 Apr 2013 — 12:37am",
      "content": "Thanks.\n\n"
    },
    {
      "time": "23 Apr 2013 — 2:58am",
      "content": "The ‘sail’ origins in writing :–) as shown [here](http://web.archive.org/web/20140720180829/http:/www.flickr.com/photos/albert-jan_pool/8674982388/in/set-72157629679838154/). I prefer to write the horizontal stroke first (no matter if I write T or t). Doing so, I can more easily avoid the vertical stroke causing a bump in the horizontal one that the other way round. Also I think it it is easier to find the right starting point for the horizontal stroke than for the vertical stroke of T or t, because the further I am away from the preceding letter, the more I have to guess about the size of the inter-character space.\n\n"
    }
  ]
}
