{
  "id": "1024",
  "title": "Theoria",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "This font is my first foray into type design in quite a while; due to work, I haven't had the chance to do much in Fontographer, but recently I decided to dust off some old ideas and see where I could take them.   \n   \nTheoria [working title] is a bitmap face that I have been developing for use at 8px. It is my take on economic use of pixels, combining the use of gaps in bitmap shapes to add to the clarity with 1px ascenders.   \n   \nAnd yes, in case you are wondering, i am quite mad. 1px.   \n   \nFeedback, comments, anything's welcome.   \n   \n ![Theoria1](http://web.archive.org/web/20150317101812im_/http:/www.typophile.com/forums/messages/29/1468.gif)\n\n",
  "author": "unlinear",
  "time": "8 Jun 2002 — 11:35am",
  "uid": "1251",
  "comments": [
    {
      "time": "8 Jun 2002 — 11:38am",
      "content": "While I'm at it..   \n   \nOne of the bumps I ran into turned into an interesting feature for the font. International characters were going to be quite the pain in this case, but playing with optical tricks resulted in the following [preliminary] international latin characters:   \n   \n ![international!](http://web.archive.org/web/20150317101812im_/http:/www.typophile.com/forums/messages/29/1469.gif)   \n   \nIgnore the weird text; I copied it from the case of a CD-R on my desk. =)\n\n"
    },
    {
      "time": "8 Jun 2002 — 2:26pm",
      "content": "It's great. the lowercase \"t\" looks off but the capitals are great. Good take on international characters, but it gets a tad illegible at times.   \nIt has got a very pleasing texture, I like that.\n\n"
    },
    {
      "time": "8 Jun 2002 — 3:14pm",
      "content": "\\> use of gaps in bitmap shapes to add to the clarity   \n   \nMasterful ingenuity.   \nMost people realize that whitespace is more valuable than it seems, but very very few people manage to actually use it to such great practical effect.   \n   \nAnd the application with the accents is \\*so\\* nice that I would recommend making a \"progressive\" outline font to go with it. Don't be surprised if it becomes a big hit with display designers; it can even be seen as giving a new cultural validity to accented writing systems. And do it fast - this is an idea that \\*will\\* be stolen, very quickly - I can feel it.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Jun 2002 — 3:43pm",
      "content": "Splendid, Rob. It has a distinctive character   \nrarely seen in a sans bitmap of this size.   \n   \nStephen\n\n"
    },
    {
      "time": "8 Jun 2002 — 5:54pm",
      "content": "A very good \"g\"   \n   \n   \nMiguel\n\n"
    },
    {
      "time": "9 Jun 2002 — 12:34pm",
      "content": "I reworked some of the characters, finalized the base character sets and drew the additional international latin chars today.. I thought having only 1px to 'cheat' with [above the top of the ascenders] was a problem, so imagine the fun i had from drawing accents on caps.   \n   \nall in all the set looks pretty useful, but I'm looking for texts that'll let me sample the various international chars.   \n   \nSo, like pangrams, but more international-oriented.   \n   \nAnyone?\n\n"
    },
    {
      "time": "9 Jun 2002 — 12:35pm",
      "content": "Oh and by the way, thank you all for the kind words. I'm flattered.. =)\n\n"
    },
    {
      "time": "10 Jun 2002 — 11:11am",
      "content": "I agree that the \"g\" is wonderful. I find the entire face enjoyable and unique. It's a rather daunting task to find new approaches when creating screen fonts, especially those intended for 8pts or there abouts....   \n   \nCheers!\n\n"
    },
    {
      "time": "18 Jun 2002 — 12:12pm",
      "content": "I must be nuts, but I found myself posing a question:   \n   \n ![italics or not?](http://web.archive.org/web/20150317101812im_/http:/www.typophile.com/forums/messages/29/1545.gif)   \n   \nSince italics generally don't work at this resolution, I'm not 100% sure if i should persue an italic for at least the regular.. or that i should just drop it and make it a 2 weight family..   \n   \nSuggestions?\n\n"
    },
    {
      "time": "19 Jun 2002 — 2:15am",
      "content": "It's better to have a well-draw italic version instead of software generated italics...   \n   \nAnd it stills legible I think, but if you planned to expand your family, what about a bold version?   \n   \nGreat work.   \n   \nGreg.\n\n"
    },
    {
      "time": "19 Jun 2002 — 2:41am",
      "content": "There's a bold in the topmost samples...\n\n"
    },
    {
      "time": "20 Jun 2002 — 2:05am",
      "content": "Shame on me... (I'm kerning cyrillic types this week, and this kind of work makes me stupid ![:)](http://web.archive.org/web/20150317101812im_/http:/www.typophile.com/forums/clipart/happy.gif) )\n\n"
    },
    {
      "time": "6 Aug 2002 — 7:30am",
      "content": "Someone tried to contact me about using a beta of this.. I lost all my e-mail and need to get in touch with him again..\n\n"
    },
    {
      "time": "13 Aug 2002 — 4:24am",
      "content": "only just discovered this, and it's wonderful, you really should do an outline font as Hrant suggested.\n\n"
    },
    {
      "time": "30 Dec 2008 — 5:00pm",
      "content": "Okay, slight giggle on my end. I guess i DID still have a username on here — unlinear — which corresponded to a domain name that expired in the early 2000s.\n\nI'm looking to pick this project up again.. I'll probably link to a new thread in a non-bitmap face section of the forums down the line. Does anyone know if anything else like this has been done since? I can hardly expect to be the only one to try it...\n\n_\\*blows dust off of fontlab\\*_\n\n"
    },
    {
      "time": "30 Dec 2008 — 6:06pm",
      "content": "Wow, what a nice blast from the past!  \nPlease do pick this back up again.\n\nNot counting the droves of [predictable] stencil fonts, the only  \ntype I've encountered that features judiciously applied gaps is  \nthe mythical Nomina by Pierro De Macchi (not available retail).\n\nhhp\n\n"
    }
  ]
}
