{
  "id": "102447",
  "title": "Classification of Roboto",
  "forum": "Sans Serif",
  "tags": [
    "google",
    "roboto",
    "sans serif",
    "Sans Serif",
    "typeface"
  ],
  "content": "I wonder how _Roboto_ should be classified. Is it a grotesk, a geometric sans serif, a humanist sans serif? In any case it is a lineal sans serif, but I am wondering about the contextual category.\n\nIf you ask me, it’s a hybrid, with classicist grotesk (lowercase a and as, and uppercase S, C, G) with elements of a humanist sans serif (lowercase e, g, etc.). What do you think?\n\n[http://www.fontsquirrel.com/fonts/roboto](http://web.archive.org/web/20150424024551/http:/www.fontsquirrel.com/fonts/roboto \"http://www.fontsquirrel.com/fonts/roboto\")\n\n",
  "author": "Core0",
  "time": "22 Apr 2013 — 9:33am",
  "uid": "181047",
  "comments": [
    {
      "time": "22 Apr 2013 — 9:39am",
      "content": "Not that I fully agree, but:  \n [http://typographica.org/on-typography/roboto-typeface-is-a-four-headed-f...](http://web.archive.org/web/20150424024551/http:/typographica.org/on-typography/roboto-typeface-is-a-four-headed-frankenstein/ \"http://typographica.org/on-typography/roboto-typeface-is-a-four-headed-frankenstein/\")\n\nhhp\n\n"
    },
    {
      "time": "22 Apr 2013 — 10:40am",
      "content": "Interesting. I think I heard about this article from someone telling me a couple of weeks ago, but I didn’t know the source and couldn’t find it.\n\nWith what exactly don’t you agree, the harsh judgement of its author, my comments above, or the ugliness (or beauty) of Roboto?\n\n"
    },
    {
      "time": "22 Apr 2013 — 10:48am",
      "content": "Well, one thing I don't agree with is obsessing over classification. :-) But mostly -like I said in my Typographica comment- when I see it on my Galaxy Note 2 it just works - at least in that context. Hunting down \"historical impurity\" is for inquisitionists. Everything is hybrid.\n\nThere's also something quite awesome about Roboto: it's under the Apache license, not OFL; the former allows the selling of modifications. In the end this means more designers can justify helping more people.\n\nhhp\n\n"
    },
    {
      "time": "22 Apr 2013 — 1:49pm",
      "content": "I posted it in context of my own work on Hikari and criticism my announcement received, about it being a “neo grot”. I found it refreshing and interesting that other designers are not caring too much about classification and more about design principles they apply, a result of research and conclusions they draw while examining the environment where their fonts will be used. I find this approach similar to my own goals, as I am designing Hikari for screen applications and not just for print. I have even thought about a user interface version for mobile devices.\n\n"
    }
  ]
}
