{
  "id": "102424",
  "title": "Therefore, this question: Is kerning a matter of personal taste?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm working on a logo for my personal website and would like to have it appear professional. I'm the type who can keep moving around the pixels when I design (eg. Webdesign) and find it difficult to close a project down. I think it's difficult to find websites that show \"this is how it should be done.\" The vast majority of websites only explains the concepts(kerning tracking etc.) and not how you do it.\n\nTherefore, this question: Is kerning a matter of personal taste?\n\n",
  "author": "Lasse Brosolat ...",
  "time": "20 Apr 2013 — 11:12pm",
  "uid": "210849",
  "comments": [
    {
      "time": "20 Apr 2013 — 11:37pm",
      "content": "Professional type designers spend a lot of time carefully spacing and kerning typefaces to look just so. Generally, any extra input from the end-user is not needed. One thing to bear in mind is to always use kerning set to 'Metrics' and never use 'Optical'.\n\n"
    },
    {
      "time": "21 Apr 2013 — 1:04am",
      "content": "When you kern you're adjusting the distance between characters so the spacing looks uniform. Since characters have different shapes, some must be closer together than others to create spacing that appears uniform. There is a subjective element to it, but bad kerning is usually pretty obvious. If you Google \"how to kern\" you'll find articles that give tips. You could also post an example of type you've kerned to get suggestions.\n\n"
    },
    {
      "time": "21 Apr 2013 — 7:25am",
      "content": "Yes, kerning is a matter of personal taste. Which is not the same as saying anything is correct. Kerning is a matter of harmonious spacing, that is, everything needs to work well together. Often, a change to a kerning pair shows a difference in one's notion of proper character fit, so a change in one kern value will lead to others.\n\nOccasionally though, changing the kerning of a single glyph does not affect other spatial relationships -- witness Slimbach's notion of the proper kerning of an apostrophe versus what other equally skilled people deem correct.\n\n> Professional type designers spend a lot of time carefully spacing and kerning typefaces to look just so. Generally, any extra input from the end-user is not needed\n\nExtra \"input\" needed? No, but quite often fixes are needed by the \"professional user.\" And by that I mean the professional type designer gets things wrong, usually by omission, occasionally by error. I'm not speaking of a difference in preference about spatial relationships here.\n\nBut there is no need to give the \"professional type designer\" input. Many \"professional type designers\" don't live in a world populated by sentient authors, editors, typesetters, and readers. Very hard to convince them otherwise -- usually a wasted effort. Just fix things and get on with life.\n\nEdit:\n\nThis is particularly true in your situation, a logo. Presumably, there aren't many letters involved. A type desigenr, working on an entire font, has to make compromises in order to get all the letters to work well together. With your rather limited set, and a purpose that isn't \"continuous reading,\" decisions will likely be different. You can can still get things wrong, of course, but that's different than claiming there is a single \"right.\"\n\n"
    },
    {
      "time": "21 Apr 2013 — 12:21pm",
      "content": "Personal taste yes, but within the culture of professional typography—which encompasses the efforts of type designers, kern algorithm programmers and typographers.\n\nThere are, and have been, various conventions and philosophies of how to space letters. Here’s an example of “tight but not touching” from the 1960s:\n\n ![](http://web.archive.org/web/20130907021017im_/http:/typophile.com/files/Pepsi_1968_3905.png)\n  \nIf you decide that the time is right to revive such spacing in your wordmark, you will have to do it manually, because neither built-in metrics nor InDesign’s “Optical” will produce this result.\n\nNot only should you consider each individual letterspace in a wordmark, and manually kern where you see ﬁt, but you might also consider modifying letter shapes for improved overall color.\n\nHerb Lubalin’s masthead for Avant Garde magazine (which begat the typeface) originated, I surmise, from him working with one of his favorite types, Futura. I made the example below to show a possible interim stage in his design of the masthead. The idea is that you can only get so far—in certain kinds of wordmark—without going beyond off-the-shelf type.\n\n ![](http://web.archive.org/web/20130907021017im_/http:/typophile.com/files/AGs_4209.png)\n  \nMy apologies if this old stuff is out-of-date, but it does offer a perspective and, being an extreme, clearly represents the principles involved.\n\nIn recent years, many OpenType fonts have been published with alternate glyphs, which enables some customization of wordmarks, without having to “create outlines” in Illustrator.\n\n"
    },
    {
      "time": "21 Apr 2013 — 2:13pm",
      "content": "No, it is a good point Nick.\n\nAnother point is, with short copy, it depends on the words themselves. If I were setting\n\nWAWA BOX\n\nin a logo-type environment, kerning between all the letters could be tighter than if the two words were\n\nWARP DRIVE\n\nand certainly tighter than would be appropriate in the font itself, which has to work when setting long runs of text.\n\n"
    },
    {
      "time": "22 Apr 2013 — 5:30am",
      "content": "Not just personal taste – you might want to loosen kerning for a tiny use and tighten it for giant use just out of production considerations.\n\nIt is almost always necessary to consider kerning for headlines to articles too and certain character pairs can cause problems in a document (this is especially true when you encounter something a type designer would not necessarily consider when setting the kerning for example a numeral/letter combination).\n\nI was shown two ways of considering kerning –&nbsp;one is to print it out and turn it round; the other was to partially close eyes and squint at the setting on screen – this reduces the characters to a blur and lets you pick out the space in between.\n\nTim\n\n"
    },
    {
      "time": "22 Apr 2013 — 8:03am",
      "content": "What about the word 'minimum' that a lot of typedesigners use to set the white space they like as a basic setting with the typeface and most important the type size involved? By the way, in a logo or in a name (like a movie title) you have to deal with characters as if it where individuals. The concept 'typeface' should not be important. Often in a logo you can alter some characters (although a type designer is often not happy about that) so that you are really creating a logo and not simply a headline or typed title. It has to become a form of its own.  \nWhen a typeface is made originally as a textface, often other choices are made according to letterform and use of white than you are dealing with in a logo or movie title.\n\n"
    }
  ]
}
