{
  "id": "102480",
  "title": "Salt Sugar Fat: real logo samples?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Great design, because it signals its anti-establishment cred with a Jamie Reid punk-style ransom note collage, playing off that culture-jamming cliché to engage the viewer into concluding that the letters are torn from Big Food packages.\n\nHowever, as an art director I’m aware how protective those companies are of any unauthorized commercial use of their trademarks, or part thereof, and suspect that this is a deception.\n\nSo I’m engaged too!  \nAre you?\n\n ![](http://web.archive.org/web/20150425041839im_/http:/typophile.com/files/15797397_6065.jpg)\n\n",
  "author": "Nick Shinn",
  "time": "23 Apr 2013 — 9:44am",
  "uid": "2021",
  "comments": [
    {
      "time": "23 Apr 2013 — 10:17am",
      "content": "After having a look at the packaging of the usual suspects (online, not in my cupboard — I avoid sugared/fat filled/salty/unhealthy stuff), my conclusion is that all of the clippings originated in custom mockups, using the vocabulary and design characteristics of said suspects.\n\n"
    },
    {
      "time": "23 Apr 2013 — 11:28am",
      "content": "I think these are from real logos. The “a” in “Fat” is from the Coca-Cola logo. The “u” in “Sugar” is from Lucky Charms cereal.\n\n"
    },
    {
      "time": "23 Apr 2013 — 11:34am",
      "content": "The puffy “f” and “t” are from Kraft Jet-Puffed marshmallow products.\n\n(I don’t have any of this crap in my house, but I recognize them from the supermarket.)\n\n"
    },
    {
      "time": "23 Apr 2013 — 11:48am",
      "content": "The \"r\" is from Trix.\n\n"
    },
    {
      "time": "23 Apr 2013 — 12:01pm",
      "content": "The “S” in “Sugar” looks like it’s from the Lay’s logo, but the background is blue instead of red. The “G” and “a” look like they’re from the same logo, as do the “A” and “T”. Can’t quite place them, though.\n\n"
    },
    {
      "time": "23 Apr 2013 — 12:11pm",
      "content": "The \"G\" and \"a\" are from Golden Grahams.\n\n"
    },
    {
      "time": "23 Apr 2013 — 12:12pm",
      "content": "I recognized the marshmallow letters too. Marshmallows are crap? Sacrilege!\n\n"
    },
    {
      "time": "23 Apr 2013 — 12:14pm",
      "content": "Ah, the “A” and “T” are from Kellogg’s Frosted Flakes.\n\n(Maybe this should be moved to the Type I.D. section? ;-)\n\n"
    },
    {
      "time": "23 Apr 2013 — 12:14pm",
      "content": "The \"L\" is from Corn Flakes.\n\n"
    },
    {
      "time": "23 Apr 2013 — 12:16pm",
      "content": "The “S” in “Salt” is from Froot Loops cereal.\n\n"
    },
    {
      "time": "23 Apr 2013 — 12:15pm",
      "content": "Aren't the words spelt from found type something like Spell with Flickr ... [http://metaatem.net/words/](http://web.archive.org/web/20150425041839/http:/metaatem.net/words/ \"http://metaatem.net/words/\") ?\n\n"
    },
    {
      "time": "23 Apr 2013 — 1:32pm",
      "content": "It's a nice design. I'm sure Random House's lawyers determined this would be covered by the fair use exemption for transformative use of artwork (\"...altering the original with new expression, meaning, or message...\"). And it might be considered parody, which is also protected.\n\n"
    },
    {
      "time": "23 Apr 2013 — 1:42pm",
      "content": "And perhaps Bertelsmann’s pockets are deep enough to protect it from litigation over this design.\n\n"
    },
    {
      "time": "23 Apr 2013 — 4:01pm",
      "content": "It appears I was completely off… which says something about the pull these products have on me, I guess.\n\n"
    },
    {
      "time": "3 Jan 2015 — 7:55am",
      "content": "Perhaps in the calculation of costs Vs. benefits, none of these corporations would wish to bring further negative attention to the subject of how they manipulate the food chain by going after the filmmaker in a david and Gollieth battle over a court could see as just a questionable infringement. It's no different than music sampling of the 3 second rule for playing snippets of music without having to pay royalties.\n\nUnless some of them are owned by Monsanto, in wich case Mr. Bertelsmann probably already has black SUVs slowly driving past his front door.\n\n"
    }
  ]
}
