{
  "id": "10244",
  "title": "Immortalized in stained glassed type",
  "forum": "Home",
  "tags": [

  ],
  "content": "During the restoration of St. Peters Church (Pieterskerk) Leiden, Holland, (built 12th-17th century), over the next years all stained glass windows will be replaced. The current windows date from the last restoration in the 1950's and are historically wrong as well technically inferior. The new windows will have the original lozenge shapes and all around the church the lower panels will contain the names of the sponsors of the restoration. For this purpose Frank E. Blokland made a special version of DTL Haarlemmer -the 'corporate identity' type face of St. Peters Church- that matches the angle of the lozenges. Blokland also added special variations of the characters, a large (and still growing) number of ligatures and special superior and inferior characters and every window is uniquely designed by him. The stained glass panels are produced by the famous glazier Stef Hagemeier from Tilburg. An impression can be found at [http://www.pieterskerk.com/ramen\\_met\\_namen/index.cfm](http://web.archive.org/web/20050526222436/http:/www.pieterskerk.com/ramen_met_namen/index.cfm).   \n   \nThe beautiful St. Peters Church in the historical center of Leiden has a long and interesting history. For instance the Pilgrim Fathers held their religious services over there. One of their leaders, John Robinson, was buried in St. Peters Church in 1625. Information about the Pilgrims was recorded in the baptism, marriage and burial registers of St. Peters Church. A commemorative plaque in the church reminds us of the Pilgrim Fathers.   \n   \nIn the stained glass windows there is room for roughly 2000 names and the option to get a name placed, is open for everyone; first come, first served. The first panel was presented by the major of Leiden to the former Dutch minister Elco Brinkman on 15 March of this year. The new stained glass windows are technically guaranteed for roughly hundred years. Prices for getting a name placed are Euro 50 start up costs and Euro 25 per character.   \n   \nThose interested can contact Sietske Pennings s.pennings[at]pieterskerk[dot]com\n\n",
  "author": "blokland : Mon, 2005-04-11 07:37",
  "time": "",
  "uid": null,
  "comments": [

  ]
}
