{
  "id": "102411",
  "title": "Uknown Sans",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Central European",
    "czech",
    "Sans",
    "Type ID Board [OLD]"
  ],
  "content": "Hello guys, could you please help me identify these two sans fonts? First in \"MARKET\" and then in \"Pila Lidecko\".\n\nThese are parts of a logotype for a local groceries in Southern Moravia for which an unknown designer used these two fonts to easily define their basic CID elements.\n\nI am supposed to work with it further but am unable to define these fonts using both my knowledge and known online sources (what-the-font etc.).\n\nThank you very much for you time and effort. Greatly appreciated in advance :-)\n\n ![](http://web.archive.org/web/20131012020106im_/http:/typophile.com/files/market_4204.jpg)\n  \n\n ![](http://web.archive.org/web/20131012020106im_/http:/typophile.com/files/pila_6057.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [market.jpg](http://web.archive.org/web/20131012020106/http:/typophile.com/files/market.jpg) | 44.04 KB |\n| [pila.jpg](http://web.archive.org/web/20131012020106/http:/typophile.com/files/pila.jpg) | 51.2 KB |\n\n",
  "author": "HeartcoreCZ",
  "time": "19 Apr 2013 — 3:15pm",
  "uid": "210825",
  "comments": [
    {
      "time": "19 Apr 2013 — 6:10pm",
      "content": "The closest I can find to \"Pila Lidecko\" is **[Max Black](http://web.archive.org/web/20131012020106/http:/www.fontshop.com/search/?q=Max%20Black&sample_text=Pila%20Lidecko)** by Morten Rostgaard Olsen (FontShop, 2003)\n\n"
    },
    {
      "time": "20 Apr 2013 — 2:44am",
      "content": "It's a strange one, looks so familiar but I can't place it. I think the two images are using the same font, with MARKET squooshed.\n\n"
    },
    {
      "time": "20 Apr 2013 — 3:07am",
      "content": "Exactly. It looks very familiar both to me and my colleague but we still can't place it. We are pretty sure that the font in Pila Lidecko isn't modified in any way (except kerning maybe) and it's not Max Black (thank you fvilanakis anyway! :-)).\n\nIt is also possible that the font is the same in both signs (Market / Pila...) and could be either an extended / regular version of the same typeface or simply squooshed as you said.\n\n"
    },
    {
      "time": "20 Apr 2013 — 3:36am",
      "content": "Not sure if it's useful, but it made me think of Neo Sans, Akko, Cachet, Klavika and Klint. I think it could be modified/custom. The ascenders are longer than usual for this type of design, and the /e/ and /k/ look a bit wide perhaps.\n\n"
    },
    {
      "time": "20 Apr 2013 — 3:43pm",
      "content": "Concord Bold, Tahoma Bold or even Verdana are close for Market - it does appear squooshed. Just to point out how tricky this is.\n\n"
    },
    {
      "time": "22 Apr 2013 — 12:04pm",
      "content": "Thank you guys. The top font can probably be found among those you suggested. The tricky one is in \"Pila Lidecko\". Still can't figure that out using even more forums like this one...\n\nI honestly did not think that I could be deceived so much after so many years in business. :-)\n\n"
    }
  ]
}
