{
  "id": "102576",
  "title": "Logo reveal & critique - Red Courgette",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "branding",
    "catering",
    "design",
    "logo",
    "Logos / Corporate ID Design"
  ],
  "content": "Hi Guys,\n\nI don't actually use this forum like I should be because I'm not a typographer by any means but it's a brilliant resource for getting advice on type related design (lets admit it, 90% of it is type) and you guys are pros when it comes to whitespace and composition. I try to throw my opinion in when its suitable and helpful.\n\nToday I thought I'd post a completed job for it to be torn apart and learn me something.  \nRed Courgette is a client of mine headed by an over-qualified chef. She's done the rounds of restaurants and world travel and has decided to dig into the catering pie to deliver her delicious goods with credits in the right places.\n\nI already had a vision for this design based on a name the client had for many years since her travel of the deep US south, I needed utilise all the typical food industry keywords like fresh, wholesome, passionate, gourmet, delicious, then ignore them and keep a very honest, home-grown feel that accurately depicted who she is and what she's about.\n\nHere's the finished product. Semi-literal graphically with custom type to anchor it in.\n\n![Red Courgette Logo](http://web.archive.org/web/20150419173159im_/http:/i43.tinypic.com/17ssbs.jpg)\n\nAny feedback is welcomed, composition and technicalities of the type would be most helpful.\n\n",
  "author": "DanJWill",
  "time": "26 Apr 2013 — 9:48pm",
  "uid": "99093",
  "comments": [
    {
      "time": "28 Apr 2013 — 3:40pm",
      "content": "The script type is interesting, and has a nice playful/quirky feel to it. It's not perfect, but it doesn't feel like it was trying to be in the first place, so I'm happy to go with it. Based on that, along with the warm colors and overall illustration style, I get the idea that the type of food she makes is more about quality, seasonal ingredients, and flavor rather than clean presentational flair.\n\nMy only issue lies with the tagline. It feels like an afterthought — as if you pitched the idea of the logo without it, and she wanted the tagline in, so you shoved up the text and stuck it underneath. It makes the already left-heavy illustration feel even more unbalanced because of it needing to nest to the left of the 'g' descender. I also dislike the use of the period at the end, as it's something that's completely overdone when a company is trying to appear genuine. The lack of initial cap also adds to the faux 'cool' trendiness factor. Another concern is that the tagline is already quite small at this size, so I would be worried about legibility issues if the logo is ever used any smaller than it is here.\n\nOne way to have solved the balance issues with the tagline would have been to sandwich the illustration and center the tagline underneath. That way, you would then also have an easy way to create a simplified version of the logo when the tagline isn't needed (you simply drop it off the bottom).\n\nOverall, though I find the style of the illustration, and main lettering to work very well together, and another custom wordmark in the world is always a good thing.\n\nPenn\n\n"
    },
    {
      "time": "28 Apr 2013 — 10:15pm",
      "content": "I agree with much of what Penn said, especially regarding the tag line's size, the period, etc. I would eliminate it or put it below the illustration. You've got some good elements but it needs more tweaking. Have you considered putting it within a shape, such as a freehand oval?\n\nDo you think customers will understand the illustration? I assume it's a zucchini blossom, since courgette is another word for zucchini. I grow zucchinis in my garden, but I think many folks wouldn't know what the illustration represents.\n\n"
    },
    {
      "time": "30 Apr 2013 — 6:52am",
      "content": "I'm a little distracted by the bud and zucchini having similar widths. If it is intentional, perhaps the line that is the edge of the bud could be angled further counterclockwise so it points to the space between Red and Courgette.\n\n"
    },
    {
      "time": "1 May 2013 — 11:01pm",
      "content": "@Penn - I smiled when I read this, you're right on the money. The tagline was very much an afterthought but a necessary one at that.  \nYou're also on the mark with the description of the business which makes me a happy designer. The full stop and no caps was a choice to represent exactly that, honesty, you've got me thinking about it's importance when I've already got a wordmark and illustration to convey what I want. What are your thoughts on straightening the type out and modifying some of the characters to have a straighter form?\n\n@JamesM - I've deliberately stuck away from the 'put it in a shape' trend. Those elements will come in physical form when they're applicable i.e. packaging & labels.  \nCustomers need not know what it is specifically, to them it's colourful, unique, is related to food and signifies... dare I say it... gourmet whilst sticking well away from the word. Typically I've found those that don't know don't care for the service she provides in the first place but for those that are interested, it creates a perfect point of conversation.\n\n@KateB - I'm not sure what you mean about rotating and pointing.\n\n"
    },
    {
      "time": "3 May 2013 — 5:37am",
      "content": "I mean that your eye would have an easier time traveling from the illustration to the text if it was altered along the lines of:\n\n ![](http://web.archive.org/web/20150419173159im_/http:/typophile.com/files/angled_5179.jpg)\n\n(I'm sorry for crudely butchering your design, but I wasn't doing a good job of explaining what I meant.)\n\n"
    },
    {
      "time": "5 May 2013 — 3:35pm",
      "content": "Ah right, I see. Thanks for explaining Kate.\n\nThe client is happy to delay for the pursuit of perfection so I'm going to experiment with the tagline underneath like I should have in the first place.\n\n"
    },
    {
      "time": "13 May 2013 — 2:04pm",
      "content": "The 'u' in Courgette almost reads as an 'a', reading 'Coargette' to me.  \nThe crossbar in 'tt' looks a bit odd to me, maybe cause the crossbar looks extremely even or just maybe just because both t's are nearly identical? It looks rather 'hat' like, maybe...\n\nThe little swirl on the C made me think Emliy Conner's beautiful fonts:  \n [http://www.myfonts.com/person/Emily\\_Conners/](http://web.archive.org/web/20150419173159/http:/www.myfonts.com/person/Emily_Conners/ \"http://www.myfonts.com/person/Emily\\_Conners/\")\n\n"
    },
    {
      "time": "16 May 2013 — 3:43pm",
      "content": "Thanks for the advice Special-K, you're the first to mention it.\n\nHere are the two final variations, I wanted to see what you guys think. The client has selected one of them.\n\n![](http://web.archive.org/web/20150419173159im_/http:/i41.tinypic.com/2wf0g0j.jpg)\n\n![](http://web.archive.org/web/20150419173159im_/http:/i39.tinypic.com/2vaxs38.jpg)\n\n"
    },
    {
      "time": "20 May 2013 — 6:53am",
      "content": "I would go for option A\n\nBut I still think there is room for improvement.\n\n"
    },
    {
      "time": "23 May 2013 — 2:35pm",
      "content": "Shoot it at me Tim, I'd still like to hear what you think.\n\n"
    },
    {
      "time": "23 May 2013 — 3:04pm",
      "content": "Maybe this is coming too late, but...  \nCall me too literal, but I find it a little disjunctive that the illustration under Red Courgette is neither red nor a courgette (squash, anyway). This calls to mind the [Rene Magritte paintings with handwritten labels that don't describe the picture above](http://web.archive.org/web/20150419173159/http:/25.media.tumblr.com/tumblr_lmect8Dac41qb2uy7o1_400.jpg).  \nI also dislike the font pairing. The charming hand-done quality of the brand name makes the italic of the tagline seem clunky and false. That tagline font says \"hand-crafted\" but it doesn't \\*say\\* hand-crafted--know what I mean? I would either try the tagline in the same lettering style as the brand, or go with a typeface that contrasts more clearly (not an italic or script face).  \nThe style of the wordmark and of the illustration are attractive and fitting for the message, I think.\n\n"
    }
  ]
}
