{
  "id": "102500",
  "title": "Drop caps for words or sentences",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all\n\nI'm trying to track down a technical typographic term, that I hope one of you lovely people might be able to help me with.\n\nI'm wondering if there is a term for when the first word, or multiple words, in typeset paragraph are set in a different font. I'm thinking like a drop cap, but rather than just the first letter, the whole word.\n\nAny help gratefully received.\n\nThanks  \nDan\n\n",
  "author": "djprescott",
  "time": "24 Apr 2013 — 3:49am",
  "uid": "63284",
  "comments": [
    {
      "time": "24 Apr 2013 — 4:31am",
      "content": "Are you talking about a _run-in_?\n\n![](http://web.archive.org/web/20150312080606im_/http:/f.cl.ly/items/0x1F0K0o0M2F1h3Q3V1t/Image%202013-04-24%20at%207.26.26%20AM.png)\n\nSpecifically \"IN THIS FULL-DAY\"?\n\n"
    },
    {
      "time": "24 Apr 2013 — 4:30am",
      "content": "Hi Chirs  \nYes! That's what I'm talking about.\n\n"
    },
    {
      "time": "24 Apr 2013 — 4:32am",
      "content": "It's called a _run-in_ which uses small caps.\n\n"
    },
    {
      "time": "24 Apr 2013 — 4:32am",
      "content": "Excellent! Many thanks indeed for your knowledge.\n\nCan I ask, would this term also apply if this text was in a different typeface?\n\n"
    },
    {
      "time": "24 Apr 2013 — 4:39am",
      "content": "Perhaps others could correct me on this but a _run-in_ is a group or entire first-line of words of a paragraph that are set in small caps. Whether that term becomes void by using a different face, well, I wouldn't think so (as long as you're using small caps). Then again, I'm not sure why you would want to do that.\n\n"
    },
    {
      "time": "24 Apr 2013 — 4:40am",
      "content": "Again, many thanks. Just what I needed to know!  \nAll best  \nDan\n\n"
    },
    {
      "time": "24 Apr 2013 — 5:13am",
      "content": "I don't know of a single term(s) to specify this. You need to spell it out, as in\n\n\"First line sets in 14-point full caps.\"\n\nOr whatever the specific details.\n\nIn books before the 19th century, you sometimes saw chapter openings where the first line would be set in, say, 16 point, the next in 15 point, then next in 14 point, etc.,\n\nShowing off how many fonts one had, I suppose. Embellishment always depends on what you have to hand, and the climate. If it's hot outside & minimal clothing is in order, you paint your face. If you need a lot of clothing to stay warm, embroidery works just fine.\n\n"
    },
    {
      "time": "24 Apr 2013 — 9:55am",
      "content": "SIDE HEAD is a term I’ve seen used for this, and used myself.\n\nThese days, small caps isn’t a different font, so perhaps one should say _a different style_, because that’s how the effect is generally handled, not with a different font—although I am quite partial to Bold U&lc side heads.\n\n"
    },
    {
      "time": "25 Apr 2013 — 1:20pm",
      "content": "I sometimes use a bold sans serif font on the lead-in to a paragraph of regular serifed text. Usually the lead-in is a single phrase, like “I sometime use”. Sometimes I use a larger size than the normal text size if the phrase merits it and if the typographical context is such that the reader can benefit from a strong cue to where the actual text begins. The bold visual cue captures the eye and draws it in. The dutch word for these kind of cueing device is _blikvanger_.\n\nSmall caps are also good, especially after an initial drop-cap.\n\nI try to break the lead-ins off according to sense, so if the first sentence started “Usually the lead-in is a single phrase,” I wouldn’t end the lead-in after the word “the,” but after “lead-in,” or after “Usually.”\n\n"
    },
    {
      "time": "24 Apr 2013 — 8:01pm",
      "content": "Nick, I wouldn't term this a side head -- unless it is self-contained. A lot of time, C-level heads are run in, text to follow after a space, often am em-space.\n\nI sometimes use a first-few-words in a \\*something\\* setting following a spacebreak. It is always awkward when a spacebreak falls at the foot or head of a page, and if it is just a blank line with no ornament, you need to signal it somehow.\n\nWhen this is done, or with the \"lead-in\" example above, the text designer has to mark the words to be so set. And then sometimes argue it out with an editor, who may have different ideas... If it is an entire first line, as can be used with a chapter opening, you can leave it to the typesetter.\n\nBut I still don't know of a technical term that covers all instances of the technique.\n\n"
    },
    {
      "time": "24 Apr 2013 — 11:06pm",
      "content": "What about when the entire first word or a few words is actually dropped several lines deep, like a drop cap? (That's what I thought the OP meant.) This is something that InDesign makes far easier than it should be, considering how rarely it's a good design idea.\n\nIs there a traditional name for that?\n\n"
    },
    {
      "time": "25 Apr 2013 — 11:23am",
      "content": "I just call them -- 'them' being all kinds of various ways of setting the first line -- openings or opening lines.\n\n"
    },
    {
      "time": "26 Apr 2013 — 6:22am",
      "content": "A run-in sidehead is distinct from the text, although it runs on the same line as the text&nbsp;it remains a heading.\n\n“Neoclassical birdbaths and effigies of liveried slaves, stable boys and faded pink flamingoes all have counterparts in the typographic world” as Bringhurst puts it. By the way he also avoids giving it a name.\n\nI vote for a faded pink flamingo.\n\nTim\n\n"
    },
    {
      "time": "31 May 2013 — 3:02am",
      "content": "I have never had recourse to my old (1932) edition of _What a Compositor Should Know_ as since I started looking at this site. The author—a W. H. Slater—is dogmatically insistent on so many things, I felt sure he would have the last word on this.\n\nIn his chapter on Bookwork he deals at length with almost every imaginable circumstance and even, \"so that every statement made hereafter should be based on something tangible\", details that his remarks refer specifically to a \". . . demy 8vo volume with a measure of 22 picas wide by 40 picas deep set in 10pt old style solid.\" Mr Slater is insistent that chapter numbers, for example, should be in \"caps of text or one size larger roman numerals\" and that this \". . . rarely changes, except in a schoolbook for young children when a display letter might be used. . . always capital and same body as text.\"\n\nAlthough he uses the _faded pink flamingo_ in his own book he completely fails to inform the compositor as to the rights and wrongs of its use or even to name it.\n\nMr Slater sir, you disappoint me.\n\n"
    }
  ]
}
