{
  "id": "10267",
  "title": "Bembo Book",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "So, has anyone had a chance to test the new [Bembo Book](http://web.archive.org/web/20100723160126/http:/monotype.co.uk/bemboAMT/) from Monotype? (I wish Fonts.com would provide PDF samples, but the UK site does have one.)   \n   \nIf you have, can you say if the alternate (short-leg) cap R is included? The short-leg variant seems to be in the small caps only. That would be a shame.\n\n",
  "author": "<a href=\"/web/20100723160126/http://typophile.com/user/2663\" title=\"View user profile.\">speter</a>",
  "time": "<br>",
  "uid": "2663",
  "comments": [
    {
      "time": "",
      "content": "I can't answer the question. But would someone with a really good printer have a look at the PDF and tell me if the spacing looks right? To my eyes it's rather uneven; but I don't know enough to say whether it's avoidably uneven. Superficially, it looks like they're kerning some combinations rather hard, and leaving others very loose. Or are they deliberately avoiding any kerning at all so that the spacing is \"as good as metal would be, but no better\"? If so, is this a good idea? (And I'm not sure anyway: compare \"ve\" and \"ev\"; and the uc/lc combinations are definitely and rather tightly kerned.) But maybe it's just my eyesight or my printer anyway.   \n   \nApart from alternate R, I wonder whether we have ff ligatures?\n\n"
    },
    {
      "time": "",
      "content": "Paul: did you by any chance print from a Mac OS X computer to a PostScript printer? If so, does the stem of the 'i' appear significantly shorter than that of the 'n'? Perhaps you're tripping across a bug in xpdf, which Apple licenses to do PDF to PostScript conversion.   \n   \nIn any case, the 'v' appears to drift slightly to the right in \"achieved\", so I agree that the spacing is imperfect, but it's much worse in the buggy version.\n\n"
    },
    {
      "time": "",
      "content": "Not for the first time, I wonder if people interested in digital fonts ever actually print books? If they did, they'd be using metal Bembo!   \nDigital is for pikers!   \n   \nThat said, Robin appears to have supplied at last a correctly designed Bembo from Monotype. There have been excellent digitizations before: Berthold's, which had no f ligs, and Scangraphic's (on which Volker Küster worked) which had incorrect f ligs. Bembo without five f ligs is not Bembo. Word shapes simply aren't correct without them. I have no doubt that this Bembo supplies them.   \n   \nThe important issue here is that the forms are more or less correct. The question is the degree of interpolability with the bold? Stem width of metal Bembo varies tremendously, according to how deep or wet the impression is, and all varieties are welcome in metal. We need this freedom in digital as well.   \n   \nMy only criticism is that Robin appears to have missed the chance to correct one of metal text size Bembo's faults, which is that the stem of a seems to veer too far to the left. It needs just a slight adjustment to correct. On the other hand, it doesn't really seem to be important, does it? More beautiful books have been printed in metal Bembo in the last 80 years than any other font.   \n   \nConsider too that in metal, distance between letters will be the same no matter what the impression is, yet spacing will appear to be considerably tighter with a heavy impression, since ink spread decreases the spaces between letters substantially.   \n   \nSo you have a kind of variable spacing built into metal.   \n   \nStill, no matter what you do, there is no beating metal Bembo. Nothing else comes close.   \n   \nNow all we need is a display size, and a small text size.\n\n"
    },
    {
      "time": "",
      "content": "The particular versatility you're ascribing to metal here is a bit misleading; the adjustment benefits you mention (like tighter spacing though intentional gain) come at the expense of certain things, like letterform fidelity/quality, impression pressure \"modesty\", etc.   \n   \nBTW, Stamperia Valdonega has a Bembo (along with a dozen or so other \"classic\" -read moldy- fonts) at multiple optical sizes. However, all their stuff is for \"internal\" use only: you can request their use when you have a book printed with them, but you can't use the fonts yourself.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "I always loved Bembo, the metal of course. And I used Spectrum often, one of Jan van Krimpen's very best designs. The italic is especially lovely. I am quite reluctant to use great designs like this in digital form. If it ain't letterpress, well it just isn't.\n\n"
    },
    {
      "time": "",
      "content": "speaking of Bembo, what are the book designers at Knopf up to thesedays?? I was about to buy the latest novel \"Never Let Me Go\" by Kazuo Ishiguro in Harback, but when I looked at the typeface I couldnt buy it. They say at the back of the book the typeface is a \"variation\" on Bembo, (a note on the type). Hmmm quite the variation. Amazon does not allow \"look inside\" on this book yet but if you see it in your local bookstore take a look..\n\n"
    },
    {
      "time": "",
      "content": "I have always preferred letterpress for books.   \nMuch of the time, I buy old books printed letterpress, just because.   \nIf musicians can still consider a Stradivarius or a Steinway to be the state of the art (as much as a Stratocaster), it would be nice to see more premium books, where the money is presently invested in fancy cover effects of embossing, foil, etc., pay more attention to the reading experience and offer the \"Strad\" of type, Bembo, and others such as Janson, Electra, Caledonia (reminds me of a recent thread on '40s type....) in letterpress.   \n   \nThe quality of book letterpress is a constant inspiration to try and do something as good in digital font design. Different is no problem. High res on coated stock, no problem. Newspaper fonts, no problem. But quality letterpress book publishing is the one to beat.\n\n"
    },
    {
      "time": "",
      "content": "A report from the front; partly subjective.   \n   \nTo report on what can be objectively verified: Yes Bembo Book does have alternate R, and two alternate Qs, and all the ff ligatures it needs.   \n   \nTo report on how it does (treating it as intended to come as close as possible to well-set metal Bembo), it seems pretty good. It is certainly much better than the previous digital version which was truly yucky. I have a few doubts: I remain (even after trying it on another and better printer) not totally convinced about the spacing in some respects. There also seem to me to be a few letters which aren't quite right: for instance, the \"s\" seems a fraction short, while \"u\" seems a fraction high, which makes \"us\" combinations a little uncomfortable. But it may be my imagination and I may be looking too closely. I've checked it against a good metal sample, and I think at least some of these features were present in the metal type as well ... and no-one complained.   \n   \nBut the form is definitely an improvement on the previous digital version. As to colour, it's hard to judge. Certainly, I think, darker than the current digital version (which must be good). Whether it's right it's hard to say (and anyway, that depends I think on how and how well it ends up being printed, as well as personal taste; I have a personal vice for dark type).   \n   \nNo-one's going to force anybody to use digital Bembo. Those who prefer metal can stick to metal, and can justly claim that it has some merits offset printed digital type will always lack. Those who have a rooted antipathy to facsimiles of old designs can use newer designs. I have sympathy with both views. For my part I think a decent digital Bembo would be a Good Thing. At least it might drive out the horrible current/original digital version, which really was a travesty of the metal face. But I'll need to spend much more time with it and see some properly printed before I know if this fits the bill.\n\n"
    },
    {
      "time": "",
      "content": "It's interesting this topic came up, because at my library yesterday I was going through books trying to find books printed in metal Centaur to see what it was like. I had read the Alchemist in digital Centaur, and I could see Bringhurst's point about it looking weak and frail and all that. Finally I did find a largish book with a proportionately large font, maybe 16pt, set in metal Centaur. Its page numbers and headings were set in vermillion instead of black. It was simply stunning! I had thought it a bit much when Bringhurst describes letterpress as being `self-illuminating' or something, but really this page did have a glow, even more than usual. Even though the paper itself was not bright, the page was somehow illuminated and felt subjectively very bright. I was supposed to be studying, but I found myself reading several pages of it ...   \n   \nAlthough, I do not find this is the case with all fonts. For example, Baskerville's precise, fine features seem much better suited to offset (am I crazy?). Most philosophy journals are printed this way and they look quite nice. When I saw some older books with metal Baskerville, they seemed relatively inelegant.   \n   \nBut, not having seen this new Bembo printed, there is no question that the metal version is so much lovelier than the old digital one. I always look forward to encountering books set in metal Bembo.\n\n"
    },
    {
      "time": "",
      "content": "You can argue that Baskerville's types only looked good printed by Baskerville on the paper made by Baskerville. You could.\n\n"
    },
    {
      "time": "",
      "content": "I'd love to see one of Baskerville's books, as I'm sure it would change my mind about digital versions; now I just need a few hundred bucks to buy one from Oak Knoll...\n\n"
    },
    {
      "time": "",
      "content": "![Baskerville 1](http://web.archive.org/web/20100723160126im_/http:/www.typophile.com/forums/messages/30/69786.jpg)   \n   \n ![Baskerville 2](http://web.archive.org/web/20100723160126im_/http:/www.typophile.com/forums/messages/30/69787.jpg)   \n   \nSee also [this image](http://web.archive.org/web/20100723160126/http:/www.tiro.com/John/Baskerville-a.jpg): various impressions of the letter a from a single page of Baskerville's edition of _Paradise Lost._\n\n"
    },
    {
      "time": "",
      "content": "Thanks, John! I'll have to take a good look at these, as they seem quite different than either the digital or metal ones I've seen. Do you have many fine books like these?\n\n"
    },
    {
      "time": "",
      "content": "Monotype Baskerville was a wonderful typeface for books, largish size (Baskerville sets relatively wide). 'New Baskerville' is weak by comparison. I haven't seen Storm's John Baskerville in action.\n\n"
    },
    {
      "time": "",
      "content": "_Do you have many fine books like these?_   \n   \nI don't have many books printed by the great names of the past like Baskerville: I mainly collect grammars and books about non-Latin writing systems, especially palaeography. I picked up four Baskerville volumes cheaply, because the bindings were damaged and two of the books were part of a set missing the third part. I'm going to keep the two Miltons and have the bindings repaired, but I'm intending to donate the two odd volumes to the ATypI fundraising auction.   \n   \nOf the digital Baskervilles, Storm's looks the most promising to me. In a similar neo-classical genre, but with more French influences, there is [Plantagenet Novus](http://web.archive.org/web/20100723160126/http:/www.tiro.com/Plantagenet/plantagenet_index3.html). [Note that this webpage is preliminary, so some links are inactive and struck out.]\n\n"
    },
    {
      "time": "",
      "content": "If you ever come across copies of Fortune magazine from the 1930s, its text is Baskerville, just about solid leading. The middle of the mag is printed on a thick uncoated stock, and the ends (where the ads mainly are) are on very glossy coated. Same type, hugely different impression. And the heads in Baskerville too. All letterpress, of course. I'm not sure who the art director of the original design was, but it may have been TM Clelland.\n\n"
    },
    {
      "time": "",
      "content": "\"Consider too that in metal, distance between letters will be the same no matter what the impression is, yet spacing will appear to be considerably tighter with a heavy impression, since ink spread decreases the spaces between letters substantially.   \n   \nSo you have a kind of variable spacing built into metal.\"   \n   \n   \n   \nThis is nonsense.\n\n"
    },
    {
      "time": "",
      "content": "\\>This is nonsense.   \n   \nReally, Gerald? Could you explain why?   \n   \nOr are you having trouble understanding the phenomenom of ink spread?   \n   \nIn that case, let me explain.   \n   \nYou have a line of type 4 inches long.   \n   \nIf you press it lightly into the paper and ink it lightly, there will not be a lot of ink spread, and the spaces between letters will be large. If you press it heavily into the paper, and ink it generously, the spaces between the letters will be correspondingly small because of ink spread.   \n   \nInk spread may easily add as much as 30% to the density of letterpress fonts, when considering a light versus a heavy impression. Now, consider 30% bleed from both sides of two letters. Where in the light impression, there is a visible space between the letters, in the heavy impression, the letters may often now appear to be touching.   \n   \nHowever, the physical position of the letters has not changed.   \n   \nIs that difficult to understand?\n\n"
    },
    {
      "time": "",
      "content": "Nick, re Fortune's design, I vaguely recall there is something about that in Marcia Davenport's memoir, c. 1969, 'Too Strong for Fantasy'.\n\n"
    },
    {
      "time": "",
      "content": "Bill, just in case you are unaware: Gerald Lange is a letterpress printer and, from what I've heard, a good one. So I doubt very much if he has 'trouble understanding the phenomenom of ink spread'.   \n   \nMost letterpress printers to whom I've spoken see ink spread as a result of overinking and too much pressure -- i.e. as errors, and poor printing -- not as a kind of 'variable spacing' feature. Can you really say that you are adjusting the apparent spacing of letters if, in the process, you are completely changing or obscuring the identity of those letters?   \n   \n   \n[As an aside, I used to have one of the old Chiswick Press books from first years of the 20th Century, and marvelled that they were responsible for the revival of interest in Caslon's types, because they printed them so heavily overinked on thick rag that the type was almost unrecognisable. This was an example of deliberate overinking, but their aim was not to tighten the spacing, it was to make Caslon look a black as a William Morris face, because that's what 'fine printing' meant in 1903.]   \n   \n   \nPS. Bill, did you see the response from Greg Hitchcock to the 'Visual Communication' thread, explaining the stem width variation?\n\n"
    },
    {
      "time": "",
      "content": "Bill   \n   \nThank you for your explanation. However, I am somewhat familiar with the letterpress process. (I have been a practicing fine press printer-publisher for near thirty years now...   \n [http://BielerPress.blogspot.com](http://web.archive.org/web/20100723160126/http:/bielerpress.blogspot.com/)   \n   \n   \nInk spread is more the consequence of accumulated ink gain than it is impression. While a poor combination of the two will result in very pronounced ink spread it is quite possible to use a heavy impression with a light ink lay and have printed letterforms with no appreciable gain in their appearance. Conversely, a very light impression can have ink spread simply because the ink lay is too heavy.   \n   \nI can alter the thinness/thickness of the letterforms that I print on my laser printer by adjusting the toner density. Does this mean that digital type has built-in variable spacing? Of course not.\n\n"
    },
    {
      "time": "",
      "content": "Gerald and John,   \n   \nall I am trying to point out here is that the apparent spacing of a letterpress font varies \\_tremendously\\_ according to the method by which it is printed. This undeniably constitutes a feature of letterpress printing. It would be superfluous to add that where 'spacing is tightened' by overinking, there is also a kind of automatic bolding. I don't see why this should be in the least controversial.   \n   \nLetterpress comes in countless variations. There is no right or wrong. Sloppy, overinked 17th century French presswork can be just as impressive and rewarding as the cleanest work of Baskerville or the Didots. It is just plain silly to criticize sloppy overinking when the results are nevertheless stunning.   \n   \nGerald, although altering dot gain in a laser printer or an imagesetter can have useful effects, this does not come anywhere close to what can be achieved in letterpress. The lightest kiss impression on coated paper will have insignificant ink spread, but the same line of type printed wet can easily gain 30% density all round and still be within aesthetically acceptable boundaries. It is all a matter of taste and the demands of the moment. All I wish to point out is that there is a particular kind of flexibility in metal which does not correspondingly exist in digital offset printing. Would that it did!   \n   \nI believe this is a silly semantical argument. Where are we ever going to get when every syllable is assumed to contain only its most literal meaning? That would correspond I suppose to a creationist view.   \n   \nJohn, I am mulling over what Greg had to say and the whole issue of variable stems on screen. One thing I have discovered is that on screens of lesser quality than those Dell 1920s, all type, including CT XP, can look rather worse than I thought it could. One is spoilt when one automatically buys the best screen available, because one is no longer in touch with what ordinary people are using. That said, I think new technology should probably be designed with the equipment of two years in the future in mind, rather than the equipment of two years in the past. Well, that's debateable, but at least as far as CT is concerned I think a forward compatibility rather than a backward compatibility view makes sense. An enormous amount of software seems to have flourished by being built such that only the fastest of today's machines could possibly use it. I will post some letterpress inspired thoughts on stem width variability in the thread you mentioned.\n\n"
    },
    {
      "time": "",
      "content": "I haven't looked at the new Bembo, but if it is thicker than the previous digital Bembo it is likely not that useful for letterpress (unless reconfigured with a font-editing program), which for some reason has gotten into this thread.   \n   \nThe orginal metal Bembo wasn't that great of a face technically as its design was a bit weak. Crossbars on lower case e's tended to disappear quite quickly. We were constantly ordering new sorts. Monotype, I think it should be pointed out, was never meant to be editioned with. It was initially simply a compositional strategy. Most early Monotype was printed via the stereotype process.   \n   \nThe photopolymer process, now often used in letterpress, provides a different structural relief, so the older digital Bembo actually performs better than the metal (with configuration) with this process.\n\n"
    },
    {
      "time": "",
      "content": "I'm sorry, Gerald, but I simply cannot agree with this outrageous statement. If you are saying (and who knows, perhaps you are not?) that Monotype digital Bembo 1 (to distinguish it from the new Bembo Book) performs better, printed with photopolymer, than letterpress Bembo, then there is something drastically wrong with either your eyes or your aesthetics. Digital Bembo is a bastardized short descender variant design that has no functional equivalent in fine letterpress, no matter how it is printed. The design is so fatally flawed that no presswork or technique could possibly redeem it. Digital Bembo simply isn't Bembo (as I discovered in 1996 when Monotype sent me some scans of printouts that were used as the basis for DB; I was then working on a project to redesign DB which got as far as A-z for a 60 point master; I would also point out that prints for the 60 point were supplied to me by Ross Mills, not by Monotype). However, possibly I have misunderstood you?   \n   \nOn the other hand, Bembo Book does have the correct proportions, more or less, for text work. It is said that the drawings for Bembo are uniform from 10 points to 18 or 24, or so. That may well be. However, if you look at the actual types in that size range, especially 10, 11 and 12, it is clear at once that one is looking at substantially different types with substantially different optical effects. Clearly, in the actual types, substantial modifications of the drawings were made.   \n   \nHowever, that is quite beside the large point, which is that Digital Bembo is an atrocious design, neither fish nor fowl, that is not well-optimized for any size. Were it heavier, and more widely spaced, it might be acceptable in the 6 to 8 point range, but as sold, it is much too weak and too tightly spaced for those sizes and has no practical benefit. It is a poor 8 point design falsely optimized for 12 points, much like the original Adobe Garamond is a larger design falsely optimized for 12 points - an issue that will of course have been addressed in the new Garamond.   \n   \nIf you are not, however, referring to Monotype's Digital Bembo, then the situation is different. Both the Scangraphic versions (there are two) and the Berthold versions are more or less correctly drawn. However, in both those cases, correct f-ligatures without which Bembo is not Bembo, need to be supplied. I cannot think of a typeface where correct ligature support is more important than in Bembo. I hate to use the odious word, but it really is a valid bouma issue, though there is no need of Dr Bouma or his lately constituted coterie to describe it or validate it.   \n   \nAnd by the way, can I ask why you consider it inappropriate that 'letterpress has somehow gotten into this thread' ? Do you consider that a discussion of a new digital Bembo that was explicitly designed to mimic letterpress Bembo should not include some discussion of letterpress? Even if that were not the design brief, how can any discussion of Bembo not include reference to letterpress?   \n   \nFinally, one of the great optical features of text size letterpress Bembo (and text size letterpress Garamond) is the accretion of ink in the ball section of the f and the f ligatures. Digital designers, it seems, can never bear to duplicate this essential effect. It seems reasonably clear that Bembo Book does not get this feature quite where I would want it, but after all, it's easy enough to edit in.   \n   \n\\>We were constantly ordering new sorts.   \n   \nIl faut souffrir pour etre belle, non?\n\n"
    },
    {
      "time": "",
      "content": "\"Il faut souffrir pour etre belle, non\"   \n   \nYes, it is. :\n\n"
    },
    {
      "time": "",
      "content": "I have never printed letterpress from photopolymer plates. But GL may well be right that the fractional extra darkness of Bembo Book will cause problems. Indeed, I find that at 10pt (on a decent laser printer) the eye (is that the right word?) of the e, which is very small and high and fine is already getting troublesome. So to that extent the new digital version faithfully mimics a fault of the original.   \n   \nBut, to be fair to the design, it is squarely aimed at \"flat\" printing methods. The only thing that worries me now is what one would do if one needed it at small sizes (say 9pt) not impossible for footnotes and suchlike in academic work where Bembo proved itself repeatedly in the mid-20th century. I'm not sure Bembo Book will work well so small (it seems to me to work best in the 11-18 pt range, frankly): Original MT Digital Bembo, however, though it has the right form, will not have good colour at that size. So it's back (I'm afraid) to the optical sizing problem again, which seems especially acute in text typefaces with relatively small x-heights.\n\n"
    },
    {
      "time": "",
      "content": "There. You have summarized in remarkably few words and with incredible clarity the entire range of problems in digital type as applied to fine printing. As I think I have argued with Gerald before, the problem with photopol vis a vis letterpress is not, in the first place, the deficiencies of photopol, such as they may be. The primary deficiency is the vaccum of size-optimized types digital types. That said, there is now, in the entire digital universe, a single family which contains some correctly size-optimized types, namely Stone's Cycles. The primary goal of this family is obviously not to be ideal for photopol printing but, Gerald, have you tried them? Do they work with photopol? And regarding the darkness of Bembo Book and photopol, it would be interesting to know if it would come out darker than, say, the Bembo in Talley of Types, which I remember as too dark.   \n   \nThe glory of letterpress is that the types were optimized by large teams of experts to work as best as possible for the printing machines of the day. The only problem with photopol is that nobody is out there optimizing type for these deserving workers. Why isn't this happening?   \n   \nIt is easy enough to say that the problem is money, but if that is so, where is the patronage? Why doesn't someone organize a foundation to provide future support for modern letterpress printing techniques?\n\n"
    },
    {
      "time": "",
      "content": "\\>size-optimized   \n   \nSize isn't the only \"dimension\" to the phenomenon. The quality of paper stock, and the quality of the press(work) have something to do with it also.   \n   \nAn art director may specify a type for use at a size \"larger\" than its initial design would suggest, if legibility conditions are less than optimum. Printing in color or on colored stock, for instance.   \n   \n\\>as best as possible for the printing machines of the day   \n   \nBy the same token, with a high res digital workflow, printing offset on coated stock, a typeface like ITC Garamond Light Condensed works beautifully at small sizes, especially in catalogue work.   \n   \n\\>nobody is out there optimizing type   \n   \nFont Bureau's Poynter Old Style offers a range of weights for different press conditions, but may they not also be considered as size-specific variants?   \n   \n\\>The glory of letterpress is that the types were optimized by large teams of experts   \n   \nSurely this division of labor only occurred after LB Benton's pantograph (1880s)? Prior to that, letterpress type manufacture was in the hands of the designer-punchcutter.\n\n"
    },
    {
      "time": "",
      "content": "\\>Font Bureau's Poynter Old Style offers a range of weights for different press conditions, but may they not also be considered as size-specific variants?   \n   \nActually, POS is only one of many, many FB fonts that come in a variety of optical sizes. But Cycles remains the only family where optimization is taken out of the general realm and placed into the particular realm - which is the only way to do it right, although it means a phenomenal amount of work for the designer and is hardly economically rewarding. Only Sumner Stone has been willing to put this amount of time into contemporary design. Howes's Caslon is an attempt to get something like this going, but ... although it points the way, cannot be considered a usable type. Justin simply didn't know enough about type to do it right, in the time he had.   \n   \n\\> especially in catalogue work   \n   \nBingo: ITC Garamond is one of the most useful printing types and a wide variety of optical sizes can be effectively faked by skillful use of the existing MM from Adobe. As I have said a million times, if only it hadn't been called Garamond, a million more people would be using it.   \n   \n\\>Surely this division of labor only occurred after LB Benton's pantograph (1880s)? Prior to that, letterpress type manufacture was in the hands of the designer-punchcutter.   \n   \nNot really. The drawing rooms came about as a result of the fierce composition between Lino and Mono. It simply was necessary to get better results than any one person could achieve. The great success of both companies funded the drawing rooms.   \n   \nATF was comparatively unsuccessful. It did not have those dozens of drawing girls drawing away (and probably deserving considerably more credit than they got - the question who really designed Bembo has never been satisfactorily answered). Moreover, although ATF size optimizations were nearly as good as Mono/Lino's, a skilled Pantograph operator did not need multiple drawings to make a range of size-optimized types. Mac McGrew has often told me how Benton would work from a single master drawing and make minute adjustments directly on the pantograph to accomplish the necessary optical adjustments. Some of these adjustments are recorded in existing ATF data sheets but nobody seems to know how to decrypt them. To give but one example, there is only one set of drawings for the typeface Benton (they now exist at the Smithsonian which kindly copied the huge italic drawings for Mac and me). All the adjustments necessary for small text up to display were made directly on the Pantograph.   \n   \nBut there was only one Benton!\n\n"
    },
    {
      "time": "",
      "content": "_All the adjustments necessary for small text up to display were made directly on the Pantograph._   \n   \nNot all, I think. At the 1996 ATypI in the Hague, Mike Parker discussed finding intermediate drawings for a few letters at the Smithsonian. But I can't remember if these were guide letters (e.g. _h_) that established the norms of ascender, x-height and stem weight for a size, or tricky letters such as the _s,_ that might have been too difficult to adjust directly on the pantograph.\n\n"
    },
    {
      "time": "",
      "content": "I've asked this before, but maybe the fresh blood on this thread can help: are there any copies of ATF cutting slips (data sheets) extant? My study of the Benton optical scaling technology, primarily from scans of the specimen books, could very well fill in the missing pieces of the puzzle. Maybe Mac has some? I haven't been in touch with him directly.\n\n"
    },
    {
      "time": "",
      "content": "\\>Not all, I think.   \n   \nNo, of course not. Did I, as usual, say 'all'? By that I usually mean most.   \n   \n\\>are there any copies of ATF cutting slips (data sheets) extant?   \n   \nI think Mac McGrew has some, though I haven't talked with him in a year or two; he wasn't doing well and was suffering from macular degeneration and is now I think well over 90. The Smithsonian has tons of material, but I doubt it would do you much good.   \n   \nIt is perfectly possible to determine the fitting pretty accurately by measuring prints, and that is probably faster than anything else.   \n   \nIt is usually the case that fitting of nearly any historical font follows well-established rules, so the principal interest is in establishing the values for straights and rounds, and the relationship thereof, and noting any interesting exceptions and overhangs.   \n   \nOne thing to keep in mind: both Mono and Lino suffer from their respective unit systems and ATF does not. Unit restrictions may account for fitting differences between sizes that might at first glance seem counterintuitive in a Mono or Lino face, especially where there is reason to suppose that the master drawings are the same. (Regardless, the master drawing does not necessarily contain every optimization that was in practice made.)   \n   \nI still think Mono and Lino understood great printing better than ATF. There is little in ATF's text range that stands up to the best Lino and Mono designs. However, had the Mono/Lino teams not had their unit restrictions, they could have designed even better type.\n\n"
    },
    {
      "time": "",
      "content": "\\>The drawing rooms came about as a result of the fierce composition between Lino and Mono.   \n   \nPerhaps, but there would have been no drawing rooms without the pantograph (or later, photographic techniques) to enable the division of labor.   \n   \nMy point is that the division of labour in type design is a mainly 20th century phenomenon. Prior to that, type design and initial font manufacture were done by one person. The punchcutter was the designer. (With the exception of l'Imprimerie Royale typeface.)   \n   \nWithin the last 20 years, digital media has made the one-person model practical again, as it was for the first 400+ years of typography. So it's a little facile to diss today's one-man shop, when it has such a pedigree.\n\n"
    },
    {
      "time": "",
      "content": "\\>My point is that the division of labour in type design is a mainly 20th century phenomenon...The punchcutter was the designer. (With the exception of l'Imprimerie Royale typeface.)   \n   \nSorry, Nick - just the opposite. The Romain du Roi is but one of the earlier known examples of teamwork. The more we know about the design of any given historical typeface, the more it appears to be a matter of team work. Bell supervised his punchcutter Richard Austin, the Didots supervised their punchcutters Vafflard and [forgot his name for the mo], William Morris and his followers supervised Prince the punchcutter (at a shilling a letter), and so on.   \n   \nSomeone who is skilled at punchcutting is unlikely to be skilled at fitting, and those skilled at either are unlikely to be very sensitive to design. Punchcutting is a pretty dingy job, and it appears to have been undertaken primarily by drudges. To speak of a great pedigree for today's one-man shops is a bit of a stretch. Indeed, our one-man shops of today, most of which do not have the resources to build anything beyond fleeting novelty types, could do worse than follow their predecessors in the letterfounding industry, and amalgamate. This is especially true of designers who have not served long apprenticeships or received the comprehensive sort of education that the Dutch system gives and even that not necessarily with the ability to achieve anything of value as lasting as the works of van Krimpen and Hartz. Type is not for egomaniacs, really. Of course it is painful to have another pair of eyes standing over you, criticizing, perhaps, or even taking out of your hands, entirely, the fitting of your beloved design. But the design usually benefits. The more eyes, the better the design.   \n   \nTo return to target, it has never been established that there is any author of the typeface Bembo. Since it is probable that Morison would have grabbed the credit if he possibly could, it is equally obvious that it must have been so collaborative a process that there was general agreement to describe it as a corporate achievement. But it would be nice to know more, and I am fitfully trying to find out.   \n   \nOne thing I'd say is that if you look at the display sizes of Bembo, or the drawings, the design seems much more its period, the late 1920s, than it does of any ancient time. Yet when text is printed by letterpress, many of those features are obliterated, and the type seems to have a more timeless quality.\n\n"
    },
    {
      "time": "",
      "content": "Does anyone know when an Opentype version of Bembo Book will be available? The Typowiki entry for Bembo claims that Opentype is available but as far as I can telling it is only announced as \"coming\" (which has been the case for months).\n\n"
    },
    {
      "time": "",
      "content": "John Downer's [Paperback](http://web.archive.org/web/20100723160126/http:/www.houseind.com/index.php?page=showfont&id=171&subpage=viewfonts) from House Industries is designed specifically for six size ranges. Type Designers (now, again, as in Jenson's time, also 'punchcutters'), not being forced to remake the entire design for each individual size, are examining the most functional size ranges to address in size-specific design.\n\n[Bembo Book](http://web.archive.org/web/20100723160126/http:/www.fonts.com/FindFonts/detail.htm?pid=420699) is available now as OpenType.\n\n"
    },
    {
      "time": "",
      "content": "Great, thanks for the link.\n\n"
    },
    {
      "time": "",
      "content": "\\>Bell supervised his punchcutter Richard Austin\n\nWhat did \"supervised\" entail? Drawings, sketches, or discussion?\n\n"
    },
    {
      "time": "",
      "content": "I agree with the notion that metal type when hit with more impression and more ink with look tigher in the fit. I've found this to be true with the current metal font that I am page proofing. When I pulled the first proof on a sheet of very thin mulberry tissue with a conservative amount of ink I was a little concerned at the openness of the fit. Using the same Potter proofing press I proofed the page on a sheet sheet of 250 GSM Arches Cover. Although the result was more impression that I would normally use, I found it encouraging that the stance of the type appeared to be somewhat tighter.\n\nI've had the full Centaur series for a long time and have always found that it is strengthened and more unified (in my eye) when given a little impression, even if the ink is still on the stingey side. Centaur has always seemed to me to suffer if printed too timidly. I do not ascribe to the \"blast the hell out of it\" approach to impression, but I want to know it didn't come from a copy centre.\n\nThis is just the result I have found and is in no way the opinion of an expert.\n\nIncidentally I don't think that letterpress is an irrelevant subject to appear on this Forum. At present there is a lot of printing being done with photopolymer plate and the trend will most certainly grow.\n\nJim\n\n"
    },
    {
      "time": "",
      "content": "I hadn't realized this thread had a speed bump in July. I'd like to hear more about Jim Rimmer's new font. I always say Jim Rimmer is the guy who designed the font Goudy would have designed had Goudy really been a good type designer. But I am sure Mr Rimmer won't like that.\n\n"
    },
    {
      "time": "",
      "content": "[Speaking of Mr. Rimmer...](http://web.archive.org/web/20100723160126/http:/typophile.com/node/15471)\n\n"
    },
    {
      "time": "",
      "content": "Thanks for that link, Paul. It is really nice to see P22 paying some attention to Jim Rimmer. I first found out about Rimmer in 1994 from the redoubtable Jeff Level (then at Monotype), who was using Albertan for a lot of his personal design work. Because of his humility and modesty, Rimmer has never had the mindshare he deserves. Yet he is one of the very best type designers living today.\n\n"
    },
    {
      "time": "",
      "content": "Bembo used to be one of my favorite typefaces. But it just doesn't do it for me anymore. What do I know?! ::shrug:: I'm in advertising! ::wink::\n\n"
    },
    {
      "time": "",
      "content": "Funny how in parts of the world people are discussing how to   \nget people to read e-books and in other parts of the   \nworld people are talking about how to preserve metal type.   \n   \nLong live the printed page!   \n   \n(It was really refreshing at FlashForward to hear the panel of Flash   \nexperts extol the virtues of pencil and paper in the design process.)\n\n"
    }
  ]
}
