{
  "id": "102685",
  "title": "Announcing HWT Unit Gothic- a wood type font system in 7 widths from the Hamilton Wood Type Foundry",
  "forum": "Home",
  "tags": [
    "decorative",
    "gothic",
    "hamilton",
    "News",
    "posters",
    "sans-serif"
  ],
  "content": " ![](http://web.archive.org/web/20150420094020im_/http:/typophile.com/files/Unitgothic_news_5330.gif)\n\nThe Unit Gothic series was released by Hamilton Manufacturing Co. in 1907. This sans serif family features one of the first multi width/weight type 'systems', anticipating the Univers font system by 50 years. This set of 7 fonts was designed to aid in press room efficiency and its incremental variation in widths gave poster printers unprecedented flexibility in fitting copy while using consistently harmonious fonts.\n\nThis HWT release is the first ever digital version of these fonts. Each font contains 600 glyphs including Greek and Cyrillic character sets as well as alternate characters which are based on the actual special character production patterns from the Hamilton Wood Type Museum collection.\n\nThe system features:  \n•HWT Unit Gothic 716 - 50% wider  \n•HWT Unit Gothic 717 - 25% wider  \n•HWT Unit Gothic 718 - (Standard width which others are based on)  \n•HWT Unit Gothic 719 - 25% narrower  \n•HWT Unit Gothic 720 - 50% narrower  \n•HWT Unit Gothic 721 - 62.5% narrower  \n•HWT Unit Gothic 722 - 75% narrower\n\nHWT Unit Gothic digitized by James Todd\n\nDavid Shields has written an essay for Slanted Magazine that gives a closer look at this font system and its place in history. Follow this [link](http://web.archive.org/web/20150420094020/http:/issuu.com/slanted/docs/slanted19?mode=window&pageNumber=59) to read the article online.\n\nView more details about this release on the [Hamilton Wood Type Foundry](http://web.archive.org/web/20150420094020/http:/www.hamiltonwoodtype.com/unit.html) site.\n\nSpecial introductory pricing through May 31, 2013.\n\n",
  "author": "jimy",
  "time": "1 May 2013 — 9:56am",
  "uid": "5133",
  "comments": [

  ]
}
