{
  "id": "102692",
  "title": "New Fonts.com Plan Offers Unlimited Fonts & Typecast",
  "forum": "Home",
  "tags": [
    "font",
    "Fonts.com",
    "monotype",
    "News",
    "Skyfonts",
    "typecast",
    "web fonts"
  ],
  "content": " ![](http://web.archive.org/web/20140713023756im_/http:/typophile.com/files/PR_ImageMasterPlan_edit_4611.png)\n\nRegister for SkyFonts webcast: [http://bit.ly/ZjFbNn](http://web.archive.org/web/20140713023756/http:/bit.ly/ZjFbNn \"http://bit.ly/ZjFbNn\")  \nRead Type First blog post: [http://bit.ly/12Yv7Ok](http://web.archive.org/web/20140713023756/http:/bit.ly/12Yv7Ok \"http://bit.ly/12Yv7Ok\")  \nSign up for Fonts.com Master plan: [http://bit.ly/15YvHyt](http://web.archive.org/web/20140713023756/http:/bit.ly/15YvHyt \"http://bit.ly/15YvHyt\")\n\nMonotype has enhanced its [Fonts.com Web Fonts](http://web.archive.org/web/20140713023756/http:/www.fonts.com/web-fonts) service to provide greater flexibility and choice to creative professionals. The new [Master subscription plan](http://web.archive.org/web/20140713023756/http:/www.fonts.com/web-fonts/master-plan) brings together the company’s Web font solution with unlimited access to more than 7,000 desktop fonts. Combined with Monotype’s [Typecast](http://web.archive.org/web/20140713023756/http:/typecast.com/)™ application for designing with Web fonts in the browser, the master subscription is an industry first that provides a comprehensive solution for working with type throughout the digital and print design processes, bringing unparalleled value to customers.\n\nThe Fonts.com Master subscription plan, which Monotype intends to expand with new features on an ongoing basis, includes:\n\nUnlimited desktop fonts: Customers receive an unlimited download allowance of more than 7,000 traditional “desktop fonts,” while subscribed to the plan including selections from various typeface foundries and the company’s Monotype® Libraries, comprising the Monotype, Linotype®, ITC®, Bitstream® and Ascender® collections. Included are some of the world’s most widely used designs, such as the [Helvetica](http://web.archive.org/web/20140713023756/http:/www.fonts.com/font/linotype/Helvetica)®, [Frutiger](http://web.archive.org/web/20140713023756/http:/www.fonts.com/font/linotype/Frutiger)®, [Trade Gothic](http://web.archive.org/web/20140713023756/http:/www.fonts.com/font/linotype/trade-gothic)® and [Gill Sans](http://web.archive.org/web/20140713023756/http:/www.fonts.com/font/monotype/gill-sans)® typefaces, in addition to a continually expanding selection of new designs.\n\nDesktop fonts are delivered automatically and installed on up to five workstations using Monotype’s patent-pending [SkyFonts](http://web.archive.org/web/20140713023756/http:/www.fonts.com/browse/font-tools/skyfonts)™ technology. SkyFonts runs in the background of Macintosh® or Windows® platforms to activate and deactivate OpenType® fonts downloaded from Fonts.com. Desktop fonts may be used for all purposes that Monotype’s standard desktop end-user license agreement allows.\n\nWeb fonts: Subscribers receive access to more than 20,000 Web fonts, including hundreds of hand-tuned selections that offer exceptional clarity, particularly at small text sizes. Subscribers are entitled to up to 2.5 million Web font page views per month and can add an unlimited number of Web fonts to an unlimited number of websites. Customers may receive additional page view allowances by upgrading to a higher level within the plan.\n\nTypecast: Subscribers receive access to Monotype’s [Typecast](http://web.archive.org/web/20140713023756/http:/typecast.com/) application, a browser-based tool for designing Web pages with Web fonts. Designers are able to combine, compare and style Web fonts quickly without performing screen captures in third-party applications or through hand coding. Users can visually style text directly within the browser, which offers more scope for creative experimentation, better typographic control and a simplified workflow. The Typecast application enables unlimited experimentation with fonts from the Typekit®, Fontdeck®, Webtype™ and Google Fonts services, in addition to Fonts.com Web Fonts.\n\nCustomers may sign up for the Fonts.com Master subscription plan at [www.fonts.com/web-fonts/master-plan](http://web.archive.org/web/20140713023756/http:/www.fonts.com/web-fonts/master-plan \"www.fonts.com/web-fonts/master-plan\"). A live webcast that demonstrates how SkyFonts can be used with the new Fonts.com Web Fonts subscriptions will take place May 3, 2013, at 11:00 a.m. eastern time. Register for the webcast at [http://bit.ly/ZjFbNn](http://web.archive.org/web/20140713023756/http:/bit.ly/ZjFbNn \"http://bit.ly/ZjFbNn\").\n\n",
  "author": "JLH",
  "time": "1 May 2013 — 4:16pm",
  "uid": "30653",
  "comments": [

  ]
}
