{
  "id": "10271",
  "title": "Ascender Corp's licensing of MS web fonts.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Regarding this news item:   \n   \n [http://www.typophile.com/forums/messages/72/69426.html?1113241542](http://web.archive.org/web/20050516054940/http:/www.typophile.com/forums/messages/72/69426.html?1113241542)   \n   \nAnyone know more about that? I'm a bit confused as to what it going on. Is MS no longer bundling these fonts with their OS/Applications? Or is this just an alternative way to obtain the fonts? I'm wondering why MS would even do this...it certainly makes them less appealing as web font options in the future.\n\n",
  "author": "aluminum",
  "time": "Tue, 2005-04-12 09:16",
  "uid": "1461",
  "comments": [
    {
      "time": " Tue, 2005-04-12 09:24",
      "content": "The Web fonts are still being included with Windows and other systems under license.   \n   \nAscender is able to provide Type 1 and OpenType CFF versions to designers and others. They can also provide latest versions to those that need them but don't want to upgrade their OS.   \n   \nThey can also license them to software and hardware makers for inclusion in their products. They can also provide custom versions of the fonts if customers need them.   \n   \nBasic reason for doing this is because Microsoft isn't in the end user font licensing or custom font production business and Ascender is.   \n   \nCheers, Si\n\n"
    },
    {
      "time": " Tue, 2005-04-12 09:28",
      "content": "Ah, I guess that makes sense. Would have been nice for MS to just OS them, but well, OS and MS don't go together, so I guess I don't blame them. ;o)\n\n"
    },
    {
      "time": " Tue, 2005-04-12 11:24",
      "content": "Brilliant idea.   \nWill Ascender be developing family extensions?   \nGeorgia Small Caps?   \nVerdana Light?\n\n"
    },
    {
      "time": " Tue, 2005-04-12 14:38",
      "content": "Nick, from the outset that was one of the ideas we had. There are designers and companies that would love to get access to intermediate weights of Verdana for example. Ascender is free to make these but are not obligated to do so. Under the agreement they have a lot of flexibility. I hope they see demand for these and respond to it.   \n   \nTrue with respect to OSS. But one of our motivations was to restore some perceived value in these fonts, which are seen by a lot of people as having little value. Putting them into the public domain wouldn't have helped this.   \n   \nAlso there's the issue of quality, Ascender are one of the few companies we'd trust to maintain quality in extensions and additions. Tom Rickner for example is quite rightly associated with Verdana and Georgia as he hinted them. I don't think the OSS community has the people and tools needed to maintain that level of quality.   \n   \nCheers, Si\n\n"
    },
    {
      "time": " Wed, 2005-04-13 07:14",
      "content": "\"True with respect to OSS. But one of our motivations was to restore some perceived value in these fonts, which are seen by a lot of people as having little value. Putting them into the public domain wouldn't have helped this.\"   \n   \nJust MHO, but the general populace doesn't put much value in any fonts. For web developers, though, the web fonts MS released were an invaluable contribution to the web. I'm not fan of MS, but once in a while they produce some great stuff, and this was one of them. Going the OS route would have brought a LOT more perceived value to the web development community. (Again, IMHO)   \n   \nGood point about quality, though...granted, the OS license could have had any number of contigencies (like MS retain source code maintenance oversight) or something. Public Domain probably wouldn't have been a good option.\n\n"
    }
  ]
}
