{
  "id": "102727",
  "title": "Anultra Slab & Alight Slab by Schizotype",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Two new slab faces, one light, one ultra bold. [Alight Slab](http://web.archive.org/web/20150414035324/http:/www.myfonts.com/fonts/schizotype/alight-slab/) and [Anultra Slab](http://web.archive.org/web/20150414035324/http:/www.myfonts.com/fonts/schizotype/anultra-slab/) are on offer throughout May when bought together.\n\n ![](http://web.archive.org/web/20150414035324im_/http:/typophile.com/files/ASlabTypophile_3837.png)\n\n",
  "author": "daverowland",
  "time": "2 May 2013 — 6:23pm",
  "uid": "44740",
  "comments": [
    {
      "time": "7 May 2013 — 1:17pm",
      "content": "Dave, these are gorgeous. I love the shadow layer on the slab - very useful!\n\n"
    },
    {
      "time": "7 May 2013 — 5:55pm",
      "content": "Thanks, Joshua! It took a while to make the extrude layer. Fontlab's 3D extrude effect leaves little corners and awkward looking dints on round bits, so I had to do every glyph by hand:\n\n ![](http://web.archive.org/web/20150414035324im_/http:/typophile.com/files/D_6656.png)\n\n"
    },
    {
      "time": "7 May 2013 — 6:23pm",
      "content": "Congrats and good luck Dave. These look great. I do have to say I'm a little uncomfortable with the name Alight Slab, since there's already a well established Alright Sans on the market...\n\n"
    },
    {
      "time": "7 May 2013 — 6:46pm",
      "content": "I did consider the possible confusion, but consoled myself with the fact that even though it's only one letter different, it is a completely different word. There's also another font just called 'Alright' which was released before Alright Sans, so if we get too nitpicky with naming we'll run out of them a lot faster! I checked that spelling mistakes on the MyFonts search wouldn't point the wrong way. Alight Sans as a search doesn't get to mine or Okay Type's fonts, and Alright Slab doesn't find any either, so if Jackson was to make Alright Slab, there shouldn't be any problems with confusion.\n\n"
    },
    {
      "time": "7 May 2013 — 7:28pm",
      "content": "Craig, I think that's a bit too prudish, since \"alight\" is a word, plus the designs aren't much alike. It's hard enough to find a good name!\n\nhhp\n\n"
    },
    {
      "time": "7 May 2013 — 8:08pm",
      "content": "> It's hard enough to find a good name!\n\nHence, me calling a light slab 'Alight Slab'  \nRunning out of ideas!\n\n"
    }
  ]
}
