{
  "id": "102776",
  "title": "Spiral Slicer",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": " ![](http://web.archive.org/web/20140717052427im_/http:/typophile.com/files/Spiral_6736.jpg)\n  \nMy latest acquisition ($1) at the local charity store.  \nThought you might be interested in this lovely and meticulous (to my eyes at any rate!) piece of graphic design.  \nI would date it from the early 1950s.  \nThe “Directions” panel is reminiscent of Lissitzky’s layout for [_The Isms of Art_](http://web.archive.org/web/20140717052427/http:/typophile.com/node/19951).  \n\\_\\_\\_\n\n ![](http://web.archive.org/web/20140717052427im_/http:/typophile.com/files/Spiral_6408.png)\n\n",
  "author": "Nick Shinn",
  "time": "5 May 2013 — 9:16am",
  "uid": "2021",
  "comments": [
    {
      "time": "5 May 2013 — 9:37am",
      "content": "Your date is just about perfect. According to the Popeil story, this about Ron Popeil:\n\n\"He got an early education in the housewares market working weekends in his father's Chicago factory making kitchen products. At 16, Ron began selling Popeil Brothers' \"Spiral Slicers\" and \"Slice-A-Way\" gadgets in street markets. Within a year, the teenager had moved out on his own, hawking Popeil Brothers' products on a flat commission basis at the Woolworth's store in downtown Chicago.\n\nWith his commercials, Popeil has become a pop icon. He created numerous catchphrases, such as \"But wait, there's more,\" \"operators are standing by,\" and \"set it and forget it.\" He was named by Self magazine as one of the 25 people who have changed the way we eat. Popeil was even spoofed on the television show, Saturday Night Live, by actor Dan Aykroyd with an imaginary product called the \"Bass-O-Matic,\" which was supposed to slice and dice fish.\"\n\nAge 16 would be 1951 since he was born in 1935.\n\nAnother source says the original retail price of the slicer was fifty cents.\n\n"
    },
    {
      "time": "5 May 2013 — 10:16am",
      "content": "I think neither the packaging nor the product are well designed, and certainly not meticulous. The typography is clumsy and weirdly inconsistent. Punctuation is used in some place and not in others. The dots between the list of vegetables are different weights, for no conceivable reason. The illustrations are labeled, 'FIG. No. 1' etc., without any reason, since they are not referenced anywhere.\n\nBut all this seems minor compared to the notion that hard vegetables would be effectively or safely cut using a single finger to turn the blade and without any way to hold the vegetable in place other than with your other hand. I really don't recommend trying to use this device if you value your fingers. I've used spiral slicers with table top clamps, proper turning handles, etc. and even then they are seldom easy to operate. Carrots? Really?\n\n"
    },
    {
      "time": "5 May 2013 — 11:07am",
      "content": "Don’t be such a snob, John!\n\nThis is vernacular, ephemeral design, not the sort of thing that’s in design history books, although it could be compared to a Sutnar catalog layout done with similarly limited means.\n\nI haven’t tried the device yet, but my post is about the package.\n\nSure, the reach of the design exceeds its grasp, hence the imperfections in execution, but it’s remarkable for how much layout and content complexity went into such a small package (and is nicely resolved), and that’s what I enjoy about it—and the bright, open, colorful interplay of figure and ground in a two-color job. Perhaps meticulous isn’t quite the right word, but I was attempting to describe the ﬁne level of detail which the layout addresses, more than the execution per se.\n\nNo doubt the designer would have liked to have been able to say to the copywriter, “please write the four paragraphs of Directions to be the same length,” then he wouldn’t have had to struggle with the vertical justification of different leading. But that wouldn’t have been so readable…\n\nAnd of course the angle of the A in SPIRAL isn’t right, but that’s the kind of imperfection which one cherishes in such meat-and-potatoes design, as opposed to the dull consistency of high-end professional slickness.\n\n"
    },
    {
      "time": "5 May 2013 — 11:19am",
      "content": "AWESOME! And that, price 50 cents, on the end flap is nascar-ish :)\n\nThe kerning of MASTER in the gadget master oval thing also has a great deal of charm. And I love the all American color pallet.\n\nI picked up a couple of the first Canadian national fitness records ...the graphics on those are hilarious and awesome at the same time!\n\nWe should start a thread for this kind of goodness.\n\nNice pick for a buck Nick!\n\n"
    },
    {
      "time": "5 May 2013 — 11:34am",
      "content": "I'm not a snob, Nick. If you'd posted this as 'a nice example of vernacular design', I wouldn't have queried your judgement. You described it as 'lovely and meticulous', and the latter word suggested something beyond anything I could see in the object. It might have virtues, but meticulousness isn't one of them. It has been done with remarkably little attention to detail.\n\n"
    },
    {
      "time": "5 May 2013 — 11:40am",
      "content": "One man's meticulousness is another man's mess. \\*shrug\\*\n\n"
    },
    {
      "time": "5 May 2013 — 12:39pm",
      "content": "Oh I don't think so. Meticulousness isn't a subjective aesthetic quality, something over which disagreement is to be expected; it's a word that means extremely careful and precise, and extremely, or even excessively, concerned with details. Which is precisely what I don't see evidence of in this packaging design, whatever its other virtues.\n\nBy the way, there is one aspect of the design that I think is really excellent, and that is the use of the heavy border on three sides of the illustration and instruction panels, to indicate that they should be looked at together. That's smart and elegant, although it makes the labeling of the illustrations even more redundant.\n\n"
    },
    {
      "time": "5 May 2013 — 1:01pm",
      "content": "Absolutely beautiful. Great score Nick. The fact that it is vintage [Popeil](http://web.archive.org/web/20140717052427/https:/www.ronco.com/accessories/food-dehydrator.html) is especially cool. I went through a phase in college where I stayed up late “eating sandwiches” and got really into info-mercials. Ron was always one of my favourites.\n\n"
    },
    {
      "time": "5 May 2013 — 1:09pm",
      "content": "Bah! Don't be a fooli, use a Spirooli.\n\n"
    },
    {
      "time": "5 May 2013 — 2:31pm",
      "content": "\\> The illustrations are labeled, 'FIG. No. 1' etc., without  \n\\> any reason, since they are not referenced anywhere.\n\nI agree it seems odd, but perhaps it originally came with an instruction sheet that referenced them.\n\n"
    },
    {
      "time": "5 May 2013 — 9:38pm",
      "content": "I don't think the how-to FIGs are redundant, the illustrations aren't redundant because of their eye candy info-graphic info-mercial-ness. The wordy descriptions are the pitch.\n\nThe whole package is an info-mercial.\n\n"
    },
    {
      "time": "5 May 2013 — 11:37pm",
      "content": "I didn't say the illustrations were redundant, I said labeling them as 'Fig. No. 1' etc. was pointless and also redundant because their immediate association to the written instructions is obvious.\n\n"
    },
    {
      "time": "6 May 2013 — 4:16am",
      "content": "I love this for it's great production value, and solid use of brush. That it's dangerous, I think is relative perhaps to how much one does with their hands. I saw Phil Esposito demonstrating one of these on TV with Lou Angotti's finger to no ill effect.\n\n"
    },
    {
      "time": "6 May 2013 — 8:27am",
      "content": "I think the labels fig. 1, 2, etc. are to indicate a sequence—what to do first, second, etc.—not for connecting with the related label.\n\n"
    },
    {
      "time": "6 May 2013 — 10:04am",
      "content": "Ah, so 'Step 1', 'Step 2', etc. :)\n\n"
    },
    {
      "time": "6 May 2013 — 10:40am",
      "content": "However, “FIG. No. 1” etc. is very authoritative, the sort of thing one ﬁnds in a technical manual.  \nI think that is the impression of importance being sought.  \nAfter all, this is a rather rudimentary gadget—a blade with a hole for a handle and a screw at the other end—so the busy packaging talks it up.\n\n"
    },
    {
      "time": "6 May 2013 — 12:18pm",
      "content": "Well, yes, that's rather my point. I suppose I have a lingering utopian modernist outlook, inherited from my father, that design should be a functional aid to the user, including revealing truth rather than 'talking up' things that are, frankly, a bit rubbish. BTW, the fact that this is in the original packaging rather suggests that no one ever used the thing, or maybe used it once and found that it didn't work as advertised.\n\nThe problem of a spiral vegetable cutter is an interesting one. Do you turn the blade, or do you turn the vegetable? How do you hold the vegetable in the correct position relative to the blade as it is cut? How do you deal with both soft vegetables such as zucchinis and hard ones such as carrots or yams? Do you rely on human strength or mechanical advantage? It's a significant engineering problem, albeit for a humble end (and seriously, how often does one need spiral cut vegetables?)\n\n"
    },
    {
      "time": "6 May 2013 — 2:05pm",
      "content": "_…the fact that this is in the original packaging rather suggests that no one ever used the thing, or maybe used it once and found that it didn't work as advertised._\n\nThat’s a bit of a generalization.  \nHere’s another recent charity shop purchase from a similar era, the Texan Nut Sheller, also in its original box, which works brilliantly, as demonstrated in this picture:\n\n ![](http://web.archive.org/web/20140717052427im_/http:/typophile.com/files/a7b33e51436c263cc1b655ae53594737_3955.jpg)\n  \nHave yet to try the Spiral Slicer, not really my kind of thing, I was more interested in the package. \n"
    },
    {
      "time": "6 May 2013 — 6:42pm",
      "content": "I have this apple peeler, slicer, corer. It spiral peels and does a spiral slicing of the apple, leaving the core behind. It's a purely hand-driven, mechanical thing, a bit Rube Goldberg looking. It works like a dream if the apple is not too soft or misshapen. Kids go nuts over it, and I like it myself.\n\nApple pie, apple sauce. You need this. I don't think Ron Popiel ever sold it though. Maybe because it's probably 19th century technology—and it works :)\n\n ![](http://web.archive.org/web/20140717052427im_/http:/typophile.com/files/ApplePeelCoreSlice_5941.jpg)\n\nEdit: [Here is a video](http://web.archive.org/web/20140717052427/http:/www.youtube.com/watch?v=O4tpjmOWa-0) of a guy demonstrating it. He says that it's in the top ten on Stephen Fry's 100 greatest gadgets ever. It seems to have been invented in the US in about 1840.\n\n"
    },
    {
      "time": "6 May 2013 — 6:36pm",
      "content": "Antiques and collectables are often worth much more if they come in their original box. In fact the boxes are sometimes worth more than the object they contain, since they are rarer.\n\nThe existence of a box doesn't necessarily mean the object wasn't used. Some folks store items in their boxes, especially if it's an item used only occasionally. I've still got the original boxes for some of my often-used childhood toys.\n\n"
    },
    {
      "time": "6 May 2013 — 7:52pm",
      "content": "\"...How do you deal with both soft vegetables such as zucchinis and hard ones such as carrots or yams?\"\n\nHow much spiral slicing one needs, I dunno. But with this mobile version, one could also drill through an inch of ice, catch, filet and scale a minnow, and then while still holding the screw, cook the minnow filet through the little ring with a few matches.\n\nThat'd be hard with William's desktop version, or even a swiss army knife.\n\n"
    },
    {
      "time": "7 May 2013 — 7:42am",
      "content": "I first saw the apple parer being used at a place called [Mom's Apple Pie](http://web.archive.org/web/20140717052427/http:/www.momsapplepieco.com/), which is a bakery. It blew me away that a. it looked so cool, and b. a commercial outfit would still find a hand cranked piece of machinery the best thing to use today. Why this is perfect for pies is that it cuts your time in half getting the apple slices, and they come out all of uniform thickness, so everything in the pie is finished cooking to the right amount at the same time. You just take the spiral sliced apple, cut it in half vertically, and you have perfect slices that you can fan out in the pie crust.\n\nThere have been 5 or 6 revolutions for more efficiency in the machinery for printing and font production since 1840, when I think the steam-engine driven presses started to be used widely. But this contraption is still the best. Awesome.\n\n"
    }
  ]
}
