{
  "id": "102719",
  "title": "Constantia ends monarch's reign",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'd like to be able to say that my Constantia typeface had brought down the monarchy, but it did at least play a rôle in this week's transfer of royal power in the Netherlands. Here it is used for the gilded names in the official Act of Abdication by which Queen Beatrix ceded the throne to Prince Willem-Alexander. [Click image for full document.]\n\n[\n ![](http://web.archive.org/web/20150417082523im_/http:/typophile.com/files/abdication_4762.png)\n](http://web.archive.org/web/20150417082523/http:/www.nrc.nl/wp-content/uploads/2013/04/ANP-23178448.jpg)\n\nThe document was designed by Jaap Drupsteen, the calligraphy is by Frank Blokland, and the gilding by heraldist Trudie Demoed.\n\n",
  "author": "John Hudson",
  "time": "2 May 2013 — 10:59am",
  "uid": "1262",
  "comments": [
    {
      "time": "2 May 2013 — 11:08am",
      "content": "Nice coup! (Pardon the pun. :-)\n\nActually John you've played a role in _prolonging_ a monarchy, and for that I thank you; even if the Dutch one is mostly ceremonial, it helps people remember.\n\nBTW Frank's calligraphy is so good, it looks like a font! ;-\\>  \n [http://typophile.com/node/102667](http://web.archive.org/web/20150417082523/http:/typophile.com/node/102667 \"http://typophile.com/node/102667\")\n\nhhp\n\n"
    },
    {
      "time": "2 May 2013 — 1:04pm",
      "content": "<cite>BTW Frank's calligraphy is so good, it looks like a font! ;-&gt;</cite>\n\nI really wasn’t sure, I have to admit. If you look at it more closely, you do notice some ‘inconsistencies’ (for instance in the ‘a’ counters in the last line), but I couldn’t decide whether to attribute this to the blurriness of the picture and the camera angle or to the text being handwritten. It’s an admirable piece of craftsmanship in any case, I think.\n\n"
    },
    {
      "time": "3 May 2013 — 4:26am",
      "content": "“Rôle,” John? Not the preëminent orthography of the current age.\n\n"
    },
    {
      "time": "3 May 2013 — 10:39am",
      "content": "I've also been known to be coöperative, but seldom naïve.\n\n"
    },
    {
      "time": "3 May 2013 — 11:16am",
      "content": "Touché.\n\n"
    },
    {
      "time": "3 May 2013 — 11:25am",
      "content": "I've seen \"rôle\" in English - in some of the early books by Edgar Rice Burroughs.\n\n"
    },
    {
      "time": "3 May 2013 — 4:06pm",
      "content": "But how to account for the inconsistencies in /k/ and /K/ on the right page?  \nCompare the final /k/ of Koninkrijk in line 2 and line 3.  \nAnd the /K/ of Koning in the last and the third to last line.  \nDoesn't look like calligraphy to me.\n\n"
    },
    {
      "time": "3 May 2013 — 4:15pm",
      "content": "> Doesn't look like calligraphy to me.\n\nBart, _au contraire_. This does not make it look like a _font_ -- and nor was it intended to. Calligraphy is the art of Writing By Hand.\n\nI consider it a miracle and a tell-tale sign of Frank Blokland's talents that the calligraphy is so extremely _consistent_ in such a long document!\n\n"
    },
    {
      "time": "3 May 2013 — 4:15pm",
      "content": "I wonder if it was \"drafted\" with type. I would guess multi-line center-justified calligraphy would be really labor-intensive to plan out otherwise.\n\n"
    },
    {
      "time": "3 May 2013 — 4:18pm",
      "content": "> I wonder if it was \"drafted\" with type.\n\nAnyone up to comparing the glyph widths with known fonts?\n\n(But I feel this would diminish the quality of Frank's wonderful work ...)\n\n"
    },
    {
      "time": "3 May 2013 — 4:26pm",
      "content": "Oops. I thought the left page was typography! Until I realize that's calligraphy except those in Constantia. Wonderful!\n\n"
    },
    {
      "time": "3 May 2013 — 9:42pm",
      "content": "I wish I could do calligraphy like that, but I still have to wonder: is the purpose of calligraphy to be mistaken for a font? Or do people get a different _feeling_ from actual calligraphy even when they can't consciously tell it's not a font?\n\nPersonally, the better our fonts emulate calligraphy, the more I value stuff like this:  \n [http://www.flickr.com/photos/maltin75/8700285499/](http://web.archive.org/web/20150417082523/http:/www.flickr.com/photos/maltin75/8700285499/ \"http://www.flickr.com/photos/maltin75/8700285499/\")\n\nhhp\n\n"
    },
    {
      "time": "3 May 2013 — 9:25pm",
      "content": "WOW, that calligrapher gots some mad skillz!\n\n"
    },
    {
      "time": "3 May 2013 — 11:08pm",
      "content": "For much of the history of printing, typography has struggled to come close to the quality of formal manuscript production. We tend to forget this, both because we don't spend enough time looking closely at older printed books and because most of us have never handled really top quality manuscripts. The consistency of letterform reproduction that we now associate with typography is a relatively recent phenomenon, the result of photographic plate making and offset lithography. Even a printer of John Baskerville's excellence, with his famous innovations in paper quality and impression, [couldn't produce two identical letters _a_ on the same page.](http://web.archive.org/web/20150417082523/http:/www.tiro.com/John/Baskerville-a.jpg) Printed letters are subject to many variables -- ink consistency and coverage, evenness of pressure, worn sorts, etc. -- while the letters produced by an experienced and practiced scribe are subject only to his skill and the amount of time he spends on the document. Formal scribes have always had the advantage of much better consistency of stroke density from carefully prepared inks, and much sharper, crisper letters on, typically, much higher quality, sized paper, vellum or other substrate. Typography has had the advantage of speed of reproduction and greater efficiency, _not greater consistency._ People who interpret a strongly consistent formal manuscript hand as 'looking like a font' should go and look at samples of such writing from before fonts existed.\n\n"
    },
    {
      "time": "4 May 2013 — 7:33am",
      "content": "I have to say this is very peculiar, John. Typography is fundamentally about consistency; and calligraphy was never about _wasting_ time or money, so it has its own shortcuts that lead to inconsistency. The only reason early typography looked less consistent than _some_ manuscript writing was simply because the technology was lousy at first. Furthermore: inconsistency in paper, ink, etc. applies to calligraphy just as much as it applies to typography; and good (read: consistent) typography also depends on one's skill and the time spent - you can take care to ink properly, you can avoid worn sorts, etc.\n\nBut most of all, sending people who associate good (text) calligraphy with a font (which BTW is virtually everybody) back in time is completely pointless. What isn't pointless is realizing that even on Typophile there are people (including me) who had trouble figuring out this example was calligraphy before Frank spilled the beans.\n\nSomething else: some years ago I took a calligraphy class and the instructor actually explicitly said that the highest compliment we would get is people thinking our work was from a font... Now, I'm not saying my instructor was omniscient, but especially when a professional calligrapher says that, there's something there.\n\nhhp\n\n"
    },
    {
      "time": "4 May 2013 — 11:18am",
      "content": "_Typography is fundamentally about consistency_\n\nI don't think that statement can stand. Typography is fundamentally about efficiency, the fact that one can produce many copies of a text much more quickly by printing from type than one can by copying the text by hand. Consistency has never been a notable feature of typography until quite recently, because of the variables of the printing processes that I described above. You only need to start pulling older books of the shelves and looking at them closely to see just how much variation there is in the impression, in the relative wear of individual sorts, etc. Consistency improves with hot metal typesetting, which avoids the problem of worn sorts, and with rotary presses, but it isn't until photomechanical processes become widespread and letterpress is abandoned that consistency in letterform reproduction becomes quite high, affected mostly by variables in paper quality and presswork.\n\nPerhaps I need to be clear that I don't believe consistency of letterform reproduction is very important, and that it is primarily an aesthetic rather than functional concern, which is why it is a feature of the kind of formal document we're discussing here and of things like Torah scrolls: it is part of what characterises their formal aesthetic. The reason I don't think letterform consistency is functionally very important is that for most of the history of writing and typography it has not been the case, and yet people have happily and immersively read texts produced without such consistency. The evidence suggests that readerability has a fairly generous allowance for variation in the display of individual letters within a text. The period in which letters were consistently reproduced in printing has been quite short; the period in which they were consistently reproduced on screen is also now behind us, thanks to subpixel positioning and antialiasing that, rightly I think, puts a higher premium on consistency of spacing than consistency of letter display.\n\n_inconsistency in paper, ink, etc. applies to calligraphy just as much as it applies to typography_\n\nNote that I was specifically talking about formal scribes producing the kind of document we're talking about in this thread, so sort of thing over which a great deal of practice, planning and time would be spent, and for which as many variables as possible would be eliminated. Now, it would be possible to exact a parallel level of quality using typography and printing -- not the same quality, because the characteristics of type and calligraphy are not identical --, also with practice, planning and time, but there would be no point because the efficiency of typography is in the production of multiple copies, and it seldom makes sense to use type to produce a single copy of a document. It is not only more prestigious to hire a scribe, but also likely to take less time.\n\nI'm not suggesting that you or anyone else 'go back in time', I am pointing out that the confusion that you describe is due to the fact that most people have very little experience of formal manuscript text production, and hence don't really have a framework within which to understand what they're looking at. The idea that, because of this confusion, calligraphy should try to more obviously look less like typography seems to me like the idea that letterpress printing should draw attention to itself by being deeply impressed into thick rag paper, to which I know you object. Text should conform to the conventions and design of the document for which it is intended, regardless of the medium of its production. That is craft. The very excellent piece of Michel D'anastasio's calligraphy to which you linked is a fine piece of art, but it has nothing to do with formal document production.\n\nBTW, Frank has a proposal in to talk about the design and production of the Act of Abdication at this year's ATypI in Amsterdam.\n\n"
    },
    {
      "time": "4 May 2013 — 2:46pm",
      "content": "The writing in that document has much more of a typographic regularity than any ancient manuscript I've seen, in either Latin or Hebrew. Also I wonder about the point of it, though the skill is awesome.\n\nI'm reminded of the great cabinet maker James Krenov. He wrote that if he was going to do something by hand he was going to do it in a way that took advantage of the fact that he was doing it by hand. It would show the hand of an individual; the living soul who made it would shine through the final piece in a way it could not in any designed and machine mass-produced object.\n\nAnother anecdote. A famous lettering artist was asked by a friend why he isn't asked by type design classes to give a talk. He answered, \"Possibly because I hate type.\" His attitude was: if he could not personalize it, screw it. (He's never done a font.)\n\nSo I think more expressive variation in the hand work would have been more appropriate, but perhaps that wasn't his brief.\n\n"
    },
    {
      "time": "4 May 2013 — 3:55pm",
      "content": "John, I can concede that typography is more about efficiency (and it a way that calligraphy isn't) than consistency, but consistency is nonetheless an inescapable part if its spirit. At least in contrast to typography, I feel calligraphy should _relish_ its inherent human divergence. This is why, as much as I admire and even envy the talent, skill and training involved, calligraphy that people -including people attuned to letterforms mind you- have trouble distinguishing from typography bothers me on some level. Do note that script fonts bother me too on some level. :-)\n\n{Added:  \nAnd most of all, I maintain that it's entirely safe to state that once typography figured itself out\\* it produced much more consistent results on average than the average manuscript work; and at its highest level (I mean even in the cold-metal age) it was more consistent than the most regular calligraphy. Frankly I find it pretty strange to contest that.\n\n\\* I mean technically; spiritually I think it's _still_ living with its parents!  \n}\n\n> I don't believe consistency of letterform reproduction is very important, and that it is primarily an aesthetic rather than functional concern\n\nBut there must be limits to how inconsistent things can get before what -I think- you're calling functionality is affected. As there are also opportunities (I'm thinking of judiciously diverging boumas). But I don't know what the limits are, and I don't even know anybody who I think does know what the limits are.\n\nMore importantly, I for one don't believe in separating functionality from aesthetics. _If_ the \"subvisible\" inconsistency of calligraphy (which it seems you agree that these days is a given) makes the reader feel different (without realizing it\\*) that's part of functionality too. In fact without that there would be very little reason to make yet more text fonts! At least conventional ones... :-)\n\n\\* If you do realize it, _then_ it's probably more aesthetic than functional. Maybe. But anyway that's not immersive reading.\n\n> subpixel positioning and antialiasing that, rightly I think, puts a higher premium on consistency of spacing than consistency of letter display.\n\nThis is veering a bit off-topic, but: I agree that varying the rendering of a glyph slightly to avoid a large inconsistency in spacing is a good compromise. However it's not really a _necessary_ compromise - you can in fact have both. How? By abandoning the illusion of WYSIWYG. We don't mention WYSIWYG much these days, but it still haunts us on dead trees.\n\n> the efficiency of typography is in the production of multiple copies\n\nNot only. The efficiency of typography is also tied to the fact that it takes less time to hit a key than write a letter by hand, not to mention that you can change your mind about things with near-zero cost. Plus it looks much nicer for virtually anybody on the planet! This is why:\n\n> it seldom makes sense to use type to produce a single copy of a document. It is not only more prestigious to hire a scribe, but also likely to take less time.\n\n?  \nPeople type things up, print them (without even saving the files) and post them in quite important places way more often than they handwrite things (or get things hand-written). The only kind of handwriting that takes less time is post-it notes to yourself that nobody else is forced to decipher.\n\nHiring a scribe _is_ more prestigious (in extreme cases like this) but there's no way it's more cost-effective. Case in point: why did Demoed use Constantia instead of Frank's talents?\n\n> most people have very little experience of formal manuscript text production\n\nWell, that's my point. Any document that's meant for \"regular\" people should use a font. _Unless_ the \"subvisible inconsistency\" business I mentioned is for real...\n\nBut I'm not actually saying calligraphy should try to consciously look different than typography\\*; I'm saying it should break free of its long-dead role of being readable and realize its new role: Art. Calligraphy can really only be about personal expression now, where _consistency_ is not a natural element.\n\n\\* You're certainly right that I object to gaudy over-impression in letterpress printing. But that's also why I do letterpress printing very rarely - being tasteful in letterpress is simply not cost-effective.\n\nhhp\n\n"
    },
    {
      "time": "4 May 2013 — 3:54pm",
      "content": "Looking at the body text in the photo originally, without looking closely, I thought it was type. That it was instead high-quality calligraphy makes sense for an official document of this nature.\n\nAnd that it is not... expressive and individualistic... of course also makes sense under the circumstances.\n\n"
    },
    {
      "time": "4 May 2013 — 4:00pm",
      "content": "_But there must be limits to how inconsistent things can get before what -I think- you're calling functionality is affected._\n\nOf course. But my point is that whatever those limits are the great majority of historical text production has been inconsistent, mostly within those limits, rather than consistent in its reproduction of individual letter shapes.\n\n_The efficiency of typography is also tied to the fact that it takes less time to hit a key than write a letter by hand, not to mention that you can change your mind about things with near-zero cost._\n\nYou are confusing typography and typing. Typing is an input method, and as an input method for type it is not much more than a hundred years old, so I don't think it is something that can be considered an inherent quality of typography. Again, consider the kind of document we're talking about: one off, prestigious, part of the theatre of monarchy. Even if calligraphy had not been the chosen method of text production, this was never something that was going to be typed up on a computer and output to a bubble-jet printer. Against the multiple processes of typesetting and printing such a text -- handset, mechanical or computer generated to polymer plate, setting up a press, testing papers, running multiple proofs, ammending ink, etc. -- hiring a scribe to write it seems to me at least reasonably competitive in terms of efficiency _for a single copy._\n\n_Why did Demoed use Constantia instead of Frank's talents?_\n\nI presume this was spec'd by the designer, Jaap Drupsteen; Trudie Demoed was just the craftsperson. I don't know why Constantia specifically was chosen, but monumental caps have a quality that differs considerably from pen-made caps, and Drupsteen seems to have wanted that contrast between the gilded caps and the less monumental text. Also, I believe consistency is usually more difficult to achieve the larger the writing is, which is why big pieces of calligraphy tend to be more expressive than formal text production. Drupsteen evidently wanted consistency to be a characteristic of this document, part of its aesthetic, and used different text production methods to achieve that at different sizes.\n\n_Any document that's meant for \"regular\" people..._\n\nPretty much by definition not a royal family!\n\n_I'm saying it should break free of its long-dead role of being readable and realize its new role: Art. Calligraphy can really only be about personal expression now, where consistency is not a natural element._\n\nA huge proportion of calligraphy in the West has done exactly that, for a long time now, but there remains a rôle for scribes in producing certain kinds of formal documents whose purpose is to be readable, impersonal and not expressive. In the production of such documents, scribes exercise one of the skills that they spend a long time developing: the ability to reproduce fairly closely the characteristic letter shapes of the style they are writing. In Islamic calligraphy, this is precisely what is taught and certified in the _ijazah_ system.\n\nHere's something for you to think about: if the Act of Abdication had been set in a font representing a similar style of letter, and this were put side-by-side with Frank's calligraphy, do you really think you wouldn't immediately see the difference? And don't you think that while appreciately the skill and beauty of the calligraphy you might think that the font was a bit naff, as overly calligraphic fonts often are?\n\n"
    },
    {
      "time": "8 Aug 2014 — 3:10pm",
      "content": "> I've also been known to be coöperative, but seldom naïve.\n\nThat's actually how we spell those words in the Netherlands, which I very much dislike.\n\n\"Coöperatief\" and \"naïef\". Also \"coördinator\".\n\n"
    },
    {
      "time": "9 Aug 2014 — 5:51am",
      "content": "Odd, where I am, the spelling naïve is common, but the spelling coöperative is so rare as to be almost non-existent.\n\nBut as for the main debate in this thread: calligraphy is something that involves time, effort, and (if one is not doing it oneself) expense. Using a font that looks like handwriting is trivial. Thus, while consistency is a valued characteristic in calligraphy, _under current conditions_, whether those conditions came into being when Gutenberg invented the printing press, when Linn Boyd Benton applied the pantograph to typefounding, or when laser printers became available for home computer users... perfectly consistent calligraphy can now be mistaken for something of less value.\n\nThat isn't a negation of the value of consistency in calligraphy, but it _is_ a cruel paradox.\n\nAnd, come to think of it, it's also the perfect moment to bring William Morris (the handicraft movement, after all) into the mix.\n\n"
    },
    {
      "time": "9 Aug 2014 — 6:16am",
      "content": "Lateral to the mention of the handicraft movement, I think this paradox is common to other crafts that overlaps in some way, like painting and photography, for example.\n\n"
    }
  ]
}
