{
  "id": "102725",
  "title": "'the baseline grid'",
  "forum": "General Discussions",
  "tags": [
    "baseline grid",
    "General Discussions"
  ],
  "content": "Hi all,\n\nI'm trying to get my head around the baseline grid. Is this a good mathematical solution?\n\nIf not, how should it be done? I would like to keep the grid as flexible as possible.\n\nThanks\n\n ![](http://web.archive.org/web/20150414142633im_/http:/typophile.com/files/baseline%20grid_3649.jpg)\n\n ![](http://web.archive.org/web/20150414142633im_/http:/typophile.com/files/baseline%20grid%20b_3487.jpg)\nt \n",
  "author": "timaarts",
  "time": "2 May 2013 — 1:25pm",
  "uid": "172742",
  "comments": [
    {
      "time": "2 May 2013 — 2:25pm",
      "content": "I would ordinarily set the baseline grid to the leading of the body text and not worry about whether headings fall on the grid.\n\n"
    },
    {
      "time": "2 May 2013 — 2:42pm",
      "content": "I thought that the purpose of the baseline grid is to be able to use a thinner paper — so that bleeding through the paper is (at least partially) hidden by the ink on the front of the page.\n\nIf so, “accidental lines” should not matter. (Although school textbook with display formulas may have a very hard time combining “typesetting on the grid” with display-formulae-typesetting style requirements.\n\n"
    },
    {
      "time": "2 May 2013 — 3:14pm",
      "content": "The smaller your baseline grid is, the more (vertical) freedom you have. However, with such an extremely fine spaced grid you might as well not use one at all!\n\nI usually use a whole-leading grid; sometimes whole fractions, such as 1/2 or 1/3 of the body text leading.\n\nIt Depends -- mainly on how large your headings, and its associated white space above and below, are when compared to body text and leading.\n\n(Your Headings leading seems to assert you only have one-line headings. I'd suggest using more tighter leading, and fill up the remaining space with Space Above and Space Below.)\n\n"
    },
    {
      "time": "2 May 2013 — 3:41pm",
      "content": "Thinner paper? The purpose of a grid is to help people think they're in control. :-)\n\nhhp\n\n"
    },
    {
      "time": "2 May 2013 — 6:36pm",
      "content": "\\> _The purpose of a grid is to help people think they're in control. :-)_\n\nWhat I had in mind was a _rigid_ grid — one with height `1em`. A finer grid must have some transcendental purpose indeed!\n\n"
    },
    {
      "time": "2 May 2013 — 10:59pm",
      "content": "\\> so that bleeding through the paper is (at least partially)  \n\\> hidden by the ink on the front of the page.\n\nI've heard of designers using justified type to help obscure see-through with thin paper, but I've never heard of a baseline grid being used for that purpose. I think a baseline grid is mainly used so that baselines in adjacent columns will align.\n\n"
    },
    {
      "time": "3 May 2013 — 12:48pm",
      "content": "Hi all,\n\nThe baseline is actually 16pt, the height of my leading. I think that's also the only way to make the system work mathematically. (am I correct?)\n\nIf this baseline grid is good, what would be the appropriate sizes for my headings? And the appropriate amount of whitespace above and below. (according to the rules of typography)\n\nI'm asking because I want to learn the theory. How should it be done and why. :)\n\nThanks\n\n ![](http://web.archive.org/web/20150414142633im_/http:/typophile.com/files/baseline_4076.png)\n\n"
    },
    {
      "time": "3 May 2013 — 12:59pm",
      "content": "I've read something about Fibonacci in typography for instance.  \nBut I don't really like it since 9 is to small en 13 to big for print.\n\n"
    },
    {
      "time": "3 May 2013 — 1:30pm",
      "content": "Don't use 64 line transport for H2, but define a Space Before… value instead. Same goes for H3.\n\n"
    },
    {
      "time": "3 May 2013 — 6:05pm",
      "content": "Thanks Bert, I will look into it.\n\nMy InDesign is not so good yet. (Not used to paragraph styles etc.)\n\n"
    },
    {
      "time": "4 May 2013 — 7:39am",
      "content": "Don't worry about Fibonacci or any other scale of proportions...rely on your eyes, train them...do they look right to you?\n\n"
    },
    {
      "time": "5 May 2013 — 3:27pm",
      "content": "I think my 'h2' is a few points to big.\n\nDoes anyone know where to find solid information on the subject?\n\n"
    },
    {
      "time": "5 May 2013 — 4:17pm",
      "content": "@Bert Vanderveen\n\nHow can that work? The points match exactly with my baseline, mm don't. Of course it will snap to the baseline, but isn't there a better way?\n\n"
    },
    {
      "time": "5 May 2013 — 10:44pm",
      "content": "[www.thegridsystem.org](http://web.archive.org/web/20150414142633/http:/www.thegridsystem.org/ \"www.thegridsystem.org\")\n\n[www.thegridsystem.org/tags/typography/](http://web.archive.org/web/20150414142633/http:/www.thegridsystem.org/tags/typography/ \"www.thegridsystem.org/tags/typography/\")\n\n"
    },
    {
      "time": "6 May 2013 — 6:05am",
      "content": "Thanks 5star, I know the website already :)\n\n[http://www.vignelli.com/canon.pdf](http://web.archive.org/web/20150414142633/http:/www.vignelli.com/canon.pdf \"http://www.vignelli.com/canon.pdf\")\n\n"
    },
    {
      "time": "6 May 2013 — 8:35am",
      "content": ".\n\n"
    },
    {
      "time": "6 May 2013 — 8:51am",
      "content": "Tim, what Bert was saying was that in InDesign you should use \"space before\" (or \"space after\") to control spacing between paragraphs. Or in this case, spacing between a headline (which is a very small paragraph) and the text.\n\nYou can set \"space before/after\" settings in the paragraph palette or by creating a style sheet with those settings.\n\nSetting the H2 heads the way you did at 24/64 will produce weird results if a headline takes 2 or more lines, and in general it's bad technique. Never use leading or blank lines to add spacing between paragraphs, it's better to use \"space before\" or \"space after\".\n\n"
    },
    {
      "time": "6 May 2013 — 9:41am",
      "content": "timaarts, thanks for the pdf ...whilst reading through it I picked up my phrase for the day \\>\\>\\> positive ambiguity.\n\n:)\n\n"
    },
    {
      "time": "6 May 2013 — 12:12pm",
      "content": "your welcome, and it is a nice phrase\n\n"
    },
    {
      "time": "6 May 2013 — 3:41pm",
      "content": "> How can that work? The points match exactly with my baseline, mm don't.\n\nYou are not limited to entering everything in mm, even if your default measurements are set to that. Enter \"16pt\" or \"32pt\" -- InDesign will automatically re-calculate it into your current measurement unit. (Correct me if I'm wrong, but from your images I infer you _are_ using InDesign.)\n\nIs your plain text 12 pt high? Try building \"up\" from that, in steps of 2 pts: 3rd headline 14 pt, 2nd headline 16 pt, and (not shown) 1st headline 18 pt. You can also increase the steps towards larger headlines; something like 14, 16, 20 pts.\n\nSince your 3rd headlines are in another color and another weight, you can also try the same size as your body text – the hierarchical difference is already there.\n\n"
    },
    {
      "time": "24 Oct 2014 — 9:17am",
      "content": "I see it's an old discussion but I just want to add my method. I usually set the baseline grid to half the pt size of the leading. This will keep things consistent without having too much space between paragraphs.\n\n"
    }
  ]
}
