{
  "id": "102764",
  "title": "McEwans Export",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi all ,\n\nDoing a job at the moment for a customer who wants the exact same font as used on the 'McEwan's Export' logo but I'm drawing a blank! Anybody got any idea what this font is - or something really similar?\n\nCheers in advance :)\n\n",
  "author": "Shorrock racing...",
  "time": "4 May 2013 — 3:49am",
  "uid": "211214",
  "comments": [
    {
      "time": "5 May 2013 — 12:05am",
      "content": "Posting an image would be useful.\n\n"
    },
    {
      "time": "13 May 2013 — 2:05pm",
      "content": " ![](http://web.archive.org/web/20140720173036im_/http:/typophile.com/files/11859_mcewans-export_6560.gif)\n\n"
    },
    {
      "time": "13 May 2013 — 2:05pm",
      "content": "Sorry about that.\n\n"
    },
    {
      "time": "13 May 2013 — 2:53pm",
      "content": "Bonus question ... does anyone know the etymological (if that's the proper term) reason for the star (or any other kind of mark) under the c?\n\n"
    },
    {
      "time": "13 May 2013 — 3:12pm",
      "content": "Flange is similar.  \nPutting a mark underneath a superior capital in an all cap setting may be considered a form of “lining”, i.e. maintaining the visual effect of each character extending from baseline to cap line. It may perhaps also be considered a form of apostrophe—indicating an elided character—as in “Major” here:\n\n ![](http://web.archive.org/web/20140720173036im_/http:/typophile.com/files/Monoline_1860_3539.jpg)\n\n"
    },
    {
      "time": "13 May 2013 — 9:26pm",
      "content": "Thanks Nick, learn something new everyday. Lining seems like the clean tech term.\n\nBut...\n\nI heard a story of the origin of this mark. It had to do with Irish and Scottish families that wanted to leave their homeland and come to North America ...primarily through New York. As the story goes families could not all come over at once and knew that what little money they could gather up for the passage would be spent on the most likely family member to establish a foothold in America.\n\nFamily members within the same clan began to distinguish their own family's name by placing a mark under and sometimes above the c in Mc or ac in Mac.\n\nWhen families were reunited having all traveled to the new world the names could be recorded all together. And they could find each other via a registry.\n\nI forget where I heard that story.\n\n"
    },
    {
      "time": "15 May 2013 — 12:25am",
      "content": "The star replaced a circular dot in the 60s, the star was the mark of Scottish and Newcastle Brewery, in 1960 Scottish Breweries (including McEwan’s) and Newcastle Breweries merged. The star represented the 5 breweries of the Newcastle Breweries.\n\nTim\n\n"
    },
    {
      "time": "19 May 2013 — 3:07am",
      "content": "Nick mentioned Flange as a similar font.\n\nIf McEwan is an old label it probably was hand lettering not a font.\n\nTo create letters from scratch that match, find a sans serif font with the right proportions and add mini-serifs to the letters. You may need to take letters from several different fonts. For a model of mini-serifs that are close to the label check the serif contours in Flange, or ITC Serif Gothic Extra Bold, which you are likely to already have.\n\nDon\n\n ![](http://web.archive.org/web/20140720173036im_/http:/typophile.com/files/ITCSerifGothicExtraBold_3975.jpg)\n\n"
    },
    {
      "time": "19 May 2013 — 3:25am",
      "content": "For comparison the mini-serifs in Flange BQ, $255 at Bethold -- I wish I could ask that much for a font and actually get sales!  \nDon\n\n ![](http://web.archive.org/web/20140720173036im_/http:/typophile.com/files/FlangeBQreg_5725.jpg)\n\n"
    }
  ]
}
