{
  "id": "102763",
  "title": "'Matisse' font id?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "1981",
    "Fifty years of his graphic art",
    "Henri Matisse",
    "Lieberman",
    "title page",
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20131016095402im_/http:/typophile.com/files/20130503_051442_Matisse_5554.png)\n\n",
  "author": "LzLi",
  "time": "4 May 2013 — 12:19am",
  "uid": "211211",
  "comments": [
    {
      "time": "4 May 2013 — 1:52pm",
      "content": "Over 13 hours since your post and none of the type ID gurus have made a suggestion.\n\nSo here is what little I have to offer.\n\nPresumably this is from the title page of:  \n Matisse: 50 years of his graphic art. Text by William S. Lieberman.  \nPublisher New York : G. Braziller, 1956.\n\nI did some basic research at Myfonts using MATISSE as a specimen text and failed to find a digital font to match the treatment of S, T & E.\n\nIn 1956 this would probably have been a metal type or photo-type. Or perhaps custom artwork.\n\nSome similarity to Columbia, designed by a New York designer, Walter McKay, and released in 1956 by Typefoundry Amsterdam. McGrew's American Metal Type only displays a small size, but it was available in up to 60pt.\n\nAlso some similarity to Suburban French, Monotype.\n\nSo is there a digital match for MATISSE?\n\nDon\n\n"
    },
    {
      "time": "4 May 2013 — 5:29pm",
      "content": "Is there a digital match? I don't know. I expect it is hand lettering too. The title page and text uses Baskerville. The cover design features a dash of Venus Grotesque. I sniffed hints of other Bauer founts in the 'Matisse' lettering. Aspects of the design have a nagging familiarity though. The teeny serifs on the T. The contrasting bowls on the S. Where Have I seen that before? Was it the last time I looked at this book? Or was it something digital? Or is my ('I-like-these') client messing with my head? (The type style of the Venus isn't available digitally either.) But thank you very much for your efforts Don. Looks like redrawing it will be quicker than looking much further. (Or is it farther?)\n\n"
    },
    {
      "time": "4 May 2013 — 7:56pm",
      "content": "I agree that since this does not ring a bell with anyone, redrawing is the way to go. It is really is a pastiche of well known features that I would not expect to find in the same font. Leaving aside the two pre-digital fonts I mentioned, there seems to be nothing very close.\n\nDon  \np.s. further vs. farther -- like the old tomayto tomahto joke :)\n\n"
    },
    {
      "time": "5 May 2013 — 2:06pm",
      "content": "The quick and dirty tip is to use “farther” for physical distance and “further” for metaphorical, or figurative, distance. The Oxford English Dictionary, Fowler's Modern English Usage, and a number of other sources say that, in most cases, it's fine to use “further” and “farther” interchangeably, especially when the distinction isn't clear.\n\n[http://grammar.quickanddirtytips.com/further-versus-farther.aspx](http://web.archive.org/web/20131016095402/http:/grammar.quickanddirtytips.com/further-versus-farther.aspx \"http://grammar.quickanddirtytips.com/further-versus-farther.aspx\")\n\n"
    },
    {
      "time": "7 May 2013 — 7:24am",
      "content": "The plot thickens. It appears the titling for  \n'Matisse: 50 years of his graphic art' (Text by William S. Lieberman. Publisher New York : G. Braziller, 1956.)  \nwas lifted from the limited edition  \n'Pasiphaé, Chant de Minos' (1944 and 1981)(text by Henri de Montherlant, Paris: Martin Fabiani, 1944)\n\n'Never content to merely provide accompanying illustrations for his books, Matisse submitted himself to the discipline of the page and to typographical considerations, invariably taking a hand in designing the jackets, selecting the typeface, deciding the layout and choosing the paper and binding...'  \n [http://www.mama.org/exhibits/modernist/painting/matisse/pasiphae.html](http://web.archive.org/web/20131016095402/http:/www.mama.org/exhibits/modernist/painting/matisse/pasiphae.html \"http://www.mama.org/exhibits/modernist/painting/matisse/pasiphae.html\")\n\nSo it appears it is some fount de français.\n\n ![](http://web.archive.org/web/20131016095402im_/http:/typophile.com/files/Pasiphae_5801.png)\n\n"
    },
    {
      "time": "7 May 2013 — 10:16pm",
      "content": "Deberny & Peignot's Garamont (Jan Tschichold, Treasury of alphabets and lettering, Omega Books, 1985 -- pp. 128-9) whew.\n\n"
    },
    {
      "time": "8 May 2013 — 2:18pm",
      "content": "Thank you for sharing the reference.  \nA new one for me. Seems worth getting. Here is a blub for a later printing.\n\nDon\n\n++++\n\nW W Norton & Company Incorporated, 1995 - Design - 236 pages  \nTreasury of Alphabets and Lettering is a classic source book of the most beautiful type and letters of all time selected by Jan Tschichold, internationally renowned typographer and master of lettering. It contains only letters of timeless and lasting beauty--the true mainsprings of the art of lettering. One hundred and seventy-six type specimens are presented, most of them in complete alphabets.\n\nThe introductory text provides a perceptive analysis of letter forms. Tschichold discusses lettering as a work of art, good and bad letters, older and recent letter forms, the use of capital and lower-case letters, word spacing, line spacing, the selection of appropriate letter styles, and the layout of groups of letters and signs.\n\nThe type specimens are handsomely reproduced, most in their original size. Every alphabet was specially arranged by Tschichold, and forms a well-balanced graphic design. Many of the outstanding historical sources appear better here than in the often poorly printed originals. The book is identical to the original edition, first published in 1966, with a new introduction by designer and writer Ben Rosen.\n\n"
    },
    {
      "time": "9 May 2013 — 2:20am",
      "content": "Olive's Vendome is close.\n\n"
    }
  ]
}
