{
  "id": "102821",
  "title": "\"Rough\" Serif Font",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Can anyone help id this beautiful font? Have a feeling its very contemporary, or its a heavily altered classic.\n\nCheers,\n\nSeb\n\n ![](http://web.archive.org/web/20150419132525im_/http:/typophile.com/files/screenshot_4760.jpg)\n\n",
  "author": "hello seb",
  "time": "7 May 2013 — 2:25am",
  "uid": "76609",
  "comments": [
    {
      "time": "7 May 2013 — 2:42am",
      "content": "Don't know this one but looks like they started from Times.\n\n"
    },
    {
      "time": "7 May 2013 — 6:38am",
      "content": "Indeed.  \nLook how they did little to the difficult letters (like the \"s\", which is too light) resulting in a clumsy whole.\n\nhhp\n\n"
    },
    {
      "time": "12 May 2013 — 12:53pm",
      "content": "Really? I wonder then if they intended it to look clumsy? I rather like it myself. This is a publication from Bedford Press, which has close ties to Radim Peško, who I think designed this. He has a very interesting style and isn't afraid to buck trends:\n\n[http://www.radimpesko.com/fonts/larish-neue](http://web.archive.org/web/20150419132525/http:/www.radimpesko.com/fonts/larish-neue \"http://www.radimpesko.com/fonts/larish-neue\")  \n [http://www.radimpesko.com/fonts/f-grotesk](http://web.archive.org/web/20150419132525/http:/www.radimpesko.com/fonts/f-grotesk \"http://www.radimpesko.com/fonts/f-grotesk\")\n\n"
    },
    {
      "time": "12 May 2013 — 1:09pm",
      "content": "Agree. Saw also the connection with Radim Peško and was actually my very first thought. Try sending an email to him, he might answer.\n\n"
    },
    {
      "time": "12 May 2013 — 2:01pm",
      "content": "“He has a very interesting style and isn't afraid to buck trends”\n\nDude. Look (really look) at the lowercase ‘g’ in Larish Neue. Why bother?\n\n"
    },
    {
      "time": "12 May 2013 — 6:17pm",
      "content": "Buck trends? Looking stupid _is_ the trend!\n\nhhp\n\n"
    },
    {
      "time": "13 May 2013 — 1:25am",
      "content": "I'm looking man. It was one of the first things I saw. I appreciate it because I find it interesting when someone like Pesko decides to put some ugly/character into his work, especially in todays context where 'perfect' curves and proportions are achievable. It kind've draws some parallels with old specimens, where 'imperfections' were often due to technological issues i.e paper quality. Pesko's moves these into a stylistic area. Which I'm not opposed to. But it's ok if you are! :)\n\n"
    },
    {
      "time": "13 May 2013 — 1:27am",
      "content": "Maybe trends was the wrong word, convention more like.\n\n"
    },
    {
      "time": "16 Jul 2013 — 7:07pm",
      "content": "Radim definitely didn't do it and the press is not responding...\n\n"
    }
  ]
}
