{
  "id": "102879",
  "title": "EULA",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all  \nOne of my clients has asked me to provide the EULA for the fonts used in the design work. Not an issue as the fonts were legally purchased. However in reading the agreements, one of the foundries prohibits embedding. When producing PDFs for print and also electronic distribution the fonts are embedded (i.e. I'm not sending the font out of house) and without specific software, for all intents and purposes they are non-editable - would this be considered illegal and can they actually enforce this?\n\nIf I send this to my client they are probably going to force a change in the font which I really don't want to do, but more of an issue is that this may effect many of my fonts and client work.\n\nSurely everybody needs to embed fonts in PDFs and for distribution and production?\n\nHas anyone experienced this before?\n\nThanks, any advice hugely appreciated.\n\n",
  "author": "dendicott",
  "time": "9 May 2013 — 4:24am",
  "uid": "12413",
  "comments": [
    {
      "time": "9 May 2013 — 5:05am",
      "content": "Are the fonts 100% embedded, or are they subset? Most foundries allow subsetting. It seems odd to me that if they are 100% embedded, their EULA prohibits the practice yet they failed to set the flag within the font to prevent it.\n\nThe EULA's legal precedence would likely be superior to that of the font setting, and it probably is enforceable. Your best choice would be to contact the foundry and discuss this issue with them.\n\n"
    },
    {
      "time": "9 May 2013 — 5:19am",
      "content": "Thanks George, if they were outlined and PDF'ed (thereby embedding 100%) they wouldn't be searchable - which is an issue for the client.\n\n"
    },
    {
      "time": "9 May 2013 — 5:27am",
      "content": "Would that it were so simple... There is no sanity with EULAs, as Tiffany Wardle lamented long ago. The original intent was probably to protect against piracy, but there are other financial issues at stake now.\n\nCheck the EULA carefully In your particular case, for example, the EULA **may** permit embedding the font in the PDF sent to the printer, but no other uses. For web distribution, you would then make another PDF. With that one, several solutions -- use the WEB version of the fonts (i.e., pay more), turn the font characters to outlines, or ... probably other techniques I've missed.\n\nBut the real answer, far as I'm concerned, is to only purchase fonts (licenses) that present a simple & seamless workflow at your end.\n\nWe've gotten to the point where Wall Street investment bankers and all too many font publishers have much in common.\n\nIt's your money, spend it as you want.\n\nBuy nothing from Monotype/Linotype, H&FJ, FontFont, etc. Some of the smaller font publishers have quite good EULAs. Not sure about Adobe's embedding restrictions, but I do know you can embed for printing. As Adobe is heavily invested in PDFs, there is an easy, seamless solution for web use, too.\n\nYoungsters find this appalling. So many fonts with either expensive or restrictive licenses when it comes to using them. But for 500+ years, until the mid 1990s, people worked with just a few fonts. Somehow, advertising got done, books written, culture preserved, etc. Even limiting yourself to fonts with sane EULAs, you have far more to choose from these days.\n\n"
    },
    {
      "time": "9 May 2013 — 5:40am",
      "content": "Thanks Charles, that does rather clear things up. Unfortunately many of our fonts come from H&F and fontfont… Do you have a link to Tiffany's piece - I searched but the original link is dead?\n\n"
    },
    {
      "time": "9 May 2013 — 6:13am",
      "content": "I don't have Tiffany's piece. Most important from your perspective was her work on a chart of who allowed what, and of course, that's long changed.\n\nProbably another internet forum/site will be of more use with this topic ... Typophile runs about 10:1 type designers to type users, and the designers have an understandable interest in getting more money. They find users' concerns about costs puzzling.\n\nI'm not much help either, since I work only with books, and can choose solutions you probably couldn't use.\n\nWith FontFont & H&FJ, I \\*think\\* you can just buy the web versions of the fonts -- of course, H&FJ seems to want to sell you packages, not individual fonts, so that's going to be rather a large chunk of change...\n\n"
    },
    {
      "time": "9 May 2013 — 10:26am",
      "content": "Darren , just like you should indeed be careful about taking the advice of type designers when it comes to buying fonts, be careful about taking the advice of somebody who uses fonts in a very niche way. So a blanket statement like \"buy nothing from Monotype/Linotype, H&FJ, FontFont\" might be good advice for a small minority of people, but it's clearly bad advice for most people (probably including you).\n\n> Typophile runs about 10:1 type designers to type users\n\nFalse. And very likely intentionally so.\n\n> Youngsters find this appalling.\n\nThen they grow up. Many of them even end up liking classical music! The horror...\n\nA moment of lucidity:\n\n> I'm not much help either\n\nI think you're quite helpful to anybody who is able to factor in how narrow (if refined) your experience is. It also helps a great deal to be able filter out your emotional hang-up against type designers.\n\n> They find users' concerns about costs puzzling.\n\nThis is also largely false. Most type designers are not rabid hermits.\n\n> But for 500+ years, until the mid 1990s, people worked with just a few fonts.\n\nFor much longer than that people worked without typesetters either... Obviously that's moot, and lamenting choice and cultural richness _will_ turn you into a rabid hermit.\n\nNot everybody needs to appreciate the subtle visual language of typefaces, hence the real cultural need for a large number of fonts. But a good typesetter (one that will be hard to replace with an algorithm sooner rather than later) necessarily does. A good typesetter appreciates type designers.\n\n--\n\nHere's my advice:  \n- Do be aware of what you're paying for; avoid a font with a EULA that's likely to get you in trouble. Usually you'll be able to use any font you license in some productive ways, but not every productive way. For this client, avoid the problematic fonts (and let the foundries know that you did).  \n- If there's a EULA clause that you find unethical, violate it; just don't shy away from the consequences if you get caught. Don't do something because you think you can get away with it - do something because you believe in it, whether you think you can get away with it or not. To me, there's only one such -sadly common- clause: one that says you can't modify the font. Just keep the results -and the fact that you did it- internal.\n\nhhp\n\n"
    },
    {
      "time": "9 May 2013 — 11:26am",
      "content": "You mentioned that a lot of your fonts come from Fontfont, who have a much clearer policy of embedding fonts than most.\n\n[https://www.fontfont.com/faq](http://web.archive.org/web/20150122202114/https:/www.fontfont.com/faq \"https://www.fontfont.com/faq\")  \n [http://fontfeed.com/wp-content/uploads/2009/09/ff-eula-non-editable-embe...](http://web.archive.org/web/20150122202114/http:/fontfeed.com/wp-content/uploads/2009/09/ff-eula-non-editable-embedding-permitted.pdf \"http://fontfeed.com/wp-content/uploads/2009/09/ff-eula-non-editable-embedding-permitted.pdf\")\n\nI work in video games producing User Interfaces and this is a constant headache for me. For something that is not a particularly new idea, a huge number of foundries are struggling to keep up with the times and don't offer clear pricing for embedding without obtaining a custom quote. Sometimes the price that comes back is so much it's ridiculous. Things have only started to move on because of the web and the increasing popularity of tablet devices and app development.\n\nIncreasingly we are turning to FontSpring because it's such a simple website to use, there are no custom quotes etc, the pricing is very clearly outlined. Their selection is quite limited however.\n\n"
    }
  ]
}
