{
  "id": "10289",
  "title": "(x) The Gas Company Tower - Steile Futura/Bauer Topic (Tasse) {Stephen}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I'm looking for the font that is used on the sign for [The Gas Company Tower](http://web.archive.org/web/20131011022024/http:/www.emporis.com/en/il/im/?id=248811) in Los Angeles. It should be a full typeface since it is also used on the Parking sign. It might be proprietary, though.   \n   \nMy apologies for not posting an image in the thread, but the person wants $240 for using that crappy snapshot. I'll try to remember to bring my digital camera next time I go for a walk and I'll take a better picture.   \n   \nThanks!\n\n",
  "author": "antiphrasis",
  "time": "12 Apr 2005 — 5:35pm",
  "uid": "3247",
  "comments": [
    {
      "time": "12 Apr 2005 — 5:48pm",
      "content": "Lauri, check [this](http://web.archive.org/web/20131011022024/http:/www.typophile.com/forums/messages/83/32992.html?1081631086) thead for more information, including links to a great free version. Also explain the $240 snapshot thing ... do you mean you asked for permission to post that image here?\n\n"
    },
    {
      "time": "12 Apr 2005 — 8:18pm",
      "content": "Stephen,   \n   \nThanks for the help! I love that font... every time I walk past the Gas Company Tower I stop for a while to admire the font. I usually buy fonts from MyFonts, but I created an account at FontShop and purchased it (URW Topic Bold) from there as thanks for all your help. It is a wonderful typeface, and I bet I'll find a use for it!   \n   \nThanks again!\n\n"
    },
    {
      "time": "12 Apr 2005 — 8:24pm",
      "content": "James,   \n   \nThanks for the link! That was interesting information indeed... the font is a little bit older than I thought.   \n   \nI didn't ask for permission to post the image, since I only kinked to it. Here's what it said on the page:   \n_\"The image above is for internet viewing only, and may not be saved outside your browser or used without a license. However, you can buy usage rights if the image belongs to our staff.\"_   \n   \nAnd if you look around the site you see that the price for that piece of \"stock\" is $240. So I didn't want to post the image here and be in violation of their copyright.   \n   \nThanks!\n\n"
    },
    {
      "time": "12 Apr 2005 — 8:45pm",
      "content": "You could also check out [Solex](http://web.archive.org/web/20131011022024/http:/www.myfonts.com/fonts/emigre/solex/medium/testdrive.html?s=THE+GAS+COMPANY+TOWER&p=48) from Emigre. Not quite as square but nice nevertheless.\n\n"
    },
    {
      "time": "12 Apr 2005 — 8:53pm",
      "content": "Patricia,   \n   \nYeah, this one's a looker too. I'm a sucker for the square uc C's and S's.   \n   \nThanks!\n\n"
    },
    {
      "time": "13 Apr 2005 — 12:26am",
      "content": "Stephen,   \n   \nHere's some points:   \n   \n\\* I hope I don't sound too cheap, but fonts seem to often cost a little bit less at MyFonts. If a font is $22 at FontShop it is often $21 at MyFonts.   \n   \n\\* Accept PayPal. It's nice to buy a font once in a while when I have money laying around in my PayPal account.   \n   \nThese seem to be the two main reasons for me. But I'll be using FontShop more in the future.   \n   \nHere's what FontShop does better than MyFonts:   \n   \n\\* The new testdrive is awesome! Up to 388pt in size. I haven't seen that anywhere before... now you get to see the small details. It'd be a nice added feature if you could enter the point size yourself. And maybe for a future testdrive have an \"advanced\" link where you could test drive OpenType functions for the font.   \n   \n\\* The design of the site is a lot nicer than MyFonts, which is a little bit too cartoony for my taste. Professionalism goes a long way.   \n   \n\\* Free font of the month. I love this feature... and makes me come back to the site. FF Absara is really great, and I'm doing to use that in some project in the future so I could buy some more weights.   \n   \n\\* You! I don't see anybody from MyFonts identifying fonts and helping out in here.   \n   \nThat's all I can think of at the moment. I'll add more points if I think of something more.   \n   \nThanks!\n\n"
    },
    {
      "time": "13 Apr 2005 — 10:41am",
      "content": "Stephen,   \n   \nThanks for letting me know the trick. I'm liking FontShop more and more.   \n   \n [Big Q](http://web.archive.org/web/20131011022024/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=UR.109663.0.1&attributes.sampleSize=48&sampleText=Q&sampleSize=1000) ![:-)](http://web.archive.org/web/20131011022024im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "13 Apr 2005 — 1:17pm",
      "content": "I like FontShop very much already, but since you're taking suggestions... The single greatest improvement in my view would be the ability to enter a longer string of text into the type tester, and to save that string along with one's preferred point size for future use,\n\n"
    },
    {
      "time": "12 Apr 2005 — 5:41pm",
      "content": "Futura Steile / [Bauer Topic](http://web.archive.org/web/20131011022024/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=UR.110072.0.3&attributes.sampleSize=48&sampleText=THE+GAS+COMPANY+TOWER&sampleSize=40) (one of my favorite underused square sans)\n\n"
    },
    {
      "time": "12 Apr 2005 — 5:47pm",
      "content": "There is also a reinterpretation from Font Bureau called [Tasse](http://web.archive.org/web/20131011022024/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories=1&font_categories_search=font_name_search&searchstr=tasse).   \nUnfortunately it lacks the charming [italics](http://web.archive.org/web/20131011022024/http:/www.fontshop.com/showfont.cfm?fid=UR.110072.0.0).\n\n"
    },
    {
      "time": "12 Apr 2005 — 11:52pm",
      "content": "> * * *\n> **quote:**\n> \n> I usually buy fonts from MyFonts, but I created an account at FontShop and purchased it (URW Topic Bold) from there as thanks for all your help.\n> \n> * * *\n> !-/quote-!\\>!-quote-!\\>\n\nThank you Lauri. That means a lot.   \n   \nMay I ask what features you'd like to see at FontShop.com that   \nwould help bring us to the top of your list?\n\n"
    },
    {
      "time": "13 Apr 2005 — 1:45am",
      "content": "Not much: improve the keyword search and you have a winner. ![:-)](http://web.archive.org/web/20131011022024im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "13 Apr 2005 — 2:30am",
      "content": "I really appreciate your comments, Lauri. We crave customer feedback.\n\n> * * *\n> **quote:**\n> \n> It'd be a nice added feature if you could enter the point size yourself.\n> \n> * * *\n> !-/quote-!\\>!-quote-!\\>\n\nThis is actually possible already by \"hacking\" the URL. After   \nrunning a custom sample, just change the very last number of   \nthe address in your browser to whatever point size you desire.   \n(The renderer can actually churn out samples above 388 pt. Shhh.)\n\n> * * *\n> **quote:**\n> \n> improve the keyword search\n> \n> * * *\n> !-/quote-!\\>!-quote-!\\>\n\nAgreed. In fact, any sort of advanced search isn't enabled at all right now   \nwhile the people behind the curtain tinker with the keyword cogs.   \nWe shall enable it soon and I think you'll be very pleased with it.\n\n"
    }
  ]
}
