{
  "id": "102815",
  "title": "Instagram logo revised",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Article about the revised Instagram logo:  \n [http://www.underconsideration.com/brandnew/archives/hand\\_beats\\_filter\\_in...](http://web.archive.org/web/20140405051209/http:/www.underconsideration.com/brandnew/archives/hand_beats_filter_in_new_instagram_wordmark.php \"http://www.underconsideration.com/brandnew/archives/hand\\_beats\\_filter\\_in\\_new\\_instagram\\_wordmark.php\")\n\n ![](http://web.archive.org/web/20140405051209im_/http:/typophile.com/files/instagram_5261.png)\n\n",
  "author": "JamesM",
  "time": "6 May 2013 — 7:45pm",
  "uid": "58010",
  "comments": [
    {
      "time": "7 May 2013 — 5:49am",
      "content": "I was pointed to this redesign thru a Tweet from Jürgen Siebert and my reaction was: bad design, too mechanical, too thought–thru. Mr Siebert disagreed at first, but then changed his opinion (after some explanation from me).\n\nIn the discussion on the site there is a Mr Marchington who has put my opinion perfectly into words:\n\n> I really have to disagree with the consensus here. The new design loses all of the character of the original. it is so sanitized and dull. The designers could have done so much with the character and playfulness of the original. The uniformity of the x-height in the new version is boring, beige and bloody ugly. Ugh! Couldn't be more white bread if they tried. They should be ashamed of themselves given the opportunity.\n\nIt IS always noticeable when something has been designed by committee… (And on a side note: A lot of artwork is too slick because designers don’t draw or sketch but start out with digital tools.)\n\n"
    },
    {
      "time": "7 May 2013 — 6:42am",
      "content": "I really quite enjoy the sterility of it myself, though I wish it'd go a bit towards italic...\n\n"
    },
    {
      "time": "7 May 2013 — 7:49am",
      "content": "Instagram seems to have led to a kind of homogenization of amateur digital imagery on the web. It seems appropriate that its logo be likewise homogenized.\n\n"
    },
    {
      "time": "7 May 2013 — 8:07am",
      "content": "^exactly. Fauxtography.\n\n"
    }
  ]
}
