{
  "id": "102843",
  "title": "FontFont on MyFonts",
  "forum": "Release",
  "tags": [
    "FontFont",
    "fontshop",
    "monotype",
    "myfonts",
    "release",
    "Release"
  ],
  "content": "Thought you all might be interested in knowing that FF (Fontfont) faces are now available at MyFonts:\n\n[http://www.myfonts.com/foundry/FontFont/](http://web.archive.org/web/20150414120852/http:/www.myfonts.com/foundry/FontFont/ \"http://www.myfonts.com/foundry/FontFont/\")\n\nObviously this is something we're quite proud of as Kevin, John, Jan, Petra and others have been working on this for a long time. I personally think that the inclusion of FF faces is testament to the increasing quality of not just customer experience but type available at MyFonts overall in the past year. WIth our Foundry Review Board (myself, Jan Middendorp, Tiffany Wardle, Adam Twardoch, Florian Hardwig), we've become far more stringent in terms of the quality of new foundries; we expect to see the same sort of editing and selection - a sort of informal curation - happen with new releases from established foundries in the near future. These are all parts of a new, more robust, selective and ultimately more useful MyFonts, which began with our redesign a few years back, and which we think makes us the most complete type-buying marketplace in the world.\n\nI am very proud to be associated with this company, as you can probably tell; bringing Fontshop's exclusive FF faces \"into the fold\" is a celebration of our growth, and we hope shows that we're on the right path.\n\n",
  "author": "jlt",
  "time": "7 May 2013 — 3:56pm",
  "uid": "1706",
  "comments": [
    {
      "time": "7 May 2013 — 8:55pm",
      "content": "Niiice!\n\nhhp\n\n"
    },
    {
      "time": "8 May 2013 — 12:54am",
      "content": "Not working from the Netherlands. Myfonts reports;  \nBuy it!  \nNot for sale here.\n\n"
    },
    {
      "time": "8 May 2013 — 6:26am",
      "content": "Same problem here. Not working from Netherlands, sadly. Is it possible to get a list of the countries in which it does/doesn't work?\n\n"
    },
    {
      "time": "10 May 2013 — 11:49am",
      "content": "As of this writing, the FontFont fonts are only to customers outside of Europe.\n\nI also apologize for not mentioning this earlier.\n\n"
    },
    {
      "time": "19 May 2013 — 9:12am",
      "content": "Just another small island off the coast of the USA.\n\n"
    },
    {
      "time": "19 May 2013 — 7:30pm",
      "content": "[to follow]\n\n"
    }
  ]
}
