{
  "id": "102980",
  "title": "Webfont Licensing etc, 3 years later.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am interested; how have people's standpoints and views have changed on webfont usage and licensing over the last few years? If we look at a Typophile post such as [http://typophile.com/node/67790](http://web.archive.org/web/20150122202120/http:/typophile.com/node/67790 \"http://typophile.com/node/67790\") it's interesting to see what may have changed. If we go back say, 5 years, it's even more revealing.\n\n-v\n\n",
  "author": "vernon adams",
  "time": "13 May 2013 — 12:59pm",
  "uid": "82025",
  "comments": [
    {
      "time": "15 May 2013 — 2:21pm",
      "content": "The silence is deafening, eh?  \nVern - if you were to give an idea of the kind of change in standpoint and view you suspect might have taken place, maybe it would help get the ball rolling.\n\nFor myself - getting involved with fonts led, for me, to a complete re-thinking about the function of copyright as it is being applied (or mis-applied, as it were) to digital goods.\n\nFWIW - I think that, on the whole, those who spend a goodly amount of their time making typefaces, don't like the move from type on paper to type on screen and never will. They prefer a medium where the size of the type is known and fixed.  \nEnd of story. That's their druthers, their preferred medium.  \nThe question, however, is how much of that kind of graphics design work will be around in ten, twenty, or thirty years.  \nHakon Wium Lie made a wry joke in a post on the W3C mailing list that touched upon this issue. He said that they better hurry up and get the multi-column and other print-friendly standards nailed down and implemented or otherwise there won't be any more books printed.  \nHis point being that the digital \"web\" version of the \"book\" is, even today, the primary product, with a paper version feasible only if the stylesheet capabilities are there to port the thing to paper.\n\nThe world has been flipped upside down.\n\n"
    },
    {
      "time": "15 May 2013 — 2:41pm",
      "content": "Nah, nothing that dramatic.\n\nI for one don't mind things that are inevitable - in fact I think it's my social and spiritual duty to adapt. I also happen to prefer screens to printed matter, which is a highly inelegant medium. But that doesn't mean everything is OK. Every technological change spawns new people who are opportunistic and/or ignorant!\n\nAs always, what we have to fight is not the medium, but feeble-mindedness.\n\nhhp\n\n"
    },
    {
      "time": "15 May 2013 — 3:04pm",
      "content": "“The silence is deafening, eh?” Tempest in a teapot.\n\nIf Vernon can ask a clear question, I’m sure he will get answers. And if you can stop rambling, I’m sure we can have a productive discussion.\n\n"
    },
    {
      "time": "16 May 2013 — 10:05am",
      "content": "I think my question is clear enough. It's probably just that the subject is not that interesting to many. If you go back 3-5 years and look at the sort of discussions around ways 'the type industry' was viewing how type could be set on the web, and compare that to how type is now being set on the web, i am curious how the views and attitudes of type designers may have changed towards type on the web.\n\nJust 2 examples; go back to around 2009 and there were prominant voices stating that they were, e.g., \"100% against @font-face\", or that webfonts could only be properly served to the web once things like a \"permissions table\" was imposed onto, and accepted as an opentype/truetype/web standard, by type designers, web engineers & users. So...e.g., what happended to things like @font-face and the permissions table? and, for example, how did type end up managing with them and / or without them?\n\nThe post of [http://typophile.com/node/67790](http://web.archive.org/web/20150122202120/http:/typophile.com/node/67790 \"http://typophile.com/node/67790\") seemed like a fair taste of the way things were, i.e. people not really knowing how to react, what to think, what to do, which side to be on, etc etc. And maybe most importantly not allways seeing the route that was likely.\n\nI'm guessing that people are now more sure of what they think, and may even now be acting in ways they would not have imagined 3-5 years ago. Basically i'm curious on how people's views, attitudes, and actions may have changed about type on the web.\n\n"
    },
    {
      "time": "16 May 2013 — 10:30am",
      "content": "Thanks Rich,  \nThe function and role of copyright in digital product is for sure an interest in this. Same would be the function and role of 'intellectual property'. Both of those are finding it difficult to maintain the old levels of territorial security, in the web age, that they had in the pre-web age.  \nGoing back a few years, i remember one of the main arguments from prominant type figures against the use of the CSS rules that allowed dynamic embedding of common font files, was that type designers would not 'give up' their 'intellectual property' via this type of font freedom, and thus the widespread use of free, dynamic embedding would just not happen. I think many designers took comfort in feeling that the type industry would be able to steer type on the web away from the free and easy-ness that was threatening. SO... was that free and easy-ness as big a threat as people were expecting?\n\n"
    },
    {
      "time": "16 May 2013 — 2:30pm",
      "content": "\"...webfonts could only be properly served...once things like a \"permissions table\" was imposed onto...\"\n\n\"Only\" and \"imposed\" were not used, \"permissions\" were never proposed alone or as the DRM that's coming to other media, and recommendations have been quite important, many of them are part of, as I said they would become, our private data, in a private service that benefits our clients, alone.\n\nAlmost all of the then recommended recommendations have become issues in dealing with the web, and/or responsive media in an increasingly typographically enabled but resolutionarily fractured browser market. We expect to make use of all of the recommendations as functionality creeps on.\n\nIn these still-early stages of the web, many thousands of dead type designers have 'given up' their 'intellectual property' via the font freedom of the web, and this has encouraged live type designers to do so as well. That, and a huge player supporting them was welcome contrast, but not expected.\n\nAnd obviously some people were all talk, while others were not.;)\n\n"
    },
    {
      "time": "16 May 2013 — 6:34pm",
      "content": "<cite>\"Almost all of the then recommended recommendations have become issues in dealing with the web, and/or responsive media in an increasingly typographically enabled but resolutionarily fractured browser market. We expect to make use of all of the recommendations as functionality creeps on.\"</cite>\n\nOk so here's a couple of questions to that;  \nIf the permissions table had been adopted by designers, engineers and users, in the way it was recommended in 2009, what differences may it have made to where we are now?  \nAlso, is there still a need for the permissions table, in the same way it was recommended that one was needed back in '09? Has that idea (or a similarly targeted one) still to have it's day? e.g. i could see permissions-based font embedding happening as part of some of the W3C + DRM recommendations that are afloat [(link to FSF web DRM news).](http://web.archive.org/web/20150122202120/http:/www.fsf.org/news/world-wide-web-consortium-takes-next-step-with-controversial-drm-proposal-defective-by-design-condemns-decision)  \nIdeas? Comments? :)\n\n"
    },
    {
      "time": "16 May 2013 — 6:46pm",
      "content": "\"I wish I had a watermelon.\"  \n\"I wish I had a watermelon.\"  \n\"I wish I had a watermelon.\"  \nContinually repeated as a lamp is rubbed.  \n\"I wish I had a watermelon.\"  \n\"I wish I had a watermelon.\"  \n\"I wish I had a watermelon.\"  \n\"I wish I had a watermelon.\"  \n...\n\n"
    },
    {
      "time": "16 May 2013 — 7:43pm",
      "content": "I wish there was a delete thread option...\n\n"
    },
    {
      "time": "16 May 2013 — 9:29pm",
      "content": "I was silent in that thread, and I still don’t have much of a standpoint or views on the subject. So, not much change. I have several webfont distributors, but haven’t really tried to ﬁgure out why some do better for me than others. It was like that before.\n\nI did think about doing some Google fonts, and even made one that I thought would be suitable, but never got around to submitting it.\n\n"
    },
    {
      "time": "17 May 2013 — 2:57am",
      "content": "As to the original question, is seems that the discussion [is a different now](http://web.archive.org/web/20150122202120/http:/typographica.org/on-typography/library-subscriptions-the-future-of-fonts-should-we-sing-or-cry/) than the one it was then.\n\n"
    },
    {
      "time": "17 May 2013 — 5:59am",
      "content": "\"...i could see permissions-based font embedding happening...\"\n\nYou mean, everybody who wants internet font exclusivity just gets an app embedding license.\n\n"
    },
    {
      "time": "17 May 2013 — 8:56am",
      "content": "<cite>You mean, everybody who wants internet font exclusivity just gets an app embedding license.</cite>\n\nNo, not really.  \nI'm not sure how specifically it would work, (horses for course i would bet) but i suspect that the W3C DRM proposals could introduce a few things, including;  \n• the normalisation of 'ring fencing' web content for proprietary only use (something that, so far, allways tended to flounder on the web)  \n• browser-side operations that permit / deny web object usage.\n\nJust those 2 would probably provide enough of a secure environment where font providers could sell more traditional licenses for web font use, and the licensee could then serve those real fonts to the web, without the font provider fearing that their intellectual property was simply being set free into the wild.  \nThe above scenario is exactly why film and music publishers are hoping the W3C proposals come to fruition; then they can start selling web-based music and film to users with far less risk of their content going walkabout.\n\nA product like 'ready-media' must be itching for this scenario? to roll out a joined up & uniformly protected typographic solution, from paper to web?\n\n"
    },
    {
      "time": "17 May 2013 — 8:11am",
      "content": "<cite>As to the original question, is seems that the discussion is a different now than the one it was then.</cite>  \nExactly (i think). Stuff like the Adobe 'Creative Cloud' service (no doubt already a blueprint for others), makes much more sense in a DRM'd world wide web.\n\n"
    },
    {
      "time": "17 May 2013 — 10:43am",
      "content": "Vernon, although mechanisms for digital rights management, once in place, can be applied to pretty much any piece of digital code or data, there seem to be quite different attitudes towards DRM for consumer content (music, video, games) and DRM for the nuts and bolts stuff of displaying web content. This much is one of the things that was obvious in 2009: the browser makers were all adamant that they wouldn't accept any webfont standard that included DRM. The fact that two of those browser makers, now wearing their content-provider hats, are among the parties supporting the W3C Encrypted Media Extension for content protection illustrates the different attitudes.\n\n"
    },
    {
      "time": "17 May 2013 — 10:57am",
      "content": "What John said.\n\nExcept: Microsoft seemed more than willing to accept DRM for fonts. But they were ~ alone among browser vendors in that regard. Mozilla and Google in particular were really not going to go there, no way, no how.\n\nFont makers and vendors decided that web fonts were inevitable, and decided to take what they could get, rather than curse the darkness. (Though some did both.)\n\nT\n\n"
    },
    {
      "time": "17 May 2013 — 11:14am",
      "content": "> there seem to be quite different attitudes towards DRM for consumer content (music, video, games) and DRM for the nuts and bolts stuff of displaying web content.\n\nYes. And i wonder if 'quality type' is now an area ripe to be marketed as <cite>consumer content</cite>, instead of just given away as <cite>nuts and bolts</cite> web content. Isn't this where a service like 'Ready-Media' is heading? or could be.\n\n"
    },
    {
      "time": "17 May 2013 — 12:01pm",
      "content": "A service like Ready-Media is still using fonts as design and presentation _tools_, not as consumer content. This is the fundamental difference between fonts and, say, music files.\n\n_...instead of just given away as nuts and bolts web content._\n\nI didn't say anything about given away, and I didn't describe fonts as web content. If we're going to have this discussion, please read what I write with more care (sorry to sound impatient, but I don't have a lot of free time these days). I referred to the 'the nuts and bolts stuff of _displaying_ web content'. Nuts and bolts in the sense of reliable mechanisms necessary to display content, not implying anything about 'given away'.\n\n"
    },
    {
      "time": "17 May 2013 — 12:37pm",
      "content": "> If we're going to have this discussion, please read what I write with more care (sorry to sound impatient, but I don't have a lot of free time these days).\n\nApologies for misunderstanding / misinterpreting. Ironically, i don't think you caught my original points too well either :)\n\nThe obvious distinction is between the <cite>nuts and bolts</cite> of the web, (e.g. the software that runs the web, provides the structures, routes, platforms, etc), and the <cite>content</cite> of the web (e.g. the stuff people 'consume' on the web).  \nThe <cite>nuts and bolts</cite> of the web is predominantly 'give away' stuff (Free Software). What the WC3 proposals can do is enable the building on top of that base, a more 'proprietary-centric' web layer for 'content' to be consumed in.  \nFonts can fall into either category.\n\n"
    },
    {
      "time": "17 May 2013 — 1:34pm",
      "content": "@Frode Bo Helland  \nSorry to backtrack, but I wanted to respond, before I forgot all about it.  \nFrode wrote:  \n\\>_\"And if you can stop rambling, I’m sure we can have a productive discussion._\n\nI don't remember seeing terms of service here requiring that I write in a way that YOU find acceptable.  \nBut common decency does require, I think, that you not behave like the condescending little twit that apparently you are.  \nPerhaps you should confine yourself to participating only in exclusive online orgies of the like-minded - by that I mean a circle jerk like Typedrawers where people are barred from participating from the get-go because they have, in the past and in other contexts, expressed opinions that the manager of that forum, James Puckett does not like.  \nJames Puckett strikes me as a putz very much in your mold, Frode.  \nAm I dealing with a clique here? I think so.  \nA Klan to keep out the riffraff, is that it?\n\nAdios - you win. Not worth the expense.\n\n"
    },
    {
      "time": "17 May 2013 — 2:24pm",
      "content": "Vernon: I did not mean to sound condescending towards you. The conversation is moving now, so perhaps I was wrong.\n\n"
    },
    {
      "time": "17 May 2013 — 2:25pm",
      "content": "Richard, you're being unduly antagonistic. Consider who made Typophile worth existing and what its natural role is. Then see if your own agenda can co-exist with that with sufficient harmony, or whether you should grin and bear it when confronted, staying focused on content, instead of spending most of your time fanning flames (which achieves nothing).\n\nAnd Frode is nothing like James.\n\nhhp\n\n"
    },
    {
      "time": "17 May 2013 — 5:03pm",
      "content": "@Frode No problem at all. I'm thick skinned anyway :)\n\n"
    },
    {
      "time": "17 May 2013 — 7:48pm",
      "content": "Vernon:\"No, not really. I'm not sure how specifically it would wor... \"\n\nAnd you missed my point as well. I mean, it does already... if someone wants a unique typographic ID, they make an app, embed a font, and deliver it in a way that is certain, and relatively safe to their fonts. And, all kinds of other media is being delivered this way, off web, via Internet in apps.\n\nSo, if the w3c is aiming to make such compartmentalization possible, maybe 100,000,000 developers will rewrite their apps, and maybe by then something better will have developed, again ahead of the web.\n\nNow, back to troll wack a mole.\n\n"
    },
    {
      "time": "20 May 2013 — 8:38am",
      "content": "[http://typophile.com/node/103169](http://web.archive.org/web/20150122202120/http:/typophile.com/node/103169 \"http://typophile.com/node/103169\")\n\nhhp\n\n"
    },
    {
      "time": "20 May 2013 — 3:15pm",
      "content": "Thanks Hrant. Nice to see SIL still hating on EOT... in 3 / 5 years nothing has changed. :-)\n\nCheers, Si\n\n"
    },
    {
      "time": "21 May 2013 — 3:49am",
      "content": "But I think Victor is only writing with regard to each format's ability to provide FE, which is ironic, isn't it?\n\n"
    },
    {
      "time": "21 May 2013 — 10:02am",
      "content": "EOT is just a wrapper for a TTF file, and the (optional) compression is lossless. The format even supports additional metadata (allowed roots etc.) - so you can really think of EOT as WOFF version 0.9. :-)\n\nSo if a TTF file is okay then an EOT file should be okay. However, I think the only people the FUD hurts is Google, which I find even more ironic. :-/\n\n"
    },
    {
      "time": "21 May 2013 — 10:10am",
      "content": "What's the reason SIL might be anti-EOT?\n\nhhp\n\n"
    },
    {
      "time": "21 May 2013 — 2:29pm",
      "content": "I couldn't understand why EOT would not be okay if WOFF was okay. I have inquired on the other thread/announcement.\n\nIn any case, as subsetting and other important processing is still disallowed, it would seem to me that the only legit option for a typical web font service provider using OFL licensed fonts that make use of the Reserved Font Name is to cut a supplementary deal with each and every vendor. Sigh.\n\n"
    },
    {
      "time": "31 May 2013 — 6:59am",
      "content": "_the only legit option for a typical web font service provider using OFL licensed fonts that make use of the Reserved Font Name is to cut a supplementary deal with each and every vendor. Sigh._\n\nYep. I will ask the GF designers if they really do want to have RFNs on each family - Vern for example wants to use RFNs on only some of his designs - and hopefully this will result in a lot of RFNs being rescinded.\n\nFor the RFNs that remain, I think a little web app could go a long way to reducing the cost and complexity of cutting those deals.\n\nStay tuned.\n\n"
    }
  ]
}
