{
  "id": "102939",
  "title": "Kerning Pairs / My Fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Short story: A while ago, MyFonts offered what appeared to be a quality font at a bargain price so I bought it. It looked good on their website, but absolutely dreadful when printed. It turned out that the font had zero kerning pairs! I suggested to MyFonts that they include the number of kerning pairs in their \"Tech Specs\" tab, but they elected not to do so. (The font was so bad I wouldn't have used it even if it was free; I eventually got a refund.)\n\nOne of their \"Rising Stars\" this month was offered at a 50% discount, so I wrote and asked \"How many kerning pairs (on average) does Mikado have? None? Tens? Hundreds? Thousands?\" This was their response: \"Unfortunately, we are not aware of the kerning pair data for the Mikado font.\"\n\nSo I wrote back: \"Shame on you. I downloaded the free font, and found that there were over 1000 kerning pairs. Would that have been so hard for you to do? Do you need me to recommend a font program to view the number of kerning pairs?\"\n\nTheir response: \"Glad to hear that you now have the kerning pair information. The font was also downloaded, and opened in FontBook....\" (No kerning pair info.)\n\nIs it just me, or should a font vendor know, or be able to find out, font information more readily than a non-pro? To find out font info, I rely on Typograph 5.1.2 available from [http://www.neuber.com/typograph/index.html](http://web.archive.org/web/20140730011835/http:/www.neuber.com/typograph/index.html \"http://www.neuber.com/typograph/index.html\")\n\nWhat's with font vendors that profess ignorance of their fonts and do not have the wherewithal to find out info?\n\n",
  "author": "Renaissance Man",
  "time": "11 May 2013 — 11:44am",
  "uid": "15371",
  "comments": [
    {
      "time": "11 May 2013 — 12:10pm",
      "content": "Kerning pairs? That seems to presume old-fashioned kern table kerning, which is indeed easy to query. But OpenType fonts are more likely to have GPOS kerning, which may be arranged in class kerning, class kerning with exceptions, or pair kerning, and may include contextual kerning, contextual interactions between kerning and mark positioning, etc.. This information is difficult to query, since that would require being able to decompile the GPOS table and to represent the kerning data in a meaningful way that would enable comparison across fonts built in different ways.\n\nWhile I would be wary of any (non-monospace) font that contained no kerning of any kind, I don't think the actual number of kern pairs -- even when this information can be accurately extracted from the font -- is in itself a good indicator of quality, and can quite understand why a vendor such as MyFonts would consider this unhelpful and potentially misleading information to present to customers.\n\n"
    },
    {
      "time": "11 May 2013 — 12:42pm",
      "content": "Linotype FontExplorer Pro can show the kerning pairs for any font, without having to go into a font editor. I don’t know how this information is compiled, but at least it gives an indication.\n\n"
    },
    {
      "time": "12 May 2013 — 6:54am",
      "content": "Ask the foundry, not MyFonts.\n\n> I don't think the actual number of kern pairs .... is in itself a good indicator of quality\n\nIndeed. Here's a good example:  \n [http://vissol.co.uk/mavenpro/](http://web.archive.org/web/20140730011835/http:/vissol.co.uk/mavenpro/ \"http://vissol.co.uk/mavenpro/\")  \nThe guy brags of having \"over 6,500 kerning pairs\", but even a cursory look reveals that it's just algorithm vomit. I actually emailed the designer about four months ago and got an admission that it sucks, but the misleading advertising is still there...\n\nOn the other hand there are also designers who pretend a handful of kerning is enough, that having thousands is never necessary. This is also bogus.\n\nhhp\n\n"
    },
    {
      "time": "12 May 2013 — 6:44am",
      "content": "There are some designers out there making fonts for fun who have never heard of spacing. Therefore they build heavy kerning into their fonts to make them halfway workable. Would they know just a bit of proper spacing they could save a lot of kerning.  \nSo: the number of kerning pairs is no indicator of quality, as stated above.\n\n"
    },
    {
      "time": "12 May 2013 — 3:37pm",
      "content": "Just some clarification.\n\nI never said more kerning pairs were better, or an indicator of quality. But I do agree with John: _\"I would be wary of any (non-monospace) font that contained no kerning of any kind.\"_ (And recently I did unknowingly buy a font that contained no kerning of any kind.) So the difference of zero kerning pairs and 500 is significant; the difference between 4000 and 6000, not so much.\n\nMy other point was that I think **all** vendors (not just MyFonts) should be able to get the number of kerning pairs either from a font program, or from tech specs that should come with the font, or from the type designer. I just can't get over the fact that a company that sells fonts can't even tell me if a font has **any** kerning or not.\n\nI'm not familiar with font internals, but I would be interested to know, given the many variations possible within Open Type, if font programs (like Linotype FontExplorer Pro) can discern all or just some of the kerning in OT. The font I just bought is OT; Typograph was able to tell me that Mikado had over 1000 kerning pairs, although I have no idea if Typograph can discern all the combinations, permutations, and possibilities John describes.\n\n"
    },
    {
      "time": "12 May 2013 — 3:55pm",
      "content": "Just some food for thought: Trinité contains no kerning. Or ligatures.\n\n[http://www.teff.nl/fonts/trinite/](http://web.archive.org/web/20140730011835/http:/www.teff.nl/fonts/trinite/ \"http://www.teff.nl/fonts/trinite/\")\n\n"
    },
    {
      "time": "12 May 2013 — 6:29pm",
      "content": "> Trinité contains no kerning.\n\nWell, no font is perfect. Maybe that was a limitation of the Autologic system, for which it was originally developed? Anyway somebody should fix that.\n\nhhp\n\n"
    },
    {
      "time": "12 May 2013 — 8:11pm",
      "content": "No, I talked some with Peter Noordzij when we purchased Trinité, and he remarked that de Does didn't think that either kerning or ligatures were necessary when the fonts were first created. I \\*think\\* he remarked that de Does either had or was changing his mind about that; he (Peter) did say he'd be curious about what we came up with.\n\nNote that a \"version\" of Trinite now costs 1,400 euros. Rather a lot. I believe it was \"only \"1,000 euros when we bought it.\n\n"
    },
    {
      "time": "12 May 2013 — 8:01pm",
      "content": "What you came up with? You mean like any word that starts with \"To\"?\n\nDoesn't Lexicon have kerning?\n\nhhp\n\n"
    },
    {
      "time": "13 May 2013 — 6:30am",
      "content": "My opinion is that sometimes is better to approach the original designer / foundry.\n\n"
    },
    {
      "time": "25 May 2013 — 6:55am",
      "content": "My first published retail font has over 10,000 carefully adjusted hand-made kerinig pairs. I know this because Fontlab counted them.\n\nSince then, I've improved my letter-spacing and learned to use class kernig. Now Foblab only tells me how many key glyph kerning pairs there are in a font, which is not at all revealing if you don't know how the classes are organized\n\nFont retailers' preview displays show kerned text, so why is this an issue? Just type in some kerning pairs.\n\n"
    },
    {
      "time": "15 May 2013 — 5:09am",
      "content": "Re: _\"Ask the foundry,\" \"better to approach the original designer / foundry\"_\n\nSent a link to this thread to the foundry (hvdfonts) and asked for a comment and received no response. If I do hear from them, I'll let you know.\n\nJust so you know, I like MyFonts. They let me know of updates of fonts I've purchased, and if any of my fonts from them become lost or corrupted, I can download them again. **But** I have gotten fonts from them that didn't work and waited 2 months for a corrected font that never came, got a font that was not style-linked, and a font that had few if any kerning pairs, if that explains my sometimes apprehensiveness.\n\n"
    }
  ]
}
