{
  "id": "102954",
  "title": "General question about talent",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "So is it fair to say that ' talent' is a product of the instrument being used and not of the person using the instrument?\n\nRemove the piano from the hands of Mozart, paint from Van Gogh, etc., would the individual still be recognized as a talent via some other means?\n\n",
  "author": "5star",
  "time": "12 May 2013 — 1:04pm",
  "uid": "52527",
  "comments": [
    {
      "time": "12 May 2013 — 1:12pm",
      "content": "The word talent suggests an expressible skill that is most often presumed to be inherent in the person and contrasted with the kind of skill that is developed with hard work and experience. It follows that if you remove the means of expression, an inherent skill remains in the individual, just as it does if that individual chooses not to express the talent. This is what makes it possible to say that someone is wasting his talent.\n\n"
    },
    {
      "time": "12 May 2013 — 1:36pm",
      "content": "> This is what makes it possible to say that someone is wasting his talent.\n\nYes there is that, I'd forgotten all about that phrase.\n\n"
    },
    {
      "time": "12 May 2013 — 2:24pm",
      "content": "For a definition of talent, flip your example around: Remove Mozart from the piano, remove Van Gogh from the paint, and what have you got? Lots of other perfectly competent people who composed music and painted pictures, but whose names we have long since forgotten. We remember Mozart and Van Gogh because their talent set them apart from their contemporaries.\n\n"
    },
    {
      "time": "12 May 2013 — 2:40pm",
      "content": "Inateness is usually presumed in talent, a kind of built-in advantage or proficiency that makes it relatively easy for someone to excel at a certain skill. However, in use we are frequently judging talent on the basis of output, rather than input, and don't always know how much effort has gone into developing a skill.\n\n"
    },
    {
      "time": "12 May 2013 — 3:09pm",
      "content": "Neil cited the example of Mozart, the poster boy for innateness of talent. He was composing music before his first Communion, so we can reasonably rule out extraordinary effort as the sole explanation of his proficiency.\n\n"
    },
    {
      "time": "12 May 2013 — 8:30pm",
      "content": "Ya so I think it is the instrument that made the man ...give paint to Mozart and the piano to Van Gogh and they would be as well known as what's his name?\n\n"
    },
    {
      "time": "12 May 2013 — 9:29pm",
      "content": "In the case of Mozart, I'd agree that innate talent was probably a huge factor, maybe the biggest factor, but he also had a father who was a musician and composer who started teaching him at an very young age. When you look at most folks who had a famous talent you'll find years of study and hard work.\n\n"
    },
    {
      "time": "13 May 2013 — 3:01pm",
      "content": "Talent is not the innateness of a skill, but the innate ease of learning such a skill. As such, it is still dependent on the time spent training that skill (i.e. effort), which is again dependent on the personal emotional value (i.e. motivation). However, talking about a built-in skill is pointless.\n\nTalent is of course as well a relative term. It only means something when contextualized within a certain social environment and within a certain time lapse. The top athletes of the 1896 olympic games may have seemed plainly untalented put next to today's top athletes. From this point of view, \"Am I talented?\" is less a question about yourself than a question about which people you consider talented.\n\nBut it's a good question, Neil.\\* What would have been of Van Gogh if you'd only given him a piece of chalk? Does the tool makes the artist?\n\n(As type designers, it's essential to keep asking ourselves whether the tools we use are nourishing our ability of expression or not. Bézier curves are the most numerically stable representation of an outline, but they are surely difficult to handle (pardon the pun), as smoothness depends on the position of two Beziér handles. On the other hand one has the constraint of in-extrema point-placing. Therefore, at least to me, it makes an enormous difference to draw sketches by hand before working with Beziér curves, one reason for this being that with a pencil I'm able to _sculpt_ the glyphs into paper.)  \n\\_\\_\\_\\_\\_\\_\\_  \n\\* A kind of question which is more easily answered with a beer in hand on a saturday afternoon.\n\n"
    },
    {
      "time": "13 May 2013 — 7:25pm",
      "content": "Ah yes, the theory of relativity.\n\n"
    },
    {
      "time": "14 May 2013 — 6:13am",
      "content": "Don’t confuse talent with genius. I know a lot of talented people, I think I also have some talent, as do most people. If one chooses to use these talents is a different matter.\n\nThe prototypical genius like Mozart is not a normal situation, it is more like a myth: only those with such huge talents are worthy of making great art, others just have to work very hard to even stand in their shadows.\n\nDon’t believe in the myth to much as this will make it impossible for yourself to use and develop your talents and interests and value the work of your own hand and spirit.\n\n"
    },
    {
      "time": "14 May 2013 — 7:20am",
      "content": "There is a lot of recent research on this issue. I believe that they hold that a factor called 'grit', which is devoted persistence practicing the task, even the face of difficulty, is also necessary. That ability to focus and persist, which is fed by passion for the task and other factors is as important or more important to high achievement as raw talent.\n\nBut raw talent is important. One of the coaches at my high school used to say \"you can't win the Kentucky Derby with a mule.\" In the case of Mozart or Van Gogh, I think the 'instrument' misleading. Mozart would have been a great musician with a different set of musical instruments. And Van Gogh could have been great with water colors. What is pretty clear is that musical talent and artistic talent—or talent in poetry or mathematics—are rather specific endowments, which don't necessarily carry over to other aspects of life. I was reading recently that Van Gogh was, outside his huge artistic gift, a sadly inept and psychologically fragile individual, who was regularly taunted and bullied by cruel young men.\n\nThe real geniuses in my view always have both: a rare gift for what they do, and a huge passion and devotion of time to exercising and cultivating the gift.\n\n"
    },
    {
      "time": "14 May 2013 — 9:37am",
      "content": "\\> a sadly inept and psychologically fragile individual\n\nVan Gogh only sold one painting during his lifetime, spent time in a mental institution, and committed suicide at age 37.\n\nBut he produced amazing paintings which today sell for tens of millions apiece.\n\n ![](http://web.archive.org/web/20130819112227im_/http:/typophile.com/files/vangogh_4788.jpg)\n\n"
    },
    {
      "time": "14 May 2013 — 10:05am",
      "content": "Buster Keaton’s career as a physical comic began as a child in his family’s vaudeville act, in which he was dressed as a miniature version of his father—and quite literally kicked around the stage.\n\n ![](http://web.archive.org/web/20130819112227im_/http:/typophile.com/files/tumblr_ljvyr53PAY1qhwx0o_5340.jpg)\n\n"
    },
    {
      "time": "14 May 2013 — 12:02pm",
      "content": "On Van Gogh, I found the source of my memory about him; it's a TV story, based on a recent book. The theory is that it was murder or manslaughter, but as he lay dying did not want to ruin the lives of the young men who killed him. The story is alas very plausible. You can see it [here.](http://web.archive.org/web/20130819112227/http:/www.cbsnews.com/video/watch/?id=7384908n&tag=contentMain;contentAux)\n\n"
    },
    {
      "time": "14 May 2013 — 2:05pm",
      "content": "It's an interesting theory (Van Gogh's shooting wasn't suicide), but he talked to several people (including his brother) after the shooting and never said that he was shot by someone else. And it's well documented that he was suffering from depression.\n\nThere's a good movie based on his life called \"Lust for Life\" starring Kirk Douglas, who received a \"Best Actor\" Academy Award nomination for it. It shows up occasionally on Turner Classic Movies and can be rented on iTunes.\n\n ![](http://web.archive.org/web/20130819112227im_/http:/typophile.com/files/kirk2_6009.jpg)\n\n"
    },
    {
      "time": "14 May 2013 — 2:07pm",
      "content": "Robert Altman's [Vincent & Theo](http://web.archive.org/web/20130819112227/http:/www.imdb.com/title/tt0100873/) is a better movie if you ask me.\n\n"
    },
    {
      "time": "15 May 2013 — 5:35am",
      "content": "Craig — I can totally see Tim Roth as Van Gogh. I’ll have to put that one on my list. Thanks.\n\n"
    },
    {
      "time": "15 May 2013 — 9:06am",
      "content": "The Van Gogh affair is the prime example of the romantic myth of the artist as outsider, serving to marginalize art and artists as mentally other and not requiring remuneration, with the value of their work transferring to dealers, curators, collectors, publishers and investors.\n\nArtists have been complicit in this, e.g. _The Death of Chatterton_ (a young poet, in 1770), by Thomas Wallis, 1856:\n\n ![](http://web.archive.org/web/20130819112227im_/http:/typophile.com/files/henry-walliss-chatterton_6152.jpg)\n\nAn aspect of this cultural split is the way that gallery artists support themselves doing commercial work, which is rarely included in their oeuvre. René Magritte sheet music cover, 1925:\n\n ![](http://web.archive.org/web/20130819112227im_/http:/typophile.com/files/660785_6095.jpeg)\n\n"
    },
    {
      "time": "15 May 2013 — 10:36am",
      "content": "I hate the term talent. Like so many artist terms, it is subjective to the point of being meaningless.\n\n"
    },
    {
      "time": "15 May 2013 — 11:52am",
      "content": "I think it is more the case that the term 'talent' is used in a variety of ways, some of which are highly subjective (especially so when it is used simply as a term of praise: \"He's so talented\".) The notion of an innate facility, however, is not meaningless, and far from being subjective it is quantifiable in various ways, mostly involving the amount of time it takes for an individual to become proficient at a learned skill. So, for example, I have a friend who has a talent for language acquisition, by which I mean that he finds it easy to learn new languages and does so in short periods of time.\n\n"
    },
    {
      "time": "15 May 2013 — 6:09pm",
      "content": "I see your point. However, for most of the term's usage it demeans and denigrates the effort needed to make use of one's talent. Mozart, for whatever talent he may have had, was still preoccupied with making music. Despite his excesses, it was the center of his life. Van Gogh painted tirelessly for hours on end, insanity and poor vision not withstanding. They may have been talented. They may have been geniuses. But, it was still a boat load of work. People tend to see the talent and downplay the actual work involved.\n\n"
    },
    {
      "time": "16 May 2013 — 3:26am",
      "content": "> People tend to see the talent and downplay the actual work involved.\n\nThe body of work is _often_ the demonstration of the talent. There are always exceptions, for example, Bertrand Russell proclaiming Ludwig Wittgenstein a genius based primarily on their verbal exchanges, Wittgenstein having published relatively little in his own lifetime.\n\n"
    },
    {
      "time": "16 May 2013 — 5:55am",
      "content": "Wittgenstein was brilliant, and did publish two works that had a huge influence, his Tractatus Logico-Philosophicus, and Philosophical Investigations. Russell wasn't wrong about his brilliance, but he was not only personally tortured, but also philosophically on a fundamentally wrong track, and tied himself in philosophical as well as personal knots.\n\nRussell after being deeply impressed with Wittgenstein, rejected his views and lost patience with him. In the infamous incident of the clash between my late teacher, Karl Popper, and Wittgenstein, Russell took Popper's side. (The book on this incident doesn't quite get right the argument at its core.) I have Popper's and Russell's bias on Wittgenstein, but a great number of people idolize both him and his philosophy.\n\nI think Nick Shinn is right that the picture of the tortured genius, which Van Gogh represents, and Wittgenstein fits, is unfortunately overemphasized. There are happy geniuses like Benjamin Franklin and Richard Feynman.\n\n"
    },
    {
      "time": "16 May 2013 — 6:06am",
      "content": "My point was not to emphasise the tortured side of Wittgenstein, merely use him of an example of someone considered to be a genius without having a great body of work to show for it. Indeed, there are no such colourful stories (that I am aware of) where Franklin or Feynman brandish pokers or dispense medicine and advise patients not to take it.\n\n"
    },
    {
      "time": "16 May 2013 — 11:03pm",
      "content": "To me I see a phrasing, a voice if you will, and to me that is the talent to interpret a chosen subject matter.\n\nOver at Christie's auction house Wednesday last, Jackson Pollock's Number 19 sold for 58.4 million US dollars ...not bad for a canvas that most everyone here thinks they can do. And that's fair. It's fair because we all can see the phrasing Pollock clearly stated.\n\nNo matter how hard talent is pushed ...until a clear concise voice is achieved the work will sound/look like background noise. I'm guessing within type design that that is even more so?\n\nThese masters, Mozart, Van Gogh, Pollock etc., seem ...and I hesitate to say this... destined to be who we see what they are.\n\nHonesty is rare. And perhaps that that is what talent only is ...the ability to be true to yourself.\n\n"
    },
    {
      "time": "17 May 2013 — 5:55am",
      "content": "Magritte is an example of the blending of commercialism and art. Working within advertising while painting, where would his pipe or apple paintings be without his commercial background, and where would so many album covers be without Magritte?\n\nVan Gogh produced drawings in chalk (among other media) that show an ability that is not limited to paint.\n\n[http://poulwebb.blogspot.co.uk/2012/11/vincent-van-gogh-drawings-part-3....](http://web.archive.org/web/20130819112227/http:/poulwebb.blogspot.co.uk/2012/11/vincent-van-gogh-drawings-part-3.html \"http://poulwebb.blogspot.co.uk/2012/11/vincent-van-gogh-drawings-part-3.html\")\n\nAnd you could make the point that Pollock had less conventional talent for paint than many other artists, there is a sea-change between the abstract expressionism of Blue or Shimmering and the drip paintings – a separation from the canvas.\n\nIs notoriety a talent?\n\n"
    },
    {
      "time": "17 May 2013 — 9:30am",
      "content": "No more than any other art medium.\n\n"
    },
    {
      "time": "17 May 2013 — 9:30am",
      "content": "Beckham retires!\n\n"
    },
    {
      "time": "17 May 2013 — 9:32am",
      "content": "I wonder if it could be argued that artists such as Magritte, who put text into their paintings, did so because they were familiar with putting it in their commercial work.\n\n"
    },
    {
      "time": "17 May 2013 — 10:06am",
      "content": "I don't think that you can deny the existence of talent. You can deny the proper attribution of it, though. Because someone has never been made famous by their talent, does not mean t does not exist. It just means that they were not discovered. The odds are that there have been plenty of talented folks who never made it into the Who's Who of the human race. Imagine 3rd World countries with little media exposure. I am sure that there must be some very talented folks from the Amazon jungles and elsewhere.  \nCultivation and exposure brings fame, but talent is a prerequisite before we can apply the cultivation and exposure. I am sure Van Gogh would have also slipped between the cracks into obscurity if it were not for certain quirks of fate and certain speculative art collectors as well as greedy opportunists.\n\n"
    },
    {
      "time": "17 May 2013 — 12:19pm",
      "content": "Yep, there are lots of factors besides talent.\n\nMany artists are lacking in business sense. That's not a criticism, it's just that they are focused with other things.\n\nThomas Kinkade and Leroy Neiman are examples of painters who were often panned by the critics but had fame and fortune because they had business sense and knew how to promote themselves, while other artists with more talent lived in relative obscurity.\n\n"
    },
    {
      "time": "18 May 2013 — 4:22am",
      "content": "A lot of folks want to bend it like Beckham; maybe for the money, maybe because he has a usable talent for footie (and could exploit it).\n\n"
    }
  ]
}
