{
  "id": "102930",
  "title": "The History of Typography - Animated Short",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Just watched an interesting [animation](http://web.archive.org/web/20130820183115/http:/vimeo.com/forrestmedia/the-history-of-typography)\\* about the history of typography where the creator tells that typography was invented by Gutenberg. Is this correct? The creator also mentions that the first sans-serif fonts were created by William Caslon's great-grandson Caslon IV who disliked serifs. I'm very curious to know about the accuracy is this information, so any insight about this would be appreciated. Thank you.\n\n\\* [http://vimeo.com/forrestmedia/the-history-of-typography](http://web.archive.org/web/20130820183115/http:/vimeo.com/forrestmedia/the-history-of-typography)\n\n",
  "author": "sevag",
  "time": "10 May 2013 — 5:16pm",
  "uid": "77053",
  "comments": [
    {
      "time": "10 May 2013 — 8:30pm",
      "content": "Printing from movable type was first invented, as far as we know, by the Chinese printer Bi Sheng. This isn't necessarily the only definition of typography, and doesn't preclude that Gutenberg too may have \"invented\" typography, even if he wasn't the first.\n\nThe first sans serif (latin) type appeared in a Caslon family catalogue, so the second anecdote sounds plausible. Sans serif _lettering_ was around quite a bit earlier.\n\n"
    },
    {
      "time": "11 May 2013 — 10:58am",
      "content": "This has so much wrong history that it is hard to know where to start. Just ignore it. Pity, because it has nice graphics.\n\n"
    },
    {
      "time": "11 May 2013 — 11:25am",
      "content": "That video is just a student's project about stop motion graphics ...as lame as it is.\n\n"
    },
    {
      "time": "13 May 2013 — 11:07am",
      "content": "The video seems to confuse “typography” with “type design,”&nbsp;among other issues. The first half is pretty riddled with errors or at least misleading content. The second half is actually not bad.\n\n"
    },
    {
      "time": "30 May 2013 — 5:31am",
      "content": "Lighten up folks. It's clear the guy is not a typo-nerd. His terminology is a bit slack, true, and there are some vast generalisations but it's just a bit of fun. And quite nicely done I think.\n\n"
    },
    {
      "time": "30 May 2013 — 7:37pm",
      "content": "“His terminology is a bit slack, true, and there are some vast generalisations but it's just a bit of fun. And quite nicely done I think.”\n\nIt being nicely done is actually why it is “dangerous.” People will assume that the content is accurate. It is not that it is terribly upsetting or anything, but I am not going to promote it or link to it or anything of the sort, and point out the issues to those who would publicize it....\n\nT\n\n"
    },
    {
      "time": "31 May 2013 — 6:28am",
      "content": "It wouldn't have taken much research to get the facts right. What's the use of doing it wrong?\n\n"
    }
  ]
}
