{
  "id": "102956",
  "title": "Origins of em?",
  "forum": "General Discussions",
  "tags": [
    "em",
    "General Discussions",
    "typeface history"
  ],
  "content": "First of all, sorry for my bad English; I’m not a native speaker.\n\nI look for historical information about origins of the term _em_ (typographic unit of measurement).\n\nMany sources state that it descends from the letter _M_, since sometime and somewhere it had exactly square dimensions. This sounds credible, but I fail to find any reliable historical evidences.\n\nFor instance, when and where was the term _em_ used for the first time? Who has invented it?\n\nAnd more important, was this word introduced as a precise metric description (“I mean exactly the size of the letter M”), or an associative one (“I say _em_ because it _associates_ with a letter M which dimensions roughly resemble a square”)? I incline towards the second choice, but I again lack any evidences.\n\nThanks to all who can point me to respective sources of information.\n\n",
  "author": "vp8317",
  "time": "12 May 2013 — 1:58pm",
  "uid": "211420",
  "comments": [
    {
      "time": "12 May 2013 — 2:48pm",
      "content": "Em is certainly associative rather than strictly descriptive. The actual dimensions of a piece of metal carrying an uppercase M would vary depending on the typeface, but it tended to be roughly square; similarly, the N sort would seldom be exactly half the width of the M, but en became the name for half an em.\n\nI can't say when it originated, but I do note that neither em nor en are used in William Savage's _A dictionary of the art of printing_, 1841.\n\n"
    },
    {
      "time": "12 May 2013 — 4:11pm",
      "content": "There is some confusion about ems in relation to ‘squares’ (in Dutch: vierkantjes). A square is a blank (space) with a width equal to its physical height. Eg for type size 11 cast on 12 the square would be 12 by 12. For type size 10 cast on 10: 10 by 10, etc. We are talking about lead, of course (with antimony and other stuff in lesser quantities)\n\nA square divided by two would be a half (in Dutch: halfje). There were also blanks in the sizes of a third and a fourth plus a thinner measure called a ‘thin one’ (dunnetje, in most cases with a width of a point or so — these tended to be very rare and were often hoarded in secret stashes to be used in spacing caps headers).\n\nIn art school we would use the measures of half and lower for spaces, and square for inset. Don’t know if this was an industrial practice, but the advantage was that one could pilfer other cases of type for these if there were not enough in the one you were using.\n\nWe never spoke of or used ‘ems’ and ‘ens’; that is, to my mind, something of the digital age and mostly associated with web design.\n\n(As insiders can tell, I used to be — and still am — an advocate of unjustified setting.)\n\nNowadays, in digital typesetting, one would use the measure of the line feed for inset.\n\nPlease correct me if I am off — it has been 35 years.\n\n"
    },
    {
      "time": "12 May 2013 — 4:45pm",
      "content": "I spent my formative years setting type by hand from a California Job Case, and I can assure you there were Em-quads (square of the point size) En-quads ( half the size of and Em) as well as 3 Em spaces (1/3 and em quad and suggested for word space) 4 Em spaces, 5 Em space and 6 Em Space. There were also 2- 3- and 4 Em Quads as well for bulking up lines. Besides these there were \"Coppers\" and \"Brasses\" which were thinner space material used to sung up your \"Lock-up\" in the \"Chase\" once you placed all your \"Furniture\" in the correct position and secured it using two \"Quoins\".\n\n"
    },
    {
      "time": "12 May 2013 — 5:30pm",
      "content": "Although neither Wikipedia, nor its external web reference on the term, were helpful, a slightly later Google result has the Random House dictionary claiming the term originated in the period 1870-1875. (That could instead have been the date of the origin of the term \"mutton-quad\" as an equivalent - I found an 1871 reference for that.)\n\nHowever, from Google Books, I find that one of the editors at \"Notes and Queries\" used Em Quad as his _nom de plume_ in 1857.\n\nAnd then I found an even earlier occurrence. An almanac for the year 1686 referred to William Penn as \"Lord Penn\", the Kalendarium Pentsilvaniense, and the governing council commanded him to use \"a well-inked three-em quad\" to blot out the offending phrase - although it's possible the recent sources for this have changed the story.\n\n"
    },
    {
      "time": "12 May 2013 — 6:36pm",
      "content": "Here are references from the [Oxford English Dictionary](http://web.archive.org/web/20130820213124/http:/www.oed.com/)\n\n[1728 E. Chambers Cycl. at Quadrat, There are Quadrats of divers Sizes, as m Quadrats, n Quadrats, &c. which are respectively of the Dimensions of such Letters.]  \n1793 in Stower Printer's Gram. (1808) xvii. 419 That em and en quadrats..be included.  \n1808 C. Stower Printer's Gram. xvii. 419 The ems and ens at the beginnings and ends of the lines not to be reckoned in the width.\n\n"
    },
    {
      "time": "13 May 2013 — 3:58am",
      "content": "Thanks a lot for your comments, especially for the quotes from old books. They helped me to find some more resources and new considerations:\n\n1. I found an [article written by Frank E. Blokland](http://web.archive.org/web/20130820213124/http:/www.lettermodel.org/wordpress/?p=280) that sheds some light on the origins of em, though not ultimately.\n\n2. I suspect that my research suffers from my bad English; maybe I fail to make the right queries for Google. I began with _origins of em_ and _history of em space_; are these ones correct (both grammatically and semantically)? Should I formulate my queries in some other way?\n\n3. I also suspect that the real origins of em could be found not in English sources, but rather in other ones: espesially in old Italian and French, maybe German and even medieval Latin. But I don’t know these languages, so I have no clue how to search for the right sources. Maybe you can give me some advise?\n\n"
    },
    {
      "time": "13 May 2013 — 5:44am",
      "content": "Regarding your 3rd question I can try a brief response for the German speaking area: “em space” has clearly only become widely used after the introduction of software based typesetting, although there might already been such terminology connected with typefounding machines and metal faces originating from English speaking countries. The term used for a “square” as detailed by others is „Geviert“ (roughly translates to “square”, literally “[four-by-]four-th”), so there’s no connection to the “em” in terms of etymology.  \nI don’t have the literature here at the moment, but I’d suggest looking at old typography primers (a search phrase for books.google would be something like “[be set apart] by one em”, but I didn’t try yet!), and there are specialised multilingual dictionaries for printer’s language, just visit any larger scientific library, or catalogue at first.\n\n"
    },
    {
      "time": "13 May 2013 — 5:58am",
      "content": "Upon searching a bit further: The equivalent of OED, the DWB gives a lot of different meanings for „Geviert“ [link](http://web.archive.org/web/20130820213124/http:/woerterbuchnetz.de/DWB/wbgui_py?sigle=DWB&mode=Vernetzung&hitlist=&patternlist=&lemid=GG13063), but the relevant part is:\n\n> “ausschlieszungen, heissen überhaupt alle die gegossenen metallenen körper im schriftkasten, mit welchen der setzer den raum, der im abdrucke zwischen den wörtern und zeilen leer bleiben soll, bildet oder setzt. diese sind z. b. die spatien .. die halbgevierten, ganzgevierten, ganze und halbe [Bd. 6, Sp. 4693] concordanzquadraten u. s. w.” Täubel wb. [Wörterbuch] der buchdruckerkunst (1805) 1, 113.\n\nSomehow that was to be expected: In the early 19th century, I'd think a bit earlier in the British and French areas, there was a lot of new dictionaries for special trades coming up, so that’s likely to be the period for the first stabilizing of terms that probably had been around earlier.\n\n"
    },
    {
      "time": "13 May 2013 — 10:56am",
      "content": "_3. I also suspect that the real origins of em could be found not in English sources, but rather in other ones: espesially in old Italian and French, maybe German and even medieval Latin._\n\nOn what basis do you suspect that?\n\n'Em' and 'en' are simply the pronounced names of the letters M and N in English, associatively adapted to describe the dimensions of type. As Frank Blokland's article indicates, earlier sources use 'm' and 'n' or (Moxon) 'm Quadrat' and 'n Quadrat'.\n\nThe first recorded English use of the term 'em' in the context of typesetting and printing, according to the OED (1st edition), is 1864, in a newspaper article about printers' union rate demands 'per thousand ems'. The OED definition notes that 'The em of pica is the standard', i.e. unless otherwise specified an em is presumed to be 12pt.\n\n"
    },
    {
      "time": "14 May 2013 — 4:44am",
      "content": "> 'Em' and 'en' are simply the pronounced names of the letters M and N in English, …\n\nAnd only in English?\n\n"
    },
    {
      "time": "14 May 2013 — 4:57am",
      "content": "Ditto in Dutch. And German. And French (softer endings).\n\n"
    },
    {
      "time": "14 May 2013 — 10:30am",
      "content": "My point was that the original poster hadn't offered any reason why he thinks 'the real origins of em could be found not in English sources, but rather in other ones: espesially in old Italian and French, maybe German and even medieval Latin', rather than the simpler and more direct derivation from the English pronunciation of these letter names. Yes, the same or similar pronunciation of these letter names exist in other languages. Do the terms 'em' and 'en' exist in any of those languages as native terms for measures of type?\n\n"
    },
    {
      "time": "14 May 2013 — 10:42am",
      "content": "There is a glossary in Huib van Krimpen’s ‘Boek’ with the equivalents/translations of graphic arts terms in English, Dutch, German and French. He only mentions ‘em quad’ and ‘en quad’:\n\nem quad = vierkantje = Geviert = cadratin  \nen quad = pasje = Halbgeviert = demi-cadratin\n\nVan Krimpen being the authority in my country, it is a fair assumption that in the Low Countries ‘em’ and ‘en’ have never been recognized terms up to the moment the dtp-revolution happened.\n\n"
    },
    {
      "time": "30 May 2013 — 5:11am",
      "content": "Interesting. Prompted me to reach for my old 1932 edition of <cite>What a Compositor Should Know</cite> by a certain W. H. Slater.\n\nMr. Slater goes to some length to detail _The Story of the Point System_ and the Pica Em in particular, from Fournier the younger to the Chicago fire, but fails completely to deal with the origins of the term _em_ or _en_.\n\nI'm with the notion of corruptions of _nut_ and _mutton_. The old guy I was apprenticed to in the 60s (and others I worked with of his generation), would tend to use the terms nut and mutton at least as much, if not more than en and em.\n\nOf course, that just begs the question why nut and mutton? and so doesn't help a great deal.\n\n"
    },
    {
      "time": "30 May 2013 — 5:17am",
      "content": "As a PS.\n\nIt could of course be the other way round.\n\nWhen questioned (by me), the boss-man opined that the use of _nut_ and _mutton_ was simply a way of avoiding confusion between the two. Myth Plausible.\n\n"
    },
    {
      "time": "30 May 2013 — 6:44am",
      "content": "> that just begs the question why nut and mutton?\n\nof course _mutton_ was needed, otherwise, one couldn’t steal sheep …\n\n– [what it may look like](http://web.archive.org/web/20130820213124/http:/www.flickr.com/photos/litherland/3936829334/)  \n– [or even worse than that …](http://web.archive.org/web/20130820213124/http:/www.flickr.com/photos/albert-jan_pool/7822326350/)  \n– [the guy that told us about this crime](http://web.archive.org/web/20130820213124/http:/www.flickr.com/photos/fontshop/7515864202/)  \n– [the book in which one can find more about this](http://web.archive.org/web/20130820213124/http:/www.flickr.com/photos/dawidpalen/4616864189/)\n\n"
    },
    {
      "time": "30 May 2013 — 7:04am",
      "content": "The usual explanation of nut and mutton is that these were used in composing rooms because it was so easy to confuse em and en. Remember that many composing rooms were close to running presses, so would be noisy. It was easy to mis-hear em for en and vice versa, and hence compositors took to using mutton and nut.\n\n"
    }
  ]
}
