{
  "id": "102903",
  "title": "Rules for academic essays/dissertations",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I find myself in a situation in which I can prescribe rules for students writing final undergraduate essays. I have considered not mentioning formatting or typographical rules, or refer to the library's rules (always an interpretation of the pervasive nation-wide rules). I find both options unappealing, because the former leaves too much room for error (and random ugliness) and the latter is too strict and dull (a pattern of bad taste).\n\nDo you think I should just let it be, or that I could establish some pretty wide parameters (or a compromise solution)? Or determine that the supervisor might adjust the formatting if need be?\n\nIf yes, what are some sensible and generic requirements I can establish?\n\n",
  "author": "ycherem",
  "time": "9 May 2013 — 2:03pm",
  "uid": "46458",
  "comments": [
    {
      "time": "9 May 2013 — 5:09pm",
      "content": "Let's see if I understand. You apparently have the authority -- the power -- to impose certain conditions.\n\nBased on your questions on Typophile ( [http://typophile.com/user/46458](http://web.archive.org/web/20130820060619/http:/typophile.com/user/46458 \"http://typophile.com/user/46458\")), that authority does not seem to be derived from knowledge. That leaves, I suppose, the academic equivalent of Mao's barrel of a gun. Are you asking us if you should use your guns?\n\n"
    },
    {
      "time": "9 May 2013 — 5:24pm",
      "content": "Charles:  \n1) What specific things has Youssef said in the past that make you think he's ignorant?  \n2) Maybe asking for opinions/ideas indicates an open-minded desire to learn more. I know at least one other person who would benefit from such an attitude...\n\nhhp\n\n"
    },
    {
      "time": "9 May 2013 — 6:19pm",
      "content": "@charles,\n\nIt's the second time you bug me with questions of my previous posts. I agree that discussions on typophile may get heated, but demeaning other people's desire to learn is unacceptable. I was only asking for advice, and you are not qualified to judge my knowledge of anything whatsoever.\n\n\"Quem fala o que quer, escuta o que não quer\": e se for julgar os seus posts, eu também diria: \"Quando um burro fala, o outro abaixa a orelha\".\n\n"
    },
    {
      "time": "9 May 2013 — 6:29pm",
      "content": "Certainly an odd situation.\n\nIf I were you I’d reference the Chicago Manual of Style and take what you will from there.\n\nAs an undergraduate student myself, most professors don’t worry much about typographic correctness—the focus is on more general style laws such as correct quoting and citing.\n\nSimply pick an appropriate style, such as MLA or APA, and tell the students to follow that.\n\nUnless it is a paper on typography or design, then of course be sure to look for good leading, em/en dashes, correct curly quotes, etc.\n\n"
    },
    {
      "time": "9 May 2013 — 6:29pm",
      "content": "Assuming that one of the purposes of education is to prepare students for later life, it would be advisable to encourage students to adopt a style which will meet recognized objective standards of good form, rather than your personal opinion of what constitutes same.\n\nTo this end, I humbly suggest that you consult the Chicago Manual of Style, and apply it rigorously.\n\n"
    },
    {
      "time": "10 May 2013 — 8:42pm",
      "content": "Variations on this question come up a lot, and I think they often result from a misunderstanding of what typography actually is, which is the design of a finished text for publishing or distributing. There is manuscript formatting (_typing_), which is practiced by authors; and then there is design (_typography_), which is practiced by typographers, typesetters, and graphic designers.\n\nAn academic essay should follow some standard _manuscript format_, which is completely different from the design of a well typeset published text. \"Ugliness\" would not be a concern of mine in this situation — not until one of these essays goes to press in a journal. Then I would care.\n\nIn an academic setting, papers should be double-spaced with 1 inch margins in some boring old normal font on 8.5 x 11 paper. This is a vaguely old-fashioned view and not everyone will agree with it, but I would not encourage students to \"design\" manuscripts. Leave that to the book designer whose hands the manuscript eventually winds up in.\n\nAs has been said above, if this is actually a design class, all that goes out the window.\n\n"
    },
    {
      "time": "11 May 2013 — 9:53am",
      "content": "_[sorry for the non-English answer, but I am focusing some issues very specific to Brazilian academic norms, known as “ABNT rules”, and it would need somewhat longer English explanations to make sense for other typophiles.]_\n\nYoussef, entendo sua preocupação porque também não gosto das normas da ABNT. Elas já eram ruins antes e ficaram ainda piores com a atualização de 2002-2003. Tenho certeza que ninguém na ABNT conhece um mínimo de tipografia ou editoração, mas ainda assim determinam como milhares de estudantes têm de formatar seus trabalhos.\n\nJá o manual de Chicago é uma referência mais ou menos universal e muito bem feita, muito superior à ABNT. O problema é que os estudantes já têm dificuldade para aplicar as normas da ABNT e não acho que trocar um conjunto de regras por outro vá ajudar no seu caso. Mesmo que houvesse uma versão traduzida e simplificada das normas de Chicago, creio que isso só confundiria os acadêmicos. Além disso, certos aspectos do sistema americano são bem estranhos para os nossos hábitos.\n\nO que eu faria no seu caso seria editar um desses manuais que as faculdades fornecem sobre as normas da ABNT usadas pela instituição. Removeria todas as regras e detalhes excessivamente rígidos e desnecessários, fazendo uma orientação simples. Exemplo: a entrelinha com espaçamento duplo é uma aberração, resquício das máquinas de escrever e de quando o professor anotava as correções no espaço _entre_ as linhas. Hoje, o professor não está limitado às linhas em branco, pode mandar observações por email ou mesmo colocar notas diretamente no arquivo digital, em cor ou tipo diferente. Assim, a entrelinha dupla pode (e deve) ser dispensada.\n\nPor outro lado, acrescentaria algumas regras tipográficas flexíveis. Por exemplo: quanto às fontes, orientar o uso de apenas uma serifada em todo documento ou uma serifada nos textos em geral e uma não serifada nos títulos e subtítulos, apresentando uma lista de fontes a escolher (já que dificilmente o pessoa saberia o que é “serifada”). Quanto à separação silábica, reiterar que ela deve ser usada. Quanto ao alinhamento, usar o justificado no texto em geral, mas permitir o centralizado em títulos e subtítulos. Coisas assim.\n\nFicaria ainda melhor se no manual você incluísse breves notas explicando porque determinado critério deve ser observado. Por exemplo: a fonte serifada é melhor para leitura imersiva porque as letras são melhor diferenciadas e a visão, que se cansa com a leitura, é favorecida quando não é preciso fazer esforço para distinguir um n de um ri ou um l de u I (problemas típicos das não serifadas). Assim, os alunos são seguiriam as regras apenas porque o professor determinou, mas adeririam a elas porque há um motivo lógico para serem adotadas.\n\nAproveitando o exemplo da entrelinha: se o espaço duplo é horrendo e prejudicial à leitura (um texto visualmente rarefeito contraria o fluxo de atenção), tampouco é adequado usar linhas muito estreitas. Basta lembrar aos alunos quantas vezes eles já não estavam lendo um jornal ou revista e, ao terminar a linha, seus olhos recomeçaram a ler a mesma linha e não a seguinte. Isso indica entrelinha muito apertada, coisa típica de jornais, e deve ser evitada com uma folga, usualmente de 20% da altura do texto. Um explicação dessas seria um alento para a nossa educação.\n\nQuanto ao sujeito que respondeu de maneira grosseira, o melhor é ignorá-lo. Não é de hoje que a criatura em questão tumultua as discussões por aqui. Felizmente, há muitas pessoas com conhecimento e educação e com essas eu sempre aprendo bastante. Se você achar que posso ajudar de alguma outra forma, basta escrever para contato arroba if ponto pro ponto br.\n\n"
    },
    {
      "time": "11 May 2013 — 11:04am",
      "content": "_In an academic setting, papers should be double-spaced with 1 inch margins in some boring old normal font on 8.5 x 11 paper. This is a vaguely old-fashioned view and not everyone will agree with it..._\n\nI agree with the notion that there should typically be a standard format for all submissions, required by whomever is receiving them and will be marking them. This is a simple expedient for ensuring that all students have conformed to the length requirement of the submission.\\* But I also think that this standard format should serve some functional purpose relative to how it will be handled. The old 'double-spaced with 1 inch margins' format is, as Joshua suggests, related to manuscript submission requirements for publication, so in the context of academia was a good way to condition graduate students to producing such manuscripts. The format is designed to enable copy editing between the lines of text. It was introduced in the context of typewriter copy, however, and ignores the ease with which computer documents are reformatted these days. So I think it is entirely reasonable for a teacher to consider different formats, but this should be done not in in terms of ugliness or beauty, but in terms of usefulness. How does the teacher intend to engage with the document? Will he or she be marking grammatical and other textual problems? If so, there remains some merit in the double-spaced requirement, since what the teacher will be doing is akin to copy editing. But these days how many teachers regularly mark student submissions in this way (how many, frankly, are qualified to do so)? If the kind of written feedback a teacher provides addresses content, then a wider margin on one side is going to be more useful than double-spacing.\n\n"
    },
    {
      "time": "11 May 2013 — 1:29pm",
      "content": "I had a look at the document [Manual de normalização](http://web.archive.org/web/20130820060619/http:/humanas.unifesp.br/home/index.php/biblioteca/manual-de-normalizacao) of the UNIFESP Guarulhos, dated 2012, and the suggested spacing is 1.5.\n\n> O espaçamento deve ser de 1,5 entre as linhas de todo o trabalho, exceto as partes a seguir […]\n\nWe have the same [requirement at Université de Montréal](http://web.archive.org/web/20130820060619/http:/www.bib.umontreal.ca/theses/redaction.htm) (follow the link for pdf, in French) and I am a bit surprised that many still mention 2 as the standard.\n\n"
    },
    {
      "time": "11 May 2013 — 1:43pm",
      "content": "\\* It's worth noting in the context of linespacing that most word processing software calculates this relative to font metrics, so 1.5 or 2 times single linespacing is going to vary depending on what font is used.\n\n"
    },
    {
      "time": "11 May 2013 — 2:17pm",
      "content": "\\* It is worth noting that the same document (from the federal university of São Paulo in Guarulhos) says\n\n> Os textos devem ser digitados em fonte Arial ou Times New Roman, cor preta, tamanho 12.\n\n\"cor preta\" means \"black\", and \"tamanho 12\" mean \"size 12\" ... 12 points. Most readers can't tell the difference between Times New Roman and lots of serif fonts, but if the spacing is not chosen as the one given by Times, my guess is that it will be noticed.\n\n"
    },
    {
      "time": "11 May 2013 — 6:26pm",
      "content": "@Michel, Yes, it's 1.5. (It's been like this as much as I can remeber, and many universities and publications follow this format.)\n\n"
    },
    {
      "time": "11 May 2013 — 6:37pm",
      "content": "@Igor, Thanks a lot for your attention, I appreciate it. It's just those simple (and simplifying) rules I had thought about. Just making the students lives _easier_, I guess. I didn't intend to change one set of rules for another, and in a way I'm sort of \"forced\" to teach formatting (something I've been trying to avoid). And thanks for remembering hyphenation, leading, suggest serifs for body text and the small explanations about the reason for all those things.\n\n"
    },
    {
      "time": "11 May 2013 — 6:38pm",
      "content": "> An academic essay should follow some standard manuscript format, which is completely different from the design of a well typeset published text. \"Ugliness\" would not be a concern of mine in this situation — not until one of these essays goes to press in a journal. Then I would care.\n\nThe notion of an academic \\*journal\\* is a strange one. I say this as someone who has both typeset a number of scholarly journals for an extended period of time -- over ten years with some journals -- and as one who has designed them.\n\nThe difficulties arise with authors, and editors who have sense enough to recognize something special, and let it by.\n\nWithin the text, over that 10 years, you'll have prose extracts that contain within them subheads, verse extracts. lists -- whatever can be written can be quoted. In the current journal, what's the style for these elements?\n\nSomeone will occasionally think it important to have epigraphs to their subheads.\n\nYou'll have numbered lists within bulleted lists. Etc.\n\nEssentially, whatever complication anyone can think of will occur.\n\nChapter openings perforce contain an article title and author (or two or three or five). But some will use a subtitle, some an epigraph, and/or a dedication, and/or a text opening subhead -- and occasionally, all these elements -- usually when the title/subtitle is quite long and there are five authors...\n\nMany of the authors of such articles seem have the (today's) stature of Paul Samuelson; both good and famous. On both accounts, you don't say anything but yes, sir...\n\nOr:  \nI set one legal journal that called a footnote is the first line of the article. I say footnote, as that's what was used, not end-of-article notes. That footnote went on for three typeset pages. The next note was called in the third line of the text.\n\nSo, after we all put our heads together, we set the article opening, two lines of text, then the called footnote for the next three pages, and only then the third line of the text (which called footnote 2) etc. In short, standard, but worrisome for all of that.\n\nNow the first point of all this is that the design of a journal better be simple, in order to be flexible.\n\nThe second point is there are articles where all these elements do turn out to be important; where the text is the better for their use. Of course not all of the articles, but enough to provide for their accommodation.\n\nSo, journals \\*design\\* is the hardest thing there is, because you cannot see, or even anticipate, all the elements to attend to.\n\nThe same, I would think, for student work, from doctoral dissertations on down. Good research & good writing are just that. You can penalize the overly flamboyant when that's all it is, but you shouldn't prohibit anything. One of the hard parts about being a teacher is recognizing the difference, especially with students doing upper level or graduate work. Yes, I've been there, I wasn't that good at it, and is one reason I didn't like teaching.\n\n"
    },
    {
      "time": "11 May 2013 — 6:51pm",
      "content": "@John, I agree I should think about usefulness. On the other hand, many \"manuals\" of style I've come across don't follow their own rules. It's hard to be consistent -- especially when people are trying to focus on content -- but typographical inconsistencies tend to distract the reader.\n\nI guess an option of 1,5 spacing or 20%+ leading would be sensible, or am I off the mark here?\n\nWhile I must confess I (and some other people) do that grammar and textual revision, most don't. Many professors don't even check if it complies to the formatting rules, \"more or less\" is always accepted.\n\nAnyway, it's always a4 or letter paper, so I wonder if margins could be wider too (currently 2cm right and bottom; 3cm left and superior).\n\n"
    },
    {
      "time": "11 May 2013 — 9:40pm",
      "content": "\"Good research & good writing are just that. You can penalize the overly flamboyant when that's all it is, but you shouldn't prohibit anything.\"\n\nYes.\n\nMy main point above was that the traditions and standards of manuscripts are different from those of published papers — but as long as a student understands the basic expectations of format, there's no reason they shouldn't adjust as necessary for their specific paper.\n\nAs a college student, I've recently written a paper in English that contained both Hebrew and IPA. I've written other papers that quoted Anglo-Saxon and included metrical stress notations and specialized poetry layouts for the sake of making a linguistic point. Sometimes I had to use something other than Times or some indent other than half an inch. But even as a fairly experienced typographer, I resist \"designing\" my academic papers more than is really necessary to make my argument. If I were designing them as part of a journal, they would look much different and more polished than they do for class.\n\n"
    },
    {
      "time": "11 May 2013 — 9:40pm",
      "content": "\"Good research & good writing are just that. You can penalize the overly flamboyant when that's all it is, but you shouldn't prohibit anything.\"\n\nYes.\n\nMy main point above was that the traditions and standards of manuscripts are different from those of published papers — but as long as a student understands the basic expectations of format, there's no reason they shouldn't adjust as necessary for their specific paper.\n\nAs a college student, I've recently written a paper in English that contained both Hebrew and IPA. I've written other papers that quoted Anglo-Saxon and included metrical stress notations and specialized poetry layouts for the sake of making a linguistic point. Sometimes I had to use something other than Times or some indent other than half an inch. But even as a fairly experienced typographer, I resist \"designing\" my academic papers more than is really necessary to make my argument. If I were designing them as part of a journal, they would look much different and more polished than they do for class.\n\n"
    },
    {
      "time": "12 May 2013 — 6:21am",
      "content": "For a thesis that departs from \"boring\" models, there is the LaTeX [Classic Thesis](http://web.archive.org/web/20130820060619/http:/www.latextemplates.com/template/classicthesis-typographic-thesis) class that comes installed with [texlive](http://web.archive.org/web/20130820060619/http:/www.tug.org/texlive/) 2012 ( [MacTeX](http://web.archive.org/web/20130820060619/http:/www.tug.org/mactex/)) ; the sources from the link [Classic Thesis](http://web.archive.org/web/20130820060619/http:/www.latextemplates.com/template/classicthesis-typographic-thesis) compile directly with pdflatex.\n\n"
    },
    {
      "time": "12 May 2013 — 6:56am",
      "content": "[to follow]\n\n"
    },
    {
      "time": "12 May 2013 — 7:14am",
      "content": "I agree with S.Olsen. Pick an established style such as MLA or APA and be done with it. It has the following benefits:\n\na) Saves you time. No need to develop your own style guides.  \nb) Teaches your students a format that most journals will **require** manuscripts to be submitted in. They will most cartainly need to do this at some point in their academic career anyway.  \nc) Safes future teachers time from having decode a unique typographic system out of a stack of similarly formatted papers—should students continue to follow your unique guidelines.\n\n"
    },
    {
      "time": "12 May 2013 — 8:33am",
      "content": "Just a by-the-way... Manuscripts -- really, typescripts (now properly termed \"printouts\") -- submitted to publishers use to be double spaced to make the editor's job of \"pencil editing\" easier. (Also to get an approximate estimation of length, but a castoff is a different story.)\n\nAs everything with \"manuscripts\" has changed, I'd expect that over time, what is comfortable and familiar will change too, to accommodate new procedures, where the computer file is everything.\n\n"
    },
    {
      "time": "12 May 2013 — 8:21am",
      "content": "@Michel,\n\nClassic Thesis is great and I've tried it myself -- but for short articles.  \nBut then I'd have to introduce them to Latex convince them of its benefits, which is a whole different matter.  \nBut it would make it all easier: \"Know Latex? Use this and that. Period.\"\n\n"
    },
    {
      "time": "12 May 2013 — 12:02pm",
      "content": "> Manuscripts -- really, typescripts (now properly termed \"printouts\") -- submitted to publishers [...] [Charles]\n\nI don't know what the practice is in the humanities and social sciences; personally, I have not submitted a \"printout\" in a long time. What I have been submitting in the last 10 years (and more) is LaTeX sources, relying on the LaTeX package suggested (required?) by the journal or the conference. Some publishers have their own package, for instance [Elsevier](http://web.archive.org/web/20130820060619/http:/www.elsevier.com/author-schemas/preparing-documents-with-latex); have a look at some templates for [academic journals](http://web.archive.org/web/20130820060619/http:/www.latextemplates.com/cat/academic-journals); on the example provided for elsarticle (Elsevier), lines are individually numbered; it would be crazy to do that manually. In my opinion, it is almost as crazy to spend time formatting footnotes for references and bibliography entries instead of using the software that does it in a systematic and coherent fashion. Students should be given the tools to work intelligently and efficiently.\n\n"
    },
    {
      "time": "12 May 2013 — 1:50pm",
      "content": "> Students should be given the tools to work intelligently and efficiently.\n\nAgreed.\n\nOf the journals we set, all are in either the humanities or social sciences. I don't believe they would accept a \"manuscript\" in LaTex, as the editors would not be able to work on the files.\n\nWe've done some bookwork for presses who get in LaTex files from time to time. There are people who can convert these to the format acceptable to the press, so we decline to set these -- Strictly based on economics, it would cost more for us to do the conversion than for someone set up to do that routinely.\n\nBut the point I was trying to make is that the look of any paper/thesis/dissertation -- double-spaced with such & such margins, had less to do with typography than with the mechanics of preparing a manuscript for eventual composition. As pencil editing is no longer the preferred method of editing, what \"manuscripts\" should look like (and their for-practice precursors -- papers, theses, dissertations) , is a bit up in the air.\n\n"
    },
    {
      "time": "12 May 2013 — 3:53pm",
      "content": "Charles\n\nI agree that the way a printout looks like can be quite irrelevant. Just changing a package in the preamble of a LaTeX file can change completely the look without affecting at all the content of the output, just changing a word can replace a single column output by a two column output.\n\nHowever, for a final undergraduate essay, no professional editor will ever take it as a \"manuscript\"; what the student sees is all he'll ever get.\n\n"
    },
    {
      "time": "12 May 2013 — 4:12pm",
      "content": "> However, for a final undergraduate essay, no professional editor will ever take it as a \"manuscript\"; what the student sees is all he'll ever get.\n\nWhich gets back to the original question: What are these documents for? Practice for becoming an eventual professional in the field? Even if it will not become ones profession?\n\nOr, coming as close as one can to a final presentation, given that several text editors are essentially layout engines, and fonts common. Yet design is itself another profession...\n\n"
    },
    {
      "time": "12 May 2013 — 5:30pm",
      "content": "It was my understanding that this is what is called TCC in Brazil, [Trabalho de conclusão de curso](http://web.archive.org/web/20130820060619/http:/pt.wikipedia.org/wiki/Trabalho_de_conclus%C3%A3o_de_curso). Students learn how to search for references on a given subject, cite them, make a bibliography, etc. They need to show understanding of their subject, and give proper credit to those they are referring to. The reader should be able to check the validity of all statements from the argumentation and the given references. The Brazilians will correct me if I am wrong or missed something.\n\n"
    },
    {
      "time": "12 May 2013 — 5:57pm",
      "content": "@Michel,\n\nYes, you're right. It's a final undergraduate essay or any equivalent term.\n\nNo, it's not a design course. (If someone hasn't realized that yet...)\n\nFinally, I don't see why editors wouldn't be able to \"work on\" Latex files, but that's another issue. As far as I know, and as far as I'm concerned, Latex does a pretty decent job typesetting for people who are not themselves professional typesetters.\n\nReviewers/readers can comment between double-spaced lines or along the margins (if they're wide enough), or using Adobe Reader, or on the document itself -- no matter the format. Or on a piece of paper. It's really irrelevant.\n\n"
    },
    {
      "time": "12 May 2013 — 5:57pm",
      "content": ".\n\n"
    },
    {
      "time": "12 May 2013 — 6:05pm",
      "content": "You are right, Michel. TCC, also called “monograph”, is a research work presented to conclude graduation. Students may be asked to produce other similar works during graduation, with narrower subjects. Its formatting is Youssef's target. There is a set of general rules defined by ABNT, a national equivalent to ISO or DIN. Universities adopt them in variable degrees. Unhappily, these rules are quite deficient regarding DTP.\n\n"
    },
    {
      "time": "12 May 2013 — 8:05pm",
      "content": "If I had a dollar for every time I started thinking about the font before I started writing the paper […](http://web.archive.org/web/20130820060619/https:/www.youtube.com/watch?v=GO22Z0T3qPE)\n\n"
    },
    {
      "time": "13 May 2013 — 6:08am",
      "content": "For a student that has never used a markup or computer language and that might have a hard time finding a missing closing brace or bracket in his input file, I think LaTeX could be quite traumatizing; [LyX](http://web.archive.org/web/20130820060619/http:/en.wikipedia.org/wiki/Lyx) might be the solution. I have seen a full M.Sc. thesis in computer science written with LyX, which shows it can serve as a workhorse. On the other hand LyX follows the [What You See Is What You Mean](http://web.archive.org/web/20130820060619/http:/en.wikipedia.org/wiki/WYSIWYM) paradigm, so that (so far as I understand for basic use) the student would not have to deal himself with markup elements, he would simply deal with the content and the professor in charge can adjust the LaTeX packages if needed. I must however say that I have never used LyX, not even on the .lyx files provided by the student; I just compiled the corresponding .tex files with pdflatex.\n\n"
    },
    {
      "time": "13 May 2013 — 5:43pm",
      "content": "@Chris: Which font did you choose?\n\n"
    }
  ]
}
