{
  "id": "102936",
  "title": "Outsourcing font building",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I am interested in having my vector designs turned into functioning fonts. I would like to outsource this part of the job though. The font I have designed is quite simple. I am hoping someone can direct me toward someone reputable. The fonts are odd and geometric, and wouldn't require pinpoint perfection.\n\nNo doubt this has been asked about before, but I wasn't able to find a thread. If so please drop me a link.\n\nThanks so much,\n\nRuss\n\n",
  "author": "R-ss-ll",
  "time": "10 May 2013 — 11:52pm",
  "uid": "211394",
  "comments": [
    {
      "time": "11 May 2013 — 11:17am",
      "content": "I could do this for you. Email me at [kwpease@comcast.net](mailto:kwpease@comcast.net) and show me what I'd be working on, and I'll give you a quote.\n\n"
    },
    {
      "time": "14 May 2013 — 3:05am",
      "content": "If you send me the file, I can offer you a quote. filip (at) designiq.cz.  \n [http://fontservice.typo.cz/](http://web.archive.org/web/20150420064848/http:/fontservice.typo.cz/ \"http://fontservice.typo.cz/\")\n\n"
    },
    {
      "time": "14 May 2013 — 3:16am",
      "content": "Sorry, for duplicate posts, not my fault.\n\n"
    },
    {
      "time": "14 May 2013 — 3:16am",
      "content": "Sorry, for duplicate posts, not my fault.\n\n"
    },
    {
      "time": "14 May 2013 — 3:15am",
      "content": "Sorry, for dupliacete posts, not my fault.\n\n"
    },
    {
      "time": "14 May 2013 — 6:20am",
      "content": "Filip, I'm delighted to see that you've cloned yourself! ;-)\n\nRuss, please also consider my services for this project - you can email me for a quote: hpapazian at gmail dot com  \nFYI, the fee will depend on the following things: the number of glyphs, whether they're all at the same scale, what level of screen rendering quality you desire, and how quickly you need it done.\n\nhhp\n\n"
    },
    {
      "time": "15 May 2013 — 12:25pm",
      "content": "Obviously I'm also interested. Feel free to contact me [jobs@ferfolio.com](mailto:jobs@ferfolio.com) // [www.ferfolio.com](http://web.archive.org/web/20150420064848/http:/www.ferfolio.com/ \"www.ferfolio.com\")\n\nKind regards!\n\nPS: I think you've come to the only forum where you can ask people to design a typeface... you will probably have a lot of (awesome) offers from type designers, and no one will reply 'Do whaaat???'\n\n"
    }
  ]
}
