{
  "id": "10314",
  "title": "Logo comments",
  "forum": "Design",
  "tags": [

  ],
  "content": "Would appreciate some suggestions on this design...Thanks   \n   \n   \n<!--attachment: logo_henley_cwk__DR_-69763.pdf*mime_pdf.gif*application/pdf*123.0*logo*logo%2ehenley%2ecwk+%26%2340%3bDR%26%2341%3b%2epdf -->\n\n<center>\n<br>\n<table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20051122170022im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">logo<br><a href=\"http://web.archive.org/web/20051122170022/http:/www.typophile.com/forums/messages/4100/logo_henley_cwk__DR_-69763.pdf\" target=\"_blank\"><b>logo.henley.cwk (DR).pdf</b></a> (123.0 k)</td></tr></table>\n</center>\n<!--/attachment-->\n",
  "author": "chicky",
  "time": "14 April, 2005 - 10:39am",
  "uid": "2369",
  "comments": [
    {
      "time": " 14 April, 2005 - 1:53pm",
      "content": "Did you investigate using more of a blueprint look? As for the type while well set, its boring. You also don't have anything unified. The top of the house looks like clip art, the Initials don't mean anything. Look at a typeface like Eaglefeather based on Frank Lloyd Wrights handwriting. Make the house graphic more abstract and make the contact info part of your schematic. A large part of custom home design is on interior elements (windows, beamed ceilings etc) maybe that imagery would help you. Good start, keep working.\n\n"
    },
    {
      "time": " 18 April, 2005 - 8:01pm",
      "content": "Is this closer? I'm cautious of using Eaglefeather since this is a designer, not architect.   \n   \n<!--attachment: logo_henley_1-70122.pdf*mime_pdf.gif*application/pdf*28.9*logo%2ehenley%2e1*logo%2ehenley%2e1%2epdf -->\n\n<center>\n<br>\n<table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20051122170022im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">logo.henley.1<br><a href=\"http://web.archive.org/web/20051122170022/http:/www.typophile.com/forums/messages/4100/logo_henley_1-70122.pdf\" target=\"_blank\"><b>logo.henley.1.pdf</b></a> (28.9 k)</td></tr></table>\n</center><!--/attachment-->\n"
    },
    {
      "time": " 18 April, 2005 - 9:00pm",
      "content": "Design critique aside.   \n   \nAs far as reproduction, I would be careful of this design, depending on it's intended use. Much of that tiny detail that is already getting lost on the web is going to be a blob on anything printed.\n\n"
    },
    {
      "time": " 19 April, 2005 - 12:10am",
      "content": "I like the way the large HD is holding up the roof and the fact that it's resting on a foundation that spells out Henley Designs.   \n   \nThat sort of says it all to me   \n  \nThe smaller HD imho isn't needed and as Mark said would be tough to reproduce.   \n   \nI don't have any idea how you would solve the house being shorter though should you take the wee HD out.   \n   \nBest,   \n/b\n\n"
    },
    {
      "time": " 19 April, 2005 - 5:43am",
      "content": "In your latest version loose the halftone in the dream balloon it will cause problems in smaller sizes (fill in). My problem with your house is it is a specific style of house. If I'm right your client will design any \"Dream\" house. That said look into making the image in the balloon abstract, like a piece of a blue print. You don't need a lot of detail to get the point across. I would loose the date and everything but the name. Those are elements that can be put in different places based on the layout. You could put the address phone etc at the bottom of a letterhead but you will always want the name and the illustration to stay together. Keep going!\n\n"
    }
  ]
}
