{
  "id": "10315",
  "title": "Class spacing/metrics in Fontlab",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "There's plenty of info about kerning in the Fontlab manual, but very little about spacing, which is very important to get right before you start kerning.   \nI've been messing around with Fontlab for ages trying to figure out how to create the equivalent of Fontographer's equivalence classes. Fontographer had a very simple but effective way of applying the same sidebearing values over a range of characters with similar characteristics, ie. take the sidebearing on the left of cap H (the base character, just H by the way, and not \\_fog0, H) and apply the same value to the left of B, D, E, F, I, K, L, M, N etc. You could copy and paste the characters from the metrics window into the metrics assistance 'apply to these characters' line.   \nIs there no way to do this in Fontlab? Is typing the characters the only way to do this? It can be particularly long-winded if, say, you are doing a Cyrillic alphabet and you have to type afii10058 (or whatever) for each character.   \nAnd another thing: I can't seem to delete a line once it's there - no delete possible? What happens if I want to get rid of the whole lot and start again/or import metrics from another font instead?   \nAlso, when you click on the apply and save button the Metrics Assistance window disappears and you have to go and open it from the menu again.   \nIt's all a bit clumsy and non-designer friendly, more aimed at programmers I'd say.   \n   \nI'd appreciate any help on this   \n   \nThanks in advance   \n   \nNick Cooke\n\n",
  "author": "Nick Cooke",
  "time": "14 Apr 2005 — 11:07am",
  "uid": "3834",
  "comments": [
    {
      "time": "19 Apr 2005 — 7:04am",
      "content": "Try this:   \n   \nSelect the glyphs you want to modify (hold down the command key) in the main window.   \nThen: Tools\\>Transform\\>Metrics\\>Set Sidebearings\n\n"
    },
    {
      "time": "20 Apr 2005 — 2:15am",
      "content": "Thanks for that Nick, but that only works one time. What I am trying to do is apply the same sidebearing values to characters with similar characteristics based upon the values of one character, so that if the sidebearings change on that base character the changes are applied to all the other characters. This ensures spacing consistency as you only change the value of the base character.   \nTake the word ILFRACOMBE where I is the base character. If I add more space around the I the whole word opens up like so: I L F RACO M B E apart from ACO which are not straight sided.   \nI have sussed put how to do it. It can be done in the Metrics Assistance panel under 'Tools', but lines can't be deleted here for some unknown reason. To delete an unwanted line you have open to the Collection/Classes panel in the top toolbar, select the line you want to delete in the 'classes' window and delete it there. It is called kerning classes, but is really the metrics class one sets in 'Metrics Assistance'. The incorrect terminology was confusing me. This info can then be saved as a .flc file by clicking the menu icon, which can then be used for other fonts. It's very long-winded initially but can save a lot of time in the long run.   \n   \nPhew! that's all for now.\n\n"
    }
  ]
}
