{
  "id": "103161",
  "title": "Need Font Name",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Could anyone tell me the name of this font  \nand if the striped outline has been added or  \nis it included in the font\n\n| Attachment | Size |\n| --- | --- |\n| [image.jpg](http://web.archive.org/web/20130609214531/http:/typophile.com/files/image_53.jpg) | 13.42 KB |\n\n",
  "author": "Bookie8895",
  "time": "20 May 2013 — 6:18am",
  "uid": "211627",
  "comments": [
    {
      "time": "20 May 2013 — 7:06am",
      "content": "The “striped outline” is a thin stroke added to the font, which has been poorly antialiased in this example.\n\n"
    },
    {
      "time": "20 May 2013 — 7:36am",
      "content": "Thank you for your answer.... by any chance, do you know the name of this font?\n\n"
    },
    {
      "time": "20 May 2013 — 2:21pm",
      "content": "[Scrypticali](http://web.archive.org/web/20130609214531/http:/www.ffonts.net/Scrypticali-Italic.font)\n\n"
    },
    {
      "time": "20 May 2013 — 2:43pm",
      "content": "Thank you so much... defiantone.....  \nDo you by any chance do texting on photo's?  \nI wanted my name done in this font, same color and same outline as this sample, put on a picture. I could send the picture....  \nDo you know of anyone that would do it? Are you by chance on FB?.... Please let me know if you are interested in doing it...  \nThanks for any help.....Donna\n\n"
    },
    {
      "time": "20 May 2013 — 3:04pm",
      "content": "you can really do it yourself, using a free online photo editor.  \n [Pixlr](http://web.archive.org/web/20130609214531/http:/pixlr.com/editor/) works decent enough. I made the image below in just a couple of minutes. the \"outline\" is an outer glow set after rasterizing the text.\n\n ![](http://web.archive.org/web/20130609214531im_/http:/typophile.com/files/Untitled_4398.jpg)\n\n"
    },
    {
      "time": "20 May 2013 — 5:37pm",
      "content": "Thank you...defiantone ...  \nBut.....  \nI don't have a computer.... All I have is an iPhone 5.  \nI have gotten so many font app's I could open a font app store...lol  \nAll of the fonts are pretty plain..even ugly..... . I buy the app thinking there will be a few good ones in there but... Nope!  \nThey are all the same.... And none if them have this font with the outline (whatever it is, striped, rippled, etc... I don't know what it is,..... whatever it is, I like it..... And.... I for sure can't find that blue color. Thanks for my name.....it's pretty!!!!!  \nThanks again......Donna.\n\n"
    },
    {
      "time": "20 May 2013 — 5:43pm",
      "content": "You're an accountant and you don't have a computer? You must have mad abacus skillz, grrl!!\n\nGet a computer. Or at least a real phone.\n\nhhp\n\n"
    },
    {
      "time": "21 May 2013 — 1:22am",
      "content": "Hi hrant....  \nThank you for even being interested in my post. There was no reason to give such a negative post.... I thought my post was about fonts, not for someone trying to be funny at someone's else's expense....You should know someone's story before you make fun of them....because..... Their story might not be so FUNNY!!!!!!  \nI did not say I was an accountant...  \nI said \"I worked in accounting\" Sorry to say... There are many aspects to accounting...Not all of them being high paying jobs....  \nAs far as having a computer....My grandson needed a computer for school and not being able to afford one, I gave him mine....  \nI am not working right now.... My husband and son passed away and I am having a hard time handling it.... I can't afford to get a new computer....so..... I just use my phone for right now....  \nGoing without a computer was my choice.....My grandson needed it more than I did...That's what parents and grandparents do for their children....  \nAnd.....  \nMy iPhone works just fine.... I just can't get the fonts I would like to use...That's all......lol\n\n"
    },
    {
      "time": "21 May 2013 — 5:53am",
      "content": "I'm sorry to hear about the troubles and tragedies in your life.\n\nI just have difficulty fathoming somebody having an expensive cellphone (plus the resultant high monthly bill) but not being able to even go to a public library to use a computer (for free). I've had a computer since 1977 but I got my first cellphone in February.\n\nJust for future reference, you can get a chromebook (which you can use at a coffee shop, library, etc. if you don't have Internet yourself) for about $200.\n\n--\n\nBTW, Pixlr (that Jodie mentioned) actually has an iPhone version... and it even seems to be free!  \n [http://pixlr.com/mobile/](http://web.archive.org/web/20130609214531/http:/pixlr.com/mobile/ \"http://pixlr.com/mobile/\")\n\nhhp\n\n"
    },
    {
      "time": "21 May 2013 — 8:26am",
      "content": "Well..... The thing is..... I have a very nice sister that gave me the phone as a birthday gift and pays the bill.....  \nI have a stenosis which causes severe pain in the back and legs...  \nSo.... I an pretty such a homebody without a computer.....With not working, I have to pay for my own health insurance which is  \n$500.00 a month..... So.....THAT... Is my computer.....  \nThanks for answering my comment.....\n\n"
    },
    {
      "time": "21 May 2013 — 1:34pm",
      "content": "hhp.....  \nThank you for the name of the app....  \nI Love it.....  \nIf you know of any others I could use, please let me know....The fancier the better.....  \nThanks again....Donna\n\n"
    }
  ]
}
