{
  "id": "1031",
  "title": "BAWAG logo-type?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Ladies and Gentleman,   \nI will be delighted if you can kindly help me identify the particular font, used in the pictured logotype:   \n ![](http://web.archive.org/web/20050518051231im_/http:/www.typophile.com/forums/messages/83/14712.gif)   \nProbably some kind of Futura, yet I do not dare to guess further...   \n   \nBest regards   \n   \nPeter Hajdin\n\n",
  "author": "hidzo",
  "time": "Mon, 2003-08-25 02:17",
  "uid": "2182",
  "comments": [
    {
      "time": " Mon, 2003-08-25 05:36",
      "content": "I know this one is not simple, yet I would appreciate a little help from the MasterMinds...   \n   \nThank you again,   \n   \nPeter Hajdin\n\n"
    },
    {
      "time": " Mon, 2003-08-25 05:59",
      "content": "I hate this sort of answer, but sometimes the best you can do is figure out how you might re-create the sample. In this case, I can't see one font that has all these features, but Metro (Linotype) has the right B & W, Futura has the right G, and BernhardGothic/PL Bernhardt (Agfa) has the right A (in the Medium weight at least). (Bernhard even has the right G). You could also tweak the bar of the Metro A, if you had to.   \n   \nIt's an ugly solution, but I think it might work.\n\n"
    },
    {
      "time": " Mon, 2003-08-25 08:25",
      "content": "\"Ouch, Mike! I can't believe you just told him to do THAT!!!\"   \n   \nSorry. I said I hated this kind of answer, but sometimes you just need to re-create one thing, and it's \\*possible\\* that the original was created by cobbling parts together too.   \n   \n(BTW, Yves, how do you make the links to the URL's like you just did with Bernhard Gothic and Metro? I'm still sort of a newbie to this Forum thing)\n\n"
    },
    {
      "time": " Mon, 2003-08-25 22:04",
      "content": "the trick is like this: \\<a href=\"http://someurl\"\\>the text you want\\</a\\>.   \n   \nAlso check out the forum-specific method [here](http://web.archive.org/web/20050518051231/http:/www.typophile.com/cgibin/discus.pl?pg=formatting#links).\n\n"
    },
    {
      "time": " Tue, 2003-08-26 08:08",
      "content": "maybe... Kristall Grotesque ( i need to look for a sample, but maybe....)   \n   \n   \n   \n   \nDavid Hamuel\n\n"
    },
    {
      "time": " Tue, 2003-08-26 08:25",
      "content": "Oscar,   \n   \nThanks for the help. I've printed the instructions for future reference.   \n- Mike   \n   \nSorry for the diversion, folks!\n\n"
    },
    {
      "time": " Tue, 2003-08-26 08:39",
      "content": "Here you have the sample David, very close but the \"B\" doesn't look the same, neither the weight. The Jaspert, Berry & Johnson book (post) also gives other names for this font: Polar, Rund Grotesque (not Round ?) and Predilecta, maybe it is one of these that I couldn't find. Anyway, Kristall I think is the closer one so far.   \n   \n ![Kristall](http://web.archive.org/web/20050518051231im_/http:/www.typophile.com/forums/messages/83/14789.gif)\n\n"
    },
    {
      "time": " Tue, 2003-08-26 22:53",
      "content": "Thanks for all your effort, ladies and gentlemen.   \n  \nI swear I'm not happy to always come up with stuff that has no really easy solution... In fact, I need some advice according this \"BAWAG\" mystery as it is required to create some new lettering (words completely different from \"BAWAG\" of course) with a very familiar (if not possible the same) type as is used in the word \"BAWAG\".   \n   \nWhat would YOU use?... ;-)   \n   \nThanks again and have a nice day.   \n   \nPeter Hajdin\n\n"
    },
    {
      "time": " Wed, 2003-08-27 06:33",
      "content": "I think Ignacio's candidate from the Jaspert book may not be available in digital form, so my choice of one font that is closest overall would be Berthold's [Bernhard Gothic](http://web.archive.org/web/20050518051231/http:/www.philsfonts.com/detail.html?sku=BQ90142003P1). That would be the pricey option at $99 for 2 weights.   \n   \nURW also has the font in a variety of weights which you can buy individually. See [sample at MyFonts.com](http://web.archive.org/web/20050518051231/http:/www.myfonts.com/fonts/urw/bernhard-gothic/urw-t-heavy/charmap.html) for $19.95 each weight.\n\n"
    }
  ]
}
