{
  "id": "103263",
  "title": "An Innovative Handwriting Averaging-Approach",
  "forum": "General Discussions",
  "tags": [
    "algorithm",
    "font analysis",
    "General Discussions",
    "handwriting",
    "Science"
  ],
  "content": "[This recent research](http://web.archive.org/web/20150414143458/http:/research.microsoft.com/en-us/um/people/larryz/ZitnickSiggraph2013.pdf) by Lawrence Zitnick on a handwriting averaging approach based on sampling is not only interesting, but holds enough potential to influence the way we do type design. Basically, the algorithm takes user stroke samples in real time (with the help of a pen tablet) to increase stroke consistency in a non-destructive manner. Take a look at the presentation video (link at the bottom); there's no need to put it into words.\n\nI wonder: If this algorithm could take stroke-width information into account, the application to the digitization process of calligraphic ‘handwritten’ fonts is obvious.\n\nPutting sampling aside, the paper suggests more: an algorithm could take an existant font, analyze frequent characteristics among all different glyphs (within the same font) and average independently over each this characteristics. This makes sense specially because the algorithm doesn't destroy variation, as it always averages: tendencies are reinforced. Like the idea behind the [average font](http://web.archive.org/web/20150414143458/http:/iotic.com/averia/), but built upon a much more clever procedure.\n\nEven more helpful would be the partitioning of glyphs\\* into primary components (stems, bowls, serifs, terminals, etc.) to allow global tweaking of weight, contrast and proportions without making use of interpolation. Of course, this is a naïve statement, but it isn't necessarily unfeasible.\n\nLink to the presentation video:  \n [http://www.youtube.com/watch?v=EtfCenXsSgQ](http://web.archive.org/web/20150414143458/http:/www.youtube.com/watch?v=EtfCenXsSgQ)  \nLink to the paper:  \n [http://research.microsoft.com/en-us/um/people/larryz/ZitnickSiggraph2013.pdf](http://web.archive.org/web/20150414143458/http:/research.microsoft.com/en-us/um/people/larryz/ZitnickSiggraph2013.pdf)  \n\\_\\_\\_\\_\\_\\_  \n\\* _independently_ of the style of the typeface.\n\n",
  "author": "LexLuengas",
  "time": "23 May 2013 — 2:30pm",
  "uid": "92807",
  "comments": [
    {
      "time": "23 May 2013 — 3:28pm",
      "content": "This is quite interesting, thanks for sharing.\n\nWhat strikes me as relevant to this statement and your average-looking font...  \n\"...allow global tweaking of weight, contrast and proportions without making use of interpolation. Of course, this is a naïve statement, but it isn't necessarily unfeasible...\"\n\n...is that such a system with tweak ability was made, (font chameleon), and that it's average (non-italic) font was startlingly similar to yours. :)\n\n"
    },
    {
      "time": "24 May 2013 — 4:50am",
      "content": "> the partitioning of glyphs\\* into primary components (stems, bowls, serifs, terminals, etc.) to allow global tweaking of weight, contrast and proportions without making use of interpolation.\n\nIt seems to me that, to some degree, that’s exactly what hinting is capable of doing, albeit under a different guise and for different purposes.\n\n"
    },
    {
      "time": "24 May 2013 — 6:05am",
      "content": "If possible, best to avoid hyper links such as “click here” or “this article” (especially when they are linked to PDFs and/or initiate downloads) as they provide no information regarding their destination, are less searchable, and provide accessibility issues to visually impaired readers using text-to-speech software.\n\nEg: This [recent research paper on a handwriting averaging approach based on sampling](http://web.archive.org/web/20150414143458/http:/research.microsoft.com/en-us/um/people/larryz/ZitnickSiggraph2013.pdf) (PDF, 1.6 MB), conducted by by C. Lawrence Zitnick and Miscosoft Research…”\n\n"
    },
    {
      "time": "24 May 2013 — 2:27pm",
      "content": "\\> _Eg: This [recent research paper on a handwriting averaging approach based on sampling](http://web.archive.org/web/20150414143458/http:/research.microsoft.com/en-us/um/people/larryz/ZitnickSiggraph2013.pdf)_ …\n\nFrankly speaking, Chris, I see absolutely no difference between what you wrote and\n\n\\> _Eg: This recent research [paper](http://web.archive.org/web/20150414143458/http:/research.microsoft.com/en-us/um/people/larryz/ZitnickSiggraph2013.pdf) on a handwriting averaging approach based on sampling_ …\n\nwhich is practically the same what was in the original post. And, IMO, it should be your browser, not the poster, who indicates that the target is PDF. The browser has enough hints to do this. And there is/was a Firefox extension to do exactly this.\n\nSo IMO, the only improvement you did was to add “1.6MB”. Was it a sufficient improvement to merit the public whipping of the OP?\n\n"
    },
    {
      "time": "24 May 2013 — 5:13pm",
      "content": "Imagine a visually impaired reader using a text-to-speech converter that isolates and reads hyper-links out loud. If all it says is “article” or “here” it provides them with no contextual information. Especially if “click here” is on the same page several times, and they all go to different places. It’s pretty standard accessibility practice.\n\nSee [the Web Content Accessibility Guidelines 1.0](http://web.archive.org/web/20150414143458/http:/www.w3.org/TR/WAI-WEBCONTENT/) (1999):  \nFrom section 13.1: Clearly identify the target of each link. [Priority 2]  \n_Link text should be meaningful enough to make sense when read out of context -- either on its own or as part of a sequence of links. Link text should also be terse.  \nFor example, in HTML, write \"Information about version 4.3\" instead of \"click here\". In addition to clear link text, content developers may further clarify the target of a link with an informative link title (e.g., in HTML, the \"title\" attribute)_ .\n\nSee also [the Nielsen Norman Group’s post on the Top 10 Web Design Mistakes of 2005](http://web.archive.org/web/20150414143458/http:/www.nngroup.com/articles/top-ten-web-design-mistakes-of-2005/):  \nFrom section 1.0. Legibility Problems:  \n_Explain what users will find at the other end of the link, and include some of the key information-carrying terms in the anchor text itself to enhance scannability and search engine optimization (SEO). Don't use \"click here\" or other non-descriptive link text_.\n\nThe list goes on. A surprisingly common (and easy to correct) mistake thats’s still haunting us after more than two decades. All it takes is a few more seconds of forethought when writing for the web.\n\n"
    },
    {
      "time": "24 May 2013 — 11:32pm",
      "content": "Are not you thinking in English-centric terms? If so, then indeed it **is** possible to make links to videos which are easily navigatable for blinds. But what is the point? ⅓ ;-)\n\n"
    },
    {
      "time": "18 Jul 2014 — 12:32am",
      "content": "Very cool. I would love an algorithm to achieve the opposite effect as well, actually. Like, typing or copying a written letter several times and have the algorithm add variety to each letter—or does this exist already?\n\nChris, you're right, though I wonder how high the chances are of a visually impaired person on Typophile making use of text-to-speech converters. Still, it's good practice and it's something I learned at my multi-media course to improve usability. If someone points out how to do it better, why not do it? Last year I was in a lecture class and I noticed a guy in front of me was designing a flyer on his laptop and he was using hyphens where he should have been using dashes. I pointed the error of his ways out to him but it took him longer than 3 seconds to find out how to type a dash so he said \"Never mind\". It frustrated me tremendously. Mind you, this is a designer, who should care about these things.\n\nChris, I noticed the quote on your profile and you might find this an interesting read: [http://en.wikipedia.org/wiki/Measurement\\_problem](http://web.archive.org/web/20150414143458/http:/en.wikipedia.org/wiki/Measurement_problem \"http://en.wikipedia.org/wiki/Measurement\\_problem\")  \nI guess it's a big distinction between the ability to measure and the ability to measure accurately, but it seems on the quantum level it's inherently impossible to measure things as they are.\n\n"
    }
  ]
}
