{
  "id": "10326",
  "title": "Healthy money, healthy planet",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Pretty close to being finalised, just wondering what the people think. (tagline & author is Feijoa, my one.)   \n   \ncheers, kris.   \n   \n ![](http://web.archive.org/web/20131107230824im_/http:/www.typophile.com/forums/messages/29/69816.gif)\n\n",
  "author": "kris",
  "time": "14 Apr 2005 — 9:04pm",
  "uid": "1519",
  "comments": [
    {
      "time": "14 Apr 2005 — 11:15pm",
      "content": "Looks good.. 'Likeworthy'..   \n_Its rough, Its tough.._ ![](http://web.archive.org/web/20131107230824im_/http:/www.typophile.com/forums/clipart/bigsmile.gif)   \n   \n_( But, I think it may work even better if the blue 'Planet' would be as rough and uneven as 'Healthy, Money, Healthy, Planet'.. )_\n\n"
    },
    {
      "time": "23 Apr 2005 — 9:00am",
      "content": "I like it, in general, but I have two concerns.   \n   \n1) I think the blue marble needs something. The roughness that Dav envisions might be better accomplished by putting in the continents on the planet. They can be pale and not stand out too much.   \n   \n2) More of a problem. Why is a distressed, cutout letter template indicative of \"healthy\" or \"money\"? The more I look at it, the less I think it fits.\n\n"
    },
    {
      "time": "25 Apr 2005 — 3:41pm",
      "content": "The more they looked at it, the less they liked it as well. Which is a shame, as the the client initially loved it, until he showed his sales staff. So now I have to change it! Yay, time to make it betterer.\n\n"
    },
    {
      "time": "26 Apr 2005 — 4:43am",
      "content": "Kris, the problem I had with the project is it isn't informative. What is it a checking account? Posters are ment to be painfully clear in a moments notice. You need a tagline like: The (product/account) to lead to a healthy planet. Once you have the communications problem solved the graphic should be easier.\n\n"
    },
    {
      "time": "26 Apr 2005 — 6:23am",
      "content": "I assumed it was a book cover. I would go for a more robust/healthy illustration.\n\n"
    },
    {
      "time": "26 Apr 2005 — 4:25pm",
      "content": "Gee whizz, I didn't even state what it is! Tim is correct, it's a book cover, causing me no end of problems. Thanks for the advice Daniel, I will think about from a different angle.\n\n"
    },
    {
      "time": "29 Apr 2005 — 6:21pm",
      "content": "Well, after coming up with some more concepts, they chose this one:   \n   \n ![Healthy money two](http://web.archive.org/web/20131107230824im_/http:/www.typophile.com/forums/messages/29/71073.jpg)   \n   \nWhich suprised me, as I was just playing around. Clients can be funny sometimes!\n\n"
    },
    {
      "time": "6 May 2005 — 6:28pm",
      "content": "Kris,\n\nI love this new design! It's really eye-catching... people will be picking this one up in the book stores for a closer look.\n\nMaybe retouch the photo a little bit in Photoshop? Make some of the shadows a little bit softer, etc.\n\nGreat work!\n\n"
    },
    {
      "time": "9 May 2005 — 9:40pm",
      "content": "Wow, this is really great. One of those solutions that you can't come to by just playing around with software. (something I'm forced to see - and do - almost everyday at work).\n\nYou have to think, and then \\*do\\* something.\n\nCongratulations :)\n\n"
    },
    {
      "time": "13 May 2005 — 1:36am",
      "content": "Yeah, love the new concept. Have you considered making the position of the leaves less uniform? Maybe you could tilt the top one counter-clockwise and the bottom one clockwise, and bleed them off the page a touch. I'm also finding the yellow a little overpowering. How about making the band transparent, or a muted green? Dollar green?\n\n"
    }
  ]
}
