{
  "id": "103260",
  "title": "Style Linking",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I just bought the 12 font Mikado family. I got a good deal from MyFonts: 50% off. However, the R/I/B/BI are not style linked. The six roman weights are linked to their italic counterparts, but if I'm using regular, _I have to switch fonts to use bold._ What a bummer. I wrote to MyFonts, and three times they told me each weight roman font is style linked to its italic. Each time I told them they're not addressing the issue. The message I'm getting from MyFonts is that they are clerks who don't even understand my concern and are not font people, or that they're tying to tell me (without actually telling me) that's the way it is, there's nothing they can do about it, and I'm stuck with it.\n\nI CCd Hannes von Döhren, the type designer, on the last two emails but have not heard back. Any suggestions? Is there an inexpensive way for me to style link the fonts?\n\nIt's getting to be a crapshoot buying fonts from respected designers and vendors. One recent font had 1 kerning pair and looked horrible when printed (Lenga family of 16 fonts from Eurotypo). Another font was defective, and MyFonts said they'd contact the designer and I'd probably get a corrected font in a few days (ASNerd). Two months later I asked for a refund. Mikado in not the first font I've gotten from MyFonts where the R/I/B/BI were not style linked (another was Janson URW). And there's no way to find out these kinds of details on the MyFonts website.\n\nThere's at least one Typophile regular who's always admonishing us: \"Reducing the biggest motivation to make (good) fonts hurts everybody (certainly font users) eventually. Getting people used to paying for fonts helps.\" My experience is (a) paying for fonts does not necessarily help; and (b) there's no good way to find out what you're getting before you actually buy a font. Not good. It's this kind of stuff that hurts careful and conscientious designers.\n\n",
  "author": "Renaissance Man",
  "time": "23 May 2013 — 10:44am",
  "uid": "15371",
  "comments": [
    {
      "time": "23 May 2013 — 11:42am",
      "content": "Why is style linking an absolute neccesity, and in what way is style linking a sign of a good font? Yeah I use it sometimes when I can, but I would not go so far as to expect this from a font family. I don’t know if the license allows modifications, then you could style link the fonts yourself with a font editor, altough that might not be the solution for everyone.\n\n"
    },
    {
      "time": "23 May 2013 — 12:33pm",
      "content": "_…there's no good way to find out what you're getting before you actually buy a font._\n\nSome foundries (e.g. mine) offer “try before you buy” to reputable designers.  \nThat means contacting the foundry directly, rather than going through a distributor.\n\n"
    },
    {
      "time": "23 May 2013 — 2:09pm",
      "content": "I own your Goodchild font, Nick.\n\nMy puzzlement is that some vendors cannot or will not tell you if a font is style linked, or how many kerning pairs it has, or if there are any known problems. I've often been berated on Typophile when I complain about free fonts (wadda ya want, it's free) and when I criticize paid fonts (give us a break, mistakes happen, that's common). Others have responded that there were errors in well-known fonts that went unnoticed and unfixed for years.\n\nI don't post on Typophile to berate anyone. But we can't denigrate free fonts and then set a sloppy standard for paid fonts.\n\nI am neither a professional nor an expert, but I do get embarrassed (for designers) when I know that naming conventions have been violated, and they do not.\n\nI'd just like us all to be credible, responsible, and maybe even honest about our craft. Then customers will be satisfied and designers will be respected and honored. Sure beats rants that berate people who can't afford mega-buck font families, and rants that defend professionals that once in a while screw up. I can understand the complexities of testing an operating system on multiple platforms in almost infinite configurations. Isn't it much easier to test a font before it's put to market?\n\nI honor you, Nick, for standing behind your work.\n\n"
    },
    {
      "time": "23 May 2013 — 2:21pm",
      "content": "One thing about style linking is that the way it should be set up is obvious for the two-weight fonts that were preponderant when it was developed, but for a six-weight font it isn't always so clear how it should be done. (Should Black be the linked bold of Medium? or should the Medium be the linked bold of Light? etc.) It's true that the Bold weight could have been linked to the Regular, but it doesn't seem unreasonable to me that the designer concluded, since bold style-linking is ill-equipped to handle the whole family, that weight selection should be left to choosing from the menu. I wouldn't call that sloppy, nor a violation of naming conventions.\n\n"
    },
    {
      "time": "23 May 2013 — 3:39pm",
      "content": "\"But we can't denigrate free fonts and then set a sloppy standard for paid fonts.\"\n\nI understand the frustration, but think the market has gone well beyond the point where a single brush stroke, or standard, can paint or describe an accurate picture of all free or paid fonts.\n\nBe cool if fonts had useful metadata, so one could tell the caring developers from the heap makers and unfinished mass of masterpieces. Wonder what that would be like...\n\n"
    },
    {
      "time": "24 May 2013 — 2:15am",
      "content": "I didn't (mean to) imply that not style linking was a violation of naming conventions.\n\nI did mean to imply that however many fonts there are in a family, style linking R/I/B/BI should be a given.\n\nI did mean to imply that I have downloaded too many 4, 6, 8 font families where only a few of them showed up because of misnaming.\n\n"
    },
    {
      "time": "23 May 2013 — 9:16pm",
      "content": "> paying for fonts does not necessarily help\n\nNot necessarily, but generally it does. One direct and practical way it helps is that a designer would usually rather fix (or even customize) a font than issue a refund and/or get embarrassed in public. Free fonts naturally have a sort of \"as-is\" clause, and complaining is almost comical.\n\nHere's a recent example: [http://typophile.com/node/103134](http://web.archive.org/web/20140730013520/http:/typophile.com/node/103134 \"http://typophile.com/node/103134\")  \nPeople have been complaining about the defective \"2\" in Bebas Neue for over two years. It's a one-minute fix. But it ain't gonna happen.\n\nThat said, I certainly agree that paid fonts should adhere to higher standards than free fonts. And/but most of them do. The ones that don't end up slowly killing their makers.\n\n> there's no good way to find out what you're getting before you actually buy a font.\n\nSure there is: ask the designer (and not the seller). On the other hand it _would_ be nice to [be able to] elegantly share more technical info.\n\nhhp\n\n"
    },
    {
      "time": "24 May 2013 — 7:10am",
      "content": "Might be interesting to know how many have at least tried to file a bug report with or propagate a fix to Dharma Type...\n\n"
    },
    {
      "time": "24 May 2013 — 7:44am",
      "content": "Actually it seems the 2 in Bebas Neue has been fixed. Why it still looks broken on dafont, no idea ...\n\n"
    },
    {
      "time": "24 May 2013 — 8:52am",
      "content": "Actually actually :-) the problem in the \"2\" isn't/wasn't [just] the right side of the spine - in the Dafont preview the _left_ side is going straight... It's missing an explicit inflection point (which the [now-]properly-rendering curve on the right -even with the addition of an explicit extremum- is also missing\\*) which throws a bomb when you convert to TT. The \"S\" has the same problem BTW.\n\n\\* BTW, it's funny, is it possible that if you're missing an explicit inflection point, not having an explicit extremum _helps?_ :-)\n\nBut anyway the basic issue remains: do you want to [have to] trust somebody who doesn't owe you anything because you never paid him anything?\n\nReynir: The comments section on Dafont (not to mention the Dafont preview!) should be enough. But motivation is generally proportional to compensation.\n\nhhp\n\n"
    },
    {
      "time": "24 May 2013 — 12:43pm",
      "content": "As an experiment, I grabbed Bebas Neue from both Dafont and Font Squirrel. Dafont has version 1.300 while FS is still offering v1.101.\n\n@hrant – Not all compensation is monetary. “Don’t want money. Got money. Want admiration.” (That was the Stone Soup Group’s idea of compensation.)\n\n"
    },
    {
      "time": "24 May 2013 — 12:57pm",
      "content": "> Not all compensation is monetary.\n\nOf course - in fact my biggest reason for making Armenian fonts is to support my culture. But crappy design isn't exactly pro-culture; and all a high download count feeds is vanity, which isn't exactly a virtue. It's like Deal Or No Deal: it's a cocktail of greed and dumb luck, with room-temperature-IQ buxom painted jezebels for decoration. Don't watch.\n\nhhp\n\n"
    },
    {
      "time": "24 May 2013 — 4:00pm",
      "content": "I can only assume that \"Deal Or No Deal\" is a TV show. My TV-watching time per year is measured in single-digit hours, and the last programme I watched avidly was the four-part \"Iceland Rescue\". As for the Stone Soup Group, what recognition they got for FractInt and WinFract they deserved good and proper.\n\n"
    },
    {
      "time": "24 May 2013 — 4:53pm",
      "content": "No idea what those are. I do know what Bebas is, and I recommend avoiding it.\n\nhhp\n\n"
    },
    {
      "time": "29 May 2013 — 11:11am",
      "content": "_I do know what Bebas Neue is, and I recommend avoiding it._\n\nI downloaded Bebas Neue and on my system I do not see a problem with the /2/ or the /S/.\n\nMeanwhile, back at the ranch:\n\nFrom MyFonts: \"The Mikado fonts are not set in 4 font family groups. They are set in 2 font groups: the Italic styles are linked to the base weight.\" That should have been their answer from day one. They did offer a refund. Since I got this for half-price, and probably will (have to) use it as a display font I decided to keep it. Not so if I paid full price. Still no word from designer Hannes von Döhren.\n\nI still think style linking R/I/B/BI should be a given, regardless of how many fonts in a family. And that includes small caps.\n\nI'm not buying any more fonts from HvD. **[EDIT: I changed my mind; see my post of 29 May 2013 or click [here.](http://web.archive.org/web/20140730013520/http:/typophile.com/node/103260#comment-555641)]** I'm not thrilled when type designers don't bother to answer their emails. I am thrilled when type designers do pick up their own phone and talk to me, Sumner Stone, James Montalbano, and Patrick Griffin among them. No wonder I bu29 May 2013y their fonts; either the fonts have no problems, or the designers fix them. Who could ask for more?\n\n"
    },
    {
      "time": "25 May 2013 — 3:09am",
      "content": "<cite>I still think style linking R/I/B/BI should be a given, regardless of how many fonts in a family. </cite>\n\nThat’s a valid opinion. Not less, but also not more. It’s an opinion.  \nFrom a technical and logical point of view, there are good reasons not to use the typical 4-style-family linking, when the font is not a 4-style family.\n\n<cite> but if I'm using regular, I have to switch fonts to use bold. What a bummer.</cite>\n\nPlease explain why that is a bummer? What apps are you using and how do you select the styles?  \nIf you need to change the style, you need to change the style. Whether you use buttons, shortcuts, character styles or whatever — you need to perform an action. In what way does not style-linking the regular to the bold will cause serious problems for you?\n\nIn text apps (like Word) and layout apps (like InDesign) one would and should use paragraph and character styles to apply different styles of a family. If I apply a character style to a word to make it bold, it doesn’t matter at all how the family is style-linked. I just set up the character style called “bold” to use the bold style.\n\n<cite> I'm not thrilled when type designers don't bother to answer their emails. </cite>\n\nHow much time have you given the designer to answer?\n\n"
    },
    {
      "time": "25 May 2013 — 6:59am",
      "content": "> I do not see a problem with the /2/ or the /S/.\n\nI believe you.\n\nhhp\n\n"
    },
    {
      "time": "25 May 2013 — 7:32am",
      "content": " ![](http://web.archive.org/web/20140730013520im_/http:/typophile.com/files/2S_4611.jpg)\n\n"
    },
    {
      "time": "25 May 2013 — 9:48am",
      "content": "Yes, twice: on the Dafont preview, and when I look at the curves in FontLab. BTW did you read the comments on Dafont?\n\nIn the late 80s I had a 1976 BMW 2002. One day it started pulling to the right whenever I braked. A few days after I noticed that, I was driving to college, doing my usual 80-something on the freeway. I got into a casual race with some guy, and almost hit a car on my right when I braked hard. No biggie. Then in the campus parking lot, while looking for a spot at 5 mph, I braked hard, and the right-front wheel came completely off... So nobody died, that time.\n\nYou don't die every time you play Russian Roulette, but it's still a bad idea.\n\nhhp\n\n"
    },
    {
      "time": "25 May 2013 — 10:40am",
      "content": "The wheel's lug nuts came off? Had you changed a tire recently?\n\n"
    },
    {
      "time": "25 May 2013 — 10:56am",
      "content": "No, the suspension bearing or something had worn out. Properly changing tires myself, I'm good at. I had to do that on my Flex recently, when I bumped a curb. Damn low-profile rims are like knives. With my 2002 I used to mount sidewalks with abandon and nothing would happen. One time a bank security guard had to grab his chair and run. Ah, yute.\n\nhhp\n\n"
    },
    {
      "time": "25 May 2013 — 3:09pm",
      "content": "FractInt and WinFract were only about the coolest fractal explorers ever devised on MS-DOS and MS-Win boxes, so I guess it's normal you have never heard of them.\n\n"
    },
    {
      "time": "25 May 2013 — 3:34pm",
      "content": "When I was a teenager I had a summer job in a tire center. All day long we put on new tires. Once a guy either forgot the lug nuts or forgot to tighten them and the wheel came off a few minutes after the car left.\n\n"
    },
    {
      "time": "25 May 2013 — 4:24pm",
      "content": "I remember Benoit. HE was cool.\n\nhhp\n\n"
    },
    {
      "time": "26 May 2013 — 11:51pm",
      "content": "\\> From a technical and logical point of view, there are good reasons not to use the typical 4-style-family linking, when the font is not a 4-style family.\n\nYes, but....\n\n\\> I still think style linking R/I/B/BI should be a given, regardless of how many fonts in a family.\n\nAnd that is going to be a pretty common POV. Despite seeing the technical and logical arguments otherwise, I lean that way myself.\n\nIf a type designer doesn’t want to do that, it is their call. If they are super-ultra-high-end maybe their users won’t care. But for most people, they can and should expect a certain number of irate users if they do that. I doubt doing the full-on style linking for the R/I/B/BI will frustrate or anger anybody, and it is easily explained.\n\n"
    },
    {
      "time": "27 May 2013 — 3:38am",
      "content": "Steve Marston: _I still think style linking R/I/B/BI should be a given, regardless of how many fonts in a family._\n\nThomas Phinney: _And that is going to be a pretty common POV. Despite seeing the technical and logical arguments otherwise, I lean that way myself._\n\nThe key is consistency. Which is hard to achieve with bigger families.  \nLinking R/I but not R/B and I/BI is the easiest way to achieve consistency across the entire family: Touch the I button, but never the B button.  \nIf you try to meet Windows users' R/I/B/BI-linking expectiation, with bigger families, you end up with solutions guided either by two guiding principles rather than one, or one guiding principle with exception(s):  \nEither you style-link only these fully. Other style would only be I-linked but not B-linked. Cf Monotype. Being able to use the B button with the Regular weight, however, it is too tempting for a user to do the same with other weights too – anticipating consistent behavior (with the Regular-related R/I/B/BI is considered the model).  \nOr you style-link everything the R/I/B/BI way. Bold would be B to Regular, Medium would be B to Light, or Extrabold would be B to Medium, etc. Cf Adobe. Try this with a really big family! It works properly only with rather small big families, and usually you end up with one or two left-over weights for which there is no B. See either.\n\nIn short, the Regular-related R/I/B/BI linking is indeed easily explained. The tricky part is all the other weights that in a bigger family may, by their number, outweight R & B. Do you define consistency based on the tiny R/I/B/BI part, or do you define it based on all other weights?\n\nThat said, a foundry should indicate whether their families' members are style-linked or not, or at least do so when being asked about it.\n\n"
    },
    {
      "time": "27 May 2013 — 7:34am",
      "content": "\"The key is consistency. Which is hard to achieve with bigger families.\"\n\nI think the R/I/B/BI booby-trapped garden fence — and typography, have been on a collision course since this one community decided that the shortcut into every single font family ever designed by this other community is 2 to the 2nd. But, we are approaching the intersection of \"skip them\" and \"let the customer decide\" on this issue, among other \"preferences\" the \"user\" might rather pick themselves, so bear with everyone else;)\n\n"
    },
    {
      "time": "27 May 2013 — 8:20am",
      "content": "In fact I do – and \"let the customer decide\": While there is no bold-linking in my [retail] fonts, there is the offer to [bold-link](http://web.archive.org/web/20140730013520/http:/kltf.de/kltf_fonts_standards.shtml#linking) any two weights if desired. (Noone ever made use of this so far.)\n\n"
    },
    {
      "time": "28 May 2013 — 1:33am",
      "content": " ![](http://web.archive.org/web/20140730013520im_/http:/typophile.com/files/good%20news_6438.jpg)\n  \nHi Steve, \n\nThank you for your email and the thread. Indeed, this is a very interesting topic.  \nSorry for the delay, I wasn't in the office last week and had no time to answer.\n\nNormally there are special Office versions exactly of the 4 fonts with the correct style linking.\n\nRegarding the Mikado family - and its look - we thought more of an usage in  \nthe design-background programs like Photoshop or Indesign where the r/i/b/bi  \nstyle linking isn't that important.\n\nWe made an Mikado Office version especially for you :)  \nwhere you should be able to select the correct weights, now.\n\nPlease let me know if everything works fine.\n\nHave a great day!  \nHannes\n\n ![](http://web.archive.org/web/20140730013520im_/http:/typophile.com/files/ty_6501.jpg)\n  \nThe red font is Mikado Ultra for an ultra big thanks to Hannes von Döhren. \n"
    },
    {
      "time": "28 May 2013 — 7:14am",
      "content": "Good news. (And nicely typical of small foundries.) So I assume you'll retract your statement -made two days after you bought the fonts- that you won't buy from HVD again.\n\nhhp\n\n"
    },
    {
      "time": "29 May 2013 — 11:14am",
      "content": "There was an initial glitch, but as HvD said in his last email to me, \"I am really happy that we could solve this problem. Good teamwork :) I always try to help when it is possible and I think that happy customers are very important. Especially if this is your daily job and you want to live from your font-sales.\"\n\nI said this earlier, but it bears repeating: even without the R/I/B/BI style linking, I turned down MyFonts offer of a refund because I really like Mikado. It's useful at small sizes and its character is more fully revealed at display sizes, especially in the heavier weights. I'm even more impressed that Hannes took the time and trouble to resolve the (my) style linking issue.\n\nI still like MyFonts as a font vendor, and they do send out emails to tell you if a font has been updated, and do offer a refund if the product is defective or totally unsuitable for your work. But if there's a problem or question, they're clueless. I know fonts are not cars or toasters, but imagine if your car dealer or toaster vendor hadn't a clue about the product and you had to write to the manufacturer. (Yeah, I know that there are way more fonts than there are car models or toaster brands.)\n\n**Anyway, a big thanks to Hannes von Döhren and a hearty endorsement for his Mikado font family.**\n\n"
    },
    {
      "time": "29 May 2013 — 11:11am",
      "content": "Yes, he seems to have handled it very well. So it would be nice to edit your (first) post of the 25th.\n\nhhp\n\n"
    },
    {
      "time": "29 May 2013 — 11:22am",
      "content": "I was in the process of doing so when you posted, hpp. ( **H** elicopter **P** oster **P** apazian, always hovering.) That's twice you made the same suggestion.\n\n"
    },
    {
      "time": "29 May 2013 — 11:31am",
      "content": "I myself would've done that first, since it was doing damage sitting there.\n\nJust looking out for a fellow indie designer (especially an apparently honorable one). And I'm not so sure I didn't make a difference.\n\nhhp\n\n"
    },
    {
      "time": "29 May 2013 — 11:33am",
      "content": "I couldn't link to a post that was not yet posted. You did make a difference—the first time. The second was just an annoyance.\n\n"
    }
  ]
}
