{
  "id": "103238",
  "title": "How would I go about painting a large typographic message like in the Melbourne Eureka car park?",
  "forum": "General Discussions",
  "tags": [
    "Axel Peemoeller",
    "carpark",
    "General Discussions"
  ],
  "content": "I am hoping to create a signage across 3 walls (ceiling and 2 side walls) similar to the way finding system created by Axel Peemoeller for the [Melbourne car park](http://web.archive.org/web/20130821000500/http:/asdlabs.com/blog/2008/09/26/axel-peemoeller-eureka-carpark). I know that the designer created it using some type of mathematical system, but unfortunately I don't have his mad math skills to pull this off.  \nI was thinking of maybe projecting my design across the walls and tracing it on the spot. Any ideas would be greatly appreciated.\n\n",
  "author": "jvasquez",
  "time": "22 May 2013 — 4:09pm",
  "uid": "211700",
  "comments": [
    {
      "time": "22 May 2013 — 4:55pm",
      "content": "I don't think he used math. He probably just did what you're thinking (projecting and tracing). Just make sure the projector is where the viewer's head will be.\n\nhhp\n\n"
    },
    {
      "time": "22 May 2013 — 9:30pm",
      "content": "[I never did anything like this, so take this with a grain of seasalt.]\n\nOn a planning stage, make a photo from the point you want to put the viewer(s)/projector, and plan by overlaying your image over the photo. A tricky part would be to decide which kind of photo to take: rectilinear wide or fisheye wide.\n\nThe idea is that for planning, you want a wide-angle photo such that rectangular pieces of this photo can serve as narrow-angle photos of the subject (assuming that you want your design to be viewed in a narrow angle). This is not possible (due to sphere being “intrinsically” curved). So for best result, loading a wide-angle photo into a specialized “panoramic viewer” (like Hugin) may be a better solution (if you can get familiar with its UI quick enough).\n\n"
    },
    {
      "time": "23 May 2013 — 12:05pm",
      "content": "Thank you. I'll give the projector idea a shot and report back with pics.  \nJaime\n\n"
    },
    {
      "time": "24 May 2013 — 1:49pm",
      "content": "You can also use computer plotted pounce patterns. They have an advantage over projections, first because there isn't the distortion a projector will give you, and second you don't need darkness. Of course, you need neither computer not plotter for the projection method. In the end, it is six of one and a half dozen of the other.\n\n"
    },
    {
      "time": "25 May 2013 — 3:18pm",
      "content": "The method of drawing on a photograph is probably the best, because at the very least you can be sure it will be perfect if you photograph the finished work with the same lens from the exact same place. Which is really all you can ask for with this sort of thing.\n\n"
    }
  ]
}
