{
  "id": "103271",
  "title": "Cyrillic (Russian) ideal number of characters per line",
  "forum": "General Discussions",
  "tags": [
    "Cyrillic",
    "General Discussions",
    "Russian",
    "text design",
    "typography"
  ],
  "content": "Hi Typophiles,\n\nI'm a publisher and designer and need to establish good type design parameters for Russian books. I don't speak Russian and therefore can't come up with settings that Russian readers would consider ideal for sustained reading. For English text and the usual text faces, the ideal number of characters (including spaces and punctuation) is about 67 per line. Has anyone heard of an ideal number for Russian? Grateful for any lead. :)\n\n",
  "author": "Michael K Augge...",
  "time": "24 May 2013 — 5:04am",
  "uid": "7456",
  "comments": [
    {
      "time": "24 May 2013 — 2:34pm",
      "content": "AFAIU, all you need to care about is the width of the column, the font, and the fontsize. Given this, the number of characters would be decided by the typesetting process into a suitable average number of characters for line for a given (sub)language.\n\nSo instead of what you did, the question one may ask could be: “given that we typeset English so that the average area of the character is 3mm², should we use a smaller font size to compensate for a larger average width of Russian letters?” (Or for longer average length of word? ;-)\n\n"
    },
    {
      "time": "24 May 2013 — 6:37pm",
      "content": "> Has anyone heard of an ideal number for Russian?\n\nIn Russian a lot has been written on the allowable range of line lengths. Most recommendations or requirements express the line measure in ‘kvadrats’ and their fractions. One kvadrat equals 4 ciceros or 48 Didot points (in German those measurement units are known as _Konkordanzen_).\n\nNational Industrial Standards (GoSTs) used to be strictly enforced in Soviet printing industry. After the fall of Communism they were replaced by the Sanitary Rules and Norms (SanPiNs), very similar to GoSTs.\n\nJust one example. The [SanPiN 1.2.1253-03, 06.15.2003](http://web.archive.org/web/20150420114330/http:/verstka.otrok.ru/law/bv.html) (_Hygienic requirements to the book editions for adult readers_) stipulates, among other things, that\n\n> 3.2.2. In the editions of the first category, with the font size of the main and the auxiliary texts larger than 10 point, the minimal line measure should be no shorter than 3 ¾ kvadrats (68 mm); the maximal line measure, the typeface, and the extent of the auxiliary text are not subject to regulation.’\n\nIn his book _[The Complete Manual of Typography: A Guide to Setting Perfect Type](http://web.archive.org/web/20150420114330/http:/www.amazon.com/The-Complete-Manual-Typography-Setting/dp/0321127307/ref=sr_1_cc_1?s=aps&ie=UTF8&qid=1369444386&sr=1-1-catcorr&keywords=The+Complete+Manual+of+Typography%3A+A+Guide+to+Setting+Perfect+Type)_ (Berkley: Peachpit Press, 2002) James Felici suggests that\n\n> the optimal line length is between one and a half and  \n> two times the length of the lowercase alphabet.\n\nMind you, the English alphabet has 26 letters, and the Russian 33… Is the Russian optimal line length between 50 and 66 characters?\n\nOne can come to the similar numbers (49–65 characters) by comparing the [average word length](http://web.archive.org/web/20150420114330/http:/www.globallanguages.com/en/news/GlobalCommunicator/archives/GC_67_200805/fl_1.php): 5.1 letters in English, and 6.36 in Russian.\n\n"
    },
    {
      "time": "25 May 2013 — 6:44am",
      "content": "We're not really there yet, but we're getting closer. Thanks, guys.\n\nMaxim, from what I can gather, Felici's measure is based on space (measurable in picas, or mm), not on the number of characters.\n\nThe 6.36 average length of Russian words is very interesting information. Taking that number into consideration, we ought to pack at least as many characters into each Russian line as we do in English, i.e. at least 66 characters (including spaces and punctuation). Fewer characters per line will inevitably result in undesired variation in word spacing and/or too much hyphenation.\n\nRussian is generally an inflected language. Inflected languages are better set with smaller word spaces. This is one more reason to pack at least 66 characters into each line, for ideal sustainable reading.\n\nHas anyone in Russia researched reading comprehension vis-à-vis typography?\n\nAlso, does anyone know of a style manual for Russian? I'm looking for the Russian equivalent of the \"Chicago Manual of Style.\"\n\n[http://www.amazon.com/Chicago-Manual-Style-16th-Edition/dp/0226104206/re...](http://web.archive.org/web/20150420114330/http:/www.amazon.com/Chicago-Manual-Style-16th-Edition/dp/0226104206/ref=sr_1_1?ie=UTF8&qid=1369488480&sr=8-1&keywords=chicago+manual \"http://www.amazon.com/Chicago-Manual-Style-16th-Edition/dp/0226104206/ref=sr\\_1\\_1?ie=UTF8&qid=1369488480&sr=8-1&keywords=chicago+manual\")\n\nWould be great to find something like this in Russian, for Russian.\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "25 May 2013 — 7:18am",
      "content": "Maxim, do those word-length numbers include wordspace? Because I always thought English was closer to 4 than 5. So I'm wondering if -without wordspace- the Russian would be **5**.36 instead.\n\nhhp\n\n"
    },
    {
      "time": "25 May 2013 — 8:15am",
      "content": "> In his book The Complete Manual of Typography: A Guide to Setting Perfect Type (Berkley: Peachpit Press, 2002) James Felici suggests that\n> \n> > the optimal line length is between one and a half and  \n> > two times the length of the lowercase alphabet.\n\nI have looked a bit more into this notion and cannot confirm it. For the usual text faces it is more like 2.2 times the length of the lowercase English alphabet, not 1.5-2.0.\n\n2.2 times gives you an average of 66-67 characters per line.\n\nI don't think this formula is directly transposable to Russian, or any other language.\n\nWe need to find out what the ideal number of characters is per line of Russian text.  \nDoes anyone know of a preeminent typographer or type designer in Russia?\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "25 May 2013 — 8:54am",
      "content": "> does anyone know of a style manual for Russian? I’m looking for the Russian equivalent of the “Chicago Manual of Style.”\n\nAFAIK, there is _no single reference resource_ in Russian that would address all those aspects of editorial style covered by the English-language style manuals, like Chicago, Hart’s, Butcher’s, etc. That information is spread around a great number of books on editing, copy-editing, proofreading, typesetting, book design, etc. Two biggest names in Russian sub-editing and copy-preparation are [Alexander Reformatsky](http://web.archive.org/web/20150420114330/http:/genhis.philol.msu.ru/article_169.shtml) (1900–78) and [Arkady Milchin](http://web.archive.org/web/20150420114330/http:/ru.wikipedia.org/wiki/%D0%9C%D0%B8%D0%BB%D1%8C%D1%87%D0%B8%D0%BD,_%D0%90%D1%80%D0%BA%D0%B0%D0%B4%D0%B8%D0%B9_%D0%AD%D0%BC%D0%BC%D0%B0%D0%BD%D1%83%D0%B8%D0%BB%D0%BE%D0%B2%D0%B8%D1%87) (1924–).\n\n> do those word-length numbers include wordspace? Because I always thought English was closer to 4 than 5. So I’m wondering if -without wordspace- the Russian would be 5.36 instead.\n\nThe information on the average word length varies widely. I don’t know if the numbers I’ve referred to include word spaces. What I, like everyone else, do know from practical experience is that Russian copy is usually _longer_ than English. Remember _[Typographia Polyglotta](http://web.archive.org/web/20150420114330/http:/stbridelibrary.bigcartel.com/product/typographia-polyglotta)_? There the Russian version of the same text is 15 per cent longer than the English (of course, that percentage varies with translation). No wonder the maximum allowable [number of hyphenated lines](http://web.archive.org/web/20150420114330/https:/listserv.heanet.ie/cgi-bin/wa?A2=typo-l;qg9BAA;199902162030350500) in Russian is greater than in English.\n\n"
    },
    {
      "time": "25 May 2013 — 3:06pm",
      "content": "As I recall, only isalpha(3) counts.\n\n"
    },
    {
      "time": "25 May 2013 — 4:13pm",
      "content": "\\> … _we ought to pack at least as many characters into each Russian line as we do in English, i.e. at least 66 characters (including spaces and punctuation). Fewer characters per line will inevitably result in undesired variation in word spacing and/or too much hyphenation._\n\nThis makes absolutely no sense. As I already said, one should take into account two facts: the average length of words (in characters) is larger in Russian, and the average width of characters (in ems) is larger in Cyrillic.\n\nAnd, given that, it is not surprising that the _expectations_ of the readers are also very different. For example, the Russian analogue of the Chicago manual of style (I have it scanned, but do not remember where it is now; it was published about ’64, and AFAIK, was not reprinted) says that “for the purpose of rapid-delivery typography” (newspapers etc.) more than 8 hyphenated lines in sequence should be avoided. ;-)\n\nI also have heard that for best results, one should compensate for larger average widths by making the spacing between words larger. (Fortunately, PDFTeX now allows overriding the “width of space” provided in the font by the user-specified amount. Unfortunately, hyphenation of TeX can’t be tuned from its English defaults — the style allows up to 3 hyphenated lines in sequence.)\n\n"
    },
    {
      "time": "25 May 2013 — 4:36pm",
      "content": "The Cyrillic alphabet is very similar to the Latin in general appearance, although the lower case edges towards small capitals. This, if anything, in my opinion would make the ideal line width somewhat shorter in Cyrillic than in Latin.\n\nHowever, since the ideal line width in English is quite short - 1 1/2 alphabets of 26 letters - I'm not sure that there is much room for people seeking to engage in fine book typography in Russian to take this into account.\n\n"
    },
    {
      "time": "25 May 2013 — 4:41pm",
      "content": "_Inflected languages are better set with smaller word spaces._\n\nWhat is the reasoning behind this?\n\nI'm frankly surprised that the average Russian word length is only 6.36 letters. My experience of typesetting Russian text is that it contains a _lot_ of very long words, but perhaps that is in part due to the nature of the texts I have been working with (literary or scholarly, so not a day-to-day vocabulary). Even on a fairly generous measure, I find that the quantity of hyphenated line breaks in justified Russian text massively outnumbers that of English, and even with that amount of hyphenation the count of over-wide word spaces and the risk of rivers remains higher than for English. Of the many scripts and languages with which I work, I think typesetting Russian text is one of the most difficult things to do well.\n\n"
    },
    {
      "time": "25 May 2013 — 4:45pm",
      "content": "Incidentally, here's the thread that discussed the ideal line length for English at some great length:\n\n[http://www.typophile.com/node/78173](http://web.archive.org/web/20150420114330/http:/www.typophile.com/node/78173 \"http://www.typophile.com/node/78173\")\n\nIf the normal word length in Russian is longer than in English, that means that shorter line lengths cause problems sooner; and yet, on the other hand, the nature of the lowercase alphabet means that longer line lengths probably also cause problems sooner - and so _any_ line length likely means more compromises.\n\nGiven a 10 Didot point body, 68mm equals 181 ems, incidentally.\n\n"
    },
    {
      "time": "26 May 2013 — 12:01am",
      "content": "OK, I went to genesis librusec, and it turns out that I was wrong: in non-periodic publications, the max is not 3 hyphenated lines in sequence, but 4 (or 5 for narrow columns = up to 3½ squares)!\n\nAnyway, it is «Правила типографского набора», published as  \n Гиленсон П.Г. Справочник художественного и технического редактора; М., Книга, 1988  \n(The title is not indexed on librusec; use «Правила типографского набора».)\n\n"
    },
    {
      "time": "26 May 2013 — 1:10am",
      "content": "\\> _I'm frankly surprised that the average Russian word length is only 6.36 letters._\n\nDoes not look reasonable. On the second glance, there is a fair proportion of 1-letter words. So the averaging will **strongly** depend on how you average (it is natural to give every word the weight 1, or the weight equal to its length, or to its length plus 1 — this 1 to account for interword space).\n\n"
    },
    {
      "time": "27 May 2013 — 1:39am",
      "content": "> \\> … we ought to pack at least as many characters into each Russian line as we do in English, i.e. at least 66 characters (including spaces and punctuation). Fewer characters per line will inevitably result in undesired variation in word spacing and/or too much hyphenation.\n> \n> This makes absolutely no sense. As I already said, one should take into account two facts: the average length of words (in characters) is larger in Russian, and the average width of characters (in ems) is larger in Cyrillic.\n\nTo understand the rationale, imagine the average word length of some fictional language being 30 characters. How do you set this with an average character count of 70 per line? You'd have huge word space and hyphenation problems. So what do you do? You put more characters into each line. Which comes at a price: your typesize goes down. It would be very hard to set justified text for books in that language. Luckily, we don't have have to deal with average word lengths of 30 characters.\n\nThe question still stands: What is the ideal number of characters per line in Russian text?\n\nThe ideal parameters for setting English text don't seem to apply for at least three reasons: a) Russian has a substantially different average word length, b) Cyrillic has different font metrics, and c) Russian is an inflected language.\n\nHK, maybe you could ask the Storm people in the Czech Republic. Govinda should have their email address.\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "27 May 2013 — 1:53am",
      "content": "Thanks for your post, John.\n\n> > Inflected languages are better set with smaller word spaces.\n> \n> What is the reasoning behind this?\n\nReading comprehension.\n\nI quote from Robert Bringhurst's brillant book _The Elements of Typographic Style:_\n\n> Language has some effect on the word space as well. In highly inflected languages, such as Latin, most word boundaries are marked by grammatical tags, and a smaller space is therefore sufficient. In English and other uninflected languages, good word spacing makes the difference between a line that has to be deciphered and a line that can be efficiently read.\n\nThere must be Russian research into all this. We just have to find it.\n\n> Even on a fairly generous measure, I find that the quantity of hyphenated line breaks in justified Russian text massively outnumbers that of English, and even with that amount of hyphenation the count of over-wide word spaces and the risk of rivers remains higher than for English. Of the many scripts and languages with which I work, I think typesetting Russian text is one of the most difficult things to do well.\n\nSame here. It's a challenge. But I'm sure we can find a set of parameters that enable increase sustained reading.\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "27 May 2013 — 2:00am",
      "content": "Obviously, you do not care about your reader’s experience. All you care about is your CPU temperature when you typeset your text…\n\nI said:\n\n> **This makes absolutely no sense. As I already said, one should take into account two facts: the average length of words (in characters) is larger in Russian, and the average width of characters (in ems) is larger in Cyrillic.**> To understand the rationale, imagine the average word length of some fictional language being 30 characters. How do you set this with an average character count of 70 per line?\n\nI would not! As I said, the character count is irrelevant. I would just set line length in mm, and will let the typesetting program to find best line breaks.\n\n> You'd have huge word space and hyphenation problems.\n\nI see no problems. What problems do you have in mind?\n\n> So what do you do? You put more characters into each line.\n\nDefinitely not!\n\n> Which comes at a price: your typesize goes down.\n\nYou got it backwards. First, you decide on type size. Second, the line length. And line breaks will be calculated basing on this.\n\n> It would be very hard to set justified text for books in that language.\n\nHard for who? The typesetting program, or what? Remember that the readers expectations in this language are very different from expectations of English readers!\n\n> Luckily, we don't have have to deal with average word lengths of 30 characters.\n> \n> The question still stands: What is the ideal number of characters per line in Russian text?\n\nLet me repeat it again: this question makes no sense.\n\n> The ideal parameters for setting English text don't seem to apply for at least three reasons: a) Russian has a substantially different average word length, b) Cyrillic has different font metrics, and c) Russian is an inflected language.\n\nI do not see what having inflections has to do with it.\n\n"
    },
    {
      "time": "27 May 2013 — 2:24am",
      "content": "> Incidentally, here's the thread that discussed the ideal line length for English at some great length:\n> \n> [http://www.typophile.com/node/78173](http://web.archive.org/web/20150420114330/http:/www.typophile.com/node/78173 \"http://www.typophile.com/node/78173\")\n\nThanks, quadibloc. Good resource.\n\nI found there Eric Gill's statement: \"Practiced readers do not read letter by letter or even word by word, but phrase by phrase. It seems that consensus of opinion favors an average of 10-12 words per line.\"\n\nCan we find the Russian readers' consensus of opinion? There must be data.\n\nIf the average Russian word length is 6.36, plus a space, and we put 11 words in each line, 7.37 x 11, the ideal number of characters per line would be about 81.\n\nMaybe 10 words per line is acceptable (Russian readers are reportedly more comfortable with hyphenation than English readers). So 10 x 7.37, i.e. 74 characters per line, might be okay.\n\nNo matter how I look at it, the ideal number of characters in Russian text seems to be higher than in English.\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "27 May 2013 — 3:42am",
      "content": "> You got it backwards. First, you decide on type size. Second, the line length. And line breaks will be calculated basing on this.\n\nCool. Ingenious!!! This works.\n\nThanks, iliyaz.\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "27 May 2013 — 7:08am",
      "content": "> Two biggest names in Russian sub-editing and copy-preparation are Alexander Reformatsky (1900–78) and Arkady Milchin (1924–).\n\nThanks, Maxim.\n\nOne of my colleagues in Russia is now locating their writings.\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "27 May 2013 — 7:21am",
      "content": "> First, you decide on type size. Second, the line length. And line breaks will be calculated basing on this.\n\nilyaz, we ran into a snag:\n\nThe type design is for a book and the line length is already predetermined by the size of the book. The line length is 90 mm. Could we switch the two elements of the procedure you are suggesting, in other words first determine line length, and then typesize?\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "27 May 2013 — 9:54am",
      "content": "> Two biggest names in Russian sub-editing and copy-preparation are Alexander Reformatsky (1900–78) and Arkady Milchin (1924–).\n> \n> > One of my colleagues in Russia is now locating their writings.\n\nAsk him/her to also look up [Ditmar Rosenthal](http://web.archive.org/web/20150420114330/http:/www.livelib.ru/author/3768)’s (1900–94). Rosenthal was great. He taught at Moscow Printing Institute when I was a student.\n\n"
    },
    {
      "time": "27 May 2013 — 10:29am",
      "content": "> Ask him/her to also look up Ditmar Rosenthal’s (1900–94). Rosenthal was great. He taught at Moscow Printing Institute when I was a student.\n\nWill do. Thank you.\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "27 May 2013 — 11:01am",
      "content": "Michael, Bringhurst is saying that for inflected languages a narrower word space is _sufficient;_ he doesn't say it is 'better'. He's saying that the way in which we comprehend meaning in inflected reading means that we _can_ utilise smaller word spacing, not that such word spacing is superior for comprehension.\n\n"
    },
    {
      "time": "27 May 2013 — 11:27am",
      "content": "However, saving horizontal space and reducing line returns & page turns all do help readability.\n\nhhp\n\n"
    },
    {
      "time": "27 May 2013 — 11:11am",
      "content": "> I found there Eric Gill's statement: \"Practiced readers do not read letter by letter or even word by word, but phrase by phrase.\n\nWhat does that even mean? What is 'reading' in the context of Gill's assertion? If he means we comprehend the meaning of text via phrases, fair enough, because that's how most linguistic communication works thanks to syntax and morphology. But if he's suggesting that 'practiced readers' perceive phrases as units, bypassing word recognition, he's making an assertion unsupported by any empirical evidence. Even for languages such as Thai that do not use spaces to visually differentiate words within phrases, there is no evidence that phrases are the perceptual units of reading or, indeed, that they can be, since so many phrases exceed the length of a single saccade.\n\n"
    },
    {
      "time": "27 May 2013 — 1:22pm",
      "content": "> > First, you decide on type size. Second, the line length. And line breaks will be calculated basing on this.\n> \n> ilyaz, we ran into a snag:\n> \n> The type design is for a book and the line length is already predetermined by the size of the book. The line length is 90 mm. Could we switch the two elements of the procedure you are suggesting, in other words first determine line length, and then typesize?\n\n;-)\n\nThanks for correcting my choice of the figure of speech. Of course, these two steps are interchangeable. AFAIU, there is very little interplay between them. **This** independence is what makes the question of the “optimal number of characters in line” meaningless.\n\n"
    },
    {
      "time": "27 May 2013 — 11:37pm",
      "content": "> > First, you decide on type size. Second, the line length. And line breaks will be calculated basing on this.\n> \n> ...these two steps are interchangeable. AFAIU, there is very little interplay between them. This independence is what makes the question of the “optimal number of characters in line” meaningless.\n\nilyaz, help me out. The book I need to design (in English and Russian) is 120 mm wide. My type area is 90 x 160 mm (excluding running heads and pagination). In other words the line length is 90 mm.\n\nThe typeface shall be Times New Roman.\n\nilyaz, which typesize would you suggest for the English edition?\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "27 May 2013 — 11:49pm",
      "content": "> Bringhurst is saying that for inflected languages a narrower word space is sufficient; he doesn't say it is 'better'. He's saying that the way in which we comprehend meaning in inflected reading means that we can utilise smaller word spacing,\n\nCorrect. I will include this allowance in our Russian type design.\n\n> not that such word spacing is superior for comprehension.\n\nFor each language, typeface, and typesize, there's an optimum word space. We should try to set with spacing as close to that optimum as possible.\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "28 May 2013 — 12:07am",
      "content": "> > I found there Eric Gill's statement: \"Practiced readers do not read letter by letter or even word by word, but phrase by phrase.> What does that even mean? What is 'reading' in the context of Gill's assertion? If he means we comprehend the meaning of text via phrases, fair enough, because that's how most linguistic communication works thanks to syntax and morphology. But if he's suggesting that 'practiced readers' perceive phrases as units, bypassing word recognition, he's making an assertion unsupported by any empirical evidence. Even for languages such as Thai that do not use spaces to visually differentiate words within phrases, there is no evidence that phrases are the perceptual units of reading or, indeed, that they can be, since so many phrases exceed the length of a single saccade.\n\nHi John. Not sure which of the two he means. From my own experience I can say that subtle adjustments in text design can result in a noticeable increase in the speed at which I can read German or English text. I'd be highly interested to understand how this works. It could be entirely individual, or there could be absolutes. Bringhurst tends towards the existence of absolutes. I tend to agree with him.\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "28 May 2013 — 7:33am",
      "content": "\\> _The typeface shall be Times New Roman.  \nilyaz, which typesize would you suggest for the English edition?_\n\nYou are being ironic again? I’m not very much interested in large-scale typesetting (page layout etc.), only in small-scale (words; at most, sentences). For large-scale, I choose from pre-packaged solutions. And my particular preferences are irrelevant to the overwhelming majority due to my vision deficiencies.\n\n"
    },
    {
      "time": "28 May 2013 — 7:30am",
      "content": "There is no \"small-scale typesetting\" without \"large-scale typesetting\", and \"pre-packaged\" solutions are anathema to improvement (which is critical because multi-script typesetting remains in the dark ages).\n\nhhp\n\n"
    },
    {
      "time": "28 May 2013 — 7:35am",
      "content": "\\> _There is no \"small-scale typesetting\" without \"large-scale typesetting\"_\n\nSorry, Hrant, you will need to go into _much_ more details if you want to convince me. IMO, these are, in most respects, orthogonal issues.\n\n"
    },
    {
      "time": "28 May 2013 — 7:48am",
      "content": "When in public I never try to convince individuals.\n\nhhp\n\n"
    },
    {
      "time": "28 May 2013 — 9:11am",
      "content": "> > The typeface shall be Times New Roman.  \n> > ilyaz, which typesize would you suggest for the English edition?\n> \n> You are being ironic again?\n\nilyaz, I don't think so. I'm just trying to find out in which typesize you would set English text (and later Russian) in Times New Roman for a book that has a line length of 90 mm. 8pt? 10pt? 12pt?\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "28 May 2013 — 10:59am",
      "content": "Michael,\n\nWhy don't you run tests, show typophiles the output, and ask what feels better; your question cannot be solved by equations and I doubt it can be answered from general principles. Here I ran tests comparing Brill (which I like) and Times New Roman (using XeLaTeX with an input file I put on my blog [http://typophile.com/node/103349](http://web.archive.org/web/20150420114330/http:/typophile.com/node/103349 \"http://typophile.com/node/103349\")) and which gave [this resulting pdf output](http://web.archive.org/web/20150420114330/http:/typophile.com/files/russian_90mm.pdf).  \nSizes were adjusted to get the same counts. That's the kind of thing I do to make choices (from my preference for TeX, you can guess that I am no editor, but an academic).\n\n(The extract is from Chekhov's Дама с собачкой.)\n\n"
    },
    {
      "time": "28 May 2013 — 2:18pm",
      "content": "@ilyaz:  \n<cite>Obviously, you do not care about your reader’s experience. All you care about is your CPU temperature when you typeset your text…</cite>\n\nThe conclusion is unwarranted. While additional CPU effort can improve the spacing of a paragraph, for example through the use of the justification algorithm devised by Donald Knuth for TeX, making the CPU work harder will not improve hyphenation.\n\nHyphenation is determined by the dictionary used by the program to show places where words can be broken. Since there will always be words that are absent even from a large dictionary, this means that if you don't want to burden the user of a word processing program with manually indicating possible points of hyphenation, the remaining alternative is to use a line length that will produce acceptable results even if words are never broken.\n\n"
    },
    {
      "time": "29 May 2013 — 12:11am",
      "content": "> Why don't you run tests, show typophiles the output, and ask what feels better;\n\nYes, that is of course our last resort. We are, though, trying to avoid this empirical process. In the course of setting type in forty languages for several decades, we've realized that following an authority is a time saver and will consistently yield good results, not always perfect, but certainly good, often very good. Perfection comes with individual fine-tuning, but to do that you need a panel of experienced readers for each language, ideally in close vicinity to control the environment.\n\nSo I was hoping, and am still hoping, to find the Russian Bringhurst.\n\n> your question cannot be solved by equations and I doubt it can be answered from general principles.\n\nIn English it definitely works. We start with the parameters for an average of 66/67 characters per line. It is quite ideal for most English texts, faces, and line lengths. From there we fine-tune.\n\n> Here I ran tests comparing Brill (which I like)\n\nDo you prefer it over Times or Baskerville? In your sample, which I printed out, it looks very good, and very different from Times. Is Brill easier to read, comprehend?\n\nYour 9.4/12 Times sample is set with larger word space, and therefore looks more like English text. Which I like. But how does it look to a Russian reader?\n\n> which gave this resulting pdf output.\n\nBeautifully done. Thank you so much. Of your six samples, I am attracted to 10/12 Brill and 9.4/12 Times. Here we have an average of 61 characters per line. The color is fairly even. Would be interesting to hear from Russian readers.\n\nMy question remains: Hasn't anyone in Russia done all this already and published the results? As much fun it is to experiment, it does feel like reinventing the wheel.\n\n> Sizes were adjusted to get the same counts.\n\nExcellent. You probably could push Times to 9.5 or 9.6.\n\n> That's the kind of thing I do to make choices (from my preference for TeX, you can guess that I am no editor, but an academic).\n\n:) Never worked with TeX. We sometimes use InDesign, but mostly our own software which was developed for us in the 80s.\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "29 May 2013 — 5:42am",
      "content": "> Your 9.4/12 Times sample is set with larger word space, and therefore looks more like English text.\n\nThe space in Brill is 198/1000. The space in Times New Roman is 512/2048 which gives 250/1000; at 9.4 points, the Times New Roman space is (250\\*0.94-198)/198 = 18.7% larger than that of Brill at 10 points.\n\n"
    },
    {
      "time": "29 May 2013 — 9:57am",
      "content": "> > Your 9.4/12 Times sample is set with larger word space, and therefore looks more like English text.\n> \n> The space in Brill is 198/1000. The space in Times New Roman is 512/2048 which gives 250/1000; at 9.4 points, the Times New Roman space is (250\\*0.94-198)/198 = 18.7% larger than that of Brill at 10 points.\n\nInteresting. It looks substantially larger.\n\nGreetings\n\nMichael\n\n"
    },
    {
      "time": "30 May 2013 — 4:56am",
      "content": "In \"Choosing line length depending on the font size\" ( [http://typophile.com/node/103329](http://web.archive.org/web/20150420114330/http:/typophile.com/node/103329 \"http://typophile.com/node/103329\")) ilyaz goes from posting the question, to this thread where he is posting the answers.\n\nTwice in this thread he said, \"this question makes no sense.\" I think he meant, \"this question makes no sense to me.\"\n\nilyaz is full of emphatic certanties: \"I would not!\" \"I see no problems.\" \"Definitely not!\" \"readers expectations in this language are very different from expectations of English readers!\" If there were an absolute answer and a one-size-fits-all formula, this thread would have been over long ago. Discussion helps bring things into perspective; pontificating does not.\n\n_\"I have looked a bit more into this notion and cannot confirm it. For the usual text faces it is more like 2.2 times the length of the lowercase English alphabet, not 1.5-2.0.\"_ Based on 67 characters per line (which I generally tend to agree with), including punctuation and spaces, you are correct.\n\n_\"do those word-length numbers include wordspace?\"_ I'd say be definition, they do. Without wordspaces you do not have a word. You'd have one word (6.36 characters times the number of words) in a line.\n\nGetting away from formulas, don't we generally want to avoid as much hyphenation as we can? Don't we want to keep the line length no longer than just eye-movement will allow? (I.e., not require head movement, or as Nick Shinn called it, \"angle of vision.\") Somewhere between the two probably lies the best answer.\n\nAs far as point size, set a few pages in different point sizes from 9 to 11 points and read (and have others read) them. You don't need as expert to tell you which is more comfortable. Since the line length is fixed at 90 mm, maybe another factor for point size should be the age of the reader. Are there going to be more people over 40 as the intended audience? Go with a larger point size. And vice-versa. Of course, we then get into the area of comprehension....\n\n"
    },
    {
      "time": "3 Jun 2013 — 8:48pm",
      "content": "\\> _\"do those word-length numbers include wordspace?\" I'd say be definition, they do. Without wordspaces you do not have a word._\n\nOne should handle definitions with care. The next thing to say after what you did would be that “line length includes the LF and CR, since without them you do not have a line”.\n\n\\> _don't we generally want to avoid as much hyphenation as we can?_\n\nNo.¹⁾\n\n\\> _Don't we want to keep the line length no longer than just eye-movement will allow? (I.e., not require head movement, or as Nick Shinn called it, \"angle of vision.\")_\n\nYou got this upside down. “The general” eye-movement allows enormous angle of vision. I think what is applicable here is the REM’s amplitude — do not know the proper term…. I do not even know whether saccades are powered by the same muscles as the larger scale movements….\n\n¹⁾ Only when this does not contradict other goals. Doing typesetting is making compromises. And what one decides when compromising depends on the context. In typesetting, it depends on the target audience.\n\n"
    }
  ]
}
