{
  "id": "10322",
  "title": "Reposting",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I'm reposting work I've been doing on my typeface, because I don't think anyone saw [the previous thread](http://web.archive.org/web/20150123205813/http:/www.typophile.com/forums/messages/29/67404.html?1113292700)...or maybe they just ignored it.\n\n<!--attachment: letters-69798.pdf*mime_pdf.gif*application/pdf*9.0*Apprenti*letters%2epdf --><!--attachment: letters-69798.pdf*mime_pdf.gif*application/pdf*9.0*Apprenti*letters%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150123205813im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Apprenti<br><a href=\"http://web.archive.org/web/20150123205813/http:/www.typophile.com/forums/messages/29/letters-69798.pdf\" target=\"_blank\"><b>letters.pdf</b></a> (9.0 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nI think I'm going to call it \"Apprenti\", apprentice in french. As I said in my last post, I think it looks way too pretty, too much like Optima. Maybe I need to reduce the contrast in the strokes?\n\n",
  "author": "ericgio",
  "time": "14 Apr 2005 — 2:44pm",
  "uid": "3814",
  "comments": [
    {
      "time": "29 Apr 2005 — 4:53pm",
      "content": "ok, well I don't know if anyone read the last post, but I'll put up my revisions anyway. A lot of little changes that made a big difference:\n\n<!--attachment: letters_03-71070.pdf*mime_pdf.gif*application/pdf*12.5*Apprenti*letters_03%2epdf --><!--attachment: letters_03-71070.pdf*mime_pdf.gif*application/pdf*12.5*Apprenti*letters_03%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150123205813im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Apprenti<br><a href=\"http://web.archive.org/web/20150123205813/http:/www.typophile.com/forums/messages/29/letters_03-71070.pdf\" target=\"_blank\"><b>letters_03.pdf</b></a> (12.5 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nI'm encouraged by the progress I'm making both in terms of the font itself as well as what I'm learning in general. I think it's starting a lot less pretty, which is good, but at the same time retaining it's own characteristics. Also, I think once spacing and weight issues are resolved, it will make a highly readable text face, which was the original goal.   \n   \nIf anyone feels like commenting, I'd love feedback.\n\n"
    },
    {
      "time": "6 May 2005 — 2:01am",
      "content": "some more subtle refinements...\n\na bunch of weight issues resolved, and the spacing is much improved, though I haven't worked on the kerning very much.\n\n[http://www.ericgio.com/apprenti\\_04.pdf](http://web.archive.org/web/20150123205813/http:/www.ericgio.com/apprenti_04.pdf \"http://www.ericgio.com/apprenti\\_04.pdf\")\n\ncomments? anyone?\n\n"
    },
    {
      "time": "22 Jun 2005 — 3:27am",
      "content": "I like this design. Why is nobody else commenting on it? I am posting this comment mainly to bring this thread to the front, as I would like to see what the experts think of it. There seems to be a strange forum effect, where stuff goes without comment for weeks, then you get a whole pile in one day.\n\n"
    },
    {
      "time": "22 Jun 2005 — 11:50am",
      "content": "I like it too, which is why I've flagged it for perusal... eventually. :-/\n\nhhp\n\n"
    },
    {
      "time": "25 Jun 2005 — 4:34am",
      "content": "I said I liked the design, but without any explanation, which is pretty useless as a critique. I did not have time to do more when I posted.\n\nOne reason I like the design is that it is a contrasty sans serif. I am fond of such fonts in general. I have made several attempts to produce a nice contrasty sans serif font, but they appear to be inherently difficult for some reason. Your design looks like it has fixed many of the problems I encountered.\n\nThe use of tapered strokes on some horizontals and verticals is interesting. This help fix the tendency for thin unterminated strokes to look weak, particularly in the capitals.\n\nThe body text sample is nice and readable, I would say.\n\nI have a couple of criticisms. Please take these with a pinch of salt, because I am just an interested amateur.\n\nThe slanted cuts on the tops of the lower case verticals work nicely, and harmonise with the classic feel of the design. However, I am not sure about the same feature applied in the capitals, which would not have slanted serifs in a classic design. I also wonder if both verticals in 'u' should be cut at a slant, instead of just the left one.\n\nThe tapered central stroke of the 'e' looks a bit odd. Perhaps it should taper the other way (thick at right to thin at left), or not be tapered at all, as this stroke does not need a taper to firm it up.\n\nIs there a good reason why the tapered horizontals should only appear at the bottom of E, Z and z? If you are hinting at the effects of serifs on the thin horizontals, I would have thought that the top strokes want tapers as much as the bottom ones. The single taper on the thin strokes of X and x looks a bit odd. The thin top right does not harmonize with similar stokes in Y, v, w, y.\n\nI am perhaps being too conventional and obsessed with consistency in many of the above comments.\n\nAnyway, keep up the good work.\n\n"
    },
    {
      "time": "8 Oct 2005 — 6:04am",
      "content": "Overall I like this typeface. The only crit I'll make is about the e. I find his counter to big. It also could be the oblique you use in inside that seems do not fit with the other glyph. Or, just raise this middle bar.\n\n"
    },
    {
      "time": "13 Oct 2005 — 4:35pm",
      "content": "I get a 404 error on your website but your previous PDFs look good. It is a Syntax to Optima arena which is not attempted much--meaning you have chosen a good niche without lots of similar work in competition. I would like to see text in smaller sizes. it makes seeing it as a text font easier for me. I like the feeling of leaning caused by the strees in your b d p q. You might try tightening the letterspacing a bit overall. It feels a tad loose to me.\n\nChrisL\n\n"
    },
    {
      "time": "14 Oct 2005 — 10:19am",
      "content": "Agree with Chris on the letterspacing. I am guessing too but the u/c seems more loosely spaced that the l/c. On page 2 of the pdf, the caps appear to drift away from the words they begin.\n\n"
    }
  ]
}
