{
  "id": "103243",
  "title": "Can you help me identify this font please?",
  "forum": "Anna08's blog",
  "tags": [

  ],
  "content": "A week ago I got a project from a client in which I have to complete a design that was started by another designer. My client really likes the fonts and wants me to use the same one for the rest of the project. They only have a jpeg copy of the design. I do not have a clue what is the name of these fonts and I tried every where and last time I had a meeting with the client they said that the previous designer worked at a sign writing company so I’m thinking maybe they have them available on their programs, if you can help me recognize the font it would be greatly appreciated.\n\nThank you\n\n| Attachment | Size |\n| --- | --- |\n| [Font image](http://web.archive.org/web/20150420110935/http:/typophile.com/files/Screen%20shot%202013-05-23%20at%206.53.16%20PM_0.png) | 13.1 KB |\n\n",
  "author": "Anna08",
  "time": "23 May 2013 — 2:10am",
  "uid": "211712",
  "comments": [
    {
      "time": "23 May 2013 — 3:27am",
      "content": "The typeface you are looking for is [Revue](http://web.archive.org/web/20150420110935/http:/www.fontshop.com/fonts/downloads/linotype/revue_std_regular/ot_ps?&fg=000000&bg=ffffff&sample_size=36&sample_text=Red%20Handed%20Security&ft=liga).\n\nBy the way: The right place to ask this kind of questions would be the [Type ID board](http://web.archive.org/web/20150420110935/http:/typophile.com/typeid). You are more likely to get quick and accurate answers there.\n\n"
    },
    {
      "time": "23 May 2013 — 2:30pm",
      "content": "Thank you so much for your help. And thanks for the tip I'm new to this site but next time I will use the Type ID board.\n\n"
    },
    {
      "time": "23 May 2013 — 3:42pm",
      "content": "No worries, glad to help!\n\n"
    },
    {
      "time": "26 May 2013 — 12:01pm",
      "content": "I have a couple of days trying to find this typeface and I could not tell which it is. Maybe it's some custom typography, but would please me to know at least of which has been based. Look at the \"g\" or \"fi\". Thanks to all and please help me. Thanks again by\n\n"
    },
    {
      "time": "26 May 2013 — 12:18pm",
      "content": "Funny that you ask that not only in the wrong place, but also in a thread in which I wrote the following just a couple of pixels above your post:\n\n<cite>By the way: The right place to ask this kind of questions would be the <a href=\"http://web.archive.org/web/20150420110935/http:/typophile.com/typeid\" rel=\"nofollow\">Type ID board</a>. You are more likely to get quick and accurate answers there.</cite>\n\n"
    },
    {
      "time": "17 Jun 2013 — 1:07am",
      "content": "It's Revue :)\n\n[getting facebook likes](http://web.archive.org/web/20150420110935/http:/www.purchasefacebooklikes.org/691/facebook-likes-for-get-ahead/)\n\n"
    },
    {
      "time": "3 Sep 2013 — 3:17am",
      "content": "Much thanks to you such a great amount of for your assistance. What's more a debt of gratitude is in order regarding the tip I'm new to this site yet next time I will utilize the Type ID prepare to leave. [get Facebook fans](http://web.archive.org/web/20150420110935/http:/www.socialyup.com/)\n\n"
    },
    {
      "time": "4 Sep 2013 — 3:21am",
      "content": "I think you should refer Type ID board. There you can know that what is exactly this font? By the way thank you for this question even I also will try this on Type ID board. [buy facebook fans](http://web.archive.org/web/20150420110935/http:/www.socialyup.com/facebook-friends/)\n\n"
    },
    {
      "time": "3 Feb 2014 — 5:41am",
      "content": "As per my recommendation for all the students you must visit [rushessays.net](http://web.archive.org/web/20150420110935/http:/www.retailmenot.com/view/rushessay.com) so that you could get in touch with professionals and ask them for their services. It will help you in getting better grades as a professional is always better than a student.\n\n"
    },
    {
      "time": "1 May 2014 — 9:12pm",
      "content": "En savoir plus montres suisses, s'il vous plaît cliquez ici : [www.repliquemontrefr.eu](http://web.archive.org/web/20150420110935/http:/www.repliquemontrefr.eu/ \"www.repliquemontrefr.eu\")\n\n"
    }
  ]
}
