{
  "id": "103225",
  "title": "Why use a sans-serif for printed media if a serif has highest readability?",
  "forum": "Sans Serif",
  "tags": [
    "printed media",
    "Sans Serif",
    "sans-serif"
  ],
  "content": "So I've just redesigned a publication of ours where I work and opted to use Helvetica for the body text as it looks so much smoother and, in my opinion, much more contemporary than their current use of Adobe Garamond Pro.\n\nHowever, I was approached today by my superior who told me that his wife (whom is a copy editor) \"had a lot of issues with using Helvetica and not a serif font for print.\"\n\nWhile serifs ARE easier for readability sake on print media, I'm a bit surprised that she seems to be unaware with how many people are using Helvetica to reach out to a plethora of audiences. Our publication would reach mostly (but not only) those in their 40's-50's, and I can understand if this is where she's frustrated, but neither of those age groups are so old that they couldn't read a SOO commonly used font.\n\nWhat are your guys' thoughts? Why are so many publications using Helvetica, Akzidenz, etc, if studies show readability for printed media is best when found in serif? I wonder what the greater percentage of readability is for a serif? I'd like to have an informed answer for her.\n\nThanks!\n\n",
  "author": "gillmank",
  "time": "22 May 2013 — 6:51am",
  "uid": "211692",
  "comments": [
    {
      "time": "22 May 2013 — 7:13am",
      "content": "Helvetica is more recently designed than Garamond, but it is still a 19th century grot.  \nBoth Helvetica and Adobe Garamond have currency, acquired through reputation, bundling, and subsequent heavy usage.  \nThe downside of their success—they have become bland and generic.  \nWhy not use a truly contemporary serif design?\n\n_neither of those age groups are so old that they couldn't read a SOO commonly used font._\n\nThe issue is not familiarity, but failing eyesight.  \nHelvetica’s tight ﬁt and similarity of shapes (e.g. a, e and s) make it hard to read if a bit out of focus.\n\n"
    },
    {
      "time": "22 May 2013 — 8:24am",
      "content": "“_While serifs ARE easier for readability sake on print media…_”\n\nThere are no published studies that come to mind which supports this claim with any significant degree of confidence. The “serifs are easier to read than san-serifs” adage is based largely on anecdotal wisdom and convention.\n\n@gillmank: For the purpose of this discussion, in your context, how do _you_ define “readability” and “print media?”\n\n"
    },
    {
      "time": "22 May 2013 — 8:49am",
      "content": "Chris,\n\nHere's where I feel a bit of tension.\n\nI work at a religious congregation. We are hoping to attract younger members because we are mostly 40s,50s,60s+. We have 30s, but they aren't attracted to the stuff we have. I want to hit that audience, too.\n\n\"Readability\" was based upon how others are defining it. I guess, for me, wording is easier to read when I'm not distracted by the font. Many serifs look distracting to me because I identify them with writing papers. All the papers we ever had to write were in serifs. They look old and tired to me, except for the more contemporary ones which I'm not sure we have the money to spend on it, BUT I would love some suggestions for some contemporary ones. I have Museo slab at 500, but a thinner weight might look nice. Or a thinner weight of Mido (only have medium...).\n\n\"Print media\", for us, is specifically our monthly newsletter.\n\n"
    },
    {
      "time": "22 May 2013 — 8:52am",
      "content": "\"Helvetica is more recently designed than Garamond, but it is still a 19th century grot.\"  \nYep. Wasn't referring to the time it was made, but the way it looks. Garamond, to me, screams old-fashioned.\n\n\"Why not use a truly contemporary serif design?\"  \nWould LOVE some suggestions!!\n\n\"The issue is not familiarity, but failing eyesight.  \nHelvetica’s tight ﬁt and similarity of shapes (e.g. a, e and s) make it hard to read if a bit out of focus.\"\n\nThanks for that explanation!\n\nThanks for commenting, Nick!\n\n"
    },
    {
      "time": "22 May 2013 — 9:23am",
      "content": "Young people have to read too. It has little to do with failing eyesight. Readability is not essentially determined by familiarity. Helvetica has low readability (mostly due to its overly-tight spacing, but also for the paucity of its extenders). Plus it's overused, especially by mega-corporations (that don't even like religion :-). It's the first font you should totally avoid. Well, after Arial. :-)\n\nGaramond is indeed too old-fashioned (here and in general) but don't blame the serifs. If you want a sans that's highly readable, use Legato. But probably the wife won't let you, so look for a contemporary serif font - there are tons of them.\n\nAnd anecdotal wisdom trumps poorly conceived and executed field testing any day.\n\nhhp\n\n"
    },
    {
      "time": "22 May 2013 — 9:34am",
      "content": "Helvetica or Arial as text fonts on screen and in print are two different animals. I like the late Paul Rand's view, who told an assistant not to use Helvetica in text. When asked, \"Why?\" He replied \"because it looks like dogshit in text.\"\n\nIn general, I think it is clear that serifs are better for extended text in print, even though there is no scientific proof of it. Certainly, the vote of publishers and readers has gone that way, even though sans have been fully accepted in headings.\n\nAside from the question of the aesthetic look you want, Adobe Garamond in my opinion has problems at smaller sizes. Garamond Premier, which has optical sizes, has a beautiful text size.\n\nIt you want something fresher in the same general line as Garamond, look at the wonderful new [Agmena](http://web.archive.org/web/20150414233819/http:/typographica.org/typeface-reviews/agmena/)\n\nI admit Paul Rand's view has to be modified somewhat now because of [Neue Haas Grotesk](http://web.archive.org/web/20150414233819/http:/www.fontbureau.com/nhg/). Christian Schwartz did a text size, which can work nicely in short texts at relatively small sizes. But as I say, I don't think any sans is appropriate for extended text.\n\nThe problem here is that the notion of 'readability' is confused. I think the appropriate notion is in terms of ease or comfort in reading, and there I think in extended text, a very good serif will win the race.\n\n"
    },
    {
      "time": "22 May 2013 — 9:35am",
      "content": "Hrant, it is very much an age issue.  \nIf the type is out of focus and the letters blur and coalesce, which us what happens when the lenses in one's eyes become less elastic, then Helvetica presents problems of a different order to those experienced by young people who are reading it with distinct letters in focus.\n\n"
    },
    {
      "time": "22 May 2013 — 9:46am",
      "content": "Nick, I do agree it gets worse with age, but since I believe most reading happens in the -blurry- parafovea for _any_ adult, as we say in American: same difference.\n\nAnd to answer a previous question of Kristen's: Why do so many people use Helvetica? 1) Because their old-fart Modernism-brainwashed design teachers adore it and they pass down the bad advice. 2) It's retro, and that's currently in.\n\nAgmena: To me still too old-fashioned.\n\nhhp\n\n"
    },
    {
      "time": "22 May 2013 — 10:17am",
      "content": "Thanks, everyone for the insights. I have a lot to learn it seems.\n\nI wonder why so many publications are using sans fonts? I see it often in magazines.\n\nAgmena does look a bit too old-fashioned for me as well. hrant, you said there are many fresh serifs you know of. Which do you specifically mean? I'd love to check em out.\n\nMuseo Slab is one of the most beautiful serifs I've seen in awhile. But, it looks more appealing as a heading to me. Of course, I don't have all the weights available, so I couldn't give a fully informed opinion on body text.\n\nIs there an article anyone knows of (besides the ones I'll find googling in the next few minutes) that can explain how the eye recognizes letter shapes and the mechanics behind that? That'd be fantastic. Very grateful for your input!\n\n"
    },
    {
      "time": "22 May 2013 — 11:02am",
      "content": "Fedra Serif looks very modern, and works in text. Greta is also very good, though a little more traditional looking.\n\nOn Readability, you aren't going to find anything definitive. It's an issue I've been somewhat obsessed with. [Here's my 7 minute talk on the subject](http://web.archive.org/web/20150414233819/http:/www.youtube.com/watch?v=z2hhkfUzZtw), which starts 16 minutes into the video. [Here is a typophile discussion on readability that I kicked off.](http://web.archive.org/web/20150414233819/http:/typophile.com/node/83684) Also [here is an essay on how I tried to make my own text font readable.](http://web.archive.org/web/20150414233819/http:/ilovetypography.com/2010/11/02/reviving-caslon-part-2-readability-affability-authority/)\n\n"
    },
    {
      "time": "22 May 2013 — 11:16am",
      "content": "An obssession? YESSS, then you're the best person to talk to, huh? OR...am I feeding the obsession? hmmmmm....\n\nhahaha, thanks William. I'm excited to learn from you!\n\n"
    },
    {
      "time": "23 May 2013 — 11:33am",
      "content": "While it's certainly not modern, Janson Text is eminently legible and readable.  \n [http://www.myfonts.com/fonts/adobe/janson-text/](http://web.archive.org/web/20150414233819/http:/www.myfonts.com/fonts/adobe/janson-text/ \"http://www.myfonts.com/fonts/adobe/janson-text/\")\n\nI recommend Kent Lew's Whitman. I own it and I love it.  \n [http://www.myfonts.com/fonts/fontbureau/whitman/roman-lf/](http://web.archive.org/web/20150414233819/http:/www.myfonts.com/fonts/fontbureau/whitman/roman-lf/ \"http://www.myfonts.com/fonts/fontbureau/whitman/roman-lf/\")\n\n\"And anecdotal wisdom trumps poorly conceived and executed field testing any day.\"  \nI agree wholeheartedly.\n\n\"If you want a sans that's highly readable, use Legato.\"  \nI got it at MyFonts on sale for $50. It looked horrible in print. It has minimal kerning.\n\n\"Look at the wonderful new Agmena\"  \n$468 for 8 fonts with no small caps?\n\n"
    },
    {
      "time": "23 May 2013 — 11:45am",
      "content": "Legato? At MyFonts? I thought FontFonts have not been available at MyFonts until very recently....\n\n"
    },
    {
      "time": "23 May 2013 — 12:03pm",
      "content": "Legato -having not a single straight line- probably does look bad at text sizes on a low-end Postscript-emulation printer. But you don't use an Arabian to haul coal.\n\nhhp\n\n"
    },
    {
      "time": "25 May 2013 — 3:55am",
      "content": "<cite>\"Look at the wonderful new Agmena\"<br>\n$468 for 8 fonts with no small caps?</cite>\n\n[No](http://web.archive.org/web/20150414233819/http:/www.fontshop.com/fonts/downloads/linotype/agmena_pro_complete_pack_ot/ot_ps?&fg=000000&bg=ffffff&sample_size=40&sample_text=Agmena%20has%20small%20caps.&ft=liga%2Csmcp).\n\n"
    },
    {
      "time": "25 May 2013 — 6:21am",
      "content": "Another $468 for 8 small caps fonts for a total of $936.\n\nI think I'll pass.\n\n"
    },
    {
      "time": "25 May 2013 — 6:42am",
      "content": "Those small caps are an OpenType feature, not additional fonts.\n\n"
    }
  ]
}
