{
  "id": "103339",
  "title": "Coats of Arms of the Book Trade",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "Ströhl 1891 Berthold Englische Schreibschrift Akzidenz Grotesk"
  ],
  "content": "Last year I was looking for type specimen and related publications of foundries on the internet. I found this nice booklet that was published Christmas 1970 by H. Berthold AG as a present to their customers. It is called ‘Die Wappen der Buchgewerbe’ (Coats of Arms of the Book Trade) and was published in a series of facsimile publications from ‘Schätze aus der Berthold-Bibliothek’ (Treasures from the Berthold-Library). On the cover Englische Schreibschrift set on the Diatype Photocomposer and Akzidenz Grotesk Mager as handset metal type. On the cover also the first known printers' mark from Fust and Schöffer in the Mainz Psalter, printed in 1457. ‘Die Wappen der Buchgewerbe’ was first published in 1891 by the Austrian heraldic painter Hugo Gerard Ströhl and contained nine colored plates with coats of arms.\n\nOn the second picture a spread with one of the seven coats of arms that are shown in the Berthold booklet. This is the coat of arms of the painters, one of the oldest coats of arms. Times where changing and in in the seventies graphic designers began to play a bigger role in book production. So Berthold dedicated this coat of arms also to the graphic designers.\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Cover_Berthold_S_5018.jpg)\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Berthold_Wappen_S_6045.jpg)\n\n",
  "author": "polkawithfontana",
  "time": "28 May 2013 — 5:36am",
  "uid": "106052",
  "comments": [
    {
      "time": "28 May 2013 — 12:56pm",
      "content": "\\> Berthold dedicated this coat of arms  \n\\> also to the graphic designers\n\nA nice thought, but a little ironic since most graphic designers never design a coat of arms; it's a very old-fashioned type of graphic.\n\n"
    },
    {
      "time": "28 May 2013 — 1:20pm",
      "content": "@James — of course a graphic designer would rarely design a coat of arms, as heraldry is its own discipline, and a highly specialized one at that—but why does that make it ironic? Would bookbinders design a coat of arms? How about [UK nuclear scientists](http://web.archive.org/web/20130820182656/http:/nuclearsecrecy.com/blog/2013/01/22/more-nuclear-symbolism/)? Having a coat of arms has nothing to do with whether or not you would ever design your own. An achievement of arms, as it is technically termed (including escutcheon, crest and mantling), is also not a graphic, but a symbolic system, which would be reiterated in various forms on everything from stone to engravings to apparel to printed formats.\n\n@polka — fascinating find! Interesting indeed that in this instance the arms seem to be a sort of guild mark rather than the traditional family purpose.\n\n"
    },
    {
      "time": "28 May 2013 — 3:57pm",
      "content": "\\> Having a coat of arms has nothing to do with  \n\\> whether or not you would ever design your own\n\nI've got nothing against coat of arms used in heraldry or studied for historic purposes. I'm just saying it's an odd tribute to graphic designers since it's a type of symbol that's very outdated and I doubt that any designer would choose an image like that to represent their profession.\n\nBut no big deal, and no disrespect is intended to the original poster. It's a nice image, thanks for posting it.\n\n"
    },
    {
      "time": "28 May 2013 — 6:50pm",
      "content": "[http://www.underconsideration.com/speakup/archives/002570.html](http://web.archive.org/web/20130820182656/http:/www.underconsideration.com/speakup/archives/002570.html \"http://www.underconsideration.com/speakup/archives/002570.html\")\n\n"
    },
    {
      "time": "29 May 2013 — 4:54am",
      "content": "Bare with me for a moment. Nothing is old-fashioned. We stand upon the shoulders of those before us and every generation makes his own interpretation of it. Look at this example of a card I received from fashion designer Paul Smith. The card is laminated from three paper stocks. A thick dark blue one in the middle and two white sheets in back and front. The coat of arms is not printed but lasered revealing the dark blue paper. His motto is in this discussion maybe on the right spot. -Joep\n\nJohn, nice link!\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/PaulSmith_S_5416.jpg)\n\n"
    },
    {
      "time": "29 May 2013 — 4:46am",
      "content": "[http://www.gutenberg.org/ebooks/23186](http://web.archive.org/web/20130820182656/http:/www.gutenberg.org/ebooks/23186) – The Handbook to English Heraldry by Charles Boutell; 11th Ed., 1914.\n\n"
    },
    {
      "time": "29 May 2013 — 4:53am",
      "content": "Thanks Té, I have this book from 1914 and the funny thing is that there is colour in the html version on gutenberg.org. In the eleventh edition I have there is no colour ...\n\n"
    },
    {
      "time": "29 May 2013 — 8:01am",
      "content": "Thanks for the links to articles.\n\nThe modern example for Paul Smith is not his company's logo and appears to have been created as a humorous (6 arms), personal heraldry symbol.\n\nI respectfully disagree with the comment that heraldry symbols are not old-fashioned. In the world of logos, they are about as old-fashioned as you can get. Appropriate in the world of heraldry, but otherwise seldom used except in specialized situations or in highly modernized forms.\n\nBut I agree completely with your comment that we stand on the shoulders of those who came before us.\n\n"
    },
    {
      "time": "29 May 2013 — 8:02am",
      "content": "James, as far as I know designers always are looking for inspiration and mostly they are collectors of numerous stuff. You can say that from Paul Smith for sure (he is one of the worlds biggest collectors of everything he likes). Coming back on the thread about the Calypso from Excoffon I explained how he got to this 3D design of that typeface. I did not mention there that I think that his inspriation also came from the old so-called cartouches that you can see for example in the picture below. This cartouches tried to create also a 3D presentation, just like the coats of arms from Ströhl in the Berthold publication. As you can see in the first specimen of Calypso from 1958 in the book about Excoffon he used also a modernized form of the cartouches on the front of his specimen of Calypso. Maybe he tried to give also a clue how he got the idea for creating this font. The cartouches on the background are from Joh. Vredeman de Vriese (Recueil de Cartouches inventées par Joh. Vredeman de Vriese, published in Brussels, Belgium, G.A. van Trigt, Éditeur, according to the seller it should be dated around 1875).\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Cartouche1_Calypso_S_4965.jpg)\n\nMaybe I should link this also to the Calypso thread but I don't know how ...\n\n"
    },
    {
      "time": "29 May 2013 — 8:19am",
      "content": "Look what we did with this old fashioned cartouches.\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/kaart_DeMuzen_S_5766.jpg)\n  \nAdvertising card for our book Dé Muzen (The Muses), a book about classical music and with anecdotes about composers and classical music. Translation of the dutch text: Paganini was a hardrocker.\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/kaart_Letterfontein_S_5142.jpg)\n  \nAdvertsing card for the dutch Letter Fountain. Translation of the text: A serif is a character with feet.\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/kaart_FreshFonts_S_6350.jpg)\n  \nAdvertising card for our book Fresh Fonts. Translation: Typography from the underbelly.\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/kaart_MiniQuest_S_5986.jpg)\n  \nAdvertising card for our book MiniQuest 01 with sixty questions and answers about the printing and designing business: Hickeys (in dutch spanjolen) are coming from Spain.\n\nThe typeface used is the FF Profile.\n\n"
    },
    {
      "time": "29 May 2013 — 9:31am",
      "content": "Joep, those covers are nice.\n\nI like heraldry in graphic design because it's an antidote to the disease -nay, pandemic- of Modernism. Newlyn's breathtaking Unilevel logo strikes me as an espèce de heraldry.\n\nBTW, I own a dictionary of heraldry, and it rules.\n\nhhp\n\n"
    },
    {
      "time": "29 May 2013 — 9:57am",
      "content": "I like those; zooming in on the details made good background images. Nice work!\n\n"
    },
    {
      "time": "29 May 2013 — 11:56pm",
      "content": "Hrant, just as you mention heraldry is one of the parts of history in design were we can find inspiration to design new stuff. Every form in a coat of arms has his meaning and therefore it can be of great value when you design a logo, along a lot of other driteria of course. Simply rejecting it is as easy as designing a new car without wheels and engine. Of course we can try that also but looking to the past helps us just because of the fact that other clever minds have thought also about it. You can build upon that knowledge. I think that the Unilever logo can also be seen as a 'talking' coat of arms that comes nearest to the logo's, colors or arms groups where identified with hundredths of years ago. The meaning was the same and maybe we will get a more sofisticated way of making logo's. Nowadays you see even 'logofactories' where you can buy for small money a logo and you only have to paste your name in it. Heraldry developed into a graphic language and I don't use it often but there can always be a moment when you are drawing the next swoosh-like logo for a sports company to reflect and get inspiration.  \nBy the way, did Excoffon did or did not make the first 'swoosh' for Air France?\n\n"
    },
    {
      "time": "30 May 2013 — 6:42am",
      "content": "Ah, the one bad precedent he set? ;-)\n\nhhp\n\n"
    },
    {
      "time": "30 May 2013 — 2:18pm",
      "content": "Old-fashened or not, we liked the heraldry of Ströhl. Our cartouche cards were gone after selling 1,000 Dutch Letter Fountains and we wanted another set as give away with the book. So we made a new set of 4 cards with the ‘logo’s’ of the papermakers, the painters (and graphic designers), the type founders and the book printers. Again on Chromolux Pearl to get that little mysterious shift of color. Below you can see the result of the one from the type founders (front and back). We used Akzidenz Grotesk because it was introduced in 1898. But of course before that introduction there was the Steinschrift and the Royal Grotesk from Theinhardt, the one that is said of to be the prototype for the AG when Berthold took over Theinhardt. The work of Ströhl in 1891 was typical nineteenth century and the AG became the most important sans serif of the twentieth century. Simply because it was the mother of all the lookalikes that came after it. So a perfect fit and a lovely contrast ...\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/03VK_Cards_founders_S_6376.jpg)\n  \n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/03AK_Cards_founders_S_6314.jpg)\n\n"
    },
    {
      "time": "31 May 2013 — 2:46am",
      "content": "But still we had the feeling that we did not had the right material. As you know in 1970 they screened the printed images. By scanning and descreening them the picture is blurred and sharpened and the result is lack of detail. So we went on searching for the original book from 1891 because we thought that the rare full color printing was done without a screen. Here the original book we found eventually. On the cover on the left the coat of arms from Dürer and on the right the one from Gutenberg (Henne Gensfleisch). They both were seen as inventors of printing. Dürer because he printed his drawings (cut in woodblocks) in large quantities and Gutenberg for his printing with metal type.\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Strohl_CoverS_4103.jpg)\n\n"
    },
    {
      "time": "31 May 2013 — 6:46am",
      "content": "Nice.\n\nYou really do need a Franglish version of that heraldic description though...  \n [http://www.bbc.co.uk/news/blogs-magazine-monitor-22655534](http://web.archive.org/web/20130820182656/http:/www.bbc.co.uk/news/blogs-magazine-monitor-22655534 \"http://www.bbc.co.uk/news/blogs-magazine-monitor-22655534\")\n\nhhp\n\n"
    },
    {
      "time": "31 May 2013 — 11:32am",
      "content": "Hrant, you don't need glasses I think reading such small text. This was a test version. The new one is edited by Ben Archer. And he does not speak franglais ...\n\n"
    },
    {
      "time": "31 May 2013 — 1:30pm",
      "content": "Polka: I have not heard Durer considered an inventor of printing before. Do you have any references or detail on that? Printing large quantities with wood blocks was done well before Durer. For example, Koken, Empress of Japan, had printed an edition of one million scrolls in 764. Certainly his print-making popularized his art, but I am unclear on what was invented.\n\n"
    },
    {
      "time": "31 May 2013 — 6:26pm",
      "content": "~\n\n"
    },
    {
      "time": "1 Jun 2013 — 4:38am",
      "content": "Thomas, I mentioned Dürer and Gutenberg as inventors of printing in the context of Ströhl’s book I am showing. I am in particular referring to the cover illustration and to one of the first pages in this book (that are not numbered). Here it says: ‘ ... dießer beiden ersten Größen auf graphischem Gebiete.’ translated as ‘ ... this two first great people in the graphical world’. They both were seen as inventors in the printing world from the viewpoint of Ströhl and many Germans because Gutenberg made knowledge available to more people than only the elite that could pay for handwritten books. He did that through the invention of his movable type in the western world. What Dürer did was sometimes considered even more important. There was no photography, paintings and other storytelling pictures were mostly available as one original. A lot of people could not read and Dürers drawings that were printed in huge quantities gave the masses visual access to great storytelling drawings. Dürer opened a new world to the people living in that time and we should not confuse it with how we live now with all information that searches us instead of we searching for news and knowledge. Even in the time of Ströhl the printing of pictures was not as easy as it is now and maybe that is why especially in the German speaking part of Europe the work of Dürer had so much importance.\n\nI for myself describe Gutenberg in my publications always considered to be the inventor of movable metal type in the western world. He is of course not thé inventor of printing because that was done already whit the same presses as you can see in the miniature of Gutenbergs press below.\n\nIf you also want to cover the wood block prints in China, Japan and even the Korean movable metal type that was used in the Jikji in 1377, the discussion goes far beyond what I was trying to tell. But you are right to say that a longer sentence and more explanation would have been better in the text that I placed with the cover of the book from Ströhl. His book deals of course with the coats of arms of the book trade and in that concept of making and selling books his statement is understandable. Dürers role was not a mechanical invention but an communication invention to tell stories and educate people through his drawings.\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Gutenberg_Press_S_6357.jpg)\n  \nIn the box in front of the press the metal type layout or wooden block was laid. With a tampon the surface of the type or wooden block was inked and a sheet of paper was laid on it. The lid of the box was closed and the closed box was pushed under the wooden spindle. The wooden spindle was turned down and pressed upon the lid of the box creating an even pressure on the paper sheet. The wooden spindle was turned up again, the box was pushed back, the lid opened and the printed sheet of paper taken out. With all this actions only one sheet was printed! \n"
    },
    {
      "time": "1 Jun 2013 — 4:32am",
      "content": "Hrant, here the final print version of the card with my Franglais corrected into proper English by Ben Archer.\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/3_AK_Wappen_Cards_6439.jpg)\n\n"
    },
    {
      "time": "1 Jun 2013 — 6:22am",
      "content": "You misunderstood, I meant the text should be _more_ Franglish/Franglais! Not the comical contemporary lingo (in that BBC article) but the way heraldry was uttered in the past. Like having \"azure\" and \"argent\" instead of \"blue\" and \"silver\".\n\nhhp\n\n"
    },
    {
      "time": "1 Jun 2013 — 11:31am",
      "content": "Hrant, now I understand. I thought my English was a bit odd. But this is a translation of the Ströhl book and as you can see below Ströhl also described it as Blau (Blue) and Silber (Silver). I don’t think that we should alter that in a translation. You are right when you are referring to the book of Boutell (Handbook to English Heraldry). There (in the second picture) is given an alternative French name indeed.\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Strohl_Colors_S_6527.jpg)\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Boutell_Colors_S_5579.jpg)\n\n"
    },
    {
      "time": "2 Jun 2013 — 4:13am",
      "content": "Totally old-fashioned, totally not usefull anymore but how nice can history be ...  \n(Just a headline in Ströhls’ book)\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/DasWappen_S_6693.jpg)\n\n"
    },
    {
      "time": "2 Jun 2013 — 4:22am",
      "content": "This all has me wondering if there is anything about heraldry other than English or French on the web.\n\n"
    },
    {
      "time": "2 Jun 2013 — 6:10am",
      "content": "> totally not usefull anymore\n\nNever say \"never again\"!  \n [http://themicrofoundry.com/ss\\_fraktur1.html](http://web.archive.org/web/20130820182656/http:/themicrofoundry.com/ss_fraktur1.html \"http://themicrofoundry.com/ss\\_fraktur1.html\")\n\nhhp\n\n"
    },
    {
      "time": "2 Jun 2013 — 6:43am",
      "content": "Dear Té, the book from Ströhl is an Austrian book ...  \nHeraldry was ‘invented’ for the battlefield to make sure you kill the right opponent and not one of your own. I think they nowadays say that someone is killed by friendly fire. In the Middle Ages they already thought about that problem. So inevitably Heraldry only was made in countries that in the Middle Ages battled against each other with armies and knights. The painting of these banners was done by predecessors of us (graphic designers). It was done just like we make a logo nowadays. So it is not so strange that their coat of arms (that of the painters) was also dedicated to the graphic designers by Berthold in their facsimile.  \nBut I can serve you with another book of Ströhl that is even more famous than the book I showed before. The old nobility in Japan had/has also coats of arms and they are as we see them now more modern than the European ones because they make much more use of pictograms and signs. The book is called ‘Japanisches Wappenbuch – Nihon Moncho’ (Japanese Roll of Arms), Ströhl published it in 1906.\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/NihonMoncho_S_4834.jpg)\n  \n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/In_NihonMoncho_S_4795.jpg)\n\n"
    },
    {
      "time": "2 Jun 2013 — 9:22am",
      "content": "\\> I think they nowadays say that someone is killed by friendly fire.\n\nThe term \"friendly fire\" dates back about a hundred years, but I heard a general say that it's been a problem in almost every battle in history.\n\nSome friendly fire accidents are not due to mistaken identity but simply missing the target, such as arrows that get blown off course by the wind, or shells that fall short and land on friendly troops.\n\nBut sometimes it is due to mistaken identity. In some cases poor visibility is a factor, such as when fighting at night or when the battlefield is covered with gunsmoke or fog. But having distinctive clothing and equipment can certainly reduce some of the friendly fire accidents.\n\n"
    },
    {
      "time": "3 Jun 2013 — 1:09am",
      "content": "We bought the book from Ströhl with the original coats of arms because we wanted to see if the pictures were better in that publication than in the Berthold one. And they are! No destroying of details because no screening was used at that time. You can see in the details below that the scan above (from the original) has much richer detail than the scan below. Both scanned on Epson V750 Pro. Because the contrast is higher, the result from unsharp masking, the picture below seems sharp but when you look at the details everything is a bit blurry. There is also a difference in color. The picture on top is more accurate. The Berthold publication had brighter colors. Bit nurdy this post, don't you think?\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Wappen_I_twoqualities_S_5397.jpg)\n\nOn top the scan from the original book from 1891. The scan below is taken from the 1970 Berthold publication.\n\nThis is the coat of arms of the papermakers. The ox that you see is based on the watermark that was found in a lot of Gutenbergs 42-line bibles (he used different paperstocks because one papermill could not the 'huge' amount of paper he needed for his bibles). The paper with the ox watermark came from an Italian papermill in Caselle, Piedmont (see the picture below).\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/watermark-caselle_4368.jpg)\n\n"
    },
    {
      "time": "3 Jun 2013 — 9:59pm",
      "content": "\\> _http://themicrofoundry.com/ss\\_fraktur1.html_\n\nI’d say that if your theory predicts that fraktur “is inherently more readable than our conventional Roman script”, I have a nice landfill to recommend to your theory to rent….\n\n"
    },
    {
      "time": "3 Jun 2013 — 9:58pm",
      "content": "Jokes are no substitute for reasoning.\n\nhhp\n\n"
    },
    {
      "time": "3 Jun 2013 — 10:01pm",
      "content": "It **was** reasoning.\n\n"
    },
    {
      "time": "3 Jun 2013 — 10:05pm",
      "content": "Ah, now I see what the joke is.\n\nhhp\n\n"
    },
    {
      "time": "3 Jun 2013 — 10:39pm",
      "content": "> And lately another fancy has induced other printers to use the round s instead of the long one, which formerly served well to distinguish a word readily by its varied appearances. Certainly the omitting this prominent letter makes a line appear more even, but renders it less immediately legible; as the paring of all men's noses might smooth and level their faces, but would render their physiognomies less distinguishable.”\n> \n> 1789\n"
    },
    {
      "time": "4 Jun 2013 — 4:36am",
      "content": "Today we received our new and geeky publication of ‘The coats of Arms of the Book Trade’, our own interpretation of the publication of Ströhl from 1891.\n\nYou can look at the YouTube video on [http://www.youtube.com/watch?v=xGpusk2EeKs](http://web.archive.org/web/20130820182656/http:/www.youtube.com/watch?v=xGpusk2EeKs \"http://www.youtube.com/watch?v=xGpusk2EeKs\") to check it out.\n\nWe assembled a very limited edition of 250, numbered and signed by me, the author and designer (joep Pohlen). It was quite an organisation to make it. The Cairn Board paperstock was ordered in England, engraved brass plates with a line version of the Gutenberg and Dürer coats of arms took care of the foil printing in two colors, the die-cut was done for the cover, the booklet was singer-sewn and the 6 cards, printed on Chromolux Pearl were put in the pocket. A belly band made from Japanese Washi Yuzen paper, printed in silkscreen by hand with a geometric pattern was laid around the book. After that it was packed in silkpaper and bound with Finnish paper cord (that can be washed up to 40 °C???). Most of this had to be done by hand (my sister Tedje Pohlen took care of the singer sewing, and still is sewing ...).\n\nLook also on [http://www.fontana.nl/uk\\_wappens.html](http://web.archive.org/web/20130820182656/http:/www.fontana.nl/uk_wappens.html \"http://www.fontana.nl/uk\\_wappens.html\") for more info or look also on flickr for more pictures: [http://www.flickr.com/photos/96974638@N06/](http://web.archive.org/web/20130820182656/http:/www.flickr.com/photos/96974638@N06/ \"http://www.flickr.com/photos/96974638@N06/\") (we will add some more detailed pictures as soon as we have managed to do so).\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Folder1_S_4496.jpg)\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Folder2_S_4265.jpg)\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Folder3_S_5275.jpg)\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Folder4_S_5622.jpg)\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Six_CardS_3691.jpg)\n\n"
    },
    {
      "time": "4 Jun 2013 — 11:05am",
      "content": "[http://www.dr-bernhard-peter.de/Heraldik/seite38.htm](http://web.archive.org/web/20130820182656/http:/www.dr-bernhard-peter.de/Heraldik/seite38.htm) – Some pages (in German) about German heraldry.\n\n"
    },
    {
      "time": "4 Jun 2013 — 11:08am",
      "content": "Very nice, Joep.\n\nhhp\n\n"
    },
    {
      "time": "7 Jun 2013 — 5:28am",
      "content": "Festina Lente (‘more haste, less speed’ or ‘make haste slowly’) is a adage that comes from the classical Greek world. Aldus Manutius, in whose printing shop the common language was Greek, translated this adage into his printers' mark and used it for the first time in a edition of Dante in 1502. The anchor stands emblematic for slow and the dolphin for speed. It is believed that Manutius got inspired for his printers' mark through a Roman silver coin that was given to him by Cardinal Bembo and that had this sign on the reverse side. And so we have reached the typographical link of the typeface now known as Bembo. It is still one of the most used typefaces as you will know. So much that some type designers hate it almost as much as Comic Sans.  \nThe adage Festina Lente was used als in the work of famous writers like Erasmus, Shakespeare and Goethe. The meaning of it is that everything has to be done with the proper balance between urgency and diligence.  \nJust as with the coats of arms of Ströhl a lot of ‘logo's’ of the past have emblemetic connections with history.\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/Aldus_Mark_6524.jpg)\n\n"
    },
    {
      "time": "7 Jun 2013 — 6:21am",
      "content": "Joep, thank you for creating and curating this fascinating thread, along with your Calypso thread, this kind of thing is one of the reasons I love Typophile.\n\n"
    },
    {
      "time": "7 Jun 2013 — 9:35am",
      "content": "Thank goodness for graphic designers such as Paul Rand, painters such as Newman, musicians such my friend Moby. And the list could go on and on. These artists allow / invite the public (viewer, listener, whatever) to come to their 'compositions' and bring their own interpretations.\n\nNot the other way around.\n\nIn short ...there is no preconceived narrative or allegorical symbolism emblematic to the point of class structure(s) ...no dusty lectures of you vs me, or us vs them. I don't mind the above dust from the past, it does have some measure of historical importance ...it is needed to remind us all of how far we have come with our ability to communicate.\n\n"
    },
    {
      "time": "7 Jun 2013 — 11:16am",
      "content": "There's a difference between works of art, where each viewer can bring their own interpretation, and visual symbols that are designed to convey a specific message. I don't faulty heraldry for trying to convey specific messages; we do that today sometimes, too.\n\nI don't want other drivers bringing \"their own interpretation\" to a stop sign. And there are countless other modern examples, such as interface design, maps, signage, and so forth. It's not fine art but it wasn't intended to be.\n\n"
    },
    {
      "time": "7 Jun 2013 — 7:24pm",
      "content": "Way finding signage and other public graphic utilities are apples ...heraldic branding and other private graphic/artistic pursuits are oranges.\n\nYou sir are trying to compare apples to oranges :) Public vs private. And by private I include clubs, corporations, and the like ...stuff that can divide you from me.\n\nAlthough it would be mildly amusing to read the interpretations of a stop sign by a philosopher, a physicist, and a plumber.\n\n"
    },
    {
      "time": "7 Jun 2013 — 8:44pm",
      "content": "Heraldic branding is in intent every bit as much an apple. It needs to convey an explicit meaning very clearly, to that will be understood the same way by all.\n\n"
    },
    {
      "time": "7 Jun 2013 — 11:17pm",
      "content": "\\> You sir are trying to compare apples to oranges :)\n\nAnd I'd say the same about your viewpoint. :) Guess we'll have to agree to disagree.\n\n"
    },
    {
      "time": "7 Jun 2013 — 11:27pm",
      "content": "Sure indeed it does but heraldic symbolism by design/nature is exclusive ...orange.\n\n"
    },
    {
      "time": "8 Jun 2013 — 9:03am",
      "content": "Coats of arms and symbolism can also be used in a different way. It is not the one or the other. Getting the coats of arms of the book trade back from the past was for me an example of the graphic language we developed and from which we can still learn.  \nSome years ago, before I got interested in the coats of arms I used for our publication, we made a logo for a school that wanted to provide a more protected environment after the more loosely educational concepts that we had in The Netherlands for a couple of decades. The graphic language of a more heraldic logo gave a more disciplined character to the school. It is not made according heraldic rules but gives a modern interpretation of it. You can like it or not but in providing a succesfull solution for a look and feel it fitted well and gave expression to the concept of the school.\n\n ![](http://web.archive.org/web/20130820182656im_/http:/typophile.com/files/MavoRGB_def_5112.jpg)\n\n"
    },
    {
      "time": "8 Jun 2013 — 9:09am",
      "content": "Very nice.\n\nhhp\n\n"
    },
    {
      "time": "8 Jun 2013 — 6:44pm",
      "content": "Something is in the air... This  \n [https://twitter.com/DesignMuseum/status/343462485036236800/photo/1](http://web.archive.org/web/20130820182656/https:/twitter.com/DesignMuseum/status/343462485036236800/photo/1 \"https://twitter.com/DesignMuseum/status/343462485036236800/photo/1\")  \nwas posted to the Design Museum's Twitter feed today.\n\nhhp\n\n"
    },
    {
      "time": "9 Jun 2013 — 11:56pm",
      "content": "Coats of Arms and a simple escutcheon are two completely different heraldic expressions. The former has an articulate elaborate graphic vocabulary ...unlike your twitter - esque graphic grunt.\n\n> It is not made according heraldic rules but gives a modern interpretation of it.\n\nYep, you can say that again.\n\nBut either way ...Coats of Arms (or perhaps sarcastically speaking ...Goats of Farms) and your simplistic escutcheon are firmly dated to the past. And as I said before that that is OK. We learn from the past and move on...\n\nGetting stuck in the past / selling out to the past ...on the other hand... is very very dangerous.\n\n"
    }
  ]
}
