{
  "id": "103300",
  "title": "Ladislas Mandel?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anyone have any more information or resources for the work of Ladislas Mandel?\n\nApart from Luc Devroye's resourceful [http://luc.devroye.org/fonts-32467.html|page] and an [http://collections.bm-lyon.fr/mil/search?query=creator:%22Mandel,%20Ladislas,%201921-2006%22|online archive] at the Musée de l'Imprimerie, I haven't found anything else.\n\nI have been recommended [http://www.abebooks.co.uk/servlet/BookDetailsPL?bi=1356009474&searchurl=an%3DLadislas%2BMandel%26bt.x%3D0%26bt.y%3D0%26sts%3Dt|these] [http://www.abebooks.co.uk/servlet/BookDetailsPL?bi=837948946&searchurl=an%3DLadislas%2BMandel%26bt.x%3D0%26bt.y%3D0%26sts%3Dt|books] too.\n\n",
  "author": "hashiama",
  "time": "26 May 2013 — 5:01am",
  "uid": "16341",
  "comments": [
    {
      "time": "26 May 2013 — 5:05am",
      "content": "Bugger, sorry about the formatting.\n\nI'm particularly interested in Mandel's work for phonebooks.\n\n"
    },
    {
      "time": "26 May 2013 — 6:47am",
      "content": "Also, see “Printer's Type in the Twentieth Century: Manufacturing and Design Methods ” by Richard Southall. I remember the author referring to Mandel's typeface designed for telephone directory in this book.\n\n"
    },
    {
      "time": "26 May 2013 — 6:54am",
      "content": "An article by Olivier Nineuil on Mandel’s work, « Ladislas Mandel : Explorateur de la typo française », from _Étapes graphiques_ (Nº 10, 1999, pp. 44–64) can be found [here](http://web.archive.org/web/20150415041034/http:/etapes.com/files/mandel.pdf). It offers a nice reading list.\n\n"
    },
    {
      "time": "26 May 2013 — 7:26am",
      "content": "I love Mandel's work. He balanced art and technique so superbly.\n\nI have his \"Du pouvoir de l'écriture\", and I do recommend it (if you read French) but there's little technical stuff in there - it's mostly cultural. As Sevag says, Richard Southall's book is a better bet; he worked with Mandel on his most significant \"lo-fi\" type (Colorado) and the last chapter is a highly detailed account of that project.\n\nBTW Mandel's successor of sorts in the realm of phone book type is Piero De Macchi, whom I had the pleasure of meeting at ATypI-Rome in 2002. His Nomina is pretty amazing.\n\nMaxim, I didn't know about that article - what a keeper!\n\nhhp\n\n"
    },
    {
      "time": "26 May 2013 — 1:38pm",
      "content": "> Maxim, I didn't know about that article - what a keeper!\n\nI used to know Stanislas. I met him and many other _Compagnons de Lure_ in 1997, at their annual get-together in Lure-en-Provence. Ladislas was a sweet man, and a great design professional. Now his Cyrillics is another story in its entirety…\n\n"
    }
  ]
}
