{
  "id": "103369",
  "title": "Any ideas?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi all, I'm having difficulty tracking down this face. I've found a few that are a close, but not that close. Any help would be appreciated!\n\n ![](http://web.archive.org/web/20131018220105im_/http:/typophile.com/files/typesample_5130.jpg)\n\n",
  "author": "tdhanson",
  "time": "29 May 2013 — 3:19am",
  "uid": "211862",
  "comments": [
    {
      "time": "29 May 2013 — 6:07am",
      "content": "This appears to be signage of some kind—perhaps metal or plastic letters. As such, it may not represent a typeface used in print, so you may have to settle for \"close\"…\n\n"
    },
    {
      "time": "29 May 2013 — 7:22pm",
      "content": "Signmakers and memorial makers use adapted fonts that are often lower contrast than familiar faces. They sometimes use names for their fonts that differ from the common font names.  \nYou could try some Google searches such as \"letters for signs\" and check out companies such as [BuySignLetters.com](http://web.archive.org/web/20131018220105/http:/www.buysignletters.com/signdesigns/shopping2/default.asp). Major sign letter companies have several font lists for example [Cast Bronze Letters](http://web.archive.org/web/20131018220105/http:/www.buysignletters.com/signdesigns/shopping2/shopdisplaysubcat.asp?id=25&cat=Cast+Bronze+Letters+Click+Font+For+Sizes+And+Pricing).  \nAlso you could search for \"sign making fonts\" and check out the offerings to people with machines to cut fonts in plastic. See for example [Signfonts.com](http://web.archive.org/web/20131018220105/http:/artandsignstudio.com/faqs.html).  \nThis is helpful if you are looking for some additional signage. If you want to print something with the font shown for the letters you might be lucky and find it under a name that relates to a standard font. But when the company uses a term like \"architectural\" to refer to letters that match, I can see that this would be frustrating.  \nAs oldnick says the you may have to settle for \"close.\" You might look at fonts categorized as Old Style, rather than Modern. The letters have a lower contrast and an angled axis for example the\"O\", like your specimen, rather than the high contrast and vertical axis of \"Modern\" fonts. Here Modern means the style popular in the 19th century -- Bodoni etc -- and Old Style refers to much earlier styles.  \nDon\n\n"
    },
    {
      "time": "29 May 2013 — 7:20pm",
      "content": "Another sign font list:  \n [http://www.geminisignletters.com/05styles.htm](http://web.archive.org/web/20131018220105/http:/www.geminisignletters.com/05styles.htm \"http://www.geminisignletters.com/05styles.htm\")  \nShort and easy to compare.  \nDon\n\n"
    },
    {
      "time": "30 May 2013 — 3:11pm",
      "content": "Thanks for the helpful comments, much appreciated! I'll keep digging.\n\n"
    }
  ]
}
