{
  "id": "103392",
  "title": "May 2013 Font - Critique",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello all.\n\nI started my first typeface hence the temporary name for the project.\n\nIt would be great to get some feedback while working on the typeface so far I have done the lower-case and plan on working on the upper-case next. OnceIi have done that I will go back to the lower-case as a lot of the curves are far from perfect.\n\nAlso please note I haven't done any kerning yet as this is something I need to research first.\n\nThe inspiration for this typeface where early sketches of Futura, Bauhaus and Univers. Please let me know if it looks too similar to any of these fonts as i wanted to use them as inspiration and not to look exactly the same.\n\n ![](http://web.archive.org/web/20150414230413im_/http:/typophile.com/files/may2013-01_3531.png)\n  \n\n ![](http://web.archive.org/web/20150414230413im_/http:/typophile.com/files/may2013-02_4137.png)\n  \n\n ![](http://web.archive.org/web/20150414230413im_/http:/typophile.com/files/may2013-03_6440.png)\n\n",
  "author": "designjacob",
  "time": "29 May 2013 — 2:44pm",
  "uid": "211319",
  "comments": [
    {
      "time": "30 May 2013 — 5:28pm",
      "content": "There have been many revivals of that historic \"font style\". What's your plan for making yours relevant? Without simply throwing in a gimmick...\n\nAlso (assuming you want this look refined, as opposed to \"faux naïve\") you'll need to modulate the joins. For starters, closely compare your \"a\" to the one in Futura.\n\nhhp\n\n"
    },
    {
      "time": "10 Jun 2013 — 10:15pm",
      "content": "As a first type-face this is good for starters. Don't let Sir Hrant scare you off. :-)\n\nThis has been done a lot, so be minded to carefully refine this. Focus a lot on the space between letters. That will help this go from just another historical Bauhaus face to great! :-)\n\nI agree with Hrant on the joins. Check out [this site](http://web.archive.org/web/20150414230413/http:/www.typeworkshop.com/index.php?id1=type-basics), and try to apply those principles on your font. Also notice the where two lines join each other (for instance as on the |r| or |m|) the lines are thinned out. Take heed also to thinning the horizontals vs. the verticals.\n\nCan't wait to see more!\n\n"
    }
  ]
}
