{
  "id": "103368",
  "title": "Wooden typeface no.3!",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "id",
    "letterpress",
    "wood",
    "Type ID Board [OLD]"
  ],
  "content": "This strong, condensed wooden typeface is the last one I haven't identified from my fine art academy archive.  \nDo you have any clue?\n\nthanks  \na.\n\n| Attachment | Size |\n| --- | --- |\n| [font.jpg](http://web.archive.org/web/20131012065725/http:/typophile.com/files/font_340.jpg) | 61.13 KB |\n\n",
  "author": "earthache",
  "time": "29 May 2013 — 2:30am",
  "uid": "98415",
  "comments": [
    {
      "time": "29 May 2013 — 3:07am",
      "content": "Possibly one of the following: [Aurora](http://web.archive.org/web/20131012065725/http:/www.myfonts.com/search/aurora)/ [Wagner Grotesk](http://web.archive.org/web/20131012065725/http:/www.myfonts.com/search/wagner+grotesk)/ [Viktor](http://web.archive.org/web/20131012065725/http:/www.myfonts.com/fonts/librito/viktor)\n\n"
    },
    {
      "time": "29 May 2013 — 4:48am",
      "content": "From the Canada Type info on Wagner Grotesk:  \n\"This is the elaborate digital version of Edel Grotesque Bold Condensed (also known as Lessing, Reichgrotesk, and Wotan Bold Condensed) a 1914 typeface by Johannes Wagner, which was later adopted by pretty much every European type foundry, exported into the Americas, and used on war propaganda posters on either side of the Atlantic.\"  \nYour wooden type is almost certainly Johannes Wagner's 1914 design. Presumably it is by an Italian foundry. I don't know whether they used one of the German names or created an Italian one. Take your pick for a name from the suggestions by CT and Ryuk or use an appropriate Italian term.  \nDon\n\n"
    },
    {
      "time": "1 Jun 2013 — 8:24am",
      "content": "Thanks a lot!  \nThis is the last unidentified font,  \nit is really similar to a Condensed Akzidenz Grotesk and Burear Grotesque, yet the straight R is driving me crazy.\n\n ![](http://web.archive.org/web/20131012065725im_/http:/typophile.com/files/specimenSTBLgrotweb_4763.jpg)\n\n"
    },
    {
      "time": "1 Jun 2013 — 11:01am",
      "content": "Straight leg R might help eliminate 19th century designs. I did not see any as wood type. But that is not to say they did not exist.\n\nBTW, numbers often sold separately in old fonts. This one seems to have integral numbers. Compare 6&9 with b, d, g, q & p.\n\nLooks sort of Germanic, So you might try a careful review of fonts tagged [\"grotesk\" at MyFonts](http://web.archive.org/web/20131012065725/http:/www.myfonts.com/search/tag%3Agrotesk/fonts/%3Cbr%20/%3E).\n\nA real challenge.  \nAny suggestions to help earthache?  \nDon\n\n"
    },
    {
      "time": "1 Jun 2013 — 5:00pm",
      "content": "Suggestions, I'm afraid not. Thought I'd mention, though, that Hanseatic (BT's [Swiss 924](http://web.archive.org/web/20131012065725/http:/old.myfonts.com/fonts/bitstream/swiss-924/)) was an 1890's Stempel typeface that shared those unique, sharper-than-usual \"curved corners\" on letters like a, b, d, etc. It also had a straight-legged R. Too condensed and lots of differences, though.\n\n"
    },
    {
      "time": "1 Jun 2013 — 5:57pm",
      "content": "Good call Mike.  \nI can see this woodtype as a descendent of the Stempel typeface. Leaving aside the degree of being condensed and other points, the lower case is bang-on for the unique a, b, d, g, q & p. Not unexpectedly Stemple's Hanseatic did not have harmonizing numbers. These seem to be a later addition by whomever did further work on the design. The woodtype R is consistent with a cleanup. The Woodtype Q would work as a solution of having none of the Capitals descend below the base line -- but this is just speculation on the difference.\n\nJaspert's description of Hanseatic, as sold by Linotype Frankfurt is \"A condensed lineale with short descenders.\" Jaspert notes that \"lineales\" is the description applied by Maximillan Vox to types without serifs.\n\nKlingspor footnotes its listing of Hanseatic, designed at Linotype in 1964, with the comment \"Aus der eng fetten [bold condensed] information entwickelt [developed] von A. Ritzel. \" Not clear if Rizel is for 1964 Linotype or Stempel 189o's.\n\nSo if we can't find out anything more about this wood type you might go with a label like Hanseatic Inspired Lineale.\n\nDon\n\n"
    },
    {
      "time": "1 Jun 2013 — 6:46pm",
      "content": "Easy to recreate this woodtype's a, b, d, g, h, m, n, q & p by opening the condensed whitespace in Hanseatic (BT's Swiss 924).\n\n ![](http://web.archive.org/web/20131012065725im_/http:/typophile.com/files/WoodtypeHanseaticInspiredRecreated_3732.jpg)\n  \nPretty close!  \nThis confirms Stemplel's 1890s Hanseatic as the origin of the design.  \nDon \n"
    },
    {
      "time": "6 Jun 2013 — 2:17am",
      "content": "Thanks! This was a huge help!!\n\n"
    },
    {
      "time": "6 Jun 2013 — 4:04am",
      "content": "You're welcome.  \nDon\n\n"
    }
  ]
}
