{
  "id": "103398",
  "title": "Help to ID this type",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "#font",
    "Type ID Board [OLD]"
  ],
  "content": "Can some-one help to ID this type. Its from a book cover dating back to 1902. See attachment, thanks  \nNot sure if the if the T and R, are part of the type?\n\n",
  "author": "rgoer who",
  "time": "29 May 2013 — 6:17pm",
  "uid": "211884",
  "comments": [
    {
      "time": "29 May 2013 — 6:18pm",
      "content": " ![](http://web.archive.org/web/20150303170911im_/http:/typophile.com/files/Peter%20Rabbit%20Cover%20font_4351.jpg)\n\n"
    },
    {
      "time": "29 May 2013 — 6:19pm",
      "content": "see image\n\n"
    },
    {
      "time": "29 May 2013 — 7:58pm",
      "content": "In 1902 Book Covers were an art form using hand lettering and illustration. Note the E's. No two are alike.  \nThe lettering for this cover is representative of the fashion of the day. Note the tilde shaped bar on the E and F. A few fonts, not all digitized, with this effect: Titania, Pretorian, Gazebo, Oriente (Oliver), Harlech, Grange, Olympian.  \nDon\n\n"
    },
    {
      "time": "29 May 2013 — 10:54pm",
      "content": "Those Beatrix Potter books have always had, and still do have that distinctive type. I have never seen it anywhere else.\n\n"
    },
    {
      "time": "30 May 2013 — 3:29am",
      "content": "This lettering was used on the first edition published by F. Warne & Co. in 1902. Enhanced excerpt of the lettering on the cover, taken from my files:\n\n ![](http://web.archive.org/web/20150303170911im_/http:/typophile.com/files/CoverLetteringExcerptedAndEnhanced_3674.jpg)\n  \nExcerpt of the lettering on the cover of a later edition:  \n\n ![](http://web.archive.org/web/20150303170911im_/http:/typophile.com/files/CoverLetteringExcerpted_6313.jpg)\n  \nNote that it looks similar but is more crudely executed.  \nThe practice in the trade was to attempt to keep the tone consistent for a series -- which would explain the distinctive titling for your Beatrix Potter books.  \nIn later years fonts were chosen that approximated the original lettering.  \nHere is a 1999 edition with a font that is a pretty good match to the original lettering:  \n\n ![](http://web.archive.org/web/20150303170911im_/http:/typophile.com/files/CoverTitlingExcerpted_5399.jpg)\n  \nI suspect that it is a private font produced for F. Warne & Co.  \nAnyway, its not in my folder with tilde shaped bar fonts.  \nDon \n"
    },
    {
      "time": "30 May 2013 — 3:33am",
      "content": "The original design reminds me of [Founder's Caslon](http://web.archive.org/web/20150303170911/http:/www.myfonts.com/fonts/itc/founders-caslon). It could be interesting to start with and recreate the former lettering.  \nAs alternative (not saying it could be considered as close), [Yana](http://web.archive.org/web/20150303170911/http:/www.myfonts.com/fonts/laura-worthington/yana) by Laura Worthington could do the trick very well. Less but not off is [Erasmus](http://web.archive.org/web/20150303170911/http:/www.myfonts.com/fonts/redrooster/erasmus-rr).\n\n"
    },
    {
      "time": "30 May 2013 — 7:42am",
      "content": "I confirmed that F. Warne is in fact currently using the font. See [http://www.peterrabbit.com/](http://web.archive.org/web/20150303170911/http:/www.peterrabbit.com/ \"http://www.peterrabbit.com/\") where it appears in an interative book, perhaps as a Flash font excerpt.  \nPenguin bought F. Warne in the 1980s and spend money on reviving the business. I suspect this included development of the new font. It might have been in-house or by contract. Some contracts, such as the well known one by the Economist magazine for Officina display, have an exclusive use period followed by return of rights to the designer for sale as the designer wants. In this case it seems Penguin/Warne have retained the rights and it will not be available for sale to the public any time soon.  \nHowever, there is no copyright restriction on using the original lettering of 1902 to create an original font, without using any of the digital data owned by Penguin/Warne. See sample:\n\n ![](http://web.archive.org/web/20150303170911im_/http:/typophile.com/files/EandF_FromOriginalLettering_4521.jpg)\n  \nThe question is whether anyone would pay for it. If there is no market, it's not worth doing.  \nDon \n"
    },
    {
      "time": "30 May 2013 — 8:39am",
      "content": "> there is no copyright restriction on using the original lettering of 1902 to create an original font\n\nThere might however be other restrictions...\n\nhhp\n\n"
    },
    {
      "time": "30 May 2013 — 11:01am",
      "content": "Other restrictions would depend on various national laws.  \nCertainly Warne would take action if such a font was used to promote Beatrix Potter stories, which can be freely distributed because they are in the public domain with long expired copyright, but are still cash cows for Warne because of the \"look and feel\" of the Warne product. Echos of Disney & The Mouse that extended intellectual property rights for generations after the creators have ceased to exist. IP is going to be a big issue in the upcoming decades. Plenty of employment for lawyers. Plenty of money for mega companies, not much for the actual creators.  \nBTW AFAIK the lettering was not done by Potter. At least it's not mentioned in books about her that I have checked.  \nDon\n\n"
    },
    {
      "time": "31 May 2013 — 12:46am",
      "content": "What font is the sample you have posted E F or is it from their web page?\n\nThe T looks closely like a fat T of \"Pretorian DT\"\n\nOverall maybe combo of various font type?\n\nShould not be any problem with copy write now for either font or the book from 1902.\n\nMaybe the R is another style of font?\n\n"
    },
    {
      "time": "31 May 2013 — 2:03am",
      "content": "EF is NOT from an existing font. NOTHING was taken from the Warne web page!  \nIt is an original creation made from scratch in Fontlab.  \nIt is based on the original book covers lettering from 1902 to 1910. There are almost two dozen, each with a variation of the same lettering style.\n\n ![](http://web.archive.org/web/20150303170911im_/http:/typophile.com/files/_SquirrelNutkin1903_5760.jpg)\n  \n\n ![](http://web.archive.org/web/20150303170911im_/http:/typophile.com/files/_JeremyFisher1906_3565.jpg)\n  \n\n ![](http://web.archive.org/web/20150303170911im_/http:/typophile.com/files/_TomKitten1908_4829.jpg)\n  \nYou may check some at Archive.org. Search for Beatrix Potter.  \nLettering artists of the era tended to copy one another so this is not a particularly original design.  \nThe tilde shaped bar seems to have been first used by Thayler.  \nThe T with raised spikes is a very common 19th century style. See for example the digital revival from Canada Type. [Ronaldson](http://web.archive.org/web/20150303170911/http:/www.myfonts.com/fonts/canadatype/ronaldson/) designed vy Alexander Kay, Rebecca Alaccari and Patrick Griffin. Recommended for purchase.  \nThe R, which varies from cover to cover, is a common style for lettering in the era.  \nDon \n"
    },
    {
      "time": "21 Jun 2013 — 4:56pm",
      "content": "As mentioned in previous posts the private font produced for F. Warne & Co. will probably not be made available. But there ARE some fonts with similar features in the \"transitional\" category -- i.e. Baskerville etc. This Warne variation might be described as being in an English vernacular style. Note its low contrast and large rounded serifs dished at the midpoint.  \nI recommend [Plantagenet](http://web.archive.org/web/20150303170911/http:/www.myfonts.com/fonts/tiro/plantagenet/) by Ross Mills of Trio Typeworks. Some letter forms are quite different, but the flavor is the same.  \nDon\n\n"
    }
  ]
}
