{
  "id": "103365",
  "title": "Altering an existing font for commercial book use",
  "forum": "Design",
  "tags": [
    "copyright",
    "License",
    "Design"
  ],
  "content": "Hi,  \nI'm new here, and thinking of copyright issues. I have searched the forum but haven't found satisfying answers to this:\n\nCan I modify/alter an existing font with a font software and use it in a commercial or non-commercial published work, for example a book or magazine. Probably the answer is usually NO, but what if I would mention the original font in the book/magazine and that I have re-cut it for this particular use? Or do I always need to ask a permission?\n\nHere's an example I noticed:  \nThe sculptor Henry Moore's 'Late Large Forms' book published by Rizzoli uses an altered version of Spiekerman's Meta font (please correct me if I remember wrong) both in its headers and body text. As you can see from the cover image of the book, some of the letters are strongly altered, such as the upright corners of the letters e and g.\n\nI think the book is beautifully designed in every respect, but it does not tell anything about the font nor the designer. If anyone knows, I would like to know more, like does this kind of font use need a permission from the original font designer or the foundry. Obviously in Rizzoli's case the copyright issues and permissions are fine.\n\n| Attachment | Size |\n| --- | --- |\n| [moore.jpg](http://web.archive.org/web/20140718194015/http:/typophile.com/files/moore.jpg) | 74.19 KB |\n\n",
  "author": "amedeo s",
  "time": "29 May 2013 — 12:51am",
  "uid": "211858",
  "comments": [
    {
      "time": "29 May 2013 — 2:06am",
      "content": "This is not Meta but Gill Sans! Also, the letters are not altered. This is a special cut by Monotype, probably Series 362.\n\n"
    },
    {
      "time": "29 May 2013 — 5:12am",
      "content": "Haha damn how fool can I be. Need to do the homework. Thank you!  \nBut, I'm still interested, hypothetically, would altering the font in this kind (book) of use be okay/legal/no-go?\n\n"
    },
    {
      "time": "29 May 2013 — 5:19am",
      "content": "Most EULAs don't allow modifications, some do. FontFont does not, unless you ask for special permission. You really have to read the EULA for each font (and, or ask the foundry).\n\n"
    },
    {
      "time": "29 May 2013 — 5:28am",
      "content": "Meta? Definitely not. Gill Sans? I am not so shure. Gill Sans Series 362 is Gill Sans light. I think that this typeface here is Uhertype Grotesk by Jan Tschichold. Revived and expanded by Thierry Puyfoulhoux as [Tschichold](http://web.archive.org/web/20140718194015/http:/www.myfonts.com/fonts/presencetypo/tschichold/) It is very similar to Gill indeed, but when you look at ‘a’ and ‘t’ it becomes obvious that this is not Gill. The g without the bar does not seem to be included in the Tschichold typeface as currently available from Linotype or MyFonts, but Tchichold designed such a g for the first version of Uhertype Grotesk. You will find it in the book Active Literature: Jan Tschichold and New Typography by Christopher Burke. So the g on this book cover is either available in a customized version of the Tschichold typeface by Thierry Puyfoulhoux or this here is a revival of Uhertype Grotesk by another designer which included the g without bar in the font.\n\n"
    },
    {
      "time": "29 May 2013 — 7:49am",
      "content": "<cite>...Gill Sans? I am not so shure.</cite>\n\nDepends from whom, and when, you bought the license. If from Monotype, no modification allowed. If from Adobe before 2011, yes. Isn't the law fun?\n\n"
    },
    {
      "time": "29 May 2013 — 9:04am",
      "content": "> _...Gill Sans? I am not so shure._\n> \n> Depends from whom, and when, you bought the license. If from Monotype, no modification allowed. If from Adobe before 2011, yes. Isn't the law fun?\n\nI wasn’t talking about the license, I was talking about which typeface is used for the cover. And I am not shure that that typeface is Gill Sans, I think it is Tschichold by Puyfoulhoux.\n\n"
    },
    {
      "time": "29 May 2013 — 9:14am",
      "content": "1) Modify freely. To me no-mod clauses are rarely socially justifiable (and I personally class social justice above profit).  \n2) Make dead sure the modified version doesn't leak out. Obviously in a large operation this is 99% inescapable, so don't risk it. Large companies gotta pay up for formal permission.  \n3) If it _does_ leak, don't try to weasel out of the consequences.\n\nOldschool risk/accountability.\n\nBTW, has there ever been a case where a font house has confronted somebody based simply on seeing a modified version of one of their fonts used? (I mean as opposed to distributed, like happened with UPS/Meta.)\n\nhhp\n\n"
    },
    {
      "time": "31 May 2013 — 3:07pm",
      "content": "I have heard of such from some foundries, yes. Not sure how common it is to discover such an event and then hassle people about it.\n\n"
    },
    {
      "time": "31 May 2013 — 3:26pm",
      "content": "I wonder what results they got, and how quickly they realized how non–cost-effective it is...\n\nhhp\n\n"
    },
    {
      "time": "7 Jun 2013 — 3:35am",
      "content": "Thank you all for your constructive feedback! This really helped.  \nLaw certainly is fun.\n\n"
    }
  ]
}
