{
  "id": "10336",
  "title": "Henk Krijger / Raffia Initials",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "As ATypI members among you might know, I have a decades-long interest in the work of the Dutch 1950s graphic designer & artist Henk Krijger. Two years ago I made an ATypI presentation on his Raffia Initials and showed about half a dozen uses of the typeface, mostly on books he designed. I'm interested in finding additional sightings of the initials, especially in letterpress. Anyone?   \n   \n ![raffia_G](http://web.archive.org/web/20100710170518im_/http:/www.typophile.com/forums/messages/30/69849.jpg)\n\n",
  "author": "<a href=\"/web/20100710170518/http://typophile.com/user/6083\" title=\"View user profile.\">enne_son</a>",
  "time": "<br>",
  "uid": "6083",
  "comments": [
    {
      "time": "",
      "content": "Mr. Enneson,\n\nGreetings. I have digitized Raffia and have used it sparingly in the magazine I art-direct, Rap-Up. I'd love to ask you a few questions about the initials. My email is:  \n [ian@ianlynam.com](mailto:ian@ianlynam.com)  \nDrop me a line sometime if you have time.  \n A sample spread:\n\n ![](http://web.archive.org/web/20100710170518im_/http:/typophile.com/files/rapup3_05.jpg)\n\n"
    },
    {
      "time": "",
      "content": "For those of you who are interested, I've made a pdf file of my ATypI Vancouver presentation available [here](http://web.archive.org/web/20100710170518/http:/www.enneson.com/public_downloads/pe/typophile/typophile_HKs_RIs.pdf). It is 20MB, print and text and image extraction disabled. Please honour the copyright note. Ian tells me his digitization was done in Adobe Illustrator, and being converted to OpenType.\n\n"
    },
    {
      "time": "",
      "content": "Hi\n\nYou mentioned the Raffia Initialen in regard to letterpress. I bought a case(s) of the metal Raffia way back in the early 1980s and never received them. Sort of a bait and switch deal. Even switched out a press on me. Nice guy, just weird about material things. It just so happens that a couple of days ago I discovered that much of the material involved may have recently ended up with a very good friend of mine. I'll check and see if the Raffia was included. If so, maybe I can plead a case. A very remarkable typeface.\n\nVery very nice presentation by the way. Thank you.\n\nGerald  \nThe Bieler Press  \n [http://BielerPress.blogspot.com](http://web.archive.org/web/20100710170518/http:/bielerpress.blogspot.com/ \"http://BielerPress.blogspot.com\")\n\n"
    },
    {
      "time": "",
      "content": "Wow, very outstanding work indeed. Also very interesting and nice presentation Peter, I'll read it soon.  \nHéctor\n\n"
    },
    {
      "time": "",
      "content": "Gerald and Héctor, thanks for the comments.\n\nGerald, I have only seen letterpress Raffia once. Kay Amert, Director of the Typography Laboratory at the University of Iowa, brought the electrotype sample [here](http://web.archive.org/web/20100710170518/http:/www.enneson.com/public_downloads/pe/typophile/galvano_op_loden_voet.pdf) to ATypI Vancouver, where I got it scanned and had Jim Rimmer make a letterpress impression on a piece of cardboard stiffener. Presumably the set was bought by Harry Duncan, the first Director, who according to Robert Bringhurst, also admired the initials.\n\nLet me know what you find.\n\n ![](http://web.archive.org/web/20100710170518im_/http:/typophile.com/files/%5D%5Bimg:)\n\n"
    },
    {
      "time": "",
      "content": "This thread is over two years old, but I am again on the hunt for examples of the Raffia Initials in use, preferably in letterpress or fine printing. This time it's for an essay request.\n\nAlso, I wonder if there is anyone out there who has done historical work on 'cadels' / 'lettres cadeaux’ (see page 60) of the pdf at the link in the 18 febreuary 2006 message above.\n\n"
    }
  ]
}
