{
  "id": "103329",
  "title": "Choosing line length depending on the font size",
  "forum": "General Discussions",
  "tags": [
    "font size",
    "General Discussions",
    "line length",
    "reading pose"
  ],
  "content": "As discussions in [An Ideal Page: Line length, Leading, Margins, Page Size, Etc.](http://web.archive.org/web/20140804050104/http:/typophile.com/wiki/An%20Ideal%20Page%3A%20Line%20length%2C%20Leading%2C%20Margins%2C%20Page%20Size%2C%20Etc.) and [Cyrillic (Russian) ideal number of characters per line](http://web.archive.org/web/20140804050104/http:/typophile.com/wiki/Cyrillic%20%28Russian%29%20ideal%20number%20of%20characters%20per%20line) go, the topics discussed make absolutely no sense to me. Discussing the “optimal number of characters on line” begs the question — it presumes that when one increases font size by a certain percentage, the optimal line length should increase by _the same_ percentage. And I find this presumption silly.\n\nBut thinking about this more, the may be some _other_ power law governing the relation between the font size and line length. Suppose one is _required_ to prepare two copies of a book, one set in 10pt, another in 14pt; suppose that the choice of page size and layout is completely in your hands. It is natural to assume that the larger-font variant will be designed to have somewhat larger page size. Probably not by 40%, but definitely larger.\n\nMy question is: how much larger? The increase in percents will determine the exponent of the power law: if the “desired” increase in size is 18%, it is ½-power; if 12%, ⅓-power etc. (Was this question discussed before? I can’t find any reference….)\n\nI see one major complication: choosing a page size should depend on the expected position of the book when read. People reading in chaise-long-position would react on a heavier book differently than people who prefer reading at a desk. Is there any wisdom in addressing such differences?\n\n——————————————————————————————\n\nBTW, why I consider the rules like “1½ lowercase alphabet” ridiculous: a couple of thought experiments. In XVIII century reform of Russian alphabet, 6 of 46 “duplicate” letters were removed. Does it mean that the optimal length of line should have been decreased 15%? In XX century reform of Russian alphabet, 3 of 36 excess letters were removed. Does it mean that the optimal length of line should have been decreased 10%?\n\nTo add insult to injury, note that difference between these two reforms: the XX century reform removed the terminal hard sign Ъ. This reduced the average length of a word (about 10%?). And _this_ may have a chance of affecting the optimal line length (but here I consider line length in the case of a prescribed-in-advance font size!).\n\n———————————————————————————————  \nTo summarize: I think that discussion of optimal line length makes sense when one knows in advance the font size, and the expected reading pose. It does not make sense without this knowledge.\n\n",
  "author": "ilyaz",
  "time": "27 May 2013 — 2:16pm",
  "uid": "210314",
  "comments": [
    {
      "time": "27 May 2013 — 6:59pm",
      "content": "Dude, you are overthinking this issue, based on a number of unwarranted assumptions, such as “ It is natural to assume that the larger-font variant will be designed to have somewhat larger page size.” Why is this a “natural” assumption? Have you ever heard of large-print editions?\n\n"
    },
    {
      "time": "28 May 2013 — 6:31am",
      "content": ".\n\n"
    },
    {
      "time": "27 May 2013 — 8:01pm",
      "content": "_Large print edition?_ This is exactly what I had in mind. And the good ones I saw were of larger format. (And: if your opinion is that the page size will remain the same, this just means that your answer is 0%, dudillo! So it is not any indication of “unwarranted assumptions”. Especially remarkable answer, since the hypothesis that “there is an optimal number of characters” presumes that the answer to my question is **exactly** 100%….)\n\n_A client?_ I specifically said: **the choice of page size and layout is completely in your hands**.\n\n"
    },
    {
      "time": "27 May 2013 — 8:26pm",
      "content": "If you can locate the guidelines mentioned below perhaps they might contain something useful:\n\nThe National Association for Visually Handicapped (NAVH) provides the NAVH Seal of Approval to commercial publishers for books that meet their large print standards. The standards call for:\n\nMaximum limits on size, thickness, and weight  \nMinimum limits on margins  \nType size at least 16 point, preferably 18 point  \nSans serif or modified serif font recommended  \nAdequate letter and word spacing  \nFlexible binding recommended to allow open book to lie flat\n\n- [http://en.wikipedia.org/wiki/Large-print](http://web.archive.org/web/20140804050104/http:/en.wikipedia.org/wiki/Large-print \"http://en.wikipedia.org/wiki/Large-print\")\n\n"
    },
    {
      "time": "27 May 2013 — 9:16pm",
      "content": "\\> _If you can locate the guidelines mentioned below perhaps they might contain something useful:_\n\nThanks!  \n [http://www.sfgov2.org/ftp/uploadedfiles/mod/programmatic/NAVH06.pdf](http://web.archive.org/web/20140804050104/http:/www.sfgov2.org/ftp/uploadedfiles/mod/programmatic/NAVH06.pdf \"http://www.sfgov2.org/ftp/uploadedfiles/mod/programmatic/NAVH06.pdf\")\n\nUnfortunately, this contains only hard limits.\n\n"
    },
    {
      "time": "28 May 2013 — 2:27am",
      "content": "Besides character per line, there is usually a recommended limit to line length (for normal reading within arm's length, about 7\") to avoid excessive head turning when eye movement is not enough to encompass the line. Reading should not be as if you're at a tennis match. I guess the same thing would apply to posters and billboards: minimize or eliminate head turning for the normal viewing distance.\n\n"
    },
    {
      "time": "28 May 2013 — 6:19am",
      "content": "[to follow]\n\n"
    },
    {
      "time": "28 May 2013 — 8:23am",
      "content": "\\> to avoid excessive head turning\n\nAnd long line lengths can also be a problem for people who read with a magnifying glass.\n\nI know a couple of elderly folks with eyesight that has deteriorated to the point that even large-print books must be read with a magnifying glass. (They have macular degeneration.)\n\n"
    },
    {
      "time": "29 May 2013 — 6:23am",
      "content": "Duderino,\n\nIt is not my opinion that some large-print editions use the same page size as normal editions; it is my experience—hence, it has been empirically verified in some instances. It is not uncommon that people who require larger type are somewhat old-school, and are used to reading newspaper and multi-column-formatted magazines. Such folks tend to eschew the whiplash encountered when trying to read very wide columns.\n\nSo, you can presume all you want: presumptions can be unwarranted, as well.\n\n"
    },
    {
      "time": "29 May 2013 — 6:43am",
      "content": "\"But thinking about this more, the[re] may be some other power [or] law governing the relation between the font size and line length.\"\n\nThe power of the reader, I think.\n\nThere are two directions and one place. The past was dedicated to the publisher's knowledge of their readers, the future is dedicated to the reader's abilities as granted by their choice of devices. The place is the present. If you are talking in the present about composition ideals of the past, the publishers knew the laws. When you are talking in the present about composition ideals for the future, the laws start with the devices.\n\nAnother way of talking about this, is that the \"font size\" is not the parameter we look at when determining the optimal size-to-length relationship of text type, it's the x-ht.\n\n"
    },
    {
      "time": "29 May 2013 — 10:53am",
      "content": "But is the length of extenders that unimportant?\n\nBTW what kind of linespacing does screen type \"like\"? I mean compared to print.\n\nhhp\n\n"
    },
    {
      "time": "29 May 2013 — 10:50am",
      "content": "Perhaps leading should be measured in angle of vision too.\n\n"
    },
    {
      "time": "29 May 2013 — 6:11pm",
      "content": "\\> _the[re] may be some other power [or] law_\n\nJust in case: power law ≡ `x ↦ xᵗ` (for a fixed value of t). It is equivalent to saying that when x increases by k%, the result will increase by t·k % (for small values of k).\n\n\\> _the \"font size\" is not the parameter we look at when determining the optimal size-to-length relationship of text type, it's the x-ht._\n\nI intentionally used a vague term so that when answering, people have an opportunity to choose whatever measurement they consider relevant to the question. **Update:** actually, what I had in mind in the original post was using the same font, just of different font sizes. (My experience is only with optically scaled fonts; so I would prefer this assumed in the discussion.)\n\nBut your refinement makes a lot of sense: when considering different fonts, which of font measures is better to use in the context of my question?\n\n"
    },
    {
      "time": "29 May 2013 — 6:03pm",
      "content": "\\> _It is not my opinion that some large-print editions use the same page size as normal editions; it is my experience_\n\nDuderabimus, if I need to repeat what I already said, here it is; all you are saying is that the answer may be 0. Since I never said it could not, I do not see how what you say exposes any presumptions in my question.\n\n"
    },
    {
      "time": "30 May 2013 — 1:26am",
      "content": "It certainly is true that in practice when smaller type is used, line lengths in characters tend to be longer.\n\nWhen discussing the \"ideal\" line length, though, generally the discussion is about a book that is optimal in other ways, such as having the ideal type size (possibly around 14 points) and it's an aesthetic characteristic.\n\nWhen a range of widths - 1 1/2 alphabets to 3 1/2 alphabets, for example - is specified, while part of that is due to an \"ideal\" not being well defined, that also includes space for the one to use varying with the type size.\n\n"
    },
    {
      "time": "30 May 2013 — 7:07am",
      "content": "14pt? That's huge. What kind of book are you thinking about?\n\n"
    },
    {
      "time": "30 May 2013 — 11:54am",
      "content": "Calypso could work.\n\n"
    },
    {
      "time": "31 May 2013 — 2:14am",
      "content": "@John Hudson:  \n<cite>14pt? That's huge. What kind of book are you thinking about?</cite>\n\nYou could well be right, and 12 points would be a better value.\n\nThe kind of book I'm thinking of is a self-conscious art book of the sort that William Morris had printed.\n\n"
    }
  ]
}
