{
  "id": "103408",
  "title": "Early Railway Signage",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello,\n\nI'm currently working on a typeface based on what I believe to be late 1800s, early 1900s british railway signage. Below is a sample of the sort of lettering I hope to recreate.\n\n ![](http://web.archive.org/web/20150414213811im_/http:/typophile.com/files/P1090070edit_6226.jpg)\n\nThere are some variations on this theme that I have found so far. I can only assume that some are old version and some more recent?  \nI think this style of lettering may sit somewhere between Figgins san serifs and possible Johnston's Underground lettering.\n\nI was wondering if anyone new any information about this style of lettering that would be of use to my project?\n\nThanks. Jonathan\n\n",
  "author": "JM Type Design",
  "time": "30 May 2013 — 6:15am",
  "uid": "211896",
  "comments": [
    {
      "time": "30 May 2013 — 8:29am",
      "content": "Do you have any reference material from the period you refer to? The image you posted contains restroom icons that have only been in use for the last 50 years or so.\n\n"
    },
    {
      "time": "30 May 2013 — 8:44am",
      "content": "There are foundries that specialize in dorky letters such as those. I'm not sure if it would be an insult or a compliment to mimic or stay away from their precedents.\n\nIn terms of how to make such fonts: just use a grid and \"expanded skeletons\" and do no optical correction whatsoever. That's how you would arrive at a horrible \"A\" like that for example.\n\nhhp\n\n"
    },
    {
      "time": "30 May 2013 — 9:29am",
      "content": "I intend to take the characteristics of these letters and get them working as a display typeface, not directly mimic them. I would certainly take care to optically adjust the letters so that they aren't as clumsy as the examples.\n\nThe image was taken in Moore St station in Birmingham which has apparently been restored back to it's original 1930s appearance - whether the signage is historically accurate I'm not sure but I presume it is.\n\nI have plenty of other samples of this kind of letter and it is all railway signage and as I say from what I can gather at the moment this style of lettering was used around late 1800s / early 1900s - before Johnston and Gill's typefaces.\n\n"
    },
    {
      "time": "30 May 2013 — 9:29am",
      "content": "I intend to take the characteristics of these letters and get them working as a display typeface, not directly mimic them. I would certainly take care to optically adjust the letters so that they aren't as clumsy as the examples.\n\nThe image was taken in Moore St station in Birmingham which has apparently been restored back to it's original 1930s appearance - whether the signage is historically accurate I'm not sure but I presume it is.\n\nI have plenty of other samples of this kind of letter and it is all railway signage and as I say from what I can gather at the moment this style of lettering was used around late 1800s / early 1900s - before Johnston and Gill's typefaces.\n\n"
    },
    {
      "time": "30 May 2013 — 3:11pm",
      "content": "Heres another sample of the lettering - this hasn't been restored. Taken at Tyseley Station, Birmingham\n\n ![](http://web.archive.org/web/20150414213811im_/http:/typophile.com/files/P1090206Edit_5140.jpg)\n\nThe letters are cast in metal painted white and mounted on wooden backboard.\n\n"
    },
    {
      "time": "30 May 2013 — 3:31pm",
      "content": "If I'm reading [its Wikipedia page](http://web.archive.org/web/20150414213811/http:/en.wikipedia.org/wiki/Tyseley_Locomotive_Works) right, that rail museum opened in the late 1960s.\n\n"
    },
    {
      "time": "31 May 2013 — 2:41am",
      "content": "Really as late as that! Not entirely sure when this lettering first started being used for railway signage. I believe it may have been early 1900s. I think it may even have been used for the London Underground prior to the Johnston's lettering.\n\n"
    }
  ]
}
