{
  "id": "103462",
  "title": "Rip-off of one our font (Oblik Bold)",
  "forum": "General Discussions",
  "tags": [
    "bold",
    "font",
    "General Discussions",
    "oblik",
    "off",
    "rip",
    "rip-off"
  ],
  "content": "We found an rip-off of our \"Oblik\" in Bold weight.\n\nAt first it was disturbing to find out something like this, but then I'm now feeling a little empathy for this guy, for the reason he is young (judging by his photo and by his profile description). But this is not the way to build your design career or to go in public without having any responsibility for your acts.\n\nTo not duplicate what we wrote, feel free to check it directly on our website:\n\n[http://www.tourdefonts.com/rip-off-of-oblik-bold/](http://web.archive.org/web/20140118132404/http:/www.tourdefonts.com/rip-off-of-oblik-bold/)\n\nLet this be an lesson, in educational purpose, to all designers who might have doubts to do such things to any existing, available, on the market or off the market, with ownership design of any kind!\n\nCheers,  \nDusan\n\n",
  "author": "tourdeforce",
  "time": "31 May 2013 — 2:21pm",
  "uid": "44424",
  "comments": [
    {
      "time": "31 May 2013 — 2:36pm",
      "content": "He hates Nathalia because she dumped him for cheating on her too... ;-)\n\n1) So is the font no longer available for download?\n\n2) Is your plan simply to \"out\" the violation but take no direct action?\n\nFYI: [http://typesnitch.com/](http://web.archive.org/web/20140118132404/http:/typesnitch.com/ \"http://typesnitch.com/\")\n\nhhp\n\n"
    },
    {
      "time": "31 May 2013 — 2:52pm",
      "content": "1) Behance page for that project is no more available. I will do more research, but might be that his font is uploaded on i.e. Mediafire, Rapidshare... kind of services. But it's not available from Behance any more. I found those images on Pinterest and few other blogs.\n\n2) I couldn't find his direct contact informations, so I had to create account on Behance and to write him message using their contact form. I don't believe he'll answer on that and I have small hopes that I will find his contact (phone, email, address...). I'm still under impression of everything, probably not thinking reasonable at the moment. What could I do at this situation? (I write in first person even designer of \"Oblik\" is my father, but I try to keep all communications).\n\n3) I know about [http://typesnitch.com/](http://web.archive.org/web/20140118132404/http:/typesnitch.com/ \"http://typesnitch.com/\"), we will have to consider it seriously now, cause honestly this is something I would never expect to happened to us. We are very small and not so specially popular nor on market nor in typographic community, but I guess it can happened to anyone.\n\nI just can't get it, what does it takes for somebody to do such thing?\n\nBTW, who is behind TypeSnitch service?\n\n"
    },
    {
      "time": "31 May 2013 — 3:34pm",
      "content": "I think you're handling it fine.\n\n> what does it takes for somebody to do such thing?\n\nLack of sufficient talent/skill + burning desire to be liked.\n\nThe main person behind TypeSnitch is Stuart Sandler.\n\nhhp\n\n"
    }
  ]
}
