{
  "id": "103419",
  "title": "Using information from within a font",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey folks,\n\nIf you'd want to make any sort of educational material about type design, are you allowed to use a font (with a license) in it, and show values from the font, such as the spacing and kerning values? For example, you could set a word, draw lines to show the sidebearings, and write the spacing values from within the font underneath it, to show the distance from the glyph to its sidebearing. Might be a silly question, but I'm considering making a poster, so it seems wise to be sure :)\n\nCheers,  \nJasper de Waard\n\n",
  "author": "1996type",
  "time": "30 May 2013 — 1:14pm",
  "uid": "30114",
  "comments": [
    {
      "time": "30 May 2013 — 3:12pm",
      "content": "Although it's unlikely anyone will care, most licenses disapprove of opening fonts in editors, so you could either just ask for permission or better yet use an open source font, and remove the possibility of an issue.\n\n"
    },
    {
      "time": "30 May 2013 — 3:47pm",
      "content": "I guess it would constitute \"disassembling\", which many EULAs forbid? But yeah, it's such a minor violation that somebody would have to be pretty anal to complain.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2013 — 2:44am",
      "content": "I don't feel there is anything illegal about reading sidebearing values out of a font. It's not that different than gathering individual character widths (a prerequisite for formatting text) or kerning values. Think, for example, of an automatic Optical Margin Alignment feature.\n\nThat said: Jasper, are you working with InDesign? It's possible to write a script that converts type to outlines (\\*) and does these measurements; no need to delve into the actual font file.\n\n(\\*) And yes, I am aware that 'converting to outlines' is forbidden by some EULAs as well.\n\n"
    },
    {
      "time": "31 May 2013 — 2:57am",
      "content": "Why not use your own fonts?\n\n"
    },
    {
      "time": "31 May 2013 — 11:44am",
      "content": "Thanks guys! Shouldn't really problem I guess :)\n\n@Karl: I actually started the poster and I am using my own font, alongside another font, because my own simply doesn't do the job. First functionality, then aesthetics, then personal preference.\n\n"
    },
    {
      "time": "31 May 2013 — 7:52pm",
      "content": "Jasper,\n\nI would have no problem with what you suggest with any of my fonts. Plus, if it's really for educational purposes, I would have no problem providing you with a reasonable number of fonts free of charge.\n\n"
    }
  ]
}
