{
  "id": "10347",
  "title": "Im a student, its a logo for bottle water",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "so whatdyou think......on a technical basis ![logo water](http://web.archive.org/web/20131020055748im_/http:/www.typophile.com/forums/messages/29/69889.jpg)\n\n",
  "author": "jarvis",
  "time": "15 Apr 2005 — 2:21pm",
  "uid": "2873",
  "comments": [
    {
      "time": "15 Apr 2005 — 4:23pm",
      "content": "It would be best to repost in a smaller size. Add a few detail close-up shots since you want a technical critique.   \nFrom what I can see, there is a few problems that you need to deal with. I can tell you designed this by connecting regtangles and circles, instead of drawing the forms in bezier. You have some inconsistencies where you knocked out and intercepted forms. If you are using a vector program (which is by far the best way to do this) view it in outline and make adjustments.   \nYou can do the knock-out and connecting objects process you are familiar with as a base and then rework the files on a top layer to make it easier. Let me know if you understand what i am talking about.\n\n"
    },
    {
      "time": "16 Apr 2005 — 12:07am",
      "content": "_( Just an additional note.: Maybe you could post an RGB version of your artwork, because CMYK images tend to become 'invisible' to various viewers of Typophile.. )_\n\n"
    },
    {
      "time": "16 Apr 2005 — 5:29am",
      "content": "And on Dav's note make sure your posting is either a jpg (raster) or gif (vector)\n\n"
    },
    {
      "time": "19 Apr 2005 — 6:22am",
      "content": "On the logo the transition from the curve to the straight in the open counter of the h is a bit sudden, and the halo and horns need some work to give them the same prominence. The halo is the only item which is angled, which needn't be a problem, but you need to sort out the weight. The umlaut vertical positioning is also something that needs attention.   \nTim\n\n"
    },
    {
      "time": "20 Apr 2005 — 6:19am",
      "content": "gif... a vector?\n\n"
    },
    {
      "time": "20 Apr 2005 — 7:03am",
      "content": "Well, Gabriel, .gif is not a vector file format, of course, but, .gif files should be significantly better if you want to show simple shapes and vector images, and .jpg should be better for multicolored and photographic images, on the web.. _( Well.. This shall only be for web / screen related files, not for print, then.. )_\n\n"
    },
    {
      "time": "20 Apr 2005 — 12:32pm",
      "content": "For convenience's sake:   \n   \n ![holi small](http://web.archive.org/web/20131020055748im_/http:/www.typophile.com/forums/messages/29/70302.gif)\n\n"
    },
    {
      "time": "21 Apr 2005 — 2:39pm",
      "content": "adult novelty shop...\n\n"
    },
    {
      "time": "22 Apr 2005 — 7:16am",
      "content": "Dav: Oh, ok, I get what you mean now.   \n   \nBut what about a rainbow-gradient-filled, multi-colored, irregular-shaped vector?   \n;)   \n   \nIn any case, is \\*that\\* the logo for the water? I can't see the first image. If it is, it says anything but \\*water\\* to me.\n\n"
    }
  ]
}
