{
  "id": "103486",
  "title": "Geometric Sans for display",
  "forum": "Sans Serif",
  "tags": [
    "bold",
    "font",
    "geometric",
    "sans serf",
    "Sans Serif",
    "typedesign"
  ],
  "content": "Hello all,\n\nFirst of all I want a thank to the people in this forum for the support and knowledge given, although this is my first post I've been consulting the site on a regular basis and has been always a great help.\n\nI was trying to create a typeface of my own based on early geometric fonts like Kabel or Futura with a contemporary look to work as a display typeface with alternate glyphs and features for titling, but the project has become a monster itself and I'm getting stuck in the way and I'm a bit desperate for a second opinion.\n\nOpen type programming and kerning have become a pain and I am aware of some inconsistency across some glyphs and symbols, curves are far from perfect and the are more problems for sure.. so I feel it may need a close analysis from someone outside to get to the critical points and have a real feel about the project.\n\nI have attached a PDF with the basic chart, alternate caps, small caps and diacritics. Please ask for more if you think you need closer details or anything that could help.\n\nThanks in advance,  \nRafa\n\n| Attachment | Size |\n| --- | --- |\n| [Sifonn\\_typophile.pdf](http://web.archive.org/web/20150424030525/http:/typophile.com/files/Sifonn_typophile.pdf) | 31.22 KB |\n\n",
  "author": "rafagoicoechea",
  "time": "2 Jun 2013 — 6:47am",
  "uid": "211961",
  "comments": [
    {
      "time": "3 Jun 2013 — 8:20am",
      "content": "Hello Rafa,\n\nI found myself in this very same situation as I think a lot of people taking on a typeface for the first time found themselves.\n\nI'm by no means an expert in typeface design but I have tackled a few typeface projects already!\n\nCheck my work here if you like: [http://www.behance.net/jonathanmartin](http://web.archive.org/web/20150424030525/http:/www.behance.net/jonathanmartin \"http://www.behance.net/jonathanmartin\")\n\nFirstly I would recommend getting the book 'Designing Type' by Karen Cheng. This book is recommended by many professional typeface designers and it's a really excellent reference book - well worth the £20!\n\nI really like your design to begin with, some really interesting forms coming through! I started with a geometric for my first typeface design (Fassade) but the lowercase is the really challenge as I'm sure you may have already found.\n\nI think you need to be made aware of 'optical balancing' in typefaces. Although geometric typefaces give the impression all the strokes are the same weight this is not actually the case, certainly not in Futura's case.  \nSo all the strokes will need adjusting slightly: the horizontal strokes are slightly thinner than the vertical strokes. If you where to look at futura close up and analyse the strokes you will see that their is a slight stroke weight variation. This stroke contrast becomes even greater in the bolder weights.  \n(this is carefully examined and explained in 'Designing Type' book.)\n\nSecondly the other thing that needs attention is with the lowercase letters that contain a curved stroke meeting a straight stroke b, d, p, q for example. In Futura these are not just a circle bolted onto a straight stroke. As you will see if you were to closely examine Futura's b, p, q etc. the curved stroke tappers into the straight stroke. This is to reducing the visual weight at the joint. Remember that typefaces are not mathematical structures (even geometrics) they have to prove themselves to the eye and rarely does this happen if they are made to strict mathematical shapes and grids. - Paul Renner's understanding of optics is what makes Futura such a brilliant design\n\nI strongly recommend that you get a hold of a copy of 'Designing Type', as it explains these details in typefaces much better than I ever could on this forum.\n\nYour design looks good at the moment it just requires some slight adjustments. I hope this has been useful.\n\nJonathan\n\n"
    },
    {
      "time": "5 Jun 2013 — 2:07am",
      "content": "@JM Type Design\n\nHi Jonathan,\n\nThanks for the reply! I am already familiar with your work on behance and your types, I have to say Fassade project is really close to my approach, but maybe mine is a bit more radical in embracing geometry and the alternative forms are a bit more experimental.\n\nI am also familiar with the optical balance made on Futura and other geometric types, and already got the Karen Cheng's book! A very helpful manual on typedesign on my opinion as well. The point is that I was trying to make those adjustments not so obvious to get a more radical look, as the font is intended to work as a display typeface I was trying to avoid the tapering of the stroke more subtle. For a bold font like this maybe those joints need more attention and I will need to taper them a bit more to reduce some weight.\n\nIf you think you can get into more detailed issues in the font or into concrete glyphs problems feel free to say whatever you think, it will sure be useful for me as I was looking for a second pair of eyes or more. ;)\n\n"
    },
    {
      "time": "5 Jun 2013 — 11:24am",
      "content": "This typeface really seems to combine the features of many typeface released at around the same time as Futura. Erbar Grotesk, Elegant Grotesk, Kabel, and the lowered waist on the R reminds me of architectural lettering like Neutraface.\n\nI think it might be a case of just getting the consistency right. There a lot of ideas going on at once, maybe try and refine these forms abit. For example see what happens if you lower the waists on the E, F, A etc like you have done with the R? On the other hand the features you all ready have will give each letter a unique voice, especially at display sizes.\n\nIt's a very careful balancing act. I think you defiantly need to find more of a balance so it becomes more of a functional tool and not just an experimental display face. I really like the E, the M, the Q has a really nice tail I think the only glyph that doesn't quite work is the C.\n\nJust keep plugging away looks great so far!\n\n"
    },
    {
      "time": "6 Jun 2013 — 1:44am",
      "content": "Hi Jon,\n\nI've been thinking these days on doing just the opposite with the R glyph, and maybe rise their waist a bit to see if matches other glyphs like E, F, G and H...\n\nKnow the horizontal strokes of A, P and R have almost the same distance from the baseline and i think it could allow the trick so i can leave A, E, F like they are right now, and have their waist lowered only for the alternate caps which are also more expanded as you can see on the PDF.\n\nAnother major issue you could be right is about the C... I liked the look it gives to the font but perhaps it is just too much, maybe I can have this as an alternative form by using stylistic sets or having this on the alternate caps, and make the font a more functional tool as you say.\n\nI'm afraid these are busy days for me but I'll try to make those adjustments and upload the results asap.\n\nMany thanks for your help!\n\n"
    }
  ]
}
