{
  "id": "103499",
  "title": "Trying to identify a font from a logo fragment",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20131015124459im_/http:/typophile.com/files/Marras-Illumination-Logo_3412.jpg)\n\nThis isn't much to go on, but I'm trying to find out which font was used for the 'M' in this horrible logotype. Apologies!\n\n",
  "author": "Daniel Couper",
  "time": "3 Jun 2013 — 1:16am",
  "uid": "45886",
  "comments": [
    {
      "time": "3 Jun 2013 — 3:26pm",
      "content": "Two separate fonts. Note sharp join of the serif on the lhs, found in relatively few fonts, vs. the smooth join on rhs which is found on many. The thick lhs stroke for M may help to narrow the selection, assuming it was not added by the logo designer. However, without some more letters a single matching font is problematic. The white space effect in the lhs is sometimes called \"handtooled\" or \"open face.\" It may have been in the original font or added by the logo designer. You could try to Google \"fonts handtooled\" and \"fonts open face\" and see if you like any of the matches. Also check the collection at the [Fontscape typeface directory of openface serif typefaces](http://web.archive.org/web/20131015124459/http:/www.fontscape.com/explore?7RK). None match but it does give an idea of the possible effects for other letters.  \nPerhaps someone else recognizes lhs M as from a font?  \nDon\n\n"
    },
    {
      "time": "3 Jun 2013 — 3:41pm",
      "content": "the drop shadow inside the rhs makes me think the designer gave it a zero fill and applied a stroke, then the shadow effect.\n\n"
    },
    {
      "time": "4 Jun 2013 — 5:53am",
      "content": "Ach, I thought this might be the answer. Just trying to save myself a bit of work + have a font I can reuse in a stylesheet. Thank you very much for the advice; it looks horrible anyway, so I think I'll go and dig out something similar yet pleasant. Cheers\n\n"
    }
  ]
}
