{
  "id": "103555",
  "title": "Wordmark Help/Suggestions",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "help",
    "logo",
    "Logos / Corporate ID Design",
    "Wordmark"
  ],
  "content": "I'm working on a wordmark for a consulting firm that mostly does business with the government. Currently it's just ff Olsen with some minor alterations (rounded Corners, shortened ascender and took in the serifs a bit).\n\nLet me know what you think. Is it too plain? awkward looking etc... I think I'm losing the forest for the trees on this one and need some feedback.\n\nThanks\n\n ![](http://web.archive.org/web/20150426231543im_/http:/typophile.com/files/ci-logo_4741.png)\n\n",
  "author": "voiceof",
  "time": "4 Jun 2013 — 9:54am",
  "uid": "4114",
  "comments": [
    {
      "time": "4 Jun 2013 — 10:02am",
      "content": "What's the logic behind rounding some corners?\n\nhhp\n\n"
    },
    {
      "time": "4 Jun 2013 — 10:25am",
      "content": "Honestly, there was not much thought behind it. I just felt like I needed to do something to make it more ownable. I liked the font \"out of the box\" but it's pretty distinctive and I thought I might need to do something to differentiate it.\n\n"
    },
    {
      "time": "4 Jun 2013 — 10:27am",
      "content": "Wanting to differentiate is good, but the direction you go should come from need. Does some-rounded-corners mesh with what the client is/wants?\n\nhhp\n\n"
    },
    {
      "time": "15 Jul 2013 — 6:32pm",
      "content": "(img removed per client request)\n\nHrant, Thanks for all your comments.\n\nI was pulled away from this job for a bit. I had time to look it over yesterday and made a couple of changes and would like to get your thoughts.\n\nI'm wondering if that space between the 'e' and 'y' is distracting.\n\n"
    },
    {
      "time": "10 Jun 2013 — 5:41pm",
      "content": "Again, don't know much about the nature of the client, but:  \nIf you're chopping off a half-serif from the \"el\" (which I like BTW) you might pull that off with the \"y\" too. I would also consider making everything (or maybe almost everything) flat - I'm thinking top/bottom of the \"C\", bottom of the \"e\", and/or bottom of the \"y\" (which might convey an air of stability befitting a government contractor).\n\nhhp\n\n"
    },
    {
      "time": "10 Jun 2013 — 8:33pm",
      "content": "Thanks again for your feedback. I'll try out a some of your thoughts and see where they go.\n\nAs for the nature of the client; as a government contractor they really cover a broad spectrum of services, everything from elearning, web development, workforce development, training, performance consulting, etc...  \nso the look has to be flexible enough to work in a variety of environments.\n\n"
    },
    {
      "time": "15 Jul 2013 — 6:32pm",
      "content": "(img removed per client request)\n\nThis is a quick sketch trying a bucket 'y', just wanted to get some opinions on it.\n\nthanks.\n\n"
    },
    {
      "time": "12 Jun 2013 — 11:45pm",
      "content": "This is too cute, it has some sort of baby giraffe feel to it. I'd revert to the previous version of 'y'.\n\nThere's absolutely no need to get all serifs consistent across the words. It is not a wall of text, it's just a set of specific glyphs and while it's nice to have some consistency between them it is certainly not a requirement, nor even a priority. I think the version from 2:38 pm is really good, it matches your brief well, so I wouldn't over-think things and simply go with it. It is indeed very good.\n\n"
    },
    {
      "time": "23 Jun 2013 — 7:32am",
      "content": "I prefer the first version. All that red feels garish, and I like the stability of the even-footed {l}. The font looks friendly but professional. And as a linguistics nerd, I find macrons attractive. :)\n\n"
    }
  ]
}
