{
  "id": "103575",
  "title": "?Birkenstocks Online",
  "forum": "Home",
  "tags": [

  ],
  "content": "﻿eaded old scoundrel: and his son who struck a poor cler — We will, I say, Caroline — we — ” The wretch was suiting actions to his words, and rose once more, advancing towards his hostess, who shrank back, laughing half-hysterically, and retreating as the other neared her. Behind her was that cupboard which had contained her poor little treasure and other stores, and appended to the lock of which her keys were still hanging. As the brute approached her, she flung back the cupboard-door smartly upon him. The keys struck him on the head; and bleeding, and with a curse and a cry, he fell back on his chair. In the cupboard was that bottle which she had received from America not long since; and about which she had talked with Goodenough on that very day. It had been used twice or thrice by his direction, by hospital surgeons, and under her eye. She suddenly seized this bottle. As the ruffian before her uttered his imprecations of wrath, she poured out a quantity of the contents of the bottle on her handkerchief. [**Birkenstock Shoes**](http://web.archive.org/web/20130612014339/http:/www.birkenstockshoessale.net/)  \nShe said, “Oh! Mr. Hunt, have I hurt you? I didn’t mean it. But you shouldn’t — you shouldn’t frighten a lonely woman so! Here, let me bathe you! Smell this! It will — it will do you — good — it will — it will, indeed.” The handkerchief was over his face. Bewildered by drink before, the fumes of the liquor which he was absorbing served almost instantly to overcome him. [**Birkenstocks Online**](http://web.archive.org/web/20130612014339/http:/www.birkenstockshoessale.net/mens-birkenstock-riva-c-21.html)  \nHe struggled for a moment or two. [**Cheap Birkenstocks**](http://web.archive.org/web/20130612014339/http:/www.birkenstockshoessale.net/unisex-birkenstock-florida-c-8.html)  \n “Stop — stop! you’ll be better in a moment,” she whispered. “Oh, yes! better, quite better!” She squeezed more of the liquor from the bottle on to the handkerchief. In a minute Hunt was quite inanimate. Then the little pale woman leant over him, and took the pocket-book out of his pocket, and from it the bill which bore Philip’s name. As Hunt lay in stupor before her, she now squeezed more of the liquor over his head; and then thrust the bill into the fire, and saw it burn to ashes. Then she put back the pocke\n\n",
  "author": "liqing123795",
  "time": "4 Jun 2013 — 7:18pm",
  "uid": "211921",
  "comments": [

  ]
}
