{
  "id": "103609",
  "title": "Diacritic Nationalism",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "You're probably going to steal my idea on this, but:\n\nWhat language/culture is most associated with which diacritic? Obvious ones:  \nPolish = ogonek  \nSpanish = tilde\n\nThe rest?\n\nhhp\n\n",
  "author": "hrant",
  "time": "5 Jun 2013 — 3:26pm",
  "uid": "1250",
  "comments": [
    {
      "time": "5 Jun 2013 — 3:49pm",
      "content": "Most associated by whom? Those of us whose language and culture doesn't use diacritics?\n\nThere are some diacritic marks that are pretty much exclusively used for a single language, so this would be a strong association: hook = Vietnamese\n\n"
    },
    {
      "time": "5 Jun 2013 — 5:58pm",
      "content": "> Most associated by whom?\n\nGood question.  \nI would say -to avoid explosion- two kinds of people: non-native type designers; and native readers.\n\nSo for example the former group might associate the ogonek with Polish because it's the hardest extra to make for that language, but maybe for Poles the stroke is more culturally significant?\n\nMore:  \nHungarian = double acute  \n? = ring\n\nhhp\n\n"
    },
    {
      "time": "5 Jun 2013 — 6:59pm",
      "content": "I associate ë and ï with French (which I learned at school) and ü with German (which I didn’t, but nonetheless occasionally encountered)—associations which date back to before I made fonts.\n\nThat seems straightforward, as ë and ï are quite common in French, and used in loan words to English such as Noël and naïve (and Citroën), whereas ü is rare in French, but common in German, and especially so in loan words to English such as führer (and Mötley Crüe).\n\n"
    },
    {
      "time": "5 Jun 2013 — 7:15pm",
      "content": "Hoping/intending to separate the diacritics from base letters, I would say that to me the circumflex is most strongly French, while the umlaut (diaeresis) is most strongly German. But that might have to do with an ignorance of smaller European languages during my youth. BTW I remember Asterix's \"La Grande Traversée\" where they ran into Danes, who were basically speaking French but with O/o replaced by Ø/ø! Even their dog -a Great Dane, duh- barked \"Wøøøf\". :-)\n\nI guess we'd need to do a large-scale survey (perhaps in the form of a game).\n\nhhp\n\n"
    },
    {
      "time": "6 Jun 2013 — 2:21am",
      "content": "Ah, yes. Ø for Danish, and å for Swedish. And then there's ß for German, ĕ for Latvian, Þ for Icelandic.... (I was going to recount the ones you listed, but Hungarian double acutes aren't working...)\n\n"
    },
    {
      "time": "6 Jun 2013 — 3:06am",
      "content": "A-ring is definitely the right one for Swedish, in fact it's been used as a shorthand for the language in Finland for decades, mostly in the (fairly awful) campiagn against compulsory Swedish language education in schools.\n\n![](http://web.archive.org/web/20130816134345im_/http:/upload.wikimedia.org/wikipedia/commons/thumb/8/84/Pois_pakkoruotsi.svg/500px-Pois_pakkoruotsi.svg.png)\n\n(Quadibloc: Őő Űű?)\n\n"
    },
    {
      "time": "6 Jun 2013 — 4:55am",
      "content": "> I remember Asterix's \"La Grande Traversée\" where they ran into Danes, who were basically speaking French but with O/o replaced by Ø/ø!\n\nNo better way to mimick 'foreign' speach than adding diacritics to fairly random strings (usually they lead to nonsense utterances :)\n\nThe caron (haček) appears to me tied to \"Czech\", even though it appears in lots of other languages, such as Esperanto.  \nAnd then there is the old pseudo-ЯussiДИ.\n\n"
    },
    {
      "time": "6 Jun 2013 — 8:39am",
      "content": "> And then there is the old pseudo-ЯussiДИ.\n\nYou bet… Although it does not seem to belong in this discussion.\n\nHere is my chain of associations.\n\n**é** French  \n**ł** Polish  \n**ð** Icelandic  \n**l·l** Catalan  \n**ґ** Ukrainian  \n**ў** Belarusian  \n**љ** Serbian\n\nNot very notable by itself, the _[kratka](http://web.archive.org/web/20130816134345/http:/fonts.ru/help/term/terms.asp?code=591)_ (‘Cyrillic breve’) is certainly very Russian, although it is used in Belarusian too. The most distinctive Russian letter is probably the **ж** (it is not unique to Russian language either), and the **[ё](http://web.archive.org/web/20130816134345/http:/en.wikipedia.org/wiki/%D0%81#Russian)** (pronounced _yo_) is easily [the most controversial](http://web.archive.org/web/20130816134345/http:/img-fotki.yandex.ru/get/3206/olga-sytina.e/0_20015_5c673440_L.jpg).\n\n"
    },
    {
      "time": "6 Jun 2013 — 1:42pm",
      "content": "If we're limiting ourselves to diacritics, the macron makes me think of modern representations of Classical Latin and Greek or in romanizations of languages like Japanese, and only then Latvian. Similarly, the breve makes me think first of the McCune-Reischauer romanization of Korean rather than Romanian or Vietnamese. So often I associate diacritics with cases where they would not have been used in the native orthography (Classical Latin originally would not have used macrons or breves).\n\nEven within a single language, diacritic use can be associated with particular variants, as in the issue of polytonic vs monotonic orthography in Greek. The former is associated with Katharevousa and the latter with Dimotiki, though not exclusively.\n\nFor me, diacritics are too small a unit to be associated with particular languages. Once you have a base letter, you can go further. Others here have associated the ring with Swedish based on å (though that would also work for Norwegian or Danish), but once you put the ring on a u to get ů, it screams Czech. Even without diacritics, digraphs and trigraphs and n-grams of increasing lengths are much more closely associated with particular languages. For example, wh is English, gy is Hungarian, tsch is German, and so forth.\n\n"
    },
    {
      "time": "6 Jun 2013 — 2:05pm",
      "content": "For some bizarre reason, an o-double acute seemed to be translated into o-tilde when I was typing it in. Maybe if I had posted it, it would have displayed correctly.\n\nAs for Swedish-language education being compulsory in Finland, I can see that many people would campaign against devoting a significant fraction of the school year to learning a language of purely local interest. In Continental Europe, of course, second language learning does loom large; but I would have thought that if another language besides English were taught, the next choice would be French or German.\n\nLearning a language is an enormous investment in time and effort, so I see no reason to apologize for the fact that such choices will be made on the basis of raw economic and political power rather than other criteria.\n\n"
    },
    {
      "time": "6 Jun 2013 — 2:12pm",
      "content": "Schönes Thema, a german would say. Turkish for example loves the dots or dotted ones as much as German does: Ö,Ü and İ. G-breve (too) may be associated with Turkish, I guess: \"Ğ.\" And she loves actually cedilla as well: \"Ş/Ç\". Hmm... hard to predict an association, but the \"İ\" wins (at least for Turkic languages.)\n\n"
    },
    {
      "time": "6 Jun 2013 — 2:51pm",
      "content": "I don't want to get too much into the politics of Swedish-language education in Finland, but do note that Swedish is co-official with Finnish in Finland and there is a minority in Finland for whom Swedish is the mother tongue. The poem that became the national anthem was originally composed in Swedish. So it's a bit as if all Canadians were forced to learn French (if we leave aside the fact that French is spoken outside of North America as well).\n\n"
    },
    {
      "time": "6 Jun 2013 — 7:20pm",
      "content": "I have heard, but have no direct experience, that the Gaelic languages use dots over many glyphs - or was that under?\n\n"
    },
    {
      "time": "7 Jun 2013 — 10:47am",
      "content": "For Japanese, the voiced consonant mark ゛ perhaps?\n\n(Or the the semi-voiced mark, ゜, although that's easily confused with a ring or degree when out of context.)\n\n"
    },
    {
      "time": "8 Jun 2013 — 5:47pm",
      "content": "none at all = English\n\n"
    },
    {
      "time": "8 Jun 2013 — 2:46pm",
      "content": "> none at all = Engish\n\nSwahili, anyone?\n\n"
    },
    {
      "time": "8 Jun 2013 — 3:05pm",
      "content": "_À propos de_ ș ỹ ṃ ƀ ổ ḻ ẻ ṧ _diacritiques_ : ![](http://web.archive.org/web/20130816134345im_/http:/upload.wikimedia.org/wikipedia/en/thumb/3/3c/H%C3%A4agen-Dazs_Logo.svg/500px-H%C3%A4agen-Dazs_Logo.svg.png)\n\n"
    },
    {
      "time": "9 Jun 2013 — 9:27pm",
      "content": "none = English, Indonesian, Filipino  \nà = Italian  \nè = French  \nñ = Spanish  \nã = Portuguese  \nü = German  \nő = Hungarian  \nł = Polish  \nå = Swedish  \nø = Norwegian  \nä = Finnish  \nș = Romanian  \nı = Turkish  \ną = Lithuanian  \nŀl = Catalan  \nĳ = Dutch  \nž = Croatian  \næ = Danish  \ns̆ = Serbian  \nć = Bosnian  \nř = Czech  \nľ = Slovak  \nơ = Vietnamese  \nģ = Latvian  \nž = Slovenian  \nð = Icelandic  \nẹ = Yoruba  \ní = Welsh  \në = Albanian  \nó = Irish  \nḟ = Gaelic  \nĥ = Esperanto  \nā = Latin  \nǝ = Azeri\n\n"
    },
    {
      "time": "9 Jun 2013 — 3:17am",
      "content": "_So it's a bit as if all Canadians were forced to learn French_\n\nI believe it's still compulsory in school, even out here in western Canada where you pretty much never hear French spoken. But the teaching is mostly rubbish, and I know very few Anglophone Canadians who remember much of the French they were forced to take in school.\n\n"
    }
  ]
}
