{
  "id": "103643",
  "title": "how to replace an 'a' in a font?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "i'm really liking the ROBOTO font but have never liked the 'a' that many fonts use.  \ni would like to replace this 'a' with an a that has a single circle and a near verticle line on the right hand side.\n\n1) how can i find fonts with that type of 'a'  \n2) what program would i need? is there a free version?  \n3) how can i ensure that this 'new a' will look in-line with the other letters in the ROBOTO font?\n\nOR, maybe there is another way since i'm totally new to messing around with fonts.\n\nthanks for any and all suggestions :)\n\n",
  "author": "liquidmonkey",
  "time": "6 Jun 2013 — 2:40pm",
  "uid": "212075",
  "comments": [
    {
      "time": "7 Jun 2013 — 3:31pm",
      "content": "Well, for a one-tierd a, you can look at pieces of d and q... A little cutting & tugging...\n\n"
    },
    {
      "time": "7 Jun 2013 — 3:44am",
      "content": "In educational publishing (that I am familiar with) that style of lc /a is often referred to as an 'infant' or 'ball and stick' a. It is often used in texts for children as it falls in line with the requirements of educational institutions or bodies, though I am not aware of any specific standards that require it. The best argument I have heard for using it (as a straightforward replacement) is that it looks more familiar to children who have been learning to write, e.g.,\n\n[http://www.handwritingforkids.com/handwrite/manuscript/animation/lowerca...](http://web.archive.org/web/20140719235950/http:/www.handwritingforkids.com/handwrite/manuscript/animation/lowercase.htm \"http://www.handwritingforkids.com/handwrite/manuscript/animation/lowercase.htm\")\n\nThat said, my son has no problem with the more traditional /a (and /g) which is used (with greater frequency) in his favourite story books.\n\nIf you want to seek out other examples, searching for infant and ball and stick might help.\n\n"
    },
    {
      "time": "7 Jun 2013 — 8:51am",
      "content": "I suppose that Avant Garde and Futura are the most (in)famous fonts with that 'a'. SIL Andika's 'a' has a similar, though not identical, shape; it being closer to handwriting.\n\nAs for a font editor on a small-beer-budget; if you are on a Windows computer, you might want to look at Type 3.2 light, a free-beer version of CR8's commercial program.\n\n"
    },
    {
      "time": "7 Jun 2013 — 3:31pm",
      "content": "Come on guys, most italic fonts use the one-tierd a -- especially the traditional ones.\n\n"
    },
    {
      "time": "7 Jun 2013 — 1:45pm",
      "content": "Quite a few typefaces have “infant” /a and /g as a Stylistic Set option.\n\n"
    },
    {
      "time": "8 Jun 2013 — 8:23am",
      "content": "Making a mono \"a\" is one of the simpler things you can do in type design, so it's probably worth doing on your own. The problem is AFAIK free font editing software isn't too reliable.\n\nAre you committed to Roboto?\n\nBTW you should know that a mono \"a\" isn't good for extended reading.\n\nhhp\n\n"
    },
    {
      "time": "10 Jun 2013 — 9:57am",
      "content": "\"The best argument I have heard for using it (as a straightforward replacement) is that it looks more familiar to children who have been learning to write\"\n\nYes, that's the best argument (such as it is). But as children who have been learning to write generally already know how to read, and have been exposed to both forms of the \"a\" the argument does not make much sense, except in the limited case that the typeface is intended as a model for writing.\n\nThere are plenty of reasons to believe that the two story \"a\" is usually preferable for legibility, and what little research has been done says that beginning readers prefer it anyway (Sue Walker did a study on the question).\n\n"
    },
    {
      "time": "10 Jun 2013 — 10:57am",
      "content": "<cite>There are plenty of reasons to believe that the two story \"a\" is usually preferable for legibility</cite>\n\nHas anyone told the Greeks?\n\n"
    },
    {
      "time": "10 Jun 2013 — 11:19am",
      "content": "You should see what I tell Americans!  \n [http://typophile.com/files/papazian.pdf](http://web.archive.org/web/20140719235950/http:/typophile.com/files/papazian.pdf \"http://typophile.com/files/papazian.pdf\") (Minus the illustrations though.)\n\nhhp\n\n"
    },
    {
      "time": "10 Jun 2013 — 2:22pm",
      "content": "\\>Has anyone told the Greeks?\n\nI think the alpha is a different story. In Greek there's no danger of confusing it with /d/, /g/ or /q/.\n\n\\>what little research has been done says that beginning readers prefer it anyway (Sue Walker did a study on the question).\n\nI don't remember Sue Walker's research reaching that conclusion. As I understand, she found that letterspacing and linespacing had a significant impact on children's reading performance, but the single- versus double-storey /a/ and /g/ didn't make a difference. The children understood from an early stage that we use different forms in reading (typefaces) and writing.\n\n[Here](http://web.archive.org/web/20140719235950/http:/www.kidstype.org/?q=node/44)'s a link to Walker's findings.\n\n"
    },
    {
      "time": "10 Jun 2013 — 4:57pm",
      "content": "> In Greek there's no danger of confusing it with /d/, /g/ or /q/.\n\nNor in Latin based languages.\n\n(BTW, the Greeks still have nu & upsilon and phi & psi to contend with...)\n\n"
    },
    {
      "time": "10 Jun 2013 — 5:25pm",
      "content": "> Nor in Latin based languages.\n\nBalderdash. Immersive reading isn't about taking seconds to consciously decipher individual letters; it's about taking a fraction of a second subconsciously deciphering multiple boumas, more than half of them blurry. This is why for example all-caps is harder to read.\n\nEvery writing system has problems (and ways to subtly minimize/avoid them).\n\nhhp\n\n"
    },
    {
      "time": "11 Jun 2013 — 10:35am",
      "content": "Agreed with Bendy on the alpha.\n\nBendy, Walker’s research found no difference in reading performance for schoolbook/infant vs traditional forms. It did find a difference in preference, where 10 children preferred the traditional forms, vs 6 preferring schoolbook/infant forms (and 8 having no preference).\n\nThe previous linked page just mentions a couple of Walker’s findings; the research is presented in full in: Sue Walker and Linda Reynolds (2002/3) “Serifs, sans serifs and infant characters in children's reading books,” Information Design Journal 11, 2/3, pp. 106-122\n\nAlso, it is written up pretty well in her book, which is available as a free PDF here: [http://www.kidstype.org/?q=webfm\\_send/4](http://web.archive.org/web/20140719235950/http:/www.kidstype.org/?q=webfm_send/4 \"http://www.kidstype.org/?q=webfm\\_send/4\")\n\n"
    },
    {
      "time": "11 Jun 2013 — 3:33pm",
      "content": "Thanks for expanding on that, Thomas, I hadn't noted that point.\n\n"
    },
    {
      "time": "4 Jul 2013 — 8:36am",
      "content": "The 'a' that looks like a circle and a stick can be found in the standard circle and stick fonts. For instance the ZMethod for Zaner-Bloser worksheets at  \n [http://www.SchoolFonts.com](http://web.archive.org/web/20140719235950/http:/www.schoolfonts.com/ \"http://www.SchoolFonts.com\")\n\nYou can also find it in Normographe at  \n [http://www.Fontmenu.com/site/\\_Normographe.html](http://web.archive.org/web/20140719235950/http:/www.fontmenu.com/site/_Normographe.html \"http://www.Fontmenu.com/site/\\_Normographe.html\")\n\nHope this helps.\n\nMichel Bujardet  \nType Designer\n\n"
    },
    {
      "time": "6 Jul 2013 — 6:36pm",
      "content": "hrant,\n\nI guess it's usually more easily confused with /o/ (and if allowing Turkish, /cı/). Aren't their boumas more similar?\n\n"
    },
    {
      "time": "6 Jul 2013 — 7:54pm",
      "content": "The way I would put it is that a mono \"a\" often contributes a good deal of unnecessary ambiguity to boumas it's in largely because it looks close[r] to the \"o\" (which is notably also a vowel). This sort of logic is also why I like making my \"o\" slightly \"too\" wide.\n\nhhp\n\n"
    },
    {
      "time": "7 Jul 2013 — 6:17am",
      "content": "liquidmonkey\\>1) how can i find fonts with that type of 'a'\n\na. Search Myfonts.com, e.g. for \"geometric sans\"  \nb. type the letter \"a\" in the sample string  \nc. scroll until you see as many a's as you need.\n\nliquidmonkey\\>2) what program would i need? is there a free version?\n\nThere are several. Being \"new\" to this must mean you have plenty of other, simple, great search opportunities.\n\n"
    },
    {
      "time": "7 Jul 2013 — 8:04am",
      "content": "> 2) what program would i need? is there a free version?\n\n[**FontForge**](http://web.archive.org/web/20140719235950/http:/fontforge.github.io/en-US/downloads/). It is free. For the license, see [http://www.fontforge.org](http://web.archive.org/web/20140719235950/http:/www.fontforge.org/ \"http://www.fontforge.org\").\n\n> 3) how can i ensure that this 'new a' will look in-line with the other letters in the ROBOTO font?\n\nJust copy the small letter alpha from Roboto itself and paste it where the small letter a is. Some would argue it is not really a small letter alpha, anyway. You can do that with all the Roboto fonts from thin to black, condensed or not. If you are not too fancy, there is not much else to do (but the aogonek will come out quite wrong).\n\n"
    },
    {
      "time": "10 Jul 2013 — 10:45pm",
      "content": "For consistency one may desire the single-story /a/ should be without the small curve at the bottom-right corner. However, the curve may actually benefit the readability, because it makes the /a/ looks a lot more different from /d/, /o/ and /q/.\n\n"
    },
    {
      "time": "11 Jul 2013 — 10:46am",
      "content": "The problem is more acute with a fat sans\n\n![](http://web.archive.org/web/20140719235950im_/http:/typophile.com/files/daq20130711_4310.png)  \ngrabbed from [http://www.myfonts.com/fonts/urw/antique-olive/](http://web.archive.org/web/20140719235950/http:/www.myfonts.com/fonts/urw/antique-olive/ \"http://www.myfonts.com/fonts/urw/antique-olive/\") (There is a single story \"a\" in Kaiti, a serif, with that little ''thing'' at the right bottom of the glyph: [http://www.typophile.com/node/59688#comment-559846](http://web.archive.org/web/20140719235950/http:/www.typophile.com/node/59688#comment-559846 \"http://www.typophile.com/node/59688#comment-559846\")).\n\nOn the other hand, if an \"a\" is just a \"q\" intersected with a \"d\", then it is almost as easy to make using a fontforge script than with a mere copy paste; you can get your 16 fonts in less than 2 seconds but this time some outlines may come out \"crappy\" as Hrant would put it; better then to do it manually.\n\n"
    },
    {
      "time": "12 Jul 2013 — 7:22pm",
      "content": "Moved to [http://typophile.com/node/104587](http://web.archive.org/web/20140719235950/http:/typophile.com/node/104587 \"http://typophile.com/node/104587\")\n\n"
    }
  ]
}
