{
  "id": "10363",
  "title": "Selling a font, copyrights included, to a foundry",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hi,   \n   \nDo you know about if this kind of deals happen in the type industry? I am looking forward to sell greyscale pixelfonts this way to some interesed customers, so they can own them to sell.   \n   \nThanks for your help,   \n   \nmh.\n\n",
  "author": "Miguel Hernandez",
  "time": "17 Apr 2005 — 9:10am",
  "uid": "1109",
  "comments": [
    {
      "time": "17 Apr 2005 — 5:56pm",
      "content": "I was thinking if some type designers are available to design custom fonts and sell them to a foundry who pay for own those works. I think its a good way of work but i dont know examples of designers selling fonts this way..   \n   \nAny example?\n\n"
    },
    {
      "time": "17 Apr 2005 — 6:15pm",
      "content": "This is not unusual. Sometimes these are typefaces commissioned by the foundries, or in other cases they are sold to the type foundry after the fact,   \n   \nIn our case, Adobe used to operate largely on a royalty basis, but for business and legal reasons has recently moved more towards a fully-paid-up-front model.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "18 Apr 2005 — 8:11am",
      "content": "Exelent information. Thank you Guys!   \n   \nmh\n\n"
    },
    {
      "time": "18 Apr 2005 — 9:37pm",
      "content": "Miguel, I have been a fan of your work for years and would be interested in discussing any ideas you have for distribution of your typefaces through Veer. Contact me through my Typophile profile if you would like to chat about this.   \n   \nCheers.   \n   \ng.\n\n"
    },
    {
      "time": "19 Apr 2005 — 7:36am",
      "content": "Thanks Grant. Shure.   \n   \nBest,   \n   \nmh\n\n"
    },
    {
      "time": "20 Apr 2005 — 1:06pm",
      "content": "Grant,   \n   \nThis are my email contact for msn: [screenfonts@hotmail.com](mailto:screenfonts@hotmail.com)   \nCurrent email: [miguel.a.hernandez@gmail.com](mailto:miguel.a.hernandez@gmail.com)   \n   \nCheers.   \n   \nmh.\n\n"
    },
    {
      "time": "13 Feb 2006 — 11:38am",
      "content": "Hello guys,  \nI created some designs (opentype fonts)with variable weights and widths.Can be used as display and body both.Now i want to sell all rights to any type foundry(If they like it).I need your help.  \nHow many i must quote? url's of type foundaries.How i submit my designs(in which format).  \nWaiting for your replies.THANKYOU.\n\n"
    },
    {
      "time": "22 May 2006 — 5:26pm",
      "content": "I am unsure of the 'rules' for this forum. If I'm breaking any, would someone please let me know---\n\nI own a digital art image, scrapbook, inspirations, consignment store. All of our artists and designers own all rights to their works. We offer a store front where these designers can place their products for sale under the Angel Policy. This policy allows customers to purchase our product, download it to their computer, print and create crafts and paper items in tangible format and sell the product in craft fairs, stores, online or off. (Our Angel Policy does not allow the customer to create a derivative work and sell or distribute it in digital or downloadable format. Only paper and tanbible handcrafted items can be made and sold (in tangible format only) by our customers).\n\nI am looking for font designers who are interested in selling their True Type Fonts subject to our angel policy at my site: [http://daisiecompany.com](http://web.archive.org/web/20150414120732/http:/daisiecompany.com/ \"http://daisiecompany.com\")\n\nI am also looking for AlphaBets (Graphic Alphabets and Numbers with a few punctuation marks: ! @ # ? ~ { }.  \nThese alphabets are not true type fonts. They can be sold to our customers under the Angel Policy, for the purpose of making word art and background papers for personal use only.\n\nThe Angel Policy for fonts means that your fonts could be used for personal items only. This means that the customer purchases the right to type words onto their craft projects, and scrapbook layouts. The Angel Policy would not allow them to distribute the font in any other format than printed onto their handmade item. No commercial use of fonts is allowed under this policy.\n\nAlso, looking for a commercial use agreement with font designers, as I would like to incorporate fonts into my word art, overlays and papers. It would be a great way for font designers to make some real money, retain all rights, rather than selling the fonts or contracting a small percentage licensing arrangement.\n\nPayment is made biweekly and the percentages paid to the designers/artists/ font designers for products sold is better than 50%\n\nFont designers can offer a multiple font bundle and sell them as a set of scrapbook fonts. We are looking for everything from cute fonts, elegant script to grunge block lettering.\n\nTo submit, type your alpha into a word doc, and include your name and email address. Send an email with your attached word doc to [ginajane@daisiecompany.com](mailto:ginajane@daisiecompany.com).\n\nI would love to hear from you.\n\n\\*\\*\\* gina jane \\*\\*\\*\n\n[http://www.daisiecompany.com](http://web.archive.org/web/20150414120732/http:/www.daisiecompany.com/ \"http://www.daisiecompany.com\")\n\n'relationships are the greatest art'\n\n"
    },
    {
      "time": "17 Apr 2005 — 9:20pm",
      "content": "Hey Miguel. Veer bought the [Jukebox](http://web.archive.org/web/20150414120732/http:/www.veer.com/partner/link.aspx?i=1048&c=4&p=products/vendor.aspx?vendor=JBT) foundry, (formerly known   \nas JAW Fonts) from [Jason Walcott](http://web.archive.org/web/20150414120732/http:/www.myfonts.com/person/walcott/jason/anthony/?refby=typographica). I believe he continues to make   \nfonts for them and receive payment up front.\n\n"
    },
    {
      "time": "17 Apr 2005 — 9:25pm",
      "content": "[http://www.veer.com/about/pressroom/releases/veer\\_pr\\_jbaquis\\_release.aspx](http://web.archive.org/web/20150414120732/http:/www.veer.com/about/pressroom/releases/veer_pr_jbaquis_release.aspx)\n\n"
    }
  ]
}
