{
  "id": "103672",
  "title": "Seeking feedback on selecting personal logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "#script",
    "a script typeface",
    "logo",
    "Logos / Corporate ID Design",
    "personal",
    "vintage"
  ],
  "content": "I'm working on my personal branding and would like some input on the logo that I've been developing. I've gone through about 50 variations of this, but am attaching the top 5 designs that were narrowed down based on a first round of critique from a colleague. The concept is based on a strong personal affinity for modern vintage design through the vintage seal/stamp shape and original craftsmanship. This is just the basic flat logo that I'll eventually add some slight additional styling and perhaps get turned into a physical rubber stamp for promotional print items.\n\nI am seeking preferences for integrating the script typeface monogram which gives it the more modern edge versus the more slab typeface.\n\nThank you!\n\n| Attachment | Size |\n| --- | --- |\n| [final-five.png](http://web.archive.org/web/20150419140332/http:/typophile.com/files/final-five_0.png) | 221.4 KB |\n\n",
  "author": "KATIEtheGREENE",
  "time": "7 Jun 2013 — 12:49pm",
  "uid": "211469",
  "comments": [
    {
      "time": "7 Jun 2013 — 12:58pm",
      "content": "I prefer the upper monogram to the bottom one simply because it balances within the circle motif better.\n\nAs for the seals themselves, I'd opt for the upper left for no other reason than it's the simplest, which would make the logo the most versatile to use. But they all look good.\n\n"
    },
    {
      "time": "7 Jun 2013 — 2:42pm",
      "content": "Welcome to Typophile, Katie. I'd pick A.\n\nAbbreviating \"Atlanta\" seems a bit odd to me in the A layout. I'd spell it out and maybe delete GA. Everyone should know where Atlanta is, and I presume your full address will appear nearby anyway.\n\nThe stars and smaller type may not hold up well when the logo is reproduced small. I'd suggest printing it out in tiny sizes and see what happens. And you might try simplifying the stars and not putting them at an angle.\n\n"
    },
    {
      "time": "7 Jun 2013 — 3:29pm",
      "content": "My eye first went to C but rest on A.\n\nI agree with the comments above, but would like to add that whilst the top row KG is more favourable perhaps the 'G' its self could be opened up, it's like a 'g' and 'C' got together to create that. The bottom row KG has a more striking presence out of the two (on their own).\n\nOverall its well crafted and fine tuned but its screaming US election and latest hipster design trend to me.\n\nI hope that helps Katie. What does A look like without the 'stamp' and just the text in red?\n\n"
    },
    {
      "time": "9 Jun 2013 — 11:19am",
      "content": "Thanks so much for the valuable feedback. Much appreciated!\n\n"
    },
    {
      "time": "9 Jun 2013 — 11:31am",
      "content": "To me A is too plain and C is too busy. I like B. And D and E are not happening.\n\nHow small will this have to work?\n\nBTW the rubber stamp is a great idea. Consider a wax seal too.\n\nhhp\n\n"
    },
    {
      "time": "9 Jun 2013 — 1:26pm",
      "content": "\\> How small will this have to work?\n\nThat's a good question but may be hard for her to answer. You can anticipate what size it'll be on your website and stationery, but situations may come up later where you have to use it smaller.\n\nLike maybe you want to buy ad space but can only afford a tiny size. Or you want some promotional giveaway items but the imprint area is very small (I've had clients put their logos on pens). Or a charity event prints a microscopic row of logos to thank companies that contributed to the event.\n\n"
    },
    {
      "time": "9 Jun 2013 — 2:58pm",
      "content": "Attaching some revised 3 versions based on feedback above, taking the 2 that were mentioned to stand out the most and added one without a background shape. Will have to work out the \"tiny size\" issues once I've nailed down the basic final design. I'm okay with fitting into the \"hipster trend\" since this is very much my style and personality, thus hard to try to be something else :)\n\n ![](http://web.archive.org/web/20150419140332im_/http:/typophile.com/files/final-three_5372.png)\n\n"
    },
    {
      "time": "9 Jun 2013 — 3:13pm",
      "content": "I like the one on the right. I would just lose the detail in the stars.\n\nBTW could we get a close-up of all the circular text? Letterforms can fall apart when treated like that.\n\nhhp\n\n"
    },
    {
      "time": "10 Jun 2013 — 12:51am",
      "content": "Katie I instantly drew to the revision without the literal BG shape. I'm still unsure about the 'G' but the tyophiles here will be able to shed more light if its a real problem.\n\nI agree with hrant about the stars.\n\n"
    }
  ]
}
