{
  "id": "10369",
  "title": "Type Designer ( cincinnati )",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am a student, and looking for someone ( type designer ) in the Cincinnati area that might be willing to give a little guidance, maybe able to meet periodically. I'm starting my first full typeface soon, so if anyone has any leads, it would be much appreciated.\n\n",
  "author": "Eric_West",
  "time": "17 April, 2005 - 5:04pm",
  "uid": "6194",
  "comments": [
    {
      "time": " 17 April, 2005 - 5:59pm",
      "content": "Eric, where do you go to school?   \n   \nAre you looking for someone to help you with the technical aspects of designing for computer use (hinting, etc.) or for actual typographic help?\n\n"
    },
    {
      "time": " 17 April, 2005 - 6:16pm",
      "content": "Ok,   \n   \nI attended the University of the Arts (pcad) for 2.5 years. Funds ran dry. So now I am at Northern Kentucky. At UArts I had type design once with Inge Druckrey and once with someone else. So, I've had enough that I can probably, on my own, do o.k. But I want to do better than o.k.   \n   \nI have to compete with the folks at D.A.A.P.   \n   \nI actually haven't even sat down with fontographer or fontlab yet, I just was hoping that someone with experience in the Actual DESIGN of type would be willing to lend insight/mentoring/ in-progress critiques, God knows theres no one at my school that could remotely do it.\n\n"
    },
    {
      "time": " 17 April, 2005 - 6:31pm",
      "content": "\"I have to compete with the folks at D.A.A.P. \"   \n   \nI'll take that as a compliment (Graphic Design, '07)   \n   \nMy recommendation is to contact Professor Heinz Schenker at UC/DAAP. He teaches most of the typography courses, including the intro class where you design entire lettersets. He is amazingly perceptive and helpful in type design. He more or less turned me into the typophile I am now.   \n   \nThe only thing I can warn you about is that he favors very traditionalist type design (i.e. I attempted to make a sans serif double-story lc g and he kinda balked at it)   \n   \nI hope that helps. I'd love to take a look at some of it if you get to a point where you'd like a third (albeit somewhat green) perspective.\n\n"
    },
    {
      "time": " 17 April, 2005 - 6:34pm",
      "content": "Thanks!   \n   \nShould I tell him you sent me?\n\n"
    },
    {
      "time": " 17 April, 2005 - 7:30pm",
      "content": "No, not necessary. Maybe you can just mention that a student of his recommended you to him.   \n   \nAnd he may not be able to help you, but I'm sure he could at least help with some recommendations of others in the area. He's a slightly eccentric guy, just to warn you, and is not super fluent with English (he's from Switzerland).   \n   \nI just remembered there is a Senior Designer at Landor Cincinnati that also has some experience in type design. I'm blanking on his name right now, but if I come up with it, I'll let you know. Maybe Heinz or one of the other UC professors knows his name. He's a DAAP grad if I remember.\n\n"
    }
  ]
}
