{
  "id": "103784",
  "title": "P22 Mackinac Book legible as body copy?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I incorporated the typeface from an identity I did for a seminary into a magazine I'm designing. Now, I'm having second thoughts.\n\nDo you think Mackinac Book is challenging to read as body copy? If so, what are your thoughts on other typefaces that would maintain its feel and pair well with it and Gotham, the sans serif I'm using?\n\nI dislike mixing type too much, but what if I only replace the body, and keeping the pull quotes (Book Italic) and headers (Medium) in Mackinac? Can it work? Some of the slab serifs with the same high x height, low cap height and very rounded O's and almost work.\n\nMy deepest gratitude to anyone who deigns to answer my query!\n\n- Martha\n\n",
  "author": "Martha H.",
  "time": "12 Jun 2013 — 7:44am",
  "uid": "27034",
  "comments": [
    {
      "time": "12 Jun 2013 — 8:17am",
      "content": "I’ve not seen it in print, and don’t know your layout/specs, but it doesn’t appear have legibility issues.  \nHowever, if you can’t get it to work to your satisfaction as body, but like the general appearance, ITC Cheltenham would be a “safe” alternative.\n\n"
    },
    {
      "time": "12 Jun 2013 — 8:40am",
      "content": "Ah, yes. Cheltenham light is not bad. I'll give a whirl. Thank you!\n\n"
    },
    {
      "time": "12 Jun 2013 — 9:27am",
      "content": "It can only work well at smaller sizes, like ~8.\n\nhhp\n\n"
    },
    {
      "time": "12 Jun 2013 — 10:10am",
      "content": "Yes, that's how I had Mackinac sized. It's the low ascenders that make it bit challenging when reading. It's not terrible, but I don't want to trouble readers.\n\n"
    },
    {
      "time": "12 Jun 2013 — 11:50am",
      "content": "Plus it's a bit loose. BTW the Book weight is too light for small text.\n\nhhp\n\n"
    },
    {
      "time": "13 Jun 2013 — 10:49am",
      "content": "So, if I don't want a safe choice, but something a bit more interesting, anyone have some additional suggestions for a typeface with a large x height, low cap height, full body?\n\nThank you!\n\n"
    },
    {
      "time": "13 Jun 2013 — 10:54am",
      "content": "Wait, so you're sure you're shooting for smaller size settings? If so, why?\n\nYou can be \"unsafe\" aesthetically, but to me being unsafe functionally is not Design, it's Art. What I'm getting at is: wanting a large x-height for aesthetic reasons seems reckless.\n\nhhp\n\n"
    },
    {
      "time": "13 Jun 2013 — 12:28pm",
      "content": "I just meant something maybe less conservative than Cheltenham. (Mackinac at 8 pt., it is the equivalent of Garamond at 10 pt.)\n\nI'm looking for a typeface that will be be in keeping, or play well with, the font in a logo—Mackinac Bold. I've used Mackinac Book as body in some ephemera for my client, but it wasn't until I saw it as a full page that I realized it's not great choice for a magazine. If I were reckless, I would have kept it. But surely there are other typefaces that have larger x-heights and would be legible. Clarendon, for instance, isn't bad, right? However, I always wish there were a step between regular and bold. I was just looking at Calluna. I doesn't have any of the softness of Mackinac, but would be an easy read. Or maybe I'm stressing the wrong quality, and the fuller body is more important?\n\nI've attached the logo for reference.\n\n ![](http://web.archive.org/web/20140718191534im_/http:/typophile.com/files/BexSea_logo_OL_FNL_5377.jpg)\n\n"
    },
    {
      "time": "13 Jun 2013 — 12:34pm",
      "content": "> Mackinac at 8 pt., it is the equivalent of Garamond at 10 pt.\n\nIn apparent size maybe, but not in readability.\n\nWhat I'm trying to say is the font you choose can nicely accompany the Mackinac logo without having to match its proportions.\n\nSo: Let's find a \"soft\" and -optionally- wide serif face with a modest x-height.\n\nhhp\n\n"
    },
    {
      "time": "13 Jun 2013 — 1:07pm",
      "content": "Great! The challenge is, I'm developing this brand on the fly via the magazine and am quite behind. So! If you have ideas, I'm all ears…er eyes. (And very grateful!)\n\n"
    }
  ]
}
