{
  "id": "103735",
  "title": "Contracts for Creative Professionals workshop, 6/15 in L.A.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi gang. I'm coproducing an workshop THIS Saturday with designer-turned-lawyer Jonathan Tobin that I think would be of interest to some of you (if you're in Los Angeles).\n\nCONTRACTS FOR CREATIVE PROFESSIONALS  \nSaturday, June 15, 2013  \n9:00 AM to 1:00 PM  \nThe Hub Los Angeles  \n830 Traction Ave. #3A  \nLos Angeles, CA 90013  \n [http://contractsforcreativeprofessionals.eventbrite.com/](http://web.archive.org/web/20130820163134/http:/contractsforcreativeprofessionals.eventbrite.com/ \"http://contractsforcreativeprofessionals.eventbrite.com/\")\n\nContracts mystify many creative professionals, yet they are the lifeblood of the trade. In this workshop, geared towards freelance creatives and small agencies, we will work together to understand contracts and see how they can be used as a tool to do better work, make more money and keep clients happy.\n\nThis workshop will teach the basics of how contracts work, how to approach contract negotiation as a collaborative process, explain important and common contract clauses and offer guidance on when and how to seek help drafting or enforcing contracts.\n\nHere is what you will learn, at the very least:\n\n• What a contract is and how it is formed.  \n• How contracts are structured.  \n• Common contract clauses.  \n• Typical issues in creative contracts.  \n• How to approach contracts with your clients in a non-adverserial way.  \n• Using online signing services to make the process painless.  \n• How to find and adapt basic contracts.  \n• How to enforce contracts.  \n• How to work with an attorney to draft, modify and enforce contracts.\n\nSince this is an early \"beta\" of what we hope will become a valuable, repeatable event for the creative community, participation in this first workshop will be limited to just 10 people and cost only $89.\n\nABOUT THE ORGANIZERS\n\nJonathan Tobin is a California attorney and worked as a graphic designer and web developer for over a decade. He helps creators, makers and innovators use the law to become more successful.\n\nSpencer Cross is an LA-based designer and artist. He is an evangelist for the LA design community and works to foster community and camaraderie among LA-area creative professionals by coordinating a variety of social and educational events and discussion forums.\n\n",
  "author": "Spencer Cross",
  "time": "10 Jun 2013 — 12:31pm",
  "uid": "13505",
  "comments": [
    {
      "time": "10 Jun 2013 — 9:19pm",
      "content": "Sounds like a winner.\n\nhhp\n\n"
    },
    {
      "time": "11 Jun 2013 — 10:33am",
      "content": "Thanks!\n\n"
    },
    {
      "time": "11 Jun 2013 — 11:29am",
      "content": "Litigation is an expensive proposition ...good luck drumming up business.\n\n"
    },
    {
      "time": "11 Jun 2013 — 12:39pm",
      "content": "Contracts are a great idea, especially for large jobs, but like 5star said litigation can indeed be expensive (unless it's a small amount suitable for small claims court).\n\nWith new clients I usually write a letter of agreement that spells out what services I'll provide, what the anticipated charges are, the rough timeline, etc., and ask for their signature. Usually that prevents misunderstandings later on.\n\n"
    },
    {
      "time": "11 Jun 2013 — 12:59pm",
      "content": "AIGA and RGD have standard contract forms available online for all, not just members.\n\n"
    }
  ]
}
