{
  "id": "103704",
  "title": "Seeking typographer to finish my typeface",
  "forum": "Build",
  "tags": [
    "build",
    "design",
    "face",
    "font",
    "work",
    "Build"
  ],
  "content": "Hi,  \nI´ve started a quite interesting project on a font face that I´ve called \"Drops\", but I´m not skilled enough to  \nset the font as a working type face. It´s also not quite finished, so I´m looking for someone who´s interested in  \nfinishing it for me.  \nYou will be appointed as collaberative founder, and you will get paid by me if you can do the job right :)  \nHere´s a sample, let me know if you´re interested and I´ll show you the whole story...\n\n ![](http://web.archive.org/web/20150420221029im_/http:/typophile.com/files/drops_4302.jpg)\n\nRegards,  \nEspen\n\n| Attachment | Size |\n| --- | --- |\n| [drops.jpg](http://web.archive.org/web/20150420221029/http:/typophile.com/files/drops.jpg) | 122.16 KB |\n\n",
  "author": "espena",
  "time": "9 Jun 2013 — 1:18pm",
  "uid": "212141",
  "comments": [
    {
      "time": "10 Jun 2013 — 9:44am",
      "content": "Hei Espen. Send meg gjerne en mail hvis du er interessert i hjelp.\n\n"
    },
    {
      "time": "13 Jun 2013 — 1:55pm",
      "content": "Hei Frode takk for din interesse,  \njeg har altså dette uferdige display-typsnittet som jeg gjerne skulle sett bli implementert,  \nser at du har god greie på typo (grattis med gull i visuelt for Satyr forresten, utrolig godt håndtverk!)\n\nOm du er interessert i å ta tak i dette prosjektet så er du hjertelig velkommen til det! Jeg er jo ingen typograf, bare veldig glad i form (interaktiv designer i apt). Drops-typoen er jo ganske leken og løs i formen enn det du er vant til å jobbe med, men det kunne kanskje vært gøy å eksperimentere med for deg?  \nOg i så fall, vil du kikke på vektorfilene direkte eller skulle vi møttes over en kaffe en dag? Jeg er åpen for det meste :)\n\nMvh,  \nEspen  \n99704631\n\n"
    },
    {
      "time": "14 Jun 2013 — 7:36am",
      "content": "Hi Espen,  \nI could be available to help you with this. The organic form really appeals to me, and goes with what I've been working on recently.  \nbr/mvg,  \nDavid\n\n"
    }
  ]
}
