{
  "id": "103775",
  "title": "Is \"Optical Sized\" Didot really worth the extra investment?",
  "forum": "General Discussions",
  "tags": [
    "Didot",
    "General Discussions",
    "resolution"
  ],
  "content": "I like Didot and was hoping to have my web designer use it on my website. My one hesitation is because it is such a high contrast font that it doesn't look as nice small as it does large. I came across H&FJ Didot which has \"Optical Sizes' which is a concept I really like, but since I am not a graphic designer I don't know how big of a difference the \"Optical Sizes\" will really make on a website. I really only will need at max maybe 8 styles of Didot, but the H&FJ Didot only sells theirs in a package of 42 styles (because of the optimized fonts) so it is quite a bit pricier than other Didot fonts I have looked at (like Linotype Didot on myfonts.com)  \nI really like Didot, but I know enough about graphic design to know I don't know graphic design and that is why I am asking to get a consensus of whether it is really worth it to invest the extra couple hundred of dollars to get the H&FJ Didot vs Linotype Didot?\n\nThank you for reading my question :)\n\n",
  "author": "CamillaJ",
  "time": "11 Jun 2013 — 4:36pm",
  "uid": "212197",
  "comments": [
    {
      "time": "11 Jun 2013 — 5:08pm",
      "content": "H&FJ fonts don't currently support the most popular font formats for web use (although they say support is coming soon).\n\nI would consider other fonts. Using the advanced search on MyFonts, look for \"Didot\", or \"Didone\" or even \"Modern\" and use the additional search criteria \"web font support exists\". That should give you start.\n\n"
    },
    {
      "time": "11 Jun 2013 — 6:34pm",
      "content": "Thank you for the advice!\n\n"
    },
    {
      "time": "11 Jun 2013 — 7:16pm",
      "content": "H&FJ is clearly one of the best Didot designs available and I think it is worth the extra investment, for print.\n\nThe whole class is rather difficult for web because Didot is intended to be used with the thin horizontal strokes remaining for the most part consistent independent of size. This is to say, if one tunes their printing to the proper appearance of text as they like it, whatever the crossbar of the 10 point H looks like, from there to 100 point and beyond, the crossbar of the Didot H, (along with all the serifs, hairlines and etc.) are to maintain that apparent thickness.\n\nThere is a good reason why sans, and low contrast fonts in general, are so successful on the web. Despite its pixel-based nervous system, and even with the most elaborate size mastering, hinting, media queries and voodoo, it'd be hard to supply such an appearance consistently for a Didot on the whole web, though maybe one part of the web at a time is enough?\n\nIn the mean time, you might study the web type uses of notorious Didotphiles and see what they are doing instead.\n\n"
    },
    {
      "time": "12 Jun 2013 — 7:12am",
      "content": "Have you looked at [Linotype Didot eText](http://web.archive.org/web/20150325072353/http:/www.fonts.com/font/linotype/linotype-didot-etext)?\n\n"
    },
    {
      "time": "12 Jun 2013 — 8:03am",
      "content": "Even with Retina resolution, didone faces don’t work at small sizes on screen.  \nReally, the horizontal serifs need a pixel of its own.  \nTherefore, you need a threshold of 28 pixels (according to WebInk’s Bodoni page) to even get those serifs to show ﬁrmly, and the effect is more like a slab serif than the delicate, high-contrast effect of H&F-J’s Didot.\n\n"
    },
    {
      "time": "13 Jun 2013 — 7:06pm",
      "content": "I hear that Apple is going to use Didot for iOS8 because of their \"retina\" displays.\n\nBut that is a good question, what is the best Didoni for use on the web?\n\n"
    },
    {
      "time": "14 Jun 2013 — 8:48am",
      "content": "\\>Even with Retina resolution, didone faces don’t work at small sizes on screen.\n\nI can show, even with Retina resolution, didone faces don’t work at _large_ sizes on screen. All the serifs, like the baseline serifs, even if they are not on the baseline, or even horizontal, must meet the grid exactly as do the baseline serifs.\n\n\\>I hear that Apple is going to use Didot for iOS8 because of their \"retina\" displays.\n\n... but didones can be made to work at any given ppm, even without hints.\n\n"
    },
    {
      "time": "14 Jun 2013 — 12:00pm",
      "content": "How is that possible?  \nSurely the hairline serifs need a pixel of their own, in which case the type ceases to be high contrast below a certain size, or else if the hairline is greyed, again, the high contrast effect is lost.\n\n"
    },
    {
      "time": "18 Jun 2013 — 8:27pm",
      "content": "I should note, I was joking about the iOS8 thing.\n\n"
    },
    {
      "time": "18 Jun 2013 — 9:29pm",
      "content": "But Nick's line of questioning still stands.\n\nhhp\n\n"
    },
    {
      "time": "20 Jun 2013 — 7:48am",
      "content": "DG\\>I should note, I was joking about the iOS8 thing.\n\nI was ignoring that and answering the second part.\n\nI think, the answer for the web is \"none\" live, graphics probably work a little better. The reason is low resolution, minus hinting. In addition, lighter-than-normal asymmetric rendering by any OS would make the quality use of this whole class of types go ppppffffft on the web...\n\nIssues surrounding the CT Collection first raised this discussion, at which time Didot's doom was forecast.\n\n"
    }
  ]
}
