{
  "id": "103702",
  "title": "No kerning info in a font I licensed -- what to make of it?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "kerning",
    "licensing",
    "spacing"
  ],
  "content": "[I might post a sample, but it's not that relevant to my question; and ranting about a specific designer and foundry is not what I'm up to...]\n\nNow I know that badly spaced/kerned font aren't hard to come by. What makes this case special, though: the foundry, in its press release that's reproduced by retailers, emphasizes the ›love‹ that the designer put into spacing and kerning. At first sight it seems some of that love simply missed a few kerning pairs. But even the most fundamental pairs (`Te` etc.) don't seem to be kerned either.\n\nLooking at the font file itself, it turns out that the font doesn't contain any kerning information \\*at all\\* (nor does it contain any other OpenType features, but unlike the kerning, I wasn't promised anything along that lines anyway).\n\nWas I too naive thinking that the terminology of such blurbs wouldn't be flexible enough to include the absence of any any kerning even when it advertises the font as particularly well kerned? Should I consider it a bug, contact the retailer (or foundry?), »I think the kerning information got lost along the way... could you provide me with new files that include it?« As for a refund? etc. What do you think?\n\nany ideas appreciated!  \n-- Nils\n\n",
  "author": "lindenhayn",
  "time": "9 Jun 2013 — 9:55am",
  "uid": "56792",
  "comments": [
    {
      "time": "9 Jun 2013 — 10:08am",
      "content": "the 1st three paragraphs got lost somehow -- maybe someone can add them...\n\nI licensed a font the other day, a recently released family of 10 weights \\* 2 styles \\* text + display version. I was a bit suspicious of the whole thing, as there didn't seem to be a PDF specimen available anywhere. But the introductory offer was a nice one, and the font seemed perfect for my purposes.\n\nWhat I got was a font that, as expected, does have its qualities in some respects, but is kerned/spaced so horribly that it's pretty much useless for the application it was designed for -- it's meant to be a ›legible‹ sans for body text.\n\nFor example, in a string like `Hertz/Watt`, the lower end of the slash overlaps with the `z`, and its upper end overlaps with the `W.` In a word like `pad`, the `a` is considerably closer to the `p` than it is to the `d` ...etc. All these things a clearly visible at regular reading sizes.\n\n"
    },
    {
      "time": "9 Jun 2013 — 10:03am",
      "content": "If they said there's kerning and there isn't, you're entitled to a refund. If they refuse, name names.\n\nhhp\n\n"
    },
    {
      "time": "9 Jun 2013 — 10:09am",
      "content": "Similar experience:  \n [http://typophile.com/node/102939](http://web.archive.org/web/20150122202125/http:/typophile.com/node/102939 \"http://typophile.com/node/102939\")\n\n"
    },
    {
      "time": "9 Jun 2013 — 11:02am",
      "content": "_\\> Similar experience_\n\nthanks, very interesting thread! Yes, I do know some of the best fonts come with no kerning at all because they're _spaced_ so well. This is not the case here. What I think is the case is either (a) a font that would need kerning info, and was produced with it, but, due to some accident, doesn't come with it -- or (b) a considerable discrepancy between what the foundry vs. myself consider a »lovingly spaced and kerned« font.\n\n"
    },
    {
      "time": "9 Jun 2013 — 11:09am",
      "content": "I don't think there can be \"best\" without kerning. Note that even metal fonts took pains to address spacing exceptions.\n\nhhp\n\n"
    },
    {
      "time": "9 Jun 2013 — 11:55am",
      "content": "First of all: in which app did you do your testing? Eg if you used InDesign you HAVE to use the Metrics option in Kerning, because that is the only way the values that have been put in by the designer will be used.\n\n"
    },
    {
      "time": "9 Jun 2013 — 12:11pm",
      "content": "[tracking]\n\n"
    },
    {
      "time": "9 Jun 2013 — 12:57pm",
      "content": "_\\> you HAVE to use the Metrics option in Kerning_\n\nif I had accidentally used optical kerning instead, the results would look better (yes, it's that bad). As I mentioned, there is no OT `kern` feature (or kerning table) in the font at all, so, in this particular font, an optically kerned `Te` is an improvement over the default.\n\nTried ID and LuaLaTeX for typesetting (same problems); otfinfo and Fontlab for looking at the files themselves.\n\n![](http://web.archive.org/web/20150122202125im_/http:/i.imgur.com/6pSGPzY.png)\n\n"
    },
    {
      "time": "9 Jun 2013 — 1:06pm",
      "content": "And are the bottoms of \"z\" and \"/\" off by like 2 units? AFAIR Frutiger used to make his \"z\"s a hair high & short, but somehow I don't think that's the case here...\n\nhhp\n\n"
    },
    {
      "time": "9 Jun 2013 — 2:11pm",
      "content": "Could be the kerning was pairs kerning, a la Type 1 fonts, and \"somebody\" made a OpenType format font out if it & forgot to \"import kerning\" -- make a proper OT kern table (I'm a limited skill FontLab sort).\n\nThat would explain the apparent absence of avowed love...\n\n"
    },
    {
      "time": "9 Jun 2013 — 2:36pm",
      "content": "It could be a genuine error. I'd try contacting the support people at the foundry and explain the error.\n\n"
    },
    {
      "time": "10 Jun 2013 — 4:58am",
      "content": "it's solved now. I contacted the foundry=designer last night, and got a very nice reply within a few hours. They were aware of the problem, and had already provided MyFonts with replacement files, but apparently MyFonts hasn't updated the files on their server yet. One e-mail later, the foundry provided me with the replacement files directly. Great customer service; I'm impressed.\n\n"
    },
    {
      "time": "10 Jun 2013 — 6:38am",
      "content": "Good news.\n\nhhp\n\n"
    },
    {
      "time": "10 Jun 2013 — 8:24am",
      "content": "That's good to hear. I licensed the same font through You Work For Them; hopefully they'll provide updated files soon.\n\n"
    },
    {
      "time": "10 Jun 2013 — 10:25am",
      "content": "I will note that doing something with love is not \\*necessarily\\* synonymous with doing it well.\n\nThat being said, I note that I would expect the left sidebearing of \"a\" to be less than the right. Also, that it is not unusual for the default spacing of the slash to step outside its advance width on both sides, which could collide with letters with minimal sidebearings such as z and W.\n\n"
    },
    {
      "time": "16 Jun 2013 — 8:05pm",
      "content": "Updated family with corrected kerning and spacing have been provided to all distributors who carry Vaud, the family of typefaces mentioned here.\n\n"
    }
  ]
}
