{
  "id": "103802",
  "title": "New iOS: Is Helvetica a hair salon typeface?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "OK, now that you've all seen the new iOS 7, for which some claim that it is “over-Helveticated”, British Guardian “tested it on” a designer and he said “hairdressers”: [http://www.guardian.co.uk/technology/shortcuts/2013/jun/12/skeuomorphism...](http://web.archive.org/web/20140804122859/http:/www.guardian.co.uk/technology/shortcuts/2013/jun/12/skeuomorphism-apple-ditched-ios7 \"http://www.guardian.co.uk/technology/shortcuts/2013/jun/12/skeuomorphism-apple-ditched-ios7\")\n\nWhy would he say that?\n\nDo you hate the new look and typography of iOS 7?\n\n",
  "author": "Sylph",
  "time": "12 Jun 2013 — 10:44pm",
  "uid": "29977",
  "comments": [
    {
      "time": "12 Jun 2013 — 11:08pm",
      "content": "Keep in mind that the interface is in beta testing and will be tweaked before the public release this fall.\n\nMany more shots of it are on this page if you scroll down: [http://www.apple.com/ios/ios7/](http://web.archive.org/web/20140804122859/http:/www.apple.com/ios/ios7/ \"http://www.apple.com/ios/ios7/\")\n\n"
    },
    {
      "time": "13 Jun 2013 — 7:11am",
      "content": "No amount of beta-testing is going to cure the disease of seeing reading as a necessary evil.\n\nhhp\n\n"
    },
    {
      "time": "13 Jun 2013 — 9:43am",
      "content": "I interpret the comment as a euphemism for derogatory use of \"gay\", presumably because of the diaphanous quality of the layouts.\n\n"
    },
    {
      "time": "13 Jun 2013 — 9:49am",
      "content": "That kind of comment may be a little less politically incorrect in the UK than America.\n\n"
    },
    {
      "time": "13 Jun 2013 — 9:52am",
      "content": "You don't have to dislike gays to dislike the hairdressing industry. Or at the very least realize that what's good for hairdressers isn't good for a UI... But to me a better comparison is this: iOS7 is like the children's cosmetics counter in the Beijing Macy's.\n\nDiaphanous: new word to me - nice - thanks.\n\nhhp\n\n"
    },
    {
      "time": "13 Jun 2013 — 10:49am",
      "content": "Thanks, but on reﬂection I’m not sure diaphanous is the right description—I just had a quick look at the link above, on my iPhone. On further examination, most of the page designs are quite ﬂat and solid, although the use of Helvetica 35 does have a bit of a “see through” quality.\n\nPerhaps the use of such a light typeface is because “now we can”, with the high-res screen.\n\nThat was certainly the case for the implementation of Helvetica 35 twenty years ago in print, when direct-to-plate output enabled high res printing of thin types at small size, without the attrition that occurs in photographic pre-press production.\n\nI discussed this in 2001: _Seeing the Light_  \n [http://www.gxo.com/archive/ARCHIVESPDF/General/60110SeeingtheLight.pdf](http://web.archive.org/web/20140804122859/http:/www.gxo.com/archive/ARCHIVESPDF/General/60110SeeingtheLight.pdf \"http://www.gxo.com/archive/ARCHIVESPDF/General/60110SeeingtheLight.pdf\")\n\n"
    },
    {
      "time": "13 Jun 2013 — 10:48am",
      "content": "The thing is, who wants to actually live with an anorexic supermodel with a speech impediment?\n\nhhp\n\n"
    },
    {
      "time": "13 Jun 2013 — 11:05am",
      "content": "\\> a euphemism for derogatory use of \"gay\"\n\nYes I think that was his intention.\n\nA significant percentage of iPhone users are female, so a less masculine look certainly isn't out of place. Some of the type seems a little light to me, but it's hard to judge from screen shots, we'll need to see how they look on an actual iPhone.\n\n\\> most of the page designs are quite ﬂat...\n\nDefinitely a move toward \"flat design\", which is a current trend in interface design, although interestingly Apple has also added a 3D effect. The phone's sensors know when it's being rotated and they rotate the background in response, creating the effect that the icons are floating in front of the background. You can see the animation effect here:  \n [http://gizmodo.com/ios-7-instead-of-flatness-we-got-depth-512291484](http://web.archive.org/web/20140804122859/http:/gizmodo.com/ios-7-instead-of-flatness-we-got-depth-512291484 \"http://gizmodo.com/ios-7-instead-of-flatness-we-got-depth-512291484\")\n\n"
    },
    {
      "time": "13 Jun 2013 — 12:36pm",
      "content": "Wow. Many of the foreground/background color combos tend towards the illegible, or at least significantly reduced legibility.\n\nIf I had seen iOS 7 previews a few months ago, I would have held off on upgrading to an iPhone 5. If it actually ships like this I may run for the hills. Helvetica is anti-legibility enough without going out of their way to make it worse.\n\n"
    },
    {
      "time": "13 Jun 2013 — 1:01pm",
      "content": "I dislike articles that abuse the term 'skeuomorphism'\n\n"
    },
    {
      "time": "13 Jun 2013 — 2:51pm",
      "content": "But hopefully you can still read them easily enough to dislike them! :-)\n\nhhp\n\n"
    },
    {
      "time": "13 Jun 2013 — 1:40pm",
      "content": "Thomas, you could just keep your current iPhone OS. Downloading newer versions has always been optional.\n\n"
    },
    {
      "time": "13 Jun 2013 — 1:48pm",
      "content": "They do have their ways though.\n\nBTW, FYI, FWIW, yours truly called it, back in November:  \n [http://typophile.com/node/98524#comment-532421](http://web.archive.org/web/20140804122859/http:/typophile.com/node/98524#comment-532421 \"http://typophile.com/node/98524#comment-532421\")\n\nhhp\n\n"
    },
    {
      "time": "13 Jun 2013 — 6:33pm",
      "content": "I want to know exactly who it was at Apple that fell in love with Helvetica, critics be damned. I'm not a Helvetica hater, but typography has come a long, long way since 1950s Switzerland.\n\nRegarding the 35 weight, I was always taught that the more you notice the features of a font, rather than the words and the feeling of the words, then the font has failed. Helvetica is supposed to be one of the most transparent, \"don't look at me\" fonts in existence, which is why I assume it's been chosen as the font du jour. But using the light weight kills that premise.\n\n"
    },
    {
      "time": "17 Jun 2013 — 9:02pm",
      "content": "Inspired by  \n [http://jonyiveredesignsthings.tumblr.com/](http://web.archive.org/web/20140804122859/http:/jonyiveredesignsthings.tumblr.com/ \"http://jonyiveredesignsthings.tumblr.com/\")  \nI present to you something that I think goes to the heart of the matter:\n\nJony \"Well, you can still read it, right?\" Ive redesigns Helvetica:\n\n ![](http://web.archive.org/web/20140804122859im_/http:/typophile.com/files/HelveticIve_5599.gif)\n\nhhp\n\n"
    },
    {
      "time": "18 Jun 2013 — 3:17am",
      "content": "awwww... people don't like. I think it's cool to have the confidence to render light fonts. Licensing, rather than just making clones, is admirable, and it takes a lot of guts to put your name n face on the design and function of mass market tech products... Who else does that... wonder what'd be like if your names were up there. What things'd look like...\n\n"
    },
    {
      "time": "18 Jun 2013 — 5:13am",
      "content": "This is a screen grab of my home screen with a black background...\n\n ![](http://web.archive.org/web/20140804122859im_/http:/typophile.com/files/iOS7_4379.jpg)\n\nSo far I am happy with the update.\n\n"
    },
    {
      "time": "18 Jun 2013 — 7:02am",
      "content": "> Licensing, rather than just making clones, is admirable\n\nYou must be referring to this:  \n [http://en.wikipedia.org/wiki/Chalkboard\\_%28typeface%29](http://web.archive.org/web/20140804122859/http:/en.wikipedia.org/wiki/Chalkboard_%28typeface%29 \"http://en.wikipedia.org/wiki/Chalkboard\\_%28typeface%29\")\n\nI have to doubt that Apple didn't make a clone for ethical reasons. But most of all, the proper way to do this is commissioning original custom type, like MS has done. But oh, I forgot, Apple is pretty cash-strapped these days... With all its faults, MS still respects type -and reading- more than any other large company I can think of. And that's what type designers should hold up as model behavior - as opposed to Luisel Ramos.\n\nI guess even the smartest people are not immune to the blinding light of brand loyalty.\n\nhhp\n\n"
    },
    {
      "time": "18 Jun 2013 — 7:38am",
      "content": "I don't mind light headlines as long as they're readable. Most of the complaints about the interface from professional designers has been concerning the icons, and I agree that many of them need more work. But as I said earlier this is just a beta and will be tweaked before the public release this fall.\n\n"
    },
    {
      "time": "18 Jun 2013 — 7:52pm",
      "content": "If its never more than a foot from your face, how bold's it got to be again?\n\nAnd, yes... Hrant, I agree with you completely, there is no way to commission a font like Comic Sans, one just has to wait for that lucky day, (or pick from the 1000s of such fonts available). But Helvetica, that's a different clone altogether.\n\nI also agree that some customer loyalty is blind, but I'm a type designer, and I look at these issues with a certain certainty I'm sure is beyond the usual blindly loyal customer. Your Ive thing is also quite distasteful. He's another person in a long lone of same, you don't know, but pretend too, oh so well. Faced by him, you'd run.\n\n"
    },
    {
      "time": "18 Jun 2013 — 11:47am",
      "content": "> I'm a type designer, and I look at these issue with a certain certainty\n\nYou're a human who errs, just like me. Your disregard for the typographic good MS has been doing versus the typographic pillaging Apple has been doing is clear proof of that. And if you think I'm the only one who believes that, that would be another way you err, another way your hubris is misplaced (as it always is for any human).\n\nAnd here's another thing you seem to be blind to: I don't run.\n\nhhp\n\n"
    },
    {
      "time": "18 Jun 2013 — 8:43pm",
      "content": "Settle down, girls.\n\nThat Jony Ive site is awesome. Nothing like a little satire to rein in the extremist ends of the new OS.\n\n"
    },
    {
      "time": "19 Jun 2013 — 3:22am",
      "content": "\"I don't run\"\n\nI know. A blue screened human is the easiest kind to spot.\n\n"
    },
    {
      "time": "19 Jun 2013 — 9:13am",
      "content": "I don't think anyone would run from Ive. He's a pretty mellow guy. ;)\n\n(That said, he had to work with Jobs for a decade so is probably more than capable of dealing with hrant if need be. ;)\n\n"
    },
    {
      "time": "19 Jun 2013 — 9:20am",
      "content": "@Karl Stange: I find “Tuesday 18” difficult to read.\n\n"
    },
    {
      "time": "19 Jun 2013 — 9:59am",
      "content": "\\> He's a pretty mellow guy. ;)\n\nI agree, and also shy. I don't think he's ever gotten on stage to make a presentation at an Apple keynote; instead they always show a video of him.\n\n\\> he had to work with Jobs for a decade\n\nTrue but Steve Jobs' wife said once that Steve was always careful not to say anything \"hurtful\" to Ive. My guess is that Jobs thought that Ive was too shy to take the withering comments that Jobs was famous for.\n\n"
    },
    {
      "time": "19 Jun 2013 — 10:10am",
      "content": "Then I hope he doesn't have a seizure seeing the feedback on iOS7... Except for the most berserker of Apple fanboys (and fanmen...) most people do see serious problems.\n\n[http://j.mp/100yRxG](http://web.archive.org/web/20140804122859/http:/j.mp/100yRxG \"http://j.mp/100yRxG\")  \n [http://j.mp/11w1gJS](http://web.archive.org/web/20140804122859/http:/j.mp/11w1gJS \"http://j.mp/11w1gJS\")  \n [http://j.mp/11w1hgI](http://web.archive.org/web/20140804122859/http:/j.mp/11w1hgI \"http://j.mp/11w1hgI\")\n\nhhp\n\n"
    },
    {
      "time": "19 Jun 2013 — 4:22pm",
      "content": "People have said there are 'serious problems' with every OS update ever made by any company. Every one. It's what people do. It's especially what tech bloggers do.\n\n"
    },
    {
      "time": "19 Jun 2013 — 4:41pm",
      "content": "Sorry dude, I smell denialism. This one's \"special\".\n\nBTW what do you think of Spiekermann's opinion(s)?\n\nhhp\n\n"
    },
    {
      "time": "19 Jun 2013 — 8:22pm",
      "content": "I'm not sure what I'm denying.\n\nMy point was only that people tend to hate change in software UIs. They complain. And then they get used to it. Like me everytime I open a new version of Photoshop.\n\nAs for Spiekermann, I don't know what his opinion is.\n\nLooping all the way back to JamesM gizmodo link: cool! That's rather subtle but useful. It'll be interesting to see the interaction elements of the new iOS.\n\n"
    },
    {
      "time": "19 Jun 2013 — 8:46pm",
      "content": "The only way there's not at least a hint of denial here is if one simply hasn't seen the deluge of discontent. I certainly agree that people go out of their way to complain (yes, especially about a UI) and I'm all for abrupt shifts for the better. But this is quite a bit more than the usually expected negative whining; people who would normally give Apple the benefit of the doubt aren't being able to do that any more. And actually I think that's good news.\n\nBut really, I'm not fixated on public opinion here - I could even grow to like those gaudy gradations that designers [are taught to] hate. I just believe that the appreciation of how type works is totally lacking; letterforms are being treated as just another decorative element, not vessels of language. This is the classic Modernist delusion, which results for example in the infamous gray rectangles I hope most designers now know to avoid.\n\nLet me ask this: would it be shocking if Ive really doesn't get typography? But I don't believe in demonizing individuals; it's the \"process\" that gives a celebrity a job he can't handle that's the real culprit.\n\nhhp\n\n"
    },
    {
      "time": "19 Jun 2013 — 8:45pm",
      "content": "Wait...hold on...slow down. Are you saying there's a lot of people complaining about something Apple did?\n\n:)\n\n"
    },
    {
      "time": "19 Jun 2013 — 9:18pm",
      "content": "Certainly bigger targets cause more people to take shots. But, again, it's the _kind_ of people complaining that's telling (and encouraging for the future).\n\nAnd I don't think being flippant helps anything. It reminds me of the ~2 day period when, if you asked Siri \"What's the best smartphone?\" it would reply \"Nokia Lumia 900\", but then Apple hijacked that and got it to reply things like \"Are there other smartphones?\" :-/ Denial, flippant or not, is not honorable. Apple is just another underhanded, greedy corporation. It's not special. And that's my point. The reason _I_ complain is that casting Apple as some sort of savior saint -a perception no other tech company has ever had AFAIK- does a disservice to everybody.\n\nBut really, it's all about context: at least on Typophile, our loyalty to type should take precedence over loyalty to a brand. Denying that iOS7's typography is a regression only helps Apple shareholders, and only in the short term.\n\nhhp\n\n"
    },
    {
      "time": "19 Jun 2013 — 10:00pm",
      "content": "It's easy to forget that many Apple products got bad reviews from bloggers when first released. For example:\n\n• When Steve Jobs unveiled the first iMac, many bloggers were shocked that it didn't have a floppy drive (very unusual back then) and there were many outraged articles even at Apple fan sites.\n\n• That antenna problem with iPhones a few years ago led to many angry editorials, but it eventually blew over and the phone sold well. (I had one of those models and never had problems.)\n\n• When the iPad was first released, there were numerous editorials that no one would buy it because \"iPad\" sounded like a sanitary napkin. Seriously, some people were really upset; some of those articles can still be Googled. People also said it was ugly, or was just an oversized iPod Touch. But it went on to be a huge success.\n\nI agree that the new interface needs some work, but it's a beta for heaven's sake. And bloggers know that outraged articles about Apple get hits. Let's see how this all pans out when the tweaked version is released in the fall.\n\n"
    },
    {
      "time": "19 Jun 2013 — 10:13pm",
      "content": "Good points. However the antenna problem -something Nokia and Blackberry had actually made public technical knowledge long ago- shouldn't be minimized, especially since it was another Ive form-over-function manifestation; and it's certainly ironic that his pretty design ended up having to be hidden under gaudy third-party covers. Also concerning the antenna: it ended up exposing the deceptive way the iPhone's signal strength indicator was set up. It's all an issue of trust, and I for one can't get myself to develop any...\n\nOne other thing: I don't at all think market success equates to social merit.\n\nNow, if the release version of iOS7 is typographically improved, I mean improved _enough_, then to me that's actually even better than getting it right from the beginning, because it means Apple is listening.\n\nhhp\n\n"
    },
    {
      "time": "19 Jun 2013 — 11:31pm",
      "content": "It's so easy to get you riled up about Apple, hrant.\n\nAs for your complaints about the type, what are they? You've made plenty of silly obtuse jabs in this thread but I'm not even sure what your specific gripe is. Other than maybe you don't like Helvetica? Or Ive stole your lunch money in grade school?\n\nAnd if your gripe is Helvetica, that's valid. But that said, I don't think any underhanded, greedy corporations were brought to their knees due to choosing to use Helvetica.\n\nJust take solace in knowing that Apple will forever be going out of business in 6 months.\n\n"
    },
    {
      "time": "19 Jun 2013 — 11:35pm",
      "content": "Can I pop back to the original question? I recognise exactly what he's talking about, because I do think Helvetica Light/Ultra light is a typeface that's highly associated with a certain time period and aesthetic. It popped up circa 2000, often oversize and gradient-happy, on a lot of beauty products, hair salons, day spas and so on, certainly here in Stockholm. In fact, that's what I'd think of too when seeing that weight of Helvetica, just as the regular (and especially medium) one evokes swiss design or simple 60s signage.\n\n"
    },
    {
      "time": "19 Jun 2013 — 11:40pm",
      "content": "Yes, light weights of typefaces tend to be used heavily by the fashion and beauty industries.\n\n"
    },
    {
      "time": "20 Jun 2013 — 12:07am",
      "content": "@ Chris Dean, I am not a fan of how it is presented but it is not difficult for me to read, even at a cursory glance. I would hate to read a large body of text set in it but that is not an issue as most web content I look at is not rendered in it and I read iBooks in Georgia, Iowan or Athelas. Most things I read on screen are set in Verdana or Georgia and they are just dandy (for me)!\n\nWhat is currently bugging me is the very weak design of the battery symbol. I have no problem with flat design (done well) but at the moment it feels like there is an art director with a bunch of designers and developers interpreting a brief but with very different ideas about how to do that. It is in beta, granted but when I am in the camera, mail or note apps I feel like I am on completely different devices, sometimes at odds with each other. That lack of cohesion bugs me a lot.\n\n"
    },
    {
      "time": "20 Jun 2013 — 4:45am",
      "content": "“_…but it is not difficult for_ me _to read_.” What about _others_ who have poor vision? Or is this a personal project? For me, I’d like to be able to catch the date with as little as effort as possible, say, from the bottom of a purse in a dimly lit room while looking through the bottom portion of my glasses which creates a bit of distortion. Out of curiosity, why did you select ultra light and not bold?\n\nRe battery, outline/space between the outline and the colour seems too thin. Again, with less than perfect vision, it blurs together. Should be an absolutely easy instant glance. Have a look at the battery icon on your Mac OS (I am on 18.8.3). There are curved ends to elude to three dimensions. If you don’t care for 3D, and want to go flat, go flat and ditch your rounded corners entirely. Presently you appear to be sitting on the fence and have not made a confidant decision in to go in either direction.\n\nRegarding cohesion, I couldn’t comment unless I saw other screens.\n\n"
    },
    {
      "time": "20 Jun 2013 — 4:46am",
      "content": "What are the pixel dimensions of your buttons and the battery icon?\n\n"
    },
    {
      "time": "20 Jun 2013 — 6:30am",
      "content": "> tis a personal project?\n\nChris, why are you discussing this as if it is my choice? I did not design the UI and I do not work for Apple. I supplied a screen grab from the iOS7 beta running on my iPhone5 with a black background to show (anyone interested) what that contrast is like compared with publicity shots available elsewhere. I could not care less how this effects _your_ ability to view the screen from the bottom of your handbag, take that up with Apple.\n\nI have no say in Apple's UI design choices but display accessibility in general (excluding my personal requirements and preferences, which is all I have commented on) is very important to me.\n\n> Have a look at the battery icon on your Mac OS (I am on 18.8.3)\n\nImpressive beta access :-) I am currently only on 10.8.4 and spend more time than I would like looking at the battery icon and percentage, which are better than iOS7 but still far from pleasing.\n\n"
    },
    {
      "time": "20 Jun 2013 — 6:46am",
      "content": "> Presently you appear to be sitting on the fence and have not made a confidant decision in to go in either direction.\n\nYou have the wrong end of the fence but that aside, if I was designing a UI, this is the direction I would take with the battery icons, along with optional text to indicate either the percentage or time remaining.\n\n ![](http://web.archive.org/web/20140804122859im_/http:/typophile.com/files/BatteryIcons_3543.jpg)\n\n"
    },
    {
      "time": "20 Jun 2013 — 9:26am",
      "content": "I demand a Jailbroken stark black and white blackletter UI for IOS7.\n\n"
    },
    {
      "time": "21 Jun 2013 — 8:11am",
      "content": "I actually have no problem with the other changes in iOS 7, from what I have seen.\n\nBut I have never appreciated the iOS use of Helvetica, and this looks to make my biggest iOS issue slightly worse, so I am griping.\n\n"
    },
    {
      "time": "9 Jul 2013 — 9:34pm",
      "content": "Apple has apparently listened to user feedback about small text being too light. In the latest iOS beta, they are now using Helvetica Neue instead of Helvetica Neue Light. Only large heads still use the lighter weight.\n\n"
    },
    {
      "time": "9 Jul 2013 — 9:38pm",
      "content": "In fact a two-weight-step correction! Good news indeed, on at least two fronts.\n\nhhp\n\n"
    },
    {
      "time": "10 Jul 2013 — 5:20am",
      "content": "Another shit-storm in a teapot avoided before a non-user went berserk.\n\nJames: In fact, there is a new typographic feature in iOS 7 called \"Dynamic Type\". The claims include \"automatically adjusting font-weight, letter-spacing and leading for each font size.\" So this \"Top Level\", UI stuff, with subtle weight changes \"on request\", seems like the tip of an iceberg we can all find coolness in, assuming we're users.\n\nOverly light type is so serious a problem in other places, it's been spawning reading studies at the speed of blight. So, maybe this development can once again lead the way to efforts elsewhere.\n\n"
    },
    {
      "time": "10 Jul 2013 — 7:32am",
      "content": "Yes, thousands of actual users who don't suffer from blinding brand loyalty -including people like Erik Spiekermann- can never be more right than Apple divine. And especially not Apple's keen fashion sense! Bow down!\n\nHey, you know what would be a popcorn-worthy, heartrending light-show? If somebody harped on Apple to get them to commission a proper custom solution from Font Bureau...\n\nSad to watch this self-subversion of intellect.\n\nIn contrast:  \n [http://venturebeat.com/2013/07/09/apple-fontgate-ends-with-thicker-helve...](http://web.archive.org/web/20140804122859/http:/venturebeat.com/2013/07/09/apple-fontgate-ends-with-thicker-helvetica-neue-in-ios-7-beta-3/#erWMTTrcKFz8s1c8.02 \"http://venturebeat.com/2013/07/09/apple-fontgate-ends-with-thicker-helvetica-neue-in-ios-7-beta-3/#erWMTTrcKFz8s1c8.02\")\n\nhhp\n\n"
    },
    {
      "time": "10 Jul 2013 — 8:19am",
      "content": "David, yes dynamic type looks interesting. Apparently you'll also be able to increase or decrease the default font size in Settings, which currently affects only Apple apps but under the new iOS will also affect 3rd-party apps which support dynamic type.\n\n"
    }
  ]
}
