{
  "id": "103831",
  "title": "Help with a really black didone",
  "forum": "Serif",
  "tags": [
    "bold",
    "boldest",
    "didone",
    "Officina Bodoni",
    "Roman",
    "Serif"
  ],
  "content": "Hello friends!  \nI'm writing because I feel I'm lost with my project.  \nI need your eyes here, because I'm tired of trying things and it seems this font has no solution.\n\nI want to make \"the boldest\" didone out there, so I started experimenting and this was my result.\n\n ![](http://web.archive.org/web/20150317190600im_/http:/typophile.com/files/help_boldest_5629.png)\n\nThe problem is that some letters (ie the \"e\" or the \"v\" etc) don't work in small sizes.  \nIn the lowest part of the image I wrote \"Mexico and Pistilli\" So you can see what I mean.  \nPistilli turns really black (and that's what I want) but Mexico has so many white space between letters that it drives me crazy.\n\nIs there something you suggest?  \nI tried making the stems of those \"open\" letters bolder, but it seems it's not the solution.\n\nAny referent?\n\nThanks!  \nMax\n\n",
  "author": "maxispr",
  "time": "13 Jun 2013 — 9:25am",
  "uid": "34955",
  "comments": [
    {
      "time": "13 Jun 2013 — 9:37am",
      "content": "This is quite juicy!\n\n> some letters (ie the \"e\" or the \"v\" etc) don't work in small sizes.\n\nWell yeah.  \nThe \"solution\"? It would be like curing the king's headache by chopping off his head.\n\nhhp\n\n"
    },
    {
      "time": "13 Jun 2013 — 10:16am",
      "content": "Thanks hrant;  \nYes, it's not easy to see a solution here. I also can't find too many referents, no more than one ore two, which actually are not this black.  \nEven in Bodoni Poster (Adobe)  \n [http://www.myfonts.com/fonts/adobe/bodoni-poster/](http://web.archive.org/web/20150317190600/http:/www.myfonts.com/fonts/adobe/bodoni-poster/ \"http://www.myfonts.com/fonts/adobe/bodoni-poster/\")  \nIf you write Pistilli - Mexico, there's difference of weight between the words... Am I too crazy?\n\n"
    },
    {
      "time": "13 Jun 2013 — 11:47am",
      "content": "Tough problem indeed. I do think that in the case of the word “beautiful”, the “a” in the lower example works much better than the upper.  \nWith “pistilli”, in a didone typeface I'm working on I increased the spacing between the letter pairs ll, lh, and lb by kerning them. I think that could be done here slightly, to keep a more even texture if you want.\n\n"
    },
    {
      "time": "13 Jun 2013 — 8:20pm",
      "content": "Thanks guys.\n\n ![](http://web.archive.org/web/20150317190600im_/http:/typophile.com/files/LeDame_5816.png)\n\nNow I've got this question.  \nWhich of these CAPS do you think that work better?  \ntaller medium shorter?\n\n"
    },
    {
      "time": "14 Jun 2013 — 8:33pm",
      "content": "Not certain that one stands out, though I prefer the taller caps. They seem more impactful at these display sizes.\n\n"
    },
    {
      "time": "22 Jun 2013 — 10:31pm",
      "content": "Agreed.\n\n"
    },
    {
      "time": "22 Jun 2013 — 10:45pm",
      "content": "I'd vote medium.\n\n"
    },
    {
      "time": "22 Jun 2013 — 10:45pm",
      "content": "(Double post)\n\n"
    },
    {
      "time": "17 Dec 2014 — 9:06am",
      "content": "Did you ever finish this? Would love to use it.\n\n"
    }
  ]
}
