{
  "id": "103997",
  "title": "Thin Slab Serifs",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey all,\n\nHaving an intense conversation with a client on the legibility of thin slab serifs.  \nCurrently looking for as many good (well-known) examples of brands that use them i their identity for several outcomes (print, UI,...)\n\nFor example:  \nArcher thin for Martha Stewart  \nVogue Brazil hairline  \n...\n\nAny you can think of would be a tremendous help!  \nTIA!!!\n\n",
  "author": "mr_ampersand",
  "time": "20 Jun 2013 — 7:37pm",
  "uid": "3761",
  "comments": [
    {
      "time": "20 Jun 2013 — 7:59pm",
      "content": "Well, The H&FJ Sentinel family has a \"light,\" don't know if that's thin enough. A plus is it's a slab with a true italic...\n\n[http://www.typography.com/fonts/font\\_styles.php?productLineID=100034](http://web.archive.org/web/20130820161340/http:/www.typography.com/fonts/font_styles.php?productLineID=100034 \"http://www.typography.com/fonts/font\\_styles.php?productLineID=100034\")\n\n"
    },
    {
      "time": "20 Jun 2013 — 8:20pm",
      "content": "Sorry if I was not clear. I am not looking for thin or hairline fonts. I am looking for (famous) examples of those fonts in use.\n\n"
    },
    {
      "time": "22 Jun 2013 — 8:42am",
      "content": "If you're client is saying that any thin font is bad for reading (I mean more than a lines) then he's right. Showing examples of mistakes shouldn't change anybody's mind. Big mama Apple uses an Ultra Light now. Does that make it OK?\n\nhhp\n\n"
    },
    {
      "time": "22 Jun 2013 — 2:50pm",
      "content": "I suspect your argument is really about whether the importance of \"legibility\" is uniform and universal. Just because you wouldn't want to read a novel in it doesn't mean it can't be the right tool for the job. In something like a fashion magazine, the impact of the photographs is most important. Very light type for headlines and mastheads sacrifices some small measure of how _quickly_ they can be read, to the purpose of drawing less attention away from the pictures. And then there's the positive thematic impressions of lightness and thinness, of course. As long as people _can_ read it, nothing is really lost.\n\n(Apple has made a similar choice because they also think pictures are much more important than words for a computer interface, and _this_ is where they're bed-shttingly wrong.)\n\nThe subtext of \"I'm worried people will find it hard to read\" is often \"I mean of course I know what it says... but other people are dumber than me. We want to reach even the most illiterate people.\" If your client is one of those who think every desirable quality can be absolutely maximized without regard to how the elements interact, you're in for an unpleasant time. That's the point where you have to give up on persuasion and either assert that you're the expert or concede that they're the boss.\n\n"
    },
    {
      "time": "22 Jun 2013 — 2:55pm",
      "content": "It's worse than that: Apple thinks pictures (and music) are much more important than words, _period._\n\nI certainly agree that legibility can be -and often is- overplayed. I guess we need to know how much text is involved (and how it's presented).\n\nhhp\n\n"
    }
  ]
}
