{
  "id": "103914",
  "title": "New display font : Desperation",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hi Everyone\n\nThis is both my first comment and first real effort at creating a usable display font.\n\nThere wasn't any real inspiration or plan to start this project, it just kind of happened then took momentum once I created a few letters. If I had to describe it I would say it is angular but also subtle at the same time if that makes sense :). Any advice would be welcome and I know all the terms used involving type. The angular 'crossbars' seem to be working but I've been looking at these letters for so long I can't decide what works and what doesn't anymore.\n\nI've decided to create only the upper case to see if it is well received then if I feel it has room to grow I will create the lower case, numbers and maybe other versions of the 'Desperation' type face.\n\nBe as hard as you want as I've worked on this too long for it to contain any glitches.\n\nMany thanks and love this forum, it has provided many hours of reading.\n\n ![](http://web.archive.org/web/20150317192840im_/http:/typophile.com/files/desperation_4274.jpg)\n\n",
  "author": "DarrenReay",
  "time": "17 Jun 2013 — 11:11am",
  "uid": "212345",
  "comments": [
    {
      "time": "17 Jun 2013 — 11:26am",
      "content": "p.s. I found this site from this brilliant article  \n [http://ilovetypography.com/2009/03/23/the-first-ones-the-hardest/](http://web.archive.org/web/20150317192840/http:/ilovetypography.com/2009/03/23/the-first-ones-the-hardest/ \"http://ilovetypography.com/2009/03/23/the-first-ones-the-hardest/\")\n\n"
    },
    {
      "time": "17 Jun 2013 — 11:37am",
      "content": "I like the concept and it's carried through pretty well.  \nTop terminal of /C/ comes down too far.  \nI wonder if there's a different structure of /S/ that might fit the concept better - maybe something with a spine that straightens out for a stretch, diagonally.  \nThe breaks from straights to curves are always a tough thing for me: if they adhere too much to simple geometry (e.g. a semicircle arc attached directly to a straight stem) the transition can look not smooth enough, as I think is the case here. So you get, for example, four little \"corners\" in the joining parts of the counter of /O/.  \nOn /M/W/ (and /N/?) it might be worth trying the traditional thin-upstrokes/thick-downstrokes alternating pattern instead of keeping the verticals thickest as you have.\n\n"
    },
    {
      "time": "17 Jun 2013 — 11:46am",
      "content": "The one thing I like about this is the dichotomy of the flat bottoms and the angled tops.\n\nI would dump the small protrusions though.\n\nhhp\n\n"
    },
    {
      "time": "17 Jun 2013 — 1:18pm",
      "content": "Thanks to the both of you for your quick replies, it is very much appreciated.\n\n@eliason the point about the curves and simple geometry shapes is something that definitely needs to be worked on, something I think is going to take a lot of playing around with. At the same time though it is something I'm going to have to do at some point as the lowercase font will no doubt contain a lot more curves.\n\nAlso, the M, N, W were the 3 letters that caused me the most hassle so yeah, I 100% they need working on.\n\n@hrant The reason the small protrusions are still in this type face is due to the fact they were the first elements introduced to the designs and have just been carried through to the later designs. I think I was afraid the original designs would get lost if they were removed but I have realised the font can carry itself with other angular elements. They do look a bit awkward now and I may need to take a closer look to what the font will look like without them.\n\nI'll update you with the changes when done.\n\n"
    },
    {
      "time": "19 Jun 2013 — 6:46am",
      "content": "Again thanks for the advice, from your comments I have made the following changes.\n\nCurves blend in more with the stems. This has been achieved by opening up the width of letters with rounded bodies. It gives the whole font a more natural feel and less geometric IMO.\n\nThe angles of the cross bars have been reduced to give them a more subtle feel.\n\nThe 'M' 'N' 'W' have been balanced out.\n\nThe 'Z' have become more pointed to blend in better with the rest of the font.\n\nThe crossbar of the 'S' has more of an angle.\n\nLastly, the protrusions have been removed as they weren't really needed anymore due to the fact the other angular elements help to carry this font forward.\n\nDoes everyone feel I'm moving in the right direction with this from the first designs?\n\n[desperation.jpg](http://web.archive.org/web/20150317192840/https:/www.dropbox.com/s/6dipb6939kp1zma/desperation.jpg)\n\n"
    },
    {
      "time": "19 Jun 2013 — 9:09am",
      "content": "I like the slanted terminals. But overall, it all feels rather stiff. The angles are trying to be playful, but the overall structures are still rather rigid.\n\nSo maybe have all the glyphs stand up and 'shake it out' and loosen up a bit. See what happens.\n\n"
    },
    {
      "time": "19 Jun 2013 — 9:13am",
      "content": "That Z is good.  \nI kinda miss the protrusions - is this now overnormalized?  \nStraight-curve transitions are definitely improved.  \nAnother option to consider for /N/M/W/ is rounded humps rather than angles (i.e. a more lowercase form for N, like an upside down U with a corner top left).\n\n"
    },
    {
      "time": "19 Jun 2013 — 9:18am",
      "content": "This thing is looking like a wild stallion - hell to tame, but if you do, awesome.\n\nhhp\n\n"
    },
    {
      "time": "19 Jun 2013 — 11:19am",
      "content": "@hrant haha, I would like to call it something a bit more vulgar at this moment. It is really frustrating. I take my hat off to designers who create fonts that work.\n\n@eliason yeah, I was thinking it was a bit normal now. I think I'm going to creat a set with and without the protrusions. See what people think. In my original drawings on graph paper I had the M an W rounded but quickly discarded that idea, maybe I should of spent a bit more time working on them. Ill have a play around with that again I think.\n\n@aluminium, if you think it is stiff now you should of seen my first drafts on graph paper, I was using a ruler and compass to create the letter forms. In general the kind of work I create it is thought out and planned with measurements and everything, I'm finding it hard to be a bit loose at the minute but I think once I get to a stage, with a few of the letters, I feel comfortable with I think it should all click into place. Hopefully :-/\n\nI'll keep you all updated once I've made changes.\n\nMany thanks\n\nDarren\n\n"
    },
    {
      "time": "26 Jun 2013 — 7:00am",
      "content": "Hi again\n\nMore changes to 'desperation' to share\n\nI've tried not to be too cute with the angles of the crossbars. I've pretty much copied and pasted elements together to make them work and luckily I feel it has unified the uppercase together.\n\nI've slightly changed the thickness of the strokes to make it feel lighter. This also made the angles more noticeable.\n\nThe 'M' and the 'W' are probably the biggest changes I've made.\n\nI'm now in the process of creating a lowercase and numbers.\n\nPlease let me know what you think.\n\nMany many many thanks\n\nDarren\n\n[desperation.pdf](http://web.archive.org/web/20150317192840/https:/www.dropbox.com/s/x0etyiu21h6q5hq/FONT.pdf)\n\n"
    }
  ]
}
