{
  "id": "103998",
  "title": "A Scotch-inspired transitional",
  "forum": "Serif",
  "tags": [
    "Scotch Roman",
    "Serif",
    "transitional",
    "Victorian"
  ],
  "content": "Over the last year or so I've grown quite interested in (roughly) nineteenth-century face styles around the Bell, Oxford/Monticello and Scotch Roman evolutionary tree. For a while now I've been working on designing a typeface based on some of the ideas I've had along these lines.\n\nW.A. Dwiggins famously set out to tame Scotch Roman by blending it with modern features from William Martin's work, resulting in Caledonia. I wanted to try moving in arguably the opposite direction: exploring the possibilities found in Scotch's immediate precedents among the transitional types.\n\nThis is what I've come up with. I took some basic ideas from Scotch and Bell and tried to create something with a crisp and rational structure but a touch of nineteenth-century ornamentation.\n\nI haven't settled on a final name for it yet. For the time being I've dubbed it 'Alexandrina' because it strikes me as vaguely Victorian. (A nod to any who get the reference.)\n\n ![](http://web.archive.org/web/20150417090035im_/http:/typophile.com/files/alexandrina_5136.png)\n\nI'm basically aiming for something that's good for captions and relatively short snippets of text, but could be used more generally without causing serious problems. I think it probably works best at around 12-15 point.\n\nI have alternate versions of /f, /g, and /t which I'm thinking should be made default at 12 point size and below. (The last paragraph in the PDF shows the use of these alternates in a 12-point paragraph.)\n\nI'm still not sure about a few points...\n\n- I'm not sure if the ampersand works. It looked nice when I sketched it on paper, but after creating the outline I'm not so convinced.\n- I'm not happy about the @ sign... not only is it pretty generic but I don't think it's all that well drawn. (This is by far the hardest character for me to draw, as a rule.)\n- The numbers need a bit more work still.\n- I think some of the symbols are probably a bit too light.\n\nAny thoughts?\n\nThanks...\n\n| Attachment | Size |\n| --- | --- |\n| [alexandrina130620.pdf](http://web.archive.org/web/20150417090035/http:/typophile.com/files/alexandrina130620.pdf) | 31.29 KB |\n\n",
  "author": "altsan",
  "time": "20 Jun 2013 — 7:53pm",
  "uid": "192788",
  "comments": [
    {
      "time": "20 Jun 2013 — 8:36pm",
      "content": "/c/ and /o/ seem very round and wide--what's their relationship to bowled letters like /d/?  \n/4/ is too dark.  \nTop serif of /C/G/ is too light. Middle arm of /E/F/ might be a touch too long.  \nAmpersand is not bad but could perhaps be stiffened up a bit somehow.\n\n"
    },
    {
      "time": "28 Jun 2013 — 7:53pm",
      "content": "@eliason You're probably correct about the caps, thanks. I know /4 isn't right yet, I've already lightened it some but I will have to go further. (The crossbar is actually thinner than the /2 base, it just looks darker next to the heavy stem. Need to revisit some of what's going on there.)\n\n/o is slightly narrower than /b /d if you include the serifs in the calculation. The curve itself is broader but I happen to like the way it looks. Do you think it's a real problem, or just unexpected?\n\nRe ampersand, I may end up pointing the terminal to the right instead (it should help with the awkward spacing issues the character currently has).\n\nThanks for the feedback!\n\n"
    },
    {
      "time": "21 Jun 2013 — 3:32pm",
      "content": "On those round lowercase letters, don't think about glyph width but rather the width of the counter. I suspect when your /c/o/ is next to /b/d/p/q/, the former will look too wide or the latter too narrow, unless you make those counters closer to each other in area.\n\n"
    },
    {
      "time": "21 Jun 2013 — 8:24pm",
      "content": "Ah, yes. I do see what you mean. I'd thought there was something faintly 'off' in words like \"tempore\" and \"dolores\" but I was hung up on trying to fine-tune the letter spacing...\n\nThis is exactly why it's good (esp. for a neophyte like me) to have other eyes on it. :) Thanks.\n\n"
    },
    {
      "time": "27 Jun 2013 — 7:54pm",
      "content": "Several characters modified along the lines discussed.\n\n ![](http://web.archive.org/web/20150417090035im_/http:/typophile.com/files/alexandrina1_4073.png)\n\nI do think the changed ampersand works better. I've also lightened /4 and tweaked a couple of other numerals.\n\nThe appearance of text is indeed somewhat improved. I'll see if I can upload an updated PDF somewhere when I get the chance (can't seem to add attachments to threads anymore).\n\n"
    },
    {
      "time": "28 Jun 2013 — 5:10am",
      "content": "The triangular spurs on {b q} strike me as a bit jarring among the otherwise quite organic forms. Maybe give it an ever so slight concave curve? And/or a finite-width point?\n\n"
    },
    {
      "time": "28 Jun 2013 — 9:54am",
      "content": "Those proportions are starting to click.  \nNow I would reconsider the serif-length. Upper- and lowercase serifs don't have to match, but maybe they should be a little closer to each other than you have here.  \nAlso, watch for where too much bracketing is creating black spots in the capitals, perhaps in places like inside lower left of D and E and inside lower right of K, and definitely in the interior acute serif angles of the thick stroke of X. I'd just try a \"smaller radius\" curve in those spots (with the K you could try a one-sided serif or other terminal for the leg).  \nYou might have too much overshoot (see the bottom of the stem vs. the bowl of /d/).\n\n"
    },
    {
      "time": "28 Jun 2013 — 7:59pm",
      "content": "@eliason Yes, I find overshoot a bit tricky to calculate optimally. I'll take another look at those. I'm also glad you commented on the inside curve of /B /D /E: I'd been wondering about that myself, so the fact that somebody else shares my concern is a good sign that it does need adjusting. :)\n\nI was also wondering about the lowercase serif length earlier today, although I'm concerned about preserving good text readability. (I may yet decide to fork this into separate display & text versions, but I'm still undecided.)\n\n@Catharsis Something closer to what the spur on /G does, perhaps... e.g. something like the following (blue = existing, black = suggested), maybe?\n\n ![](http://web.archive.org/web/20150417090035im_/http:/typophile.com/files/alexandrina2_5096.png)\n\nThanks to both of you for the helpful feedback!\n\n"
    },
    {
      "time": "1 Jul 2013 — 11:14am",
      "content": "Much better! :)\n\n"
    },
    {
      "time": "3 Jul 2013 — 8:33am",
      "content": "Besides the /b /q and /& changes noted above, I've lightened the bracketing slightly in /B /D /E.\n\nI've also shortened the horizontal serifs on the uppercase by around 10-15%. I'm debating whether or not to lengthen the lowercase ones slightly as well.\n\nI've lightened /4 a little, although I'm aware that it (and the numbers in general) still needs more work.\n\nDoes anyone think the /a is too narrow? It looks fine on screen, and at display size, but when I print it out at text size it looks awkwardly narrow next to the /e when the two appear together. I'm not sure if that's just my printer, though.\n\n[http://www.altsan.org/creative/fonts/alexandrina130703.pdf](http://web.archive.org/web/20150417090035/http:/www.altsan.org/creative/fonts/alexandrina130703.pdf \"http://www.altsan.org/creative/fonts/alexandrina130703.pdf\")\n\n"
    },
    {
      "time": "4 Feb 2014 — 8:16am",
      "content": "I've done an extensive overhaul on this face. I decided it was time to split it off into separate display and text versions. Since I'm generally more interested in text faces, I decided to tackle that version first.\n\n[http://www.altsan.org/creative/fonts/alexandrinabk140131.pdf](http://web.archive.org/web/20150417090035/http:/www.altsan.org/creative/fonts/alexandrinabk140131.pdf \"http://www.altsan.org/creative/fonts/alexandrinabk140131.pdf\")\n\nThe glyph shapes have been modified to work better at smaller sizes. The overall contrast has been reduced and the transitions softened. Descenders are shorter, and old-style figures are now the default.\n\n ![](http://web.archive.org/web/20150417090035im_/http:/typophile.com/files/Aldra_Bk1_3853.png)\n  \n\n ![](http://web.archive.org/web/20150417090035im_/http:/typophile.com/files/Aldra_Bk2_3821.png)\n\nComments welcome. In particular, how is the overall readability?\n\n"
    },
    {
      "time": "4 Feb 2014 — 8:27am",
      "content": "Small sizes? The x-height is probably too modest for that (and the descenders still too long).\n\nhhp\n\n"
    },
    {
      "time": "6 Feb 2014 — 5:34am",
      "content": "@Hrant: Yeah, it's a valid point about the x-height. Taking a look at that will probably be the next step.  \nThanks!\n\nI think the basic design is reasonably sound though...\n\n"
    }
  ]
}
