{
  "id": "103979",
  "title": "Whats the story of \"future\"-Fonts like for example \"FF Qtype\" or \"Space Colony\"?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everybody,\n\nfor my opinion there are masses of these fonts in use. Especially for Logo. Can anyone explain, why its so \"zeitgeisty\" to use these \"futuristic\" fonts? And what about the history? Its all from the beginning of computer technology?\n\nThanks!\n\n",
  "author": "Richard_III",
  "time": "20 Jun 2013 — 5:35am",
  "uid": "212368",
  "comments": [
    {
      "time": "20 Jun 2013 — 6:43am",
      "content": "Well, we live in an age where technology has produced lots of fun and useful things, like radios, televisions, ball-point pens, nylon stockings, communications satellites, non-stick frying pans, and, last but not least, personal computers and even smartphones.\n\nSo, technology being seen as virtuous, advertisers seek to associate their products with this beloved source of boons.\n\n"
    },
    {
      "time": "20 Jun 2013 — 7:26am",
      "content": "Typefaces like FF QType were already designed in the Dessau Bauhaus, during De Stijl period etc. so their history starts clearly before computers were en vogue.\n\n"
    },
    {
      "time": "20 Jun 2013 — 8:00am",
      "content": "Hi, Im not a Font-Expert, its interesting to look at Bauhaus Fonts and compare it with this \"futuristic\" Fonts.\n\n"
    },
    {
      "time": "20 Jun 2013 — 8:39am",
      "content": "\"Futura\", the canonical 'futuristic font', was designed \"in the summer of 1924\" ( [http://people.ku.edu/~delange/paulrenner.html](http://web.archive.org/web/20130820183011/http:/people.ku.edu/~delange/paulrenner.html \"http://people.ku.edu/~delange/paulrenner.html\")).\n\nFrom that article:\n\n> ... it became a cornerstone of the “New Typography” classified as Geometrical Modernism, form follows function became the key words and careful reasoning constrained all the character shapes to their utmost functional simplicity.\n\nSo apparently 'simplicity' is linked to 'futuristic'. Looking at FF QType, its design reminds me of 1970s computer monitors: straight lines (or only very subtly curved), with round corners. Could that be the subliminal link?\n\n\"Space Colony\" appears built with simple primitives, in an almost pixel-like fashion. Early 1960s futuristic fonts such as ITC's [Countdown](http://web.archive.org/web/20130820183011/http:/www.fontshop.com/fonts/family/countdown_itc/) (1965) show similar characteristics.\n\nNow high-res screens have become available we might next see a backlash to classic serifed fonts -- just because it is possible :-)\n\n"
    },
    {
      "time": "20 Jun 2013 — 2:44pm",
      "content": "![]()http://astroprofspage.com/wp-content/uploads/2008/10/800px-nasa\\_worm\\_logo.png\n\nCertain important logos help set the tone! Conceptually, unbroken curves suggest aerodymanics and speed, which go hand-in-hand with \"the future.\" which make them a perennial favorite for that purpose.\n\nFonts more closely with specific technologies often look dated - the opposite of futuristic - after several years. I don't think anyone would call this: [http://www.fonts.com/font/monotype/computer](http://web.archive.org/web/20130820183011/http:/www.fonts.com/font/monotype/computer \"http://www.fonts.com/font/monotype/computer\") futuristic, but at one time it certainly seemed that way.\n\n"
    },
    {
      "time": "20 Jun 2013 — 5:50pm",
      "content": "When I think of \"futuristic fonts\", this is the first one I think of:\n\n[http://www.identifont.com/show?374](http://web.archive.org/web/20130820183011/http:/www.identifont.com/show?374)\n\nbut many people think that we should abandon using it... perhaps \"in the name of love\".\n\n"
    },
    {
      "time": "20 Jun 2013 — 7:08pm",
      "content": "Many futuristic fonts — especially in movies —&nbsp;are rather gimmicky, designed to look cool and different, but are unlikely to actually be used much in the future. One exception that comes to mind is 2001: A Space Odyssey, in which Kubrick resisted the urge to use \"futuristic\" fonts.\n\n ![](http://web.archive.org/web/20130820183011im_/http:/typophile.com/files/2001_5460.jpg)\n\n"
    },
    {
      "time": "21 Jun 2013 — 4:50am",
      "content": "Not _completely_. The numbers 1, 2, 3, 4... which label the steps in the instructions are in a (somewhat) \"futuristic\" typeface; Microgramma, I believe.\n\nAs for the rest, the typeface _is_ sans-serif, in fact, a geometric sans-serif (Futura!) so, while the typeface is conventional, it still avoids being _too_ traditional.\n\n"
    }
  ]
}
