{
  "id": "103925",
  "title": "Font ID Help :) It looks a common one, but couldn't find out.",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hello, I am gonna use this font for something in a design, at least I plan to :)  \nHowever, I don't recognize this one. And I'm no expert in such font-ID'ing :p\n\nMay you please help me with it. Thanks.  \nHere is the link to the image:  \n [http://www.metu.edu.tr/themes/odtu/images/odtu-lang-en.png](http://web.archive.org/web/20131018224725/http:/www.metu.edu.tr/themes/odtu/images/odtu-lang-en.png \"http://www.metu.edu.tr/themes/odtu/images/odtu-lang-en.png\")\n\nKind regards,  \nİlke.\n\n",
  "author": "illkeyone",
  "time": "18 Jun 2013 — 5:33am",
  "uid": "212361",
  "comments": [
    {
      "time": "18 Jun 2013 — 6:59am",
      "content": "[Bourgeois](http://web.archive.org/web/20131018224725/http:/www.myfonts.com/fonts/virusfonts/bourgeois)\n\n"
    },
    {
      "time": "18 Jun 2013 — 7:42am",
      "content": "How do you guys find such things? :)  \nI mean, is it just experience (which I think is the awesomely important thing) and the relation to the font-business ( if it is called so ), or is there a way/method? =)\n\nThanks a lot, really.\n\nİlke.\n\n"
    },
    {
      "time": "18 Jun 2013 — 11:35am",
      "content": "Both for me. In this case, /N was the key point, I instantly recognized Bourgeois.\n\n"
    },
    {
      "time": "18 Jun 2013 — 11:17am",
      "content": "I expect everyone who does font IDs has their own methods. The more fonts you have seen the more you will immediately recognize the style of a font, which helps to focus your attention. It helps if the sample includes some letters that often have distinct earmarks, as in this case where the N cross stroke does not reach to the bottom of the rhs stroke. Some other distinctive letters are the lower case g, uppercase Q, capital R, capital G, k etc. Try to identify the context of the sample: music, book cover, woodtype, monument etc. and when it was made. Do a special check of foundries that have an interest in particular themes, e.g. SciFi/Techno at Iconian, Retro 1950s at Font Diner, Fancy Victorian at Font Mesa. Give some thought to font makers that that do not show up at MyFonts, Identifont and Dafont. Tags & categories recognized by search engines, from Google, Identifont, MyFonts to individual foundries can help. Be aware of the best of new fonts lists that can be checked. Anyone can play the game. No need to have a relation to the font business, although if you have made fonts it really increases your attention to details. Admit when you have misread the image--mistakes are guaranteed to happen!  \nDon\n\n"
    }
  ]
}
