{
  "id": "103996",
  "title": "Font licensing questions",
  "forum": "General Discussions",
  "tags": [
    "ebooks",
    "font licensing",
    "General Discussions",
    "web publishing"
  ],
  "content": "I have been searching around and trying to confirm a few things that I \\*think\\* I know but it's all somewhat confusing to me:\n\n- My client wants to publish an ebook, which will actually just be a PDF displayed online (rather than a Kindle ebook, etc.). It would likely be downloaded by others, though, for a fee. They would get access to the PDF both online and offline (if they purchase it). We haven't chosen a font, but will probably go with a standard system font (minion, myriad, etc.). Assuming i do go with a system font, are we covered legally to use the typeface in this way?\n\n- Am I correct in telling the client that if we use a system font (say, minion), and they have it on their computer as well, they may also use it for their further commercial purposes without worrying about getting a license? I understand that a license would come into play only if they did NOT have the font on their computer.\n\n- What about for web use? if we wanted to use a standard font like minion for their website, would we need a separate license? I'm not a web designer -- I focus on static graphics -- but if they hire a web designer later, I want to make sure they can still follow their style guide, which by that point will be suggesting specific fonts to use.\n\n",
  "author": "Kejtia13",
  "time": "20 Jun 2013 — 4:51pm",
  "uid": "212435",
  "comments": [
    {
      "time": "20 Jun 2013 — 5:33pm",
      "content": "To use a font to create something, you need a license for it. If you purchase an operating system, that will include the licenses for the fonts that come with it.\n\nSo you are good there.\n\nSome fonts require that you pay for an additional and/or different license if you plan on using the font embedded within a PDF. Someone else will have to verify, but I believe there is no PDF embedding restrictions on any system fonts that I know of.\n\nSo I think you are good there too.\n\nFor the web, if you plan on using a system font, then you can (hopefully) assume most of your web site visitors will have that same font on their own system, so you're good there. If it's not a common system font, however, you may need to get a separate/additional license to use it as a web font.\n\n"
    },
    {
      "time": "20 Jun 2013 — 6:20pm",
      "content": "1. Minion and Myriad are not system fonts on any system that I know of.  \n2. Minion Pro and Myriad Pro are fonts of the Adobe Type Library and according Adobe's statement on [font embedding permissions](http://web.archive.org/web/20141109141206/http:/www.adobe.com/products/type/font-licensing/font-embedding-permissions.html), they may be embedded in PDF files.\n\n"
    },
    {
      "time": "20 Jun 2013 — 10:32pm",
      "content": "Aluminum and Michel - thank you both - this is pretty straightforward and seems to conform with what I have also read. Thanks!!\n\n"
    },
    {
      "time": "20 Jun 2013 — 10:41pm",
      "content": "Minion and Myriad are application fonts installed at the system level (/Library/Fonts on Macs and C:\\Windows\\Fonts on Windows) with Adobe software such as InDesign. If you want to use them in web content you can license optimised web font versions through [Adobe's Typekit service](http://web.archive.org/web/20141109141206/http:/typophile.com/wiki/https%3A/%252Ftypekit.com/).\n\n"
    },
    {
      "time": "21 Jun 2013 — 5:39am",
      "content": "Here is a link that works for Adobe Web fonts, [http://www.adobe.com/products/webfont.html](http://web.archive.org/web/20141109141206/http:/www.adobe.com/products/webfont.html \"http://www.adobe.com/products/webfont.html\"), and to typekit.com [https://typekit.com](http://web.archive.org/web/20141109141206/https:/typekit.com/).\n\nThose web fonts virtually contain all the opentype tables (GPOS, GSUB) for the browser to properly position the characters, for example the diacritics used in linguistics web pages (they appear on top or at the bottom of letters; see for instance [http://en.wikipedia.org/wiki/Ipa#Consonants](http://web.archive.org/web/20141109141206/http:/en.wikipedia.org/wiki/Ipa#Consonants \"http://en.wikipedia.org/wiki/Ipa#Consonants\") with a good browser on a recent system). On the other hand, a pdf contains none of those tables. It is the application (inDesign etc) that positions the characters (be they in text or equations) using the tables in the font.\n\n"
    },
    {
      "time": "21 Jun 2013 — 5:44am",
      "content": "[to follow]\n\n"
    },
    {
      "time": "21 Jun 2013 — 6:51am",
      "content": "A more interesting example is the corresponding page in Hindi [http://hi.wikipedia.org/wiki/अन्तर्राष्ट्रीय\\_ध्वन्यात्मक\\_वर्णमाला](http://web.archive.org/web/20141109141206/http:/hi.wikipedia.org/wiki/%E0%A4%85%E0%A4%A8%E0%A5%8D%E0%A4%A4%E0%A4%B0%E0%A5%8D%E0%A4%B0%E0%A4%BE%E0%A4%B7%E0%A5%8D%E0%A4%9F%E0%A5%8D%E0%A4%B0%E0%A5%80%E0%A4%AF_%E0%A4%A7%E0%A5%8D%E0%A4%B5%E0%A4%A8%E0%A5%8D%E0%A4%AF%E0%A4%BE%E0%A4%A4%E0%A5%8D%E0%A4%AE%E0%A4%95_%E0%A4%B5%E0%A4%B0%E0%A5%8D%E0%A4%A3%E0%A4%AE%E0%A4%BE%E0%A4%B2%E0%A4%BE) where the font used to display the text in Hindi is LohitDevanagari, a web font (and properly displaying indic text requires the unicode tables). However, the phonetic tables in the text use no web font, they rely on fonts installed on the viewer's system (I get them in Arial). In fact, I don't know if there is any web font that can properly handle linguistics.\n\n"
    },
    {
      "time": "21 Jun 2013 — 12:31pm",
      "content": "From Adobe, I understand that there are no PDF embedding restrictions on their bundled fonts ( [http://forums.adobe.com/thread/843478](http://web.archive.org/web/20141109141206/http:/forums.adobe.com/thread/843478 \"http://forums.adobe.com/thread/843478\")). My clients want to use system fonts for their work documents, and they use PCs rather than macs, so I'm thinking of going with a few of the stand-bys that can be found in both systems; Lucida, Palatino, Tahoma, etc.\n\nI'm talking about using these as their \"company\" typefaces for PPTs, ebooks, workbooks, press releases, business cards, etc. Basically, the fonts one would find in their company style guide (which I'm going to create).\n\nIn that way, I assume we can work on our respective machines using fonts that we all have, and only purchase additional licenses if we want to use the fonts in a website, or other application not covered in the MS/Apple licenses for these system fonts. Hope I'm understanding all this right. Typography is a deep dive.\n\n"
    },
    {
      "time": "23 Jun 2013 — 1:57pm",
      "content": "Adobe is indeed quite clear. As for the fonts that come with Microsoft Office 2011 for the Mac (and that are installed in `/Library/Fonts/Microsoft`) the license (in the Microsoft Office folder) says: \"You may only embed fonts in content as permitted by the embedding restrictions in the fonts\". I checked and their embedding is at least \"Editable\" (i.e. `fsType = 0x0008`, cf [http://www.microsoft.com/typography/otspec/os2.htm#fst](http://web.archive.org/web/20141109141206/http:/www.microsoft.com/typography/otspec/os2.htm#fst \"http://www.microsoft.com/typography/otspec/os2.htm#fst\")) when not installable (`fsType=0x0000`). There is one exception, Engravers MT, that has bits 1, 2 and 3 of `fsType` all set, which falls outside their specs.\n\n"
    }
  ]
}
