{
  "id": "103915",
  "title": "Please Help - I think its a Western Font",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Help ID Font!!",
    "Type ID Board [OLD]"
  ],
  "content": "Need help finding this Sign Font as quickly as possible.\n\n ![](http://web.archive.org/web/20131018220256im_/http:/typophile.com/files/Chapter_3450.png)\n\n ![](http://web.archive.org/web/20131018220256im_/http:/typophile.com/files/chapter1_5205.jpg)\n\n",
  "author": "vandydavid",
  "time": "17 Jun 2013 — 12:09pm",
  "uid": "212348",
  "comments": [
    {
      "time": "17 Jun 2013 — 2:09pm",
      "content": "Looks like it might be based on something from [Letterhead Fonts](http://web.archive.org/web/20131018220256/http:/www.letterheadfonts.com/). If one of the typophiles does not suggest a name, you might consider visiting the Letterhead Fonts website and going through the catalog.  \nDon\n\n"
    },
    {
      "time": "17 Jun 2013 — 2:21pm",
      "content": "Thanks Don...I had gone through Letterhead Fonts. That was my first thought as well. No luck yet. If you come across something, please let mek know. Thanks Much!!\n\nDavid\n\n"
    },
    {
      "time": "17 Jun 2013 — 4:29pm",
      "content": "You're welcome.  \nAs for Letterhead, they had a many fonts released under their name that they no longer sell at their website. These fonts are now in limbo, endlessly downloaded but without any possible return to the designer. AFAIK, they were never released as \"free\" fonts. That being said, the design may be in one of these. Google will find them if you look.  \nThe lettering in the image is representative of fonts from the latter half of the 19th century, mini serifs & spurs being the main features of the basis for this lettering. To find it, or something close, a good strategy is to go though the revival & \"inspired by\" offerings, at MyFonts, Fontspring or elsewhere, of Intellecta Design, Font Mesa, Greater Albion Typefounders, Jeff Levine, and HiH. It could also be a revival from the Solo collection, by Solotype or somebody else.  \nIf you are in luck one of the typophiles is doing this already.  \nDon\n\n"
    },
    {
      "time": "19 Jun 2013 — 12:13pm",
      "content": "Thanks So Much Don...Huge Help!!\n\n"
    },
    {
      "time": "19 Jun 2013 — 12:57pm",
      "content": "You're welcome.  \nDon\n\n"
    }
  ]
}
