{
  "id": "103984",
  "title": "Download Over 8,600 Web Fonts from Linotype.com",
  "forum": "Home",
  "tags": [
    "desktop fonts",
    "font",
    "fonts",
    "Linotype",
    "monotype",
    "News",
    "web fonts",
    "webfonts"
  ],
  "content": " ![](http://web.archive.org/web/20150322034434im_/http:/typophile.com/files/Webfonts_edit_6735.jpg)\n\nDownload fonts - [http://bit.ly/17prSnJ](http://web.archive.org/web/20150322034434/http:/bit.ly/17prSnJ \"http://bit.ly/17prSnJ\")  \nRead press release - [http://bit.ly/19UIqUw](http://web.archive.org/web/20150322034434/http:/bit.ly/19UIqUw \"http://bit.ly/19UIqUw\")  \nLearn more here - [http://bit.ly/19UPi4g](http://web.archive.org/web/20150322034434/http:/bit.ly/19UPi4g \"http://bit.ly/19UPi4g\")\n\nMonotype has released more than 8,600 Web fonts on [Linotype.com](http://web.archive.org/web/20150322034434/http:/typophile.com/wiki/www.Linotype.com%20) , now available for download and self-hosting. Customers are also able to save 50 percent off the desktop version of a font when purchasing both the desktop and Web font versions.\n\nSome of the world’s most popular typefaces are from the Linotype® collection, such as the Helvetica®, Optima® and Trade Gothic® families. Today they’re available for both the Web and print from Linotype.com, along with selections from the Monotype® Libraries, which comprise collections from the company’s Monotype, Linotype, ITC®, Bitstream® and Ascender® foundry brands. Additional fonts, including selections from newly represented typeface foundries, are expected to be added on an ongoing basis.\n\nLinotype.com customers can now quickly access one of the most comprehensive selections of Web fonts and pay for only what’s needed. Pricing is based on page views, with no further payment required until the page view allowance is used up. Customers sign up for a minimum of 250,000 page views for all their registered Web domains. Web font pricing for the first 250,000 page views is based on the price of a desktop version of a font, with most priced at $29/€29 (including VAT) or less. Alternatively, customers can purchase a package of page views greater than 250,000, which decreases the price-per-page-view cost on a progressive scale. When page view allowances near completion, customers are notified. They can also check an online report, which lists page view activity per domain.\n\nWhen purchasing Web fonts, customers specify the character set of the fonts, which ensures that they provide the specific language support required or OpenType® features needed, such as discretionary ligatures, small caps and fractions. Customers then receive a kit that contains the fonts, which support all major Web browsers, files used for tracking page views, a CSS file for defining the fonts for use on Web pages, and instructions for adding the fonts to the customer’s server. Customers can return at any time to rebuild their kit should data be updated or if their character set requirements change. The range of Web fonts available on Linotype.com supports more than 40 languages or writing systems, including Latin-based/European languages, Cyrillic, Traditional Chinese, Simplified Chinese, Japanese, Korean, Thai, Arabic and Hebrew.\n\n",
  "author": "JLH",
  "time": "20 Jun 2013 — 7:49am",
  "uid": "30653",
  "comments": [

  ]
}
