{
  "id": "103956",
  "title": "International company logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nI am currently working on a logo design for a company that delivers high quality services for the petrol industry. They needed a logo with a modern feeling, making them feel established and safe to work with (as they are dealing with big numbers, that was a priority). The client wanted something with a helvetica-ish feeling, making them look professional and that they are operating worldwide.\n\nHere are some of the final concepts I am working on, I would be delighted to have your opinion on it :)\n\n| Attachment | Size |\n| --- | --- |\n| [raas prova copia.jpg](http://web.archive.org/web/20150419095417/http:/typophile.com/files/raas%20prova%20copia.jpg) | 1.1 MB |\n\n",
  "author": "cenerino54",
  "time": "19 Jun 2013 — 8:54am",
  "uid": "66925",
  "comments": [
    {
      "time": "19 Jun 2013 — 12:51pm",
      "content": "You've definitely achieved \"Helvetica-like\" and \"professional.\"\n\nThe middle version, with the italicized \"international,\" has the most contrast (big-small, Roman-italic). Make sure that \"international\" is still legible when you use the logo at your desired size (and that no strokes break up on the printer).\n\nOverlapping the As, but then butting the R and S up so close \\*without\\* overlapping seems like it's not quite resolved. Have you tried overlapping the As further? Overlapping the R and S?\n\nThe A combination, by the way, reminds me of American Airlines — even though it's not the same treatment at all. Something to think about, play up, or play down?\n\n"
    },
    {
      "time": "19 Jun 2013 — 3:27pm",
      "content": "Dear Pica Pusher,  \nThank you for your extensive and detailed reply.\n\nI think you definitely touched upon some very interesting points, and have to agree with you. I am now on my way to create a new version with the R and S overlapping with the As and see how it will end up, hopefully it will end up being even more unified.  \nHowever, I think I will opt for the non italic version of the font for the \"international\" text as I just tried to print it at small size and it seems to be more readable compared to the more contrasty italic version.\n\nI will keep you updated with some new concepts soon.\n\n"
    },
    {
      "time": "20 Jun 2013 — 2:13am",
      "content": "A side note - I'd consider putting less visual focus on A-A in the light of what a lot of people [associate AA with](http://web.archive.org/web/20150419095417/http:/www.aa.org/).\n\n"
    }
  ]
}
