{
  "id": "103916",
  "title": "Silkscreen prints",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI noticed a lot of posters to do with typography, or made by typographic folks, are 'silkscreens'. The silkscreens seem rather expensive to me, which I assume is due to the printing process. So, are they really more expensive, and if so, are they really worth it? What makes a silkscreen better than an offset print or a high-quality laserprint?\n\nCheers,  \nJasper\n\n",
  "author": "1996type",
  "time": "17 Jun 2013 — 12:13pm",
  "uid": "30114",
  "comments": [
    {
      "time": "17 Jun 2013 — 2:04pm",
      "content": "They aren't necessarily better, but the ink deposit is thicker & colours can be more intense. A screen print can be a tactile experience as well as a visual one.\n\nThe cost is in part, related to the size of the run, like any other print job. But screen printing is not a high volume, high speed media. When I was a screen printer a run of a few thousand was a lot for the company I worked for.\n\nlike letterpress printing, many of the screen printers still in business are in it for the love of it (aside from those cheapo T-shirt printers) and the quality of the print is down to the skill of the printer. You also pay for that.\n\n"
    },
    {
      "time": "17 Jun 2013 — 2:08pm",
      "content": "Yea, pretty much what Russell said. It's like asking which is better: Woodblock printing or Intaglio? It's really just two different ways to make an art print.\n\nThere's probably still a bit of an assumption that screenprinting, being at least partially hand-created has a bit more of a cache when it comes to 'art' but these days digital/ink-jet (or 'giclee' if you prefer the marketing term) printing is of such a quality that one can certainly find respected (and expensive) prints in that medium.\n\n"
    },
    {
      "time": "17 Jun 2013 — 2:09pm",
      "content": "-- deleted dupe --\n\n"
    },
    {
      "time": "17 Jun 2013 — 2:26pm",
      "content": "It's been a few years since I've used silkscreening, but one advantage is durability. Conventional printing can be more fragile and will fade faster when exposed to bright light / sunlight.\n\n\\> or a high-quality laserprint\n\nA laser print is fine for a business report or a poster that'll hang on the bulletin board a few weeks, but not for something more permanent.\n\n"
    },
    {
      "time": "17 Jun 2013 — 3:58pm",
      "content": "Some 45 years ago, a college freshman who knew nothing about printing got talked into helping silkscreen some posters for a play that was being presented on campus. The inks and solvents he inhaled so corroded his brain as to leave him unfit for proper employment, and he was left to support himself (and later his family) by designing textbooks.\n\nBut enough about me. Silkscreen printing is the medium of choice when you want densely opaque, flat, solid colors--something that offset lithography just can't do. It's also ideal when you're printing on something that has an irregular shape or texture, so you can't run it through an offset press--a coffee mug, a T-shirt, the front of a vending machine.\n\nSilkscreen printing doesn't print halftones with the high resolution you get from offset. It's a better choice for bold, hard-edged, high-contrast shapes, which can include letterforms.\n\nThere are companies that do silkscreen printing on a massive, industrial scale (all those \"Life Is Good\" T-shirts and \"Keep Calm and Carry On\" coffee mugs didn't come from some hippie in his garage). But unlike offset lithography, silkscreen printing doesn't require costly, industrial-size presses. It can be done as a craft, by someone with talent, effort, imagination, and a few hundred dollars' worth of gear. And of course, hand craft work will always cost more than manufactured goods that reflect the economies of scale.\n\n"
    },
    {
      "time": "20 Jun 2013 — 1:05pm",
      "content": "Thanks everyone! Very helpful :)\n\n@PublishingMojo: Sorry to hear about the damage it did to you, and thanks for your explanation!\n\n"
    },
    {
      "time": "20 Jun 2013 — 1:16pm",
      "content": "PublishingMojo, I was just checking into doing a very small run (under 12) of t-shirts. The set-up cost plus the cost for minimum run plus the cost for a few tees is hard to justify my eventual price per tee. So, I've been looking around for online tutorials to do the shirts myself. The design is nothing intricate, just simple heavy text.\n\nIs it all that hard to create the screens? Do you have some pointers ...\n\nThanks in advance.\n\n"
    },
    {
      "time": "20 Jun 2013 — 1:43pm",
      "content": "5star check out this book:\n\n[http://screenprintingonthecheap.com/](http://web.archive.org/web/20150421054756/http:/screenprintingonthecheap.com/ \"http://screenprintingonthecheap.com/\")\n\n"
    },
    {
      "time": "20 Jun 2013 — 4:36pm",
      "content": "Talk to Brian Jaramillo. We made 25 of our Helveeta shirts\\*, sold them for $20 (plus shipping) and still made money (a very modest amount of course).\n\n\\* [http://typophile.com/node/33285](http://web.archive.org/web/20150421054756/http:/typophile.com/node/33285 \"http://typophile.com/node/33285\")\n\nhhp\n\n"
    },
    {
      "time": "21 Jun 2013 — 9:42pm",
      "content": "Thanks for the pointers!\n\n"
    },
    {
      "time": "23 Jun 2013 — 12:30pm",
      "content": "Speaking of screen printing, we watched [this documentary a few days ago.](http://web.archive.org/documentary%20about%20gig%20posters)\n\nIt's had me thinking, maybe I'll make a frame or two, buy some hinges and squeegees, some cuttable emulsion and pull a few prints.\n\n... But not with the highly toxic solvent, laquer, vinyl and polyester based inks mentioned earlier. I once worked on a job printing 2000 18\" x 36\" window decals - four colours on double sided on clear vinyl which meant that with both sides, a white background layer and an opaque block-out layer each piece went through the press 11 times, leaving 9000 square feet of wet vinyl ink gassing off into the shop for two hours beween colours.\n\n"
    },
    {
      "time": "22 Jun 2013 — 10:27pm",
      "content": "Duplicate deleted.\n\n"
    },
    {
      "time": "23 Dec 2013 — 10:46pm",
      "content": "I am going through this post and thinking of it’s theme and trying to understand what is this post about. At last I can have found something from this post which feels pretty good.\n\n"
    }
  ]
}
