{
  "id": "103910",
  "title": "One library to rule them all?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "My company are introducing a server-based font management system As part of that they want to sort out the library and importantly delete illegal fonts. The issue is they want to bring in a 'complete' library to use across all titles - the one being touted is the Adobe type library.\n\nAre there any better alternatives, and (assuming most people would be negative) is anyone in favour of this type of rationalisation?\n\nThoughts as always gratefully received…\n\n",
  "author": "dendicott",
  "time": "17 Jun 2013 — 9:33am",
  "uid": "12413",
  "comments": [
    {
      "time": "17 Jun 2013 — 11:18am",
      "content": "In general, I would say it’s a mistake to put all your eggs in one basket.  \nAlso, such comprehensive libraries tend to be strong on the classics but a bit stodgy.  \nHowever, if you can ﬁnd a match between your company’s mission/style/whatever and that of a type supplier, it may help focus your direction.\n\nMonotype=Sauron?\n\n"
    },
    {
      "time": "17 Jun 2013 — 2:24pm",
      "content": "Well, my library of books consists of publications that cover interests of mine, or are entertaining or just beautiful in their own way — strangely enough they are from a multitude of publishers…\n\nYour type library should be similar, and as it is, having only the Adobe Type Library is like having only Penguin books: not bad at all, but somewhat restricted.\n\nWhy not ask for a quote for licensing the ATL for your situation and then use amount of money as a budget and gradually build an interesting and useful collection?\n\nFYI: amongst my last purchases were typefaces and type families from Village (Klim), Typotheque, House Industries and other small foundries.\n\n"
    },
    {
      "time": "17 Jun 2013 — 5:26pm",
      "content": "This is just going to keep happening. Many of our customers (book publishers) are moving to this. Think their problem -- freelance designers, contract typesetters and (different) contract printers, not to mention different products -- ink on paper books, eboks in both pdf and ePUB formats, etc.\n\nKeeping track of who has a legal font would be daunting. Even worse is paying for it all, esp. from some of the major European font publishers. The possibility of revenue from the Web, I guess, has set up pricing strategies for font use that book publishers just won't pay. Kind of like medical care in America. This is their first step, a limited library & maybe a contract price for that library. No doubt more to come.\n\nI wish we could pay, say $300 for a font and own (not license) it, just like the old days. But then, the cost of fonts limited choices then, too...\n\n"
    },
    {
      "time": "20 Jun 2013 — 2:52pm",
      "content": "Despite having many Adobe fonts, I use fonts from other foundries much more. I think their fonts are sometimes limited, especially when they have licensed them from other companies and are selling outdated versions.\n\n"
    },
    {
      "time": "20 Jun 2013 — 3:14pm",
      "content": "_I wish we could pay, say $300 for a font and own (not license) it, just like the old days. But then, the cost of fonts limited choices then, too..._\n\nThose $300\\* only payed for fonts that could be used at one location in the old days. Lead is physical, right. You couldn’t copy the font and distribute it to everyone in the firm. The same amount gives you roughly the same value today.\n\nHow web and app licensing today are handled by type publishers differs wildly. Give it some time, and we’ll probably figure out a good solution. A license that covers both desktop, app and web might be a good idea. In fact, OurType does this very thing.\n\n\\* I suspect it was a lot more back then, though …\n\n"
    },
    {
      "time": "20 Jun 2013 — 6:28pm",
      "content": "Frode, just how old do you think I am ;-) the $300 (or so) was for a couple (roman & italic) photocomp fonts.\n\nMetal would have been much more, esp. for bookwork. With metal, you need at least three text sizes (for text, extracts & footnotes), at least roman & italic & maybe some bolds, probably a display size or two for chapter openings -- the costs quickly get up there.\n\nIn the days of metal, you just didn't buy a new \"font\" for any bookwork. I'd imagine unless the account was quite large, you didn't for advertising, either. You picked a printer who **already owned** & didn't need to buy a font, and used handlettering.\n\nPostscript fonts at $35 or so was what made the small, independent font publisher viable. If you let the big guys (Monotype, etc.) dictate pricing policies, esp. for ebooks etc, you'll loose that market. Maybe you don't want it. And maybe nothing will help, the people in management want headaches to go away, that's why they're paid the big bucks. Aesthetics & designer pleas don't count.\n\nEdit:  \nIsleofGrough: If you're a freelance designer, the decisions of who you're working for will affect your font choices.\n\n"
    },
    {
      "time": "20 Jun 2013 — 6:34pm",
      "content": "_If you let the big guys (Monotype, etc.) dictate pricing policies, esp. for ebooks etc, you'll loose that market. Maybe you don't want it._\n\nI walk my own path. Not to worry.\n\n"
    }
  ]
}
