{
  "id": "103974",
  "title": "Modern chiseled font - used on cover of .net magazine? Is it custom or a typeface.",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hello\n\nCould someone help me ID this chiseled font used on .net's cover please:\n\n[http://bradfrostweb.com/wp-content/uploads/2013/04/net241cover.jpg](http://web.archive.org/web/20150417142916/http:/bradfrostweb.com/wp-content/uploads/2013/04/net241cover.jpg)\n\nI'm thinking it might be custom but would love to know for definite before I spend days searching for a typeface!\n\nThanks in advance.\n\nVic\n\n ![](http://web.archive.org/web/20150417142916im_/http:/typophile.com/files/net241cover_5372.jpg)\n\n",
  "author": "mcfee",
  "time": "20 Jun 2013 — 2:25am",
  "uid": "35700",
  "comments": [
    {
      "time": "20 Jun 2013 — 3:28am",
      "content": "Don't know this one and really doubt it could be a commercial font. Looks hand-drawn from scratch to me (and not so hard to reproduce), a perfect candidate for [Fontstruct](http://web.archive.org/web/20150417142916/http:/fontstruct.com/). More option for customization: [Red Square](http://web.archive.org/web/20150417142916/http:/www.myfonts.com/fonts/letterheadrussia/red-square), [Akron Sans](http://web.archive.org/web/20150417142916/http:/fontstruct.com/fontstructions/show/akron_sans_nbp)\n\n"
    },
    {
      "time": "20 Jun 2013 — 4:23am",
      "content": "Thanks for the quick reply and your help!\n\nYeah was a long shot for it to be commercial.\n\n"
    },
    {
      "time": "20 Jun 2013 — 5:07am",
      "content": "Well Vic, I didn't recognize this as a font off hand so I started a check of the usual sources. I suggest that the font was made by eroding a monoline slab serif like [Rockwell, Nexa Slab, Brix Slab, Stafford Serial,](http://web.archive.org/web/20150417142916/http:/www.myfonts.com/search/rockwell/fonts/) or something else.  \nThe main problem is an eroded font has no particular style, and when it is tagged for sale by vendors such as MyFonts it could be tagged as any of the following: eroded, antique, vintage, rough, distressed, grunge, or something else. Also many typewriter fonts receive a destructive treatment and some end up looking similar to \\_net\\_.  \nSearching tags at MyFonts, and similar themes at dafont and elsewhere, yields quite a few similar fonts but nothing identical that I was aple to ID as an exact match.  \nMagazines sometimes commission a font for exclusive use, and may release it for public sale by the designer after a period of years. For example, Martha Stewart commissioned the polar opposite of this logo when it bought a severe geometric sans serif now sold as Benton. You can still see the font in use in the magazine logo and throughout the magazine. For the second time today, I can say \"it's a good thing!\"  \nThe \\_net\\_ logo lettering seems not to be in use elsewhere in the magazine, which makes it unlikely that it is a special font.  \nBut I have been wrong before.  \nIn any event you can produce something similar from the victim font of your choice by various techniques. Here is a link to one: [http://fontfeed.com/archives/tip-the-wornweatheredstamped-look/](http://web.archive.org/web/20150417142916/http:/fontfeed.com/archives/tip-the-wornweatheredstamped-look/ \"http://fontfeed.com/archives/tip-the-wornweatheredstamped-look/\")  \nDon\n\n"
    },
    {
      "time": "24 Jun 2013 — 10:18am",
      "content": "Thanks Don for such a detailed response and my apologies for not replying sooner. Unfortunately maybe my post wasn't very clear because it's the not the font used for '.net' but the one used for 'responsive' that I was trying to detect. Do you think you could help me with that one too please?\n\nThanks in advance  \nVic\n\n"
    },
    {
      "time": "24 Jun 2013 — 1:55pm",
      "content": "Again mcfee, I don't know if its a font or artwork. The are a number of similar fonts, which are commonly described as angled/angular and beveled/faceted. Google will pop them up for you. Allen R. Walden's Beveled of 1993 and Rick Mueller's Angles Octagon of 1992 are cleanly executed. I believe they are original but I am not certain. So no links. Most angular/breveled are heavier in weight than the net magazine version and, so far, the only one I have found with a similar v is, [BD Emerald](http://web.archive.org/web/20150417142916/http:/www.hypefortype.com/browse-fonts/font-categories/experimental/bd-emerald.html).  \nDon\n\n"
    },
    {
      "time": "26 Jun 2013 — 9:12pm",
      "content": "Don, I don't believe that Walden did anything original - although I can't find the source of Beveled just now. Rick Mueller did only a few original fonts. Both were amongst the earliest digital revivalists.\n\nRegarding Octagon, see [Intellecta's version](http://web.archive.org/web/20150417142916/http:/old.myfonts.com/fonts/intellecta/octagon-french/) - which includes some historical info. Jordan Davies created [a version](http://web.archive.org/web/20150417142916/http:/old.myfonts.com/fonts/woodentypefonts/octagon/) as well.\n\nOh, and these font are also known as prismatic, I believe. A search on that word will yield lots of such fonts. You don't see many narrow, modern prismatic fonts, but The Fontry offers a couple in its [Race Pak](http://web.archive.org/web/20150417142916/http:/www.thefontry.com/racepak1b).\n\n"
    },
    {
      "time": "26 Jun 2013 — 9:49pm",
      "content": "Thanks Mike, for the info on Walden & Mueller. As for Octagon, Herriet patented it on April 10, 1883 and it was sold through Connor. Marder Luse & others had their own versions.  \nDon\n\n"
    }
  ]
}
