{
  "id": "104086",
  "title": "Font Use Help (Copperplate Gothic).",
  "forum": "General Discussions",
  "tags": [
    "copperplate gothic",
    "eminem",
    "fan art",
    "font",
    "font use",
    "General Discussions",
    "help",
    "sans-serif"
  ],
  "content": " ![](http://web.archive.org/web/20140714024024im_/http:/typophile.com/files/emienm_3780.jpg)\n  \nSo basically I made this Eminem fan-art about him being the first true critically and commercially successful rapper(Yeah I know about Beastie Boys and Vanilla Ice). And when it came to putting some text in the image I got stuck on the typeface choice. I have used Copperplate Gothic here but I wanted to ask is it appropriate? This confusion was mostly due to someone saying in a thread \" Copperplate is a great font but its used in a lot of wrong places\". What do you guys think? Is this appropriate? It looks fine to me but I want your advice.  \nThanks \n",
  "author": "Dalveer Mann",
  "time": "24 Jun 2013 — 12:19pm",
  "uid": "212521",
  "comments": [
    {
      "time": "24 Jun 2013 — 2:31pm",
      "content": "_…the first true critically and commercially successful rapper…_\n\nMelle Mel.\n\nCopperplate Gothic: what has this to do with Eminem and hip hop?  \nIt’s an old face that was used for small text on biz cards 100 years ago, and more recently at display size because it was bundled with a lot of apps, and people didn’t know any better.  \nThe problem is that the teats on it are too big at display size, giving such typography a clumsy appearance.  \nSo the experts will always consider its use in display as inappropriate.  \nBut if your client likes the way it looks, feel free to ignore them!\n\n"
    },
    {
      "time": "12 Jul 2013 — 10:21am",
      "content": "Hey thanks for the help. This was just a personal project but I want to learn about Typography and Design, so I thought I should just ask about it. I changed the typeface to Agency FB, for the simple reason that it was the typeface that most resembled (There are subtle diffrences but it was the one that came the closest) the one they use at Shady Records(Eminem's Record Label) website. Thanks.\n\n ![](http://web.archive.org/web/20140714024024im_/http:/typophile.com/files/emienmnew_4961.png)\n\n"
    }
  ]
}
