{
  "id": "104066",
  "title": "An ident on this would appreciated.",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi\n\nnew here, sorry for jumping straight onto the 'help me' board without any prior participation. I hope to be able to join in the fun from here onwards though, however for now I'm trying to find a font used in a friends website, I'm making an attempt at neatening up the design as as a surprise, and I'd like to keep a font they used, but @include it in a website.\n\nDon't mind if it's commercial, although if it's super premium a Typekit hosted analog might be useful. I know from reading that you folks care about your lively hoods : )\n\nIt's in an image, so hopefully that;s where you folks come in.\n\nNot quite sure what it's classed as, possibly a sans serif, would probably be filed under the 'display' section of a foundry. Open to learning along the way.\n\nThanks\n\n ![](http://web.archive.org/web/20131015113953im_/http:/typophile.com/files/unknownfont_4186.png)\n\n",
  "author": "Andrew2364",
  "time": "23 Jun 2013 — 7:34pm",
  "uid": "212503",
  "comments": [
    {
      "time": "23 Jun 2013 — 7:37pm",
      "content": "looks like [Vega](http://web.archive.org/web/20131015113953/http:/www.myfonts.com/fonts/efscangraphic/vega-sb/) Bold\n\n"
    },
    {
      "time": "23 Jun 2013 — 7:42pm",
      "content": "Update for the curious, just came across Fredoka One by Milena Branda on google fonts, it;s pretty dang close but the M is not quite right, it's a bit harder. The M above looks more like a modded W from from Fredoka, it's possible they played around a bit... still you guys are the experts\n\n"
    },
    {
      "time": "23 Jun 2013 — 7:48pm",
      "content": "Looks like [Vag Rounded Black](http://web.archive.org/web/20131015113953/http:/www.myfonts.com/fonts/adobe/vag-rounded/) except for the apostrophe, so that's not the one. Same problem with Vega.  \nDon\n\n"
    },
    {
      "time": "23 Jun 2013 — 7:56pm",
      "content": "By going through [these similar fonts](http://web.archive.org/web/20131015113953/http:/www.identifont.com/list?3+VAG%20Rounded%20%28BT%29+12+26D+1+AIA+1+66V+1+6L4+1+322J+4+II7+4+2L3P+4+2I98+4+2IO6+4+4H9+4+F3X+4+BVG+4+P0A+4+2H9N+4+NWN+4+NWL+4+GHW+4+2UY+4+6DC+4+MZ+4+9IJ+4+1MS+4+2Y00+5+2GT3+5+NWM+5+GN7+5+2IJV+5+2MNZ+5+LOF+5+NGU+5), we might find matching letters AND the correct apostrophe.  \nDon\n\n"
    },
    {
      "time": "23 Jun 2013 — 8:01pm",
      "content": "i never put it past anyone to use an unmatching apostrophe. just sayin.\n\n"
    },
    {
      "time": "23 Jun 2013 — 8:12pm",
      "content": "So true. Designers love to tweek a font a tiny bit to show they have done WORK on a logo:)  \nBut I do suspect that some of the rounded/soft matches do have this apostrophe. I checked the Proxima Nova Soft charset and it has the correct apostrophe. Unfortunately it is not as good a match as VAG Rounded or Vega.  \nDon\n\n"
    },
    {
      "time": "23 Jun 2013 — 8:44pm",
      "content": "[Vag Rounded Regular](http://web.archive.org/web/20131015113953/http:/www.fontshop.com/fonts/downloads/bitstream/vag_rounded_std_regular/?&fg=dcbd78&bg=5b5b5b&sample_size=30&sample_text=MacGregor%E2%80%99s%20Market&ft=liga), no tweak.  \n ![](http://web.archive.org/web/20131015113953im_/http:/typophile.com/files/macgregor_4945.png)\n\n"
    },
    {
      "time": "24 Jun 2013 — 6:12am",
      "content": "Vega is the Scangraphic clone of VAG Rundschrift / VAG Rounded. If we may believe [the english Wikipedia](http://web.archive.org/web/20131015113953/http:/en.wikipedia.org/wiki/Sedley_Place) on this, VAG Rundschrift / Rounded was designed by Gerry Barney at the agency Sedley Place in 1979. The [german Wikipedia](http://web.archive.org/web/20131015113953/http:/de.wikipedia.org/wiki/VAG_Rundschrift) tells a different story though. They date the design 1978 and attribute the design to Wolf Rogosky and Gerd Hiepler with later adaptations by Bertel Schmitt and Manfred Schwarzer.\n\nThe apostrophe in the Bitstream version used by Michel Boyer and in the MacGregor’s Market logotype differs from the version available from URW, E+F, Adobe and Linotype. In my eyes and because older Bitstream data usually has origins at Linotype, the design of the Bitstream apostrophe is probably what the Germans call a ‘Verschlimmbesserung’, which roughly might translate into something like ‘inappropriavement’.\n\n"
    },
    {
      "time": "24 Jun 2013 — 4:34am",
      "content": "Thanks Albert Jan Pool. VAG LT was so spot on, except for the apostrophe, I should have checked the alternative BT digitization.  \nAh well, the English language, home of the apostrophe, censored and banned on signs in some jurisdictions with protective language laws, and omitted from possessives in other languages :)  \nDon\n\n"
    }
  ]
}
