{
  "id": "104048",
  "title": "Font Usage & Licensing Survey - Respondents Needed!",
  "forum": "Typographic Education",
  "tags": [
    "education",
    "ethics",
    "font licensing",
    "fonts",
    "Legal issues",
    "legal use",
    "licensing",
    "research",
    "survey",
    "Typographic Education"
  ],
  "content": "I am collecting information on the ethics and legality of digital font usage for my undergraduate thesis using a survey. I'm focusing on students, instructors, and professionals who are involved in the design community. I've received over 80 responses so far, but am looking for as many as I can obtain, so please feel free to share with your friends or colleagues!\n\nIf you would like to offer any additional resources/information in regards to these issues, please contact me at: [alexgilbert2009@gmail.com](mailto:alexgilbert2009@gmail.com)\n\nThe link is below, and the survey takes about 5 minutes to complete. Thank you in advance!  \n [http://tinyurl.com/alexgilbertsurvey](http://web.archive.org/web/20150317184846/http:/tinyurl.com/alexgilbertsurvey \"http://tinyurl.com/alexgilbertsurvey\")\n\n",
  "author": "alexggilbert",
  "time": "22 Jun 2013 — 9:25pm",
  "uid": "212488",
  "comments": [
    {
      "time": "23 Jun 2013 — 9:55am",
      "content": "I've received over 160 responses in the first 18 hours, from all over the world. Much thanks to anyone who's participated so far! Please continue to share and complete the survey.\n\n"
    },
    {
      "time": "23 Jun 2013 — 10:19am",
      "content": "I just tweeted about it for you.\n\nhhp\n\n"
    },
    {
      "time": "23 Jun 2013 — 2:53pm",
      "content": "@alexggilbert: Where do you study?\n\n"
    },
    {
      "time": "23 Jun 2013 — 7:37pm",
      "content": "@hrant Much appreciated! All the responses and feedback have been extremely helpful!\n\n@Chris Dean I am an undergraduate student at Harrington College of Design in Chicago. I'm studying Communication Design with a specialization in Typography.\n\n"
    }
  ]
}
