{
  "id": "104139",
  "title": "Whistleblowers - The False Claims Act - Environmental Fraud - Crown Capital Management Group",
  "forum": "General Discussions",
  "tags": [
    "crown capital management group",
    "environmental fraud",
    "General Discussions",
    "jakarta management fraud watch solutions"
  ],
  "content": "ENVIRONMENTAL FRAUD\n\nEnvironmental regulation is an important and challenging responsibility for the government. Environment fraud occurs when any of the many environmental statutes and regulations are intentionally violated. Environmental fraud is difficult and often prohibitively expensive for the government to detect. The government enforcement units responsible for environmental protection and uncovering environmental fraud are often underfunded and understaffed. Environmental whistleblower laws are federal and state laws designed to encourage employees to report the improper, unsafe, or potentially illegal practices of their employers that negatively affect the environment. Seven major laws protect environmental whistleblowers that expose corporate violations of environmental regulations: the Clean Air Act, the Toxic Substances Act, the Clean Water Act, the Atomic Energy Act, the Solid Waste Act, the Safe Drinking Water Act, and the Superfund Act. Each of these statutes has provisions that protect environmental whistleblowers from employer retaliation when an employee reports violations of environmental laws and regulations, or assists the government in a proceeding under one of these laws or regulations.\n\nFalse Claims Act liability can arise when a contractor falsely certifies compliance with required environmental laws and regulations related to a specific project, deliberately overcharges the government for hazardous and toxic waste cleanup, gets paid for work that the contractor did not perform, or provides services that do not meet government specifications.  \nIf you have, or think you have, witnessed a fraud with regard to contractor compliance with environmental regulations and/or contract, contact Jeffrey M. Haber, Christian Siebott, James Weir or Laurence Hasson to discuss the possibility of bringing a lawsuit on behalf of the government to recover damages for the contractor’s improper conduct.\n\n[http://www.bernlieb.com/whistleblowers/Environmental-Fraud/index.html](http://web.archive.org/web/20130821073347/http:/www.bernlieb.com/whistleblowers/Environmental-Fraud/index.html \"http://www.bernlieb.com/whistleblowers/Environmental-Fraud/index.html\")\n\n",
  "author": "tamaraandra",
  "time": "25 Jun 2013 — 11:19pm",
  "uid": "212564",
  "comments": [
    {
      "time": "26 Jun 2013 — 4:24am",
      "content": "I love this site!!!111\n\nNow, can we get somebody to actually run it?\n\n"
    },
    {
      "time": "26 Jun 2013 — 8:28am",
      "content": "Yes, your contributions are much more valuable.\n\nhhp\n\n"
    },
    {
      "time": "30 Jun 2013 — 6:57pm",
      "content": "Hmm. I wonder if Punchcut could recruit a couple of people to engage in spam-dropping? There's probably at least a few people on here qualified to do it. :-)\n\n"
    },
    {
      "time": "30 Jun 2013 — 7:46pm",
      "content": "I think they fired all the human admins when the introduced the \"Fool-proof Spam Eliminator 2000\".\n\nSi\n\n"
    },
    {
      "time": "1 Jul 2013 — 6:09am",
      "content": "Don't taunt the Happy Fun Ball.\n\n"
    }
  ]
}
