{
  "id": "10410",
  "title": "That Figures",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "A friend pointed out some cool figures on the   \nmenu at Buzz 9 (in San Francisco) recently.   \n   \n ![Solex Courtesy Emigre Typetease](http://web.archive.org/web/20150416153855im_/http:/www.typophile.com/forums/messages/4100/702.gif)   \nSolex, Courtesy of Emigre's Typetease   \n   \nThey are neither lining nor fully old style. The   \nresult is something that isn't so plain as lining   \nfigures without the jumpiness of the old style.   \n   \nOnce again, Zuzana innovates with a knowing   \nnod to the past.   \n   \n// joe\n\n",
  "author": "Joe Pemberton",
  "time": "24 Jan 2002 — 9:28am",
  "uid": "1160",
  "comments": [
    {
      "time": "24 Jan 2002 — 10:22am",
      "content": "Correction/Elaboration:   \nI guess it was about 4 years earlier, sorry:   \n [http://www.microsoft.com/typography/fonts/fonttest.asp?FID=4&FNAME=Georgia&FVER=2.05](http://web.archive.org/web/20150416153855/http:/www.microsoft.com/typography/fonts/fonttest.asp?FID=4&FNAME=Georgia&FVER=2.05)   \nNote that -possibly contrary to Carter's preferences- the MS guys decided to replace the hybrid figures with \"proper old-style figures\", in 1998. Although I like the hybrid approach, I suspect that MS might have done some -possibly informal- focus group sessions where enough people complained that the figures \"seem somewhat misaligned or something\" that they decided to play it safe and make them \\*really\\* \"misaligned\" (traditional old-style), so as to \"snap away\" from the bothersome \"somewhat misaligned\" stigma and go into the open waters of \"just not aligned\"... :-) This might be especially true in the low-res screen world, Georgia's primary target. As for Solex, considering it's essentially a display face, I'd prefer lining figures, at least as the primary form (although alternates -especially coupled to OpenType technology- are always welcome).   \n   \nhhp\n\n"
    },
    {
      "time": "24 Jan 2002 — 11:12am",
      "content": "Nice example.   \nSince FB's site doesn't show good specimens, for those who don't have the pleasure of owning their fantastic specimen book\\* (hmmm, now I wonder if those two things are related... :-), here's a good view:   \n [http://www.myfonts.com/Testdrive?p=48&s=Hh1234567890xO&id=8834&submit=display](http://web.archive.org/web/20150416153855/http:/www.myfonts.com/Testdrive?p=48&s=Hh1234567890xO&id=8834&submit=display)   \n   \nNow this is a very interesting solution... How to explain it?   \n   \nhhp   \n   \n\\* http://www.fontbureau.com/specimens/xbook3.html\n\n"
    },
    {
      "time": "24 Jan 2002 — 11:26am",
      "content": "Pardon the [on-going] digression, but speaking of Miller:   \n [http://www.typophile.com/forums/messages/30/703.html?1011900345](http://web.archive.org/web/20150416153855/http:/www.typophile.com/forums/messages/30/703.html?1011900345)   \n   \nhhp\n\n"
    },
    {
      "time": "29 Jan 2002 — 2:59pm",
      "content": "\"Hybrid\" is cool... until the next hybrid comes along! :-/   \nMaybe at that point we can call them \"Carter\" numerals! :-)   \n   \nBTW:   \n [http://www.emigre.com/Typetease/](http://web.archive.org/web/20150416153855/http:/www.emigre.com/Typetease/)   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jan 2002 — 7:54am",
      "content": "I was never sure about any hierarchy between Miller and Georgia - all I knew was that they were designed in the same year (right?), which might make one think that the influence went both ways (especially considering how long a good type design takes). On the other hand, since Georgia can be considered a \"lower-grade\" font (in its outlines if not its on-screen rendering), maybe it's safer to see Miller as the father. Is there any documentation about this?   \n   \nAustin:   \nAs I mentioned, I thought/suspected that somebody had done hybrid numerals before Carter. But would Austin -as a punchcutter- take such innovative liberties? Maybe he just cut numerals somebody else designed (who)? Also, wasn't Austin -among other things- Bell's punchcutter? Bell innovated the 3/4-height numerals (which I adore, and which are actually an [indirect] feature in Fenway too - more later); did he also innovate the hybrids?   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jan 2002 — 11:45am",
      "content": "So I went to check out those hybrid numerals in Sports Illustrated, and they were even nicer than I expected. For those wondering: they're basically 3/4 height numerals of wide set, but with a very modest oldstyle up&down: the effect is one of friendly sophistication - and it's more readable (and to a lesser extent more legibile too) than any lining scheme. So I think I'm going hybrid next time!   \n   \nBTW, another interesting thing was the smallcaps. I'm calling them midcaps: they're taller and not so wide, and seem to have been designed to set acronyms in running text, as opposed to mixing with \"normal\" caps. And to be honest, very few people use smallcaps - acronyms are so much more common, so maybe we should be making midcaps instead (or at least first/primarily)?   \n   \nIn toto, in the context of American sports, both the numerals and the midcaps seem to be very intelligent solutions.   \n   \nI also found the font as a whole to be very nice, even though I really don't like Moderns; it sort of reminded me of Olympian, the way Carter took a dated model and deftly made it much better (like the lc \"k\", in both Fenway and Olympian).   \n   \nBTW, speaking of numerals, Jonathan, if I may ask:   \nWhat do you think of using other distributions of the up&down? For example, what about making the \"3\" and \"5\" ascend instead of descend? Some old French foundries (like D&P) used to do this, and I like it better myself - but virtually everybody does the oldstyle figures the same way. Is there a reason besides conformity?   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jan 2002 — 11:50am",
      "content": "Joe, that's interesting!   \nHere's my explanation: The light weight is intended for text, that's why the numerals are shorter (less obtrusive). But the darker weights are intended for display (although I myself wonder about the middle one), so the numerals align with the caps. I wonder what the caps-ascender relationship is.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jan 2002 — 11:58am",
      "content": "I forgot something about Fenway:   \nBecause of their nature, the numerals often look like their \\*spanning\\* the lowercase, as opposed to sitting on the baseline or hanging from the x-line. For example in something like \"Porsche 955\". What's most fascinating is that Carter has previously expressed interest in the Ancient Greek method of putting glyphs on a centerline, as opposed to making them fit between multiple lines - and \"Skia\" comes to mind as one [partial] implementation of this. I like it.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jan 2002 — 2:02pm",
      "content": "This reminds me how increasingly designers are providing different types of numerals for a given font (Enschede for example provides 4 or 5 kinds!), which in turn makes me realize that the same should be done with the UC set - and I'd say that it's even more important there. You'd need a set for optimal readability (incuding a special set for German), a set for optimal scannability (where proper names are central), another set for acronyms, one for smallcaps, etc. But for some reason numerals get the lion's share of this \"alternate\" attention.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jan 2002 — 11:37pm",
      "content": "Maybe - I'm not so good with categorization. To me it has enough of a vertical axis plus high contast and certain decorative features that it's more of a Modern than anything else - but I'm listening... And I can actually see how many of the letterforms are not really Modern at all.   \n   \nhhp\n\n"
    },
    {
      "time": "31 Jan 2002 — 11:29am",
      "content": "You mean the really white one Zhukov did? That was kinda nice.   \n   \nSo which Hoefler face, and what should I be looking for when I compare them.   \n   \nBTW, how do these two relate to that funky DTL Fleischmann?   \n   \nhhp\n\n"
    },
    {
      "time": "1 Feb 2002 — 12:59pm",
      "content": "Check this out:   \n [http://www.fontfont.de/packages/atmas11264/about11264.html](http://web.archive.org/web/20150416153855/http:/www.fontfont.de/packages/atmas11264/about11264.html)   \n   \nWhat's strange is that the desciption doesn't mention that one of the two main (non-alternative) numeral schemes is... hybrid!   \n   \nAnyway, very encouraging (even though the QuarterCaps might be a bit overkill).   \n   \nhhp\n\n"
    },
    {
      "time": "1 Feb 2002 — 6:36pm",
      "content": "Thanks much - I'll check those out.   \n   \nBTW, you're using the term \"newsface\", but (except for LA Weekly's paper stock) all three cases are really magazines - which makes me ask the question: are the requirements for a magazine typeface roughly in between those for a newspaper face and a book face?   \n   \nhhp\n\n"
    },
    {
      "time": "2 Feb 2002 — 7:42pm",
      "content": "\\> The Delegates' report for 2000   \n   \nOK, I took a closer look at Fenway thanks to that, and I was wrong, of course - it's not a Modern. Maybe the ball terminals threw me off; or the italics. So is it correct to call it a \"Dutch Old-Style\"? There's a certain non-Dutch air to it, but maybe I'm comparing it to 20th century Dutch work, as opposed to stuff from Fleischmann's era.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Mar 2002 — 12:55pm",
      "content": "Yesterday I found a great little article called \"The history of numerals\", by Henri Friedlander. It's in issue #1 of the new series of Typographica magazine (1960).   \n   \nhhp\n\n"
    },
    {
      "time": "27 Mar 2002 — 9:55am",
      "content": "A quick reflection on numeral extenderness:   \n   \nNow that we're in the 21st century I think there's an extra reason to make the \"2\" ascending: under the conventional scheme the first three digits of a year will all be x-height until the year 2030. Furthermore, any references to 2002, 2001 and 2000 are \\*entirely\\* x-height. Down with blandness!   \n   \nhhp\n\n"
    },
    {
      "time": "28 Mar 2002 — 9:00am",
      "content": "I've done some informal research, and -assuming we're talking about the same thing\\*- the oldest ones I found were in Intertype Garamond (I think from the beginning of the 20th century). And besides Carter the only other designer I've found using them is Alan Greene:   \n   \n [http://www.fontfont.de/packages/atmas11264.1/atmas11264.1.html](http://web.archive.org/web/20150416153855/http:/www.fontfont.de/packages/atmas11264.1/atmas11264.1.html)   \n   \n\\* Old-style figures with large bodies and small extenders.   \n   \nIn any case, I'd love to see your work too, or pointers to other \"hybrid\" designs.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Apr 2002 — 10:13am",
      "content": "\\> Are you suggesting random ascenders and descenders where words currently have none too!?   \n   \nNot random, but you've touched on something huge: the Latin alphabet needs more extenders (because it helps bouma divergence, hence recognition, hence reading). It's a major project to figure out how to carry out such changes (it's essentially a more ambitious flavor of my Alphabet Reform work), but some letters are better candidates than others, and I can for example cite the \"e\" as definitely needing a descender.   \n   \nAnd you want more blasphemy? :-)   \nHere ya go: We should abandon the baseline.   \n   \n\\> longest word with no ascenders   \n   \nThat's a great little question!   \nJust to check: when you say no \"i\" or \"t\", you mean that those count as extending, right? That's probably fair, although some fonts have very shy \"t\"s. If you decide to allow the \"t\", then \"tobacco\" is a favorite of mine, not only because it doesn't have extenders, but because set in something like Futura or AG, it clearly shows the functional weaknesses of such typefaces.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Apr 2002 — 11:08am",
      "content": "memo acme norse rave sameness roman zeus excuse\n\n"
    },
    {
      "time": "1 Apr 2002 — 11:21am",
      "content": "creamora® ?   \n   \ntechnically, it's Creamora.   \n   \nremora   \n   \ncancerous   \n   \nbj\n\n"
    },
    {
      "time": "1 Apr 2002 — 11:36am",
      "content": "ransomness\\*   \n   \nscreamers   \n   \nsnoreez ®   \n   \n\\*google shows it three times, but I don't think   \nit's a word.   \n   \nbj   \n   \n ![:)](http://web.archive.org/web/20150416153855im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "1 Apr 2002 — 11:39am",
      "content": "not the longest, but ... 'romance'\n\n"
    },
    {
      "time": "1 Apr 2002 — 11:40am",
      "content": "not the longest, but ... 'romance' and how about 'resonance'\n\n"
    },
    {
      "time": "1 Apr 2002 — 12:01pm",
      "content": "recommence   \n   \nThis sucks - I can't do something like this without a \\*method\\*... Is there a good on-line word list in an easily parse-able format?   \n   \nhhp\n\n"
    },
    {
      "time": "1 Apr 2002 — 2:36pm",
      "content": "This is what I get after playing Scrabble® with my mom during Easter... :D   \n   \ncommerce = 8   \nnauseous = 8   \nvenceremos = 10   \nmonoserver = 10   \nnonvenomous = 11   \nnoncancerous = 12   \nmonocavernous = 13   \nnonmoroseness = 13   \nnonvacuousness = 14   \nnonexcrescence = 14   \n   \nDavid\n\n"
    },
    {
      "time": "1 Apr 2002 — 2:39pm",
      "content": "Joe:   \n   \nStart tacking \"non-\" and \"-ness\" on to some of yours, and you beat my words.... :D   \n   \nDavid\n\n"
    },
    {
      "time": "3 Apr 2002 — 5:00pm",
      "content": "Now that's funny!   \n   \nhhp\n\n"
    },
    {
      "time": "4 Apr 2002 — 6:40pm",
      "content": "Oh, come on.... For a group that gets off on pangrams, how could we possibly resist a challenge like that? ![:)](http://web.archive.org/web/20150416153855im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI thought it was fun.... Besides, we all got a link to a cool anagram site out of the deal....   \n   \nDavid\n\n"
    },
    {
      "time": "24 Jan 2002 — 10:43am",
      "content": "Matthew Carter used the same \"split the difference\" approach in his lovely Miller. Most of the figures are shy of the cap height. Only the 6 could be described as ascending, while the 7 and 9 are the only characters to venture below the baseline.   \n   \n [http://www.fontbureau.com/specimens/miller.html](http://web.archive.org/web/20150416153855/http:/www.fontbureau.com/specimens/miller.html)\n\n"
    },
    {
      "time": "29 Jan 2002 — 11:10pm",
      "content": "In case it wasn't clear from previous posts, as far as I know, Georgia is derived from Miller. So that would explain the figures.   \n   \nAlso, didn't Richard Austin basically invent this approach to figures (and then it might not be such a coincidence that Miller has them since Austin was an originator of the Scotch Romans and Miller is a sort of Scotch Roman)?\n\n"
    },
    {
      "time": "30 Jan 2002 — 11:06am",
      "content": "Adobe's Bell Gothic   \n   \n ![Adobe Bell Gothic](http://web.archive.org/web/20150416153855im_/http:/www.typophile.com/forums/messages/4100/726.gif)\n\n"
    },
    {
      "time": "30 Jan 2002 — 12:19pm",
      "content": "![Bell Gothic Lowercase](http://web.archive.org/web/20150416153855im_/http:/www.typophile.com/forums/messages/4100/727.gif)   \nAdobe's Bell Gothic Light   \n   \nIt may be worth noting that the Bitstream version   \ndoes the same thing (w/ only the lightest   \nweight having the lower figures.)\n\n"
    },
    {
      "time": "30 Jan 2002 — 11:01pm",
      "content": "Fenway isn't exactly a 'Modern' - it's based on Fleischmann's work, isn't it?\n\n"
    },
    {
      "time": "31 Jan 2002 — 9:06am",
      "content": "If you want to see Fenway in another place, take a look at that thing ATypI sent out a year or so ago. The Delegates' report for 2000 I think? Set in Fenway with the Figgins Open caps too (also by Carter). Compare Fenway with the Hoefler face (forget the name right now) that is used by (most or all) of the New Times-owned free weeklies.. also was used in Esquire I think. I think this face is also based on a model similar to Fenway maybe.\n\n"
    },
    {
      "time": "1 Feb 2002 — 2:39pm",
      "content": "The Hoefler face in question isn't for retail... I can't remember the name. Try to find an \\_Esquire\\_ and see if they're still using it.. I don't know. What's the L.A. free weekly? L.A. Weekly right? I bet it uses it for the body copy. Take a look. I haven't compared either to the DTL face but if I had to guess, the DTL was a more specific translation of Fleischmann, whereas these two are looser (esp. since the one in the newspapers is a newsface and has really short descenders if I remember right).\n\n"
    },
    {
      "time": "28 Mar 2002 — 8:41am",
      "content": "Just to be boring, \"Hybrid\" figures are nothing new - I did a family with hybrid figures about ten years ago, and I'm sure I wasn't the first.\n\n"
    },
    {
      "time": "1 Apr 2002 — 9:16am",
      "content": "Hrant:   \n\\>Furthermore, any references to 2002,   \n\\>2001 and 2000 are \\*entirely\\* x-height.   \n\\>Down with blandness!   \n   \nAre you suggesting random ascenders and descenders where words currently have none too!?   \n   \nQuick quiz: longest word with no ascenders or descenders (no \"i\"s or \"t\"s!).   \n   \nI got \"assume\" so far.\n\n"
    },
    {
      "time": "1 Apr 2002 — 11:01am",
      "content": "a c e m n o r s u v w x z   \n   \nace menu rose morse verse, scanner saves   \nvacuum. more rows, no cars.   \n   \nciao.\n\n"
    },
    {
      "time": "1 Apr 2002 — 2:05pm",
      "content": "A free, online anagram service:   \n [http://www.easypeasy.com/anagrams/](http://web.archive.org/web/20150416153855/http:/www.easypeasy.com/anagrams/)   \n   \nThe longest words I get are:   \n(I'm presuming the engine is English only   \nbecause it doesn't say.)   \n   \nnecromancer   \narenaceous   \ncurvaceous   \nassurance   \ncameraman   \ncameramen   \ncancerous   \ncavernous   \nconcourse   \ncrossover   \nerroneous   \nrancorous   \nscarecrow   \nsunscreen   \nannounce   \ncareworn   \ncommerce   \nconserve   \nravenous   \ncarouse   \ncoarsen   \ncrewman   \nnervous   \nromance   \nsurname   \nacumen   \nanswer   \ncarven   \ncensor   \ncoarse   \nconvex   \ncornea   \ncourse   \ncowman   \ncraven   \nescrow   \nmanure   \nmucosa   \nransom   \nreason   \nscream   \nsermon   \nsource   \nunesco   \nvenous   \nworsen\n\n"
    },
    {
      "time": "3 Apr 2002 — 4:57pm",
      "content": "It was supposed to be a joke, sorry!\n\n"
    },
    {
      "time": "24 Jan 2002 — 9:48am",
      "content": "1. Carter did that with [the original version of] Georgia at least a year before.   \n2. I forget who, but I think somebody did it before Carter.   \n3. I'm pretty sure it's illegal to post an Emigre TypeTease image like that (but please don't shoot the messenger).   \n4. I like the \"7\". The \"4\" should follow.   \n   \nhhp\n\n"
    }
  ]
}
