{
  "id": "104202",
  "title": "Specimen Text",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'd like to get some opinions about whether or not it is deemed ok to uses a font other than the one the specimen is created for in that specimen.\n\nI'm thinking specifically about using a different font for body copy in a specimen designed for a display font. It seems fairly straight forward to me that you wouldn't want to use a bold display font for body text in the specimen.\n\nAnd what if I have never created a font meant to be used for body copy? Is it ok to use someone else's font for the copy?\n\n",
  "author": "Deus Lux",
  "time": "27 Jun 2013 — 2:18pm",
  "uid": "212629",
  "comments": [
    {
      "time": "27 Jun 2013 — 3:34pm",
      "content": "I think it's totally OK as long as you declare it.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2013 — 4:49pm",
      "content": "If nobody else gives an opinion I'll use Helvetica. I swear to God, I'll do it, man!!\n\n"
    },
    {
      "time": "28 Jun 2013 — 6:30pm",
      "content": "Wow, you designed Helvetica?\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2013 — 6:51pm",
      "content": "Yep, it was me.\n\n"
    },
    {
      "time": "28 Jun 2013 — 7:07pm",
      "content": "I'll have to break out Kaczynski and give him your address.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2013 — 9:16pm",
      "content": "do it. Or else I'll use arial. I MEAN IT MAN! I'LL DO IT!!! I'LL DO IT, MAN!!!!!\n\n"
    },
    {
      "time": "28 Jun 2013 — 8:04pm",
      "content": "You've been watching too many reruns of Adam-12, Man.\n\n"
    },
    {
      "time": "28 Jun 2013 — 8:18pm",
      "content": "By all means use someone else's font if it gives a good idea of the context in which yours is meant to be used and shows a harmonious pairing. Just credit it.\n\n"
    },
    {
      "time": "28 Jun 2013 — 9:16pm",
      "content": "What the hell is Adam-12?\n\n"
    },
    {
      "time": "28 Jun 2013 — 9:18pm",
      "content": "Josh, the idea is what is acceptable to use if there is no harmonious pairing, and has no context in comparison to the specimen font. If it was harmonious, well that would be a no brainer.\n\n"
    },
    {
      "time": "28 Jun 2013 — 9:22pm",
      "content": "There is never perfect harmony, but always some harmony.\n\nWhat does your font look like?\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2013 — 9:35pm",
      "content": "just imagine it looks like the most difficult font to pair up with any other font ever made, then you will know why I asked this question. Seriously, did you guys think I would waste your time asking the experts some brain dead easy shit?\n\n"
    },
    {
      "time": "28 Jun 2013 — 9:48pm",
      "content": "Of course that makes no sense. Knowing that a font is difficult to find a pairing for in no way helps find a specific decent pairing.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2013 — 10:16pm",
      "content": "Hahahaha! Thanks for letting me know you're unable to answer difficult questions, Hrant. I'll keep this in mind in the future. Christ....\n\n"
    },
    {
      "time": "28 Jun 2013 — 10:52pm",
      "content": "OK then, let's try it this way:  \n\"No matter what font you're using, you should use FF Ernestine\\* as a companion.\"\n\n\\* [http://ernestinefont.com/](http://web.archive.org/web/20130821064222/http:/ernestinefont.com/ \"http://ernestinefont.com/\")\n\nhhp\n\n"
    },
    {
      "time": "29 Jun 2013 — 7:53am",
      "content": "You asked whether it's okay to use someone else's font in your own specimen. I said sure. Not sure why you're disregarding all the answers you're getting. Isn't that what you wanted to hear?\n\nAnd I sort of doubt you've made the most difficult-to-pair-up font ever made. Want to show us?\n\n"
    },
    {
      "time": "29 Jun 2013 — 11:37am",
      "content": "Uh, Joshua, picture a boat in the Caribbean. Someone sitting in a deck chair, sipping a cool adult beverage, ogling a slightly-clad person of their preferred gender sunbathing nearby. There is also a fixture at the back of the boat. It holds a fishing rod, there is a line in the water...what's that called again?\n\n"
    },
    {
      "time": "29 Jun 2013 — 12:01pm",
      "content": "That's exactly the kind of answer I was looking for, Hrant. Thank you, sir. Not a bad choice either.\n\n"
    },
    {
      "time": "30 Jun 2013 — 8:42pm",
      "content": "Do remember to have the appropriate license for your method of distribution.\n\n"
    }
  ]
}
