{
  "id": "104287",
  "title": "Your Top 10 Favourite Font Specimens",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "List your top ten favourite Font Specimens.  \n{Including the name of the font and the Year of publication are nice, but really you are expected to show a few snapshots of each, or preferably PDF's.}\n\n",
  "author": "Deus Lux",
  "time": "1 Jul 2013 — 5:41pm",
  "uid": "212629",
  "comments": [
    {
      "time": "1 Jul 2013 — 10:25pm",
      "content": "My favorite type specimen is always the last one I created...  \n [Condensed French](http://web.archive.org/web/20150322042354/http:/thefontry.com/fha_condensed_french/FHA_Condensed_French_Spec_Book.pdf)\n\nI lost the links to my other favorites in my last computer crush. One simply must learn to back things up better. I also have a frayed copy of an American Type catalog from the 1930's I quite like and the collected works of Alf Becker from _Signs of The Times_ magazine, of course.\n\n"
    },
    {
      "time": "2 Jul 2013 — 5:19am",
      "content": "Nick Shinn's [Richler Specimen](http://web.archive.org/web/20150322042354/http:/origin.myfonts.com/s/aw/original/211/0/108163.pdf)\n\n"
    },
    {
      "time": "2 Jul 2013 — 7:03am",
      "content": "That is awesome.\n\n"
    },
    {
      "time": "2 Jul 2013 — 9:57am",
      "content": "Nick Shinn is a problem.\n\n"
    },
    {
      "time": "2 Jul 2013 — 11:37am",
      "content": " ![](http://web.archive.org/web/20150322042354im_/http:/typophile.com/files/DTL_type_specimen_4621.jpg)\n\nAt **No. 1** : the loose-leaf type specimen of the Dutch Type Library. It contains more than 400 digitally (high-res) printed pages in black and red on _Mellotex mat_ or _Promail_ 115 grams A4 paper in a handmade linen binder. A matching –handmade, of course– linen slipcase is available also. Production costs of specimen and slipcase are quite a bit higher than the retail prices, by the way.\n\nProduced in small quantities over the past 15 years; normally sold-out almost immediately. Therefore 51½ weeks **not** available per year.\n\nFEB\n\n"
    },
    {
      "time": "2 Jul 2013 — 12:57pm",
      "content": "William Page made some great ones.  \n [http://www.flickr.com/photos/thearm/2757542999/](http://web.archive.org/web/20150322042354/http:/www.flickr.com/photos/thearm/2757542999/ \"http://www.flickr.com/photos/thearm/2757542999/\")\n\n"
    },
    {
      "time": "2 Jul 2013 — 1:10pm",
      "content": "… and so did [Rosart](http://web.archive.org/web/20150322042354/http:/www.flickr.com/photos/exquisitefonts/sets/72157630554542636/).\n\nFEB\n\n"
    },
    {
      "time": "2 Jul 2013 — 1:35pm",
      "content": "Thanks very much for posting the link to the Rosart specimen pages, Frank. The more time I spend with Rosart's types, the more impressed I am.\n\nSome of my favourite type specimens:\n\n_Proeven van Oostersche Schriften._ Lettergieterij 'Amsterdam', Voorheen N. Tetterode. (Numerous editions; mine is 1915. Particularly valued for its Javanese and Buginese types.)\n\n_Le Cabinet des Poinçons._ Imprimerie nationale, Paris. (Mine is the 3rd edition, 1963.)\n\n_Specimens of Oriental Founts._ Cambridge University Press. (nd. but 1933.)\n\nThe Berthold specimen of Hebrew types from 1924 is worth mentioning, although I don't like many of the types very much. It is a handsomely produced volume, showing off some extravagant colour printing and ornament use. It is also a sad thing to handle, as an artifact of German Jewry at the moment when the Nazi party was beginning its rise to power. The specimen was produced under the guidance of [Joseph Tscherkassky](http://web.archive.org/web/20150322042354/http:/yaronimus.files.wordpress.com/2013/05/lubell.pdf), who was saved from the Holocaust by being sent to be Berthold's rep in Brazil in 1930.\n\n"
    },
    {
      "time": "2 Jul 2013 — 9:46pm",
      "content": "I don't have ten.\n\nHere's one - more like THE one: Enschede's 1908.\n\nhhp\n\n"
    },
    {
      "time": "3 Jul 2013 — 8:32am",
      "content": "The Sauna specimen booklet, which one can actually take into the sauna/bath/steam room, is rather fun.\n\nThe book printed in blood, also from Underware, IIRC.\n\nPDFs are OK, but nowadays it is the interactivity of web sites and type testers that is increasingly important in allowing one to get to know a typeface.\n\nBut nothing can compare, for me, with turning the page of a real specimen.\n\n"
    },
    {
      "time": "3 Jul 2013 — 12:03pm",
      "content": "Indeed, the specimens by Underware, including the one for Fakir are really well designed, produced, same as their fonts of course! I'm also quite fond of the specimens by House, which are vibrant books of typo-energy.\n\nBut it depends of course, I mean, the specimens mentioned above are large, illustrated overviews, while the classical specimens, with waterfalls of wood-and-leadprint, are a journey of discovery which often show that even the most far-out ideas in type design have been done before.\n\n"
    },
    {
      "time": "3 Jul 2013 — 12:04pm",
      "content": "Oh yes, the Underware specimen efforts are often amazing.\n\nhhp\n\n"
    },
    {
      "time": "4 Jul 2013 — 2:37pm",
      "content": "Yeah asking for ten is a bit much, I was gonna change it to 3, but I guess we can't edit original posts?\n\n"
    },
    {
      "time": "6 Jul 2013 — 12:35pm",
      "content": "ATF's big books from the first third of the last century. These were major printing operations using a huge range of metal type and included suggestions to printers for use. Printers were guided to styles that expressed the fashion of the day. Fascinating to see this change over the years. Digital versions at archive.org from University of Califorina and University of Toronto are good, ones from other sources are much less satisfying.  \nDon\n\n"
    },
    {
      "time": "10 Jul 2013 — 12:14pm",
      "content": "[I have always been partial to these...](http://web.archive.org/web/20150322042354/http:/on.fb.me/153kcSu)\n\n"
    },
    {
      "time": "3 Jul 2014 — 5:31pm",
      "content": "Unfortunately, the only Enschede type specimens I could find online were really old ones.  \nBut that search - or maybe it was a search related to the typeface Forma, instead - led me to learn about Deberny & Peignot's Serie 16 - and the [revival](http://web.archive.org/web/20150322042354/http:/www.cataloged.cc/?pid=82) of it currently being attempted.\n\nWhile the italic has definite idiosyncrasies, the Roman (at least its lower case) is very reminiscent of Century Schoolbook; thus, like some of the Scotch Romans by Fleischmann that I saw in those old Enschede type specimens, it approaches the canonical invisible typeface that I've been looking for (my interest in Textype was from this quest as well).\n\n"
    },
    {
      "time": "3 Jul 2014 — 5:42pm",
      "content": "That Deberny series (done by Tuleu, before the acquisition by Peignot) is indeed amazing... but mostly because of the Italic!  \n [http://www.themicrofoundry.com/other/Javal\\_italic.gif](http://web.archive.org/web/20150322042354/http:/www.themicrofoundry.com/other/Javal_italic.gif \"http://www.themicrofoundry.com/other/Javal\\_italic.gif\")  \nBTW there have been some discussions on Typophile about it.\n\nhhp\n\n"
    }
  ]
}
