{
  "id": "10425",
  "title": "Ice cream retail graphics",
  "forum": "Design",
  "tags": [

  ],
  "content": "\\<font class=\"dontLookLikeCrap\"\\>Hello.   \nI have a brief at college to design a new idea for a shop and create the brand and graphics (logo, packaging, swing tags, look for the interior/shop front.) I am doing an ice cream parlor but I am not sure whether to try to make it look more modern or something with a retro twist - such as from this other post I made: [http://www.typophile.com/cgibin/show.pl?83/70178](http://web.archive.org/web/20080924092845/http:/www.typophile.com/cgibin/show.pl?83/70178)   \n   \nThe idea is that the shop would sell ice creams and also non-dairy alternatives. Working title is \"Milk Bar\"!   \n   \nWould love to hear any suggestions. I live in the UK so unfortunately I dont get to see as many great ice cream parlors as in the US or Italy. We get the usual Ben and Jerry's and Haagen-Dazs etc.\\</font\\>\n\n [‹ I&#39;m having some font trouble](http://web.archive.org/web/20080924092845/http:/www.typophile.com/node/10470 \"Go to previous forum topic\") [I need to find the name for this font ›](http://web.archive.org/web/20080924092845/http:/www.typophile.com/node/10457 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080924092845/http://www.typophile.com/user/1477\" title=\"View user profile.\">newbie_chez</a>",
  "time": "<br>",
  "uid": "1477",
  "comments": [
    {
      "time": " 19.Apr.2005 2.32pm",
      "content": "Cheryl, go retro, 50s malt shop in the US. Investigate the fonts from Font Diner (lots of free fonts). Modern = carb free, no fat. Retro = fun, no guilt\n\n"
    },
    {
      "time": " 19.Apr.2005 2.47pm",
      "content": "I never thought 'modern' would be described as 'carb free'. Ehehe. How sad is that. Bring on the full-fat cream!   \n   \nDon't forget that Font Bureau has some great typefaces reminiscent of that era as well.\n\n"
    },
    {
      "time": " 19.Apr.2005 4.21pm",
      "content": "Yes definitely I think with modern life we want all the taste and none of the cals!   \n   \nThe links are very helpful thanks! I like the colours reminiscent of that era too. I am developing the logo at the moment, trying not to be too obvious ie. other ways of showing ice cream without drawing an ice cream or whirls! ![:-)](http://web.archive.org/web/20080924092845im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 20.Apr.2005 2.03pm",
      "content": "Milk Bar takes me directly to Clockwork Orange.   \n   \nI'd love to see a mark using an inverted bowler hat conflated with an udder.   \n   \nAlso, everyone should temporarily stop using the word conflate.\n\n"
    },
    {
      "time": " 20.Apr.2005 2.47pm",
      "content": "Cheryl, the fonts you asked to be ID'd are a lot of fun. I think you could do a modern take via those \"retro\" fonts.   \n   \nJames, funny that \"Milk Bar\" takes you straight to \"Clockwork Orange\". I get the idea though and it could be a lot of fun.\n\n"
    },
    {
      "time": " 20.Apr.2005 3.17pm",
      "content": "It's free. No guarantee.   \n   \n [http://www.korovamilkbar.com/](http://web.archive.org/web/20080924092845/http:/www.korovamilkbar.com/)\n\n"
    },
    {
      "time": " 20.Apr.2005 4.55pm",
      "content": "Clockwork Orange!? I've not seen the film personally, but I'm not sure I'd want to associate my ice cream shop with a murderer! :p James, I have checked out the link and I like how they've carried the theme into the environment.   \nI think I will try to go in a similar style to the fonts I asked to be ID'd. I am reading a couple of books about retail graphics, for ideas of how to apply the style to the interior/shop front. This project is fictional so I don't get to work with interior designers (!), so if anyone has any good links for retail graphics especially examples for ice cream I'd be very grateful.   \n   \nAlso what do you think of the name \"Milk Bar\" for a new ice cream parlor? I've noticed a lot of them just use a name like Ben & Jerrys etc. How about \"Marty's\"? I need something that will excite the tastebuds but also not sound lame.\n\n"
    },
    {
      "time": " 20.Apr.2005 5.54pm",
      "content": "You should watch the film if just to get the reference. The Milk Bar is a known character in the film.\n\n"
    },
    {
      "time": " 21.Apr.2005 5.08am",
      "content": "Cheryl, it would be nice if it was Marty's Milk Bar. Put a personality behind the business.   \n   \nAs for retail design, I live in Manhattan and the cost of real estate here (even for rent) is prohibitive so a place like my local bagel shop is a rediculous layout, super thin but fairly long, you can barely get two people to pass one another to get to the end of the counter. So their use of graphics is their back wall and a sidewalk sandwich style sign and their awning. Thats it! So there aren't hard fast rules that always work. The environment (and money) often will dictate what you can do\n\n"
    }
  ]
}
