{
  "id": "10429",
  "title": "Advice for Gotcha logo",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi, I would greatly appreciate any help with a logo I'll be doing for classes, it's about Gotcha.   \n   \nI read the threads for Al Nadeem, Gotterball, Stamps & Stamps, and the VH1, and saw great comments, also visited the Identity Works site ( [http://www.identityworks.com/tools/](http://web.archive.org/web/20131017041426/http:/www.identityworks.com/tools/)), and helped me a lot to generate and find names.   \n   \nThis is so far what I got   \n ![Names to Evaluate](http://web.archive.org/web/20131017041426im_/http:/www.typophile.com/forums/messages/4100/70229.png)   \nVoom, Reiken or Roken are the names that came up   \n   \nDo they work? What suggestions do you have? I had the idea of a soldier for the logo, but maybe that's too generic or overused ![:-(](http://web.archive.org/web/20131017041426im_/http:/www.typophile.com/forums/clipart/sad.gif)   \n   \nthanks!   \n   \nP.S.: This is my first post!\n\n",
  "author": "elgenaro",
  "time": "19 Apr 2005 — 3:53pm",
  "uid": "6401",
  "comments": [
    {
      "time": "19 Apr 2005 — 4:00pm",
      "content": "Gen, welcome to typophile.   \nA few questions. The logo is 'about Gotcha'? What does this mean?   \nDo you mean Gotcha, the surfwear company?   \nAnd what is your assignment, to come up with a fictitious business name   \nand design a logo?   \nNeed more information to be helpful. ![:-)](http://web.archive.org/web/20131017041426im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nbj\n\n"
    },
    {
      "time": "19 Apr 2005 — 4:04pm",
      "content": "Note:   \nSorry, forgot to mention that I used Jenson Old Style and Meta.\n\n"
    },
    {
      "time": "19 Apr 2005 — 4:22pm",
      "content": "Hi bj harvey, it's about Paintball, the game, haven't noticed that there's a surfwear company.   \n   \nI've seen both names being used,   \nwhich one is more common? Gotcha or Paintball?\n\n"
    },
    {
      "time": "19 Apr 2005 — 4:40pm",
      "content": "Oh. Wasn't sure what you meant.   \n   \nAs far as the marks ... hmmm, well you mentioned the Gutterball   \nthread, in which our friend Jay W. pointed out that a mark ought   \nto be more distinctive than simply typing a company name   \nin a specific font. Sometimes this is difficult b/c of time constraints.   \nBut it sounds like you have some time before your classes start, yeah?   \n   \nI would humbly suggest that you select a name from your group   \nand play around with some sketches, just paper and pencil.   \nThat is always a good starting point. You might try both uppercase   \nand lowercase, or mixed; you might try different   \nforms of a specific letter; you might try different type classifications.   \n   \n   \nbj\n\n"
    },
    {
      "time": "20 Apr 2005 — 3:52pm",
      "content": "Is it better to choose one and start from there?   \nOr is it better to \"play\" with two or three and then choose?   \n   \nsorry if sometimes I sound a little harsh or coarse, english is not my native language.   \n   \nthanks.\n\n"
    },
    {
      "time": "23 Apr 2005 — 4:26pm",
      "content": "Maybe it's just a USA thing, but I am much more familiar with \"paintball\".   \n   \nI was thinking the surf brand, too. (Maybe we're just showing our age...)   \n   \nI would think choosing the name would help a lot in defining your starting point. On the other hand, you might find a font you like, and choose a name based on letterforms that look good... but in a real life project, you would most likely have the constraint of a company name already in place (not to mention lots of other things that the client probably thinks they want...) so I'd pick the name first.   \n   \nOne logo idea that comes to mind is \"Gotcha\" with a paint splat for the \"o\". But, if the sport itself is known as \"Gotcha\", that name might be ruled out as too generic.   \n   \nto JP - if Apple uses Myriad unaltered, why do they have it as a custom font, MyriadApple\"? I would imagine they have done _something_ to it...\n\n"
    },
    {
      "time": "24 Apr 2005 — 3:23pm",
      "content": "Hi, you're right, it would definitely help a lot choosing one.   \n   \nIn this past days haven't got much time to work in this, did as bj said, lots of sketches, and I thought about using Voom, and came with a logo, but a teammate is more in favour of Reiken. I'll think Reiken will be the name, and start from there.   \n   \nVisited the Gotcha (surfwear) site, duh! I've completely forgotten about that company!   \n   \nThe term Gotcha (referring to paintball) seems to be more used out of the States, indistincly, but yes, it's generic.   \n   \nWell, I'll keep you informed about how this goes, thanks!\n\n"
    },
    {
      "time": "24 Apr 2005 — 5:42pm",
      "content": "meanwhile, check my drawings!   \n   \n [http://paginaweb.de/elgen/](http://web.archive.org/web/20131017041426/http:/paginaweb.de/elgen/)   \n:P\n\n"
    },
    {
      "time": "23 Apr 2005 — 9:03am",
      "content": "Yeah, it's a shame to give some a word mark or logo that is just   \na font.   \n   \nIt's kind of like Apple's corporate use of straight (non-custom)   \nMyriad. Any third party that wants to look like Apple can now   \nsimply use Myriad and they're aligned to their brand.\n\n"
    }
  ]
}
