{
  "id": "104213",
  "title": "Fontlab studio 5 [mis]adventures",
  "forum": "Build",
  "tags": [
    "customer service",
    "Build"
  ],
  "content": "Hello  \n Yesterday I bought Fontlab studio 5.2. I had messed about with Fontforge. But I decided to get something with more muscle for professional j0bs.\n\nSo about 14 hours ago I bought Fontlab Studio 5.2 after reading that it is the industry leader in its field.\n\nSo far. So good. But after installing I opened it and it asked for my serial number. I put that in. It said that it was right. Then Fontlab closed. Strange. But OK. I opened it again. The splash screen came up. Then it vanished. No program appeared. Hmm. Windows Task Manager showed no Fontlab process running at all.\n\nI tried again. I reinstalled. No help. I restarted my PC. No help either. The FAQ list was of no help. Nor was the provided Fontlab manual.\n\nSo I emailed the Fontlab customer issues page with a critical issue request.\n\nAbout 16 hours later after repeating the above request I've still got 2 auto emails but no help whatsoever.\n\nHowever, with raw cunning I sorted it out. I installed Python 2.75 as a 32 bit MSI [even though I ma on 64 bit windows 7] and now I have it working. Interestingly Fontlab's GUI says \"Python is Installed\" which makes me think that why on earth didn't they install python FOR me in the first place.\n\nSo marks so far for the makers of Fontlab Studio:\n\nInstallation Process: D- \\*Why on earth do I have to hunt for the right Python? It's not my job.\"  \n Customer Service: F \\* Is there any?\n\nNot good so far. I hope that I can give the product an A+ Fontlab is lucky that I am enough of a saint to do so if it deserves it.\n\n",
  "author": "betacarmody",
  "time": "27 Jun 2013 — 6:57pm",
  "uid": "212634",
  "comments": [
    {
      "time": "28 Jun 2013 — 6:23am",
      "content": "<cite>Customer Service: F * Is there any?</cite>\n\nYes, right here:  \n [http://forum.fontlab.com/fontlab-studio/](http://web.archive.org/web/20150416070249/http:/forum.fontlab.com/fontlab-studio/ \"http://forum.fontlab.com/fontlab-studio/\")\n\n"
    },
    {
      "time": "29 Jun 2013 — 6:05pm",
      "content": "Actually no.  \nOne, I had tried numerous times to create a log in for that fontlab website forum. It fails each time because there is a captcha that asks me to enter 2+7 =?  \nWhen I put 9 it says error. I even tried pasting the above math and that doesn't work.\n\nTwo, they still haven't given me any email help.\n\nTheir F grade for customer service is totally and absolutely deserved. It goes down as the most bizarre software experience I have had and I try out and but a LOT of software. It is up there with that time that I got a trial of XSI Softimage and it wouldn't work.\n\n"
    },
    {
      "time": "30 Jun 2013 — 4:24am",
      "content": "You have obviously never ordered VTT by fax.\n\n"
    },
    {
      "time": "30 Jun 2013 — 8:31am",
      "content": "...or installed the return fax successfully on the first try.\n\n"
    },
    {
      "time": "30 Jun 2013 — 9:14am",
      "content": "Why are you guys ordering enzymes by FAX...?\n\n[http://www.vtt.fi/sites/performance\\_enzymes/performance\\_enzymes\\_howtobuy...](http://web.archive.org/web/20150416070249/http:/www.vtt.fi/sites/performance_enzymes/performance_enzymes_howtobuy.jsp?lang=en \"http://www.vtt.fi/sites/performance\\_enzymes/performance\\_enzymes\\_howtobuy.jsp?lang=en\")\n\n(I assume the OP's two whines constitute enough discussion. He could always ask for a refund -- though since FontLab is a what, 10-pesron company spread out over two continents, that may take a while, too.)\n\n"
    },
    {
      "time": "30 Jun 2013 — 11:09am",
      "content": "Yes, [http://forum.fontlab.com/fontlab-studio/](http://web.archive.org/web/20150416070249/http:/forum.fontlab.com/fontlab-studio/ \"http://forum.fontlab.com/fontlab-studio/\") is the best choice but Summer seems to be a vacation time so response is slow. There is plenty of \"Loading FontLab\"stuff in older responses there so you should be able to search and find a ready answer. Be sure to check the Windows version specifically since Mac has different issues to deal with than PC.\n\n"
    },
    {
      "time": "30 Jun 2013 — 11:30am",
      "content": "\\>the industry leader in its field.  \nI think there was no argument for 10 years or more, but now the UFO world of programs, including the drawing programs Robofont and Glyphs have become serious competition. Only on the Mac, though.\n\n"
    },
    {
      "time": "30 Jun 2013 — 11:38am",
      "content": "Which is very ungracious.  \nOf course I understand that it costs money to port software to other platforms, but people should be encouraged to be more egalitarian and magnanimous. There's also an element of \"platform religion\", even after all these years.\n\nhhp\n\n"
    },
    {
      "time": "30 Jun 2013 — 11:55am",
      "content": "Yes, Hrant, and there is a huge amount of work involved in porting so don't be too hard on the programmers. This is not a trivial task. It also requires that they then support both platforms forever. Perhaps you might lead an effort to fund the porting effort for the software of your choice so that the developers don't starve while they are being so magnanimous? ;-)\n\n"
    },
    {
      "time": "30 Jun 2013 — 12:01pm",
      "content": "Actually porting SW is much easier than it used to be.\n\n> fund the porting effort\n\nMy point was that funds shouldn't be the only factor.  \nAnd nobody would starve.\n\nhhp\n\n"
    },
    {
      "time": "1 Jul 2013 — 5:59am",
      "content": "Different platforms. Different compilers. Different libraries. Different APIs/ABIs. Yes, clearly a one-banana problem.\n\n"
    },
    {
      "time": "1 Jul 2013 — 7:45am",
      "content": "No profit potential in sight, and nobody is starving:  \n [http://blog.craftingtype.com/post/54344540624/fontforge-for-windows-alpha](http://web.archive.org/web/20150416070249/http:/blog.craftingtype.com/post/54344540624/fontforge-for-windows-alpha \"http://blog.craftingtype.com/post/54344540624/fontforge-for-windows-alpha\")\n\nhhp\n\n"
    },
    {
      "time": "1 Jul 2013 — 7:54am",
      "content": "I don't know about the internals (\\*), but Glyph's unique look-and-feel comes from some _heavily_ utilizing native Mac OS X components.  \nIt would need not as much \"porting\" or \"re-writing\", but rather first finding out how these components actually work; and then you need to find a way to implement similar features on Windows or Linux.\n\n(\\*) It can be expected that _wherever possible_ its programmers would use native Mac components, even for \"internal\" stuff. Suppose OS X contains a native OpenType Feature compiler -- why create one yourself? .. Except that you won't get the same \"for free\" on Windows.\n\nAdobe tried to circumvent the whole UI porting problem by programming their own interface, freely borrowing ideas from both Mac and Windows. Alas, it handles as bad as Windows 1.0 once did.\n\n"
    },
    {
      "time": "4 Jul 2013 — 4:07pm",
      "content": "OK. I asked for a refund and a few hours later I have got one. I also got a reply [finally] from one of the developers [alex petrov] to my critical request. I have responded to him and our discussion is ongoing.\n\nSo installation process still = D -\n\nCustomer service = C [I suppose that there is some].\n\nNonetheless this was still a disappointing piece of software. I have told them that despite Fontlab working at face value, I had no way of knowing if python 2.75 was a stable version of python for this software.\n\n"
    },
    {
      "time": "4 Jul 2013 — 4:27pm",
      "content": "Nice of them to refund you, and so quickly.\n\nhhp\n\n"
    },
    {
      "time": "4 Jul 2013 — 5:34pm",
      "content": "Mr. Thornton:\n\nIt should be clear to you by now that most of us on Typophile do not share your opinion, so your grading is simply taken as venting. I suppose if it helps you to stop beating your wife, it's OK. As the story goes...\n\nLadies and Gentlemen, skinny and stout,  \nI'll tell you a tale I know nothing about;  \nThe Admission is free, so pay at the door,  \nNow pull up a chair and sit on the floor.\n\nOne bright day in the middle of the night,  \nTwo dead boys got up to fight;  \nBack to back they faced each other,  \nDrew their swords and shot each other.\n\nA blind man came to watch fair play,  \nA mute man came to shout \"Horray!\"  \nA deaf policeman heard the noise and  \nCame to stop those two dead boys.\n\nHe lived on the corner in the middle of the block,  \nIn a two-story house on a vacant lot;  \nA man with no legs came walking by,  \nand kicked the lawman in his thigh.\n\nHe crashed through a wall without making a sound,  \ninto a dry creek bed and suddenly drowned;  \nThe long black hearse came to cart him away,  \nBut he ran for his life and is still gone today.\n\nI watched from the corner of the big round table,  \nThe only eyewitness to facts of my fable;  \nBut if you doubt my lies are true,  \nJust ask the blind man, he saw it too.\n\n"
    },
    {
      "time": "4 Jul 2013 — 5:48pm",
      "content": "WRONG.  \nMr Charles Ellerston.  \nYour silly statements will now be destroyed by a far superior intellect that you have provoked - mine.\n\nOne, how on earth do you reach any conclusion about my opinions such that \"that most of us on Typophile do not share your opinion\". ?\n\nHave you done a survey? Have you asked people? I would expect that as in any forum there would be people with a variety of backgrounds, experiences and beliefs that lead to different opinions. Indeed, there was an expression of cynicism towards Fontlab earlier in this forum. In it doubt was expressed about me getting a refund:\n\n\"(I assume the OP's two whines constitute enough discussion. He could always ask for a refund -- though since FontLab is a what, 10-pesron company spread out over two continents, that may take a while, too.)\"\n\nWho wrote that? Yes! CHARLES ELLERSTON!\n\nClap. Clap. Clap. Isn't it cute when you can use someone's own quote against them. I mean, Charles my friend, please avoid any legal courtroom career whatsoever.\n\nAnyway, to continue my points. I have been absolutely fair to Fontlab. I have given one opinion about their customer service and I have changed it upon their service improving for me, namely that they have given me a refund. If their developer tells me something better about the installation process I may increase that grade also.\n\nThat is something entirely different from whining, whingeing or any other related verb. Rather, I have engaged in a constructive, factual, experiential process.\n\nActually let's define whining with a dictionary:\n\nverb (used without object)  \n1.  \nto utter a low, usually nasal, complaining cry or sound, as from uneasiness, discontent, peevishness, etc.: The puppies were whining from hunger.  \n2.  \nto snivel or complain in a peevish, self-pitying way: He is always whining about his problems.  \nverb (used with object)  \n3.  \nto utter with or as if with a whine: I whined my litany of complaints.  \nnoun  \n4.  \na whining utterance, sound, or tone.  \n5.  \na feeble, peevish complaint.  \nOrigin:  \nbefore 1150; Middle English whinen (v.), Old English hwīnan to whiz; cognate with Old Norse hvīna  \n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*  \nMy constructive posts here are totally at odds with the defin ition above.\n\nRunning scared now eh? I'm a guy who guys to the dictionary and uses my brains.\n\nYou. sir, are the one who doesn't know what he or she is talking about.\n\n"
    },
    {
      "time": "5 Jul 2013 — 1:35am",
      "content": "> My constructive posts here ...\n\nWhat an odd statement, from someone being a member for \"1 week 7 hours\" (per 5-Jul, 10:32AM GMT+1).\n\n"
    },
    {
      "time": "5 Jul 2013 — 2:39am",
      "content": "So? What is your point? One week isn't long enough to make constructive posts? Or are you on some of elitist post-count competition?\n\nWell? Theunis De Jong, are you capable of ANYTHING remotely intelligent?\n\nIf you post claptrap like your last excuse for intelligence I will destroy your claptrap as well.\n\n"
    },
    {
      "time": "5 Jul 2013 — 8:14am",
      "content": "FL are kind of like your partner for life, and it's usually a pretty good deal —&nbsp;you give them 4-5 hundred $, and you get to keep all the fonts you make. Good luck!\n\n"
    },
    {
      "time": "17 Jul 2013 — 12:43pm",
      "content": "betacarmody,\n\nCharles’ rant was inappropriate. Regardless of the reason, you had a bad experience, and your complaints did not seem unreasonable.\n\nBut the way you lash out against \\*any\\* criticism or disagreement is equally misplaced. For example, people who have frequented these forums for years may very well have a much more developed sense of the general opinion around here about FontLab customer service and/or tech support. That is not unreasonable.\n\nCheers,\n\nT\n\n"
    }
  ]
}
