{
  "id": "104276",
  "title": "At the limits of screen rendering...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Most of us already knew it, although some of us wouldn't admit it (and some still won't): If you know what you're doing, when you approach the limits the rendering superiority of Windows is very apparent.\n\n ![](http://web.archive.org/web/20130816114624im_/http:/typophile.com/files/Sentinel9_5512.jpg)\n  \nThe above is H&FJ's Sentinel webfont on Windows/IE8 (L) and OSX (R).\n\nhhp\n\n",
  "author": "hrant",
  "time": "1 Jul 2013 — 11:11am",
  "uid": "1250",
  "comments": [
    {
      "time": "1 Jul 2013 — 12:22pm",
      "content": "I prefer the one on the right. The x-height to cap proportions are better and the kerning is superior. Also the waist strokes on the H and F while a tad low look better than the overly high version on the left.\n\n"
    },
    {
      "time": "1 Jul 2013 — 4:01pm",
      "content": "For what it's worth, looking at this in Safari on an iPhone (late at night), the one on the right looks better. I have no bias I am aware of, use Windows 7, Ubuntu and OSX (I loved my old Amiga most of all though!) but the one on the right just looks clearer to me.\n\n"
    },
    {
      "time": "1 Jul 2013 — 4:53pm",
      "content": "Hm. Isn't there a problem that we're looking at static graphics of webfonts on devices other than the ones intended? Or is that the whole point of making the graphics? I'm confused :-/\n\n"
    },
    {
      "time": "2 Jul 2013 — 1:37am",
      "content": "Windows is doing some horrible things to those caps. Look at the bar on the 'H'. You could drive a bus between the 'F' and 'J'. If we're equating rendering superiority with sharpness alone then Windows is winning here, but it's lost most of the character of the typeface and is showing a fair bit of dazzle. If I was going to be reading anything more than a paragraph I'd plump for the OSX rendering.\n\n"
    },
    {
      "time": "2 Jul 2013 — 11:11am",
      "content": "I think the general qualities of this work are great. What's been compared here, though, is rather subtle. If the publishers at some point decide to pump a PX into the cap ht., and the browser decides to kern, the differences between these two samples are so small, few would stretch to describe the difference as significant, (much less, any more than that). There was most likely a difference in devilopment paths with the one on the left being a pain in the ass long after the one on the right is complete. And... at 9 PX, i think there are very few users on the right side to begin with.\n\n"
    },
    {
      "time": "2 Jul 2013 — 6:02pm",
      "content": "Angels... how many... size of the pin.\n\n"
    },
    {
      "time": "2 Jul 2013 — 6:51pm",
      "content": "Yeah, count me among those who \"still won't admit it\" too!\n\n"
    },
    {
      "time": "2 Jul 2013 — 10:56pm",
      "content": "What are we comparing here? How two operating systems render type that's too small to be comfortably read on-screen in the first place?\n\n"
    },
    {
      "time": "3 Jul 2013 — 7:25am",
      "content": "“Superior” in what sense? Readability or accurate representation of the geometry as it would appear on an infinite resolution device?\n\nThese are two different intentions which produce, as your screenshot illustrates, different results.\n\nComparing the pixels is missing the point somewhat.\n\n"
    }
  ]
}
