{
  "id": "104251",
  "title": "How common is it to specify the typeface in books?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "About 70% of the books I’ve looked at recently in shelves and book stores had specified the typeface the book was set in (some with point size and leading). Most were on the verso of the title-leaf, a few books had colophons. I didn’t take note of this part of book design until just recently, and I haven’t looked so much at books set in English. How common is this?\n\nApropos: Nearly all the books I looked at were in Sabon or Garamond (mostly unspecific, one in Premier), one was in Adobe Caslon and one in Weiss.\n\n",
  "author": "sanderpe",
  "time": "30 Jun 2013 — 4:53am",
  "uid": "212473",
  "comments": [
    {
      "time": "30 Jun 2013 — 5:03am",
      "content": "I should say, most were on the copyright and publisher information page, and not always with the title page.\n\n"
    },
    {
      "time": "30 Jun 2013 — 6:12am",
      "content": "What follows is all based on publishing in America...\n\nWith respect to the information on the copyright page, it's a fairly recent trend -- recent meaning the last 5-10 years. It did happen before, but was rare. Often accompanies an acknowledgment for the interior designer.\n\nNot really sure why the copyright page has taken off this way. It's always been a place for legal acknowledgments, and note that country of manufacture use to be a legal matter for copyright, as a U.S. copyright use to require U.S. manufacture.\n\nThe copyright page was also a logical place for the Library of Congress Cataloging in Publication Data (CIP). As photocopy machines became common (& card catalogs were still in use) there was a requirement that the CIP data be graphically in the form the LOC sent the publisher. The card catalog card could just be photocopied from the copyright page, and the book got into circulation much faster. That could help sales as well.\n\nHowever, that \"exact graphic form\" requirement annoyed some designers, esp. Richard Eckersley, and he was somewhat vocal about this. The net result was more design effort was put into the copyright page, and that occasioned more editorial attention (editors wanted to make sure the Libraries & LOC was happy). So, I suppose, minor acknowledgements beyond legal ones began to creep on to the page.\n\nSome of this is speculation, but is based on I\" was there\" experiences with the whole matter.\n\n\\* \\* \\*\n\nEven with the newer practice of adding blanks to a book to reach even forms, using a colophon is quite rare. Probably because no one at the publishing house has the knowledge. Usually when we're asked to set one, the designer asks us about the typeface, they have no knowledge about it. Easier for them to just use blanks.\n\nThere's a thought for type designers. If you want a press to promote your type, write colophon information & include it with all the downloads. Just remember (1) be modest, (2) be very brief, and (3) remember, nobody reads text file attachments to fonts anyway.\n\n"
    },
    {
      "time": "30 Jun 2013 — 8:21am",
      "content": "That's a great idea.\n\nhhp\n\n"
    },
    {
      "time": "30 Jun 2013 — 9:51am",
      "content": "I suppose I should add there is little reason for CIP data to be in the same graphical form anymore. Firstly, library sales are way off. More important is that few libraries use physical card catalogs anymore. Still, a few publishers (their editors, really) hang on to the notion.\n\nSince Eckersley was a very influential book designer, even more attention is being paid to the copyright page. What few remember is that late in his life,\\* Richard allowed it was silly to make all front mater pages look the same (includes adhering to a grid for them), so a lot of the \"design attempts\" for copyright pages sort of miss his point.\n\n\\*Paper given at the AAUP annual meeting in St. Louis. I forget the year -- it was the same one Carter & Creesy gave the presentation on the Monticello revival in PostScript for Princeton University Press.\n\n"
    },
    {
      "time": "30 Jun 2013 — 11:04am",
      "content": "It may just be that publishers always have space on the copyright page so adding a line about typeface is easy to do and proofread.\n\n"
    },
    {
      "time": "30 Jun 2013 — 12:54pm",
      "content": "I think we can spread out from books on type or typography and find this infiltrating everything else.\n\nNearly every book about typography I've read has either had a colophon or given attribution for the typeface. Spreading out, books about graphic design seem to be keen on this. Related to this scene is art photography, which often follows the pattern. Further out, any novel or book that is very \"designed\" these days seems to attribute the typeface. I can definitely see the 5-10 year thing, but it's happened a long time with books by Typophiles. We just love telling everyone about the face we used for our books.\n\n"
    },
    {
      "time": "30 Jun 2013 — 1:28pm",
      "content": "> We just love telling everyone about the face we used for our books.\n\nYes, you do. Problem is, no one else cares much. Just what do you think the hierarchy is at a publishing house, anyway? Design is right above janitorial & below everything else. On good days.\n\nEditors (who control copy) hope the designer picks a good typeface. That's like saying \"wears sensible shoes.\" You'll note the typefaces the original poster mentioned were \"Sabon,\" \"Garamond\" etc. What does editorial say if the designer doesn't pick a sensible typeface? They say NO. And they win.\n\nIt's OK to live in you own world. If you start thinking it's everyone's world, there is a lot of disappointment headed your way.\n\n"
    },
    {
      "time": "30 Jun 2013 — 2:07pm",
      "content": "That's too black-and-white. Of course nobody but type designers cares about type as much as we do, but there are plenty of non-designers who realize how central type is to how something looks and feels, and as a result values good type selection. Note that type designers are not the ones including the references in the copyright pages and colophons.\n\nhhp\n\n"
    },
    {
      "time": "30 Jun 2013 — 2:56pm",
      "content": "> That's too black-and-white.\n\nI imagine, in the world that use to rely on hand lettering -- the advertising world, wasn't it? Seems to me that 90+ percent of the new fonts are aimed at replacing hand lettering. I will allow I'm somewhat parochial, I don't know much about what goes on in Central & Eastern Europe. Maybe things are different.\n\nBut we're talking about books in this thread. Just for example -- in the States -- how many times do you see a printed book from a publisher with an imprint that (1) isn't an art book, yet (2) uses a sans-serif font for text?\n\nBTW, we're talking about books, and not jackets. Tschichold's old dicta \"first thing you do when you buy a book is to throw away the jacket\" may not be much followed anymore. Probably we should. At a publishing house, book jackets (for those that don't know), are the purvey of marketing, not editorial. And most \"book designers\" want to be jacket designers. The number of people who can put together a good book interior is quite small these days, where \"good\" has to satisfy audiences beyond the design/fashion world.\n\n"
    },
    {
      "time": "30 Jun 2013 — 4:23pm",
      "content": "Well, remember, 90% of _anything_ is crap... :-)\n\nhhp\n\n"
    },
    {
      "time": "1 Jul 2013 — 6:06am",
      "content": "> There's a thought for type designers. If you want a press to promote your type, write colophon information & include it with all the downloads.\n\nFWIW: This kind of information (brief, preferably) can be stored in the font info \\<name\\> table in name record id 10. That’s basically what it’s for. Most font management apps will present this information, if present, somewhere in the interface.\n\nOf course, users are not much more likely to go looking for this than they are to read a ReadMe file with the download, but at least this information travels with the font.\n\n"
    },
    {
      "time": "8 Jul 2013 — 3:02am",
      "content": "Здравсвуйте пользователи форума typophile.com, сегодня моя подруга AnnaRom просила меня сообщить последние новинки Кеды в этом году, а так же джинсов бренда Кеды Napapijri, так вот наконецто нашла время для этого, админы если не туда запостила прошу не удалять, а перенести в соответствующий раздел, если я ошиблась например Кеды ))) всех люблю)))\n\n6]Кеды цена 4980.00  \n руб.  \nЕсли Вам понравились Кеды, нажмите кнопку \"Хочу купить\" ниже чтоб узнать где выгодней всего купить Кеды бренда Кеды Napapijri\n\n[![]()http://lmcdn.ru/media/catalog/product/N/A/NA154AWHE952\\_1.jpg](http://web.archive.org/web/20130821062440/http:/ad.admitad.com/goto/3f2779c2d4100c0c018b4e8640d77b/?ulp=http%3A%2F%2Fwww.lamoda.ru%2Fshoes%2Fwomen%2Fnapapijri-kedy-na154awhe952%2F)\n\n[![]()http://s2.ipicture.ru/uploads/20130429/D2sj2DBG.jpg](http://web.archive.org/web/20130821062440/http:/ad.admitad.com/goto/3f2779c2d4100c0c018b4e8640d77b/?ulp=http%3A%2F%2Fwww.lamoda.ru%2Fshoes%2Fwomen%2Fnapapijri-kedy-na154awhe952%2F)\n\n[посмотрите другую стильную одежду](http://web.archive.org/web/20130821062440/http:/ad.admitad.com/goto/3f2779c2d4100c0c018b4e8640d77b/?ulp=http%3A%2F%2Fwww.lamoda.ru%2Fshoes%2Fwomen%2Fnapapijri-kedy-na154awhe952%2F)\n\nКатегория: Кеды Napapijri купить  \nБренд: купить Кеды Кеды Napapijri\n\nВот еще слова по которым люди ищут Кеды:  \n- купить Кеды  \n- заказать Кеды  \n- цена 4980.00\n\n- интернет магазин Кеды Napapijri  \n- интернет магазин Кеды Napapijri Москва  \n- новинки Кеды Napapijri 2013  \n- модные Кеды Napapijri 2013  \n- купить Кеды Москва  \n- купить Кеды Киев  \n- купить Кеды Санкт-петербург  \n- интернет магазин Кеды Москва\n\n$##$\n\n"
    },
    {
      "time": "8 Jul 2013 — 3:02am",
      "content": "Здравсвуйте пользователи форума typophile.com, сегодня моя подруга AnnaRom просила меня сообщить последние новинки Кеды в этом году, а так же джинсов бренда Кеды Napapijri, так вот наконецто нашла время для этого, админы если не туда запостила прошу не удалять, а перенести в соответствующий раздел, если я ошиблась например Кеды ))) всех люблю)))\n\n6]Кеды цена 4980.00  \n руб.  \nЕсли Вам понравились Кеды, нажмите кнопку \"Хочу купить\" ниже чтоб узнать где выгодней всего купить Кеды бренда Кеды Napapijri\n\n[![]()http://lmcdn.ru/media/catalog/product/N/A/NA154AWHE952\\_1.jpg](http://web.archive.org/web/20130821062440/http:/ad.admitad.com/goto/3f2779c2d4100c0c018b4e8640d77b/?ulp=http%3A%2F%2Fwww.lamoda.ru%2Fshoes%2Fwomen%2Fnapapijri-kedy-na154awhe952%2F)\n\n[![]()http://s2.ipicture.ru/uploads/20130429/D2sj2DBG.jpg](http://web.archive.org/web/20130821062440/http:/ad.admitad.com/goto/3f2779c2d4100c0c018b4e8640d77b/?ulp=http%3A%2F%2Fwww.lamoda.ru%2Fshoes%2Fwomen%2Fnapapijri-kedy-na154awhe952%2F)\n\n[посмотрите другую стильную одежду](http://web.archive.org/web/20130821062440/http:/ad.admitad.com/goto/3f2779c2d4100c0c018b4e8640d77b/?ulp=http%3A%2F%2Fwww.lamoda.ru%2Fshoes%2Fwomen%2Fnapapijri-kedy-na154awhe952%2F)\n\nКатегория: Кеды Napapijri купить  \nБренд: купить Кеды Кеды Napapijri\n\nВот еще слова по которым люди ищут Кеды:  \n- купить Кеды  \n- заказать Кеды  \n- цена 4980.00\n\n- интернет магазин Кеды Napapijri  \n- интернет магазин Кеды Napapijri Москва  \n- новинки Кеды Napapijri 2013  \n- модные Кеды Napapijri 2013  \n- купить Кеды Москва  \n- купить Кеды Киев  \n- купить Кеды Санкт-петербург  \n- интернет магазин Кеды Москва\n\n$##$\n\n"
    }
  ]
}
