{
  "id": "104374",
  "title": "A call to type designers...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nfirst post here - I'm delighted to see so many famous names hanging around :)\n\nOn to my humble request...  \nAs a typophiliac, semantics-obsessed scientist I frequently typeset texts containing various scientific terms and notations. Whenever publishing guidelines are not strict, I usually opt for some pretty typeface I deem suitable. However, the choice appears rather limited due to a few characters absent from many, many fonts, even the most expensive or carefully crafted ones: a few greek letters, a superscript \"+\". Remember your high school chemistry lectures and these awful equations? (CaCO3 + CO2 + H2O = Ca2+ + 2 HCO3) Remember the Czernobyl disaster and its bunch of alpha, beta and gamma rays? Well... most typefaces cannot accurately convey this information.\n\nI hear you say \"just use the 'superscript' 'subscript' functions in your word processor\" and \"type a, b, g and switch to Symbol font\". Unfortunately, that's not how things should work, for both practical and ethical reasons. Practical: a 'g' is a 'g' is NOT a 'gamma'. Copy-paste between various apps that don't care about fonts, you end up with hard-to-decipher sentences where one can not distinguish between what was a greek letter and what is a latin letter. Let your text be indexed by Google or whatever scientific tool you use, everything is stored as plain text - your pretty 'gamma G' is actually some meaningless 'GG'. From a more \"philosophical\" viewpoint, characters that look exactly similar may have very different _meanings_, hence the need for specific rules and notations (e.g. in Unicode) - 'hyphen' is not 'minus' is not 'dash', _semantically_. A superscript '+' in a formula is not just a '+' above baseline; it conveys a very different kind of information (one is a logical operator, the other a symbol for ions). Even to a trained chemist, _d13C(CO32-+Ca2++14C6)2_ asks for misreading.\n\nI know designing a good typeface is a lot of work. Let's not ask for every font out there to support polytonic greek and the full unicode charset. But... everytime you neglect a superscript '-' or '+', everytime you omit those few greek letters used routinely by scientists worldwide (alpha beta gamma delta epsilon...), you make your pretty baby look less cute to a small but interesting part of the publishing community... ;)  \nNothing could excite me more than Hypatia Sans Pro (or any other great Adobe typeface) getting the 'sups+' it deserves... (Solace: Canada Type just released Aragon ST, it's next on my shopping list!)\n\n_Off-topic_: anybody having experience with upgrade policies at Adobe? I recently bought the Italics pack to complement Hypatia Sans Pro, and I end up with much newer versions (2.072?) than the old Hypatia upright weights that once came as a goodie from Adobe (1.008). According to the readme files, many quirks were fixed inbetween. I haven't noticed striking discrepancies yet but I'm worried mixing both packages could lead to visual glitches. Still, couldn't find any info about discount upgrade paths for fonts at Adobe.com. Agreed, I'm dreaming aloud :)\n\nCheers\n\n",
  "author": "Etawin Cthulhu",
  "time": "5 Jul 2013 — 9:18am",
  "uid": "212839",
  "comments": [
    {
      "time": "5 Jul 2013 — 9:52am",
      "content": "Some of this is due to cost-benefit analysis, but surely some is due to ignorance (I'd count myself in the latter category for instance). AFAIK it's easy to look up all the diacriticals needed for, say, Polish language support, but is there a trustworthy list for \"math/science language support\"? If not this thread would be one place we could construct one.\n\nWhat is implied by the ellipsis after \"alpha beta gamma delta epsilon...\"?\n\n"
    },
    {
      "time": "6 Jul 2013 — 11:42am",
      "content": "ph'nglui mglw'nafh Cthulhu R'lyeh wgah'nagl fhtagn\n\nSorry, I just had to get that out...  \nAnyway, drop a complete list with examples, names and unicodes and I will make certain that I include them in future releases. Any opentype coding required would be helpful. I would do the research myself, but I'm still trying to wade through the connected cedilla, disconnected cedilla or comma accent controversy. The downside is all I ever create is display and sign fonts (well, there is Data Gothic.)\n\n"
    },
    {
      "time": "7 Jul 2013 — 1:30am",
      "content": "I guess the problem is there are simply too many science symbols. Look at Cambria Math. Though most people who works in science probably only need a small subset of what Cambria Math offers, different people will want different subset of it.\n\nI think you should at least find a font with Unicode greek support. Times/Calibri/whatever common font you find will be way better than using the Symbol font as it's at least encoded correctly.\n\n[Disclaimer: I'm not a type designer]\n\n"
    },
    {
      "time": "8 Jul 2013 — 8:21am",
      "content": "This is an area that I am looking into at the moment. I have added some of those features into fonts myself, to support content that requires correct Unicode support and the OpenType features to implement it.\n\nAre you aware of/do you use, [MathJax](http://web.archive.org/web/20150414022957/http:/www.mathjax.org/)? It takes advantage of the [STIX fonts](http://web.archive.org/web/20150414022957/http:/www.stixfonts.org/) and was created to address the need for math and scientific communities publishing content on the web.\n\n[XITS](http://web.archive.org/web/20150414022957/http:/www.typophile.com/wiki/https%3A/%252Fgithub.com/khaledhosny/xits-math) is a project which aims to create an OpenType implementation of the STIX fonts.\n\nRoss Mills, who did a lot of the engineering work on Cambria Math has also produced, [Maxwell (this link leads to a PDF display or download depending on your browser)](http://web.archive.org/web/20150414022957/http:/www.tiro.com/Maxwell/Maxwell_beta_1.5_spec.pdf).\n\nThere is also an open source font called, [Asana Math](http://web.archive.org/web/20150414022957/http:/www.ctan.org/tex-archive/fonts/Asana-Math/) designed to address the same need for typesetting within MS Word 2007/2010 as Cambria Math. It also works with XeTeX.\n\nImplementing the features and support that you require is definitely something that individuals and small groups are mindful of but doing it well can be extremely time consuming and difficult, which means that it is unlikely to see widespread adoption.\n\n"
    },
    {
      "time": "8 Jul 2013 — 12:52pm",
      "content": "_Whenever publishing guidelines are not strict, I usually opt for some pretty typeface I deem suitable._\n\nWell, you’re walking into an oxymoron there.\n\nI don’t provide this degree of math support because there is not enough market to justify the development, for a commercial foundry.\n\nFirstly, various free fonts (from non-commercial foundries) address the need, e.g. Cambria and Old Standard.  \nSecondly, the academic community is not really typeface savvy, or has a perverse taste (witness the CERN announcment in Comic Sans). I can actually respect and understand that, as a pretty typeface might be construed as smoke-and-mirrors hype, which goes against the grain of dispassionate communication.\n\nA scientiﬁc version of Comic Sans would be much appreciated, I suspect, with the appearance of having been freshly written on a blackboard.\n\n"
    },
    {
      "time": "8 Jul 2013 — 1:39pm",
      "content": "@Etawin Cthulhu: So far, I understand that you don’t like it when typefaces are designed without complete character-sets as it can inhibit their application to academic writing. Can you please clarify your request?\n\n"
    },
    {
      "time": "11 Jul 2013 — 6:51am",
      "content": "OK,  \nsorry for the delayed reply.\n\nFirst let me say \"math\" writing is a separate issue. As someone already mentioned, it is a very narrow niche that relies on an inordinate amount of weird glyphs (no offense!); furthermore, having a dedicated font comprising both scientific and common glyphs is largely unnecessary for math, given how publications in this field usually typeset equations 'out of the text'.\n\nI went combing my bibliographic database for normal science articles (in the field of natural and physical sciences) issued in both mainstream (~Science, Nature...) and highly-specialized journals (Acta Geologica Sinica). It seems the range of characters needed for run-in sentences is way lower than with maths. Roughly: a range of lowercase greek letters (alpha beta gamma delta epsilon seem the most common), subscript/superscript numbers and usual mathematical operators (₊₋₌₍₎⁺⁻⁼⁽⁾ⁿ), permil, and extended-latin glyphs (to account for east-european and turkish names... however foreign localities and names using exotic alphabets are almost invariably latinized - no need for cyrillic or simplified chinese glyphs!). I'll gladly dig into other scientific-non-mathematic fields e.g. medical biology and the such, to check if additional glyphs are routinely used.\n\nSome composite - and largely non-sensical - example:  \n<cite>In this study, ⁸⁷Sr/⁸⁶Sr ratios were calculated for samples of Mn⁴⁺-rich carbonates according to the method by Chlupáč et al. (1989). In addition, a δ¹⁸O signal of 5.3±0.07‰ for the phosphate fraction was measured by γ-diffractometry for samples of average composition (Xⁿ⁺Y²ⁿ)₂(CO₃)₂.</cite>  \nImpossible to type that sentence \"semantically\" using e.g. the widespread and highly functional Myriad... for lack of a superscript plus.\n\nI agree that \"Times & Cambria & Helvetica & Lucida Sans Unicode & Comic Sans\" ought to be enough for anybody in the academia. Still I wonder whether these typefaces are used and abused because they're the top of the crop, or because nothing else is there to overthrow them... ;) Please bear in mind that communication is at the very heart of science, and increasingly so - scientific communication and popularization is now taught at universities, and includes how to use infographics etc.\n\nBy the way, many science [e]books/textbooks but the driest ones use a surprising diversity of font combinations. I've already noticed Berkeley, Frutiger, Dante, Myriad, Warnock among others... a bit more fanciful than old boring Times, yet legible and serious enough for serious matters. The Proceedings volume of the last conference I attended had a _pretty_ cover featuring some Stempel Garamond. No heart attack in the audience... none that I know of ;)\n\nedit: just got me a weight of Aragon ST (new typeface intended for scientific writing), and it appears to have all the glyphs I need. However their encoding is a bit... strange (relying on stylistic sets and Co.). Richler looks great, but lacks that damn sups+.\n\n"
    },
    {
      "time": "11 Jul 2013 — 9:06am",
      "content": "Thanks for the explanation, the sample text is very helpful.  \nI will certainly be putting the extra character you mention in my next “big” fonts.\n\n"
    },
    {
      "time": "11 Jul 2013 — 10:48am",
      "content": "<cite> &gt;subscript/superscript numbers and usual mathematical operators (₊₋₌₍₎⁺⁻⁼⁽⁾ⁿ)</cite>\n\nI didn’t know about that (I don’t set any math or scientific texts), and they can be added easily. So do you only need subscript/superscript for these three mathematical operators: +, −, = ?\n\nIf so, I guess I can add them on my next typefaces.\n\n<cite> &gt; I'll gladly dig into other scientific-non-mathematic fields e.g. medical biology and the such, to check if additional glyphs are routinely used.</cite>\n\nThat would be great. And very useful.\n\n"
    },
    {
      "time": "11 Jul 2013 — 11:44am",
      "content": "Are you saying you need sub and superscript Greek glyphs as well as sub and superscript math operators?\n\n"
    },
    {
      "time": "11 Jul 2013 — 11:56am",
      "content": "Almost every Terminal Design font has sub and super math operators.\n\n"
    },
    {
      "time": "11 Jul 2013 — 1:01pm",
      "content": "@Etawin Cthulhu: Thanks for the additional information. However, I still see no “humble request” in your posts. Is there anything specific you are looking for to help your fellow Typophiles provide you with more directed feedback?\n\n"
    },
    {
      "time": "11 Jul 2013 — 4:54pm",
      "content": "@Cristobal Henestrosa \\> basically yes, definitely super-/subscript plus and minus, and possibly parentheses and equal. That's four to eight glyphs. Some typefaces already feature some of them, yet they almost invariably lack the super-/subscript 'plus'. (If the genies of typography would allow me one humble wish, I'd probably spend it on that superscript plus.)\n\n@dezcom \\> no, no greek letters. (I have never encountered super-/subscript greek letters... yet)\n\n@.00 \\> yay! Nice one. Moraine (or FF Tundra?) would please many a climatologist...\n\n@Chris Dean \\> Request: if you are so passionate/dedicated as to add a whole range of greek letters and sub-/superscripts, please, pretty please, think of that tiny superscript plus. :)\n\n"
    },
    {
      "time": "11 Jul 2013 — 5:42pm",
      "content": "Thanks for the clarification Etawin Cthulhu. To follow that, if anyone knows of any typefaces that meets your requirements (or come close to), can you please post them here?\n\n"
    },
    {
      "time": "11 Jul 2013 — 8:06pm",
      "content": "My next release will, I am only shy 2 Greek glyphs and a plus sign.\n\n"
    },
    {
      "time": "12 Jul 2013 — 4:54am",
      "content": "Advice to colleagues: kern pairs to consider with your superior plus and minus should include subsequent punctuation — primarily comma and period.\n\nFrom the sample text of a recent gardening reference I designed (trade publication, incidentally, not scholarly):\n\n ![](http://web.archive.org/web/20150414022957im_/http:/typophile.com/files/SGTG-plussups2_6536.jpg)\n\n"
    },
    {
      "time": "12 Jul 2013 — 5:11am",
      "content": "With an extended superscript string like that, where is the optimal spot for the ensuing baseline punctuation?\n\n"
    },
    {
      "time": "12 Jul 2013 — 5:37am",
      "content": "Yes, it is a typographic challenge. It’s not unlike the _quotedblright-comma_ and _comma-quotedblright_ sequences.\n\nYou can see the choice I made — tucked, but not directly under. The gap will never be eliminated altogether. I experimented, and in the end I preferred to retain some sense of sequence. Others may have chosen to go tighter. But reasonable typographers may reasonably disagree.\n\n"
    },
    {
      "time": "12 Jul 2013 — 7:23am",
      "content": "\"...reasonable typographers may reasonably disagree\"\n\nKent, Since I like your solution, does that mean I am not a \"reasonable typographer\"? ;-)\n\n@Kent, also, I still owe you a drink! Will you be at TypeCon?\n\n"
    },
    {
      "time": "12 Jul 2013 — 9:55am",
      "content": "Chris, you are a known unknown.\n\n"
    },
    {
      "time": "13 Jul 2013 — 4:58am",
      "content": "> does that mean I am not a \"reasonable typographer\"?\n\nOf course not. That would be unreasonable. ;-)\n\nYes, Portland is old stomping grounds. I’m looking forward to revisiting after nearly 25 years’ absence. Although I no longer remember what for, I will be happy to collect on your debt.\n\n"
    },
    {
      "time": "13 Jul 2013 — 9:49am",
      "content": "See you there!\n\n"
    },
    {
      "time": "13 Jul 2013 — 12:33pm",
      "content": "\\> A scientiﬁc version of Comic Sans would be much appreciated, I suspect, with the appearance of having been freshly written on a blackboard.\n\nWhat about AMS Euler by Zapf?  \n( [http://en.wikipedia.org/wiki/AMS\\_Euler](http://web.archive.org/web/20150414022957/http:/en.wikipedia.org/wiki/AMS_Euler \"http://en.wikipedia.org/wiki/AMS\\_Euler\") )\n\n"
    },
    {
      "time": "13 Jul 2013 — 12:52pm",
      "content": "Nice idea, but doesn’t look like chalk writing.\n\n"
    },
    {
      "time": "13 Jul 2013 — 12:57pm",
      "content": "Don't scientists want to be taken seriously anymore?\n\n"
    },
    {
      "time": "13 Jul 2013 — 2:18pm",
      "content": "If you want da money, you gotta sing and dance for the masses. Otherwise they vote the gong on you!\n\nhhp\n\n"
    },
    {
      "time": "13 Jul 2013 — 3:31pm",
      "content": "Chris, exactly why they want to be taken seriously: slick typography is too much smoke and mirrors.  \nTherefore, Comic Sans ﬁts the bill, it is a default, unpretentious, and a bit like blackboard writing.  \nHowever, more appropriate for “powerpoint” displays than research papers.\n\n"
    },
    {
      "time": "17 Jul 2013 — 2:37am",
      "content": "I could not add anything useful to this thread, except to say how fortunate I was when illustrating my Beautiful Universe Theory physics papers, to be able to design my own font for the special symbols needed!  \n [read about it here.](http://web.archive.org/web/20150414022957/http:/typophile.com/node/78490)\n\n ![](http://web.archive.org/web/20150414022957im_/http:/typophile.com/files/bu_font_corrected_5520.jpg)\n\n"
    },
    {
      "time": "25 Jul 2013 — 5:35am",
      "content": "@Etawin,  \nalthough [Andron Mega](http://web.archive.org/web/20150414022957/http:/www.signographie.de/cms/front_content.php?idart=215) is not an actual Math font, you’ll be most likely on the safe side with it for such purposes.  \nAnd my extension support policy is far better than Adobe’s ;-)\n\n"
    },
    {
      "time": "29 Jul 2013 — 6:13pm",
      "content": "Thanks for the kind words on Hypatia Sans. The changes made in the upright since the initial release have been generally minor/obscure; I would not worry about compatibility issues.\n\nI expect the current Adobe Type staff have already noted this thread, but I will point them at it nonetheless, regarding the superscript + and so forth.\n\n"
    },
    {
      "time": "18 Jan 2015 — 9:53pm",
      "content": "Added these few glyphs to my latest [https://www.myfonts.com/fonts/schizotype/flat-sans/](http://web.archive.org/web/20150414022957/https:/www.myfonts.com/fonts/schizotype/flat-sans/ \"https://www.myfonts.com/fonts/schizotype/flat-sans/\")\n\n"
    }
  ]
}
