{
  "id": "104343",
  "title": "BT Torino, and its OPTI descendants",
  "forum": "General Discussions",
  "tags": [
    "encoding",
    "font naming",
    "font setup",
    "General Discussions"
  ],
  "content": "I have long used Torino BT as a text font, and recently obtained Torino OPTI Bold, Extra Bold, Heavy. I was delighted to finally have a bold, but Torino doesn't co-operate. It 'substitutes' a font like Old Standard bold, which is similar, but will not show Torino OPTI Bold, now named as simply, 'Torino bold' Having re-named the entire family, the problem persists. I'm stumped. Can anyone shed light?\n\n",
  "author": "typophilus",
  "time": "3 Jul 2013 — 7:08pm",
  "uid": "179846",
  "comments": [
    {
      "time": "4 Jul 2013 — 3:01am",
      "content": "Typophilus, I notice that you list yourself as a writer in your profile. When communicating, it's best if you do not assume that everybody else is exactly like you.\n\nWhat is the computer operating system? What software? Perhaps a courtesy link to the font? How did you install the fonts? Did you do the obligatory reboot to see if this fixes the problem?\n\n"
    },
    {
      "time": "6 Jul 2013 — 9:23pm",
      "content": "Thanks for replying. I'm using Windows 7; my font manager is Serif Font Manager.  \nChecking the fonts in Font Creator, I've checked Font Family Name, Unique font Identifier, Full Font Name and Postscript Name, also checking Font Settings Classification, Weight and Design. I've also run Auto Naming, (which necessitates manual 'fixing' anyway).  \nI've checked Torino's entry in the Windows font folder; it will NOT display Torino Bold there either. When I paste Torino Bold into this folder, it vanishes!? Is THIS a pointer to what goes on? Note that this is not a Windows font Collection; they're all just True Types.\n\n"
    },
    {
      "time": "7 Jul 2013 — 7:46pm",
      "content": "Thanks for replying. I'm using Windows 7; my font manager is Serif Font Manager.  \nChecking the fonts in Font Creator, I've checked Font Family Name, Unique font Identifier, Full Font Name and Postscript Name, also checking Font Settings Classification, Weight and Design. I've also run Auto Naming, (which necessitates manual 'fixing' anyway).  \nI've checked Torino's entry in the Windows font folder; it will NOT display Torino Bold there either. When I paste Torino Bold into this folder, it vanishes!? Is THIS a pointer to what goes on? Note that this is not a Windows font Collection; they're all just True Types.\n\n"
    },
    {
      "time": "8 Jul 2013 — 5:17am",
      "content": "To me it seems that BT und OPTI may indicate that these Torino weights come from different foundries. Maybe one or more of their font name and/or style entries are too similar and cause a font name conflict. Are you sure that you have deleted all of the font caches after ‘fixing’ the names?\n\n"
    },
    {
      "time": "14 Jul 2013 — 8:30am",
      "content": "Well, I've re-named all these as simply 'Torino', with the usual modifiers. There is a Torino Medium,and a Heavy, which have a Regular as their font subfamily names. I don't know which 'font cache' you mean. Where would I find that?\n\n"
    },
    {
      "time": "15 Jul 2013 — 12:50pm",
      "content": "Just out of curiosity: Where did you get the OPTI fonts from?\n\n"
    },
    {
      "time": "16 Jul 2013 — 5:42am",
      "content": "In the alt-binaries.fonts site. The Address is [http://opti.netii.net/index.htm](http://web.archive.org/web/20130819232402/http:/opti.netii.net/index.htm \"http://opti.netii.net/index.htm\")  \nLots of re-drawn and re-jigged fonts, handy, though not new ones.\n\n"
    }
  ]
}
