{
  "id": "104341",
  "title": "Does H&FJ Whitney Greek include polytonic?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Tried to figure this out from the website, then did a Google search, but can't find anything indicating Whitney **includes** polytonic Greek. Usually that means no, does anyone know for sure?\n\n",
  "author": "charles ellertson",
  "time": "3 Jul 2013 — 4:37pm",
  "uid": "5094",
  "comments": [
    {
      "time": "3 Jul 2013 — 5:37pm",
      "content": "What [this](http://web.archive.org/web/20140730182127/http:/www.typography.com/fonts/whitney/features/whitney-multiscript-language-support) site says seems pretty clear to me:\n\n> H&FJ's Greek character set covers Modern (monotonic) Greek.\n\nToo bad!\n\n"
    },
    {
      "time": "3 Jul 2013 — 10:31pm",
      "content": "Figgins Sans’ Greek is quite similar to Whitney’s, and has polytonic and other Greek options.  \nSee pages 55-57 of the PDF:  \n [http://origin.myfonts.com/s/aw/original/175/0/89902.pdf](http://web.archive.org/web/20140730182127/http:/origin.myfonts.com/s/aw/original/175/0/89902.pdf \"http://origin.myfonts.com/s/aw/original/175/0/89902.pdf\")\n\n"
    },
    {
      "time": "3 Jul 2013 — 10:33pm",
      "content": "BTW is Whitney the only H&FJ face featuring non-Latin scripts?\n\nhhp\n\n"
    },
    {
      "time": "4 Jul 2013 — 1:03pm",
      "content": "Nick, I don't get to pick the typeface on this one. For good or ill, the client has specified Skolar for the text, with Whitney display. I don't have the MS in hand yet. If there is polytonic Greek in the display, we'll have to figure something out. Oh well, that's what comps are for. Get the accents/breath marks from a different font, & place by hand... very slowly...\n\nHrant:\n\nMaybe. It's hard to figure out from all their advertising, but so far, it seems so. I take\n\n> In preparation for moving its library into OpenType, H&FJ established the Language Research Program in 2005, in order to develop updated specifications for its Latin-based character sets. The initial product of this research is H&FJ’s Latin-X™ character set, which expands the reach of a typeface to an additional 200,000,000 readers worldwide. This character set reflects not only a more accurate awareness of the political landscape of language, but the most up-to-date understanding of cultural norms.\n\nto be an attempt to put a positive spin on the fact they aren't offering OpenType fonts yet. Just look at the pricing for \"Basic\" & how much more adding the small caps is (and as a separate set of fonts, which means even more more handwork for use). The \"multiscprit\" fonts cost more than twice the \"basic,\" a pricing I find predatory. Of course, I'm a curmudgeon...\n\nI've always taken H&FJ to be in the advertising world, one which has rare overlap with books. Their pricing models seem to fit that, too. But again, I'm a curmudgeon...\n\n"
    },
    {
      "time": "4 Jul 2013 — 1:11pm",
      "content": "Maybe the client needs to be made aware that Whitney is simply a poor choice for polytonic Greek (even though it does have a lot of other good qualities). It's not like there's a shortage of humanist sans fonts...\n\nhhp\n\n"
    },
    {
      "time": "5 Jul 2013 — 5:02pm",
      "content": "Charles -- H&FJ may not have been offering OpenType at the time that was written, but they certainly are now. I can't comment on their Greek support.\n\n"
    },
    {
      "time": "5 Jul 2013 — 6:10pm",
      "content": "Here is what they state on [Whitney Multiscript Edition](http://web.archive.org/web/20140730182127/http:/www.typography.com/fonts/whitney/styles/whitneymultiscriptedition):\n\n> **Whitney Multiscript Edition —**  **Best Value**  \n> The complete Whitney collection: a single set of OpenType fonts integrating the Pro editions of all three character ranges (Latin-X™, Greek, and Cyrillic-X™). Includes Romans, Italics, plus Roman Small Caps and Italic Small Caps, each in six weights (Light, Book, Medium, Semibold, Bold, and Black), with tabular figures, fractions and extended symbols for each font style — plus the sixteen-style Whitney Index family.\n\n+35 minutes...  \nI was wondering what \"Roman smallcaps\" and \"Italic smallcaps\" mean. Looking at their [Character set](http://web.archive.org/web/20140730182127/http:/www.typography.com/fonts/whitney/characters/), it seems there is neither Greek smallcaps, nor cyrillic smallcaps.\n\n"
    },
    {
      "time": "5 Jul 2013 — 6:55pm",
      "content": "No biggie, Cyrillic has smallcaps built-in. ;-)\n\nhhp\n\n"
    },
    {
      "time": "5 Jul 2013 — 9:40pm",
      "content": "> H&FJ may not have been offering OpenType at the time that was written, but they certainly are now.\n\nYou mean the Whitney \\*Manuscript\\* bundle for $600? As opposed from the \\*Advanced\\* for $300 and the \\*Pro\\* for $500? (For **one** computer.) These are current offerings. It looks like, except perhaps for manuscript, the more expensive bundles -- which do add glyphs -- also add to the number of fonts in the bundle, which I take to mean the extra glyphs are in separate fonts.\n\n[http://www.typography.com/fonts/whitney/styles/](http://web.archive.org/web/20140730182127/http:/www.typography.com/fonts/whitney/styles/ \"http://www.typography.com/fonts/whitney/styles/\")\n\n"
    }
  ]
}
