{
  "id": "104393",
  "title": "Help Please!",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi!\n\nCould anybody help me identify this font please? I used this 3 years ago, had my pc reformated and I only had this image. Any response will be greatly appreciated.\n\nThanks!\n\nJerome\n\n ![](http://web.archive.org/web/20131016203345im_/http:/typophile.com/files/Untitled-1_5460.jpg)\n\n",
  "author": "dyappoy",
  "time": "6 Jul 2013 — 6:17am",
  "uid": "212862",
  "comments": [
    {
      "time": "6 Jul 2013 — 10:32am",
      "content": "Royal Initialen from Dafont by Dieter Steffmann\n\n"
    },
    {
      "time": "6 Jul 2013 — 12:41pm",
      "content": "Does anyone know Dieter's source for this one?  \nDon\n\n"
    },
    {
      "time": "6 Jul 2013 — 1:59pm",
      "content": "Has the look of being scanned from a book - but no idea what that might be.\n\n"
    },
    {
      "time": "6 Jul 2013 — 2:46pm",
      "content": "Yes a scan with some editing. Would take a lot of work to make it look crisp and finished at high resolution. This may be one of the ones that Dieter did himself, instead of \"improving\" a existing font.  \nThe general style of ornamentation is from about the 1820's to 40's. The kind of thing Joseph Gillé would have done in Paris, or perhaps by a German designer of the era. Somewhat similar leaves are shown in Gray's 19th Century Ornamented Typefaces with the label \"German Text ornamented\" by Thorowgood, and the note \"copied from the German of the early thirties.\"  \nWe have identified a digital source but know nothing about it.  \nDon\n\n"
    },
    {
      "time": "6 Jul 2013 — 4:29pm",
      "content": "The digitizing is very good - nice clean details - not too many points - a good job overall.\n\n"
    },
    {
      "time": "6 Jul 2013 — 6:47pm",
      "content": "For a truly good digitization of this type of font compare this one with the ones done by Michael Hagemann at Font Mesa.  \nDon\n\n"
    }
  ]
}
