{
  "id": "104307",
  "title": "identify this typeface that's similar to filmotype glenlake",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "advert font",
    "filmotype glenlake",
    "Type ID Board [OLD]"
  ],
  "content": "is anyone able to dentify the typeface used to write 'lip softeners' in this ad, it is almost identical to filmotype glenlake but the capitalised 'r' is different!\n\n[http://gandrllc.com/essayimages/29covergirl.jpg](http://web.archive.org/web/20140928071432/http:/gandrllc.com/essayimages/29covergirl.jpg \"http://gandrllc.com/essayimages/29covergirl.jpg\")\n\n",
  "author": "aloominum",
  "time": "2 Jul 2013 — 1:05pm",
  "uid": "212753",
  "comments": [
    {
      "time": "2 Jul 2013 — 4:07pm",
      "content": "Try Schmallfette Binder-Style, designed by Joseph Binder and released by D. Stempel AG in 1959. Digitized as [Bindlestiff NF](http://web.archive.org/web/20140928071432/http:/www.myfonts.com/fonts/nicksfonts/bindlestiff-nf/) by Nick Curtis.  \nDon\n\n"
    },
    {
      "time": "3 Jul 2013 — 7:09am",
      "content": "thank you don-this is really helpful! I'm not familiar with the typographic practice and have a further question: the typeface used in the advert is shorter and heavier, is that something the user would alter or is it because bindlestiff nf is actually a different typeface?\n\n"
    },
    {
      "time": "3 Jul 2013 — 9:13am",
      "content": "Bindlestiff NF is true to Binder's original design, which means that the typeface in the ad is not...\n\n"
    },
    {
      "time": "3 Jul 2013 — 9:34am",
      "content": "hello oldnick, so what you are saying is that the typeface in the ad is not bindlestiff nf nor Schmallfette Binder-Style? so i put my question back out there if anyone knows please do tell...\n\n"
    },
    {
      "time": "3 Jul 2013 — 9:34am",
      "content": "hello oldnick, so what you are saying is that the typeface in the ad is not bindlestiff nf nor Schmallfette Binder-Style? so i put my question back out there if anyone knows please do tell...\n\n"
    },
    {
      "time": "3 Jul 2013 — 1:03pm",
      "content": "We know that logo designer's distort fonts for effect. Otherwise how can they claim to have done any work worth paying for. The closest I can find to the logo, with its boxy S and R is Binder-Style and as far as I can see from checking Nick's digital version against an old specimen it is indeed a true revival.  \nAnyway, I didn't claim that it is a 100% match, I merely said to \"try\" the font. Sans fonts are ultra easy to churn out and there could well be a descendant of the Binder design that is a 100% match, either as an in-house font by Cover Girl or as a font generally available.  \nDon\n\n"
    },
    {
      "time": "3 Jul 2013 — 1:35pm",
      "content": "i was very happy about what you found! i didn't think you were claiming an identical match i just wondered if the cover girl text (as the slightly shorter and fatter version of binder) was an established typeface with ease of access or if it was something that was altered in-house ie. the user would, therefore, have to alter it themselves...\n\n"
    }
  ]
}
