{
  "id": "104388",
  "title": "Kill this layout!",
  "forum": "Design",
  "tags": [
    "design",
    "Display",
    "InDesign",
    "Layout",
    "newspaper",
    "newspaper font",
    "Text",
    "Design"
  ],
  "content": "Hello everyone. I am designing a high school newspaper for my campus, called \"The Pioneer\". What it pioneered, I do not know.\n\nHere it is:\n\n ![](http://web.archive.org/web/20150417164216im_/http:/typophile.com/files/BoxxyPioneer_4210.jpg)\n\nSome info: the campus publication industry in the Philippines is hyper-competitive -- annual press contests influence school press offices to twerk their writing bugs. And being stuck with Arial and Times New Roman means total loss in this arena (because duh).\n\nLast year, they used system Franklin Gothic and Proforma. Here, it's Flama and Farnham. Thoughts?\n\n",
  "author": "Sonoraphobic",
  "time": "6 Jul 2013 — 4:16am",
  "uid": "205281",
  "comments": [
    {
      "time": "6 Jul 2013 — 4:21am",
      "content": "Here's a better version:\n\n[http://i40.tinypic.com/10y1hep.jpg](http://web.archive.org/web/20150417164216/http:/i40.tinypic.com/10y1hep.jpg \"http://i40.tinypic.com/10y1hep.jpg\")\n\n"
    },
    {
      "time": "6 Jul 2013 — 5:27am",
      "content": "I know it’s placeholder text, but you can see that the narrow columns with justified text as it is will cause a lot of issues with word spacing/rivers that needs to be fixed.\n\nThe content is separated by colored boxes, but I’m not sure if the colors are supposed to denote a specific news category or level of importance, or is arbitrary? They might not be aiding the reader by making different articles grab for attention at the same time. Lighter color or lines between columns might be a more subtle but still clear content separator. Is there a reason one headline is italic serif while the rest are bold sans serifs?\n\nThe bullets next to the page numbers in the «Inside» box seem superfluous.\n\n"
    },
    {
      "time": "6 Jul 2013 — 10:07am",
      "content": "As sanderpe mentioned, the one-column text has huge spaces between some words, which can happen when you justify a short line. I'd suggest making the text rag right instead of justified. If you must keep it justified, make the columns wider.\n\n ![](http://web.archive.org/web/20150417164216im_/http:/typophile.com/files/paper_4553.jpg)\n\n"
    },
    {
      "time": "6 Jul 2013 — 10:31am",
      "content": "Turning on hyphenation might also help with that.  \nThe author/journalist names seem way too big and prominent to me.  \nI'd right-align the page numbers in the red box.\n\n"
    },
    {
      "time": "21 Jul 2013 — 4:51am",
      "content": "New versions. I added some section pages, and decided to use Gotham and Arnhem.  \n [1](http://web.archive.org/web/20150417164216/http:/i1134.photobucket.com/albums/m605/FabulousKilljoyPaul/BoxxyPioneer.jpg)  \n [2](http://web.archive.org/web/20150417164216/http:/i1134.photobucket.com/albums/m605/FabulousKilljoyPaul/BoxxyPioneer2.jpg)  \n [3](http://web.archive.org/web/20150417164216/http:/i1134.photobucket.com/albums/m605/FabulousKilljoyPaul/BoxxyPioneer3.jpg)  \n [4](http://web.archive.org/web/20150417164216/http:/i1134.photobucket.com/albums/m605/FabulousKilljoyPaul/BoxxyPioneer4.jpg)  \n [5](http://web.archive.org/web/20150417164216/http:/i1134.photobucket.com/albums/m605/FabulousKilljoyPaul/BoxxyPioneer5.jpg)  \n [6](http://web.archive.org/web/20150417164216/http:/i1134.photobucket.com/albums/m605/FabulousKilljoyPaul/BoxxyPioneer6.jpg)  \n [7](http://web.archive.org/web/20150417164216/http:/i1134.photobucket.com/albums/m605/FabulousKilljoyPaul/BoxxyPioneer7.jpg)\n\n"
    },
    {
      "time": "21 Jul 2013 — 7:41am",
      "content": "Arnhem's nice. But why that overpriced, overused beacon of crass commercialism, Gotham?\n\nHow about Ludwig -- like Arnhem, designed by Smeijers...\n\n[http://www.fontshop.com/fonts/family/ludwig/](http://web.archive.org/web/20150417164216/http:/www.fontshop.com/fonts/family/ludwig/ \"http://www.fontshop.com/fonts/family/ludwig/\")\n\nOr if you want more order in your chaos, Hypatia? Often given away free from Adobe for registering InDesign or other software\n\n[https://www.google.com/search?q=hypatia+fonts&source=lnms&tbm=isch&sa=X&...](http://web.archive.org/web/20150417164216/https:/www.google.com/search?q=hypatia+fonts&source=lnms&tbm=isch&sa=X&ei=ovLrUZ2sBYj49QSrpoDoDg&ved=0CAcQ_AUoAQ&biw=761&bih=485 \"https://www.google.com/search?q=hypatia+fonts&source=lnms&tbm=isch&sa=X&ei=ovLrUZ2sBYj49QSrpoDoDg&ved=0CAcQ\\_AUoAQ&biw=761&bih=485\")\n\n"
    },
    {
      "time": "21 Jul 2013 — 6:25pm",
      "content": "Will this be printed on newsprint? If so, you may end up struggling with those colored backgrounds--especially the gray (which would end up being a really rough line screen of black)\n\n"
    },
    {
      "time": "22 Jul 2013 — 4:55am",
      "content": "@charles ellertson:  \n [Arnhem's nice. But why that overpriced, overused beacon of crass commercialism, Gotham?](http://web.archive.org/web/20150417164216/http:/typophile.com/wiki/Arnhem%27s%20nice.%20But%20why%20that%20overpriced%2C%20overused%20beacon%20of%20crass%20commercialism%2C%20Gotham%3F)  \nI knew someone would hate Gotham.\n\nBTW, I kinda like Ludwig, but I was looking for something more staid and clinical. Not Helvetica-clinical. Ludwig was kind of kinky for me.\n\nHypatia doesn't work.\n\n@aluminum:  \n [Will this be printed on newsprint?](http://web.archive.org/web/20150417164216/http:/typophile.com/wiki/Will%20this%20be%20printed%20on%20newsprint%3F)  \nIt will be printed in two ways -- in a glossy format for moderators, staff, faculty, and administration, and in newsprint for everyone else. The newsprint stock we've been using is thicker than normal newsprint found in dailies. The printing, too, is significantly finer than those in newspapers.\n\n"
    },
    {
      "time": "22 Jul 2013 — 6:18am",
      "content": "Well, you might be OK then, but definitely be consulting with your printer going forward. White text on red, for instance, is not the easiest thing to print as the printer has to have impeccable registration and limited ink bleed for Yellow and Magenta for it to come out crisp.\n\n"
    },
    {
      "time": "22 Jul 2013 — 6:49am",
      "content": "Agree with aluminum about consulting your printer. You should be okay if the printer is careful, but newspapers are usually printed on a web press (a big roll of paper that's not cut apart until after it's printed) and the emphasis is on speed rather than quality, so you might want to avoid tiny reversed-out type until you're sure the printer is really doing a quality job with good color registration.\n\n"
    },
    {
      "time": "23 Jul 2013 — 12:47am",
      "content": "Will check.\n\nI'll upload photos of last year's version.\n\n"
    },
    {
      "time": "23 Jul 2013 — 5:51am",
      "content": "Last year (I am sorry, but you have to either rotate your head or your monitor):\n\n ![](http://web.archive.org/web/20150417164216im_/http:/typophile.com/files/DSCN2187_5185.JPG)\n  \nThis is shitty. It's a result of non-coordination between printer and designer -- I was Quark, they were InDesign. I gave them licensed copies of the fonts used and the pdf of what it should look like. They just messed it up big time.\n\nBTW I also have other ideas in mind. (Is that good for someone redisgning a newspaper?)\n\n"
    },
    {
      "time": "25 Jul 2013 — 8:21am",
      "content": "\\> you have to either rotate your head or your monitor\n\nWhy not rotate and resize it before posting?\n\n\\> I was Quark, they were InDesign\n\nInDesign is the most popular page layout program for professional designers, so you're likely to find that printers have more experience with it than with Quark. But ideally a printer that works with pros should be familiar with both programs.\n\n"
    },
    {
      "time": "4 Aug 2013 — 1:51am",
      "content": " **New Ideas!**\n\n[![ photo ThePioneerAlso.jpg](http://web.archive.org/web/20150417164216im_/http:/i1134.photobucket.com/albums/m605/FabulousKilljoyPaul/ThePioneerAlso.jpg)](http://web.archive.org/web/20150417164216/http:/s1134.photobucket.com/user/FabulousKilljoyPaul/media/ThePioneerAlso.jpg.html)\n\n[![ photo ThePioneer.jpg](http://web.archive.org/web/20150417164216im_/http:/i1134.photobucket.com/albums/m605/FabulousKilljoyPaul/ThePioneer.jpg)](http://web.archive.org/web/20150417164216/http:/s1134.photobucket.com/user/FabulousKilljoyPaul/media/ThePioneer.jpg.html)\n\n[![ photo ThePioneerQuiet.jpg](http://web.archive.org/web/20150417164216im_/http:/i1134.photobucket.com/albums/m605/FabulousKilljoyPaul/ThePioneerQuiet.jpg)](http://web.archive.org/web/20150417164216/http:/s1134.photobucket.com/user/FabulousKilljoyPaul/media/ThePioneerQuiet.jpg.html)\n\n"
    },
    {
      "time": "4 Aug 2013 — 1:52am",
      "content": "Just now I notice that the first two \"new ideas\" have bad justification.\n\nI never learn, do I?\n\n"
    },
    {
      "time": "7 Aug 2013 — 3:28pm",
      "content": "I'm not very used to so much running text on the front page of newspapers, so they all present more than what's «necessary» to me, but I guess that's conventional elsewhere.\n\nI prefer the third one; I think the title set on white and the sections on top makes it the most clean and tidy design.  \nAll the layouts require a narrow, horizontal subject for the main photo, and in that case I think cropping it like in the third one is the most practical solution. The photo has a lot of white space, and the first two layouts would require the same amount of space (without distracting elements, because they're not cropped away) for the main photo in other issues because it fills the top of the page.\n\n"
    },
    {
      "time": "8 Aug 2013 — 12:43am",
      "content": "I think your third new layout shows most promise. I assume it'll have variants with more conventional headlines? Headline-in-picture looks very professional, but it's restricted to top newspapers for a reason: it's difficult to do convincingly and requires the right picture material to work. (I've worked as a page editor at one of Sweden's biggest newspapers, trust me on this.)\n\nThings in general you'll want to consider, that are more or less problematic accross the different layouts at the moment:\n\n\\* Establishing a clear hierarchy of articles and headline styles. A messy layout with articles of different length and different headline size placed willy-nilly is more difficult to read and orientate yourself in. If you're going for (for instance) a bigger-font-size one-column headline (which seems to be the case here), make sure it's consistently applied as such, is clearly delimited from other headline styles, and perhaps if possible always has the exact same font size, number of lines, and position on the page.\n\n\\* Establishing a clear demarcation if what articles belong together and which don't. A hairline-width line between articles on different topics (and the absence of one where the two are on the same topic) is one helpful way of doing this, or it can be achieved with clever picture placement, colour boxes... (PS. Why are your lines generally this thickness? It's probably a personal preference, but most newspapers at least here tend to have thinner lines, or intentionally chunkier ones. :))\n\n\\* Establishing a set of clearly navigable page layouts/grids. There's a reason most five-column-design tabloid-size newspapers have 3+2 and/or 4+1 layouts (one or two columns divided off, consistently, on every page or every alternate page) – it makes reading and article hierarchy all the easier. Another classic is having (consistent-height) small articles running along the bottom of pages. These same columns and bottom articles can also be used for side content on feature pages. (Clearly, this does not apply to the front page, but having a consistent layout idea helps there, too.) One thing it definitely makes easier – which I see you're having problems with – is getting elements to line up visually. If something on a page sticks up a centimeter above something else, you're probably doing it wrong.\n\n\\* Use consistent spacing between elements as far as possible. One example: those writer bylines! In every layout, they're floating all over the place, sometimes far from the headline, sometimes far from the body copy. Stuff like this needs to be consistent, or it looks messy.\n\n\\* Give stuff room to breathe! If there's anything that looks unprofessional at first glance in your layouts (which otherwise are frankly very well done for high-school level) it's the way things are occasionally squeezed into too-tight containers, tracked too tightly, line-spaced too tightly. For instance, all of your colour boxes (that are a great way of establishing hierarchy) have the text simply running too close to their edges – you sould narrow the text column inside to give at least a milimeter or two more margin, it'll make them instantly more readable. And in general: Good use of white space is one thing that truly sets apart professional products.\n\n"
    },
    {
      "time": "8 Aug 2013 — 1:45am",
      "content": "Don’t ever use negative leading as in ‘Welch: dogs day are over’. It might work when your are not only doing the layout but also the one that is in charge of rewording the headlines (to avoid clashing ascenders and descenders), but even then, I’d rather spend my time on solving real problems instead of those that could have been avoided through better style sheets. This phenomena is often referred to as the ‘ [First Spiekermann Dictum](http://web.archive.org/web/20150417164216/http:/typophile.com/node/104756)’\n\n"
    },
    {
      "time": "4 Jan 2014 — 7:15pm",
      "content": "Great help everyone!\n\n"
    },
    {
      "time": "4 Jan 2014 — 7:13pm",
      "content": "Hey everyone. I think we're going with [this one](http://web.archive.org/web/20150417164216/http:/www.dropbox.com/s/tk83awx3mazeax1/The%20Pioneer.pdf). In the meantime. I'll be posting modifications along the way.\n\nTypefaces are Coranto 2 and Flama, and I'm planning on having Acta (and possibly Acto) and Meta Serif on the Features section. Nameplate is custom-made based on Coranto 2 and Flama. Icon is a close-up of the Prometheus statue in Rockefeller Center. Prometheus is the bringer of fire in Greek mythology, I'll have you know.\n\n"
    },
    {
      "time": "7 Jan 2014 — 4:29pm",
      "content": "I am the creative director of a large newspaper that is currently going through a redesign. We have decided on Coranto 2 for body text and Coranto 2 Headline for (obviously) headlines.\n\nImmediately, there are some really problematic things that I see with your design that can be fixed relatively easily, depending on how good of an eye you have for these things.\n\nFirstly, I think Coranto 2 is set too large for the body type – but maybe just by a few tenths of a point. Certainly the leading is too tight. It definitely needs to go up. I'm not sure if you read it, but the post just above your return to this thread details a problem that is caused by your leading. Definitely have a read into that.\n\nThe widths of the teaser boxes seem to have been chosen arbitrarily. That's not good at all. Given that there are four boxes in the space of four columns, it looks very jarring to not see them match up with the columns. If you had a different number – say three or five — then you could work with it, but not like that.\n\nThe way you have that photo of the woman in a sash and the way it doesn't match up with the column is also very jarring. Having the credits running on the side is not a justification for not running the image the full column width. It just looks wrong.\n\nFinally, the \"Sabio: One band, one sound\" piece also looks wrong because the text box doesn't fit the width of the column, and it looks like you've done it this way just so it can have a line running down the right. I would get rid of it.\n\nI am on a panel of judges of a secondary school newspaper and magazine design competition, and these are the things that I would pick out as problematic things.\n\nBut the reasons I would pick out these things, especially the way you've overlooked really core typographic features like adequate leading, is because design is not how it looks. It's not that veneer and those pretty font choices, but how it functions as a newspaper for the reader. Design is how it works!\n\nYou need to go back to basics and look at it from that point of view: you are designing things in such a way so as for them to have a function that benefits the reader.\n\n(Also, I am not sure I like the way the \"T\" runs into the \"h\" in the masthead – it draws too much attention onto an unimportant word in the title. I also feel like the kerning around the \"O\" in \"Pioneer\" is too tight.)\n\n"
    },
    {
      "time": "17 Jan 2014 — 10:09pm",
      "content": "I definitely agree with you on leading. The body type though was a subject of debate for me and the team--we decided to make it big for the rapidly aging faculty population (most teachers are 50+). Now it's 11.5/12.\n\nI removed the teaser boxes and the icon, then reworked the masthead. Also, am definitely looking in at the pictures.\n\nThe powers-that-be have disagreed on my team's type choice :(. Guess we're going back to an older proto-type (pun intended).\n\n"
    }
  ]
}
