{
  "id": "104377",
  "title": "Body products TYPE ID",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hello,\n\nAnyone recognizes the typeface used on the brown packagings here :  \n [http://www.compagniedeprovence.com/fr/18341-savon-liquide-à-l-huile-d-olive-300ml-encens-lavande--3551780183416.html](http://web.archive.org/web/20131019063212/http:/www.compagniedeprovence.com/fr/18341-savon-liquide-%C3%A0-l-huile-d-olive-300ml-encens-lavande--3551780183416.html)\n\nThanks!\n\n",
  "author": "MRE",
  "time": "5 Jul 2013 — 12:06pm",
  "uid": "39018",
  "comments": [
    {
      "time": "5 Jul 2013 — 12:57pm",
      "content": "Interesting website. It shows the same font on many products. Also did you note the company info on Compagnie de Provence:\n\n---start quote---  \nEn France, notre marque est présente à travers 7 boutiques en nom propre et chez environ 300 revendeurs.\n\nNous sommes présents dans des magasins de décoration indépendants, chez Botanic et Truffaut, et des grands magasins comme le Bon Marché, les Galeries Lafayette, le BHV, La Grande Epicerie ou Conran Shop.\n\nA l’étranger, notre marque est diffusée dans environ 40 pays.\n\nLes magasins Selfridges, John Lewis, Conran Shop au Royaume Uni, Stockmann en Finlande, Illums Bolighus à Copenhague, Ahlens en Suède et Norvège, Globus en Suisse, De Bijenkorf aux Pays-Bas, KaDeWe à Berlin, Sephora en Chine, David Jones en Australie, nous font confiance.  \n---end quote---\n\nThe scale of Compagnie de Provence suggests a bespoke font. Perhaps in-house. Perhaps by a design studio, like A2, ChristianSchwartz, or more likely a French studio.  \nSo this would seem to narrow the search to identify the font designer.  \nGoogle \"marketing agency for Compagnie de Provence\" yields some interesting leads.  \nSomething called [agence5970](http://web.archive.org/web/20131019063212/http:/agence5970.com/projects/compagnie-de-provence) may have been involved.  \nInteresting, but does not answer the font ID question.\n\nIndeed I could be wrong & this is something off the shelf.\n\nDon\n\n"
    }
  ]
}
