{
  "id": "104378",
  "title": "What script font is this?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20131014080850im_/http:/typophile.com/files/SCunknownfont_4784.JPG)\n\nThis is a wedding invitation by William Arthur. I looked on-line but they don't list font names only numbers.  \nI do not mind purchasing the font. I have hundreds of fonts on my computer to look through but this one is not  \nfamiliar. Any help would be much appreciated. The actual name or additional names would be great.\n\n| Attachment | Size |\n| --- | --- |\n| [SCunknownfont.JPG](http://web.archive.org/web/20131014080850/http:/typophile.com/files/SCunknownfont.JPG) | 332.78 KB |\n\n",
  "author": "Sha2086",
  "time": "5 Jul 2013 — 12:39pm",
  "uid": "212848",
  "comments": [
    {
      "time": "5 Jul 2013 — 12:58pm",
      "content": "Sorry this is my first time to the forum. The picture came in much larger than I had planned but hopefully that helps with the identification process.\n\n"
    },
    {
      "time": "5 Jul 2013 — 1:30pm",
      "content": "No problem. The image is properly cropped and the detail is appreciated. What I do with large typophile images is to download them as a jpeg and open in a viewer that I can push off to one side of the screen while I use the other part of the screen for searching. Looked for this script but failed. Hope one of our typophiles finds it for you.  \nDon\n\n"
    },
    {
      "time": "5 Jul 2013 — 2:43pm",
      "content": "Hi folks,\n\nDoes anyone know what font Peter Max used for the cover art he did for The Band's \"Jericho\" Album? I'm painting a replica of the art for my brother and would like to create stencils to match it.\n\nIt's driving me bonkers trying to find it. Futura is close, but I'm looking for perfection here :)\n\nThank you!\n\nDustin\n\n ![](http://web.archive.org/web/20131014080850im_/http:/typophile.com/files/jericho_mega%20copy_6586.jpg)\n\n"
    },
    {
      "time": "5 Jul 2013 — 3:08pm",
      "content": "Dustin, you’re kind of hogging the thread; creating a new topic is preferable. The font you’re looking for is Lithos Bold, though.\n\n"
    },
    {
      "time": "5 Jul 2013 — 3:19pm",
      "content": "Sorry about that! Wasn't sure how it worked...\n\nThank you VERY much.\n\n-Dustin\n\n"
    },
    {
      "time": "5 Jul 2013 — 3:44pm",
      "content": "after some digging, according to some posts regarding \"T390\" which is the number you are looking for, the font is called \"Angelina 1 Smooth\". if you can locate it :)\n\n"
    },
    {
      "time": "6 Jul 2013 — 1:39am",
      "content": "No hope of finding it by Googling the names, just tons of pix of Angelina Jolie & Parfumerie Script.  \nIf you would be satisfied with a similar font with \"a custom hand lettered/flourished look\" that was \"created with Brides and Invitation Designers in mind\" by \"a calligrapher [who] has worked with brides for many years [who] loved the look of hand lettered calligraphy, [but whose] budgets limited their use of it,\" you might try [Belluccia](http://web.archive.org/web/20131014080850/http:/www.myfonts.com/fonts/correspondence-ink/belluccia/).\n\n"
    },
    {
      "time": "6 Jul 2013 — 8:25am",
      "content": "THANK YOU so much for your input!!! I really appreciate the help. I will do my best to help  \nout on the forum. I have thousands of fonts on my computer & I'm kinda a font freak so I'm sure  \nI can do some good :)\n\n"
    },
    {
      "time": "6 Jul 2013 — 11:56am",
      "content": "You're welcome.  \nDon\n\n"
    }
  ]
}
