{
  "id": "104355",
  "title": "H&FJ Greek and Cyrillic Analysis",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "H&FJ's Greek and Cyrillic for Whitney seem to be a product of considered research:  \n [http://www.typography.com/fonts/whitney/features/whitney-multiscript-lan...](http://web.archive.org/web/20130816134720/http:/www.typography.com/fonts/whitney/features/whitney-multiscript-language-support \"http://www.typography.com/fonts/whitney/features/whitney-multiscript-language-support\")\n\nI'm wondering if anybody can spot small or large issues with any of it. I know such a discussion would help me greatly improve my own Greek and Cyrillic skills, so I hope you won't be shy!\n\nhhp\n\n",
  "author": "hrant",
  "time": "4 Jul 2013 — 10:21am",
  "uid": "1250",
  "comments": [
    {
      "time": "4 Jul 2013 — 12:01pm",
      "content": "Their text does not mention the small Greek letter nu which they also did the way I expect it to be, with a curving\\* right part, to distinguish it from a small latin letter v.\n\n&nbsp;&nbsp;&nbsp; ![](http://web.archive.org/web/20130816134720im_/http:/typophile.com/files/nu20130704_6279.png)\n\n\\*And the center of curvature is to the left of the glyph.\n\n"
    },
    {
      "time": "4 Jul 2013 — 12:44pm",
      "content": "> Whitney Greek was a four-year project, designed by H&FJ in consultation with Gerry Leonidas, Senior Lecturer in Typography at the University of Reading. For Whitney, Leonidas advocated the adoption of two distinct formal vocabularies for the Latin and Greek ends of the type family, an approach supported by the unique characteristics of the Greek language.\n\nI took that to mean the drawing skills were H&FJ, the thinking was Leonidas. Could be wrong, of course. Anyway, reading what Mr. Leonidas has to say generally could only be helpful...\n\n"
    },
    {
      "time": "4 Jul 2013 — 4:41pm",
      "content": "All looks solid to me. Are you noticing particular issues?\n\n"
    },
    {
      "time": "4 Jul 2013 — 5:05pm",
      "content": "I'm not good enough in Greek or Cyrillic to trust what I think I might be seeing. I'm basically just hoping to pick some brains. If somebody complains about something it would simply help me decide which way I might go myself.\n\nhhp\n\n"
    }
  ]
}
