{
  "id": "10433",
  "title": "How much are companies paying for fonts?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "After ten years or so at doodling fonts now and them for personal pleasure, I am considering the option of offering them for sale to type vendors, be it a big or a small one (depends on the money they pay). I have got no clue, though, as to which is the price range for fonts. Can I get some insight into this? I would appreciate it a lot.\n\n",
  "author": "mosh",
  "time": "20 Apr 2005 — 1:25am",
  "uid": "6146",
  "comments": [
    {
      "time": "20 Apr 2005 — 6:22am",
      "content": "Viejo, how much money you make from a font usually depends on how popular the font turns out to be, i.e., how many copies of the font will be sold.   \n   \nMost foundries pay a specific commission to the designer for each sale they make; a percentage. The important thing to keep in mind is the question: \"how much mileage is this foundry going to give my font?\" Let's say that one foundry offers you 25%, and a second just 15%.\n\n"
    },
    {
      "time": "20 Apr 2005 — 2:28pm",
      "content": "I couldn't agree more. When I was just getting into digital type sales in the early 90s, I assumed that any reasonably decent font would sell at least 10,000 copies at retail. Even then, I was told, 200 copies was considered hugely successful at retail.   \n   \nGiven how hard it is to sell large numbers of fonts retail, your royalty isn't the important thing: getting promoted is. Yet who is really doing promotion today?   \n   \nCorporate sales are the way to go, but do you have a product that a corporation will like well enough to pay let us say $80,000 for a 10,000 seat license?\n\n"
    },
    {
      "time": "20 Apr 2005 — 6:37pm",
      "content": "Viejo,\n\n"
    },
    {
      "time": "20 Apr 2005 — 9:39pm",
      "content": "Well, by promotion I mean, nice catalogues, nice mailings, nice customer lists ... all the things that used to sell fonts before the Internet. Publicity. Promotion. Mailings. Remember when font companies used to have quarterly or even monthly magazines they mailed out? You would look at those things, drool, and order. Doesn't work that way anymore.\n\n"
    },
    {
      "time": "21 Apr 2005 — 12:05am",
      "content": "_Hmm.. Well.._ Which company could thaaat be, Stephen.? ![](http://web.archive.org/web/20131015130723im_/http:/www.typophile.com/forums/clipart/bigsmile.gif)\n\n"
    },
    {
      "time": "21 Apr 2005 — 6:31am",
      "content": "Something funny's going on around here...\n\n"
    },
    {
      "time": "21 Apr 2005 — 6:49am",
      "content": "Well, I'm going to try and guess what Stephen is talking about.   \n   \nFontShop Berlin publishes a large, many-page full color newletter. Often. Maybe every month even. German designers seem to swear by these things, although all other German foundries cut these out of their budgets years ago because they did not generate sales anymore (yeah internet!). I must admit that the FS Berlin mail is very well designed, and presents the typefaces of many foundries, not just FontFont's, in a very good light.   \n   \nPerhaps this will be picked up by FS SF.\n\n"
    },
    {
      "time": "21 Apr 2005 — 6:54am",
      "content": "And, I would like to add that all FontShop Austria has been sending out recently, _( at least to me )_, were ugly, and boring, stock photo catalogs.. _( I wish I would receive the newsletter Dan is posting about, or anything type related at all.. But FontShop Austria doesnt seem to give a lot about type, at all.. StockPhotoShop Austria, rather.. )   \n   \n\\* Sorry, For ranting slightly Off Topic.._\n\n"
    },
    {
      "time": "21 Apr 2005 — 7:39am",
      "content": ""
    },
    {
      "time": "21 Apr 2005 — 7:59am",
      "content": "Yea, Dan, That may well be.. _It almost seems like most Austrian advertising agencies prefer to 'share' their existing typographic archives and collections.. ( That may be one of the reasons why 'Agency A' got the same fonts as 'Agency B', and, why over here quite a few things seem to look the same.. )_   \n_( Oh, And, I am already getting the FontShop SF eMail newsletter, as well.. )_\n\n"
    },
    {
      "time": "27 Apr 2005 — 6:33am",
      "content": "Thanks for your commments. Do you have any good or bad experience with the Scriptorium foundry? That was my first choice due to the nature of my project. I am doing some analysis on mexican hand-lettering and on mexican/spanish vintage type and lettering (from the previous three centuries). I want to make an interpretation of those letters in order to create a set. The people at Scriptorium were interested in the project, but I want to know a little bit more about the normal price paid for such things.   \n   \nAllan Haley, at Monotype, kindly answered to me on this subject:   \n   \n\"Hello Mosh,   \n   \nThe price of font can range from \"free\" to over $100. Generally, they run from $22 to $49. We price the new releases into the ITC and Monotype libraries at $39 and $55 for OpenType.   \n   \nRoyalties are paid on fonts sold. We make royalty payments quarterly.\"   \n   \nIs this an OK price? I had thought that it would be more, but if that's the standard, I'll accept it.   \n   \nI am still doing my first sketches on this project, though. I am mexican, but I am living since six months ago in Munich, Germany, so I am resourcing to my personal photo archive for sources.   \n   \nAnd H\n\n"
    },
    {
      "time": "20 Apr 2005 — 2:39pm",
      "content": "\\> Who is doing promotion today?   \n   \nThe user is doing the promoting. Forums such as Typophile are a hot bed for type suggestion and promotion. I have no problem suggesting, for instance, Font Bureau. Why? Because I've had nothing but good experiences with their fonts and their staff.   \n   \nHope I didn't misunderstand this.\n\n"
    },
    {
      "time": "20 Apr 2005 — 2:42pm",
      "content": "Viejo, different foundries offer different packages. Dan speaks volumes, I don't need to add to that.   \n   \nWould be interesting though to build some sort of comparative chart.\n\n"
    },
    {
      "time": "20 Apr 2005 — 11:57pm",
      "content": "That will soon change, at least for one company.\n\n"
    }
  ]
}
