{
  "id": "104308",
  "title": "Traction — a serif font with grip and bite",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Recently, I've been toying with the idea of returning to the project that brought me to Typophile in the first place: To make a characterful text font. My [first attempt](http://web.archive.org/web/20150330022549/http:/www.typophile.com/node/91743) failed almost immediately, but I've learned a lot about type design in the meantime.\n\nI'd like to make **Traction** the female hiking boot of oldstyle fonts: Sturdy and functional, a grippy all-terrain profile, yet organic and human, and within the constraints of practicality as elegant and sexy as possible. The main \"bite\" should come from bold, almost exaggerated serifs, reminiscent of slab serifs, and broken strokes that reinforce the glyph where it is most needed.\n\nMy main inspirations are Quadraat, Marlene, and most importantly, Satyr. I'm avoiding looking at those typefaces now in order not to plagiarize them too much. Hopefully my own take will ultimately stand on its own rather than look like an obvious derivative.\n\nHere are my first two letters:\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/T_3763.png)\n\nWhaddya think? Does it have promise?\n\n",
  "author": "Catharsis",
  "time": "2 Jul 2013 — 2:03pm",
  "uid": "188621",
  "comments": [
    {
      "time": "2 Jul 2013 — 9:49pm",
      "content": "Funny, as I was reading your description, I thought to mention Satyr!\n\nThe one thing I would personally caution against is being too conservative. For example, that \"n\" is.\n\nhhp\n\n"
    },
    {
      "time": "3 Jul 2013 — 3:02am",
      "content": "Inhowfar is the {n} too conservative?\n\nOriginally, I had more of an inward curve in the right leg, but it looked wobbly and made an unwanted \"jolly\" impression. I suppose I could give the leg an outward curve, but then wouldn't it basically be the Satyr {n}?\n\nI'm also tempted to make the serifs longer, but then sequences of {n} start to look too loosely spaced.\n\nAnyway, here's yesterday's progress:\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/T2_5199.png)\n\n"
    },
    {
      "time": "3 Jul 2013 — 6:13am",
      "content": "It (the \"n\") just looks like a million other one's I've seen.\n\nHow to make it unconventional (but functional)?  \nHey, I'm working on that myself!\n\nhhp\n\n"
    },
    {
      "time": "3 Jul 2013 — 6:47am",
      "content": "I would lower the crossbar of /t/. And is there a way to fortify its bottom terminal somehow?\n\n"
    },
    {
      "time": "3 Jul 2013 — 7:04am",
      "content": "@ Hrant: I'm fine if not all glyphs look original. An original font is an original combination of glyphs, not a combination of original glyphs. ;o)\n\n@ Craig: Good catch on the crossbar. I lowered it and evened it out a bit, too. As for the terminal, I had already added some weight to it before I read your message... Better now?\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/T3_5896.png)\n\n"
    },
    {
      "time": "3 Jul 2013 — 7:09am",
      "content": "An original font is an original idea applied to all the glyphs in a way that they still combine well. :-)\n\nhhp\n\n"
    },
    {
      "time": "4 Jul 2013 — 7:41am",
      "content": "Perhaps giving the right leg of the 'n,h,m', something between a typical roman and a typical italic serif? Not too different from the serifs of the 'a,d'. Seems as though it might add a bit of that calligraphic sexiness you’re going for.  \nA typeface like this is just asking for dozens of ligatures and swashes, should be lots of fun!\n\n"
    },
    {
      "time": "4 Jul 2013 — 11:34am",
      "content": "That /t/ crossbar looks better. You might want to raise the part above the crossbar a little bit higher.  \nWith that adjustment to /t/ at the bottom, should you revisit the outstrokes of /c/ and /e/?\n\nFWIW I think the /n/ structure is sufficiently unconservative. Maybe the head serif, which strikes me as interestingly long, could be a bit more thick.\n\n"
    },
    {
      "time": "4 Jul 2013 — 12:20pm",
      "content": "I really like the top serifs, the 'b', the 't', the 'e', and the general feel of it. I'm curious to what kind of 's' you have in mind. Maybe the 'd' and 'a' is a little tight in their southern junctions? That might be unproblematic at larger sizes, but I would have let in some air down there anyway. Personally, I'd open up the bottoms of 'n' et al too, but that is a matter of taste.\n\nIt is not a bad idea making the right leg of 'n' more similar to the back of the 'a', I think. Don't worry about being derivative. All designers are inspired by other people's work. When I drew Satyr I had Mrs. Eaves (!) in mind.\n\nKeep up the good work!\n\n"
    },
    {
      "time": "4 Jul 2013 — 4:19pm",
      "content": "Thanks for the feedback, everyone!\n\n@ Joshua: I've given the outstroke-type serif on {n} a chance, but didn't like it. I feel like the glyph is tap-dancing (see below). Not at all what I'm going for... I think I'll stick to my merely moderately unusual {n} for now. ;o)\n\nAnd while I love ligatures, I'm not sure this it the right font for going crazy with them. I'll certainly have some non-standard ones like {tt, Th, Qu} and the like, but apart from that? Do you have an example of what you're thinking about?\n\n@ Craig: I gave the top of the {t} just a little nudge upwards... wouldn't want to go farther than that; I'm a big fan of low and wide {t} designs. Added weight to the bottoms of {e} and {c}; looks better indeed.\n\nYes, the top serif of {n m r} exemplifies this rubber sole grip feeling I'm trying to evoke. Added two units to the thickness of the top serif in ; tried more but it started to look out of place.\n\n@ Sindre: I haven't really thought about the {s} yet; I'll see when I get there. ;o)\n\nI made the {a} wider by 10 units and broke the foot away from the bowl. Yep, big improvement. {d} was a lot airier than my previous {a}, though, so I left it unchanged for now.\n\nI tried reducing the inside serifs on {n}, but didn't like the resulting feel of {nn} sequences. Reducing serifs in a grippy font just seems off anyway. ;o)\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/T4_5234.png)\n\nOh, and this will totally need a higher-contrast display cut sooner or later.\n\n"
    },
    {
      "time": "4 Jul 2013 — 4:45pm",
      "content": "Ah, yes, very good 'a' now. And the 'f' shape has promise. Lovely 't'. The inside curve and bottom emphasis of it is really very good. The relationship between 'e' and 'c' is always difficult but important, look at it often. I also suggest trying several different 'e's.\n\n"
    },
    {
      "time": "4 Jul 2013 — 5:40pm",
      "content": "You're right, that serif isn’t working. Perhaps if was a bit smoother and dipped below the baseline? However, I do believe the regular 'n' is fine :)\n\nI was thinking swashes in the italic mostly, but also some others along the lines of 'gy' and archaic letters/ligatures.\n\nAnd yes! a display weight would be killer.\n\n"
    },
    {
      "time": "4 Jul 2013 — 9:14pm",
      "content": "I think higher contrast will be a really tricky challenge for this design.  \nThis is moving in a great direction, keep it up.  \nYes, for the /e/ I wonder what a more slanted crossbar and/or an even smaller eye would look like. As Sindre said, keep the /c/ in mind, but also the /a/.\n\n"
    },
    {
      "time": "5 Jul 2013 — 5:05am",
      "content": "Added a few more letters and rather drastically changed the {f}. That {g} took me ages, but I like it now.\n\nIs the {s} perhaps a bit too unconventional?\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/T5_4133.png)\n\n"
    },
    {
      "time": "5 Jul 2013 — 9:29am",
      "content": "I think that structure of /g/ and /s/ is promising. Maybe rein in the outline slightly at that thickest corner where you're getting a little spottiness in both letters. /s/ looks wide, if you can narrow it without closing up the counters too much I would. Bowl of /g/ looks a little big, and ear quite wimpy, to my eyes. Is /r/ too narrow?\n\n"
    },
    {
      "time": "5 Jul 2013 — 9:34am",
      "content": "Perhaps the arm serif of /k/ is an opportunity to do something interesting with the \"grippiness\" idea of this typeface.\n\n"
    },
    {
      "time": "5 Jul 2013 — 10:11am",
      "content": "I like where it’s going, it seems to have a bit of a textura feel to it now. A very good thing.\n\n"
    },
    {
      "time": "5 Jul 2013 — 10:37am",
      "content": "I say this very rarely, but: I think the descenders are a bit short.\n\nI really like the \"g\", but the bottom needs to be bigger (which fits nicely with the above) and the ear is a bit too shy.\n\nThe \"s\" is very nice.\n\nhhp\n\n"
    },
    {
      "time": "5 Jul 2013 — 4:34pm",
      "content": "Thanks for the comments! I think I acted on most of them.\n\n@ Joshua: Textura has been a strong influence on most of my fonts so far, so I'm not surprised to see it seep into this one as well. It's certainly welcome. :)\n\n@ Hrant: Yeah, you're right about the descenders. I expanded them a bit. The font is now 1050 ems tall; that's no problem these days, right?\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/T6_4959.png)\n\nI'm getting a bit of a \"sloppy\" vibe off the last few characters. I guess I shouldn't have finished them at night... maybe I should make some of those strokes straighter after all?\n\nAfter some more experimentation, I abandoned that bearded {f} design for a pretty Garalde banner. I think I can get away with it, especially since it also appears in {y}, where the \"beard\" just looked really stupid. I'm wondering whether I should also turn {j}'s descender into a banner...? I do like the current look, though.\n\nHmmm... is {b} a bit too rotund?\n\n"
    },
    {
      "time": "5 Jul 2013 — 5:04pm",
      "content": "Hm, {u} was a bit cramped around the foot like the original {a}, so I gave it the same treatment.\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/T7_4164.png)\n\n"
    },
    {
      "time": "5 Jul 2013 — 5:40pm",
      "content": "I think the new \"f\" is too mainstream.\n\nTry making the top-right of the \"e\" a hard corner.\n\nNon-1000-upm fonts are rarely a problem these days. But not never...  \nReally, if you're that close to 1000, spend the time making it fit.  \nBut first: what's your talus (internal leading), at top and bottom?\n\n> I guess I shouldn't have finished them at night\n\nDon't worry, it's never finished anyway. :-)\n\nhhp\n\n"
    },
    {
      "time": "8 Jul 2013 — 11:46am",
      "content": "I like the bannered {f} and {y} much better than what I could do with beards.\n\nTried the corner on {e}... just looks weird, though:\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/T8_4744.png)\n\nIf I don't make it into a corner but just shift the weight there, it works, but I think I prefer the original design with its emphasis on the horizontal stroke.\n\nI'm not sure I feel like rescaling all letters at this point. I don't know what a talus is, and I don't recall seeing a field to that effect in Glyphs. I thought it just made the line height equal to the span between descender depth and ascender height...?\n\nIncidentally, do I need looser spacing, at least for the non-display versions?\n\n"
    },
    {
      "time": "8 Jul 2013 — 5:02pm",
      "content": "First experimentation with capitals...\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/T9_4041.png)\n\n"
    },
    {
      "time": "8 Jul 2013 — 5:41pm",
      "content": "Maybe a touch too short given the ascender height? /E/ looks narrow to me. The \"horizontals\" of /B/ look quite straight; perhaps something more interesting can be done with the structure of those bowls. Thicks of /C/ and especially /A/ may be too dark. But otherwise these look really fantastic!\n\n"
    },
    {
      "time": "8 Jul 2013 — 6:57pm",
      "content": "Talus (a term not used by many people, I admit) means the emptiness above the ascenders and below the descenders. It's needed (I feel) because you don't wants lines touching when set flush (zero leading).\n\nhhp\n\n"
    },
    {
      "time": "9 Jul 2013 — 3:05am",
      "content": "Thanks for the comments!\n\nExperimenting with a new {A}... not sure it's better though:\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/T10_4139.png)\n\nI'm wary of skewing the middle of {B}. A lot of fonts do it, one way or the other, and I usually don't like it. Anyway, up close, the current {B} already looks quite dynamic:\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/T13_5509.png)\n\nTrying to even out the color of {g s ß}:\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/T11_4000.png)\n\nBalancing {a} and {e}:\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/T12_4391.png)\n\n"
    },
    {
      "time": "9 Jul 2013 — 4:06am",
      "content": "Perhaps the upper bowls for {a}, {c}, {r} and {s}, start/end too \"vertically straight\". And the German double {s} seems a bit forced. In general, I find the font quite interesting, although (at least for the non-expert eye) perhaps not too different from Satyr ...\n\n"
    },
    {
      "time": "9 Jul 2013 — 10:24am",
      "content": "@ AL: Good point about the \"beards\" — they don't have exactly straight sides, but they look like that in comparison with the more pronounced curves everywhere else. I'll give them a bit of concavity.\n\nHow is the {ß} forced? It's the same architecture that Garamond and Palatino use, for instance. I much prefer this over the Sulzbacher form, and it's nicely \"grippy\", too.\n\nAs for Satyr: Sindre himself told me not to worry about the similarity... and seeing the two fonts side-by-side, I find them very distinct from each other. I suspect Satyr might end up begetting an entire generation of new fonts in this style, as did Frutiger... I'd like to christen this kind of fonts \"organic serifs\", while I'm at it. ;o) The non-straight stroke boundaries remind me of how trees grow additional material wherever the mechanical strain is greatest, rather than just following a geometric ideal.\n\n@ Hrant: I haven't yet seen a talus feature in Glyphs... though I'm sure it must be around somewhere. I'll ask.\n\n"
    },
    {
      "time": "9 Jul 2013 — 10:50am",
      "content": "I agree with Alter Littera that you could tone down the shape of ‘ß’ a bit. You mentioned Palatino. Here is a comparison of Palatino and Palatino Nova:\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/palatino_5642.png)\n\nPalatino Nova (bottom) makes ‘ß’ look less like a ‘ſ+s’ ligature, which I think is a good thing. If you change anything, I would go in that direction.\n\n"
    },
    {
      "time": "9 Jul 2013 — 8:50pm",
      "content": "There's no \"talus feature\" (although that might actually be a useful thing). You just have to make your descenders and ascenders shorter than the bounds. I like leaving ~25 units up top and ~10 at the bottom (in an Em of 1000).\n\nI agree with the eszet advice you're getting; it should be one thing.\n\nBTW, we _will_ need to find a good term for this style. My eternally-gestating Paphos fits in there too.\n\nhhp\n\n"
    },
    {
      "time": "22 Oct 2013 — 6:41am",
      "content": "I'm thinking of going a bit crazy with the tildes. Not sure whether I'm pulling it off, though:\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/tildes_4239.png)\n\nI seem to remember this tilde shape from another font that was discussed here. Does anyone remember which one it was? I'd like to give due credit.\n\n"
    },
    {
      "time": "22 Oct 2013 — 6:55am",
      "content": "It reminds me of [this hyphen](http://web.archive.org/web/20150330022549/http:/typophile.com/node/28902#comment-163496), rotated.\n\n"
    },
    {
      "time": "22 Oct 2013 — 8:29am",
      "content": "Looks totally in character to me.\n\nhhp\n\n"
    },
    {
      "time": "23 Oct 2013 — 4:39pm",
      "content": "Fun with the IJ ligature! :)\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/MIJN_4536.png)\n\nAnd the Eng reminds me of a big friendly elephant.\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/eng_3885.png)\n\nAnd finally, I made some changes to ß (is it more in line with the other characters now?) and added a capital version:\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/eszett_5214.png)\n\n"
    },
    {
      "time": "23 Oct 2013 — 5:47pm",
      "content": "I'm with the faction that believes the cap eszet needs a hard top-left.\n\nhhp\n\n"
    },
    {
      "time": "29 Oct 2013 — 2:32am",
      "content": "Alright, I finished my first weight, including small caps, figure sets, arrows, kerning, ligatures, contextual alternates; the works.\n\nHowever, I'm a bit disappointed at what the font looks like when used for text. It strikes me as too black and too vertical. I might have accidentally made the display companion to the Traction text face! :\\ I'm hoping this might get better once I have a spectrum of weights. I might then declare the current weight Medium and have a Regular, Book, and Light to make for nicer text setting. Maybe I should also make a dedicated text cut with wider rounds and looser spacing.\n\nFirst of all, though, I plan to build an italic for my current weight. I have some unconventional ideas already. ;)\n\n@ Hrant: I disagree about the corner in the capital Eszett; it reads as a TZ ligature for me. However, I gave mine a \"shoulder\" on the upper left, which considerably improves its looks as a capital letter. Thanks!\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/Gdbls_5255.png)\n\n"
    },
    {
      "time": "29 Oct 2013 — 6:07pm",
      "content": "(Double post, sorry. What's wrong with this forum anyway these days?)\n\n"
    },
    {
      "time": "29 Oct 2013 — 6:10pm",
      "content": "Alright, I'm almost finished with the Italic. That was way easier than I thought.\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/italic_3632.png)\n\nOriginally, I wanted to use this crazy design for {a} and {g}, but ultimately I think I'm going to go with the much more harmonic single-storey approaches above.\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/gaga_4895.png)\n\nAnd here's some experimentation with weights. Unlike the Italic, this is promising to be a _lot_ of work.\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/weights_6502.png)\n\n"
    },
    {
      "time": "29 Oct 2013 — 7:47pm",
      "content": "Italic is looking great!\n\nThat /a/ is indeed crazy but the /g/ may be worth playing with more. The monocular /g/ is I think the least handsome letter to my eyes.\n\nBaseline serifs I think need to come down a touch (e.g. looks like /n/m/h/ are lifting their right legs a bit).\n\nDo you intend to force weights to the same advance width?\n\n"
    },
    {
      "time": "30 Oct 2013 — 2:45am",
      "content": "_That /a/ is indeed crazy_ — Yeah, but is it the good kind of crazy? ;o) In any case, I'll ban it to .ss01.\n\nIt's tempting to keep the sort-of-binocular (sesquiocular?) {g}, but wouldn't it be at odds with the single-storey {a} then? Or should I try to come up with a more handsome monocular {g}?\n\nI've tried tinkering with the baseline serifs, but they immediately start looking too low to my eyes if I budge them...\n\n_Do you intend to force weights to the same advance width?_ — Not really, it just came out that way in this quick-and-dirty tryout. Actually, weight change is something I've never really done successfully (I did it for Backstein, where it was much easier than usual, and still I didn't like the results much). I'm actually thinking of outsourcing the job.\n\n"
    },
    {
      "time": "30 Oct 2013 — 2:54am",
      "content": "(Double post again.)\n\n"
    },
    {
      "time": "31 Oct 2013 — 9:09pm",
      "content": "> It's tempting to keep the sort-of-binocular (sesquiocular?) {g}, but wouldn't it be at odds with the single-storey {a} then?\n\nNot at all! (If you don't believe me you can ask Mr. Garamont, Caslon, Baskerville, Benton, Zapf...)\n\n"
    },
    {
      "time": "19 Feb 2014 — 8:32pm",
      "content": "I would actually keep both versions of the /g with the double-storey one as an alternate. I know I would find use for both versions.\n\nBy the way, amazing design so far. Are you still working on this? It reminds me of some of Brian Zick's unreleased work. Not distinctly, just the amount of innovation present. Not over the top, but still very refreshing, which I think is a perfect formula.\n\n"
    },
    {
      "time": "4 Mar 2014 — 3:03am",
      "content": "@ Martin: I am indeed still working on this, though my day job is currently not leaving me a lot of spare time. I have a more or less finished (or at least stabilized) complete weight with italics and smallcaps ready, and am collaborating with Mekkablue to expand that to a wider range of weights.\n\nYou can see a specimen of the current weight here:  \n [http://www.cinga.ch/type/Traction\\_specimen.pdf](http://web.archive.org/web/20150330022549/http:/www.cinga.ch/type/Traction_specimen.pdf \"http://www.cinga.ch/type/Traction\\_specimen.pdf\")\n\nClearly, this weight is too heavy for body copy. It will probably end up as the Medium, with a lighter Regular and Book intended for body copy, as well as Light, Thin, Semibold, Bold, and Black for editorial work. I do see the Medium as sort of the default weight for branding, though.\n\n"
    },
    {
      "time": "6 Mar 2014 — 2:18am",
      "content": "Really gorgeous work. I'm really eager to see more weights.\n\n"
    },
    {
      "time": "21 Mar 2014 — 5:58am",
      "content": "Toying around with a display cut:\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/traction_display_5307.png)\n\n"
    },
    {
      "time": "21 Mar 2014 — 11:13am",
      "content": "Hi,\n\nI just saw this now, and really like the look. It also reminds me a bit of Michael Harveys work, like Ellington (consider it a compliment, I love Ellington).\n\nThe only thing that keeps bothering me is the S, especially the capital version. The bump in the curve irritates me, and as a whole it looks a bit unbalanced to me (a bit top-heavy perhaps). I am no pro, just a type geek, and would like your perspective on this.\n\n"
    },
    {
      "time": "21 Mar 2014 — 12:39pm",
      "content": "That pregnant \"S\" is my favorite feature!\n\nhhp\n\n"
    },
    {
      "time": "22 Mar 2014 — 1:53pm",
      "content": "I also like that /S a lot, so it's not going anywhere. ;o) The bump used to carry too much weight, but I think I've addressed that problem. I might still lift the spine just a bit to see if it is, indeed, top-heavy.\n\nWorking on the display cut skews my perception of the text cut — it strikes me as all chunky and fuzzy now when viewed at large sizes. Well, I guess that's what display cuts are for!\n\n"
    },
    {
      "time": "28 Oct 2014 — 6:32am",
      "content": "The display cut is pretty much finished now, I intend to give it its final polish and release it within the year.\n\nMeanwhile, work on the weight spectrum of the text cut is progressing, albeit slowly:\n\n[http://typedrawers.com/discussion/386/traction-a-text-font-with-grip-and...](http://web.archive.org/web/20150330022549/http:/typedrawers.com/discussion/386/traction-a-text-font-with-grip-and-bite-in-development#latest \"http://typedrawers.com/discussion/386/traction-a-text-font-with-grip-and-bite-in-development#latest\")\n\nI'm glad to see that the \"chunkiness\" and \"gnarliness\" that the default weight of the text cut suffered from when set in multi-line text blocks is amended by interpolating down to lighter weights. I still think it needs to become a bit sleeker and lighter for comfortable reading, but for that I'm planning to widen the sidebearings. Maybe I should also tone down the fat terminals a bit in the text version...?\n\n ![](http://web.archive.org/web/20150330022549im_/http:/typophile.com/files/textblock_6626.jpg)\n\n"
    }
  ]
}
