{
  "id": "104432",
  "title": "Corporate Typeface - please help me identify",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "#find #font",
    "Type ID Board [OLD]"
  ],
  "content": "Hello Typophile community! Long-time listener, first-time caller, yada yada.\n\nI could really use some help identifying this....well, ugly typeface.\n\n ![](http://web.archive.org/web/20140828211228im_/http:/typophile.com/files/typespecimen_4346.jpg)\n  \nIt's the logotype of a client of mine (words scrambled to protect their identity). I'm doing a marginal \"refresh\" on the company's brand. However, not only are they refusing to let my company select a new typeface for them, they can't even tell us which typeface we can't change. Since they have no idea.\n\nI've been racking my brain and going through the usual online channels (identifont, etc.), but no luck. I was really hoping someone here might be able to help.\n\nFor clarification - the specimens you see before you are all the characters I have to work with. No lower case, no punctuation.\n\nThank you sincerely in advance for any clues.\n\n",
  "author": "Clever Typenerd...",
  "time": "8 Jul 2013 — 10:15am",
  "uid": "212910",
  "comments": [
    {
      "time": "8 Jul 2013 — 10:34am",
      "content": "I doubt that this is a typeface: the gross inconsistencies in stroke width suggest a rather poorly executed amateur job...\n\n"
    },
    {
      "time": "8 Jul 2013 — 11:28am",
      "content": "That's what I'm afraid of, though I am still holding out hope it was at least based on something recognizable.\n\n"
    },
    {
      "time": "8 Jul 2013 — 3:20pm",
      "content": "hm. hard to guess. are all the letters from one word? (so, the inconsistency would be explained or denied if say one word was more fake bold than another?)\n\nhonestly with these samples i could guess it is two words, and that the font has been stretched. weird distortion in the bowls makes me think that.\n\nneed more clues!!\n\n"
    },
    {
      "time": "8 Jul 2013 — 11:02pm",
      "content": "Reminds me of [Mr Eaves Sans](http://web.archive.org/web/20140828211228/http:/www.myfonts.com/search/Mr+eaves+sans). May be distorted as suggested by Jodie...\n\n"
    },
    {
      "time": "9 Jul 2013 — 7:39am",
      "content": "The letters above are single instances of the entire company's name and sub-title. Many of the letters above are repeated multiple times (c, o, i, r).\n\nMy best guess at this point is that it's actually Arial Narrow Bold, scrunched down to roughly the natural x-height (to essentially make a \"wide\" version of the type), and then poorly retraced from a low-resolution jpg version of the logo, likely taken straight from the corporate web site. I'm not dealing with a client who has a history of valuing properly-handled or executed artwork. They have several different \"versions\" of the logo in active use, using completely different typefaces, and they don't seem to see any differences between them. The type samples above come from what they have declared to us was \"the official logo.\"\n\nThe crossbar of the H and the bottom bowl of the R and P were what tipped me off to it being a scrunched manipulation of a narrow case. The curvy leg of the R seems to be a custom element. Whether intentionally drawn that way, or just a clumsy evolution from multiple re-tracings I can't really say at this point.\n\nWhat do you guys think? And thanks again for the responses. Much appreciated.\n\n"
    }
  ]
}
