{
  "id": "104489",
  "title": "VOLT problem with the shipped font (arabic font)",
  "forum": "Arabic Typography & Type Design",
  "tags": [
    "Arabic Typography & Type Design",
    "Arabic Typography and Computing Solutions"
  ],
  "content": "im trying to add Contextual Alternate feature to an Arabic font on Microsoft VOLT.  \nThe font is shipping without any errors. However, the shipped font applies the marks differently then what i defined. plus the characters shift position either upwards or downwards, each set of glyphs behave differently.  \nN.B: everything seems perfect when i use the proofing tool to check if what ive done is right on VOLT\n\nWhat is the problem? and how can i fix it?\n\n",
  "author": "P_G",
  "time": "10 Jul 2013 — 2:42am",
  "uid": "212822",
  "comments": [
    {
      "time": "10 Jul 2013 — 10:00pm",
      "content": "I can't help you myself, but I did want to say hi, especially since your name is Patil, and my sister was actually the first Patil! :-)\n\nAnyway if you don't get any help I'll ping the right people for you.\n\nhhp\n\n"
    },
    {
      "time": "11 Jul 2013 — 10:17am",
      "content": "What applications have you seen the bad behaviour in? Adobe applications will behave differently to Microsoft applications for some things.  \nHave you stepped through the lookups in the VOLT proofing tool to see if a lookup is shifting things in the same way as you are seeing in the application. Your shift values are obviously being interpreted differently by the application to how they are being used and displayed in VOLT, are they the correct way round?\n\n"
    },
    {
      "time": "29 Aug 2013 — 8:42pm",
      "content": "Patil,  \nIf you see the marks shifting position in Adobe InDesign then you need to open the \"Diacritic Positioning\" menu and check one of the \"OpenType\" options instead of the \"Normal\" default.\n\nIn the settings of Loose, Normal, and Tight InDesign will position the marks where it sees fit. In the two OpenType settings it will use your OpenType lookups to position the marks.\n\n"
    }
  ]
}
