{
  "id": "104430",
  "title": "Nancy Drew Condensed Serif from mid-30s",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "30s",
    "American",
    "book cover",
    "serif",
    "Type ID Board [OLD]"
  ],
  "content": "Any ideas much appreciated!\n\n ![](http://web.archive.org/web/20140802223606im_/http:/typophile.com/files/il_fullxfull_6167.392974854_78t1.jpg)\n\n",
  "author": "mvor",
  "time": "8 Jul 2013 — 9:22am",
  "uid": "5477",
  "comments": [
    {
      "time": "8 Jul 2013 — 12:54pm",
      "content": "Some of the Usherwood / Red Rooster Collection fonts seem to be getting close, any other clues out there?\n\n ![](http://web.archive.org/web/20140802223606im_/http:/typophile.com/files/RedRoostered_4296.jpg)\n\nthanks\n\nM\n\n"
    },
    {
      "time": "8 Jul 2013 — 1:04pm",
      "content": "I'm guessing handlettering, based on the evidence of slight variations in the letterforms (e.g., the **T** in _locket_ is wider than the other **T** s). [Cheltenham](http://web.archive.org/web/20140802223606/http:/www.myfonts.com/fonts/bitstream/cheltenham/) has a similar feel, though you'd have to modify it to get the cockeyed **O** and the high-waisted **K**.\n\nThis example was foil stamped, not printed, so the binder would have had to make a stamping die. In the 1930s this could have been done photographically, so it would have been just as easy to make it from handlettering as from a repro proof of type. Book titles were commonly handlettered in those days when there were far fewer typefaces available in the large sizes needed for book covers and jackets.\n\n"
    },
    {
      "time": "8 Jul 2013 — 5:51pm",
      "content": "I agree with PublishingMojo that it's hand-lettered, as were almost all book covers from the era, and with his explanation.  \nStill, the lettering is interesting. I adjusted the geometric distortion and improved the contrast so we can better see what we are trying to match:\n\n ![](http://web.archive.org/web/20140802223606im_/http:/typophile.com/files/NancyDrew6_3734.jpg)\n  \nWe have a mixture of styles so no single font is going to do the trick. The angled slope of O, an \"old style\" font feature is unlikely to be found in fonts with the boxy structure of the other letters. And note the high-waist K.  \nDon \n"
    },
    {
      "time": "8 Jul 2013 — 11:48pm",
      "content": "Thanks for the ideas and knowledge, I suspected this might be a hand-lettered quirk, quite like the effect of the reversed 'O'!\n\nM\n\n"
    },
    {
      "time": "9 Jul 2013 — 2:31am",
      "content": "You're welcome.  \nI am assuming the lettering is from the first edition, 1933.  \nThe Nancy Drew books began in 1930. This one is number 11. Five more in the 1930s. If the publisher, Grosset & Dunlap, was seeking some consistency in the series, the lettering on at least some of the other 1930s books might in the same style. The lettering would probably be sufficient for a font designer to make a titling font that would have this particular retro flavor. IMHO there is no shortage of people able to use modern font-making tools who are looking for interesting material.  \nDon\n\n"
    }
  ]
}
