{
  "id": "104507",
  "title": "Fonts for an 'elegant and smart' book",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I've been working on a book for a client that's a 'brief' (read, 400 pages) history of trust that links one of the old English Universities with a Japanese bank. Up till this point I've been using ITC Garamond Std for the main body of the text and Optima LT Std for other things on the page, the page numbers, book title in the top left corner etc. I'd been using these because this is what the client told me to use, but she's sent an email asking for suggestions for changing the 'look' of the page. She wants to keep it very \"elegant, smart and artful\" so I was wondering if anyone had suggestions for alternatives, particularly for Optima - I usually work with sans serif fonts so this is pretty new territory for me.  \nIf anyone knows a good combination using Garamond - or an alternative, I'm not too rigid at this point - that'd be a lifesaver!\n\n",
  "author": "PhishandChips",
  "time": "10 Jul 2013 — 4:30pm",
  "uid": "212996",
  "comments": [
    {
      "time": "10 Jul 2013 — 7:46pm",
      "content": "<cite>the page numbers</cite>\n\nThey're called \"folios\"\n\nThere is no way to teach you how to design a book in an internet post, just like you can't teach me -- a good book interior designer -- how to make an effective print ad with a post or two.\n\nBTW, in the book world, ITC Garamond is generally considered a joke.\n\nHaving said that, for an Optima-like variant, take a look at Sumner Stones's **Magma** -- I think a weight in the \\*compact\\* family might serve you best, perhaps the semi-bold for the smaller type, normal for anything over, say, 24 point, but use you own judgement.\n\n[http://www.stonetypefoundry.com/magmaoverview.html](http://web.archive.org/web/20140718200740/http:/www.stonetypefoundry.com/magmaoverview.html \"http://www.stonetypefoundry.com/magmaoverview.html\")\n\nFor the text, it kind of depends if you want to emphasize that historical feel with a traditional typeface, or use something that would appeal to a post-2000 audience. I've heard people say of Scala, for example \"Oh, it's so 1990s...\"\n\nIn any case, it is best to be sure of your text face first, then select a display. Here's an off-the-wall suggestion I have used, Magma for display and Quadraat for text. It is elegant, but definitely not elegant old-school-British (i.e., Caslon, Baskerville, Scotch). I have used the Quadraat/Magma pairing several times for an academic works, once I believe for a university press book on an analysis of the I Ching. It met it's audience & I think looked quite nice.\n\nPretty sure this is the one, but sadly, you can't \"look inside.\"\n\n[http://www.amazon.com/Fathoming-Cosmos-Ordering-World-Evolution/dp/08139...](http://web.archive.org/web/20140718200740/http:/www.amazon.com/Fathoming-Cosmos-Ordering-World-Evolution/dp/0813927056 \"http://www.amazon.com/Fathoming-Cosmos-Ordering-World-Evolution/dp/0813927056\")\n\nFWIW\n\n"
    },
    {
      "time": "10 Jul 2013 — 9:01pm",
      "content": "This is wide open, so I would trust your own judgement.  \nPeruse a large bookstore and ﬁnd some books with type treatments that you think will be appropriate to the task in hand, and that you also like the look of. The trick is to then identify said fonts—which you can do here in the ID forum, or at MyFonts “WTF”.\n\n"
    },
    {
      "time": "10 Jul 2013 — 10:33pm",
      "content": "It is indeed very hard to give good advice here, but any advice is better than none.\n\nTo narrow down your search, I would offer these beliefs of mine:  \n- Don't use a sans for a large amount of text.  \n- One way to look \"elegant\" is to use a (relatively) narrow font.  \n- Another way is to use a font with long extenders (i.e. small x-height).  \n- The category of type that best conveys \"trust\" is wedge serifs.  \nSome mentioned here: [http://typophile.com/node/39407](http://web.archive.org/web/20140718200740/http:/typophile.com/node/39407 \"http://typophile.com/node/39407\")\n\nhhp\n\n"
    },
    {
      "time": "11 Jul 2013 — 10:48am",
      "content": "Brilliant, thank you all for the advice and suggestions of fonts, it's been a real help. Particularly about ITC Garamond, I'm only two days off of 18 so I'm not exactly well versed in what the industry thinks of certain fonts. I'll try the ones you said out, thanks again!\n\n"
    },
    {
      "time": "12 Jul 2013 — 4:44am",
      "content": "Note that the scorn of the industry is usually directed just at ITC's particular cut of Garamond, not at Garamond altogether. You might try Garamond Premier Pro (which is an Adobe font, but not the same as Adobe Garamond) for a more authentic, and arguably more \"elegant\" and \"smart\" alternative.\n\nApart from these adjectives, is there any particular aesthetic / time period / culture / mood you're aiming for? Have you thought about other aspects of the design — trim size? kind of paper? margins? measure? layout? second color? All these things will have an impact on how your design feels.\n\n"
    }
  ]
}
