{
  "id": "104529",
  "title": "Introducing HWT Slab from the Hamilton Wood Type Foundry- Lost twins of bold, rugged wood type...",
  "forum": "Home",
  "tags": [
    "Clarendon",
    "decorative",
    "hamilton",
    "News",
    "poster",
    "serif",
    "Wood Type"
  ],
  "content": " ![](http://web.archive.org/web/20150322024206im_/http:/typophile.com/files/slab-news-480_4081.png)\n\n[HWT Slab](http://web.archive.org/web/20150322024206/http:/www.hamiltonwoodtype.com/slab.html) features two styles-Antique and Columbian. These two extra bold fonts are classic slab serif wood type styles with one detail of difference. Columbian is an extra bold Clarendon wood type that was manufactured by many of the wood type manufacturers in the late 19th century. \"Clarendons\" feature bracketed or rounded serif joins whereas \"Antique\" was a class of typefaces that features squared off slab serifs. Some type designs have only minor differences from others. The Columbian design is essentially identical to Wm. Page & Co.'s \"Antique no. 4\", with the difference being the bracketed serifs.\n\nIn researching material for the digitization of Columbian, we started with a 15 line font identified as \"Columbian\" shown in the Angelica Press wood type portfolio (printed in 1976). This font is in fact \"Page Antique no. 4\". Comparing Antique #4 to Columbian specimens from Hamilton and other manufacturers confirms the only real difference is the serif treatments. Therefore, both fonts are presented as a pair. Each font features a full Western & Central European character set.\n\nHWT Slab digitized by Tim Martin.\n\nFor more detailed information regarding this release and to learn more about the making of the font, visit the [Hamilton Wood Type Foundry](http://web.archive.org/web/20150322024206/http:/www.hamiltonwoodtype.com/slab.html) website.\n\nSpecial introductory pricing available through July.\n\n[Hamilton Wood Type Foundry](http://web.archive.org/web/20150322024206/http:/www.hamiltonwoodtype.com/)\n\n",
  "author": "jimy",
  "time": "11 Jul 2013 — 9:46am",
  "uid": "5133",
  "comments": [

  ]
}
