{
  "id": "104588",
  "title": "Help please",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Help, I've been trying to find what the hell this font is for a week already. Do you guys have any idea?\n\n ![](http://web.archive.org/web/20131013015340im_/http:/typophile.com/files/scp173_3554.jpg)\n\n",
  "author": "Lurker",
  "time": "12 Jul 2013 — 10:28pm",
  "uid": "213070",
  "comments": [
    {
      "time": "13 Jul 2013 — 4:55am",
      "content": "Any typewriter font might be close but here are a few that look good for this: for clean look, Typewriter from Font-Bureau; for more \"typed look\", Underwood Champion from Dafont or Type right! from Dafont.\n\n"
    },
    {
      "time": "13 Jul 2013 — 5:29am",
      "content": "Some more clean typewriter style fonts: [EF Techno Script](http://web.archive.org/web/20131013015340/http:/www.myfonts.com/fonts/ef/techno-script-ef/), [URW Typewriter](http://web.archive.org/web/20131013015340/http:/www.myfonts.com/fonts/urw/typewriter/), [Suomi Slab Serif](http://web.archive.org/web/20131013015340/http:/www.myfonts.com/fonts/suomi/slab-serif/), [ITC American Typewriter](http://web.archive.org/web/20131013015340/http:/www.myfonts.com/fonts/linotype/itc-american-typewriter/), [Liebe Ruth](http://web.archive.org/web/20131013015340/http:/www.myfonts.com/fonts/liebe-fonts/liebe-ruth/).  \nHave not found a perfect match, particularly for the numbers.\n\nDon\n\n"
    },
    {
      "time": "13 Jul 2013 — 5:41am",
      "content": "Underwood Champion has the numbers very close but is not a clean font.\n\n"
    },
    {
      "time": "13 Jul 2013 — 7:23am",
      "content": "Good find, Bob.  \nThe font [Underwood Champion](http://web.archive.org/web/20131013015340/http:/www.myfont.de/fonts/infos/6416-Underwood-Champion.html) also has the letters that match the sample.  \nI believe that we can infer that the clean font in the sample was also based on an Underwood Champion typewriter or another typewriter using the same key faces or element.  \nThe font \"Underwood Champion\" was created by Vic Fieger in 2008 and is being distributed through a German website. So _possibly_ the clean typewriter style in the sample was created by a German designer not selling through MyFonts. But then again, it is _also_ being distributed through various non-German sites.  \nDon\n\n"
    },
    {
      "time": "13 Jul 2013 — 8:02am",
      "content": "The other option is that the sample was typed on a vintage Underwood Champion Typewriter and if you want to duplicate that font you need to buy one on e-bay or as below.\n\nAnother source for the Vic Fieger font is [http://www.fontsquirrel.com/fonts/Underwood-Champion](http://web.archive.org/web/20131013015340/http:/www.fontsquirrel.com/fonts/Underwood-Champion \"http://www.fontsquirrel.com/fonts/Underwood-Champion\")\n\nUnderwood Champion Portable of 1938  \nYour Price: $625.00  \nFor a machine of this size, the Champion certainly had a lot of punch! These were introduced in the late 1930s among a full line Underwood's portables, but Champion was the top of the Underwood Typemaster portable line. The numerous Underwood Typemaster features, that once only available in an office-sized machine features, were standard here, including the Champion keyboard, sealed-action frame, dual-touch tuning and an inbuilt tabulator. In the 1940s, Champions were chosen by the U.S. Army for their ease of use, excellent durability and proven reliability in all sorts of conditions. The early version came in three glossy colors: black, maroon and green. Charcoal gray crackle paint and improved plastic key tops was common in later versions. (A carrying case with typing stand was also offered at the time as an optional accessory for both Universal and Champion models.)\n\n[http://mytypewriter.com/underwoodchampionportableof1938.aspx](http://web.archive.org/web/20131013015340/http:/mytypewriter.com/underwoodchampionportableof1938.aspx \"http://mytypewriter.com/underwoodchampionportableof1938.aspx\")\n\n"
    },
    {
      "time": "13 Jul 2013 — 11:36am",
      "content": "An alternative is to find the _original_ not a carbon copy of a US Army report of the era typed on a fairly new well maintained typewriter. By well maintained I mean a neatness obsessed clerk took the effort to clean the typefaces with a brush so that they shined. No way to tell except by looking at results. Prospects of finding a good specimen range from good to impossible. Might even be something with excellent scan resolution at archive.org.  \nBut this is more typical of what I found so far:\n\n ![](http://web.archive.org/web/20131013015340im_/http:/typophile.com/files/1945-07-07excerpt_4879.jpg)\n  \nGiven your review of the significance of this particular machine, it would certainly be a worthwhile project to do a clean font based on it.  \nDon \n"
    },
    {
      "time": "13 Jul 2013 — 1:45pm",
      "content": "Another typewriter style font made from the Underwood Champion design is  \n [P22 Typewriter](http://web.archive.org/web/20131013015340/http:/www.fontspring.com/fonts/p22/p22-typewriter) by Richard Kegler.  \nNo cleaner than Vic Fieger's version, and perhaps even more garbled.  \nDon\n\n"
    },
    {
      "time": "13 Jul 2013 — 2:24pm",
      "content": "Since P22 says: \"This font is primarily based on the typewriter used for a typographic conference document from 1966 in Mainz Germany. The model and age of the typewriter used is not known.\", we can assume that Underwood Champion models had a long period of use. Lurker's sample has the number 1993 in the first line, \"moved to Site 19 1993\", and if that is a date it would be really close to the end of the typewriter period, and even then mostly the IBM Selectric was what had persisted. I was working in museums then and we kept a manual typewriter around to fill out shipping forms - I do not think it was a Underwood Champion.\n\n"
    },
    {
      "time": "13 Jul 2013 — 4:14pm",
      "content": "I learned to type on a Royal portable in high school. A great cost saver when I went to university and saved the expense of 25¢ a page for essays & term papers. Later, in the era when professionals had secretaries who churned out dictated stuff on IBM Selectrics, I managed to get my hands on a big old Underwood or Remington and typed out private notes. If you are careful not to make mistakes, keep the typefaces from getting clogged, change the ribbon regularly, and the machine has not been abused, the output looks pretty good. It does _not_ jump all over the place like the ersatz typewriter fonts. So, I tend to agree that in view of the reference to 1993, Lurker's sample could indeed have been a typed sheet and not a digital font.  \nDon\n\n"
    },
    {
      "time": "14 Jul 2013 — 10:27pm",
      "content": "Wow, thank you all for the suggestions, I'll give these a try.\n\n"
    },
    {
      "time": "14 Jul 2013 — 11:31pm",
      "content": "You're welcome.  \nDon\n\n"
    }
  ]
}
