{
  "id": "104579",
  "title": "Buying a decent set of fonts for an in-house design department",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Soon I will have the power (mwah-hah-hah-hah) to purchase a decent set of fonts around here. I've been surviving off the basics: Helvetica, Univers, Gill Sans, Sabon, etc. I want to get at least a dozen new display typefaces that bring us at least into the last decade. Would love some HF&J action, as well as some smaller foundries.\n\nHas anyone been in a similar situation? I'd love to here what you ended up doing. TBH I don't even know where to start. I guess a budget. Is $5K enough?\n\n",
  "author": "braaad",
  "time": "12 Jul 2013 — 1:16pm",
  "uid": "70779",
  "comments": [
    {
      "time": "12 Jul 2013 — 1:58pm",
      "content": "When I was in your situation I would get new fonts for speciﬁc projects as they occurred.  \nAlthough once in while I would get something that really intrigued me.  \nIsn’t it better to try out fonts for a new project, having the entire universe of fonts at your disposal, rather than being limited to what’s on hand?  \nThe downside to this strategy is that there are advantages to working with familiar tools.  \nAlso, if you have crowd-pleasers such as Gotham, it does make one’s designs more attractive, although at the expense of sameness.\n\nAt the moment, some foundries offer huge discounts on new releases, so you might ﬁgure that into your plans.\n\n"
    },
    {
      "time": "12 Jul 2013 — 2:10pm",
      "content": "I highly recommend [Starling](http://web.archive.org/web/20140804165959/http:/www.fontbureau.com/fonts/starling/) from Font Bureau.\n\n"
    },
    {
      "time": "12 Jul 2013 — 2:16pm",
      "content": "Thanks for your thoughts, Nick. That is a very tempting strategy, however, we need a group of fonts to share across designers, teams, etc. I think I'll just have to come up with a short list of hard-working, crowd-pleasers, etc.\n\n"
    },
    {
      "time": "12 Jul 2013 — 3:04pm",
      "content": "I recommend planning this in terms of the kinds of things you expect to be creating, and hence categories of fonts by use.\n\n"
    },
    {
      "time": "12 Jul 2013 — 4:21pm",
      "content": "however, we need a group of fonts to **share across designers, teams,** etc. [emphasis added]\n\nBe sure to read the number of users permitted with the license. A few -- such as H&FJ you mention, start with one computer & the price goes up with each additional station. More common is a basic license that covers 5 computers. --Though not always, which is why you should check.\n\nAlso, some companies favor bundling of fonts -- you buy a package for a fairly stiff price. Not always a very good bargain. Sometimes that's the only way to get anything from that publisher, sometimes you can buy individual fonts.\n\nListen to Nick. His strategy will save your company money over time. And if the world works the way it should, saving your company money will pay off for you, too.\n\n"
    },
    {
      "time": "12 Jul 2013 — 5:19pm",
      "content": "Buying fonts doesn't have to be a cold, clinical activity, and penny-pinching isn't always fruitful.\n\nBrad, buy fonts you admire.\n\nhhp\n\n"
    },
    {
      "time": "12 Jul 2013 — 6:05pm",
      "content": "[Drop me a line](http://web.archive.org/web/20140804165959/http:/www.terminaldesign.com/)\n\n"
    },
    {
      "time": "17 Jul 2013 — 1:08pm",
      "content": "Knowing the number of users would be very helpful here. 5K might be a great budget, or a lousy one.\n\n"
    }
  ]
}
