{
  "id": "10462",
  "title": "Need a new face for my theater company",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm the art director for a small theater company whose unofficial motto is \"theater for people who hate theater; theater for people who love theater.\"   \n   \nOur audience, for the most part, ranges from 18-35, not your typical theatergoing crowd. Here is the logo, plus some recent poster images, to give you an idea of the kind of work we do:   \n   \n ![impact](http://web.archive.org/web/20131019065435im_/http:/www.typophile.com/forums/messages/30/7036.gif)   \n   \n ![scab](http://web.archive.org/web/20131019065435im_/http:/www.typophile.com/forums/messages/30/7037.jpg)   \n   \n ![henry iv](http://web.archive.org/web/20131019065435im_/http:/www.typophile.com/forums/messages/30/7038.jpg)   \n   \n ![mouse](http://web.archive.org/web/20131019065435im_/http:/www.typophile.com/forums/messages/30/7039.jpg)   \n   \nNow, the request: I want to select a typeface (with both display and text weights) that reflects the company's attitude. Show logos will always vary, but I want to keep the information font the same from poster to poster (other design elements will also help create a consistent look among posters).   \n   \nIn addition, I want the typeface to be appropriate for text usage, such as for the program. Two faces I've considered are [HTF Gotham](http://web.archive.org/web/20131019065435/http:/www.typography.com/catalog/gotham/index.html) and [PsyOps Faceplate Sans](http://web.archive.org/web/20131019065435/http:/www.psyops.com/html/spec_faceplate.html), but neither seems to really fit the bill.   \n   \nAny suggestions will be quite helpful.\n\n",
  "author": "cheshiredave",
  "time": "27 Feb 2003 — 2:48pm",
  "uid": "1112",
  "comments": [
    {
      "time": "27 Feb 2003 — 2:58pm",
      "content": "Believe me, Stewf, I wanted desperately to find something appropriate on Storm. I just couldn't do it. I absolutely love their work. Our stab at Shakespeare was subversive, but it's not everything we do. If it were, I'd be all over Storm in a heartbeat.   \n   \nI think the successful face will be a versatile sans, and they just don't have much in that way.\n\n"
    },
    {
      "time": "27 Feb 2003 — 3:26pm",
      "content": "Hmmm... I think that -- apart from the fact that imo, the theater is sometimes trying to hard to be hip and young and the artwork thus overdoes it and ends up looking a bit too uncool and strained, a bit too\n\n"
    },
    {
      "time": "27 Feb 2003 — 3:27pm",
      "content": "arghh...   \n [www.lucasfonts.com](http://web.archive.org/web/20131019065435/http:/www.lucasfonts.com/)   \n [www.fontfont.com](http://web.archive.org/web/20131019065435/http:/www.fontfont.com/)\n\n"
    },
    {
      "time": "27 Feb 2003 — 3:37pm",
      "content": "TheMix is definitely interesting to me, but the full set is waaaay too expensive for either me or my little nonprofit company.   \n   \nZwo is new to me, though a little square for my tastes -- I'll have to check out other FF options.   \n   \nThanks for the critique and suggestions, HD. I agree -- I should be more subtle in my typography, which is exactly why I want to create a consistent set of posters where the type mostly gets out of the way, but doesn't roll over and die, either.\n\n"
    },
    {
      "time": "27 Feb 2003 — 3:48pm",
      "content": "Bliss, albeit a bit conservative, is also very nice   \n [http://www.typography.net/type/bliss.htm](http://web.archive.org/web/20131019065435/http:/www.typography.net/type/bliss.htm)   \n   \nand if you dig something more crass (albeit that WILL go at the cost of the legibility... :-))   \n [www.lineto.com](http://web.archive.org/web/20131019065435/http:/www.lineto.com/)   \nCourier Sans is just nifty. I wish they'd have Euro-currency or Dollars or something like that, but Cornels work is well worth calculating CHF to EUR.\n\n"
    },
    {
      "time": "27 Feb 2003 — 3:49pm",
      "content": "The Mix is a bit extravagant, quite annoying in longer texts (I think the German magazine H=F6rzu used it, horror on the eyes. ) Other than = that ANY font by Lucas is well worth ist money, you'll never regret spending your money on him :-). I cannot think of another European Font Designer with as much flair and a taste for readable and practical, yet very unique and individual fonts. Luc(as), in my humble opinion, is one of the finest typographers on the continent, with a sense of sleek and pure functionality and a wild streak that leads to monstrous gigantic families and hundreds of extra characters and thousands of kerning pairs... And on lucasfonts.com we just see the fonts on sale, there's a bit more he did for corporate designs, like the Volkswagen Futura riff, a Multiple Master with old style figures... Coolest Futura ever :-).   \n   \nAlso very good, if you work with InDesign, albeit not as unique as Lucas work: Chaparral pro and Myriad pro, both available at adobe.com\n\n"
    },
    {
      "time": "27 Feb 2003 — 3:55pm",
      "content": "Bliss is really nice. I also like FF Info.   \n   \nThanks for the continuing suggestions and opinions. I'm learning a lot and very glad I asked.\n\n"
    },
    {
      "time": "27 Feb 2003 — 4:01pm",
      "content": "FF Info.   \nVERY nice font, typical Spiekermann, a mix of Meta and Officina sensibilities. But be careful: The info, you can't see this as clear on he web, is very rounded, as it was designed for the Duesseldorf International Airport and was to be used in backlighted signs and displays. So it has a very unique feel, and after a time of using it as nodesign's house-font, I got very very tired of it, especially as it isn't really a good font for longer text. (Well, duh.. the new CD font we use is FF DIN, not much better to read when it comes to long texts, but at least clearer and colder... and better suited for the steel engraving we use on our letterheads and biz cards).   \n   \nBliss is cool but will rip a massive hole into your pockets as well, Jeremy Tankard ain't cheap :-D.\n\n"
    },
    {
      "time": "27 Feb 2003 — 4:05pm",
      "content": "Good thing I wasn't taking a sip of anything when I read that last line.   \n   \nI'll take the warning under consideration. I wonder if you could email me a pdf or something that shows Info in longer text?\n\n"
    },
    {
      "time": "27 Feb 2003 — 4:19pm",
      "content": "Luc(as) OSFs are more modern, not as playful as the Neufville Medievals. Neufville looks more Art Deco, but Luc somehow captured the cleaner, more geometric and practical aspect of the Futura. While it doesn't feel as historical, maybe, it just fits better into the context and it is MUCH better for practical purposes, at it doesn't feel as jarringly old-fashioned. Such a shame I cannot use that font in any commercial work at all, as it is licensed to Volkswagen exclusively.\n\n"
    },
    {
      "time": "27 Feb 2003 — 4:28pm",
      "content": "I've read through this thread twice and both times I thought [Base](http://web.archive.org/web/20131019065435/http:/www.emigre.com/EF.php?fid=79).   \n   \nMaybe you have already thought about it and eliminated it. I don't know.   \n   \nBut, your lovely posters have inspired me to offer my services to my local theater. Thanks.   \n   \n-smc\n\n"
    },
    {
      "time": "27 Feb 2003 — 5:40pm",
      "content": "Cheshire, for the moment I can't come up with any better suggestions than the ones already made, but one thing that strikes me is that you really need a font \"system\" with a wide range of (visually compatible) styles, so you can express yourself well in the context of varying plays. Cost: you could buy the parts of the mega-family that you need as you as go. And Luc[as] does indeed come to mind.   \n   \n\\> I cannot think of another European Font Designer with ....   \n   \nCan you think of a non-European one? I can't.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Feb 2003 — 5:55pm",
      "content": "Thanks, Sean. For some reason, Base has just always rubbed me the wrong way.   \n   \nHrant: point well taken. I think at this point my top three choices are:   \n   \nBliss   \nFF Info   \nTheMix   \n   \nAnd of course the most expensive one is at the top of the list. But I sent a plea off to the foundry, and hopefully Mr Tankard will take pity on me.   \n   \nI have one more poster to do this season, and I'm probably going to try out some of my ideas. I'll post them in the critique section. In this way I'm hoping to work the kinks out before I start the new season this summer.   \n   \nSean -- I've done posters for theater for a long time, and generally speaking, it's the most fun I've had as a designer. Impact especially has let me do pretty much whatever I've wanted. No pay to speak of, really, but damn fun.\n\n"
    },
    {
      "time": "27 Feb 2003 — 6:12pm",
      "content": "Scene could work. Or if you want a typeface \"poised to stand the test of time\", then go with MUNDO   \n ![:-)](http://web.archive.org/web/20131019065435im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nat [www.fonts.com](http://web.archive.org/web/20131019065435/http:/www.fonts.com/).\n\n"
    },
    {
      "time": "27 Feb 2003 — 10:12pm",
      "content": ":-D. Right-on. Luc is the man.\n\n"
    },
    {
      "time": "28 Feb 2003 — 11:13am",
      "content": "Well, Jeremy Tankard got back to me with the -- how shall we say -- _less-than-generous_ offer that since my organization is a nonprofit (or \"charity,\" as they apparently say in Britain), he would charge me the normal price (100 pounds per weight) but allow me to send the fonts to the printer so that they could print my posters and postcards.   \n   \nI understand and completely sympathize that creating high-quality typefaces is difficult and is worth good money, but this was really disappointing, not to mention out of line with most other foundries' prices. I guess I'll be going with something else.\n\n"
    },
    {
      "time": "3 Mar 2003 — 12:23am",
      "content": "Hum, competition, competition ;-)   \n   \nIf you refer to Thesis, Bliss, and others, I can\n\n"
    },
    {
      "time": "3 Mar 2003 — 10:06am",
      "content": "I have to ask, what is that font used for the word \"scab\" in the first poster?\n\n"
    },
    {
      "time": "3 Mar 2003 — 10:27am",
      "content": "Karen: it's [Eclat](http://web.archive.org/web/20131019065435/http:/www.eyewire.com/cgi-bin/WebObjects/View.woa/wa/viewProduct-product=495.htm).   \n   \nJean: those are both really nice. I'm putting both on my list of possibilities.\n\n"
    },
    {
      "time": "3 Mar 2003 — 11:48am",
      "content": "JF, as long as you keep designing these delightful typefaces, we don't mind at all you being self-promotional. ;)   \n   \nCheshire, _Eclat_ is yummy. Reminded me a bit of [an old favourite of mine](http://web.archive.org/web/20131019065435/http:/www.fonts.com/findfonts/detail.asp?pid=205136). Did you design the Impact logo? Kick-\n\n"
    },
    {
      "time": "3 Mar 2003 — 11:52am",
      "content": "Oh, and FF Info too, It has become something of a classic at our place, together with FF Meta. But I fear they're a bit too \"plain\" for what you're looking for: I think you could use a little touch of quirkiness.\n\n"
    },
    {
      "time": "3 Mar 2003 — 2:54pm",
      "content": "I don't know why Emigre fonts mostly leave me cold. I never seem to have projects that Emigre fits nicely, at least in my opinion. I appreciate their craft, but their designs just don't usually speak to me, with the notable exception of Triplex Sans Condensed, but I would never set text in Triplex Sans, so I'm out of luck for this project. Quelle bummer.   \n   \nFF Meta, on the other hand, seems to be gaining interest for me. Info, as HD pointed out, has a softness to it that may ultimately undo it for me, plus that the romans and the italics are in two different sets, as opposed to separated by weight. I don't understand people sometimes.   \n   \nHere's the lowdown on the Impact logo -- I didn't design it so much as redesign it. Originally it was like this:   \n   \n ![impact old](http://web.archive.org/web/20131019065435im_/http:/www.typophile.com/forums/messages/30/7151.jpg)   \n   \nAnd I never really cared for it that much. The old artistic director (as opposed to an art director) made it. So when I came on board, I just wasn't using it on posters, and no one seemed to notice.   \n   \nThen I came up with a different direction:   \n   \n ![impact revision](http://web.archive.org/web/20131019065435im_/http:/www.typophile.com/forums/messages/30/7152.jpg)   \n   \nBut it turned out, they liked their logo and didn't want to go too far afield. (Plus, I'll admit, Bell Gothic is a bit overused these days.) So I fused the two into a solution I can live with:   \n   \n ![impact](http://web.archive.org/web/20131019065435im_/http:/www.typophile.com/forums/messages/30/7153.jpg)   \n   \nI'm mostly happy with it, but it's really hard to use. I'm currently trying to get them to agree to a fundraising idea where we just have t-shirts with the logo without the splat, and people can pay to shoot a paintball gun at their shirt and make their own splats. Could be fun.\n\n"
    },
    {
      "time": "4 Mar 2003 — 12:39am",
      "content": "I love old Letraset Eclat (Doyald Young design) too, but perhaps not a for this theatre?\n\n"
    },
    {
      "time": "5 Mar 2003 — 3:14pm",
      "content": "Cheshire, just came over the transom:   \n   \nthirstype announced some upcoming releases\n\n"
    },
    {
      "time": "5 Mar 2003 — 4:15pm",
      "content": "Thanks, BJ! I'm surprised, actually, by how much I like it -- it has a nice balance of attitude and restraint.The letterforms are different than what I thought I would like, but then, that's why I asked for help from Typophiles.   \n   \nThanks to all for such a wide variety of great suggestions and comments.\n\n"
    },
    {
      "time": "5 Mar 2003 — 11:28pm",
      "content": "I like the section even better. And the pricing is quite fair, I think.\n\n"
    },
    {
      "time": "5 Mar 2003 — 11:44pm",
      "content": "I like Section, too, but Lux has a certain weirdness that I really enjoy (cool ampersand!), even while the face as a whole still feels like a text face -- I think the italics are particularly nice. Plus, Thirstype's release is actually much deeper than what's on Intersection's site: there are four weights, not two, and you can get the whole thing for $49 before the end of the month. It may not be what I ultimately go with for the theater, but it has nice potential, and I'll be glad to have it regardless.\n\n"
    },
    {
      "time": "6 Mar 2003 — 12:12am",
      "content": "To get the Lux Sans package for $49, you have to   \norder it before March 10. You might have to   \nbe a customer...???   \n   \nI'm sure Thirstype won't mind the promotion here...   \n   \nPreview LUX SANS at [http://lux.thirstype.com/luxsans/](http://web.archive.org/web/20131019065435/http:/lux.thirstype.com/luxsans/)   \n   \nbj\n\n"
    },
    {
      "time": "6 Mar 2003 — 12:48am",
      "content": "Am I the only one who cannot download the Font after purchase? The PC-Version doesn't seem to work properly. What the F....\n\n"
    },
    {
      "time": "6 Mar 2003 — 10:03am",
      "content": "HD, elaborate...which font are you talking about.   \n   \nLux Sans isn't available until April Fools Day.\n\n"
    },
    {
      "time": "6 Mar 2003 — 10:49am",
      "content": "Yeah, sorry... I meant LuxSans, and although there was a Download-Link on the SIte, Chester just informed me via eMail that the font will not be available before April 1st and that it will probably be sent to me via eMail.\n\n"
    },
    {
      "time": "6 Mar 2003 — 11:07am",
      "content": "I got the same email from Chester this morning. Can't wait to play with it!\n\n"
    },
    {
      "time": "6 Mar 2003 — 11:48am",
      "content": "Apex looks neat as well, although in the thirstyper I don't get any OSFs, neither in the regular font nor in the SmallCaps version. But there obviously are OSFs, as they are shown in the sample on the splash page...\n\n"
    },
    {
      "time": "6 Mar 2003 — 2:40pm",
      "content": "Re: ApexSans... There are two versions of the roman and italic fonts:   \n   \nT = tabular numerals and currency symbols   \nST = Stanard Text (aka Old Style) figures and proportional currency symbols.   \n   \nAnd there are the C = Caps versions, which have the tabular numerals and currency symbols, except for the '1', which are proportional and cap-height.   \n   \nLuxSans, I believe, just has the one set of numerals.   \n   \nBest,   \nc\n\n"
    },
    {
      "time": "6 Mar 2003 — 2:58pm",
      "content": "hey mr. cheshire dave sir,   \n   \nif your are taking Meta into serious consideration for your project, maybe you might want to be a little patient and await the publication of \"South\" by Peter Bruhn. unfortunately i have no link to post regarding a preview of this lovely humanist sans (yes hrant, we know there is no need for another), but if you perhaps write a friendly mail towards fountain, you might just get what you are searching for!\n\n"
    },
    {
      "time": "27 Feb 2003 — 2:53pm",
      "content": "If you want to be \"alternative\" pick something from [Storm](http://web.archive.org/web/20131019065435/http:/www.myfonts.com/foundry/storm/?refby=typographica).\n\n"
    },
    {
      "time": "27 Feb 2003 — 3:19pm",
      "content": "Gotcha. Ok. How about [FF Zwo](http://web.archive.org/web/20131019065435/http:/www.philsfonts.com/showing.html?sku=FF011353X1P2&start=1)?\n\n"
    },
    {
      "time": "27 Feb 2003 — 4:08pm",
      "content": "Nice posts, HD. BTW, Neufville's [Futura](http://web.archive.org/web/20131019065435/http:/www.neufville.com/FontData/_Funset.htm) also has OSF &   \nsmall caps, but I think they're too extreme.\n\n"
    }
  ]
}
