{
  "id": "104604",
  "title": "Why is FUTURA font created?",
  "forum": "General Discussions",
  "tags": [
    "font",
    "futura",
    "General Discussions",
    "typeface"
  ],
  "content": "Hi,  \nI'm currently studying Futura font.  \nThere's a question my teacher gave me,  \nWhy is Futura created?\n\nI can't seems to find the answer :(  \nAnd also, what do you think of Futura? What feels it gives you?\n\nThanks!\n\n",
  "author": "stephtoh06",
  "time": "14 Jul 2013 — 1:36am",
  "uid": "213074",
  "comments": [
    {
      "time": "14 Jul 2013 — 2:59am",
      "content": "Check the date at which it was created, and look up the way art evolved in that same period. Does that give you a hint?\n\n"
    },
    {
      "time": "14 Jul 2013 — 7:29am",
      "content": "You might look for a copy of Christopher Burke: Paul Renner: the art of typography. Hyphen Press, London 1998.\n\n"
    },
    {
      "time": "14 Jul 2013 — 8:20am",
      "content": "The name contains a hint to its purpose and origins — at the time there was an air of optimism, that after the devastation of World War 1 (the war to end all wars) a better and peaceful society would grow to be.  \nViz: League of Nations, Futurism, Art Deco, disarmament.\n\n"
    },
    {
      "time": "14 Jul 2013 — 11:22am",
      "content": "It was created for Wes Anderson.\n\n"
    },
    {
      "time": "14 Jul 2013 — 12:11pm",
      "content": "HaHaHa! Don't forget Stanley Kubrick!\n\n"
    },
    {
      "time": "14 Jul 2013 — 2:30pm",
      "content": "Futura wants to give me the feeling of Googling it.\n\n"
    },
    {
      "time": "14 Jul 2013 — 5:52pm",
      "content": "Steph the tense in your question is incorrect, it should be \"Why will Futura be created?\"\n\n"
    },
    {
      "time": "14 Jul 2013 — 7:29pm",
      "content": "The previously mentioned book on Renner will answer your question, especially chapter four. If you don't feel like buying the book, email me and I'll get you some info. It's been several years since I read it, but if I remember correctly the creation of Futura had something to do with an alternative to the insistence on the use of blackletter forms by some segments of German society and evolution (for lack of a better word) of that style. It also reminds me of this comment by Wassily Kandinsky: \"Every work of art is the child of its age and, in many cases, the mother of our emotions. It follows that each period of culture produces an art of its own which can never be repeated. Efforts to revive the art-principles of the past will at best produce an art that is still-born. It is impossible for us to live and feel, as did the ancient Greeks. In the same way those who strive to follow the Greek methods in sculpture achieve only a similarity of form, the work remaining soulless for all time. Such imitation is mere aping. Externally the monkey completely resembles a human being; he will sit holding a book in front of his nose, and turn over the pages with a thoughtful aspect, but his actions have for him no real meaning.\"\n\n"
    },
    {
      "time": "14 Jul 2013 — 7:55pm",
      "content": "If you study Paul Renner, who is the creator of Futura, there is a lot of very interesting material both on the web and in books about him. Also research Art Deco and Futurism, and Germany of course.\n\n"
    },
    {
      "time": "14 Jul 2013 — 8:13pm",
      "content": "Regarding the book that was mentioned, if you don't want to buy it another option is to try your public library. If they don't own the book they can do a computer search to find another library that has it and borrow it temporarily by interlibrary loan, although it may take a week or two for it to arrive.\n\n"
    },
    {
      "time": "15 Jul 2013 — 1:06am",
      "content": "@stephtoh06: I feel I may be misunderstanding your question, as the answers seem to be very clearly expressed on [the Wikipedia page for Futura](http://web.archive.org/web/20130817134038/http:/en.wikipedia.org/wiki/Futura_(typeface)). Scroll down to the bottom of the page to see the References, Further Reading, and External links sections at the bottom of the page. Amongst their twenty-five references, there should be ample content to point you in the right direction ( [the first page of Google results](http://web.archive.org/web/20130817134038/http:/bit.ly/11PTcJn) also has some good sources).\n\nAnd if I am misunderstanding your question, perhaps you can elaborate?\n\n"
    },
    {
      "time": "15 Jul 2013 — 6:14pm",
      "content": "When I first saw the question of this thread, I thought it was unanswerable. There is no \"why\" in the sense that someone had a newspaper, and melting rubber rollers were causing the ink to smear (that's why Corona was created).\n\nBut why a font is created doesn't have to be an external cause. The artist could have had an intention in mind when creating it.\n\nMany popular books on typography will give this for Futura: basically, Futura is based on basic geometric shapes, straight lines and circles, and it was intended by the type designer to break with precedent by creating a type face based on such principles. (There were other such faces from that period, such as Kabel - but Kabel and Futura are _very_ different typefaces, even though they share this attribute.)\n\n"
    },
    {
      "time": "15 Jul 2013 — 7:21pm",
      "content": "To reflect the _zeitgeist._ In that respect, I think one can say that Futura was created for the same reason that, say, Baskerville was created: to provide typographic expression of a new visual culture that was not adequately reflected in existing typefaces from earlier periods.\n\n"
    },
    {
      "time": "15 Jul 2013 — 8:26pm",
      "content": "Haha. Classic. I think Wes Anderson certainly thinks it was created for his sole use.\n\n"
    },
    {
      "time": "22 Jul 2013 — 7:02am",
      "content": "Basically it was the zeitgeist of this period after world war 1.\n\nFutura was titled »Schrift unserer Zeit« it means the type of our time. Futura was influenced by the bauhaus and neue sachlichkeit movements based on geometric shapes. Also there where lots of other such faces like Erbar Grotesk oder Kabel. They are all very geometric and share similarities but where still different in detail.\n\n"
    }
  ]
}
