{
  "id": "104756",
  "title": "The First Spiekermann Dictum",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Because we're talking about it on Twitter, I'm curious to see how many of you are aware of the First Spiekermann Dictum? I imagine that anyone who's set more than a few lines of type has come across the phenomena where a descender in a line of type clashes with the ascender in a second line of type.\n\nAs written in Rhyme & Reason: A Typographic Novel, the dictum states the following:\n\n![](http://web.archive.org/web/20150415131702im_/https:/pbs.twimg.com/media/BPeFCsACcAAPa5t.jpg)\n\n![](http://web.archive.org/web/20150415131702im_/https:/pbs.twimg.com/media/BPeEmsJCAAEqR8V.jpg)\n\nAny good stories on your encounters with the First Spiekermann Dictum? What would be your approach when it occurs?\n\n",
  "author": "Jared Benson",
  "time": "18 Jul 2013 — 2:19pm",
  "uid": "3",
  "comments": [
    {
      "time": "18 Jul 2013 — 5:01pm",
      "content": "My approach to these incidents is to rework the two lines so that the two touching elements look as natural as possible, blending together well. My one exception to that is if the touching is quite minimal, then I will rework the two lines so they don't touch.\n\n"
    },
    {
      "time": "18 Jul 2013 — 6:28pm",
      "content": "I'd guess that it's easier to handle this for some languages than others.\n\n"
    },
    {
      "time": "19 Jul 2013 — 2:46am",
      "content": "Small cap it. ;)\n\n"
    },
    {
      "time": "19 Jul 2013 — 5:35am",
      "content": "Sounds to me like a subset of O'Toole's Corollary of Finagle's Law: \"The perversity of the Universe tends towards a maximum.\"\n\n"
    },
    {
      "time": "19 Jul 2013 — 12:20pm",
      "content": "Spiekermann?\n\n"
    },
    {
      "time": "19 Jul 2013 — 3:31pm",
      "content": "Buttered toast?\n\n"
    },
    {
      "time": "19 Jul 2013 — 5:26pm",
      "content": "_Spiekermann?_\n\n ![](http://web.archive.org/web/20150415131702im_/http:/typophile.com/files/speakerman_5202.png)\n\n"
    },
    {
      "time": "19 Jul 2013 — 5:37pm",
      "content": "Your best ever, John!!! Why did I ever doubt you?\n\n"
    },
    {
      "time": "19 Jul 2013 — 9:13pm",
      "content": "Odd. How could that possibly happen, unless the ascenders and descenders were cast as overhanging kerns?\n\nOf course, with phototypesetters, one can specify negative leading, and one can do similar foolish things at one's own risk with computer typesetting... but if that happens by default, it's bad programming.\n\n"
    },
    {
      "time": "20 Jul 2013 — 4:20am",
      "content": "> How could that possibly happen,\n\nSpiekermann’s is a phototypesetting-era dictum.\n\n_«Where two consecutive lines are closely spaced .&nbsp;.&nbsp;.&nbsp;»_\n\n"
    },
    {
      "time": "20 Jul 2013 — 9:25am",
      "content": "I was being slightly sarcastic, but of course even with \"closely spaced\" included, closely spaced should mean zero leading, not negative leading: that is, a phototypesetting system should require you basically to hit the red override button before you can space lines _that_ closely.\n\n"
    },
    {
      "time": "20 Jul 2013 — 10:36am",
      "content": "Look at the illustration. Erik is talking about a particular style of display setting.\n\n"
    },
    {
      "time": "20 Jul 2013 — 11:43am",
      "content": "The telling line is, \"touching is allowed if it looks better\"\n\n"
    },
    {
      "time": "20 Jul 2013 — 12:02pm",
      "content": "The spelling error in ‘exception’ bugs me more than any touching extenders, I have to admit—at least in this particular setting.\n\n"
    },
    {
      "time": "20 Jul 2013 — 1:00pm",
      "content": "@R: Good catch. Everyone was so focused on the touching bits they all missed it, including the proofreader -- and that's assuming they had one.\n\nOr maybe there's a Spiekermann Dictum that covers that?\n\n"
    },
    {
      "time": "20 Jul 2013 — 1:48pm",
      "content": "I think that \"exeption\" was on purpose to make the \"p\" line up with the \"i\" on the next line. That the word exception was the misspelled word further emphasizes that \"exeption\" looks better than \"exception\" would have in the same setting. This is a visual pun of the highest order and I heartily applaud.\n\n"
    },
    {
      "time": "20 Jul 2013 — 6:56pm",
      "content": "[to follow]\n\n"
    },
    {
      "time": "21 Jul 2013 — 3:35am",
      "content": "How would it look with the dot of the \"i in \"this\" removed? Also as a typo (\"thıs\"), or would the \"p\" tail be enough to mimick/obfuscate it?\n\n"
    },
    {
      "time": "21 Jul 2013 — 4:57am",
      "content": "Another thing that could have corrected it and allowed spelling \"exeption\" correctly: simply change \"this\" to \"the\". It would still read right and everything would be fine.\n\n"
    },
    {
      "time": "21 Jul 2013 — 8:20am",
      "content": "Spoken like a true editor :-)  \nThe point of it is the on-purpose misspelling of the particular word \"exception\"\n\n"
    },
    {
      "time": "21 Jul 2013 — 9:36am",
      "content": "<cite>\"exeption\" looks better than \"exception\"</cite>\n\nI think that's wandering into the realms of post-rationalisation. There are better ways to engineer an ascender descender clash than to purposely introduce a spelling error. If it was intentional then that's just sloppy.\n\n"
    },
    {
      "time": "21 Jul 2013 — 10:26am",
      "content": "You are certainly allowed to disagree with my assessment ( I have no idea what was really going through Herr Spiekermann's mind at the time. I really do think you have gone a bit unfairly overboard with the \"sloppy\" comment\n\n"
    },
    {
      "time": "21 Jul 2013 — 11:24am",
      "content": "It's witty!\n\nI'd like to say ... Give him a point and he'll think he's a typographic ruler.\n\nBut I won't 'cuase it's just a poor attempt at any sort of humor.\n\n:)\n\n"
    },
    {
      "time": "21 Jul 2013 — 2:16pm",
      "content": "I'm pretty sure you don't become a typographic luminary by putting aesthetic niceties before correct spelling, but as you say, there's no knowing exactly what the intention is here.\n\nIf we said for the sake of argument that it was an unintentional error, then using the term 'sloppy' is fairly benign isn't it?\n\n"
    },
    {
      "time": "21 Jul 2013 — 2:57pm",
      "content": "_... there's no knowing exactly what the intention is here._\n\nAsk Erik?\n\n"
    },
    {
      "time": "21 Jul 2013 — 7:52pm",
      "content": "I just sent Erik an email.\n\n"
    },
    {
      "time": "21 Jul 2013 — 8:15pm",
      "content": "That book was printed 30 years ago and nobody has seen that mistake until now, for a mistake it is. Paul Stiff and myself worked on this English translation of the German original and we never noticed that typo. Quite exceptional to have escaped an expert audience all these years.\n\nIf I had the German original here I would check how it was handled there, but i remembered that we just set the sentences the way they came and clashes happened, thus the dictum.\n\nThe _Spiekermann Dictum_, however, is to be found on the top of the right-hand page, not that headline setting. It doesn’t apply to text setting where – even without additional leading – most descenders won’t physically touch ascenders below, although they might still look uncomfortably close at times. But if anybody has ever set a headline for a package or some other display purpose where two or more lines have to be close for impact and/or space reasons, they will have come across this phenomenon. In other trades this is simply called “shit happens”.\n\n"
    },
    {
      "time": "21 Jul 2013 — 8:31pm",
      "content": "Thanks, Erik!\n\nI stand corrected.  \nIn the words of the late Emily Lattella, \"Never-mind\" :-)\n\n"
    },
    {
      "time": "21 Jul 2013 — 9:27pm",
      "content": "Actually, _I_ stand corrected.\n\n"
    },
    {
      "time": "22 Jul 2013 — 4:04am",
      "content": "How funny! A misspell by the holly name \"Spiekermann\" was going to be almost sanctified if Herr Spiekermann hadn't stand corrected! There is still, though little, hope as long as children like R. exist who are brave enough to say \"Spiekermann is naked!\".\n\n"
    },
    {
      "time": "22 Jul 2013 — 8:02am",
      "content": "@gezegen:  \nnot sure what you’re implying: I make as many mistakes as the next guy, especially in English, which is not my first language. And I appreciate other people finding them so I won’t die stupid.\n\n"
    },
    {
      "time": "22 Jul 2013 — 10:10am",
      "content": "If I were to have a first dictum, it might be this: the typo will always occur in the short piece of display setting, which no one will think to proofread.\n\n"
    },
    {
      "time": "22 Jul 2013 — 1:44pm",
      "content": "On a similar note, during my undergrad, I was asked to design a title page for a book titled “TRADITIONAL TYPOGRAPY.” My choice of title. My professor and I went through a few rounds of revisions with tissue markups advising me on kerning &c, after which I submitted the final version, for which I received an A+.\n\nIt was only after I got it back that I noticed I had actually misspelled the word TYPOGRAPY. I brought this to my professors attention, who’s first language was also not English, and we both laughed. We were so focused on the kerning we neglected to notice the spelling. I believe the expression is “not seeing the forest through the trees.”\n\nThis is truly a thread for the _books_ — pun intended.\n\n(he let me keep the A+)\n\n"
    },
    {
      "time": "22 Jul 2013 — 1:45pm",
      "content": "And I’d wager that everyone here has a similar story.\n\n"
    },
    {
      "time": "22 Jul 2013 — 2:03pm",
      "content": "Yup. Author who misspelled his own name on the title page. Quite painfully, as he only saw it in the press proofs, so the sheet had to be re-printed.\n\n"
    },
    {
      "time": "22 Jul 2013 — 3:55pm",
      "content": "In more than 45 years of having stuff printed, I have yet to get one piece back from the printers (or finishers) that hasn’t got at least one mistake in it. And I’m not talking about bad line breaks, but major, often embarrassing typos, omissions, wrong fonts, missing illustrations etc. The closer you work with it, the farther it gets from your critical eye. Show me someone else’s work and I’ll spot a typo or similar misdeed immediately.\n\n"
    },
    {
      "time": "22 Jul 2013 — 5:52pm",
      "content": "One of the classics is the Hartley & Marks edition of Gerrit Noordzij's _Letterletter_, on the spine of which his name is spelled Noordzig.\n\nThe one that pains me most is in _Language Culture Type_. I managed to drop a letter from Adam Twardoch's witty chapter title, so it ended up as 'Picked herring...' instead of 'Pickled herring...'. Neither I, nor the editor, nor any proofreader spotted it. Adam, of course, saw it immediately, after the book was printed.\n\nI also recall a misspelling in 100pt type on the cover of a high Anglican service booklet, also missed by numerous people until the church secretary opened the box from the printers and spotted it immediately. In that case the text was running from bottom to top up the side of the cover, and the mistake might have been easier to spot if anyone had bothered to rotate the proofs. I don't remember exactly what the mistake was, but I do remember all the covers being carefully removed and new ones affixed.\n\n"
    },
    {
      "time": "22 Jul 2013 — 7:13pm",
      "content": "John, I just now looked at my copy of the Letterletter book! There it is, plain as dzig! ;-)\n\n"
    },
    {
      "time": "22 Jul 2013 — 8:06pm",
      "content": "> _And I’d wager that everyone here has a similar story._\n\nThis book I designed was published in 1973. It had a misprint right on the title page, in Times New Roman bold. The point size was 72 or 84… No one noticed it. The book sold out in a couple of weeks. ![](http://web.archive.org/web/20150415131702im_/http:/static.ozone.ru/multimedia/books_covers/1005944675.jpg)\n\n"
    },
    {
      "time": "22 Jul 2013 — 10:00pm",
      "content": "As a graduate student I was so excited to learn that an article I wrote would be published in a prominent Dutch journal. My name in print! But when they sent me copies of the issue, I found that my first name was misspelled.\n\n"
    },
    {
      "time": "23 Jul 2013 — 7:58am",
      "content": "I know that I read 'exeption' above as 'exception' without even hesitating.\n\n"
    },
    {
      "time": "23 Jul 2013 — 10:54am",
      "content": "I regularly see publications go to print with random w's scattered everywhere, because of the InDesign shortcut.\n\n"
    },
    {
      "time": "23 Jul 2013 — 11:19am",
      "content": "There are random \"Z\"s around for the same reason ;-)\n\n"
    },
    {
      "time": "23 Jul 2013 — 12:06pm",
      "content": "Is there such thing as a typeface with ligature glyphs designed to replace overlapping ascenders and descenders? That’d be an interesting challenge for an [MA of Typeface Design at Reading University](http://web.archive.org/web/20150415131702/http:/www.reading.ac.uk/typography/pg-taught/typ-pgtmatypefacedesign.aspx) graduate student.\n\n"
    },
    {
      "time": "23 Jul 2013 — 2:48pm",
      "content": "I'm now thinking it would be coolio if there were typefaces (especially Display faces) with ligatures designed for overlapping descenders and ascenders, and overlapping anything else for that matter.\n\nOr perhaps even better ...a script one could use in Adobe products which the user could simply highlight the characters and make it so.\n\n"
    },
    {
      "time": "23 Jul 2013 — 3:18pm",
      "content": "Particularly with swashed script fonts, a certain amount of overlap is expected among the flourishes. Here is an example:\n\n ![](http://web.archive.org/web/20150415131702im_/http:/typophile.com/files/DanubeBall_5096.jpg)\n\n"
    },
    {
      "time": "23 Jul 2013 — 3:39pm",
      "content": "...and of course, \"Jefferson\" is trying to crash into \"Thomas\" just ahead of a \"Symphonic/Jefferson\" pile-up.\n\n"
    },
    {
      "time": "23 Jul 2013 — 4:24pm",
      "content": "It appears to only be a minimal fender-bender though ;-)  \nEmanual, Good thing there was no Bach playing there, otherwise, there may have been a Carl-Phillipp ;-P\n\n ![](http://web.archive.org/web/20150415131702im_/http:/typophile.com/files/Blue-Danube_4662.png)\n\n"
    },
    {
      "time": "23 Jul 2013 — 4:48pm",
      "content": "When Geraldine Banes was at Microsoft, she and I spent many hours discussing inter-line contextual glyph processing (also dynamic spacing around intrusions from adjacent lines, which would be very handy for publishing Sanskrit texts in Tibetan script), but never managed to generate much interest from line layout folks. The computational overhead is high, and hence the impact on performance would be considerable.\n\n"
    },
    {
      "time": "23 Jul 2013 — 8:50pm",
      "content": "Interesting. From the font design side, how would you even get a font to \"know\" there is a line break? Can it be done?\n\n"
    }
  ]
}
