{
  "id": "104786",
  "title": "New Font using Paul Mathis Th Character",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "There's been much discussion in the UK press about the new Th symbol proposed by Australian inventor Paul Mathis as a substitute for the definite article (the). I've included a glyph for this in my latest font - Dynatron - just released on MyFonts. I've also included a version - Dynatron Mathis - which allows users to access the Th symbol in one stroke using the seldom used grave symbol (`) on the top left hand of the standard American and British keyboards. What do you guys think? I'm aware that Dynatron is basically a display face, and the utility of the Th symbol is mainly for texting etc., but you've got to start somewhere!\n\n| Attachment | Size |\n| --- | --- |\n| [Quick Brown Fox.png](http://web.archive.org/web/20150414014418/http:/typophile.com/files/Quick%20Brown%20Fox.png) | 345.97 KB |\n\n",
  "author": "Keith Tricker",
  "time": "19 Jul 2013 — 3:01pm",
  "uid": "213248",
  "comments": [
    {
      "time": "19 Jul 2013 — 4:05pm",
      "content": "It’s ill-informed nonsense.  \nIf you want a keyboard shortcut for “the”, mis-using an existing Unicode point, why not have the glyph actually look like “the”? That would make more sense!  \nHaven’t studied this closely—is it cased?\n\n"
    },
    {
      "time": "19 Jul 2013 — 9:17pm",
      "content": "The first rule of trying to change the English language is don't be obviously expecting to make money off \"your idea\", especially by patenting it. The amount of capital he's pouring into it belies delusional expectations of a return. Nobody's going to buy the app he's developing. If this gains some small following on Twitter, it will only be because Cyrillic Ћ is available.\n\n"
    },
    {
      "time": "20 Jul 2013 — 4:32am",
      "content": "I hope you got a share of the $75,000 for implementing the symbol in your font ;)\n\n"
    },
    {
      "time": "20 Jul 2013 — 1:07pm",
      "content": "Hey Guys, this is all a bit hostile and cynical. As typographers I would have thought you'd have taken a more generous view of what could be an exciting new development. Ho hum.  \nTo answer a couple of your points: the Dynatron Mathis font is an alternative cut, so those who feel strongly about the misappropriation of the grave symbol have got it in the original version (and be honest, who with an American / British keyboard uses it more than once in a blue moon?). Nick Shinn says why not make the 'mis-used' glyph actually look like 'the'? Ok, then why not make the ampersand glyph look like 'and'? Your other objections seem to me to be more personal (against Paul Mathis) than professional.\n\n"
    },
    {
      "time": "21 Jul 2013 — 10:06am",
      "content": "> As typographers ...\n\nBut type designers are only a small subset of \"typographers.\"  \nThough usually not \"typographers,\" readers count most. As guardians of the language (for use beyond twitter), they pretty much rely on editors -- also usually not \"typographers.\"\n\nMost of us, when we were kids in school, tried to come up with a new word & get it adopted by other \"us\" folk. For me & a couple others, that word was \"roquert,\" as in \"that's so roquert.\" As you can see, it didn't catch on...\n\n"
    },
    {
      "time": "21 Jul 2013 — 12:46pm",
      "content": "OK Charles, if you want to chop logic, fine. I'm not suggesting that type designers or typographers are guardians of the language, although in this instance we do have an opportunity to influence it in, I believe, a useful way. Whether or not it is taken up in popular usage remains to be seen, but let's not stomp it to death between ourselves. Has no-one got anything positive to say about the Th symbol?\n\n"
    },
    {
      "time": "21 Jul 2013 — 2:31pm",
      "content": "About half the publishers I work for refuse to allow the Th ligature in a number of fonts. That's an design decision (aesthetic) that varies from font to font. Most editors won't allow the ampersand at all, unless it is part of a name, like AT&T or Texas A&M. Personally, I do use the ampersand a fair bit in email & internet posts & other informal communications.\n\nBut: the ampersand has both a long history and a Unicode assignment. It 's use doesn't require mis-encoding. Until Unicode acknowledges a new symbolic abbreviation, no, nothing good to say.\n\n"
    },
    {
      "time": "21 Jul 2013 — 3:22pm",
      "content": "I don't understand all the fuss this has generated; why take it seriously? For the sake of saving one letter? It's hardly a time saver. Am I missing sthg? I've nothing positive to say, I find it ridiculous.\n\n"
    },
    {
      "time": "21 Jul 2013 — 3:45pm",
      "content": "And if and when Unicode does acknowledge it, Charles?\n\n"
    },
    {
      "time": "22 Jul 2013 — 7:51am",
      "content": "I þink þere's little need for Mathis' Th.\n\n"
    },
    {
      "time": "22 Jul 2013 — 1:18pm",
      "content": "And ðat's what I think, too.\n\nBTW -- from Wikipedia:\n\n> In Old English, ð (referred to as ðæt by the Anglo-Saxons) was used interchangeably with þ (thorn) to represent either voiced or voiceless dental fricatives. The letter ð was used throughout the Anglo-Saxon era, but gradually fell out of use in Middle English, practically disappearing altogether by 1300;[4] þ survived longer, ultimately being replaced by the modern digraph th.\n\nAnother source notes scribes would use one or the other, depending on whim, within a single text (in English). It's amazing how careful current scholars are to preserve just which was used where in a document.\n\nAs for me, I'll probably never use this yet-another-Th symbol, even if it's allowed into Unicode. But I'm a old guy, if the consortium encodes it, I won't squwak.\n\n"
    },
    {
      "time": "22 Jul 2013 — 2:42pm",
      "content": "With the editor [vi](http://web.archive.org/web/20150414014418/http:/en.wikipedia.org/wiki/Vi), that I have been using since the eighties, you can map the character ` to the four letters \"the \" (why type the space? that is crazy) as follows: you type\n\n    :map! ` the <CR>\n\nin command mode, where you type a carriage return in place of \\<CR\\>. Then each time you type ` while in input mode, you get \"the\" with a space in your text. Mapping keys that way proved very handy in the old days to input French accented letters for troff without having to type the long list of required control characters.\n\nOne should not conflate input methods and character sets.\n\n"
    },
    {
      "time": "22 Jul 2013 — 3:22pm",
      "content": "But Michael, he's talking about much more than an input method. Look at the attachment & that thorny new character. It'd make a maiden blush...\n\n"
    },
    {
      "time": "22 Jul 2013 — 9:03pm",
      "content": "_Dynatron is basically a display face, and the utility of the Th symbol is mainly for texting…_\n\nIn that case, your design falls short on functionality.  \nYour face is U&lc, so why is this character not cased?  \nAt the moment, it looks like titlecase, not all-caps or U&lc.  \nSo it doesn’t work in either of those situations.  \nWhy not create a lower case version?  \nLogically, it would look like this:\n\n ![](http://web.archive.org/web/20150414014418im_/http:/typophile.com/files/dynatron_5552.jpg)\n  \nOr if you decide that the same shape should be used for majuscule and minuscule, at least adjust the weight accordingly. \n"
    },
    {
      "time": "22 Jul 2013 — 9:58pm",
      "content": "_There's been much discussion in the UK press about the new Th symbol..._\n\nSummer is traditionally known among UK journalists as 'the silly season'. Parliament is in recess, it's too hot to do anything productive, so they publish the silly news off the wire. The only remotely interesting thing about the Mathis story is that he's reportedly sunk so much money into this folly. That's seriously roquert!\n\nFrom a technical and typographic perspective, there is no story, other than that of a man who hasn't realised that the relationship of keystrokes to characters to glyphs is _n_ to _n_ to _n_, and hence his 'invention' doesn't solve any problem that actually exists.\n\n"
    },
    {
      "time": "23 Jul 2013 — 3:32am",
      "content": "Aside: In Icelandic, ð is a voiced 'th' and þ is a voiceless one.\n\n"
    },
    {
      "time": "23 Jul 2013 — 5:07am",
      "content": "When I was in college, I had a girlfriend who used to abbreviate the days of the week like this:\n\n ![](http://web.archive.org/web/20150414014418im_/http:/typophile.com/files/Theta_5008.jpg)\n  \nShe used the theta to differentiate between Tuesday and Thursday. (No, I don't remember why she didn't use a sigma to differentiate between Saturday and Sunday. It was a long time ago.) \n\nSince there has been a familiar glyph for the _th_ sound for thousands of years, I wonder why it was necessary to invent a new one (other than the possibility of making some money by doing so).\n\n"
    },
    {
      "time": "23 Jul 2013 — 11:59am",
      "content": "Here is something for the \"silly season\".\n\nAbove I said what could be done 30 years ago. Today many tools can serve but here is something for OS X 10.8 with a touch and feel you can't beat :)\n\nDownload the [SIL Ukelele Mac OS X Keyboard Layout Editor](http://web.archive.org/web/20150414014418/http:/www-01.sil.org/computing/catalog/show_software.asp?id=94) (and copy in the Applications folder). Then start Ukelele (on OS X 10.8 you may need to control click the application to bypass a security check), then click `File > New From Current Input Source`; you will see your normal keyboard appear. Then double click on ` (or another key that you seldom use) and write \"the \" (without quotes) in the little box that appears and click OK.\n\n![](http://web.archive.org/web/20150414014418im_/http:/typophile.com/files/enter-string_5818.png)\n\nYou will now see the modified keyboard; here is what I get from my US Extended layout.\n\n![](http://web.archive.org/web/20150414014418im_/http:/typophile.com/files/newlayout_3438.png)\n\nThen click ` Keyboard > Set Keyboard Name..` and choose the name that will show in the keyboard menu, for instance \"Personal\". If you want your keyboard to be unicode, select `Keyboard > Set Keyboard ID...` and choose Unicode. Then `File > Save As...`; I choose `Personal.keylayout` and I save it on the Desktop.\n\nThe file needs to be moved to the \"Keyboard Layouts\" folder in your \"Library\" but on OS X 10.8, it won't show up as it used to. Instead, open the `Terminal` application (in `Applications folder/Utilities`) and then paste the following three lines into the terminal window (instead of typing; you can paste the three lines together):\n\n    cd ${HOME}/Library/'Keyboard Layouts'\n    open .\n    mv ${HOME}/Desktop/Personal.keylayout .\n\nIf you see this appear, everything is fine so far\n\n![](http://web.archive.org/web/20150414014418im_/http:/typophile.com/files/layouts-folder_6366.png)\n\nIf not, make sure `Personal.keylayout` is on the desktop and try again. (The same recipe works on 10.7, 10.6 etc but it was easier by then). In fact, once that folder is open, you can also just drag your layout there.\n\nYou now log out and log in, then in `System Preferences` you double click `Language & Text > Input Sources`; you will see a list of keyboards appear. I assume you have the box for Australian checked, then maybe also that for US. Extended (or US international - PC) and you now also check the box for Personal, your new keyboard.\n\n![](http://web.archive.org/web/20150414014418im_/http:/typophile.com/files/input-sources_4809.png)\n\nYou also check `Show Input menu in menu bar` at the bottom and you should now see the keyboard menu at in the top right corner of your screen. If I select it, here is what I see.\n\n![](http://web.archive.org/web/20150414014418im_/http:/typophile.com/files/keyboards-menu_6290.png)\n\nI can now select any of those keyboards at my will. When the Personal keyboard is selected, every time I type a backquote, I get \"the \". You can also select \"Show Keyboard Viewer\" and see this appear:\n\n![](http://web.archive.org/web/20150414014418im_/http:/typophile.com/files/keyboard-view_5965.png)\n\nand show it to your friends. You can also switch from one keyboard to the other by typing \"command space\".\n\nSuch keyboard layouts are handy if you frequently need special characters for edition (or to provide input to the kerning window of some font editing program) and you don't want to copy paste all the time from a cheat sheet; this also shows that there is not a one to one relationship between key hits and characters; usually things are the other way around though; so called dead keys are used to get one unicode character from many keystrokes; for instance to input the single character é (eacute, `U+00E9`) to your text file using the US Extended keyboard, you need to type first \"alt e\" and then \"e\". Designing such a keyboard layout with Ukelele is more tricky.\n\n"
    },
    {
      "time": "23 Jul 2013 — 12:09pm",
      "content": "A nicely detailed demonstration, as usual, Michel. Suffice for me to say that pretty much identically the same process can be followed on Windows using Microsoft's [Keyboard Layout Creator tool](http://web.archive.org/web/20150414014418/http:/msdn.microsoft.com/en-ca/goglobal/bb964665.aspx).  \n\\_\\_\\_\\_\n\nKieth wrote: _As typographers I would have thought you'd have taken a more generous view of what could be an exciting new development._\n\nHave you considered that some of us have enough experience and technical knowledge to immediately recognise when something is _not_ going to be an exciting new development.\n\n"
    },
    {
      "time": "23 Jul 2013 — 11:51pm",
      "content": "John, type designers are not the arbiters of what is going to be a new development - its a question of necessity being the mother of invention (although you're perfectly entitled to decide its not necessary in your case).\n\nNick Shinn wrote: 'Is it cased?'\n\nActually I did give quite some thought to a lower case version of Th, and worked up several designs not dissimilar to the one Nick has kindly mocked up. On reflection I decided that if the ampersand can stand alone so can the Th symbol. Besides it would have necessitated nobbling another Unicode point, which would no doubt have you throwing your hands up in horror!\n\n'In your case the design falls short on functionality'\n\nTrue, it's a display face and not best suited to texting. I first learnt about Paul Mathis' proposals when I was completing the design of Dynatron, and thought it would be an idea to include the Th glyph, little suspecting that the wrath of the gods would fall on me for doing so! I had in mind to work on a text version, but judging by the hostility to Dynatron Mathis I'm beginning to think again.\n\nPublishingMojo writes: 'Since there has been a familiar glyph for the th sound for thousands of years, I wonder why it was necessary to invent a new one (other than the possibility of making some money by doing so)'.\n\nThe point is not that the glyph may already exist but that it is generally adopted as a substitute for 'the' in written English and in an ideal world assigned its own place on the keyboard. As to making money, why is everyone so sniffy about it? Don't we all hope to make a modest income from our typographical efforts?\n\n"
    },
    {
      "time": "24 Jul 2013 — 7:34am",
      "content": "> A nicely detailed demonstration, as usual, Michel.\n\nThanks. For my the \"how\" and the \"why\" are always quite important.\n\n"
    },
    {
      "time": "24 Jul 2013 — 9:04am",
      "content": "_…if the ampersand can stand alone…_\n\nHowever, it is generally used in titles, not running text—for obvious reasons.  \nEven in the American titlecase style of headline, words such as “the” and “and” are not given titlecase treatment.  \nSo in display the thingy really only works at the beginning of sentences, or in all cap settings.\n\nWe could digress into a discussion of “Ye Olde…”\n\n"
    },
    {
      "time": "24 Jul 2013 — 12:17pm",
      "content": "Keith, I never claimed to be an arbiter of anything. I claimed to have enough experience and technical knowledge to be able to _recognise_ a damp squib.\n\n"
    },
    {
      "time": "24 Jul 2013 — 1:53pm",
      "content": "OK John, next time I'll be sure to consult with you earlier.\n\n"
    },
    {
      "time": "30 Jul 2013 — 10:44pm",
      "content": "There should be a feature in word processing that 'the' will get replaced by Mathis 'Th'.\n\nIn Indian scripts, we commonly see that, 2 letter combination become one. Example, द+ ्+ म= द्म or क+ ्+ ष= क्ष or द+ ्+ ध= द्ध  \nThese conjuncts are these in Indian scripts from the beginning.\n\n"
    },
    {
      "time": "31 Jul 2013 — 12:32am",
      "content": "\"Your other objections seem to me to be more personal (against Paul Mathis) than professional.\"\n\nMy objections are that it's silly to come up with a whole new glyph when, as several people have already pointed out, there are already several \"th\" glyphs. I don't know who Paul Mathis is but he obviously doesn't know anything about typography.\n\nNot even going to touch your ampersand comment as it just oozes ignorance.\n\n"
    },
    {
      "time": "1 Aug 2013 — 10:38am",
      "content": "And as I have already responded to this objection (see my response to PublishingMojo above) I'm not going to repeat myself - I suggest you read the correspondence before you reply to it. Nick Shin responded to my ampersand comment without getting personal. If you have nothing to add but abuse I suggest you stay out of the conversation.\n\n"
    },
    {
      "time": "1 Aug 2013 — 3:34pm",
      "content": "Sorry, in my haste to respond to thetophus I almost forgot to thank sarang for his/her positive endorsement of the Th symbol for use in word processing. At last, someone with an open mind!\n\nLooking back on this strand it seems to me that very few have addressed the utility of the Th symbol as an idea. Most have focussed on such technicalities as the fact that it already exists as a glyph (in Old Norse or what-have-you) and thus doesn't need to be included in a Latin character set (which rather misses the point). Others have deliberated over whether or not it will or will not be officially adopted as a Unicode point (God forbid we should transgress there!) Michel Boyer showed us how you could customize your own keyboard. (Useful stuff Michel, but to be honest perhaps a little beyond the scope of the average punter). And still others have criticized my implementation of the character in Dynatron Mathis.\n\nFair enough, I don't pretend to be an expert, or even very clever. I'm open to constructive criticism (as opposed to snide side-swipes). That was the reason I opened this discussion on Typophile in the first place.\n\nIf I were to meet all your technical objections - produce a text font with an upper and lower case Th symbol (and Unicode and PC manufacturers could be persuaded to assign it a 'legitimate' place on the keyboard), what then would be your objection to the Th symbol? Why wouldn't you use it?\n\nMerely to claim that you instinctively know that it is a 'damp squib' is an unsupported opinion, and if you ask me, a pretty arrogant one too.\n\n"
    },
    {
      "time": "1 Aug 2013 — 5:26pm",
      "content": "I get that you're excited about this idea, I do, but you're essentially asking society and industry to adopt something they might not even like. I think using \"ur\" instead of \"you're\" is a really dumb idea but people do it no matter how many others yell and scream at them to stop doing it. It's not up to you whether it gets used, and if you keep taking things personally you're going to end up a quivering ball of goo on your couch. I don't have anything personal against you, but I am not afraid to call out bullshit when I see it and do genuinely feel that this idea is bullshit. If that hurts you, I don't know what to say except you seem like a nice guy. Sometimes you have to kill your darlings, to use the literary parlance.\n\n"
    },
    {
      "time": "1 Aug 2013 — 5:31pm",
      "content": "> Merely to claim that you instinctively know that it is a 'damp squib' is an unsupported opinion, and if you ask me, a pretty arrogant one too.\n\nNope, didn't ask.\n\nOdd notion, though. A \"squib\" is a light load, usually because of a mistake, and when fired, fails to affect the target. If it's wet, it just won't fire at all, but then, when wet, neither will a regular load. \"Damp\" is an interesting modifier here. Does it mean the load \\*may\\* (or may not) fire, but even if it does, it won't hit the target?\n\nPersonally, I take great pains with my loading, and haven't had a squib in over 25 years.\n\n"
    },
    {
      "time": "1 Aug 2013 — 6:53pm",
      "content": "> Useful stuff Michel, but to be honest perhaps a little beyond the scope of the average punter\n\nAssuming Mathis' character gets a unicode point, in order to use it, a corresponding keyboard layout will be needed. It is not the average user that programs such things anyway.\n\nWhat happens is that, with a font that would implement the full word \"the\" as a ligature (with glyph Ћ), a user could not tell the difference between Mathis' new keyboard and Mathis' unicode Ћ glyph and my keyboard with my font with the \"the\" Ћ ligature. He would type the same way, and see the same thing on screen. Notice that the composite glyphs in indian scripts that were mentioned above are implemented as ligatures. In a utf-8 file, the word \"the\" takes 3 bytes. A new unicode codepoint would take at least two bytes, if not three (combining diacritics take three bytes for instance). With file compression, I see no gain there either.\n\nBy the way, writing the 'clig' table to get a ligature for \"the\" but not with \"bathe\" or \"therefore\" is an amusing exercise. And, as a reward, you can read texts with lots of \"the\" and see them display as Ћ.\n\n"
    },
    {
      "time": "1 Aug 2013 — 6:59pm",
      "content": "@Keith Tricker: Am I understanding this correctly in that it’s meant to replace “The” and not just “Th”?\n\n"
    },
    {
      "time": "1 Aug 2013 — 7:58pm",
      "content": "Chris, just have a closer look at the picture he provided\n\n![](http://web.archive.org/web/20150414014418im_/http:/typophile.com/files/Quick%20Brown%20Fox.png)\n\nSee how \"Mathis\" and \"27th\" are written. And if you have any doubt left, watch the video [http://youtu.be/SziRnZcp6Eg](http://web.archive.org/web/20150414014418/http:/youtu.be/SziRnZcp6Eg \"http://youtu.be/SziRnZcp6Eg\")\n\n"
    },
    {
      "time": "2 Aug 2013 — 7:06am",
      "content": "Yeah well, Thetophus, you might take it personally if everyone ganged up on you 20 or 30 to 1. As to your opinion, I happen to disagree with it but as an advocate of free speech I defend to the death your right to say it, as somebody or other once said. Thank you Michel Boyer for you kind intervention and both you and Nick Shin for your patient tutorials (and I'm not being ironic this time, honest!)\n\n"
    },
    {
      "time": "2 Aug 2013 — 8:30am",
      "content": "Keith, my name should be spelled “Shim” (Note the special space-saving double-n ligature).\n\n"
    },
    {
      "time": "2 Aug 2013 — 11:59am",
      "content": "\\> If I were to meet all your technical objections - produce a text font with an upper and lower case Th symbol (and Unicode and PC manufacturers could be persuaded to assign it a 'legitimate' place on the keyboard), what then would be your objection to the Th symbol? Why wouldn't you use it?\n\nWhat exactly is “the” keyboard? This is a question for OS vendors more than PC vendors.\n\nBut without rat-holing on such details, if these parenthesized events were to happen, and the standard US and UK/international-English keyboards for Windows and Mac OS issued by Microsoft and Apple gained direct support for this as a character, it would probably be reflective of general public demand for the thing. So sure, I would support it. But then, I tend to make fonts with 300-3000 glyphs. As it is visually identical to the Serbian cyrillic letter Tshe, those of us who make Latin+Cyrillic typefaces would have no extra work.\n\nHowever, I think you have the cart before the horse. Unless it achieves widespread usage somewhere, by some mechanism, the OS vendors would never go to the trouble of supporting it. The last time a big shift like this happened on English-language fonts and keyboards was for the euro symbol in the late 1990s. Somehow this does not seem quite as strong a motivating force.\n\nBTW, Keith, you're the one being overly dismissive—of other people’s reactions if they are anything other than enthusiastic support. Anybody who thinks is is not a great idea does not have “an open mind”? That’s not going to win friends and influence people.\n\nBTW, the eth and thorn are not from “Old Norse” but in fact from Old English. Our language had not one but two letters in this area before. They are still in most fonts today because of their continued survival in Icelandic. One could just use one of those letters and you’d have just about all existing retail fonts supporting it right off the bat. I expect you would object to that because you want it to look more like a combo of T and h (or t and h), correct? It might help if you actually responded to this question.\n\n\\> The point is not that the glyph may already exist but that it is generally adopted as a substitute for 'the' in written English and in an ideal world assigned its own place on the keyboard.\n\nWell, character, not glyph—and the implementation affects things like what it looks like.\n\n\\> As to making money, why is everyone so sniffy about it? Don't we all hope to make a modest income from our typographical efforts?\n\nI don't mind if he wants to make money on a helpful app. If the symbol were trademarked, that would be a problem.\n\nThe new symbol would need a name (like “ampersand” instead of “and”). Calling it “the” is ambiguous.\n\n"
    },
    {
      "time": "2 Aug 2013 — 1:09pm",
      "content": "OK Shim, duly noted, you have a wiming way about you.\n\nAh heck, I'm getting bored with all this. Did anyone - I really shouldn't ask this in view of the foregoing - did anyone actually like the typeface, Dynatron, in it's own right?\n\n"
    },
    {
      "time": "2 Aug 2013 — 2:33pm",
      "content": "Personally, no. Just not my style. But then I'm not designing anything. I do think it would look good on posters or LP covers, somewhere where it has space to spread.\n\n"
    },
    {
      "time": "2 Aug 2013 — 2:44pm",
      "content": "Sorry, Thomas Phinney, you raise some valid points. I'll do my best to answer them:\n\n\"Unless it achieves widespread usage somewhere, by some mechanism, the OS vendors would never go to the trouble of supporting it\"\n\nOK, you may be right, but isn't it a bit of a chicken and egg situation? There is, I believe, a demand for this development and, if it were recognised and implemented it would be taken up. What has to happen before the technology leads? Mass rioting in the streets? When Apple mooted the idea of the iPad everyone thought it would be a dead duck. Now no-one can do without one!\n\n\"you're the one being overly dismissive—of other people’s reactions if they are anything other than enthusiastic support. Anybody who thinks is is not a great idea does not have “an open mind”? \"\n\nNot at all. But I've yet to hear a great argument against the adoption of Th. What's not to like?\n\n\"One could just use one of those letters and you’d have just about all existing retail fonts supporting it right off the bat. I expect you would object to that because you want it to look more like a combo of T and h (or t and h), correct? It might help if you actually responded to this question\".\n\nYes, I would like it to look more like a combo of T and h (or t and h), mainly because the eth and thorn characters would be alien to most English users.\n\n"
    },
    {
      "time": "2 Aug 2013 — 3:15pm",
      "content": "Thanks Te Rowan - a qualified endorsement! My stock is rising!\n\n"
    },
    {
      "time": "2 Aug 2013 — 4:26pm",
      "content": "@Keith Tricker: As a Th ligature, I quite like the character. Why did you decide to omit any visual reference to the presence of an e? As “The,” it bears such a close visual relationship to “Th” that extending it to “The” is a difficult leap in that it requires your thinking to go from a very literal interpretation, to that one is more abstract. It’s as though I am being lead down a certain path which I understand, and am then asked to radically change directions in an unexpected way (if that makes any sense). If there were a visual cue to the presence of an “e,” I think people would get it instantly. You could also argue the opposite, that if the entire character were more of an abstraction, you may not have competing modes of interpretation.\n\nI might also recommend a video that takes itself more seriously. The first time I watched it wasn’t sure if it was a spoof of not.\n\n"
    },
    {
      "time": "2 Aug 2013 — 9:28pm",
      "content": "_…did anyone actually like the typeface, Dynatron, in its own right?_\n\nAre you asking for a critique?\n\n"
    },
    {
      "time": "3 Aug 2013 — 7:29am",
      "content": "Chis - not quite sure if your comment is a spoof or not. I rather agree with you about the video, which is not mine but the work of Paul Mathis. I'm just taking up the cudgels for his invention.\n\nOK Nick, go ahead. I'm pretty much dished already - might as well go for the coup de grace!\n\n"
    },
    {
      "time": "3 Aug 2013 — 7:48am",
      "content": "I think the typeface on it's own is great. It's not something that I would use often, but it has its place.\n\n"
    },
    {
      "time": "3 Aug 2013 — 2:36pm",
      "content": "Thank you Thetophus, coming from you that's high praise!\n\n"
    },
    {
      "time": "5 Aug 2013 — 7:50am",
      "content": "Keith,  \nI think your font is really nice. It would be perfect for a 50's Sci-Fi poster :)\n\n"
    },
    {
      "time": "6 Aug 2013 — 1:01am",
      "content": "Thanks Charles. I take it you've seen the graphic that accompanies Dynatron on MyFonts? See attached. If not, that really is amazing!\n\n ![](http://web.archive.org/web/20150414014418im_/http:/typophile.com/files/Amazing%20Stories_6607.jpg)\n\n"
    },
    {
      "time": "6 Aug 2013 — 2:12pm",
      "content": "I ﬁnd the design a bit stiff.\n\nThe premise is never going to work precisely and evenly, due to the conﬂict between the tapering effect and the shape of letters.  \n/c and /r, for instance, look like they’re falling to the left, whilst symmetrical characters don’t.\n\nVal Fullard’s [Science](http://web.archive.org/web/20150414014418/http:/www.identifont.com/similar?5IL) is more successful in this genre, IMO, as its casual slant both helps to disguise the problem, and captures the zany futuristic feel of pulp sci-ﬁ/1950s furniture with which I associate this grandiose and overbearing look.\n\n ![](http://web.archive.org/web/20150414014418im_/http:/typophile.com/files/books_startling_6447.jpg)\n\n"
    },
    {
      "time": "7 Aug 2013 — 12:58am",
      "content": "Thanks for your thoughts Nick. I agree that some compromise is probably inevitable within these parameters, it's in the nature of the beast. As to the whole 50s kitsch thing, I guess it's a matter of taste. As you can see, I'm something of an aficionado.\n\n"
    },
    {
      "time": "7 Aug 2013 — 6:44am",
      "content": "Sorry Kieth, I had not seen it. Thanks for posting the picture. Looks cool!!\n\n"
    }
  ]
}
