{
  "id": "10470",
  "title": "I'm having some font trouble",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi there... I'm pretty new to font creation / fontographer. That being said I have a little question for all you old pros.   \n   \nI'm having trouble having the inner cut-outs of certain letters (R, g, P.   \n   \nEverything looks like it should be working properly in fontographer as you can see in these following images   \n   \n ![fontographer image 01](http://web.archive.org/web/20080404180149im_/http:/www.typophile.com/forums/clipart/your_image.gif)   \n   \n ![fontographer image 02](http://web.archive.org/web/20080404180149im_/http:/www.typophile.com/forums/clipart/your_image.gif)   \n   \nBut when I generate the font files some of those letters get all filled in.. as you can see in this screenshot from Fontbook   \n   \n ![fontbook image 01](http://web.archive.org/web/20080404180149im_/http:/www.typophile.com/forums/clipart/your_image.gif)   \n   \nNot really sure what I'm doing wrong and having trouble finding much documentation online.   \n   \nThanks in advance for the help!\n\n [‹ Advice for Gotcha logo](http://web.archive.org/web/20080404180149/http:/www.typophile.com/node/10429 \"Go to previous forum topic\") [Ice cream retail graphics ›](http://web.archive.org/web/20080404180149/http:/www.typophile.com/node/10425 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080404180149/http://www.typophile.com/user/4596\" title=\"View user profile.\">tactikal</a>",
  "time": "<br>",
  "uid": "4596",
  "comments": [
    {
      "time": " 21.Apr.2005 4.55am",
      "content": "Tyler, a few things, first you images aren't showing it could be a number of reasons like CMYK instead of RGB (have to be RGB), BMP files don't show up use Gif or Jpg. When you post on this site it will give you an error message. That is this sites way of saying your post went through. To test it go back one screen when you get an error message then scroll up to topics and go to design and you will see your name as the last person to post.\n\n"
    },
    {
      "time": " 21.Apr.2005 6.23am",
      "content": "I'm guessing at direction of the beziers in Fontographer, there is an option to correct them. Unfortunately I don't have Fontographer at work so I can't give you details. Try posting the query in the Build section if this doesn't help.\n\n"
    },
    {
      "time": " 21.Apr.2005 6.48am",
      "content": "IIRC, you need to 'correct direction' of the path.   \n   \nAlso, as you've probably discovered, ignore this forums routine page load errors.\n\n"
    }
  ]
}
