{
  "id": "104772",
  "title": "Why are quotation marks language-dependent?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "This is such a basic question that it feels a little silly to ask (please do direct me to sources where it has been answered before): I’m wondering how it comes that type and placement of quotation marks vary so much between languages and countries. With a few little exceptions (dashes, potentially ellipses, and such), we don’t see this kind of crazy diversity with other punctuation (speaking within Latin here). So why quotes?\n\n",
  "author": "nina",
  "time": "19 Jul 2013 — 4:50am",
  "uid": "13487",
  "comments": [
    {
      "time": "19 Jul 2013 — 5:10am",
      "content": "If I’m not mistaken, marks for indicating quotation were fairly late to develop or formalize (sometime in the seventeenth century, I believe), much later than the period, comma, semicolon, colon, question mark, et al.\n\nSo, I would guess that the lack of a single standardized convention prior to the spread of printing would have left open the opportunity for different national centers of printing to adapt and evolve different conventions.\n\n"
    },
    {
      "time": "20 Jul 2013 — 3:16pm",
      "content": "Good question.\n\nKent: Makes sense, but on the other hand when a culture addresses a failing late, it's more likely to copy another culture's solution, because the more recent it is the more likely a culture is exposed to others. For example Armenian's use of guillemets comes from the French. And it's not too late for English to switch from those dysfunctional floating comma thingies... :-) In fact one of my articles in Codex #3 uses guillemets; it's also part of Armenotype.com's house style.\n\nhhp\n\n"
    },
    {
      "time": "19 Jul 2013 — 8:58am",
      "content": "Aah, Kent, that makes a lot of sense.  \nAnd then it’s no contradiction that similarities in execution might also show trails of influence between countries… for example I’ve always found it interesting that the Swiss use of guillemets (outward-facing but flush, like «this») is right in the middle between the »German« and the « French » way, suggesting influences from both sides, which of course makes sense.\n\n"
    },
    {
      "time": "19 Jul 2013 — 9:27am",
      "content": "Rockwell Kent wrote, designed, and illustrated _N by E_, published in Chicago in 1929.\n\nThe typeface he chose was Fournier, a French face, and I would imagine that there was some discussion about its foreign quote marks—but in the end they decided they really must use that typeface—guillemets included—and it would have been too much trouble to change to an English font every time quote marks were called for.\n\nGiven that most of the narrative occurs at sea or in Greenland, the offshore quality of the quote marks is appropriate.\n\n ![](http://web.archive.org/web/20150415081109im_/http:/typophile.com/files/NXNW_6527.png)\n\n"
    },
    {
      "time": "19 Jul 2013 — 9:28am",
      "content": "I call those quotemets: [http://typophile.com/node/20061#comment-124405](http://web.archive.org/web/20150415081109/http:/typophile.com/node/20061#comment-124405 \"http://typophile.com/node/20061#comment-124405\")  \nAnd I love them.\n\nhhp\n\n"
    },
    {
      "time": "19 Jul 2013 — 11:31am",
      "content": "Here are guillemets from a book on Raphael Sanzio published in Lille, in 1862, and that have a rounder shape:\n\n![](http://web.archive.org/web/20150415081109im_/http:/typophile.com/files/roundguillemets_4647.png)\n\nI find the same guillemets in Morceaux choisis de Victor Hugo, Poésie, 9ieme édition, Paris, Librairie Ch. Delagrave, circa 1915.\n\n"
    },
    {
      "time": "19 Jul 2013 — 12:10pm",
      "content": "Here’s a close-up of the Fournier quotemets.  \nApparently they are the same roman and italic.\n\n ![](http://web.archive.org/web/20150415081109im_/http:/typophile.com/files/NbyW_CU_6064.png)\n\n"
    },
    {
      "time": "19 Jul 2013 — 12:39pm",
      "content": "Ah, they're more angular than they seemed in the low-res version... Just don't ask me to concoct a term for something between guillemets and quotemets! :-)\n\nBTW what's the year on that font?\n\nhhp\n\n"
    },
    {
      "time": "20 Jul 2013 — 5:07am",
      "content": "> Makes sense, but on the other hand when a culture addresses a failing late, it's more likely to copy another culture's solution, because the more recent it is the more likely a culture is exposed to others.\n\nThat may have some truth when there is an established solution to be adopted. But my whole point is that by the time you have the rival national printing centers of the 1600s, each backed by either royal or religious authority, there still was no established convention for quotation marks to be borrowed or adopted.\n\nAt the same time, the different customs did not develop in isolation, and I don’t think it’s hard to imagine some common ancestral proto-quotation attempts from which the different national styles evolved — perhaps with one eye on the others and one eye on what each thought was the better solution.\n\nWith multiple solutions evolving more or less simultaneously within strong, rival traditions, you end up with several surviving, parallel conventions. Unlike more basic punctuation marks which were formalized earlier within a more-or-less single dominant tradition.\n\nThat’s my hypothesis anyway.\n\nBTW, all you grad students, this would be an interesting thesis project: to trace the emergence and divergence of the different conventions for quotation marks — researching original manuscripts and primary sources to identify proto styles and early examples of the emerging norms in the different traditions.\n\n"
    },
    {
      "time": "20 Jul 2013 — 5:53am",
      "content": "In&nbsp; [**Deux-points et guillemets : le \" procès-verbal \"**](http://web.archive.org/web/20150415081109/http:/www.lexpress.fr/culture/deux-points-et-guillemets-le-proces-verbal_779087.html), [**Pedro Uribe Echeverria**](http://web.archive.org/web/20150415081109/http:/communaute.lexpress.fr/journaliste/pedro-uribe-echeverria) (L'Express), publié le 07/08/2009 à 10:27\\*\n\nEcheverria gives this picture of various shapes from 1529 to 1897:\n\n ![](http://web.archive.org/web/20150415081109im_/http:/typophile.com/files/ponctuation-1_189_6471.jpg)\n  \nHe says that the history of the guillemet goes back much earlier than the sixteenth century and relates it to the _diplé_ that was in use in medieval manuscripts for citations; here is an example&nbsp; he found dating from the fifth-sixth century.\n\n ![](http://web.archive.org/web/20150415081109im_/http:/typophile.com/files/diple-5e-siecle_457_5169.jpg)\n  \nHe also mentions that in 1857 Baudelaire expressed his dislike for the comma-shaped quotation marks his editor intended to use for his _Les fleurs du mal_ and that the editor finally used rounded parentheses-shaped guillemets.\n\nIf you read French, you can find other interesting references in the French wiki: [http://fr.wikipedia.org/wiki/Guillemet#Liens\\_externes](http://web.archive.org/web/20150415081109/http:/fr.wikipedia.org/wiki/Guillemet#Liens_externes \"http://fr.wikipedia.org/wiki/Guillemet#Liens\\_externes\")\n\n\\*En savoir plus sur [http://www.lexpress.fr/culture/deux-points-et-guillemets-le-proces-verbal\\_779087.html#ObY0Jj8ld0ZZpPeM.99](http://web.archive.org/web/20150415081109/http:/www.lexpress.fr/culture/deux-points-et-guillemets-le-proces-verbal_779087.html#ObY0Jj8ld0ZZpPeM.99)\n\n"
    },
    {
      "time": "20 Jul 2013 — 5:57am",
      "content": "> The typeface he chose was Fournier, a French face, and I would imagine that there was some discussion about its foreign quote marks\n\nNick — Forgive me, but there’s something about this anecdote that strikes me as slightly incredible. Do you mean to say that four years on after the original release of the Fournier revival in 1925 by the English Monotype company, they still had not furnished the fonts with conventional English quotation marks? Or perhaps just not for the American market? I sincerely doubt they would have been that purist and impractical.\n\nIn fact, the sample of Monotype Fournier that is tipped in to _The Fleuron_ No. V (1926) has a passage with perfectly ordinary English quotation marks.\n\n ![](http://web.archive.org/web/20150415081109im_/http:/typophile.com/files/FleuronV-FournierSample_580_6644.jpg)\n\nPerhaps the Lakeside Press had only an original font cast by Fournier himself with which to hand-set Rockwell Kent’s book? Yeah, right.\n\nNo, I suspect those guillemets in <cite>N by E</cite> are a particular Kentian affectation.\n\n"
    },
    {
      "time": "20 Jul 2013 — 6:59am",
      "content": "Here is a grab from a 46 page study by Jean Méron, [En question: la grammaire typographique &nbsp; **Les guillemets**](http://web.archive.org/web/20150415081109/http:/listetypo.free.fr/meron/new/Guilles.pdf), 1999\n\n ![](http://web.archive.org/web/20150415081109im_/http:/typophile.com/files/meron_5728.png)\n  \nMéron's source was _Les caractères de l'Imprimerie nationale_, Imprimerie nationale, 1990. Should I understand that the guillemets are really from the date given? \n"
    },
    {
      "time": "20 Jul 2013 — 6:57am",
      "content": "Michel: Nice!  \nAnd Baudelaire was the man. Well, in some ways. :-)\n\nKent: I also had never seen anything but conventional English quotes associated with Fournier revivals. Probably because it had become more English than French. It would be interesting to refer to Fournier's original work; IIRC, I had once borrowed a facsimile of his book from UCLA, but I'm not sure if I made any copies before returning it.\n\nhhp\n\n"
    },
    {
      "time": "20 Jul 2013 — 7:11am",
      "content": "Michel, it looks like you've helped me finally figure out the origins of the quotemet: in the Méron paper, on page 4, right after the illustration you posted above, it shows what he seems to say is the earliest example - the Imprimerie Nationale's \"Didot Millimétrique\" of 1811. On the other hand he goes on to say that Tory and de Vascosan used similar forms way before. Something to track down (won't be too easy)... What's a good way to get in touch with Méron?\n\nhhp\n\n"
    },
    {
      "time": "20 Jul 2013 — 7:22am",
      "content": "Hrant, I don't know; from the link [http://listetypo.free.fr/meron/new/index.html](http://web.archive.org/web/20150415081109/http:/listetypo.free.fr/meron/new/index.html \"http://listetypo.free.fr/meron/new/index.html\"), I understand that Thierry Bouche might be of some help.\n\n"
    },
    {
      "time": "20 Jul 2013 — 12:29pm",
      "content": "I have found that the idea of using diacritics to quote is very old. Isidore of Seville (6th c.) mentions more than twenty forms of quotation, each one of them associated with a particular sign. I don’t think that the answer to Nina’s question relies on a late-evolution principle, because, somehow, the evolution of the quotation marks seems to be more straightforward than, let’s say, that of the comma or the semicolon. Semicolons, for instance, were still mainly abbreviation marks (for –us, among other Latin suffixes) during the 16th century.\n\nThe 66 99-style quotation marks evolved from the ordinary comma. Printers used to mark quotations by means of starting each line with a couple of commas followed by a fixed space. They were confident that context would provide clues for the reader to know the precise places were a quotation started and ended. (According to Uribe Echeverría and others, this custom derives from the early-medieval diple, a wedge-like sign that some scribes wrote at the margins of the manuscripts to mark quotations.) Later on, some printers started to insert a couple of commas in the precise place where the quotation began, but to differentiate them from regular commas, they used to put them upturned in the galley. That is why they are inverted (66) with respect to the commas and raised with respect to the baseline. Soon, typographers envisioned that a new sign should be engraved (99) to join in a couple that would render much better typographic compositions.\n\nThe solution was good in terms of diacritics, though it was obvious that the new quotation marks (“ ”) were ugly. During the 18th century, printers in Europe started to lower down the signs and to draw them in a slightly different fashion, curved at first, like tiny parenthesis, and later, angled (« »). Almost every typographic culture in Europe enthusiastically adopted these new quotation marks. The question is why that didn’t happen in England and the United States.\n\nMy theory is that the explanation lies in politics. The United States started a rebellion at the end of the 18th century, and from then on, they had no recess until the last third of the following century. During this time, they developed as the only big nation of the world that grew richer, stronger, and more powerful than their former rulers. Surviving and growing at a fast rate was a priority, and that originated a lack of leadership in some cultural-related things. Think on Spanish, French, and Portuguese, for instance, languages that until recently were (or still are) fully regulated by their original countries. English and English culture had a different course. Therefore, many of the novelties that Europe adopted during the 18th and 19th centuries didn’t flourish in the United States or England: Metrical Systemis just another example. Regardless of typographic and literary styles, an English book of the 18th century is almost identical to one recently printed – the very same signs used in the very same fashion.\n\nIn my humble opinion, compared to other European major languages, English typographic style (orthotypography) is very archaic, and quotation marks are the best reminders of the fact.\n\n"
    },
    {
      "time": "20 Jul 2013 — 7:43pm",
      "content": "I think that shape should not be discussed independently of spacing and kerning. The French guilllemet is vertically centered (and appears to have had approximately that position since 1530 if the cuts of the Imprimerie nationale are faithful to the original) and there is a thin space separating each of them from the quoted text. On the other hand, English double quotes are on the contrary often kerned to get closer to the quoted text. It is rather clear that the guillemet does not have an ideal position or shape for such kerning. In fact, since the 19th century, spacing in English texts has been reduced, in my opinion, to the bare minimum. Is it just for economic reasons? Whatever the answer, I wonder if the move towards reading on the screen will change the relevant parameters.\n\n"
    },
    {
      "time": "21 Jul 2013 — 3:47am",
      "content": "Jorge — Thank you for that fascinating account.\n\n"
    },
    {
      "time": "21 Jul 2013 — 9:13am",
      "content": "Jorge, enlightening stuff!\n\nMichel, actually the spacing advantages of guillemets/quotemets over English quotes is exactly the main reason to use them; another important advantage is avoidance of confusion with the apostrophe. A minute difference in economy is not nearly as relevant.\n\nhhp\n\n"
    },
    {
      "time": "21 Jul 2013 — 9:32am",
      "content": "In defence of quote marks —I do also like guillemets— there might be an advantage in keeping punctuation and words looking different. Quote marks hanging from above, rather small, do have the advantage of being out of the way of the words.\n\n"
    },
    {
      "time": "21 Jul 2013 — 9:59am",
      "content": "The Grandjean italic guillemets are delightful. So much for the grand rationalist project!\n\n"
    },
    {
      "time": "21 Jul 2013 — 7:07pm",
      "content": "I think i disagree — the more glyph shapes, the more archaic, the less glyph shapes, the less archaic. At least that is what the global public thinks.\n\nBut first, I have been reading English now for a while, and never ever had difficulty with the complex use of ', for the 11 things it is used for, with more use in the depths of typewriter quality.\n\nBeside that though, the central factor that drove England to differences, is economy, we just followed. Take no accents, ? and ! only at the end, use the fewest letters, (we on this side of the pond didn't even want W). That no English wanted a new glyph just for quotes in the mid-19th century is hardly surprising to economic theory.\n\nI'm agreeing that English-speaking countries had the least politically centralized control over publishing; but that a common adherence to a dwindling shape repertoire thrived none-the-less, I think can only be explained by the desire for more, faster, from less, and not a failure to grasp significant novelty.\n\nRemember, also at the time of this historic quote split, Englishmen were going binary in thought ahead of the world... Curtis had his ideas and then discovered the _I Ching_, Boole (of the Booleans), followed and published, essentially anticipating something that could understand just two characters.\n\nDon't seem archaic to me.\n\n"
    },
    {
      "time": "22 Jul 2013 — 1:00pm",
      "content": "Hrant, what you call the “quotemet” appears [... removed]\\* in Marcellin-Legrand's _nouvelle gravure_ of 1847 (his _ancienne gravure_ is from 1825 and you can see its guillemets in Méron's list above). The _nouvelle gravure_ was used to set pages 215-228 (add 34 for the pdf page) as well as pages 285-304 of [Arthur Christian, _Débuts de l'imprimerie en France — L'imprimerie nationale — L'hôtel de Rohan_, Paris, Imprimerie nationale, 1905](http://web.archive.org/web/20150415081109/http:/archive.org/details/dbutsdelimpri00chri). That book also uses Firmin Didot's 1812 _caractères millimétriques_ and here is a grab from page 312;\n\n ![](http://web.archive.org/web/20150415081109im_/http:/typophile.com/files/didot-guillemet_4301.png)\n  \nNo quotemet in Didot's _caractères millimétriques_ or in any of the other fonts used to set the book.\n\n\\*Méron goes much earlier; the English-like guillemets he shows look however much smaller in height than the _nouvelle gravure_ quotemets.\n\n"
    },
    {
      "time": "22 Jul 2013 — 2:02pm",
      "content": "@Kent: _I suspect those guillemets in N by E are a particular Kentian affectation._\n\nThose Krazy Kents!\n\n"
    },
    {
      "time": "26 Jul 2013 — 2:37am",
      "content": "I am loving this thread. Thanks all for the fascinating insights.\n\n"
    },
    {
      "time": "26 Jul 2013 — 10:52am",
      "content": "Concerning the remark Baudelaire made to his editor about quotes (mentionned in Echeverria's article in L'Express culture), _\" Vos guillemets singulièrement retournés. Est-il nécessaire d'en mettre tout du long ? \"_ it may be worth looking at how they could appear in French at the time; here is grab from [Étude sur Montaigne](http://web.archive.org/web/20150415081109/http:/gallica.bnf.fr/ark:/12148/bpt6k5628946k), on [Gallica](http://web.archive.org/web/20150415081109/http:/gallica.bnf.fr/) dated 1859.\n\n ![](http://web.archive.org/web/20150415081109im_/http:/typophile.com/files/montaigne-guillemets_5621.png)\n  \nSimilar marks continue that way for many lines, till the citation ends; the opening guillemet is a rounded one. There are very long citations in one or two of Baudelaire's poems and it is likely that it was those marks repeating till the closing guillemet that were his main concern in the given quotation. They are not without reminding the use of the _diplé_ in the middle ages. \n"
    },
    {
      "time": "27 Jul 2013 — 5:28pm",
      "content": "Here’s a style I came up with for Artefact, or copied from somewhere—can’t remember which.  \nI used it again a decade later for Scotch Modern, and also Duffy Script.\n\n ![](http://web.archive.org/web/20150415081109im_/http:/typophile.com/files/sacrebleu_3990.png)\n\n"
    },
    {
      "time": "28 Jul 2013 — 5:18am",
      "content": "Interesting discussion. Never remarked “quotemtets” before. Looks funny but a little bit wrong for me.\n\n"
    },
    {
      "time": "29 Jul 2013 — 6:08am",
      "content": "Here is something I found in my 1975 edition of _lexique des règles typographiques en usage à l'Imprimerie nationale_ (France). Citations within citations also start with a guillemet and then there is an opening guillemet at the start of each line; finally there is a single closing guillemet. Here is about how it looks; I used Baskerville, like in the book, and fixed the inter word spacing to 0.375em. I had to force a linebreak after \"grand\"\n\n ![](http://web.archive.org/web/20150415081109im_/http:/typophile.com/files/cit-lafontaine_5332.png)\n  \nSuch a behaviour is a bit tricky to implement with LaTeX (here XeLaTeX). I took some code from [http://osdir.com/ml/tex.latex.french/2007-08/msg00030.html](http://web.archive.org/web/20150415081109/http:/osdir.com/ml/tex.latex.french/2007-08/msg00030.html \"http://osdir.com/ml/tex.latex.french/2007-08/msg00030.html\") and also from this [https://groups.google.com/forum/](http://web.archive.org/web/20150415081109/https:/groups.google.com/forum/#!msg/comp.text.tex/BcXe7UDKXP0/dLVO-EghJm4J) to force out the part of the paragraph that precedes the second order citation. \n"
    },
    {
      "time": "29 Jul 2013 — 6:17am",
      "content": "When it becomes _that_ complicated to indicate a quotation is in progress in English, I'll learn French ;)\n\n"
    },
    {
      "time": "29 Jul 2013 — 6:58am",
      "content": "I don't know who else than l'Imprimerie nationale does it. Here is an example from l'Office québécois de la langue française [http://bdl.oqlf.gouv.qc.ca/bdl/gabarit\\_bdl.asp?t1=1&id=3247](http://web.archive.org/web/20150415081109/http:/bdl.oqlf.gouv.qc.ca/bdl/gabarit_bdl.asp?t1=1&id=3247 \"http://bdl.oqlf.gouv.qc.ca/bdl/gabarit\\_bdl.asp?t1=1&id=3247\")\n\n> **«** &nbsp;Le rédacteur du _Canard enchaîné_ met carrément les pieds dans le plat&nbsp;: il parle dans un premier temps de **“** la grossesse rapatriée de la capitaine Prieur **”** puis, un peu plus loin&nbsp;: **“**** &nbsp; ****‘** _le_ **’** capitaine Prieur est effectivement enceinte **”** , signalant par des guillemets l’inadéquation de l’article masculin.&nbsp; **»**\n\nI pasted their text in textedit, saved as html and massaged to get an input that typophile understands; that is why the various quotation marks are bold. They are bold in their example.\n\n"
    },
    {
      "time": "30 Jul 2013 — 7:48pm",
      "content": "Does anyone know how the German low-9/high-6 and the Scandinavian high-9/high-9 quotation marks came into use? It's clear that the German pattern is the same style as the German facing-out guillemets, but that's as far I can go.\n\n"
    },
    {
      "time": "30 Jul 2013 — 7:57pm",
      "content": "Continuous cool content!\n\nNick, the guillemets in Mana 13\\* are uneven like that. In that case the impetus was a resolution issue, but I ended up loving the look too.\n\n\\* [http://www.themicrofoundry.com/manademo/](http://web.archive.org/web/20150415081109/http:/www.themicrofoundry.com/manademo/ \"http://www.themicrofoundry.com/manademo/\")\n\nhhp\n\n"
    },
    {
      "time": "31 Jul 2013 — 5:26am",
      "content": "@ John\n\nas a Dane I've done some research over the summer on this issue — but, alas, I haven't found anything useful.\n\n"
    }
  ]
}
