{
  "id": "10485",
  "title": "Open Type Fonts",
  "forum": "Build",
  "tags": [

  ],
  "content": "I am looking for Open Type fonts like Minion Pro. That means, a font that contains European, Cirillic and Greek. Is there anyone who can help me please.   \n   \nThanks in advance.   \n   \nGreetings   \nNiko\n\n",
  "author": "Nicolien",
  "time": "21 April, 2005 - 1:10pm",
  "uid": "2692",
  "comments": [
    {
      "time": " 23 April, 2005 - 2:41pm",
      "content": "Fedra will have a Cyrillic version soon ( [link](http://web.archive.org/web/20051031085154/http:/www.typotheque.com/site/discussions.php?topic=642)).   \n [Paratype](http://web.archive.org/web/20051031085154/http:/www.paratype.com/) works with multilingual fonts (mostly Cyrillic though).   \nSome Emigre fonts do have Cyrillic and Greek versions, but they're sold separately, as far as I recall.   \nMost of the MS fonts shipping with WinXP also cover CE, Cyrillic and Greek.   \nAnd of course, Adobe fonts: Warnock, Adobe Garamond, etc.\n\n"
    },
    {
      "time": " 23 April, 2005 - 3:20pm",
      "content": "Actually, Adobe Garamond Pro does not have Cyrillic. Adobe's upcoming Garamond Premier does, though. Besides Warnock, there's both Greek and Cyrillic support in Minion Pro and Myriad Pro. Most of our other typefaces currently in development will support both Greek and Cyrillic, too.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 25 April, 2005 - 1:44am",
      "content": "Eduardo and Thomas   \nThanks very much for this information.   \n   \nDo you know where I can find the complete characterset from Warnock, because the font looks very usefull.   \n   \nThanks in advance   \nN\n\n"
    },
    {
      "time": " 15 May, 2005 - 9:28pm",
      "content": "It’s right there on the Adobe pages for the typeface. Here’s the sample sheet for the regular face: [http://store.adobe.com/type/browser/pdfs/WARP/WarnockPro-Regular.pdf](http://web.archive.org/web/20051031085154/http:/store.adobe.com/type/browser/pdfs/WARP/WarnockPro-Regular.pdf)\n\nT\n\n"
    },
    {
      "time": " 19 May, 2005 - 2:24pm",
      "content": "This straight-face act is too funny.  \n(And quite possibly the best strategy.)\n\nhhp\n\n"
    },
    {
      "time": " 19 May, 2005 - 7:28pm",
      "content": "Is there a reference anywhere for which of the OpenType character sets that support Greek also support polytonic Greek? [Robert Bringhurst](http://web.archive.org/wiki/Robert%20Bringhurst) mentions Minion Pro and Lithos Pro as both having Greeks, but only Minion has a polytonic Greek. Right?\n\n"
    },
    {
      "time": " 19 May, 2005 - 7:42pm",
      "content": "A bold experiment in trying to get the Adobe online type previewer to spit out polytonic Greek has resulted in abject failure. Yet I maintain my plucky, empirical spirit!\n\n"
    },
    {
      "time": " 19 May, 2005 - 8:29pm",
      "content": "Of Adobe families, only Minion Pro and the new Garamond Premier Pro have polytonic support.\n\n"
    }
  ]
}
