{
  "id": "104891",
  "title": "RFQ: Request For Quotation. Graphic Design",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "graphic; design"
  ],
  "content": "Reasons for this project:\n\n[k/K letter is this shape क/क]\n\nI would not liकe to purchase my meditation chanting beads from a compromised Hare कrishna temple who are under a coup and usurper regime here in England since November 14th 1977. The meditation chanting beads process basically is to chant the prayer for deliverance in this Age or the Hare कrishna Maha-mantra at least minimum of 16 rounds, each round composed of 108 meditation chanting beads on a daily basis:\n\nHare कrishna Hare कrishna  \nकrishna कrishna  \nHare Hare  \nHare Rama Hare Rama  \nRama Rama  \nHare Hare\n\nAlso there are scenarios where showing my meditation chanting beads and/or audibly chanting so someone is able to hear would not be possible and thus meditation chanting sans the beads would have to be done ‘informally.’ Although ticकing with a pen on paper to कeep tracक of the meditation chanting sans the beads, for example, 1 to 50 numbered areas on Boards A to E on ‘Euro lottery’ printed slips issued by the lottery company, Camelot (Britain) albeit not using  \nfor playing the lottery i.e not for gambling purposes, is a tool-solution in certain circumstances, see:\n\nHTML for Websites  \n [![Image and video hosting by TinyPic](http://web.archive.org/web/20130806071144im_/http:/i42.tinypic.com/2jcdeu8.jpg)](http://web.archive.org/web/20130806071144/http:/tinypic.com/?ref=2jcdeu8)\n\nIMG Code for Forums & Message Boards  \n[IMG]http://i42.tinypic.com/2jcdeu8.jpg[/IMG]\n\nURL for E-Mail & IM  \n [http://tinypic.com/r/2jcdeu8/5](http://web.archive.org/web/20130806071144/http:/tinypic.com/r/2jcdeu8/5 \"http://tinypic.com/r/2jcdeu8/5\")\n\nDirect Linक for Layouts  \n [http://i42.tinypic.com/2jcdeu8.jpg](http://web.archive.org/web/20130806071144/http:/i42.tinypic.com/2jcdeu8.jpg \"http://i42.tinypic.com/2jcdeu8.jpg\")\n\n-- I also have a preference for a customised solution for other scenarios, for example, ‘formal’ meditation chanting beads scenario (at least minimum of 16 rounds, each round composed of 108 meditation chanting beads on a daily basis) therefore this RFQ: Request For Quotation - Graphic Design project.\n\nProject itself:\n\n1. On a piece of paper 109 circles from large to small connected together as if on a chain and bound together at each end, thus 109 circles in a circle.\n\n2. The 1st circle and the 108th circle are faintly labelled 1 to 108 on the outside of the circle and really are from large to small. They are faintly labelled 1 to 108 from each end, so they are 2 numbers for each circle, for example, 1st circle is labelled 1/108 and the 108th circle is labelled 108/1. Probably having the 1st number labelled faintly on outside at the top end of each circle and the 2nd number faintly labelled at the lower end also outside the actual circle is the solution. The reason for 2 numbers labelled for each circle is because the meditation chanting beads process is to reverse at each end rather than jump-over the 109th circle.\n\n3. From 1st to 108th circle, each circle is to be divided with 4 vertical lines and 4 horizontal lines or is 4x4 with 16 identifiable intersections on each circle, due to meditation chanting beads process, that could be marकed by me whilst chanting providing a reference location and also would be useful if I am interrupted away from the meditation.\n\n4. The project should fit a sheet of ordinary computer printed paper, for example, in Britain the standard computer printer paper size is A4. Thus due to size limitations the 109 circle in a circle might require an inner or outer loop. The final output should be on a PDF file.\n\n5. The 109th circle should not be intersected or labelled, simply shaded with more of a cooकing pot shape rather than a circle shape with some bushy hairy top / as if the cooकing pot is boiling and overflowing.\n\n",
  "author": "javascript",
  "time": "23 Jul 2013 — 6:08pm",
  "uid": "71661",
  "comments": [
    {
      "time": "28 Jul 2013 — 5:38pm",
      "content": "Done, see the following evidence:\n\n[http://www.slideshare.net/TramDiksa/japamala3](http://web.archive.org/web/20130806071144/http:/www.slideshare.net/TramDiksa/japamala3 \"http://www.slideshare.net/TramDiksa/japamala3\")\n\n[http://www.scribd.com/doc/156604581/Mahamantra-Japa-Mala-Meditation-Chan...](http://web.archive.org/web/20130806071144/http:/www.scribd.com/doc/156604581/Mahamantra-Japa-Mala-Meditation-Chanting \"http://www.scribd.com/doc/156604581/Mahamantra-Japa-Mala-Meditation-Chanting\")\n\n[https://archive.org/details/TramDiksa](http://web.archive.org/web/20130806071144/https:/archive.org/details/TramDiksa \"https://archive.org/details/TramDiksa\")\n\n[https://docs.google.com/file/d/0B8osQr0QBsZ8Zmk0UVVqclp6cGc/edit?usp=sha...](http://web.archive.org/web/20130806071144/https:/docs.google.com/file/d/0B8osQr0QBsZ8Zmk0UVVqclp6cGc/edit?usp=sharing \"https://docs.google.com/file/d/0B8osQr0QBsZ8Zmk0UVVqclp6cGc/edit?usp=sharing\")\n\n"
    }
  ]
}
