{
  "id": "104868",
  "title": "Help ID a font",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Gothic Type ID",
    "Type ID Board [OLD]"
  ],
  "content": "Please help me identify the font on the picture. It comes from an Episcopal church built in 1929 but don't know if the item shown was installed at that time.\n\n ![](http://web.archive.org/web/20130818110837im_/http:/typophile.com/files/type_6071.jpg)\n\n",
  "author": "hellensol",
  "time": "23 Jul 2013 — 7:03am",
  "uid": "213324",
  "comments": [
    {
      "time": "23 Jul 2013 — 7:38am",
      "content": "Handlettered – look at the repeating letterforms (l in Dunlop versus in Charles; counters of the e's). I'd say it's a strange vernacular script taking up forms of Textura (r, c, e, o) and Roman skeletons (W, D, C, G, s).  \nIf you need to reproduce something alike, you might be looking for old Bastarda and Fraktur type, but also at Art Nouveau lettering (around 1910-30).\n\n"
    },
    {
      "time": "23 Jul 2013 — 10:36am",
      "content": "Seems to be a brass or bronze plate of unknown date in the Medieval Revival style popular in the late 19th century. The inscription is in an English vernacular lettering pattern that mixes a Gothic [Textura] lowercase with Roman capitals.  \nThere would not have been a font as such.  \nIf you want a font with something of the flavor of the lettering you could try David Quay's [Blackmoor](http://web.archive.org/web/20130818110837/http:/www.myfonts.com/fonts/linotype/blackmoor/), which mixes a gothic lowercase with Lombardic capitals.  \nFor an overview of digitized Textura fonts see [Textura](http://web.archive.org/web/20130818110837/http:/www.fontscape.com/explore?755).  \nSome of the lower cases are closer to your image than others. None of the upper cases match.  \nA vast number of Textura fonts were made since Gutenberg. Only a small percentage are digitized.  \nDon\n\n"
    },
    {
      "time": "23 Jul 2013 — 12:31pm",
      "content": "What is this font please?\n\n ![](http://web.archive.org/web/20130818110837im_/http:/typophile.com/files/match_font_3446.jpg)\n\n"
    },
    {
      "time": "23 Jul 2013 — 3:39pm",
      "content": "Sianta  \nRules are that you should open a new thread for a font ID request.  \nIt's rude to barge into another persons request.  \nDon\n\n"
    }
  ]
}
