{
  "id": "104996",
  "title": "Looking for a law firm logo font",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "law firm",
    "logo",
    "Logos / Corporate ID Design",
    "Modern",
    "trust",
    "web"
  ],
  "content": "I'm looking for help picking up fonts to try with a logo design for my law firm. It's a solo practice, with a modern edge in that it's a mostly paperless office. I'm a fairly young attorney, so nothing too traditional or old-school, but I also need something fairly conservative.\n\nSo, I'm looking for something that's modern/contemporary, conveys trustworthiness/warmth, sophistication and is still commanding enough to give the appearance of professionalism and knowledge.\n\nAnd and all suggestions are appreciated!\n\n",
  "author": "lmac_Idaho",
  "time": "27 Jul 2013 — 11:56am",
  "uid": "213480",
  "comments": [
    {
      "time": "27 Jul 2013 — 1:37pm",
      "content": "Trustworthy attorney is the one with his name engraved in an elegant gold-plated serif on a marble panel next to a well-aged wooden door in an older part of town :)\n\n"
    },
    {
      "time": "28 Jul 2013 — 9:19am",
      "content": "Lauren, here are a few quick suggestions that are appropriately serious, with a bit of personality and attention to detail. (Legal disclaimer: I don't own the copyright on the scales-of-justice clip art--I swiped it from another lawyer's web site just as a style reference.)\n\n ![](http://web.archive.org/web/20150419155114im_/http:/typophile.com/files/LAWFIRM_4399.jpg)\n\n"
    },
    {
      "time": "28 Jul 2013 — 10:41am",
      "content": "Lauren, if you should decide to use clip art (such as the scales of justice), you might try iStockPhoto.com. A huge selection of downloadable photos and illustrations, most are inexpensive, and legal to use (after you pay the fee).\n\nBut one danger of clip art in a logo is that other lawyers in your area might be using the same or very similar images.\n\nYou might want to consider getting a professional graphic designer to help you out. Remember that designing the logo is just one step in establishing your identity, there's also the design of your letterhead, envelope, business card, mailing labels, your email signature, website, signage, advertising, etc. If any of your friends or business associates have logos and printed materials that you like, you might ask them for the name of their designer.\n\n"
    },
    {
      "time": "28 Jul 2013 — 12:19pm",
      "content": "As for fonts, how about Satyr/Faunus?\n\nOr this one... :o)\n\n[http://cdn.myfonts.net/s/aw/720x360/200/0/102415.jpg](http://web.archive.org/web/20150419155114/http:/cdn.myfonts.net/s/aw/720x360/200/0/102415.jpg \"http://cdn.myfonts.net/s/aw/720x360/200/0/102415.jpg\")\n\n"
    },
    {
      "time": "29 Jul 2013 — 12:46pm",
      "content": "Oh, I really like Satyr and Faunus... I like the rounded/non-conventional blended with the lighter serif. Thank you!\n\nStill trying to figure out the logo, but at least I've got some fonts. Thank you!\n\n"
    }
  ]
}
