{
  "id": "104982",
  "title": "Aspiring Type Designers and Lettering Artists",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "For those who are interested in Type and Hand Lettering, My friend John Downer and Paul Herrera are teaching a Brush Roman Class at Typecon. This is to me a once in a lifetime chance to study with 2 masters of letters.\n\nWednesday, August 21st  \nFull-Day Sessions  \n9:00 am – 4:30 pm\n\nFull day workshops break for lunch from 12:00 pm to 1:30 pm.  \nBrush Roman Majuscules (Day 1)\n\nJohn Downer & Paul Herrera\n\nCost: $200 (Two Day Workshop)  \nMaximum Participants: 24  \nLocation: Pacific Northwest College of Art\n\nThis is a two day workshop. Participants must be prepared to attend both days.\n\nThis course is being taught by two Iowans who have had vast experience in the lettering profession, especially with a brush. John Downer and Paul Herrera will provide instruction on the proportions of Imperial Roman Majuscules, and show how the letters are formed with a flat, one-stroke, lettering brush. Each participant will receive valuable pointers on paint control, proper technique, stroke sequences, and various essential aspects of brush manipulation. Regular demonstrations will also be given.\n\nNontoxic, water-soluble tempera paint will be used. Materials will be included in the cost of the workshop.\n\nHope to see you there!\n\n",
  "author": "Charles_borges_...",
  "time": "26 Jul 2013 — 1:24pm",
  "uid": "1657",
  "comments": [
    {
      "time": "26 Jul 2013 — 9:16pm",
      "content": "Hi Charles!\n\nI am registered for the workshop and I am so excited! It will be my first TypeCon and first time in Portland. I have been wanting to take a workshop with John for a long time and it is finally happening.\n\nI will be counting the days until then...\n\nSee you in Portland!\n\n-Remy\n\n"
    },
    {
      "time": "29 Jul 2013 — 9:31am",
      "content": "Great Remy! See you there!!\n\n"
    },
    {
      "time": "5 Aug 2013 — 11:26am",
      "content": "Here is a link to a video of John Downer doing a brush lettering demo at L.A. Trade Tech. in March of 2013 for any of those who are interested in attending.\n\n[https://vimeo.com/71624028](http://web.archive.org/web/20150414230628/http:/typophile.com/wiki/https%3A/%252Fvimeo.com/71624028)\n\nI apologize if the quality of the video is not great, as I took it with my iPhone and I don't edit or modify films, nor do I know how.\n\nEnjoy!\n\n-Remy\n\n"
    }
  ]
}
