{
  "id": "104947",
  "title": "Font for my Philosophy Thesis",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello all,\n\nI've been a stalwart of both Minion Pro and Adobe Garamond Pro, using them for all of my Philosophy work to date.\n\nI'm about to start writing my piece de resistance - a large thesis - and want to use something a bit different. What font shall I use?\n\nThank you!\n\n",
  "author": "mikeygordon",
  "time": "25 Jul 2013 — 5:50am",
  "uid": "213406",
  "comments": [
    {
      "time": "25 Jul 2013 — 9:09am",
      "content": "Who is the target audience?\n\nWhat is the output? Printed document or something to be viewed on a monitor or both?\n\nIf it's a printed document, are you making a PDF and if so how? or are you printing directly from your software, and what is it?\n\nIf it's to be viewed on a monitor, is it PDF, epub, Word document or other? And what software are you using?\n\nWhy are you unhappy with the two fonts you mentioned? What are you looking for?\n\n"
    },
    {
      "time": "25 Jul 2013 — 12:35pm",
      "content": "Thanks for replying.\n\nThe target audience will be mainly university professors, but in theory anyone. It will be both printed and viewed in PDF format. I'm looking for something like the above two fonts but perhaps a bit edgier or modern.\n\nCheers\n\n"
    },
    {
      "time": "25 Jul 2013 — 12:57pm",
      "content": "Perhaps something Ungerian, like: [Neue Swift](http://web.archive.org/web/20150413075122/http:/www.myfonts.com/fonts/linotype/neue-swift/) or [Capitolium News](http://web.archive.org/web/20150413075122/http:/www.myfonts.com/fonts/type-together/capitolium-news-2/).\n\n"
    },
    {
      "time": "25 Jul 2013 — 12:58pm",
      "content": "What's the subject of the thesis?\n\n"
    },
    {
      "time": "25 Jul 2013 — 1:13pm",
      "content": "Metametaphysics :)\n\nCheers Sevag, I'll check those out.\n\n"
    },
    {
      "time": "25 Jul 2013 — 1:30pm",
      "content": "> Metametaphysics\n\n[Well then is there any question?](http://web.archive.org/web/20150413075122/http:/metaserif.com/)\n\n"
    },
    {
      "time": "25 Jul 2013 — 2:56pm",
      "content": "Eliason - \"meta\" and \"metaphysics\" are two different things - both in language, in reality, in philosophy and surprisingly in typography! Even if the association with one another would be the same. I would set a philosophic thesis, say, about \"commodification\" (\"Commodification of Human Nature\" - What a title!) in the typeface Meta. But \"metaphysics\" as a theme, even as a philosophic branch, is nothing new. In fact it is even boring! So, I would suggest a typeface in the direction of Baskerville - don't know exactly why, I just feel Baskerville would be right. I am too lazy now to refresh my basic knowledge in both philosophy and typography, but Baskerville-Transition Era-1800s-French Revolution, Industrialization, Diderot-Balzac-Realism, Goodbye-to-Metaphysics - that seems a right picture! So, a Baskerville-revival or something similar. Like [Baskerville Ten](http://web.archive.org/web/20150413075122/http:/www.myfonts.com/fonts/storm/baskerville-original-pro) or [Antique](http://web.archive.org/web/20150413075122/http:/www.myfonts.com/fonts/storm/antique-ancienne) from Storm Type Foundry.\n\n"
    },
    {
      "time": "25 Jul 2013 — 3:17pm",
      "content": "> The target audience will be mainly university professors, but in theory anyone. It will be both printed and viewed in PDF format. I'm looking for something like the above two fonts but perhaps a bit edgier or modern.\n\nNonsense. Unless philosophy PhD's have changed since the 1970s, the audience is your dissertation committee. If you work at getting your dissertation published by a university press, whoever picks it up will have their own designer(s) select the typeface. It is also usually best to wait a year to try & get it published, so that the work is the \"core\" of your dissertation, with further thought. It will still be out in time to count for tenure.\n\nIf you self-publish, ... well, not advised unless you take the information to be more important than your career.\n\n(We had a saying about prelims [preliminary exams] too. This is in the States, but I assume it's the same everywhere. To whit: \"Prelims are a puberty rite...\")\n\nGood luck with it.\n\n"
    },
    {
      "time": "25 Jul 2013 — 4:09pm",
      "content": "Times New Roman. As Charles said, it’s for your committee. Publications will have their own guidelines, and will most likely have required formats for submitted manuscripts. Your academic institution will most certainly have guidelines for how your thesis should be formatted.\n\n_However_ this may be changing, as I see more posts asking “what font should I use for my thesis?”\n\nI once had a (first year) paper returned because I refused to follow their guidelines thinking that as a typographer, I knew better than the scientists. I didn’t understand the review process at the time though.\n\n"
    },
    {
      "time": "25 Jul 2013 — 5:10pm",
      "content": "You really write for the people who grade it in the first place. Therefore Times would be the go to face. However a subtle an unnoticeable (to the eyes of the usual academic) deviation from Times is Georgia, which is easier to read. I would suggest use Georgia one point step less than the recommended Times size. There is even a blog entry of a guy who received on average higher grades with Georgia compared to Times ;)\n\nIf you want something else, and depending on the weights and character set needed, get Cycles or SFPL:  \n [http://www.stonetypefoundry.com/cyclesoverview.html](http://web.archive.org/web/20150413075122/http:/www.stonetypefoundry.com/cyclesoverview.html)  \n [http://www.stonetypefoundry.com/sfploverview.html](http://web.archive.org/web/20150413075122/http:/www.stonetypefoundry.com/sfploverview.html)\n\n"
    },
    {
      "time": "25 Jul 2013 — 5:45pm",
      "content": "> “…_Georgia, which is easier to read_.”\n\nAnd a reference to the research that supports this claim?\n\n> “_There is even a blog entry of a guy who received on average higher grades with Georgia compared to Times_.”\n\nURL?\n\n"
    },
    {
      "time": "25 Jul 2013 — 7:16pm",
      "content": "All the people telling you that you should just stick with Times New Roman are right. But unless there are explicit rules banning fancier typefaces, go ahead and use a fancier typeface. Of course, your thesis is not a book ready for press, but a manuscript for review. On the other hand, it’s the last chapter of your studies and something you might want to give your nan a copy of, so why not make it look nice? You could prepare a boring TNR version for your supervisor and a fancy one to give away, but why bother making two versions if there are no regulations keeping you from designing your thesis the way you like? As long as you make sure that it is easy to read and has wide enough margins for comments (if your supervisor happens to be of the old-fashioned kind who work with pen and paper), you should be fine. I have always seen this as a legal way of getting higher grades. Good design makes a text look more trustworthy and authoritative, even if it is just a term paper. As a supervisor, I would prefer to get the fancy version although I am not sure if I would remain uninfluenced by the nice design—but who is ever fully objective anyway?\n\nFF Meta Serif is an excellent typeface, by the way. Newzald is lovely. Skolar is also a quite pleasant and fresh. Or how about FF Spinoza?\n\n"
    },
    {
      "time": "25 Jul 2013 — 7:39pm",
      "content": "> FF Meta Serif is an excellent typeface, by the way. Newzald is lovely. Skolar is also a quite pleasant and fresh. Or how about FF Spinoza?\n\nI'm sorry, this is silly. I don't know about you, but when I'm paid to design a book, I read some of it. Always the introduction or introductory chapter. The conclusion if there is one. The rest if there is time.\n\nI imagine the category meta-metaphysics is wide open these days, even by the once-narrow standards of British/American philosophy. (Which I actually have sympathy for.)\n\nJust by the way, all the fonts you mention have \"a fresh new look.\" That may not be appropriate, or the author may not desire it. Either would stop their use.\n\nFurther:\n\nNow maybe I'm a bit too rebellious, but there were things I would have liked to put in my dissertation that would have caused trouble. Not directly, because the way the politics of these things work is if the person you're working under says it's ready, it would be a slap in his face for his colleges to turn it (you) down. But a grudging pass is less help. Unless you've already got several articles published, and your reputation is so established it stands on it's own regardless a certain coolness by the others on your committee -- you can reasonably expect your director to stand behind you -- you will fall afoul of academic politics.\n\nBut once that two-year-old dissertation is accepted for publication, you can incorporate \"further research.\" That lets you say things you might have found prudent to leave out of the original work.\n\nAs far as typeface goes, I'll stick with the notion that if I were to design it, I would first have to read at least some of it. Part of being professional.\n\n"
    },
    {
      "time": "25 Jul 2013 — 7:59pm",
      "content": "You could use the [Brill types](http://web.archive.org/web/20150413075122/http:/www.jackoshea.com/). They're free for non-commercial use, and specifically intended for scholarly work.\n\n"
    },
    {
      "time": "25 Jul 2013 — 8:09pm",
      "content": "Charles is right.\n\nHowever, if you really want to use something different from Times I would definitely not use Georgia, which is a great screen font, but looks clunky in text. Miller is the related one for print.\n\nIf you want to look modern and suave use Whitman.\n\nIf credibility is your desire, then Caslon is your font, and believe it or not, there is a version that has been done by a Philosophy PhD from London University, so that will help you sail through with no problem [:)](http://web.archive.org/web/20150413075122/http:/www.fontbureau.com/fonts/WilliamsCaslonText/)\n\n"
    },
    {
      "time": "26 Jul 2013 — 1:08am",
      "content": "@John, That link is, ehm, interesting. It sure is a meat-and-bones kind of typeface...\n\n"
    },
    {
      "time": "26 Jul 2013 — 3:33am",
      "content": "Isn't there more than one version of TNR? Won't the low x height of Caslon just irritate people?\n\n"
    },
    {
      "time": "26 Jul 2013 — 4:00am",
      "content": "I agree, it would have been nice to read a couple of pages before making typeface suggestions, but I think there’s nothing to be read so far. That’s why I suggested four typefaces that indeed have what I would call a fresh new look and that I would not find inappropriate for a philosophy thesis. It’s up to the writer to decide if he thinks that their tone fits the topic and the tone of his writing.\n\nAlso, I don’t think that a nicely designed thesis—as opposed to a double-spaced TNR manuscript—is going to stand in the way of anyone’s academic career. You have to stick to the rules, but if there are no explicit rules and you don’t break the unwritten ones by using a blackletter or a script typeface, no one will even consciously notice the typeface that you used. But you, as the author, will and that counts, too.\n\n"
    },
    {
      "time": "26 Jul 2013 — 4:50am",
      "content": "I think John’s link for the Brill fonts got hijacked somehow.\n\n"
    },
    {
      "time": "26 Jul 2013 — 9:23am",
      "content": "This is my first time on one of these forums and I must say that I'm overwhelmed by the response!\n\nI shall endeavour to check out all of your suggestions and let you know of my decision!\n\nThanks again,\n\nMikey\n\n"
    },
    {
      "time": "26 Jul 2013 — 10:53am",
      "content": "Many universities now publish their graduate students' dissertations through their libraries. So, it may not be only his committee that is reading Mikey's dissertation. (My philosophy dissertation, completed at the University of Michigan, can be found [here](http://web.archive.org/web/20150413075122/http:/www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&ved=0CC0QFjAA&url=http%3A%2F%2Fdeepblue.lib.umich.edu%2Fbitstream%2Fhandle%2F2027.42%2F58480%2Fmsilverz_1.pdf%3Fsequence%3D1&ei=ArfyUcGKNMaJ7AaHq4CoAw&usg=).) Almost all of the formatting was prescribed by the university. The typeface was pretty much the only thing that was left up to me -- that and how to format the footnotes.\n\nMatty\n\n"
    },
    {
      "time": "26 Jul 2013 — 12:50pm",
      "content": "> Many universities now publish their graduate students' dissertations through their libraries.\n\nGoing off topic here. but I'm curious. Do you mean \"publish,\" or \"make available?\" They always were put on microfilm (by Michigan, IIRC), even way back in the 1960s, and were available in university libraries. As such, they could be cited in other works -- as an \"unpublished dissertation...\"\n\nBut that didn't count for tenure, or much of anything else. \"Publish\" meant at least peer review, and in the old days anyway, that someone was interested enough to spend the money to get it into print and distribute it.\n\n"
    },
    {
      "time": "26 Jul 2013 — 11:45pm",
      "content": "Here the reference to the grading results on college papers: [http://pastebin.com/PAYYX6De](http://web.archive.org/web/20150413075122/http:/pastebin.com/PAYYX6De \"http://pastebin.com/PAYYX6De\")\n\nMy claim is that Georgia is _relatively_ easier to read. Times (New Roman) in its version shipped with MS Office, Windows, and Mac is actually a sub-headline cut for point size 14 to 16 with a strong contrast and a condensed shaped. Georgia while it is optimised for screen is however as well optimised for body text. And it is readily available. And I bet it is to most university professors indiscernible from Times, as it shares similar traits.\n\nTaken the conclusions into account from the post in the link on top, the best font might be Times Ten. The unfamiliarity factor to professors will be close to zero, so it doesn't distract and it is much nicer to read in body text.\n\nHowever, I didn't listen to my own advise, I used Cycles.\n\nAnd a disclaimer: I am not a professional in graphic design or typography.\n\n"
    },
    {
      "time": "27 Jul 2013 — 8:55pm",
      "content": "As you already used Minion and Garamond in earlier works and ask for some similar typeface, I assume you can choose the font for your thesis.\n\n[Andron](http://web.archive.org/web/20150413075122/http:/www.signographie.de/cms/front_content.php?idart=69&changelang=2) is my first advice, especially if your text include several words in Greek. There is a free, regular-only version [available](http://web.archive.org/web/20150413075122/http:/www.myfonts.com/fonts/andreas-stotzner/andron-freefont/).\n\nSome other ideas: [Adriane Text](http://web.archive.org/web/20150413075122/http:/www.myfonts.com/fonts/typefolio/adriane-text/) ● [Epic](http://web.archive.org/web/20150413075122/http:/www.myfonts.com/fonts/positype/epic/) ● [Espinosa Nova](http://web.archive.org/web/20150413075122/http:/www.myfonts.com/fonts/estudio-ch/espinosa-nova/) ● [Libertine Text](http://web.archive.org/web/20150413075122/http:/www.linuxlibertine.org/index.php?id=1&L=1) ● [Lyon Text](http://web.archive.org/web/20150413075122/http:/commercialtype.com/typefaces/lyon) ● [Romulus](http://web.archive.org/web/20150413075122/http:/www.dutchtypelibrary.nl/Romulus_rdrct.html) ● [Tiempos Text](http://web.archive.org/web/20150413075122/http:/typophile.com/wiki/https%3A/%252Fklim.co.nz/retail-fonts/tiempos-text/)\n\n"
    },
    {
      "time": "28 Jul 2013 — 5:58am",
      "content": "> Going off topic here. but I'm curious. Do you mean \"publish,\" or \"make available?\" They always were put on microfilm (by Michigan, IIRC), even way back in the 1960s, and were available in university libraries. As such, they could be cited in other works -- as an \"unpublished dissertation...\"\n\nI mean \"publish,\" although I may mean something different with that word than you do. Not all publications are peer-reviewed (publishing in the NYT, for instance). The dissertations are posted online through the university library for all to see. Anyone who Googles my name and the title of my dissertation can read it in full on the Michigan library's website. That seems like a kind of publication to me. Will it count for tenure? Of course not, but there are many kinds of publications that don't.\n\nMatty\n\n"
    },
    {
      "time": "28 Jul 2013 — 1:49pm",
      "content": "So, L guess you've just published on Typophile.\n\n"
    },
    {
      "time": "28 Jul 2013 — 4:11pm",
      "content": "@:flooce re “ [The secret lives of fonts](http://web.archive.org/web/20150413075122/http:/pastebin.com/PAYYX6De).” I read this years ago and haven’t come across it since. I’ve been meaning to keep a copy of it around for discussion. Thank you for the link. A fun read, but I wouldn’t put too much stock into its conclusions.\n\nWho can spot the first confound?\n\n"
    },
    {
      "time": "28 Jul 2013 — 4:18pm",
      "content": "If you want fancy Times, just go all in and get yourself a copy of [Starling](http://web.archive.org/). Absolutely beautiful. Great numbers, salient italic, marvelous range weights, incredible back-story… It works on so many levels. Mike Parker kicks ass.\n\n"
    },
    {
      "time": "31 Jul 2013 — 9:14am",
      "content": "> So, L guess you've just published on Typophile.\n\nThe lines may be a bit blurrier than they used to be, but I think we can still draw distinctions. My comments on Typophile aren't archived by a major university library, included in that library's online catalog, listed on [Google Books](http://web.archive.org/web/20150413075122/http:/books.google.com/books/about/Normative_Authority_and_the_Foundations.html?id=BdLz3kkD8uwC), available for sale as print-on-demand volumes at [various bookstores](http://web.archive.org/web/20150413075122/http:/www.abebooks.com/servlet/SearchResults?an=silverstein&sts=t&tn=normative+authority), and so forth.\n\nAs I put it above, it's no longer the case that one's dissertation committee is the only real audience for one's dissertation. They are the primary audience, of course, but there are additional reasons to want one's thesis to look as good as possible, typographically speaking. It's going to be \"out there\" in a way that dissertations generally weren't twenty years ago.\n\n"
    },
    {
      "time": "31 Jul 2013 — 12:37pm",
      "content": "Despite my passion for typography, and given my experience in academia, in all honesty, the typographic design of a dissertation, or any paper for that matter, is the absolute _last_ thing I would invest any amount of time and energy into. And I’ve been single-mindedly passionate about type — to an almost diagnosable level — for over 20 years.\n\nI would simply find the appropriate guidelines, no matter how fugly we may consider them to be as typographers, no matter how much “better” we know than the lay-person or academic, and do as they say. It really doesn’t matter if you find Times New Roman to be common or boring.\n\nIn everything I have ever written, given more time, I would revisit the content _long_ before thinking about fonts. Any potential reviewer worth their salt is far more concerned with good research then they are “good” typography. In fact, many would probably be put off by something that strays too far from the norm.\n\nThinking about fonts instead of content is putting the cart before the horse. This is most certainly a context where content trumps form.\n\n"
    },
    {
      "time": "31 Jul 2013 — 12:41pm",
      "content": "And if you are concerned about citing Typophile, follow these guidelines on [how to cite and reference Typophile for academic research](http://web.archive.org/web/20150413075122/http:/typophile.com/node/104436).\n\n(note the informative hyperlink that says more that “you can find it _here_”)\n\n"
    },
    {
      "time": "31 Jul 2013 — 3:17pm",
      "content": "Why would form be irrelevant in a dissertation? I think it isn’t. And it seems inconsistent to me to consider yourself passionate about typography on the one hand and to pass up the one-time chance of showing that typography can make a difference on the other. If there’s anything that deserves to be given a form that is pleasing to the eye, it is good content. And if your content is good, it’s likely to be consulted frequently, so you might want to give “the whole an attractive appearance without imposing too much self-will”, as [Mardersteig](http://web.archive.org/web/20150413075122/http:/typophile.com/node/105086) said. There’s nothing fishy about things looking nice. Typical dissertation guidelines—if they exist and happen to have been updated after the invention of the personal computer—seem to be more concerned with avoiding people turning in theses using 18pt Comic Sans Italic than with striving for an optimal reading experience. If you have the time to strive for this, I would. You can’t be passionate about fashion either and show up at your dissertation defense in a shell suit (although it’s all about the content).\n\n"
    },
    {
      "time": "31 Jul 2013 — 3:38pm",
      "content": "I don’t believe it to be _entirely_ irrelevant, but I do think it’s the last thing on the to-get-it-done list. Which is usually a pretty big part of finally finishing a dissertation. I haven’t met a single student or faculty member in nearly a decade of academia who was even mildly concerned with typography. When approaching faculty with such concerns, they were almost offended and looked down upon me for even considering taking time away from my research to spend on type. And that’s saying something, because I’m really passionate about it, can make a _very_ strong case for it’s importance, and make almost anyone feel it too.\n\nAt the end of the day, I think it comes down to how best you can spend your time in order to ensure the greatest return on investment. And when you’re being funded by public monies, I think it best to solve the problem, and move on to the next one. To use another agriculture metaphor, it doesn’t matter what colour your farm clothes are. What’s important is how much food you can provide for your community.\n\n"
    },
    {
      "time": "31 Jul 2013 — 4:13pm",
      "content": "Haven’t you all been following the latest psychological research on how form _primes_ one’s response to content? This has been mentioned in several threads at Typophile, e.g. [http://typophile.com/node/103506](http://web.archive.org/web/20150413075122/http:/typophile.com/node/103506 \"http://typophile.com/node/103506\")\n\nAccordingly, there is a case to be made that typeface selection goes beyond the matter of “easy to read”.\n\nTo continue in Chris’ metaphorical ballpark, the same food will taste better if one buys it at the farmer’s market, rather than the shopping mall.\n\nNow, the research needs to be done as to whether a dissertation will be marked higher or lower depending on typographic variables such as font selection.\n\n"
    },
    {
      "time": "31 Jul 2013 — 5:06pm",
      "content": "Food for thought, Nick :-)  \nIf you are writing your thesis for Reading, you may need to carefully ponder your typographic decisions.\n\n"
    },
    {
      "time": "31 Jul 2013 — 7:17pm",
      "content": "It’s obviously behind content on the to-do list, I agree. But science (or more generally: content production) is not agriculture (and not fashion either). You are not producing food and even if you were, you would still have to draw an entirely subjective line at where to stop putting time in the actual content. Is an eight-hour day enough or does it have to be ten, twelve, sixteen hours per day that you work on your dissertation? Everyone has to decide for him- or herself. But if you do have some leisure time to spend, why not spend it on typographically refining your thesis? I can well imagine this not being met with applause from faculty, but that should be your least concern. I don’t applaud everything they do in their spare time either. You could, for instance, try to come up with a layout that is based on your department’s guidelines, but takes them to a new level of typographic sophistication. If it is subtle enough, nobody will notice; they will just subconsciously find it a pleasant read. Or try to be flashy if you can stand the comments you might get for that. But to repeat myself: If you believe that typography—i.e. arranging type in a way that ensures optimal content delivery—is important (even if it’s not the main thing), you should let it come to its own whenever you can. Aesthetically I think the world doesn’t get any better from typophiles grudgingly handing in double-spaced TNR theses.\n\n"
    },
    {
      "time": "31 Jul 2013 — 8:01pm",
      "content": "> Aesthetically I think the world doesn’t get any better from typophiles grudgingly handing in double-spaced TNR theses.\n\nCouldn't agree more. Times from Linotype (PostScript) is a better rendering than Times New Roman (PostScript) from Monotype.\n\nThere is a hint of that here, under the subheading \"Variants\"\n\n[http://en.wikipedia.org/wiki/Times\\_New\\_Roman](http://web.archive.org/web/20150413075122/http:/en.wikipedia.org/wiki/Times_New_Roman \"http://en.wikipedia.org/wiki/Times\\_New\\_Roman\")\n\nOr if you really want to cross 'em up, try Equity.\n\n[http://www.fastcodesign.com/1665426/simple-genius-lawyers-typeface-makes...](http://web.archive.org/web/20150413075122/http:/www.fastcodesign.com/1665426/simple-genius-lawyers-typeface-makes-legalese-easy-to-read \"http://www.fastcodesign.com/1665426/simple-genius-lawyers-typeface-makes-legalese-easy-to-read\")\n\nAs a note, the biggest complaint people seem to have against Times is that ... it is used so much. Of course! You can't be one of the in crowd unless you know the special handshakes, right?\n\n"
    },
    {
      "time": "1 Aug 2013 — 3:44am",
      "content": "The one instance where I chose to ignore the rules was c 1995 in a psychology course. I was instructed to printed single sided, as per the department guidelines. I insisted on printing double sided under the threat of an F, but was shortly followed by the support of the rest of my classmates who chose to follow me and accept the same fate. They changed the university guidelines before the end of the semester. And as of two years ago, all dissertations are electronic submission only.\n\n"
    },
    {
      "time": "25 Aug 2013 — 7:39am",
      "content": "I have chosen Bembo.\n\nCheers for all your suggestions!\n\n"
    }
  ]
}
