{
  "id": "104929",
  "title": "Copyright queston",
  "forum": "General Discussions",
  "tags": [
    "copyright",
    "General Discussions"
  ],
  "content": "Hi. I'm new in type design. I've developed some custom lettering for logos but now i want to get into serious font design.  \nI've used FontForge and finally decided to purchase Glyphsapp. For my first try, instead of design a font from scratch, I decided to digitalize a font from an old Dan X. Solo catalog I found in my house.  \nMy work is almost complete and I want to show it for some critique but I'm concerned about wether I have the right to publish for educational purpose or don't.\n\n",
  "author": "marcoslhc",
  "time": "24 Jul 2013 — 5:51pm",
  "uid": "34571",
  "comments": [
    {
      "time": "24 Jul 2013 — 7:02pm",
      "content": "Best to ask legal questions to Lawyers. That said, from a quick Google, it looks as though the work belongs to someone else so digitizing it would in fact be copyright infringement.\n\nThere _may_ be an exception for educational contexts, but I would have to give the book a look to provide you with any meaningful insight.\n\nI would recommend contacting the publisher.\n\n"
    },
    {
      "time": "26 Jul 2013 — 7:24am",
      "content": "Thanks :)\n\n"
    },
    {
      "time": "28 Jul 2013 — 7:48am",
      "content": "This is my own opinion, not the views of any organizations I may be associated with, and not legal advice :)\n\nThere are no copyrights on typeface designs in the USA, so doing your own digital drawing of a typeface design in the USA is legal. Dan Solo used this fact himself since his stuff is revivals of early type designs :) But countries in the EU have a 25 year copyright on typeface designs. So it rather depends on where you are based.\n\nHowever, the educational value of doing outline drawing over the top of an existing typeface design is rather low. If you want to post work for review, you'd be better off making your own typeface design from scratch :)\n\n"
    },
    {
      "time": "28 Jul 2013 — 8:10am",
      "content": "I agree with Dave, but would add that if you were to attach your name to the font, and release it publicly, it will likely come back to haunt you if you ever decide to pursue type design as a career. Keep at it, but keep this one to yourself.\n\n"
    },
    {
      "time": "28 Jul 2013 — 7:00pm",
      "content": "Hi. Thanks for the advice. I know working the value I can get working over other's design is limited compared with designing a typeface from scratch. However, in this case the sheet included 62 characters (26 lowercase, 26 uppercase and 10 numerals) the challenge was study the basic morphology and create a complete Basic Latin set with diacritics, punctuation, symbols, lining numbers, tabular numbers and old style numbers. My main goals were:  \n1.- Learn to use Glyphs  \n2.- Learn about how to set digital type (space the font, kern the font, hint the font…)  \n3.- Set OpenType options like alternates.  \nI would recommend the experiment since I didn't have to worry too much about morphology and focus in the techniques and technology involved.\n\n"
    }
  ]
}
