{
  "id": "104928",
  "title": "Dealing with an uppercase font with calt features",
  "forum": "Build",
  "tags": [
    "calt",
    "lowercase",
    "Open Type Font",
    "uppercase",
    "Build"
  ],
  "content": "Hi Everyone,\n\nI'm new to Fontlab, and this forum has be extremely helpful for figuring out how to create my font. So thank you all for that! I have one question that I was hoping you lovely type designers might be able to help me with. I'm creating an all uppercase font with programed faux randomization, with 3 glyphs per character. I've spent the longest time figuring out how to get that to work, and it's finally running smoothly. Now, after all that work I don't know what to do with the lowercase characters! For now they're empty, Is there anyway to just scrap the lowercase glyphs? I really don't need them. Or if I copy the character, metrics, and kerning of my \"default\" glyphs to the lowercase, how do I also program all the contextual alternates to follow it? If I program a=A will it then abide by the programming of that uppercase \"A?\" As it stands, I have to hold down shift or press caps lock to use my font. Thanks in advance for your help!\n\nCheers!\n\n",
  "author": "Heather Diane",
  "time": "24 Jul 2013 — 4:51pm",
  "uid": "213383",
  "comments": [
    {
      "time": "24 Jul 2013 — 6:01pm",
      "content": "[Double encoding is one possibility](http://web.archive.org/web/20140809191243/http:/typophile.com/node/67092).\n\n"
    },
    {
      "time": "28 Jul 2013 — 9:43am",
      "content": "Thank you for the suggestion. I read through the post you referenced, I'm assuming Double encoding worked for you? There seemed to be some question if that would create problems. Also, would this work only if the user has checked the opentype options? For instance, if they're using it in indesign and haven't checked on the opentype features, would the lowercase just be blank?  \nCheers!\n\n"
    },
    {
      "time": "28 Jul 2013 — 10:33am",
      "content": "I don't know of any problems aside from the first caveat that John Hudson mentioned in that thread.\n\nThere's no blank lowercase when using the font, because whatever has been typed or pasted gets directed via the unicode to the capital letters. That's all prior to any OpenType stuff happening.\n\n"
    },
    {
      "time": "28 Jul 2013 — 10:00pm",
      "content": "I went ahead a tried this out, and so far it's working beautifully! Thank you for your help! I found a few comments you left on other threads that were also very useful. For other folks that might be interested, the other thread can be [found here.](http://web.archive.org/web/20140809191243/http:/typophile.com/node/91386)\n\n"
    }
  ]
}
