{
  "id": "104921",
  "title": "hebrew secondary styles",
  "forum": "Hebrew Typography & Type Design",
  "tags": [
    "Hebrew",
    "Hebrew Typography & Type Design"
  ],
  "content": "dear typophiles,  \ni write my ‘reading dissertation’ about hebrew secondary styles. now i am looking for hebrew type designs that create a set of styles (through structural change and within the same weight). i know about ismar david’s david (and linotype’s david hadash), henri friedlaender’s (unreleased) attempt of hadassah cursive and ben nathan’s days and nights. does one of you happen to know other examples / attempts that try to create a complementing style for highlighting within texts for continuous reading ?  \nmany thanks in advance, nicole\n\n",
  "author": "nicolefally",
  "time": "24 Jul 2013 — 11:11am",
  "uid": "46990",
  "comments": [
    {
      "time": "25 Jul 2013 — 9:59am",
      "content": "I would also be interested in knowing about this. \"a set of styles (through structural change and within the same weight).\" You say you know of maybe three examples of this. Could you be more explicit  \nand post links or better still, images.  \nmany thanks in advance, Mike\n\n"
    },
    {
      "time": "25 Jul 2013 — 10:35am",
      "content": "In text fonts from Masterfont, a number have right leaning obliques as companion styles for each weight. Narkisim has both left and right leaning obliques.\n\nBut maybe you mean by 'structural change' more than oblique versions, even though I'm pretty sure their outlines were adjusted by eye to look decent.\n\n"
    },
    {
      "time": "26 Jul 2013 — 5:18am",
      "content": "hi mike, here are the examples i was talking about:\n\nhadassah cursive (henri friedlaender): it wasn’t produced in the end because after the test that is shown in the picture below, henri friedlaender realized that there would need to be fundamental changes, such as a change of the whole rhythm. this would have been too much work and so, only the regular and the semibold were produced. (that’s roughly what he writes about it)  \ntext and picture from Henri Friedlaender, Die Entstehung meiner Hadassah Hebräisch\n\n ![](http://web.archive.org/web/20150317082057im_/http:/typophile.com/files/HadassahVorprobe_DSC06213_5756.jpg)\n  \ndavid (ismar david):  \npicture from typo magazine 25  \n\n ![](http://web.archive.org/web/20150317082057im_/http:/typophile.com/files/25_2007_TYPO-31_david_5369.jpg)\n  \ndavid hadash (linotype): [http://www.linotype.com/en/6712/davidhadash.html](http://web.archive.org/web/20150317082057/http:/www.linotype.com/en/6712/davidhadash.html \"http://www.linotype.com/en/6712/davidhadash.html\")  \ndays and nights (ben nathan): [http://www.hafontia.com/portfolio/](http://web.archive.org/web/20150317082057/http:/www.hafontia.com/portfolio/ \"http://www.hafontia.com/portfolio/\")\n\nwilliam, thanks for mentioning masterfont, i will have another look at their catalogue ! (but it is right that the masterfont’s narkisim is masterfont’s interpretation and not zvi narkis’s narkisim?)  \nyou were right that i am looking for more than oblique versions as i want to know how the inner structure of hebrew letters can change in a way that can be compared to the differences between a regular and a cursive style for the latin script (fluency, dynamic of strokes, change of terminals, etc.).\n\nthanks for your comments, nicole\n\n"
    },
    {
      "time": "27 Jul 2013 — 9:02am",
      "content": "Nicole, I don't know how much you know of Hebrew, but there is also the Hebrew cursive, called in Hebrew Ktav Yad (hand writing), which has its own tradition. There are many Hebrew fonts made in this style.\n\nI am pretty sure that Zvi Narkis had an agreement with Masterfont to publish his fonts.\n\n"
    },
    {
      "time": "27 Jul 2013 — 1:35pm",
      "content": "You could also have a look at the already 10 year old documentation on CTAN (The Comprehensive TEX Archive Network) of the makor2 project:\n\n[http://www.ctan.org/pkg/makor2](http://web.archive.org/web/20150317082057/http:/www.ctan.org/pkg/makor2 \"http://www.ctan.org/pkg/makor2\")\n\nIn figure 4 of the Users' manual, you can see the Rashi style used as complementary face.\n\nPS. On my Mac, the font in the Esther example comes out completely distorted if viewed with Acrobat Reader (I think that is due to bad blue values in the postscript font that was used). The text appears to come out as intended with the Apple Viewer.\n\n"
    },
    {
      "time": "27 Jul 2013 — 3:47pm",
      "content": "Nicole,  \nThis is a most interesting thread!  \nI was pleased to read (or rather to begin to read) your thesis which deserves study.  \nThanks for the link to font Days and Nights which points out the value of ligatures  \nin Hebrew apart from the nearly useless alef/lamed. For instance, the bet vav ligature see  \n [http://www.hafontia.com/portfolio/lig.gif](http://web.archive.org/web/20150317082057/http:/www.hafontia.com/portfolio/lig.gif \"http://www.hafontia.com/portfolio/lig.gif\") from Days and Nights  \nin the Ben Natan portfolio.\n\n"
    },
    {
      "time": "29 Jul 2013 — 9:15am",
      "content": "william,  \nyes, i know about the hebrew cursive (what i didn’t know was that it’s called ktav yad – thanks ;-).  \ni actually designed a text typeface that consists of three styles – an upright (hebrew square script), a cursive (like david’s cursive) and a script (like the handwritten shapes) – for both latin and hebrew script.( [http://www.typefacedesign.org/resources/A5specimen/2010/NicoleFally\\_Miss...](http://web.archive.org/web/20150317082057/http:/www.typefacedesign.org/resources/A5specimen/2010/NicoleFally_MissInformed_specimen.pdf \"http://www.typefacedesign.org/resources/A5specimen/2010/NicoleFally\\_MissInformed\\_specimen.pdf\"))  \nso i am particularly looking for text types. i know only one example where the hebrew cursive was designed as a secondary style. it is from another reading student and was designed a couple of years ago. unfortunately, i don’t know her name yet and only have this low quality photograph.\n\n ![](http://web.archive.org/web/20150317082057im_/http:/typophile.com/files/DSC03461_typophile_5680.jpg)\n\nyou write, the hebrew cursive has its own tradition. do you know where its shapes come from ? i could hardly find information about its origin. stephen lubell writes, ‘The cursive script has been in daily use for several centuries amongst various Jewish populations and continues to be used in modern Israel. In contemporary Israeli display typography and lettering for advertisements, the cursive script has come to be used as an element of graphic differentiation, due to its distinctive forms and calligraphic feel.’ (The Hebrew Typeface Designs of Zvi Narkis)  \nbut that’s more or less all i could find about it.\n\nmichel,  \nthanks for the link and the example !  \ni think, the rashi script is a possible variation. as far as i know, it was and is closely connected to religious usage and evokes religious associations. that’s why i didn’t consider it to be an option for the design of a style that is included in a text typeface that should be ‘neutral’. i might be wrong with that assumption !?\n\nmike,  \nthanks !  \ni like these ligatures too and hadn’t yet seen them.\n\n"
    },
    {
      "time": "29 Jul 2013 — 10:30am",
      "content": "Nicole, when I look at the various font shapes of the [Culmus Project](http://web.archive.org/web/20150317082057/http:/culmus.sourceforge.net/), I see nothing indeed that resembles Rashi (that is not even available as a postscript font in the [CTAN makor fonts directory](http://web.archive.org/web/20150317082057/http:/ctan.org/tex-archive/language/hebrew/makor/fonts/); all you can get there is the metafont sources). Those shapes date from the 12th century. More recent shapes were first considered by Ben Nathan and discarded. They nevertheless belong to the history of Hebrew complementary typefaces.\n\n"
    },
    {
      "time": "30 Jul 2013 — 3:39pm",
      "content": "Nicole,  \n The script form in your post from 29 Jul 2013 is a variant of Ashkenazi cursive. The other form of importance would be Sephardi cursive; [http://en.wikipedia.org/wiki/Cursive\\_Hebrew](http://web.archive.org/web/20150317082057/http:/en.wikipedia.org/wiki/Cursive_Hebrew \"http://en.wikipedia.org/wiki/Cursive\\_Hebrew\") has a decent chart (from the 1906 Jewish Encyclopedia). I don’t know how widely used actual Sephardi cursive is outside its (declining) use for Ladino, but “Rashi script” (A.K.A. Rabbinic cursive) is a variant in use.  \n See also [http://onthemainline.blogspot.com/2009/04/rashi-script.html](http://web.archive.org/web/20150317082057/http:/onthemainline.blogspot.com/2009/04/rashi-script.html \"http://onthemainline.blogspot.com/2009/04/rashi-script.html\").  \n—Joel\n\n"
    },
    {
      "time": "30 Jul 2013 — 7:55pm",
      "content": "The sample of the Rashi script in the Makor file was of poor quality (bitmap). I just passed the mf source through FontForge and made a pdf with which one can better appreciate the font (and realize how \"different\" it is): [/files/rashi20130730.pdf](http://web.archive.org/web/20150317082057/http:/typophile.com/files/rashi20130730.pdf)\n\n"
    },
    {
      "time": "31 Jul 2013 — 6:45pm",
      "content": "After reading the first lines of the Makor Rashi metafont files that say that they were obtained from a True Type format using TTF2MF (those lines were written by TTF2MF), I searched the web and finally found a font with a copyright dated 1992 from Aaron D. Schmiedel that is identical to the regular. I guess the other .mf files come from the same source. Those fonts were mentioned in an earlier thread, [http://typophile.com/node/75873](http://web.archive.org/web/20150317082057/http:/typophile.com/node/75873 \"http://typophile.com/node/75873\").\n\n"
    },
    {
      "time": "10 Aug 2013 — 7:47pm",
      "content": "The italic fonts for Latin seem to be designed in such a way that a single word, phrase or sentence in a page of regular may be instantly seen and stands out distinctly on the page. This is not the same as 'emphasis' for which bold might do better. Indeed the italic is often lighter on the page but is still very apparent.\n\nThe image above with ktav yad amidst regular Hebrew text doesn't acheive this.\n\nI just looked at a few Hebrew novels and found on pages of (I suppose) Frank Ruel, some sentences in the same typeface but inclined. To my inexperienced eye, this did not look satisfactory.  \nMike\n\n"
    },
    {
      "time": "11 Aug 2013 — 6:52am",
      "content": "Ellinia (אליניה) [http://www.fontsproject.co.il/font/about/Ellinia%20CLM](http://web.archive.org/web/20150317082057/http:/www.fontsproject.co.il/font/about/Ellinia%20CLM \"http://www.fontsproject.co.il/font/about/Ellinia%20CLM\") has many if not most of its \"italic\" letter shapes based on ktav yad.\n\n"
    },
    {
      "time": "27 Nov 2013 — 11:40pm",
      "content": "Even in Israel there is plenty of variation from the standard \"Ashkenazi cursive\". I quote \"Ashkenazi\" because plenty of these variations are among Ashkenazim!\n\nMy own personal writing is a blend of the standard 'cursive' and printed one and I have never received a complaint. The most commonly modified ones are shin, mem, and ayin from what I have seen.\n\nI also really don't like the standard tzadi and peh sofit. I just make those as they normally look. It sets me apart as an oleh, but it looks much better to my eyes and feels smoother to write.\n\n"
    },
    {
      "time": "28 Nov 2013 — 8:39am",
      "content": "Even in Israel there is plenty of variation from the standard \"Ashkenazi cursive\". I quote \"Ashkenazi\" because plenty of these variations are among Ashkenazim!\n\nMy own personal writing is a blend of the standard 'cursive' and printed one and I have never received a complaint. The most commonly modified ones are shin, mem, and ayin from what I have seen.\n\nI also really don't like the standard tzadi and peh sofit. I just make those as they normally look. It sets me apart as an oleh, but it looks much better to my eyes and feels smoother to write.\n\n"
    }
  ]
}
