{
  "id": "10502",
  "title": "Questions about Buying Fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello, Im in charge of ordering new fonts for a company but i dont know if i should buy True type fonts or open type fonts? whats the difference? We will be mainly focusing on print work. Can anyone tell me which one i should buy cause i have no idea.   \n   \nAlso are the fonts that come with illustrator and photoshop free to use for commercial purposes? Just want to know if i need to purchase the helveticas and futuras that came with these programs.\n\n",
  "author": "sita",
  "time": "22 April, 2005 - 9:42am",
  "uid": "6474",
  "comments": [
    {
      "time": " 22 April, 2005 - 10:22am",
      "content": "Yves, im working on a Mac. Currently we are not useing Quark but we might in the future , right now its just illustrator and photoshop. So am i safe using true type fonts? What do you mean by cross-platform?   \n   \nAnd Thanks for the info on the adobe application fonts.\n\n"
    },
    {
      "time": " 22 April, 2005 - 10:43am",
      "content": "Adobe font FAQ - [http://www.adobe.com/aboutadobe/antipiracy/fonts.html#A](http://web.archive.org/web/20051110023513/http:/www.adobe.com/aboutadobe/antipiracy/fonts.html#A)  \n   \nHow is the work being output? Are you working with a service bureau?\n\n"
    },
    {
      "time": " 22 April, 2005 - 10:44am",
      "content": "\"right now its just illustrator and photoshop\"   \n   \nSave yourself the headache...just go with InDesign when the time comes to get the page layout application.\n\n"
    },
    {
      "time": " 22 April, 2005 - 10:50am",
      "content": "Yves,   \nBeing a recent graduate faced with purchasing several fonts this year, this issue is one that I have been wondering about. I'm on a Mac, use Quark, and have read about the problems with Open Type, so have opted to purchase either True Type or PS fonts -- never really knowing why I'm choosing one over the other -- but I think I've read PS fonts will go the way of the dinosaurs, so True Type is the better choice - correct?   \n   \nHowever, I hate the idea of investing so much money in either format if Open Type is going to take over. Does that mean I'll eventually have to repurchase the fonts I've spent so much on this year? Just yesterday I purchase Sparrowhawk on Veer for $39 (!) and it only offered one format (it didn't say which one it is) - BUT it doesn't work in the Microsoft Office Entourage program (trying to create a logo for an email signature), so I'm either feeling a bit cheated -- OR I just need to tweak something somewhere to get it to work (probably the later but the constant detective work of what needs tweaking is soooo time consuming!)   \n   \nHow should I think about font formats in order to make the best long term investment? Thanks!\n\n"
    },
    {
      "time": " 22 April, 2005 - 10:51am",
      "content": "We use a print shop based in New York. I feel kind of foolish asking cause i should know this stuff but what exactly is a service Bureau?\n\n"
    },
    {
      "time": " 22 April, 2005 - 11:00am",
      "content": "Darrel , Iv never tried indesign before. Iv been working in quark for years. I think i would be alittle scared to start using another layout application since iv never even touched indesign before. Is it easy to use?\n\n"
    },
    {
      "time": " 22 April, 2005 - 11:15am",
      "content": "Service bureau would be the people who take your files and output film - may be the print shop in your case. If as part of your production process you need to give them fonts (license permitting) as well as Photoshop and Illustrator files then you should ask them what they prefer.   \n   \nWith respect to Donna's question - the OpenType fonts will likely contain goodies and extras accessible in Adobe apps and eventually Quark. If you don't need or want the extras there's no need to upgrade.   \n   \nCheers, Si\n\n"
    },
    {
      "time": " 22 April, 2005 - 2:01pm",
      "content": "Thanks for the help Simon   \n   \n-sita\n\n"
    },
    {
      "time": " 24 April, 2005 - 9:52am",
      "content": "Apparently, Quark 7 will come out later this year, and support the full range of OpenType features. So you can continue to work in the page layout program you're comfortable with, and not miss out on special OpenType features.   \n   \nThe legacy font formats of PostScript Type 1 and TrueType will continue to work for many, many years to come.   \n   \nSo you can feel comfortable buying any format you like.   \n   \nOf course, like any software, fonts can have bugs; and in that, no format or foundry is immune.\n\n"
    },
    {
      "time": " 24 April, 2005 - 11:01am",
      "content": "Before OpenType fonts became available, for print work I preferred working with Type 1 PostScript fonts rather than TrueType... They were more reliable than most of the TT fonts I was familiar with.   \n   \nBriefly, the differences are that PostScript fonts have two components: a suitcase containing the screen fonts and separate files for the printer fonts, while TT fonts combine these into one scalable font file... Also, PostScript fonts use the same page-description technology as laser printers.   \n   \nAs for OpenType, it is a cross-platform format, meaning you can use the same font file on a Macintosh or Windows machine. OpenType fonts have room for many more characters than the older font formats.\n\n"
    },
    {
      "time": " 24 April, 2005 - 12:52pm",
      "content": "> * * *\n> **quote:**\n> \n> Apparently, Quark 7 will come out later this year.\n> \n> * * *  \n   \n ![](http://web.archive.org/web/20051110023513im_/http:/www.typophile.com/forums/clipart/angry.gif)   \n   \nr.k\n"
    },
    {
      "time": " 25 April, 2005 - 8:31am",
      "content": "Well which one do you guys use.. open type or True type?\n\n"
    },
    {
      "time": " 25 April, 2005 - 8:39am",
      "content": "I use open type whenever possible.   \n   \nI personally have never ran into problems with them, but as some have said above, there are circumstances where they might have issues.   \n   \nr.k   \n   \nps- don't be afraid of InDesign, it is simple, smart, and powerful. You could pick it up quickly if you wanted to.\n\n"
    },
    {
      "time": " 25 April, 2005 - 9:19am",
      "content": "The dividing line between Windows TrueType fonts and OpenType is remarkably thin.   \n   \nPersonally, I use about 80-90% OpenType fonts, and the remainder almost all TrueType. I keep a few Type 1 fonts around for specific compatibility needs.   \n   \nBut then again, that's predictable: I work for Adobe (inventors of Type 1, and co-developers of OpenType), and we stopped making new Type 1 fonts in 1999, to switch to OpenType.   \n   \nWe will likely stop selling Type 1 fonts this year, but that's another story, which I will cover in more depth at various type conferences later this year.   \n   \nRegards,   \n   \nT\n\n"
    }
  ]
}
