{
  "id": "105041",
  "title": "Concrete/Literary Hybrid",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello everyone.\n\nI'm tasked with designing what should be the first serious edition of a seminal work of modernist poetry; the original ms. is unusual in that the author, amid moments of otherwise normative free verse, would insert moments of concrete poetry, and the transitions were typographically seamless because of his use of a monospaced typewriter for both.\n\nMy feeling is that to set this new edition in a monospaced face would be to foreground the concrete moments of his book, while uglyfying the \"literary\" moments (which are not concrete, and which predominate).\n\nSo I've tentatively designed the book to be a mix: nonmonospaced lines of poetry, with the concrete moments tabbed and rigid. This \"solution,\" however, departs form the author's original typescripts; furthermore, the transitions between normative type and monospaced type feel \\*very slightly\\* jarring, from a typographico-visual perspective. I'm using Twentieth Century Medium, rather than a serifed roman, for the entire interior, to try and allude to the casually vanguard feel of the writing.\n\nThe option of using two different typefaces (a monospaced as well as non-) is pretty much off the table.\n\nIf any ideas, or condemnations, occur to anyone out there, please share them.\n\n",
  "author": "Quemadura",
  "time": "29 Jul 2013 — 4:03pm",
  "uid": "180737",
  "comments": [
    {
      "time": "29 Jul 2013 — 5:14pm",
      "content": "Alix FB is a typewriter style font with a monospace and a proportional mode. You can see this in the PDF specimen.  \n [http://www.fontbureau.com/fonts/AlixFB/ot/](http://web.archive.org/web/20130806045951/http:/www.fontbureau.com/fonts/AlixFB/ot/ \"http://www.fontbureau.com/fonts/AlixFB/ot/\")  \nI have no other suggestion.\n\n"
    },
    {
      "time": "29 Jul 2013 — 6:38pm",
      "content": "Start with a monospaced font for the concrete parts, and use the same face with InDesign “Optical” kerning for the rest. (You would have to reduce the size of the space character.) This approach would work quite well with one of the more attractive monospaced fonts, e.g. MVB Fantabular.\n\nFF Letter Gothic, a proportionally spaced typeface, combined with monospaced Letter Gothic.  \nOther faces that have both proportional and monospaced variants: Alix (mentioned above) and Century Schoolbook, etc.\n\nPanoptica (monospaced unicase) for the concrete part, and Parity (proportional unicase) for the other. Caveat: This face was designed for concrete poetry, so may seem strange for the other, although perhaps “vanguard”.\n\nUse a face throughout that looks monospaced, even though it is not, such as Ofﬁcina.\n\n"
    },
    {
      "time": "30 Jul 2013 — 7:18am",
      "content": "I've typeset a bit of concrete poetry now and then.\n\nI don't understand, why would you need a monospaced font for the concrete sections?\n\n"
    },
    {
      "time": "30 Jul 2013 — 8:29am",
      "content": "Thanks, everyone. This is serious food for thought. Nick: I'm investigating those typefaces as we speak. Joshua, here is one (simple) instance of the transition from verse to \"concrete\" poetry. In this sample I'm letterspacing the block to left/right align, rather than setting up tabs. This images should answer your question, though.\n\n ![](http://web.archive.org/web/20130806045951im_/http:/typophile.com/files/182_6629.jpg)\n\n"
    },
    {
      "time": "30 Jul 2013 — 9:25am",
      "content": "Joshua, here is an image from one of the pages for which I designed Panoptica:  \n [http://www.typophile.com/node/86793](http://web.archive.org/web/20130806045951/http:/www.typophile.com/node/86793 \"http://www.typophile.com/node/86793\")\n\n"
    },
    {
      "time": "30 Jul 2013 — 9:41am",
      "content": "Panoptica is a fascinating face, and gorgeous in its production of strip-like lines. It's tough for me to imagine using it for a 300-odd pp. book by a poet less severely experimental than Bök, though.\n\n"
    },
    {
      "time": "30 Jul 2013 — 10:06am",
      "content": "Jeff, I don’t think letterspacing a proportional font, as shown, is appropriate, because although it conforms to the layout, it disguises/camouﬂages the author’s intention—and artiﬁce—in writing each line to contain the same number of characters.\n\nBTW if you make images a maximum of 588 pixels, they will display in Typophile without scrolling.\n\n"
    },
    {
      "time": "30 Jul 2013 — 2:19pm",
      "content": "This is not necessarily what I think of when I hear \"concrete poetry.\"\n\n[http://www.google.com/search?hl=en&site=imghp&tbm=isch&source=hp&biw=140...](http://web.archive.org/web/20130806045951/http:/www.google.com/search?hl=en&site=imghp&tbm=isch&source=hp&biw=1406&bih=749&q=concrete+poetry&oq=concrete+poetry&gs_l=img.3..0l8j0i5l2.2381.5235.0.5521.19.17.2.0.0.0.147.1321.13j4.17.0.ernk_timecombined...0...1.1.23.img..1.18.1261.V0gBlVYp7AM \"http://www.google.com/search?hl=en&site=imghp&tbm=isch&source=hp&biw=1406&bih=749&q=concrete+poetry&oq=concrete+poetry&gs\\_l=img.3..0l8j0i5l2.2381.5235.0.5521.19.17.2.0.0.0.147.1321.13j4.17.0.ernk\\_timecombined...0...1.1.23.img..1.18.1261.V0gBlVYp7AM\")\n\nGiven that the point seems to be for each column of characters to line up vertically, I would use the same (not monospaced) font as the main text, and set it as a table, with each character centered in a cell and no visible cell strokes. Or use center-aligned tabs for each column, etc etc. Still don't see why a monospaced font is a requirement.\n\nEdit: A recent example of this that I did:\n\n ![](http://web.archive.org/web/20130806045951im_/http:/typophile.com/files/capsingrid_6572.png)\n\nAldus is not a monospaced font. Of course, there's a lot of letterspacing here because of the all-caps setting, but you could use much less space in your case.\n\n"
    },
    {
      "time": "30 Jul 2013 — 3:41pm",
      "content": "That’s ﬁne when all the characters have pretty much the same width, as per your example.  \nHowever, if the text is U&lc and includes /i and /l, and /m and /w, you are going to get a very nasty effect with a proportional width font.\n\n"
    },
    {
      "time": "30 Jul 2013 — 4:20pm",
      "content": "Joshua: here is a quick mockup of that page, with me replicating the author's typescript w/ Prestige. And then another showing, this time with the closing block of the poem tabbed. The book is primarily 300ish pp. of non-concrete poetry, so we're leaning towards prioritizing it, rather than subtly disabling the entire work by deploying a monospaced face, if this makes sense (my reasoning is that a book of this nature, set in a monospaced typeface, is going to code as \"off\" or unusual to many of its intended readers—though I'm fascinated by Nick's suggestion to optically kern the non-concrete passages, so that the monospace typeface won't inhibit extended reading). Still thinking/designing my way through this, however. Thanks to each of you, JC\n\n ![](http://web.archive.org/web/20130806045951im_/http:/typophile.com/files/182d_6356.jpg)\n  \n\n ![](http://web.archive.org/web/20130806045951im_/http:/typophile.com/files/182c_6641.jpg)\n\n"
    },
    {
      "time": "30 Jul 2013 — 6:36pm",
      "content": "I rather like your second example. Unfortunately, you really do need that much letterspacing (just tried it) to maintain the look of a grid and prevent uneven spacing from being distracting.\n\nIf you were using a face with a smaller _range_ of character widths — a serifed face, or a less geometric sans — you could get away with closing up the spacing a little more before it became too awkward.\n\nIf there are really only a few passages of this kind in the book, I would say by all means use the same face as the main text and set it in this way — though I find that tables are easier to work with than tabs, because you can select all the columns at once and change their widths together.\n\nAnother thing to look for would be type families that include a complementary monospaced font — like, for instance, The Sans and The Sans Mono (Thesis family).\n\nAnd is that italics in the original? As underscoring, maybe? If so, obviously you'll need a font with an italic.\n\n"
    }
  ]
}
