{
  "id": "105197",
  "title": "Colección Oro y Plata – vernacular Mexican blackletter",
  "forum": "Release",
  "tags": [
    "blackletter",
    "mexican",
    "vernacular",
    "Release"
  ],
  "content": "When I studied in the art school in Latvia my lettering teacher who happened to be in love with historic manuscripts and old books taught us NEVER EVER to use blackletter in all capitals. He should have known better.\n\n ![](http://web.archive.org/web/20150414025825im_/http:/typophile.com/files/_DSC3213_5720.jpg)\n  \nThere is a country in the world where blackletter still lives on and takes an active part in the sometimes chaotic vernacular graphic design. Mexico. It is a must to cut out your name in blackletter from a shiny metallic adhesive and stick it to your lorry window. There everything goes. Living amidst of it for several years I started to take notes and photos. Watching and comparing painted signs of many signmakers (rotulistas) and tried to work out the sweet middle point of it all and make a blackletter that could fit on any wall and may look okay in capitals or even in small caps.  \n\n ![](http://web.archive.org/web/20150414025825im_/http:/typophile.com/files/Oro-y-Plata_465x636_5103.png)\n  \nThe collection Oro y Plata (Gold and Silver) is a Mexican style blackletter, dedicated to the three big silver cities – Taxco, Zacatecas and Guanajuato. Taxco is more angular compared to rounded Zacatecas and elaborate Guanajuato. The fonts contain small capitals, ligatures, initial forms, contextual alternates and other OpenType features. The special feature is a stylistic set of superscript caps with possibility to underline them. It supports all the European languages using Latin alphabet.  \n [http://www.myfonts.com/fonts/lamatas/oro-y-plata/](http://web.archive.org/web/20150414025825/http:/www.myfonts.com/fonts/lamatas/oro-y-plata/ \"http://www.myfonts.com/fonts/lamatas/oro-y-plata/\")\n\n| Attachment | Size |\n| --- | --- |\n| [Oro-y-Plata-sample.pdf](http://web.archive.org/web/20150414025825/http:/typophile.com/files/Oro-y-Plata-sample.pdf) | 174.03 KB |\n\n",
  "author": "Kristians Sics",
  "time": "2 Aug 2013 — 12:49pm",
  "uid": "50324",
  "comments": [
    {
      "time": "2 Aug 2013 — 2:47pm",
      "content": "Good stuff! :)\n\n"
    }
  ]
}
