{
  "id": "105135",
  "title": "Designing a 'Dashed' font",
  "forum": "Design",
  "tags": [
    "Convert Glyphs",
    "Dashed Font",
    "Deign Font",
    "Design"
  ],
  "content": "Greetings from the Land Down Under!\n\nFirst of: Thank you for all the great posters here, you have gotten me out of trouble many times, and have been a great source of information. Hopefully in the future I can give back to the community.\n\nI am using FontLab Studio 5.\n\nHere is what I have: A Cursive hand written font that teaches students how to write the State Specific Cursive style. I have a Solid font, which can be used for demonstration so the students can see each glyph clearly. And also have an outlined version where students can trace inside the lines to form the letters and practice their style and technique.  \nThe font has 10-15 (depending on the state) sets of glyphs each containing different sets of joins, and logic which tells which glyph to use so that the letters join correctly. (Example, typing ab will turn into a/b.c2 . b.c2 being the glyph which contains the correct join to the class one letters, of which a is one).\n\nHere is what I want to do: The Cursive has be done in Solid, Outlined, and Dashed. And the Dashed font is where I am running into trouble. I need a way (Which doesn't involve redoing all the art with dashes) to convert my solid font into a dashed font.\n\nIs there a way that I can easily (And preferable make this an automated task) manipulate the Solid Glyphs so that every so often in the lines of the glyph it creates a space so that the font looks Dashed.\n\n[http://www.fontspace.com/blue-vinyl/print-clearly](http://web.archive.org/web/20141115073845/http:/www.fontspace.com/blue-vinyl/print-clearly \"http://www.fontspace.com/blue-vinyl/print-clearly\") \\< There is a link which contains a \"Dashed\" font which is similar to what I would want (In case you didn't understand what I meant by 'dashed')\n\nAny Feedback and suggestions are more then welcome. No information is wasted information\n\n",
  "author": "Laurence Nussbaumer",
  "time": "31 Jul 2013 — 6:00pm",
  "uid": "213628",
  "comments": [
    {
      "time": "31 Jul 2013 — 9:35pm",
      "content": "I would structure the project around “skeletal” paths.  \nIn FontLab, these can be thickened best by Contour \\> Paths \\> Make Parallel Paths.  \nThat will create the solid versions.  \nIn Illustrator, Window \\> Stroke \\> Dashed Line.  \nYou will then have to import the Illustrator work into FontLab.  \nAFAIK, there is no way to stroke paths with dashes in FontLab.\n\n"
    },
    {
      "time": "1 Aug 2013 — 12:25am",
      "content": "Alright that sounds like it could be what I need. I'll try this tomorrow and report back!\n\nThank you\n\n"
    },
    {
      "time": "1 Aug 2013 — 4:12am",
      "content": "If your Solid font is already done, it will be faster to edit the glyphs yourself than to set up anything to make a dashed pattern for you. Dragging a line with the knife tool across both sides of a stroke, as long as nothing else is in the way, will chop it into pieces. For some reason the slice does not always follow your line exactly, so the best way is to place four nodes on the contour (also with the knife tool; this is its less intuitive purpose) right where you want the ends of the gap to be, slice between them, and then select and delete the nodes that your slice made. If you need help making consistent lengths, try Tools: Action: Effects: Add Nodes, but keep in mind that the nodes aren't necessarily going to be lined up on either side for you.\n\n"
    }
  ]
}
