{
  "id": "105143",
  "title": "Booster Rounded Sans",
  "forum": "Sans Serif",
  "tags": [
    "round",
    "Sans",
    "Sans Serif",
    "Satori"
  ],
  "content": "Hi there\n\nLooking for some improvements and comments for this rounded sans i'm making.  \nIt's my first effort to do a complete typeface.  \nI've attached a pdf to closer inspection.  \nThanks in advance for any contribution to evolve.\n\nLuis\n\n| Attachment | Size |\n| --- | --- |\n| [booster specimen.pdf](http://web.archive.org/web/20150414175719/http:/typophile.com/files/booster%20specimen.pdf) | 596.93 KB |\n| [booster specimen-01.jpg](http://web.archive.org/web/20150414175719/http:/typophile.com/files/booster%20specimen-01.jpg) | 288.31 KB |\n\n",
  "author": "Satori",
  "time": "1 Aug 2013 — 4:11am",
  "uid": "213641",
  "comments": [
    {
      "time": "3 Aug 2013 — 12:39am",
      "content": "IMO This is excellent work. I wish i could help you with a little constructive criticism but i am still lost for words. May be you could add single guillemets if you haven't done that allready. Per haps you could try out a little more prominent cedilla, but that's peanuts.\n\nbest regards\n\n"
    },
    {
      "time": "3 Aug 2013 — 4:21pm",
      "content": "Good show. I would only say the numeral 2 is narrow and lacking in grace.  \nAnd you'll want to generally improve accent placement; acute is too far to the left in most cases. Shape of circumflex and caron may be too shallow.\n\n"
    },
    {
      "time": "8 Aug 2013 — 7:34am",
      "content": "Hi 37DMK and cerulean, many thnks for your feedback.  \nI'm now posting a new pdf, (hadn't seen the question of nr 2), [www.satori.pt/clientes/boosterspecimen.pdf](http://web.archive.org/web/20150414175719/http:/typophile.com/wiki/www.satori.pt/clientes/boosterspecimen.pdf%20) i think now can see how the font is working.  \nI would like some help in designing the other weights, im using Glyphs, and i would like to try a bolder weight, and use a similar filter to \"expand stroke\", to see how much thickness i want.  \nThe offset path in Glyphsapp, creates me a grey area outside the shape, someone could me help with this matter.\n\nMany thanks in advance\n\n"
    },
    {
      "time": "10 Aug 2013 — 6:02am",
      "content": "Hi Satori,\n\nnice font! I think the {m} could be a bit narrower, it's very light at the moment.\n\nI know your problem; Glyphs is by far my favorite font editor, but it has some shortcomings in path-expansion functionality. I've gone as far as exporting my open-path font from Glyphs to FontForge, manually re-opening all the paths, using the Expand Stroke function, and exporting the shapes back to Glyphs.\n\n"
    },
    {
      "time": "19 Aug 2013 — 10:03am",
      "content": "Hello Satori  \nI am truly sorry that it took me so long to get back at your thread. I never used glyphs before, but i have seen a picture of how to make font-weights in typography class so i was looking all over the internet to find that same picture. No luck. – then i decided to make one of my own. Basically i wanted to point out how you can create several thicknesses without braking the capital height or the baseline or having the x-height jumping around too much.\n\ni hope that helps (to me it was a great help to see how other people solved that problem):\n\n[![font-weights](http://web.archive.org/web/20150414175719im_/http:/typophile.com/files/Weights_of_Interstate_5204.png)](http://web.archive.org/web/20150414175719/http:/typophile.com/files/Weights_of_Interstate_5204.png)\n\n"
    }
  ]
}
