{
  "id": "105114",
  "title": "Latin glyphs in Asian Fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi Everybody,\n\nI'm looking for some informations about latin glyphs incorporated into asian fonts.  \n(i.e. Kozuka Mincho, Adobe Myungjo Std, LiSong Pro, MingLiU…)\n\nDo you know some ressources on the subject? Especially about Adobe Ming Std.  \nDo you know on which western font Ming Std's latin glyphs are based?\n\nI noticed that some of them seem to use stretched (monospace forced) version of Times.  \nBut maybe I have to check the “Scotch” style as well?\n\nThank you!\n\n",
  "author": "Alex Chavot",
  "time": "31 Jul 2013 — 9:33am",
  "uid": "213620",
  "comments": [
    {
      "time": "31 Jul 2013 — 11:57am",
      "content": "I know that some Asian typefaces do use a particularly ugly form of the Latin alphabet. There is a Unicode font, called, strangely, \"Caslon Roman\", which embodies this style.\n\nI believe those were drawn by Asians based on their own penmanship manuals showing the Roman style for sign-painting and the like: the traditional Chinese almanac (T'ung Shu) has hand-drawn characters in which the same design peculiarities can be seen.\n\n"
    },
    {
      "time": "31 Jul 2013 — 5:30pm",
      "content": "Many Korean serif text typefaces use Latin glyphs in the Century style, often with high x-height and squashed descenders to avoid sticking out when used with the Korean glyphs. One widely-used text typeface seems to use something based on ITC Garamond, presumably because the light glyphs with high x-height apparently harmonize well enough with Korean glyphs.\n\nRather than designing Latin glyphs from scratch, makers of Korean text typefaces will typically base their designs on existing ones that harmonize well with the Korean glyphs and adjust weight and proportions.\n\n"
    },
    {
      "time": "1 Aug 2013 — 7:44pm",
      "content": "> _I know that some Asian typefaces do use a particularly ugly form of the Latin alphabet. There is a Unicode font, called, strangely, “Caslon Roman”, which embodies this style._\n\nF.y.i., below is what Cyrillic glyphs included in MS PMincho look like. Their spacing in the font is very, very loose and uneven (I have slightly adjusted it for this showing):\n\n ![](http://web.archive.org/web/20130806044248im_/http:/typophile.com/files/MS_PMincho_Cyr-Sm_5274.gif)\n  \n<dt>Looks like those letter-forms are roughly based on <a href=\"http://web.archive.org/web/20130806044248/http:/typophile.com/node/37680#comment-231093\" rel=\"nofollow\">Latinskii</a>, a very popular Russian typeface (H.Berthold, 1901), a Cyrillic ‘extension’ of Lateinisch (H.Berthold, 1899):</dt>\n\n ![](http://web.archive.org/web/20130806044248im_/http:/typophile.com/files/1901_Berthold_Latinskii_Sm_6196.gif)\n\nI have problem identifying the design source of the Latin glyphs included in MS PMincho:\n\n ![](http://web.archive.org/web/20130806044248im_/http:/typophile.com/files/MS_PMincho_Lat-Sm_6354.gif)\n\n"
    }
  ]
}
