{
  "id": "105206",
  "title": "Dissertation on design in film",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI'm just starting to research ideas for my dissertation that I'm due to start writing in September. The topic I had in mind was something along the lines of \"how big an impact does design have on the success of a film?\" At the moment I am thinking of covering interior areas title sequences, design of props used in films, and exterior stuff like posters and DVD artwork.\n\nThe example I have in my head right now is Valhalla Rising - the DVD covers I have seen for it such as this one [http://ecx.images-amazon.com/images/I/51sNZlNR8%2BL.jpg](http://web.archive.org/web/20130806054157/http:/ecx.images-amazon.com/images/I/51sNZlNR8%2BL.jpg \"http://ecx.images-amazon.com/images/I/51sNZlNR8%2BL.jpg\") portray it in a similar way to films like 300 ( [http://www.comingsoon.net/nextraimages/300dvd1.jpg](http://web.archive.org/web/20130806054157/http:/www.comingsoon.net/nextraimages/300dvd1.jpg \"http://www.comingsoon.net/nextraimages/300dvd1.jpg\")) - epic battle films, when in actual fact it is quite a beautiful film with no huge battles and a small cast. I would write about the decisions the designers would have had to make about whether to portray a film in an accurate manner or to portray it in a way that it will sell in shops.\n\nI also thought of how Tarkovsky wanted to transcend the science fiction genre with Solaris, but was unhappy with the final film. The recent criterion release of the film took this into consideration when designing the cover - the designer documents the process on his blog here [http://samsmyth.blogspot.co.uk/2011/05/process-solaris.html](http://web.archive.org/web/20130806054157/http:/samsmyth.blogspot.co.uk/2011/05/process-solaris.html \"http://samsmyth.blogspot.co.uk/2011/05/process-solaris.html\")\n\nAny suggestions or input would be valuable at this point, if anyone could point me in the direction of anything relating to this that would be great\n\nThanks,\n\nEd\n\n",
  "author": "Coldbaths",
  "time": "3 Aug 2013 — 9:25am",
  "uid": "209710",
  "comments": [

  ]
}
