{
  "id": "105350",
  "title": "Monroney Label vehicle sticker",
  "forum": "Home",
  "tags": [
    "Unknown"
  ],
  "content": " ![](http://web.archive.org/web/20150317075002im_/http:/typophile.com/files/Scanfont_5327.jpg)\nCan anyone tell me the font of the attached. I am in desperate need of finding out quickly...Thank you in advance for your help\n\nFont:&nbsp;\n\n Linefeed \n\nSolved By:&nbsp;\n\n [donshottype](http://web.archive.org/web/20150317075002/http:/typophile.com/user/205259 \"View user profile.\")\n\n",
  "author": "window sticker",
  "time": "8 Aug 2013 — 6:12pm",
  "uid": "213865",
  "comments": [
    {
      "time": "8 Aug 2013 — 7:17pm",
      "content": "So, this is a General Motors printout for a Cutlass from circa 1970 -- note the muscle car specs, engine 350 V-8 4 barrel carb, pre-70s inflation prices and AM push button radio; at least it has seat belts. My dad had one, it was a blast to drive!  \nPerhaps an internal font to the pricing computer -- which could have been an IBM mainframe or something bespoke for GM.  \nFortunately, there IS a digital match -- no gross differences -- produced in 2005 by Ray Larabie as [Linefeed](http://web.archive.org/web/20150317075002/http:/www.identifont.com/find?font=linefeed&q=Go).  \nDon\n\n"
    },
    {
      "time": "19 Dec 2013 — 3:42am",
      "content": "General Motors is really one of the very popular and famous Automotive organizations in North America. I has been doing well in the Automobile industry over the years and still going strong. General Motors, Ford Motors, Chrysler etc are some most popular Motor companies in USA. [Vehicle Repair and maintenance](http://web.archive.org/web/20150317075002/http:/germanautospecialist.net/) also very necessary for the improved performance of a vehicle.\n\n"
    },
    {
      "time": "18 Mar 2014 — 6:01am",
      "content": "Vehicle wrapping, label, signs, banners and [Vehicle Graphics Honolulu](http://web.archive.org/web/20150317075002/http:/mrsignhawaii.com/) is fast becoming one of the hottest forms of outdoor advertising with media houses actually buying the space on trailers from companies like Tesco's. Your fleet of vehicles could be earning you more money than you think.\n\n"
    },
    {
      "time": "18 Mar 2014 — 6:43am",
      "content": "Chainprinter by Ray Larabie (Typodermic) even has the dot matrix look.\n\n"
    },
    {
      "time": "18 Mar 2014 — 7:09am",
      "content": "I like [Letter Gothic](http://web.archive.org/web/20150317075002/http:/www.myfonts.com/search/letter+gothic).\n\nEDIT: just seen the post date... Nevermind, Linefeed is perfect and this post is useless. Moderator, you can delete this one.\n\n"
    }
  ]
}
