{
  "id": "105316",
  "title": "TYPE ID BOARD HAS MOVED! [7 AUG 2013]",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Please post your Font Identification requests to:  \n [http://typophile.com/fontid](http://web.archive.org/web/20150317203745/http:/typophile.com/fontid \"http://typophile.com/fontid\").\n\nThe new system will allow us to track font classifications, and who's solved it.\n\nThank you-\n\n",
  "author": "Jared Benson",
  "time": "7 Aug 2013 — 2:28pm",
  "uid": "3",
  "comments": [
    {
      "time": "7 Aug 2013 — 2:37pm",
      "content": "Excellent work! I hope this will clear up a lot of the font-ID bleed we've been having.\n\n"
    },
    {
      "time": "7 Aug 2013 — 2:50pm",
      "content": "PS. Perhaps a big, prominent link at the top of the forums/front page would help even more in addition.\n\n"
    },
    {
      "time": "7 Aug 2013 — 3:26pm",
      "content": "OK will give it a try.  \nWhen I loaded the type ID forum & saw the short list I thought: OMG where did everything go!  \nThe old system was very difficult to work with in tracking down nodes based on uninformative titles like \"Help me!\"  \nHope the revised system works well.  \nDon\n\n"
    },
    {
      "time": "7 Aug 2013 — 4:43pm",
      "content": "any hope of seeing the lovely \"new post\" indicators like on the old board? or response count? i really like those features. helps me sort who has been helped and who has not.\n\n"
    },
    {
      "time": "7 Aug 2013 — 5:22pm",
      "content": "Absolutely. Please, shoot me any key feedback you want to see in that top-level list and I'll do my best to work it in if its possible.\n\n"
    },
    {
      "time": "7 Aug 2013 — 5:28pm",
      "content": "Agree with defiantone.  \nReally miss the red dot indicators that show which threads have new posts.  \nFind I am opening threads that I have already read.  \nAlso miss the response count.  \nDon\n\n"
    },
    {
      "time": "7 Aug 2013 — 6:00pm",
      "content": "ooooo that was fast :)\n\n"
    },
    {
      "time": "7 Aug 2013 — 6:27pm",
      "content": "This makes it \\*so\\* much easier to scan the tracker and segregate the TypeID request. Thanks!\n\n"
    },
    {
      "time": "7 Aug 2013 — 6:44pm",
      "content": "I'm hesitant to bog the listing down with too many columns of info. Hoping that this gives us the critical info.\n\nHaving some trouble getting the \"new\" indicator to behave properly.\n\nIdeally I'd like the left-side \"Top Participants\" to actually be a leaderboard for the \"Solved By\" column. Keep your fingers crossed....\n\n"
    },
    {
      "time": "7 Aug 2013 — 7:29pm",
      "content": "saw that. those two features were all i'd ask as of now. like Don says... otherwise I'm continually looking at threads to see what i've already read. You'll get it straightened out :)\n\n"
    },
    {
      "time": "8 Aug 2013 — 4:57am",
      "content": "I agree that the \"new\" indicator is the most important element to add.  \nSome more notes:\n\na) The last poster (which were shown in the old id forum) is also a convenient piece of info.  \nExample 1: If a request has 1 reply and the last post is the original author the request is probably not yet solved (I know that this is supposed to be replaced by the \"solved\" flag, but I'm afraid this will not be updated until a request reach the 2nd page of requests)  \nExample 2: Even if a request is solved I'm personally interested in following and reading comments of specific posters.\n\nb) I notice that the messages I post by replying to an id request, do not show now in \"My Profile-\\>My Posts\".  \nAs there is no other method (email notification, etc) to know that a new message has been posted in a thread I participated, I used a refresh on \"\"My Profile-\\>My Posts\" page to check if there any responses to my messages.  \nIs there any alternative?  \nIf not, is it possible to enable the posts to be shown in \"My Profile-\\>My Posts\"?\n\nThanks for all the effort to make the font-id section better ;)  \nFivos\n\n"
    },
    {
      "time": "8 Aug 2013 — 8:39am",
      "content": "Good feedback, Fivos. Let me see what I can address here.\n\n"
    },
    {
      "time": "8 Aug 2013 — 8:47am",
      "content": "Now how about a \"tracker\" page that excludes ID board threads?\n\n"
    },
    {
      "time": "8 Aug 2013 — 12:15pm",
      "content": "<cite>Now how about a \"tracker\" page that excludes ID board threads?</cite>\n\noh, YES, please! :)  \nBeen wishing for that for years...\n\n"
    },
    {
      "time": "8 Aug 2013 — 9:15pm",
      "content": "Some people measure quality-of-life by things like movies and shoes.  \nFor me, it's things like this.\n\nThank you, Jared!\n\nhhp\n\n"
    },
    {
      "time": "10 Aug 2013 — 5:17pm",
      "content": "Thumbnails are great!  \nBut how is it coming with the new posts red dot indicators that we used to have?  \nDon\n\n"
    },
    {
      "time": "13 Aug 2013 — 10:11am",
      "content": "If the idea is to direct newbies to the proper forum, wouldn't it be better to link directly to the new forum on the Forums page?\n\nInstead we have a 3-step process where they 1) click a link labelled \"OLD\" in red (and I assume some see that and don't read the light gray type below it), then 2) click a link to read the \"forum has moved\" article, and then 3) click a link to go to the new forum.\n\nThis isn't a criticism, I know you're working to make things better, but it just seems like a direct link might be better for new folks.\n\n ![](http://web.archive.org/web/20150317203745im_/http:/typophile.com/files/forum_3952.jpg)\n\n"
    },
    {
      "time": "17 Aug 2013 — 5:09pm",
      "content": "I agree with James, the top menu needs revision.  \nAs we know, people are still active on the old board.  \nIs there some way of freezing new posts to it so that a new post pushes the thread to the new board?  \nAnd where are the new post indicators?  \nDon\n\n"
    },
    {
      "time": "23 Aug 2013 — 9:10pm",
      "content": "still hoping for the new post indicators, as well as the most recent post id (so i can see WHO responded to the request).\n\nalso seeing some very weird things with how the attachments are showing in the post. the image link seems forced way over to the right and overlaps the forum/site navigation links instead of being left justified.\n\n"
    },
    {
      "time": "8 Dec 2014 — 1:00am",
      "content": "I was trying to post my Font identification request but I failed. I think they were showing the error the requests were not complete. I do not know what to do. It will be great help if you mail me. [http://www.qspray.com](http://web.archive.org/web/20150317203745/http:/www.qspray.com/ \"http://www.qspray.com\")\n\n"
    },
    {
      "time": "13 Jan 2015 — 1:09pm",
      "content": "How do I review font ID requests I have made that have been solved. I used to look under my profile \\> my posts. but when I look there now I only see the old font ID board posts. I see fvilanakis asked this previously, but I do not see an answer. Thanks.\n\n"
    }
  ]
}
