{
  "id": "105333",
  "title": "typography and culture",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hi all  \nI am writing a paper on Typography and culture.I want to know your views on this topic  \nHow typography and culture are related??  \ndo cultural influence typography?\n\n",
  "author": "sonika",
  "time": "8 Aug 2013 — 3:05am",
  "uid": "213778",
  "comments": [
    {
      "time": "8 Aug 2013 — 4:05am",
      "content": "Well, if we take an anthropological view of culture as a system of tools and codes for interpreting and interacting with each other and the surrounding world, then typography is very much an aspect of culture, as well as being entirely contingent on culture.\n\n"
    },
    {
      "time": "8 Aug 2013 — 4:56am",
      "content": "I’d suggest that you first look for a proper definition of typography.  \nWhen typography is writing with predefined / prefabricated letters\\* and take the definition of culture as suggested before, then the following questions may come in mind:\n\n1. How does culture interact with creating typefaces?  \n2. How does culture interact with the relationship between script and typefaces?  \n3. How does culture interact with script?  \n4. How does culture interact with the way typefaces are used (typography)?  \nAlso, you’d probably have to think about which cultures / scripts you want to include in your paper and in how far historic / technical developments should play a role.\n\nAll very interesting, but maybe you’ll have to focus a bit and tell us what you came up with. When you are looking for a debate on how to define topography, you might find something here: [http://typophile.com/node/2812](http://web.archive.org/web/20141115074449/http:/typophile.com/node/2812 \"http://typophile.com/node/2812\")\n\n\\*definition by Gerrit Noordzij\n\n"
    },
    {
      "time": "8 Aug 2013 — 10:44am",
      "content": "[http://www.wmich.edu/mus-gened/mus170/biography100](http://web.archive.org/web/20141115074449/http:/www.wmich.edu/mus-gened/mus170/biography100 \"http://www.wmich.edu/mus-gened/mus170/biography100\")\n\n"
    },
    {
      "time": "8 Aug 2013 — 2:16pm",
      "content": "I think another pair of interesting avenues are the existence of scripts and typography in invented cultures as well, like Klingon, hobbit, and etc. quite a bit, and then the cultures where we have little or nothing left of their cultures except their scripts in composition, like Mayan, Hittite, Harappan, or my favorite, Voynichian.\n\n"
    },
    {
      "time": "11 Aug 2013 — 5:19am",
      "content": "Sonica: ‘_How typography and culture are related? do cultural inﬂuence typography?_’\n\nFor the completeness of your paper it might be important to come up with a proper definition of typography, as Albert Jan suggests. Noordzij’s one is often referred to nowadays, especially by his former students, and it was preceded by similar ones by for instance the Frenchman Loys Le Roi, who deﬁned typography in the oldest known (very concise) publication on printing (type), which dates from 1576 (in 1594 it was published in London in an English translation): ‘_[…] the manner to write by imprinting […]_’, and by Walter J. Ong, who stated in ‘Comment: Voice, Print, and Culture’, _Visible Language_, Volume IV, Number 1, (1970) pp.77–83 (p.80): ‘_Alphabetic type commits the word to space even more than writing does. Writing makes words by creating marks on surfaces. Alphabetic prints makes words out of pre-existing things–types, which are stored around like nails or bricks in boxes–and made up into forms as bricks are made into houses._’\n\nIn his _Manuel Typographique_ the eighteenth-century punchcutter and theoretician Pierre Simon Fournier placed typography in a wider context by stating that it consists of ‘_[…] three parts, each distinct and indispensable, namely, punchcutting, founding and printing. The practice of the different branches produces artists of three different kind, the ﬁrst the punchcutters, the second founders, and the third printers, but only who combines a knowledge of all three branches is ﬁt to be styled a typographer_’.\n\nBased on my [research](http://web.archive.org/web/20141115074449/http:/lettermodel.org/) personally I would describe typography as _grid ﬁtting of formalized letters_; the grid being deﬁned by the natural rhythm of the applied type.\n\nHowever, for answering your question I think basically it’s enough that we agree on talking about the same thing, and as such the term ‘typography’ is sufﬁcient for me. I concur with Johan that typography and culture are inextricably connected with each other, and subsequently interact.\n\nFor my talk at Leiden University on the progress of my research in 2009, I invited Ji Youn Kang, a graduated master student from the Royal Conservatoire in The Hague for a talk on the differences between Western and Korean traditional music. She explained (beautifully sung) the actual lack in Korean traditional music of what is considered to be harmony in Western music. Subsequently I made a comparison of what is considered harmony in Hangul and formal representations of the Latin script. Some brief related info can be found [here](http://web.archive.org/web/20141115074449/http:/www.lettermodel.org/wordpress/?p=796).\n\nFor me the current Vietnamese writing system is a nice example of the fact that scripts can be simply replaced by ones from a different culture if required or demanded. A French decree was enough in this case. And the younger (South) Koreans are so much inﬂuenced by the Western music culture that they don’t understand anymore the traditional Korean music.\n\nFEB\n\n"
    },
    {
      "time": "13 Aug 2013 — 12:33pm",
      "content": "Look at [\\* Latent Stare\\*](http://web.archive.org/web/20141115074449/http:/colophon.info/*Latent%20Stare*.html)\n\n"
    },
    {
      "time": "17 Aug 2013 — 5:03pm",
      "content": "Have you read \\_Blackletter: Type and National Identity\\_ edited by Peter Bain and Paul Shaw, 1998 ISBN 1-56898-2? Excellent case studies.  \nDon\n\n"
    },
    {
      "time": "17 Aug 2013 — 11:35pm",
      "content": "thanks,..  \nNo i havent read this book but surely i will..\n\n"
    },
    {
      "time": "18 Aug 2013 — 7:39am",
      "content": "You might find it useful to poke around at my Face the Nation exhibition website. [http://www.stthomas.edu/facethenation/](http://web.archive.org/web/20141115074449/http:/www.stthomas.edu/facethenation/ \"http://www.stthomas.edu/facethenation/\")\n\n"
    },
    {
      "time": "25 Jun 2014 — 2:37am",
      "content": "Writing makes words by creating marks on surfaces. Alphabetic prints makes words out of pre-existing things–types, which are stored around like nails or bricks in boxes–and made up into forms as bricks are made into houses. [Pass4sure 70-411](http://web.archive.org/web/20141115074449/http:/www.pass4sureexam.co/70-411.html)\n\n"
    }
  ]
}
