{
  "id": "105305",
  "title": "\"Unified\" font use based on Stag",
  "forum": "Design",
  "tags": [
    "Stag",
    "stag sans",
    "web fonts",
    "Design"
  ],
  "content": "Hello\n\nWe are currently using a mix of Stag, Stag Sans for our materials (large type brochures, letters and Keynote presentations), as well as 'whatever is at hand' for emails and web (e.g. MS Trebuchet)\n\nThe recent availability of Stag as a 'direct' web font has opened the opportunity to unify our communications as well as look & feel. We would like, in particular to unify letters, web and email using the same font set.\n\nI have tested Stag (headlines) + Stag Sans (body) for web and it looks quite good. However Stag Sans is still not ideal for everyday body text: punctuation a bit too tight and doesn't do numbers particularly well (e.g. for invoicing).\n\nWe are going to keep the Stag family as our headline font (and license it for the web) but I would like some ideas on what other body font we could use. The constraints are fairly basic:\n\n- High legibility for both print and screen  \n- Native web fonts  \n- Either directly suitable for email or can easily be replaced by something not too shockingly different\n\nI had a look at FF Meta Serif for example and quite liked it, but it doesn't seem to exist as a native web font.\n\nPS: I am not worked up about serif v. sans.\n\nThanks!\n\n",
  "author": "moscool",
  "time": "7 Aug 2013 — 6:45am",
  "uid": "213813",
  "comments": [
    {
      "time": "8 Aug 2013 — 2:35am",
      "content": "Hey there,\n\nyou tested Stag for use in web? How? Did you used the ‘normal’ opentype version for it? This font might be not hinted properly so it looks too tight in web use.\n\nContact Commercialtype, their font technician, named Mark, is friendly and helpful. I’m pretty sure he can provide you with a test site with Stag Sans in use.\n\nRegards,  \nFlorian\n\n"
    },
    {
      "time": "8 Aug 2013 — 8:49am",
      "content": "Thanks Florian\n\nCommercial type actually have a display page here:\n\n[https://commercialtype.com/typefaces/stag/stag/book/web](http://web.archive.org/web/20150418163913/https:/commercialtype.com/typefaces/stag/stag/book/web \"https://commercialtype.com/typefaces/stag/stag/book/web\")\n\nI'll contact them though as I'm not sure which weights I want to use. do you have a contact for Mark (you can drop me a note at fmosco AT me DOT com\n\n"
    },
    {
      "time": "8 Aug 2013 — 10:14am",
      "content": "There is no way to correct tight spacing with hinting on modern Windows systems. The fonts needs to be drawn wider and spaced looser prior to hinting\\*. Check out the Reading Edge series from Webtype, Aften Screen (mine) from Monokrom or the eText fonts from Monotype for examples of this approach.\n\nFF Meta Serif is available for web use on [fontshop.com](http://web.archive.org/web/20150418163913/http:/www.fontshop.com/fonts/family/ff_meta_serif/All/All/Bestsellers/2). Click add, and select the web option. FF Meta Serif Web Pro is also one of the teaser families FontFont offer through [Typekit](http://web.archive.org/web/20150418163913/https:/typekit.com/fonts/ff-meta-serif-web-pro).\n\n\\* Low resolutions screens need looser spacing for text sizes than what is ideal for print. I think text on the Apple Retina screen also look better with some extra white.\n\n"
    },
    {
      "time": "8 Aug 2013 — 12:57pm",
      "content": "@moscool, just drop them a line on their official email address. They will help you. Don’t noticed this webfont example before. Stag is indeed pretty tight spaced.\n\n@Frode Bo Helland, sure, hinting and spacing are two different parts. But webfonts are in general (in the best case) a little bit spaced and properly hinted.\n\n"
    },
    {
      "time": "8 Aug 2013 — 1:10pm",
      "content": "@thetypographist, x-directions hints are not used in neither Cleartype GDI nor DirectWrite.\n\n"
    },
    {
      "time": "12 Aug 2013 — 1:38am",
      "content": "@thetypographist : thanks. Commercial kindly sent out trial fonts along with supporting fonts.css file\n\n@Frode Bo Helland : Really wasn't obvious from the fontshop.com site... Thanks for the tip. Will test with Typekit.\n\n"
    }
  ]
}
