{
  "id": "105414",
  "title": "Typewriter font",
  "forum": "Home",
  "tags": [
    "Serif"
  ],
  "content": "Hi!\n\nCan anyone ID this font?\n\nThanks!\n\n| Attachment | Size |\n| --- | --- |\n| [IMG\\_1103\\_1000.JPG](http://web.archive.org/web/20131017054913/http:/typophile.com/files/IMG_1103_1000.JPG) | 331.38 KB |\n\n",
  "author": "ThomasB",
  "time": "12 Aug 2013 — 12:51am",
  "uid": "187621",
  "comments": [
    {
      "time": "12 Aug 2013 — 12:58pm",
      "content": "Monospace.  \nSomething new, I note the reference to 2012.  \nIf this is a screen play the usual rule is that it must be written in courier 12 point, a monospaced font where the consistant character spacing means one page approximately equals one minute of screen time. Recently screen plays are also accepted in Courier Prime and Courier Final Draft. But none match your sample.  \nI did not find a full match from any type writer fonts -- also monospaced -- via Identifont & Myfonts, although some were close. Probably your font(s) could be found by going though the foundries that are not included there. Not at H&FJ. Some key points for comparison are the ear and lower bowl on g, 3, 2, j, a, & italic x.  \nIdentification goes to someone who perseveres in the search.  \nDon\n\n"
    },
    {
      "time": "15 Aug 2013 — 8:21pm",
      "content": "Finally found a match for the italic!  \nIt's [Lacrima Italic](http://web.archive.org/web/20131017054913/http:/www.milieugrotesque.com/typeface-lacrima).  \nThe regular is almost generic and any of several typewriter faces could be substituted without too much notice.  \nDon\n\n"
    },
    {
      "time": "16 Aug 2013 — 2:04am",
      "content": "I think it’s [Pitch](http://web.archive.org/web/20131017054913/https:/klim.co.nz/retail-fonts/pitch/) by Kris Sowersby.\n\n"
    },
    {
      "time": "16 Aug 2013 — 5:23am",
      "content": "The scale of the specimen image is small so the italic could fit either Lacrima Italic or Pitch.  \nSince the Pitch regular also fits, I defer to Jens and now say that the italic is probably also Pitch.  \nDon\n\n"
    }
  ]
}
