{
  "id": "10544",
  "title": "LOGO 'CONTEST'",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "Ran into this link on another site. Syndicate Pictures is looking to redesign its logo, with $500 as a 'prize'.   \n   \nAlso, see ITC Anna in full effect on their existing logo. ![:)](http://web.archive.org/web/20140712220737im_/http:/www.typophile.com/forums/clipart/happy.gif) Warning, type is secondary to image.   \n   \n   \n [http://www.syndicatepictures.com/newlogo/index.html](http://web.archive.org/web/20140712220737/http:/www.syndicatepictures.com/newlogo/index.html)\n\n",
  "author": "beejay",
  "time": "25 Jan 2002 — 11:51am",
  "uid": "1014",
  "comments": [
    {
      "time": "25 Jan 2002 — 1:01pm",
      "content": "It seems that they're not really looking for a logo. They just want a pretty 3D rendering that says \"Syndicate Pictures\" inside...   \n   \nhhp\n\n"
    },
    {
      "time": "25 Jan 2002 — 1:13pm",
      "content": "I posted this b/c they don't get it, what with ITC Anna, etc. (It wasn't Hall of Shame material.)   \n   \nWhat they they need 'identity' that works in color and b/w, on letterhead, biz cards, web, etc.   \n   \nMaybe some enterprising typophile can contact them and pitch an identity package.   \n   \nIt reminds me of a guy who called to rave about his new 'bitchin' logo, so I said 'fax me a copy.' He faxed over a logo. A very interesting black box.   \n   \n   \nbj\n\n"
    },
    {
      "time": "25 Jan 2002 — 2:36pm",
      "content": "\\> Maybe some enterprising typophile can contact them and pitch an identity package.   \n   \nI was just thinking of doing that!   \n(Desperate minds think alike...)   \n   \nhhp\n\n"
    },
    {
      "time": "25 Jan 2002 — 4:50pm",
      "content": "$500 for a new logo? Give me a break.   \n   \nIf you're a student or just starting out getting paid work as a designer then why not.   \nIf you're a pro designer I hope you'd feel the way I do and laugh this off as audacious amateurism.\n\n"
    },
    {
      "time": "25 Jan 2002 — 6:31pm",
      "content": "You guys are right.   \nThe only way to get anything out of this is to:   \n1. Do the entire identity system, not just the logo.   \n2. Do it for free.   \n3. Milk the fact that you were \"commissioned\" to do the identity design for a company...   \n   \nBut this \\*only\\* makes sense for somebody who has yet to make a name for himself in identity design - a very different animal than type design and multi-media design (in my case).   \n   \nhhp\n\n"
    },
    {
      "time": "25 Jan 2002 — 7:37pm",
      "content": "I'm not a pro designer per se, though I did study at the Royal Academy of Barnes and Noble.\\*\\*   \n   \nSoren's probably right about these guys, that they're trouble because they don't get it. That's the challenge for somebody: to communicate to them the power of proper identity. If they keep saying 'hint, hint' to you, then blow 'em off.   \n   \nBut not for me. I design T-shirts, among other things. My wife and I own our own company in the apparel business.   \n   \n   \nAlso, I wasn't suggesting a complete identity package for $500.00. But if you can knock out a LOGO in an hour, would you take $500.00 for it?   \n   \n   \nMart, aren't you in the restaurant biz ![:)](http://web.archive.org/web/20140712220737im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n   \nbj   \n   \n\\*\\* No longer an accredited school.\n\n"
    },
    {
      "time": "29 Jan 2002 — 7:14pm",
      "content": "ooops. Sorry for calling you Soren. There is someone named Soren Olsen on this site, so I thought that was an offshoot of Sbo.   \n   \nFeel free to call me PJ Harvey.   \n   \nbj   \n   \n   \n ![:)](http://web.archive.org/web/20140712220737im_/http:/www.typophile.com/forums/clipart/happy.gif) ![:(](http://web.archive.org/web/20140712220737im_/http:/www.typophile.com/forums/clipart/sad.gif) ![:)](http://web.archive.org/web/20140712220737im_/http:/www.typophile.com/forums/clipart/happy.gif) ![:(](http://web.archive.org/web/20140712220737im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": "25 Jan 2002 — 3:55pm",
      "content": "My personal rule: never participate in design   \n'contests,' unless you enjoy being exploited.   \n(I'm not talking about awards shows, these   \nare two different things.)   \n   \nBJ says:   \n\"Maybe some enterprising typophile can   \ncontact them and pitch an identity package.\"   \n   \nForgive my pessimism, but your first clue   \nshould be their line: \"and we're willing to pay   \nfor it.\" When they call the plumber do they say,   \n\"Congratulations! You have the distinct   \npleasure of fixing my clogged drain. And if you   \ndo it right I'll give you a plaque and a cash   \nbonus worth a third of your normal fee.\"   \n   \nBased on their 'call for entries,' they don't   \nunderstand the value (nor the price) of design.   \nDo you really want to work with a client like   \nthat?   \n   \n//joe\n\n"
    },
    {
      "time": "25 Jan 2002 — 6:26pm",
      "content": "Hillarious! ![:)](http://web.archive.org/web/20140712220737im_/http:/www.typophile.com/forums/clipart/happy.gif)  \nWhat a great exsample of how-NOT-to.   \nSuch people are better off doing their own \"logos\". It screams trouble to me. I know for sure that that kind of company arent worth a minute of any designers time. I've had one unprofessional customer too many.   \n   \nSbo\n\n"
    },
    {
      "time": "29 Jan 2002 — 8:58am",
      "content": "\"PJ\" Harvey why do u keep calling me Soren?   \n   \nSbo isn't even close to Soren... I thought you should know it. If you confuse me with someone else.. ![:)](http://web.archive.org/web/20140712220737im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nSbo \\<----- Sbo\n\n"
    },
    {
      "time": "2 Feb 2002 — 1:50pm",
      "content": "Hehe, no worries. Its just that Soren might get upset if he knew he was confused by someone like me. ![:)](http://web.archive.org/web/20140712220737im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nSbo\n\n"
    }
  ]
}
