{
  "id": "105468",
  "title": "Schoiffer Sans",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Schoiffer Sans, a rounded humanist sans serif with historical roots is available at [MyFonts](http://web.archive.org/web/20150414065434/http:/www.myfonts.com/fonts/jeremie-hornus/schoiffer-sans/) and [Fontspring](http://web.archive.org/web/20150414065434/http:/typophile.com/wiki/https%3A/%252Fwww.fontspring.com/fonts/jeremie-hornus/schoiffer-sans%20) with 50% off until September 9.\n\n ![](http://web.archive.org/web/20150414065434im_/http:/typophile.com/files/SchoifferFlag-03_5389.jpg)\n\n",
  "author": "jeremieh",
  "time": "13 Aug 2013 — 10:00am",
  "uid": "33745",
  "comments": [
    {
      "time": "13 Aug 2013 — 3:15pm",
      "content": "Nice!, that's an insteresting g\n\nThis is probably a amateur question:\n\nWhen designing typefaces like Schoiffer Sans, all the letters shouldn't follow the same shape flow as in the g, a, e, and c ?, Is this an stilistic approach?\n\nQuestion two: Did you use a especial ratio (like Golden Ratio, Perfect Fifth, Octave.. etc) to decide the max and min values of the rounded borders?\n\n"
    },
    {
      "time": "15 Aug 2013 — 12:30am",
      "content": "Hi Noisak,\n\nSchoiffer Sans is in fact inspired by a old serif typeface known as Enschedé English-bodied N°6 (see image)\n\nI tried to keep the particular structure of the original 'g', 'e' for instance while modernizing the whole and making it a sans-serif (the 's' is more open and 'humanistic' than the original). The 'n' and 'h' 'are more conventional because it is not a display typeface but intended to set text.\n\nThe rounded borders are all made optically, I wanted that the face looks hand-cratfed and that the reader feels the 'ink' as much as possible. That's also why it is slightly flared as well.\n\n ![](http://web.archive.org/web/20150414065434im_/http:/typophile.com/files/paper-1-300_3906.png)\n\n"
    },
    {
      "time": "18 Aug 2013 — 8:06pm",
      "content": "Oh, that's a rare sample, quiet interesting. I like how the L bottom serif play with the e and a curves. That Q, the ? sign and the iacute are cool.\n\nYou just made a really distinctive design with Schoiffer Sans. The round borders look great even on a display size and all diacritics are very subtle and coherent.\n\n"
    },
    {
      "time": "15 Sep 2013 — 8:53am",
      "content": "Very nice, I really like it. You have made interesting choices and the font in the end looks great. Congratulation !\n\n"
    }
  ]
}
