{
  "id": "10555",
  "title": "Lex's Business Card",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "Any critique welcome. I wanted to go for a traditional look, with a lot of whitespace.   \n   \n<!--attachment: buscard-70741.pdf*mime_pdf.gif*application/pdf*121.2*Lex%26%2339%3bs+Business+Card*buscard%2epdf -->\n\n<center>\n<br>\n<table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20050825230740im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Lex's Business Card<br><a href=\"http://web.archive.org/web/20050825230740/http:/www.typophile.com/forums/messages/29/buscard-70741.pdf\" target=\"_blank\"><b>buscard.pdf</b></a> (121.2 k)</td></tr></table>\n</center>\n<!--/attachment-->   \n ![Gif of Lex's Business Card](http://web.archive.org/web/20050825230740im_/http:/www.typophile.com/forums/messages/29/70742.gif)   \n   \n - Lex \n",
  "author": "Lex Kominek",
  "time": "Mon, 2005-04-25 18:42",
  "uid": "5398",
  "comments": [
    {
      "time": " Tue, 2005-04-26 04:36",
      "content": "Alex, look at making the border a tint of your black and look at PMS blacks like PMS Black 6 which has a red tint in it. The PMS blacks have a bit more depth. As for the type look at the spacing between the E,X and A (EX to tight XA to loose), the J and O and the K,O and M it seems to be a bit loose. Last point I haven't a clue what that mark in the middle of the card is. Good start\n\n"
    },
    {
      "time": " Tue, 2005-04-26 07:44",
      "content": "Thanks for the advice Daniel.   \n   \nI was actually thinking of going with PMS Black 12, but the printer said it would be more expensive, so I'm still debating whether or not to use it. I also want to print with raised ink if I can afford it.   \n   \nThe mark in the middle is a quarter rest from musical notation. I put it on the card so people would ask me about it, and it would be a quirky reminder of me whenever they see the card.   \n   \nI was also thinking of going with OSF for the phone number. I know that this is not normally advised, but it might work. I'll post a sample when I get home.   \n   \n - Lex\n\n"
    },
    {
      "time": " Tue, 2005-04-26 08:46",
      "content": "You also need to raise the parentheses in the phone number, to center them on the type. If you go for OSF-numerals the position of the par's is probably going to be ok.   \nOh, and don't use a division, but a proper en-line.   \nOh once more: I find @'a are almost always too big. Reduce it's size a bit and adjust the spacing to the left a bit.   \nAaaanndd: less space after the point after your initial would be an improvement, too.\n\n"
    },
    {
      "time": " Tue, 2005-04-26 10:14",
      "content": "Thanks Bert.   \n   \nLooking at the @, I agree with you. I'll take it down a couple of point sizes and use a bolder weight.   \n   \nI always thought that hyphens were used in phone numbers. The line is actually a hyphen ( [as you can see here](http://web.archive.org/web/20050825230740/http:/store.adobe.com/type/browser/F/JENA/F_JENA-10005000.html)). Should I go with the en-dash anyway because the hyphen is so slanted? What about lowering the macron down to the same level as the hyphen, as it has a nicer shape than the en-dash?   \n   \nI'm also wondering about the space between the parentheses and the rest of the phone number. To me it looks a little big. What do you guys think?   \n   \n - Lex\n\n"
    },
    {
      "time": " Tue, 2005-04-26 10:57",
      "content": "The border seems extraneous.\n\n"
    },
    {
      "time": " Tue, 2005-04-26 14:36",
      "content": "Alex, the reason I asked you to look at tinting the border is it distracts from the type. It makes itself more important than the type.   \n   \nA side note: Just read an article at CreativePro about printing on wood and other materials, interesting.\n\n"
    },
    {
      "time": " Tue, 2005-04-26 21:13",
      "content": "I see. My original design had a thinner border. Maybe I'll take the outer stroke down a half a point and the inner one down by a quarter point or so.   \n   \n - Lex\n\n"
    },
    {
      "time": " Tue, 2005-04-26 21:29",
      "content": "Here's an updated version with thinner border, smaller mark, OSF numerals, and better (hopefully) kerning.   \n   \n<!--attachment: buscard1-70849.pdf*mime_pdf.gif*application/pdf*123.4*Business+card+0%2e1*buscard1%2epdf -->\n\n<center>\n<br>\n<table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20050825230740im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Business card 0.1<br><a href=\"http://web.archive.org/web/20050825230740/http:/www.typophile.com/forums/messages/29/buscard1-70849.pdf\" target=\"_blank\"><b>buscard1.pdf</b></a> (123.4 k)</td></tr></table>\n</center><!--/attachment-->   \n   \n - Lex\n"
    },
    {
      "time": " Wed, 2005-04-27 05:03",
      "content": "Lex in the future could you post jpgs or gifs. pdfs are annoying. Thanks   \n   \nThe parentheses still aren't centered on the numbers. I'd consider loosing them all together. Just use a dash. Your upper left outside border isn't butting correctly. There is a slight gap. The Ko in you last name need a little tighting.   \n   \nOne last thought, if you use raised printing make sure you see samples. It tends to make artwork expand as if it had a stroke on it.\n\n"
    },
    {
      "time": " Wed, 2005-04-27 06:19",
      "content": "Hello Lex Kominek, I hope you don't mind I played with your card.   \nI put two pages, mine and yours -- b/w regards,   \n   \nAS   \n<!--attachment: lk-70865.pdf*mime_pdf.gif*application/pdf*76.4**lk%2epdf -->\n\n<center>\n<br>\n<table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20050825230740im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20050825230740/http:/www.typophile.com/forums/messages/29/lk-70865.pdf\" target=\"_blank\"><b>lk.pdf</b></a> (76.4 k)</td></tr></table>\n</center><!--/attachment-->\n"
    },
    {
      "time": " Wed, 2005-04-27 06:40",
      "content": "The G and D of Graphic Designer need some attention to kerning compared to your name, but the overall kerning is better. There is no hard and fast international rule for the use of hyphens or en-dash in the phone number, I suspect it is somewhat governed by local preferences, but I agree that the hyphen is a stronger character than the en-dash. Neither of the rules of your border join at the top left corner on the pdf\\*. Another thing to consider when using borders is that the trimming process can be slightly inaccurate and give you off-centre borders, you can either speak sternly to your printer or consider an assymetric design.   \nTim   \n\\* a good reason to use a pdf, although it is simpler to view a jpeg on screen.\n\n"
    },
    {
      "time": " Wed, 2005-04-27 09:44",
      "content": "Daniel,   \nI was going to post the GIF, but CorelDraw 8 does some funny things with exporting. A lot of the kerning problems of the original, such as the LE in ALEXANDER were caused in part by this. I'll try a version without parentheses.   \n   \nI used the \"Caption\" optical weight of [Adobe Jenson Pro](http://web.archive.org/web/20050825230740/http:/store.adobe.com/type/browser/P/P_1716.html). Should I use the regular weight to compensate for the raised printing, or should I go to Caption Light?   \n   \nAlessandro,   \nI like the spacing around the phone number and e-mail address in your version. I'll try to match it. I'll also increase the mark's size. I still like the border, but maybe I can go with embossing (again increasing the price) instead of printed to put the focus on the text.   \n   \nTim,   \nI think the hyphen works well too. The unjoined border is, again, something that happened when I exported from CorelDraw. I'll try to figure out how to fix that. My original design (I didn't post it here) had borders much closer to the edge of the card and I moved them in for the reason you mentioned.   \n   \nThanks again to everyone for helping me out with this. I'll post some updates later today.   \n   \n - Lex\n\n"
    },
    {
      "time": " Wed, 2005-04-27 14:30",
      "content": "Lex, fyi the PDF makes your type look heavier. I would print a version of your latest layout and contact your printer and discuss potential problems of raised printing. Talking to your printer early on can save a lot of problems later as Tim noted. That design might have 20% waste just from cutting.   \n   \nOne last thought, if you are going to emboss anything, let it be you mark in the middle of the card. Make it a blind emboss or a pastel foil emboss. You might also look into a foil stamp.\n\n"
    },
    {
      "time": " Fri, 2005-04-29 13:34",
      "content": "Adjust the spacing between the names. Think of the space as volume and not distance. \"Jos\" should be moved towards the K, or the last name should be moved towards \"Jos\".   \n  ![jos](http://web.archive.org/web/20050825230740im_/http:/www.typophile.com/forums/messages/29/71065.jpg)\n\n"
    },
    {
      "time": " Mon, 2005-05-09 21:58",
      "content": "I don’t know how to upload files anymore. Can someone help me?\n\n- Lex\n\n"
    },
    {
      "time": " Tue, 2005-08-02 22:54",
      "content": "Are you certain that you need that border? Unless you’ve got a very anal/fancy/expensive printer, chances are you’re going to have a very hard time getting that thing to center properly when the cards get cut. The small size of a business card is just going to draw attention to the small inaccuracies that will certainly come from the cutting.\n\n"
    },
    {
      "time": " Wed, 2005-08-03 00:32",
      "content": "I don’t think that it is possible at the moment to upload images to a comment, and the posts that start a thread are also not editable at the moment, either.\n\nIf you can upload the images elsewhere on the web, you could post a link to that here.\n\nI’ll see what else I can find out.  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20050825230740/http:/www.typeoff.de/)\n\n"
    },
    {
      "time": " Wed, 2005-08-03 05:09",
      "content": "My thoughts on rule borders on business cards. Overages. No cutting machine is perfect so when printers estimate the cost of a card with a border like you have is to know they will have X% waste when cutting the cards and figure it into the estimate.\n\n"
    },
    {
      "time": " Fri, 2005-08-12 02:57",
      "content": "I think the border looks funereal. It’s for a graphic designer, not an undertaker.\n\nNick Cooke\n\n"
    }
  ]
}
