{
  "id": "10559",
  "title": "(x) CraigCat logo - Friz Quadrata {Mike Y}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I'm trying to find this font, so as to make vectoring the logo easier:   \n [http://www.studioangelus.com/images/craigcat1.jpg](http://web.archive.org/web/20060525065631/http:/www.studioangelus.com/images/craigcat1.jpg)   \nAny ideas?\n\n",
  "author": "<a href=\"user/6305\" title=\"View user profile.\">cieldailes</a>",
  "time": "<br>",
  "uid": "6305",
  "comments": [
    {
      "time": " 25 April, 2005 - 8:28pm",
      "content": "Friz Quadrata.\n\n"
    },
    {
      "time": " 25 April, 2005 - 8:46pm",
      "content": "::headdesk:: A pay-for font. Well, guess I'm vectoring it. I'll see if it's on the work computer tomorrow. ::crosses fingers::\n\n"
    },
    {
      "time": " 25 April, 2005 - 9:16pm",
      "content": "I've found a lookalike font: France. But the only place I see it at wants me to \"buy\" this free font for ten dollars with 8000 other fonts. (I seriously don't need that much clutter, and neither does our work computer)\n\n"
    },
    {
      "time": " 25 April, 2005 - 9:23pm",
      "content": "Or you can get the real thing for $22   \n [http://www.fonts.com/findfonts/detail.htm?pid=203357](http://web.archive.org/web/20060525065631/http:/www.fonts.com/findfonts/detail.htm?pid=203357)   \nI have to ask: how much is your time worth?   \n   \nR\n\n"
    },
    {
      "time": " 25 April, 2005 - 9:50pm",
      "content": "I know you all think me a cheapskate for wanting a free font, but there's a good reason. One: I only get paid 6 an hour. Two: Our sign company is only three weeks old, and can't really throw money around. We don't know if we'll ever even use the font again (probably not), so I can't justify begging my boss to fork over 20 here and 12 there every time we need a font for a one-time use.   \n   \nRight now I don't care what \\*my\\* time is worth, I just want to get the job done. So please don't think less of me, I'm trying to be economical.\n\n"
    },
    {
      "time": " 25 April, 2005 - 10:22pm",
      "content": "A sample in the old Phil's Photo catalog from the early '80s shows that there were two g's available in that weight, including the one in the logo above.\n\n"
    },
    {
      "time": " 26 April, 2005 - 7:06am",
      "content": "The FontBank version (just $2) called ['Quid'](http://web.archive.org/web/20060525065631/http:/www.buyfonts.com/value_for_money/quid.htm) has this same 'g'. It's quite possible this is what they used, since it's the only bold digital version I know like this.\n\n"
    },
    {
      "time": " 26 April, 2005 - 8:56am",
      "content": "Hi Conna,   \n   \nI actually don't think you are a cheapskate or think less of you. I also am not intending to make a big deal out of nothing, but I have found myself in the same quandry when running my small business.   \n   \nIn your reply you suggest the cost of the fonts should be footed by:   \n1: You (One: I only get paid 6 an hour)   \nor   \n2: Your Fledgling Company (Two: Our sign company is only three weeks old, and can't really throw money around/I can't justify begging my boss to fork over 20 here and 12 there)   \n   \nI have to remind myself that the person who should pay for the font license is my client. Certainly a painter passes on the cost of their paint. My fear is always that I will lose business because my estimates will go up, but this hasn't been the case.   \n   \nMy two cents, which in this case is a moot point since Mike has miraculously produced a two cent verson with the correct g.   \n   \nCheers,   \nRandy\n\n"
    },
    {
      "time": " 26 April, 2005 - 3:38pm",
      "content": "Randy:   \n   \nWell, ordinarily we would charge the client for the font, but in this case the client is us. The signmaking company is one of two businesses owned by my boss, the other being an outfitter that sells small camper-trailers and personal watercraft like the CraigCat. Thus our need for the font so we can put the logo up on our sign out front.   \n   \nBut, point is now doubly moot, since the boss-man has decided the font's worth it, because we'll be doing boat letter decals in that font to match.\n\n"
    },
    {
      "time": " 26 April, 2005 - 7:47pm",
      "content": "And here I thought I gave up being an idiot.   \n   \n:-)\n\n"
    }
  ]
}
