{
  "id": "105623",
  "title": "Announcing LTC Italian Old Style Pro from the Lanston Type Company",
  "forum": "Home",
  "tags": [
    "Frederic Goudy",
    "Italian Old Style",
    "Lanston",
    "News",
    "Nicholas Jenson",
    "serif"
  ],
  "content": " ![](http://web.archive.org/web/20150322012214im_/http:/typophile.com/files/italoldpro-news-sm-_3503.png)\n\nLTC Italian Old Style was originally released by P22/Lanston Type Company in 2006. The font, based on Frederic Goudy's interpretation of Nicholas Jenson's Roman face as well as other Renaissance Roman faces, has been newly updated by James Grieshaber for the [Lanston Type Company](http://web.archive.org/web/20150322012214/http:/www.p22.com/lanston/). [LTC Italian Old Style Pro](http://web.archive.org/web/20150322012214/http:/www.p22.com/lanston/italianoldstyle.html) is now offered as a pro font family containing 4 styles- Regular, Italic, Light and Light Italic. OpenType features include the original ligatures, small caps and expanded language coverage. The Roman styles, Regular and Light, also welcome the addition of ornaments.\n\n[LTC Italian Old Style Pro](http://web.archive.org/web/20150322012214/http:/www.p22.com/lanston/italianoldstyle.html)\n\nItalian Old Style, designed by [Frederic Goudy](http://web.archive.org/web/20150322012214/http:/www.p22.com/lanston/designers.html) in 1924, was digitized by Paul Hunt in 2007. In 2013, it has been updated by James Grieshaber and is now offered as a pro font. The newly expanded pro font includes all of the original ligatures, plus small caps and expanded language coverage in all 4 pro styles- Regular, Italic, Light and Light Italic.\n\nLTC Italian Old Style is not to be confused with the English Monotype font also called \"Italian Old Style\", which is an earlier design from 1911 based on William Morris's Golden Type that is based on [Nicholas Jenson's](http://web.archive.org/web/20150322012214/http:/www.p22.com/lanston/designers.html) Roman face. Goudy went back to Jenson's original Roman and other Renaissance Roman faces for his inspiration and the result is what many consider to be the best Renaissance face adapted for modern use.\n\n[Bruce Rogers](http://web.archive.org/web/20150322012214/http:/www.p22.com/lanston/designers.html) was one of the biggest admirers of Italian Old Style and designed the original specimen book for Italian Old Style in 1924 using his trademark ornament arrangement. These ornaments are now contained in the pro versions of the Roman styles- Regular Pro and Light Pro.\n\nThe light weights of LTC Italian Old Style were digitized from larger display sizes (14, 18, 24, 30, 36 pt) and the regular weights were digitized from smaller composition sizes (8,10,12 pt.). The fitting for the regular weights is noticeably looser to allow for better setting at small sizes. Very few font revivals take this approach.\n\nThe LTC Italian Old Style Pro Family is being offered at a very special introductory price through August 31st. More details here:\n\n[LTC Italian Old Style Pro](http://web.archive.org/web/20150322012214/http:/www.p22.com/lanston/italianoldstyle.html)\n\n",
  "author": "jimy",
  "time": "19 Aug 2013 — 11:23am",
  "uid": "5133",
  "comments": [

  ]
}
