{
  "id": "105692",
  "title": "How can I manage this weird typographic palette?",
  "forum": "General Discussions",
  "tags": [
    "contemplative",
    "fonts",
    "friendly",
    "General Discussions",
    "H&FJ",
    "House Industries",
    "quirky",
    "sans-serif",
    "serif",
    "serious",
    "slab-serif",
    "type"
  ],
  "content": "Hello everybody,\n\nI've been reading a lot about typefaces and how different kinds can be combined in order to create layers of meaning. Type foundries usually suggest pairings for their own fonts, most notably Hoefler & Frere Jones and Font Bureau. I am looking to create an unusual mix of moods for a personal branding project:\n\n- Hearty, friendly  \n- Weird, quirky  \n- Contemplative, dramatic\n\nYou can think of this mix as the equivalent of a Wes Anderson, Sylvain Chomet, or even a Spike Jonze film. Sort of like what film critic Peter Rainer writes about Spike Jonze's film, Being John Malkovich:  \n“It is hard to mix moods -- the film is manic, subtle, comic and vaguely sad -- but [Jonze] does it masterfully.”\n\nI looked at a lot of high-quality typefaces, one of which is H&FJ's Sentinel. I think it has that (hearty, friendly) edge to it alright, but I am looking to mix it up with other typefaces in order to give it those other layers I want to incorporate. Check out my attached file to see a sample letterhead for Sentinel. I feel that Sentinel is a good text font, but I am open to other suggestions. Whatever your other options are, I also want your thoughts on how I can keep it all consistent on printed as well as web platforms.\n\n| Attachment | Size |\n| --- | --- |\n| [letterhead.jpg](http://web.archive.org/web/20150419232443/http:/typophile.com/files/letterhead_0.jpg) | 181.28 KB |\n\n",
  "author": "omfaonline",
  "time": "21 Aug 2013 — 7:39am",
  "uid": "205098",
  "comments": [
    {
      "time": "21 Aug 2013 — 11:10am",
      "content": "So far, this is the opposite of weird and quirky.  \n [Turnip](http://web.archive.org/web/20150419232443/http:/www.fontbureau.com/fonts/turnip/) is a better choice than Sentinel, IMHO.  \nCheck out the contrasts as it is used for [Perka](http://web.archive.org/web/20150419232443/http:/getperka.com/).\n\nI think you have to go to such extremes to create contrast with a slab serif face, because they are so strong that the usual serif vs. sans method doesn’t work.\n\n"
    },
    {
      "time": "21 Aug 2013 — 1:20pm",
      "content": "Thank you for your reply Nick.  \nPerhaps Sentinel isn't weird/quirky on its own, but I was hoping to add a font or two to it in order to get the layers I want. I'm thinking of it like an x + y = z type of equation.  \nAlthough it sounds weird, I was thinking of using Century Schoolbook (or Grad) for the body text, Trade Gothic Bold Condensed for sub-headers, and (Futura Extra Bold??) as my main name font. Any thoughts on that?\n\n"
    },
    {
      "time": "22 Aug 2013 — 6:49am",
      "content": "> Turnip is a better choice than Sentinel, IMHO.  \n> Check out the contrasts as it is used for Perka.\n\nActually, I don’t think Perka is using any Turnip, Nick. That mostly looks like variations of Freight.\n\nFreight Micro (as in the logotype) is easily confused with Turnip, especially in lower-res environments.\n\n"
    },
    {
      "time": "22 Aug 2013 — 10:33am",
      "content": "Thanks Kent.\n\n"
    },
    {
      "time": "22 Aug 2013 — 1:05pm",
      "content": "Your descriptions makes me think of Emigre typefaces.\n\n"
    }
  ]
}
