{
  "id": "10564",
  "title": "PDF is dead, long live PDF",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Microsoft just now put up a spec and other info for [Metro](http://web.archive.org/web/20051109112721/http:/www.microsoft.com/whdc/device/print/metro_FAQ.mspx), their new document format. I haven't had a chance to read the specs carefully yet, but I will be over the next few days, as this is potentially an important subject for my work. Things certainly promise to get interesting in the document format world.\n\n",
  "author": "raph",
  "time": "25 April, 2005 - 11:49pm",
  "uid": "4406",
  "comments": [
    {
      "time": " 26 April, 2005 - 12:11am",
      "content": "Can something written in XML really rival Postscript for sofisticated WYSIWYG printing?   \n   \nWhat about font embedding? document signing, user notes, zoom (free scaling) etc?   \n   \nMicrosoft tried and failed to unseat PDF with the e-book format. Metro does sound scary - that its free, like IE was free back in the 1st browser wars. It will probably be tied to MS Office Suite for authoring, or any office suite for that matter, since its nuts and bolts are available to all.   \n   \nhttp://www.infoworld.com/article/05/04/25/HNmetro\\_1.html\n\n"
    },
    {
      "time": " 26 April, 2005 - 12:28am",
      "content": "ed: at the syntactic level, being based on XML vs. the Forth-like stack language in PostScript is pretty much a wash. It will no doubt result in large files and take lots more memory to run, but what else is new? Also keep in mind that PostScript hasn't seen any new development for about six years; Adobe's been putting their resources into PDF instead.   \n   \nMetro is definitely resolution independent, being based on the Avalon imaging model.   \n   \nI don't yet have authoritative answers to your other questions, but from what I've seen so far I would be _very_ surprised to see Metro lack any significant and useful feature present in PDF.\n\n"
    },
    {
      "time": " 26 April, 2005 - 12:58am",
      "content": "Thanks Raph, probably in future we well see Acrobat's price drop? yay! ... then developers or designers dealing with 2 standards ... hohum ...   \n   \nBut I think Microsoft is after the \"electronic paper\" for businesses and goverment market (secure forms etc) rather than DTP market. DTP market is too small for MS and they don't sell the precision authoring tools for those.   \n   \nVery exciting news this, battle of the goliaths? ![:-)](http://web.archive.org/web/20051109112721im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n(sorry for my english tho ;))\n\n"
    },
    {
      "time": " 26 April, 2005 - 6:56am",
      "content": "\"Can something written in XML really rival Postscript for sofisticated WYSIWYG printing?\"   \n   \nXML is just a descriptive language like Postscript. XML is just a container for data, so I imagine the document format can be as elaborate as the data entered. (SVG is all xml based too).   \n   \nI agree with Ed, MS (nor adobe, really) are currently after the DTP market. They're after the enterprise document management market. The one advantage of PDF is that is has a rather strong following outside of Adobe (Ghostscript, etc.) and the one advantage of MS's offering is that it's XML based...but there can be a big difference between XML and 'MS' XML. ;o)\n\n"
    },
    {
      "time": " 26 April, 2005 - 9:03am",
      "content": "Perhaps this is related to Adobe's acquisition of Macromedia? In that Adobe may integrate PDFs and Flash to create a more flexible PDF online, etc. to keep this MS offering at bay.   \n   \nI always worry when one company has far-and-away dominance, but I get an extra chill with MS, since they're OS producers (and therefore biased towards their own environment). I admit, I hope it flops just so I don't have to deal with its inevitable rancor on other OSes.\n\n"
    },
    {
      "time": " 26 April, 2005 - 10:05am",
      "content": "Does anyone here have Office XP \"Small Business Edition\"? The Metro spec is in Microsoft Office Document Imaging format, which is fairly obscure. If someone could convert that into PDF for me, it would be a mitzvah. Send mail to \\<firstname\\>.\\<lastname\\>@gmail.com to coordinate.\n\n"
    },
    {
      "time": " 26 April, 2005 - 10:29am",
      "content": "Sure Raph, I'll send it to [Raph.Levien@gmail.com](mailto:Raph.Levien@gmail.com) in a few minutes.\n\n"
    },
    {
      "time": " 26 April, 2005 - 10:38am",
      "content": "Sent. Let me know if you don't receive it.\n\n"
    }
  ]
}
