{
  "id": "105659",
  "title": "So... I am designing a corporate logo with Helvetica Neue Bold and a script...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Long story short... the web team began working on a sub-brand with a sales/marketing consultant and suddenly, I see a pretty sophomoric usage of Helvetica Neue (our corp. typeface) and a free script typeface running around the Blog, and a few email blasts.\n\nI want to present an alternative since it's seems like it's in the early stages. This will include an entirely different concept, but out of respect and play politics... I'm going to also present a version with Helvetica Neue Bold and a scripted typeface.\n\nMy explorations have landed me with this selection:  \n [Calgary Script](http://web.archive.org/web/20150425045440/http:/www.myfonts.com/fonts/sudtipos/calgary-script/) by Sudtipos.\n\nIf you happen to have any other suggestions, I'm totally game. The most challenging bit about it all is that these items are being used along side a logo that uses Helvetica Neue Bold with a lock up of Helvetica Neue Medium. I have made something similar in the PDF so I can protect the integrity of the company.\n\n| Attachment | Size |\n| --- | --- |\n| [possibles.pdf](http://web.archive.org/web/20150425045440/http:/typophile.com/files/possibles.pdf) | 319.38 KB |\n\n",
  "author": "theplatypus",
  "time": "20 Aug 2013 — 11:12am",
  "uid": "35061",
  "comments": [
    {
      "time": "20 Aug 2013 — 12:41pm",
      "content": "As you can see... they're all pretty horrible. How am I going to bring the brand back on track?\n\n"
    },
    {
      "time": "20 Aug 2013 — 1:22pm",
      "content": "I like the second and third choices. You just need to use a script that doesn't clash with the proportions of Helvetica.\n\n"
    },
    {
      "time": "20 Aug 2013 — 1:42pm",
      "content": "Thanks for the feedback.  \nThe first image is the actual logo sub-brand.  \nThe second is the original \"Blog\" logo, which I am trying to change. I've actually kerned it, as it was pretty horrible before.  \nCounting down from the original, I feel the 3rd (the italics one) is the strongest:  \n [Halvorsen Pro Extra Bold Italic](http://web.archive.org/web/20150425045440/http:/www.myfonts.com/fonts/australiantype/halvorsen-pro/)\n\nHopefully I can at least, get this signed off on. We'll see if the other concept gets traction.\n\n"
    },
    {
      "time": "20 Aug 2013 — 4:19pm",
      "content": "[deleted - I think I misunderstood the original post]\n\n"
    },
    {
      "time": "21 Aug 2013 — 1:11am",
      "content": "Some of these look like they are getting there but something done by hand would probably create a greater harmony of the elements, rather than trying to make something fit the purpose.\n\n"
    }
  ]
}
