{
  "id": "105632",
  "title": "Sit Up Front: Unsolicited Advice for TypeCon Attendees",
  "forum": "amyp's blog",
  "tags": [
    "SoTA",
    "typecon"
  ],
  "content": "It’s [TypeCon Week](http://web.archive.org/web/20150317234522/http:/www.typecon.com/), which in the land of type geeks, means days and nights filled with typographic inspiration, scholarship and debauchery. Unless, like me, you’re not going to TypeCon this year. As my social media feeds fill with the hashtags, the inevitable filtered shots of Portland signage and the local typographic faux-pas, I’ll be watching enviously and refreshing my browser incessantly from the sidelines. For those of you who are about to embark on your TypeCon voyage, here is some unsolicited advice on what to do (and not to do) from a six-time offender.\n\n_On what to pack_\n\nDO: Pack a sweater. The temperature of the hotel conference hall is inversely proportional to the number of ampersand tattoos in the room. Bonus points if it’s a [KERN zip-up](http://web.archive.org/web/20150317234522/http:/marketplace.veer.com/merch/Kern-Zip-up-VPR0001260).\n\nDON’T: Pack pajamas. I’m pretty sure that sleep is not a part of the full TypeCon experience, so you won’t really be needing them. If parenting has taught me anything, it’s this: sleep is an optional activity in life and at TypeCon.\n\n_On how to make friends_\n\nDO: Hang out in the hotel lobby or bar to make friends. If you don’t know anyone at TypeCon, just listen for the folks foaming at the mouth about [W.A. Dwiggins](http://web.archive.org/web/20150317234522/http:/en.wikipedia.org/wiki/William_Addison_Dwiggins) and mumble something about the tension of the curves in Electra. You'll have yourself some instant BFFs.\n\nDON’T: Spend every break / lunch hour face-down buried in your phone thumbing through tweets. Starting a conversation with a random stranger is totally awkward but it’s in PORTLAND. This is your chance to MAKE IT WEIRD.\n\n_On presentation attendance_\n\nDO: Wake up early — oh wait, you didn’t really sleep, right? TypeCon organizers tend to cluster interesting presentations in the early morning hours, so set that alarm, inject some caffeine into your bloodstream and grab a seat up front.\n\nDON’T: Skip out on late afternoons or Sunday. Let’s face it: everyone needs a break now and then but don’t make the mistake of missing some quality presentations either. Take advantage of those well-timed coffee breaks and the luxuriously long lunchtimes to get some fresh air, check out the city and let your loved ones know you’re alive.\n\n_On deciding where to eat_\n\nDO: Eat lunch and dinner with other attendees. Some of the strongest relationships forged at TypeCon happen over food and drink. Find some folks in the lobby who look indecisive, check out the [TypeCon restaurant guide](http://web.archive.org/web/20150317234522/http:/www.typecon.com/download/typecon_restaurant_guide_2013.pdf) and ask to join them. Most people at TypeCon are overwhelmingly friendly. And hungry.\n\nDON’T: Skip a meal before the Type Quiz / Saturday night festivities. Just trust me on that one.\n\n_On signing up for the Type Crit_\n\nDO: Sign up for the Type Crit on Sunday. One of the highlights of my first TypeCon (2004) was the crit with John Downer, Akira Kobayashi, and Matthew Carter. I was a young grad student new to type design and knew \\*no one\\* at TypeCon before I got there. They were all extremely graceful and the experience proved to be highly useful, even if my stomach was in my throat while showing my in-progress work. That’s what crits are for.\n\nDON’T: Wimp out. You’ll regret not trying. Also, don’t steal the Type Crit sign. Not cool.\n\nFor those of you not attending this year, how do you survive the week? Live precariously through the [hashtag](http://web.archive.org/web/20150317234522/http:/typophile.com/wiki/https%3A/%252Ftwitter.com/search%3Fq%3D%2523typecon)? Watch Helvetica on Netflix? Cry into your pillow at night?\n\nHappy week, TypeCon! Make me jealous that I’m not there.\n\n",
  "author": "amyp",
  "time": "19 Aug 2013 — 8:56pm",
  "uid": "5664",
  "comments": [
    {
      "time": "21 Aug 2013 — 3:01pm",
      "content": "Thank you for encouraging people to skip Sunday -- the fewer people who see me make a fool of myself, the better. ;)\n\n"
    },
    {
      "time": "21 Aug 2013 — 5:53pm",
      "content": "No, Erik, missing Sunday was under the “DON‘T” category! Anyway, who‘d want to miss watching you make a fool of yourself? ;)\n\n"
    },
    {
      "time": "22 Aug 2013 — 11:48am",
      "content": "D’Oh! That’s what I get for reading quickly. Or maybe it was wishful thinking. ;)\n\n"
    },
    {
      "time": "30 Aug 2013 — 3:56pm",
      "content": "Hope you are enjoying the kids, Amy!\n\n"
    }
  ]
}
