{
  "id": "10568",
  "title": "Typeface research. Dyslexia.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "can anyone help me?   \n   \ni am currently trying to research the field of dyslexia and the   \ntypefaces available for dyslexic people. i was wondering if anyone   \nwould know where i would be able to obtain any information on what   \nwould be required to make the face more legible for a dyslexic   \nperson... what the lengths of the ascenders and descenders should be,   \nfor example, and how symetry effects the way the typrface is read.   \n   \nmany thanks,   \n   \nleigh middleton.\n\n",
  "author": "unitprodesign",
  "time": "26 Apr 2005 — 6:23am",
  "uid": "6504",
  "comments": [
    {
      "time": "26 Apr 2005 — 6:33am",
      "content": "_\\> [www.readregular.com](http://web.archive.org/web/20150417143340/http:/www.readregular.com/)_\n\n"
    },
    {
      "time": "26 Apr 2005 — 6:35am",
      "content": "i know read regular, but i am interested in designing a face myself. i already have some research, but i want to know more about the specifics.\n\n"
    },
    {
      "time": "6 May 2005 — 2:12am",
      "content": "Gerrit Noordzij held a lecture on this specific subject. A transcript of his lecture was published under the title \"Das kleine Kind und die Schrift\" [(check the PDF).](http://web.archive.org/web/20150417143340/http:/www.typedu.org/read/english.html#theory) Unfortunately this book is out of print and in German language only.\n\n"
    },
    {
      "time": "6 May 2005 — 2:13am",
      "content": "sorry, wrong button. How do I erase this?\n\n"
    },
    {
      "time": "6 May 2005 — 5:58am",
      "content": "Hey, just finished a thesis on this....\n\nThere is quite a bit of information floating around on the internet, but what most people that try to approach this subject don't realize is that dyslexia is really just a blanket term for a wide variety of reading / writing disabilities. To really approach the problem, I would recommend narrowing your initial investigation to a limited number of manifestations of dyslexia (ie: letter-reversal, scotopic sensitivity, etc.). \"Read Regular\" for example really only addresses the issue of letter-reversal. And while there is little info available for the kinds of things you are looking for (x-height ratio, etc), I have found that the best method is still one-on-one testing with dyslexic individuals (in my case school children). I'm sorry that my thesis is not online yet, it should be once I solidify a distributor / publisher.\n\nHope that helps. Let me know if you have any more questions!\n\n"
    },
    {
      "time": "6 May 2005 — 9:11am",
      "content": "Hi Leigh,\n\nI took a pragmatic approach when designing the freebie Lexia Readable ( [www.k-type.com](http://web.archive.org/web/20150417143340/http:/www.k-type.com/ \"www.k-type.com\")) - common wisdom in UK education regarded Comic Sans to be the choice of font by/for people with dyslexia. I decided to base Lexia Readable on the shapes and spacing in Comic Sans, to try to retain its accessibility and friendliness, but to add a more contemporary, adult feel and lose the comic kiddiness so that adolescent and adult dyslexics might not feel patronized. I used the internet to research the preferred x height, the advised non-symmetry of characters, and the use of the simpler, handwritten forms of a and g for instance. However, after talking to and exchanging emails with dyslexic people, professionals and university lecturers I too began to doubt whether a single font could ever be one full and worthy response to the wide variety of conditions covered by the umbrella term dyslexia.\n\nEnjoy the journey!\n\nKeith Bates, K-Type\n\n"
    },
    {
      "time": "23 May 2005 — 12:39pm",
      "content": "I also fooled around with this for my Thesis project as well. What I found was that making certain characters different from each other in relation to shape (b, d, p, q, I, l, 1 for example) can help those with learning disabilities. Take a look at Spiekermann's ITC Officina and FF Info Display, as well as Clearview Highway, Parisine, Neuzeit, and even Thesis for some examples of this kind of idea. When I made my typeface for my Thesis project I made sure that all of the previously mentioned letterforms all had different shapes.\n\nAlso, I would study Cyrillic alphabets as well, I believe they might offer some potential ideas.\n\n"
    },
    {
      "time": "28 May 2005 — 4:27am",
      "content": "Hi Keith,\n\nthanks for the advice. i have also since realised that one typeface is not going to solve all of the problems a person with Dyslexia would face. However, it is still my belief that there is a need for more legible typefaces that are well designed, that we can all use to set type in, but that are also specifically for Dyslexics. It is, unfortunately, a shame that i have been unable to continue with this project, as my tutor at Bucks decided two weeks ago that it was not an appropriate project for the course. A little frustrating as i am a huge type enthusiast and a typographer by trade. Plus i have two or three sketch books of research. But, it is undoubtedly something i wish to continue with after my studies. Maybe i will apply to the design council for funding to research the project further? Who knows, but i have included a lot about Lexia in my research, and it is a very interesting face.\n\nThank you again,\n\nLeigh Middleton, UnitProDesign.com\n\n"
    }
  ]
}
