{
  "id": "105727",
  "title": "Seeking Cyrillic fonts with \"forked\" yat",
  "forum": "Design",
  "tags": [
    "Cyrillic; web",
    "Design"
  ],
  "content": "I'm looking for Cyrillic fonts that have a \"forked\" yat similar to the ones in Old Standard v2 or Linux Libertine. The intended use is for the web rather than print, so unfortunately that rules out a high-contrast face like Old Standard.\n\nI've already browsed all of the serif faces at [http://paratype.com](http://web.archive.org/web/20150425045637/http:/paratype.com/ \"http://paratype.com\") that supports 19th-century Russian orthography, and have also looked at just about everything at [http://free.type.org.ua/en/](http://web.archive.org/web/20150425045637/http:/free.type.org.ua/en/ \"http://free.type.org.ua/en/\"). The forked variant of the yat character seems to be pretty rare.\n\nLinux Libertine has a fairly neutral appearance that would be OK for the intended use, and the yat fits the pre-revolutionary feeling I have in mind. However, there's something about the high bar in the lowercase \"e\" that says \"not a traditional Cyrillic letter form\". So I wonder whether Libertine is considered to be a good or bad face for Cyrillic.\n\nSomething like Leksa would be great -- but as far as I can tell it lacks the yat variant I'm seeking (unless there's a stylistic variant that's not shown in the glyph maps).\n\nAny opinions welcome. Thanks!\n\n",
  "author": "adger",
  "time": "22 Aug 2013 — 3:44am",
  "uid": "214214",
  "comments": [
    {
      "time": "27 Aug 2013 — 10:17am",
      "content": "Nick Shinn's Scotch Modern has a forked yat.\n\n"
    },
    {
      "time": "27 Aug 2013 — 10:59am",
      "content": "Thanks John.  \nI was going to mention that, but Adger had ruled out high-contrast faces.\n\nBut if this is for the Web, perhaps Scotch Micro might not be too bad:  \n [http://www.fontspring.com/fonts/shinntype/scotch-modern](http://web.archive.org/web/20150425045637/http:/www.fontspring.com/fonts/shinntype/scotch-modern \"http://www.fontspring.com/fonts/shinntype/scotch-modern\")\n\n"
    },
    {
      "time": "28 Aug 2013 — 11:15am",
      "content": "Ah. I didn't register the comment about high contrast typefaces. But the forked yat is very much of that style, and will be much less common in other styles.\n\n"
    }
  ]
}
