{
  "id": "105777",
  "title": "Licensing and the future of type design - dissertation",
  "forum": "General Discussions",
  "tags": [
    "commercial",
    "Dissertation",
    "economics",
    "font licensing",
    "General Discussions",
    "litigation",
    "type design"
  ],
  "content": "Hi!\n\nI'm currently working on a final year dissertation on the subject of type design and the legal framework/ins and outs of utilising typefaces and fonts, and was looking to get some broad insights from people in the Typophile community.\n\nThe question is as follows:\n\n> Given the current commercial and legal environment for typography, what scope is there to simplify licensing to facilitate the broader use of type?\n\nThis is particularly with regard to having to stipulate all the font usages in advance when there are many unforeseen elements within the design process, and also a simplification for use by non-designers might help access a new market (purchasing as a commodity - essentially license free with the aim of reducing piracy?)\n\nI'm also looking into whether a global agreement about copyright and protection of the designs is feasible - at least to get closer to an international accord as both European and US regulation varies.\n\nThanks for all your help in advance!\n\nHugo\n\n",
  "author": "Hugo Raymond",
  "time": "24 Aug 2013 — 9:16am",
  "uid": "211155",
  "comments": [
    {
      "time": "24 Aug 2013 — 10:23am",
      "content": "Hi HARaymond. Welcome to Typophile. Regarding your research, when using Typophile please be sure to cite it properly:\n\n1. Provide an in-text citation every time you cite someone or something, regardless of how many instances there are.\n\n2. In your references, regardless of how many times you have cited the same person, you only need a reference for each group of citations by year. Provide another reference should you cite the same person from a different year — which is not uncommon for long threads. Below is an example of four in-text citations which span a two year period, which only require two references:\n\n————\n\n**In-text citations**\n\n“This is the first quote or passage.” (Dean, 2008, September 7, Page 8, 17:33).\n\n“This is the second quote or passage.” (Dean, 2008, December 22, Page 9, 09:02).\n\n“This is the third quote or passage.” (Dean, 2009, January 6, Page 9, 17:45).\n\n“This is the fourth quote or passage.” (Dean, 2009, January 11, Page 11, 12:22).\n\n**References**\n\nDean, C. T. (2008). Re: Thread title [Online forum comment]. Retrieved from [http://typophile.com/node/101331](http://web.archive.org/web/20150122023035/http:/typophile.com/node/101331 \"http://typophile.com/node/101331\")\n\nDean, C. T. (2009). Re: Thread title [Online forum comment]. Retrieved from [http://typophile.com/node/101331](http://web.archive.org/web/20150122023035/http:/typophile.com/node/101331 \"http://typophile.com/node/101331\")\n\n————\n\nI also recommend using youe real name as your screen name.&nbsp;Let’s say you were citing Chris Lozos. You make the appropriate in-text citation (Lozos, C. 2000) and reference, but, when the reviewer goes to check the URL, all they will see is a screen name — dezcom, and they may be unable to validate your source. If a reviewer can’t validate your source they may not let it be published, and you would have to remove content, citation, and reference entirely. In addition to this, you will find you get greater feedback if you use your real name.\n\nYou will also find that you get greater feedback if you show what you have already come across in your own research up to this point, as it will help narrow things down for those whose assistance you are seeking.\n\nI would encourage using input from an online forum as a starting point to assist you in finding a primary source. Traditionally, in academia, references to anecdotal information (things unpublished) tend to carry less weight then published references.\n\nBe mindful that&nbsp;a failure to properly cite and reference any source, even an online forum, is&nbsp;plagiarism.\n\n(Where do you study, and are you in an undergraduate, graduate, or PhD program?)\n\n"
    },
    {
      "time": "25 Aug 2013 — 12:48pm",
      "content": "Hi Chris,\n\nThanks very much for the information regarding the citation.  \nI was originally wanting to highlight the question which was why I used the cite HTML tag as you can't use the bold tag. I'll also include my full name in my profile so as to give greater credibility too. I was hesitant to include any further research I'd done so as not to influence the responses and get the broadest insight possible, which I could then debate further once people had replied to the thread. Also, I've tended to realise that long introductions to projects in a quest for answers on forums, often puts people off responding!\n\nIn response to your question I'm currently preparing the 6,000 word dissertation for my final year of my BA in Graphic Design at Ravensbourne College of Design and Communication in London, UK.\n\nThanks again,\n\nHugo\n\n"
    },
    {
      "time": "26 Aug 2013 — 12:36am",
      "content": "My “real name recommendation” is for screen names, not just profile names, so when someone cites someone (or tries to cite you) they can be found. For example, if I were to reference you from this post, it would read:\n\nRaymond, H. (2013). Re: Licensing and the future of type design [Online forum comment]. Retrieved from [http://typophile.com/node/105777](http://web.archive.org/web/20150122023035/http:/typophile.com/node/105777 \"http://typophile.com/node/105777\").\n\nHowever, when a peer reviewer goes to check the reference prior to publication, they will follow that link, and only see HARaymond. If there are hundreds of comments, a reviewer will certainly not click everyone’s handle to check their profiles in search of their real name. If a reference can’t be validated, the authour will be asked to remove it and edit their content appropriately. A good practice to adopt and one that I would recommend to elicit greater feedback as well.\n\nThe bold tag (without the spaces so it can be read) = \\< s t r o n g \\> w o r d \\< / s t r o n g \\> = **word**.\n\nAdditional tags can be seen below the Comment box.\n\n"
    },
    {
      "time": "26 Aug 2013 — 5:35am",
      "content": "Thanks **Chris!**\n\n"
    },
    {
      "time": "26 Aug 2013 — 7:27am",
      "content": "Hugo, competitive forces work against uniformity in licensing, so I suspect you will find your answer is 'no'. People are aiming at different market segments, and trying different business models, and this diversity is reflected in different license agreements. Currently, for example, people a doing different things in the area of web fonts.\n\nIn technical standards, there is a strong force for unity to make fonts work on all browsers and machines. But in licensing there is no competitive advantage gained by uniformity, so I don't see why that should happen, unless it turns that a single model is the most profitable. Given that there are different aspects of the market, I doubt that.\n\nThe folks to talk with are the heads of foundries, including both independents and group shops, and the few lawyers (like Frank Martinez), who are really knowledgeable in this area.\n\n"
    },
    {
      "time": "26 Aug 2013 — 9:03am",
      "content": "Licensing does not effect how broadly type is used. Hardware manufacturers provide freely licensed fonts with their new devices.\n\nCertainly, texting has become more popular than speaking, on cell phones, but font licensing was not a factor in this.\n\nWhen Apple pioneered DTP, the company established credibility by licensing fonts such as Times and Helvetica, and distributing them bundled with the Laserwriter. That did indeed encourage the broader use of type.\n\n"
    },
    {
      "time": "26 Aug 2013 — 10:45am",
      "content": "\\> a reviewer will certainly not click everyone’s handle to check  \n\\> their profiles in search of their real name.\n\nCouldn't you just list both the screen name and real name in the reference? Something like \"John Smith, posting as JSmith35\".\n\nThe American Psychological Association style guide says: \"In blog posts, authors may adopt a screen name. Use that screen name as the author if that is the name under which that person posts messages.\" And the MLA style guide says: \"It is acceptable to include screen names as author names; however, if both an author name and screen name are available, place the author’s name in brackets.\"\n\n"
    },
    {
      "time": "26 Aug 2013 — 1:03pm",
      "content": "You’re correct, using both names _is_ acceptable, but it looks a little clunky, and makes things more difficult for the reviewer. I have heard academics complain of this first hand. I’ll make the same point again, seeing a real name as a screen name adds credibility to posts and the community, and has been my experience that they elicit greater and more serious feedback. At a glance whose research do you take more seriously and are likely to acknowledge with a thoughtful reply: “BTilly” or ”Benjamin Tillman?”\n\nBack on topic, @Hugo Raymond: A few older Typophile threads. While not directly related, there are most certainly some people with a great deal of experience in the field who could help point you in the right direction.\n\n[The Licensing and Price of Web FontFonts](http://web.archive.org/web/20150122023035/http:/typophile.com/node/67790), (RahimSnow, 2010).  \n [FontFont introduces a brand new license: App+](http://web.archive.org/web/20150122023035/http:/typophile.com/node/104910), (Ivo, 2013).  \n [Font licensing questions](http://web.archive.org/web/20150122023035/http:/typophile.com/node/103996), (Kejtia13, 2013).  \n [Webfont Licensing etc, 3 years later](http://web.archive.org/web/20150122023035/http:/typophile.com/node/102980), (vernon adams, 2013)  \n [Petition for a sane EULA](http://web.archive.org/web/20150122023035/http:/typophile.com/node/100259) (karasu, 2013).\n\nThe links are in no particular order. Checking commenter’s profiles to see how long they have been a member of the community may help focus your contact list.\n\n"
    },
    {
      "time": "8 Nov 2013 — 7:15pm",
      "content": "I would have not been able to complete my research on time without having someone that can help writing a paper, so I hired Smart Custom Writing. You can [click for more info](http://web.archive.org/web/20150122023035/http:/www.smartcustomwriting.com/writing-help) regarding this professional writing services.\n\n"
    },
    {
      "time": "13 Nov 2013 — 4:51am",
      "content": "Many Gulf Coast consumers are finding themselves not only traumatized by the ravages of Hurricane Isaac last week, but are also facing serious financial strain in the aftermath of storm damages. Sadly, this can be a situation that a particularity low form of scammer seeks out. These so-called \"storm chasers\" unscrupulously pick the pockets of people when they are at their most vulnerable. And the storm season is far from over. If you need help paying for emergency fixes, get an installment loan.See more at:  \n [https://personalmoneynetwork.com/](http://web.archive.org/web/20150122023035/https:/personalmoneynetwork.com/ \"https://personalmoneynetwork.com/\")\n\n"
    },
    {
      "time": "19 Jun 2014 — 1:00pm",
      "content": "At first thanks for this post with the topic citation and global copyright agreement.\n\n"
    },
    {
      "time": "26 Dec 2014 — 5:17am",
      "content": "A book store where books are wrapped in paper with short descriptions so no one will 'judge a book by it's cover' It’s appropriate time to make some plans for the future and it is time to be happy. I have read this post and if I could I wish to suggest you few interesting things or advice. you might want to check out [http://www.billigforbrugslaan.dk/hurtig-laan/](http://web.archive.org/web/20150122023035/http:/www.billigforbrugslaan.dk/hurtig-laan/ \"http://www.billigforbrugslaan.dk/hurtig-laan/\")\n\n"
    }
  ]
}
