{
  "id": "10573",
  "title": "Evert Bloemsma",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "Evert Bloemsma, 1958-2005   \n   \n ![evert_bloemsma](http://web.archive.org/web/20150321090631im_/http:/www.typophile.com/forums/messages/72/70814.jpg)   \n   \nBy historical standards, the FontFont library is a young library. Most of the designers behind it were still at school when digital type started to free type design and production from its industrial constraints and the division of labour. Among those young designers, Evert Bloemsma was one of oldest and most experienced. He digitized his first typeface at URW in 1987, still on a big mainframe computer. The FontFont library released all his idiosyncratic faces: FF Balance (1993), FF Cocon (1998/2001), FF Avance (2000), FF Legato (2004). All of Evert's work was concerned with finding new answers to the old challenges of reading under various circumstances, in different media. FF Legato has already been praised not only as his most mature design to date, but also as a radical new way of designing the white space, paying as much attention to counter shapes as to the black marks on the page.   \n   \nIn his prime and at the height of his profession, Evert died suddenly at his home in Arnhem, Netherlands on Friday, 22 April. His friends and colleagues at FSI will miss him as a friend and as a contributor. We all owe Evert a lot.   \n   \nJan Middendorp knew Evert well. He wrote this earlier today:   \n   \nOf all the type designers I have known and have written about, Evert had the most complex personality, and possibly the most original mind and the weirdest sense of humour. He kept promising me, with his characteristic mixture of boyish enthusiasm, solemn dedication and self-mockery, that he would one day cover the entire distance between his home in Arnhem and mine in Ghent on his reclining bike. I was sure he'd make it, sooner or later - he always carried out his plans, although some took him ten years to complete. It fills me with grief, wonder and anger that Evert, who was always advocating exercise and healthy food, has now been taken away from us because of a heart failure.   \n   \nAs a type designer, Evert was unorthodox, a true original. Each of his four type families was the outcome of a highly personal investigation, a challenge to himself. To others, he could be as demanding as his was to himself; when criticizing his friends' typographic work, he was brutally honest and always to the point. Yet he remained amazingly modest, even insecure, about his own work, and deeply grateful to those who would comment on the early versions of his typefaces and/or test them in print. In spite of the single-mindedness with which he worked on his type designs during those months of total concentration, he was open to many other intellectual stimuli. He had worked as a photographer of architecture - constructing his own hand-operated panoramic camera, interviewed the designers he admired (such as Wim Crouwel and Hans Reichel) about their design philosophy, and lately became fascinated by the work of Marshall McLuhan. His lectures and articles, too, were evidence of his original ideas on form and on reading.   \n   \nIt is a great loss indeed.   \n   \nErik, Joan & Petra for FontShop International\n\n",
  "author": "eriks",
  "time": "26 Apr 2005 — 9:28am",
  "uid": "1042",
  "comments": [

  ]
}
