{
  "id": "105798",
  "title": "Anaysis of Typography used in Childern's Book .",
  "forum": "Design",
  "tags": [
    "chidren",
    "kids",
    "Young",
    "Design"
  ],
  "content": "Clean, legible typography. That's what I always learned and I still believe it to this day. I've started to look at children's books, specifically very young children (2 - 7), and the kind of typography used in them. I'm coming to the conclusion that most children's book authors don't ever consult with a designer or typographer.\n\nI'm aware that you're dealing with an immature audience but is that an excuse to use illegible type? I think not. Perhaps I'm missing something. One of the reason I'm here is to find out if I am.\n\nI decided to embark on a very quick redesign of the cover of \"The Trouble With Chickens\" as an experiment. I used H&FJ Knockout.\n\nThe cover on the left is the original. Take a look at the word 'Trouble\". Why is it written like it's having a seizure? Do you think that is supposed to be representative of the action behind the word? I admit that if you're having a seizure you're in trouble, but that's still no excuse for illegible typography.\n\nMy redesign certainly isn't production-ready but it tries to communicate that simplicity is more legible the stylized \"Children's type\".\n\nWhat are your opinions?\n\n ![](http://web.archive.org/web/20150425143510im_/http:/typophile.com/files/reD_5342.jpg)\n\n",
  "author": "JinWook",
  "time": "25 Aug 2013 — 1:35pm",
  "uid": "75314",
  "comments": [
    {
      "time": "25 Aug 2013 — 2:18pm",
      "content": "I like the playfulness of the original, and the yoke text block adds visual depth.\n\nI don't think it's illegible at all.\n\nSomewhat dated ...yes. But the typography pairs well with the rendering of the images. Which is also somewhat dated.\n\n"
    },
    {
      "time": "25 Aug 2013 — 3:56pm",
      "content": "Agree with 5star. You wouldn't want to set text in those fonts, but for a few words on a cover I think they work fine and create a fun, lively feeling.\n\n"
    },
    {
      "time": "25 Aug 2013 — 4:06pm",
      "content": "What makes you think that children can't read the playful \"Trouble\" on the cover? Providing they can read at all, I would bet that they will have no problem with it. For example, their handwriting is usually very irregular, and they can read it!\n\nAs James M. notes, ease of reading extended text is another matter, but as display, children are perfectly capable of reading a few words playfully written. If you doubt it, just test this on a number of children, vs. your revision.\n\n"
    },
    {
      "time": "25 Aug 2013 — 6:45pm",
      "content": "For the cover of a children's book there is a definite conflict of target audiences. Do you go for legibility for the child or do you add some pizzazz to look good on the bookstore shelf to the adult who is the actual buyer? I have no trouble with some compromise on the cover.\n\nWilliam Berkson, the target audience of readers mentioned by the original poster is ages 2 to 7. This is a group, at the lower end, that is just starting to become aware of the significance of letters. Thus, the need for legibility, which is most important for those who have not quite figured it out yet. Have you done much typographic testing with the three year olds? It's very tough.\n\n"
    },
    {
      "time": "25 Aug 2013 — 7:02pm",
      "content": "According to [Renaissance Learning](http://web.archive.org/web/20150425143510/http:/www.arbookfind.com/bookdetail.aspx?q=143328&l=EN&slid=404857521), this book is likely to be appropriate for kids in kindergarten through third grade. In kindergarten and first grade, it's probable that it would be an adult reading to the child, so your point about legibility for children may not apply. Children can, however, be attracted to fun type treatments. Children's interest in writing their names different ways, for instance, attests to this.\n\n\"I'm coming to the conclusion that most children's book authors don't ever consult with a designer or typographer.\" I don't know what the author has to do with this. Children's books are not designed by their authors, any more than other books are.\n\nAbout your redesign — putting the title in all caps would likely make it _less_ legible than the original design. And changing a fairly straightforward, if bumpy, typeface for the author into an elaborate swash italic definitely doesn't help.\n\nBesides which, the aesthetic is all wrong. Your typefaces don't go with the style of the illustrations. There's nothing playful or \"troubling\" about the faces you chose.\n\n"
    },
    {
      "time": "26 Aug 2013 — 12:32am",
      "content": "> Children's books are not designed by their authors, any more than other books are.\n\nBigger authors sometimes influence their work in this way, the design of the book being a process of consultation. In the case of Oliver Jeffers, most of his books use his handwriting for the interior text.\n\n"
    },
    {
      "time": "26 Aug 2013 — 1:41am",
      "content": "Interesting responses, thank you all.\n\n"
    },
    {
      "time": "26 Aug 2013 — 4:27am",
      "content": "Matt, I was thinking about your topic a lot lately. It is a difficult one, because while the books are meant for children, they are bought and read by older persons, usually.  \nI am very annoyed by the typefaces I meet in the books I read to my toddler. The kids usually look at the illustration, while the person who reads - at the text. I really have difficulties with the readability of the body text. Kids do not care about letters so much at this age, but they may be attracted by them. So, in the original cover of your posted image, the text is more close to the theme then in your redesigned cover, which is toooo serious for a 2 to 7 years old child. I agree with previous comments. The whole point is to look at the typeface from many points of view. I understand your desire for a clean typeface, but the playful note from the kid's world shouldn't disappear.  \nI had a chance to discuss with some publishers and asked them how they choose the typeface (in my case the Greek one). They answered that the final goal is to find a similar Greek typeface with the original English or French... I had in mind to talk to some of them about it. So if you want, I could ask who is choosing the typeface in the first place and based on what criteria.  \nAre you interested in the legibility of the cover's typeface or the readability of the body text?\n\n"
    },
    {
      "time": "26 Aug 2013 — 6:46am",
      "content": "\\>ages 2-7\n\nI overlooked that, sorry. In that case, the typography is mainly for the adults who read the book to the child. But at the upper end, I still don't think the 'trouble' would present any significant extra difficulty for the child. We decipher letters by their structure, and the irregularities of baseline our brains, including children's brains, are easily able to filter out. It is only in extended text that uniformity becomes an important advantage. In display type—and a children's book may be display type even on the inside, if it has few words—the extra effort of filtering out irregularities is so minimal that it doesn't matter.\n\n"
    },
    {
      "time": "26 Aug 2013 — 7:29am",
      "content": "I've just remembered that while reading a book to my 2 years old son he asked me 'what this is', showing to the big letters (3rd image) \"THE END\". The funny thing is that afterwards I told him these are letters and named them, he made a game, trying to find words which begin with these letters. So maybe, in some way, typography does matter even for 2 years old kids:)  \nI should mention that this book is A3 format and \"THE END\" words are displayed on a such leaf. It was inevitable to attract anybody's attention.  \nI would say that flexibility could be the guide for the typography in the case of children's book. You never can predict children's behavior, so is futile to set rules... :)\n\nI inserted the original version, the French, and then the Greek.\n\n ![](http://web.archive.org/web/20150425143510im_/http:/typophile.com/files/10_couvoknew_6389.jpg)\n\n"
    },
    {
      "time": "26 Aug 2013 — 7:59am",
      "content": "I think you are all correct about the cover art typography but I struggle to work with highly stylized typefaces. They just all look terrible to me. Perhaps the styling of the word itself will appeal more to a small child than how the word reads. It's an important part of the book because if the child picks it up they will most likely ask their parents to buy it based on the cover. I don't think the cover art would influence the parents decision one way or the other quite frankly.\n\nOn the subject of the parents, I don't believe the typography is specifically for parents though. I'm leaning towards Gotham for the body copy typography. Although there's no chance a great typeface will win over a great illustration from a child's point of view, a children's book for me is still about learning to read and write through an entertaining story. I want to choose something very clear and geometric. I feel that it's important for a child to recognize the shapes of letters, when learning to read and write. The body copy typeface is slightly off topic, sorry.\n\nThanks again for everyone's input.\n\n"
    },
    {
      "time": "26 Aug 2013 — 10:31am",
      "content": "I think action words are awesome. In graphic design, a.k.a. typography, action words are given life by playful letter shapes. And since this book is an illustrated Children's book I would expect more lively rendered action words throughout the book.\n\nFascinating stuff comparing the original cover with your example.\n\nYou seemed to have assigned the typography and the illustration onto a two column grid ...to me that is very interesting indeed. Even within the lower text block you have center aligned the text, whereas in the original lower text block the words THE and WITH are offset vertically.\n\nThe interaction between typography and illustration in the original cover is worth noting ...they are of each other. Having the eyebrow of the dog horizontally aligned with the illustrators name and having the whole text block placed in a position so as to have a relationship between both the dog and the chickens, in other words the entire illustration, is very interesting indeed. And having a feather rest on the N is reenforces the direct relationship of typography and illustration for a Children's book.\n\nIn your rendering the action word is gone, the text blocks are placed in rank and file, and white space floods the overall effort.\n\nFor me, as a graphic designer, comparing these two examples is totally interesting ...\n\n"
    },
    {
      "time": "26 Aug 2013 — 11:55pm",
      "content": "There have been some great discussions of typography and font usage in children's books on Typophile, including the threads below:\n\n[typography in childrens books](http://web.archive.org/web/20150425143510/http:/typophile.com/node/66159)  \n [Fonts for children's books](http://web.archive.org/web/20150425143510/http:/typophile.com/node/42632)\n\n"
    },
    {
      "time": "27 Aug 2013 — 5:18am",
      "content": "About typefaces used in childrens' books - here are three examples, by some great XX century authors/designers, of how \"classical\", un-playful typography can merge successfully with illustrations: Paul Rand, Bruno Munari, Remy Charlip. These books dates from another era (the \"rationalist\" design age of 1950 and 1960s) but I think they still stand as masterful examples of graphic and editorial design, and they certainly reached their goals.\n\n[http://www.swipe.com/wp-content/uploads/2009/02/iknowalotofthings.jpg](http://web.archive.org/web/20150425143510/http:/www.swipe.com/wp-content/uploads/2009/02/iknowalotofthings.jpg \"http://www.swipe.com/wp-content/uploads/2009/02/iknowalotofthings.jpg\")\n\nhttp://1.bp.blogspot.com/-03rUBfKzz5A/UDfFRehFUHI/AAAAAAAAJaE/vIqYyd13dQ0/s400/unfortunately+(1).jpg\n\n[http://www.corraini.com/admin/tmp/files/copertine/30.jpg](http://web.archive.org/web/20150425143510/http:/www.corraini.com/admin/tmp/files/copertine/30.jpg \"http://www.corraini.com/admin/tmp/files/copertine/30.jpg\")\n\n"
    },
    {
      "time": "27 Aug 2013 — 5:37pm",
      "content": "I've spent a LOT of time looking at typography in children's picture books, including a detailed analysis of 20 years of Caldecott award winners and nominees (results published in Children & Libraries, a journal of the American Library Association).\n\nI have also read an awful lot of what has been written about legibility research.\n\nI am frustrated by children's books with hard-to-read body text.\n\nBut calling out the cover of this particular book for special censure seems... odd. On the spectrum of books for kids, that's pretty average. At a practical level, I don't see kids having any great difficulty deciphering those letters in small quantities. It's not as if it is the body text of the book!\n\n"
    },
    {
      "time": "29 Aug 2013 — 6:16pm",
      "content": "typography should be granted plenty of room for expression. I really can't support the elimination of expression in favour of 'legibility'. The expression of the form of written words here is equally a part of the message. Communication is more that the efficient transfer of information. Or rather, the efficint transfer of \"information\", because we communicate on a lot of levels besides written language.\n\nQuite frankly, at the end to the day it is quite difficult to design something like a book cover that is actually illegible - without specifically intending to do so. Go ahead. design an aesthetically pleasing version of this cover that cannot be read. A children's book isn't a highway sign or a medicine bottle meant to be read by demented old people with stinkingly bad eyesight. (I can say the because I'm \"that far\" from being one myself.)\n\nSuch a design as this is meant to be absorbed over some time, lingering luxuriantly under the covers with a flashlight - and experienced as an adventure. F\\*\\*k legibility in this case. Let's make reading more fun for young people than efficient.\n\nAn aspect of good typography in my considered opinion has to be the installation of occasional speed-bumps to control the dissemination of information.\n\n:o) Just thought that up.\n\n"
    },
    {
      "time": "29 Aug 2013 — 6:21pm",
      "content": "Absolutely. One good defense of things like widely spaced capitals for inscriptions.\n\nSometimes you want people to read slowly and savor as they go.\n\n"
    },
    {
      "time": "31 Aug 2013 — 7:34pm",
      "content": "I don't particular buy Russell's argument, not the _in extremis_ version as posited here.\n\nIf a young kid—who is the target audience for the book—can't read the title of the book fairly easily, I think that's a big problem. That said, I don't think that a kid who can read at all will have problems with the title in the example.\n\n"
    },
    {
      "time": "1 Sep 2013 — 10:51pm",
      "content": "\\> A children's book isn't ... a medicine bottle meant to  \n\\> be read by demented old people with stinkingly bad eyesight\n\nI'm getting off topic here, but I'm often dismayed at how unreadable the instructions on medicine bottles are due to the small point size. I'm in my 50s and wear bifocals. Prescription labels are usually okay, but I frequently have to use a magnifying glass to read instruction labels of over-the-counter stuff. I can't imagine how they expect people in their 70s and 80s to read them.\n\n"
    },
    {
      "time": "1 Sep 2013 — 11:24pm",
      "content": "@JinWook: The original design simply employs a higher degree of [visual rhetoric](http://web.archive.org/web/20150425143510/http:/en.wikipedia.org/wiki/Visual_rhetoric) then the re-design. Imagine the chickens with blank stares. It’s as though you took the facial expressions off the fonts. See also:\n\nBrumberger, E. (2004). The rhetoric of typography: Effects on reading time, reading comprehension and perception of ethos. _Technical Communication, 51(1)_, 13–24.\n\nEhses, H. (1976). _Design Papers 1. Semiotic Foundation of Typography_. NSCAD University. Halifax, Nova Scotia, Canada.\n\nEhses, H. & Lupton, E. (1988). Design papers 5. Rhetorical handbook: an illustrated manual for graphic designers. NSCAD University. Halifax, Nova Scotia, Canada.\n\nEhses, H. (2008). _Design papers 6: Design on a rhetorical footing_. NSCAD University, Canada.\n\nFiske, J. (1982). _Introduction to communication studies_. Guernsey Press Co Ltd, Great Britain.\n\n————\n\n@russellm: “_the installation of occasional speed-bumps to control the dissemination of information_” = disfluency theory?\n\nDiemand-Yauman, C., Oppenheimer, D. M. & Vaughan, E. B. (2010). Fortune favours the bold (and the italicized): Effects of disfluency on educational outcomes. _Cognition, 118(1)_, 111–115.\n\nHernandez, I. & Preston, J. L., (2013). Disfluency disrupts the confirmation bias. _Journal of Experimental Social Psychology, 49(1)_, pp 178. DOI: 10.1016/j.jesp.2012.08.010\n\n————\n\n@JamesM: You may enjoy this [plain-language review of Hailstone & Foster (1967): Studies of the efficiency of drug labeling](http://web.archive.org/web/20150425143510/http:/readthetype.com/hf1967/).\n\n"
    },
    {
      "time": "3 Sep 2013 — 9:28pm",
      "content": "<cite>If a young kid—... can't read the title of the book fairly easily, I think that's a big problem.</cite>\n\nIt could be a fun problem to solve.\n\nGenerally, I think that adults' estimation of how children learn is far too linear and that we under-estimate their abilities. The fact that <cite>we</cite> are able to read this cover isn't due to superior intellect, higher reasoning powers or years of experience. It is due to a very simple trick of finding cues to visual hierarchies that a three year old is able to appreciate.\n\nI think it is important to take cues from the audience and not assume that we - as grown-ups and as designers, need to spoon-feed learning in carefully measured doses. Children love puzzles. Children love challenges. Learning... Learning to read especially, should be fun. It should be rewarding, and it should be interesting. If they can't figure it out today, they get it tomorrow, and feel pretty clever for having done so.\n\n"
    },
    {
      "time": "3 Sep 2013 — 9:25pm",
      "content": "<cite> disfluency theory?</cite>\n\nLife\n\n:o)\n\n"
    }
  ]
}
