{
  "id": "10587",
  "title": "Crit needed",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm working on this logo for a multimedia design group. I'll post a few more revisions if need be.   \n ![](http://web.archive.org/web/20131019034835im_/http:/www.typophile.com/forums/messages/29/70874.gif)   \nThe letters are d s, can you see them? Is it too heavy? General thoughts?\n\n",
  "author": "jkochis",
  "time": "27 Apr 2005 — 6:56am",
  "uid": "3665",
  "comments": [
    {
      "time": "27 Apr 2005 — 7:59am",
      "content": "I suppose I'd figure it out if I saw the company's title along side it, but I wouldn't have seen the d's with just this mark. Also, if left to my own devices to find letters here, I'd probably see either dS or ddS. As a shape, it is interesting.   \n   \nGood luck!   \nScott\n\n"
    },
    {
      "time": "27 Apr 2005 — 8:28am",
      "content": "Yeah I'm trying to find a good font to pair with it. Thank you.\n\n"
    },
    {
      "time": "27 Apr 2005 — 9:45am",
      "content": "Looks like a sexy typo for a fire-something to me.   \nOkay, it's Spring ;-)   \n   \nAS\n\n"
    },
    {
      "time": "27 Apr 2005 — 9:49am",
      "content": "Thank you, I was aiming for something like that.\n\n"
    },
    {
      "time": "27 Apr 2005 — 10:03am",
      "content": "I read a curvy 3d d but the s isn't working for me, maybe something a bit curvier (I don't want to contribute to Alessandro's sap rising ![:-)](http://web.archive.org/web/20131019034835im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "27 Apr 2005 — 10:29am",
      "content": "I see what you're saying, I'm trying to figure out how to curve it up without breaking the d.\n\n"
    },
    {
      "time": "27 Apr 2005 — 12:07pm",
      "content": "You may want to thicken the end of each of the points a little more so they don't disappear:   \n   \n ![Curves](http://web.archive.org/web/20131019034835im_/http:/www.typophile.com/forums/messages/29/70916.gif)   \n   \nIt might help to make the S more distinguishable.   \n   \n - Lex\n\n"
    },
    {
      "time": "27 Apr 2005 — 2:15pm",
      "content": "Jesse, its a forced concept. If you are dealing with anyone other than designers they won't get it no matter what you do. Is the mark supposed to communicate something or is it just a design. As a design its nice, as communications it doesn't work.\n\n"
    },
    {
      "time": "27 Apr 2005 — 2:25pm",
      "content": "Thank you. Do you think I should use more obvious letterforms, or maybe just start over completely?\n\n"
    },
    {
      "time": "29 Apr 2005 — 6:08am",
      "content": "Jesse, keep the mark but put the words it represents next to it. As the mark ages it will make it own idenity and can stand alone.   \n   \nOne last fear it looks like a logo for a natural gas company.\n\n"
    },
    {
      "time": "29 Apr 2005 — 6:42am",
      "content": "First off, thanks to everyone here for all your helpful comments. I've been busy with another, project, so i haven't been able to put together any revisions. I'll post what I come up with next week.   \n   \nI see the similarity to the natural gas logo, but I like the flame aspect of it. I need to think about it for a bit...\n\n"
    },
    {
      "time": "29 Apr 2005 — 1:55pm",
      "content": "we have this company in quebec   \n   \n [http://www.gazmetro.com](http://web.archive.org/web/20131019034835/http:/www.gazmetro.com/)   \n   \nit's a natural gas company such as Daniel Weaver felt .....\n\n"
    },
    {
      "time": "6 May 2005 — 2:40am",
      "content": "i agree with lex and his comments, get the edges of the charactres to be a tad more pronounced...\n\ntake care  \npierre\n\n"
    }
  ]
}
