{
  "id": "10581",
  "title": "New York directions",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi, I'm travelling to New York next summer.   \nCan anyone point some good bookshops or antiquarians that might be interesting to visit for a typography addict and design junkie? Or any other nice places to go besides the obvious (MoMA etc.)?\n\n",
  "author": "<a href=\"user/6512\" title=\"View user profile.\">kaizer</a>",
  "time": "<br>",
  "uid": "6512",
  "comments": [
    {
      "time": " 27 April, 2005 - 4:43am",
      "content": "When will you be there? July 20-24 is TypeCon which would certainly satisfy your type/design itch. At the TypeCon planning meeting there was talk of organizing some typographic tours. Grolier club, Subway, Press shops etc. Even if you aren't in NYC during typecon, check out their calendar for ideas, they may also have \"things to do and see\" info.   \n   \n [www.typecon.com](http://web.archive.org/web/20060504090146/http:/www.typecon.com/)\n\n"
    },
    {
      "time": " 27 April, 2005 - 4:51am",
      "content": "Kaizer, one place to visit is the Empire State Building and the Crysler Building (nice Art Deco), also visit Central Park. When you get into Central Park (on the park drives) and want to know where you are look at the light poles, they give you the nearest cross street, like W7201, West 72nd street number 1 light pole.\n\n"
    },
    {
      "time": " 27 April, 2005 - 6:55am",
      "content": "In preparation for TypeCon I posted this NY page a few weeks back...   \n  [http://www.microsoft.com/typography/links/FontPortal.aspx?PID=6](http://web.archive.org/web/20060504090146/http:/www.microsoft.com/typography/links/FontPortal.aspx?PID=6)  \n   \nLinks to a few items that might be of interest. Will be adding to it over the coming months.   \n   \nCheers, Si\n\n"
    },
    {
      "time": " 27 April, 2005 - 9:30am",
      "content": "I started putting together a list for this post and while googling for an address I came across this: [http://blackplum.com/guide/](http://web.archive.org/web/20060504090146/http:/blackplum.com/guide/)   \n   \nPretty much everything you need. (You can skip the visit to Duggal, it's just a fancy place for burning CDs).\n\n"
    },
    {
      "time": " 6 May, 2005 - 9:40am",
      "content": "Just keep walking, it’s a visual treat whereever you go!\n\nI’d have to recommend Zabar’s (2245 Boadway @ 80th Street) for good coffee, delicious chocolate rugelach, and the cheapest souvenir mugs on Manhattan!\n\n"
    }
  ]
}
