{
  "id": "105817",
  "title": "Let's help Yahoo see the light",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Sometimes the best way to help somebody open his eyes is to give him an unexpected gift.\n\nUnless it's all an act and there's an actual design firm that's going to save the day at the very last second (not that all design firms are capable of such a feat) Yahoo seems to be in the process of shooting itself in the foot:  \n [http://www.yahoo.com/dailylogo](http://web.archive.org/web/20140712023000/http:/www.yahoo.com/dailylogo \"http://www.yahoo.com/dailylogo\")\n\nAlthough some people will see the following suggestion as even worse than so-called \"spec work\", if we concede that Yahoo is unlikely to abort this ridiculous headless-chicken-in-quicksand approach, then maybe we can help them see the light by arriving at a logo that the design field will end up supporting as a positive example.\n\nSo, here goes another trademark crazy idea:  \nSince it's too much to expect somebody making such an effort from scratch, start with any of the half-baked (or just plain inedible) logos above, make it good, and send it as a gift to Yahoo. FWIW the one, and only one, I personally think has great potential is the one for day four:\n\n ![](http://web.archive.org/web/20140712023000im_/http:/typophile.com/files/Yahoo_day4_4786.jpg)\n\nBTW anybody with connections at Yahoo is kindly asked to point them in this direction.\n\nhhp\n\n",
  "author": "hrant",
  "time": "26 Aug 2013 — 6:14pm",
  "uid": "1250",
  "comments": [
    {
      "time": "26 Aug 2013 — 7:35pm",
      "content": "They're unveiling their new logo on September 5, just a few days from now. I agree that this \"daily logo\" stuff they're doing is pretty bad, but it's just a gimmick. They undoubtedly picked the new logo weeks ago and the new letterheads, brochures, signage, etc. are already being made.\n\n"
    },
    {
      "time": "26 Aug 2013 — 9:23pm",
      "content": "That would make sense. But I'm wondering: are they doing all that in-house? Because I think an outside design firm would mind looking bad due to an association with such a gimmick.\n\nhhp\n\n"
    },
    {
      "time": "26 Aug 2013 — 10:07pm",
      "content": "I don't think Yahoo has revealed who's doing it. My guess is that it's being done by an outside agency, since the in-house staff probably has their hands full with routine work.\n\nIf it is an outside agency, they may have no control over the gimmick, which I agree that many designers wouldn't want to be associated with. For example maybe a design firm is doing their logo, but their ad agency or internal group is doing the \"logo a day\" stuff.\n\n"
    },
    {
      "time": "27 Aug 2013 — 9:21am",
      "content": "I! do! not! think! that! Yahoo! needs! our! help!\n\n(old joke the Register uses all the time)\n\nRather, no doubt after this stunt, at the end of the 30 days they will have a competently designed logo up their sleeves that they spent real money to get a competent designer to create.\n\n"
    },
    {
      "time": "27 Aug 2013 — 9:27am",
      "content": "Obfuscating the lack of connection between this 30-day farce and the final product? Sadly I think that's quite probable...\n\nBut they should've gone biblical like these jokers:  \n [http://www.bbc.co.uk/news/magazine-23701156](http://web.archive.org/web/20140712023000/http:/www.bbc.co.uk/news/magazine-23701156 \"http://www.bbc.co.uk/news/magazine-23701156\")\n\nhhp\n\n"
    },
    {
      "time": "27 Aug 2013 — 9:29am",
      "content": "But if there are gods, the promising day-4 one is actually the secret basis of the final version. I really think all it needs is a good deep massage to be very good.\n\nhhp\n\n"
    },
    {
      "time": "4 Sep 2013 — 10:09pm",
      "content": "[http://www.yahoo.com/dailylogo](http://web.archive.org/web/20140712023000/http:/www.yahoo.com/dailylogo \"http://www.yahoo.com/dailylogo\")  \n\"It's worse than we thought doc.\"\n\nhhp\n\n"
    },
    {
      "time": "4 Sep 2013 — 11:05pm",
      "content": "I just saw the new official logo. What the crap? Optima? (or a craptastic facsimile, I'm too tired to care). Might as well use \\*\\*\\*\\* Arial.\n\n"
    },
    {
      "time": "4 Sep 2013 — 11:07pm",
      "content": "I didn't use a 4-letter word there. I used gawdamned with an o.\n\n"
    },
    {
      "time": "5 Sep 2013 — 3:34am",
      "content": "[My thoughts on the logo.](http://web.archive.org/web/20140712023000/http:/fontsinuse.com/uses/4713/yahoo-logo-2013)  \n [My thoughts on the rationalization.](http://web.archive.org/web/20140712023000/http:/stewf.tumblr.com/post/60339564636/yahoo-introducing-our-new-logo)\n\n"
    },
    {
      "time": "5 Sep 2013 — 8:35am",
      "content": "[My thoughts on the logo.](http://web.archive.org/web/20140712023000/http:/www.graphicdeclaration.com/images/blankthought.jpg)  \n [My thoughts on the rationalization.](http://web.archive.org/web/20140712023000/http:/www.graphicdeclaration.com/images/blankthought.jpg)\n\n"
    },
    {
      "time": "5 Sep 2013 — 8:48am",
      "content": "Analysis at the branding review site \"Brand New\":  \n [http://www.underconsideration.com/brandnew/archives/new\\_logo\\_for\\_yahoo\\_d...](http://web.archive.org/web/20140712023000/http:/www.underconsideration.com/brandnew/archives/new_logo_for_yahoo_designed_in-house.php \"http://www.underconsideration.com/brandnew/archives/new\\_logo\\_for\\_yahoo\\_designed\\_in-house.php\")\n\nHrant, earlier you'd asked if it was designed in-house. The article quotes a blog post that indicates it was, and seems to say that most of the work was done over a single weekend.\n\n ![](http://web.archive.org/web/20140712023000im_/http:/typophile.com/files/yahoo-logo_5510.jpg)\n\n"
    },
    {
      "time": "5 Sep 2013 — 8:45am",
      "content": "I expected that I would think the logo was just fine, despite all the doubting. However, instead, I have to admit I don't like it either.\n\nI have nothing against Optima; it's a good text face, even if the light weight used isn't bold enough for a logo. But whatever it is, I had to examine the logo carefully to determine that the first and last letters were larger, with the three middle ones the same size. At first I thought the first letter was large, and then the remaining letters gradually increased in size.\n\nWhen a point like this is ambiguous, something is wrong.\n\n"
    },
    {
      "time": "5 Sep 2013 — 9:06am",
      "content": "James: Sheesh^2.  \n\"But it was a _long_ weekend! Which was a great coincidence coz we had time to improve Optima's spacing.\"\n\nhhp\n\n"
    },
    {
      "time": "5 Sep 2013 — 9:13am",
      "content": "Marissa Mayer designed the logo herself. You don't trump the CEO. Instead you bite your tongue and update your resume.\n\nMarissa's 'pitch': [http://marissamayr.tumblr.com/post/60336044815/geeking-out-on-the-logo](http://web.archive.org/web/20140712023000/http:/marissamayr.tumblr.com/post/60336044815/geeking-out-on-the-logo \"http://marissamayr.tumblr.com/post/60336044815/geeking-out-on-the-logo\")\n\n"
    },
    {
      "time": "5 Sep 2013 — 9:26am",
      "content": "To me it's just bland. It'll work, but they could have done so much better.\n\nDoing it in-house over a weekend was probably due to their financial situation and a CEO who wants to change things quickly. But they should have spent much more time on it.\n\n\\> you bite your tongue and update your resume\n\nYep, it's tough for an in-house designer to argue with the CEO.\n\n"
    },
    {
      "time": "5 Sep 2013 — 9:47am",
      "content": "\"and a CEO who wants to change things quickly\"\n\nOr a CEO who's really into micromanaging.\n\n"
    },
    {
      "time": "5 Sep 2013 — 9:53am",
      "content": "Financial situation? Any one of us could've at the very least been allowed to make this Optima-based mess more balanced, for peanuts. It's not the money, it's the always-deadly combination of ignorance and hubris.\n\nhhp\n\n"
    },
    {
      "time": "5 Sep 2013 — 1:23pm",
      "content": "\\> Or a CEO who's really into micromanaging.\n\nYep. There are examples of employees doing things behind the micromanaging boss' back because they couldn't win an argument with him. At Apple the engineers would occasionally change technical details without Steve Job's knowledge because they knew he was wrong. And when Frank Lloyd Wright designed his masterpiece house Fallingwater, they couldn't convince him it needed more reinforcements so they added them secretly. But of course you can't make secret changes with logos; what you see is what you get.\n\nTrying to design with the client (or CEO) looking over your shoulder is usually a recipe for disaster. They end up designing it themselves (\"make it bigger, now change it to blue...\"), instead of letting the designers go through the normal design process (which can seem slow and boring to a non-designer).\n\n"
    },
    {
      "time": "5 Sep 2013 — 2:14pm",
      "content": "If this is their new logo, I have only this to say: It reminds me of a Bach piece played through laptop speakers while said laptop is sitting on your lap.\n\n"
    },
    {
      "time": "6 Sep 2013 — 4:48am",
      "content": "I don’t care about the logo, because I don’t care about the company. And it is clear to me that the company doesn’t care about their logo too…\n\n"
    },
    {
      "time": "6 Sep 2013 — 6:46am",
      "content": "I've never liked Yahoo. But people copy the behavior of famous things, so we have to care.\n\nhhp\n\n"
    },
    {
      "time": "6 Sep 2013 — 9:40am",
      "content": "Yes; I was thinking of Ivory Soap when I saw the new Yahoo! logo.\n\n"
    },
    {
      "time": "6 Sep 2013 — 4:01pm",
      "content": "The new Yahoo logo was designed by somebody who didn't even understand the principle of overshoot; it is crap in execution, whatever one thinks of the design.\n\n"
    }
  ]
}
