{
  "id": "105885",
  "title": "1898 book font - common but what is it?",
  "forum": "Home",
  "tags": [
    "Text"
  ],
  "content": "The font I am trying to identify is from a book published in 1898: Tales of the Telegraph by Jasper Brady.\n\n| Attachment | Size |\n| --- | --- |\n| [1898 book sample.pdf](http://web.archive.org/web/20150107185506/http:/typophile.com/files/0612_001.pdf) | 622.36 KB |\n\n",
  "author": "mikerav",
  "time": "29 Aug 2013 — 3:51am",
  "uid": "214386",
  "comments": [
    {
      "time": "29 Aug 2013 — 4:28am",
      "content": "Although it cannot be it, **[Caslon](http://web.archive.org/web/20150107185506/http:/www.findmyfont.com/index.php/fonts/font-preview?fset=Adobe&ffam=Adobe%20Caslon%20-%20Regular&fid=39e75348f169c4efe474a68a65508bb9&fsize=48&text=Tales%20of%20the%20Telegraph%2C%20my%20lamps%2C%20sat%20down&wrap=2)** looks like a good substitute\n\n"
    },
    {
      "time": "29 Aug 2013 — 7:11am",
      "content": "The book is printed in a typeface of the era classified as \"modernized old style.\"  \nFoundries had very similar versions under various names, e.g. ATF's Binny & Bradford. Here are a couple of generally matching samples from Devinne's 1899 book on printing types:\n\n ![](http://web.archive.org/web/20150107185506im_/http:/typophile.com/files/Devinne1899p195detail_3657.jpg)\n  \n\n ![](http://web.archive.org/web/20150107185506im_/http:/typophile.com/files/Devinne1899p196detail_4769.jpg)\n  \nThese typefaces virtually disappeared after 1900 with the revival of classic typefaces of the 17th and 18th centuries, e.g. Caslon, and new designs, particularly those produced by ATF under the direction of Morris Fuller Benton, which are still in the standard repertoire for book printing.  \nDon \n"
    },
    {
      "time": "29 Aug 2013 — 7:45am",
      "content": "I wish I could offer you a digital revival of a 19th century \"modernized old style\" but so far I have drawn a blank. Another popular font of the era, Ronaldson, has been revived by Canada Type, but it has much larger serifs on the arms and looks quite different.  \nDon\n\n"
    },
    {
      "time": "29 Aug 2013 — 9:01am",
      "content": "[Century Oldstyle](http://web.archive.org/web/20150107185506/http:/www.myfonts.com/fonts/bitstream/century-old-style/), though not introduced until after 1900, has a bit of the right feel, as does [Bookman](http://web.archive.org/web/20150107185506/http:/www.myfonts.com/fonts/bitstream/bookman/) (_not_ Ed Benguiat's 1975 version of Bookman for ITC). They are both revivals of Old Style Antique designed by Alexander Phemister in 1858 for the Miller and Richard foundry in Edinburgh. Bruce Type Foundry produced a US version.\n\n"
    },
    {
      "time": "29 Aug 2013 — 1:11pm",
      "content": "The story of Century Oldstyle is interesting. The publisher of the Century Magazine, Theodore Low De Vinne, was unsatisfied with the available typefaces, whether \"modernized old style\" or \"modern\" Bodonis, and in 1894, or thereabouts, commissioned Linn Boyd Benton at ATF to create a font with higher technical standards using new punch-cutting technology at ATF. Century Oldstyle was the first of the new generation of fonts that we still use today. Also note that the appearance of Century Oldstyle is blacker than the rather wispy \"modernized old style\" fonts. It also has larger x-height and more condensed proportions.  \nAs for the BT Bookman, I agree that given the lack of \"modernized old style\" revivals, BT Bookman might be as good a substitute as any if we were to reset the text in this specimen in something that had some of the flavor of the \"modernized old style\" type used in it.  \nDon\n\n"
    }
  ]
}
