{
  "id": "1059",
  "title": "Elizabeth Horne",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is a redesign for my Mother's shop, Elizabeth   \nHorne. Their current design is cringe worthy, using   \n(gasp) Brush Script for the logotype, y'know the one that   \ncomes stock standard on pc's. I reckon I owe it to her to   \ndo a redesign. I am deliberately using Art Deco as a   \nstarting point, because there is a huge amount of Deco   \ninfluence in the town, and the shop was established in   \nthe mid -30's. She sells quality women's clothes, and I   \nwant the logotype to reflect both the Deco heritage and   \nthe elegance of her and the clothes.   \n   \n   \n ![](http://web.archive.org/web/20150417175454im_/http:/www.typophile.com/forums/messages/29/14845.jpg)\n\n",
  "author": "kris",
  "time": "26 Aug 2003 — 5:18pm",
  "uid": "1519",
  "comments": [
    {
      "time": "26 Aug 2003 — 5:43pm",
      "content": "the first thing that i see: the \"Euro\" / E   \n   \n   \n   \nDavid Hamuel\n\n"
    },
    {
      "time": "26 Aug 2003 — 10:38pm",
      "content": "I didn't think of it as a euro until David said it. I quite like it. Especially the Z and the R. That TH ligature is tres chic too.\n\n"
    },
    {
      "time": "26 Aug 2003 — 10:53pm",
      "content": "Kris, this is a really good start.   \n   \n\\* I'd agree with David about the E.   \nThere are lots and lots of different   \nthings you can do with an uppercase E.   \nOne thing you can do: Challenge yourself to sketch   \nout 10-12 different forms and pick from there.   \n   \n\\* The z is nice. The middle sharp part, maybe   \nyou might dip that below the baseline   \nuntil it looks just so, and the   \nsame with the O and the round E if you keep it,   \nand the joins on the N.   \n   \n\\* spacing might look better tighter.   \nAnd how would it look stacked?   \n   \n   \ngood luck.   \n   \nps, Does your Mom know what you\n\n"
    },
    {
      "time": "26 Aug 2003 — 11:20pm",
      "content": "The euro E is out. I have sketched about 4 different E's,   \nbut have only just flicked it into Fontlab. (oh my   \ngracious, how wonderful is that program?) The spacing   \nis atrocious, because it hasn't been spaced yet. Mum   \ndoes know what I am up to, she realises the Importance   \nof Good Design, (I gave her enough stick about the   \ncurrent logotype - her friend commented that the   \nbusiness card looked like one put 50c in a vending   \nmachine and out popped a card!).   \n   \nThanks for the feedback, will post up changes in a short   \nwhile.\n\n"
    },
    {
      "time": "27 Aug 2003 — 12:41am",
      "content": "I like the overall impression.   \n   \nYour Z fits in, although I think, it should be more rigid. Maybe you could try letting the tail strat horizontally.   \n   \nNow every talked about the E being an Euro, I cant get it out of my mind either. Maybe you could try a combination of a classical E (angular) with a 1/4 circle bottom (get it?). And you don't have to make all three E's the same.   \n   \n---Jacques\n\n"
    },
    {
      "time": "27 Aug 2003 — 1:42am",
      "content": "the z curve is too tight   \ni dont know how you all thought of the euro sign - e connection (i am using euros, but didnt make the connection). ppl have been using this alternative shape for centuries. david did all the damage\n\n"
    },
    {
      "time": "27 Aug 2003 — 11:02am",
      "content": "1. sorry for the damage/\"damage\"   \n   \n2. if you like the \"e\" - just change the arm.   \n   \n3. see the samples (editorial illustration / cartoon)   \n   \n   \n   \n   \nDavid Hamuel ![euro===](http://web.archive.org/web/20150417175454im_/http:/www.typophile.com/forums/messages/29/14908.gif)\n\n"
    },
    {
      "time": "27 Aug 2003 — 11:49am",
      "content": "but should a shop design have such a strong implication, like containing the euro symbol? And maybe it would lose the art deco feel?\n\n"
    },
    {
      "time": "28 Aug 2003 — 11:14am",
      "content": "I didn't really see the Euro thang either.   \n   \nO's and Z need to duck below the baseline, agreed.   \n   \nlooks nice though.\n\n"
    },
    {
      "time": "11 Oct 2003 — 7:05pm",
      "content": "Crumbs, it has been a while hasn't it? The type is in its   \nthird iteration, close to finished thank goodness. Have a look at these and see if I am on the money.   \n   \n   \n ![](http://web.archive.org/web/20150417175454im_/http:/www.typophile.com/forums/messages/29/18403.jpg)\n\n"
    },
    {
      "time": "11 Oct 2003 — 10:52pm",
      "content": "Kris, these are stylin'...you make Christian's point   \nabout doing something custom vs. rolling out a font.   \n   \ncouple of things:   \n   \n\\* The space between words seems a bit wide.   \n\\* the space around the O in Horne seems tighter   \nthan the rest of the spacing. Overall, you might get   \na more pleasing result if you tighten a bit. The word   \nFashion, btw, seems to have tighter spacing.   \n\\* the TH ligature is nice...did you try it the other way   \nand compare.   \n\\* what does the moms think?   \n   \nbj\n\n"
    },
    {
      "time": "12 Oct 2003 — 2:33pm",
      "content": "This is much better than before.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Oct 2003 — 12:36am",
      "content": "I like the swash \"e\" better than the first one.   \n   \nthe doube-O infinity thing is a tad much perhaps, but if you do run with it, adjust the right O. Maybe its just me, but it seems like the angle of the cut is slightly off. (Not sure of the correct terminology here sorry)   \n   \nlooks very nice though.\n\n"
    },
    {
      "time": "13 Oct 2003 — 2:32am",
      "content": "the \"F\" looks similar to an old styled \"J\"   \n   \nthe ligatures and the \"Z\" are lovely\n\n"
    },
    {
      "time": "13 Oct 2003 — 8:25am",
      "content": "The second 'Elizabeth Horne' is very good.   \n   \nProbably you intend to deal with this later, but in the form you posted it, there is a hierarchy problem. You might consider confining the swash characters & ligatures to the main mark.\n\n"
    },
    {
      "time": "13 Oct 2003 — 11:42am",
      "content": "I know I'm way behind here, but two things:   \n   \n1 Just to reiterate what Romesh pointed out, the TH ligature and the Z are both excellent.   \n   \n2 I don't know what the big Euro fuss was all about. Sure I see it, but one of the distinguishing characteristics of Art Decco was its reach for international (although usually focusing on the exotic) boundaries. In addition, just about any european reference always has a place in fashion. Having said that, I don't know where this shop is located\n\n"
    },
    {
      "time": "13 Oct 2003 — 1:00pm",
      "content": "Some thoughts:   \n   \n1) I don't really care for the TH lig. It reads ok, but seems like added trickery for trickery's sake. Considering you already have lots of character pumped into your deco letters, plus two lovely swash letters. Do you need the ligature? I think no.   \n   \n2) Try opening up the space in the R just a hair.   \n   \n3) Your curves & stems look a little mechanical for flowing deco type.   \na. Apex of the A   \nb. Horiz/Vert transition on the B   \nc. What if the stems had a waist? (optima-ized)   \n   \n4) Try the N with flat corners instead of the sharp ones. (more in character with the other letters)   \n   \n5) This is a matter of taste, but I'd either go back to a optical monoline, or increase the contrast in your thins. (You may not need to if you add a waist to the stems).   \n   \nFinally, I prefer the top E solution. Don't let them compete with your lovely swashes.   \n   \nAll that to say, this is really nice. Bursting with potential. Congratulations!   \n   \nRandy\n\n"
    },
    {
      "time": "26 Oct 2003 — 12:44am",
      "content": "Thank you all so far for your help!   \nHere is an update. I have added lining figures, because   \nI realised that the osf don't really work very well with   \nwhat I have at the moment. Note- this is just a type   \nsample, not a finished print piece. I will post the first   \nprint sample later.   \n   \n   \n   \n ![](http://web.archive.org/web/20150417175454im_/http:/www.typophile.com/forums/messages/29/19256.jpg)\n\n"
    },
    {
      "time": "27 Oct 2003 — 2:11pm",
      "content": "I love the way the mark looks with the two different E's.   \n   \nI still find the 'infinity' double 'O' distracting. If you've ever done any math you are going to ask 'What's that infinity sign for'?\n\n"
    },
    {
      "time": "27 Oct 2003 — 4:02pm",
      "content": "\\>\\>I still find the 'infinity' double 'O' distracting.   \n   \nI forgot to say previously that all type that doesn't say   \n'Elizabeth Horne\" will be at 9-12pt, like on the business   \ncard for instance. So the OO lig will only be veiwed at   \na small size, thereby reducing the distraction. I suppose   \nthat viewing it large like above is a bit of a distraction,   \nbut it was created on the premise that it will be used   \nsmaller. I will post a pdf soon. Thanks for the reply!\n\n"
    },
    {
      "time": "27 Oct 2003 — 5:52pm",
      "content": "The alternate E's are excellent. Each is used in just the right places. Very, very elegant.   \n   \nThere's something awkward about the numeral 3 but I'm not sure what it is. My instincts say it's slightly topheavy or left-leaning but when I examine it closely I'm not so sure. Maybe it's just too centered and ordinary among all the high and low crossbars. Try giving your 3 and 5 the same center as your 6 and 8.   \n   \ntangent: What is this, E's can't be round anymore because of the Euro? That's silly.\n\n"
    },
    {
      "time": "28 Oct 2003 — 6:41am",
      "content": "Kris, excellent work!   \nI agree with Kevin, there's something strange   \nwith your figures, especially 3, 4 and 5. I guess   \nthey look lighter than the other figures?   \n   \nAnyway, very nice.\n\n"
    },
    {
      "time": "28 Oct 2003 — 9:01am",
      "content": "I would also like to applaud the nice work.   \n   \nI, too, feel that the numerals, 3-4, seem a little off. I think the \"3\" feels especially light, because it is positioned next to the \"2\", which seems to be the heaviest of the numerals. In fact, try turning the \"2\" upside down to see if it still feels even (in regard to weight) with the rest of the set. Maybe mix up the order a little to see how each numeral feels.   \n   \nAgain, great work!   \n   \nAloha,   \nScott\n\n"
    },
    {
      "time": "28 Oct 2003 — 5:43pm",
      "content": "I have made some changes - namely light, med & bold.   \nThe numerals have been sorted out to the best of my   \nability. I would like someone to tell me how bad my   \nword spacing is...I know it is off, but how much?   \n   \n   \n   \n   \n ![](http://web.archive.org/web/20150417175454im_/http:/www.typophile.com/forums/messages/29/19404.jpg)\n\n"
    },
    {
      "time": "28 Oct 2003 — 5:46pm",
      "content": "here is the typeface implemented in the business   \ncard. The type looks off because it is a screenshot from   \nillustrator. Thanks for the feedback!   \n   \n   \n ![](http://web.archive.org/web/20150417175454im_/http:/www.typophile.com/forums/messages/29/19407.jpg)\n\n"
    },
    {
      "time": "28 Oct 2003 — 5:53pm",
      "content": "the numerals might benefit from a small center point, possible just a touch thicker than the general stroke.   \n   \nI still think the word spacing could be tightened up a touch.   \n   \nI'm quite fond of the OO ligature.   \n   \nOverall very sexy, and kudos on the alternate 'E's in the mark.   \n   \n   \nhildebrant.\n\n"
    },
    {
      "time": "28 Oct 2003 — 8:47pm",
      "content": "Wonderfully elegant letters. And yes, the double o does work when it is small.   \n   \nMy impression is that the word spacing is much too wide.   \n   \nBringhurst says that a common word space is a quarter of an em. Yours looks to be three times that.\n\n"
    },
    {
      "time": "29 Oct 2003 — 11:35am",
      "content": "Also according to Bringhurst hanging numerals are meant to go with lower case (or small caps). They don't work with your all caps face, as you mentioned - probably for this reason.   \n   \nIf you made small caps to go with your caps, which might be nice if you want to use this in other contexts, or to sell it commercially, then the hanging figures should be proportioned in size and weight to the small caps.   \n   \nIncidentally, in your small showing the E is not as closely spaced to the ligature TH; it should be closer, I think.\n\n"
    },
    {
      "time": "29 Oct 2003 — 2:07pm",
      "content": "I saw your thread as it started but haven't been following it. Now I come back and wow, that is a HUGE improvement over what you had started with.   \n   \nBut I agree with William on the hanging numerals and the word spacing.   \n   \nGood job, and keep at it, this could be just perfect.\n\n"
    },
    {
      "time": "29 Oct 2003 — 5:54pm",
      "content": "Your lining numerals are so much better formed than your old-style numerals that I think you should just throw the old-style ones out. They really don't match or live up to this exquisite font.   \n   \nI agree that the word spacing could be tightened _some,_ but I don't agree that it should be reduced to a quarter-em like any other font. The nice airy feel is well served by giving each word breathing room.\n\n"
    },
    {
      "time": "30 Oct 2003 — 3:04am",
      "content": "Looking at the business card the word spacing seems to work with this font I would not close it much tighter. The RN in Horne seems a bit tight and have you looked at lowering the middle horizontal stress of the E and on the second E in Elizabeth you could lengthen the bottom horizontal to tighten the space to the TH lig. On the reverse the Us seem a bit high and the Ss could break the baseline a bit further, on the point of word spacing I think the address line should break so that you read Street and not Saint. This thread makes for interesting reading.\n\n"
    },
    {
      "time": "31 Oct 2003 — 3:38am",
      "content": "here is a screenshot of a poster for the typeface. I need   \nit for the end of year exhibition. The type at the bottom   \nreads \"eliza: a new typeface in 3 weights by kris   \nsowersby\". Hot damn I am almost finished this! Thanks   \nfer all your comments so far. I will work on the ETH   \nspacing in \"elizabeth\". I originally had the top arm of the   \nE slightly shortened, and the spacing worked out a   \ntreat. Somewhere along the line it fell away...but will be   \nrestored soon. I will keep the os figures because I quite   \nlike them. I will probably add smallcaps and/or a lower   \ncase sometime in the future.   \n   \n   \n ![](http://web.archive.org/web/20150417175454im_/http:/www.typophile.com/forums/messages/29/19595.jpg)\n\n"
    },
    {
      "time": "31 Oct 2003 — 3:41am",
      "content": "BTW the dimensions are 1000mm x 460mm\n\n"
    },
    {
      "time": "31 Oct 2003 — 6:20am",
      "content": "Congratulations on this typeface, Kris. You are I gather a graduating student; I don't know what the market is like for type designers, but you sure have a gift for it.   \n   \nI would suggest posting Eliza to the 'sans' thread here and getting some critique from the pro type designers - who probably look at those threads more - to help your final polishing.\n\n"
    },
    {
      "time": "31 Oct 2003 — 7:56am",
      "content": "This has a lot of character.   \n   \nhhp\n\n"
    },
    {
      "time": "31 Oct 2003 — 10:42am",
      "content": "Kris, that poster is mint.   \n   \nCongrats on a great typeface. ![:-)](http://web.archive.org/web/20150417175454im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nbj\n\n"
    },
    {
      "time": "31 Oct 2003 — 5:47pm",
      "content": "\\*\\*blush\\*\\* so many compliments - thanks! I am a   \ngraduating student. I also live in New Zealand, and   \nthere is, to my knowledge, only one type foundry. I am   \nalso considering whether going here is a good idea:   \n   \n [http://just.letterror.com/ltrwiki/TypeMedia](http://web.archive.org/web/20150417175454/http:/just.letterror.com/ltrwiki/TypeMedia)   \n   \nI have posted also in the critique\n\n"
    }
  ]
}
