{
  "id": "10597",
  "title": "Mineral express ltd",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello folks,   \n   \nthis is a 24hr freebie job, a company called 'mineral express ltd'. They specialise in bottled water, and coporate water coolers. It needed to be modern, clean and simple without being pretentious. Didn't want any imagery. So they got this:   \n   \n ![](http://web.archive.org/web/20131019042055im_/http:/www.typophile.com/forums/messages/29/70938.gif)   \n   \nI can show the business card if anyone is interested.\n\n",
  "author": "kris",
  "time": "27 Apr 2005 — 4:50pm",
  "uid": "1519",
  "comments": [
    {
      "time": "27 Apr 2005 — 5:11pm",
      "content": "Too much. Three logos. Stick with the first face. It works.   \nIf you need speed for the 'express' you could slant the same   \ntypeface (maybe lighter). I also find the the ligature 'TD'   \noff-key. And what does that period mean ? Haere ra.   \n   \nAS\n\n"
    },
    {
      "time": "27 Apr 2005 — 5:21pm",
      "content": "Yeah, off key is right. The period was to signify the abbreviation, and I quite like this sort of punctuation, I find it lends authority.   \n   \nI can't really stick with the first face, it is custom! So is the second. Ah well. I had a play with the ltd, smaller looks tacked-on, bigger looks clunky, and lower case looks too much. But I will have a fiddle.   \n   \n\"Haere ra\"\n\n"
    },
    {
      "time": "27 Apr 2005 — 5:37pm",
      "content": "Good, and nice fonts !   \n   \nAS\n\n"
    },
    {
      "time": "29 Apr 2005 — 6:02am",
      "content": "Kris you have no priority in the importance of the words. All are pulling for emphasis. Shouldn't it be Mineral Express as the name and LTD as small as you can make it. The period is just wrong its not a sentence. Also the gradient is a gimic. Make it work in black and white first. Good start, keep going\n\n"
    },
    {
      "time": "6 May 2005 — 5:32am",
      "content": "Kris, I really, really like the letterforms in this logo, but I agree that the hierarchy seems too flat and noisy, but that may just be the size at which we're looking at it. A smaller size printed will probably calm down. I don't mind the gradient, since they're letterforms and will probably work fine in black. I'm really digging the 'mineral', specifically. The 'p' in express bugs me a bit. The vertical goes too high for my taste.\n\nAll-in-all, I think it's great, particularly for the turnaround time.\n\n"
    }
  ]
}
