{
  "id": "105937",
  "title": "The Origin of the Light Weight?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,\n\nI'd like to know the origin (century, country) and the main purpose in the creation of the \"light\" weight.  \nIs Light originally used for text or title?  \nI wonder what is the first typeface that features light and ultra light weight?  \nThanks in advance for your answers.\n\n",
  "author": "Fournier",
  "time": "30 Aug 2013 — 8:48am",
  "uid": "212885",
  "comments": [
    {
      "time": "30 Aug 2013 — 11:29am",
      "content": "Benton’s Lightline Gothic?\n\n"
    },
    {
      "time": "30 Aug 2013 — 2:35pm",
      "content": "Thanks again for that information.  \nSo Morris Fuller Benton achieved it in 1908—according to Identifont—but for what purpose?  \nTo make big signs or headlines, I guess?  \nI wonder if a book or an article covers that change of weight trend.\n\nBack in the early XIXth century, they highlit titles with fat faces called later \"Normande\" (Didot roman in black weight).\n\n"
    },
    {
      "time": "30 Aug 2013 — 7:45pm",
      "content": "Is this light enough?\n\n ![](http://web.archive.org/web/20140804074914im_/http:/typophile.com/files/1882ALightSpecimen_4482.jpg)\n  \nIt's from 1882.  \nDon \n"
    },
    {
      "time": "31 Aug 2013 — 4:23am",
      "content": "Thanks again for that example of typeface. Can you name that serif type, by the way?  \nAnybody can provide a book reference to the use of \"light\" weight in the history of typography?  \nI still wonder why the type designers fashion these thin and very thin fonts. What is the necessity in the commerce?  \nThanks for your inputs and thoughts.\n\n"
    },
    {
      "time": "31 Aug 2013 — 5:24am",
      "content": "I should add: what is the first \"thin\" sans serif? And why does a foundry commission it?\n\n"
    },
    {
      "time": "31 Aug 2013 — 6:21am",
      "content": "> what is the first “thin” sans serif? And why does a foundry commission it?\n\nOne well-known example of a light sans-serif is [Royal-Grotesk](http://web.archive.org/web/20140804074914/http:/typophile.com/files/royal_grotesk_bauer_6208.jpg), issued by Ferd. Theinhardt Schriftgießerei Berlin around 1880. It was later renamed (after the Theinhardt foundry was taken over by H. Berthold AG) [Akzidenz-Grotesk mager](http://web.archive.org/web/20140804074914/http:/typophile.com/files/AG3.jpg).\n\n> I’d like to know the origin (century, country) and the main purpose in the creation of the “light” weight. Is Light originally used for text or title?\n\nRoyal-Grotesk was [allegedly](http://web.archive.org/web/20140804074914/http:/www.typolexikon.de/t/theinhardt-ferdinand.html) developed “for use in the scholarly publications of the Royal Prussian Academy of Sciences in Berlin”. That does not sound too credible to me.\n\n"
    },
    {
      "time": "31 Aug 2013 — 6:52am",
      "content": "Thank you very much. The story of the _Royal-Grotesk_ is a fascinating piece of information. It makes sense because _AG_ is the blueprint for _Helvetica_ and _Univers_ which offer many thin weights. I read that Rudoph Koch designed _Kabel_ (1927) with a thin weight too.  \nI wonder if Muller Fuller Benton is the first American type designer to create a thin weight.\n\n"
    },
    {
      "time": "31 Aug 2013 — 12:41pm",
      "content": "\"Norman Condensed.\"  \nDon\n\n"
    },
    {
      "time": "31 Aug 2013 — 2:10pm",
      "content": "I believe the production of light weight types in the late 19th and early 20th Centuries should be looked at in the context of advertising and the development of popular periodical publishing, in which journals distinguished themselves from books through new kinds of typography and advertising distinguished itself from editorial content through [greater diversity of sizes, weights and styles of type](http://web.archive.org/web/20140804074914/http:/madamepickwickartblog.com/wp-content/uploads/2013/02/corset7-1024x687.jpg).\n\n"
    },
    {
      "time": "31 Aug 2013 — 3:24pm",
      "content": "This is typical of the use of multiple popular typefaces circa 1880, some heavy and some very light, all on the same page.\n\n ![](http://web.archive.org/web/20140804074914im_/http:/typophile.com/files/1880caSM2_3783.jpg)\n  \n\n ![](http://web.archive.org/web/20140804074914im_/http:/typophile.com/files/1880caSM1_4005.jpg)\n  \nDon \n"
    },
    {
      "time": "1 Sep 2013 — 1:48am",
      "content": "So from 1880, the press and the ads introduced the concept of contrast (thin+bold) inside the same page. Interesting shift of composition paradigm.\n\n"
    },
    {
      "time": "1 Sep 2013 — 4:24am",
      "content": "The concept of multiple typefaces was common throughout the 19th century. A few years after the period where these ads were typical, it evolved into the style was known as \"artistic,\" which originated in the British Aesthetic Movement. Its distinctive features are idiosyncratic color harmonies, eclectic choice of type adornment, and compartmentalized compositional strategies. A major feature was the quest for the lightest possible line in fonts and ornaments.\n\n ![](http://web.archive.org/web/20140804074914im_/http:/typophile.com/files/LightFontInArtisticPrinting_5525.jpg)\n  \nYou might enjoy reading \\_The Handy Book of Artistic Printing\\_ (2009) by Doug Clouse & Angela Voulangas which explores this style.  \n\n ![](http://web.archive.org/web/20140804074914im_/http:/typophile.com/files/HandyBookOfArtisticPrinting_4410.jpg)\n  \nBook at Amazon, URL varies with country of purchase. Google will get the correct one for most countries. Don't know about Russia.  \nGood quick overview at [http://woodtyper.com/116](http://web.archive.org/web/20140804074914/http:/woodtyper.com/116 \"http://woodtyper.com/116\")  \nThe official website is unavailable at the time I am writing this, but try later:  \n [www.artisticprintingbook.com](http://web.archive.org/web/20140804074914/http:/www.artisticprintingbook.com/ \"www.artisticprintingbook.com\")  \nDon \n"
    },
    {
      "time": "1 Sep 2013 — 4:59am",
      "content": "The British Aesthetic Movement seems between Pre-Raphaelite and Art Nouveau.\n\n"
    },
    {
      "time": "1 Sep 2013 — 7:32am",
      "content": "Interesting stuff. Thanks Don and Stefan.\n\n"
    },
    {
      "time": "1 Sep 2013 — 7:34am",
      "content": "It's sort of an Oscar Wilde attitude, \"I'm so tired, everything is so boring, dear\" that loves light wispy type.  \nBTW the font in the two letter excerpt is Eastlake.  \nAnd here is the current leader in the search for the lightest font from the period. It's named Criterion:\n\n ![](http://web.archive.org/web/20140804074914im_/http:/typophile.com/files/Criterion1884@15percentXcClouse_4242.jpg)\n  \nI wonder if its possible to make metal type any lighter without it bending. Must have been a nightmare to print it without damage.  \nDon \n"
    },
    {
      "time": "1 Sep 2013 — 7:45am",
      "content": "I wonder if this 'Artistic Printing Style' influenced later Art Deco. It would be an unusual example of typography influencing the decorative arts and architecture, rather than the other way around.\n\n"
    },
    {
      "time": "1 Sep 2013 — 8:02am",
      "content": "These are light and thin faces, but how are they related to the norm?\n\nIt seems to me that there are three categories of light weight:\n\n1. Light versions of a stylistically themed family  \n2. Light fonts that look like light versions of regular styles, but are not published as part of a specific family.  \n3. Light weight standalone fonts\n\nMorris Benton is often credited with introducing the concept of the type family, during the amalgamation that created ATF, as a means of organizing duplication.\n\nThe Klingspor foundry was a pioneer in named (branded) styles, associated with its hiring of celebrity designers/typographers to design typefaces.\n\nClarendon was the first bold type to be stylistically related to the normal/regular, c.1850, although the concept of type family did not then exist. I have theorized that Clarendon was prompted by the introduction of smooth coated paper which made press gain very noticeable. No doubt the introduction of Light occurred at the same time.\n\n"
    },
    {
      "time": "1 Sep 2013 — 9:00am",
      "content": "Agree Nick that this seems to have wandered from the idea of the same typeface with different weights. There is not much in the way of type families before 1896ca when fonts like Cheltenham by Morris Fuller Benton and Bertram G. Goodhue were introduced. There were a substantial number of fonts called \"lightface\" in the latter part of the 19th century, but they were not closely matched with heavier weights of the same design.  \nI agree with your suggestion of the influence of coated paper.  \nOther technological innovation's also made possible the use of lighter fonts. For example electrotyping for font copying and production.  \nDon\n\n"
    },
    {
      "time": "1 Sep 2013 — 11:54am",
      "content": "I think that light styles originated in (commercial) lithographic printing. Drawing light styles is a lot less work than bolder ones… (Never underestimate the consequences of trying to be more productive — or lazy.)\n\n"
    },
    {
      "time": "1 Sep 2013 — 2:55pm",
      "content": "The tools also affect the use. Engraving was a natural for light weights.\n\n"
    },
    {
      "time": "1 Sep 2013 — 4:16pm",
      "content": "Good points.  \nClouse observed in his book that with the rise of lithography the letterpress printers were being squeezed out of the advertising business. The heavy \"fatface\" fonts of the early 19th century looked crude and clumsy compared to lithographic lettering, which could be light in execution. \"Artistic\" printing which included light line fonts and ornaments was a way for letterpress printers to recover some market share.  \nEngraving remained superior to type and lithography for very small formats, like fine script on business cards or lettering on postage stamps.  \nDon\n\n"
    },
    {
      "time": "2 Sep 2013 — 11:46pm",
      "content": "Thin monoline was used in engravings, e.g:\n\n ![](http://web.archive.org/web/20140804074914im_/http:/typophile.com/files/Monoline_1860_3539.jpg)\n\n"
    },
    {
      "time": "3 Sep 2013 — 2:41am",
      "content": "Fornier said:\n\n> Thank you very much. The story of the Royal-Grotesk is a fascinating piece of information. It makes sense because AG is the blueprint for Helvetica\n\nAccording to extensive research by Schumacher Gebler (published in Schriftgestalten by Tino Graß, Niggli 2008), Akzidenz Grotesk may not be looked upon as the one and only predecessor of Helvetica. He mentions and shows Französische Grotesk by Haas, which is the Haas’sche version of breite halbfette Grotesk by Schelter & Giesecke (with minor changes and a single-storey g).\n\nFournier said:\n\n> and Univers which offer many thin weights.\n\nUnivers rather roots in the alphabets made by Walter Käch, Frutigers teacher than in Akzidenz Grotesk. Kächs work is likely to be influenced by Akzidenz Grotesk, but the rational approach, the clean counters and the consequent horizontally cutting-off the stroke ends of a, c, e g and s in all weights and widths of a sans serif typeface can be found in the work of Käch. Kächs alphabets have been published, but for those who do not want to collect antique type books: some of it can be found in the book s on and by Frutiger, mainly in the publication by Heidrun Osterer.\n\nMaxim said:\n\n> Royal-Grotesk was allegedly developed “for use in the scholarly publications of the Royal Prussian Academy of Sciences in Berlin”. That does not sound too credible to me.\n\nExactly, although Theinhard made a lot of typefaces for the Royal Prussian Academy, he does not credit himself doing Royal Grotesk, let alone for the Academy, in his memoires as published in 1899. It would be interesting to see Royal Grotesk in one of the publications of the Royal Prussian Academy though.\n\nBerthold has been mentioning the Royal Grotesk from the Theinhardt foundry as the source of Akzidenz Grotesk mager since 1955 at least. Papers in the Berthold Type Specimen Library, now in the Technik Museum in Berlin, confirm this. So the idea of Royal Grotesk being the predecessor of Akzidenz Grotesk must be reduced to the light weight. The other weights are likely to have been based on typefaces from other foundries. ‘Halbfette Bücher Grotesk’ from Bauer & Co, Stuttgart, 1896 is officially known to be the predecessor of Akzidenz Grotesk bold condensed from 1955. Where the other weights come from, I wouldn’t know, but according to Wolfgang Homola’s [Type Design in the age of the machine](http://web.archive.org/web/20140804074914/http:/www.typefacedesign.org/resources/dissertation/2004/WolfgangHomola_dissertation.pdf), it is likely that the ‘Breite Grotesk’ by J. G. Schelter & Giesecke could have been an inspirational source in this case. From this publication one can also read that in those days, the German use of mager rather refers to what we now would call regular than light. Also breit often seems to refer to regular width rather than wide. Maybe this has to do with the fact that many of the Textura and Fraktur faces were rather condensed and heavy.\n\n"
    },
    {
      "time": "3 Sep 2013 — 5:44am",
      "content": "\"I wonder what is the first typeface that features light and ultra light weight?\"\n\nI want to bet, that the very first light type was an overused regular type that someone came to like, that was further overused to become the first ultra light type. :)\n\n"
    },
    {
      "time": "3 Sep 2013 — 6:23am",
      "content": "\"I want to bet, that the very first light type was an overused regular type\"\n\nSo wrong, the first Light type was brewed in a blanket-less Vanderccok to keep it Rocky Mountain cold, I know, it was a tough way to lose weight ;-P\n\n"
    },
    {
      "time": "3 Sep 2013 — 7:24am",
      "content": "Damn,  \nI was gonna say packing but since the blanket makes you warm, I thought it was cool and just ignore that the Vandercook was not an offset press ;-/\n\n"
    },
    {
      "time": "3 Sep 2013 — 12:34pm",
      "content": "Is this Light Enough?\n\n ![](http://web.archive.org/web/20140804074914im_/http:/typophile.com/files/Latin-512-French_4773.png)\n  \n [http://www.latin512.com](http://web.archive.org/web/20140804074914/http:/www.latin512.com/ \"http://www.latin512.com\")\n"
    },
    {
      "time": "3 Sep 2013 — 1:25pm",
      "content": "<cite>Drawing light styles is a lot less work than bolder ones</cite>  \nMethinks you haven't drawn many light weight types.\n\n"
    },
    {
      "time": "3 Sep 2013 — 1:50pm",
      "content": "> Is this Light Enough?\n\nIs _this_ light enough?! ![](http://web.archive.org/web/20140804074914im_/http:/www.lucasfonts.com/fileadmin/user_upload/fonts/TheSans/TheSansHair/styles/thesanshair_styles_H10__default.gif) [TheSans Hair](http://web.archive.org/web/20140804074914/http:/www.lucasfonts.com/fonts/thesans/thesans-hair/styles/) H10 and H10 Italic, by Luc(as) de Groot.  \n ![](http://web.archive.org/web/20140804074914im_/http:/www.lucasfonts.com/fileadmin/user_upload/fonts/Taz3/Taz%20Hair/styles/taz_hair_styles_h04__default.gif) [Taz Hair](http://web.archive.org/web/20140804074914/http:/www.lucasfonts.com/fonts/taz/taz-hair/styles/) H04 and H04 Italic, by Luc(as) de Groot.\n\nNobody beats Luc(as). Nobody.\n\n"
    },
    {
      "time": "4 Sep 2013 — 4:43pm",
      "content": "James, I am impressed by Latin 512, an almost smooth continuum from the posted sample that looks like it was a Latin light from a 19th century specimen book to a heavy Latin. The old timers never even attempted a rough consistency between weights. Would an Ultra Thin -- similar to Luc(as) de Groot's Hair weight -- make any sense?  \nDon\n\n"
    },
    {
      "time": "4 Sep 2013 — 6:39pm",
      "content": "I don't know Don.\n\nI think the Extra Thin weights of the Latin 512 are the lightest I would go, but who knows, if there is a definite demand I'm not adverse to going lighter. Maybe not one-unit thin as Lu(cas) has done but perhaps lighter.\n\n"
    },
    {
      "time": "5 Sep 2013 — 6:46am",
      "content": "Albert Jan Pool said:\n\n> Univers rather roots in the alphabets made by Walter Käch, Frutigers teacher than in Akzidenz Grotesk. Kächs work is likely to be influenced by Akzidenz Grotesk, but the rational approach, the clean counters and the consequent horizontally cutting-off the stroke ends of a, c, e g and s in all weights and widths of a sans serif typeface can be found in the work of Käch. Kächs alphabets have been published, but for those who do not want to collect antique type books: some of it can be found in the book s on and by Frutiger, mainly in the publication by Heidrun Osterer.\n\nMuch appreciated. Another fine rundown.\n\n"
    },
    {
      "time": "5 Sep 2013 — 11:29am",
      "content": "Here are some named Light faces from a 1929 type shop catalogue (Moore, Toronto):\n\n ![](http://web.archive.org/web/20140804074914im_/http:/typophile.com/files/Moore_1929_6047.jpg)\n\n"
    },
    {
      "time": "5 Sep 2013 — 11:38am",
      "content": "An essay on the vogue for thin types, c.2000:  \n [Seeing the Light](http://web.archive.org/web/20140804074914/http:/www.shinntype.com/Writing/SeeLight.pdf)\n\n"
    },
    {
      "time": "5 Sep 2013 — 1:29pm",
      "content": "Insightful article Nick. The conclusion about ageist fine print rings true with me. Sometimes I actually want to read the fine print in an ad and the most efficient way to do so is to scan it and look at the results onscreen!  \nThis may confabulate the issues of fine and tiny print. But it's a point well taken.  \nAs for \"fine\" meaning thin or light print, I find your gallery of thin types to be a good survey of what happens to different type categories -- not just the sans -- when they go on an extreme diet. They loose much of their distinctiveness and all of them end up looking more or less like an emaciated typewriter font. I can see some use for such types at large scale for headings or short text on smooth quality paper, e.g. a Vanity Fair full page advert.  \nThe samples posted so far have not included light Fraktur. Even this is possible. The lower case usually looks o.k. but the capitals are like a maze. An example, Commercial type's Marian Black:\n\n ![](http://web.archive.org/web/20140804074914im_/http:/typophile.com/files/MarianBlack@CommercialType_6610.jpg)\n  \nDon \n"
    },
    {
      "time": "5 Sep 2013 — 1:48pm",
      "content": "> Seeing the Light\n\nThank you. Deeply appreciated.\n\n“There’s a fine line between simplicity and losing its personality.”  \nPriceless!\n\n"
    },
    {
      "time": "30 Jan 2014 — 8:28pm",
      "content": "I can't believe nobody has linked to this yet:  \n [http://typophile.com/node/14722](http://web.archive.org/web/20140804074914/http:/typophile.com/node/14722 \"http://typophile.com/node/14722\")  \n;-)\n\nhhp\n\n"
    },
    {
      "time": "1 Feb 2014 — 6:50am",
      "content": "There are light typefaces from long ago, but what about light _as a weight_?\n\nI'd be tempted to blame Univers, but the concept probably dates back earlier.\n\nAh, it certainly does: Bernhard Gothic Light is an example from the classic period.\n\n"
    },
    {
      "time": "1 Feb 2014 — 9:21am",
      "content": "Light \\_as a weight\\_ would seem to have been a component of the creation of formal font families, Cheltenham etc., cira 1900. By the 1923 ATF catalog the font family system was well established. As to which font family formally identified a font in the family as the \\_\"light\" weight\\_, this would take a little digging.  \nDon\n\n"
    }
  ]
}
