{
  "id": "10604",
  "title": "Logo Help",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I just discovered this site about a week ago and have enjoyed reading the mostly honest and thought out critiques here (It's rare to find that in most forums)   \n   \nAnyway I thought I would take advantage of others experience and see what I could do to improve on this logo.   \n   \nThe company is a small employment agency that wants to seem \"contemparary, national, and friendly\" She has looked over a few samples I provided her and likes this one, but I think it needs a little more, It does'nt have much personality yet.   \n   \nAny suggestions, tips, etc... would be a huge help.   \n   \n ![GP Logo](http://web.archive.org/web/20131108205129im_/http:/www.typophile.com/forums/messages/29/70969.gif)\n\n",
  "author": "voiceof",
  "time": "28 Apr 2005 — 2:44pm",
  "uid": "4114",
  "comments": [
    {
      "time": "28 Apr 2005 — 6:40pm",
      "content": "just for legibility sake, on the first one I can reed the \"g\" a lot better. As for the smile concept below it need maybe a bigger/different smile bellow. Have you tried to apply color to the 2 words?\n\n"
    },
    {
      "time": "29 Apr 2005 — 5:32am",
      "content": "Option one seems to me to be the one to go with. You could make the g have a lopsided (more to the right and tapered) grin and curve/shape the ear or develop a two storey g. If you follow Adriano's suggestion of two colours you could kern the dp.\n\n"
    },
    {
      "time": "7 Jul 2005 — 2:05pm",
      "content": "I like it - I think it is simple and clever and very friendly. Don't be distracted by trying to prove it is designed. I think perhaps a weight change in single color versions would help and might give that tiny bit extra you are looking for. I would love to see what two colors you plan to use as I think that the branded image and trade dress will carry a large part of the personality as well. I am eager to see where you go with it. Good job.\n\n"
    },
    {
      "time": "8 Jul 2005 — 5:57pm",
      "content": "What's up with the spacing between d and p? You have such tight tracking that the space looks odd.\n\n"
    },
    {
      "time": "9 Jul 2005 — 1:14am",
      "content": "Voiceof,\n\nI just found this thread, and I must say I kinda like the logo. I don't know if I'm to late with my answer, but I'll do it anyway. The idea is good and it has a personality for itself. As a logo I think it'll work.\n\nMaybe try to take the 'serifs' (or how are they called?) off of the 'p' and 'd' to accentuate the circles more. The stems then connect directly to the circle without that little serif.  \nYou have to re-space it a bit then and do some optical glyph corrections, but that might work.\n\nRegards,  \n®ené\n\n**Also tired of Helvetica?** Get an **[Insider](http://web.archive.org/web/20131108205129/http:/www.characters.nl/)** with more personality\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20131108205129/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    }
  ]
}
