{
  "id": "106003",
  "title": "Helvetica Neue Alternative for theme... must look very much like the iOS Header fonts.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "header",
    "Helvetica",
    "ios",
    "Neue"
  ],
  "content": "I need a FREE font, that is VERY SIMILAR to the font used in iOS Headers. As far as I know, this is Helvetica Neue, but I can't use the free webfont version as I need to be able to distribute it... this is for a free page heme for tumblr, so no profit is made from this.\n\n",
  "author": "markscamilleri",
  "time": "2 Sep 2013 — 11:43am",
  "uid": "214486",
  "comments": [
    {
      "time": "2 Sep 2013 — 8:42pm",
      "content": "TeX Gyre Heros or FreeSans could be an option — these are both based on URW Nimbus Sans L, a freely-licensed version of Helvetica released under the GPL. These fonts, however, are based on the original version of Helvetica rather than Helvetica Neue, and only come in regular, italic, bold and bold italic.\n\n"
    },
    {
      "time": "3 Sep 2013 — 1:11am",
      "content": "the original version of Helvetica\n\nPleae note that the L in URW Nimbus Sans L stands for Laserwriter. It was me who introduced the L in the URW font names to distinguish the URW LaserWriter clone fonts from other versions of fonts with the same name. So URW Nimbus Sans L is not ‘the original version of Helvetica’ it is a clone of Helvetica which tries to match the PostScript version made by Adobe by the time first Apple LaserWriters were enabled to handle downloadable or pre-installed scalable PostScript Type1 outline fonts. Adobe has been improving these fonts several times and URW has tried to track them throughout the years.\n\nOn its turn, the Adobe version of Helvetica has not much to do with the original versions of Helvetica made by Haas, Stempel or Linotype. The italics of the Adobe version started their life as electronically slanted versions of the roman and not much fundamental has changed ever since.\n\n"
    },
    {
      "time": "3 Sep 2013 — 1:33pm",
      "content": "Helvetica \"Oblique\" was a shortcut to save the poor LaserWriter's precious memory. Examining how that worked introduced me to the inner workings of Font Matrixes, though, so it wasn't all for nothing.\n\nRemind me again: was Helvetica Narrow also a fake font? Searching for that data, a bit of a surprise popped up: This (self-declared \"old\") page: [http://support.apple.com/kb/TA40127?viewlocale=en\\_US](http://web.archive.org/web/20141116092339/http:/support.apple.com/kb/TA40127?viewlocale=en_US \"http://support.apple.com/kb/TA40127?viewlocale=en\\_US\") states\n\n> The LaserWriter does not use true fonts for Bold, Italic, and so on. Instead it does some algorithmic calculation to create the these fonts from the plain typeface.\n\nSurely that's a bit of an exaggeration?\n\n"
    },
    {
      "time": "4 Sep 2013 — 6:22am",
      "content": "Hi, thanks for all your inputs. You've all been mentioning \"Laserwriter\", will these type of fonts still work for a website theme? (or just for the web?) thanks\n\n"
    },
    {
      "time": "4 Sep 2013 — 8:18am",
      "content": "> Remind me again: was Helvetica Narrow also a fake font?\n\nYes, it was just a horizontally scaled version. Condensed italic was scaled and slanted\n\n> The LaserWriter does not use true fonts for Bold, Italic, and so on. Instead it does some algorithmic calculation to create the these fonts from the plain typeface.> Surely that's a bit of an exaggeration?\n\nNo. The notes on the LaserWriter describe what the first generation did under Apple’s QuickDraw using bitmapped fonts. The later LaserWriter Plus version, had 13 scalable Adobe PS Type1 outline fonts on board: 4 Helvetica, 4 Times, 4 Courier and 1 Symbol. The next generation, LaserWriter II NT and NTX, had the aforementioned 35 Adobe PS Type1 outline fonts on board and other PS Type1 fonts would be downloaded to the printer. The 35 Adobe PS Type1 fonts had true bold weights for all the fonts, slanted italics for the sans serif fonts (Helvetica, Helvetica Condensed (squooshed from Helvetica) and ITC Avant Garde) and Courier. They had true bolds and italics for the serif fonts (Times, Palatino, ITC Bookman, New Century Schoolbook) and a true italic for ITC Zapf Chancery, plus Symbol and Dingbats makes 35. The slanted and squooshed fonts made it possible to put as much fonts as possible on the memory chips of those days.  \nIn those days they were known as the ‘LaserWriter 35’. Everyone in the type industry was busy cloning them im some way or another.  \nConsidering the first LaserWriter being a non-PostScript device, my description and the ‘L’ are a bit confusing. The URW ‘L’ fonts do not emulate the Apple LaserWriter fonts, they emulate the Adobe/Linotype PS Type1 outline fonts that were made to run as from the Apple LaserWriter Plus\n\nAs far as I know, the present versions of the URW ‘L’ fonts perform very well on websites, but from an aesthetic point of view one must consider that especially the proportions and metrics of Helvetica still suffer from memory restrictions of the Apple LaserWriters.\n\n"
    },
    {
      "time": "6 Sep 2013 — 2:25pm",
      "content": "Ok, but do these fonts work on the web?\n\n"
    },
    {
      "time": "8 Sep 2013 — 7:46am",
      "content": "Well enough for me, but you'll really have to suck it and see for yourself how well they'll work for you.\n\n"
    }
  ]
}
