{
  "id": "106054",
  "title": "Fontlab metrics window",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi all,\n\nI'm still new to Fontlab but have built a font with a swashed Cap. All i want to do is check my kerning/metrics in the metrics window, but I can't figure out the Fontlab manual – how do you type the swashed character in?\n\n",
  "author": "stewdeane",
  "time": "4 Sep 2013 — 3:58am",
  "uid": "212206",
  "comments": [
    {
      "time": "4 Sep 2013 — 4:55am",
      "content": "The swashed characters are called A.swsh B.swsh etc etc\n\n"
    },
    {
      "time": "4 Sep 2013 — 5:05am",
      "content": "Any glyph can be entered by its name using the slash:\n\n ![](http://web.archive.org/web/20140809095922im_/http:/typophile.com/files/image_01_3427.jpg)\n\n"
    },
    {
      "time": "4 Sep 2013 — 6:19am",
      "content": "Thanks Johny, that's much appreciated.\n\n"
    },
    {
      "time": "4 Sep 2013 — 11:07am",
      "content": "Another method: select (click on with command key down) the glyphs in the Font window and hit “command option shift M”, which will open the Metrics window with those glyphs showing.\n\n"
    },
    {
      "time": "4 Sep 2013 — 11:38am",
      "content": "What a pain! In FontForge (still the old MacPorts version), I can type the text, select the features kern, ss01, ss03, ss04 and get the result in the kerning window.\n\n ![](http://web.archive.org/web/20140809095922im_/http:/typophile.com/files/kerning_5054.png)\n  \nHere the font is Hypatia. \n"
    },
    {
      "time": "6 Sep 2013 — 4:29pm",
      "content": "You can do the same thing in FontLab Studio in the Preview window. Even applying kerning.\n\nAdmittedly, it doesn't show the numeric readouts in that window; you'd have to paste the list of resulting back into the metrics window. So I'll grant that the FontForge approach is slightly better integrated.\n\n"
    },
    {
      "time": "7 Sep 2013 — 7:40am",
      "content": "That Font Forge Metrics Window looks dreadful. How can anyone space letters with those vertical lines running between each pair? Ouch! Can they be hidden?\n\n"
    },
    {
      "time": "7 Sep 2013 — 8:55am",
      "content": "Those lines disappear when we are actually kerning, so I find they provide useful information without bothering too much. They were removed in the github implementation.\n\n ![](http://web.archive.org/web/20140809095922im_/http:/typophile.com/files/kern_4800.png)\n  \nMaybe it looks better but for me functionality is more important. One of those functionalities I can't do without is python. \n"
    },
    {
      "time": "8 Sep 2013 — 6:32am",
      "content": "I just took the time to check at home (I was out of town in the previous post) and that \"cute\" kerning window in the github FontForge version changes the side bearings instead of kerning; what a mess!\\*At least my old MacPorts version does its job.\n\n\\*See post below. It is just some default values that were changed.\n\n"
    },
    {
      "time": "8 Sep 2013 — 1:18am",
      "content": "View -\\> Show Grid -\\> Hide (or Partial or Hide When Moving)\n\n"
    },
    {
      "time": "8 Sep 2013 — 6:57am",
      "content": "Good to know.\n\nAnd to get kerning, I see that we can set `Metrics > Window type > Kerning only`. The default values have been changed.\n\n"
    }
  ]
}
