{
  "id": "106118",
  "title": "Big, fat, hairy licensing question",
  "forum": "General Discussions",
  "tags": [
    "embedding",
    "General Discussions",
    "License",
    "mobile applications",
    "pdf"
  ],
  "content": "I've been purchasing the font licenses for a large ad agency for 16+ years. We have over 600 users in 20 locations around the world. This past year, font license compliance has become a much larger part of my job , so I now have time to see where we might be lacking in coverage. We have a font server, so I know we're in compliance with desktop licenses. My main concerns now are PDF, mobile app, and eBook embedding licenses that might be required, depending on the foundry.\n\nFor the sake of trying to keep this long post from getting even more out of control, I'll focus on PDF embedding. All PDFs are secure, view and print only. Editable embedding is not a requirement.\n\nMany foundries require a special license if the PDF will be distributed, such as placing it on a website. We create the PDF and send it to the client, who then distributes it. After talking to several foundries, and buying a number of PDF embedding licenses, I'm finding most of them require the client be the licensee, since they are the owner of the content or publisher. This has the added benefit of covering all agencies working on their behalf, they just need to buy their own desktop license.\n\nMy questions are mostly in regard to legal responsibility. If the foundry says the client needs to be the licensee, is it only the client who would be held legally responsible for NOT having the embedding license? Or would we be liable, as well? I ask this because telling the client they need this additional license, in some cases years after we began using a particular font, is not going over well. Many of these licenses are very expensive. The most expensive so far, Akzidenz Grotesk, is $2500 per font weight per client, just to use it in PDFs. This license is required by the foundry regardless of whether the fonts are embedded, rasterized or outlined, so no getting around it. If we were to use all 30 weights in PDFs, that would be $75,000 per client! I picked the most extreme example, but quotes from other foundries have been in the $10-$20k range, as well.\n\nI believe we have an ethical responsibility to let the client know these specialty licenses are required to help them avoid potential legal action. For one, we're usually the entity that selected the font, and two, it's not on any clients' radar that when we send them a PDF, they need to look into font licensing of all things! How would they know this?\n\nI just want to be reasonable about this, and not come across to my co-workers and clients like I'm out on a witch hunt to make them pay. I've already been called the \"Font Nazi\", and don't want to come across that way. I simply want to do my job and help everyone avoid any trouble. Obviously, there are some people within my company who believe this is important, or they would not be paying me to do this, but no one has a clue about my legal concerns.\n\nI'm now putting processes into place to provide complete quotes for all potential font uses up front so the artists and clients can make more informed decisions when selecting fonts. This doesn't help with the hundreds of font families already in use, however, so I'm making my way through 160+ different EULAs to find out which ones require more licensing. What may start out as a $500 desktop font family for 5 users can snowball into tens of thousands if the scope of work includes distributing PDFs, eBooks, mobile apps, and using web fonts, all of which are becoming the norm.\n\nI just don't know what to do when I'm told \"the client won't pay for this\" or \"the client is going to be pretty upset about this news\". If the client is unwilling to secure the required license, do we ask them to put in writing that they are knowingly taking their chances with legal action, so we cover our butts? Should we just not worry about it, and take the position \"we told them, that's the best we can do\"? Can we be held liable since we create the PDFs and send them to the client? I understand the answers could vary by foundry. Does anyone really care? It almost seems like we're the only agency who even knows these licenses exist.\n\nI try to keep up on the latest font related lawsuits, and I have never seen one concerning an embedding license, but that doesn't mean it hasn't happened or won't in the future, and I would never recommend to a client to take that risk. I use this info more to convince them that lawsuits do happen, and they should take them seriously. The foundries obviously believe these licenses protect their investment and provide revenue so they can design more fonts. Whether we realized these additional licenses were required at the time we purchased the desktop license or not, I realize that's the situation now, and I'm trying to make it right. I just don't know how to respond to the clients and co-workers who just don't get it.\n\nI have also recommended changing fonts in some cases, but that is almost impossible for some of these multi-million dollar brands with agencies all over the world, and files everywhere. You would never get to the bottom of it.\n\nI realize I'm in a unique situation to have a job dedicated to this endeavor. I'm both excited and overwhelmed at the amount of work yet to be done, although I think we're way ahead of most agencies. Groups 10 times our size don't seem to have a dedicated font buyer. I've been told repeatedly by other agencies working for a mutual client that they took care of all of the required font licensing, only to find out they only purchased a desktop license, but have been embedding the fonts in iPad apps, eBooks, PDFs, the web, you name it, all without a clue!! And these are big agencies doing this. If most agencies don't know or care about embedding licenses, how are the clients to know or care?\n\nI would appreciate any insight, or examples of how you have handled these situations. Even our corporate attorneys don't have any answers, so I'm on my own here.\n\nThank you. Sorry this is so long! My first post, so I've been holding a lot in!! :)\n\n",
  "author": "FontDiva",
  "time": "5 Sep 2013 — 1:29pm",
  "uid": "212433",
  "comments": [
    {
      "time": "5 Sep 2013 — 1:50pm",
      "content": "There is one thing that may help in some cases. A font can be used in a PDF document without being embedded in it through something called converting to outlines. Of course, some licenses may not consider that enough, since the outlines are a part of the copyrighted font. But it may help in some cases.\n\n"
    },
    {
      "time": "6 Sep 2013 — 2:43am",
      "content": "> I've already been called the \"Font Nazi\"\n\nBeen there, been called that! No one likes compliance or what comes across as inhibiting creative freedom when you start talking about dollar amounts and restrictive usage but it is rewarding to work through and you are taking exactly the right steps.\n\n> I realize I'm in a unique situation to have a job dedicated to this endeavor.\n\nIt may be helpful to know that you are not alone in doing this and it was the majority of my job for many years, in publishing rather than advertising but doing exactly the same thing. What you may find, particularly if you are working alone, is that the task of accounting for and tracking all usages is simply impossible for one person and approaching it with a strategy of damage done vs work in progress is more productive. You could spend many years (I have) trying to sort through legacy work that has already gone out and account for what should have been done with licensing, but it would probably be more constructive to draw a line and figure out what you should be doing and how it would be best to manage license administration moving forwards.\n\n> but quotes from other foundries have been in the $10-$20k range, as well.\n\nBeing mindful of the costs you could consider a process where licensing is incorporated into the costs of new projects; if your business and clients begin to understand to what extent it is effecting their costs they are likely to be more mindful of how they work with fonts. If having a Berthold font as part of a campaign, if absolutely nothing else will do, then perhaps the cost of licensing accordingly will not be a major stumbling block, particularly if presented with those costs before they make a final decision.\n\nYou will always be mindful of what you need to do to clean up any work where you might have been in violation of a EULA in the past, but if you settle on a strategy for compliance in the work you are doing now then you will be able to address those concerns more easily in the future.\n\nThere are numerous strategies you could adopt but will probably find that the way you use fonts, the nature of using them with multiple third party clients and the budgets associated with those projects will dictate to some extent what strategy you adopt. One of the most useful approaches is looking at the fonts that are used most often and identifying the key designers, foundries and developers responsible for those fonts, at which point engaging directly with those people is often the most rewarding solution. If you are lucky enough to be able to narrow usage down to a handful of foundries then you could look at negotiating custom licensing with those foundries to support your usage and only use those fonts (if possible) in the future. By posting here you are already (indirectly) starting that process. While litigation is a concern the nature of most lawsuits points to flagrant abuse of licensing, something you are going to pains to avoid. In every case where I have spoken directly with designers, developers and foundries I have been able to establish a rewarding relationship and found them very happy to work with us to look at solutions.\n\n"
    },
    {
      "time": "6 Sep 2013 — 7:37am",
      "content": "Karl, thank you so much for taking the time to respond at such length, and read my full post to begin with!! :) I agree that time limitations, and the fact that it is just me, will probably dictate that I focus on new projects and let go of the old stuff. It was also nice to hear from someone who has been in this situation. You made some good points, and I will definitely save this for future reference! :)\n\n"
    },
    {
      "time": "6 Sep 2013 — 8:28am",
      "content": "Yea, this can be a last resort option in some cases. Some foundries either don't allow outlining, or require a license either way, such as Berthold.\n\n"
    },
    {
      "time": "6 Sep 2013 — 8:32am",
      "content": "Oops! Meant to put this under quadibloc's reply about outlining the text.\n\n"
    },
    {
      "time": "6 Sep 2013 — 9:38am",
      "content": "Of course, you could use the fonts in a Word document, print it out on a laser printer, scan the pages, and make a PDF from the images when outlining isn't enough. But I presume the results from that would not be of acceptable quality.\n\n"
    },
    {
      "time": "6 Sep 2013 — 9:50am",
      "content": "Scanning printed pages would also increase the file size. and would make it impossible to copy text from the PDF. Outlining the text would create the same copying problem. (I'm not talking about copying fonts, but just copying a few sentences of text and pasting them into an email, for example.)\n\n"
    },
    {
      "time": "6 Sep 2013 — 1:45pm",
      "content": "\"A font can be used in a PDF document without being embedded in it through something called converting to outlines.\"\n\n\"scan the pages\"\n\nNote that both of these solutions, however, destroy the actual text content of the document, making them unable to be indexed and not accessible to assistive technologies, so neither is typically a great solution--at least for corporate marketing and communication materials.\n\n"
    },
    {
      "time": "6 Sep 2013 — 1:46pm",
      "content": "\"Some foundries either don't allow outlining\"\n\nHow is that even possible? That's like saying \"you can use this font, but...well, no actually you can't use this font\"\n\n"
    },
    {
      "time": "6 Sep 2013 — 2:27pm",
      "content": "Of course scanning printed pages is not really an acceptable solution from a quality standpoint. But if changing the typeface is not an alternative, and paying the license fees is not accepted, it is all that is left.\n\nOf course, when it comes to trademarks and logos, they can be images while the rest of the document is in a typeface with acceptable license terms.\n\n"
    },
    {
      "time": "6 Sep 2013 — 6:46pm",
      "content": "> Of course, some licenses may not consider that enough, since the outlines are a part of the copyrighted font. But it may help in some cases.\n\nUsual caveat, I'm not a lawyer. But this is not correct. The copyright applies to the software, so outlining removes that issue. The design may also have protection (patent, isn't it?), but it is different from the copyright and of a shorter duration. Must be applied for separately, and incurs a separate fee -- and far easier to challenge, I'd bet. A search among Thomas Phinney's posts might give the whole picture.\n\nAll the other problems with outlines noted remain -- they are pictures, not text.\n\n"
    },
    {
      "time": "6 Sep 2013 — 10:10pm",
      "content": "\\> you could use the fonts in a Word document, print it out  \n\\> on a laser printer, scan the pages, and make a PDF\n\nOr save the Word doc as a PDF, import the PDF into Photoshop at a high resolution, then save as a Photoshop PDF.\n\nNo printing, no scanning, and you could easily set up a PhotoShop Action to process a folder of PDFs automatically.\n\nIf done properly the quality would be pretty good, although you're still stuck with a PDF that's a image, with all the disadvantages mentioned previously.\n\n"
    },
    {
      "time": "6 Sep 2013 — 10:13pm",
      "content": "\"If the foundry says the client needs to be the licensee, is it only the client who would be held legally responsible for NOT having the embedding license?\"\n\nThis seems to be maybe the most important question in the post, which hasn't really been answered yet. I don't know what the answer is, but let's not get too hung up on roundabout ways to avoid embedding font data in PDFs and look at the bigger question here.\n\nI will emphasize, though, that as Charles said, fonts are only protected (in America) as software — in other words, the _code_ that defines the font is copyrighted — and very occasionally by design patents. But as soon as you outline the type you are no longer distributing the code that defines the font so you are not infringing anyone's copyright. I don't know of any foundry EULAs that pretend to believe that distributing vector images of their fonts legally infringes their copyright. It doesn't. If any EULAs do claim this, I would imagine it would be a pretty hard position to defend legally. And it would then be a case not of a breach of intellectual property law (copyright), but a simple breach of contract — in other words, it wouldn't be inherently illegal; it would only be breaking an agreement that you signed when you bought the font. Not the same thing. But of course, I'm not a lawyer …\n\n"
    },
    {
      "time": "7 Sep 2013 — 1:50am",
      "content": "<cite>If you wish to be obeyed, ask [something that is] obeyable.</cite>  \n– Arabic proverb\n\n"
    },
    {
      "time": "7 Sep 2013 — 5:57am",
      "content": "Perhaps the motto of the new Monotype Conglomeration:\n\n<cite>\"...the finest fonts our lawyers can bring you...\"</cite>\n\nOnce you leave the world of art (\"pure,\" or whatever modifier you want), \"use\" is a factor. So designer skill -- graphic designer here -- includes the ability to select and use fonts that have reasonable site licenses. End of problem.\n\n(Edit:) a very off-topic note to Joshua -- Just looked st your web site. Wonder if you know my cousin, David (Ellertson)?\n\n"
    },
    {
      "time": "7 Sep 2013 — 7:34am",
      "content": "(No, Charles, I don't know David. Maybe I should? Googling the name didn't seem to find the right one, but then I don't know who exactly I should be looking for.)\n\n"
    },
    {
      "time": "7 Sep 2013 — 8:16am",
      "content": "(Boy, to really go off-topic in the thread -- David is a set designer at the Met. Believe the official title is: \"Resident Assistant Scenic Designer at Metropolitan Opera.\"\n\nI noticed on your web site that in addition to type, you were involved with set design. Before becoming involved with type, I was a recording engineer, with some involvement in theater, esp. dance. I've long pondered the relationship between type and music; they seem so disparate, in that with music you control time. Very difficult to control time with graphics. And yet in ways I can't explain, there are similarities. I'm always fascinated to find people involved in both.)\n\n"
    },
    {
      "time": "7 Sep 2013 — 9:43am",
      "content": "(Yes, I'm actually a professional lighting and sound designer in the theatre in addition to a graphic designer. I don't know about time in _graphics_ per se, but _books_ certainly have a rhythm to them. As do performances. But I feel like we should take this to a different thread, so I'll start one.)\n\n… and now back to your featured content.\n\n"
    },
    {
      "time": "19 Sep 2013 — 1:48pm",
      "content": "There are a number of foundries that don't allow outlining the text in their EULA without an additional license. It might not be part of US law that protects the font software, but when you purchase a licensed product of any kind, you are in fact agreeing to their terms, which I assume could hold up in court if they were found to be in violation. Many EULAs have restrictions that can be difficult to follow. I'm finding a lot of foundries going to more of a model like rights-managed photography. A license I purchased from Durotype, for instance, required an \"Addendum for Large Scale Use\", and was based on the client's yearly revenue. There are so many EULAs out there with different requirements it will make your head spin!\n\nThere are also some foundries, such as Berthold, which require a special license to use even a picture, scan, image of any kind or format of their fonts in any digital way, such as displayed on an LED screen, iPad, website, etc. With those foundries, none of those workarounds would suffice if you follow the letter of their EULA. I've exchanged probably a hundred emails with Harvey at Berthold, and have a pretty good grasp at this point of their EULA, and their desktop license doesn't give you much, uh, license! You can use the fonts in print, but that's pretty much it. No PDFs outside your company, and even your printer needs to have a license for the exact same version of the fonts you're using. There are 5 versions of the OpenType fonts alone! Oy-vey!!\n\nAlso, in many cases it is desirable to have the text of a PDF be searchable online, and outlining or rasterizing the text would remove that functionality.\n\nMy main question, indeed, was about liability. A complex issue, for sure, and definitely hard to find clear answers.\n\n"
    },
    {
      "time": "19 Sep 2013 — 3:38pm",
      "content": "With the caveat that I'm from the book world, not advertising, I'd offer the following.\n\nFirstly, while I don't select the fonts used in the books we set, or not often, the designers do listen. And what I tell them is there are plenty of fonts whee the publisher's EULA allows the normal things publishers do. An additional license for ebooks, sure, as long as it isn't too dear. Anything else, drop that font publisher. There are a lot of fonts out there -- far more than the 5 or 6 one could expect from a printer for the first 500 years. And far, far more than anyone needs. A marketplace has two players, a supplier and a customer. Customer's get to vote with their money.\n\n(BTW -- There is one foundry that has in it's EULA that the content of the text has an effect on the price. If the text is religious or political in nature, the fonts cost more.)\n\nFor advertising, where no one will buy the product unless it is presented with just the right \"font\" (anyone believe this?), go back to hand lettering. Hire & pay for it.\n\nToo, I wouldn't be too sure what will hold up in court. A license can be revoked, but without further penalty. And a long time ago on Typophile, when we were discussing the difference between American and European laws, it was pointed out that while European copyright laws are stricter in some regards than those in the States, in Europe, parts of a license may be invalid (in some countries) if the font can't be used for what is reasonable & expected -- e.g., adding accents where the language of a country requires them. This came up regarding a \"no modification\" portion of a EULA, but it does show, I think, that while a publisher may put anything in a EULA they choose, it may not be enforceable.\n\nStill, the best thing us consumers can do is vote with our money. Just don't buy fonts from such publishers.\n\n"
    },
    {
      "time": "19 Sep 2013 — 6:40pm",
      "content": "I don't know if Charles was referring to my EULA when he stated this:\n\n<cite>(BTW -- There is one foundry that has in it's EULA that the content of the text has an effect on the price. If the text is religious or political in nature, the fonts cost more.)</cite>\n\nWhile I do have a clause in my EULA that requires written permission to use my font products for religious or political uses, it has nothing to do with charging more. If permission is granted no additional fee is charged. I just would rather not have my work associated with say, the Nazi party or Scientology or the Tea Party. Just trying to exert a little control as to what my work is associated with.\n\n"
    },
    {
      "time": "20 Sep 2013 — 10:06am",
      "content": "Ah, sorry James. Was trying to find an example of an unusual thing that could be in a EULA. I had thought at one time you wanted to make people pay a bit more for what I'd call pontificating. Seems fine to me, but they're your fonts.\n\nCurious though, if you allow the Young Democrats/Republicans/Socialists/Etcs. to use your fonts, what would the courts then say if you wouldn't give permission to the Young Neo Nazis? The legal system giveth, the legal system taketh away. The Great Ground of Being sides with the high-priced lawyers, don't you know...\n\n...Which reminds me of a friend who tried to synthesize Paul Tillich and the Southern Baptists. He came up with this as a parting phrase:\n\n<cite>May The Great Ground of Being bless you, real good.</cite>\n\n"
    },
    {
      "time": "20 Sep 2013 — 10:58am",
      "content": "Well, I do have a high-priced lawyer and he tells me I am on solid ground here. In fact when I wanted to put the clause into the EULA for written permission for political uses, he suggested I include religious as well.\n\nMaking stuff does give you the \"right to copy\", and legally you can exert control over who you give that permission to.\n\n"
    },
    {
      "time": "21 Sep 2013 — 3:58am",
      "content": "@Khaled,  \nGreat proverb, what is the original Arabic?\n\n"
    },
    {
      "time": "21 Sep 2013 — 9:43am",
      "content": "<cite>If the foundry says the client needs to be the licensee, is it only the client who would be held legally responsible for NOT having the embedding license?</cite>\n\n“The client needs to be the licensee” is not a good way to put it. The user of the font software needs to be the licensee. Is the font installed on desktop PCs? Then to which company do they belong? They need to be the licensee. Because the font is used on their machines. It doesn’t matter if it used to create work for a third party. Whoever uses the actual fonts files needs to be the licensee.  \nFor websites (and the webfonts or PDFs [with fonts in it] you put on this site) it depends on who is in charge. For every website someone is legally responsible. This is the <cite>user</cite> who needs to be the licensee of these digital publishing licenses. If the site belongs to the client and the client has a license for that use, then everything is fine and this is also correct:\n\n<cite>This has the added benefit of covering all agencies working on their behalf, they just need to buy their own desktop license.</cite>\n\nBut there can also be other cases. An agency might actually be in charge of a campaign and register a website for this campaign. Then they might responsible. I believe this is what happened in this case:  \n [http://blog.extensis.com/font-compliance/rick-santorums-website-using-pi...](http://web.archive.org/web/20150122201333/http:/blog.extensis.com/font-compliance/rick-santorums-website-using-pirated-font-leads-to-2-million-lawsuit.php \"http://blog.extensis.com/font-compliance/rick-santorums-website-using-pirated-font-leads-to-2-million-lawsuit.php\")\n\n"
    }
  ]
}
