{
  "id": "106104",
  "title": "Typeface and Fonts philosophy, history and art",
  "forum": "General Discussions",
  "tags": [
    "Aistory",
    "art",
    "font",
    "General Discussions",
    "typeface"
  ],
  "content": "Hello,\n\nI am a new member of this group. I am not a graphic designer, nor a font/typeface designer. However I am fascinated with fonts, their history, philosophy and art. And of course their creators.\n\nSince there is a note saying that any subject can be posted to this forum, here is where I am doing so. However, if there is a more appropriate forum to do so, I would be grateful to know about it.\n\nThank you,\n\nShab\n\n",
  "author": "Shab",
  "time": "5 Sep 2013 — 10:10am",
  "uid": "214588",
  "comments": [
    {
      "time": "5 Sep 2013 — 10:14am",
      "content": "Welcome!  \nYour subject line is _really_ broad... What are you interested in the most?\n\nhhp\n\n"
    },
    {
      "time": "5 Sep 2013 — 12:16pm",
      "content": "Sort of taking you at your word...\n\nFor handset type, up until the 1890s, I'd recommend Updike's <cite>Printing Types, Their History, Forms, and Use: A Study in Survivals</cite>\n\nOne link:  \n [http://www.abebooks.com/book-search/title/printing-types/author/daniel-b...](http://web.archive.org/web/20140919031743/http:/www.abebooks.com/book-search/title/printing-types/author/daniel-berkeley-updike/page-1/ \"http://www.abebooks.com/book-search/title/printing-types/author/daniel-berkeley-updike/page-1/\")\n\nIf you've used Abe's I'd reorient the search for hardcover, and most reliable retailers, then get whatever condition your budget allows. I've been at this over 30 years, and still consult Updike from time to time. Remember there are two volumes.\n\nOf course, there is always Amazon,  \n [http://www.amazon.com/Printing-Types-Their-History-Forms/dp/1584560568](http://web.archive.org/web/20140919031743/http:/www.amazon.com/Printing-Types-Their-History-Forms/dp/1584560568 \"http://www.amazon.com/Printing-Types-Their-History-Forms/dp/1584560568\")\n\nbut I don't think I'd want it (judgement not made by having one to hand). There was a good edition under the imprint of The Belknap Press of Harvard University Press, 1966.\n\nFor an interesting exploration on how the initial machines affected things, esp, Monotype, one picture -- or one tiny part, maybe -- is Dowding's <cite>Factors in the Choice of Type Faces</cite>. Wace edition, if at all possible. Skip the other Dowding book.\n\nAs you get into photocomp & the contemporary era, everyone's probably got an opinion. While I don't agree with some of what Kinross' author's say, I don't think anyone would debate the importance/quality of what the Hyphen Press publishes.\n\n[http://hyphenpress.co.uk/](http://web.archive.org/web/20140919031743/http:/hyphenpress.co.uk/ \"http://hyphenpress.co.uk/\")\n\n"
    },
    {
      "time": "5 Sep 2013 — 12:21pm",
      "content": "These are a good introduction:  \n [http://www.amazon.com/Type-Typefaces-Treasury-Typography-Book/dp/0918142121](http://web.archive.org/web/20140919031743/http:/www.amazon.com/Type-Typefaces-Treasury-Typography-Book/dp/0918142121 \"http://www.amazon.com/Type-Typefaces-Treasury-Typography-Book/dp/0918142121\")  \n [http://www.amazon.ca/Stop-Stealing-Sheep-Works-Edition/dp/0201703394](http://web.archive.org/web/20140919031743/http:/www.amazon.ca/Stop-Stealing-Sheep-Works-Edition/dp/0201703394 \"http://www.amazon.ca/Stop-Stealing-Sheep-Works-Edition/dp/0201703394\")\n\n"
    },
    {
      "time": "5 Sep 2013 — 9:05pm",
      "content": "A lot has been written on the art of making and using typefaces, and on the history of type.\n\nHow type relates to history in general, though, has only been hinted at in asides; i.e. that its development suffered in Spain and Russia because of heavy censorship. How it relates to philosophy has been touched on hardly at all.\n\nIt's not a coincidence that the Netherlands, home of the Elzevirs, has been very influential. Caslon, and even Times Roman, both show a profound Dutch influence.\n\n"
    },
    {
      "time": "6 Sep 2013 — 6:53pm",
      "content": "Well, hell, John. Those old punchcutters traveled around a lot, learning & leaving knowledge at each stop. Just follow the wanderings of the peripatetic Kis...\n\n"
    },
    {
      "time": "7 Sep 2013 — 6:16pm",
      "content": "Such a vast area.  \nSome examples on history and art movements:  \n1. Blackletter typefaces were an essential part of the issue of German cultural identity from the 15th century until about 1942, as opposed to the countries in the area formerly ruled by the Roman Empire. See \\_Blackletter: Type and National Identity\\_ edited by Peter Bain and Paul Shaw, 1998 ISBN 1-56898-2.  \n2. The development of display typography in the 19th century was fueled by the rise of the consumer society. Visual advertising was contested between typography and lithography. Type makers continually innovated to try and match the visual impact of lithography.  \n3. The rise of imperialism, jingoism, and assertiveness circa 1898 shifted typographic interest from fine esthetics and carefully constructed artistic printing to strong typefaces, such as Doric, a heavy sans designed for scare-head newspaper headlines such as \"War in Cuba.\"  \n4. The breakdown of Western Civilization's consensus of rationality, order and optimism in the early 20th century spawned radical new thinking in politics and the arts, including new typefaces which were designed for crude impact.  \n5. The post WWI zeitgeist of technological advances and sleek new products produced the Art Deco ethos, which included the geometric and simplified designs for typefaces  \n6. Science Fiction created a demand for futuristic technology typefaces, usually very simplified with bizarre features.  \nI trust you can think of many others.  \nDon\n\n"
    },
    {
      "time": "7 Sep 2013 — 6:47pm",
      "content": "Also interesting are historical advances that did _not_ affect the appearance of type — such as, for instance, the invention of printing. Gutenberg, of course, gave us his best impression of the scribal hand of a monk.\n\nAlso, the invention of digital type began not with forms that arose naturally out of the limitations of the medium but with desperate imitations of the best of the metal type era.\n\nOne possible conclusion: historical shifts outside the realm of typography have a more profound impact on the forms of letters than technological shifts within typography.\n\nThough this does ignore the contributions of individual designers, who, after all, are the people responsible for advances in the design of type.\n\n"
    },
    {
      "time": "7 Sep 2013 — 7:46pm",
      "content": "Type design is a very narrow and specific subject, when you focus just on letter forms. However, it lies at the intersection of art, science, industry, literature and culture, so in another way what is relevant to its history is vast. So really you have to start with a specific question—almost any will do, but it needs to be authentic, coming from you, and specific, if you are to make satisfying progress in your efforts, in my opinion. So what is your specific question?\n\nBasic more recent works than Updike that will give you some grounding are Bringhurst's _Elements of Typographic Style_, though it is narrower than it presents itself, and _Letters of Credit_ by Tracy, which is broader than it presents itself.\n\n"
    },
    {
      "time": "7 Sep 2013 — 11:44pm",
      "content": "I agree that it's sometimes useful to have a wide open brainstorming session at the start of a project as unfocused as this one. But then choices have to be made. Various posters have suggested a wide range of topics. This would be a good time for you to try and specify some terms of reference for your project. After you have some results is the time to look at a variation or a new issue.  \nAs a final comment, the references suggested are excellent and a worthwhile use of your time, but I would suggest that you also spend some time looking critically at a few type specimens from different periods -- some of the books have fonts organized by time period -- and ask some simple questions such as why did a new type design or fashion meet a need at that time and why was it abandoned later. The answer varies and says a lot about changing cultural values, technology, current events etc.  \nDon\n\n"
    },
    {
      "time": "8 Sep 2013 — 1:38pm",
      "content": "Don, the arts are not merely reactive, but, being part of cultural ecology, shape civilization.\n\nFor instance, with regard to your explanation of Art Deco, why did earlier eras of technological advances not produce Art Deco? And isn’t it putting the cart before the horse to say that “sleek new products” gave rise to Art Deco?\n\nParadoxically, the technological advances of the early 20th century were employed in the commercial arts to produce historicism. That was Benton’s agenda at ATF for Linotype, and Morison’s at Monotype.\n\n"
    },
    {
      "time": "9 Sep 2013 — 2:41pm",
      "content": "[Corrected post. Had bad connection and I mangled my post]  \nGood points Nick.  \nPerhaps what we have is a mutual influence process between technology, the arts, current events etc. The influence is clearly not one way. Each is both initiator and recipient.  \nThere is no hope of a \"true\" explanation that attempts to describe a complex relationship in a few words. My terse phrase about Art Deco clearly lends itself to interpretations that could indeed be seen as \"cart before the horse.\" This the reason for editing before publication. Unfortunately posting in an e-forum does not benefit from this.  \nAs for Benton and Morrison, a few thoughts, with which you may or may not agree.  \nBenton, encouraged by DeVinne during the Century project, was enamored by technology that could produce more precise typefaces. He was unsatisfied with the existing ATF font library, inherited from a hodgepodge of foundries and designers. His solution, as you note was historicism -- a quest to use new technology to produce revivals of the great designs of the 18th century and earlier that would meet the demands of industrial society. At ATF from the late 1890s onward he axed most of the fonts in the catalog -- with all their fascinating variety -- and directed the creation of a new precisely ordered, mechanized world of fonts.  \nThe adoption of new technology was in itself a forces for font redesign. For example, designing fonts for Monotype and Linotype machines was subject to severe design restraints.  \nDon\n\n"
    },
    {
      "time": "9 Sep 2013 — 3:02pm",
      "content": "Ignore this. Same post sent twice.\n\n"
    },
    {
      "time": "9 Sep 2013 — 9:52am",
      "content": "Nick, I don't see Benton an historicist. Is Hobo historicist? Or Souvenir? Benton just tried to produce better crafted versions of whatever was out there, plus some new designs like Clearface, and other things. To me he didn't really have an overall agenda, other than to sell type. He did have an approach to type, which was to keep himself invisible, and sell good craftsmanship. The historicism was under way, with William Morris having made it fashionable in the 90s. M.F. Benton is just riding the crest of all the various waves passing by.\n\nMorrison was clearly historicist, but even he is complicated. Monotype did revivals before his influence, and he championed Gill, and at least backed Times New Roman, which wasn't really historicist.\n\n"
    }
  ]
}
