{
  "id": "106153",
  "title": "1930's Prague Letterhead. Art Deco-ish Geometric Sans with swirly terminals.",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": "Font in the image was printed on a letterhead to be used in Prague in the 1930's. Super low x-height/tall ascenders, looks art deco. Would seem like a normal geometric sans except for the occasional swirly terminal. Would this have been a font specific to the area, or would it have been imported (the type or even just the letterhead) from another country? Is this a specific typeface or perhaps it was modified or something to get the terminals?\n\n| Attachment | Size |\n| --- | --- |\n| [Prague.jpg](http://web.archive.org/web/20150215140018/http:/typophile.com/files/Prague.jpg) | 13.7 KB |\n\n",
  "author": "zjrobbins",
  "time": "6 Sep 2013 — 5:46pm",
  "uid": "54066",
  "comments": [
    {
      "time": "7 Sep 2013 — 12:09am",
      "content": "I'm going to venture hand-drawn. As a thin, monoline geometric lettering style it's relatively straightforward to keep consistent with a ruler and compass. (Although it's still very skillfully done, not least the spacing!). What betrays it is the /S/es, none of which are alike.\n\n"
    },
    {
      "time": "7 Sep 2013 — 2:28am",
      "content": "The Prague letterhead is not in my standard references. So I explored some weak leads.  \nJan Tschichold did decorative lettering in the early 1920s with some similarities to the Prague letterhead. This was the basis for [ITC Ironwork](http://web.archive.org/web/20150215140018/http:/www.myfonts.com/fonts/itc/ironwork/%3Cbr%20/%3E/), designed by Serge Pichii in 1997. The unknown font in your image has some similarities to ITC Ironwork.\n\n ![](http://web.archive.org/web/20150215140018im_/http:/typophile.com/files/ITC_IronworkBEFHIJ_3482.jpg)\n  \nSchelter & Giesecke produced Tschichold fonts but I don't know if they had anything to do with the Prague letterhead font.  \nAs for modifications, this was not done for metal type in the way we now do for digital fonts. However, typefaces were used as models for lettering and engraving. I note there is variation in some letters, such as S, so this seems like a probable explanation.  \nA digital version is not impossible to create based on the information in your image. To assist in seeing the details I did a basic enhancement of it and rearranged the text to reduce horizontal sprawl:  \n\n ![](http://web.archive.org/web/20150215140018im_/http:/typophile.com/files/UnknownPrague1930sTypophile106153b_6667.jpg)\n  \nDon \n"
    },
    {
      "time": "7 Sep 2013 — 5:59am",
      "content": "In the ballpark, but a bit more extreme...  \n [http://www.myfonts.com/fonts/nicksfonts/darling-emily-nf/](http://web.archive.org/web/20150215140018/http:/www.myfonts.com/fonts/nicksfonts/darling-emily-nf/ \"http://www.myfonts.com/fonts/nicksfonts/darling-emily-nf/\")\n\n"
    },
    {
      "time": "7 Sep 2013 — 8:35am",
      "content": "Definitely in the ballpark Nick. Top heavy monotone and good spirals.  \nA few final thoughts.  \nThis is engraving, not lettering or a typeface.  \nSome of the effect can be replicated in Word and similar programs, except for the spirals by using medium [or lightweight] Neutraface Condensed with regular width letters substituted for C, D, G, J, M, N, O, Q, and X:\n\n ![](http://web.archive.org/web/20150215140018im_/http:/typophile.com/files/Prague1930sNeutrafaceCondRegBlend_4490.jpg)\n  \nIf you edit the font, e.g. vertical flip of B, width adjustments etc, and add some spirals like those in Nick's Darling Emily, you would be very close to the original.  \nDon \n"
    }
  ]
}
