{
  "id": "106129",
  "title": "Looking for your favorite hand writen typeface suggestions",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey all.  \nBrand new here and already asking for help.  \nI'm developing a political/social commentary comic strip and I'm looking for suggestions for the dialog typeface for the two main characters.  \nAnyone care to share their personal favorites or make a suggestion as to where to look ?  \nI'm thinking about starting out on utube and using the response to the strip to decide whether or not to print a collection in letter press, hardcover bound, limited run, real books.  \nNot looking to make money on this. Just doing the print run for fun.  \nRight now I'm lettering the dialog by hand but, aside from being nearly illegible, my handwriting is not distinctive enough to create two different typeface styles to clearly indicate the two different characters.  \nI plan to use different fonts to emphasize certain emotions and so forth but, like I say the basic dialog is going to be the long hard road for me.  \nAny help would be great !  \nMerl\n\n",
  "author": "Merl",
  "time": "5 Sep 2013 — 11:07pm",
  "uid": "214379",
  "comments": [
    {
      "time": "6 Sep 2013 — 9:15am",
      "content": "Here's a good place to start: [http://www.blambot.com](http://web.archive.org/web/20150420022206/http:/www.blambot.com/ \"http://www.blambot.com\")\n\n"
    },
    {
      "time": "6 Sep 2013 — 11:12am",
      "content": "[http://www.fontsquirrel.com/](http://web.archive.org/web/20150420022206/http:/www.fontsquirrel.com/ \"http://www.fontsquirrel.com/\")\n\n"
    },
    {
      "time": "6 Sep 2013 — 7:36pm",
      "content": "Thanks to you bothe !  \nLots to look at from both sites.  \nI should go back in my personal archives and see what the old Doonesbury cartoons are done up with but, I don't want to just reuse the font from someone elses work.\n\n"
    },
    {
      "time": "6 Sep 2013 — 7:42pm",
      "content": "Suggestion: Use different fonts for different characters. Like Tekton for a rational character, Comic Sans for a dumb teenager, etc.\n\nhhp\n\n"
    },
    {
      "time": "6 Sep 2013 — 10:18pm",
      "content": "It sounds like that's what the OP is planning.\n\nDoonesbury is hand-lettered, apparently by Trudeau's assistant. Presumably the older strips feature his own lettering.\n\n"
    },
    {
      "time": "11 Sep 2013 — 6:12pm",
      "content": "Thanks to Cyrus Highsmith (on Twitter) for pointing out a great example I had a fond memory of, but couldn't track down: [http://www.fontbureau.com/blog/for-spring-hath-sprung-the-cyclotron/](http://web.archive.org/web/20150420022206/http:/www.fontbureau.com/blog/for-spring-hath-sprung-the-cyclotron/ \"http://www.fontbureau.com/blog/for-spring-hath-sprung-the-cyclotron/\")\n\nhhp\n\n"
    },
    {
      "time": "16 Sep 2013 — 7:11am",
      "content": "HA, good old Pogo !  \nIt seems that this will be as challenging as I thought.  \nI was hoping to avoid having to hand letter but, the more fonts I try I feel like I'm pushing myself to do just that.  \nI create the line drawings of the two characters with an old CAD program but, so far any text I place, just seems out of place.  \nI am able to make free hand sketches with the CAD program but, I don't have the correct mouse to make the lines and hand written text as if I was using a pen. (do they make such a thing?)  \nI am going to look at some of these digital sketch pads but, I'm just not sure they will give me what I'm looking for without going to a really high end device, and I'm not ready to lay out that kind of scratch just yet.  \nThanks again for all the help !\n\n"
    }
  ]
}
