{
  "id": "1061",
  "title": "Only one typeface",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "in one of tschicholds writings i remember him pointing out \\>\\>a good type designer can design with only one typeface\\<\\< ... if you had to design various things with only one typeface, what would be your choice (and why)? gill sans, futura, helvetica, garamond, ... ?   \nmine would be gill sans, i really cant say why (sorry), i just love it.\n\n",
  "author": "lars",
  "time": "27 Aug 2003 — 1:12am",
  "uid": "2145",
  "comments": [
    {
      "time": "27 Aug 2003 — 3:54am",
      "content": "I prefer to kill myself than using one typeface only.   \n   \nCan you live with ONLY one book, one music CD, one wife, one child, one car, one house, one computer, one hamburger for the rest of your life? hein? ;-)\n\n"
    },
    {
      "time": "27 Aug 2003 — 4:42am",
      "content": "this was supposed to be a hypothetical question ![:-)](http://web.archive.org/web/20131018234838im_/http:/www.typophile.com/forums/clipart/happy.gif) but i have to admit i couldnt live without just one typeface, too ... i'll try not to wonder about your \"one car\" and \"one house\" - seems typofonderie is doing quite well? ;)\n\n"
    },
    {
      "time": "27 Aug 2003 — 8:13am",
      "content": "I was wondering about the \"one wife\" bit...   \n   \nAh, the French ...[slightly jealous grin]\n\n"
    },
    {
      "time": "27 Aug 2003 — 8:22am",
      "content": "others can wonder about puting hamburger, wife, car, computer on same level ;-) well, its depend who they are and what they think about theses various things.   \n   \neheheh. don't make any conclusion or dream my own way of life! ;-)\n\n"
    },
    {
      "time": "27 Aug 2003 — 8:29am",
      "content": "Jay said: \"about the \"one wife\" bit... [slightly jealous grin]\"   \n   \nare you married, Jay!? one is plenty for me!\n\n"
    },
    {
      "time": "27 Aug 2003 — 12:46pm",
      "content": "I can do one family per _project_. But why bother with one family for _everything_? Thank you, pre-digital writings.   \n   \nIf I had to, I'd probably pick a very extensive and dependable family, for example Minion. (that's not my choice, just an example)\n\n"
    },
    {
      "time": "27 Aug 2003 — 3:36pm",
      "content": "If I had to live with just one typeface, I'd pick one that would work well as a text face at most sizes, especially small. It's easier to make a text face work as a display face than to make a display face work as a text face. As such, most sans serifs would be ruled out, although a few might be in the running, like Gill Sans, Syntax, Scala Sans, Myriad, and the like.   \n   \nIf we're allowing the whole typeface family, I wouldn't worry so much about having an extensive range. The old masters made do quite nicely with roman, italic and bold. Instead, I'd focus on beauty, legibility, readability and timelessness.   \n   \nMy choices would likely boil down to one of:   \n   \na. AGFA-Monotype or Linotype Plantin:   \n   \n [http://www.myfonts.com/fonts/agfa/plantin/](http://web.archive.org/web/20131018234838/http:/www.myfonts.com/fonts/agfa/plantin/)   \n   \n [http://www.myfonts.com/fonts/linotype/plantin/](http://web.archive.org/web/20131018234838/http:/www.myfonts.com/fonts/linotype/plantin/)   \n   \n   \nb. either Adobe Garamond or Stempel Garamond:   \n   \n [http://www.myfonts.com/fonts/linotype/adobe-garamond/](http://web.archive.org/web/20131018234838/http:/www.myfonts.com/fonts/linotype/adobe-garamond/)   \n   \n [http://www.myfonts.com/fonts/linotype/stempel-garamond/](http://web.archive.org/web/20131018234838/http:/www.myfonts.com/fonts/linotype/stempel-garamond/)   \n   \n   \nc. either Adobe Jenson, URW++ Cloister or Font Bureau Hightower:   \n   \n [http://www.myfonts.com/fonts/adobe/jenson/](http://web.archive.org/web/20131018234838/http:/www.myfonts.com/fonts/adobe/jenson/)   \n   \n [http://www.myfonts.com/fonts/urw/cloister/](http://web.archive.org/web/20131018234838/http:/www.myfonts.com/fonts/urw/cloister/)   \n   \n [http://www.myfonts.com/fonts/fontbureau/hightower/](http://web.archive.org/web/20131018234838/http:/www.myfonts.com/fonts/fontbureau/hightower/)   \n   \n   \nd. either Adobe/Linotype Minion, Monotype Poliphilus (can I have Monotype Blado too?) or Linotype Bembo:   \n   \n [http://www.myfonts.com/fonts/linotype/minion/](http://web.archive.org/web/20131018234838/http:/www.myfonts.com/fonts/linotype/minion/)   \n   \n [http://www.myfonts.com/fonts/agfa/poliphilus/](http://web.archive.org/web/20131018234838/http:/www.myfonts.com/fonts/agfa/poliphilus/)   \n   \n [http://www.myfonts.com/fonts/agfa/blado/](http://web.archive.org/web/20131018234838/http:/www.myfonts.com/fonts/agfa/blado/)   \n   \n [http://www.myfonts.com/fonts/linotype/bembo/](http://web.archive.org/web/20131018234838/http:/www.myfonts.com/fonts/linotype/bembo/)   \n   \n   \ne. Monotype Bookman Old Style:   \n   \n [http://www.myfonts.com/fonts/agfa/bookman-old-style/](http://web.archive.org/web/20131018234838/http:/www.myfonts.com/fonts/agfa/bookman-old-style/)   \n   \n   \nf. either Adobe Caslon or Berthold Caslon Book & Expert:   \n   \n [http://www.myfonts.com/fonts/linotype/adobe-caslon/](http://web.archive.org/web/20131018234838/http:/www.myfonts.com/fonts/linotype/adobe-caslon/)   \n   \n [http://www.bertholdtypes.com/adobe\\_lib/080295000.html](http://web.archive.org/web/20131018234838/http:/www.bertholdtypes.com/adobe_lib/080295000.html)   \n   \n [http://www.bertholdtypes.com/adobe\\_lib/080296000.html](http://web.archive.org/web/20131018234838/http:/www.bertholdtypes.com/adobe_lib/080296000.html)   \n   \n   \nMy final choice would probably be either Plantin or Cloister. If forced to choose, I'd probably pick Plantin, since its larger x-height makes it a bit more versatile at smaller sizes.   \n   \n   \nDavid\n\n"
    },
    {
      "time": "27 Aug 2003 — 3:41pm",
      "content": "Plantin? What a sober choice. A man among boys, is Plantin.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Aug 2003 — 4:20pm",
      "content": "\\>are you married, Jay!? one is plenty for me!   \n   \nUh, I just got engaged ...   \n   \nJFP seemed to be implying he'd rather kill himself than live with only one wife.   \n   \nPlain\\*clothes seems to imply he'd kill himself if he had more than one wife.   \n   \nI'm thinking that Gill Sans is a very nice typeface, even if it is too popular these days.\n\n"
    },
    {
      "time": "29 Aug 2003 — 11:11pm",
      "content": "What, no one else is willing to weigh in on this? What is the one font that you would choose if forced to?   \n   \n(Consider this post to be forcing you. ![:-)](http://web.archive.org/web/20131018234838im_/http:/www.typophile.com/forums/clipart/happy.gif) )   \n   \nSo far, we have two Gill Sanses, one hedged Minion, one Plantin with a validation, and one French player. :D   \n   \nAny other choices?   \n   \nDavid\n\n"
    },
    {
      "time": "30 Aug 2003 — 1:58am",
      "content": "I have a hard time seeing gill sans and then thinking of the fact that he slept with his sister, than later on in life molested his daughter. ;)   \n   \nNo to mention the fact that it is liken to this:   \n   \nnon-designer/MS Word user = Times Roman   \nnew-designer/I just bought a MAC user = Gill Sans   \n   \nThis is sure to get somones panties in a bunch ;)   \n   \nfor me. Hmm.. is this a text face? or can we go titling?   \n   \nI'm quite fond of Mantinia as well as Goudy Sans especially if you have the photo lettering with all the original alternate and ligature characters.   \n   \nhildebrant.\n\n"
    },
    {
      "time": "30 Aug 2003 — 3:58pm",
      "content": "\"and his dog.\"   \n   \nYikes. That I didn't know, nor did I really want to know. ![:-)](http://web.archive.org/web/20131018234838im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nFor all you incest loving Eric Gill fans I give you this:   \n   \n [http://www.guardian.co.uk/uk\\_news/story/0,3604,1015241,00.html](http://web.archive.org/web/20131018234838/http:/www.guardian.co.uk/uk_news/story/0%2C3604%2C1015241%2C00.html)   \n   \nI nice little article about Gill's lost archives.   \n   \nhildebrant.\n\n"
    },
    {
      "time": "31 Aug 2003 — 2:24pm",
      "content": "I like the bit about his _highly personal interpretation of Roman Catholicism which made room for adultery and incest_.   \n   \nHe should've moved to Ireland. He would have made a wonderful parish priest.   \n   \nMatha   \n(Irish Roman Catholic, one French wife, no hamburgers)\n\n"
    },
    {
      "time": "31 Aug 2003 — 2:29pm",
      "content": "While I'm on the subject, has anyone read _In a Strange Land?_ Apparently Gill mentions an afternoon he spent down the pub with the founder of Sinn F\n\n"
    },
    {
      "time": "1 Sep 2003 — 8:07am",
      "content": "Has anyone been to Capel-y-ffin, where Gill & his companions lived for a number of years in the 1920s?   \n   \nIs there anything of interest there?   \n   \nI drive past it (along Gospel Pass) every now & then, and keep meaning to go & have a look, but the gravitational pull of Hay-on-Wye is too great.\n\n"
    },
    {
      "time": "1 Sep 2003 — 8:22am",
      "content": "looks like its a youth hostel now, available for rent...   \n   \n [http://www.rentahostel.com/pages/hostels/england/capel-y-ffin.htm](http://web.archive.org/web/20131018234838/http:/www.rentahostel.com/pages/hostels/england/capel-y-ffin.htm)\n\n"
    },
    {
      "time": "1 Sep 2003 — 9:04am",
      "content": "maybe [up](http://web.archive.org/web/20131018234838/http:/www.bbc.co.uk/wales/historyhunters/locations/pages/6_3_eric.shtml) the road a bit?   \n   \nInteresting to read that he set up not one, but three! self-sufficient religious communities...   \n   \nBren\n\n"
    },
    {
      "time": "2 Sep 2003 — 8:38am",
      "content": "Not to divert the subject back to the orignal question, because I find this side note Gill's life interesting in a disturbing way. But, in school we had a similar challenge. We had to choose 1 typeface and use it on the table of contents page for an international design magazine(1960's era Graphis) (index, articles, 3 laungages, side notes, publisher information, subscrition information...etc) The idea being to take one face and build the appropriate heirarchy and maintain readability. I chose Futura because of it's extensice family and legibility in both large, small and text sizes. It is clean, modern and geometric in nature. and for the most part sterotypically void . It was a fun & challenging when your so used to having 100's of fonts to choose from on a daily basis.   \nFutura\n\n"
    },
    {
      "time": "3 Sep 2003 — 3:44am",
      "content": "thanks jeremy, that's exactly what the question was about. sometimes my english lacks in explaining exactly what i want ![:-)](http://web.archive.org/web/20131018234838im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "3 Sep 2003 — 4:06am",
      "content": "I could live with only Majoor's Scala if I had to.\n\n"
    },
    {
      "time": "3 Sep 2003 — 3:47pm",
      "content": "I would choose Jonny Lunchpail by Font Diner or Lunchbox it would force the type Nazi's to allow more designs that are readable. I'd never pick futura, what if you had to design packaging info for a small space your decenders and accenders would run into each other with the amount of information you have to provide by law. And if you made it all caps it be unreadable. Dan\n\n"
    },
    {
      "time": "3 Sep 2003 — 7:26pm",
      "content": "futura?   \n   \nAm I the only one TIRED of seeing \"techy\" articles and publications set in this? I just roll my eyes anymore. Its a pain in the  to read in a \"paragraph\" setting. Am I alone on this?   \n   \nhildebrant.\n\n"
    },
    {
      "time": "3 Sep 2003 — 8:14pm",
      "content": "Syntax\n\n"
    },
    {
      "time": "3 Sep 2003 — 9:42pm",
      "content": "I have already read a 400 page novel set in 9 pt futura, it was not difficult to do, the only problem i had was finding the lines when i had to leave the reading for a while.\n\n"
    },
    {
      "time": "3 Sep 2003 — 10:18pm",
      "content": "Kyle, I'm with you. In some ways Fartura is actually worse than Helvomita.   \nSometimes I feel that Futura is in fact a _parody_ of type design.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Sep 2003 — 6:41am",
      "content": "Futura is wonderful. You simply don\n\n"
    },
    {
      "time": "4 Sep 2003 — 9:22am",
      "content": "\\> You simply don\n\n"
    },
    {
      "time": "4 Sep 2003 — 11:22am",
      "content": "I won't \"fall on the sword\" for Futura. I like it, it's versitle, but I know it has it's faults and is quite overused. In the challege I mentioned above it was a good chioce.   \n   \nHowever, In the big picture I could never have a \"be all, end all\" typeface that could serve every purpose. That would be impossible. Typefaces inherently have way too much baggage(sterotypical style, era and emotional feel) for there to ever be \"the great typeface to end all typefaces.\"   \n   \nAs a designer, I am challenged to work within one or two typefaces all the time (oh, so many times it is Helvetica and Times\n\n"
    },
    {
      "time": "4 Sep 2003 — 2:36pm",
      "content": "_\\> You simply don_\n\n"
    },
    {
      "time": "4 Sep 2003 — 3:01pm",
      "content": "i used to like Futura a lot, but that was loooong ago.   \n   \nthere's a fairly new women's magazine out in germany called 'woman' (how creative is that?) and it uses Futura for everything. along with its 80's layout it looks extremely outdated. i said \"five issues and goodbye\", but i was wrong. it's selling fairly well, and my wife, who's an editiorial designer, even reads it once in a while. must be some kind of retro-thingie.   \n   \nanyway, after long consideration, i would have to choose Luc de Groot's Thesis family. the whole package, of course. not very elegant, but extremely versatile, imho.\n\n"
    },
    {
      "time": "3 Sep 2003 — 6:35am",
      "content": "Bembo - I agree with David about Plantin, but as an emotional choice, comparing them both I prefer Bembo, although not as effective at smaller point sizes. However, I have to deplore the choice of Stempel Garamond - that zero.   \nI stayed at Capel-y-ffin for a long weekend in the 80's and although not quite a hostel it was quite spartan, good for pony treks and a very pleasant pub, a decent walk away in the ruins of an abbey. There were odd bits of sculpture I think the twelve stations of the cross which were attributed to him.\n\n"
    },
    {
      "time": "4 Sep 2003 — 2:54pm",
      "content": "One typeface or one family?? Has anyone asked this question? Or is it just assumed it is a family?   \n   \nND Futura (family)\n\n"
    }
  ]
}
