{
  "id": "10623",
  "title": "Small cap design",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm working on my first set of true small caps. I see that in a few fonts the small caps are a little taller than x-height, although theoretically they should be the same as the x-height. Are there any guidelines for this? I can see how it might be helpful if a font had a smallish x-height (mine is average). For my first version I made the stems of the small caps the same thickness as those of the lowercase letters, but I think this is not quite enough. I'd be grateful for any pointers on this topic.   \n   \nDavid\n\n",
  "author": "magister",
  "time": "2 Mar 2003 — 11:42am",
  "uid": "1572",
  "comments": [
    {
      "time": "2 Mar 2003 — 11:48am",
      "content": "\\> theoretically they should be the same as the x-height.   \n   \nWho told you that?   \nTo me it's exactly the opposite. The main reason is that some acronyms\\* (like \"OS\", or \"SC\"!) will look like lc if the smallcaps are as short as the x-height - throwing off the reader.   \n   \n\\* Which is essentially the main use of smallcaps these days.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Mar 2003 — 12:11pm",
      "content": "I did test printouts using Adobe Garamond Pro and Warnock Pro, which I happen to own and which contain true small caps; in both cases the small caps were as I describe, just slightly higher than x-height. Palatino Linotype had the small caps the same as x-height. I do not remember where I learned this principle about small caps, but it has been in my head for a while.   \n   \nI am speaking of small caps designed to go with traditional serif book faces, if that makes any difference. I have used small caps in the past for entering names of Unicode characters in documentation (e.g., LATIN SMALL LETTER THORN) when they occur in running text, and I think that this use does look better with small caps at x-height size (more or less) than it would with taller ones. I have also seen a word beginning with a cap and the rest in small caps, where a larger size small cap works better. I'm not sure about all this, which is why I'm asking . . .   \n   \nDavid\n\n"
    },
    {
      "time": "2 Mar 2003 — 12:28pm",
      "content": "\\> just slightly higher   \n   \nJust slightly higher, _visibly_ higher, is great. But the same height: sucks. Look at an issue of Eye magazine: acronyms often become confusing in Proforma (otherwise one of my very favorite faces).   \n   \n\\> I have used small caps ...   \n   \nWell, thank you!   \nBut you're the exception. Look everywhere around you: even when smallcaps are right under their noses, most designers just use the caps at different point sizes - when they want to pretend they're classy, that is.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Mar 2003 — 1:12pm",
      "content": "The small caps in AGaramond and Warnock are perhaps 5-6% higher than x-height. I don't think most people would consciously notice this at text sizes (but the Adobe designers must have felt it important). I had to do printouts at large sizes to see it.\n\n"
    },
    {
      "time": "2 Mar 2003 — 2:33pm",
      "content": "\\> I don't think most people would consciously notice   \n   \nIt's an interesting thing, that \"consciously\".   \nI think there are different levels - and different ways the levels apply in context.   \n   \nFor example, in this case, if you were to directly ask people something like \"Are these letters taller\\_than/shorter\\_than/the\\_same\\_as those?\" and they mostly gave the first answer, then to me the smallcaps are tall enough.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Mar 2003 — 5:20pm",
      "content": "There are some small caps versions that have different points of view. Personaly I have a curiosity to understand better some combinations and aspects. This AGaramound that have the l/c align to 5-6% than x-height are design to big sizes? Perhaps they have few legibility to small sizes?. Probably the better way is you define a size and try to experiment some tests with different sizes betten x-height and the capital line.   \n   \nWhat the typophile community think about the figures, punctuation, basic characters?   \n   \nRicardo\n\n"
    },
    {
      "time": "2 Mar 2003 — 6:08pm",
      "content": "\\> What the typophile community think about the figures, punctuation, basic characters?   \n   \nThat's kind of a broad question... :-)   \n   \nBut it might indeed be useful for each of us to air some of our _unorthodox_ views about each of those. Like my view that the period needs to sit (basically, float) higher than the baseline, and specifically the comma. Or that numerals should have vertical stress (at least in display faces).   \n   \nWhat else?   \n   \nhhp\n\n"
    },
    {
      "time": "2 Mar 2003 — 10:21pm",
      "content": "\"most designers just use the caps at different point sizes - when they want to pretend they're classy, that is. \"   \n   \nhaha   \n   \nHrant is this me your refering to, maybe with a certain face? ![:-)](http://web.archive.org/web/20131017231147im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n-hildebrant\n\n"
    },
    {
      "time": "2 Mar 2003 — 11:32pm",
      "content": "Shshsh! ;-)   \n   \nActually, no, since you're trying to \"fake\" smallcaps where none have been provided, plus you're doing it smartly (by using a darker weight for the smaller caps).   \n   \nhhp\n\n"
    },
    {
      "time": "2 Mar 2003 — 11:45pm",
      "content": "Hahah, well ok. Was hoping you werent making an example of my poor type setting skills ![:-)](http://web.archive.org/web/20131017231147im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nBTW this book is going to be top notch, the print bill was 25,000.00 for 1,000 of them. ![:-)](http://web.archive.org/web/20131017231147im_/http:/www.typophile.com/forums/clipart/happy.gif) haha I wish I had that kind of money to toss around.\n\n"
    },
    {
      "time": "18 May 2003 — 9:18am",
      "content": "I am an author who occasionally makes his own fonts. I am currently using MS-Word2000 going all the way through to colour-pdf separations for film. I want the whole book to be in a single font--it's working OK, except that when I select small-caps through the format command, Word just makes the small-caps a smaller point-size. I want to embed a smallcap alphabet in my trutype font which MS-word then knows to select. Is this impossible? Is this what open types is for? I only have fontographer version 3 and the cheaper 'font creation program'.\n\n"
    },
    {
      "time": "19 May 2003 — 10:26am",
      "content": "if you're not going to be using a bold in your book, you can make a smallcap font, and assign it as the \"bold\" style of your regular font.\n\n"
    }
  ]
}
