{
  "id": "106203",
  "title": "Hermit: a font for programmers, by a programmer",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text",
    "code",
    "coding",
    "hacker",
    "monospace",
    "screen"
  ],
  "content": "Typophiles here might be interested in this praiseworthy endeavour by a programmer who’s designing his own monospace font for coding. For now, one weight and one style only, but he seems to have quite a few optical sizes in mind (probably without him even realizing what that means).\n\nThe designer/developer (Pablo Caro) explicitely asks for criticism, so he can take constructive feedback into account while developing further. His sample text settings were posted on [Hacker News](http://web.archive.org/web/20150317090947/http:/typophile.com/wiki/https%3A/%252Fnews.ycombinator.com/) (a popular forum for coders and programmers), where they’re being discussed. By hackers. For typophiles it’s anyhow interesting to read how programmers rationalize about type design, without the burden (?) of tradition and jargon: [https://news.ycombinator.com/item?id=6354396](http://web.archive.org/web/20150317090947/https:/news.ycombinator.com/item?id=6354396 \"https://news.ycombinator.com/item?id=6354396\")\n\nI fancied both communities — the type design pro’s and the hacker type-n00bs ;-) — might find each other on this occasion. I cross-post the link to this thread on Hacker News, so that programmers could learn how typophiles discuss type design.\n\nThe original blog post with samples of the font(s) under discussion [is here](http://web.archive.org/web/20150317090947/http:/pcaro.es/p/hermit).\n\n ![](http://web.archive.org/web/20150317090947im_/http:/typophile.com/files/Hermit_11pt_3457.png)\n\n",
  "author": "Rhythmus.be",
  "time": "9 Sep 2013 — 12:29pm",
  "uid": "14571",
  "comments": [
    {
      "time": "9 Sep 2013 — 1:00pm",
      "content": "@ admin — Please delete this node 106203, but keep 106204, since the link to the latter one was cross-posted on [https://news.ycombinator.com/item?id=6355655](http://web.archive.org/web/20150317090947/https:/news.ycombinator.com/item?id=6355655 \"https://news.ycombinator.com/item?id=6355655\")\n\nAccidentally posted twice because of 503 internal server error on the typophile back-end :-(\n\n"
    }
  ]
}
