{
  "id": "106353",
  "title": "boldness adds contrast",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm in the final stages of a serif typeface where the light weights are practically monoline, and contrast is added as it gets bolder, creating a transition from an almost Egyptian style light slab to a Modern black. Do you know of any other typefaces that do this, and what classification would you give the typefamily?\n\n ![](http://web.archive.org/web/20150414041232im_/http:/typophile.com/files/UrgeText_4224.png)\n\n",
  "author": "daverowland",
  "time": "16 Sep 2013 — 8:59pm",
  "uid": "44740",
  "comments": [
    {
      "time": "17 Sep 2013 — 8:34am",
      "content": "Joshua Darden’s [Freight™ Text](http://web.archive.org/web/20150414041232/http:/www.dardenstudio.com/typefaces)?  \n ![](http://web.archive.org/web/20150414041232im_/http:/www.dardenstudio.com/content/files_flutter/1324267920_60_1_1_11_overview.png)\n\n"
    },
    {
      "time": "17 Sep 2013 — 8:47am",
      "content": "Used to be the other way round, from high-contrast ‘Modern’ to low-contrast square-serif (‘Egyptian’).\n\n ![](http://web.archive.org/web/20150414041232im_/http:/typophile.com/files/Mod_Egypt_4429.png)\n\n"
    },
    {
      "time": "17 Sep 2013 — 6:15pm",
      "content": "Cheers, Maxim\n\n"
    },
    {
      "time": "18 Sep 2013 — 2:59am",
      "content": "I’d rather classify the typeface family as Modern. The light weight is a Modern Egyptian or Modern Slab Serif if you like. The black weight is a Modern typeface, so Modern is what they have in common. Instead of Modern one could also say Didonic. The trouble with most approaches to classifying typefaces is that they create a system with a fixed number of boxes with rather strict rules instead of describing the typefaces by formal principles. The latter would allow to work with as many ‘boxes’ as needed. Sometimes one only needs to distinguish between Sans and Serif, sometimes between Modern Slab Serif and Humanist Slab Serif, and occasionally one would like to distinguish between Venetian Serif and Humanist Serif, maybe even between Venetian Slab Serif and Humanist Slab Serif. Anyway, the main goal of classifying typefaces should be to enable designers to work with them and communicate their typographic and formal aspects, not putting them into boxes.\n\n"
    },
    {
      "time": "18 Sep 2013 — 2:26am",
      "content": "<cite>Used to be the other way round, from high-contrast ‘Modern’ to low-contrast square-serif (‘Egyptian’).</cite>\n\nThat sounds as if the first Egyptians started their life as accompanying black weights of Modern text faces. In typography they served as black weights, but were they family members in the way we nowadays look at a family? What came first? Black modern weights or black egyptians?\n\n"
    },
    {
      "time": "18 Sep 2013 — 8:37am",
      "content": "Of course the early Egyptians and Gothics were not part of any family. The very concept of the type family did not exist when those ‘novelty’ styles hit the type market… Those new, exotic, typefaces were meant for _combined_ use with other styles, not by themselves: like capers or grenadine, they were natural born mixers. One could not even think of setting an entire book using black type—Modern, Egyptian, or Gothic.\n\n"
    },
    {
      "time": "18 Sep 2013 — 8:54am",
      "content": ".\n\n"
    },
    {
      "time": "23 Sep 2013 — 3:39am",
      "content": "[![](http://web.archive.org/web/20150414041232im_/http:/origin.myfonts.com/s/aw/original/205/0/105058.png)](http://web.archive.org/web/20150414041232/http:/www.dstype.com/fonts/prumo-text)\n\n"
    }
  ]
}
