{
  "id": "106324",
  "title": "Questions regarding generating ttf’s in Fontlab Studio",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I wonder about a few options/checkboxes in Font Info \\> TrueType specific settings and Preferences \\> Generate OpenType & TrueType that I can’t seem to find much info about. And, also a wildcard that I’d like to discuss.\n\n• Automatically reorder glyphs. From what I have read, this only affects CFF-OT fonts in OS9 (not very relevant for me). [Karsten Luecke writes in another thread](http://web.archive.org/web/20150419172754/http:/typophile.com/node/42382): “In CFF-OT fonts, the first glyph must be .notdef. And in TT(-OT) fonts, the first four glyphs must be .notdef, .null, CR and space.” I assume this talks about the glyph ID order. I wonder where/how I can inspect or modify this.\n\n• HDMX settings: What determines the sizes I should apply this for? The sizes I have hinted?\n\n• Copy HDMX data from base to composite glyph: I’m not sure what this part means. Can anyone explain?\n\n• Create VDMX table: I use some vertical delta instructions, so I assume FL is correct when it says I need to check it, but what does it actually do?\n\n• Re. kerning settings: When I am making webfonts, file size is very important. From what I’ve read, browser support for a flat kerning table is as spotty as the support for OT class kerning. Also, people are pushing for OT support because that’s the cool stuff. (And David Berlow only includes a selected few kerning pairs in the RE fonts. I can understand that for stuff that is only geared at text sizes, btw. Even the retina screen is lowres when it comes to kerning at text sizes.) So: I am only exporting OT class kerning. What are you doing? Why?\n\n• The two options “Write stored native TrueType hinting” and “Export visual TrueType hints”. What are these referring to?\n\n",
  "author": "Frode Bo Helland",
  "time": "16 Sep 2013 — 12:31am",
  "uid": "17101",
  "comments": [
    {
      "time": "17 Sep 2013 — 11:50am",
      "content": "First point: go to Index mode.\n\n"
    }
  ]
}
