{
  "id": "106305",
  "title": "How to bring back invalid/corrupted fonts back from the brink",
  "forum": "General Discussions",
  "tags": [
    "corrupted invalid",
    "General Discussions"
  ],
  "content": "I stored a few fonts on my external hard drive a several months ago.\n\nWhen I try to install/open one there comes up an error messaging reading, \"The requested is not a valid font.\"\n\nIs there any way to bring some of these fonts back?\n\nI think there's only been a small amount of data loss. :/\n\n",
  "author": "ralphsmouse",
  "time": "15 Sep 2013 — 12:07am",
  "uid": "90257",
  "comments": [
    {
      "time": "15 Sep 2013 — 9:13am",
      "content": ".\n\n"
    },
    {
      "time": "15 Sep 2013 — 8:45am",
      "content": "1. What OS and Version?  \n2. What type of font(s)?  \n3. When you copied the fonts to the external did it do a complete file copy or merely a shortcut/alias?  \n4. Does it happen with all the font files on the external?\n\n"
    },
    {
      "time": "15 Sep 2013 — 3:47pm",
      "content": "Windows 8\n\nOpentype fonts\n\nThere are whole 50-100kb fonts.\n\nIt happened to all the fonts.\n\nAll the file information except \"Opentype font\" is missing on all of the fonts.\n\nIf I could just get back simple glyph and Opentype information from the files, that would be fine.\n\n"
    },
    {
      "time": "16 Sep 2013 — 8:56am",
      "content": "Have you tried copying a couple of them back to your main drive, then loading the fonts?\n\nI suspect the problem is system-oriented and the font files are probably just fine. You might be able to find a good answer in the MS forums.\n\n"
    },
    {
      "time": "18 Sep 2013 — 12:36pm",
      "content": "Could these be \"obfuscated\" web fonts?\n\nSi\n\n"
    },
    {
      "time": "19 Sep 2013 — 4:01am",
      "content": "Do you have FontForge installed? It may be able to recognise or diagnose something in the font files that the system is missing. If (you are positive) any of the fonts are subject to an open source license perhaps you could post one of them here for analysis?\n\n"
    }
  ]
}
