{
  "id": "10641",
  "title": "Nostalgia",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "So.. I'm in Will's class and here is my typeface, Nostalgia. A typeface affectted by storytelling and time. Any suggestions? Do any characters not fit with the rest of the set? Thanks! Jessie   \n ![Nostalgia](http://web.archive.org/web/20131023163315im_/http:/www.typophile.com/forums/messages/29/7176.jpg)\n\n",
  "author": "jrepovsch",
  "time": "4 Mar 2003 — 1:16pm",
  "uid": "1430",
  "comments": [
    {
      "time": "4 Mar 2003 — 1:20pm",
      "content": "This is really a very nice direction.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Mar 2003 — 8:30pm",
      "content": "Will's font is in the thread \"HEY what is this?\" you should check it out. I will set some words and post, thank you for the suggestions.\n\n"
    },
    {
      "time": "8 Mar 2003 — 11:17am",
      "content": "Jessica, it seems a beautiful unconscious amalgam between Adobe's Duc De Berry (i9n the Type Before Gutemperg) series, Oscillator (or one of its brothers) from T-26 and Tralfalmadore by Fred Nader, with an overall feeling of cuteness.   \nThe most odd mix which has come to my mind to date.   \n   \nMy only advice: give it a strong geometrical construction after you've designed it freehand and you'll have a masterpiece (of course if you don't like basic geometry it's a useless idea).\n\n"
    },
    {
      "time": "8 Mar 2003 — 12:11pm",
      "content": "\\> give it a strong geometrical construction   \n   \nAre you serious? That would completely ruin it!   \nAnd I do love Geometry - but it has to be used for more than its own sake.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Mar 2003 — 1:02pm",
      "content": "I agree with Jared's comment about the positioning of the 'bubble'. It's lovely when it bulges inside a bowl, but when it disturbs the outer form of the letter it is too destructive. The J is a particular problem in this regard: the bubble really interrupts the form of the letter. You could fix this letter by shifting the bubble so that the outer curve of the J is maintain, as you have for B, D, etc. I would consider leaving the bubble off the X and Z altogether, and instead give these letters treatment similar to Y. The top of Z could be treated like E and F.   \n   \nThere doesn't seem to be any logic to where you are using the double-stroke.\n\n"
    },
    {
      "time": "10 Mar 2003 — 1:48pm",
      "content": "\\>Are you serious?   \n   \nIt would just be my approach. Geometry could have various degrees of complexity. Just look at the wonderful use Miles does of basic geometry without sacrificing spontaneity. A good piece of my research is centered around this. And the approach depends entirely on where Jessica wishes to head.   \n   \nI agree with Jared & John's observations, anyway.\n\n"
    },
    {
      "time": "10 Mar 2003 — 2:19pm",
      "content": "Just to let you know what popped into my mind... ![ideas?](http://web.archive.org/web/20131023163315im_/http:/www.typophile.com/forums/messages/29/7385.gif)   \nSurely an awkward mix, but maybe Jessica could get some further inspiration... ![:-)](http://web.archive.org/web/20131023163315im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "10 Mar 2003 — 3:11pm",
      "content": "nice shapes, jessica.   \n   \ni agree with cladio about making it more geometric   \n(nice references!). i think that it would help you   \nmaking more \"logical\" shapes too, as john commented.   \n   \nbtw, is this a unicase font? imho, this should be   \nonly caps... i think b and d are not fitting with   \nothers characters.\n\n"
    },
    {
      "time": "12 Mar 2003 — 4:00pm",
      "content": "here is what i've been working on... i've changed some of the characters slightly, but now that i have read some of you comments i'm going to try some other things with X, Z and such. yes, it is a unicase font, if i enlarge the bowl in the b & d will it help?? also, i wanted your opinion on the period and comma? diamond or use circles like on the terminals on the letters? thanks!   \n   \njessica   \n ![](http://web.archive.org/web/20131023163315im_/http:/www.typophile.com/forums/messages/29/7493.jpg)\n\n"
    },
    {
      "time": "12 Mar 2003 — 4:06pm",
      "content": "also... thanks for the samples... i can see the mix... i did make all of the bubbles the exact same size time, maybe geometry sneaking in!\n\n"
    },
    {
      "time": "12 Mar 2003 — 7:42pm",
      "content": "here is what i've been working on... does the Z, J, & X better??   \nthanks.   \njessie   \n ![](http://web.archive.org/web/20131023163315im_/http:/www.typophile.com/forums/messages/29/7497.jpg)\n\n"
    },
    {
      "time": "12 Mar 2003 — 11:38pm",
      "content": "I would keep the \"x-height\" consistent. This makes a typeface solid, even if you use ascenders and descenders in an all-caps design.   \nSo I would do the b, h and d bowls, the i and j height (dot exluded) and the t crossbar, at the same caps height of the other letters. The ascenders of course will exceed the caps height.   \n   \nAlso, I would keep a certain consistency of the terminals. Tha A is very nice and balanced. Keep it as a basis and use the A's bolder terminal to make the other terminals behave like it (quite like you did in W).   \nThe inconsistency is more evident in letters like the new F. The old F and G were better.   \nT and Y are very good and balanced indeed.   \nShorten also the L horizontal stroke and keep the \"ascender\" part the same you will do with b, d etc.   \n   \nI think stroke consistency will help, no matter if the approach is more calligraphic or more geometric.\n\n"
    },
    {
      "time": "12 Mar 2003 — 11:41pm",
      "content": "Keep the punctuation \"rhomboid\" if you want my opinion, instead of rounded.\n\n"
    },
    {
      "time": "25 Mar 2003 — 10:07am",
      "content": "here is my revamped typeface after taking on some of your suggestions and some personal changes... jessica   \n ![](http://web.archive.org/web/20131023163315im_/http:/www.typophile.com/forums/messages/29/7992.jpg)\n\n"
    },
    {
      "time": "25 Mar 2003 — 10:24am",
      "content": "This is really nice.   \nPut bubbles in the punctuation too.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Mar 2003 — 2:29pm",
      "content": "Who is Will?\n\n"
    },
    {
      "time": "4 Mar 2003 — 2:35pm",
      "content": "This feels really unique, Jessica. Nice work. Can you set a few words and post a sample?   \n   \nThe \"bubble\" (if you will) works nicely when it's inside the bowl (ie. B,C,D) but feels awkward when outside (ie. J, X, Z)   \n   \nWould love to see more!\n\n"
    }
  ]
}
