{
  "id": "106483",
  "title": "On [un]even color",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "In typeface design the conscious appeal of even color is subtly broken to deliver subconscious functionality.\n\nAt a basic level this breaking is done unwittingly via the idiosyncrasies of compositional methods, such as a physical marking tools or geometric constructs.\n\nAt a higher level this breaking is done deliberately via a manipulation of the black-and-white bodies, and ideally the system of such.\n\nAt a still higher level this breaking is done via a judicious redesign of the writing system itself.\n\nhhp\n\n",
  "author": "hrant",
  "time": "22 Sep 2013 — 10:54am",
  "uid": "1250",
  "comments": [
    {
      "time": "22 Sep 2013 — 3:13pm",
      "content": "Very profound. Are we talking philosophy here, or typography?\n\n"
    },
    {
      "time": "23 Sep 2013 — 5:23pm",
      "content": "I think anything has both practical and theoretical dimensions, and the latter instinctively veers towards philosophy!\n\nhhp\n\n"
    },
    {
      "time": "23 Sep 2013 — 8:11pm",
      "content": "As usual when you cite the 'subconscious', my response is 'Prove it'. But I'll let you off this time, because I think it is more important to cite [Pelli et al 2002](http://web.archive.org/web/20140710230422/http:/psych.nyu.edu/pelli/pubs/majaj2002channel.pdf) [PDF], which to my mind is the most important study yet done in its contribution to our understanding of 'even colour' (I prefer the term even texture) and its _functional_ rôle in reading. Critically, the concept of spatial frequency channels defines limits within which variations in typographic texture may operate _without impeding reading by forcing channel retuning._ This statement from the study's conclusion is worth re-reading several times:\n\n> For each alphabet, font, and size, letter identification is mediated by a single one-or-two-octave-wide visual channel. Even in the presence of very asymmetric noise distributions, observers continue using the same channel to identify and detect letters and gratings. Together, these two findings say that the channel is selected bottom-up by the signal, not top-down by the observer.\n\nThere are some [simple perceptual tests](http://web.archive.org/web/20140710230422/http:/www.yorku.ca/eye/spafreq.htm) than one can do to confirm that tuning from one spatial frequency channel to another takes time. Ergo, if text involves too great a span of spatial frequencies, reading will be impeded by the need to re-tune. So, it seems to me that even texture in the sense of letters occupying the same spatial frequency channel, is functionally beneficial to reading, while your 'breaking of even colour' is so far without demonstrated benefit.\n\n"
    }
  ]
}
