{
  "id": "10643",
  "title": "Egophoenix",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "This is a proposed logo for a small software company.   \nYour thoughts/comments are welcome.   \n   \n\\_craig   \n   \n ![egophoenix](http://web.archive.org/web/20131023203849im_/http:/www.typophile.com/forums/messages/29/7185.jpg)\n\n",
  "author": "butterworth",
  "time": "4 Mar 2003 — 3:12pm",
  "uid": "649",
  "comments": [
    {
      "time": "4 Mar 2003 — 3:32pm",
      "content": "It feels really right for a software company (the green is such a singular bit of individuality) yet my eye can't find a stopping and starting point - I'm drawn right to the middle. Does that make sense?\n\n"
    },
    {
      "time": "4 Mar 2003 — 9:04pm",
      "content": "I like it. Can you post a small one? I think I have the same concerns as Jared. The h disappears and the g, for whatever reason, I'm reading as a q.   \n   \nI think the problem with the h is that it is the only letter that morphs into the others. Perhaps just morphing all of the round letters as well, though that may put too much emphasis on the 'nix'.\n\n"
    },
    {
      "time": "5 Mar 2003 — 1:24pm",
      "content": "TL : I get what you're saying, think it's the way the h rolled in to it's neighbors. Made some adjustments.   \n   \nJB & D : I agree with what you're saying. Maybe thinning out the lines and darkening the grey a few shades would make it work.   \nThis project is being put on hold for a while, though. About the software : I'm not at liberty to say. Seriously, they'd be upset.   \n ![](http://web.archive.org/web/20131023203849im_/http:/www.typophile.com/forums/messages/29/7216.gif)\n\n"
    },
    {
      "time": "5 Mar 2003 — 1:34pm",
      "content": "I think it looks slick, very modern. The thing is, I don't get how it relates to either \"ego\" or \"phoenix\" or the combination. That's not to say it doesn't -- I just don't see it. I think a logo should connect solidly to the company or individual it represents.   \n   \nMinor note: I agree with the comments about the _g_.\n\n"
    },
    {
      "time": "5 Mar 2003 — 3:01pm",
      "content": "yea, the g still isn't a g. I'm not sure how to read it.   \n   \nIf you take stephen's suggestion, perhaps extend the extenders of the h and p to match in length.   \n   \nHave you considered coloring the ego green as well? It may deliminate the two words a bit better.\n\n"
    },
    {
      "time": "6 Mar 2003 — 2:31pm",
      "content": "Hey typophiles,   \nThanks for all the feedback. It turns out that this logo wont be used... ever... at all... by anyone... but, I've made a few changes anyway. Here it is :   \n ![](http://web.archive.org/web/20131023203849im_/http:/www.typophile.com/forums/messages/29/7284.gif)   \n   \neh? ;)   \n   \n ![](http://web.archive.org/web/20131023203849im_/http:/www.typophile.com/forums/messages/29/7285.gif)\n\n"
    },
    {
      "time": "7 Mar 2003 — 5:24am",
      "content": "I like it therefore my sympathies.   \n   \nYou're handling that so much more gracefully than I would.\n\n"
    },
    {
      "time": "4 Mar 2003 — 3:34pm",
      "content": "The shapes are interesting, but I am more concerned that when the logo appears in small sizes, it becomes a lot less readable. The \"e\"s may fill in, the \"g\" shape becomes much less readable, the \"h\" almost disappears and the green dot in the \"i\" is almost lost as well.   \n   \nWhat type of software do they produce?\n\n"
    },
    {
      "time": "5 Mar 2003 — 1:32pm",
      "content": "For the 'g' try removing the dangling curve at the bottom   \nand flipping the shape horizontally. Than add the curve   \nto the bottom of the new tail. You'll have a more   \nconventional 'g', but no legibility issues.\n\n"
    }
  ]
}
