{
  "id": "106459",
  "title": "Book text",
  "forum": "Design",
  "tags": [
    "book text",
    "slab serif",
    "Design"
  ],
  "content": "I am in the midst of choosing typefaces for a book, and I just need to get out of my own head for a bit! The book is a fairly large-format (9x12), with good production values. The subject matter is largely historical, with many vintage photographs along with a smaller number of new images. There are a few sections of text, along with extended captions for all the images. So I want highly legible, not too compressed, slight vintage feel, with lots of layout flexibility, and possibly/probably paired with Avenir Next (mainly in some maps or other graphics). I keep coming back to Sentinel -- a slab serif seems like a good sort of spiritual fit with the subject matter, and Sentinel works better for me in text than something like Bodoni Egyptian, and looks a little more sober and less trendy than something like Archer. Opinions?\n\n",
  "author": "sparkwriter",
  "time": "20 Sep 2013 — 10:02am",
  "uid": "93481",
  "comments": [
    {
      "time": "20 Sep 2013 — 12:31pm",
      "content": "Not to pick on you in particular, sparkwriter, but I'm always amazed by people who ask questions about what a good font is for a project and fail to explain what the project is about!\n\nWhat is your book _about_?\n\nThat should give us a good start.\n\n"
    },
    {
      "time": "20 Sep 2013 — 5:00pm",
      "content": "Well, you asked for it! It's a local history book focusing on Gastonia, a small town in North Carolina that was the center of the US textile industry until the 1980s. The boom years were in the first quarter of the 20th century, but the town was quite prosperous into the 1960s. Today, textiles are long gone and the town (which is in the orbit of much, much larger Charlotte) is trying to redefine itself. The book was commissioned by the chamber of commerce, so there is a definite focus on the business community, with the intent to show that there is more to the place than just the death of an industry.\n\nThe content is a couple of essays, with around 125 historic images, with as I said above, some contemporary photography -- mainly as a \"then and now\" kind of thing. All of the images will have captions of 100-150 words. So, typeface-wise, I want something that has a bit of a vintage, American feeling without being distracting or calling a lot of attention to itself, and is very flexible and capable in terms of layout. There will be at least one map, a double spread detail map of the downtown area based on a [1922 Sanborn Fire Insurance map](http://web.archive.org/web/20150420022403/http:/en.wikipedia.org/wiki/Sanborn_Maps), with thumbnails of some of the still-standing buildings and image locations plus abbreviated captions.\n\nI should also mention that in addition to the design and production work on the book, I am also researching and writing it. It has been in the works for nearly a year, with a publication date of February 2014. So I am just all \\*kinds\\* of invested in the project!\n\n"
    },
    {
      "time": "21 Sep 2013 — 12:41am",
      "content": "> So, typeface-wise, I want something that has a bit of a vintage, American feeling without being distracting or calling a lot of attention to itself, and is very flexible and capable in terms of layout.\n\nYou might take a look at [Whitman](http://web.archive.org/web/20150420022403/http:/www.fontbureau.com/fonts/whitman/).\n\n"
    }
  ]
}
