{
  "id": "10642",
  "title": "Newbie question",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Ok, I'm quite a newbie when it comes to fontmaking, so I am almost embarrased to ask this. You guys are so good at this, but anyway...   \n   \nI make all my fonts in Illustrator, drawing curves, chopping circles etc. I'm pretty familiar with bezier curves, but there is one letter I just can't get right yet. The \"S\"!. I can build it with chopped circles and simple blocks, but to get my font a little more exciting(and atleast half-decent, not compared to any of you guys stuff though!), I want to make it with the bezier tool. But I can't get it right! Is there like a manual on how to make certain letters? I can't be the first person to struggle with this letter? ![:-)](http://web.archive.org/web/20131102205631im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nTom I.\n\n",
  "author": "striker2",
  "time": "4 Mar 2003 — 3:06pm",
  "uid": "1580",
  "comments": [
    {
      "time": "4 Mar 2003 — 4:04pm",
      "content": "The first question to ask yourself regarding the S is whether it will have a totally smooth curve in the middle or will incorporate a short straight segment in the middle. In either case, a good way to begin is without a straight segment. Put a node at the outside left edge and inside left edge, and at the inside right edge and outside right edge of the S-bend section. These should be extreme points, with a smooth fixed transition perfectly vertical. You can now play with the control handles between these points to define a nice curve. In FontLab, you can also grab the curve itself, at any point, and it shift up or down. Note that where you grab the curve will affect how the curve is modified by movement. I recommend playing around with this at some length, getting comfortable with how the curve responds to your touch before trying to achieve a specific result.   \n   \nOnce you have pleasing curves definining your stem, you should either insert a short straight segment if you desire (generally I don't), or a transition single node at the flex point of the S-bend. The most reliable way to do this, in FontLab, is to use the knife tool and to drag a straight line between the off-curve control handles defining the curve and bisecting it. This will put a point in the optimum position.\n\n"
    },
    {
      "time": "4 Mar 2003 — 5:33pm",
      "content": "Thank you very much for fast replies!   \n   \nI know the proper way to design a decent font is to draw it by hand, but I need to start somewhere and get to know Fontlab first. The link you gave me is a good starting point! Thank you ![:-)](http://web.archive.org/web/20131102205631im_/http:/www.typophile.com/forums/clipart/happy.gif).   \n   \nAnother thing, beeing a graphic designer myself with not much experience in designing typefaces, I see alot of designers on the net offering fonts   \nand getting alot of exposure in magazines etc.   \nYouworkforthem, Identikal etc.   \n   \nI have nothing against these people, but looking at their fonts, and comparing them to some of the stuff I have seen in this forum, there is an enormous gap in quality!? I mean, these guys sell their typefaces with a pretty heavy price tag, but they look \\*nothing\\* like some of the stuff I see here!   \nDo you consider them as \\*real\\* typeface designers, or just graphic designers wanting to break into another field in graphic design?   \n   \nAfter reading alot of posts here, I would never consider selling my fonts, just because I see the amount of work you put into your typefaces!   \n   \nI hope someday my typefaces will be good enough, but for now I realize I am just learning! ![:-)](http://web.archive.org/web/20131102205631im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nTom I.\n\n"
    },
    {
      "time": "4 Mar 2003 — 3:15pm",
      "content": "I know of no definitive answer to how a given letter must be drawn. In my research, I've found diverse theories on letterform construction, and I'm preparing a piece right now for Typophile which compares and contrasts them.   \n   \nMy only suggestion would be to try to hand draw your S rather than try to construct it from primitives. And read this thread: [http://www.typophile.com/forums/messages/29/477.html](http://web.archive.org/web/20131102205631/http:/www.typophile.com/forums/messages/29/477.html)\n\n"
    }
  ]
}
