{
  "id": "106577",
  "title": "Acne Studios type",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello type ID geniuses!\n\nCould anyone help me out with this one, I can't seem to figure it out... I think it might be something fairly new though because it definitely fits in with some other typefaces that currently seem pretty popular.\n\nThanks!!!\n\n ![](http://web.archive.org/web/20150419143433im_/http:/typophile.com/files/1700801295_3652.jpg)\n\n",
  "author": "wolfattack",
  "time": "30 Sep 2013 — 9:17pm",
  "uid": "15289",
  "comments": [
    {
      "time": "1 Oct 2013 — 9:29am",
      "content": "Can't find a match. That might be a custom job by Acné Studios itself though. Would really like to find it out. Do you have the exact origin of this sample? I'd like to dig around, finding may be a flash file or webfont...\n\n"
    },
    {
      "time": "2 Oct 2013 — 1:15am",
      "content": "Can't find a match. That might be a custom job by Acné Studios itself though. Would really like to find it out. Do you have the exact origin of this sample? I'd like to dig around, finding may be a flash file or webfont...\n\n"
    },
    {
      "time": "7 Nov 2013 — 2:10pm",
      "content": "Yes. I would like to know what this is as well.  \nI found a video link but nothing on the website.  \n [http://shop.acnestudios.com/collections.html](http://web.archive.org/web/20150419143433/http:/shop.acnestudios.com/collections.html \"http://shop.acnestudios.com/collections.html\")\n\nHope this helps.\n\n"
    },
    {
      "time": "15 Feb 2014 — 2:54am",
      "content": "Right, it´s custom. It is called Acne Studios Circle Bold. Got the information from the website´s source code.\n\nDoes anyone know if it is based on a commercial font?\n\n"
    },
    {
      "time": "15 Feb 2014 — 5:35am",
      "content": "\"Copyright (c) 2013 by Acne Studios. All rights reserved. Font development by Letters from Sweden.\"  \nThe character set in Acne Studios Circle Bold does not match the titling in the Grand Palais videos. At least the G and 4 are different.\n\n ![](http://web.archive.org/web/20150419143433im_/http:/typophile.com/files/AcneStudiosCircleBold2_6211.jpg)\n  \nPresumably the video font is another custom font developed for Acne Studios by Letters from Sweden, most likely by Göran Söderström.  \nInfo on Letters From Sweden by Luc Devroye  \n-----start quote-----  \nSwedish foundry run by two friends.  \nFredrik Andersson. His main occupation is graphic design at Pangea design, creating visual identities for big and small organi­zatio. He lectures on the history and design of typography at Södertörn and Berghs SOC and has been published in Tecknaren and Biblis. Old ramblings on type are still on his now defunct blog Typografism. Type designs include Berling Nova Sans&Serif (with Orjan Nordling), custom work for Nu-institutet and Botkyrka konsthall, and a release for Fountain is also in the works. He is the chairman of the Stockholm typographic guild.  \nGöran Söderström. He has been designing type since 2006. He has previously published his works through Psy/Ops, Fountain and FontFont. At Pangea Design, he has developed custom type for ICA, LO, SEB and others.  \n-----end quote---  \nDon \n"
    },
    {
      "time": "1 Jun 2014 — 1:05am",
      "content": "The typeface is exclusively designed for Acne Studios. It’s a collaboration between Acne Studios and me. Letters from Sweden is my type foundry where I do all my type work, both custom and retail.\n\nThere is some more samples of the Acne Studios typeface here:  \n [http://autodidakt.se](http://web.archive.org/web/20150419143433/http:/autodidakt.se/ \"http://autodidakt.se\")\n\nCheers,  \nGöran  \nLetters from Sweden  \n [http://lettersfromsweden.se](http://web.archive.org/web/20150419143433/http:/lettersfromsweden.se/ \"http://lettersfromsweden.se\")\n\n"
    },
    {
      "time": "10 Apr 2015 — 3:11am",
      "content": "Pimples on face decrease the facial beauty of a person and that's why, the patient may feel embarrassed in public and face lack of confidence in front of friends and colleagues. A skin with acne requires immediate consult of a proper [skin specialist for acne](http://web.archive.org/web/20150419143433/http:/skincleanersbeauty.com/choosing-dermatologist-acne-specialist) in this field.\n\n"
    }
  ]
}
