{
  "id": "106688",
  "title": "Presenting HWT Gothic Round from the Hamilton Wood Type Foundry",
  "forum": "Home",
  "tags": [
    "gothic",
    "hamilton",
    "News",
    "round",
    "sans-serif",
    "Wood Type"
  ],
  "content": " ![](http://web.archive.org/web/20150322020212im_/http:/typophile.com/files/gothic_round-480_3940.png)\n\nHWT Gothic Round is the newest release from the Hamilton Wood Type Foundry. Gothic Round was first introduced as wood type by the George Nesbitt Co. in 1838. The font is a softened variation of a standard heavy Gothic typeface. The style evokes a much more recent history of the 1960s and 70s and can be seen in such places as donut shops and on children's toys as well as inspiration for such fonts as VAG Rounded.\n\nGothic Round has not previously been available as a digital font until now. The font was digitized by Miguel Sousa from a wide variety of historical sources, including visits to the Cary Collection at RIT (Rochester, NY), WNY Book Arts Center (Buffalo, NY) and the Hamilton Wood Type Museum (Two Rivers, WI). The result is a very solid and contemporary font with a 175 year history.\n\nDifferent versions of Gothic Round were originally offered by several different wood type manufacturers, dating back to the George Nesbit design of 1838. Each design had their own quirks and defining characteristics. After Hamilton bought out Page, Wells and Morgan & Wilcox, they briefly offered the various cuts from their former competitors before standardizing.\n\nDesigner Miguel Sousa of Adobe considered many sources for the digitization project. The initial source material was found in the print studio of the Western New York Book Arts Center (WNYBAC), where lower case letters were only found for two of the four different sizes in the collection. However, in settling on which version would best inform this new digitization, Miguel also looked at specimens from the Massey Library (University of Toronto), Newberry Library in Chicago and wood type from the Cary Collection at RIT. In addition to WNYBAC, where he also printed, he also visited the Hamilton Wood Type Museum to become fully immersed in this project.\n\nUltimately, Miguel settled upon the use exemplars from multiple cuts to create a more pleasing hybrid. The uppercase, the figures, and the punctuation were based on 8-line print samples of the Heber Wells version (WNYBAC collection), while the lowercase was sourced from pictures of 4-line type of the Wm. Page version (Cary collection).\n\nVisit P22's [Behance](http://web.archive.org/web/20150322020212/http:/www.behance.net/gallery/HWT-Gothic-Round-Wood-Type-Digitization/11158977) page for photos and more background info on the development of this font from wood type to digital.\n\nFor more information regarding this release, check out the Hamilton Wood Type [website](http://web.archive.org/web/20150322020212/http:/www.hamiltonwoodtype.com/gothicround.html).\n\n[HWT Gothic Round](http://web.archive.org/web/20150322020212/http:/www.hamiltonwoodtype.com/gothicround.html) is available at an introductory discount through October 31st.\n\n",
  "author": "jimy",
  "time": "9 Oct 2013 — 9:54am",
  "uid": "5133",
  "comments": [

  ]
}
