{
  "id": "106785",
  "title": "Display font with blast or explosion effect - Vintage 1950s",
  "forum": "Home",
  "tags": [
    "Display"
  ],
  "content": " ![](http://web.archive.org/web/20150317114313im_/http:/typophile.com/files/can%CC%83onazos_3565.png)\n\nI am looking for know further info about this font. I remember to have seen it printed in old Mecanorma or Letraset catalogs when I was studying at university in 1993.\n\nAbout 14 Cañonazos, is a Colombian tropical music compiled series that every year on December publishes a selection of 14 successful songs of tropical genre for parties or fiestas of finish year.\n\nMore info, [http://www.discosfuentesedimusica.com/index.php?option=com\\_content&view=...](http://web.archive.org/web/20150317114313/http:/www.discosfuentesedimusica.com/index.php?option=com_content&view=article&id=146&Itemid=126 \"http://www.discosfuentesedimusica.com/index.php?option=com\\_content&view=article&id=146&Itemid=126\")\n\nThank you\n\n",
  "author": "Vargas74",
  "time": "14 Oct 2013 — 10:13pm",
  "uid": "38324",
  "comments": [
    {
      "time": "15 Oct 2013 — 4:44am",
      "content": "Checked my Letraset Catalog [1985] but didn't see it.  \nDon't have a Mecanorma catalog, but I note that it's not in the digitized Mecanorma Collection of 88 fonts at Myfonts.  \nDon\n\n"
    },
    {
      "time": "15 Oct 2013 — 8:05am",
      "content": "In the upper case letters the two Os, the two As and the two Ns look different, even aside from the explosive effect. (Of course, the Ns are really different characters.) This may be some hand lettering.\n\n"
    },
    {
      "time": "15 Oct 2013 — 7:34pm",
      "content": "Careless! I should have noticed the letter variations that indicated this was hand lettering.  \nBut it could be fonted by making several variations of the little eruptions and pasting them at different angles on a suitable base font. Unfortunately my search for something similar to CANONAZOS was not very productive. As an experiment I blended Neuland Black with Showcard Gothic 50-50 and got the following result, which could be edited to make a fairly close match:\n\n ![](http://web.archive.org/web/20150317114313im_/http:/typophile.com/files/BlendNeulandBlackShowcardGothic_5080.jpg)\n  \nBut does anyone know of an existing font that is closer?  \nDon \n"
    },
    {
      "time": "16 Oct 2013 — 5:01am",
      "content": " ![](http://web.archive.org/web/20150317114313im_/http:/typophile.com/files/can%CC%83onazos_3653.png)\n\nI attach a new image of Cañonazos, first ñ haves a tilde (in Spanish ñ is different of n), I think that this font is based on Neuland but I don't have more info about it yet. This is not a drawn or hand lettering. Notice similar glyphs in upper and lowercase.\n\n"
    },
    {
      "time": "16 Oct 2013 — 6:48am",
      "content": "Useful. This separates the base letters from the eruptions. Now the N and A base letters look the same. But the base O's are still different. Might be the same if they were flipped vertically.  \nFont or not?  \nDon\n\n"
    },
    {
      "time": "16 Oct 2013 — 7:26am",
      "content": "Another experiment. El Grande narrowed to 80% & blended 50-50 with Neuland Black. Minor editing.\n\n ![](http://web.archive.org/web/20150317114313im_/http:/typophile.com/files/BlendNeulandBlackElGrandejpg_5960.jpg)\n  \nDon \n"
    },
    {
      "time": "22 Oct 2013 — 9:42pm",
      "content": "Thanks.\n\nBy the way, how do it this blend? is in FontLab?\n\nJVB\n\n"
    },
    {
      "time": "23 Oct 2013 — 3:13am",
      "content": "You're welcome Vargas.  \nYes Fontlab. Make certain that you have opened the two fonts you want to blend. If you want to blend the upper case make certain that the capital height is comparable in the two fonts. I usually re-size the fonts based on setting the letter O at a height of 700. If you want to change the appearance of one of the fonts before blending, e.g. narrowing the width, do this. Then use the pull down tab for Tools and choose Blend Fonts. For significantly dis-similar fonts like Neuland Black and El Grande it's probably best to uncheck the box for \"Do not change type or add nodes in compatible outlines.\" For significantly dis-similar fonts you can expect to do some cleanup after blending to get rid of unwanted bulges etc. Somewhat of a learning curve to get the results you want. Best to try 50-50 blend amount before experimenting. It should not be too difficult to more or less replicate the results I posted.  \nDon  \nRevised\n\n"
    },
    {
      "time": "14 Dec 2013 — 3:14am",
      "content": "Here is the full alphabet of the original lettering -- \"Carnival Poster\", upper and lower case -- by Speedball in the 1940s:\n\n ![](http://web.archive.org/web/20150317114313im_/http:/typophile.com/files/CarnivalSpeedball_3839.jpg)\n  \nDon \n"
    }
  ]
}
