{
  "id": "106762",
  "title": "Need help finding webfont variations for House Industries Fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "house-industries",
    "housebroken-rough",
    "stanslope",
    "webfonts"
  ],
  "content": "Hello,  \nI am a huge fan of House Industries, having purchased the entire Neutraface family back in 2011. At that time, their webfont FAQ said webfonts were coming \"mid-2012\". Now it just reads \"sometime in the future. I totally get they want to put a quality product out and their are licensing issues and such so that people just don't rip the fonts from your web directory and the foundry and designer gets no compensation.\n\nThey do offer print fonts, but one is not licensed to use them in the new @font-face manner. It's OK to make a graphic of every title or whatever you want on your site and display it, but with today's technology, this becomes totally impractical and not really worth my time.\n\nThe two fonts I like from them are: Housebroken Rough: [http://www.houseind.com/fonts/housebrokenrough/](http://web.archive.org/web/20140712160655/http:/www.houseind.com/fonts/housebrokenrough/ \"http://www.houseind.com/fonts/housebrokenrough/\") and Stanslope ( [http://www.photolettering.com/a/ji32fec0a](http://web.archive.org/web/20140712160655/http:/www.photolettering.com/a/ji32fec0a \"http://www.photolettering.com/a/ji32fec0a\")). I purchased from Linotype the ITC Century package which is pretty similar to Stanslope but not quite the same. I suppose it will do, but it doesn't really have the flair I'm after.\n\nI need fonts that I can use for both print and web for my own business (single-use). I imagine if other clients saw and liked them there could be some option to add additional licenses, but right now, I'm just trying to locate something that approximates these two for both @font-face and print.\n\nIf anyone could give recommendations for where I might search or similar looking fonts, I would most appreciative. I don't mind paying, although free is always nice. I am just feeling overwhelmed by so many choices, none of which are quite what I'm looking for and I don't really know where to start. I do have an Adobe TypeKit license and now that I've purchased from Linotype I think I can upgrade my package if necessary.\n\nThank you so much for any feedback.\n\nBest,  \nMarie\n\n",
  "author": "techgraph",
  "time": "13 Oct 2013 — 11:52pm",
  "uid": "215231",
  "comments": [

  ]
}
