{
  "id": "106799",
  "title": "Problems kerning Bembo",
  "forum": "Design",
  "tags": [
    "bembo",
    "kerning",
    "Design"
  ],
  "content": "Hi everyone, first post here.\n\nI found typophile while looking for some infos about Bembo Std (picked up from the Adobe shop) which I'm using for a book.  \nFirst of all in the Adobe page there's the following statement:  \n\"Bembo Std family is designed to be used at a text size of 8.0 points\"  \nSo, is it a problem if I set size to 11pt ?\n\nI also have a little problem with kerning (I'm using InDesign).  \nI set \"Metric\" in the paragraph style (I read \"Optical\" is not the best choice for text ) but the result is not so good.  \nEspecially for the \"V\". The kerning is automatically set to -175 with the result that there's almost no space between the \"V\" and previous character.\n\n ![](http://web.archive.org/web/20150417175721im_/http:/typophile.com/files/kerning_4368.jpg)\n  \nIf I set kerning to \"Optical\" everything looks better so I'm thinking to switch to that but I'm curious about this strange behaviour.\n\nAny guess?  \nThanks in advance (and forgive my dodgy english!)\n\n",
  "author": "Lynx",
  "time": "15 Oct 2013 — 5:04pm",
  "uid": "215289",
  "comments": [
    {
      "time": "15 Oct 2013 — 8:14pm",
      "content": "<cite>\"Bembo Std family is designed to be used at a text size of 8.0 points\"</cite>\n\nMetal fonts could and often did have different designs for the different sizes. When fonts were first made available as photocomp, traditionally, an 8-point master (for footnotes) was made, a 12-point master (for text), and finally, an 18-point (for display). \"Master\" equals the size of the design with the metal fonts.\n\nGenerally, these were \"somewhat\" successful. The people making up the photocomp fonts usually didn't have the skill, or maybe time, to get the thick-thin proportions of the metal fonts, when printed with the paper of the time, into the photocomp environment. As a result, one size was often more successful than the others, and occasionally, the 8-point \"master\" became the preferred version. It could be more than just the technical success of the rendering, of course, Magazines were coming along, and the design of a \"footnote\" font more closely matched the perceived needs of magazines than text fonts.\n\nFor all these reasons, the 8-point master became the preferred one for Bembo in photocomp, and the only one originally offered in PostScript (for Bembo \"Standard\"). You don't think they redid anything, do you? Not for PostScript, and not for OpenType.\n\nHowever, it is still terrible. If you want to use Bembo for text, you should be using the newer Bembo Book. Why do they still sell the Standard? Well, a fool and his money are soon parted; if you'll buy it, better they get your money than someone else, eh? And the \"Standard\" is still marginally useful for display settings, even though it is an 8-point design.\n\nNice font in metal. Rushed to market in Photocomp (and PostScript). Happened to a lot of the fonts popular in the metal era. Your money, your choice.\n\nAs to the kerning. Yes. A part of setting type. That's what typesetters are for. You need to learn how to do that. We're still not to the point where you can simply dump a text into a machine and wonderful stuff pops out. Probably never will be, unless we standardizes everything -- type size, measure, margins, on & on. Most of what a typesetter does is to try & pick the best compromise.\n\nKerning isn't a compromise? It falls between letter pairs, with no eye to the letters on the other side of that pair. Example: Kern WAVE by hand. For drama, use a setting size of 18 points. Now use the same value for WA that you used in WAVE, but set WARE. In 14-point. As Alan Greenspan was heard to say, \"oops!\"\n\n"
    },
    {
      "time": "16 Oct 2013 — 3:59pm",
      "content": "When Bembo was digitized 20+ years ago, it was the fashion to kern fonts aggressively.  \nHence the closing up between the “space” and “V” characters.  \nBut problems emerged with this approach, and I don’t think too many foundries do it any more.\n\n"
    },
    {
      "time": "16 Oct 2013 — 4:34pm",
      "content": "Well, thank you Charles for your in depth answer and the quick history lesson. Didn't know the story (I should have pointed out that designing books is not my cup of tea so I realize I made some noob questions).  \nI will experiment with similar fonts and I'll maybe switch to Bembo Book if it's affordable.  \nThanks also to Nick for pointing out this detail, I was in fact quite puzzled seeing that kerning value with no reason, so to say.\n\nI still have a lot to learn here.\n\n"
    },
    {
      "time": "16 Oct 2013 — 5:37pm",
      "content": "<cite>I still have a lot to learn here.</cite>\n\nMe too, and I've been at it over 30 years.\n\nWhile not an answer based on exhaustive searching (I don't know, for example, what ShinnType offers in a Venetian revivalist mode), take a look at Espinosa Nova.\n\n[http://www.myfonts.com/fonts/estudio-ch/espinosa-nova/](http://web.archive.org/web/20150417175721/http:/www.myfonts.com/fonts/estudio-ch/espinosa-nova/ \"http://www.myfonts.com/fonts/estudio-ch/espinosa-nova/\")\n\nIt appears the roman is still free and the italic $50; you can go a long way with them. To go beyond is essentially the full $400 package, perhaps a bit pricy for a beginner, but we in fact have the entire offering, so I'm familiar with it. Both my company and my wife's have set several books with the fonts; they worked well.\n\nYes, it is a modernization of the work of a Spanish priest in the New World. Call it an oldface if you want, but to my eye, the influences are more Venetian than French.\n\nAnd Christóbal Henestrosa took the pains to test the fonts with high-resolution offset printing as well as laser printing before publishing them, an important but usually overlooked step.\n\nThe thing that attracted me in the first place was the EULA -- Christóbal allows the end user to modify the fonts, without prior permission, though he does ask to be notified if/when modification work is done.\n\nNot to say they are bad as published. The x-height is a little taller than with Bembo, but that is in keeping with a 2013 fashion. I think they still need a little more weight, but unlike with Bembo, that is at least arguable. A couple of the characters need work, to my eye, perhaps not to yours.\n\nAll in all, if Bembo (Standard) is an appropriate choice for your book, Espinosa Nova will be better. Whether it is better than Bembo Book, I can't really say. At $50 for the roman and italic, it is certainly cheaper.\n\n"
    },
    {
      "time": "17 Oct 2013 — 12:08pm",
      "content": "Charles, I am “still working” on the upgrade to Goodchild (Shinntype’s Venetian), on which you were so kind as to assist. That upgrade kind of ground to a halt, what with new ideas that caught my fancy, and the present general lack of commercial interest in historical revivals of serifed typefaces. One day, though…\n\n"
    },
    {
      "time": "21 Oct 2013 — 7:49am",
      "content": "@Nick Shinn \"the present general lack of commercial interest in historical revivals of serifed typefaces\"\n\nAnd how! Kind of a rude awakening when I finished my first complete family (a reinterpreted Garalde). Ah well; being an amateur is fun anyway.\n\n"
    },
    {
      "time": "21 Oct 2013 — 12:29pm",
      "content": "@ Michael:\n\nHmm. Garamonds seem popular. We get in a number of books specified in Adobe Garamond Premier -- you know, the \"historical\" version of Adobe Garamond.\n\nI've always found French typefaces like French cars. \"Interesting, very Interesting,\" spoken in your best Arte Johnson voice. Take the Citroën. Now maybe if I were being chauffeured around, I'd think it delightful. But not as a driver. I'd prefer an Italian car. And I prefer Italian type, too, when I'm driving...\n\nIf Bembo is just too tutu, There is always John Downer's Iowan Old Style. Great big honking x-height, and with a little work, wonderful character fit. A little light for text, but they all are, to my eye, so maybe I'm wrong. Intermediate on the x-height is Espinosa Nova.\n\nHaving said all that do you care to show it? (& allowing that \"Garalde\" can have a lot of different visual interpretations - are you using the term to mean \"between humanist & modern\"?) If you can post a link where I can see it, I'd like to take a look. Esp. if it's flavor is more Manutius than Garamond.\n\nIf you were too true to letterpress & wetted paper, it will likely be of no use to us modern folk -- e.g., offset printing on Glatfelter 55 uncoated papers. But if you've reinterpreted it a certain way, it might be interesting, esp to those in scholarly publishing who don't favor the currently fashionable \"chunky\" letterforms.\n\nCharles\n\n"
    },
    {
      "time": "26 Oct 2013 — 4:47pm",
      "content": "@Charles,\n\nWell... I doubt it's ready for prime time, and the italic is a bit French, but at least it's easy to read. I went more for a vibe and what pleases me than for specific details, so there are some anachronisms. You can see the original at [http://typophile.com/node/107005](http://web.archive.org/web/20150417175721/http:/typophile.com/node/107005 \"http://typophile.com/node/107005\") along with the current revision. (I just created said thread; has Typophile been down all week for anybody else?) Cheers.\n\n"
    },
    {
      "time": "28 Oct 2013 — 11:54am",
      "content": "@Lynx:\n\nAs for optical vs. metrics kerning, use whatever works best, and don't sweat it. Your font simply has a kerning table that is optimized for a given point size (or, if you aren't charitable, it has a bad kerning table), and InDesign's algorithm does a better job. If the result looks good, it _is_ good. If you want to, you can tweak the kerning yourself, but that takes a lot of work and your font license might not permit doing so.\n\n"
    },
    {
      "time": "28 Nov 2013 — 7:57pm",
      "content": "@Michael\n\nIt's been a month, but with Typophile's problems...\n\nI think you should press on, but that's more encouragement than interest. My \\*interest\\* remains with a closer following of the Manutius/Griffo tradition. I have no idea why.\n\n"
    }
  ]
}
