{
  "id": "10674",
  "title": "Hermann Zapf",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "On the ever-popular subject of proper pronounciation:   \n   \nHermann Zapf.   \n   \nIs it \"zap\" or \"zaf\"? (Or neither?)\n\n",
  "author": "anonymous",
  "time": "7 Mar 2003 — 7:42pm",
  "uid": "1203",
  "comments": [
    {
      "time": "8 Mar 2003 — 9:17am",
      "content": "Hmmm... there's no phonetic font here ;-D.   \nAnd I don't know how to translete the phonetics into English properly. In German, its spoken just as it's written.\n\n"
    },
    {
      "time": "8 Mar 2003 — 10:03am",
      "content": "_In German, its spoken just as it's written._   \n   \nLOL HD, brilliant quote. ![:-)](http://web.archive.org/web/20131022055857im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nDo you pronounce the 'p' preceding the 'f' or not? And is the 'Z' an even sound or is it more like 'tz'?\n\n"
    },
    {
      "time": "8 Mar 2003 — 10:35am",
      "content": "(T)zapf. The Z is not too soft, the a is open, as in A-ha, the pf like the sound of a hydraulic door opening :-D.\n\n"
    },
    {
      "time": "9 Mar 2003 — 2:45pm",
      "content": "I had some uptight designer/know-it-all come in one day and specify that she wanted her bold headlines set in \"Gheel Sahns.\" I asked her if that was the same thing as Gill Sans, and she said yes, but that I was mispronouncing it. I replied that I didn't know Eric Gill was French since he was from England. That shut her up.   \n   \nIn retrospect, though, I don't know how Eric pronounced his last name. Soft G or hard?\n\n"
    },
    {
      "time": "10 Mar 2003 — 10:25am",
      "content": "_In retrospect, though, I don't know how Eric pronounced his last name. Soft G or hard?_  \n   \nHard. Except when he wasn't feeling too well and he didn't pronounce the 'G' at all.   \n   \nBut in France he's 'Gilles' and there's no changing it. In the end, though, who cares. There are much more important things in life than the correct pronunciation of the names of typefaces.   \n   \nMatha\n\n"
    },
    {
      "time": "11 Mar 2003 — 3:55pm",
      "content": "\"There are much more important things in life than the correct pronunciation of the names of typefaces.\"   \n   \nNot if (a) you deal with these names everyday, and (b) respect the people who designed them.   \nBy your answer, it's apparent that you do not.   \n   \nI wish, somewhere on this site, a page could be created with the proper pronounciation of all the great typefaces/designers. Otherwise the question is just going to keep coming up again and again.\n\n"
    },
    {
      "time": "12 Mar 2003 — 1:04am",
      "content": "That would be nice indeed, Andrew.   \nMaybe start a thread about it and just have people post the names with correct pronounciation on there?\n\n"
    },
    {
      "time": "12 Mar 2003 — 7:29pm",
      "content": "Yes, but that only discusses a few names, as have other threads in the past of a similar nature. I'm talking about an all-encompassing list of all the big names [and some small ones too].   \n   \nAccording to HHP in that thread, Goudy is pronounced \"Gawdi\"(?) Was that a joke?\n\n"
    },
    {
      "time": "12 Mar 2003 — 10:43pm",
      "content": "No joke.   \nBTW, just call me hhp.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Mar 2003 — 12:31am",
      "content": "Uh, well, I didn't know the guy personally but I've always assumed it was \"Gow-dee,\" the 'gow' rhyming with cow.\n\n"
    },
    {
      "time": "14 Mar 2003 — 6:14am",
      "content": "I'll let you in on a little secret, Andrew, if you promise not to tell anyone.   \n   \nAll over the world there are a hell of a lot of Graphic Designers using typefaces with exotic/foreign names every day. A high proportion of them don't pronounce 'Gill' exactly as Gill himself would have done. What does that change? Do they respect his work any less that you? And what about non-French designers trying to pronounce French names? I don't think they're going to win any pronunciation contests.   \n   \n_Not if (a) you deal with these names everyday, and (b) respect the people who designed them.   \nBy your answer, it's apparent that you do not_      \n   \nThis is total hypocrisy coming from someone who admits to shutting up an uptight know-it-all because she mispronouned a typeface name. Try a little more respect for people, Andrew, and a little less for typeface names.   \n   \nAnd I advise you to reread your posts. Do you really mean to suggest that there is **nothing** more important in the world that correctly pronouncing a typeface name?   \n   \nDon't be a chauvinist. Self is not the yardstick of truth.   \n   \nMatha Donnchadh Stand\n\n"
    },
    {
      "time": "12 Mar 2003 — 10:29am",
      "content": ":: Puts librarian glasses on bridge of nose ::   \n   \nTry this thread: [http://www.typophile.com/forums/messages/30/675.html](http://web.archive.org/web/20131022055857/http:/www.typophile.com/forums/messages/30/675.html)   \n   \n:: Removes glasses ::\n\n"
    },
    {
      "time": "8 Mar 2003 — 9:01am",
      "content": "Since he's German, I'd say it's \"tzaff\".   \nI might be wrong, though ![:-)](http://web.archive.org/web/20131022055857im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    }
  ]
}
