{
  "id": "10676",
  "title": "Unicratica",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Here is a new typeface I have been working on for a while called Unicratica Sans. The concept is to mutate several of my favorite sans serif faces into something more contemporary. I was inspired years ago by Jens Gehlhaar's CIA Condendium (his grad school thesis project) Unlike Gehlhaar I am not relying so much on mathematics to accomplish this but more personal aesthetics and current design trends. Besides adding lower case (which is in the works) I wish to be expanded the face in to a unicase, multiple weights and styles. I want the majority of the characters to have 3 alternates like FontBoy / Bob Aufuldish's NewClear family, that are interchangable and aligned.   \nBlack letters are in my opinion great just the way the are, the dark green letters need some work and the light green letters I am not so sure about yet. These need the most work of all.I could use some professional critique.\\image\n\n",
  "author": "designalchemy",
  "time": "1 Feb 2002 — 2:01am",
  "uid": "804",
  "comments": [
    {
      "time": "1 Feb 2002 — 9:34am",
      "content": "I think the transparency effect is amazing.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Feb 2002 — 12:33pm",
      "content": "What I would say is this:   \nIn the font world, we currently have enough policemen, and we have enough hooligans, so I would suggest you take the middle ground, and take this down a subtly funky path. Like your first \"D\", your \"J\" (really, really cool), your second \"N\", your BP, and your curly braces have potential, but the rest I feel is either too strict or too loose (mostly the former).   \n   \nhhp\n\n"
    },
    {
      "time": "8 Feb 2002 — 11:03pm",
      "content": "well Joe, that is exactly what I have in mind. I know this will make it more flexible and I am toying with the idea of making this face so flexible that I will need nothing else. I think it would be fun to use one single typeface for one year of design. I will properly never actually take this idea all the way and only use one face for a year, but I like the concept. I will upload a few more character/alternates in a few hours so check back.\n\n"
    },
    {
      "time": "9 Feb 2002 — 12:09am",
      "content": "I like this face a lot -- it's clever in a lot of ways -- and would hope that you would complete it. What most interests me are the counters. They are a riff on the typical counters.   \nOle, in constructing this face, did you work inside out from the counter, or is the counter the result of the directions you took with your stems.   \nDo you follow?   \n   \nAnother question. Are you going to create a separate font for the alternates or are you going to find hardly used fontog. cells to put your third 'E', etc.   \n   \nbj\n\n"
    },
    {
      "time": "9 Feb 2002 — 12:46am",
      "content": "Hi BJ, I worked on the outside in. The cap \"O\" was the first character followed by the \"S\". I went into a lower case pretty early on but do not think it works yet (not posted yet). I have considered doing a kursive and the lowercase I have may work there if oblique/tilted. I have had a fixation with 3 shaped \"E\" for a while and had to try it with this face. The design as a whole is partly bits and pieces of client based logo types I have done for the past 2 years, but drawn from scratch in this incarnation. ![Seve.jpg](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/messages/29/786.jpg)\n\n"
    },
    {
      "time": "9 Feb 2002 — 12:52am",
      "content": "I like these letters too. The 3 as E is certainly worthy of an empty box in fontog. I've been doing that lately, making lots of alternates...but you know what is reallllly cool: the Sigma sign as an uc E.   \n   \n   \nbj   \n   \np.s. structural v. structual\n\n"
    },
    {
      "time": "9 Feb 2002 — 1:02am",
      "content": "Sigma character, that's been used a couple of times in movie titles. \"Enemy of the State\" and   \n\"Spy Games\" both done by the same design firm, whose name escapes me (maybe Yuco?)\n\n"
    },
    {
      "time": "9 Feb 2002 — 1:15am",
      "content": "Try Sigma with Unicratica, just so you can have a fourth 'E' alternate. ![:)](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI'm familiar with the Enemy of the State font. It's called Metrolox by Karen Clemens. It's free at Apostrophic Lab. She runs a design firm in Belgium. Did she make a font based on the movie type, or did some agency use her font?   \n   \n   \nSpeaking of movie type, what's the name of the 'Black Hawk Down' typeface? Anyone?\n\n"
    },
    {
      "time": "9 Feb 2002 — 1:28am",
      "content": "Licko's \"Citizen\" from Emigre\n\n"
    },
    {
      "time": "9 Feb 2002 — 1:41am",
      "content": "Thanks. I didn't realize that Citizen had the 'grooves' cut out of the uc 'A' and 'W'. Until now. ![:)](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nbj\n\n"
    },
    {
      "time": "9 Feb 2002 — 1:57am",
      "content": "re: which came first. I downloaded Metrolox and in the read me, found this:   \n   \n \"Metrolox is loosely based on the titling of the Enemy of the State movie. I say \"loosely\" because the movie titling showed only so many letters, and the lab's final version turned out so big.\"   \n   \nApostrophe worked with Karen Clemens on this. The font comprises 568 glyphs, incl. Turkish, Baltic, Russian, Greek, etc.   \n   \n   \nbj\n\n"
    },
    {
      "time": "9 Feb 2002 — 11:12am",
      "content": "Here are some studies on the character G, the lower right corner has final version.   \n ![Unicratica G Study.jpg](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/messages/29/794.jpg)\n\n"
    },
    {
      "time": "9 Feb 2002 — 9:40pm",
      "content": "Nice study, and ideal choice!   \n   \nhhp\n\n"
    },
    {
      "time": "13 Mar 2002 — 11:10pm",
      "content": "Hello and welcome Milan, I took your advice to see what the G would look like if the horizontal stem was removed here is 3 versions.   \n   \n ![New Unicratica G.jpg](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/messages/29/968.jpg)\n\n"
    },
    {
      "time": "11 Aug 2002 — 7:27am",
      "content": "Very nice. Very nice. And unicase! God Bless You, man. Keep us posted. I'm highly interested.\n\n"
    },
    {
      "time": "12 Aug 2002 — 3:08am",
      "content": "Thanks Dylan. I think it is about time I get working on this face again. I showed it as work in progress when I met with a multi-national ad agency this past friday and they were impressed.   \nThey would like to hire me on freelance basis especially for type and photoshop work which are my strongest skill sets. I was thinking during the meeting how it is kind of pathetic that I am so into type yet have never finished a full face. I guess i get a bit overly critical which often kills the joy of making type. In the beginning I was working on this constantly for a few weeks and got stuck in the lowercase which is about 40% completed. I am thinking I will properly finish the unicase first as itis something I use a lot. Thanks for the encouragement. I will post as it progresses. Ole\n\n"
    },
    {
      "time": "13 Aug 2002 — 1:23am",
      "content": "Ole: i have a questio. Will you optically optimize the vertical and horisontal parts, or doesnt that fit in your concept?   \n   \nFor example: the last G's are to heavy for my likings in their horisontal parts.   \n   \nDo you want to sell this type yourselve? Maybe Lineto.com could be an option. Their type have the same kind of feeling.   \n   \nJacques\n\n"
    },
    {
      "time": "13 Aug 2002 — 2:25pm",
      "content": "Hi Jacques. I know what you mean and I and knew this may be an issue from the beginning. I set up the rules early on which included monoline, the slightly angular curves, flatening any curve if possible without sacrificing aesthetics, keeping all the usual \"G\" \"O\",\"Q\",\"S\"and \"U\" withing the parimeter of the base character height. Character width is not designed for a true monospaced OCR, but I wanted to make keep it going in that direction aesthetically, so several letters like the \"M\"'s are narrower because of this. I tried some wide \"I\"s but I didn't like them so went more in the direction of small slab srifs on the \"I\". There was consideration to having 2 alternates of each letter character, which i will properly still do. one of the could be optically adjusted, which is actually a really good idea you brought up.   \nMarketing. I am not sure. I know Rod at PsyOps and would be proud to be distributed by him. He is very ethical and trustworthy as well as talented in the design and distribution of type.   \nI am currently working on some promotional collateral for Psy/Ops's latest release \"Reform\". Emigre would properly be the most prestigious distributor but they are really hard to get distributed by, according to people I know who have approached them with good designs. Lineto is premium, I like their collection a lot and I do think it would be the best match aesthetically.\n\n"
    },
    {
      "time": "13 Aug 2002 — 2:28pm",
      "content": "\\> they are really hard to get distributed by   \n   \nPlus, their royalty is very low, which might have been OK back when they promoted the fonts heavily (like through the magazine being free), but now it might be better to release \\*music\\* through them...   \n   \nhhp\n\n"
    },
    {
      "time": "13 Aug 2002 — 2:34pm",
      "content": "Adam Roe (Luchbox Studio) was one of t-26's best sellers back in the early days, he has completely rejected by Emigre and he is no amateur.\n\n"
    },
    {
      "time": "14 Aug 2002 — 1:24am",
      "content": "\\> to get distributed by   \n   \nWhat about Lineto (www.lineto.com)? Those are nice guys and your typeface would fit in their library.   \n   \nJacques\n\n"
    },
    {
      "time": "14 Feb 2003 — 10:05pm",
      "content": "I started a Blackletter version of Unicratica using the original skeletal of Unicratica. I have a few hours into the first letters glyphs and wonder what the rest of you type heads think about it. Working Title is Unicratica Blackletter.   \n ![Unicratica Blackletter](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/messages/29/6597.jpg)\n\n"
    },
    {
      "time": "14 Feb 2003 — 11:11pm",
      "content": "This is cool. More, please!   \nBTW, of those \"C\"/\"c\"s, I like the very middle column best.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Feb 2003 — 12:09pm",
      "content": "Awesome! I think there's a huge wealth of historical letterform variation just waiting for sans-serif interpretation. The current humanist deluge could just be the tip of the iceberg (hm, a mixed metaphor?).   \n   \nPaul\n\n"
    },
    {
      "time": "8 Dec 2003 — 4:15am",
      "content": "Ole, I just don't understand why did you write in the beginning Jens Gehlhaar's CIA Compendium is \"relying so much on mathematics\". I have Jens' booket and we used to talk a lot around a year ago but I never felt anything mathematic. It's just a choice of skeletal forms, then divided in families following a thematic approach.   \nMaybe you wished to say your approach is not systematic in this sense, but relies just on taste, which is just a different approach, but neither yours nor Jens' is \"mathematical\".   \nAm I wrong?\n\n"
    },
    {
      "time": "8 Dec 2003 — 7:21pm",
      "content": "As I understood the CIA project... The skeletal forms were derived from compiling data from existing faces's proportions and using that as a starting point. From there   \npersonal taste and aesthetics brought the forms to their final form. Did I misunderstand the process used in the   \nCIA Compendium?\n\n"
    },
    {
      "time": "8 Dec 2003 — 7:25pm",
      "content": "Speaking of Gehlhaar. What is he doing/ Teaching? New work?\n\n"
    },
    {
      "time": "3 Mar 2004 — 8:05pm",
      "content": "Unicratica is being completely reworked from scratch. Here is first use of new version. Logo type for my (re-named) design firm Creative Factor.   \nI will upload more characters in the next few days...   \n   \n [www.creativefactor.com/portfolio](http://web.archive.org/web/20150414211659/http:/www.creativefactor.com/portfolio)   \n   \n ![new Unicratica](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/messages/29/27759.jpg)\n\n"
    },
    {
      "time": "3 Mar 2004 — 8:52pm",
      "content": "here are some details of the character development...   \n   \n ![details](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/messages/29/27766.jpg)\n\n"
    },
    {
      "time": "4 Mar 2004 — 3:25am",
      "content": "Mmmm, tasty. Keep this train rolling!\n\n"
    },
    {
      "time": "25 Mar 2004 — 10:43am",
      "content": "Slowly but surely... Unicratica is evolving. This is a monolinear version. Lowercase is 30% done. I am still reworking A, K, M, X, Y. There is 3-4 version of most glyphs. so most like thee will most likely be an alternate set. as well as small caps 20% done   \nin 3 weights.   \nAlso in the works is the text version coming in 7 weights, tabular and lining numerals. Wide version just started with only   \n16 glyphs done( in regular weight only so far.   \nCreative Factor is set in text version.   \n ![new unicratica mono](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/messages/29/29255.jpg)\n\n"
    },
    {
      "time": "25 Mar 2004 — 11:56am",
      "content": "Is this a monospace design? If not, some of the glyphs (like the \"E\") are too wide. I think the \"G\" really needs a much stronger \"lip\". As for the \"4\" and \"7\", that's just my cup of tea!   \n   \nhhp\n\n"
    },
    {
      "time": "25 Mar 2004 — 12:16pm",
      "content": "Characters are exactly the same width/height, with exception of \"Q\". I drew glyphs to be exactly 254mm x 174 mm, before dropped them to to 3.82%   \nof original size to create 42point specimens. As for weight. I used horizontals at 100%, 90\n\n"
    },
    {
      "time": "25 Mar 2004 — 12:20pm",
      "content": "Oops.I goofed . As for weight. I used Verticals at 100%, 90\n\n"
    },
    {
      "time": "25 Mar 2004 — 12:26pm",
      "content": "\\> Characters are exactly the same width/height   \n   \nThat's an interesting approach. The thing is:   \n1) This means they won't really be monowidth, since the shapes of the profiles affect spacing.   \n2) Some glyphs will still appear wider/narrower than others, due to structural \"illusions\".   \n   \n\\> I love the 4 so much   \n   \nBut be careful of glyph-love, dude. It can ruin a font.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Mar 2004 — 12:34pm",
      "content": "glyphophile.com ?\n\n"
    },
    {
      "time": "25 Mar 2004 — 12:41pm",
      "content": "[http://www.typophile.com/forums/messages/30/29262.html](http://web.archive.org/web/20150414211659/http:/www.typophile.com/forums/messages/30/29262.html)   \n   \nhhp\n\n"
    },
    {
      "time": "25 Mar 2004 — 12:48pm",
      "content": "I have looked at so many mono fonts and all have different ratios, example below.   \n   \n  ![horizontals](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/messages/29/29266.jpg)\n\n"
    },
    {
      "time": "25 Mar 2004 — 1:03pm",
      "content": "Here is a close up of my \"B\" and \"E\".   \nI have not yet decided what is best thickness for center horizontals. Any Suggetions?   \n  ![BE](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/messages/29/29278.jpg)\n\n"
    },
    {
      "time": "26 Mar 2004 — 2:56pm",
      "content": "Lowercase Study of \"b\".   \n ![b](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/messages/29/32113.jpg)\n\n"
    },
    {
      "time": "4 May 2004 — 9:43am",
      "content": "Great Work on Unicratica Ole!... Can't wait to see it finished.\n\n"
    },
    {
      "time": "4 May 2004 — 3:43pm",
      "content": "fantastic!\n\n"
    },
    {
      "time": "1 Sep 2004 — 8:27am",
      "content": "Unicratica Wide version in use for Creative Factor (my company). Mods to previous versions include new C, O and A.   \nStill can't nail the S, any suggestions. From looking around at my font collection and online I do like the S in Lineto's Simple but not sure similar would match? ![Unicratica Wide (revised forms)](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/messages/29/47992.jpg)\n\n"
    },
    {
      "time": "1 Sep 2004 — 8:47am",
      "content": "Solid.   \nWhere's the \"S\"?   \n   \nBTW, I think the space around the bar is too little compared to the letterspace.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Sep 2004 — 9:14pm",
      "content": "I think usually the top of the S is smaller than the bottom. Eg. when I look at your S upside down it looks better. Randy Jones calls this the [trapezoid effect](http://web.archive.org/web/20150414211659/http:/www.typophile.com/forums/messages/29/21083.html?1069882058). I know you are limited by the monospace, but maybe trying the smaller tops will give you a solution.   \n   \nThe the curves on your characters are so sweet for a monospace, it is amazing - well done. I think the K needs work, as well as the S. I like the first E and more conventional N better.\n\n"
    },
    {
      "time": "21 Nov 2004 — 11:22am",
      "content": "I think the Unicratica Blackletter is a wonderful idea, hope you continue with it.\n\n"
    },
    {
      "time": "1 Feb 2002 — 11:53am",
      "content": "![Unicratica](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/messages/29/734.jpg)\n\n"
    },
    {
      "time": "8 Feb 2002 — 10:00pm",
      "content": "I thought I would upload a detail shot, so it is easier to see the subtle curves that escape the eye on the previous image.   \n ![UnicraticaDetail](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/messages/29/774.jpg)\n\n"
    },
    {
      "time": "8 Feb 2002 — 10:00pm",
      "content": "I thought I would upload a detail shot, so it is easier to see the subtle curves that escape the eye on the previous image.   \n ![UnicraticaDetail](http://web.archive.org/web/20150414211659im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n"
    },
    {
      "time": "8 Feb 2002 — 10:23pm",
      "content": "I'm really liking the flavor of this. Very nice,   \nOle. Have you considered doing the whole gamut of   \nalternates, rather than narrowing down the set?\n\n"
    }
  ]
}
