{
  "id": "106736",
  "title": "Font source for Roger White's \"Telford\"",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": " ![](http://web.archive.org/web/20140405001026im_/http:/typophile.com/files/SourceOfRipOrScan_6264.jpg)\n  \nWhile researching Roger White's \"Carolus\" for [http://typophile.com/node/106734](http://web.archive.org/web/20140405001026/http:/typophile.com/node/106734 \"http://typophile.com/node/106734\") I came across this squared sans serif that he calls \"Telford.\" It looks like it was created by Photolettering or Filmotype in the 1960s as an exercise in optical stretching of font width. There is also an outline version and italics.  \nDoes anyone know anything about the source font?  \nThanks.  \nDon \n",
  "author": "donshottype",
  "time": "12 Oct 2013 — 1:04am",
  "uid": "205259",
  "comments": [
    {
      "time": "12 Oct 2013 — 3:28pm",
      "content": "From the txt file in the copy folder I have:\n\nABOUT THE FONT\n\n'TELFORD' is a high quality font containing full hinting for correct rendering  \nat small point sizes and a total of 926 kerning pairs for correct character  \nspacing. It is supplied 'as is' and no waranty is implied or given by the  \nauthor. The font is suitable for both headlines and body text, and should  \nrender well down to 8 point. The font contains a full range of upper and lower  \ncase letters together with the figures 0 to 9, a full range of punctuation,  \nbut no diacritics. It was hand traced in order to achieve a high quality outline  \nand compiled using Type Designer 3.1. This font represents aproximately 400  \nmanhours of work.\n\nThe latest version of this font is always available for download from the  \nfile list of the fonts conference on the Cix conferencing system. The author  \nwould appreciate notification of any problems experienced with this font  \ntogether with any suggestions for improvements.\n\nRoger White,  \n1, Owens Close,  \nRugeley,  \nStaffs,  \nWS15 2YH,  \nEngland.\n\n"
    },
    {
      "time": "12 Oct 2013 — 4:34pm",
      "content": "Hi Bob.  \nThanks.  \nYour text file is the same as the one that came with my copy of \"Telford.\"  \nClear as mud on the actual source font.  \nSo Typophiles, any bright ideas?  \nDon\n\n"
    }
  ]
}
