{
  "id": "106845",
  "title": "Looking for a good typeface for a Soul Food place",
  "forum": "Design",
  "tags": [
    "advice",
    "choosing typefaces",
    "typography",
    "Design"
  ],
  "content": "I'm designing for a take out Soul Food place, but with a healthier twist.  \nThe restaurant will have a graffiti wall, so there's an 'urban' element to it (I hate that word!)\n\nI could use some advice on:  \n1. A font that could serve as a logo/wordmark  \n2. Some supporting faces for menus and such.\n\nI'm trying to steer clear of anything too cliche (and offensive).\n\nAny help is much appreciated.\n\n",
  "author": "MMux",
  "time": "17 Oct 2013 — 10:32am",
  "uid": "215154",
  "comments": [
    {
      "time": "18 Oct 2013 — 11:24am",
      "content": "There are some contradictions here: comfort food vs healthful; traditional down-home southern vs urbanly hip. And of course, a takeout should be friendly and maybe a little loud, or at least noticeable. And maybe there should be a nod to the graffiti. But nothing that might be offensive or a cliché. That's a lot for a font.\n\nIf \"Soul Food\" is part of the name of the restaurant, then everyone probably understands the menu. How about Winco? It's solid and reliable (like soul food) and somewhat friendly (not corporate) and a little bit hip and has a clean (healthful) look?  \n [http://www.fontshop.com/fonts/downloads/retype/winco\\_complete\\_ot/](http://web.archive.org/web/20150417180154/http:/www.fontshop.com/fonts/downloads/retype/winco_complete_ot/ \"http://www.fontshop.com/fonts/downloads/retype/winco\\_complete\\_ot/\")  \n [http://www.re-type.com/fonts/fonts-winco.html](http://web.archive.org/web/20150417180154/http:/www.re-type.com/fonts/fonts-winco.html \"http://www.re-type.com/fonts/fonts-winco.html\")\n\nOr are you looking for something hipper?  \n [http://www.myfonts.com/fonts/sudtipos/hipster-script-pro/](http://web.archive.org/web/20150417180154/http:/www.myfonts.com/fonts/sudtipos/hipster-script-pro/ \"http://www.myfonts.com/fonts/sudtipos/hipster-script-pro/\")\n\nOr something bolder and neon-y for a takeout shop? Can you give a hint about what direction you are leaning?.\n\n"
    },
    {
      "time": "18 Oct 2013 — 3:21pm",
      "content": "You might check out the Red Rooster Harlem restaurant for ideas. It's a contemporary, upscale, comfort-food restaurant. Michelle Obama recently asked them to cater an event. [http://redroosterharlem.com/](http://web.archive.org/web/20150417180154/http:/redroosterharlem.com/ \"http://redroosterharlem.com/\")\n\n ![](http://web.archive.org/web/20150417180154im_/http:/typophile.com/files/redrooster2_5192.jpg)\n\n"
    },
    {
      "time": "20 Oct 2013 — 12:43pm",
      "content": "Hi,  \nThanks for this. So the physical location the client has in mind, is that this is going to be next to a basketball court, plus we'll have a wall of graffiti as mentioned before.\n\nI don't want to try to outdo graffiti style stuff. We can't go too hip hop. I'd like a nod to it, but w/o seeming like a poser (even though I used to write graffiti in the 80's!).\n\nIt's Soul Food, so the menu will be familiar, but with some slight variations.\n\nI do like winco, and it might find it's way as a supportive typeface if not a primary. Perhaps with a treatment behind it, or an outline, it might get loud in the right way.\n\nThe place will be called 'soul sammich' so I'm going to try mixing a bold 'soul' face, perhaps with a script. Maybe because the word 'sammich' is non standard, a script could be used for 'soul' perhaps like a graffiti style script w/o overreaching.\n\nDoes that paint a clearer pic of the place? Any feedback helps, so thanks...\n\n"
    },
    {
      "time": "20 Oct 2013 — 12:39pm",
      "content": "For the Harlem restaurant, this is really nice, but a bit less street than my client is looking for. Nice though...\n\nThanks.\n\n"
    },
    {
      "time": "21 Oct 2013 — 2:22pm",
      "content": "Soul Sammich. I like it.\n\nWant to see some good examples? Come to Memphis and I'll drive you around. No offense intended to the other posters, but Hipster-script, hipster anything it is not. There's an inherent lack of stylish pretension in soul food. For the most part the hipness of all good soul food graphics is going to be hand-lettering and not typography. There's more soul in works by hand. When typography is used at soul food places, at least around the South, it's usually bad vernacular sign shop slop, which sometimes actually has it's own quirky charm, but most often is just plain lame and ugly. The best menus that set the mood are also done by hand.\n\nWe had a great soul sammich here called the Soul Burger, served at an ancient South Memphis whorehouse, now just a funky bar, called Ernestine & Hazel's. Unfortunately the owner killed himself a few weeks ago in the upstairs bar, which is allegedly haunted. The new management says they'll continue unchanged, but we'll have to wait and see.\n\nI think you should maybe look for a few fonts for inspiration, but mainly stick with putting some funk in your pens and laying some ink on paper. (And stay away from haunted whorehouses.)\n\nThat's a fun project, enjoy it.  \nD\n\n"
    }
  ]
}
