{
  "id": "10689",
  "title": "Design Submission",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Here is a PDF of a design I have made.   \nMy objective is to complete a full set of motions   \nfrom design to submission and hopefully distribution   \nin the pursuit of gaining experience in doing so -   \ndealing with foundrys, prepping the file etc.   \n   \nI am hoping to be fully prepared when I am   \nfinished with more serious designs. I want to   \nhave this experience under my belt when the   \ntime has come.   \n   \nIf no one likes it, I'll sell it on Myfonts.com.   \nYet another experience to be learned.   \n   \nI am not as interested in a critique of the   \ndesign so much as what I should or should   \nnot be doing in my presentation. ( I think   \nsomeday I will regret having designed this.)   \nBut some comments are welcome if you really   \nthink it should be said.   \n   \nIn my email, to the place that I will be   \nsubmitting it to, I will include my inspiration for   \nthe design, through contact info and...   \n   \nwhat else? What should I leave out?   \n   \nWHERE SHOULD I SEND IT?   \n   \n-smc\n\n<!--attachment: MUFFLER-TEXT-7403.pdf*mime_pdf.gif*application/pdf*122.2 **MUFFLER%2dTEXT%2epdf --><!--attachment: MUFFLER-TEXT-7403.pdf*mime_pdf.gif*application/pdf*122.2** MUFFLER%2dTEXT%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150414192556im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20150414192556/http:/www.typophile.com/forums/messages/4102/MUFFLER-TEXT-7403.pdf\" target=\"_blank\"><b>MUFFLER-TEXT.pdf</b></a> (122.2 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nOh yea, it is not really finished. I am going on   \nthe advise that changes will be suggested by   \na distributor.   \n   \nTHANKS!\n\n",
  "author": "sean",
  "time": "11 Mar 2003 — 8:24am",
  "uid": "596",
  "comments": [
    {
      "time": "11 Mar 2003 — 2:08pm",
      "content": "Stephen,   \n   \nIt is called Mofle. It means Muffler in Spanish.   \nThus, Mofle Loose, Mofle Expanded,   \nMofle Dropped.   \n   \nIt is inspired by the hand painted lettering on   \nthe Muffler and Hub shops in the Barrios   \naround town. There are lots of low-riders   \naround. I drive a 66' Chevel myself.   \n   \nAnd yes, The difference between regular and   \nexpanded is spacing. I should get rid of   \nregular maybe. The letters need space being   \nall caps any way. My thinking was the wide   \nfamily would make it more marketable. That,   \nalong with the shadow and extended   \ncharacter set such as fractions I   \nam hoping will make it more appealing   \ncompared to similar designs.   \n   \nThe text by the way is a complete joke.   \nTypeheads will know that right?   \n   \n-smc\n\n"
    },
    {
      "time": "11 Mar 2003 — 3:16pm",
      "content": "Man, I just noticed my the kerning in my PDF is crap!   \n   \nIt is fine (relatively) in Quark and in FOG.   \nPrints are fine too. The kerning is lost on the PDF only.   \n   \nAny thoughts on this?   \n   \n-smc\n\n"
    },
    {
      "time": "13 Mar 2003 — 1:47pm",
      "content": "Hey vato, is nice, eh.   \n   \nMira, how you do your traps, eh?   \n   \n(BTW, I don't get why this thread has had virtually no participation. What to put in a specimen is a huge question.)   \n   \nhhp\n\n"
    },
    {
      "time": "13 Mar 2003 — 1:59pm",
      "content": "This is nice. I think you've included a great selection. If anything, you could include a page of things you might see it using. I mean designs. Book Jacket, Magazine cover, Advertisement, etc.   \n   \nYou could do a version called dropped too. I really like the chopped. The dropped could have an even heavier stroke/space inbetween the shadow and the letterform.   \n   \n ![:-)](http://web.archive.org/web/20150414192556im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "13 Mar 2003 — 3:19pm",
      "content": "Gracias Amigos.   \n  \n\\>Mira, how you do your traps, eh?   \nTo be honest, I really don't know what I am doing as far as traps go. I just looked around at some faces that had them and went by that. But really, does this design need traps? Again, it is kind of a joke.   \n  \n\\>...you could include a page of things you might see it using.   \n  \nOh yea. I forgot to do that. But do you think this is too much? I recall that you (Tiffany) saying something like you have looked at more type submissions than you care to think about. Brevity might be a good thing if this is the case.   \n  \n\\>You could do a version called dropped too.   \nI've got it.   \n  \nBut I still have that awful spacing issue.   \n  \nSee \\<a href=\" [http://www.typophile.com/forums/messages/4101/7436.html?1047509741](http://web.archive.org/web/20150414192556/http:/www.typophile.com/forums/messages/4101/7436.html?1047509741)\"\\> this\\</a\\> thread for examples of my issue.   \n   \nPlease help me. The whole thing is on hold till I figure this out.   \n  \n-smc\n\n"
    },
    {
      "time": "13 Mar 2003 — 3:49pm",
      "content": "\\> does this design need traps?   \n   \nNah, not really - except if used small.   \nAnyway, don't forget flower power!   \n [http://www.themicrofoundry.com/ss\\_trapping1.html](http://web.archive.org/web/20150414192556/http:/www.themicrofoundry.com/ss_trapping1.html)   \n   \n\\> till I figure this out.   \n   \nUse InDesign2.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Mar 2003 — 4:01pm",
      "content": "_(BTW, I don't get why this thread has had   \nvirtually no participation. What to put in a specimen is a huge question.)_      \n   \nForgive me Sean for restating what I said in my email to you. After having read this thread and all those leading up to it, my impression is that the Mofle specimen is about the right size for an unknown designer. How did I draw this conclusion?   \n   \nIt seemed to me a trend from previous threads is that as a designer becomes more well known, they need to submit less. Duh. JFPorchez gave a good example of that trend:   \n   \n_The first time I submited (as described) a typeface it was longtime ago, probably Angie, my first one to FF. In fact, I just send the a basic character set (suh panels done for Morisawa, it was in 1990). But this was before I start to design with computers. They don't have done any comments, I just decided how many weights, etc.   \n   \nThen, i submited Anisette to FB circa 1995/96, there, they asked for hamburgefonstiv and some others trials if you have, such weights, etc.   \n   \nThen, they reviewed it and ask for corrections, etc.   \n   \nNow, its my own boss who decide if he accept my designs, generally he is quite cool with me and we have same feelings on letterforms._   \n      \n   \nAs a designer nobody's ever heard of (outside of the hallowed halls of typophile) it seems I'd need a relatively complete character set (uc, lc, numerals) and a sample of the face in action. How much more? My current thinking is if you've concieved additional weights, it might be enough to simply include Hamburgefontsiv in the additional weights (along with that complete set in one weight). Wouldn't that be enough to let a reviewer know a) the flavor or what you're doing and b) you do/don't have the skills to complete additional weights/italics.   \n   \nI would love to hear other people talk nitty gritty like Sean, JFP, and I have done in the course of these threads. It is all well and good for us to guess at what is required. Rich Roat, you drop in on a discussion from time to time. What are you looking for? Jonathan? Others who've had success? Less than success (me)? What did you do?   \n   \nAfter all didn't we get into designing type to get rich quick? Yeah, if my wife could hear me now. :-)   \n   \nRegards,   \nRandy\n\n"
    },
    {
      "time": "13 Mar 2003 — 4:30pm",
      "content": "Thanks for the flowers Hrant. Can I borrow a few bucks for ID? ;)   \n   \nI really don't think the issue is Quark. All other PDFs have been fine till now. It is in my FOG file. I'm 80% sure.   \n   \nRandy- What?   \n   \n-smc\n\n"
    },
    {
      "time": "14 Mar 2003 — 8:36am",
      "content": "Sean- What? What? :-)   \n   \nI was trying to continue the part of the dialogue that Hrant mentioned: what to include in a specimen for submission.\n\n"
    },
    {
      "time": "17 Mar 2003 — 12:54pm",
      "content": "Ah! Now, I get you Randy. Thanks.   \n   \nI have resolved my spacing issue. Thanks to all who helped.   \n   \nNow back to this.   \n   \nIs the general agreement that this sample is good to go? Or does it need more work?   \n   \n-smc\n\n"
    },
    {
      "time": "2 Jun 2003 — 4:17pm",
      "content": "most font foundries are more then happy to get submissions, just send them your PDF.   \n   \nJim   \n----------------------------------------------   \n [http://www.unionfonts.com](http://web.archive.org/web/20150414192556/http:/www.unionfonts.com/)\n\n"
    },
    {
      "time": "11 Mar 2003 — 1:14pm",
      "content": "Some questions:   \n   \nAm I correct in assuming that there's no difference between   \nMofle Regular and Extended except the spacing?   \n   \nIs it called Muffler or Mofle?\n\n"
    }
  ]
}
