{
  "id": "106826",
  "title": "Monotype Now Offers More Than 500 Japanese Fonts",
  "forum": "Home",
  "tags": [
    "fonts",
    "Iwata",
    "japanese",
    "japanese fonts",
    "JiyuKobo",
    "monotype",
    "Motoya",
    "News",
    "Ricoh",
    "Type Project",
    "typeface",
    "typography"
  ],
  "content": " ![](http://web.archive.org/web/20150322011643im_/http:/typophile.com/files/MT-Japanese%20fontsEdit_5501.jpg)\n\nRead more: [http://bit.ly/1gKsvu3](http://web.archive.org/web/20150322011643/http:/bit.ly/1gKsvu3 \"http://bit.ly/1gKsvu3\")  \nDownload Japanese Fonts now: [http://bit.ly/19RNg5D](http://web.archive.org/web/20150322011643/http:/bit.ly/19RNg5D \"http://bit.ly/19RNg5D\")  \nView Monotype’s OEM Font Catalog: [http://bit.ly/1apiFHF](http://web.archive.org/web/20150322011643/http:/bit.ly/1apiFHF \"http://bit.ly/1apiFHF\")\n\nMonotype has engaged with several of Japan’s top typeface foundries and distributors to enhance company’s portfolio of high-quality Japanese fonts. Typefaces from Iwata, JiyuKobo, Motoya, Ricoh and Type Project comprise the latest additions, bringing the total to more than 500 high-quality Japanese fonts that can be licensed from Monotype for a wide variety of uses.\n\nMonotype’s selection of Japanese typefaces now represents one of the world’s largest and most comprehensive portfolios of Japanese fonts. The latest additions – several of which are available for the first time outside of Japan – are licensed through Monotype’s direct sales channels and through the company’s [Fonts.com](http://web.archive.org/web/20150322011643/http:/www.fonts.com/) and [Linotype.com](http://web.archive.org/web/20150322011643/http:/www.linotype.com/) websites. In addition to licenses for Web fonts and traditional desktop fonts, licensing options are available for mobile applications, e-publications and Web-enabled services, as well as for OEMs and developers of consumer devices.\n\nMonotype’s Japanese collection comprises a wide range of styles, including classic Mincho and Gothic designs, featuring several weights, as well as brush and decorative styles. Typefaces have been designed for optimal legibility and readability for both screen and print environments, and designs are able to complement Korean, Chinese and other language fonts that Monotype offers. In addition, certain faces have been designated by Monotype’s foundry partners as “universal design” fonts, which offer simplified strokes and other refinements that help to maximize on-screen clarity.\n\nLicenses for Web and desktop fonts are available from [www.fonts.com](http://web.archive.org/web/20150322011643/http:/www.fonts.com/ \"www.fonts.com\"), [www.linotype.com](http://web.archive.org/web/20150322011643/http:/www.linotype.com/ \"www.linotype.com\") and direct channels, which also handle licenses for OEM customers. Licenses for iOS®- and Android™-based mobile apps, e-publications, and Web servers and applications are available from [www.linotype.com](http://web.archive.org/web/20150322011643/http:/www.linotype.com/ \"www.linotype.com\"). OEMs and developers may also visit Monotype’s [OEM Font Catalog](http://web.archive.org/web/20150322011643/http:/catalog.monotype.com/language/japanese) to view the Japanese fonts. In addition, Monotype type experts can be consulted to recommend Japanese typefaces that best match Latin-based designs and other language fonts, enabling a consistent appearance across multiple languages and writing systems.\n\n",
  "author": "Monotype",
  "time": "16 Oct 2013 — 11:35am",
  "uid": "214618",
  "comments": [

  ]
}
