{
  "id": "106886",
  "title": "Pairing Japanese and Latin Type",
  "forum": "Design",
  "tags": [
    "font pairing",
    "japanese",
    "Latin",
    "Design"
  ],
  "content": "I am working on an exhibition about Samurai for an American art museum and am looking for designers that I might consult in choosing an appropriate Japanese typeface.\n\nJapanese will only be used for select wall graphics and headings, and not for lengths of text. We have a curator on staff that is available to write, edit, and proof any text, but I am very much out of my league when it comes to understanding the design connotations of Japanese fonts. I am not so terrified of pairing Garamond with the Japanese version of Hobo (an obvious clash), as I am with pairing the Latin and Japanese equivalents of Bodoni and Tisa in a single headline.\n\nAt the moment, I do not know which Latin typeface I will go with, though it will likely be a conservative serif because the show's objects date from the 13th–19th centuries.\n\nThanks for any leads!\n\n",
  "author": "emkeyser",
  "time": "18 Oct 2013 — 3:07pm",
  "uid": "47506",
  "comments": [
    {
      "time": "22 Oct 2013 — 10:53am",
      "content": "The default typeface style in Japanese is 明朝 _minchō_ ‘Ming Dynasty’, the style which is the equivalent of bog standard serif in Latin typography.\n\nIf you are looking for a bit more dressy appearance, there’s the 教科書 _kyōkasho_ and 楷書 _kaisho_ styles. The _kyōkasho_ style is used in textbooks, and is a sort of “humanist” intermediate between the rigid _minchō_ and the more naturalistic styles that imitate brush writing. The _kaisho_ style is patterned after traditional woodblock printing, and it is still the platonic ideal of Japanese characters. For even more fancy stuff you can use a 行書 _gyōsho_ ‘running script’ style, which emulates the fluid but careful writing of a skilled calligrapher. The _gyōsho_ style is still readable but can be tiring for long runs of text.\n\nIf you have a short piece of text that is not really meant to be easily read but is instead more just artistic, you can go all the way to 草書 _sōsho_ ‘grass script’. This can be nearly unreadable, so that the reader has to concentrate on some characters to make out exactly what they’re supposed to be. It’s the typical style of calligraphy you see on wall hangings of poetry and proverbs and the like.\n\nYou sometimes may have use for a 篆字 _tenji_ ‘seal character’ style. This is based on the forms of characters used in 判子 _hanko_ signature seals that are used instead of handwritten signatures. Their use outside of the _hanko_ context, without red ink, often gives a very archaic feel that hearkens back to ancient China.\n\nThere is also the ゴシック _goshikku_ ‘gothic’ style that is the Japanese equivalent of sans serif. It’s probably not appropriate for a book on samurai, except maybe for back-cover blurb stuff or in contexts where the print is particularly small and hard to read otherwise.\n\nOther styles out there include handwriting, imitations of other scripts (Latin, Cyrillic, Hangul, etc.), and geometric stuff.\n\nBrowsing images using these various terms will give you a good idea about how the various styles appear and are used. Even if you hire a designer, the exposure to Japanese typography will be useful in reviewing the designer’s work.\n\nOne thing that annoys everyone is Japanese text set way too small or light in the midst of Latin text. This is usually done in an effort to make the Japanese text fit existing Latin layout, because Japanese characters have much higher height and depth. Accept that you have to have more leading for the Latin text, don’t punish the Japanese text by squashing it into unreadable oblivion.\n\n"
    },
    {
      "time": "25 Oct 2013 — 9:35am",
      "content": "James, thank you for such a detailed, lengthy reply. That is exactly the type of information I've needed.\n\n"
    },
    {
      "time": "25 Oct 2013 — 10:51am",
      "content": "James, thank you for such a detailed, lengthy reply. That is exactly the type of information I've needed.\n\n"
    },
    {
      "time": "25 Oct 2013 — 11:56am",
      "content": "James, thank you for such a detailed, lengthy reply. (I have been trying to post this for two days now, but the Typophile site keeps crashing on me.) That is exactly the type of information I've needed.\n\n"
    }
  ]
}
