{
  "id": "10683",
  "title": "Boozefighter",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "go ahead and tear me a new one. Boozefighter was inspired by a piece of graffiti i saw, and i'll probably never finish it.   \n ![boozefighter](http://web.archive.org/web/20150417062007im_/http:/www.typophile.com/forums/messages/29/738.gif)\n\n",
  "author": "foss",
  "time": "1 Feb 2002 — 1:16pm",
  "uid": "653",
  "comments": [
    {
      "time": "7 Feb 2002 — 4:50pm",
      "content": "Thanks for that feedback Jonathan. I have a pretty unconventional understanding of typography and I'm not totally clear on \"Wild Style\". the only Wild Style i'm familiar with is the 80's movie about hiphop/graffiti, and a graffiti style where the letters are almost unreadable with complex \"ligatures\" but I have a feeling you're talking about something else, right?\n\n"
    },
    {
      "time": "9 Feb 2002 — 12:24am",
      "content": "Phil - Boozefighter is a piece of work. To paraphrase Joe, Weee, it's Buffy the Cowgirl. It says woodtype to me, but it is certainly not something I've seen before. So that's a good thing.   \n   \nThe few things I would examine...   \n   \nThe Z and the T have razorsharp terminals. Perhaps they should be neutered more, like the J.   \n   \nThe middle stem on the 5 might do better firm than droopy.   \n   \nThe lower half of the 7 calls for something else than the curve it is given.   \n   \nThe foot of the Y should extend across, as JH mentioned.   \n   \nMaybe the M, N and W could stand a width change, giving them another stem widthwise.   \n   \nThe stem crossing on the X needs a wee bit of work.   \n   \nOverall, the craft is sound on this one. Nice debut! Looking forward to more.   \n   \nbj\n\n"
    },
    {
      "time": "11 Feb 2002 — 10:50am",
      "content": "Has anyone had a go at doing a graffiti font? Im an ex writer whos tried and failed many times at producing a graffiti style font. Script fonts arent really my thing and I dont seem to be able to formalise the strokes enough to produce a workable typeface. Heres my latest sketches for your comments:   \n   \n [http://www.selfbuildtype.com/metro.gif](http://web.archive.org/web/20150417062007/http:/www.selfbuildtype.com/metro.gif)   \n   \nIm by no means happy with this : )\n\n"
    },
    {
      "time": "11 Feb 2002 — 11:37am",
      "content": "Craig,I actually like the Metro type you started. There is obviously a lot of repetative elements which makes it look computer generated, so I would suggest a lot of tweaks to each letter to give it a handmade feel, but in all it has some direction I like.\n\n"
    },
    {
      "time": "11 Feb 2002 — 11:47am",
      "content": "Hey Craig. Good to see you here.   \n   \nGary Munch did a graffiti font of sorts:   \n [http://www.munchfonts.com/UrbanScrawl/index.html](http://web.archive.org/web/20150417062007/http:/www.munchfonts.com/UrbanScrawl/index.html)   \n   \nStephen\n\n"
    },
    {
      "time": "11 Feb 2002 — 12:15pm",
      "content": "I like Graffiti Treat from larabie...   \n [http://www.larabiefonts.com/fonts/g2.html](http://web.archive.org/web/20150417062007/http:/www.larabiefonts.com/fonts/g2.html)\n\n"
    },
    {
      "time": "11 Feb 2002 — 3:01pm",
      "content": "Thanks v much for the comments! Ill keep working at it! I thought Id post this as well as I think its a good example of a graffiti alphabet (although too detailed for a typeface)   \n   \n [http://www.mrwiggleshiphop.net/Resource-1517/ALPHAstylePAGE.html](http://web.archive.org/web/20150417062007/http:/www.mrwiggleshiphop.net/Resource-1517/ALPHAstylePAGE.html)   \n   \nIve also been sent this link:   \n   \nhttp://www.dafont.com/theme.php?cat=506&nb\\_ppp=&a=&m=&texte=   \n   \nOut of these fonts my faves are Degrassi and Def Artist...\n\n"
    },
    {
      "time": "11 Feb 2002 — 3:17pm",
      "content": "It the vein of Degrassi:   \n [http://www.fontbureau.com/specimens/graffiti.html](http://web.archive.org/web/20150417062007/http:/www.fontbureau.com/specimens/graffiti.html)\n\n"
    },
    {
      "time": "11 Feb 2002 — 3:17pm",
      "content": "In the vein of Degrassi:   \n [http://www.fontbureau.com/specimens/graffiti.html](http://web.archive.org/web/20150417062007/http:/www.fontbureau.com/specimens/graffiti.html)\n\n"
    },
    {
      "time": "11 Feb 2002 — 3:51pm",
      "content": "i think \"graffiti\" by carbaga is an excellent typeface, but it doesnt really look like any graffiti i've seen. Degrassi rocks, and Craig- I'd love to see any progress you're making on yours.\n\n"
    },
    {
      "time": "12 Feb 2002 — 10:34am",
      "content": "Craig! keep up on the graffiti Fonts, some of the one mentioned aren't really graffiti like you would experience   \ntoday. i us to write when i was a kid, but have never tried to make or design a graffiti fon, and i think you have   \nit cornered both with \"Metro and Alpha\"! if ya need any help let me know. the best way if your having problems would to be draw then out, scan them and trace them in Illustrator. then copy and paste into the font   \nprogram your using. but KEEP IT UP! we need real graffiti fonts from real graffiti artists.   \n   \nPhil, i like! keep it up also. nice to see fonts that aren't the norm. hope to see more soon!\n\n"
    },
    {
      "time": "12 Feb 2002 — 5:11pm",
      "content": "I thought id post a few more sketches:   \n   \n [http://www.selfbuildtype.com/gallery/throw.gif](http://web.archive.org/web/20150417062007/http:/www.selfbuildtype.com/gallery/throw.gif)   \n [http://www.selfbuildtype.com/gallery/tag.gif](http://web.archive.org/web/20150417062007/http:/www.selfbuildtype.com/gallery/tag.gif)   \n   \nThe tag style font is the one I want to crack. The visual for this is done in fireworks even though it looks like marker. Each character is a symbol making tweaking characters in context a lot easier. The plan is to create the basic letterforms and add additional swashes that can bolted on. Ill keep working at it!\n\n"
    },
    {
      "time": "13 Feb 2002 — 11:09am",
      "content": "And for anybody who wants to follow this topic ive started a thread in Script \\> Graffiti Typefaces.\n\n"
    },
    {
      "time": "13 Feb 2002 — 11:25am",
      "content": "semi off-topic --- Wasn't there, isn't there still, a graffiti style called 'Sparking'?\n\n"
    },
    {
      "time": "13 Feb 2002 — 11:26am",
      "content": "Oh and also, this would be great for templates. In my warped mind. For blanketing the cities with big bold statements.\n\n"
    },
    {
      "time": "13 Feb 2002 — 11:45am",
      "content": "Not that Im aware of but writers tend to name their styles themselves. I know a guy whos doing what he calls Stealth styles (as in the Stealth bomber / fighter etc): angular, flat, high tech pieces.\n\n"
    }
  ]
}
