{
  "id": "10694",
  "title": "Groobit",
  "forum": "Bitmap Display / Script",
  "tags": [
    "Bitmap Display / Script"
  ],
  "content": "A nice funky one, any comments?   \n   \n ![groobit.gif](http://web.archive.org/web/20150414212537im_/http:/www.typophile.com/forums/messages/29/743.gif)\n\n",
  "author": "Miguel Hernandez",
  "time": "3 Feb 2002 — 11:20am",
  "uid": "1109",
  "comments": [
    {
      "time": "3 Feb 2002 — 1:44pm",
      "content": "Miguel,   \n   \nI was wondering when someone would produce   \nthe first pixel multilinear bauhauser. I   \nsalute you for it. But now that I see the   \nreadability problems, I'd recommend a   \nheight (size) increase of a few pixels.   \n   \nStephen\n\n"
    },
    {
      "time": "3 Feb 2002 — 7:47pm",
      "content": "Scoles,   \n   \nThe readability problems are in a expecific fonts, or in the lowercases?. and a question..   \nwhat do you think about the little font that i make for the credits?   \n   \nMiguel\n\n"
    },
    {
      "time": "3 Feb 2002 — 10:59pm",
      "content": "It's generally difficult to read.   \n   \nPerhaps the space between letters   \nand the inline being the same pixel   \nwidth is contributing to the problem.   \nBut greater letter spacing won't fix it.   \n   \nI'm just thinking this may have to be   \na 15 pixel-high font using two pixels   \nfor the strokes on each side of the   \ninline. But what do I know? I'm not   \nthe one who is making spiffy bitmaps   \nout of complex display fonts.   \n   \nKeep at it.   \n   \nStephen\n\n"
    },
    {
      "time": "8 Feb 2002 — 11:16pm",
      "content": "Stephen & Joe:   \n   \nYou`re right guys, and thank you.   \nJust see this:   \n   \n ![groobitpro.gif](http://web.archive.org/web/20150414212537im_/http:/www.typophile.com/forums/messages/29/777.gif)\n\n"
    },
    {
      "time": "5 Feb 2002 — 12:52pm",
      "content": "This is visually interesting but very difficult to   \nread.   \n   \nIf the spirit of Bauhaus types were/are   \nabout achieving ultimate simplicity,   \nthis seems to have totally lost that spirit.   \n   \nCan you say the same of a bitmap script?   \n(Namely that bitmaps are the furthest thing   \nfrom actual handwriting.) Probably. But that   \ndoesn't mean you shouldn't pursue it...   \n   \nNow that I'm done waxing on... Stephen's   \nprobably on to something with his suggestion   \nof an increased px height.\n\n"
    },
    {
      "time": "8 Feb 2002 — 11:51pm",
      "content": "Miguel:   \n   \nFor what you were attempting, it works very well. Still, I have to agree that it isn't very readable.   \n   \nThe biggest part of the problem isn't in the design. I think the design is very good, again, for what you were attempting to create, which seems to be a display face that can be used at bitmapped text sizes.   \n   \nThe problem instead lies in the fact that inline Bauhaus fonts like this were never meant to be used at sizes this small. It's the inline form relative to its size that's the problem -- not your interpretation of it. To that end, I'm not sure that thickening the black lines will be of significant help. I suspect that you'd just end up with an even heavier font that looks cool but is difficult to read at small sizes. ![:)](http://web.archive.org/web/20150414212537im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI think perhaps the best solution would be to enlarge the font overall to a size where it has acceptible readability, and treat it as a (very cool) display face rather than a text face.   \n   \nDavid\n\n"
    },
    {
      "time": "14 Feb 2002 — 7:03am",
      "content": "What if you increase 1 or 2 px between caracters ?\n\n"
    }
  ]
}
