{
  "id": "106937",
  "title": "LA ligatures",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm looking for some advice on typefaces. As I'm designing a logo for an education-based client, I'm looking for a modern typeface with an historical reference, possibly to Goudy Old Style or similar. On top of that, it would be a huge added bonus if the typeface had an LA ligature or an alternate for a capital K. Any suggestions?\n\n",
  "author": "AlliL",
  "time": "21 Oct 2013 — 1:51pm",
  "uid": "215441",
  "comments": [
    {
      "time": "21 Oct 2013 — 2:24pm",
      "content": "Hmmm.\n\nJust so you know, there is some recognition of Goudy Old Style in the world of academe..namely, the Alumni Magazine. What happened to Betty Sue, class reunions, how the cheerleaders on the football team dress this year, etc.\n\nYou sure that's what you're aiming at?\n\n"
    },
    {
      "time": "21 Oct 2013 — 10:56pm",
      "content": "If a font has Cyrillic, its “K” is generally different to that of the Latin, and may be used as an alternate.\n\n"
    },
    {
      "time": "22 Oct 2013 — 7:36am",
      "content": "Charles, I'm working on several design directions for this client. The one which I have posed here is specifically to highlight the client's steep academic tradition. I'm not sure I understand your questioning. Can you elaborate?\n\nNick, thank you. I'll keep that in mind as I search.\n\n"
    },
    {
      "time": "22 Oct 2013 — 3:27pm",
      "content": "I thought I was quite clear, if, perhaps, a little snotty. The academic side of the university -- the English dept, the History dept, etc., tends to look on Goudy Oldstyle with about as much favor as they would with using Wedding Text to set the <cite>Canterbury Tales</cite>.\n\nThe marketing side of the university, which sells athletics and remembrance of good times rather than anything academic, usually has a different viewpoint.\n\nIt would depend on which side of the educational institution your client falls into.\n\n"
    },
    {
      "time": "22 Oct 2013 — 5:02pm",
      "content": "Clearly no one told that to my college.\n\n ![](http://web.archive.org/web/20150417145732im_/http:/typophile.com/files/slc_logo_3412.png)\n\n"
    },
    {
      "time": "22 Oct 2013 — 6:04pm",
      "content": "Your point being that signage and letterheads don't come out of the academic side of the university? OK, but I spent too many years on both sides of that one.\n\nAs the panthers would say, Esse quam videri, baby. Just be sure what the client wants.\n\n"
    },
    {
      "time": "1 Nov 2013 — 6:37am",
      "content": "The calligraphic nature of Goudy plays well with my intentions. However, it is too old-fashioned and overused. You'll see when I posed my question that I'm on the hunt for a more modern typeface with similar qualities.\n\nYour comments were indeed snotty. Not to mention completely unhelpful.\n\n"
    },
    {
      "time": "2 Nov 2013 — 10:37am",
      "content": "Well, maybe I can try to be slightly more directly helpful. When you say \"a historical reference,\" what period historically are you referencing?\n\nGoudy's faces, though they are based on historical models, are very much his own style and clearly identifiable as such, which place them as early twentieth-century American. (Which, actually, means that the historical implications are exactly right for Sarah Lawrence, though I somewhat doubt that the designers were thinking along those lines.)\n\nAnyway, let us know more specifically what you're trying to reference and we can help you better.\n\n"
    }
  ]
}
