{
  "id": "106967",
  "title": "Kind of rounded edge typeface",
  "forum": "Home",
  "tags": [
    "Unknown"
  ],
  "content": "Hello,  \nI'm looking for the name of this kind of rounded edge typeface that I found on a pdf.  \nAny help would be hugely apreciated. Thanks\n\n ![](http://web.archive.org/web/20150419035901im_/http:/typophile.com/files/ID_3981.png)\n\nFont:&nbsp;\n\n Sheffield \n\nSolved By:&nbsp;\n\n [R.](http://web.archive.org/web/20150419035901/http:/typophile.com/user/57325 \"View user profile.\")\n\n",
  "author": "Ulyses",
  "time": "23 Oct 2013 — 4:04am",
  "uid": "215491",
  "comments": [
    {
      "time": "23 Oct 2013 — 5:05am",
      "content": "May be [Brauer Neue LL](http://web.archive.org/web/20150419035901/http:/lineto.com/The+Fonts/Font+Categories/Text+Fonts/Brauer+Neue).\n\n"
    },
    {
      "time": "23 Oct 2013 — 4:50am",
      "content": "I think the edges are a little bit less rounded and the \"r\" is different. This is an example picture of the Brauer Neue typeface\n\n ![](http://web.archive.org/web/20150419035901im_/http:/typophile.com/files/Brauer_6462.gif)\n\n"
    },
    {
      "time": "23 Oct 2013 — 5:05am",
      "content": "Need to take a coffee (or two...), that's definitely not Brauer Neue... What's your simple origin?\n\n"
    },
    {
      "time": "23 Oct 2013 — 5:35am",
      "content": "Previous thread on Sans with rounded corners:  \n [http://www.typophile.com/node/32249](http://web.archive.org/web/20150419035901/http:/www.typophile.com/node/32249 \"http://www.typophile.com/node/32249\")  \nDon\n\n"
    },
    {
      "time": "23 Oct 2013 — 5:55am",
      "content": "I took the sample from the Brauer Neue link. They let you try the typeface.  \nThe corners are just sightly rounded. Maybe that's why it's a tricky one to identify\n\n"
    },
    {
      "time": "23 Oct 2013 — 6:09am",
      "content": "Damn... Looks like 2 coffees were not enough... Sorry for the misunderstanding. My question was referring to your original sample, not Brauer's. Where does this \"Writing Workshop\" lettering come from? Website? PDF?\n\n"
    },
    {
      "time": "23 Oct 2013 — 7:46am",
      "content": "Oh, I thought you meant the second sample because I've already mentioned where the first was from. The original sample comes from a pdf. Will another sample make it easier to identify or do you think it was a custom typeface? Thanks\n\n"
    },
    {
      "time": "23 Oct 2013 — 7:54am",
      "content": "Have you tried pressing Ctrl+D in Adobe Reader/Acrobat? The document properties windows will open. You could click on the ‘Fonts’ tab and see what it says or upload the PDF here if you can’t make sense of what you find.\n\n"
    },
    {
      "time": "23 Oct 2013 — 8:11am",
      "content": "I'm confused... I hadn't even properly read your first post... Seen only now you mentioned a PDF... More coffee would be definitely helpless, I really need to rest :D  \nSo, if you have the original PDF, the answer might be as quick as checking what fonts are used on the document: Open Document with Adobe Reader \\> File \\> Properties \\> Fonts tab  \nIf, please post the answer, I'm also interested in knowing it. If not, may be a bespoke typeface so the origin of this PDF might be helpful (at least more than 2 more coffee's).\n\nEDIT: What R. said\n\n"
    },
    {
      "time": "23 Oct 2013 — 9:21am",
      "content": "I'm so sorry. I didn't know about the Ctrl+D thing. I could have solved it without bothering you. It says that the typeface is called Sheffield and was created for Sheffield by Fontsmith.  \nHere is the explanation:  \n [http://www.fontsmith.com/about/news/sheffield.cfm](http://web.archive.org/web/20150419035901/http:/www.fontsmith.com/about/news/sheffield.cfm \"http://www.fontsmith.com/about/news/sheffield.cfm\")  \nThank you very much guys!\n\nEDIT: I can only name one user in the \"solved by\", but the credits go for R. and Ryuk.\n\n"
    },
    {
      "time": "23 Oct 2013 — 9:20am",
      "content": "Yes, you should try the font check on the PDF recommended by Ryuk.  \nIf you are lucky you will get a list of fonts, or font subsets used in the PDF.  \nIf you get a blank or just a list of common fonts that you know do not match your image, this means that it is not used as a font in the PDF. The PDF might use vector outlines, which you can examine in detail if you use a program like Adobe Illustrator, or images such as jpegs. You can determine if your PDF uses images by increasing the scale. If the quality becomes fuzzy, it uses images. If you can scale without loss of quality, the PDF uses fonts or vector outlines.  \nIf this is too technical we can try another approach:  \n......Is the PDF on the web? and  \n......Do you have a URL that you can post?  \nDon\n\n"
    },
    {
      "time": "23 Oct 2013 — 10:15am",
      "content": "Thanks for sharing the information with us, Ulyses!\n\n"
    },
    {
      "time": "23 Oct 2013 — 2:40pm",
      "content": "Thanks for the information, Ulyses! Now, I know why I couldn't recognize it! Here are 3 more alternatives for this exclusive typeface (not commercially available): [Geogrotesque EMT](http://web.archive.org/web/20150419035901/http:/www.myfonts.com/fonts/emtype/geogrotesque) (Stencil version [Stencil](http://web.archive.org/web/20150419035901/http:/www.myfonts.com/fonts/emtype/geogrotesque-stencil)), [Center Signal](http://web.archive.org/web/20150419035901/http:/www.myfonts.com/fonts/signal/center) and [Aveny T Playtype](http://web.archive.org/web/20150419035901/http:/www.playtype.com/font/aveny-t)\n\n"
    },
    {
      "time": "23 Oct 2013 — 12:00pm",
      "content": "Thank you for helping me R., Ryuk and donshotytype! And thanks for the alternatives also Ryuk!\n\n"
    },
    {
      "time": "23 Oct 2013 — 2:04pm",
      "content": "Just to round out this interesting discussion, here is the link to Sheffield where one can observe the font in use:  \n [http://www.welcometosheffield.co.uk/](http://web.archive.org/web/20150419035901/http:/www.welcometosheffield.co.uk/ \"http://www.welcometosheffield.co.uk/\")  \nDon\n\n"
    },
    {
      "time": "23 Oct 2013 — 2:37pm",
      "content": "Hi Ryuk, Geogrotesque EMT is spot on as a substitute. But check your link for Aveny T Playtype. It leads to a wiki. Should be [https://www.playtype.com/index.php?q=font/aveny-t](http://web.archive.org/web/20150419035901/https:/www.playtype.com/index.php?q=font/aveny-t \"https://www.playtype.com/index.php?q=font/aveny-t\")  \nDon\n\n"
    },
    {
      "time": "23 Oct 2013 — 2:54pm",
      "content": "Thanks Don for checking. Link corrected (forum doesn't handle https links correctly).\n\n"
    },
    {
      "time": "23 Oct 2013 — 2:48pm",
      "content": "Rounded corners almost identical to Sheffield, but wider letterform -- Boing by Playtype:  \n [https://www.playtype.com/font/boing](http://web.archive.org/web/20150419035901/https:/www.playtype.com/font/boing \"https://www.playtype.com/font/boing\")  \ndon\n\n"
    }
  ]
}
