{
  "id": "10690",
  "title": "Microsoft Visual Truetype",
  "forum": "Build",
  "tags": [

  ],
  "content": "Does anybody here use this software to hint fonts ?   \n   \nhow can i get this program ?\n\n",
  "author": "daniel_l",
  "time": "Tue, 2003-03-11 10:12",
  "uid": "1606",
  "comments": [
    {
      "time": " Tue, 2003-03-11 10:31",
      "content": "I once did a hinting project for a large furniture company, and I used VTT. It was a major pain, but at least it's free; you just need to give MS a good reason they should give it to you.   \n   \nNow that I have FontLab4.5, I assume I won't need it again.   \n   \nhhp\n\n"
    },
    {
      "time": " Tue, 2003-03-11 10:56",
      "content": "I've used both VTT and FontLab for hinting. Leaving aside the fact that one is free and the other is not, here are the main differences:   \n   \nFontLab hinting is relatively easy to learn, the interface and visual tools are fairly intuitive, and the manual is pretty good on this topic. FontLab's tools provide access to the most common subset of things that one would want to do with TT hinting, so it is my tool of choice for most jobs.   \n   \nVTT was written by a text rendering engineer and has a very unfriendly user interface and progressively messy visual controls (the word 'spaghetti' is frequently used to describe the links in VTT). Although there is some documentation available, VTT presumes that you know a certain amount about TT hinting before you start (so even if you intend to use VTT, it is a good idea to download the FontLab manual PDF and read the hinting section). Despite these drawbacks, however, VTT is much more powerful than FontLab since it exposes the entirety of the TT hinting model. As an example of the difference between VTT and FontLab, the latter only permits deltas of up to one pixel, while VTT can be set to apply deltas of up to eight pixels. The number of times in your life when you will want to apply a delta of more than one pixel is probably pretty small, but it's nice to have this ability in VTT in case you ever need it. VTT can be used in three different ways: visual tools, TypeMan talk (a 'high level' hinting language), or directly on the TT code itself (recommended only for real experts). Again, you are unlikely to need this extra power.\n\n"
    },
    {
      "time": " Tue, 2003-03-11 11:38",
      "content": "In answer to your other question -- 'How can I get this program? -- see the [VTT](http://web.archive.org/web/20050526123310/http:/www.microsoft.com/typography/tools/vtt.htm) section of the MS Typography website.\n\n"
    },
    {
      "time": " Tue, 2003-03-11 11:53",
      "content": "hmm..   \nso i just need to fax microsoft some of my works now.   \nthank you!   \n   \nBTW : do you guys know hebrew type ?   \n   \n ![my fonts.](http://web.archive.org/web/20050526123310im_/http:/www.typophile.com/forums/messages/4101/7411.jpg)\n\n"
    },
    {
      "time": " Tue, 2003-03-11 14:16",
      "content": "Me not really; John yes.   \n   \nBut I still think some of those are very nice!   \nBTW, can you elaborate on the \"cursive\" (?) model third from the top? I've never seen it before - but it seems to have a certain potential in terms of typographic reform, or at least optimization.   \n   \nhhp\n\n"
    }
  ]
}
