{
  "id": "10695",
  "title": "Mineral hall",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "So, here it is. My first type design ever. Or the prototype, at least. I'm aiming for a fluid look, and I need help figuring out where to draw the line between professional and gimmicky.   \n   \n   \n ![mineral hall](http://web.archive.org/web/20150414162541im_/http:/www.typophile.com/forums/messages/29/7422.gif)  \n   \nThe first letters were a\" and \"b,\" so most of the other letters stemmed from those forms. I'm not sure about the \"f,\" \"l,\" and \"t.\" I like them straight, but would that detach them from the rest? I have a similar problem with the \"c,\" \"o,\" and \"u.\"   \n   \nAs for the first \"e\" and first \"s,\" does the top-heaviness of them bother anyone? I like it, but others have commented on them.   \n   \nOther letters I could really use input on are the \"k,\" \"m,\" \"w,\" and pretty much all the capitals. Or if you have any other suggestions...   \n   \nThanks\n\n",
  "author": "flik23",
  "time": "11 Mar 2003 — 1:05pm",
  "uid": "1602",
  "comments": [
    {
      "time": "13 Mar 2003 — 12:33pm",
      "content": "Okay...if I post some sentences, will that get me some input? These were done with the original letters, but I'm going to start refining them.   \n   \n ![mineral hall post 2](http://web.archive.org/web/20150414162541im_/http:/www.typophile.com/forums/messages/29/7564.gif)   \n   \nI think the hooks on the \"l\" and \"t\" just make the face too scripty. I'll probably keep the top-heavy \"e,\" as well, but I'll work on the \"s.\"   \n   \nAs for the \"i\" and \"j\": should I leave out the dots? I just haven't bothered putting them in yet.   \n   \nThanks\n\n"
    },
    {
      "time": "13 Mar 2003 — 1:29pm",
      "content": "allright bloom, i'll work backwards. i actually noticed the missing dots, but i'm not sure if i noticed it in a bad way or not. in terms of readability, anything you notice detracts from readability, so that's your call. you might try some of the \"t\" variants within your sentences for comparison. i think both the t and l need some degree of hook, wherever it may be. otherwise they kind of get lost. the top-heavy e looks fine. it adds a tiny bit of awkwardness that is charming, and it compliments the a with the larger bowl nicely. and you're smart in working on the s. i'd say normalize that one a bit. the smaller tail on the y is nice. i think the larger w and v are better, with the point hanging below the baseline slightly. the middle m is the best. the last one is too pointy and busy. the first k has a simple grace that feel more correct with your set. try setting your Q's on the baseline with the tails hanging below. okay i'm tired.\n\n"
    },
    {
      "time": "18 Apr 2003 — 8:39pm",
      "content": "Okay, I've been working on the face, and it has evolved, I think, quite a bit. But it could still stand to evolve some more.   \n   \nI've increased the x-height and changed a lot of letters. I've also created an entire character set, which is much less finalized. I'll probably post it later, a long with some text blocks at various sizes. But for now, I'd really like any feedback I can get. Maybe one of those \"NEW!\" icons will draw some attention to this thread...   \n   \nThanks   \n   \n ![mineral hall crit 2](http://web.archive.org/web/20150414162541im_/http:/www.typophile.com/forums/messages/29/8951.gif) ooh...look at the fancy curves...\n\n"
    },
    {
      "time": "19 Apr 2003 — 4:29pm",
      "content": "The simplicity is nice, but some of the characters are too clever. The M, I think, is suffering the most. The W seems a bit narrow. I think the D, the point on it, should be at the bottom and not the top. The E at first glance could be mistaken for a lowercase t. I really like the curve in the H and the N, almost Art Nouveau. Maybe, as this is a display face, you could set it in some words, or company names. Somehow show it in use? I also think it would be nice to have a little more weight. Or at least offer that. I do like how it looks in the title, mineral hall, that weight feels nice. However the other letters look anemic.   \n   \n ![:-)](http://web.archive.org/web/20150414162541im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "19 Apr 2003 — 6:48pm",
      "content": "Thank you for the input. I was beginning to think I'd never get any.   \n   \nYou're right about the cleverness, and that's been my trouble from the start. The lowercase letters are the only characters I'm almost 100% satisfied with. I think I've removed most of the cleverness from them (just look at my first post). I just need to spend some more time and thought on the other forms. I'm stumped on the M, and the W is a remnant from my first version. I'll try the idea with the D. I'm glad to hear that these forms resemble Art Nouveau--the typeface was actually inspired by some doors in that style, on my college's admissions building,   \n   \nAs for the weight: Right now, I'm just trying to figure out the skeletons of the characters. I want to get the shapes right first. I have big plans for several (I mean A LOT of) different weights and styles. I'm just worried I'll never have the chance to work on them...   \n   \nThanks\n\n"
    }
  ]
}
