{
  "id": "106978",
  "title": "Doves Type from Seventh Seal - anyone see this yet?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "All,\n\nI've been following the development of this:  \n [http://typespec.co.uk/doves-type/](http://web.archive.org/web/20150305040344/http:/typespec.co.uk/doves-type/ \"http://typespec.co.uk/doves-type/\")\n\nAnybody noticed yet? What do you think of this revival?\n\nYours,  \nAmado\n\n",
  "author": "Amado",
  "time": "23 Oct 2013 — 9:49am",
  "uid": "99380",
  "comments": [
    {
      "time": "23 Oct 2013 — 3:45pm",
      "content": "When I saw the original typeface in books on the history of printing, I thought it was a very beautiful one in need of a revival; looking at the link you provided, the revived digital typeface appears to be quite beautiful.\n\nOf course, though, it's somewhat expensive - not really that bad in price for the one-user print license, but the fact that embedding even in PDFs is treated like embedding in applications makes me suspect that _that_ will be expensive.\n\nAlso, that they trademarked the name of a typeface by which it was known originally (and before they existed) is distressing. A typeface in the public domain can be revived by anyone.\n\n"
    },
    {
      "time": "23 Oct 2013 — 8:17pm",
      "content": "Well, they \\*claim\\* a trademark. Whether it is registered is another matter.\n\n\\> A typeface in the public domain can be revived by anyone.\n\nThe revival of the design is a separate question from trademark.\n\n"
    },
    {
      "time": "26 Oct 2013 — 11:56am",
      "content": "@Thomas Phinney:  \n<cite>The revival of the design is a separate question from trademark.</cite>\n\nYes. But it should be clear what I find objectionable: making the original name of the face a trademark, to place anyone else who would revive the typeface at a disadvantage.\n\nNot that I can't see why it's tempting; after all, they've done the work of cleaning up the design, and locating it as worthy of revival.\n\n"
    },
    {
      "time": "31 Oct 2013 — 1:56pm",
      "content": "The Doves Type had already been revived by somebody (whose name eludes me at the moment) from Sweden, I think. See [http://www.sinnebild.se/font/large/doves.html](http://web.archive.org/web/20150305040344/http:/www.sinnebild.se/font/large/doves.html).  \nThis digital revival is used by the Emery Walker Trust for their information leaflets, etc. – I remember visiting 7, Hammersmith Terrace in London two years ago and going away with one of these.\n\n"
    },
    {
      "time": "5 Nov 2013 — 4:10am",
      "content": "Quadibloc, thanks for the kind words about the aesthetic beauty of Doves, I'd like to put your mind at rest about PDF embedding because this is permitted, unless the PDF is being sold commercially. Similarly if you're planning to embed the font into an eBook, app, server application or any other digital product you'll need the appropriate licence.\n\n"
    },
    {
      "time": "8 Nov 2013 — 3:47pm",
      "content": "OK everyone, as the person responsible, let me clear a couple of things up.\n\n@ quadibloc/Thomas Phinney 'The revival of the design is a separate question from trademark.'/'Yes. But it should be clear what I find objectionable: making the original name of the face a trademark, to place anyone else who would revive the typeface at a disadvantage.\n\nNot that I can't see why it's tempting; after all, they've done the work of cleaning up the design, and locating it as worthy of revival.'\n\nI also appreciate quadibloc's kind words, but I will explain my decision to trademark the name.\n\nThe revival is a separate issue, but also the nub of the problem. I am not trying to disadvantage anyone – go ahead, give a revival a try! (BTW not a '\\*claim\\*' – the trademark is registered with IPO.gov).\n\nIt wasn't a case of 'cleaning up the design' as I had also initially thought. I soon realized that to produce a good, serious, useable typeface, I had to pull it apart and rebuild it, in order to discover how the relationships in geometry, strokes, alignments & spacing worked. Not easy when all you've got to go on is impressions of a 16pt typeface, produced using linseed based ink on rag paper.\n\nBut what I personally object to, having put all that work in – 3 solid years – is someone coming along, a big foundry for instance, and using my drawings as a basis for another revival. And I can't stop anyone doing that, as you know.\n\nAll I can do is trademark the name to protect my work in the commercial sphere, thus differentiating it as the first commercial digital revival (William Morris's Golden Type name is registered with ITC, but it hasn't stopped others doing their own versions).\n\nAlso to clarify: I have never claimed this is the first digital revival in any of the press I've done – those facts seem to get lost in sub edits and transcription – I'm quite blatant about this on my blog [http://7thsealblog.wordpress.com/2011/09/10/reviving-the-doves-type-%E2%...](http://web.archive.org/web/20150305040344/http:/7thsealblog.wordpress.com/2011/09/10/reviving-the-doves-type-%E2%80%93-part-i-2/ \"http://7thsealblog.wordpress.com/2011/09/10/reviving-the-doves-type-%E2%80%93-part-i-2/\") It is the 1st commercially available revival though.\n\n@ quadibloc 'Also, that they trademarked the name of a typeface by which it was known originally (and before they existed) is distressing'\n\nIt is now known as the Doves type, Doves or the Doves font, but it had no particular or agreed name during its existence as a metal fount. This period lasted from around 1900 to 1916, when it was variously known to the owners & employees of the Doves Press as ‘the type’, ‘the Type’ and, according Doves Press co-founder TJ Cobden Sanderson’s diary, ‘the Doves Press Fount of Type’ [T.J. Cobden-Sanderson, 21 March 1913. Journals, II, 214.]\n\nEmery Walker referred to it in his court hearing (Walker vs Annie Cobden-Sanderson) in 1923 at Lincoln's Inn as 'Doves' ('... my contention is that supposing by a miracle the type could have been recast exactly similar to the original Doves, the reputation which had accrued to the latter could not be transferred to any copy. Mr Prince, who cut the type and many other typefaces for private presses since the days of the Kelmscott Press, is now dead.').\n\nAs late as 1924 In a letter to Chatto & Windus dated 4 February [Marrianne Tidcombe, The Doves Press (2002) pp.84], Coben-Sanderson’s son Richard refers to it as the ‘D.P. Type’.\n\nIn fact, the most common contemporaneous description/name for it appears to be, from TJCS's journals, the 'Doves Press Fount of Type'.\n\nFinally, Marianne Tidcombe, in her aforementioned book, The Doves Press, refers to it as ‘the type’ & ‘the Doves type’. I would also argue that the latter is in description, a shorthand generic term by which it has retrospectively come to be known (as I have said it is also called 'Doves' by more than a few people.) It is a generic term and if someone wants to use it, I can't really stop them. As long it's not my drawings copied, pasted & repackaged or a large foundry piggybacking on my work, I probably wouldn't try either.\n\n@celeste The one used by the Walker Trust, Tobjörn Olsson's revival, Doves, is mentioned in my blog as I have said. It's never been commercially available. I stumbled upon it early on during my project & was considering not carrying on with mine, until I became more familiar with it. The below image from Olsson's PDF is a comparison with mine – it's very much of its time, around 1995 I believe. It appears to be auto-traced with some common features, the serifs mainly.\n\nThanks\n\nBest\n\nRobert Green\n\n"
    },
    {
      "time": "6 Nov 2013 — 11:24pm",
      "content": " ![](http://web.archive.org/web/20150305040344im_/http:/typophile.com/files/OlssonGreenComparison_6341.jpg)\n\n"
    },
    {
      "time": "13 Nov 2013 — 3:21pm",
      "content": "If the trademark is registered, then you should use ® instead of ™ at [http://typespec.co.uk/doves-type/](http://web.archive.org/web/20150305040344/http:/typespec.co.uk/doves-type/ \"http://typespec.co.uk/doves-type/\") —that is why I said you “claim” a trademark.\n\n"
    },
    {
      "time": "22 Nov 2013 — 3:21pm",
      "content": " ![](http://web.archive.org/web/20150305040344im_/http:/typophile.com/files/BownessCongratualtions_6181.jpg)\n  \nDon \n"
    }
  ]
}
