{
  "id": "106934",
  "title": "Introducing Baghadeer, an upright script font",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I wanted to show some images for my new release Baghadeer. The description was inadvertently left out on the page, but should be added soon. It should read:  \nBaghadeer, from the hand of Stephen Rapp, is an upright connecting script brimming with personality. With its exuberant capitals, dashing crossover strokes, and rhythmic pulse; it retains the active spirit most associated with slanted scripts, but with the grounded presence of an upright.\n\nBaghadeer contains 780 glyphs featuring a plethora of swashes, ligatures, and alternate letters to individualize the look of your project. There is also a set of small caps and ornamental flourishes to add some finishing touches. It contains feature programming to make typesetting seamless and has all the language coverage you'd expect in a pro font.  \n [http://www.myfonts.com/fonts/stephen-rapp/baghadeer/](http://web.archive.org/web/20150419010418/http:/www.myfonts.com/fonts/stephen-rapp/baghadeer/ \"http://www.myfonts.com/fonts/stephen-rapp/baghadeer/\")\n\nHope you like it.  \nStephen\n\n| Attachment | Size |\n| --- | --- |\n| [Baghadeer\\_Poster1a.png](http://web.archive.org/web/20150419010418/http:/typophile.com/files/Baghadeer_Poster1a.png) | 110.6 KB |\n| [Baghadeer\\_Poster-4.png](http://web.archive.org/web/20150419010418/http:/typophile.com/files/Baghadeer_Poster-4_0.png) | 85.78 KB |\n| [Baghadeer\\_Wine.png](http://web.archive.org/web/20150419010418/http:/typophile.com/files/Baghadeer_Wine.png) | 57.58 KB |\n\n",
  "author": "Stephen Rapp",
  "time": "21 Oct 2013 — 9:45am",
  "uid": "14650",
  "comments": [
    {
      "time": "21 Oct 2013 — 9:56am",
      "content": "I forgot to mention that this goes on sale starting tomorrow at 30% off.\n\n"
    },
    {
      "time": "21 Oct 2013 — 10:44am",
      "content": "Lovely.  \nIt reminds me of the old ITC Braganza font a bit, but now more liquid and graceful.  \nI'd be interested to hear where the name came from.\n\n"
    },
    {
      "time": "21 Oct 2013 — 10:57am",
      "content": "The name is completely bogus. I just threw together something I thought would look good and stuck with it. So it's not a word at all.\n\n"
    },
    {
      "time": "21 Oct 2013 — 1:00pm",
      "content": "Actually… MyFonts was nice enough to change the sale date to today for me. :-)\n\n"
    },
    {
      "time": "22 Oct 2013 — 8:32am",
      "content": "Stephen is the master at scripts. Baghadeer is truly a wonderful font. Plus it has Small Caps that are very useful. It's like 2 fonts in one. :)\n\n"
    }
  ]
}
