{
  "id": "107089",
  "title": "\"Dez Petranian\" just released by Dezcom",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "New Font Release"
  ],
  "content": "Dezcom is proud to announce the release of a new typeface. Dez Petranian is a story-telling fantasy friendly family of fonts. It is a warm face that looks like the spoken word, perfect for tall tails, fantasy-world adventure books, creative writing, and poetry. Dez Petranian includes multiple language support, nearly 1,200 glyphs, stylistic sets, and many alternates. Think of it as a warm reminder of real story writing\n\n[http://www.myfonts.com/fonts/dezcom/dez-petranian/?refby=\\_dezcom](http://web.archive.org/web/20150414095841/http:/www.myfonts.com/fonts/dezcom/dez-petranian/?refby=_dezcom \"http://www.myfonts.com/fonts/dezcom/dez-petranian/?refby=\\_dezcom\")\n\n ![](http://web.archive.org/web/20150414095841im_/http:/typophile.com/files/DezPetranianBanner_5901.jpg)\n\n",
  "author": "dezcom",
  "time": "1 Nov 2013 — 10:55am",
  "uid": "3135",
  "comments": [
    {
      "time": "1 Nov 2013 — 12:16pm",
      "content": "Congrats and good luck. I like the italic /a/!\n\n"
    },
    {
      "time": "1 Nov 2013 — 12:24pm",
      "content": "Thanks!\n\n"
    },
    {
      "time": "3 Nov 2013 — 2:57pm",
      "content": "I approve of creating some more typefaces to fill this particular niche; fantasy books are popular, but they are usually typeset in faces like Times Roman - it shouldn't just be children's story books that make an effort to match the atmosphere of the story.\n\nOf course, there are existing typefaces suitable for such use, but it just doesn't seem to happen.\n\nNow, though, with the name of the typeface, I had expected it to support Armenian!\n\n"
    },
    {
      "time": "3 Nov 2013 — 6:20pm",
      "content": "Wonderfully friendly and expressive, without being weak or cloying. Congrats! I hope it gets a lot of use.\n\n"
    },
    {
      "time": "4 Nov 2013 — 6:08pm",
      "content": "@quadbloc: Thanks for the kind words.  \nWhy Armenian?\n\n@Bill, Thanks! I hope it sells, too ;-)\n\n"
    },
    {
      "time": "6 Nov 2013 — 8:53am",
      "content": "Many Armenian surnames end in -ian or -anian.\n\n"
    },
    {
      "time": "6 Nov 2013 — 11:00am",
      "content": "I intended it to be more of a Roman inference. The name comes from 2 sources:  \n1. Petra, Greek word for stone, a tribute to Sumner Stone.  \n2. Roman-Latin \"ian\" as in many names from ancient times as well as more modern fantasy hers.\n\n"
    },
    {
      "time": "7 Nov 2013 — 8:27am",
      "content": "Incidentally, seeing a typeface intended to promote the right mood for reading a work of fantasy led me to speculate on what the best typeface would be for a book containing nonsense presented as fact... one that would serve as an anaesthetic to the reader's critical faculties. And then I recalled the thread a while back on an article claiming that too-good typography did just that!\n\nAn investigation of the typography used for the works of Le Plongeon, Churchward, von Däniken and Sitchin now suggests itself...\n\nTypography Is Dangerous!\n\n"
    },
    {
      "time": "8 Nov 2013 — 9:55am",
      "content": "<cite>led me to speculate on what the best typeface would be for a book containing nonsense presented as fact...</cite>\n\nDingbats.\n\n"
    },
    {
      "time": "8 Nov 2013 — 1:07pm",
      "content": "Dingbats!!! LOL!\n\nDidn't Carson do a magazine article set in all dingbats?\n\n"
    }
  ]
}
