{
  "id": "107053",
  "title": "Looks like Georgia but not quite",
  "forum": "Home",
  "tags": [
    "Serif"
  ],
  "content": "Last Saturday, after the match between Real Madrid and Barcelona, Madrid defender Sergio Ramos supposedly tweeted this (if you understand Spanish, you'll notice the involuntary joke). Ramos is famous for tweeting less than fortunate comments all the time –so this could be legit–, but this one looked fake, basically because of the type.\n\nIt looks like Georgia, which is used by many Twitter clients, but not quite. It's a bit rounder, thinner and with less contrast. Any thoughts on wether it is actually Georgia or something else?\n\nMany thanks in advance.\n\n ![](http://web.archive.org/web/20150317132522im_/http:/typophile.com/files/Ramos_5538.png)\n\nFont:&nbsp;\n\n Georgia \n\nSolved By:&nbsp;\n\n [Ryuk](http://web.archive.org/web/20150317132522/http:/typophile.com/user/22675 \"View user profile.\")\n\n",
  "author": "Nicord",
  "time": "30 Oct 2013 — 3:09am",
  "uid": "215588",
  "comments": [
    {
      "time": "30 Oct 2013 — 3:25am",
      "content": "[I already answered you](http://web.archive.org/web/20150317132522/http:/typophile.com/node/107036)... Looks a bit distorted, mainly because it's embedded as WebFont but that's Georgia.\n\n"
    },
    {
      "time": "30 Oct 2013 — 3:33am",
      "content": "Sorry, I've been having problems with the forum and might have posted the same thing twice.\n\nCan't look it up on the code because I have only seen it as a screen capture (it isn't on Ramos official account, although that could mean he deleted it at some point).\n\nAnyway, thanks!\n\n"
    },
    {
      "time": "30 Oct 2013 — 4:37am",
      "content": "No problem. This kind of fake is easy to do actually (using Chrome and a PC at least). Find [a tweet](http://web.archive.org/web/20150317132522/http:/typophile.com/wiki/https%3A/%252Ftwitter.com/SergioRamos/status/394207206339796992), right click it, inspect element, double-click element on elements panel and replace with your words. Printscreen. Done!\n\n ![](http://web.archive.org/web/20150317132522im_/http:/typophile.com/files/sr_5842.png)\n\n"
    }
  ]
}
