{
  "id": "107186",
  "title": "Introducing HWT Van Lanen- a new wood type design by a legendary designer",
  "forum": "Home",
  "tags": [
    "decorative",
    "hamilton",
    "matthew carter",
    "News",
    "serif",
    "Wood Type"
  ],
  "content": " ![](http://web.archive.org/web/20150323044238im_/http:/typophile.com/files/vanlanen2-480_5809.png)\n\nP22 type foundry and the Hamilton Wood Type Museum are pleased to present their latest collaborative digital font release via Hamilton Wood Type Foundry (HWT): [HWT Van Lanen](http://web.archive.org/web/20150323044238/http:/www.hamiltonwoodtype.com/vanlanen.html), by renown type designer Matthew Carter.\n\nMatthew Carter has had a long career as an innovative type designer. He received the 2010 MacAurthur Fellowship award, and in 2011, he received the Lifetime Achievement Award from the Smithsonian National Design Awards. Carter was trained as one of the last type designers to cut punches for metal type production. He has designed type for most technologies with the exception of wood type until 2009 when he was commissioned to create a new original type design by the [Hamilton Wood Type Museum](http://web.archive.org/web/20150323044238/http:/woodtype.org/).\n\nMatthew Carter has created many notable type designs, including Georgia and Verdana for Microsoft specifically for on-screen web typography, which set a higher standard for web users. Carter's Bell Centennial was created for AT&T. This design featured narrower yet highly legible letterforms, which resulted in reducing a substantial number of pages per phone book and ultimately saving countless trees from the pulper. The design of the Van Lanen font for Hamilton presented a new challenge for Carter: the font was to be cut using 100+ year old technology that has its own set of unique limitations.\n\nThe final design presented by Carter features a two-part font that echoes the historic 'Chromatic' wood types, which take advantage of color overlays. The font was cut for demonstrations and offered for sale as a new wood type design via the museum. Even though the Van Lanen fonts have been cut and made available, contemporary wood type production is still relatively expensive and few have actually acquired this font in wood format. The HWT digital release will allow typographic aficionados, graphic designers and casual desktop publishers to use the new Carter design for all digital uses.\n\nAs with all of the HWT digital font releases, proceeds will help support the museum's operations and its mission of hands-on education and research.\n\nSee our [Behance](http://web.archive.org/web/20150323044238/http:/www.behance.net/gallery/Matthew-Carters-Van-Lanen-Wood-(and-digital)-Type/11521949) page for photos and more background info on the development of Van Lanen from wood type to digital.\n\n[HWT Van Lanen](http://web.archive.org/web/20150323044238/http:/www.hamiltonwoodtype.com/vanlanen.html) is available at an introductory discount through November 30th.\n\n[P22 type foundry](http://web.archive.org/web/20150323044238/http:/www.p22.com.html/)\n\n",
  "author": "jimy",
  "time": "6 Nov 2013 — 11:10am",
  "uid": "5133",
  "comments": [

  ]
}
