{
  "id": "107180",
  "title": "Brilliance — a glamorous blackletter",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "Hey all,\n\nhere's something I came up with while doodling with the Pilot Parallel Pen my girlfriend got me for my birthday. So far, I had prided myself on being a \"digital native\" as far as font design was concerned, finding it easier to play around with Béziers than with pen strokes. For this particular style, though, I found the natural constraints of broad-nib writing very helpful in quickly trying out different shapes and converging on a solution in an intuitive way.\n\nThe font is, of course, drawn entirely in Glyphs, and is much more regular than anything I could muster by hand. Still, I've made sure to soften the straight strokes a bit so as to avoid an overly mechanical look. The exuberant caps are inspired by Spencerian script.\n\n ![](http://web.archive.org/web/20150317204500im_/http:/typophile.com/files/Brilliance_5033.png)\n\nCheers\n\n",
  "author": "Catharsis",
  "time": "6 Nov 2013 — 9:20am",
  "uid": "188621",
  "comments": [
    {
      "time": "6 Nov 2013 — 9:22am",
      "content": "Oh, and I just added some small caps... I'm not sure they work well, but what else to do with those empty character slots? ;o)\n\n ![](http://web.archive.org/web/20150317204500im_/http:/typophile.com/files/B_sc_4028.png)\n\n"
    },
    {
      "time": "6 Nov 2013 — 9:36am",
      "content": "The small caps are actually what I find most interesting about your design. The rest is not bad, but not exactly mouth-watering to me. However, I am not a blackletter expert, so take my opinion with a grain of salt.\n\n"
    },
    {
      "time": "6 Nov 2013 — 10:17am",
      "content": "I agree that the small caps potentially add a lot of value.\n\nThere are some potential misreadings of letters but of course they mostly come from the blackletter tradition, so within that mode they might not register as problematic. I'm thinking of the /r/ and especially /c/ reading as an /e/, /X/ as /H/, perhaps /A/ as /U/.\n\nSecond (empty) counter of /W/ looks awkward to my eye. /Y/ seems too wide. /z/ still feels mechanical.\n\n"
    },
    {
      "time": "6 Nov 2013 — 12:16pm",
      "content": "Thanks for the quick feedback! If you guys really think the small caps are worth it, I think I should spend some more time evening out the color and relaxing some of the awkward shapes (like the too-narrow {R} or the too-wide {E}).\n\n@ R: I'm also not really an expert, but from what I've seen, most blackletters (especially Texturas, which I guess this qualifies as) tend to be very heavy. Brilliance feels light and airy to me in comparison. In fact, I had been practicing some more traditional blackletter with my 3.8 mm and 2.4 mm Pilot Parallel Pens, and I discovered this particular style when I used the 2.4 to write at the glyph size at which I'd been writing with the 3.8 before. I also like the texture that the caps create when several of them appear close together.\n\n@ Craig: I can see the ambiguities you mention, but I agree that they're part of blackletter tradition, so I think I can get away with them. At least I'm not using the Fraktur {k}... Good point about {W}. It just feels awkward to me, but I haven't found a better architecture for it so far. I can easily make {Y} narrower, too. Not sure how to make {z} more natural, though. Maybe I should return to the curved descender loop I originally had? I think I replaced it with the angular loop so it would fit in better with the other descenders.\n\n"
    },
    {
      "time": "6 Nov 2013 — 2:09pm",
      "content": "> Not sure how to make {z} more natural, though\n\nMaybe the \"link-like\" part in the middle can depart more freely from the hex-grid?\n\n"
    },
    {
      "time": "6 Nov 2013 — 3:29pm",
      "content": "How about this?\n\n ![](http://web.archive.org/web/20150317204500im_/http:/typophile.com/files/better_z_6160.png)\n\nNow I just have to figure out a convenient way to prevent the {tz} ligature in composite words like Zeitzeugen when ligatures are on... do I need to add a non-breaking non-space to the font...?\n\nAlso, new and _greatly_ improved small caps. Thanks for making me revisit them! :)\n\n ![](http://web.archive.org/web/20150317204500im_/http:/typophile.com/files/bettersc_6417.png)\n\n"
    },
    {
      "time": "7 Nov 2013 — 9:47am",
      "content": "Alright, I should be ready for publication soon. Here's a banner and a PDF specimen. If you can see some obvious shortcomings, particularly in the spacing and kerning, please do tell.\n\n[http://www.cinga.ch/type/Brilliance\\_specimen.pdf](http://web.archive.org/web/20150317204500/http:/www.cinga.ch/type/Brilliance_specimen.pdf \"http://www.cinga.ch/type/Brilliance\\_specimen.pdf\")\n\n ![](http://web.archive.org/web/20150317204500im_/http:/typophile.com/files/B_tinybanner_5040.png)\n\n"
    },
    {
      "time": "7 Nov 2013 — 9:57am",
      "content": "Maybe adjust the ascender of /d/ so it doesn't come over to the left side so quickly at the mean line. Your /d/s wind up looking like /b/s.  \nYour small-cap /Z/ is a structure that looks like it should descend--seems a little odd sitting on the baseline. Maybe a form with a bottom like the small-cap /L/ would be worth trying.\n\n"
    },
    {
      "time": "7 Nov 2013 — 2:30pm",
      "content": "Good call on the {d}. I stretched out the ascender a bit more into the diagonal, and it does look more handsome now. I had to make a somewhat more reserved contextual alternate to avoid collisions with {f ſ}, but that's no problem; I have a bunch of such alternates already in place for other letters.\n\n ![](http://web.archive.org/web/20150317204500im_/http:/typophile.com/files/d_3893.png)\n\nAs for the SC {z}, I'm rather fond of the shape, and couldn't bring myself to move it from its default position. However, since an experiment with a flat-bottomed lunate {z} shape failed, I made a stylistic alternate in the shape of a Roman {Z}:\n\n ![](http://web.archive.org/web/20150317204500im_/http:/typophile.com/files/z_4508.sc.png)\n\nOh, and this is what I made of the {W} problem... still not exactly elegant, but better, IMHO (new version to the right):\n\n ![](http://web.archive.org/web/20150317204500im_/http:/typophile.com/files/W_4231.png)\n\nThanks for the help!\n\n"
    }
  ]
}
