{
  "id": "107189",
  "title": "Jean Luc Godard typeface",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": " ![](http://web.archive.org/web/20140330210313im_/http:/typophile.com/files/photo%205_4363.JPG)\n\n",
  "author": "johan dahlqvist",
  "time": "6 Nov 2013 — 12:18pm",
  "uid": "215737",
  "comments": [
    {
      "time": "6 Nov 2013 — 1:10pm",
      "content": "If I recall correctly Jean Luc Godard's movies used lettering rather than fonts as such.  \nA fan has made a Jean Luc Godard font based on the lettering in some of his movies: [http://www.carvalho-bernau.com/jlg/](http://web.archive.org/web/20140330210313/http:/www.carvalho-bernau.com/jlg/ \"http://www.carvalho-bernau.com/jlg/\")  \nIt's heavier and less rounded than the letters in your image, but has an interesting discussion of the lettering used in the movies.  \nThere are several fonts that resemble the one in your image such as Intertype Vogue, not digitized. I trust that one or more of my colleagues will give you a list of digital fonts similar to your image.  \nDon\n\n"
    },
    {
      "time": "6 Nov 2013 — 1:13pm",
      "content": "Don, thank you so much for your insightful reply. Really appreciate it.\n\nJohan\n\n"
    },
    {
      "time": "6 Nov 2013 — 2:49pm",
      "content": "Can't agree more with Don. As alternative, I suggest [HI Neutraface 2](http://web.archive.org/web/20140330210313/http:/www.houseind.com/fonts/neutraface2) Display which looks pretty close in this case.\n\nEDIT: the more I look at it the more I'm questioning about the sample origin because Neutraface 2 looks so close that I could almost state it's a match...\n\n"
    },
    {
      "time": "6 Nov 2013 — 3:54pm",
      "content": "If the image is from something modern about Godard, then I agree with Ryuk that Neutraface is most likely the match.  \nChristian Schwartz designed the font for House Industries in 2002. According to a wiki on Richard Neutra  \n [http://en.wikipedia.org/wiki/Richard\\_Neutra](http://web.archive.org/web/20140330210313/http:/en.wikipedia.org/wiki/Richard_Neutra \"http://en.wikipedia.org/wiki/Richard\\_Neutra\")  \nChristian Schwartz based the font on Richard Neutra's architecture and design principles.  \nDoes this mean that the letters were originally designed by Richard Neutra and came to the attention of Jean Luc Godard?  \nI don't know.  \nAnyway this is all speculation without knowing the approximate date of the sample.  \nIf the objective is simply to reproduce something like the letters rather than to identify anything specific, then Neutraface works for me.  \nDon\n\n"
    },
    {
      "time": "7 Nov 2013 — 12:30am",
      "content": "I tend to think this sample is recent, simply using a screen capture of one JLG's movie and setting text with Neutraface 2.\n\n"
    },
    {
      "time": "7 Nov 2013 — 11:04am",
      "content": "amazing response, thanks to all of you.  \nfirst time i used this 'service', won't be the last.  \nJohan\n\n"
    },
    {
      "time": "28 Dec 2013 — 11:48am",
      "content": "Hi guys i am new here and i think i like your content writing and it is simply amazing for me, what a new wat to find fresh stuff over here. I you are interested in shopping and like [Boutique](http://web.archive.org/web/20140330210313/http:/kapsek.blogspot.com/)  \n ,new cloth and fancy clothes. I am prett happy to share the new taste of excitement and stylish approch towards the modernsim.\n\n"
    },
    {
      "time": "28 Dec 2013 — 11:52am",
      "content": "Hi guys i am new here and i think i like your content writing and it is simply amazing for me, what a new wat to find fresh stuff over here.Purchasing [Bridal dresses](http://web.archive.org/web/20140330210313/http:/kapsek.blogspot.com/)  \n online is a quick alternative to shopping around in your locality. The online outlets offer a wider selection of bridal dresses in one handy place\n\n"
    },
    {
      "time": "27 Mar 2014 — 11:39am",
      "content": "pakistani dress  \n [Pakistani dress](http://web.archive.org/web/20140330210313/http:/kapsek.com/) have their own different and traditional look.  \nIt contains both eastern touch and modern look in dresses.  \n [Pakistani dress](http://web.archive.org/web/20140330210313/http:/kapsek.com/) look elegant and stylish on any body shape.  \n [Pakistani dress](http://web.archive.org/web/20140330210313/http:/kapsek.com/) have variety of styles and types; they include shalwar kameez, Anakali dresses, lehngas, gharara etc.  \n wwww.kapsek.com provides complete information on Pakistani dresses and helps you keep pace with latest fashion trends.\n\n"
    }
  ]
}
