{
  "id": "107104",
  "title": "Orbis Typographicus",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": " **A rare Zapf masterpiece, newly digitized**\n\n ![](http://web.archive.org/web/20150407011659im_/http:/typophile.com/files/orbis_sample_3708.png)\n\nHello, typophiles! I'm proud to share a project that I've been working on for over a year, with the assistance of Hermann Zapf and Philip A. Metzger. I've digitized a somewhat obscure work of Zapf's, a collection of elaborate letterpress broadsides that serve as type specimens, and made them available for online viewing and as high-res, press-quality images for download. Please check out the website and let me know what you think. The press release is below.\n\n— Josh\n\n**ORBIS TYPOGRAPHICUS: A Complete Digital Facsimile**  \nA project by Joshua Langman  \n [www.orbistypographicus.com](http://web.archive.org/web/20150407011659/http:/www.orbistypographicus.com/ \"www.orbistypographicus.com\")\n\nA rare Zapf masterpiece can now be seen online, just in time for his 95th birthday.\n\nOrbis Typographicus is a rare set of letterpress broadsides created by world-renowned type designer Hermann Zapf, in collaboration with Philip L. Metzger of Crabgrass Press, between 1970 and 1980. The entire set has now been published digitally by Joshua Langman, representing the first time the collection has been reproduced — in any medium — since the original edition of nintey-nine copies.\n\nWith Professor Zapf's encouragement, Langman has scanned the entire set of twenty-nine broadsides and made the images available for free on a dedicated website, where the pages may be viewed and downloaded as press-quality 1200 dpi images. This rare work from a widely acclaimed master in the field can now be seen for the first time by those who may not be lucky enough to have access to a hard copy.\n\n[www.orbistypographicus.com](http://web.archive.org/web/20150407011659/http:/www.orbistypographicus.com/ \"www.orbistypographicus.com\")\n\n**About the Broadsides**  \nOrbis Typographicus&nbsp;(“The Typographic World”) is a set of twenty-nine 9 × 12 letterpress broadsides, designed by Hermann Zapf and printed by Philip Metzger of Crabgrass Press between 1970 and 1980. The broadsides feature quotations on art, science, nature, faith, and the human condition, from authors ancient and contemporary. The text includes poetry, prose, anagrams, and palindromes, in English, German, Spanish, French and Japanese. Hand set by Philip Metzger, the set pays tribute to worthy “Thoughts, words and phrases on the Arts and Sciences” through Zapf’s unconventional and ingenious use of typography. Orbis Typographicus&nbsp;functions both as a work of literary wall art and as an elaborate type specimen, showcasing many of Zapf’s own faces, as well as those of his wife, Gudrun Zapf von Hesse.\n\n**About the Website**  \nLangman's new digital home for Orbis Typographicus features high-resolution scans, available for download, and a complete computer-searchable transcript. The website also features a specially written essay by Philip A. Metzger, the son of the printer, in which he shares his recollections of his father working on the project. The site will officially launch on 6 November 2013, the week of Zapf's 95th birthday.\n\n**About Joshua Langman**  \nJoshua Langman is a freelance graphic designer and typographer based in New York. He discovered Orbis Typographicus by accident four years ago, fell in love with the collection of typographic broadsides, and wanted to share them with others. He built [www.orbistypographicus.com](http://web.archive.org/web/20150407011659/http:/www.orbistypographicus.com/ \"www.orbistypographicus.com\"), with Hermann Zapf's encouragement, to make his work more accessible to typophiles, calligraphers, letterpress enthusiasts, and anyone with a passion for the printed word.\n\n",
  "author": "Joshua Langman",
  "time": "2 Nov 2013 — 10:11am",
  "uid": "82305",
  "comments": [
    {
      "time": "2 Nov 2013 — 4:40pm",
      "content": "Great Work, Joshua! I was a fan of HZ's fonts and calligraphy, how did you came up with the idea?\n\n"
    },
    {
      "time": "6 Nov 2013 — 12:12pm",
      "content": "Thanks, dhannah1000!\n\nI explain in detail how I ended up doing this project here:\n\n[http://www.orbistypographicus.com/jl-intro.html](http://web.archive.org/web/20150407011659/http:/www.orbistypographicus.com/jl-intro.html \"http://www.orbistypographicus.com/jl-intro.html\")\n\nAnd Phil Metzger shares his side of the story here:\n\n[http://www.orbistypographicus.com/metzger-intro.html](http://web.archive.org/web/20150407011659/http:/www.orbistypographicus.com/metzger-intro.html \"http://www.orbistypographicus.com/metzger-intro.html\")\n\n"
    },
    {
      "time": "6 Nov 2013 — 1:12pm",
      "content": "“…variety of humors…” —a promising mode of typeface classiﬁcation?\n\nScatterplot chart would be appropriate.\n\n"
    },
    {
      "time": "7 Nov 2013 — 6:10am",
      "content": "/me puts on his straightest face...\n\nY'know, Nick, I think you're standing in Larry Wall's footprints right now: You are either _on_ something or on _to_ something.\n\nAside: He described his own state thus regarding Perl.\n\n"
    },
    {
      "time": "20 Nov 2014 — 8:07pm",
      "content": "Just resurrecting this thread to note that the Orbis Typographicus site ( [orbistypographicus.com](http://web.archive.org/web/20150407011659/http:/www.orbistypographicus.com/)) now supports Retina displays and other similar high-resolution (\\> 72 ppi) monitors. Each of the images on the site has been exported anew from the original scans, and the extra pixels (c. 220 ppi) make a big difference in capturing the sharpness of the printing on screen. And of course the press-quality 1200 dpi files are still available for download in case even Retina resolution doesn't cut it.\n\n"
    },
    {
      "time": "20 Nov 2014 — 7:38pm",
      "content": "Well, the quote _was_ from Benjamin Franklin, and so we don't have to conclude that Hermann Zapf was going to rate typefaces as sanguine, choleric, phlegmatic, and melancholic.\n\n"
    },
    {
      "time": "22 Nov 2014 — 2:32pm",
      "content": "I downloaded the PDF but it takes 2 minutes each time I want to go to the next page because the PDF is simply too big. I would've preferred individual pictures. Still, this is fantastic to see. Thanks for sharing.\n\n"
    },
    {
      "time": "22 Nov 2014 — 5:21pm",
      "content": "Yes, I know the PDF is huge. You can grab web-quality (retina) images straight off the site individually; the PDF is for resolution junkies who want to be able to zoom way in. But you're not the first to suggest individually downloadable press-quality images; it's on the list. Thanks for checking it out.\n\n"
    },
    {
      "time": "22 Nov 2014 — 6:51pm",
      "content": "> the PDF is for resolution junkies who want to be able to zoom way in.\n\nI'm one of them, but the PDF is too heavy to be able to do that with ease. I have to say I'm currently on a technically kind of outdated computer though.\n\n"
    }
  ]
}
