{
  "id": "10717",
  "title": "Virus",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This is my font, called Virus. The idea was to juxtapose thick, semi-organic marks with thin rectilinear lines to create a technological feel.   \nAny comments would be appreciated.   \n ![](http://web.archive.org/web/20131017022037im_/http:/www.typophile.com/forums/messages/29/7546.gif)\n\n",
  "author": "matthewj",
  "time": "13 Mar 2003 — 10:56am",
  "uid": "1480",
  "comments": [
    {
      "time": "14 Mar 2003 — 8:12pm",
      "content": "Kind of reminds me of DNA slides.   \n   \nThe differentiation between letters is kinda low. I'm trying to figure out if i can read them because I know the alphabet or because the characters are actually legible. Can you print some titles out and so we can see how it works?   \n   \nGraham\n\n"
    },
    {
      "time": "15 Mar 2003 — 2:16am",
      "content": "May have to change name, as Virus is already used as a font name\n\n"
    },
    {
      "time": "15 Mar 2003 — 11:01am",
      "content": "I think a name change is fine because I think you should take another look at it.   \n   \nIt feels way more analog to me than you give it credit.   \n   \nIt reminds me of those snap apart pieces that you might find in a model kit.   \n   \n-smc\n\n"
    },
    {
      "time": "24 Mar 2003 — 4:15pm",
      "content": "Sorry it took awhile to reply, I was on spring break without my computer. I changed the name slightly to avoid copyright issues. Hopefully it is clear enough to read, optimizing it doesn't keep integrity. ![](http://web.archive.org/web/20131017022037im_/http:/www.typophile.com/forums/messages/29/7971.gif)   \nObviously, this is about as small as it would be used. If you'd like to see a larger version, let me know.\n\n"
    },
    {
      "time": "25 Mar 2003 — 4:21am",
      "content": "I liked what Graham said about it looking like DNA markings... I almost wonder if MORE analog would be better?\n\n"
    },
    {
      "time": "31 Mar 2003 — 11:59pm",
      "content": "the letterforms Looks a bit like ribosomes as well. Would it be possible to open the counter width of the O up the same as the U?\n\n"
    }
  ]
}
