{
  "id": "107177",
  "title": "Web Design Made Easier with Google Fonts & Typecast",
  "forum": "Home",
  "tags": [
    "font",
    "google",
    "google fonts",
    "monotype",
    "News",
    "typecast",
    "web fonts"
  ],
  "content": " ![](http://web.archive.org/web/20150322013722im_/http:/typophile.com/files/Figure%201_Typecast_edit_3566.png)\n\nTry Typecast now - [http://typecast.com/google-fonts](http://web.archive.org/web/20150322013722/http:/typecast.com/google-fonts \"http://typecast.com/google-fonts\")  \nRead the press release - [http://bit.ly/19eufZk](http://web.archive.org/web/20150322013722/http:/bit.ly/19eufZk \"http://bit.ly/19eufZk\")\n\nWe are delighted to introduce a new a free version of Monotype’s Typecast application, now available through Google Fonts and Monotype: [http://typecast.com/google-fonts](http://web.archive.org/web/20150322013722/http:/typecast.com/google-fonts \"http://typecast.com/google-fonts\")\n\nOur premium version of the Typecast application enables typographic experimentation without the need to hand code or use expensive design software. In this new public version, users are able to select any font on the Google Fonts website and then follow the link to the Typecast application.\n\nGoogle’s service is incredibly popular, and many designers’ first experience with Web fonts is made possible through their free library. And so in our drive to encourage more use of Web fonts online and offer a new way to access the Typecast application, Google Fonts is the ideal partner. Those who currently rely on Google’s library of free typefaces to bring more varied typography to the Web will now be able to work with those typefaces more easily and create stunning, readable compositions in a fraction of the time.\n\nSpecifically, designers can now work with Google Fonts complete library on text of any length and use a wide range of type controls to build clear, readable type systems through adjustments such as font size, weight and line spacing. Designers can also work with Web fonts side-by-side to quickly see at a glance what’s working and what’s not. Users are able to create more realistic compositions with floats, clears, margins, and padding controls, and a number of effects are available such as background colors, borders and text shadows. In our free version of the Typecast application, a user’s work can be exported as production-ready HTML and CSS, or PNG files, to share with others or merge with comps.\n\nIf Google users want to upgrade at any time to take full advantage of the thousands of other typefaces available in the app, including Fonts.com Web fonts (fonts.com/web-fonts); Typekit; Webtype and Fontdeck, or to share, test, or publish their designs with one click, the premium version starts at $29 and is available at typecast.com.\n\nWe hope that our free public version will foster more type lovers and over time cultivate more typography advocates. We think that’s good for the Web, clients, readers and designers everywhere.\n\n",
  "author": "Monotype",
  "time": "6 Nov 2013 — 8:22am",
  "uid": "214618",
  "comments": [

  ]
}
