{
  "id": "107192",
  "title": "Type Finder",
  "forum": "Release",
  "tags": [
    "finder",
    "online",
    "questionnaire",
    "tool",
    "type",
    "website",
    "Release"
  ],
  "content": "Hey all.  \nType Finder, a project I've been working on for quite some time as part of my senior thesis, launched today. The website asks viewers a series of questions, and based on the answers, displays a list of typefaces that match the requirements/feel/use.\n\nI thought I'd reach out to other people interested interested in typography through this forum to promote the project (hopefully it is helpful to people looking for some new typefaces) and get some feedback and suggestions from anyone willing to share their thoughts!\n\nCheers!  \nGabe Ferreira/Elijah Zapien\n\n ![](http://web.archive.org/web/20150421203855im_/http:/typophile.com/files/type-finder_5510.jpg)\n\n",
  "author": "gabeferreira",
  "time": "6 Nov 2013 — 1:22pm",
  "uid": "215739",
  "comments": [
    {
      "time": "6 Nov 2013 — 1:25pm",
      "content": "Forgot to post the actual link: [http://www.type-finder.com](http://web.archive.org/web/20150421203855/http:/www.type-finder.com/).\n\n"
    },
    {
      "time": "6 Nov 2013 — 1:38pm",
      "content": "What criteria do you use for “reputable”?\n\nDo you intend to eventually monetize this service by charging a fee for inclusion in your database of annotated fonts?\n\nIf so, what is your legal arrangement with your college?\n\nI think that if you are going to publish this educational project online, you should include the full slate of web site links to “info” the site, e.g. your qualiﬁcations and typeface-analysis criteria, so that users have some idea of the credibility of your claimed-as-reputable suggestions, which to me is the real issue here, other than building a functioning site that performs the task of designing a UX that matches clicks with a database.\n\n"
    },
    {
      "time": "7 Nov 2013 — 6:53am",
      "content": "I like the sprightly question format!\n\nYou can only ask so many questions if you want to keep it brisk. But, would you consider an additional question that checks for special needs? For example, is there a need for high legibility due to an audience of older readers (who might not have glasses handy), or very young readers? Is there a language need? The resulting recommended fonts seem to be mainstream with comprehensive glyph sets to satisfy many languages, but it could be a consideration.\n\nGood luck with your project.\n\n"
    },
    {
      "time": "7 Nov 2013 — 2:33pm",
      "content": "Hey Nick.  \nWe don't intend to monetize the service. The idea is to make it available as a resource for anyone who needs a database of reliable typefaces to choose from for whatever project they are working on. There are several online articles describing what makes fonts good and set a criteria for \"reputable\", (a recent and rather lengthy one is this article from Jessica Hische's blog, for example: [http://jessicahische.is/talkingtype](http://web.archive.org/web/20150421203855/http:/jessicahische.is/talkingtype \"http://jessicahische.is/talkingtype\")) but we couldn't find a website that puts those guidelines to use by basically doing the \"filtering\" for whoever needs to browse some typefaces. People could use the built-in filtering technology from Adobe, Linotype, MyFonts, etc., but that can be very misleading as they offer several thousand fonts as opposed to the 140 on our website.\n\nI do like your idea of adding a section that describes our analysis criteria in case someone is wondering why a specific typeface made it to the list (thanks for the suggestion). Did you have any comments regarding the current selection of fonts?\n\n"
    },
    {
      "time": "7 Nov 2013 — 2:38pm",
      "content": "@twalsh1490  \nThat's a good idea, thanks for sharing. I think a checklist at the last page (when all the chosen typefaces are displayed) would work well for that. People could further filter the selection by clicking on specific needs (multi-language support, readability, etc...). We'll look into implementing that!\n\n"
    }
  ]
}
