{
  "id": "10730",
  "title": "Futurist type style",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "i was wondering if any definitive 'futurist fonts' come to mind? just browsing through some futurist work and noticing [obviously] sans faces and some slab serifs .. any suggestions?\n\n",
  "author": "bibigoogles",
  "time": "14 Mar 2003 — 12:29pm",
  "uid": "1155",
  "comments": [
    {
      "time": "14 Mar 2003 — 3:55pm",
      "content": "[http://www.p22.com/products/futurismo.html](http://web.archive.org/web/20131020210956/http:/www.p22.com/products/futurismo.html)   \n   \nI think that there are some definitive Futurist fonts.   \n   \nI believe that the Futurist's typographic goals included overall disruption of a page and a sense of unease.   \n   \nI think b.king's idea is a good solution as well.   \n   \n-smc\n\n"
    },
    {
      "time": "16 Mar 2003 — 4:02pm",
      "content": "_...you'd do well to just set each word in a different face. And not respect baselines._   \n   \nBut not randomly. Futurist typography was all about reflecting the meaning of the words in the choice of colours, fonts, weights etc. It was also an attack on the norms of punctuation.   \n   \n_... the Futurist's typographic goals included overall disruption of a page and a sense of unease._   \n   \nDisruption of \"the bestial, nauseating idea of the book\" where the _mise en page_ did not do justice to the emotional language of the text:   \n   \n_My revolution is aimed at the so-called typographical harmony of the page, which is contrary to the flux and reflux, the leaps and bursts of style that run through the page. On the same page, therefore, we will use three or four colours of ink, or even twenty different typefaces if necessary. For example: italics for a series of similar or swift sensations, boldface for violent onomatopoeias, and so on. With this typographical revolution and this multicoloured variety in the letters I mean to redouble the expressive force of words._  \n   \nFrom Marinetti's _ **Destruction of Syntax - Imagination without Strings - Words-in-Freedom** _,1913.\n\n"
    },
    {
      "time": "17 Mar 2003 — 4:59pm",
      "content": "_Yes, but the general look -- not the actual content -- of something that resembles futurist work can be described and replicated easily_   \n   \nBut it's not going to really resemble Futurism if the 'look' and the 'content' aren't linked. And, to be honest, if you want to be truly Futurist you're a bit of an anachronism.   \n   \nM.\n\n"
    },
    {
      "time": "17 Mar 2003 — 7:18pm",
      "content": "Futurism is dead! Long live Dada!   \n   \n-smc\n\n"
    },
    {
      "time": "18 Mar 2003 — 8:26am",
      "content": "Vorticism: an art movement founded by Wyndham Lewis, the principal proponent of which was Wyndham Lewis. Vorticism is characterised by the art of Wyndham Lewis. Admirers of Vorticism include fans of Wyndham Lewis.\n\n"
    },
    {
      "time": "18 Mar 2003 — 8:37am",
      "content": "I think all these \"movements\" lasted about five minutes combined. Still, their influence cannot be denied. Tra-la-la-la-la.   \n   \n-smc\n\n"
    },
    {
      "time": "18 Mar 2003 — 1:12pm",
      "content": "[Who'd've ever thought...](http://web.archive.org/web/20131020210956/http:/www.vorticism.co.uk/)\n\n"
    },
    {
      "time": "18 Mar 2003 — 2:47pm",
      "content": "Who'd've ever thought...you'd need sunglasses to check out Nathan's link. Be warned, it hurts.   \n   \nM.\n\n"
    },
    {
      "time": "18 Mar 2003 — 6:32pm",
      "content": "coming back here after that, uh, experience,   \nall i see is a greenish brown screen. but i'm   \ngrateful to still have my sight at all.\n\n"
    },
    {
      "time": "18 Mar 2003 — 6:59pm",
      "content": "Perhaps you're seeing the future ;-)\n\n"
    },
    {
      "time": "14 Mar 2003 — 1:37pm",
      "content": "It's tough to say that there's a definitive Futurist font. It's more the style of typography that's important. Mixing faces and what not. I mean, if you were trying to make something that looked 'Futurist', you'd do well to just set each word in a different face. And not respect baselines.\n\n"
    },
    {
      "time": "17 Mar 2003 — 11:38am",
      "content": "Yes, but the general look -- not the actual content -- of something that resembles futurist work can be described and replicated easily. To create something that is more futurist, by virtue of it's reflection of futurist typographic ideals and dogma, the designer reflects the legacy of the movement, but the designer is then author.   \n   \nAnd if you want to be truly futurist, use after effects.\n\n"
    },
    {
      "time": "18 Mar 2003 — 7:05am",
      "content": "_Futurism is dead! Long live Dada!_   \n   \nWhatever happened to Vorticism?   \n   \n\"Give me Constructivism, or give me death.\"\n\n"
    },
    {
      "time": "18 Mar 2003 — 1:05pm",
      "content": "Hey, it's not fair to forget E. McKnight Kauffer (he worked under the influence of Lewis).   \n   \nOh wait...dammit, that didn't support my argument.\n\n"
    },
    {
      "time": "19 Mar 2003 — 9:24am",
      "content": "Oh my god, my eyes are bleeding.\n\n"
    }
  ]
}
