{
  "id": "107315",
  "title": "DTL OTMaster 3.7 released",
  "forum": "Release",
  "tags": [
    "dtl",
    "OpenType",
    "OTM",
    "SFNT",
    "truetype",
    "URW++",
    "Release"
  ],
  "content": " ![](http://web.archive.org/web/20150414225907im_/http:/typophile.com/files/OTM_370_release_4830.gif)\n\nImmediately after its initial release DTL OTMaster (OTM) was hailed as very practical stand-alone application for reviewing and editing tables of fonts with a SFNT ﬁle structure. OTM’s big advantage is that it allows editing of tables in a graphical user interface. As Dr. Ken Lunde, Sr. Computer Scientist at Adobe Systems, stated in 2009: ‘_As someone who works with OpenType fonts on an every-day basis, and with the tools that are used to build and check them, I would like to state here that DTL OTMaster is a fabulous tool. The best way for me to characterize it is that it gives me the power of some existing command-line tools, wrapped up in nice GUI. It handles CJK fonts well, including those with a large number of glyphs. I especially appreciate that there is a Mac OS X version._’\n\nThe new OTM edition has version number 3.7, while the previous one was numbered ‘2.4’. In the past two and a half years the functionality of OTM was enhanced and extended, hence the ascending numbering. The new edition is for that reason a major upgrade, containing a lot of new functionality. From the import/export of Ideographic Variation Sequences (IVS) to the editing of Feature Parameters, and from an autohinter for edited or newly added glyphs to support for COLR+CPAL tables.\n\nSome use OTM for font-spelunking, other use it Open(Type)-heart surgery. Some use it for compiling OpenType Layout features, applying the elegant automatic subsetting, others use it for mark positioning. OTM is the Swiss knife for CFF- and TTF-based OpenType, TrueType, and TTC (TrueType Collection) fonts.\n\nA listing of the new functionality in OTM 3.7 can be found [here](http://web.archive.org/web/20150414225907/http:/www.fonttools.org/downloads/OTMA/RM/Read_Me_lb.txt). DTL OTMaster can be ordered directly [here](http://web.archive.org/web/20150414225907/http:/www.fontmaster.nl/Shops/FM_Shop/index1.html).\n\n",
  "author": "blokland",
  "time": "14 Nov 2013 — 1:08am",
  "uid": "1688",
  "comments": [
    {
      "time": "10 Jan 2014 — 5:58am",
      "content": "Karsten Lücke updated the DTL OTMaster 3.7 manual. The PDF can be downloaded from [here](http://web.archive.org/web/20150414225907/http:/www.fontmaster.nl/pdf/OTM_manual.zip), and the printed edition can be purchased at [DTL’s Bookshop](http://web.archive.org/web/20150414225907/http:/www.dutchtypelibrary.nl/Shops/BookShop/contents/en-us/d1.html), or directly at [Lulu](http://web.archive.org/web/20150414225907/http:/www.lulu.com/content/paperback/dtl-otmaster-manual/14201201).\n\nFEB\n\n"
    }
  ]
}
