{
  "id": "107347",
  "title": "Mixing small caps and lower case, e.g., plurals and possessives",
  "forum": "Design",
  "tags": [
    "lower case",
    "plurals",
    "possessives",
    "small caps",
    "Design"
  ],
  "content": "Dear Typophile,\n\nWhat is the convention when mixing small caps and lower case in the same word?\n\nFor instance, if I am setting all abbreviations in small caps, I might have the phrase ‘he had two DVDs on his shelf’. How do I stop it looking like ‘he had two DVDS on his shelf’ (you have to imagine these large caps are small caps!).\n\nAnother example might be a possessive. ‘the new DVD’s cover was blank’. In theory it's okay, but in some typefaces the lower case S actually comes out larger than the small caps, which looks a little striking.\n\nAre there any conventions here? Or tips people have found from experience look best when mixing small caps and lower case in the same word?\n\nAll best wishes,\n\nDrudge\n\n",
  "author": "Drudge",
  "time": "16 Nov 2013 — 3:06am",
  "uid": "215224",
  "comments": [
    {
      "time": "16 Nov 2013 — 8:25am",
      "content": "Drudge, I do not have an answer to your exact question. These types of problems, using small caps in technical writing, have come up in the past:  \n [http://typophile.com/node/84025](http://web.archive.org/web/20150417161914/http:/typophile.com/node/84025 \"http://typophile.com/node/84025\")  \n [http://typophile.com/node/89876](http://web.archive.org/web/20150417161914/http:/typophile.com/node/89876 \"http://typophile.com/node/89876\")  \n [http://www.typophile.com/node/92747](http://web.archive.org/web/20150417161914/http:/www.typophile.com/node/92747 \"http://www.typophile.com/node/92747\")  \n [http://www.typophile.com/node/99592](http://web.archive.org/web/20150417161914/http:/www.typophile.com/node/99592 \"http://www.typophile.com/node/99592\")\n\nSome people (like me) say forget small caps for this purpose. Just use a font where the capital letters are definitely smaller than the full height letters, such as Gentium, Greta Text, or Malabar. Or even use a font where the capital letters are somewhat smaller than full height, like Skolar. And don't even mess with the small caps problems.\n\nSome people say use a font where the small caps are definitely higher than the x-height. But there are not too many fonts designed like this, even though this is what is needed for tech writing.\n\nSome people say Drudge, just use your good judgment, buddy.\n\nMaybe someone else will have a better answer.\n\n"
    },
    {
      "time": "16 Nov 2013 — 9:54am",
      "content": "If you have to (or want to) stick with small caps, there are two options: If you are bound to a certain typeface, you have to live with the way it looks. If you are not, do what J. Tillmann suggests in his third paragraph: select a typeface that has tall small caps. Here are some examples, good and bad. Scala and Maiola in the first and second line make it hard for the reader to tell apart small caps and lowercase. Kepler in the third line and Chaparral in the last are better in this respect.\n\n ![](http://web.archive.org/web/20150417161914im_/http:/typophile.com/files/smallcaps_4852.png)\n\n"
    },
    {
      "time": "17 Nov 2013 — 8:36am",
      "content": "You can also either scale down caps at iny bit, or scale up a tiny bit the small caps.\n\n"
    },
    {
      "time": "17 Nov 2013 — 2:46pm",
      "content": "_…where the small caps are definitely higher than the x-height … there are not too many fonts designed like this._\n\nI suspect there are quite a few.  \nHaving faced the same predicament as Drudge when I was art directing, I for one have subsequently always made my small caps signiﬁcantly taller than x-height.\n\n"
    }
  ]
}
