{
  "id": "107390",
  "title": "Digital Typography & Artiﬁcial Intelligence",
  "forum": "Release",
  "tags": [
    "Adobe",
    "dtl",
    "font production",
    "IKARUS",
    "Peter Karow",
    "urw",
    "Release"
  ],
  "content": " ![](http://web.archive.org/web/20150317091759im_/http:/typophile.com/files/Omslag_Karow_3720.jpg)\n\nOn Saturday evening 12 October 2013, the diner of the yearly ATypI (Association Typographique Internationale) conference took place at the atmospheric Winter Garden restaurant of Grand Hotel Krasnapolsky in Amsterdam. More than 300 attendees enjoyed the excellent buffet. Highlight of the evening was the presentation of the 3rd _Dr. Peter Karow Award for Font Technology & Digital Typography_ to Dr. Donald E. Knuth, world famous for developing TeX and Metafont.\n\nEspecially for this occasion a booklet titled _Digital Typography & Artiﬁcial Intelligence_ was jointly produced by Adobe and the Dutch Type Library, the latter being the initiator of the Dr. Peter Karow Award. In this publication font-software pioneer Dr. Peter Karow, who is especially renowned for developing the IKARUS program, describes how digital typography inﬂuenced type design and text layout. Digital typography has changed font production and text composition in their entirety. Modern text composition was mostly inﬂuenced by programs such as WordStar, Word, PageMaker, QuarkXPress, and FrameMaker, which replaced writing, typesetting and printing in both ofﬁce and at home.\n\nDr. Peter Karow (1940) studied high energy physics at the University of Hamburg, leading to a dissertation in 1971. With Dr. Gerhard Rubow and Dr. Jürgen Weber he founded the company URW Software & Type GmbH in 1972. Several contacts with type designers, especially Hermann Zapf, had great impact on his development of the IKARUS program. Since 1988, Karow and Zapf worked together on the _hz_-program in order to use the power of computers to improve the micro-typography of texts.\n\nDr. Peter Karow gave international presentations at numerous conferences, wrote many articles for journals, got seven patents for DTP-related methods, and wrote several books, among them: _Digital Typefaces_ and _Font Technology_ (both Springer-Verlag, Berlin-Heidelberg-New York, 1994), and _Typeface Statistics_ (URW Verlag, Hamburg, 1993).\n\n_Digital Typography & Artiﬁcial Intelligence_ is available from the Dutch Type Library and can be ordered at DTL’s [online book shop](http://web.archive.org/web/20150317091759/http:/www.dutchtypelibrary.nl/Shops/BookShop/contents/en-us/d1.html). The texts are in English and the illustrated booklet contains 56 pages printed on 120 and 240 grams Bioset FSC paper (size: 12 × 24.5 cm) by Ando bv in The Hague, The Netherlands. The price is €12.50, exclusive V.A.T. and shipping costs.\n\n",
  "author": "blokland",
  "time": "21 Nov 2013 — 12:49am",
  "uid": "1688",
  "comments": [
    {
      "time": "15 Dec 2014 — 8:21am",
      "content": "To celebrate the release of the new DTL OTMaster edition (5.0.0) later this week, we offer Dr. Karow’s booklet on _Digital Typography & Artiﬁcial Intelligence_ for a discounted price: €5 (excl. V.A.T. and shipping) at DTL’s [online book shop](http://web.archive.org/web/20150317091759/http:/www.dutchtypelibrary.nl/Shops/BookShop/contents/en-us/d1.html) until 6 January 2015.\n\n"
    }
  ]
}
