{
  "id": "107370",
  "title": "Akko Typeface Features at Museum of Science, Boston",
  "forum": "Home",
  "tags": [
    "akko",
    "Boston",
    "fonts",
    "monotype",
    "museum of science",
    "News",
    "typeface",
    "typography"
  ],
  "content": " ![](http://web.archive.org/web/20150322005534im_/http:/typophile.com/files/MOS_Akko_Image_3%20-%20Copy_3924.jpg)\n\nView the exhibit gallery - [http://bit.ly/I1uVrp](http://web.archive.org/web/20150322005534/http:/bit.ly/I1uVrp \"http://bit.ly/I1uVrp\")  \nRead the blog post – [http://bit.ly/1hRYiw3](http://web.archive.org/web/20150322005534/http:/bit.ly/1hRYiw3 \"http://bit.ly/1hRYiw3\")  \nView the press release – [http://bit.ly/1edvXeC](http://web.archive.org/web/20150322005534/http:/bit.ly/1edvXeC \"http://bit.ly/1edvXeC\")  \nDownload the font - [http://bit.ly/1gYK8b0](http://web.archive.org/web/20150322005534/http:/bit.ly/1gYK8b0 \"http://bit.ly/1gYK8b0\")\n\nMonotype’s [Akko](http://web.archive.org/web/20150322005534/http:/www.fonts.com/font/linotype/akko?QueryFontType=Web#buying-options) typeface is now on “full display” at the Museum of Science, Boston, “Hall of Human Life,” exhibit. Akko is the main brand identity font for the museum’s newest permanent exhibit, which opened to the public this weekend.\n\nAs an essential component of any brand, the typeface works to affirm brand personality. Akko is fully integrated into the exhibit, appearing on screen and in print throughout the 10,000 square-foot space. The design is also used in 3D signage as part of several exhibit stations, crafted to draw visitors into various interactive settings to fuel discovery and curiosity about what it’s like to be human. The typeface’s best features are showcased: Akko is easy to read, approachable and friendly.\n\n“Akko has the right balance of qualities we were looking for in a branding typeface,” Emily Marsh, a senior graphic designer at the Museum of Science told Monotype. She said they were looking for a typeface that would be highly legible at any size, from the tallest 3D letters to the smallest-sized text. She said, “It was important that the design be warm and friendly for both kids and adults, yet still be a strong presence. We love how Akko looks in the exhibit, and we appreciate how everyone is drawn to the design, even people who don’t know a thing about typefaces.”\n\nDesigned by Monotype Type Director Akira Kobayashi, the 24-font Akko family is a sans serif design that offers a large x-height, making the typeface appear larger and easier to read. The slightly condensed proportions help maintain legibility, even when several words are composed in a line of text. Akira also designed the characters to hold an even texture, regardless of text size.\n\nVisitors to the “Hall of Human Life” are able to engage with more than 70 interactive exhibit elements to explore how the human body works, and how factors such as environmental circumstances, personal choices, physical attributes, diet, age and living conditions can impact daily life. As visitors journey through the exhibit, they may also take part in gathering and reporting anonymous data in an unending process of learning and discovery – all with the exhibit elements presented in a branded capacity using the Akko typeface.\n\n“People will remember the ‘Hall of Human Life’ through the impressions they experience,” said Allan Haley, director of words and letters at Monotype. “There’s an ease and familiarity about it that’s a lot like being around a good friend. All of this adds up to an overall feeling that the exhibit creators sought to achieve – and did.”\n\n",
  "author": "Monotype",
  "time": "19 Nov 2013 — 8:19am",
  "uid": "214618",
  "comments": [

  ]
}
