{
  "id": "10750",
  "title": "Tecnology changes the furure of type",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "With the new pc-tablet, and the comming 2003 new Mac- Tablet computers with a recognize-handwriting software, the concept of typography changes to the new tecnology, as always in the history of type, maybe the keyboard never works better than the hands & pencil, just take a look here   \n [http://www.microsoft.com/windowsxp/tabletpc/evaluation/tours/default.asp#](http://web.archive.org/web/20131023154631/http:/www.microsoft.com/windowsxp/tabletpc/evaluation/tours/default.asp#)   \n   \nSo what do you think about this comming up electronic hanwriting guys? Changes the future of type in any way?\n\n",
  "author": "Miguel Hernandez",
  "time": "16 Mar 2003 — 6:02pm",
  "uid": "1109",
  "comments": [
    {
      "time": "16 Mar 2003 — 9:04pm",
      "content": "This isn't actually new. It was introduced over ten years ago by Apple on the Newton, which introduced the concept of the PDA.   \n   \n [http://www.oldschool.net/newton/](http://web.archive.org/web/20131023154631/http:/www.oldschool.net/newton/)\n\n"
    },
    {
      "time": "16 Mar 2003 — 9:30pm",
      "content": "Well, at the beginning the first was Newton, but now the direction on pc-home users aroun the world seems to be tablet pc, that combines the traditional characteristic of the notebooks, with the tecnology of electronic handwrite ready to replace our copybooks for this, before you see the new comming i-tablet of mac, and the typography users will change comic sans with is own handwriting to write emails, thats not Newton but mac\n\n"
    },
    {
      "time": "17 Mar 2003 — 7:51am",
      "content": "But Newton's handrwiting algorithm failed.   \nAnd I'm not sure it was the first either.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Mar 2003 — 9:31pm",
      "content": "I tried Inkwell and it's really accurate. My handwriting is not joined very much (italic hand) so that might be why it works well for me. But I think it's still a lot slower than typing. I find that I can't write properly any more on paper (I mean composing something), because I type much faster than I can write, and the speed of typing is closer to the speed I think. So I write more coherently on the computer.   \n   \nChinese handwriting recognition has been around for over a decade (if not longer, I'm not sure) and it has been quite popular, as you can imagine typing in Chinese is much slower than you would in other alphabetic languages. Yet I still forced myself to learn to type in Chinese, because I still find writing on the tablet really unnatural.   \n   \nSomehow I don't think handwriting recognition is going to change typography/type design very much. In the end, what we write down is still converted into conventional typography. So you think the trend is going to be more fonts based on handwriting?!\n\n"
    },
    {
      "time": "17 Mar 2003 — 8:05am",
      "content": "As I understand it, wasn't Newton handwriting recognition resurrected in the form of Inkwell, OS X's handwriting recognition? If you have a tablet plugged into a machine running X, you can pretty much write as you normally would and Inkwell understands.\n\n"
    }
  ]
}
