{
  "id": "107501",
  "title": "Italian Old Style MT Pro",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi guys, I would like to use this font for an important personal project.  \nIt has got a good amount of glyphs, around 700. I like it because of its  \nroughness, but I’m not completely sure.\n\nCould you guys express your opinion about it?  \nHave you any alternative for it?\n\nThank you,  \nAny doubts or strong opinion about it, will be well-accepted.\n\n ![](http://web.archive.org/web/20150414031748im_/http:/typophile.com/files/C_ITAO-10005000_3736.GIF)\n\n",
  "author": "Gian_LO_FI",
  "time": "7 Dec 2013 — 5:08am",
  "uid": "179143",
  "comments": [
    {
      "time": "8 Dec 2013 — 9:38am",
      "content": "As a book typeface it is really charming. I’m just using it in a historical documentation but in a modern layout. The Italics are – well – Goudy-special, but interesting and eye-catching for headlines in body copy.  \nGo for it if you like it.  \nAn alternative would be Kennerly.\n\n"
    },
    {
      "time": "8 Dec 2013 — 2:29pm",
      "content": "They are both really nice. I think I have to do print test. Before anything. What about something more, let’s say well know. Like Grajon. What you think about it?\n\n"
    },
    {
      "time": "8 Dec 2013 — 11:56pm",
      "content": "Do you mean ›Granjon‹? Well, this one is much ›cleaner‹ and up to this date probably the most widely used book typeface. It depends what you’re after.\n\n"
    },
    {
      "time": "9 Dec 2013 — 2:31am",
      "content": "I don’t know Italian old style seems to be the first choice, but I’m looking for some alternative. Like Jenson pro, Maxime, Tundra FF. Stuff warm, venetian inspired. This kind of stuff. Italian old style seems to ha ve a terrible detail.\n\n"
    },
    {
      "time": "9 Dec 2013 — 3:08am",
      "content": "I don’t know what to do...Italian old style seems to be the first choice, but I’m looking for some alternative. Like Jenson pro, Maxime, Tundra FF. Stuffs warm, a bit venetian inspired. This kind of stuff. Italian old style seems to have terrible details.\n\n"
    }
  ]
}
