{
  "id": "107596",
  "title": "Small-town font",
  "forum": "General Discussions",
  "tags": [
    "50s",
    "General Discussions",
    "small town",
    "townspeople",
    "village"
  ],
  "content": "What's a good (perhaps something cursive, vintage) font to capture the sentimental, feel-good spirit of a small town? If it has an underlying feeling of dread, it would be best (something like a small town from a Twilight Zone episode for example).\n\n",
  "author": "omfaonline",
  "time": "12 Dec 2013 — 7:54am",
  "uid": "205098",
  "comments": [
    {
      "time": "12 Dec 2013 — 8:55am",
      "content": "A sentimental feel-good small town spirit with a feeling of dread is a lot to ask of a font.\n\nIs this for text or a book cover or an ad or a poster or what?\n\n"
    },
    {
      "time": "12 Dec 2013 — 9:10am",
      "content": "im looking for a vintage look also.\n\n"
    },
    {
      "time": "12 Dec 2013 — 10:26am",
      "content": "Stick to a sentimental feel-good small town spirit feel, scratch out dread. Why do you think it's relevant what it's for? (it's a poster)\n\n"
    },
    {
      "time": "12 Dec 2013 — 11:23am",
      "content": "Why do you think asking what it's for isn't relevant? Context is always relevant.\n\n"
    },
    {
      "time": "12 Dec 2013 — 12:12pm",
      "content": "Small towns can be dreadful, if you’re different.  \n [http://www.youtube.com/watch?v=Xuz94ZIPfJk](http://web.archive.org/web/20140724182306/http:/www.youtube.com/watch?v=Xuz94ZIPfJk \"http://www.youtube.com/watch?v=Xuz94ZIPfJk\")\n\n"
    },
    {
      "time": "12 Dec 2013 — 1:40pm",
      "content": "“Why do you think asking what it's for isn't relevant? Context is always relevant.”  \nYeah, no s\\*\\*t. But my point is this: if a font is suitable for the idea of a project and works on a conceptual and aesthetic level, what's the difference if it's a poster or a book cover? It should work well across all mediums. And why is the debate shifting towards semantics, I asked for what professionals deemed a good font that is vintage and captures the \"sentimental, feel-good spirit of a small town\". It's for a poster and it's the main title. That's all there is to know really.\n\n@Nick Shinn:  \nErm.. That's not really the kind of small town I want to show.\n\n"
    },
    {
      "time": "12 Dec 2013 — 4:41pm",
      "content": "When you ask for help, and then people ask for more detail, it's generally under the premise that they feel they can offer you better help with more information. When you quickly dismiss those questions, you come off sounding like a twat. Why would you even trust someone's answer when their answer is based on virtually no information? And why would anyone want to help when you're so dismissive of their questions? So while it may not make much difference if it's for a book cover or a poster (two types of media you did **not** mention in your initial post), it certainly would make a difference if it was (as J. Tillman asked) for text. It could also make a difference if it was for the titles of a movie, or if it was going to be silkscreened on a t-shirt.\n\nSimilar instances where asking questions could provide more relevant answers:\n\n• What time period does this relate to? You never mentioned if this is a town in modern times, or the 1960s, or the 1880s. It wouldn't make sense to offer suggestions for fonts that evoke an episode of Twilight Zone from that 60s that took place in the 60s when you were really talking about one of the episodes from the 60s that took place in the 1800s.\n\n• Is the location of the town relevant? Your profile says you live in Montreal. Are you talking about a small town in Quebec or a small town in the US in Indiana? I'd imagine there'd be a difference.\n\n• Who's the audience? (i.e. do they need something obvious, or would something more subtle work)\n\nThese are the kinds of questions professionals ask. They're also the kinds of questions (and answers) that could help the professionals who frequent this board give you better answers (or answers at all — twelve hours after asking your question, you've gotten none).\n\nSo feel free to continue coming off like a twat, and use Arial. Lots of people in small towns use Arial. But if you want better help in the future, try not being dismissive of questions that are being asked in the spirit of helping you.\n\n"
    },
    {
      "time": "12 Dec 2013 — 5:25pm",
      "content": "I'd recommend something like Alexander Phemister's Old Style. Century Oldstyle is somewhat similar, and is more easily available.\n\n"
    },
    {
      "time": "12 Dec 2013 — 6:28pm",
      "content": "@jonathanhughes:\n\nWhere do I start with you... I wasn't dismissive, it was a question and I clarified my standpoint. If I were dismissive, I wouldn't bother explain myself.\n\n“you come off sounding like a twat” - And I'm sorry to say, you come off as an asshole.\n\n“It wouldn't make sense to offer suggestions for fonts that evoke an episode of Twilight Zone from that 60s that took place in the 60s when you were really talking about one of the episodes from the 60s that took place in the 1800s.” Seriously? I find it hard to believe that there are people who ask such incredibly empty and silly questions. When I say \"Twilight Zone\", I mean the era in which it was produced (and most episodes were set in). Why would you even assume otherwise except to make a total dipshit, non-existent point?\n\n“Is the location of the town relevant? Your profile says you live in Montreal. Are you talking about a small town in Quebec or a small town in the US in Indiana? I'd imagine there'd be a difference.” Although true, I am sure that any non-bullshitting professional would agree that the combination of \"Twilight Zone\", \"vintage\", \"cursive\", and \"sentimental\" would evoke some sort of American 50s-60s vintage aesthetic to all professionals, now wouldn't it? I'm looking for options and would like to open a discussion, which is what these forums are for (a fact which you've managed to completely miss).\n\n“Who's the audience? (i.e. do they need something obvious, or would something more subtle work)” I'm not going to bother with that.\n\n“or answers at all — twelve hours after asking your question, you've gotten none” - not exactly the kind of sneering sentiment a courteous professional would have, now is it? Oh and I did get an answer after all ;)\n\n“So feel free to continue coming off like a twat, and use Arial.” And you go right on to sounding like an asshole while using whatever hipster font you're infatuated with this week.\n\n"
    },
    {
      "time": "12 Dec 2013 — 5:52pm",
      "content": "@quadibloc: Thanks a lot, I'll try it out.\n\n"
    }
  ]
}
