{
  "id": "10752",
  "title": "Freiburger",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "At the risk of offending type historians everywhere, I thought I'd take a stab at recreating an old type specimen in bitmap form. It's Sunday, I'm home sick, so why not?   \n   \nThe following specimen is scanned from D.B.Updike's Printing Types, Vol 1, pg. 87. This was the type used for the first Bible printed in France: Freiburger, Gering and Kranz, Paris 1476   \n   \n ![frei specimen](http://web.archive.org/web/20150414181212im_/http:/www.typophile.com/forums/messages/29/7679.gif)   \n   \nAnd then here's a couple of hours' work in Bitfonter:   \n   \n ![freiburger](http://web.archive.org/web/20150414181212im_/http:/www.typophile.com/forums/messages/29/7680.gif)   \n   \nSo before you slam the R and the V, let me know if the bitmap feels true to the original forms, and where improvements might be made.   \n   \nThanks //jb\n\n",
  "author": "Jared Benson",
  "time": "16 Mar 2003 — 7:54pm",
  "uid": "3",
  "comments": [
    {
      "time": "17 Mar 2003 — 8:41am",
      "content": "This sure brings back memories. A few years ago I knocked together a set of heavy titling caps inspired by the FGK uppercase. I only used them once, and never extended the character set beyond the basic alphabet.   \n ![Bible Black](http://web.archive.org/web/20150414181212im_/http:/www.typophile.com/forums/messages/29/7698.gif)  \nObviously I rationalised a few things more than Jared has done in his bitmap font.\n\n"
    },
    {
      "time": "17 Mar 2003 — 8:47am",
      "content": "Oops, I forgot the wide-boy ![Bible Black Z](http://web.archive.org/web/20150414181212im_/http:/www.typophile.com/forums/messages/29/7701.gif)\n\n"
    },
    {
      "time": "17 Mar 2003 — 8:54am",
      "content": "That's pretty nice.   \nI just think the \"Q\" needs a perpendicular shear in there.   \nThe \"S\" rules.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Mar 2003 — 10:21am",
      "content": "John, gorgeous work! Methinks I should quit wasting my time on bitmaps ... ![:-)](http://web.archive.org/web/20150414181212im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "17 Mar 2003 — 11:40am",
      "content": "Jared, you've gone mad! But I do like the color this creates.   \n  \nMiguel may be right about the size, but then I think, much   \nlarger and a bitmap is pretty useless anyway. Then again,   \nare you thinking about utility with this exercise anyway?\n\n"
    },
    {
      "time": "16 Mar 2003 — 8:50pm",
      "content": "\\>At the risk of offending type historians everywhere...   \n   \n\\>I'm home sick, so why not?   \n   \nWell, if you try to keep the spirit of the original forms in that small size, you\n\n"
    }
  ]
}
