{
  "id": "107656",
  "title": "Unicode Hebrew fonts with interesting ligatures",
  "forum": "Hebrew Typography & Type Design",
  "tags": [
    "Hebrew ligature",
    "Hebrew Typography & Type Design",
    "Unicode"
  ],
  "content": "Over at the [Open Siddur Project](http://web.archive.org/web/20150317114216/http:/opensiddur.org/2010/07/unicode-compliant-and-open-source-licensed-hebrew-fonts/#comment-16197), we've received a handful of requests for Unicode Hebrew fonts with interesting ligatures that I've seen in print but never before in a digital (Unicode) font.\n\nThe first is a bowing lamed. The second is a letter hey wherein the divine name אדוני (adonai, lit. lord/master) is spelled.\n\nHas anyone seen a Unicode font with such ligatures? I'd also be interested in learning about Hebrew fonts supporting other unusual ligatures (in the private use area, I imagine).\n\nThank you.\n\n",
  "author": "Aharonium",
  "time": "15 Dec 2013 — 6:19pm",
  "uid": "69149",
  "comments": [
    {
      "time": "13 Jan 2014 — 3:08pm",
      "content": "Yoram Gnat of the Culmus Project has answered my question with a version of Culmus Frank Ruehl font, they're calling Frank Curled Lamed.\n\nIt's in the Open Siddur Open Source and Unicode Hebrew Font Pack: [http://opensiddur.org/tools/fonts/](http://web.archive.org/web/20150317114216/http:/opensiddur.org/tools/fonts/ \"http://opensiddur.org/tools/fonts/\")\n\n"
    },
    {
      "time": "9 Jun 2014 — 6:11pm",
      "content": "I have seen a copy of the Divine Name, but no font with such a character. I would be interested to know more about this. Alternatively, has anyone seen השׁם under the ה?\n\n ![](http://web.archive.org/web/20150317114216im_/http:/typophile.com/files/LORD%20Lord_4586.jpg)\n\n"
    },
    {
      "time": "10 Jun 2014 — 4:03am",
      "content": "With digital fonts, I see no need of a special compound character; what you need is a ה with the right width and the ability to position strings. With TeX based editors you can write אדני with a smaller font and use \\kern to move it where you want.\n\n ![](http://web.archive.org/web/20150317114216im_/http:/typophile.com/files/longhe_4269.png)\n\n"
    },
    {
      "time": "23 Oct 2014 — 6:11pm",
      "content": "Thank you, Michel.\n\nHowever, a TeX based solution is simply not practical while preparing Jewish liturgical texts in word processing applications that already conveniently support BIDI, RTL and Hebrew text with proper diacritic positioning (such as LibreOffice).\n\nDavkaWriter's proprietary (non-Unicode) fonts provide such a glyph. From what I've seen it's always addressed at U+00E6 (Latin Small Letter Ae).\n\nWhat's needed is an open source Unicode Hebrew font with such a ligature in its Private Use Area.\n\n[http://opensiddur.org/wp-content/images/yichud-hey.png](http://web.archive.org/web/20150317114216/http:/opensiddur.org/wp-content/images/yichud-hey.png)\n\nAbove is an example from the font KerenG found in its character table at 0x8DFD.\n\n"
    },
    {
      "time": "24 Oct 2014 — 2:44am",
      "content": "> What's needed is an open source Unicode Hebrew font with such a ligature in its Private Use Area.\n\nActually, if it's indeed a ligature shouldn't it be treated as such using the appropriate Opentype feature?\n\n"
    },
    {
      "time": "22 Nov 2014 — 10:39am",
      "content": "Say more, please, riccard0. What is the appropriate OpenType feature?\n\n"
    },
    {
      "time": "24 Oct 2014 — 10:46am",
      "content": "I’m probably the last person on Typophile that can give advice on OpenType features…  \nBut from what I understand, there are features like Historical Ligatures (hlig) and Historical Forms (hist) which can be better suited for giving access to such glyphs, rather than adding them in the PUA (also ensuring the readability of the text in case a different font is used).  \nI know of two primers on OpenType features:  \n [http://ilovetypography.com/OpenType/opentype-features.html](http://web.archive.org/web/20150317114216/http:/ilovetypography.com/OpenType/opentype-features.html \"http://ilovetypography.com/OpenType/opentype-features.html\")  \n [http://opentypecookbook.com](http://web.archive.org/web/20150317114216/http:/opentypecookbook.com/ \"http://opentypecookbook.com\")  \nBut for any further technical questions, the best place is probably the Build section of this forum: [http://typophile.com/forum/6](http://web.archive.org/web/20150317114216/http:/typophile.com/forum/6 \"http://typophile.com/forum/6\")\n\n"
    },
    {
      "time": "22 Nov 2014 — 10:40am",
      "content": "Thank you!\n\n"
    }
  ]
}
