{
  "id": "107628",
  "title": "Bauhaus-style geometric sans from 1970's",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": "The attached image is my own rough rendering of some text I am trying to match. I traced this as the source image was not good enough for ID purposes. I'd like to track down the name of the original typeface - after endless searching it appears there is no modern, digital version of this.\n\n ![](http://web.archive.org/web/20150422054746im_/http:/typophile.com/files/ob1_4821.png)\n  \nIt shares properties with other Bauhaus-style geometric sans serif display faces, such as ITC Bauhaus, Blippo, Ronda etc. It comes closest to Harry from Red Rooster (but with ITC Bauhaus-style M and N) or Linotype Horatio (again with different M N R). Perhaps the original was one of the aforementioned, but using alternates not carried over into the digital version?\n\nHelp with original name, designer or foundry welcome.\n\n| Attachment | Size |\n| --- | --- |\n| [ob1.png](http://web.archive.org/web/20150422054746/http:/typophile.com/files/ob1.png) | 7.03 KB |\n\n",
  "author": "osamu",
  "time": "14 Dec 2013 — 2:42am",
  "uid": "215937",
  "comments": [
    {
      "time": "16 Dec 2013 — 12:19pm",
      "content": "Bumping. Is there no one with any 1970's specimen books or ideas on this?\n\n"
    },
    {
      "time": "22 Dec 2013 — 2:48am",
      "content": "Given the lack of responses I'm guessing those of you who took a stab at this ended up as confused as I was - but I think I've actually located it!\n\nThis appears to be Blippo Bold, a somewhat rare weight of this iconic typeface, but take a look at the specimen over at the [Bowfin Printworks Bauhaus pages](http://web.archive.org/web/20150422054746/http:/bowfinprintworks.com/BauhausFaces6.html). As noted on that page, and in a [previous thread here](http://web.archive.org/web/20150422054746/http:/typophile.com/node/33443) and [also here](http://web.archive.org/web/20150422054746/http:/typophile.com/node/97547), there is a modern digitization from FontBank called [Brandish](http://web.archive.org/web/20150422054746/http:/luc.devroye.org/FontBank--Brandish--1993.jpg) (though I can't find a licensed, paid version of this for sale anywhere).\n\nBrandish does not include the regular S, only the alternate, which is disappointing. And regarding the difference in the R (my rendering had a rounded top corner on the stem) - that is probably my mistake in interpreting the low resolution, distorted sample I had.\n\n"
    }
  ]
}
