{
  "id": "107663",
  "title": "Theory Serif",
  "forum": "Serif",
  "tags": [
    "antiqua",
    "rennaissance",
    "serif",
    "Serif"
  ],
  "content": "I’d like to introduce you to my new typeface, Theory Serif. If all goes as planned, this will be the foundation to a Serif, a Sans and a Monospace family.\n\nWith the revival of long-form journalism on the Web and on mobile devices, I wanted to create a typeface that provides a pleasant and streamlined reading experience on screen.\n\nThis is work in progress, but now I feel the Regular version of the font is ready for the public. Please feel free to criticize and share your ideas.\n\n ![](http://web.archive.org/web/20150414095805im_/http:/typophile.com/files/Pt%201_5871.png)\n  \n\n ![](http://web.archive.org/web/20150414095805im_/http:/typophile.com/files/Pt%202_4593.png)\n  \n\n ![](http://web.archive.org/web/20150414095805im_/http:/typophile.com/files/Pt%203_4839.png)\n  \n\n ![](http://web.archive.org/web/20150414095805im_/http:/typophile.com/files/Pt%204_5482.png)\n  \n\n ![](http://web.archive.org/web/20150414095805im_/http:/typophile.com/files/Pt%205_6320.png)\n\n_(For a closer view, please have a look at the attached PDF.)_\n\n| Attachment | Size |\n| --- | --- |\n| [Introducing Theory Serif.pdf](http://web.archive.org/web/20150414095805/http:/typophile.com/files/Introducing%20Theory%20Serif.pdf) | 358.66 KB |\n\n",
  "author": "Core0",
  "time": "16 Dec 2013 — 6:48am",
  "uid": "181047",
  "comments": [
    {
      "time": "16 Dec 2013 — 6:56am",
      "content": "Unfortunately it is still not possible to edit a post, so I cannot correct the cut-off images. Very annoying; it destroys the first impression. If you want to see the images in full size, just open them in a new tab. On a funnier note: I was coughing while typing “renaissance”, hence the second n in the tags. That too cannot be corrected.\n\nWhy comments can be changed and posts cannot, is beyond my understanding.\n\n"
    },
    {
      "time": "16 Dec 2013 — 9:55pm",
      "content": "The capital V strikes me as narrow. Beyond that, I can only say I'm impressed.\n\n"
    },
    {
      "time": "17 Dec 2013 — 3:52am",
      "content": "Thank you, cerulean. The V was a bit tight, I had felt that too but hadn’t corrected it until now.\n\n"
    },
    {
      "time": "17 Dec 2013 — 9:12am",
      "content": "I am not a font designer. Theory looks good to me, too. In \"Morning News\" the space between the r and n looks small. It may look more like \"Moming News\" at text size. (Unless it was hand kerned for this graphic.)\n\n"
    },
    {
      "time": "17 Dec 2013 — 1:33pm",
      "content": "J. Tillman, thanks for your quick review. The test words were spaced tighter in large sizes and regular in small sizes. I think “Morning News” was set with -2 in Sketch, and yes, it appears close, but it would be not as tight in a regular setting for body text.\n\n"
    },
    {
      "time": "17 Dec 2013 — 1:45pm",
      "content": "To my eye the /N/ seems too wide, and I wish its upper left corner related more clearly to /M/'s. Top terminals of /C/ and /G/ and both of /S/ look like they could stand more weight. Dollar sign is too dark. Was it intentional to have the upper bowl of /g/ not come up to the meanline? I would definitely align the bowl, rather than the ear, with the meanline.\n\n"
    },
    {
      "time": "17 Dec 2013 — 3:41pm",
      "content": "Eliason, thanks for your comments. The typeface was optimized for the screen experience as text, not necessarily as titles. This means I made concessions and adjustments based on the impression in small sizes (a pixel height that gives an impression of what would be 10 to 14 points in print). I am considering a Display version, but if I would make one, it would be at the far end of the project.\n\nI thought the glyph N was roughly within roman Antiqua proportions, but it seems a tad too wide. The left shoulder has been deliberately designed differently than the M shoulders, for better rendering in small sizes.\n\nI went with a classic dollar sign instead of removing the inner lines, as some recent typeface designs have introduced. I’ll revisit the dollar sign’s look, especially in small sizes.\n\nI will revisit the lowercase g as well. I liked the slightly oval upper bowl and expanding it to the top will probably make it rounder. I’ll see how that goes.\n\n"
    },
    {
      "time": "17 Dec 2013 — 6:56pm",
      "content": "This looks extremely similar to Eben Sorkin's [Merriweather](http://web.archive.org/web/20150414095805/http:/www.google.com/fonts/specimen/Merriweather).\n\nWhat's your licensing plan? I hope you will publish it under a [free software license](http://web.archive.org/web/20150414095805/http:/www.gnu.org/philosophy/free-sw.html).\n\n"
    },
    {
      "time": "18 Dec 2013 — 3:55am",
      "content": "I think you really need more weight in the /r/ terminal, the /T/ has too short unilateral serifs at sides of the bar, serifs at /s/, /S/, /z/, /Z/, /c/, /C/, /G/ and right serifs at /E/, /F/ would need some xtra volume (lenght) too (as eliason wrote). I would recommend to make the right side of the bottom serif longer at /F/, /P/,/f/ and /r/ to add more visual stability to the letters. And the swash at /Q/ could be a little thicker, at least in comparison with the /f/ terminal.\n\nJan\n\n"
    },
    {
      "time": "18 Dec 2013 — 4:32am",
      "content": "MDrucker, Eben Sorkin’s Merriweather has quite a different character and glyph proportions. There are also differences in details, like the closing stroke in shapes of a, d, p, b, etc. Look at how the incoming stroke meets the main stem in the lowercase a (bottom curve). The main characteristic of Theory Serif is probably the proportion of the glyphs, which tends to be wide, like with Sabon or Plantin.\n\nI am not sure if I can complete everything I had in mind, but my plans include a complete Serif family, a Sans Serif family as well as a Monospace family. The Serif would include Regular, Italic, Bold and Bold Italic, but the Sans and Monospace families would additionally include Medium, Black and Light versions.\n\nIt is likely that I’ll make Theory Serif Regular and Italic available under Google fonts, the bold versions can be licensed commercially. The same could be done with other families of the series.\n\n"
    },
    {
      "time": "18 Dec 2013 — 4:44am",
      "content": "Thanks, yaneczech, for your comments on the serifs. This point has been addressed numerous times since I started working on the font and I believe it is a characteristic, a style of this typeface that I don’t want to homogenise too much. I don’t intend to mimic Sabon and other Garamonds, I want to create a modern one, more minimalist and reducing serifs to a minimum. My origin with this design, the starting point, was the idea to have as little and minimal down- or up-pointing serifs as possible. The endings of E, F middle strokes were just enforced, they don’t have serifs for this reason. I improved the down- and up-pointing serifs while working on the font, but because it is meant for screen reading, I don’t want to accentuate them more.\n\nThe weight or volume of the top terminals of C, G and S have been slightly increased, following elian’s advice, but the length of the serif has not been changed.\n\nAs for the lowercase r, did you look at it in the word ‘Theory’ or in the alphabet? The combination “ry” is a ligature in ‘Theory’.\n\n"
    },
    {
      "time": "18 Dec 2013 — 4:55am",
      "content": "I have made changes to the glyphs C, G, E, F, S, g and $. You can have a look at the [new PDF here](http://web.archive.org/web/20150414095805/http:/core-ux.com/material/Introducing-Theory-Serif-2.pdf).\n\n"
    },
    {
      "time": "19 Dec 2013 — 2:39am",
      "content": "Actually, my point was in unifying of serifs to keep more shape consistency, not to copy other styles. For me there are two different serif types. For instance your /i/ letter has relatively distinctive serifs, both top and bottom. On the other hand, the /s/ letter has rather triangular serifs – the connection is much more smooth, at least in smaller sizes it appears so, and they lack of spurs (unlike /z/, /T/, /E/...).  \nThe /r/ letter is problematic because of its empty space underneath the terminal. To make it more balanced and legible I would suggest to enlarge the terminal a bit (and maybe moving the connection to stem slightly down). To that /r\\_y/ ligature: I'm not sure if it is necessary to create ligatures for these cases. I think it would be better to make one version, something like an average of the original /r/ and that one from the ligature.  \nHave you tried the typeface with different rasterizers in small sizes already? (e.g. in Photoshop)  \nOtherwise it looks nice, I like /N/ and /eszett/. :)\n\n"
    },
    {
      "time": "19 Dec 2013 — 8:40am",
      "content": "Yes, Jan, I have tried it in different sizes. I appreciate your detailed explanations and recommendations.\n\nTo explain my conceptual (and visual) idea, I think of the serifs as two dimensions: – |\n\nBecause this typeface was designed for screen first, I tried to shave off as much as possible from the vertical serifs in every instance, so this would affect the glyphs C, G, F, E, S, etc. in the uppercase range and c, s, etc. in the lowercase range. I then “worked my way up” steadily expanding these serifs to the point where I felt “this is just enough”, trying to avoid to make them more distinct. This is of course tricky, because such details are important character influences. I think there are three serif types in Theory Serif, because the curved terminals are different than the ones in the lowercase i, but they are consistent throughout all curved terminals throughout the font.\n\nThere was also a weight problem: terminals with no distinctive vertical serif looked too light, the glyph was unbalanced. So adding weight (broadening the respective serifs) helped, and that is easier with curved letters, like the upper terminal of c, s, etc.\n\nAs for the lowercase r—I had changed the flag to be a match with the flag in the lowercase f. This was on recommendation of Claus Eggers Sørensen and Vernon Adams. I quite like it now and if I bend it down a little (to make it more distinctive, as you write) I need to change its unique shape. I found this an elegant solution that renders nicely on screen.\n\nGiven your advice, I have already visited the shapes of E, F, C, G, S, and let the serifs end on the same height level. I adjusted their weight as well for the reasons I just laid out.\n\n"
    },
    {
      "time": "19 Dec 2013 — 4:19am",
      "content": " ![](http://web.archive.org/web/20150414095805im_/http:/typophile.com/files/Screen%20Shot%202013-12-19%20at%2013_6230.16.55.png)\n\nJan, the black outline shows the new, refined shape of the lowercase r. Underneath you see the old shape (green) as well as the previous shape from an older version (I keep the last generation in the mask layer).\n\n"
    },
    {
      "time": "19 Dec 2013 — 4:54am",
      "content": "Here is a text rendering test I made this morning, after the applied changes, using ReadKit (a RSS newsreader) and an article from The Guardian:\n\n ![](http://web.archive.org/web/20150414095805im_/http:/typophile.com/files/text-rendering_5623.png)\n\n"
    },
    {
      "time": "21 Dec 2013 — 3:10pm",
      "content": "An update of the PDF can be found here:\n\n[http://core-ux.com/material/Introducing-Theory-Serif-2.pdf](http://web.archive.org/web/20150414095805/http:/core-ux.com/material/Introducing-Theory-Serif-2.pdf \"http://core-ux.com/material/Introducing-Theory-Serif-2.pdf\")\n\n"
    },
    {
      "time": "6 Feb 2014 — 6:02am",
      "content": " ![](http://web.archive.org/web/20150414095805im_/http:/typophile.com/files/Specimen-Theory-Serif-14-02-07-850px_6153.png)\n\nDevelopment of the Regular cut of Theory Serif is close to completion. I am currently working on accents and glyphs in Greek and other languages.\n\nThe typeface has seen a complete redesign of most characters, particularly the serifs, with glyph width, stroke width, all numbers have been redesigned and more kerning pairs were added (including numbers, punctuation and space kerning).\n\nThere has been extensive testing with screen reading in various resolutions. I am using ReadKit (a Mac RSS reader app) to do most of the testing. This typeface was primarily designed for on-screen reading. You can always see the font in action on my website ( [http://core-ux.com](http://web.archive.org/web/20150414095805/http:/core-ux.com/ \"http://core-ux.com\")). It’s the body font throughout the site.\n\nThe next step will be the design of an Italic cut, which will probably take another couple of months, followed by bold versions. When all four are completed, I may add old style figures, but I first have to learn how to add them as an Open Type choice within the same font.\n\n"
    },
    {
      "time": "6 Feb 2014 — 9:30am",
      "content": "It has some nice features.  \nGood luck with it.\n\nhhp\n\n"
    }
  ]
}
