{
  "id": "107708",
  "title": "Clear Sans, a free typeface from Intel under the Apache License",
  "forum": "General Discussions",
  "tags": [
    "#free",
    "General Discussions"
  ],
  "content": "This neat font has eight styles. It can be downloaded [here](http://web.archive.org/web/20150123211642/http:/www.fontsquirrel.com/fonts/clear-sans).\n\n| Attachment | Size |\n| --- | --- |\n| [ClearSans.png](http://web.archive.org/web/20150123211642/http:/typophile.com/files/ClearSans.png) | 100.76 KB |\n\n",
  "author": "MDrucker",
  "time": "17 Dec 2013 — 6:59pm",
  "uid": "215017",
  "comments": [
    {
      "time": "18 Dec 2013 — 2:30pm",
      "content": "A prime example of a mega-corporation not being very original. Too din-esque imo.\n\n"
    },
    {
      "time": "19 Dec 2013 — 3:20pm",
      "content": "As I understand it, becoming conservative comes with becoming a megacorp. Can't bet the farm anymore on the new thing being a fad or the future.\n\nEdit: IMAO, there's more Transport than DIN in it.\n\n"
    },
    {
      "time": "19 Dec 2013 — 4:03pm",
      "content": "There are already typefaces named Clear Sans™ and Clearview®.  \nWhat is the status of these trademarks?\n\n"
    },
    {
      "time": "20 Dec 2013 — 10:34am",
      "content": "\\>What is the status of these trademarks?\n\nIt isn't clear.\n\n"
    },
    {
      "time": "20 Dec 2013 — 1:20pm",
      "content": "LOL!\n\n"
    },
    {
      "time": "21 Dec 2013 — 11:55am",
      "content": "Since they designed it to reduce ambiguity, why didn't they go a small extra step and also reduce ambiguity under reflection, so that it would be useful for dyslexics?\n\nPerhaps what is needed though are new shapes for the letters, like these\n\n ![](http://web.archive.org/web/20150123211642im_/http:/typophile.com/files/newlet_5970.gif)\n\nwhich could be applied to all fonts and eventually all printed material in the Latin alphabet.\n\nOf course, while this change is being made, there might be pressure to also change the lowercase and uppercase forms of the letter \"K\" to reduce suicidal thoughts...\n\n"
    },
    {
      "time": "21 Dec 2013 — 9:21pm",
      "content": "Or they could re-introduce the Fraktur k -- which looks upside down. ...  \nDon\n\n"
    },
    {
      "time": "22 Dec 2013 — 3:51pm",
      "content": "\\> reduce ambiguity under reflection, so that it would be useful for dyslexics?\n\nPopular belief notwithstanding, I have seen no evidence that this is an actual problem for dyslexics in reading (as opposed to in writing). Indeed, the failure of typefaces, designed with this notion in mind, to perform any better for dyslexics than common off-the shelf typefaces, would seem to be reasonably good evidence to the contrary.\n\n"
    },
    {
      "time": "22 Dec 2013 — 9:10pm",
      "content": "@donshottype:  \n<cite>Or they could re-introduce the Fraktur k -- which looks upside down.</cite>\n\nIt took a quick search to determine which Fraktur k you were referring to. Some typefaces, billed as Fraktur, use a k that looks ordinary; most of the ones I saw had the top part of the K-like portion of the k looped as in handwriting.\n\nBut more authentic Fraktur typefaces showed up on Luc Devroye's web site.\n\nStart with a lowercase t. But instead of the letter coming to a point at the top, put serifs there similar to those at the top of the lowercase l.\n\nAnd then the crossbar: instead of having a curve from the left end of the crossbar going up to the top of the letter, filled in with black, have an upward-sloping curved line that sweeps upward, crosses the vertical of the t, and then sweeps downward.\n\nThe shape is, of course, unfamiliar and unrecognizable to readers used to the Roman alphabet. My initial impression was of an r standing on top of a t. But at least it has historical roots, and can be adapted to Roman style faces.\n\nHere's an image of t, l, and k in one authentic Fraktur face:\n\n ![](http://web.archive.org/web/20150123211642im_/http:/typophile.com/files/kver_4290.jpg)\n\nhowever, in this one, the sloping line, instead of just curling down, becomes a loop; still, most of my description is illustrated.\n\n"
    },
    {
      "time": "23 Dec 2013 — 2:44am",
      "content": "Hi John. Here is a bevy of Fraktur upside down k's. In sequence, they are Claudius, Kleist, Justus, Euclid, Leibniz, Luthersche, Walbaum, & Zentenar.\n\n ![](http://web.archive.org/web/20150123211642im_/http:/typophile.com/files/k@cClaudiusKleistJustusEuclidLeibnizLutherscheWalbaumZentenar_3931.jpg)\n  \nJust a sample of the many ways to draw your upside down loop.  \nDon \n"
    },
    {
      "time": "23 Dec 2013 — 4:52am",
      "content": "And here is one without a loop:  \nWittenberger Fraktur\n\n ![](http://web.archive.org/web/20150123211642im_/http:/typophile.com/files/k@Wittenberger_5273.jpg)\n  \nDon \n"
    },
    {
      "time": "23 Dec 2013 — 5:26am",
      "content": "At least I didn't imagine that form of the letter; now, the results Google brings up are of the looped form, and I can't find much in the way of good examples of the one I saw.\n\n"
    },
    {
      "time": "23 Dec 2013 — 9:13pm",
      "content": "For my first post, I posted a thread about the availability of a new typeface I liked. It turned into a discussion on Fraktur letters. Not a good way to start my experience on this website.\n\n"
    },
    {
      "time": "24 Dec 2013 — 3:42am",
      "content": "Good point Mortimer. I started a new thread \"Using Fraktur k as model for upside down k\"  \n [http://typophile.com/node/107814](http://web.archive.org/web/20150123211642/http:/typophile.com/node/107814 \"http://typophile.com/node/107814\")  \nIf there is any more discussion of this topic it can go there rather than here.  \nDon\n\n"
    },
    {
      "time": "24 Dec 2013 — 6:16am",
      "content": "Well, @MDrucker, that's topic drift to ya... Ah, rice pudding with cherry sauce. And an almond.\n\n"
    },
    {
      "time": "17 Jan 2014 — 6:56am",
      "content": "_There are already typefaces named Clear Sans™ and Clearview®._\n\nIt seems that Clear Sans from Intel was released before Clear Sans from Positype, and in any case, I'm not sure 'Clear Sans' will become an ® because its too generic.\n\nClearview seems different enough from Clear Sans to not cause any confusion.\n\n"
    },
    {
      "time": "17 Jan 2014 — 10:48am",
      "content": "I'm just delighted this is under Apache, not some hippie \"you can't make money if I don't feel like making money\" license.\n\nhhp\n\n"
    },
    {
      "time": "18 Jan 2014 — 8:38pm",
      "content": "If you mean the OFL, that one comes from a Christian organisation. Possibly the closest to a hippie licence is the BSD type (the B stands for Berkeley in California), and that one could hardly care less if you productise the material. Bells, Microsoft's TCP/IP protocol stack is rumoured to have come right out of BSD Unix.\n\n"
    },
    {
      "time": "19 Jan 2014 — 7:08pm",
      "content": "I presume that by a \"hippie license\" he means licenses like the GPL. The restriction in the GPL, though, is not intended to be dog in the mangerish, or anti-capitalist (despite Richard Stallman occasionally engaging in rhetoric of a sort as to give rise to Hrant's comment).\n\nInstead, it's so that one can't make a slight, obvious improvement to a GPL program, copyright the result, and thereby hobble the free version of that program by preventing it from implementing the same improvement.\n\nAs for Clear Sans, given that its intended purpose is to be a typeface for _user interfaces_, it had better be conservative, because who would want to work all day on a computer screen where everything is written in an idiosyncratic typeface?\n\n"
    }
  ]
}
