{
  "id": "107759",
  "title": "HELP!!! DANGER! MAN OVERBOARD! HELP!!!!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "If you need me to prove anything I write here,  \nI can do so.\n\nI am looking for certain fonts for personal,  \nnon-commercial use. I am not a designer.  \nI am not an artist. I do not offer anything  \nI create on my computer for sale.\n\nNor will I ever earn any money as a designer.\n\nI am not a student.\n\nI have no business. I am disabled, and receive  \nfood stamps. I hope someday soon to change  \nthis status.\n\nI draft personal letters. I am attempting  \nto get one of my business ideas or one of  \nmy ideas to better the world off the ground.\n\nI am just trying to promote myself, my  \nservices, and my ideas. Nothing I offer has  \nanything to do with design.\n\nI seek fonts to create brochures, flyers, and  \nbusiness cards for a one-man air conditioning  \nbusiness I hope to start, and possibly other  \nbusinesses I hope to start. I am not worried  \nanyone is going to sue me. I have no money,  \nand own nothing of value.\n\nI am just struggling to make enough money to  \neat and pay my rent.\n\nThis being the case, I am looking for fonts that  \nwill make my resume, and my promotions  \nstand-out.\n\nI use MS Word Home & Student 2010. This is  \nnot exactly the software a professional designer  \nwould use.\n\nI seek the following fonts: MinionPro, Myriad,  \nHelvetica, Frutiger, Univers, Mrs. Eaves,  \nGaramond Pro, Interstate, Gotham,  \nAvant Garde, Avenir, Futura, Akzidenz Grotesk,  \nOptima, Bembo, Din, Kabel, Officina, and  \nThesis, Sabon, Stone, Agenda, Cezanne,  \nDidot.\n\nI have never used these fonts, and I don't  \neven know what many of them look like.  \nI seek these fonts because in my research  \non fonts, I have come across these names  \nquite a bit as far as fonts I can use for the  \npurposes I wrote above.\n\nI wrote a book on air conditioning. Can you  \nrecommend a serif and non-serif font for the  \nbook? When I am ready to publish the book,  \nI may be able to buy these two fonts.\n\nCan you recommend a font for business letters  \nthat would impress others?\n\nI do my own legal work. Can you recommend  \na font for motions and briefs?\n\nI have a high IQ, and a lot of talent. I should  \nbe able to support myself, but I also have  \nseveral crippling disabilities.\n\nAny help you can give me would be  \nappreciated.\n\nThank you very much.\n\n",
  "author": "cyberflor",
  "time": "19 Dec 2013 — 12:20pm",
  "uid": "216384",
  "comments": [
    {
      "time": "19 Dec 2013 — 12:21pm",
      "content": "If you need me to prove anything I write here,  \nI can do so.\n\nI am looking for certain fonts for personal,  \nnon-commercial use. I am not a designer.  \nI am not an artist. I do not offer anything  \nI create on my computer for sale.\n\nNor will I ever earn any money as a designer.\n\nI am not a student.\n\nI have no business. I am disabled, and receive  \nfood stamps. I hope someday soon to change  \nthis status.\n\nI draft personal letters. I am attempting  \nto get one of my business ideas or one of  \nmy ideas to better the world off the ground.\n\nI am just trying to promote myself, my  \nservices, and my ideas. Nothing I offer has  \nanything to do with design.\n\nI seek fonts to create brochures, flyers, and  \nbusiness cards for a one-man air conditioning  \nbusiness I hope to start, and possibly other  \nbusinesses I hope to start. I am not worried  \nanyone is going to sue me. I have no money,  \nand own nothing of value.\n\nI am just struggling to make enough money to  \neat and pay my rent.\n\nThis being the case, I am looking for fonts that  \nwill make my resume, and my promotions  \nstand-out.\n\nI use MS Word Home & Student 2010. This is  \nnot exactly the software a professional designer  \nwould use.\n\nI seek the following fonts: MinionPro, Myriad,  \nHelvetica, Frutiger, Univers, Mrs. Eaves,  \nGaramond Pro, Interstate, Gotham,  \nAvant Garde, Avenir, Futura, Akzidenz Grotesk,  \nOptima, Bembo, Din, Kabel, Officina, and  \nThesis, Sabon, Stone, Agenda, Cezanne,  \nDidot.\n\nI have never used these fonts, and I don't  \neven know what many of them look like.  \nI seek these fonts because in my research  \non fonts, I have come across these names  \nquite a bit as far as fonts I can use for the  \npurposes I wrote above.\n\nI wrote a book on air conditioning. Can you  \nrecommend a serif and non-serif font for the  \nbook? When I am ready to publish the book,  \nI may be able to buy these two fonts.\n\nCan you recommend a font for business letters  \nthat would impress others?\n\nI do my own legal work. Can you recommend  \na font for motions and briefs?\n\nI have a high IQ, and a lot of talent. I should  \nbe able to support myself, but I also have  \nseveral crippling disabilities.\n\nAny help you can give me would be  \nappreciated.\n\nThank you very much.\n\n"
    },
    {
      "time": "19 Dec 2013 — 12:40pm",
      "content": "You're asking someone to provide you with commercial fonts to start a commercial air conditioning business.\n\nYou won't get much help on this site with that particular request.\n\nFWIW, there's plenty of good free typefaces available these days for commercial use. No need to use pirated typefaces if you're looking to save a buck.\n\n"
    },
    {
      "time": "19 Dec 2013 — 8:04pm",
      "content": "No I am not looking for commercial fonts, I am looking for standard common fonts for personal use, for many non-professional, non-commercial personal purposes that have nothing to do with commercial design or professional design except with regard my own personal business needs, and my own personal projects.\n\nIt is ridiculous to think that I would pay several thousand dollars for a font when I don't have money to pay for food. I am a perfectionist. I like my work to look the best I can make it. The last I heard fonts can not be copyrighted or patented in the US. Designers just want fonts to be expensive so they remain in their exclusive domain.\n\nThe biggest software pirate of all is Bill Gates. He stole DOS from Gary Kildall and Windows from Steve Jobs. He stole countless other software applications from countless other businesses. I don't see anyone criticizing Bill Gates for serial thefts. I guess that is because if you are a billionaire it is okay to steal software, but if you are starving and disabled it is immoral? Right?\n\nI would gladly pay a fair price for the fonts I seek for the use I seek. I guess those involved in selling those fonts really aren't interested in selling them to end users like myself for personal use. This encourages piracy.\n\nBy the way, I like the striking, simple, bold, modern, clean design of your avatar. I just noticed the D is identical to the A on its side. So, I guess you created the font yourself. Cute.\n\n"
    },
    {
      "time": "19 Dec 2013 — 8:31pm",
      "content": "_\" The last I heard fonts can not be copyrighted or patented in the US. Designers just want fonts to be expensive so they remain in their exclusive domain.\"_\n\n1. The font design cannot be copyrighted but the underlying code which makes up the font is. Designs can be patented but it is quite costly.  \n2. Designers make a pittance in most cases. Exclusivity has nothing at all to do with it.\n\nEvery single font you listed above is a commercial font and they are not \"free for personal use\". Never have been, never will be.\n\nFonts today don't cost \"several thousand dollars\", as you put it. The vast majority are less than $50.\n\nTypophile is definitely not the place to be asking for free commercial fonts. As another poster said, there are many free fonts available today, and some are excellent quality.\n\n"
    },
    {
      "time": "19 Dec 2013 — 10:01pm",
      "content": "\\> I am not a designer....  \n\\> I am looking for fonts that will make my resume,  \n\\> and my promotions stand-out.\n\nI'm a professional graphic designer, and my advice would be to just make good use of the fonts you already have on your computer. You don't need a bunch of new fonts to \"stand out\", you need simple, clean, easy-t0-read layouts that clearly communicate your qualifications and info about your company.\n\nMost small businesses that can't afford designers have awful-looking literature. Just use clean, simple, readable designs and you'll be fine.\n\nAnd as others have said, there are tons of free fonts available.\n\n"
    },
    {
      "time": "20 Dec 2013 — 12:28am",
      "content": "\\> The last I heard fonts can not be copyrighted or patented in the US.\n\nSomebody else already commented on copyright. Fonts are subject to design patent in the US. Heck, the very first design patent issued in the US was for a font, in 1842.\n\nFor more on the most prominent case in this field:  \nSee also: [http://en.wikipedia.org/wiki/Adobe\\_Systems,\\_Inc.\\_v.\\_Southern\\_Software,\\_Inc](http://web.archive.org/web/20141020182636/http:/en.wikipedia.org/wiki/Adobe_Systems,_Inc._v._Southern_Software,_Inc \"http://en.wikipedia.org/wiki/Adobe\\_Systems,\\_Inc.\\_v.\\_Southern\\_Software,\\_Inc\").  \n [http://directory.serifmagazine.com/Ethics\\_and\\_Law/Copyright/judgement.php4](http://web.archive.org/web/20141020182636/http:/directory.serifmagazine.com/Ethics_and_Law/Copyright/judgement.php4 \"http://directory.serifmagazine.com/Ethics\\_and\\_Law/Copyright/judgement.php4\")\n\n"
    },
    {
      "time": "20 Dec 2013 — 3:56am",
      "content": "Um, Guys, you're being trolled...\n\n"
    },
    {
      "time": "20 Dec 2013 — 6:28am",
      "content": "Sounds like you are asking for random fonts for random reasons, so...  \n [http://wiki.scribus.net/canvas/Where\\_can\\_I\\_get\\_good\\_fonts%3F](http://web.archive.org/web/20141020182636/http:/wiki.scribus.net/canvas/Where_can_I_get_good_fonts%3F)  \n [http://www.fontsquirrel.com/](http://web.archive.org/web/20141020182636/http:/www.fontsquirrel.com/)\n\nOh, and one thing: You won't find any warez d00dz on Typophile. What you will find are folk that can handcraft fresh fonts out of recycled beziers.\n\n"
    },
    {
      "time": "20 Dec 2013 — 12:14pm",
      "content": "@Té Rowan: Recycled beziers? Not true, not at all. I always use fresh ones.\n\n"
    },
    {
      "time": "20 Dec 2013 — 6:17pm",
      "content": "> I have a high IQ, and a lot of talent.\n\nAwesome!\n\n"
    },
    {
      "time": "21 Dec 2013 — 5:20pm",
      "content": "I think that we're pretty much in very similar situation. Except that: I'm NOT very talented and my IQ is just average (around 90-105). I may not be physically disabled, but man, I'm one of the MOST unluckiest people in the world. :(\n\nLike you, there are fonts that I seek too like: Compatil Exquisit, DTL Dorian, FS Sally, and Optima Nova. I don't just seek them. In fact, I crave for those stuffs so bad! And I can't even afford any of them, which sucks a big time for me.\n\nSo out of desperation, instead doing something like this, I have decided to do the other way around. To design a font for my personal typing and printing pleasure, as well as to somehow fill the gap.\n\nHere's my progress so far.  \nI'm yet to make the italic by next week (hopefully), so I can only show you the roman characters.\n\n![](http://web.archive.org/web/20141020182636im_/http:/i1288.photobucket.com/albums/b499/iamdead324/smpl-spcmn_zps5bbb2c05.jpg)\n\nThis is actually my second attempt, because my first one, which I made on May, this year(2013), is a complete disaster. XD\n\nIn text usage @ 48pt:\n\n![](http://web.archive.org/web/20141020182636im_/http:/i1288.photobucket.com/albums/b499/iamdead324/smpl-txt-1_zpsef032920.jpg)\n\n@ 72pt:\n\n![](http://web.archive.org/web/20141020182636im_/http:/i1288.photobucket.com/albums/b499/iamdead324/smpl-txt-2_zpsac105f42.jpg)\n\n@ 128pt:\n\n![](http://web.archive.org/web/20141020182636im_/http:/i1288.photobucket.com/albums/b499/iamdead324/smpl-txt-3_zps3bc63822.jpg)\n\nFor me, you don't need to be a specific person to do specific things. As long as you're willing to do it, then you can most likely find a way to make it. And do not be afraid to fail, for everybody has failures in life, especially the first time.  \nAnd in your case, since that you GOT a lot of talent, for the love of God, use it! You'll only live once, so don't let your talents rot in vain.\n\nNow, since that you have a very high IQ, I'm sure you already realized that people tend to buy useless stuffs just because they want it. Those impractical decisions for temporary satisfaction is a significant thing that makes us humans, is it not? :)  \nI don't think it's such a big issue if you sometimes set aside the essentials to buy something you want. It's impractical, yes, but not completely stupid, imo.\n\nSo if you have the chance to buy some of the fonts you seek, then go for it.\n\nBut I highly encourage you to attempt to make your own fonts. And it's also a privilege, because since you are the designer, you can make it fit perfectly to your own taste and style, without any kind of disrespect.\n\nI recommend TypeTool, but if you really don't want to throw a buck, you're still in luck. There is a font production software called \"FontForge\" which is absolutely free of charge!\n\nTrust me man. There's no harm in trying.\n\nThanks for reading, and sorry for the looooooooong post.\n\n- Nate\n\n"
    },
    {
      "time": "21 Dec 2013 — 9:16pm",
      "content": "Bizzare discussion.  \nMight indeed be a troll, or just misguided.  \nThere are many good quality fonts that are freely distributed by designers. With careful selection from them you can produce pretty good results. If you are looking for such fonts Dafont and Font Squirrel have a better record of purging pirated fonts than most other sites. A good way is to learn the names of designers who have produced good quality fonts for free distribution. For example check out the work of Claude Pelletier, Nick Curtis or Pablo Impallari.  \nI you really have a high IQ -- I doubt that I have -- you could learn to make fonts. It's nice to have a commercial program like FontShop, but far from essential.  \nMost font designers are far from rich. For every commercially successful font maker there are many \"starving artists.\" Stealing from them is an insult.  \nDon\n\n"
    },
    {
      "time": "22 Dec 2013 — 5:31am",
      "content": "> Might indeed be a troll, or just misguided.\n\nLet's see. He is -- or at least claims that he is  \n1. a genius,  \n2 .very talented, and  \n3. entitled to free stuff.\n\nThis is the internet. If he's misguided, he needs help well beyond what can be obtained here. But since this is the internet, it's 99 & 44/100 percent probable he's a troll.\n\nBesides, a genius would have figured out that displaying one's design talents would come from using type well, not selecting certain fonts.\n\n"
    },
    {
      "time": "22 Dec 2013 — 7:13pm",
      "content": "1. The last time I looked the Avenir font package cost several thousand dollars.\n\n2. I asked if any of you could recommend any fonts for certain specific applications.  \n2a. None of you answered even one of these questions.\n\n3. When someone downloads a font they would never buy because they  \n can't afford the font, no one loses one penny, and the world benefits.\n\n4. In any event, I am pretty sure I read somewhere the actual artists and  \n designers make very little money from the sale of their fonts. All the  \n money goes to people who exploit the creative talent of the actual  \n font designers.\n\n5. I doubt any successful designer would care that I used their font  \n for the purposes I intended to use them. I presume if they knew  \n me and knew my situation, they would permit me free use of their  \n font for the use I intended. If I had someway of contacting the  \n actual font designers, I would write them a letter and ask them  \n myself.\n\n6. I am not a designer, nor do I ever intend to become a designer.\n\n7. I went to all the foundries and asked if I could buy a package of  \n fonts I wanted for personal use at a reasonable cost, and they  \n were all pretty nasty. They had no interest in doing business with  \n me. None of these foundries makes these fonts available to the  \n public for personal use at a reasonable price.\n\n7. I am not familiar with the exact procedures people use to acquire  \n software or fonts that are normally sold. I will ask a friend of mine  \n who is an expert with computers to obtain the fonts I seek from  \n Pirate Bay or some other file sharing web site. I just visited Pirate  \n Bay, and it seems I can get all the \"commercial\" fonts for free not  \n just the ones I was looking for.\n\n8. I will make sure all the effort I put into this pursuit is not wasted.  \n It is ashame I am going to have to take this route. The more I  \n sour on humanity, the less I care about others.\n\n9. If the designers of successful commercial fonts really had a  \n conscience, they would help new designers get fairly compensated  \n for their efforts. All hugely successful font designers just care  \n about are themselves, or they would sponsor the creation of a  \n fairer system.\n\nI am not a material guy. If I had carried about making money, I could  \nhave been a wealthy a long time ago. All my life I have helped  \neveryone who has ever asked me for help. My not being able to earn  \na living now is not just hurting me, it hurts US taxpayers. I could paying  \ntaxes instead of having to rely on your taxes to pay my basic expenses.\n\nAt one point in my life, I could have discovered a cure for cancer or  \nmade a significant contribution to mankind's energy needs. But our  \nsociety makes it hard for talented people to realize their potential.\n\nHumans are a foolish species. They think life is a zero sum game.  \nInstead of trying to help each other, they seek to take advantage of  \neach other.\n\nAs far as fonts not being able to be copyrighted in the US, I believe that  \n\"MS Segoe UI\" is a knock-off Frutiger. Frutiger sued MS in Europe and  \nwon, but lost in the US because in the US fonts can't be copyrighted.\n\nSo, I wanted to know if their were high-quality knockoffs of the fonts  \nI listed.\n\nUS laws in general are designed to protect corporations and those  \nwho can afford lobbyists. US patent laws don't protect poor US  \ninventors. Bill Gates was able to rip-off Gary Kildall. John Pierpont  \nMorgan ripped-off the original Tesla and Westinghouse. The only  \npeople able to get justice in our legal system are people who already  \nhave money. Even the Wright Brothers were not able to benefit from  \ntheir discovery of the airplane. And you care about wealthy designers  \nwho wouldn't lose one penny from my personal use of their fonts?\n\nI am sorry I came here asking you for help. I won't be back. There  \nwas a time I would not have thought twice about risking my life to  \nhelp any human, or thought twice about giving the shirt off my back  \nto help anyone truly in need. Now as time passes, I can't stop myself  \nfrom inwardly smiling every time a fellow American is a victim of  \ncrime or suffers some loss.\n\nI am not happy with the person I am becoming. I wish I had a way  \nto stop it. It has nothing to do with no one here helping me with my  \nrequest. It has to to with the general nature of human beings today.\n\nI wish all of you the very best. I hope none of you ever run into  \nanyone like the person I may eventually become against my will.  \nI really hope I don't become that person, because that would be  \nthe opposite of everything I have fought for my entire life.\n\nOnce again, my reaction here has nothing to do with your lack of  \nof help. Fonts don't have that kind of importance to me. I won't  \nmiss them, if I don't get them. What bothers me is the selfish world  \nwe live in today; how no one is willing to help anyone else in desperate  \nstraits. Helping someone with fonts is a trivial, but even something  \nso little as help with fonts is hard to come by these days.\n\nI hope someday someone distributes all your precious commercial  \nfonts free so all members of the public have free use of them. After  \nseeking your help here, that is the feeling I come away with.\n\n"
    },
    {
      "time": "23 Dec 2013 — 1:57am",
      "content": "There are enough genuinely-free fonts about that one can go for years without commercial fonts. I can only assume you ignored the links I gave, preferring to drift on down the River Styx.\n\n"
    },
    {
      "time": "23 Dec 2013 — 10:19am",
      "content": "\\> 1. The last time I looked the Avenir font package  \n\\> cost several thousand dollars.\n\nYou can buy a set of 12 Avenir fonts (ranging in weight from light to heavy) for $298.  \n [http://www.myfonts.com/fonts/linotype/avenir/](http://web.archive.org/web/20141020182636/http:/www.myfonts.com/fonts/linotype/avenir/ \"http://www.myfonts.com/fonts/linotype/avenir/\")\n\n ![](http://web.archive.org/web/20141020182636im_/http:/typophile.com/files/avenir_5558.jpg)\n\nThe price you saw may have been a license for multiple users, like a corporation might buy.\n\n"
    },
    {
      "time": "23 Dec 2013 — 10:43am",
      "content": ".\n\n"
    },
    {
      "time": "23 Dec 2013 — 1:34pm",
      "content": "> Humans are a foolish species.\n\nCould be. However, if you're not human, likely you could get more satisfactory responses from your own species.\n\nAnother human failing is separating many things into \"us\" versus \"them.\" Moreover, \"us\" and \"them\" constantly form and reform as the topic changes. If you're from a species that has moved beyond such arbitrary classifications, good fortune to you -- though you're already quite far along the line of good fortune if you've moved beyond us versus them.\n\nYet that assumption makes your bitter, puerile attack hard to understand...\n\n"
    },
    {
      "time": "25 Dec 2013 — 9:33pm",
      "content": "The posts from \"cyberflor\" remember me those from Gustavo, a young guy who came here asking for free fonts about two years ago. As expected, he received negative feedback from us and begun to attack everybody mixing nonsense arguments and unpolite vocabulary. Gustavo came back some months later using another nickname but causing similar confusion. Both these accounts were closed. If cyberflow is not the same person, he/she is surely following Gustavo's behavior manual. Anyway, it is clear that logic does not work in these kind of thread.\n\n"
    }
  ]
}
