{
  "id": "107973",
  "title": "Condensed humanist serif off the cover of Lenin in Zurich",
  "forum": "Home",
  "tags": [
    "Serif"
  ],
  "content": " ![](http://web.archive.org/web/20150417112901im_/http:/typophile.com/files/lenin_3694.jpg)\n\nAny help would be much appreciated!\n\nCheers,  \nMax\n\n",
  "author": "ryanxam",
  "time": "3 Jan 2014 — 2:49am",
  "uid": "216611",
  "comments": [
    {
      "time": "3 Jan 2014 — 5:40am",
      "content": "It looks like a modified/compressed form of **[Poppl Laudatio](http://web.archive.org/web/20150417112901/http:/www.findmyfont.com/index.php/fonts/font-preview?fset=Berthold&ffam=Poppl-Laudatio%20BQ%20-%20Condensed%20Medium&fid=3412a02379d8c05d5ae21500cfe3e06c&fsize=60&text=Lenin%20in%20Zurich%20SOLZHENITSYyN&wrap=2)** by Berthold\n\n"
    },
    {
      "time": "3 Jan 2014 — 6:18am",
      "content": "Very similar, but I don't think it can be a version of Laudatio as I don't think it was around in 1976 when this version was originally published. Could easily be wrong though.\n\nI've been trying to figure it out for a while now and I can't tell if it's an existing or custom typeface. There are some very small differences between some of the characters but that could be down to flaws in the photosetting process as they are very small...\n\n"
    },
    {
      "time": "3 Jan 2014 — 7:21am",
      "content": "As far as I can determine the first use of this cover was in the Bodley Head first edition in 1976. This suggests lettering or a photo lettering font, probably not digitized.  \nFriedrich Poppl (1923-1982) had a background in calligraphy and designed a font for Bethold in 1982, sold as Laudatio, which is similar. It is plausible that the Bodley Head drew on some earlier work by Poppl, either directly or via a photo lettering company.  \nI tried to duplicate the title by tinkering with Laudatio BQ Medium, but compression [70%] yields only:\n\n ![](http://web.archive.org/web/20150417112901im_/http:/typophile.com/files/PopplLaudatioCondMed70pct_4869.jpg)\n  \nwhich is rather different, particularly the lowercase -- not square enough, x-height too low etc. For ease of reference I have included the lowercase y which has some similarity to the Y in the cover letters.  \nDon \n"
    }
  ]
}
