{
  "id": "107958",
  "title": "German Art Deco Epigraphic",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Recently I came across a delicate Art Deco lettering at a prominent building in the city of Leipzig, which has been re-constructed:\n\n ![](http://web.archive.org/web/20150417150635im_/http:/typophile.com/files/RIMG0487_1sw_6033.jpg)\n\n“Untergrundmesshalle” means Underground Trade Fair Hall. It is from 1924, appearently it was the world’s first underground building of this kind.  \n\\_\n\nI couldn’t resist.\n\nI think this may be coming out soon:\n\n ![](http://web.archive.org/web/20150417150635im_/http:/typophile.com/files/schild-grund-5_3768.png)\n\n",
  "author": "Andreas Stötzner",
  "time": "2 Jan 2014 — 8:49am",
  "uid": "17347",
  "comments": [
    {
      "time": "2 Jan 2014 — 5:43pm",
      "content": "Works for me.  \nMost Art Deco fonts are heavy and/or straight-jacketed into a conventional \"Art Deco\" formula. This is a light and refreshing design that suggests a future of thechnological progress and achievements.  \np.s. Happy you have not left Typophile.  \nDon\n\n"
    },
    {
      "time": "3 Jan 2014 — 3:37am",
      "content": "Thanks, Don.\n\n\\> you have not left Typophile\n\nthis is a tester. I would be glad if Typophile would NOT vanish.\n\n"
    },
    {
      "time": "11 Jan 2014 — 4:12pm",
      "content": "What Don said, except that I feel the |a| needs a bit more air at the top counter.  \nIs Lipsia Italian for Leipzig?\n\n"
    },
    {
      "time": "12 Jan 2014 — 1:07am",
      "content": "LIPSIA is the Latin Name for Leipzig. As such it is the proper and usual form in Italian and Spanish, in Portugese its Lípsia. The actual French/English form is Leipsic, rather unusual nowadays.\n\n"
    },
    {
      "time": "12 Jan 2014 — 4:24am",
      "content": "Curiously, in Brazil Lípsia is never used. The city is referred simply as Leipzig. Except for Hamburg (Hamburgo), München (Munique) and Köln (Colônia), German cities are identified by its original names in Brazilian Portuguese.\n\n"
    }
  ]
}
