{
  "id": "108060",
  "title": "Corel Draw: Open Type fonts bundles since which version?",
  "forum": "Release",
  "tags": [
    "CorelDRAW",
    "OpenType",
    "Release"
  ],
  "content": "In the [Font Starter Packs](http://web.archive.org/web/20150414201859/http:/typophile.com/node/30047) thread I read that Corel Draw comes bundled with a collection of quality fonts. It is written as well that \"Newer versions are in Open Type TTF\", but I could not find any information neither on the net nor in this forum which version this starts with.\n\nSo my question would simply be: Which is the oldest version of Corel Draw that I could buy for the good fonts alone? And just for clarification: How big is the quality difference between the older TTFs and the newer OpenType TTFs? And when and how would I notice it?\n\n",
  "author": "mamibe",
  "time": "7 Jan 2014 — 5:05am",
  "uid": "209652",
  "comments": [
    {
      "time": "7 Jan 2014 — 6:12am",
      "content": "I think I solved it: Starting with X3, Corel ships with OpenType fonts.\n\nIn Corel Draw 12, it still includes only \"1,000 TrueType and Type 1 fonts\" ( [http://web.archive.org/web/20050502104839/http://www.corel.com/content/p...](http://web.archive.org/web/20150414201859/http:/web.archive.org/web/20050502104839/http:/www.corel.com/content/pdf/cdgs12/CDGS12_vs_Adobe_Illustrator_matrix.pdf \"http://web.archive.org/web/20050502104839/http://www.corel.com/content/pdf/cdgs12/CDGS12\\_vs\\_Adobe\\_Illustrator\\_matrix.pdf\")), whereas in X3 it says \"1,000 OpenType fonts\" ( [http://hexus.net/tech/items/software/4423-corel-introduces-coreldraw-gra...](http://web.archive.org/web/20150414201859/http:/hexus.net/tech/items/software/4423-corel-introduces-coreldraw-graphics-suite-x3/ \"http://hexus.net/tech/items/software/4423-corel-introduces-coreldraw-graphics-suite-x3/\")).\n\nIt's still possible that 12 already comes with OpenType fonts, but it's unlikely that Corel would not have included that in their marketing material.\n\n"
    },
    {
      "time": "8 Jan 2014 — 5:10am",
      "content": "Don't get too exited by the name Open Type in this case: The fonts are basically the same as the windows truetype fonts that came earlier versions, they have no special open type features like number styles, smallcaps, swashes (a few font families have such features, but all in seperate fonts).\n\n"
    }
  ]
}
