{
  "id": "108075",
  "title": "Small Caps & the Leading Line",
  "forum": "General Discussions",
  "tags": [
    "classic typography",
    "General Discussions",
    "leading line",
    "small caps"
  ],
  "content": "When using small caps in a leading line and you have what would normally be capitalized letters within it, (for example, someones name) do you make those normal sized capitol letters in line the small caps, or just all lowercase small caps? What is best practice for this, which is more traditional...\n\n",
  "author": "Bloom.Aar",
  "time": "7 Jan 2014 — 8:20pm",
  "uid": "15636",
  "comments": [
    {
      "time": "8 Jan 2014 — 5:30am",
      "content": "> do you make those normal sized capitol letters in line the small caps, or just all **lowercase** small caps?\n\nNot sure I understand the question -- the reference to \"leading line.\" Do you mean the first line following, say, some kind of space break, where the style is to set the first few words (or an entire line) in small caps?\n\nIf so, my informal survey is most designers just use small caps. But there is no hard and fast rule, and editors are a little more wont to insist on a full cap for that initial character (i.e., a cap-small cap style).\n\nThink of it this way: There really aren't any \"lowercase\" small caps. You could set those words in full caps -- sometimes done, but less commonly seen. It is all a design decision, and as such, is sometimes overridden by editorial convictions.\n\nIf the decision is yours and you strongly believe a reader will be negatively affected by one choice, you pick the other. But it is amazing the number of arguments proffered about what will negatively affect a reader, most of them turning out to be wrong.\n\n"
    },
    {
      "time": "8 Jan 2014 — 10:18am",
      "content": "Thanks Charles this is perfect.\n\n"
    },
    {
      "time": "9 Jan 2014 — 9:45am",
      "content": "Generally, if I am setting only the first phrase in sc, I will leave the initial letter full cap, but use no other full caps within the phrase, even for words that would normally be capitalized. If I am setting the entire first line in sc, I don't even capitalize the first letter.\n\n"
    },
    {
      "time": "9 Jan 2014 — 4:28pm",
      "content": "Well, I frequently look at the words involved, and if there really isn't any reason to use cap & small cap structure for clarity, I can sometimes use the fact that a line of small caps looks a bit like a rule. You can use them to echo certain kinds of rules that might be used in a chapter opening or subhead.\n\nNot as an echo of a solid black hairline rule, but certainly a thicker, gray rule, or a \"rule\" made up of small vertical lines, one default of \"rules\" in InDesign.\n\nIn other words, once any need or cap & small cap is eliminated for clarity (& usually it can be), the graphic qualities of small (or full) caps can be exploited.\n\nFWIW\n\n"
    },
    {
      "time": "11 Jan 2014 — 12:07pm",
      "content": "Indeed. I really like the sturdiness of a first line set entirely in sc. It just looks so good, especially if you can print it in a second color. Often, mixing in full caps ruins the visual effect.\n\n"
    }
  ]
}
