{
  "id": "108025",
  "title": "FontLab beta files not working in Illustrator",
  "forum": "Build",
  "tags": [
    "Adobe Illustrator",
    "Build"
  ],
  "content": "I'm trying to export a six-layered font from FontLab Studio, but the .otf files are doing strange things in Illustrator. I don't know if I have missed something in the Font Info window in FontLab, or if it's an Illustrator setting I've overlooked (but I've tested the beta version on several computers now and the problem persists).\n\nThe font has 6 layers. 3 of them stack perfectly on top of each other when pasted in place. The other 3, however, do not. As illustrated in the screenshots here, one layer (Eclisse) sets itself a fraction higher than the baseline; one layer (Tonale) sets its baseline noticeably higher than it is supposed to; and one layer (Inline) sets its baseline significantly higher still.\n\nWhen I highlight this text and change it back to one of the other, properly-working layers, the baselines align perfectly, so I haven't just accidentally nudged the text box. I've been right through the Font Info panels in FontLab and can't for the life of me work out why this problem could be happening.\n\nAny help or guidance would be greatly appreciated!\n\n ![](http://web.archive.org/web/20150420101442im_/http:/typophile.com/files/Screen%20shot%202014-01-05%20at%205_5437.18.00%20PM.png)\n  \n\n ![](http://web.archive.org/web/20150420101442im_/http:/typophile.com/files/Screen%20shot%202014-01-05%20at%205_3551.18.20%20PM.png)\n  \n\n ![](http://web.archive.org/web/20150420101442im_/http:/typophile.com/files/Screen%20shot%202014-01-05%20at%205_4138.18.36%20PM.png)\n\n",
  "author": "SophieElinor",
  "time": "5 Jan 2014 — 3:04pm",
  "uid": "216675",
  "comments": [
    {
      "time": "20 May 2014 — 9:02pm",
      "content": "Are the metrics, size and UPM values consistent?\n\n"
    },
    {
      "time": "27 May 2014 — 2:18pm",
      "content": "That was what I was going to ask. Particularly regarding vertical metrics. For each vertical metric, you should set all the fonts in the family to the largest value from any member font. That will likely resolve the problem.\n\nIf not, get in touch with FontLab support and they would be happy to help sort it out.  \n [http://www.fontlab.com/contact-and-support/product-support/problem-report/](http://web.archive.org/web/20150420101442/http:/www.fontlab.com/contact-and-support/product-support/problem-report/ \"http://www.fontlab.com/contact-and-support/product-support/problem-report/\")\n\n"
    }
  ]
}
