{
  "id": "108035",
  "title": "Expressive Typograhy and how it creates an emotional response",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "Hello  \nI'm currently working on my dissertation and was hoping for some recommendations that would help me, my dissertation is based on expressive typography and how it creates an emotion response with the audience.\n\nany help would be grateful.\n\n",
  "author": "gogglebox",
  "time": "6 Jan 2014 — 7:41am",
  "uid": "216688",
  "comments": [
    {
      "time": "8 Jan 2014 — 11:57am",
      "content": "Some people here might think that all typography is expressive typography. Would you mind defining this term, expressive typography?\n\n\"any help would be grateful.\" Ouch!\n\n"
    },
    {
      "time": "9 Jan 2014 — 5:00am",
      "content": "apologizes for not making it clear enough i have attached a link that will show you what i mean by expressive.\n\n[http://netdna.webdesignerdepot.com/uploads/experimental\\_typography/101.jpg](http://web.archive.org/web/20150317171341/http:/netdna.webdesignerdepot.com/uploads/experimental_typography/101.jpg \"http://netdna.webdesignerdepot.com/uploads/experimental\\_typography/101.jpg\")\n\n"
    },
    {
      "time": "10 Jan 2014 — 5:33am",
      "content": "@David, as your link shows something labelled as 'experimental' and fits both labels, could you be a lot more specific? What research have you done so far and have you reached a clear definition of, 'expressive' (or experimental) in this context?\n\n"
    },
    {
      "time": "10 Jan 2014 — 5:36am",
      "content": "Additionally, depending on whether this leads anywhere for you, Chris Dean's post on [how to cite and reference Typophile for academic research](http://web.archive.org/web/20150317171341/http:/typophile.com/wiki/How%20to%20cite%20and%20reference%20Typophile%20for%20academic%20research) could prove very helpful, as could using your real name as your user name, which will help other users to take you more seriously from an academic and professional perspective.\n\n"
    }
  ]
}
