{
  "id": "108096",
  "title": "Please help me find this unknown font :/",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "unknown"
  ],
  "content": "Please help me plzz !!!\n\n ![](http://web.archive.org/web/20140804064048im_/http:/typophile.com/files/e787vr_3988.jpg)\n\n",
  "author": "skradna",
  "time": "8 Jan 2014 — 5:46pm",
  "uid": "216764",
  "comments": [
    {
      "time": "8 Jan 2014 — 7:50pm",
      "content": "Congratulations! You're the 1,000,000 person to ask this question in the wrong forum. Just enter your credit card information below (be sure to include the PIN & verification numbers) to receive some **free attention**. This attention probably won't be a gift, but who can say!\n\nOr try\n\n[http://typophile.com/typeid](http://web.archive.org/web/20140804064048/http:/typophile.com/typeid \"http://typophile.com/typeid\")\n\n"
    },
    {
      "time": "9 Jan 2014 — 5:42am",
      "content": "Very funny.\n\n"
    },
    {
      "time": "9 Jan 2014 — 10:30am",
      "content": "Now in the FontID forum:  \n [http://www.typophile.com/node/108112](http://web.archive.org/web/20140804064048/http:/www.typophile.com/node/108112 \"http://www.typophile.com/node/108112\")\n\n"
    },
    {
      "time": "9 Jan 2014 — 10:39am",
      "content": "I bet skradna also thought\n\n> Very funny.\n\nwhen reading the obligatory note under \"General Discussion\": \"All topics are welcome—except font ID requests.\"\n\n"
    },
    {
      "time": "9 Jan 2014 — 1:29pm",
      "content": "This is being much more funny guys. You are doing everything except help. Thank you so much. Excuse my 'mistake'. Is it ok now, eh? It is my homework's piece that it'd very urgent. Anyway. Thanks for your comments. You are really 'helpful' :)\n\n"
    },
    {
      "time": "9 Jan 2014 — 3:06pm",
      "content": "> It is my homework's piece that it'd very urgent\n\nIndeed we are helpful. So many people who think they're more important than the rest of us ignore\n\n<cite>All topics are welcome—except font ID requests</cite>,\n\nand do post here. Most are in turn ignored, and the font not identified. While we can't help you with your probably spurious notion that you're more important than the rest of us, we can let you know that if you want a font identified, you're not likely to get much help here.\n\nSpecifically, we've helped by letting you know that if you post in the correct place, you **may** not have to get a dog.\\*\n\n\\*A well cared-for dog will likely back you up when you have to fall back on \"The dog ate my homework.\"\n\n"
    },
    {
      "time": "9 Jan 2014 — 3:38pm",
      "content": "Anyway. Will you help me? Really really i need to solve that :( I put it on correct place. I can't wait.\n\n"
    },
    {
      "time": "9 Jan 2014 — 4:45pm",
      "content": "I would tell you if I knew. One of the reasons for having the separate forum is that most (many?) of us don't have this knowledge when things get a bit esoteric.\n\nBut the people who hang out on the ID forum take these things as a challenge, odds are you will get an answer there. I'll stick to Sudoku.\n\n"
    },
    {
      "time": "11 Jan 2014 — 7:24am",
      "content": "While there's something familiar about it, I just can't figure it out. I suppose dredging through the esoterica on Dafont might help, but I'm otherwise way out in the octal forty.\n\n"
    }
  ]
}
