{
  "id": "10811",
  "title": "Archive through March 22, 2003",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm a loser.   \n   \n-smc\n\n",
  "author": "sean",
  "time": "20 Mar 2003 — 4:14pm",
  "uid": "596",
  "comments": [
    {
      "time": "20 Mar 2003 — 4:27pm",
      "content": "OK I've got something.   \n   \nI recently came across a book set in **Times New Roman Gaelic**. Not really one of the gems of Gaelic typography but it was once a new and exciting thing and some people even thought it was a good idea. It makes a good question anyway.   \n   \n1. Who is credited with its design? (bonus for the name of the man who actually did the drawing)   \n   \n2. When was it designed?   \n   \n3. It was only ever used in one book. Which one?   \n   \nIf you come up with the answer in 2 minutes, I'm not going to be your friend anymore!   \n   \nGood luck,   \n   \nMatha.\n\n"
    },
    {
      "time": "20 Mar 2003 — 9:39pm",
      "content": "Well, thanks to a vinic encounter in Rome with an overgrown Irish lout ;-) I recently started looking more closely at Gaelic type... I had met Dermot McGuinne at the Leipzig ATypI conference, but had never perused his book (\"Irish Type Design\") until recently. It's the proverbial pot-o'gold.   \n   \nTNR Gaelic was sketched by Liam Miller, drawn in full by William Britton (in 1963), and manufactured by Monotype. The book was \"An B\n\n"
    },
    {
      "time": "21 Mar 2003 — 3:27am",
      "content": "OK I've woken up. Hrant's the winner but he loses a couple of points for the \"lout\" comment ;-)   \n   \n'Cl\n\n"
    },
    {
      "time": "21 Mar 2003 — 7:00am",
      "content": "Don't shudder, I'm not sure this is tough enough:   \n   \nWhat's the _original_ name of the font Cyrus Highsmith recently made for a Hispanic newspaper?   \n   \nhhp\n\n"
    },
    {
      "time": "21 Mar 2003 — 7:40am",
      "content": "palatino.\n\n"
    },
    {
      "time": "21 Mar 2003 — 7:46am",
      "content": "Uh, no.   \n   \nhhp\n\n"
    },
    {
      "time": "21 Mar 2003 — 8:24am",
      "content": "Prensa?\n\n"
    },
    {
      "time": "21 Mar 2003 — 8:31am",
      "content": "Nope, sorry.   \n   \nBTW, that question mark is illegal. ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "21 Mar 2003 — 9:10am",
      "content": "Erm, I think Eduardo's actually [right](http://web.archive.org/web/20131023154513/http:/www.garcia-media.com/in_the_press/mercurio.html). Though maybe it's not the same redesign you're thinking of Hrant:   \n   \n\"...we knew the readers identified with El Mercurio: Palatino, for headlines and text. However, we felt that a new, cleaner, better tracked version was needed. That is when we commissioned Cyrus Highsmith, of the FontBureau, to recreate a special Palatino for El Mercurio.\"\n\n"
    },
    {
      "time": "21 Mar 2003 — 9:17am",
      "content": "OK, maybe I should have said \"most recent\" - although that might have a hole in it too. So I'll just break down and name the paper then: El Universal. BTW, when I say \"the original name\", I mean Highsmith's original name for his font, not the name of the font it replaced.   \n   \nhhp\n\n"
    },
    {
      "time": "21 Mar 2003 — 11:47am",
      "content": "Danilo\n\n"
    },
    {
      "time": "21 Mar 2003 — 12:04pm",
      "content": "It seems like you know something, but Danilo isn't it, which makes me ask: what was your source on that? Or are you not supposed to admit you just guessed. :-)   \n   \nhhp\n\n"
    },
    {
      "time": "21 Mar 2003 — 2:56pm",
      "content": "Come on, guys - it's on the FB site. 4 clicks. Well, maybe 4-and-a-half.   \nNo clicks if you have the [news]printed version.   \n   \nhhp\n\n"
    },
    {
      "time": "21 Mar 2003 — 3:54pm",
      "content": "Humedad\n\n"
    },
    {
      "time": "21 Mar 2003 — 5:18pm",
      "content": "Universal\n\n"
    },
    {
      "time": "21 Mar 2003 — 5:57pm",
      "content": "\\> Humedad   \n   \n:-/   \n   \n\\> Universal   \n   \nWell, \"El Universal\" was the _eventual_ name.   \n   \n--   \n   \nI think this has to end soon...   \nJohn, would you like to whip up a Rule for that?   \n   \nhhp\n\n"
    },
    {
      "time": "21 Mar 2003 — 6:22pm",
      "content": "Okay, new rules:   \n   \n13. If no one successfully answers the question within 24 hours, the person who posed the questions must a) reveal the correct answer, including sources, and b) pose a new question on a different theme.   \n   \n14. The person who posed the unanswered question may be challenged at any time after revelation of what he or she considers to be the correct answer, and if found to be in error shall be barred barred from winning any of the next three questions regardless of whether he or she correctly answers them.   \n   \n   \nYou know, inventing rules is way more fun than trying to answer questions. ![:-)](http://web.archive.org/web/20131023154513im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nHrant, participants have until 7:00am tomorrow morning to come up with the correct answer.\n\n"
    },
    {
      "time": "21 Mar 2003 — 6:45pm",
      "content": "\\> b) pose a new question on a different theme.   \n   \nCould he alternatively choose to \"pass the baton\" to a person of his choice?   \n   \nhhp\n\n"
    },
    {
      "time": "22 Mar 2003 — 7:43am",
      "content": "The answer is Zocalo.   \n(7.5Mb) [http://www.fontbureau.com/newspapers/readability.tar.gz](http://web.archive.org/web/20131023154513/http:/www.fontbureau.com/newspapers/readability.tar.gz)  \nPage 8   \n  \n--   \n  \nNew question:   \n  \nHow did Griffo die?   \n  \nhhp\n\n"
    },
    {
      "time": "22 Mar 2003 — 8:08am",
      "content": "He was (or at least that's what is presumed) hanged in 1518.\n\n"
    },
    {
      "time": "22 Mar 2003 — 8:32am",
      "content": "You got it - congrats!   \nBTW, it was for the murder of his son-in-law.   \n   \n--   \n   \nI guess wait an hour, then it's all yours!   \n   \nhhp\n\n"
    },
    {
      "time": "22 Mar 2003 — 8:57am",
      "content": "Wow... gotta think of a question first. I got nothing NEARLY, even remotely as hard as you guys got...\n\n"
    },
    {
      "time": "22 Mar 2003 — 9:22am",
      "content": "Which makes me realize: we need another Rule. One that stipulates how much time a person has to come up with a question, before the turn... reverts back to the previous quizer?   \n   \nNo pressure, eh? ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "22 Mar 2003 — 9:36am",
      "content": ":-D... ah, you just want an easy question. Okay, here you go: #   \nFor which company did Erik Spiekermann first develop the Meta?\n\n"
    },
    {
      "time": "22 Mar 2003 — 10:01am",
      "content": "Bundespost.\n\n"
    },
    {
      "time": "22 Mar 2003 — 10:09am",
      "content": "Yup. And those guys from Deutsche Bundespost didn't take it, stayed with Helvetica for a while and now are using Frutiger, which is almost as un-inspired a choice as Helvetica.   \nCongrats, Rodolfo... I should have known that was WAY to easy for cracks as you folks are ;-D.   \n   \nActually its brilliant timing, I'm off to a party, so I'm happy to not have anybody waiting for my response.   \n   \nGo ahead... see ya later...\n\n"
    },
    {
      "time": "22 Mar 2003 — 10:54am",
      "content": "Frankly, I'm not _so_ sure if Meta would be a much   \nmore inspired choice than Frutiger or Helvetica. Well,   \nat least it was brand new then...   \n   \nJohn, your rules don't say anything about the extra   \nbonus points I get for being the first to answer two   \nquizzes correctly.   \n   \nI'll think of something and come back with a question   \nin a while.\n\n"
    },
    {
      "time": "22 Mar 2003 — 12:32pm",
      "content": "Sorry, I was a bit busy here and couldn't come earlier.   \nWell, supposing no one will challenge my Bundespost answer,   \nhere's a question [easy?]:   \n   \nIn the 19th century an English researcher, intending to   \nprint tables of logarithms, conducted tests to determine   \nwhether lining or lowercase figures (what's generally called   \n\"old-style\" figures) were more legible. He came to the   \nconclusion that lining figures were the most legible.   \n   \nThis result has been contradicted by later experiments,   \nand I'm really not sure if there's any recent conclusion to   \nthe debate - I assume not.   \n   \nIn a certain way, this guy was, indirectly, responsible for   \nyour ability to read now what I've been writing here. Who was   \nhe and how is he important, at least emblematically, for our   \nmutual communication on this forum?\n\n"
    },
    {
      "time": "22 Mar 2003 — 4:41pm",
      "content": "Right, new rules:   \n   \n15. The winner of a round must provide a new question within 12 hours. If he or she fails to provide a question during this time, the privilege reverts to the winner of the previous round who must either provide a new question or ask the quizmaster (that's me, if you recall) to pose a new question or nominate someone else to do so.   \n   \n16. There are no bonus points awarded for correctly answering two or more questions in a row, providing additional information relating to the answer (although this is certainly encouraged), or otherwise exceeding the minimum requirement of correctly answering the question: the honour is reward enough.\n\n"
    }
  ]
}
