{
  "id": "108131",
  "title": "Hand Lettering & Copyrights",
  "forum": "General Discussions",
  "tags": [
    "copyright",
    "General Discussions",
    "hand lettering"
  ],
  "content": "I'm practicing hand lettering and have come across some fonts I like while browsing font stores on the web.  \nIf I look at these fonts and draw them free hand with just a pencil and paper, am I infringing on the font's copyright?  \nI plan on selling the finished piece I create.\n\nI am NOT printing the font and tracing over it. I am NOT tracing over an image of the font in Illustrator.  \nHowever, I AM looking at the font and free-hand drawing it.\n\nOnce I'm finished looking at the font and free-hand drawing it (NOT TRACING), it looks very similar but IS NOT an exact copy.  \nI feel my hand drawn version of the font is not an exact copy but does closely mimic the original font.  \nAgain, I AM NOT TRACING, I am free-hand drawing while looking at the font to imperfectly replicate it.\n\nI'm just starting out hand lettering, can anyone help steer me in the right direction?\n\n",
  "author": "MLLM",
  "time": "9 Jan 2014 — 3:00pm",
  "uid": "216786",
  "comments": [
    {
      "time": "9 Jan 2014 — 3:54pm",
      "content": "There are several things to think about, one being the origin of the font. Is it European or American? The laws differ. Another one: is it protected by Design Patent in the US? Some fonts are.  \nThere just aren't any general answers.\n\n"
    },
    {
      "time": "9 Jan 2014 — 5:30pm",
      "content": "I'm fairly certain that's legal in the US and probably in most countries. For a bit more artist integrity and to help further your own understanding and skill, it would make sense for you to use that as a start, but embellish upon it so the the piece of finished lettering doesn't end up looking like a mediocre drawing of a font. If it's a well known font you should consider going even further in your interpretation as anyone would easily realize its a copy.\n\nGenerally speaking its considered OK for people to mimic another person's work for learning purposes, but not to copy and display as their own. Doing this with a published font falls somewhere slightly out of that parameter, but is probably within legal limits.\n\n"
    },
    {
      "time": "10 Jan 2014 — 9:46am",
      "content": "Mark, why not just license the font. As an artist you understand the effort that goes into creating a work like this. The license fee (say $10 to $30) seems reasonable if you plan to profit from the font, even if it's not legally required? This is more of an ethical question rather than a legal question, no?\n\nCheers, Si\n\n"
    }
  ]
}
