{
  "id": "108292",
  "title": "How Joe Clark earned himself the Typophile banhammer",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "Typophile"
  ],
  "content": "Though since he had all the foregoing years to do so, I wonder why I hold out confidence for something new to happen in ’014.\n\nWhich is really more harmful to Typophile: Writing the word “\\*\\*\\*\\*” or endless spam postings?\n\n",
  "author": "joeclark",
  "time": "16 Jan 2014 — 5:33am",
  "uid": "7076",
  "comments": [
    {
      "time": "16 Jan 2014 — 8:19am",
      "content": "So, Joe, tell me: what does being a Mormon have to do with this? If in fact he is a Mormon. Your subject title needs to be corrected, I think.\n\n"
    },
    {
      "time": "16 Jan 2014 — 9:11am",
      "content": "@joeclark ... please stop creating all the spam accounts.\n\nThanks ...from all of us.\n\n"
    },
    {
      "time": "16 Jan 2014 — 10:12am",
      "content": "Joe, I say this extremely rarely – in fact the last time was over a decade ago:\n\nLeave.\n\nhhp\n\n"
    },
    {
      "time": "16 Jan 2014 — 10:54am",
      "content": "You first, Hrant. Also, go \\*\\*\\*\\* yourself.\n\nThe Mormon who runs this joint censors our expression via automation but refuses to tend to its years-long spam problem. He has no trouble posting jobs for the LDS Church on his Twitter feed, though.\n\nEssentially, you \\*\\*\\*\\* are defending spammers. I decry them. But only those with administrator access, like that Mormon, can actually stop the spammers.\n\n"
    },
    {
      "time": "16 Jan 2014 — 11:38am",
      "content": "I dislike spammers too. But since they're not sentient, they do less psychological damage than you. Unless you can adapt and forego cursing, instead of defining yourself here by primadonna hissy-fits. I'm assuming you can't, but feel free to prove me wrong.\n\nhhp\n\n"
    },
    {
      "time": "16 Jan 2014 — 12:58pm",
      "content": "Joe, you're wrong. Joe Pemberton is not running this place. He's no longer a part of Punchcut, or Typophile, at least not officially.\n\nBleeping out certain words on Typophile has nothing to do with my religious beliefs, but rather accessibility in schools, libraries, etc.\n\nSo you got to blame THIS Mormon, not the other one. But congrats, you caught me on a day where I have no patience for your remarks. Enjoy the ban.\n\n"
    },
    {
      "time": "16 Jan 2014 — 1:15pm",
      "content": "Since Joe is so dissatisfied, maybe the right thing to do is give him a full refund of his subscription fee.\n\n"
    },
    {
      "time": "16 Jan 2014 — 1:21pm",
      "content": "Happy to refund the value of his complete contribution (financial and otherwise) over all the years, totalling exactly $0.\n\n"
    },
    {
      "time": "16 Jan 2014 — 1:58pm",
      "content": "Mon cher M. Clark,\n\nThat's all the French I know, except for french that gets bleeped...\n\nI don't give a rosy red rat's patootie about having certain profanities, vulgarities, and obscenities (yup, they're different) bleeped. Been known to use them myself. In fact, for years I thought my wife's permanent blush was a matter of my, uh, physical prowess. Nope. Turns out I'm just an average guy who takes the name of God in vain too often, and that embarrasses her. You're probably suffering from a similar delusion...\n\nWhy not joint the ranks of people who communicate -- communication being a two way street, all parties comfortable. Typophile's not a place for \"artistic\" expression, vulgar or otherwise. Go create fonts no one wants to use to satisfy such urges.\n\nAs for all spamming: the few sites I visit **all** seem to be losing a battle to spammers. How you can blame the people at Typophile for the spam attacks shows only that you're unaware Typophile is getting to be important as a resource. \"important as a resource\" is also known as \"target.\"\n\nSuggest you worry more about any on-line accessible bank accounts you might have, and what you'll do for electrons, water, etc. when the spammers get just a bit more powerful. It is no longer a matter where site-by-site efforts will succeed.\n\n"
    },
    {
      "time": "16 Jan 2014 — 8:22pm",
      "content": "It saddens me and baffles me how being a Mormon (or any other religion) has any bearing on spammers or anything else on this site. I am an atheist and I am offended at such bigotry.\n\n"
    },
    {
      "time": "17 Jan 2014 — 9:58am",
      "content": "BTW, FWIW I've been on Twitter since June, and there are not infrequent cases of an _account being taken over_ –if temporarily– by spammers, which is much worse than a \"stand-alone\" spammer. But to me worse still is the not infrequent use of foul language; for one thing it prevents me from retweeting an otherwise worthy opinion – often it even prevents me from replying to it, lest I appear to be supporting use of foul language (which I consider to be an expression of weakness in objectivity, self-control and especially communication).\n\nAlso: I'm not religious (although neither am I an atheist) and I'm not blind to certain problems that formal religion can foster, but discriminating against religions is the most offensive belief of all.\n\nhhp\n\n"
    },
    {
      "time": "17 Jan 2014 — 9:47am",
      "content": "Pft! There are scads of lamerzz more than willing to consider their neighbours' political, religious or sexual leanings to be their own problems. I'd much sooner enjoy the company of foamers and gunzels. I'd enjoy it much more, at that. As one of them put it: \"Trains have this marvellous ability to completely ignore your skin colour.\"\n\n"
    }
  ]
}
