{
  "id": "10827",
  "title": "Minority (the smallest screen font on earth?)",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "Let`s critique and propose!   \n   \n ![smallest.gif](http://web.archive.org/web/20150414175641im_/http:/www.typophile.com/forums/messages/29/804.gif)\n\n",
  "author": "Miguel Hernandez",
  "time": "11 Feb 2002 — 9:55pm",
  "uid": "1109",
  "comments": [
    {
      "time": "12 Feb 2002 — 3:00am",
      "content": "The matter is screen pitch size I think...   \nCheck by way of comparison the work of Rainer Zenz for palm screens. The \"microfonts\" tend towards the same goal as you.   \n [http://www.rainerzenz.de/palm/alphafontview.html](http://web.archive.org/web/20150414175641/http:/www.rainerzenz.de/palm/alphafontview.html)   \nBut perhaps lower than 7 pixels high the solution is greyscaling. Bitsream made this: [http://www.bitstream.com/wireless/index.html](http://web.archive.org/web/20150414175641/http:/www.bitstream.com/wireless/index.html)   \nGrg.\n\n"
    },
    {
      "time": "12 Feb 2002 — 1:48pm",
      "content": "Mr. Cadars   \n   \nI saw the links, and i think that is too easy to say the similities between some fonts are at the same goal,( i told you `cause i make a mistake in the pass week critique another font, but saying that was a posible piracy case..) cause this family proposes a complete set and variations and the concept behind the screen pitch size is a matter to resolve by people many people not only for bitstram team, or me, don`t you think?- It`s only a opinion but i think that this critique forum is a great oportunity to coperate between typographic design proyects, and more than comparations between designers the deal is to make GRAPHIC examples for the success of many of the proyects.   \n   \nCan be more especific please ![:)](http://web.archive.org/web/20150414175641im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n( how many fonts, a detail, all are the same, etc...)   \n   \nThanks,   \n   \nMiguel.\n\n"
    },
    {
      "time": "13 Feb 2002 — 3:34am",
      "content": "Heeyah Miguel!   \nI wasn't speaking about piracy or something like this! Everybody here agree saying that when somebody design small bitmap fonts have the same problems as his neighbour.   \nTherefore, I'm a bad-english speaker, and I know now that \"matter\" doesn't means \"problem\": I said \"pitch size\" because I've seen the Minority font on a 1280/1024px screen, and to my mind it can't work with a resolution greater than 800/600px. I work designing fonts for cellular phone screens and most of the constructors include a zoom mode on their products cause they're happy to announce that they can display 6 lines of text, but many users can't read them. That's why I've send this palm microfonts link. They can be legible because palm display got a big pixel size, bigger than I-mode phones.   \nMaking the smallest font means \"making the last legible size\" and gain place to display more lines on screen, or it's only a challenge?   \nBTW, I really prefer your bold version. Do you have a full character set of this one?   \n   \nCheers ![:)](http://web.archive.org/web/20150414175641im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nGreg.\n\n"
    },
    {
      "time": "13 Feb 2002 — 6:45pm",
      "content": "Hi Cadars!   \nYou work with cellular fonts?   \nWow!!!   \n   \nYes, i´ve got a 6 minority versions!   \nWhere do you work? i´m very interested in work someday with i-mode, please tell me more.   \n   \nMiguel.\n\n"
    }
  ]
}
