{
  "id": "10829",
  "title": "Archive through March 25, 2003",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Winner!\n\n",
  "author": "cheshiredave",
  "time": "24 Mar 2003 — 11:44am",
  "uid": "1112",
  "comments": [
    {
      "time": "25 Mar 2003 — 6:16am",
      "content": "[http://www.thirstype.com/playground\\_big3.html](http://web.archive.org/web/20131019145722/http:/www.thirstype.com/playground_big3.html)   \n   \nit's #1. and sorry everyone for being so obtuse.   \nit's just... well, i wanted to impress you so much... (sob)\n\n"
    },
    {
      "time": "25 Mar 2003 — 9:37am",
      "content": "_\\>I guess just ask him why it says \"The font Universal was originally known as Zocalo. Zocalo_\n\n"
    },
    {
      "time": "25 Mar 2003 — 10:41am",
      "content": "Dana Dahlquist, having displayed remarkable, cryptic-crossword-solving lateral thinking, has now failed to post a question within the required 12 hour period. So I hereby invoke rule No.15 and pose the new question myself.   \n   \nNEW QUESTION:   \n   \nThe Psalter was one of the most frequently printed books in the early centuries of printing, with numerous editions being published in Hebrew, Greek and Latin. In what script and in what language was the first non-Hebrew/Greek/Latin edition printed, and in what year?\n\n"
    },
    {
      "time": "25 Mar 2003 — 10:52am",
      "content": "1611\n\n"
    },
    {
      "time": "25 Mar 2003 — 11:02am",
      "content": "I have a feeling there was a Gaelic Psalter printed in the 16th century. I'm looking for a reference.   \n   \nMatha\n\n"
    },
    {
      "time": "25 Mar 2003 — 11:10am",
      "content": "Would it be _Aibidil Gaoidheilge agus Caiticiosma_ printed in 1571 using the typeface commissioned by Queen Elizabeth I ?   \n   \nMatha\n\n"
    },
    {
      "time": "25 Mar 2003 — 12:08pm",
      "content": "Not that I was guessing or anything but I declare myself to be wrong and put forward the following instead:   \n   \nArabic   \n1516   \n   \n(Genoa polyglot Psalter)\n\n"
    },
    {
      "time": "25 Mar 2003 — 12:10pm",
      "content": "Yes. I don't \\*think\\* I was wrong either. ;) But I have to say this jives with my \\*latest\\* findings as well.\n\n"
    },
    {
      "time": "25 Mar 2003 — 12:14pm",
      "content": "The Genoa Psalter was printed in 1516 by Pier Paolo Porro. It was a polyglot edition and covered (as well as Hebrew, Latin, Greek) Arabic and Aramaic (or Syriac).   \n   \nThere's also an Ethiopic version from the fifteenth century, but I guess that doesn't count since it's not printed.\n\n"
    },
    {
      "time": "25 Mar 2003 — 12:15pm",
      "content": "Poop. Too late, I see.\n\n"
    },
    {
      "time": "25 Mar 2003 — 12:28pm",
      "content": "Nathan, go and look at the pink site again. You'll feel better.   \n   \n [http://www.vorticism.co.uk/](http://web.archive.org/web/20131019145722/http:/www.vorticism.co.uk/)   \n   \nm.   \n   \nPS I'm not sure we're right. I think John is looking for a single language edition.\n\n"
    },
    {
      "time": "25 Mar 2003 — 12:31pm",
      "content": "Christ, I couldn't resist the day-glo vortex. Now my eyesockets are just blackened craters and I'll never figure this quiz out....\n\n"
    },
    {
      "time": "25 Mar 2003 — 12:34pm",
      "content": "That's one out of the way. Hey everybody, check out the pink site!\n\n"
    },
    {
      "time": "25 Mar 2003 — 12:42pm",
      "content": "Actually I just found another Ethiopic Psalter that _is_ printed.   \n   \n_Psalterium David et Cantica aliqua_ 1513\n\n"
    },
    {
      "time": "25 Mar 2003 — 12:49pm",
      "content": "I think you've got it, Nathan. The vortex obviously isn't working anymore.   \n   \nMatha\n\n"
    },
    {
      "time": "25 Mar 2003 — 12:53pm",
      "content": "Yeah, the vortex is losing it's power, but if you really want to watch someone's brain melt, have them look at [this](http://web.archive.org/web/20131019145722/http:/winecompliments.com/WHO_ARE_WE.html). Keep your eyes on the monkey.\n\n"
    },
    {
      "time": "25 Mar 2003 — 12:58pm",
      "content": "I'm surprised they kept the text block in front... :-/   \n   \nhhp\n\n"
    },
    {
      "time": "25 Mar 2003 — 1:04pm",
      "content": "[http://www.sas.upenn.edu/African\\_Studies/Vatican\\_GIFS/About\\_11559.html](http://web.archive.org/web/20131019145722/http:/www.sas.upenn.edu/African_Studies/Vatican_GIFS/About_11559.html)   \nSearch for \"1513\".   \n   \nhhp\n\n"
    },
    {
      "time": "25 Mar 2003 — 1:07pm",
      "content": "It certainly is a unique gift shop. I dare someone to drop in and sample the atmosphere.   \n   \nThat's the funniest thing I've seen for ages. They deserve a prize for that   \n   \nMatha\n\n"
    },
    {
      "time": "25 Mar 2003 — 1:08pm",
      "content": "(ALMOST) A WINNER:   \n   \nNathan has half of it. The first non-Hebrew/Greek/Latin Psalter was indeed the _Psalterium David et Cantica aliqua_, printed by Marcellus Silber from Regensburg for Johannes Potken in 1513.   \n   \nI also asked in what _language_ the edition was printed: the script is generally known as Ethiopic, but this term is not really accurate for the language. I hereby declare Nathan the winner for his correct identification of the edition and script, but he's not allowed to post a question until someone (anyone) correctly identifies the language (I'll accept any of three possible spellings).   \n   \nHere, is an image of the [_Psalterium David et Cantica aliqua_](http://web.archive.org/web/20131019145722/http:/www.ibiblio.org/expo/vatican.exhibit/exhibit/h-orient_to_rome/images/orient06.jpg).\n\n"
    },
    {
      "time": "25 Mar 2003 — 1:15pm",
      "content": "The script is Ge'ez.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Mar 2003 — 1:20pm",
      "content": "You mean Ge'ez as in \"Geez, how in hell do you people know all this?\" ;-)\n\n"
    },
    {
      "time": "25 Mar 2003 — 1:24pm",
      "content": "Oromigna\n\n"
    },
    {
      "time": "25 Mar 2003 — 1:30pm",
      "content": "After some quick research, seems like Ge'ez would make sense, but I'm gonna fire off Amharic since it seems to be the dominant language.\n\n"
    },
    {
      "time": "25 Mar 2003 — 2:20pm",
      "content": "Ge'ez is correct. Note that the ' is properly a reversed (mirrored) apostrophe or left half ring signifying a voiced pharyngeal fricative.   \n   \nGe'ez is the ancient language in which the scriptures of the Ethiopic Orthodox Church are written. Amharic is the majority language spoken in modern Ethiopia, it is descended from Ge'ez but quite different from it.   \n   \nTake it away Nathan...\n\n"
    },
    {
      "time": "25 Mar 2003 — 2:27pm",
      "content": "Now, now - Rule #4.   \nThe laws is the laws.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Mar 2003 — 2:36pm",
      "content": "Good point Hrant. It's gonna take me a few minutes to come up with something even reasonably worthy of this erudite group anyway.   \n   \nIncidentally, I'll post it (provided the provisions of Rule 4 don't knock me out) before I leave school tonight, but I don't have an internet connection at home. So I'll be back online tomorrow morning before I teach. Sorry if this poses an undue wait for a ruling...\n\n"
    },
    {
      "time": "25 Mar 2003 — 3:05pm",
      "content": "Don't go citing rules at the quizmaster, Hrant. Rule 4 clearly states that the winner must wait one hour, during which time the answer may be challenged, from the time that he or she is _declared_ the winner. I declared Nathan the winner at 1:08 pm. The additional requirement that someone had to provide the correct term for the language of the Ge'ez Psalter was a post-declaro application of Johannine privilege. So there!\n\n"
    },
    {
      "time": "25 Mar 2003 — 3:17pm",
      "content": "I stopped seeing Joanna _years_ ago. She had a messy Oedipus thing going on.   \n   \nhhp\n\n"
    }
  ]
}
