{
  "id": "108390",
  "title": "FONTFORGE : Transform Glyph without changing its weight? Possible?",
  "forum": "Build",
  "tags": [
    "FontForge",
    "glyph",
    "scale",
    "weight",
    "Build"
  ],
  "content": "Hi everyone,\n\nWell everything is in the title...  \nI am not an expert yet on Fontforge and I am struggling to find a way to scale down my caps without changing their weights. It would avoid me to scale down then manually increase weight for each letter, which would make me go crazy for sure haha.\n\nThanks for any help, I would appreciate!\n\n",
  "author": "Amaury Hamon",
  "time": "20 Jan 2014 — 11:20am",
  "uid": "217029",
  "comments": [
    {
      "time": "21 Jan 2014 — 2:07am",
      "content": "I'm afraid that I can't help you but you may find that it is worth posting this question within the, [FontForge: mysterious and confounding? What would you like to know?](http://web.archive.org/web/20140726025425/http:/typophile.com/wiki/FontForge%3A%20mysterious%20and%20confounding%3F%20What%20would%20you%20like%20to%20know%3F) thread as well. Good luck!\n\n"
    },
    {
      "time": "21 Jan 2014 — 9:15am",
      "content": "I could've sworn FontForge has a feature that does exactly that. Give me a moment…\n\n"
    },
    {
      "time": "21 Jan 2014 — 9:33am",
      "content": "There is the feature Element\\>Styles\\>Change Weight that can be used to restore the weight of your small caps after you scale them down, but I don't find it quite satisfactory.\n\nLooks like there's another issue to put in the queue.\n\n"
    },
    {
      "time": "21 Jan 2014 — 10:43am",
      "content": "On the version of FontForge I have, one can select some capital letters, then \"Element \\> Style \\> Add Small Capitals\" and the corresponding smallcaps are synthesized (if H is selected, the smallcap that is generated is named h.sc).\n\n"
    },
    {
      "time": "21 Jan 2014 — 11:30am",
      "content": "I thought I'd seen it before. Yes! The Add Small Capitals feature only appears in the Element\\>Style submenu in the Font window (where you see all the letters in the font in little boxes), not in the Glyph window (where you edit outlines) where I'd been looking for it.\n\nYou may still have to tweak the generated glyphs since these automated processes are rarely perfect, but it should be much less trouble than what you were doing before.\n\n"
    },
    {
      "time": "21 Jan 2014 — 9:34pm",
      "content": "If, on the other hand, your capitals in general are too tall, there is also the Element\\>Style\\>Change x-height feature that you can use to make your lowercase letters taller without changing their weight, which would get you a similar net effect.\n\n"
    },
    {
      "time": "25 Jan 2014 — 3:45am",
      "content": "Thanks a lot everyone, I'm going to try all these :)\n\n"
    },
    {
      "time": "25 Jan 2014 — 3:34pm",
      "content": "Are you going to have more than one weight for this typeface anyway, say a regular and a bold?\n\nIf so, generally, the \"best\" way to do this sort of thing is to start by designing your typeface with a weight axis. From there you can generate things like small caps, correct the weight automatically, and have it be pretty nearly perfect right off. You can do the small caps in the bold master by extrapolation.\n\n"
    },
    {
      "time": "27 Jan 2014 — 1:55pm",
      "content": "Although we change planning now and then, a new IK/BE editor developed at URW++ will be released probably later this year. One of its nifty functions is [intelligent scaling](http://web.archive.org/web/20140726025425/http:/www.youtube.com/watch?v=uOsYMctPRNg).\n\n"
    },
    {
      "time": "28 Feb 2014 — 12:41pm",
      "content": "It looks very interesting!\n\nBy the way I have found a way to do it properly: manually! Took me some time but the result was here.\n\n"
    }
  ]
}
