{
  "id": "108378",
  "title": "Initial Letters/Drop Caps",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello everyone. I am designing a book. The first part if of this series of book use blackletters for Initial Letter at the beginning of each chapter. I am trying to find a kind of more plain and elegant instead of blackletters. I would love to share some ideas about this issue. Thanks in advance.\n\n",
  "author": "desi87",
  "time": "20 Jan 2014 — 6:54am",
  "uid": "209206",
  "comments": [
    {
      "time": "20 Jan 2014 — 8:16am",
      "content": "Look through this book to find the blackletter of your dreams:  \n [http://typographica.org/typography-books/fraktur-mon-amour-2nd-edition/](http://web.archive.org/web/20150416043012/http:/typographica.org/typography-books/fraktur-mon-amour-2nd-edition/ \"http://typographica.org/typography-books/fraktur-mon-amour-2nd-edition/\")\n\nhhp\n\n"
    },
    {
      "time": "20 Jan 2014 — 2:11pm",
      "content": "A general idea of the subject matter would be helpful,,,\n\n"
    },
    {
      "time": "21 Jan 2014 — 8:58am",
      "content": "The overview the book is this one:  \n\"THE SAGA BEGINS  \nHow can you live, breathe, feel and hope when your world is collapsing and your life is now a lie - when sadness and despair become addictive? Led by the wearing need to learn the truth about her past, fearless, resilient Caitlin goes against her better judgment and returns to those who once betrayed her - those who stripped her of everything she knew and loved. Suddenly none of the rules that have kept seventeen-year-old Caitlin apply anymore and everything is on the line: her freedom, her family - EVERYTHING. Enter the lush extravagance of a secret society tucked away in the small town of Oaks and uncover the link between her past, present and uncertain future - unraveling the lines that bind her to the inexplicable events that threaten her own existence.\"\n\n ![](http://web.archive.org/web/20150416043012im_/http:/typophile.com/files/prologue_6681.JPG)\n  \nAs you can see the first edition was composed by using Palatino typeface. But my issue for now is to find a more elegant and austere Initial letter. I do not want to use a blackletter. I think is just not compatible.\n\n"
    },
    {
      "time": "21 Jan 2014 — 4:34pm",
      "content": "Well, here's a start. I seem to remember an older site that included his (Dieter Steffmann) initials, along with a host of others. Of course, there's 6 pages on this site and I didn't get past page 1...\n\n[http://fontgarden.com/search.html?d=1&q=Dieter+Steffmann](http://web.archive.org/web/20150416043012/http:/fontgarden.com/search.html?d=1&q=Dieter+Steffmann \"http://fontgarden.com/search.html?d=1&q=Dieter+Steffmann\")\n\n"
    },
    {
      "time": "21 Jan 2014 — 7:21pm",
      "content": "If you want something that gives a similar feel to Palatino, you could try Castellar:  \n [http://www.myfonts.com/fonts/adobe/castellar/](http://web.archive.org/web/20150416043012/http:/www.myfonts.com/fonts/adobe/castellar/)\n\n"
    },
    {
      "time": "24 Jan 2014 — 10:14am",
      "content": "i couldn't get the past page 1 either..but thanks\n\n"
    },
    {
      "time": "24 Jan 2014 — 10:22am",
      "content": "I think this is a good one, I suppose I can use Castellar not only with Palatino, but with other \"classic\" typefaces as well. I can not understand why some designers tend to use \"extreme\" initial letters, cluttered with so much details. I am not trying to blame the designer of the book but I assume blackletters as extravagant and unique to be easily compatible with a plain and legible typeface such as palatino is.\n\n"
    }
  ]
}
