{
  "id": "108413",
  "title": "Charter ITC / Bitstream ?",
  "forum": "General Discussions",
  "tags": [
    "bitsream",
    "charter",
    "comparison",
    "General Discussions",
    "ITC",
    "Linotype"
  ],
  "content": "I was looking for the Charter font from Matthew Carter and discovered that there are multiple versions.  \nI wonder if someone can tell me what are the differences between the 3 listed here (in terms of design, not concerning the rights to sell) :\n\n[ITC Charter (Linotype)](http://web.archive.org/web/20150416035804/http:/www.myfonts.com/fonts/linotype/itc-charter/) (ITC Charter Regular - $35)  \n [ITC Charter (ITC)](http://web.archive.org/web/20150416035804/http:/www.myfonts.com/fonts/linotype/itc-charter/) (Charter Regular - $29)  \n [Charter BT (Bitstream)](http://web.archive.org/web/20150416035804/http:/www.myfonts.com/fonts/bitstream/charter/) (Charter Regular - $24.75)\n\nThanks for your help\n\n",
  "author": "Aure",
  "time": "21 Jan 2014 — 8:14am",
  "uid": "59040",
  "comments": [
    {
      "time": "22 Jan 2014 — 3:52am",
      "content": "Let me share here the answer Stephen Coles gave me on Quora :\n\n-  \nThe reason for the two versions is that Charter was initially designed by Matthew Carter for Bitstream and then later licensed to ITC. I am not aware of any discernible letterform differences, but there are some differences in price, character sets, metrics (spacing, kerning, bounding box size, etc), and probably hinting (optimization for Windows screen displays). There are also Standard and Pro versions from each foundry.\n\nTo make the decision simpler, you probably want to narrow your choices down to Pro versions so you have most of what you need for language support (beyond Western Europe) and typographic features (small caps, oldstyle figures, etc.)\n\nSo your choices are: ITC Charter Pro and Charter BT Pro.\n\nITC Charter claims more glyphs at 695 versus 613, but it’s not clear at a glance what those extra glyphs are, since both fonts have the same language support and typographic features. (They are probably some historical forms and other rarely used extras.)\n\nThe prices between the two versions are nearly the same, both for single fonts and family packages, so it comes down to other two other main factors: metrics and hinting. I did some quick testing and did find differences in the kerning, but nothing major. So the final distinguisher is hinting, and that I cannot judge without a system running Windows. Hopefully one or both versions have been manually hinted. You’ll have to test them to be sure. (Ask MyFonts for browser screenshots! They used to supply them but they disappeared sometime last year.)\n\nThere is also a third foundry, ParaType, that offers a Charter with Cyrillic character support. So if you need your text to be read by the many millions in Russian-speaking regions, go for that one.\n\n"
    },
    {
      "time": "22 Jan 2014 — 10:20am",
      "content": "Another thing you should know is that Bitstream made the original Charter fonts available as OpenSource. Check the TeX sites. There was some initial confusion over the license, but as thing now stand (and as I understand it), the fonts are free, free to use in any form, free to modify, and free to distribute.\n\nThere have been non-Carter-drawn characters added by some TeX folk. As always, they vary in quality.\n\nSo. I don't find it difficult to draw up os figs or small caps. As we set books (and occasionally pdfs **only** for some high-res mobile devices now out -- Kindle, iPad, phones. etc.), I don't care about the improved hinting.\n\nSo the free-to-modify part of the open license is very valuable to me, as is the ability to use the fonts in pfs without incurring further costs. BitStream is now owned by Monotype, & if I understand things aright, you just can't do anything with their fonts without paying ever more money.\n\nWorth a close look, depending on your needs.\n\nFWIW.\n\n"
    },
    {
      "time": "22 Jan 2014 — 10:25am",
      "content": "Charis SIL  \n [http://scripts.sil.org/cms/scripts/page.php?item\\_id=CharisSIL](http://web.archive.org/web/20150416035804/http:/scripts.sil.org/cms/scripts/page.php?item_id=CharisSIL \"http://scripts.sil.org/cms/scripts/page.php?item\\_id=CharisSIL\")  \n [http://scripts.sil.org/cms/scripts/page.php?item\\_id=CharisSIL\\_download#F...](http://web.archive.org/web/20150416035804/http:/scripts.sil.org/cms/scripts/page.php?item_id=CharisSIL_download#FontsDownload \"http://scripts.sil.org/cms/scripts/page.php?item\\_id=CharisSIL\\_download#FontsDownload\")  \nIn Charis SIL Compact, the \"Compact\" refers to the leading.\n\n"
    },
    {
      "time": "22 Jan 2014 — 10:59am",
      "content": "Charis is a little heavier than Charter. Sometimes that's good, sometimes not. It is also a little bigger for a specified size, but that's a trivial matter of scaling. I tend to use Charis more for books to be printed offset at 2,400+ dpi. Though if, for whatever reason, the type size to be used is to be a bit larger, Charter picks up enough weight to print quite well whereas Charis becomes a little clunky.\n\nIt's with the devices in the 100 dpi region (computer screens) where Charter might show an advantage. With, say, 9-point on a newer 7-inch Kindle fire, Charis works very well indeed. Someday -- I imagine not far off -- computer monitors will be high resolution too.\n\nAlways helps to know your tools, and usually, type is a tool.\n\n"
    },
    {
      "time": "22 Jan 2014 — 2:55pm",
      "content": "Charles Ellertson, thanks for the info!\n\n"
    },
    {
      "time": "23 Jan 2014 — 1:34pm",
      "content": "@Charles Ellertson \\>\\> thank you very much for the extra information. Concerning the \"free-to-modify\" part of the licence you refer to, as I'm just a web designer who don't know how to create/modify a font, it won't be useful to me but thanks anyway !  \nFor the details, I'm actually looking for a body typeface for my next book (digital edition only) and I was looking closely to Charter. So it would mainly be seen through ipad screen (multimedia .ibook format) but I also plan to release a .pdf format.\n\n@J.Tillman : I didn't know Charis, thanks ! I will take a closer look despite the fact that Charles says that in my case (ebook), Charter would probably be a better choice ? Anyway, I will try both and see the differences by myself. Thanks again\n\n"
    },
    {
      "time": "23 Jan 2014 — 8:38pm",
      "content": "Oops, I did say it, but perhaps not clearly enough. With readers like the Kindel Fire (7-inch), the iPad 10-inch, and even the Android & iPhones, Charis is just fine.\n\nI don't know what the resolution of these screens is, but it is 2-3-4 times higher than a typical computer monitor. Again, for my money, Charis works just fine, the better hinting of the new Charter isn't needed.\n\nI'm currently working on a long-term project to use pdfs for ebooks. The plus, of course, is the designer retains complete control over the presentation, including things like margins, word spacing, type size, & on & on.\n\nThe downside is you can't do just one pdf to fit all the different screen sizes. That's been the argument for ePUB ebooks all along. But no one ever asked a **compositor** what made sense. We have, over the years, developed a workflow where you can set a book from a MS Word (or Libre, or OpenOffice) file in a few hours. A fair bit built into that workflow, but we have it, and anyone could develop something similar.\n\nWith 3-4-5 stock templates and an efficient workflow, I can redo an existing book (change only the size, lead, margins, etc.) in a couple hours. So, I can do multiple pdfs **cheaper** than the time it takes to make an ePUB2 ebook.\n\n...Right up until there are images or other complexities where the 4-inch phone screen versus 10-inch tablet screen size gets in the way. There will be ways around this, too, & that's where our work is going (InDesign's liquid layout being one good starting point).\n\nBack to your question: if your ebook is aimed at the readers & phones of today, Charis will work just fine. I'll allow I've spent time working over the fonts for letter fit and drawn up some extra characters. On that point, I don't know if Charter is a better starting point. As I almost always work over fonts (for ease & speed of production as well as appearance), I'm not a good source about whether the Charter or Charis is better from the foundry.\n\n¿Esta claro, mi amigo?\n\n<cite>Edit:</cite>\n\nI don't know how the folk at Typophile would feel about it, but if it's OK, I have a pdf (161K) of the first 18 pages of Sherlock Holmes <cite>Scandal in Bohemia</cite> (public domain text & one public domain image), set in with Charis and Alegreya (both open source) I'd be happy to attach to this thread.\n\nSet 9/13.5 Charis, with (approximately) 2.75 pica left & right margins with a 3-pica head margin. Actual sizes will change just a bit depending on the device and the app used.\n\nThis one aimed at 7-inch Android devices, esp. a Kindle Fire (download the pdf to \"documents,\" then import into a pdf app -- I like Aldiko, but whatever... )\n\nLet me know.\n\nActually, this entire <cite>Adventure</cite> is only 210K, and could then be compared with similar texts from Project Gutenberg... Again, not my place to decide what's appropriate for Typophile. Somebody in charge chime in, please.\n\n"
    },
    {
      "time": "23 Jan 2014 — 10:09pm",
      "content": "The problem though is that the ideal font choice also depends on the \"page\", because a font's vertical proportions, color and spacing (not to mention character, in terms of being a \"supportive\" design choice) are tied into any \"macro\" decisions; if you're having to change the margins, word spacing, type size, etc. then a change of font is probably in order too. Ergo: Charis, Alegreya, or whatever else cannot ideally serve more than a relatively narrow range of situations.\n\nhhp\n\n"
    },
    {
      "time": "24 Jan 2014 — 7:40am",
      "content": "Thanks Charles, everything is very clear. In my case, I plan to add interactive content for iPad users (web designers are my main target).  \nI don't know yet if I will lock the orientation or not and what to choose between portrait or landscape.  \nThe .pdf version will be a \"light\" and cheaper version without any interactive content, just text + flat images for readers who wants the book but don't have an ipad device.  \nConcerning my choice, I've taken a closer look to Charter because it was made by Matthew Carter, a person who has done so much for digital typography, which is a large part of my subject.  \nThe better would be to find a typeface (or 2) which fits with the format but also the subject of the book.  \nBut, Charis could be appropriate, I have to learn a bit more about his history as I know nothing about it.  \nNote : Yes, I would be interrested to take a look to your version of _Sherlock Holmes Scandal in Bohemia_.\n\n@hrant \\>\\> your point only concerns fixed layout (pdf or printed book) but in my case I guess the readers would always have the choice to change the typeface + font size on the ipad ebook reader.\n\n"
    },
    {
      "time": "24 Jan 2014 — 10:20am",
      "content": "1) Even if some people might go to the trouble of changing the font, you still need to worry about your \"ideal\".  \n2) I'm curious, is there a way of preventing a font change?\n\nhhp\n\n"
    },
    {
      "time": "24 Jan 2014 — 10:38am",
      "content": "I definitely agree on your first point.  \nConcerning the second point, I don't think so. I've never used an ebook that prevents me for changing fonts and never heard about someone who ever did it (neither have red somewhere it was possible).\n\n"
    },
    {
      "time": "25 Jan 2014 — 1:49am",
      "content": "A [fixed-layout EPUB](http://web.archive.org/web/20150416035804/http:/ebookarchitects.com/learn-about-ebooks/non-fiction-fixed-layout/) would allow that but is only really effective when you have target devices in mind that will compliment your layout.\n\n"
    },
    {
      "time": "25 Jan 2014 — 7:08am",
      "content": "> The problem though is that the ideal font choice also depends on the \"page\", because a font's vertical proportions, color and spacing (not to mention character, in terms of being a \"supportive\" design choice) are tied into any \"macro\" decisions; if you're having to change the margins, word spacing, type size, etc. **then a change of font is probably in order too.** <cite>emphasis added</cite>\n\nNo. Thirty years of book design has not shown me this. Given a page (trim size) and someone's requirements on the number of characters that fit on a page, one might have to change the typeface. This works esp. against fonts that set fewer characters per pica in an acceptable size (which is not the case for either Charis or Alegreya, but that's another story).\n\nNow adding pages costs money in print editions -- though as \"pages\" are purchased as a part of signatures, not as directly as one might think. I can come up with examples where it is cheaper to have \\*more\\* pages -- and that's why some books have blanks at the ends.\n\nAFAIK, adding pages in a digital edition does not significantly affect the cost. Therefore, a requirement about a certain number of character per page isn't really expected.\n\nThe only reason a typeface like, say, Charis, would be unsuitable for a digital edition would be the, what, \"affectation?\" of the type itself -- I wouldn't particularly want to set love poetry in Charis. Or Times Roman, or even Minion, for that matter. Yes they will work, but it's like setting a Raymond Chandler mystery novel in Palatino.\n\nTypefaces that work only in a very small size range are almost always the result of poor type design. There is something about the spacing of the elements in the font that keeps things from working. Most often, that's is from poor letterfit. Sometimes simply changing the word space value helps, but that is both easy and not usually a fix. Sometimes the spacing problems come from the letterforms themselves, which is the hardest to fix. And all too often, more than one factor is at play in a font.\n\nFinally, there usually is a limit in which any single-master typeface (as are almost all digital typefaces) can be sized to work well. The internal spacing of the characters just won't take a setting beyond X, or less than Y. For example (in print), a lot of fonts called \"text\" fonts start to break down around 12-point setting, or less than 8-point. But this as nothing to do with \"Charis\" it is a phenomena of any single-master-size type. design.\n\n> A fixed-layout EPUB would allow that but is only really effective when you have target devices in mind that will compliment your layout.\n\nYes. Though just as type is scalable in a small range, so too is a layout. You can't, I think, have a layout that works for a 7-inch tablet an also for a 4.5-inch phone. But you probably can have one that works for a 7 & 8.25 inch (diagonal) tablet, and another that works for either the 4.5 & 5.5 inch (diagonal) phones.\n\nYou probably need four sizes to cover all devices if offering a fixed layout product. I think I can design and execute that as cheaply as I can execute a good ePUB2, with similar features. It will look far better, and won't **break** depending on device and app, as epub so often does, esp. when you add anything fancy.\n\n& that's the real question.\n\n"
    },
    {
      "time": "25 Jan 2014 — 7:55am",
      "content": "\\> Thirty years of book design has not shown me this.\n\nIt's never too late to learn the true power of type.  \nHow long has Vignelli been doing his thing? The poor shmuck still has no idea.\n\n(I'll try to read the rest later.)\n\nhhp\n\n"
    },
    {
      "time": "25 Jan 2014 — 6:17pm",
      "content": "> I'll try to read the rest later.\n\nThat's Hrant. **Fire!** followed somewhat later by ready, aim.\n\nAurélien, if it hasn't occurred to you yet, asking people who make fonts for a living sometimes occasions a knee-jerk reaction -- always negative -- to the notion of free fonts. The only free fonts Hrant seems to like are those with an Apache license. You'll have to read his posts to find out why, I'm not going into that.\n\nBurried in that 30 years of book design reamark is the following -- much other work is working as a compositor with some of the best book designers in the U.S. These were/are book to be read, not the AIGA coffee-table books typically found in the \"50 Best books\" shows.\n\nWe learned together what can be done, from the days of metal, early photocomp, and on to today. The degree of control -- the ability to make minute changes -- has steadily increased, and while the nature of spatial relationship hasn't changed, what can be done has, and that should inform the theorists. It will take a while, I suppose.\n\nHere's a place to think about, to look, rather than just theorize: For the fun of it, go look at books set after 1910 and before, say 1990, when leading was often 2 points. (i.e., nominally 10/12). Look esp. at fonts with significant extenders. Now look at the word spacing, and see if it doesn't look about right. Not theory, use your eyes, and **read**. Now notice that spaceband values of the time were typically a 5-t0-em as the smallest used (actually, 4 units on an 18-unit em), with 5 units being \"ideal.\"\n\nTake the same type, same text, and set it with a current fashion, say 14-point of leading (10/14). All of a sudden, that word space value can get smaller. Do you know why?\n\nMaybe that's why wordspacing in fonts has dropped to a 5-to-em space -- sometimes less -- as ideal. The new Adobe Text Pro Regular font comes as published with a space value of 213. That's about 4.6-to-em space. Using the stock InDesign justification parameters of 80-100-whatever, that's almost a 6-to-em space allowed as the smallest. And that kind of thinking is new, and has nothing to do with the letterforms, which are quite conventional.\n\nSimilar things apply to both to letterforms and their internal spacing, and kerning.\n\nFor example, before kerning a font, I set up a string of works, with a period in it. Say\n\nThe fol. lost many things\n\nI first adjust the right side bearing of the period (after \"fol\" in this example) to get the spacing of that string that I want. Not too much, not ersatz \"French spacing.\" Not too little, so the small dot dissappears into completely even spacing. I'll confirm that value with a few capitals following the period, as well (not just the lower-case \"l\"). Same with the comma, and quote marks. Then the left side bearing of the quoteleft(s). Colon, semicolon, question and exclamation mark come into play, though as less common, the values aren't weighted as heavily.\n\nIn other words, I start by getting the space between words that I want, with or without punctuation. Everything else keys off that.\n\nEtc. To me, spacing a font is a mater of words, at text size, for books, for for people who read, not admire letterforms. Don't care about museum walls when working with type.\n\nI'm sure Massimo Vignelli is a master of all the trades he practices; I'll allow I'm not aware of reading a book set according to his designed.\n\n"
    },
    {
      "time": "25 Jan 2014 — 9:03pm",
      "content": "Your poisonous, entrenched stance against type designers is such a big fat target that one can save a lot of time not aiming.\n\n(But still, I'll try to read the rest later.)\n\nhhp\n\n"
    },
    {
      "time": "26 Jan 2014 — 2:54pm",
      "content": "> Your poisonous, entrenched stance against type designers ...\n\nNot at all. Only those type designers who feel they are a worthy stand-in for Ozymandias in his time of power, then (attempt) to instruct.\n\n"
    },
    {
      "time": "26 Jan 2014 — 9:43pm",
      "content": "The thing is, the type designers you admire actually think your attitude is wrong.\n\nhhp\n\n"
    },
    {
      "time": "29 Jan 2014 — 8:49am",
      "content": "[This website](http://web.archive.org/web/20150416035804/http:/practicaltypography.com/charter.html) has a downloadable 900k zip file containing OTF, TTF, and webfont conversions of the Charter fam­i­ly donated to the X Consortium.\n\n"
    }
  ]
}
