{
  "id": "10876",
  "title": "Grillo",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I\n\n",
  "author": "fuentes bo",
  "time": "1 Apr 2003 — 11:01pm",
  "uid": "1547",
  "comments": [
    {
      "time": "2 Apr 2003 — 12:13am",
      "content": "Hi Santiago,   \n   \nNice \"G\", Maybe you can add this \"open\" feeling to other characters. I am thinking about open that \"Q\", the idea is to make a rithm with this straight breaking angle.   \n   \n   \nMH\n\n"
    },
    {
      "time": "18 Apr 2003 — 2:27pm",
      "content": "A new sample.   \n   \n ![Grillo2](http://web.archive.org/web/20131011094757im_/http:/www.typophile.com/forums/messages/29/8937.gif)\n\n"
    },
    {
      "time": "2 Jun 2003 — 3:31pm",
      "content": "Hi   \n   \nI'd reconsider the G, it looks great in a type sample, but it would make the font a lot less usable.   \n   \nJim   \n====================   \n [http://www.unionfonts.com](http://web.archive.org/web/20131011094757/http:/www.unionfonts.com/)\n\n"
    },
    {
      "time": "9 Jun 2003 — 11:00pm",
      "content": "Santiago - i'd politely disagree with Jim.   \nKeep the G (you could always find   \nan open slot for a regular G). The G is actually a selling   \npoint if you decide to sell the font. Find some alternatives   \nto some of the other vanilla glyphs and maybe you'll have   \na nice alternative to Trade Gothic or Alternate   \nGothic.   \n   \nbj\n\n"
    },
    {
      "time": "10 Jun 2003 — 2:56am",
      "content": "The G is terrible. I'd go further: the G is not a G. It is not, as drawn, a letter of the Latin script.   \n   \nThe revised Q, on the other hand, looks very good.\n\n"
    },
    {
      "time": "10 Jun 2003 — 4:41am",
      "content": "Santiago: Sorry pero no me gusta la \"G\"...   \n(BTW... A ver si nos tomamos unas birras antes de que me vaya). Abrazo.\n\n"
    },
    {
      "time": "10 Jun 2003 — 6:56am",
      "content": "To be rude, what is the objective of this new font? Seems so boring and close to existing fonts.   \n   \nG feature is the only originality, but as described by John, not really suitable for such typeface. The question you need to ask yourself: How to implement funny things as this G, in a way it give more interest to this typeface, whithout destructing the legibility?   \n   \nIf its just an exercice, its ok.\n\n"
    },
    {
      "time": "10 Jun 2003 — 7:56am",
      "content": "So JF, what do you think of Keith's \"Arrival\"?   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jun 2003 — 8:37am",
      "content": "Hrant, what's the point of your question?\n\n"
    },
    {
      "time": "10 Jun 2003 — 8:57am",
      "content": "Eduardo: thanks to ask! :-)\n\n"
    },
    {
      "time": "10 Jun 2003 — 9:02am",
      "content": "I'm wondering if I'm failing to see a certain originality in Arrival that spares it from being called \"boring\".   \n   \n(I'm not talking about techinical issues - where Arrival seems superior to Grillo - although to be fair the latter is still in development.)   \n   \n\\> thanks to ask!   \n   \nI answered my question - now it's your turn! :-)   \n   \n--   \n   \nBTW, Santiago, your lc spacing is too tight.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jun 2003 — 9:14am",
      "content": "Thanks for the feedback all of you. Development of this typeface is now truncated for a good while because I\n\n"
    },
    {
      "time": "10 Jun 2003 — 10:28am",
      "content": "\\>\\> The G is terrible. I'd go further:   \nthe G is not a G. It is not, as drawn,   \na letter of the Latin script.   \n   \nPoint taken. I guess I have a soft spot for underdogs   \nand black sheep.   \n   \nAny reasonable third person would read the glyph as a G...   \n   \nI'm not saying set continuous text using the G, but for   \ndisplay, have some fun. Variety is the spice of type   \nfor some of us.   \n   \nbravo! to Santiago for his \"terrible\" G.   \n   \nbj\n\n"
    }
  ]
}
