{
  "id": "10873",
  "title": "UPS",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Have you seen the new UPS logo? The original Paul Rand design (package tied up with string) has been replaced with a shield shape with a Photoshop emboss-type effect. I think it looks kind of like the RAID insecticide logo -- also screams \"designed by committee.\"   \nComments?   \n [www.ups.com](http://web.archive.org/web/20131016203536/http:/www.ups.com/)\n\n",
  "author": "dctroy",
  "time": "1 Apr 2003 — 8:10pm",
  "uid": "1210",
  "comments": [
    {
      "time": "1 Apr 2003 — 10:33pm",
      "content": "My first thought: home security.\n\n"
    },
    {
      "time": "2 Apr 2003 — 2:47am",
      "content": "It would look killer on a pink Judge Dredd uniform though. With a big, massive chain and all.\n\n"
    },
    {
      "time": "2 Apr 2003 — 6:11am",
      "content": "why does everything have to be 3d?   \njust 'cause you have photoshop   \ndoesn't mean you have to use it.   \nsheesh.\n\n"
    },
    {
      "time": "2 Apr 2003 — 7:56am",
      "content": "It's odd that Rand himself offered to redesign the logo as he was admittedly 'uncomfortable' with parts of it, and UPS always declined... and now they come up with this swooshy 3D thing.   \n   \nAm I the only one who thinks FF Dax was an odd choice (especially considering everyone and their dog are using it these days)? I don't know, but in my head the two (UPS and Dax) don't quite mix.\n\n"
    },
    {
      "time": "2 Apr 2003 — 10:07am",
      "content": "Pretty alarming photo image on the UPS home page there--gives you the point of view of someone crouching on the median of a busy highway. What's next? Hanging over the top of a skyscrapper?\n\n"
    },
    {
      "time": "3 Apr 2003 — 6:51am",
      "content": "Thats positively tame compared to BTs (British Telecom's) new adverts. They went and Chisel extruded some metallic grey text and then drop-shadowed it onto a red background. Its like all of a sudden British design is taking its influences from American banks and Bling-Bling Rap albums. Next thing you know, The Royal Bank of Scotland will Diamonte-encrust its logo or something. Hideous. So much for the reputation...\n\n"
    },
    {
      "time": "3 Apr 2003 — 7:18am",
      "content": "I'm not so sure - the top border of the new shield sure looks swooshy to me. I don't like the lightly tucked in sides either - trying to visually stress the 3d thing?   \n   \nI thought they (UPS) were in a real mood of loving themselves. All the commericals about \"brown\" and now to go and change their logo is a bit disingenuous to me.   \n   \nI think the new logo is trying to look important. Plus, I am the only one that thinks the stock photography people shots are silly? They keep showing people and computers, but no packages or people delivering them. Weird to me.\n\n"
    },
    {
      "time": "3 Apr 2003 — 8:24am",
      "content": "\\> all of a sudden British design is taking   \n\\> its influences from American banks and   \n\\> Bling-Bling Rap albums.   \n   \nThere is no more Britain. It's now a US state.   \n   \n\\> They keep showing people and computers   \n   \nBecause you don't get the masses' money by making them think it's about what they do/make/ship, but by making them think the world is about _them_. For example, what do you think the \"i\" in \"iMac\" stands for? It's all simply an appeal to vain narcisism. Me, myself and I and me and me and me. But of course the individuality is an illusion - it's confined to things like shampoo odors. This illusion (which actually extends to things like voting) is exactly what makes people easier to control, easier to trick into working hard and giving you their money.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Apr 2003 — 8:46am",
      "content": "_There is no more Britain. It's now a US state._   \n   \nThere's hope yet, Hrant. British soldiers are starting to complain about American attrocities in Iraq. Bodes well.   \n   \n_But of course the individuality is an illusion..._   \n   \nRemember the scene in _The Life of Brian_ ?   \nBrian: \"You're all individuals\"   \nThe crowd (with one voice): \"Yes, we're all individuals\"   \n   \nOn the subject of the UPS logo. They really had to do something. The vans looked old, the logo looked old and there was the new FedEx logo zooming all over town. Makes sense.   \n   \n_So much for the reputation..._   \n   \nWhat reputation?   \n  \nMatha.\n\n"
    },
    {
      "time": "3 Apr 2003 — 9:53am",
      "content": "The UPS logo makes me think of Park Service,   \nPark Ranger...Smokey the Bear delivering boxes?   \n   \nI've been seeing the Quiznos redesign quite   \na bit lately, and I cannot say it has grown on me.   \n   \nThis redesign makes the Subway redesign look   \npositively brilliant.   \n   \nThe old logo is in the typophile hall of shame   \nfor those who have not seen it...   \n   \nwait, click around on their site and you will   \nsee the old logo AND the new logo.   \n   \n [www.quiznos.com](http://web.archive.org/web/20131016203536/http:/www.quiznos.com/)   \n   \nhmmm.   \n   \n1. They took some left over swooshes from some   \ndefunct dot-com and made a Q.   \n2. They now call it Quiznos sted of Quizno\n\n"
    },
    {
      "time": "3 Apr 2003 — 12:09pm",
      "content": "\\< [www.quiznos.com](http://web.archive.org/web/20131016203536/http:/www.quiznos.com/)  \n  \nWhat the hell is that in the picture? A chicken Carbonara Sandwich?   \nDefinitely a weapon of mass destruction.   \n  \nM.\n\n"
    },
    {
      "time": "3 Apr 2003 — 1:59pm",
      "content": "It's actually design by Futurebrand, apparently. Here's [more](http://web.archive.org/web/20131016203536/http:/www.identityworks.com/Reviews/2003cases/ups.html), found in the comments of a similar thread on [Under Consideration](http://web.archive.org/web/20131016203536/http:/www.underconsideration.com/speakup_v2/).\n\n"
    },
    {
      "time": "4 Apr 2003 — 3:49pm",
      "content": "is it just me, or does the logo just look like a bad cutout job in photoshop? (only on a white background)   \n   \n ![upslogo](http://web.archive.org/web/20131016203536im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n"
    },
    {
      "time": "5 Apr 2003 — 11:59am",
      "content": "I loved the write up justifying it all, especially when they need some long   \nwinded PR person explaning it. \"reflecting the new capabilities...corporate evolution\"   \n  \nlike I said on another forum: I expect that these new capabilities include delivering pizza? I mean that look is quite prominent on all my 2 for 1 flyers.   \nSo 'FutureBrand' (are they from the future?) used the default millenium swooch!?, how on earth can they claim to be the authority after this. If I were them I'd want my name taken off the press-release.   \n  \nhmm, just checked out futurebrands site. they don't mention the UPS logo yet. there's barely a comment about 'design' anywhere in fact they seem to be 'marketing, communications, strategists, and CEO's with a masters in finance? - perhaps they should outsource the visual aspects for their clients. the portfolio is very weird, thousands of bignames and a jpg of the ID, but I doubt they designed them...the blurb underneath dosen't say they did, but they post the ID?\n\n"
    },
    {
      "time": "6 Apr 2003 — 7:40am",
      "content": "from [http://www.identityworks.com/Reviews/2003cases/ups.html](http://web.archive.org/web/20131016203536/http:/www.identityworks.com/Reviews/2003cases/ups.html)   \n   \n\\>\\>The new shield is far more muscular, even militaristic...   \nappropriate for expressing preemptive competitive intentions.   \n   \num, should we be worried about this? or maybe just iraqi   \nparcel services should worry. does this mean ups will now   \ndeliver bombs? will there be overnight service for those?   \nso many questions.\n\n"
    },
    {
      "time": "6 Apr 2003 — 8:36am",
      "content": "Murder is the new brown.   \nGet with it, kill an under-consumer!   \n   \nhhp\n\n"
    },
    {
      "time": "6 Apr 2003 — 9:19am",
      "content": "The new UPS logo is aggressive- looking?   \n   \nNow I'm seeing it, but my first reaction was that it reminded me of the dippity-do hair on the Big Boy burger guy...\n\n"
    },
    {
      "time": "9 Apr 2003 — 8:27am",
      "content": "I've heard many points about how bad the   \nnew design is. There's the 3D, the \"swoosh\",   \nthe overused type... oh the horror.   \n   \nI've heard very little about what made the old   \nlogo \"good.\" Apart from the fact that it was   \ndesigned by St. Paul.   \n   \nOf course I'm playing devil's advocate here.   \nBut in my opinoin, it could be a lot worse   \n(Verizon). The same uproar happened in the   \ndesign community when AT&T 3D'd their   \nalready 3D looking 2D logo. I would say in   \nboth cases, they are still effective logos.   \nMainly because both companies are willing   \nto implement their new logos with incredible   \nconsistency at incredible expense. It may   \nnot be better, but still servicable.   \n   \nRandy\n\n"
    },
    {
      "time": "9 Apr 2003 — 2:45pm",
      "content": "If Rand wasn't happy with it, then why dwell on it? Obviously he did not like it. And I would tend to agree with his opinion first. It was a poor decision for UPS to accept the first logo and similar dedcision making on this new one too.   \n   \nI don't care for the new one either, but the string HAD to go. When was the last time any of us saw a package with string? In the industry that UPS and FEDEX are in I can see how any reference to the \"old\" or \"archaic\" would be a bad thing. No matter how much we as designers may like the traditional.   \n   \nBut I am interested to see how they translate the new logo to one color printing. Or even two color. That element of Rand's original that made the old logo so universal.   \n   \nI had also heard that the reason that UPS went with the color brown in the first place was legal. I forget the details I heard, but UPS was required (legally somehow) to \"down-play\" their presence. Can anyone recall this legal issue?\n\n"
    },
    {
      "time": "10 Apr 2003 — 7:43pm",
      "content": "The Verizon logo really is the worst. And you can't get away from it. The throw-away attitude about design among major U.S. companies like UPS and Verizon is such a dramatic contrast with the Netherlands, where it seems like every square inch of the country has been well thought out and artfully designed. (Not to slight any other Euros, it's one of the few European countries I've visited.) Payphones, grocery stores, public toilets, sidewalks... they're all beautiful in their attention to detail and their functionality. That was my impression, anyway.\n\n"
    },
    {
      "time": "10 Apr 2003 — 7:49pm",
      "content": "You should check out Barcelona!   \n(I'm actually going to be there for a few days at the end of May.)   \n   \nhhp\n\n"
    },
    {
      "time": "11 Apr 2003 — 12:08am",
      "content": "Troy, everything about the Netherlands was designed, I mean that country was litterally built.\n\n"
    },
    {
      "time": "2 Apr 2003 — 9:27am",
      "content": "Whatever happened to figure/ground in logo designs? Did we collectively decide to forget gestalt psychology? Is there a memo I didn't get?   \n   \nOn the up side, at least there's no goddamned '@' sign or swoosh.\n\n"
    },
    {
      "time": "3 Apr 2003 — 9:32am",
      "content": "At least FedEx had the good sense to commission a nice, versitle, graphic logo (and I love the arrow counterform).   \nThen again, the humor of the FedEx logo, is that the arrow is always pointing the opposite direction the vans travel.   \nI have to assume the three-dimensional aspect is to reflect \"depth\", but it's one step shy of having a 3D spinning logo.   \n   \n\\>\\> I thought they (UPS) were in a real mood of loving themselves. All the commericals about \"brown\" and now to go and change their logo is a bit disingenuous to me.   \n   \nGood call...I thought that \"brown\" this was alot more intelligent than the new logo. It at least played on the company's strengths.\n\n"
    },
    {
      "time": "3 Apr 2003 — 1:51pm",
      "content": "I read that the original brown trucks and original logo were   \nmeant to convey reliability in a way that government   \norganizations meant reliability (past tense). I can see how   \ntheir recent 'brown' campaign has tried to distance UPS   \nfrom that government image.   \n   \nThe new logo? It looks like design by committee. Or it could   \njust be design by Landor.\n\n"
    },
    {
      "time": "8 Apr 2003 — 4:23pm",
      "content": "For reference:   \n   \n ![brown](http://web.archive.org/web/20131016203536im_/http:/www.typophile.com/forums/messages/4100/8503.gif)   \n   \n ![brown2](http://web.archive.org/web/20131016203536im_/http:/www.typophile.com/forums/messages/4100/8504.jpg)\n\n"
    },
    {
      "time": "8 Apr 2003 — 4:46pm",
      "content": "Regarding their longwinded PR justifying the design... I'm   \nsure this is aimed at satisfying the investors--not design   \ncritics.   \n   \nFuturebrand's fee will be miniscule compared to the truck-   \nloads of money (ahem, wordplay intended) required to   \nredo their liveries, signage, packaging, stationery, etc, etc.   \nI'm sure their investors are wary of that kind of spending in   \nthe current economy.\n\n"
    },
    {
      "time": "8 Apr 2003 — 4:47pm",
      "content": "...and at _[Typographica](http://web.archive.org/web/20131016203536/http:/typographi.ca/000561.php)_.\n\n"
    },
    {
      "time": "10 Apr 2003 — 1:12pm",
      "content": "Good points Randy and M.   \n   \nI have no idea about the legalities behind the color, if any.   \nBut, you can see how their desire to seem like a government   \nagency played out in almost everything -- brown, the   \nshield, the name. United Parcel Service (UPS) is very similar   \nto their closest competition at that time, the United States   \nPostal Service (USPS).\n\n"
    },
    {
      "time": "10 Apr 2003 — 2:04pm",
      "content": "_Randy said: Of course I'm playing devil's advocate here. But in my opinoin, it could be a lot worse (Verizon)._    \n   \nFunny, FutureBrand claims fame to the Verizon logo.   \n   \nI think the bow and parcel concept and its reason to change, being \"outdated\" is retarded. The string, bow and parcel weren't used in the first place because Rand or UPS beleived that's the way they delivered packages. Its because its a \"gift\" and relates to the emotional level of receiving a delivery. Saying it was outdated to logistics is like re-designing Col. Saunders head shot with a business suit and tie, giving him plastic surgery because he looks old. Its all irrelevant, and ignores their corporate values.   \n   \n(cleaned my cookies, lazy - going anon, but its me Tanya)\n\n"
    },
    {
      "time": "11 Apr 2003 — 12:19pm",
      "content": "At least the Verizon logo replaced the awful Bell Atlantic   \nlogo--too bad two wrongs don't make a right.   \n  \nOn a recent trip to Berlin my host was showing me all these   \ngreat architectural/historical sites and laughing at me   \nas I only photographed the logo and type sample we came   \nacross.   \n  \nAn American design tourist... that must be a sight. I did   \nleave my Mickey ears and hawaiin shirt at home though.\n\n"
    }
  ]
}
