{
  "id": "10884",
  "title": "Feynman Regular 1.0 a",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Font newbie's first serious sans font: feynman Regular. This font was originally concieved as a bitmap font, which you can see in the Bitmap forum under UnNamed plain.   \n   \nWas aiming to achieve roundness and flow, but kerning needs a little work. Haven't done capitals yet.   \n   \nPlease tell me what you think.   \n   \n ![bloogle](http://web.archive.org/web/20150414094023im_/http:/www.typophile.com/forums/messages/29/833.gif)   \nMatthew Brown.\n\n",
  "author": "matthew_dob",
  "time": "19 Feb 2002 — 4:48pm",
  "uid": "600",
  "comments": [
    {
      "time": "19 Feb 2002 — 6:45pm",
      "content": "Interesting. I see lots of signature design elements of several of my favorite typefaces in your design. Your lowercase \"e\" reminds me of (Dutch) Lust Foundrys' Pure, There is elements that remind me of Graphic Behaviours' Aspirin ( T26 distribution), as well as OCR B and Shifttypes' BetaSans. I like the balance.   \nNice Work.   \nIs this an original or an extensive remix.   \n  ![lust e.jpg](http://web.archive.org/web/20150414094023im_/http:/www.typophile.com/forums/messages/29/834.jpg)\n\n"
    },
    {
      "time": "20 Feb 2002 — 1:36am",
      "content": "This is an original. Actually, the pixel font came first, created out of desire for legibility. The sans creation followed naturally.   \nMatthew Brown   \nP.S. anyone in the u.k. who reads the mostly useless magazine \"create\" may see similarities in one of the typefaces. This is purely coincedental.\n\n"
    },
    {
      "time": "20 Feb 2002 — 4:47pm",
      "content": "the lc 'z' seems a bit wide too? and the 'v'? i really like the lc 'k' and i agree with david's comment on the lc 't'. yummy overall. i prefer yours to lust. even if they are from the same, can we say genus(?), yours has all the little bits boiled off.\n\n"
    },
    {
      "time": "20 Feb 2002 — 10:29pm",
      "content": "On the topic of remixing typefaces, De-construction, Revivals, etc. I think that it is nice to see old work reworked into something new. A good example would be the work of Swiss designer Cornel Windlin who created a rough typeface called FF Magda (fontshop/Lineto) which was the reworked into Magda Clean by Critzler. I believe it was later reworked into something else altogether. I would like to see more of this, as long as the original designers are getting the proper credit and fees. I would like to interest anyone in this type of collaboration with a couple of my own typefaces. (see Unicratica posting in SanSerif section)\n\n"
    },
    {
      "time": "21 Feb 2002 — 11:03am",
      "content": "a bit of flash for your delectation...\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414094023im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">flash<br><a href=\"http://web.archive.org/web/20150414094023/http:/www.typophile.com/forums/messages/29/fonttest.swf\"><b>fonttest.swf</b></a> (2 k)</td></tr></table></center>   \n   \nMatthew Brown!-/attachment-!\\>!-attachment:\\> \n"
    },
    {
      "time": "22 Feb 2002 — 8:08pm",
      "content": "I like the new @ symbol. I think the obvious solution would have been the @ you showed in the first image you uploaded. I usually like the less obvious solutions that require the extra creativity and thinking (outside the box). It is often the small details like this that get the licensing fees when I shop for fonts, and distinguishes the amateur from the professional designers. Nice work.\n\n"
    },
    {
      "time": "22 Feb 2002 — 8:38pm",
      "content": "I took a little time to stydy the letterforms again and think I see something that could use a little improvement. I noticed the counters on the thicker weights seem to have too confined counters which offsets the visual balance in the letterforms.I believe this is one of the drawback from generating multiple weights with software solutions such as Fontographer. I think the best way to correct this is to actually redraw the thicker weights so the letters are actually a little wider. This is obviously very time consuming so I guess it depends on what level you wish to take this to. Alias's Gareth Hague and David James's Metsys is a good example of what I am talking about. I spent $180 on this 5 weight face, which is more than I am normally willing to spend on a non-text family, but I have used it on lots commercial work, and in my opinion it was worth it. I think it would be worth the extra effort if you want to sell this font commercially.   \n   \n ![metsys.jpg](http://web.archive.org/web/20150414094023im_/http:/www.typophile.com/forums/messages/29/843.jpg)\n\n"
    },
    {
      "time": "24 Feb 2002 — 5:59am",
      "content": "This is a flash chat app I have been developing with a VB programmer friend.   \n ![getchatting](http://web.archive.org/web/20150414094023im_/http:/www.typophile.com/forums/messages/29/852.gif)   \n   \nMatthew Brown   \n   \nP.S. Is my font worth anything? and if so, how much? and where should I sell it?\n\n"
    },
    {
      "time": "24 Feb 2002 — 11:24am",
      "content": "(Is this supposed to be here? Anyway...)   \n   \nTo sell bitmap fonts, you need more than quality - you need a reputation. But your name is pretty close to \"Matthew Bardram\", so maybe you have a shot... ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "24 Feb 2002 — 2:36pm",
      "content": "Of course, sorry...   \n   \nConcerning interpolation, what I did in the case of Patria was the following:   \n1. Drew and digitized a weight close to what I thought Regular \\*would\\* be.   \n2. Made the two extremes by modifying that weight (starting with an automatic FOG weight change but then making the Light's thins thicker and the Bold's thins thinner\\*, for starters).   \n3. Cleaned up the two extremes to make them look nice on their own.   \n4. Dumped the original Regular.   \n5. Made two intermediate weights (the exact \"location\" of which depended on many things).   \n6. In order to maximize continuity, I did \\*not\\* clean up the intermediate weights, instead going back and modifying the two extremes to get the intermediates that I wanted.   \n   \n\\* Although maybe I should have made the thicks thicker, considering the Bold might not be bold enough... I didn't leave myself enough room (maybe even on the light extreme), that's for sure.   \n   \nExample of #6: If I saw that the lc \"k\" in the interpolated Regular had an upper arm that was too thin, I'd look at the two extreme \"k\"s to see which one was causing the problem (sometimes it was both), and did the modification(s) there, and then regenerate a new Regular.   \n   \nSo the eventual Regular was a little different (and ended up lighter) than my original design, but it wasn't really worse, and it was a \"clean\" interpolation. And I got a clean Demi with no extra work.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Feb 2002 — 5:01am",
      "content": "And some capitals...not sure about the B or D, would like comments\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414094023im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">swf<br><a href=\"http://web.archive.org/web/20150414094023/http:/www.typophile.com/forums/messages/29/typetest.swf\"><b>typetest.swf</b></a> (3 k)</td></tr></table></center>   \n   \nMatthew 'Bardram' Brown!-/attachment-!\\>!-attachment:\\> \n"
    },
    {
      "time": "26 Feb 2002 — 10:49am",
      "content": "Looking nice, Matthew. I like the leafy terminal   \non the 'a'. Would you consider adding that to   \nother glyphs like the 's' or 'f'?   \n   \nStephen\n\n"
    },
    {
      "time": "20 Feb 2002 — 11:08am",
      "content": "The pixel version is in the [bitmap critique](http://web.archive.org/web/20150414094023/http:/www.typophile.com/cgibin/show.pl?29/814.html). \\>\\>\n\n"
    },
    {
      "time": "20 Feb 2002 — 3:35pm",
      "content": "It looks to me that, once again, any similarities are simply a consequence of there being only so many ways to design a font based on a strict grid structure. It's easy to see the grid structure underlying both Feynman and Lust Pure, and it looks like they have both used an identical or very similar grid. That, of course, does not imply plagiarism any more than Avant Garde Gothic can be said to have copied Futura. The ground rules are the same, but the path to completion is different.   \n   \nHaving said that, I should add that of the two samples, I prefer Feynman; although I do like the quirks of Lust Pure. I could easily see myself using either font.   \n   \nOne suggestion for Feynman: I would shorten the height of the lc \"t\" by one stroke-thickness (or one grid block, if you prefer). It looks unnaturally tall, especially next to a full-height lc \"h\".   \n   \nYou also might consider shortening the overhang of the lc \"r\" by the same amount.   \n   \nNice work!   \n   \nDavid\n\n"
    },
    {
      "time": "20 Feb 2002 — 8:59pm",
      "content": "Speaking of antecedents, there's a little Handel Gothic in there as well.   \n   \nMy two cents: The lc 's' needs work. The transition between the curves is sketchy, and I'd prefer to see the lower curve extend further to the right.\n\n"
    },
    {
      "time": "22 Feb 2002 — 10:55am",
      "content": "I like a lot of what you have going on. In   \ngeneral I'm intrigued by the idea of robust   \nbitmaps (hand-built for screens) and outlines   \nworking together.   \n   \nI have to say though, that what I don't like   \nabout your sample is the Handel Gothic-ish   \nbits. The m, the u, and the a seem somewhat   \npredictable. (Whereas I think the g, k, b and others   \ntake a nice departure from the bitmap.)   \n   \nI would love to see a sample setting with both   \nfonts working together--as they would on a   \nweb site.\n\n"
    },
    {
      "time": "24 Feb 2002 — 1:58pm",
      "content": "Hrant, if you were listening earlier, you would have   \nseen me ask for a sample of the outine face and   \nthe bitmap running together...   \n   \nThe sample is nice. There's a clear connection   \nbetween the outlines and the bitmap. Good luck with it.   \n   \nYou're right about hand-drawing vs. the   \nautomatic software stuff. I've heard designers   \ndiscuss hand drawing the 'key' weights (e.g.   \nregular, light, bold) and then using software to   \nfill in the other weights (e.g. extra light,   \nmedium, extra bold, etc.).   \n   \nI guess you'll have to decide how many   \nweights you want to do (or are worth doing).\n\n"
    }
  ]
}
