{
  "id": "10897",
  "title": "Copyfitting",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "does anyone know of a website explaining copyfitting preferably with copyfitting tables...   \nif I choose 9/11 helvetica and set at 22pica ems, with 36 lines to a page how many pages will there be etc\n\n",
  "author": "anonymous",
  "time": "22 Feb 2002 — 9:33am",
  "uid": "1203",
  "comments": [
    {
      "time": "25 Feb 2002 — 9:10am",
      "content": "neither have I!!   \nbut I need this information for research   \nin regard to dealing with large manuscripts for publishing   \nbut thanks anyway\n\n"
    },
    {
      "time": "10 Mar 2002 — 5:56pm",
      "content": "Will, hope this helps.   \n   \n ![copyfitting](http://web.archive.org/web/20140803112403im_/http:/www.typophile.com/forums/messages/30/938.gif)\n\n"
    },
    {
      "time": "10 Mar 2002 — 5:58pm",
      "content": " **To calculate the number of layout pages required to flow an article, use the following algorithm.**   \n   \nNote: In today's world, copy is readily available in digital format. Most major word processing software can give you a character account. (Microsoft Word: Tools/Word Count) If a character count is not available but you have a printed copy of the article, use steps 1 and 2 to estimate the total # of characters in the article:   \n   \n**Estimating the total # of characters in original hardcopy:**   \n   \n1. Average the number of characters per line by counting the characters in the longest and shortest line and dividing by 2.   \n   \n2. Multiply (the result of #1) by (the total number of printed lines in your hardcopy) to get the total # of characters in your copy.   \n   \n   \n**Calculating the # of pages needed in your finished format:**   \n   \n3. Multiply (the # of characters per finished line) by (the # of lines in finished column) to get the total number of characters in your finished column.   \n   \n4. Divide (the result of #2) by (the result of #3) to get the # of columns needed in your finished format.   \n   \n5. Divide (the result of #4) by (the number of columns per page) to get the total number of text-only pages in your finished format.   \n   \nNow that you know the sheer amount of text space you'll have to account for, you can now estimate the number of pages you'll actually need to reserve after considering imagery, headlines, and overall pacing.\n\n"
    },
    {
      "time": "25 Feb 2002 — 12:02am",
      "content": "I haven't used those since the introduction of DtP ...   \n   \nSoren O\n\n"
    }
  ]
}
