{
  "id": "10900",
  "title": "Most UNDERused Type",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I really enjoyed the \"Most Overused\" thread, and Keith volunteered a most underused face. What do you think is a type that has been ignored? The most underused or overlooked type... and I'd like you to pick (at least) two: one from the last five years or so, and one older than that, preferably 10 years old or more.   \n   \nThanks,   \n   \nTroy\n\n",
  "author": "dctroy",
  "time": "4 Apr 2003 — 4:35pm",
  "uid": "1210",
  "comments": [
    {
      "time": "4 Apr 2003 — 6:32pm",
      "content": "Confining my choices to fonts that are available digitally:   \nAdobe Kinesis: the best font in the Adobe stables - no exceptions.   \nITC Octavian: a jewel of a text face. I even like its Italic.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2003 — 3:12pm",
      "content": "Antique Olive Nord by Roger Excoffon (1962)   \nGill Sans by Eric Gill (1929 ish)   \n   \nI notice that Gill Sans turned up in the most overused font thread too. Whenever I see anything trying to evoke a 1930s feel (which is quite a lot at the moment), they always use a font with Deco in its name. Some of these fonts are nice, but they're much less common in real objects from the 30's than you would think. From 1935 Gill Sans was used for the Penguin book covers which epitomise good quality 1930's design and (because they were in every house right up to recent years) really bring out that time period in the mind of almost everyone over 20. (In the UK at least - don't know if they are the same in the US).\n\n"
    },
    {
      "time": "7 Apr 2003 — 3:16pm",
      "content": "Charter by Matthew Carter? I really love this type... a very elegant workhorse type and works well in low and high resolution. Now that's quite an achievement. It's really underused. I use it quite a lot myself.   \n   \nI think I mentioned this somewhere else already.   \n   \nI'll think of some other ones...\n\n"
    },
    {
      "time": "7 Apr 2003 — 3:22pm",
      "content": "Gill Sans is definitely NOT underused... Antique Olive Nord, maybe.   \n   \nPoppl Laudatio is very underused. I haven't found a use for it though!   \n   \nURW Grotesque by Hermann Zapf is extremely underused. I don't think I've ever seen it used in fact!   \n   \nPlantin is not seen much these days. Neither is Trump Mediaval.\n\n"
    },
    {
      "time": "7 Apr 2003 — 3:26pm",
      "content": "Oh, how about ITC Garamond?!   \n   \nIt was overused for about two decades, and now you hardly see it... even Apple abandoned it!\n\n"
    },
    {
      "time": "7 Apr 2003 — 3:34pm",
      "content": "\\>\\>Gill Sans is definitely NOT underused   \n   \nWell maybe not in your neck of the woods but I really don't see it much at all - I'm trying to think of the last time I saw it in something and I can't (OK, arrange the words red, rag and bull into a sentence and wait for the deluge...)\n\n"
    },
    {
      "time": "7 Apr 2003 — 11:02pm",
      "content": "Steve, go to England: it's like Gill Sans is the national typeface. It is so overused, and yet so expected, that Jeremy Tankard has found an eager market for his Bliss: the very British sans that isn't Gill.\n\n"
    },
    {
      "time": "8 Apr 2003 — 12:48am",
      "content": "John   \n   \nI'm in England.   \nNow I've had a night's sleep I'll get back to trying to think of the last place I saw Gill Sans   \n   \nMaybe I'm looking in the wrong places.   \nI've just got in to work and on my desk (or nearby) are a dozen or so junk mails, a diary, two mousemats, two newspapers, assorted computer hardware with logos, a couple of novels, some software manuals, some magazines, some blank CDs in jewel cases etc etc - all this stuff with type of all shapes and sizes and hardly a sign of Gill Sans.\n\n"
    },
    {
      "time": "8 Apr 2003 — 12:49am",
      "content": "A book came to mind on related subject:   \n   \n\"Types best remembered, Types best forgotten\" by Robert Norton. Parsimony Press, 1993.   \n   \nI agree with Keith about Charter who can be a very good newspaper face among others of its qualities. Because of this situation, I recommended it for the Belgium newspaper Le Soir couple of years ago -- They use is everyday now.   \n   \nThe list came in mind include:   \nIcone, Times Europa, Hoefler Text, ITC Bodoni, FF Balance, Souvenir,   \nand yes, most of Poppl faces too.\n\n"
    },
    {
      "time": "8 Apr 2003 — 12:56am",
      "content": "I miss on my list   \nLubalin Graph, Serifa, Glypha, Boton, Versailles, Caecilia, etc.\n\n"
    },
    {
      "time": "8 Apr 2003 — 1:24am",
      "content": "Perhaps Gill is overused, but _underused well_?   \n   \nJFP ligatures, thats whats underused. ;)\n\n"
    },
    {
      "time": "8 Apr 2003 — 5:50am",
      "content": "Hello   \n   \nLubalin graph is one of my personal favourites.... i think it\n\n"
    },
    {
      "time": "8 Apr 2003 — 6:17am",
      "content": "The FF Wunderlich. This is COOL but   \ni never see in use!   \n   \n [http://www.wunderlich-design.de/seiten/typo.html](http://web.archive.org/web/20131018031259/http:/www.wunderlich-design.de/seiten/typo.html)\n\n"
    },
    {
      "time": "8 Apr 2003 — 8:30am",
      "content": "\\> Poppl Laudatio is very underused. I haven't found a use for it though!   \n   \nI've used it for years for (anti-aliased) on-screen text, in small and large sizes - it's a gem.   \n   \nPlantin: a man among boys.   \n   \n\\> even Apple abandoned it!   \n   \nWhat a relief.   \n   \n\\> Lubalin graph   \n   \nNo comment...   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2003 — 9:57am",
      "content": "I thought Apple's garamond was a custom   \nface. A quick seach brought up this link   \nabout the history of Apple Garamond. Turns   \nout, yes it was custom drawn, and yes it is   \nITC Garamond.   \n   \n [http://www.myfonts.com/fonts/itc/garamond/](http://web.archive.org/web/20131018031259/http:/www.myfonts.com/fonts/itc/garamond/)   \n   \nI respectfully disagree with you Hrant. It is   \nunfortunate to see Apple Garamond gone.   \nIn a market dominated by sans-serif Dells   \nand Compaqs, it was refreshing to see   \nsomeone thinking different. Tech != Sans   \n(or doesn't have to).   \n   \n [http://store.apple.com/1-800-MY-APPLE/WebObjects/AppleStore/](http://web.archive.org/web/20131018031259/http:/store.apple.com/1-800-MY-APPLE/WebObjects/AppleStore/)   \n [http://www.gateway.com/home/index.shtml](http://web.archive.org/web/20131018031259/http:/www.gateway.com/home/index.shtml)   \n(Yes, I did see those serifs on the new Gateway logo)   \n   \nNoooo!!!   \nAt least what is inside the box is still different.   \n   \nI don't want to sidetrack this great thread, so   \ncarry on. More underused gems please!   \n   \nRandy\n\n"
    },
    {
      "time": "8 Apr 2003 — 10:12am",
      "content": "Well, I do have to admit that Apple Garamond\\* was a good element of Apple's branding. It's just that the face itself is so revolting.   \n   \n\\* Which is basically ITC Garamond Light Condensed.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2003 — 1:20pm",
      "content": "\\>\\>Now I've had a night's sleep I'll get back to trying to think of the last place I saw Gill Sans   \n   \nDo you watch the BBC? they use Gill for almost everything save their corporate memos. Easyjet use Gill Sans Bold on their adverts.   \n   \nbut you could be being sarcastic... I'm british... I only understand irony   \n   \nMatthew\n\n"
    },
    {
      "time": "8 Apr 2003 — 2:48pm",
      "content": "\\>[Gill] is so overused, and yet so expected, that Jeremy Tankard has found an eager market for his Bliss.   \nBliss may be widely used in the UK, but I hardly see it here in the US. I think it is the most beautiful of the humanist sans, and would like to see much more of it here. Underused!\n\n"
    },
    {
      "time": "8 Apr 2003 — 3:18pm",
      "content": "What goes around comes around. For decades Plantin was a dreadfully overused face; now it is undeservedly neglected. CUP use it for some law books where it works well, in a setting that demands conservatism (mostly Times, or Sabon which seems to be the new Times for law texts). For decades Gill was underused, and now it's both overused and badly used, at least here in the UK: the EasyJet adverts are dreadful -- but the new Church of England 'Common Worship' book is rather fine.   \n   \nI'd say that pretty much all modern post-1980 text faces (with the exception of Minion and maybe FF Scala) are more or less underused, at least in books. Everyone using weedy looking grey Bembo with chubby semibold and half the ligatures missing ...\n\n"
    },
    {
      "time": "9 Apr 2003 — 12:45am",
      "content": "This topic is really country related.   \n   \nFor example: Bembo and Electra are NEVER NEVER used by any large publisher in France. Hard to find a book in French composed in Bembo.   \n   \nAbout Gill Sans, its everyhere here, for long. In pas two days, I received two documents from various sources composed in Gill Sans!   \n   \nI'm glad to don't see FF Wunderlich so much.\n\n"
    },
    {
      "time": "9 Apr 2003 — 1:06am",
      "content": "I agree with the country-thought.   \n   \nin Sweden where i live there has been a huge helvetica neue and avant garde period. i mean, helvetica neue i used for almost everything.   \n   \nBut you never see for example Anisette, or century gothic.\n\n"
    },
    {
      "time": "9 Apr 2003 — 5:57am",
      "content": "I don't see enough of Frutiger's Vectora in the US.   \n(Maybe I'm just blind) A great alternative to Univers   \nand Helvetica.   \n   \n [http://www.myfonts.com/fonts/linotype/vectora/](http://web.archive.org/web/20131018031259/http:/www.myfonts.com/fonts/linotype/vectora/)   \n   \nRandy\n\n"
    },
    {
      "time": "9 Apr 2003 — 6:10am",
      "content": "Vectora is around here in the States, in certain pockets of use. It was used to great effect for a few years in _Critique_ magazine, where I was first introduced to it. I used it extensively in the program guide for a yoga/wellness center several years ago, shortly after which, it was picked up by Yoga Journal (I like to think my use influenced them, though it may have just been coincidence). I seem to remember seeing it picked up in another, more mainstream magazine recently, but I can't recall which offhand.   \n   \nThere are a handful of books in production for the publisher I work with which are using Vectora as the sans-serif for secondary elements.   \n   \nBut, thankfully, it is far from overexposed. It's a great face, very sturdy and serviceable. The one drawback is that the excessive x-height can make it tricky to mix with other faces.   \n   \n-- K.\n\n"
    },
    {
      "time": "9 Apr 2003 — 8:12am",
      "content": "Speaking of an underused alternative to Helvetica, as much as I dislike Grotesks as a whole, I can't help but admire Unica.   \n   \n\\> I like to think my use influenced them   \n   \nConsidering how many font choices are out there, it seems pretty safe to think you did!   \n   \nhhp\n\n"
    },
    {
      "time": "9 Apr 2003 — 9:06am",
      "content": "Vectora is used by the U.S. edition of Esquire.\n\n"
    },
    {
      "time": "10 Apr 2003 — 1:20pm",
      "content": "Unica as an alternative Grotesk?   \n [this](http://web.archive.org/web/20131018031259/http:/www.myfonts.com/fonts/t26/unica/) is the only Unica I can think of.\n\n"
    },
    {
      "time": "10 Apr 2003 — 1:53pm",
      "content": "?!   \nThat should be illegal (and I think it probably is).   \n   \nHaas Unica is hard to find a sample of.   \nBut I think [http://www.fonthaus.com](http://web.archive.org/web/20131018031259/http:/www.fonthaus.com/) has it.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Apr 2003 — 5:16pm",
      "content": "Mrs. Eaves needs some glory.\n\n"
    },
    {
      "time": "10 Apr 2003 — 9:28pm",
      "content": "\"Mrs. Eaves needs some glory.\"   \n   \nIt's already had more than it ever deserved.\n\n"
    },
    {
      "time": "10 Apr 2003 — 11:27pm",
      "content": "Stephen   \n   \nMost folks just call me \"bieler.\" Nice bird.\n\n"
    },
    {
      "time": "11 Apr 2003 — 6:45am",
      "content": "That's pretty funny. Found it in a nineteenth-century German dictionary once as \"Boy-child\" (archaic). The citizens of the Swiss city Biel are known as Bielers.   \n   \nBut it is only common in the northeastern shore area of Wisconsin as a slang word for young boys. My dad defined it as \"a boy who has his own mind about how he does things.\" I was the bieler of the family. When I started my press it seemed as good a name as any.   \n   \nJust to stay on topic, I should set it in the inglorious Mrs Eaves once.\n\n"
    },
    {
      "time": "11 Apr 2003 — 7:46am",
      "content": "Mrs Eaves just needs to be respaced.   \nI've always wanted to do it myself, and call the result Mr Richard.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Apr 2003 — 8:43am",
      "content": "The best part about Mrs. Eaves:   \n   \nThe client comes to you and says, _We think   \nthe type is looking a little small (so is the logo   \nby the way) could you 'up the font'?_      \n   \nYou get to say, _Great! How about I 'up' it to   \n13 or 14pt,_ and it winds up looking ok because   \nof the small x height. Meanwhile, the client says, _15?_  \nThen you say, _sure we'll keep the logo at 15 pt._  \nNext thing you know they want you to take a   \nlittle off of the CFO's double chin?   \n(yep, happened once).   \n   \nRandy \"Plastic Surgery\" Jones   \n   \nOh, we were suggesting undeused type. David   \nThometz mentioned ITC Mendoza (Bitstream   \n version) as a suggestion for book work. I like   \n it. I like it alot.\n\n"
    },
    {
      "time": "11 Apr 2003 — 8:51am",
      "content": " **Errata**   \nIn our Aprill 11, 2003 - 8:43 am issue,   \nwe accidentally misquoted the client.   \nWhat read _15?,_ should read:   \n   \n_Could you up the words to   \nsize 15 font number?_      \n   \nApologies,   \nThe Editor\n\n"
    },
    {
      "time": "11 Apr 2003 — 5:23pm",
      "content": "I'll volunteer Slimbach's Cronos. The only place I've seen this used in in Keith Tam's slab serif paper, but it's quite beautiful. Students can get it for approx. $100 as part of the Adobe Type for Learning bundle, and this even includes the \"optical\" versions.\n\n"
    },
    {
      "time": "11 Apr 2003 — 5:39pm",
      "content": "Or its original source, TodaySans.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Apr 2003 — 5:53pm",
      "content": "I used Today Sans in a paper once, and the guy who came after me replaced it with Meta.\n\n"
    },
    {
      "time": "18 Apr 2003 — 4:20pm",
      "content": "Ding Ding. This is more active than a lunchbox chat.   \nMight have to start another thread about underused type. :-)   \n   \nR\n\n"
    },
    {
      "time": "22 Apr 2003 — 1:25am",
      "content": "ITC Charter is also used for other Belgian newspapers (in Dutch) like De Standaard & Het Nieuwsblad. And I agree with Randy, Mendoza is really yummy. Hmmm and maybe Times New Roman Expert is a little bit underused also ![:-)](http://web.archive.org/web/20131018031259im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "22 Apr 2003 — 8:00pm",
      "content": "I adore TEFF's Trinite, which I learned about from Bringhurst's book. But I found it too expensive to buy, and I haven't seen it used here in the US. Am I right about its lack of use? Is this because of its high price?   \n   \nIn general the Dutch (TEFF, DTL and individual outlets) seem to have some really wonderful typefaces that I don't see too much here. Are the Dutch pricing themselves out of the market, or are they being financially smart?\n\n"
    },
    {
      "time": "22 Apr 2003 — 10:37pm",
      "content": "Note that TEFF and/or DTL [intentionally] don't have distribution in the US.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Apr 2003 — 6:14am",
      "content": "\\>TEFF and/or DTL [intentionally] don't have distribution in the US.   \n   \nWhat do you mean? You can order their stuff on their web sites. And when I asked for the A3 sheet on Trinite, they mailed it to me with a gracious note in the elegant hand of PMN.   \n   \nI don't understand how the high prices make economic sense. I would think that you are going to make more money from selling to a lot of small users than a few sales to corporations or magazines who will use it a lot more, but buy it only once.\n\n"
    },
    {
      "time": "23 Apr 2003 — 8:18am",
      "content": "My information might be outdated. It had something to do with -intentionally- not having a representative in the US. As for getting specimens, TEFF\\* is indeed highly gracious. Did you notice the paper they use for the specimens? Wow. But note that I said \"and/or\". I remembered at least _one_ of them not selling [directly] to the US - it could have been DTL and not TEFF.   \n   \n\\* And DTL provides all you need in PDFs online.   \n   \n\\> intention   \n   \nI can't be sure, but maybe it has to do with higher rates of piracy and/or lack of copyright protection. Basically it's a matter of _controlling_ the dissemination of your product, and that goes hand in hand with:   \n   \n\\> I don't understand how the high prices make economic sense.   \n   \nWell, the price point of something depends on many things, and in a niche market for example higher prices will yield greater profits. I think in this case higher prices do two things: elevate the prestige of the foundry above the seething masses, \"justifying\" future [high] pricing; reduce the rate of piracy (not just by reducing dissemination, but also because the more you pay for something the less likely you'll share it).   \n   \nhhp\n\n"
    },
    {
      "time": "23 Apr 2003 — 8:29am",
      "content": "Hrant   \n   \nA long while back DTL was represented in the US by Monotype. There was also another distributor either before or after Monotype. I think URW++ has some current connection with DTL. They are, at any point, selling the DTL font creation software.\n\n"
    },
    {
      "time": "23 Apr 2003 — 8:47am",
      "content": "DTL was distributed in the US, at least for a short while, by FontHaus back in 1996. _X-Height_ Vol. 5 no. 1 shows an offering of the DTL fonts, but the prices are not given. I don't know which side ended the arrangement.   \n   \n-- K.\n\n"
    },
    {
      "time": "23 Apr 2003 — 9:04am",
      "content": "\"DTL was distributed in the US, at least for a short while, by FontHaus back in 1996.\"   \n   \nInteresting. DTL must have been a bit problematic but this would seem to indicate that they hardly \"intentionally\" avoided US distribution. I checked my DTL fonts, and five of them, marked 1994 indicate receipt from Monotype Typography, and two more, marked 1995 seemingly came from the old URW. These were sent for review and I remember having trouble at the time because I could not get any literature on them that was written in English. Monotype didn't provide any and I can't read Dutch. And DTL would not respond to my inguiries.\n\n"
    },
    {
      "time": "23 Apr 2003 — 11:25am",
      "content": "I do find it weird, given the great quality of their types, that DTL doesn't use any other European language in the web site (except for the 'shop'.) I could manage with French or German, and of course English, but who knows Dutch except the Dutch?   \n   \nAlso, they have promised a digital version of Romulus - the most beautiful roman typeface ever IMHO - in a few months hence for over two years. That I can easily understand. It's the pricing I don't. If there are any Dutch readers of this who actually know the Dutch thinking - and it seems to be all Dutch foundries - about this, I would be interested to hear.\n\n"
    },
    {
      "time": "23 Apr 2003 — 2:45pm",
      "content": "I believe the thinking is that they sell fonts in the Netherlands to people who are willing to pay real money for fonts and want to use Dutch ones. Having spent some time browsing in Dutch bookshops, I realised just how few non-Dutch fonts are widely used in the Netherlands. It's quite refreshing.\n\n"
    },
    {
      "time": "23 Apr 2003 — 2:50pm",
      "content": "So are the Dutch nationalistic after all?   \nOr maybe just anti-German... They push Coster as the inventor of typography instead of Gutenberg (as if the Far East is all mere legend anyway...), they insist blackletter is not German, what next? ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "24 Apr 2003 — 11:00am",
      "content": "FYI   \n   \nThere was a recent John Berry article on DTL over at CreativePro.   \n   \n [http://www.creativepro.com/story/feature/19337.html](http://web.archive.org/web/20131018031259/http:/www.creativepro.com/story/feature/19337.html)\n\n"
    }
  ]
}
