{
  "id": "10913",
  "title": "Myriad only shows up in Adobe apps",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I can use Myriad in Illustrator and Photoshop, but not in word. It\n\n",
  "author": "cph",
  "time": "8 Apr 2003 — 3:07am",
  "uid": "1404",
  "comments": [
    {
      "time": "8 Apr 2003 — 9:54am",
      "content": "You are on OS X or OS 9?? Under OS X Adobe has installed several fonts under: Library/Application Support/Adobe/Fonts/Reqd/Base -- making them only available to Adobe Applications. Using Font Reserve I manually removed them, but was worried this might cause problems so put them back. If you move them and seem to have several successful days in a row, let me know too.\n\n"
    },
    {
      "time": "8 Apr 2003 — 10:27am",
      "content": "I\n\n"
    },
    {
      "time": "8 Apr 2003 — 10:38am",
      "content": "Silly me for _that_ assumption. ![:-)](http://web.archive.org/web/20131023141828im_/http:/www.typophile.com/forums/clipart/happy.gif) However, I would still assume that there is some kind of application support folder. Have you searched around the user to user forums on adobe's site? Maybe you could search your system for application support. Hmmm. I'm definitely not the person to ask about Windows machines. Sorry. :/\n\n"
    },
    {
      "time": "8 Apr 2003 — 11:06am",
      "content": "_\\>It_\n\n"
    },
    {
      "time": "8 Apr 2003 — 2:02pm",
      "content": "Colin,   \n   \nAdobe apps have their own Font folders. Check your Illustrator and PhotoShop folders for a Fonts sub-folder, and also check   \n   \nC:\\Program Files\\Common Files\\Adobe\\Fonts   \n   \nYou will probably find the Myriad fonts lurking in one of these places, indicating that they came bundled with the Adobe app. You can copy from this location to your Windows Fonts folder.   \n   \n   \nEduardo, ATM is unnecessary on Windows 2000 and XP; there is built in system support for PS fonts, so they can be dropped into the Windows Fonts folder just like TT fonts.\n\n"
    },
    {
      "time": "10 Apr 2003 — 2:15am",
      "content": "I found it, John. I missed the Common Files folder. (I keep wanting to write\n\n"
    },
    {
      "time": "10 Apr 2003 — 8:27am",
      "content": "_\\>ATM is unnecessary on Windows 2000 and XP_   \n   \nhmm, forgot about that. i'm still using win98 a lot.   \n   \n   \n_\\>I keep wanting to write_\n\n"
    },
    {
      "time": "12 Apr 2003 — 1:59am",
      "content": "Any way ATM still helps when mannaging with a wide variety of fonts\n\n"
    },
    {
      "time": "14 Apr 2003 — 5:38pm",
      "content": "If you do install ATM on Windows 2000 or XP, be aware that subsequently uninstalling ATM can result in complete lack of PS font support. The current system PS rasterisers are 'blackbox' software from Adobe, and are basically just the rasterising portion of ATM. Installing and then removing ATM from your system deletes the ATM rasterisers but does not restore the original system rasterisers.\n\n"
    }
  ]
}
