{
  "id": "10927",
  "title": "Chank & Spunk Say \"Quit Your Job and Get to Work!\"",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "CHANK & SPUNK SAY \"QUIT YOUR JOB AND GET TO WORK!\"   \nWorld-Famous Minneapolis Design Entrepreneurs Lecture on Building Creative Careers   \n   \nMINNEAPOLIS, MN, APRIL 9, 2003 - It's not exactly the career advice that spouses, parents, or friends give a budding entrepreneur, but then again, they haven't actually done it themselves. On the other hand, Chank and Spunk, two well-known and respected Minneapolis-based graphic designers and artists, have created successful businesses by taking their own advice - that is, quitting a secure thing for a thing of their own.   \n   \nWHAT: Quit Your Job & Get to Work! - A lecture featuring Minneapolis design and art entrepreneurs Jeff Johnson of [Spunk Studio](http://web.archive.org/web/20131020090341/http:/www.spunknation.com/) and Chank Diesel of [The Chank Company](http://web.archive.org/web/20131020090341/http:/www.chank.com/).   \n   \nWHERE: [Open Book](http://web.archive.org/web/20131020090341/http:/www.mnbookarts.org/), Marshall Field's Performance Hall, 2nd Floor 1011 Washington Ave. South, Minneapolis   \n   \nWHEN: Wednesday, April 16 at 7 p.m.   \n   \nTICKETS: The lecture is open to the public. Tickets are $20 general admission/$15 student rate and are available at [www.chank.com](http://web.archive.org/web/20131020090341/http:/www.chank.com/), or by calling 612-782-2245. Tickets will be available at the door, but seating is limited. Advance purchase is advised.   \n   \nQuit Your Job & Get to Work! will review the hazards and rewards of running your own business in the creative field. Johnson and Diesel will each give a one-hour speech addressing how they built successful art and design businesses, and will include slide presentations of portfolios, as well as anecdotes from their experiences as designers and businessmen. Johnson and Diesel are entertaining and inspirational speakers, regularly addressing college classes, design associations, and design convention audiences.   \n   \nJohnson will recount how he got the guts to leave his high-paying design director gig at Fallon, and Diesel will share stories about his life as the \"traveling font salesman\" and his decision to become a fine artist. They\n\n",
  "author": "tamye",
  "time": "9 Apr 2003 — 11:58am",
  "uid": "107",
  "comments": [

  ]
}
