{
  "id": "10924",
  "title": "Sans to go with paradox?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "does anybody have a suggestion for a sans to pair with Paradox?\n\n",
  "author": "anonymous",
  "time": "9 Apr 2003 — 11:54am",
  "uid": "1203",
  "comments": [
    {
      "time": "11 Apr 2003 — 7:42am",
      "content": "Could be an issue with on-screen rendering.   \n   \nDavid, Unger's faces are almost all harmonious (in fact many of his fonts seem to share very similar letter-widths), so look first in his collection.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Apr 2003 — 9:58am",
      "content": "\\> too harmonious if that makes sense.   \n   \nIt does. And Harmony itself is a highly complex beast.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Apr 2003 — 5:14pm",
      "content": "Vesta would be your best bet, but if you need a big family with many weights and sc and osf, Argo from DTL would be great. I chose Coranto with Vesta for a project and they work extremely well together. Paradox is almost identical to Coranto, only that it has a smaller x-height and longer ascenders and decenders.\n\n"
    },
    {
      "time": "11 Apr 2003 — 7:06am",
      "content": "Wouldn't [Vesta](http://web.archive.org/web/20131013021650/http:/www.gerardunger.com/fontstore/store-vesta.html) work?   \n   \nBy the way, what's up with the spacing in the image on the page I've just linked to? Ugh! Shame on you, Gerard!\n\n"
    },
    {
      "time": "11 Apr 2003 — 9:47am",
      "content": "david, thank you for your post and the links i should have provided... it was my first inclination to pair Paradox with another Gerard Unger typeface because of everything Hrant said, but it seems that maybe another Unger face migth be too harmonious if that makes sense. so i'm looking for a more creative pair something with more contrast... also for more backround, these typefaces will be used in a fresh new literary publication.\n\n"
    },
    {
      "time": "10 Apr 2003 — 9:31pm",
      "content": "For everyone's reference, here's Paradox:   \n  \n [http://www.gerardunger.com/allmytypedesigns/allmytypedesigns17.html](http://web.archive.org/web/20131013021650/http:/www.gerardunger.com/allmytypedesigns/allmytypedesigns17.html)  \n  \nalso:   \n  \n [http://www.dutchtypelibrary.nl/DTLParadox.html](http://web.archive.org/web/20131013021650/http:/www.dutchtypelibrary.nl/DTLParadox.html)   \n  \nI don't have any first-hand experience with Paradox (or any of the other beautiful faces from the Dutch Type Foundry, although many of them are on my wish list), but I would start my search among DTL's selection of sans serif faces. I'd look first at sans serifs designed by Gerard Unger, who designed Paradox, as his sans serif designs might well work compatibly with Paradox.   \n  \nGood luck!   \n  \nDavid\n\n"
    }
  ]
}
