{
  "id": "10925",
  "title": "Cognac",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "hey, this is my first shot at this. I really wanna know what I am doing right, or wrong...   \nIts just the lowercase for now, but Im gonna work on the uppercase as soon as I get feedback....   \nso here's your chance   \nThe blindfold is on, and Im tied to the stake\n\n",
  "author": "no_yes_waitno",
  "time": "9 Apr 2003 — 12:15pm",
  "uid": "1649",
  "comments": [
    {
      "time": "9 Apr 2003 — 1:13pm",
      "content": "I'd just like to comment on the \"g\". Although I love the open-bottom binocular version (like your second one), I think there's some interesting potential in the first one: I haven't seen many examples like that where the tail loops counter-clockwise. But I'd make it a smooth curve that ends when it touches the left side of the loop.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Apr 2003 — 1:02am",
      "content": "Hi chris   \n   \nyes there is some beauty inside. But stil need a lot of work.   \nThe 'a': I would prefere the second, the roman, version. Maybe you could try a smaller bowl   \nThe 'c': I always prefer the open characters. Do the same for 'e'   \nThe 'f': like the nice upstem, but the bar isnt at the x-height (also for the 't')   \nThe 'k': hmmm... both dont fit in the font. The first is to straight and second to free...   \nthe 'w': dont use the rotated 'm' its ugly   \nthe stems of v, w, x, y seems to be much bolder   \nthen the other stems   \n   \nso long :-)   \n   \nGreetings Jens\n\n"
    },
    {
      "time": "10 Apr 2003 — 1:07am",
      "content": "(sorry, post it twice...)\n\n"
    },
    {
      "time": "10 Apr 2003 — 8:39am",
      "content": "Chris -- if anything I would say Cognac needs to be softened just a bit. The corners all seem too sharp. Maybe I'm seeing the \"humanist\" in it wanting to come out a bit more??\n\n"
    },
    {
      "time": "10 Apr 2003 — 8:56am",
      "content": "This is great, thanks a lot guys...keep em going...   \nHrant, as for the curving g, thank you....Im presently putting your suggestions to work and will post it here, shortly\n\n"
    },
    {
      "time": "10 Apr 2003 — 12:30pm",
      "content": "The 'm' and 'n' too.   \n   \nDo tell, Chris.   \n   \nMatha.\n\n"
    },
    {
      "time": "10 Apr 2003 — 12:26pm",
      "content": "This looks like it has some uncial flavorings as well. I'm   \ntalking about the flared terminals throughout and the   \na, c, e, y and w in particular.   \n  \nMaybe you could talk about your inspiration, or where you   \nhope to take this.\n\n"
    }
  ]
}
