{
  "id": "10921",
  "title": "Kerning tables",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Here at slow-to-upgrade corporation (still using OS 9) we are having discussions about our kerning options. We make an effort to improve the quality of fonts we use on large campaigns. In the past, we've used Quark kerning tables, but we have moved to doing most of our kerning in Fontographer.   \n   \nFor those who use Quark kerning tables, do you have a system for storing and upgrading these tables? Do you create kern tables before using a font or do you capture and upgrade the tables as the font gets used? Any tips or hints would be appreciated.   \n   \nFor those who use Fontographer to kern, what kind of system do you use? Do you set a limit to how many kern pairs you'll allow? Any tips?   \n   \nAnd for the future, what are the odds that this kerning information will be useful and or translatable to OpenType fonts or to InDesign?   \n   \nThanks for your input!\n\n",
  "author": "kristin",
  "time": "9 Apr 2003 — 9:59am",
  "uid": "1553",
  "comments": [
    {
      "time": "9 Apr 2003 — 2:16pm",
      "content": "Yes, you should re-kern (and possibly totally re-space) the fonts themselves.   \nFeel free to contact me for pricing! :-) [hrant@inverselogic.com](mailto:hrant@inverselogic.com)   \n   \nhhp\n\n"
    },
    {
      "time": "10 Apr 2003 — 10:24am",
      "content": "Neo and Hrant, I definitely agree on re-spacing fonts!   \n   \nI'd love it if folks would explain the sort of guidelines they use when they kern fonts.   \n   \nDo you use Fontographer, FontLab, something else?   \n   \nDo you kern every character combination, including numbers, punctuation etc.? Is there a reason why you would and would not do that?   \n   \nHow do you differentiate the kerned fonts from the original fonts?   \n   \nHrant, you make a joke about pricing, but please explain further. Is it just too expensive and or time consuming to kern an entire font?   \n   \nAlso, since there have got to be other nutcases .... er, I mean \"artists\" ... out there who kern the heck out of their fonts, is there any effort to share this information with one another? Would that be ethical?   \n   \nI'm very curious to hear your responses.\n\n"
    },
    {
      "time": "10 Apr 2003 — 10:51am",
      "content": "1) Although I tend to place more value on \"deep\" kerning than most people, I do agree with the conventional feeling that base spacing is very important. Not just for users sans access to the font's kerning value (due to SW), but also because it makes kerning easier. Many fonts needs re-spacing more than re-kerning.   \n2) Kerning everything is not done because it's not worth it, and it bogs down the OS font engine. I use two kinds of data: linguistically frequent pairs (and words), and rare but highly problematic pairs. Spacing/kerning is actually a very pragmatic process, even though it's really mostly technical.   \n3) Differentiation: A good method is to use a name that starts with 3 or 4 of the same letters as the original, preferably alphabetically right afterwards.   \n4) Sharing: some people would call it \"unprofessional\", but to me _not_ sharing (at least to a reasonable extent) is unethical.   \n   \nPricing: no joke! I can do the job, for a reasonable fee.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Apr 2003 — 11:39am",
      "content": "If you're going to edit a font in FOG to \"fix\" the kerning then you may as well do it properly - ditch the kerning, respace the font for your proposed usage, \\*then\\* kern the font.   \n   \nI'd avoid using Quark kerning tables: they're only 200 units per em, are not easily imported to a font editor (you're going to have to massage them to fit the em digitization of the font) and of course they are non-portable between other apps.   \n   \nIf the kerning is in the font then you shouldn't have any issues saving it out of a suitable editor as OpenType, and or using it as Type 1 or OpenType in InDesign.\n\n"
    },
    {
      "time": "10 Apr 2003 — 9:35am",
      "content": "\\>Here at slow-to-upgrade corporation (still using OS 9)   \n   \nHa. Try working for the phone company. Just this week we upgraded from 8.6 to 9.2. I had to get a special dispensation to upgrade before anyone else so I could use InDesign 2.0.   \n   \nJay\n\n"
    },
    {
      "time": "10 Apr 2003 — 11:06am",
      "content": "Something else.   \n   \nFirst I space it! Then I kern based on test texts etc.   \n   \nObviously don't kern numbers if you want aligning figures. Kern what you need to suit what you're doing, don't over kern it looks awful.   \n   \nDifferent names: \"KD Helvetica Headline\"   \n   \nUnethical, probably against the licencing, potentially fairly dangerous (fonts floating around with different names, what do they do, is there some conflict in PS names, have references to the original been lost... if you've done something like this then you can take responsibility for it, but other's may not really understand the process and consequences).\n\n"
    }
  ]
}
