{
  "id": "10933",
  "title": "Untitled workhorse-type face",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "hello, here's a small family I'm working on:   \n   \n ![untitled](http://web.archive.org/web/20150414181406im_/http:/www.typophile.com/forums/messages/29/8554.gif)   \n   \nI basically want/need an alternative to the standard verdana-esque screen fonts that I use frequently in my client work - the problem is making it stand apart, but keeping it just as readable!   \n   \nso any advice or criticism (and maybe even a name suggestion or two) would be appreciated.\n\n",
  "author": "afo",
  "time": "9 Apr 2003 — 9:03pm",
  "uid": "830",
  "comments": [
    {
      "time": "9 Apr 2003 — 9:08pm",
      "content": "Looks sharp!   \n   \nIt's hard to find a name for a generic bitmap font... Just avoid ending it with an \"a\". :-)   \n   \nhhp\n\n"
    },
    {
      "time": "10 Apr 2003 — 12:14am",
      "content": "I like it, esp. lc b and p and so glad they are not mirrors of d and q.   \n   \nYou could name it \"Typeface\" - that's pretty generic :-) We had a workhorse once (a real one) named \"Crafty Ann\" and I've met more than one farming horse named \"Bessie\" and I should probably go to sleep now.\n\n"
    },
    {
      "time": "10 Apr 2003 — 3:13pm",
      "content": "hey, so here's the full set so far. I'll be adding more characters - accents, fractions, etc. I named it \"Ledger\".   \n   \n ![ledger set](http://web.archive.org/web/20150414181406im_/http:/www.typophile.com/forums/messages/29/8582.gif)   \n   \n   \n ![ledger text](http://web.archive.org/web/20150414181406im_/http:/www.typophile.com/forums/messages/29/8583.gif)\n\n"
    },
    {
      "time": "11 Apr 2003 — 5:19pm",
      "content": "i keep reading b as h. is anyone else seeing that or should i call 1-800-ABCDEFG?\n\n"
    },
    {
      "time": "11 Apr 2003 — 11:20pm",
      "content": "Hee, is that sample text from _The Onion_? Sure sounds like it.   \n   \nAnd the \"b\" does look somewhat \"h\"-like... though I don't have any problem reading it, I can nonetheless understand how it would be easy to make that mistake, and it doesn't seem \"balanced\" in comparison to the \"d\".\n\n"
    },
    {
      "time": "9 Apr 2003 — 9:15pm",
      "content": "Andrew - The Regular is as readable as Verdana, yet   \nstylisticallly unique. You've done it.   \n   \nI'm particularly font of the 'K'. Your spacing is also just right.   \n   \nLet's see some punctuation other than what's in the text samples!\n\n"
    },
    {
      "time": "11 Apr 2003 — 2:04pm",
      "content": "I'm glad you're pushing some boundaries here. I love to see   \nthe condensed weight. My only criticism of Verdana is that   \nit's often too wide when you want something to be a tad   \nquieter.   \n   \nAnd I've never been a fan of the round-top A in bitmap faces.   \n   \nThe small caps are a nice touch.   \n   \nRegarding naming. I couldn't help noticing Bitstream's Vera,   \nnamed perfectly so that it sits right on top of Verdana in   \nmy menu. It seems to say, \"Looking for Verdana? Try Vera.\"\n\n"
    }
  ]
}
