{
  "id": "10931",
  "title": "Font testing",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Ive decided I need to set up some sort of testing routine. At the minute Im looking at testing on OS9/X/Win98/XP, Flash, Distiller, Postscript print test from Quark Xpress. Have you any other suggestions? Also I notice Microsoft have a font validator app on their site:   \n   \n [http://www.microsoft.com/typography/developers/validator/](http://web.archive.org/web/20130623051208/http:/www.microsoft.com/typography/developers/validator/)   \n   \nIs this reliable enough to skip full Win98/XP testing? Are there any other similar utilities out there, or any for Mac OSX?\n\n",
  "author": "selfbuildtype",
  "time": "9 Apr 2003 — 1:15pm",
  "uid": "863",
  "comments": [
    {
      "time": "9 Apr 2003 — 4:16pm",
      "content": "The MS Font Validator is an excellent tool for testing TT and OT fonts. I recommend using it not only for final font testing but also during production to catch little bugs that might otherwise slip by. In particular, I recommend running the Font Validator on a test font _before hinting_. Few things in font development are more annoying than finishing hinting a glyph only to discover that you have an invisible overlapping stem, correcting which will delete your hinting.   \n   \nIn some respects the Font Validator is better than simply testing fonts for normal behaviour in apps, since there are plenty of bugs that may not reveal themselves in app behaviour. The Font Validator checks your font against the spec.   \n   \nOn the other hand, I still recommend doing an install and print test.   \n   \nOne thing you may find when testing FontLab generated fonts in the Font Validator is that you get a lot of error reports for the LTSH, HDMX and VDMX tables. This is due to a difference between FontLab's calculated values for these tables and the actual values reported back from the system rasteriser. You can fix these problems by downloading Microsoft's [CacheTT](http://web.archive.org/web/20130623051208/http:/www.microsoft.com/typography/tools/tools.htm) and then selecting the FontLab option 'Use CacheTT program to generate device metrics tables in TT fonts'. This will run your fonts through CacheTT as part of the FL font generation, and will overwrite the FL calculated values.\n\n"
    },
    {
      "time": "9 Apr 2003 — 8:01pm",
      "content": "\\> error reports for the LTSH, HDMX and VDMX tables.   \n   \nHow necessary is it to fix those?   \n   \nhhp\n\n"
    },
    {
      "time": "10 Apr 2003 — 7:47am",
      "content": "testings with various software is important, because none of them use same method to handle namings, display, etc.   \nWord   \nQuark   \nIndesign   \nIllustrator/Freehand/Photoshop   \nAppleWork   \nFilemaker   \nFlash   \n   \nthen, try some pdf   \nprint on Laserprinter with true PS, and emulated PS,   \nand on jet printers   \n   \nInstall via system   \nvia ATM, Suitcases, FontReserve depending wich platform you are.   \n   \nI'm sure I miss some!\n\n"
    },
    {
      "time": "10 Apr 2003 — 10:33am",
      "content": "I've not yet found any functional bugs (i.e. things that prevent the fonts from installing, rasterising and printing) if FontLab-generated LTSH, HDMX and VDMX errors are not corrected. In fact, in one font I worked on we were obliged to maintain the VDMX errors in order to ensure backwards compatibility with earlier versions of the font.   \n   \nIf you do have a chance to fix these errors, i.e. if you have not released fonts or do not need to worry about backwards compatibility, then I think you should. Although the fonts will work okay with these errors, there will be discrepancy, e.g. in default linespacing, between fonts with correct and incorrect values.   \n   \nApart from anything else, being able to confirm that tables in your font conform to the TT/OT spec can save you from a lot of customer support hassles.   \n   \nI presume that FontLab on Mac makes the same calculation errors, and I'm not sure how to fix the problem without CacheTT, which is only available for Windows.\n\n"
    },
    {
      "time": "12 Apr 2003 — 10:24am",
      "content": "As Im on OS X I cant use CacheTT or MS Font Validator so I will stick with manual testing. Jean, when you say emulated PS do you mean using the Virtual Printer option in Mac OS or printers that are not true PS?   \n   \nAs for having other people test my fonts, I have considered havng a list of Beta testers, but Im not sure if its a good idea or not. Any thoughts?\n\n"
    },
    {
      "time": "9 Apr 2003 — 4:20pm",
      "content": "I will also test all your fonts for free.\n\n"
    }
  ]
}
