{
  "id": "10949",
  "title": "Which font to use for on-screen anti-aliased 10-12pt use?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "looking for suggestions on what fonts (sans-serif) to use for on-screen anti-aliased use at small type sizes (10-12pts).   \n   \nany ideas?   \n   \nI know aliased faces such as from miniml or silkscreen, mini 7, sevenet would all be much more readable, but I really need to find an anti-aliased font to use at those small sizes as well.... are there any that have been designed for on screen use?\n\n",
  "author": "anonymous",
  "time": "26 Feb 2002 — 6:50pm",
  "uid": "1203",
  "comments": [
    {
      "time": "26 Feb 2002 — 10:27pm",
      "content": "Set VAG Rounded Light in Fireworks' \"crisp anti-alias\". It reads pretty well.\n\n"
    },
    {
      "time": "26 Feb 2002 — 9:44pm",
      "content": "Many faces work at that size on screen, provided   \nyou lean toward the bold/medium/demi/heavy side.   \nAvoid stuff with lots of fine details or counters that   \ntend to fill in. Thus Meta and Univers work well.   \nEven Caflisch Script holds up nicely.   \n   \nCurious: do you need anti-aliased fonts because   \nthey need to work in Flash? (There are   \nFlash-ready bitmaps out there... fyi.)   \n   \nIf it's for PhotoShop, recent versions have   \nmultiple settings for anti-aliasing--very handy   \nwhen it comes to maximizing readability.\n\n"
    },
    {
      "time": "27 Feb 2002 — 6:29pm",
      "content": "Thanks for the suggestions!   \n   \nYup. This is for Flash use, but it's not because it's a workaround. (I know there are fonts designed to stay aliased in flash).   \n   \nA few of my explorations have turned up the following fonts that render very well:   \n   \nLinotype Fruitger NEXT   \nLinotype Univers   \nFF Balance   \nFF Kievit   \n   \nI also want to test out Linotype Compatil, but I currently don't have a copy. Anyone with experience in using this font for screen?\n\n"
    },
    {
      "time": "26 Feb 2002 — 6:59pm",
      "content": "I used to use Poppl-Laudatio for many years, and I still like it (not least because you can also use it large on the same \"page\", since it has a lot of visual interest), but then to my pleasant surprise I found that Rotis (specifically the Sans Ultra Bold) is simply \\*amazing\\* at the tiniest sizes!   \n   \nHere's how: [http://www.themicrofoundry.com/other/rotis\\_12.gif](http://web.archive.org/web/20140803105136/http:/www.themicrofoundry.com/other/rotis_12.gif)   \n   \nhhp\n\n"
    }
  ]
}
