{
  "id": "10945",
  "title": "Acceptable methods of copyfitting in rigid layouts",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "After working on two newspapers, I\n\n",
  "author": "cph",
  "time": "11 Apr 2003 — 2:06pm",
  "uid": "1404",
  "comments": [
    {
      "time": "11 Apr 2003 — 2:34pm",
      "content": "Colin - a lot of variables come into play, but   \nas a general rule, don't mess with the point   \nsize, the tracking, or the character width.   \n   \nBreak the rules for feature layouts, of course.   \n   \nNot sure what you mean by leaving white space.   \nDo you have a scan?   \n   \nYou can air out copy but not \\*too much\\*.   \n   \nAlso, read Tim Harrower's book...mentioned   \nbefore at typophile.   \n   \nIf you have time, touch the copy, or have   \nan editor help you touch it. Some of the   \nmost precise editing comes when you are forced   \nto fit something into a confined space.   \nYou see things you normally wouldn't see.   \n   \namong other things:   \n   \n   \n\\_ edit widows   \n   \n\\_ cut redundant, \"no \" quotes   \n   \n\\_ look at paragraph structure (either tighten or loosen based on reporter's writing style)   \n   \n\\_ increase/decrease size of art   \n   \n\\_ increase/decrease # of columns / page layout   \n   \n\\_ bust out a pull quote or an infographic   \n   \n\\_ as a last resort, run a house ad, or better yet,   \nset your type in Zapf Dingbats.   \n   \nbj\n\n"
    },
    {
      "time": "11 Apr 2003 — 3:05pm",
      "content": "Why not mess with the point size? As long as it's within reading range it's fine. Think of fractional increments though.   \n   \nFrankly I don't have much experience copyfitting large amounts of text in tight spaces, but in terms of typeface integrity I'd say that tracking is the worst thing you can do. Second worse is horizontal scaling. Changing the word-space is not too bad. Same for leading. Both of those can actually take more abuse than most designers realize.   \n   \nA good type user can conceivably have a better appreciation for the balance of economy versus readability than some type designers. So if you have reason to believe that the spacing of the font is too lose for example (like in Mrs Eaves), apply negative tracking (just keep an eye on \"boundary\" glyphs, like the lc \"r\" - you might need to add some custom kerning pairs). Helvetica for example is too tight for text (assuming you have to gall to use it for text anyway).   \n   \nTwo things I would add:   \n1) Watch the paragraph breaks for places you can save entire lines.   \n2) Try to use a MM font with a width axis.   \n   \nhhp\n\n"
    }
  ]
}
