{
  "id": "10968",
  "title": "Type & logo feedback",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "Blue Edge is a System Engineering new company based in portugal. It develops several sea exploring related machines like probes, and other robotic orientated systems like mini submarines to explore the sea and coast (among others non related to water).   \n  \nCONCEPT.   \nThey wanted a logo that reflected the water/sea, but most important the EDGE, as for the frontier between the sea|shore or the frontier Ocean|Sky. After several ideas I choosed the idea of representing the Sunrise cutted by the ocean (sky/sun/ocean prontier). Something like the photo below.   \n  \n\\<img src=\"http://www.musicdrops.com/blue.jpg\"\\>   \n  \nTHE LOGO.   \nI came out with this simple logo that I think captures the ocean vibe (given by the colors) and enought edge/tech feeling. The type used is from the Agfa Monotype Foundry called VISAGE LIGHT. The g reminded me someone \"twirling\" on the surface of the water and personally I think it reminds me a lot the ocean vibe.   \n  \n\\<img src=\"http://www.musicdrops.com/bluet.gif\"\\>   \n  \nFEEDBACK   \nI need to hear the experts ![:-)](http://web.archive.org/web/20080310230755im_/http:/www.typophile.com/forums/clipart/happy.gif) The company desc below is on the same font and there will be a portuguese version where the type will be smaller (more words: Sistemas de Engenharia)but the logo to use mainly is the one without the description (top right). Thanks in advance!   \n  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ hum.... img html not working?\n\n [‹ Font combos](http://web.archive.org/web/20080310230755/http:/www.typophile.com/node/9411 \"Go to previous forum topic\") [Some words from the wize... ›](http://web.archive.org/web/20080310230755/http:/www.typophile.com/node/10857 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080310230755/http://www.typophile.com/user/1735\" title=\"View user profile.\">adriano</a>",
  "time": "<br>",
  "uid": "1735",
  "comments": [
    {
      "time": " 15.Apr.2003 4.15am",
      "content": "CONCEPT   \n ![](http://web.archive.org/web/20080310230755im_/http:/www.typophile.com/forums/messages/29/8721.jpg)   \n   \nLOGO   \n ![](http://web.archive.org/web/20080310230755im_/http:/www.typophile.com/forums/messages/29/8722.gif)\n\n"
    },
    {
      "time": " 15.Apr.2003 9.48am",
      "content": "Nice concept,   \nhave you thought about 3d space for your logo... ![](http://web.archive.org/web/20080310230755im_/http:/www.typophile.com/forums/messages/29/8731.gif)\n\n"
    },
    {
      "time": " 15.Apr.2003 10.40am",
      "content": "That 3D blue thing is gorgeous!\n\n"
    },
    {
      "time": " 15.Apr.2003 11.32am",
      "content": "hmm, i like the blue arc, and its relationship with   \nthe company name. it seems to be coherent to   \nyour concept, this part is ok.   \n   \nbut i kinda dislike your font choice. i know, the   \n\"g\" is nice, but the overall look doesn't feel like   \n\"edge\" to me. i can't think of a typeface suggestion   \nright now, but maybe something more like Charter.   \n   \nbtw, imvho, the 3d thing doesn't sound like a good   \nidea here.\n\n"
    },
    {
      "time": " 15.Apr.2003 2.10pm",
      "content": "No 3D thanks ![:-)](http://web.archive.org/web/20080310230755im_/http:/www.typophile.com/forums/clipart/happy.gif). Maybe the font doesn't induces EDGE, but I decided to stick with a serif font (maybe because I usually \"overuse\" the sans fonts on my logos often conoted to edgy things). This font just seems right to me. I've tried the Charter just for a side to side, look below. The arc is opened, so is the g, the B is opened on the inside... 2 arcs inside of the B letter. The \"angled\" double e... maybe I'm just hooked to this font.   \n   \n ![](http://web.archive.org/web/20080310230755im_/http:/www.typophile.com/forums/messages/29/8743.gif)\n\n"
    },
    {
      "time": " 17.Apr.2003 11.55pm",
      "content": "i think it is a very beautiful logo.   \nSuch a simple concept but comes off very elegant.   \nI do like the agfa visage compared with Charter which seems a bit bookish /stade (for want of a better word).   \nHave you played with the colour much?   \nThe more I look at it, the more clinical it looks. Starts to look pharmaceutical...   \nHave you tried adding a line of white or dark blue into the arc, giving it a little more detail? something that makes it more unique but still simple..   \nI would experiment a little further...\n\n"
    },
    {
      "time": " 22.Apr.2003 1.51pm",
      "content": "I don't know... the arch seems to be too wide for me. It looks like it is stretched. The idea however of using an arch is a good one: very simple and recognizable. The color is also OK: modern, yet serious enough.   \nAnd about the type: nice that you made the effort of pick a type that isn't overused. However it feels to be a bit too light. Perhaps the normal style would be better.   \nThere is one thing I don't like with Agfa Visage: the italics. So I hope you won't be using the Oblique...\n\n"
    },
    {
      "time": " 22.Apr.2003 5.03pm",
      "content": "A very nice concept, and I particularly like the photograph juxtaposed with the logo. Gorgeous.   \n   \nMy observation: the strength of the arc seems to be in conflict with the rather weaker typeface. I think the problem lies not in the choice of type (which I think is quite a nice typeface in and of itself) but how the arc is constructed. To me, the arc says \"Avant Garde\" (the typeface). Martin's 3D extrusion might not be what you have in mind, but it does have the thick-thin transition that echos the type rather nicely. The type right now is very organic, while the arc is mechanical, you see?   \n   \nCharter is a nice typeface. Not as elegant as Visage, but I think it does have the sturdyness that you might need for a logo. The thins of Visage are quite thin, and you might run into problems when you have to use it at small sizes. If you decide to go with Visage, Yyou might need to have two or more optical versions for use at different sizes... Visage has more character though...\n\n"
    },
    {
      "time": " 22.Apr.2003 5.30pm",
      "content": "[This thread has been moved to Critique: Typography / Composition]\n\n"
    },
    {
      "time": " 23.Apr.2003 3.12pm",
      "content": "Thanks for all the positive/negative feedback ![:-)](http://web.archive.org/web/20080310230755im_/http:/www.typophile.com/forums/clipart/happy.gif) I'll pick up this work again soon and post here the changes.\n\n"
    }
  ]
}
