{
  "id": "10969",
  "title": "Phantom Modulation. Am I mad?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm working on a sans serif design, not quite mono-lineal, some humanist   \nstructure but no humanist modulation, and I find myself constantly   \nquestioning if I have drawn my shapes correctly. When setting sample   \nwords, some parts of strokes appear thicker and some thinner. Parts   \nthat would normally be made thinner by the shape of the pen, the upper   \nleft and lower right of the 'o', right stroke of 'v', appear thick. Where I   \nmight expect a thickening of the stroke, lower left and upper right of   \nthe 'o', left stroke of the 'v', I see instead a thinning.   \n  \nAm I mad or is this a common experience? I imagine that my mind   \n'expects' the normal pen based modulation that I've been accustomed   \nto working with in my past few projects and is reacting against the   \nmono-linearity of this new design. I'm finding it very distracting   \nand I don't know what to do about it except to keep measuring all   \nmy strokes to confirm that they are in fact the same width.   \n  \nIdeas? Similar experiences?\n\n",
  "author": "Aaron Sittig",
  "time": "15 Apr 2003 — 4:05am",
  "uid": "1290",
  "comments": [
    {
      "time": "15 Apr 2003 — 4:15am",
      "content": "Having a hell of a time uploading this image on my slow connection.\n\n"
    },
    {
      "time": "15 Apr 2003 — 4:27am",
      "content": "![phantom modulation](http://web.archive.org/web/20131016195633im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n"
    },
    {
      "time": "15 Apr 2003 — 4:33am",
      "content": "![phantommodulation](http://web.archive.org/web/20131016195633im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n"
    },
    {
      "time": "15 Apr 2003 — 4:44am",
      "content": "I give up   \n   \nhttp://www.xtypa.com/ext/typophile/phantommodulation.gif\n\n"
    },
    {
      "time": "15 Apr 2003 — 6:55am",
      "content": "Hi Aaron. You're definitly mad. So am I :-)   \n   \nAre you designing on screen? If so, do printed letterforms have the same issue? The trouble I've had designing onscreen is by the time you zoom out to get a sense of the whole letter (or even a word) the anti-aliasing starts messing with my mind as you've described. While I still design on screen, there is an element of trust in your measurements untill you pull a print..   \n   \nIn your sample, the only one that looks off is the v. If anything the thick should be on the left.   \n   \nGood luck.   \nRandy\n\n"
    },
    {
      "time": "15 Apr 2003 — 9:16am",
      "content": "Maybe this will help. ![:-)](http://web.archive.org/web/20131016195633im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n ![](http://web.archive.org/web/20131016195633im_/http:/www.typophile.com/forums/messages/4100/8728.gif)\n\n"
    },
    {
      "time": "15 Apr 2003 — 2:23pm",
      "content": "\\> Are you designing on screen?   \n   \nYes   \n   \n\\> If so, do printed letterforms have the same issue?   \n   \nNot that I've noticed, so if so, it's not as strong. I'll give it a   \nlook when I get home.   \n   \n\\> In your sample, the only one that looks off is the v.   \n\\> If anything the thick should be on the left.   \n   \nI first noticed the effect with the v; it seems strongest there.   \nAccording to my theory, the left stroke should appear thin.   \nAfter repeatedly seeing 'v' with conventional modulation,   \nthick on the left, thin on the right, by comparison a mono-   \nlineal v will seem _too thin_ on the left and _too   \nthick_ on the right compared to what your brain has   \nbecome used to.   \n   \nWhen I resumed work on this design last night, after   \nreading around 50 pages of Adobe Garamond, the effect   \nwas very evident. Looking at it today, it's not quite as clear   \nin the round characters, still somewhat visible in the v.   \nMaybe that's the lesson, don't try to be original after   \nextended reading or your gut feeling will tell you to make   \nyour design look like the typeface you've just been   \nimmersed in.\n\n"
    },
    {
      "time": "15 Apr 2003 — 5:57pm",
      "content": "You're not mad and this is quite common. I find that even the slightest 'correction' for this, i.e. the slightest modulation, will compensate to produce the appearance of an unmodulated stroke. The likeliest explanation for the phenomenon (and ghost modulation is quite a good term for it) is that we are so accustomed to the 'normative' forms of our letters being modulated, and in a particular way, that our minds reject the absence of modulation and see, instead, a reverse modulation. The effect is most obvious in letters with 'mirrored' forms, e.g. _A O V o v;_ in Tiffany's illustration above the effect is much less troubling in the _d._ I suppose if one was exposed only to totally unmodulated letterforms for an extended period of time, one would eventually be 'cured' of this phenomenon, but how likely is that? It is sensible to introduce very minor modulation to counter the perception.\n\n"
    },
    {
      "time": "16 Apr 2003 — 8:33am",
      "content": "When I was reading Smeijers's \"Couterpunch\", in the chapter about adding something to the lc \"j\" to make it sit on the baseline\\*, my mind started thinking about \"reform\", and it immediately hit me that the Latin lc \"a\" is facing the \"wrong\" way! I now realize that it's not so simple, but the power of suggestion is indeed powerful.   \n   \n\\* BTW, I don't know if he realizes it, but that sort of thing is totally contrary to his otherwise highly conservative approach to type design!   \n   \n\\> we are so accustomed to the 'normative' forms of our letters being modulated   \n   \nI think that's part of it (especially for a type designer), but there are [probably] optical issues as well - just like a perfect circle/square \\*appears\\* imperfect.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Apr 2003 — 3:32pm",
      "content": "\\> I think that's part of it (especially for a type designer), but   \n\\> there are [probably] optical issues as well   \n   \nI think it's fair to call this an optical issue, not just a matter   \nof familiarity. It's likely similar to color fatigue, where the   \nworld looks blue after you've spent a couple minutes   \nwearing yellow sunglasses. But I also think that since we   \nspend so much more time reading modulated text than we   \ndo wearing colored sunglasses, the effect is more   \npermanent.   \n   \n\\> I find that even the slightest 'correction' for this, i.e. the   \n\\> slightest modulation, will compensate to produce the   \n\\> appearance of an unmodulated stroke.   \n   \nAnd it seems you're not alone. Myriad compensates for this   \neffect in both the o and v. Adobe's Frutiger compensates   \nonly in the v, but does so quite dramatically. Agfa/   \nMonotype Gill Sans compensates in o and v. Linotype   \nHelvetica Neue compensates only in v. Neufville Futura has   \nno compensation at all.   \n   \nSo it appears that I should add some optical compensation   \nto my design. Seems to be standard best practice today for   \nthe most common digital sans fonts.\n\n"
    },
    {
      "time": "17 Apr 2003 — 2:31pm",
      "content": "Aaron, care to show more? How far along are   \nyou? The attention to detail above shows good   \npromise. Keep us posted.   \n   \nRandy\n\n"
    },
    {
      "time": "19 Apr 2003 — 6:58pm",
      "content": "If I can find the time this weekend to finish up the upper   \ncase, I'll post a pdf over in Critique.\n\n"
    }
  ]
}
