{
  "id": "10964",
  "title": "Verona",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150417175352im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">Verona.swf<br><a href=\"http://web.archive.org/web/20150417175352/http:/www.typophile.com/forums/messages/29/verona.swf\"><b>verona.swf</b></a> (9 k)</td></tr></table></center>   \nVerona is a typeface in development for a corporate client. I'll soon be creating an italic for it, and am considering an upright script concept. Verona features square punctuation that is shared with a sans serif that I've also designed.   \nI'm thinking of designing the italic/script so that it could be shared between Verona and the sans.   \nIn respect of the use of Verona, I hope it to fulfill the same role that the Apple Garamond has done for Apple.   \nI'm also thinking about adding more weights, but Apple's successfull use of one weight leads me to believe that as part of a corporate identity it would be stronger and more identifiable if there were only one.!-/attachment-!\\>!-attachment:\\> \n",
  "author": "miles",
  "time": "28 Feb 2002 — 2:56am",
  "uid": "967",
  "comments": [
    {
      "time": "28 Feb 2002 — 6:18pm",
      "content": "Nice work Miles. I was expecting a much more funky design being familiar with your work of the 1990's. I like your new face a lot and would encourage you to design the script and perhaps even a semi serif.\n\n"
    },
    {
      "time": "1 Mar 2002 — 1:14pm",
      "content": "Miles, very nice - although you should know that I have a weakness for narrow, rigid designs.   \n   \nIt's hard to make significant suggestions to something of such high professional finish (noting for example the slight taper in the lc \"v\"'s thin arm), so I'll go into \"super-picky\" mode - which does however mean that my suggestions might hold [even] less water than usual.   \n   \nThe lc Letterforms:   \nI like the strong square terminals. And the vertical proportions seem to be well matched to the narrowness. Maybe the descenders could be a bit shorter. The half-serifs seem to be completely flat, as opposed to the full-serifs, which have a slight concavity. Maybe go flat for all. Also, I think either the \"a\" and \"u\" foot serifs should be flat, or the \"d\"'s should turn up instead. The \"a\" is very classy. The \"e\" might benefit from a stronger top-right curve, and the strong terminal seems to be closing things up too much. The \"g\" is one of the best bicameral forms that I've ever seen - very elegant - maybe a bit too humanist here? The ear could be stronger. The dots on the \"i\" and \"j\" (and maybe even the period) are really too sharp, but I don't know what would work here - maybe rounding the corners a bit. I like strong tails, so the \"j\" is somewhat of a turn-off (although it contrasts nicely with the \"y\"). The \"k\" doesn't seem to fit just right: it's too busy at the base (you might consider giving it the staggered arm structure that the UC has), and the upper arm's flare on the left seems too humanist here. On the other hand, the \"k\" you have is a very classy form, which does go with the overall feeling - so if you keep it as is, you might want to make the UC \"K\" have similar armature (not that I think that type of consistency is critical). The \"m\" might not need to be so narrow. The \"r\" might benefit from a stronger beak, and maybe a longer righthand foot serif to go along. The \"s\" is amazing - like a beautiful boa. The \"t\" initially bothered me, but now I like it a lot. I think the \"x\"'s lower-left arm being pulled in like that is unbalancing it. The \"y\" is superb - my attempt at a \"y\" of that structure for Patria was a fiasco. The \"z\" is class.   \n   \nThe UC letterforms:   \nVery solid, without being brutal. The \"B\" -always a challenge- is masterful. The \"G\" might benefit from a double-serif. The \"J\" was bothering me, but now it's fine. The \"M\" has a problem with being too frail and open. You probably want to control its width in this design, but I really think the middle part has to go lower. The \"P\" is classy, but a bit recessive. The \"Q\" -which I should probably reserve judgment on until I see it in text- is a sharp attempt (noting the modulation of the body at the bottom-right), and I guess you want to keep it above the baseline, but I'm not sure you can get away without bringing part of the tail inside. The \"R\" is killer. The \"S\" seems to be leaning rightward. The \"T\" is nice and narrow, but the \"V\" maybe too narrow. The \"W\" has a milder version of the \"M\"'s problem, and it also seems to be skewed left on the inside.   \n   \nThe numerals really work, man. The \"5\" is amazing. Just the \"4\" is a bit too shy for me. The \"fl\" seems a bit tight, and I worry about its strong corner (top-right). The BP seems to be leaning rightward. The \"@\" is surprisingly nice. Have you thought of making the asterisk upside-down (to draw more attention)?   \n   \nThe spacing is probably not finished, but it seems a hair to loose to me (especially in the rounds). And the blank space character relatively too narrow. Nice quote, btw.   \n   \nI think the single italics idea is really great, but I have to see a working upright one before I'm convinced of that aspect of it. The closest (viable) thing I've seen is Majoor's Seria, and assuming it actually works in context, it still has a slant (which actually varies, between about 1-2 degrees). A couple of \\*nearly\\* upright italics (~4 degrees) that do work are Gill's Joanna and Unger's Flora. G Noordzij might have made something, but I'd be surprised if it's non-calligraphic enough to work for text.   \n   \nYour point about the one weight is interesting. I think it might have great validity for large settings, but for subheads and such it might backfire. One place where multiple weights definitely help is when you're mixing different sizes together but want to maintain color (like in simulating smallcaps).   \n   \nOverall, great stuff - no surprise. I hope the client deserves the high craftsmanship.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Mar 2002 — 1:20pm",
      "content": "Ole, I guess funky isn't what it used to be.   \nPlus, corporate clients are a bit different than young iconoclasts... :-)   \n   \nThe semi-serif idea is great - and nobody has really made a good one yet. I'd love to see it applied in the italics (conventional italics -besides being too fluid- also have a paucity of serifs), but if Miles will be sharing it between the serif and the sans then that's probably a no-go. But you were probably talking about a semi-serif \\*Roman\\*, and I think that would make for a great \"sister\" design.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Mar 2002 — 9:21pm",
      "content": "Fellow Designer,   \n   \nA remarkable discovery. A change you overlooked:   \nmany ballish terminals are squared/chopped off as   \nin the numerals. See 'a', 'f', 'r', 'y'.   \n   \nToo close for comfort as a corporate face? I   \ncan't be the judge. But it does seem to share   \nsome exact points and curves with Melior.   \n   \nStephen\n\n"
    },
    {
      "time": "1 Mar 2002 — 9:26pm",
      "content": "Also, it's interesting to note that Hrant just   \nunknowingly critiqued the work of Hermann Zapf.   \n   \n [http://www.myfonts.com/FontFamily122.html](http://web.archive.org/web/20150417175352/http:/www.myfonts.com/FontFamily122.html)\n\n"
    },
    {
      "time": "2 Mar 2002 — 8:51am",
      "content": "Not that Fellow Designer (FD) doesn't allude to an interesting -and vexing- point about type design in general, but I personally have to suspect some hidden motivation here.   \n   \nDear FD, I would ask that you please:   \n1. Read the passage in Alexander Lawson's \"Anatomy of a Typeface\" where he points out that Optima -arguably Zapf's most notable contribution to type design- is similar to a design of Dwiggins from three decades prior (noting that Lawson enjoys the credibility advantages of not being anonymous).   \n2. Tell us what you think of Excoffon.   \n3. Post some of your own work-in-progress.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Mar 2002 — 10:36am",
      "content": "In Fellow Designer's defense: Melior was the first thing I thought of as soon as I saw this design. It really is too close. I don't normally like to chime in with negative criticism here, but seeing as FD has started I thought I should speak up. If you look at the \"weak\" letters - meaning the ones that attract the eye for the wrong reasons - like the M, W and Q, it looks to me like the designer has chosen to alter the Melior originals but made amateurish design choices. The lc is more consistent, but when you look at the similarities to Melior, particularly at the tell-tale junction of the thick and thin strokes of the y, and of the myriad similarities in the curves and bowl/counter shapes of the g then what else can you conclude?   \n   \nMelior is a widely used font, but I don't think it is so widely used as to result in it's letter shapes melting into the general unconsciousness of designers by osmosis in the way that a font like, say, Microgramma/Eurostyle has done. You can almost forgive people for perpetually coming out with \"new\" designs which look like that.   \n   \nPaying tribute to an earlier designer is one thing - and if you're going to, then surely you have to acknowledge it - but this seems to me like a blatant squeeze of Melior with insufficient alteration to differentiate it to be able to, in good conscience, call it something original.\n\n"
    },
    {
      "time": "2 Mar 2002 — 4:11pm",
      "content": "\\> dont try to change the subject   \n   \nI'm not.   \nContext is everything, and you can't understand the issues -or arrive at a personal stance wrt Verona- without getting a handle on the big picture. Relativity, baby, not ten commandments crap.   \n   \nPlease, do my list of 3 things.   \n   \n\\> Miles asked for input   \n   \nAre you the same as FD? If yes, then I'm glad you did give your opinion, I just wish it was in person. If not, please do give yours.   \n   \nBTW, I thought anonymous posting were no longer an option?   \n   \nhhp\n\n"
    },
    {
      "time": "2 Mar 2002 — 6:31pm",
      "content": "I'm disappointed to see how this critique has gone. People are way too quick to judge the work of others as being 'similar'.   \n   \nOkay, it's fine to say, \"This reminds me of Melior,\" but you cross the line by suggesting that Miles Newlyn took Melior and squeezed it or stole some points. Do you all actually believe that? This is cynicism eroding logic, it's jealousy preying on your common sense. If you people want to play detective and take a bite out of crime, Typophile is not the place.   \n   \nSurely, criticize what you don't like, point out similar faces, but we should NEVER make assumptions as to how a face was created.   \n   \nThat's one of the worst things you can do in a forum like this.   \n   \nC'mon now people. Miles deserves some apologies.   \n   \nbj ![:(](http://web.archive.org/web/20150417175352im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": "2 Mar 2002 — 6:49pm",
      "content": "I knew I should have stayed out of this and not made negative comments... But I think Miles should speak for himself now as he hasn't commented anything since he first posted the design.\n\n"
    },
    {
      "time": "2 Mar 2002 — 7:13pm",
      "content": "And if anyone deserves an apology I think it's Hrant! Why do people keep picking on him?! ;-)\n\n"
    },
    {
      "time": "2 Mar 2002 — 8:05pm",
      "content": "He (Miles) shouldn't have to comment and why would he want to? We (the Typophile participants) get a top-level designer/thinker in our midst and this is how he's treated?   \n   \nGiven this precedent, do you think we'll see any more established type designers like Miles posting work in progress?   \n   \nAgain, do the critics REALLY believe the absurd notion that the Melior outlines were actually manipulated in this instance or are we supposed to infer something else from what they've posted?   \n   \n?   \n   \nbj ![:(](http://web.archive.org/web/20150417175352im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": "2 Mar 2002 — 9:26pm",
      "content": "\\> I don't think anyone needs to show evidence of their own abilities in order to critique other peoples work.   \n   \nI agree entirely (a food critic does not need to know how to cook - although it might help), and am sorry if I implied otherwise. I was actually getting at something else: that any work -including that of FD- draws inspiration from \"outside\", just in different ways and amounts.   \n   \n\\> I think it was worth saying   \n   \nAgreed again. I just worry -as perhaps I too often do- about \\*intentions\\*, as opposed to \"results\".   \n   \nBTW, I actually had some déjà vu when first looking at Verona (maybe because I'd been looking closely at Melior a few months ago), but since I thought it was original \\*enough\\* of its own, I didn't bother investigating.   \n   \n\\> I'd say you're all soft and cuddly under that tough exterior   \n   \n:-/   \nI'm a Gemini, so maybe I'm two things, all the time, inside and/or out.   \n   \nBTW, pick away.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Mar 2002 — 10:49pm",
      "content": "BJ, have another look at Melior. The lines   \nappear to be identical. I welcome Miles to   \nprove me wrong. I might be.   \n   \nStephen\n\n"
    },
    {
      "time": "2 Mar 2002 — 11:37pm",
      "content": "I looked at some thumbnails on myfonts, but you're missing the point.   \n   \nMiles Newlyn does not have anything to prove!   \n   \nTo you, to me, or to anyone.   \n   \nHe's been there, done that. To paraphrase Jack Nicholson, \"extend some f---ing courtesy.\"\\*   \n   \n ![:)](http://web.archive.org/web/20150417175352im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n(parenthetical here to say, I'm trying to say this nicely) Miles Newlyn comes in for the first time and you are welcoming him to prove you wrong?   \n   \nI don't know what to say anymore...   \n   \nBut while we disagree, please don't take this personal. That's not what it's about. Same thing with Mart, whom I met in person (along with Hrant) last week in LA. (Yes, a secret meeting of the So-Cal Typophiles.\\*\\*)   \n   \nI just feel strongly that to suggest plaigarism or point theft, especially to someone of MN's caliber is harmful and completely inappropriate. Also, there's something called a Chilling Effect. If every time someone posts something, their post is followed with \"This looks like the work of SOMEBODY ELSE\" or \"is this ORIGINAL\" it makes people reluctant to post something, thus a Chilling Effect.   \n   \nIt's fine to point out faces that are similar, but going beyond that takes Typophile in an unfortunate direction.   \n   \njust my opinion.   \n   \n   \nbj   \n   \n   \n\\* yes, another JN reference.   \n\\*\\* not secret anymore.\n\n"
    },
    {
      "time": "3 Mar 2002 — 5:31am",
      "content": "Hrant obviously spent lots of time studying the work before he makes comments. He is critical, as he should be and clear in his explanations and suggestions. This is exactly the point of this forum.   \n   \nI contacted Miles Newlyn directly to get his work up on typophile a few weeks ago. He is one of my own favorite designers in the field.   \nFor anyone not familiar with the work of Miles Newlyn, he has 2 typefaces distributed through Emigre, which is as far as I know the hardest distributor to get work accepted by in the industry, their fonts are all completely original designs, innovative, contemporary and of the highest standards, so I would say it is safe to say that Verona is completely original. I think it is important to consider the end user. It is a corporate client and I think there is a good chance they used to use something similar to Melior and just wanted something similar. Well that would make the challenge to design exactly that, a type face that is something similar and original at the same time. I doubt they would be satisfied with spending $1000's of dollars for a couple of tweaks here and there.   \n   \nI think it is valid to ask if a design is original or if it is a modified existing design.   \nI am still working on Unicratica (which I posted last month) there are signature elements from other sans faces in it but this is intentional, as the design as a whole is supposed to be a hybrid of my favorite sans faces, drawn from scratch.   \n   \nI would suggest that when a designer places a post it is stated when the design is a revival or a modification as to avoid the speculation of plagarism.\n\n"
    },
    {
      "time": "3 Mar 2002 — 10:46am",
      "content": "I'm with you on this Alastair.   \nLet him speak for himself before this discussion goes dizzy chasing it's own tail.\n\n"
    },
    {
      "time": "3 Mar 2002 — 12:57pm",
      "content": "I have enough battles of my own to fight, so I think I'll let you guys duke this one out...   \n   \nJust one question (to those of you won't refuse to answer because you think Verona is a rip-off): What do you think of the friggin' font?!   \n   \nhhp\n\n"
    },
    {
      "time": "3 Mar 2002 — 4:16pm",
      "content": "Are we looking at the same font here? \"It looks different enough to me...\" To me it's as clear as day. If he didn't use the actual digital points and beziers, then what he's done is squeezed Melior digitally then perhaps traced by hand over printouts of the shapes and redigitized, altering the x-height and making the cosmetic changes that we can all see. The subtleties in Melior's terminals and serifs have been replaced wholesale with a straight-edged and smoother-curved aesthetic, which though artfully done, it has to be said that this is far easier to do than designing new and different curved terminals. And while the curves in the letterforms are not \\*exactly\\* the same as the squeezed original, there is no mistaking the DIRECT correlation. The g for instance is uncannily similar: Don't tell me it isn't!   \n   \nOn the question of calling it plagiarism, I for one don't see much wrong in what he has done, save for my observations above that I thought the M W and Q are misfits. Certainly Melior is not one of Zapf's best pieces of work and is worth a revisit. But I think he should make the Melior connection clear and perhaps he just omitted to say that when posting. Established designer or not, this work is undoubtedly based on Melior and it does Hermann Zapf a discredit not to acknowledge Verona's origin.\n\n"
    },
    {
      "time": "3 Mar 2002 — 5:28pm",
      "content": "Hey fellas. Interesting discussion brewing here.   \nI'm not sure that it's helpful to Mr. Newlyn, but   \nit's certainly intriguing enough to stimulate   \nsome impassioned posts.   \n   \nTo be clear, in my first post I said that the   \ndesign \"does seem to share some exact points   \nand curves with Melior.\" I stand by this   \njudgment. I thank marcox for making the effort   \nto show a direct comparison, because, for me,   \nit adds credibility to my theory.   \n   \nI certainly feel that everyone who posts work   \nhere should be respected, regardless of their   \nreputation or experience. I believe I wouldn't   \ndo Mr. Newlyn justice if I wasn't honest about   \nhow I see his work. By posting Verona here   \nhe's asking for feedback. I expressed my first   \nimpression and concerns.   \n   \nThat said, I think it's a successful design. It   \nwould do any organization good. It's unique   \nand useable. If incorporated well I'm sure it   \ncould lend to brand recognition and esteem.   \nThe notion that it's derivative of Melior (in some   \nway) might not be a problem. If points were   \ncopied there may be legal issues, but we need   \nto remember that this font isn't for retail sale.   \nSurely it wouldn't be the first time a company   \ncustomized an existing digital typeface for its   \nown use.   \n   \nStephen   \n   \nSome questions: When does a \"revival\" become   \nethically unsound? How different must it be?   \nCan we only reissue a design that wasn't   \navailable digitally? Can we only revive type of a   \ncertain age? How old must it be? 500 years? 100?   \n50? I'm sure these questions have been asked   \nand answered before. Anyone know of a good   \nreference?\n\n"
    },
    {
      "time": "3 Mar 2002 — 7:41pm",
      "content": "\\> When does a \"revival\" become ethically unsound? How different ....   \n   \nNew thread, please (in \"General Discussions\").   \n   \nhhp\n\n"
    },
    {
      "time": "4 Mar 2002 — 2:26am",
      "content": "Jeez,   \n38 messages!   \nI havent had a chance to read them all yet (at work) but I can clearly see that there are issues   \nwith Melior. I need to point out that the client is a global licencee of Melior and that it was a starting point from which I saw a need to create something that was more suitable for retail/brand recognition use. I need to read all the messages and get back to the forum.\n\n"
    },
    {
      "time": "4 Mar 2002 — 8:41am",
      "content": "Dear Anonyrat,   \nNot only am I more clever than you, but I'm also more honorable. But in this case I haven't had to apply either of those qualities to any measurable extent. I think you should start a separate Hrant-bashing thread instead of trying to sabotage fruitful critiques in this forum - that would focus all your personal attacks, and maybe \\*then\\* you could make a dent - these occasional jabs are like a chihuahua repeatedly running towards me and getting kicked back across the room.   \n   \nIn any case, I've always had a lot of faith in Miles, and his latest post shows why. Not only is he a great type designer (what are \\*you\\* good at?), but he can defend himself just fine. On the other hand, maybe I'm wasting my breath, because you yourself aren't really here to talk about Verona, or Miles, or even type...   \n   \nhhp\n\n"
    },
    {
      "time": "4 Mar 2002 — 1:15pm",
      "content": "I must apologise to all contributors.   \nI'm only able to get to the web perhaps twice a week for the pleasure of surfing and forums like typophile. If I'd have been able to get back here sooner I'd have been able to stop a lot of people's time being wasted. I was under the impression that the sans/serif etc. forums were a discussion about the aesthetic merits typography, not the issues of originality.   \nI'll put a much clearer intro to my posting for Modena on in the sans forum soon.   \n   \nSo here's the background:   \nSome years back I was asked to produce a logotype based on Melior. The job never went ahead and I decided to develop the few letters into a typeface. This was called Torino, and after finding that that name had been used for another typeface (a condensed serif, must have been at the back of my mind), I named it after another Italian city, Verona. In not nameing the typeface Melior\\_\\_\\_\\_ or \\_\\_\\_Melior I had obviously considered the design to some degree not Melior at this point, and that has been the discussion here.   \n   \nThe design had been sitting on the hard drive for some years and I'd forgotten about it. When I was approached by the client for which Verona is now intended, I remembered the design, and to my eye it immediately fitted their requirements. Only minor though important changes were made to Torino in aligning some design features with the sans I was also developing for the same client.   \n   \nIn posting Verona here, a far greater number of helpful suggestions have been made than I'd hoped for, and I'm certainly respectful of the focus that it has brought to the source of the design, Melior has some truly wonderful features and I've long been a fan of the super-elipse. I also looked at Century, Renault, Monanti and Marconi whilst drawing Verona.   \n   \nThose are the details that come to mind at present, I bet there's something important that I've missed.   \n   \nI'm certainly don't feel worthy of the kind of defense my name has received above, I'm a type designer that works very much as part of a design team, and in that sense I'm not the kind of self sustaining artist that many of my heroes are; Tankard, Licko, Barnbrook, Blockland(both)to name but a few. The thing is, it's a huge and very confident step to say \"I'm a type designer, and I'll have my own studio and do my own thing, and I hope people will buy it.\" I did that in the early ninties, and the typeface's that came out were pretty abstract, not the sort of designs that I can make a living from. Having said that, those designs and designs of that ilk (Lee Schulz's work I'm in awe of) are my passion.   \nIn what seems great number of years I've been modifying existing designs for clients simply because very few of them have an understanding of the time it takes to do a new design, and throughout this I've either arranged the proper licence myself, or have had to pester brand managers in countries that have much 'softer' attitudes to licensing to get the proper licence.   \nType design is a relatively anonymous art at the best of times, and anyone involved in the creation of new expressions through the letterform deserves credit, those contributors that have raised Melior here are doing exactly that.I doubt we'll ever get to the wonderful copyright/credit model that photographers seem to have maintained.\n\n"
    },
    {
      "time": "4 Mar 2002 — 10:34pm",
      "content": "So I guess Verona and Miles are pretty much in the clear. The only thing some people might ask is: Should Zapf have been asked for permission (even though Melior is paid for)? To me the answer is a clear \"no\": that sort of thing can hurt type design more than it can help.   \n   \nBTW, I'm a huge fan of Schulz too: I think his work is a tantalizing glimpse into the future.   \n   \nBTBTW, if the italics will be shared, it might be nice to have a name for it. What about \"Rimini\"? It's a small Adriatic city with a unique sensuality about it.   \n   \n\\> the food critic example is not a good choice.   \n   \nWell, maybe no analogy can be prefect. I just have a weakness for culinary ones! :-)   \n   \nLet me rephrase it: A food critic doesn't need to be a master chef. But you know, even that's flawed: haute cuisine is like display typography - it doesn't cover sustenence: the world of text. So maybe I should say: A dietician (somebody who helps his cliencts to balance taste and nutrition) doesn't need to be a farmer. ?   \n   \n\\> we haven't disabled anonymous posting.   \n   \nAs I've said before, I think anonymity does bring a unique flavor to the table. On the other hand, I also think it should be a privilege, not a right - as in something that can be taken away if abused (even though no preventive measure can be fool-proof).   \n   \nhhp\n\n"
    },
    {
      "time": "5 Mar 2002 — 4:31am",
      "content": "Hrant,   \n   \nI do understand you, for culinary analogies are tempting to say the least. But the one you used, thus rephrased, sounds quite allright to me.   \n   \nBelieve me, I've worked along duly published (and quite proud) \"food critics\" who couldn't cook an egg, and you can imagine what havoc they caused in professional circles. I know a very famous one (in France, he even owns and edits a guidebook) who's medically deprived of the sense of taste. I'd say that's the extreme situation. Besides, I think you are right in your analogy between display typography and haute cuisine, I had never thought of it and I like it.\n\n"
    },
    {
      "time": "5 Mar 2002 — 8:56am",
      "content": "Admittedly, I need to read the entire thread, as opposed to simply skimming. That said, I think Verona is very nice. Articulated enough for text, but ballsy enough for display. {Melior is too soft around the edges anyway.)   \n   \nMy apologies for not reading thoroughly, but will this be developed into a larger family? Nevermind, just double checked. In that case, Could the lighter weight be even sharper and more crisp? Meaning, light weights aren't logical for reading, but can be beautiful quite large? Sheesh, my weakness is showing. ;-)   \n   \nVery Nice indeed!\n\n"
    },
    {
      "time": "5 Mar 2002 — 9:44am",
      "content": "\\> .... medically deprived of the sense of taste.   \n   \nWow - that's just amazing.   \nBut you have to give the guy credit for pulling it off! :-)   \n   \n\\> light weights aren't logical for reading, but can be beautiful quite large?   \n   \nI agree, and it's funny that so many people practice the opposite: they make text fonts too light, and they insist on making obese versions of Garamond. Proper nutrition is critical!   \n   \nBringing this back to Miles, in a way: I used to hate his Missionary, but then I saw a few single letters set at a few hundred points (in some travel magazine), and couldn't help but admire it. BTW, did you guys know it was based on OCR-A (well, in part)? Staggering.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Mar 2002 — 11:37am",
      "content": "Manoti (M Anoti?),   \nYou don't even know half of it! :-/ It's really much more messy and complicated than you seem to think - and I highly doubt that you'd want to hear all the gory details: the topsy-turviness and legalities of font protection, our particular views of ethical behavior (which are much more important to many of us than the whims of any corrupt legal system), not to mention all the technicalities like color balancing, trapping, encoding, all blah blah blah to you.   \n   \nIn some ways the world of fonts is very frustrating, in other ways it has a depth and a richness that for example graphic design per se will never have. I for one would very much dislike being called a graphic designer.   \n   \nYeah, there's very little money in type design (except for the top bananas), but that just means that many of us do it out of love, and there's nothing better than that. So please show a little bit of respect, not least because -if you're going to stick around- it's really better for \\*you\\*.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Mar 2002 — 3:18pm",
      "content": "\\> why should you belittle mine?   \n   \nI'm not [trying to]. The way you spend your time and what you call yourself are most probably fine for you. Just not necessarily for anybody else, in particular not for me.   \n   \n\\> It certainly need not be a shallow enterprise   \n   \nAgreed - and that applies to anything, even things like lap dancing. It's just that different disciplines require different qualities to be [considered] successful in, and type design (certainly text type design) requires a depth that's in a way \"optional\" in graphic design. But to be fair, the real reason for this might be that there really isn't that much room for all of us who want to make a living designing fonts...   \n   \nGraphic designers need to be more artistic, text face designers need to be more crafty - and I personally prefer the latter, that's all.   \n   \nBTW, I'm not by any means a very good type designer - you're probably a better graphic designer.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Mar 2002 — 9:48pm",
      "content": "To coin a cliché: I feel like we need some closure here. This was one of the most interesting discussions I've seen at Typophile. On the one hand I feel vindicated by Miles' revelations about the direct link to Melior - although he is still short on the technical details of his work - but on the other hand I realize it's a serious charge if you accuse a designer of wholesale \"borrowing\" of another designer's specific bezier curves and points and it shouldn't be made lightly.   \n   \nI don't think, however that we should automatically get down on our hands and knees if and when a \\*name\\* designer happens to speak up here. The Typophile forums are not like a fan club where, if a celebrity makes an appearance then everyone lines up to get their autograph and basks in the glory of their brief attention; it's more like (I'd hope) a place of learning and interaction that experienced practitioners might frequent and be subject to interesting and sometimes difficult questions from the students.   \n   \nBack to Verona: From his words, Miles is clearly revisiting the design but it is not a revival but a reinterpretation. His integrity shows in the work itself (but we could do with a sample text setting at 12 point, don't you think) and in the fact that he came here to discuss the work. Unfortunately, I don't think the hard core font rip-off artists are likely to frequent Typophile, except perhaps for trolling, and so it's unlikely their \"work\" will be put under the Typophile microsope in the same fashion.\n\n"
    },
    {
      "time": "6 Mar 2002 — 7:51am",
      "content": "Fellow Designer:   \nRespect is a two-way street, and a good environment can only be created through active good-will. I think it takes a lot of gall to make any recommendations to Miles without first admitting that you incorrectly assumed the worst about his character, using that assumption to make a public attack. Please apologize before you preach. He has been atypically (for a type designer) gracious and humble in not lashing back. Stephen made the same mistake as you (a mistake I myself have made a number of times in the past - like when I once incorrectly accused ParaType of plagiarism - but I apologized pronto), but at least he has the sense to keep quiet. But I guess being anonymous has its advantages... On the other hand, I'd start using a new pseudonym now, since this one has been tainted.   \n   \nMartin:   \nSince rip-offs and shoddy corporate beahavior are commonplace these days, one might be excused for assuming that Melior/Zapf got short-changed. But we should all express relief that this was a case where the original got its full due. On the other hand, I totally agree that celebrity is no excuse for special treatment here. In fact, I try to give celebrities a harder time.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Mar 2002 — 8:44am",
      "content": "Pardon me if I don't bother to scour those photos to try to figure out who you are. Since you present yourself anonymously, I'm sure you'll understand.   \n   \nAnyway, the advice might indeed be good from a certain perspective (not mine), but that doesn't mean your \"brother\" (hmmm, this is smelling like some exclusive fraternity...) can legitimately avoid apologizing. And you know it.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Mar 2002 — 9:30am",
      "content": "True, Sbo. We are going nowhere. It seems   \nposters are more interested in cat fights than   \ndiscussing the typeface up for critique.   \n   \nIn the interest of shifting that trend, I'd love   \nto see a small block of body copy at 10-12 pts.   \nif possible, Miles. I know the Web is a poor   \nmedium for this sort of thing, but it might help   \nus to get an idea of color, spacing and any   \nglaring inconsistencies/distractions.   \n   \nOr will Verona be used solely as a display face?   \n   \nStephen\n\n"
    },
    {
      "time": "6 Mar 2002 — 9:46am",
      "content": "\\> It seems posters are more interested in cat fights than discussing the typeface up for critique.   \n   \nIt would certainly be nice if all these famous designers gave some of their assumedly invaluable insight, since this is a \\*design\\* critique forum...   \n   \nhhp\n\n"
    },
    {
      "time": "7 Mar 2002 — 8:43am",
      "content": "Fellow, there is nothing that lies before me except what I decide to put there. Giving eye teeth won't put anything in front of anyone.   \nWhat are you talking about?\n\n"
    },
    {
      "time": "7 Mar 2002 — 9:02am",
      "content": "Young Newlyn, do not question the ways of the Great & Secret Fraternal Order of Type Cutters!   \n   \nhhp\n\n"
    },
    {
      "time": "7 Mar 2002 — 1:23pm",
      "content": "David, you bring up something interesting. It's something that doesn't \\*exactly\\* belong here, but this thread has already covered everything from cuisine to diminutive dogs, so I think I'll just go for it:   \n   \nIt's not clear that Zapf intended Melior to be a newspaper face (not that intentions are everything - a careful reading of Lawson's \"Anatomy\" reveals that Optima for one started out \\*very\\* differently than it ended up, due [in a way] to circumstance no less), but Tracy \\*had\\* specifically called it that; \\*however\\*, Gurtler (a veritable living legend when it comes to newspaper design) explicitly refused to consider it as such in his landmark article about the history of news faces (upto the mid-80s) in Typografische Monatsblaetter. What's your view?   \n   \nhhp\n\n"
    },
    {
      "time": "7 Mar 2002 — 3:32pm",
      "content": "Verona is intended only as a titling type, I think it's far too condensed for text, at 12 point it's going to look tedious and cramped.   \nI've designed an accompanying sans for text, and the amounts of text I'm dealing with are a paragraph long at most.\n\n"
    },
    {
      "time": "8 Mar 2002 — 7:37am",
      "content": "\\> What are your favorite newspaper faces?   \n   \nSeparate thread, please! This is a great topic.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Nov 2002 — 10:34am",
      "content": "The answer to many of the questions that were asked: [3](http://web.archive.org/web/20150417175352/http:/www.tre.se/)   \n(Found in [Règles:Zéro](http://web.archive.org/web/20150417175352/http:/www.regleszero.com/).)\n\n"
    },
    {
      "time": "11 Nov 2002 — 3:09am",
      "content": "nice discussion...\n\n"
    },
    {
      "time": "1 Mar 2002 — 8:02pm",
      "content": "Miles, try this:   \n   \nYou take Melior. You squeeze it slightly.   \n   \nYou change J, M, Q, W, &, g, 2, 5, and ?   \n   \nNew corporate typeface? I don't think so.\n\n"
    },
    {
      "time": "2 Mar 2002 — 4:04am",
      "content": "... and only 50 years behind the curve.   \n   \nMelior was issued in 1952.\n\n"
    },
    {
      "time": "2 Mar 2002 — 6:38am",
      "content": "Fellow Designer dont you like Miles's font?   \nOr is it something else that you dont like?   \n ![:)](http://web.archive.org/web/20150417175352im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nSbo\n\n"
    },
    {
      "time": "2 Mar 2002 — 4:01pm",
      "content": "Hrant, dont try to change the subject. The topic here is Verona. Lets stick with it and see where it leads. Miles asked for input.\n\n"
    },
    {
      "time": "2 Mar 2002 — 6:46pm",
      "content": "I'd like to chime in with two comments.   \n   \n1. Hrant. I don't think anyone needs to show evidence of their own abilities in order to critique other peoples work. If that were the case where would all the literary and film critics go? I come here to check out people's work and draw my own conclusions every day, and I'm a piss-poor type designer.   \n   \n2. I don't know if 'Fellow Designer' had mischievous intent or not, but I certainly found interesting the similarities between the typefaces. I think it was worth saying, and possibly Miles can benefit from this issue being raised? btw, I certainly wouldn't think anything less of Miles if Verona is directly inspired by Melior (a typeface I'd cheerily ignored the potential of until now).   \n   \n   \nAlso nice to the 'Mr Grumpy' persona of Hrant hasn't changed since the last time I was signed up to the typo-l 3/4 years ago. I'd say you're all soft and cuddly under that tough exterior :-)\n\n"
    },
    {
      "time": "3 Mar 2002 — 8:16am",
      "content": "What a welcome Miles get on this forum. I feel ashamed. Why not ask Miles himself about his departure and arrival for his work in progress?   \nI for one adore his designs and would welcome his opinion on anything typerelated. I would love to see the sans serif version Miles. If you still feel encouraged that this hostility against your effort can change with your comments upon what is said in this thread, then do it.   \n   \nAnd, Hrant, you are of course entitled to your critique. But, there is a time for everything. Let Miles tell us a little about his design, and then he most likely would appretiate some good constructive critique.   \n   \nSbo\n\n"
    },
    {
      "time": "3 Mar 2002 — 9:06am",
      "content": "While Melior was the first thing that entered my mind when I saw Verona as well, both Fellow Designer and Stephen Coles have made some pretty serious allegations. It may not be necessary for a food critic to know how to cook, but it is still the burden of one making charges like these to supply some evidence of proof of the charges, and \"they look similar\" isn't enough to meet the charges. If so, the designer of Apple Garamond may have some explaining to do as well.   \n   \nFellow designer makes the allegation that Miles started with Melior and altered it -- a very serious charge. Stephen charges that Verona and Melior \"have some exact points and curves\" in common. Are you sure, Stephen? Were to somehow able to compare the two, point by point? If so, please show the evidence as you make the charge, and we will be able to see for ourselves. Otherwise, it is a baseless, and purely circumstantial on appearance, allegation.   \n   \nAs an established professional designer, Miles deserves at very least the presumption of innocence on this one until proof can be supplied otherwise. With (so far) groundless charges like this hurled at him immediately upon his participation in the Typophile forums, it's no wonder he hasn't commented. I wouldn't blame him if he never returned.   \n   \nI'm with BJ. I'm disappointed and embarrassed with this critique.   \n   \nDavid\n\n"
    },
    {
      "time": "3 Mar 2002 — 9:42am",
      "content": "Um, maybe I'm missing something here, but...   \n   \nIt doesn't matter how high profile Miles is. If you are advocating people walk on eggshells simply because it might embarrass the celeb type designer, then I suggest you reconsider.   \n   \nIf Joe Shmoe posted that face, you would be happy enough to query the Melior connection. The same rules should apply to any poster.   \n   \nI don't see that it's a big deal. If it's derived from Melior it's just as valid to me. Emigre were happy enough to release Mrs Eaves after all.   \n   \nI'm also not sure that 'Fellow Designer' made any explicit accusation of nicking the Melior outlines.   \n   \na bit of chilling out is in order.\n\n"
    }
  ]
}
