{
  "id": "10979",
  "title": "Verde logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "HowD   \nI'm hoping to get some feedback on the logos below. First let me tell you the project constraints:   \n1. The 'At Conservation International' part with the line has to be there (somewhere), unmodified.   \n2. The only fonts I can use are Adobe Garamond, Trade Gothic, and Univers (even though the at conservation... line is palitino-go figure).   \n3. Those are the only shades of green I can use.   \n   \nGiven all that what do you think?   \nThanks!   \nZeke   \n   \n ![verde logos](http://web.archive.org/web/20150417172006im_/http:/www.typophile.com/forums/messages/29/8777.gif)\n\n",
  "author": "zeroskillz",
  "time": "16 Apr 2003 — 5:54am",
  "uid": "1486",
  "comments": [
    {
      "time": "16 Apr 2003 — 6:46am",
      "content": "zeros...   \n   \ni like the first one, for me it is more unified all the parts, and the thing that only the descender of your R makes the leaf i think it gives a more vegetable look, woth the others solutions, specially the second one i think you fall in a geometric-static look on your leaf   \n   \nanyway, nice colors, try the separation line with the VERDE green.   \n   \nCG\n\n"
    },
    {
      "time": "16 Apr 2003 — 7:37am",
      "content": "I had this vision of an Uncial \"d\" being a leaf, maybe in a darkish flare-serif font.   \n   \nAnd I think all-UC might send the wrong message here.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Apr 2003 — 7:52am",
      "content": "Zeke, this looks pretty nice and I'll put my   \nvote up for number one. I can't find anything   \nnegative to say about it. Looks good.   \n   \nIf I had to choose a second one I would say   \ngo with number two. But the last two seem to   \nbe trying a little too hard.   \n   \n-smc\n\n"
    },
    {
      "time": "16 Apr 2003 — 8:32am",
      "content": "I am agree with Cristian, and i think that the firs solution is the better, but the layout is messy. Maybe if you talke that big V on verde and make them to descend to make the top of the logo as a line, at the same at the bottom phrase. Now you got a logo just with the R descendent, thge rest of the information need to be secondary,   \n   \nNice Idea, and colors   \n   \nMH\n\n"
    },
    {
      "time": "16 Apr 2003 — 9:20am",
      "content": "The first, although cramped is the least clever. And in this instance I don't think clever is what you want. Although the _fake_ smallcaps aren't helping either. Do you have a version of this face with _real_ smallcaps? The 'R' needs to be given some it's florentine roots back. You've stretched the curve too much and it shows. It would be more elegant, and natural, if you could create the leaf from the natural stroke of the 'R'. This would also fix the clotting in between the 'R' and the 'D'. As well, it would also force your to drop the leaf a little lower which it needs. Hrant suggestion about a little less all caps might be nice to explore as well. And if you must use a _fake_ smallcap, limit it to only the word Verde. I really like the colors. They seem crisp and elegant. Smart Papers makes something with this kind of scheme that would be beautiful. And one more thing. The word 'AT' seems to be an afterthought. It needs to fit into the scheme, not float outside of it.\n\n"
    },
    {
      "time": "21 Apr 2003 — 7:54am",
      "content": "WOW thanks for all the great advice.   \nHeres what Ive come up with based on your suggestions.   \nI'm kinda partial to the one line version now. Let me know what you think. Thanks! -zeke   \n ![verde1](http://web.archive.org/web/20150417172006im_/http:/www.typophile.com/forums/messages/29/9029.gif)   \n   \n ![verde2](http://web.archive.org/web/20150417172006im_/http:/www.typophile.com/forums/messages/29/9030.gif)\n\n"
    },
    {
      "time": "21 Apr 2003 — 8:22am",
      "content": "Is the line required?   \n  \nHere is a quick remix suggestion of your last version.   \nI could have verbally explained what I meant but   \nthis was easier.   \n  \n ![](http://web.archive.org/web/20150417172006im_/http:/www.typophile.com/forums/messages/29/9042.gif)  \n  \nThe remix would still need work. I might make   \n\"at conservation international\" smaller and letter   \nspace it a bit more for starters.   \n  \nCould you make \"fund\" the same color as   \n\"venture?\" It would make the color balanced.   \n   \nDid the dark green change from your first post   \nor is it just a screen thing? If it did change the   \nfirst dark green was better.   \n  \nYou are progressing well.   \n  \n-sean michael\n\n"
    },
    {
      "time": "8 May 2003 — 3:37pm",
      "content": "Zero, you've done some excellent things with that logo! I think Sean Michael's solution to balancing the logo is perfect.   \n   \nPaul\n\n"
    },
    {
      "time": "9 May 2003 — 6:05am",
      "content": "Thanks for all your input!   \nAs these things usually go, halfway through the project they decide to dump the word 'Fund'.   \nSo here is where it stands now.   \nI am required to use a rule between 'Verde Ventures' and 'At Conservation International'.   \nLet me know what you think.   \nThanks!   \n-zeroskillz   \n   \n   \n   \n ![verdelogo](http://web.archive.org/web/20150417172006im_/http:/www.typophile.com/forums/messages/29/10619.jpg)\n\n"
    },
    {
      "time": "10 May 2003 — 10:22am",
      "content": "Fine solution Zero, who is this logo for? what does verde ventures do and what is that conservation international stuff about?\n\n"
    },
    {
      "time": "18 Jun 2003 — 12:35pm",
      "content": "Zero, the last version looks very good. It restores the balance now the word 'Fund' is gone.   \nPerhaps the only things I would change are the capital C and I in the small sentence. But that's personal.   \n   \nSell it. It's ready.   \n   \nRen\n\n"
    },
    {
      "time": "23 Jun 2003 — 11:36am",
      "content": "Thanks for all your help!   \nThe last version sold...   \nThe 'At Conservation International' line in Palitino-fake-small-caps is, unfortunately, a logotype and cant be modified.   \nAs to hectors question about ci, more can be found at [www.conservation.org](http://web.archive.org/web/20150417172006/http:/www.conservation.org/).   \n   \nThe verde ventures fund is a money raising entity for ecotourism and other eco-related businesses.\n\n"
    },
    {
      "time": "16 Apr 2003 — 11:46am",
      "content": "It's nice overall. I'll second what Tiffany wrote about cleverness.   \n   \nThe whole \"at Conservation International\" line needs work.   \nIt seems like it could be smaller. Try a different typeface   \nperhaps, or try changing the case as Hrant suggests.\n\n"
    }
  ]
}
