{
  "id": "10973",
  "title": "Typographic composition",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Here is a piece I did for artist named David Tupper. ![David Tupper.jpg](http://web.archive.org/web/20150417201246im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n",
  "author": "designalchemy",
  "time": "2 Mar 2002 — 6:49pm",
  "uid": "804",
  "comments": [
    {
      "time": "2 Mar 2002 — 6:52pm",
      "content": "Here is a piece I did for an artist named David Tupper. ![David Tupper.jpg](http://web.archive.org/web/20150417201246im_/http:/www.typophile.com/forums/messages/29/875.jpg)\n\n"
    },
    {
      "time": "4 Mar 2002 — 5:33pm",
      "content": "It is several paintings, scanned text from a 1860's book on painting and art and a couple of fonts.   \n   \nDirections   \nPlace ingredients onto standard pad, distress rigorously for 20 seconds, toss a couple of times, and simmer remains in Japanese pixel   \nbased broth until progress bar finishes.   \nSeparate into cmyk and there you go. Voila!\n\n"
    },
    {
      "time": "4 Mar 2002 — 6:48pm",
      "content": "the style of the paintings lends itself very easily to this picasso-looking montage, where the book clipping and label for tupper look like found objects. however i want to see more of that interesting type treatment- but i guess thats because im a typophile.\n\n"
    },
    {
      "time": "26 Mar 2003 — 9:51am",
      "content": "I am really enjoying the layering of your imagery as well; especially with the vibrant colors you have selected, but I think that the composition is quite heavy on the right side. I think this might be solved if you moved your vertical type along with the beige form (with David Tupper) over to the left. Plus, I am not sure if you wanted the viewer to automatically read the text first. If this is what you want then the text in the middle is fine. But when I first viewed it, my eyes were stuck on the text and it was very hard for my eye to focus on the imagery. What I am saying is, the text does not move my eye around your composition. If the text was moved to the left, the curvature of the form (with David Tupper) would lead my eye into the right side of the piece a little more. But, I really enjoyed your piece! Lovely.\n\n"
    },
    {
      "time": "30 Mar 2003 — 4:06am",
      "content": "This composition SUCKS!!!\n\n"
    },
    {
      "time": "30 Mar 2003 — 10:48am",
      "content": "hey, thanks for that eloquent critique. man, that was great.   \nyou must be a brilliant artist yourself, judging by the very   \nprofound knowledge you've shared with us.\n\n"
    },
    {
      "time": "30 Mar 2003 — 12:33pm",
      "content": "Isaac - Michael and Ole are design colleagues   \nin Seattle.   \n   \n   \n   \nbj\n\n"
    },
    {
      "time": "30 Mar 2003 — 7:55pm",
      "content": "oh. now i feel wicked dumb. but i stuck up for the guy, right?   \naren't you proud of me? mr. michael greenwood, i offer my   \napologies for insulting your expertise. i should have known   \nthat it was only a joke. next time i will ask before i open my   \nmouth. although i have said that before. anyway, i'll try to   \nsomehow get a sense of humor. buy one or something.\n\n"
    },
    {
      "time": "30 Mar 2003 — 8:16pm",
      "content": "it's all good isaac; i just didn't   \nwant you to start a barfight.   \n   \nyour verve is admirable. ![:-)](http://web.archive.org/web/20150417201246im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nand the Photoshop mustache...that pulls.   \n   \nbj\n\n"
    },
    {
      "time": "30 Mar 2003 — 8:25pm",
      "content": "hey! that's real! o.k., it's not.\n\n"
    },
    {
      "time": "31 Mar 2003 — 12:03am",
      "content": "Ya Ole and I actually share an office together.   \n   \nI just like giving him a hard time. :D\n\n"
    },
    {
      "time": "31 Mar 2003 — 5:58am",
      "content": "Ole -- I especially like the typeface you used for the artist's name. What is it?\n\n"
    },
    {
      "time": "4 Mar 2002 — 3:30pm",
      "content": "I enjoy the layering that's happening on this composition. Did you piece together several of his works or is the background one of his pieces?\n\n"
    }
  ]
}
