{
  "id": "10997",
  "title": "Non-font typography",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hey i got the feb HOW magazine here, and this pic is from an article called \"non-font\" typography. i thought the article was kinda silly, but does anyone see something weird here? this is the left side of the spread that introduces the article.   \n ![typography](http://web.archive.org/web/20140803101300im_/http:/www.typophile.com/forums/messages/30/886.jpg)\n\n",
  "author": "anonymous",
  "time": "6 Mar 2002 — 12:21pm",
  "uid": "1203",
  "comments": [
    {
      "time": "7 Mar 2002 — 8:11am",
      "content": "But they did have a recent type-centric issue, and the content at least wasn't too bad (for a mainstream magazine).   \n   \nhhp\n\n"
    },
    {
      "time": "6 Mar 2002 — 12:32pm",
      "content": "hm, dunno. Are you referring to the kerning of \"YP\"? It looks off.\n\n"
    },
    {
      "time": "6 Mar 2002 — 12:38pm",
      "content": "This is a screenshot from my portfolio. When \"setting\" these icons, I fussed over the kerning just as one would when setting type. Is this the type of non-font typography the HOW article refers to?   \n   \n ![bkicons](http://web.archive.org/web/20140803101300im_/http:/www.typophile.com/forums/messages/30/887.jpg)\n\n"
    },
    {
      "time": "6 Mar 2002 — 1:07pm",
      "content": "ok i should have explained- the article is about how the author of the article has noticed that \"more and more designers are turning away from pre-fabricated fonts and toward handlettering, found objects, or other non-font solutions to fulfill their typographic needs.\" and yes the tracking throughout the magazine is off but im going for something else.\n\n"
    },
    {
      "time": "6 Mar 2002 — 1:39pm",
      "content": "i mean kerning, not tracking\n\n"
    },
    {
      "time": "7 Mar 2002 — 7:13am",
      "content": "Everything about HOW magazine is 'off' and always has been. It's a joke of a magazine.\n\n"
    },
    {
      "time": "7 Mar 2002 — 9:01am",
      "content": "The problem I had with this article- the author of the article talks about how designers are more and more using \"non-font\" solutions. Isnt that what good designers do anyway? But what I've noticed is more and more designers turning to uncreative font solutions- like the person who designed this spread. You're designing a spread about not using fonts, AND THEN YOU GO AHEAD AND MAKE A BORING SPREAD USING A COUPLE ORDINARY FONTS THAT WERE NOT EVEN KERNED. damn this mag sucks. It reeks of amateur hell.\n\n"
    },
    {
      "time": "8 Mar 2002 — 2:58am",
      "content": "I don't have a problem with using type to communicate a story about not using type. It might be fairly literal to use handwriting/rubberstamps/chickenfeet/whatever, but that doesn't make it clever, or necessarily appropriate. Presumably there were illustrations which served to communicate the process of non-font design?\n\n"
    },
    {
      "time": "6 Mar 2002 — 12:32pm",
      "content": "Hey, how else can you convey language? :-)   \nFor a while -in the 60s, I think- people were giving all kinds of credit to icon-based communication. But then the illusion wore off, and people \"resigned\" to using actual sentences and words and stuff.   \n   \nhhp\n\n"
    }
  ]
}
