{
  "id": "10998",
  "title": "Stone Sans Problems in OS9/OSX",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anybody know why when I drop individual bought versions of Stone Sans into Suitcase or simply in a fonts folder I get different versions depending on the application? (i.e. Plain / Medium / Regular).   \n   \nAll other fonts have been removed to ensure only one version exists on the machine (or on Suitcase Server).   \n   \nStoneSans in Illustrator 10 in OSX gives:   \nMedium / Italic / SemiBold / SemiBold Italic   \n   \nStoneSans in Illustrator 8 in Classic mode gives   \nRegular / Italic / SemiBold / SemiBold Italic / Bold / Bold Italic   \n   \nStoneSans in Photoshop 7 in OSX gives   \nMedium / Italic / SemiBold / SemiBold Italic   \n   \nStoneSans in Apple TextEdit in OSX gives   \nPlain / Italic / SemiBold SemiBold Italic / Bold / Bold Italic   \n   \nStoneSans in Apple Mail in OSX gives   \nPlain / Italic / SemiBold SemiBold Italic / Bold / Bold Italic   \n   \nArtpro 7 in OSX gives:   \nPlain / Italic / SemiBold SemiBold Italic / Bold / Bold Italic   \n   \nMicrosoft Word (Office X) in OSX gives:   \nRegular / Italic / Bold / Bold Italic   \n   \nThis problem causes text re-flowing issues; see attached for example screen grabs.   \n   \nWhilst researching this issue I noticed a similar problem was posted on another forum, but got no response\n\n",
  "author": "anonymous",
  "time": "17 Apr 2003 — 5:19am",
  "uid": "1203",
  "comments": [
    {
      "time": "17 Apr 2003 — 8:00am",
      "content": "Jean Fran\n\n"
    },
    {
      "time": "17 Apr 2003 — 8:23am",
      "content": ";-)   \nOh yes, I will launch a new computer platform next 1st april 2004, with French and Irish language support only. No more english words on menus.   \n   \nWorking name of the new platform operating system is   \n\"Pomme par la Fen\n\n"
    },
    {
      "time": "17 Apr 2003 — 8:33am",
      "content": "Oh yes indeed, Jean Fran\n\n"
    },
    {
      "time": "17 Apr 2003 — 7:06am",
      "content": "I don't think you can change anything to your trouble. Its because Stone use a name mixture of Medium who is close to Regular but not standard, and SemiBold who is close to Bold but not standard too. So, as none of the applications you use, use font names in same way, some built the names from some ressources, others from others, you can do anything more than don't switch all the time of appl.   \n   \nThe reflow is done because: one time, the Medium is used and in other case, the Semi is used. no?   \n   \nYou in are in front what contemporary type designers have in front of them when they built large families cross platform. No standard at all! ;-(\n\n"
    }
  ]
}
