{
  "id": "110",
  "title": "Neweue Helpetica:-)",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi All.   \n   \nSo here's my story: I've made a resolution of sorts with myself to stop design work early on fridays to start up a font ideas. So, this last friday I started in on a grotesque (purely for the name of course). Just making one little design decision after another I arrived at what follows. About 20 glyphs into it realized I'd just drawn helvetica. Lame.   \n   \nAt that point obvious differences were the: a, k, s and y. So I started working on variants some of which are included in the gif (really the only successful one is the two story g which is rough when you get up close). So I guess I'm looking for feedback of two kinds, 1) how could what I have be better drawn technically, and 2) any other ideas on how this could change. We need something like this about as badly as we need another humanist sans. I thought about turning it into a slab serif? Thoughts?   \n   \nBTW, this is the first time I have ever made it all the way through a lower case so if only for that reason it was worth it :-)   \n   \nThanks.   \nRandy   \n   \n ![Neweue?](http://web.archive.org/web/20150414174311im_/http:/www.typophile.com/forums/messages/29/10695.gif)\n\n",
  "author": "aquatoad",
  "time": "12 May 2003 — 11:36am",
  "uid": "618",
  "comments": [
    {
      "time": "12 May 2003 — 12:25pm",
      "content": "Actually, even though I think there are other genres more worthy of effort, to me a good, relatively readable Grotesque isn't nearly as cliche as a humanist sans. If you resist making it cloyingly grot (which however is somewhat fashionable now) and keep readability in mind, you might end up with a new workhorse. That binocular \"g\", the \"k\", and those angled stems for example make me think you're on the right track. What I might do differently is making it slightly narrower, and pulling in the descenders a bit. And keep an eye on Franklin Gothic, both for inspiration and to avoid coming too close to it.   \n   \nhhp\n\n"
    },
    {
      "time": "12 May 2003 — 1:16pm",
      "content": "\\>to me a good, relatively readable Grotesque   \n\\>isn't nearly as cliche as a humanist sans.   \n   \nI'll disagree, I think that's the opposite. Imho, the grotesque style is   \nalmost a cliche in itself. Minimum stroke-contrast, closed shapes,   \nhorizontal terminals, all these characteristics from grotesque typefaces   \nrestrain the rising of \\*new\\* grotesques. In the other hand, you can   \nexperiment more with humanist sans and achieve much more useful   \nresults. Open and cursive shapes allow that.   \n   \n   \nAnyway, Randy:   \n-\"k\" and \"y\" doesn't fit;   \n-\"y\" is wide;   \n-reconsider that spur/finial (?) in \"a\";   \n-\"s\" looks odd (work the BCPs, man! use your fontographer :-)   \n   \nGood luck.\n\n"
    },
    {
      "time": "12 May 2003 — 1:44pm",
      "content": "\\> achieve much more useful results.   \n   \nUseful in _theory_...   \nI actually agree (?) that the humanist sans is a much nicer genre, but isn't it simply too crowded now?   \n   \nhhp\n\n"
    },
    {
      "time": "12 May 2003 — 2:01pm",
      "content": "\"Useful\", compared to grotesques...   \nAnd yes, there's a lot of humanist sans   \naround, I did one myself last year. :-)\n\n"
    },
    {
      "time": "12 May 2003 — 6:12pm",
      "content": "Thanks both.   \n   \nEduardo:   \n-reconsider that spur/finial (?) in \"a\";   \nI don't know what you mean.   \n   \n-\"s\" looks odd.   \nThis is what it looks like in Fontographer. Overall I was trying to keep the letter more open. As a result the character is not as closed as you find in Helvetica, and the weight is carried more in the spine. I'd love some BCP advise though!   \n   \nRegards,   \nRandy   \n ![as](http://web.archive.org/web/20150414174311im_/http:/www.typophile.com/forums/messages/29/10704.gif)\n\n"
    },
    {
      "time": "12 May 2003 — 8:49pm",
      "content": "Excellent! Don't know why but this design makes me smile.   \n   \nStuff I dig:   \n- Double-story g.   \n- Alternate j. (I'm not so brave)   \n- Alternate i and j in text. Especially in the word little.   \n- Slanted ends on the c, e, s. (Maybe make them parallel?)   \n- The k (Star of the set)   \n   \nStuff to notice:   \n- I think the tail on the a works ok. Maybe it should be a bit   \nbigger. It extends ok to the b and d, but it feels out of   \nplace up top on the p and q, and a little less weird on n   \nand m. Hmm... what am I saying. Make the bigger every-   \nwhere. Helvetica needs all the help it can get.   \n- The arm of the a bulges near the end. I think the arm on   \nthat BCP needs to be slanted to the right a bit instead   \nof pointing straight up.   \n- The y really does look like it got stepped on. It looks ok   \nin the text sample though, but I suspect it's because it   \nsits next to the g.   \n- Speaking of the g, neither version descends as far as the   \nrest of the descenders. Here's a chance to open things up   \na bit more if that's your wish.   \n- The outer curves of some characters, o, e, c, look a bit   \nsquare. This makes the strokes at 45 degrees seem too   \nthick. I like to call this the square marker effect since you   \nget this sort of stroke modulation from drawing with a fat   \nsquare sharpie)   \n- The v, w, and x look like they're falling to the left and   \nthey're a bit dark.   \n   \nI dig this design on the whole. I called my second list stuff   \nto notice because I have a natural inclination to turn any   \ndesign into its closest relative, in this case helvetica, so   \nignore any advice that might have this effect.   \n   \nThe beziers on the s look right on. The lower curve at the   \nleft end of the spine is a bit too square compared to the   \nits sibling.\n\n"
    },
    {
      "time": "13 May 2003 — 8:38am",
      "content": "Thanks again for the input. I dropped all the glyphs into fontographer to set some text. I hit auto space and auto bitmaps so it kinda stinks. Anyone have advise for strategies on this (perhaps a new thread). Particularly in getting decent bitmaps so you can make intelligent design decisions. I haven't the first clue about hinting.   \n   \nI've made some changes based on your feedback:   \n   \n- Adjusted the tails. They are truely spurs now, but not high heels ( a turnoff in Franklin Gothic)   \n- Adjusted the bulging \"a\"   \n- Lightened and hopefully corrected the v, w, x   \n- Narrowed the \"y.\" I wanted to avoid the standard tail, but hopefully it doesn't look to stomped anymore.   \n- Re-drew the binocular g. The curves are much better now, but the bottom is light - grrrr.   \n   \nI haven't got a laser printer at the home office yet. Does it look ok printed? The 6 pt type was a little hopeful probably.   \n   \nThoughts?   \nRandy\n\n<!--attachment: kortes_gothic-10721.pdf*mime_pdf.gif*application/pdf*31.0*kortes_gothic*kortes_gothic%2epdf --><!--attachment: kortes_gothic-10721.pdf*mime_pdf.gif*application/pdf*31.0*kortes_gothic*kortes_gothic%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150414174311im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">kortes_gothic<br><a href=\"http://web.archive.org/web/20150414174311/http:/www.typophile.com/forums/messages/29/kortes_gothic-10721.pdf\" target=\"_blank\"><b>kortes_gothic.pdf</b></a> (31.0 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "13 May 2003 — 10:52am",
      "content": "Randy,   \n   \nAbout the \"a\", look to the picture below.   \n   \n ![sketch](http://web.archive.org/web/20150414174311im_/http:/www.typophile.com/forums/messages/29/10734.gif)   \n   \nAnd about the BCPs, it's hard to give you some advice this   \nway (at distance). For me, dealing with BCPs is mostly   \nempirical, you must try changing them over and over until   \nyou get satisfied.   \nAnyway, try removing (merge in fog) the blue points. You   \nwon't need them, imho. And then, try changing the red   \npoints as I sketched above.   \n   \nGood luck\n\n"
    },
    {
      "time": "13 May 2003 — 12:38pm",
      "content": "Spacing, weight and size (and Cartesian proportions, and...) all interlock.   \n   \nYour weight is dark, and your (overall) spacing matches it well. But -for text- such a dark weight works best at smaller sizes, for which you'd need looser spacing (and a larger x-height). Is that more cofusing? :-/   \n   \n\\> empirical   \n   \nYou mean deterministic. :-)   \n   \nhhp\n\n"
    },
    {
      "time": "13 May 2003 — 1:20pm",
      "content": "\\>You mean deterministic. :-)   \n   \nMaybe, but what would that mean more specifically?   \nI meant \"empirical\" like, you must experience doing the   \nthing to understand it. Is that it? ;-)\n\n"
    },
    {
      "time": "13 May 2003 — 1:25pm",
      "content": "Well, I think \"empirical\" means based on something measurable to some quantity, while \"deterministic\" means... it's simply adequate (in context)? Hey, now you've confused me! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "14 May 2003 — 12:05pm",
      "content": "Hrant: Yes, the weight is definatly dark for text. This is probably a medium weight or a demi-bold.   \n   \nEduardo: thank you for taking the time to mark up the BCP's I will certainly take a look and get empirical or determanistic or materialistic or philanthropic or psychoanalytic on them untill they seem right :-) I'll also take another look at that \"a\" It's looks terrible with that big red pimple hanging off the end :-) Yikes!   \n   \nRegards,   \nRandy\n\n"
    },
    {
      "time": "14 May 2003 — 12:37pm",
      "content": "_\\>It's looks terrible with that big red pimple   \n\\>hanging off the end :-) Yikes!_      \n   \nYou're right. It is awful that way... Yikes! :-\\>   \nAnyway, I just didn't know the name of that part   \nof \"a\". I did a little research, and it seems to   \nbe named a \"terminal\".\n\n"
    },
    {
      "time": "15 May 2003 — 12:24pm",
      "content": "Hmm... good question, Joseph (maybe I should think a little more before   \ntyping silly statements :-/ ).   \n   \nAt this moment, I can remember of Jonathan Hoefler's Knockout family.   \nIt's a good grotesque and it seems to be really usable, even for longer   \ntext settings. Bureau Grostesque is nice too, but I'd prefer Knockout.   \nAnyway, I still prefer humanist sans over grotesques... :-)\n\n"
    },
    {
      "time": "16 May 2003 — 2:42pm",
      "content": "I would say that both Knockout and Bureau Grotesque fall into the category that Hrant called _cloyingly grot_. While I like those faces and also their economic widths, they have a woodtype quality to them. Like old newspaper headline type (there is a name for it and I'm not coming up with it, sorry). Would Josef M\n\n"
    },
    {
      "time": "15 May 2003 — 11:53am",
      "content": "Eduardo, can you point us to what you would call a   \n'new' grotesk?   \n   \n(Sorry Randy for taking this somewhat off-topic.)\n\n"
    },
    {
      "time": "16 May 2003 — 11:54am",
      "content": "Ah. Ok, I was just thinking / hoping that a new   \nclassification was developing. Didn't mean to put   \nyou on the spot.\n\n"
    },
    {
      "time": "19 May 2003 — 11:29am",
      "content": "I personally will hope your R is closer to Helvetica's and   \nnot Frutiger's. To me, the slight curl on the R is Helvetica's   \nanomaly that makes it interesting (but it sticks out in   \nHelvetica). It's coming through in your i and l, so I'm   \nhoping to see that more.\n\n"
    },
    {
      "time": "26 Mar 2009 — 10:40pm",
      "content": "It's always interesting to delve into these old projects, particularly so when I'm cooking something of the same genre.\n\ntracking\n\nFor some reason that gray of the \"g\" seems to throb on my screen.\n\n"
    },
    {
      "time": "27 Mar 2009 — 6:00am",
      "content": "Why do people critique the genre in this forum?  \nDid you click on the wrong link? ;-)\n\nI've really struggled to make my own 'grot', well done on getting this far! Has it come on since 2003?\n\n"
    }
  ]
}
