{
  "id": "11011",
  "title": "Worth Continuing?",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Just got underway on this new serif and am wondering what you think of it so far. The part I both like and dislike is the contrasting curved and straight stems. Sometimes when I look at it I feel like it's been through the wavy filter in photoshop, other times it seems fresh. Does this show promise? If so, I'm bound and determined to get through UC, LC and Numerals without stalling out!   \n   \nThanks   \nRandy ![Toad Fonts](http://web.archive.org/web/20150417093310im_/http:/www.typophile.com/forums/messages/29/8934.gif)\n\n",
  "author": "aquatoad",
  "time": "18 Apr 2003 — 2:25pm",
  "uid": "618",
  "comments": [
    {
      "time": "18 Apr 2003 — 2:31pm",
      "content": "Randy. Can you set some of this smaller? I'd be interested to see how the little details react under that.   \n   \n ![:-)](http://web.archive.org/web/20150417093310im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "18 Apr 2003 — 3:09pm",
      "content": "Right, here is a smaller setting. Had to do a few more characters too. Much smaller than this, and the gif will kill any of the details anyways. Setting in illustrator, sorry about the spacing.   \n   \nRegards,   \nRandy ![Toad Fonts 2](http://web.archive.org/web/20150417093310im_/http:/www.typophile.com/forums/messages/29/8940.gif)\n\n"
    },
    {
      "time": "22 Apr 2003 — 12:54pm",
      "content": "Taking the subtle approach here -Randy   \n ![feedback](http://web.archive.org/web/20150417093310im_/http:/www.typophile.com/forums/messages/29/9094.gif)\n\n"
    },
    {
      "time": "22 Apr 2003 — 1:56pm",
      "content": "Ha, I like your \"subtle approach\", randy. ;-)   \n   \n   \n_\\>The part I both like and dislike is the contrasting   \n\\>curved and straight stems. Sometimes when I look   \n\\>at it I feel like it's been through the wavy filter in   \n\\>photoshop, other times it seems fresh._      \n   \nI feel the same way. So, imho, I think you can give up   \nthe curve strokes. It seems to be disturbing, more   \nthan improving it.   \n   \nBtw, the \"f\" is nice. But the bowls in \"a\", \"b\" and \"d\"   \nlooks a little strange. You'll probably be able to polish   \nthese characters later on Fog or FL.   \n   \nAnd I think \"n\" and \"m\" should have similar serifs.   \nThe \"n\", without the inner footserif on the left vertical   \nstroke, seems disturbing to me.\n\n"
    },
    {
      "time": "22 Apr 2003 — 2:51pm",
      "content": "There could be something to a \"relaxed\" hand-written typeface, but I'm not sure you've \"relaxed\" in the right spots. For instance, your \"y\" I like, the middle stroke on your \"m\" just looks like a mistake. Although, all-in-all a lot of it disappears when it becomes smaller. Your serifs also seem a bit large.\n\n"
    },
    {
      "time": "22 Apr 2003 — 4:39pm",
      "content": "He he, a little bait is all it takes.   \n   \nHere's some background. I wanted somthing with fat serifs. In fact, I wanted the serifs to be so fat that they were equal to the thin weight of modulation. That would pretty much make it a slab serif right? But with rounded slabs. The first character was the h. That's where curve/staight came in and I kinda liked it.   \n   \nEduardo:   \nI'm not totally ready to give up on the curves yet. But it is proving odd to solve characters with bowls as you pointed out. a, b, d. What do you think of the e? Is the weirdness coming from an inconsistent angle of modulation or from the nature of curvy and straight in one character. BTW, I like the f also, particularly the crossbar. Side question: how would i be able to polish the curves in Fontographer better than I could in Illustrator (I have Fontographer, but have never really used it).   \n   \nTiffany:   \nMy wife also thinks I haven't \"relaxed in the right spots.\" Too much around the middle apparently. Seperate issue, sorry. I believeour own Aaron Sittig put it right on his March type review:   \n   \n _I couldn't figure out why text set in Sonoma   \nlooked so much better at size 9. Now I realize   \nthat size 9 will hide a whole host of problems   \nin any font._      \n   \nDo the serifs seem large in thickness, ie too slabby, or too long? I've steadily shortened them as i've done more and more settings because of spacing issues.   \n   \nThanks for the thoughts. Any preference on g's?   \nMore please.   \n   \nRandy\n\n"
    },
    {
      "time": "22 Apr 2003 — 5:54pm",
      "content": "\\> size 9 will hide a whole host of problems in any font.   \n   \nBut also reveal new ones that don't show up in display sizes...   \n   \nhhp\n\n"
    },
    {
      "time": "23 Apr 2003 — 7:14am",
      "content": "Well, I'm not used to work in Illustrator, but I'm guessing it doesn't have   \nthe BCP control ability that Fog has. And, I think the \"weirdness\" in your   \nbowls can be easily solved by optimizing your BCPs in Fog. Try using the   \nElement\\>Info command (Ctrl+I for Windows).   \n   \nIn \"a\", your bowl is too \"square\". The \"e\", I think it is a little wide.   \nThe fat serifs, I think are nice.\n\n"
    }
  ]
}
