{
  "id": "11026",
  "title": "Bleed Black",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This is my first go at type design, I tried to create a classic looking typeface combined with spikes from punk rock culture.\n\n",
  "author": "banky",
  "time": "20 Apr 2003 — 6:26pm",
  "uid": "1402",
  "comments": [
    {
      "time": "21 Apr 2003 — 10:25am",
      "content": "Mitchell --   \n   \nLooks like a good start. In what sort of project were you thinking of using the font?\n\n"
    },
    {
      "time": "21 Apr 2003 — 5:00pm",
      "content": "The Font could be used by bands on the record and or merch. It could be used for stores catering to punk rock, as well as clubs. That was the target audience I had in mind.\n\n"
    },
    {
      "time": "23 Apr 2003 — 12:20pm",
      "content": "I need to ask for everyones help. I am thinking of coming up with a different name. I would like it to start with X if possible as that is my favorite character in my design. I would also like it to stay with the punk theme if possible or anything clever. Xploited maybe, just straight up X?\n\n"
    },
    {
      "time": "23 Apr 2003 — 11:25pm",
      "content": "I made some revisions to the \"s\" and \"j\" let me know what you think about it.   \n   \n ![](http://web.archive.org/web/20131018041238im_/http:/www.typophile.com/forums/messages/29/9177.jpg)\n\n"
    },
    {
      "time": "24 Apr 2003 — 9:19pm",
      "content": "I think the spikes need to be slightly bigger, because they may get lost when printed in relatively small sizes or viewed form far, aslo i would revise the M, it\n\n"
    },
    {
      "time": "25 Apr 2003 — 12:17pm",
      "content": "Name it Xodoma.\n\n"
    },
    {
      "time": "3 Jan 2004 — 2:04pm",
      "content": "Another nice victorian type face.   \n   \nHow about a lower case to match the capitals as wells as a condensed version, all with alternates?   \n   \n Yours truly,   \n Robert\n\n"
    },
    {
      "time": "20 Apr 2003 — 7:11pm",
      "content": "Image cropped and reuploaded:   \n ![black](http://web.archive.org/web/20131018041238im_/http:/www.typophile.com/forums/messages/29/9017.gif)\n\n"
    }
  ]
}
