{
  "id": "11025",
  "title": "Gematria",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": " **Background**  \n  \nGematria is something of a mix between a grotesque and a humanist sans.   \nI wanted a sans serif less funky than Helvetica, but with more character   \nthan the recent super generic sans like Myriad. It's also a reaction   \nagainst the trend towards increasing x-height and counter-sizes. The   \nascenders and descenders are large and in charge, close to the elegant   \nproportions of Futura. The counters are dimished, recalling the time   \nbefore readability trumped character. The intersections of lines are   \nheavy, trapping be damned, increasing contrast not only between but   \nwithin glyphs.   \n  \n**Status**  \n  \nI've just wrapped up the basic upper case. I'm mostly satisfied with the   \nstructure of all the characters. Work still remains to weight some   \ncharacters properly (see: g, all the triangular upper case). Spacing is   \nmessy. Right now it's probably too closely set, but this is my fifth   \ncomplete iteration on the lower case metrics. I'm having a tough time   \nfinding the right looseness to make it easy to pick out words quickly (I   \nhaven't lost all sight of readability) while maintaining a pleasant page   \ntexture. I'm also unsure of the right balance between spacing wide for   \ncaption sizes and narrow for display sizes. Opentype to the rescue?   \n  \n**Specific Concerns**  \n  \nHow can I make the g fit in more? It feels out of sorts. If I make the   \nstrokes thicker, it fits in a bit better but feels very clotted.   \n  \nI was much more confident in the f when I first started this design.   \nShould I ditch it?   \n  \nIs there a standard solution to the too many vertical strokes problem in   \nwords like 'million'? The sequence illi feels very dark compared to the   \nrest of the page.   \n  \nWhat do ya'll think of the y? The triangular characters have always   \nbugged me and y seems like a triangular shape that doesn't have to be   \nso.   \n  \n**Phantom Modulation** - [see thread](http://web.archive.org/web/20150414170230/http:/www.typophile.com/cgibin/show.pl?4100/8716)  \n  \nI ended up compensating for this effect and the results are much more   \npleasing. I'd been building the less geometrical characters (a, h, n, m,   \ns, t, r, u, y) with the compensation automatically since I had to   \neyeball the strokes to make sure they felt balanced. When I compensated   \nin the more symmetrical structured characters, they felt more in tune   \nwith the rest of the set.   \n  \nI found it better in my case to leave the counters of characters (b, c,   \nd, e, g, o, p, q) perfectly symmetrical with no slant and to instead   \ncompensate for the phantom modulation with their outer path. This helped   \nme avoid too much humanist feel from creeping into the design and made   \nthe characters feel like they stand mostly upright.   \n  \n [Download the PDF](http://web.archive.org/web/20150414170230/http:/www.xtypa.com/ext/typophile/gematriafirstsample.pdf)\n\n",
  "author": "Aaron Sittig",
  "time": "20 Apr 2003 — 5:55pm",
  "uid": "1290",
  "comments": [
    {
      "time": "20 Apr 2003 — 7:21pm",
      "content": "There are some nice things happening in this design.   \n   \nI don't have a problem with the g, but I'd be a little concerned about the space between the bowls closing up at small sizes.   \n   \nAt first the f struck me as too unusual for an otherwise conservative face, but I don't find that it draws too much attention to itself in text. Try living with it a bit longer, but give some thought to an alternative, less radical form.   \n   \nI don't mind the top part of the y, and think it is a good idea to try something other than the diagonal version. However, the bottom part looks truncated and also adds to the impression that the top part is too wide (it may, in fact, be a tad too wide compared to the h, n, etc.). Is there a way to extend the descending curve to the left, without getting into the kind of closed-up shaped of the Helvetica g?   \n   \nRegarding the sequence of i and l, you could try having very slightly wider sidebearings on the i. You can also try making the ascending stems slightly lighter than those that terminate at the x-height; because of their length, they will tend to look denser than the shorter strokes. I have not printed your PDF, so I am taking your word for it that the sequence _illi_ looks dark.\n\n"
    },
    {
      "time": "21 Apr 2003 — 8:49am",
      "content": "\\> large and in charge   \n   \nThat sounds nice.   \n   \n\\> recalling the time before readability trumped character.   \n   \nLegibility. Readability actually benefits from a smaller [than average] x-height.   \n   \n\\> The intersections of lines are heavy, trapping be damned   \n   \nActually, that's \"optical compensation\" (in my book) - trapping is [mostly] to fight gain. But anyway, this is an approach that might have hidden functionality (as well as easthetic appeal to some), since information comes from contrast.   \n   \n\\> I'm also unsure of the right balance between spacing wide for caption sizes and narrow for display sizes.   \n   \nThat's related to the _intent_ of the face, which ties in to things like color, width, x-height etc. In this case I would say this is a texty font - and the spacing is _slightly_ too loose ovreall (and inconsistent in places, like the right of the \"r\", and elsewhere).   \n   \nBTW, your vertical proportions are right on.   \n   \nAnd the caps are solid - congrats.   \n   \n\\> the g   \n   \nIt's out of place because it's too humanist. Give it some edge - and maybe an open bottom bowl.   \n   \nThe \"f\" is fine! I think the \"j\" could be more humanist. I like the \"y\" too.   \n   \nOverall, I think you're meeting your objective, and producing an interesting voice: at once retro and futuristic, plus a nice balance between rationality and charm.   \n   \nhhp\n\n"
    }
  ]
}
