{
  "id": "11020",
  "title": "Asymmetric alignment",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Sorry to ask a dumb question but id like to do asymmetric columns of type like this example, for a double page magazine spread. What is the easiest way to do this? I'm working in Quark. Should I draw the text tables in unusual shapes? How do u get that kind of layout?\n\n<!--attachment: alignment-8973.unk*attachment_icon.gif*application/octet-stream*122.8*asymmetric+alignment*alignment%2etif --><!--attachment: alignment-8973.unk*attachment_icon.gif*application/octet-stream*122.8*asymmetric+alignment*alignment%2etif -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131018021635im_/http:/www.typophile.com/forums/icons/attachment_icon.gif\" align=\"left\" alt=\"application/octet-stream\">asymmetric alignment<br><a href=\"http://web.archive.org/web/20131018021635/http:/www.typophile.com/forums/messages/4100/alignment-8973.unk\" target=\"_blank\"><b>alignment.tif</b></a> (122.8 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "newbie_chez",
  "time": "19 Apr 2003 — 5:39pm",
  "uid": "1477",
  "comments": [
    {
      "time": "19 Apr 2003 — 5:43pm",
      "content": "sorry here it is   \n   \n ![oops](http://web.archive.org/web/20131018021635im_/http:/www.typophile.com/forums/messages/4100/8976.jpg)\n\n"
    },
    {
      "time": "21 Apr 2003 — 9:05am",
      "content": "Close your eyes and have fun. Set some random tabs,   \nmess with leading, rotate a text box or two a few   \ndegrees and stay away from the fold. Sandpaper   \ncould be good too. Oh, and don't forget to not clean   \nyour scanner.   \n   \nThis job could be done with just 5 text boxes.   \n   \nIs this for a particular magazine?   \n   \n-sean michael\n\n"
    },
    {
      "time": "21 Apr 2003 — 8:02pm",
      "content": "Just say no, Cheryl. Just say no.\n\n"
    },
    {
      "time": "22 Apr 2003 — 4:39am",
      "content": "Marc, do you think this kind of layout looks bad?   \n  \nI am not trying to copy someone's work, it just inspired me to try something very different to what I would usually do (that is, very neat and minimal).   \n  \nSean, I have a project at uni for double page spreads, this is the 1st time I'm using grids (eek!). I chose to redesign an article from Glamour mag about breaking up a friendship, but we don't have to adhere to the style of Glamour at all. That's why I considered doing something like the above example because I want it to have edge and attitude. It's advice about how to dump a bad friend!   \n  \nThanks for replying I was about to ask if anyone was there!\n\n"
    },
    {
      "time": "22 Apr 2003 — 8:24am",
      "content": "Marc,   \n  \nWhat do you mean _Just say no_? Do you   \nhate this?   \n  \nCheryl,   \n  \nI would advise that if this your first time using   \ngrids to choose a different style to emulate -   \nlike one that actually uses grids. Try, even if   \nyou think it is boring, a more traditional, structured   \nand formal layout. The pay back will be ten fold for   \nbuilding upon a foundation of solid structure. After   \nyou have studied strict layout you will find that you   \nwill be able to create an ad like the one above with   \nmore understanding of what it is you are doing.   \nPerhaps you can even insert visual jokes at that point.   \n  \nI am sure you have heard it before, but the rules have   \nto learned before they can be broken. (This is a   \ngeneralization really. Instinct is also very important.)   \n  \nBut again, challenge yourself a bit more and   \nperhaps even try a design style that you hate.   \nI think what you learn will be worth your suffering.   \n  \nThis link would be worth checking out.   \nhttp://www.imon.org/mueller-brockmann/   \n  \n-sean michael   \n  \nOh yea, whatever you choose to do, just use square   \ntextboxes. Funky shaped ones will just be a whole   \nbunch of trouble with no real reason for having them.\n\n"
    },
    {
      "time": "22 Apr 2003 — 9:12am",
      "content": "Oops. I just reread that you usually do _neat and minimal_  \nwork. Well, you should find that link all the more interesting.   \nGood luck.   \n   \n-smc\n\n"
    },
    {
      "time": "22 Apr 2003 — 1:52pm",
      "content": "Cheryl, I'm a magazine junkie (and design   \nthem for a living), so I saw way too much of   \nthis stuff back in the heyday of David Carson   \nand Raygun.   \n   \nNot that I have anything against asymmetry   \nper se. In fact, a \"neat and minimal\" spin on   \nthis style could be pretty interesting.   \n   \nOddly shaped text boxes are handy if you have   \na specific shape in mind for a block of text.   \nThat way you can change the size/leading of   \nthe text without having to re-break lines or set   \nnew tabs.\n\n"
    },
    {
      "time": "22 Apr 2003 — 2:08pm",
      "content": "_Oddly shaped text boxes are handy if you have   \na specific shape in mind for a block of text.   \nThat way you can change the size/leading of   \nthe text without having to re-break lines or set   \nnew tabs._      \n   \nor, you could place an empty \"oddly shaped\"   \nbox over your square text box that has a run   \naround applied to it. Just a diffrent way of   \nworking - same effect. I like to keep my text   \nboxes square. It seems cleaner to me. Maybe   \nnot however.   \n   \nI used to magazines myself. I kind of miss it   \nexcept for the ads. I hate the ads.\n\n"
    },
    {
      "time": "22 Apr 2003 — 2:32pm",
      "content": "Actually, most people around here would use   \nInDesign. Don't let them know we are talking   \nabout Quark. Shhhhh...   \n  \n-smc\n\n"
    },
    {
      "time": "22 Apr 2003 — 3:04pm",
      "content": "I am going to try a more formal grid first before I try things as crazy as that. I did try to use a 3 column grid for a double page spread, but my tutors said it was too \"neat\" for the subject and it should look more emotional..I'm working on it!   \n   \nI see that most of the people on this forum have years more experience than me, that is why I am finding your advice invaluable.   \n   \nThe link was very useful and similar to the work I have been doing this year.   \n   \nSean, since you are good at mags, maybe you could help me with Quark. I am designing 2 double page spreads where each page measures just under A3 size. But my printer only prints A4.. Do you know a way I can print two halves of my spread so that I can stick them together?\n\n"
    },
    {
      "time": "22 Apr 2003 — 3:06pm",
      "content": "Why InDesign over Quark? Just wondering.\n\n"
    },
    {
      "time": "22 Apr 2003 — 3:13pm",
      "content": "_Sean, since you are good at mags..._  \n  \nWho said I was good? I mean...   \n[**with a raised eyebrow**]   \nyou must have spotted some of my work, of course.   \n  \nI have no idea how print from your printer Cheryl.   \nUse an X-acto and spray mount. Good luck.   \n   \n\\<i\\> Why InDesign? \\</i\\>   \nIt's all about the type.   \n  \n-smc\n\n"
    },
    {
      "time": "22 Apr 2003 — 3:23pm",
      "content": "Oh, the perils of being on Easter vacation. No tutors to harrass. ^\\_^   \n   \nThanks.\n\n"
    },
    {
      "time": "22 Apr 2003 — 5:22pm",
      "content": "Cheryl, is that example one of David Carson's? As a student at art school (very recently!), I was quite excited and inspired by the work of David Carson. He managed to make typographic layouts into beautiful paintings. My views about typographic design might have changed since then, but I still appreciate his work from that period very much; it was a refreshing experiment that broke away from the minimal and grided layouts. He once said \"don't mistake legibility for communication\". But I think legibility is a requirement for the basic function of typography: type is a carrier of textual information. Type ceases to be type as soon as that linguistic function is lost. David Carson's deconstructive typography was painting. It communicates at a different level from what we think of as traditional typography.   \n  \nNow, do layouts have to be 'deconstructive' in order to be 'emotional'? Not at all, I think. Emotion could be communicated in many different ways, through the use of space, sizes, colours, typefaces, weights.   \n  \nIt's interesting to see that deconstructive type is not actually that easy to make on the computer! Modern computer software were made to be grid-friendly! And we are conditioned to design accordingly. It's interesting...   \n  \nSimply set to print with tiling in Quark on your A4 printer.\n\n"
    },
    {
      "time": "22 Apr 2003 — 5:53pm",
      "content": "\\>\\> \"don't mistake legibility for communication\"   \n   \nAnd don't mistake hooligan artistry for it either...   \n   \nhhp\n\n"
    },
    {
      "time": "22 Apr 2003 — 6:03pm",
      "content": "Well put, Keith. I hope she checks back.   \n   \n-smc\n\n"
    },
    {
      "time": "23 Apr 2003 — 7:30am",
      "content": "Hi all,   \nI agree, very well put, Keith! :o)   \nThe example was from an online magazine called BEAST. [http://www.ths.nu/beast](http://web.archive.org/web/20131018021635/http:/www.ths.nu/beast)  \nI found it inspiring even though some of it looks quite crude at times..the content is random and bizarre, but interesting nonetheless. Tell us what you think of the site. Although it seems this kind of typography; a la David Carson etc, is dead in some of your eyes? \\*cries\\* ! 'Cause some of my friends are still trying this stuff out.   \n   \nWhere do you think magazine design is heading in terms of style, grids n all? Does anyone know any good examples online of grids and/or double page spreads?   \n   \nKeith, the tiling worked! Cheeeers! And yes it is rather hard to create \"deconstructive\" type on computer.\n\n"
    }
  ]
}
