{
  "id": "11033",
  "title": "What about ink or light traps??",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I was looking nearly to ORIGEN (cristian gonzalez beta in critique forum)and notticed some ink traps, a couple of hours later i notticed them in a magazine logo (\n\n",
  "author": "rs_donsata",
  "time": "21 Apr 2003 — 3:13pm",
  "uid": "1530",
  "comments": [
    {
      "time": "21 Apr 2003 — 3:14pm",
      "content": "![](http://web.archive.org/web/20131017234813im_/http:/www.typophile.com/forums/messages/4100/9061.gif)\n\n"
    },
    {
      "time": "21 Apr 2003 — 3:35pm",
      "content": "Traps aren't just for photosetting. They were used a _lot_ in the metal days (even stuff done by pantograph), and they're done today by the best digital designers. Some people will tell you traps are unnecessary, but that's really only true if you're just after \"efficiency\", with less regards for quality - that mentality can also be applied to smallcaps, since almost nobody actually uses them! In actuality traps help whenever you set small type and/or use \"lo-fidelity\" printing like in a newspaper - and not just by fighting gain, but also by counteracting optical effects.   \n   \nYou don't want trapping to show in large sizes (unless you like that effect - for example Christian Schwartz has been doing that a lot - to good effect), but since digital type favors single masters (no distinction between different sizes), it becomes a trickier decision...   \n   \nHere's something you might want to check out:   \n [http://www.themicrofoundry.com/ss\\_trapping1.html](http://web.archive.org/web/20131017234813/http:/www.themicrofoundry.com/ss_trapping1.html)   \n   \nAlso, soon you will be able to put trapping into your fonts with the click of a button (if you have FontLab), for free.   \n   \nhhp\n\n"
    },
    {
      "time": "21 Apr 2003 — 3:38pm",
      "content": "Hrant   \n   \nWould not the first kind of trapping shown here be more commonplace with photofilm and the second, with letterpress?\n\n"
    },
    {
      "time": "21 Apr 2003 — 3:52pm",
      "content": "Well, in terms of \"amplitude\" photo traps are generally bigger, yes\\* - but I haven't yet developed an appreciation for any _structural_ differences they might have.   \n   \n\\* In fact photo had so much gain that they would also often put \"thorns\" at corners, to prevent rounding-off.   \n   \nThe traps in the first sample are pretty classic.   \nBut that \"4\" is strange. Besides being very small, those traps are asymmetrical - maybe it was an aesthetic decision in case of use at large sizes?   \n   \nhhp\n\n"
    },
    {
      "time": "21 Apr 2003 — 4:27pm",
      "content": "\"photo had so much gain\"   \n   \nWas this prepress gain caused by refraction of light? I'd read this somewhere.   \n   \nOr are you thinking of gain of ink on newsprint stock when printed offset? Or is it just accumulated ink gain on smaller text sizes?   \n   \nThose little nicks on the 4 look like the nicks occasionally encountered on foundry type. How would these work in photofilm technology?   \n   \nI don't quite have my little duckies in a row yet in regard to the variances of trapping!!!\n\n"
    },
    {
      "time": "21 Apr 2003 — 4:32pm",
      "content": "One more question. On Carter's Centennial(sp?) Bell I note that the very bold version reads as almost \"normal\" when printed digitally at its correct (very small) size. In this case, the trapping would be for visual correction rather than gain, right?\n\n"
    },
    {
      "time": "21 Apr 2003 — 5:22pm",
      "content": "I think the severe gain in photo was simply a result of imprecise focus, but I could be wrong.   \n   \nBut gain really happens any time ink hits trees.   \n   \nOnly the best printing from offset can avoid \"mechanical\" gain - but even then letterforms are subject to optical effects (that trapping can help alleviate).   \n   \nMy feeling is that the depth of a trap depends on many factors, but the shape of a trap in any technology is optimally the inverse of a circle - although aesthetics (in case it's printed large) makes itself felt too.   \n   \nCentennials Bold would have to be printed \\*very\\* small for those monster traps to be purely optical - my feeling is they're mostly to fight mechanical gain- remember that it was designed for printing on crappy phone-book paper.   \n   \nhhp\n\n"
    },
    {
      "time": "21 Apr 2003 — 5:40pm",
      "content": "Hrant, I found very interesting your web place, specially the research and the non latin sections.   \n   \nI see that you have achieved an easy and standarized method for trapping corners using the trapping flower. If it\n\n"
    },
    {
      "time": "21 Apr 2003 — 6:57pm",
      "content": "Glad you like my site - it looks clean but there are a lot of cobwebs backstage...   \n   \nThe parameters of the Flower depend on many things, including personal taste and technical issues (like how bad the paper is). The Aperture ring and the Multiplier depend on how big you want the traps. The Minimum ring (or actually its relation to the Aperture ring) is determined by: how \"trap-heavy\" you want your font to be; and how much work you want to do!   \n   \nDetermining the parameters is really trial and error, but the method provides for a lot of flexibility (incliding some things that I haven't shown on that page), and with the right settings can reproduce even the trapping on Bell Centennial to within ~90%, with no imprecise and slow \"creative\" decisions necessary - trapping is one of the few things in type design that can be automated like this, so why not take advantage!   \n   \nhhp\n\n"
    },
    {
      "time": "21 Apr 2003 — 7:48pm",
      "content": "Sounds good, once the flower is calibrated, you get precise regularity on the trapping.   \n   \nI guess you have to find the way to make some printing tests and corrections before releasing the work.\n\n"
    }
  ]
}
