{
  "id": "11047",
  "title": "Betatype No. 28",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "I don't know how to classify this one. I was experimenting with half-serifs and a stiff stress, but mostly I wasn't writing my English 311 paper. Let me know what you think. The ear on the **g** is getting in the way, and some of the horizonals need a little more ink (the **t** and the **f** ).\n\n",
  "author": "Christian Robertson",
  "time": "22 Apr 2003 — 10:24pm",
  "uid": "1",
  "comments": [
    {
      "time": "22 Apr 2003 — 10:45pm",
      "content": "![Betatype 28](http://web.archive.org/web/20150417092612im_/http:/www.typophile.com/forums/messages/29/9114.gif)\n\n"
    },
    {
      "time": "22 Apr 2003 — 10:56pm",
      "content": "And, finally, the pdf.\n\n<!--attachment: 28_sample-9118.pdf*mime_pdf.gif*application/pdf*21.2 **28_sample%2epdf --><!--attachment: 28_sample-9118.pdf*mime_pdf.gif*application/pdf*21.2** 28_sample%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150417092612im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20150417092612/http:/www.typophile.com/forums/messages/29/28_sample-9118.pdf\" target=\"_blank\"><b>28_sample.pdf</b></a> (21.2 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "22 Apr 2003 — 11:31pm",
      "content": "This is great. We need semi-serifs, and this is a nice toothy one! I think you're making the \"fauve\" look really work, and some of the stuff (like the \"t\") is very interesting - but I'd have to think about those a bit more.   \n   \nFor starters, I would recommend making the ascenders slightly taller. And your inclination angle is 4 degrees (right)? I would go for a nice integer slope, maybe 1/15 (=~3.81 degrees), so you can manually control your slopes during font editing pretty easily.   \n   \nBTW, could we see a character set?   \n   \nhhp\n\n"
    },
    {
      "time": "23 Apr 2003 — 6:37am",
      "content": "For starters, it is strictly illegal for you to work on anything other than Pill Gothic until it is brought to the rabid masses :-) Seriously.   \n   \nI also like what you have working here. Did you use the wireframe + brush + cleanup technique on this one? My guess is no, but just curious. Also, the slope is intended to compensate for backslanting in a semi serif right? While it's balancing nicely now, did you try it a bit less, perhaps half of current? The reason is I'm wondering if people will pass over your design because \"there's only italics.\" _On a side note: Hrant, please explain in more detail the benefit of having the slope as an integer for \"font editing.\"_    \n   \nI think some of your spacing issues are coming from the length of your serifs on many of the characters in addition to the ear on the g. I'm looking specifically at the top of the i, p, n, r, v. Compare the top serif of the n with the top of the m. I might even reduce all the x-height, left-pointing serifs to (or slightly less than) the current m. This might allow it to be balanced with less sloping.   \n   \nToothy is good. Lots of sparkle coming off this one. Keep at it, your stuff is very nice.   \n   \nRegards,   \nRandy\n\n"
    },
    {
      "time": "23 Apr 2003 — 9:19am",
      "content": "\\> please explain in more detail the benefit of having the slope as an integer   \n   \nWell, you should use a measurement that's most convenient to work with. Degrees are really an arbitrary unit in digital type design - slopes on the other hand have an inherent usefulness.   \n   \nFor example, let's say that -because of the admittedly established practice of using degrees- you want an angle of about 12 degrees. Doing a Tangent on that and then inverting it, you get ~4.7, so you would choose 5 (which comes back to ~11.3 degrees). Now that you have a slope of 1/5, you know that for every +5/-5 units you move vertically, you need to move +1/-1 unit horizontally. It's not only easier to work with, it reduces rounding issues too.   \n   \nBTW, Randy has a point about the inclination angle (assuming there will be an italic down the line). If you reduce it\\* you will have room for more incline for your italics. Otherwise you can use the same angle for the italic, but you'll have to make it ridiculously cursive for it to stand out, and you'll still have problems - the main functional distinction of an italic (to a user, if not a chirographer) is its slant.   \n   \n\\* But not below 1 degree, or ~1/57 - or better 1/50, 1/55 or 1/60 for convenience. In practice it seems that any slope less than about 1/30 will start getting problematic at smaller sizes. I use 1/16 for Patria Italic (and Harrier) - I have a preference for powers of 2.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Apr 2003 — 10:42am",
      "content": "Here is another pdf. Randy, good call on the serifs. As for the slant, I'm still trying things. To be honest, I just obliqued the characters at two and four degrees. As for pill gothic. I'll get back on it. Up to this point I have mostly done type design as an escape. It's relaxing. So generally I have avoided most of the really tedious technical aspects of producing a professional font. I'm getting more excited about things like kearning pairs and stuff, but I don't know if I will ever really get into hinting. I'm just waiting for ultra high resolution displays.\n\n<!--attachment: 28_sample_2-9147.pdf*mime_pdf.gif*application/pdf*25.3*Betaype+No%2e+28+Sample+Two*28_sample_2%2epdf --><!--attachment: 28_sample_2-9147.pdf*mime_pdf.gif*application/pdf*25.3*Betaype+No%2e+28+Sample+Two*28_sample_2%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150417092612im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Betaype No. 28 Sample Two<br><a href=\"http://web.archive.org/web/20150417092612/http:/www.typophile.com/forums/messages/29/28_sample_2-9147.pdf\" target=\"_blank\"><b>28_sample_2.pdf</b></a> (25.3 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "23 Apr 2003 — 11:17am",
      "content": "Good stuff. Like the uppers so far. I also like the reduced slant, it's feeling much less \"italic.\" The spacing seems to be much better as well. The serifs could all possibly come in a bit more for tighter spacing needs.   \n   \nYeah I hear you on the technical side. Nothing says you have to do this yourself though. Have you sent Pill to any distributers? They would gladly do it for you, might take some percentage points off the royalty but after all, this is supposed to be an escape not a headache :-) In my amature opinion, you have incredible instincts for type design. Let someone with incredible instincts for delta hinting do that, and focus on the fun part.   \n   \nRandy\n\n"
    },
    {
      "time": "23 Apr 2003 — 1:42pm",
      "content": "Christian, you don't need a \"perfect\" font - it depends mostly on what your customers expect. Emigre fonts for example have minimal kerning pairs (I think Mrs Eaves has 40-something), but a lot of people have drooled over them. The more you can do the better, but don't get discouraged from publishing your work. Plus a lot of the automatic stuff does serve adequately - like the autohinting in FontLab. The only technical skill I can think of that truly requires a good handle is base spacing.   \n   \nLooking at the PDF:   \n1) I think \"a\" and \"g\" are slightly too large.   \n2) I think the new ear of the \"g\" is super.   \n3) I prefer the new non-descending \"f\".   \n4) Those double-dots on \"i\" and \"j\" are distracting.   \n5) I'm starting to think that the \"t\" needs a more \"normal\" tail - and more horizontal presence.   \n6) Try to give the tail of the \"y\" more presence.   \n7) Some of the color is off - like the \"o\" is much darker than the \"n\".   \n8) I think 2 degrees (or ~ 1/30 :-) is better than 4.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Aug 2003 — 5:08am",
      "content": "It is very comfortable to read. Call it \"type design as an escape\"!   \nI really think you could use even less inclination, like Hrant says.   \nI agree on the \"i\" and \"j\" dots as well: try to break them using some angularity.   \nSame goes for the \"y\": experiment with the tail or the whole letter.   \nI think the \"a\" needs just minor adjustment. It's very good.   \n   \nA separate note on spacing: I would not call spacing \"a tachnical skill\" as Hrant did. It's as much important as the design itself, maybe more. As long as you care about spacing good since the early stages of a design, you will very likely need minimal kerning. Of course it depends on the design, but I would not use automated tasks of the software.\n\n"
    },
    {
      "time": "8 Aug 2003 — 11:07am",
      "content": "How does spacing being a technical thing make it less important than the \"design\" (by which I assume you -confusedly- mean the letterform blacks)?   \n   \nhhp\n\n"
    },
    {
      "time": "10 Oct 2003 — 11:49pm",
      "content": "Here is some more. I added the other caps and some refinement on the lc. There are still some problems with the text color, though I still can't put my finger on it. The r might still be too wide, and I think I have the spacing too tight.\n\n<!--attachment: 28_sample_3-18352.pdf*mime_pdf.gif*application/pdf*26.8*More+Caps+and+some+refinement*28_sample_3%2epdf --><!--attachment: 28_sample_3-18352.pdf*mime_pdf.gif*application/pdf*26.8*More+Caps+and+some+refinement*28_sample_3%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150417092612im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">More Caps and some refinement<br><a href=\"http://web.archive.org/web/20150417092612/http:/www.typophile.com/forums/messages/29/28_sample_3-18352.pdf\" target=\"_blank\"><b>28_sample_3.pdf</b></a> (26.8 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "11 Oct 2003 — 6:46pm",
      "content": "5{ust read an article on Matthew Carter and his   \nMantinia typeface. He said that the white space   \nbetween the letterforms are just as integral as the black   \nareas of the glyph. The old idea of a bowl being a bowl   \nbecause of the space between it.\n\n"
    },
    {
      "time": "13 Oct 2003 — 4:47am",
      "content": "Christian: very impressive! I was initially confused by the lack of serifs on certain letters but there seems to be a real logic to it.   \n   \nOn a side note, the ghost of \"Pill Gothic\" seems to have become legend around these parts. But I have not seen it. Would you mind posting a PDF? Or if you would prefer not to post, perhaps email it to me?\n\n"
    },
    {
      "time": "16 Oct 2003 — 12:33pm",
      "content": "Yeah the s's are all messed up. I'm still trying to find an s that fits into the pseudo calligraphic framework. I spent some time with a broad tipped pen this morning and have some ideas...\n\n"
    },
    {
      "time": "10 Jan 2004 — 11:39pm",
      "content": "I've toned down the wacky character widths, and added some small caps. I agree that the spacing is nearly as important as the design of the glyphs. When I took my first font into fontographer, I was terribly depressed at the result. I had worked for hours, focusing on each letter, and the text setting looked like garbage. I didn't realize it at first, but the spacing was the real problem.   \n   \nThat being said, changing character widths and shapes in this font has made a world of difference in the text setting. The best example is the g. I still have spacing issues to resolve, though.\n\n<!--attachment: sample_28-23897.pdf*mime_pdf.gif*application/pdf*33.8*28+PDF*sample_28%2epdf --><!--attachment: sample_28-23897.pdf*mime_pdf.gif*application/pdf*33.8*28+PDF*sample_28%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150417092612im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">28 PDF<br><a href=\"http://web.archive.org/web/20150417092612/http:/www.typophile.com/forums/messages/29/sample_28-23897.pdf\" target=\"_blank\"><b>sample_28.pdf</b></a> (33.8 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "11 Jan 2004 — 8:49am",
      "content": "The texture is wonderful! And that count for a lot.   \nThe overall spacing could be just a hair tighter, but your blank space is too narrow.   \nAnd I think you have room for an italic, which I'd make lighter and softer, and inclined a fair amount.   \n   \nMicro stuff:   \n- \"c\" and \"y\" don't have enough \"abruptness\".   \n- I'd move the bar of the \"f\" to the right.   \n- \"t\" is too extreme.   \n- \"D\" is too narrow.   \n- Head of the \"P\" is too small.   \n   \nBut I don't get your semi-serif decisions in the UC.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jan 2004 — 4:43am",
      "content": "Hi Christian.   \n   \nMagically Delicious!   \n   \n_I still have spacing issues to resolve, though._   \nOne i notice is due to the structure of the t. Given your angle, you can afford a bit more length to the left than usual, but the crossbar is now über left. Otherwise I don't find the over all structure too extreme.   \n   \nAlso note the path gremlin in the upper case W.   \n   \nI like the UC. Fits like a champ. The new s is super BTW. One stylistic question I would explore were it my baby: what about beaks instead of teardrop terminals on the a, c, r (kinda like the s only heavier)? Might be more in keeping with the overall toothy quality. The others are ok now, just thought it might be worth exploring?   \n   \nCheers,   \nRandy   \n   \n(you are a busy man)\n\n"
    },
    {
      "time": "12 Jan 2004 — 5:18am",
      "content": "Just wonderful, one of the best to appear on Typophile. An original look yet suited to text. Congratualations!   \n   \nI agree about the need to adjust the crossbars of the t and f.\n\n"
    },
    {
      "time": "12 Jan 2004 — 9:35pm",
      "content": "I added some numerals and worked on the spacing. I tried   \nRandy's idea on the f, r and c terminals, and I think I like it.   \nLet me know what you all think.\n\n<!--attachment: 28a-23999.pdf*mime_pdf.gif*application/pdf*36.6*Numerals+and+Spacing*28a%2epdf --><!--attachment: 28a-23999.pdf*mime_pdf.gif*application/pdf*36.6*Numerals+and+Spacing*28a%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150417092612im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Numerals and Spacing<br><a href=\"http://web.archive.org/web/20150417092612/http:/www.typophile.com/forums/messages/29/28a-23999.pdf\" target=\"_blank\"><b>28a.pdf</b></a> (36.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "13 Jan 2004 — 4:43am",
      "content": "Nice. I like it.   \n   \nTwo further comments (preferences really):   \n1. The ascending 2 looks great alone, but in the 12 combo seems strange. Probably just my eyes used to convention, so it's a minor quibble.   \n2. The overall color seems a bit dark for my taste.   \n   \nok one more: The bottom of the 3 looks a little wonkey. The placement of the corner seems consistent. Maybe it is the upward angle at the end. Typically it should follow more like the 5.\n\n"
    },
    {
      "time": "13 Jan 2004 — 5:38am",
      "content": "Looking at the PDF before and after revision, I don't see a big difference in the look of it at small sizes with the sharper or softer terminal of the c, r.   \n   \nI think the m is definitely too narrow, and I am wondering whether the other letters are just slightly too narrow also. I know italic is more narrow, but this having turned into more of a text face, I am wondering whether it would benefit in terms of readibility to be openned up a hair.\n\n"
    },
    {
      "time": "13 Jan 2004 — 6:00am",
      "content": "Looking at this design big, I was bowled over by its originality and stylishness, but looking at it in small sized in the PDF, I to think it needs work in color, width, and spacing to fulfill its potential.\n\n"
    },
    {
      "time": "13 Jan 2004 — 7:58am",
      "content": "Ascending twos rule.   \nI think the \"m\" needs to be a little tight (like it is).   \n   \nAnd yeah, dark is the new ITC.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Oct 2003 — 9:40am",
      "content": "Nice! nice!   \n   \n• The lowercase 'w' seems a little wide, but because you used this latin-looking text I can't see it in context. :^)   \n• The lowercase 's' seems too big   \n• Both your cap 'S' and your lowercase 's', the serifs seem a bit chunky.   \n• As your typeface in general has a (to my eyes anyway) forward slant, I think both 'S' and 's' need to be slanted forward a bit more.   \n   \nI still enjoy the irregularity and hope for a full fleshed out family. Some day. ;^)\n\n"
    },
    {
      "time": "12 Jan 2004 — 4:58am",
      "content": "Christian,   \n   \nThis face has the most potential of any you've posted. Once   \nPill Gothic is out the door you should give it your full attention.   \n   \nI am not a believer in Hrant's light italic ideas. The italic   \nshould contrast with the roman by a change in design and   \nslope, not weight. Color should be even throughout the   \ntypeface's styles.   \n   \nHrant is right about the 'f' crossbar and I think it carries   \nover to the 't' as well, as Randy said.   \n   \nThe overall spacing is just right. If anything, it's too tight.   \nThe 'tt' spacing (see \"shatter\") is evidence of that. Any   \ntighter and it would require a ligature. But Hrant is right on   \nthe spacebar.\n\n"
    },
    {
      "time": "13 Jan 2004 — 5:23am",
      "content": "Ok, I printed this one up...   \n   \n- Your combo glyphs are screwy. I am not a path master so   \nI don't know what went wrong, but the 'W', 'fl' and 'ff' ligs are   \nmessy where they overlap. You can see it in the PDF on   \nscreen and when printed it goes white.   \n   \n- Color is perfect. Don't change a thing. Dark is in, and for   \ngood reason.   \n   \n- I think the ascending 2 is ok. I always thought it was too   \nsquashed to be lc. I can see how it's unnerving for those of   \nus who aren't used to it, but I think it works.   \n   \n- Looks like you've tightened the 'tt' kern. The touch looks   \nok at the small size, but any larger might be a problem. I   \nsuppose this is a good time for me to request a display   \nversion for larger sizes. ;)   \n   \n- Randy is right on the 3. Maybe if you shorten and lighten   \nthat bottom stroke it will clean up.\n\n"
    },
    {
      "time": "13 Jan 2004 — 5:50am",
      "content": "Christian - are you getting emails sent to your betatype.com   \naddress? I need a reply on mine pronto, fella!\n\n"
    }
  ]
}
