{
  "id": "11045",
  "title": "Basic terms 2",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hi all,   \ni'va few basic questions ![:-)](http://web.archive.org/web/20131020193120im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n1. what is the differance between truetype, open type and postdcript type?   \n2. what is the differance between the weights \"light\" and \"book\"?   \n3.Is the widths of capital and small caps in a monospaced font are sepposed to be the same?   \nthanx   \nroy\n\n",
  "author": "anonymous",
  "time": "22 Apr 2003 — 6:25pm",
  "uid": "1203",
  "comments": [
    {
      "time": "22 Apr 2003 — 10:28pm",
      "content": "Double post.\n\n"
    },
    {
      "time": "23 Apr 2003 — 1:58am",
      "content": "_I have never seen a clearer definition of the formats._   \n   \nMe neither. But I suspect that Roy is going to start a 'basic terms 3' thread to find out what quadratic B-spline curves are.   \n   \nM\n\n"
    },
    {
      "time": "23 Apr 2003 — 7:39am",
      "content": "Here   \n   \n [http://www.font.to/downloads/TT\\_PS\\_OT.pdf](http://web.archive.org/web/20131020193120/http:/www.font.to/downloads/TT_PS_OT.pdf)   \n   \nis a 9-page PDF that explains the similarities, differences, history & possible future of the 3 major font types   \n   \nJay\n\n"
    },
    {
      "time": "23 Apr 2003 — 1:14am",
      "content": "That was worth posting twice, John. I have never seen a   \nclearer definition of the formats. I salute you.\n\n"
    },
    {
      "time": "23 Apr 2003 — 10:11am",
      "content": "matha - i guess you are right ![:-)](http://web.archive.org/web/20131020193120im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nbut first i try to learn more at microsoft and adobe... since for some reason i couldn't open the pdf file Jay attached.   \nthanx ![:-)](http://web.archive.org/web/20131020193120im_/http:/www.typophile.com/forums/clipart/happy.gif) roy\n\n"
    },
    {
      "time": "22 Apr 2003 — 10:23pm",
      "content": "1.   \nA TrueType font is a font with an sfnt table format structure utilising quadratic B-spline curves for outlines.   \n  \nA PostScript font may have a variety of different formats (Type 1, Type 3, sfnt (see below), etc.); it is most easily distinguised from a TrueType font by its use of cubic Bezier curves for outlines.   \n  \nAn OpenType font is a font with an sfnt table format structure utilising _either_ quadratic B-spline ('TrueType flavour') or cubic Bezier ('PostScript flavour') curves for outlines. An OpenType font may also contain _optional_ tables that enable sophisticated glyph substitution and positioning.   \n  \nAll this information is readily available from Microsoft and Adobe's websites.   \n  \n...   \n  \n3.   \nYes, this is what makes it a monospaced font: _all_ the glyphs have the same advanced width.\n\n"
    }
  ]
}
