{
  "id": "11056",
  "title": "Font Catalog PDFs",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everyone! Can someone send me some links of font PDF catalogs? I'm currently interning with Chank and am compiling his fonts into a nice PDF catalog. I've checked some of the major type foundries (house, emigre) and none of them have one. I'm just trying to get some layout ideas. Any help would be apprecited\n\n",
  "author": "t1mmy",
  "time": "23 Apr 2003 — 9:20am",
  "uid": "850",
  "comments": [
    {
      "time": "23 Apr 2003 — 9:30am",
      "content": "[http://fontbureau.com](http://web.archive.org/web/20131013110344/http:/fontbureau.com/) -- pretty sure they have what you need, samples that is. ![:-)](http://web.archive.org/web/20131013110344im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "23 Apr 2003 — 10:49am",
      "content": "[http://www.garagefonts.com](http://web.archive.org/web/20131013110344/http:/www.garagefonts.com/) has theirs online. It's a couple of years old, but shows a ton of fonts.   \n   \nDoesn't Storm also have all his specimens online in PDF?\n\n"
    },
    {
      "time": "23 Apr 2003 — 10:53am",
      "content": "[Fontworks UK](http://web.archive.org/web/20131013110344/http:/www.fontworks1.type.co.uk/cgi-bin/fontworks2/fwks/info/pdf?u2RI2o9e;;7) has some nice PDF versions of their FontBox.\n\n"
    },
    {
      "time": "23 Apr 2003 — 10:54am",
      "content": "you guys rokk! thanks so much, the instant feedback kicks butt!   \n   \ntimmy\n\n"
    },
    {
      "time": "23 Apr 2003 — 10:59am",
      "content": "Looking at my PDFs, it looks like [Storm](http://web.archive.org/web/20131013110344/http:/stormtype.com/free.html), [PsyOps](http://web.archive.org/web/20131013110344/http:/www.psyops.com/html/specimens.html), [Underware](http://web.archive.org/web/20131013110344/http:/www.underware.nl/site/home.php3), and [MindCandy](http://web.archive.org/web/20131013110344/http:/www.mindcandy.com/fonts/pdf.catalog.html) all have PDF Specimens.\n\n"
    },
    {
      "time": "25 Apr 2003 — 1:00pm",
      "content": "I LOVE PDF specimens... the best way to show fonts online, and they are printable! I in fact collect PDF specimens...\n\n"
    },
    {
      "time": "25 Apr 2003 — 1:04pm",
      "content": "So what are some of your favorites?   \n   \nhhp\n\n"
    },
    {
      "time": "25 Apr 2003 — 1:22pm",
      "content": "Don't forget [Helzel](http://web.archive.org/web/20131013110344/http:/www.romana-hamburg.de/Schriftmappe.zip) and his herd of blackletters.\n\n"
    },
    {
      "time": "25 Apr 2003 — 2:15pm",
      "content": "I'm sorry, I thought this thread was about PDF specimens. It appears to be about What Hrant Has To Say About Yanks. My mistake.   \n   \nOne way of strengthening PDF security is to use Type-\\>Create Outlines or similar. A cracker can still blow away time re-importing them into a font editor and adding the metrics on his own, but the amount of time needed to reconstruct such a font adequately will usually be worth more in an adequately skilled person's dollars than the cost of simply buying a license. The downside of Create Outlines is that there is no hinting. Supposedly the newer versions of Acrobat will anti-alias line art. I'll try making some comparisons this weekend or so.\n\n"
    },
    {
      "time": "25 Apr 2003 — 1:56pm",
      "content": "PDF specimens are a lovely idea, but the security for embedded fonts is too weak for my liking. Extracted fonts lack hinting and kerning, so are probably too much trouble for people wanting to pirate text faces, but the opportunity to strip a display face from a PDF and, within a few minutes, have a working version with which to create a headline or web graphic is more temptation than I would like to put before a lot of people.\n\n"
    },
    {
      "time": "25 Apr 2003 — 2:03pm",
      "content": "\\> the security for embedded fonts is too weak for my liking.   \n   \nBut so many big houses use PDF now, like FontBureau and Adobe.   \n   \nFrom the few tests I've done recently (don't ask me how to do it - I won't tell) it seems that -especially with more recently generated PDFs- it only works some of the time, and even then you rarely get anything really usable.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Apr 2003 — 2:07pm",
      "content": "_\\>PDF specimens are a lovely idea, but the security for embedded fonts is too weak for my liking._   \n   \nWhat would you suggest as an alternative, John?   \n   \nI think Jeremy Tankyard's website has PDFs, but he converted all the fonts to outlines, so it will print well. He compensates the lack of crispness in the PDFs by having a online test-driver (which isn't fully piracy-proof either afaik).   \nThat's the best alternative i've seen around.\n\n"
    },
    {
      "time": "25 Apr 2003 — 2:32pm",
      "content": "Department stores could probably eliminate shoplifting if they kept all their inventory in a vault and only let customers see pictures of merchandise. And yet they don't because they'd lose more business than the losses they'd eliminate.   \n   \nI think PDF specimens are a good idea. The risk of extraction is pretty small, especially since you end up with something less than the real font. Selling a font is _much_ riskier. Once it's out in the world, anything can happen.\n\n"
    },
    {
      "time": "25 Apr 2003 — 11:41pm",
      "content": "[www.typotheque.com/pages/PDF\\_samples.html](http://web.archive.org/web/20131013110344/http:/www.typotheque.com/pages/PDF_samples.html)   \n [www.dutchtypelibrary.nl/PDF.html](http://web.archive.org/web/20131013110344/http:/www.dutchtypelibrary.nl/PDF.html)\n\n"
    },
    {
      "time": "26 Apr 2003 — 12:00am",
      "content": "I'm generally glad to send some pdf when people ask me directly or doing font testing with their layout and my fonts. But I\n\n"
    },
    {
      "time": "26 Apr 2003 — 9:37pm",
      "content": "Re: create outlines command and huge file sizes... I've not upgraded to Acrobat 6 yet; I'd be curious to see if the OT FDK's outline subroutinization code might have been repurposed for general PS outlines in Acrobat. That might make no-font specimens more feasible.\n\n"
    },
    {
      "time": "25 Apr 2003 — 1:45pm",
      "content": "My arse.\n\n"
    },
    {
      "time": "25 Apr 2003 — 10:29pm",
      "content": "[ With the aim of keeping things on topic, the political posts here   \nhave been moved to [The War, Politics, Et cetera](http://web.archive.org/web/20131013110344/http:/www.typophile.com/forums/messages/30/9254.html) ]\n\n"
    }
  ]
}
