{
  "id": "11068",
  "title": "Any must visit design/type related spots in Amsterdam?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm visiting Amsterdam in a few weeks (and Paris, but I'm only going to be in Paris for a couple days), and I was wondering if anyone has reccommendations for places to visit to see cool design/type related stuff.   \n   \nThanks!\n\n",
  "author": "seanglenn",
  "time": "24 Apr 2003 — 11:18am",
  "uid": "1256",
  "comments": [
    {
      "time": "24 Apr 2003 — 11:59am",
      "content": "You must go to [Nijhoff & Lee](http://web.archive.org/web/20131109014353/http:/www.nijhoflee.nl/design/), the best design bookshop in the world (that I've visited). Be sure to ask to see the antiquarian section also: this is upstairs and you'll find many gems.\n\n"
    },
    {
      "time": "24 Apr 2003 — 3:44pm",
      "content": "Thank you, I will definitely check that out.\n\n"
    },
    {
      "time": "25 Apr 2003 — 4:33am",
      "content": "Also there is a great place for magazines on Spui. (that's a street or more like a square, you'll find it on the map...) + Just walk around. As in any city, there are gems everywhere. I've got a few Amsterdam pics on my site.   \nBut why didn't I know about that bookstore...\n\n"
    },
    {
      "time": "25 Apr 2003 — 10:50am",
      "content": "It's been a while since my last visit, but I believe Kenn is refering to [Athenaeum Boekhandel](http://web.archive.org/web/20131109014353/http:/www.athenaeum.nl/) a bookstore with a very good magazine section in the building next door. Also there used to be an antique book market on Spui too, I think it was on wednesdays but ask around. And, like John said, don't miss Nijhoff & Lee. They are responsible for a good part of my personal library ![:-)](http://web.archive.org/web/20131109014353im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n- jdf   \n   \nps. are you going to be there for the Queen's Birthday? One of the craziest street-party weekends in the world!\n\n"
    },
    {
      "time": "25 Apr 2003 — 11:10am",
      "content": "This isn't so much a typography/graphic design thing, but if you can make it over to Rotterdam for a day, a visit to the Kunsthal would be worth it. I'm sure the exhibits are great, but it's the building that's amazing - by [Rem Koolhaas and OMA](http://web.archive.org/web/20131109014353/http:/www.oma.nl/index_flash.htm). They also did the Byzantium Building in Amsterdam and part of the urban planning for the Amsterdam-Noord ferry.\n\n"
    },
    {
      "time": "25 Apr 2003 — 11:11am",
      "content": "Queen's Day is goddam amazing.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Apr 2003 — 11:52am",
      "content": "I'll be there a bit after Queen's Day, but I'm definitely going to check out all these recomendations. Thanks!\n\n"
    }
  ]
}
