{
  "id": "11086",
  "title": "Archive through April 24, 2003",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hrant, if you mean you like their desktop scanner, they're identical with Microtek models. Agfa simply relabelled the stuff. Btw, I like the Epson-Pro-models better, especially with VueScan. There simply is no better scan tool :-).\n\n",
  "author": "hdschellnack",
  "time": "23 Apr 2003 — 3:18pm",
  "uid": "1520",
  "comments": [
    {
      "time": "23 Apr 2003 — 6:19pm",
      "content": "Hey, so is there a Rule that says the poser of the question can ignore other Rules at will?...   \nWhy exactly didn't Matha win?   \n   \n--   \n   \nHD, are you sure about the Microtek business? Maybe it was the other way around, or maybe it was a recent thing? Back when I used to sell pre-press equipment (don't ask...) Agfa was a bastion of quality. Anyway, the reasons I like Agfa are that: they didn't engage in the total bullshit about resolution (some companies would advertise like 14 million dpi while keeping the true optical resolution secret), and their software was ultra powerful from day one, unlike the dumbest-common-denominator \"user-friendly\" stuff out there. My lowly SnapScan (which I got for like $50) performs marvelously - you can tell it's serious when it forces an extensive warm-up/calibration after prolonged lack of use.   \n   \nBTW, I personally haven't met a single Epson product I've liked - except maybe when they first came out with their high-end color inkjets.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Apr 2003 — 6:57pm",
      "content": "I believe the correct interpretation of the rules in this case is as follows:   \n   \nThe poser of the question is resposible for declaring the winner. Eduardo declared me the winner at 2:51 pm. So far so good.   \n   \nAfter the winner is declared, other parties have one hour in which to challenge the answer and/or declaration. Within this time frame, various people expressed the view that Matha should have been declared the winner. Although only Clint Eastwood's post constituted a definite challenge, I consider this a valid challenge _of the declaration_, i.e. not a challenge of the answer.   \n   \nHowever, since Matha has stated his own acceptance of the declaration, citing tiredness, I will use quizmaster privilege to award both Matha and myself a dual win, and quizmaster caprice to invite Hrant to pose the next question.\n\n"
    },
    {
      "time": "23 Apr 2003 — 7:21pm",
      "content": ":-/   \n   \nYou guys are gonna make me use up all the nice trivia questions I've collected over the years...   \n   \n--   \n   \nNEW QUESTION:   \nWhich letters of the contemporary English alphabet are not present on the Trajan Column inscription?   \n   \nhhp\n\n"
    },
    {
      "time": "23 Apr 2003 — 8:41pm",
      "content": "W, J, K, G [;^/]\n\n"
    },
    {
      "time": "23 Apr 2003 — 8:48pm",
      "content": "One wrong, four missing.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Apr 2003 — 8:57pm",
      "content": "B HJKUWYZ\n\n"
    },
    {
      "time": "23 Apr 2003 — 9:06pm",
      "content": "tiffany, there's a B   \n   \nHJKUWYZ\n\n"
    },
    {
      "time": "23 Apr 2003 — 9:11pm",
      "content": "thanks bj - trib\n\n"
    },
    {
      "time": "23 Apr 2003 — 9:11pm",
      "content": "thanks bj - trib note my edit ![:-)](http://web.archive.org/web/20131011233701im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "23 Apr 2003 — 9:13pm",
      "content": "any way i found out. WJK YZ HU\n\n"
    },
    {
      "time": "23 Apr 2003 — 10:36pm",
      "content": "Now I'm torn... Tiffany was the first, but she had an extra letter (which might have actually been caused by misreading my \"four missing\"), on the other hand she tried to pull off a sneaky message editing thingie; BJ was the first to get it exactly right (although he might have been cannibalizing on Tiffany's attempt, but since he's a fellow Angeleno I can look the other way) so technically he should win; but I certainly like H\n\n"
    },
    {
      "time": "23 Apr 2003 — 11:32pm",
      "content": "I just googled it (see below) and found   \nthe inscription.   \n   \nI didn't begin at the beginning. I wasn't online.   \nI haven't attempted these pop quizzes much   \nb/c I don't have a chance when my best ref.   \nbook is the \"encyclopaedia of typefaces\"   \nand my relative immersion level   \n(among typophiles at least) is low.   \n   \nAnyway, when I got online,   \nyou were telling Tiffany   \nshe had some right, some wrong.   \n   \nSo I looked at the question and thought,   \nhey, I can google that.   \n   \nThat's when I found the inscription and   \nstarted to go through the alphabet.   \n   \nTiffany was quicker!   \n   \nThe order is alphabetical.   \n   \nHere's the google link...   \n   \nTiffany, if you're awake and you have a   \nquestion, the floor is yours.   \n   \nIf you don't post a question by 12:30,   \nthen I'll open up my type library   \nand find somethin'.   \n   \nfair?   \n   \n [http://216.239.39.100/search?q=cache:-CMSbSqpB9oC:www.lancs.ac.uk/users/english/palwork/week02/palwk2.htm+%22trajan+column%22+%22missing%22+%22letters%22&hl=en&ie=UTF-8](http://web.archive.org/web/20131011233701/http:/216.239.39.100/search?q=cache:-CMSbSqpB9oC:www.lancs.ac.uk/users/english/palwork/week02/palwk2.htm%2B%22trajan%2Bcolumn%22%2B%22missing%22%2B%22letters%22&hl=en&ie=UTF-8)\n\n"
    },
    {
      "time": "23 Apr 2003 — 11:55pm",
      "content": "Strike that. Surely, I broke   \nsome rules in the previous post...   \n   \nI don't know where the rules   \nare but rules are rules, even   \nif you can't find them. ;)   \n   \n(can a moderator do a little   \ninfographic with The Rules)   \n   \nApologies Tiffany. Go ahead and post a   \nnew question at your earliest   \nconvenience.   \n   \nbj\n\n"
    },
    {
      "time": "24 Apr 2003 — 12:41am",
      "content": "Hmm.   \n   \nThe question poser, Hrant, declares BJ the winner.   \n   \nBJ declares Tiffany the winner.   \n   \nThe quizmaster hereby disqualifies Hrant's declaration in retaliation for the tasteless mud-wrestling comment, and joins BJ in declaring Tiffany the winner.   \n   \nBJ, the basic rules are posted way, way back at the beginning of this thread. Others are dotted through the thread as they were added. Frankly, I've forgotten half of them, but that's okay because I'm still basically an anarchist at heart.\n\n"
    },
    {
      "time": "24 Apr 2003 — 7:50am",
      "content": "\\> tasteless mud-wrestling comment   \n   \nHey, it was chocolate-flavored.   \n   \nAnyway, I still want to know how H\n\n"
    },
    {
      "time": "24 Apr 2003 — 8:08am",
      "content": "_\\>Why exactly didn't Matha win?_   \n   \nI declared John the winner because he answered correctly the   \nfull question first. Maybe I shouldn't have written \"bonus question\".   \n   \nLet's say Matha's shot was quicker, but John got it right on bullseye.   \n;-)   \n   \nAnyway, that's past. Just waiting for the new question.\n\n"
    },
    {
      "time": "24 Apr 2003 — 8:42am",
      "content": "Chocolate-flavoured mud wrestling?   \nCan I Play?   \n   \nM.\n\n"
    },
    {
      "time": "24 Apr 2003 — 8:48am",
      "content": "Hmm. Clint Eastwood is here? Or is it Clint as Dirty Harry?   \n   \nEither way, did I win? I can't quite tell. ![:-)](http://web.archive.org/web/20131011233701im_/http:/www.typophile.com/forums/clipart/happy.gif) John?\n\n"
    },
    {
      "time": "24 Apr 2003 — 8:51am",
      "content": "You won all right, Tiffany.\n\n"
    },
    {
      "time": "24 Apr 2003 — 8:53am",
      "content": "Yes, Tiffany, I think it's your turn:   \n   \n_The quizmaster hereby disqualifies Hrant's   \ndeclaration ..., and joins BJ in declaring Tiffany   \nthe winner._\n\n"
    },
    {
      "time": "24 Apr 2003 — 9:04am",
      "content": "Go on Tiffany, ask us a question. I'm wide awake for once.   \n   \nMatha\n\n"
    },
    {
      "time": "24 Apr 2003 — 9:14am",
      "content": "\\> Can I Play?   \n   \nDo you have your Speedo?   \n   \n--   \n   \nTiffany, please fire at will. Or Clint.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Apr 2003 — 9:22am",
      "content": "_Do you have your Speedo?_   \n   \nIt's naked or not at all   \n   \nM.\n\n"
    },
    {
      "time": "24 Apr 2003 — 9:48am",
      "content": "Only if it is dark chocolate guys. And I'll have to wear a bathing suit, sorry Matha. =D   \n   \n--   \n   \nI'm thinking of a specific milestone in the history of statistical analysis through graphical representation that occurred in the first half of the twentieth century.   \n   \nWhat was it? Who created it? And what was it for?\n\n"
    },
    {
      "time": "24 Apr 2003 — 10:03am",
      "content": "related to Otto and Marie Neurath and Isotype Institute?\n\n"
    },
    {
      "time": "24 Apr 2003 — 10:07am",
      "content": "In 1924 Otto Neurath (Austrian), created ISOTYPE the International System of Typographic Picture Education.\n\n"
    },
    {
      "time": "24 Apr 2003 — 10:09am",
      "content": "Double post and a bit of further info:   \n   \nIsotype was designed to be an alternative to written script, ie. a pictorial means for communicating complex information.   \n   \nMatha\n\n"
    },
    {
      "time": "24 Apr 2003 — 10:15am",
      "content": "Close. An additional person should be credited, as well as a little more specific on the \"what was it for\".\n\n"
    },
    {
      "time": "24 Apr 2003 — 6:19am",
      "content": "_...that's okay because I'm still basically an anarchist at heart_   \n   \nI reckon we need a new sheriff round here, one that'll make sure folks respect the rules. I'm callin ya out, quizmaster. This thread aint big enough for the both of us.   \n   \nClint.\n\n"
    }
  ]
}
