{
  "id": "11087",
  "title": "The War, Politics, Et cetera [Keep your rant here]",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "On second thoughts, anyone for oligarchical collectivism?\n\n [‹ Nobody uses Hobo like they used too!](http://web.archive.org/web/20080907020342/http:/www.typophile.com/node/193 \"Go to previous forum topic\") [Font family, font name, typeface name...??? ›](http://web.archive.org/web/20080907020342/http:/www.typophile.com/node/151 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907020342/http://www.typophile.com/user/1352\" title=\"View user profile.\">matha_standun</a>",
  "time": "<br>",
  "uid": "1352",
  "comments": [
    {
      "time": " 13.May.2003 9.42am",
      "content": "\\>\\>it [democracy] is working just fine for about 1% of the world's population! :-/   \n   \nNo it isn't, because it doesn't exist anywhere in the world at the moment   \n   \n\\>\\>Monarchy worked for millenia   \nNow there's a system that works for around 1% of the population   \n   \n\\>\\>Education under Capitalism/Democracy is nothing but brainwashing   \nOK, education under capitalism (not democracy, as we know that it doesn't exist) includes a large chunk of brainwashing, but it isn't 'nothing but brainwashing'   \nEducation under capitalism necessarily includes a degree of technical education, so that the workers can be more technically proficient, and therefore more profitable. (Even literacy and numeracy count as technical education - don't take these basic things for granted, its more than any monarchs ever provided - for the population of Britain at least)   \n   \nQuoting JS Mill on state education is hardly bringing in an unbiased observer   \n(By quoting Mill on this, you put yourself in the company of vile thatcherites like Keith Josephs)   \nState education under capitalism exists for the benefit of the interests of capital, but that doesn't mean that it is entirely without benefit for those who experience it.   \n   \nOn the whole, capitalism is a crock of shite, to be opposed at every turn, but it has done some good, partly in that the ownership and control of labour power under capitalism is distributed almost equally among individuals (This is not an unmitigated good, nor has it come without cost, particularly the concentration of ownership of the means of production) but probably the single greatest advance that can be attributed to the emergence of capitalism is the effective end of monarchies in all (properly) capitalist countries.   \n   \nHrant, give it up man - or you'll be coming over here to live in Bournemouth with all the other daily mail reading, tory voting, news believing blue rinse old ladies...\n\n"
    },
    {
      "time": " 13.May.2003 10.10am",
      "content": "Nothing exists in a pure state. Not Democracy, not Capitalism, not Monarchy. What people _think_ is the main thing. Americans are willing to kill Iraqis to force them to adopt democracy. Why? Because it goes along with the package: TV, Capitalism, McDonalds, the works.   \n   \nA benign monarch serves much more of the population than any other system.   \n   \nIt's good that you dislike Capitalism, but you also have to realize that it subverts everything to its will. Democracy for example is used to give the illusion of power, hence reducing real power. And public education is used to brainwash. And freedom of speech is the best way to reduce _desire for action_. etc. etc. etc. The whole Western experiment of society is failing, face it. What do you expect when the whole thing is descended from a people who raped women with bulls in front of thousands of paying spectators? The West teaches respect for the Romans - barbarians.   \n   \nBTW, I don't vote. I'm not qualified, and it validates this murderous system. I will have nothing to do with it, except follow the least amount of laws to avoid personal hardship.   \n   \nhhp\n\n"
    },
    {
      "time": " 13.May.2003 10.23am",
      "content": "\\>\\>\\>\\>The problem with Democracy is in fact this: since the laymen (that includes me) is not really qualified to determine matters of state (just like our clients are not qualified to design their own fonts - and good clients realize this), telling him he is qualified only serves to deceive him into supporting the system   \nMaybe the \"laymen\" isn't qualified but who is ? The king because he is born king ? The one who studied policy ? But there isn't one ultimate idea of what should be policy, as i now\n\n"
    },
    {
      "time": " 13.May.2003 12.46pm",
      "content": "\\> there isn't one ultimate idea of what should be policy   \n   \nYes, the longevity of a system depends on its adaptability.   \n   \n\\> letting the different possibilities being tested.   \n   \nNothing is being tested. What's going on is murder and theft, perpetrated by... democracies!   \n   \n\\> promoting liberty, equality\n\n"
    },
    {
      "time": " 13.May.2003 2.00pm",
      "content": "Ok, thoses Dreams, as you say, are used as tools for something else. But is ther any other system that don't use them and only try to magnify them ? Monarchy you think?   \nWe can say a lot of things about how the democraty doesn't play as it should. But i don't see another system doing better.   \nA quick note : liberty, equality, are purely human. They're matter of languages, concepts, that is nothing else than human.\n\n"
    },
    {
      "time": " 13.May.2003 2.17pm",
      "content": "\\> i don't see another system doing better.   \n   \nWhere have you looked?   \n   \n--   \n   \nLiberty from what, exactly?   \nDo you realize for example that there's such a thing in human nature as Freedom _from_ Choice as well?   \n   \nEquality? Nothing is equal. What we need is _decency_.   \n   \nOr in the mumbled words of the old beggar I would see every time I passed in front of Hotel Armenia in Republic Plaza: \"Mere kounem angakhoutian\" - literally: \"May I fukc independence's mother.\"   \n   \nFancy, idealistic concepts are not what humans need most.   \nEspecially when they're used as a ruse to implement the exact opposite!   \n   \nhhp\n\n"
    },
    {
      "time": " 13.May.2003 2.24pm",
      "content": "You want some on-topic type stuff?   \n   \nCome out of a metro in Yerevan, and you'll see Soviet-era Armenian lettering in a glorious, authentic style, in bronze. Walk out into the street, and you'll see \"free-market\" donut shops with vynil lettering in a Cooper Black rendering of the Armenian alphabet.   \n   \nThis is your culture? Well yes, it is, isn't it. Sickening.   \n   \nhhp\n\n"
    },
    {
      "time": " 13.May.2003 2.24pm",
      "content": "\\>\\>you also have to realize that it [capitalism] subverts everything to its will   \n   \nYou don't have to tell me that   \n   \n\\>\\>Democracy for example is used to give the illusion of power   \n   \nI'll put it in CAPS in case you missed it before:   \nDEMOCRACY IS NOT USED FOR ANYTHING BECAUSE IT DOESN'T EXIST.   \nThe ILLUSION of democracy may be used for many things, but that's a different issue   \n   \nYou always seem to think that anyone who thinks anything different from you is a defender of the west, capitalism, the war on Iraq, helvetica, child murder, jerry springer, mcdonalds, bush, blair and everything else from earwax to sheep worrying.   \nWe're not, nor are we any less thoughtful, or any more brainwashed than you are, and its patronising (as well as just plain wrong) to suggest otherwise.   \n   \nNow, lets move on.   \nYou want a monarch.   \nOK, who?   \n(If your answer is 'I'm not qualified to decide', then give us some idea who is, as well as what we might expect to happen when that monarch dies, abdicates etc)\n\n"
    },
    {
      "time": " 13.May.2003 2.33pm",
      "content": "_You want a monarch.   \nOK, who?_      \n   \n\"Whoever doesn't want the job\" may be the best qualification. ![:-)](http://web.archive.org/web/20080907020342im_/http:/www.typophile.com/forums/clipart/happy.gif) Going along with the maxim that anyone who desires power enough to achieve it is ill-suited to use it. That in itself may be democracy's failing.   \n   \nPaul\n\n"
    },
    {
      "time": " 13.May.2003 2.45pm",
      "content": "Steve, the mechanics would indeed be tricky. But I think it would be doable, and worth the bumpy road there. The precondition of course is for the masses to realize its necessity.   \n   \nWho?   \nSomebody between like 40 and 60 years old, filthy rich through family wealth (as opposed to personal acquisition), high IQ, preferably good health, and most of all with good parents. A cool head and a warm heart.   \n   \nhhp\n\n"
    },
    {
      "time": " 13.May.2003 3.29pm",
      "content": "I have to say \"no fecking way\" on the monarcy front, Hrant. But then I'm Irish and I've been trained to froth at the mouth whenever I see photos of the queen.   \n   \nDemocracy works to a certain extent (sorry Steve) if the scale is reduced to a minimum. On the level of a village or a small town, it functions a hell of a lot better than on the scale of a very big country. It's not perfect but it beats the hell out of monarchy.   \n   \nDid we really need those caps, Steve? Why not apply the \"Ok, now what?\" shite to yourself. If your not in bed yet and you're up to it, give us the benefit of your own wisdom.   \n   \nM.\n\n"
    },
    {
      "time": " 13.May.2003 6.33pm",
      "content": "Matha:   \n\\>This is where it all breaks down.   \n\\>We cannot 'know' anything objectively. The tools   \n\\>we use to define 'reality' and search for 'truth'   \n\\>were created by us. Nothing is objectively   \n\\>true'. Everything is culturally determined.   \n   \nThat's just bollocks - I have to agree with John Butler here. But I don't think it's anything to do do with being left wing, it's just a weak argument.\n\n"
    },
    {
      "time": " 13.May.2003 6.43pm",
      "content": "Hrant:   \n\\>high IQ?   \n   \nFor the most part monarchs and their offspring seem to have a talent for being remarkably dim.\n\n"
    },
    {
      "time": " 13.May.2003 6.47pm",
      "content": "Oh, you mean compared to elected presidents...   \nAlthough \"elected\" might be unfair here...   \n   \nhhp\n\n"
    },
    {
      "time": " 13.May.2003 8.30pm",
      "content": "[http://abcnews.go.com/wire/Business/ap20030513\\_2013.html](http://web.archive.org/web/20080907020342/http:/abcnews.go.com/wire/Business/ap20030513_2013.html)   \n   \nKill the monster _now_.   \n   \nhhp\n\n"
    },
    {
      "time": " 14.May.2003 1.59am",
      "content": "The west may suck. You may think the US sucks the most.   \nBut I'd take it over any other system going.   \n   \nI will take what some of you call 'broken' democracy (it's   \ncalled federalism, and I'd still take it) over any form of   \n'broken' communism.   \n   \nI will take what some of you call our 'failed' democracy   \nover any monarchy, 'benign' or even benevolent.   \n   \nI will take corrupt capitalism over any corrupt,   \ncommunist '5 year plan.'   \n   \nI will take my bankrupt public educaton 'brainwashing' over   \nany fascist, monarchist or theocratic brainwashing.   \n   \nI'll take my unfit president over any theocracy, monarchy or   \ncommunist leader. At least I know that in 4 years he'll be   \nreplaced by another.   \n   \nMy point is simply that you can postulate other systems all   \nyou want, but democracy (okay, federalism) is the best   \nthing for an imperfect set of corruptible people. That's all   \nof us, and I think our collective human history proves it.\n\n"
    },
    {
      "time": " 14.May.2003 2.32am",
      "content": "hrant: the mechanics [of choosing a monarch?] would indeed be tricky   \nOK, so you're not talking of a simple divine right selection with hereditary succession then?   \nWe need to know more...how will this monarch be chosen (from among those who meet your criteria)   \n   \n\\>\\>filthy rich through family wealth (as opposed to personal acquisition)   \nIs there a character trait you don't like among those who aquire their own wealth, or are we just trying to weed out vulgar new-money scrap metal merchants and bookies?   \n   \nIf its the former, then you have to remember that their parents (who you require to be 'good') may have that very trait, and if not, then someone down the line will have done.   \nIf its the latter, please let us know how far back we have to go - can it be money inherited from someone who made their fortune recently (a capitalist perhaps?) or do we need to go back to those who stole the land from the peasantry through acts of enclosure and highland clearances, or maybe some real blue blooded descendents of brutal robber-barons of the 14th century...   \n   \n\\>\\>high IQ   \nIQ tests measure only the ability to do IQ tests (I would have thought that you would have seen them for the tool of western cultural imperialism that they are)   \nObviously highly-educated doesn't come into it as that equates to highly-brainwashed   \n   \n\\>\\>good parents   \nCan you be more specific   \n   \nMatha:Democracy works to a certain extent (sorry Steve) if the scale is reduced to a minimum   \nI think it could do so, but I can't see how you can say that it 'does' - where have you seen democracy in action on any scale? (This is not a sarcastic question - I really do want to know, and I know that plain text can give the wrong tone if we're not careful)   \n   \n\\>\\>Did we really need those caps, Steve   \nOK, sorry - I just looked up through the thread and saw that I'd only made the same point to Hrant twice before that time. I'll just keep banging away in lc from now.\n\n"
    },
    {
      "time": " 14.May.2003 3.53am",
      "content": "Matha: Why not apply the \"Ok, now what?\" shite to yourself. If your not in bed yet and you're up to it, give us the benefit of your own wisdom.   \n   \nI don't have all the answers, but I do think that intelligent discussion and debate will bring us all nearer to them.   \nI asked that question of Hrant because he regularly offers us the solution (or at least a pointer to it) by recommending monarchies to us.   \n   \nI really struggle to take this seriously, but I don't think we should dismiss anything out of hand, so I want to know what the term means to him - does he mean good old fashioned divine right monarchies, or does he want some form of baronial council to choose a monarch from among themselves according to personal attributes, or what?   \n   \n(By the way, I don't think its shite to ask someone to expand on their ideas)\n\n"
    },
    {
      "time": " 14.May.2003 4.33am",
      "content": "JP:   \n\\>The west may suck. You may think the US sucks the most.   \n\\>But I'd take it over any other system going.   \n   \nThe problem is that its sucks least for (some of the) people in it   \nIts not just a question of what you (in the US) would take, but what everyone else has to put up with   \n   \nAlso, when you say you would take it over any other system going, you're not comparing it to much.   \nWould you take it compared to any other system possible?   \nIf so, then you must have a conscience made of steel (or none at all)   \nIf not, then surely its worth trying to understand what's wrong with it in order to change things for the better.   \n   \n   \n   \n   \n\\>\\>I will take what some of you call our 'failed' democracy   \n\\>\\>over any monarchy, 'benign' or even benevolent.   \n   \nCan't fault you on that one...   \n   \n   \n\\>\\>I will take corrupt capitalism over any corrupt,   \n\\>\\>communist '5 year plan.'   \n   \nLike democracy, communism has never existed.   \nThe regimes which used to call themselves communist have indeed largely been replaced by corrupt capitalism   \nRemember, though, that for the populations of those countries that choice has only recently become possible.   \nThe Russian revolution, for example, did not reject capitalism, but brutal military-feudal exploitation of the worst kind (under the reign of a monarch that considered himself benevolent)   \n   \n\\>\\>I'll take my unfit president over any theocracy, monarchy or   \n\\>\\>communist leader. At least I know that in 4 years he'll be   \n\\>\\>replaced by another.   \n   \nWell, at least the US does seem to have a good supply of unfit presidents   \nThe point is that while the person may change, the constraints of the system prevent him from changing into someone much different to himself. You can't vote the system out, which is much the same thing that Americans criticise non-democratic countries for.   \n   \n\\>\\>but democracy (okay, federalism) is the best   \n\\>\\>thing for an imperfect set of corruptible people. That's all   \n\\>\\>of us, and I think our collective human history proves it.   \n   \nI disagree - I think our history proves just that in certain historical contexts, countries which include some democratic elements in their political systems are often less brutal, and less directly controlling towards their own citizens (though not those of other countries) than other types of regime.   \nThis is due to the relationship (historical, not inherent) between democracy and capitalism. Capitalism requires a highly complex and flexible society to function at its best, and the blunt, unsophisticated and brutal feudal/monarchical regimes of the past (and in some places, the present) are just not capable of this.\n\n"
    },
    {
      "time": " 14.May.2003 5.58am",
      "content": "John H:   \n\"The term 'natural law' is not mystical, it has been part of the vocabulary of western philosophy for hundreds of years. The use of the term in the manner you describe is a later development, and in my opinion a misleading one. What you are referring to are so called 'laws' of nature, i.e. properties and relationships of the physical universe. Natural law refers to the idea that morality is not culturally specific or an invention of human intelligence, but refers to objective truths. For a fuller explanation, see the Natural Law entry in the Internet Encyclopedia of Philosophy, or the Catholic Encyclopedia (the latter acnowledges that in English 'this term is frequently employed as equivalent to the laws of nature').\"   \n   \nForgive me--I'm a finite being. I'm interested in how theism can 'jive' with a concept of morality that is independent of god. According to your stance is morality completely independent of god?   \nIf no, then it is an appeal to a moral authority.   \nIf yes, then would it be immoral to quit worshipping god?\n\n"
    },
    {
      "time": " 14.May.2003 7.58am",
      "content": "\\> I will take   \n   \nOf course you would.   \nWhich is why traveling, seeing the world is so important: you see the effects of your choices in creating global, escalating misery.   \n   \n\\> Is there a character trait you don't like among those who aquire their own wealth   \n   \nUnless by freaky luck, you need to step on people to get it. The main fault of Capitalism is in fact that it relies on us abusing our fellow humans.   \n   \nOf course the parents (or grand-parents, etc.) did that at one time, but above all you need to remain pragmatic about this. Ideally the monarch would neither need money, nor feel turned on by acquiring it.   \n   \nIQ: I just meant intelligence. BTW, IQ tests are shockingly consistent at least across a single demographic. I remember doing this experiment: I took one when I was 10, kept it, took it again 7 years later, and came up with _exactly_ the same score! I was shocked.   \n   \n\\> I want to know what the term means to him   \n   \nBascially absolute de jure (but practically never de facto - the people can always rebel) power in one individual. But any monarch needs advisors - whom he can select and dismiss at his discrection.   \n   \n\\> You can't vote the system out   \n   \nExactly. If voting could change anything it would be illegal.   \n   \nhhp\n\n"
    },
    {
      "time": " 14.May.2003 10.18am",
      "content": "_That's just bollocks_   \n   \nMa ch\n\n"
    },
    {
      "time": " 14.May.2003 10.34am",
      "content": "_Democracy works to a certain extent if the scale is reduced to a minimum I think it could do so, but I can't see how you can say that it 'does'..._   \n   \nSteve,   \n   \nI was thinking of the French system of _conseils minicipaux_. In some places with tiny populations the locals vote for a mayor that they probably know personally and he or she is then responsible for every decision that affects their area. I can think of some absolutely stunning examples of corruption even at this level, but it generally works.   \nI think you were probably hoping for something on a national level, but there you go.   \n   \nAnd sorry for the shite. It was late. And do explain why democracy doesn't exist. I'm all ears.   \n   \nM.\n\n"
    },
    {
      "time": " 14.May.2003 1.46pm",
      "content": "_Every human being experiences and interprets the universe differently. 'Truth' and 'Reality' are subjective._   \n   \nThat sounds like an objective truth claim to me. Can you prove that truth and reality are subjective? Are they ontologically subjective, or only subjectively subjective?   \n   \nIt is a fallacy to proceed from difference of individual experience and interpretation to difference in that which is experienced. Interpretation does not create reality: reality exists outside of experience and interpretation. Our interpretation of reality may vary, but this does not mean that reality varies, as people who throw themselves off cliffs in the belief that they won't fall soon realise.   \n   \n_Ask 10 witnesses what they saw during the supermarket robbery. Ask them to define 'reality' or 'justice' or 'evil'._   \n   \nThe Rashomon effect -- of literary rather than judicial fame -- demonstrates the faultiness of human memory and perception. The fact that 10 witnesses to a robbery recall different details of the robbery does not mean that different robberies with different details took place: a single, unique robbery with specific details took place. The reality of the robbery is a complex event that happens and which people under duress and fear at the time are later asked to recall. The fact that their recollections of the reality of the event may differ tells us more about the human mind at times of stress than about the nature of reality.   \n   \nWe are very seldom called upon in practical ethics to _define_ terms like 'justice', let alone 'reality' or 'evil'. The task is not to define, but to exercise, and the vast majority of people have an innate sense of justice that allows them to understand and respond appropriately to complex moral problems. Most people are capable, for example, of understanding that robbing a supermarket is wrong, but that justice requires that we consider the way in which the robbery took place (were weapons used? were people threatened? was anyone hurt?), the quantifiable aspect of the crime (were all the tills emptied? or was only a loaf of bread stolen?), and extenuating circumstances (was the perpetrator under pressure to commit the crime, e.g. was he or someone else threatened if he did not? was he hungry and took only what he needed to feed himself? is he mentally capable of understanding that his actions were criminal?) These are the sort of things that people deal with every day, without needing to define 'justice' and without getting their knickers in a twist about reality or truth.   \n   \nIn the realm of ethics and morality we may debate and disagree about what is good or evil in a given situation, but the foundation of natural law is that we all understand that morality consists, as St Thomas Aquinas put it, in 'doing good and avoiding evil'. Different individuals and different cultures may differ as to what consitutes good and evil, but there has never been a society that identified morality as doing evil and avoiding good. I happen to think that human sacrifice is evil, but the cultures that practised human sacrifice did not and, indeed, considered it a positive good. But the definition of morality is no subjective: those who practice human sacrifice still hold that morality consists of doing what is good andavoiding what is evil. This is the basis of natural law. None of this implies in itself that human sacrifice is either good or evil, although I think few people would advance arguments that it is good, but it implies very strongly that an idea of morality is universal and 'hard wired' into our nature. Of course, this implies that we have a nature: a real, true, ontological nature.   \n   \nExperiencing and intepreting reality does not constitute creating reality. Of course we subjectively experience and interpret reality, but the reality we experience and interpret is objective. The subjectivity is all in your head. The fact that your head -- and your subjectively experiencing and interpreting mind -- are _part of the objective reality_ limits both the reasonable extent of subjectivity (the point at which we cease to be rational and observational and become mad and delusional) and quite severely limits the degree to which subjective experience and intepretation varies from person to person. For example, studies in eyesight confirm that excepting variance (colour blindness, short-sightedness, etc.) we all _physically_ see the same things; this puts considerable limits on our subjective interpretation of what we see. I may disagree with my fellow witnesses as to whether the supermarket robber was wearing a blue or green jacket, but we're unlikely to disagree about whether there was an elephant present.   \n   \n   \nYou know, I think I've probably contributed (more than) enough to this thread.\n\n"
    },
    {
      "time": " 14.May.2003 3.50pm",
      "content": "HHP:   \n\\>\\>The main fault of Capitalism is in fact that it relies on us abusing our fellow humans.   \n   \nThis isn't unique to capitalism - its a feature of many pre-capitalist systems too - monarchies for example   \n   \nHHP:   \n\\>\\>Bascially absolute de jure (but practically never de facto - the people can always rebel) power in one individual. But any monarch needs advisors - whom he can select and dismiss at his discrection.   \n   \nOK, we're getting somewhere now - your monarch would be rich with money inherited from theives several generations removed, intelligent and have 'good parents'.   \nOnce in power they, with the help of their hand-picked advisors, would have absolute power to make and unmake laws.   \nBut the laws they could make would exclude certain types of law.   \nThey couldn't, for example, make a law giving themselves the effective monopoly of legitimate use of force that governments of all types usually assume as their right. This would lead to the de facto absolutism you want to avoid.   \n   \nSo, some further questions:   \nIf I oppose the decisions of the monarch and decide to ignore the rules, what can they do to make me fall into line?   \nIf the monarch falls victim of senile dementia, what is the mechanism for deciding when its time to replace them.   \nIf the monarch dies, do their children get automatic succession?   \nWho chooses the monarch in the first place?\n\n"
    },
    {
      "time": " 14.May.2003 3.53pm",
      "content": "_Our interpretation of reality may vary, but this does not mean that reality varies_   \n   \n_May_ vary? _Does_ vary and often in spectacular ways. We cannot know reality absolutely. As you say, we interpret and sometimes arrive at a consensus if lots of us interpret in the same way, but we don't come anywhere near truth.   \n   \n_Of course we subjectively experience and interpret reality, but the reality we experience and interpret is objective_   \n   \nBut there is no non-subjective way to verify this. God only knows.   \n   \n_I think I've probably contributed (more than) enough to this thread._   \n   \nBut don't stop, now that we're beginning to enjoy ourselves. ;-)   \n   \nM.\n\n"
    },
    {
      "time": " 14.May.2003 4.00pm",
      "content": "_the objective character of created reality knowable by the human intellect..._   \n   \nSo, it is still on this point that I disagree.   \n   \nM.\n\n"
    },
    {
      "time": " 14.May.2003 4.17pm",
      "content": "Matha:   \n\\>\\>I think you were probably hoping for something on a national level, but there you go   \nI was thinking of the national level - the problem with local level democracy in the context of national un-democracy, is that its difficult to tell what's working and what isn't as areas of influence overlap. (Is Mr X free because his local mayor allows him a license to run a bar, gamble on a sunday, set hounds on a hare etc, or is he unfree because the national government taxes drinking and gambling and bans cruelty to hares?)   \n   \n(OK, that's a crap example, but I've been playing cricket and drinking all evening and now I want to go to bed soon - hopefully you get my drift)   \n   \n\\>\\>And do explain why democracy doesn't exist. I'm all ears.   \n   \nOK, briefly, before we can say that a country enjoys democracy, we must satisfy ourselves that certain conditions are met. Exactly what these conditions are is debatable, for some a free press, or the rights of free association and free speech are important, for others access to mass media is a big thing. No one really agrees on much, but one thing that all agree on is that democracy has to be founded on a parliament (legislature) or at least a government (executive) which has been chosen by the population in free and fair elections.   \n   \nIn Britain, for example, we have elections where 60% of those who vote, vote for a losing candidate, where governing parties can remain in power with the votes of as little as 28% of the electorate, where most successful candidates have more people voting against them than for them.(These are not controversial figures, they are from the freely available official returns)   \nThere is no excuse for such a system, and even less for calling it democratic. It is like this party because there is a relatively strong third party in the UK, partly because UK elections officially perform the task of providing each area wiht its own representative in parliament but mostly because to change it, you would have to win an election under this system, and no-one wants to change a system that makes them a winner.   \n   \nIn the US presedential election its even worse - there they have no local representation - everyone is voting for a single president, nor are there significant 3rd parties, its just a straight 2-way fight, but still they come up with a ridiculous system which sometimes means that the candidate with the fewest votes wins.   \n   \nThere are some systems which are less poor, but none which translate the will of the people into the policies of the government. Its not that hard, it should be the easy bit of achieving democracy, leaving us with the difficult bit of deciding on and implementing the other requirements, but no-where in the world (as far as I know) does a whole nation, of significant size, use a democratic electoral system.\n\n"
    },
    {
      "time": " 14.May.2003 4.26pm",
      "content": "John: Of course we subjectively experience and interpret reality, but the reality we experience and interpret is objective   \n   \nMatha: But there is no non-subjective way to verify this. God only knows.   \n   \nI think John is suggesting that because there are limits on how much our subjective interpretations (of reality or morality) may vary, we can infer that 1. an objective reality exists, and 2. the mechanics by which we we all interpret reality are similar.   \n   \nBut Matha, if you insist that no objective reality exists, you are arguing yourself out of the validity of this (and any) debate. ![:-)](http://web.archive.org/web/20080907020342im_/http:/www.typophile.com/forums/clipart/happy.gif) There needs to be _some_ common ground for any political or moral discussion.   \n   \nPaul\n\n"
    },
    {
      "time": " 14.May.2003 4.55pm",
      "content": "For me, 'reality' is a name for the consensus we arrive at in our experience of our environment. when enough people agree to agree rather than disagree, we say it's real. Consensus exists, yes, but reality? Not without us calling it 'reality' it doesn't. If we agreed to call every possible interpretation of our experience of our environment 'reality', then reality would exist, yes, but in the plural - there would be an infinite number of realitie **s**.   \n   \nM.\n\n"
    },
    {
      "time": " 14.May.2003 4.58pm",
      "content": "So I suppose the common ground is what we agree to **call**'real'. Not what **is** real, because on that we cannot agree.   \n   \nM.\n\n"
    },
    {
      "time": " 14.May.2003 5.06pm",
      "content": "\\> its a feature of many pre-capitalist systems too   \n   \nNot at all. In Capitalism, abuse is an _encouraged_ trait, if only implicitly.   \nA benign Monarch in fact has the best chance of reducing abuse (although it can never be wiped out).   \n   \n--   \n   \nYour questions are good.   \n   \nhhp\n\n"
    },
    {
      "time": " 14.May.2003 6.01pm",
      "content": "_For me, 'reality' is a name for the consensus we arrive at in our experience of our environment. when enough people agree to agree rather than disagree, we say it's real._   \n   \nAnd what is this consensus based on? Fantasy? Conspiracy? Mass delusion? The Matrix?   \n   \nWe experience a physical and temporal reality, and the consensus of our _observation_ of that reality derive from a remarkably similar physiognomy of senses shared by beings that are, after all, a single species. We are not collectively inventing reality by consensus any more than we are individually inventing reality by subjective interpretation: we are inhabiting reality, of which we are a part. Yes, even you Matha, are real.\n\n"
    },
    {
      "time": " 15.May.2003 8.27am",
      "content": "[http://news.bbc.co.uk/2/hi/programmes/correspondent/3028585.stm](http://web.archive.org/web/20080907020342/http:/news.bbc.co.uk/2/hi/programmes/correspondent/3028585.stm)   \n   \nOf course, it would be naive to think that pretty much every other bit of \"news\" shown via US channels wasn't similarly orchestrated. Like the 5-year-old urchin in Naasiriyya holding a copy of a vapid US tabloid for the camera. And the shoeless kurdish boy jumping around with a nicely framed portrait of Bush. And the looters celebrating the day before they could _finally_ go into action...   \n   \nhhp\n\n"
    },
    {
      "time": " 15.May.2003 8.58am",
      "content": "HHP:   \n\\>\\>Of course, it would be naive to think that pretty much every other bit of \"news\" shown via US channels wasn't similarly orchestrated   \n   \nAnd there are other ways in which the news is orchestrated - after the Falklands war, thatcher flew to the islands to meet some of the military personnel and give them a pat on the back. The BBC duly and dutifully filmed this event - after all their job is to report on the events happening in the world.   \nThe problem is that if there had been no cameras to film the event, there would have been no event for the cameras to film. Thatcher had said that she would only go if the footage would make the early evening news.   \nSo were the BBC reporting on a news event, or making a news event to report on?   \n   \n   \nHHP:   \n\\>\\>Your questions are good   \n   \nBut not rhetorical...any answers yet?\n\n"
    },
    {
      "time": " 15.May.2003 1.21pm",
      "content": "[http://news.bbc.co.uk/2/hi/europe/3031717.stm](http://web.archive.org/web/20080907020342/http:/news.bbc.co.uk/2/hi/europe/3031717.stm)   \nWho needs conspiracy theories when it's right in front of our eyes? Albeit within the Cone of Silence...   \n   \nhhp\n\n"
    },
    {
      "time": " 16.May.2003 1.20pm",
      "content": "[This](http://web.archive.org/web/20080907020342/http:/www.law.uchicago.edu/news/nussbaum-grotius.html) is a good and thoughtful article, worth taking five minutes to read and longer to think about.   \n   \nBy the way, I have first dibs on Grotius as a typeface name.\n\n"
    },
    {
      "time": " 17.May.2003 1.12am",
      "content": "\\>I will take...   \n   \nPerhaps you should try, or at least tolerate, some of these other views before being quite so forthright?   \n   \n\\>I will take corrupt capitalism over any   \n\\>corrupt, communist '5 year plan.'   \n   \nI think you need to look at some US history - it had its own \"five year plans\".   \n   \n\\>I'll take my unfit president over any theocracy,   \n\\>monarchy or communist leader. At least I know   \n\\>that in 4 years he'll be replaced by another.   \n   \nWell, only two problems here. First, \"he\" could go on to a second term.   \n   \nSecond, \"he\" could end the world in four minutes - so four years hardly seems worth worrying about.\n\n"
    },
    {
      "time": " 19.May.2003 5.14am",
      "content": "_...even you Matha, are real._   \n   \nThis morning, John, I feel more like a figment of my boss's imagination.   \n;-)   \nThat is a very good and thoughtful article, by the way. I'll get someone to distract my boss for a few minutes and I'll give it another read.   \n   \nCheers   \nMatha\n\n"
    }
  ]
}
