{
  "id": "11082",
  "title": "Favorite newspaper faces?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "(Transplanted from another thread):   \n   \nAnd a more general question, posed to everyone, which perhaps might be better suited to its own thread: What are your favorite newspaper faces? (Or text faces that can be applied to newspaper text?)   \n   \nDavid\n\n",
  "author": "anonymous",
  "time": "8 Mar 2002 — 8:36am",
  "uid": "1203",
  "comments": [
    {
      "time": "8 Mar 2002 — 12:16pm",
      "content": "Well, imagination isn't generally considered the most important thing in newsface design (even though to me innovation is an inherently desirable thing), but my problem with Poynter is that it's too humanist (not that I adore Linotype's brutal Legibility Group fonts). Even Times I find too humanist, except that in its time/medium it came out OK (just not any more). One font that's masterfully balanced is Olympian - there's a great article about it in this obscure Hungarian magazine from the 70s. On the other hand, Poynter is notable for its technical prowess - those four grades really are wonderful. BTW, it's interesting to compare it with the [later] Bureau by FB. Lastly: there's an issue of Critique magazine with a three-person review of Poynter - the one by Keedy is worth reading.   \n   \nI really like Unger's work, not least because it's more cutting-edge than anything else, and than it even lets on (which can be seen as a critical necessity). The only problem I have with his news designs is that they simply look too cute at large sizes - but one could blame the user for that, especially if you believe that small and large sizes have inherent incompatibilities.   \n   \nIn terms of headline news designs, my favorite has to be de Groot's Folha - his new Floris (originally called Lucas) is [even] more interesting, but I think not as appropriate to its environment: I feel French type needs to be \"sharper\", like Meridien.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Mar 2002 — 12:47pm",
      "content": "Poynter vs Bureau, in case anybody's interested:   \n   \nBelow are a couple of GIFs I put together last year. They show superimpositions of the lightest and darkest grades for each of the two fonts.   \n   \n [http://www.themicrofoundry.com/other/fb/poynter\\_1vs4.gif](http://web.archive.org/web/20140808232230/http:/www.themicrofoundry.com/other/fb/poynter_1vs4.gif)   \n   \n [http://www.themicrofoundry.com/other/fb/bureau\\_0vs4.gif](http://web.archive.org/web/20140808232230/http:/www.themicrofoundry.com/other/fb/bureau_0vs4.gif)   \n   \nThe most notable difference is the alignment wrt the x-height. But there are also interesting differences of overal color, as well color gradation.   \n   \nAs an aside, I would highly recommend the purchase of FontBureau's most recent type specimen book - it's a marvel.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Mar 2002 — 11:18am",
      "content": "Perhaps it shows lack of imagination,   \nbut I adore Poynter.   \n   \n [http://www.poynter.org/Visual/fonts/fonts.htm](http://web.archive.org/web/20140808232230/http:/www.poynter.org/Visual/fonts/fonts.htm)   \n   \nStephen\n\n"
    }
  ]
}
