{
  "id": "11088",
  "title": "CARTER, MATTHEW",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A few days ago, I started a LIST OF TYPEFACES   \nby Matthew Carter.   \n  \nFor some reason, I couldn't find a single reference   \nvia Google that listed ALL of his typefaces.   \nHis humility probably has something to do with that.   \n  \nThe list stands at 43.   \n  \nThe list DOES NOT include his Bitstream work\n\n",
  "author": "beejay",
  "time": "25 Apr 2003 — 11:28pm",
  "uid": "1014",
  "comments": [
    {
      "time": "26 Apr 2003 — 5:28am",
      "content": "Just buy the book on M. Carter work published couple of months ago, who include also a genre of specimen designed by him where he show all his typefaces.   \n   \nGreat book!   \nThe art of Matthew Carter   \nUniversity of Maryland   \nby Margaret Re\n\n"
    },
    {
      "time": "26 Apr 2003 — 6:19am",
      "content": "BJ --   \n   \n1) As JFP mentioned, there was a catalog published in conjunction with the traveling exhibit of Matthew Carter's work, _Typographically Speaking: The Art of Matthew Carter_. This included a complete checklist (well, complete as of last year -- it doesn't include the most recent designs, like the Monticello revival). The checklist was compiled by Carter himself.   \n   \nJohn Berry wrote an article about the exhibit, which you can read at [http://www.creativepro.com/story/feature/18099.html](http://web.archive.org/web/20120623050442/http:/www.creativepro.com/story/feature/18099.html)   \n   \nThe catalog may still be available. You can try contacting Cynthia Wayne, Curator of Exhibitions at the Albin O. Kuhn Library & Gallery -- e-mail: [cwayne@umbc.edu](mailto:cwayne@umbc.edu) or telephone (410) 455-2270. I think the cost is $20 + $3 S&H.   \n   \nThe checklist lists 72 designs, including the ITC Greeks. And the Shelleys are counted as one.   \n   \nToo bad you didn't inquire before doing all that googling.   \n   \n2) The typeface for _El Pa_\n\n"
    },
    {
      "time": "26 Apr 2003 — 9:49am",
      "content": "Yeah, I saw Cynthia Wayne's name come up   \na lot and I didn't know if anyone   \nhad purchased that or what it had inside.   \n   \nI'll get it.   \n   \nDo either of you want to post   \nthe complete list...when you have   \ntime of course.   \n   \nMy list (adding Madrid, Milne and Durham)   \nbut Shelley = 1 is at 44. ![:-)](http://web.archive.org/web/20120623050442im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nDoes the book include Rocky? That was an   \nobscure one.   \n   \n\\> Too bad you didn't inquire before doing all that googling.   \n   \nI learned a lot. ![:-O](http://web.archive.org/web/20120623050442im_/http:/www.typophile.com/forums/clipart/proud.gif)   \n   \nbj\n\n"
    },
    {
      "time": "26 Apr 2003 — 1:01pm",
      "content": "Here's the list I had + the ones you mentioned.   \n   \nAirport   \nAlisal   \nAuriga   \nAuriol   \nBell Centennial   \nBig Caslon   \nCascade Script   \nCentury 725 (Boston Globe)   \nCharter   \nCochin   \nCRT Gothic   \nDurham (US News and World Report)   \nElephant   \nF DeFace (FUSE)   \nFenway (Sports Illustrated)   \nGalliard   \nGando Ronde   \nGeorgia (Microsoft)   \nHelvetica Compressed   \nMadrid (El Pa\n\n"
    },
    {
      "time": "26 Apr 2003 — 2:53pm",
      "content": "Matthew mentions in his introduction that he doesn't include several faces that have been attributed to him but that he doesn't consider that he really designed -- including things like Auriol and Cochin and Optima Greek. But they show up in the index that I counted earlier. Go figure.   \n   \nHe also omitted a couple designs that he did for corporate identities (such as the one I think you are calling Airport in your list) because they were never manufactured as fonts for typesetting, but instead only pasted up from photostats -- so he says.   \n   \nI see no mention of Century 725. Elephant was renamed Big Figgins for general release. He says New Baskerville is wrongly attributed to him; John Quaranta directed that one. The _Washington Post_ Bodoni is called Postoni (no 'd'). He doesn't mention Rocky.   \n   \nHe did Ionic Number One in 1999 for Carter & Cone. You're missing Wrigley for _Sports Illustrated_. He also includes the Manutius Latin supplement to Miller that he did for UCLA. There was Benton Bold Condensed for _Time_, Foreman Light for _The Philadelphia Inquirer_, and Newsbaum for the New York _Daily News_.   \n   \nIt is now clear to me that the index I counted earlier is not a definitive list -- it's just an index; and several entries are faces that he doesn't claim. So that 72 count I mentioned earlier is incorrect. I don't have the time to assemble a more definitive list from the 16-page specimen.   \n   \nBut get the book. It's well worth it.   \n   \n-- K.\n\n"
    },
    {
      "time": "26 Apr 2003 — 3:20pm",
      "content": "Wow! I will add to the list.   \nMaybe I ought to get the book first.   \n   \nI have IndieFonts, which I failed to check.   \nOf course, Big Figgins, Sammy Roman, etc.   \n   \nThe Wrigley I remember reading about and now   \nthat I googled, I see it was from   \nAndy's discussions with Carter.   \nAlso, I see Postoni called Postoni.   \n   \nThe Postdoni comes from here:   \n [http://www.asne.org/index.cfm?ID=4339](http://web.archive.org/web/20120623050442/http:/www.asne.org/index.cfm?ID=4339)   \n   \n\\>\\> Management\n\n"
    },
    {
      "time": "26 Apr 2003 — 9:29pm",
      "content": "bj   \n   \nI sent a post previously but it hasn't shown up. Probably hit the wrong button.   \n   \nOne item you are missing is LeBe, a Hebrew that was used in the Pennyroyal Caxton Bible. Not available otherwise. There are also beta fonts that have been around for a while that have not appeared and probably won't until there is some commercial interest.   \n   \nI was involved in the Manutius face mentioned by Kent. At the time Miller Text and Wilson Greek were in beta and we needed a roman/Greek face. Matthew configured them for us and also supplied every glyph we could find that existed in the 16th, 17th, and 20th century. It grew to be quite a monster. It is no longer available. I wrote about the project in an issue of Printing History. The beta fonts I mentioned above were also discussed in the article. Not sure how Matthew felt about that so I will only refer you to the article.   \n   \nSkia was initially a QuickDraw GX font and had much more extrapolative potential (amazingly so) than what was eventually made available as a TrueType font. Might want to somehow deferentiate this?\n\n"
    },
    {
      "time": "8 May 2003 — 8:25am",
      "content": "Just this past week I called up C+C and purchased a license for Flammande, right now my favorite Textura. There's a small showing of it at the top of page 13 of the _Blackletter: Type and National Identity_ exhibition catalogue by Peter Bain and Paul Shaw. I'm still eagerly awaiting the unveiling of the [C+C website.](http://web.archive.org/web/20120623050442/http:/carterandcone.com/) Flammande is two Type 1 fonts: the main font and the archaic scribal ligatures.\n\n"
    },
    {
      "time": "14 Mar 2008 — 11:34am",
      "content": "Add Big Bruce to the list.\n\n"
    },
    {
      "time": "14 Mar 2008 — 12:14pm",
      "content": "Actually, I have Wilson Greek & just converted it to OpenType, with the ligatures applied via a series of stylistic sets. Carter offered some basic help with the project & has seen it, but not commented. At least he didn't suggest I'd done it harm (he's a nice man).\n\nI was unaware Wilson Greek is no longer available; that is a shame. They took out some of the Greek text in the final version, but I used it with Quadraat for <cite>Household and City Organization at Olynthus</cite>.\n\n[http://books.google.com/books?id=YenwwRfce9YC&dq=household+and+city+orga...](http://web.archive.org/web/20120623050442/http:/books.google.com/books?id=YenwwRfce9YC&dq=household+and+city+organization+at+olynthus&pg=PP1&ots=8-8ao7y0O2&sig=sYXliPBVBN1Vy3QPb2vpqubY72A&hl=en&prev=http://www.google.com/search?hl=en&q=household+and+city+organization+at+Olynthus&btnG=Google+Search&sa=X&oi=print&ct=title&cad=one-book-with-thumbnail#PPR7,M1 \"http://books.google.com/books?id=YenwwRfce9YC&dq=household+and+city+organization+at+olynthus&pg=PP1&ots=8-8ao7y0O2&sig=sYXliPBVBN1Vy3QPb2vpqubY72A&hl=en&prev=http://www.google.com/search?hl=en&q=household+and+city+organization+at+Olynthus&btnG=Google+Search&sa=X&oi=print&ct=title&cad=one-book-with-thumbnail#PPR7,M1\")\n\nfor a sample of Wilson Greek, see the preface (page vii), and chapter 1 (page 1).\n\nBTW I disclaim the title page. Yale took out the subtitle at the last minute & didn't allow a redesign.\n\n"
    },
    {
      "time": "14 Mar 2008 — 12:45pm",
      "content": "[Typographically Speaking: The Art of Matthew Carter](http://web.archive.org/web/20120623050442/http:/www.amazon.com/Typographically-Speaking-Art-Matthew-Carter/dp/1568984278/ref=pd_bbs_sr_1?ie=UTF8&s=books&qid=1205523751&sr=8-1)\n\nGot mine from Amazon -- it's wonderful book (catalog, whatever).\n\nEDIT: Whoops! I didn't notice how old this thread was...\n\n"
    },
    {
      "time": "14 Mar 2008 — 11:13pm",
      "content": "There is his serif type family for Yale University, which now has bold and bold italic, though it's not available to the public.\n\n"
    },
    {
      "time": "16 Jan 2010 — 1:01pm",
      "content": "For the record, I just found Carter's Wilson font here: [http://users.teilar.gr/~g1951d/](http://web.archive.org/web/20120623050442/http:/users.teilar.gr/~g1951d/ \"http://users.teilar.gr/~g1951d/\")\n\n"
    },
    {
      "time": "16 Jan 2010 — 3:51pm",
      "content": "What about Verdana?\n\n"
    },
    {
      "time": "16 Jan 2010 — 9:07pm",
      "content": "Peter G. wrote: <cite>For the record, I just found Carter's Wilson font here:</cite>\n\nThe font _Alexander_ which you link to was designed by George Douros, not Matthew Carter. It is (like Carter's _Wilson Greek_) a text face based on the Greek types of Alexander Wilson.\n\n"
    },
    {
      "time": "20 Jan 2010 — 5:15am",
      "content": "I have Wilson Greek, & use it whenever if fits well with a requested Latin font (works very well with with Quadraat, for example).\n\nWent and looked at Alexander on the site above. The rho (at least) is different. I didn't download Alexander to see if the work was comparable to Wilson Greek. I would suspect not, but I've been known to be too cynical . . .\n\n"
    }
  ]
}
