{
  "id": "1117",
  "title": "Warning to Mindcandy Designers?",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "The following was passed along to me by a couple of different people, which made me decide to go public with it - I'm thinking the designers represented at Mindcandy might want to see this - assuming they don't already know and that's not \"integrated\" as a marketing trick or something:   \n   \n\"   \nFor a limited time, you can buy EVERY FONT WE CARRY - THAT IS 450 FONTS on   \nCD-rom FOR ONLY $450!!! (plus shipping)   \n   \nIf this is beyond your budget right now, I am willing to give you any 20   \nfonts for only $99!!! (plus shipping)   \n   \nWe will soon get out of the FONT business, once and for all!! We have been   \ndesigning and selling fonts since 1995! We have watched this industry go   \nfrom bad to worse to simply unprofitable!!!   \n   \nThis means that all this wonderful type at www.mindcandy.com will NO LONGER   \nbe available - singles or Font Kits!! As a matter of fact, as soon as some   \nof my type designers find out I am \"giving away\" their fonts - the shit is   \nsure to hit the fan. I am giving these fonts away at rock-bottom prices   \nONLY in an attempt to pay my designers their past due royalties!!   \n   \nIf you have ever designed a font, I mean the ENTIRE font family, you know   \nhow much work it can be - sometimes it takes months to complete and properly   \nkern just one font. If you have been in the graphic design business for   \nvery long, you know that the market is simply FLOODED with fonts, many of   \nthem very poorly designed and produced, and many of these \"fly-by-night\"   \ntype designers are just giving them away for free. This has made a mockery   \nof the entire type industry. In addition, intellectual property laws in the   \nUnited States are a f#cking joke - allowing pirates to upload peoples hard   \nwork and intellectual property for ALL TO STEAL!! (thanx for nothin' Fraud   \nNader!)   \n   \nMany of my type designers refuse to lower their prices to allow for these   \ntragic circumstances!! While I agree that fonts should be priced around $40   \nper font, they simply DO NOT SELL at that price. Here is where the conflict   \nlies between myself, the distributor, and my designers! I cannot tell you   \nhow long this special offer will last!! Take advantage of it while you   \ncan!!!!   \n   \nTHIS IS A ONCE-IN-A-LIFETIME OPPORTUNITY to get a phenominal font collection   \nfor next to nothing!!!   \n   \nTHIS PROMOTION IS NOT ADVERTISED ON MINDCANDY.COM - YOU are receiving it   \nONLY because you have ordered from us in the past.   \n   \nPLEASE EMAIL ME THE FOLLOWING CODE [XOXO7667-TYPO] in the subject field to   \ntake advantage of this special offer!   \n   \nTo view the fonts, please go to:   \n   \n [http://www.mindcandy.com/fonts/fonts.html](http://web.archive.org/web/20131020145459/http:/www.mindcandy.com/fonts/fonts.html)   \n   \nPeace!   \n   \nJeff Gillen - El Presidenté - Mindcandy.com   \n\"   \n   \nSans commentaires.   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "14 Jun 2002 — 2:30pm",
  "uid": "1250",
  "comments": [

  ]
}
