{
  "id": "1120",
  "title": "Specimen for TypeFace Study",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am going to start studing some type faces so I made a specimen wich groups main glyphs by familiar shapes, shows the vertical proportions and three different paragraph settings, one of them helping to measure type space efficiency (do = 1000 glyphs).   \n   \nI would like to have some commentaries about how could I improve this tool for the study of a type face. The lower case glyphs are about 2 picas height and the upper case about 3.I\n\n",
  "author": "rs_donsata",
  "time": "1 Sep 2003 — 11:25pm",
  "uid": "1530",
  "comments": [
    {
      "time": "2 Sep 2003 — 8:18am",
      "content": "This is really useful. I mean really.   \n   \nYou can add a lot of stuff, but start with the basics, like you have. I'd have to think what non-alphanumeric characters to add (eventually), but some quick observations for now:   \n- Have a regular alphabet setting too (at least a-z).   \n- Use the cap height as a secondary vertical measure, instead of using it to determine the percentages.   \n- Show the percentage of \"internal leading\" too.   \n   \nAnd on subsequent pages you might have:   \n- Some key words (like \"the\") set large.   \n- Width calculations.   \n- Many other wonderful things! :-)   \n   \n\\> spanish linguistics on type design improvement.   \n   \nHey, there's really nothing written about that for _English_. You've got yourself a superb topic.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Sep 2003 — 11:25am",
      "content": "I may use a legal size sheet to make some room for for extra glyphs and measurements. I\n\n"
    },
    {
      "time": "2 Sep 2003 — 1:39pm",
      "content": "\\> width measurements   \n   \nThe simple one is lc alphabet length.   \nBut a smarter one takes letter frequency into account, but then that gets language-specific.   \n   \nInternal leading is the sum of the space above the ascenders plus below the descenders, and it's a big determinant of the face's apparent size (for a given point size). In some designs (mosly script faces with small x-heights) it can actually be negative! But usually it's about 10%.   \n   \nhhp\n\n"
    }
  ]
}
