{
  "id": "112842",
  "title": "Newpaper faces through the times",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "newspaper",
    "serif"
  ],
  "content": "Hello Typophiles.\n\nMy name is Alvaro Franca, I'm an aspiring type designer and I've been doing some research on newspaper typefaces, their specifics, needs and whatnot and came to wonder a couple of things in regards to what they used to look like and what they look like today.\n\nWhat we can see today, at least here in the UK, is a tendency towards the more Swift, Guardian, Greta Text kind of face with nearly horizontal arches, shallow crotches, very open apertures, very horizontal hooks on characters like /e/ /c/ that create a certain strong horizontal continuity in blocks of text, wedge-like serifs, little contrast and very little (if at all) calligraphic influence. All the basic needs of newspapers are covered though (saving space, printing in small sizes, and in porous paper). the letterforms have narrower proportions, large x-heights and strong, sturdy details that survive to reduction.\n\nBut it used to be that newspapers would print in old style type fonts, and you had a staple in the industry in Times New Roman, which is also somewhat narrow, with sturdy details and a large x-height, but in everything else it is diferent from it's contemporary counterparts: it has quite a bit of contrast, a humanistic kind of construction, bracketed serifs, smooth arches, closed up apertures...\n\nIs this only a matter of style and taste or is there something to gain from a legibility standpoint? Old style forms are tried and true, and the so called \"contemporary serif\" has been around for thirty odd years and has some threshold in that playing field aswell, I wonder which of the two is more confortable to read in a newspaper, something you ocasionaly have to read under bad light, in public transportation and other such not-so-confortable environments....\n\nI ask because I love Swift to death and wanted your opinion on which of these kinds of faces are more legible at small sizes since I wouldn't trust just my own judgment, being as I am still a novice in these matters.\n\nI don't know if there is any point to the discussion, it's just something that's been on the back of my mind :-)\n\n",
  "author": "alvaroefe",
  "time": "28 Jan 2014 — 10:12am",
  "uid": "65209",
  "comments": [
    {
      "time": "28 Jan 2014 — 11:39am",
      "content": "I'm not a type designer, but in the U.S. (and other countries I assume) sales of printed newspapers are declining as younger people read the news online, and advertisers move to the web. Perhaps some changes in printed newspaper design are attempts to make newspapers more appealing to younger readers.\n\n"
    },
    {
      "time": "28 Jan 2014 — 10:00pm",
      "content": "For news setting I personally favor wide fonts (with large x-heights) for these reasons:  \n– Wide fonts can be set at smaller point sizes than narrow ones: you end up with the same apparent size, but you don't lose the space savings every time there's a paragraph break (something very frequent in news typography). Basically you predictably save _vertical_ space on every line no matter the text.  \n– In terms of readability wide fonts leave more room for bouma\\* divergence.  \n– In terms of \"mood\", wide is earthy (while narrow is classy) and that suits news.\n\n\\* [http://themicrofoundry.com/ss\\_read1.html](http://web.archive.org/web/20140712232509/http:/themicrofoundry.com/ss_read1.html \"http://themicrofoundry.com/ss\\_read1.html\")\n\nhhp\n\n"
    },
    {
      "time": "29 Jan 2014 — 1:59am",
      "content": "Thanks for the input Hrant! I hand't come across the concept of bouma yet, that's very interesting!\n\nJames, I did read that argument in some of the statements released by the newspaper re: their bespoke font families, which again leads me to think this is ultimately a matter of style, as Old Style fonts do appear too traditional. The papers also mentioned the need to for a cross-platform solution to their typographic identity, something that could work in print, the web and epub equally well....\n\n"
    },
    {
      "time": "29 Jan 2014 — 8:45am",
      "content": "A caveat: many people don't believe that boumas exist; they believe we only read individual letters (although not sequentially, but in parallel). To me that's anathema to how the human brain lives.\n\nhhp\n\n"
    },
    {
      "time": "29 Jan 2014 — 10:21am",
      "content": "\\> The papers also mentioned the need to  \n\\> for a cross-platform solution\n\nYes, that's a good point, I've heard that too.\n\n"
    },
    {
      "time": "29 Jan 2014 — 10:03pm",
      "content": "I recently designed an old style news face, Pratt, for the Globe and Mail (“Canada’s National Newspaper”).  \n [http://www.newseum.org/todaysfrontpages/hr.asp?fpVname=CAN\\_TGAM&ref\\_pge=...](http://web.archive.org/web/20140712232509/http:/www.newseum.org/todaysfrontpages/hr.asp?fpVname=CAN_TGAM&ref_pge=gal&b_pge=1 \"http://www.newseum.org/todaysfrontpages/hr.asp?fpVname=CAN\\_TGAM&ref\\_pge=gal&b\\_pge=1\")\n\nIn my opinion, most genres of type suitable for body text may be used in a newspaper, but having short descenders is particularly useful.\n\n"
    },
    {
      "time": "31 Jan 2014 — 9:48am",
      "content": "Wow! Pratt is really beautiful Nick!\n\nOldstyle but fresh, kudos! Wish I could see the paper in the flesh :)\n\n"
    },
    {
      "time": "31 Jan 2014 — 10:07am",
      "content": "I like that Italic, Nick.\n\nhhp\n\n"
    },
    {
      "time": "1 Feb 2014 — 12:02pm",
      "content": "Thanks Alvaro, Hrant.\n\n"
    }
  ]
}
