{
  "id": "112922",
  "title": "UPM/Ascender & Descender values",
  "forum": "Build",
  "tags": [
    "ascender value",
    "descender",
    "upm",
    "Build"
  ],
  "content": "Working on a typeface where the client wants to have 45 pts on all sides of the glyph basically. It's a monospaced Chinese font. I have the metrics set so 45 pts are on either side for side bearings, I have 45 pts added onto the cap height for the ascender, and 45 added to the baseline to get the descender. The client wants the highlighted text to go below the text 45 pts...but when I export, it won't highlight that increment. What am I doing wrong?\n\nHere is the font info box:\n\n ![](http://web.archive.org/web/20150419225909im_/http:/typophile.com/files/Screen%20Shot%202014-01-30%20at%203_4403.39.08%20PM.png)\n\nHere are the highlighted characters in comparison. The image on the left is the way they want it to appear when it's highlighted (so there is a little more space below the descender); the right shows the way it is currently appearing- cutting off right below the character.\n\n ![](http://web.archive.org/web/20150419225909im_/http:/typophile.com/files/reference_012714_03_3710.jpg)\n\nAny help on this is appreciated.\n\nThanks!!\n\n",
  "author": "ampersandtype",
  "time": "30 Jan 2014 — 3:46pm",
  "uid": "210270",
  "comments": [
    {
      "time": "30 Jan 2014 — 7:33pm",
      "content": "- Go to the \"true type specific metrics\" info box.  \n- Change from \"Automatic\" to \"Custom\" and manually enter 845 and -260 on all the 3 ascender/descender boxes. And set the LineGab to zero.  \n- Export again.\n\nOnce in Illustrator/Photoshop, set the Line Spacing to the same size as the font.  \n(For example, 700 and 700, instead of 700 and 840)\n\n"
    },
    {
      "time": "30 Jan 2014 — 8:37pm",
      "content": "Ok thanks!! I will try this and see how it goes. So i will need to tell my client to set up their illustrator file appropriately correct? Otherwise it won't show the changes I make?\n\n"
    },
    {
      "time": "31 Jan 2014 — 9:18am",
      "content": "I tried your advice in the TT window, and it still did not add additional highlighting to the bottom. I took a screen shot of how it is looking now. I put a guide for where the highlighting needs to go. I need to change something in the Ascender or Descender to accomplish this...but what increment? Been trying different amts and nothing seems to be working to add to the bottom.\n\n ![](http://web.archive.org/web/20150419225909im_/http:/typophile.com/files/Screen%20Shot%202014-01-31%20at%209_4071.12.53%20AM.png)\n\n"
    }
  ]
}
