{
  "id": "1129",
  "title": "Creative Squeeze Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "After going through the grinder of naming my business Creative Squeeze I am finding that developing one's own identity is extremely difficult. Rather than focusing on the objectives of the design, I am constantly dealing with emotions and opinions. I have hit the sketchbook and funneled with friends to arrive at these two design directions. Typophiles\n\n",
  "author": "squeeze",
  "time": "2 Sep 2003 — 3:33pm",
  "uid": "2236",
  "comments": [
    {
      "time": "2 Sep 2003 — 4:24pm",
      "content": "That's a greta name, and you can do a lot with it!   \nJust don't get too literal, but don't be afraid of being a little bit cute.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Sep 2003 — 7:43pm",
      "content": "I hear you doubleHp. My original hours of sketching were turning up illustrations of squeezed toothpaste, paint tubes, condiments (ketchup/mustard), and most of all lots and lots of citrus fruit and juice drops. It made for some nice visuals, but was too literal. I sense that the bulging/squeezing letters (3rd design from the top) concern you as being too literal\n\n"
    },
    {
      "time": "2 Sep 2003 — 8:51pm",
      "content": "I didn't see the Windows logo. I thought it looked more like a billowing flag (but very abstractly so).   \n   \nPaul\n\n"
    },
    {
      "time": "2 Sep 2003 — 9:28pm",
      "content": "To give you an idea of how\\_much/what\\_kind of \"literality\" I think might be good: like half a lemon is obviously too much, but a drop shape might be great. Like you're getting the last drop of benefit out of projects. Maybe just a drop shape between \"creative\" and \"squeeze\", with possibly a progressive (but subtle) narrowing of the letters the closer they are to the middle.   \n   \nThe one with the wavy bulging/squeezing letters: I think the problem with it is simply that it's too cheesy, too much squeeze ecstasy or something. Plus it looks like a suspension bridge or an audio company.   \n   \nAs for the Windows thing:   \n- I don't think it's very pronounced. I didn't see it.   \n- As much as some people (like me) can't stand the beast, most layman actually like MS. But since you're a design outfit (an area of Mac-worship) the MS connotation would indeed be a negative.   \n- Those \"E\"s don't really say much anyway. Or maybe they say tickle, but not squeeze.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Sep 2003 — 2:34pm",
      "content": "Thank you for the words of wisdom. hhp, I agree with your analysis of the tickling \"E's\". I have spent some time this afternoon on some concepts that I think are saying a little more. I'm still not in love with the \"E's\" on the concept second from the bottom. If I was designing something wicked, using black and red instead of gray and orange, I think I'd be onto something\n\n"
    },
    {
      "time": "3 Sep 2003 — 3:00pm",
      "content": "Well, the geometric face would lend itself more to lateral manipulation, so in that way it's versatile. That said, I don't like any of the three logos that use it... :-(   \n   \nThe Gill would certainly be more resistant to the ravages of time, so to speak, and it's not bland. Of the bottom two I'd say the first is a bit too... sexual or something, but I think the drop-as-tail on the \"Q\" holds promise, if you can make it more noticeable, and more integrated into the letterform. You could also try making the inside counter of the \"Q\" drop-shaped.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Sep 2003 — 3:54pm",
      "content": "What I feel you need to do is create a feel not a logo and have a tagline that explains your business goals.KISS, remember most of the people who are looking at your logo/site aren't artists, but need an artist. Let them get beyond your logo and to what you are trying to sell them, this is just a thought, Dan\n\n"
    },
    {
      "time": "4 Sep 2003 — 10:11am",
      "content": "The last logo with the drop becoming the tail on the Q is clever. I do agree with previous comments though that it is somewhat lost in the design.\n\n"
    },
    {
      "time": "4 Sep 2003 — 1:44pm",
      "content": "hi scott,   \n   \ni agree with Leah, the last logo is really quite clever and also subtle, which i think is good for a design firm. great name btw. maybe you should play with different typefaces to integrate the drop in a more obvious way. for example, imagine using a grotesque face while keepig the O a perfect circle. also try if you could make that work in one colour only. and don't forget the U next time ;-)   \n   \nsimon\n\n"
    },
    {
      "time": "4 Sep 2003 — 3:48pm",
      "content": "Maybe if the dri/op was disconnected from the Q it would work in one color, be slightly less subtle and bring a smile to the viewer when they discover it and think themselves smart for \"getting it.\"   \n   \nOf course any mustardy yellow gets my approval.\n\n"
    },
    {
      "time": "4 Sep 2003 — 4:35pm",
      "content": "Try to make a variation on your windows double e, but with lowercases. You can make a ink drop with letters, but in a more caligraphic stroke ends, the other yellow drops that you make looks like a liquid soap for a set of dishes.   \n   \nPost images in a lil big scale, if you keep yellow.   \n   \nGood work,   \n   \nmh.\n\n"
    },
    {
      "time": "4 Sep 2003 — 10:10pm",
      "content": "You could draw the type just like if it was printed in a transparent paper and you squeezed it like a cloth, only one turn, do you get it??   \n   \nHere\n\n"
    },
    {
      "time": "5 Sep 2003 — 10:19am",
      "content": "I like the understated approach of the \"Q drop\" version. I think it would read better if you separate the drop slightly from the letterform instead of having the colors touch.\n\n"
    },
    {
      "time": "5 Sep 2003 — 5:11pm",
      "content": "Scott, Aloha!   \n   \nI really like:   \n   \n\\* the stacked idea   \n\\* the drop idea from the Q   \n\\* the color scheme   \n   \nI don't really like:   \n   \n\\* the calling attention to the double Es   \n\\* the stubby Q   \n\\* squeezing or stretching (but you could use   \na condensed face stacked with a normal face)   \n   \n   \nI was wondering what font is the unicase font. It reminds me a little bit   \nof Neon from Aldo Novarese.   \n   \nmaybe more playful or relaxed   \nchoices for the type?   \n   \ni dunno.   \n   \ngood stuff so far,   \n   \nbj\n\n"
    },
    {
      "time": "5 Sep 2003 — 5:13pm",
      "content": "Sorry, Neon by G. de Milano (Nebiolo)   \nwhich I don't think has been digitized.   \n   \nIf it has, i'd love to get it.   \n   \nbj\n\n"
    },
    {
      "time": "6 Sep 2003 — 12:01pm",
      "content": "Thank you all for your thoughtful and inspiring feedback, thus far. I hope to receive more in the coming days, as I continue to work on my logo between paying projects.   \n   \nI am on the drawing board applying some new approaches which will be revealed shortly, but for now I just wanted to let BJ and Jared know what font was originally used for the unicase concept. It is a less-than-sophisticated font called \"New Hamburger\" and yes, Jared, the \"Q\" is in its original form.   \n   \nI'll be back\n\n"
    },
    {
      "time": "9 Sep 2003 — 8:01pm",
      "content": "I'm back, finally. Between Kai, my 1 yr old, and progressing on some of those projects that pay the bills, I haven't had much time to focus on Creative Squeeze.   \n   \nThe following concepts explore the \"Q-drop\" that was initiated in my last round from the concept where I embarrassingly left out the \"U\" in SQUEEZE. So I won't be winning any spelling bee's, but hopefully one of these concepts will take me into a direction that is acceptable at all necessary levels.   \n   \nI am personally leaning toward the Clarendon logo, as the \"Q\" has some fun personality while the logo in its entirety maintains corporate appeal\n\n"
    },
    {
      "time": "9 Sep 2003 — 10:47pm",
      "content": "I like the Clarendon too, maybe because it looks like a lot can be squeezed out of it! But the tail/drop in the second Cochin one is much better than the inside/outside tail in the native Clarendon \"Q\".   \n   \nhhp\n\n"
    },
    {
      "time": "9 Sep 2003 — 11:08pm",
      "content": "The yellow Q between the other brown letters seems a little small, especially on the second Cochin (who's droptail I like very much). The size of the Q is not so bad on the Clarendon version, but it still looks sorta short.\n\n"
    },
    {
      "time": "10 Sep 2003 — 7:30am",
      "content": "\"where I embarrassingly left out the \"U\" in SQUEEZE\"   \n   \nYou know, I went back to look at that and I   \nactually like it. It's certainly an interesting   \nway to make the name a tad more unique. Perhaps   \nit's needed (less someone pronounces it skeez)   \nbut, maybe not.   \n   \nI like the clarendon too, but prefer the original drop implementation (with a hollow 'o' shape).\n\n"
    },
    {
      "time": "10 Sep 2003 — 12:29pm",
      "content": "Yes, Darrel, I wish I could've said that I had intentionally left the \"U\" out of SQUEEZE\n\n"
    },
    {
      "time": "10 Sep 2003 — 12:45pm",
      "content": "I don't see any tongues.   \n   \nI like the middle one.   \n   \nBTW, you're getting some scaling artifacts, most visible around the diagonals. Are you working from an 8-bit-color original?   \n   \nhhp\n\n"
    },
    {
      "time": "10 Sep 2003 — 1:25pm",
      "content": "Yep. The middle one.   \n   \nNot so sure about the brown, but colors are highly subjective...\n\n"
    },
    {
      "time": "11 Sep 2003 — 5:13am",
      "content": "Another subjective thought Scott, I am not sure about that uncoated brown for the logo either. I like the way it works with orange in text \"pms 130 uncoated (deep dirt brown)\" but for the logo I see it too much deep dirt brown (\n\n"
    },
    {
      "time": "11 Sep 2003 — 8:05am",
      "content": "You guys just gave me an idea:   \nEvery font should have an \"optimal\" color associated with it.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Sep 2003 — 9:16am",
      "content": "Have you thought of using photography or 3d modelling to produce the Q?\n\n"
    },
    {
      "time": "11 Sep 2003 — 9:16am",
      "content": "Have you thought of using photography or 3d modelling to produce the Q?\n\n"
    },
    {
      "time": "11 Sep 2003 — 9:28am",
      "content": "i agree with everyone on the solution in the middle.   \n   \nClarendon is a great choice, but highly overused these days. for alternatives you might wanna try EF Volta (from Elsner + Flake),   \nOxtail by Stefan Hattenbach (PsyOps) or the daring new Farao by Peter Bruhn/Fountain, currently exclusively available at Veer.   \nit's sort of 'grungy', but has a great 'E'.   \n   \nsimon\n\n"
    },
    {
      "time": "11 Sep 2003 — 12:03pm",
      "content": "\\> You guys just gave me an idea:   \nEvery font should have an \"optimal\" color associated with it.   \n   \nNot necessarily, I think it also has to do with the theme.   \nThat orange (almost a warm yellow) with the brown I don't see it for Creative Squeeze Studio, if we were dealing with another kind of business: coffe, wood, lawyers, maybe, and the brown, with the claredon and a long name is very present.   \n   \nBut yes, I think that sometimes some colors fits better than others on a particular type, sometimes for visual reasons (it is hard to use yellow with thin type) and sometimes for other reasons like the shapes of the type, in a general way I think I prefer a green flashy clarendon than a trajan.   \n   \nI think it is the same with other things, the cars for example, if you could buy a Ferrari, would you chose a dark blue? I don't think so, even if you were an old minister your doubt would be red, maybe yellow, the dark blue for the Jaguar. The submarines are a special case, I like yellow for them.\n\n"
    },
    {
      "time": "11 Sep 2003 — 12:57pm",
      "content": "hhp: I think you may be onto something\n\n"
    },
    {
      "time": "11 Sep 2003 — 10:52pm",
      "content": "Wheeew\n\n"
    },
    {
      "time": "12 Sep 2003 — 4:44am",
      "content": "Nice. I personally love the Q-drop. Is it the highlight that is bothering you? What if it was round and slightly larger? This might help it at smaller sizes. I vote YES to the citrus and Spree colors. Your card looks edible!   \n   \nI like the idea of the back, but there is something a little awkward about it. Perhaps it needs a \"splat\" of freshly squeezed juice instead? A juice glass? An orange seed?... I better quit now...\n\n"
    },
    {
      "time": "12 Sep 2003 — 7:55am",
      "content": "Scott,   \n   \nmost of the time - i find it hard to write or to say a word about logos. the main reason: lack of info.   \n   \ni don't see the whole process. i don't see the thumbnails. most of the time - i just see the result (very important: not just with your sample).   \n   \nyou have great name. and the idea with Q is also great.   \n   \nthe only problem - the typeface. a logo is its own typeface, in my opinion. that is to say - the typeface (e.g. clarendon) is only a guide. if you want, of course, to set your logo - apart from its competition.   \n   \nthat is to say: to play with the proportion, weight, spacing.....   \n   \n...to re-interpret anew. that is a logotype.   \n   \n ![:-)](http://web.archive.org/web/20150417143228im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nDavid Hamuel   \n   \n   \np.s.   \n   \nwho said - an esay job? ![:-)](http://web.archive.org/web/20150417143228im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "12 Sep 2003 — 8:14am",
      "content": "Scott,   \n   \nI'm not sure I agree with Fredrik's analyses. I believe the beauty of your solution lies in it's simplicity. I also don't really think a logo needs to be a customized font in all instances. I think your choices are completely appropriate.   \n   \nI believe that you can tie any loose ends together by providing a tag such as you did: \"Freshly squeezed every time.\" Or perhaps something in reference to \"creative juices\"?\n\n"
    },
    {
      "time": "12 Sep 2003 — 9:43am",
      "content": "Thank you all for your intelligent and expert advice throughout this process. The crew at Typophile has supplied us with an excellent tool to sharpen our eyes and work. As of last night I have commited my business to the Clarendon logo with the \"Q-drop\", leaving room only for minor alterations. Today, I will make any final adjustments and continue working on the Creative Squeeze stationary suite. Any last suggestions are welcome, but for now I'll address these last critiques:   \n   \nFredrik and David: Yes, David, over the last 3-4 weeks there has been a great deal of time spent with pen and paper exploring multiple directions. As far as type selection is concerned\n\n"
    },
    {
      "time": "12 Sep 2003 — 9:45am",
      "content": "I think it's great. As for the typeface, I agree, in theory, that it's always nice to use custom type as it just makes the logo mark that more unique, but, in this case, it is the '0' that's the mark and is what allows it to stand apart.   \n   \nI much prefer the bottom colors...brown is such a tough color to pull off.   \n   \nAs for the back of the cards, will that be a die-cut? I like the idea, but I'm not sure if I like the exact same drop on both sides. It might be a bit more clever to use a different type of treatment on the back.\n\n"
    },
    {
      "time": "12 Sep 2003 — 10:01am",
      "content": "I would:   \n- Tighten the \"IVE\" and loosen the \"EEZE\".   \n- Lower the \"@\" in the email address.   \n- Raise the curly braces around the phone area code.   \n- Work on the kerning in the phone number.   \n- Replace the period after \"\n\n"
    },
    {
      "time": "12 Sep 2003 — 10:12am",
      "content": "I didn't realize it was a die cut. It makes much more sense to me now.   \n   \nBe sure to print lots of overs on the card. Your printer is going to be pulling his hair out trying to register with your Q. I have an embossed card for my business, and let me tell you, it was no picnic trying to register it with a surrounding color.   \n   \nThe only critical thoughts on the card would be that the \"EEZE\" seems a bit tight. I might also bring the size of the fonts down for the name and address. Although that may not be a good idea considering the color.   \n   \nGreat work!\n\n"
    },
    {
      "time": "12 Sep 2003 — 10:15am",
      "content": "Haha. Hrant beat me to the EEZE!\n\n"
    },
    {
      "time": "12 Sep 2003 — 10:53am",
      "content": "Scott, another So.cal typophile! For some reason I thought you   \nwere based in Hawaii\\*. ![:-)](http://web.archive.org/web/20150417143228im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI really like the overall tone of this critique and your presentation   \nhas been consistent and professional. Kudos!   \n   \nThe question of \"custom\" vs. \"stock\" typefaces for logos and   \ntrademarks has come up a few times at typophile, and I always   \nroot for the custom angle. I'd agree with David to maybe examine   \nthe letters again.   \n   \nsome places that could be customized....dunno how they'd look.   \n   \n\\* subst. unicase 'e' or 'r' or 'a' for UC ones.   \n\\* look at different forms of UC A.   \n\\* drop the tail on the UC R below the baseline   \n or maybe create a new tail.   \n\\* see how letters look without serifs or with semi-serifs.   \n\\* could the drop shape work as a counter someplace else.   \n   \nBut...   \n   \nI think you said upthread that your clients were suits...if so, I think   \nyou can stick with Clarendon, the custom Q, and be comfortable.   \nIf you were going after a different demographic, then Fredrik's point would be stronger.   \n   \nJust my opinion.   \n   \n   \n\\> BTW, from what I know a copyright notice is technically   \ninvalid without the name of the owner following the year.   \n   \nI've never heard that...my understanding is that   \na simple copyright\n\n"
    },
    {
      "time": "12 Sep 2003 — 11:07am",
      "content": "BJ, normally I would advise customization too, but in this case Scott seems to want to express some support for the integrity of Clarendon as a font. This is as interesting and commendable as it is subtle.   \n   \n\\> I would omit the\n\n"
    },
    {
      "time": "12 Sep 2003 — 11:26am",
      "content": "I just wanted to say that I really like this, Scott.   \n   \n_I would omit the_\n\n"
    },
    {
      "time": "12 Sep 2003 — 11:57am",
      "content": "(moved to other thread) Sorry.\n\n"
    },
    {
      "time": "3 Sep 2003 — 3:43pm",
      "content": "Just a quick piece of feedback - I prefer the double \"ee\" in \"Squeeze\" highlighted, while Creative stands alone. Plucking out letters from both words is too symmetrical and dilutes the concept.   \n   \nI would also add that I think the literal route is not the best avenue to explore- you are doing a good job of bringing in the \"citrus\" concept simply by your color selection.   \n   \nMaybe I missed it, but did you manipulate the Q? It looks smaller than the other letters- how does it look with a proper descending tail?   \n   \njb\n\n"
    },
    {
      "time": "4 Sep 2003 — 2:51pm",
      "content": "The last one is so clever. Do more thumbnails and roughs. Have you tried to stack it? (Don't forget to add the \"U\" this time). Maybe stacked, there is some way to incorporate the drop (or drip) on a larger scale??\n\n"
    }
  ]
}
