{
  "id": "112979",
  "title": "typography in movies",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi. i'm currently completing research on typography in movies  \nI'm searching for movies that have text in scenes with particular attention to typography styles.  \nAs an example i'm thinking about something like Stranger then Fiction or Wes Anderson movies.  \nDo you have any suggestions ?  \nThanks\n\n",
  "author": "vcr",
  "time": "1 Feb 2014 — 5:33pm",
  "uid": "217346",
  "comments": [
    {
      "time": "1 Feb 2014 — 6:17pm",
      "content": "Not sure exactly what you're looking for, but here's a scene from Steven Spielberg's movie \"Artificial Intelligence\" in which a poem in an distinctive font was important to the plot.\n\n ![](http://web.archive.org/web/20150423013632im_/http:/typophile.com/files/a_3733.i..jpg)\n\nA video clip (with captions for some reason) which shows the same poem at a different point in the movie is at  \n [https://www.youtube.com/watch?v=YUUs7ezHmfk](http://web.archive.org/web/20150423013632/https:/www.youtube.com/watch?v=YUUs7ezHmfk \"https://www.youtube.com/watch?v=YUUs7ezHmfk\")\n\n"
    },
    {
      "time": "1 Feb 2014 — 6:51pm",
      "content": "Two comments:\n\n1. That poem is incorrect; the line is \"to the waters _and_ the wild\"; \"faery\" is misspelled; the last two lines should be one; and the first line ends in an exclamation point. (William Butler Yeats, \"The Stolen Child\")\n\n2. The font is Mona Lisa.\n\n"
    },
    {
      "time": "1 Feb 2014 — 7:25pm",
      "content": "My guess is they wanted a contemporary spelling for \"fairy\", and the line break was changed to make lines similar lengths, but no idea why \"and\" was changed to \"of\".\n\nThis was originally a Stanley Kubrick project, but after Kubrick died it was taken over by Spielberg (Kubrick had previously talked about letting Spielberg direct it). Perhaps \"of\" was a typo in the script and Spielberg didn't want to correct it in case it a deliberate change by Kubrick.\n\nThanks for the font ID; I wondered what it was.\n\n"
    },
    {
      "time": "1 Feb 2014 — 8:53pm",
      "content": "I wonder if Stanley Kubrick chose Mona Lisa? The digital font was released in 1991. He died in 1999. The hard edges and formal structure of this Art Deco serif design -- tall, thin and very regular -- suggest a futuristic cold spirituality rather than joy or human warmth. A good fit for this rather depressing movie.  \nDon\n\n"
    },
    {
      "time": "2 Feb 2014 — 8:50pm",
      "content": "This older discussion may be of interest: [http://www.typophile.com/node/36404](http://web.archive.org/web/20150423013632/http:/www.typophile.com/node/36404 \"http://www.typophile.com/node/36404\")\n\n"
    },
    {
      "time": "2 Feb 2014 — 9:00pm",
      "content": "Papyrus as subtitle style in Avatar was roundly dissed by typographistas.\n\n"
    },
    {
      "time": "2 Feb 2014 — 10:15pm",
      "content": "The Avatar insult was compounded by the fact that Cameron spent $100K to have a language invented. For that price he could have had a custom font _and_ a custom writing system!\n\nOn a much more modest scale, yours truly was commissioned to make a custom font for an upcoming British horror movie: [https://pbs.twimg.com/media/BY5uBRXCUAAsw78.jpg:large](http://web.archive.org/web/20150423013632/https:/pbs.twimg.com/media/BY5uBRXCUAAsw78.jpg:large \"https://pbs.twimg.com/media/BY5uBRXCUAAsw78.jpg:large\")\n\nhhp\n\n"
    },
    {
      "time": "4 Feb 2014 — 1:22am",
      "content": "I always wanted to read an article about the type used in silent movies, specially after watching 2011's \"The Artist\" but all I ever found were notes about how historically inacurate the Artist's type choices were. What exaclty is your research gonna be about Victoria?\n\n"
    },
    {
      "time": "4 Feb 2014 — 8:25am",
      "content": "IIRC David Berlow\\* once did research on silent movie lettering; there might even be an article by him somewhere.\n\n\\* [http://typophile.com/user/2969](http://web.archive.org/web/20150423013632/http:/typophile.com/user/2969 \"http://typophile.com/user/2969\")\n\nhhp\n\n"
    },
    {
      "time": "6 Feb 2014 — 11:01am",
      "content": "might be something here you can use:  \n [http://fontsinuse.com/in/1/industries/70/film-and-television](http://web.archive.org/web/20150423013632/http:/fontsinuse.com/in/1/industries/70/film-and-television \"http://fontsinuse.com/in/1/industries/70/film-and-television\")  \n [http://fontsinuse.com/in/2/formats/15/film-video](http://web.archive.org/web/20150423013632/http:/fontsinuse.com/in/2/formats/15/film-video \"http://fontsinuse.com/in/2/formats/15/film-video\")\n\nThe Star Wars crawl might be closer to type of research your looking for:  \n [http://alphabettenthletter.blogspot.ca/2013/05/anatomy-of-logo-star-wars...](http://web.archive.org/web/20150423013632/http:/alphabettenthletter.blogspot.ca/2013/05/anatomy-of-logo-star-wars.html \"http://alphabettenthletter.blogspot.ca/2013/05/anatomy-of-logo-star-wars.html\")\n\n"
    },
    {
      "time": "6 Feb 2014 — 11:59am",
      "content": "Thanks everyone this is great!\n\n"
    },
    {
      "time": "6 Feb 2014 — 12:01pm",
      "content": "Hey Alvaroefe,  \nmy research will be an observation of typographie in movies starting by silent movie until now (hypermodernity). Mainly is a tougth about how design influence movies trew history. I'm still searching a lot since their is not a lot of informations about it, if i find a good article i'll let you know !\n\n"
    },
    {
      "time": "7 Feb 2014 — 1:42am",
      "content": "Merci beaucoup Victoria! J'aimerai bien de lire ton travail quand il-est finie :-)\n\nHrant, thanks for the link and the reference, found some rather interesting things, found no article but it's already a nice place to start looking when I've got time.\n\n"
    },
    {
      "time": "7 Feb 2014 — 8:06am",
      "content": "If you're interested in title sequences you might check out the opening credits for some of Hitchcock's movies, such as North by Northwest [https://www.youtube.com/watch?v=jIlqatMQSgI](http://web.archive.org/web/20150423013632/https:/www.youtube.com/watch?v=jIlqatMQSgI \"https://www.youtube.com/watch?v=jIlqatMQSgI\") and Psycho [https://www.youtube.com/watch?v=Tek8QmKRODw](http://web.archive.org/web/20150423013632/https:/www.youtube.com/watch?v=Tek8QmKRODw \"https://www.youtube.com/watch?v=Tek8QmKRODw\")\n\nAnother famous one is the crawling text in Star Wars, which Lucas said was inspired by early science fiction movies like Flash Gordon.\n\n"
    },
    {
      "time": "10 Feb 2014 — 7:54am",
      "content": "I would have thought of Piranesi - or Typo Roman - upon seeing the typeface from A. I..\n\n"
    },
    {
      "time": "15 Feb 2014 — 3:05pm",
      "content": "I just watched a sci-fi movie, \"the Abyss\" (1989) and at the last 20 minutes or so, LCD fonts are prominant and playing a critical part to the ending of the movie.\n\n"
    },
    {
      "time": "15 Feb 2014 — 4:13pm",
      "content": "Some fonts do not age well. Technology changes. LCD was great for a 1980s movie to show the cutting edge of technology. Today it is beginning to look increasingly quaint. Same for OCR shaped fonts -- so 70s. For a movie maker who wants a film to continue to communicate with people for many years into the future tried and tested works well. Consider Windsor in Woody Allen's movies, or Bernhard Modern in Downton Abby. Might be something of interest in [http://fontmeme.com/movie-fonts/](http://web.archive.org/web/20150423013632/http:/fontmeme.com/movie-fonts/ \"http://fontmeme.com/movie-fonts/\")  \nApologies Victoria, for having strayed from fonts in scenes to fonts in titling, but the thread was already drifting in that direction :( Perhaps a typophile is prepared to put us back on track.  \nDon\n\n"
    },
    {
      "time": "15 Feb 2014 — 10:03pm",
      "content": "The green LCD waterfall fonts in \"The Matrix\" might be what you're looking for too.\n\n"
    },
    {
      "time": "16 Feb 2014 — 4:22am",
      "content": "A new site, exploring the typography of classic sci-fi movies: [http://typesetinthefuture.com](http://web.archive.org/web/20150423013632/http:/typesetinthefuture.com/ \"http://typesetinthefuture.com\")\n\nVery entertaining and enlightening!\n\n"
    },
    {
      "time": "16 Feb 2014 — 9:58am",
      "content": "Another idea -- if you haven't done so already, go to your library and ask a reference librarian to help you research the topic. They maybe be able to help you find books or magazine articles on the topic.\n\nFor example, there are some movie magazines (not fan magazines) that discuss technical aspects of filmmaking and possibly a back issue touches on this topic. Also maybe some graphic design magazines (Graphis, etc) discuss it in a back issue.\n\n"
    },
    {
      "time": "22 Jun 2014 — 9:28am",
      "content": "I am agree with you . this is very informative post . I like it very much. [Sindhi Culture](http://web.archive.org/web/20150423013632/http:/www.pknation.info/culture/sindhi-culture)\n\n"
    }
  ]
}
