{
  "id": "112944",
  "title": "Students: Use Good Fonts Well.",
  "forum": "amyp's blog",
  "tags": [
    "Students",
    "Type choices",
    "typography"
  ],
  "content": "As a design student, I’m sure you’ve opened up FontBook or the InDesign font menu and scrolled all the way down to Zapfino before realizing that none of the fonts on your computer quite match the fluffy type visions in your mind. So then you head over to a wretched site like dafont.com, only to be confronted with an infinite number of terrible choices. What do you do next?\n\n ![](http://web.archive.org/web/20150317214810im_/http:/typophile.com/files/feather_fytd_5745.jpg)\n  \n_source: [http://fuckyeahtypefacedesign.tumblr.com/post/61475663645/theyre-plume-crazy](http://web.archive.org/web/20150317214810/http:/fuckyeahtypefacedesign.tumblr.com/post/61475663645/theyre-plume-crazy)_\n\nAs graphic design and typography instructors, we don’t do a good enough job of showing you Places to Get Good Fonts. We don’t put enough emphasis on the fact that PEOPLE actually make fonts (not trolls in a machine) and that purchasing licenses to good typefaces is an INVESTMENT. Like that shiny degree you’ll soon be cradling, or the latest laptop you’re holding out for as a graduation present, it’s an investment into your burgeoning career. And folks: every time you steal a font, a [pegasus loses its wings](http://web.archive.org/web/20150317214810/http:/vimeo.com/41758172).\n\nSo, where do you start? We know you’re on a budget. We know that you don’t have $1000 to shell out on some crazy huge type family with black italic small cap tabular numerals.\n\n ![](http://web.archive.org/web/20150317214810im_/http:/typophile.com/files/smallcaps_fytd_5441.png)\n  \n_source: [http://fuckyeahtypefacedesign.tumblr.com/post/42194908473/italic-smallcaps-tab-numerals-anonymously](http://web.archive.org/web/20150317214810/http:/fuckyeahtypefacedesign.tumblr.com/post/42194908473/italic-smallcaps-tab-numerals-anonymously)_\n\nHold your x-height high, young typographer, and take control of your typeface decisions! The following is not an exhaustive listing of every type foundry or worthy site, but perhaps it provides you with some good places to begin your font-astic journey:\n\n[Myfonts.com](http://web.archive.org/web/20150317214810/http:/www.myfonts.com/ \"MyFonts\"): MyFonts is one of the largest collection of fonts. Both large and small foundries sell their fonts here, so the price range, and quality, varies greatly. I suggest subscribing to the [MyFonts newsletter](http://web.archive.org/web/20150317214810/http:/www.myfonts.com/newsletters/) where your already bursting inbox will be greeted by a pleasant interview with a type designer and some lovely type specimens each month. The [Special Offers](http://web.archive.org/web/20150317214810/http:/www.myfonts.com/specials/)page occasionally features some amazing deals, but remember, you’re looking for quality, something you can keep in your toolbox and use again.\n\n[Typedia.com](http://web.archive.org/web/20150317214810/http:/typedia.com/blog/): Do yourself a favor and follow [@typedia](http://web.archive.org/web/20150317214810/https:/twitter.com/typedia) to get the skinny on good quality, freshly released typefaces. Many of these featured designs are also competitively priced and the roundup occasionally includes good deals. If you think $29 is too much for one weight of a good typeface, then I ask you, what did you last spend $29 on? If you say a trendy striped sweater from Century 21 then we’re breaking up.\n\n[FontShop](http://web.archive.org/web/20150317214810/http:/www.fontshop.com/) [: A huge library of high-quality fonts, you could loose a few hours or your life clicking through pages of their type specimens. Their](http://web.archive.org/) [goodies page](http://web.archive.org/web/20150317214810/https:/www.fontfont.com/free) is also worth mentioning, as is the amazing [FontBook App](http://web.archive.org/web/20150317214810/https:/itunes.apple.com/app/id448250130?ls=1&mt=8), available for the iPad.\n\n[Typographica](http://web.archive.org/web/20150317214810/http:/www.typographica.org/): a wonderful type resource, their yearly favorites postings offer a curated selection of new typefaces. Since the site has been around for close to ten years (more?), their [past posts](http://web.archive.org/web/20150317214810/http:/typographica.org/category/on-typography/) are worthy of an afternoon of procrastin-- I mean, research.\n\n[Fonts in Use](http://web.archive.org/web/20150317214810/http:/fontsinuse.com/): An excellent resource for students, this growing archive allows you see fonts in action! Registered users are also able to add their own examples and the ability to search by industries, formats and typefaces also makes this a useful research tool.\n\n**Lettering or script-inspired**  \nIf you’re looking for a font that is inspired by hand lettering, here are a few places to start drooling:\n\n[Positype](http://web.archive.org/web/20150317214810/http:/positype.com/): I don’t know what cereal Neil Summerour eats for breakfast, but whatever it is, I hope his fonts are on the box.  \n [Sudtipos](http://web.archive.org/web/20150317214810/http:/sudtipos.com/home): Ale Paul’s fonts are already probably ON your cereal box, if you’re lucky. Many of his fonts come with an insane amount of ligatures, which, when used by a Jedi master like yourself, can bring the type to life.  \n [Laura Worthington](http://web.archive.org/web/20150317214810/http:/lauraworthingtontype.com/type/) is another lettering artist and type designer whose type has all of the swashy goodies AND is quite affordable.  \n [P22:](http://web.archive.org/web/20150317214810/https:/p22.com/) Not specifically hand lettering-inspired type, but P22’s collection spans the gamut of text and display faces, many of which are inspired by specific historical periods or art trends.  \n [Font Bros:](http://web.archive.org/web/20150317214810/http:/www.fontbros.com/) The quality for extended language support / OpenType goodies might vary but there’s plenty of choices here and generally affordable.\n\n**Text faces**  \nIf you’re looking for good text faces, faces that you can use in your resume to [make you look smart](http://web.archive.org/web/20150317214810/http:/amypapaelias.com/youarewhatyoukern.html) or in a text-heavy publication, here are a few foundries worth checking out (many of them sell their fonts directly on their site or via other portals like MyFonts or FontShop):\n\n[TypeTogether](http://web.archive.org/web/20150317214810/http:/www.type-together.com/): TypeTogether’s text faces are addictive. Their [Freebies](http://web.archive.org/web/20150317214810/http:/www.type-together.com/freebies) page draws you in with a sip from a few of their families, and pretty soon, you’re just drunk on the stuff.  \n [Typotheque](http://web.archive.org/web/20150317214810/https:/www.typotheque.com/): You can probably never go wrong here. Typotheque is home to many a super-family (Fedra, Greta) but they'll come at a heftier cost. [Articles](http://web.archive.org/web/20150317214810/https:/www.typotheque.com/articles) on design and typography are worth a visit to the site regardless of your budget.  \n [OkayType](http://web.archive.org/web/20150317214810/http:/okaytype.com/): Type designer and letterer Jackson Cavanaugh sports only a few lovely type families, but you should be familiar with his [web type specimen for Harriet](http://web.archive.org/web/20150317214810/http:/www.theharrietseries.com/), a game changer for how web type specimens will / should exist, IMHO.  \n [HvD Fonts](http://web.archive.org/web/20150317214810/http:/www.hvdfonts.com/): A nice collection of text faces, mostly sans, some free ones too (but, you get what you pay for).\n\n**Open Source Fonts**  \n [Google fonts](http://web.archive.org/web/20150317214810/http:/www.google.com/fonts): Like a greedy kid tearing open the Halloween candy bag after a night of trick-or-treating, Google fonts would seem to satiate every font geek’s desires. However, typographer-lawyer Michael Butterick [raises some important about questions](http://web.archive.org/web/20150317214810/http:/typographyforlawyers.com/why-google-web-fonts-arent-really-open-source.html) about the validity of Google’s fonts as “open-source”.  \n [League of Moveable Type](http://web.archive.org/web/20150317214810/https:/www.theleagueofmoveabletype.com/): A manifesto, a revolution, The League of Moveable Type is on a mission to provide quality, open-source fonts. A good collection but like the coolest, unsigned, hipstery, shoegaze, post-rock underground band, you’re probably not the first one to discover them.\n\n ![](http://web.archive.org/web/20150317214810im_/http:/typophile.com/files/ampersand_fytd_4546.jpg)\n  \n_source: [http://fuckyeahtypefacedesign.tumblr.com/post/67465958701](http://web.archive.org/web/20150317214810/http:/fuckyeahtypefacedesign.tumblr.com/post/67465958701)_\n\n**A mention about web fonts**  \nUnless it’s 1995 and you’re rockin’ that grungy flannel shirt, you need web fonts! Consider the [myriad of options](http://web.archive.org/web/20150317214810/http:/web.appstorm.net/roundups/web-development/the-best-places-to-get-web-fonts-for-your-site/) for web font licensing: are these fonts available as part of a web font service with a monthly or yearly fee, are you charged per font use, or can they be embedded using @font-face? It’s best to understand the terms before you purchase a plan or use a free one.\n\nHopefully this serves as a good place to begin your typographic odyssey. Choosing fonts is a lot like dating or winter coat shopping: you’ll need to try on a few options before finding one that’s just right. And sometimes, the journey is more important than the destination. Happy type trails!\n\n_NOTE: This post was originally published on my course blog but I decided it would work for a wider audience on Typophile, too. It is intended for students and novices, no eye-rolling allowed, type nerds!_\n\n",
  "author": "amyp",
  "time": "31 Jan 2014 — 8:03am",
  "uid": "5664",
  "comments": [
    {
      "time": "12 Jan 2015 — 4:56am",
      "content": "this blog is really nice, which helps for the students An excellent resource for students, this growing archive allows you see fonts in action.  \n [learn German](http://web.archive.org/web/20150317214810/http:/languagecentre.net.au/)\n\n"
    }
  ]
}
