{
  "id": "113",
  "title": "Attn Mr. Hrant",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I read in a short bio of you, that you did not have a formal education in graphic design. Did I misread this?   \nMore to the point:   \nIf this is true, how did you become so interested in the study of type? just curious.\n\n",
  "author": "anonymous",
  "time": "5 Apr 2002 — 3:48pm",
  "uid": "1203",
  "comments": [
    {
      "time": "5 Apr 2002 — 4:52pm",
      "content": "But I'm \\*still\\* trying to displace that darn Indian musician.   \n   \n [http://www.google.com/search?hl=en&q=hrant](http://web.archive.org/web/20131107164811/http:/www.google.com/search?hl=en&q=hrant)   \n   \nhhp\n\n"
    },
    {
      "time": "5 Apr 2002 — 5:54pm",
      "content": "Wait a second, he's an Armenian 'ood player! Cool.   \nHave you guys ever heard a 'ood? An amazing sound - one could call it the manly uncle of the guitar.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Apr 2002 — 6:24pm",
      "content": "okay, so apparently no one has decided to take my question seriously. I thought it would be very interesting to know how people become interested in type, especially someone who didn't come from a formal design education.\n\n"
    },
    {
      "time": "5 Apr 2002 — 8:39pm",
      "content": "I for one plan on replying - in the other thread - soon.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Apr 2002 — 6:26pm",
      "content": "I took a typography class taught by Joe Kral of [Test Pilot Collective](http://web.archive.org/www.testpilotcollective.com). I had already started to build my own fonts, but they all sucked. (For instance, I took the Apple font \"Techno\" and added bumps to it.)   \n   \nI was very inspired by this class and redoubled my efforts.\n\n"
    },
    {
      "time": "6 Apr 2002 — 7:33pm",
      "content": "question. why should one need to have formal education in design to be interested in type.   \nI for one find it very exciting and know dozen of designers that feel the same way without formal education in design. Hey how about David Carson, and Tim Girvin, both with no formal education in design. Typography is for everyone willing to explore it formally educated in design or not.\n\n"
    },
    {
      "time": "6 Apr 2002 — 7:51pm",
      "content": "I'm not a type designer, yet. But I've been   \nconsumed by letterforms ever since my pre-teen   \nyouth, staring at the hymn book type during   \nboring hours of church.   \n   \nJohn - Where does Joe Kral teach? I ran into   \nhim at TypeCon2001. I get the feeling he'd be   \na very hip and tolerable mentor.   \n   \nStephen\n\n"
    },
    {
      "time": "6 Apr 2002 — 8:30pm",
      "content": "\\> why should one need to have formal education in design to be interested in type.   \n   \nNot to be interested. But formal education does have its advantages.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2002 — 5:48am",
      "content": "Stephen -- when Joe lived in Minneapolis he taught a few type classes at [Brainco -- the Minneapolis School of Advertising](http://web.archive.org/web/20131107164811/http:/www.braincomsa.com/), which I attended. I'm not sure if he has taught since moving to San Francisco.   \n   \nBut he was definitely very knowledgable, very passionate about type. TPC hasn't done much new stuff lately so I hope he hasn't burned out on it.\n\n"
    },
    {
      "time": "8 Apr 2002 — 8:43am",
      "content": "thank you all for the insight. i was simply curious about this, as it was hard for me to imagine people coming in contact with typography without being a design student at one time. i, myself, used to practice my handwriting skills to the point of abusurdity as a child ... i think that i was always obsessed with the perfection of letterforms.   \n   \ni have not yet taken on the task of creating my own typeface, but it is my dream to do so. i appreciate the positive environment that this board/site provides for seasoned and novice typophiles, and look forward to presenting my work here for you as well.\n\n"
    },
    {
      "time": "8 Apr 2002 — 9:16am",
      "content": "\\> Stephen -- when Joe lived in Minneapolis he taught a few type classes at Brainco -- the Minneapolis School of Advertising, which I attended. I'm not sure if he has taught since moving to San Francisco.   \n   \nJohn,   \nAre you still in Minneapolis? I just moved here myself from Honolulu (I know, what was I thinking).\n\n"
    },
    {
      "time": "5 Apr 2002 — 3:58pm",
      "content": "Oh c'mon now, Hrant- don't be so modest! We all know that it'll end being about you no matter what ![:)](http://web.archive.org/web/20131107164811im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n:wink:   \n   \nI was interested to see that the first four pages of links from Google all refer every link to our very own hhp. Is there any other name in the type community that can beat that?   \n   \njb\n\n"
    },
    {
      "time": "5 Apr 2002 — 4:01pm",
      "content": "Didn't mean to stick you out like a sore thumb. Let us make it a general discussion then:   \n   \nHow were you introduced to typography?\n\n"
    },
    {
      "time": "5 Apr 2002 — 4:48pm",
      "content": "Google search:   \n   \nJonathan Hoefler, 13 solid pages of links.   \n   \nCan anyone beat it?\n\n"
    },
    {
      "time": "6 Apr 2002 — 12:36pm",
      "content": "Eric Gill, 84 pages (no, I didn't check every one was \\*the\\* Eric Gill).\n\n"
    },
    {
      "time": "7 Apr 2002 — 11:12am",
      "content": "I don't believe there are very many people who have had a \"formal education\" in type design. Most just seem to learn through their own mistakes, and a little helping hand from others.   \n   \nOf the people on this board you may find it significant that Jonathan Hoefler has no formal design education.   \n   \n [http://www.typography.com/profile/index.html](http://web.archive.org/web/20131107164811/http:/www.typography.com/profile/index.html)\n\n"
    },
    {
      "time": "7 Apr 2002 — 11:38am",
      "content": "I agree. It's really a factor of what passion your pour into it. Although I have a formal graphic design education, I formed this board to better my understanding of type design, which (besides an emphasis on classic Typography) was not covered at the university.   \n   \nI figure we all have things we can share, and we all can stand to learn more, even if it is only another person's methodology or point of view.\n\n"
    },
    {
      "time": "5 Apr 2002 — 3:51pm",
      "content": "Would you mind instead starting a non-Hrant-specific thread about \"how we got started\"? I think it would be very interesting, especially if it contained more than just how it happened to me! :-)   \n   \nhhp\n\n"
    }
  ]
}
