{
  "id": "113356",
  "title": "1846 Alabama tombstone inscription",
  "forum": "Home",
  "tags": [
    "Serif"
  ],
  "content": "Hi. My main motive in identifying this font is because to me it looks like this tombstone states that my 5X-great-grandfather, Samuel Curtis, lived to be 93 years old, but every genealogical website I've found says he lived to be 95, and I'm assuming that's based on his tombstone. If you look closely at his age, the 2nd digit appears to be a flat-top three (like Typewriter font), with the top part being connected to the bottom part at the RIGHT, not the left as a 5 would be. So I'd like to know, based on the actual font, is it a 3 or a 5 because that would change his year of birth from 1751 to 1753.\n\nI've tried to search for this font all over the internet and used several identification sites to no avail. And I searched other graves in that same cemetery to see how 3's & 5's look, but there were none like it ( [http://www.findagrave.com/cgi-bin/fg.cgi?page=pv&GRid=59079185&PIpi=3342...](http://web.archive.org/web/20140405003802/http:/www.findagrave.com/cgi-bin/fg.cgi?page=pv&GRid=59079185&PIpi=33425931 \"http://www.findagrave.com/cgi-bin/fg.cgi?page=pv&GRid=59079185&PIpi=33425931\")). Does anyone have any clues? THANKS!!\n\n- R.J. Heddins (Lindale, TX)\n\n| Attachment | Size |\n| --- | --- |\n| [SamuelCurtis-grave.jpg](http://web.archive.org/web/20140405003802/http:/typophile.com/files/SamuelCurtis-grave.jpg) | 239.75 KB |\n\n",
  "author": "RJHeddins",
  "time": "2 Feb 2014 — 8:30pm",
  "uid": "217373",
  "comments": [
    {
      "time": "2 Feb 2014 — 9:54pm",
      "content": "The tombstone has high contrast heavy Didot letters, a style that was popular in the 1840s. It was also used on European street signs and is shown in Strasse, a digital font from H&FJ:\n\n ![](http://web.archive.org/web/20140405003802im_/http:/typophile.com/files/Strasse_5179.jpg)\n  \nIn this example the top stroke on the 5 tapers upward on the rhs. I have seen the same thing in old books from the era.  \nThe hairlines from the top stroke to the curved stroke are far from conclusive, but I am inclinded to see this as a 3 rather than a 5.  \nDon \n"
    },
    {
      "time": "7 Feb 2014 — 9:08pm",
      "content": "Thanks very much for your input, Don. This Strasse \"3\" to me looks very close to the one on the tombstone that many have--in my opinion--mis-identified as a 5.  \nR.J.H.\n\n"
    }
  ]
}
