{
  "id": "1134",
  "title": "What do you guys think about caps???",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I have a client who's logo is rendered in all caps. That in itself is fine, but they also demand for the name be written in all caps all the time. So in body text when referring to the company name it has to be written as UNICON rather than Unicon.   \n   \nVisually it's not very functional. Seems too aggressive and undermines the strength of the overall visual identity system that I'm developing.   \n   \nDoes anyone have any thoughts on this issue? Have you ever dealt with this type of thing? What are some strong arguments to made for losing it?   \n   \nNathan\n\n",
  "author": "sativo",
  "time": "3 Sep 2003 — 9:51am",
  "uid": "2230",
  "comments": [
    {
      "time": "3 Sep 2003 — 9:54am",
      "content": "All caps settings have been proven harder to read. Perhaps thats a good approach?   \n   \nWould they be willing to let you use (real) small caps in type settings? It wont help with readability, but it'd be visually less offensive. Might help if the client is being a wee bugger and refusing to budge?\n\n"
    },
    {
      "time": "3 Sep 2003 — 10:17am",
      "content": "The logotype is a graphic, not text. That's the bottom line.   \n   \nI had this problem years ago, working for an organization that was changing its name & identity. The new logotype was all-lowercase. Everyone thought they had to write the org's name that way. I'm not sure why it was so hard to get them to understand the difference between the graphical treatment and the name itself, but it took a long time to get it to sink in. I stressed the difference between the logotype, which is a graphic (like a picture, I said), and the name itself. I pointed out Boeing's logotype, which is in all caps: when you refer to Boeing do you write BOEING? I even resorted to using the Coca-Cola logotype: If you refer to Coca-Cola, do you type it in red curly script? I think that last one finally helped.\n\n"
    },
    {
      "time": "3 Sep 2003 — 12:30pm",
      "content": "The mention of Adidas (is the name itself really supposed to be lc, like e.e. cummings?) reminds me: around the same time, I collected a bunch of all-lc logos and made a handout showing that lots of companies have that kind of logotype, but that names (i.e. proper nouns) are always written with initial caps and internal lc. If it would be useful, I'll see if I can dig it up.   \n   \nRe: small caps -- I don't know what kind of company Nathan's client is, but it's pretty doubtful that they'd be able to use small caps company-wide in all applications (that is, people writing or typing the company name, as opposed to printing the logo).\n\n"
    },
    {
      "time": "3 Sep 2003 — 1:38pm",
      "content": "Yep, small caps would pose a logistical problem. And would likely not be adapted company wide.   \n   \nI'm also not sure if visually I agree with any caps at all -- except in the logo.   \n   \nI like the readability point -- any hard data I can point to for that?   \n   \nAnother thing to consider is the headlines used in corporate literature. They use an endorsed brand architecture similar to that of redhat or adobe (ie. Adobe Illustrator, Adobe Photoshop, etc.)   \n   \nWhat you'll notice is the corporate signature is not integrated into the actual headline, but is used to sign the page. The headline is arranged with secondary type only so the corporate name is displayed with secondary type consistent with the product name.   \n   \nSometimes these branding architectures for headlines use a cascading model where you would also see a tagline.   \n   \nSo my problem is also in developing a consistent look that communicates things correctly. Having the company name as caps (i.e. UNICON Product) takes the focus away from the product. Which is not consistent with the brand architecture strategy they're going with.   \n   \nAny thoughts on this?\n\n"
    },
    {
      "time": "3 Sep 2003 — 1:49pm",
      "content": "This is actually one rare place where a unicase design (assuming we're really talking about a logo and not orthography) might work great. It would satisfy some of the \"UC envy\", but also force a clean break with the idea that the capitalization has to be the same in text (since a unicase would make that effectively impossible).   \n   \nAs for the lower readability of all-caps, there is empirical evidence all over the place, but it doesn't apply to a single word you have all the time in the world to read.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Sep 2003 — 2:52pm",
      "content": "Actually Hrant, if I'm understanding your nomenclature, we are talking about orthography not the logo. The logo is already in caps and that is fine.\n\n"
    },
    {
      "time": "3 Sep 2003 — 4:18pm",
      "content": "\\> we are talking about orthography   \n   \nThen I guess it's a branding issue, not a visual design one.   \n   \nWhat does all-caps say to the \"user\", and why is it bad (if it is) in this case?   \nIt doesn't matter if it's smallcaps or not - that's just typesetting.   \n   \n\\> Seems too aggressive and undermines the strength of the overall visual identity system that I'm developing.   \n   \nOr maybe your design isn't aggressive enough for them? If they like both, then they have to think about what they really like/need some more...   \n   \nhhp\n\n"
    },
    {
      "time": "3 Sep 2003 — 6:00pm",
      "content": "This confusion between the concepts of \"name\" and \"logotype\" seems common. I've even had clients who always tried writing their name in their logo font and colour (a la the Coca-Cola example), or even sticking their logo into bodies of text in place of a name! I keep reading, in magazines, designers who say that clients are \"getting smarter\". I don't think so.   \n   \nPart of the problem may be that logo/identity designers aren't providing logo _and_ editorial guidelines for new company names and identities. Editorial guidelines will say what the company's name actually is, and how it is to be spelled.   \n   \nRemind your client that a logo is a _symbol_, not a word, even if it has letters in it.   \n   \nPaul\n\n"
    },
    {
      "time": "3 Sep 2003 — 6:07pm",
      "content": "Not sure how you're separating a branding issue from a visual design one.   \n   \nMy view is that it's all visual communications (and more when considering branding / brand strategy). Since there are both implicit and explicit messages to any visual communication program, having technical issues with the visual design can imply negative messages about the company.   \n   \nMy view, based on my connection with the company vision, is that it's more a crutch than anything else. They want it to stand out. But it doesn't integrate elegantly into the overall design system. But, when dealing with folks on the business side of the fence, it's not always easy to make a case for elegant design. So I was wondering if anyone has come across this issue and what if any tactics they used to deal with it.   \n   \nThanks,   \nNathan\n\n"
    },
    {
      "time": "3 Sep 2003 — 6:44pm",
      "content": "Dunno how receptive they are to plain logic, but it's a simple and accepted rule of usage that proper nouns are written with initial caps, not all caps. When a company name appears in all caps, one assumes it's an acronym, and will then wonder what the initials stand for.   \n   \nWriting in all caps is like adding extra exclamation points. It doesn't say \"this is extra important\" -- it says \"we know _you_ don't think this is as important as _we_ think it is.\"\n\n"
    },
    {
      "time": "3 Sep 2003 — 7:01pm",
      "content": "Great points! Thanks guys!!!! \\<-- J/K\n\n"
    },
    {
      "time": "3 Sep 2003 — 7:09pm",
      "content": "![:-)](http://web.archive.org/web/20150215223859im_/http:/www.typophile.com/forums/clipart/happy.gif) Present company excluded, of course, on that last point!\n\n"
    },
    {
      "time": "4 Sep 2003 — 10:33pm",
      "content": "Note that Mercedes uses a lot of all-caps typography. These are the same people who commissioned a complex custom type family, so they can't be accused of being provincial.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2003 — 10:54pm",
      "content": "Whoever Meredith is, she has got my vote for governor of California.   \n   \nGerald\n\n"
    },
    {
      "time": "5 Sep 2003 — 11:15pm",
      "content": "Typography is not like food or drugs.   \n   \nIf the taste is good, and it feels good, it's good!   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": "5 Sep 2003 — 11:29pm",
      "content": "Even the \"e.e. cummings\" example is [a bad one](http://web.archive.org/web/20150215223859/http:/www.gvsu.edu/english/cummings/caps.htm).   \n   \nAnd from [the followup article](http://web.archive.org/web/20150215223859/http:/www.gvsu.edu/english/cummings/caps2.html): \"on 27 February 1951 he wrote to the poet: 'are you E.E.Cummings, ee cummings, or what?(so far as the title page is concerned)wd u like title page all in lowercase?'   \n   \nThe poet replied on 1 March 1951: 'E.E.Cummings, unless your printer prefers E. E. Cummings/ titlepage up to you;but may it not be tricksy svp[.]'\"\n\n"
    },
    {
      "time": "6 Sep 2003 — 10:43am",
      "content": "Thanks, Gerald (L.). I wouldn't have to actually _live_ in California, would I?   \n   \nRe: Cummings -- I'm so glad to know that. His gravestone in Boston has his name in all caps.\n\n"
    },
    {
      "time": "6 Sep 2003 — 10:36pm",
      "content": "I refused to use logo's in my clients work. Never. Well I never say never. The back of a business card, white ink, six point, maybe.   \n   \nBut what is wrong with using all uppercase? That is why there is typefaces called \"title\". Stanley Morison wrote that you should never use all uppercase italic. Certainly never swash within words. Only the first or last characters of a word.   \n   \nHogwash.   \n   \nBruce Rogers used them all with great gusto. The beauty of wrongness, isn't it a wonderful thing?   \n   \nStanley Morison on the other hand could never make anything look charming or beautiful. Simply it never happened for him. Too much time preaching.   \n   \nI noticed everyone likes Eric Gill. His justification idea, it sucks big time! That was really stupid!!!   \n   \nIs anybody Catholic? I think Gill should have spent less time playing with his puppy dog.   \n   \nGerald Giampa   \nP.S. I would not be inclined \"TOO OFTEN\" to use uppercase within text. But I never say never.\n\n"
    },
    {
      "time": "3 Sep 2003 — 12:24pm",
      "content": "True small caps would be a great solution. They get to feel   \nspecial, you get to keep your text in order.   \n   \nJetBlue had a similar identity crisis early on, when   \neverybody thought the official spelling was jetBlue, since   \nthat was the logo treatment. (Which is another topic   \nentirely.)   \n   \nadidas is an example where it is supposed to be set all   \nlowercase, all the time. Odd.\n\n"
    },
    {
      "time": "4 Sep 2003 — 7:02pm",
      "content": "Corporate guy 1: [Enters scene wearing tie with chocolate pudding stain.]   \n   \nCorporate guy 2: \"Dude, you got a stain on your tie.\"   \n   \nCorporate guy 1: \"Yeah, it makes me stand out in a crowd.   \n   \nCorporate guy 2: \"Okay. It must have worked since I noticed you.\"\n\n"
    }
  ]
}
