{
  "id": "113876",
  "title": "Crown Capital Bali management: Creating Online Presence",
  "forum": "General Discussions",
  "tags": [
    "crown capital bali management: creating online presence",
    "General Discussions"
  ],
  "content": "Real estate business has always been a lucrative enterprise. And with the advent of the Internet and its ability to promote one’s properties, it possesses many more advantages compared to other products. One is that other products need to be delivered to one’s address in order to be used or enjoyed. In the case of vacant lots, what one sees in photos or videos is essentially sufficient to close a deal.\n\nOf course, one needs to visit and see a property for it to be appreciated in its totality and reality. But for some investors who merely want to put money in something that is profitable, however, that may not even be necessary, especially with profitable projects that are selling like hotcakes. Condos and apartments are sometimes good investments for those who do not intend to use or reside in them. One can even send a representative to look up the property.\n\nBut what a pity it would be to acquire one of Crown Capital’s properties and not use it. It goes without saying that these delectable offerings are what vacation and retirement dreams are made of. The location and architecture as well as the amenities are attractive come-ons of these prized properties.\n\nCrown Capital’s website provides moderately sufficient visual and technical information of the property offerings. There are just a few setbacks to the website, namely:\n\n1. Not enough panoramic views of the properties and their surroundings.  \n2. A bird’s eye view of the site in its environment will provide greater appreciation of the overall surroundings.  \n3. No actual photos of ongoing development and construction are provided.  \n4. There is no video of the location or any existing properties.  \n5. A list of the technical people (architects and engineers) would help promote the properties and for verification purposes.  \n6. The news section needs a lot of grammatical proofreading to reach global standards.\n\nOverall, the website is attractive and can reasonably appeal to serious property hunters. Although Bali, generally by itself, can sell these properties, providing the necessary info and means to help buyers make an informed decision can certainly help facilitate the marketing process.\n\n",
  "author": "stormwinther",
  "time": "3 Feb 2014 — 8:20pm",
  "uid": "217404",
  "comments": [

  ]
}
