{
  "id": "113969",
  "title": "Helvetica Neue Paneuropean Family Pack — Sufficient for US as well as Europe?",
  "forum": "General Discussions",
  "tags": [
    "Cyrillic",
    "european",
    "General Discussions",
    "helvetica neue"
  ],
  "content": "Good morning good people,  \nMy department of designers are aggressively reassessing the brand image of the company we work for, starting with consistency of visual language. The Senior Designer established that the current corporate typeface, Helvetica Neue (or is it properly Neue Helvetica?), is perfectly suitable for our needs. It works quite well with all the various weights and styles for the US market, however our international offices are just frustrated. Characters are missing for the Bosians and the Russians do not have enough variation with the basic cyrillic family they have and so on and so on. Many of the offices have elected to use Myriad Pro as a substitute and it's just destroying our brand objectives. This must stop.  \nI found this:  \n [http://www.fonts.com/font/linotype/neue-helvetica/paneuropean-complete-f...](http://web.archive.org/web/20141030071855/http:/www.fonts.com/font/linotype/neue-helvetica/paneuropean-complete-family-pack \"http://www.fonts.com/font/linotype/neue-helvetica/paneuropean-complete-family-pack\")\n\n...and am curious if I were to purchase licenses for each office, if will be sufficient enough for the US as well. Or would I also need to purchase:  \n [http://www.fonts.com/font/linotype/neue-helvetica/complete-family-pack](http://web.archive.org/web/20141030071855/http:/www.fonts.com/font/linotype/neue-helvetica/complete-family-pack \"http://www.fonts.com/font/linotype/neue-helvetica/complete-family-pack\")\n\nMy own view is that it's time for a modern family to be introduced but unfortunately... I am not the shot caller.\n\nAny advice is much appreciated.\n\n",
  "author": "theplatypus",
  "time": "6 Feb 2014 — 11:24am",
  "uid": "35061",
  "comments": [
    {
      "time": "6 Feb 2014 — 11:35am",
      "content": "I would contact Linotype directly with this question. I sympathize with your personal opinion. Sounds like a custom type family would serve both your practical and financial needs better.\n\n"
    },
    {
      "time": "6 Feb 2014 — 1:35pm",
      "content": "Also factor in Neue Helvetica's overly-tight spacing, which reduces readability. Essentially it's a display face, and a profusely over-used (read: diluted) one at that.\n\nhhp\n\n"
    },
    {
      "time": "6 Feb 2014 — 3:13pm",
      "content": "Yes, we run into that all the time and typically track it out about 10-20 points depending on the situation. Thanks for the tip hrant. :)\n\nWish me luck, I'm running upstairs to propose.\n\nAlso... if I were to present a cheaper alternative that has equal amounts of styles within the family... what would one recommend? I love Village's Galaxie Polaris but unfortunately it does not have the language support, nor the depth of styles Helvetica Neue encompasses.\n\n"
    },
    {
      "time": "6 Feb 2014 — 3:37pm",
      "content": "Whelp... it's been approved. Thanks for you help, folks. Either way, the Euro office needs it so in my book, that's a win.\n\n"
    },
    {
      "time": "6 Feb 2014 — 4:57pm",
      "content": "Great!!  \nUh, what's been approved, exactly? :-)\n\nhhp\n\n"
    },
    {
      "time": "8 Feb 2014 — 4:10pm",
      "content": "?\n\n"
    },
    {
      "time": "23 Apr 2014 — 3:50pm",
      "content": "I realize I never followed up...  \nI received approval to purchase Helvetica Neue Pan Euro.\n\n@hrant, thank you for the email, and I will be touch.\n\n"
    }
  ]
}
