{
  "id": "113902",
  "title": "Typeface designs with meanings behind them",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey Guys. I'm trying to find a range of typefaces which all have meanings behind them. This could be what they are influenced on, or where the aesthetics of the typeface come from or anything similar to that, they just need to be a fonts with a meaning and purpose behind them, not just for aesthetic qualities.\n\nOnly a found a few so far. A lot of Jonathan Barnbrooks fonts have meanings behind them....\n\nMelancholia - depression, sensitivity to the world. The font attempts to put some of the sensitivity into the letterforms.\n\nProzac - aesthetic of the font looks like it is designed by scientists. The shape of the letterforms seems to mirror tablets and capsules.\n\nIf anyone could suggest some typefaces it would be really helpful. Many thanks.\n\n",
  "author": "change123",
  "time": "4 Feb 2014 — 11:21am",
  "uid": "215966",
  "comments": [
    {
      "time": "4 Feb 2014 — 1:09pm",
      "content": "I wrote a series of artspeak blurbs for most of my types, best accessed at FontSpring:  \n [http://www.fontspring.com/foundry/shinntype](http://web.archive.org/web/20140804063530/http:/www.fontspring.com/foundry/shinntype \"http://www.fontspring.com/foundry/shinntype\")\n\nA critical (“meaningful”) description of any typeface may be written.  \nI addressed the issue of how it is possible to decribe a typeface from different perspectives, in the post for the release of Sense and Sensibility, at Typophile: [http://typophile.com/node/74877](http://web.archive.org/web/20140804063530/http:/typophile.com/node/74877 \"http://typophile.com/node/74877\")\n\nThe designer’s influences, intentions and understanding, and what the foundry has to say about a typeface, are only part of the picture.\n\n"
    },
    {
      "time": "4 Feb 2014 — 5:37pm",
      "content": "Definitely study [Fuse](http://web.archive.org/web/20140804063530/http:/typographica.org/typography-books/fuse-1-20/). See also [Fenland](http://web.archive.org/web/20140804063530/http:/typography.net/fontfamilies/view/39).\n\n"
    }
  ]
}
