{
  "id": "114028",
  "title": "hard to id font",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi everyone,\n\nI'm new here, and was wondering if you could help me identify this font:\n\n ![](http://web.archive.org/web/20140405004332im_/http:/typophile.com/files/font_4920.jpg)\n\nI have had trouble identifying it, and even online 'softwares' cannot match it to an existing fond correctly.\n\nThanks in advance!  \nB\n\n| Attachment | Size |\n| --- | --- |\n| [font pégase.jpg](http://web.archive.org/web/20140405004332/http:/typophile.com/files/font%20p%C3%A9gase.jpg) | 5.37 KB |\n\n",
  "author": "newb",
  "time": "8 Feb 2014 — 3:37pm",
  "uid": "217521",
  "comments": [
    {
      "time": "8 Feb 2014 — 6:51pm",
      "content": "Looks a lot like some version of Cassandre’s Peignot [http://www.myfonts.com/fonts/linotype/peignot/](http://web.archive.org/web/20140405004332/http:/www.myfonts.com/fonts/linotype/peignot/ \"http://www.myfonts.com/fonts/linotype/peignot/\") Très français n'est-ce pas?  \nDon\n\n"
    },
    {
      "time": "9 Feb 2014 — 3:57am",
      "content": "Hi Don,  \nIt does look like, especially Peignot Demi. Yes, hehe, very French ;)  \nIt's still different, though, as the middle bar of the E is not in the middle (but higher) in \"Pégase\" and is shorter and the loop in the P doesn't end in the middle either, but goes lower. Also, the bar in the G goes down rather than being 'rounded'. Finally, there's that slight Art Deco look (for example, the middle part of the S and the G).  \nSee what I mean? (I'm sorry I don't exactly have the right terminology..)  \nHave a nice week end!  \nBen\n\n"
    },
    {
      "time": "9 Feb 2014 — 4:29am",
      "content": "Hi Benjamin, when I said \"some version\" I included hand lettering.  \nAlso very similar is Roger Excoffon's Chambord, not digitized. That's not to say that someone might have created a font with exactly these variations.  \nDon\n\n"
    },
    {
      "time": "9 Feb 2014 — 9:51am",
      "content": "Hi Don,  \nOh, okay. Thanks :)  \nB\n\n"
    },
    {
      "time": "9 Feb 2014 — 11:44am",
      "content": "Thanks for mentioning Chambord, Don. It caused me to investigate further. [Here](http://web.archive.org/web/20140405004332/http:/typophile.com/node/75590) is an old Typophile thread that yields a link to a PDF showing Chambord's variants (I rather like the condensed). Also, an interesting assertion from Hrant. If true - and Chambord _does_ look very derivative of Peignot - it might explain why nobody has been eager to digitize it. Or maybe it's just licensing issues ...\n\n"
    },
    {
      "time": "9 Feb 2014 — 7:18pm",
      "content": "Hi Mike, here are some more recent threads on Chambord  \n [http://typophile.com/node/107526](http://web.archive.org/web/20140405004332/http:/typophile.com/node/107526 \"http://typophile.com/node/107526\")  \n [http://typophile.com/node/105462](http://web.archive.org/web/20140405004332/http:/typophile.com/node/105462 \"http://typophile.com/node/105462\")  \n [http://typophile.com/node/106626](http://web.archive.org/web/20140405004332/http:/typophile.com/node/106626 \"http://typophile.com/node/106626\")  \nHard to tell if this is a pointed A as in Peignot or a blunt top A as in Chambord. I am still leaning towards hand lettering based mainly on Peignot. But...  \nDon\n\n"
    },
    {
      "time": "10 Feb 2014 — 6:10am",
      "content": "Hi,  \nRegarding the dates on the Chambord pdf, I must mention that this case from the 30s (apologies, I forgot to last time). I do not know if it predates the 1937 Peignot or not. It does appear to be hand lettering based on the slightly different Es.\n\n"
    },
    {
      "time": "10 Feb 2014 — 6:25am",
      "content": "Thick and thin sans lettering has had some popularity since the 1890s. Early examples of such fonts include Taylor/Globe Gothic and Studley [not digitized]. It is quite possible that the similarities to Peignot & Chambord are the result of independent evolution of lettering styles.  \nDon\n\n"
    }
  ]
}
