{
  "id": "114000",
  "title": "Apple Garamond",
  "forum": "Design",
  "tags": [
    "apple",
    "garamond",
    "revival",
    "serif",
    "Design"
  ],
  "content": "I was wondering if anyone had any knowledge or experience with \"apple garamond\". From what I have read it seems to not have been released publicly and a quality revival is no where to be found. It was something that I was looking to pursue, but didnt want to go full steam ahead, only to be abruptly stopped by a quality revival or even the existing typeface existing digitally already...\n\n",
  "author": "dawi222",
  "time": "7 Feb 2014 — 11:41am",
  "uid": "212580",
  "comments": [
    {
      "time": "7 Feb 2014 — 2:48pm",
      "content": "It's a customized version of ITC Garamond Condensed. From back when Apple used to pay money for type design...\n\nSee also: [http://www.typophile.com/node/48826](http://web.archive.org/web/20150317182138/http:/www.typophile.com/node/48826 \"http://www.typophile.com/node/48826\")\n\nhhp\n\n"
    },
    {
      "time": "7 Feb 2014 — 7:01pm",
      "content": "This is from Wikipedia, so the usual cautions about accuracy would apply:\n\n\"Upon the introduction of the Macintosh in 1984, Apple adopted a new corporate font called Apple Garamond. It was a variation of the classic Garamond typeface, both narrower and having a taller x-height. Specifically, ITC Garamond (created by Tony Stan in 1977) was condensed to 80% of its normal width. Presumably, Apple felt that the existing ITC Garamond Condensed, at 64%, was too narrow. Bitstream condensed the font and subtly adjusted the stroke widths and performed the hinting required to create a font that was then delivered to Apple as Postscript font \"apgaram.\"\n\n\"In cases when the Apple logo was accompanied by text, it was always set in Apple Garamond. Aside from the company name, most of Apple's advertising and marketing slogans such as \"Think different.\" used the font as well.\n\n\"This typeface was virtually synonymous with Apple for almost two decades and formed a large part of Apple's brand recognition. It was not only used in conjunction with the logo, but also in manuals, ads, and to label products with model names.\n\n\"Apple has not released the true Apple Garamond font. ITC briefly sold ITC Garamond Narrow—Apple Garamond without the custom hinting—as part of its Apple Font Pack in the 1990s. A version of the font was also included under a different name in some versions of Mac OS X prior to 10.3 as it was used by the Setup Assistant installation program.\"\n\n[http://en.wikipedia.org/wiki/Typography\\_of\\_Apple\\_Inc](http://web.archive.org/web/20150317182138/http:/en.wikipedia.org/wiki/Typography_of_Apple_Inc \"http://en.wikipedia.org/wiki/Typography\\_of\\_Apple\\_Inc\").\n\n"
    },
    {
      "time": "7 Feb 2014 — 7:06pm",
      "content": "> It was a variation of the classic Garamond typeface\n\nIt's actually based on the work of Jannon, not Garamont.\n\nhhp\n\n"
    },
    {
      "time": "9 Feb 2014 — 3:31pm",
      "content": "ITC Garamond Narrow is still widely available, from numerous sources.\n\n"
    }
  ]
}
