{
  "id": "114048",
  "title": "Double glyph in Fontlab file",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "For several months I have been working on my typeface, Theory Serif. It has made great progress and I was gradually learning how to use FontLab.\n\nSince about an hour I have been trying to solve a problem I created by accident. I don’t know how it happened, but I must have duplicated the glyph “o” and deleted the glyph “n” in the process. I fixed it by adding the “n” back, by opening a backup of my font file. However, the o is now double in the font mapping and while I can find it, I can no longer see it (as a duplicate) in the actual glyphs window. When I find and double click the letter, it jumps back to the main glyphs window, with no particular glyph selected.\n\nI have been going back and forth, but I couldn’t find anything about this in the user manual, in forums or on Typophile. Right now I can no longer export the typeface as a font, it comes back with an OTF error, due to the double mapping with the same letter. How do I remove this letter, or how do I fix the “n” and “0” mapping issue?\n\nHere is a screenshot of the find box showing the duplicate “o”:\n\n ![](http://web.archive.org/web/20150414172036im_/http:/typophile.com/files/Screen%20Shot%202014-02-10%20at%2001_5625.58.44.png)\n\nTo make this question clearer: I cannot see or select this glyph, it does not show up anywhere. I can find it in the mapping, but I cannot delete the duplicate instance.\n\n",
  "author": "Core0",
  "time": "9 Feb 2014 — 5:04pm",
  "uid": "181047",
  "comments": [
    {
      "time": "9 Feb 2014 — 5:15pm",
      "content": "Here is the original error I get when compiling the font:\n\n`[FATAL] cmap{plat=3,script=1,lang=0}: multiple glyphs o o mapped to code <6f>\nERROR: There was a problem while compiling OpenType font. Final .otf font is not saved. Please, check OpenType features definition for errors`\n\n"
    },
    {
      "time": "9 Feb 2014 — 6:24pm",
      "content": "Try looking at the font in Index mode: IIRC when I had this problem the two identical glyphs would show up in Index mode, but not the others.\n\n"
    },
    {
      "time": "10 Feb 2014 — 2:40am",
      "content": "Thank you, Nick, this helped. I was able to copy and delete some glyphs. It destroyed the metrics and kerning classes for the lowercase “o” and replaced the “o” component for the respective accent letters with a square, but that was relatively easy to fix.\n\n"
    }
  ]
}
