{
  "id": "114160",
  "title": "webfont Advanced",
  "forum": "Stefan Seifert's blog",
  "tags": [
    "hinting",
    "rendering",
    "subpixel",
    "webfont"
  ],
  "content": "Hi,\n\nsome pics from my work on a font for my webpage destinated for very small sizes around 9px.  \nI am struggling with balancing hinting for small screen sizes, special versions for negative use on black ground with sub pixel rendering and so on…\n\n ![](http://web.archive.org/web/20150317223822im_/http:/typophile.com/files/84y_5498.png)\n\n ![](http://web.archive.org/web/20150317223822im_/http:/typophile.com/files/s3ya_6485.png)\n\n ![](http://web.archive.org/web/20150317223822im_/http:/typophile.com/files/yga_4154.png)\n\n ![](http://web.archive.org/web/20150317223822im_/http:/typophile.com/files/e7as_6084.png)\n\nIn this pic one can see the results comparing (for now only) two browsers Google Chrome and Safari both on Mac.\n\nFor me the first one is the best, yet it is achieved with a particular thinner version of the same font only for the use on black ground. Otherwise as known sub pixel rendering tends to make fonts look much bolder than they are in reality.  \nYet, it creates a hell of difficulties when used in animated texts, even if only a simple fade, for example. Specially Safari renders the font abruptly after the animation is completely done. I tried to change classes in order to keep the thicker version while animating, only exchanging it at the end and so on. In general it works better with CSS transitions but even this does not solve entirely the problem.\n\nBetween the second and the third one (with simple greyscale anti-aliasing) Google is way better, specially the strokes are more consistent as here in the example in the ‘in’. Sadly not even a good hinting solves the problem on stroke inconsistency on monitor. Yet the font looks better in Google Chrome.\n\nBy the way Firefox does not leave to the developer the choice of greyscale anti-aliasing, as far as I know. One has to do a CSS hack to change class for him and go for slighter font versions on dark ground.\n\nA long story…\n\n ![](http://web.archive.org/web/20150317223822im_/http:/typophile.com/files/results_3817.png)\n\n",
  "author": "Stefan Seifert",
  "time": "13 Feb 2014 — 6:44am",
  "uid": "19151",
  "comments": [
    {
      "time": "17 Jun 2014 — 11:31am",
      "content": "Thanks!\n\n"
    },
    {
      "time": "7 Nov 2014 — 1:07am",
      "content": "Home time is indicated on the lower dial in the center of the watch by a day/night hand featuring sun and moon _**[replica tag heuer Grand Carrera uk](http://web.archive.org/web/20150317223822/http:/www.waxreplicawatches.co.uk/replica-tag-heuer-grand-carrera-watches-sale-for-uk.html)**_. Local time in the traveler’s location is shown by the main hands, which enable the second time zone to be read directly. The self-winding Caliber 9909 MC differs from standard multiple time zone movements in that its cities disc is completely integrated into the _**[replica Franck Muller](http://web.archive.org/web/20150317223822/http:/www.waxreplicawatches.co.uk/replica-franck-muller-watches-sale-for-uk.html)**_ and is visible in a lateral magnifier on the 9 o’clock side of the case, rather than on the dial. This clever mechanism avoids overloading the dial. The time in each of the 24 reference cities is read by pressing the pivoting push-piece _**[replica breitling uk](http://web.archive.org/web/20150317223822/http:/www.waxreplicawatches.co.uk/)**_. Each press reveals a different city, its local time, and the time difference between the home time and the traveler’s time.\n\n"
    }
  ]
}
