{
  "id": "114234",
  "title": "Looking for a serif with Specific R",
  "forum": "Home",
  "tags": [
    "Serif"
  ],
  "content": "I'm looking for a Serif typeface with a specific R. It has a weird diagonal that looks a bit like a tail.. I cant seem to find a fitting typeface that has the same letter. I've attached an image of it.. . Anybody?\n\n| Attachment | Size |\n| --- | --- |\n| [R.png](http://web.archive.org/web/20140724002742/http:/typophile.com/files/Schermafbeelding%202014-02-16%20om%2013.41.35_0.png) | 27.6 KB |\n\n",
  "author": "Baxendale",
  "time": "16 Feb 2014 — 7:42am",
  "uid": "217138",
  "comments": [
    {
      "time": "16 Feb 2014 — 8:16am",
      "content": "According to my [Serif Font ID Guide](http://web.archive.org/web/20140724002742/http:/bowfinprintworks.com/SerifGuide/serifsearch.php) there are at least 1,208 serif families with an R of this general style. You can narrow that down by a great deal if you know of any other letters from this font. Or.. you can try looking through the samples from all 1,208 families to see which R resembles the specific shape of this R.\n\nCan you tell us anything about this font, or your sample? Is this a hypothetical R that you drew, or a real sample from something?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "16 Feb 2014 — 8:24am",
      "content": "It would help if you gave some information on the source and date of your image. At least you should provide any information you have as to whether it is digital or before the current digital era, i.e. circa 1990.  \nIn any event, the R is some version of French Old Style. Can't say anything about the rest of the font from which the R was taken, or even if it forms part of a font and is not an individual design for an R.  \nHere is French Old Style No. 2 as sold by ATF in 1900 -- and probably similar to versions sold by foundries in Europe and America for many years before then\n\n ![](http://web.archive.org/web/20140724002742im_/http:/typophile.com/files/FrenchOSNo2pATF1900_5314_4068.jpg)\n  \nFrench Old Style is the English name for a style of font designed by Théophile Beaudoire in 1858. The upper case is derived from Louis Perrin's Lyon Capitals. The European name, sometimes also used in English, is Elzevir.  \nThis type of leg with some rounding of the curve was found in fonts variously called Romana and Devinne.  \nThe leg in a straighter version was fount in ATF fonts circa 1900 particularly some by Goudy.  \nSome digging may produce an exact match to your image, but without more information from you I have some doubts as to the prospects for quick success.  \nDon \n"
    },
    {
      "time": "16 Feb 2014 — 8:35am",
      "content": "this is indeed a version I redrew, its from a iron typeface that has been put on a facade about 20 years ago. The letters are in a classical style, probably a french one like you guys suggest. The A is also a bid odd, it has a very low horizontal bar...\n\n ![](http://web.archive.org/web/20140724002742im_/http:/typophile.com/files/1_6324.jpg)\n\n"
    },
    {
      "time": "16 Feb 2014 — 10:13am",
      "content": "Edited to add sentence at end of post:  \nHi Bas, good enough. For the rest of your font almost any Trajan would do for the general letter forms. But see my next post for a better suggestion.  \nDon\n\n"
    },
    {
      "time": "16 Feb 2014 — 8:54am",
      "content": "That A reminds me of some Dutch designs. See Canada Type's [Zilvertype](http://web.archive.org/web/20140724002742/http:/www.myfonts.com/fonts/canadatype/zilvertype/?refby=bowfin).\n\n- Mike Yanega\n\n"
    },
    {
      "time": "16 Feb 2014 — 9:40am",
      "content": "A somewhat similar A and the R are both found in the metal font Elzevir Antiqua from Genzsch & Heyse\n\n ![](http://web.archive.org/web/20140724002742im_/http:/typophile.com/files/ElzevirAntiquaGenzschAndHeyseSM_4239.jpg)\n  \nThis would be a suitable model for the rest of your project.  \nDon \n"
    }
  ]
}
