{
  "id": "114209",
  "title": "Searching for the Jenson look",
  "forum": "Design",
  "tags": [
    "Adobe Jenson",
    "Arno",
    "centaur",
    "humanist",
    "Nicholas Jenson",
    "Design"
  ],
  "content": "I am trying to find a way of achieving the same colour, evenness and strength that Jenson conveyed, for instance, here:\n\n[http://en.wikipedia.org/wiki/File:Jenson\\_1475\\_venice\\_laertius.png](http://web.archive.org/web/20150416050645/http:/en.wikipedia.org/wiki/File:Jenson_1475_venice_laertius.png)\n\nI appreciate that there have been many digital typefaces inspired or informed by Jenson and I’ve tried some of them – Adobe Jenson, Arno, Legacy Serif, Centaur – but somehow all of them create a very different feel on the page.\n\nI have been trying to put my finger on just what it is the 15th-century Jenson has that the modern typefaces don’t and just what it is that I find so attractive about the 1475 sample.\n\nIt isn't the archaic features I'm missing, the long ‘s’ for instance. And it isn't the individual letter forms particularly; it’s the look of the whole that’s so special, once one gets a certain distance away from it.\n\nI wonder perhaps if it’s related to the lack, to some extent, of sharp edges in the 1475 sample. Compare a page of Arno (beautiful in its own way) and this sample and the Arno looks much more intricate and clean cut: the serifs are sharper. But it doesn't, to my mind, have quite the same unaffected power that the Jenson does.\n\nAnyway, I wondered if anyone could help with these questions:\n\n(1) What is it that gives the Jenson its special beauty?\n\n(2) Is there any digital typeface which might achieve the same strength and colour?\n\nI am simply looking for a workhorse typeface for everyday use; this isn’t for a specific project. And I am not a type professional, so please excuse any glaring examples of ignorance in what I've written.\n\nThank you,\n\nOliver\n\n",
  "author": "Rhetor",
  "time": "15 Feb 2014 — 5:09am",
  "uid": "217675",
  "comments": [
    {
      "time": "15 Feb 2014 — 4:29pm",
      "content": "I love the effect on the page. What I observe at a causal glance is a low contrast typeface, with wide letter-forms and generous spacing. Note that the letterforms have considerable variation in shape and details for an almost hand written effect that I find quite pleasing to the eye. I'll leave it to the experts to opine further.  \nAs for digital typefaces, I am not totally satisfied with anything I have seen. IMHO most digital fonts are too compressed and mechanical in design to give this effect. But I expect that you will get some suggestions that will come at least part way in meeting your request.  \nDon\n\n"
    },
    {
      "time": "15 Feb 2014 — 5:54pm",
      "content": "all kinds of factors, starting with ink & how the ink is put on the paper -- i.e., the ink itself, how it sits of the type, how the type is pressed into the paper, how it is thus distributed (also depends on the paper, soft, wetted, etc.). If you can see the letterforms of the metal type versus the eventual printing, you'll also notice that the transfer of the ink was not linear -- percentagewise, the fine lines put down a wider path than the heavy. Then too, the letter pressed into paper puts more ink along the edge, with offset printing, the center of black is usually the center of the line put down, not the outside.\n\nJust get a good glass and some good samples of type & print, and look.\n\nAs to\n\n<cite>(2) Is there any digital typeface which might achieve the same strength and colour?</cite>\n\nIf you look at what I've just said, is isn't just about the \"digital typeface.\" For example, you'll never get the slight randomness of individually cast letters with digital type.\n\nIf you're after the look of metal Jensen, it could be done, but for a number of reasons, the physical object you hold (the book) wouldn't be the same, & likely, not many would be interested. An experiment, not a product.\n\nIf it really is just \"strength and color,\" see\n\n[http://www.designfreebies.org/wp-content/uploads/2010/08/free-body-text-...](http://web.archive.org/web/20150416050645/http:/www.designfreebies.org/wp-content/uploads/2010/08/free-body-text-font-charis.jpg \"http://www.designfreebies.org/wp-content/uploads/2010/08/free-body-text-font-charis.jpg\")\n\nhas a a similar quality of \"strength and color,\" but vastly different letterforms.\n\n"
    },
    {
      "time": "15 Feb 2014 — 5:46pm",
      "content": "Consider digital letterpress.\n\nhhp\n\n"
    },
    {
      "time": "15 Feb 2014 — 8:07pm",
      "content": "As I've noted, apparently correctly, as an eminent typographer (Bruce Rogers) agreed, Ludlow's Eusebius was the closest revival of Jenson's type. This has been revived digitally as Nicolas Jenson SG.\n\nA close resemblance in the shape of the individual letters, of course, may still not yield a match for the overall texture that you are seeking. But I think that would be the typeface to try before giving up on finding it already out there.\n\n"
    },
    {
      "time": "15 Feb 2014 — 9:00pm",
      "content": "Here’s my effort (albeit with a large x-height):  \n [Nicholas Goodchild](http://web.archive.org/web/20150416050645/http:/origin.myfonts.com/s/aw/original/78/0/40219.pdf)\n\n"
    },
    {
      "time": "15 Feb 2014 — 9:37pm",
      "content": "> This has been revived digitally as Nicolas Jenson SG.\n\n[http://www.myfonts.com/fonts/spiecegraphics/nicolas-jenson-sg/](http://web.archive.org/web/20150416050645/http:/www.myfonts.com/fonts/spiecegraphics/nicolas-jenson-sg/ \"http://www.myfonts.com/fonts/spiecegraphics/nicolas-jenson-sg/\")\n\nYes. Notice the close resemblance of the lower case \"f\" -- Oh, wait, no resemblance...\n\nAnd the texture & color -- not to my eye. Way too much contrast.\n\n"
    },
    {
      "time": "16 Feb 2014 — 9:34am",
      "content": "Here is Ludlow Eusebius:\n\n ![](http://web.archive.org/web/20150416050645im_/http:/typophile.com/files/Eusebius_3431.jpg)\n\nAnd you can compare [Nicholas Jenson SG](http://web.archive.org/web/20150416050645/http:/www.identifont.com/show?73R) with it.  \nAnd, yes, the normal lower case f was designed not to involve kerning; there were alternate forms which had the authentic shape, but a non-kerning one was needed due to the mechanical exigencies of the Ludlow linecaster in those days.\n\n"
    },
    {
      "time": "16 Feb 2014 — 10:25pm",
      "content": "Closer to \"strength and color\" the original poster is asking about would probably be Poliphilus and Blado. I remember these with photocomp, in yet another attempt to recover the look of letterpress. Never caught on, and yet they were closer to that look with the repro-negative-plate systems (photocomp and early digital) than with current digital systems.\n\n[http://www.myfonts.com/fonts/mti/poliphilus/](http://web.archive.org/web/20150416050645/http:/www.myfonts.com/fonts/mti/poliphilus/ \"http://www.myfonts.com/fonts/mti/poliphilus/\")\n\nAs far as the mechanical requirements of linecasters, teach your great grandmother to suck eggs. I started with them. And always felt that any effort to revive fonts the linecasters themselves were reviving should also restore the f, j, etc., and if duplexed mats were involved (as with Linotype), the italic letters also cut off -- j again, and y.\n\nIn fact, I think it a disservice to those who designed fonts specifically for the linecasters -- essentially, commissions from the first half of the 20th century -- to assume they preferred the letterforms they had to create, given the requirements of the machines. I would be tempted, in any digital revival of those fonts, to make versions with extenders implicit in the design, without the consideration of mechanical requirements. YMMV.\n\nBut none of this speaks to the differences between the ink-on-paper differences between 16th century letterpress & 16th century inks and papers, versus contemporary laser or offset practices.\n\n"
    },
    {
      "time": "17 Feb 2014 — 2:43am",
      "content": "Thank you to everyone for their help and the introductions to Charis, Nicholas / Goodchild, Eusebius / Nicholas Jenson SG and Poliphilus / Blado.\n\nIronically, of these typefaces, the closest in letterform to the original (Eusebius, ignoring the ‘f’) looks least likely to my (unprofessional) eyes to create the same sort of effect on the page, whereas Charis (which couldn’t be more different) does have something of the same colour. Poliphilus does seem to be similarly low contrast, but the weathered effect is a little eccentric for everyday use.\n\nI take Charles’ point that paper, ink and process matter as well as typeface, but I do wonder if there isn’t a gap in the market for a Jenson revival that’s:\n\nmore-or-less faithful (but not self-consciously archaic),\n\nsomewhat calligraphic (but not excessively so) and\n\n(above all) low contrast, so as to try to get the look of the 1475 sample, rather than the shapes of the lost metal used to create it (but not uneven in the way Poliphilus is).\n\nOliver\n\n"
    },
    {
      "time": "17 Feb 2014 — 1:14pm",
      "content": "Well, if you don't mind spending a lot of money, take a look at Trinité, and some of the offerings from the Dutch Type Library. Trinité, which I have licensed, costs around €1400 for a \"bundle.\" Luckily for me, I got it when the Euro was only $0.85; it still was U.S. $1,000 at the time.\n\n[http://www.teff.nl/fonts/trinite/](http://web.archive.org/web/20150416050645/http:/www.teff.nl/fonts/trinite/ \"http://www.teff.nl/fonts/trinite/\")\n\n(Use the narrow.) I bought this to use for one customer, a noted designer at a university press who paid for it out of his own pocket so the press could use it. Due to licensing issues, we both had to have a copy. None of the other publishers I work for think they can afford it.\n\nThe DTL fonts are little cheaper, though when you put together enough for a \"bundle,\" they're up there.\n\n[http://www.dutchtypelibrary.nl/](http://web.archive.org/web/20150416050645/http:/www.dutchtypelibrary.nl/ \"http://www.dutchtypelibrary.nl/\")\n\nExtremely good fonts; perhaps what you're looking for -- a sensitive reinterpretation given modern materials and techniques. None of my customers can afford them, though.\n\n(Note: this \"We can't afford it\" comes from people who just can't use the same fonts over and over -- another new phenomena, but one that has primed the proliferation of fonts. Winning font design these days has to keep the price down, at least in the book world.)\n\n"
    },
    {
      "time": "17 Feb 2014 — 3:12pm",
      "content": "There may be a gap in the range of Jensons, but the market for Jenson revivals is practically non-existent at the moment.\n\nRevivals of the classics occupied an early phase of the switch to digital. Now the interest is more in original designs, especially sans.\n\nThe bundling of the classics by Adobe etc., and now Google’s free fonts, have severely diminished what market there was for old style (antiqua) revivals.\n\nNonetheless, there is some interest in faces such as Williams Caslon—but bear in mind that it is published by Font Bureau, and has been well publicized by Mr Berkson, here at Typophile, at type conferences, online at I Love Typography, and elsewhere.\n\n"
    },
    {
      "time": "17 Feb 2014 — 3:50pm",
      "content": "I did not think that Poliphilus was a distressed type, if I am understanding you correctly when you speak of a \"weathered effect\".\n\n"
    },
    {
      "time": "19 Feb 2014 — 4:20am",
      "content": "Charles: I didn’t know Trinité at all. What an extraordinary font! To my eyes, it comes closest to capturing the effect of the 1475 sample. Sadly (but perhaps justifiably) the price is extraordinary too. The Dutch Type Library typefaces look exceptionally well made, but nothing quite so close to what I have in mind. Were money no object, I think it’s Trinité I’d buy; as it is, for the moment, I shall wait.\n\nJohn: You’re quite right, I did mean ‘distressed’ by ‘weathered’, and Poliphilus isn’t distressed, just, as I understand it, somewhat irregular because it’s based on the typeface as it appeared on the page, allowing for inkspread, rather than trying to get back to the shape of the metal.\n\nNick: What a pity the market for revivals is so flat. Someone might think they’d seen all the Garamonds they could possibly want to and wonder what the point of another would be. But then they come across MVB Verdigris.\n\nOliver\n\n"
    },
    {
      "time": "19 Feb 2014 — 5:39am",
      "content": "> ... I did mean ‘distressed’ by ‘weathered’, and Poliphilus isn’t distressed, just, as I understand it, somewhat irregular because it’s based on the typeface as it appeared on the page, allowing for inkspread, rather than trying to get back to the shape of the metal.\n\nActually, allowing for ink spread is a part of designing the typeface in the first place, a necessary step. However, I think I know what you mean -- Poliphilus shows the variations of a particular \\*instance\\* of the piece of type a pressed into the paper, with attending warts, rather than the general effect.\n\nLooking at the piece of metal & reconstructing its outlines without taking into account the spread of ink is why first photocomp, now digital revivals look so pale & spindly. The ink spread needs to be accounted for, but regularized. Nor was this a surprise to the designers of type in those days. They would test a letter's design, then adjust it, based on the actual inkspread.\n\nYou might enjoy Fred Smeijer's book <cite>Counterpunch</cite>. More people should read it, including, IMSLTHO, contemporary type designers.\n\n[https://hyphenpress.co.uk/authors/fred\\_smeijers](http://web.archive.org/web/20150416050645/https:/hyphenpress.co.uk/authors/fred_smeijers \"https://hyphenpress.co.uk/authors/fred\\_smeijers\")\n\n<cite>Edit</cite>\n\nUntil you've enough interest to spring for Trinité, Golden Cockerel might interest you. While I don't particularly care for it, it does have some of the characteristics you're looking for.\n\n[http://www.fonts.com/font/itc/itc-golden-cockerel#product\\_top](http://web.archive.org/web/20150416050645/http:/www.fonts.com/font/itc/itc-golden-cockerel#product_top \"http://www.fonts.com/font/itc/itc-golden-cockerel#product\\_top\")\n\nBTW, Trinité has no ligatures, and no kerning. Whether or not it's worth the price is, as always, an individual's decision.\n\n"
    },
    {
      "time": "19 Feb 2014 — 10:37am",
      "content": "It has been a few years ago, but I remember I did employ Slimbach’s Adobe Jenson with much comfort.\n\nIf “Jensonian” may be interpreted with more liberty, also have a look at my fellow countryman [Dieter Hofrichter’s typefaces](http://web.archive.org/web/20150416050645/http:/www.myfonts.com/foundry/Hoftype/), e.g. Sina or Cala. I count them among the finest text faces available.\n\nLast but not least, for the “workhorse” (although not actually Jenson-based) but there’s still [Andron](http://web.archive.org/web/20150416050645/http:/www.myfonts.com/fonts/andreas-stotzner/andron-1-lat-corpus/) at your service, producing a somewhat similar ‘colour’ on the page when printed.\n\n"
    },
    {
      "time": "19 Feb 2014 — 4:20pm",
      "content": "\"It isn't the archaic features I'm missing, the long ‘s’ for instance. And it isn't the individual letter forms particularly; it’s the look of the whole that’s so special, once one gets a certain distance away from it.\"\n\nI think this is all attributed to the side-effects of the printing technique, which I think you have little control over. Letterpress always looks warmer and I can't help but feel it looks more impressive and refined.\n\nA while ago I reproduced some old letterpressed pages using digital fonts. In some cases I tweaked some of the display letters to get more of that original charm back, but as you can see here, in general it's still a lot more sterile and frankly doesn't look as impressive.\n\nHypnerotomachia Poliphili original: [link](http://web.archive.org/web/20150416050645/http:/fc09.deviantart.net/fs70/i/2012/269/4/e/hypnerotomachia_poliphili_original_by_martinsilvertant-d5g07xz.jpg)  \nHypnerotomachia Poliphili reproduction: [link](http://web.archive.org/web/20150416050645/http:/fc03.deviantart.net/fs71/i/2012/269/3/9/hypnerotomachia_poliphili_by_martinsilvertant-d5g0815.jpg)  \nTorneo Famoso: [link](http://web.archive.org/web/20150416050645/http:/fc04.deviantart.net/fs70/f/2012/241/e/a/l__algebre_by_martinsilvertant-d5ctqq7.jpg)  \nBibliotheque des Philosophes: [link](http://web.archive.org/web/20150416050645/http:/fc06.deviantart.net/fs71/f/2012/241/5/9/bibliotheque_des_philosophes_by_martinsilvertant-d5ctjp8.jpg)  \nDe Horlende Kollendans: [link](http://web.archive.org/web/20150416050645/http:/fc03.deviantart.net/fs70/f/2012/269/6/f/de_horlende_kollendans_by_martinsilvertant-d5g08ar.jpg)  \nTorneo Famoso: [link](http://web.archive.org/web/20150416050645/http:/fc06.deviantart.net/fs70/f/2012/241/a/4/torneo_famoso_by_martinsilvertant-d5cum27.jpg)\n\n"
    },
    {
      "time": "19 Feb 2014 — 5:27pm",
      "content": "> A while ago I reproduced some old letterpressed pages using digital fonts. In some cases I tweaked some of the display letters to get more of that original charm back, but as you can see here, in general it's still a lot more sterile and frankly doesn't look as impressive.\n\nWell. I'm impressed.\n\nBeyond that, letterpress has it's downside, too. A good friend of mine, the designer Rich Hendel, spent the first half of his career where books he designed were always set hot metal. He thinks modern type/printing is much better. I'd point out some of the old treasures like <cite>Hypnerotomachia Poliphili,</cite> and his rejoinder is something akin to \"yes, and for every good one, there were literally thousands of bad ones.\"\n\nAnd there are. I have a 12th printing (first printing 1903, 12th 1906) of Jack London's <cite>The Call of the Wild</cite> that is so bad you want to cry -- or take it to the outhouse for spare wiping material. Everything is bad -- except, probably the technical quality of the stereo plates (meaning the original was bad, too). Not an unimportant book, at least in the States. Many, many similar examples...\n\n"
    },
    {
      "time": "19 Feb 2014 — 10:32pm",
      "content": "Thanks, Charles.\n\nWould it be at all possible to take a picture of a page from The Call of the Wild and upload it here? I'm really curious what letterpress gone bad looks like. Every result I've seen so far has impressed the hell out of me, from the variety in the ink flow to the relief the ink has on paper. At least in my mind a letterpress gone bad would still look charming.\n\nAlso, do you know what caused it to become such a bad print? What do you mean when you say the original was bad, too?\n\n"
    },
    {
      "time": "20 Feb 2014 — 3:00pm",
      "content": "Fascinating to compare them, Martin.\n\nAnd, with due respect to the results, as you say, the Letterpress is warmer.\n\nThe difference between your Hypnerotomachia Poliphili and the original exactly captures the difference I find between the Jenson sample, and anything I try to make look anything like it (except that mine get nowhere near as close).\n\nWhat typeface were you using for your version of it?\n\nOliver\n\n"
    },
    {
      "time": "20 Feb 2014 — 6:31pm",
      "content": "I'm going off on what might seem to be a tangent here, bear with me.\n\nY0-Yo Ma has an electronic cello he can make sound virtually identical to his Guarneri. That it can also be made to sound different isn't relevant to this point. That when he chooses to make the electric sound like the Guarneri is.\n\nBut Ma, or a human of similar skill, has to play it. Click/flash/change. We can make a rhythm track to replace the drums. But it's metronomical precision soon lets everyone know it's a computer, useless beyond punching up the evening news. A human drummer is not a metronome, and musically, that's a vitally important difference.\n\nIt is the same with printing, with the \"warmth\" of letterpress. Font outlines can be drawn to have the contrast of a (mythical) typical letter, as found printed letterpress. But the use of the computer in printing today makes every letter (a, l, e, etc.) look the same, and perhaps worse, the spacing too is identical in all planes. There is a feeling of precision, and an attendant lack of warmth.\n\nNow in type, anyway, the variations found in letterpress seem to me to be due to pure randomness, rather than the performance skill of the typesetter and printer. (OK, there are a few \"performance skills,\" but unlike music, most of them can be quantified & programmed.)\n\nSo I think any attempt to get the \"warmth\" of letterpress will fail, until a slight amount of randomness is introduced at all points -- the letterforms themselves, and their horizontal and vertical spacing, etc. Unlike music, I do think this can be programmed, as it's occurrence in metal/letterpress is also random, without any conscious or attentive thought. AFAIK though, not much work has been done along these lines.\n\nOn my analogy, the digital font would be the electronic cello. Not that hard to create. Playing it is a different matter.\n\n"
    },
    {
      "time": "20 Feb 2014 — 9:18pm",
      "content": "I’ve occasionally thought of making such a typeface.  \nBut I think I’d prefer to systematize the irregularity, integrating it with glyph shape in some way, otherwise it would be a rather dry exercise—despite producing a warm effect.\n\n"
    },
    {
      "time": "6 Mar 2014 — 3:33am",
      "content": "Oliver,\n\nThe typefaces I chose depended on the source. I obviously couldn't find exact matches but I managed to get pretty close by using mostly Adobe Caslon Pro. I also used an alternate cut of a different Caslon font, I used Garamond Premier Pro and I believe I used some Elzevir cut somewhere as well. Generally I just stayed close to what I know to be historically commonly used typefaces of the time, so Caslon would be the first choice.\n\nFor these reproductions my goal was to reproduce the pages using modern fonts. I did a lot of bad typographical practices like irregular spacing to get the charming effect of the original into the work, but it wasn't my goal to make the reproduction as accurate as possible. Another step towards such a goal would be the use of textures and filters to get the ink texture and irregularities of the lead letters and a final step would be to fake lighting and shadows.\n\n"
    },
    {
      "time": "6 Mar 2014 — 2:19pm",
      "content": "This edition of The Call of the Wild comes from about the right time, but it has decent typography:\n\n[https://archive.org/details/callofthewild00londrich](http://web.archive.org/web/20150416050645/http:/typophile.com/wiki/https%3A/%252Farchive.org/details/callofthewild00londrich)\n\nand similarly this one\n\n[https://archive.org/details/cu31924021763549](http://web.archive.org/web/20150416050645/http:/typophile.com/wiki/https%3A/%252Farchive.org/details/cu31924021763549)\n\nor this one\n\n[https://archive.org/details/callofwild00lond](http://web.archive.org/web/20150416050645/http:/typophile.com/wiki/https%3A/%252Farchive.org/details/callofwild00lond)\n\nNot good typography in some ways; too much space, so there was laziness involved, in some of these editions, but decent-looking typefaces and readable. I was expecting something execrable, on the order of\n\n[https://archive.org/details/adventurebeautif00whitrich](http://web.archive.org/web/20150416050645/http:/typophile.com/wiki/https%3A/%252Farchive.org/details/adventurebeautif00whitrich)\n\nactually, this isn't that bad, although it goes in the direction of the kind of Scotch Roman that is not to my taste; but despite horrendous typography coming up so often when one doesn't want it, it's hard to find it when one is looking for it.\n\n[https://archive.org/details/champesadventure00leeh](http://web.archive.org/web/20150416050645/http:/typophile.com/wiki/https%3A/%252Farchive.org/details/champesadventure00leeh)\n\nillustrates a somewhat unattractive typeface but too large to be unreadable.\n\nAh, this is not an attractive typeface,\n\n[https://archive.org/details/cu31924098819562](http://web.archive.org/web/20150416050645/http:/typophile.com/wiki/https%3A/%252Farchive.org/details/cu31924098819562)\n\nbeing quite narrow, but not also too light, as were the worst of the old Scotch Romans...\n\n[https://archive.org/details/uncletomscabin00stowuoft](http://web.archive.org/web/20150416050645/http:/typophile.com/wiki/https%3A/%252Farchive.org/details/uncletomscabin00stowuoft)\n\nfinally at least _approaches_ what I seek to put forwards as an example of a bad Scotch Roman.\n\nAnd, this, conversely - from a Ginn and Company textbook, so I presume it's Linotype and not Monotype - is an example of a good Scotch Roman. (Linotype did advertising figures too, so while they could never do four-line mathematics, very basic mathematical setting was not beyond their system.)\n\n[https://archive.org/details/IntegralCalculus](http://web.archive.org/web/20150416050645/http:/typophile.com/wiki/https%3A/%252Farchive.org/details/IntegralCalculus)\n\nHere is an image; on top, a \"bad\" Scotch Roman, and on the bottom a \"good\" Scotch Roman.\n\n ![](http://web.archive.org/web/20150416050645im_/http:/typophile.com/files/SCOTCH_5920.jpg)\n\nThe bad one doesn't look so much worse than the good in the image, though, since it's shown in a larger size so that the column widths match, and that makes the bad one look better.\n\n"
    },
    {
      "time": "8 Mar 2014 — 12:48pm",
      "content": "I find each sample you provided to be charming and contextually beautiful. That is to say, I recognize the bad typography but it doesn't quite register. I mean, I have plenty of 19th century and 20th century books which I bought not because of the content but because of the age and printing, and particularly the books from around 1920 I have are set in these Scotch typefaces. I guess in a way it's a natural progression from Baskerville. What I do notice is the wide spacing and plentiful gaps in the texts because of the justified text. Can't this be attributed to the lead letters though rather than the typographer? With modern software it's easy to make justified text look good and make it practical to read, but I can imagine with old printing techniques there just wasn't much control over the typography if the typeface is bad. I have to say though, most of these Scotch typefaces simply appear too light in print.\n\nAlso, when you refer to a typeface as bad in this context, I assume you're not necessarily referring to the design, right? If you are, I don't think I could judge the quality of a Scotch in use that well. The before-last link (Uncle Tom's cabin) looks alright to me. The last one (Integral Calculus) doesn't, but I like that. It would probably annoy me if I were to read a whole book set like that though (although I'm quite certain I did read the Bible set in a Scotch face, which wasn't the best read).\n\n"
    },
    {
      "time": "8 Mar 2014 — 6:52pm",
      "content": "I'm thinking now that the \"bad\" Scotch wasn't that bad; I've seen Scotch Roman typefaces I disliked, but they were more condensed than the example, and lighter than the example.\n\nThis\n\n ![](http://web.archive.org/web/20150416050645im_/http:/typophile.com/files/condex_6338.jpg)\n\nmight be a better example of a Scotch Roman that was too condensed to be good for use in body copy. But it's not really \"bad\", either, because it may be a little too condensed, but it isn't also far too light.\n\nAh, _here_ we are:\n\n ![](http://web.archive.org/web/20150416050645im_/http:/typophile.com/files/cx2_4748.jpg)\n\nI don't know how others will view the typeface in this sample, but I think it's far too condensed for reading.\n\n"
    },
    {
      "time": "8 Mar 2014 — 9:24pm",
      "content": "The issue for me is the strong vertical focus, which is partially caused by the condensed proportions but also the slightly squared design. The details also tend to blur together because of the printing as well as the high contrast of the type.\n\nBy the way, is this typically Scotch that the word spacing is so wide? I mean, I think a double space is used after a period anyway, but that makes the effect even worse. Or do you actually prefer these big spaces? I know someone who still uses double spaces.\n\n"
    },
    {
      "time": "9 Mar 2014 — 10:38am",
      "content": "Scotch required some composing and printing skill, in metal days, to get right.  \nAnd today, it’s impossible to judge the quality of such letterpress printing second hand, on a screen.  \nEven a high-res offset reproduction doesn’t tell the story.  \nThe quality is three dimensional.\n\n ![](http://web.archive.org/web/20150416050645im_/http:/typophile.com/files/Punch_6700.jpg)\n  \n(This is a photo taken at an angle, not a scan.) \n"
    },
    {
      "time": "9 Mar 2014 — 2:30pm",
      "content": "Good information. Are some of these lines really blurred or is that an artifact? I don't think I've seen blurs in letterpress printing before.\n\n"
    },
    {
      "time": "9 Mar 2014 — 6:24pm",
      "content": "I think that's just the camera shot, Martin (note Nick's comment below the image). Wide open macro = very shallow depth of field\n\n"
    },
    {
      "time": "9 Mar 2014 — 8:41pm",
      "content": "Logically I thought it was the focus of the camera, but the fact that both the front and back are blurred with some portions being sharper made me doubt myself.\n\n"
    }
  ]
}
