{
  "id": "114207",
  "title": "non-profit organizations using proprietary typefaces - what volunteers should do?",
  "forum": "Release",
  "tags": [
    "legal",
    "lincensing",
    "nonprofit",
    "publicdomain",
    "volunteer",
    "Release"
  ],
  "content": "It seems far more common that usual seeing non-profit organizations using proprietary typefaces in their brand manuals, and i really struggle seeing volunteers buying these typefaces for contributing with graphic design materials (such as posters, flyers, magazines, videos, etc.) using them.\n\nWhat is the most correct thing to do instead? To do a whole rebranding, replacing all proprietary typefaces with ofl/apache/cc-nc-sa/gpl licensed typefaces? look for the master drawings of the existing typefaces and make an experimental reinterpretation of them using ofl/apache/cc-nc-sa/gpl licensing? contacting the actual foundries and authors of these proprietary typeface asking for using and interventions on these typefaces? should volunteers completely ignore the organization's brand manual when relating to typefaces when proprietary?\n\nI'm curious about, not only for your opinions, as well about references citing or approaching situations like this. Thanks!\n\n",
  "author": "nitrofurano",
  "time": "15 Feb 2014 — 3:08am",
  "uid": "34245",
  "comments": [
    {
      "time": "15 Feb 2014 — 7:27am",
      "content": "Barring a donation from a foundry (which is not impossible – I've done charity font work myself) the only ethical option is to use free (and not necessarily libre) fonts.\n\nhhp\n\n"
    },
    {
      "time": "17 Feb 2014 — 8:51am",
      "content": "I’d ask the organization if they can give you a license for the fonts in question. There are (even ‘proprietary’) licenses that allow this.\n\nJust because an organization doesn’t work for profit doesn’t mean they cannot spend any money on anything. Or are they using open-source offices/water/electricity as well? ;)\n\nI’d say if the organization requires usage of certain fonts but cannot supply their designers with them, they have been given bad advice by their branding agency.\n\n"
    },
    {
      "time": "17 Feb 2014 — 6:59pm",
      "content": "Another option is to have a kind of \"typesetter\" for putting out the final product. I'd argue that Gaussian distribution for \"typesetting skill\" will be the norm. Moreover, with volunteers, that old, familiar bell-shaped curve will be rather farther along the \"not quite so good\" axis.\n\nSo, for either complex or \"branded\" (?) material, the files should go to someone with skill, mirroring the author -\\> editor -\\> compositor chain found in the commercial world. Only the \"compositor\" needs the actual, for-money fonts. The compositor(s) can be volunteer(s), of course, the point is only her (their) machine(s) need the high-dollar fonts.\n\n"
    },
    {
      "time": "25 Feb 2014 — 9:07am",
      "content": "Hi,\n\nAlternatively, you can use some non-profit-friendly free typefaces like Klima : [http://klima.io/](http://web.archive.org/web/20150414195350/http:/klima.io/ \"http://klima.io/\") (a FF Din alike typeface)\n\nƒrank\n\n"
    },
    {
      "time": "25 Feb 2014 — 9:13am",
      "content": "A typeface \"for the climate movement\" that looks like German heavy industry?\n\nBTW, the \"Italics\" are brute mechanical obliques. I wonder what the spacing is like...\n\nhhp\n\n"
    },
    {
      "time": "26 Feb 2014 — 4:08am",
      "content": "> I wonder what the spacing is like …\n\nLikely to be similar to the state our climate is in!\n\nQuote from the Klima website by Matthew Anderson:\n\n> … secondary characters like punctuation marks were drawn with a more humanistic style (the ampersand (&) and 'at' sign (@), for example),\n\nFor me that makes it pretty obvious where you took your outlines from, buddy … And if I’m right with that, how can you state:\n\n> … Professional type designers deserve to be paid for their work\n\nMaybe us type designers should also think about our own design-climate?\n\n"
    }
  ]
}
