{
  "id": "114237",
  "title": "Return key types lower case b",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "When using Pages, one of my fonts types lowercase b when return key is pressed. I have looked at other fonts I have created with the same version of fontographer but can't see any difference in the glyphs.\n\n",
  "author": "kbrusselljr",
  "time": "16 Feb 2014 — 12:22pm",
  "uid": "217691",
  "comments": [
    {
      "time": "16 Feb 2014 — 2:57pm",
      "content": "Another report of something similar:\n\n[https://discussions.apple.com/message/19413834#19413834](http://web.archive.org/web/20140804104710/https:/discussions.apple.com/message/19413834#19413834 \"https://discussions.apple.com/message/19413834#19413834\")\n\n"
    },
    {
      "time": "16 Feb 2014 — 3:04pm",
      "content": "Pages is apparently a word processing program for the Macintosh which is also (that is, Pages is also so sold in addition to the Macintosh) sold by Apple.\n\nGiven the post by Tom Gewecke, posted while I was typing the above, finding your post confusing, I remember that TrueType fonts, at least, have slightly different formats for use on Windows and Macintosh systems. Saving as a Macintosh font, thus, might help matters - although as I remember, the wrong type of font just wouldn't load, rather than causing mysterious bugs.\n\n"
    },
    {
      "time": "16 Feb 2014 — 5:26pm",
      "content": "This probably isn't the problem, but in Page's preferences make sure that the symbol and text substitution isn't making an unwanted substitution.\n\n ![](http://web.archive.org/web/20140804104710im_/http:/typophile.com/files/pages_4629.jpg)\n\n"
    },
    {
      "time": "16 Feb 2014 — 5:50pm",
      "content": "Thanks, Tom. Yes I think it is a similar problem, but I don't understand how this font could have gotten formatted for a different language keyboard, or how I can fix it.\n\n"
    },
    {
      "time": "16 Feb 2014 — 5:51pm",
      "content": "Thanks, James. I tried this with no luck.\n\n"
    },
    {
      "time": "16 Feb 2014 — 7:58pm",
      "content": "Might be worth a try to clear the font caches. How to here:\n\n[http://www.extensis.com/support/knowledge-base/clearing-the-mac-os-x-fon...](http://web.archive.org/web/20140804104710/http:/www.extensis.com/support/knowledge-base/clearing-the-mac-os-x-font-cache/ \"http://www.extensis.com/support/knowledge-base/clearing-the-mac-os-x-font-cache/\")\n\n"
    },
    {
      "time": "17 Feb 2014 — 7:14am",
      "content": "Regarding the language of the font, sometimes people fonts intended primarily for non-latin scripts (it was Telugu in the case I linked to) don't get tested as thoroughly for Latin text and bugs get through. Also it seems like Pages is affected by such bugs more than other apps.\n\n"
    },
    {
      "time": "17 Feb 2014 — 8:19am",
      "content": "Thanks everyone for your help. The problem seems to be fixed, unfortunately I am not certain how.\n\n"
    },
    {
      "time": "17 Feb 2014 — 9:41am",
      "content": "If it \"fixed itself\" it may well have been related to font caches.\n\n"
    }
  ]
}
