{
  "id": "114336",
  "title": "Aghari [an organic serif]",
  "forum": "Serif",
  "tags": [
    "Aghari",
    "organic",
    "Serif"
  ],
  "content": "Hello,\n\nI would like to present to you a typeface of mine. It's a somewhat organic serif typeface with subtle Middle-Eastern influences. There's definitely a lot of refining to do, but meanwhile I would like to gather your opinions and criticism.\n\nI also have some letters of a sans companion but I abandoned that for now because I first need to get the basic set of the serif right. I will also leave the display version until the regular version is done but I still wanted to show what I have.\n\nI'm aware of half the problems in this typeface but I'm curious about the problems I didn't see yet. This typeface is technically more advanced than what I've done before so it's particularly challenging to balance the weight and keep the design consistent, but I'm learning a lot from it. Let me know what you think.\n\n| Attachment | Size |\n| --- | --- |\n| [Aghari-Regular-v17.jpg](http://web.archive.org/web/20150317203053/http:/typophile.com/files/Aghari-Regular-v17.jpg) | 220.43 KB |\n| [AghariD-Regular-v17.jpg](http://web.archive.org/web/20150317203053/http:/typophile.com/files/AghariD-Regular-v17.jpg) | 216.91 KB |\n| [Aghari-Regular-caps-v17.jpg](http://web.archive.org/web/20150317203053/http:/typophile.com/files/Aghari-Regular-caps-v17.jpg) | 152.48 KB |\n| [Aghari-Regular-italics-v17.jpg](http://web.archive.org/web/20150317203053/http:/typophile.com/files/Aghari-Regular-italics-v17.jpg) | 138.31 KB |\n\n",
  "author": "Martin Silvertant",
  "time": "19 Feb 2014 — 9:23pm",
  "uid": "52182",
  "comments": [
    {
      "time": "19 Feb 2014 — 9:29pm",
      "content": "Nicely organic.  \nI would make the ascenders taller. (BTW why is the \"f\" short?)\n\nThe one thing I totally don't like though is the Italic: it looks like an impostor.\n\nhhp\n\n"
    },
    {
      "time": "19 Feb 2014 — 9:33pm",
      "content": "Here's also a short sample text, though it's from v16.\n\n ![](http://web.archive.org/web/20150317203053im_/http:/typophile.com/files/Aghari-Regular-v16_5058.jpg)\n\n"
    },
    {
      "time": "19 Feb 2014 — 9:36pm",
      "content": "Yes, the italic is rather challenging and I've actually not really decided which direction to take it yet. Right now I'm most happy with the lowercase roman, but even that needs a lot of work still.\n\nI wanted the /f to curve into itself but looking at it again it just looks cramped. I will raise the ascender and make the shape more open.\n\nDo you have any suggestions of typefaces I might look at for inspiration regarding the italics?\n\n"
    },
    {
      "time": "19 Feb 2014 — 9:50pm",
      "content": "[https://monokrom.no/fonts/satyr](http://web.archive.org/web/20150317203053/https:/monokrom.no/fonts/satyr \"https://monokrom.no/fonts/satyr\")\n\nhhp\n\n"
    },
    {
      "time": "19 Feb 2014 — 10:06pm",
      "content": "Ahh I actually have a few pictures of Satyr on my computer from when it was still in progress. Indeed a good typeface to look at.\n\nWhat do you think of the italics of [Kristal](http://web.archive.org/web/20150317203053/http:/www.eyalmyrthe.nl/letterontwerpen.php)? I think I might like to do something quite drastic with the italics. I believe your philosophy is that italics shouldn't contrast too much with the roman, right? Any thoughts?\n\n"
    },
    {
      "time": "19 Feb 2014 — 10:39pm",
      "content": "I think Kristal's Italic is expressive, and even attractive, but it's too \"headstrong\" to do the job of an Italic (which I do indeed feel generally needs to be subordinate to the Roman).\n\nhhp\n\n"
    },
    {
      "time": "20 Feb 2014 — 12:43pm",
      "content": "Martin: Such amazing stuff you are drawing. I’m amazed how different this is upclose than in (con)text. The lowercase a is especially delicious. Would love to see more!\n\n"
    },
    {
      "time": "4 Mar 2014 — 6:57am",
      "content": "The proportions seem a little off to me. I'd make e and r a little wider, and t a little narrower. The gaps in your display don't seem to follow a clear logic, which is not necessarily a bad thing, but be aware of it. Right now, to me it looks a little bit like you can't decide between stencil and non-stencil.\n\nI'm not going to repeat the obvious potential in your work every time, but remember that all feedback is positive feedback. People take the time to comment = people care.\n\n"
    },
    {
      "time": "6 Mar 2014 — 2:35am",
      "content": "@Frode: Thanks a lot! The lowercase /a was the starting point of the typeface and the glyph I'm possibly most proud of, of any glyph I've drawn so far. I'm glad to see you guys see the potential.\n\n@Jasper: You don't need to remind me of the value of feedback. Particularly since I have no formal education in type design I appreciate feedback tremendously because you guys often spot \"errors\" I missed or lacked an awareness of the problem in question to fix or improve the characters. You can be as brutal in your criticism as you want as long as it's constructive.\n\nI agree with the proportional issues you mentioned. The /r is always a problematic letter for me, actually. I think the /r in combination with a lot of other letters create a gap between the two letters which is too wide. A contextual ligature would do well here but I always try to resolve the gap issue as much as possible without having to utilize OpenType features. I certainly went too far with compensating for the gap here.\n\nAs for the display version, I wasn't trying to create a stencil letter and so it indeed lacks the consistency of a stencil. It's just that I thought this typeface works well in high contrast for display uses and I wanted a few characters to stand out a bit more. Perhaps it's indeed too much like a stencil, but I don't want to abandon the idea just yet. It's good to know I might have taken it too much towards a stencil design though.\n\n"
    },
    {
      "time": "8 Mar 2014 — 10:30pm",
      "content": "Here's a new preview of Aghari. I have a few deadlines for other work so I don't have time for a lot updates, but here are some:  \n• I made the /r wider and slightly raised the shoulder.  \n• I made the /s wider and changed the proportions and top serif a bit.  \n• I slightly condensed /t and replaced /s and /t in the s\\_t ligature with updated characters.  \n• I made /e a bit wider and slightly changed the weight distribution.  \n• I changed the proportions of /f.  \n• I increased the ascenders a bit.  \n• I added /E and /F.  \n• I balanced out /z and /Z.  \n• I improved the bowl of /a.\n\nAny other criticism is very welcome. Also, does anyone have tips for the design of /o,/O and the bowl of /g? I want to bring some tension in the weight distribution to make the shapes look more dynamic, but it's hard to balance symmetrical outlines with diagonal counters. I should possibly have a closer look at Legato.\n\n ![](http://web.archive.org/web/20150317203053im_/http:/typophile.com/files/Aghari-Regular-v18_4397.jpg)\n\n"
    },
    {
      "time": "9 Mar 2014 — 8:33am",
      "content": "I love the /v/!  \nFor /O/o/, see how it would look with a smoother, rounder outside contour--get the weight distribution and character you want from messing with the inner contour. My hypothesis is that the eye has more patience for funkiness in the counter shape if the overall glyph is predictably circular.  \nThe thick-thin-thick spine of /s/ is inelegant to my eye.  \nShortness of that /f/ may be odd in words with other ascenders.  \nEar of /g/ and spur of /G/ may be out of character.  \nCrossbar of /t/ looks a bit like a truck ran over it!  \nTop terminal of /C/G/ may be a little too limp.\n\n"
    },
    {
      "time": "9 Mar 2014 — 8:54am",
      "content": "Thanks for the criticism. Do you have a suggestion for the ear of /g? It's closer to the shoulder of /r, but I'm wondering if /r stands out too much. On the other hand, complete consistency is boring. Obviously the characters need to look like they belong to the same typeface, but I do want to keep individuality and try to make the letters work together more dynamically. Alegreya comes to mind for some reason.\n\n"
    },
    {
      "time": "9 Mar 2014 — 9:43am",
      "content": "It's just too tightly wound, I think.\n\n"
    },
    {
      "time": "9 Mar 2014 — 1:45pm",
      "content": "Here's another update. I will probably put the letters into FontLab next time and provide some short texts so you can judge the typeface better. Here are the changes:  \n• I raised the ascender of /f, changed the terminal and lowered the horizontal bar to interact better with /i.  \n• I changed the bowl and ear of /g and made the links a bit more robust. I also changed the composition a bit.  \n• I lowered the tittles of i/j.  \n• I made the /o a bit more square and changed the angle of the counter.  \n• I decreased the width of /r a bit and changed the terminal. I also increased the right side of the base.  \n• I changed the spine and curvature of /s and updated the s\\_t ligature.  \n• I made the crossbar of /t more straight and decreased the details.  \n• I changed the terminals in C/G and modified the whole shape.  \n• I decreased the width of E/F , made the top terminal more vertical and sharpened the top of the terminal a bit.\n\nI'm not yet satisfied with the ear of /g in particular. Next time I will give it another go.\n\n ![](http://web.archive.org/web/20150317203053im_/http:/typophile.com/files/Aghari-Regular-v19_6106.jpg)\n\n"
    },
    {
      "time": "28 Dec 2014 — 12:40am",
      "content": "Here's an update on Aghari: [http://cdn.vanillaforums.com/typeboard.vanillaforums.com/editor/r9/jhzxu...](http://web.archive.org/web/20150317203053/http:/cdn.vanillaforums.com/typeboard.vanillaforums.com/editor/r9/jhzxu222jr8w.pdf \"http://cdn.vanillaforums.com/typeboard.vanillaforums.com/editor/r9/jhzxu222jr8w.pdf\")\n\nCriticism is very welcome.\n\n"
    }
  ]
}
