{
  "id": "114346",
  "title": "Looking for the best “G”",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I’m looking for the best capital “G” to be incorporated into an art project. I’ve used an Old English “G” in the past, but I would like something more modern. Any ideas o ye of great taste?\n\n",
  "author": "wwgreaves",
  "time": "20 Feb 2014 — 6:03am",
  "uid": "216169",
  "comments": [
    {
      "time": "20 Feb 2014 — 9:02am",
      "content": " ![](http://web.archive.org/web/20150416051155im_/http:/typophile.com/files/G_5851.png)\n\n"
    },
    {
      "time": "20 Feb 2014 — 9:43am",
      "content": " ![](http://web.archive.org/web/20150416051155im_/http:/typophile.com/files/g_4949.png)\n\n"
    },
    {
      "time": "20 Feb 2014 — 10:46am",
      "content": " ![](http://web.archive.org/web/20150416051155im_/http:/typophile.com/files/CarmenLetterG_5184.jpg)\n  \nMy digitization of the upper case G from Carmen. Font not published.  \nFeel free to use the image in your project, but if you do, a credit would be appreciated.  \nI also have a version without the median spurs.  \nDon \n"
    },
    {
      "time": "21 Feb 2014 — 10:40am",
      "content": "Many thanks! These are inspired suggestions. I’ll try them all out. Andreas’s suggestion might work best. We’ll see.\n\n"
    },
    {
      "time": "21 Feb 2014 — 9:34pm",
      "content": "A good \"G\" has a strong horizontal bar.\n\nhhp\n\n"
    },
    {
      "time": "22 Feb 2014 — 1:11am",
      "content": "\\> A good \"G\" has a strong horizontal bar.\n\nYes. And a long tail and a tiny Ascot hat.\n\n ![](http://web.archive.org/web/20150416051155im_/http:/typophile.com/files/g_4240.jpg)\n\n"
    },
    {
      "time": "23 Feb 2014 — 2:53am",
      "content": "---start quote---  \nA good \"G\" has a strong horizontal bar.  \n---end quote---  \nWhy?  \nHere are three Gs I recently made, shown in context. Each meets a different need, only one has a strong horizontal bar.\n\n ![](http://web.archive.org/web/20150416051155im_/http:/typophile.com/files/ThirdManInGodWeTrust_4093.jpg)\n  \nA sans based on the lettering on the Criterion DVD cover for THE THIRD MAN. Clearly it does not say that we trust in a codfish.  \n\n ![](http://web.archive.org/web/20150416051155im_/http:/typophile.com/files/UnderwoodChampionGroves_3531.jpg)\n  \nMillions of words were typed in this font on the Underwood Champion Typewriter in WWII. A thin monoline Roman with unambiguous letters that remain quite legible even when read in the blurred fifth carbon copy page. Comments I have seen say the font looks more attractive than other typewriter fonts.  \n\n ![](http://web.archive.org/web/20150416051155im_/http:/typophile.com/files/PalmerRevised_5416.jpg)\n  \nMillions of North American schoolchildren were taught cursive writing based on variations of the Palmer System of handwriting. This one is standardized to enable consistent linking of the letters.  \nI doubt that middle G the only one that is a candidate for being a \"good\" G.  \nDon \n"
    },
    {
      "time": "22 Feb 2014 — 6:48am",
      "content": "Because that makes it less a \"C\".\n\nLet's look at each one of those four:  \n- The first looks like a Devanagari \"s\" with an exotic accent. Nice logo for a yoga studio in Szczecin...  \n- The second is pretty much a \"C\" in smaller sizes.  \n- The third is fine, if ugly.  \n- The fourth is totally unfamiliar to many people. And hopefully will be to everybody eventually.\n\nOf course context make a lot of difference, but the basis remains.\n\nAll that said however, it was probably better to say \"better\" instead of \"good\".\n\nhhp\n\n"
    },
    {
      "time": "23 Feb 2014 — 10:25am",
      "content": "The horizontal stroke on a G is like the horizontal stroke on a J: although it makes a bigger difference its not needed for disambiguation or increased legibility. The classic pattern (= the basic structural model) is in both cases: no hor. stroke.\n\n"
    },
    {
      "time": "23 Feb 2014 — 10:42am",
      "content": "People don't read \"classic\". If you remove the horizontal stroke from Donald's first and second samples (the third is too American to talk about) they become a \"C\".\n\nhhp\n\n"
    },
    {
      "time": "24 Feb 2014 — 4:46am",
      "content": "First, I truly disagree with Hrant's assessment of the the three Gs I posted a couple of days ago. In my view each is a \"good\" G in the context of the font in which they appear -- unambiguously a G even in the black sans, which would be used only at titling/display sizes.  \nSecond, I do have a G to offer that I consider to be a \"bad\" G. Unless one is an expert in this particular style of typography -- Fraktur -- there is little to guide the reader to recognize which letter is a G, rather than an E, S or C:\n\n ![](http://web.archive.org/web/20150416051155im_/http:/typophile.com/files/FetteFrakturSGFC_6425.jpg)\n  \nSo dear reader, I invite you to play the game of \"find the G.\" Also, for that matter, the E, S, and C.  \nBTW I clearly recall this problem from when I was learning to read Fraktur -- I had to tell them apart mainly by context.  \nDon \n"
    },
    {
      "time": "24 Feb 2014 — 5:11am",
      "content": "S G  \nE C\n\nDo I win a prize?\n\n"
    },
    {
      "time": "24 Feb 2014 — 6:19am",
      "content": "Hi Andrew, you are indeed a winner! You can print a gold star for your exercise book.  \nOther contestants please cover the answer before you try the challenge.  \nDon\n\n"
    },
    {
      "time": "24 Feb 2014 — 12:37pm",
      "content": "My contribution to your G quest. Also a contender for Don's \"guess the blackletter capital\" competition:\n\n ![](http://web.archive.org/web/20150416051155im_/http:/typophile.com/files/go_G_6355.png)\n\n"
    },
    {
      "time": "24 Feb 2014 — 12:40pm",
      "content": "Here's a rather unconventional take, based on a delightful painting by Wassily Kandinsky entitled “Succession”...\n\n ![](http://web.archive.org/web/20150416051155im_/http:/typophile.com/files/kandinsky_4415.png)\n\n"
    },
    {
      "time": "24 Feb 2014 — 7:36pm",
      "content": "Hi Nick, I love Kandinsky. Flip & combine and G becomes a fat cat:\n\n ![](http://web.archive.org/web/20150416051155im_/http:/typophile.com/files/Cat_4463.jpg)\n  \nCat sez, I'm really a good G -- with horizontal bars -- meow.  \nDon \n"
    }
  ]
}
