{
  "id": "114327",
  "title": "News Gothic and Source Sans Pro",
  "forum": "Typography / Composition",
  "tags": [
    "news gothic",
    "Source Sans Pro",
    "Typography / Composition"
  ],
  "content": "Hi, I would like som opinions on my work combining the classic News Gothic typeface with the modern face Source Sans Pro by Paul Hunt on my website. I think the two pair well together, due to e g similar x-height, but I'm sure you guys have some valuable feedback. What do you think? [http://lindesvard.se](http://web.archive.org/web/20150426051754/http:/lindesvard.se/ \"http://lindesvard.se\")\n\n",
  "author": "ericlindesvard",
  "time": "19 Feb 2014 — 3:15pm",
  "uid": "217770",
  "comments": [
    {
      "time": "19 Feb 2014 — 8:45pm",
      "content": "News Gothic looks quite nice (though not as beautiful as on Adobe Typekit, but I guess that's due to different rendering techniques), but Source Sans Pro doesn't render that well here. Here's a [screenshot](http://web.archive.org/web/20150426051754/http:/i1231.photobucket.com/albums/ee503/msilvertant/Lindesvaumlrd.jpg), though it's slightly blurry, which is not how your text renders.\n\nIt's not very bad though. Helvetica is much worse on the web in a Windows environment. But if you look at the /R in Source Sans Pro, I don't think it's hinted properly. The bowl of /p and /b also renders too wide I think.\n\nRendering aside, the typefaces do work quite well together, but I'm not quite sure why it's important to have the same x-height here.\n\n"
    },
    {
      "time": "21 Feb 2014 — 9:56am",
      "content": "Hi Martin, thanks for your input. You're right. Source Sans looks awful in the image you linked to. Hm, wonder why. What browser? In my browsers on the Mac, the page has a far better look-and-feel. Regarding similar x-height, I think it creates a stronger feeling of kinship between the two faces. Maybe not a critical issue but I do think it matters.\n\n"
    },
    {
      "time": "6 Mar 2014 — 3:40am",
      "content": "I'm using Chrome, but it looks the same in other browsers. I think it has to do with the differences in rendering methods of text on Mac and Windows.\n\nI think the x-height is relevant if you're going to use the typefaces at the same point size. Otherwise, I think the stronger feeling of kinship is mostly an appreciation of consistency and has no actual effect on the aesthetics. I might be wrong though.\n\n"
    }
  ]
}
