{
  "id": "114351",
  "title": "Well hinted font for resume",
  "forum": "Design",
  "tags": [
    "consultant",
    "font hinting",
    "resume",
    "Design"
  ],
  "content": "I would appreciate your recommendation for a typeface for a resume for a freelance management consultant that is well hinted for Mac and Windows, I might end using it for my reports too if it can be embed in Word. Currently I am using Georgia+Verdana for screen and document sharing as it is “standard” but I am considering investing on something more “exclusive”.\n\nThank you for your expert advice.\n\nRegards, Carlos.\n\n",
  "author": "csicilia",
  "time": "20 Feb 2014 — 8:36am",
  "uid": "214558",
  "comments": [
    {
      "time": "20 Feb 2014 — 1:06pm",
      "content": "Hi Carlos.\n\nAll the web fonts from Monokrom are hinted by hand, optimized for ClearType and the rendering engines that follows ClearType on Windows.\n\nThe “Screen” stuff is also drawn to perform especially well in low resolution environments. Unfortunately, we haven’t thought of the possibility that people might be interested in using hinted fonts outside of the web, so our web licenses only cover online use (and mockup). Maybe this kind of usage should be part of what we now call an App license (seeing that these are also hand-hinted TrueType fonts), or maybe we should considering a hinted TT option for the Desktop license. In any case, we’d be happy to discuss an arrangement if you are interested in licensing any of our typefaces.\n\nThat’s what we have to offer, but there are surely others that deliver high-quality text type for screen. The RE series from Font Bureau come to mind, Typotheque’s Screen series, Commercial Type have a very nice way of showing the rendering under various systems directly on their website, anything that crossed the desk of Tiro Typeworks (obviously), Letters From Sweden, FontFont, I’m guessing Dalton Maag walks the extra mile (judging by their recent job openings and current staff), Just Another Foundry is another foundry that takes the screen seriously, and I know first hand Mário Feliciano offers well hinted stuff.\n\n"
    }
  ]
}
