{
  "id": "114484",
  "title": "food stall font (3 fonts), display / text , commercial use",
  "forum": "Home",
  "tags": [
    "Display"
  ],
  "content": "So i have to do some kind of logo guidelines for this, but I dunno what fonts were used for:  \n1 - the white text (the capitals and the small letters)  \n2 - the diagonal one  \n3 - the Chinese looking ones\n\nAnyone know of them?\n\n ![](http://web.archive.org/web/20141022074652im_/http:/typophile.com/files/391795_10152348378695647_1453127551_a_4605.jpg)\n\nThat's the biggest image I have seen so I am sorry if it may look unclear. Even the most similar fonts would be really helpful.\n\nWhat I perceive about this:\n\nwhite bold (or more) center text  \n- curved vertices  \n- capital C is a portion cut straight (but not exactly from the center) from capital O  \n- really thick (or plump even)  \n- looks like there was kerning involved here\n\nthe RBX (diagonal)  \n- curve font  \n- direction of type seems to be sweeping upwards  \n- looks like handwritten type in some sort of way  \n- the capital letters seem to be different from the small letters - as if they come from different families (unsure)\n\nthe Chinese characters  \n- sans serif  \n- looks the same as what I remember with other fonts\n\nLinks to the websites [here](http://web.archive.org/www.rbx.com.ph/) and  \nhere: [https://www.facebook.com/pages/RBX-Rice-in-a-Box/239394555646](http://web.archive.org/web/20141022074652/https:/www.facebook.com/pages/RBX-Rice-in-a-Box/239394555646 \"https://www.facebook.com/pages/RBX-Rice-in-a-Box/239394555646\") (Facebook .\\_.)\n\nUPDATE: I did notice or am just experimenting that the typefaces may have been altered by doing a bold stroke (using the bold tool in a word processing program such as MS Word) to attain that rounded vertices sans serif look. Just a heads up. (So much bad practice for this business, but that's what was assigned to me.)\n\nFONTFACE 1: Dokyo by Ben Balvanz (RICE & BOX) and Interstate Bold by Tobias Frere-Jones (in a) - as commented by \"fvilanakis\" [FINAL]  \nFONTFACE 2: Komika Axis by Vigilante TC - as commented by \"Renko\" [FINAL]  \nFONTFACE 3: Apple SD Gothic Neo - as commented by \"osamu\" [TENTATIVE; FINAL] - substituted Nanum Gothic\n\nFont:&nbsp;\n\n Dokyo, Interstate Bold, Komika Axis, Apple SD Gothic Neo \n\n| Attachment | Size |\n| --- | --- |\n| [391795\\_10152348378695647\\_1453127551\\_a.jpg](http://web.archive.org/web/20141022074652/http:/typophile.com/files/391795_10152348378695647_1453127551_a.jpg) | 10.01 KB |\n\n",
  "author": "shanzz",
  "time": "25 Feb 2014 — 12:18pm",
  "uid": "217909",
  "comments": [
    {
      "time": "25 Feb 2014 — 3:03pm",
      "content": "Not able to help with the latin text, but I did look at the Kanji. Unfortunately I don't have a huge store of Kanji types to play with so I thought I'd offer some assistance in helping you or others track it down.\n\nThe image is too small to tell if the strokes are rounded slightly like the latin \"Rice in a Box\" or not, but in any case you are looking for a bold sans serif (as you said) with minimal stroke contrast. One feature that stands out is the stroke alignment. The 'dot strokes' are either perfectly vertical (as with the top of the second character), or all horizontal (as with the left-side radical on the third character). Though not unheard of it is unusual and may help you to narrow down the field. The other features are an elbow-join rather than a t-join on the foot of the second character, and an upwards curve on the 'lid' of the right-side of the third character. See below.\n\n ![](http://web.archive.org/web/20141022074652im_/http:/typophile.com/files/chinese_5239.png)\n  \nHere I've used two system fonts to illustrate the features. No font I had included all these features, but the first shown here comes closest in colour.\n\nNot all the Chinese fonts I had included the third character (Han/meshi - \"cooked rice\" or \"meal\") which leads me to believe it may not be a character in standard use in written Chinese. It is very much in everyday use in Japanese, however.\n\n"
    },
    {
      "time": "25 Feb 2014 — 3:19pm",
      "content": "#2 looks like [Komika Axis](http://web.archive.org/web/20141022074652/http:/www.dafont.com/komika-axis.font?fpp=100&af=on&text=RBX) by Vigilante TC.\n\n"
    },
    {
      "time": "25 Feb 2014 — 4:01pm",
      "content": "thank you for the first two comments, much appreciated.\n\nFor the first comment:  \n- I did assume that all of it was leaning towards the Japanese, but since it did evolve from the Chinese, I said it like that.  \n- It's cool that you can actually read Kanji since I only had it as an elective. Would you happen to know what each character means? (only got the last character in Japanese \"meshi\" as food)  \n- I was\n\nFor the second comment:  \n- It's actually exact and I did question myself about this since I have seen that font before. Thank you.\n\nFor both comments:  \n- I do believe the fontfaces are in bold (stroked by a word program like MS Word or something) to attain that rounded effect. Just something that I noticed today.\n\n"
    },
    {
      "time": "25 Feb 2014 — 4:23pm",
      "content": "I've just realized that the third character is the traditional form and so not really used any more in China. It has been replaced by the simplified form as is now the standard.\n\nThe word(s) 盒之飯 would be read as \"He zhi fan\". First character (盒) = 'a lidded box', Second character (之) is a genitive/modifer, Third character (飯) as you're aware means rice, specifically cooked rice. So 盒之飯 literally means \"box of rice\".\n\n"
    },
    {
      "time": "25 Feb 2014 — 4:30pm",
      "content": "@osamu  \nI just happen to use this site [here](http://web.archive.org/web/20141022074652/http:/kanji.sljfaq.org/) since it can identify the stoke and put it in text form, but thank you! :) Knowing the meaning does help too.\n\n"
    },
    {
      "time": "25 Feb 2014 — 5:27pm",
      "content": "#1 - \"RICE BOX\": looks like an emboldened **[Dokyo](http://web.archive.org/web/20141022074652/http:/www.findmyfont.com/index.php/fonts/font-preview?fset=Dafont-1&ffam=Dokyo%20-%20Regular&fid=95748831f11edd399a25a5f6cc33b85b&fstyle=b&fsize=60&text=RICE%20BOX&fit=1)** by Ben Balvanz [Fontalicious, 2002, Free for personal use]\n\n#1 - \"in a\": could be an emboldened **[Interstate (Bold)](http://web.archive.org/web/20141022074652/http:/www.findmyfont.com/index.php/fonts/font-preview?fset=Font-Bureau&ffam=Interstate%20-%20Bold&fid=745b885dafbe71e8916e6a78bc95c000&fstyle=b&fsize=60&text=in%20a&wrap=2)** by Tobias Frere-Jones [Font-Bureau, 1993]\n\n"
    },
    {
      "time": "25 Feb 2014 — 6:00pm",
      "content": "@fvilanakis  \n- thank you for the rice box one. I had that feeling it had the name of a japanese kind of fontface.  \n- the \"in a\" though im unsure with Interstate, I think it does fit well when overlapping it. Thank you as well.\n\n@osamu  \n- I dunno how to get Apple SD Gothic Neo as of now (since I am using a Windows computer.) Anyway, I substituted for Nanum Gothic instead (Had the same feel as what you suggested.)\n\nWell, thank you all! :) How do I make you all the people who suggested the fonts for this?\n\n"
    }
  ]
}
