{
  "id": "114488",
  "title": "small caps iota with punctuation?",
  "forum": "General Discussions",
  "tags": [
    "all small caps",
    "General Discussions"
  ],
  "content": "Hi, is it ok to make small caps iota (I) with the dot on top? I know it is not commonly used but is a distraction?\n\n",
  "author": "milano",
  "time": "25 Feb 2014 — 1:24pm",
  "uid": "89844",
  "comments": [
    {
      "time": "25 Feb 2014 — 5:33pm",
      "content": "Small caps follow the design of upper case letters.\n\nI am not aware of any iota with dot accent. Where do you saw it? This may be not a distraction but a less known diacritic combination. It would be interesting to know about it.\n\nAlso note iota is found in Latin, Greek and Cyrillic scripts, being a diferrent character in each one (with different Unicode codification).\n\n"
    },
    {
      "time": "25 Feb 2014 — 8:33pm",
      "content": "I know some display faces include design elements from lower-case letters in their upper case.\n\nSometimes it's traditional - an uppercase U that looks like an enlarged lowercase U is found in a number of oldstyle faces.\n\nOther times, one is dealing with faces that seek to obtain a unicase effect, analogous to the lowercase of Peignot, for example. But while that is \"OK\" in the sense of being accepted, it is also distracting - so it's done only in intentionally extravagant display faces.\n\nThink of [Jazz Gothic](http://web.archive.org/web/20140802220006/http:/www.myfonts.com/fonts/canadatype/jazz-gothic/) from Canada Type, for example.\n\n"
    },
    {
      "time": "25 Feb 2014 — 11:15pm",
      "content": "Thanks for the answers, I saw it right here [http://www.myfonts.com/fonts/linotype/ginkgo/](http://web.archive.org/web/20140802220006/http:/www.myfonts.com/fonts/linotype/ginkgo/ \"http://www.myfonts.com/fonts/linotype/ginkgo/\") just look at the small caps and there it is an iota with dot. And it is not a display typeface so it's really odd.\n\n"
    },
    {
      "time": "25 Feb 2014 — 11:30pm",
      "content": "That's a different character: in Turkish, i with dot and i without dot are different letters.  \n [http://en.wikipedia.org/wiki/Dotted\\_and\\_dotless\\_I](http://web.archive.org/web/20140802220006/http:/en.wikipedia.org/wiki/Dotted_and_dotless_I)\n\nIf you intend your font to support the Turkish language, you need both forms. If not, it would be very confusing to use the dot above I.\n\n"
    }
  ]
}
