{
  "id": "1144",
  "title": "(x) The R&B Group - Caslon 540, Frutiger {Eduardo, Jill}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi   \n   \nCan you help me ID these fonts, I thought the sans was Gill, but the R seems a little different. I have no idea about the serif.   \n   \n ![](http://web.archive.org/web/20050525000309im_/http:/www.typophile.com/forums/messages/83/15375.jpg)\n\n",
  "author": "union",
  "time": "Thu, 2003-09-04 08:55",
  "uid": "614",
  "comments": [
    {
      "time": " Thu, 2003-09-04 09:12",
      "content": "The sans, it's Myriad.   \nThe serif, seems like some Caslon.\n\n"
    },
    {
      "time": " Thu, 2003-09-04 14:57",
      "content": "The sans looks like Johnston Sans to me; the font for the Underground. Similar to Gill but with a few tiny changes. I thought Myriad had a different G and R.\n\n"
    },
    {
      "time": " Thu, 2003-09-04 15:09",
      "content": "Oh, my mistake. Johnston has a straight leg...the Gs are very similar however.\n\n"
    },
    {
      "time": " Thu, 2003-09-04 19:25",
      "content": "The sans is definately Frugal Sans. Myriad has a different G and R.\n\n"
    },
    {
      "time": " Fri, 2003-09-05 03:36",
      "content": "thanks\n\n"
    },
    {
      "time": " Fri, 2003-09-05 03:58",
      "content": "Hmm, if it's Frutiger, then it has been stretched slightly. Frutiger's O is more oval, this one is rounder. I had thought that it might have been a Multiple Master Myriad. But you're right about the G and R.\n\n"
    },
    {
      "time": " Fri, 2003-09-05 05:59",
      "content": "Ha! Is this not the most contested identification ever?\n\n"
    },
    {
      "time": " Fri, 2003-09-05 07:15",
      "content": "The stress here looks inclined to me. Look at the \"flat parts\" on the top and bottom of the G. The top is slightly longer and ends more to the right than the bottom. I tested this in Photoshop. The G is consistent with Frutiger.   \n   \n(I would post my test image, but I keep getting 500 errors. The [MyFonts rasterization](http://web.archive.org/web/20050525000309/http:/www.myfonts.com/fonts/linotype/frutiger/55-roman/testdrive.html?s=GROUP&p=48) has similar characteristics.)\n\n"
    },
    {
      "time": " Fri, 2003-09-05 08:32",
      "content": "I tried long and hard to find a link to back up my Frugal Sans claim ..but couldn't find it anywhere except it my font binder I have in front of me. I don't know where I got the font or who designed it but it matches exactly to the sample posted. Sorry for confusing anyone.\n\n"
    },
    {
      "time": " Fri, 2003-09-05 13:41",
      "content": "Well, at least I don't feel so bad now by contesting the sans since everyone else is doing it too. heh.\n\n"
    },
    {
      "time": " Sun, 2003-09-07 01:13",
      "content": "\\> I found confirmation of the Frutiger/Frugal Sans link.   \n   \nDon't kill me Yves, but can you elaborate on this. I found this [Frugal Sans](http://web.archive.org/web/20050525000309/http:/fonty.nettown.cz/?Frugal-Sans-EE) and the G sure looks different from the one here. There's definitely very little Frutiger in there. Am I looking at the right Frugal?\n\n"
    },
    {
      "time": " Sun, 2003-09-07 07:55",
      "content": "That's not the one Karen. Jill's is probably the Digital Typeface Corporation (DTC) Frutiger knockoff. I believe that DTC is now defunct.   \n   \nDTC fonts were bundled with some app of mine from long ago. I thought I'd cleared them off my HD, but I see that Frugal Sans was missed (I have Bitstream's Frutiger clone Humanist 777 anyway).\n\n"
    }
  ]
}
