{
  "id": "114546",
  "title": "Calligraphic display type with unusual letter widths from 1947 book cover",
  "forum": "Home",
  "tags": [
    "Display"
  ],
  "content": "I bought a pile of 1940s-50s Swedish poetry books yesterday at a second-hand book store, among them this 1947 collection. At first I assumed the cover was lettered (because 1940s), but on closer inspection it's clearly type, with exactly repeating characters.\n\n ![](http://web.archive.org/web/20150414194247im_/http:/typophile.com/files/DSC_0135_lr_5093.jpg)\n\nSorry for the lighting issues. Attached is as high-res as my phone camera allows if it helps; it's actually a fair bit crisper than that in real life.\n\nFont:&nbsp;\n\n Post-Antiqua \n\nSolved By:&nbsp;\n\n [Albert Jan Pool](http://web.archive.org/web/20150414194247/http:/typophile.com/user/14436 \"View user profile.\")\n\n| Attachment | Size |\n| --- | --- |\n| [DSC\\_0135 copy.jpg](http://web.archive.org/web/20150414194247/http:/typophile.com/files/DSC_0135%20copy.jpg) | 1.62 MB |\n\n",
  "author": "Birdseeding",
  "time": "27 Feb 2014 — 12:50am",
  "uid": "88704",
  "comments": [
    {
      "time": "27 Feb 2014 — 2:26am",
      "content": "[Procopius](http://web.archive.org/web/20150414194247/http:/www.myfonts.com/fonts/scriptorium/procopius) by David Nalle is a match.\n\n"
    },
    {
      "time": "27 Feb 2014 — 3:29am",
      "content": "Nice! I wonder what the metal original was?\n\n"
    },
    {
      "time": "27 Feb 2014 — 6:49am",
      "content": "That’s Post-Antiqua. It was designed by Herbert Post in 1932 for the Berthold type foundry in Berlin.  \n [http://www.myfonts.com/fonts/berthold/post-antiqua-bq/](http://web.archive.org/web/20150414194247/http:/www.myfonts.com/fonts/berthold/post-antiqua-bq/ \"http://www.myfonts.com/fonts/berthold/post-antiqua-bq/\")  \nProcopius is a match, but the spacing seems to be corrupted, try Ja … or type in nbnjn. The side bearings have probably been set on an equal value, calculated from the x-extremes. The apostrophe, the quotes and the @ look as if they were taken from Arial. The euro is missing etc. …\n\n"
    },
    {
      "time": "27 Feb 2014 — 6:39am",
      "content": "Thanks Albert for finding the original. I always feel a bit uncomfortable with Scriptorium David Nalle fonts. Never know if it's an original design or it has been redrawn. That's also why I used \"a match\" thinking the original would show up...\n\n"
    },
    {
      "time": "27 Feb 2014 — 6:49am",
      "content": "The Scriptorium collection seems to be haunted with ‘redrawn’ versions of well known typefaces. Palatino, ITC Garamond, Friz Quadrata, ITC Benguiat, Americana, Trump Mediaeval … Just to name a few.\n\n"
    },
    {
      "time": "27 Feb 2014 — 11:48am",
      "content": "In light of the above, I changed the solving credit to Albert Jan. I hope you don't mind, Ryuk, thanks for your effort as well!\n\nIs it just me or have both of the digital versions significantly tempered the most unique aspect of the type on the title page, the extreme letter widths on A and W?\n\n"
    },
    {
      "time": "27 Feb 2014 — 12:33pm",
      "content": "It's interesting looking in Jaspert's \"Encyclopaedia of Type Faces\", because that book shows \"Post Roman\" as a Berthold typeface from 1937 that seems to match this sample. It has a lower case, but the showings include \"Post Title\", which is all caps. The Medium weights of each face has a very wide A and W, noticeably wider than in the Light and Bold weight versions.\n\nThe digital \"Post-Antiqua\" seems to have called the Bold version \"Medium\" and has only two weights now.\n\n- Mike Yanega\n\n"
    }
  ]
}
