{
  "id": "114516",
  "title": "Emil Yakupov R.I.P. (1957–2014)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The incredibly sad news continues this week.\n\nYesterday (February 25, 2014), Emil Yakupov has passed away. His heart stopped after his regular sports exercise. He was 56.\n\nTogether with Vladimir Yefimov (who had died almost exactly two years ago), Emil co-founded ParaType in 1998, a company that not only revolutionized the Cyrillic typeface world but was instrumental in building a bridge between the Russian typographic culture and the rest of the world. More than anybody else, Emil was the architect and tireless upholder of that bridge. Under Emil, ParaType has published hundreds of original Cyrillic typefaces and digital revivals of classic Russian and Soviet typeface designs.\n\nBut perhaps more importantly, it was Emil who has created vital business relationships with Bitstream, ITC, Linotype, Monotype, FontShop and many other font foundries. As a result of this relationship, numerous major Western font families have received high-quality Cyrillic companions, and were introduced to millions of users in Russia. It was Emil, Vladimir and the rest of the ParaType team who have greatly contributed to the transformation of the visual culture in the Cyrillic-writing world.\n\nEmil was also instrumental in introducing me to Russia. I first met him at the ATypI 1998 conference in Lyon. He gave me the “big ParaType font catalog”, which to me was a revelation. After browsing it, I “got” Cyrillic. I understood how it works, and fell in love in it. I would later spend hours looking at the catalog, and the ParaType fonts.\n\nAt the same conference, I also met Yuri Yarmola, now my co-conspirator at Fontlab Ltd., and a friend of Emil’s. Looking at the photo from Lyon 1998, I’m now surprised how little Emil changed over the last 16 years. When I last saw him in Amsterdam five months ago, he had the same energy.\n\nEmil has introduced me to other Russian type designers. I visited the ParaType offices in Moscow a few times, and was always met with great hospitality. At all the type conferences over the years, I always sat down with Emil, and we talked — about typography mostly, but also about family.\n\nEmil was a quiet, wise, kind and incredibly modest man equipped with a cheeky smile and subtle dry wit. He put tremendous personal efforts into publications created by ParaType and events organized by his company — these efforts were always about culture rather than pure business.\n\nPerhaps we were not very close friends, but he was one of my mentors. And a person I could always count and rely on.\n\nI am incredibly sad that he is no longer among us. Прощай, Эмиль.\n\n— Adam\n\n ![](http://web.archive.org/web/20150421203306im_/http:/typophile.com/files/atypi98_yuri&emil1_6417.jpg)\n\n",
  "author": "twardoch",
  "time": "26 Feb 2014 — 7:18am",
  "uid": "1133",
  "comments": [
    {
      "time": "27 Feb 2014 — 7:39am",
      "content": "Sorry to hear Adam. He sounded like a great guy too!\n\n"
    },
    {
      "time": "28 Feb 2014 — 5:07am",
      "content": "Very bad news indeed...\n\n"
    },
    {
      "time": "14 Mar 2014 — 7:40am",
      "content": "Sad news indeed. Extremely knowledgable and humble, always had time for people. Big loss.\n\n"
    }
  ]
}
