{
  "id": "114533",
  "title": "Herkild Grotesk No. 1 - my first digital typeface, early view",
  "forum": "Sans Serif",
  "tags": [
    "geometric",
    "grotesk",
    "Sans Serif",
    "sans serif"
  ],
  "content": "Hi there.\n\nI wouldn't mind a bit of critique on this, my first (more or less) digital typeface. It was intended as Schelter-Giesicke Grotesk meeting Helvetica with a dash of Bauhaus (Herbert Bayers \"Universal\", really), but so far it looks more like random Grotesk meeting Futura, but I like it anyway.\n\nI have added a pdf-file with the glyphs, I've imported in fontforge so far. This is a spare time project, so I am not working on it every day - or even every week. Some glyphs drawn have yet to be imported (either as SVG or high-resolution PNG). The glyphs have been drawn in originally in AutoCAD R14 (old, reliant beast), and later recreated in Inkscape, with the exception of the more complex straight-line glyphs (A, V, W, Z). Inkscape does not give me the control I need here, so Autocad it is. Anything with curves is done largely in Inkscape due to the many ready-to-go structures. 'D' was exported to PNG and traced in fontforge, because the SVG got messed up in fontforge somehow. I may do the same to 'B', 'G' (which needs a heavy overhauling), 'J' and 't'.\n\n| Attachment | Size |\n| --- | --- |\n| [hg1-view.pdf](http://web.archive.org/web/20150414025118/http:/typophile.com/files/hg1-view.pdf) | 26.49 KB |\n\n",
  "author": "Mr.Jones",
  "time": "26 Feb 2014 — 1:28pm",
  "uid": "217853",
  "comments": [
    {
      "time": "26 Feb 2014 — 5:13pm",
      "content": "I am not an expert in Latin letter design, but it looks nice and comfortable to the eye. Enjoy the rest of the journey!\n\n"
    },
    {
      "time": "15 Mar 2014 — 9:03am",
      "content": "Thank you. The journey is somewhat slow, filled with annoying issues; but those are lessened as I get to know the software tools better.\n\nAlso, I've been doing more work on the typeface, adding more lowercase letters and most numerals, some of which needs some extra love (5 and 9 in particular). The number of tweaks waiting to be done is increasing with every glyph, I make :p\n\n ![](http://web.archive.org/web/20150414025118im_/http:/typophile.com/files/hg1-20140315_3830.png)\n\n"
    },
    {
      "time": "16 Mar 2014 — 6:41pm",
      "content": "Move the linear part of the 5 slightly to the right? Something needs adjusting with the right hand curve at the T junction of the 9 (or 6 I am assuming you use components).\n\n"
    },
    {
      "time": "17 Mar 2014 — 12:26pm",
      "content": "That would be the weight of the right-hand curve in 9 (lefthand in 6). Yes, they are shapewise identical, but 9 rotated 180 degrees.\n\nThe weight of the curvature is too light and too even. There is next to no weight variation. Apart from that it kinda looks okay.\n\n"
    },
    {
      "time": "17 Mar 2014 — 2:22pm",
      "content": "I have taken a closer look at 6 (and 9). It is very much the weight of the curvature that needs to be fixed. Major blooper from me. I'll fix that friday or saturday, or next weekend.\n\n"
    },
    {
      "time": "18 Mar 2014 — 6:44pm",
      "content": "Actually I have no right to speak of weight variation - my current font is strictly mono-spaced (if that is the word?) equal width lines measured with a unit circle in Fontlab ! The matching Latins have some thickness variation, though. Now I see the Arabic 5 (egg-shaped oval) needs major work but the dot has been lowered.\n\n ![](http://web.archive.org/web/20150414025118im_/http:/typophile.com/files/AlQuds%20sample%20jones_4408.jpg)\n\n"
    }
  ]
}
