{
  "id": "1145",
  "title": "Spunk magazine Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This logo is for a alternative print design magazine based in Singapore. What do you think?   \n   \n   \n ![spunk logo](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/messages/29/1540.gif)\n\n",
  "author": "max_hancock",
  "time": "17 Jun 2002 — 6:04pm",
  "uid": "1121",
  "comments": [
    {
      "time": "17 Jun 2002 — 6:15pm",
      "content": "hi max. I visited your site and I think you can do better. I do not care for the disjointed letters in general, however the P and K are really nice. You may want to explore some more.   \nDoes the client want something clean, hi-tech,   \nor what?\n\n"
    },
    {
      "time": "17 Jun 2002 — 6:24pm",
      "content": "Here's a sample cover of the first issue (this was rejected)... Please, more opinions. I think I can do better too. Any ideas?   \n   \nIts a fairly upbeat but very young client.   \n   \n ![spunk sample cover](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/messages/29/1541.jpg)\n\n"
    },
    {
      "time": "17 Jun 2002 — 7:18pm",
      "content": "I actually like it better with the rest of the design than by itself. Anyway I will try to think of a better idea.\n\n"
    },
    {
      "time": "17 Jun 2002 — 8:14pm",
      "content": "here's some others.. they aren't as interesting to me but probably still good to show you all.   \n   \n ![spunk logo2](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/messages/29/1542.gif)\n\n"
    },
    {
      "time": "18 Jun 2002 — 1:43am",
      "content": "I like the unicase #4. clean, simple, unpretentious. Perhaps try a upside down U for the N. I may suggest doing the K more like..   \n ![spunk4.jpg](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/messages/29/1543.jpg)\n\n"
    },
    {
      "time": "18 Jun 2002 — 2:46am",
      "content": "Maybe I need to start over and do some hand lettering or something. I want this to have some character, maybe be even a little campy. But instead I've got all these NASA shapes going on. Then again, even that's retro these days. ![:)](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nOle, I do like your suggestions, its much appreciated.\n\n"
    },
    {
      "time": "18 Jun 2002 — 5:00am",
      "content": "My personal opinion is that the techno look is pretty trite -- almost expected. You might want to go one of two directions: the classic look (#4) or something totally unexpected. Go crazy.\n\n"
    },
    {
      "time": "18 Jun 2002 — 6:16pm",
      "content": "Here are the best of some experimental play. I think, to me at least, all these are pretty trite, except for maybe E4. I still like the forms of #2 over these, its more interesting/addictive.   \n   \n ![spunk-exp](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/messages/29/1549.gif)\n\n"
    },
    {
      "time": "18 Jun 2002 — 6:24pm",
      "content": "Here's some permutations of the more stable #4. I think 4E4 is working best.. but I like the funkiness of 4E7 too.   \n   \n ![funky4E](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/messages/29/1550.gif)\n\n"
    },
    {
      "time": "18 Jun 2002 — 6:53pm",
      "content": "The stencil one is pretty cool...   \n   \nOne potential direction: ditch the computer and try something with found objects or junk or signage or graffiti -- something away from the computer.\n\n"
    },
    {
      "time": "19 Jun 2002 — 4:54am",
      "content": "The orignal cover looks very close to the cover of the new Designers Republic book, in fact, it's almost a copy.   \n   \nI think the form is too simple, looks plain, Glutton has the right direction I think, but don't make it punky ![:)](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "19 Jun 2002 — 7:05am",
      "content": "Strange, I know of Designers Republic but I don't have or have seen any of their books. As you can see, i don't need to copy.. I'm quite good at puking up style. I guess this stuff really is passé...   \n   \nDon't forget... This is an alternative design magazine, it has to be something you can recognize from across the room among all sorts of other rubbish.\n\n"
    },
    {
      "time": "19 Jun 2002 — 8:56am",
      "content": "I agree Max, check out tDR site for the latest book covers.   \n   \nIt is all a bit Passé, but that shouldn't stop you from doing something radical or putting a new twist on it...\n\n"
    },
    {
      "time": "19 Jun 2002 — 11:30am",
      "content": "the ones with the UN ligature that looks like a rotated S is MONEY. that symbol can be used by itself because its a rotated \"S\" for \"Spunk\" and its also the UN lig. that symbol could be the colored dot thing at the end of an editorial in the mag (what are those things called) but im not sold on those letterforms yet.\n\n"
    },
    {
      "time": "19 Jun 2002 — 11:40am",
      "content": "Phil, are you sure the ones with the UN lig would be read as \"spunk\" out-of-context?   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jun 2002 — 8:53pm",
      "content": "some people might read spink. but i bet the mag would take that chance. looks too cool\n\n"
    },
    {
      "time": "20 Jun 2002 — 11:35pm",
      "content": "Its looking like the client likes 4E5. Still, its not looking spunky enough for me so I'm taking Phil's suggestion and trying other letterforms, something completely different but not way out there.   \n   \n ![spunkycowboy](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/messages/29/1568.gif)\n\n"
    },
    {
      "time": "21 Jun 2002 — 8:14am",
      "content": "Thanks for the entertaining look at logo development, Max. My favorite is 4E5.c, although I would kern it thusly:   \n   \n ![spunk_rev.jpg](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/messages/29/1569.jpg)\n\n"
    },
    {
      "time": "21 Jun 2002 — 10:21am",
      "content": "Max, be careful with your Brothers version - you might suddenly find a vigilante coming after you with a scythe, frothing in the mouth...   \n   \nhhp\n\n"
    },
    {
      "time": "21 Jun 2002 — 10:43am",
      "content": "C'mon now, let's keep the critique above-the-belt. Let's assume he owns the font before jumping to conclusions.   \n   \njb\n\n"
    },
    {
      "time": "21 Jun 2002 — 2:10pm",
      "content": "\\> Let's assume he owns the font   \n   \nI haven't assumed otherwise, and I don't even want to know.   \nAll I said is, \"be careful\".   \n   \nhhp\n\n"
    },
    {
      "time": "21 Jun 2002 — 2:22pm",
      "content": "Personally I do not care for \"brothers\". It is academically a nice design but I have yet to see it used on something that could not look better with a different type face. Stick to your own type design Max, it is far better than 'brothers\"\n\n"
    },
    {
      "time": "21 Jun 2002 — 3:54pm",
      "content": "Not really germane to this discussion, but I thought Brothers was used quite nicely in the posters and publicity materials for \"O Brother Where Art Thou.\"   \n   \nI choose to believe the choice of typeface was a little wink in the direction of typographers everywhere.\n\n"
    },
    {
      "time": "21 Jun 2002 — 7:44pm",
      "content": "Or just laziness.   \n [http://www.microsoft.com/typography/links/news.asp?NID=1675](http://web.archive.org/web/20150417170253/http:/www.microsoft.com/typography/links/news.asp?NID=1675)   \n   \nhhp\n\n"
    },
    {
      "time": "21 Jun 2002 — 8:49pm",
      "content": "Hrant, you crack me up. I have seen that poster.. I also use Brothers for the Magic-Marcus logo:   \n   \n [http://www.diphthong.com/magicmarcus/](http://web.archive.org/web/20150417170253/http:/www.diphthong.com/magicmarcus/)   \n   \n   \nI LOVE the Brother's face version but this is a 'design' magazine in Singapore, not Tennessee (trust me, it would still be a refreshing change from the usual logos around here but I doubt they have the true spunk to go for it, or, I mean its just not their character). The client wants to stick with 4E5.b and 4E5. But at the same time has thoughts to #4 with the reversing technique.   \n   \nStill, I don't think we are done yet.. Some are saying they like E5 instead, especially now after seeing the last two.   \n   \nMarc I think you right about the Kerning on 4E5.c, but to me, it loses appeal when its too tight. Imagine it on a magazine overlaying a photo.\n\n"
    },
    {
      "time": "21 Jun 2002 — 9:40pm",
      "content": "4e5.c looks kinda retro man but nice nevertheless, and am i ur client max?   \n   \n;0)\n\n"
    },
    {
      "time": "21 Jun 2002 — 9:59pm",
      "content": "Why yes you are Joel. ![:)](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/clipart/happy.gif) so is Edmund and Kerensa and the rest of the crew. Although I'm going to be the art director of Spunk Magazine, i'm detaching my self from being the client so I can be the designer. I know what I like, but I'm more interested in what you guys think!   \n   \nSorry for going public with this, I thought it would be nice to get some outside opinions aside from Spunk message board. Hope you don't mind.\n\n"
    },
    {
      "time": "22 Jun 2002 — 8:03pm",
      "content": "Hello Max, here is the Unicratica font based logo for Spunk I showed you a couple of days ago.   \n ![Unicratica Spun.jpg](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/messages/29/1575.jpg)\n\n"
    },
    {
      "time": "26 Jun 2003 — 8:14am",
      "content": "you know that there is this design firm in minneapolis here called spunk. their website is [www.spunknation.com](http://web.archive.org/web/20150417170253/http:/www.spunknation.com/).   \n   \nt1mmy\n\n"
    },
    {
      "time": "26 Jun 2003 — 11:01am",
      "content": "I thought this thread was about the Spunk (Jeff Johnson) of Chank & Spunk fame. Anyhow, the unicratica is nice but why does it look like the letters are playfully bouncing up and down?\n\n"
    },
    {
      "time": "26 Jun 2003 — 8:19pm",
      "content": "Here's an update to all that... we realize there are going to be other things called spunk, so no new revelation there. Thanks anyway. ![](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/messages/29/12250.jpg)\n\n"
    },
    {
      "time": "27 Jun 2003 — 5:34am",
      "content": "Well, if you decided for the clean way (not so (s)punky), than maybe you should make the un ligature more smooth. I don't know, maybe it is just the screen, but that curve seems to be a bit broken to me.\n\n"
    },
    {
      "time": "29 Jun 2003 — 10:12pm",
      "content": "i noticed the \"prate\" logo on the bottom left of the updated cover. did you end up getting prate to design the cover?\n\n"
    },
    {
      "time": "2 Sep 2003 — 3:01pm",
      "content": "I'd have to agree with Matjaz. The un ligature has some very visible tension where the two letters meet at the curve. It definitely needs to be smoothed out. Ignore perfect geometry here and cheat a little on the curve.   \n   \nYou can see the same problem with the S curve on the attached rough.   \n ![Spunk logo](http://web.archive.org/web/20150417170253im_/http:/www.typophile.com/forums/messages/29/15245.jpg)\n\n"
    },
    {
      "time": "4 Sep 2003 — 1:42pm",
      "content": "...I am chiming in to late. But Your orinigal gave me the idea for doing a techno-stencil approach. I haven' see alot of that around. But then again, I don't really look around for that.\n\n"
    }
  ]
}
