{
  "id": "1146",
  "title": "Line breaks",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,   \n   \nI just discovered this site, and have been reading all the postings. I realize that this is an ancient, dead message thread, but I felt moved to respond.   \n   \nI would absolutely prefer 'micro-(newline)electronics'; I find 'microelec-(newline)tronics' awkward. Just as you'd break a word between syllables, not arbitrariy, I'd prefer to break any kind of compound word between parts, in the most comprehensible place possible. A second point is that I'd also prefer to have the whole word 'electronics' instead of just 'tronics' widowed on the new line.   \n   \nIgnoring the line break, this is how you'd read it - which is more natural and comprehensible?   \n   \nmicro-electronics   \nmicroelec-tronics   \n   \nHrant, based on your comments, you might enjoy Francis Crick's book THE ASTONISHING HYPOTHESIS. Crick is one of the co-discoverers of the structure of DNA. The 'astonishing hypothesis' is that the mind is a manifestation of the physical brain. Crick specifically uses visual perception to illustrate this; it's a subject that fascinates me, as I'm sure it does many people here.   \n   \nThe signals from the retinas are sent directly to thousands of specialized visual-processing areas. Each processor looks for one very specific thing - a certain kind of horizontal line, a vertical line, diagonals at certain angles, certain colors. If a processor gets a match for what it 'looks' for, it sends a signal to the next level of processors. Eventually, a three-D model is constructed. You can look at an object on a tabletop, close your eyes and still reach over and pick the object up, because you have an accurate mental model of where that object is in space.   \n   \nWe're extremely good at spotting patterns - when we look at a dashed line, we see it as a line, not just a bunch of individual dashes. We instantly see an implied shape just by seeing parts of it. We're not confused when shapes are broken up - we can look through a multi-paned window, and we're not confused that our view is chopped into small rectangles. We can easily distinguish between individual objects even in a very cluttered scene - these things are all amazing. Most of the work of figuring these things out is done by these dedicated processors, working at a very low level.   \n   \nThere also seem to be processors that respond to anything remotely resembling a face - that's why something as abstract as ![:)](http://web.archive.org/web/20150417034843im_/http:/www.typophile.com/forums/clipart/happy.gif) is seen as a face; even the grill and headlights of a car can easily be seen as a face.   \n   \nThe way that these processors work also explains why we are easily fooled by certain kinds of optical illusions.   \n   \nMy favorite illustration in the book shows two clusters of outline circles like perfectly round 'O's. In the first group, all are complete except for one broken circle, which has a 'C' shape. The broken one instantly jumps out of the group in the first glance - you couldn't possibly miss it.   \n   \nThe second group is just the opposite: all circles are broken except for one. The one complete circle does not stand out at all - you need to hunt for it. The brain has high-speed, automatic tools for spotting broken geometric shapes, but not to automatically spot a complete shape among broken ones - you've got to work at that by brute force, examining each circle.   \n   \nWhich, coming around to a typographic topic again, suggests that some letter shapes work because they take advantage of the brain's built-in ability to automatically spot broken shapes - we're hard-wired to recognize the apertures in a letterform.   \n   \nThanks to another thread in this site, I now know how to say 'Tschichold' correctly - I've been asking people this for a long time. My guess would have been something close to 'shick-old,' so I've saved myself some future embarrasment.   \n   \nTake care,   \n   \n- Paul\n\n",
  "author": "paul",
  "time": "2 Oct 2001 — 9:42pm",
  "uid": "1132",
  "comments": [
    {
      "time": "3 Oct 2001 — 9:13am",
      "content": "Paul, thanks for that very interesting post!   \nAnd don't worry, old threads never die - they just need new seamsters.   \n   \nhhp\n\n"
    }
  ]
}
