{
  "id": "114611",
  "title": "Is there a tool that can help me construct this shape?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I’m mainly talking about the hashed outer ellipse. I’m thinking maybe some kind of guilloche tool or something like that. Any ideas?\n\n ![](http://web.archive.org/web/20150417125616im_/http:/typophile.com/files/shell_6010.png)\n\n",
  "author": "Frode Bo Helland",
  "time": "28 Feb 2014 — 6:16am",
  "uid": "17101",
  "comments": [
    {
      "time": "28 Feb 2014 — 6:18am",
      "content": "I want to be able to control the curvature and number of lines + their angle as the inside shape depends upon lines falling at a certain angle.\n\n"
    },
    {
      "time": "28 Feb 2014 — 6:36am",
      "content": "Or Python?\n\n"
    },
    {
      "time": "28 Feb 2014 — 6:53am",
      "content": "The Blend tool in Illustrator should do this. Set it up to do \"Specified Steps\", select the follow curve option (icon) and define the number of steps. You can create a blend along a straight line then use \"Replace Spine\" to map it to your ellipse.\n\nAlternatively you could make your blend then drag it to the brushes window to create a new Art Brush. You can then apply that brush to any shape or line. (You may have to expand the blend before creating the brush). I've been using this second method for emulating some engraved patterns along curved lines in decorative fonts.\n\nWorking out how many steps you need and the exact shape of your ellipse to get the angles you need is then just a matter of geometry. But I guess you're looking for a way to avoid the complex calculations and potential uncertainty of the resulting angles?\n\n"
    },
    {
      "time": "28 Feb 2014 — 7:59am",
      "content": "Andrew is right Illustrator Blend is the easy way to do this.\n\n"
    },
    {
      "time": "1 Mar 2014 — 12:25am",
      "content": "Yeppers, Illy for sure Frode.\n\n"
    },
    {
      "time": "1 Mar 2014 — 2:13pm",
      "content": "I have also achieved such a ring, for a clock face, by composing sans dotless i and lowercase l on a circle just right.\n\n"
    },
    {
      "time": "1 Mar 2014 — 2:46pm",
      "content": "Yes, you can do it that way and twenty seven different ways in Photoshop, InDesign and Quark. That is the thing with computer graphics - not just one solution can do it. Illustrator Blend is the most straight forward way to achieve this sort of thing.\n\n"
    },
    {
      "time": "3 Mar 2014 — 7:32am",
      "content": "\"...in Photoshop, InDesign and Quark.\"\n\nI don't think photoshop would be good at all. Quark? You can set type on a path?\n\n\"Illustrator Blend is the most straight forward way to achieve this sort of thing.\"\n\nMaybe. But one must then go back to the blend to make changes, as opposed to a font change, or even easier, a simple change to tracking, baseline shift, or other treatment of the font set on a path.\n\n"
    },
    {
      "time": "3 Mar 2014 — 10:07am",
      "content": "Type on Curve in Quark:http://forums.quark.com/p/334/86975.aspx\n\nThe vector tools in PhotoShop are just as good as Illustrator for type on a path.\n\nIllustrator is only straight forward if you are comfortable using Illustrator.\n\n"
    },
    {
      "time": "4 Mar 2014 — 3:48am",
      "content": "My comfort level has been quite high with illustrator since around... 1986. The issue to me is whether you want a dumb piece of graphics that needs to start over any time a change is required, or a smart composition that can flex easily in response to issues of size, output, mind changes and more.\n\n"
    },
    {
      "time": "4 Mar 2014 — 4:50am",
      "content": "Your point about changes is a good one - my only point was that the same thing can be done a number of different ways using a number of programs (some easier - some harder). Back in the eighties I had a few students that only knew Illustrator - then it was hard to get them to shift and see advantages to other programs . In the nineties I had students who only knew Photoshop and that not very well - then it was necessary to show them why Quark and later InDesign (and Illustrator) could do things and each sometimes better. And back in the eighties we also had graphic design faculty that only knew how to do it by hand and did not want to change. Computer graphics can make change easier, so going for the most easily changed is a valid point.\n\n"
    },
    {
      "time": "31 Jul 2014 — 10:46am",
      "content": "<cite>The vector tools in PhotoShop are just as good as Illustrator for type on a path.</cite>\n\nI don't think so. I believe you have a lot more control in Illustrator, such as where on the path the type starts and whether to place it inside or outside the path. Does Photoshop have such options?\n\n"
    },
    {
      "time": "1 Aug 2014 — 3:06pm",
      "content": "Once converted to bits you add another level of things you can do. Thinking digital means not being limited just to what one tool or mode limits you to. You are right Martin that Illustrator has an advantage if you only limit the tool you use. The cool things happen when you combine and overlap tools.\n\n"
    },
    {
      "time": "1 Aug 2014 — 3:40pm",
      "content": "> Thinking digital means not being limited just to what one tool or mode limits you to.\n\nThat's true, though the restrictions of Photoshop make me uncomfortable. I worked with them for a long time before I finally made the switch to Illustrator for vector work and certainly these restrictions force you to think more creatively, but in the end I feel it's just very restricting while Illustrator allows you to be creative by giving you far more options to work with when it comes to vector. The same goes for InDesign and typography.\n\n> The cool things happen when you combine and overlap tools.\n\nCould you give an example? I do use Photoshop, Illustrator and InDesign together, but it's usually because they compliment each other and not because I feel combining them allows new possibilities. For example, the typography options in Photoshop are so limited I'm forced to do it in InDesign. I think it's a terrible workflow to do an album layout in Photoshop but having to do the typography in InDesign and then drag it into Photoshop. I don't see new possibilities opening up there by being restricted.\n\nI'm thinking back at the time before I used Photoshop, where I would use MS Paint to make illustrations (and later even logos) with gradients and depth by coloring it pixel by pixel. I would say that's a creative way of doing it, but what took me hours in MS Paint took me seconds in Photoshop. So yes, being restricted forces one to think outside of the box, but from my experience it hasn't actually opened up new possibilities; it just gave more insight and appreciation of the processes and the tools. Having more options in my experience allows more artistic creativity rather than the practical creativity restrictions enforce.\n\n"
    },
    {
      "time": "2 Aug 2014 — 6:10am",
      "content": "To change the orientation and position of the type on a path in Photoshop, select the Path Selection Tool, place the cursor over the text until you get a little black arrow on the type cursor, then Drag the cursor below the baseline to flip the type. Use the same method to flip the text and place it inside a shape.\n\n"
    },
    {
      "time": "2 Aug 2014 — 11:47am",
      "content": "\\> having to do the typography in InDesign  \n\\> and then drag it into Photoshop\n\nHave you considered preparing it as an InDesign file with placed Photoshop images?\n\nNative Photoshop files, even layered ones, can be placed directly into InDesign as images. And if the Photoshop file is updated and saved, you can update the image with one click in InDesign's Links panel.\n\n(I wish it was possible to do the reverse and place InDesign files directly into Photoshop, but I don't think it's possible unless you make a PDF first.)\n\n"
    },
    {
      "time": "2 Aug 2014 — 12:24pm",
      "content": "Cut and paste InDesign file into PhotoShop - Place - Rasterize - Smart Object (set resolution at new screen at what you want - proportion will be from clipboard.\n\n"
    },
    {
      "time": "2 Aug 2014 — 6:54pm",
      "content": "Thanks bojev, I didn't realize that was possible, but I just tried it and it works. It'll come in handy sometimes.\n\nBut although that technique works fine, one problem is that you must repeat the process, including positioning, if the InDesign file is updated. But when placing a Photoshop file into InDesign, you can update the image in InDesign with one mouse click, and it will automatically have the same size, position and attributes.\n\nNot a big deal in some cases, but it's nice.\n\n"
    },
    {
      "time": "3 Aug 2014 — 4:44am",
      "content": "PhotoShop was never designed as a page design program nor was Illustrator, but recent versions of Illustrator do support multiple pages. Knowing what tool is best is part of the choice we make when we begin a project. Back in the day we could not use PhotoShop for whole pages due to RAM limits and processor speeds. Today you can make big files fast and it allows for some cool effects we just could not do with limited tools.\n\n"
    },
    {
      "time": "3 Aug 2014 — 7:41am",
      "content": "> Have you considered preparing it as an InDesign file with placed Photoshop images?\n\nI have when I did magazines and folders, but I don't see how that is going to help me here. Indeed I would need to be able to place InDesign files into Photoshop, and even then it seems to be an inefficient process. Frankly I don't understand why the typography panel isn't the same in all Adobe design software. I don't see why there would be a need for restrictions on the typographic capabilities in Illustrator and especially in Photoshop.\n\n> Cut and paste InDesign file into PhotoShop - Place - Rasterize - Smart Object\n\nThat's what I actually do, but it obviously doesn't maintain typographic capabilities and it's just inefficient to do the typography in one software and place it in a different software.\n\n> PhotoShop was never designed as a page design program nor was Illustrator\n\nI don't know what page design entails exactly, but I wouldn't use it for magazines or books—that would be beyond silly. I use Photoshop for CD album layouts because they're often so heavy on illustrations and texturing that it's just much more efficient to keep working in pixels and compose the layout there. You often have to work with templates in the music industry as well for all kinds of layouts for vinyls or digi-packs that working in pixels gives you more certainty about the measurements. However, since InDesign's typographic capabilities (particularly OpenType capabilities and settings for hyphenation, justification and the Story option) are far superior to Photoshop's, I still have to outsource some work to InDesign to do the longer texts.\n\n"
    },
    {
      "time": "3 Aug 2014 — 9:07am",
      "content": "\\> PhotoShop was never designed as a page design  \n\\> program nor was Illustrator\n\nYes, Photoshop, Illustrator and InDesign are very different programs designed to do different things.\n\n\\> I don't see why there would be a need for restrictions  \n\\> on the typographic capabilities in Illustrator ... and Photoshop\n\nIt's because Illustrator and Photoshop were never intended to be used for page layout (except in a limited way), and adding InDesign's features would add size and complexity to programs that are already big and complex.\n\n"
    },
    {
      "time": "3 Aug 2014 — 10:25am",
      "content": "As set up you create art in PhotoShop and Illustrator and then put it all together in InDesign (or Quark, etc). As Martin mentions some things today are just easier to do in PhotoShop entirely (Like CD Covers) as the programs are much more capable today. Illustrator used to used by all sign shops since it could do vector type effects and it was the first Postscript program.\n\n"
    },
    {
      "time": "3 Aug 2014 — 5:30pm",
      "content": "And also people (including me) tend to use the programs they are most comfortable with. Of the 3 programs (InDesign, Illustrator and Photoshop) I'm least comfortable with Illustrator, so I tend to use the other 2 when possible.\n\n"
    },
    {
      "time": "3 Aug 2014 — 5:52pm",
      "content": "I had a student who only would work in PhotoShop - and she was good - multipage projects etc would be done in PhotoShop then she put them together in Acrobat, outputing a pdf of the whole publication. If you focus even a llimited tool set will work - one size does not fit all in the open ended digital world.\n\n"
    },
    {
      "time": "6 Aug 2014 — 11:15pm",
      "content": "While this isn't a post about typography, a similar effect is used on Spoon Graphics to [make this poster](http://web.archive.org/web/20150417125616/http:/blog.spoongraphics.co.uk/tutorials/how-to-create-a-dark-lunar-poster-design-with-ps-ai). Link also has a tutorial on making the shape used. (Uses: Photoshop and Illustrator)\n\n"
    }
  ]
}
