{
  "id": "114754",
  "title": "Typesetting a range of times or just time in general",
  "forum": "Design",
  "tags": [
    "range",
    "time",
    "Design"
  ],
  "content": "I've seen many different ways time is handled. For example 6p.m. 6 p.m. (with a space and periods, which I read is the way it's supposed to be written) Sometimes PM(can be in small caps) If it was 5—6 p.m. there would be a en dash between the range of time. Is there a correct way in typography on how to set the time? How would I write 10 a.m. to 7 p.m.? 10 a.m.—7 p.m.?\n\nWould I write it with a space between the abbreviations and the time but not between the period and the 7? So that it ends up as 10(space) a.m.(en dash)7(space)p.m.? I was wondering this as I was designing a range of time that started from morning to the evening. Maybe I have read it somewhere but have forgotten. I have heard that it should be an en dash with spaces on both left and right sides as opposed to without any spaces between words/characters like I've read elsewhere. I just want to know if there is a correct way in how to approach time or time range in typography. Thanks in advance!\n\n",
  "author": "deda",
  "time": "5 Mar 2014 — 6:33pm",
  "uid": "182301",
  "comments": [
    {
      "time": "5 Mar 2014 — 9:09pm",
      "content": "> Is there a correct way in typography on how to set the time? How would I write 10 a.m. to 7 p.m.? 10 a.m.—7 p.m.?\n\nIt is usually a matter of editorial rather than typographic style. In any confrontation between editors and designers/typesetters, the editors most always win. I once did battle with an editor over using \"ebook\" rather than \"e-book,\" on the grounds that ebooks are now a common part of the language and landscape, just like \"email.\" We sort of compromised -- I found a way to refer to them without using that term at all. Otherwise, the editor's opinion would prevail.\n\nThe <cite>Chicago Manual of Style</cite> will specify one way, likely the Associated Press will have a different one (just as with the \"correct\" way to set an ellipsis).\n\nIIRC, Chicago recommends small caps -- one reason why AP would be different.\n\n"
    },
    {
      "time": "5 Mar 2014 — 9:17pm",
      "content": "I would think that this is the kind of issue where it is helpful to seek guidance from a style guide that applies to the particular field in which the publication will appear. They exist for academic publications, newspapers, and many more. You might start with [http://en.wikipedia.org/wiki/Wikipedia:Manual\\_of\\_Style/Dates\\_and\\_numbers](http://web.archive.org/web/20150416074502/http:/en.wikipedia.org/wiki/Wikipedia:Manual_of_Style/Dates_and_numbers \"http://en.wikipedia.org/wiki/Wikipedia:Manual\\_of\\_Style/Dates\\_and\\_numbers\")  \nIf you have questions about something that is not resolved by a guide, I trust that someone in this forum will opine for you.  \nBTW don't forget that there are major differences in how date and time are handled in the US and in other countries.  \nDon\n\n"
    },
    {
      "time": "5 Mar 2014 — 9:18pm",
      "content": "Chicago Manual of Style is online at [http://www.chicagomanualofstyle.org/qanda/data/faq/topics/Numbers.html](http://web.archive.org/web/20150416074502/http:/www.chicagomanualofstyle.org/qanda/data/faq/topics/Numbers.html \"http://www.chicagomanualofstyle.org/qanda/data/faq/topics/Numbers.html\")  \nDon\n\n"
    },
    {
      "time": "30 Mar 2014 — 10:30pm",
      "content": "I've read a few sources but the time ranges they usually show is between something that is similar. It's usually something to the effect of 6–10 p.m. I haven't seen anything that discusses how it should be written when it is something that is 6 a.m. to 10 p.m.\n\n"
    },
    {
      "time": "31 Mar 2014 — 9:56am",
      "content": "\\> It is usually a matter of editorial  \n\\> rather than typographic style.\n\nYep, you should go by the writer's style guide. If a style guide isn't being used, pick one.\n\n\\> how it should be written when it is something  \n\\> that is 6 a.m. to 10 p.m.\n\nFollow the guide's style, and use both a.m and p.m. for clarity.\n\nAnd I'll add that although you should follow the guide, the main thing is that you are consistent in your style and the times are absolutely clear. For example, transportation schedules avoid using 12:00 because some folks might not be sure if 12 a.m. is noon or midnight. If you must use 12:00, add \"noon\" or \"midnight\" unless its already clear from the context.\n\n"
    },
    {
      "time": "4 Apr 2014 — 8:36am",
      "content": "The first thing to be aware of is that A.M. stands for _ante meridiem_, and P.M. stands for _post meridiem_.\n\nOnce you know that, you know that they _are_ abbreviations, and thus that periods are \"correct\", at least if you are aiming at the most formal and traditional English usage.\n\nAs well, abbreviations are usually capitalized. Here, we're dealing with abbreviations from the Latin, used in the measurement of time. Thus, we have the abbreviation for _Anno Domini_ to guide us as an example, and it is definitely most often capitalized (if, these days, more often replaced by C.E. for \"Common Era\" than in the past).\n\n"
    },
    {
      "time": "4 Apr 2014 — 9:46am",
      "content": "I agree that using caps is the formal and traditional style (I usually use small caps). But the New York Times Style Guide and several other guides now say to use lower case. So consult the guide you're using.\n\n"
    },
    {
      "time": "5 Apr 2014 — 2:33am",
      "content": "I'd (thin?) space out the dash, like the Wikipedia style guide suggests. Unless it's in a table with other time ranges, I guess.\n\n"
    },
    {
      "time": "10 Apr 2014 — 2:59pm",
      "content": "Sorry, I don't have a guide to use so I figured I would ask here. I've seen many different interpretations but non that were specific to the examples I was trying to typeset. So there isn't a specific way the time range should be typeset? I could write it as 6(space)a.m.(space)(en-dash)(space)10(space)p.m.?\n\n"
    },
    {
      "time": "10 Apr 2014 — 3:17pm",
      "content": "\\> I don't have a guide\n\nNormally it would be the project's writer who would have the style guide. But if a style guide isn't being used, it's not like there is just one acceptable way to do it.\n\n"
    },
    {
      "time": "11 Apr 2014 — 10:09am",
      "content": "Oh okay I see but do you think that is acceptable way of typesetting it in general? I see usually 6(en dash)10(space)p.m. and that is usually only because 6 and 10 share the same abbreviation. But I was just wondering how would you write out 6 a.m. to 10 p.m. when the abbreviations are different. Do you add a space on both sides of such as \"6(space)a.m.(space)(en dash)(space)10(space)p.m.)\" or without a space between both sides of the en dash.\n\nWhat I'm really trying to see is how do you approach this in posters/advertisements and other design where there is writing but not to such a large extent as books or paragraphs where it could be a short statement of a range of time. Would I approach this in the same way? Of course, I would think the best way is to keep things consistent which means if I'm typesetting it one way in an article or story the advertisements should follow a similar style. Or maybe the advertisements should deal with the time ranges differently.\n\n"
    },
    {
      "time": "11 Apr 2014 — 2:44pm",
      "content": "\\> 6(space)a.m.(space)(en dash)(space)10(space)p.m.\n\nThat's how I'd probably do it (unless the writer tells me otherwise). If the space around the dash looks too big, tighten it a little. I think you're worrying a bit too much about this, just make it look good and be consistent.\n\n"
    }
  ]
}
