{
  "id": "114730",
  "title": "spritzing",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "seems to be all over the news at the moment and samsung are rolling it out on their new phones. Could be interesting with regard to typography/type design.\n\nAny thoughts on it?\n\n",
  "author": "Michael Green",
  "time": "5 Mar 2014 — 6:13am",
  "uid": "14356",
  "comments": [
    {
      "time": "5 Mar 2014 — 10:25am",
      "content": "What is spritzing?\n\n"
    },
    {
      "time": "5 Mar 2014 — 11:24am",
      "content": "[http://www.slate.com/blogs/future\\_tense/2014/03/03/spritz\\_spreeder\\_rsvp\\_...](http://web.archive.org/web/20150416044258/http:/www.slate.com/blogs/future_tense/2014/03/03/spritz_spreeder_rsvp_technology_speed_reading_apps_are_amazing.html \"http://www.slate.com/blogs/future\\_tense/2014/03/03/spritz\\_spreeder\\_rsvp\\_technology\\_speed\\_reading\\_apps\\_are\\_amazing.html\")\n\n"
    },
    {
      "time": "5 Mar 2014 — 12:29pm",
      "content": "From that cited article...\n\n> My dependency on this application is so great that print text now seems difficult to focus on...\n\nThis\n\nis\n\nNOT\n\ngood.\n\n"
    },
    {
      "time": "5 Mar 2014 — 2:00pm",
      "content": "It's a good implementation of RSVP, and it has the efficiency benefit of RSVP and it also has the usual drawbacks: you can't vary the pace of reading as you naturally do in normal text, you can't perform regressions to correct misreadings, which is a normal part of reading, and if your attention wanders for even a second you'll miss whole swathes of content and meaning. And so far there is no evidence that the speed gains of this form of RSVP perform better in comprehension and recall tests than any other kind of 'speed reading'.\n\nWhat has been demonstrated though, is that companies are good at writing press releases and journalists are happy to have stories mostly written for them. But we already knew that.\n\n"
    },
    {
      "time": "5 Mar 2014 — 8:38pm",
      "content": "Since it's not leveraging the parafovea, it cannot be optimal.\n\nhhp\n\n"
    },
    {
      "time": "6 Mar 2014 — 3:23am",
      "content": "[http://www.spritzinc.com/blog/](http://web.archive.org/web/20150416044258/http:/www.spritzinc.com/blog/ \"http://www.spritzinc.com/blog/\") has some more info - reading up on this and RSVP now - cheers!\n\n"
    },
    {
      "time": "6 Mar 2014 — 3:44am",
      "content": "I don't think this is meant to read the address given before the Gettysburg Address. Can't change pace, can't regress and missing content are non-issues, little or no parafoveal space exists, and \"optimal reading\" is not the goal, on mobile and wearable devices.\n\n"
    },
    {
      "time": "6 Mar 2014 — 3:50am",
      "content": "How would you design a typeface differently if you knew that this was the intended application?\n\nI haven't looked into this very deeply yet honestly but does anyone know the algorithm that they are using to deduce the Optimal Recognition Position (ORP)?\n\nany reason that the ORP is red and not extrabold/extrathin?\n\nthat's more my line of thinking here.\n\n"
    },
    {
      "time": "6 Mar 2014 — 8:29am",
      "content": "David, heartily agreed on everything... except the optimal bit. It's in our nature.\n\nMichael: good questions.\n\nhhp\n\n"
    },
    {
      "time": "7 Mar 2014 — 4:28am",
      "content": "If there is purpose in assuming some imaginary optima, if there was only more room for parafoveal activity, you'd have to more than tweet it. This is not a new composition technique, we deal with foveal word recognition activities perfectly optimally, at high speeds (on the road), in the dark (at the movies), and in most \"reading\" studies (you know that). And foveal word recognition goes all the way back to face recognition.\n\n\"How would you design a typeface differently if you knew that this was the intended application?\"\n\nI would tend to follow design choices that react to the particular environment of the presentation and not the composition technique. The \"reader\" is expecting familiar. I think there are additional design/selection issues depending on mobility vs wearability.\n\n\"...the algorithm that they are using to deduce the Optimal Recognition Position \"\n\nI'd assume this is their secret, but i'd take all the words that have been studied for this feature, and extrapolate, by syllable or something, to the rest of the dictionary (and god help the Germans when spritzkrieg arrives).\n\n"
    },
    {
      "time": "7 Mar 2014 — 6:45am",
      "content": "This method is non-optimal simply because the parafovea is capable of delivering more than half of the reading data. The only reason this has yet to be empirically proven is that field testing methods have been inadequate.\n\nhhp\n\n"
    },
    {
      "time": "7 Mar 2014 — 4:26pm",
      "content": "I would be tempted to design a monowidth typeface, with vertical strokes on a simple grid, rather like the primitive “LED” letter designs.\n\n"
    }
  ]
}
