{
  "id": "114791",
  "title": "Customer insist on bold text face",
  "forum": "Design",
  "tags": [
    "body text",
    "bold font",
    "book text",
    "normal font",
    "Design"
  ],
  "content": "I am trying to design a book for a customer. It's non-fiction, perhaps one or two images, otherwise it's text with maybe two levels of hierarchy. The body text alternates between quoting from an old religious text and explanatory comments. Sometimes these alternations stretch over a page or more, sometimes they're only a line or two.\n\nFor the body text, the latest proposal was to alternate between normal and italic of the same type and weight, a solution which I found comfortable to read. Setting the old religious text a little \"poem style\" (indented, italic, ragged right) and the explanatory comment as just reading text (no indent, normal, justified) I found quite pleasing.\n\nHowever, the client insists on using a bold weight for the old religious text, mixed with normal weight for the commentary. I find it more and more difficult to argue why I would avoid a bold face. My latest comment to the client is this: _Bold faces are frowned upon for reading. Anywhere I look, the sprinkling of bold faces into reading text is labeled as a \"type crime\" because it \"blotches\" the page and interrupts the reading comfort. Go into a bookstore, grab any of the books and you'll find that barely any one scatters bold faces into the flowing text. If you mix bold and normal text, and hold an open book at a smaller distance you'll see black blobs, the \"blotches\" scattered across the pages. This unbalances the text, brings it out of weight (that's why \"bold\" and \"normal\" and \"light\" are referred to as type weights)._\n\nIn your opinion and experience, how would you handle this situation? Which arguments are there for and against mixing normal and bold face in reading text?\n\n",
  "author": "_savage",
  "time": "6 Mar 2014 — 2:46pm",
  "uid": "217867",
  "comments": [
    {
      "time": "6 Mar 2014 — 3:04pm",
      "content": "There are several gradations between roman and bold in the more elaborate font families. Show your client how the variations of roman/semibold, book/bold, book/semibold, etc, look and juxtapose with roman/bold. That should convince the client. If not, clench your teeth, do the job, delete your credit line and get on with your life.\n\n"
    },
    {
      "time": "6 Mar 2014 — 3:07pm",
      "content": "Bodoni was an acceptable bold text face, and may still be. [http://library.rit.edu/cary/bauer-bodoni-roman](http://web.archive.org/web/20150417135555/http:/library.rit.edu/cary/bauer-bodoni-roman \"http://library.rit.edu/cary/bauer-bodoni-roman\")  \nPaul Rand used Univers 65 as a text face. [http://typophile.com/node/86653](http://web.archive.org/web/20150417135555/http:/typophile.com/node/86653 \"http://typophile.com/node/86653\")\n\nI always try to accomodate the client, because doing so may yield new and interesting design solutions, going against the grain of accepted dogma.\n\nBut don’t forget to please yourself as well.\n\n"
    },
    {
      "time": "6 Mar 2014 — 3:40pm",
      "content": "Thank you for your comments so far. My client's response is usually along the lines that this isn't a usual book but a study book. I'll take a look at less weighty types, I think it's the visual distinction he's after. I've asked again what exactly he's trying to achieve...\n\nIt's not so much about setting the whole book in bold or normal, it's the mix of both in the same body text. I'm worried that too much bold/normal on the same page looks blotchy.\n\n"
    },
    {
      "time": "6 Mar 2014 — 3:51pm",
      "content": "I'd say that using italic and Roman in the fashion you describe provides a greater contrast than using bold/regular. Not in terms of typographic colour, of course, but in most other respects. It changes the mood and the voice completely, while boldface just dims the light.\n\nAnd you are in my opinion right about boldface for extended reading. Contrasting it with a regular weight would work against the intention, making the most important matter less accessible and pleasant to read than the commentary.\n\nI agree that a modern (in the typographical sense) serif would be your best bet if the client still insists. It was Bodoni who invented boldface (though it wasn't very bold, and I don't think he used it for contrast), the bolds of earlier typefaces are modern inventions. Very rarely do they look good, in my opinion. Bold letters needs simple, clean shapes to work well, if readability is a goal.\n\n"
    },
    {
      "time": "6 Mar 2014 — 6:58pm",
      "content": "There are many cases where a Demi will work better than an Italic.\n\nhhp\n\n"
    },
    {
      "time": "7 Mar 2014 — 10:06am",
      "content": "_hrant:_ That may be. It's just that not too many fonts provide demi, suit the occasion, let alone support the diacritics that I need. This insistence on bold really ties my hands and limits creativity.\n\nHaving said that, the emphasis is on a visual distinction between the old religious text and the explanatory commentary. Now that degree of distinction I guess is personal preference, and for the customer a bold seems appropriately strong and distinct.\n\nBut alternatives are negotiable, I reckon :-)\n\n"
    },
    {
      "time": "7 Mar 2014 — 9:20pm",
      "content": "In addition to creating a blotchy appearance on the page, bold text has more visual emphasis than regular text within a block of copy. This conveys the impression that the bolded text is **more important** since it seems to speak louder.\n\nItalic text, on the other hand, has the same overall visual color as regular text and _simply suggests a distinction_ without implying anything about relative importance.\n\nJudging only from you post and not having seen the work, I think your client wants you to do something that will not only be visually unattractive but will also convey the wrong meaning.\n\n"
    },
    {
      "time": "7 Mar 2014 — 9:49pm",
      "content": "Actually most typefaces have an Italic that screams: \"Look how pretty and flighty I am!\"\n\nhhp\n\n"
    },
    {
      "time": "7 Mar 2014 — 10:16pm",
      "content": "Actually, to separate the old religious text from the explanatory comments I've also tried pairing fonts, here is the related original post ( [link](http://web.archive.org/web/20150417135555/http:/graphicdesign.stackexchange.com/questions/26945/font-pairing-for-caslon)) and a followup on the typophile site ( [link](http://web.archive.org/web/20150417135555/http:/typophile.com/node/114436)).\n\n"
    },
    {
      "time": "8 Mar 2014 — 10:14am",
      "content": "\\> My client's response is ... that this isn't a  \n\\> usual book but a study book.\n\nIf it's more like a textbook, perhaps a different approach like putting the religious text in a box, sidebar, different color, on a tinted background, or some other treatment might visually separate it without the use of bold. (The use of color would add to the printing costs but I've seen that technique used many times in study Bibles to separate scripture from commentary.)\n\n"
    },
    {
      "time": "8 Mar 2014 — 1:43pm",
      "content": "_JamesM:_ Hm, that's exactly the direction it goes to. I'll dig around for some examples, if you have any would you mind posting them? (One example would be [here](http://web.archive.org/web/20150417135555/http:/exegete77.wordpress.com/2012/11/15/gsb-esv-pt1/).)\n\n"
    },
    {
      "time": "8 Mar 2014 — 3:35pm",
      "content": "\\> if you have any would you mind posting them\n\nA friend used to work in a religious bookstore and I saw study Bibles like that, but I can't remember any in particular. Most cities have one or more religious bookstores so you might try browsing in one. And maybe looking at textbooks in a college bookstore might give some ideas.\n\n"
    },
    {
      "time": "30 Mar 2014 — 7:17pm",
      "content": "The 1978 novel _Birdy_ was a story told by two narrators. In the original hardcover edition, the publisher (Knopf) set the text in Linotype Electra, using Electra Roman for the voice of one narrator and Electra Italic for the other.  \nWhen W.A. Dwiggins designed Electra in 1935, he drew the Italic as a slanted version of the Roman letterforms, not cursive. (This was a radical idea at the time, and Mergenthaler later insisted that Dwiggins draw a conventional Italic, which they released in 1944 as Electra Cursive.) In _Birdy_, Knopf paired Dwiggins' original Electra Italic with Electra Roman, so that readers could easily spot the difference but wouldn't have to wade through page after page of cursive letterforms.  \nIf you can find a hardcover edition of _Birdy_ (maybe your local library has one), you could show it to your client to demonstrate that an obliqued Roman might work better than bold as a contrasting text face. (Don't show them the mass-market paperback--that uses a cursive Italic for the second narrator's passages.)\n\n"
    },
    {
      "time": "8 Mar 2014 — 6:38pm",
      "content": "That's exactly a great example of how good a slanted-Roman can be.\n\nFor the record: some foundries in France and Germany were quietly producing slanted-Romans before Morison \"invented\" the idea and convinced WAD and JvK to give it a shot. In fact in the US itself ATF had already been producing some, although in their case that was most likely an \"affordance\" triggered by their pantograph.\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2014 — 7:44pm",
      "content": "This just in from another thread:  \n [http://typophile.com/files/condex\\_6338.jpg](http://web.archive.org/web/20150417135555/http:/typophile.com/files/condex_6338.jpg \"http://typophile.com/files/condex\\_6338.jpg\")  \nIs it really OK that \"bête noir\" looks like a ballerina crashing a conference on world history?\n\nhhp\n\n"
    },
    {
      "time": "14 Mar 2014 — 10:05pm",
      "content": "John Berger - 'Ways of seeing' used Monophoto Univers 65\n\nwas comfortable to read but the 'w' seemed a bit wide\n\n"
    },
    {
      "time": "27 Mar 2014 — 3:28am",
      "content": "It seems that bold or semibold is non-negotiable. To avoid the blotchy look I have toned down the black to a very dark grey. However, as bold is supposed to be the visual distinction, toning it down might be as undesired as using normal weight.\n\nI'm now playing with normal and italic faces, where the religious text (formerly bold) is black, and the commentary (formerly normal) is a hint grayer. It looks rather promising to me...\n\n ![](http://web.archive.org/web/20150417135555im_/http:/typophile.com/files/bla_5820.jpg)\n\nWhat other tricks take away the heaviness of too bold a weight?\n\n"
    },
    {
      "time": "27 Mar 2014 — 4:16am",
      "content": "Concerning grey, just bear in mind that what you're looking at when setting is a monitor, but your ultimate destination is print. When you chose a tint for text it will be 'dot screened' by the printing process, so will be heavily dependent on the 'fineness' of said process, which will certainly be an issue (for crispness) at normal text sizes.\n\n"
    },
    {
      "time": "27 Mar 2014 — 4:34am",
      "content": "> For the record: some foundries in France and Germany were quietly producing slanted-Romans before Morison \"invented\" the idea and convinced WAD and JvK to give it a shot.\n\n:–) That’s in sync with Goudy’s statement — the old (German) fellows stole a lot of Morison’s ideas too …\n\nTimes, Monotype Grotesque, Old English Text (just to name a few), they all have German ancestors.\n\n"
    },
    {
      "time": "27 Mar 2014 — 3:06pm",
      "content": "\\*sigh\\* So using shades of black to increase the contrast between religious text and commentary isn't a good idea.\n\nThe \"darker for religious text\" is not negotiable, the customer insists on using a bold face. (I disagree, but that doesn't matter.)\n\nI guess that brings up the next question: what is a good readable text type that provides both, bold and regular?\n\n"
    },
    {
      "time": "27 Mar 2014 — 9:01pm",
      "content": "\\> [gray] will be 'dot screened' by the printing process\n\nYes, unless you treat gray as a 2nd color and print it with solid gray ink. So you have 2 printing plates for those pages — black and gray. You'll get superior results, but the cost will be higher.\n\n"
    },
    {
      "time": "28 Mar 2014 — 12:45pm",
      "content": "Your design is horribly over-wrought.  \nThere are too many changes in style between the main text and the quotes:  \n\\*Roman-Italic  \n\\*Regular-Bold  \n\\*Leading  \n\\*Paragraph indents  \n\\*Justified-Ragged  \n\\*Black-Grey\n\nLet it go!  \nA better design would be to keep exactly the same setting throughout, just changing weight…\n\n“Maximum meaning, minimum means.” —Abram Games, zen master.\n\n"
    },
    {
      "time": "28 Mar 2014 — 3:33pm",
      "content": "_Nick:_ Thank you for that, I agree with going for a minimalist approach. However, as I said my customer is quite insistent on this approach and I'm trying to \"control the damage.\" I'm just glad I could talk them out of Comic Sans (I am not kidding).\n\nIn [The Elements of Typographic Style](http://web.archive.org/web/20150417135555/http:/typographica.org/typography-books/the-elements-of-typographic-style-4th-edition/), the author says that it's best to change only one property around between paragraphs (or between headings of different levels). Which I thought is nice. I'm trying to convince my customer to not get too excited with formatting, but it's a hard (impossible) sale.\n\n\\> Let it go! A better design would be to keep exactly the same setting  \n\\> throughout, just changing weight…\n\nWhat worries me about this approach is that I can't find a readable bold/normal type. In addition, they have to have Pali diacritics, which are hard to find (TeX's Gyre have them). I'm leaning towards semi-bold/normal to avoid too blotchy text color, but that wasn't \"strong enough a contrast\".\n\n"
    },
    {
      "time": "28 Mar 2014 — 9:30pm",
      "content": "\\> but it's a hard (impossible) sale\n\nSometimes a client just doesn't see things your way. It's easy to get upset, but another approach is to be polite, finish the job their way, cash the check, and move on. If they offer you another job in the future say you're \"too busy\".\n\n"
    },
    {
      "time": "29 Mar 2014 — 5:29am",
      "content": "Here's one with only normal/bold weight changed between the commentary and the old sutta text. Set in TeX Gyre Termes as this is one of the very fonts I can find which has all the required Pali diacritics. Unfortunately, it has no semi-bold...\n\nIt surprises me how difficult it is to find fonts that provide the diacritics I need. And have semi-bold. And are nice and rounded and readable. :)\n\n ![](http://web.archive.org/web/20150417135555im_/http:/typophile.com/files/grab_5583.jpg)\n\n"
    },
    {
      "time": "30 Mar 2014 — 7:44pm",
      "content": "When I search on MyFonts for fonts that support all Pali diacritics listed [here](http://web.archive.org/web/20150417135555/http:/en.wikipedia.org/wiki/Pali#Alphabet_with_diacritics), I get a list of [138 font families](http://web.archive.org/web/20150417135555/http:/www.myfonts.com/search/char%3A%28%C4%81+i+%C4%AB+%C5%AB+%E1%B9%83+%E1%B9%85+%C3%B1+%E1%B9%AD+%E1%B8%8D+%E1%B9%87+%E1%B8%B7%29/fonts/). Some serif typefaces including a semi-bold cut are [Fedra Serif A](http://web.archive.org/web/20150417135555/http:/www.myfonts.com/fonts/typotheque/fedra-serif-a-pro/)/ [B](http://web.archive.org/web/20150417135555/http:/www.myfonts.com/fonts/typotheque/fedra-serif-b-pro/), [Greta](http://web.archive.org/web/20150417135555/http:/www.myfonts.com/fonts/typotheque/greta-text-pro/), [Irma Text Slab](http://web.archive.org/web/20150417135555/http:/www.myfonts.com/fonts/typotheque/irma-text-slab-pro/) (all Typotheque), [Trola](http://web.archive.org/web/20150417135555/http:/www.myfonts.com/fonts/tipografies/trola/) and [Pona](http://web.archive.org/web/20150417135555/http:/www.myfonts.com/fonts/tipografies/pona/) (Tipografies), [Odile](http://web.archive.org/web/20150417135555/http:/www.myfonts.com/fonts/kontour-type/odile/) (Kontour), [Garvis](http://web.archive.org/web/20150417135555/http:/www.myfonts.com/fonts/james-todd/garvis-pro/) (James Todd) and [Skolar](http://web.archive.org/web/20150417135555/http:/www.myfonts.com/fonts/rosetta/skolar/) (Rosetta). If you don’t need a free font, any of these options would be better than TNR/Termes.\n\n"
    },
    {
      "time": "31 Mar 2014 — 2:06am",
      "content": "_R._ I didn't know that I can go looking for fonts based on the characters, still trying to find my way around foundries :-) Thank you heaps for that hint!\n\nI quite like Garvis, actually, but that doesn't provide an Italic for its semibold and bold weights. Pona seems nice as well.\n\n"
    },
    {
      "time": "4 Apr 2014 — 2:41pm",
      "content": "I went with [Pona](http://web.archive.org/web/20150417135555/http:/www.tipografies.com/fonts/pona/overview/) and the type looks very smooth and balanced as a text type, very happy.\n\nHowever, sadly, the requirements have now changed and I'm being asked, in addition to bolding the religious text, to indent it left and right by 5 spaces. And again, no budging on the customers side :-(\n\nSo basically I would now have text where paragraphs alternate between normal textblock size and weight, and bold weight and indented left and right—columned text and normal block. (In 6 by 9 inches format.) The justification: this is a study book, not a NY Times novel.\n\n"
    },
    {
      "time": "4 Apr 2014 — 3:11pm",
      "content": "Umm, last time I looked, <cite>The New York Times</cite> doesn't publish novels...\n\nYou know, many of my customers (I set type) want a lot of things I don't approve of. Really ugly type (What, this is a judgement call?). Fonts with butchered Unicode. Butchered ligatures. Interior designers specifying the text size too small, the specified fonts too thin, margins too small (too many characters per page), you name it.\n\nSo I whine a bit. Gotta be an end to that, though. In the end, do you want the job or not?\n\n"
    },
    {
      "time": "5 Apr 2014 — 12:20am",
      "content": "Charles: If I had to make a living of this, I'd grumble and do it and move on.\n\nBut I don't. I do this for fun, and people ask me to help them set their print books and ebooks, so they can publish it. And yes, they make some money with it. I don't charge for that, because I get to play around and learn something new. But when at first people ask me to help them because they don't know how to do this, and then tell me how to do what they asked me to do as a favor, I'm beginning to wonder why I bother.\n\nBut you are right, I'm putting an end to this, and to this thread :) I've told the customer that I disagree with his asks too much, and he's better off finding somebody else to help out.\n\nOver and out.\n\n"
    },
    {
      "time": "4 Apr 2014 — 6:15pm",
      "content": "Good move.\n\nhhp\n\n"
    },
    {
      "time": "5 Apr 2014 — 8:25am",
      "content": "I assumed this was a commercial job since you repeatedly called your client a \"customer\".\n\nBut if this is just a free favor, maybe backing out is the best solution since the two of you don't agree.\n\n"
    }
  ]
}
