{
  "id": "114858",
  "title": "exemplar fonts of some non-Latin styles",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm trying to get a better idea of the characteristics of some of the less-commonly-seen letter-types. Could you direct me to some fonts that exemplify the difference between:\n\n\\* a \"Textura\"  \n\\* a \"Gotisch\"  \n\\* a \"Fraktur\"  \n\\* a \"Bastarda\"  \n\\* a \"Schwabacher\"  \n\\* a \"Rotunda\"  \n\\* (bonus) an \"Uncial\"\n\nI'm becoming mildly fascinated with faces that use non-Latin letterforms, particularly if they have some historical usage precedence. I know there must be lots of research and documentation out there about this. Can you give me half-a-dozen things to look at so I can start to see the distinctions?\n\n(Some things that tempted me down this rabbit-hole: [Rieven Uncial](http://web.archive.org/web/20140802202722/http:/www.myfonts.com/fonts/delve/rieven-uncial), [Dark Angel](http://web.archive.org/web/20140802202722/http:/www.myfonts.com/fonts/alphabetsoup/dark-angel), [Mason](http://web.archive.org/web/20140802202722/http:/www.myfonts.com/fonts/emigre/mason-ot). What the hell is Mason?!?)\n\n",
  "author": "Amado",
  "time": "10 Mar 2014 — 7:32am",
  "uid": "99380",
  "comments": [
    {
      "time": "10 Mar 2014 — 10:00am",
      "content": "Here's the book:  \n [http://www.amazon.com/Blackletter-National-Identity-Shaw-Bain/dp/1568981252](http://web.archive.org/web/20140802202722/http:/www.amazon.com/Blackletter-National-Identity-Shaw-Bain/dp/1568981252 \"http://www.amazon.com/Blackletter-National-Identity-Shaw-Bain/dp/1568981252\")\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2014 — 10:50am",
      "content": "Strictly speaking, these are actually Latin script (writing system) genres.\n\nThis shows the remarkable diversity within the fraktur/blackletter gerne:  \n [http://www.amazon.ca/Fraktur-Mon-Amour-Judith-Schalansky/dp/156898801X](http://web.archive.org/web/20140802202722/http:/www.amazon.ca/Fraktur-Mon-Amour-Judith-Schalansky/dp/156898801X \"http://www.amazon.ca/Fraktur-Mon-Amour-Judith-Schalansky/dp/156898801X\")\n\n"
    },
    {
      "time": "12 Mar 2014 — 8:41am",
      "content": "A book? Those things only have one author!  \n [http://typophile.com/node/91939#comment-504952](http://web.archive.org/web/20140802202722/http:/typophile.com/node/91939#comment-504952 \"http://typophile.com/node/91939#comment-504952\")\n\n:-)\n\nThx, both, for the solid suggestions.\n\n"
    },
    {
      "time": "12 Mar 2014 — 8:54am",
      "content": "Touché! :-)\n\nhhp\n\n"
    },
    {
      "time": "13 Mar 2014 — 7:37am",
      "content": "Well, it only took nearly two years.\n\nI still wonder, though, whether there's an on-line resource where I can at least see a \"family tree\" of names of styles within the \"Latin script writing system genres\". Other than Wikipedia, which I didn't find helpful.\n\nI just came across something called \"Lombardic\" for example, and a search on Identifont and MyFonts turns up a variety of Lombardic-y caps married with fraktur lowercase, uncial lowercase, what-have-you. I take it that that's an artifact of the whole upper/lower case thing being a relatively recent development.\n\nA search on \"bastarda\" turns up enough of a variety of results that I can't tell which aspects are hallmarks of the genre and which are artifacts of trying to cram these historical styles into modern-day conceptions of alphabets.\n\nIf books it is, books it is. They look like excellent books.\n\n"
    },
    {
      "time": "13 Mar 2014 — 8:52am",
      "content": "I've seen at least two such family trees (gotta find 'em...) although they're based on handwriting.\n\nhhp\n\n"
    },
    {
      "time": "13 Mar 2014 — 9:23am",
      "content": "Since Googling \"bastarda\" turns up, for you, a bunch of modern typefaces without context, a book on the history of typography would definitely help you to achieve an organized understanding, since one of the first things you would find in one is historical examples of the various categories of typeface.\n\nUpdike's Printing Types is available for free download, and it's not a bad place to start.\n\nAnatomy of a Typeface by Alexander Lawson, and An Atlas of Typefaces, by James Sutton and Alan Bertram (which was recently reprinted, and the reprint was remaindered, so copies should be inexpensively available) are additional helpful references.\n\n"
    },
    {
      "time": "14 Mar 2014 — 6:07am",
      "content": "Wow, okay, Updike's book is amazing. I can't claim that my understanding is better and more neatly categorized. But it's certainly _deeper_. Categorization may (or may not) happen as I view more and more of the typefaces I see with this new (and as yet incomplete) understanding.\n\nFraktur Mon Amor is on my wish-list now.\n\nI still want to know where the hell we got Mason ( [http://www.myfonts.com/fonts/emigre/mason-ot/](http://web.archive.org/web/20140802202722/http:/www.myfonts.com/fonts/emigre/mason-ot/ \"http://www.myfonts.com/fonts/emigre/mason-ot/\")) from. I think I can start to see the history of Andron 2 ( [http://www.myfonts.com/fonts/andreas-stotzner/andron-2/](http://web.archive.org/web/20140802202722/http:/www.myfonts.com/fonts/andreas-stotzner/andron-2/ \"http://www.myfonts.com/fonts/andreas-stotzner/andron-2/\") , which I find increasingly charming), though.\n\nY'all are awesome.\n\n"
    },
    {
      "time": "15 Mar 2014 — 7:05am",
      "content": "We probably got Mason from the same place we got [Newcomen](http://web.archive.org/web/20140802202722/http:/www.myfonts.com/fonts/insigne/newcomen/) or L'Elf Noir du Mal or Celtic Garamond the 2nd - posters for horror movies followed by lettering styles evocative of the Goth look.\n\nSo one mixes in alchemical and religious symbols with the forms of the alphabet.\n\n"
    }
  ]
}
