{
  "id": "114886",
  "title": "Web alternative to Fago Office Serif",
  "forum": "Design",
  "tags": [
    "alternative",
    "Fago",
    "fago office serif",
    "web font",
    "website",
    "Design"
  ],
  "content": "Hi guys!  \nI'm designing a website for a company with Fago Office Serif among its institutional fonts. Is anyone able to find a free (and good) web alternative with similar serifs and mood?\n\nThank you very much in advance.  \nHave a great day!\n\n",
  "author": "maxguiz",
  "time": "11 Mar 2014 — 3:45am",
  "uid": "218283",
  "comments": [
    {
      "time": "11 Mar 2014 — 4:24am",
      "content": "Fago Office Serif is available as a web font, it has just been renamed Fago Correspondence Serif: [https://www.fontfont.com/fonts/fago-correspondence-serif](http://web.archive.org/web/20150417091346/https:/www.fontfont.com/fonts/fago-correspondence-serif \"https://www.fontfont.com/fonts/fago-correspondence-serif\")\n\n"
    },
    {
      "time": "11 Mar 2014 — 7:11am",
      "content": "Thank you Jens for the info.  \nJust in order to propose two options, does anyone know if there is a similar free alternative?\n\nThank you again!\n\n"
    },
    {
      "time": "11 Mar 2014 — 8:36am",
      "content": "Pay for the real thing.\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2014 — 9:48am",
      "content": "Since the company has a low budget and no extreme need for that exact font on its website, I was just trying to find out if, among the various services and websites offering free and open source fonts, there is something with a similar mood to Fago's. Of course I am not going to use Fago on the website without paying for it, but I think the company has the right to choose whether to use a free font or not. :)\n\n"
    },
    {
      "time": "16 Mar 2014 — 9:51am",
      "content": "I find these situations to be quite awkward, actually. Of course the company has the right to choose whether to use a free font or not, but I also wonder, if the company has no money for a one-time fee of 159 euro to establish a good brand identity then I have to wonder why you would even want to start up a company in the first place. I want my clients to be passionate about the design of their company and value it accordingly.\n\n"
    },
    {
      "time": "18 Mar 2014 — 1:16pm",
      "content": "I know of three freely-available egyptians that will let them judge for themselves the balance between identity and price: Aleo, Arvo and Roboto Slab. There is a semi-payware fourth, Museo Slab. All can be found here ( [http://www.fontsquirrel.com/](http://web.archive.org/web/20150417091346/http:/www.fontsquirrel.com/)) and all are enough unlike Fago that the difference should be visible even to a tunnel-visioned accountant that hasn't taken his eyes off the bottom line for the last fifty years.\n\n"
    }
  ]
}
