{
  "id": "114870",
  "title": "blackletter in heavy metal bands... what the font is it?",
  "forum": "Home",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi guys, i'm making a paper about the influence of gothic styles, including blackletter typefaces and I've chosen 5 cover from 5 famous bands.\n\nBut I have a problem, I don't have so much information about this typefaces from the covers and I really need it. If you have some information about this, I will apreciate it.\n\nThanks!!\n\nThe covers are...\n\n ![](http://web.archive.org/web/20140802233825im_/http:/typophile.com/files/black%20sabbath%20-%20sabbath%20bloody%20sabbath%20-%201973_4046.jpeg)\n\n ![](http://web.archive.org/web/20140802233825im_/http:/typophile.com/files/Acdc-Let_There_Be_Rock-%201977_4385.jpg)\n\n ![](http://web.archive.org/web/20140802233825im_/http:/typophile.com/files/Blue_Oyster_Cult-On_Your_Feet_Or_On_Your_Knees-Frontal-1975_6709.jpg)\n\n ![](http://web.archive.org/web/20140802233825im_/http:/typophile.com/files/motorhead%20-%201977_3695.jpeg)\n\n ![](http://web.archive.org/web/20140802233825im_/http:/typophile.com/files/Rainbow-Rising_(Deluxe_Edition)-Frontal%20-%201976_5362.jpg)\n\n",
  "author": "andres860",
  "time": "10 Mar 2014 — 1:54pm",
  "uid": "212247",
  "comments": [
    {
      "time": "10 Mar 2014 — 3:02pm",
      "content": "This is really best put in the Font ID forum (click on \"Font ID\" above or on the right side), as that is where the type ID specialists hang out.\n\n"
    },
    {
      "time": "10 Mar 2014 — 3:27pm",
      "content": "Rainbow: Fette Fraktur [http://www.myfonts.com/search/fette+fraktur/fonts/](http://web.archive.org/web/20140802233825/http:/www.myfonts.com/search/fette+fraktur/fonts/ \"http://www.myfonts.com/search/fette+fraktur/fonts/\") compressed and with \\_R\\_ edited for bowl and upper part of leg.  \nDon\n\n"
    },
    {
      "time": "10 Mar 2014 — 3:30pm",
      "content": "AC DC: Squealer by Typodermic [http://www.dafont.com/squealer.font](http://web.archive.org/web/20140802233825/http:/www.dafont.com/squealer.font \"http://www.dafont.com/squealer.font\")  \nDon\n\n"
    },
    {
      "time": "10 Mar 2014 — 3:34pm",
      "content": "Mötorhead: Motorhead [http://download.fontmeme.com/fonts/13041/motorhead.html](http://web.archive.org/web/20140802233825/http:/download.fontmeme.com/fonts/13041/motorhead.html \"http://download.fontmeme.com/fonts/13041/motorhead.html\") Other versions of Mötorhead covers used Fette Fraktur.  \nDon\n\n"
    },
    {
      "time": "10 Mar 2014 — 3:44pm",
      "content": "Sabbath Bloody: Don't see a close match. But check out Spinal Tap...  \nDon\n\n"
    },
    {
      "time": "10 Mar 2014 — 4:23pm",
      "content": "Heavy metal bands are popular among Americans born after WWII, and I suspect that they chose these fonts because of Fraktur's associations with Nazi Germany\\*. In other words, it symbolized something powerful and dangerous that Boomers' parents had fought against. What better symbol of adolescent rebellion could you ask for?\n\n(\\*Before the Nazis banned it in 1941)\n\n"
    },
    {
      "time": "10 Mar 2014 — 7:21pm",
      "content": "Victor tells the truth about the Fraktur ban. In 1941 Martin Bormann banned Fraktur in a Schrifterlass (edict on script) because it was \"Schwabacher Judenlettern\"  \n---start quote---  \n\"For general attention, on behalf of the Führer, I make the following announcement:  \nIt is wrong to regard or to describe the so-called Gothic script as a German script. In reality, the so-called Gothic script consists of Schwabach Jew letters. Just as they later took control of the newspapers, upon the introduction of printing the Jews residing in Germany took control of the printing presses and thus in Germany the Schwabach Jew letters were forcefully introduced.  \nToday the Führer, talking with Herr Reichsleiter Amann and Herr Book Publisher Adolf Müller, has decided that in the future the Antiqua script is to be described as normal script. All printed materials are to be gradually converted to this normal script. As soon as is feasible in terms of textbooks, only the normal script will be taught in village and state schools.  \nThe use of the Schwabach Jew letters by officials will in future cease; appointment certifications for functionaries, street signs, and so forth will in future be produced only in normal script.  \nOn behalf of the Führer, Herr Reichsleiter Amann will in future convert those newspapers and periodicals that already have foreign distribution, or whose foreign distribution is desired, to normal script\".  \n---end quote---  \nMoreover, Herr Hitler, wannnabe classical architect, seems to have always preferred the purity of text based on the Roman Trajan Letters. Note a Hitler declaration made in the Reichstag in 1934  \n---start quote---  \n Your alleged Gothic internalisation does not fit well in this age of steel and iron, glass and concrete, of womanly beauty and manly strength, of head raised high and intention defiant ... In a hundred years, our language will be the European language. The nations of the east, the north and the west will, to communicate with us, learn our language. The prerequisite for this: The script called Gothic is replaced by the script we have called Latin so far ...  \n---end quote--  \nI pulled these quotes from a wiki: [http://en.wikipedia.org/wiki/Antiqua%E2%80%93Fraktur\\_dispute](http://web.archive.org/web/20140802233825/http:/en.wikipedia.org/wiki/Antiqua%E2%80%93Fraktur_dispute \"http://en.wikipedia.org/wiki/Antiqua%E2%80%93Fraktur\\_dispute\")  \nAnyway the love of blackletter by rock rebels and bikers seems to have missed the mark.  \nDon\n\n"
    },
    {
      "time": "10 Mar 2014 — 8:12pm",
      "content": "\"I suspect that they chose these fonts because of Fraktur's associations with Nazi Germany\"\n\nWhat utter Goebbels!\n\n"
    },
    {
      "time": "11 Mar 2014 — 1:16am",
      "content": "I think an important influence on the style was Judas Priest:\n\n[http://kkdowning.net/SpecialReports/logohistory.html](http://web.archive.org/web/20140802233825/http:/kkdowning.net/SpecialReports/logohistory.html)\n\n"
    },
    {
      "time": "11 Mar 2014 — 5:58am",
      "content": "Don: ACDC is not a font. It was conceived and drawn by Gerard Huerta!\n\n"
    },
    {
      "time": "11 Mar 2014 — 10:27am",
      "content": "Hi Michael, you are correct, the Huerta lettering came before the Typodermic font, which is to my eye is based on the lettering. Same for the Mötorhead cover and the font mentioned.  \nDon\n\n"
    }
  ]
}
