{
  "id": "114995",
  "title": "Personal Charateristics and/or Qualities of Typographers? (for an inspirational type article)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "As part of my studies I'm writing an article on personal charatersitics/personality traits which are common with typographers and good leaders (its inspirational and I'm being a bit creative with it).  \nI was wondering if anyone had any thoughts about this? I was thinking along the lines of patience, influence, conscientious, visionary, often highly self-critical? some can be introverted etc...\n\nI realise some of this is somewhat blurry or subjective and generalised!  \nAny thoughts or contributions would really be appreciated!\n\n",
  "author": "Leighanne",
  "time": "15 Mar 2014 — 7:36am",
  "uid": "218405",
  "comments": [
    {
      "time": "15 Mar 2014 — 7:52am",
      "content": "Two words: introspective, contemplative.\n\n"
    },
    {
      "time": "15 Mar 2014 — 9:57am",
      "content": "Odd question to post on an internet forum.\n\nYou've been a member of Typophile for two hours. This is your first post.\n\nMost of us are observant. Enough said.\n\n"
    },
    {
      "time": "17 Mar 2014 — 5:21pm",
      "content": ".\n\n"
    },
    {
      "time": "15 Mar 2014 — 7:57pm",
      "content": "Charles, it's an entirely reasonable –if slippery– question.\n\nBut: are we talking about typographers, or type _designers?_ Very different animals.\n\nhhp\n\n"
    },
    {
      "time": "16 Mar 2014 — 1:32am",
      "content": "What Hrant said. Get the terminology right.\n\n"
    },
    {
      "time": "17 Mar 2014 — 5:22pm",
      "content": ".\n\n"
    },
    {
      "time": "16 Mar 2014 — 7:14pm",
      "content": "\\>I'm writing an article on personal charatersitics/personality traits which are common with typographers and good leaders\n\nTheir ability to spell characteristics? ;-)\n\n"
    },
    {
      "time": "16 Mar 2014 — 8:29pm",
      "content": "> **As part of my studies** I'm writing an article on personal charatersitics/personality traits which are common with typographers and good leaders<cite> (emphasis added)</cite>\n\nHmm. Can't think of any typographers who were also leaders, at least, if you count only corporation of over 50 employees or civil groupings larger than villages.\n\nWouldn't it follow that any shared personality traits would be accidental? As you might find with any arbitrary paring, such as typographers and serial killers?\n\nBTW, if you check Wikipedia on 'type designers,' you'll find that in recent usage, 'type designers' prefer to be compared architects rather than to typographers. I can't imagine why, since the largest and most common architectural works these days are strip malls (retail parks in the U.K.)... Perhaps apt, though, with the ending of the sign-painter era... [http://typophile.com/node/114821](http://web.archive.org/web/20140803141445/http:/typophile.com/node/114821 \"http://typophile.com/node/114821\")\n\nOdd assignment...\n\n"
    },
    {
      "time": "16 Mar 2014 — 9:17pm",
      "content": "I've heard type designers being compared to architects, but they must be talking about display fonts, if you get my drift... :-) To me the closest other profession to text face design is... shoe-making!\n\nhhp\n\n"
    },
    {
      "time": "17 Mar 2014 — 12:03pm",
      "content": "I don’t think it’s possible to shake out many specialist typographers these days—everybody does it.  \n(With a nod to Charles Ellertson, who calls himself a “comp”, not a typographer.)\n\n"
    },
    {
      "time": "17 Mar 2014 — 3:10pm",
      "content": "When you're writing something \"inspirational\" for \"leaders\", falsifiable observations of reality (such as an ad hoc psychological profile of typography professionals) are only going to get in the way. A purely metaphorical premise is safer. Write about what they can learn from _typefaces._ \"The spaces between things are as important as the things themselves,\" that kind of stuff. You could probably even derive something genuinely meaningful about clarity of communication.\n\n"
    },
    {
      "time": "17 Mar 2014 — 7:57pm",
      "content": "Actually, due to his long career, Nick Shinn, is both a type designer and typographer.\n\nNot too many who have been both a \\*serious\\* art director and type designer, though.\n\n"
    },
    {
      "time": "9 Apr 2014 — 5:43am",
      "content": "Thanks for the comments, especially Ceruleans' which were helpful.  \nCombined lack of sleep and typing on the go resulted in a muddled original posting. Apologies for spelling and my somewhat naive question. I just joined the forum and asked for help as I realised I'm out of my depth.... It's been really educational reading the other postings. I have huge respect for typographers though!\n\n"
    },
    {
      "time": "9 Apr 2014 — 3:21pm",
      "content": "they are often ill of characteritis.\n\n"
    }
  ]
}
