{
  "id": "114933",
  "title": "Thoughts on the Olive Garden logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design",
    "rebranding",
    "restaurant"
  ],
  "content": "So I'm sure everyone's heard of [Olive Garden's rebranding](http://web.archive.org/web/20150317175943/http:/www.underconsideration.com/brandnew/archives/new_logo_for_olive_garden.php#.UyFQL-ddWhY). So far most of the feedback I've seen online seems to be negative.\n\nI'm still pretty wet behind the ears as a designer, and I'm afraid that whatever atrocious errors those with more experience see in this logo are completely flying over my head with a great billowy _swoosh_.\n\nCould I trouble anyone for a constructive crit about what works and doesn't work with the logo? I feel like if I could put myself behind your typographically-attuned eyes, I could hopefully learn something.\n\nThanks in advance!\n\n ![](http://web.archive.org/web/20150317175943im_/http:/typophile.com/files/Olive-Garden-Logo-Redesign-2014_4762.png)\n\n",
  "author": "chillinkwa",
  "time": "12 Mar 2014 — 11:43pm",
  "uid": "216026",
  "comments": [
    {
      "time": "13 Mar 2014 — 12:22am",
      "content": "Never heard of Olive Garden or the re-branding! I like it your design and it looks better with the brown background on the website. The old logo was horrible kitchen-kitchy with the words \"olives\" and the image of grapes together giving instant brain-pain. In this design the lettering is elegant and friendly, but perhaps a bit too large compared with the olive branch? If the owners prefer it, you can have some continuity with the old design by embossing the lettering and drawing slightly, even giving the lettering a slightly rough edge? The olives can be a bit more elongated.\n\n"
    },
    {
      "time": "13 Mar 2014 — 4:13am",
      "content": "Negative reaction to this \"update\" is quite reasonable given that they are effectively discarding \\*everything\\* but the name and re-creating the brand from scratch. These two logos are completely unrelated. They don't share the look, they don't share a feel and they imply a completely different restaurant atmosphere. The company effectively is closing down all existing Olive Gardens and opening something different instead. \\*This\\* is what people don't like, not the curves on the glyphs.\n\nImagine Coca-Cola deciding to re-brand using a geometric sans-serif against steel-gray background. Same here.\n\n"
    },
    {
      "time": "13 Mar 2014 — 1:35pm",
      "content": "Curve-wise, I think the lack of optical compensation where strokes meet is a problem. I also think there is a style conflict within the word: some letters appear constructed and static, only with a tail or swash tacked on as an afterthought – others appear more fluid. It’s all over well composed and the swashed capitals are very charming. The twig is nicely drawn.\n\n"
    },
    {
      "time": "13 Mar 2014 — 9:15am",
      "content": "While the old and new logos have big differences, I don't think customers will be confused. It's not unusual for companies to make significant changes to their logo. Some customers won't even notice the logo change.\n\nI'm not in love with the new logo, but it's okay. A lot of the criticism at the Brand New site is due to negative reactions to Olive Garden itself. Sure it's not the best or most authentic Italian food, but people don't go to Red Lobster, Applebees, or Olive Garden for fine dining, they go for a decent meal at a reasonable price.\n\n"
    },
    {
      "time": "13 Mar 2014 — 11:39am",
      "content": "As I said in a comment elsewhere, something about the color scheme and the olive branch reminds me of the logo for Todd English's Figs restaurant, though I doubt that was intentional.\n\n ![](http://web.archive.org/web/20150317175943im_/http:/typophile.com/files/figs_4639.jpg)\n  \nI don't love the new Olive Garden logo, but I like it better than the old \"bring-the-whole-family-for-spaghetti-and-meatballs\" logo. I imagine they were going for modern and sophisticated (a more affluent clientele?), but they didn't want to scare away the family trade, so they backed off a little with a font reminiscent of grade-school cursive. \n"
    },
    {
      "time": "14 Mar 2014 — 2:13pm",
      "content": "It sucks olives. Which are like small eggs.\n\nhhp\n\n"
    },
    {
      "time": "17 Mar 2014 — 1:36am",
      "content": "It reminds me a lot of...  \n ![](http://web.archive.org/web/20150317175943im_/http:/i.imgur.com/S2eWrSv.jpg)\n\nI think it took a lot more feminine approach to Olive Garden. I'm not sure about their main target audience but it's definitely appealing more to females than its old logo did.\n\nFor my taste, the composition can be improved. I think negative spacing needs to be fixed between Olive, Garden, and the branches. The placement for \"Italian Kitchen\" is just.. there. It's subtly aligned center to the \"arden\" in \"Garden\" but it does not work well with the rest of the design.\n\n"
    },
    {
      "time": "20 Mar 2014 — 4:56pm",
      "content": "While I did not personally write this post, this article provides the best explanation as to why the new Olive Garden logo fails by a landslide [http://www.adrants.com/2014/03/heres-whats-wrong-with-olive-gardens.php](http://web.archive.org/web/20150317175943/http:/www.adrants.com/2014/03/heres-whats-wrong-with-olive-gardens.php)\n\nImho, what's wrong with the new logo has more to do with tonality than design style. The new logo looks more like something you might design for a frozen yogurt shop. It's particularly juvenile in appearance - not that juvenile is bad, but it isn't appropriate for a sit-down restaurant where a couple is expected to pay $60 for dinner, and that's before the wine arrives.\n\nI didn't love the old logo either. It was complex and clunky, and completely over designed. But this one is infinitely worse because it says \"cheap, fast and easy \" -- a far cry from the sophisticated class of customers that OG wishes to attract.\n\n"
    },
    {
      "time": "21 Mar 2014 — 8:16am",
      "content": "\\> $60 for dinner, and that's before the wine arrives.\n\nMaybe in big cities, but in my area most of the dinner entrees are around $12-$16.\n\n"
    },
    {
      "time": "9 Apr 2014 — 6:16am",
      "content": "I second @apankrat. The new logo is actually very nice (although I would rotate olive branch a bit clockwise to adjust space between elements) but it doesn't have anything to do with the old one.\n\nUnless Olive Garden moves to a new market where they're not a recognised brand, new logo should be an **evolution** of the existing.\n\n"
    },
    {
      "time": "22 May 2014 — 1:31am",
      "content": "Personally, I like the new logo more. It's minimal and more eye catching.\n\n"
    },
    {
      "time": "7 Sep 2014 — 10:15pm",
      "content": "> Negative reaction to this \"update\" is quite reasonable given that they are effectively discarding \\*everything\\* but the name and re-creating the brand from scratch. These two logos are completely unrelated. They don't share the look, they don't share a feel and they imply a completely different restaurant atmosphere. The company effectively is closing down all existing Olive Gardens and opening something different instead. \\*This\\* is what people don't like, not the curves on the glyphs.> Unless Olive Garden moves to a new market where they're not a recognised brand, new logo should be an evolution of the existing.\n\nHmm, that makes sense... People hate change. Maybe if they'd illustrated a bunch of grapes instead of the olive branch (even if the branch is arguably more related to the name), it would've been close enough to the old logo to be considered a natural progression.\n\n"
    }
  ]
}
