{
  "id": "114975",
  "title": "Buy Fonts Save Lives",
  "forum": "General Discussions",
  "tags": [
    "cancer",
    "charity",
    "General Discussions"
  ],
  "content": " ![](http://web.archive.org/web/20140803170515im_/http:/typophile.com/files/BFSYlogoJG580px_3699.png)\n\nCAN BUYING A FONT HELP SAVE SOMEONE'S LIFE? – YES IT CAN!\n\n#BUYFONTSSAVELIVES will sell typefaces to raise money for Cancer Research UK and Macmillan Cancer Support. The brainchild of Haymarket Creative Director Paul Harpin, all proceeds are going directly to these two great charities.\n\nThe fund-raising project was inspired by Harpin’s niece Laura, who sadly died aged just 26. Paul created a new typeface family to sell in her memory. Other type designers and experts are kindly joining in to help raise funds.\n\nThe fonts are available to buy and download from [www.typespec.co.uk/buyfontssavelives](http://web.archive.org/web/20140803170515/http:/www.typespec.co.uk/buyfontssavelives \"www.typespec.co.uk/buyfontssavelives\") with the initial releases including the following:\n\nLAURA  \nA new typeface family in four styles – Plain, Shaded, Ribbon, Stencil – twelve weights plus italics in each style. Designed by PAUL HARPIN assisted by PAUL HICKSON. “This is my first ever typeface,” says Harpin, “and I now know how hard type designers work”.\n\nHESELTINE  \nKindly donated by LORD HESELTINE. Two styles – Text and Titling. Originally produced as a gift from Haymarket Media Group to Lord Heseltine for his 75th birthday. Designed by PAUL HICKSON and his wife PATRICIA. For Hezza’s 80th we added italics, for Latin plant names.\n\nMFRED  \nDonated and designed by MATT WILLEY (assisted by HENRIK KUBEL at A2 -TYPE) in honour of his father Nick. This much sought after headline font was originally drawn for ELEPHANT magazine, then used in Matt’s PORT magazine and has featured in the US edition of WIRED.\n\nORGANON  \nKindly donated by G-Type's Nick Cooke, this special pack includes the Regular & Bold weights of both Organon Sans & Serif which have been designed specifically to complement one another. Feature rich OpenType fonts with Small Caps and extended European character sets.\n\nPlease help to spread the word about this campaign or kindly buy one of the fonts. Get in touch if you’d like to donate a typeface.\n\n#buyfontssavelives  \n [www.typespec.co.uk/buyfontssavelives](http://web.archive.org/web/20140803170515/http:/www.typespec.co.uk/buyfontssavelives \"www.typespec.co.uk/buyfontssavelives\")  \n [www.buyfontssavelives.com](http://web.archive.org/web/20140803170515/http:/www.buyfontssavelives.com/ \"www.buyfontssavelives.com\")\n\ne: [paul.harpin@haymarket.com](mailto:paul.harpin@haymarket.com) or [joe@typespec.co.uk](mailto:joe@typespec.co.uk)\n\n",
  "author": "joe graham_typespec",
  "time": "14 Mar 2014 — 8:46am",
  "uid": "1503",
  "comments": [
    {
      "time": "14 Mar 2014 — 3:34pm",
      "content": "This is cool initiative. I'm particularly tempted by Mfred and Organon.\n\nBTW, there doesn't seem to be an actual site at [www.buyfontssavelives.com](http://web.archive.org/web/20140803170515/http:/www.buyfontssavelives.com/ \"www.buyfontssavelives.com\")\n\n"
    },
    {
      "time": "16 Mar 2014 — 1:34am",
      "content": "Go for it. It's a bargain.\n\n"
    },
    {
      "time": "17 Mar 2014 — 7:03am",
      "content": "Hi Marc, that micro site should be online in the coming days but I don't have a hand in that so can't categorically say, however you can view and buy the fonts from Typespec here:  \n [http://www.typespec.co.uk/buyfontssavelives](http://web.archive.org/web/20140803170515/http:/www.typespec.co.uk/buyfontssavelives \"http://www.typespec.co.uk/buyfontssavelives\")  \nThanks for the support and spread the word.\n\n"
    }
  ]
}
