{
  "id": "114952",
  "title": "The Concept of Stripping Down the Serifs?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "serif"
  ],
  "content": "Do you know who is the first designer which used to strip down a traditional serif typeface? I know a contemporary example: František Štorm removes the serifs of the XVII th century Jannon Roman.  \nJannon Antiqua  \n [http://www.stormtype.com/family-jannon.html](http://web.archive.org/web/20140713045657/http:/www.stormtype.com/family-jannon.html \"http://www.stormtype.com/family-jannon.html\")  \nJannon Sans  \n [http://www.stormtype.com/family-jannon-sans.html](http://web.archive.org/web/20140713045657/http:/www.stormtype.com/family-jannon-sans.html \"http://www.stormtype.com/family-jannon-sans.html\")\n\n",
  "author": "Fournier",
  "time": "13 Mar 2014 — 11:58am",
  "uid": "212885",
  "comments": [
    {
      "time": "13 Mar 2014 — 1:36pm",
      "content": "[Britannic](http://web.archive.org/web/20140713045657/http:/www.identifont.com/similar?69N) (Wagner & Schmidt, 1901)\n\n"
    },
    {
      "time": "13 Mar 2014 — 3:34pm",
      "content": "Can you elaborate on _Britannic_ and its 'core' reference?  \nThanks in advance.\n\n"
    },
    {
      "time": "13 Mar 2014 — 4:43pm",
      "content": "Clearface/Clearface Gothic, by M. F. Benton?\n\n"
    },
    {
      "time": "14 Mar 2014 — 5:48am",
      "content": "The way you phrased your question is interesting - \"stripping down the serifs\" sounds as if one is peeling some vegetable to get rid of some rough texture or hard parts. I think the process with which a traditional type or script turns into a san-serif is fascinating and has occurred in almost all the scripts I have encountered - Arabic, Japanese, Thai, etc etc. In Japanese for example the brush-strokes which have thick and thin could be made mono-width, and the stroke endings which often twist into a tiny this edge are neglected. More than just stripping extra detail, san-serif as it has become to be used means finding the generic essential shape of the letter of a script and presenting it free of the traditional marks left by tools such as a chisel, bamboo pen, quill or brush. I have tried to do that for Arabic 50 years ago and am just now finishing the font!\n\n"
    },
    {
      "time": "14 Mar 2014 — 11:44am",
      "content": "I wonder if a designer ever tried to strip down the serifs of the traditional era typefaces?  \nTurn _Jenson_, _Garamond_, _Kis_, _Caslon_, _Fournier_, _Baskerville_, _Didot_ naked and 'sans' and with a satisfying result from readability and design perspectives.  \nImagine this superfamily package:  \n_Garamond_, _Garamond Semi Serif_, _Garamond Sans_, _Garamond Semi Sans_.  \nIf only Slimbach could do the task.\n\n"
    },
    {
      "time": "16 Mar 2014 — 10:23am",
      "content": "Well, Martin Majoor has done this type of work. He has written about his particular approach to deriving sans from serif designs on his website: [http://www.martinmajoor.com/6\\_my\\_philosophy.html](http://web.archive.org/web/20140713045657/http:/www.martinmajoor.com/6_my_philosophy.html \"http://www.martinmajoor.com/6\\_my\\_philosophy.html\")\n\nIIRC Syntax was one of the first, if not the first, published sans-serif directly derived from a Renaissance [serif, text] design. There’s also the (unpublished) sans that Van Krimpen made to match his Romulus in the 1930s.\n\n"
    },
    {
      "time": "16 Mar 2014 — 11:04am",
      "content": "Syntax was \\*directly\\* derived from a Renaissance design? Which one?\n\n"
    },
    {
      "time": "16 Mar 2014 — 11:33am",
      "content": "Um, no, sorry, should have said “model” not design. Not that I’d know of, at least.\n\n"
    },
    {
      "time": "16 Mar 2014 — 11:35am",
      "content": "> \"Meier described **_Syntax_** as being a sans-serif face modeled on the Renaissance serif typeface, similar to **_Bembo_**. The uppercase has a wide proportion, and the terminals not being parallel to the baseline provide a sense of animation. The lowercase a and g follow the old style model of having two storeys. The italics are a combination of humanist italic forms, seen in the lowercase italic q, and realist obliques, seen in the lowercase italic a, which retains two storeys, unlike in other humanist sans-serif typefaces like **_FF Scala Sans_** and **_Gill Sans_** , where the a has a single storey italic.\"\n"
    },
    {
      "time": "16 Mar 2014 — 6:45pm",
      "content": "And since everything seems to be valid in typography these days, why not add serifs to original sans-serifs ? ;)\n\n"
    },
    {
      "time": "1 Jul 2014 — 7:58am",
      "content": "Designer Jason Vandenberg fashioned a Bodoni Sans Serif.\n\n_Bodoni Sans_ (2014)\n\n[http://www.myfonts.com/fonts/greyscale-type/bodoni-sans/](http://web.archive.org/web/20140713045657/http:/www.myfonts.com/fonts/greyscale-type/bodoni-sans/ \"http://www.myfonts.com/fonts/greyscale-type/bodoni-sans/\")\n\n¶ Modern typefaces, such as Bodoni and Didot have been the quintessential faces of fashion for nearly two centuries. With high contrast, flat serifs, and horizontal stress, this combination exudes confidence and elegance.\n\n¶ Today, Sans-Serif typefaces have become the new standard for the description of modern. Clean lines, extremely thin weights, and rational forms are common in fashion and design today. With this in mind, are Modern typefaces like Bodoni still the standard? Yves Saint Laurent said: “Fashions fade, style is eternal.” Is there a way to move Bodoni forward, while maintaining the inherent style?\n\n¶ Bodoni Sans moves forward by removing the serifs, while maintaining the high contrast and elegant curves. Although, these fonts are more than just chopping off the serifs. Several cuts of Bodoni were compared, and collectively used as a base. The classical proportions of the capitals and x-heights were maintained, but the letterforms were rebalanced for use without serifs. Contemporary modifications were made to some widths, as well as an all new Light weight was created. The letterforms were also engineered with a reductive bezier point method, for optimal performance. Together these updates to the classic provide a truly modern look.\n\n¶ High contrast is the key feature of Bodoni Sans. To maintain this contrast over a wide range of sizes, three optical sizes were drawn: Standard, Display and Text. Contrast adjustments were made for each optical size for optimal performance. The Standard was designed for the mid range of 12 to 60pt, Display for 48pt and above, and Text for 6 to 12pt.\n\n¶ Web/Digital use was also considered while developing Bodoni Sans. The fonts were tested as web formats, and examined on a variety of screens, to ensure seamless use in both print and digital applications.\n\n¶ Bodoni Sans is a new classic built on the foundation of two centuries of history. Fresh and contemporary, while feeling familiar. Stylish and sophisticated, Bodoni Sans is a new Modern.\n\n"
    },
    {
      "time": "1 Jul 2014 — 9:08am",
      "content": "Pretty nice and interesting, but I can't get past that back-leaning /S and /s.\n\n"
    },
    {
      "time": "1 Jul 2014 — 9:57am",
      "content": "@Vladimir Tamari:  \n<cite>And since everything seems to be valid in typography these days, why not add serifs to original sans-serifs ? ;)</cite>\n\nBut we already _have_ Stymie and Memphis and Cairo... what could we get from adding serifs to a sans-serif that would be much different from that?\n\nOf course, I suppose we could add serifs to a face like Radiant...\n\n"
    },
    {
      "time": "1 Jul 2014 — 10:26am",
      "content": "_Bodoni Sans_ make me think of _Peignot_ because of the contrast. Anyway, they are different.\n\n"
    },
    {
      "time": "1 Jul 2014 — 1:15pm",
      "content": "Oh, of course. Adding serifs to Radiant would not give you Bodoni.\n\n"
    },
    {
      "time": "2 Jul 2014 — 1:17am",
      "content": "@quadibloc  \n...it was just an idea from my ever-inventive mind. But of course there is nothing new under the sun, and I never cease to be amazed at the arcane knowledge of fonts you and many here have!\n\n"
    }
  ]
}
