{
  "id": "114936",
  "title": "The font is bit of discontinuing nature.",
  "forum": "Home",
  "tags": [
    "Text"
  ],
  "content": " ![](http://web.archive.org/web/20140319225841im_/http:/typophile.com/files/09fc6b01edd590d17b45f23a1c4da7f2_4232.5111.png)\n\n",
  "author": "forjob29",
  "time": "13 Mar 2014 — 1:40am",
  "uid": "218342",
  "comments": [
    {
      "time": "13 Mar 2014 — 3:06am",
      "content": "Sorry but a way too small and blurry for my eyes. Really need a better sample or at least the origin of the sample...\n\n"
    },
    {
      "time": "14 Mar 2014 — 12:03am",
      "content": "Here is another sample.\n\n ![](http://web.archive.org/web/20140319225841im_/http:/typophile.com/files/dd_4815.jpg)\n\n"
    },
    {
      "time": "14 Mar 2014 — 8:31am",
      "content": "Can somebody find the font for me? I asked it even in the old ID board. Sorry for that, but the font is very crucial. Found in an ebook in one of my friend's. He too wants to know the font name and type.\n\n"
    },
    {
      "time": "14 Mar 2014 — 8:33am",
      "content": "I tried but even with your new sample, I wasn't able to find it. This one is still in bad condition.\n\n"
    },
    {
      "time": "14 Mar 2014 — 8:44am",
      "content": "Its not in bad shape the font itself is the same and clear. Yes it has a discontinuing trait when seen at once. But when you look at the same identical letters in the different words they are the same. E.g. the p and d's have a doted at their drops and the t is particularly discontinued.\n\n"
    },
    {
      "time": "14 Mar 2014 — 9:27am",
      "content": "OK, I see (actually not ;) what you're meaning. So, I'm afraid I'd be totally helpless on that one. Sorry for that.\n\n"
    },
    {
      "time": "16 Mar 2014 — 2:50am",
      "content": "So what should I do now? Is the image not clear enough. Should I post the whole image file. Its from as ebook page. Anyway I am putting it here. Please can anybody help in some other way with the font.\n\n ![](http://web.archive.org/web/20140319225841im_/http:/typophile.com/files/DATAFILE1_5114.jpg)\n\n"
    }
  ]
}
