{
  "id": "115043",
  "title": "Sub pixel rendering font versions",
  "forum": "Stefan Seifert's blog",
  "tags": [
    "sub-pixel rendering"
  ],
  "content": "I am still captured by adapting monitor fonts for sub-pixel rendered environment. Two pics from my font meant to work in small sizes and in negative use white on black ground. To create a version that is similar in weight to the original one has to do a very much lighter character design like the one above in this pic.  \nBut it’s worth while because sub-pixel fonts look so much neater and better!  \nTo see it „at work“ here is my credit page part of my homepage: [http://www.stefanseifert.com/Contact.html](http://web.archive.org/web/20150317223002/http:/www.stefanseifert.com/Contact.html)\n\n ![](http://web.archive.org/web/20150317223002im_/http:/typophile.com/files/sub-pixel_version_5553.png)\n\n ![](http://web.archive.org/web/20150317223002im_/http:/typophile.com/files/Sf41_sub-pixel_4217.png)\n\n",
  "author": "Stefan Seifert",
  "time": "17 Mar 2014 — 12:17pm",
  "uid": "19151",
  "comments": [
    {
      "time": "17 Mar 2014 — 1:39pm",
      "content": "Since you can’t possibly predict the results without a ton of Javascript or accurately control them without a ton of fonts, the effort is rarely worth it. But the lesson is important, and sometimes a little effort can go a long way.\n\n"
    },
    {
      "time": "17 Mar 2014 — 9:43pm",
      "content": "Yes, in fact there is JS necessary to control it.  \nFirst of all the site has to check if user is on Mac at all, otherwise the font will appear very very thin and broken. Second on animated scenes text blocks will need no transparency in its background otherwise they also will not show correctly while animated (f.e. transparency transition).  \nSo it seems you are right but on the other hand I love the idea of getting fonts more and more readable on screen devices. And the sub-pixel rendering in my eyes is big progress.  \nDid you make some experiences with your work? I would love to discuss it and see your results.\n\nPS  \nI recently observed that, yet, the results of sub-pixel fonts are far more consistent for what regards cross browser. Interesting to me. Because grayscale anti-aliasing show great differences on some browsers. Google Chrome is best here, Safari worse ecc. Meanwhile the sp fonts look nearly the same everywhere.\n\n"
    }
  ]
}
