{
  "id": "115022",
  "title": "Typesetting my first book – choosing a typeface",
  "forum": "General Discussions",
  "tags": [
    "choosing a typeface",
    "Dracula",
    "General Discussions",
    "Scotch Roman",
    "typesetting"
  ],
  "content": "For a school project, I’m typesetting my first book. I’ve read numerous Typophile threads on choosing a book typeface and consulted Bringhurst, but I’m buckling down to ask for some more specific advice.\n\n_Historical considerations:_  \nMaybe this is a little “purist” for my first book, but I think that historical considerations for type warrant at least some consideration. Here is a summary of my admittedly haphazard research:\n\n1. Bram Stoker is Irish\n2. Dracula was published in 1897\n3. Vlad the Impaler was a 15th century Romanian Prince and inspiration for Count Dracula\n4. It seems as though Scotch Roman type was a common text face for the time it was published (at least in America?)\n5. The book takes place in England and Romania\n6. Even if it was appropriate to use, and I'm not sure that it is, there isn’t really much (if any) Romanian type from that time\n\n_Questions:_  \nAm I right in thinking that Scotch Roman type would be appropriate? If not, I'd love to hear a better suggestion.  \nIs it too far of a stretch (as I suppose) to appeal to the 15th century type to evoke the centuries old character of Dracula?\n\nBeing a student, financial considerations are in order... but I’d be willing to purchase a reasonably priced roman and italic text face if the right one came along. Here are some I’ve found:\n\n1. [Harriet](http://web.archive.org/web/20140803214645/http:/www.myfonts.com/fonts/okay-type/harriet/)\n2. [Miller](http://web.archive.org/web/20140803214645/http:/www.myfonts.com/fonts/fontbureau/miller/)\n3. [Bulmer](http://web.archive.org/web/20140803214645/http:/www.myfonts.com/fonts/mti/bulmer-mt/) – not necessarily Scotch Roman, but still on the modern side\n\nThanks!\n\n",
  "author": "nburns",
  "time": "16 Mar 2014 — 8:20pm",
  "uid": "218435",
  "comments": [
    {
      "time": "16 Mar 2014 — 9:37pm",
      "content": "Hmm. By the way, you're designing the book. Usually typesetters just execute what the designer specifies. The trick is to be a designer rather than a stylist. (Hint: <cite>stylists</cite> were the guys that put tailfins on all the 1950s-60s era cars. Though they <cite>called</cite> themselves designers, true enough...)\n\nHere's the conundrum. Isn't it more appropriate to use a font that a general modern audience sees as timely, rather than one which was actually used? Take a look at the title page from the first edition of Jane Austen's <cite>Pride and Prejudice</cite>...\n\n[http://upload.wikimedia.org/wikipedia/commons/1/17/PrideAndPrejudiceTitl...](http://web.archive.org/web/20140803214645/http:/upload.wikimedia.org/wikipedia/commons/1/17/PrideAndPrejudiceTitlePage.jpg \"http://upload.wikimedia.org/wikipedia/commons/1/17/PrideAndPrejudiceTitlePage.jpg\")\n\n<cite>Edit:</cite>\n\nAnother story: I once had to set a book about the Lakota (proper name for one of the \"Sioux\" Indian tribes) in Goudy Sans, because the designer didn't want to use a typeface that looked \"European\" or \"American.\" Noble thought, I suppose, but since the only written form of the Lakota language uses the Latin alphabet, forlorn. I thought Goudy Sans a singularly poor choice. Consider that, if you can't find a \"Romanian\" typeface. (And remember, even if you could, she/he probably would have been schooled at Reading...).\n\n"
    },
    {
      "time": "16 Mar 2014 — 10:00pm",
      "content": "Thanks for the terminology tip! I'll tuck that away for later.\n\nBoth good points accompanied by good illustrations. I suppose it's likely I'm committing the all-too-common mistake of overthinking the issue... maybe I'm just scared of getting stuck with the wrong typeface.\n\nInvestigating the history seemed a good place to start – esp. given that I know so little – so any recommendations on where else to start are very welcome. I'll keep looking around.\n\nThanks again.\n\n"
    },
    {
      "time": "16 Mar 2014 — 10:21pm",
      "content": "You're not over-thinking. You're thinking.\n\nThat a language uses the Latin alphabet does not mean there's no room to express non-Western ideals. Consider for example Turkish: wanting to be more European is one thing, unceremoniously throwing out Turkey's Arabic-script past is another.\n\nhhp\n\n"
    },
    {
      "time": "16 Mar 2014 — 11:39pm",
      "content": "You may be over-thinking, but you instinct is correct. You job as a designer is to present an author to an audience. If you want, for example, to make a statement on the Turkish policy of allowing no language but modern Turkish -- write an article or a book of your own, criticizing that policy. If it's worth doing, do so in a straightforward way. If such ideas are a part of the text you're designing, you can, in the small ways open to designers, aid the author's position in your design. But if they are not, and you can't abide that, decline the job.\n\nThere may also be a difference in perspective between a school assignment and professional work. Usually professional work involves doing your best to aid sales. It at least involves the medical notion of \"do no harm\" -- and in these cases, that would usually be \"harm\" to a commercial endeavor.\n\nWhile it doesn't come up often, most of us have, as professionals, turned down work rather than compromise the twin commitments to ourselves and our clients -- though <cite>Dracula</cite> likely presents no such dilemma...\n\n"
    },
    {
      "time": "17 Mar 2014 — 6:03am",
      "content": "Scotch Roman certainly is evocative of 1897. It does have the downside of being, at least in some forms, unattractive to modern readers, particularly in the forms used in the late nineteenth century. (On the other hand, books from 1805 or thereabouts also tend to be set in Scotch Roman, but in typefaces from that group which generally are attractive in appearance to modern taste. But that isn't terribly relevant.)\n\nThe book \"The Annotated Dracula\" reproduces an early publication of the novel, as well as providing useful background information.\n\nThe question that needs to be asked, though, is the kind of book you're aiming at producing.\n\nA mass-market paperback intended to be read for entertainment would be set in one of the conventional reading faces of today - Times Roman, Century Expanded, or Caledonia.\n\nA book aimed at being decorative in appearance would be set in something that looked pretty, fairly independently of considerations of authenticity. Here, we're talking about faces like Centaur, Kennerley, Jenson Oldstyle, Cloister Lightface.\n\nIn between the above two categories, there are faces like Baskerville, Garamond, Bembo, Plantin, and Palatino, for example; these are nice looking typefaces used for ordinary books rather than fancy private press ones.\n\nHere\n\n[http://regi.sk-szeged.hu/statikus\\_html/kiallitas/buchkultur/chron2.html](http://web.archive.org/web/20140803214645/http:/regi.sk-szeged.hu/statikus_html/kiallitas/buchkultur/chron2.html)\n\nis a page from the Chronica Hungarorum, the first book printed in Hungary.\n\nAs for the first book printed in Romania, a coin commemorates its 500th anniversary, but I haven't found images of any pages from the Litourgicon of Macarie.\n\n"
    },
    {
      "time": "17 Mar 2014 — 8:32am",
      "content": "Charles is certainly right that a designer should not \"sneak in\" his own ideas into a topic. His duty is to visually amplify the message (although this _does_ include conveying things that the author might not even realize he's expressing).\n\n> write an article or a book of your own\n\nThis however is a non sequitur: just because you don't have the time/desire/ability to write text doesn't mean you can't leverage _visual_ language. Example: for a text about pre-WWI Turkish history, using a font with a diamond tittle\\* to subtly convey the Arabic script.\n\n\\* [http://typophile.com/node/97738](http://web.archive.org/web/20140803214645/http:/typophile.com/node/97738 \"http://typophile.com/node/97738\")\n\nhhp\n\n"
    },
    {
      "time": "17 Mar 2014 — 3:22pm",
      "content": "School projects certainly are different from commercial projects. My main goal is to design a book that's decently impressive and that stands up to close examination without breaking any major rules. I don't have the restriction of a mass market paperback audience (no Times for me!), but I'm not sure I want to attempt an overly decorative setting, as I haven't even set a _normal_ book yet.\n\nSpeaking of _diamond tittle_ I found [Maiola](http://web.archive.org/web/20140803214645/http:/www.type-together.com/Maiola), an eastern European typeface. To me, it seems that the calligraphic and humanist elements could connote the correct time period to a modern audience. Thoughts?\n\nPlus, Typetogether has a handsome 25% discount for students.\n\nRegarding a more English feel, there's always Baskerville (which I do own thanks to Apple or Adobe, but I'm not sure which version I have or how well it suits book setting). It feels properly old to untrained eyes.\n\nTypetogether also has [Athelas](http://web.archive.org/web/20140803214645/http:/www.type-together.com/Athelas) (one I also already own), which they say is \"inspired in Britain's literary classics\". Not sure it feels as English or as old as Baskerville.\n\n_Edit: the link to Maiola didn't work._\n\n"
    },
    {
      "time": "17 Mar 2014 — 4:57pm",
      "content": "In passing, are you planning to set this book using metal? A number of the fonts mentioned in this thread look good in specimen books -- as long as those specimen books are samples of letterpress.\n\nIf your school exercise in \"typesetting\" is to have printing as an end result, go to the library -- or bookstore -- and look at books printed after 2000. There are typefaces that look good with the newer platemaking technology, but far fewer than you might imagine. Miller is one of those, a favorite font of a late Typophile contributor, Will Powers. Go down to his name in this thread\n\n[http://typophile.com/node/45205](http://web.archive.org/web/20140803214645/http:/typophile.com/node/45205 \"http://typophile.com/node/45205\")\n\nWill was a genuine union-level Journeyman pressman -- one step down from master printer in the old school tradition, working some at the Steinhour Press (but I think not a journeyman there) & elsewhere before becoming a book designer. He had a good grasp of ink on paper, always the final result by which a book is judged.\n\n^ ^ ^\n\nFor a completely different approach to the choice of typeface, you might consider that few of the Scotch Romans have what I'd call an \"edgy\" quality, yet the Dracula tale does. You could key on that rather than historical period.\n\n"
    },
    {
      "time": "17 Mar 2014 — 5:50pm",
      "content": "I'm getting too drawn into this project.\n\nAssuming you are talking about <cite>Dracula</cite>, and I was to do a new design for a trade hardback, I'd have Miller as a fallback, but I'd look elsewhere first.\n\nI'd take a look at Trinité No. 2, Roman condensed, on a hunch. There is no direct allusion, but the feel of it might work. Just a hunch. Then I'd try Skolar, which you <cite>could</cite> afford. That too on a hunch, and a typeface I'm pretty sure I could get to work at some level. And if those didn't pan out, figuring out why would likely lead me to other choices. Miller would always work, but only that.\n\n"
    },
    {
      "time": "17 Mar 2014 — 5:52pm",
      "content": "What about this?  \n [http://typographica.org/typeface-reviews/eskapade/](http://web.archive.org/web/20140803214645/http:/typographica.org/typeface-reviews/eskapade/ \"http://typographica.org/typeface-reviews/eskapade/\")\n\nhhp\n\n"
    },
    {
      "time": "17 Mar 2014 — 6:25pm",
      "content": "\\>Are you planning to set this book using metal?\n\nIf only! I'm currently a simple graphic design student with a fairly extreme interest in type that's quickly becoming a passion. For my graphic design class, we get to choose our final project – hence this project. Given the format, I think Dracula will pose some interesting typographical challenges without being too lofty a goal.\n\nI know this isn't optimal, but I ultimately want to get this printed as a piece for my portfolio show next semester – short run for sure, so _undoubtedly_ printed via digital press. I'm not sure how much control I'll have over paper, so I'm not counting on something terribly nice... like I said, not optimal, but I really want to get a start on designing a book for once.\n\n\\>_Miller_ – That was my gently researched opinion, resulting in this thread. I printed a (low res) PDF specimen of Nick Shinn's _Scotch Modern_ ($$$), and I think it's one of the few that does have that edge.\n\n\\>_Trinité_ – It's gorgeous. I discovered that one earlier on in my research. Fortunately/unfortunately type really _is_ worth top dollar.\n\n\\>_Skolar_ – I like it, and it hints on the edgy quality for sure (not settled on it, but I'll keep it in mind). It's a shame there's no small caps.\n\nIf I'm honest, I'm glad you're getting drawn in on this project. You've been a tremendous help!\n\n"
    },
    {
      "time": "17 Mar 2014 — 6:36pm",
      "content": "\\>What about this? [http://typographica.org/typeface-reviews/eskapade/](http://web.archive.org/web/20140803214645/http:/typographica.org/typeface-reviews/eskapade/ \"http://typographica.org/typeface-reviews/eskapade/\")\n\nActually, I encountered this a little earlier this afternoon! It looked intriguing, and I have to admit that incorporating the fraktur version is enticing given its edginess.\n\nThe deciding factor: how much money can I fork out for this project?\n\n"
    },
    {
      "time": "17 Mar 2014 — 6:57pm",
      "content": "Branching off on the edgy side, any thoughts on the suitability of the following as extended text faces? Is Arno too modern for _Dracula_?\n\n1. [Arno](http://web.archive.org/web/20140803214645/http:/www.myfonts.com/fonts/adobe/arno/)\n2. [Quant](http://web.archive.org/web/20140803214645/http:/www.myfonts.com/fonts/hoftype/quant/)\n3. [Ashbury](http://web.archive.org/web/20140803214645/http:/www.myfonts.com/fonts/hoftype/ashbury/)\n4. [Lapture](http://web.archive.org/web/20140803214645/http:/www.myfonts.com/fonts/justanotherfoundry/lapture/)\n\nThanks,  \nNathan\n\n"
    },
    {
      "time": "17 Mar 2014 — 7:01pm",
      "content": "Of course there are small caps in Skolar. In the full version I have, I believe even in polytonic Greek and Cyrillic. If you have any questions, get up with David Březina at Rosetta.\n\nBuy direct, not through MyFonts.\n\n[http://www.rosettatype.com/](http://web.archive.org/web/20140803214645/http:/www.rosettatype.com/ \"http://www.rosettatype.com/\")\n\nOne thing to add: If you're having a book printed \"via a digital press,\" that essentially means laser xerography, and you'll usually find that type is not so thin -- or accurate -- with that printing method as with 2,400 dpi offset. And that reopens the door for some of the old metal faces.\n\nBe aware that type weight from laser printers can vary considerably. Maintenance of those machines can vary considerably, too. A publisher we work for recently had a job run on one of them, and after a test file, asked us to red0 the images, as the black point was too high, and the blacks were also streaky. As indeed they were, but we pointed out that was the same with the large, black display type on the title page. And no, the type wasn't screened. Color management was not the problem with the images, crappy machine maintenance was.\n\nGet some samples. You should be able to see them for free, from the (hopeful) printer. Knowing your materials and how they will act in the environment you're using them is a huge part of being successful.\n\n"
    },
    {
      "time": "17 Mar 2014 — 7:06pm",
      "content": "Taking a look at some of the designs mentioned, I saw that Skolar seems to me to be similar to a great many 21st-century typefaces, including not a few on Google Fonts; whatever the original of that sort of typeface is, it has been widely copied.\n\nBut it doesn't look anything like Trinité; I guess they're just both good faces.\n\nTrinité reminds me a bit of Palatino, another very successful face. In trying to find out about the inspiration for Trinité, though, to determine if similar faces were more inexpensively available, I found that it was designed as an alternative to converting the typeface Romanée by noted type designer Jan van Krimpen to the phototypesetter.\n\nThe reason for designing a new typeface instead was that Romanée, like most other typefaces in hot metal, was subtly varied for each point size. Today, of course, some typefaces come in different forms suggested for use at different point sizes (examples range from Times Ten to Cycles) and so Romanée ought to be digitized someday.\n\nHowever, while Trinité reminded me of Palatino, Romanée reminds me of Caledonia. They don't seem to be that similar to one another. Which fact is in no way a criticism of **Bram** de Does (another reason for that face being appropriate to an edition of _Dracula_!) but it doesn't help me in finding the roots of that letterform.\n\nAfter some more looking, I can't find anything that strongly resembles Trinité. However, I did run across [Maiola](http://web.archive.org/web/20140803214645/http:/www.identifont.com/find?font=Maiola&q=Go), which also won some awards and which looks quite nice.\n\n"
    },
    {
      "time": "17 Mar 2014 — 7:53pm",
      "content": "Hmm. Trinité -- Roman condensed No. 2 -- doesn't at all remind me of Palatino. Well, a loose affiliation with Manutius, very loose. Same phylum?\n\nWhile it doesn't quite present correctly on the new Adobe Reader, here is a sample, designed by Richard Eckersley. Try viewing at 200% as well as \"automatic zoom.\"\n\n[https://www.tug.org/texshowcase/6553-sample.pdf](http://web.archive.org/web/20140803214645/https:/www.tug.org/texshowcase/6553-sample.pdf \"https://www.tug.org/texshowcase/6553-sample.pdf\")\n\nHere is a link to Richard's specifications\n\n[https://www.tug.org/texshowcase/6553-specs.pdf](http://web.archive.org/web/20140803214645/https:/www.tug.org/texshowcase/6553-specs.pdf \"https://www.tug.org/texshowcase/6553-specs.pdf\")\n\nThese days, most would use 14 or 15 point of leading with this text, but Richard, by the publisher's request, was fitting in an 2,800 characters per page...\n\nEdit: He's using an 54-unit em, if the letterspacing values don't make sense to you. \"4 units\" on a 54-unit em equals about \"75 units\" with InDesign's 1,000 unit em.\n\n"
    },
    {
      "time": "17 Mar 2014 — 7:53pm",
      "content": "I hadn't heard that about digital presses before:\n\n[that reopens the door for some of the old metal faces](http://web.archive.org/web/20140803214645/http:/typophile.com/wiki/that%20reopens%20the%20door%20for%20some%20of%20the%20old%20metal%20faces)\n\nAny in particular that you have in mind?\n\n"
    },
    {
      "time": "17 Mar 2014 — 7:57pm",
      "content": "I hadn't heard that about digital presses before:\n\n\\>\\> [that reopens the door for some of the old metal faces](http://web.archive.org/web/20140803214645/http:/typophile.com/wiki/that%20reopens%20the%20door%20for%20some%20of%20the%20old%20metal%20faces)\n\nAny in particular that you have in mind as being \"fair game\" under those circumstances?\n\n_Edit: I apologize for the two threads... Typophile informed me that the other wasn't posted due to my IP address and spam, so I tried again._\n\n"
    },
    {
      "time": "17 Mar 2014 — 7:57pm",
      "content": "If by \"digital press\" you mean letterpress using photopolymer plates: no metal fonts are used.\n\nhhp\n\n"
    },
    {
      "time": "17 Mar 2014 — 8:21pm",
      "content": "I take a digital press to be fast, large laser printers, as are used for short-run book production -- \\< 500 copies, or for on-demand printing. I never kept up with the polymer plates after Stephen Steinour quit on them, so I don't know what they're capable of today.\n\nEven though I flat can't read at all without glasses anymore, I believe I can see the difference between a page printed offset and one a \"digital press,\" without wearing glasses, at 3-foot viewing distance, with a 10-second examination. Just look at the color of the type and the regularity of the letterfit. (Edit: I just checked. Now, I have to wear glasses to see the difference. As a child of 60, I didn't.)\n\nPut it this way, I can't do final kerning based on laser printouts from the machine at the office, and I don't see any improvement with the \"digital presses.\" It is probably heretical, but I think they're capable of better work with images than with type -- properly maintained, of course. And it is hard for them to hold an ICC profile as they heat up, which does change the black and midrange points. Still...\n\n"
    },
    {
      "time": "17 Mar 2014 — 10:55pm",
      "content": "John–  \nI ran across Maiola earlier too! That might be the one; glad to hear you liked it too. Eastern European roots, so potentially appropriate for the Romanian aspect of _Dracula_.\n\nCharles–  \nI'll definitely ask for samples from the printer, thanks.\n\n\\>\\> \"laser xerography ... reopens the door for some of the old metal faces\"  \nAny typefaces that in particular that you think are now fair game? (You nixed a few mentioned earlier in this thread; wondering which of those maybe inspired this sentence.)\n\nThanks for the brief lessons on printing and on Trinité – both are very enlightening.\n\n"
    },
    {
      "time": "18 Mar 2014 — 5:57am",
      "content": "<cite>Any typefaces that in particular that you think are now fair game?</cite>\n\nI'm sure there are some, but as our work is for publishers who (almost) always print offset, I don't have any experience with just which thin, anemic revivals look passable on a digital press.\n\nThe point I hope I've made is that these days, with the (1) multiple and (2) different from historical ways of printing, you have to see the type in use to evaluate it.\n\nWhat you see praised in classical books on type -- written before, say, 1960, likely won't look that way in 2015. And what worked before DTP (circa 2000), may well not work now. **Letterforms** per se. are not the biggest issue anymore.\n\n"
    },
    {
      "time": "18 Mar 2014 — 7:09am",
      "content": "Nathan, the [original edition](http://web.archive.org/web/20140803214645/http:/books.google.com/books?id=k39vHp-5VeMC&printsec=frontcover&dq=dracula&hl=en&sa=X&ei=F00oU9iOGIe90AGLvoHQBA&ved=0CFoQ6AEwBg#v=onepage&q=dracula&f=false) was not in Scotch Roman, but in a version of Caslon, which was fashionable in the 1890s. There is a [recent revival of Caslon](http://web.archive.org/web/20140803214645/http:/www.fontbureau.com/fonts/WilliamsCaslonText/), which if you use the 'short descender' option and set it nearly solid, will get a similar look (but not over inked—better color :)\n\n"
    },
    {
      "time": "18 Mar 2014 — 6:55am",
      "content": "You have made your point. I think my naïve, _what-typeface-am-I-going-to-use_ mindset kept me from understanding it, so thank you for taking the time to clarify.\n\nNathan\n\n"
    },
    {
      "time": "18 Mar 2014 — 8:36am",
      "content": "> Letterforms per se. are not the biggest issue anymore.\n\nThey never were. But they remain significant, and arguably are the biggest issue in the context of... Typophile. :-)\n\nWhat a person spends time on is a balance of his desires and what society expects.\n\nhhp\n\n"
    },
    {
      "time": "18 Mar 2014 — 11:48am",
      "content": "> There is a recent revival of Caslon\n\nThanks for the recommendation, William! I actually had found the thread earlier where you were discussing your typeface with another book designer who, incidentally, was setting _Dracula_ (alongside some other early 20th century novels). He liked your Caslon revival, but I believe he chose a version of Walbaum for that book. I like yours as well, and financial considerations not in order (aka if I wasn't a student), I'd buy it in a heartbeat and likely use it for this book.\n\nAs it is, your hard work deserves to rewarded, so I'll bookmark it for later when I can afford a little type indulgence.\n\n"
    },
    {
      "time": "18 Mar 2014 — 11:04pm",
      "content": "@Charles Ellertson:  \n<cite>I don't have any experience with just which thin, anemic revivals look passable on a digital press.</cite>\n\nGood one!\n\nA lot of digital revivals are thin and anemic.\n\nI've felt that even modern hot metal Caslons are thin and anemic, because to me old documents printed in Caslon looked attractive when there was a significant ink spread. The first printed version of the Declaration of Independence is an example of what I think it takes to make Caslon look right as a face for normal body text.\n\nAside from ink spread, the next major reason for digital revivals being thin and anemic is because they're often designed after, say, the 48 point version of the typeface in question, if a good specimen is available - when, of course, typefaces historically have been made wider and bolder in the smaller point sizes, whether in the punchcutting era or the pantograph era, and in most cases typefaces are most often used in sizes around 11 points or so.\n\nHowever, just because a lot of digital revivals _have been_ thin and anemic does not in any way mean that a digital revival must necessarily be thin and anemic. If you know better, you can do better. So, while I'm sure there will be a lot more thin and anemic digital revivals in future, the existence of faces like Times Ten, Cycles, and even Adobe Caslon shows that occasionally this particular fault can and will be avoided (yes, Adobe Caslon fails in some other respects, related to authenticity - but it isn't thin and anemic).\n\n"
    },
    {
      "time": "18 Mar 2014 — 11:25pm",
      "content": "The original edition of Dracula was published in 1897, but not by W. R. Caldwell; rather, it was published by Archibald Constable & Company. I've seen one image purporting to be a page from that edition on a hotel's web site; it looked like a typeface I would have expected from that period - Phemister's Old Style.\n\n(In searches relating to this, I found that the American Drawing Book by John Gadsby Chapman probably was responsible for the plaint \"I can't even draw a straight line\" later employed in art school advertising as representing a misconception.)\n\nI've since confirmed, by finding an Ebay listing for the first edition, that it was what was pictured here -\n\n[http://www.bradfordmidlandhotel.com/famous-guests-bram-stoker](http://web.archive.org/web/20140803214645/http:/www.bradfordmidlandhotel.com/famous-guests-bram-stoker)\n\nthe picture, even after clicking on it for an enlarged version, is too small for me to be completely sure of the typeface, though it strongly seems to be Phemister.\n\n"
    },
    {
      "time": "19 Mar 2014 — 5:32am",
      "content": "> the existence of faces like Times Ten, Cycles, and even Adobe Caslon\n\nI find these thin and anemic. Cycles is a particularly interesting and tragic case. I believe Sumner had homage to Jack Stauffacher in mind with Cycles, maybe Staufffacher even participated a little in it's design. Before \"application files to the printer\" became the norm (no repro from the typesetter), Cycles worked pretty good. I used it a fair bit when I designed books, and even bought a license for a customer who (perpetually) claimed their font budget was empty.\n\nWhen the direct-to-plate process became the norm, it was just too light, period -- at least for bookwork printed offset, it's primary purpose. Worse, by that time, Sumner had created several sizes, so the work involved in beefing it up for the new platemaking technologies would have been enormous. Still, I would have done it, had (interior) designers been willing to specify it. But they wouldn't, most kept pursuing the silly quest for the magic typeface that would win them design awards.\n\n^ ^ ^\n\nI must be one of the few people who likes Times Roman. I don't like Times Ten, but the Linotype Times was pretty good in Photocomp. Look at the details of lower-case s for an example in the different thinking. Again, it was never adjusted for direct-to-plate printing, and again, there was no point in working on it, because no contemporary designer would specify it. Would have been wasted hours\n\nFinally, you should take a look at just how ink spread with various letterpress printing. Partly a trick question. Ink spread was (1) not linear, and (2) varied with the papers used. I've seen Linotype Granjon printed letterpress that looked as thin as most modern revivals; this printed from the original metal, not stereo plates or pulled repro, using a hard, calendered sheet.\n\nI've at least touched on all this -- with a few examples -- in a chapter in Rich Hendel's <cite>Aspects of Contemporary Book Design</cite>. But that's really aimed at the interested-but-uninformed reader, people like book editors. Probably not worth the price for most people who inhabit Typophile.\n\n"
    },
    {
      "time": "20 Mar 2014 — 2:58pm",
      "content": "> It looked like a typeface I would have expected from that period - Phemister's Old Style\n\nIs there any digital version of Phemister's type that you would recommend? Looking at the various Bookman faces available online, very few seem as mature as I would like for _Dracula_. That's my impression, anyway.\n\n[Bookmania](http://web.archive.org/web/20140803214645/http:/www.myfonts.com/fonts/marksimonson/bookmania/) might work I suppose, but does it err on the 1960's side of Bookman?\n\nI've revisited [Maiola](http://web.archive.org/web/20140803214645/http:/www.type-together.com/Maiola) several times, and it's definitely a typeface I am strongly considering. It's on the top edge of my budget (after student discount, roughly $100 for roman and italic), but I like it every time I look at it.\n\nFinally, [Minister](http://web.archive.org/web/20140803214645/http:/www.linotype.com/1237/minister-family.html) may not be my most mature suggestion, but it does have a dark and sinister quality that is kind of fun... Mock me if you must, but is it inappropriate for an extended text?\n\n"
    },
    {
      "time": "20 Mar 2014 — 4:04pm",
      "content": "I don't know of any version of Phemister Old Style currently available, not counting a distressed face based on it by the HPLHS. However, [Century Oldstyle](http://web.archive.org/web/20140803214645/http:/typophile.com/wiki/www.myfonts.com/fonts/bitstream/century-old-style/) is readily available, and is similar.\n\n"
    },
    {
      "time": "20 Mar 2014 — 3:45pm",
      "content": "The journal <cite>American Literature</cite> [http://en.wikipedia.org/wiki/American\\_Literature\\_%28journal%29](http://web.archive.org/web/20140803214645/http:/en.wikipedia.org/wiki/American_Literature_%28journal%29 \"http://en.wikipedia.org/wiki/American\\_Literature\\_%28journal%29\") was set in Century Oldstyle, at least, from 2000 to 2010. You could go to your library to see how it looked, printed.\n\n"
    },
    {
      "time": "20 Mar 2014 — 5:22pm",
      "content": "Maiola is a very good choice.\n\nFor display check out the work of this foundry:  \n [http://www.myfonts.com/foundry/Catharsis\\_Fonts/](http://web.archive.org/web/20140803214645/http:/www.myfonts.com/foundry/Catharsis_Fonts/ \"http://www.myfonts.com/foundry/Catharsis\\_Fonts/\")\n\nhhp\n\n"
    },
    {
      "time": "20 Mar 2014 — 7:39pm",
      "content": "Thank you all for your input!\n\nGiven enough funds, I'll set my book in Maiola. If I'm forced to go the cheaper route, I'm thinking New Caledonia; I like the somewhat-Scotch-Roman but modern-enough feel of it.\n\nCharles  \nI couldn't find that journal (small school...) but I did find similar faces in some other books. I'm growing to appreciate Phemister's type with my research, but I'm not feeling it for this book.\n\nHrant  \nI'm drawn to the Catharsis Foundry's display Octant. I'm usually not a sucker for display faces, but I could definitely see that used for cover and chapter headings.\n\n_Edit: misspelled Octant_\n\n"
    }
  ]
}
