{
  "id": "115008",
  "title": "Suggested Fonts to go with Georgia?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm about to publish a book. So far, the font I enjoy most for the primary content is \"Georgia.\"\n\nI need a free font that goes well with it, for the headlines/subheads. What do you recommend?\n\nAt the moment, I'm also using Calibri. For context: My book is primarily made of verses, and those are in Georgia. Anything that \\*I\\* wrote is in Calibri.  \nIf you want to suggest an alternative to this also, it is welcomed.\n\nThanks for your help!\n\n",
  "author": "icor1031",
  "time": "16 Mar 2014 — 3:40am",
  "uid": "209695",
  "comments": [
    {
      "time": "16 Mar 2014 — 5:25am",
      "content": "If I may suggest, you should search for Matthew Carter  \nwho conceived _Georgia_.  \nCarter designed many interesting serif and sans serif typefaces.  \n [http://www.myfonts.com/person/Matthew\\_Carter/](http://web.archive.org/web/20140723155901/http:/www.myfonts.com/person/Matthew_Carter/ \"http://www.myfonts.com/person/Matthew\\_Carter/\")\n\n"
    },
    {
      "time": "16 Mar 2014 — 10:20am",
      "content": "And Calibri isn't really recommended here, is it? Actually I'm not convinced Carter's sans typefaces are good choices for book typography either.\n\n"
    },
    {
      "time": "16 Mar 2014 — 12:26pm",
      "content": "Trebuchet and Corbel are not free, but you probably have them if you have Calibri. I once used Trebuchet and Georgia in manual and liked the results. One advantage of Corbel is that its default figures are old style and would therefore match the default old style figures in Georgia.\n\nA number of free sans serif fonts (listed below alphabetically) are readily available for you to download and consider:\n\nClear Sans from Intel  \nFira Sans from Firefox  \nLato from Google Web Fonts  \nNoto Sans from Google Web Fonts  \nOpen Sans from Google Web Fonts  \nSource Sans Pro from Adobe\n\nFira Sans and Source Sans include small caps, if that matters.\n\n"
    },
    {
      "time": "16 Mar 2014 — 2:47pm",
      "content": "For a long time, and in more recent years off and on, it was considered the height of interior design skill to use one typeface for both text and display.\n\nPlaying on that notion, I'd at least take a look at Charter, free in the versions released & distributed by one of the TeX groups. Charter will be quite similar to Georgia -- a familial resemblance -- but lighter in weight, so more in keeping with the larger sizes in heads. If in fact you want significantly larger sizes in heads. Space can be used for emphasis, often more effectively than type size.\n\n[http://www.ctan.org/tex-archive/fonts/charter/](http://web.archive.org/web/20140723155901/http:/www.ctan.org/tex-archive/fonts/charter/ \"http://www.ctan.org/tex-archive/fonts/charter/\")\n\nFor a sans, Lato might work, if you absolutely must have a free font. TheSans will work if you don't mind paying a bit. With sans, pay attention to the lower case g's and y's when pairing with serif text fonts.\n\n"
    },
    {
      "time": "16 Mar 2014 — 10:25pm",
      "content": "Why does it have to be free?\n\nhhp\n\n"
    },
    {
      "time": "18 Mar 2014 — 8:10am",
      "content": "<cite>With sans, pay attention to the lower case g's and y's when pairing with serif text fonts.</cite>\n\nWhat should one pay attention to? I've never heard of this rule. It's logical to me, but I also know that many sans typefaces simply don't have a double-storey /g, and I'm assuming that's what you would want to match it with the serif /g.\n\n"
    }
  ]
}
