{
  "id": "115141",
  "title": "Aufstand der Massen Thick Boxy Art Deco [?] Serif Book Cover",
  "forum": "Home",
  "tags": [
    "Display"
  ],
  "content": "José Ortega y Gasset - Der Aufstand der Massen [The Revolt of the Masses], originally published in 1930 as La rebelión de las masas. I don't know when this cover was designed, other than it seems to have beeen some time between the 1930s and the 1980s.  \nLooks sort of familiar but I can't place it.  \nAny suggestions? Thanks.\n\n ![](http://web.archive.org/web/20140701061009im_/http:/typophile.com/files/Aufstand_5800.jpg)\n  \nDon\n\n| Attachment | Size |\n| --- | --- |\n| [Aufstand.jpg](http://web.archive.org/web/20140701061009/http:/typophile.com/files/Aufstand.jpg) | 75.17 KB |\n\n",
  "author": "donshottype",
  "time": "20 Mar 2014 — 9:04pm",
  "uid": "205259",
  "comments": [
    {
      "time": "21 Mar 2014 — 1:35am",
      "content": "Comes out of the tradition of [Futura Black](http://web.archive.org/web/20140701061009/http:/www.identifont.com/show?44N) by Paul Renner (1929) or [Braggadocio](http://web.archive.org/web/20140701061009/http:/www.identifont.com/show?1MZ) by W.A. Woolley (1930). Don’t know the exakt one. (If there is …)\n\n"
    },
    {
      "time": "21 Mar 2014 — 6:06am",
      "content": "Many thanks Renko. These letters seem so distinctive, and given the lack of response from our ace font detectives, seem to not exist as a digital font. I am tempted to make a font based on this limited set of letters and any hints I can get. Your suggestion of Renner's Futura Black of 1929 and Woolley's Braggadocio of 1930 as possible inspirations for this design is very helpful. The G in Braggadocio is really close, but other letters have a very different treatment.  \nI wonder what else might exist?  \nDon\n\n"
    },
    {
      "time": "21 Mar 2014 — 6:44am",
      "content": "Futura Black is very close and like you Don I may make a set of caps from this inspiration. Cool Book design.\n\n"
    },
    {
      "time": "21 Mar 2014 — 7:56am",
      "content": "Hi Bob, indeed it is a cool book design. I suspect this might have been a creation made by manipulating Futura during the photolettering era. The basic letter proportions are close to Futura. The letters might not have made it into any of the specimen books. If I understand correctly, a lot of this stuff was churned out as custom work for individual buyers, like book companies.  \nDon\n\n"
    }
  ]
}
