{
  "id": "115186",
  "title": "Looking for study: Relevant parts of letters",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "There was a study a little while back that looked at which parts of (Latin) letters are most relevant for letter recognition. IIRC this was achieved by obscuring various parts of letters and then checking how much that harmed recognition. I can distinctly remember there were (greyscale, somewhat blurry) images of at least all the lowercase letters with their most relevant parts highlighted / least relevant parts barely visible. But that’s all I remember (I didn’t actually read it yet), and I can’t find it anymore.  \nDoes anyone know what I’m talking about, and can point me towards a source? Thanks!\n\n",
  "author": "nina",
  "time": "23 Mar 2014 — 6:35am",
  "uid": "13487",
  "comments": [
    {
      "time": "23 Mar 2014 — 7:04am",
      "content": "Wow, that does \\*not\\* ring a bell... :-/ Although it has some similarities to some efforts (such as Javal's).\n\nPotentially helpful for searching: Alfred Kallir has termed the most important part of a letter its \"acrocratic feature\".\n\nhhp\n\n"
    },
    {
      "time": "23 Mar 2014 — 7:13am",
      "content": "Yeah, no, it was newer than that. I wish my memory was a bit less visual and a bit more helpfully indexed… (and hope I didn’t dream this or something)\n\n"
    },
    {
      "time": "23 Mar 2014 — 7:21am",
      "content": "I think I found it!!  \nFiset et al, Features for Identification of Uppercase and Lowercase Letters, PsySci 2008. Arial only but maybe still interesting.  \nAbstract: [http://www.ncbi.nlm.nih.gov/pubmed/19076489](http://web.archive.org/web/20150415070221/http:/www.ncbi.nlm.nih.gov/pubmed/19076489 \"http://www.ncbi.nlm.nih.gov/pubmed/19076489\")  \nPDF link: [http://tdlc.ucsd.edu/publications/2008-2009/features\\_for\\_identification.pdf](http://web.archive.org/web/20150415070221/http:/tdlc.ucsd.edu/publications/2008-2009/features_for_identification.pdf \"http://tdlc.ucsd.edu/publications/2008-2009/features\\_for\\_identification.pdf\")\n\n"
    },
    {
      "time": "23 Mar 2014 — 7:35am",
      "content": "Ah, cool!\n\nhhp\n\n"
    },
    {
      "time": "25 Mar 2014 — 7:25am",
      "content": "Nina, there’s also Fiset et al, “The spatio-temporal dynamics of visual letter recognition,\" _Cognitive Neuropsychology_, Volume 26, Issue 1, 2009. Special Issue: Letter Recognition: From Perception to Representation.  \nAbstract: [http://www.ncbi.nlm.nih.gov/pubmed/18979274](http://web.archive.org/web/20150415070221/http:/www.ncbi.nlm.nih.gov/pubmed/18979274 \"http://www.ncbi.nlm.nih.gov/pubmed/18979274\")  \nPDF link: [http://mapageweb.umontreal.ca/gosselif/Fisetetal\\_CogNeuro.pdf](http://web.archive.org/web/20150415070221/http:/mapageweb.umontreal.ca/gosselif/Fisetetal_CogNeuro.pdf \"http://mapageweb.umontreal.ca/gosselif/Fisetetal\\_CogNeuro.pdf\")\n\nThe same basic team, but with Caroline Blais as the principal author did a related study on words:  \nBlais, et al, “Reading between eye saccades,” _PLoS One_. 2009 Jul 30; Volume 4, Issue Number 7.  \nAbsract: [http://www.ncbi.nlm.nih.gov/pubmed/19649292](http://web.archive.org/web/20150415070221/http:/www.ncbi.nlm.nih.gov/pubmed/19649292 \"http://www.ncbi.nlm.nih.gov/pubmed/19649292\")  \nPDF link: [http://viscog.psy.umontreal.ca/~fisetdaniel/blais\\_plosone\\_2009.pdf](http://web.archive.org/web/20150415070221/http:/viscog.psy.umontreal.ca/~fisetdaniel/blais_plosone_2009.pdf \"http://viscog.psy.umontreal.ca/~fisetdaniel/blais\\_plosone\\_2009.pdf\")\n\n"
    },
    {
      "time": "25 Mar 2014 — 8:33am",
      "content": "[Hrant] “_acrocratic_ feature”\n\nacro is from the Greek _ákro_(_s_), meaning “top-most,” or “highest.” So _acrocratic feature_ might be poached to mean: feature with the highest cue value.\n\nThere is now some new work underway related to the work on letters and words cited above — anchored by a recent addition to the Fiset / Gosselin team: Xavier Morin Duchesne — that found that individual letter biases could not account for word biases. See: [http://www.journalofvision.org/content/12/9/532.short](http://web.archive.org/web/20150415070221/http:/www.journalofvision.org/content/12/9/532.short \"http://www.journalofvision.org/content/12/9/532.short\") and [http://www.journalofvision.org/content/13/9/1297.short](http://web.archive.org/web/20150415070221/http:/www.journalofvision.org/content/13/9/1297.short \"http://www.journalofvision.org/content/13/9/1297.short\"). The abstracts don’t relate to published papers — they relate to posters presented at two successive Vision Sciences Society annual meetings.\n\n"
    },
    {
      "time": "25 Mar 2014 — 8:41am",
      "content": "Related: the rationale behind [Bifur](http://web.archive.org/web/20150415070221/http:/3.bp.blogspot.com/-Sq-FPr3CX60/TaWaxBFeK3I/AAAAAAAAAQA/PAcJC9jWGAI/s1600/Intro.jpg).\n\n"
    },
    {
      "time": "26 Mar 2014 — 4:46am",
      "content": "In his _Manuale Typografico_ (Manual of Typography) of 1818 Bodoni wrote on page XXV:  \n«Ove però buona ragion non appaja, e la moda non tiranna lasci arbitrio, il bon gusto si attiene a una semplecità non rozza, quale si mostrerebbe delineando con tratti per tutto egualemente grossi le lettere, ma ben avvisata e gentile, quale scorgesi nel bel contrasto per dir così di chiari e scuri; che vien naturale a ogni scrito di ben tagliata penna e ben tenuta in mano.»\n\nIn English this may translate into:  \n“Excellent simplicity, which should not be understood in such a way that the strokes of the characters should be of equal thickness, should decently and gracefully show the beautiful contrast of light and shade _(thin and thick)_, like a well-cut and well-handled pen lends it to the script.”\n\nA few lines further Bodoni continues in a similar manner:  \n“Printing, which was invented to replace handwriting, becomes perfect the more it resembles the most beautiful manuscripts.”\n\nIn the next paragraph (p. XXVII) he says:  \n“The beauty of a typeface is founded (…) on the ease of the strokes, on their freedom, decisiveness and fluency.”\n\nNote that in the foreword of his _Manuale_, Bodoni does not write a single sentence on circles and rectangles, let alone architecture. Seen in this context, I wonder if Didot really was the architect as suggested by Deberny et Peignot in their text on Bifur: “… the conception of Didot, who first had the hardihood so worthy of admiration, of deliberately renouncing the imitation of handwriting and of creating capital letters formed of heavy black and light strokes. He constructed in place of designing; the architect in him took the place of the calligrapher.\n\nReading this and comparing it to Bodoni’s words, I wonder what Didot himself has said about the characteristics of his typefaces. Anyone?\n\n"
    },
    {
      "time": "27 Mar 2014 — 4:23am",
      "content": "When reading the aforementioned research papers, I think that the researchers may have been preoccupied by the idea that we only look at the black shapes. When analyzing their results on identification of the lower case letters of Arial, I think one could argue that for the identification of a,c, e and i, maybe even of s and z, we are rather looking for the existence of white counters and check wether they have an aperture or not. In the case of s and z, we maybe look for the way the two counters are separated from each other. When we look at the parts where the other letters are being recognized, it is my observation that these parts are all thick strokes in conventional serif typeface design. No matter wether they are Old Style / Garalde or Modern / Didonic). Which would imply that when we are identifying single letters, we are in fact looking for the counters and the thick strokes of a conventional serif typeface (which Courier is not …). The only group for which this does not seem to apply is that of the characters with diagonals and also do not have an ascender or descender; namely v, w and x.  \n[Edit] Note that in the left column of the Arial lower case table, there is a slight focus on the upper end of the right diagonal stroke of k and v … The (position of) the upper end of that stroke seems to be a valuable indicator. When one blurs the image of a traditional serif typeface, the right diagonal stroke(s) of will look similar to the right half of the image of these letters in the left column …\n\nWhen trying to validate the outcome of this research for typeface design, I think we should consider that the investigation on Arial mainly tells us a lot about Arial. To be shure about what we do when reading Frutiger, one should research Frutiger with the same method. For what we do when reading Garamond, Swift or Bodoni, we should check these typefaces as well. Both for single letter recognition and for words and texts. When it comes to typeface design, this kind of research may become interesting when we know wether we look at different features per typeface or if we will always look for the ‘same’ features. I think we will also have to consider that some researchers suggest that ‘tuning in’ to a typeface is an essential part of an effective reading process. The ‘Arial research project’ does not tackle this effect (please correct when you think I am mistaken). As far as I remember, the research methods of Matthew Carter and Kevin Larson on Georgia and Sitka were quite different. I think it would be very interesting to see if their findings relate to the outcome of the research by Fiset, Gosselin etc.\n\n"
    },
    {
      "time": "9 Apr 2014 — 3:12pm",
      "content": "Thanks, Albert-Jan!\n\n<cite>“When reading the aforementioned research papers, I think that the researchers may have been preoccupied by the idea that we only look at the black shapes”</cite>  \nOh, great point. That would also explain, in part, the importance assigned to terminals; I guess in some case it’s not the terminal itself that matters, but the lack of black beyond it. :)\n\n"
    }
  ]
}
