{
  "id": "115169",
  "title": "Ayat Numbering in Quranic Fonts",
  "forum": "Arabic Typography & Type Design",
  "tags": [
    "Arabic Typography & Type Design",
    "Ayat Numbers"
  ],
  "content": "Which Numbering is better?\n\n| Attachment | Size |\n| --- | --- |\n| [YS-Aziz.pdf](http://web.archive.org/web/20150317145532/http:/typophile.com/files/YS-Aziz.pdf) | 100.56 KB |\n| [YS-Reyhan.pdf](http://web.archive.org/web/20150317145532/http:/typophile.com/files/YS-Reyhan_1.pdf) | 112.23 KB |\n\n",
  "author": "AzizMostafa",
  "time": "21 Mar 2014 — 9:53pm",
  "uid": "12550",
  "comments": [
    {
      "time": "21 Mar 2014 — 10:08pm",
      "content": "I prefer the Reyhan version because it looks more beautiful and also it's clearer where an ayeh is ended. In the Aziz version, the Ayat numbering is blended into the text and it's not obvious that we should stop at that point.\n\n"
    },
    {
      "time": "17 Apr 2014 — 1:50am",
      "content": "Thanks Bahman Eslami  \nHow about whitening (coloring or hiding) it, taken into account that it serves nothing but indexing?!\n\n"
    },
    {
      "time": "22 Mar 2014 — 12:20am",
      "content": "Hiding could work as an indication for a full stop, but it I thought you wanted a comment on design of the ayat numbers glyph? Without this numbering, the reader couldn't find the ayeh which he is looking for. I don't agree with coloring though.\n\n"
    },
    {
      "time": "22 Mar 2014 — 12:43am",
      "content": "\\> .... as an indication for a full stop\n\n@ ِِMight indicate a full stop or another punctuation mark?!\n\n\\> Without this numbering, the reader couldn't find the ayeh which he is looking for. I don't agree with coloring though.\n\n@ Will Gray (40% black) do?!\n\n"
    },
    {
      "time": "22 Mar 2014 — 2:12am",
      "content": "Glancing at this, it seems to me that the criticism of the Aziz is valid, but the Reyhan is a bit too small. Looking at images on the Web of copies of the Qur'an, it indeed appears that existing ones do tend to look like the Reyhan, but with significantly larger Ayat numbers than that example, although still smaller than the Aziz.\n\nI know I'm hardly qualified to comment on such a matter, but it seems like no benefit to the reader is gained by attempting to increase or decrease the size of Ayat numbers from current conventional practice to the extent shown.\n\nThis is a picture of a copy the Qur'an\n\n[http://www.islamichappiness.com/quran.png](http://web.archive.org/web/20150317145532/http:/www.islamichappiness.com/quran.png)\n\nsimilar to others I have found on the Web, so I presume the relative size of the Ayat numerals is conventional there.\n\n"
    },
    {
      "time": "23 Mar 2014 — 11:15pm",
      "content": "\\> ... so I presume the relative size of the Ayat numerals is conventional there.\n\n@ Number Size does not matter as long as it is searchable?!  \nIn which file, the numbers are searchable: YS-Aziz or YS-Reyhan?!\n\n"
    },
    {
      "time": "18 Apr 2014 — 6:23am",
      "content": "Is the searchable numbering getting better?!\n\n ![](http://web.archive.org/web/20150317145532im_/http:/typophile.com/files/YS-Aziz_4209.png)\n\n"
    },
    {
      "time": "3 May 2014 — 12:39am",
      "content": "nice writing  \n [Quran Academy Live](http://web.archive.org/web/20150317145532/http:/quranacademylive.com/)\n\n"
    },
    {
      "time": "3 May 2014 — 11:19pm",
      "content": "Thanks Ahmadkhan12 for the link with sprinkles of Rose Water.  \nDoes [http://quranacademylive.com/](http://web.archive.org/web/20150317145532/http:/quranacademylive.com/ \"http://quranacademylive.com/\") have a clear-cut answer to verse 7 of chapter 3 that ends with these lines:  \n[But no one knows its (Quran) interpretation except Allah and those firmly grounded in knowledge; they say, We believe in it; all of it is from our Lord. And none takes admonition except those who possess intellect]\n\nQ: Which reading is correct: A or B?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_A\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nBut no one knows its (Quran) interpretation except Allah [a must-stop].  \nAnd those firmly grounded in knowledge say, We believe in it; all of it is from our Lord.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_B\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nBut no one knows its (Quran) interpretation except Allah and those firmly grounded in knowledge;  \nAnd they (those firmly grounded in knowledge say) say, We believe in it; all of it is from our Lord.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nIf A is correct,  \n1. Why did Allah send down the Glorious Quran if no one save He Knows it?!  \n2. What do the rest of Muslims say? If as those firmly grounded in knowledge say, then  \n3. What distinguishes those firmly grounded in knowledge?\n\nIf B is correct, who are those firmly grounded in knowledge?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nExcuse me if out of topic.\n\n"
    }
  ]
}
