{
  "id": "115146",
  "title": "Boombox sticker font",
  "forum": "Home",
  "tags": [
    "Unknown"
  ],
  "content": "Hi! Please help to find font from vintage boombox sticker :)\n\nFont:&nbsp;\n\n Decorated 035 \n\nSolved By:&nbsp;\n\n [osamu](http://web.archive.org/web/20150422054904/http:/typophile.com/user/215937 \"View user profile.\")\n\n| Attachment | Size |\n| --- | --- |\n| [made in japan.jpg](http://web.archive.org/web/20150422054904/http:/typophile.com/files/made%20in%20japan.jpg) | 13.71 KB |\n\n",
  "author": "VGmax",
  "time": "21 Mar 2014 — 3:32am",
  "uid": "218553",
  "comments": [
    {
      "time": "21 Mar 2014 — 3:56am",
      "content": "I tryed to draw it in photoshop and i got this, but i need to get font, i can't draw each word)\n\n ![](http://web.archive.org/web/20150422054904im_/http:/typophile.com/files/made%20in%20japan_4029.jpg)\n\n"
    },
    {
      "time": "21 Mar 2014 — 5:13am",
      "content": "Looks very similar to Bistream's [Decorated 035](http://web.archive.org/web/20150422054904/http:/www.myfonts.com/fonts/bitstream/decorated-035/)\n\n"
    },
    {
      "time": "21 Mar 2014 — 8:06am",
      "content": "Agree, thx a lot)\n\n"
    },
    {
      "time": "21 Mar 2014 — 10:29am",
      "content": "Pretty close, but there are some differences. The image has slab/angled serifs,  \nDecorated 035 has Clarendon style cove serifs and the bottom of the J is more rounded.  \nThe problem is that we are examining to an image you drew rather than an original image. Close examination of the original is required to determine the shape of the serifs. If they are in fact Clarendon style, then Decorated 035 is a good candidate for a match.  \nBTW Bistream's Decorated 035 is actually a font designed by Eugen Lenz and Max Lenz in 1946 and sold by Haas as Profil.  \nDon\n\n"
    },
    {
      "time": "21 Mar 2014 — 12:17pm",
      "content": "Hi Don. Thanks - I knew Decorated 035 was not the original name, but I did not have my reference books in front of me to check, and couldn't remember it off the top of my head. I've since spotted it in my Jaspert.\n\n"
    },
    {
      "time": "21 Mar 2014 — 12:45pm",
      "content": "Decorated 035 it is that i needed, but i edit (at photoshop of course) it and it become super :)\n\n"
    },
    {
      "time": "21 Mar 2014 — 4:37pm",
      "content": "Hi Andrew, yes Jaspert is gold for font detectives. Some errors, but nothing else comes close for digging into metal type IDs. To bad it does not have a good category index. Have to go though it page by page to find the Ah-Ha moment. As for this font, I can't understand why Lenz & Lenz released Profil only as a sloped font. Why not a regular vertical version too? Go figure, mind-reading the past is a mugs game...  \nDon\n\n"
    },
    {
      "time": "23 Mar 2014 — 1:52am",
      "content": "Getting inside the mind of the designers of the past is a necessary (if somewhat subjective) part of type revival, and an interesting exercise in itself for someone like me for whom type has not been a vocation. I agree on the various faults of the Jaspert volume, but it does beat sifting through endless, musty old type specimen books from the world's many former metal type foundries - though some of these are now available as free pdf downloads. I also have the Rookledge, covering the most popular faces of the phototypesetting age. But this has even more egregious faults than the Jaspert, providing no background information on a typeface's origins - designer, date or foundry - even though there is a better categorization.\n\n"
    }
  ]
}
