{
  "id": "115260",
  "title": "How do you organise your fonts/typefaces?",
  "forum": "General Discussions",
  "tags": [
    "fonts",
    "General Discussions",
    "organise"
  ],
  "content": "How do you organise your fonts?\n\nBy class?\n\nBy use?\n\nBy client/job?\n\nI'd be interested to know how others do it.\n\nI'm at a point where I need to find a better organising system than just 'sans-serif'.\n\n",
  "author": "rnicaeel",
  "time": "26 Mar 2014 — 8:01am",
  "uid": "218703",
  "comments": [
    {
      "time": "26 Mar 2014 — 8:40am",
      "content": "I worked with _Suitcase Fusion 5_. I created four separate libraries.\n\nAs an example, find my **Library #1** :\n\nI first applied the Vox-AtypI system coupled with a shade of the Sanders/McCormick system, Erik Spiekermann's FontShop system and alternate contemporary systems.  \nI also subdivided the Vox-AtypI system with individual historical designers, art movements and geometric (weight, width and else) and stylistic properties.\n\n"
    },
    {
      "time": "26 Mar 2014 — 12:32pm",
      "content": "I use Suitcase also, since version 2. For many years I have organized my fonts alphabetically, in folders to be loaded Temporarily as needed. For basic fonts, which are the 35 which come with most Postscript printers along with fonts I use on an everyday basis such as Helveticas, Garamonds, Centuries, Futuras, Pi fonts, etc., I have in a set called, of all things, \"Basics\". If I have a large project which uses many fonts not a part of the Basics set on a recurring basis I will set up a special set for those fonts. If the project ever returns for revisions then I will have the fonts all set up and ready to go; just reactivate them.\n\nSuitcase makes life in the type-users world so much more efficient. I could not get by without it.\n\n"
    },
    {
      "time": "26 Mar 2014 — 1:49pm",
      "content": "I use Suitcase too. I keep it organized into main folders of font type, then foundry. At one time, I did have a main folder for MultiMaster fonts. I suspect one day, I'll be pitching the entire ps collection too like the MM collection, when/if it no longer works in the mac OS.\n\n"
    },
    {
      "time": "26 Mar 2014 — 10:01pm",
      "content": "\\> By client/job?\n\nThat method can be handy for clients that require you use a specific set of fonts (for example a corporation that has a font list you must stick to). Especially if you have multiple versions of some fonts and must use a specific one on jobs for them.\n\n"
    }
  ]
}
