{
  "id": "115379",
  "title": "Dyslexia and Text Perception",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "In your experience, how does [Dyslexia](http://web.archive.org/web/20150110153707/http:/en.wikipedia.org/wiki/Dyslexia) impact the perception of a body of text, e.g. with regard to type, size, weight, spacing, and so forth?\n\nLooking around, for example [here](http://web.archive.org/web/20150110153707/http:/www.dyslexia.com/library/information.htm) or [here](http://web.archive.org/web/20150110153707/http:/www.adhd.com.au/Visual_Processing_Disorders.htm), it seems that it may be difficult for a dyslexic to separate weights of a typeface, or comfortably read certain types? For example, certain [fonts](http://web.archive.org/web/20150110153707/http:/www.dyslexic.com/fonts) seem to be easier to perceive (e.g. Comic Sans, apparently) than others.\n\n",
  "author": "_savage",
  "time": "30 Mar 2014 — 5:13pm",
  "uid": "217867",
  "comments": [
    {
      "time": "30 Mar 2014 — 7:49pm",
      "content": "In my experience there should be no impact, as Dyslexia is a phonological disorder and not a visual disorder. But Dyslexics have enough problems, so for them (more than the general population) they shouldn't have to put up with crazy fonts, colors and layouts, especially well intentioned quirky choices that \"seem\" as if they might be helpful.\n\n"
    },
    {
      "time": "17 Nov 2014 — 10:39am",
      "content": "This one is interesting:\n\n[http://www.dezeen.com/2014/11/09/christian-boer-dyslexie-typeface-dyslex...](http://web.archive.org/web/20150110153707/http:/www.dezeen.com/2014/11/09/christian-boer-dyslexie-typeface-dyslexia-easier-reading-istanbul-design-biennial-2014/ \"http://www.dezeen.com/2014/11/09/christian-boer-dyslexie-typeface-dyslexia-easier-reading-istanbul-design-biennial-2014/\")\n\n"
    },
    {
      "time": "17 Nov 2014 — 12:22pm",
      "content": "“Dyslexic” typefaces debunked:  \n [http://bigelowandholmes.typepad.com](http://web.archive.org/web/20150110153707/http:/bigelowandholmes.typepad.com/ \"http://bigelowandholmes.typepad.com\")\n\n"
    },
    {
      "time": "19 Nov 2014 — 6:20pm",
      "content": "There are claims made by Boer for Dyslexie for which one could have an interesting debate: merely massively misleading, or outright lies? Specifically his claims about the research results, where any differences found in favor of Dyslexie were minuscule, and not statistically significant. (That is, within the range one would expect to potentially be produced randomly.)\n\n"
    },
    {
      "time": "22 Nov 2014 — 12:07pm",
      "content": "It's quite interesting how long it took for the merit of Dyslexia to be dismissed, though it did spark a lot of discussion and indirectly more research.\n\n"
    },
    {
      "time": "23 Nov 2014 — 11:09am",
      "content": "IIRC, reading-difﬁculty fonts have often been criticized at Typophile.\n\nType design is a hand craft in which skill acquired through practice and experience is quite important.  \nMost of the fonts speciﬁcally designed to help those with reading difﬁculties have been made by novices.\n\nBoer is dyslexic. The Dyslexie typeface works for him, but he _is_ intimately acquainted with it.  \nPerhaps everybody should design their own typeface, or at least make the effort to try out a variety of other’s and see which works best for them.\n\nIt might not be immediately apparent.  \nFor instance, if one switches to a new racquet or guitar, it takes a while to get up to speed.\n\n"
    },
    {
      "time": "23 Nov 2014 — 3:24pm",
      "content": "> Boer is dyslexic. The Dyslexie typeface works for him, but he is intimately acquainted with it.\n\nThat's why I trusted it works for dyslexic people, but the tests don't seem to agree. What tests has Boer done? Do you reckon it only works for him because he's intimately acquainted with it? Or could it imply that perhaps this typeface is suitable for a yet undefined subcategory of dyslexia or a different disorder altogether?\n\nThis sounds silly but I just reasoned the other way about Dyslexie's performance — assuming for a moment it works for ALL dyslexic people — in which case you could ask the question if Dyslexie performs much better for people with dyslexia where other typefaces don't perform as well and you experience problems with reading but haven't been diagnosed as dyslexic, could you not diagnose yourself simply by reading text in Dyslexie and see if your reading performance goes up?\n\n"
    },
    {
      "time": "24 Nov 2014 — 12:35am",
      "content": "_Do you reckon it only works for him because he's intimately acquainted with it?_\n\nI wouldn’t say “only,” but I generally have no problem reading any of my own typefaces, even those that are quite bizarre and marginally legible.\n\n"
    },
    {
      "time": "24 Nov 2014 — 12:07pm",
      "content": "I think it's extremely unlikely that Dyslexie would work for _all_ dyslexic people, especially since we have had dyslexic people commenting here that dyslexia has nothing to do with visual perception.\n\nBut if it works for a few of them, it would still be useful - as I've noted, the better one's literacy skills are, the more one can benefit from word bouma and so on, and that's why a \"training wheels\" typeface can be valuable even when eventually put aside.\n\n"
    },
    {
      "time": "7 Dec 2014 — 4:04pm",
      "content": "> I think it's extremely unlikely that Dyslexie would work for all dyslexic people, especially since we have had dyslexic people commenting here that dyslexia has nothing to do with visual perception.\n\nNot the perception, but the processing, right? I suppose Dyslexie could be an exaggeration of aspects which help process visual cues for the designer of the typeface at least.\n\nAnyway, the reason why I came back to this thread is because today in the train I had a random thought on dyslexia and I didn't see it as justified to start a new thread for this, particularly because I'm assuming we're all getting a bit tired of discussing dyslexia. We've said so much about it without achieving much progress other than the insight of how current accommodations of type for dyslexic people seem to be lacking in terms of practicality and solving the problem.\n\nDuring the train ride I watched the 'Type in a Digital Landscape' lecture by Bruno Maag ( [https://www.youtube.com/watch?v=BMr4aBdag3Q](http://web.archive.org/web/20150110153707/https:/www.youtube.com/watch?v=BMr4aBdag3Q \"https://www.youtube.com/watch?v=BMr4aBdag3Q\")) and near the end he shows an illustration of the brain with different areas defined, and I noticed while the area for processing words is on the side near the back, behind it is the visual processing area, and in front of and above the word processing area is the area that gives access to meaning. Looking at this image, I started speculating about which area would perform abnormally/differently in people with dyslexia. I'm assuming it's in this \"Visual word form area\" in front of the visual inputs area.\n\nIf that's indeed the area which performs in a deviating way, I wonder what effect language and scripts have on a person with dyslexia. Whether there is something going on with visual perception, word processing or attributing meaning, in all cases I would be curious if and to what extent certain languages and scripts have a different effect on the brain, and specifically a dyslexic brain. If there is a visual perception problem, would this person perform better with Arabic than with Dutch for example? If it's the word processing area to blame in regard to people with dyslexia, does the script have an influence? If not, then I doubt a specific typeface can make a dramatic difference beyond the attributes that work best for the average person.\n\nIt also occurred to me I've never read about any scientific tests on dyslexia internationally. Is dyslexia more common in certain areas? Assuming they're distributed evenly and the occurrence of dyslexia is by chance, do people with dyslexia perform better in certain countries and if so, does it have to do with the culture, education or the language they speak and the writing they utilize?\n\n"
    },
    {
      "time": "7 Dec 2014 — 8:26pm",
      "content": "I’m under the impression that there is less dyslexia in Italy, because Italian spelling is comparatively simple.\n\n"
    },
    {
      "time": "8 Dec 2014 — 3:35am",
      "content": "I don’t know if it’s just because dyslexia is “en vogue” lately or if there are systemic changes in how children learn to speak and read, but it seems that speech therapists are increasingly in demand in Italy.  \nWhat I gather from the various threads on the subject on Typophile and elsewhere is that we really need better terms to define the issue, because “dyslexia” is a too wide umbrella to be used for what can be addressed from a type design point of view.  \nAlso, I won’t call Italian spelling “simpler”, I would call it “more consistent” than English (we don’t need spelling bees), and I don’t know if that could have an effect on (some form of) dyslexia. German probably has an even more consistent spelling than Italian, so there should be even less dyslexics in German-speaking countries? How about French, and all those accents?  \nStill, I’m not sure how a spelling-related dyslexia could be addressed by type design.  \nAnyway, I would note that in Italy we also have our “heavily researched” dyslexia typeface, which is just about a blatant rip-off of Officina ( [http://twitter.com/typographica/status/483926989125218304](http://web.archive.org/web/20150110153707/http:/twitter.com/typographica/status/483926989125218304 \"http://twitter.com/typographica/status/483926989125218304\")).\n\n"
    },
    {
      "time": "11 Dec 2014 — 9:50am",
      "content": "\"I'm assuming it's in this \"Visual word form area\" in front of the visual inputs area.\"\n\nThat's not supported by the research, which suggests dyslexia is primarily about the sounds of words/letters, not their shapes. Which is probably why there haven't been any easy fixes via type design for dyslexia.\n\nIt is also the case that the \"dyslexia\" label is used for any dysfunction in this same general area of reading, and this label may be used for multiple independent and unrelated (or at least distinct) problems. But again, the available research suggests that at least the most common form is related to phonology, not shapes.\n\n"
    },
    {
      "time": "11 Dec 2014 — 1:39pm",
      "content": "I have a peculiar form of dyslexia called dyscalculia. It involves numeral-number relationships instead of letters and words. I have great difficulty remembering numerical sequences or being able to tell what order the numerals are in. I have no problem with words or passwords that involve numerals interspersed with letters and symbols — it's just that numerical sequences don't fully register as corresponding to the numbers they represent.\n\nFor example, telephone numbers aren't really numbers; they're sequences of random numerals, masquerading as numbers. Street numbers, on the other hand, are real numbers, so I have less trouble with them, but even then, I have difficulty associating, say, 8541 with the actual abstract number that those numerals represent.\n\nThis has nothing to do with the shape of the numerals. I suspect much the same is true with letters and words in standard dyslexia.\n\n"
    },
    {
      "time": "12 Dec 2014 — 5:37am",
      "content": "> That's not supported by the research, which suggests dyslexia is primarily about the sounds of words/letters, not their shapes.\n\nI might be mistaken about what I said, but I think you misunderstood what I wrote. Perhaps I shouldn't have included the word \"visual\", though I believe that was the term used in the video. In any case, the area I'm alluding to is distinct from the area that controls perception. As I can reason, something goes wrong in between the perception area and the area that controls meaning of the words. It's in one of the three areas and indeed research suggests it has nothing to do with perception, and as far as I know nothing goes wrong in the meaning area either.\n\n"
    }
  ]
}
