{
  "id": "115392",
  "title": "How to be sure the font you're using is free and avoid legal trouble",
  "forum": "Release",
  "tags": [
    "font licensing",
    "Release"
  ],
  "content": "Hi everyone!\n\nI'm new here and I'm worried about font licensing.\n\nI'm using Chaparral Pro Bold in a logo design for commercial purposes and I want to make sure that it's free to use, or that the company pays for it if it's not free. I'm pretty sure this font came installed on my mac, but a google search brought me to realize that Adobe is charging money for it. [http://store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=...](http://web.archive.org/web/20150415001458/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1717 \"http://store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1717\")\n\nWhat is the best way to be 100% certain that a font you're using is free?\n\nI'm also wondering, say the company chooses not to pay for it ... who is liable for it's usage, the freelance designer or the company that uses it for commercial purposes?\n\nThanks in advance,\n\nmegs\n\n",
  "author": "meaganyvette0",
  "time": "31 Mar 2014 — 8:21am",
  "uid": "218037",
  "comments": [
    {
      "time": "31 Mar 2014 — 9:13am",
      "content": "Chaparral comes bundled with Adobe Creative Suites. For more details see:\n\n[http://blogs.adobe.com/typblography/fonts-installed-by-adobes-creative-s...](http://web.archive.org/web/20150415001458/http:/blogs.adobe.com/typblography/fonts-installed-by-adobes-creative-suite \"http://blogs.adobe.com/typblography/fonts-installed-by-adobes-creative-suite\")\n\n"
    },
    {
      "time": "31 Mar 2014 — 9:54am",
      "content": "There's free, and then there's free. Oh, and there's free, too. So, which kind of free? I'm guessing free from legal hassles when used in logo design.\n\nMy understanding, thoroughly inexpert as it is, is that you can use Chaparral to design logos for others as long as 1) they do not need the font to use the logo or 2) they have their own licence.\n\n"
    },
    {
      "time": "31 Mar 2014 — 10:31am",
      "content": "Thanks guys.\n\nI understand that Chaparral Pro is bundled by Adobe and available via my creative cloud subscription, but does that mean I can use any of those fonts free of charge?  \nAnd yes, by \"free\" I mean for commercial use (in a logo, for example).\n\nIn the grander scheme, I'm wondering if there is some standard way to find out if a font is legally free to use for commercial purposes. I would check the licensing info of the particular foundry, but I can't seem to find anything about Adobe font licensing. In that case should I assume it's not free to use in a commercial logo because Adobe is selling it? Or would you recommend contacting Adobe?\n\nmegs\n\n"
    },
    {
      "time": "31 Mar 2014 — 10:52am",
      "content": "It is my understanding that the only way to know what you may do with a font is to find the end user agreement that came with it when it was licensed and read it carefully.\n\nConcerning Adobe originals, here is a link that may be useful: [http://forums.adobe.com/message/2818917](http://web.archive.org/web/20150415001458/http:/forums.adobe.com/message/2818917 \"http://forums.adobe.com/message/2818917\")\n\n"
    },
    {
      "time": "1 Apr 2014 — 6:39am",
      "content": "Thank you, Michael. That was very helpful.\n\n"
    },
    {
      "time": "1 Apr 2014 — 5:37pm",
      "content": "Great. You are welcome.\n\n"
    }
  ]
}
