{
  "id": "115363",
  "title": "Opinion about consistency",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hello Typophiles :)\n\nI have a question for the more experienced type designers.\n\n",
  "author": "eyedreamer",
  "time": "30 Mar 2014 — 4:51am",
  "uid": "22478",
  "comments": [
    {
      "time": "30 Mar 2014 — 5:04am",
      "content": "This is a logo that I'm working on which needs to have that college feel to it. So my questions are:  \na) The tilted A - Is there any way to know how to define the letter width in case like this? Do I need to align the top part of the counter with the counters of the other letters (such as in the top example)?  \nb) Does this type of M fit within this college style?  \nc) When I was analyzing the font United by Houseind. I noticed that the some letters whose edges aren't chopped off (M, N for example), have narrower stem than the other ones (A, O). Does this balance right in this situation?\n\n ![](http://web.archive.org/web/20150317134518im_/http:/typophile.com/files/HamonWac_6715.png)\n\nThank you in advance for your thoughtful comments.\n\n"
    },
    {
      "time": "30 Mar 2014 — 7:34am",
      "content": "First thing I'd say is: this logo seems to want the \"W\" to be a flipped \"M\".\n\nhhp\n\n"
    },
    {
      "time": "30 Mar 2014 — 9:16am",
      "content": "@Petar  \na) Yes to aligning the counters, except on the second /A it could be just a little higher than the other for optical compensation so it doesn't look too dark.  \nb) That /M is not the traditional college look, IMHO. If it were my work, I would drop the diagonal strokes at the bottom down by about a third of the bottom white space, then chop off the bottom point to match the internal chopping in the counter of the /O. In addition, the diagonal strokes of the /M are a little too heavy, should match other diagonals. If they measure exactly what the verticals do, make them a little lighter.  \nc) There are some discrepancies, and no discrepancy is ever good. The verticals on the first /A, the /O and /C are too thick and should match the /H.\n\nThe /C counter needs to be chopped off to match the /O in all respects.\n\nThere are two bad things about the existing /W: it's out of character with the other glyphs and it is way too wide. Hrant said it best: a flipped /M would be far preferable, perhaps with a little modification so it isn't exactly a flipped /M. A good approach would be to reduce the width of the existing /W by about a third then rework the diagonal strokes; make them more like the /M only a little taller.\n\nPlease post your results when you're done. It's an interesting problem. Remember, consistency is king.\n\n"
    },
    {
      "time": "31 Mar 2014 — 3:59am",
      "content": "Thank you for the comment George and Hrant.\n\n@George, I really appreciate your in-depth analysis and remarks. It's very hard to notice these things and find solutions if you don't have someone more experienced to point them out. So your comment is a great lesson.  \nThe attached image show (top-to-bottom): the first version, update with reduced W and update with bigger reduction of the /W\n\na) One chopping was enough to make the /M in line with the other letters. Great remark! When i pushd the bottom point downwards the width of the fiagonal stroke decreased so now it's a little bit less than the vertical stroke.\n\nc) I fixed the verticals and also unified the widths of the letters in order to make the letters square format\n\nd) I made 2 versions of the /W based on your comments. The second version has a smaller width reduction and the thrid one has bigger width reduction. To my eye, the 2nd version looks better, maybe because the open counters have similar size as the open counters on the letter /N. I also tried adding a standard sans /W and it fits OK, but it looses the accent on the /W.\n\nThank you once again for your time!  \n ![](http://web.archive.org/web/20150317134518im_/http:/i.imgur.com/Qx3CdGe.jpg)\n\n"
    },
    {
      "time": "31 Mar 2014 — 3:14pm",
      "content": "@Petar: OK, if you like the second version best, let's deal with that.  \n1. Some vertical strokes are still too heavy: /A, /O, /C.  \n2. Horizontal stroke on the first /A should be more like the /H, a tiny (TINY!) bit lighter.  \n3. The second /A is in need of a makeover. Both verticals are too light, relatively; the horizontal is too heavy, and the top horizontal should match the top horizontal of the /C. Minimize the little chop inside the top of the /A, perhaps half the size it is now, after you adjust the weight. Alternately, just do away with the chop altogether; it will probably look a lot better. Either way will help to overall make the character more narrow, which it needs to be.  \n4. The /W looks better but the one in example three is better, width-wise. The vertical strokes are all a bit too light though, and that middle stroke overhanging is just so out-of-place with the overall look of the logo.  \n5. The vertical strokes of the /M and /N are too light. They should be like the /H.\n\n"
    },
    {
      "time": "1 Apr 2014 — 1:08pm",
      "content": "Here's an updated version with a standard /W . I am having hard times estimating the thickness of the diagonal strokes. Is there any tip how to analyze? Currently I'm just making it smaller than the vertical stroke width, but I'm not sure if I'm doing it right.\n\nAlso if you would recommend some literature where these things are discussed into details, it would be of great benefit!\n\n ![](http://web.archive.org/web/20150317134518im_/http:/typophile.com/files/HamonWac2_3800.png)\n\nThank you\n\n"
    },
    {
      "time": "2 Apr 2014 — 7:17am",
      "content": "@Petar  \nThe last sample is the best, but still needs a bit of tweaking.\n\nUse the /W from the third sample; the one in the fourth sample is too wide.\n\nThe crossbar in the first /A is a little light now; heavy it up a very small amount (close to the /H crossbar weight) and lower it a little.\n\nI would make the first /A, the /O and the /C about 15% more narrow; they really don't work as squares.\n\nThe second /A vertical stroke is optically too heavy due to the smaller counter now. Remove a very small amount of weight from the outside of the vertical stroke, OR better, move the entire stroke to the right very slightly and the chop back in but only about a third of what it was before. Position the chop so it aligns with the horizontal stroke of the /C next to it. The bottom of the left diagonal stroke below the crossbar also needs to be heaver; optically it looks too light. Make it the same weight as the vertical stroke.\n\nAs for diagonal weights, it's in the eye of the beholder what works best in any given situation; experience is the best teacher. If they are the same weight as the verticals, they look heavier. The same is true of horizontals, especially connected between verticals. When type or a logo is quite large it isn't as noticeable as when it is small. Looking at art through a reducing glass or viewing it at different sizes on screen is quite effective at finding problems such as these. Using a reducing glass is a very good way because it's like looking at it from several feet away.\n\nAs for literature, any good art instruction book would likely address the issue although I doubt there is a book completely devoted to the subject.\n\n"
    }
  ]
}
