{
  "id": "115380",
  "title": "Dyslexia Myth / Meaningless label",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[http://topdocumentaryfilms.com/dyslexia-myth/](http://web.archive.org/web/20150414121756/http:/topdocumentaryfilms.com/dyslexia-myth/ \"http://topdocumentaryfilms.com/dyslexia-myth/\")\n\n[http://www.forbes.com/sites/nickmorrison/2014/02/27/dyslexia-is-a-meanin...](http://web.archive.org/web/20150414121756/http:/www.forbes.com/sites/nickmorrison/2014/02/27/dyslexia-is-a-meaningless-label-and-should-be-ditched/ \"http://www.forbes.com/sites/nickmorrison/2014/02/27/dyslexia-is-a-meaningless-label-and-should-be-ditched/\")\n\n",
  "author": "russellm",
  "time": "30 Mar 2014 — 7:03pm",
  "uid": "13076",
  "comments": [
    {
      "time": "18 Jul 2014 — 1:49am",
      "content": "Wow, this is very interesting. I had no idea. It reminds me of autism, where a person may excel at one thing at the expense of social interaction and such. I feel this is often the case, where the brain seems to be particularly good at one thing but is problematic in other areas and this often seems to have a correlation with high intelligence.\n\n"
    },
    {
      "time": "18 Jul 2014 — 7:05am",
      "content": "Given the discussion of fonts intended to help the dyslexic, it's apparent that a lot of different learning disabilities related to reading are lumped together under the term 'dyslexia'. Hence, it isn't as if it was a condition subject to the constraint of specific etiology, so that one solution could fit everyone affected - unlike, say, an infections disease caused by _this_ microbe, so just use penicillin!\n\nIf p and q, and b and d, weren't mirror reflections, _one subgroup_ of dyslexics might benefit, and I think that this is of value, and shouldn't be dismissed simply because there are other conditions also labeled as dyslexia to which that would be irrelevant.\n\nRacists generally tended to claim that the groups they targeted were of inferior intelligence. Not concerning ourselves with how unfashionable racism has become, we can still note that this has in fact been thoroughly refuted. If there were an inferior race of that type, surely the Australian Aborigine would be an example, having one of the smallest average brain sizes, and not having the short stature of the Bushmen who are also in that spot on the list. But people who have studied the Aborigines have remarked on their amazing knowledge and memory for the plants, animals, and geography of their environment.\n\nSo Nature has apparently selected all humans for truly human intelligence, this being so valuable to our survival. But only a few races have had any need for book learning over the last few thousand years... and so I think it's a good thing that schools are now aware of, and trying to address learning disabilities, since they may well be a factor that frustrates our expectations for education as a way to resolve inequality. (Of course, a sluggish economy is a rather bigger factor interfering with that.)\n\n"
    },
    {
      "time": "18 Jul 2014 — 7:51am",
      "content": "The many dyslexic people who get state and federal benefits by \"passing\" a dyslexia test might disagree...\n\nhhp\n\n"
    },
    {
      "time": "18 Jul 2014 — 12:40pm",
      "content": "“If p and q, and b and d, weren't mirror reflections, one subgroup of dyslexics might benefit, and I think that this is of value.”\n\nCan you provide any research-based, non-anecdotal evidence for the belief that there is a mirror reflection problem experienced by _any_ significant subgroup of people labeled dyslexic?\n\nI will note that if the benefit for the subgroup is significant, and the subgroup is not a minuscule proportion of all dyslexics, then one might reasonably expect to see a positive effect of the anti-mirroring even when testing on the larger group.\n\n"
    },
    {
      "time": "18 Jul 2014 — 1:23pm",
      "content": "@Thomas Phinney:  \n<cite>Can you provide any research-based, non-anecdotal evidence for the belief that there is a mirror reflection problem experienced by any significant subgroup of people labeled dyslexic?</cite>\n\nI hadn't imagined _this_ was even an issue. It's well known that young children learning to read sometimes get mirror-reflected letters mixed up in their early efforts at printing. And when public awareness of the condition called dyslexia was initially being created by magazine articles about the condition, problems with letter reflection were used as the example presented - perhaps because they were easy for the general public to understand.\n\nAnd I do recall the anecdote, written by someone with a dyslexia problem, of a teacher telling him to write the word \"brain\" on the blackboard, and when he reflected the first letter, mocking him by telling him \"you don't have a brain, but a drain\".\n\nBut looking for serious research, I find\n\n[http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2117809/](http://web.archive.org/web/20150414121756/http:/www.ncbi.nlm.nih.gov/pmc/articles/PMC2117809/)\n\nThe Wikipedia article continues to reinforce the stereotype...\n\n[https://en.wikipedia.org/wiki/Dyslexia](http://web.archive.org/web/20150414121756/http:/typophile.com/wiki/https%3A/%252Fen.wikipedia.org/wiki/Dyslexia)\n\nAnd this policy statement by the American Academy of Pediatrics,\n\n[http://pediatrics.aappublications.org/content/124/2/837.full](http://web.archive.org/web/20150414121756/http:/pediatrics.aappublications.org/content/124/2/837.full)\n\nwhich notes that special eyeglasses with tinted filters and so on are inappropriate for dyslexia, as it has been found to be a language-based disorder, due to research showing its frequency among people with different language systems depends on their complexity, contains the statement\n\n\"Importantly, the definition of dyslexia does not include reversal of letters or words or mirror reading or writing, which are commonly held misconceptions.\"\n\nNow this also seems to imply that _spelling reform_ would be the single best thing we could do about dyslexia.\n\nHowever, I also came across\n\n[http://journal.frontiersin.org/Journal/10.3389/fpsyg.2014.00703/full](http://web.archive.org/web/20150414121756/http:/journal.frontiersin.org/Journal/10.3389/fpsyg.2014.00703/full)\n\nwhich implicitly suggests that there is indeed something about language learning which helps people deal with mirror reflections as distinct, and which could therefore break down for whatever reason. (That, though, would still be consistent with getting reflected letters wrong being purely a symptom, and no part of the _cause_ or mechanism of dyslexia.)\n\n"
    },
    {
      "time": "18 Jul 2014 — 3:32pm",
      "content": "> Racists generally tended to claim that the groups they targeted were of inferior intelligence.\n\nI think there's often a misconception about intelligence where it's being confused with IQ. Your IQ will depend on your environment for a large part and so certain tribes particularly have a very low IQ. Intelligence however probably won't differ much per region. An Australian Aborigine would probably function like any Westerner if he was brought up here, with no noticeable difference in intelligence, statistically. There is a big distinction between the capacity of the brain and what it has been trained to do. Your capacity is the absolute limit while your IQ reflects what you've done with that capacity. I suspect Australian Aborigines will excel at general knowledge about plants and memorizing all the facts which will keep them alive and perpetuate their seeds to the next generation but don't ask them to do algebra. This gives the impression of low intelligence but it doesn't imply that their mental capacity is reduced.\n\n> The many dyslexic people who get state and federal benefits by \"passing\" a dyslexia test might disagree...\n\nDisagree about what?\n\n"
    },
    {
      "time": "18 Jul 2014 — 3:46pm",
      "content": "I meant they might disagree that dyslexia is a myth and a meaningless label.\n\nhhp\n\n"
    },
    {
      "time": "18 Jul 2014 — 5:10pm",
      "content": "I suspect you haven't seen the documentary (or you've seen it in full and they give information in the second half which I missed as I've only seen the first 26 minutes so far). My first interpretation was also that dyslexia is a myth but apparently it's about the myths surrounding dyslexia, not that dyslexia itself is a myth.\n\nThe term 'meaningless' is contextual as well. A diagnosis will certainly help the people who have dyslexia, but in regard to education it's a meaningless label as schools should provide education which best suits the needs of the child in question, rather than providing a very general course and only making an extra effort when a diagnosis has been made. Schools tend to have major misconceptions about what dyslexia actually is. So did I. I can really recommend watching the documentary.\n\n"
    },
    {
      "time": "18 Jul 2014 — 5:23pm",
      "content": "OK. Hopefully the contents are better than the title. :-)\n\nhhp\n\n"
    },
    {
      "time": "19 Jul 2014 — 6:43pm",
      "content": "Quadibloc, you presented zero evidence for the proposition.\n\n\\> But looking for serious research, I find...\n\n... an article about mirrored writing, a situation in which brain injuries or lesions cause people to reverse all of their writing completely. How is this even related to the question of whether (some or any) dyslexics are confused by letters that are easily mirrored?\n\n\\> The Wikipedia article continues to reinforce the stereotype\n\nYes, which demonstrates that it is a widely-held belief (as I have said), not that there is any evidence for it.\n\n\\> it has been found to be a language-based disorder\n\nYes. In this viewpoint it is based on the confusability of sounds, not shapes. There is considerable evidence for this version of dyslexia.\n\n\\> which implicitly suggests that there is indeed something about language learning which helps people deal with mirror reflections as distinct, and which could therefore break down for whatever reason.\n\nThat's a fine theory. But what it is **not** is _evidence_ that such a breakdown occurs, nor further that it represents any (or a significant) portion of the problem(s) experienced by people being labeled as dyslexic.\n\nI will also point out that I have had this conversation with cognitive psychologists who specialize in reading and fonts, such as Kevin Larson and Dawn Shaikh, and they have said that they too believe that there is minimal evidence to support this commonly-held belief. FWIW.\n\n"
    },
    {
      "time": "19 Jul 2014 — 9:06pm",
      "content": "> Yes. In this viewpoint it is based on the confusability of sounds, not shapes. There is considerable evidence for this version of dyslexia.\n\nThere is evidence that dyslexia is also an auditory problem, however research suggests that dyslexia is a bigger problem in which things go wrong in signal processing. While it's true that research seems to suggest dyslexia affects the language-processing rather than the visual system, in some areas it results in the same thing; people with dyslexia may not actually see letters dancing around, but after processing the correct visual information, the information becomes scrambled anyway.\n\n<cite>Despite the many confusions and misunderstandings, the term dyslexia is commonly used by medical personnel, researchers, and clinicians. One of the most common misunderstandings about this condition is that dyslexia is a problem of letter or word reversals (b/d, was/saw) or of letters, words, or sentences \"dancing around\" on the page (Rayner, Foorman, Perfetti, Pesetsky, &amp; Seidenberg, 2001).</cite>\n\nThis suggests that indeed there is no visual problem but a problem with interpretation. It could be however that by differentiating more between letters the correct associations can be made. What I read is that treatments like the Davis Symbol Mastery are beneficial because essentially the person learns to enforce certain associations with certain symbols. If every symbol looks the same, then obviously the same association will be made. As such, when b/d/p/q are perceived to be too similar, they will conjure up the same association and thus the information will be incorrectly processed. I highly suspect this is why many dyslexics feel certain typefaces aid them in reading because it's easier to differentiate letters from each other. I've heard from people with dyslexia that they interpret letters as images which bring up certain associations.\n\n[http://www.dyslexia.com/science/different\\_pathways.htm](http://web.archive.org/web/20150414121756/http:/www.dyslexia.com/science/different_pathways.htm \"http://www.dyslexia.com/science/different\\_pathways.htm\")  \n [http://www.dyslexia.com/science/research.htm](http://web.archive.org/web/20150414121756/http:/www.dyslexia.com/science/research.htm \"http://www.dyslexia.com/science/research.htm\")  \n [http://www.scientificamerican.com/article/dyslexia-linked-to-brain-commu...](http://web.archive.org/web/20150414121756/http:/www.scientificamerican.com/article/dyslexia-linked-to-brain-communication-breakdown/ \"http://www.scientificamerican.com/article/dyslexia-linked-to-brain-communication-breakdown/\")  \n [http://dyslexia.yale.edu/Dyslexia\\_articleintro.html](http://web.archive.org/web/20150414121756/http:/dyslexia.yale.edu/Dyslexia_articleintro.html \"http://dyslexia.yale.edu/Dyslexia\\_articleintro.html\")  \n [http://www.dyslexia.com/science/research.htm](http://web.archive.org/web/20150414121756/http:/www.dyslexia.com/science/research.htm \"http://www.dyslexia.com/science/research.htm\")\n\n"
    },
    {
      "time": "21 Jul 2014 — 10:18am",
      "content": "\\> It could be however that by differentiating more between letters the correct associations can be made.\n\nThere is plenty of evidence that suggests this is the case. But that differentiation is between letters that are confused because their shapes are directly similar, not “similar if: mirrored; or rotated 180.” Or at least, that is what the available evidence suggests to date.\n\nThere is as yet no evidence that suggests that the things that improve legibility for dyslexic readers are any different than those that improve legibility for readers in general. We know (have massive evidence for the proposition) that legibility issues can occur when confusable characters are too similar, with characters such as 3, 6, 8, 9 or C, O / c, o.\n\n\\> As such, when b/d/p/q are perceived to be too similar\n\nThat is a lovely theory, yet I am still looking for any evidence that these letters are ever “perceived to be too similar” by anybody other than beginning readers. That is the leap for which there is no longer even solid theoretical backing, let alone evidence.\n\nI do not have a problem with saying that more research could be done, or that perhaps better/different testing might find that there really is some impact of these factors. It just needs to be recognized that people have in fact made fonts already that attempt to address this perceived source of the problem (mirroring/rotating), there has been some research on it, and no statistically significant improvements have been found by using fonts designed to address this.\n\n"
    },
    {
      "time": "21 Jul 2014 — 11:04am",
      "content": "How do dyslexics fare with reading handwriting (their own and others)?\n\nIt’s worth noting that there is no scientiﬁc evidence that a character should be represented by an identical glyph every time it appears. This is a result of an economy associated with foundry type.\n\nI will be showing a new typeface at TypeCon which challenges this practice.\n\n"
    },
    {
      "time": "22 Jul 2014 — 1:25am",
      "content": "A hallmark of orthographic dyslexic students (those who struggle with print) is illegible handwriting and incredibly phonetic spelling. They often cannot read back what they have written. Another big issue is being able to decode quickly enough to synthesis what has been read. Dyslexics are generally slow decoders - those who do learn to read effectively often do so by memorizing words by sight rather than \"decoding\" the pieces that make up the words - and by memorizing the vocabulary in their field of interest. This is why a dyslexic can be an engineer or doctor - they learn to read/process what they encounter most. Most popular teaching methods for students with dyslexia focus on teaching the sounds, rules, and prefixes and suffixes that make up our language - but as a teacher of kids with Specific Learning Disabilities my anecdotal opinion is that acquiring a vast sight word vocabulary is often most helpful.\n\nWith that said, I've also found using a consistent font to be most helpful for my students - the nuances of different fonts do impact the processing speed - if it takes too long to process comprehension is impacted. I choose a font that is most similar to the handwritten font taught in my building and stick with that font for all print materials. I often re type or convert text to this font. I teach k-5 student with language or learning disabilities who are otherwise cognitively typical.\n\n"
    },
    {
      "time": "24 Jul 2014 — 1:18pm",
      "content": "“It’s worth noting that there is no scientiﬁc evidence that a character should be represented by an identical glyph every time it appears.”\n\nIndeed, quite the contrary. Research has shown that the importance of letter features varies somewhat by context. This strongly suggests that contextual substitutions could be used to improve legibility for certain combinations that create confusion, such as the (in)famous “rn” combination.\n\n(I have however already seen fonts that do in fact use multiple varying glyphs per character, both methodically/contextually and pseudo-randomly—and not just handwriting/script fonts. Not saying it isn’t an interesting idea, just not new.)\n\n"
    },
    {
      "time": "24 Jul 2014 — 3:34pm",
      "content": "@Thomas Phinney:  \n<cite>such as the (in)famous “rn” combination</cite>\n\nWhile contextual glyphs are available with present technology, there is another less radical thing that could be done in that specific case, and other similar ones: fonts already have kerning tables, and a combination like \"rn\", in order not to look like \"m\", could benefit from a little bit of anti-kerning.\n\n"
    },
    {
      "time": "24 Jul 2014 — 4:40pm",
      "content": "@Thomas: _I have however already seen fonts that do in fact use multiple varying glyphs per character, both methodically/contextually and pseudo-randomly—and not just handwriting/script fonts._\n\nAnd they are… ?\n\n"
    },
    {
      "time": "30 Jul 2014 — 11:36am",
      "content": "<cite>There is plenty of evidence that suggests this is the case. But that differentiation is between letters that are confused because their shapes are directly similar, not “similar if: mirrored; or rotated 180.” Or at least, that is what the available evidence suggests to date.</cite>\n\nI can hardly imagine the conclusion on a study would be that specifically rotated/mirrored shapes are an issue, rather than the use of similar shapes in general. I think if the rotation/mirroring is mentioned it's incidental. The underlying issue after all is the lack of differentiation between shapes, and mirrored and rotated shapes are just two examples. I haven't stumbled upon a study which focused specifically on rotation.\n\n<cite>And they are… ?</cite>\n\nI couldn't name any, but I've seen it in several fonts besides script fonts. It's usually done in typefaces which imitate specific printing techniques in which more variety is added to letter shapes. I've never seen a typeface which specifically addresses legibility by making use of varying glyphs though. I think that's actually new.\n\n"
    },
    {
      "time": "30 Jul 2014 — 1:26pm",
      "content": "\\> The underlying issue after all is the lack of differentiation between shapes, and mirrored and rotated shapes are just two examples.\n\nAgain, please present ANY actual evidence that supports the second half of your statement. I contend they are NOT in fact examples of lack of differentiation, because nobody other than beginning readers makes mirroring/rotation mistakes.\n\n"
    },
    {
      "time": "30 Jul 2014 — 1:53pm",
      "content": "One clue is the boustrophedon writing of the Ancient Greeks: no matter its direction it was the same letter.\n\nhhp\n\n"
    },
    {
      "time": "30 Jul 2014 — 4:06pm",
      "content": "<cite>Again, please present ANY actual evidence that supports the second half of your statement.</cite>  \nI don't need to present evidence on examples of a principle you already agreed has been validated by different studies. There are different considerations to be made about rotated/mirrored letters but not in regard to the statement I made earlier.\n\n<cite>I contend they are NOT in fact examples of lack of differentiation, because nobody other than beginning readers makes mirroring/rotation mistakes.</cite>  \nThe second part of this statement is no cause for the first part. They ARE examples of a lack of differentiation. You're repeating elements after all, so whether you rotate or mirror them is besides the point. In fact, if you're going to repeat elements then rotating or mirroring are the only ways to still differentiate between letters as much as possible. The issue is not with mirroring/rotating but with the lack of differentiation by repeating the same basic shapes.\n\nThe notion that nobody other than beginning readers make the mirroring/rotation mistake can be explained quite easily. Beginning readers may have difficulty with those letters because they have yet to remember what they look like and it simply takes more time remembering shapes which look similar. People with dyslexia know perfectly well what each letter looks like; their issue is in the processing of information. The only thing beginning readers and people with dyslexia may have in common is that the reading experience could be improved if our alphabet utilized more variety in shapes. The reason why this may help with reading has different causes for both groups though.\n\n"
    },
    {
      "time": "6 Aug 2014 — 6:31am",
      "content": "Actually, no. The available evidence suggests that mirroring and rotation succeed at differentiating. People’s brains treat them as completely different shapes, and that's the definition of differentiation for purposes of this discussion. That's why I am disagreeing with you. (The simplicity of the mathematical transformations involved is irrelevant.)\n\n"
    }
  ]
}
