{
  "id": "115426",
  "title": "What would the font be in a book in Library of Babel?",
  "forum": "Typography / Composition",
  "tags": [
    "Babel",
    "Borges",
    "library",
    "perfect serif etc...",
    "Typography / Composition"
  ],
  "content": "Hi,\n\nI´m making a book based on the short story \"library of Babel\" by Jorge Luis Borge as a school assignment. (studying graphic design.)  \n [http://jubal.westnet.com/hyperdiscordia/library\\_of\\_babel.html](http://web.archive.org/web/20150426051742/http:/jubal.westnet.com/hyperdiscordia/library_of_babel.html \"http://jubal.westnet.com/hyperdiscordia/library\\_of\\_babel.html\")  \n [http://en.wikipedia.org/wiki/The\\_Library\\_of\\_Babel](http://web.archive.org/web/20150426051742/http:/en.wikipedia.org/wiki/The_Library_of_Babel \"http://en.wikipedia.org/wiki/The\\_Library\\_of\\_Babel\")\n\nI´m about to decide on a font.  \nIn the story Borge describes the font used in all the books in the library:\n\n\"To perceive the distance between the divine and the human, it is enough to compare these crude wavering symbols which my fallible hand scrawls on the cover of a book, with the organic letters inside: punctual, delicate, perfectly black, inimitably symmetrical. \"\n\nJust by reading this description, what would you say the font could be?\n\nI´m thinking a serif, and something really classical, like Garamond, Baskerville, Caslon, or maybe Bembo?  \n(based on that the library has a infinite feel to it, and that the books are quite big.)\n\nBut would be interesting to hear what you think!  \nthanks!  \nBest  \nG\n\n",
  "author": "gabbbahey",
  "time": "1 Apr 2014 — 3:25pm",
  "uid": "44039",
  "comments": [
    {
      "time": "1 Apr 2014 — 5:14pm",
      "content": "I'm no fan of the Didone style, but that's what that passage makes me think of.\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2014 — 4:57am",
      "content": "Thanks, yeah, a didone makes sense.  \nBut I´m like you no fan of them... Especially not for longer texts.\n\n"
    },
    {
      "time": "2 Apr 2014 — 6:05am",
      "content": "I don't see how to meet the \"inimitably symmetrical\" criterion without being a geometric font (though I wonder under what group of symmetries :) )\n\n"
    },
    {
      "time": "2 Apr 2014 — 6:40am",
      "content": "Yeah, I´ve been asking myself the same question.. ;)  \nBut decided against the geometric font since the books that the author is talking about are about 410 pages of just text...\n\n"
    },
    {
      "time": "2 Apr 2014 — 8:25am",
      "content": "In Didone style typefaces the ‘o’ has a vertical symmetry axis. In most typefaces of that style b and d as well as p and q are almost mirror imaged. The relatively thin serifs at the top of the ascenders do not really contribute to a strong asymmetrical impression. In many cases the counters of these characters, as well as those of n, m and u look quite symmetrical. Especially when compared with the Garalde style. Geometric Sans Serif may be fairly symmetrical when it comes to u, j and t (as in Futura), as well as i, v, w and x, but that’s about it. In geometric sans serif design it is of course possible to come up with a symmetrical n and m as well, but then the typeface would have looked as revolutionary as the typefaces Herbert Bayer and Joost Schmidt designed during the Bauhaus Dessau era. Herbert Bayer used it for the title of »die neue line« and both of them used such designs for the lettering in exhibition design and posters, but these rather experimental designs heave never been available as metal type back then, let alone in text sizes.\n\nI’d be surprised if Borges thought of a sans serif typeface anyway. After all, his story was first published in 1941. At that time there were hardly any books printed with a sans serif as a text typeface. If he would have really imagined the books being printed in sans serif, that would have been quite a revolutionary statement for that time and I think he would thus have described that idea more precise.\n\nAlso we have to take into account that at that time, Garalde typefaces were a relatively young phenomenon. Most of the revivals of that style came into the market into the early 1920s. Especially in Europe were WWII will have kept many printers from buying new typesetting machines and typefaces for some time. And, like it or not, the typical 19th century book face is Didonic. Most books known to Borges in 1941 will have been set in Didonic typefaces. Many of these will have had bracketed serifs, but that alone does not make their appearance less symmetrical.\n\nDidonic typefaces have a bad image when it comes to legibility, but we have to take into account that this idea is largely fed by the far too thin versions of the 20th century. This was mainly caused by poorly handled pantographs, phototype versions rendered from artwork for large sizes etc. Also the smoother paper of the 19th and 20th century had already caused many typefaces to look thinner than originally intended.\n\nToday, well designed optical sizes for smaller typefaces may do a remarkably good job, especially for the Didonic style.\n\n"
    },
    {
      "time": "2 Apr 2014 — 9:30am",
      "content": "Wow, thanks! I really appreciate your input!\n\nYou definitely got me convinced it´s a didonic typeface I´m after. Especially:  \n\"In most typefaces of that style b and d as well as p and q are almost mirror imaged\"\n\nTo me this is perfect since Borge frequently mentions mirrors in his stories, also in \"The Library of Babel\":\n\n\"In the hallway there is a mirror which faithfully duplicates all appearances. Men usually infer from this mirror that the Library is not infinite (if it were, why this illusory duplication?); I prefer to dream that its polished surfaces represent and promise the infinite...\"\n\nDo you have any suggestion for a great \"modern\" didone that would do a great job in my book? I´m going to follow the rules mentioned in Borges story, i.e:  \n\"Each book is of four hundred and ten pages; each page, of forty lines, each line, of some eighty letters which are black in color.\"  \nProbably set at a pretty large size, something like 12/16pt. Havn´t got that far yet...\n\nOnce again, thanks! I´ve learned a lot.\n\n"
    },
    {
      "time": "2 Apr 2014 — 10:47am",
      "content": "To me this is a case where you actually want to sacrifice a good deal of readability for the look & feel. So I would choose a more... head-strong Didone.\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2014 — 3:05pm",
      "content": "Probably, yes. I´m trying out a few didones (ITCs Bodoni, Didot LT, Walbaum and Kepler)  \nI think I´m into Kepler at the moment...\n\nI find it really tricky to get it to look nice since I´ve decided on following the typographic \"rules\" in Borges text: \"Each book is of four hundred and ten pages; each page, of forty lines, each line, of some eighty letters which are black in color.\"\n\nLong lines...\n\nI also realize that the didones really challenge the typographer, especially if the typographer isn´t an experienced one ;) They´re really resisting!\n\n"
    },
    {
      "time": "2 Apr 2014 — 3:28pm",
      "content": "OK, this might be a stupid question, but something like this would not suit the occasion? I found this book the other day, and really like the typo...  \n [http://typophile.com/files/1\\_90.jpg](http://web.archive.org/web/20150426051742/http:/typophile.com/files/1_90.jpg \"http://typophile.com/files/1\\_90.jpg\")  \n [http://typophile.com/files/2\\_64.jpg](http://web.archive.org/web/20150426051742/http:/typophile.com/files/2_64.jpg \"http://typophile.com/files/2\\_64.jpg\")\n\n"
    },
    {
      "time": "2 Apr 2014 — 3:43pm",
      "content": "Elzevir? Not sufficiently... ideological. :-)\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2014 — 11:44pm",
      "content": "Sorry, Elzevir? are you suggesting me to look at their books, or did you ask if this was Elzevir?  \n:)\n\n"
    },
    {
      "time": "3 Apr 2014 — 3:46am",
      "content": "In the [Thibaudeau classification](http://web.archive.org/web/20150426051742/http:/en.wikipedia.org/wiki/Thibaudeau_classification), Elzévirs are typefaces with triangular serifs.\n\n"
    },
    {
      "time": "3 Apr 2014 — 4:39am",
      "content": "Ah! I see. Thank you Michel!  \n(I love this forum, I learn new things every day...)\n\nYeah hrant, you´re probably right...\n\n"
    },
    {
      "time": "3 Apr 2014 — 5:40am",
      "content": "FontShop’s [Modern bracketed serif](http://web.archive.org/web/20150426051742/http:/www.fontshop.com/fontlist/subclasses/serif_bracketed_modern_text/) list shows the right category, I think.\n\nThinking within that category but not excluding the usually non-bracketed Didonic style: [Century Expanded](http://web.archive.org/web/20150426051742/http:/www.identifont.com/find?font=century+expanded&q=Go) is not bad, [Miller Text](http://web.archive.org/web/20150426051742/http:/www.identifont.com/find?font=miller+text&q=Go) is better but in both cases the descenders are too short for longer texts. I have the same problem with the regular weight of [Eames Century Modern](http://web.archive.org/web/20150426051742/http:/www.houseind.com/fonts/eames/viewfonts). Besides of that, the italic with its tightly-knit begin- and end strokes is far too nervous for book typography. [(New) Century Schoolbook](http://web.archive.org/web/20150426051742/http:/www.identifont.com/find?font=new+century+schoolbook&q=Go) may be slightly more appropriate. [ITC Bodoni Twelve](http://web.archive.org/web/20150426051742/http:/www.identifont.com/find?font=Bodoni+Twelve&q=Go) looks OK, but it may be too quirky for Borges rationalist attitude. [Kepler](http://web.archive.org/web/20150426051742/http:/www.myfonts.com/fonts/adobe/kepler/) is more regular, but tends too much to the transitional style. Less transitional than one might expect from the way it is usually classified is Baskerville. A version of Baskerville with the appropriate lower contrast needed for text sizes could probably do a great job here. [Berthold Baskerville Book](http://web.archive.org/web/20150426051742/http:/www.myfonts.com/fonts/berthold/baskerville-book-pro/) has the right colour I think. The same goes for [Berthold Baskerville](http://web.archive.org/web/20150426051742/http:/www.myfonts.com/fonts/berthold/baskerville-pro/), but it is rather clumsy compared with the Book version, the italic is too dark and the bolder weights lack contrast. That typeface family does not have that much in common with Baskerville anyway. One should be aware of the fact that foundries such as URW and Linotype sell Berthold Baskerville as Baskerville too, but that does not make them much better. Monotype and ITC Baskerville are far too light [Linotype’s Baskerville Classico](http://web.archive.org/web/20150426051742/http:/www.myfonts.com/fonts/linotype/baskerville-classico/) looks decent, but one has to put it to the test to make shure.\n\nPersonally, I would do some testing with [FF Cellini](http://web.archive.org/web/20150426051742/http:/www.fontshop.com/fonts/downloads/fontfont/ff_cellini_ot/ot_ps) by Albert Boton. Especially because it has the typical 19th century rationalist look, which is a bit more condensed.\n\n"
    },
    {
      "time": "3 Apr 2014 — 5:57am",
      "content": "Albert -Jan, thanks! Your input and help is greatly appreciated!\n\nUnfortunately I I don´t have FF Cellini, and the budget of this project doesn´t allow any purchases... Pity since it looked as a good alternative. But I do have Berthold Baskerville Book, I´m gonna put it to the test. I had´nt considered it since I considered it to be more of a transitional typeface. But then again, I really don´t know my typography classification that well... Checking the Thibaudeau classification I see now though, that it´s classified as a didot?\n\nOnce again, thanks!\n\n"
    },
    {
      "time": "3 Apr 2014 — 6:32am",
      "content": "Hmmm, looks ok, but would be nice to get closer to the rationalist look, just like you said...  \nWhats your opinion on New Caledonia LT, and Berthold Walbaum Book? To me Walbaum looks quite nice too, but not as \"delicate\" as Cellini? hmm, walbaum looks quite \"square and boxy\" in comparison actually...\n\n"
    },
    {
      "time": "3 Apr 2014 — 7:16am",
      "content": "Caledonia is a beautiful typeface, but a bit skinny when compared to the metal version. I think that the hairlines of New Caledonia LT are a bit too thin for a text typeface. I also like Berthold Walbaum Book, but I think the stem are a bit too dark. Makes it too spotty / sparkling for a text typeface. Berthold Walbaum Standard is much better as a text typeface, also much better than the Monotype version which is too skinny. Also I think that Justus Erich Walbaum would probably rotate in his grave if he’d see how quirky that interpretation is. The disadvantage of Berthold Walbaum Standard might be slope of the italic. It provides a clear contrast to the roman, but at the risk of creating too much unrest on the page.\n\nWhen you need a typeface for student project, some foundries may supply you with a ‘student license’. Usually that means that you do not have to pay for it, but are not allowed to use it after having finished your study and for commercial projects. Give it a try at the foundry in question, I’d say …\n\nWhen classifying according to Thibaudeau, Baskerville clearly belongs into the Didot group.\n\n"
    },
    {
      "time": "3 Apr 2014 — 7:52am",
      "content": "Great tip, thanks! I´ve e-mailed the foundry. Hopefully they feel generous. Wish I thought about doing this earlier! (and in other projects)\n\nGoing to see if I can get hold of Berthold Walbaum Standard too. I ´ve printed the Book-version, and do understand what you mean about the spottiness...\n\nThanks!\n\n"
    },
    {
      "time": "3 Apr 2014 — 8:54am",
      "content": "Well, there's more to Elzevir fonts (or any font category, really) than serif shape. And I don't agree with any of Thibaudeau's three examples of Elzevirs. On the other hand I don't have an alternative reference handy...\n\nhhp\n\n"
    },
    {
      "time": "3 Apr 2014 — 11:02am",
      "content": "Only half-jokingly do I suggest [Averia](http://web.archive.org/web/20150426051742/http:/iotic.com/averia/).\n\n--John\n\n"
    },
    {
      "time": "3 Apr 2014 — 11:45am",
      "content": "Thanks for the suggestion John, it´ll probably not work for what I´m working on right now. But what a great project! I´ve downloaded the family, and are looking forward to try it out! Love the idea!  \n/G\n\n"
    }
  ]
}
