{
  "id": "115416",
  "title": "tribal? sans serif clean font",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": "I want to say this used to be a Formatt, Chartpak or Letraset font and if memory serves the D had a dot in the middle of it. I have looked through the catalogs I had but think this font came out just before they quit printing them.\n\n ![](http://web.archive.org/web/20150317173912im_/http:/typophile.com/files/koala%20text_6717.JPG)\n\nFont:&nbsp;\n\n snootchie bootchies \n\nSolved By:&nbsp;\n\n [fvilanakis](http://web.archive.org/web/20150317173912/http:/typophile.com/user/176276 \"View user profile.\")\n\n",
  "author": "mightyquinn",
  "time": "1 Apr 2014 — 7:35am",
  "uid": "218857",
  "comments": [
    {
      "time": "2 Apr 2014 — 1:51am",
      "content": "I found a font named **Snootchie Bootchies** which looks like a good match - only /T is a bit different.  \nThe copyright says \"Rev. Josh Wilhelm 2000\" but I don't have any other info and I can't find any legitimate source to acquire it.\n\n"
    },
    {
      "time": "2 Apr 2014 — 4:37am",
      "content": "If you want to check the old catalogs, the only one on your list that I have is Letraset 1985. A quick glance through it did not show a match.  \nDon\n\n"
    },
    {
      "time": "2 Apr 2014 — 4:40am",
      "content": "\"Snootchie Bootchies\" must mean something to the English. Here as the phrase in the famous \"Keep Calm\" poster format [http://www.keepcalm-o-matic.co.uk/p/snootchie-bootchies/](http://web.archive.org/web/20150317173912/http:/www.keepcalm-o-matic.co.uk/p/snootchie-bootchies/ \"http://www.keepcalm-o-matic.co.uk/p/snootchie-bootchies/\")  \nDon\n\n"
    },
    {
      "time": "2 Apr 2014 — 8:35am",
      "content": "WOW! Thank You very much. I did some searching and downloaded it from what-font.co.uk. I do remember that T being \"not wanted\" and \"fixed\" as per the boss but I do not remember that name. It certainly would have stood out just like \"Belching up Salisbury Steak\" which I used to sneak in art files as live text just so some artist or out-putter would have to call me and ask for the font. As it turns out in my searching I came across Jsh Wilhelm and an association with \"Spork Thug Typography\" on 1001freefonts.com along with a few others. He apparently is very creative with his names and guess what? He is responsible for Belching up salisbury steak! crazy!!!! Thank You very Much!!!\n\n"
    }
  ]
}
