{
  "id": "115473",
  "title": "Futuristic font from 1976 \"Official California visitor map\"",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello everyone,\n\nI accidentally found 1976 \"Official Caliornia visitor map\" scan on Flickr, and would like to know what exactly the main font is (the tri-color upper)? I checked 1977 Letraset font brochure, Linotype website and some retro design websites, but with no results as yet. There's even NO image o that font anywhere else. Kinda strange.\n\nI'd like to try to find and use this font for my design work, so any help would be appreciated.\n\nThank you and best regards.\n\n ![](http://web.archive.org/web/20140624010241im_/http:/typophile.com/files/3750750324_07c661bd86_o_4867.jpg)\n\n",
  "author": "Nordiac",
  "time": "2 Apr 2014 — 4:35pm",
  "uid": "218900",
  "comments": [
    {
      "time": "2 Apr 2014 — 6:23pm",
      "content": "I don't know what was the original, but there is **[Retro Stereo Wide](http://web.archive.org/web/20140624010241/http:/www.findmyfont.com/index.php/fonts/font-preview?fset=Dafont-2&ffam=Retro%20Stereo%20Wide%20-%20Regular&fid=6840127b18bcd571d8c284e5ffdc584f&fsize=60&text=cALIFORNIA&wrap=2)** a free font by Gus Thessalos which matches your sample, with the exception of /A.  \n(Note also that the /C of your sample is stored on font letter /c)\n\n"
    },
    {
      "time": "4 Apr 2014 — 1:35am",
      "content": "The original should be [Yagi Double](http://web.archive.org/web/20140624010241/http:/typophile.com/node/71665) by [Robert Trogman](http://web.archive.org/web/20140624010241/http:/typophile.com/node/76158#comment-438985). One digital version I'm aware of is [Asteroid](http://web.archive.org/web/20140624010241/http:/www.myfonts.com/fonts/victory/regular) by Victory Type.\n\n"
    },
    {
      "time": "3 Apr 2014 — 10:39am",
      "content": "Perfect! Didn't expect such quick response. Just downloaded Retro Stereo Wide. Thank you very much. With best regards! T.\n\n"
    },
    {
      "time": "3 Apr 2014 — 10:57am",
      "content": "Ryuk - in the Typophile thread you linked to, Robert Trogman said, \"I'm glad that it has been revived.\" I would think that confers legitimacy as much as anything, no?\n\nIn fact, nowhere in Victory Type's font description do they credit Mr. Trogman. You would think if they sought and got permission they would say so. And if they didn't, that almost makes Retro Stereo Wide _more_ legitimate than Asteroid.\n\nMy point is that simply being for sale on MyFonts doesn't always confer that legitimacy (although, as one of the original MyFonts moderators, I can say we have caught and reported more than a few offenders and those fonts were dropped).\n\n"
    },
    {
      "time": "3 Apr 2014 — 11:32am",
      "content": "Did anyone catch the comment by \"Character\" [Herbert F. Van Brink] on the Dafont site that Retro Stereo Wide is a \"reproduction of the rub-on font 'Circuit Double' produced in the 1980's by Formatt.\" Bob Trogman, the original designer of the font, said in [http://typophile.com/node/76158#comment-438985](http://web.archive.org/web/20140624010241/http:/typophile.com/node/76158#comment-438985 \"http://typophile.com/node/76158#comment-438985\") that \"his original release film font [in 1968 of] Yagi fonts [was] in the Facsimile Font program. So the original California map could have been produced from rub-on letters by FotoStar, [or perhaps Letraset]. Which may explain the differences in the 1976 image from Retro Stereo Wide, which may have been based a the 1980's Formatt version.  \nDon\n\n"
    },
    {
      "time": "4 Apr 2014 — 1:33am",
      "content": "Thanks for the clarification, Mike even if, of course, there was no bad intention behind my word 'legitimate'. But as many free fonts are actually rip-off or illegitimate copy, I simply supposed Asteroid could be (legitimate). I should have remembered a font sold at MyFonts never proves its legitimacy. Lesson learned (again). The font business is definitely too much fuzzy and even worst when it comes to revival.\n\n"
    },
    {
      "time": "3 Apr 2014 — 1:37pm",
      "content": "Hi Ruyk, stealing type designs goes back at least as far as the invention of electrotyping in the 19th century. About all that is protected in a type design, at least under US and similar laws, is the the computer generated font outlines. Making a new font by recreating from a printed source seems to escape the wrath of copyright infringement. There is an exception for fonts that have design patents. But these expire in a few years. Lots of grey areas and potential for lawyers to get rich -- font designers rarely do :)  \nBTW Myfonts is definitely the elephant in the room. If a font is not sold via Myfonts, it generally has very poor market prospects. Only a few large independents -- House, H&FJ etc. -- have been able to succeed as profitable ventures.  \nDon\n\n"
    },
    {
      "time": "3 Apr 2014 — 7:15pm",
      "content": "Fuzzy is a good word for the situation, Ryuk.\n\n"
    },
    {
      "time": "4 Apr 2014 — 12:05am",
      "content": "Fuzzy ...\n\n ![](http://web.archive.org/web/20140624010241im_/http:/typophile.com/files/Fuzzy_4962.jpg)\n  \nDon\n\n"
    }
  ]
}
