{
  "id": "115470",
  "title": "Need Font Similar to Grey Sans Black",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI am looking for a free font similar to Grey Sans Black, Acto UltraBlack, or Formula TS ExtraBold. I have looked at daFont and Font Squirrel and so far have had no luck. I was hopping someone here might be able to point me in the direction or better yet introduce me to a substitute.\n\nThanks\n\n| Attachment | Size |\n| --- | --- |\n| [e8f9c5aa6dffea0fd297eff09b7f65.gif](http://web.archive.org/web/20140803133746/http:/typophile.com/files/e8f9c5aa6dffea0fd297eff09b7f65.gif) | 4.65 KB |\n\n",
  "author": "jwdesign",
  "time": "2 Apr 2014 — 2:16pm",
  "uid": "218893",
  "comments": [
    {
      "time": "2 Apr 2014 — 3:49pm",
      "content": "Some people don't like providing this sort of help.\n\nBTW why does it have to be free?\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2014 — 8:39pm",
      "content": "Joe, Grey Sans Black is only $18, not expensive at all.  \nI you like it, why not buying it?\n\n"
    },
    {
      "time": "3 Apr 2014 — 9:42am",
      "content": "Cause it is not my call. My Boss told me to find a FREE font that mimicked those listed above. For some background info, I get where you guys are coming from being one of 2 designers at a .net web design company which is staffed mostly by developers and run by people who think like developers. Developers don't value fonts and graphics and don't see why they should pay for them when they THINK they can get quality ones for free. They would rather send me out on a wild goose chase rather than pay for the font and save me the time. I don't even have a type as basic as Helvetic on my computer because the cost is extra. I came here because I was told you guys know type. I am not trying to rub anyone the wrong way or spark any debates. I am simply trying to get a job done and maximize my time. So if you guys could help me with that I would really appreciate it. If you guys do not every provide anyone with this kind of assistance I hope someone will just take the time to flat out say that. And if that is the case I am sorry for the bother and I will take my problem somewhere else.\n\n"
    },
    {
      "time": "3 Apr 2014 — 9:51am",
      "content": "Just ask him if $18 is too much for the real thing. Otherwise, considering your explanation, maybe you can just use Arial Black and they won't notice/care?\n\nPlease be mindful of the fact that Typophile is good because we value type.\n\nhhp\n\n"
    }
  ]
}
