{
  "id": "115491",
  "title": "Wes Anderson Hotel Budapest Newspaper Font",
  "forum": "Home",
  "tags": [
    "Serif"
  ],
  "content": "I have been trying to find out what font's are being used in the newspaper from the movie. It seems that the logo mast head is a combination of two different gothic typefaces. For Caps it is Old English Text MT and for the lower case letters it looks like Muenchner Fraktur. I can't seem to find out what the other headline fonts are. I especially would love to find out what this font is (see attached).\n\nHere is a link to the highest quality image of the newspaper I could find.  \n [http://www.papermag.com/uploaded\\_images/budapesthotleNewspaper.jpg](http://web.archive.org/web/20150218042927/http:/www.papermag.com/uploaded_images/budapesthotleNewspaper.jpg \"http://www.papermag.com/uploaded\\_images/budapesthotleNewspaper.jpg\")\n\nFont:&nbsp;\n\n Fletcher \n\nSolved By:&nbsp;\n\n [Mike F](http://web.archive.org/web/20150218042927/http:/typophile.com/user/3368 \"View user profile.\")\n\n| Attachment | Size |\n| --- | --- |\n| [budapesthotleNewspaper.jpg](http://web.archive.org/web/20150218042927/http:/typophile.com/files/budapesthotleNewspaper.jpg) | 43.34 KB |\n\n",
  "author": "feedmartin",
  "time": "3 Apr 2014 — 8:24am",
  "uid": "176131",
  "comments": [
    {
      "time": "3 Apr 2014 — 8:54am",
      "content": "I agree. That's a lovely typeface.\n\nI expect it's custom [http://littlegoosefeet.wordpress.com/2013/10/19/can-wes-andersons-archer-y-skills-hit-the-bullseye/](http://web.archive.org/web/20150218042927/http:/littlegoosefeet.wordpress.com/2013/10/19/can-wes-andersons-archer-y-skills-hit-the-bullseye/).\n\n"
    },
    {
      "time": "3 Apr 2014 — 10:25am",
      "content": "Based on an early 1900's typeface called, in the West anyway, Arrowhead. Digitally, see Jordan Davies [Lettres Angulaires Semi Bold](http://web.archive.org/web/20150218042927/http:/old.myfonts.com/fonts/woodentypefonts/lettres-angulaires/), Intellecta's [Gotica Modern](http://web.archive.org/web/20150218042927/http:/old.myfonts.com/fonts/intellecta/gotica-moderna/) and Dan Solo's [Fletcher](http://web.archive.org/web/20150218042927/http:/old.myfonts.com/fonts/solotype/fletcher/). The latter appears to be the font used. Per Dan, the original was \"from the French foundry of Beaudoire & Cie\".\n\nEdit: I wonder if the name Fletcher was a play on Arrowhead. Fletch means to add the feather to an arrow.\n\n"
    },
    {
      "time": "3 Apr 2014 — 10:30am",
      "content": "Oh - and there's also [ArrowheadLake](http://web.archive.org/web/20150218042927/http:/abfonts.freehostia.com/arrowhead-lake.htm) (and Shaded) by character.\n\n"
    },
    {
      "time": "3 Apr 2014 — 11:55am",
      "content": "Good find Mike. BTW \"fletcher\" is the occupational name for an arrowsmith or seller of arrows. Dan X. Solo probably felt that he had a real find when he bought a font of type that was based on a font \"from the French foundry of Beaudoire & Cie\". A change from all the ATF fonts of type that he would usually find on his buying trips. I have no further information on the French original other than the statement by Dan X. Solo. Of the available digital versions, I am somewhat inclined towards the quality of the version by Character {Herbert F. Van Brink}.  \nDon\n\n"
    },
    {
      "time": "3 Apr 2014 — 12:09pm",
      "content": "Wes Anderson is noted for his quirky approach to film making and an obsession with detail. The press info cited by Fiver refers to his interest in selecting typefaces and mentions Archer, by H&FJ. Wes Anderson may have chosen Arrowhead/Fletcher for the death notice as because the name fits his Archer theme -- a secret irony -- rather than its intrinsic strength as a blackletter.  \nDon\n\n"
    },
    {
      "time": "3 Apr 2014 — 3:57pm",
      "content": "Wow Thanks to everyone for the additional background info on the fonts.  \nMike, That's Fletcher alright. What grabbed my attention about Fletcher is how the arrows blend seamlessly with the black letter serifs. When I saw the newspaper flash in the movie my eyes where drawn to that font. I couldn't find out why this black letter looked so unique. It is was really surprising to see that fletcher looks modular and geometric for a typeface made in 1865. Way ahead of it's time in that regard. http://en.wikipedia.org/wiki/Fletcher\\_(typeface)\n\nFollow up question. I may be pushing my luck on this post but do you know what the headline font \"Will There Be War?\" is in the newspaper? [http://www.papermag.com/uploaded\\_images/budapesthotleNewspaper.jpg](http://web.archive.org/web/20150218042927/http:/www.papermag.com/uploaded_images/budapesthotleNewspaper.jpg \"http://www.papermag.com/uploaded\\_images/budapesthotleNewspaper.jpg\")\n\n"
    },
    {
      "time": "6 Apr 2014 — 10:58am",
      "content": "The headline font is definitely some version of Cheltenham. Giveaway is uppercase A. The headline could be ITC Cheltenham Condensed, but the mixed case “Tanks at Frontier” is some other (older) version with lower x-height. No version on MyFonts.com seems to show “Tanks at Frontier” correctly.\n\n"
    }
  ]
}
