{
  "id": "1154",
  "title": "Critica el logo / criticize this logo",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "la idea es transformar al tipico peroo vago chileno que abunda por las calles de santiago en una atraccion turistica, el proyecto va dirigido a los turistas y sera aplicado en souvenires   \n   \nthe idea is to transform the typical chilean tramp dog (that you meet in every place in Santiago) into a turist atraction, the proyect points to the tourists and the logo will be applied on souvenirs\n\n",
  "author": "triton",
  "time": "4 Sep 2003 — 6:49pm",
  "uid": "2249",
  "comments": [
    {
      "time": "5 Sep 2003 — 3:47am",
      "content": "I love it!\n\n"
    },
    {
      "time": "6 Sep 2003 — 4:56am",
      "content": "Haha. It's great!   \n   \nPicky things that I might adjust: 1) the nose highlight seems too close to the edge, 2) the nose and eyes seem too smooth compared to the rest of the form, 3) could the bottom of the \"E\" be thickened slightly?, 4) I like how his foot is sitting on the \"Q\", but I'm not fond of the trapped negative space. Could his front leg be moved to compensate?\n\n"
    },
    {
      "time": "7 Sep 2003 — 1:11pm",
      "content": "![](http://web.archive.org/web/20131017095305im_/http:/www.typophile.com/forums/messages/4100/15607.jpg) ![](http://web.archive.org/web/20131017095305im_/http:/www.typophile.com/forums/messages/4100/15608.jpg)   \nhere are 2 new posibilities, help us in our choice!!!!! thanks!\n\n"
    },
    {
      "time": "7 Sep 2003 — 1:36pm",
      "content": "Why do you need to choose? I would do 3 variations and alternate them on the applications. As long as the type treatment is consistent, you will not have a problem with branding. Version 2 looks as if he is peeing on the T. Was that the intention? He looks quite guilty. Very funny.   \n   \nSeriously though, I would do 3 different variations of the doggy interacting with the type. Maybe with one he is licking the Q!   \n   \nBe careful with scale also. He seems a little large in relation to the type.\n\n"
    },
    {
      "time": "6 Sep 2003 — 2:55am",
      "content": "Maybe you should try producing it as a linocut (or woodcut) to make some of the marks more \"authentic\". But it is a cute image.\n\n"
    }
  ]
}
