{
  "id": "115594",
  "title": "Announcing P22 Wedge - A Font by Architect Bruce Rotherham",
  "forum": "Home",
  "tags": [
    "News",
    "Roman",
    "rotherham",
    "Text"
  ],
  "content": " ![](http://web.archive.org/web/20150322005656im_/http:/typophile.com/files/ban-ihof-wedge-02_5705.png)\n  \n [Wedge](http://web.archive.org/web/20150322005656/https:/www.p22.com/family-Wedge) is the singular vision of one man. Spanning decades, the design of this font took the history of the Roman letter into full consideration. Despite ultimate rejection for production into metal type, the design was realized as intended and is now released in digital form.\n\nNoted New Zealand&nbsp;architect&nbsp;Bruce&nbsp;Rotherham (1926–2004) was inspired by Herbert Bayer’s \"universal alphabet\" created at the Bauhaus&nbsp;in 1927. &nbsp;While he admired Bayer’s pure geometry, Rotherham felt it was \"virtually unreadable.\" The Bauhaus-inspired inclination for architectural publications to use sans serif faces provoked Rotherham to consider how a readable Roman book face might be approached using some of Bayer’s same principles of simplification, but also retracing the evolution and use of the Roman form in an analytic manner.\n\nBruce Rotherham spent his formative years working at his father's commercial printing business and was tuned in to typography from an early age. The Wedge alphabet was started in 1947 when Rotherham was an architecture student at the University of Auckland. In 1958, after years of development and consultation with his father, who was a master printer, Rotherham approached Monotype to consider producing his typeface for commercial release. After some back and forth with Monotype advertising manager A.D.B. Jones and typographical advisor John Dreyfus, and despite trial proofs being made, the design was politely declined for being too much of a \"specialist face.\"  \n&nbsp;  \nRotherham continued to practice architecture in New Zealand and Great Britain for over thirty years. By chance, he heard the BBC radio show Science Now discussing the topic of computer typesetting. Not content to give up on Wedge, he contacted the item’s producer, Adrian Pickering, at the University of Southampton School of Electronics and Computer Science. Pickering worked closely in collaboration with Rotherham in the production of the digital version of the face. The type was shown posthumously for Rotherham in the 2009 exhibit Printing Types: New Zealand Type Design since 1870, held at Objectspace, in Auckland.  \n&nbsp;  \nWedge has only been mentioned briefly on typography sites on the Internet, but finding the full story on Rotherham's design had remained elusive. Over sixty years after it was first conceived, Wedge is now available from P22 along with Rotherham’s detailed documentation on the font’s development and rationale.\n\nThe full PDF rationale can be downloaded from the [Wedge](http://web.archive.org/web/20150322005656/https:/www.p22.com/family-Wedge) webpage where the fonts can also be purchased. [Wedge](http://web.archive.org/web/20150322005656/https:/www.p22.com/family-Wedge) is available at a 25% introductory discount through April 30th, 2014 on the [P22 website](http://web.archive.org/web/20150322005656/https:/www.p22.com/index).\n\nSee our [Behance](http://web.archive.org/web/20150322005656/https:/www.behance.net/gallery/Wedge-A-Font-by-Architect-Bruce-Rotherham/14719493) page for photos and more background info on the development of Wedge.\n\n[P22 Type Foundry](http://web.archive.org/web/20150322005656/https:/www.p22.com/index)\n\n",
  "author": "jimy",
  "time": "7 Apr 2014 — 8:09pm",
  "uid": "5133",
  "comments": [

  ]
}
