{
  "id": "115551",
  "title": "next.fontshop.com",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "We just published a public beta version of [fontshop](http://web.archive.org/web/20150321085934/http:/next.fontshop.com/) [. The commercial part still happens on the old fontshop.com site, so the new site is experimental to a degree. We welcome comments, opinions, even praise.](http://web.archive.org/)\n\n",
  "author": "eriks",
  "time": "6 Apr 2014 — 1:47pm",
  "uid": "1042",
  "comments": [
    {
      "time": "6 Apr 2014 — 2:24pm",
      "content": "I really enjoy and respect the bravery of doing a \"public beta\".\n\nhhp\n\n"
    },
    {
      "time": "6 Apr 2014 — 2:44pm",
      "content": "_Very_ iPad friendly! A joy to browse and read on my favourite user platform -- the couch.\n\n"
    },
    {
      "time": "6 Apr 2014 — 3:45pm",
      "content": "It’s also a good way to ask the future users.\n\n"
    },
    {
      "time": "7 Apr 2014 — 4:59am",
      "content": "I enjoy the return of the **designers section** which used to disappear from the former site.  \nThe **foundry section** is excellent because of the use of the related logos.  \nI appreciate the overall uncluttered layout of this new site which lightens the access to informations.  \nThe only weakness is the **family section** which does not feature the classification system—FontShop's trade mark: Sans, Serif, Slab Serif, Script, Graphic/Display, Blackletter.  \nGood luck.\n\n**[updated]**  \nI mistaken the **category section** by the **family section**. I went back to the old site to double-check.  \nThe **category section** is absent from the new site, by the way, hence the confusion.\n\n"
    },
    {
      "time": "7 Apr 2014 — 6:59am",
      "content": " **family section:** the family chart for [Suomi](http://web.archive.org/web/20150321085934/http:/next.fontshop.com/families/suomi-hand-script) lists Script and Handwritten as classification names, [FF DIN](http://web.archive.org/web/20150321085934/http:/next.fontshop.com/superfamilies/ff-din) FF DIN lists Sans and Grotesque. [FF Antithesis](http://web.archive.org/web/20150321085934/http:/next.fontshop.com/families/ff-antithesis) though, does not list any classification names. Maybe because it is too new and FontShop did not have time to key in the classification tags in their database?\n\nOr what do you mean by **‘family section’**?\n\n"
    },
    {
      "time": "7 Apr 2014 — 2:10am",
      "content": "I like it. you might want to have a look at :)\n\n ![](http://web.archive.org/web/20150321085934im_/http:/typophile.com/files/WHAT_3775.png)\n\n"
    },
    {
      "time": "7 Apr 2014 — 2:44am",
      "content": "Blooper!\n\n"
    },
    {
      "time": "7 Apr 2014 — 5:06am",
      "content": "To FontShop,\n\nDo you still sell the typefaces of Denis Dulude from 2Rebels?  \nI'm looking for _Thin Man_.  \nThanks in advance.\n\n"
    },
    {
      "time": "7 Apr 2014 — 7:11am",
      "content": "> The **category section** is absent from the new site, by the way, hence the confusion.\n\nfully agreed! The advantage of the category section is that one gets the possibility of accessing the library by _visual means_. Which on the old site got lost a bit on the second level, because many families appear several times. Also it was not possible to compare weights such as italics, condensed, extended, whatever between families. The FontBook app is better of course, but unfortunately lacks this kind of type browsing. I still miss a digital implementation of a ‘type browser’ like [Berthold E3 Headlines](http://web.archive.org/web/20150321085934/https:/www.flickr.com/photos/kupfers/8571656301/) or Photolettering’s One Line Manual of Styles. Or Photolettering’s [Alphabet Theasaurus](http://web.archive.org/web/20150321085934/https:/www.flickr.com/photos/nicksherman/8609661427). Books like these were rather expensive to produce and for the user, finding the right category was always a bit cumbersome. One had to go through the alphabetical index first or guess in which classification slot a particular typeface could be hiding. And the text in which the typefaces could be compared was of course fixed. This could be made so much better, faster and flexible today, but no one has really managed to come up with something that comes even close to these books.  \nI think this could be extremely useful when one is looking for a condensed text typeface for small text on packaging. Or a bold condensed sans for magazine headlines. I think that the lack of this sort of dedicated browsing is one of the reasons that unexperienced designers who are looking for a typeface for a claim or a brand name usually pick a far too informal script instead of an italic. As far as I know, there is simply no web based type browser (my fonts, monotype, linotype, anyone?) that allows a user to fast and easily compare similar italics with each other in the way one can compare scripts …\n\n"
    },
    {
      "time": "7 Apr 2014 — 8:51am",
      "content": "I remember that the directory site _Identifont_ allows to compare two typefaces.  \nGo to the upper **Tools section** and select the **Difference section**.  \n [http://www.identifont.com/differences.html](http://web.archive.org/web/20150321085934/http:/www.identifont.com/differences.html \"http://www.identifont.com/differences.html\")  \nAnd tell me if that fits your request.\n\n"
    },
    {
      "time": "7 Apr 2014 — 10:46am",
      "content": "I really like the new site...real web fonts in use, a responsive design, and lots of nice content to discover. [Gosh, I get design-geek shivers looking at nice web fonts on my mac w/ retina screen.] The only small suggestion I would make is to make your feature section on the homepage to have a little more structured grid on large screens. Currently, the content of each box has a lot of visual variety and seems to be a bit messy...where a bit more structure (quiet) would let each box wave its own flag rather than jostling with each other...\n\n"
    },
    {
      "time": "8 Apr 2014 — 1:23am",
      "content": "An interesting tool! Checked [FF DIN and DIN Next](http://web.archive.org/web/20150321085934/http:/www.identifont.com/differences?first=DIN&second=DIN+Next&q=Go) :–) It does not do what I expect from a digital type browser though. As a user, I either think I know what might be similar, or I do not know this yet. As a logical consequence, a digital type browser should primarily be able to show me what it thinks that is similar instead of asking me. In the case of this particular Identifont menue, I’d expect it to work it in a way that when I type / pick a name of a typeface I’d like to see in the left window, Identifont will present a range of fonts that I can klick through in the right window. The name field on top of the right window could be used to add fonts to Identifont’s choice, so that I can compare my own guess with that of Identifont.\n\n"
    },
    {
      "time": "9 Apr 2014 — 3:55am",
      "content": "When it comes to comparing typefaces, this is what I think a digital type browser should be able to do today:\n\n[https://www.flickr.com/photos/albert-jan\\_pool/sets/72157643691422283/](http://web.archive.org/web/20150321085934/https:/www.flickr.com/photos/albert-jan_pool/sets/72157643691422283/ \"https://www.flickr.com/photos/albert-jan\\_pool/sets/72157643691422283/\")  \nThe comment below the images is an extended version of what I wrote earlier here.\n\nThe FontFont browser is great too, but unfortunately there is no way of excluding italics or viewing italics only. [https://www.fontfont.com/fonts?sv=positive&sample=The+quick+brown+fox+ju...](http://web.archive.org/web/20150321085934/https:/www.fontfont.com/fonts?sv=positive&sample=The+quick+brown+fox+jumps+over+the+lazy+dog&ss=small#utf8=%E2%9C%93&has_stylecategory_2=1&weight=350%2C450&width=4%2C6&intended_use=9&sortorder=2 \"https://www.fontfont.com/fonts?sv=positive&sample=The+quick+brown+fox+jumps+over+the+lazy+dog&ss=small#utf8=%E2%9C%93&has\\_stylecategory\\_2=1&weight=350%2C450&width=4%2C6&intended\\_use=9&sortorder=2\")\n\n"
    },
    {
      "time": "9 Apr 2014 — 4:38pm",
      "content": "Your criteria concerning type browsing are valid and relevant.  \nIdentifont provides a very 'basic' tool to explain the type differences and it shows rapidly its internal limitations as you pointed it out.\n\nIf you're interesting in comparing the many designs of one single typeface,  \ntry the _Garamond_ comparing because it allows to witness the proportions:  \n [http://www.garamond.culture.fr/en/page/comparing\\_typefaces](http://web.archive.org/web/20150321085934/http:/www.garamond.culture.fr/en/page/comparing_typefaces \"http://www.garamond.culture.fr/en/page/comparing\\_typefaces\")\n\nSelect two interpretations  \nSelect the styles (Roman or Italic)  \nClick on a specific and idiosyncratic letter from the alphabet (Cf. \"a\", \"e\", \"P\", \"6\", \"9\")  \nClick on the 'Comparing typefaces' button\n\nYou obtain the template of type comparing.\n\n"
    }
  ]
}
