{
  "id": "115650",
  "title": "Why are designers scared of Zapfino?",
  "forum": "Script / Handwriting / Graffiti",
  "tags": [
    "Script / Handwriting / Graffiti",
    "Zapfno"
  ],
  "content": "Hello\n\nI recently got in to a heated discussion with a designer friend of mine, who believes \"Zapfino\" can never be used in graphic design or art to produce \"amazing\" work.\n\nI personally think typefaces are like tools, each with a spectrum of uses or applicable scenarios. Some typefaces have a wide spectrum of uses while some have a much narrower window. I think to suggest that a typeface can never be used to produce beautiful work is underestimating human creativity and the infinity of creative possibilities.\n\nI have tried to find examples of Zapfino used amazingly but have not managed the knock-out punch. I would greatly appreciate help in locating these.\n\nPlus what do you guys think about this debate in general.  \nIts my first time here so be nice. Thank you.\n\n",
  "author": "OEdada",
  "time": "9 Apr 2014 — 9:53am",
  "uid": "219072",
  "comments": [
    {
      "time": "9 Apr 2014 — 1:14pm",
      "content": "My guess is that most designers would shirk from using it not because the typeface itself is bad – but because it's a common typeface found on consumer computers, and thus is used in endless amateur publications. Combined with its distinctive looks, this has the unfortunate and rather unfair effect of _making it associated with_ amateurism; all typeface \"meanings\" are, of course, socially contructed, and this would play into that.\n\nZapfino is certainly not the only good typeface that's underused for this reason.\n\n"
    },
    {
      "time": "9 Apr 2014 — 1:21pm",
      "content": "PS. This forum is for critiquing typeface designs, not typographical queries. You'd be better served in the General Discussions section.\n\n"
    },
    {
      "time": "10 Apr 2014 — 3:00am",
      "content": "thanks for your response @birdseeding and way finding help. I will promptly change the location.\n\n"
    }
  ]
}
