{
  "id": "115779",
  "title": "Typeface Classifications",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi All,\n\nI am putting a small guide together for non-designer types to explain the different categories of typefaces.\n\nAs you know this categorisation can go on and on, but I want to keep it as concise as possible without being incorrect.\n\nSo far I have:\n\nSERIF  \n- Old Style  \n- Transitional  \n- Modern  \n- Slab\n\nSANS SERIF  \n- Grotesque  \n- Neo-grotesque  \n- Humanistic  \n- Geometric\n\nSCRIPT  \n- Formal  \n- Casual\n\nNow this is where it gets tricky - do I list Blackletter, Mono Spaced, Decorative, Symbol etc. separately or try and classify them all under one category: Display.\n\nOverall - Is there a better way of doing this classification?\n\nAny help on this would be much appreciated\n\nThanks,  \nS\n\n",
  "author": "mrpink",
  "time": "15 Apr 2014 — 3:16am",
  "uid": "17777",
  "comments": [
    {
      "time": "15 Apr 2014 — 7:09am",
      "content": "Since you aim for correctness, refer to the Vox standard. You can find more about it by doing a Google search for it using these keywords: vox typeface classification.\n\n"
    },
    {
      "time": "15 Apr 2014 — 10:52am",
      "content": "The Serif category has a total of five groups:  \nVenetian (Jenson)  \nOld Style (Garamond)  \nTransitional (Baskerville)  \nModern (Didot)  \nSlab Serif (Clarendon)\n\nAnd amongst the Old Style group, you've got  \nItalian Old Style (Manuce)  \nFrench Old Style (Garamont/Granjon)  \nBelgium Old Style (Plantin/Van Den Keere)  \nGerman Old Style (Sabon)  \nDutch Old Style (Van Dijck/Kis)  \nEnglish Old Style (Caslon)\n\nAnd amongst Blackletter, you've got a wide range of styles: Old French, Old English, Textura, Rotunda, Bastarda, Schwabacher, Fraktur, Granjon's Civilités, and others. Enough said.\n\n"
    },
    {
      "time": "15 Apr 2014 — 2:20pm",
      "content": "@Fournier: German Old Style (Sabon) ?\n\nSabon was designed by Jan Tschicold in 1960s. The roman modelled on Garamond and the italic on Granjon.\n\n"
    },
    {
      "time": "15 Apr 2014 — 4:29pm",
      "content": "Jacques Sabon worked in Frankfurt for Christian Egenolff in the last part of the XVI th century.\n\n"
    },
    {
      "time": "15 Apr 2014 — 4:45pm",
      "content": "\\> Now this is where it gets tricky - do I list Blackletter, Mono Spaced,  \n\\> Decorative, Symbol etc. separately or try and classify them  \n\\> all under one category: Display.\n\nMonospaced is a synonym for mechanical typewriter, computer-typewriter, OCR.  \nDecorative is a vague notion that integrates many styles and artistical movements.  \nSymbol is synonym for pictogram.  \nWhen it comes to Blackletter, it fits the calligraphy category and this calligraphy category integrates the scripts: French (XVII th century) and English (XVII and XVIII th century) scripts that you call formal scripts. Casual script is identical to graphic type.\n\n"
    },
    {
      "time": "15 Apr 2014 — 4:49pm",
      "content": "OK, but even so, the types he cut were undoubtedly of the french persuasion, nothing particularly 'Germanic' going on here?\n\n"
    },
    {
      "time": "15 Apr 2014 — 4:59pm",
      "content": "Except that Sabon adapted the French design for the German sensitivity.  \nLike Plantin did in Anterwep.\n\n"
    },
    {
      "time": "15 Apr 2014 — 5:07pm",
      "content": "Well, you can add Latin (wedge serif), and divide Slab into Clarendons and Egyptians.\n\n"
    },
    {
      "time": "15 Apr 2014 — 5:10pm",
      "content": "Could you point me to an example specimen or scan so that I might better understand this assertion?\n\n"
    },
    {
      "time": "15 Apr 2014 — 6:13pm",
      "content": "While this is a worthy endeavor, it may end in frustration if the target audience is non-designer types. In my experience, you can show laypeople the difference between serif, sans-serif, and script, but if you try to break it down any finer than that, they glaze over as I do when a birder wants to explain to me about the fifteen kinds of finches in the Galapagos Islands.\n\n"
    },
    {
      "time": "15 Apr 2014 — 6:28pm",
      "content": "Unfortunately, I can't. I don't have the documents with me.\n\n"
    },
    {
      "time": "15 Apr 2014 — 7:43pm",
      "content": "Or you can go the Bringhurst route and refer to typefaces by the reigning visual art movement under which they were designed, which I have to say makes a whole lot more sense to me than random made-up terms like \"oldstyle.\" True, the Bringhurst way doesn't tell you whether a postmodern face, say, is a serif or sans, but once you've established the general category into which a face falls (serif, sans, script, blackletter …) the art-movement method seems to be the clearest way of further specifying a style.\n\n"
    },
    {
      "time": "16 Apr 2014 — 2:36am",
      "content": "I think Victor and Joshua's comments are the most useful criteria for a font classification \"for non-designer types.\" To see a fairly good model take a look at how Dafont classifies its fonts by themes. [http://www.dafont.com/themes.php](http://web.archive.org/web/20140803124755/http:/www.dafont.com/themes.php \"http://www.dafont.com/themes.php\") This is truly \"font classification for dummies\" and works quite well at matching people with the kind of font they are seeking. If this is too detailed, just lump some groups together.  \nDon\n\n"
    },
    {
      "time": "16 Apr 2014 — 3:07am",
      "content": "‘the art-movement method seems to be the clearest way of further specifying a style.’\n\nI do not think that the ‘art movement method’ really works. Shure one can link some obvious classes of display typefaces to them, but not all of them. Also, the ‘art movement method’ denies the fact that both art and typefaces design recycle the works from their own movements. And they do not do it the same way and in the same period. Also, art movements and typeface design are both international, but their paths through history are not always the same. Just as it is difficult for laymen to be able to tell the difference between impressionism and expressionism it will be difficult to explain to them why FF Meta can be considered to be a post-modern sans. I read Bringhurst with great pleasure but I think his approach to typeface classification is rather romantic. People look at forms without knowing where they come from or what they may be good for, typeface designers create forms. The most direct way to connect these two should be visual. All other means are nice to have extras. They may be good for various reasons, but when they play the first role, they are rather obfuscating than making things clearer. I consider the Vox terminology is one of the best examples of a terminology which obfuscates things to the non-expert user.\n\n"
    }
  ]
}
