{
  "id": "115701",
  "title": "What Size is a Point Anyways?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Some references state that the size of a printer's point in the English-speaking world was defined in 1886 on the basis of 83 picas being equal to 30 centimeters.\n\nOther sources state that while this was one of the proposals considered, the one actually adopted was the Johnson pica, which based the point on 1/72nd of 249/250ths of the British inch, not the American one, which still differed at the time.\n\nNeither of these standards, though, equal 0.013837 inches, which many sources give as the official printer's point.\n\nI've seen only one place on the Web acknowledging this discrepancy: a conversion table from Circuitous Root, which credits ATF with the modern printer's point as of 1902.\n\n",
  "author": "quadibloc",
  "time": "11 Apr 2014 — 6:30am",
  "uid": "50554",
  "comments": [
    {
      "time": "11 Apr 2014 — 8:29am",
      "content": "If you look at an old Haberule, an artifact of the Linotype/Monotype days,\n\n ![](http://web.archive.org/web/20140710102405im_/http:/typophile.com/files/haberule_4521.jpg)\n  \nyou can see that 60 picas (720 points) is visibly shorter than 10 inches, I suppose because of the 19th-Century difference between the British inch and the American inch.  \nWhen desktop publishing software was developed in the 1980s, it was designed to allow users to switch units of measurement from inches to picas and back again, with the point defined as _exactly_ 1/72 of a U.S. inch, which has become the new standard. \n"
    },
    {
      "time": "11 Apr 2014 — 9:55am",
      "content": "The British and American inches were different up until 1964 (some sources give a date in the 1950s), and this has nothing to do with the size of the point, which is smaller than 1/72 of either inch.\n\n"
    },
    {
      "time": "11 Apr 2014 — 12:00pm",
      "content": "It's all here: http://en.wikipedia.org/wiki/Point\\_(typography)\n\n"
    },
    {
      "time": "11 Apr 2014 — 8:33pm",
      "content": "I see that 0.013837 is given there as the Nelson C. Hawks point. But is that point therefore wrong, having been superseded, even though so many sources give it as the value?\n\nOn my page,\n\n[http://www.quadibloc.com/other/cnv01.htm](http://web.archive.org/web/20140710102405/http:/www.quadibloc.com/other/cnv01.htm)\n\nyou can see my thinking on this.\n\nI believe the sources that say Nelson C. Hawks' point was either 0.0138\" or exactly 1/72\", because he was the first person to propose the point system. It's a natural error to attribute the final point size of 0.013837\" to the first person in America to propose using a point system. (Attributing it to Fournier or Didot, though, is a harder mistake to make, as there's well-known history in between.)\n\nSince the sources I've found on the web don't even agree on whether the 83 picas to 35 centimeters point, or the 249/250 of a survey foot point won out at the meeting in 1886, and that meeting is very obscure, skipping over it doesn't surprise me.\n\nWait - 249/250 is 0.4% smaller than unity, not 0.325% or 0.375% smaller - maybe I've been fooled by a typo, and the Johnson pica is the right size...\n\nLegros and Grant claim in Typographical Printing-Surfaces that indeed the point of MacKellar, Smiths and Jordan, accepted as the standard in the 1886 meeting, held in Niagara, was the modern 0.013837\" foundry point. This is at least plausible, even if it requires Wikipedia to be wrong.\n\n"
    }
  ]
}
