{
  "id": "115789",
  "title": "The Definition of Engraver?",
  "forum": "General Discussions",
  "tags": [
    "engraver",
    "General Discussions"
  ],
  "content": "Engraved letters were produced in the last third of the XIX th century for display purposes.  \nIn the early XX th century, type designers fashioned hot metal typefaces based on these letters.  \nMorris Fuller Benton, Frederic Goudy, Robert Wiebking, among others.\n\nHow do you define these letters in terms of style and how do you explain their many social uses throughout decades and centuries?  \nYour interpretation is needed…\n\n",
  "author": "Fournier",
  "time": "15 Apr 2014 — 11:01am",
  "uid": "212885",
  "comments": [
    {
      "time": "15 Apr 2014 — 2:59pm",
      "content": "OK I'll kick this off with some simple stuff.  \nThe rise of lithography, with its ability to print finely detailed lettering was a real challenge to the makers of typefaces. As type-making techniques improved type-makers were increasingly able to approach the detail of lithography and win back some the advertisers who had abandoned type in favor of lithographed ads.  \nI suggest that the adoption by type foundries of the technique of shading part of the letter to mimic the work of an engraver on metal or an incised letter in stone was part of this effort.  \nWhat would be interesting would be to identify the first use of this technique. I don't know off hand if this was a late 19th century innovation, or whether it dates back to the 18th century or earlier. Any info from our type historians?  \nDon\n\n"
    },
    {
      "time": "15 Apr 2014 — 4:21pm",
      "content": "Your input is interesting.  \nWhat I noticed is that the hot metal type equivalents of the engraved letters are encapsulated by an exaggerated transitional type by Benton, an incised copper type by Goudy and a wide and square gothic by the Inland Type Foundry.  \nThe first use of these letters is sign display for shops and artisans. But it changes throughout the XX th century.\n\n"
    },
    {
      "time": "16 Apr 2014 — 2:50am",
      "content": "Dear Fournier,\n\nthe engraved letters by Laurent et Deberny on their ‘Feuille de lettres d’affiches’ are from 1837:  \n [https://www.flickr.com/photos/36088795@N03/5801922724/](http://web.archive.org/web/20140803004500/https:/www.flickr.com/photos/36088795@N03/5801922724/ \"https://www.flickr.com/photos/36088795@N03/5801922724/\")  \nDepending on which kind of letters you define as ‘engraved’ (outline, outline filled with patterns of parallel lines, outlines filled with ornamental structures or elements) there are many more examples of letterpress typefaces that are older than that. Some of them are older than Senefelders first lithographic prints (1797). The book ‘Type – A visual history of Typefaces and Graphic Styles, Volume 1, 1628 – 1900 by de Jong, Purvis and Tolenaar, Taschen 2009 could be good and well documented starting point for an investigation on where to find such examples. The idea of filling an outline with an engraved pattern is not bound to letterpress or lithography though. You’ll find some engraved letters in George Bickham’s Universal Penman from 1843 too, and that’s copperplate engraved writing and lettering.\n\n"
    },
    {
      "time": "16 Apr 2014 — 3:35am",
      "content": "I think that you will find many example of ‘engraved’ letters amongst the initials as can be found in letterpress printed printed books from the 16th century:  \n [https://www.flickr.com/photos/bookhistorian/](http://web.archive.org/web/20140803004500/https:/www.flickr.com/photos/bookhistorian/ \"https://www.flickr.com/photos/bookhistorian/\")  \nThis book here seems to have been printed in Milano in 1514. It shows initials with patterns of parallel engraved lines:  \n [https://www.flickr.com/photos/bookhistorian/sets/72157634023958756/with/...](http://web.archive.org/web/20140803004500/https:/www.flickr.com/photos/bookhistorian/sets/72157634023958756/with/8995866410/ \"https://www.flickr.com/photos/bookhistorian/sets/72157634023958756/with/8995866410/\")  \nIt seems that these initials were usually cut in wood, but one would have to take a closer look to find out what it is that we are looking at in this case.  \nBut I think, that these initials started their life as letterpress-equivalents to the illuminated initials of the written books from before that time:  \n [https://www.flickr.com/photos/e-codices/](http://web.archive.org/web/20140803004500/https:/www.flickr.com/photos/e-codices/ \"https://www.flickr.com/photos/e-codices/\")  \nSeveral book and printing historians claim that the first printed books were sold with blank spaces on the positions where one would expect illuminated initials. This would at least explain that some libraries have books with those blank spaces in their collections. The idea was that the buyer would have the initials added by an artist of his choice, just as the buyer would go to a bookbinder to have the book bound according to his demands. After the printers found out that many of their customers did not have their books illuminated anymore, they came up with letterpress initials.\n\n"
    },
    {
      "time": "16 Apr 2014 — 4:54am",
      "content": "Dear Albert,\n\nYour input is fascinating because of the chronology of early examples. Thanks again.  \nBut I'm focused on the case of type designers of the early XX th century attempting to reproduce the late XIX th century engraved letters. Find some 'blatant' examples:  \n_Blair_ (1900)  \n_Monotype Engravers_ (1902)\n\n"
    },
    {
      "time": "16 Apr 2014 — 6:43am",
      "content": "I think I see what you mean now. Many foundries rather tried to keep up with trends in lettering and in engraving than initiating these themselves. I do not think that we can generalize this though. Especially when it comes to the point where one wants to find out who initiated a particular style, it will be difficult to trace back wether the hen or the egg was around first. I would not know what sources the Inland Foundry used to create their typeface Blair in 1900.  \n [http://dailytypespecimen.com/image/33012533820](http://web.archive.org/web/20140803004500/http:/dailytypespecimen.com/image/33012533820 \"http://dailytypespecimen.com/image/33012533820\") but I am sure there are several other foundries which had such a typeface way before that time. The same is probably true for Monotype Engravers. Business Cards and letterheads were not the typical jobs one would use a complicated and expensive machine like that of Monotype or Linotype for. Especially in their early years both companies were busy with adapting text typefaces for their machines. Foundry type was their main source of inspiration. They did some typefaces for headlines as well, but theses were intended for use on title pages of books and smaller head- und sublimes in newspapers or as headings in classified ads.\n\n"
    },
    {
      "time": "16 Apr 2014 — 2:41pm",
      "content": "Perhaps thermography has something to do with this.  \nIn it, powder is mixed into the ink, which swells and sets once heat is applied, after the job has been printed.  \nSo, by using a “copperplate” style, one may inexpensively imitate proper engraving, with either letterpress or offset lithography.\n\nI know nothing of the history of this process, having become familiar with it in the 1970s.  \nI found that Souvenir looked quite good with thermography, but I didn’t attempt to imitate the classic engraving look.\n\nThe “minting” of Copperplate Gothic may well have been intended to counteract the loss of sharpness that occurred in non-engraving typography.\n\n"
    },
    {
      "time": "16 Apr 2014 — 3:31pm",
      "content": "One important detail. I don’t think I ever saw l.c. letters in those ‘imitation-engraving’ faces so popular with the stationery and ephemera prnters. Somehow, they were always all-cap (‘titling‘), or c&sc fonts. Also, calligraphic styles were among those typefaces, and they sure did have lower case.\n\n ![](http://web.archive.org/web/20140803004500im_/http:/typophile.com/files/Copperplate_5228.jpg)\n\n"
    },
    {
      "time": "17 Apr 2014 — 3:57am",
      "content": "Dear Maxim, thanks for illuminating this thread with a properly embedded image!\n\nWhen it comes to Copperplate Script, I have seen many uses of it on letterheads. Maybe it was less used on business cards. Perhaps too female for businessmen? I recall having seen it on the small letterpress printed cards that parents used to send in celebration of the birth of a child though (What’s the proper english term for that?). I’ll look for these in the family albums next time I visit my parents.\n\nWhen it comes to Copperplate Script, we have to remind that it is what it says: A script engraved in copperplate. The copperplate engravers reproduced (their own) handwriting. But not only the italics one may write with the pointed flexible nib. In Bickhams Universal Penman you’ll also find fine examples of the English Court Hand, Blackletter as well as lower case letters matching the capitals of ‘Engravers Roman’. Which is way before Baskerville, Didot and Bodoni reproduced that kind of letters as printing types.\n\n[http://upload.wikimedia.org/wikipedia/commons/8/81/Bickham-ABC.png](http://web.archive.org/web/20140803004500/http:/upload.wikimedia.org/wikipedia/commons/8/81/Bickham-ABC.png \"http://upload.wikimedia.org/wikipedia/commons/8/81/Bickham-ABC.png\")\n\nTake a close look at the last four letters in the sentence ‘Engrav’d by George Bickham Senr.’ and you’ll see what I mean. Note that Bickham is a rather late example.\n\n"
    },
    {
      "time": "17 Apr 2014 — 5:02am",
      "content": "Two reasons to back in history again:\n\nNicolas Jarry was of the greatest French calligraphers of his time. Take a close look at his roman lower case letters. This was done 80 years before Bickham.  \n [http://digitalcollections.nypl.org/items/510d47da-e952-a3d9-e040-e00a180...](http://web.archive.org/web/20140803004500/http:/digitalcollections.nypl.org/items/510d47da-e952-a3d9-e040-e00a18064a99 \"http://digitalcollections.nypl.org/items/510d47da-e952-a3d9-e040-e00a18064a99\")\n\nThe second reason is the ‘thermoprint effect’. Jarry’s calligraphy probably does not show that much relief as with thermoprint or letterpress. But his guilded letters surely did …\n\n[http://www.christies.com/lotfinder/books-manuscripts/bailly-jacques-and-...](http://web.archive.org/web/20140803004500/http:/www.christies.com/lotfinder/books-manuscripts/bailly-jacques-and-jarry-nicolas-5662584-details.aspx \"http://www.christies.com/lotfinder/books-manuscripts/bailly-jacques-and-jarry-nicolas-5662584-details.aspx\")\n\nNote the resemblance of Nicolas Jarry’s calligraphy with the Roman du Roi and that he wrote these pages roughly 30 years before the committee of the Académie des Sciences started to work on the Romain du Roi.\n\n"
    },
    {
      "time": "17 Apr 2014 — 8:26am",
      "content": "I think they call it a 'baby shower'.\n\n"
    },
    {
      "time": "17 Apr 2014 — 10:35am",
      "content": "The subject of thermography came up in another thread too. Although it creates raised ink, in the examples I've seen it produces a rough ink surface that's not as nice as real engraving. But it has the advantage of being much less expensive.\n\n ![](http://web.archive.org/web/20140803004500im_/http:/typophile.com/files/thermography3_6618.jpg)\n\n"
    }
  ]
}
