{
  "id": "115829",
  "title": "Chile's World Tour: Basafu hope will lead into 16",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "as participated in the inaugural World Cup in 1930, one of 13 teams, only one Chilean history record of consecutive World Cup,http://www.fifa4coins.com/ and after successfully reached the World Cup finals in Brazil, Chile, the team was finally able to 2nd consecutive appeared in the World Cup. Team profile: Chile is a traditional South American teams, the team had eight times in the history of the World Cup. Chile coach is 53-year-old Argentine Sam Poly, led by Chile's National University after the team won three league championship trophy, he was December 3, 2012 in charge of the Chilean national team began pointer. Sam Poly took over the team in the South American qualifiers before Chiang Kai-shek suffered three straight, he commanded the first World Cup despite 0-1 loss to Peru, but then 6 has 5 wins and 1 unbeaten team also successfully gained promotion eligibility. History appears: Due South American qualifying tournament is very special, all applicants must each team playing two rounds of the tournament clash, so Chile in their first World Cup qualifier back in October 2011 had already started, but they Argentina 1-4 on the road but was massacred, and the second cycle to the home of Chile defeated Peru 4-2 to get the three points, but the first three on the road they lost to the other enemies Uruguay 0-4 from the first four beat Paraguay 2-0 start, Chile ho to take qualifying three-game winning streak, but three victories seemed to have run out of luck in Chile, from the first eight starts first in the 1-3 home defeat to Chile, Colombia, and subsequently 1-3 away defeat to Ecuador in the first 10 home encounters Argentina, Chile and the strength of incompetence by opponents 1-2 double play, first to 11 guest Peru, Chile Youyi score 0-1 defeat. 4-game losing streak all the way down in the standings in Chile, the team qualify for the World Cup prospects in jeopardy. Turning point arrived in December 2012, replacing the poor record of the Chilean team coach, coaching, such as tool change, from the beginning of this year, on March 26, Chile's first 2-0 defeat at home to the poor state of Uruguay, then in defeated Paraguay 2-1, 14 and 15, Chile has 3-1 and 3-0 at home to win over Bolivia and Venezuela, the first 17 on the road despite being 3-3 draw with Colombia, but in the end round and a direct competitor in the battle, Ecuador, Chile fulfill the mission home game 2-1 defeat opponents, they are also able to score the third in South America directly qualify for the World Cup finals. Core players: the core players and the team's top star in Chile, nature is playing for Barcelona Sanchez, now he has been capped 64 times into 22 balls, the number of active players is up to his goal , but only less than 15 goals top scorer in the history of the Chilean team Salas on next year's World Cup in Brazil, Sanchez's decision to play will be the key to the team can go far. Entry History: The first World Cup in 1930, the Chilean team 2 wins and 1 stop at the first round of the World Cup again in 1950, a Chilean team wins and 2 losses still to be eliminated in the first round. 1962 World Cup in Chile native, the team achieved its best performance of the first three, but then the 1966, 1974 and 1982, this third World Cup, crashed out of the group stage all the Chilean team. 1998 World Cup in France, Chile, for the first time outside the home team finally advance to the last 16, 2010 World Cup in South Africa, they are re-entering the elimination round, and in the World Cup in Brazil, Chile goal will be to continue this success. (Anckie)\n\n",
  "author": "elgjerg253",
  "time": "16 Apr 2014 — 10:40pm",
  "uid": "219332",
  "comments": [

  ]
}
