{
  "id": "115820",
  "title": "Fraktur Anatomy ?",
  "forum": "Blackletter",
  "tags": [
    "anatomy",
    "fraktur",
    "Blackletter"
  ],
  "content": "Can anyone point me to good soars for Fraktur Anatomy ?\n\n",
  "author": "RAWTYPE",
  "time": "16 Apr 2014 — 2:37pm",
  "uid": "3187",
  "comments": [
    {
      "time": "16 Apr 2014 — 6:29pm",
      "content": "Sources for Fraktur Anatomy ?\n\n;)\n\n"
    },
    {
      "time": "16 Apr 2014 — 8:24pm",
      "content": "The only one that pops in my head is Albrecht Dürer's (which you can google). It's possible that Rudolf Koch had done something too.\n\nhhp\n\n"
    },
    {
      "time": "17 Apr 2014 — 2:14am",
      "content": "When talking about ‘Fraktur’ one has to distinguish between Textura, which has an interrupted construction and Fraktur, which has a running construction. Dürers geometrical constructions rather refer to the Textura than to the Fraktur. I do not know what is written on this spanish website here, but the first illustration shows Neudörffers Fraktur and the second and the third show Dürers Textura.\n\nDürer worked with Neudörffer on this remarkable piece of work here.  \n [http://upload.wikimedia.org/wikipedia/commons/0/02/Ehrenpforte.jpg](http://web.archive.org/web/20150317075036/http:/upload.wikimedia.org/wikipedia/commons/0/02/Ehrenpforte.jpg \"http://upload.wikimedia.org/wikipedia/commons/0/02/Ehrenpforte.jpg\")  \nFor a couloured image which also gives an impression of the real size, check this link  \n [http://www.dw.de/superstar-albrecht-d%C3%BCrer/a-17178335](http://web.archive.org/web/20150317075036/http:/www.dw.de/superstar-albrecht-d%C3%BCrer/a-17178335 \"http://www.dw.de/superstar-albrecht-d%C3%BCrer/a-17178335\")  \nand klick on the image next to ‘Ein comic für den Kaiser’  \nIt is one of the largest objects that has been assembled from wood prints. The Fraktur on the lowest row of 5 panels has been written by Neudörffer on the wood blocks before it was cut. At least this is what thorough research by Werner Doede (20th century) and Oliver Linke (21st century) has proven. The meaning of Neudörffer for the development of the Fraktur as a writing style (Neudörffer published several writing manuals) and printing type (The typeface by Hyeronimus Andreä is based on Neudörffers handwriting) is both discussed in the literature by Oliver Linke and Gerrit Noordzij. Schematically speaking, the difference between Textura and Fraktur can be illustrated like this:  \n [https://www.flickr.com/photos/albert-jan\\_pool/11468753126/in/set-7215762...](http://web.archive.org/web/20150317075036/https:/www.flickr.com/photos/albert-jan_pool/11468753126/in/set-72157629679838154 \"https://www.flickr.com/photos/albert-jan\\_pool/11468753126/in/set-72157629679838154\")  \nPlease read my comments on the image at Flickr for more information on that subject.\n\nRudolf Koch is an interesting source too, but his view on the subject is rather romantic and is closely connected with the attempts to re-establish what was called then ‘Deutsche Schrift’ (German letters) during the first half of the 20th century in Germany.\n\n"
    },
    {
      "time": "17 Apr 2014 — 2:10am",
      "content": "double post … sorry!\n\n"
    },
    {
      "time": "21 Apr 2014 — 7:04am",
      "content": "Thank you\n\n"
    },
    {
      "time": "24 Apr 2014 — 9:15am",
      "content": "That was very enlightening, thank you for sharing!\n\n"
    }
  ]
}
