{
  "id": "115861",
  "title": "Italian espresso typography",
  "forum": "General Discussions",
  "tags": [
    "Coffee",
    "connecting",
    "Espresso",
    "Futurism",
    "General Discussions",
    "Italian",
    "Italy",
    "letterforms",
    "machine",
    "script",
    "type"
  ],
  "content": "I am currently working on a project to identify a kind or style of typography that is used for a specific application or has a cultural association. I am working with the use of interlocking or connecting letterforms and scripts that often appear in Italian industrial design but specifically on espresso machines.\n\nI have begun my research and found some interesting information on the history of espresso machines in Italy. I have also looked into some of the books by Louise Fili about Italian typography/scripts. However I am still looking for more information and thought to cast a wider net. I have plenty of examples but am now looking for articles and writing that discuss this topic or topics close to it. I am trying to figure out where this trend comes from. Is it related to Italian futurism? Is it mostly to do with the ease of construction for the metal nameplates?\n\nI did find a foundry called [Holiday Type](http://web.archive.org/web/20150420164319/http:/holidaytype.com/) that has revived or created typefaces that are reminiscent of the style I am talking about. I am having trouble finding out who is behind their designs though? Does anyone know who is the creator of these fonts? I wrote to Dharma Type, but does anyone know if they are behind the designs? I thought the creator might be of help.\n\nI am also wondering if these kinds of scripts have a specific name or term.\n\nI know this is vague, but I so appreciate any help, resources or insight. I have been doing quite a bit of research but just thought asking a larger and more educated community might help me find some new avenues to explore.\n\nThanks again!\n\n| Attachment | Size |\n| --- | --- |\n| [tumblr\\_lv19u2SQ8c1qzmdqso1\\_500.jpg](http://web.archive.org/web/20150420164319/http:/typophile.com/files/tumblr_lv19u2SQ8c1qzmdqso1_500_0.jpg) | 92.21 KB |\n| [tumblr\\_luwujlJ2GV1qzmdqso1\\_500.jpg](http://web.archive.org/web/20150420164319/http:/typophile.com/files/tumblr_luwujlJ2GV1qzmdqso1_500_0.jpg) | 124.63 KB |\n| [Screen Shot 2014-04-17 at 11.26.43 PM.png](http://web.archive.org/web/20150420164319/http:/typophile.com/files/Screen%20Shot%202014-04-17%20at%2011.26.43%20PM_0.png) | 23.78 KB |\n| [Screen Shot 2014-04-17 at 11.25.36 PM.png](http://web.archive.org/web/20150420164319/http:/typophile.com/files/Screen%20Shot%202014-04-17%20at%2011.25.36%20PM_0.png) | 34.7 KB |\n\n",
  "author": "baconpress",
  "time": "17 Apr 2014 — 11:32pm",
  "uid": "18346",
  "comments": [
    {
      "time": "18 Apr 2014 — 9:18am",
      "content": "I think this is probably what you're looking for:  \n [http://opentype.info/blog/2011/10/16/hooptie-script-typefaces-of-the-mot...](http://web.archive.org/web/20150420164319/http:/opentype.info/blog/2011/10/16/hooptie-script-typefaces-of-the-motor-city/ \"http://opentype.info/blog/2011/10/16/hooptie-script-typefaces-of-the-motor-city/\")\n\n"
    },
    {
      "time": "18 Apr 2014 — 9:00pm",
      "content": "Thanks, that is really helpful! I keep hoping I am going to find something that relates this kind of typeface to Italy, but I might be searching for something that does not exist.\n\nRyoichi Tsunekawa from Dharma Type did write me back and gave me some useful information about his set of fonts, and they were mostly inspired by Italian signage during a vacation he took in Naples.\n\n"
    },
    {
      "time": "21 Apr 2014 — 8:49am",
      "content": "You might want to look a this too:  \n [http://www.myfonts.com/users/ubjduiig5y/albums/725723/](http://web.archive.org/web/20150420164319/http:/www.myfonts.com/users/ubjduiig5y/albums/725723/ \"http://www.myfonts.com/users/ubjduiig5y/albums/725723/\")  \nThe Chromeography link on the same page has nice pics too.  \n\"chrome scripts\" and \"connected scripts\" are probably the terms you want to web search for.\n\n"
    },
    {
      "time": "21 Apr 2014 — 6:25pm",
      "content": "Very helpful, thanks so much! I wrote to Mark Simonson and he mentioned Chromography as well and recommended writing Stephen Coles. Have been able to find some more research, but could still use some more specific information. Really appreciate your help.\n\n"
    }
  ]
}
