{
  "id": "115876",
  "title": "Matthew Carter at TEDtalks",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "matthew carter"
  ],
  "content": "Always delightful!  \n [Matthew Carter: My life in typefaces (video)](http://web.archive.org/web/20140712110308/http:/typophile.com/wiki/https%3A/%252Fwww.youtube.com/watch%3Fv%3DxjxyEwjG2Es)\n\np.s. have nice Easter break everyone.\n\n",
  "author": "sevag",
  "time": "18 Apr 2014 — 2:40pm",
  "uid": "77053",
  "comments": [
    {
      "time": "18 Apr 2014 — 3:31pm",
      "content": "Here is the original talk (on the TED site)\n\n[https://www.ted.com/talks/matthew\\_carter\\_my\\_life\\_in\\_typefaces](http://web.archive.org/web/20140712110308/https:/www.ted.com/talks/matthew_carter_my_life_in_typefaces)\n\n"
    },
    {
      "time": "20 Apr 2014 — 1:27am",
      "content": "I viewed the video. One thing surprised me: when I hear of an 18 unit system, I think of Monotype. And with Monotype, different typefaces had a parameter called \"set width\": that is, you could have an 18 point typeface, but 18 units could equal an 18 point em or a 17 ¾ point em, or a 17 ½ point em, or a 17 ¼ point em, or a 17 point em, and so on. (The phrasing is because a distance of 18 points across is normally called two-thirds of a pica em, or an 18 point em, since in typography the point is strictly a unit of vertical distance.)\n\nSince the 18 unit system of the phototypesetting system Matthew Carter worked on limited how he could create intermediate versions of a typeface intended to have multiple condensed forms, apparently it didn't retain this feature of Monotype.\n\nHowever, this is not _too_ surprising. Since most phototypesetting systems used magnification to get different point sizes, the different point sizes of a typeface weren't designed individually. As soon as set width doesn't equal point size, you wind up either with having to design each point size individually (since 17/18 doesn't exactly equal 15/16 and so on) or having to use anamorphic lenses. Many phototypesetting systems did have anamorphic lenses, but compensating for a set width offset would have required complicated cams.\n\n"
    }
  ]
}
