{
  "id": "115990",
  "title": "Interesting but formal sans serif fonts for long body copy",
  "forum": "General Discussions",
  "tags": [
    "#newtypeface #sanserif #useable",
    "General Discussions"
  ],
  "content": "Hi all,\n\nI am new to the forums and hoping to get some much needed advice.\n\nI am in the business of writing formal reports that convince the reader of a particular argument - much like a lawyer just not as ultra formal. I currently use Calibri but I have decided to search for a different sans serif font as I have read that system fonts are generally poorly designed.\n\nI seek a sans serif font which is versatile enough to be used on screen and in print whilst holding the readers attention and maintaining legibility over long body copy. I would like a sans serif font that is interesting but maintains a certain degree of formality so as to remain credible.\n\nI came across MVB Solitaire which seems to have had good reviews. I would greatly welcome any other suggestions from the community.\n\nYour advice is very much appreciated.\n\nMany thanks\n\n",
  "author": "bhamx2",
  "time": "23 Apr 2014 — 6:09am",
  "uid": "219519",
  "comments": [
    {
      "time": "23 Apr 2014 — 6:49am",
      "content": "Calibri was done by Lucas de Groot and is not poorly designed and not all system fonts are generally poorly designed, that said, most are over used and finding a new font for your work output would set it apart from the \"ordinary\". MVB Solitaire is an interesting font and would give your output a nice new look.\n\n"
    },
    {
      "time": "23 Apr 2014 — 9:13am",
      "content": "Bojev, thank you for the reply.\n\nI must admit that I don't dislike Calibri, however, as you say, setting my work apart from the ordinary is desirable.\n\nCould you recommend any alternatives to MVB Solitaire that would be worth considering ? To elaborate I am looking at redesigning my company's document framework (I have taken some pointers from Matthew Butterick's Practical Typography to try and enhance readability) and the last piece of the puzzle seems to be the font. Cost may be an issue so although paid professional fonts are sought after I would also welcome any affordable / free font recommendations.\n\nBest regards\n\n"
    },
    {
      "time": "23 Apr 2014 — 9:35am",
      "content": "I recently wrote [a “review”](http://web.archive.org/web/20140803012118/http:/typographica.org/typeface-reviews/mvb-solitaire/) of MVB Solitaire for Typographica.\n\n"
    },
    {
      "time": "23 Apr 2014 — 9:44am",
      "content": "Persuasion = serif font.\n\nhhp\n\n"
    },
    {
      "time": "23 Apr 2014 — 11:53pm",
      "content": "Hi Frode\n\nThank you for the reply. I've read your review and you state \"The central styles are spaced a little on the tight side for immersive reading. They are, however, ideal for shorter stretches of text, or a supp­or­ting role in a bigger hierarchy.\" This suggests that such a font, in your opinion, would not be useful for my intended purposes i.e. long persuasive reports. Would this be an accurate interpretation ?\n\nBest regards\n\n"
    },
    {
      "time": "23 Apr 2014 — 11:55pm",
      "content": "Hi Hrant,\n\nThank you for your reply. I would be interested to learn of the relationship between serif fonts and persuasion and therefore would welcome your recommendations of any evidence bases (books, articles etc) that make such a link between the two.\n\nBest regards\n\n"
    },
    {
      "time": "24 Apr 2014 — 2:29am",
      "content": "You are correct. That is my opinion.\n\nI’ve never typeset a book in a sans serif, but I have been using Fresco Sans for a magazine in a supportive role. It has a lot of flavour, which might be a dealbreaker, but the spacing is impeccable: ideal for text sizes. If you’re typesetting Norwegian, you’ll need to make some modifications though (obtain permission, or hire the foundry to do them).\n\nAnother typeface I have worked with that I consider suitable for extended text is FF Legato.\n\nSome other sans serifs I’d like to look closer at in the future includes FF Milo, Seravek, FF Balance, DTL Haarlemmer Sans and DTL Documenta Sans.\n\n"
    },
    {
      "time": "24 Apr 2014 — 6:52am",
      "content": "Besides making a font more readable, serifs are formal and elaborate (while sans fonts are informal and plain). You need such characteristic to persuade.\n\nAn obvious choice here is Georgia. It's very functional, and persuasive, but it's used for so many things that it's not very focused (if that matters).\n\nhhp\n\n----\n\nToday, learn about the Armenian Genocide.\n\n"
    },
    {
      "time": "24 Apr 2014 — 7:16am",
      "content": "Beware of blanket statements like \"all sans fonts are informal and plain\" - a good sans can project a sense of modernity and clarity. And on the other hand serifs can be stiff and fussy and project more of a schoolbook vibe. Readability and serifs is still an open discussion - well set sans can be very readable. Georgia, by the way, is a strong font and could be persuasive, but then I have seen Gill Sans do a good job as well.\n\n"
    },
    {
      "time": "24 Apr 2014 — 7:22am",
      "content": "I didn't mean to sound so categorical, sorry. And although I do maintain that serifs do help readability (because they favor boumas\\* over individual glyphs) the main issue here is in fact the \"voice\".\n\n\\* [http://themicrofoundry.com/ss\\_read1.html](http://web.archive.org/web/20140803012118/http:/themicrofoundry.com/ss_read1.html \"http://themicrofoundry.com/ss\\_read1.html\")\n\nhhp\n\n----\n\nToday, learn about the Armenian Genocide.\n\n"
    },
    {
      "time": "26 Apr 2014 — 1:08pm",
      "content": "I would be inclined to take my own Hypatia Sans out for a spin in this context, and see how it does. It can come across as formal but reasonably warm. [http://www.myfonts.com/fonts/adobe/hypatia-sans-pro/](http://web.archive.org/web/20140803012118/http:/www.myfonts.com/fonts/adobe/hypatia-sans-pro/ \"http://www.myfonts.com/fonts/adobe/hypatia-sans-pro/\")\n\n"
    },
    {
      "time": "26 Apr 2014 — 5:26pm",
      "content": "I am a big fan of Hypatia and would say it is well worth consideration - it does have a nice warm feel and is not too formal.\n\n"
    },
    {
      "time": "26 Apr 2014 — 5:28pm",
      "content": "<cite>...setting my work apart from the ordinary is desirable.</cite>\n\nBest done by the writing, not the font selection.\n\nThat said, I agree with Thomas that it would be interesting to see Hypatia used in this context. Haven't seen or done this, though, We've only used Hypatia for display, where it worked very well indeed.\n\nA proven font family would be TheSans, using either the regular or semi-light for text. (We've set a number of art books with TheSans.) Of course, since it is proven, it's not the newest fad.\n\n[http://www.lucasfonts.com/fonts/thesans/thesans/styles/](http://web.archive.org/web/20140803012118/http:/www.lucasfonts.com/fonts/thesans/thesans/styles/ \"http://www.lucasfonts.com/fonts/thesans/thesans/styles/\")\n\n"
    },
    {
      "time": "26 Apr 2014 — 5:39pm",
      "content": "> Best done by the writing, not the font selection.\n\nThat's like somebody asking for an opinion on a book he's written on a book review forum, and being told that a career choice comes first. This is Typophile, so the context is type. Chips on shoulders are best be left at the door.\n\nTheSans is a great design, but if it works well for an art book\\* it can't be a very good choice for this task. Specifically, I think it's too informal, too friendly here.\n\n\\* Central question: what kind of art? There's no way one typeface can be great for all genres.\n\nhhp\n\n"
    },
    {
      "time": "26 Apr 2014 — 8:02pm",
      "content": "If your reports are single page, one column, then I would recommend a face with a small x-height. Avenir is a good choice.\n\n"
    }
  ]
}
