{
  "id": "115908",
  "title": "High-Legibility Bible Clarendon",
  "forum": "Home",
  "tags": [
    "Serif"
  ],
  "content": " ![](http://web.archive.org/web/20150317093858im_/http:/typophile.com/files/view03_5227.jpg)\n\n ![](http://web.archive.org/web/20150317093858im_/http:/typophile.com/files/face3_4047.png)\n\nThis typeface is too condensed, and has too small an x-height, to be Ionic No. 5, at least if Bitstream News 701 is a faithful clone thereof.\n\nAs well, I do not believe it to be Petit Mediaeval Clarendon; that was used by Cambridge University for some rather upscale Bibles.\n\nThese samples are from - and so, if you have the actual book, you may well find a note on the typeface in it - the St. Joseph New Catholic Edition of the Confraternity-Douay translation of the Holy Bible, published by the Catholic Book Publishing Co. of New York.\n\nFont:&nbsp;\n\n Modern Antique Condensed (Lanston Monotype) \n\nSolved By:&nbsp;\n\n [quadibloc](http://web.archive.org/web/20150317093858/http:/typophile.com/user/50554 \"View user profile.\")\n\n",
  "author": "quadibloc",
  "time": "20 Apr 2014 — 9:35am",
  "uid": "50554",
  "comments": [
    {
      "time": "20 Apr 2014 — 2:54pm",
      "content": "It somewhat resembles the old Linotype Antique No. 3, the bolder face shown below what they refer to as the \"De Vinne Series\" in this image:\n\n ![](http://web.archive.org/web/20150317093858im_/http:/typophile.com/files/8pt_dvs_an3_3551.jpg)\n\nAlso, as somewhat similar, there is [Clarendon Book Condensed](http://web.archive.org/web/20150317093858/http:/www.identifont.com/find?font=clarendon+book+condensed&q=Go).\n\nIt's definitely not Petit Medieval Clarendon, as that is wider.\n\nAnd there's also Manfred Klein's [RoundSlab Serif](http://web.archive.org/web/20150317093858/http:/moorstation.org/typoasis/designers/klein04/text02/roundslab.htm).\n\nBut notice that the face I'm trying to identify has _very_ short descenders.\n\nAnd, from the old Lanston Monotype specimen, I've found something very close:\n\n ![](http://web.archive.org/web/20150317093858im_/http:/typophile.com/files/76j_5058.jpg)\n\nThe style called 76J seems condensed enough, and has short enough descenders, to be a match. But I'm not 100% sure it is the right typeface, as I can't tell for certain it's a Clarendon. Also, the target face has one other unusual characteristic: the stroke width on the capital letters is noticeably thicker than on the small letters.\n\nOn further examination: 76J is a Clarendon, and it does have the other characteristic in 7, 8, and 12 point... but not 9 and 10 point. Since the book in question is in 8 point type, it's a match, I guess.\n\nBy name, it's Modern Antique Condensed.\n\n"
    }
  ]
}
