{
  "id": "115954",
  "title": "Never Mind Starling",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This typeface, displayed in a book by Henry Taylor Wyse from 1911,\n\n ![](http://web.archive.org/web/20140710085728im_/http:/typophile.com/files/los5_sb_4898.jpg)\n\nlooks oddly familiar. Actually, though, what with Times Roman being derived from Plantin, and Caslon being based upon the Dutch types that were popular before it, a modernized Caslon, such as Recut Caslon and New Caslon from ATF, is bound to resemble Times Roman at least a little.\n\n",
  "author": "quadibloc",
  "time": "22 Apr 2014 — 7:42am",
  "uid": "50554",
  "comments": [
    {
      "time": "25 Apr 2014 — 6:29pm",
      "content": "Oh, and while I'm busy revising the history of type, it seems to me that this face,\n\n ![](http://web.archive.org/web/20140710085728im_/http:/typophile.com/files/ant_rom_5980.jpg)\n\nAntique Roman, looks a lot more like Bookman than the face generally credited as its inspiration,\n\n ![](http://web.archive.org/web/20140710085728im_/http:/typophile.com/files/osa_tw_6234.jpg)\n\nOld Style Antique.\n\nEDIT: But on the very next page, there's a different Antique Old Style which looks more like Bookman, although I still think less so than Antique Roman:\n\n ![](http://web.archive.org/web/20140710085728im_/http:/typophile.com/files/aos_hwc_4502.jpg)\n\nOh, and here's a more extended sample of Stephenson Blake's Old Style No. 5, where in continuous text the resemblance thereof, or lack of same, to the Times' New Roman may be better judged:\n\n ![](http://web.archive.org/web/20140710085728im_/http:/typophile.com/files/os5_sb_5423.jpg)\n\nIncidentally, I tried that face in What The Font, and the result I got was a face I had never heard of, Casad. And there was definitely a resemblance, at least in the lowercase j.\n\nEDIT: Casad is much more condensed than this.\n\n"
    },
    {
      "time": "25 Apr 2014 — 7:06am",
      "content": "But still, why \"forget\" something one can use, like Starling, in favor of a bunch of paper with ink stains? Furthermore, you've already let an 80-year-old man beat you to the punch, so to speak, and you ain't ever started to draw. ;p\n\n"
    },
    {
      "time": "25 Apr 2014 — 8:19am",
      "content": "I'm not saying that people shouldn't _use_ Starling; I would have thought the idiomatic meaning of the title of my post was clear: here is something that even further predates Times Roman and yet looks like it.\n\nExcept, of course, 1904 came before 1911... so this mistake on my part obscures what I was thinking. However, whatever sources Morison may have had, this face is presumably an independent development from Caslon, in no way influenced by the submission from W. B. Starling to Lanston Monotype.\n\n"
    },
    {
      "time": "27 Apr 2014 — 4:08am",
      "content": "\"...1904 came before 1911...this mistake on my part obscures what I was thinking.\"\n\nI'm only privy to what you've written, not what you're thinking. Caslon worked so long before anyone in this story, I'm not sure how he could \\*not\\* have had an effect on Morrison, Burgess, Wyse, S&B, Monotype, Times, and Starling.\n\n"
    },
    {
      "time": "27 Apr 2014 — 5:16am",
      "content": "To me, the design DNA of Times New Roman is a quite pronounced backward leaning stress (old style stress) in the lower case, especially on the c and e, combined with high contrast and lapidary serifs. Those are the very sharp serifs one sees in stone carving. I don't think any of the examples you give really have that DNA.\n\n"
    },
    {
      "time": "27 Apr 2014 — 7:31am",
      "content": "<cite>I'm only privy to what you've written, not what you're thinking.</cite>\n\nWell, of course. However, writing is a tool used to express thought. And thoughts are sometimes expressed in writing in a fashion that, although indirect, is still transparent.\n\nSometimes, of course, attempts at subtlety fall flat.\n\n<cite>Caslon worked so long before anyone in this story, I'm not sure how he could *not* have had an effect on Morrison, Burgess, Wyse, S&amp;B, Monotype, Times, and Starling.</cite>\n\nOh, indeed. And, of course, Times New Roman, Caslon, and even Bembo and Eusebius all express the same twenty-six letters.\n\nAs we do remember, though, William Burgess Starling is said to have designed a typeface in 1904 that eerily anticipates Times Roman. Some unfortunate problems involving asbestos have interfered with examining some of the evidence for that claim.\n\nSince Times Roman is basically a sharpened-up Plantin, and Plantin was a revival, as its name indicates, of course it did not spring without precedent from the brow of Zeus. Even Venus had Franklin Gothic before it...\n\nEven so, because Caslon, very much like Times Roman, was a typeface that enjoyed great popularity because it was sharp, and it was an English typeface designed in a milieu of widespread usage of the Dutch types which included the prototype for Plantin, the various modifications and imitations of Caslon are a naturally likely spot to look in to see if someone, before Starling, anticipated Times Roman just as closely. And more publicly.\n\nThis might, or might not, free Stanley Morison from the charge of plagiarism. But it would have at least some impact on the question of whether Starling was the \"real\" inventor of Times Roman.\n\n<cite>I don't think any of the examples you give really have that DNA.</cite>\n\nAs a point of clarification, just in case: Antique Roman, Antique Old Style and Old Style Antique were presented for comparison with _Bookman_. Only Lining Old Style No. 5, presented in two of the examples, was intended for comparison with Times Roman.\n\nThe letters b, c, d, p and q have some slight reverse stress, now that you mention it, but that might be nothing new; and o, for example, certainly doesn't have any.\n\n"
    },
    {
      "time": "28 Apr 2014 — 12:12pm",
      "content": "\"As we do remember, though, William Burgess Starling is said to have designed a typeface in 1904 that eerily anticipates Times Roman.\"\n\nAs I remember, William Starling Burgess, is the name. :)\n\n"
    }
  ]
}
