{
  "id": "116067",
  "title": "Children's magazine body copy font",
  "forum": "General Discussions",
  "tags": [
    "friendly",
    "General Discussions",
    "highly legible",
    "humanist",
    "kids",
    "slab serif"
  ],
  "content": "Hello, I'm looking for a highly legible font for use in body copy, cutlines, and possibly heads and sub heads for a children's magazine (ages 9-13).  \nI need a contemporary and friendly look . Must be easy to read, and have some character while being the neutral font to some animated display fonts.  \nThe magazine content is science-oriented and educational, packaged in a cool, entertaining way.  \nDefinitely not stereotypical (no Clarendon, or New Century Schoolbook as much as I like them). Because the magazine includes both genders, and softer, human content, I don't want a cold. science-y looking font.  \nPreferably one story \"a\" and \"g.\" I'm leaning towards slab serif or humanist. Bree is one of my selections, but have some concern about the legibility with its slight condensed look. I'm pairing it with a sans, currently looking at Tenso, which has some character and flexibility.  \nAll suggestions welcome!\n\nI also welcome any info on selecting readable fonts for kids (who are reading less than previous generations), specifically font test research or any kind of concretes to provide guidance on typography for kids. (Does text really need to be broken into small blocks? I don't think so, but research would help substantiate.)  \nThanks for reading this!\n\n",
  "author": "FaithC",
  "time": "25 Apr 2014 — 2:50pm",
  "uid": "219607",
  "comments": [
    {
      "time": "25 Apr 2014 — 3:02pm",
      "content": "I don't feel too guilty recommending something I had a hand in, because it really does sound like a particularly good fit in this case:  \n [http://ernestinefont.com/](http://web.archive.org/web/20150420082131/http:/ernestinefont.com/ \"http://ernestinefont.com/\")  \nFF Ernestine has won multiple awards for good reason, and it works exceptionally well onscreen too.\n\nhhp\n\n"
    },
    {
      "time": "25 Apr 2014 — 7:36pm",
      "content": "I don’t think you should overtly telegraph that you’re targeting children by using “early reading” single bowl /a and /g. Nobody likes to be dumbed down to, certainly not 9–13 year olds. I would add that double bowl /a and /g add sophistication that children that age might ﬁnd attractive, and for legibility and readability these forms are far preferable, the two-storey /a in particular disambiguating from /o.\n\nI like your idea of using a slab, it is unfussy and has a clarity suitable to the subject matter.\n\nTherefore I would recommend my Bodoni Egyptian. It is not overtly cute or trendy; neither is it a traditional, old-fashioned geometric slab serif, but a new idea of applying a monoline treatment to a classic style.\n\nAnd, with its small x-height, it does not create an intimidating text mass at Regular weight, as the larger x-height slab serifs do.\n\nThe Bodoni Egyptian also has a large selection of weights (the Thin and Extra Light are quite interesting at display sizes), and all the bells and whistles such as small caps, alternate ﬁgure styles, and compound fractions—good for scientiﬁc material.\n\n[http://origin.myfonts.net/s/aw/original/99/0/51097.pdf](http://web.archive.org/web/20150420082131/http:/origin.myfonts.net/s/aw/original/99/0/51097.pdf \"http://origin.myfonts.net/s/aw/original/99/0/51097.pdf\")\n\n"
    },
    {
      "time": "26 Apr 2014 — 8:41am",
      "content": "I think FF Ernestine is a good choice - is very readable but also has a nice light vibe - Bodoni Egyptian is a nice face but is \"heavy\" in feel.\n\n"
    },
    {
      "time": "26 Apr 2014 — 12:32pm",
      "content": "If I may throw my hat in the ring as well: also Andron has been chosen for children’s reading.  \nSee two examples [here](http://web.archive.org/web/20150420082131/http:/andron-typeforum.xobor.de/f9-Projects-using-Andron-introduced.html).\n\n"
    }
  ]
}
