{
  "id": "116029",
  "title": "Old Style v Humanist, are they different?",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "Hi there,\n\nI'm a somewhat newbie to the world of typography - hence the eventual question - but have always been an admirer of fonts and their uses in everyday mediums. I'm currently studying graphic design, and on my holidays have taken up some time to do some extra research on type classification because, well I just like it! Anyway, I'm reading about Humanistic/Venetian typefaces, and how that led the way to Old Style typefaces which were less calligraphy based and more refined etc. However, in half of the articles I read online, they refer to the Humanist typeface phase as being labelled 'Old Style'.... so I'm naturally confused a little right from the get-go. Is this just a result of the proximity and chronological order of these two styles blending into one another in some people's eyes, or is there an obvious distinction or answer to this that I'm completely oblivious to?\n\nAny kind of clarification will be very much appreciated. I really want to grasp this stuff as it interests me greatly.\n\n",
  "author": "Bayne",
  "time": "24 Apr 2014 — 6:59am",
  "uid": "219566",
  "comments": [
    {
      "time": "24 Apr 2014 — 11:51am",
      "content": "The term \"Humanist\" has more than one meaning in typography.\n\nThe earliest Old Style typefaces were based on a manuscript hand to which the term \"Humanist\" was applied. But that term is not applied to _those_ typefaces.\n\nInstead, when a typeface is called \"Humanist\", it's something like Gill Sans or Optima - a sans-serif typeface which, instead of being a classic Grotesque, a more attractive Gothic (a deprecated term as it's also applied to blackletters) like Franklin Gothic or News Gothic, or a Geometric like Futura or Kabel, borrows many of the proportions and characteristics of serif typefaces for more comfortable reading.\n\nNote that I didn't mention Helvetica and Univers, which belong to yet another category of sans-serif faces the name of which I don't recall offhand at the moment.\n\n"
    },
    {
      "time": "24 Apr 2014 — 12:24pm",
      "content": "Pardon my French.\n\nThe way I understand VOX, Humanist is a subset of Old-Style – more specific, the first generation of antiqua types. We also use the term _Humanist_ to describe similar skeletal structures, as well as traces of handwriting, in sans serif designs.\n\nA better term, perhaps, is _Dynamic_ (as opposed to _Static_ – Grotesques, Transitionals, Moderns – or _Geometric)._ The reason is, these terms can be applied to sans serifs, serifs, slab serifs, blackletters, scripts &c without historical conflict. This is especially relevant when a lot of contemporary type design combines elements from multiple – or even breaks out of – established genres.\n\nPS: It has been pointed out previously that there are often skeletal similarities in geometric and humanist designs.\n\n"
    },
    {
      "time": "26 Apr 2014 — 4:58am",
      "content": "Oh this is great. I've since done a lot more reading and have put your answers in even more context. I was thinking that the term Humanist referred more to a specific era, or style of typeface design that wasn't actually describing a structural form of the characters.\n\nBy the way, I believe Helvitca under the Vox-ATypI system is a neo-grotesque? Here I am pretending to know what I'm talking about haha...but I did discover that recently while perusing some typography blogs.\n\n"
    }
  ]
}
