{
  "id": "116070",
  "title": "The Granularity of Monotype Spacing",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I replied to something in a ten-year-old thread, and that was a mistake, if only because it turns out to now have an uninformative title.\n\nAnyways, in that old thread, the claim was made (by Gerald Giampa) that Monotype has a finer level of spacing than foundry type. Hrant Papazian expressed disagreement.\n\nI had something to add to this at this late date.\n\nFoundry type, of course, inherently has no mechanical limitation as to its widths. To speak, therefore, of its limits, we have to cite a specific instance of actual practise. Fortunately, there is an obvious choice.\n\nFrom information in the ATF type specimen books, but more importantly, from Legros' and Grant's _Typographic Printing-Surfaces_, I have surmised that regular ATF types, as opposed to their Self-Spacing Type and similar products, was designed so that all widths were a multiple of 1/4 point. Or, if one prefers, of 1/48 of the pica em, to use correct printing terminology.\n\nMonotype, as we know, uses an 18-unit system. Thus, if we're looking at 9 point type, the widths of the letters in a font are all multiples of 1/2 of a point. If, instead, we're looking at 12 point type, the widths of the letters are all multiples of 2/3 of a point.\n\nSo it's obvious: Monotype loses.\n\nNot so fast. Because there is another question to be examined. Fine spacing is a good thing to have, but how much of it is actually usable is another matter.\n\nThe IBM Selectric Composer is worth looking at in this connection. It is very limited typographically. Not only did the regular and italic versions of a given typeface have the same spacing, as with Linotype, but all typefaces were spaced the same way.\n\nIt had a nine-unit system. However, this mechanical simplicity was partially achieved through condensing the M and W; comparing the widths of most characters to those in Monotype Times New Roman, it becomes clear that the em was divided into 11 units. And, indeed, 11 point Press Roman on the Composer used a unit size of 1/72 of an inch, and looked well-proportioned. (Another of the typographic limitations of the Composer was that it had only three unit sizes, and so some point sizes of some faces were slightly condensed or stretched to fit.)\n\nWhile there are problems with documents made with the Composer - the Selectric mechanism couldn't align characters quite precisely enough for typographic purposes - the spacing was not visibly limited. On the other hand, proportional-spaced texts produced on a five-unit IBM Executive typewriter are distinguishable at sight from printing.\n\nAnd there's another thing about Monotype that I hadn't mentioned.\n\nA standard adjustment on the Monotype caster, made whenever one puts in a matrix-case for a new typeface, is to specify the set width. The set width is adjustable in increments of 1/4 point, and while it is usually close to the point size of the type, it does not have to equal it.\n\nThus, for a given face, 10 point type might have a set width of 10 points, 12 point type might have a set width of 11 3/4 points, and 6 point type might have a set width of 6 1/2 points.\n\nAnd so, once you have designed your typeface, you have an ultimate division of horizontal space into units of 1/18 of 1/4 of a point, even though you can't use them in a single size of a typeface.\n\nWhat they do provide for you, though, is the ability to make the optical adjustment of making the face wider in smaller point sizes by uniformly changing the proportions of every letter.\n\nWith ATF foundry type, on the other hand, one can't scale every character by the same amount when going from 11 point type to 9 point type, for example. Widths that are not multiples of 11/4 and 9/4 of a point, respectively, also have to be used.\n\nSo the fact that one has more than 18 widths in the em - but 44 of them for 11 point type, and 36 of them for 9 point type, rather than the same number - is not much of a help (see the Selectric Composer) but is a positive nuisance.\n\nMaybe the small discrepancies are such, though, that they can be ignored and left as tiny errors in the spacing between the letters. Otherwise, even if one were not making the smaller sizes wider, the widths of all the letters would still need to be individually adjusted for each point size just to fit into the mechanical limitations of the foundry system.\n\n",
  "author": "quadibloc",
  "time": "25 Apr 2014 — 8:44pm",
  "uid": "50554",
  "comments": [
    {
      "time": "25 Apr 2014 — 9:58pm",
      "content": "Just a quick thing for now: ATF wasn't exactly the pinnacle of foundry type in technical quality...\n\nhhp\n\n"
    },
    {
      "time": "26 Apr 2014 — 6:13am",
      "content": "Leaving the theoretical argument, there is a way to visually see the effect of small units of adjustment, by using the tracking feature of a layout program such as InDesign. Relative units, as found with emmage, can be converted to equivalent absolute ones (like points), and those values applied.\n\nAs someone who used various photocomp systems since 1980, I've had to deal with 18, 54, 250, and 1,000 unit ems, and type sizes from 7 points to whatever in display. I would say as a general rule that even with the 1,000 unit em, we've not reached the point where use can't be made of even a fraction of an em. Now the TeX scaled point -- 1/65,536 of a point, yes, a single increment is too small to use effectively.\n\nHow this related to foundry type still requires imagination, but the <cite>visual effect</cite> can be seen.\n\n"
    },
    {
      "time": "26 Apr 2014 — 8:44am",
      "content": "I'll just add a couple of things here.\n\nI didn't explicitly mention that the 18 units on a Monotype were each 1/18 of the set width, not the point size, although the system was commonly called an 18 units to the em system. That was probably obvious enough from my post, but I should have said it explicitly.\n\nAlso, I find that in one case foundry types were to a 1/8 point unit in the Legros and Grant table I referred to.\n\nInterestingly enough, while Quick-Set type used a coarser version of the normal ATF spacing system - to 1 point if possible rather than 1/4 point - their earlier Self-Spacing type used a system more like Monotype's. However, instead of having set widths in points, the unit was an aliquot part of the pica em, so it was even _more_ like the Selectric Composer.\n\nNow to address the point you made. In the United States, at least, ATF was pretty much the _only_ company making and selling foundry type.\n\nI don't know what Bauer or Stephenson Blake did for spacing. However, if one doesn't do what ATF did - require all types to be a multiple of some unit in spacing - then depending on what letters are in a line of text, it might not be _possible_, with a finite assortment of spaces and quads on hand, to justify that line. It's not as if spaces had little springs in them, like Linotype wedges.\n\nSo while ATF may have had other technical shortcomings, I'm doubtful that in the area of spacing any other foundry could - or should - have done better.\n\nThat, though, leads into a reconsideration of my main point.\n\nThe Monotype system forces set widths to be an exact multiple of 1/4 point. That means the optical adjustment of making a typeface narrower in larger point sizes, and wider in smaller point sizes, is restricted to coarse discrete jumps.\n\nIn the foundry system I've described, while the width of each character gets rounded to the nearest 1/4 point, that's random noise superimposed on the ability to adjust the _alphabet length_ in increments of 1/4 point.\n\nThe situation with foundry type then is very similar to what is faced today with laser printers. Imagine a laser printer with a dot pitch of 576 dpi - for the smaller unit of 1/8 point - then the arbitrary widths of characters, specified in the TrueType or Type 1 format, get rounded in rendering to the nearest whole number of dots.\n\nSo my original conclusion, that it was at least arguable that Monotype had finer spacing, based on the effective usable spacing presented to the type designer, may not have been correct.\n\n@Charles Ellertson:  \nI take it you mean that even with 1,000-unit ems, typography had not reached the point where use could not be made of a fraction of a **unit**.\n\nAnd I have no reason (or facts or arguments) with which to dispute that.\n\nWhile I've thought that a daisywheel version of the Selectric Composer might be nice to have, because making the curves of characters out of dots has its limitations, and thus requires excessively high resolutions for high-quality printing... at the moment, at least, I can hardly concieve of any mechanical contrivance which could achieve the flexibility of spacing you are identifying as desirable. Neither the Selectric Composer, nor Monotype, nor foundry type, could serve as a basis.\n\nOh, wait. There's the Linotype wedge. _That_ would work.\n\nNow, imagine a more compact Linotype, where you start with only one copy of each letter, and something like a Monotype caster casts Linotype slugs... no, you would need two alloys with widely separated melting points, so the first caster would run too hot to be practical, and the slugs would have to be cooled...\n\nBut hot metal is obsolete. There were very early typesetters which used a lot of the mechanical design from Monotype casters - and from Linotype machines too, so maybe the Linotype wedge could be brought into the modern era.\n\nSome CRT displays and dot matrix printers put dots in halfway positions, and some laser printers also have resolutions that are not the same horizontally and vertically - a dot might be 1/360 of an inch in size, and that might be the height of a scan line, but the position in the line can be varied by 1/1440 of an inch.\n\nDRAM is cheap, so replacing 1/1440 of an inch by 1/144,000 of an inch is not technically infeasible.\n\n"
    },
    {
      "time": "26 Apr 2014 — 6:52am",
      "content": "> even with the 1,000 unit em, we've not reached the point where use can't be made of even a fraction of an em.\n\nHow does that jibe with this?  \n [http://typophile.com/node/115340#comment-576462](http://web.archive.org/web/20140710195338/http:/typophile.com/node/115340#comment-576462 \"http://typophile.com/node/115340#comment-576462\")\n\nMore significantly: even at 1,200 dpi, with an Em of 1,000 a unit could matter only above 30 point. Ergo: 1,000 is plenty for spacing; in fact most type designers (including probably Carter) stop their refinement at 2 or even as much as 5 units – I have not personally heard of a type designer refining spacing by one unit. Where 1,000 is not enough is the black: certain outline structures, for example stem-to-curves in Italics.\n\n> it might not be possible, with a finite assortment of spaces and quads on hand, to justify that line.\n\nActually justifying a line of foundry type isn't _that_ precise – a line can be a hair loose and still be tight enough to work out OK. Spacing brasses (and for the really picky, tiny strips of paper) are inserted (as a rule at word-spaces) to come sufficiently close to mathematically perfect.\n\nhhp\n\n"
    },
    {
      "time": "26 Apr 2014 — 6:56am",
      "content": "As in\n\n<cite>Just as a reminder, the old Linotron 202 typesetting machine, the gold standard in the 1970s and 1980s, had an resolution of about 960 dpi. By the time you actually exposed &amp; developed the the photographic paper, you're significantly lower than that. A bit more loss making the negative, an little more burning the plate. And then, apply the ink to paper with an offset press...</cite>\n\nOf course, random errors and imperfections are likely less problematic than overall limitations - which again favors the foundry system over Monotype. I must leave the aesthetic debate to the typographical professionals, but on technical matters I can usefully comment.\n\n<cite>Actually justifying a line of foundry type isn't that precise – a line can be a hair loose and still be tight enough to work out OK.</cite>\n\nNo doubt, but that hair could still be so small as to lead to it taking an impractically long time to justify a line, requiring some help from limitations on spacing.\n\nFor simplicity's sake, I didn't note that the finite size of the atom means one doesn't have to worry about whether the width of a type slug in the basic unit is a rational or an irrational number...\n\n"
    },
    {
      "time": "26 Apr 2014 — 7:19am",
      "content": "Indeed, discretization of widths saves time/money both in production and use.\n\nhhp\n\n"
    },
    {
      "time": "26 Apr 2014 — 7:46am",
      "content": "But even with discrete widths, oil from people's fingers makes justification of foundry type imperfect once again.\n\nNote that since with laser printers the toner adheres to the drum where there is a static charge, and the laser light causes the static charge to be lost, one writes the white space, not the characters, which prevents certain schemes for fine character positioning from being practical.\n\n"
    },
    {
      "time": "26 Apr 2014 — 8:42am",
      "content": "> What they do provide for you, though, is the ability to make the optical adjustment of making the face wider in smaller point sizes by uniformly changing the proportions of every letter.\n\nNot so, not at all. What the Monotype machine did (and still does) is give one the ability to make the _body_ the character is cast on wider or narrower, not the _face_. That effectively changes the set, but not the proportions of the character. It is not true optical design, just optical spacing adjustment.\n\nAs for what is useful in spacing, Linotype did a study many decades ago about what amounts are useful and what is not. Their determination was that .0005\" is the threshold at which errors in weight and/or spacing become imperceptible to the human eye. Since we no longer use 1970 standards and have much better software and computing power today, a 1,000-unit EM is fine for most designs so long as very careful attention is paid to weights and spacing. For special situations such as very light fonts or connecting scripts, a 2,000-unit EM is more desirable. Anything higher than that really isn't needed.\n\n"
    },
    {
      "time": "26 Apr 2014 — 11:50am",
      "content": "Of course a Monotype type caster is not a phototypesetting machine, and so the shapes on the matrices in the matrix-case are what is cast. You can't stretch a letter to make it wider like you can with an anamorphic lens.\n\nBut I wasn't claiming any such thing. The discussion was about the freedom the two systems of spacing give to the _type designer_, not afterwards to the typesetter. Thus, when the type designer (or someone else working at the typefoundry in a hypnotic state for whom creative thought is a positive hindrance, as noted by Beatrice Warde) creates the original dies used to make matrices for Monotype casters, the pantograph in use is set to stretch or condense the letters as is appropriate.\n\nThus, in the case of Times New Roman from Monotype, the nominal set widths - of course the typesetter could adjust the caster to a larger set width for letterspacing - were:\n\n10 1/2 points for 11 point type  \n9 3/4 points for 10 point type  \n9 points for 9 point type  \n8 1/4 points for 8 point type  \n7 3/4 points for 7 point type  \n7 1/4 points for 6 1/2 point type  \n6 3/4 points for 6 point type\n\nSo 11 point type was condensed 4.5%, 10 point type was condensed 2.5%, 8 point type was widened 3.1%, 7 point type was widened 10.7%, 6 1/2 point type was widened 11.5%, and 6 point type was widened 12.5%.\n\nNo two sizes among those I've chosen to list here were in the same proportions of height to width.\n\n"
    }
  ]
}
