{
  "id": "116014",
  "title": "Looking for an italic Latin/Cyrillic font similar to GFS Solomos",
  "forum": "Design",
  "tags": [
    "calligraphic",
    "Cyrillic",
    "Greek",
    "Italic",
    "Latin",
    "Unicode",
    "Design"
  ],
  "content": "I'm looking for an italic font with wide Latin and Cyrillic support that looks similar to this Greek font, GFS Solomos. Here's a sample, Romans 3:21-26 (the first word is in GFS Decker for small caps):\n\n ![](http://web.archive.org/web/20150416152653im_/http:/typophile.com/files/Sample%20I_4822.png)\n\nThe closest thing I have right now is the italic version of Garamond, but it's not quite right--the strokes are too thin and the letters are too narrow. The sample below compares similar glyphs, GFS Solomos on left, italic Garamond on right:\n\n ![](http://web.archive.org/web/20150416152653im_/http:/typophile.com/files/Sample%20II_4784.png)\n\nThanks so much in advance!  \n--PADetz\n\n",
  "author": "PADetz",
  "time": "23 Apr 2014 — 9:11pm",
  "uid": "219540",
  "comments": [
    {
      "time": "23 Apr 2014 — 9:24pm",
      "content": "I thought the GFS fonts were all based directly on (classic) Latin types. If that's the case, a bit of online research should uncover what Latin typeface Solomos emulates. But Cyrillic would be another issue...\n\nI have a feeling you'd be better off finding another font in a similar style that has Latin, Cyrillic and Greek.\n\nhhp\n\n"
    },
    {
      "time": "23 Apr 2014 — 10:41pm",
      "content": "I'll go hunting on Google and see what I find, but the GFS doesn't have anything on what this face is based on, all they have is \"From the middle of the 19th century an italic font with many calligraphic overtones was introduced into Greek printing. Its source is unknown, but it almost certainly was the product of a German or Italian foundry. In the first type specimen printed in Greece by the typecutter K. Miliadis (1850), the font was listed anonymously along others of 11pts and in the Gr. Doumas' undated specimen appeared as «11pt Greek inclined».\"\n\n"
    },
    {
      "time": "24 Apr 2014 — 6:53am",
      "content": "Oh, it's a literal revival? I didn't realize.\n\nhhp\n\n----\n\nToday, learn about the Armenian Genocide.\n\n"
    },
    {
      "time": "24 Apr 2014 — 11:47am",
      "content": "[Scotch Modern](http://web.archive.org/web/20150416152653/http:/www.myfonts.com/fonts/shinn/scotch-modern/) is a 19th century revival with Latin, Cyrillic and Polytonic Greek, and small caps and other expert features throughout. Note the handling of roman/italic in the Greek, for present day functionality amongst the three scripts. There are also stylistic options for characters such as rho, theta, phi etc.\n\n"
    },
    {
      "time": "24 Apr 2014 — 8:02pm",
      "content": "I had always understood the GFS fonts to be based on historic _Greek_ typefaces, not Latin ones. Less serious font sources will base their faces on popular Latin faces - thus I was startled at one point to see an Armenian version of Mistral. But why shouldn't Armenians get to have fun with display faces?\n\nLooking at the display of Solomos on the GFS website, the first thing that strikes me as an appropriate companion to it is Century Expanded. That is, however, anachronistic, and a Scotch Roman would indeed be a better match.\n\nFor Cyrillic, there's a free Scotch Roman, the typeface \"Old Standard\" by Aleksey Kryukov, but that face seems to be a bit heavier with more stroke contrast. However, when I took another look at a specimen, it doesn't seem to clash with Solomos as much as I feared, so it might be acceptable.\n\n"
    },
    {
      "time": "24 Apr 2014 — 8:25pm",
      "content": "> But why shouldn't Armenians get to have fun with display faces?\n\nThere are different kinds of fun. Some people think chess is fun. Others think Russian Roulette is fun. The thing with a font is that when you make one, you're potentially deeply affecting the parameters of your culture, long into the future. I've seen the Armenian Mistral: it's like an Armenian faking a French accent. Plus it doesn't have the proper paperwork.\n\nhhp\n\n"
    },
    {
      "time": "25 Apr 2014 — 9:53am",
      "content": " ![](http://web.archive.org/web/20150416152653im_/http:/typophile.com/files/Sample%20III_6081.png)\n\nHow are the Scotch Modern/Roman and Century Expanded compared to the free Old Standard? because at the same letter size the lines are too far apart compared to Solomos, not to mention this kind of font is too plain for my taste. (Perhaps I could ask a better question about what exactly I'm looking for? because I'm the furthest thing from a type expert)\n\n"
    },
    {
      "time": "25 Apr 2014 — 12:15pm",
      "content": "See page 57 of the Modern Suite PDF:  \n [http://origin.myfonts.net/s/aw/original/175/0/89904.pdf](http://web.archive.org/web/20150416152653/http:/origin.myfonts.net/s/aw/original/175/0/89904.pdf \"http://origin.myfonts.net/s/aw/original/175/0/89904.pdf\")\n\n"
    },
    {
      "time": "26 Apr 2014 — 1:31pm",
      "content": "I guess the problem is that I didn't really know what I was asking for, I said I wanted one with about the same letterforms but that would be pretty boring, I think what I'm actually looking for is a font that has the calligraphic qualities Solomos has, and this is why I've been using italic Garamond for this project up to now\n\n"
    },
    {
      "time": "26 Apr 2014 — 3:10pm",
      "content": "Do you really mean calligraphic? Solomos is informed by engraving as much as the pointed nib, whereas Garamond is a broad nib style, a horse of a different color. Perhaps you just mean quaint, busy and irregular?\n\n"
    },
    {
      "time": "26 Apr 2014 — 4:43pm",
      "content": "Very likely!\n\n"
    },
    {
      "time": "27 Apr 2014 — 3:16pm",
      "content": "That's probably right; the thing I like most about Solomos is how closely it's spaced vertically, which along with the eccentric curves make it an excellent choice for a font that is both compact and pleasing to the eyes (which is important given I'm using this font for running text, not just italic emphasis), but it's been a challenge to find a Latin or Cyrillic font with similar qualities\n\n"
    },
    {
      "time": "27 Apr 2014 — 4:31pm",
      "content": "Here I’ve matched the Scotch Modern to your Solomos specimen, by horizontally scaling it to 96%.  \nNote that with the same nominal x-height and leading, there is more space between ascenders and descenders.  \nThe small caps don’t have polytonic accents, though, so you would have to make do with the convention that capitals, normal and small, don’t require accents, or ﬁnd a work-around. (Or commission those!)\n\n ![](http://web.archive.org/web/20150416152653im_/http:/typophile.com/files/Scotch_Greek_3494.jpg)\n\n"
    },
    {
      "time": "27 Apr 2014 — 6:48pm",
      "content": "GFS Decker has actually proven a great workaround to polytonic small caps--since it's an uncial font it has approximately the same effect while making a marked contrast to the curves of Solomos! but it's thinness suits it much better for Solomos than for Scotch. Do you suggest I should just use Scotch instead of Solomos?\n\n"
    },
    {
      "time": "27 Apr 2014 — 8:49pm",
      "content": "You said, “I'm looking for an italic font with wide Latin and Cyrillic support that looks similar to this Greek font, GFS Solomos.”\n\nI think Scotch Modern Italic looks similar, mainly in terms of overall text color.  \nDisclaimer: I designed it.\n\n"
    },
    {
      "time": "28 Apr 2014 — 5:27pm",
      "content": "To your credit this font looks great! I think the difficult thing about using Solomos with other fonts is that the letters are set very high compared to other fonts, so if I have running text in Solomos and then I introduce a word or two in a Latin or Cyrillic font, it's ascenders will push that line down from the text above it\n\n ![](http://web.archive.org/web/20150416152653im_/http:/typophile.com/files/Sample%20V_3955.png)\n\n"
    },
    {
      "time": "12 May 2014 — 1:13am",
      "content": "\\>… so if I have running text in Solomos and then I introduce a word or two in a Latin or Cyrillic font, it's ascenders will push that line down from the text above it\n\nTo manage such little issues is at the very basic of typographic practice. It has little to do with your initial request of an appropriate typeface.  \nI can only second Mr. Shinn, his Scotch Modern might just meet the briefing best. I don’t see where else you may get a quality typeface in that style which profoundly covers Latin, Greek and Cyrillic.\n\n"
    }
  ]
}
