{
  "id": "116042",
  "title": "Slash and backslash",
  "forum": "Build",
  "tags": [
    "build",
    "design",
    "Build"
  ],
  "content": "Hello:\n\nI have a doubt, and I'll thank you all if you can help me with it.\n\nIs there a correct position to slash and backslash?  \nI'm seeing some typefaces with them long enough until descenders, some just from baseline, and some in beetween.\n\nDepend on function, history, or just taste?\n\nThank you.\n\nAlfonso\n\n",
  "author": "Fonzo",
  "time": "24 Apr 2014 — 7:53pm",
  "uid": "64064",
  "comments": [
    {
      "time": "25 Apr 2014 — 4:00pm",
      "content": "Slashes should be consistent with parentheses and brackets. The general idea with all of these is that they are vertically centered on the main mass of the text. Prescriptive text faces have them span ascender to descender, centered on the lowercase body, and usually supply an Opentype feature that shifts them upward for all caps. The \"in between\" school is accounting for the fact that descending letters are fewer and occur less frequently (in English and most other languages) than ascending letters, and so regards the bulk of the text on average to be higher. Stopping at the baseline tends to be the mark of a display face that expects to be used in all caps most often. Even then, some protrusion is called for. The slash functions as a divider, and so should not be lost among letters. You don't want it mistaken for an I or l in an italic sans. Same, more emphatically, goes for the vertical bar.\n\n"
    },
    {
      "time": "25 Apr 2014 — 5:55pm",
      "content": "The backslash is a character that was included in the ASCII character set because it was thought that people might be able to use it to compose AND and OR operators as /\\ and \\/. Despite that, the original backslash, on the Model 33 Teletype, whether ASR, KSR, or RO, was a short slash at a 45 degree angle.\n\nBasically, it's a weird character that nobody uses, which has no business occupying prime real estate in the 128-character subset of UNICODE. But it's too late to change things now.\n\nAs the previous reply noted, the solidus should go slightly above cap height and slightly below the baseline by an equal amount. This may vary if you are using old-style numerals. There would also be the issue with metal type that if lower-case ascenders did not extend above cap height, there would be no way (without kerning which would mandate leading) to so extend the solidus on the type body.\n\nThis is still relevant in the digital era how? For accurate recreations of typefaces which existed in the era of hot metal.\n\n"
    },
    {
      "time": "26 Apr 2014 — 2:27pm",
      "content": "There was no way to drop the backstroke. Its use is too entrenched in C and Unix.\n\n"
    },
    {
      "time": "6 May 2014 — 9:07am",
      "content": "Urm... and Windows (via DOS). Pathnames, you know.\n\n"
    },
    {
      "time": "6 May 2014 — 10:56am",
      "content": "Ahh... forgot that. And that after effin _years_ of poking around on/with an MS-DOS-running beastie or other. Ai... now I'm missing Tinúviel again. (Tinúviel was an old Corona PC I could dual-boot to MS-DOS and CP/M-86.)\n\n"
    },
    {
      "time": "23 May 2014 — 4:58pm",
      "content": "Thank you all. Very useful information.\n\n"
    },
    {
      "time": "23 May 2014 — 4:59pm",
      "content": "Yeah, my first computer use was with DOS... wow, 20 years ago...\n\n"
    }
  ]
}
