{
  "id": "116039",
  "title": "Is FF Olsen the typeface I keep seeing everywhere?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've been seeing since about 2000 a new style of typeface all over the place.\n\nVarious typefaces seem to belong to this style; Droid Serif, Adelle, Silica. Finally, though, I noticed that FF Olsen was designed in 2001. Is this the face that everyone else seems to be copying? Or did this general style of face originate at an earlier time? (Of course, I don't mean \"general\" in the sense of looking for the origin of Egyptians like Stymie.)\n\nEarlier, I had mistakenly put Gandhi in this category, but now I see that it isn't really this kind of face.\n\nEven Charter, although not as slab-like as these faces, has some hints of the style.\n\n",
  "author": "quadibloc",
  "time": "24 Apr 2014 — 12:52pm",
  "uid": "50554",
  "comments": [
    {
      "time": "24 Apr 2014 — 2:55pm",
      "content": "What are you seeing as a common feature between these fonts, other than their \"slabbiness\"? They seem rather varied to me. Is it the idea of a slab serif with contemporary design features that you see as the common factor? Certainly, it's not a style that produced so many notable examples for a while, but going back to the eighties and nineties what about Boton, PMN Caecilia, ITC Officina Serif, Corporate E?\n\n"
    },
    {
      "time": "24 Apr 2014 — 3:21pm",
      "content": "And going back to the 60s and 70s: Adrian Frutiger's Glypha and Serifa, Margaret Calvert's eponymous typeface Calvert? Haven't slabs – though cleary going in and out of style to a large extent – often closely followed concurrent developments in other typefaces? Both Sans and Serif styles have influenced slabs throughout. Pinpointing an origin \"within the style\" may not even be enough! Could FF Olsen exist without (less slabby but just as wedgy) 80s typefaces like Charter (which you mention), Oranda and Swift?\n\n(And even groundbreaking \"first typefaces\" often tend to be less original if you scratch the surface. Something as supposedly radical as Futura, for example, was wrapped in a cloud of similarly-styled influences.)\n\n"
    },
    {
      "time": "24 Apr 2014 — 4:48pm",
      "content": "It may well be Beton ExtraBold that I've seen in some instances, and PMN Caecilia has the unusual letter C that I've seen as the distinctive feature of some of these faces. ITC Officina Serif and even URW Corporate E do seem to be in the space I'm thinking about as well.\n\nAnd while I might pass by some of the faces you mention in your next post, Oranda definitely is related to the genre I'm thinking of that seems to be so popular nowadays.\n\nAlso, the face of this type I'm seeing on web sites is Noticia.\n\nBut then I even lump Arek into this group.\n\n"
    },
    {
      "time": "24 Apr 2014 — 11:26pm",
      "content": "Yes, I wasn't necessarily implying that these 60s and 70s fonts were necessarily part of the same sub group, merely that they – in a similar way – attempt to represent the (then!) contemporary in the slab genre.\n\nI'm guessing\\* that different aspects have appeared at different times, and outside the slab genre as well, and that they've gone into new slabs eventually. The super-chunky wedge serifs? One possible starting point (together with Oranda) is Mark Simonson's [Kandal](http://web.archive.org/web/20150328192739/http:/www.marksimonson.com/fonts/view/kandal) (1994), but both are otherwise different (?). The cut-and-curve constructions in many of these typefaces? See the [long discussion in this previous thread](http://web.archive.org/web/20150328192739/http:/typophile.com/node/41687). And so on.\n\n\\*Still without knowing what exactly you're looking for! Perhaps you could draw up a comparison image highlighting some pertinent details, using Myfonts samples?\n\n"
    },
    {
      "time": "25 Apr 2014 — 7:01am",
      "content": "I'm not sure myself exactly what I'm looking for, what it is about so many contemporary wedge and slab serif faces that make me think of them as almost redrawings of the same face - or at least make me think, apparently incorrectly, that one typeface of this kind, whatever it is, has had a tremendous impact on type designers, making many of them explore that genre.\n\nIn addition to the type, some of these faces - plus some that are normal serif and sans-serif faces - look to me as if they're in the same person's \"handwriting\", as it were, coming from the same prolific designer. Thus, for some reason, some _very_ subtle typeface characteristics seem to be spreading like wildfire in the type design schools - I've found this tendency most pronounced in faces identified as being from new designers or students.\n\nEither something strange is going on, or it's just me - I'm so comfortable with the old typefaces from the 1960s and before that I'm lumping contemporary faces together without appreciating them individually.\n\nI had noticed cut-and-curve in some of those typefaces, but I don't think I considered it a defining characteristic. But at least that one apparently _did_ have a known origin point, the italic of FF Quadraat by Fred Smeijers.\n\nAnd then there's Falcon - which actually made it to posthumous availability - and Stuyvesant, which was at least used to typeset _The Shirley Letters_. W. A. Dwiggins just keeps getting more and more interesting... first, I learn that he designed the digits \"dek\" and \"el\", and now this.\n\n"
    },
    {
      "time": "16 Jul 2014 — 9:43am",
      "content": "> I'm not sure myself exactly what I'm looking for, what it is about so many contemporary wedge and slab serif faces that make me think of them as almost redrawings of the same face\n\nI find it hard to pinpoint what it is exactly myself but I've actually been having the same feeling towards many contemporary typefaces. It does seem to be a trend which pops up now and then and I particularly see it in low-contrast wedge serif typefaces.\n\nIsn't Skolar of the same sort as well? For some reason I often have to think of Skolar and Adelle even though they're quite different from each other.\n\nHere's a quote from the description of Skolar: \"Equally, features such as its relatively large x-height, robust serifs and low contrast make Skolar a reliable choice even at small sizes.\"\n\nI feel like those are probably the commonalities between many of these type of typefaces. I think the trend might be to update classical typography to contemporary standards where the ability to read text at smaller sizes becomes even more important (due to the need for scalability in digital typography), and thus you see a higher x-height, a lowering of the contrast and a more minimalist approach.\n\n"
    },
    {
      "time": "25 Mar 2015 — 11:32am",
      "content": "Here are some examples I've found on MyFonts:\n\n[Basil](http://web.archive.org/web/20150328192739/http:/typophile.com/wiki/https%3A/%252Fwww.myfonts.com/fonts/karandash/basil/)  \n [Bommer Slab Rounded](http://web.archive.org/web/20150328192739/http:/typophile.com/wiki/https%3A/%252Fwww.myfonts.com/fonts/dootype/bommer-slab-rounded/)  \n [Breve Slab Title](http://web.archive.org/web/20150328192739/http:/typophile.com/wiki/https%3A/%252Fwww.myfonts.com/fonts/dstype/breve-slab-title/)\n\nOne clear commonality I found is that the lower-case e clearly is _not_ based on an ellipse. Instead of fighting against Bezier curves to approximate conic sections, or to imitate a quill pen at work, the new freedom afforded by modern type design tools is being put to use.\n\nAnd _that_, of course, points to the superellipse of Piet Hein, and its typographic embodiment by Hermann Zapf - _Melior_ - as a typeface which, although not a member of this group, as being very definitely one of the roots of inspiration that led to it becoming possible.\n\n"
    }
  ]
}
