{
  "id": "116084",
  "title": "Is the rule still \"serif for print and sans serif for screen\"?",
  "forum": "Design",
  "tags": [
    "fonts for the web",
    "setting typography standards for a business",
    "vintage modern",
    "website fonts",
    "Design"
  ],
  "content": "I need to select fonts to give a new business (mine - and I'm not a graphic artist) a specific vintage look and feel. Of course, I hope to create - as much as possible - a unified presentation for a variety of venues including letterhead, e-mail, e-commerce website (viewable on desktop, tablet and smartphone), print catalog, and collateral materials.\n\nIn addition to a unified look, the other interest was in selecting fonts to create a memorable impression for the business. I'd like the lettering to stand out enough that people might notice it is something a little different –and yet be able to read it with ease.\n\nThe present product logo uses Benguiat which, while a “young” font, was used to convey a product with qualities circa 1900 –a little art nouveau and a little arts & crafts. A company logo is still to be designed, but the present thinking was to use Benguiat again to convey the relationship between product brand and maker. The website design target is essentially vintage modern –basically how a turn of the century business might have designed a website (had the internet existed at the time).\n\nNow to my core question: My understanding had been that “serif is for print and sans serif is for electronic media.” If so, having a single vintage serif font for text use in print and electronic media would not work. Please let me know if the use of serif fonts is still viewed as restricted to print (especially now that people are moving to ever smaller screens on smart phones).\n\nIf not, then are there particular serif fonts suitable to use “everywhere.” If a separate sans serif font is needed for electronic media, are there those best to use for that media which would also work well with a “serif partner” for print. (BTW - Obviously, I do not think a single sans serif will work aesthetically for both print and web...but that does not mean I am right.)\n\nThank you for your input! (And sorry for the length of this, but it seemed best to provide the particulars.)\n\n",
  "author": "Kurt",
  "time": "26 Apr 2014 — 8:04pm",
  "uid": "191496",
  "comments": [
    {
      "time": "26 Apr 2014 — 11:55pm",
      "content": "People are using serif fonts for web text more these days, no doubt due to higher resolution screens.  \nKorinna would go well with Benguiat.\n\n"
    },
    {
      "time": "28 Apr 2014 — 5:42am",
      "content": "Thanks Nick! Korinna looks like an interesting solution--and like it should be good for use on screens large and small. Before I started reading on Typophile, I never really considered how much the selection of lettering could affect the presentation of a product or business. It is interesting to me that so few people seem consciously aware of the impact of lettering and yet I believe a large number are greatly affected subconsciously. I think the choice I make here is an important one and your assistance is much appreciated.\n\n"
    },
    {
      "time": "28 Apr 2014 — 9:19am",
      "content": "Wether one should use sans for screen depends on your target group. When they still have SVGA monitors and older versions of Windows, I’d say yes … ;–)\n\nThe number of pixels on an iPhone 4 retina display is about the same as an SVGA Monitor. The screen is smaller, but the users tend to read it at a smaller distance. In the 1980s viewing distances between 50 and 60 cm were advised. Smart phones are held at about 50% of that, I’d say. CRT monitors used to flicker, flat screens don’t. Above that, subpixel rendering suggests a resolution that is 3 to 9 times higher than the physical resolution of the screen. Deciphering small details as may occur when reading, has become far less cumbersome than in the past I think. Therefore, typefaces that have serifs and a thick-to-thin contrast which resembles that of regular body text typefaces as we see in books, newspapers and magazines perform very well on screens these days. As you suggested, we are (again) in a situation where the rules-of-thumb from the past have to be reviewed and revised.\n\nThin hairlines and thin serifs such as they are often found in skinny versions of Bodoni and Didot or poor versions of classical typefaces such as Bembo and ITC Garamond light should be avoided for reading text though. Especially when sizes are relatively small and texts tend to be rather long. But in that context we did not like those skinny faces in printed media either didn’t we? ;–)\n\n"
    },
    {
      "time": "28 Apr 2014 — 8:53am",
      "content": "\\> A company logo is still to be designed...\n\nIt's premature to be picking fonts if the logo hasn't been designed yet. (Unless you view them as temporary fonts that might change later). You say that \"the present product logo uses Benguiat\", but that doesn't necessarily mean it's the best choice for your company logo.\n\nYour entire identity system —&nbsp;logo, fonts, color palette, website, printed materials, packaging, signage, etc. — need to be designed to work together.\n\n\\> I'm not a graphic artist\n\nIt would be money well spent to work with one. If you have a tight budget perhaps a graphic design student at a local college could help for a small fee.\n\n"
    }
  ]
}
