{
  "id": "116150",
  "title": "Gill Sans based three-typefaces combination",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello everybody!  \nI am in trouble with a three-typefaces combination.  \nI have a logotype set in Gill Sans and I need a Sans Serif (for titles) and Serif (for texts) combination to work well with it.  \nThe logotype will often cohabit near type creating a trio that should be interesting. It also should be fresh and actual.\n\nRequirements for these two typefaces are:  \n- possibly designed by the same designer (not Eric Gill).  \n- in contrast with the Gill Sans logotype (maybe in x-height or other).\n\nAny suggestion?  \nThank you very much for your help!\n\n",
  "author": "P. Galihutson",
  "time": "29 Apr 2014 — 5:50am",
  "uid": "204257",
  "comments": [
    {
      "time": "29 Apr 2014 — 11:24am",
      "content": "Can’t say, without knowing which letters are in the logo, and whether upper/lower case.  \nPart of Gill Sans is humanist (e.g. /a and /g), part is geometric (e.g. /o and /w).  \nThat is signiﬁcant.\n\n"
    },
    {
      "time": "29 Apr 2014 — 12:38pm",
      "content": "@Nick Shinn:  \nReally proper observation! My mistake!\n\nLetters are all lower case and we have, alphabetical order: \"e\", two \"o\" (really distinctive feature as we are talking about Gill Sans), \"n\" and finally \"z\". There are also two \"N dashes\".  \nSo the entire vision appears more geometric than humanist.\n\nI also need to specify that Gill Sans glyphs have been modified rendering the \"o\" more circular (less mashed) and thickness contrasts less marked (for \"n\" and \"e\").\n\n"
    },
    {
      "time": "30 Apr 2014 — 3:10am",
      "content": "Up!  \nIs there no suggestion from your experience? :-)\n\n"
    },
    {
      "time": "30 Apr 2014 — 7:49am",
      "content": "Well it's tough. You say the logo is designed in Gill Sans.\n\nThen that the companion faces are:  \n\"- possibly designed by the same designer (not Eric Gill).\"\n\nYou mean you want two companion faces designed to work with Gill Sans by someone else besides Gill?\n\n"
    },
    {
      "time": "30 Apr 2014 — 7:55am",
      "content": "Possible choices of Optima, Hypatia, Avenir, Frutiger, or Formata for titles. Palatino looks good with Gill Sans and many of the other choices. Want something different in a serif look at Bramley.\n\n"
    },
    {
      "time": "30 Apr 2014 — 9:34am",
      "content": "@Jack B. Nimblest Jr.\n\nHello Jack!  \nYes I mean that I am searching for a pair of typefaces: a Sans Serif and a Serif both designed by the same designer (possibly authoritative in the world of typography but not Eric Gill). This pair of typefaces have to work well with the Gill Sans geometric logotype.\n\nThank you in advance for your interest! :-)\n\n"
    },
    {
      "time": "30 Apr 2014 — 12:22pm",
      "content": "@bojev\n\nHello Bojev,  \nabout your Frutiger suggestion I initially considered Univers... But Frutiger actually shares more glyph shapes with Gill Sans than Univers (e.g. \"e\", \"a\", \"t\") so can be an interest solution for the Sans Serif.  \nWhat do you think about marry it with a Meridien Serif for texts?\n\nAbout the other typefaces you mentioned I need time to value the combination with Gill Sans.  \nI would immediately rule out the Optima as not related to the world of communication/design/technology to which this brand belongs.\n\nThank you for your suggestions!\n\n"
    },
    {
      "time": "30 Apr 2014 — 1:33pm",
      "content": "Meriden Serif is just crisp enough that it might work well in this context. It is a nice face with enough weight to have impact. Good thought.\n\n"
    },
    {
      "time": "2 May 2014 — 1:22am",
      "content": "Ok Bob,  \nin my personal opinion:\n\n- Hypatia and Avenir: the contrast with Gill Sans is too short.  \n- Bramley: interesting but I am not sure to be able to use it appropriately in the context.\n\n- Formata: this is very interesting…it has an own strong character! I didn't know this typeface before.  \nAlso it works well with the Palatino you suggested so this can be a second interest combination (despite they were not designed by the same designer)!\n\n"
    },
    {
      "time": "2 May 2014 — 9:22am",
      "content": "@Nick Shinn\n\nHello Nick,  \nwhat do you think about these two options?\n\n- Gill Sans (geometrical logo) + Frutiger (titles) + Meridien (texts)  \n- Gill Sans (geometrical logo) + Formata (titles) + Palatino (texts)\n\nDo you think are interesting enough solutions or would you choose other ways?  \nI am very interested and curious about your professional opinion!\n\n"
    },
    {
      "time": "2 May 2014 — 12:14pm",
      "content": "The way you describe the logo, it sounds pretty generic.  \nYou could use anything to go with it.  \nThe proviso is that they should work together and the overall effect should suit the business.  \nYou should trust your judgement and ﬁnd faces that you would like to work with, or ones that you have already worked with and are comfortable with.\n\nDo you have any ideas about the relationship between body and titling faces that you would like to explore? Presumably the body is U&lc, but will the heads be regular or bold, U&lc or all caps? And how much bigger than the body? What about subheads? Are you going for an open leading spec or tight? Narrow or wide columns? Ragged or justiﬁed? Why are separate faces required for heads and body? How will captions &c. be handled?\n\nHow is it possible to choose a typeface without taking these parameters into consideration?\n\n"
    },
    {
      "time": "7 May 2014 — 7:29am",
      "content": "@ Nick Shinn\n\nYou are right, I realize that is difficult to give advices without having a look at the logo and knowing its intrinsic values. I tend to simplify because I already have these parameters in mind and already have quite clear ideas. Obviously I find it hard to transfer these values ​​here on the forum only by text...but I actually can not publish the logotype and nothing else related to it.  \nI will ask you an opinion on the finished work then!  \nMeanwhile, thank you!\n\n"
    },
    {
      "time": "7 May 2014 — 7:30am",
      "content": "Other suggestions from Typophile forum users, however, are welcome! :-)\n\n"
    }
  ]
}
