{
  "id": "116146",
  "title": "JollyGood Sans- another comic sans alternative",
  "forum": "Release",
  "tags": [
    "comic",
    "Comic Sans",
    "font",
    "handwriting font",
    "release",
    "Release"
  ],
  "content": "JollyGood Sans- the sensible alternative to the font that must not be named.\n\n(I know I'm late to the game- After more than a years' work, Comic Neue beat me by a few weeks :( )  \n ![](http://web.archive.org/web/20150415025640im_/http:/www.jollygoodfonts.com/images/jollygood_cover_s.png)  \n ![](http://web.archive.org/web/20150415025640im_/http:/www.jollygoodfonts.com/images/jollygood_waterfall_s.png)\n\nA while ago I decided to stop mocking comic sans and instead do something about it. I created _JollyGood Sans_ as a replacement that would keep the fun, informal, handmade feel of CS, but with a more polished look (seriously, have you taken a close look at the capital H in CS?).\n\nThe result is a family of _11 fonts_ (more on the pipeline) that are legible, web-friendly, and have very complete character sets, including ligatures and alternate letterforms.\n\nI hope it gives designers an alternative for when a comicsans-ish touch is needed.\n\nJollyGood Basic is free, the rest are 60% off for a limited time.\n\n[JollyGood Fonts](http://web.archive.org/web/20150415025640/http:/www.jollygoodfonts.com/)\n\n",
  "author": "spiral",
  "time": "29 Apr 2014 — 4:16am",
  "uid": "951",
  "comments": [
    {
      "time": "29 Apr 2014 — 8:48pm",
      "content": "This stands on its own merits, which is so much better than just starting with Comic Sans and correcting the most obvious problems as Comic Neue did.\n\nYou may want to double-check the webfonts; as they appear on your site there are some strange artifacts, most notably a mangled \"e\" in Light.\n\n"
    },
    {
      "time": "30 Apr 2014 — 2:11am",
      "content": "Thanks! I think I finally fixed that pesky \"e\".\n\n"
    },
    {
      "time": "1 May 2014 — 8:22am",
      "content": "That lowercase 'g' is rather fun!:\n\n ![](http://web.archive.org/web/20150415025640im_/http:/typophile.com/files/SS1_3461.jpg)\n\n"
    },
    {
      "time": "1 May 2014 — 11:40am",
      "content": "Lowercase g is my favorite glyph in general ;)\n\n"
    },
    {
      "time": "1 May 2014 — 1:42pm",
      "content": "Indeed, it's the only seriously challenging Latin glyph (in its binocular form).\n\nhhp\n\n"
    },
    {
      "time": "28 May 2014 — 2:27am",
      "content": "I find the unicase interesting, even if I'm not sure about some choices.\n\n"
    }
  ]
}
