{
  "id": "116137",
  "title": "Looking for serious typeface that evokes happiness as well",
  "forum": "Design",
  "tags": [
    "Happiness",
    "Happy",
    "Joy",
    "serious",
    "slogan",
    "typeface",
    "Design"
  ],
  "content": "As usual, a client that just says feelings and nothing more concrete than what I am looking for.\n\nFor a food chain, family-oriented / \"for the crowd\" kind of demographic, and I guess it will be in a certain shade of red (like ketchup.) Its commercial advertisments are usually depicting joy when being inside the establishment or patronizing their merchandise.\n\nCan anyone suggest? I am more leaning towards san serif typefaces since it is a tagline of sorts (can't say the tagline really, but something that in service with joy.)\n\nAny help, guide and/or suggestions would be much appreciated!\n\n",
  "author": "shanzz",
  "time": "28 Apr 2014 — 6:27pm",
  "uid": "217909",
  "comments": [
    {
      "time": "28 Apr 2014 — 7:56pm",
      "content": "\"Happy\" is pretty subjective but I suppose it has about the same effect as cute, or rounded, and avoiding a sterile mechanical style like Helvetica. For a sans try Yummo [http://www.myfonts.com/fonts/flat-it/yummo/](http://web.archive.org/web/20150417092806/http:/www.myfonts.com/fonts/flat-it/yummo/ \"http://www.myfonts.com/fonts/flat-it/yummo/\")  \nBut why restrict your choices to a sans?  \nFor example check out Laura Worthington's fat hybrid \\_Ganache \\_ [http://www.myfonts.com/fonts/laura-worthington/ganache/](http://web.archive.org/web/20150417092806/http:/www.myfonts.com/fonts/laura-worthington/ganache/ \"http://www.myfonts.com/fonts/laura-worthington/ganache/\")  \nOr fairy tales handwritten roman letters like Besley Hand [http://www.myfonts.com/fonts/juraj-chrastina/besley-hand/](http://web.archive.org/web/20150417092806/http:/www.myfonts.com/fonts/juraj-chrastina/besley-hand/ \"http://www.myfonts.com/fonts/juraj-chrastina/besley-hand/\")  \nThink outside the box.  \nBTW \"happy\" and \"serious\" seem to be incompatible as font criteria. But I can see \"happy\" and well designed as a great combination.  \nDon\n\n"
    },
    {
      "time": "28 Apr 2014 — 8:10pm",
      "content": "Strange – why does he want this to be \"serious\"? My only guess is he doesn't want it to look retarded-happy, like maybe this: [http://media.chick-fil-a.com/Media/Img/catalog/Pressroom/ImageLibrary/lo...](http://web.archive.org/web/20150417092806/http:/media.chick-fil-a.com/Media/Img/catalog/Pressroom/ImageLibrary/logos/Chick-fil-A-logo-sm.jpg?download=true \"http://media.chick-fil-a.com/Media/Img/catalog/Pressroom/ImageLibrary/logos/Chick-fil-A-logo-sm.jpg?download=true\")\n\nIn my view the main things that make a font friendly/happy are weight, width and a large x-height; it can have serifs, as long as their not delicate; and some controlled irregularity might help here too.\n\nSo what about this?  \n [http://typographica.org/typeface-reviews/swagg/](http://web.archive.org/web/20150417092806/http:/typographica.org/typeface-reviews/swagg/ \"http://typographica.org/typeface-reviews/swagg/\")\n\nhhp\n\n"
    },
    {
      "time": "28 Apr 2014 — 8:38pm",
      "content": "@donshottype  \n------------------------  \nThank you for articulating it better, but I do think that is why the client went to ask help to get the idea to be well designed.\n\nI think my client said 'serious' because he wanted it to look as something presentable for corporate purposes, sort of consistency and legibility or cleanliness in the font. 'Happy' can be associated to the roundness of the edges of the glyphs maybe or\n\nYummo & Ganache do seem to have the looks but i dunno what to make of it. The former has its thickest weight still lacking in a little more weight and the latter leaning to whimsical. Even with these, I'll try to present it to the client. Thanks.\n\nAny other opinions, comments and/or suggestions are greatly appreciated.\n\n"
    },
    {
      "time": "29 Apr 2014 — 5:54pm",
      "content": "@hrant  \n------------------------\n\nSame sentiments to why he wants it \"serious,\" but I agree that the client does not want it retard-happy haha!\n\nI agree with the weight & width, but I think the x-height can still vary, really depends on the typeface. Anyway, I am not closing it only on sans serifs; just that I lean towards it more.\n\nSwagg seems viable as an option too (especially the italics, which I haven't ventured in yet.) Thank you very much.\n\nFor both, @hrant & @donshottype  \n----------------------------------------------  \nAlso looking into other kinds of looks so yeah, outside-the-box thinking here as well.\n\nThank you thank you, but still open for more suggestions!\n\nEDIT:\n\nThe client wanted the usual typeface used in their previous output so even though most of you suggested well-designed typefaces, the client just used where he was comfortable. To all, thank you for helping me today. Have a great day!\n\nFinal EDIT:  \nThank you for the following:  \n@J Weltin for suggesting Finnegan by Jürgen Weltin  \n@hrant for suggesting Swagg by Richard Miller  \n@donshottype for suggesting Yummo by Ryoichi Tsunekawa & Ganache by Laura Worthington\n\n"
    },
    {
      "time": "30 Apr 2014 — 8:45am",
      "content": "How about Cachet, a sans with rounded corners (more obvious in bolder weights).  \n [http://www.myfonts.com/fonts/mti/cachet/](http://web.archive.org/web/20150417092806/http:/www.myfonts.com/fonts/mti/cachet/ \"http://www.myfonts.com/fonts/mti/cachet/\")\n\n"
    }
  ]
}
