{
  "id": "116220",
  "title": "Typographical Poem",
  "forum": "General Discussions",
  "tags": [
    "ancient",
    "Bookman",
    "Cloister",
    "General Discussions",
    "spartan",
    "Venus Bold Extended"
  ],
  "content": "I've been trying to track down a slightly bawdy typographical poem that I would guess dates to the mid-’60s. It uses the name of several typefaces, and the version I saw set the font name in the font in question (for which I will use caps):\n\n\"A SPARTAN BOOKMAN in his CLOISTER thought the ANCIENT world his oyster.....\"\n\nand finishes:\n\n\"He wants to be befriended by VENUS BOLD EXTENDED.\"\n\nDoes anyone have this? I'd love to be able to share it with my students.\n\njd\n\n",
  "author": "Jandos Rothstein",
  "time": "1 May 2014 — 4:01pm",
  "uid": "219762",
  "comments": [
    {
      "time": "1 May 2014 — 7:20pm",
      "content": "I seem to remember that from years ago, passed around the shop but I don't have a copy of it.\n\nIf you do find it, please post it here in its entirety. We could use some bawdy, I think. Except those that are married, of course; their wives surely would never approve of a printer being involved in something unseemly.\n\n"
    },
    {
      "time": "11 May 2014 — 5:09pm",
      "content": "I have found it, through Google Books:\n\nA Spartan Bookman in his Cloister  \nThought the Antique world his oyster  \nTimes Roman were his great delight.  \nItalian Old Style girls the height  \nOf Radiant beauty. What a shame  \nNo Wedding Text will he declaim.  \nInstead he’s Stymied in his Tower  \nShadow like and wonder how or  \nWhen he’ll find a Lydian pal,  \nA Cursive Legend of a gal.  \nHe yearns to be befriended  \nBy Venus Bold Extended\n\nThe various sources only display a few lines at a time, so the jpeg is collaged from screen grabs semi-competently in Photoshop. I have not found author info. I had some hope of resetting, but too many of the fonts have not been revived. The image is a bit blurry, but I'm guessing it was only set once. Everyone since first publication has only seen copies of copies.\n\n ![](http://web.archive.org/web/20140804040659im_/http:/typophile.com/files/BaudyTypePoemFlat_4425.jpg)\n\n"
    },
    {
      "time": "11 May 2014 — 7:35pm",
      "content": "Jandos Rothstein \\> Bawdy?! Back t0 the mid-’60s?! Share it with my students?! Uses the name of several typefaces?!\n\n@ How if not bawdy, new, could be shared with students, the married @ the unmarried and uses no name of any left to right typeface?!  \n [http://typophile.com/node/28634#comment-161482](http://web.archive.org/web/20140804040659/http:/typophile.com/node/28634#comment-161482 \"http://typophile.com/node/28634#comment-161482\")\n\nGeorge Thomas \\> Except those that are married?!; their wives surely would never approve of a printer being involved in something unseemly.\n\n@ For those who are married, would their spouses disapprove of a finger being involved in something unseemly?!\n\n"
    }
  ]
}
