{
  "id": "116219",
  "title": "My design portfolio",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Would just like to show my work off here and see was everyone has to say. I welcome comments.\n\n[https://craig-mcpeck.squarespace.com/portfolio/](http://web.archive.org/web/20150417090331/https:/craig-mcpeck.squarespace.com/portfolio/ \"https://craig-mcpeck.squarespace.com/portfolio/\")\n\nAnd my .pdf version ;\n\n[https://craig-mcpeck.squarespace.com/about/](http://web.archive.org/web/20150417090331/https:/craig-mcpeck.squarespace.com/about/ \"https://craig-mcpeck.squarespace.com/about/\")\n\n",
  "author": "craigomahawx",
  "time": "1 May 2014 — 3:18pm",
  "uid": "214061",
  "comments": [
    {
      "time": "1 May 2014 — 5:41pm",
      "content": "I like your hierarchy for most of your pieces. However, I would say that you shouldn't just include the computer image of your graphics but its applications in the real world. For example, let us see your logos on collateral pieces. That would be a nice touch on top of the computer image.\n\nYour logos have too many colors in my opinion (max should always be around 3/4) and you should always include the black/white version.\n\n"
    },
    {
      "time": "1 May 2014 — 7:55pm",
      "content": "I would add a very thin border to the Nebraska and Nationalites ones to define the edge. (Although the Nebraska one seems to have it already in the PDF version.)\n\nI agree with the comment about showing collateral pieces (a good mockup is fine), and also that a good black & white version is needed for every logo, but if you show a b&w version too I'd make it small (electronic media in full color is rapidly replacing print). That would also show the logo works in a small size.\n\nBut I don't think the 3 or 4 color idea is as important as it used to be (unless it just looks better that way). The client gets free color in electronic media, and in print media can use 4-color process if the budget allows or one color in budget jobs.\n\n"
    },
    {
      "time": "1 May 2014 — 8:22pm",
      "content": "Thanks guys they actually wanted more color. Its about them not me lol. I think it looked better with more color anyways.\n\n"
    },
    {
      "time": "2 May 2014 — 7:03pm",
      "content": "Advice: Kids in fifth grade do PhotoShop - become a Illustrator Master (vectors rule!) - get into FontLab and Fontographer - get a BA or a BFA then on to MFA, undergrad today is like high school in yesterday. You show promise - now make youself unique.\n\n"
    },
    {
      "time": "2 May 2014 — 9:09pm",
      "content": "Thank you! I ALWAYS use illustrator for logos. How could you not? Creating them in photoshop In my opinion is harder to do anyways. PHOTOshop is for editing photos not creating logos.\n\n"
    },
    {
      "time": "3 May 2014 — 9:58pm",
      "content": "Do you really think that urging someone at this level in their career into pursuing a degree at further cost is a better piece of advice over the more simple and less costly: \"practice more\"?\n\nPhotoshop is a tool, if you use it to mock up your designs, I wouldn't dare to call you a fifth grader. Why do you believe it's something the \"kids in fifth grade do\"?\n\n"
    },
    {
      "time": "4 May 2014 — 3:55am",
      "content": "My point was that kids today have computer graphics skills and kids in fifth grade do play with PhotoShop - Craig has gone way beyond that but the kids are coming up fast behind him and he has to continue to learn and improve. He's off to a good start but more training and yes, practice is what will keep him ahead of the next wave of designers. And we need to point out that most firms that hire designers look at degrees as a necessary requirement. But in the end learning more is what it is about not just getting better at what we already know.\n\n"
    },
    {
      "time": "4 May 2014 — 7:23pm",
      "content": "I'm all for college education, but I'm not sure that a master's degree is all that important in graphic design unless you plan to teach. But a bachelor's degree can be helpful as some design firms like to hire designers who have them, plus obviously good education and training is a good thing.\n\nAlso a student needs to think carefully about whether they are more comfortable in the fine arts or in graphic design. Some overlap but they are very different professions.\n\n"
    },
    {
      "time": "4 May 2014 — 11:07pm",
      "content": "Most firms hire starting at associates degree so no I do not think a higher degree is required. Someone with a higher degree could be extremely book smart in the subject but not be as good as the guy with the associates degree.\n\n"
    },
    {
      "time": "5 May 2014 — 4:13am",
      "content": "You both make good points and an associates degree is a good place to start - my point is that may not be the job you want to have for the rest of your career. And what you say about only needing a Masters if you want to teach may be good advice today but not in ten years. Maybe a BFA in Design and an MBA might be a good combo (or Marketing, Communications, or Advertising). No one path is good for everyone and I know good designers who have no degrees and are successful, just do not close off options early in your working life. A good college education does not just make you \"book smart\" it teaches you to think and to see beyond what you know. If you are only learning computer programs and techniques in your courses realize you do need more than just that to become a true \"creative.\"\n\n"
    },
    {
      "time": "5 May 2014 — 3:32pm",
      "content": "\\> I know good designers who have no degrees and are successful\n\nYep, so do I. A degree is a big help if you want to work for a design firm, but if you have your own business it's your portfolio, personality, and referrals that will get clients.\n\n"
    },
    {
      "time": "5 May 2014 — 5:08pm",
      "content": "It is your portfolio - the quality of you work - the attention to detail - the originality - and finally it is always the overall quality of you work that will make you a sucess ( personality and referrals are nice but it is your work that keeps clients.) And I still have too point out that clients like to know that you are credible and degrees and other training help you establish that.\n\n"
    },
    {
      "time": "6 May 2014 — 7:53am",
      "content": "Hi,\n\nI think it does not look too bad, but the scope is still a bit limited. You show off mostly logos, but a logo is mostly only part of an identity, so show how it is used in the context, where possible.  \nThe Boy Scouts of America Mid-America Council seems to be a good client, so try to show more of the work you did for them, like posters, brochure covers but also content pages showing detailed typography. You could also show some sketches to highlight the thinking behind the work.\n\nTry to really make your Portfolio stand out, select only the best works, and the works that best highlight the skills you have. I don't really understand some of the choices you made, and why some stuff is in your online portfolio but not in the PDF, and vice versa. IMHO I would ditch the Nebraska posters, as I do not think it is very inspired, quite generic. If you want to use this portfolio to get hired in a good firm, it should really make you stand out, and be original.\n\njust my 50 ¢...\n\n"
    },
    {
      "time": "6 May 2014 — 10:52am",
      "content": "I understand thank you for the comments! I could attach a PDF for the Annual Report I created thanks for mentioning that.\n\n"
    },
    {
      "time": "6 May 2014 — 7:34pm",
      "content": "\\> personality and referrals are nice but it  \n\\> is your work that keeps clients\n\nObviously the quality of your work is very important, but personality can also be important. A successful designer once said to me \"most clients are not design experts and can't tell good work from great work, but they know instantly if you're friendly and likeable and are giving them good service.\" He was right.\n\nSure, there are designers with bad personalities that are still successful. But in general, in professions that deal with clients a good personality is a big plus.\n\n"
    },
    {
      "time": "6 May 2014 — 9:28pm",
      "content": "Also its more so who you know in getting a job and not what you know. I have been looking for a job for over a year because most jobs want experience that I don't really have yet. Have over a year so far with the combined experience working for the Boy Scouts and the internship I had.\n\n"
    }
  ]
}
