{
  "id": "116373",
  "title": "The Creation Of The World. Illustrated Manuscripts from the Braginsky Collection A special exhibition at Jewish Museum Berlin",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": " ![](http://web.archive.org/web/20150322020536im_/http:/typophile.com/files/jm_plakat_web_5368.jpg)\n\n**The Exhibition**  \nRené Braginsky has compiled his spectacular collection of Hebrew manuscripts over a period of more than three decades. It includes medieval documents, artfully prepared wedding contracts, richly illustrated scrolls, illuminated manuscripts, and rare prints.\n\nThe collection is characterized by a particular connection between text and art, as these Hebrew scriptures were often decorated with very elaborate illustrations. The focus is on illustrated manuscripts that originated in central and northern Europe of the 18th century showing high points of Jewish manuscript art. All the major Jewish calligraphers and illuminators of the period are represented with outstanding works in René Braginsky’s collection.\n\n[http://www.jmberlin.de/main/EN/01-Exhibitions/02-Special-Exhibitions/201...](http://web.archive.org/web/20150322020536/http:/www.jmberlin.de/main/EN/01-Exhibitions/02-Special-Exhibitions/2014/braginsky.php \"http://www.jmberlin.de/main/EN/01-Exhibitions/02-Special-Exhibitions/2014/braginsky.php\")\n\n**The Design**  \nInk as the origin of calligraphy — the creation and hence the basis of the Hebrew script. The ink evolves into a calligraphic letter aleph, which is the first letter in the Hebrew alphabet. The image shows development, formation and movement and — in a very aesthetic way — the beauty and the origin of the Hebrew script culture.  \nDesign: Langesommer ( [http://www.langesommer.de/](http://web.archive.org/web/20150322020536/http:/www.langesommer.de/ \"http://www.langesommer.de/\"))\n\n ![](http://web.archive.org/web/20150322020536im_/http:/typophile.com/files/jm_einladung_web_5407.jpg)\n\n",
  "author": "patrick.s",
  "time": "8 May 2014 — 10:13am",
  "uid": "10234",
  "comments": [

  ]
}
