{
  "id": "116351",
  "title": "Kerning help",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Been looking at it for hrs and it's just not right. Is ATHE tighter than DRAL here? [http://i.imgur.com/nV8bxV4.png](http://web.archive.org/web/20150417083805/http:/i.imgur.com/nV8bxV4.png \"http://i.imgur.com/nV8bxV4.png\") Also if you can tell me if there's anything else's thats off I'd appreciate it.\n\nThanks\n\n",
  "author": "laasr",
  "time": "7 May 2014 — 3:12pm",
  "uid": "197794",
  "comments": [
    {
      "time": "7 May 2014 — 5:12pm",
      "content": "\"TH\" is way loose, and \"DR\" is slightly loose.\n\nhhp\n\n"
    },
    {
      "time": "7 May 2014 — 6:26pm",
      "content": "Wow, you totally got me on that one. TH is way too loose ? I mean if thats the case the whole thing would be too loose I'm thinking. So you're saying besides what you mentioned everything else was fine?\n\n"
    },
    {
      "time": "7 May 2014 — 6:33pm",
      "content": "Once those two are fixed smaller issues might become visible.\n\nhhp\n\n"
    },
    {
      "time": "7 May 2014 — 11:23pm",
      "content": "TH \\*is\\* way loose.  \nIt may help to focus on three letters at a time: If you look at THE you should see that there’s way more space between TH than HE.\n\n"
    },
    {
      "time": "8 May 2014 — 1:57am",
      "content": "I think that its more a matter of letterforms than kerning. The letters in ATHE are more complex than the DRAL. Maybe if the H was a bit simpler (not so many thin lines) and there was some kind of tail at the L like the first A? Or some other change that will \"distribute\" the decorative elements more evenly?\n\n"
    },
    {
      "time": "8 May 2014 — 5:45am",
      "content": "I see what you mean with TH. Im trying to get the same space between HE or the rest of them.\n\n"
    },
    {
      "time": "8 May 2014 — 5:46am",
      "content": "I'm trying for it to not be too tight, I want the whole thing a bit loosely spaced out, preferrably to H-E-D\n\n"
    },
    {
      "time": "8 May 2014 — 5:47am",
      "content": "In the original sketch there was a small flourish for the L but I removed that since got too much. But that's something to reconsider I guess\n\n"
    },
    {
      "time": "8 May 2014 — 5:48am",
      "content": "An update, this maybe ? [http://i.imgur.com/hBTQ7xh.png](http://web.archive.org/web/20150417083805/http:/i.imgur.com/hBTQ7xh.png \"http://i.imgur.com/hBTQ7xh.png\")\n\n"
    },
    {
      "time": "8 May 2014 — 5:55am",
      "content": "Much worse, to my eyes. I think everybody suggested to tighten (not to loosen) ‘TH’ and ‘DR’. If you want everything to be as loose as ‘TH’, you will need to loosen up all other combinations considerably.\n\n"
    },
    {
      "time": "8 May 2014 — 6:00am",
      "content": "yes I'm trying to loosen it up more. Previously TH was tighter than HE. Based on what you're saying now, if I loosen up the rest based on TH then we're going back to step1. Confusing.\n\n"
    },
    {
      "time": "8 May 2014 — 7:14am",
      "content": "So had a look at it again, TH is considerably more now which I think made it worse than it was before, almost matching that of H-E\n\nEdit update 3 [http://i.imgur.com/RG8U2EL.png](http://web.archive.org/web/20150417083805/http:/i.imgur.com/RG8U2EL.png \"http://i.imgur.com/RG8U2EL.png\")\n\n"
    },
    {
      "time": "8 May 2014 — 7:36am",
      "content": "I’d suggest to maybe go into this direction (just a quick and dirty sketch, mind you, based on your last upload):\n\n ![](http://web.archive.org/web/20150417083805im_/http:/typophile.com/files/athedral_4707.png)\n\n"
    },
    {
      "time": "8 May 2014 — 8:15am",
      "content": "Ok cool. So you increased it a tad bit with A-T nd H-E? Anything else?\n\n"
    },
    {
      "time": "8 May 2014 — 8:38am",
      "content": "For comparison, this is your upload, cropped the same way as my suggestion. Look at them next to each other to see the differences:\n\n ![](http://web.archive.org/web/20150417083805im_/http:/typophile.com/files/athedral_6338.png)\n  \nOther opinions on my suggestion are very welcome. \n"
    },
    {
      "time": "8 May 2014 — 9:18am",
      "content": "Thank you, that helped. so RA was loosened up a bit too. Cool. Appreciate the help.\n\n"
    },
    {
      "time": "10 May 2014 — 2:15am",
      "content": "Note that the idea generally is not primarily to equalize the linear distance (how close the rightmost bit of one letter is to the left side of the next) but rather the _area_ between the letters... As the T already has a lot of “air”&nbsp;under its uh, roof, it needs less distance to the letters around it than, say, an H would. That’s why the TH was in fact too loose in the beginning even though the linear distance between these letters was not much. Hope this makes sense.\n\n"
    },
    {
      "time": "13 May 2014 — 7:42pm",
      "content": "What Nina said.\n\nCurrently, HEDR are tight, AT and RAL are a bit too loose by comparison, and TH is far too loose.\n\n"
    }
  ]
}
