{
  "id": "116472",
  "title": "Critique: Monogram Logo",
  "forum": "Design",
  "tags": [
    "critique",
    "help",
    "logo",
    "monogram",
    "Design"
  ],
  "content": "Hello,\n\nI am new to the forums and am extremely exited to dig into them and join the conversations, for my first post I was wanting to get some feedback. I am currently working on some basic branding for myself and was wanting to know what you thought of the mark I made for myself. Could I get general impressions and what you think is wrong with it? Thanks so much!\n\nHere is my Old logo:\n\n ![](http://web.archive.org/web/20150416175643im_/http:/typophile.com/files/AN_Logo_5381.jpg)\n\nHere is my new one:\n\n ![](http://web.archive.org/web/20150416175643im_/http:/typophile.com/files/Screen%20Shot%202014-05-12%20at%203_5105.08.06%20PM.png)\n\n",
  "author": "andrewnas",
  "time": "12 May 2014 — 1:09pm",
  "uid": "220038",
  "comments": [
    {
      "time": "12 May 2014 — 2:06pm",
      "content": "If this is a logo, it's not just some letters, it has to say something. What are you trying to say?\n\nBTW shading is highly susceptible to \"corruption\" depending on size and repro conditions.\n\nhhp\n\n"
    },
    {
      "time": "12 May 2014 — 3:03pm",
      "content": "Andrew, how would this logo be used? And would your name appear below it as it does above?\n\nAs hrant said, those closely space lines won't reproduce well in all situations (like small sizes), but since you're a visual communications major I presume you'd make adjustments as necessary.\n\n"
    },
    {
      "time": "12 May 2014 — 4:19pm",
      "content": "Hrant, my concept behind it is that I both a designer and front-end developer in one, so I combined my initials into one form. Not sure that its the strongest concept though. I might just go back to my sketchbook.\n\nJames, It would be used just how it is shown above. Mostly on my portfolio site and business cards. I just wanted a basic logo, instead of typesetting my whole name like allot of people have been doing.\n\nThanks for the feedback by the way, it means allot. :)\n\n"
    },
    {
      "time": "12 May 2014 — 4:59pm",
      "content": "I think a pairing of letters actually offers great opportunities for expressing the dualism you mention. Think about how each side could be visually expressed (and which letter would be better at representing which aspect). Consider both uppercase and lowercase forms – and not necessarily the same for both\\*. Somehow fusing the two letters is generally nice, but not indispensable.\n\n\\* In fact a lc-UC sequence of itself sort of subtly conveys \"developer\".\n\nBTW what's that font you're using to set your name. And are you married to it?\n\nhhp\n\n"
    },
    {
      "time": "12 May 2014 — 5:49pm",
      "content": "\\> I might just go back to my sketchbook.\n\nDesigning a logo for yourself is difficult. I've known good designers who have been revising their own logos for years and still aren't satisfied. That's one reason many design firms end up just setting their name in type and leave it at that (Pentagram.com in an example).\n\nWe can offer advice, but ultimately you need to pick one that reflects your own style and personality.\n\n"
    },
    {
      "time": "12 May 2014 — 5:48pm",
      "content": "hrant-I love all the feedback you just gave me! Thank you so much! I'm currently using Lato just because thats what I have on my portfolio site I am developing. So no, I am not married to it at all. When I get some extra cash I plan on buying typeface rights and changing it anyways. Do you have any suggestions? I'll play with the letterforms a bit more and see what I get. Thanks again!\n\n"
    },
    {
      "time": "12 May 2014 — 6:46pm",
      "content": "If you think the designer/developer duality is a distinguishing and marketable thing about you, apply it to the font too!\n\nFree fonts save money, but since they're so easy to acquire they're not good for standing out. Also they generally don't render too well on all kinds of displays.\n\nSo try to find a recent commercial typeface that evokes your two aspects. Possibly something from this compilation:  \n [http://typographica.org/features/our-favorite-typefaces-of-2013/](http://web.archive.org/web/20150416175643/http:/typographica.org/features/our-favorite-typefaces-of-2013/ \"http://typographica.org/features/our-favorite-typefaces-of-2013/\")  \nWhat about Program?  \n [http://typographica.org/typeface-reviews/program/](http://web.archive.org/web/20150416175643/http:/typographica.org/typeface-reviews/program/ \"http://typographica.org/typeface-reviews/program/\")  \nWhat's interesting about Program here BTW is that it actually contains a duality itself! The Regular and Narrow styles have a different character.\n\nhhp\n\n"
    }
  ]
}
