{
  "id": "116452",
  "title": "Searching for a free hand script typographer",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm looking for someone experienced in creating \"free hand\" typography. I ran across a french guy online a couple of years ago but unfortunately I can't remember his name. But if you have any tips I'd be most thankful.\n\nBest\n\nPetter\n\n",
  "author": "P_P",
  "time": "12 May 2014 — 7:30am",
  "uid": "5167",
  "comments": [
    {
      "time": "12 May 2014 — 9:01am",
      "content": "It might help if you called it by its proper term: lettering.\n\nYou will find plenty of talented people.\n\nhhp\n\n"
    },
    {
      "time": "13 May 2014 — 12:20am",
      "content": "Thank you hhp. What is the title of someone working with lettering?\n\n"
    },
    {
      "time": "13 May 2014 — 1:42am",
      "content": "What Hrant is referring to is a calligrapher, someone who uses a pen to produce fine quality documents.\n\nThe term letterer usually refers to someone who fills in the word balloons in a comic.\n\nUnlike Hrant, though, I was not sure from your original post that you were, in fact, looking for a calligrapher. I thought that it was also possible you were looking for a typographer who used script typefaces to create an effect similar to calligraphy.\n\n"
    },
    {
      "time": "13 May 2014 — 8:56am",
      "content": "Actually to me \"letterer\" generally means somebody who renders letters –but not fonts– in any way; could be a logo, could be window signage... And I wasn't sure (and still am not :-) that P\\_P is looking for a calligrapher.\n\nhhp\n\n"
    },
    {
      "time": "13 May 2014 — 6:57pm",
      "content": "Also: Lettering Artist\n\n"
    },
    {
      "time": "14 May 2014 — 5:10pm",
      "content": "As far as my normal usage of the terms goes:\n\nCalligraphers write letters.\n\n(Hand) Letterers draw letters (in the context of a specific piece of text).\n\nType designers draw letters (to be reproduced in many texts).\n\n"
    },
    {
      "time": "15 May 2014 — 7:37am",
      "content": "Thank you all for clarifying.\n\n"
    },
    {
      "time": "15 May 2014 — 9:45am",
      "content": "Now that has been settled I dare to throw my hat in the ring.  \n [See example](http://web.archive.org/web/20140804023934/http:/stoetzner-gestaltung.prosite.com/239981/2808039/arbeiten-projects/leuchtenburg-museum-calligraphy)\n\n"
    }
  ]
}
