{
  "id": "116569",
  "title": "Dropped in at the deep end",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "Help Pricing Licencing"
  ],
  "content": "I have been dropped in the deep end and was recommended by someone to ask here for help.  \nMy predicament is that I created a typeface/font a while ago and wacked it on dafont for free for personal use and left a note saying email me about commercial use not expecting anything. I have now received an email from an award winning ad agency asking for a quote for 15 users, print and web use. This is pretty great news to come out of the blue but I am really stuck on how I'd price this. It's just a singe weight font with a small amount of glyphs(bare essentials). I also would love help on how I'd find create an appropriate licence for this.\n\nI really need help from someone with a lot more experience than me and this seems to be the place to be.\n\nThanks in advance,  \nxTeraa\n\n",
  "author": "xTeraa",
  "time": "15 May 2014 — 10:48am",
  "uid": "220149",
  "comments": [
    {
      "time": "15 May 2014 — 11:54am",
      "content": "Nice!  \nI think the fee should depend most of all on how unique it is; if there are many similar fonts out there, you can't ask for too much... Could you show the font in question?\n\nIn terms of authoring a license, I recommend emulating –but not copying– my favorite:  \n [https://monokrom.no/page/about\\_us/licensing\\_terms](http://web.archive.org/web/20140804041923/https:/monokrom.no/page/about_us/licensing_terms \"https://monokrom.no/page/about\\_us/licensing\\_terms\")  \nSee also: [http://typophile.com/node/100259](http://web.archive.org/web/20140804041923/http:/typophile.com/node/100259 \"http://typophile.com/node/100259\")\n\nhhp\n\n"
    },
    {
      "time": "15 May 2014 — 12:23pm",
      "content": "This is the font [http://www.dafont.com/lovelexiehandwritten.font](http://web.archive.org/web/20140804041923/http:/www.dafont.com/lovelexiehandwritten.font \"http://www.dafont.com/lovelexiehandwritten.font\")\n\nIt's nothing amazingly unique in terms of style just a handwritten typeface. It be nice to get something from the work I did. I don't even know the ballpark for something like this since I'm more of a Graphic Designer than a Type Designer.\n\nThank you for the links on licencing I will start reading through and creating one for this. Should I do a licence specifically for the deal (specifying 15 users and use on web/print).\n\n"
    },
    {
      "time": "15 May 2014 — 1:06pm",
      "content": "Normally handwriting is unique, but there are _so_ many handwriting fonts out there, including free ones with no commercial restrictions...\n\nMy gut feeling –that's all I can offer– says under $1000.\n\nSomething else BTW: your font is pretty unlikely to render well onscreen, at least at smaller sizes, FYI.\n\nhhp\n\n"
    },
    {
      "time": "15 May 2014 — 1:15pm",
      "content": "Thanks for the sizing tip, I'm guessing this is something inherent with the font design and not the way it was made?\n\nAnd as for pricing I was thinking around £300 for it all and that is way under $1000. I think it is a good price since as you said there are tons of other free commercially usable fonts or is this underselling it? I didn't even think it be close to $1000 and thought £300 might be pushing it.\n\nI can't thank you enough for the help by the way.\n\n"
    },
    {
      "time": "15 May 2014 — 1:23pm",
      "content": "Fonts have to be what's called \"hinted\" to appear well in low resolution, and few free fonts do that. You might eventually get an email from your client complaining, so make sure you cover your back on that (and tell them to have it professionally hinted if need be).\n\nhhp\n\n"
    },
    {
      "time": "15 May 2014 — 1:48pm",
      "content": "Ah, I've heard of pixel hinting and am guessing it's something similar where you line it up on the pixel grid so you don't get the sub pixels making it look out of focus. I will have to look into it and will also mention the sizing problem when emailing them back.\n\n"
    },
    {
      "time": "15 May 2014 — 6:51pm",
      "content": "I have no idea what a fair price is, but if this is an agency in a large city (New York, London, etc) they probably charge very high rates (I've been charged a couple hundred bucks just to have a logo emailed to me), so I might ask on the high side for the font.\n\n"
    },
    {
      "time": "16 May 2014 — 7:58am",
      "content": "Yh they are a pretty large agency but the only thing is I don't want to push a large amount because it's not that unique\n\n"
    },
    {
      "time": "16 May 2014 — 8:24am",
      "content": "And people get rich by being penny-pinchers...\n\nhhp\n\n"
    },
    {
      "time": "16 May 2014 — 10:00am",
      "content": "All I'm saying is that things are more expensive in large cities, and a big agency is probably charging an arm and a leg for their own services. But I certainly understand that you don't want to lose the deal.\n\nHrant, a large, successful agency is used to working with very talented people and paying top prices. But as I said, I can understand the OP's concerns.\n\n"
    },
    {
      "time": "16 May 2014 — 9:57am",
      "content": "True, when they itemize costs for a client and pass down the expense, anything goes...\n\nI remember seeing an invoice where a B&W 9\" monitor was $350... in the 80s.\n\nhhp\n\n"
    },
    {
      "time": "16 May 2014 — 10:01am",
      "content": "I recently did a job for a corporate client and their New York agency had to get involved a little bit, and their fee was just astronomical. When I mentioned it to my client, she just sighed and said \"I can't believe it either but that's what they charge.\"\n\n"
    },
    {
      "time": "16 May 2014 — 10:11am",
      "content": "I think the \"talent\" involved there is not the creative kind...\n\nhhp\n\n"
    },
    {
      "time": "16 May 2014 — 10:20am",
      "content": "One factor is you are often not dealing directly with the person who does the work. You go through a rep who passes the work to a supervisor and then it goes to the designer, then it's given to the proofreader, and you get billed for each of their times. And each of those folks is billed at a high rate, and even if it takes 3 minutes they probably round their time up to 15 or 30.\n\n"
    },
    {
      "time": "16 May 2014 — 10:33am",
      "content": "Thanks for the help James, I tried to message you on the forum but I guess it gets sent to your email\n\n"
    },
    {
      "time": "16 May 2014 — 7:49pm",
      "content": "Got your email, thanks.\n\n"
    }
  ]
}
