{
  "id": "116507",
  "title": "Looking for the best typography for equation & formula input",
  "forum": "Typography / Composition",
  "tags": [
    "equations",
    "formula",
    "math",
    "mathematics",
    "Typography / Composition"
  ],
  "content": "Hello Everyone,\n\nI represent a small University Press based on Mexico, we are about to start a textbook series for K-8 and highschool levels so we're consulting the professionals about the best-suited typography for equations & formula input. The one with all the bells and whistles.  \nWe hope you can help us with some suggestions.\n\nOur considerations so far are:  \nFreda Serif A  \nLe Monde Livre  \nAthelas\n\nThanks in Advance for your help.  \nAll best.\n\nLuis Sánchez  \n [luis.sanchez@editorial.udg.mx](mailto:luis.sanchez@editorial.udg.mx)  \n+52 (33) 3640-4594  \nComunicación y Diseño  \nEditorial Universitaria  \nUniversidad de Guadalajara\n\n",
  "author": "harrymanblack",
  "time": "13 May 2014 — 1:14pm",
  "uid": "67652",
  "comments": [
    {
      "time": "19 May 2014 — 8:28pm",
      "content": "<cite>we are about to start a textbook series for K-8 and highschool levels so we're consulting the professionals about the best-suited typography for equations &amp; formula input.</cite>\n\nI'm confused. What you have listed are \\*typefaces,\\* and not ones particularly suited for technical/mathematical typesetting. For one thing, they seem to lack the needed characters.\n\nI would assume, if you're going to be setting technical/mathematical material, you would consider some form of TeX -- LaTex, XeTeX, etc. The layout program (typesetting program) is going to be much more important than any font choice here.\n\nFortunately, the TeX uses of the world are usually quite willing to advise someone on font choices, based on the material needing to be set.\n\n"
    },
    {
      "time": "19 May 2014 — 10:05pm",
      "content": "Choosing a good layout program does not justify poor font choices.\n\nBTW I'm sure TeX users are a generous bunch and great at using TeX, but from what I've seen judicious type selection is not their forte, in general. (And Computer Modern still makes my hair stand on end.)\n\nhhp\n\n"
    },
    {
      "time": "20 May 2014 — 9:23am",
      "content": "So, Papazian, apparently you know of no good font choices which can successfully be combined with a layout program for Mr. Sánchez to typeset equations and formulas. Why, then, did you post? Do you in fact have such knowledge, but are unwilling to share it? Or are you suggesting that since nothing meets your criteria, Mr. Sánchez should abandon his efforts and seek other employment?\n\nMr. Sánchez -- since you've been a typophile member for almost four years, you already know Papazian rarely has anything helpful to offer, especially for people who want to <cite>use</cite> type.\n\nAny working professional should know there are type families other than Computer Modern which can be used with TeX. And the TeX community is a good place to ask about them. As a general note, many of the more technical books published through The Johns Hopkins University Press are typeset using LaTeX, as that is what most (technical) author's use to prepare their manuscripts. Much easier on all concerned to just follow through and use LaTeX to set the book after the editorial & design work is done. The designer must take the typesetting process into consideration, of course, but would in any case. How do you typeset a book requiring characters not available in a font?\n\n"
    },
    {
      "time": "20 May 2014 — 10:00am",
      "content": "You observation and analysis skills nicely match your grasp of typography.\n\nhhp\n\n"
    },
    {
      "time": "17 Jul 2014 — 3:01am",
      "content": "This is a somewhat old thread which just came to my notice.\n\nComputer Modern, although the current version is much improved over the original, is still questionable from a typographical standpoint.\n\nGiven that the textbook is not college-level, it may not be the case that you need a typeface with a comprehensive set of mathematical characters.\n\nThere are a number of open-source imitations of Times Roman that have extensive sets of mathematical characters (STIX, which has display problems in some programs, and TeX Gyre Termes, which has fewer mathematical characters, come to mind.)\n\nIf you prefer something resembling Palatino, there's Asana-Math; like STIX, it may have problems with some programs under Windows.\n\nSymbola, DejaVu Serif, and Quivira are other choices.\n\n"
    },
    {
      "time": "17 Jul 2014 — 3:41am",
      "content": "Luis, if you are still checking this, what layout application(s) are using for composing your equations? Have you considered (if it is a consideration) how you will transform to MathML or output digitally? Currently MathJax is one of the best tools for delivering equations in digital products and online but it uses the STIX fonts by default (for MathML) and this could mean a dramatic shift in look and feel between your printed and digital output. [There are workarounds](http://web.archive.org/web/20150317132748/http:/typophile.com/wiki/https%3A/%252Fgroups.google.com/forum/%2523%21msg/mathjax-users/PjcC7lqbNGs/z-EafIHplpoJ) but they are complex.\n\nIn terms of print there are numerous options, including TeX as mentioned above, [Microsoft Word](http://web.archive.org/web/20150317132748/http:/office.microsoft.com/en-us/word-help/write-insert-or-change-an-equation-HA001230361.aspx) (Cambria Math), [MathType](http://web.archive.org/web/20150317132748/http:/www.dessci.com/en/products/mathtype/) ( [Euclid](http://web.archive.org/web/20150317132748/http:/www.dessci.com/en/products/mathtype/misc/euclid_plain.gif) and various symbol fonts) and [PowerMath](http://web.archive.org/web/20150317132748/http:/www.phsoftware.com/pages/powermath_indesign.html) (Helvetica, Palatino, Times Ten and symbol fonts). I am sure there are more but these are the ones I am most familiar with. All of these applications come with typographic support as indicated in brackets but they may not fit your expectations.\n\nIt is important to keep in mind accessibility and by having clean MathML compliant mark up you should be fine. I am not as familiar with TeX output but would hope that accessibility would not be a problem.\n\nMurray Sargent's overview of <cite><a class=\"freelinking external\" href=\"http://web.archive.org/web/20150317132748/http:/blogs.msdn.com/b/murrays/archive/2006/09/13/752206.aspx\" rel=\"nofollow\">High-Quality Editing and Display of Mathematical Text in Office 2007</a></cite> is a must read.\n\n"
    },
    {
      "time": "17 Jul 2014 — 6:06am",
      "content": "Note that the typeface Cambria (i.e. Cambria Math) has been extended for high-quality editing and display of mathematical text in Office 2007. You may find valuable information in the booklet Mathematical Typesetting by John Hudson and Ross Mills made in 2007. [http://www.tiro.com/projects.html](http://web.archive.org/web/20150317132748/http:/www.tiro.com/projects.html \"http://www.tiro.com/projects.html\")\n\nAs mentioned above: [http://blogs.msdn.com/b/murrays/archive/2006/09/13/752206.aspx](http://web.archive.org/web/20150317132748/http:/blogs.msdn.com/b/murrays/archive/2006/09/13/752206.aspx \"http://blogs.msdn.com/b/murrays/archive/2006/09/13/752206.aspx\")  \nThis blog tells much about the Cambria project, and its compatibility with more recent standards concerning typing and editing mathematical equations and formulas.\n\n"
    },
    {
      "time": "17 Jul 2014 — 7:29am",
      "content": "I just had a look at the Mathematics Learning Standards for the state of Washington: [http://www.k12.wa.us/mathematics/standards.aspx](http://web.archive.org/web/20150317132748/http:/www.k12.wa.us/mathematics/standards.aspx \"http://www.k12.wa.us/mathematics/standards.aspx\")  \nThe documentations, examples etc. are typeset in a sans font (the common core has Gotham embedded; I thought there were embedding restrictions on [**&**](http://web.archive.org/web/20150317132748/http:/www.typography.com/fonts/gotham/overview/%E2%80%9C) fonts).  \nAre books for students also mostly typeset in a sans?\n\n"
    },
    {
      "time": "12 Aug 2014 — 3:00pm",
      "content": "<cite>Are books for students also mostly typeset in a sans?</cite>\n\nThat depends on the country you are in, and the time period.\n\nIn the English-speaking world, textbooks for the earliest primary grades used to be set in large sizes of Caslon, and then we saw Spot run in Century Schoolbook.\n\nIn some other countries, infanta versions of sans-serif faces are often resorted to in primary schools; in the English-speaking world, they're used for some storybooks that parents buy to read at home to their small children.\n\nFor older students, there was Monotype Modern Series 11 in the days before Times Roman conquered the world. These days, Baskerville, Garamond, Caledonia, Palatino... whatever is used for text setting in general may be found in a textbook. (Halliday and Resnick, a very popular first-year University physics textbook, was set in Baskerville.)\n\nNot that Helvetica or Univers could not be found in, say, a textbook on architecture or graphic design. My experience is with the physical sciences, where there was more conservatism, and I do not recall sans-serif faces in primary or secondary school textbooks in the 1960s.\n\nI know that I have come across a math book in an uncommon foreign language - perhaps it was Hungarian - set in a Venetian typeface, of all things.\n\n"
    },
    {
      "time": "1 Sep 2014 — 10:46am",
      "content": "For the K–12 level, you probably do not need any specialized math or TeX font. You may run into trouble with vector arrows in physics, but as far as I know, any good typeface with Greek support will do the job. Almost every professional font includes √, mathematical π Δ and ∂, ∫, ∞, and ∑, though I would make sure they have ≥ ≤≅ and the angle symbols since those are non standard. No font includes the characters for vincula and the radical overbar—either your equation engine makes them itself, of you manually construct them with em dashes or underscores.  \nIn my experience, I've found it easier to just manually typeset the built-up equations with text boxes and em dashes. Much more flexible that way and you can correct stuff that looks funny. I typeset an entire physics paper that way. The only place I can see you running into trouble is with the stretch parentheses and stuff—you might have to resort to a helper font that contains those symbols (or just draw the helper font yourself).\n\n[Example using just Minion Pro and a word processor](http://web.archive.org/web/20150317132748/http:/1.bp.blogspot.com/-7v3h0CnOhWU/VASwkryLhUI/AAAAAAAAAdY/wQbUbY20vYk/s1600/Screenshot%2B065.png)\n\n"
    },
    {
      "time": "1 Sep 2014 — 12:21pm",
      "content": "That is surprisingly good. Here are both the previous image and what I get with the LaTeX MinionPro package.\n\n![](http://web.archive.org/web/20150317132748im_/http:/typophile.com/files/minion_editor_6646.png)  \n(as above)  \n ![](http://web.archive.org/web/20150317132748im_/http:/typophile.com/files/LatexMinion12pt_5934.png)  \n(with LaTeX and MinionPro with lining figures)\n\nOpen images in new window to see full size.\n\n"
    },
    {
      "time": "1 Sep 2014 — 3:05pm",
      "content": "Interesting how LaTeX just scales up the parentheses with no regard to weight. Probably bc it couldn't find the character in Minion Pro? I used a light weight of Garamond for those parentheses\n\n"
    },
    {
      "time": "1 Sep 2014 — 4:51pm",
      "content": "The [MinionPro package](http://web.archive.org/web/20150317132748/http:/www.ctan.org/tex-archive/fonts/minionpro) uses the MnSymbol fonts that were designed to be used with Minion. Here are all the fonts included in the pdf:\n\n    MinionPro-Capt\n    MinionPro-It\n    MinionPro-Regular\n    MnSymbol12\n    MnSymbol8\n\nI used pdfLaTex; so the MnSymbol fonts come from Type 1 files; there are files for 5, 6, 7, 8, 9, 10 and 12 points. I thus presume the way the parentheses scale follow the designer's preferences.\n\nIf I compile the same file with the package fourier (Utopia based), which is the package I use regularly, here is what I get:  \n ![](http://web.archive.org/web/20150317132748im_/http:/typophile.com/files/eqn_utopia_four_6343.png)  \n(Equations using the Fourier math font and Utopia)  \nThe large parentheses are less agressive. The fonts used are (listed with `pdffonts` on the pdf file)\n\n    Fourier-Math-Extension\n    Fourier-Math-Letters-Italic\n    Fourier-Math-Symbols\n    Utopia-Italic\n    Utopia-Regular\n\nThere is no \"opticals\".\n\nI don't think I would parenthesize the way you did though. I usually put smaller parentheses inside larger ones which would give something like this (with fourier)  \n ![](http://web.archive.org/web/20150317132748im_/http:/typophile.com/files/fourier_paren_x4_4469.png)  \n(Open in new window for larger image)\n\n"
    }
  ]
}
