{
  "id": "116505",
  "title": "Centaur body text--minimum size and leading",
  "forum": "Design",
  "tags": [
    "centaur",
    "Design"
  ],
  "content": "I'm setting a devotional book (selections from the BCP) and am trying Centaur for it. Adobe Centaur is what I have. I know it's often, though not always, been used in larger text sizes (e.g., Bruce Rogers used a custom version for the Bible with 22 point text if memory serves). Anyway, I'm trying 13/16 with a fairly narrow line length. I welcome any criticism, but want to particularly ask for thoughts on (1) whether the type size is too small to make effective use of Centaur, (2) whether the leading is sufficient, and (3) whether the italic is too tight and needs some letterspacing (not that I want to steal sheep or anything). But all criticisms are welcome. Thanks.\n\n| Attachment | Size |\n| --- | --- |\n| [devotional text (for typophile).pdf](http://web.archive.org/web/20150416161619/http:/typophile.com/files/devotional%20text%20(for%20typophile).pdf) | 55.62 KB |\n\n",
  "author": "grafton",
  "time": "13 May 2014 — 11:36am",
  "uid": "220086",
  "comments": [
    {
      "time": "13 May 2014 — 1:17pm",
      "content": "I find your leading too wide - it all looks abit too spread. Maybe 13/15\n\nI do love the feel of your layout and I have always been a fan of Centaur -\n\n"
    },
    {
      "time": "13 May 2014 — 2:41pm",
      "content": "I think everything is OK, except the optical scaling of the font.  \nThe body text is too wispy—that is a shortcoming of this rendition of Centaur; but you can heavy it up with the Stroke feature in InDesign.  \nAnd the Drop cap is too clunky—try thinning it down with Stroke, or use a display face.  \nHoeﬂer’s Requiem would be an alternative.\n\n"
    },
    {
      "time": "13 May 2014 — 2:53pm",
      "content": "Consider switching to Centaur's 21st century cousin, Satyr:  \n [https://monokrom.no/fonts/satyr](http://web.archive.org/web/20150416161619/https:/monokrom.no/fonts/satyr \"https://monokrom.no/fonts/satyr\")\n\nhhp\n\n"
    },
    {
      "time": "13 May 2014 — 4:58pm",
      "content": "Satyr is a nice face but I feel a bit too heavy for this use - Centaur is tricky to use but worth the effort.\n\n"
    },
    {
      "time": "14 May 2014 — 11:50am",
      "content": "I will agree that the main problem is with the typeface. Centaur is beautiful but the digitized version does not really serve as a text typeface.  \nMaybe you can save it by using a larger size but it seems you can't change the type size much before your lines become too sort.  \nA very interesting alternative to Centaur is [Vendetta](http://web.archive.org/web/20150416161619/http:/emigre.com/EF.php?fid=130). I just received a test copy of a book I made with Vendetta (medium weight) and I am very happy with the result. Or else you can use Arno or a Jenson revival.\n\n"
    },
    {
      "time": "14 May 2014 — 12:19pm",
      "content": "Bob, now I'm wondering if Faunus can do the job...  \n [https://monokrom.no/fonts/faunus](http://web.archive.org/web/20150416161619/https:/monokrom.no/fonts/faunus \"https://monokrom.no/fonts/faunus\")\n\nhhp\n\n"
    },
    {
      "time": "14 May 2014 — 1:38pm",
      "content": "Both Hrant and Dimitris have come up with good alternative faces to consider. I am a fan of Iowan Oldstyle by John Downer and was not aware of Vendetta - another sucess for him. As to Centaur, Nick makes a good point about Centaur being wispy - when Bruce Rogers used it he had ink spread to give it more body - when I have used it I always track it close and that seems to give it more \"bulk\". I would say you should look at Vendetta and Faunus but also try Nick's idea with Centaur.\n\n"
    },
    {
      "time": "14 May 2014 — 5:22pm",
      "content": "Thank you all for the excellent suggestions. I liked Vendetta and Faunus (especially the latter--amazing) but had some concern that they might call attention to themselves for this particular project. I've set it in Requiem, as suggested by Nick (using 12/15). It looks great to my eyes. I would post a new set of sample pages here in Requiem, but I can't add an attachment to a comment. If anyone is interested in seeing the Requiem version, I'll start a new thread for it. Again, thanks to all for the suggestions.\n\n"
    },
    {
      "time": "15 May 2014 — 4:46am",
      "content": "Requiem seems a very good substitute for Centaur. Anyway, I would also have a look at Bembo Book.\n\n"
    }
  ]
}
