{
  "id": "116540",
  "title": "Pairing a paragraph typeface with Stratum",
  "forum": "Design",
  "tags": [
    "combining",
    "Design"
  ],
  "content": "Hello friends. I'm looking for an appropriate typeface to pair with Stratum:\n\n[http://processtypefoundry.com/fonts/stratum-1-and-2/](http://web.archive.org/web/20150416164031/http:/processtypefoundry.com/fonts/stratum-1-and-2/ \"http://processtypefoundry.com/fonts/stratum-1-and-2/\")\n\nWe'll be using Stratum for headlines, most often in the bold weight, all-caps. Are there any typefaces that you'd recommend to be used for paragraph text alongside it? I haven't quite decided if we'd like to go serif or sans-serif with it, as I'd like to try out both. The overall tone we're going for is something modern, geometric, no-nonsense and direct. Thanks for any help!\n\n",
  "author": "ericcarl",
  "time": "14 May 2014 — 12:10pm",
  "uid": "51397",
  "comments": [
    {
      "time": "14 May 2014 — 12:15pm",
      "content": "I should also note that these typefaces will be used for a website design first, but then applied to print material later. It would be fantastic to find something that's been hinted for web use but that also works well for print.\n\n"
    },
    {
      "time": "14 May 2014 — 3:45pm",
      "content": "Not modern &c., but my [Richler](http://web.archive.org/web/20150416164031/http:/www.myfonts.com/fonts/shinn/richler/webfont_preview.htmlr) is a squarish, angular typeface, with an open fit that works well on screen.\n\n"
    },
    {
      "time": "14 May 2014 — 10:34pm",
      "content": "Thanks for the recommendation Nick. It might have a little more personality than I'm looking for, but I'll add it to the list.\n\n"
    },
    {
      "time": "15 May 2014 — 9:59am",
      "content": "I thought I'd ask Eric Olsen over at Process about any recommendations. Here's a nice response from him for anyone else that might be interested (hope he doesn't mind my posting it):\n\n> \"Since Stratum is so assertive, it does best in the lead role with other typefaces acting as support. I can't offer anything specific, pairing typefaces is extremely project specific, but the best pairings I've seen track in the opposite direction of Stratum. For instance, Metropolis magazine used Stratum for years with slab serifs and Bodoni. The latter pairing reveals a bias of mine as well - typographic contrast. Again being so assertive, it's best to contrast the loud voice of Stratum with something delicate. But, this also makes some assumptions about usage and size that are very project specific.\n> \n> \"All of that said, my best advice is to avoid something with implied geometry like Stratum because the resulting pair can be harsh. I'm always impressed by the pairing options designers can come up with - I've enclosed one below with fashion designer Paul Smith. I never would have suggested a hand drawn typeface with Stratum, but there it is!\"\n\nThis is the Paul Smith pairing he's referring to: [http://assets.sbnation.com/assets/2016057/Paul\\_Smith\\_Giro\\_2013\\_Jerseys.jpg](http://web.archive.org/web/20150416164031/http:/assets.sbnation.com/assets/2016057/Paul_Smith_Giro_2013_Jerseys.jpg \"http://assets.sbnation.com/assets/2016057/Paul\\_Smith\\_Giro\\_2013\\_Jerseys.jpg\")\n\nSo it looks like I'll be exploring some options that contrast it more—less geometric and more delicate.\n\n"
    },
    {
      "time": "16 May 2014 — 8:38pm",
      "content": "As Grace Slick once sang, “Either go away or go all the way.” Meaning here that one should avoid things that kind of go together, because that looks like a mistake.\n\n"
    }
  ]
}
