{
  "id": "116674",
  "title": "Font suggestions--Old Style like Garamond or Palatino?",
  "forum": "Serif",
  "tags": [
    "body fonts",
    "non-lining",
    "old style",
    "Serif"
  ],
  "content": "I want to use a font with old-style proportions, old-style numerals, ff, ffi & ffl ligatures as well as fi and fl, and italics. I am editing an anthology of short stories on Microsoft Word, so suggestions should come in the form of either links to TrueType or OpenType free downloads, or versions of fonts on Word that you know possess all these features. So far, the only font that really fits the bill is Georgia, but I don't like its heavy proportions; they are less elegant than old style fonts.\n\n",
  "author": "Cohnishere",
  "time": "19 May 2014 — 2:07pm",
  "uid": "220274",
  "comments": [
    {
      "time": "19 May 2014 — 2:48pm",
      "content": "Why does it have to be free?\n\nhhp\n\n"
    },
    {
      "time": "19 May 2014 — 3:00pm",
      "content": "I think the answer to that is pretty obvious.\n\nIf you have any suggestions that I'd have to pay for, please tell, but I don't think there needs to be any derision over a want for not having to pay.\n\n"
    },
    {
      "time": "19 May 2014 — 3:10pm",
      "content": "Sometimes people have a good reason to require a free font, but editing an anthology on Word doesn't seem like one. Also, some good commercial fonts cost less than one month of cellphone service, fancy shoes, etc. Just because free fonts exist doesn't create a requirement to never spend any money on fonts. Especially since you seem to be sensitive to typography, and you can't be exceptional with fonts that anybody can acquire with zero commitment.\n\nFirst place I'd look:  \n [http://typographica.org/features/our-favorite-typefaces-of-2013/](http://web.archive.org/web/20150317171255/http:/typographica.org/features/our-favorite-typefaces-of-2013/ \"http://typographica.org/features/our-favorite-typefaces-of-2013/\")\n\nhhp\n\n"
    },
    {
      "time": "19 May 2014 — 5:17pm",
      "content": "To me, the main reason for wanting an open-source font would be to be able to use it on a web site.\n\nThere are fonts that are not free, but still very inexpensive, for printing things on a laser printer. Some word processing programs provided a large selection of fonts as one way to compete with Microsoft Word.\n\nI don't know offhand of a free Garamond. There are open-source imitations of Palatino for use with Linux for example - such as TeX Gyre Pagella.\n\nIf you look through Google Web Fonts, you should find a few old style ones. Unfortunately, one of the nicest, Goudy Bookletter 1911, has a coding problem that prevents it working properly with some older Windows programs, such as WordPad.\n\nAnother free old style font is Day Roman.\n\n"
    },
    {
      "time": "19 May 2014 — 8:06pm",
      "content": "Thank you; those are some very nice fonts. I get Garamond on Word but it doesn't have ff ligatures, which is why I am shunning it. I don't mind lining figures but would rather have non-lining, so it's only optional really. I just managed to swindle Adobe Caslon Pro by means of free trial, which I have always liked, although it doesn't have old style numerals.\n\n"
    },
    {
      "time": "20 May 2014 — 8:38am",
      "content": "> I don't know offhand of a free Garamond.\n\nEB Garamond.\n\nI'm also a big fan of Alegreya, though it might be a bit too pretty to serve as an \"invisible\" book font.\n\n"
    },
    {
      "time": "20 May 2014 — 2:41pm",
      "content": "And neither Day Roman nor EB Garamond nor TeX Gyre Pagella has those ligatures. A lot of non-free typefaces do, such as the Bitstream faces, so the feature is not rare.\n\nOh, and by the way, this is not the forum in which to brag about your successes in font piracy. Most of the posters here are professional font designers, who would like to make a living from their work.\n\n"
    },
    {
      "time": "20 May 2014 — 2:57pm",
      "content": "Yes, free fonts tend to skimp on all aspects of the craft.\n\nBTW great sentiment on piracy, but that doesn't seem to be the case here.\n\nhhp\n\n"
    },
    {
      "time": "20 May 2014 — 3:41pm",
      "content": "I'm sorry if the expression 'swindled' rubbed you the wrong way--it wasn't meant to be taken literally; what I did at Adobe was, to the best of my knowledge, legal.  \n For me Day Roman had a multitude of fantastic ligatures in a separate font file. It didn't have italics though. But most likely I will be using Hightower, which is on word but without ff ligatures, so I'll probably buy the MyFonts version. I found that Hightower was quite similar to Goudy Bookletter, having more character than so-called invisible fonts.\n\n"
    },
    {
      "time": "20 May 2014 — 6:30pm",
      "content": "I apologize for misunderstanding your reference to the use of a free trial; usually, a \"free trial\" means something is available for a limited period or under a restrictive license, and so it sounded as though you had a limited-time version of a font, and made a permanent copy.\n\nI should have known better than to imagine that such DRM for fonts exists, however.\n\nAnd I did forget that you could put the ligatures in manually with the companion Day Roman - Expert font.\n\n"
    },
    {
      "time": "20 May 2014 — 8:58pm",
      "content": "May I suggest my Espinosa Nova? Regular is free. [http://www.myfonts.com/fonts/estudio-ch/espinosa-nova/](http://web.archive.org/web/20150317171255/http:/www.myfonts.com/fonts/estudio-ch/espinosa-nova/ \"http://www.myfonts.com/fonts/estudio-ch/espinosa-nova/\")\n\nAnd it does have ff ligatures.\n\n"
    },
    {
      "time": "26 May 2014 — 12:27pm",
      "content": "> And neither Day Roman nor EB Garamond nor TeX Gyre Pagella has those ligatures.\n\nOh really? This is from EB Garamond's PDF specimen:\n\n ![](http://web.archive.org/web/20150317171255im_/http:/typophile.com/files/garaa_4731.png)\n  \n\n ![](http://web.archive.org/web/20150317171255im_/http:/typophile.com/files/garab_5022.png)\n\n@Hrant:\n\n> Yes, free fonts tend to skimp on all aspects of the craft.\n\nI can see why you'd be interested in propagating that opinion, and it might have been true ten years ago. Luckily, there's a number of good free options these days.\n\n"
    },
    {
      "time": "26 May 2014 — 6:22pm",
      "content": "That \"tend to\" covers the notable exceptions (of which we indeed do have more now than ever before). What I'm interested in propagating is quality. And I don't like people being cavalier about where that comes from.\n\nhhp\n\n"
    },
    {
      "time": "30 May 2014 — 5:35am",
      "content": "I may be wrong on this, and it might depend on your version of Word, but I have the uneasy feeling that Word will simply not implement ligatures, even for fonts that have them. I know that fonts that I know to have ligatures do not display them in Word 2013 for Windows, even though the ligatures are all present and correct in Indesign. Perhaps you should check with Microsoft?\n\n"
    },
    {
      "time": "2 Jun 2014 — 2:30am",
      "content": "The version of Word I have allows you to switch on \"all ligatures\", but not the standard ligatures only. That's an outdated version, though; it might be better in newer versions.\n\nPages does ligatures automatically, and it allows access to Apple's typography panel, which is great... but I find it maddening for other reasons. For instance, its hyphenation function sucks, and it doesn't recognize soft hyphens.\n\nUse LaTeX, maybe...?\n\n"
    }
  ]
}
