{
  "id": "116699",
  "title": "Font Isn't Printing from InDesign 5.5 and Not Showing Up in Word",
  "forum": "Build",
  "tags": [
    "definefont",
    "error message",
    "Font Book",
    "font problems",
    "InDesign",
    "Microsoft Word",
    "offending command",
    "rangecheck",
    "Build"
  ],
  "content": "I've received an issue from a customer who purchased my font and is having trouble with it in InDesign 5.5 and Word. I've never come across this issue before with any other user and I have successfully used it in but programs so I'm not quite sure how to fix the problem on my end. Here is the message I received from them:\n\nI received the attached error message when trying to use the font in Microsoft Word. When I validate the font in Font Book, it says the font is safe to use. When I tried printing an InDesign document with the font, it would not print. PDF's of the document will not print either. I did not receive an error message, but my colleague received the error message in Indesign 5.5:\n\nERROR: rangecheck  \nOFFENDING COMMAND: definefont\n\n---\n\nAs an fyi, the customer originally reported they are working on Mac OS X 10\\_6\\_8 in Microsoft Word for Mac 2011.\n\n ![](http://web.archive.org/web/20150420125253im_/http:/typophile.com/files/Lunchbox%20Slab%20Ornaments%20Error_4416.png)\n\n",
  "author": "kimmyk",
  "time": "20 May 2014 — 11:10am",
  "uid": "216641",
  "comments": [
    {
      "time": "20 May 2014 — 1:10pm",
      "content": "Was the font generated from Fontographer or Fontlab and what version?\n\n"
    },
    {
      "time": "21 May 2014 — 1:24am",
      "content": "With regard to Microsoft Word 2011, the issue is likely to stem from a lack of support for [third party fonts that do not conform to very specific naming standards](http://web.archive.org/web/20150420125253/http:/support.microsoft.com/kb/295062). [Adam Twardoch has created guidelines for font creation](http://web.archive.org/web/20150420125253/http:/forum.fontlab.com/index.php?topic=313.0) that should help you to avoid this issue.\n\n"
    },
    {
      "time": "21 May 2014 — 3:42am",
      "content": "I suspect one or more outlines is too complex (e.g. too many contours or points), but it can also be a hinting related issue.\n\nDoes the font contain TrueType outlines or CFF data?\n\n"
    },
    {
      "time": "21 May 2014 — 4:57am",
      "content": "Fontographer has a feature that can reduce the number of points while retaining the basic shape - too many points is a problem with complex ornaments. Fontographer instructions used to suggest using several glyphs and set sidbearings so they overlaped to make complete ornament, logo etc.\n\n"
    },
    {
      "time": "21 May 2014 — 8:40am",
      "content": "Another way to reduce outline complexity is to turn short or shallow curves into straight lines.\n\nhhp\n\n"
    },
    {
      "time": "23 May 2014 — 3:40pm",
      "content": "Thank you everyone.\n\n@bojev: I'm working in Fontlab 5.1.2.\n\n@Karl Stange: thank you for the article, I will definitely use it and re-generate the font using the naming standards.\n\n@erwindenissen: I believe the font contains TrueType outlines. I suppose it is possible that the font is too complex, it's a hand drawn-esque font so getting the detail from the imperfect penstrokes was important to me. I wouldn't say there are a TON of points per each letter, but more than a standard system font. I use contextual alternatives and have a lot of style variations making the number of characters large. Could that have something to do with it?\n\n@hrant: How do you turn shallow curves into straight lines? I would be happy to try that!\n\nThe font has been on the market for awhile and this is the first I've encountered this issue, but it's now happened to two separate users so I would really like to figure out what's going on. If anyone is interested in taking a look at it (if that makes this process easier) I would be happy to send it to you.\n\nThanks again and I look forward to hearing from you all .\n\n"
    },
    {
      "time": "23 May 2014 — 3:48pm",
      "content": "Remove the control points.\n\nhhp\n\n"
    },
    {
      "time": "23 May 2014 — 7:09pm",
      "content": "If you have access to Fontographer try generating the font from it - it seems to produce a more error few product sometimes than Fontlab.\n\n"
    },
    {
      "time": "27 May 2014 — 12:54pm",
      "content": "@bojev I am happy to get Fontographer if it will fix this issue. Do I just open the .vfb file or is there exporting that needs to be done.\n\nThanks so much for your help!\n\n"
    },
    {
      "time": "27 May 2014 — 2:12pm",
      "content": "Although Karl is correct about there being some issues with Word 2011, the symptoms you report do not seem to match the known font naming issues we see with Word for Mac.\n\nThe RangeCheck error is a fairly generic PostScript error, indicating that some value generated somewhere in the output file was too large or small for the printer to handle. Although glyph complexity is one potential problem, and perhaps the most common, there are many other possibilities, including outline or hint coordinates being out of bounds.\n\nKimmy, feel free to contact FontLab support for help as well.  \n [http://www.fontlab.com/contact-and-support/product-support/problem-report/](http://web.archive.org/web/20150420125253/http:/www.fontlab.com/contact-and-support/product-support/problem-report/ \"http://www.fontlab.com/contact-and-support/product-support/problem-report/\")\n\n"
    },
    {
      "time": "12 Jun 2014 — 3:46pm",
      "content": "Thank you Thomas, I have reached out to FontLab, hopefully they can help me figure out what's going on.\n\n"
    },
    {
      "time": "12 Jun 2014 — 4:49pm",
      "content": "Great. Jimmy, our support guy, will probably need to see the font file to see if he can figure it out. The error is coming from the PostScript printer itself, btw.\n\n"
    }
  ]
}
