{
  "id": "116724",
  "title": "A couple of newbie questions",
  "forum": "General Discussions",
  "tags": [
    "em dash",
    "en dash",
    "General Discussions",
    "small caps"
  ],
  "content": "Here's a few things that have been on my mind lately.\n\nIf using the European en dash style in text, what should be used for breaks of thoughts and interruptions – en or em dashes?\n\nHow do you deal with acronyms in italicized passages if you've been using small caps throughout the text and, like in most fonts, you don't have italic small caps?\n\nSpeaking of small caps, is there a special case when they begin a sentence (inside a paragraph)?\n\n",
  "author": "inktrap",
  "time": "21 May 2014 — 8:15am",
  "uid": "176144",
  "comments": [
    {
      "time": "21 May 2014 — 8:34am",
      "content": "Bringhurst in Elements of Typograhic Style says to use spaced en dashes — rather than em dashes or hypens to set off phrases.\n\n"
    },
    {
      "time": "21 May 2014 — 10:15am",
      "content": "I meant when using en dashes parenthetically what to use for interruptions such as “They couldn't hit an elephant at this dist—”\n\n"
    },
    {
      "time": "21 May 2014 — 10:27am",
      "content": "That's why I omit the spaces on the insides of en-dash parentheticals.  \n [http://armenotype.com/2012/04/archipelago/](http://web.archive.org/web/20140804013024/http:/armenotype.com/2012/04/archipelago/ \"http://armenotype.com/2012/04/archipelago/\")  \nSee the ends of the second and third paragraphs.  \nAs you can see I also use guillemets in English.  \nThe em-dash I use rarely, like for an attribution with space(s) in it:  \n\"— Gustave Flaubert\" (versus \"– Heraclitus\")\n\nMake your own style. Just base it on logic.\n\nhhp\n\n"
    },
    {
      "time": "23 May 2014 — 8:12am",
      "content": "Questions regarding dashes are usually decided by a project's writer, using the style guide they've chosen. If there is no writer, buy a good style guide for reference. You can find a list of common guides here:  \n [http://en.wikipedia.org/wiki/Style\\_guide](http://web.archive.org/web/20140804013024/http:/en.wikipedia.org/wiki/Style_guide \"http://en.wikipedia.org/wiki/Style\\_guide\")\n\nIf a paragraph begins with a small cap I might ask the writer to reword the sentence for a better appearance. If they don't want to, I'd stick with small caps to be consistent with the style I'm using elsewhere (assuming the small caps are intended as capitol letters, which is usually the case, like in an acronym such as NASA).\n\n"
    },
    {
      "time": "23 May 2014 — 4:25pm",
      "content": "I always use EM dashes with no spacing. It looks a little over-the-top, but that's why like it.\n\n"
    },
    {
      "time": "24 May 2014 — 2:52am",
      "content": "“How do you deal with acronyms in italicized passages if you've been using small caps throughout the text and, like in most fonts, you don't have italic small caps?”\n\nIf you have to break your own rules because the font you’re using can’t fulfil them, use a different font. In this case, one that has italic small caps (I’m not sure “most” don’t if you use quality type). This sort of thing is why, if you make a book for instance, you want to be as sure as you possibly can that the fonts of your choice cover everything you need before you start typesetting. (I’m aware this isn’t always possible, but it’s a good rule.)\n\nAnd yes, no emdashes in European usage. In the usage you mentioned I’d probably use a non-spaced endash. But yes, check with writer/editor/publisher for existing/preferred style guides.\n\n"
    },
    {
      "time": "24 May 2014 — 4:15pm",
      "content": "\"Don't go there – it's dangerous.\"  \n\"Don't go there –\"  \n\"Don't go th—\"\n\n"
    }
  ]
}
