{
  "id": "116746",
  "title": "Your Neo Humanist Sans Selection?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "Neo Humanist Sans"
  ],
  "content": " **Neo Humanist Sans**'officially' started from the 90's decade thanks to German designer Erik Spiekermann and its legendary foundry FontFont.  \nBut other designers followed that trend from all countries.\n\nWhat I'm interested in, what I want to know is what are your **Neo Humanist Sans** that you use or admire?  \nProvide a list per decade with its use because I'm not familiar with the latest ones. Thank you very much.\n\n(fill the gap)  \n1990's Neo Humanist Sans:  \n…  \n2000's Neo Humanist Sans:  \n…  \n2010's Neo Humanist Sans:  \n…\n\n",
  "author": "Fournier",
  "time": "22 May 2014 — 3:33am",
  "uid": "212885",
  "comments": [
    {
      "time": "22 May 2014 — 11:16am",
      "content": "Quay Sans was a little earlier, and Shannon.  \nAlso my Shinn Sans from 1984.  \nSome might even say Frutiger, which dates back to the 1960s.\n\n"
    },
    {
      "time": "22 May 2014 — 3:31pm",
      "content": "What would you recommend from the last ten years, please?  \nThank you very much.\n\n"
    },
    {
      "time": "22 May 2014 — 5:48pm",
      "content": "Perhaps you might get more of a response if you were to give a succinct description of what you consider a 'Neo Humanist Sans' to be exactly?\n\n"
    },
    {
      "time": "23 May 2014 — 6:51am",
      "content": "Find some examples.\n\n1990's Neo Humanist Sans  \nITC Officina Sans  \nFF Meta  \n [FF Scala Sans](http://web.archive.org/web/20150416042859/http:/typophile.com/wiki/https%3A/%252Fwww.fontfont.com/fonts/scala-sans)  \n [Parisine Plus](http://web.archive.org/web/20150416042859/http:/typofonderie.com/fonts/parisine-plus-family/#details)\n\n**PS** : My question also concern Neo Humanist Sans in the 2000's and 2010's decades.  \nI wonder what NHS do you use in your work?\n\n"
    },
    {
      "time": "23 May 2014 — 12:31pm",
      "content": "> Neo Humanist Sans 'officially' started from the 90's decade thanks to German designer Erik Spiekermann and its legendary foundry FontFont. But other designers followed that trend from all countries.\n\nDoes this imply that Neo Humanist Sans was started 'inofficially' Georg Salden, another German type designer, drew [Polo](http://web.archive.org/web/20150416042859/http:/www.typemanufactur.com/de/fonts/polo/overview.html) and published it in 1972?\n\nBut what is Neo Humanist Sans anyway? Is [Today Sans](http://web.archive.org/web/20150416042859/http:/www.fontshop.com/fonts/family/today_sans/) Neo Humanist Sans or just a Humanist Sans?\n\n"
    },
    {
      "time": "23 May 2014 — 2:16pm",
      "content": "I thought the first humanist sans was Syntax (which BTW Quay Sans was directly based on, with permission). But does that \"neo\" mean something [else]?\n\nhhp\n\n"
    },
    {
      "time": "23 May 2014 — 3:39pm",
      "content": " **Humanist Sans** started in England with Edward Johnston (_Johnston Underground_) and Eric Gill (_Gill Sans_).  \nThere's a 80's trend of typefaces called **SuperFamily** or **Serial** that integrate **Humanist Sans** in their family.  \nThey were odd examples before the 80's concerning **SuperFamily**.  \n**Neo Humanist Sans** typefaces are refined, soft and perfect for text and some offer ligatures as in the Old style Serifs of the Renaissance. They sometimes have the flavor of the **Neo Grotesque** like _Helvetica_ but tamed with the Renaissance readability.\n\nLet's get back to the 2000's and 2010's decades and what do you see as **Neo Humanist Sans**?\n\n"
    },
    {
      "time": "23 May 2014 — 5:39pm",
      "content": "I think it's the use of the term \"Neo' here which is confusing the issue. I personally break my sans serif type into 3 basic categories: Grotesque, Geometric & Humanist. Neo, implies that the tradition of humanising the sans either a) stopped and restarted or b) that there was some sort of evolutionary 'jump' in the genre itself, neither of which, I personally adhere to. Which makes a 'Neo humanist sans' something of a misnomer for me.  \nAs an addendum, I similarly don't find the term Neo Grotesque helpful or meaningful in any way in terms of evaluating a design's provenance.\n\n"
    },
    {
      "time": "28 May 2014 — 1:50am",
      "content": "> Does this imply that Neo Humanist Sans was started 'inofficially' Georg Salden, another German type designer, drew Polo and published it in 1972?\n\n¶ I believe your statement is valid.  \nThere's a discussion about _Polo_ and _FF Meta_:  \n [http://www.fontblog.de/das-geruecht-meta-sei-eine-kopie-von-polo](http://web.archive.org/web/20150416042859/http:/www.fontblog.de/das-geruecht-meta-sei-eine-kopie-von-polo \"http://www.fontblog.de/das-geruecht-meta-sei-eine-kopie-von-polo\")  \nTake a look at that picture comparing:  \n [http://luc.devroye.org/PoloMetaComparison.jpg](http://web.archive.org/web/20150416042859/http:/luc.devroye.org/PoloMetaComparison.jpg \"http://luc.devroye.org/PoloMetaComparison.jpg\")  \n_FF Meta_ is a patchwork of influences: _Polo, Syntax, News Gothic, Akzidenz Grotesk_.\n\n> But what is Neo Humanist Sans anyway? Is Today Sans Neo Humanist Sans or just a Humanist Sans?\n\n¶ The design of _Today Sans_ fits the style of **Neo Humanist Sans**.\n\n"
    },
    {
      "time": "24 May 2014 — 12:42am",
      "content": "Anyone?\n\n(fill the gap)  \n1990's Neo Humanist Sans:  \n…  \n2000's Neo Humanist Sans:  \n…  \n2010's Neo Humanist Sans:  \n…\n\n"
    },
    {
      "time": "24 May 2014 — 3:39am",
      "content": "Still no reply… Too bad.\n\nFind a quick selection.\n\n• ITC Officina : 1990 (Erik Spiekermann)  \n• FF Meta : 1991 (Erik Spiekermann)  \n• FF Scala Sans : 1993 (Martin Majoor)  \n• TheSans : 1994 (Lucas de Groot)  \n• Parisine : 1996 (Jean-François Porchez)  \n• FF Quadraat Sans : 1997 (Fred Smeijers)  \n• Parisine Plus : 1999 (Jean-François Porchez)  \n• Via : 1999 (Bo Linnemann)  \n• FF Seria Sans : 2000 (Martin Majoor)  \n• Fresco Sans : 2001 (Fred Smeijers)  \n• FF Unit : 2003 (Erik Spiekermann/Christian Schwartz)  \n• FF Nexus Sans : 2004 (Martin Majoor)  \n• Parisine Office : 2005 (Jean-François Porchez)  \n• FF Nuvo : 2008 (Siegfried Rückel)  \n• FF Yoga Sans : 2009 (Xavier Dupré)\n\n"
    },
    {
      "time": "24 May 2014 — 10:25am",
      "content": "• [Sense](http://web.archive.org/web/20150416042859/http:/www.myfonts.com/fonts/shinn/sense/) : 2010 (Nick Shinn)  \n• [Sensibility](http://web.archive.org/web/20150416042859/http:/www.myfonts.com/fonts/shinn/sensibility/) : 2010 (Nick Shinn)\n\nIf Sense is neo-humanist, with the understanding that the preﬁx “neo-” (derived from the term applied to mid-century modern grotesques such as Helvetica and Univers) implies subtle understatement and even color, then Sensibility is what? Post-humanist?\n\n"
    },
    {
      "time": "24 May 2014 — 12:02pm",
      "content": "I suspect, @Les, that this Neo- designation is supposed to imply some sort of New Wave in humanist-style faces.\n\n"
    },
    {
      "time": "24 May 2014 — 1:45pm",
      "content": "I appreciate the beauty of your _Sensibility_ which is **Neo Humanist Sans**.  \nDo you recommend it for the body of the text?  \nDo you provide ligatures?  \nThanks.\n\n"
    },
    {
      "time": "25 May 2014 — 2:00am",
      "content": "> Humanist Sans started in England with Edward Johnston (_Johnston Underground_) and Eric Gill (_Gill Sans_).\n\nI wouldn't use a Humanist Sans like _Gill Sans_ as a text typeface.  \nIt's too large and 'display-like'.  \nFor text purpose, I prefer a Swiss Grotesque or German Neo-Humanist  \nbecause they fit the task nicely.  \nYou'd better take a look at Keith Tam's essay submitted at the University of Reading.\n\n"
    },
    {
      "time": "25 May 2014 — 3:49pm",
      "content": "> _I think it’s the use of the term ‘Neo’ here which is confusing the issue. I personally break my sans serif type into 3 basic categories: Grotesque, Geometric & Humanist._\n\nIn my opinion, _neo_-Humanist sans-serifs are closer to the [neo-]Grotesques and American ‘Gothics’ than to Humanist sans. Similarly to Humanist sans, they do feature very open apertures, but their proportions come from good old grotesque sans-serifs. Using Galina Bannikova’s binary classification, one could say that the proportions of Humanist sans are circle-, and the neo-Humanist sans oval-based.\n\n ![](http://web.archive.org/web/20150416042859im_/http:/typophile.com/files/Neo-Humanist_Sans-Sm_6704.jpg)\n\n"
    },
    {
      "time": "25 May 2014 — 7:03pm",
      "content": "Thanks for chiming in Maxim, and that makes a lot of sense in describing the types of faces Fournier is referring to (and certainly helps clarify it for me) but does little to convince me that it's a GOOD name :-)\n\nI neglected to mention that I do have a 4th category of sans and those I call 'Hybrids' which - in this postmodern age, where we can, and seemingly do, pick gleefully from any and all the available historical models - gives rise to a myriad of amalgamations that it becomes increasingly impossible to 'catagorise' them, hence my all encompassing name, hybrid.\n\n"
    },
    {
      "time": "26 May 2014 — 1:35am",
      "content": "When one would like to split up Humanist Sans into sub-groups, the idea of distinguishing between classical/circle/old style and classicist/oval/modern proportions (as shown by Maxim) makes sense to me.\n\n**Humanist Sans**  \n_with classical/circle/old style/garalde proportions_  \nUnderground : 1916 (Edward Johnston)  \nGill Sans : 1928 (Eric Gill)  \nSyntax : 1968 (Hans Eduard Meier)  \nToday Sans Serif 1988 (Volker Küster)  \nFF Scala Sans : 1993 (Martin Majoor)  \nCronos : 1996 (Robert Slimbach)  \nFF Quadraat Sans : 1997 (Fred Smeijers)  \nDTL Haarlemmer Sans : 1995 (Frank Blokland)  \nDTL Documenta Sans : 1997 (Frank Blokland)  \nFF Seria Sans : 2000 (Martin Majoor)  \nFF Nexus Sans : 2004 (Martin Majoor)  \nNovel Sans : 2010 (Christoph Dunst)\n\n**Humanist Sans**  \n_with classicist/oval/modern/didonic proportions_  \nGoudy Sans : 1930 (Frederic W. Goudy) _how sans is that?_  \nGST Polo : 1972 (Georg Salden)  \nCongress Sans : 1985 (Adrian Williams)  \nITC Quay Sans : 1990 (David Quay) _how sans is that?_  \nITC Officina : 1990 (Erik Spiekermann)  \nFF Meta : 1991 (Erik Spiekermann)  \nDTL Argo : 1992 (Gerard Unger)  \nVia : 1999 (Bo Linnemann)  \nFF Unit : 2003 (Erik Spiekermann/Christian Schwartz)\n\nBut unfortunately, I happen to have some left-overs:  \nFrutiger : 1976 (Adrain Frutiger)  \nFF Nuvo : 2008 (Siegfried Rückel)  \nFF Yoga Sans : 2009 (Xavier Dupré)  \nTheSans : 1994 (Lucas de Groot)  \nParisine : 1996 (Jean-François Porchez)  \nParisine Office : 2005 (Jean-François Porchez)  \nParisine Plus : 1999 (Jean-François Porchez)  \nProductus : 2000 (Petr van Blokland)  \nFresco Sans : 2001 (Fred Smeijers)  \nSense : 2010 (Nick Shinn)  \nSensibility : 2010 (Nick Shinn)  \nAccording the ‘proportion rule’ they’d fit in the ‘oval’ category, but when you compare them by their overall look-and-feel, most of them fit in the ‘circle’ category. Another distinguisher would be to look at the construction. One could distinguish between an interrupted construction (such as in all Humanist Sans with ‘circle’ proportions as listed here) and a running construction (such as in Frutiger). For explanatory illustrations, have a look here:  \n [https://www.flickr.com/photos/albert-jan\\_pool/9209545848/in/set-72157629...](http://web.archive.org/web/20150416042859/https:/www.flickr.com/photos/albert-jan_pool/9209545848/in/set-72157629679838154 \"https://www.flickr.com/photos/albert-jan\\_pool/9209545848/in/set-72157629679838154\")  \nand here:  \n [https://www.flickr.com/photos/albert-jan\\_pool/9131677869/](http://web.archive.org/web/20150416042859/https:/www.flickr.com/photos/albert-jan_pool/9131677869/ \"https://www.flickr.com/photos/albert-jan\\_pool/9131677869/\")  \nbut this knife does not provide a clean cut either. Using both would do so, but it would also leave us with a large group of ‘incorrect hybrids’, which does not make sense when it comes to usability.\n\nI doubt wether ‘ligatures’ or ‘small caps’ is suitable for distinguishing typefaces. Today, almost all non-display typefaces have these slots filled in some way or another. And even if they are not necessary or appropriate for the style, it is likely that some slot-filler will be doing this within the next few years in order to boost up the number of characters in a font.\n\nWhat I like about this discussion is that no one seems to be inclined to include high contrast sans serifs such as Optima and Pascal within this group (as suggested by the BS classification).\n\n"
    },
    {
      "time": "26 May 2014 — 7:30am",
      "content": "> _One could distinguish between an interrupted construction (such as in all Humanist Sans with ‘circle’ proportions as listed here) and a running construction (such as in Frutiger)._\n\nDear Albert-Jan, your illustrations posted on [flickr.com](http://web.archive.org/web/20150416042859/https:/farm3.staticflickr.com/2845/9131677869_9c201f9ab0_o.jpg) reminded me of my own slides I use to explain my students that there is more to the classifiable features than the stroke weight contrast, or the shape of serifs.\n\n ![](http://web.archive.org/web/20150416042859im_/http:/typophile.com/files/O_4030.s.-Modern_Arches.jpg)\n\n"
    },
    {
      "time": "26 May 2014 — 8:17am",
      "content": "Dear Maxim, thanks for posting! In serif typefaces the angular and round counters usually behave more in line with old style/garalde and modern/didonic.  \nWhen I did the typeface classification for the Scangraphic Digital Type Collection in 1990, I subdivided Garalde into Old Face and Old Style and subdivided Didonic into Modern Face and Modern Style. I used the ‘Face’ groups for the typefaces that closely followed the historical models and the ‘Style’ groups for the more free interpretations. Thus I avoided to throw all newer and difficult-to-classify typefaces into the ‘Variation’ or ‘Display’ box.\n\nThis resulted in:\n\n**Old Face**  \nBembo, Garamond, Palatino, Sabon …\n\n**Old Style**  \nITC Esprit, ITC Slimbach, Swift, Vendôme …\n\n**Modern Face**  \nBodoni, Basilia, Walbaum …\n\n**Modern Style**  \nBernhard Modern, ITC Century, Engravers, ITC Zapf International …\n\nThinking this over, one could do the same for Humanist Sans Serif and Modern Sans Serif (Neo-Grotesque) today. But I would like to avoid ‘Neo’ in a set classification terms which also makes use of ‘Modern’. Or the other way round of course.\n\n"
    },
    {
      "time": "26 May 2014 — 8:30am",
      "content": "> When one would like to split up Humanist Sans into sub-groups, the idea of distinguishing between classical/circle/old style and classicist/oval/modern proportions (as shown by Maxim) makes sense to me.\n\nIt's a good lead but the main purpose of a typeface is its function.  \nSo you need to classify by use: text, display.\n\nFor instance, in the circle category, you find both display and text typefaces.\n\n"
    },
    {
      "time": "27 May 2014 — 3:30am",
      "content": "> So you need to classify by use: text, display.  \n> For instance, in the circle category, you find both display and text typefaces\n\nDistinguishing between text and display is probably something else again. That would lead to classifying ITC Bodoni SeventyTwo into another group that ITC Bodoni Six and Twelve. Not really a good idea I think. It also depends on which fonts you classify. If you’d sort all sans serifs available at MyFonts according to the ‘neo’ rule I can imagine that there will be lots of fonts in that group which I would never use for text. I do not think that the ‘Neo’s’ are better, they’re just different.\n\n"
    },
    {
      "time": "26 May 2014 — 9:23am",
      "content": "If I follow the above statement, **Neo-Humanist Sans** is a **Humanist Sans** tamed with **Neo-Grotesque** properties. I took a look at the reference by Keith Tam and the author ended up his overview wit two classes:\n\n• Sanserif as a book type: 1960's-80's  \n• Neo-Humanist sanserifs: 1990's\n\n"
    },
    {
      "time": "26 May 2014 — 12:06pm",
      "content": "John Hudson’s homage to Borges:\n\nAccording to ‘a certain Chinese Encyclopædia,’ _The Celestial Emporium of Benevolent Knowledge_, typefaces are divided into the following categories:\n\n1. those used to typeset the words of the Emperor,  \n2. no longer available ones,  \n3. those that are good for ‘the small print’,  \n4. the ones you used last week,  \n5. those that remind you of former lovers,  \n6. fabulous ones,  \n7. those in unknown formats,  \n8. those included in the present classification,  \n9. those you have forgotten,  \n10. innumerable ones,  \n11. those that are too light to be used for the present job,  \n12. others,  \n13. those in which the g ‘just looks wrong’,  \n14. those that will be used to typeset this list.\n\n"
    },
    {
      "time": "26 May 2014 — 1:35pm",
      "content": "I can't pretend to have the chops to improve on the discussion but I can say, like the kid who sometimes says at the end of \\_Southpark\\_ \"I learned something today\\_.\"  \nI particularly liked the last comment by Nick Shinn, quoting John Hudson. I shall take it to heart.  \nDon\n\n"
    },
    {
      "time": "27 May 2014 — 3:28am",
      "content": "> If I follow the above statement, Neo-Humanist Sans is a Humanist Sans tamed with Neo-Grotesque properties\n\nYes, that sounds like a good description. Reading your reasoning for distinguishing a ‘tamed’ sub group, it sounds as if you think that the tamed ones are better than the others. I personally doubt wether this works out. I would not prefer to use ITC Officina, FF Nuvo or FF Unit for longer texts. Too my reading eye they’re all a bit too quirky and heterogenous, they ask too much attention. In the other hand, there are also some typefaces in the ‘original’ group which I would not prefer either. Johnston’s Underground and Gill sans are a bit too heavy and too blunt (the thins should be a bit thinner). I do not know how you would classify Frutiger; I like its forms and in signage it often works out fine, but the regular weight of the original Frutiger family is a bit too heavy for reading black text on white or slightly toned paper I think. Fine in very small sizes, but too black in regular and larger text sizes. Neue Frutiger book may perform a bit better in regular and larger text sizes. FF Nexus has an elegant look and feel because of its long ascenders and descenders. Still the stroke contrast is low, so everything within the x-height is still a bit too spotty for a long text. Also, the long ascenders and descenders need generous leading. Which is fine when lines are long, but a nuisance when they’re short.\n\nWhat I think I have learned through the years is that too much uniformity/homogenity (be it letterforms, stroke weight, counter widths or counter forms) tends to lead to letterforms that are harder to distinguish from each other. Futura and Univers Condensed set a good example here. On the other hand, too much individuality/heterogenity easily leads to ‘unrest’ caused by unusual letterforms and uneven grey values in words and lines. It can be seen in typefaces such as Gill Sans, Via, Rotis Sans etc. When designing for optimal legibility and readability in texts for longer reading, a balance between individuality and uniformity has to be found. Generally speaking, I think that the Grotesques (Transitional Sans as I’d call them) such as News, Trade and Franklin Gothic suffer from having half heartedly defined stroke contrast, mediocre proportions and unclear counters. The diagonally cut stroke ends of a, s and e mess up the white forms. The German philosopher Anselm Feuerbach once stated ‘Mediocrity is always the correct weight, except the scales are not true’. I think this also goes for typefaces. Seen from that point of view, the Neo Humanist Sans as you define it has a high potential. But maybe most of designers who tried their luck in that area have been putting too much ‘design’ in their typefaces? I think that the linear character of sans serif typefaces asks for another approach. It suppresses heterogenity, but to enhance it, we should probably not replace it by introducing highly individualized letterforms, too much stroke contrast etc. Having seen the experiments that Ann Bessemans did for her research project is that of all modulations she applied to the sans serif typeface Frutiger in order to enhance their legibility for children with learning problems, the outcome was that most of these did not really work out. Changing the proportions of Frutiger was the only thing that showed a statistically significant improvement for beginning readers when it comes to comparing within the group of sans serifs. In this interview [http://opentype.info/blog/2013/10/01/type-design-children/](http://web.archive.org/web/20150416042859/http:/opentype.info/blog/2013/10/01/type-design-children/ \"http://opentype.info/blog/2013/10/01/type-design-children/\") she focuses on serif versus sans serif for obvious reasons, but the idea of studying spatial frequencies and rhythm within typefaces could also tell us something about designing legible sans serifs. I think that it should be considered to test some of the sans serif typefaces with classical proportions against those with grotesque (= ‘mediocre’) proportions. Or test proportionally varied versions of the same typeface to get clearer results.\n\n"
    },
    {
      "time": "27 May 2014 — 10:41am",
      "content": "> Reading your reasoning for distinguishing a ‘tamed’ sub group, it sounds as if you think that the tamed ones are better than the others. I personally doubt wether this works out. I would not prefer to use ITC Officina, FF Nuvo or FF Unit for longer texts. Too my reading eye they’re all a bit too quirky and heterogenous, they ask too much attention. In the other hand, there are also some typefaces in the ‘original’ group which I would not prefer either. Johnston’s Underground and Gill sans are a bit too heavy and too blunt (the thins should be a bit thinner).\n\n¶ I disagree. I find _FF Meta_ to be good for reading. It's like a warm _Helvetica_. The Humanist Sans from the 1910's till the 1960's were just display style. This category per se is versatile and not that homogenous because you find a mix bag of showy leanings.\n\n> I do not know how you would classify Frutiger; I like its forms and in signage it often works out fine, but the regular weight of the original Frutiger family is a bit too heavy for reading black text on white or slightly toned paper I think. Fine in very small sizes, but too black in regular and larger text sizes. Neue Frutiger book may perform a bit better in regular and larger text sizes.\n\n¶ _Frutiger_ is a Humanist Sans: in my book, it looks like a rounded _Univers_ or a humanized _Univers_—I am very fond of _Univers_ because of its cinematic connotation. It's _Syntax_ and _Polo_ that start the 'neo' trend but they were oddities and almost the vanguard of things to come.\n\n> What I think I have learned through the years is that too much uniformity/homogenity (be it letterforms, stroke weight, counter widths or counter forms) tends to lead to letterforms that are harder to distinguish from each other. Futura and Univers Condensed set a good example here. On the other hand, too much individuality/heterogenity easily leads to ‘unrest’ caused by unusual letterforms and uneven grey values in words and lines. It can be seen in typefaces such as Gill Sans, Via, Rotis Sans etc. When designing for optimal legibility and readability in texts for longer reading, a balance between individuality and uniformity has to be found.\n\n¶ I agree with you concerning these general rules.\n\n> Generally speaking, I think that the Grotesques (Transitional Sans as I’d call them) such as News, Trade and Franklin Gothic suffer from having half heartedly defined stroke contrast, mediocre proportions and unclear counters. The diagonally cut stroke ends of a, s and e mess up the white forms.\n\n¶ I wouldn't be that harsh with those typefaces that work well as display, especially _Franklin Gothic_, the prototype of such category. I can cite many examples of use throughout the years that I admire. A company called Daystar Productions exploit that typeface with great results. It's a good workhorse on the whole.\n\n"
    },
    {
      "time": "28 May 2014 — 2:01am",
      "content": "> ¶ The Humanist Sans from the 1910's till the 1960's were just display style.\n\nYes, but that is mainly because of the thins being too thick. Geometric Sans from that period wasn’t much better either. The way you’d like to define Humanist Sans would leave us with a group of typefaces that is too small to be useful in daily life. What other typefaces do you think that would fit in, next to Johnston Underground, Gill Sans and maybe Granby?  \nLooking at my list of Humanist Sans again, I’d include DTL Caspari : 1993 (Gerard Daniels), Bliss : 1996 (Jeremy Tankard), Foundry Sans : 2003 (David Quay, Freda Sack), FF Kievit : 2005 (Mike Abbink) FF Milo : 2006 (Mike Abbink) and Calluna Sans : 2010 (Jos Buivenga) now.\n\n> ¶ Frutiger is a Humanist Sans\n\nAgreed. As I said, I am inclined to include most of my ‘left-overs’ into the Humanist Sans as well. But then I do not get why you label Today Sans Serif und TheSans as ‘Neo’. To me, these typefaces have much more in common with Gill Sans, Syntax and Frutiger than with ITC Officina, Via and FF Unit.\n\n> ¶ I wouldn't be that harsh with those typefaces that work well as display, especially Franklin Gothic, the prototype of such category.\n\nI was thinking about reading text (like you seem to intend with ‘neo-humanist’), not about display quality.\n\n"
    },
    {
      "time": "28 May 2014 — 4:57am",
      "content": "Find a list of heterogeneous **Humanist Sans** from the hot metal days.  \nThere are all too stylized and with eclectic and contradictory biases.\n\n• Johnston Underground : 1916 (Edward Johnston)  \n• Gill Sans : 1928 (Eric Gill)  \n• Uhertype : 1933 (Jan Tschichold) (Tschichold's Gill Sans-esque)  \n• Peignot : 1937 (Cassandre) (naked Art Deco-oriented)  \n• Lydian : 1938 (Warren Chappell) (calligraphic and Koch-oriented)  \n• Optima : 1958 (Hermann Zapf) (incised latin-oriented)  \n• Eras : 1961 (Albert Boton) (incised latin-oriented)  \n• Antique Olive : 1962 (Roger Excoffon) (the French answer to Helvetica/Univers and whose design is based on an olive!)\n\n"
    },
    {
      "time": "28 May 2014 — 5:58am",
      "content": "> • Peignot : 1937 (Cassandre) (naked Art Deco-oriented)\n\ntoo much stroke contrast and too constructivist. I would not consider this kind of typefaces as typical for the Humanist Sans category. Especially when one wants to consider such a thing as Neo-Humanist as a (sub-)category, typefaces such as Peignot should become a slot of their own.\n\n> • Lydian : 1938 (Warren Chappell) (calligraphic and Koch-oriented)\n\ntoo much stroke contrast to be included in Humanist Sans.\n\n> • Optima : 1958 (Hermann Zapf) (incised latin-oriented)\n\ntoo much stroke contrast to be included in Humanist Sans. By the time VOX and BS made up their classifications, there were hardly any typefaces like this, now there are enough to create something like Contrast Sans (suggestions, anyone?)\n\n> • Eras : 1961 (Albert Boton) (incised latin-oriented)\n\nAltough it relates more to Frutiger and TheSans and less to Gill Sans, I think that (ITC) Eras still is a very good example of the Humanist Sans. The ‘a’ is a bit idiosyncratic and the upper counter of ‘e’ is rather small, but in text sizes on the same x-height, it does not really perform different from Syntax I think.\n\n> • Antique Olive : 1962 (Roger Excoffon) (the French answer to Helvetica/Univers and whose design is based on an olive!)\n\nI would not consider Antique Olive as typical for the Humanist Sans category. When one wants to classify typefaces with a possibly small number of slots, I’d include it in Humanist Sans (in real life I did so). Today I’d rather label it in such a way that it may become clear that it is too exotic to belong to the core of Humanist Sans.  \nA similar case would be typefaces like DTL Prokyon : 2000 (Erhardt Kaiser), FF Daxline : 2005 (Hans Reichel) or Karbon : 2009 (Kris Sowersby). They are more or less built on the Humanist kind of stroke contrast, forms and proportions, but they do not belong to what I consider to be the core.\n\nI like to test my considerations on which typeface should belong in what class with the question ‘Could typeface X serve as a typographic alternative for typeface Y?’ The point is that Antique Olive could serve as a typographic alternative to FF Balance and vice versa. But if I’d take Syntax or Scala (all at the same x-height) I’d probably have to review my decisions on the appropriate line feed. If I’d switch to FF Meta or Helvetica, I’d probably have to review my complete layout (even when the x-height is a constraint). Switching between Novel, DTL Documenta Sans and FF Kievit would probably only evoke minimal changes.\n\nI think Identifont does an great job in quickly providing similar alternatives. Although I was surprised that DTL Prokyon and Karbon do not pop up as a first alternative to FF Daxline.\n\n"
    },
    {
      "time": "28 May 2014 — 11:05am",
      "content": "> • Peignot : 1937 (Cassandre) (naked Art Deco-oriented)\n\n¶ This typeface is a Humanist Sans because of its contrast and width. At first glance, it can be seen as a Geometric Sans but it's not, really not. When you look at it closely, you find a reference to the late Didot style by Jules Didot. There's even a reference to the uncial calligraphy: see the small cap \"g\".\n\n"
    },
    {
      "time": "29 May 2014 — 9:47am",
      "content": "Stefan, just wanted to say: you make the best-looking posts. :-)\n\nhhp\n\n"
    },
    {
      "time": "29 May 2014 — 12:26pm",
      "content": "¶ Guess what I found at MyFonts.com: the latest Neo·Humanist·Sans  \ncalled _Pétala·Pro_ (2013).  \n [http://www.myfonts.com/fonts/typefolio/petala-pro/](http://web.archive.org/web/20150416042859/http:/www.myfonts.com/fonts/typefolio/petala-pro/ \"http://www.myfonts.com/fonts/typefolio/petala-pro/\")\n\n ![](http://web.archive.org/web/20150416042859im_/http:/typophile.com/files/122259_6476.jpg)\n\n"
    },
    {
      "time": "30 May 2014 — 4:25pm",
      "content": "Kievit of course!\n\n"
    },
    {
      "time": "1 Jun 2014 — 12:33pm",
      "content": "Those days I use:  \nMyriad ( [http://typophile.com/node/28658](http://web.archive.org/web/20150416042859/http:/typophile.com/node/28658 \"http://typophile.com/node/28658\")), 1992  \nCore Humanist Sans ( [http://www.fontsbyalex.com](http://web.archive.org/web/20150416042859/http:/www.fontsbyalex.com/ \"http://www.fontsbyalex.com\")), 2011\n\n"
    }
  ]
}
