{
  "id": "116849",
  "title": "Maiola, Quadraat and Scala",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "HI all,\n\nI've been a lurker on the forum for a while and have already learned a great deal from the discussions I've read. What a great place to learn how to appreciate fonts!\n\nI am an amateur at best. A few months ago my wife and I were in Staples, and I saw an ad for Adobe CC. It reminded me that I needed to start a newsletter for my new parish assignment (I'm an Orthodox priest), so I signed up and dove in. I read Ellen Lupton's Thinking With Type and the Bringhurst Bible and poured over some grid literature. I think I've improved each month, though that doesn't say much--I have no design training at all! I've attached a preview of our latest issue.\n\nI am interested in investing in one quality font to work with for at least two years. I have access to the Typekit fonts, which I realize is an incredible thing to have, considering that just a few years ago, one would have to shell out major funds for Garamond.\n\nThe only Orthodox \"style guide\" I've seen is from the Greek Archdiocese. They use Requiem. As beautiful as that font is, it the whole Renaissance phenomenon is a bit alien to Orthodoxy, which historically has been based in the east. Also, I would like something a bit more masculine.\n\nI am considering Maiola, Quadraat and Scala for my needs. I realize that these are postmodern, which is equally foreign to my background. But these fonts are too beautiful to pass up! I love the details of Maiola, but Quadraat may be more flexible, especially since I could eventually purchase the Sans companion. To my untrained eye, Quadraat has a bit more character than Scala. Please correct me if I'm wrong.\n\nAny advice you could give on the strengths, weaknesses or challenges of these three would be greatly appreciated. Any advice, too, on the design would be great. Thank you for being patient with a newbie!\n\nAll best,  \nLeonid\n\n| Attachment | Size |\n| --- | --- |\n| [Pentecost 2014 preview.pdf](http://web.archive.org/web/20140728050444/http:/typophile.com/files/Pentecost%202014%20preview.pdf) | 1.97 MB |\n\n",
  "author": "leonid",
  "time": "27 May 2014 — 7:56am",
  "uid": "220440",
  "comments": [
    {
      "time": "27 May 2014 — 8:19am",
      "content": "In general I like what I see very much. Typographically the only change I would make is to put a space before and after em or en dashes -- but not hyphens.\n\nArtistically, I would continue the lines leading from the type blocks to the image on to the item(s) being referenced. While these might be intuitive to someone in the church, to a layman they are not.\n\nGood work.\n\n"
    },
    {
      "time": "27 May 2014 — 8:36am",
      "content": "Requiem is indeed too mannered here.  \nOf those three you mention, I might go for Maiola.\n\nhhp\n\n"
    },
    {
      "time": "27 May 2014 — 10:02am",
      "content": "I think either Maiola or Scala have the right feel for what you are doing. Maiola gets my vote - it is a solid choice.\n\n"
    },
    {
      "time": "27 May 2014 — 10:22am",
      "content": "FF Quaadrat is a beautiful face, but it is so special, it tends to grab attention rather than blend in. I purchased an art book (on Louise Bourgeois) a while back typeset in FF Quaadrat. It is written in German, which I don’t read, but the look was so striking, I just had to have it. It looks marvellous on the slightly yellow paper and it fits perfectly with the (contemporary) topic. I tried to typeset another book myself – a photographic documentary book – where it didn’t work as well. To my eyes, it turned out too expressive. A little bit too much. Fred Smeijers is IMO on of the finest type designers of our time. You should definitely have a look at his other typefaces. For your project, I would probably consider Arnhem, Custodia (if not for the strange q) or TEFF Renard (if not for the steep price) before Quaadrat. But Quaadrat is classy, just super-edgy-classy.\n\nMaiola, by Veronika Burian, is a masterpiece. It is one of those faces that feels old and new at the same time. The closer you look, the more you discover, but it can still be invisible at text sizes. I have never used it, but I have admired it for some time. The Czech influence might be a fitting connotation for an Orthodox newsletter.\n\nI like FF Scala, but I know many who are older than me that don’t. They tie it to a bygone era, perhaps because it was so popular when it first was released in the ninties. I find it less elegant than the other two. Martin Majoor himself even made a new (version of the) face better suited for literary work: FF Seria.\n\n"
    },
    {
      "time": "27 May 2014 — 10:24am",
      "content": "Maybe I can suggest one of our own as a possible alternative? Masculine and unique. PM me for details. I’ll give you a good offer.\n\n"
    },
    {
      "time": "27 May 2014 — 11:48am",
      "content": "> _I am considering Maiola, Quadraat and Scala for my needs. I realize that these are postmodern, which is equally foreign to my background._\n\nDear Father Leonid, I think that your choice of typefaces is indeed… un-Orthodox. Pun unintended. It’s not that those faces are so ‘postmodern’ but they seem to lack that humbleness the subject is calling for.\n\nThe main problem with your layout, the way I see it, is not so much the use of flashy fonts as the combination of the breathtaking _Trinity_ with that cross-like typographic _кунстштюк_. I would keep the type page in the right-hand part of your spread _plain_, rectangular—maybe same width and same depth as the icon’s image area?\n\nAlso, there is no need in inserting the heading between the top two paragraphs. Nor do you have to use quotation marks in a heading. In any event, this kind of quote marks—_guillemets/französischen Anführungszeichen/chevrons/ёлочки_—is not normally used in English.\n\n"
    },
    {
      "time": "27 May 2014 — 1:17pm",
      "content": "Maxim is right the ragged right type block on the right with it's cross like shape takes away from the wonderful Trinity image. Too cute type tricks take away from the overall design.\n\n"
    },
    {
      "time": "28 May 2014 — 6:21am",
      "content": "What's wrong with Alegreya? Maybe slightly more playful than the others you mention, but not all that much more playful than Quadraat. A bit contemporary perhaps, but then again so are your other choices. I like the way it looks in your layout very much. The italic is beautiful and the sans (which I had forgotten existed, actually) works very nicely as a counterpoint. I recently set a lengthy book in Alegreya and was very pleased; its quirkiness and personality worked for the subject … though maybe it's got a bit too much character to use here.\n\nScala to me doesn't particularly reference anything you're after. It's less flashy but too businesslike. Quadraat and Maiola are both more beautiful, in a craftsy artisanal imperfect sort of way. You need to decide if that's what you want, or if something a little more laid back would be better for the tone of your publication. Have you investigated faces that are more closely linked to the history of Greek Orthodoxy?\n\nThe other thing to consider is your layout, which right now is very contemporary. In which case a more contemporary face might be exactly what you need. If you tone down the layout, then you can get away with a more somber face. I'm not quite sure what's going on with the righthand page; I would suggest a more straightforward typographic layout. (I feel like there's a typographic pun here, maybe to do with the cross, but it's sort of going over my head.)\n\nWhether you go with a more traditional or contemporary layout really comes down to what the purpose of the publication is. Maybe you want to be deliberately contemporary because that relates to your mission; I'm not sure. No one says that contemporary design is out. (See this rather infamous edition of the bible: [https://www.google.com/search?q=revolve+bible&tbm=isch&tbo=u&source=univ...](http://web.archive.org/web/20140728050444/https:/www.google.com/search?q=revolve+bible&tbm=isch&tbo=u&source=univ&sa=X&ei=7OGFU8eVDPSusAS8pIDIDA&ved=0CF0QsAQ&biw=1182&bih=786 \"https://www.google.com/search?q=revolve+bible&tbm=isch&tbo=u&source=univ&sa=X&ei=7OGFU8eVDPSusAS8pIDIDA&ved=0CF0QsAQ&biw=1182&bih=786\"). Regardless of what you think of the project, there's a designer who understands their concept and goes for it!)\n\n"
    },
    {
      "time": "28 May 2014 — 10:40am",
      "content": "Thank you all for the consideration you gave to my post. Your time is valuable, and I especially appreciate that you are trying to look at it from my perspective.\n\nThe \"too cute\" text block got the axe. I was trying to make a connection between the Cross and the Terebinth Tree behind the central angel. Now we have a text block with roughly the same proportions as the icon. Much better, and much more \"humble,\" giving the honor to the icon, where it belongs.\n\nWhat I hope to communicate in these publications is that our tradition is always new. This is an incredibly deep subject. If you consider Rachmaninoff's Vigil, for example, he drew from the ancient Russian melodies for inspiration. He harmonized them in a (mostly) non-western way that was, in one sense, traditional, but in another, completely original. The Vigil is far more beautiful than his Liturgy, for example, which he composed totally on his own.\n\nThis is the genius of St Andrei's Trinity, as well. Father Gabriel Bunge wrote an excellent book detailing the previous \"versions\" of this icon, and how St Andrei's transcends them all while remaining rooted in the tradition.\n\nWhen I think of this tradition, not only in the arts but in the spiritual life as well, it is organic, unwavering, beautiful, alive, challenging and joyful. How can these be communicated in a contemporary idiom? Or, at least, how do I make sure they're not obscured?\n\nThanks,  \nLeonid\n\n"
    }
  ]
}
