{
  "id": "116828",
  "title": "Making a font from an SVG file?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,\n\nI am a graphic designer and I am currently working on a project. I am using a vector graphics program with some custom letters that I created for titling on publications for a company. I have the whole alphabet, uppercase and lowercase, all on the same SVG file. I don't have a lot of experience with creating font files and I was wondering if there was any way or software to create a font from these letters at it would be easier than having to copy and paste the letters to manually create the words?\n\nThanks!\n\n",
  "author": "typography.",
  "time": "26 May 2014 — 8:17am",
  "uid": "190527",
  "comments": [
    {
      "time": "26 May 2014 — 4:27pm",
      "content": "All of the font producing software can use SVG files as source material. FontLab, Fontographer etc. On a basic level it would be cut and paste each glyph into the font program and refine from that and then generate the font. Least costly program is TypeTool from FontLab, but remember all of these programs do take a bit of time to learn.\n\n"
    },
    {
      "time": "26 May 2014 — 10:48am",
      "content": "If you've got Indesign, you could try IndyFont, which is a script for indesign, with which you can quite easily create working OT fonts. (really!) It has some limitations, for instance no kerning, but it could serve your purpose, as it is quite inexpensive, and easy to work with. You can find it here: [http://www.indiscripts.com/category/projects/IndyFont](http://web.archive.org/web/20140728064621/http:/www.indiscripts.com/category/projects/IndyFont \"http://www.indiscripts.com/category/projects/IndyFont\")\n\nAnother alternative is Glyphs Mini, which can be bought from the AppStore for 40€. It is quite friendly to work with for beginners, has some automated OT features, class kerning.\n\nI have both (I am not a pro type designer, but I do create fonts form time to time for personal projects) and both of these might work for you as well.\n\n"
    },
    {
      "time": "28 May 2014 — 1:42pm",
      "content": "I can't really recommend IndyFont. It is like using an InDesign plug-in to cook dinner for you: the fact that it works is genuinely amazing, but it is simply the wrong tool for the job. A bizarre hack that makes one wonder why....\n\nGlyphs Mini and our own TypeTool are fine starter choices. If you don't care about your operating system’s UI conventions, and/or are on a tight budget, and/or love libre software, there is also FontForge.\n\n"
    },
    {
      "time": "28 May 2014 — 4:42pm",
      "content": "Congratulations Thomas on joining FontLab - you will be a huge addition to an already good group. Type guys are good guys.\n\n"
    },
    {
      "time": "29 May 2014 — 7:02am",
      "content": "I see you point Thomas, Indyfont is no real replacement for a font editor, but it does provide some easy to use tools for non-professional typedesigners. The functionality is limited, but it does work.\n\nI was quite dissapointed by TypeTool, especially when compared to glyphs mini. The interface was rather dodgy to use, even if I had some experience with fontlab. It feels outdated. Will there be an updated version any time soon?\n\n"
    },
    {
      "time": "2 Jun 2014 — 6:52pm",
      "content": "Define \"soon\"...?\n\nWe are working on a new version of TypeTool, but it is not going to be out right away. It will however be on an entirely new code base with a completely overhauled interface, and will not feel like a refugee from a different decade.\n\n"
    },
    {
      "time": "4 Jun 2014 — 7:09am",
      "content": "OK, thanks Thomas!\n\n"
    },
    {
      "time": "4 Jun 2014 — 11:41am",
      "content": "No problemo. And thanks to Bob for the kind words. :)\n\n"
    },
    {
      "time": "4 Jun 2014 — 1:42pm",
      "content": "> Define \"soon\"...?\n\nSadly, I suspect the definition is closer to the one in the Urban Dictionary  \n [http://www.urbandictionary.com/define.php?term=soon](http://web.archive.org/web/20140728064621/http:/www.urbandictionary.com/define.php?term=soon \"http://www.urbandictionary.com/define.php?term=soon\")\n\nthan to Merriam-Webster  \n [http://www.merriam-webster.com/dictionary/soon](http://web.archive.org/web/20140728064621/http:/www.merriam-webster.com/dictionary/soon \"http://www.merriam-webster.com/dictionary/soon\")\n\n& now Thomas, I said \"closer,\" not \"the same as.\"\n\n"
    }
  ]
}
