{
  "id": "116808",
  "title": "German Garamond: Stempel or Berthold?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Among the German renditions of _Garamond_, which one do you like the best and why?  \n [Stempel Garamond](http://web.archive.org/web/20140803130111/http:/www.myfonts.com/fonts/linotype/stempel-garamond/)  \n [Berthold Garamond](http://web.archive.org/web/20140803130111/http:/www.myfonts.com/fonts/berthold/garamond-bq/)\n\n",
  "author": "Fournier",
  "time": "25 May 2014 — 10:34am",
  "uid": "212885",
  "comments": [
    {
      "time": "25 May 2014 — 10:43am",
      "content": "I prefer Berthold. I don't like the /0 (zero) in the Stempel design.\n\n"
    },
    {
      "time": "28 May 2014 — 6:17am",
      "content": "Berthold Garamond. But the italic is a little too dark. Today I’d rather prefer Adobe Garamond or Garamond Premier (because of the optical sizes). Amongst German typographers, Sabon was long considered as the ‘better German Garamond’. Probably because Tschichold touched it with his aura. I never got this, because even in the days of phototypesetting neither Stempel, nor Linotype or Monotype cared to restore the italic. It had always been far too wide in order to fit it on the same widths as the roman due to Linotype’s duplex matrices. Even today one can easily pee through the holes on the lines as caused by the ‘o’ being far too wide. So in the end, maybe Sabon Next is now the better ‘European’ Garamond?\n\nP.S.  \nI think Sabon Next deserves a Sans companion, based on Tschicholds Uhertype and/or the sketches he once made for Stempel.\n\n"
    },
    {
      "time": "29 May 2014 — 3:01am",
      "content": "Sabon was an interesting attempt to provide a common typeface that could be used on Monotype and Linotype machines. Of course, in being both unitized and having the same widths for different weights, Sabon was similar to all the typefaces designed specifically to be used with the IBM Selectric Composer.\n\nThey, of course, didn't have the magical aura of Jan Tschichold, although while Press Roman and Theme, for example, were just copies of Times Roman and Optima, it did have an officially licensed Univers, adjusted for the Selectric Composer by Adrian Fruitger himself IIRC.\n\nJournal Roman was IBM's take on Garamond.\n\n ![](http://web.archive.org/web/20140803130111im_/http:/typophile.com/files/JournalRoman_Italic_3732.jpg)\n\nLooking at the word \"of\" in the italic, it apparently is considerably worse than Sabon in this particular respect.\n\nActually, the problem with Journal Roman is visible in any word containg an o. In Sabon, on the other hand, the o is simply made large and round, to fill the space assigned to it, instead of being only partly widened and left to have extra space around it, in order to somewhat resemble the narrow o of the real Garamond italic, as was done in Journal Roman.\n\n"
    },
    {
      "time": "29 May 2014 — 2:39am",
      "content": "¶ Any differences in style between _Sabon_ and _Sabon Next_?\n\n"
    },
    {
      "time": "29 May 2014 — 7:14am",
      "content": "Yes. The italic of Sabon Next does not have a round o at all. It doesn't look like the classical Garamond italic either, though.\n\n<cite>I never got this, because even in the days of phototypesetting neither Stempel, nor Linotype or Monotype cared to restore the italic.</cite>\n\nThe book _Anatomy of a Typeface_, on page 156, shows the italic as well as the roman in an image of the Monophoto version of Sabon.\n\n ![](http://web.archive.org/web/20140803130111im_/http:/typophile.com/files/Sabon_4768.jpg)\n\n"
    },
    {
      "time": "30 May 2014 — 3:11am",
      "content": "\"I think Sabon Next deserves a Sans companion, based on Tschicholds Uhertype and/or the sketches he once made for Stempel.\"\n\nIt already exists:\n\n[http://www.myfonts.com/fonts/presencetypo/tschichold/](http://web.archive.org/web/20140803130111/http:/www.myfonts.com/fonts/presencetypo/tschichold/ \"http://www.myfonts.com/fonts/presencetypo/tschichold/\")\n\n"
    },
    {
      "time": "30 May 2014 — 3:15pm",
      "content": "The original metal Sabon Italic's \"f\" is arguably the worst glyph ever made.\n\nhhp\n\n"
    },
    {
      "time": "2 Jun 2014 — 2:00am",
      "content": "Berthold Garamond.  \nMaybe... because all Garamonds I have seen were Berthold Garamond? I earlier even thought that \"there was Garamond, and then there was Stempel.\" Berthold rendition has a more rounded and smoother small \"a\" while the Stempel version was more reminiscent of pen writing.\n\n"
    },
    {
      "time": "2 Jun 2014 — 3:21am",
      "content": "> I never got this, because even in the days of phototypesetting neither Stempel, nor Linotype or Monotype cared to restore the italic.\n\nWhich is especially strange because Stempel used to have an extra design of Sabon italic for the larger sizes of their hand setting version (24 points and larger if I remember correctly).\n\n> It already exists:\n\nYes I’ve seen that, but to me it does not qualify as Sabon (Next) Sans.\n\n> The original metal Sabon Italic's \"f\" is arguably the worst glyph ever made.\n\nSo true! The j is not much better …\n\n> Maybe... because all Garamonds I have seen were Berthold Garamond? I earlier even thought that \"there was Garamond, and then there was Stempel.\"\n\nHistorically seen, it is the other way round. Stempel Garamond (1924) is much older that Berthold Garamond (1972). ITC Garamond from 1977, but its italic is far too wide too.\n\n"
    },
    {
      "time": "7 Jun 2014 — 11:59am",
      "content": "> Historically seen, it is the other way round. Stempel Garamond (1924) is much older that Berthold Garamond (1972). ITC Garamond from 1977, but its italic is far too wide too.\n\nNow I know them. I'm just saying that before, when I was still a novice playing with Times New Roman in MS Word, I thought that there was only one Garamond, the Berthold Garamond, which is obviously not true.  \nAny thoughts on more modernised revivals, i.e. Sabon and Lyon?\n\n"
    }
  ]
}
