{
  "id": "116981",
  "title": "Apple Sans?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "John Gruber speculates Apple will show off their in-house designed Apple Sans tonight and use it in both iOS and OS X.\n\n> Speaking of typography, I expect the system font to change for the first time since Mac OS X 10.0 back in 2001. (If you want to be pedantic, Lucida Grande has been the system font since the public beta release in 2000.) Helvetica Neue is the obvious choice, since that’s what iOS uses. The wildcard would be Apple Sans (perhaps with a new name), a new typeface Apple has been designing in-house for years. (And if OS X switches to Apple Sans, maybe iOS 8 will too.) Bottom line, though, I think we’ve seen the last of Lucida Grande.\n\n[http://daringfireball.net/2014/06/wwdc\\_2014\\_prelude](http://web.archive.org/web/20150417042019/http:/daringfireball.net/2014/06/wwdc_2014_prelude \"http://daringfireball.net/2014/06/wwdc\\_2014\\_prelude\")\n\nAnyone have any intel on if Apple has typographers in-house?\n\n",
  "author": "thedash",
  "time": "2 Jun 2014 — 7:14am",
  "uid": "48184",
  "comments": [
    {
      "time": "2 Jun 2014 — 7:17am",
      "content": "(Perhaps this should be moved to General Discussions, I can't seem to find a way to edit the post.)\n\n"
    },
    {
      "time": "2 Jun 2014 — 2:11pm",
      "content": "Pipe-dreaming. Fashion demands Helvetica. Unless of course Apple Sans is a Helvetica clone... And in case you think that's implausible, check out Chalkboard...\n\nhhp\n\n"
    },
    {
      "time": "2 Jun 2014 — 2:41pm",
      "content": "The keynote speech is over. It looks like the Mac system font for OS-X Yosemite (to be released this fall) will be changed to Helvetica Neue, although they didn't mention it by name.\n\n[http://www.apple.com/apple-events/june-2014/](http://web.archive.org/web/20150417042019/http:/www.apple.com/apple-events/june-2014/ \"http://www.apple.com/apple-events/june-2014/\")  \n [http://www.fastcodesign.com/3031354/apple-changes-os-xs-main-font-for-th...](http://web.archive.org/web/20150417042019/http:/www.fastcodesign.com/3031354/apple-changes-os-xs-main-font-for-the-first-time-ever \"http://www.fastcodesign.com/3031354/apple-changes-os-xs-main-font-for-the-first-time-ever\")\n\n"
    },
    {
      "time": "2 Jun 2014 — 11:35pm",
      "content": "Yawn.\n\n"
    },
    {
      "time": "3 Jun 2014 — 3:36am",
      "content": "For those who may be asleep, Apple's Chalkboard font is not a clone of Helvetica... and Microsoft's Arial is. :)\n\n"
    },
    {
      "time": "3 Jun 2014 — 9:06am",
      "content": "Ya want funny... Chalkboard is more of a clone than Arial is. I'm also sure you know what Chalkboard is a clone of. Hmm... maybe not such a comic sitch, after all.\n\n"
    },
    {
      "time": "3 Jun 2014 — 9:07am",
      "content": "‟To those who are wondering, this is not quite Myriad.” — Craig Federighi\n\n[https://twitter.com/craig\\_apple/status/472487084100681729](http://web.archive.org/web/20150417042019/https:/twitter.com/craig_apple/status/472487084100681729 \"https://twitter.com/craig\\_apple/status/472487084100681729\")\n\n"
    },
    {
      "time": "3 Jun 2014 — 9:25am",
      "content": "David, denial of Apple's continued slide into a typographic miasma hurts the denier the most.\n\n[https://twitter.com/SteveMatteson1/statuses/473858825783480321](http://web.archive.org/web/20150417042019/https:/twitter.com/SteveMatteson1/statuses/473858825783480321 \"https://twitter.com/SteveMatteson1/statuses/473858825783480321\")  \nAll kinds of people have started seeing the lack of light at the end of this tunnel.\n\nhhp\n\n"
    },
    {
      "time": "3 Jun 2014 — 9:47am",
      "content": "Regarding the linked Twitter comment on tracking, this is just a beta for developers. Considerable tweaking will happen before the release this fall, just as we saw with the iOS beta (for iPhones and iPads) in which Apple changed the weight of the system font during beta testing and made many other adjustments.\n\nA preview of Yosemite from Apple's site:\n\n ![](http://web.archive.org/web/20150417042019im_/http:/typophile.com/files/apple-fonts_3800.jpg)\n\n"
    },
    {
      "time": "3 Jun 2014 — 9:52am",
      "content": "Lipstick on a pig.\n\nhhp\n\n"
    },
    {
      "time": "3 Jun 2014 — 11:19am",
      "content": "[http://www.fastcodesign.com/3031432/why-apples-new-font-wont-work-on-you...](http://web.archive.org/web/20150417042019/http:/www.fastcodesign.com/3031432/why-apples-new-font-wont-work-on-your-desktop \"http://www.fastcodesign.com/3031432/why-apples-new-font-wont-work-on-your-desktop\")\n\nhhp\n\n"
    },
    {
      "time": "3 Jun 2014 — 11:30am",
      "content": "Well, they dum. The thing is, Hrant, this issue of what da Mac uses for fonts is just not that important. A agree dat it's not sew goode at reelie small sizes, and that it don't hilp the font industree to reheat helitican over and over, until it's like an invisible background for all the complex typographic content brought to u by an OS,, oh maybe dare is a reason. Be sides witch, I don't think a change of fonts is going to git eor stub urn hide into a apple cart en e way. Em eye write or em I rite?\n\n"
    },
    {
      "time": "3 Jun 2014 — 11:35am",
      "content": "You're almost always right except when it has to do with Apple.\n\nHaving a weakness is human – admitting it, sublime.\n\nhhp\n\n"
    },
    {
      "time": "4 Jun 2014 — 3:51am",
      "content": "There are, perhaps, over all the devices 1,000's of \"conditions\" in the OS alone and even more once the fonts are employed by apps. Together, this builds and OS's typography out of space, time, color and fonts. Having only seen nips of this preview of perhaps the new OS, is a weakness we all share. And that alone requalifies every opinion I've heard. Some of us, have other weaknesses, like never having worked on one, much less multiple OS typographies, for predicable brand disloyalty, and yet others have delusions of miasma in the plasma...\n\nThe Fast Co. piece is fascinating in that it raises two questions with descendant questions here at FB, that've been asked even before Lucida Grande, and are asked in the development of all RE fonts; When designing scalable digital outline fonts, when should the style be compromised for the size and when should the style be compromised for the resolution, and how? and the other question of course, is; When'll type designers be able to productize this knowledge in size and resolution independent digital outline fonts that can react to conditions in the user's favor, so we do not have to \"simplify\" every class of every typeface design for each size and for each resolution? ;)\n\n"
    }
  ]
}
