{
  "id": "116973",
  "title": "Macedonian Cyrillic",
  "forum": "General Discussions",
  "tags": [
    "Cyrillic",
    "General Discussions",
    "local",
    "locl feature"
  ],
  "content": "I'm making a sans serif with Bulgarian and Serbian glyphs available via locl feature. I've got a question here: since Macedonian before 1945 was considered a Bulgarian dialect, should it use Bulgarian glyphs? Or it is closer to Serbian?\n\n",
  "author": "goloub",
  "time": "2 Jun 2014 — 5:52am",
  "uid": "215967",
  "comments": [
    {
      "time": "2 Jun 2014 — 8:32am",
      "content": "One good resource is here: [http://www.evertype.com/alphabets/](http://web.archive.org/web/20150414043730/http:/www.evertype.com/alphabets/ \"http://www.evertype.com/alphabets/\")\n\nEach language covered is shown in a downloadable PDF and they cover all current and obsolete characters for each language.\n\n"
    },
    {
      "time": "2 Jun 2014 — 8:57am",
      "content": "Thanks George, but that's not exactly what I'm talking about.  \nThe thing is­—in Russian and Bulgarian and Serbian there are exactly the same letters (not all though), but there is tradition for different glyphs for same letters. For example the Russian \"т\" and \"к\" would be the Bulgarian \"m\" and \"k\". There are more differences like these. I'm curious ­— to which glyph tradition does the Macedonian language below.\n\n"
    },
    {
      "time": "2 Jun 2014 — 9:58am",
      "content": "Macedonians are somewhat nationalistic today. This comes of being told they can only call themselves the FYROM, in order to avoid annoying Greece. At one time, Macedonian was alleged to be merely a dialect of Bulgarian, rather than a Slavic language of its own.\n\nSo I would suspect that even if the Bulgarian glyphs were used for Macedonian in the past, in the present they would follow the mainstream Cyrillic glyph tradition, like Russian. However, a brief web search did not turn up suitable examples of Macedonian printing including lower case.\n\nAh, wrong search term. [http://alati.org/font/](http://web.archive.org/web/20150414043730/http:/alati.org/font/) should do to answer your questions.\n\nWell, maybe not. Mak Hebar uses the Bulgarian k but the Serbian/Russian T (of course, they too use m in italics), while most of the other faces there seem to follow Serbian and Russian. So maybe the Macedonians haven't made up their minds.\n\n"
    },
    {
      "time": "2 Jun 2014 — 11:11am",
      "content": "OK Dmitry, the following wiki page goes into great detail about the Macedonian alphabet so may be of more help.\n\n[http://en.wikipedia.org/wiki/Macedonian\\_alphabet](http://web.archive.org/web/20150414043730/http:/en.wikipedia.org/wiki/Macedonian_alphabet \"http://en.wikipedia.org/wiki/Macedonian\\_alphabet\")\n\n"
    },
    {
      "time": "4 Jun 2014 — 12:37am",
      "content": "Thank you guys. Looks like they're mostly using the regular Cyrillic and use Serbian Italic style.\n\n"
    }
  ]
}
