{
  "id": "116914",
  "title": "Looking for Google font to combine with Beorcana",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,  \nI'm working on a website and would like to use Beorcana for the headings.  \nI can’t use it for the body text, as my Wordpress template only allows me to have custom headers.  \nFor the body text I can use the google fonts plus a basic set including Verdana, Arian, Lucida Sans and so on.  \nI would prefer a sans serif for the body text.  \nLet me know if there is one you can recommend.  \nThanks,  \nAntonie\n\n",
  "author": "antoniez",
  "time": "30 May 2014 — 2:43am",
  "uid": "220383",
  "comments": [
    {
      "time": "30 May 2014 — 4:22pm",
      "content": "Hi Antonie,\n\nI would check out Alegreya:\n\n[http://www.google.com/fonts/specimen/Alegreya](http://web.archive.org/web/20150416140326/http:/www.google.com/fonts/specimen/Alegreya \"http://www.google.com/fonts/specimen/Alegreya\")\n\nIt has a calligraphic feel to it similar to Beorcana.\n\nI really can't think of a perfect sans-serif match available on Google Fonts. Open Sans and Source Sans Pro are always good choices and could really pair decently with anything. You can see some other choices here for nice Google fonts:\n\n[http://www.typewolf.com/top-10-open-source-web-fonts](http://web.archive.org/web/20150416140326/http:/www.typewolf.com/top-10-open-source-web-fonts \"http://www.typewolf.com/top-10-open-source-web-fonts\")\n\nHope that helps.\n\nJeremiah\n\n"
    },
    {
      "time": "30 May 2014 — 5:28pm",
      "content": "If your Wordpress template is severely restricting your font choice, time to dump it.\n\n> Open Sans and Source Sans Pro are always good choices\n\nNothing is always a good choice.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2014 — 9:18am",
      "content": "Thanks for the replies.\n\n@Jeremiah, I like Alegreya but actually find it a bit too caligraphic, thinking I'd like something with a simpler shape to go with Beorcana. And I had a look at the suggestions on typewolf, but I don't know enough about typography to make an informed choice as to which font would be a good match, especially since I'm waiting to buy Beorcana until I have a suitable matching body font.\n\n@hhp, my wordpress template (Avada) will in the future allow for custom body text, so in a way it would also be nice to hear suggestions for a matching body type that are not in Google fonts. I'm a writer who is building a website. I've just started learning about typography, and I read and write a lot, so I do have a sense of the importance of typography and its potential beauty - just not enough expertise to make an informed choice. That's why I'm asking here for advice.\n\nSo can people help out with suggestions - either Google fonts or another font I'll be able to use once Avada allows for custom body text?\n\n"
    },
    {
      "time": "31 May 2014 — 9:40am",
      "content": "The fact that you chose Beorcana is a clear sign that you care, so it's no surprise that you have your eye on one day enjoying real choice in a body font. If/when that happens you might consider a face mentioned here:  \n [http://typophile.com/node/116847](http://web.archive.org/web/20150416140326/http:/typophile.com/node/116847 \"http://typophile.com/node/116847\")\n\nBut in the meantime (and since I totally agree that Beorcana's strong flavor should be matched up with something more staid) what do you think of PT Sans?  \n [https://www.google.com/fonts/specimen/PT+Sans](http://web.archive.org/web/20150416140326/https:/www.google.com/fonts/specimen/PT+Sans \"https://www.google.com/fonts/specimen/PT+Sans\")\n\nhhp\n\n"
    },
    {
      "time": "31 May 2014 — 10:29am",
      "content": "Thanks again hhp.  \nPT Sans sounds like a good suggestion for while I'm stuck with Google fonts. I'm going to play around with the different font sized on the typecast website, to see which ones fit. It does strike me that PT Sans has a much higher x-height than Beorcana - does that matter when they are used as body and header respectively?\n\nI had already looked at the thread about alternatives to Optima, but my understanding is that Beorcana is mentioned as one of the alternatives to Optima, which I take to mean that the other alternatives mentioned may or may not go with Beorcana, depending... I'll have another look.\n\n"
    },
    {
      "time": "31 May 2014 — 10:42am",
      "content": "Although a comparable x-height is one way fonts can harmonize, I don't find that to be critical; in fact to me it's not even a particularly strong factor (although relative apparent size does have to be considered).\n\nI think Beorcana being an alternative to Optima actually means other such alternatives have a good chance of harmonizing with it.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2014 — 10:59am",
      "content": "I see what you mean. I'm trying Beorcana Display Medium with PT Sans right now on Typecast and they go together beautifully.  \nAnd I'll look at the Optima alternatives as well for later.\n\n"
    }
  ]
}
