{
  "id": "116926",
  "title": "Bitstream Li'l Bits Font Packs",
  "forum": "Typography / Composition",
  "tags": [
    "bitstream",
    "Flintstones",
    "Jetsons",
    "Looney Tunes",
    "Next Generation",
    "Star Trek",
    "Typography / Composition",
    "Winter Holiday"
  ],
  "content": "I have been busy compiling the following list for historical purposes.  \nHowever, I am missing information particular to the \"Looney Tunes 1 Font Pack, which I have preceded with a bullet •. The complete list of fonts in that pack, and, if you have the original box, a scan of the front and back would be extremely helpful. Thanks!!\n\nBitstream Li'l Bits Novelty Font Pack Font Lists\n\nSTAR TREK   \nStar Trek (Horizon)  \nStar Trek Film (Galaxy)  \nStar Trek Pi  \nStarfleet Bold Extended (Millennium Bold Extended)  \nVenetian 301 (Centaur)  \nSquare 721 Condensed (Eurostile)\n\nSTAR TREK: THE NEXT GENERATION  \nStarTrek Next (Sonic Cut Thru)  \nStarTrek Gen (Sonic Extra Bold)  \nStarTrek Next Pi  \nCrillee Italic [A Letraset Font]  \nSwiss 911 Ultra Compressed (Helvetica Ultra Compressed)  \nTransitional 521 (Electra)\n\nTHE JETSONS\n\nJetsons - [With Characters]  \nJets Black (Sprocket) - [No characters]  \nJets Original (Sprocket Deluxe) - [Official Series Typeface]  \nGoemetric 231 (Kabel)  \nEgyptian 505 Light (Egyptios Light)  \nBitstream Amerigo\n\nTHE FLINTSTONES\n\nFlintstones  \nBedrock (Stone Age)  \nImpress  \nBitstream Cooper Light  \nSwiss 721 (Helvetica) Light\n\nLOONEY TUNES 1\n\nLooney Tunes [With characters]  \nLooney Tunes Tilt (Alphabet Soup)  \nIncised 901 Bold (Antique Olive Bold) - [No characters]  \n• Font used in the Sylvester Logo  \n• Font used in the Elmer Fudd Logo  \n• Unknown Font\n\nTHE WINTER HOLIDAY FONT PACK\n\nSnowCap  \nHoliday Pi  \nCloister Black  \nShelley Allegro (Shelly Scripts Vivace)  \nFreeform 721 (Auriol)\n\nThe font names in parenthesis ( ) are the more familiar Linotype names for the fonts or Bitstream renaming.  \nThe items in brackets [] are merely comments.\n\n",
  "author": "Rick Allen",
  "time": "30 May 2014 — 1:07pm",
  "uid": "220531",
  "comments": [
    {
      "time": "1 Jun 2014 — 9:34am",
      "content": "You have one name backwards. Egyptian 505 Light is the original Linotype name, not Egyptios Light.\n\n"
    },
    {
      "time": "17 Jul 2014 — 3:13pm",
      "content": "You are quite correct.  \nThanks, George!\n\n"
    },
    {
      "time": "19 Jun 2014 — 9:55am",
      "content": " ![](http://web.archive.org/web/20150317192326im_/http:/typophile.com/files/Front_5837.png)\n  \nFront of Box - from an AD inside Jetsons box that arrived today.  \nI am still trying to find more information about this pack. \n"
    },
    {
      "time": "15 Aug 2014 — 7:56am",
      "content": "Continued Loonacy (Spelling Intentional)\n\nHere is my best guess as to which fonts are missing from the Looney Tunes Font Pack font list, based on the samples shown in the image I uploaded, and fonts supplied in other packs:\n\n• Incised 901 Bold (Antique Olive Bold),  \n(mixed with \"Looney Tunes\") for \"Employee\" etc.,\n\nAlso, this font is a match for the letterforms used in the Looney Tunes font, and could possibly have been renamed to Looney Bold for the font pack.\n\nFrom the scanned image, I believe I see:\n\n• Freehand 471 (Cascade Script)\n\nfor \"Awards Banquet\" (partially shown title),\n\nand (this was difficult to make out at such a low resolution):\n\n• Aachen\n\n(all in caps with spaces between each letter) for \"Fax Transmittal\".\n\n• This leaves one font missing from this list, as a 1993 Bitstream press release indicates that there are six fonts in this pack.\n\nIf anyone knows if this is correct or not, please let me know.\n\nScans of the user guide would be extremely helpful and greatly appreciated. At least: the front cover, the pages from \"Let's Get Started\" thru \"Selecting a Point Size\" and the back of the box, especially.\n\nI have been searching for some time and can find very little mention of the Looney Tunes 1 Font Pack online. It was practically miraculous that I was able to purchase a copy online of the Jetsons Font Pack, which had an AD flyer inside that had a tiny photo of the Looney Tunes box front.\n\nA few mysteries remain (if I am thus far correct):  \nWhich font was considered as used in the \"Sylvester Logo\"?  \nWhich font was considered as used in the \"Elmer Fudd Logo\"?  \nAre one of those two the missing font?\n\n"
    },
    {
      "time": "15 Aug 2014 — 8:00am",
      "content": "I would like to re-iterate my plea for information regarding the \"Looney Tunes 1 Font Pack\" made by Bitstream,, Inc. in the early '90s.\n\nIf anyone out there can add to the information I have already gathered, please post it here.\n\nIf you know a former Bitstream employee,  \nperhaps you can see if they are able to help.\n\nAn alternative solution would be possible if someone has this pack:  \nA scan of the back of the box would be extremely helpful.  \nA scan of certain parts of the user guide would complete my task.\n\nAny assistance would be greatly appreciated.\n\n"
    }
  ]
}
