{
  "id": "116985",
  "title": "Vox-ATypI Classification: the XVIIth Century?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "Vox-ATypI"
  ],
  "content": "¶ Maximilien Vox invented a system of classification that started in the XVth and ended in the XXth century.  \nBut he omitted one century: the XVIIth.  \nHow would you define it and call it by following Vox's word methodology?\n\n¶ Thanks for your attempts.\n\n",
  "author": "Fournier",
  "time": "2 Jun 2014 — 8:53am",
  "uid": "212885",
  "comments": [
    {
      "time": "3 Jun 2014 — 3:43am",
      "content": "¶ Any theories so far?\n\n"
    },
    {
      "time": "3 Jun 2014 — 4:02am",
      "content": "I would not follow Vox word methodology. Typeface classification should primarily be based on form, not on history.\n\n"
    },
    {
      "time": "3 Jun 2014 — 12:00pm",
      "content": "¶ What are the great typeface designers of the XVIIth century?  \nJean Jannon  \nChristoffel van Dijck  \nMiklos Kis (neo-van Dijck)\n\n¶ But also:  \nDirk Voskens  \nPeter de Walpergen\n\n¶ With a Vox's word methodology, it may be:  \nJandijck ( **Jan** non combined with van **Dijck** )\n\n¶ So how would you define the XVIIth century based on form?\n\n"
    },
    {
      "time": "8 Jun 2014 — 8:26am",
      "content": "I don’t understand why you need this ?  \nIt’s a Garalde.  \nYou can of course be more precise to refer to them but I don’t see that much difference to have a need for another term.\n\n"
    },
    {
      "time": "8 Jun 2014 — 10:24am",
      "content": "The leaning of the roman by Jannon and van Dijck feature more contrast and the start of a vertical axis.  \nIt's proto-transitional because of the religious bias of both designers.  \nThe Dutch style influenced the roman of Caslon in the next decade.  \nSanders call that era the Dutch Old Style but I think it's much more than a simple Dutch update.  \nHe also omits Jannon.  \n\"From Sedan to Amsterdam comes the Jandijck!\"\n\n"
    }
  ]
}
