{
  "id": "117010",
  "title": "How to know if a font set is legit",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I have a fairly large font collection that has grown over the years. Most of the fonts that I have were purchased by me or an agency. However, some have been traded between me and other designers (gasp). I have come to realize that some of these font sets are not legit.\n\nApparently, hackers are rebuilding fonts from stolen sources such as .TTFs, WOFFs, EOTs and PDFs. In these cases, the kerning is not set properly and many glyphs are often missing. What is the best way to check to see if a font set is legit?\n\n",
  "author": "BrannigansLaw",
  "time": "3 Jun 2014 — 6:32am",
  "uid": "220601",
  "comments": [
    {
      "time": "3 Jun 2014 — 8:50am",
      "content": "Holding a clear and compliant license trail is a good start. If you are unable to verify that the font data you hold conforms to the license then you can confirm with the foundry or designer in question. If the license you hold is for an agency you own, have owned or previously worked for, then the license is only valid for the agency but again, some foundries or designers may be willing to transfer those rights directly to you if all the paperwork is in order.\n\n> Apparently, hackers are rebuilding fonts from stolen sources such as .TTFs, WOFFs, EOTs and PDFs. In these cases, the kerning is not set properly and many glyphs are often missing. What is the best way to check to see if a font set is legit?\n\nThis is a worrying statement as it indicates that you may have received, knowingly or otherwise, fonts for which you are not licensed and which may have been obtained illegitimately, oh my! If you did know, that is not cool; if you are in doubt and want the real thing, support the industry and buy fresh.\n\n"
    },
    {
      "time": "3 Jun 2014 — 9:47am",
      "content": "Thanks for the response.\n\nJust for some more background on this... I'm a web designer and was curious why Hoefler & Frere-Jones developed their own webfont delivery system. One of the reasons cited was that hackers could steal their fonts easily. Honestly, I thought that this was a b.s. response, until I found videos like this [https://www.youtube.com/watch?v=jS9ge9xFZ-w](http://web.archive.org/web/20140803154112/http:/typophile.com/wiki/https%3A/%252Fwww.youtube.com/watch%3Fv%3DjS9ge9xFZ-w). People are also apparently using Fontlab to rebuild compete font sets this way. To make it clear, Fontlab is just a tool (a good one at that), so I don't mean to call them out.\n\nYes, I've traded fonts with other designers. I've never met a designer that hadn't done this. That's just the reality. I'm just wondering if there was an easy way to find these sets and delete them. I blame nobody but myself. I should have kept better records.\n\n"
    },
    {
      "time": "3 Jun 2014 — 10:52am",
      "content": "\\> I've never met a designer that hadn't done this.\n\nYep, it's very common, especially among younger designers who are used to trading videos and MP3s. Most designers I've known save a copy of every font they have access to. Like you said, it's just the reality of the situation.\n\nEmployers and clients sometimes add to the problem by providing illegal copies of fonts and refusing to reimburse if the designer wants to buy them legally.\n\nAnd you're right about record-keeping; big agencies often keep track of licenses but most designers don't. I've purchased many fonts but didn't start saving the licenses until a few years ago. It just didn't occur to me.\n\n"
    }
  ]
}
