{
  "id": "117056",
  "title": "Step-by-step instructions to install FontLab Studio add-ons",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "So, I have been working on writing up detailed step-by-step instructions on how to install RoboFab, FontTools/TTX and friends to go with FontLab Studio. Both Mac and Windows. I figured if I found some aspects non-obvious I would not be alone.\n\nThe scripts and such that one can run with these tools are very handy, even if you are not interested in writing your own scripts.\n\nI am pretty much done, but before I post them on the FontLab blog, I could use a small number of folks who are interested in installing these bits, to test out my instructions. :) Especially on Windows, as it has fewer font-editing folks and doesn’t get as much attention.\n\nIf interested, just drop me a note here and I will pass you the current draft.\n\n",
  "author": "Thomas Phinney",
  "time": "4 Jun 2014 — 12:00pm",
  "uid": "909",
  "comments": [
    {
      "time": "4 Jun 2014 — 1:49pm",
      "content": "I'm interested! I can test on XP and 7.  \nBut I don't own a license to anything except FontLab itself. :-(\n\nhhp\n\n"
    },
    {
      "time": "4 Jun 2014 — 2:11pm",
      "content": "TTX is free, and the 2.3 build reported to work well (esp. for adding the effect of \"digital signatures\" for Microsoft products).\n\n[http://typedrawers.com/discussion/192/making-ot-ttf-layout-features-work...](http://web.archive.org/web/20150414141819/http:/typedrawers.com/discussion/192/making-ot-ttf-layout-features-work-in-ms-word-2010 \"http://typedrawers.com/discussion/192/making-ot-ttf-layout-features-work-in-ms-word-2010\")\n\n2.4 has been reported to have a few problems.\n\n"
    },
    {
      "time": "4 Jun 2014 — 5:07pm",
      "content": "Hrant: All the other components are libre software, so no problemo. I will be in touch. I am just glad to have somebody on Windows.\n\nCharles: TTX 2.4 has a few problems, but 2.3 is increasingly outdated and is not keeping up with new developments. So personally I am going for 2.4.\n\n"
    },
    {
      "time": "5 Jun 2014 — 11:22am",
      "content": "i have an old Vista machine, although I may be the only one, so that may not be useful ;)\n\n"
    },
    {
      "time": "5 Jun 2014 — 2:06pm",
      "content": "Byte your tongue. I use a Vista at home, to stream to the TV. We even have an NT at work, what our accounting program runs on. For me, NT was **the** bulletproof operating system.\n\nI'd offer to help, Thomas, but am a novice with TTX -- haven't quite figured out how I'll use it yet, aside from straightening out font naming for the various platforms. While we have and use NT, XP, Vista, 7, 8, and 8.1, FontLab is only on my 7 at work, and my 8 (tablet) as portable. And I am using the TTX 2.3 build...\n\n"
    },
    {
      "time": "8 Jun 2014 — 9:40am",
      "content": "I pinged Jason (via Twitter) to get his email address.\n\nCharles, no particular expertise is required. This is just installs. You can skip the parts about installing the pieces you already have....\n\n"
    },
    {
      "time": "8 Jun 2014 — 11:20am",
      "content": "Although it took FontLab 15 (or even 20 years?) to offer the user community a step-by-step guide how to install all the libraries, scripts and tools, I appreciate it. You will save hundreds, maybe thousands of hours of googling.\n\n"
    },
    {
      "time": "8 Jun 2014 — 9:44pm",
      "content": "Well, to be fair, Adam has posted this info before, it has just gotten a little bit out of date. Plus I wanted to create a Windows version as well.\n\nAnyhow, you’re welcome. :)\n\n"
    },
    {
      "time": "8 Jun 2014 — 9:44pm",
      "content": "> Charles, no particular expertise is required.\n\nThomas -- OK, I'm in. Believe you have my email address.\n\n"
    },
    {
      "time": "11 Jun 2014 — 3:37pm",
      "content": "Yes, I missed especially the Windows version. Many students of type design use Windows based computers and many resigned to install Python just because they could get reliable manual how to do that. Fortunately, in 2011 a good guy created [http://typophile.com/node/81979](http://web.archive.org/web/20150414141819/http:/typophile.com/node/81979 \"http://typophile.com/node/81979\"). It saved me probably several weeks my of life!\n\n"
    },
    {
      "time": "12 Jun 2014 — 10:34am",
      "content": "Ooh, forgot about that one. Of course, it still refers to Python 2.4, and old versions of other components. That's part of why I wanted to do a new thing.\n\n"
    },
    {
      "time": "22 Oct 2014 — 9:53pm",
      "content": "I would love instructions. All this technical stuff scares me a bit. It's the main reason I haven't worked with any scripts yet, though I'm starting to realize I definitely should to speed up some aspects of my design process.\n\nBy the way, I use Windows and never intend to go Apple. I'm annoyed Windows doesn't have a bigger focus on typography though. I've seen great software which isn't available for Windows. For one, managing fonts is absolutely terrible on Windows. I often have to restart my computer just to update a font because it keeps saying it's in use. Do you have any recommendations to make that process more efficient?\n\n"
    },
    {
      "time": "23 Oct 2014 — 10:01am",
      "content": "Font software is weak on Windows mostly because it's generally developed by very small teams... many of which have some consumerist brand-loyalty issues going on...\n\nOne reason to prefer Windows however is its lack of hipster elitism, the avoidance of supporting one of the psychologically nastiest tech companies out there (to me Apple is the Disney of computers), not to mention supporting a company that has paid good money for great typefaces to be made for many years now. Versus making Chalkboard.\n\nhhp\n\n"
    },
    {
      "time": "28 Oct 2014 — 1:33pm",
      "content": "Full instructions are posted here:  \n [http://store.fontlab.com/index.php?option=com\\_fss&view=kb&Itemid=431&kba...](http://web.archive.org/web/20150414141819/http:/store.fontlab.com/index.php?option=com_fss&view=kb&Itemid=431&kbartid=13 \"http://store.fontlab.com/index.php?option=com\\_fss&view=kb&Itemid=431&kbartid=13\")\n\nIMO, the only serious font manager on Windows is Suitcase Fusion from Extensis. But I used to work for them and so on, so I might not be unbiased. Then again, I believe there are reasonable alternatives on Mac OS, just not on Windows.\n\n"
    }
  ]
}
