{
  "id": "117027",
  "title": "Making a case for hyphenation",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "hyphens"
  ],
  "content": "I'm laying out a newletter/magazine, and the client recently asked to remove all hyphens from the text (which is left-justified).\n\nMy feeling is that hyphens improve legibility by leading the eye and allowing for a more even and less jumpy rag. I was thinking about my rationale today and realized I have no proof to back up the legibility angle. Was wondering if anyone knows of any studies that have been done on the topic or if there is any science (psuedo or otherwise) that I could use to defend my preference for hyphenating text. If I can make the case for improved legibility I think it will be easier persuade the client.\n\nThanks, eh!\n\n",
  "author": "jidoe",
  "time": "3 Jun 2014 — 3:27pm",
  "uid": "3722",
  "comments": [
    {
      "time": "3 Jun 2014 — 3:54pm",
      "content": "I've had the same problem with some clients who insist on no hyphenation, or who nit-pik the hyphenation so much that I end up eliminating it. Drives me nuts.\n\n"
    },
    {
      "time": "3 Jun 2014 — 4:12pm",
      "content": "Obviously, rivers in text are a bad thing.\n\nSo, back when text was fully justified, and columns were narrow (there is a little research, but a lot of rules of thumb, on column width), hyphenation made sense.\n\nNow that computers do it, they make mistakes.\n\nAnd when text is ragged right, do the line widths need to be still close, or can the right side be more ragged without harm? I don't know of any research on this point.\n\n"
    },
    {
      "time": "3 Jun 2014 — 4:35pm",
      "content": "Perhaps someone knows of a study, but my guess is that hyphenation is used more for a better visual appearance.\n\nAnd if your client has a preference for no hyphenation, a dusty old academic study won't change their mind anyway. Your best bet might be to show them examples of popular, well-designed magazines that use hyphenation.\n\n"
    },
    {
      "time": "4 Jun 2014 — 7:20am",
      "content": "Thanks for the suggestion. I was thinking the same thing yesterday... showing them some nicely design publications which use hyphenation might make them feel more comfortable about it. I've got some narrow columns which are especially hard to typeset without hyphenation.\n\n"
    },
    {
      "time": "4 Jun 2014 — 8:16am",
      "content": "> _Was wondering if anyone knows of any studies that have been done on the topic or if there is any science (psuedo or otherwise) that I could use to defend my preference for hyphenating text._\n\nI know of no studies—they _should_ exist, though—but I can recommend two good articles, “ [The Justification for Hyphenation](http://web.archive.org/web/20140803135912/https:/web.archive.org/web/20070614210325/http:/www.creativepro.com/story/feature/8656.html)”, and “ [The Hyphenation of Justification](http://web.archive.org/web/20140803135912/https:/web.archive.org/web/20010415071127/http:/www.creativepro.com/story/feature/8868.html?origin=story)”, written by John Berry for creativepro.com/ _[dot-font.com](http://web.archive.org/web/20140803135912/http:/dot-font.com/index.php)_ back in 2000. I still find them very useful, and always refer to them whenever the “ [H&J](http://web.archive.org/web/20140803135912/http:/www.fonts.com/content/learning/fontology/level-2/text-typography/hyphenation-and-justification)” issue comes up—in discussing my own work for the clients, or in class.\n\n"
    },
    {
      "time": "4 Jun 2014 — 1:48pm",
      "content": "You are definitely correct about how much better editorial text is with hyphenation. And pretty much every magazine would use hyphenation so you won't need to look hard.\n\nThere is a previous thread [http://typophile.com/node/30235](http://web.archive.org/web/20140803135912/http:/typophile.com/node/30235 \"http://typophile.com/node/30235\") which will give you various viewpoints.\n\n"
    },
    {
      "time": "4 Jun 2014 — 2:40pm",
      "content": "With no hyphenation in ragged text, both pseudo-justiﬁcation and great disparities of line length will randomly occur in adjacent lines, which is more intrusive and disruptive to smooth reading than hyphenation.\n\n"
    },
    {
      "time": "5 Jun 2014 — 1:30pm",
      "content": "Thanks a bunch folks, some very helpful links and info being shared. Cheers.\n\n"
    }
  ]
}
