{
  "id": "117090",
  "title": "book labels, circa 1883",
  "forum": "Home",
  "tags": [
    "Serif"
  ],
  "content": "Attached photos are from a volume of Hubert Howe Bancroft's history of western North America. The series was published by subscription from 1883-1890 in 39 volumes, and the fonts used on all volumes are the same, so the font(s) we're looking for would have to have been available over that timespan. Place of publication was San Francisco. All appear to be in some form of Oldstyle, but they don't seem to correlate to anything I've seen in BB&S, ATF or McGrew. Title (Bancroft's Works) is about 5.5mm, which I estimate to be 20pt. The series volume and subtitle are about 4mm (12pt?). The volume and date on the last line of the bottom label appear to be a shorter, expanded version of the same font, and height is about 2.5mm.\n\nThe noteworthy features of the two primary fonts are the curve of the capital R; the absence of any serif on the center peak of the W; and the parallel legs of the M. More contemporary oldstyle fonts don't combine all three of these characteristics.\n\nExcuse me if my terminology is amateur, as I'm still relatively new to this. Also pardon me if this message seems to have been posted in substantially similar form twice, I think I lost the first one due to operator error.\n\nThanks for your help.\n\n| Attachment | Size |\n| --- | --- |\n| [DSCN0418.JPG](http://web.archive.org/web/20140724114041/http:/typophile.com/files/DSCN0418_0.JPG) | 130.92 KB |\n| [DSCN0419.JPG](http://web.archive.org/web/20140724114041/http:/typophile.com/files/DSCN0419_0.JPG) | 128.27 KB |\n| [DSCN0420.JPG](http://web.archive.org/web/20140724114041/http:/typophile.com/files/DSCN0420_0.JPG) | 124.51 KB |\n\n",
  "author": "oldstyle777",
  "time": "5 Jun 2014 — 7:32pm",
  "uid": "220660",
  "comments": [
    {
      "time": "5 Jun 2014 — 9:42pm",
      "content": "Hi, are you able to get clearer pics? These ones are quite blurry. Also, have they used a similar font on the title pages of the books?\n\n"
    },
    {
      "time": "5 Jun 2014 — 10:40pm",
      "content": "I'll try to get clearer photos tomorrow. The fonts used on the title pages and in the book's contents appear to be one or more Roman fonts. They're not the same as the cover labels. Thanks for helping.\n\n"
    },
    {
      "time": "6 Jun 2014 — 8:26am",
      "content": "New photos attached. Also I didn't mean to prejudice the analysis by referring to \"oldstyle\", only that it's a light weight font.\n\n ![](http://web.archive.org/web/20140724114041im_/http:/typophile.com/files/DSCN0423_4962.JPG)\n\n ![](http://web.archive.org/web/20140724114041im_/http:/typophile.com/files/DSCN0424_5570.JPG)\n\n"
    },
    {
      "time": "6 Jun 2014 — 10:18am",
      "content": "This is definitely NOT it, but it is close in style [http://www.myfonts.com/fonts/itfmecanorma/galba/](http://web.archive.org/web/20140724114041/http:/www.myfonts.com/fonts/itfmecanorma/galba/ \"http://www.myfonts.com/fonts/itfmecanorma/galba/\")\n\n"
    },
    {
      "time": "6 Jun 2014 — 11:49am",
      "content": "Another consideration. Everything here is either caps or numbers. It's possible that this was a Titling font in 18pt and 10pt.\n\n"
    },
    {
      "time": "6 Jun 2014 — 3:21pm",
      "content": "To my eye, this is a version of a font usually then called French Old Style in English speaking countries and was sold as an Elzevir in Europe -- the term Elzevir lumped it together with Dutch fonts of the 17th century. French Old Style is an extremely thin style of font designed by Théophile Beaudoire in 1858. The upper case is derived from Louis Perrin's Lyon Capitals. There is no available digital font, that matches French Old Style, but J.P. Knox has been working on a digital revival of its European predecessor for many years under the name of Marquet Titling.  \nHere is a sample of his work\n\n ![](http://web.archive.org/web/20140724114041im_/http:/typophile.com/files/MarquetTitlingByJPKnoxInUse_5771.jpg)\n  \nwhich is almost identical to the book binding letters. The spurred \\_G\\_ and \\_R\\_ with the tapered curved leg are essentially the same letter-forms as the book binding letters. Other versions of French Old Style have an \\_M\\_ with vertical sides and a \\_W\\_ with no spurs at the vertex.  \nFurther information at [http://typophile.com/node/108094](http://web.archive.org/web/20140724114041/http:/typophile.com/node/108094 \"http://typophile.com/node/108094\")  \nAs for substitutes to match the book binding letters, as I mentioned above no version of French Old Style has been digitized.  \nLoosely similar fonts include Louize [http://www.myfonts.com/fonts/nonpareille/louize/](http://web.archive.org/web/20140724114041/http:/www.myfonts.com/fonts/nonpareille/louize/ \"http://www.myfonts.com/fonts/nonpareille/louize/\") but it's too heavy and is only a partial match, and Romana [http://www.myfonts.com/search/romana](http://web.archive.org/web/20140724114041/http:/www.myfonts.com/search/romana \"http://www.myfonts.com/search/romana\") but again too heavy and an even poorer match.  \nDon \n"
    },
    {
      "time": "6 Jun 2014 — 5:05pm",
      "content": "Well done Don, I could not get even close - letterforms just did not compute.\n\n"
    },
    {
      "time": "6 Jun 2014 — 6:21pm",
      "content": "Thanks Bob. I first noticed this font a few years ago when paging through some 19th century books at a local university library and noting how different the tone was to modern books. So I decided to track it down using the old specimen books.  \nDon\n\n"
    },
    {
      "time": "7 Jun 2014 — 3:26am",
      "content": "First off, thanks to all of you—especially Don—who have provided input on this. Let me re-focus this discussion a little. My desire is to identify the ORIGINAL font used and if at all possible, to use moveable type from that font to reproduce the labels on these 39 volumes. (I know that’s a tall order.) If and when it becomes obvious that that is impossible, I may seek a digital solution. For the record, the most pleasing digital fonts I have seen are Paratype “Neva” and (surprisingly) Microsoft’s Yu Mincho Light. (Neva was identified via Identifont.)  \nFrench Old Style has been on my radar screen for some time as a likely match. Reviewing old specimen books from BB&S, Inland, ATF, Linotype and Intertype as well as McGrew’s catalog of 20th Century types, I have not found a good match under French Old Style or any other Old Style, Bookman, Booklet, Lightface, Clearface or other. Most of these have serifs at the apex of the W and M’s with slanted legs, and few have the curved leg on the R. None has all three. Specimens for many of the possible matches don’t include all of these letters, which hampers comparison. My hope was that one of you might have access to 19th century specimen books that I don’t and could find it that way.  \nBancroft and his brother operated the printshop that published these books from the early 1860’s through at least the 1890’s in San Francisco. You may have seen my other post for a font that I believe was based on Bauer Gable. What I didn’t mention is that that book, published in Missouri in 1894, used what I believe to be this same typeface on its title page. Don’s posts to date (in this and other message threads) suggest that French Old Style or Elzevir was designed in 1858, adapted by others, and widely used in Europe and America through the last half of the century, and finally fell out of favor near the turn of the century. Because I can trace use to printers in SF and Missouri who made a lot of books in this timeframe, my guess is that it was being made or imported and distributed by a major player in the type business in this timeframe. I’m too new at this to know who that might have been, but I think that’s the direction to look in—specimen books from major foundries and importers who might have been selling type west of the Mississippi during this timeframe to significant book printing shops. Were Lyon Capitals, Beaudoire’s French Old Style or any of the European derivatives being imported to America in a big way?  \nAgain, thanks to all for your help.  \nBill S\n\n"
    },
    {
      "time": "7 Jun 2014 — 4:36am",
      "content": "Gold hot foil stamping will require metal type if you want to reproduce the labels close to the originals. Finding something close maybe be hard so you should check the letterpress printing newsgroups. Photo polymer plates I don't think will work for stamping foil but those can be used for a printed paper label. Most hand bookbinders have some types for foil stamping in my experience, but only one or two.\n\n"
    },
    {
      "time": "7 Jun 2014 — 5:21am",
      "content": "Bill I wish you luck on a search for a specimen book from the mid 1890s with a match.  \nSome books have not only survived, but are digitally available at Archive org or HATHI. Unfortunately most are from the ATF combine, or Inland. Of these ATF Pacific Blue is worth a close check. But there is nothing digital from Bruce, Connors, BB & S or other foundries of the early to mid 1890s.  \nI note you are in California. A visit to the University of Cailfornia might turn up something in the rare books collection. Some of the best digital specimen books at Archive Org are from that source. Best to check several UC locations.  \nFor purchase of a specimen book E-bay, Abe books, Amazon and Google could be explored for leads.  \nFinally, just because a font was used by a publisher in 1894 doesn't mean that it was a new font. Parsimony is the name of the game in book publishing then as now and some less frequently used fonts could have been many years old.  \nI am not clear from your remarks whether you do letterpress printing yourself. If you do, ignore the rest of this paragraph. ... If you can identify a font by name that you think would work you can then attempt to purchase it. My observation from casual visits to letterpress websites is that there is an active market for letter press fonts. Some old some new. And there are advice and trading forums on the internet.  \nAs for technique, Bob's suggestion seems good. Again I expect your attempt is not unique and some internet digging could be helpful.  \nI wish you good luck on achieving a satisfying outcome.  \nDon\n\n"
    },
    {
      "time": "7 Jun 2014 — 5:17am",
      "content": "Another possibility that might work. Find a suitable digital font, convert it to eps and/or whatever format can be read by a digital printer. Have 3D printing service produce a thermal tolerant mold used to cast a metal plate suitable for hot foil stamping. It's at least worth exploring this concept.  \nDon\n\n"
    }
  ]
}
