{
  "id": "117030",
  "title": "Third typeface paring with Coranto 2 and LFT Ethica for newspaper?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey guys,\n\nAbout six months ago, I spent several months redesigning a broadsheet newspaper, and we purchased Coranto 2 and LFT Etica as the pairing for it. I'm extremely happy with it.\n\nWe use Coranto 2 Headline for headlines (and sometimes LFT Etica for smaller story headlines and for all headlines in supplements that come with the paper), Coranto 2 for body text, and LFT Etica for things like writer bylines, sub-heads, drop quotes, and the like.\n\nHowever... I can't help but feel that LFT Etica is a bit boring. I would like to spice things up a bit with a third choice, perhaps for using in things like block heads and under photo captions. I don't know why, but I'm envisioning something a bit more square and a bit less neutral than LFT Etica – having flair – but something that looks like it complements Coranto 2 and LFT Etica rather than being something different entirely. I would then use this font more liberally in the supplements and perhaps in one of the magazines that comes with the paper, but only sparsely in the main broadsheet.\n\nFirstly: is this the done thing? Should I just try and come up with a better pairing that Coranto 2/LFT Etica, or is adding in a third choice a good move, especially if it complements the other two?\n\nThanks!\n\n",
  "author": "Vivara",
  "time": "3 Jun 2014 — 4:35pm",
  "uid": "177052",
  "comments": [
    {
      "time": "3 Jun 2014 — 4:38pm",
      "content": "Just to add some further thoughts: it would be great if this third font had a large family and many weights – as it would probably become the main font for the supplement and I'd like a lot of variation, but that may be too much to ask for.\n\n"
    },
    {
      "time": "3 Jun 2014 — 9:15pm",
      "content": "I don't think you should add a third font to the mix, unless it's _very_ compatible in style to one of the two existing ones. It sounds like a better idea to replace Etica entirely, if you're sure you no longer like it.\n\nWhat about this?  \n [https://monokrom.no/fonts/telefon](http://web.archive.org/web/20150417042042/https:/monokrom.no/fonts/telefon \"https://monokrom.no/fonts/telefon\")\n\nhhp\n\n"
    },
    {
      "time": "4 Jun 2014 — 2:23am",
      "content": "What Hrant said. Maybe, for added flexibility you could look for something with both sans and slab designs (like many of Type Together offerings, for example).\n\n"
    },
    {
      "time": "4 Jun 2014 — 9:21am",
      "content": "Thanks for the replies.\n\nI was afraid you would say that – and deep down, I think you're right. How about if I was to only use two combinations at a time? Which I suppose is not what I was looking for, but it's a start. Unfortunately, I don't think I could suddenly swap out LFT Etica ... from the broadsheet, anyway.\n\nFor instance, I just spotted [this from Type Together's \"Type in Use\" section](http://web.archive.org/web/20150417042042/http:/www.type-together.com/index.php?action=portal/viewContent&cntId_content=3029).\n\nThey use Coranto 2 and LFT Etica in the main section, and Bree and Adelle in the other section. I'd like a font with some more flair to use with Coranto 2 in the newspaper's supplements, and I wouldn't use LFT Etica in them then. But I'd like it to feel like it was in the same \"extended family\", if you know what I mean. I don't think Telefon is the right fit, although I do love it.\n\n"
    },
    {
      "time": "4 Jun 2014 — 9:43am",
      "content": "A bold slab could be useful.  \nI went bold in two directions with Pratt Nova, both high contrast and slab, which gave the Globe designers lots of options.  \n [http://webmedia.newseum.org/newseum-multimedia/dfp/pdf4/CAN\\_TGAM.pdf](http://web.archive.org/web/20150417042042/http:/webmedia.newseum.org/newseum-multimedia/dfp/pdf4/CAN_TGAM.pdf \"http://webmedia.newseum.org/newseum-multimedia/dfp/pdf4/CAN\\_TGAM.pdf\")\n\nI will be releasing that later in the year.  \nIn the meantime, I would say look for a somewhat condensed slab face, especially one with some thin weights that would be useful at large display size in the supplements. Perhaps you might also persuade TT to do an ultra-fine version of Coranto for that kind of usage.\n\n"
    },
    {
      "time": "4 Jun 2014 — 1:53pm",
      "content": "Thanks Nick – that's really helpful. Pratt Nova is absolutely stunning. Was it custom for the Globe?\n\nWould you also be of the opinion that adding a third typeface to the main mix is a bad idea? I would never use it in a way that would allow it to _compete_ with the other two fonts. For instance, The Observer in the UK has a mix of three going on, but they seem to complement each other very well:\n\n![Image from the Observer newspaper](http://web.archive.org/web/20150417042042im_/http:/www.dcscience.net/oberver-020613.jpg)\n\nSomehow, I actually think this could be fine.\n\nAnd that is a slab, too.\n\n"
    },
    {
      "time": "4 Jun 2014 — 2:51pm",
      "content": "Thanks for the kind words, Edmund.  \nYes, Pratt was custom for the Globe.  \nI originally published it commercially in 2009, but in a subsequent redesign we made substantial changes and additions (hence the “Nova” apellation), which I have not yet updated in the commercial release.\n\nYes, I do think that a third style can complement a sans+serif main combo, and a slab can do the trick.  \nBut these days, I see no reason not to use something more exotic, a rounded style or a script for instance, perhaps distressed.\n\nOf course, the key is to provide sufﬁcient contrast in style (caps – lower case – italic), size, weight and even colour, between the typefaces.\n\n"
    },
    {
      "time": "7 Jun 2014 — 1:14pm",
      "content": "Nick, those words were more honest than \"kind\" – the typography in the Globe really makes me envious.\n\nI think you give some fantastic advice there: I am searching for good rounded and slab matches. Any suggestions would be appreciated. I think a script would be a bit too much for me to take, although I agree the consideration has some merit.\n\nThe most important bit is the sufficient contrast – that really is key.\n\nReading your earlier post above again, I was surprised your mention of an \"ultra fine\" Coranto commission didn't bring our own custom work to my mind. While it may not be ultra fine, we did a lighter version in house of Coranto for some of our section heads:\n\n ![](http://web.archive.org/web/20150417042042im_/http:/typophile.com/files/customexample_3650.jpg)\n\nI am sure though you may not be impressed with some of the aspects like the kerning and our quick-turnaround custom job (it was done in a few days just before we launched our redesign), because I haven't been back to fix some of the problems that irk me since, but it has served us well.\n\nOnce again, thanks everyone for your help!\n\n"
    },
    {
      "time": "7 Jun 2014 — 2:54pm",
      "content": "Beware, many foundries don’t allow modifications of their fonts. From TypeTogether’s EULA:\n\n_you are not permitted to alter the Font Software in any way, such as by decompiling, reverse engineering, disassem- bling, modification, or altering or changing the Font Software or any associated embedding bits or convert the Font Soft- ware for use as a webfont without prior written notice to and the express permission of TypeTogether._\n\n"
    },
    {
      "time": "7 Jun 2014 — 7:28pm",
      "content": "Don't worry – we have not altered the font software. The section heads are actually just modified outlines in Illustrator.\n\n"
    }
  ]
}
