{
  "id": "117014",
  "title": "Italian fascist period font",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": "Any similar font I could use for a writing of an early century bar? I am looking for a font similar to this one, from the fascist period in Italy, used for wall-written slogans for political propaganda?  \nI particularly like the square C.  \nThanks\n\nSilvia\n\n| Attachment | Size |\n| --- | --- |\n| [IMG\\_0700.JPG](http://web.archive.org/web/20150110203047/http:/typophile.com/files/IMG_0700.JPG) | 150.45 KB |\n\n",
  "author": "ciciomato",
  "time": "3 Jun 2014 — 7:14am",
  "uid": "42977",
  "comments": [
    {
      "time": "3 Jun 2014 — 8:04am",
      "content": "[Gaz](http://web.archive.org/web/20150110203047/http:/www.myfonts.com/fonts/typodermic/gaz) is close though not matching. More as usual for this kind of signage by [Jeff Levine](http://web.archive.org/web/20150110203047/http:/www.myfonts.com/foundry/Jeff_Levine): [Lobby Card](http://web.archive.org/web/20150110203047/http:/www.myfonts.com/fonts/jnlevine/lobby-card), [Deerfield](http://web.archive.org/web/20150110203047/http:/www.myfonts.com/fonts/jnlevine/deerfield)\n\n"
    },
    {
      "time": "3 Jun 2014 — 8:59am",
      "content": "Credere, obbedire, combattere (“Believe, Obey, Fight”)  \nI tried to find a font that matched 1. The specific boxy structure. 2. The ratio between height and width, 4. The stroke weight, and 5. The fascist mood.  \nI suggest Linotype Case Study No 1 Pro Bold [http://www.myfonts.com/fonts/linotype/case-study-no-one-lt/](http://web.archive.org/web/20150110203047/http:/www.myfonts.com/fonts/linotype/case-study-no-one-lt/ \"http://www.myfonts.com/fonts/linotype/case-study-no-one-lt/\") The main difference is the squared corners in the counters -- which in my opinion adds to the feeling of fascist harshness. The main editing changes for an excellent match are to narrow the \\_M\\_, clip the serifs on I and shorten the middle stroke on the E.  \nUse the modified font for a Fascist slogan like Se avanzo, seguitemi; se indietreggio, uccidetemi; se muoio, vendicatemi (“If I advance, follow me. If I retreat, kill me. If I die, avenge me”) and it's almost overpowering. For better or worse, few people think or talk like that today. More Italian Fascist slogans at [http://en.wikipedia.org/wiki/Italian\\_Fascism#Italian\\_Fascist\\_slogans](http://web.archive.org/web/20150110203047/http:/en.wikipedia.org/wiki/Italian_Fascism#Italian_Fascist_slogans \"http://en.wikipedia.org/wiki/Italian\\_Fascism#Italian\\_Fascist\\_slogans\")  \nDon\n\n"
    },
    {
      "time": "5 Jun 2014 — 3:32pm",
      "content": "Lovely answer, Don. I'm fascinated. :-)  \nPoint is, I'm thinking of using a similar font for an insignia of a 1940's italian café, today turned into a mittleuropean style, high-end wine bar/bistro.  \nI intend to maintain the middle 1900 feel since it all started then, and the bar also is part of the official \"historical bar\" association.  \nDo you think these fonts are too much politically/historically connotated in relation to fascist era and I may miss the traditional 1900 feel?  \nThanks\n\n"
    },
    {
      "time": "5 Jun 2014 — 4:39pm",
      "content": "Don has a good eye, but Case Study No. One looks a bit too digital to fit the period.\n\n"
    },
    {
      "time": "5 Jun 2014 — 4:41pm",
      "content": "I am totally incompetent to answer a question about current or past Italian political culture. Years ago I did read some books on the Italian Fascist experience. Recently I watched the DVD on the TV mini-series Il commissario De Lucaon [Inspector De Luca] and was captivated by the stylistic mood. Saw lots of period piece movies too.  \nAll this being said, Fascism dominated the style of mid 1900s Italy -- at least until 1945 -- and I would have no hesitation for using this boxy lettering for the era. BTW don't lose the squared leg on the R. Also, a nuanced Trajan style Roman or a flowing script would be so wrong for the era. I detest period recreations with lettering that is anachronistic.  \nDon\n\n"
    },
    {
      "time": "5 Jun 2014 — 4:49pm",
      "content": "Hi Bob, I share your concern over the digital issue. Case Study No. One is a superbly executed font. Some variation and roughening of the outlines -- not a lot -- would really add to the impact. Perhaps generate the letters for phrases as images and do this in Photoshop or similar program.  \nDon\n\n"
    },
    {
      "time": "5 Jun 2014 — 7:00pm",
      "content": "Good thought Don, even just a slight blur might give it a more retro feel.\n\n"
    },
    {
      "time": "12 Jun 2014 — 4:47am",
      "content": "Maybe because I am Italian, and I have somehow lived the fascist style in my own country in many ways and shapes, (lots of buildings are still there, the architecture seems to scream out the same slogans through its shapes.), but No One is totally missing the flavour I am trying to maintain.  \nSometimes, incredibly, being a native Italian can be very helpful.  \nI can send drafts for you to judge, if you could please do so. I know you'll be inexorable.  \nThanks\n\n"
    },
    {
      "time": "12 Jun 2014 — 9:04am",
      "content": "I can appreciate the problems have with the appropriateness of Case Study No. One as a match. Unfortunately I don't have a better substitute to offer.  \nBTW as for critiquing drafts, I feel that this is something that you might consider doing with someone with whom you have a consulting contract or arrangement.  \nI wish you good fortune for your project.  \nDon\n\n"
    },
    {
      "time": "14 Jun 2014 — 3:16am",
      "content": "Thanks Don, not looking for free professional critique of my drafts, for sure. It was just a logical consequence to me.  \nWish all the best to you all, no drafts coming :-)  \nTake care\n\n"
    },
    {
      "time": "14 Jun 2014 — 7:28am",
      "content": "No problem.  \nDon\n\n"
    }
  ]
}
