{
  "id": "117043",
  "title": "Scripted font, can't find matching \"C\"",
  "forum": "Home",
  "tags": [
    "Script"
  ],
  "content": " ![](http://web.archive.org/web/20140724114029im_/http:/typophile.com/files/Untitled-1_3858.png)\n\n",
  "author": "guardduvie",
  "time": "4 Jun 2014 — 6:51am",
  "uid": "220625",
  "comments": [
    {
      "time": "4 Jun 2014 — 7:48am",
      "content": "Any idea where this is from & when?  \nDon\n\n"
    },
    {
      "time": "4 Jun 2014 — 3:57pm",
      "content": "...so far looks like this ID project is a non starter.  \nShame, I like the design. Anyone have a suggestion?  \nDon\n\n"
    },
    {
      "time": "4 Jun 2014 — 5:10pm",
      "content": "Laura Worthington's [Number Five Smooth](http://web.archive.org/web/20140724114029/http:/www.myfonts.com/fonts/laura-worthington/number-five/) , manually slanted, would be quite close - except the C. There's an alternate b without the connector - like yours. That C may be a modification or borrowed from some sport script.\n\n"
    },
    {
      "time": "4 Jun 2014 — 5:44pm",
      "content": "Good digging Mike! If one wanted to make something like the sample this would work as a starting point. The letter-forms, weight, and contrast are definitely in the ballpark. About another five degrees of slope and some editing of details, and Number Five is pretty close. In any case I appreciate Laura Worthington as one of our more accomplished script font makers.  \nDidn't get any further info from the ID requestor, so we really have very little to go on to determine if this is a script as such, or a custom word .  \nI am still interested in this project because the letters suggest something that would be [or is] an engaging script.  \nDon\n\n"
    },
    {
      "time": "4 Jun 2014 — 7:38pm",
      "content": "This is isolated from a branded logo (current), it's the Caribbean brand by Roundtree & Yorke.\n\n ![](http://web.archive.org/web/20140724114029im_/http:/typophile.com/files/IMG_2958_4745.JPG)\n\n"
    },
    {
      "time": "5 Jun 2014 — 5:38am",
      "content": "Thanks for the source info. I did some checking on-line, and observed that this is perhaps the new version of Roundtree & Yorke's \\_Caribbean\\_ trademark. At least it's shown on labels of Roundtree & Yorke's \\_Caribbean\\_ items now being sold by major retailers. I was not able to find information on the date of trademark registration, but I did find labels on what may have been earlier stock of Roundtree & Yorke's \\_Caribbean\\_ label with the word \\_Caribbean\\_ in a Roman text.  \nOn balance, I'm going to guess that Roundtree & Yorke's \\_Caribbean\\_ trademark as shown in the image, is the fairly recent work of a designer who may or may not have adapted Laura Worthington's Number Five Smooth, published in February 2013 or earlier.  \nOf course, the designer might have adapted another baseball style script.  \nDon\n\n"
    }
  ]
}
