{
  "id": "117102",
  "title": "Looking for stories/info on history of type design profession",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi there,\n\nI'm doing research for a project involving the type design profession during the mid-20th century (40s – 60s)\n\nSpecifically, I'd like to read personal accounts and/or descriptions of what the industry was like for type designers during that period. Subjects I'm especially interested in are:\n\n- What were the big foundries in the US at that time (ie, where did type designers want to work)\n\n- How did people go into type design—were there colleges that taught that subject at that time or was it more of an apprenticeship path?\n\n- What schools, if any, offered courses and studies in type design during that period?\n\n- Was type design considered its own specialty/profession back then, or did it emerge out of a larger field?\n\n- What was the percentage of young women going into type design during that period? Was it rare/unheard of? (ideally, I'd love to read personal stories by women who did become type designers during that time.)\n\nSo far it's been hard trying to find specifics as most resources seem to focus more on the history of typefaces and typography itself, rather than the history of the type designers' profession. Any info, links, or book/doc recommendations would be most appreciated!\n\n",
  "author": "CasimirEffect",
  "time": "6 Jun 2014 — 4:49pm",
  "uid": "220674",
  "comments": [
    {
      "time": "6 Jun 2014 — 5:41pm",
      "content": "There are probably folks around here who know more about that period than I do. But I will share a few thoughts.\n\nThere were definitely no degree programs or schools actively teaching type design as a degree program at that time, and AFAIK there were no college or university courses available in type design at that time. It was very much an on-the-job apprenticeship kind of thing. It was its own specialty/profession, although type designers often came from the larger field of graphic design, especially book design and the like.\n\nThe short-lived Master's program at Stanford didn't happen until the early or mid-80s. It only graduated five students (one of them being Carol Twombly). The next such thing anywhere in the west was the MA Typeface Design at Reading, which started around 1995. Then the Type & Media program at the Hague in 2002....\n\nType design was a very male-dominated profession back then. The only female type designer of that period that springs to mind for me is Margaret Calvert. One started seeing more women in type design toward the end of the phototype period, in the late 1970s and early 1980s, with Fiona Ross, Veronika Elsner, Freda Sack and others.\n\n"
    },
    {
      "time": "7 Jun 2014 — 12:30am",
      "content": "Thanks, Thomas! Appreciate the info.\n\n"
    },
    {
      "time": "8 Jun 2014 — 5:55pm",
      "content": "During that era, I think that the replacement of hand lettering in process graphics, for headlines, by pre-made lettering, offered the major opportunity for the top lettering artists to become type designers—in as much as they were working with the medium of phot0-typositor.\n\nMy take on the subject:  \n [www.shinntype.com/Writing/GoldenAge.pdf](http://web.archive.org/web/20140710230208/http:/www.shinntype.com/Writing/GoldenAge.pdf \"www.shinntype.com/Writing/GoldenAge.pdf\")\n\n"
    }
  ]
}
