{
  "id": "117213",
  "title": "Black Letter font used on Skids label?",
  "forum": "Home",
  "tags": [
    "Display"
  ],
  "content": "Black Letter font used on Skids label?\n\n| Attachment | Size |\n| --- | --- |\n| [142728b 2.jpg](http://web.archive.org/web/20140701102418/http:/typophile.com/files/142728b%202.jpg) | 57.36 KB |\n\n",
  "author": "cool_hand",
  "time": "12 Jun 2014 — 6:37am",
  "uid": "16714",
  "comments": [
    {
      "time": "12 Jun 2014 — 7:54am",
      "content": "1979, the photo-lettering era. I'm not certain if this one is digitized.  \nI'ts a variation of Fette Fraktur first cut by Weber in 1875 [http://www.myfonts.com/search/fette+fraktur/fonts/](http://web.archive.org/web/20140701102418/http:/www.myfonts.com/search/fette+fraktur/fonts/ \"http://www.myfonts.com/search/fette+fraktur/fonts/\")  \nThere are significant differences in some capitals, less so in the lower case.  \nThe \\_S\\_ might be an enlarged \\_s\\_.  \nIf this was not a photo-lettering era redesign, a match might be found Gerhard Helzel's collection [http://www.fraktur.biz/](http://web.archive.org/web/20140701102418/http:/www.fraktur.biz/ \"http://www.fraktur.biz/\")  \nAnd it's interesting to explore the Blackletter Revival at Moorstation at [http://moorstation.org/typoasis/blackletter/](http://web.archive.org/web/20140701102418/http:/moorstation.org/typoasis/blackletter/ \"http://moorstation.org/typoasis/blackletter/\")  \nI would be interested in what our fraktur experts have to say.  \nDon\n\n"
    },
    {
      "time": "12 Jun 2014 — 2:48pm",
      "content": "Hi, thanks for the reply - agree it looks like Fette Fraktur but it looks like a black weight and I agree it looks like they enlarged the lowercase s for cap S.\n\n"
    },
    {
      "time": "12 Jun 2014 — 3:26pm",
      "content": "See Ralph Unger's version of [Haenel Fraktur](http://web.archive.org/web/20140701102418/http:/www.myfonts.com/fonts/rmu/haenel-fraktur/). Your lowercase 's' is in the number sign position and the 'k' is a tz ligature offered in the character set.\n\nNote that if this was done with photolettering, they had all sorts of tricks to optically alter film fonts (wider, bolder).\n\n"
    },
    {
      "time": "12 Jun 2014 — 4:01pm",
      "content": "Good find Mike. If you widen Haenel Fraktur most of the letters match. \\_S\\_ is indeed an enlarged \\_s\\_. \\_A\\_ is reworked to make it more readable as a Latinate form and \\_H\\_ is also a reworked \\_A\\_. I expect that other capital letters not in the label were also reworked to make them more readable as Latinate forms.  \nDon\n\n"
    },
    {
      "time": "12 Jun 2014 — 4:10pm",
      "content": "Thanks, Don. Widening alone won't do the trick, as the counters end up too large (I tried it). Stretching _and_ adding a slight stroke does get it very close.\n\n"
    },
    {
      "time": "12 Jun 2014 — 4:56pm",
      "content": "Mike, this shows that some effort was put into making a new font from the original Haenel Fraktur model.  \nAs you know the photo-lettering companies had very creative designers who completely redrew classic designs. Then the photo part came in to create the variations. But I still have no idea whether this redesign was done in that era or many years earlier. Also I would love to see a complete alphabet.  \nDon\n\n"
    },
    {
      "time": "12 Jun 2014 — 7:59pm",
      "content": "Walden fonts offers [an even narrower version](http://web.archive.org/web/20140701102418/http:/www.waldenfont.com/product.asp?productID=2).\n\nLuc Devroye's [page on Haenel](http://web.archive.org/web/20140701102418/http:/luc.devroye.org/fonts-39661.html).\n\n"
    },
    {
      "time": "12 Jun 2014 — 8:37pm",
      "content": "Google Books offers a viewing of [an old book](http://web.archive.org/web/20140701102418/http:/books.google.com/books?id=OkU-AAAAcAAJ&pg=PT4&dq=Original+Englische+Schriften+aus+der+Schriftgiesserei&hl=en&sa=X&ei=rmuaU765OoX3oATItYKICA&ved=0CCIQ6wEwAA#v=onepage&q=Original%20Englische%20Schriften%20aus%20der%20Schriftgiesserei&f=true) that shows the typefaces (and decorative elements) of the Haenel Foundry. I went through the whole long thing and the only place I spotted Fette Haenel Fraktur (not with that name) was roughly 3/5 of the way down (no page #s) - and that was an outlined/shaded showing of a few words only.\n\nInteresting viewing, nevertheless.\n\n"
    },
    {
      "time": "13 Jun 2014 — 3:27am",
      "content": "Mike, this is a fascinating book showing a huge variety of typefaces from around 1840 to 1850. I recognize a few as being digitized. As was the practice of the era almost none have names. Only stock numbers. Even different sizes of the same typeface have different numbers. Not certain if this is the one you are referring to, but I selected it because of the elaborate encrusted ornamentation\n\n ![](http://web.archive.org/web/20140701102418im_/http:/typophile.com/files/MusirteFrakturen3@HaenelEnhanced_5905.jpg)\n BTW, This was one of the clearest images in the book. I tinkered with it to enhance it's clarity. I wish Google had paid some attention to the quality of its scans. They are appalling, particularly when compared to the ones done by University of California & University of Toronto and shown at Archive.org.  \nDon\n\n"
    },
    {
      "time": "13 Jun 2014 — 4:07am",
      "content": "This is the image I found (unretouched):\n\n ![](http://web.archive.org/web/20140701102418im_/http:/typophile.com/files/HaenelFr_01_5674.jpg)\n\nSo when its label reads ...\n\nZierschrift  \nNo 64\n\n... Zierschrift isn't part of the name? If not, I guess it just means \"ornamental writing\" (as Google translates it).\n\nAs an aside - Insert Image works for me _maybe_ once in twenty tries, whether using IE or Chrome. VERY frustrating. Does anyone else have that problem?\n\n"
    },
    {
      "time": "13 Jun 2014 — 4:33am",
      "content": "Yes \"zeir\" merely means fancy or ornamented and can be applied to any font. \"Shrift\" is correctly translated by Google. You will note similar terms such as \"zeirfraktur\" which is a compound with an obvious meaning.  \nInsert image works fine for me in Firefox. Using jpg with standard file names, e.g. ones that do not include \\_&\\_.  \nDon\n\n"
    },
    {
      "time": "13 Jun 2014 — 4:52am",
      "content": "Thanks, Don. File name definitely isn't the problem. Grrrr ...\n\n"
    },
    {
      "time": "13 Jun 2014 — 6:31am",
      "content": "The \"new and improved\" version is on a CD with the Virgin label. I wonder if Virgin released any other CD's circa 1979 with the same version? If so, another Virgin CD might show some more \"new and improved\" letters.  \nDon\n\n"
    },
    {
      "time": "15 Jun 2014 — 4:04pm",
      "content": "I have a copy of the original 1979 album, but presently not to hand as it's in storage. I remember the sleeve was with-drawn or banned fairly soon after it's release as it was considered Fascist imagery (and replaced with an alternative design). It won't be Photo-Lettering Inc. as it was designed in the UK but it is probably photo-set by one of headline setters that were around in London at that time.\n\n"
    },
    {
      "time": "15 Jun 2014 — 4:23pm",
      "content": "Fascinating. Political correctness at work. A Brit designer tried to break out of the mold and got slapped down. in 1979. Very sad.  \nPerhaps today it would be accepted as a statement of Los Angeles Street scene or hip Biker Style.  \nDon\n\n"
    }
  ]
}
