{
  "id": "117244",
  "title": "Font used in a logo I need to reproduce",
  "forum": "Home",
  "tags": [
    "Unknown"
  ],
  "content": "I have tried to identify this font and I have been given various names on automated sites but non resemble this font :) It should be a fairly popular font as the guy who produced the logo is not an expert and only has basic programs.\n\n ![](http://web.archive.org/web/20150414142913im_/http:/typophile.com/files/business_3423.PNG)\n\nFont:&nbsp;\n\n Helvetica \n\nSolved By:&nbsp;\n\n [Birdseeding](http://web.archive.org/web/20150414142913/http:/typophile.com/user/88704 \"View user profile.\")\n\n",
  "author": "ukracer",
  "time": "13 Jun 2014 — 9:50am",
  "uid": "220820",
  "comments": [
    {
      "time": "13 Jun 2014 — 10:15am",
      "content": "Helvetica, I'm fairly certain. Although that said these aren't exactly the most distinctive letters possible.\n\n"
    },
    {
      "time": "13 Jun 2014 — 11:03am",
      "content": "What letters would be better to see??\n\n"
    },
    {
      "time": "13 Jun 2014 — 11:08am",
      "content": "I am a bit confused as I found this.\n\n\"The Helvetica® typeface is one of the most famous and popular in the world. It’s been used for every typographic project imaginable, not just because it is on virtually every computer. Helvetica is ubiquitous because it works so well.\"\n\nIts saying its on virtually every computer BUT its a commercial font so its not likely to be on almost every computer surely??\n\nIs there a free alternative?\n\nThanks in advance.\n\n"
    },
    {
      "time": "13 Jun 2014 — 1:15pm",
      "content": "Popular commercial fonts like Helvetica are often licensed as basic packages with computer operating systems, so assuming you own the license to the software, you can use the font commercially and legally. And if you don't have Helvetica on your computer, you almost certainly have Arial, which would be extremely close for the letters in your sample.\n\n"
    },
    {
      "time": "13 Jun 2014 — 1:28pm",
      "content": "\\_G\\_, \\_Q\\_, \\_R\\_, \\_K\\_, \\_W\\_, \\_M\\_, \\_J\\_ , \\_Y\\_ and \\_S\\_[which you already provided] work for me in telling one sans from another. For the lower case: \\_g\\_, \\_k\\_, \\_r\\_, \\_a\\_, \\_f\\_, \\_s\\_, \\_e\\_, \\_j\\_, and \\_y\\_. Don't need them all, but the more the better.  \nDon\n\n"
    }
  ]
}
