{
  "id": "117290",
  "title": "Is a slab serif like Sentinel or Clarendon a good choice for body text?",
  "forum": "General Discussions",
  "tags": [
    "Clarendon",
    "General Discussions",
    "sentinel",
    "slab serif",
    "whitney"
  ],
  "content": "Hi friends, I am using Whitney font for headlines and I am thinking of using Sentinel for body text. Wondering if anybody has any comments about this choice since its a slab serif like Clarendon and so I am not sure if those fonts are meant more to be used for headlines reather than body text. So if you have any insights about this they would be greatly appreciated. Cheers\n\nAnd here is a link to the Sentinel font:\n\n[http://www.typography.com/fonts/sentinel/styles/screensmart/](http://web.archive.org/web/20150215223904/http:/www.typography.com/fonts/sentinel/styles/screensmart/ \"http://www.typography.com/fonts/sentinel/styles/screensmart/\")\n\n",
  "author": "Aluxe",
  "time": "16 Jun 2014 — 8:41am",
  "uid": "189676",
  "comments": [
    {
      "time": "16 Jun 2014 — 11:51am",
      "content": "While Clarendon is generally thought of as a display face, and it is also bolder than normal for a text face, it isn't completely unsuitable for such use.\n\nCentury Schoolbook, a very legible text face, is sometimes referred to as being related to a Clarendon. Also, the Diplomat typestyle for the IBM Selectric typewriter (not generally available in North America, but used in the U.K., for example) is Clarendon-based, and an appealing style for general typing.\n\nSentinel seems to be entirely suitable for text use, given that it comes in a range of weights.\n\n"
    },
    {
      "time": "16 Jun 2014 — 12:00pm",
      "content": "Quadibloc thanks for your comment, its super helpful in to me. Really appreciate it! I think I will then proceed to use Sentinel\n\n"
    },
    {
      "time": "17 Jun 2014 — 11:35pm",
      "content": "Just my personal feeling, but Clarendon is a bit off... It's too black and \"extended\".  \nSentinel is just fine! If I remember it right, the Obama campaign has used it.\n\n"
    },
    {
      "time": "18 Jun 2014 — 3:16am",
      "content": "Christian Schwartz designed \\_Guardian Egyptian\\_ -- a category of font with similarities to Clarendon -- with many variations including \\_Guardian Egyptian Text\\_. You might find it helpful to read his discussion of the text family at [http://www.christianschwartz.com/guardian.shtml](http://web.archive.org/web/20150215223904/http:/www.christianschwartz.com/guardian.shtml \"http://www.christianschwartz.com/guardian.shtml\") and [http://www.christianschwartz.com/gdntegyp.shtml](http://web.archive.org/web/20150215223904/http:/www.christianschwartz.com/gdntegyp.shtml \"http://www.christianschwartz.com/gdntegyp.shtml\")  \nDon\n\n"
    },
    {
      "time": "8 Aug 2014 — 8:57am",
      "content": "Not only have people used typefaces similar to Clarendon for body text, but even typefaces of the kind to which Stymie, Cairo, and Memphis belong, with unbracketed serifs and uniform stroke weight have been used for body copy, with reasonable success.\n\nBut that still is something not recommended; one can use Futura or Helvetica for body copy, and people can read it, but that doesn't mean those faces are optimal for that purpose. Compared to Futura, however, the Egyptians have both humanistic shapes and serifs of a sort, and the complete lack of stroke contrast is not nearly the problem that the extreme stroke contrast of Bodoni would be.\n\nWhat I've seen in Stymie and similar faces are local newsletters and the like, not major publications or long novels. But they didn't seem to have serious issues.\n\n"
    },
    {
      "time": "5 Sep 2014 — 10:04am",
      "content": "You may want to use something in the line of Scotch typefaces with a lot of personality like Hercules:\n\n[http://www.stormtype.com/family-hercules.html](http://web.archive.org/web/20150215223904/http:/www.stormtype.com/family-hercules.html \"http://www.stormtype.com/family-hercules.html\")\n\n"
    },
    {
      "time": "5 Sep 2014 — 2:16pm",
      "content": "As the above poster notes, a scotch for body and a clarendon for headlines can work well. If you want that sort of flavour.\n\n"
    }
  ]
}
