{
  "id": "117233",
  "title": "The Woo Group RBC Wealth Management Hong Kong USA - The Benefit of a Diversified Portfolio",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "The Benefit of a Diversified Portfolio",
    "The Woo Group RBC Wealth Management Hong Kong USA"
  ],
  "content": "Perhaps nothing better illustrates the importance of implementing and maintaining a diversified portfolio than seeing how allocations to multiple asset classes compare. The chart below ranks the best to worst performing asset classes selected — from top to bottom — for each calendar period shown based on total returns. Through graphical depictions of past performance fluctuations, this demonstrates the historical trend of alternating leadership in the financial markets, as well as highlights the potential dangers associated with attempts to chase last year’s or predict next year’s winners. In short, this chart helps support the case for an asset allocation plan that is customized to include a blend of asset classes.\n\nCash and Money Markets — Represents performance of cash and money markets in the United States as measured by the Citigroup 3-Month Treasury bill Index. Money market funds are not federally guaranteed. It is possible to lose money.\n\nTaxable Bonds — Represents taxable investment-grade fixed-rate debt obligations (Treasuries, Agencies, Corporates, Mortgage-Backed Securities, Asset-Backed Securities and Commercial Mortgage-Backed Securities) as measured by the Lehman Aggregate Bond Index.\n\nHigh Yield Bonds — Represents tradable below-investment-grade fixed-rate debt obligations, including cash-pay, deferred-interest, step-up, payment-in-kind and defaulted bonds, with remaining maturities of at least 1 years measured by the CSB High Yield Bond Index.\n\nInternational Bonds — Represents tradable investment-grade fixed-rate debt obligations of sovereign governments from 20 developed countries, excluding the United States, as measured by the Citigroup Non-US Dollar World Government Board Index.\n\nLarge Cap Growth Stocks — Represents stock market performance of those companies in the Russell 1000 Index with an above-average growth orientation based on price-to-book ratios and long-term earnings growth forecasts as measured by Russell 1000 Growth index.\n\nLarge Cap Value Stocks — Represents stock market performance of those companies in the Russell 1000 Index with a below-average growth orientation based on price-to-book ratios and long-term earnings growth forecasts as measured by the Russell 1000 Value Index.\n\nMid Cap Stocks — Represents stock market performance of the 800 smallest companies in the Russell 1000 Index based on total market capitalization as measured by the Russell Midcap Index.\n\nInternational Stocks — Represents stock market performance in 21 developed countries around the world, excluding Canada and the United States, as measured by the MSCI EAFE (Europe, Australasia and Far East) Index.\n\nEmerging Markets — Represents stock market performance of companies in 26 emerging countries. Securities closed markets and those shares in otherwise free markets that are not purchasable by foreigners are excluded.\n\nCustom Asset Class Blend — Allocations are rebalanced to their respective target weightings at the beginning of each quarter.\n\n5% Cash and Money Markets  \n22% Taxable Bonds  \n5% High Yield Bonds  \n13% International Bonds  \n11% Large Cap Growth Stocks  \n12% Large Cap Value Stocks\n\n7% Mid Cap Stocks  \n20% International Stocks  \n5% Emerging Markets\n\n",
  "author": "georgek371",
  "time": "12 Jun 2014 — 11:41pm",
  "uid": "220807",
  "comments": [

  ]
}
