{
  "id": "117229",
  "title": "Simplified Arabic",
  "forum": "Arabic Typography & Type Design",
  "tags": [
    "arabic",
    "Arabic Typography & Type Design",
    "History of Arabic Type",
    "typeface"
  ],
  "content": "Titus Nemeth's article titled \"Simplified Arabic: a new form of Arabic type for hot metal composition\" was recently published in \"Typography papers 9.\"  \nThis is an excellent review of the development of Simplified Arabic since its inception in the 1950's. It will be of interest to anyone concerned with the history of Arabic typeface design. It would be even more useful if some of the figure were published large enough to show the details of the typefaces featured. Perhaps, Reading or Nemeth could publish these images in high resolution on the Internet for those of us who desire to learn more.  \nI have one minor comment on the content of the article: An example of the typeface named \"Simplified Arabic\" is shown, but it is not identified by its name as such. Rather it is identified as Arial/Times New Roman Arabic. This font is indeed included as the Arabic component of these multiple language fonts, but its original name should have been used.  \nTypography papers is a journal published by Hyphen Press, London, and edited, designed, and prepared by the Department of Typography & Graphic Communication, University of Reading.  \nI purchased my copy from Amazon here:  \n [http://smile.amazon.com/Typography-Papers-9-Paul-Luna/dp/0907259480/ref=...](http://web.archive.org/web/20150317172211/http:/smile.amazon.com/Typography-Papers-9-Paul-Luna/dp/0907259480/ref=sr_1_sc_1?s=books&ie=UTF8&qid=1402625337&sr=1-1-spell&keywords=typographic+papers+9 \"http://smile.amazon.com/Typography-Papers-9-Paul-Luna/dp/0907259480/ref=sr\\_1\\_sc\\_1?s=books&ie=UTF8&qid=1402625337&sr=1-1-spell&keywords=typographic+papers+9\")\n\n",
  "author": "Mamoun",
  "time": "12 Jun 2014 — 7:18pm",
  "uid": "48096",
  "comments": [
    {
      "time": "13 Jun 2014 — 6:37pm",
      "content": "Thanks for the compliment Mamoun!  \nJust as a note for people who haven't read it, this article comes from my PhD thesis that I finished in October 2013 at the [Department of Typography](http://web.archive.org/web/20150317172211/http:/www.reading.ac.uk/typography/), and I anticipate that more material may be published in the future.\n\nOf course the question of reproduction size is a difficult one, as every paper publication has it limits of dimension and bigger would almost always be better here. Yet, I think they did a great job fitting in in many illustrations at reasonable sizes. I will consider putting up more material in the future, but this would have to be cleared with the collection's owners.\n\nRegarding your comment of typeface name, I must say that this was deliberate. I wanted to emphasise the difference between the widely used digital design - variously known as Simplified Arabic, Arial, Times New Roman and others - and the original Simplified Arabic design, which are quite distinct. It also points to the rather unfavourable policy of Microsoft in the 1990s to throw in whatever Arabic glyphs at their disposal without any apparent concern for the aesthetics: using the exact same Arabic glyphs for two typefaces as distinct as Arial and Times New Roman speaks for itself.\n\nBTW, I'm sure Hyphen, a small independent publisher, would be glad for people to order copies [directly from them](http://web.archive.org/web/20150317172211/https:/hyphenpress.co.uk/products/books/978-0-907259-48-0).\n\n"
    },
    {
      "time": "17 Jun 2014 — 10:45pm",
      "content": "Wow - congratulations Dr. Titus! Looking forward to read it.\n\n"
    }
  ]
}
