{
  "id": "117327",
  "title": "Urbino Italic faces",
  "forum": "Stefan Seifert's blog",
  "tags": [
    "Italic typeface creation Urbino"
  ],
  "content": "Here a screenshot during the work on my Urbino italic typeface.\n\n ![](http://web.archive.org/web/20150318000248im_/http:/typophile.com/files/tera23_5769.png)\n\n[from _Frammenti della Bellezza_]\n\nHier die Arbeit an einem neuen ‘e’ für die ‘Reflection kursiv’. Mehr und mehr begann ich an einer Art Cancelleresca inspirierten kursiven Type für die „Reflection“ zu arbeiten. Die sanften längeren Rundungslinien des ‘u' und des ‘n’ und insbesondere des dazu passenden Minuskel-‘r’ mit seinem schweren aber dennoch eleganten Kopf. der als eine Art Kontrapunkt im Textverlauf wirkt, brachten mich dazu einige Letternbilder wie das des ‘e’ völlig neu zu überdenken; ja fast muss man sagen ich kam in Bereiche, in denen man von einer ganz neuen Kursiv-Type sprechen muss. Bei dem kleinen neuen ‘e’ habe ich mich zum Teil inspiriert oder leiten lassen von Vorbildern aus der „Garamont“ Italic der Imprimerie Nationale. Ich verließ damit etwas den Pfad der von Jenson und seinen Zeitgenossen (in etwa dazu passend der „Arrighi“ namentlich) bevorzugten Italic Typen\\*. Dort liegt der Kurvenschwerpunkt beim kleinen ‘e’ deutlich oben, fast in der oberen Horizontalen des Buchstabens. Er bildet ein Gegengewicht zu dem stark nach unten verlagerten Duktus der Hauptkurve. Um dies zu erreichen sind die kleinen ‘e’ zum Beispiel einer ‘Arrighi’ fast eckig im oberen Bereich. Das geschwungenere ‘e’ der Imprimerie aber zeichnet es aus, dass die Hauptkurve und deren Schwerpunkt mehr in der Senkrechten verläuft und der Schwerpunkt der Kopfkurve rechts mehr nach unten wandert, und dabei auch deutlich verlängert wird. Einige Mühe habe ich darauf verwendet auch bei der „Reflection“ Kursiv den Schwerpunkt des ‘e’-Kopfes, was den Bereich unten rechts angeht, später zu öffnen und möglichst lange die Kurve schwarz zu erhalten (also dick im Duktus) bevor ich sie kurz und ruckartig, kurz vor dem Anschluss, mit einem wiederum für die „Reflection“ typischen, ausgeprägten Knick verjüngen ließ. Wenn man so will eine Zwittertype – mit den für die ‘Arrighi’ typischen kontrastreichen und abrupten Formverläufen und den Schwerpunkt-Achsen (die ursprünglich aus der unterschiedlichen Winkelung der Federhaltung herrühren mussten) einer französischen Antiqua aus dem Hause Garamonds.\n\n\\*gleichwohl es sich beim kleinen Italic-‘e’ der frühen Renaissancetypen in jedem Fall eher um ein schräg gestelltes Antiqua (Tondo)-‘e’ handelt, als um eine „echte“ Kursive (wie man heute sagen würde). Dieses hat seine Ursprünge mehr als in einer technischen Bequemlichkeit jedoch in der Verwandschaft zu den [karolingischen etc.] Schreibtypen [?-\\> Recherche], bei denen es sich um gerade stehende (oder nur ganz leicht geneigte), jedoch kalligraphische Typen handelt, die auch deutlich gotsiche Züge haben (bedingt eben durch die kleinen, engen Formwendungen, die Knicke hervorrufen), und deren Ähnlichkeit zum Beispiel mit den Typen des Arrighi nicht zu verleugnen ist.  \n [Abbildung z.B. Jacobus de Voragine, „Legenda Aurea“, Abb. 18, S. 93, oder auch Abb. 33-34, „Les présentes heures …“, Die schwarze Kunst, Prestel Verlag]\n\nEs ist im übrigen interessant diesen fließenden Übergang zu beobachten, die insbesondere beim kleinen ‘e’ in der Geschichte der Druckschriften stattfand. Noch in den frühen französischen Typen Garamonds ist nicht ganz leicht zu definieren, ob das schräggestellte eigentlich „gerade“ Schreibschrift-‘e’ mit der typischen schrägen Gerade als Unterteil der Kopfschlinge – und der Ecke am Ende aus dem der obere Bogen gezogen wird, entweder sogar leicht im Anfang gegengewölbt oder sofort elliptisch (dem Spiegelbild der linken unteren Kurve des ‘e’ entsprechend [-\\>Abbildungen]) – bereits abgelöst wurde durch einen feinen komplett ausgerundeten Bogen (der sich schon etwas in der Aldinen abzuzeichnen scheint, wo diese Gerade etwas durchgebogen ist); in einige Lettern scheint es als wäre diese Entwicklung schon abgeschlossen, in anderen scheint noch eine leichte Ecke erkennbar. [Abb. 47, …] So ähnlich kommen sich die beiden ‘e’-Formen in ihrer Wirkung auf dem mit Farbe ins Papier eingedrückten Letternbild, dass man sich fragt, ob der runde Bogen des ‘e’s sich nicht im Laufe der Zeit als eine Art „Fehlinterpretation“ der Zeichner und Stempelschneider herausgebildet hätte. In den späteren Garamont(d)-Interpretationen verschwindet jede Eckigkeit und zum Beispiel Buchstaben wie ‘e’ und ‘a’ entfernen sich völlig voneinander, weisen kaum noch Ähnlichkeiten in ihren Form-Teilbereichen auf. Der Charme zum Beispiel einer Italic Garamond von Linotype basiert im wesentlichen auf den vielen unterschiedlichen Buchstabenformen, was ihre Breiten (man beachte das weit ausladene breit und flach geschwungene kleine ‘a’ im Vegleich zu dem sehr schmalen und aufgestellt wirkenden ‘e’!) und Neigungen angeht.\n\nEbenso bei Arrighi abgeschaut habe ich die Notwendigkeit ein deutlich gekrümmtes ‘t’ zu schaffen, welches das jetzige, etwas steife und manirierte (eine Eigenschaft an der die gesamte ‘Reflection kursiv’ in ihrer ursprünglichen Form litt) ‘t’ ablösen sollte. Eine typische Eigenschaft dieses kleinen ‘Arrighi’-Letters, der sicher nicht zu den schönsten gehört (diese kleine „Sichel“ mit dem etwas hölzernen Strichende oben, das mich an ein gleich zu splittern drohendes Ende eines Bambusstabes erinnert), der es sich aber deutlich von den Geraden der Buchstaben ‘n’, ‘u’ usw. abheben lässt.\n\nNun, Frederic Goudy hat einmal gesagt: „The old fellows stole our best ideas“ [genauer zitieren]. Er meinte damit, dass gleich wie wir auch die Formen unserer Buchstaben anlegen, sie sich doch immer auf ihre historischen Vorbilder beziehen sollten. Ihre Grundideen des Duktus, verschiedener Kurvenneigungen und Beschaffenheiten sind in den alten Modellen vorzufinden; dass es praktisch unmöglich ist, einen vertrauten Buchstaben zu schaffen (denn das müssen sie schließlich sein, sie sollen uns nicht irritieren sondern auf dem Weg zur Aufnahme eines geschriebenen Inhalts begleiten) und dabei eine ganz „neue“ Idee einzuführen. Trotzdem passiert es manchmal, dass in Details Formverläufe auftreten, die ich als „neu“ bezeichnen möchte und nach denen ich schließlich – ich gestehe es – auch ab und zu suche. Ein Beispiel ist die Fortführung des ‘Reflection Kursiv’-‘e’s. Es war mir immer noch zu steif, wenn ich es am ‘a’ der Tondovariante maß. Einige Tage inspirierte ich mich bei der Betrachtung von Centaur und Arrighi, allerdings nicht direkt beim Zeichnen (hier hielt ich neben meinem Arbeitsplatz eine elegante „Bulgari“-Anzeige, die eine Frauenhand in sanftem Toscana-Licht zeigte, mit der typsichen feuchten, gelblich getränkten Luft) sondern am Abend vorher. Auf dem Weg das ‘e’ zumindest versuchsweise doch in ein Renaissance-Kursiv-e umzuwandeln, mit dem typischen kleinen Duktusschwerpunkt ganz oben „auf“ der Kurve, änderte ich zunächst die nach oben sich schließende aufführende Kurve. Spontan ergab sich eine kleine Einbuchtung in ihrem oberen Teil links aussen, so dass die Kurve nicht gleich zur Haarlinie wurde, sondern eine Zeit lang noch in einer mittleren Dichte verblieb [Abbildung]. Das gefiel mir bereits sehr gut; ich ließ also von meinem Vorhaben ab, die klassischen ‘e’ Kurvenschwerpunkte anzulegen. Diese kleine nicht komplett vollzogene Verschmälerung der aufsteigenden Kurve, die dem Auge deutlicher das Abwechseln der Ellipsen im Zusammenhang mit der Innenform zeigt, gefiel mir als „Idee“. [Abbildung: ‘ea\\_Kopf\\_‘e’ neue Idee’]\n\n",
  "author": "Stefan Seifert",
  "time": "17 Jun 2014 — 11:32am",
  "uid": "19151",
  "comments": [

  ]
}
