{
  "id": "117358",
  "title": "Avenir, Antique Olive, Minion Pro and ITC Zapf Dingbats",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "InDesign fonts"
  ],
  "content": "Does anyone know how I can purchase the following fonts for Indesign PC?  \nAvenir  \nAntique Olive  \nMinion Pro  \nITC Zapf Dingbats\n\nThanks,\n\n",
  "author": "Crystal5824",
  "time": "18 Jun 2014 — 11:25am",
  "uid": "220926",
  "comments": [
    {
      "time": "18 Jun 2014 — 11:43am",
      "content": "[http://www.myfonts.com/](http://web.archive.org/web/20140702081901/http:/www.myfonts.com/ \"http://www.myfonts.com/\")\n\n"
    },
    {
      "time": "18 Jun 2014 — 9:08pm",
      "content": "Better to buy from Adobe. If there are any differences in the licenses, the Adobe license will be in your favor. At this late date, it won't help you with modification (for that, the purchase had to be before August 8, 2011), but might with font embedding in certain kinds of digital documents. Best to check.\n\nSee\n\n[http://www.adobe.com/products/type/font-licensing/additional-license-rig...](http://web.archive.org/web/20140702081901/http:/www.adobe.com/products/type/font-licensing/additional-license-rights.html \"http://www.adobe.com/products/type/font-licensing/additional-license-rights.html\")\n\nAt this point, the licenses may be the same. But if they're not, be assured the Monotype conglomeration will get you for every nickel thy can. Except it won't be nickels... And they also now own several distribution channels, including MyFonts. Adobe is rather more generous.\n\n"
    },
    {
      "time": "19 Jun 2014 — 1:58am",
      "content": "In my opinion Avenir Next is much better than Avenir. It has optically corrected italics, not just the slanted ones (a disease many sans serifs from the early years of PostScript fonts suffer from). Also the quality of the curves of Avenir Next comes much closer to the original digital Linotype version from the pre-PostScript era.\n\n"
    },
    {
      "time": "23 Jun 2014 — 2:51am",
      "content": "Pity you are on PC, I believe all those fonts come bundled with a Mac and Adobe apps.\n\n"
    },
    {
      "time": "23 Jun 2014 — 1:58pm",
      "content": "Sye: twice, no.\n\nFirst, it doesn't matter whether you are on Windows or on Mac -- the set of free (and, might I add, _very good_) fonts is the same.\n\nBut, second, only Minion Pro is in that list. Zapf Dingbats comes, IIRC, with Acrobat Pro (but if you have a recent Arial Unicode MS, you don't need it), and Avenir and Antique Olive need to be purchased separately.\n\n"
    },
    {
      "time": "23 Jun 2014 — 3:56pm",
      "content": "Thank you, Theunis.\n\nhhp\n\n"
    },
    {
      "time": "23 Jun 2014 — 7:09pm",
      "content": "You can get the entire Avenir (plus Next) on a PC? how? It comes with OSX on a mac.\n\nI am wrong about Antique Olive, I thought it came with either Adobe or Apple, but seems it does not.\n\n"
    },
    {
      "time": "24 Jun 2014 — 1:31pm",
      "content": "EZ-PC. [http://www.myfonts.com/fonts/linotype/avenir/](http://web.archive.org/web/20140702081901/http:/www.myfonts.com/fonts/linotype/avenir/)\n\n"
    },
    {
      "time": "24 Jun 2014 — 2:07pm",
      "content": "Sye was right about Avenir: bundled with Mac OS X—Avenir Next as well!\n\nAlso, he was right to use the word “bundled” which is not the same as “free.” None of those are “free fonts”!\n\n"
    },
    {
      "time": "24 Jun 2014 — 5:41pm",
      "content": "Thanks Thomas!\n\nIn regard to the original question, and the response from Charles Ellertson, if you buy from MyFonts, my understanding is that you are bound by each foundries own EULA, not an overriding MyFonts EULA, so you could buy the Adobe versions of the fonts if you felt the EULA was better.\n\nYou could also equally buy them from FontShop or Fonts.com direct (not sure if Minion Pro is sold there).\n\nOne question about Minion Pro, if you have InDesign, it is one of the bundled fonts, so you should already have it. Or do you need the license for a client's use?\n\nWhat version of InDesign are you using?\n\n"
    }
  ]
}
