{
  "id": "117473",
  "title": "The Corliss Group Voyage Summer Travel Tips",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "Summer Travel Tips",
    "The Corliss Group Voyage"
  ],
  "content": "1. Start out with a checklist. Even a person with a great memory has multiple things to remember when planning for a trip.\n\n2. Identify your suitcase. Purchase travel size toiletries and pack a bag with items designated for travel use only.\n\n3. Create separate travel bags. Purchase travel size toiletries and pack a bag with items designated for travel use only.\n\n4. Designate a travel packing area a week prior to your flight. Choose a location in your home where you can collect travel items that you plan to take on the upcoming trip.\n\n5. Purchase magazines at the airport. While it's easy to grab a few magazines in the checkout line at the grocery store, chances are you will end up reading them before your trip.\n\n6. Bring an extra set of reading glasses, cell charger, and ear buds. Regardless of how careful I am, I always lose at least one of these per trip.\n\n7. Don't get caught without important phone numbers. I was recently delayed at an airport due to a fire in the control tower.\n\n8. The name on the reservation and identification should match exactly. Your name may be Charles but you go by your middle name, David, and it can be both confusing and detrimental should you be questioned or challenged to get out of line to reconcile the discrepancy in names.\n\n9. For special requests, alert the airline in advance. If you need a wheelchair, have a child with a severe allergy or require a certain seat, it's best to let the airline know when you make the reservation in order for proper arrangements to be made.\n\n10. Fly nonstop whenever possible. A direct flight can land at other airports along the way, allowing some passengers to exit while others board the flight en route to a final destination.\n\n",
  "author": "thaddbrewington",
  "time": "23 Jun 2014 — 11:27pm",
  "uid": "221029",
  "comments": [

  ]
}
