{
  "id": "117404",
  "title": "History of the bullet point",
  "forum": "General Discussions",
  "tags": [
    "bullet point",
    "General Discussions",
    "history of typography"
  ],
  "content": "Hello,  \nI'm curious about the history of the bullet point -- ie. when it came into popular usage and how its name originated. Does anything have any information on this?\n\nThanks!  \nAnya\n\n",
  "author": "aventura",
  "time": "20 Jun 2014 — 11:26am",
  "uid": "220977",
  "comments": [
    {
      "time": "20 Jun 2014 — 7:48pm",
      "content": "\"Pause and Effect\" by Parkes might have something. I once made copies from that book but they're too deep in the gara... archives at the moment.\n\nhhp\n\n"
    },
    {
      "time": "21 Jun 2014 — 5:26am",
      "content": "Thanks for the tip, Hrant. I didn't know about _Pause and Effect_. Too bad it's 7 months 'til my birthday.\n\n"
    },
    {
      "time": "21 Jun 2014 — 5:26am",
      "content": "(Sorry, duplicate)\n\n"
    },
    {
      "time": "21 Jun 2014 — 8:48am",
      "content": "\\> Too bad it's 7 months 'til my birthday.\n\nYour local library might have it, or they could get it by interlibrary loan, which is usually free. Or they might have other sources that give the answer. Talk to someone in the library's reference department, they are experts at finding info.\n\nI'd assume the name comes from the resemblance to a real bullet from certain angles. That's also what Wikipedia says, although I'd try to verify that from a more reliable source.\n\n"
    },
    {
      "time": "21 Jun 2014 — 8:57am",
      "content": "When Googling the subject, someone said that the Oxford English Dictionary (OED) discusses its history. You can't access it online without a subscription, but your library probably has a copy.\n\n"
    },
    {
      "time": "21 Jun 2014 — 12:53pm",
      "content": "A Google search did not turn up much about the history of the bullet point itself, but it did turn up facts about the history of its predecessors. Apparently the dingbat that was a picture of a pointing hand was the first typographical symbol used for this purpose, starting in the 12th century and continuing all the way into the 18th century.\n\n"
    },
    {
      "time": "9 Jul 2014 — 4:14pm",
      "content": "Thanks, all!\n\n"
    },
    {
      "time": "9 Jul 2014 — 5:49pm",
      "content": "I don't have this book, but it might interest you as well: [http://www.shadycharacters.co.uk/shady-characters-the-book/](http://web.archive.org/web/20150311183505/http:/www.shadycharacters.co.uk/shady-characters-the-book/ \"http://www.shadycharacters.co.uk/shady-characters-the-book/\")\n\n"
    },
    {
      "time": "10 Jul 2014 — 12:12am",
      "content": "Not just \"from certain angles.\" Actual bullets were generally spherical up until the American Civil War. The word itself means \"little ball\".\n\n"
    }
  ]
}
