{
  "id": "117458",
  "title": "Wearable Font - Would Love Feedback on My Latest Project!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Howdy, fellow typophiles! I love writing, specifically the act of writing. I am obsessed with handwriting, especially knowing that we've preserved the actual handwriting of some of the greats of history.\n\nI have started making jewelry from these historical icon's handwriting, and have found many of the people requesting their own are fellow typophiles and history buffs. I'd love to know what you guys think - what font/word would you wear?\n\nHere's a pic of a Jane Austen pendant I made: [http://imgur.com/a/mSRHR#0](http://web.archive.org/web/20140702070900/http:/imgur.com/a/mSRHR#0 \"http://imgur.com/a/mSRHR#0\")\n\nHappy to post my website here, too, upon request, but I don't want to be spammy.\n\nThanks, guys!\n\n",
  "author": "shelsta",
  "time": "23 Jun 2014 — 10:11am",
  "uid": "221020",
  "comments": [
    {
      "time": "23 Jun 2014 — 3:58pm",
      "content": "How is this related to type?\n\nhhp\n\n"
    },
    {
      "time": "23 Jun 2014 — 7:17pm",
      "content": "Cool,\n\n\"... what font/word would you wear? \"\n\nI'm kind of cheap, so I'd use helvetica thin;)\n\nBTW, are you making the molds from digital files, by hand or some combination?\n\n"
    },
    {
      "time": "23 Jun 2014 — 9:28pm",
      "content": "Interesting idea, but I doubt that many folks would recognize an author's handwriting. Maybe autographs made into jewelry would be more commercially viable.\n\n\\> what font/word would you wear?\n\nI think it's mostly guys here, and the market for this is probably women.\n\n"
    },
    {
      "time": "24 Jun 2014 — 9:03am",
      "content": "@James - Tolkien and Austen have been huge, actually. People really connect with those two authors. Tons of guys (not enough!) recognize their wife's/girlfriend's favorite author, buy as a gift for birthdays or anniversaries.\n\n@Icharo - Ha, Helvetica thin is a great pick. I'd create a 3d-printable file on my computer of whatever you'd pick, print it, and then assemble it. It's fun! Does that answer your question?\n\n"
    },
    {
      "time": "24 Jun 2014 — 9:50am",
      "content": "If you encounter any folks with Nashville sensibility, you could have a slab serif or even Egyptian for 'em. (Just don't use the free font called \"Nashville.\" Anything but that.)\n\nAlso, Walden fonts has a lot of historic signature fonts if you're looking for that. [http://www.waldenfont.com/product.asp?productid=1](http://web.archive.org/web/20140702070900/http:/www.waldenfont.com/product.asp?productid=1 \"http://www.waldenfont.com/product.asp?productid=1\")\n\n"
    },
    {
      "time": "24 Jun 2014 — 1:37pm",
      "content": "\"I'd create a 3d-printable file on my computer of whatever you'd pick, print it, and then assemble it. \"\n\nYou do what?!;) that... sounds wildly fun!\n\n"
    }
  ]
}
