{
  "id": "117461",
  "title": "\"Speedy\" italics on a transitional or modern",
  "forum": "General Discussions",
  "tags": [
    "Baskerville",
    "bodoni",
    "didone",
    "Didot",
    "General Discussions",
    "Italic",
    "Modern",
    "transitional",
    "Vanity Fair",
    "vogue"
  ],
  "content": "Hi everyone,\n\nI'm working on a project which needs italics with a little more oomph to them, and I'm looking for something in the transitional or modern forms. My point of departure in this search is the new Didot Christian Schwartz and Paul Barnes completed for Vanity Fair. [According to their own blog on the commission](http://web.archive.org/web/20150420064859/https:/commercialtype.com/news/updates/vf_didot_for_vanity_fair), the drawings they built their didone from revive a specific letterer's cuts: Molé Le Jeune.\n\nI'm not necessarily convinced that Didot, specifically, is what I'm looking for (and the Vanity Fair revival is also really peculiar and modernized, in ways I'm not so interested in). But the excessive sloping—the \"speed\" of these italics—is very much what I need. And I like this \"voice\" of rational, modern forms (and of the 'more' rational forms from the transitionals like Baskervilles and Bookmans—the Zapf International would probably fit this bill, but I'm not wild on its digitization, and the itals are still not anywhere as far forward as the VF Didot).\n\nAre there any suggestions out there about commercial releases you know of that fit this basic Modern/Transitional categorization, which seem perhaps more \"eager\" in their forward lean, than a typical italic in the genres? I looked at a few things, from Hoefler&Co's Surveyor to James Montalbano's Consul (both of which I love, but I'm not sure are quite leaning forward as much as I wish they would), but I'm not convinced yet that I've found anything really compelling. I am sure, however, that my knowledge of foundries is limiting me greatly and hoping a crowdsourcing here might prove useful to me and others looking for such.\n\nHelp much appreciated & many thanks in advance.\n\n",
  "author": "Erik Spooner",
  "time": "23 Jun 2014 — 10:24am",
  "uid": "221019",
  "comments": [
    {
      "time": "23 Jun 2014 — 4:27pm",
      "content": "My [Scotch Modern Italic](http://web.archive.org/web/20150420064859/http:/www.myfonts.com/fonts/shinn/scotch-modern/italic/) is quite keen, at 20°. It is, however, an historic modern, and there is no display version.\n\n"
    }
  ]
}
