{
  "id": "117440",
  "title": "Serif / Book / Garamond family [???]",
  "forum": "Home",
  "tags": [
    "Serif"
  ],
  "content": "Dear Typophile community  \nA little introduction . I own avery small publishing house, and we have our [digital] printing machines, until now i was able to solve by myself all my little typo problem but this one is out of my league.  \nLong story short, recently an important customer comes with a problem, he's in charge of the publishing department of an important but very small university, unfortunately the printer with whom they have worked for many years for the university publication is gone out of the business - a very common story today. Now he asked me if i could take the job - of course - but he wants to keep the fonts used until now in the publications; so is very important for me to find the exactly font used in the publication.  \nI managed to get some .pdf made by the original printer for the university, but notingh more. here is the link for the file, maybe is more helpful than the image : [https://www.dropbox.com/s/juzx57r7al6q6cq/fontxtypophilie.pdf](http://web.archive.org/web/20140724102021/https:/www.dropbox.com/s/juzx57r7al6q6cq/fontxtypophilie.pdf \"https://www.dropbox.com/s/juzx57r7al6q6cq/fontxtypophilie.pdf\")  \nI have checked the font inside the file but they don't have a standard name. Could be a font from the Garamond family ??? but which one ? A simoncini Garamond [naaa] an Italian Garamond or an American ???  \nAny help is appreciated, thank you very much.\n\nSolved By:&nbsp;\n\n [jvdesign](http://web.archive.org/web/20140724102021/http:/typophile.com/user/94118 \"View user profile.\")\n\n| Attachment | Size |\n| --- | --- |\n| [fontxtypophilie2.jpg](http://web.archive.org/web/20140724102021/http:/typophile.com/files/fontxtypophilie2.jpg) | 1.69 MB |\n\n",
  "author": "lupusinfabula",
  "time": "22 Jun 2014 — 8:27pm",
  "uid": "220482",
  "comments": [
    {
      "time": "22 Jun 2014 — 8:37pm",
      "content": "I think your sample is Simoncini Garamond book and book italic.\n\n"
    },
    {
      "time": "25 Jun 2014 — 6:50am",
      "content": "Is kinda different from the Simoncini i use, but watching the Elsner and Flake version i think you could be right.\n\n"
    }
  ]
}
