{
  "id": "117503",
  "title": "The Woo Group RBC Wealth Management Hong Kong USA, There’s Wealth in Our Approach",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "The Woo Group RBC Wealth Management Hong Kong USA",
    "There’s Wealth in Our Approach"
  ],
  "content": "Financial Commentary: U.S. Housing Market—Seeking New Demand\n\nSpeculators have jolted the housing market back to life; now it’s time for traditional buyers to get back in. Read the full financial markets commentary, as well as asset-class views and key forecasts, in the latest edition of Global Insight.\n\nYou may also be interested in:  \n• Daily Market View  \n• Technical Update  \n• Global Insight Weekly\n\nWelcome to our Team Website\n\nThe Woo Group is a team of trained and proven investment professionals who are dedicated to providing customized wealth management solutions to our clients. Our team works with high net worth individuals, families, foundations, small businesses and corporations to help them achieve their financial goals.\n\nOur wealth management process begins with understanding each client’s unique needs and developing an appropriate risk profile. The profile is used to create a basic asset allocation and to select an appropriate investment strategy. Once a client has embraced a sound asset management strategy, the focus moves to creating a comprehensive wealth management plan including retirement planning, tax analysis, insurance needs and estate planning.\n\nWhile prudent asset management is vital and planning plays an important role in wealth management, these activities have to be integrated to align financial resources with life’s goals. The Woo Group has relationships with leading estate planning attorneys, insurance brokers and accountants for coordination and seamless delivery of world-class expertise as part of its wealth management process.\n\n ![](http://web.archive.org/web/20140625103456im_/http:/typophile.com/files/The%20Woo%20Group%20RBC%20Wealth%20Management%20Hong%20Kong%20USA,%20There%E2%80%99s%20Wealth%20in%20Our%20Approach_3835.JPG)\n\n",
  "author": "charmgray46",
  "time": "24 Jun 2014 — 7:56pm",
  "uid": "220876",
  "comments": [
    {
      "time": "25 Jun 2014 — 3:26am",
      "content": "Global fixed income markets are pricing in yet another round of unconventional monetary policy from a major central bank. Expectations are high the European Central Bank (ECB) will pursue extraordinary monetary policy intervention when it meets on June 5. The ECB possesses a broad range of options, and global fixed income markets have already re-priced in anticipation of a major policy initiative.\n\nAt the security-selection level, the implications differ for each geographic market. Yet this is the latest reminder that unconventional policies in any one jurisdiction can affect [global markets](http://web.archive.org/web/20140625103456/https:/www.rbcwmfa.com/thewoogroup/), given how intertwined the global financial system and economy have become.\n\nIn Europe, we believe fresh monetary stimulus will fuel a rally in peripheral government bonds and a modest sell-off (higher yields) in core-Europe. We continue to see select opportunities throughout the corporate market, and note issuers from the financial sector would likely benefit the most from stimulative monetary policy. In the U.K., the looming risk of changes to the Bank of England’s bias could create volatility and higher yield levels across the U.K. Gilt yield curve.\n\nHigher relative yields in the U.S. versus Europe led to a recent rally in Treasury securities. We caution that complacency appears to be rising at a time investors should be more vigilant with regards to interest-rate risk. The real yield of a 10-year U.S. Treasury has fallen nearly 50 basis points (bps) this year and sits nearly 200 bps below the historical average. We prefer intermediate maturity bonds with fixedto-floating rate preferreds as attractive ways to enhance portfolio yield within the corporate sector.\n\nCanada has not been immune from the rally on government bonds and tighter credit spreads. We believe investors should reduce the term of their bond ladders in acknowledgement of a worsening risk/reward trade-off. Within the preferred share space, investors should sell some preferred shares, in our view, given recent strength attributed to a supply-demand imbalance in the market that will likely prove temporary.\n\n&nbsp;\n\nRead more here: [https://www.rbcwmfa.com/File/market\\_commentary/globalinsight.pdf](http://web.archive.org/web/20140625103456/https:/www.rbcwmfa.com/File/market_commentary/globalinsight.pdf)\n\n"
    }
  ]
}
