{
  "id": "117578",
  "title": "my font doesnt type numbers - help please",
  "forum": "Build",
  "tags": [
    "fontlab",
    "numbers",
    "problems",
    "Build"
  ],
  "content": "Hello,,\n\nI have a problem with my font which has been stopped typing numbers! when you for examples write 1 it's type something else which other glyph I used that has not unicode ,, and the same problem form other numbers..\n\nI have delete some unnecessarily glyphs before, so is it the problem? maybe the index has been changed? or it is a problem in the programming? anyone knows please?\n\nthanks\n\n",
  "author": "ott",
  "time": "27 Jun 2014 — 3:31pm",
  "uid": "186362",
  "comments": [
    {
      "time": "28 Jun 2014 — 6:14pm",
      "content": "Not enough information here to help you, I think.\n\nIs this a \"new\" font that you built from scratch? Or an existing font that you opened and altered in FontLab?  \nAnd more importantly, are there any OpenType features in the font?\n\n"
    },
    {
      "time": "29 Jun 2014 — 12:25pm",
      "content": "It would be helpful to know: (1) what you used to delete the \"unnecessary\" glyphs, and how you did it; (2) what app(s) you have seen the incorrect behavior in.\n\nThen, one would want to simply look at the misbehaving font, which would be much quicker than trying to guess at the problem.\n\n"
    },
    {
      "time": "29 Jun 2014 — 4:58pm",
      "content": "It's my standard and own characters map I have always used in my designs, this time just notice that there are some unnecessary glyphs, so I have delete them via \"delete\" button\n\nI also, have my own and standard programing file (Volt), just adjust it depending on the font need\n\nthe font has just classes for the characters and other programing features are in volt\n\nI test it in MS Word and Adobe Illustrator\n\nhope this helpful for you\n\n"
    },
    {
      "time": "29 Jun 2014 — 7:44pm",
      "content": "Well, if you were willing to share the actual font, I am sure any number of folks, including me, could easily take a quick look.\n\n"
    },
    {
      "time": "8 Jul 2014 — 1:22pm",
      "content": "I solved it, Just correct the Unicodes of unknown glyphs. Thanks all\n\n"
    }
  ]
}
