{
  "id": "117682",
  "title": "Book Paper",
  "forum": "Design",
  "tags": [
    "book printing",
    "digital printing",
    "paper",
    "Design"
  ],
  "content": "I'm designing a 600-pg book which will have some color photo galleries but is primarily text. It will be printed on an Indigo. Any suggestions for a good text paper?\n\n",
  "author": "bgraphic",
  "time": "2 Jul 2014 — 7:50am",
  "uid": "171049",
  "comments": [
    {
      "time": "2 Jul 2014 — 10:06am",
      "content": "I don't do much print work anymore (mostly for the web these days), but one suggestion is to talk to your printer. Most printers have house stocks that they can offer good prices on since they buy in bulk, plus they are very familiar with its characteristics. And a good printer should also be able to recommend some higher-end stocks if that's what you're looking for. Obviously photos will look best when printed on coated stock.\n\n"
    },
    {
      "time": "2 Jul 2014 — 10:06am",
      "content": "Are you using a commercial printer to print and bind this book? If so, it's a good idea to ask them for a recommendation. They will have experience with what runs well on their press and makes your color images look good.  \nIn seeking your printer's advice, try to balance opacity with bulk. You want paper that's thick enough to prevent your color images from showing through to the backing page, but thin enough that your 600-page book isn't a cinder block.  \nAlso ask about the suitability of the stock for the binding process. Some heavily coated papers don't lend themselves to perfect binding, because the adhesive sticks to the coating and not the fibers underneath, making the book prone to crack at the spine.  \nSabine Lenz at [PaperSpecs.com](http://web.archive.org/web/20150417084220/http:/www.paperspecs.com/) may be able to offer additional advice.\n\n"
    },
    {
      "time": "2 Jul 2014 — 12:59pm",
      "content": "Paper variaties for printing on an Indigo are limited, unless you are willing to have some prepared (coated). Just ask the shop what is available and choose from that, because custom papers can be problematic and will probably not be warranted by the printer.\n\n"
    },
    {
      "time": "3 Jul 2014 — 12:21pm",
      "content": "What typeface(s) are you using?\n\nhhp\n\n"
    },
    {
      "time": "8 Jul 2014 — 1:03pm",
      "content": "The best paper for the Indigo is chemically treated, so that the inks sticks to it better. Ask your printer samples of what \"HP Certified Substrates\" they have in house. Any certified paper will be great for print, so it will be up to your subjective opinion of what you like - gloss coated, uncoated, matte, synthetic, recycled, etc. Non certified offset printing paper can be used and can be less expensive, but I'd stay away. It is well worth it to avoid the offset paper dust and ink powder.\n\n"
    }
  ]
}
