{
  "id": "117671",
  "title": "Critique my logo please!",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "comments",
    "critique",
    "logo",
    "Logos / Corporate ID Design"
  ],
  "content": "Hi!\n\nI've designed a couple logos for an accelerator called \"WE\". For some reason I've been struggling with how short the term \"WE\" is.\n\n[The first logo](http://web.archive.org/web/20150419151949/http:/imgur.com/oP23REa) is based on an isometric grid. I don't know how legible it may be.  \n [The second one](http://web.archive.org/web/20150419151949/http:/imgur.com/rTZdvzQ) is much simpler.\n\nWhat do you think? Which one should I go with? What should I change?\n\nThanks in advance.\n\n",
  "author": "arireznik",
  "time": "1 Jul 2014 — 9:49pm",
  "uid": "221217",
  "comments": [
    {
      "time": "2 Jul 2014 — 8:35pm",
      "content": "Ari, I think both are rather smart solutions for a two-letter name.\n\nOne thing giving me pause is the double, overlapping Vs that make up the W in the second version--I find that overlap distracting, Also, the W doesn't intersect with/get cut off by the bounding circle as much as the e, which also throws things out of balance a bit.\n\nRefine the second version, and you've got two solid choices.\n\n"
    },
    {
      "time": "3 Jul 2014 — 10:05am",
      "content": "I like them both. The first one (even in black-and-white) won't reproduce well in photocopies, if that's a factor.\n\n"
    },
    {
      "time": "3 Jul 2014 — 11:50am",
      "content": "The \"W\" as crossing \"V\"s is very smart! But it's making the \"e\" seem like a third wheel; try to incorporate it inside the \"W\" somehow - maybe as a capital letter.\n\nhhp\n\n"
    },
    {
      "time": "3 Jul 2014 — 3:54pm",
      "content": "It's actually [Scala Sans'](http://web.archive.org/web/20150419151949/http:/www.myfonts.com/fonts/fontfont/ff-scala-sans/) default \"W\" :)\n\n"
    },
    {
      "time": "4 Jul 2014 — 8:12pm",
      "content": "WE prefer the first one it gives a 'high-tech' impression if that is what you want. I like it because at one time I used letters-in-a-cube for my own logo (now disused) - even made a wood sculpture of a 3-letter-cube once. A selling point is that the company can make small cubes for key-chains etc. as giveaways!\n\nThe first one's colors are beautiful but too subtle and as mentioned above will not appear properly in a photocopy. Experiment with black and white or grayscale versions and see how it appears at different magnifications and settings.  \nThe second is nice but reminds too of the Volks-Wagen logo. Good luck deciding.\n\n"
    },
    {
      "time": "4 Jul 2014 — 8:28pm",
      "content": "Ah: [http://mymo.is/](http://web.archive.org/web/20150419151949/http:/mymo.is/ \"http://mymo.is/\")\n\nhhp\n\n"
    },
    {
      "time": "5 Jul 2014 — 4:15am",
      "content": "Nice! But the third face is random.  \nHere is my EQR \"a wooden sculpture made by Vladimir Tamari to symbolise the unification of Electromagnetism, Quantum Mechanics and Relativity in his United Dipole Field theory.\"  \n [http://youtu.be/73WkoUA21uU](http://web.archive.org/web/20150419151949/http:/youtu.be/73WkoUA21uU \"http://youtu.be/73WkoUA21uU\")\n\n"
    }
  ]
}
