{
  "id": "117705",
  "title": "Decorative baroque fonts",
  "forum": "Home",
  "tags": [
    "Unknown"
  ],
  "content": "I'm not sure if it's a font or maybe it's a vectors decoration...  \nBut i would like to know if someone can help me and if it's a font, what font it is?  \nI need to enbed this logo in my site becouse it' a sponsor, but no one can give me a high resolution logo and for what i see there is a big \"C\" and the restant i know it's Edwardian font..  \nThe problem is the big \"C\" !!  \nI hope someone can help i've tried searching on the web even tried those kind of font idefier tools around but i have no luck..\n\n ![](http://web.archive.org/web/20140822095403im_/http:/typophile.com/files/logo_new_top_6290.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [Clori.png](http://web.archive.org/web/20140822095403/http:/typophile.com/files/Clori.png) | 11.06 KB |\n\n",
  "author": "imagosonus",
  "time": "3 Jul 2014 — 7:13am",
  "uid": "221247",
  "comments": [
    {
      "time": "3 Jul 2014 — 7:53am",
      "content": "I suspect it is a scan or vector of a decorative initial from an Italian manuscript from the 17th or 18th century, paired with an engraved script for \"lori.\"\n\n"
    },
    {
      "time": "3 Jul 2014 — 4:21pm",
      "content": "Thank's a lot for your help i will try to do a search about Italian manuscript from the 17th or 18th century...\n\n"
    },
    {
      "time": "3 Jul 2014 — 4:38pm",
      "content": "Yes kthomps5 you're right i find some images ![](http://web.archive.org/web/20140822095403im_/http:/www.cantataitaliana.it/img/rm_ta_0049.jpg)  \neven if is not the C i think is the E.  \nThank you so much\n\n"
    },
    {
      "time": "3 Jul 2014 — 4:59pm",
      "content": "I have several books that contain decorative alphabets and initial caps from medieval times to the present, but didn't see anything like your sample.\n\nGlad you found a music-specific source that will move you in the right direction. Happy hunting.\n\n"
    }
  ]
}
