{
  "id": "117768",
  "title": "Another Assessment Piece",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Task: Design a wine label produced as digital artwork. Consider taking risks: try for an unusual alternative with an edgy design. Remember though, that innovation and originality often have to be tempered with a respect for longevity and tradition.\n\n ![](http://web.archive.org/web/20150317183931im_/http:/typophile.com/files/idea-2-on-bottle_4274.jpg)\n\n",
  "author": "S_Burns",
  "time": "6 Jul 2014 — 9:19pm",
  "uid": "221187",
  "comments": [
    {
      "time": "7 Jul 2014 — 9:01am",
      "content": "Stephanie, on that other project you posted recently (Geelong Umpires) you thanked the commenters but never showed us what you did with the logo. Might be nice to see how that logo is coming along before asking help with another school project. Thanks.\n\n"
    },
    {
      "time": "7 Jul 2014 — 8:49pm",
      "content": "Ooo sorry James I didn't realise. I've chopped and changed so many times with it...I'll post where I'm at with it now.\n\n"
    },
    {
      "time": "7 Jul 2014 — 10:14pm",
      "content": "No problem. Not that you necessarily need to follow our advice, but it's nice to see how a logo progresses.\n\nI'm not much of a drinker so I'm probably not the best person to offer advice on the wine labels. The one on the left is more interesting, but I can't say that either one would make me stop and look.\n\nI've toured distilleries and I know the barrels are a big deal, so with a name like \"Big Barrel Winery\" my first impulse might be to do something with woodgrain or a simulated barrel (although maybe that's too obvious).\n\n"
    },
    {
      "time": "8 Jul 2014 — 8:52pm",
      "content": "Yeah I understand what you're saying but it seems as though a lot of the other students do that...\"Big Barrel Winery\", so they incorporate a \"Barrel\" in the design somehow. I try not to do the most obvious idea but then again it can sometimes be the best idea hey? It may help if I explain why I designed it this way...? Understand if it's too much reading...personally I hate reading ;-)\n\nFirstly djama Moscato will be produced in Maleny, Sunshine Coast Hinterland, QLD at the Big Barrel Winery. The traditional owners of this land is the aboriginal Kabi Kabi mob which is why the brand name of the wine has been given ‘djama’ which means ‘drink’. It is also why the label has adopted the colours of the aboriginal flag (black, red and yellow) and the graphic is made up of aboriginal symbols (sun, rain, mountain and running water).\n\nWhilst googling images of wine bottle labels I found that I was most drawn to labels that allowed the viewer to see the colour of the bottle/wine via a cut out or a split – it’s captivating. I believe that if two bottles of the exact same wine were side by side the viewer would choose the one with the most creative or eye-catching label. I also realised that the important/must have information is found on the back of the bottle leaving the front/main label clutter free/minimalistic.\n\nAs wine has been around for thousands of years I chose to have ‘Big Barrel Winery’ and ‘Moscato 2010’ in a serif font (Book Antique) as it too has been around for a similar timeframe. You will notice that the winery, the wine type and the information on the back is in capitals, this is showing the consumer that this information is locked in and won’t change. The brand name, however, is in lower case and a display type as it can change from wine to wine. Blackadder ITC was used for the word ‘djama’ to differentiate it from the rest of the type.\n\nThe three elements that draw the consumer in most is the colour combination, the use of aboriginal symbols and the Glasshouse Mountains silhouette cut-out which reveals the wine/bottle colour. It is most intriguing.\n\n"
    },
    {
      "time": "8 Jul 2014 — 10:08pm",
      "content": "You're probably right about the barrel idea, it's a bit obvious.\n\nSounds like there are factors involved in your design that someone like me who lives in the U.S. would be unaware of (aboriginal symbols, Glasshouse mountain silhouette, etc). Folks in different parts of the world sometimes view designs very differently due to cultural and other differences. Good luck with your project.\n\n"
    },
    {
      "time": "13 Jul 2014 — 2:13am",
      "content": "The 2 second impression is that if I were in the store, I would not even pause to look at this wine. If I were to rationalize, it'd be due to the use of red on the label, or rather its particular shade, which is desaturated and pink-ish. It just doesn't associate with a glass of wine \\*at all\\*. It does however associate well with \"Sale\" stickers that they frequently use to label discounted products.\n\n"
    }
  ]
}
