{
  "id": "117851",
  "title": "subject: contract template for commission?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "dear all,\n\nare there any templates for contracts for type design commissions?\n\na new client has commisioned me to create a custom type family for them, and asked me to submit a contract for their review, since the matter is rather specialized and they have no similar documents they could use.\n\nso, i’ve been wondering: are there any standard type design contract forms available covering commissioned work, that can be downloaded and customized?  \ni’m happy to pay a reasonable fee if required.\n\nif available, i’m specifically looking for inclusion of wording or clauses regulating:  \n– client company has complete usage rights in print and digital media as long as company exists in its present form, but no rights to resell, while:  \n– designer retains all rights to resell typeface to other companies or via retail.\n\nthanks much in advance for any information!  \njoachim\n\n",
  "author": "joachim",
  "time": "9 Jul 2014 — 3:56pm",
  "uid": "2233",
  "comments": [
    {
      "time": "9 Jul 2014 — 4:18pm",
      "content": "The Graphic Artists Guild ( [https://www.graphicartistsguild.org/](http://web.archive.org/web/20150414225738/https:/www.graphicartistsguild.org/ \"https://www.graphicartistsguild.org/\")) publishes The Graphic Artists Guild Handbook: Pricing & Ethical Guidelines, which includes a standard contract for Lettering and Typeface Design. You can order it through their website, or find it in any well-stocked bookstore.\n\nAlso, the website has a checklist for writing your own contract, under the resources link.\n\n"
    },
    {
      "time": "9 Jul 2014 — 4:23pm",
      "content": "You might want to ask Frank Martinez.\n\nhhp\n\n"
    },
    {
      "time": "14 Jul 2014 — 1:14am",
      "content": "hmm thank you... i know the handbook and bought the new one. it has a chapter on type design, and a chapter with contracts. there is no contract for type design in there though... :(\n\nHrant: i don't know Frank Martinez, is he a lawyer?\n\nthx much!  \njoachim\n\n"
    },
    {
      "time": "14 Jul 2014 — 7:03am",
      "content": "Yes, by far the most famous lawyer in the type field, and for good reason.\n\nhhp\n\n"
    },
    {
      "time": "15 Jul 2014 — 7:45pm",
      "content": "is this the right person/company?  \n [http://www.martinezgroup.com/aboutusstaff.html](http://web.archive.org/web/20150414225738/http:/www.martinezgroup.com/aboutusstaff.html \"http://www.martinezgroup.com/aboutusstaff.html\")\n\nthx! - j.\n\n"
    },
    {
      "time": "15 Jul 2014 — 8:00pm",
      "content": "Yup.  \nSee also: [http://typophile.com/node/88477](http://web.archive.org/web/20150414225738/http:/typophile.com/node/88477 \"http://typophile.com/node/88477\")\n\nhhp\n\n"
    },
    {
      "time": "16 Jul 2014 — 8:35am",
      "content": "Joachim, I haven't purchased an updated Pricing Guide in a while--my apologies.\n\n"
    }
  ]
}
