{
  "id": "117800",
  "title": "Baran (clean serif typeface)",
  "forum": "Serif",
  "tags": [
    "clean",
    "serif",
    "Serif",
    "transitional"
  ],
  "content": "I just wanted to show you a new typeface I started as a little break on a different typeface I'm doing for a client.\n\nIt started with an idea on a certain flow of lines within the /a but quickly thereafter I removed the terminal and created this sort of naked serif typeface.\n\nI like the a, b, d and r in particular (which is not to say no more adjustments will be made though) but I'm rather uncertain about the /c and and /e as they're perhaps too classical. I suppose with this typeface I essentially want to bring a few classical/chirographic aspects and think it through to a logical, modern conclusion. I feel the /o could be wider but I will have a closer look at that when doing more elaborate text samples.\n\nAny criticism is welcome.\n\n| Attachment | Size |\n| --- | --- |\n| [Baran v1.pdf](http://web.archive.org/web/20150326031616/http:/typophile.com/files/Baran%20v1.pdf) | 282.22 KB |\n| [Baran v2.pdf](http://web.archive.org/web/20150326031616/http:/typophile.com/files/Baran%20v2.pdf) | 280.64 KB |\n| [Baran v3.pdf](http://web.archive.org/web/20150326031616/http:/typophile.com/files/Baran%20v3.pdf) | 313.77 KB |\n| [Baran v6.pdf](http://web.archive.org/web/20150326031616/http:/typophile.com/files/Baran%20v6.pdf) | 313.12 KB |\n| [Baran v6 text sample.pdf](http://web.archive.org/web/20150326031616/http:/typophile.com/files/Baran%20v6%20text%20sample.pdf) | 399.71 KB |\n\n",
  "author": "Martin Silvertant",
  "time": "7 Jul 2014 — 2:28pm",
  "uid": "52182",
  "comments": [
    {
      "time": "7 Jul 2014 — 2:32pm",
      "content": "Can't I edit my post? Anyway, I wanted to add that by considering c/e too classical I rather mean perhaps they feature too many angles. The b/d are very rounded after all and somewhat deviate from the classical structure as seen in the Garalde types.\n\n"
    },
    {
      "time": "7 Jul 2014 — 7:29pm",
      "content": "It's not easy to make something original in this genre, but I think you're doing it!\n\nThe \"e\" seems too conventional.\n\nThe beak of the \"r\" is too soft.\n\nhhp\n\n"
    },
    {
      "time": "7 Jul 2014 — 7:49pm",
      "content": "Thanks. Do you have any suggestions for the /e? Any typefaces I might have a look at?\n\nStrangely enough this typeface reminds me of Ruse and Collis but I checked and it actually doesn't look like either. I guess it's Ruse's spaciousness and Collis' minimalism which reminds me of Baran. Baskerville also came to mind but obviously that one is way different. I think it's again the spaciousness.\n\n"
    },
    {
      "time": "7 Jul 2014 — 7:53pm",
      "content": "For the \"e\", all I can think of is stuff you might rightly see as too gimmicky. Like making the bar not connect on the left, maybe even curling downward gently.\n\nhhp\n\n"
    },
    {
      "time": "7 Jul 2014 — 8:15pm",
      "content": "A disconnected bar doesn't seem like a good idea for this typeface. I might try it out later, but I don't think this is what should make or break the /e anyway. There was something improper about its structure compared to the other letters.\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20v7_5807.jpg)\n\nHere's an update. I changed c/e. I think they have a much better flow now. The /e is a lot more rounded like the /a. For now I'm fine with it but I might change it later. I haven't really decided on how quirky this typeface should be, either.\n\nI also sharpened the beak of /r though I might have overdone it. I also made the /o wider but I'm still not happy with it. I would have thought the /o is one of the easiest letters but I actually find it one of the hardest characters to get right – in all of my typefaces.\n\nAnd I made several variants of /f and decided on this one for now. I'm not sure if the terminal is sexy or just too small.\n\n"
    },
    {
      "time": "7 Jul 2014 — 9:31pm",
      "content": "To me the beak of that \"f\" is definitely too timid.\n\nhhp\n\n"
    },
    {
      "time": "8 Jul 2014 — 12:07pm",
      "content": "Baran v8 /g\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20v8%20g_5003.jpg)\n\nBaran v9\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20v9_5395.jpg)\n\nI modified b/c/e/f/r and added g and t.\n\nLast week I stumbled upon [this post](http://web.archive.org/web/20150326031616/http:/typophile.com/node/54942) and noticed Hrant's criticism on the classical shape of /g. I figured I would try to design a /g with an open loop but couldn't get it to work so I eventually closed the loop again. I noticed the link in the /g of Romulus is centered rather than at the left and this seems to result in a less obtrusive loop. I also downplayed the link of the bottom loop and put it more to the center. I quite like the result of v9 but I thought I would post the whole evolution of /g so you get more insight into what I'm exploring so you may be able to offer more specific criticism.\n\n"
    },
    {
      "time": "8 Jul 2014 — 3:51pm",
      "content": "A daring thing you might do with /e is to round it entirely, as you would in an italic, but still with an essentially horizontal crossbar. I think that could work with the feel you've got here.\n\n"
    },
    {
      "time": "8 Jul 2014 — 4:25pm",
      "content": "I considered that but figured it would make the typeface too \"modern\" as I still want some of that classical grace but I just finished the /u which has a spur like a/d and it somewhat deviates from that classical style I was thinking of. I think it's worth a try to make a rounded /e as you suggested. Thanks for the feedback.\n\n"
    },
    {
      "time": "8 Jul 2014 — 4:27pm",
      "content": "Actually, perhaps I won't even lose that classical grace by rounding /e off. It's just I considered a rounded /e earlier today when I noticed it in a less classical typeface.\n\n"
    },
    {
      "time": "8 Jul 2014 — 4:43pm",
      "content": "Here's a quick try-out. It's not perfect yet but I think it has a nice flow. I don't think it should necessarily replace the old /e but it could potentially be a nice alternate.\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20v10%20eager_3770.jpg)\n\n"
    },
    {
      "time": "9 Jul 2014 — 7:12am",
      "content": "I think your closed \"g\" is working well, in context. But I'm not sure a good open one wouldn't also work, and my view remains that it's better for readability.\n\nI don't like that rounded \"e\"... BUT you might try making the right end of the bar rounded while leaving the left connection flat.\n\nBTW I'd make the top of the \"t\" more prominent. Also, the ear of the \"g\" should be stronger; I'm a fan of making it ascend.\n\nhhp\n\n"
    },
    {
      "time": "9 Jul 2014 — 8:15am",
      "content": "All good points. I do want to give the open /g another try later.\n\nAs for /t, I stumbled upon a small issue I didn't encounter before. I'm pretty happy with the combination of rounded and sharp lines in the bar of /f and I like how pronounced it is (as the serifs in this typeface are quite long as well) and I noticed how the bar in /f and /t are usually the same so I repeated that element. However, what worked for /f didn't quite work for /t. I shortened the left side of the bar and extended the right and tried to balance the apex of /t with the horizontal. At first I designed the apex to be long and squarish such as in Ruse but it didn't work. I think I just felt forced by the shape and length of the bar to make the apex less pronounced, more or less like Calluna.\n\nAfter your feedback I can see I overdid downplaying the apex, but the reason for this back story is to ask if you have encountered this \"issue\" where the bar on /f doesn't quite work for /t. I've looked at a few typefaces and I notice the bar is always the same. I personally feel type should be fluid and optical adjustments need to be made (just like I would never rotate a geometric /b to be a /q without making optical adjustments), but since Baran is a lot more rigid (equating to being less fluid) than Garamond for example, I don't quite know to which extent I should repeat elements or make them unique.\n\nI suppose this should be my own decision, but I can't really decide what will work better for Baran. Fluidity or rigidity? I think Baran feels a bit too rigid now. The alternate /e is an overcompensation but I feel like an ascending ear for /g is going to make the typeface less rigid already, which is good I think. I think it needs to be more dynamic. Romanée is a fairly good example of this combination of rigidity and fluidity.\n\n"
    },
    {
      "time": "9 Jul 2014 — 8:16am",
      "content": "All good points. I do want to give the open /g another try later.\n\nAs for /t, I stumbled upon a small issue I didn't encounter before. I'm pretty happy with the combination of rounded and sharp lines in the bar of /f and I like how pronounced it is (as the serifs in this typeface are quite long as well) and I noticed how the bar in /f and /t are usually the same so I repeated that element. However, what worked for /f didn't quite work for /t. I shortened the left side of the bar and extended the right and tried to balance the apex of /t with the horizontal. At first I designed the apex to be long and squarish such as in Ruse but it didn't work. I think I just felt forced by the shape and length of the bar to make the apex less pronounced, more or less like Calluna.\n\nAfter your feedback I can see I overdid downplaying the apex, but the reason for this back story is to ask if you have encountered this \"issue\" where the bar on /f doesn't quite work for /t. I've looked at a few typefaces and I notice the bar is always the same. I personally feel type should be fluid and optical adjustments need to be made (just like I would never rotate a geometric /b to be a /q without making optical adjustments), but since Baran is a lot more rigid (equating to being less fluid) than Garamond for example, I don't quite know to which extent I should repeat elements or make them unique.\n\nI think Baran feels a bit too rigid now. The alternate /e is an overcompensation but I feel like an ascending ear for /g is going to make the typeface less rigid already, which is good I think. I think it needs to be more dynamic but I don't want to overdo it. It shouldn't become organic like my Aghari typeface. Romanée is a fairly good example of this combination of rigidity and fluidity.\n\n"
    },
    {
      "time": "9 Jul 2014 — 10:28am",
      "content": "To me, the more a font is for text (versus display) the less reason there is to be concerned with literal repetitions of shapes.\n\nIt's your font of course, but I myself don't see Baran as feeling too rigid; in fact I would worry that softening it would make it too much like too many fonts already out there.\n\nhhp\n\n"
    },
    {
      "time": "15 Jul 2014 — 5:21pm",
      "content": "I want to show an issue I ran into with the /g. I was pleased with the design but as I started testing the font I realized the ear of /g is obtrusive when paired with another letter.\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20g%20issue_5428.jpg)\n\nAs a result I felt I was forced to raise the ear further. I think it looks less pleasing but also less obtrusive. Does anyone have any suggestions? I considered solving the issue by designing an alternate /g to be used as a ligature but I obviously rather have the issue fixed in the design of the default characters. Maybe the ear just needs to be a bit shorter.\n\n"
    },
    {
      "time": "15 Jul 2014 — 5:22pm",
      "content": "And Baran v.13 in context:\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20v13_4171.jpg)\n\n"
    },
    {
      "time": "16 Jul 2014 — 5:48am",
      "content": "A few comments (any of which, as always, you may choose to disagree with and forget):\n\n- I think the /e/ needs more weight in the top left area, perhaps just the left side of the bowl. (I would shift the inner curve a bit to the right).\n- /f/, on the other hand, is definitely too thin at the upper taper. Wasn’t the last version thicker. I thought its color already looked OK.\n- /r/’s terminal is too dark (_delay_ its thickening a bit more, perhaps).\n- The shoulders of /n/, /m/ and /h/ are also a bit too dark to my impression. Independently they look great, though. That doesn’t help, does it?...\n- A more obvious remark: The strokes of /y/ meet at a too high spot. Especially with your choice of a horizontally cut joint, I don’t think the optical compensation has to be so pronounced or is even necessary.\n- Either the crossbar of /t/ is too short at the right or its terminal is too long.\n\nI really like that slightly asymmetrical but calligraphic detail you have given to the lowercase /o/, by the way :-)\n\n"
    },
    {
      "time": "16 Jul 2014 — 8:46am",
      "content": "Thanks a lot for the feedback. I will respond to each statement individually.\n\ne — I actually added more weight to the left side and a tiny bit to the bottom and top right side of /e already but I forgot to update it in the font.  \nf — Okay, this is one of those areas where I'm probably not quite as confident as a type designer yet as I should be. I consciously made the top thinner to have a bit more of excitement going on in the typeface. Now and then I see a typeface with a few letters which are a bit off and thus demand attention; some might say it's obtrusive but I often think it demands just enough attention in a good way. I wish I could remember the names of a few of these typefaces. I can't find it in my collection either. I recently stumbled upon a geometric sans here on Typophile for a big fashion brand but I can't remember which. It featured a lowercase /a with a very thin horizontal at the top of the bowl. I think it did something strange with the /e as well but the rest of the typeface was quite conservative.\n\nAnyway, I guess my question is how do you guys know if you're taking things too far? In my older typefaces I was always going for high consistency but it tends to look dull. I want to spice things up a bit but I don't yet have the experience and confidence to know what works and what doesn't. I guess it's quite subjective as well, though I trust your judgement so I usually take your feedback into consideration.\n\nAnyway, looking at the /f in context again I can see it's just too light. It's not a charming feature but an obtrusive one which looks like a mistake. Perhaps that's really the issue. If I want to add a certain feature it should more obviously be a feature.\n\nr — I guess you're right. Looking at the text sample last night I actually wondered if the /r, /t and /y shouldn't be a bit rounder anyway. I'm considering making the beak of /r a bit more like the terminal of /f (essentially curving the bottom of the beak inwards a bit more) which should make it less dark as well. I'm also considering removing the angle at the left side of the apex of /t and make that a curve.\n\nn/m/h — The shoulders don't look too dark to me. There is more diagonal stress in /d though, so perhaps I should move the weight of the shoulders a bit more to the right so the left side has more space to breath in. What do you think? I will test it out today.\n\ny — I'm uncertain about this one in general. I really like the horizontal cut (though I agree it should be lowered) but I don't think it's for this typeface. I think I may need more roundness in the letter, so I might make a normal joint or a bit of a curved one like some italic variants of /y. If I were to keep the horizontal cut I should probably add more straight lines in the other letters, such as the leg of /k.\n\nt — I don't think the terminal should be shorter so I will probably have to extend the crossbar. I already extended it compared to the crossbar of /f as they're the same size in other typefaces I looked at, but I guess it's fine to deviate from whatever other people are doing. In fact, this is probably the way to innovate and gradually change type.\n\no — I always have trouble designing the /o so it's good to know I did well here.\n\n"
    },
    {
      "time": "16 Jul 2014 — 9:28am",
      "content": "Okay, I just realized the name of one of the typefaces I had a look at for strange characters: [Doko](http://web.archive.org/web/20150326031616/http:/www.urtd.net/fonts/doko). Look at the strange shape of /r. I don't think it's obtrusive but it adds a lot of character to the typeface I think. By the way, this really isn't the best example because although the /r is unusual, it does follow the general style of the typeface rather well. It doesn't stand out as much as the /a in the geometric typeface I talked about earlier.\n\nAlso, I don't remember if this was in the geometric typeface or a different one but it featured an upright italic /e with a very inwards slope towards the stem. Hence I tried a similar thing for my /e (my 7th comment on this post) to spice things up. Imagine a more exaggerated version of that in a simple geometric typeface...\n\n"
    },
    {
      "time": "16 Jul 2014 — 5:07pm",
      "content": "I updated half the letters. I think the color is more even now as I felt the bowl of /a, /b and /d were a tad too heavy. I think the bowl of /b still might be. I processed all feedback, rounded the left side of the apex of /t, made the beak of /r curve inwards more and added /p and /z. I tried different things for the join of /y but didn't like any of them so I just moved the join down a bit.\n\nI just noticed there's too much space on the right side of /s and the left side of /y but I don't care to update the picture right now. The spacing isn't great anyway; I have a lot to learn there. On that note, does anyone have any tips on how to go about spacing? When one letter pair is perfect an other one becomes less perfect and it seems an endless process. I know I can add kerning pairs but I want to postpone doing that until the basic spacing is more to my liking. With previous fonts I started adding kerning pairs too early and it becomes even more messy.\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20v14_4052.jpg)\n\n"
    },
    {
      "time": "17 Jul 2014 — 2:16pm",
      "content": "You retouched the bowl of the /a/ nicely. It now looks more fluid. You also did a good job with the /f/.\n\nI would modify /y/’s terminal to resemble the terminals of /r/, /f/ and /g/’s ear somewhat more. I like the overall shape, though.\n\nIsn’t the ear of /g/ too light?\n\nAbout giving some letters some extra quirkiness, I believe I share your opinion. I think it is totally sane and even necessary to break the rules now and then. It’s good to see that you are giving those “louder” details a chance. Truth is that in typeface design you will find yourself throwing out most of your original ideas because either they look as mistakes or they convey a trying-to-hard impression :-/ Talking about high-contrast spots as design features I immediately had to think about Lexikon, which to me can be called a successful design without hesitation (...although I’ve always thought the /z/ looks off).\n\nAs to the spacing, stick to the rule of thumb of spacing glyphs that are closer to a vertical line looser and glyphs that are pointier tighter. Give vertical letters a side-bearing about half as wide as the average counter width. Of course, be consistent for the sake of it and to save precious time; otherwise your class based kerning is useless. These are all things you probably already know, but perhaps they confirm your own ideas about spacing.\n\n"
    },
    {
      "time": "17 Jul 2014 — 11:53pm",
      "content": "You're right about /y. I think I can do something more interesting with the tail than this lazy shape, too.\n\nI shortened the ear of /g but didn't compensate for the loss of black. I will make it thicker at the top so the top of /g doesn't look like an apple.\n\nAs for Lexicon's /z, I guess you don't like the bottom serif being so diagonal? It could be a tad heavier as well. What makes this typeface work generally though? The /t and /f seem so heavy while all letters with shoulders and bowls are quite light in the joins. I guess he uses a different stroke for each class of letters which results in a dynamic typeface rather than a consistent one with some off-features.\n\n> otherwise your class based kerning is useless.\n\nI'm not using classes. That's an issue. I will look into it.\n\n"
    },
    {
      "time": "18 Jul 2014 — 1:53am",
      "content": "I especially like the darker weights and the overall proportions. That giant x-height does it for me. I think the thin joints where drawn that way to compensate for the ink diffusion on print. You put it nicely when you say it is a dynamic typeface: it’s like the Addams Family of typefaces! It’s evident that Bram de Does gave _peculiarity_ a high priority in his design.\n\n> I'm not using classes.\n\nWith kerning being the such a tedious and time-consuming activity, I don’t want to imagine how the old-school backbreaking way might have been like to you :|\n\n"
    },
    {
      "time": "18 Jul 2014 — 2:12am",
      "content": "Well, it's just 22 letters so far so not much going on yet. I think I did use classes in a font I did a few years ago. I recently got back to FontLab again so I'm practically rediscovering everything.\n\nBy the way, have you seen the documentary about Bram de Does? It's called \"Systematisch slordig\". Unfortunately the online version lacks subtitles though.\n\nIn the center of Rotterdam there is a little book store which features Trinité on the window. I always love walking past it. [http://www.boekblad.nl/Uploads/2011/3/etalage-boekhandel-van-gennep-rott...](http://web.archive.org/web/20150326031616/http:/www.boekblad.nl/Uploads/2011/3/etalage-boekhandel-van-gennep-rotterdam.jpg \"http://www.boekblad.nl/Uploads/2011/3/etalage-boekhandel-van-gennep-rotterdam.jpg\")\n\n"
    },
    {
      "time": "18 Jul 2014 — 11:41am",
      "content": "It’s a shame there is no subtitled online version... Maybe I should learn a bit of dutch.\n\nMooie boekhandel!\n\n"
    },
    {
      "time": "18 Jul 2014 — 11:46am",
      "content": "Pretty much all Dutch people know proper English, so they should have the humility and graciousness to provide a translated version.\n\nhhp\n\n"
    },
    {
      "time": "18 Jul 2014 — 4:29pm",
      "content": "I agree. Normally I would say just download the video using an external app and download the subtitles separately, but there are no subtitles to be found for this on Internet at all. It's just not popular enough.\n\nThe type community is already small though, so it seems a really bad choice to only target the Dutch audience of the type community. I think even within the Netherlands only few have seen this documentary.\n\nSupposedly you can buy the DVD with English subtitles but it seems impossible to get. A reference to the DVD can be found on [TypeEdu](http://web.archive.org/web/20150326031616/http:/typedu.org/books), which links to [Nijhof & Lee](http://web.archive.org/web/20150326031616/http:/www.nijhoflee.nl/), which has been moved to the 'Bijzonder Collecties' library of [Universiteit van Amsterdam](http://web.archive.org/web/20150326031616/http:/typophile.com/wiki/https%3A/%252Fbijzonderecollecties.hexspoorwms.nl/EN/webshop/nijhof-en-lee), which doesn't sell the DVD. I can't find any other references online, which is ridiculous.\n\n"
    },
    {
      "time": "18 Jul 2014 — 4:42pm",
      "content": "> It's just not popular enough.\n\nIf that's true for people who understand Dutch, then I'm not concerned. :-)\n\nhhp\n\n"
    },
    {
      "time": "19 Jul 2014 — 7:22pm",
      "content": "Here's a progression of /y. I thought the cursive element might fit the typeface considering the /k features a similar kind of grace but it just didn't fit the typeface. Seeing it in context also made me realize I want to keep a slight rigidity. As such I shouldn't water down the design more and keep all the grace for the italic. V.16 is the current shape. I'm still not satisfied with the tail but I will have another look at it later.\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20y_5899.jpg)\n\n"
    },
    {
      "time": "19 Jul 2014 — 7:33pm",
      "content": "Here's the last version of Baran. I modified some letters, added q, some basic punctuation and started on the capitals (A, H and I so far).\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20v16_6092.jpg)\n\n"
    },
    {
      "time": "20 Jul 2014 — 1:42am",
      "content": "It’s looking great!\n\n- The left serif of /A/ could be longer.\n- Isn’t the tittle floating a little too high?\n- The /z/ feels off to me. Don’t know why; it lacks the calligraphic energy the other glyphs have. I would try to make the serifs longer and symmetrical (both sharp serifs). Maybe I just need time to fall in love with it.\n- The apostrophe is too dark.\n- Rotate the comma -5°.\n\n"
    },
    {
      "time": "20 Jul 2014 — 9:42am",
      "content": "Thanks for the feedback. I think you're right on all points. The /A is a little off to me, but I'm actually thinking of shortening the left serif even more to remove that \"bump\". I personally like the /A in Trinité and Lexicon a lot and think it might work well for this typeface. It's also for functional reasons; this probably isn't going to matter too much for the left side of /A, but considering its shape there will always be a lot of space around the letter so I want to compensate for that.\n\nThe apostrophe could be a bit lighter. I noticed Lexicon's is really big (but Lexicon is darker anyway) so I guess I leaned a bit too much to Lexicon's apostrophe.\n\nCan you make a suggestion for c\\_u? Do you think I should make a contextual alternate to make the point where the terminal and serif meet less obtrusive?\n\nI noticed I forgot to include /q in this sample. I made sure the bowls of b/d/p/q are all unique.\n\nWhat do you think of /y now?  \nShould /e be a bit darker on the left, and should /s be a bit wider? I'm not entirely sure how much to differentiate in letter widths. I like the Venetian model regarding widths but it's probably not a good idea to use that for this typeface, though I don't want all characters to be equal in width and provide the exact same rhythm either because I feel it would make the typeface more dull.\n\nI'm also thinking of moving the terminal of /t a bit to the left. I almost feel the /t has a tendency to lean backwards so I might have to compensate for that. Moving the lower part a bit to the left might create more tension as well, which could be good.\n\nI also shortened the serifs on the ascenders a bit so they will work better in combination with capital letters. With the long serifs there was just too much space between I\\_l and similar letter combinations.\n\n"
    },
    {
      "time": "20 Jul 2014 — 10:42am",
      "content": "The /cu/ pair might just need kerning. I don’t think moving them a tad apart would open a significant gap. If you do an alternate, the obvious fix would be to shrink the serif of /u/, but then you might better just shrink the serif of the /u/ glyph itself.\n\n/y/ clearly improved. The terminal is too light to my eye but apart from that it looks OK.\n\nI still see /e/ to light on the left side _or_ at the top. Expanding the former is a better idea I think, as you suggested. Either way it does look thin next to /n/.\n\n/s/ looks balanced to me now, but if you wish you can make it wider (just try not to make it wider than Palatino’s /s/ ;-).\n\nI second your suggestion about the /t/.\n\nCan we see the update of /b/d/p/q/ and the ascenders?\n\n"
    },
    {
      "time": "30 Jul 2014 — 3:42pm",
      "content": "Here's an update on Baran:\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20v17_4454.jpg)\n\nI changed quite a few characters subtly, added /x, /B and /T, and lowered the height of the capital letters. Specifically have a look at /y. It's improved but I'm still not happy with it. I'm having a hard time with the transition from the stem to the terminal.\n\nI darkened the /e quite a bit. I think it looks consistent now, though now I see it next to /a I feel like the /a might be a tad too light in the bowl and the terminal. I made the /s a little bit wider. The design of the comma and quotes has been adjusted to make it look like they're rotated a bit to the right. I also tried shortening the left serif of /A further but it looked odd, so I normalized the left serif. The left side of /A is too light I think. I forgot to update /z so I will do that next time.\n\nThe /u is quite problematic at times due to its long serifs. I will probably add some contextual alternates (for c\\_u among others) with a shorter left serif and I see an f\\_u ligature is probably a good idea. Any suggestions on how to make r\\_y less obtrusive?\n\n<cite>Can we see the update of /b/d/p/q/ and the ascenders?</cite>  \nI will upload an image in a moment.\n\n"
    },
    {
      "time": "30 Jul 2014 — 8:07pm",
      "content": "Here's a comparison of v14 (black) and v17 (white) so you can see the shortened serifs for the ascenders. I actually thought I made a more obvious change but it's really subtle.\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20kl_3739.jpg)\n\n"
    },
    {
      "time": "30 Jul 2014 — 8:41pm",
      "content": "Here's a picture of b/d/p/q:\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20bdpq_6375.jpg)\n\n"
    },
    {
      "time": "31 Jul 2014 — 2:49am",
      "content": "I like how the variations of the bowls of /b/d/p/q/ still look very related. Interesting counter shape; I didn’t notice it earlier.\n\nThe colon and semicolon have perhaps too much space in-between.\n\nI don’t think the /ry/ pair needs anything more than just kerning.\n\n/y/ is maybe a tad too light at the thin part of the terminal, but it looks OK. I also tend to take longer drawing the /y/. It’s the long diagonal that starts with a serif and ends in a terminal, with a thick-thin-thick transition. Ask yourself in which spot you want that transition to happen. Hope it helps.\n\nThe area around the left serif of /A/ is too light indeed. I still think the serifs (both) could be longer towards the center, as if pushed together. At least longer than the serifs of the lowercase. But it’s your call ;-)\n\n"
    },
    {
      "time": "1 Aug 2014 — 4:37pm",
      "content": "> The colon and semicolon have perhaps too much space in-between.\n\nI thought so too, but how do I fix this? I can imagine it will look good if I bring the two dots of the colon closer together (thus taking them away from the baseline and the mean line), but raising the comma of the semicolon may be odd. To me it doesn't look wrong necessarily, but I don't think a floating comma is an elegant solution. How are the colon and semicolon usually balanced in typefaces with a high x-height? Also, how is this fixed in very light typefaces where the dots of the colon drift further apart? Am I wrong in thinking they should align with the baseline and mean line?\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20v18%20semicolon%20test_4336.jpg)\n> Ask yourself in which spot you want that transition to happen.\n\nThanks for the tip, though I have been asking myself this continually. The problem I think is the join; I want to take a longer distance for the curve on the inside of the terminal, but it still needs to go straight after the join. The fact that the area above and below the join needs to align is rather restricting. It's a bit hard to explain, but essentially there are too many diagonals and curves to consider which makes it difficult to have a nice transition without bumps in the curves. I feel very restricted. Perhaps I should have cut the left side off temporarily so there are a fewer diagonals to consider. Anyway, I reworked the /y again and it's looking much better. I will upload a new version later once I've added more letters and made more revisions.\n\n"
    },
    {
      "time": "1 Aug 2014 — 8:04pm",
      "content": "I changed A, B, H, T, r, s, y and z and added O, S and Z. In the second image below /c and /e are changed as well, making the stress a bit more diagonal.\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20v18a_5945.jpg)\n  \n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20v18b_5347.jpg)\n  \nThe second image makes me realize the apostrophe is still too heavy and the acute accent is too light. It's appropriate to make the diacritics a tad lighter though, isn't it? I often find diacritics to be a bit too obtrusive. I'm wondering if I should make the hyphen more subtle as well.\n\nAlso, how do you usually space the apostrophe and how big should the side bearings be? I had to kern '\\_s by an extreme amount so I figured I might have to reduce the side bearings, but I don't know if that will give problems in other areas. Is there usually a lot of kerning done for punctuation?\n\n"
    },
    {
      "time": "2 Aug 2014 — 1:25am",
      "content": "Space the apostrophe in a way that (i) without any kerning wouldn’t cause any ugly collisions and (ii) save you the most kerning work. In this case you space it relative to the ascenders (left and right) and kern the rest of the pairs. You will spend much less time kerning punctuation that sits on the baseline, as there is more symmetry at that height.\n\nI like what you did with the /y/ shape-wise. The terminal (not the diagonal) could be thicker. You’re almost done :•)\n\n"
    },
    {
      "time": "2 Aug 2014 — 9:49am",
      "content": "I have another update which I will upload later (possibly another day), but meanwhile here's a preview of alternate weights I drew for /a:\n\n ![](http://web.archive.org/web/20150326031616im_/http:/typophile.com/files/Baran%20v19%20weights_6493.jpg)\n  \nThe light version might be a bit too condensed but I have to fine-tune some more anyway.\n\nBy the way, are there guidelines for the weights in terms of how light or black each weight should be or is it subjective? I'm inclined to call these weights Extra Light, Regular and Black.\n\n"
    },
    {
      "time": "1 Sep 2014 — 7:47pm",
      "content": "This is shaping up beautifully. I like it a lot. Not being a professional I don't know what else to say, but... had to toss in some praise!\n\n"
    },
    {
      "time": "14 Sep 2014 — 2:35am",
      "content": "The top of the Extra Light /a/ seems to hang at the left end more than in the other weights (like a plant that starts to wither). Also, the fluidity of the stem is lost at the bottom juncture.\n\n"
    },
    {
      "time": "15 Sep 2014 — 10:45am",
      "content": "Thanks for the feedback. I didn't continue working on the alternative weights but I added some capitals and made some changes to the lowercase. I will put up pictures soon, and I will soon show a new typeface I started for Google.\n\n"
    }
  ]
}
