{
  "id": "117802",
  "title": "Warmth",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What are we discussing when we refer to 'warmth' in digital lettering? rounded edges? small discrepancies in point placement? or all of the above? any others that I have missed?\n\nfrom 'Just My Type' Garfield quoting Spiekermann:  \n\"... I add it by not making my type too perfect - I leave stuff alone, I won't make it mathematically, so it can look unfinished and handmade.\"  \nquite self-explanatory there I think.\n\nfrom 'Designing Typefaces' Earls quoting Hoefler:  \n\"It's not hard to evoke the warmth of foundry type in very superficial ways - bumpy edges, erratic baselines, and all that - and the results are often surprisingly effective\"  \n\"Matthew Carter's 'Galliard' and 'Miller' come straight to mind along with Bram de Does' 'Lexicon' - each of these face is a riot of sharp corners and parallel lines, and yet somehow they manage to have all the warmth of the best foundry types.\"\n\nThe first quote is quite understandable (analog warmth a'la analog mixing desks/compressors etc..) but after reading the second quote from Hoefler I find myself questioning what 'warmth' in vector drawing is.\n\nHow do you inject warmth into your vector drawings? any recommended reading?\n\nBest.\n\n",
  "author": "Michael Green",
  "time": "7 Jul 2014 — 4:10pm",
  "uid": "14356",
  "comments": [
    {
      "time": "7 Jul 2014 — 7:51pm",
      "content": "That’s not something I ever think about.\n\nThe trace of process that occurs with letterpress printing is attractive when compared with the bland precision of digital offset. That’s something that can be parsed—but it occurs with all technological progress, look how Morris and Goudy did it.\n\nI would say, as Hoefler intimates, that any older, more hand-crafted technology will appear quaint, organic and “warm” when compared with subsequent generations of more precisely, mechanically polished engineering.\n\nWhy does a character have to be rendered with exactly the same glyph every time? Changing it up is a strategy I continue to explore, but not in search of warmth, it’s a philosophical pursuit.\n\n"
    },
    {
      "time": "7 Jul 2014 — 8:06pm",
      "content": "I think that warmth can come from less simple geometric shapes, and modulating strokes so they are more reminiscent of organic curves, shapes found in nature. I don't agree with Hoefler's analysis here.\n\n"
    },
    {
      "time": "7 Jul 2014 — 10:21pm",
      "content": "Agreed with William. Shapes have intrinsic meaning, even though that can get drowned out.\n\nhhp\n\n"
    },
    {
      "time": "8 Jul 2014 — 7:33am",
      "content": "William and Nick thanks for your replies - they have raised a couple of avenues for further research especially Morris/Goudy and shapes found in nature.\n\nHrant - Could you elaborate on the intrinsic meaning of shapes and drowning out of said meaning with examples if possible? I have enjoyed reading your previous posts re: bouma and would like to understand this point too.\n\nBest.\n\n"
    },
    {
      "time": "8 Jul 2014 — 7:55am",
      "content": "No matter how much cultural conditioning affects our interpretations, we're still physical beings in a physical world, and physical properties of shapes and colors contain real meaning. For example red harbors meanings green never could because our blood is red; an inverted triangle will attract more attention than an upright one because of gravity; round shapes are warmer than angular shapes; etc. All this can –and should be– leveraged by a good designer.\n\nhhp\n\n"
    },
    {
      "time": "8 Jul 2014 — 8:37am",
      "content": "Hrant - thank you for the clarification. Are there any books that you can recommend that expand on this or is this from your own thinking?\n\nOne book that I have always wanted to check out is Frutiger's 'Signs and Symbols'. Can anyone confirm that it would contain such information or is it mostly concerned with runes etc..?\n\nBest.\n\n"
    },
    {
      "time": "8 Jul 2014 — 8:41am",
      "content": "All that is mostly my own thinking. But to me it's just common sense.\n\nIt's been a while since I read \"Signs and Symbols\" but IIRC it's mostly too vague to be useful in this context.\n\nI know of one fascinating book about the relationship of shapes and letterforms: \"Sign and Design: The Psychogenetic Source of the Alphabet\" by Kallir. But it's more metaphysical than scientific.\n\nhhp\n\n"
    },
    {
      "time": "8 Jul 2014 — 8:54am",
      "content": "Great stuff. Agreed that some of your ideas are just common sense but sometimes it takes a third party to provide some inspiration and I appreciate it.\n\nI will check out Kallir's book.\n\nBest.\n\n"
    },
    {
      "time": "8 Jul 2014 — 8:56am",
      "content": "The Albertus cover is very tempting as a sidenote\n\n"
    },
    {
      "time": "8 Jul 2014 — 11:32am",
      "content": "Perhaps I'm missing something, but what is there to disagree about the Hoefler quote, or do you disagree about the importance of these features in regard to warmth? I wouldn't be using these features as a primary design to invoke warmth, but they do seem to add a lot.\n\nI've recently been researching Bram de Does' work and I noticed how irregular Lexicon is. So far I've always used guidelines to get the proportions of the letters exactly the same but I realize this is rather stifling and it makes the type feel cold and lifeless. As such, I started using guidelines merely as reference points and the contours of each letter pretty much dances around those guidelines. I'm now designing a typeface which is pretty clean and sharp, and yet by utilizing this technique the type is becoming a lot more vivid. I can imagine this could be vital to designing a warm typeface.\n\nI'm really not great at calligraphy and use it only for inspiration, but I think I should try harder to get well versed in calligraphy so I can utilize many of these accidental irregularities which are rather hard to reproduce digitally from scratch. I think type should be seen as fluid. I consider Legato to be a good example of a design where type is seen as being fluid and it seems to result in a much more vivid and arguably warmer typeface.\n\n"
    },
    {
      "time": "8 Jul 2014 — 11:47am",
      "content": "\"I know of one fascinating book about the relationship of shapes and letterforms: \"Sign and Design: The Psychogenetic Source of the Alphabet\" by Kallir. But it's more metaphysical than scientific.\"\n\nThat still seems interesting. Do you find this book to be relevant in general? I'm considering buying it.\n\n"
    },
    {
      "time": "8 Jul 2014 — 1:21pm",
      "content": "Real warmth is not \"injectable\". It has to be part of the whole to begin with. Hoefler makes it sound like a photoshop filter being applied to Helvetica can make it warm feeling.\n\n"
    },
    {
      "time": "8 Jul 2014 — 1:47pm",
      "content": "I think in a sense it can though. I suppose you could program a feature which applies the same kind of irregularities you would find in letterpress prints. I think letterpress typefaces usually aren't designed to be warm but become warm due to the printing technique. The same kind of effect could be applied digitally in principle. These irregularities are random and have nothing to do with the control you exert over the design of the typeface.\n\nSo I think first you should define what you mean by a warm typeface or at the very least you should consider that warmth can be applied both to the design of the typeface as well as the effect. What Hoefler is talking about is the effect. In essence you could take a very cold typeface and apply the random irregularities Hoefler mentions and it becomes warm. That's different from DESIGNING a warm typeface.\n\n"
    },
    {
      "time": "8 Jul 2014 — 2:47pm",
      "content": "A fireplace is inherently warm. Painting a refrigerator day-glo orange, not so much. Why must you \"fake it\" instead of make it?\n\n"
    },
    {
      "time": "8 Jul 2014 — 3:53pm",
      "content": "I find that analogy to be ridiculous. By that way of reasoning indeed you're \"faking\" warmth. What I'm suggesting is that there are two different scales in which warmth can be applied to a typeface. You seem to be completely disregarding one of these scales as \"merely an effect\". I think it's actually vastly different from applying a Photoshop filter. I'm talking about the design of the typeface in which you may utilize some programmable effects but this is very different from utilizing the post-production effects like in Photoshop.\n\nI think whether you digitize a letterpress typeface based on the prints, you design a warm typeface from scratch or you design a cold typeface (like the lead letters before it's printed) and apply the same irregularities you would usually get from printing digitally, I think you could still get to the same results. In fact, option 1 and 3 seem to be virtually indistinguishable. I have the feeling you guys are only considering option 2, in which case you would be designing an inherently warm typeface possibly but not necessarily without utilizing any of the irregularities you seem to consider to be \"merely an effect\".\n\n"
    },
    {
      "time": "8 Jul 2014 — 4:55pm",
      "content": "yup\n\n"
    },
    {
      "time": "8 Jul 2014 — 5:11pm",
      "content": "\"...in which warmth can be applied to a typeface\"  \nWhen I was setting metal type in the 1960s, we considered the side effects of ink awareness as sloppy craftsmanship. We tried for a kiss impression which minimized the blobby effect as much as possible. We did not seek to add it in for warmth. Why would I want to do that now? Garamond has warmth inherently even if set crisply--even digitally. Why do we always have to seek the arbitrary artifacts of prior technology to validate what we do today? If you want it to look like metal type set letterpress then set it letterpress.\n\n"
    },
    {
      "time": "8 Jul 2014 — 8:45pm",
      "content": "_Why do we always have to seek the arbitrary artifacts of prior technology to validate what we do today?_\n\nI wouldn’t say they are arbitrary, every technology has its qualities.  \nWhen technology changes, what was invisible substrate becomes apparent, signiﬁcant, and interesting.\n\n[http://www.horton.ednet.ns.ca/staff/scottbennett/media/](http://web.archive.org/web/20150416075237/http:/www.horton.ednet.ns.ca/staff/scottbennett/media/ \"http://www.horton.ednet.ns.ca/staff/scottbennett/media/\")\n\nI theorize that when paper became smoother, ink darker, and metal harder, in the early 19th century, it created awareness of the newly minimized process of ink gain. Thus emerged the concept of bold style, expressed in Clarendon.\n\nThat had nothing to do with “warmth”.\n\n"
    },
    {
      "time": "9 Jul 2014 — 7:46am",
      "content": "\"When I was setting metal type in the 1960s, we considered the side effects of ink awareness as sloppy craftsmanship. We tried for a kiss impression which minimized the blobby effect as much as possible. We did not seek to add it in for warmth.\"\n\nThat's completely besides the point. The fact remains that blobby effects do add warmth. Earlier Hrant argued that shapes have inherent values and rounded shapes invoke warmth and friendliness. Whether you utilize rounded forms in the design of the typeface itself or utilize the rounded shapes which come from inaccurate printing methods, in both cases it adds warmth. One type of warmth may be undesirable to some but that's besides the point.\n\nThe design of a typeface should always start with considering the larger structure. However, I think if you want to go for a warm look you will often utilize some of the features I talked about fairly early on in the design process, rather than applying it as a post-effect. I absolutely don't believe Hoefler was suggesting that you can create authentic warm typefaces by (merely) making use of post-effects. I think what he was suggesting is that these are tools to utilize in making your typeface warmer. My research into Bram de Does' and Evert Bloemsma's work lead me to the conclusion that seeing type as fluid will do remarkable things in regard to the vividness and warmth of the typeface, and the use of erratic baselines – as Hoefler suggests – is a pretty powerful instrument to do this. In fact, Garamond utilizes this as well in a subtle way. But speaking of bumpiness and rounded edges, look at how fluid of a typeface Garamond is. THAT's what makes it so warm. So, you're right Garamond has inherent warmth, exactly because of some of the things Hoefler talks about. I don't quite understand how you can dismiss Hoefler's quote and yet name Garamond, in which everything he talks about is utilized. Am I missing something?\n\n\"We did not seek to add it in for warmth. Why would I want to do that now?\"  \nI think this is just your philosophy though. Looking at certain typefaces done by professional designers strongly seems to suggest that.\n\nBesides, I can understand that you want to utilize a specific technique as best you can. Obviously you would try to avoid the blobby effect as much as you can to be considered a master at this craft, but looking back on older techniques I think we feel rather nostalgic about certain random effects and the more fluid appearance you get by utilizing these printing techniques. Isn't adding warmth to our typefaces a reference to classical typography?\n\nThe more I talk, the more I get the feeling \"fluid\" is pretty much a keyword. A fluid appearance can be achieved by chirographic forms, by not repeating elements, by a dynamic display of lines, by unexpected curves, by rounded shapes, by irregularities in color and by erratic baselines. Why dismiss half of those as merely an effect? Why not consider them as part of the whole design process?\n\n"
    },
    {
      "time": "9 Jul 2014 — 8:33am",
      "content": "Martin, the Hoefler quote implies that warmth, etc. comes solely from cultural norms. It might also imply that we can only get colder over time (which would be even more ridiculous).\n\nThe Kallir book gets tiresome about half-way through; it's almost too thorough, considering so much of it is conjecture. But it's still one of my favorites.\n\n> I started using guidelines merely as reference points and the contours of each letter pretty much dances around those guidelines.\n\nVery encouraging.\n\n> I think I should try harder to get well versed in calligraphy so I can utilize many of these accidental irregularities\n\nNot so encouraging. :-)  \nThe problem with the irregularity of handwriting is that it's entirely arbitrary in the context of reading; you'll have to find a better source, in order to eschew contrivance. And your citation of Legato is very telling here, since it's entirely non-calligraphic, in fact arguably even anti-calligraphic.\n\nAs for \"fluidity\", the thing to keep in mind is that it applies less (and even becomes an obstacle) the closer you get to reading (as opposed to consciously looking at shapes).\n\nhhp\n\n"
    },
    {
      "time": "9 Jul 2014 — 6:56pm",
      "content": " **hrant:** I disagree. Color and shape themselves do not carry any inherent meaning; however, we have instinctual feeling responses bred into us or learned which are so instantaneous that what we perceive _seems_ to carry meaning. But what we perceive does not carry meaning, the meaning is what we associate with what we perceive.\n\nAs for warmth, that's an interesting subject. I agree with **William** and **Nick** etc.\n\nI agree that warmth is associated with organic flows (shapes, colors, textures) where \"organic\" often means a hint of chaos or disorganized. Simple structures often seem colder, rhythm that's too narrow seems boring.\n\nI noticed this in photography. For a while I removed noise (color and luminance) from digital images because I thought it's a bad thing, that it interferes with the image. But by removing the noise the colors become more monotonous, the image appeared flatter. It lost life, it became less organic, cold, boring.\n\nWhen we talk about warmth of a typeface I wouldn't want to just talk about the typeface itself, but also its context. The ink it's printed with, the material it's printed on. If everything is too smooth, too straight, too perfect, then it becomes sterile and, I think, loses warmth. With enough irregularity and life in paper, ink, typeface the whole page can appear warmer.\n\nI don't think that warmth is a property of a single thing (see above my answer to hrant) but instead it is how we perceive the page as a whole. Making it appear warm might just mean to make it less geometrical and perfect :)\n\n"
    },
    {
      "time": "9 Jul 2014 — 7:10pm",
      "content": "We may be using \"inherent\" differently. On some level I agree with you. On a practical level my point is that there's a difference between the more \"hard-coded\" meanings of shapes and colors (see my examples above\\*) versus the \"softer\" meanings that are indeed cultural/transitory, which do always matter, and sometimes can in fact almost entirely cover up the \"hard\" meaning. But the \"hard\" meaning is still very much part of our reality.\n\n\\* [http://typophile.com/node/117802#comment-582251](http://web.archive.org/web/20150416075237/http:/typophile.com/node/117802#comment-582251 \"http://typophile.com/node/117802#comment-582251\")\n\n> I wouldn't want to just talk about the typeface itself, but also its context.\n\nAgreed.\n\nhhp\n\n"
    },
    {
      "time": "10 Jul 2014 — 1:26am",
      "content": "I can't top the resident gurus on recommended reading or theory but I can mention two type faces that I consider \"warm.\" Applying the rounded serifs criterion to a conventionally regular font: [http://www.myfonts.com/fonts/tiro/plantagenet/](http://web.archive.org/web/20150416075237/http:/www.myfonts.com/fonts/tiro/plantagenet/ \"http://www.myfonts.com/fonts/tiro/plantagenet/\") Applying the irregularities criterion to a font without producing an unfriendly, i.e. cold, grunge or distressed appearance: [http://www.myfonts.com/fonts/juraj-chrastina/besley-hand/](http://web.archive.org/web/20150416075237/http:/www.myfonts.com/fonts/juraj-chrastina/besley-hand/ \"http://www.myfonts.com/fonts/juraj-chrastina/besley-hand/\")  \nMy opinion about a \"warm\" typeface is that the effect does not lend itself to a precise prescription of techniques, but the reader recognizes it as warm rather than cold when he sees it.  \nBut I suppose nobody would be harmed by a theory of \"warm\" typefaces.  \nI wonder what are the limits of the discussion. Do the typefaces include cursive script -- which can have many tones from shaky and staccato [not warm] to rounded and \"girly\" with some but not perfect regularity [perhaps warm]. How much contrast is warm? Montotone, like Kaufmann is mechanical, not warm. The extreme contrast of the pen pressure in scripts like Snell Roundhand does not seem warm to me.  \nDon\n\n"
    },
    {
      "time": "10 Jul 2014 — 5:27am",
      "content": "As Donald says, warmth is often tied with low contrast and, I think, more than irregurarities properly, a softness of some kind, something which \"unsharp\" the edge between black and white. It could be at the single glyph level, or word, line of text, or even text block (incidentally I think Block is a pretty warm typeface).  \nBy the way, warmth is one factor in the success of Comic Sans.\n\n"
    },
    {
      "time": "10 Jul 2014 — 9:57am",
      "content": "Also, wide is warmer than narrow.\n\nhhp\n\n"
    },
    {
      "time": "12 Jul 2014 — 4:24pm",
      "content": "\"Martin, the Hoefler quote implies that warmth, etc. comes solely from cultural norms. It might also imply that we can only get colder over time (which would be even more ridiculous).\"\n\nHow does it imply the first? I can see how the second implication follows from the first but I don't see how you got to the first.\n\n\"I think I should try harder to get well versed in calligraphy so I can utilize many of these accidental irregularities\n\nNot so encouraging. :-)\"\n\nI think it still IS encouraging. Mind you, I'm not saying I should put more calligraphic accidents in my typefaces. Not at all. What I'm saying is to become more familiar with chirography will give me more insight into what is possible. I don't base my typefaces on calligraphic forms but I do get insights into type in general from doing calligraphy. I suppose that's where I depart from Noordzij's theory of the stroke but I consider it a good thing to be well versed in calligraphy. I'm a fan of very dynamic angles and breaking patterns in typefaces though so stylistically I probably want to get away from calligraphy, but I suppose even there happy accidents could be utilized.\n\n\"The problem with the irregularity of handwriting is that it's entirely arbitrary in the context of reading; you'll have to find a better source, in order to eschew contrivance.\"\n\nI suppose it is. I'm not using calligraphy as a basis for readable design though. Perhaps quite the opposite. I'm using it to experiment. The process of digital design is rigid so my calligraphy work is a way to sketch out ideas. Do note, it's A way. I don't consider it THE way.\n\n\"As for \"fluidity\", the thing to keep in mind is that it applies less (and even becomes an obstacle) the closer you get to reading (as opposed to consciously looking at shapes).\"\n\nI have the feeling you somewhat misunderstand what I mean by fluidity. Fluidity may be present in a typeface (as in Legato) but predominantly fluidity is a way of looking at type rather than a style. I see type as a black dot of paint which you want to keep in balance with the white at all times. If you move some black to the left, some black also needs to be moved to the right to keep it in balance. Imbalance may be added but this needs to be done subconsciously. What I consider fluidity is looking at type like it's a liquid which needs to be balanced at all times. Essentially this is done by any type designer but I feel Legato is a nice example of where it shows that the designer was highly conscious of this principle and thus managed to play with it in non-intuitive ways (anti-calligraphic as you say). He does strange things without making the typeface look unbalanced. I feel like most typefaces don't quite behave like that. They're balanced, but due to their more conservative features they're at a lower risk to become unbalanced, too. I think \"fluidity\" is the next step into the perception of what type is supposed to be which we are slowly making but we're not quite there yet. We still think too rigidly in general.\n\nThis whole talk about the distinctions between \"macro\" and \"micro\" elements to make typefaces warmer or colder to me is evident of the notion that we haven't quite made that step yet. If you think of type as fluid, it makes absolutely no sense to disregard what Hoefler said as though it's just a post-effect. I'm not defending post-effects in this context and I highly doubt Hoefler was talking about post-effects.\n\n"
    },
    {
      "time": "12 Jul 2014 — 4:37pm",
      "content": "\"I disagree. Color and shape themselves do not carry any inherent meaning; however, we have instinctual feeling responses bred into us or learned which are so instantaneous that what we perceive seems to carry meaning.\"\n\nHrant already responded to this well but I have one more thing to add. I completely agree with you here but in reality there is no distinction. We essentially live in a loveless world and yet by being here we do experience love because we make it so. Sharp edges inherently have no meaning, but almost any living organism with the ability to reflect will view sharp edges as something unpleasant, because to most it physically is. Hence we learn to associate sharp edges with unpleasantness and soft edges with the opposite. It does nothing to say that this is inherently not true. It may have relevance in some philosophical/metaphysical discussions but I don't see the implications within type design.\n\n\"I don't think that warmth is a property of a single thing (see above my answer to hrant) but instead it is how we perceive the page as a whole. Making it appear warm might just mean to make it less geometrical and perfect :)\"\n\nThat's how I think about it, hence I don't see how Hoefler's quote can be dismissed on grounds of it being post-effects. They're not necessarily post-effects and whether you add bumpy edges and erratic baselines or you're rounding off all serifs, it all helps in breaking that geometry which we associate with coldness.\n\n"
    },
    {
      "time": "13 Jul 2014 — 9:55am",
      "content": "I agree with the opinion that a sense of warmth depends on curves, smoothness and small irregularities.\n\nThe reason may be that these properties are evocative of the shapes found in humans/other organic beings, the shapes found in pleasent and comfortable objects in the physical world (like a soft feather bed), and a notion of freedom from restrictions.\n\nFor example, Willberg compared the letters of humanist typefaces like Garamond with wanderers, and those of classicist typefaces like Walbaum with soldiers. The rounded forms of a Garamond are reminiscent of a human’s natural posture. The straight lines and perfection in Walbaum on the other hand are something found in humans only if external restrictions are imposed, like in the case of soldiers forced to show an unnatural behaviour.\n\ndezcom: <cite>Hoefler makes it sound like a photoshop filter being applied to Helvetica can make it warm feeling.</cite>\n\nI believe this to work.\n\nNeue Helvetica:  \n ![](http://web.archive.org/web/20150416075237im_/http:/666kb.com/i/cq1e2z05mg2hd9kd5.gif \"hosted by 666kb.com\")\n\nAlte Haas Grotesk, found on Dafont:  \n ![](http://web.archive.org/web/20150416075237im_/http:/666kb.com/i/cq1e3jdfkxzv7ppi1.png \"hosted by 666kb.com\")\n\n"
    },
    {
      "time": "13 Jul 2014 — 12:00pm",
      "content": "Joshua,  \nYour Dafont example just looks like poorly exposed or developed phototype. It does not look more warm to me, it just looks like poor quality.\n\n"
    },
    {
      "time": "15 Jul 2014 — 4:37pm",
      "content": "To me it looks like both; it looks poor yet warmer. It would look a lot warmer if the black would bleed out a bit though. Right now it looks like there is an overexposure of white. The /e looks particularly distorted because of that.\n\n"
    }
  ]
}
