{
  "id": "117907",
  "title": "Old Stock- Over 130 Adobe Illustrator Actions for the Graphic and Type Designer",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "On Sale now at Creative Market: [https://creativemarket.com/Borgeslettering/56658-Old-Stock-Adobe-Illustr...](http://web.archive.org/web/20150424041603/https:/creativemarket.com/Borgeslettering/56658-Old-Stock-Adobe-Illustrator-Actions \"https://creativemarket.com/Borgeslettering/56658-Old-Stock-Adobe-Illustrator-Actions\")  \nIf you are a Graphic or Type Designer you may be interested in these actions I wrote for Adobe Illustrator.\n\nGraphic Designers will benefit from the ease of use of Old Stocks Actions. Complex effects can be effortlessly produced in record time. This offers the Graphic Designer a wide array of effects for their logos and layouts.\n\nType Designers- Type Designers can use Old Stock's Actions to add drop shadows and fills to their new or existing typefaces. Every Action is vectorized and separated for ease of use. Old Stock does all of the hard work for you!\n\nFor the Type Designer you can use the actions to create stackable versions of your fonts (Graphic Designers can use these for their logos). The sample below consists of 4 fonts. The base font, a solid drop shadow, diagonal line drop shadow and a fill all made using Old Stock.\n\n ![](http://web.archive.org/web/20150424041603im_/http:/typophile.com/files/K_5636.png)\n  \n\n ![](http://web.archive.org/web/20150424041603im_/http:/typophile.com/files/Cover_5563.png)\n\n ![](http://web.archive.org/web/20150424041603im_/http:/typophile.com/files/Sample-1_5818.png)\n\n ![](http://web.archive.org/web/20150424041603im_/http:/typophile.com/files/Sample-2-good_4649.png)\n\n ![](http://web.archive.org/web/20150424041603im_/http:/typophile.com/files/Sample-3_6441.png)\n\n ![](http://web.archive.org/web/20150424041603im_/http:/typophile.com/files/Sample-4-reset_3488.png)\n  \nThanks for looking :) \n",
  "author": "Charles_borges_...",
  "time": "11 Jul 2014 — 1:25pm",
  "uid": "1657",
  "comments": [
    {
      "time": "12 Jul 2014 — 7:05am",
      "content": "Very impressive, Charles, and very reasonably priced. One question: how backwards-compatible are the actions?\n\n"
    },
    {
      "time": "12 Jul 2014 — 8:16am",
      "content": "Thanks Nick. I forgot to mention they are for CS3, CS4, CS5, CS6 and CC\n\n"
    },
    {
      "time": "14 Jul 2014 — 11:29am",
      "content": "Anyone remember TypeStyler - a cool program from the \"good old days\"\n\n"
    },
    {
      "time": "14 Jul 2014 — 12:19pm",
      "content": "I've never used TypeStyler, but it's still around (typestyler.com).\n\nThe company took forever to update it for OS-X and many folks assumed the company was finished, but they eventually did update it.\n\n"
    },
    {
      "time": "14 Jul 2014 — 1:42pm",
      "content": "The updated version took so long and in the process they kept adding stuff the program just is not as interesting as it was. Sometimes less is more.\n\n"
    },
    {
      "time": "14 Jul 2014 — 2:02pm",
      "content": "I always thought typestyler looked cool but I believe it was all bitmap. Old Stock is all vector.\n\n"
    },
    {
      "time": "14 Jul 2014 — 2:38pm",
      "content": "Forgot to mention that your Illustrator actions, Charles, look very nice!\n\n"
    },
    {
      "time": "15 Jul 2014 — 8:02am",
      "content": "Thanks James!!! :)\n\n"
    }
  ]
}
