{
  "id": "117936",
  "title": "Scientific Typographic Studies, Research?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm curious if there are any scientific studies on typography I can read for references? I'm doing paper on typography and would like more than just quotes and examples showing why something just works. Having some scientific facts would be helpful as well rather than just what we all have learned and can instinctively all agree works best for legibility and readability.\n\n",
  "author": "pers0n",
  "time": "13 Jul 2014 — 8:03pm",
  "uid": "47393",
  "comments": [
    {
      "time": "14 Jul 2014 — 7:27am",
      "content": "See the links in this article, particularly the one titled \"50 empirical studies for his master's thesis\":\n\n[http://theweek.com/article/index/245632/how-typeface-influences-the-way-...](http://web.archive.org/web/20150418104400/http:/theweek.com/article/index/245632/how-typeface-influences-the-way-we-read-and-think \"http://theweek.com/article/index/245632/how-typeface-influences-the-way-we-read-and-think\")\n\n"
    },
    {
      "time": "14 Jul 2014 — 12:56pm",
      "content": "There have been no exceptional studies concerning readability.\n\nhhp\n\n"
    },
    {
      "time": "14 Jul 2014 — 9:29pm",
      "content": "> Having some scientific facts would be helpful as well rather than just what we all have learned and can instinctively all agree works best for legibility and readability?\n\nThe problem here is what gets included the terms \"readability\" and \"legibility.\" Most scientific studies make assumptions using simplified meanings of those terms that most typographers -- or even lay people -- would not accept. (Spend a year reading W.V.O. Quine, or take my word for it. Best would be read Quine...)\n\nYou could, for example, do a study showing standard deviation in (1) comprehension and (2) speed, for reading a document set in two particular typefaces -- though even that is tricky -- but the sample size would be tremendous to draw any generally useful data. To make such a study based on a \\*supposed\\* single variable (say, serif versus sans serif) would be so full of flaws no one should accept it, even if the number of <cite>people</cite> taking the test approached the number needed to get useful standard deviation numbers. The answer would be valid only for the two typefaces selected for the test.\n\n\\* \\* \\*\n\nWhile not exactly a scientific issue, you can see a parallel with, say, the (1) philosophy of aesthetics and (2) art. Even were it possible to come up with a set of principles to define \"what art is,\" (which would satisfy #1) that's not to say you have a decision procedure -- it will not answer the question \"is <cite>this</cite> a work of art\" (i.e., #2).\n\nTo put the matter another way, a useful scientific theory is capable of prediction. It may well do so outside it's data set (in fact, it must to be predictive). The data is the constraint -- it doesn't matter how well something predicts, if any empirical data conflicts, the theory is wrong (of course, that leads many to start \"explaining\" exceptions). Actually, the second constraint is it's predictive power. If you really have an answer, the model should predict how to construct a typeface that is either easier to read, or easier to comprehend (I'm not going to assume the two are the same).\n\n"
    },
    {
      "time": "15 Jul 2014 — 12:35am",
      "content": "What about social science and the humanities? Any interesting academic works on typography in art theory, sociology, semiotics, gender studies, rhetoric/communication studies, post-structural theory?\n\n(Google turns up stuff like [this rhetorics study](http://web.archive.org/web/20150418104400/http:/www.ingentaconnect.com/content/stc/tc/2003/00000050/00000002/art00007), [this semiotics study](http://web.archive.org/web/20150418104400/http:/www.ingentaconnect.com/content/jbp/idj/2006/00000014/00000002/art00006) and this [this book of philosophy/posststructural theory](http://web.archive.org/web/20150418104400/http:/www.google.se/books?hl=en&lr=&id=PiYl-AbiFHsC&oi=fnd&pg=PA1&dq=typography&ots=MYJ1Fjh7cL&sig=ot_uzeSPirsrli_7eWwlTfBH8mQ&redir_esc=y#v=onepage&q=typography&f=false). No idea about the quality.)\n\n"
    },
    {
      "time": "15 Jul 2014 — 4:44am",
      "content": "The problem with most studies on legibility is that they only tell something about typography and nothing about legibility, let alone typeface design. In many of the scientific studies I read, the influence of typography (poor relationship of type size, line length and line feed, typefaces tested at the same body size but with x-heights that differ considerably, badly printed or photo-copied samples, low-res screens, glossy paper etc.) was much bigger that the differences between the typefaces tested. Many other strange assumptions of scientists about typeface design contribute to results that are not valuable to typeface design, such as ‘we tested Courier in order to be able to say something about the influence of serifs on legibility’ or ‘we tested Arial because it is a standard’.\n\nSome of the studies of which I think they have been done ‘good’ are those done by Dirk Wendt, Chuck Bigelow, Ann Bessemans, Nadine Chahine, Sofie Beier and Kevin Larson. But one has to take into account that in some cases it is hard to ‘implement’ the results into typeface design.\n\n"
    },
    {
      "time": "15 Jul 2014 — 5:30am",
      "content": "‘While You're Reading’ by Gerard Unger is a good read, it refers to many of the problems as they occur when scientists do research on legibility while having poor knowledge in the field of typeface design and/or typography. ‘Reading Letters’ by Sofie Beier is another good one, she tries to link scientific results to typeface design issues.\n\n"
    },
    {
      "time": "15 Jul 2014 — 11:02am",
      "content": "Scientiﬁc reading research to better understand the physiological process—great.\n\nBut science cannot even provide a disprovable theory that sans can be read more quickly than serif (or vice versa).\n\nScience cannot tell you which layout, setting and typeface would be best for a particular job, that is up to the typographer.\n\n"
    },
    {
      "time": "15 Jul 2014 — 1:31pm",
      "content": "Since isn't answers, it is guides. Don't ignore them.\n\nFor example science has guided me to believe that serifs help immersive reading.\n\nhhp\n\n"
    },
    {
      "time": "15 Jul 2014 — 4:30pm",
      "content": "\"But science cannot even provide a disprovable theory that sans can be read more quickly than serif (or vice versa).\"\n\nCan't it, or hasn't it? It seems this one would be easy enough to test.\n\n"
    },
    {
      "time": "15 Jul 2014 — 9:47pm",
      "content": "> Can't it, or hasn't it? It seems this one would be easy enough to test.\n\nYou think some of the creative sorts found here can't come up with a sans (or a serif) that's hard to read? Hell, even I can do that. If you grant that, then you'll have to grant it isn't simply a matter of sans versus serif.\n\n"
    },
    {
      "time": "16 Jul 2014 — 6:55am",
      "content": "> You think some of the creative sorts found here can't come up with a sans (or a serif) that's hard to read?\n\nHow is that going to help? I was thinking to have professional type designers select 5 sans typefaces they think are perfect for readability, 5 popular ones which are supposed to perform well and 5 popular ones with questionable readability and do the same for serif and have large control groups read a random page (not the same text) in each typeface and time the speed at which they're able to read the page. If the results of such a test would be all over the place then the conclusion would probably be that the design of the typeface is of secondary importance to the typographic setting. I strongly suspect however that not only will we see different results for each of the 3 groups per sans and serif, but we will see different results between sans and serif as well. With such a test I suspect we will have a great indication of what will work best. Whether a disprovable theory can be proposed on why one performs better than the other, I don't know. However at least we will be able to say statistically one will perform better than the other. That seems a lot more useful than our personal speculations and anecdotal evidence which is often circumstantial.\n\nI don't have the resources to perform a test like this. Do you?\n\n"
    },
    {
      "time": "16 Jul 2014 — 6:59am",
      "content": "The biggest problem with readability testing, which to me is what has invalidated virtually all the results we've seen, is that the testing conditions preclude true immersion. It's like when you ask somebody to breathe normally – it can never work.\n\nhhp\n\n"
    },
    {
      "time": "16 Jul 2014 — 7:24am",
      "content": "> It's like when you ask somebody to breathe normally – it can never work.\n\nNo, but you can provide a context in which the person would breathe normally naturally. You can perform these kind of tests without explaining what you're actually doing. Use control groups and protect the test. Tell the testers you're studying reading speed and tell them they will be tested for accuracy later so the quality of their reading doesn't decrease as they desperately try to perform better.\n\n"
    },
    {
      "time": "16 Jul 2014 — 7:32am",
      "content": "Yes, it's not impossible, but difficult, and not yet attempted AFAIK.\n\nhhp\n\n"
    },
    {
      "time": "16 Jul 2014 — 11:00am",
      "content": "If you are seriously interested in this topic, you should start by buying and reading Sofie Beier’s book on the subject.\n\n[http://www.amazon.com/Reading-Letters-Legibility-Sofie-Beier/dp/9063692714](http://web.archive.org/web/20150418104400/http:/www.amazon.com/Reading-Letters-Legibility-Sofie-Beier/dp/9063692714 \"http://www.amazon.com/Reading-Letters-Legibility-Sofie-Beier/dp/9063692714\")\n\n"
    },
    {
      "time": "16 Jul 2014 — 2:19pm",
      "content": "Looks interesting. I put it on my wishlist.\n\n"
    },
    {
      "time": "23 Jul 2014 — 12:24am",
      "content": "I think one big factor is that graphic designers have an interest in not accepting science and poking holes in it, as it means that the average citizen can do his own research and act on it and opens the designer up to being proven wrong (among other reasons). Throughout history, you see the same appeals to something being an art that science can't hope to understand from medicine to architecture, but then researchers find the answers. Hell, even jewelers, a purely aesthetic trade, have been overrun by engineers who have discovered ways to maximize the brightness of a stone. Recently, therapists (who, unlike actual psychiatrists, are barely screened before putting up a shingle) have been fighting monumentally against the idea that they should be basing their practice off of contemporary psychological research rather than a pop culture idea of what Freud said. For a good example of idiotic pushback in this very thread, look no further than the claim that you can't get somebody to read something without priming him when that's a problem that researchers solve constantly by putting the actual research in the prepwork. You don't even need to set up false research as a cover in this case, as you could just print out your consent form in whatever typeface you want and then test their comprehension of the consent form.\n\nIt is difficult to get a man to understand something, when his salary depends upon his not understanding it.\n\n"
    },
    {
      "time": "23 Jul 2014 — 10:20am",
      "content": "While there is some crossover between art and graphic design, in general they are very different occupations with many differences, including their basic goals (for art its self-expression, for graphic design it's communicating a message on behalf of a client).\n\nAnd I've known many designers who were interested in design research, including some who conducted research and had it published.\n\nI agree that a client might occasionally mention some design research to reject your concept. I've seen it happen.\n\nIf you have a good concept and a reasonable client, you might be able to change their mind. But if the client is unreasonable, you finish the job, cash the check, and never work for them again.\n\n"
    },
    {
      "time": "23 Jul 2014 — 10:20am",
      "content": "Scientists are not without self-interest, as they attempt to expand their hardness into soft domains. That, after all, is the purpose of science. Marketers have been trying to reduce advertising to a science since the days of Starch, but the target is always moving and the old adage remains true: you can’t test creative.\n\n"
    },
    {
      "time": "23 Jul 2014 — 1:02pm",
      "content": "But a designer who avoids science is merely an artist.\n\nhhp\n\n"
    },
    {
      "time": "23 Jul 2014 — 2:01pm",
      "content": "Nick I was thinking more of information design rather than the world of advertising agencies.\n\n"
    },
    {
      "time": "30 Jul 2014 — 10:41am",
      "content": "Legibility is much easier to measure than readability, but I thought one successful test of readability, by measuring how often someone blinks while reading, was reported in _Typographical Printing-Surfaces_ by Legros and Grant.\n\n"
    },
    {
      "time": "30 Jul 2014 — 11:24am",
      "content": "<cite>But a designer who avoids science is merely an artist.</cite>  \nAlthough I think I know what you mean, I find this statement to be very wrong. I wouldn't want to imply that some artists are just incompetent designers (which is what a designer without science could be perceived to be), or that incompetent designers are artists. I also wouldn't want to imply that a designer who doesn't avoid science is more than \"merely an artist\". And lastly, \"merely an artist\" seems to imply artists don't follow science. I have to admit a lot more liberties are taken in art than in design, but good art should still follow the same or similar guidelines as in graphic design.\n\n"
    },
    {
      "time": "30 Jul 2014 — 1:21pm",
      "content": "If this helps:  \nThere are no pure artists or designers; an individual is always somewhere in between.\n\nhhp\n\n"
    },
    {
      "time": "30 Jul 2014 — 3:24pm",
      "content": "I have a friend who does oil painting in his spare time. He pays for it himself, choses the subjects, paints them to his own satisfaction, and doesn't care what anyone else thinks. I don't see how it could be a purer process.\n\n"
    },
    {
      "time": "30 Jul 2014 — 3:28pm",
      "content": "He says he doesn't care. But he's human.  \nThat said, this case could be extremely close to pure art. Which is very rare.\n\nhhp\n\n"
    },
    {
      "time": "30 Jul 2014 — 3:47pm",
      "content": "<cite>There are no pure artists or designers; an individual is always somewhere in between.</cite>  \nI think that's a different consideration, but you're right nevertheless.\n\n<cite>I don't see how it could be a purer process.</cite>  \nThat may be, but even if his whole process is intuitive and subconscious, he will still consider composition, style, contrast, color (contrast) etc. Even in its purest form, an artist will follow many of the same underlying principles of (graphic) design. To some extent art is design and design is art.\n\n"
    },
    {
      "time": "30 Jul 2014 — 5:35pm",
      "content": "\\> an artist will follow many of the same underlying principles\n\nI agree. Both artists and designers, in general, use similar principles based on how people react to different colors, styles, etc.\n\nTo me the main difference is their goals. For artists it's generally self-expression. For designers it's to communicate info on behalf of a client.\n\n"
    },
    {
      "time": "30 Jul 2014 — 8:19pm",
      "content": "<cite>For artists it's generally self-expression. For designers it's to communicate info on behalf of a client.</cite>  \nVery true. An artist can take a lot of liberties; as long as it looks good or even when it speaks to you in a different way than aesthetically, it's art. When graphic design fails to communicate, it's just bad design. It's very hard to even see such a failed attempt at graphic design as art because the primary goals of art and design are very different.\n\n"
    },
    {
      "time": "31 Jul 2014 — 6:00am",
      "content": "In addition to artists, there are craftsmen who are not engineers or scientists.\n\n"
    }
  ]
}
