{
  "id": "117954",
  "title": "Feedback for (first) book design",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hi,\n\nDisclaimer: I have no formal education in arts or typography, or anything related :-) I'm noodling on the design for a novel. The paper is 6in by 9in and the cover art was given. There are also illustrations for each chapter (which always open on the recto page), which I've used to open a chapter; the illustration covers the whole page to give it enough room.\n\nI'm looking for all sorts of feedbacks, please. Things you like, you don't like, I shouldn't do, I should do better, I did well. Anything that'll make the book better and help me understand book design and typography better.\n\nThe PDF is [here](http://web.archive.org/web/20150317162401/http:/savage.light-speed.de/cry-ma-ma.pdf). It contains the cover and front matter, the complete first chapter, and some of the back matter. I hope that's enough to give you a feel for the book...\n\nThank you :) Any comment is appreciated!\n\n",
  "author": "_savage",
  "time": "14 Jul 2014 — 2:12pm",
  "uid": "217867",
  "comments": [
    {
      "time": "15 Jul 2014 — 11:47am",
      "content": "Jens, my level of expertise in designing novels is similar to yours, but I'll comment anyway.\n\nI'm assuming you are designing for print. That blue text in the front and back matter should be changed to standard black. (In the back of the book, the blue ink is just a name.)\n\nPoetry: To my eye the poetry in the text has too much room above and below. But I don't really know what the rule here is.\n\nMargin: I would increase your gutter margin a little and decrease the outer margin by the same amount, maybe one tenth to one-eighth of an inch. I think that keeping your text away from the gutter will make each page look more elegant. I am not a fan of designers who say you should consider the whole open page as the art object. I think you need white space on each side of each page.\n\nCover: I realize you were given this. But if this book is marketed and sold on the internet, most people will be seeing the cover at postage stamp size, on Amazon for instance. Make sure everybody is cool with how the cover looks at this size. No surprises.\n\nCopyright: In the U.S. I see the year after the copyright symbol, not after the name. You are probably covered either way. But you do need a year for Kathryn's copyright, so just put 2014 in there somewhere.\n\nCredits: I would move the copyright info to the top of the page and give everyone complete credit. This would also clarify everything. Something like this:  \n COVER CREDITS  \n Cover Design by Aileen Shih, website.com  \n Cover Art \"Magic Lady\" by Kathrynxxxx, website.com  \n Cover Font1 Name by Font Designer, website.com  \n Cover Font2 Name by Font Designer, website.com  \n INTERIOR CREDIT  \n Book Design by Jens Trӧger, website.com  \n Art by Kathrynxxx, website.com  \n Text Font Name by Font Designer, website  \n set at 10.5/13  \n Chapter Font Name by Font Designer, website\n\nSmall Caps: Maybe \"TIN SHED\" should be in small caps. I guess it depends on how big the sign is.\n\nStuff I don't know about: Check with the printer. Do pages with full art need to have a bleed submitted in the PDF?\n\n"
    }
  ]
}
