{
  "id": "117976",
  "title": "Monotype buys FontShop, FontFont and Erik's fonts.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is this something good?\n\n[http://fontfeed.com/archives/fontshop-joins-monotype-2/](http://web.archive.org/web/20150123081733/http:/fontfeed.com/archives/fontshop-joins-monotype-2/ \"http://fontfeed.com/archives/fontshop-joins-monotype-2/\")\n\n",
  "author": "rs_donsata",
  "time": "15 Jul 2014 — 6:18am",
  "uid": "1530",
  "comments": [
    {
      "time": "15 Jul 2014 — 6:46am",
      "content": "oh no\n\n"
    },
    {
      "time": "15 Jul 2014 — 6:49am",
      "content": "Bleedin'ell. Are regulators allowing this?\n\n"
    },
    {
      "time": "15 Jul 2014 — 6:58am",
      "content": "Surprising, to say the least.\n\n"
    },
    {
      "time": "15 Jul 2014 — 7:05am",
      "content": "[http://typophile.com/node/117974](http://web.archive.org/web/20150123081733/http:/typophile.com/node/117974 \"http://typophile.com/node/117974\")\n\n"
    },
    {
      "time": "15 Jul 2014 — 7:41am",
      "content": "At least they were considered worth buying.\n\n"
    },
    {
      "time": "15 Jul 2014 — 8:07am",
      "content": "The image I have of Monotype in the last 25 years or so is of the blandest type company, living of the royalties of a badly digitized library and bumping out remakes of their old bestseller now and then. FontShop on the other hand seemed like the most exciting company in the graphics world.\n\n"
    },
    {
      "time": "15 Jul 2014 — 8:08am",
      "content": "Sometimes when a person reaches retirement age, they get tired of the daily toil and just want to enjoy what life they have left. If at that point, someone offers him a huge some of money, he may feel very tempted to take it and relieve himself of all burdens.\n\n"
    },
    {
      "time": "15 Jul 2014 — 8:57am",
      "content": "For a user of type, it is very bad news. The \"new\" Monotype seems to just be in the business for the money. Without a further fee, FontFont allowed embedding of fonts in ebooks of various sorts, as long as the fonts were properly obfuscated. I imagine that will end under Monotype.\n\nIt doesn't affect me as a typesetter -- we don't pay those bills -- but I imagine even more of my customers will say \"Adobe only.\" It's already a trend in bookwork.\n\n"
    },
    {
      "time": "15 Jul 2014 — 9:18am",
      "content": "However, Erik Spiekermann will be working for Monotype. So it doesn't look as though he's retiring.\n\nIf they just take the fonts, put them into their library under their usual license conditions, and basically make the Font Shop name disappear, that would be bad. But then, except for eliminating competition, they wouldn't get much value for their money.\n\nI thought the prefix FF on a font name sounded familiar, though, from a discussion I recently participated in. FontFont makes some of the most expensive fonts around. And since that didn't result in the company's immediate collapse to derisory laughter, that means they also made some of the most desirable and sought-after typefaces around.\n\nSo even the rights to the font collection _are_ something of value to Monotype.\n\nIf they've been living off the royalties of famous typefaces from their past that they couldn't even afford to properly digitize... then, while they still had enough money to buy FontFont, it is now _obvious_ why they did so. In order to survive into the future before people decide to just use Bitstream or other lookalikes and alternates to their classics.\n\nBut the rights to a static collection of the world's finest typefaces would just be a stopgap.\n\nInstead, their goal (and will they realize that goal - which would be good news - or will they fail horribly - which would be bad news) is presumably - since not all the FontFont typefaces are the work of a single font designer, after all - is to capture and continue the magic of FontShop, and to **keep on** producing new typefaces that will be among the most desirable and sought after.\n\nIn other words, except for the size of the bank balances involved, and thus the direction in which money changed hands, to have things end up as if FontShop bought Monotype instead of the other way around.\n\nIn that, I think type lovers should wish them good luck. Given the history of corporate acquisitions in general, they'll need it.\n\n"
    },
    {
      "time": "15 Jul 2014 — 9:55am",
      "content": "\"However, Erik Spiekermann will be working for Monotype. So it doesn't look as though he's retiring.\"\n\nThis is just speculation but what does \"working for Monotype\" mean? This may have just been a way to spread out his tax burden and spread out Monotype's upfront expenditure. Perhaps Erik has minimal duties but collects a big salary as continuing payment for FontFont? I don't really know but PR spin can be operating here.\n\n"
    },
    {
      "time": "15 Jul 2014 — 11:34am",
      "content": "Erik Spiekermann will ‘work’ for Monotype as a consultant, says the press release.\n\nOTOH: it is not clear from the information provided if the transfer of Spiekermann’s IP (for his dozen or so FF-typefamilies) is included in the payment — that would make for a very favorable purchase by MT.  \nI guess not, so how much has Erik got for that? Just wondering… : )\n\nAnd then: if the press release is to be believed FSI etcetera had a turnaround of about 9 million USD with a (net?) profit of around 1.5 million. MT is paying (in installments, I guess) 13 million, eg about 9 times profit. Seems like a good deal for them.\n\n"
    },
    {
      "time": "15 Jul 2014 — 12:06pm",
      "content": "Quadibloc:\n\nI don't believe you work in this industry. You just theorize, right? Usually I ignore your posts. (By the way, Monotype owns Bitstream... and Linotype... and a bunch of the others, and distribution channels. Go look it up before theorizing.)\n\nWhat Monotype gets with the FontFont library: when a font is used for an ebook, Monotype charges money \\*each damn time\\* a new book is issued using their fonts. Seem to remember it was $25, or something like that. But suppose it's only $15.00.\n\nSo you publish a book. You now owe Monotype $15 (or whatever) for the roman, $15 for the italic, etc. If you use a different display font, more money. Not a one-time fee. Nor did Monotype do any work for this money, they just bought the (font) software from someone else, and started charging differently. Sensible thing is to not use their software. That's where fears of monopoly come in.\n\nIt could easily get to be $150 for a single book, I've seen that. Now, that's just about the manufacturing cost of an ePUB, starting from a print edition. For the publisher, that means costs just doubled. And you're being squeezed by Amazon... The world will not be a better place if Amazon becomes the only publisher. (OK. I'll allow that's just my theory)\n\nI'm all for a BMI/ASCAAP use fee for fonts. But if you remember, that fee wasn't so high, and everybody (song writer, band, distributor, etc.) got a cut. Not just the fancy suit who bought the rights.\n\nA Monotype slick sales release:\n\n> The Monotype Imaging eBook Font License provides the necessary licensing rights to embed fonts into eBook products for commercial distribution. The license is designed to be easy to manage and cost-effective, with three options available: per unit, paid-up for each title, and an annual license fee. The per-unit option takes into consideration the early market nature of eBooks where publishers may not achieve significant revenues until this market ramps up.\n\nand from a frustrated user...\n\n> Monotype Imaging (typography) who are the publishers of Bookman Old Style (which is the font I originally wanted to use), as well as Times New Roman, Arial and Courier and according to them, if I want to use their font in my ebook, I would have to purchase a license which costs $200 for each year that I sell or distribute (for free) my book to the public. Here is what their email said: \"The cost would be $200 per year. Although the font comes with your operating system, it wasn't licensed to be embedded in an ebook.\"\n"
    },
    {
      "time": "15 Jul 2014 — 12:15pm",
      "content": "\"and everybody (song writer, band, distributor, etc.) got a cut. \"\n\nThe BMI model was notoriously unfair in the share it kept. Only huge stars got better deals. The Beatles were fed up with the whole mess and went out and founded Apple Records.\n\n"
    },
    {
      "time": "15 Jul 2014 — 12:29pm",
      "content": "Hey, I'm offering a model, not a roadmap. You're saying it's better if the font designer gets nothing? OK, no skin off my noise, I don't design fonts.\n\n"
    },
    {
      "time": "15 Jul 2014 — 12:35pm",
      "content": "I am not saying \"better if the type designer gets nothing.\" I am saying, who gets to decide how much each gets?\n\n"
    },
    {
      "time": "15 Jul 2014 — 12:59pm",
      "content": "Sorry, enough with the snide remarks. What I personally would like to see is the independents band together and offer a license that would compete, more or less, with Adobe. They would leave Monotype for the highrollers who want to sell madam a good lay (Chris, you're probably old enough to remember Philip Wylie's <cite>Generation of Vipers</cite>). For a while, it looked like Village would do that. I even bought Merlo from both Village and Feliciano, to support both.\n\nMark my words, it should come to that. The book publishers need to buckle down and work together to beat off Amazon, as do the small type designers with their valuable works. If it doesn't come to that, it takes no genius to see where we'll end up.\n\nEdit: The license needs to be simple, and easy to use. I happen to be friends with the head of a publishing operation, which in the past year went \"Adobe only.\" When he was over for dinner one night, I asked him why he had directed the production department to do that. He replied that he hadn't. The only directive was to get & stay legal. It was the complexity of managing all the fonts & licenses that drove the production manager to say \"Adobe only.\"\n\nSo bear that in mind -- not only full Unicode compliance, but a common EULA that's easy to comply with. You may think they're buying your art; they think they're buying a tool.\n\n"
    },
    {
      "time": "15 Jul 2014 — 1:25pm",
      "content": "I am well old enough to remember Wylie's book ;-)\n\n"
    },
    {
      "time": "15 Jul 2014 — 2:35pm",
      "content": " ![](http://web.archive.org/web/20150123081733im_/http:/typophile.com/files/spiekerman_4661.png)\n\n"
    },
    {
      "time": "15 Jul 2014 — 3:07pm",
      "content": "<cite>The book publishers need to buckle down and work together to beat off Amazon</cite>\n\nThey _tried_ that, which led to an antitrust injunction against Apple that gave them the monopoly power they're now using against Hachette.\n\n<cite>By the way, Monotype owns Bitstream... and Linotype...</cite>\n\nI knew they owned Linotype. They don't own the American Monotype that is instead owned by a small independent, and apparently they don't own Adobe yet.\n\nI definitely did not know about Bitstream - I suppose that's _why_ Bitstream is now reformed and responsible, and won't devalue fonts by deals like that with Corel any longer.\n\nAs for the frustrated user... clearly only one solution is left. Google Web Fonts.\n\nSadly, the creators of typefaces - like the creators of music - are the _first_ casualties of a war between middlemen who want to make the creative product unaffordable without much of the profits going to the creators... and the consumers of the creative product.\n\nGiven what had been written in this thread about Monotype, it seemed that it was Monotype that was old and tired, not Erik Spiekermann, and thus I characterized their purchase of FontFont as being about survival for them. Their purchase of Linotype had just been a natural merging of twins - both halves of Times Roman - and Bitstream, with its cheap imitations, was a threatening competitor to get rid of.\n\nIf Monotype reinvents itself, and makes very good typefaces, which is just what the purchase of FontFont might lead to, then it's hard for me to criticize it for charging high prices for them. As for the awkwardness of embedding fonts in digital documents... it is frustrating, but I blame that more on the lack of good DRM and the presence of piracy - it's done out of _fear_, not greed.\n\n"
    },
    {
      "time": "15 Jul 2014 — 3:29pm",
      "content": "[http://typophile.com/node/77045](http://web.archive.org/web/20150123081733/http:/typophile.com/node/77045 \"http://typophile.com/node/77045\")\n\n"
    },
    {
      "time": "15 Jul 2014 — 3:42pm",
      "content": "> I blame that more on the lack of good DRM and the presence of piracy - it's done out of fear, not greed.\n\nI suspect we don't agree on anything. I'm not much interested in fuel for arguments, which is what passes for discussion when both have already made up their minds.\n\n"
    },
    {
      "time": "15 Jul 2014 — 4:53pm",
      "content": "> I blame that more on the lack of good DRM and the presence of piracy - it's done out of fear, not greed.\n\nThat doesn't seem likely to me.\n\n"
    },
    {
      "time": "15 Jul 2014 — 7:25pm",
      "content": "> a common EULA that's easy to comply with\n\nI can certainly appreciate how that would help attract buyers with insufficient patience/desire to read and consider a EULA, but there's something lost in such homogeneity.\n\nhhp\n\n"
    },
    {
      "time": "15 Jul 2014 — 8:43pm",
      "content": "> I can certainly appreciate how that would help attract buyers with insufficient patience/desire to read and consider a EULA, but there's something lost in such homogeneity.\n\nWhat's your model here? You're trying to sell a product, but you want to make it harder on the buyer? You think buyers are queuing up, mouths open in awe, just to have someones fonts?\n\nThat's another misunderstanding -- you think you're selling art, but that's not what they're buying, be it art or no. Where do you think \"Adobe only\" comes from? It's not because Adobe has the world's best fonts, it's because they make it easy to get on with things.\n\nYour choice, of course.\n\n"
    },
    {
      "time": "15 Jul 2014 — 8:51pm",
      "content": "My guess is that the vast majority of purchasers never read a EULA at all, just as they don't read software terms & conditions when they buy or update an app. Exceptions might be 1) there's a prominent warning of restrictions on the purchase page, or 2) it's purchased by a company that has someone in charge of such things.\n\n"
    },
    {
      "time": "15 Jul 2014 — 8:54pm",
      "content": "I don't want to make it harder on the buyer, but I think it's fair to say that the smaller the foundry the more a EULA can vary. Because we're humans too, and we want different things out of life, not just more money.\n\n\"Adobe Only\" comes from a combination of Adobe's worthiness (for one thing I like their avoidance of the no-mod clause too) but also a \"Whatever!\" attitude among some customers, who don't see the rich expressive variance of fonts and/or are too lazy to read EULAs. I for one am not going to give up too much, because of two old maxims: you can't please everybody; and you can't buy happiness. I'm not a prostitute.\n\nBTW some type designers do think of themselves too much as artists, but I'm not even remotely one of them.\n\nhhp\n\n"
    },
    {
      "time": "15 Jul 2014 — 9:27pm",
      "content": "Note that it's the expense of getting permission to embed fonts in things like PDFs or on web sites that I was blaming on fear. The \"no mod clause\" is inexplicable and indefensible, I don't deny that.\n\nAnd I can understand now why Monotype Imaging is basically seen as the \"dark side\" of the font industry. That's sad, given their rich history, but given the existence of Adobe _and_ all the freeware fonts out there, I don't think that they will be able to go on like that forever.\n\nAh... speaking of non-type companies that sell type, ColArt International Holdings, which owns Reeves and Winsor and Newton, also owns Letraset. ... oh, no; Letraset sells Fontek fonts, and those are part of the Linotype library that Monotype owns, so that's one less competitor.\n\n"
    },
    {
      "time": "15 Jul 2014 — 9:41pm",
      "content": "I think you don't understand where 'Adobe only' decisions come from. They come from management, not (interior) designers. In case you hadn't noticed, book designers steal fonts. It's sort of OK in their view, after all, they're not actually setting the book, it's the <cite>typesetter</cite> that has to buy the font. (No, it's not OK in my view, but it surely happens.)\n\nRemember, it is perfectly possible to design a book without having any fonts at all. How it was done all through the 20th century. They were called layouts, and they were done with a pencil. What shows to the world is the printed product, so if the <cite>designer</cite> doesn't own the font, it doesn't really show.\n\nOK, time moves on, and some presses begin to set their own books in house. Now they must own the fonts, to stay legal. And the digital market opens up, which means the publisher may need a legal copy of a font, because the typesetter preparing the print edition isn't going to have a license for a digital edition, should such a license be needed. All this shows, you can't hide behind the typesetter.\n\nNow look at what everyone on typophile -- me too -- says when people ask questions about EULA's. We start with \"I'm not a lawyer, but...\" So, as times change and management begins to pay attention to licensing, you think they want to hire a lawyer each time some silly designer wants to use a new font? (if so, I've got some nice property in Arizona that might be beachfront property, just as soon as the big one drops California into the ocean. I'll give you a great deal on it.)\n\nAdobe has taken the time to make a EULA that doesn't need a lawyer. Their FAQ's map out, in plain terms, what they expect and what they allow. The EULA is also favorable to the user, but as big an issue, I think, is the clarity of it all.\n\nStrange as it may seem, I've occasionally had publishers question fonts I've selected in a design which are SIL open source fonts. They don't know what that means, at the management level. You have to reassure them, remembering (1) they don't want to hire a lawyer, and (2) they want to stay legal, and (3) they don't want to waste time on such matters.\n\nSo, suppose there was a standard EULA the smaller font publishers prepared and used in concert, which was as clear as the Adobe one. It would help if it was as permissive, esp. in the digital use arena. But if you wanted an extra $20 for digital license that was bought once only, I doubt that would kill the deal.\n\nNow do I think that will happen? No, I think the smaller font publishers will continue to draft their own long, long EULAs, and continue to struggle, and wonder why.\n\nOne last point: typefaces don't sell books. You <cite>might</cite> make an argument they sell authors, and publishers are interested in happy authors. At least, when an author sells well. But it's a stretch.\n\nApparently, what sells books, even academic books, is the cover.\n\nHow do I know? We just finished a small job for a publisher who was doing a \"strip and rebind.\" Never heard of that, but it sounded kinda kinky, so I asked. That's where you take a hardcover book, strip off the cover, rebind as a paperback, then sell it at the paperback price. \"Why,\" I said? Why not just offer the case-bound edition at a paperback price and save yourself the cost of all this? Apparently, that doesn't sell as well. The reading public -- buyers, don't you know -- really want the paperback cover. Also, apparently people who buy a paperback seems to think they're getting a better deal. Makes no sense to me, but they've got the data to back it up.\n\n"
    },
    {
      "time": "16 Jul 2014 — 2:21am",
      "content": "So sad to hear that Polytype has just become history …  \n [https://www.flickr.com/photos/albert-jan\\_pool/14664543601/](http://web.archive.org/web/20150123081733/https:/www.flickr.com/photos/albert-jan_pool/14664543601/ \"https://www.flickr.com/photos/albert-jan\\_pool/14664543601/\")\n\n"
    },
    {
      "time": "16 Jul 2014 — 7:19am",
      "content": "> I think you don't understand where 'Adobe only' decisions come from. They come from management, not (interior) designers.\n\nYou might speak from experience but I highly suspect this is a generalization. There are plenty of designers who are either too lazy to look further or stay with Adobe because they offer a nice service and likely everything the designer in question thinks he needs. Your statement will very likely be true when talking about big companies, but I think you're ignoring a large part of the design industry.\n\n> In case you hadn't noticed, book designers steal fonts. It's sort of OK in their view, after all, they're not actually setting the book, it's the typesetter that has to buy the font.\n\nI have to admit I'm not a book designer, but I have worked for several design studios and agencies and I've never heard of this practice. The companies I worked at may get fonts illegally to test them, but the typeface is then proposed to the client, who will decide whether to buy the license or have us look for cheaper alternatives. The costs go to the client, not the designer or typesetter (if you have to make a distinction at all).\n\nWhat do you mean with book designer and typesetter though? Aren't they the same these days? I mean, in this context I don't suspect this book designer only designed the cover but designed the interior as well. What then is the typesetter's job? And if I am a typesetter, why would I be buying licenses for the designer?\n\n> OK, time moves on, and some presses begin to set their own books in house.\n\nOkay, so you were talking of the old days. In the first paragraph you were strongly implying this is a contemporary practice.\n\n> The reading public -- buyers, don't you know -- really want the paperback cover.\n\nThat seems really strange to me. I really don't like paperbacks. I sometimes go for paperback if it's a lot cheaper, but if the price is right I will take the hardcover. Couldn't there be a different reason for why people may prefer paperback in the context you describe?\n\nI'm not necessarily disagreeing with the statements you made here as I lack experience in the industry to say much about management, contracts and all that, but I'm trying to understand. Your story doesn't seem entirely consistent or complete.\n\n"
    },
    {
      "time": "16 Jul 2014 — 11:33am",
      "content": "Hardcover vs paperback is simple economics. Hardcover is more expensive — a tad too for a lot of people, who wait for the paperback to be published (used to be the hardcover was published first and a paperback version months later; a practice that has all but disappeared now — economics once again, viz Martin’s statement).\n\nFor the publisher it makes sense to use unsold hardcovers to rebind as paperback (and even for a new paperback edition the printing plates of the hardcover would be used).  \nBonus: A rebound hardcover/paperback is far more solid than a normal paperback — that is usually held together with glue, although the practice of just glueing hardbacks instead of binding is spreading (are people that stupid? yes, they are.).\n\n"
    },
    {
      "time": "16 Jul 2014 — 2:33pm",
      "content": "I understand it's a matter of economics. What I don't understand however is that people wouldn't buy hardcover books if they're being offered at a paperback price. I guess people suppose that whatever the price of the hardcover is, the softcover will be cheaper. If I find a hardcover book at a good price I will certainly buy the hardcover book.\n\nSpeaking of which, I guess this is off-topic but some years ago I bought a special edition hardcover book for 120 euro which is now worth up to 1500 euro. If I had known I obviously would have bought a second copy. I suspect the more focus there will be on paperback books, the more the hardcover books will be looked for. Not by most of course, but the binding is what makes a book special. If I don't have the money I will get a paperback just to get access to the information within the book, but it's not something to be particularly proud of. When I'm done with school and I officially launch my career I think I will tend to buy hardcover only. People say books are going to disappear, but I don't think the luxury ones will. It might be that paperback is slowly being translated to the digital world, but even that I don't believe. In all likeliness the digital world just added another level to the hierarchy, underneath paperback.\n\nDo you think hardcover books are going to disappear or do you think the book industry has it so hard because another level has been added to the hierarchy? It could very well be that hardcover books are going to be for the rich, as the cost of producing one will probably increase as the market for it becomes smaller. and smaller.\n\n"
    },
    {
      "time": "16 Jul 2014 — 2:43pm",
      "content": "I'm sure printed books will be sold for many years, but here's a graph showing the rise of eBooks and decline of printed books.\n\n ![](http://web.archive.org/web/20150123081733im_/http:/typophile.com/files/sales-trends_6703.jpg)\n\n"
    },
    {
      "time": "16 Jul 2014 — 2:55pm",
      "content": "> What do you mean with book designer and typesetter though? Aren't they the same these days?\n\n????  \nDo you work in this industry? I do. As a typesetter.\n\n"
    },
    {
      "time": "16 Jul 2014 — 3:19pm",
      "content": "Charles, I'm starting to get annoyed by your responses. Just about every comment I've read from you contains at least a subtle insult. As I said, I don't necessarily disagree with you and I already mentioned I DON'T work in that industry and I want to know more. I asked you to elaborate. You haven't actually answered my questions.\n\nJames, that graph is interesting and it looks worrying on some level, but I have the feeling since eBooks are a new medium it takes a bit before it will stagnate. Once it does, perhaps books will have a come-back. I'm already getting tired of eBooks. Probably the rest of the world doesn't quite have enough of it yet, but it seems there are already trends of strong nostalgia for labor-intense methods of producing since mass produced products and digital products are often seen as dull and uninspiring.\n\n"
    },
    {
      "time": "16 Jul 2014 — 3:55pm",
      "content": "Martin Silvertant:\n\nYour questions seem to me to be put in the form of challenges. Not something I'm inclined to respond to. Secondly, when they are questions, it would take a book-length chapters to answer. Or so it seems to me, and an internet forum is a poor place to try give those kinds of replies.\n\n"
    },
    {
      "time": "16 Jul 2014 — 4:32pm",
      "content": "Martin, I like books too and used to work in a library, but as young folks grow up who are used to doing their reading on computers and tablets, the trend will continue. But even in the future when virtually all publishing is electronic, I'm sure some printed books will still be available from specialty publishers, small presses, etc.\n\n"
    },
    {
      "time": "16 Jul 2014 — 5:12pm",
      "content": "Charles is annoying because he considers Typophile enemy territory.\n\nhhp\n\n"
    },
    {
      "time": "16 Jul 2014 — 5:27pm",
      "content": "Charles, my questions are not challenges. Some arguments I deduce from logic, some are speculative and some are based on experience. I explained my experiences and in my experiences there is no distinction these days between a book designer and a typesetter. I never implied I'm always right, so when I'm not I do expect any of you guys to correct me and to inform me on the matter, rather than a response like \"Do you work in this industry? No, so shut your trap\". Your response just wasn't constructive at all. If you can only insult, don't comment. I noticed in older threads as well that you tend to be quite negative and I've seen you subtly insult people without any reason for it.\n\nAlso, how is an internet forum not the perfect place to discuss this? You're writing pages already. Just look at what you wrote on this post alone. Even a few short but sweet answers would have been much better than your response.\n\nThe one question I would really love to get an answer to doesn't require a long response at all. I don't mean to undermine your profession, but what does a typesetter do these days and how is this distinct from what a designer does? I'm of the opinion it's probably better to specialize in something rather than becoming a jack of all trades, master of none but in practice the graphic design profession is getting broader and broader. As such it's my understanding that a contemporary book designer is also a typographer (unless you're talking about the designer of the cover, but you implied the former). So with that in mind and with the experience I've had working at several design companies (including one run by one of Gerrit Noordzij's students) and never having stumbled upon a typesetter, I think it's a fair question.\n\nLook, I'm not angry and I don't require an apology. Just try to be more constructive.\n\n"
    },
    {
      "time": "16 Jul 2014 — 6:27pm",
      "content": "No, Hrant is known to look for my posts in order to try and annoy me.\n\nThe \"enemy,\" when there is one, are people who consider the type an end in itself, any further work with it is incidental. For example, when I get in a book to design and set, the things that go through my mind are never mentioned on typophile. But they are not trivial, given that a product has to result.\n\nFirst thing I want to know is who marketing is aiming the sale of the book at. Is it simply, say, a social scientist in that role only, or are they planning to broaden the advertising to include, say, historians? And if they're going to aim at both, likely we're getting toward a general audience. That will affect type choice.\n\nThen, I want to know production details. How many copies? Very short run, which I tend not to deal with, is 500 copies or under. That will invariably mean \"digital\" press (xerography). Short run is between, say, 750 and 5,000 copies. That will be an offset press, probably sheet-fed, but maybe web. Over 5,000 will be different kinds of printers; you can assume they'll have the capability to do whatever you want/need.\n\nWhy? Ah. Let's say 2,000 copies. Will it be split production (some cloth, some paper)? How many of each? if 250 cloth and 1,750 paper, you might be tempted to make compromises that won't hurt the paperback quite so much. If it's 1,000 - 1,000, the guys putting out the money for the cloth might be considered to deserve more attention. Certainly there will be numerically more of them. And just BTW, typical short-run web presses can handle only up to 6 x 9 trim, but most sheet-fed presses can go 6-1/8 by 9-1/4 trim. 5.5 by 8.5 has different issues, as do the smaller trims. All this will affect the margins, which will affect the measure.\n\nBut:\n\nShort-run printers in the states don't all have smythe-sewing capabilities. And the publisher probably hasn't picked the printer yet, so I have to assume a notch-bound cloth edition, which won't open quite as well as smythe-sewn. (One 21st century change is no publisher wants to take the extra time to have a printer send the book to a separate binder. They use to, no more.) Binding choices strongly affect the gutter margin. Moreover, if the paperback is to be perfect bound, 1/8-inch is chewed off the inside to break the folded signatures & open the paper for the glue. But if we're lucky, the paper will also be notch-bound. In any case, I need to know all this to do my job.\n\nWe're talking about up to a full pica difference in the needed gutter margin here, which affects the measure. Moreover, the publisher is just as apt to give a page count they require the book to make. Already in the \"metadata.\" And maybe some geek has assured them that, from the character count in the MS Word file, \"any good designer\" can predict book length to within 8 pages. But the geek never did that, just read about \"castoffs,\" though never did one. I have, it takes two days with paper manuscripts and a pencil. I can set a book faster than that. See below.\n\nIt's easier if there are no subheads, extracts, etc. White space eats up \"character count\" like crazy. And the notes, even though one or two points smaller with one or two points less leading, have a short paragraph length, so there are a lot more paragraphs per page. More paragraphs equals more white space -- assume each paragraph ends with half a line, on average. So, even though the note size & measure & leading might accommodate a 3200 character page, you'll likely get 2,800. Or less, depending on whether or not there are extracts in the notes. Or if the notes are substantial discussions of a subsidiary issue, rather than citation data only. The same thinking for bibliography, appendices, anything that isn't to be considered as straight text.\n\nAt this point, I've one, two, or three typefaces in mind. Most typefaces work best within a limited range of setting size, given the one-size-fits all masters from photocomp on. So I'll flow in all the text & rough-style it, to see how many pages were getting, and what compromises each typeface & setting size will bring.\n\nEtc. Etc. Etc.\n\nWelcome to bookwork -- or to bookwork that isn't coffee-table books, museum catalogs, etc.\n\n"
    },
    {
      "time": "16 Jul 2014 — 6:46pm",
      "content": "Martin Silvertant\n\nI never answered your question about the difference between a typesetter (compositor) and designer. To me, it is a level of detail. The things a designer are best at are at a different level than the things a compositor is best at.\n\nComposition is all about making compromises. Set a line looser, or hyphenate. Well, how bad is that hyphen point, not to a typographer, who's looking at black ribbons on a white background, but to someone reading the text. Do you allow \"strengthen\" to be hypheated (I don't, many designers would shudder with the loose line that results by taking \"strength\" down.) Do you make a line to banish a widow? Type gets looser. Or do you run the page short? What happens with those decision three pages later?\n\nWill the \\*designer\\* letterspace small caps depending on how many words are involved? Set the text \"Futon's Folly\" in small caps, as in a subhead. Now set \"She'll be coming 'round the mountain when she comes\" just the same. You'll need different letterspacing and word spacing to make the two look good. Will a designer take the time? Not in my experience. But it could be just the opposite... a matter of temperament, I suppose. There is always an element of \\*tradesman\\* in typesetting, almost never in design. Tradesmen will take the time. And the aforementioned element of willingness to make compromises, and not agonize over them.\n\nLook, I've written a chapter in Rich Hendel's new book, <cite>Aspects of Contemporary Book Design</cite>. Make your library buy a copy & read that, then get back to me.\n\n[http://www.uiowapress.org/books/2013-spring/aspects-contemporary-book-de...](http://web.archive.org/web/20150123081733/http:/www.uiowapress.org/books/2013-spring/aspects-contemporary-book-design.htm \"http://www.uiowapress.org/books/2013-spring/aspects-contemporary-book-design.htm\")\n\n"
    },
    {
      "time": "16 Jul 2014 — 7:00pm",
      "content": "I don't think it was ever stated that the claim that a lot of companies which produce printed matter have 'Adobe only' policies, due to the difficulty or expense of complying with the terms of Monotype's licenses was anything _but_ a generalization. Of course some publishers will prioritize using the exact typeface that meets their needs, and willingly pay whatever fees are required to be legal.\n\nI am no typesetter. What dismays me, though, is that desktop publishing programs these days are apparently worse tools for producing simple books and pamphlets than Microsoft Word - which is not a good tool for that purpose either.\n\nFrom the Michigan Terminal System, I'm used to FMT and Textform. Of course, no one will have heard of them, but basically they are tools like troff - except they were all-in-one programs, rather than following the Unix philosophy of using multiple small programs.\n\nOne has a plain text file containing body copy plus markup entered by hand. Edit the text document, and then run the program to print it out, in proportional spacing, flowed according to your instructions. And with styles - you could even have an introduction to each new chapter that was in single-column format while the rest of the book was double-column.\n\nIt _didn't_ include some of the unique and fancy features of TeX.\n\nFor the modern age, a program like that which would put its output into a WYSWIG desktop publishing program, rather than just directly printing it, so as to allow for fine touch-up such as changing letterspacing where required, would be needed. And it would necessarily have to handle UNICODE instead of just 8-bit characters.\n\nI'm surprised market demand hasn't led to such a program.\n\n"
    },
    {
      "time": "16 Jul 2014 — 7:28pm",
      "content": "Charles, in general I agree with your comments about designers/typesetters. Things that designers used to farm out —&nbsp;typesetting, scanning, trapping, etc —&nbsp;today are often done by the designer himself.\n\nSome designers get pretty good at those things, but someone who specializes in those things and does them 8 hours a day will usually do them much better.\n\n\\> Tradesmen will take the time\n\nOne of the advantages of being a specialist. Many designers (especially freelancers) find that much of their time is taken up with meetings, phone calls, emails, scheduling, billing, etc., and setting type in InDesign is done in a hurry.\n\n"
    },
    {
      "time": "16 Jul 2014 — 7:26pm",
      "content": "Charles, don't amplify your significance. Certainly not to me, not to Typophile, and even not to typography in general. I don't go looking for your posts to counter; you simply offer a lot to counter.\n\nhhp\n\n"
    },
    {
      "time": "16 Jul 2014 — 8:02pm",
      "content": "Hmmm. Seems I'm not alone. Or is this someone else?\n\n[http://www.ratemyteachers.com/hrant-papazian/1947186-t](http://web.archive.org/web/20150123081733/http:/www.ratemyteachers.com/hrant-papazian/1947186-t \"http://www.ratemyteachers.com/hrant-papazian/1947186-t\")\n\n"
    },
    {
      "time": "16 Jul 2014 — 8:16pm",
      "content": "Sorry, I refuse to stoop to your level.\n\nhhp\n\n"
    },
    {
      "time": "16 Jul 2014 — 8:23pm",
      "content": "Although I wasn't old enough to remember Generation of Vipers first coming out, later on I bought and read a second-hand copy; it said a lot of interesting things about the fifties.\n\nI am, however, rather surprised at using the comments of disgruntled students as part of a debating tactic. Without context, that proves little. There will be first-year students, at least, who will condemn a professor for expecting them to actually work in class... as an example.\n\nOf course, I do realize that Hrant _is_ a man of strong opinions. That, in itself, is likely to lead him to disagreeing with other people's opinions without having to engage in cyberstalking.\n\n"
    },
    {
      "time": "16 Jul 2014 — 8:25pm",
      "content": "I wouldn’t put too much credence in teacher rating websites.  \nWhen I was teaching, I found I could generally ﬁgure out which students had made which remark, especially those who had made derogatory comments, and they tended to be the worst students: not very bright, lazy and easily distracted.\n\n"
    },
    {
      "time": "16 Jul 2014 — 9:05pm",
      "content": "Oh, I don't know. I've taught too. Students do have an instinct about who's trying to help them. Papazian does seem to hunt people down just to attack them. Example: guy wants to do some text books, asks for help.\n\n[http://typophile.com/node/116507](http://web.archive.org/web/20150123081733/http:/typophile.com/node/116507 \"http://typophile.com/node/116507\")\n\nPapazian chimes in. If you take his post as his thinking on the matter, essentially he recommends the OP should just not set his textbooks, as there are no good fonts.\n\nMore realistically, he gets in an attack. But doesn't help the guy. One wonders why. He \\*could\\* have done both, but chose only to attack. I can go through typophile and find many, many similar examples. Not worth the trouble.\n\n"
    },
    {
      "time": "17 Jul 2014 — 2:25am",
      "content": "Yes, I suppose he could at _least_ have mentioned that most mathematical characters are available for Times Roman, if one wants to use a half-decent typeface instead of Computer Modern... one would just have to use a different tool for mathematical formulas. Microsoft Word has one.\n\nOr he could have mentioned AMS Euler - I wouldn't go that far out on a limb if I was setting a math textbook, but at least it's a 'good' typeface, being designed by the Real! Typographer! Hermann Zapf.\n\n(This isn't intended to be disparaging of Hermann Zapf, by the way, whose talents and significance I acknowledge. But concern about type quality does occasionally shade into type snobbery, for which I have little sympathy.)\n\nHowever, _that_ kind of helpful advice is of such a trite and obvious kind that I would not be surprised if he felt that he wasn't going to delay matters much by forbearing to supply it. There may not be, as far as I know, any _really_ respectable typefaces with a near-comprehensive selection of mathematical characters too, so indeed he might not have had any helpful advice he was not embarrassed to give.\n\nExcept he did warn the fellow to take the typographical advice of the TeX community with a grain of salt. That actually was genuinely informative and helpful advice, even if it was negative rather than positive.\n\n"
    }
  ]
}
