{
  "id": "117929",
  "title": "Favourite Microsoft system fonts",
  "forum": "Serif",
  "tags": [
    "century schoolbook",
    "favourite",
    "fonts",
    "Microsoft",
    "office",
    "Serif",
    "system",
    "Times New Roman",
    "windows"
  ],
  "content": "Hello everyone, I'm new here at Typophile.\n\nMicrosoft products (MS Windows & MS Office) come with a variety of serif fonts. If you were limited to use Microsoft serif fonts only (for printed text), which would be your favourites to use?\n\n ![](http://web.archive.org/web/20150317155301im_/http:/typophile.com/files/MS%20serif%20fonts_4575.PNG)\n\nI like Century Schoolbook, Goudy Old Style and Book Antiqua (Palatino Linotype has a wider line spacing by default).\n\nThank you.\n\n",
  "author": "rayzb92",
  "time": "13 Jul 2014 — 5:24am",
  "uid": "221456",
  "comments": [
    {
      "time": "13 Jul 2014 — 6:26am",
      "content": "Me, Georgia.  \nBut why this limit?\n\nhhp\n\n"
    },
    {
      "time": "13 Jul 2014 — 7:03am",
      "content": "Thank you. The limit is because I am asking about MS system fonts only. Fonts supplied with MS Windows and MS Office are the most common MS system fonts people use, I assume…\n\n"
    },
    {
      "time": "13 Jul 2014 — 1:00pm",
      "content": "Like Hrant, I choose Georgia. Matthew Carter has a remarkable ability to apply the master craftsman's touch to mass-produced workhorse typefaces. When I'm writing letters or reports that only have to look professional, not capital-D Designed, I always use Georgia. And when it's necessary for business reasons to work in PowerPoint, I prefer to use Georgia, because it'll look like a grownup did it, but it won't default to Courier on my client's screen.\n\n"
    },
    {
      "time": "13 Jul 2014 — 2:02pm",
      "content": "Georgia looks good. But don't you think Georgia is a bit too bold for print? It's an often heard criticism... Which line spacing do you use when using Georgia?\n\n"
    },
    {
      "time": "13 Jul 2014 — 3:29pm",
      "content": "_too bold for print_  \nIf I'm going to print something, I don't need to concern myself with whether my reader has the same fonts installed on the device they're reading on. Therefore, I don't need to limit myself to MS system fonts.  \nWhen I do use Georgia, I use leading about 1/4 of the point size (12/15, 24/30, etc ), if space permits.\n\n"
    },
    {
      "time": "13 Jul 2014 — 3:26pm",
      "content": "I prefer somewhat dark text fonts (both aesthetically and functionally) so to me that's a plus. :-) The linespacing of course depends on the line length; that said, due to its larger-than-average x-height, use a greater-than-usual linespacing.\n\nhhp\n\n"
    },
    {
      "time": "14 Jul 2014 — 3:46am",
      "content": "Valid points. Georgia does need a wider line spacing. Thank you guys.\n\n"
    }
  ]
}
