{
  "id": "118095",
  "title": "Would like some feedback on my logo design",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am currently studying Cert V in digital graphic design, online.  \nAs part of one of the assessments I had to design a logo for the Geelong Football Umpires' League and gather feedback on the design.  \nSo here is my design. Any feedback would be great.  \nThanks\n\n ![](http://web.archive.org/web/20150317211418im_/http:/typophile.com/files/logo2_5949.jpg)\n\n",
  "author": "hinewai",
  "time": "18 Jul 2014 — 11:08pm",
  "uid": "221593",
  "comments": [
    {
      "time": "19 Jul 2014 — 5:46am",
      "content": "A logo should always work in one colour, and at multiple sizes.  \nYour choice of fonts is very cartoon like.  \nThe whistle doesn't indicate what game the Geelong Football Umpires' actually umpire.  \nI would try to incorporate some aspect of the game.  \nAlso your whistle is very cartoonish.  \nUmpires are professional people who do a serious job.  \nYou need to use cleaner less frivolous fonts, and more stylish adult artwork.  \nWith less 'garish' colours. The cyan you've used is way too loud.\n\nI did a quick search in Google for 'umpire logos'\n\nThese were my favourites.\n\n ![](http://web.archive.org/web/20150317211418im_/http:/typophile.com/files/SEJ_UMPIRING_LOGO-1_6273.jpg)\n  \n\n ![](http://web.archive.org/web/20150317211418im_/http:/typophile.com/files/PBUC_400px_splash_4561.gif)\n\nand the football teams themselves seem to use an clean illustrative style, like these.\n\n ![](http://web.archive.org/web/20150317211418im_/http:/typophile.com/files/North_Melbourne_Football_Club_Logo_6109.png)\n  \n\n ![](http://web.archive.org/web/20150317211418im_/http:/typophile.com/files/url_5393.jpg)\n\nPerhaps you could develop something along a similar line so it fits in with the games overall branding style.\n\n"
    },
    {
      "time": "21 Jul 2014 — 9:13pm",
      "content": "Hi and thanks for your feed back. you have given me a lot to think about.  \nThe four lines that are in the circle of the whistle are meant to represent the game of AFL which are the goal post's used in the game, however unless you live in Australia you wouldn't know otherwise.  \nonce again thank you for your feedback and comments.\n\n"
    },
    {
      "time": "22 Jul 2014 — 12:13am",
      "content": " ![](http://web.archive.org/web/20150317211418im_/http:/typophile.com/files/Untitled-3_4420.jpg)\n\n"
    },
    {
      "time": "25 Jul 2014 — 7:41am",
      "content": "You've obviously rushed that, as it's not very well aligned.  \nThe typefaces should be the same weight or at least complimentary styles.  \nI also think for a Geelong football logo the font should have a stronger, bolder, more masculine feel.\n\nThe words Geelong follows (badly) the oval shape in a fan shape, where as the Football Association (also badly aligned with the curve of the ball) follows the vertical Arch shape.\n\nAlso the 4 lines are not equal distance from the out edge of the ball.  \nThis is very sloppy, and really shows a lack of care. In future look at every aspect of what you design.  \nAs a tip to see if it's balanced, you should also check it out in a mirror.\n\nI'd say you've still got a long way to go yet, but you can do it.\n\nWhat about a stylised whistle in outline, have you tried anything like that yet.\n\n ![](http://web.archive.org/web/20150317211418im_/http:/typophile.com/files/logo-02_6641.png)\n  \n\n ![](http://web.archive.org/web/20150317211418im_/http:/typophile.com/files/Screen%20shot%202014-07-24%20at%2009_5755.33.15.png)\n  \nOr do the umpires have any special clothing, or hand signals, or extra gear?\n\nHere's one you can have from me. It's got the whistle shape, the Gee, and the 4 football stripes. :)\n\n ![](http://web.archive.org/web/20150317211418im_/http:/typophile.com/files/Screen%20shot%202014-07-24%20at%2009_3734.37.15.png)\n  \n\n ![](http://web.archive.org/web/20150317211418im_/http:/typophile.com/files/Screen%20shot%202014-07-24%20at%2009_5248.38.47.png)\n\nor you could even do it in an oval shape.\n\n ![](http://web.archive.org/web/20150317211418im_/http:/typophile.com/files/Screen%20shot%202014-07-24%20at%2010_4302.12.23.png)\n\nor 3D\n\n ![](http://web.archive.org/web/20150317211418im_/http:/typophile.com/files/Screen%20shot%202014-07-24%20at%2009_4137.46.13.png)\n  \n\n ![](http://web.archive.org/web/20150317211418im_/http:/typophile.com/files/Screen%20shot%202014-07-24%20at%2010_5834.13.56.png)\n\n"
    }
  ]
}
