{
  "id": "118086",
  "title": "Need some feedback on logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "#design",
    "#fitness",
    "#gym",
    "#logo",
    "Logos / Corporate ID Design"
  ],
  "content": "Hi Typophile\n\nThis is my first post so please be honest and don't hold back. I've been approached by a entrepreneur who is building s string of 24 hour gyms in the Berkshire area for 18 plus the audience is for people who are your average Jo looking to get fit, to your pro weekend warrior who are fed up with high gym prices. The only terms were that it should look professional, clean, simple, bright and bold, oh and it must use florescent pink, blue, or green.\n\nSo I did my research and looked at competitors as one does and then I started sketching he liked the concepts but couldn't settle on one of them so he enlisted the help from another designer who would design it his way, after going through 9 iterations I did for him. Now I'm not saying my designs look amazing because they don't, they could do with a lot of work, critique and tweeking and the right font for starters, which I'm hoping I can get from here.\n\n[My initial design 1](http://web.archive.org/web/20150317194208/http:/imgur.com/XrdmaVa)\n\n[Design from another graphic designer](http://web.archive.org/web/20150317194208/http:/imgur.com/Pe5PB7K)\n\nAfter the other design I wanted to simplify it and use fonts that would be right for the audience, the more I look at it though the more I think the logo should be on one line.  \n [My counter design](http://web.archive.org/web/20150317194208/http:/imgur.com/VcNAvje)\n\nWhat do you think Typophile? If anyone has any critique, advice etc please let me know. The client has settled on pink and not using bevel now and understands why we need to make the logo simpler.\n\nThank you  \nRegards  \nBapps\n\n",
  "author": "Bapps",
  "time": "18 Jul 2014 — 2:53pm",
  "uid": "221588",
  "comments": [
    {
      "time": "18 Jul 2014 — 3:50pm",
      "content": "To me the only element among those examples with any good potential is that \"nu\" fusion symbol (the one that looks like a sideways \"s\").\n\nhhp\n\n"
    },
    {
      "time": "18 Jul 2014 — 5:12pm",
      "content": "If this gym is for both men and women, I'd avoid an all-pink design, it looks feminine.\n\nTo be honest none of the designs really stand out to me, partly because the logo is so generic. There's nothing about it that says \"gym\" to me.\n\n"
    },
    {
      "time": "18 Jul 2014 — 11:58pm",
      "content": "What's going to say \"gym\" though? Human bodies and lifting weights. It's so cliche that it might be a good idea to do something you might consider more generic, yet captivating. That sideways \"s\" might be a good start. I would try different shapes behind NU, different typefaces and definitely different colors if it's a unisex gym.\n\n"
    },
    {
      "time": "19 Jul 2014 — 1:05am",
      "content": "I hear you, it is a unisex gym.\n\n"
    },
    {
      "time": "19 Jul 2014 — 1:06am",
      "content": "Could I use blue with pink then?\n\n"
    },
    {
      "time": "19 Jul 2014 — 5:13am",
      "content": "_What's going to say \"gym\" though?_\n\n[Gym Source](http://web.archive.org/web/20150317194208/http:/www.gymsource.com/) makes their initials into a stylized barbell (although their name at the bottom is careless and generic).\n\nMaybe you could extend the sides of the **U** above the cap height and add dumbbell-shaped serifs. (Don't use a barbell. If you close the top it will read as NO GYM.)\n\n"
    },
    {
      "time": "19 Jul 2014 — 8:43am",
      "content": "I agree that weights, etc. are often used in gym logos, but this is a common problem in logo design. How do you design a logo without duplicating other logos?\n\nWith millions of logos in existence, it's hard to come up with anything that hasn't been used before, but you try to put a different twist on it, make it unique in some way.\n\n"
    },
    {
      "time": "8 Aug 2014 — 11:28am",
      "content": "I get the impression of a mobile app that allows you to communicate with other people who like the gym. The aesthetic is a bit dated too.\n\n"
    },
    {
      "time": "11 Aug 2014 — 5:35am",
      "content": "Pink is not a thoughtful choice for a mixed gym. Also, I would explore more appropriate fonts (these are too rigid for the purpose).\n\nIntegrating gym gear (dumbells or whatever) in the logo will look tacky. Besides many people who join a gym do it for using the treadmills, cross trainers or spinning classes. The macho image of dumbells may also give women a wrong impression of the gym identity. Is this a gym where people go to stay fit and healthy, or a \"no pain no gain\" bunker for hillbillies?\n\nI would keep the overall thing clean, simple and dynamic. And pink, seriously. If it was an exclusive gym on say Miami South Beach, the kind with a vallet, maybe some pink would work. Otherwise, it will probably look cheap. As it does now.\n\nKeep it simple:\n\n ![](http://web.archive.org/web/20150317194208im_/http:/typophile.com/files/Screen-Shot-2012-01-03-at-12_4648.09.41-PM.png)\n\n"
    },
    {
      "time": "11 Sep 2014 — 5:34am",
      "content": "I like the second designs very much . Change the colour pink if its unisex gym. if ita femalel gym pink will work.  \n design i like\n\n"
    }
  ]
}
