{
  "id": "118114",
  "title": "Logo evolution, other points of view welcome",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,  \nIve upgraded my site logo as the older one was 4 years old and didnt \"worked\" very well in white backgrounds.\n\nThe old one :\n\n ![](http://web.archive.org/web/20150317194327im_/http:/typophile.com/files/Autodtl-Logo_4028.png)\n  \nThe new one : \n ![](http://web.archive.org/web/20150317194327im_/http:/typophile.com/files/AutoDTL-Logo4_5533.png)\n  \nComments are welcome :) \n",
  "author": "reboot2c",
  "time": "20 Jul 2014 — 5:17am",
  "uid": "221583",
  "comments": [
    {
      "time": "20 Jul 2014 — 8:25am",
      "content": "The \"AutoDTL\" part is certainly an improvement. But frankly the super loose \"Car Care\" is pretty bad... Just switching it to all-caps would help. But what about nestling it into the opening between \"A\" and \"DTL\" at the top?\n\nhhp\n\n"
    },
    {
      "time": "20 Jul 2014 — 9:11am",
      "content": "Yes, \"Car Care\" is way too small and spaced out. All caps would help, and make it larger, but you may need to make the thick bar shorter, or center the words and put a line (or some other symbol) on either side of it within the bar to fill the space.\n\nAnd if the bar is in color, I would make the top part in color too. (Of course you'll also need a black-and-white version to use on photocopied documents, etc.)\n\n"
    },
    {
      "time": "21 Jul 2014 — 8:31am",
      "content": "At small sizes, the \"Car Care\" will simply disappear… In fact, it's so marginalized in this design, you have to ask if it's really necessary. \"AutoDTL\" would be a stronger mark standing on its own, and the brand name already signals the industry.\n\nI would also design the wordmark in 1 color first, and then supply different fills as potential looks. If it doesn't stand up as an outline, it simply won't last more than a few years. Look at how many fills Apple has applied to their mark. It's been everything from a shiny piece of candy to brushed aluminum, from rainbow to pure white. An outline allows you to have diversity and flexibility while building brand equity.\n\n"
    },
    {
      "time": "21 Jul 2014 — 12:50pm",
      "content": "Thanks for the input, really apreciated.\n\nYes the \"Car Care\" string was a bit out of touch...  \nYes i experimented with caps and it was better, i experimented also between the A and D but it was a bit clumsyish...  \nAnd yes it was redundant as even with my native language DTL can be interpreted as detail....  \nSo \" Car Care\" off.  \nNow im having some doubts about the A, im considering turning it to a lower a as with this font it has a nice shape. What do You think ?  \nThanks\n\n ![](http://web.archive.org/web/20150317194327im_/http:/typophile.com/files/AutoDTL-Logo5_4694.png)\n\n"
    },
    {
      "time": "21 Jul 2014 — 2:52pm",
      "content": "It was a good idea to eliminate \"car care\". Regarding the \"a\", I agree that the lower-case looks nice but I'd probably capitalize it the same way you do when writing it. Also the spacing between the letters needs some tweaking. For example compare the big space to the right of the cap A to the tight space between u and t.\n\n"
    }
  ]
}
