{
  "id": "118103",
  "title": "Designing Italics Resources",
  "forum": "Design",
  "tags": [
    "italics design creation",
    "Design"
  ],
  "content": "Hi everybody, this is my first forum post!! I am new to type design, and I have create a roman, lowercase and uppercase, and I was wondering if anyone knew of resources to create italics. Something like Karen Cheng's Designing type. I have found the FontForge guide on designing italics. Any help is appreciated!\n\n",
  "author": "Jeremy R",
  "time": "19 Jul 2014 — 2:52pm",
  "uid": "221613",
  "comments": [
    {
      "time": "19 Jul 2014 — 3:21pm",
      "content": "Some elements to read in the wiki [http://typophile.com/node/14321](http://web.archive.org/web/20150418100935/http:/typophile.com/node/14321 \"http://typophile.com/node/14321\")\n\n"
    },
    {
      "time": "19 Jul 2014 — 6:52pm",
      "content": "Also, go to Briem.net ( [http://briem.net/](http://web.archive.org/web/20150418100935/http:/briem.net/ \"http://briem.net/\")) and drill down to the type design section and the part on italics within that.\n\n"
    },
    {
      "time": "19 Jul 2014 — 8:27pm",
      "content": "Do you want to make Italics the way everybody else does, or do you want to make Italics that are actually good?\n\nhhp\n\n"
    },
    {
      "time": "19 Jul 2014 — 9:12pm",
      "content": "Hrant, what a suspense... I want to make italics that are actually good, so what do you suggest?\n\n"
    },
    {
      "time": "19 Jul 2014 — 9:44pm",
      "content": "I would say start by realizing that Aldus's matching of a static Roman to a fluid Italic was a shotgun-wedding from hell. Then consider that the ideal flavor of a given Italic depends on its role in the whole, which can vary, so blindly following the established fallacy by default is Bad Design. And usually this role is one of subservience to the Roman, not \"Look at meee, look how pretty I am in my tutu doing a pirouette!\" Cursiveness has _nothing_ to do with emphasis.\n\nNow make something real.\n\nhhp\n\n"
    },
    {
      "time": "20 Jul 2014 — 12:28am",
      "content": "Hrant, can you show an example of how you have put your theories into an italic design? I'd be interested to see the result.\n\n"
    },
    {
      "time": "20 Jul 2014 — 12:50am",
      "content": "> Cursiveness has nothing to do with emphasis.\n\nHow doesn't it? I'm often greatly annoyed when an italic looks too much like the roman and it's barely noticeable that some text is set in italic. I think whether you use italics for emphasis or something else, just like bold and small-caps they have their function and they're used to denote something, so you better make it clear that they denote something. What else is an italic for?\n\nI personally also see the italic as a way to go a little nuts. Traditionally the italic was a distinct typeface from the roman, so I actually wonder from a historic perspective why you would want the italic to look like the roman. You state the initial combination of roman and italic was a shotgun-wedding from hell, but I just can't relate to that.\n\n> so blindly following the established fallacy by default is Bad Design.\n\nI'm not quite sure what you mean here and how you would prefer to see it.\n\n> And usually this role is one of subservience to the Roman, not \"Look at meee, look how pretty I am in my tutu doing a pirouette!\"\n\nWhether you feel italics are for emphasis or not, I think the cursive script inherently says \"Look at me — look how pretty I am\". Why would you even want to fight that?\n\nI guess you won't like the italic of Kristal by Eyal Holtzman; I think it's awesome. Here I could understand your sentiment though. It's very prominent, which you generally don't want to that extent in body text, though it's fantastic in a display context.  \n [http://www.eyalmyrthe.nl/letterontwerpen.php](http://web.archive.org/web/20150418100935/http:/www.eyalmyrthe.nl/letterontwerpen.php \"http://www.eyalmyrthe.nl/letterontwerpen.php\")\n\nRomanée is the same case as Kristal in this regard. How do you feel about upright italics in combination with roman?\n\n"
    },
    {
      "time": "20 Jul 2014 — 1:04am",
      "content": "Hrant, where can I find your typefaces anyway? I've only seen the ones on The MicroFoundry.\n\n"
    },
    {
      "time": "20 Jul 2014 — 8:10am",
      "content": "First: Jeremy, sorry for the digression (par for the course here on Typophile, especially when yours truly is involved...) but I hope it's still somehow useful.\n\nNick, I would say look at Harrier\\* and the Italic of Nina's Ernestine\\*\\*. And Martin, I don't have a lot of typefaces... Well, not in digital – they're mostly in brainwave format. :-\\>\n\n\\* [http://www.themicrofoundry.com/other/nour&patria/dev/nour-latin.gif](http://web.archive.org/web/20150418100935/http:/www.themicrofoundry.com/other/nour&patria/dev/nour-latin.gif \"http://www.themicrofoundry.com/other/nour&patria/dev/nour-latin.gif\")\n\n\\*\\* [http://ernestinefont.com/](http://web.archive.org/web/20150418100935/http:/ernestinefont.com/ \"http://ernestinefont.com/\")\n\nMore on my thoughts about Italic in my old Daidala interview: [http://www.daidala.com/25apr2004.html](http://web.archive.org/web/20150418100935/http:/www.daidala.com/25apr2004.html \"http://www.daidala.com/25apr2004.html\")  \nBut frankly, I feel like I'm still taking baby steps in this area; I'm just standing on the tip of the iceberg.\n\n> you better make it clear that they denote something.\n\nTotally agreed. But cursiveness remains an arbitrary and distracting means to do that. For example I see the \"upright Italic\" trend of about a decade ago as a huge mistake. Slant, different story.\n\nI don't think _pretty_ usually makes sense when you're trying to emphasize. Certainly not as a rule, which is what it is now. Most Italics are like a ballerina crashing an economists conference.\n\nGoing nuts? Display face.\n\nhhp\n\n"
    },
    {
      "time": "20 Jul 2014 — 9:55am",
      "content": "I like the tension in the italic of Ernestine. Perhaps it's better to have an italic with such tension rather than a full cursive, though a cursive inherently creates tension when combined with a roman. I personally like how text tends to become more vivid when such tensions are employed. For example, I like the combination of roman and blackletter to add texture and color to a page. I suppose in a way it's strange that the italic has become part of the roman while this hasn't been the case for blackletters. I know blackletters are generally out of fashion, but I love it when a blackletter variant has been added to a roman.\n\nAnyway, I think the ballerina approach to italics tends to work very well for classical typefaces. It's sort of Venetian, with lots of tension within the shapes.\n\nHrant, why haven't you done more typefaces? Don't you particularly enjoy the process? Nour & Patria has a very nice texture. I like the tension in the italic, which you probably wouldn't expect from such a transitional, vertical design.\n\n"
    },
    {
      "time": "20 Jul 2014 — 10:26am",
      "content": "I'm a family man.\n\nThank you for the kind words!\n\nhhp\n\n"
    },
    {
      "time": "20 Jul 2014 — 11:15pm",
      "content": "Thank you everybody! Everything has been really helpful, and I learned a lot!\n\n"
    }
  ]
}
