{
  "id": "118284",
  "title": "Glyphs workflow",
  "forum": "Build",
  "tags": [
    "fontlab",
    "glyphs",
    "Build"
  ],
  "content": "Who is actively working with the type design tool Glyphs from Georg Seifert, instead of Fontlab? I am interested to hear about your experiences. [http://www.glyphsapp.com](http://web.archive.org/web/20150414150545/http:/www.glyphsapp.com/ \"http://www.glyphsapp.com\")\n\n",
  "author": "Core0",
  "time": "27 Jul 2014 — 3:24am",
  "uid": "181047",
  "comments": [
    {
      "time": "27 Jul 2014 — 5:28am",
      "content": "I've used it few times, right from the very early versions (1.0.3) and recently a newer version (1.4.3)  \nIt has much improved since those early days.\n\nHowever, it seems to cause havoc with my whole system. I'm still on OSX 10.6.8 (don't ask !)  \nI over-rides the functionality of FontBook, and previewing of fonts, and I don't like that.  \nSo I totally removed it from my system using CleanMyMac.\n\nI also found when using 1.4.3 that I could not adjust some text that had been created using Fontlab.  \nI use someone else to do my kerning, and he says he uses it, but I've yet to be convinced.  \nKnowing me, I'm probably doing it all wrong. :)\n\n"
    },
    {
      "time": "27 Jul 2014 — 10:02am",
      "content": "I use it and like it.\n\n"
    },
    {
      "time": "27 Jul 2014 — 10:16am",
      "content": "Thanks for both your answers.\n\nEliason, I’d like to learn more about your experiences, if it improved your workflow, if you feel it is advanced in designing and editing a font in comparison with the now somewhat dated FontLab.\n\nDjnippa, your issues may relate to the font cache in Mac OS: [http://www.glyphsapp.com/tutorials/eliminating-font-cache-problems](http://web.archive.org/web/20150414150545/http:/www.glyphsapp.com/tutorials/eliminating-font-cache-problems \"http://www.glyphsapp.com/tutorials/eliminating-font-cache-problems\")\n\n"
    },
    {
      "time": "27 Jul 2014 — 10:27am",
      "content": "I'd love to try it when it's not platform-specific.\n\nhhp\n\n"
    },
    {
      "time": "27 Jul 2014 — 11:22am",
      "content": "I use it… it's hard for me to imagine anything that could be improved. I did have one feature request, but they have a plugin SDK, so I just wrote a plugin.\n\nIn-context editing (combined text/edit view) is a must-have. If I understand correctly, FontLab doesn't have this.\n\nI looked at RoboFont briefly, but it would take too much tinkering. I really don't mind writing Python, but why bother if Glyphs does what I want? I'd rather spend time making a typeface.\n\n"
    },
    {
      "time": "27 Jul 2014 — 11:28am",
      "content": "How could it be a must-have if so much good type was made before it existed?\n\nhhp\n\n"
    },
    {
      "time": "27 Jul 2014 — 2:37pm",
      "content": "I moved to Glyphs from FontLab, and for my purposes it has been an entirely positive shift. To my mind it has a far more intuitive and usable interface, better stability, and much more responsive developers.  \nIt is set up to be easy to get started with, and for that I think it has a reputation as a beginners' editor (compared to FontLab and especially RoboFont), but I think it is less well known that there is a lot of power and control available through the program. I have yet to encounter an aspect of typeface generation where it seemed that Glyphs was making a decision for me and I wasn't able to change it. (To be sure, there are others with more complicated needs than mine who might run into limitations.)  \nGlyphs is a pleasant environment to work in, and there's every indication that developers will continue to make it better at a good pace and in smart ways. It was an excellent purchase for me.\n\n"
    },
    {
      "time": "27 Jul 2014 — 7:24pm",
      "content": "@hrant: I wouldn't presume to prescribe features for anyone else; in-context editing is a must-have for me, but I'm sure many others could do without it.\n\n"
    },
    {
      "time": "28 Jul 2014 — 1:16am",
      "content": "Thanks for all your answers, they were quite helpful. It appears to me that of the current set of editors, Glyphs may be the most modern one, also more user friendly, if I compare it with RoboFont, for an example. I am not good at writing code and I need automated processes, say for multiple masters and interpolation, to create families and super families.\n\nFrom what I understand, the “light” version of Glyphs doesn’t let you create multiple masters in layers, so I could imagine this contributed to the “beginners” reputation.\n\nWhat I like in FontLab is the integration of OpenType classes and how kerning can be automated, to a degree, say for diacritics (o has the same kerning like ø and ö, for an example). I am particularly interested in interpolation, multiple master abilities and metrics/kerning in Glyphs. Currently I am going through tutorials to get a better understanding of how these things are handled.\n\nAgain, thank you, also for the critical remarks.\n\n"
    }
  ]
}
