{
  "id": "118218",
  "title": "Futura is brutal and rather ugly",
  "forum": "Sans Serif",
  "tags": [
    "bad",
    "brutal.",
    "futura",
    "Sans Serif",
    "ugly"
  ],
  "content": "I have been designing a book jacket for a book on Meditation. So I opted for what I thought would be a clean crisp san-serif font with good legibility. We weren't looking for anything that would be too unique/new so I opted for one of my favorite classic typefaces.  \nThat being Futura (bold set in lowercase).\n\nThe author came back with the following description:  \nThe font is brutal and rather ugly.\n\nIf there is one description of a font which didn't seem to tally with my own personnel opinion it this is it.  \nHe wants something crisp and modern but softer!  \nIt remains to be seen if what he means is something like Vag rounded.....\n\nAnyway so let's have it. Who out there can't stand Futura either?  \nAnd what is a much better sans serif.\n\nLove to hear peoples views....\n\n",
  "author": "Rawshock Design",
  "time": "24 Jul 2014 — 2:33am",
  "uid": "215632",
  "comments": [
    {
      "time": "24 Jul 2014 — 6:16am",
      "content": "I wouldn't call it \"ugly.\" But it's a highly stylized conceptual face, so like all styles, it will come in and out of fashion. Personally, the proportions are distracting to my eye. You can start with the \"geometric\" /OCDGQ/, which all feel uncomfortably wide. Why are /EFLPST/ so narrow and /AN/ so wide?\n\nJust what on Earth is going on with just-barely-broken /K/? The pointy vertices on /AMNVWX/ stick out in more ways than one. And the /S/ commits multiple offenses in my book.\n\nWithout seeing your design, it's hard to recommend anything. Avenir was designed as a riff and \"improvement\" on Futura, but it has exploded in popularity in the past two years thanks to Apple, so it may be temporarily played out. Maybe give LL Circular a try?\n\n"
    },
    {
      "time": "24 Jul 2014 — 7:01am",
      "content": "Your author has good taste.  \nI call it Fartura. To me it's a caricature of a typeface.\n\nSome questions:  \n— Is this only for the jacket, so display usage?  \n— What other fonts are being used?  \n— Illustration style? Especially on the jacket.\n\nhhp\n\n"
    },
    {
      "time": "24 Jul 2014 — 7:11am",
      "content": "> Who out there can't stand Futura either?  \n> And what is a much better sans serif?\n\n¶ I 'do' appreciate _Futura_ for its basic modernistic concept. It's perfect for big titles.  \nMeditation and Modernity are opposite matters.\n\n¶ _Futura_ is irrelevant for the nature of your book and your client's judgment is understandable. Your client wishes a neo-humanist typefaces. Try to explore this thread in which I and members draw list of neo-humanist ones that 'may' fit your assignment.\n\n[http://typophile.com/node/116746](http://web.archive.org/web/20150317133425/http:/typophile.com/node/116746 \"http://typophile.com/node/116746\")\n\n"
    },
    {
      "time": "30 Jul 2014 — 12:11pm",
      "content": "Hello,  \nAnd thank you for your comments.  \nI should maybe say more about the book title. It is following on with a design feel that has been previously mapped out for some other books. The design standpoint of the books is actually deliberately modern in their intent with very clean logo-like vector graphics in place. This is one of the other books which I think used Helvetica:  \n [http://www.amazon.co.uk/Mindfulness-Health-practical-relieving-restoring...](http://web.archive.org/web/20150317133425/http:/www.amazon.co.uk/Mindfulness-Health-practical-relieving-restoring/dp/074995924X/ref=sr_1_6?s=books&ie=UTF8&qid=1406747164&sr=1-6&keywords=mindfulness+a+practical+guide+to+finding+peace+in+a+frantic+world \"http://www.amazon.co.uk/Mindfulness-Health-practical-relieving-restoring/dp/074995924X/ref=sr\\_1\\_6?s=books&ie=UTF8&qid=1406747164&sr=1-6&keywords=mindfulness+a+practical+guide+to+finding+peace+in+a+frantic+world\")\n\nIn any case I will take Fourneirs advice and look at neo-humanist typefaces maybe.\n\n"
    },
    {
      "time": "30 Jul 2014 — 5:34pm",
      "content": "<cite>The design standpoint of the books is actually deliberately modern in their intent with very clean logo-like vector graphics in place.</cite>  \nWhy would you want to use a 1920's typeface for a \"deliberately modern\" book anyway? Do you tend to use steam engines to communicate the modernity of mechanics?\n\nAlso, when thinking of meditation, geometric typefaces don't come to mind. I strongly suspect these associations would differ per person, but I would likely look for a more vivid typeface. Not organic, but definitely more alive than Futura.\n\nI personally like to see Futura on the street; for some reason I always enjoy recognizing it and every time I see it I have to think of how prolific that /S is. I wouldn't call it a great typeface though and I would be hesitant using it myself.\n\n"
    },
    {
      "time": "31 Jul 2014 — 4:49am",
      "content": "Thanks Martin,  \nAs ever, typefaces seem to bring out some quite strong opinions (which is a good thing). They are very emotional creations after all. This is a matter of opinion of course, but I personally like to believe that a typeface that was designed in the 1920's can still be thought of being modern in it's personality.  \nFutura to me will always look modern and a bit confrontational. It is quite brutal as the author says!  \nSome book cover designs are still seen as modern and contemporary even though they were designed many years ago. I guess this is the same for most things really.  \nI am of course interested in what you believe is a suitable typeface for a book on a book about meditation?  \nIf you look on amazon you will see designers in the past have pretty much chosen every type of typeface out there. I do want to keep it sans-serif (though maybe a slab serif could work) as I think this suits the vector illustrations that are going to be used on the cover. I just dropped Meta onto the cover and this font to me just has too much character. I need something fairly plain (less difference in stroke widths) etc as boring as that possibly sounds.  \nFonts that could maybe work to my mind are: Gotham, GilanGothic, or Myriad. Also just tried Kievit and that looks pretty good in fact.\n\n"
    },
    {
      "time": "31 Jul 2014 — 6:25am",
      "content": "GilanGothic?\n\n"
    },
    {
      "time": "31 Jul 2014 — 6:31am",
      "content": "Yes thanks, got that on my list in previous thread. It's a good choice though.\n\n"
    },
    {
      "time": "31 Jul 2014 — 7:09am",
      "content": "<cite>This is a matter of opinion of course, but I personally like to believe that a typeface that was designed in the 1920's can still be thought of being modern in it's personality.</cite>\n\nYes, they still have their place, but don't confuse modernism with contemporary faces. Examples of typefaces I would truly consider modern in the contemporary sense are Beau Sans, Beleza, Exo 2.0, Hackman, Klaus FY, Proxima Nova, Riccia, Telcel, Zarina Sans etc.; not dusty old typefaces like Erbar, Futura, Kabel, or the newer but god-awful Avant Garde.\n\nWhat we consider to be modern is minimalism and spaciousness. As such, Futura is often seen as modern as it's clearly minimal. I think the mistake people make here is that there is a great distinction between a clean, neutral typeface and what was considered modern in the early 20th century, which were constructed typefaces rather than designed typefaces. Typefaces in the Bauhaus style are not considered to be modern because construction is regarded higher than optical design while contemporary modernism is all about clarity. Many of these early geometric typefaces have more to do with construction than design. I don't consider it a good practice to equate Futura with contemporary modernism.\n\n<cite>So I opted for what I thought would be a clean crisp san-serif font with good legibility.</cite>\n\nI would consider Futura to be minimal; clean and crisp a bit less so. Whether Futura has good legibility I do question though. Also, the dimensions of Futura are just not modern to me in the contemporary sense. The x-height is too low, the ascenders too tall, the bowls of P/R too high and small, many of the capitals are too condensed, there are too many abrupt horizontal/vertical cuts in the terminals, the /t has no terminal (which looks very Bauhaus to me), the capital /J has a descender and M/N are reminiscent of glyphic Roman lettering.\n\n<cite>Some book cover designs are still seen as modern and contemporary even though they were designed many years ago.</cite>\n\nYou're absolutely right, but I would be careful with what typefaces you select for the job anyway. Thinking Futura is modern may lead to problems. It's true that by using Futura in a modern way, people get the impression it's true modernism but I think you confuse the whole style that way. For example, ITC Avant Garde has been considered a modern typeface up to 2000 or so, but I cringe every time I see it as it takes me back to the 90's. The very tight spacing is also an example of this outdated sense of modernism. While Futura still works, I don't think ITC Avant Garde should ever be used again.\n\n<cite>I am of course interested in what you believe is a suitable typeface for a book on a book about meditation?</cite>\n\nI'm pretty good at offering criticism but I must admit I'm not a great typographer. I'm not even sure which style would fit a book about meditation exactly. Perhaps something very clean would work but it depends on many things. What aspect of meditation is talked about, is it a scientific interpretation of meditation and its effect on human psychology or is it a guidebook or speculative new-age stuff? What kind of art or design are you using and what colors? What's the layout like and which typefaces are you using in combination?\n\nYou don't have to answer these questions to me because as I said I'm not a great typographer so I probably wouldn't make a great choice. However, I can offer you the names of typefaces from specific styles. If you're still looking for something clean and crisp, I might consider Benton Sans, Libertad, Museo Sans, Proxima Nova, Samo Sans or Variable. If you want something modern (yet arguably less crisp) you might consider Adelle Sans, Centro Sans, Geometrica, Scala Sans or Urban Grotesk. If you want something more vivid you might try Andulka Sans, Auto, Foco Corp, Gentona, Gloriola, Karmina Sans, Oksana Sans, Oksana Text, Quire Sans, Sensato or Sentosa. I personally think you may find something suitable in the last bunch I named. Search for modern humanist typefaces. I think you might need a typeface that is clean and modern yet vivid and friendly. But again, I don't know what exactly you want to convey with the design of the book, so you might need something else entirely. I can imagine certain serif typefaces working well for this job as well.\n\nGotham is probably a better choice than Futura when it comes to its design, but it's probably too prolific. I always try to find alternatives to typefaces which are overused when it comes to commercial projects. I do use Gotham for school presentations at times because it's very clear, but I'm more hesitant about using it when it comes to branding or book design.\n\n"
    },
    {
      "time": "31 Jul 2014 — 8:03am",
      "content": "Wow, Martin thanks for your very detailed reply. Your knowledge on fonts is obviously pretty amazing.  \nI hope I didn't provoke into a very long answer (suspect so).  \nI tend to design on instinct (and shuffle through hundreds of fonts, till it looks right). Futura did look right on the design. Though I am very sure there is an even better solution! One that the author will be happy with ;)  \nYour response makes great reading and I am sure I will take some stuff on board.  \nI would show you the design, but I am not sure my client would be so happy. Maybe once it's designed....\n\nIt's interesting you mention Avant Garde. As there is a set of penguin books that to me look really quite modern in their approach. Well at least I think the font used is a variant of Avant Garde.  \n [http://www.jimstoddart.co.uk/artdirectionss/y6rte4ogvkenmaw9woi1uztvcx95xt](http://web.archive.org/web/20150317133425/http:/www.jimstoddart.co.uk/artdirectionss/y6rte4ogvkenmaw9woi1uztvcx95xt \"http://www.jimstoddart.co.uk/artdirectionss/y6rte4ogvkenmaw9woi1uztvcx95xt\")  \nThough it must be said they have very good picture researchers at Penguin. So that helps.\n\nI also agree Gotham is overused. The same could be said for Trade Gothic at least in the book trade.\n\nReally do appreciate your comments. I certainly haven't heard of all the fonts on your list.\n\n"
    },
    {
      "time": "31 Jul 2014 — 10:19am",
      "content": "<cite>I hope I didn't provoke into a very long answer (suspect so).</cite>  \nNo, I just tend to get carried away when I'm passionate about something. I do it even when I'm not actually talking to anyone.\n\n<cite>Well at least I think the font used is a variant of Avant Garde.</cite>  \nOkay, those books look quite attractive. I guess I will have to elaborate on my opinion of ITC Avant Garde. I absolutely hate capital ligatures. I consider this to be the devil:\n\n ![](http://web.archive.org/web/20150317133425im_/http:/typophile.com/files/42189_4391.big_.png)\n\nJust like Futura, ITC Avant Garde has some odd proportions, which lend itself well for display use such as on the Penguin Modern Classics. I think it works for a book series because it's general branding, rather than branding of a specific book. For branding a specific book the typeface you use should be a lot more telling about the content of the book. I have to say though that I still feel ITC Avant Garde is used in a bad way for the Penguin book series. The spacing is very tight but I can see the appeal here, but some characters are kerned way too tightly. Kerning Tr and Te this tightly is not something typographers tend to do nowadays. It's very obtrusive to me. The kerning in \"Ayn [Rand]\" is absolutely horrendous. I also feel the /t is so condensed it almost disappears. The /s is also very condensed (as is Futura's /s) but it still has some presence. Also have a look at the Jean-Paul Sartre cover and notice how \"Jean-Paul\" is not optically aligned due to the gap on the left side of J. Usually you don't get that issue when the spacing is looser because you compensate for big gaps in between letters such as A, J, L, V, W and Y. With very tight spacing you get all kinds of problems. The capital letter ligatures have been added to compensate for some of those spacing problems.\n\n"
    },
    {
      "time": "31 Jul 2014 — 11:10am",
      "content": "“The only place Avant Garde looks good is in the words Avant Garde” – Ed Benguiat\n\nBy the way, I wasn’t suggesting GilanGothic, rather asking what kind of typeface it is, since I never heard of it, and couldn’t find any reference to it.\n\n"
    },
    {
      "time": "31 Jul 2014 — 12:37pm",
      "content": "Hi Riccard,\n\nWhat I thought was a commercial typeface seems to be an adaption of Gill Sans I must picked up somewhere along the line. Apologies for the confusion.\n\n"
    },
    {
      "time": "31 Jul 2014 — 12:40pm",
      "content": "Strange there is nothing to be found on the Internet about that name though.\n\n"
    },
    {
      "time": "18 Aug 2014 — 1:07pm",
      "content": "Geometric but warmer and very slightly rounded: Telefon  \n [https://monokrom.no/fonts/telefon](http://web.archive.org/web/20150317133425/https:/monokrom.no/fonts/telefon \"https://monokrom.no/fonts/telefon\")\n\n"
    },
    {
      "time": "12 Sep 2014 — 4:08am",
      "content": "Futura can look timeless and elegant especially the light weights. It's almost never the typeface itself that is brutal or ugly but rather how it is deployed.\n\n"
    },
    {
      "time": "13 Oct 2014 — 2:58am",
      "content": "This how the cover turned out in the end. Went through every colour imaginable and for that matter quite a number of typeface variants. So long modern san-serif....  \nI will tell you one thing about being a graphic designer (and specifically a book cover designer). You have to be pretty malleable to a lot of out-side influences ;)\n\n ![](http://web.archive.org/web/20150317133425im_/http:/typophile.com/files/sample_5393.png)\n\n"
    },
    {
      "time": "13 Oct 2014 — 8:25am",
      "content": "Do move \"Meditate?\" (with its appendage) to the right.\n\nhhp\n\n"
    },
    {
      "time": "19 Oct 2014 — 10:48am",
      "content": "I agree, It's optically off-center. I might actually move everything from 'Why' up to 'on Track' down a bit, and kern 'why' manually. Other than that the cover looks beautiful. Nice choice of typeface.\n\n"
    },
    {
      "time": "20 Oct 2014 — 1:37am",
      "content": "Thanks Martin and Hrant.  \nI think you are both right, it does look off centre slightly, as you say Meditate visually needs to move to the right a tad. The tracking between H and Y (of the word Why) also needs minor adjustment. Thanks as ever for your comments ;)\n\n"
    }
  ]
}
