{
  "id": "118452",
  "title": "Flair Headline—Wide Didone",
  "forum": "Display",
  "tags": [
    "didone",
    "Display",
    "Editorial",
    "glyphs",
    "wide"
  ],
  "content": " ![](http://web.archive.org/web/20150317142754im_/http:/typophile.com/files/hello_5079.png)\n  \nHello, Typophile! Looking on feedback on a new typeface I’m working on; it’s based on my current logotype.\n\nIt’s a wide-set display didone. My design uses hairline serifs, and then flared shapes that flow from the hairline to construct letterforms that usually are defined by serifs, where a hairline serif would be too ill-defined.\n\nHere is my newly modified logotype that I am expanding into a typeface, I added a curl to the /R/ leg, as well as tracked out my first name.\n\n ![](http://web.archive.org/web/20150317142754im_/http:/typophile.com/files/logo_4061.png)\n\nLooking for ideas, because I’ve been told that having both hairline and bracket serif styles makes the design seem disconnected, but I feel that the curved forms of the flaring connects with design of the curved letters, and just hairline serifs would affect legibility a lot, especially since the weight of the face is very heavy. The more I can have it match my logo, without “forcing it”, the better.\n\nThe usage I have in mind is large display usage and very short headlines.\n\n| Attachment | Size |\n| --- | --- |\n| [Flair\\_Hairline\\_7-31.pdf](http://web.archive.org/web/20150317142754/http:/typophile.com/files/Flair_Hairline_7-31.pdf) | 390.56 KB |\n\n",
  "author": "MarkyCDavis",
  "time": "3 Aug 2014 — 1:45pm",
  "uid": "37940",
  "comments": [
    {
      "time": "4 Aug 2014 — 6:23am",
      "content": "Like the feel of it Mark, if anything the glyphs may be a tiny bit too wide.\n\n"
    },
    {
      "time": "15 Aug 2014 — 8:12am",
      "content": "I really like it\n\n"
    },
    {
      "time": "14 Sep 2014 — 2:20am",
      "content": "So far so good. A few comments:\n\n- The /S/ could be more contrasting in its transitions. I would prolong the hairline thickness closer to the spine.\n- The junction to the upper serif in /S/ is a bit too low/steep.\n- The /!/ lacks of contrast. Try tapering the lower end of the drop.\n- The terminal of /R/ is too thin.\n\nKeep it up!\n\n"
    },
    {
      "time": "3 Dec 2014 — 12:06pm",
      "content": "This is beautiful!\n\nI would consider making the /X/ wider.\n\n"
    }
  ]
}
