{
  "id": "118514",
  "title": "Beausite — Grotesk with contrast",
  "forum": "Release",
  "tags": [
    "contrast",
    "grotesk",
    "Sans",
    "swiss",
    "Release"
  ],
  "content": "Hello everybody,\n\nLast month, we released Beausite. A Grotesk in 3 levels of contrast and 6 weights. We hope you like it. Don't hesitate to get our free trial fonts and test it in your designs.  \nMore background information can be found on our blog.  \n [www.fatype.com](http://web.archive.org/web/20150317115950/http:/www.fatype.com/ \"www.fatype.com\")  \n [http://blog.fatype.com](http://web.archive.org/web/20150317115950/http:/blog.fatype.com/ \"http://blog.fatype.com\")\n\n![](http://web.archive.org/web/20150317115950im_/http:/www.fatype.com/img/fonts/beausite/Beausite-01-Overview.jpg)  \n ![](http://web.archive.org/web/20150317115950im_/http:/www.fatype.com/img/fonts/beausite/Beausite-02-Grotesk.jpg)  \n ![](http://web.archive.org/web/20150317115950im_/http:/www.fatype.com/img/fonts/beausite/Beausite-04-Grotesk-Regular.jpg)  \n ![](http://web.archive.org/web/20150317115950im_/http:/www.fatype.com/img/fonts/beausite/Beausite-06-Grotesk-Bold.jpg)  \n ![](http://web.archive.org/web/20150317115950im_/http:/www.fatype.com/img/fonts/beausite/Beausite-08-Slick-Thin.jpg)  \n ![](http://web.archive.org/web/20150317115950im_/http:/www.fatype.com/img/fonts/beausite/Beausite-10-Slick-Black.jpg)  \n ![](http://web.archive.org/web/20150317115950im_/http:/www.fatype.com/img/fonts/beausite/Beausite-11-Grand.jpg)  \n ![](http://web.archive.org/web/20150317115950im_/http:/www.fatype.com/img/fonts/beausite/Beausite-13-Grand-Medium.jpg)  \n ![](http://web.archive.org/web/20150317115950im_/http:/www.fatype.com/img/fonts/beausite/Beausite-14-Grand_Alternates.jpg)\n\n",
  "author": "Fatype",
  "time": "6 Aug 2014 — 6:25am",
  "uid": "30187",
  "comments": [
    {
      "time": "30 Aug 2014 — 8:23am",
      "content": "I have to be honest I don't like the name, but the typeface is very cool. It seems brilliant to work with such a big type system and get the text and display typefaces out of the same type system.\n\nI think K/R/Z in Alternates are too obtrusive though.\n\n"
    },
    {
      "time": "30 Aug 2014 — 8:45am",
      "content": "> I think K/R/Z in Alternates are too obtrusive though.\n\nWhich makes them perfect for the obtrusive typography typical of fashion magazines and the like ;-)\n\n"
    },
    {
      "time": "30 Aug 2014 — 12:16pm",
      "content": "Perhaps so, though especially that Z would prevent me from using it at all. I like a bit of tension, especially in display use, but it doesn't seem a good idea to have this vertical cut which can't be found anywhere in the typeface. I suppose it's a matter of taste, but I feel K/OO/R/Z go completely against the core design principle of the font. I can elaborate on why I feel this is the case.\n\nI'm all for prominent and slightly \"off\" elements in a display font, but it shouldn't become obtrusive. And to be clear, obtrusiveness is inherently bad. You make it sound as if obtrusiveness is exactly what the fashion magazines are looking for but that is not the case.\n\n"
    },
    {
      "time": "30 Aug 2014 — 2:11pm",
      "content": "Sooner or later someone’s gunna use that Z.alt as an N.tippedover.\n\n"
    },
    {
      "time": "30 Aug 2014 — 3:57pm",
      "content": "> You make it sound as if obtrusiveness is exactly what the fashion magazines are looking for but that is not the case.\n\nI winked. That said, I do find most fashion (or fashionable) magazines’ typography obtrusive, as most fashion photography for that matter. Not aesthetically displeasing, mind you, but in antithesis with Warde’s “crystal goblet” principle.\n\nAnd, it’s not that you _need_ to use the alternates, anyway ;-)\n\n"
    },
    {
      "time": "30 Aug 2014 — 6:11pm",
      "content": "> I winked.\n\nDamn, even when specified in text I seem to be misunderstanding sarcasm.\n\n> That said, I do find most fashion (or fashionable) magazines’ typography obtrusive.\n\nI wouldn't necessarily use the word 'obtrusive' here but I know what you mean. In most cases though there is logic behind the \"obtrusive\" details. I feel the OO ligature is nice on its own and it's a nice graphical element to use in fashion (the Gucci and Chanel logos basically do the same, and I've seen the double O in several fashionable typefaces) but it just doesn't fit the typeface. It's completely out of place. I feel the same about the Z as it has vertical cuts which are nowhere to be found anywhere else in the typeface. The horizontal cut on K/R is something I've seen in fashion before (Prada does it in their logo as well) but again it doesn't fit with the typeface at all. If you look at the letter shapes of the Prada logo you feel the horizontal cut in R is logical in a sense because the shapes are squared, there are sudden angles and the /A has an extended terminal. Without these aspects the horizontal cut on the leg of /R wouldn't work. Right now it's a bit obtrusive but coherent. With just the horizontal cut it would just be obtrusive. Similarly, I feel the alternates of Beausite lack logic and coherence while the typeface in general is brilliant and beautiful. I suppose I'm just puzzled.\n\n> And, it’s not that you need to use the alternates, anyway ;-)\n\nI get that, and I wouldn't. I'm just surprised to see these alternates because I feel they go against the logic behind the typeface.\n\n"
    },
    {
      "time": "28 Sep 2014 — 7:54am",
      "content": "Reminiscent of Radiant, by Robert Hunter Middleton for Ludlow circa 1938. [https://www.myfonts.com/fonts/urw/radiant/](http://web.archive.org/web/20150317115950/https:/www.myfonts.com/fonts/urw/radiant/ \"https://www.myfonts.com/fonts/urw/radiant/\")  \nI keep on thinking of doing a large family from the original.\n\nThat said, it is an under-explored area, to be sure.\n\n"
    }
  ]
}
