{
  "id": "118513",
  "title": "What do you think of Tesla's font choice on their website?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Tesla is using a combination of Proxima and Arial on their website. Do you think it reflects the ID of one of the most innovative car builders?\n\n",
  "author": "Jean Louis",
  "time": "6 Aug 2014 — 5:37am",
  "uid": "221766",
  "comments": [
    {
      "time": "6 Aug 2014 — 6:42am",
      "content": "Nice looking site - clean, uncluttered, no gimicks - works for me.\n\n"
    },
    {
      "time": "6 Aug 2014 — 1:55pm",
      "content": "I think it works. It comes across as progressive, solid and confident.\n\nWhy do you ask? Do you have reservations about it?\n\n"
    },
    {
      "time": "6 Aug 2014 — 3:25pm",
      "content": "Excellent website, the width and clean lines of Proxima Nova highlight that this is a car for smoothly moving at speed along the open road, as shown in in at least one version of the website [http://www.teslamotors.com/en\\_CA](http://web.archive.org/web/20150414043519/http:/www.teslamotors.com/en_CA \"http://www.teslamotors.com/en\\_CA\") BTW the sub-pix add to the message that this is electric and there ARE charging stations.  \nArial, shown at small scale, is OK for for technical details. It's well known and reassuring. Suggests there is nothing bizarre about this car.  \nDon\n\n"
    },
    {
      "time": "6 Aug 2014 — 6:15pm",
      "content": "Looks good to me.\n\n"
    },
    {
      "time": "7 Aug 2014 — 1:58am",
      "content": "Thank you for your replies. I think Tesla is a remarkable brand, and the website reflects that. However, I would have expected them to use a less predictable font than proxima nova. Considering their logo for instance, which is somewhat \"futuristic\". But then, it all looks consistent and gets the message across.\n\n"
    },
    {
      "time": "28 Jan 2015 — 9:06am",
      "content": "I think the font choice and typography is perfect; sophisticated and clean and reflecting the company's focus on engineering, quality and style.\n\nI think it's a mistake to believe that because a company is innovative that they need to employ a \"less predictable\" font. I would be curious to know what you think would have been strong alternatives, as it's not clear to me what you mean by \"less predictable.\"\n\n"
    }
  ]
}
