{
  "id": "118541",
  "title": "Original Sabon's italic small f",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Maybe I'm wrong or cursed by bad taste, but I really like the straight, sword-like italic small f of the original Sabon (I have been looking at it before I knew it was by Jan Tschichold).\n\nI remember there's a post here saying that \"the small italic f is the worst glyph ever made.\" What's wrong with it? Is it so because it is straight? (I guess what Akira Kobayashi has done was correct by changing it back to conventional curly form?)\n\n",
  "author": "grubstreet",
  "time": "7 Aug 2014 — 9:22am",
  "uid": "205070",
  "comments": [
    {
      "time": "7 Aug 2014 — 10:49am",
      "content": "If I'm not mistaken, I think that it's Jean-François Porchez, not Akira Kobayashi, who reverted to the curly form of italic lower-case <cite>f</cite> for the Sabon Next version. Tschichold's original design for this particular glyph may have been dictated at the time by the limitations of the Linotype hot-metal typesetting system, which did not allow for kerning letters.\n\n"
    },
    {
      "time": "7 Aug 2014 — 11:12am",
      "content": "I think it’s a good idea.  \nWhen italic /f starts a line, it goes way over into the margin otherwise.  \nI provided such /f’s as alternates in the Modern Suite.  \nFedra has them, of course.\n\n"
    },
    {
      "time": "7 Aug 2014 — 11:50am",
      "content": "> If I'm not mistaken, I think that it's Jean-François Porchez, not Akira Kobayashi [...] by the limitations of the Linotype hot-metal typesetting system, [...]\n\nYou are indeed correct. I re-checked and found that Sabon Next was not done by Kobayashi but by Jean-Francois Porchez.  \nAre you saying that this sword-like f is not a stylistic choice, but a compromise for the technology at the time?\n\n> When italic /f starts a line, it goes way over into the margin otherwise.\n\nGood idea! I guess I have just focused on the stylistic side other than the practical function.  \nBut, are they stylistically bad because a straight end is not most italic small f's are hand-written (viz. not following what a serif glyph should conventionally behave)?\n\n"
    },
    {
      "time": "7 Aug 2014 — 2:13pm",
      "content": "Another Linotype method of improving ﬁt was to rotate this character counter-clockwise a tad, but that looks more strange and obtrusive.\n\n"
    },
    {
      "time": "8 Aug 2014 — 3:21am",
      "content": "The whole Sabon project was indeed a matter of compromises : the brief Tschichold received asked for a Garamond-style text design suitable for handsetting, Monotype and Linotype hot-metal composition — three different systems with hugely varying technological constraints.  \nIn my opinion, the fact that Tschichold managed to overcome all these limitations and to answer the brief in such a masterly fashion makes the original Sabon one of the greatest typographical masterworks of the twentieth century.\n\n"
    },
    {
      "time": "9 Aug 2014 — 8:19am",
      "content": "When the technical constraints that Sabon faced are mentioned, I am always reminded of the typefaces designed for the IBM Selectric Composer. All of them faced the same constraints as Sabon: as with Monotype, the widths of the characters were according to a unit system; as with Linotype, the italic and the normal (and also the bold) were the same width.\n\nFor comparison, here is Journal Roman, which I've thought of as the Garamond from the set of faces they had (although, looking at the bold, it also reminds me of Perpetua). This is from a scanned version of IBM's catalogue on the web, and the scan isn't the greatest, but it seems to be passable as long as one ignores the artifacts in the background.\n\n ![](http://web.archive.org/web/20150419024532im_/http:/typophile.com/files/Journal_6731.jpg)\n\n"
    }
  ]
}
