{
  "id": "118511",
  "title": "Open Type for noobs",
  "forum": "Design",
  "tags": [
    "Open Type",
    "programming",
    "Design"
  ],
  "content": "Hello! Someone in here can help me with Glyphs?? I'm adding the small caps to my font, but actually it's the first time i do this so (this is also my first font), I'm having some troubles: InDesign doesn't make the change of letters when I use the Small Caps button, just from the OpenType window and it works only on the capital letters; and, I dont know neither how to set the case sensitive signs in open type what suffix do I need to put on my glyphs and which Open Type function works for that?  \nI hope someone can help me with this problem greetings from Mexico!\n\n",
  "author": "FernandoMarco",
  "time": "6 Aug 2014 — 1:36am",
  "uid": "219794",
  "comments": [
    {
      "time": "6 Aug 2014 — 5:26am",
      "content": "Fernando, you'll get help directly from the developers if you post your request in the Glyphs forum. They are very responsive.\n\n[http://www.glyphsapp.com/forums/](http://web.archive.org/web/20150417045016/http:/www.glyphsapp.com/forums/ \"http://www.glyphsapp.com/forums/\")\n\n"
    },
    {
      "time": "6 Aug 2014 — 5:35am",
      "content": "And, InDesign not applying true small caps using the Small caps button sadly is the way it's designed, so nothing your or any other font can change.\n\n"
    },
    {
      "time": "6 Aug 2014 — 7:49am",
      "content": "InDesign does apply true small caps when you push the small caps button if the font has them. If not, it makes fake ones. You can specify what size the fake small caps are generated at in preferences. If you set the preference to 100% (full size), the button will never fake the small caps if they aren't in the font.\n\n"
    },
    {
      "time": "6 Aug 2014 — 8:28am",
      "content": "It looks like I use an outdated version of ID. Glad to hear it's been fixed.\n\n"
    },
    {
      "time": "6 Aug 2014 — 2:48pm",
      "content": "InDesign has done this since version 1.0 back in the year 2000.\n\nHowever, the small caps button only invokes 'smcp' to turn lowercase into small caps. Caps to small caps ('c2sc') requires the sub-menu selection. The \"all small caps\" option does both.\n\n"
    },
    {
      "time": "6 Aug 2014 — 3:13pm",
      "content": "Thank you for the clarification.  \nSince I use “all small caps” almost exclusively, I probably forgot/misremembered what was “wrong” with the button ;-)\n\n"
    },
    {
      "time": "7 Aug 2014 — 5:24am",
      "content": "I'm with you on that one. Would much rather the button was for \"all small caps.\"\n\n"
    }
  ]
}
