{
  "id": "118533",
  "title": "Text block placement on last page",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "If I look at the size and placement of a text block for more traditional books, I always end up with approximations of this:\n\n ![](http://web.archive.org/web/20150417211856im_/http:/typophile.com/files/194_3841.jpg)\n\nThis is in harmony to the page, the spread, and well balanced.\n\nNow my question is: what about the last page when the text block happens to be placed on a verso and the recto empty? Would I move the text block a little more into the middle of the page, because a balancing text block on the verso is missing? How is this handled traditionally?\n\n",
  "author": "_savage",
  "time": "7 Aug 2014 — 7:21am",
  "uid": "217867",
  "comments": [
    {
      "time": "7 Aug 2014 — 8:01am",
      "content": "I wouldn’t do it, as I wouldn’t when text is on the recto and the verso is blank.  \nAn exception would be if the page contains something not directly related to the text (a list of other books in the same collection, for example).  \nAlso remember to account the folding when calculating the inner margin: more pages wider margin.\n\n"
    },
    {
      "time": "7 Aug 2014 — 9:17am",
      "content": "I wouldn't either. Also consider that most books are printed on thin paper and there is some show-through. Your unusual placement of the closing text would be obvious.\n\n"
    },
    {
      "time": "7 Aug 2014 — 5:49pm",
      "content": "Agreed with above, keep the last page in the same position.\n\nThe design unity of the book as a whole is more important than balancing any one spread. Breaking the consistency for the sake of one page weakens the conviction of the layout across the whole book.\n\n"
    },
    {
      "time": "7 Aug 2014 — 11:21pm",
      "content": "Agreed, you should design the book as a whole and not design it as a series of spreads. If you made the end spread different, it might look right by itself, but would look off when viewed in context with the rest of the book.\n\n"
    },
    {
      "time": "8 Aug 2014 — 6:32am",
      "content": "Thanks everybody, that makes sense.\n\nI assume the back of the jacket is all together a different matter anyway, and there text can be centered (even should be) independently from the interior of the book.\n\n"
    },
    {
      "time": "8 Aug 2014 — 7:39am",
      "content": "Right, the jacket can, and should, have a different layout from the interior.\n\n"
    },
    {
      "time": "8 Aug 2014 — 3:11pm",
      "content": "I wouldn't go as far as saying that you shouldn't consider the grid from the inside pages to provide some sort of continuity between the inside and the jacket, but it isn't necessary or even done all that often. The main consideration for the jacket is that it help sell the book.\n\n"
    }
  ]
}
