{
  "id": "118693",
  "title": "Fontlab glyphs outline unresponsive",
  "forum": "General Discussions",
  "tags": [
    "fontlab",
    "General Discussions"
  ],
  "content": "I’m having a Fontlab 5.1 issue some of your old hats will probably laugh about. It seems so silly, but I cannot figure this out. Since yesterday the glyphs of my font project, the outlines, have become unresponsive to clicking on them. I cannot select the outline, activate points, nothing. I can select layers, I can turn them off and on, visibility and all. I can select glyphs in the map. I can write in both, preview and the metrics window. Everything else works, except for selecting an outline in any layer (in mask it doesn’t work either).\n\nI looked for a secret lock I might have activated. The only lock in the bottom left corner of a glyphs window is for a different purpose. There doesn’t seem to be any feature that would prevent me from working with the outlines of glyphs, and yet I cannot touch my typeface again. What’s going on?\n\n",
  "author": "Core0",
  "time": "13 Aug 2014 — 2:30am",
  "uid": "181047",
  "comments": [
    {
      "time": "13 Aug 2014 — 5:57am",
      "content": "did you accidentally lock the outline layer?\n\n"
    },
    {
      "time": "13 Aug 2014 — 6:10am",
      "content": "Possibly—I thought about that too and looked everywhere, but I cannot find a way to lock or unlock it. The editing checkmark is inaccessible; it cannot be activated.\n\n"
    },
    {
      "time": "13 Aug 2014 — 6:13am",
      "content": "Here is a screenshot of the layers box. The outline “eye” checkmark is dimmed, I can’t activate it. Yes, I am on Mac OS 10.10 beta (Yosemite), but I have been happily using Fontlab and edited fonts for two weeks since I installed it, without any glitch or incident. The OS version does not cause this sudden lockout.\n\n[http://cl.ly/image/013g2D2N0j3n](http://web.archive.org/web/20150414165811/http:/cl.ly/image/013g2D2N0j3n \"http://cl.ly/image/013g2D2N0j3n\")\n\n"
    },
    {
      "time": "13 Aug 2014 — 6:22am",
      "content": "Does this happen with all of your .vfb files?\n\nIf not, perhaps the permissions on the problem file have changed. Check that.\n\n"
    },
    {
      "time": "13 Aug 2014 — 6:22am",
      "content": "Here is a screenshot with the right mouse-click active:  \n [http://cl.ly/image/2M0y3V3Z3b3o](http://web.archive.org/web/20150414165811/http:/cl.ly/image/2M0y3V3Z3b3o \"http://cl.ly/image/2M0y3V3Z3b3o\")\n\nAs you can see, none of the options is accessible. The lock in the lower left corner should change keyboard access, but unlocking/locking it does not seem to make any difference; I still can’t click or select the outline.\n\n"
    },
    {
      "time": "13 Aug 2014 — 6:22am",
      "content": "Yes, it happens across the board with all vfb files.\n\n"
    },
    {
      "time": "13 Aug 2014 — 6:24am",
      "content": "Permissions where? In the finder’s file system? That would be highly unlikely. I have not moved the file and it happend in the middle of editing. As if something got “turned on” in editing mode.\n\n"
    },
    {
      "time": "13 Aug 2014 — 6:25am",
      "content": "I also tried restarting Fontlab, as well as restarting the entire system.\n\n"
    },
    {
      "time": "13 Aug 2014 — 6:41am",
      "content": "When strange things like this occur in FL the best thing to do is to trash Preferences as well as the Workspace file and do a system restart.\n\nTo access the preferences on OSX hold the Option key as you click on the GO menu to reveal the Library. In Library/Preferences/ find and trash: com.fontlab.studio5.plist\n\nIn that same Library go to Library/Application Support/FontLab/Studio5/Workspaces/ and trash: CurrentWorkspace51.rc\n\n"
    },
    {
      "time": "13 Aug 2014 — 7:09am",
      "content": "James, your tip did the trick. Apparently Fontlab’s workspace and preferences were messed up. A bit annoying, now that I need to enter all preferences again. I don’t even remember all settings… But at least I can work with it again.\n\n"
    },
    {
      "time": "13 Aug 2014 — 8:39am",
      "content": "Glad to hear it. These files occasionally corrupt.  \nI just trash them on a monthly basis whether I have a problem or not!\n\n"
    }
  ]
}
