{
  "id": "1187",
  "title": "Printers Fleurons",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Fleurons, the rich cousins of type designs are neglected? Why!   \n   \nIs the poor too snobbish?\n\n",
  "author": "gerald_giampa",
  "time": "7 Sep 2003 — 12:28am",
  "uid": "2094",
  "comments": [
    {
      "time": "7 Sep 2003 — 10:09am",
      "content": "Because there is nothing essentially typographic about them?   \n   \nI'm a huge fan of the work you have done with fleurons, as you know, but I really wonder to what degree the fact that the fleurons existed on the end of a bit of metal makes them type. Of course, it was convenient for letterpress printers to have them in that format, and the metal carried the fine detail better than wood, but what about today? Is there any particular convenience in having fleurons in _fonts_? Consider the kind of work you have done with fleurons: filing down parts of the pattern to create new patterns. With fleurons in digital fonts, you would either need to edit the font to achieve the same results or convert the type to outlines in something like Illustrator. This makes me think that fleurons would have a richer digital life separate from type, in dedicated pattern making plug-ins for design applications. I imagine such a plug in have suites of pattern elements, which could be edited and saved as new suites, and patterns could be expressed via a set of parameters and, unlike typographic patterns, could be build very quickly just by clicking the 'Build Pattern' button after setting the parameters. What's convenient in metal isn't necessarily the most convenient way to do things in digital.\n\n"
    },
    {
      "time": "7 Sep 2003 — 12:46pm",
      "content": "John,   \n   \nAre you suggesting something like this?   \n   \n [http://www.lanstontype.com/GiampaJugendsali.html](http://web.archive.org/web/20140113075732/http:/www.lanstontype.com/GiampaJugendsali.html)   \n   \nSo you could do something like this!   \n   \n [http://www.lanstontype.com/LanstonPriceList.html](http://web.archive.org/web/20140113075732/http:/www.lanstontype.com/LanstonPriceList.html)   \n   \nDo you suspect anyone would buy it?   \n   \nSome of that hot metal work is built into these arrangements. Maybe I should build some illustrations.   \n   \nMy solution is still in \"font format\", (ever heard of Open Type?) not with illustrator, or an art management program. As you suggest, it was intended as a plug in.   \n   \nIt seems to work for me. It is not a sellable product however, not yet anyway. I don't have resources to hire anyone to work on it. Finland is beautiful but expensive.   \n   \nThe problem I am having is time. I might be running out of it. You probably have heard I have a publishing offer from a New York firm for a book of about my work with printers' fleurons.   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": "7 Sep 2003 — 7:03pm",
      "content": "I had not heard about the book offer. That sounds great.   \n   \nI'm now intrigued by the thought of a non-font approach to pattern making -- more than fleurons, per se: fleurons would represent one kind of pattern element. Heck, just about anything could be turned into pattern elements: letters, pictures (incl. photographs), abstract shapes, etc. I think fonts are much too limited a format for digital pattern making. Digital fonts are built around text processing: pattern making has nothing to do with text. It's a kind of historical, technical accident that ornaments ended up as type: it was a convenient of storing and reproducing little pictures and designs, but I suspect the only reason that we have digital ornament fonts is that no one has yet taken the time to invent a better and more convenient digital format for storing and manipulating pattern elements.\n\n"
    },
    {
      "time": "7 Sep 2003 — 10:53pm",
      "content": "John,   \n   \nThe problems with fleurons, or pattern making programs remains the same whether you use the font format or not.   \n   \nAdvantage of font format.   \n1.) The images are stored under the key caps.   \n   \nDisadvantage of font format.   \n2.) It is difficult to know where the image is stored under the keycaps. (Interface)   \n   \nNaturally you could locate any images under keycaps. The question is, would you want to?   \n   \nThe interface is one of the biggest problems.   \n   \nSo no matter what you do the problems remain identical.   \n   \nYour idea however has great merits, the dynamics of your thought enlivens the possibility of the program outside the traditional typographical usage. Expanding usage into other industries. And possibly exporting some traditional typographical materials into other products.   \n   \nMy principal usage of fleurons has been on the printed page. I have, however, worked on other projects outside that industry. Rugs, scarves and china for instance. Quite the scarf by the way! The scarf would have really suited you. It was understated but striking.   \n   \nFleurons are historically part of printing history, they are beautiful, they belong more often on the printed page. I fear for their loss. I worry that they will never become included again. I have had such great enjoyment with printers fleurons. Bruce Rogers said if he ever got stuck on a remote island he would wish to have printers fleurons and a proof press.   \n   \nSmall Note:   \n   \nPrinters fleurons were \"rightly cast as types\". The similarities between fleurons and type is greater than the difference.   \n   \nMore on that later.   \n   \nLastly, some have mentioned I have an \"advantage\" of using a computer in my \"fleuron design work\". You should know the very opposite is true. Hot metal design was far easier.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "8 Sep 2003 — 3:48pm",
      "content": "The problem I have with putting ornaments in fonts and hacking text encoding to enter them from the keyboard is precisely that you end up with something like AACAACAAGAACAACAA encoded as a text string in an application rather than something that actually relates to the pattern elements. I do not think that ornaments should be mapped to text characters. This is not to say that ornaments can't be accessed via the keyboard, if that's what the user wants to do (although having a visual drag and drop pattern composer should also be an option), but it shouldn't be necessary to enable this by assigning character codes to ornaments and storing them as text. I can imagine an input system in which the user a) builds a suite of pattern elements, b) assigns pattern elements to keys if he wants to use the keyboard, and c) saves both the suite and the keyboard assignments as a project file.   \n   \nBy the way, I think I saw your old car on the street a couple of days ago.\n\n"
    },
    {
      "time": "9 Sep 2003 — 12:55am",
      "content": "John,   \n   \nI have been pondering your thoughts. Why keep fleurons stored by way of keymaps? Macros and collections are a bigger issue than storage. The keys could be the source of many macros. Or, temporary collections. What I am saying is that storage could also be in groups, under keys, or suites of fleurons, under keys instead of a single image. They keys would be free of their usual enslavement. Perhaps a small group of keys could be reserved for assembly. Usually only four positions to a single character. So maybe normal keyboard function could be reserved for number 1-4 for instance. This turns them in all usual positions. Even then, that is a macro function!   \n   \nIt would relieve the keys to perform many duties instead of storing singular design elements. I am just thinking out loud   \n   \nYou are most helpful, thank you.   \n   \nMy car.   \n   \n [http://www.lanstontype.com/BuickIvy.html](http://web.archive.org/web/20140113075732/http:/www.lanstontype.com/BuickIvy.html)   \n   \nDid I tell you how I lost a sale for that car. Francesco, remember my son, he removed his shoes climbed into my car and sat down in the drivers seat. The prospective buyers wife got into the car, sat down beside Francesco testing out her \"proposed\" new seat. Francesco looked at her and said \"you are breaking my fathers heart.\"   \n   \nQuickly she got out, told her husband they were not buying the car, and under his great protest she dragged her husband home.   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": "10 Sep 2003 — 2:15am",
      "content": "With using Indesign, you have easy access to the character map. This make finding extended characters, and ligatures (or fleurons) quite easy.\n\n"
    },
    {
      "time": "19 Sep 2003 — 11:14pm",
      "content": "Actually, it's a glyph map in InDesign, not a character map. Do you really think that makes designing fleuron borders easy: hunting and pecking? Sure, it makes it as easy as finding metal sorts in a type case, but wasn't the whole idea of computers to find new and more efficient ways of doing things, or to make it possible to do things that used to be impossible or at least too difficult to consider? I'm thinking of a parametric system that would allow you to lay out something with the size and complexity of a Persian carpet in minutes, not painstakingly clicking on individual glyphs to make a design.\n\n"
    }
  ]
}
