{
  "id": "118709",
  "title": "Renovatio Deco—80% off—limited time offer",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Renovatio Deco is an eclectic \"art deco\" font style—characterized by bold geometric shapes with lavish ornamentals added for interest.\n\nAvailable at 80% off—Limited time offer.\n\n[Myfonts](http://web.archive.org/web/20150317102602/http:/www.myfonts.com/fonts/typeinnovations/renovatio-deco/)\n\n| Attachment | Size |\n| --- | --- |\n| [Renovatio Deco\\_poster.png](http://web.archive.org/web/20150317102602/http:/typophile.com/files/Renovatio%20Deco_poster_0.png) | 615.01 KB |\n\n",
  "author": "akaczun",
  "time": "13 Aug 2014 — 2:23pm",
  "uid": "68821",
  "comments": [
    {
      "time": "13 Aug 2014 — 2:51pm",
      "content": "I'm rather liking that font indeed!  \nI feel the poster lets you down a little, if I find myself a few pennies better off, I'll buy myself a copy!\n\n"
    },
    {
      "time": "13 Aug 2014 — 3:58pm",
      "content": "Vincent,\n\nSend me an email @ [akaczun@verizon.net](mailto:akaczun@verizon.net)  \nI'll send you a free font if in return you design a cool poster for me using my font ;-)\n\nAlex Kaczun\n\n"
    },
    {
      "time": "30 Aug 2014 — 7:12am",
      "content": "I agree the poster doesn't look great. A solid colored background would do the typeface more justice than this yellow paper background. I would avoid using outer glow as well.\n\nThe typeface itself however is very clever. I especially like b/e/h/q, where the stroke causes an indent in the stem where it wants to connect.\n\n"
    },
    {
      "time": "30 Aug 2014 — 7:14am",
      "content": "And why not include 2 \"half\" fonts which you can use on top of each other to have one half of the font in a different color, like the black/white letters in your promo pictures?\n\n"
    },
    {
      "time": "6 Sep 2014 — 12:10pm",
      "content": "Thank you for the comments, Martin. I like your suggestion of making 2-half fonts, as alternate variations, to get the 2-color look I created using Illustrator in my poster. Actually, that did occur to me as I was working on the promotional poster. Not sure how many customers for that kind of font(s), although something to consider down-the-road, perhaps. My thinking is that graphic artists would prefer to experiment and create these type of variations themselves, on the fly, as I did. But, maybe you are right! I think I'll give it a try. Thanks again.\n\nOn another note, I wonder if a type design concept like this would be desirable for a true italic version as well? How about other weights, small caps or old style figures, etc.—as well as, other “feature” sets? I guess I could keep experimenting, with other variations, if this font becomes successful.\n\nAny other ideas or suggestions appreciated. Thanks, again!\n\n"
    }
  ]
}
