{
  "id": "118723",
  "title": "Serif designed by female",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all, I'm looking for a serif (better not be slab or anything too modern) that is designed by a woman. Or at least its design process should include a woman.\n\nCurrently I have found Mrs. Eaves (which we don't want for its poor on-screen performance), JAF Garamond (co-designed by Shoko Mugikara and Tim Ahrens, but it is, alas, unreleased), and MVB Verdigris (designed by a male, and the font file is produced by a woman). Any suggestions?\n\n",
  "author": "grubstreet",
  "time": "14 Aug 2014 — 9:19am",
  "uid": "205070",
  "comments": [
    {
      "time": "14 Aug 2014 — 10:35am",
      "content": "Typefaces by Carol Twombly  \nChaparral (1997)  \nCharlemagne (1989)  \nLithos (1989)  \nMirarae (1984)  \nMyriad (1991, designed with Robert Slimbach)  \nNueva (1994)  \nPepperwood (1993)  \nRosewood (1993)  \nTrajan (1989)  \nViva (1993)  \nZebrawood (1993)\n\nFrom:  \n [http://en.wikipedia.org/wiki/Carol\\_Twombly](http://web.archive.org/web/20150419023427/http:/en.wikipedia.org/wiki/Carol_Twombly \"http://en.wikipedia.org/wiki/Carol\\_Twombly\")\n\n"
    },
    {
      "time": "14 Aug 2014 — 11:17am",
      "content": "Happy hunting ;)  \n [http://typophile.com/node/80648](http://web.archive.org/web/20150419023427/http:/typophile.com/node/80648 \"http://typophile.com/node/80648\")\n\nTo give a single suggestion, starting with the letter “A”, Abril, co-designed by Veronika Burian (just like many of Type Together’s typefaces):  \n [http://www.type-together.com/Abril](http://web.archive.org/web/20150419023427/http:/www.type-together.com/Abril \"http://www.type-together.com/Abril\")\n\n"
    },
    {
      "time": "14 Aug 2014 — 11:15am",
      "content": "I feel better about liking Adobe Caslon now.\n\n"
    },
    {
      "time": "14 Aug 2014 — 11:30am",
      "content": "Curious why being female-designed is a primary concern.\n\n"
    },
    {
      "time": "14 Aug 2014 — 11:47am",
      "content": "¶ The most elegant serif typeface designed by a woman remain:  \n [Linotype Rameau](http://web.archive.org/web/20150419023427/http:/www.fonts.com/font/linotype/rameau) by [Sarah Lazarevic](http://web.archive.org/web/20150419023427/http:/www.lazarevic.fr/).\n\nIt's based on the 1747 musical score of composer [Jean-Philippe Rameau](http://web.archive.org/web/20150419023427/http:/en.wikipedia.org/wiki/Jean-Philippe_Rameau).\n\nWatch [Les boréades](http://web.archive.org/web/20150419023427/http:/lazarevic.fr/files/gimgs/41_boreades-1.jpg).\n\n"
    },
    {
      "time": "14 Aug 2014 — 11:52am",
      "content": "[Elena](http://web.archive.org/web/20150419023427/http:/processtypefoundry.com/fonts/elena/) by Nicole Dotin\n\n[Ysobel](http://web.archive.org/web/20150419023427/http:/www.fonts.com/font/monotype/ysobel) by Robin Nicholas and Alice Savoie\n\n[Sirba](http://web.archive.org/web/20150419023427/http:/www.type-together.com/Sirba) by Nicolien van der Keur\n\n[Bullen](http://web.archive.org/web/20150419023427/http:/www.fontbureau.com/fonts/Bullen/) by Juliet Shen\n\n"
    },
    {
      "time": "14 Aug 2014 — 12:09pm",
      "content": "It has to be a female-designed typeface because the object we’re dealing with is feminism postcards and posters.\n\n"
    },
    {
      "time": "14 Aug 2014 — 1:05pm",
      "content": "Couldn't the font just have a female name like Joanna?\n\n"
    },
    {
      "time": "14 Aug 2014 — 2:48pm",
      "content": "Joanna is by Eric Gill, we all know that.\n\n"
    },
    {
      "time": "14 Aug 2014 — 3:36pm",
      "content": "Seattle people have no sense of humor.\n\n"
    },
    {
      "time": "14 Aug 2014 — 4:50pm",
      "content": "<cite>Happy hunting ;)</cite>  \n<cite>http://typophile.com/node/80648</cite>\n\nEven with that list to work from, I had to search on several names to find even one good example to suggest (as opposed to, say, a Bodoni, a Caslon, or a Garamond - one would want something distinctive, to include more of the designer's own originality)...\n\n[Bullen](http://web.archive.org/web/20150419023427/http:/www.identifont.com/find?font=Bullen&q=Go) by Juliet Shen.\n\n"
    },
    {
      "time": "14 Aug 2014 — 5:36pm",
      "content": "I think “a serif” is too vague a description for giving any meaningful suggestion.  \nNonetheless, here’s a couple of lively ones:  \nGarden, co-designed by Guisela “Coto” Mendoza: [http://www.myfonts.com/fonts/los-andes/garden/](http://web.archive.org/web/20150419023427/http:/www.myfonts.com/fonts/los-andes/garden/ \"http://www.myfonts.com/fonts/los-andes/garden/\")  \nAnne Bonny, by Melle Diete: [http://www.myfonts.com/fonts/mellediete/anne-bonny/](http://web.archive.org/web/20150419023427/http:/www.myfonts.com/fonts/mellediete/anne-bonny/ \"http://www.myfonts.com/fonts/mellediete/anne-bonny/\")\n\n"
    },
    {
      "time": "14 Aug 2014 — 10:59pm",
      "content": "\"Serif\" was what was requested...  \nBut they seemed to like MVB Verdigris, so I guess it's something Garalde. It would have to perform well on screen, while not letting too much x-height make it too modern like a slab or a Clarendon (after all the user it represents are a collaborative union of an illustrator and a letterpress printer). It should have a certain style and asserts a clean and independent attitude (to accompany the theme of principled feminism), as opposed to highly functional typefaces designed just to look legible at 12 points, or to some Neo-Grotesque lacking any emotion and feeling.\n\n"
    },
    {
      "time": "15 Aug 2014 — 12:32am",
      "content": "Paratype has a whole bunch of really nice ones. Say what you will about Russia but at least their type design profession seems less patriarchal than the Western one.\n\nBannikova: [http://www.myfonts.com/fonts/paratype/bannikova/](http://web.archive.org/web/20150419023427/http:/www.myfonts.com/fonts/paratype/bannikova/ \"http://www.myfonts.com/fonts/paratype/bannikova/\")  \nAdonis: [http://www.myfonts.com/fonts/paratype/adonis/](http://web.archive.org/web/20150419023427/http:/www.myfonts.com/fonts/paratype/adonis/ \"http://www.myfonts.com/fonts/paratype/adonis/\")  \nOriginal Garamond: [http://www.myfonts.com/fonts/paratype/original-garamond-bt/](http://web.archive.org/web/20150419023427/http:/www.myfonts.com/fonts/paratype/original-garamond-bt/ \"http://www.myfonts.com/fonts/paratype/original-garamond-bt/\")  \nNew Journal: [http://www.myfonts.com/fonts/paratype/new-journal/](http://web.archive.org/web/20150419023427/http:/www.myfonts.com/fonts/paratype/new-journal/ \"http://www.myfonts.com/fonts/paratype/new-journal/\")\n\n"
    },
    {
      "time": "15 Aug 2014 — 1:23am",
      "content": "Adding to Johan’s suggestions:  \n [http://www.myfonts.com/fonts/paratype/nat-flight/](http://web.archive.org/web/20150419023427/http:/www.myfonts.com/fonts/paratype/nat-flight/ \"http://www.myfonts.com/fonts/paratype/nat-flight/\")\n\n"
    },
    {
      "time": "15 Aug 2014 — 12:05pm",
      "content": "Grubstreet, aren’t you being rather hypocritical?  \n(You appear to be male.)\n\n"
    },
    {
      "time": "15 Aug 2014 — 4:52pm",
      "content": "Veronika Burian's [Maiola](http://web.archive.org/web/20150419023427/http:/www.type-together.com/Maiola), or any of her collaborations with José Scaglione.  \n [http://www.type-together.com/](http://web.archive.org/web/20150419023427/http:/www.type-together.com/ \"http://www.type-together.com/\")\n\n"
    },
    {
      "time": "15 Aug 2014 — 5:01pm",
      "content": "(Yes, I am a male.)  \nBut still, um, I feel slightly offended. But never mind – can you explain what you (@Nick Shinn) mean by me being \"hypocritical?\" Is that because I, as a male, should not be asking about female-designed typefaces?\n\n"
    },
    {
      "time": "15 Aug 2014 — 8:47pm",
      "content": "Gudrun Zapf-von Hesse has designed some serif fonts.\n\n"
    },
    {
      "time": "15 Aug 2014 — 9:36pm",
      "content": "Grubstreet: I don’t mean to offend—I ﬁnd the ethics of this situation interesting.  \nWhy would your client hire a male postcard/poster designer but require a female-designed font?  \nWhy would you accept this double standard?\n\n"
    },
    {
      "time": "15 Aug 2014 — 10:09pm",
      "content": "One hires a postcard designer from the small pool of competent ones available locally, without committing the crime of discriminating by sex.\n\nOne chooses a typeface from the thousands that are passively available, with no law prohibiting the sex of the designer from being taken into account.\n\nOne has no choice about living in the real world.\n\n...ah, now I see how I am being too harsh. If the postcard is to reflect feminism, admitting a female influence into the project only in a way that does not give any woman any direct creative input into the project, yes, that does raise a bit of a question. One that _perhaps_ can't be entirely waved away by citing short deadlines.\n\nI'm not convinced the issue is really ethical, not knowing the details of the situation, but upon reflection I see your point is much more legitimate than it first seemed to me.\n\n"
    },
    {
      "time": "16 Aug 2014 — 12:15am",
      "content": "@Nick Shinn: I guess it is time that I am impelled to reveal some more background information.  \nI am a university student majoring in design. Now I work as a summer _intern_ for a local letterpress artist who collaborates with her friend – an illustrator – to produce postcards, posters, etc.. These two women _decided themselves_ that their work should be on the subject of feminism. As they both have inferior knowledge about on-screen typography (while superior about print typography), I decided to help them by providing advice.\n\nTo be honest, as long as the typeface is beautiful and appropriate, I personally won't care if it is designed by a female or a male. But since it is a project about feminism, it's good to have a little secret: \"see, not only the physical objects are produced by women, even the typefaces are!\"\n\n---\n\nThe problem here, @Nick Shinn, is that you presumed that a) I am hired to do design work, and b) my clients are supposedly (hypocritical) male who wants the work look feminine. Undoubted, but only in that case would I see the hypocrites in the situation. If I were you, I probably would be more cautious about my presumptions before using vocabulary of moral condemnation like \"hypocritical.\"\n\n"
    },
    {
      "time": "16 Aug 2014 — 9:22am",
      "content": "Perhaps hypocrite was the wrong term, and tokenism or double standard would be more accurate.  \nWhy should you be offended if my presumptions are incorrrect?  \nI made no presumptions about the gender of your client, for instance.  \nWe are discussing ethics, how would you have phrased my inquiry?\n\nAt any rate, I was querying whether your design process was hypocritical. If the project had been finished and I were “passing judgement”, that would have been different.\n\nIt seems logical to me that if a client wants a job with gender-specific design, that if one is the wrong gender, the thing to do would be to decline in favor of a designer of the appropriate gender.\n\nHow is this different than if the designer is expensive or busy? Wouldn’t the designer say to the client, you would be better off with a designer who charges less and can do the job quickly?\n\nIn which case, the comparison is with charging more for one’s time and working with inexpensive materials. If that is a legitimate modus operandi, perhaps then tokenism is not so bad, and we need another word for it, such as empowerment? Just asking.\n\n"
    },
    {
      "time": "16 Aug 2014 — 10:34am",
      "content": "@Nick Shinn:  \nYour message is rather interestingly strange to me. It seems that you believe in some form of gender-specificism that would define a male designer as morally wrong if he ever taps into the females' design affairs (and probably vice versa?) – or, probably not morally wrong, but morally indecent. I disagree with this view; it seems to be a guise for imprudently extreme feminism. Yet I do not wish to elaborate my counterargument, since you have not clearly stated that you are with such views.\n\nI would like to emphasize that I have not participated in any of the work process of this series. My intern boss and her friend asked me if I have any ideas on an on-screen typeface that would replace their original choice, Mrs. Eaves, and I agreed to help them. There are only a few demands: beautiful, legible on screen, and designed by a female. And then off I went.  \nThen it all goes back to my previous post: is it morally wrong (or indecent?) to accept their request simply because I am not a female and I have no right to participate in their design judgments?\n\nI said that I felt offended after I read your first reply in which you said without any other elaborated arguments that I am a hypocrite. I am not saying that I am offended by your wrong presumptions, although wrong presumptions can certainly bring out negative effects.\n\n---\n\nTokenism:\n\n> the practice of making only a perfunctory or symbolic effort to do a particular thing, esp. by recruiting a small number of people from underrepresented groups in order to give the appearance of sexual or racial equality within a workforce.\n\nHow does tokenism even come into this conversation?\n\n"
    },
    {
      "time": "16 Aug 2014 — 12:18pm",
      "content": "Needlessly inserting myself into the argument seems unwise, but since there's little to lose...\n\nOnline discussions lack verbal intonation and body language, so there's a heightened risk of misinterpretation. I'm assuming that's what's happened here. With that said, Nick did bring up an interesting issue regarding the contradictions and inconsistencies in a male making artistic decisions on a project about women artists.\n\nI don't think the issue rises to the level of questioning ethics, honesty or suggesting possible hypocrisy. But it does point out some interesting kinks in how far to go in maintaining purity of concept when the issue in question lacks inherent purity. We're a single species, and attempts to draw immutable dividing lines between our component parts is not only unwise, it's an effort in futility.\n\nA project about feminism (or masculinity) is fine, and I like GrubStreet's idea of using typography designed by a woman; it's a clever behind-the-scenes extra. The fact that he's a male points back to my previous paragraph about how, in reality, we're all one and that our differences don't preclude the commonalities that make us inseparable and dependent upon one another. In other words, I see no problem with his participation in this feminist project.\n\n"
    },
    {
      "time": "16 Aug 2014 — 3:14pm",
      "content": "\\> we're all one\n\nNice in theory, but a long-term client (a state government agency) once dropped me because they were under pressure to hire a black designer. And then they had the nerve to ask me to recommend a black designer to replace me.\n\n"
    },
    {
      "time": "16 Aug 2014 — 7:34pm",
      "content": "I won't post names in case there's some reason you're not, but I'm pretty sure I know who your clients are, because I have several of their broadsides. I always thought it was strange that the caption text is printed in … Futura Condensed? … which doesn't particularly go with the rest of their aesthetic at all. I'm sure they are knowledgeable about letterpress and about hand-lettering, but not so sure about typography per se, even in print. Futura wasn't designed by a woman.\n\n"
    },
    {
      "time": "17 Aug 2014 — 3:39pm",
      "content": "As I recall, some faces from [Cyreal](http://web.archive.org/web/20150419023427/http:/www.cyreal.org/) are partly or fully designed by women.\n\n"
    },
    {
      "time": "18 Aug 2014 — 1:51am",
      "content": "Grubstreet: My beliefs have nothing to do with this discussion.  \nI simply noted that your design process, as it appeared from your initial description, was not internally consistent.  \nI asked if you were aware of that.  \nI assumed that you were the designer, which is certainly the impression given by your original post.\n\nAs I said subsequently, hypocrisy was perhaps not the right word to describe that inconsistency.  \nAnd perhaps not tokenism.  \nPlease bear with me, I might get it right eventually.\n\nThe concept of “femwashing” doesn’t apply here, as the audience has no idea of who designed the fonts.\n\nIt seems more along the lines of “affirmative action”—given that almost all the best-known, go-to and default fonts were designed by men.\n\n"
    },
    {
      "time": "6 Dec 2014 — 10:09pm",
      "content": "I think some very interesting points have been raised regarding consistency and purity of concept, though I have to agree when one says there is nothing inherently contradictory about a male designer working on a project about feminism.\n\nHowever, in what way does using a typeface designed by a female become anything about feminism? I think the notion that a female couldn't be found to do the job GrubStreet is doing makes the gender imbalance in the industry only more obvious. If this project is all about hidden symbolism, I would argue it's inconsistent hidden symbolism.\n\nWould you say if everything is designed by males the project becomes about male empowerment? I think not. I'm really annoyed with the fact that people think female exclusivity equates to feminism. You're not even verifying in what conditions these women made these typefaces.\n\nI think it's absolutely ridiculous restrictions have been set on the gender. Why wouldn't you select the typeface that works best for this project regardless of gender? Is someone going to say \"Yes, this project could have been better, but we put a restriction on the gender\". How is that feminist? It's ludicrous.\n\nFeminism is about equality, not exclusivity. You're leaning towards gender discrimination in the opposite direction.\n\n"
    },
    {
      "time": "20 Dec 2014 — 1:19am",
      "content": "Все культуры, страны и нации разные,  \nу каждого народа приманка традиции и обычаи.  \nНо одно остается общим — брак! Каким бы «нецивилизованным»  \nи изолированным ни было то либо иное сообщество,  \nранехонько либо прот вы увидите в нем нечто более-менее похожее  \nна свадьбу. Все от страны к стране свадебные традиции очень  \nразнятся, а порой среди них встречаются такие, которые могут  \nудивить alias даже шокировать. Предлагаем вашему внимаю перечень  \nсамых странных свадебных традиций со всего мира.\n\n"
    },
    {
      "time": "20 Dec 2014 — 1:19am",
      "content": "Все культуры, страны и нации разные,  \nу каждого народа приманка традиции и обычаи.  \nНо одно остается общим — брак! Каким бы «нецивилизованным»  \nи изолированным ни было то либо иное сообщество,  \nранехонько либо прот вы увидите в нем нечто более-менее похожее  \nна свадьбу. Все от страны к стране свадебные традиции очень  \nразнятся, а порой среди них встречаются такие, которые могут  \nудивить alias даже шокировать. Предлагаем вашему внимаю перечень  \nсамых странных свадебных традиций со всего мира.\n\n"
    },
    {
      "time": "22 Dec 2014 — 4:43pm",
      "content": "And this has anything to do with what this thread is about?\n\n"
    }
  ]
}
