{
  "id": "118887",
  "title": "Did the Gothics become, well, Gothic?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "With font preference increasingly gravitating towards \"rounder\" and \"friendlier\" fonts, do you think the Gothics (News, Trade, ...) are \"passé\"? It's fascinating that even the corporate world is following the hype in an attempt to appear more accessible and humane, even when nothing in their culture changes.\n\n",
  "author": "Jean Louis",
  "time": "21 Aug 2014 — 3:29am",
  "uid": "221766",
  "comments": [
    {
      "time": "21 Aug 2014 — 8:06am",
      "content": "Faces like News Gothic and Franklin Gothic were basically the first sans-serif faces acceptable by modern standards. They are old-fashioned, about at a level with the geometric sans faces such as Kabel or Futura, or with Century Expanded.\n\nHowever, given the variety of sans-serif faces in use today, rather than the old monoculture of Univers and Helvetica, it may well be that they would now pass unnoticed in the shuffle and could potentially be due for a revival.\n\n"
    },
    {
      "time": "21 Aug 2014 — 8:36am",
      "content": "_the corporate world is following the hype in an attempt to appear more accessible and humane, even when nothing in their culture changes._\n\nAlas, you've just described about 85 per cent of marketing. Too many good creative professionals have to do this for a living.\n\n"
    },
    {
      "time": "21 Aug 2014 — 9:02am",
      "content": "I'm not sure that recent trends are responsible for the older Gothics becoming passé. I've been around for several decades now, and during that time they've never exactly been \"in.\"\n\nThose slightly awkward faces were long ago eclipsed by the more refined Univers, Frutigers and Helveticas of the world. The exception (at least for me) might be Franklin Gothic, which is still one of my go-to typefaces. Then again, who am I to say — I just recently started using Akzidenz-Grotesk on a few projects.\n\n"
    },
    {
      "time": "22 Aug 2014 — 1:49am",
      "content": "<cite>The exception (at least for me) might be Franklin Gothic</cite>\n\nRightly so. It's a great font, Porsche still uses it in a clean and understated way for headlines.\n\n"
    }
  ]
}
