{
  "id": "119057",
  "title": "Revolutionary Script and Typography",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "humanistic",
    "post-modernism",
    "script",
    "writing"
  ],
  "content": "¶ While reading again Fred Smeijers' _Counterpunch_, the author stated that the humanistic writing was a philosophical trend and therefore an artificial form of writing by breaking a cycle and by returning to an ancient era. You may assert that the humanistic writing was the first attempt of post-modernism.\n\n1. Was there another post-modernistic attempt before the·Quattrocento·with a breaking point?\n\n2. How would you consider William Morris' typographic leaning of going back to the humanistic origin? The second post-modernistic attempt?\n\n",
  "author": "Fournier",
  "time": "29 Aug 2014 — 5:22am",
  "uid": "212885",
  "comments": [
    {
      "time": "29 Aug 2014 — 6:02am",
      "content": "Well, you can't assert that it as some sort of post-modernist attempt: in the most generous scenario, it was a modernist attempt. ;)\n\nRenaissance \"humanism\" was actually a neo-classicism (getting inspiration in Ancient Greece and Rome), with a step forward: integrating painture (that was considered a métier of artisans, not artists), for example, with the liberal arts (math, geometry, stone-masonry); it was about status quo, since it was in the Renaissance that painters started to sign their work, construct their work in conical perspective and, of course, trying to create geometrically constructed letterforms (check Durer's work, for example).\n\nThe idea of humanism, philosophically speaking, was that Man was the main character in life, not God; so Man's creations should serve men, or express Man, from it's point of view: rationality was Man's triumph.\n\nAnd post-modernism is not an revivalist attitude: if we check Lyotard's writings, it's more a disenchanted view on History (a sort of post-WW2 trauma), that says that nothing is special, so everything can be made special -- anything goes.\n\nSo, answering your questions:\n\n1. If we understand this question as \"was there any other breaking with the old attitude before the Quattrocento\", then yes. Even in writing. The whole Middle-Ages was about that, but not in a \"breaking against God\" attitude (although looking at Bosch work still makes me suspicious about this,since it's so filled with pagan references). In type, it was mostly about national and cultural identity, both calligraphy-wise and writing systems.\n\n2. Morris was clearly a pre-Modernist, since he was a Romantic. Or better, a pre-Rafaelite. The Industrial Revolution was happening in his time, along with the liberal shift of society. The pre-Rafaelites used themes of pre-Renaissance as a rebellious attitude against the Academy that had become too canonical; in the other hand, they started exploring naturalist and every-day-life themes (something almost new, if we look to Turner or Courbet) also as a \"breaking the canonical chains\" thing.\n\nBack to Morris: the standardization that the machine brought made the impression that artistry would soon become irrelevant: so Morris tried to pick up on what a typesetting machine could not do. Even Gill wrote about the effects of the industrialization had on typesetting. And Morris when way back in time than to the Renaissance: he has beautifull Gothic-inspired books from the Kelmscott Press.\n\nSo no, not a post-Modernist attempt: I believe it was a pre-Modernist one.\n\nAnd sorry for the long post, I just couldn't help myself. :P\n\n"
    },
    {
      "time": "29 Aug 2014 — 7:21am",
      "content": "> 1. If we understand this question as \"was there any other breaking with the old attitude before the Quattrocento\", then yes. Even in writing. The whole Middle-Ages was about that, but not in a \"breaking against God\" attitude (although looking at Bosch work still makes me suspicious about this, since it's so filled with pagan references). In type, it was mostly about national and cultural identity, both calligraphy-wise and writing systems.\n\n¶ Which part of the Middle Age do you refer to when asserting that it is about national and cultural identity?  \nEarly (Oncial/Caroline/Insular) or Late (Frakturs) era?  \nWhich writings in particular broke down the path?\n\n¶ So when the humanist movement appeared, they broke the national-cultural lineage.\n\n"
    },
    {
      "time": "29 Aug 2014 — 7:31am",
      "content": "Let's see now; at one point, there were rustic capitals and uncials, and then Charlemagne came along.\n\nCarolingian writing was sort of legible, and then gradually morphed into blackletter.\n\nHumanistic writing did indeed evoke Roman incised stone capitals, like those of the Trajan Column. And it is known that this was connected to a larger movement aimed at integrating the classics into scholarship.\n\nWas this post-mediaevalism the post-modernism of its time? I would be leery of such analogies. Post-modernism is an attempt to sail into uncharted waters on the basis that even modernism is inadequate; the humanistic movement was aimed at removing the stifling hand of Church domination from all aspects of life.\n\nTo conflate a practical movement aimed at legibility in writing and freedom in life with post-modernism is, in my opinion, to give post-modernism undeserved praise.\n\n"
    },
    {
      "time": "30 Aug 2014 — 1:44am",
      "content": "> ¶ Which part of the Middle Age do you refer to when asserting that it is about national and cultural identity?  \n> Early (Oncial/Caroline/Insular) or Late (Frakturs) era?  \n> Which writings in particular broke down the path?\n\nWell, all the Middle Age. You see, the notion of the Middle Age as a single historic period is an evention of the Renaissance. They called it the Dark Age in opposition to their era of Light. But we can't judge the Middle as something obscure and non-diverse -- it was quite the opposite.\n\nCyrillic is a medieval creation, as Slavonic. We had the Norse kingdoms changing writing systems a lot, the arabic invasions in Iberia (and their numerals spreading to the latim alphabet), barbarians bringing new sounds and the need for new glyphs, and just to name a few.\n\nAnd contrary to the usual belief, cultural exchange in Western Europe was huge. Central Europe had a lot of contact with the middle east and Asia.\n\nSo, as I said before, it was more more like a modernist attempt: throwing the heritage and it's diversity away, in an illusion of a civilizational pinnacle.\n\n"
    },
    {
      "time": "30 Aug 2014 — 2:55am",
      "content": "...And one of the greatest Men of Renaissance, Copernicus, was a priest.\n\n"
    },
    {
      "time": "30 Aug 2014 — 9:42am",
      "content": "It definitely is true that progress took place during the Middle Ages. For example, eyeglasses were invented in the thirteenth century.\n\nThere was Classical Antiquity. Greece was a cultural pinnacle - pioneering in democracy, in mathematics, and in philosophy. Rome was not as inspiring, but it did maintain peace and order.\n\nSo after the Christianized Roman Empire collapsed, allowing barbarian depredations, this was viewed as going downhill by the people at the time. But the mediaeval world progressed out of the Dark Ages into the later Middle Ages.\n\nHowever, with things like the Inquisition, one thing the Middle Ages was not was free. Authorities with the ability to initiate force presumed to intrude on freedom of conscience and thought. The rule of the Catholic Church in that period was an early example of totalitarianism. Viewing the Renaissance as an important positive event is no more biased than viewing the fall of the Soviet Union as an important positive event.\n\n"
    },
    {
      "time": "31 Aug 2014 — 2:26am",
      "content": "¶ Actually, it was during the Renaissance and the Baroque era that the Church applied the inquisition to the letter and not during the Middle Age. Some printers and typeface designers of the XVI th century were converted to the reformed Church therefore they were considered heretics. Remember the odd case of Étienne Dolet who was a diehard atheist militant.  \n  \n❧  \n  \n¶ Anyway and going back to the initial topic, I still wondered if there was a philosopher or a monk who changed the official script with a breaking up leaning before the Renaissance. What about Alcuin? How do you interpret his writing reform?\n\n"
    }
  ]
}
