{
  "id": "119090",
  "title": "1923 ATF Specimen Book",
  "forum": "Design",
  "tags": [
    "1923 ATF Specimen Book",
    "Design"
  ],
  "content": "In the 1960s I was marking up copy as a type specifier in an advertising typography house in LA when they closed shop. One of the items I was able to take with me was a 1923 ATF specimen book that I'm now offering for sale on ebay:\n\n[http://cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&item=271592263221&ssPageNa...](http://web.archive.org/web/20150417141124/http:/cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&item=271592263221&ssPageName=ADME:L:LCA:US:1123 \"http://cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&item=271592263221&ssPageName=ADME:L:LCA:US:1123\")\n\nIt has been well used and shows some signs of wear, but it is in excellent condition considering its age.\n\nThis is an invaluable reference volume for any serious digital age designer.\n\nI've placed quite a few images of various pages of the book on my ebay listing, but if you have any questions, feel free to ask.\n\nThanks,\n\nDC\n\n",
  "author": "dct1",
  "time": "31 Aug 2014 — 6:41am",
  "uid": "222519",
  "comments": [
    {
      "time": "31 Aug 2014 — 8:08am",
      "content": "What other type specimens might you have for sale?\n\n"
    },
    {
      "time": "31 Aug 2014 — 9:21am",
      "content": "I might be able to go up in the attic and find some type specimen books from the 60s & 70s from type houses I've worked at. They would be the type used by in-house specifiers to mark up copy that ad agencies would submit for ad repro proofs. Most would include some handset, Ludlow, Linotype, and Monotype line samples. Is that what you had in mind?\n\n"
    },
    {
      "time": "31 Aug 2014 — 10:19am",
      "content": "Those sorts of things sound great. People on this board are interested in all sorts of type specimens and catalogs etc.\n\n"
    },
    {
      "time": "31 Aug 2014 — 10:25am",
      "content": "I'll see if I have some time next week to dig around upstairs. I also remember saving a few of a monthly newsletter type booklet put out by a Chicago advertising typographers association. They contained some interesting articles this group might find of interest.\n\n"
    }
  ]
}
