{
  "id": "119092",
  "title": "looking for suitable grid system",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Does not have a baseline grid grid system. at moment  \nPlease feel free to comment on a grid system you may find would be suitable. ive heard of the web layout grid system called the 960 grid stystem . I am happy with 4 coloumn grid is my current idea. Feel free to post below you ideas or links to grid sytems  \n Rough image layout illustrator image attached - final will have to completed indesign\n\n| Attachment | Size |\n| --- | --- |\n| [3d textures- sketch.jpg](http://web.archive.org/web/20150417163124/http:/typophile.com/files/3d%20textures-%20sketch.jpg) | 265.95 KB |\n\n",
  "author": "512pixel",
  "time": "31 Aug 2014 — 8:44am",
  "uid": "46811",
  "comments": [
    {
      "time": "31 Aug 2014 — 8:59am",
      "content": "I am not asking for anyone to complete the design. I am asking for comments on ideas about grid systems. I have a basic idea about width and height being symmetery . Which makes design functional and astetically pleasing to the eye. .. This is guesswork at the moment i would like to take these ideas to a completed design\n\n"
    },
    {
      "time": "31 Aug 2014 — 9:52am",
      "content": "In my opinion you don't need a grid system (other than alignment) for a small, simple layout like you're showing, just make it visually attractive and functional.\n\n"
    },
    {
      "time": "31 Aug 2014 — 11:24am",
      "content": "There are a number of grid systems out there, but, as James inferred, they’re mostly aimed at larger, complex project.  \nHowever, one that could be of interest for typophiles as well is Type & Grids: [http://www.typeandgrids.com](http://web.archive.org/web/20150417163124/http:/www.typeandgrids.com/ \"http://www.typeandgrids.com\")\n\n"
    },
    {
      "time": "31 Aug 2014 — 1:13pm",
      "content": "I would like to ask another question. It is in releation to the size of the gutters. If my body text is Helvetica size 10 pt is the leading.. Is good practice to use the gutters width the same size as the body text leading .\n\n"
    },
    {
      "time": "31 Aug 2014 — 4:25pm",
      "content": "If you're talking about the space between those squares of color, 12 or 13 pts might work fine. But I'd use more for the outer margins, and I'd normally like to see more between columns of text.\n\nGrids are fine, but as Riccardo mentioned they are more for larger projects, like pages of text or several documents that need to look similar. For a small project like this I'd just space things to look attractive.\n\n"
    },
    {
      "time": "1 Sep 2014 — 8:35am",
      "content": "One more thing — if your layout is actual size, the type beneath the color squares looks pretty tiny.\n\n"
    },
    {
      "time": "2 Sep 2014 — 8:12am",
      "content": "In print, underlying grids serve as an invisible framework against which elements can be positioned to impart unity and cohesiveness to the design.\n\nIn web design, the 960 and other similar grids do much the same thing, but they also serve a different purpose. In essence, they're prebuilt frameworks where the CSS is already thought through and can be applied to a grid structure that can reconfigure itself in response to various display resolutions.\n\nHow this is relevant to the sketch you posted, I'm not quite sure.\n\n"
    },
    {
      "time": "2 Sep 2014 — 6:07am",
      "content": "After the advice i now understand the size of this project didnt require a complicated grid system.  \nI will later post my cv which does require grid sytem in the near future. I will open this post again . tank you for the commen on the 960 grid sytem , i have better understanding now the 960 grid is not onlya about layout but also the how efficient it downloads the pages\n\nafter the advice i left the design simple as it was only to dowload some textures . Just usd a baseline grid  \n [http://fav.me/d7xnz3u](http://web.archive.org/web/20150417163124/http:/fav.me/d7xnz3u \"http://fav.me/d7xnz3u\")\n\n"
    },
    {
      "time": "2 Sep 2014 — 9:55am",
      "content": "Your new layout has some areas that look dark gray and some that look black.\n\n"
    },
    {
      "time": "3 Sep 2014 — 4:15am",
      "content": "correct dark grey and black have been used jame s. reasion i choose this colour scheme . 3d tota sites and the new adobe packages cc have chosen black and grey.  \n [http://www.3dtotal.com/](http://web.archive.org/web/20150417163124/http:/www.3dtotal.com/ \"http://www.3dtotal.com/\")\n\n"
    },
    {
      "time": "3 Sep 2014 — 7:01am",
      "content": "I can't speak for James, but I think what he might be saying is that it appears to be a mistake because the gray and the black are so close in value. You might try lightening up the gray just a bit so that it looks intentionally different from black.\n\nThere's a greater distinction between the values on the 3dtotal.com site because of its use of lighter grays, diagonal lines and the even lighter gray lines separating the different gray/black areas, which makes the subtle differences appear intentional.\n\n"
    },
    {
      "time": "4 Sep 2014 — 5:24am",
      "content": "ok will go 1 shade down as there realy only about 4 gray values that can be seen . I will go a couple of shades down in the grey colour . thk u\n\n"
    },
    {
      "time": "4 Sep 2014 — 9:30am",
      "content": "\\> the gray and the black are so close in value\n\nExactly. When two colors are very close but don't quite match, it looks like a mistake. Either make them the same or definitely different.\n\nSame thing when 2 objects almost align but not quite, or 2 lines of adjacent type are just a tiny bit different in size. There are exceptions, but in general it looks like a mistake.\n\n"
    },
    {
      "time": "11 Sep 2014 — 10:23am",
      "content": "Buy Josef Muller-Brockmann's Grid Systems book. It's an excellent resource for learning to work with grid systems.\n\n"
    }
  ]
}
