{
  "id": "119198",
  "title": "Individual glyph contours hierarchy in Fontlab",
  "forum": "Build",
  "tags": [
    "contour",
    "fontlab",
    "glyph",
    "Hierarchy",
    "Build"
  ],
  "content": "Hello everyone,\n\nI'm working on rather experimental font - each glyph consists of many horizontal stripes (individual paths/contours)\n\n ![](http://web.archive.org/web/20141111095041im_/http:/typophile.com/files/Typophile_5887.png)\n\nIs there any way to re-arrange thier hierarchy/order?\n\nFor exmple the top contour would be #1 and the last one #23 ? (or otherwise)\n\nI've figured out how to display their numbers (ctrl + F7) but how to change their order?\n\nThumby and time consuming solution would be probably \"cut and paste\" in the right order but I'm looking for something more effective.\n\nAny help appreciated,  \n(v)\n\n",
  "author": "Vít Šmejkal",
  "time": "4 Sep 2014 — 5:49am",
  "uid": "22078",
  "comments": [
    {
      "time": "5 Sep 2014 — 5:11am",
      "content": "In the mode you’ve probably been already, the one you set the starting points from, right-clicking on each contour should give you a contextual menu with some very basic contour-ordering commands. But it won’t be very effective either. I haven’t done much FontLab scripting in particular, but looking at your contours, just finding the lowest _y_ coordinate in each contour and sorting the contours by this value should do, algorithmically.\n\nIs there a reason why do you want them sorted? Because the only reason I myself can think of is the file size, as the bigger the distances between points, the bigger the numbers that need to be stored. In case of a TrueType binary, for example, the threshold is at 256 font units, above which storage requirements for a particular distance double, but that’s still mere two bytes. Machine movement of some kind?\n\n"
    },
    {
      "time": "5 Sep 2014 — 3:04am",
      "content": "Thank you, Grzegorz,  \nThe right-click menu helps :)\n\nIt involves some clicking, but it's working fine.  \nI'm not experienced in scripting at all, luckily the number of glyphs in my font is not that high.\n\nThe whole sorting \"problem\" is probably not that big deal - I was rather concerned about potential interpolating issues.\n\nThanks,  \n(v)\n\n"
    },
    {
      "time": "10 Sep 2014 — 1:16pm",
      "content": "removed\n\n"
    },
    {
      "time": "10 Sep 2014 — 1:56pm",
      "content": "In Glyphs \\> CMD+Shift+R\n\nBy the way, it looks awesome!\n\n"
    }
  ]
}
