{
  "id": "119161",
  "title": "Webfont How-to and Discussion ?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "webfonts web website home page online font"
  ],
  "content": "Hello. I tried searching Typophile to learn how to convert my fonts and use them as webfonts. Alas only one topic turned up with outdated links. Webfonts are interesting and topical, and may deserve a special Typophile Section devoted to them.  \nMeanwhile I would appreciate any how-tos, cautions, and accounts of experiences with online embedding of one's fonts. For example are those online services that convert one's font to a webfont reliable? What about security, copyright etc.?  \nThanks!\n\n",
  "author": "Vladimir Tamari",
  "time": "2 Sep 2014 — 7:18pm",
  "uid": "23584",
  "comments": [
    {
      "time": "4 Sep 2014 — 1:43am",
      "content": "From a type designer or user point of view?\n\nI believe most people (incl. some designers) use Font Squirrel for a reason. Nevertheless answers to your other questions depend on your intended usage (as a type designer, or user/buyer)?\n\n"
    },
    {
      "time": "4 Sep 2014 — 9:17pm",
      "content": "Thanks lars - I ask as a type designer.\n\n"
    },
    {
      "time": "9 Sep 2014 — 10:01pm",
      "content": "I should have mentioned that the fonts I wish to convert areArabic. Unfortunately Font Squirrell only works for Latin fonts.\n\n"
    },
    {
      "time": "23 Sep 2014 — 1:23am",
      "content": "Try fontprep\n\n"
    },
    {
      "time": "27 Sep 2014 — 8:20pm",
      "content": "Thank you abattis. FontPrep from fontprep.com is nicely designed and creates a neat folder with all the css, svg and html files necessary with just one click.  \nAt first nothing worked until I added encoding declaration to the html\n\nA test page displayed my chosen font correctly in both Arabic and Latin in:  \nChrome (Win7 and OSX) , Safari (OSX)  \nIt did not display my font, only a generic one in:  \nThe latest Firefox (Win7 and OSX), IE 11 (Win7)  \nThe svg file did not display anything in Illustrator - what is its function in a webfont?\n\nAny help with this will be appreciated.\n\n"
    },
    {
      "time": "27 Sep 2014 — 11:10pm",
      "content": "Have you considered webfont services like FontDeck or TypeKit? These people have got a whole team working just to serve webfonts. Or you have special requirements (nonlatin script etc.) that can't be met by current webfont service providers?\n\n"
    },
    {
      "time": "29 Sep 2014 — 8:39am",
      "content": "Thank you Grubstreet both services you mentioned are very interesting. I was wondering whether there is a technical guide about how to convert my Arabic-Latin fonts to woff or whatever else is necessary to make them available for use on a customer's website. FontPrep did all that automatically, and it worked - except in Firefox!!\n\n"
    },
    {
      "time": "4 Oct 2014 — 2:35am",
      "content": "I now found out why it did not work in Firefox: I had set FF Preferences to display another font. In the Mac it is / Content / Advanced /Arabic After checking the box \"Allow pages to choose their own fonts instead of my selections above.\" it works fine.\n\n"
    }
  ]
}
