{
  "id": "119103",
  "title": "Remove Times New Roman and Arial?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I notice a lot of animosity against these popular fonts.\n\nShould Times New Roman and Arial be removed from Microsoft Windows? Would that even be possible?\n\n",
  "author": "rayzb92",
  "time": "1 Sep 2014 — 2:17am",
  "uid": "221456",
  "comments": [
    {
      "time": "1 Sep 2014 — 4:57am",
      "content": "I have not noticed animosity against Times New Roman or Arial. They maybe over used by some people but they are useful fonts.\n\n"
    },
    {
      "time": "2 Sep 2014 — 6:31am",
      "content": "Sure it's possible. That would result in a lot more people downloading TeX Gyre Termes and TeX Gyre Heros and other such typefaces, though.\n\nWhy penalize the computer-illiterate?\n\nJohn Savard\n\n"
    },
    {
      "time": "2 Sep 2014 — 9:04am",
      "content": "There's a common dislike of Arial among graphic designers who, rightly or wrongly, view it as Microsoft's tasteless embrace of a Helvetica substitute. I doubt that the general public notices or cares about this issue.\n\nThe bigger problem might be that many computer users have come to regard both Arial and Times New Roman as the ordinary, commonplace, colorless typefaces that are chosen by those whose lack of imagination prevents them from picking something else. I suspect this fate would have befallen any typefaces that Microsoft chose as the default, go-to serif and sans serif fonts.\n\nMicrosoft has no reason to remove them from Windows and plenty of reasons to keep them. As you mentioned, they're popular. There are also billions of office memos, forms and other documents already set in these typefaces. Removing Arial and Times New Roman from Windows would likely cause mass hysteria in office cubicles around the world. Comic Sans would become the new default and civilization as we know it would end.\n\n"
    },
    {
      "time": "2 Sep 2014 — 9:39am",
      "content": "Much of the general public doesn't care about this issue, and many businesses use these fonts too. Microsoft would be nuts to remove them. People who don't like them can choose to use other fonts.\n\n"
    },
    {
      "time": "2 Sep 2014 — 10:26am",
      "content": "There's a trend among avant-garde-ish graphic designers now of JUST using Arial and Times New Roman. I guess as a counterreaction to the explosive increase in the amount of fonts, it no longer being a special thing to have a unique typeface in your publication.\n\ne.g. most of: [http://www.europaeuropa.nu/svepdf/europaeuropa66sid.pdf](http://web.archive.org/web/20150419082229/http:/www.europaeuropa.nu/svepdf/europaeuropa66sid.pdf \"http://www.europaeuropa.nu/svepdf/europaeuropa66sid.pdf\")\n\n"
    },
    {
      "time": "3 Sep 2014 — 12:17pm",
      "content": "> Removing Arial and Times New Roman from Windows would likely cause mass hysteria in office cubicles around the world. Comic Sans would become the new default and civilization as we know it would end.\n\nExcellent analysis. Thank you.\n\n"
    },
    {
      "time": "3 Sep 2014 — 4:01pm",
      "content": "> it no longer being a special thing to have a unique typeface in your publication.\n\nRight. That is why I have chosen TNR for my thesis. For the same reason you mentioned. People might thing I am just one of many who sticks to those \"default' fonts, while I actually made an informed decision.\n\n"
    },
    {
      "time": "4 Sep 2014 — 12:42am",
      "content": "Perhaps this is the font worl'd version of [normcore](http://web.archive.org/web/20150419082229/http:/nymag.com/thecut/2014/02/normcore-fashion-trend.html)?\n\n"
    },
    {
      "time": "16 Sep 2014 — 8:54am",
      "content": "Times New Roman is a classic font, handsome, eminently legible and especially suitable for small print and economy of space. I wouldn't follow fads in this regard. Arial isn't beautiful, but it's used a lot on the web and therefore needed to render pages as they're created.\n\nThat said, there are faces ( but not those two ) I've removed from active duty to make room for imports.\n\n"
    },
    {
      "time": "16 Sep 2014 — 9:05am",
      "content": "Yes. And almost every university in the US and the UK demand theses and dissertations to be set in Times New Roman. So removing Times New Roman would cause a lot of discontent.\n\n<cite>There are faces ( but not those two ) I've removed from active duty to make room for imports</cite>\n\nMay I ask you which fonts you removed?\n\n"
    }
  ]
}
