{
  "id": "119169",
  "title": "question regarding body text and leading and margin width. on a cv",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": ". I had some good feed back from the previos post. I was informed a grid system wasnt appropriate  \n in the last post.\n\nI have now posted my cv. i think a two column layout might work. As i dont know much about the grid  \nsytems. I am trying to find out what be appropriate margin size . i am using heveltica 10 regular  \nwhich has leading of 14 pts.  \nIve read that its good practicce to make the margin width the same size as the body text leading .  \nIs this true as i am unsure\n\nthank you\n\n[http://fav.me/d7xsel1](http://web.archive.org/web/20150417125259/http:/fav.me/d7xsel1 \"http://fav.me/d7xsel1\")  \nlayout possible changes  \n [http://fav.me/d7xsel1](http://web.archive.org/web/20150417125259/http:/fav.me/d7xsel1 \"http://fav.me/d7xsel1\")\n\n",
  "author": "512pixel",
  "time": "3 Sep 2014 — 6:31am",
  "uid": "46811",
  "comments": [
    {
      "time": "3 Sep 2014 — 8:41am",
      "content": "I apoligise posted the same link twice. I created a duplicate link.The link with the follwing changes. Not sure about width of the margin. The design will be two colomns. Any feed back and ideas on the width of margins or text size please feel free to add as i am new to grids design.\n\n[http://fav.me/d7xsfdc](http://web.archive.org/web/20150417125259/http:/fav.me/d7xsfdc \"http://fav.me/d7xsfdc\")\n\n"
    },
    {
      "time": "3 Sep 2014 — 12:58pm",
      "content": "Just a couple of quick notes.  \nYes to make the two columns equal in width.  \nNo need to align the title inside the columns.  \nIn general, margins should be wide enough to frame text and pictures, but narrow enough to keep all together. Also consistency is a good thing.  \nYou should also check text alignment (and revise body copy in order to consistently use proper typographic elements such as apostrophes, en-dashes, etc.).\n\n"
    },
    {
      "time": "4 Sep 2014 — 9:20am",
      "content": "I know you didn't ask for advice regarding this, but your layout is full of misalignments, inconsistent capitalization and punctuation, etc. Most readers won't care if a margin is a few points off, but these kinds of mistakes will be immediately obvious to everyone.\n\nPlus the type in the lower right is totally unreadable on my monitor.\n\nTo paraphrase what I said in an earlier post, I think you're focusing on the wrong things. For a small layout like this, instead of worrying about grids and the exact width of a column or margin, focus on making it an attractive, easy-to-read layout.\n\n"
    },
    {
      "time": "11 Sep 2014 — 4:26am",
      "content": "hi james thanks for your reply . I understand it misaligned the first draft is completed in illustrator.\n\nI have now made changes to the cv and aligned to the baseline .  \n [http://fav.me/d7yrm1d](http://web.archive.org/web/20150417125259/http:/fav.me/d7yrm1d \"http://fav.me/d7yrm1d\")\n\n"
    },
    {
      "time": "11 Sep 2014 — 10:18am",
      "content": "512pixel, try learning and using InDesign for your layout. Illustrator is for illustrating.\n\n"
    },
    {
      "time": "11 Sep 2014 — 2:45pm",
      "content": "ive done the last 1 i in design i understandindesign has baseline grid . ive complete the last one indesign .\n\n[http://fav.me/d7yrm1d](http://web.archive.org/web/20150417125259/http:/fav.me/d7yrm1d \"http://fav.me/d7yrm1d\")\n\n"
    },
    {
      "time": "11 Sep 2014 — 2:54pm",
      "content": "My own critic of my works is i dontlike the black gaps to wide in the space. Especialing with the white writing. This apparent near the top were i have two margins\n\ni can post pic of this so i can see were i can see bad use of spacingt . I am thinking o f moving some of the text off the baseline grid. As weant the gaps closer together between the blackk and grey  \nWhich currenlty is all aligned to baseline grid . The colour aslo transormed to cmyk when exporting as pdf .\n\nI will post this later\n\n[http://fav.me/d7yrm1d](http://web.archive.org/web/20150417125259/http:/fav.me/d7yrm1d \"http://fav.me/d7yrm1d\")\n\n"
    },
    {
      "time": "11 Sep 2014 — 10:19pm",
      "content": "It still has some problems, but I see you've cleaned it up somewhat and it's easier to read.\n\nI hesitate to say this, but some of your posts are hard for me to understand due to odd sentence structure, misspellings, etc. Maybe you're just typing fast, but it's important for graphic designers to be able to communicate clearly in writing as you'll need to communicate with clients, managers, co-workers, write proposals and contracts, etc.\n\n"
    },
    {
      "time": "12 Sep 2014 — 3:22am",
      "content": "James it is typing fast and i have dyslexia. I do struggle with writing sentences.. I agree with you and try to write more clear\n\n"
    },
    {
      "time": "12 Sep 2014 — 3:45am",
      "content": "Ive posted the new errors .which i see at the minute. The body text at the bottom is to close to the black border edge. the middle white text is lost in the black areas in the middle . my concer n is if move the bottom body text in by 5 pixels in no longer align with the body text above which is on the border .\n\n[http://fav.me/d7yvexx](http://web.archive.org/web/20150417125259/http:/fav.me/d7yvexx \"http://fav.me/d7yvexx\")\n\n"
    },
    {
      "time": "12 Sep 2014 — 3:49am",
      "content": "May be i would be better moving the body text in by 5pixels with the tab tool for all the text. As the text touching the black borders is bad\n\n"
    },
    {
      "time": "12 Sep 2014 — 9:11am",
      "content": "I understand; I know dyslexia can make writing more difficult.\n\n"
    },
    {
      "time": "13 Sep 2014 — 6:15pm",
      "content": "no worries . It great for creativity\n\n"
    },
    {
      "time": "17 Sep 2014 — 3:48pm",
      "content": "Make it black type on white, because people will want to print it.\n\nSaying \"computer\" graphic design is unnecessary; who does graphic design any other way these days?\n\nI would put your software skills at the bottom, not the top.\n\nProofread! You have many misspelled words and incorrect or misplaced punctuation marks. Get a friend to read over it for you.\n\nHow about putting your name somewhere prominent?\n\nYou can do better than Helvetica. Helvetica may be many things, but unique it is not. You want to stand out.\n\nThe dark grey type is hard to read.\n\nFor bullet lists, align runover lines with the first line of the bulleted paragraph.\n\nMake it a standard paper size.\n\nMany people have a hard time taking \"Hotmail\" addresses seriously. Some e-mail services are widely seen as more professional than others. Gmail is a safe bet.\n\nOrganize the document with subheads: Work Experience / Education / Special Skills etc.\n\n"
    }
  ]
}
