{
  "id": "119243",
  "title": "Recommended font for \"Alice's Adventures in Wonderland?\"",
  "forum": "General Discussions",
  "tags": [
    "art book",
    "book publishing",
    "General Discussions",
    "Victorian"
  ],
  "content": "We are publishing a heavily illustrated version of \"Alice's Adventures in Wonderland\" and are hoping to hear recommendations for a font for the body and also for a complimentary initial cap for the beginning of each chapter.\n\nThe book has at least one color illustration on every page spread and many of the illustrations will be free-standing with text flowing around them.\n\nWe're hoping to find a handsome font that feels distinctly old-fashioned, but is also very legible. (I should mention that the tale involves quite a lot of italics and dashes.)\n\nSo far we've favored Garamond and Caslon for the body, but I'd love to find something a little more distinctive. For the initial caps we've so far considered Algerian and Birmingham New Street.\n\nThis is going to be a very deluxe cloth bound art book with ribbon bookmark and slip case. We want a font that also conveys artistry and attention to detail.\n\nThoughts?\n\n(Alice in Wonderland was first published in 1865.)\n\nWendy Ice, Publisher  \n [www.daviddelamare.com/alice.html](http://web.archive.org/web/20150416033104/http:/www.daviddelamare.com/alice.html \"www.daviddelamare.com/alice.html\")\n\n",
  "author": "badmonkeyart",
  "time": "6 Sep 2014 — 4:49am",
  "uid": "222657",
  "comments": [
    {
      "time": "6 Sep 2014 — 5:46am",
      "content": "Why don't you hire an interior book designer?\n\n"
    },
    {
      "time": "6 Sep 2014 — 7:29am",
      "content": "I would recommend Garamond over Caslon. The original Victorian editions used Scotch Roman typefaces, but they look drab to modern eyes.\n\nAlthough I'm partial to faces like Italia, Jenson Oldstyle, or Morris' Golden Type, they don't come with matching italics, and are more suited to sword-and-sorcery type works than an edition of _Alice in Wonderland_.\n\nCentury Schoolbook is even a possibility, were the edition directed at younger readers. But given your likely aim, given that you are asking here, I'm thinking that Centaur might be suitable. And then there's Bembo and Poliphilus as other options to consider - these are very well-known faces, however, so you might look for something similar but more unique.\n\n"
    },
    {
      "time": "6 Sep 2014 — 9:09am",
      "content": "Hm, sounds like something that might look/work great in Satyr: [https://monokrom.no/fonts/satyr](http://web.archive.org/web/20150416033104/https:/monokrom.no/fonts/satyr \"https://monokrom.no/fonts/satyr\")  \nI’ve used it for a book and it does have a distinct old/mystery/story book feel, but it’s also quite legible and clear. I think there have been a couple of uses for distinctly beautiful books.\n\n"
    },
    {
      "time": "6 Sep 2014 — 10:00am",
      "content": "Nina, excellent suggestion.\n\nWendy, rather than Algerian or Birmingham New Street for initial caps, I'd consider going more modern with the typesetting all around. The David Delamare illustrations aren't in the 1865 style of the John Tenniel originals—your type design doesn't have to be retro either.\n\n"
    },
    {
      "time": "6 Sep 2014 — 10:34am",
      "content": "I agree Satyr could be a great choice.\n\nYou're going to have to reproduce the Mouse's Tale, which may be the acid test. The face has to hold up extra-small.\n\nI'd stay away from Algerian; there's so much of it in community bulletin garbage that I doubt it can be redeemed as lavish. Would drop caps and chapter heading in Octant be appropriate?\n\n"
    },
    {
      "time": "6 Sep 2014 — 1:45pm",
      "content": "Thank you for the suggestions! Please keep them coming. You're introducing me to fonts that I've missed. (I can see that my library is about to expand as I'd like to use some of these for other projects I have in mind.) I will try each today to see how they feel in the Alice context.\n\nkthomps5, you're right, this would have been very interesting to try in a more contemporary style. In fact, if we pursue a publisher for a softcover edition, it might be fun to give them this option. But we've promised our readers a more old-fashioned design for this edition.\n\nLes, for a variety of reasons including lack of funds and the desire to have the work feel really consistent with the vision of the artist, we (the artist and I) are giving a general look to the designer and she has graciously consented to work within those parameters. Also, I've just been so impressed with the comments here that I thought it would be interesting to hear opinions on fonts I'm considering and maybe learn about something new.\n\nCerulean, very perceptive about the Mouse's Tail. I hadn't thought of that as a test. The drop caps have been challenging because with so many fonts we like most of the letters, but one or two just seem odd or uninteresting in this context. The letters that must work are: A, C, T, I, F, Y, H.\n\nGaramond had been our top choice so far and seems solid, but I guess I'm hoping for that dorsal hair reaction—that particular feeling of rightness one ideally gets with an art project.\n\n"
    },
    {
      "time": "6 Sep 2014 — 2:01pm",
      "content": "If I may throw my hat in the ring (again), have a look at [Andron English](http://web.archive.org/web/20150416033104/http:/www.myfonts.com/fonts/andreas-stotzner/andron-2/). It has recently gained some popularity for children’s and fantasy stuff but is still far from being overused. For initials or captions [Abendschroth](http://web.archive.org/web/20150416033104/http:/www.myfonts.com/fonts/andreas-stotzner/abendschroth/) may be worth a try. If you’re looking for something more wild, check [Rosenbaum](http://web.archive.org/web/20150416033104/http:/www.myfonts.com/fonts/andreas-stotzner/rosenbaum/) …  \nHowever, I second that Satyr would be a wonderful option, too.\n\n"
    },
    {
      "time": "6 Sep 2014 — 2:13pm",
      "content": "… you should also have a look at Karsten Lücke’s marvellous [Litterata](http://web.archive.org/web/20150416033104/http:/kltf.de/kltf_litteratra.shtml)!\n\n"
    },
    {
      "time": "6 Sep 2014 — 2:21pm",
      "content": "Nice designs, Andreas. Thanks for introducing me to them. I think Andron English might be a little too early in feel for what we're seeking (though I'll keep it in mind for other projects.) But I'll try the Abendschroth for the drop caps.\n\n"
    },
    {
      "time": "6 Sep 2014 — 2:35pm",
      "content": "Although I agree that Andron 2 is not likely to be right for Alice in Wonderland, it certainly is an interesting typeface. A bit too unusual for general use, but it's nice to see an attempt to bring elements of uncial - more so than fraktur, it seems to me - into a legible Roman context.\n\n"
    },
    {
      "time": "7 Sep 2014 — 12:41pm",
      "content": "I think that a fairly traditional font that’s somewhat softer or friendlier than Garamond or Caslon would be better. Have you looked at Arno? Calluna would be another choice.\n\n"
    },
    {
      "time": "8 Sep 2014 — 1:38am",
      "content": "Personally, I'd go for something that evokes the 19th century more than these, but in a more subtle way than using a Scotch Roman straight off. Something like [Walbaum](http://web.archive.org/web/20150416033104/http:/www.stormtype.com/package-walbaum-sans-serif.html) or [Bohemia](http://web.archive.org/web/20150416033104/http:/www.linotype.com/92006/BohemiaStdRegular-product.html).\n\n"
    },
    {
      "time": "8 Sep 2014 — 3:23am",
      "content": "@Birdseeding: I'm intrigued by Walbaum and curious, since you've raised the topic, if you feel there are, for you, specific identifiable features that make a font more evocative of the 19th century.\n\nThanks to everyone for all the text font suggestions, I've now got a very intriguing list of options to lay side by side for comparison. The font for the drop caps remains more elusive.\n\n"
    },
    {
      "time": "8 Sep 2014 — 6:15am",
      "content": "Well, it would be features that were typical of the 19th century in type. To my understanding, vaguely:\n\nIn the early 19th century you'd have the \"moderns\" or \"didones\" with upright stress, classicist rationalisation, high contrast between thicks and thins, more drawn than lettered. Walbaum would be a fairly readable example.\n\nIn the mid-19th century you'd have more type experimentation – but in text mainly building futher on the above with closed shapes and long serifs, larger x-height, more compact type. Look at e.g. Shinntype's Scotch Modern.\n\nLate 19th century you're starting to see the influence of various revivalist movements like the arts and crafts movement and theorists like Theodore Low De Vinne. On the one hand, heavy, renaissance-inspired calligraphic type that's sort of an \"anti-trend\" to the above, on the other hand a more subtle evolution that takes into account historical shapes and scales back some of the extremes of Scotch-style type.\n\n"
    },
    {
      "time": "9 Sep 2014 — 8:15pm",
      "content": "In the latter part of the 19th century -- at least in North America -- the high contrast moderns were out of fashion for body text, the Scotch Moderns were everywhere and there was substantial use of low contrast lighter face Caslon styles like Old Style No. 2 & Franklin [nearest digital is Williams Caslon Text [https://www.myfonts.com/fonts/fontbureau/williams-caslon-text/](http://web.archive.org/web/20150416033104/https:/www.myfonts.com/fonts/fontbureau/williams-caslon-text/ \"https://www.myfonts.com/fonts/fontbureau/williams-caslon-text/\") ] and the big serifed Ronaldson [good digital at [http://www.myfonts.com/fonts/canadatype/ronaldson/](http://web.archive.org/web/20150416033104/http:/www.myfonts.com/fonts/canadatype/ronaldson/ \"http://www.myfonts.com/fonts/canadatype/ronaldson/\") ].  \nIn the 1890s this assortment of body texts came under pressure from several fronts ranging from historical revivals of fonts with \"vigor\" to the revolution in printing technology that converted most printing from a craft to high-speed presses, as well as the technology that permitted much more precision and standardization in making type. The introduction of Century, followed by Cheltenham, meant that by 1900 most of these fonts were dropped from the foundry offerings. They were quickly replaced by fonts that are still in common use today.  \nThe problem with using a 19th century font for a modern book, even a revival, is that it can make the book look quaint and unappealing to the contemporary reader. Noting wrong with being authentic, provided it works with the reader.  \nDon\n\n"
    },
    {
      "time": "9 Sep 2014 — 8:28pm",
      "content": "Perhaps something like Athelas [http://www.myfonts.com/fonts/type-together/athelas/](http://web.archive.org/web/20150416033104/http:/www.myfonts.com/fonts/type-together/athelas/ \"http://www.myfonts.com/fonts/type-together/athelas/\") or Plantagenet by Ross Mills of Trio Typeworks [http://www.myfonts.com/fonts/tiro/plantagenet/](http://web.archive.org/web/20150416033104/http:/www.myfonts.com/fonts/tiro/plantagenet/ \"http://www.myfonts.com/fonts/tiro/plantagenet/\") might work for this book. For Plantagenet, note the low contrast and large rounded serifs dished at the midpoint.  \nDon\n\n"
    },
    {
      "time": "10 Sep 2014 — 1:50am",
      "content": "Cloister Initials may be a good choice for your drop caps.\n\n"
    },
    {
      "time": "10 Sep 2014 — 5:32pm",
      "content": "Thank you for all the great suggestions. After looking at hundreds of fonts, we still find ourselves enamored with Garamond and, though it might not be the final book font, would like a copy for general house use.\n\nWe were looking at the Adobe Linotype family on myfonts.com [http://www.myfonts.com/fonts/linotype/adobe-garamond/](http://web.archive.org/web/20150416033104/http:/www.myfonts.com/fonts/linotype/adobe-garamond/ \"http://www.myfonts.com/fonts/linotype/adobe-garamond/\")  \nbecause it's got all kinds of great extras including swashes, small caps, and titling that I'm not seeing in other Garamond families on various sites. Can anyone tell me if there's a downside to purchasing this version or if there's a better family that has these features? It's a really big investment for our little company and I want to get it right.\n\n(I'm also considering buying the web font so we can use it on our website, but I think perhaps Wordpress might already include a Garamond). Thoughts?\n\n"
    },
    {
      "time": "10 Sep 2014 — 5:48pm",
      "content": "donshottype: Thank you for the very thoughtful explanation of 19th century style. By the way, I really like those swashes and ornaments for Plantagenet (the swashes might be perfect for our drop caps) but when I select these on myfonts.com it says they're not authorized to sell them and I couldn't find them on the Tiro site. Any idea what's going on here?\n\nGrubStreet: Love those Cloister initials and have added them to my album for future projects. Thanks.\n\n"
    },
    {
      "time": "10 Sep 2014 — 6:21pm",
      "content": "Adobe Garamond is a great and time-tested face. I personally love it, but it may suffer from _ubiquity_. There are also other serifs around that inherit and probably advance Garalde beauty, such as Sabon, Lyon or Verdigris.\n\nAs for extra goodies, I think that most well-done typefaces come with them, like extra ligatures and swashes in their opentype features.\n\nYou may consider going with a web font service than buying the font so you would have more leeway once you want to change the typeface. Typekit and FontDeck both support opentype features for big faces like Adobe Garamond.\n\n"
    },
    {
      "time": "10 Sep 2014 — 6:33pm",
      "content": "I agree it's really frustrating when a font is offered and then you find out that some features you like are not actually available. I have no idea what went wrong here. All you could do is try and contact the font authors. The Trio people are good font-makers but their business model is poor. Plantagenet would have been my first choice for this type of book -- very friendly, very legible -- but life is too short to have to jump through unnecessary hoops to get it the features you thought were available, but are not.  \nDon\n\n"
    },
    {
      "time": "10 Sep 2014 — 7:09pm",
      "content": "The font Plantagenet Cherokee contains no swashes; all its glyphs have a unicode code point; I would personally not use its Cherokee syllabary [http://en.wikipedia.org/wiki/Cherokee\\_syllabary](http://web.archive.org/web/20150416033104/http:/en.wikipedia.org/wiki/Cherokee_syllabary \"http://en.wikipedia.org/wiki/Cherokee\\_syllabary\") as swashes. The font comes installed on OS X. It seems to me that you can get it from Tiro at the url [http://www.tiro.com/Plantagenet/plantagenet\\_cherokee\\_purchase.html](http://web.archive.org/web/20150416033104/http:/www.tiro.com/Plantagenet/plantagenet_cherokee_purchase.html \"http://www.tiro.com/Plantagenet/plantagenet\\_cherokee\\_purchase.html\")\n\n"
    },
    {
      "time": "10 Sep 2014 — 7:53pm",
      "content": "Yes, donshottype, I'll try to contact Trio tomorrow as I do like those swashes.\n\nThanks Grubstreet for the online recommendation. I'm looking at typekit and it was useful for comparing Garamond Pro to Premier (I find the Premier a little heavy and it might tend to plug up when we have to go to the really small sizes for the Mouse's Tail poem). I might have to subscribe in order to find all the fonts on my short list. I didn't see Centaur or Bembo etc. I may be missing something, but not all of the fonts I've looked at on myfonts.com have offered titling fonts or smallcaps, and few have had Swash options. Those were pretty big selling points for the Linotype (Slimbach) version of Garamond.\n\n"
    },
    {
      "time": "11 Sep 2014 — 3:22am",
      "content": "Wendy,\n\nI have an old copy of \"Alice\" by Penguin - from the Fifties or Sixties, I believe - beautifully set in Scotch Roman (metal, of course). For a contemporary typeface that resembles the late Ninenteenth English century books, you could try Eames or Paperback by House Industries, or Hariett by Okay Type. By the way, if you're into Adobe Garamond, go with it (I have set many books with it): it's a great text face, just be sure to set it in at least 12 points - by my own experience, at 11 or less the body text can look very small.\n\n"
    },
    {
      "time": "11 Sep 2014 — 12:09pm",
      "content": "Thanks nocolacaleffi, I did spring for the big Garamond set by Linotype that is on myfonts.com. My own copy of Garamond Pro didn't have the titling, subcaps, swash alternates etc. and I do really like them. This is the original Slimbach design, which is different from his new Premier design (which seems a bit heavier).\n\nI've been so impressed with all the knowledge in this forum and the generosity, and I've now got a wonderful list of fonts for various projects. Makes me want to become a fellow type geek. I'd like to read some books on typesetting. Perhaps someone will recommend favorites.\n\n"
    },
    {
      "time": "11 Sep 2014 — 12:38pm",
      "content": "Shameless plug for my own Dez Petranian.  \n [http://www.myfonts.com/fonts/dezcom/dez-petranian/](http://web.archive.org/web/20150416033104/http:/www.myfonts.com/fonts/dezcom/dez-petranian/ \"http://www.myfonts.com/fonts/dezcom/dez-petranian/\")\n\n"
    },
    {
      "time": "11 Sep 2014 — 9:47pm",
      "content": "I don’t recall Slimbach has done anything close to Garamond Titling. Goudy has titling though.  \nRegarding typography books, I think I can safely declare that Robert Bringhurst’s _Elements of Typographic Style_ is a good starter. It covers most aspects related to type, from using type – both physical and digital – to designing type. It also is written in a beautiful yet complex way thanks to the author’s literary background.  \nFor a more detailed investigation on how type works on screen and on physical print, I recommend Tim Ahrens and Shoko Mugikura’s _Size-specific Adjustments on Type Designs_. The book is Ahrens’s Master’s Thesis at uReading where he attempts to basically resolve why some beautiful print typefaces suck on screen.\n\n"
    },
    {
      "time": "12 Sep 2014 — 2:12am",
      "content": "Adobe Garamond Pro doesn't feature neither a swashes set, nor different specific size cuts (subhead, display etc). But there is a \"titling capitals\" set, which is available in the glyphs panel in Indesign: it features only the uppercase letters and lining numbers - see this pdf from Adobe, pages 10 and 30:\n\n[www.adobe.com/type/browser/pdfs/AdobeGaramondPro.pdf](http://web.archive.org/web/20150416033104/http:/www.adobe.com/type/browser/pdfs/AdobeGaramondPro.pdf \"www.adobe.com/type/browser/pdfs/AdobeGaramondPro.pdf\")\n\nIf you're after a Reinassance serif with a full set of swashes, check Hoefler Text, less delicate than Slimbach's Garamond:\n\n[http://www.typography.com/fonts/hoefler-text/styles/](http://web.archive.org/web/20150416033104/http:/www.typography.com/fonts/hoefler-text/styles/ \"http://www.typography.com/fonts/hoefler-text/styles/\")\n\nAnd a couple of necessary readings (besides Bringhurst):  \n- Jan Tshcichold, The Form of the Book  \n- Jost Hochuli, Designing Books\n\n"
    },
    {
      "time": "12 Sep 2014 — 6:27am",
      "content": "@badmonkeyart... Interesting project... I thought it might helpful to put together a small sampling of specimens to illustrate the various \"voices\" that typefaces demonstrate. Sometimes, I have to go through several dozen samples, but the PDF link below simply provides a handful to start with. I've attempted to assemble type samples from very different genres, just to get the creative juices flowing. I presently do not have access to a printer (traveling), so I am not sure how this actually prints. I have not paid specific attention to details such as tracking (@hrant... please don't have a heart attack :) )\n\nThe body text types I have used:  \nDutch Mediaeval  \nJannon Antiqua  \nLTC Goudy Oldstyle  \nMeister Antiqua  \nNeviaBT  \nPlantin Infant MT  \nSatyr  \nScotchMicro  \nWalbaum\\_Storm\n\nIf it would be helpful, I can upload the InDesign template, so you and others can demo other types...\n\n[http://www.mediafire.com/view/yd9tqcyuztsvpp0/AliceWonderland\\_SpecimenSa...](http://web.archive.org/web/20150416033104/http:/www.mediafire.com/view/yd9tqcyuztsvpp0/AliceWonderland_SpecimenSamples_Combined.pdf \"http://www.mediafire.com/view/yd9tqcyuztsvpp0/AliceWonderland\\_SpecimenSamples\\_Combined.pdf\")\n\n ![](http://web.archive.org/web/20150416033104im_/http:/typophile.com/files/Alice_closeup_5914.png)\n\n"
    },
    {
      "time": "12 Sep 2014 — 7:15am",
      "content": "Another option for the dropcaps: the whimsical Ambicase Modern/Fatface (make sure to check out the swashes!).  \n [http://www.myfonts.com/foundry/Teeline\\_Fonts/](http://web.archive.org/web/20150416033104/http:/www.myfonts.com/foundry/Teeline_Fonts/ \"http://www.myfonts.com/foundry/Teeline\\_Fonts/\")\n\n"
    },
    {
      "time": "12 Sep 2014 — 8:18am",
      "content": "Can’t top Tenniel and Scotch.  \n [http://unews.utah.edu/wp-content/uploads/White-Rabbit.jpg](http://web.archive.org/web/20150416033104/http:/unews.utah.edu/wp-content/uploads/White-Rabbit.jpg \"http://unews.utah.edu/wp-content/uploads/White-Rabbit.jpg\")\n\n"
    },
    {
      "time": "12 Sep 2014 — 4:55pm",
      "content": "Michael, impressive demo. Helps focus consideration of options.  \nNick, yes, when I downsided my paper library, this was one of the few books I kept.  \nDon\n\n"
    },
    {
      "time": "12 Sep 2014 — 11:17pm",
      "content": "Tenniel’s illustrations, and the Dalziel’s woodcuts, have a quality of line which is very similar to that of the Scotch. Both type and illustration were printed relief, into the paper, with the impressions being made from media that were sculpted by hand—all very tactile.\n\nA photo process re-sized reproduction of a painting, and type from a scale-less digital outline (a picture of type, as Gill would have observed), related only by being printed offset, are a different kettle of ﬁsh.\n\n"
    }
  ]
}
