{
  "id": "119229",
  "title": "SignWriting for sign languages in Unicode 8 using SVG Glyphs in OpenType Fonts",
  "forum": "Build",
  "tags": [
    "sign language",
    "signwriting",
    "Build"
  ],
  "content": "The SignWriting script is universal for the sign languages of the world. Any sign language can be written by hand or with a computer using the SignWriting script.\n\nFor computers, individual symbols were designed that represent hands, actions, locations, timing, dynamics, punctuation, and more.  \n [http://signbank.org/iswa](http://web.archive.org/web/20150201001309/http:/signbank.org/iswa \"http://signbank.org/iswa\")\n\nThe individual symbols are used in 2-dimensions to create meaningful signs that equate to a word.\n\nThe SignWriting standard currently uses SVG and a lite ASCII markup to support the script. The ASL Wikipedia is a great example. It has over 50 articles. It uses the Vertical Writing Mode which is available everywhere but in Firefox.  \n [http://incubator.wikimedia.org/wiki/Wp/ase](http://web.archive.org/web/20150201001309/http:/incubator.wikimedia.org/wiki/Wp/ase \"http://incubator.wikimedia.org/wiki/Wp/ase\")\n\n3 years ago, Typophile members helped me automate the construction of a truetype font using FontForge. We were able to load 37,811 glyphs indexed against 674 PUA Unicode characters.  \n [http://signpuddle.net/iswa/#smartfont](http://web.archive.org/web/20150201001309/http:/signpuddle.net/iswa/#smartfont \"http://signpuddle.net/iswa/#smartfont\")  \n [http://typophile.com/node/78542](http://web.archive.org/web/20150201001309/http:/typophile.com/node/78542 \"http://typophile.com/node/78542\")\n\nAdditionally, we were able to leverage Graphite to support the 2-dimensional nature of SignWriting with an additional 505 PUA Unicode characters.\n\nIf you install the 6 MB font file, you can see the experimental smart font in action on the SignWriting Font test page. It requires Graphite which is enabled in Firefox by default.  \n [http://signpuddle.net/iswa/swfont\\_test.html](http://web.archive.org/web/20150201001309/http:/signpuddle.net/iswa/swfont_test.html \"http://signpuddle.net/iswa/swfont\\_test.html\")\n\nFor the official Unicode specification, the SignWriting symbols were split from the 2-d layout characters. The first proposal has passed through the various committees and will be released in Unicode 8 next year.\n\nThe second proposal to handle the 2-d layout has not been started. A working character prototype is available with Private Use Area Unicode characters and the TypeType Font listed above.\n\nCurrently, there is no font that supports the Unicode 8 characters for SignWriting symbols. I would like to help to create such a font. Recently, I found the specifications for SVG Glyphs in OpenType Fonts. I wish this would have existed 3 years ago.\n\nThe ISWA 2010 SVG Refinement is a 2-color font where every symbol is a described as a unique glyph with an SVG string. Each glyph is identified by 1 to 3 Unicode characters on plane 1. There are 37,811 glyphs in the font.  \n [http://signpuddle.net/iswa/#unicode8](http://web.archive.org/web/20150201001309/http:/signpuddle.net/iswa/#unicode8 \"http://signpuddle.net/iswa/#unicode8\")\n\nI have a data file which contains the raw material needed to create a working OpenType Font based on SVG Glyphs. Inside is a text file with 37,811 lines. Each line starts with the Unicode 8 name, followed by a tab, followed by the SVG.\n\nISWA 2010 SVG Glyphs with Unicode 8 names 1.1 MB zipped, 24 MB unzipped  \n [http://signpuddle.net/iswa/iswa\\_unicode.zip](http://web.archive.org/web/20150201001309/http:/signpuddle.net/iswa/iswa_unicode.zip \"http://signpuddle.net/iswa/iswa\\_unicode.zip\")\n\nThe first 2 lines look like this  \n`\nu1D800 <g><path...\nu1D800_u1DAA1 <g transform=...\n`\n\nI am hoping to automate the construction of an OpenType Font for SVG Glyphs. If any additional information or data is required, I can provide or reformat as needed.\n\nIf you have any ideas, I would appreciate the help. In theory, the project should be quick if I knew the right tools or knew the right freelancer.\n\nThanks for reading.  \n-Steve\n\n",
  "author": "Slevinski",
  "time": "5 Sep 2014 — 10:23am",
  "uid": "83941",
  "comments": [
    {
      "time": "3 Oct 2014 — 9:14am",
      "content": "I thought I would post a follow-up.\n\nI've had great success creating TrueType fonts for the SignWriting symbols. The fonts are fully functional but not production ready. I need to clean up some of the images and adjust the typography settings. I've published the fonts I've created on Github.\n\nThe SignWriting 2010 Fonts project  \n\\* [https://github.com/Slevinski/signwriting\\_2010\\_fonts](http://web.archive.org/web/20150201001309/https:/github.com/Slevinski/signwriting_2010_fonts \"https://github.com/Slevinski/signwriting\\_2010\\_fonts\")  \nProduction and development TrueType fonts with source SVG files for written sign language in the SignWriting script based on the ISWA 2010.\n\nI've also released the tools project that created the above TrueType fonts. I spent extra time crafting the build script so that it is customizable and informative. Each of the fonts above has an associated log file that details the font's creation.\n\nThe SignWriting 2010 Tools project  \n\\* [https://github.com/Slevinski/signwriting\\_2010\\_tools](http://web.archive.org/web/20150201001309/https:/github.com/Slevinski/signwriting_2010_tools \"https://github.com/Slevinski/signwriting\\_2010\\_tools\")  \nTools for creating TrueType fonts for written sign language in the SignWriting script based on the ISWA 2010.\n\nThe image quality of the TrueType font is not as nice as the SVG, but the TrueType font can be installed on a computer or mobile device and save a tremendous amount of bandwidth. Pages that use the TrueType font will be 30 times smaller than pages that use the server side generated SVGs.\n\nInitially, 2 fonts will need to be installed: \"SignWriting 2010\" and \"SignWriting 2010 Filling\". Each of these fonts is a single color, so together they can imitate the 2-color required for SignWriting. The main color font is 6 MB and the secondary color font is 3 MB.\n\nDevelopment continues...\n\nRegards,  \n∼Steve  \n [http://slevinski.github.io/](http://web.archive.org/web/20150201001309/http:/slevinski.github.io/ \"http://slevinski.github.io/\")\n\n"
    }
  ]
}
