{
  "id": "1192",
  "title": "S u g a r",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "Thats my first attempt on grey pixel fonts. Compare here the two versions, with and without greys. I think that grey in such small sizes works great, more legible.   \n   \nI am still experiment with greys on fog, waiting to test Flashfonter now. Your comments are wellcome.   \n   \nmh.   \n   \n   \n ![](http://web.archive.org/web/20150415000343im_/http:/www.typophile.com/forums/messages/29/15624.gif)\n\n",
  "author": "Miguel Hernandez",
  "time": "7 Sep 2003 — 11:12pm",
  "uid": "1109",
  "comments": [
    {
      "time": "8 Sep 2003 — 11:20am",
      "content": "I think the grays are making a huge (positive) difference.   \n   \nhhp\n\n"
    },
    {
      "time": "21 Sep 2003 — 2:35pm",
      "content": "Nice work Miguel. Make sure to check white on black as well - there's a delicate balance to strike.   \n   \nFlashfonter doesn't support the greys you can get in fog/fontlab ... does it?   \n   \nvery glad I started this party :]\n\n"
    },
    {
      "time": "21 Sep 2003 — 2:54pm",
      "content": "sorry for dual post. slow net day. impatiently, I broke the form.   \n   \nWhile I'm wasting space, Miguel, I challenge you to do a full character set. I put one in Halogen and it about broke me. x\\_\\_X\n\n"
    },
    {
      "time": "21 Sep 2003 — 4:59pm",
      "content": "Shure!   \n   \nFor me,the challenge is making a pro pack pixel fonts with grayscale, with complete figures for flash web designers, and NTT Docomo cellphones, pdas...   \n   \nSugar will be available with full character set like all my bitmapys..   \n   \nRegards,   \n   \nmh.\n\n"
    },
    {
      "time": "21 Sep 2003 — 7:03pm",
      "content": "Hi Miguel.   \n   \nIt makes a big difference of what kind of monitor you're looking at it with. On a CRT the b/w version looks better crisper vs blurry. On a flatscreen the aliased version seems smoother not blurry or jaggy. Better include both!   \n   \n-Randy\n\n"
    },
    {
      "time": "20 Dec 2003 — 7:57am",
      "content": "Good job Miguel.   \nDoes \"Sugar\" blur in Photoshop?\n\n"
    },
    {
      "time": "20 Dec 2003 — 8:02am",
      "content": "Darryl, it sounds like you're hitting the technical quicksand in grayscale pixelfont design?   \n   \nhhp\n\n"
    },
    {
      "time": "20 Dec 2003 — 8:32am",
      "content": "Nah just asking coz im having this problem, when i choose crisp it appears fine but when i choose smooth its gets blurry. I kinda figured out the problem.\n\n"
    },
    {
      "time": "20 Dec 2003 — 6:20pm",
      "content": "crumbs, the grey pixels sure do make a heck of a (positive)   \ndifference! NIce work, Miguel, as per usual. I have often   \nwondered whether looking at these little fella's on screen   \nall the time hurts your eyes more than \"regular\" type design?   \n   \nkris.\n\n"
    },
    {
      "time": "21 Dec 2003 — 8:17am",
      "content": "Very Nice. IMHO, I think zero\n\n"
    },
    {
      "time": "20 Dec 2003 — 11:20am",
      "content": "Why the difference in lc 'a' form in the two fonts?\n\n"
    }
  ]
}
