{
  "id": "119377",
  "title": "Plantin: alternative style or font for small lettering",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi guys (and girls).\n\nI'm currently working on the interior graphics of a museum in Belgium that opens September 27. On a window I've set an \"In Memoriam\" in Plantin MT Pro, which is the font that is used troughout the entire museum.\n\nNow, this \"in memoriam\" will be placed in lettering. My printer says that the serifs are to small and the letters might peel off. Can you recommend me a certain font style of Plantin with thicker serifs or a alternative sans serif that fits well with the look of Plantin? I'd rather not use an extra font, but if it's the only way... :)\n\nThanks in advance!\n\nJeroen Migneaux\n\n",
  "author": "Jmigneaux",
  "time": "10 Sep 2014 — 12:51am",
  "uid": "222790",
  "comments": [
    {
      "time": "10 Sep 2014 — 3:40am",
      "content": "Plantin already has pretty chunky serifs--will the text be cut in vinyl and applied to the window, or are you silk screening onto the glass?\n\nPlantin SemiBold may be a solution.\n\nAs for a sans serif to pair with Plantin, Monocle magazine uses Plantin and Helvetica together:  \n [http://fontfeed.com/archives/in-use-plantin-for-monocle/](http://web.archive.org/web/20150417110906/http:/fontfeed.com/archives/in-use-plantin-for-monocle/ \"http://fontfeed.com/archives/in-use-plantin-for-monocle/\")\n\nBut if Helvetica is just too overdone for you, I'd choose something with a tall x-height and a bit narrow (like Plantin), say Avenir or Telefon. I've even seen it paired nicely with Tempo, Frutiger, and Neutraface.\n\n"
    },
    {
      "time": "15 Sep 2014 — 4:56am",
      "content": "Hi, thanks for the reply.\n\nThe text will be cut in vinyl and applied to the windows.\n\nI'll send an example with Plantin SemiBold to my printer and see what they'll say.\n\nI really love the pairing Plantin/Helvetica in Monocle, but for this \"In Memoriam\" I need something elegant. Helvetica won't do the trick here. :(\n\nI'll check out Tempo.\n\nThanks!\n\n"
    }
  ]
}
