{
  "id": "119440",
  "title": "Type Design and Typography courses in NY",
  "forum": "General Discussions",
  "tags": [
    "best",
    "continuing ed",
    "courses",
    "General Discussions",
    "MA",
    "ny",
    "programs",
    "type design",
    "typography"
  ],
  "content": "Im a NY illustrator/graphic designer who is becoming more and more interested and obsessed with type design, typography, and logo design. My illustration skills certainly help propel me forward into territories of originality and detail but I am lacking some basic and more fine tuned type skills. I have been working in NY as a graphic designer for several years so I have lots of basic knowledge but I am considering diving into this new passion and going back to school for my masters in type design/typography/branding- identity design (if that is a real major). Does anyone have any suggestions for great programs in NY; both for continuing ed and also for a full masters program?\n\nWhen I have read course descriptions of schools they seem very esoteric, for example, \"Design for the Emerging Future\" or \"Launching Type into the Ecological World\" Blah Blah Blah. I just want to find some great teachers in a great program teaching the real hands-on skills of typography, and type design - hand drawn and computer generated.\n\nThanx in advance,\n\nChana\n\n",
  "author": "chanagoodman",
  "time": "11 Sep 2014 — 6:05am",
  "uid": "220230",
  "comments": [
    {
      "time": "11 Sep 2014 — 6:31am",
      "content": "Have you tried the Cooper Union Type program?\n\n[http://coopertype.org/](http://web.archive.org/web/20150420144743/http:/coopertype.org/)\n\n"
    },
    {
      "time": "11 Sep 2014 — 6:48am",
      "content": "I've certainly heard of Cooper Union but not their type program specifically.  \nThanks, I'll check into it. What do you like about it, any particular teachers or classes you recommend?\n\nChana\n\n"
    },
    {
      "time": "11 Sep 2014 — 11:56am",
      "content": "I've not been through the program, but know many of their teachers as colleagues. I don't want to rec any particular course, but I don't think you can go wrong with anyone who's teaching there.\n\n"
    },
    {
      "time": "12 Sep 2014 — 7:35am",
      "content": "Yes, Cooper is your address :)  \nHere’s a writeup from Troy Leinster, a recent graduate, on this and other programs: [http://typographica.org/on-typography/undergrad-to-cooper-to-kabk-one-st...](http://web.archive.org/web/20150420144743/http:/typographica.org/on-typography/undergrad-to-cooper-to-kabk-one-students-route-to-learning-type-design/ \"http://typographica.org/on-typography/undergrad-to-cooper-to-kabk-one-students-route-to-learning-type-design/\")\n\n"
    }
  ]
}
