{
  "id": "119454",
  "title": "5 years of laboring – The simplease logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey guys,\n\nglad to see you're still around :)\n\nSome of you may remember the time I was posting messages about the evolution of the Simplease logo. It started more than 5 years ago and it had produced a fair amount of artefacts, which can be found inside the linked messages below:\n\n1. [The original post introducing the company with it's old name \"Simplicious\"](http://web.archive.org/web/20150317213254/http:/typophile.com/node/58042)\n2. [Evolution of the Simplease logo – PART I](http://web.archive.org/web/20150317213254/http:/typophile.com/node/61385 \"Evolution of the Simplease logo – PART I\")\n3. [Evolution of the Simplease logo – PART II](http://web.archive.org/web/20150317213254/http:/typophile.com/node/61995 \"Evolution of the Simplease logo – PART II\")\n4. [Evolution of the Simplease logo – PART III](http://web.archive.org/web/20150317213254/http:/typophile.com/node/63567 \"Evolution of the Simplease logo – PART III\")\n\nOver the last years we were relatively happy with our logo:\n\n![Old Simplease logo](http://web.archive.org/web/20150317213254im_/http:/fs.simplease.at/XjHuBRahCo.gif)\n\nNevertheless I was never really satisfied with how it had turned out and tried dozens of redesigns and spent hundreds of hours, working on concepts and ideas that all turned out to be mediocre at best.\n\nSome days ago there was this idea of trying to set the word in a unicase type in the hope of ending up with a nicer and simpler overall appearance. I tried some different fonts and stumbled upon [Designal](http://web.archive.org/web/20150317213254/https:/www.myfonts.com/fonts/typeotones/designal/ \"Designal at myfonts.com\") from Félix Rufín.\n\nI reworked the \"L\" to represent a lowercase \"l\" based on the underlying theme of DIN and worked on the overall rhythm by choosing a somewhat looser tracking. Finally I worked on the kerning and ended up with this:\n\n![New Simplease logo](http://web.archive.org/web/20150317213254im_/http:/fs.simplease.at/H2EJ4CptXv.gif)\n\nIt would be really great to get your feedback on the concept, choice of font, and especially the tracking and/or kerning.\n\nThank you very much :)\n\n",
  "author": "Simplicious",
  "time": "11 Sep 2014 — 12:30pm",
  "uid": "44610",
  "comments": [
    {
      "time": "12 Sep 2014 — 1:48pm",
      "content": "As could be expected, I think |L| is the weak spot. Unfortunately there is not much choice between a big white gap or sitting uncomfortably on the baseline...\n\n"
    }
  ]
}
