{
  "id": "119523",
  "title": "Tinker Tailor Soldier Spy (Original Pressing)",
  "forum": "Home",
  "tags": [
    "Display"
  ],
  "content": "I've got a sure-fire stump-er, here. I'm not concerned about the top font. It's Avant Garde. I'm interested in identifying the pseudo-Russian/faux Cyrillic typeface. It's got to be phototype.\n\n ![](http://web.archive.org/web/20141017230419im_/http:/typophile.com/files/BK1539_6300.1L.jpg)\n\n",
  "author": "ralphsmouse",
  "time": "14 Sep 2014 — 12:22am",
  "uid": "90257",
  "comments": [
    {
      "time": "14 Sep 2014 — 6:58am",
      "content": "Given the fit of the letter forms, I'm betting this is custom.\n\nSome typefaces with a similar vibe are Stenberg and Rodchenko:  \n [http://www.myfonts.com/search/Stenberg/fonts/](http://web.archive.org/web/20141017230419/http:/www.myfonts.com/search/Stenberg/fonts/ \"http://www.myfonts.com/search/Stenberg/fonts/\")\n\n"
    },
    {
      "time": "14 Sep 2014 — 7:57am",
      "content": "The key to this lettering is the \"gaspipe\" or \"stovepipe\" corners. Start with a font with about the right height to width ratio and similar weight that has fairly tight curves outside AND inside, such as Ryoichi Tsunekawa's Design System A 700\n\n ![](http://web.archive.org/web/20141017230419im_/http:/typophile.com/files/DesignSystemA700InUse1_6471.gif)\n\n ![](http://web.archive.org/web/20141017230419im_/http:/typophile.com/files/DesignSystemA700InUse2_5322.gif)\n\n ![](http://web.archive.org/web/20141017230419im_/http:/typophile.com/files/DesignSystemA700InUse3_5194.gif)\n\n ![](http://web.archive.org/web/20141017230419im_/http:/typophile.com/files/DesignSystemA700InUse4_3549.gif)\n\n ![](http://web.archive.org/web/20141017230419im_/http:/typophile.com/files/DesignSystemA700InUse5_6690.gif)\n  \n [http://www.myfonts.com/fonts/flat-it/design-system/](http://web.archive.org/web/20141017230419/http:/www.myfonts.com/fonts/flat-it/design-system/ \"http://www.myfonts.com/fonts/flat-it/design-system/\")  \nClip and paste stovepipe elbows as required.  \nNote the final row. These are the glyphs \\_3\\_, \\_4\\_ and \\_l\\_. For \\_E\\_ you could start by flipping \\_3\\_. For \\_Y\\_ you could start with \\_4\\_. For \\_I\\_ you could start with \\_l\\_.  \nFor \\_N\\_ ignore the round-top version and make a simple straight line \\_N\\_.  \nOnly the lhs of \\_A\\_ will take some curve-bending.  \nDon \n"
    },
    {
      "time": "14 Sep 2014 — 4:07pm",
      "content": "Very helpful reply, donshottype. Design System A 700 has some pretty astounding similarities.\n\nThe sample could be custom. I should do a little more research about its designer and such. When I saw this thing at a book store, it threw me for a loop. Thanks for the help!\n\n"
    },
    {
      "time": "14 Sep 2014 — 4:39pm",
      "content": "So all we have to figure out is who was designing books for Alfred A. Knopf in 1974....\n\n"
    },
    {
      "time": "15 Sep 2014 — 12:36am",
      "content": "I checked the credits for a designer. Everything before the 00's leaves out packaging design credits!\n\n ![](http://web.archive.org/web/20141017230419im_/http:/typophile.com/files/%24_20_3582.JPG)\n  \nI should also note that this cover comes from the original U.S. pressing. The very first cover released in Britain looked loads different. \n"
    },
    {
      "time": "15 Sep 2014 — 5:45pm",
      "content": "Good font for a plumber -- all the pipe like shapes.  \nNixon had plumbers -- anyone remember Watergate. A US domestic spy story. Presumably Putin has them too,  \nWould be interesting to see authentic Cyrillic letters in this style.  \nDon\n\n"
    },
    {
      "time": "15 Sep 2014 — 7:11pm",
      "content": "The first British edition does, indeed, have a radically different cover (photo by Jerry Harpur), discussed here:  \n [http://www.existentialennui.com/2010/09/new-arrival-tinker-tailor-soldie...](http://web.archive.org/web/20141017230419/http:/www.existentialennui.com/2010/09/new-arrival-tinker-tailor-soldier-spy.html \"http://www.existentialennui.com/2010/09/new-arrival-tinker-tailor-soldier-spy.html\")\n\nRalphsmouse, I always thought it criminal that book designers rarely got credit for their work in this era. The tide only began to turn in the 80s and 90s....\n\n"
    },
    {
      "time": "16 Sep 2014 — 12:31am",
      "content": "I looked around and guys like Paul Bacon and [Ray Cruz](http://web.archive.org/web/20141017230419/http:/www.cruztypedesign.com/book-covers.html) were working for Knopf in the 1970's. The thought of a type designer like Ray Cruz drawing the type in question makes sense. I can't imagine anybody other than a professional lettering artist being responsible for something so inventive and sarcastic.\n\n"
    },
    {
      "time": "16 Sep 2014 — 5:03am",
      "content": "Rob, after having done this good detective work on Knopf cover designers of the 1970s, you might consider asking Ray Cruz to confirm he did the TTSS cover or, if he did not, to suggest who the designer might have been. If you do find out, it would be interesting to learn the answer.  \nDon\n\n"
    },
    {
      "time": "16 Sep 2014 — 9:26am",
      "content": "I’ll ask Ray.\n\n"
    },
    {
      "time": "16 Sep 2014 — 11:07am",
      "content": "Thanks Stephen.  \nDon\n\n"
    },
    {
      "time": "16 Sep 2014 — 2:44pm",
      "content": "I mentioned Ryoichi Tsunekawa's Design System A 700 in a previous post and suggested a recipe for using it's corners to make stovepipe elbows to approximate the letters.  \nUnfortunately the result is very approximate. The curves are too gradual and the weight is too light.  \nI created my own stovepipe elbows from scratch and constructed these letters and the rest of an alphabet based on my conjecture as to what I thought might work with this concept. I have no idea how the the designer of the Knopf cover would have made the rest of the alphabet. So here is a Tsar Poutine alphabet in use\n\n ![](http://web.archive.org/web/20141017230419im_/http:/typophile.com/files/TTSS_SM2_6621.jpg)\n  \nThe picture of poutine was contributed by Jonathunder to Wikipedia [http://en.wikipedia.org/wiki/Poutine#mediaviewer/File:Poutine.JPG](http://web.archive.org/web/20141017230419/http:/en.wikipedia.org/wiki/Poutine#mediaviewer/File:Poutine.JPG \"http://en.wikipedia.org/wiki/Poutine#mediaviewer/File:Poutine.JPG\")  \nThe letters might be hard to digest and are definitely not part of a healthy diet.  \nI might release Tsar Poutine as a font someday, but it does not seem like a very remunerative project.  \nDon \n"
    },
    {
      "time": "16 Sep 2014 — 7:13pm",
      "content": "She's beautiful, Don! You've captured the essence of the original design perfectly!\n\nMy thought is that every digital typographer's overall goal should be to give designers the freedom of having options. The more options there are, the more freedom designers have. Something as inventive and idiosyncratic as the original design/Tsar Poutine should definitely have a cushy spot in any designer's tool-shed!\n\n"
    },
    {
      "time": "16 Sep 2014 — 9:37pm",
      "content": "Thank you Rob. If I ever release it as a font the lower case would be a small caps version of the uppercase, just as in Cyrillic fonts, and a real Cyrillic alphabet would be included.  \nI do hope we find out the name of the book cover designer so that appropriate credit can be given.  \nDon\n\n"
    },
    {
      "time": "15 Oct 2014 — 4:07pm",
      "content": "I got in contact with Ray Cruz who led me to his coworker at Random House, Lidia Ferrara. She says:\n\n> It was designed by Robert Scudellari.  \n> His credit usually read Design by R. D. Scudellari.  \n> I do not have his contact information.  \n> For that you can contact Janet Odgis at Janet Odgis Design.\n"
    },
    {
      "time": "15 Oct 2014 — 5:35pm",
      "content": "I love that font, Don! Please release it! It is so unique, and sort of reminds me of the letter style used in some Russian propaganda posters. It's incredible.\n\n"
    }
  ]
}
