{
  "id": "119526",
  "title": "U.S. Government recommends Garamond, Century Gothic",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The U.S. Government has started a campaign to reduce print costs: PrintWise. Step 7 of their action plan states that ‘one of the three toner-efficient fonts’ should be used. Those fonts are Times New Roman, Garamond and Century Gothic.\n\nYou can read the 'Seven Steps to Lowering Print Costs' here:  \n [https://strategicsourcing.gov/sites/default/files/uploads/seven\\_steps\\_to...](http://web.archive.org/web/20150418201233/https:/strategicsourcing.gov/sites/default/files/uploads/seven_steps_to_lowering_print_costs_within_90_days_guide_vjune2012_0.pdf \"https://strategicsourcing.gov/sites/default/files/uploads/seven\\_steps\\_to\\_lowering\\_print\\_costs\\_within\\_90\\_days\\_guide\\_vjune2012\\_0.pdf\")\n\nThey even used Garamond and Century Gothic for the campaign logo:  \n [https://strategicsourcing.gov/sites/default/files/uploads/printwise\\_logo...](http://web.archive.org/web/20150418201233/https:/strategicsourcing.gov/sites/default/files/uploads/printwise_logo_full_color_1200px.jpg \"https://strategicsourcing.gov/sites/default/files/uploads/printwise\\_logo\\_full\\_color\\_1200px.jpg\")\n\nUndoubtedly the amount of Word documents set in Garamond and Century Gothic have grown by the thousands or even millions due to this campaign.\n\nWhat do you think of this campaign? Are these fonts actually ink saving?\n\n",
  "author": "rayzb92",
  "time": "14 Sep 2014 — 5:07am",
  "uid": "221456",
  "comments": [
    {
      "time": "14 Sep 2014 — 7:55am",
      "content": "But a look at fonts used in Acrobat shows they used Garamond and Monotype Grotesque for the flyer - we have had the ink saving discussion here before and with most text fonts the toner use is pretty uniform.\n\n"
    },
    {
      "time": "14 Sep 2014 — 1:30pm",
      "content": "The cost of the campaign will be far superior to any possible toner saving.\n\n"
    },
    {
      "time": "15 Sep 2014 — 7:34am",
      "content": "Claude Garamond was obsessively conscientious about conserving toner (it's even rumored that he didn't change toner cartridges a single time during his entire lifetime), but everyone knows that Jannon didn't share this attitude since he got kickbacks from the manufacturers. I declare the plan a failure.\n\nAndré\n\n"
    },
    {
      "time": "15 Sep 2014 — 8:56am",
      "content": "Thanks for the inside info Andre - now I know why my friends north of the border use more toner - they must be getting kickbacks too.\n\n"
    },
    {
      "time": "16 Sep 2014 — 12:16am",
      "content": "Is this really a thing now? I thought it was just some immature conclusion some high school student draw for his homework project.\n\n"
    },
    {
      "time": "16 Sep 2014 — 1:56am",
      "content": "Well, links seem to be broken, so we can hope it's just a prank...\n\n"
    },
    {
      "time": "16 Sep 2014 — 2:46am",
      "content": "This campaign started off mid 2012. So this was before the findings of the 14 year old. Somehow the U.S. Government find out by themselves that Garamond saves ink.\n\n"
    },
    {
      "time": "16 Sep 2014 — 5:33am",
      "content": "The Navy link [Toner-Efficient Fonts Can Save Millions](http://web.archive.org/web/20150418201233/http:/www.doncio.navy.mil/ContentView.aspx?id=4462) (March 8, 2013) is still working and according to it those fonts can save up to 30 percent over Arial. One of the three GSA approved fonts is Century Gothic. And in the Wiki article on [Century Gothic](http://web.archive.org/web/20150418201233/http:/en.wikipedia.org/wiki/Century_Gothic), it is written that the University of Wisconsin-Green Bay has found that Century Gothic uses about 30% less ink than Arial, but that the font uses more paper so that the savings are offset by increase in paper costs. The reference is a newspaper clip. I could find no serious reference and no quantitative analysis whatsoever.\n\nPS Here are Arial and Garamond at the same point size. And when you are told to use Word at 11 points, you do so, even in the academic world.\n\n ![](http://web.archive.org/web/20150418201233im_/http:/typophile.com/files/arial-garamond_4492.png)\n\nThe amount of toner is related to the area. Someone has a way to calculate the area of a glyph using its contours?\n\n"
    },
    {
      "time": "16 Sep 2014 — 5:22am",
      "content": "And to really save toner do not use, rules, bars, logos, line art, halftones, or any graphic elements. The GSA announcement has a square logo with GSA rerversed out = that more than offsets any saving from font selection. The idea that you can save with just proper font selection is silly. On the onther hand cutting color printing and duplexing will save money and paper.\n\n"
    },
    {
      "time": "16 Sep 2014 — 9:08am",
      "content": "Yes. GSA prescribes those three fonts to be set in 11 points. Pretty ridiculous. Saving to the extend of being obsessive would be using circled bullets instead of black dot bullets ...\n\n"
    },
    {
      "time": "16 Sep 2014 — 9:17am",
      "content": "Do people still use printouts that much? If users spend most of their time viewing on screen, then choosing as default in Word a font that was not meant for that purpose seems to be non productive.\n\nI work with LaTeX and I choose the font I want for viewing, and some other font I want for printing; but maybe LaTeX is not meant for everybody.\n\n"
    },
    {
      "time": "16 Sep 2014 — 10:50am",
      "content": "Yes, people still use printouts. Almost every teacher at my school prints documents I send them for feedback. Very view of the teachers are familiar with the 'Comment' tool in Word.\n\n"
    },
    {
      "time": "23 Sep 2014 — 11:18pm",
      "content": "Stymie might be another typeface to consider. And then there's Kabel.\n\nBut for something that's condensed as well as light, to save paper as well as toner, why not News Gothic?\n\n"
    },
    {
      "time": "24 Sep 2014 — 4:36am",
      "content": "> The U.S. Government has started a campaign to reduce print costs: PrintWise. Step 7 of their action plan states that ‘one of the three toner-efficient fonts’ should be used. Those fonts are Times New Roman, Garamond and Century Gothic.\n\n¶ **The Monotype Package**  \nThey exploit the fake _Garamond_—based on the Jannon template that looks like _Monotype Garamond_—and the new ersatz of _Futura_ from Monotype.\n\n¶ If they want to reduce costs drastically, there is one solution: a monospace and typewriter typeface like Howard Kettler's _Courier_. It's terrible for the eyes.\n\n"
    },
    {
      "time": "24 Sep 2014 — 5:12am",
      "content": "> If they want to reduce costs drastically, there is one solution: a monospace and typewriter typeface like Howard Kettler's Courier.\n\nFrom where comes this assumption?  \nBesides, a monospaced typeface would greatly lengthen documents, thus wasting paper.\n\n"
    },
    {
      "time": "24 Sep 2014 — 5:53am",
      "content": "¶ _Courier New_ is so thin, they will save ink.\n\n¶ They should instead use a thin weight of their selected typefaces to save ink too.\n\n"
    },
    {
      "time": "24 Sep 2014 — 12:15pm",
      "content": "A serious analysis should consider all the relevant parameters. At fixed point size (since that value is to be 11 points), and without condensing the font, there are two obvious parameters left: x-height, and contrast.\n\nObviously, a sans with low contrast wastes more ink than a contrasted font where strokes are thinned here and there. Less obviously for the layman, but probably more significant, is the effect of the x-height. Here are Arial (large x-height, low contrast), Times New Roman (medium x-height, medium contrast) and Mona Lisa Solid ITC (small x height, high contrast) all at the same point size.\n\n![](http://web.archive.org/web/20150418201233im_/http:/typophile.com/files/parameters_4796.png)\n\nWe are now left with an optimization problem provided we know the right objective function (the thing you want to optimize); that can't just be the amount of ink.\n\nAnd I did not even consider an additional parameter: hinting. Is it not possible to make a truetype font that is good to read on screen and that saves ink when printed (especially if all the reports end in drawers anyway).\n\n"
    }
  ]
}
