{
  "id": "119579",
  "title": "Guidance with selecting typeface for family gravestone...",
  "forum": "General Discussions",
  "tags": [
    "design",
    "General Discussions",
    "gravestone",
    "headstone",
    "typefaces"
  ],
  "content": "Subject: Guidance with selecting typeface for family gravestone...\n\n[First time poster, here. Just did comprehensive search of the forums for similar questions, and understandably found only a few on target (last one back in 2011).]\n\nHi all,\n\nI appreciate any guidance you might provide on this matter --- I'm trying to select a typeface for the burial headstone for a close female family member (passed away at ripe old age). I'd like the typeface to convey a sense of her strong family ties, as well as her great warmth combined with her no-nonsense/resilient approach to life.\n\nContext: my strong preference would be to find an actual stone-carver and let him do his magic, but that's cost prohibitive, especially since the cost of this sandblasted headstone is already included in the overall package price of the burial. Alas, the funeral home seems to have a very poor aesthetic --- everything is Times Roman (with truly terrible kerning). Long story short, I'm trying to prevent such a design memorializing a loved-on for perpetuity, by providing a camera-ready layout myself (the funeral home will then cut my layout into granite). I'm by no means a professional graphic designer, but I'm at least reasonably comfortable with my own aesthetic.\n\nSo far, I've been selecting potential typefaces from among those I already own (all within Adobe's Font Folio), as I'm best able to tell if they're a good match by setting the actual full headstone (name, dates, message, etc) in the typeface (and I don't want to needlessly purchase typefaces just to explore). That being said, if I'm convinced I should use one I don't own, I can purchase something / anything extra.\n\nOne direct question, and then one that's more open-ended:\n\n(1) Some of the typefaces that made my final round are part of Adobe's Opticals collection (which means I own them in caption, sub-head, text, and display optical sizes). While normally I would imagine that the display type should be used for such a huge element (100s of points), I'm not sure if similar logic should be transferred from the realm of \"ink on paper\" to \"cuts in granite\". Obviously, display types generally have increased stroke contrast (compared to text types), and this seems like a potentially complicating factor for stone-cutting (sandblasting, in my case).\n\nYour thoughts on this, please? Should I just ignore the actual size of the type, and select a \"text\" type from within the Opticals collection?\n\n(2) I'm open to suggestions on typefaces beyond what I've considered, please. Currently, my final list is:\n\nAdobe Jenson Pro Opticals  \n Adobe Kepler Std Medium Opticals  \n Adobe Goudy Old-Style Bold\n\nI've reviewed every font mentioned on the three existing Typophile forum threads on this topic, and a number of them are either too stylized, or too \"sans serif\" to fit the overall (but definitely not exactly uniform) style of other markers within our family plot. However, I did like the following typeface suggestions made in other threads:\n\nCentaur  \n Adobe Minion  \n ITC Golden Cockerel Titling  \n Bitstream Iowan Old-Style  \n Albertus\n\nand will consider adding these to the pile under consideration (of course, I already own the ones on my current final list, and don't own any of these new ones, but I can handle that as necessary).\n\nOne final note, FWIW: the headstone will also include some Hebrew (actual typeface currently undecided and likely subject of a separate forum thread after I finalize this choice).\n\nThanks for your consideration, and any thoughts or assistance is gratefully received...\n\n",
  "author": "dafreedm",
  "time": "15 Sep 2014 — 8:15pm",
  "uid": "222949",
  "comments": [
    {
      "time": "15 Sep 2014 — 8:28pm",
      "content": "Whoever is going to sandblast the lettering should be consulted regarding the technical requirements, but I think you're right to steer clear of display weights—too much contrast, which isn't optimal for the process.\n\nJenson, Kepler, Minion, Golden Cockerel (roman though, not titling), and Iowan are all good choices. Nice to see some uncommon names here, and all are sturdy faces.\n\nGoudy and Centaur have too much contrast for my taste, and Albertus is a bit too expected for this application. But those are just my personal opinions.\n\n"
    },
    {
      "time": "15 Sep 2014 — 8:46pm",
      "content": "Thanks so much for the input.\n\nWould indeed be great to get input from the person doing the sandblasting of this stone. Alas, they are \"computer-button pressers\", and seem to understand little more than that. sigh... When I tried to speak with them, I had to explain what \"kerning\" meant, what \"stroke contrast\" was, what a \"sans serif\" versus \"serif\" typeface was, etc, etc. They simply punch the stone's message into their computer, position the granite stone, and hit a button. Were it not for the case that the stone is effectively already paid for (with this existing funeral home), I'd obviously find someone else to do the work.\n\nThanks again for your comments --- I want to digest further your thoughts on typeface selection.\n\n"
    },
    {
      "time": "16 Sep 2014 — 5:54am",
      "content": "Hi. I rarely post here because I' a signpainter and calligrapher so I don't work with much text, mostly work with display fonts and hand lettering, including wood sign carving. But I have designed a couple of gravestones and the folks who sand blasted them liked my designs because I have seen enough blasting of several materials to \"feel\" how it's done. When blasting granite, which is a very very hard stone, you don't want the masking stencil to be worn down or the interior pieces (the bowls, etc.) to be blown away. So don't go any smaller than you have seen done successfully elsewhere and just try to think of how to make it reasonably easy for the person who wields the nozzle. (Actually having to execute much of my work makes me a better designer. What worked for Gill, works for me.)\n\nGoudy extra bold looks great, is traditional and blasts very easily. One local gravestone company even uses a slightly modified Goudy extra bold for their work. They didn't divulge the exact modifications but I'll look closer next time.\n\nGenerally speaking, I think Goudy would look great used with a Hebrew font.  \nJust keep in mind the lettering can be a bit \"busy\" looking because of highlights and shadows.  \nI hope the funeral home will tell you if any aspect of your design will be excessively difficult to produce. Maybe you'd like to post your design here on this forum.\n\n"
    },
    {
      "time": "16 Sep 2014 — 3:51pm",
      "content": "I have seen some pix of memorials in Plantin and it seemed to work well.  \nDon\n\n"
    },
    {
      "time": "17 Sep 2014 — 6:06am",
      "content": "How about this:  \n [http://www.fontbureau.com/fonts/mantinia/](http://web.archive.org/web/20150424041455/http:/www.fontbureau.com/fonts/mantinia/ \"http://www.fontbureau.com/fonts/mantinia/\")\n\n"
    }
  ]
}
