{
  "id": "119516",
  "title": "Cavatina – a font for writing music",
  "forum": "Release",
  "tags": [
    "alternates",
    "experimental",
    "features",
    "font",
    "ligatures",
    "music",
    "OpenType",
    "Release"
  ],
  "content": "Hi everybody! I am happy to announce the release of Cavatina: an experimental font for musical notation. It is the result of two years of work in design and programming.\n\nCavatina is my misuse (to put it nicely) of the OpenType font architecture, inspired by Travis Kochel's FF Chartwell. Similarly, the font relies on contextual alternates and ligatures to take care of the formatting and allow the support of a wide range of musical grammar. Among others, it is possible to write over four octaves of different notes, key and time signatures, barlines, accidentals, articulations as well as ornamentation, providing a system robust enough to allow fast musical composition. Additionally, I have written an open-source converter that translates the Cavatina text files to MIDI and MusicXML. A browser based text editor with integrated MIDI playback is also provided for the majority of those who don’t have a Mac.\n\nWithout any further talk, go check out the website: [cavatinafont.com](http://web.archive.org/web/20150317100248/http:/cavatinafont.com/).  \nTo test the font you can go through the [quick start](http://web.archive.org/web/20150317100248/http:/cavatinafont.com/quickstart.html). You don’t have to be a musician to understand how it works.\n\n ![](http://web.archive.org/web/20150317100248im_/http:/typophile.com/files/web-promo-1_6202.png)\n  \n\n ![](http://web.archive.org/web/20150317100248im_/http:/typophile.com/files/web-promo-2_4803.png)\n\nTell me what you think!\n\n",
  "author": "LexLuengas",
  "time": "13 Sep 2014 — 11:12am",
  "uid": "92807",
  "comments": [
    {
      "time": "13 Sep 2014 — 4:31pm",
      "content": "Looks like a great concept! If musicians can cut the time to write their own music, this is a excellent starting point for anyone learning to compose their own music. P.S. Keep up the good work!\n\n"
    },
    {
      "time": "13 Sep 2014 — 9:03pm",
      "content": "Hi I sent this to my musician friends, although I am not one myself. I tested it briefly just enough to realise the amount of work and ingenuity that it must have taken you to \"mis\"-use OT and with such apparent success. Congratulations.  \nMay I suggest that when you promote it you make the image of the notes more prominent than the font name, lest people think it is just another letter font.  \nI 'misused' OT (in a much less demanding way than to create notation) when I created a font to type diagrams for my physics paper: [http://vladimirtamari.com/beautiful\\_universe\\_font.html](http://web.archive.org/web/20150317100248/http:/vladimirtamari.com/beautiful_universe_font.html \"http://vladimirtamari.com/beautiful\\_universe\\_font.html\")  \nGood luck!\n\n"
    },
    {
      "time": "14 Sep 2014 — 1:12pm",
      "content": "Thanks, Danny!\n\nVladimir: Good point. Do you think it is also ambiguous for non-designers? (Nice to see another experimental font for a technical purpose ;-)\n\n"
    },
    {
      "time": "15 Sep 2014 — 4:55am",
      "content": "Lex  \nPerhaps you can show a photo or collage of a hand typing on the keyboard and on the screen a note appearing on the staves? BTW did you use VOLT to create the OT behaviour? Putting the notes on different heights is not technically different than what Arabic font designers do (as I did) to adjust the height of diacritical marks (and leaving the bearing width at zero.\n\n"
    },
    {
      "time": "15 Sep 2014 — 5:48am",
      "content": "> did you use VOLT to create the OT behaviour?\n\nNo, since the `mark` and `mset` feature tags seem to currently have very limited support. It’s all common `liga` and `calt` GSUB rules.\n\n"
    },
    {
      "time": "16 Sep 2014 — 8:01am",
      "content": "Hmm mark and mark on mark are standard features necessary for displaying Arabic diacritical marks. I never heard anything about limited support for them!\n\n"
    },
    {
      "time": "16 Sep 2014 — 8:07am",
      "content": "Nice! Does it align well with text? Does using it to include short snippets of music in text passages (e.g. in musicology articles) make sense?\n\n"
    },
    {
      "time": "17 Sep 2014 — 1:58am",
      "content": "Vladimir: you are so right. You will very probably see those features in the next implementation.\n\nJohan: The vertical metrics were set to allow systems of staves without further adjustment. In this sample, I’ve simulated a 24/29 setting:\n\n ![](http://web.archive.org/web/20150317100248im_/http:/typophile.com/files/Inline%20Test_5373.png)\n\n"
    },
    {
      "time": "18 Sep 2014 — 2:46am",
      "content": "Lex I am no authority on OT features, but using VOLT it is easy to change the positions of various elements. But after writing my comment I realised that not all software implement Arabic features (including marks) . For example Open Office does not display Arabic (right-to left text) correctly. Do try different ways..but 'if it ain't broke, don't fix it!\" ;)\n\n"
    }
  ]
}
