{
  "id": "119616",
  "title": "Concert poster",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "The choir I'm singing in is having a design competition for its next concert poster, and I'm planning to take part. The theme is movie themes. Here's my current draft:\n\n ![](http://web.archive.org/web/20150317133951im_/http:/typophile.com/files/film_10_small_4991.png)\n\nAny obvious blunders? Suggestions for improvement?\n\nI'm not too fond of the film strip carrying the logos, but I think that's a required element of the orchestra's logo.\n\nCheers\n\n",
  "author": "Catharsis",
  "time": "16 Sep 2014 — 5:15pm",
  "uid": "188621",
  "comments": [
    {
      "time": "17 Sep 2014 — 12:45am",
      "content": "Insert 1/8 em after Day and Month and something like an 1/24 between the hours.\n\n"
    },
    {
      "time": "17 Sep 2014 — 5:49am",
      "content": "Thanks! Better now?\n\nI also made the figure a bit smaller and added a smoke trail, though I don't like it much yet, it feels somewhat out of place, too cartoony. I think I might just remove it again. Or can you think of a better way to represent smoke?\n\n ![](http://web.archive.org/web/20150317133951im_/http:/typophile.com/files/film_12_small_5096.png)\n\n"
    },
    {
      "time": "17 Sep 2014 — 6:01am",
      "content": "By the way, I obtained the human outline by drawing a polygon over a reference image. Is that legit in terms of copyright?\n\n"
    },
    {
      "time": "17 Sep 2014 — 11:09am",
      "content": "I quite like the idea of the smoke, yet it’s not smoky enough. Never mind your drawing; that’s absolutely legitimate. In any case, you can alter some detail.\n\nFor instance, i cannot regognize if the guy is wearing a coat or short trousers. The hat would imply a coat. So, i would close the bottom part above the knees and straighten the left side of the coat.\n\n"
    },
    {
      "time": "22 Sep 2014 — 2:48am",
      "content": "This poster is very nice.  \nBut, why 2 differents red ? Use the same no ?\n\n"
    },
    {
      "time": "27 Sep 2014 — 4:18pm",
      "content": "@ Jürgen: I can't seem to get the smoke right, it feels too cartoonish. I've left it away for now. (Unless you have a suggestion on how to make it fit into the abstract style of the rest of the graphic?)\n\nIt wouldn't have occurred to me that the guy could be wearing flappy shorts. The hat and the fact that his legs wear skinny trousers are pretty unambiguous IMHO. I've tried manipulating the bottom of the coat, but whatever I did looked worse than before. Making the edges of the coat more symmetric actually favored the \"shorts\" impression, and removing the gap between them made him look like an exhibitionist rather than a mobster...\n\nBy the way, I had to change the title on the poster because the boss of the project (who is the orchestra director) apparently insisted on his exceptionally stupid-sounding, kindergarden-worthy, misleadingly-spelled, content-challenged Swiss German title. That also required me to rearrange the title graphically, during which I changed the font to make it fit the width of the doorway.\n\nFinally, I caved and added a solid black drop shadow to the text on the red bar after all. Can I get away with it if I blame it on the retro style of the poster? ;o) It just gives the title some clout; without it, it feels fuzzy and incorporeal to me.\n\n@ Gabrielle: Good catch on the reds! I changed them to be the same.\n\n ![](http://web.archive.org/web/20150317133951im_/http:/typophile.com/files/film_19_small_3706.png)\n\n"
    },
    {
      "time": "29 Sep 2014 — 1:36am",
      "content": "Jesses! Do isch öpper wahrschienlich riesig stolz über sin Ifall – Sing dä Film. Do kchasch numme …\n\nNevermind, but i wouldn’t use the solid drop shadow on the dates to the left. Or just very, very subtle. Let the title be more prominent (and use a smaller shadow for ‹dä›.\n\n"
    },
    {
      "time": "29 Sep 2014 — 5:25am",
      "content": "Gäll? Zum Driigingge! Wänns wenigstens törft \"Sing de Film\" sii — aber au dänn wüürs no erstuunlich wenig Sinn ergëë. Wëër söll dänn etz genau wële Film singe...? Gaat da a mir irgend e scheniali Pop-Reference velore?\n\nAnyway, good points on modulating the drop shadows. I'll give it a try.\n\n"
    },
    {
      "time": "30 Sep 2014 — 12:47am",
      "content": "Viellicht wirts ä Karaoke?\n\n"
    },
    {
      "time": "21 Oct 2014 — 9:14pm",
      "content": "The new title seems entirely out of place. What does singing have to do with film music? I do like how the typography is aligned with the doorway though. I don't think I would use any drop shadow at all.\n\n"
    },
    {
      "time": "27 Oct 2014 — 12:54pm",
      "content": "@ Martin: The program is mostly film music with choir, sometimes even just choir a cappella. Even so, it's ridiculously off-register and nonsensical, since it sounds like a call to the poster reader to sing one specific song. Can't change it, though.\n\nBy the way, I'm supposed to add three sponsor/affiliation logos. That's a bit tricky. They take up a lot of space and attention unless I make them so small as to blend with the text, at which point they might become very hard to read on the flyer (which is apparently going to be A6 format?). I could stow them on the top of the page with the choir and orchestra logos, but it doesn't fit well with the diagonal movement up there, and makes the whole arrangement look messy.\n\nArgh... what do you think? I'm currently leaning towards the second.\n\n(As for the drop shadow: I know it's out of fashion, but I like it here. I'll pretend it's for retro purposes!)\n\n ![](http://web.archive.org/web/20150317133951im_/http:/typophile.com/files/film_22_3767.png)\n  \n\n ![](http://web.archive.org/web/20150317133951im_/http:/typophile.com/files/film_23_4132.png)\n\n"
    },
    {
      "time": "27 Oct 2014 — 2:16pm",
      "content": "The problem with the drop-shadow under the text is that it clashes direction-wise with the shadow of the drawing.\n\n"
    }
  ]
}
