{
  "id": "1197",
  "title": "New text typeface, please critique",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello Everyone!   \n   \nI'd like you to take a lot at this project, and give me some suggestions. This will be a four weight typeface, the attachment is the light version.   \nMy idea is to develop a modern sans-serif, with a rounded feeling.   \nI've never finished any text typeface, with full range of weights, but this one I want to get there.   \n   \nAnyway, what do you think?   \n   \nHave a nice day!   \nFabio Luiz Haag\n\n<!--attachment: FH_foco_light-15641.pdf*mime_pdf.gif*application/pdf*93.6*This+is+FH+Foco+Light*FH_foco_light%2epdf --><!--attachment: FH_foco_light-15641.pdf*mime_pdf.gif*application/pdf*93.6*This+is+FH+Foco+Light*FH_foco_light%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012080910im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">This is FH Foco Light<br><a href=\"http://web.archive.org/web/20131012080910/http:/www.typophile.com/forums/messages/29/FH_foco_light-15641.pdf\" target=\"_blank\"><b>FH_foco_light.pdf</b></a> (93.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "haag",
  "time": "8 Sep 2003 — 5:39am",
  "uid": "2079",
  "comments": [
    {
      "time": "8 Sep 2003 — 6:18am",
      "content": "Hi Fabio,   \n   \nNot bad at all. It feels very friendly. I think the bold version will be very nice.   \nStill I think you'll have to make a decision. I see that the UC 'Z' and 'W' have rounded corners. Most of the other characters don't have that. Perhaps you have to choose what you want; with of without rounded corners. Perhaps that will make it more homogenious.   \n   \nFurthermore I think you will have to tweak the thickness of some of the characters a little. Some feel to heavy / fat in the text. I'm refering to the lc 't', 'l', 'i', 'j'. And the UC 'S' and 'E'. There's propably more, but these stood out when I had a quick overview.   \n   \nKeep on going the way you're going. I like it.   \n   \nPS Can it be you used an existing typeface as a basic? Somehow it feels familiar to me but I can't put my finger on it. But maybe that's good.   \n   \nRegards,   \nRen\n\n"
    },
    {
      "time": "8 Sep 2003 — 6:26am",
      "content": "Hi Ren\n\n"
    },
    {
      "time": "8 Sep 2003 — 6:51am",
      "content": "I'm also working on a light version of a type therefor I'm now very much into 'weight-watchers'.   \n   \nGreat that you totally created the type from scratch. For that it looks very professional and balanced. The longer you look for it the more you will find, so keep looking. Weight-control is very important, if you ask me, because then the type will present a very even image in a textblock. Black spots in the text are disturbing when you are reading the text. Especially with a light version.   \n   \nRegards,   \nRen\n\n"
    },
    {
      "time": "8 Sep 2003 — 11:24am",
      "content": "very elegant, Fabio. it's so light and crisp. please continue.   \n   \ni can't wait to see more of the complete character set and the numerals.   \n   \nalso, at first glance, the 'V' and 'X' might be a bit wide. consider narrowing it some.\n\n"
    },
    {
      "time": "8 Sep 2003 — 12:08pm",
      "content": "Well, besides the fact that I reserve the right to think that no sans can ever be a real text face, this one is too light and too constructed/mannered to \"hold\" a lot of text. But it's very cute, with great detailing, and there's no reason many people wouldn't love to use it for titling. So I recommend taking it in that direction - I think it has promise there.   \n   \nOverall the glyphs seems solid, and some of them have great character, like the \"i\" and the \"Q\".   \n   \nAs for the text block, I'd say your overall letterspacing a bit tight.   \n   \nBTW, did you get the stuff on p4 from... that Swiss guy's book - what was his name?   \n   \nhhp\n\n"
    },
    {
      "time": "8 Sep 2003 — 12:21pm",
      "content": "Emil Ruder? I think it is available for download here, in Typophile.\n\n"
    },
    {
      "time": "8 Sep 2003 — 12:33pm",
      "content": "Yeah, on both counts.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Sep 2003 — 1:51pm",
      "content": "I'm attaching a revised version of FH Foco Light. I really appreciate the comments and suggestions of all of you.   \nI already had the entire set almost done before, and now (since you aproved the main characters) I'm sending the numerals, plus the rest of the set.   \nOnce these are OK, I'll start working on the bold weight.   \nI'm looking forward your comments to improve this project.   \n   \nThanks,   \nFabio Luiz Haag\n\n<!--attachment: FH_foco_light_v3-15683.pdf*mime_pdf.gif*application/pdf*107.1*A+revised+version*FH_foco_light_v3%2epdf --><!--attachment: FH_foco_light_v3-15683.pdf*mime_pdf.gif*application/pdf*107.1*A+revised+version*FH_foco_light_v3%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012080910im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">A revised version<br><a href=\"http://web.archive.org/web/20131012080910/http:/www.typophile.com/forums/messages/29/FH_foco_light_v3-15683.pdf\" target=\"_blank\"><b>FH_foco_light_v3.pdf</b></a> (107.1 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "9 Sep 2003 — 1:16am",
      "content": "perhaps this design would lend itself to an italic version?\n\n"
    },
    {
      "time": "18 Sep 2003 — 12:00pm",
      "content": "Hi Everyone!   \n   \nI appreciate all of your comments, lots of them were really helpful.   \nI'm attaching now a revised version FH Foco Text Light. Lot's of corrections were made, and I guess now it's very fine.   \nBefore I start the Bold version, I wan't to check with you guys if there is still something to workout on this light version.   \n   \nThanks a lot,   \nFabio Haag\n\n<!--attachment: FH_foco_light_v4-16418.pdf*mime_pdf.gif*application/pdf*134.2*The+fourth+version*FH_foco_light_v4%2epdf --><!--attachment: FH_foco_light_v4-16418.pdf*mime_pdf.gif*application/pdf*134.2*The+fourth+version*FH_foco_light_v4%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012080910im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">The fourth version<br><a href=\"http://web.archive.org/web/20131012080910/http:/www.typophile.com/forums/messages/29/FH_foco_light_v4-16418.pdf\" target=\"_blank\"><b>FH_foco_light_v4.pdf</b></a> (134.2 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "18 Sep 2003 — 1:09pm",
      "content": "I must agree with Hrant about it not being a text typeface. Not only because of its lightness, but also because of tiny curvy details, and because of the structure of some characters (like agft, for example).   \nThat said, it looks nice. It has a strong \"corporative\" look.   \nI'd just like to point out that:   \n- your caps are too narrow;   \n- n and h are slightly wide.   \nIMHO. :-)\n\n"
    },
    {
      "time": "1 Oct 2003 — 12:31pm",
      "content": "Its really getting good, but I must agree with Hrant+Eduardo, that it much more seems to be a display typeface - all the fine details becomes more like a blure when set in smaller sizes. I have for some time now, been working on a text typeface - I met the same problem and started redrawing, trying to keep it as simple as possible - without losing the main ideas.   \n   \nNicolaj\n\n"
    },
    {
      "time": "11 Oct 2003 — 8:23am",
      "content": "Hello!   \n   \nI appreciate all of your comments about FH Foco Light. Really, thanks!   \nI'm working hard now on the Bold weight. On the attached PDF are the lower and uppercases to you critique.   \nI need your advise, since I guess something isn\n\n"
    },
    {
      "time": "14 Jan 2004 — 9:45am",
      "content": "Hi Everyone!   \n   \nI have done tons of improvements on this typeface family, and want your welcoming advices to move forward.   \nOn the attached PDF there are Foco Light, Regular, Medium and a small sample of Bold.   \n   \nI think the light version will work nice on titling and short paragraphs in large sizes, and the other weights were done planning to use on general texts, from 14 to 8pts.   \n   \nThanks!   \n   \nFabio\n\n<!--attachment: foco_FH-24154.pdf*mime_pdf.gif*application/pdf*123.8*Foco+FH*foco_FH%2epdf --><!--attachment: foco_FH-24154.pdf*mime_pdf.gif*application/pdf*123.8*Foco+FH*foco_FH%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012080910im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Foco FH<br><a href=\"http://web.archive.org/web/20131012080910/http:/www.typophile.com/forums/messages/29/foco_FH-24154.pdf\" target=\"_blank\"><b>foco_FH.pdf</b></a> (123.8 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "14 Jan 2004 — 12:16pm",
      "content": "Hey, great progress! This is becoming a highly usable design, I think.   \n   \nThe Bold is a little too close to the Regular.   \nThe \"K\", \"k\", \"x\" and \"y\" could use some curling at their bottoms.   \nI'd make the \"s\" more curvy.   \nTry making the \"G\" more open.   \nThe middle of the \"M\" is too light.   \nThe comma, \"S\" and \"U\" are malformed.   \nThe diagonals of the \"AE\" and the \"4\" are too thick.   \nI think you can get more wild with the ampersand.   \nThe \"@\" is out of character.   \nThe square brackets are too dark.   \n   \nThe spacing needs work, and is slightly loose overall.   \n   \nKeep it up!   \n   \nhhp\n\n"
    },
    {
      "time": "14 Jan 2004 — 12:18pm",
      "content": "Oh, and the caps are slightly too large. The good news is that they're also slighty too dark, which means a gentle scaling down (plus clean-up) should do the trick for both.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Jan 2004 — 4:15am",
      "content": "Thanks for your comments Hrant. All very usefull. Just one doubt: how exactly make the \"x\" curly at the bottom?\n\n"
    },
    {
      "time": "15 Jan 2004 — 8:35am",
      "content": "Maybe give the \"downhill\" stroke endings like the \"i\".   \n   \nhhp\n\n"
    },
    {
      "time": "15 Jan 2004 — 10:11am",
      "content": "Here is a samples of the curly diagonals k x y.   \n   \n ![](http://web.archive.org/web/20131012080910im_/http:/www.typophile.com/forums/messages/29/24200.gif)   \n   \nI guess it worked really well on the y. But on the x and k, at small sizes it gets a little fuzzy. That's beacuse the diagonal of y is much vertical than the ones at x and k. I would have to make the terminals too long in order to give the same curly appearence.   \nI will possibly use this feature, adding a headline font to this family.\n\n"
    },
    {
      "time": "16 Jan 2004 — 4:52am",
      "content": "Hi!   \n   \nHere is a comparison sample with the corrections suggested on the x, y, k, S, s, the height and weight of the caps (starting with HO), and a new at sign.   \n   \n ![](http://web.archive.org/web/20131012080910im_/http:/www.typophile.com/forums/messages/29/24256.gif)   \n   \nDid I went too far with the at sign shapes?   \n   \nthks!   \nFabio H\n\n"
    },
    {
      "time": "16 Jan 2004 — 8:21am",
      "content": "The \"S\" seems too big. I like the \"x\", but the \"y\" seems wide and the \"k\" needs work: maybe pull the arms away from the stem - make the connection thinner - but watch the width of the glyph too.   \n   \nI like the direction of the \"@\" - you might try connecting the tail of the \"a\" to the curve. And lowering the glyph.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jan 2004 — 6:04am",
      "content": "I agree with Eduardo: it does not seem to be suitable for book textsetting, because of its details form.   \nI don't know if it's a subjective feeling, but there are some ways in treating terminals which seriously hinder readability (is that readability, right, Hrant? Sorry, but we have just a single word in italian to translate both readability and legibility). I find this problem with Metroline, for example, or with other faces I currently do not recall.   \nBesides I insist saying calling Futura a text face is wrong. It's just that Futura has been so widely used we have no big problems reading full text in it. But a book set in Futura is really not functional.\n\n"
    },
    {
      "time": "17 Jan 2004 — 9:01am",
      "content": "\\> but we have just a single word in italian   \n\\> to translate both readability and legibility   \n   \nThen make one up - a good one - and start using it, and explaining it. If the wind blows your way, in a few years it might become a standard (at least an informal one). BTW:   \n1) I recommend the root \"lectur\" for building the word.   \n2) Jorge de Buen (and others) had the same problem with Spanish. I had suggested \"lecturabilidad\" but they thought it was too cumbersome, and they were gravitating towards \"lectabilidad\", I think.   \n   \nOne last thing: in English \"legibility\" is pretty standardized, but \"readability\" is highly variable, and context-sensitive. With a totally new word it's much easier to control the meaning.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jan 2004 — 11:26am",
      "content": "Hello!   \n   \nClaudio: I agree with you, this is NOT a text face as the threat title say. My objetive is to develop a nice sans for general corporate use, with few details that set it apart.   \n   \nHere is a new PDF of the Regular version, with lots of improvement.   \n   \nThere are two \"at signs\", the second as Hrant suggested.   \n   \nKerning is very poor yet.   \n   \nthks!\n\n<!--attachment: fc2_regular-24455.pdf*mime_pdf.gif*application/pdf*47.8 **fc2_regular%2epdf --><!--attachment: fc2_regular-24455.pdf*mime_pdf.gif*application/pdf*47.8** fc2_regular%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012080910im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131012080910/http:/www.typophile.com/forums/messages/29/fc2_regular-24455.pdf\" target=\"_blank\"><b>fc2_regular.pdf</b></a> (47.8 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "19 Jan 2004 — 3:23pm",
      "content": "Ok, some analphabetic critique:   \n   \nThe circle around the @ looks like it could stand to go another 90 degrees around. I think you've already departed from the traditional form enough. Having less of a circle just seems to detract from legibility without adding stylistically.   \n   \nAlso, the Registered sign (a circled R) should contrast with the copyright symbol (a circled c): They are usually only as high as a miniscule (lc x-height), with the copyright sitting on the baseline, and the registered raised so its top is even with cap or ascender height. I think I read this all in Bringhurst, but my books are mostly in boxes right now, so I'm not sure.   \n   \nThe florin probably should have at least a bit of an arm on both sides of the body.   \n   \nThe last 0 on the per mille (0/00) sign seems to be a bit disconnected. In handwriting, the two 0s on the bottom are usually connected by a line at the top, much like the top 0 of a percent (%) is usually connected to the slash in handwriting. Your two 0s seem to just be together by accident, and could use some bringing together.   \n   \nIf anyone is from France, please comment on the guillemettes. Should they vertically center the middle of caps, miniscules, or some compromise?   \n   \nThe cent sign (\n\n"
    },
    {
      "time": "19 Jan 2004 — 9:33pm",
      "content": "I'm neither in nor from France (although part of my heart is always there), but I'd say guillemets should center the same place the hyphen centers, which is generally slightly above the middle of the x-height.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jan 2004 — 11:23pm",
      "content": "Thanks Hrant. I wasn't sure whether my thoughts were due to it just looking right, or whether I had assimilated an actual design principle. Since it was the latter, the guillemettes need to be lowered to more closely center on the miniscules.\n\n"
    },
    {
      "time": "20 Jan 2004 — 12:22am",
      "content": "Hi Fabio,   \n   \nGreat updates. Some things catch my eye:   \n   \n- I would lower the\n\n"
    },
    {
      "time": "20 Jan 2004 — 1:28am",
      "content": "I think the florin sign is still used for other purposes than to indicate the Nederland currency, so a properly designed florin is still somewhat of a necessity.\n\n"
    },
    {
      "time": "20 Jan 2004 — 1:33am",
      "content": "Really, what is it used for then? I've never used it anywhere else than as the Dutch currency. Interesting to know the other purposes.   \n   \nRen\n\n"
    },
    {
      "time": "20 Jan 2004 — 2:10am",
      "content": "Function symbol in mathematics, for one. Some heathens just use an italic f, but us purist   \nmathies know better.\n\n"
    },
    {
      "time": "20 Jan 2004 — 3:17am",
      "content": "Hi Everyone!   \n   \nAll of your sugestions make much sense. I will start working on every single one during this week.   \n   \nI have never designed an entire typeface (with full char. set) so I was expecting mistakes on the characters not used so much (here, in Brazil).   \n   \nAbout selling (or giving, as Ren\n\n"
    },
    {
      "time": "20 Jan 2004 — 8:17am",
      "content": "Van,   \nI've been researching about the Registered and Copyright symbols, and the also the \"per mile\" characther design.   \nI have seen lots of faces such as Verdana, Times New Roman, Myriad, Gill Sans and all of them use those symbols the same way my typeface does. I guess there is no right or wrong, and both ways are accepted.   \nIt would be nice to hear more opinions concerning this.   \n   \nThe florin symbol will have an arm, like the \"f\".   \n   \nthks!   \nFabio H\n\n"
    },
    {
      "time": "20 Jan 2004 — 8:51am",
      "content": "A [link](http://web.archive.org/web/20131012080910/http:/www.typophile.com/forums/messages/30/13377.html) for ya.   \n   \nOh, there are two different dieresis? Compare\n\n"
    },
    {
      "time": "20 Jan 2004 — 9:59am",
      "content": "Some people also use the florin to mean \"folder\" on MacOS. Anyway, the best reason to include it is the same reason one needs to include something like the \"mu\": it's in the standard encoding! :-/ On the other hand, you could get creative and put your own funky stuff in there, like custom ligatures - just don't tell John. ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "20 Jan 2004 — 5:43pm",
      "content": "I know my copyright and registered symbol recommendations are from Robert Bringhurst's Elements of Typographic Style, so give it as much thought as you think it deserves. But if it works for you as currently designed, keep 'em. As for the per mille, I really was just trying to say that your second lower 0 doesn't seem very well connected to the rest of the glyph. The two 0s need to be pulled together somehow, that's it.\n\n"
    },
    {
      "time": "3 Jun 2004 — 7:48am",
      "content": "Hi everyone!   \n   \nLong time no \"see\".   \n   \nFH Foco is doing fine, the four weights were all adjusted with a \"fine brush\" and seem much even and nice to me. (check out the pdf)   \n   \nNow I'm working on the italics, and I'm not sure how to start. The GIF below is a beginning, what do you think?   \n   \n ![](http://web.archive.org/web/20131012080910im_/http:/www.typophile.com/forums/messages/29/37426.gif)\n\n<!--attachment: FH_Foco_020604-37427.pdf*mime_pdf.gif*application/pdf*192.6*The+4+roman+weights*FH_Foco_020604%2epdf --><!--attachment: FH_Foco_020604-37427.pdf*mime_pdf.gif*application/pdf*192.6*The+4+roman+weights*FH_Foco_020604%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012080910im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">The 4 roman weights<br><a href=\"http://web.archive.org/web/20131012080910/http:/www.typophile.com/forums/messages/29/FH_Foco_020604-37427.pdf\" target=\"_blank\"><b>FH_Foco_020604.pdf</b></a> (192.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nMany regards from sunny Brazil,   \nFabio Haag\n\n"
    },
    {
      "time": "3 Jun 2004 — 11:47am",
      "content": "Nice progress!   \n   \nIn the Roman, the darker it gets the more \"wobbly\" the outlines. And overall there is some wobble too.   \n   \nI think your Light should be a hair darker (and you could add an even lighter weights below it).   \n   \nThe \"M\" and \"r\" need work.   \n   \nTry a narrower \"4\" with a bowing diagonal.   \n   \nSpacing: I would tighten it up a hair (but make the blank space very slightly wider).   \n   \nItalics: looks fine to me so far.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Jun 2004 — 10:25am",
      "content": "Thanks Hrant for your comments. The M, r and 4 will be adjusted.   \n   \nI have finished the lowercase italics. I took as reference the FrutigerNext italics. What do you think?   \n   \nI really like the result. The italic curves reinforces the softness of the typeface and its elegant but friendly look.\n\n<!--attachment: FH_Foco_050604-37608.pdf*mime_pdf.gif*application/pdf*23.0*Lowercase+Italics*FH_Foco_050604%2epdf --><!--attachment: FH_Foco_050604-37608.pdf*mime_pdf.gif*application/pdf*23.0*Lowercase+Italics*FH_Foco_050604%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012080910im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Lowercase Italics<br><a href=\"http://web.archive.org/web/20131012080910/http:/www.typophile.com/forums/messages/29/FH_Foco_050604-37608.pdf\" target=\"_blank\"><b>FH_Foco_050604.pdf</b></a> (23.0 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "8 Sep 2003 — 7:04am",
      "content": "This is really lovely, Fabio. I love its subtle sway. I can see   \nmany great uses for this style and it's very original. Go go go!   \n   \nMy only concern is that the 'r' might be a bit too shy.   \nConsider lengthening its arm a bit.\n\n"
    }
  ]
}
