{
  "id": "119951",
  "title": "Serifed Caps With Notched Stems (Tuscan?) Of Varying Thickness Used In Powell & Pressburger's A Canterbury Tale",
  "forum": "Home",
  "tags": [
    "Serif"
  ],
  "content": " ![](http://web.archive.org/web/20150417034401im_/http:/typophile.com/files/a_canterbury_tale_3649.jpg)\n\nThis face is used in the closing credits, with a heavier weight used for most of them, but a lighter weight used here for 'THE END'.\n\nYou can see the whole film on YouTube here: [https://www.youtube.com/watch?v=rXQqzeiTYDo](http://web.archive.org/web/20150417034401/https:/www.youtube.com/watch?v=rXQqzeiTYDo \"https://www.youtube.com/watch?v=rXQqzeiTYDo\"), with this still from 1:58:00. If you don't know it, it is a very strange and rather wonderful film in parts and well worth watching.\n\n",
  "author": "darkandlong",
  "time": "26 Sep 2014 — 11:53pm",
  "uid": "42764",
  "comments": [
    {
      "time": "27 Sep 2014 — 5:43am",
      "content": "This was the era when movie lettering was still hand lettered rather than transferred direct from a font.  \nLooks like a version of the widely used Trajan column letters.  \nUpdate  \nThe \\_E\\_ is wider than usual for a classical Trajan.  \nI agree that the letters have a Tuscan flavor with the bifurcated ends, but off hand I don't recall a Tuscan that is an exact match.  \nIn these letters the bifurcated terminals are very restrained compared to the digital fonts that I have seen.  \nDon\n\n"
    },
    {
      "time": "27 Sep 2014 — 6:01am",
      "content": "I found something that might work as a substitute.  \nIt is a design made many years after the move -- in 1991-- by Richard Lipton \"based on Lipton’s own hand-lettered calligraphic alphabets that draw their influence from classic inscriptional forms.\" Check the terminal treatment on Arrus BT Roman\n\n ![](http://web.archive.org/web/20150417034401im_/http:/typophile.com/files/ArrusBTRomanAsTHEEND_5358.gif)\n  [https://www.myfonts.com/fonts/bitstream/arrus/](http://web.archive.org/web/20150417034401/https:/www.myfonts.com/fonts/bitstream/arrus/ \"https://www.myfonts.com/fonts/bitstream/arrus/\")  \nThe serifs extend too far and the weight is too heavy but it has some of the flavor of the lettering.  \nDon \n"
    },
    {
      "time": "27 Sep 2014 — 8:12am",
      "content": "That lettering immediately brought to mind [Artcraft](http://web.archive.org/web/20150417034401/http:/old.myfonts.com/search?search%5Btext%5D=artcraft),\n\n"
    },
    {
      "time": "27 Sep 2014 — 8:47am",
      "content": "Artcraft has the \\_T\\_ and \\_E\\_ with top serifs blowing in the wind, a feature that's missing from Arrus, which is in most respects the closest match. Can we think of any other similarly windblown serif fonts?  \nDon\n\n"
    },
    {
      "time": "28 Sep 2014 — 12:39pm",
      "content": "Edited  \nI reserved the film fom my local public library and should be able to view it within several weeks.  \nIs there any more lettering in this style?  \nDon\n\n"
    },
    {
      "time": "29 Sep 2014 — 3:01pm",
      "content": "Thanks Don,\n\nIt'd exactly the subtlety of the terminals that I rather like.\n\nArrus is an interesting one.\n\nFrom what I can remember there is another heavier variation and (a rather unpleasent) one with a slightly celtic feel, but I think this is the only text in this lighter variation.\n\n"
    },
    {
      "time": "29 Sep 2014 — 4:13pm",
      "content": "Pedr, Arrus is part way there. But to get these letters you really have to create them from scratch. Arrus is good in that it gives some idea of how to make some of the terminals. Draw on this and the windswept top terminals from Artcraft and it is possible to create something similar. Fair amount of work.  \nI think I saw the move many years ago and enjoyed it. Good stuff without Hollywood mega funding. Look forward to when I can see it.  \nDon\n\n"
    },
    {
      "time": "30 Sep 2014 — 11:44am",
      "content": "Actually, I just noticed that good ol' [Centaur](http://web.archive.org/web/20150417034401/http:/www.myfonts.com/search/centaur/fonts/) - albeit sharper - has similarities.\n\nDon - another \"windblown\" face is [Worcester](http://web.archive.org/web/20150417034401/http:/www.myfonts.com/search/worcester/fonts/).\n\n"
    },
    {
      "time": "30 Sep 2014 — 6:21pm",
      "content": "Thanks Mike, for the two windbown faces. Worcester is really in a heavy blast.  \nI expect that the lettering artist could have seen Centaur and this may have influenced the lettering.  \nDon\n\n"
    },
    {
      "time": "30 Sep 2014 — 11:55pm",
      "content": "The pangram for Worcester on MyFonts is 'When the zephyrs blow'.\n\n"
    },
    {
      "time": "1 Oct 2014 — 1:06am",
      "content": "Thanks Pedr. Coincidence or subtle description?\n\n ![](http://web.archive.org/web/20150417034401im_/http:/typophile.com/files/WorcesterPangram_4904.gif)\n  \nDon\n\n"
    }
  ]
}
