{
  "id": "119986",
  "title": "Proportional fonts for coding: vocabulary",
  "forum": "General Discussions",
  "tags": [
    "coding",
    "General Discussions",
    "programming"
  ],
  "content": "Hi all.  \nRecently I’ve switched to proportional fonts for programming, and have been looking for font choices, but find I’m missing some vocabulary.\n\nThere was a post on variable width fonts for coding here: [http://typophile.com/node/13090](http://web.archive.org/web/20140929135637/http:/typophile.com/node/13090 \"http://typophile.com/node/13090\")  \nBut aside from a few choices, I couldn't glean how to look for good fonts.\n\nHere are the characteristics I’m looking for:  \n0 - The font needs to work well at small sizes and coarse resolutions.  \n1 - The lowercase L and number 1, as well as capital i, need to be distinct at small sizes. Same with zero and o (upper and lowercase).  \n2 - Punctuation needs to be prominent. A period and a comma mustn’t be confused. Same with primes and hatches. (Helvetica and Fira Sans crash and burn here).  \n3 - Brackets, braces and parenthesis need room to breathe. It should be easy to select a single one out of a sequence with the mouse.  \n4 - The dot in the lowercase i needs to be visible at small sizes. Or at list, lowercase i and l need to be visibly different.  \n5 - Good line spacing, as text editors typically don't offer adjustment of leading.\n\nAre there names for any of these criteria? Or any general classification or help to find font families that match well?\n\nI notice that Bitstream fonts (and Verdana and Georgia) generally do better than fonts from other foundries when it comes to braces, brackets, punctuation. Why is this so? Why do most foundries squash these characters?  \nI also notice that a lot of sans serifs are directly disqualified by criterium 1. Why is it so popular to make letters look like each other? Isn't this bad for readability?\n\nWhat are others using? Some of my findings below.\n\nGood fonts I've found:  \n\\* Verdana is very good, and unmatched in giving room to braces, brackets and punctuation. But its lowercase i can be confused with an l at small sizes (an artifact of antialiasing and small pixel count, but still).  \n\\* Bitstream Vera Serif: the Sans fails distinguishing i, L, one. Vera Serif is pretty good, but its large x-height and small line spacing make it uncomfortable for me.  \n\\* Charter: very good in all respects. Perhaps the best overall.  \n\\* Input family: I like the idea of it, but like Vera, the spacing and x-height combine to make it unusable for me.  \n\\* Adobe Source Pro family: the Mono is the best monospaced font I know. The serif fails by compressing brackets, braces, parens.\n\n",
  "author": "jaimes",
  "time": "28 Sep 2014 — 5:13am",
  "uid": "223292",
  "comments": [
    {
      "time": "28 Sep 2014 — 8:00am",
      "content": "You can customize the line spacing of Input right at download time, increasing it up to 50% more than the default. [http://input.fontbureau.com/download/](http://web.archive.org/web/20140929135637/http:/input.fontbureau.com/download/ \"http://input.fontbureau.com/download/\")\n\n"
    },
    {
      "time": "28 Sep 2014 — 10:39am",
      "content": "I was just thinking of recommending Input but since @Thomas Phinney has mentioned it I don't need to say more.\n\nI personally favor Menlo and Espresso Mono. Fira Mono is nice too.\n\n"
    },
    {
      "time": "28 Sep 2014 — 12:59pm",
      "content": "Thanks! With the increased line spacing, Input fits the bill very well.  \nI hope more designers take up the challenge of proportional fonts for coding. Rather an under-served sector.\n\n"
    },
    {
      "time": "28 Sep 2014 — 7:08pm",
      "content": "ITC Officina?\n\n[http://www.myfonts.com/fonts/itc/officina-sans/](http://web.archive.org/web/20140929135637/http:/www.myfonts.com/fonts/itc/officina-sans/ \"http://www.myfonts.com/fonts/itc/officina-sans/\")  \n [http://www.myfonts.com/fonts/itc/officina-serif/](http://web.archive.org/web/20140929135637/http:/www.myfonts.com/fonts/itc/officina-serif/ \"http://www.myfonts.com/fonts/itc/officina-serif/\")\n\n"
    },
    {
      "time": "28 Sep 2014 — 9:17pm",
      "content": "The [i3project](http://web.archive.org/web/20140929135637/http:/code.google.com/p/i3project/wiki/Fonts) has some interesting fonts. The Trim font is a proportional font with enlarged punctuation for use in coding.\n\nIt would be easy to take an open source proportional font like Adobe Source Pro and replace its punctuation with the larger punctuation from Adobe Source Pro Mono. Some of the spacing of the punctuation might need to be shrunk, but I think this might produce a reasonable result. Worth a try, anyway.\n\n"
    },
    {
      "time": "29 Sep 2014 — 2:53am",
      "content": "Thanks Mark, ITC Officina looks pretty good. Dutch 811 seems to fit, too.\n\nStephen, that project is fantastic! Looks inactive, but I installed the fonts, and Trim is perfect. Cruft and Untyped are also worthwhile.  \nInteresting, I'd love to try my hand at customizing Adobe Source Serif. What programs does one use to do that?\n\nThanks.\n\n"
    }
  ]
}
