{
  "id": "120056",
  "title": "Retina (Hoefler & Frere-Jones) and telefont (Martin Majoor)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello!\n\nI'm doing a research about small typefaces.  \nIn my study I need to compare some typefaces (the word \"Hamburgevons1268\") that are not for sale like Retina (Hoefler & Frere-Jones) and telefont (Martin Majoor).  \nDoes anyone here has some refences on these typefaces (outside from what is online)?  \nI can't find a contact for Martin Majoor...\n\nThank you in advance.  \nAntónio\n\n",
  "author": "afonseca1974",
  "time": "30 Sep 2014 — 3:47am",
  "uid": "22399",
  "comments": [
    {
      "time": "30 Sep 2014 — 4:06am",
      "content": "I think your best chance is to contact him through Twitter or FB.\n\n"
    },
    {
      "time": "2 Oct 2014 — 2:39pm",
      "content": "Hmmm...Thank you.  \nApparently I have to be his \"friend\" to contact him...\n\nAntónio\n\n"
    },
    {
      "time": "2 Oct 2014 — 2:40pm",
      "content": "\"Apparently I have to be his \"friend\" to contact him...\"  \nI mean in twitter and FB...\n\nAntónio\n\n"
    },
    {
      "time": "2 Oct 2014 — 3:47pm",
      "content": "You can just mention (or “tag”) him in your post.\n\n"
    },
    {
      "time": "3 Oct 2014 — 12:03am",
      "content": "Just at TFJ on Twitter. (I don’t think FB is an appropriate place, but Twitter is definitely appropriate.)  \nOr you could try Typekit. They have this great technology that allow you to download and install fonts in their library without paying for the font license as long as you are a subscriber. Of course you won’t be able to extract them and install them elsewhere, but at least you have access.\n\n"
    },
    {
      "time": "5 Oct 2014 — 3:32pm",
      "content": "GrubStreet  \nThese fonts are not for sale (at least telefont...).\n\nI tried to send PM in FB and twitter...no luck so far :(\n\nAntónio\n\n"
    },
    {
      "time": "6 Oct 2014 — 9:36pm",
      "content": "If you haven’t got any responses and you are absolutely sure that he has missed it, whether it be unintentional or intentional, send out a formal Email to his public address for inquiry. I would surmise that TFJ (or Martin Majoor), like most members of the typographic community, is kind enough to reply to a well-intended Email. I got my internship in a letterpress studio by this way too.\n\n"
    }
  ]
}
