{
  "id": "120143",
  "title": "Uncover the Life of the One and Only Edward Bass",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": "The world of cinema can be compared to a Russian roulette - you never know whether the film will become successful and financially rewarding. Because there are numerous movies, released with amazing frequency, the audience always has a great range to make the choice. People’s demands grow while actors, producers and screenwriters strive to find a great concept and create something special. What if the source of creativity is limited and one day we'll get the feeling like we have already seen this actor or actress and script? The greatest thing movies can offer is uniqueness - each film producer really wants to see the audience in cinema getting excited and spellbound, thus the number one task is creating a film that provokes strong feelings. These can differ - persons may get irritated, surprised, scared or deeply inspired. As long as they demonstrate some type of reaction, the movie will entice them, even if it's the most disgusting horror with lots of blood scenes. Any film director is always searching for new concepts, searching for them in new spots and getting inspiration in literature and other people. Edward Bass, a great movie director and simply a fantastic guy is, definitely, a fantastic example of how talent makes the world go round. Edward Bass was born in 1967 and was introduced to the world of entertainment being a kid, meeting Frank Sinatra, Elvis Presley, absorbing the splendor of the beautiful life of popular creative people. His career started with some successful projects, one of these are: “Bob Hope Day”, “Great Moments Together”, “Stardust”. The incredible success convinced the young producer continue the way up the career ladder, setting new heights and working with famed actors such as Anthony Hopkins and Kevin Spacey. The genuinely memorable moment Edward Bass recalls with a special love is the release of the famous “Bobby”, nevertheless this is not the only merit to be mentioned. Edward Bass knows how to manage any type of talent, be it a dancer or a boxer - with the vast experience he had, all his projects were doomed to success. What is the main secret of Edward’s success? The simple response is he's a true hero of our times, being able to combine hard work with charity. Helping disabled children hope for a better future, making the world beautiful and take everything with laughter is a lifestyle of the multifaceted film producer and satiric [Edward Bass](http://web.archive.org/web/20141005160448/http:/www.esquire.com/features/hollywood/ESQ0506WEIRDMOVIE_106). For more information about this [film producer](http://web.archive.org/web/20141005160448/http:/www.esquire.com/features/hollywood/ESQ0506WEIRDMOVIE_106) visit our website: [click here](http://web.archive.org/web/20141005160448/http:/www.esquire.com/features/hollywood/ESQ0506WEIRDMOVIE_106).\n\n",
  "author": "elliotcal983",
  "time": "2 Oct 2014 — 11:52am",
  "uid": "223413",
  "comments": [

  ]
}
