{
  "id": "120129",
  "title": "New fonts in Windows 10",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I assume that the core TrueType fonts like Times New Romand and Arial will be supplied with Windows 10. Does anyone know if there will be new fonts supplied with Windows 10?\n\n",
  "author": "rayzb92",
  "time": "2 Oct 2014 — 4:42am",
  "uid": "221456",
  "comments": [
    {
      "time": "2 Oct 2014 — 5:20am",
      "content": "I didn't even knew that they would skip 9 altogether...\n\n"
    },
    {
      "time": "2 Oct 2014 — 9:30am",
      "content": "Just a recent announcement. They're catching up with OS X, or saying that they really should have made us pay for 8.1.\n\nBefore, there was a rumor that the version after 8.1 wouldn't be called \"Windows\". There was a thread with people joking about what they could call it instead. I suggested \"Standard\", after all, it's what people buy because almost all the third-party software is made for it.\n\nBut even the name \"Akzidenz Grotesk\" is taken. Well, there you are. They should include that as a replacement for Arial.\n\n"
    },
    {
      "time": "2 Oct 2014 — 10:28am",
      "content": "Rumor is that legacy code uses “windows 9” to judge the system version (Windows 95 or 98). To avoid dealing with this mess they just decided to use Windows 10.\n\n"
    },
    {
      "time": "2 Oct 2014 — 12:35pm",
      "content": "I don't care for the number 9. So it's fine by me. Wonder whether we can expect some new fonts though.\n\n"
    },
    {
      "time": "2 Oct 2014 — 2:00pm",
      "content": "It's true that people would refer to Windows 95 / 98 and Me as \"Windows 9x\" - I don't know if that relates to the naming decision.\n\n"
    },
    {
      "time": "3 Oct 2014 — 7:56am",
      "content": "Thank you for elaborating on the name of the new Windows. But could you also discuss possible new fonts?\n\n"
    },
    {
      "time": "3 Oct 2014 — 7:56am",
      "content": "I'm still hoping for Trebuchet Pro.\n\n"
    },
    {
      "time": "3 Oct 2014 — 8:02am",
      "content": "Yes, me too. Trebuchet is a good looking contemporary font. It ressembles Bliss. The only downside is that you can't use it for print body text because of the uneven spacing. Just like Verdana.\n\n"
    },
    {
      "time": "3 Oct 2014 — 8:16am",
      "content": "The Windows 8 version of Trebuchet contains the OpenType features found in the \"Pro\" version (AKA Trebuchet 2010). We didn't monkey with the spacing because that would break existing documents and web pages.\n\n"
    },
    {
      "time": "3 Oct 2014 — 8:46am",
      "content": "That brings me to another font: Calibri. According to Lucas de Groot he initially proposed a version without rounded corners. MS chose the rounded version instead. Why? One of the most given critique of Calibri is that it looks \"childish\" because of the rounded edges.\n\n> De Groot redesigned the font, taking out the rounded corners. When submitting the proposal to Microsoft, he sent along a sample of the original version, adding: ‘I like the look of it, but as you see these rounded tops look real ugly in ClearType; don’t choose this.’ De Groot had in fact been critical of the ClearType rasterizer when he first saw it demonstrated.  \n> To his astonishment, Microsoft chose the rounded version.\n\nAlso to my astonishment... Anyway, can we expect a Calibri without rounded corners? Maybe as an OpenType feature? Lucas de Groot already designed the font without rounded corners, so it might cost half the effort. Just sharpening the edges would not cause reflow issues. Besides, Windows 8.1 also came with another Calibri variant, Calibri Light.\n\n"
    },
    {
      "time": "3 Oct 2014 — 9:24am",
      "content": "\"One of the most given critique of Calibri is that it looks \"childish\" because of the rounded edges.\"\n\nThis narrative has not gained any significant traction as far as I'm aware.\n\n"
    },
    {
      "time": "3 Oct 2014 — 9:33pm",
      "content": "Maybe Calibri won’t look that bad with the new rasterizer in DirectWrite.  \nOr you could say Microsoft has this super long, elaborated scheme to implement DirectWrite in their future when they chose the rounded version.\n\n—  \nNow I know why I hate Calibri: because it’s rounded.\n\n"
    },
    {
      "time": "4 Oct 2014 — 11:32am",
      "content": "<cite>Now I know why I hate Calibri: because it’s rounded.</cite>\n\nYes. In essence Calibri is a good looking font. Well usable for print. It ressembles TheSans also designed by De Groot. TheSans is very popular in The Netherlands. If only MS would have chosen the non-rounded version...\n\n"
    },
    {
      "time": "6 Oct 2014 — 9:32pm",
      "content": "Oooohhh. So there is a sharp Calibri. I soon want to see MS include this in the new release, which is… possible? – given MS’s increasing attention to good typography. I mean, they even had Matthew Carter to design Sitka just for the browser reader, so anything could happen, right… ?\n\n"
    },
    {
      "time": "7 Oct 2014 — 7:57am",
      "content": "Yes. Anything is possible. I hope MS will include a sharp Calibri. Or just replace the current one. Like they did with Segoe UI. I don't think anyone would object to that. I still wonder what Si has to say to this proposal.\n\n"
    },
    {
      "time": "7 Oct 2014 — 8:03am",
      "content": "Oh, I forgot to mention. Besides, the rounded corners aren't visible when printing at size 11. Instead it makes the letters a bit 'runny' or 'fuzzy' if you understand what I mean. This isn't a reason to sharpen the edges of Calibri. Neither is it a reason not to...\n\n"
    },
    {
      "time": "8 Oct 2014 — 4:12am",
      "content": "It seems that Cambria, Calibri, and Segoe UI haven’t been updated.\n\nThere are bugs with the “centralized” and “breathy voiced” diacritic over the U+0261 symbol, for example.\n\nThe “breathy voiced” diacritic doesn’t combine well with the letter “e” either.\n\n"
    },
    {
      "time": "9 Oct 2014 — 7:05pm",
      "content": "Sylph, can you provide specific test character strings so we can check this behaviour? -- 'breathy voiced' diacritic doesn't tell me what combining mark character you are using for this function.\n\n"
    },
    {
      "time": "10 Oct 2014 — 1:20am",
      "content": "John, thank you for replying!\n\nThe “breathy voiced” diacritic is “diaeresis below”, U+0324, and the “centralized diacritic” is “combining diaeresis”, U+0308.\n\nCould you check it with the fonts listed above and Arial?\n\nUse Segoe UI 10 pt bold.\n\n"
    },
    {
      "time": "10 Oct 2014 — 2:52pm",
      "content": "Hi Slyph, can you provide scenarios for when this problem arises? I'm not familiar with the use of these characters.\n\nThanks!\n\n"
    },
    {
      "time": "12 Oct 2014 — 11:49am",
      "content": "Sylph, I see one problem with marks being too far left on some bases in Calibri, but no problems with the other fonts you indicated.\n\n ![](http://web.archive.org/web/20150418201444im_/http:/typophile.com/files/MSmarks_5717.png)\n\nAlso tested italic, bold and bold italic fonts, with same results.\n\nFont versions tested, in Wordpad, Windows 7:  \nCalibri v5.72  \nCambria v.5.96  \nSegoe UI v5.05  \nArial v6.82\n\n"
    },
    {
      "time": "20 Oct 2014 — 1:38am",
      "content": "The sharp Calibri definitely looks better. I'm tired of seeing the rounded Calibri in very inappropriate contexts. A sharp Calibri is some progress already. At the art academy I'm at you can almost guarantee students will use DIN. If not, they usually don't care enough to change the typeface to something original at all and they go for the standard Calibri. Last week I saw it in a digital presentation where it was practically used as a display typeface. I got really frustrated seeing that. Calibri is a nice typeface, but it seems packing it with Windows inevitably leads to abuse of the typefaces. I'm actually surprised people at the academy aren't typographically versed enough to make an appropriate choice in typeface. They never really seem to care. Well, they're starting to discover Gotham now. They're late to the game but they will inevitably follow trends while they're supposed to think about their type choices.\n\nAnyway, I see the sharp Calibri has bigger counters. That's good. I sometimes use Calibri in Word when I need to type out something before putting it into InDesign and I always felt the counters are too small. Especially with the rounded edges, the /a in particular looks very small.\n\n"
    },
    {
      "time": "20 Oct 2014 — 1:51am",
      "content": "Martin, that’s Segoe, not “sharp Calibri”.\n\n"
    },
    {
      "time": "20 Oct 2014 — 9:51am",
      "content": "Ohh, that's embarrassing and disappointing. I was already wondering why the shapes and proportions changed so severely and seem to morph into Frutiger but I just went with it. In that case I can't imagine sharp Calibri working well for me either.\n\n"
    },
    {
      "time": "31 Dec 2014 — 8:03am",
      "content": "Any information about new fonts in Windows 10? Any leaks?\n\n"
    }
  ]
}
