{
  "id": "12028",
  "title": "x-height",
  "forum": "Home",
  "tags": [
    "Book / Website / Information",
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20150202174349/http:/typophile.com/wiki/Indices) : [Terminology](http://web.archive.org/web/20150202174349/http:/typophile.com/wiki/Terminology) : x-height**\n\nSuccinctly put, the x-height is the height of the [lowercase](http://web.archive.org/web/20150202174349/http:/typophile.com/wiki/Lowercase) x in a given alphabet.\n\nIn the past x-height was stated by some as a proportion of the [cap height](http://web.archive.org/web/20150202174349/http:/typophile.com/wiki/Cap%20Height). In digital fonts, the x-height is specified in the font as a proportion of the [Em](http://web.archive.org/web/20150202174349/http:/typophile.com/wiki/Em), typically with 1000 or 2048 units to the Em. Additionally, many typographers state the x-height as a proportion of the total vertical span of the lowercase, often limited to simply the ascender height. This practice is based on the realization that lowercase letters constitute approximately 95% of text.\n\nMany regard the relative x-height of a given typeface as a factor in readability, believing that a larger x-height better accentuates the distinguishing characteristics of the lowercase letters simply because the main body of the letters are larger. For this reason it is a commonly held notion that smaller x-heights are better reserved for [display type](http://web.archive.org/web/20150202174349/http:/typophile.com/wiki/display%20type) where an enlarged size compensates for diminished readability. On the other hand, because reading is quite heavily dependent on the overall shape of the word, especially the top \"edge\", if x-height is very big the contrast between ascenders and the body of letters tends to be reduced, making text harder to read for longer periods. (Just as lines set in all capitals are generally regarded as difficult for extended reading.) Larger x-heights may also require more leading at a given point size for good readability.\n\n**Discussion:**  \n [Large x-heights = More Readable?](http://web.archive.org/web/20150202174349/http:/typophile.com/node/31427)\n\n",
  "author": "pstanley",
  "time": "8 Apr 2005 — 10:58pm",
  "uid": "1670",
  "comments": [

  ]
}
