{
  "id": "120300",
  "title": "I saw this board and I am looking for the font!",
  "forum": "Home",
  "tags": [
    "Display"
  ],
  "content": "I want to create the same board, I've already purchased a similar piece of wood and now I am looking for the font used in it in order to print the words and try to recreate it! They are two different fonts one for the word 'HOME' and one for the rest!  \nThank you all!!!\n\nYou found it!! I've spent so many hours searching for \"Everytim I Miss You\" font!!  \nI cannot thank you enough!!!!! You are all great!!!\n\nFont:&nbsp;\n\n \"Bambi Bold\" & \"Everytime I Miss You\" \n\nSolved By:&nbsp;\n\n [fvilanakis](http://web.archive.org/web/20150317155019/http:/typophile.com/user/176276 \"View user profile.\")\n\n| Attachment | Size |\n| --- | --- |\n| [Wherever+Im+With+You+Wall+Decor.jpg](http://web.archive.org/web/20150317155019/http:/typophile.com/files/Wherever+Im+With+You+Wall+Decor.jpg) | 35.13 KB |\n\n",
  "author": "valeria21",
  "time": "8 Oct 2014 — 6:36am",
  "uid": "223538",
  "comments": [
    {
      "time": "8 Oct 2014 — 6:46am",
      "content": "\"HOME\" is **[Bambi Bold](http://web.archive.org/web/20150317155019/http:/www.findmyfont.com/index.php/fonts/font-preview?fset=Dafont-8%20%2F%20%28Freemium%29&ffam=Bambi%20Bold%20-%20Regular&fid=28b5c9a549dfe802af864fc304fba926&fsize=60&text=HOME&fit=1)** by Gerard E. Bernor [1995]\n\n"
    },
    {
      "time": "8 Oct 2014 — 6:55am",
      "content": "'HOME': [Bembo](http://web.archive.org/web/20150317155019/http:/www.myfonts.com/search/bembo) Bold, squooshed a bit  \n'IS WHEREVER I AM WITH YOU': [Everytime I Miss You](http://web.archive.org/web/20150317155019/http:/www.kevinandamanda.com/fonts/freescrapbookfonts/everytime-i-miss-you)\n\n"
    },
    {
      "time": "8 Oct 2014 — 7:07am",
      "content": "\"IS WHEREVER...\" is **Everytime I Miss You** , free for personal use:  \n [http://www.kevinandamanda.com/fonts/freescrapbookfonts/everytime-i-miss-...](http://web.archive.org/web/20150317155019/http:/www.kevinandamanda.com/fonts/freescrapbookfonts/everytime-i-miss-you/ \"http://www.kevinandamanda.com/fonts/freescrapbookfonts/everytime-i-miss-you/\")\n\n\\*EDIT\\* Ryuk, I can't decide if Bambi is based on Bembo (the name 'Bambi' is rather suspicious off course) but I see a lot of differences (/E serifs, /O contrast, Curved top/bottom on /M/H ) so I decided to not remove the link to Bambi because it's actually a better match to the sample.\n\n"
    },
    {
      "time": "8 Oct 2014 — 8:19am",
      "content": "No problem for me, Fivos :) Regarding differences between Bembo and Bambi, you're right the ones you mentioned are present.\n\nEDIT: got a closer clone for Bambi than Bembo, it's [Bernstein TS](http://web.archive.org/web/20150317155019/http:/www.myfonts.com/fonts/ef-typeshop/bernstein)/ [Bamberg Serial](http://web.archive.org/web/20150317155019/http:/www.myfonts.com/fonts/softmaker/bamberg-serial) Extra Bold but by TypeShop/SoftMaker and Bamberg is even tagged as 'Bembo'... Not sure this Bambi is so legitimate... Lowercases are also pretty close to Bembo with some minor differences.\n\nEDIT2: just found another clone of Bernstein/Bamberg/Bambi called 'Heather'. Don't know what to think about the whole thing. Bernstein design date is 2006 and Dafont states Bambi is 'before 2005'. It's a complete mess...\n\n"
    },
    {
      "time": "8 Oct 2014 — 8:38am",
      "content": "My version of \"Bambi\" states in (c): \" Copyright 1995. Gerard E. Bernor. \"  \n\"Bernstein-Serial-Heavy\" states: \"(c) 1996 SoftMaker Software GmbH\"\n\nNote also that the fact SoftMaker sell their fonts at MyFonts.com does not make them more legitimate than others, as it is actually the ancestor of Brendel Informatik GmbH, a well known font-forgery company.\n\nMy assumption is that MyFonts.com cannot resist the opportunity to make some extra money from SoftMaker's collection and \"legitimized\" them by selecting about 1000 fonts of their 10s of thousands forged fonts they had in their collection. They actually selected the ones that are not \"exact clones\" (like Bamberg above) plus some original digitizations.\n\nMy whole experience (by trying to exclude clones from Find my Font database) leads to the same result, expressed many times here in Typophile: The type publishing & distribution industry is a total mess!  \nAll big companies out there, have - at some degree or another - cloned & sell somebody else fonts without permission and without respecting the designer rights!\n\n"
    },
    {
      "time": "8 Oct 2014 — 11:35am",
      "content": "Softmaker, to me, is almost worse than Southern Software was. They currently offer two CD's full of ripoffs. One has 9,999 fonts, the other over 12,000. They even offer a PDF on the promotional site that shows each font and blatantly lists which commercial font is copied (ITC Benguiat, Algerian (Letraset), etc. I've complained about this to MyFonts before (it's kind of backstabbing their other large foundries, no?). I'd have to agree with your assessment of why MyFonts would look the other way, Fivos.\n\nGerard Bernor was one of that pack making some early digital fonts that copied other fonts which didn't exist digitally yet elsewhere - so he was working from scratch. Back then, the fact that they weren't available digitally gave these new fonts some degree of legitimacy. Today, not so much.\n\n"
    }
  ]
}
