{
  "id": "120429",
  "title": "Pretty in Pink font (and IP question)",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi all,\n\nCan anyone help identify this font? I can't seem to track it down.\n\nAnd while we're at it. Is there any way to get an IP address removed from the block list? When I attempt to post from work (which goes through a US proxy server—I'm in Canada), I can't do it. But it's usually where I need the font identification done. I've written the site, but get no response.\n\nThanks!\n\n ![](http://web.archive.org/web/20150317125013im_/http:/typophile.com/files/Screen%20Shot%202014-10-11%20at%20Oct%2011,10_4036.19.25%20AM.png)\n\nFont:&nbsp;\n\n Helvetica (Ultra Compressed) modified \n\nSolved By:&nbsp;\n\n [fvilanakis](http://web.archive.org/web/20150317125013/http:/typophile.com/user/176276 \"View user profile.\")\n\n| Attachment | Size |\n| --- | --- |\n| [Screen Shot 2014-10-11 at Oct 11,10.19.25 AM.png](http://web.archive.org/web/20150317125013/http:/typophile.com/files/Screen%20Shot%202014-10-11%20at%20Oct%2011,10.19.25%20AM.png) | 160.13 KB |\n\n",
  "author": "Fiver",
  "time": "11 Oct 2014 — 7:18am",
  "uid": "43821",
  "comments": [
    {
      "time": "11 Oct 2014 — 7:28am",
      "content": "Re: the IP question. I can see what the moderators have to put up with.\n\n"
    },
    {
      "time": "11 Oct 2014 — 7:37am",
      "content": "It could be a **[Helvetica (Ultra Compressed)](http://web.archive.org/web/20150317125013/http:/www.findmyfont.com/index.php/fonts/font-preview?fset=Adobe%20%2F%20%28Commercial%29&ffam=Helvetica%20LT%20Std%20-%20Ultra%20Compressed&fid=4e00b3376fc9afa005fe9d81a0298b20&fsize=60&text=pretty%20in%20pink&fit=1)** with a modified |t| (the top cut) and a custom |y| (note that |y| baseline is off, anyway).\n\nRegarding your IP issue, I don't think you can easily find somebody to respond to your request.  \nI have also send a message the other day to ask about the spam amount on the site, and received no answer.  \nI feel that Typophile is running in the auto pilot at the moment, no moderators, no admins, nothing.\n\n"
    },
    {
      "time": "11 Oct 2014 — 7:46am",
      "content": "I'm a moderator, but I can only delete spam within threads. Sorry to see the rabid increase of spam threads slipping thru the filters I have the option to Unpublish an entire thread but nothing happens when I click on the button. Irksome to be sure, I only hope that they (whoever owns this site) are working hard to complete the code allowing me to do what I do.\n\nAs for the unanswered IP requests I hope they are resolved sooner rather than later.\n\n"
    },
    {
      "time": "11 Oct 2014 — 8:34am",
      "content": "Hi Neil,  \nand thank you for your response.  \nRegarding the spam mess: Sometimes a simple (but not so commonly used) method is more effective that a fancy (captcha etc) one. A simple question on user registration form like \"Five and two equals: X\" may result in a very good protection, even if the numbers are constant and not changing ;)  \nThe reason for that is the spammers usually use automated tools which cannot parse generic questions, especially if the question is displayed as an image.  \nEven if you can't implement the solution, I hope that you can forward this option to the admins/owners.\n\nFivos\n\n"
    },
    {
      "time": "11 Oct 2014 — 9:03am",
      "content": "Fivos, as of some time now, there is such question (something about who designed Gill Sans), but it accepts any input, so the spambots simply fill every text field they can with random strings and they’re in…\n\n"
    },
    {
      "time": "11 Oct 2014 — 9:29am",
      "content": "Ricardo I can't believe that a bot can guess \"Eric Gill\" by trying random words.  \nIf you check your profile, the correct answer (\"Eric Gill\") is public:  \n [http://typophile.com/user/46071](http://web.archive.org/web/20150317125013/http:/typophile.com/user/46071 \"http://typophile.com/user/46071\")  \nMaybe this is the reason (some) bots get-in very easily?  \nMaybe they try the words are seeing on other users' profiles.\n\nAnother trick: Introducing a reasonable delay of e.g. 5 secs after any failed registration attempt, it would greatly reduce the success rate of any bot trying to get in with brute force attempts (random strings, etc).\n\n"
    },
    {
      "time": "11 Oct 2014 — 10:03am",
      "content": "It does’t need to be “Eric Gill”, anything goes. That’s the problem.  \nIntroducing email confirmation, _that_ could limit the bots.\n\n"
    },
    {
      "time": "11 Oct 2014 — 10:32am",
      "content": "I really don't understand... If there is no check for the right answer, what's the meaning of the question?\n\nEmail confirmation will not limit (all) the bots: I'm admin in various forums and there are many bots that pass the email confirmation check. If you need absolute spam control the only solution is to have the moderators manually check and confirm any new registration.\n\n"
    },
    {
      "time": "11 Oct 2014 — 1:34pm",
      "content": "This would require editing as well:  \n [http://www.myfonts.com/fonts/tipo-pepel/chupada/](http://web.archive.org/web/20150317125013/http:/www.myfonts.com/fonts/tipo-pepel/chupada/ \"http://www.myfonts.com/fonts/tipo-pepel/chupada/\")\n\n"
    },
    {
      "time": "11 Oct 2014 — 9:34pm",
      "content": "Could the post be moved to another thread, could the name of the post be changed (e.g., \"SPAM\" ), could the link in the text be obliterated, or ... ?\n\n"
    }
  ]
}
