{
  "id": "120511",
  "title": "POLYLINE, monospaced 3x5 vector font",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Dear Typophile Forum,  \nPlease give me your thoughts on this new typeface of mine.  \nIt's a monospaced 3x5 vector font.  \nBest  \n/Mårten\n\n ![](http://web.archive.org/web/20150317142554im_/http:/typophile.com/files/141013-Polyline-02_small_4821.png)\n\n ![](http://web.archive.org/web/20150317142554im_/http:/typophile.com/files/141013-Polyline-012-small_5922.png)\n\n| Attachment | Size |\n| --- | --- |\n| [141013-Polyline-02.PNG](http://web.archive.org/web/20150317142554/http:/typophile.com/files/141013-Polyline-02.PNG) | 39.68 KB |\n| [141013-Polyline-012.PNG](http://web.archive.org/web/20150317142554/http:/typophile.com/files/141013-Polyline-012.PNG) | 16.46 KB |\n\n",
  "author": "mårten",
  "time": "13 Oct 2014 — 2:54pm",
  "uid": "10907",
  "comments": [
    {
      "time": "19 Oct 2014 — 2:06am",
      "content": "I think \"a\" and \"e\" break the flow a bit, especially the \"a\". Try to make them more cursive, like your other chars.\n\nHere is a somewhat similar design of mine in case you are interested:\n\n[https://dl.dropboxusercontent.com/u/46459223/font.png](http://web.archive.org/web/20150317142554/https:/dl.dropboxusercontent.com/u/46459223/font.png \"https://dl.dropboxusercontent.com/u/46459223/font.png\")\n\n"
    },
    {
      "time": "20 Oct 2014 — 8:38pm",
      "content": "I really enjoy it. I am a little bothered by the ‘m’. I don't know how you could do it but I would try to make it less heavy.\n\n"
    },
    {
      "time": "21 Oct 2014 — 1:49am",
      "content": "If I recall correctly, some monospaced typefaces lighten the |m| by shortening the central stem.\n\n"
    },
    {
      "time": "21 Oct 2014 — 10:29am",
      "content": "Are monospaced typefaces supposed to be absolutely consistent in line weight? I think I always assumed you can compensate for dark areas like these. The /m is invariably going to be problematic in a monospaced font, isn't it?\n\n"
    },
    {
      "time": "21 Oct 2014 — 12:45pm",
      "content": "> I always assumed you can compensate for dark areas like these\n\nYes, of course, but given the modularity and adherence to a very small grid of this design, I think it could be right to look for solutions used in pixel and similarly strictly constructed typefaces.\n\n"
    },
    {
      "time": "21 Oct 2014 — 4:57pm",
      "content": "That makes sense. I can see the solution for /m, but for the other characters I don't think such a solution would work. M/N/W/AE/OE/&/@/Ø are particularly too dark. For OE I would simply increase the counter a bit. For Ø perhaps the slash within the counter should be lighter than outside it. I would prefer to remove the slash from the counter completely, but given the point size at which the typeface seems optimal, I don't think the slash will be obvious enough if you remove the part within the counter.\n\nIt seems quite impossible to fix all the dark spots using a pixel-based solution. But I guess since the design is inspired by pixel typefaces, it may not be necessary to remove all dark spots.\n\n"
    },
    {
      "time": "22 Oct 2014 — 1:35pm",
      "content": "Thanks everyone for your valuable feedback!  \nI guess another trick to lighten the \"m\" could be to widen the grid slightly for that character, making the glyph a little wider, but keeping the character spacing? I was thinking about making this into an old school CAD font in the .shx format. In that case I would not be able to vary line thickness for individual characters or strokes.\n\n"
    },
    {
      "time": "22 Oct 2014 — 2:26pm",
      "content": "If you widen all letters enough, indeed the dark spots should mostly disappear, but I think you will have to wide the characters too much to remove the dark spots completely. If you widen the characters just a little, characters like /m will still look relatively too dark even though on an individual basis you've lightened the /m. It's worth a try though. Your characters are quite condensed, so you do have some space to work with.\n\n"
    }
  ]
}
