{
  "id": "12065",
  "title": "Blogging away…",
  "forum": "dan\\_reynolds's blog",
  "tags": [

  ],
  "content": "Wow. Typophile has been live for over an hour, and there aren't any blog posts yet? This cannot be; Typophiles don't strike me as a group that would shy away from new features! I have a hunch that the personal Typophile blogs (someone is going to have to create a cool acronym or cool name for these things) might turn out to be the best new feature on this site.\n\nI haven't taken to blogging yet, but I love the idea. In fact, I love the idea so much that a few weeks ago, I began to try and build my own blog into the [TypeOff](http://web.archive.org/web/20150420160612/http:/www.typeoff.de/) site (it isn't finished yet). Wouldn't you know, as soon as I got cracking with the code, I read that the new Typophile redesign would include personal blogs. No homemade blog could be as cool as a Typophile one; however, I still hope to launch the TypeOff-blog by the end of the month.\n\nThe new Typophile seems very visually sophisticated. In fact, it looks so visually sophisticated that I can't believe that I am actually looking at it! I haven't seen all of the new site yet, but the new look and the new features (like this, and the wiki) look so nice that the old comments and discussions—ported in total over to this new system, it seems—feel a bit lost amidst all of this luster. Kudos to Jared, Joe, Yves, Christian, and whoever else helped out, though. Typophile is the most important typographic site on the internet (IMHO), the discussions are what always gave it its charm, and I'm sure that they will continue to do so. Wow. This all rocks! Even the [Ghost of Steuf](http://web.archive.org/web/20150420160612/http:/typophile.com/user/7003) page.\n\n",
  "author": "dan_reynolds",
  "time": "5 May 2005 — 9:51pm",
  "uid": "1085",
  "comments": [
    {
      "time": "5 May 2005 — 9:55pm",
      "content": "Typophlogs!\n\n"
    },
    {
      "time": "5 May 2005 — 10:09pm",
      "content": "Hey, this Instant message thing is pretty sweet.\n\n"
    }
  ]
}
