{
  "id": "120647",
  "title": "A Typeface I Feel too Good About",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "This month I finally created a typeface that I feel happy about (maybe even too happy). This is just a compilation of different forms and ideas that I find appealing. I think I will also do a monospaced version. Some letters still have the a kinda \"default\" look, but I think that even in this early stage the personality of the typeface stands out?\n\nOr does it?\n\n![](http://web.archive.org/web/20150317110801im_/http:/typophile.com/files/01_1.png)  \n ![](http://web.archive.org/web/20150317110801im_/http:/typophile.com/files/02_0.png)\n\n| Attachment | Size |\n| --- | --- |\n| [01.png](http://web.archive.org/web/20150317110801/http:/typophile.com/files/01_1.png) | 97.84 KB |\n| [02.png](http://web.archive.org/web/20150317110801/http:/typophile.com/files/02_0.png) | 24.41 KB |\n\n",
  "author": "AlexanderKatt",
  "time": "19 Oct 2014 — 4:06am",
  "uid": "76756",
  "comments": [
    {
      "time": "21 Oct 2014 — 5:51pm",
      "content": "Pretty cool design. I like its playfulness. I don't quite know what kind of feedback to give on this though. I could tell you to condense n/m/u a bit more so the white space matches the counters of other letters, I could tell you to expand the D a bit, to decrease the top bowl of B, to slightly rotate S/s to the right, to raise the tittles in i/j, to fix the dark spot in 4 and to balance the t better, but honestly I find these irregularities rather charming. It's not an all-purpose typeface but I can certainly see its application. What is this typeface intended for though? If it's meant to be playful I wouldn't change things drastically. If you're attempting to design a well balanced typeface which is useful for much broader applications then I think you need to polish quite a bit. I wouldn't do that though. I'm actually trying to develop a more impulsive approach to type design, where I'm less concerned with consistency and more with creative shapes, such as I see here. I'm fond of Eyal Holtzman's work for this very reason.\n\nI would however make the hyphen shorter and thicker. Right now it looks like an en-dash. On that note, did you also add the en-dash and em-dash? I'm asking because in the text you're using a hyphen in the bottom left column where you should be using an em-dash.\n\n"
    },
    {
      "time": "22 Oct 2014 — 12:31am",
      "content": "Hi Martin.\n\nFirst off, sorry about the dashes/hyphens. I was in a rush to post this here so I forgot to draw them and these are the defaults.\n\nI never thought about what is this typeface intended for. I just saw a combination of ideas that would work and executed it. But I've made display faces only until now this is the closest thing I have to a standard Sans Serif. I imagine that the monospaced version will be suitable for a programming font, but I have to produce it first.\n\nYour feedback is great. I will definitively change some of the things you listed.\n\n"
    },
    {
      "time": "22 Oct 2014 — 12:31am",
      "content": "...\n\n"
    },
    {
      "time": "25 Oct 2014 — 9:25am",
      "content": "Bold:  \n ![](http://web.archive.org/web/20150317110801im_/https:/dl.dropboxusercontent.com/u/46459223/ff/02.png)\n\n"
    },
    {
      "time": "27 Oct 2014 — 11:32am",
      "content": "It has a nice rustic look to it. I would reduce the width of the space though, for both the bold and regular weight. By reducing the width of the space or spacing the other letters looser you will get a more even texture. The punctuation is probably too light.\n\n"
    },
    {
      "time": "28 Oct 2014 — 5:28pm",
      "content": "It's hard to make out in the pixelated image at the top, but my impression is that the light version has very uneven stroke widths, both between letters and within them. I'm having trouble parsing that as \"playful\", and would recommend fixing this.\n\nThe bold looks like it has significantly better-balanced stroke widths for some reason, and looks more useful. Here I can see a bit of the \"playfulness\" that Martin mentions. It reminds me of DIN up close and of Comic Sans at small sizes...\n\nIn both cuts, the spur of /G and the serifs of /i/j strike me as too timid; either make them distinct or lose them. The /t looks lopsided, though perhaps in character. Some of the glyphs are top-heavy, but probably by design (?).\n\n"
    },
    {
      "time": "28 Oct 2014 — 7:34pm",
      "content": "[http://typographica.org/on-typography/making-geometric-type-work/](http://web.archive.org/web/20150317110801/http:/typographica.org/on-typography/making-geometric-type-work/ \"http://typographica.org/on-typography/making-geometric-type-work/\")\n\n"
    },
    {
      "time": "3 Nov 2014 — 4:40am",
      "content": "Catharsis, Thanks for the output. The uneven strokes are probably due to hinting problems.\n\neliason, I feel I have taken into account most of the aspects from this tutorial. What in particular would you recommend me fixing? Stroke widths?\n\n"
    },
    {
      "time": "3 Nov 2014 — 5:08am",
      "content": "Letter widths and joins, especially in the bold. The bold has the dreaded \"chocolate-dipped\" effect. Pay more attention to counter size there. The 8 is top-heavy too.\n\n"
    },
    {
      "time": "3 Nov 2014 — 11:46am",
      "content": "If your image export does not render your font reliably, it would be helpful to upload a PDF.\n\n"
    },
    {
      "time": "3 Nov 2014 — 1:43pm",
      "content": "Do visit [https://dl.dropboxusercontent.com/u/46459223/text.pdf](http://web.archive.org/web/20150317110801/https:/dl.dropboxusercontent.com/u/46459223/text.pdf \"https://dl.dropboxusercontent.com/u/46459223/text.pdf\").\n\n"
    },
    {
      "time": "4 Nov 2014 — 9:02am",
      "content": "In the PDF I also notice the /u is too wide and /M and /f should be wider. As Craig said, pay attention to the counter sizes. Make sure the white space is more or less equal in each character to improve the rhythm and texture of the text.\n\n"
    },
    {
      "time": "15 Nov 2014 — 11:13am",
      "content": "You are right about the /u. The weird thing is that /n looks OK (they are the same letter).\n\n"
    },
    {
      "time": "16 Nov 2014 — 12:42am",
      "content": "It might be weird but it's not exceptional. When you turn /n upside down it always looks wider. /u should always be a bit more condensed than /n. Letters always require optical corrections, whether the basic shape is largely the same or not. My b/d/p/q are never perfect copies of each other, either. Optical corrections are always required.\n\n"
    },
    {
      "time": "19 Nov 2014 — 9:02am",
      "content": "New pdf: [https://dl.dropboxusercontent.com/u/46459223/text2.pdf](http://web.archive.org/web/20150317110801/https:/dl.dropboxusercontent.com/u/46459223/text2.pdf \"https://dl.dropboxusercontent.com/u/46459223/text2.pdf\")\n\n"
    },
    {
      "time": "22 Nov 2014 — 11:19am",
      "content": "Better, but there's still a lot going on that needs to be fixed. H and S could be wider, I\\_r is too close together, the tittles on i/j should be higher (at around the height of where the terminal of /f ends), the /f should be wider, the crossbar of /t should be longer on the right while its terminal should be condensed a bit (and so should the tail of /j), the /v is too light, the diagonals in /k could extend a bit further and the /r is too heavy in the join.\n\nThere's also something going on in the rendering. For example, in 'abolish' I see the /h with a thinner right vertical, the next /h looks good and the last /h in the text has a thinner stem. This makes it more difficult to check the typeface for inconsistencies. I just downloaded the PDF to see if it's the same on my computer. It was. I then zoomed in on your typeface to look if I can identify where the rendering problem comes from. I've found it. For starters, your horizontals are thicker than your verticals. Note that horizontals always look optically thicker than verticals, so you need to compensate for that. But this is only the start of the issues with this typeface. If you look at the /n for example, you have a very thick shoulder, thinner stems and the weight of the typeface is all clumped together near the join. That's exactly where you don't want the weight to be. Make the horizontals thinner and move the weight at the top of the shoulder to the right and decrease the weight in the join. I can recommend reading this short tutorial I wrote on dark spots in type design: [http://martinsilvertant.deviantart.com/journal/Dark-spots-in-type-design...](http://web.archive.org/web/20150317110801/http:/martinsilvertant.deviantart.com/journal/Dark-spots-in-type-design-322930112 \"http://martinsilvertant.deviantart.com/journal/Dark-spots-in-type-design-322930112\")\n\nAlso have a look at the resources on this page: [http://temple-of-typefaces.deviantart.com/journal/Type-resources-276795259](http://web.archive.org/web/20150317110801/http:/temple-of-typefaces.deviantart.com/journal/Type-resources-276795259 \"http://temple-of-typefaces.deviantart.com/journal/Type-resources-276795259\")  \nI think the Type Workshop might be particularly useful to you.\n\nAlso, here's one of 3 tutorials I did on type design; this one is on designing a sans serif: [http://martinsilvertant.deviantart.com/journal/How-to-design-a-typeface-...](http://web.archive.org/web/20150317110801/http:/martinsilvertant.deviantart.com/journal/How-to-design-a-typeface-Part-1-362811889 \"http://martinsilvertant.deviantart.com/journal/How-to-design-a-typeface-Part-1-362811889\")\n\n"
    },
    {
      "time": "29 Nov 2014 — 12:48pm",
      "content": "How can the choice of line thickness create a rendering proglem?\n\n"
    },
    {
      "time": "29 Nov 2014 — 1:19pm",
      "content": "Because your lines are not consistent in thickness. However, the vertical strokes seem to be consistent so perhaps that's not it. I've actually had the same problem with one of my recent typefaces while I'm absolutely sure the verticals are exactly the same, so I don't know what this is. I auto-hinted the fonts to make sure the problem wouldn't present itself on the web. So far I believe it's only in PDFs.\n\n"
    }
  ]
}
