{
  "id": "120601",
  "title": "Critique and Feedback for Assignment",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello everybody! I am pretty new to typeface design but I do have an interest in learning the process of designing my own typeface. This typeface design was intended as a research project, however the deadline's pretty tight so I have only another 2 days to complete the full uppercase and numeral sets.\n\nBasically, I am aiming to design a sans serif, geometric typeface that I like to coin as the \"lovechild of Futura and Gotham\". I will be taking some characteristics from Futura and Gotham, and combining them to create a softer yet bolder typeface. This typeface was made to be a header font, hence the heavier body weight. I have not gotten all the letters right, so the image seen here is just what I have so far. Also any suggestions to characteristics that I could add to further differentiate my typeface from Futura / Gotham or any other geometric sans serifs that are already out there?\n\nAny critique and suggestion will be very useful at this point. Thank you in advance! :)\n\nPS: This is my first time designing a typeface, so any tips would greatly appreciated too. Cheers!\n\n ![](http://web.archive.org/web/20150317104316im_/http:/typophile.com/files/Fotham%20a4-03_3927.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [Fotham-02.jpg](http://web.archive.org/web/20150317104316/http:/typophile.com/files/Fotham-02_0.jpg) | 594.66 KB |\n\n",
  "author": "beccaisnotgay",
  "time": "16 Oct 2014 — 8:12pm",
  "uid": "223545",
  "comments": [
    {
      "time": "17 Oct 2014 — 11:16pm",
      "content": "It will another two years, not two days to make this work. :-/  \nEven when you're trying to be highly derivative, the technical issues require a great deal of attention.\n\nhhp\n\n"
    },
    {
      "time": "21 Oct 2014 — 6:21pm",
      "content": "Indeed, this isn't going to work. I think you would do well to study the basic principles of type design first. For one, horizontal strokes are optically thicker so you need to compensate for that. You didn't, so all your horizontals look too thick. Here's a great source to study some basic principles: [http://www.typeworkshop.com/index.php?id1=type-basics](http://web.archive.org/web/20150317104316/http:/www.typeworkshop.com/index.php?id1=type-basics \"http://www.typeworkshop.com/index.php?id1=type-basics\")\n\nAnd here you can find more resources: [http://temple-of-typefaces.deviantart.com/journal/Type-resources-276795259](http://web.archive.org/web/20150317104316/http:/temple-of-typefaces.deviantart.com/journal/Type-resources-276795259 \"http://temple-of-typefaces.deviantart.com/journal/Type-resources-276795259\")  \nAlso have a look at the other blog posts. I have a few tutorials on how to design a typeface.\n\nAlso, don't think you can get a great typeface by combining popular ones. Especially if you're not well versed in type design, it can quickly become a monstrosity. Try to design your own typefaces. You learn a lot more by doing so. I can recommend to just keep experimenting, keep researching and keep looking at other people's designs. Reading the criticism people leave here on other people's typefaces can also be greatly beneficial as you get more insight into what works and what doesn't according to the professionals, rather than guessing what works. You first need to have knowledge before certain issues become obvious. For example, you probably didn't know that horizontal strokes look optically thicker, and so you didn't see that issue.\n\n"
    },
    {
      "time": "21 Oct 2014 — 7:15pm",
      "content": "Thank you for your feedback. Yes I did realised that along my research, which is why I've decided to hand in my research and continue to work on it after. :)\n\n"
    },
    {
      "time": "21 Oct 2014 — 7:21pm",
      "content": "Thank you so much for the resources, it would definitely be useful to go through them and continue experimenting. I've already handed in my work, but will continue to work on the typeface during my free time. Might take a few years but I'll get there! :)\n\n"
    },
    {
      "time": "21 Oct 2014 — 9:20pm",
      "content": "Do keep us posted!\n\nhhp\n\n"
    }
  ]
}
