{
  "id": "120689",
  "title": "JFK Monogram Fine Tuning",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is a monogram I have been working on for a school. My problem is with the width relationships between the stem, the leg and the arm of the K. I think I'm almost close to nailing it but it's such a difficult letter.\n\nI also tried to compensate for the brightness of the F making it slightly narrower on the stem than the J and the K.\n\nThanks for your time.\n\n ![](http://web.archive.org/web/20150317185911im_/http:/typophile.com/files/Monogram_4089.png)\n\n",
  "author": "rs_donsata",
  "time": "20 Oct 2014 — 2:54pm",
  "uid": "1530",
  "comments": [
    {
      "time": "20 Oct 2014 — 8:58pm",
      "content": "Ah, the figure-ground illusion, I remember doing something similar in design school with my initials a long time ago. It's a good technique.\n\nIt's working pretty well but the top of the F looks a little clunky to me. I like the minimalism but have you tried keeping more of the K?\n\n"
    },
    {
      "time": "21 Oct 2014 — 1:56am",
      "content": "I think you could try to either lower the right curve of |J| or gently reprise that curve on the F/K edge.\n\n"
    },
    {
      "time": "22 Oct 2014 — 7:59am",
      "content": "My first thought was to make the J taller so you can see the F more clearly. Same as what riccard0 is suggesting.\n\n"
    },
    {
      "time": "22 Oct 2014 — 1:48pm",
      "content": "Thanks, I'll try pushing the length of the J although I can't show more of the stem of the K because the previous version of the monogram shows a cropped K stem and looks pretty bad.\n\n"
    },
    {
      "time": "22 Oct 2014 — 2:21pm",
      "content": "It's working great! I read \"J K\" at first but an instant later read the \"F\".\n\nI would make the stem/gap of the \"F\" slightly narrower. Have you tried making the terminal of the \"J\" more harmonious with the angles in the \"K\"? That might backfire though...\n\nhhp\n\n"
    },
    {
      "time": "27 Oct 2014 — 5:16pm",
      "content": "I have to make some prints of the monogram at different sizes to decide the optima width of the stem-gap of the F, I'm not quite convinced of it yet!\n\n"
    }
  ]
}
