{
  "id": "12063",
  "title": "Typophile Beta Bug Report - PLEASE POST YOUR BUGS HERE",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Please post bugs you're experiencing here.\n\n",
  "author": "Jared Benson",
  "time": "5 May 2005 — 8:02pm",
  "uid": "3",
  "comments": [
    {
      "time": "5 May 2005 — 8:10pm",
      "content": "Wish I could post a screenshot. No img src tag allowed?\n\n"
    },
    {
      "time": "5 May 2005 — 8:14pm",
      "content": "My old icon/pic has disappeared. Will this reappear at some point, or do I need to create a new one?\n\n"
    },
    {
      "time": "5 May 2005 — 8:14pm",
      "content": "i could never get the auto password mailer to send me a new password, so i created this account. but what do i do when i want to access uppercase content?\n\n"
    },
    {
      "time": "5 May 2005 — 8:21pm",
      "content": "Image Upload: We had this working earlier, though buggy. It's on the dev list, rest assured.\n\nIcons: You'll need to create a new one, 60x60. Think of it as your own personal Typophile redesign. :)\n\n"
    },
    {
      "time": "5 May 2005 — 8:23pm",
      "content": "I don't see an uppercase forum?!?\n\n"
    },
    {
      "time": "5 May 2005 — 8:25pm",
      "content": "Uppercase Forum: It's coming. We need to refine some of the security permissions so it's truly private.\n\n"
    },
    {
      "time": "5 May 2005 — 8:25pm",
      "content": "This is sort of related to the the bug I was experiencing before. As long as the URL does not get prefixed with the www subdomain, I appear to be logged in. If I go away from Typophile for a while (say, I actually have to get some work done...) and return using a link or bookmark which includes the www subdomain, It appears that I am no longer logged in. Once I click another link within the Typophile site, the www is not used and I am magically logged in again.\n\nThis must have something to do with the domain specificity of your cookies. Perhaps redirecting or doing a mod\\_rewrite on all www.\\* requests to a subdomainless address would resolve the issue.\n\nYou guys are running this site on Apache, right?\n\n"
    },
    {
      "time": "5 May 2005 — 8:29pm",
      "content": "Old Accounts: We're sending out an email blast with new user information. We're troubleshooting the @typophile.com alias and hope to have that resolved asap.\n\nIn the meantime you can use my [Personal Contact Form](http://web.archive.org/user/3/contact) if you're having trouble with a new or old account - I'll manually enable your account or change email addresses as time permits.\n\nThanks\n\n"
    },
    {
      "time": "5 May 2005 — 8:34pm",
      "content": "This is just a niggly little cosmetic gotcha. The bar graphs on the poll page overlap with the text labels and other bits (like Christian's avatar in the example linked below.)\n\n[![Typophile Poll Display Bug](http://web.archive.org/web/20131017130226im_/http:/photos8.flickr.com/12581429_64fb216aee_m.jpg)](http://web.archive.org/web/20131017130226/http:/www.flickr.com/photos/splorp/12581429/ \"Photo Sharing\")\n\n[http://www.flickr.com/photos/splorp/12581429/](http://web.archive.org/web/20131017130226/http:/www.flickr.com/photos/splorp/12581429/ \"http://www.flickr.com/photos/splorp/12581429/\")\n\n"
    },
    {
      "time": "5 May 2005 — 8:36pm",
      "content": "Are we going to be able to use \\<img /\\> tags that point to external servers - such as [Flickr](http://web.archive.org/web/20131017130226/http:/www.flickr.com/)? Pretty please?\n\n"
    },
    {
      "time": "5 May 2005 — 8:38pm",
      "content": "Yeah! Gimme img src tag!\n\n"
    },
    {
      "time": "5 May 2005 — 8:56pm",
      "content": "Taking a peek at the [Designers](http://web.archive.org/web/20131017130226/http:/typophile.com/wiki/Designers) section of the Wiki, I noticed that Smartypants seems to be having its way with the term delimiters.\n\n[http://www.flickr.com/photos/splorp/12583491/](http://web.archive.org/web/20131017130226/http:/www.flickr.com/photos/splorp/12583491/ \"http://www.flickr.com/photos/splorp/12583491/\")\n\n"
    },
    {
      "time": "5 May 2005 — 10:08pm",
      "content": "I see signatures as a bug. Unless they're styled very small or gray, they just get in the way of real content.\n\n"
    },
    {
      "time": "5 May 2005 — 10:18pm",
      "content": "Just testing the 'Reply' function.\n\n"
    },
    {
      "time": "5 May 2005 — 10:19pm",
      "content": "So is there any difference between hitting the 'reply' button and just posting a new message?\n\n"
    },
    {
      "time": "5 May 2005 — 10:32pm",
      "content": "John, No. We have the option to turn on threaded discussion but that typically causes a lot of clutter. Same with signatures; we've always shied away from these sorts of message board add-ons as they usually interrupt the flow of the discussion, wouldn't you agree?\n\n"
    },
    {
      "time": "5 May 2005 — 10:34pm",
      "content": "Ghost of Steuf has got to be one of the greatest things about the new Typophile. No better picture could accompany the statement \"Yeah! Gimme img src tag!\" Rarr! \\*Hiss\\*\n\n"
    },
    {
      "time": "5 May 2005 — 10:37pm",
      "content": "Reply: the reply feature is a leftover feature in case we were to enable 'threaded' discussions. Given that we've always avoided threaded discussions in favor of a chronological, linear thread, the 'reply' is indeed the same as just posting a new comment.\n\n"
    },
    {
      "time": "5 May 2005 — 11:11pm",
      "content": "Aah, how nice to 'finally' have Typophile back up, again.. :)  \n_Thanks a lot, to the people behind the curtain, for all your fine work.._\n\n( I may still have to find my way around the brandnew Typophile 2.0,  \nbut, I already just noted that I am a 'Prolific Poster' now.. :)\n\n"
    },
    {
      "time": "5 May 2005 — 11:38pm",
      "content": "I'm sure you already know about the duplicate (sometimes thriplicate) instant messages. Would be nice to have an archive of IMs too, like an in and out box. I'd like to know what I sent.\n\n"
    },
    {
      "time": "5 May 2005 — 11:59pm",
      "content": "Was finally going to get a Dingbat membership, I noticed the links to the tee's arent working, nor the Join buttons.\n\n"
    },
    {
      "time": "6 May 2005 — 12:04am",
      "content": "Thanks for Typophile 2 guys! I've been awaiting this eagerly for a long time! I really appreciate all your hard work!\n\nOkay, here's the bug report.\n\n\\* It seems that both on IE and FF (on PC) that the first post in every thread wraps around the avatar image (if it's long enough) and in subsequent posts it doesn't wrap around the image at all.\n\n\\* When using FF on the Forums home page when you drag your mouse pointer over the links in the Prolific Posters and Active forum topics sections the headlines (or second versions of them) flicker above them (around 100 pixels).\n\n\\* At the bottom of the page where you're able to send instant messages the Go! button is located underneath the grey box instead of inside it.\n\nI love the news section, and everything else about the site... I haven't had a chance to explore too much yet. Plus the headlines are really great-looking (where you use that font-substition tech).\n\nWill we be able to use our real names (next to the messages) when we post? I really liked that about Typophile, that people weren't hiding behind aliases and you know who's who.\n\nThanks again for all the great work... this is all I can think of at the moment.\n\n\\>\\> Lauri Johnsen\n\n"
    },
    {
      "time": "6 May 2005 — 12:15am",
      "content": "Maybe you could / should add ' [Blogs](http://web.archive.org/web/20131017130226/http:/typophile.com/uppercaseblogs)' to the Menu at the top _( Forums, Typowiki, Projects, News, Resources, Membership )_, or are these some kind of hidden treasures, one has to find first.? :)\n\nAnd, one little, more or less bug, I just noted, when you preview your message / reply, there is the standard 'Typophile 'T' Icon' showing next to the message, instead of your own icon / avatar / symbol / thingie..\n\n"
    },
    {
      "time": "6 May 2005 — 12:20am",
      "content": "I've only started to browse through the new stuff, but it looks fantastic. Great job.\n\nHere are a couple bugs to report:\n\nI wanted to become an Uppercase member, but the link is broken. I tried to email the bot, first and my message was returned. So now I'm posting here.\n\nI'm trying to give you money and I'm getting shut down. Guess my credit's no good at Typophile\n\n"
    },
    {
      "time": "6 May 2005 — 12:42am",
      "content": "Couple of more bugs:\n\n\\* It seems that when you log in to the site the Username and Password input boxes look different (IE and FF on PC). Username box is not as tall as the Password box, it has a light grey border while the Password box has a dark grey border. And on FF the Password box's border turns blue when your typing something inside it (focus); this doesn't happen with the Username box.\n\n\\* Instead of quotes and apostrophies I see &#xy; codes in the list of forum topics and in the title bar of the browser.\n\n\\* Also when your reading a forum thread the great-looking headers with the thread topic doesn't show up on all pages (both IE and FF).\n\n\\* Also the image for the smileys used in old posts seems to be broken.\n\nLet me know if I'm being too nit-picky, just trying to help. :)\n\nThanks again!\n\n"
    },
    {
      "time": "6 May 2005 — 12:47am",
      "content": "As much as I love the new interface, the reliance on Flash is sort of annoying. I have Flashblock enabled in Firefox, and that renders a lot of the UI elements kind of useless. I know I'm probably being a reactionary nerd here, but am I just going to have to deal? Excessive Flash makes browsers sad on Mac OS X.\n\n"
    },
    {
      "time": "6 May 2005 — 12:47am",
      "content": "Lauri asked:  \n_Will we be able to use our real names (next to the messages) when we post?_\n\nThis is indeed possible. You can change your user name as it appears above your posts by visiting your user profile, clicking \"Edit\", and editing the first field: \"Username\".\n\n"
    },
    {
      "time": "6 May 2005 — 12:58am",
      "content": "- The instant messages do not like apostrophes, even straight quotes. They come out like this: \"I'/m trying to talk with apostrophes\".\n\n- I am concerned that not all the legacy forum posts were ported. For example, I posted about the FontBook before Typophile went down (see [Google cache](http://web.archive.org/web/20131017130226/http:/66.102.7.104/search?q=cache:1c645Eprz0gJ:www.typophile.com/forums/messages/30/70257.html%3F1114468081+%22the+next+fontbook%22+site:typophile.com&hl=en)), but my post was not [here on the new site](http://web.archive.org/web/20131017130226/http:/typophile.com/node/10440), even though the posts in that thread following mine _were_ preserved.\n\n"
    },
    {
      "time": "6 May 2005 — 1:01am",
      "content": "Stephen,\n\nThanks! I've got it changed now. Now we'll have to get everybody to change their usernames so that we know who we're talking to. It took me a while to figure out who \"formlos\" is. :)\n\nAlthough the ability to change your username without re-registering is great but it might lead to chaos if people constantly change their usernames or try nabbing other peoples'.\n\n"
    },
    {
      "time": "6 May 2005 — 1:09am",
      "content": "Perhaps there's a script that the admins could use to replace every account's Username with their Full Name. Hmm, but then there may be login trouble? Better yet, just have the site refer to the Full Name in all instances (Who's Online, post credits, IMs, etc) and leave the Username for login purposes only.\n\n"
    },
    {
      "time": "6 May 2005 — 1:15am",
      "content": "Well, Lauri, thats me, of course.. :)\n\n_( ' [Dav](http://web.archive.org/web/20131017130226/http:/typophile.com/user/977)' that is.. :) And, I may second Stephens motion / suggestion to let the site refer to the 'Full Name', rather than to the 'Login'.. )_\n\n"
    },
    {
      "time": "6 May 2005 — 1:21am",
      "content": "I'm presuming this is Flash-related, but tabbed browsing (& opening links in new windows) doesn't seem to work consistently. In Safari 2.0 (OSX 10.4), command-clicking on, say, the main navigation at top (\"Forums,\" \"Typowiki,\" etc.) loads everything in the current window.\n\n"
    },
    {
      "time": "6 May 2005 — 1:28am",
      "content": "Stephen,\n\nYeah, that would be best solution. Have a username for login purposes and then use your full name throughout the site. I tried logging out, and then using my old username to log in and that didn't work, so I had to use my full name (case insensitive) to gain access to Typophile.\n\nAlso, it would be nice to have some space between your username + time stamp and your message. Because the way it is now, the username with the timestamp looks like it's part of the message. This could be solved with some space, having your username in bold, a different color, put it in a box, or have a horizontal rule underneath the username. (Typophile 2.0 is still beta so I'm not too worried about all this).\n\n"
    },
    {
      "time": "6 May 2005 — 1:29am",
      "content": "You're right Jonathan, that's a flash thing.\n\n- Suggestion: The contrast between type and background is just one level too low for me. I don't need #000 on #FFF but things do feel a little muddy here. Same goes for the post separators. I liked the alternating post backgrounds of the old site. (White post, gray post, white, gray.)\n\n"
    },
    {
      "time": "6 May 2005 — 1:34am",
      "content": "Dav,\n\nI figured it was you after checking out your profile (by clicking on the T avatar; maybe the username should eb clickable as well?). And from there I followed the link to your website and got your full name. After seeing people's real names for so long usernames don't mean that much... so \"formlos\" is pretty indistinguishable from \"PantyRaider056\". :)\n\n"
    },
    {
      "time": "6 May 2005 — 1:43am",
      "content": "We \\*do\\* want to get back to real names, that was very Typophile. We'll get there.\n\nEricgio, hang tight. We have some bugs to work out on the membership side; we have an automated membership thingy we're debugging, and then we'll let you know.\n\n"
    },
    {
      "time": "6 May 2005 — 1:50am",
      "content": "[Should it validate?](http://web.archive.org/web/20131017130226/http:/validator.w3.org/check?uri=http%3A//typophile.com/node/12063)\n\n"
    },
    {
      "time": "6 May 2005 — 1:53am",
      "content": "Jared,\n\nThanks that sounds great! I knew that you guys would take care of it. :)\n\nShould I change back to my old username if I want to keep it? So that I don't have to use my full name to log in in the future...\n\nThanks again!\n\n"
    },
    {
      "time": "6 May 2005 — 2:12am",
      "content": "The header animation will get old really soon. I don't like any of the annoying flash used. Message text and header blend in as in:\n\nbenson : Fri, 2005-05-06 05:02  \nPlease post bugs you’re experiencing here.\n\nExcessive absolute page width.\n\n"
    },
    {
      "time": "6 May 2005 — 2:23am",
      "content": "Agree with the width. I may have to go back to creating all my own linebreaks!\n\n"
    },
    {
      "time": "6 May 2005 — 2:29am",
      "content": "Where are the archives? And the search?\n\n"
    },
    {
      "time": "6 May 2005 — 3:17am",
      "content": "Looks great to me. How do I erase a post I have created accidentally though? I tried \"edit\" and then erase the contents but that's clearly not the way to go...\n\n"
    },
    {
      "time": "6 May 2005 — 3:18am",
      "content": "It should be possible to post in the news section like in the old forum.\n\n"
    },
    {
      "time": "6 May 2005 — 4:17am",
      "content": "The accented letters in my name are changed to question marks in my account full name\n\n"
    },
    {
      "time": "6 May 2005 — 5:46am",
      "content": "Total number of posts! I know it encourages logorrhea, but seeing the post number of each post made it instantly clear how much of a regular each poster is / was. Can that come back with full names?\n\n"
    },
    {
      "time": "6 May 2005 — 6:11am",
      "content": "Oops posted this first on the announcement thread.\n\nMy request for new password on my old user name ‘billyb’ did not get a response, though the site posts a message that the password was sent.\n\nI registered anew, and then tried again to get a new password for ‘billyb’ using my e-mail address. That responded under the new registration. Is my old user name dead?\n\nI agree with Stephen Coles about the background - too little contrast, the old way was better.\n\nAlso, is there any way to edit posts for spelling etc after posting, as before? Or is this gone?\n\n"
    },
    {
      "time": "6 May 2005 — 6:15am",
      "content": "I don't see activation of e-mail notification for threads that one participates in. Is this somewhere I don't see?\n\n"
    },
    {
      "time": "6 May 2005 — 6:51am",
      "content": "It is excessively slow in comparison with the former site. The text of the section Post (to the right of the screen) is quite mixed.\n\n"
    },
    {
      "time": "6 May 2005 — 6:58am",
      "content": "I am also experiencing very s - l - o - w response from the site.\n\nThanks for all your hard work on improving the site!\n\n"
    },
    {
      "time": "6 May 2005 — 7:11am",
      "content": "othiym23 said: <cite>Excessive Flash makes browsers sad on Mac OS X.</cite>\n\nUm. Since when? Maybe if you're still running Exploder 5 on Puma.\n\nI'm finding the new Typophile Flash bits flying even better than the previous version in Safari and Firefox.\n\n"
    }
  ]
}
