{
  "id": "120733",
  "title": "Zwartika (ultra black display face)",
  "forum": "Sans Serif",
  "tags": [
    "1960s",
    "Cold War",
    "Helvetica",
    "Sans Serif",
    "Ultra Black",
    "Zwartika"
  ],
  "content": "I just saw the following post: [http://typophile.com/node/119543](http://web.archive.org/web/20150317100644/http:/typophile.com/node/119543 \"http://typophile.com/node/119543\")  \nI was going to comment there with some shameless self-promotion, as the postwar theme relates strongly to what I've been doing in the past weeks. However, I wanted to give so much background information that it would just be embarrassing to present that in the aforementioned thread.\n\nFirst off, I'm going to tell something about the project so if you're only interested in the typeface, scroll down.\n\nI would like to present a preview of a typeface I have almost finished which is based on the Helvetica model. It's not an alternate though, as it's an ultra black display variant. In the last weeks I've been working for Stedelijk Museum Schiedam for a school project. Each group was assigned a different section of the exhibition \"Ik hou van Holland\" (I love Holland) — Dutch art after 1945. [http://www.stedelijkmuseumschiedam.nl/nl/tentoonstellingen/nu-in-het-mus...](http://web.archive.org/web/20150317100644/http:/www.stedelijkmuseumschiedam.nl/nl/tentoonstellingen/nu-in-het-museum/334-opening-ik-hou-van-holland-21-september-2013 \"http://www.stedelijkmuseumschiedam.nl/nl/tentoonstellingen/nu-in-het-museum/334-opening-ik-hou-van-holland-21-september-2013\")\n\nOur group was assigned the Soft Living section which was about the 60s and the Cold War. It showcased works like 'The Soft Living Room' by Maria van Elk, 'TV as a Fireplace' by Jan Dibbets, 'Signing the sky above the port of Amsterdam by airplane' by Marinus Boezem and 'Teaparty' by Bas Jan Ader.\n\nThe brief was to develop a project to promote the museum and to have a way of measuring the increase in customers. After extensive research on the museum, the exhibition, the artists and their mindset and the 60s, we decided to design a newspaper as this correlates nicely with the mass media which came to prominence in the early 60s. We discovered that many of the sentiments of the 60s are still prevalent today and in fact there is a cycle of repetition regarding politics and civil rights movements. In fact as of August 2014 we entered into a second Cold War. We collected literature from the 60s and used this as a canvas and added a second layer to give insight into how the 60s correlate to our time. For example, we used one article on Frank Zappa with the title 'This man is very dangerous' and we made a collage where the name Zappa was covered by Obama's name, thus changing the nature of the article entirely. Another example is putting images together to add meaning, like putting pictures of the Dutch feminist group Dolle Mina's next to \\*\\*\\*\\* Riots and Wonder Woman, thus implying feminist groups to be the defenders of the public.\n\nAnyway, I also did research on the typefaces used in the 60s and typefaces used by newspapers. Obviously by the end of the 60s Helvetica became very popular and I particularly noticed Helvetica Condensed Bold being used for headings. I didn't really want to use authentic typefaces though; the newspaper had to be somewhat authentic to the 60s but with a twist. As such the idea arose to design an ultra black display typeface based on the Helvetica model, which we were going to use for the branding of the newspaper and our project as well as setting some of the headings.\n\nI decided on the name Zwartika because 'zwart' is Dutch for 'black', and the name brings up an association with swastika, which I think is just for a propaganda kind of typeface. Zwartika is just about done and I'm almost done with Giltika, which is a more playful variant which is a little step into Kayo's (Gill Sans Ultra Black) direction. I only developed Zwartika for the project though, but currently I'm expanding the typeface. I have the design of Zwartika Regular and Italic done and of Giltika Regular and Italic, though I have yet to turn the italics into a font.\n\nI gave Zwartika away for free at the art academy as a one-time offer but I intend to sell an extended version and Giltika soon on MyFonts. As such it seems like a good idea to ask for some criticism now. It's very late, but I rather do it now than not at all.\n\nI'm also uploading documents of the project for those who are interested. The Soft Living research and presentation documents are early on in the project, so we were thinking of different concepts back then. 'Presentation Stedelijk Museum Schiedam' is the final presentation I gave to the client. We had an exhibition of the project with a newspaper stand and newspapers which I printed in risograph (which was often used in the 60s apparently). The client and the teachers then selected the projects they thought were best and wanted to know more about and those projects did a digital presentation to compliment the exhibition. I will post a few pictures of our exhibition separately.\n\n| Attachment | Size |\n| --- | --- |\n| [Zwartika OpenType features.pdf](http://web.archive.org/web/20150317100644/http:/typophile.com/files/Zwartika%20OpenType%20features.pdf) | 55.75 KB |\n| [Giltika OpenType features.pdf](http://web.archive.org/web/20150317100644/http:/typophile.com/files/Giltika%20OpenType%20features.pdf) | 54.55 KB |\n| [Zwartika & Giltika comparison.pdf](http://web.archive.org/web/20150317100644/http:/typophile.com/files/Zwartika%20&%20Giltika%20comparison.pdf) | 34.25 KB |\n| [Soft Living — Comfort & the Cold War research.pdf](http://web.archive.org/web/20150317100644/http:/typophile.com/files/Soft%20Living%20%E2%80%94%20Comfort%20&%20the%20Cold%20War%20research.pdf) | 654.42 KB |\n| [Soft Living — Comfort & the Cold War presentation.pdf](http://web.archive.org/web/20150317100644/http:/typophile.com/files/Soft%20Living%20%E2%80%94%20Comfort%20&%20the%20Cold%20War%20presentation.pdf) | 1.28 MB |\n| [Presentation Stedelijk Museum Schiedam.pdf](http://web.archive.org/web/20150317100644/http:/typophile.com/files/Presentation%20Stedelijk%20Museum%20Schiedam.pdf) | 1.02 MB |\n\n",
  "author": "Martin Silvertant",
  "time": "21 Oct 2014 — 7:23pm",
  "uid": "52182",
  "comments": [
    {
      "time": "21 Oct 2014 — 7:40pm",
      "content": " ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2001_3471.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2002_4149.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2003_5836.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2004_4759.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2005_6454.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2006_6738.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2007_4669.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2008_6679.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2009_5681.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2010_4007.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2011_6461.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2012_4212.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2013_6141.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2014_5926.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2015_4878.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2016_5940.JPG)\n  \n\n ![](http://web.archive.org/web/20150317100644im_/http:/typophile.com/files/TAP%20exhibition%2017_5702.JPG)\n\n"
    },
    {
      "time": "24 Oct 2014 — 4:50am",
      "content": "I think it's a very cool display font with lots of personality. No doubt it will sell a lot.\n\n"
    }
  ]
}
