{
  "id": "1207",
  "title": "Day 06 - 06 Sept {4 entries}",
  "forum": "Critique",
  "tags": [
    "Critique"
  ],
  "content": "06.001 through 06.004 coming from Australia, Canada and the United States   \n   \n-- Scroll right to see backs --- \\>   \n   \n   \n ![](http://web.archive.org/web/20131018061433im_/http:/www.typophile.com/forums/messages/29/15741.gif)   \n ![](http://web.archive.org/web/20131018061433im_/http:/www.typophile.com/forums/messages/29/15742.gif)   \n   \n ![](http://web.archive.org/web/20131018061433im_/http:/www.typophile.com/forums/messages/29/15743.gif)   \n   \n ![](http://web.archive.org/web/20131018061433im_/http:/www.typophile.com/forums/messages/29/15744.gif)\n\n",
  "author": "Joe Pemberton",
  "time": "9 Sep 2003 — 12:15am",
  "uid": "1160",
  "comments": [
    {
      "time": "9 Sep 2003 — 2:38pm",
      "content": "There's a bigger problem with it: it's in the graphic design realm, not typography.   \n{Ducking the anti-purist rotten fruit...}   \n   \nhhp\n\n"
    },
    {
      "time": "9 Sep 2003 — 2:51pm",
      "content": "on the UPS design, the 'r' is way off, probably   \nbecause it was a flipped 'u' to begin with...   \n   \nI saw a hat for sale yesterday with the new UPS logo.   \n   \nIt was a NASCAR thing.   \n   \nbj\n\n"
    },
    {
      "time": "9 Sep 2003 — 5:16pm",
      "content": "the UPS logotype was Rand's custom design...so it could have to do typography - at least moreso then the pick-a-font, any font -FF Dax decision. Still though, that comment, Hrant! If logotype isin't in the \"typography\" realm what is? Would you save all the perfect kerning, genius font choices, and intuitive applications for your newspaper headlines instead?   \n   \nwon't most of the t-shirts have to do with making a nice looking \"logotype\" stylin' for typophile in any case?   \n   \nno stems on Rands upright u..still the r maybe off.\n\n"
    },
    {
      "time": "9 Sep 2003 — 10:13pm",
      "content": "Tanya, Tanya, Tanya - you're so impure. ;-)   \n   \nEven though it has some letters in it, that shirt is _about_ a logo, and a logo is graphic design, not typography.   \nThe two have overlap, but they're not the same thing; graphic design can happen without type.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Sep 2003 — 6:26am",
      "content": "yes, graphic design can happen without type - but logo(types) can hardly happen without type. last time I checked TDC annnuals, included many, many logos for awards and review...in the typographical vein.   \n   \nIf a logo is pure graphic design, and typography is an element or tool for graphic design you still can\n\n"
    },
    {
      "time": "10 Sep 2003 — 8:00am",
      "content": "\\> logo(types) can hardly happen without type.   \n   \nWhat's a \"logo(type)\"? A logo can be devoid of type just fine.   \nThe shirt is about logos, which makes it _related_ to type, but only tangentially.   \nTake it to Logophile, lady! ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "10 Sep 2003 — 8:21am",
      "content": "\"\"Logo\" is Greek for \"word\", though it is widely used to indicate all corporate trademarks. Marks may be symbols (marks without type), lettermarks (letters form the name), logos (a word), or combination marks (symbol and logo together).\" - Alex White, the elements of graphic design, p.342.   \n   \n   \n   \n   \nDavid Hamuel\n\n"
    },
    {
      "time": "10 Sep 2003 — 11:14am",
      "content": "Joe, what are the rules as far as a revision...   \n   \njust curious, can that designer fix that 'r' for example, before   \nit goes to judging.   \n   \n(no, i didn't design that one!) ![:-)](http://web.archive.org/web/20131018061433im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nbj\n\n"
    },
    {
      "time": "10 Sep 2003 — 11:16am",
      "content": "\\> I think the UPS/RIP one is hilarious.   \n   \nMe too. I also like Monty Python.   \n   \n\\> don't get offended when ....   \n   \nNo, only when somebody thinks a logo is typography. Kind of like a driver thinking he's an engine builder.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Sep 2003 — 4:56pm",
      "content": "It's all well and good for us to sit around and trash the UPS logo, and I agree, as a designer I lament the decision to \"update\" it in the manner they did. That said, none of us were privy to the dicussions, strategy, planning, research, etc. that supported the identity change. It was a process to be sure, and one which I am very sure everyone involved took very, very seriously.   \n   \nIs it good design? My gut response is no. But let's take a minute to ask ourselves what really makes design good. Is it being pretty? Stylish? Well crafted? Relevant? Effective? Clear? Maybe, just maybe, UPS's primary audience is not graphic designers, design historians, and so-called typophiles. Maybe this new logo WORKS for them.   \n   \nThat's it. Just a little injection of perspective. Personally I use FedEx.\n\n"
    },
    {
      "time": "10 Sep 2003 — 6:50pm",
      "content": "a logo is an image to represent a company (but can contain text), a slogan is the text alongside the image.   \nhave you noticed that most school/university/college   \nlogos tend to have text (the older ones have latin) as   \npart of the image.\n\n"
    },
    {
      "time": "10 Sep 2003 — 10:34pm",
      "content": "these are pretty funny:   \n   \ndefinitions:   \n   \nLogotype   \n(n.) A single type, containing two or more letters; as, ae, Ae, /, /, /, etc. ; -- called also ligature   \n   \nLOGOTYPE   \nPronunciation:\n\n"
    },
    {
      "time": "6 Oct 2003 — 6:10pm",
      "content": "'rip' is humorously incorrect.   \n  \nHrant: so typography is only a part of logo design if you draw the type yourself? Some designers tweak every letter in a logo, even if they started with a font. Maybe derivative, but I think it's typography (lowercase t).   \n   \nThe fonts I use are derivative of Roman letters ... they got 'em from the Greeks, before was the erm, phoenicians, etc. ;]\n\n"
    },
    {
      "time": "6 Oct 2003 — 7:50pm",
      "content": "\\> typography is only a part of logo design if you draw the type yourself?   \n   \nTypography is part of the logo design if there's something in it that came from a font. Sometimes the line with lettering is blurred though.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Sep 2003 — 2:33pm",
      "content": "Maybe, but I certainly don't want to advertise a company   \non my chest. Also, I think this whole UPS logo discussion   \nis incredibly blown out of proportions.\n\n"
    },
    {
      "time": "9 Sep 2003 — 2:54pm",
      "content": "_\\> Ducking the anti-purist rotten fruit..._   \nAlthough I usually disagree with your purist viewpoints,   \nthis time you hit it on the head, Hrant. Just don't start   \nabout calligraphy nor lettering please...   \n ![](http://web.archive.org/web/20131018061433im_/http:/www.typophile.com/forums/clipart/lame.gif)\n\n"
    },
    {
      "time": "9 Sep 2003 — 3:24pm",
      "content": "Yves - Hrant's argument _does_ make sense. Wearing this   \nshirt wouldn't be advertising the company but drawing   \nattention to the _old_ logo, which in turn draws attention   \nto graphic design. So if you have a problem with the   \nTypophile shirt focusing on graphic design - so be it. But   \nthis shirt is not promoting UPS.   \n   \n...I think your bad day is getting the better of your usual   \ngood judgment. I hope tomorrow is better, pal. ![:-)](http://web.archive.org/web/20131018061433im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "10 Sep 2003 — 6:44am",
      "content": "_\\>...I think your bad day is getting the better of your usual   \ngood judgment. I hope tomorrow is better, pal._      \n   \nNo Stephen, my bad day got the better of my funky use   \nof ye olde English: I confused a Dutch expression with an   \nEnglish one. When we want to express that someone has   \nmade a correct remark, we say \"you hit the nail on the head\".   \nI did totally agree with Hrant. Sorry for the confusion.   \n   \nPS I still feel like barfing after that [Soprano](http://web.archive.org/web/20131018061433/http:/www.thesopranos.com/)-style   \nBSA bust yesterday. I wouldn't wish it upon my worst   \nenemy. It even [pays](http://web.archive.org/web/20131018061433/http:/global.bsa.org/belgium-dutch/report/report.php) to tip off the competition...\n\n"
    },
    {
      "time": "10 Sep 2003 — 6:46am",
      "content": "Ugh... I'm still not making a lot of sense. I'll shut   \nup for now.\n\n"
    },
    {
      "time": "10 Sep 2003 — 11:06am",
      "content": "Start thinking outside the bouma.   \n   \nI think the UPS/RIP one is hilarious, despite the chopped u   \nawkwardness. The bow plus the word \"remember\" is great   \n(i.e. tying a string on your finger to remember).   \n   \nJust don't get offended when graphic designers use type to   \ntell a story / create a mark / make someone pause or   \nconsider something other than glyphs and word-shapes.   \nIt's what graphic designers do. In fact, we deliberately   \ninvited two graphic designers to sit on the judges panel for   \nthat very reason.\n\n"
    },
    {
      "time": "10 Sep 2003 — 11:29am",
      "content": "We allow revisions. Please just tell us, by number, which   \none(s) to replace. Just don't mistake _revisions_ for   \n_versions_. We don't want submissions with every   \nconceivable color option applied to the same design.\n\n"
    },
    {
      "time": "9 Sep 2003 — 11:04am",
      "content": "The UPS homage is cute.\n\n"
    }
  ]
}
