{
  "id": "12079",
  "title": "I have my very own type blog.",
  "forum": "Forrest L Norvell's blog",
  "tags": [

  ],
  "content": "What started out as a set of nerdy, cryptic notes to myself is gradually evolving into a full-blown blog of its own. I called it \"typography/typology\", which was lame and boring and NOT AT ALL NECRO. Since I'm all about the darkness, you can now find it under its new name, [Typomancy](http://web.archive.org/web/20150420132523/http:/www.typomancy.org/). I also gave it its own domain (it used to be stashed away as a mostly unpublicized subdirectory of my [personal homepage](http://web.archive.org/web/20150420132523/http:/www.pushby.com/forrest/) (despite which Stephen and Dan and Luc Devroye, among others, managed to find it).\n\nWhy have my own blog when there's already [Typographica](http://web.archive.org/web/20150420132523/http:/www.typographi.com/), [Typographer](http://web.archive.org/web/20150420132523/http:/www.typographer.org/), and this fine blog? There isn't an ironclad reason, but part of it is that I'm still going to use [Typomancy](http://web.archive.org/web/20150420132523/http:/www.typomancy.org/) as a place to stash my private notes to myself. Another, better reason is that I'm more interested in the lower-level aspects of type design, specifically dealing with font formats and the politics thereof. Also, it's fun to have a place to do my own experimentation with nameplates and site designs and the like.\n\nThe three of you who bookmarked the old version of the blog will probably want to update your links; the old blog isn't being updated, even though it'll redirect you to the new one. Check it out, and thanks for reading!\n\n",
  "author": "Forrest L Norvell",
  "time": "6 May 2005 — 4:13am",
  "uid": "5605",
  "comments": [
    {
      "time": "6 May 2005 — 4:26am",
      "content": "All right, but you better start cranking out more content.\n\nAs I mentioned to you over e-mail, I am also busy trying to crank out a new blog. Why yet another blog—especially when Jonathan Hoefler believes that blogging is beyond real men? Simlpe. TypeOff wil be in German _and_ English. Pleu, it is the only chance for all 7 members of the typeoff collective to post their naughty thoughts in once place, for all see and comment upon. Lastly, there is no other Typography blog is Offenbach (population ca. 150,000) yet.\n\nNo girly-men allowed, though ;-)\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150420132523/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "6 May 2005 — 11:56am",
      "content": "Yes, there are no other type blogs in San Francisco, either. Errr... well, maybe not.\n\nAs far as content goes, I'll do my best, but you know how it is. Having an actual life, getting work done, and maybe... designing some type are all going to conspire to keep me from Hrant-style levels of production. I don't know how he does it.\n\n"
    }
  ]
}
