{
  "id": "120839",
  "title": "Need to create a font for honorifics.",
  "forum": "Arabic Typography & Type Design",
  "tags": [
    "Arabic Fonts",
    "Arabic Typography & Type Design",
    "ligatures"
  ],
  "content": "Peace be upon all my friends!\n\nI want to create my own font for honorifics, to use in my website.\n\nThe challenge is that I would like to create ligatures to ensure that entire phrases are replaced by glyphs.\n\nCould you guide me on which is the best tool for this purpose? I am new to this, and would love to have a tool that is intuitive. Paid options will also do.\n\nThanks!\n\n",
  "author": "NavidFirst",
  "time": "26 Oct 2014 — 1:36am",
  "uid": "223924",
  "comments": [
    {
      "time": "27 Oct 2014 — 11:16pm",
      "content": "Hi Navid,\n\nWould you please more descriptive or share some samples. Thanks\n\n"
    },
    {
      "time": "28 Oct 2014 — 8:33pm",
      "content": "Hi Atif,\n\nHere's an example string in Arabic: بسم الله الرحمن الرحيم\n\nI want to define my own ligature to replace the entire phrase above with a glyph that looks like this:\n\n ![](http://web.archive.org/web/20150317115813im_/http:/typophile.com/files/Bismillah_Hir_Rahman_Nir_Raheem_3742.svg.png)\n\nFor this, I want to know the best, intuitive tool for help. I already have a font with lots of glyphs, which means I will be using the existing glyphs for new ligatures in most cases. In some cases, I'll create my own glyphs from scratch.\n\nThanks!\n\n"
    },
    {
      "time": "28 Oct 2014 — 10:24pm",
      "content": "How many ligatures do you want to incorporate? You won't probably able to compose stylistic ligatures (as in the given example of BismiLlah) from simple glyphs.\n\nAny way the summary of the approach is to compose your ligatures in some font editing tool (e.g. FontLab). Then edit the font and add some OpenType rules through MS VOLT.\n\n"
    },
    {
      "time": "29 Oct 2014 — 9:47am",
      "content": "I have around twenty ligatures to incorporate.\n\nDo you think FontForge is a suitable tool? It keeps crashing on my Windows 7 machine, so perhaps I could try another operating system.\n\nI checked out FontLab, but it turns out to more on the expensive side for me.\n\n"
    },
    {
      "time": "30 Oct 2014 — 5:27am",
      "content": "Yes Fontlab and VOLT...why not try Linux or Mac for FontForge? By the way what input key strokes are usual for the basmalah ligature?\n\n"
    }
  ]
}
