{
  "id": "120809",
  "title": "Humanist Sans",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Among the Humanist Sans genre, which faces are your favourites?\n\n",
  "author": "Andreas Stötzner",
  "time": "24 Oct 2014 — 2:09am",
  "uid": "17347",
  "comments": [
    {
      "time": "24 Oct 2014 — 10:35am",
      "content": "In no special order:\n\nToday Sans  \nLegacy Sans  \nSyntax  \nMagma  \nGrotext  \nPalatino Sans  \nplus my own few ;-)\n\n"
    },
    {
      "time": "24 Oct 2014 — 11:02am",
      "content": "Bitmap Geneva.  \nUnfortunately I can’t give a favourite, since I haven’t had a chance to tinker with different typefaces in a while, but I had to rely on Myriad, and it served me fairly well.  \nOne I encountered briefly and gave me the impression of having possibly interesting qualities is Core Humanist Sans.\n\n"
    },
    {
      "time": "24 Oct 2014 — 11:05am",
      "content": "Related: [http://typophile.com/node/116746](http://web.archive.org/web/20150415031349/http:/typophile.com/node/116746 \"http://typophile.com/node/116746\")\n\n"
    },
    {
      "time": "24 Oct 2014 — 1:33pm",
      "content": "Karmina Sans  \n [http://www.type-together.com/Karmina%20Sans](http://web.archive.org/web/20150415031349/http:/www.type-together.com/Karmina%20Sans \"http://www.type-together.com/Karmina%20Sans\")\n\n"
    },
    {
      "time": "26 Oct 2014 — 1:02pm",
      "content": "¶ My favourite ones:\n\n· Parisine Plus  \n· FF Meta  \n· FF Scala Sans  \n· John Sans  \n· Jannon Sans\n\n"
    },
    {
      "time": "27 Oct 2014 — 3:40am",
      "content": "My current favourites:  \nAgilita  \nBerling Nova  \nBrandon Grotesque  \nCinio  \nCalluna Sans  \nComenia Sans  \nCorbel  \nPrenton RP\n\nFF Legato I would rather count among the incised/glyphic sorts. Very good typeface though.\n\nFor me the structure of the stroke junctions in n, m, u, d, b &cª is the key criterium. Therefore I do not count Myriad under this genre, because it has a definite Didone nature in this regard.\n\nBut I don’t like Meta, Scala and this kind of 90-ish FF stuff anymore. When I look at M. Majoor’s a’s and y’ it hurts everywhere. Not \\*my\\* idea of humanism –\n\n"
    },
    {
      "time": "27 Oct 2014 — 4:08am",
      "content": "What is Brandon Grotesque doing on that list? I think your Lapidaria is very handsome, btw. My only beef with it, is the white space in your lowercase g. It seems disconnected from the rest of the alphabet. I see this issue in a lot of alternate one-story g’s.\n\n"
    },
    {
      "time": "27 Oct 2014 — 4:27am",
      "content": "> the structure of the stroke junctions in n, m, u, d, b &cª is the key criterium. Therefore I do not count Myriad under this genre\n\nSo, what about Frutiger?\n\n"
    },
    {
      "time": "27 Oct 2014 — 10:27am",
      "content": "“Humanist” is no longer an adequate term for all sans styles that are neither geometric nor grotesque.\n\n"
    },
    {
      "time": "27 Oct 2014 — 10:43am",
      "content": "We could adopt Ray Larabie’s classification:\n\n> Old sans (Franklin Gothic and other sans with ancient flav)  \n> Geo-classical (Futura, Gill, Bernhard Gothic)  \n> Helveticas (Arial, and hundreds of other mid-century neutrals)  \n> Frutigers (Museo Sans, Verdana)  \n> Humanist sans (Easy. If the baseline is straight, it ain't humanist. Most of what I see categorized as humanist are just Franklins.)  \n> Geo-gothic (Avant Garde)  \n> Square Sans (EF Digital, Bank Gothic, Chimes)  \n> Superelliptical (Microgramma, Eurostile)  \n> Brush Sans (Flash, Balloon)  \n> Techincal (DIN, Highway Gothic, stencils, elevator buttons, template lettering, labels & other \"ugly\" lettering)  \n> Pixel (early computing retro, including segmented LED)  \n> MICR (Data 70)  \n> Rounded Sans (V.A.G., Arial Rounded)  \n> Compacta (Impact, Helv Inserat)\n\n(from [http://typophile.com/node/85976](http://web.archive.org/web/20150415031349/http:/typophile.com/node/85976 \"http://typophile.com/node/85976\"))  \nI find the “Frutiger” category especially useful.\n\n"
    },
    {
      "time": "27 Oct 2014 — 10:51am",
      "content": "FWIW here's Jan Middendorp's from _Shaping Text_:  \nEuropean Grotesque  \nEnglish & American Grotesque, Gothic  \nGeometric  \nHumanist  \nSquarish  \nTechnical  \nOffice, hybrid, no-nonsense  \nNew directions\n\n"
    },
    {
      "time": "27 Oct 2014 — 2:10pm",
      "content": "\\> What is Brandon Grotesque doing on that list?  \n\\> what about Frutiger?\n\nBrandon Gr. for the structure of the junctions, which in  \nFrutiger as much as Myriad, are didonish:\n\n ![](http://web.archive.org/web/20150415031349im_/http:/typophile.com/files/undmob_3487.jpg)\n\n\\> your Lapidaria is very handsome  \ncheers.  \n\\> the white space in your lowercase g  \n… well, the descenders are rather long in this face, admittedly. Honestly, I saw this in the g myself, before.  \nNext time I’ll do it differently.\n\n\\> “Humanist” is no longer an adequate term for all sans styles that are neither geometric nor grotesque.  \nThat may be right.  \nI may be wrong but I monitor a sort of inflation of dozens of newly released sans products which all, more or less, look the same. Like the bunches of Meta faces which flooded the nineties …\n\n"
    },
    {
      "time": "28 Oct 2014 — 2:08am",
      "content": "I’ve always considered Frutiger and Myriad humanist types, despite the shoulder. Everything else points in that direction. One could argue Brandon Grotesque is neither Grotesque nor Humanist, but Geometric (although there are intimate ties between geometry and the Humanists – Renaissance art theory do consider the geometric circle an ideal shape).\n\nI was more curious why you picked Brandon for a favourite list in the first place, regardless of classification.\n\n"
    },
    {
      "time": "28 Oct 2014 — 4:07am",
      "content": "I find Brandon very convincing.\n\n"
    },
    {
      "time": "28 Oct 2014 — 5:46am",
      "content": "What about it? I just don’t see it personally, but I’m interested to hear.\n\n"
    },
    {
      "time": "28 Oct 2014 — 7:48am",
      "content": "Brandon Grotesque:  \na combination of  \n– lowercase based on circle and classic Renaissance proportions, high ascenders,  \n– very few special details (a, g) add personality, (the italic f is too heavy in the stronger weights);  \n– uppercase geometric with a sort of ‘Gothic feel’ (the M is too narrow in the lighter weights; O, C etcª are too small in the bolder wts.)  \n– a very airy spacing which lends a mood of easyness, even to the heavier sorts,  \n– the rounded finish makes a cool geometric design looking warm.\n\nI find this is really interesting, despite some details I found to criticize.\n\n"
    },
    {
      "time": "28 Oct 2014 — 11:34am",
      "content": "Thanks!\n\nAnd just like that … a review better than 99% of what was written about type design the past year.\n\n"
    },
    {
      "time": "28 Oct 2014 — 7:13pm",
      "content": "> “Humanist” is no longer an adequate term for all sans styles that are neither geometric nor grotesque.\n\nI agree, and in fact I keep a huge collection of pictures of typefaces categorized in different folders and I have one called \" Sans – Contemporary\". I hate that name though as it's too generic, but then I suppose it really is more of a \"miscellaneous\" folder. Does anyone have a name for this new category which seems to mix many of the classical categories but is often more daring and progressive in the linework than the historical models ever were? This is particularly the case in the serif category; what comes after Garalde, Transitional, Didone, Scotch and Egyptian? Apologies if this undermines this thread. Perhaps this should be posted in a new thread.\n\nMy favorite humanist sans typefaces are Auto, Breve Sans, Calluna Sans, Comenia Sans, Epoca, Epoca Classic, Foro Sans, Gentona, Gloriola, Ideal Sans, Impara, Jannon Sans, John Sans, Karmina Sans, Libertad, Lucca, Metro Nova, Novel Sans. Proza, Publicala, Quire Sans, Ratio, Safran, Sentosa, Sonus, Supra, Tabac Sans and Vegan. Can you have such a long list of favorites? Let's say I just appreciate the design of these typeface to a high degree—and I'm sure I've missed some.\n\nBrandon Grotesque is fantastic, though I never thought of it as humanistic before. Also, I love Signo, but you can't call that a humanist sans, can you?\n\n"
    },
    {
      "time": "23 Jan 2015 — 1:55pm",
      "content": "I really like this thread - it crystallised something I've thought for a while, that several of the geometric and humanist sans-serif fonts have more in common than most people think. Here are my suggestions for dividing up the humanist sans world:\n\n1) The monumental: those that look like they should be on a big sign. Gill Sans, Johnston. I definitely agree that some of these have geometric inclinations, perhaps because of the classical roman capitals influence and perhaps because perfect shapes look best at large sizes. Many Gill Sans and Futura caps are quite similar, actually. And Gill's O is nearly a perfect circle and its M roughly a square.\n\n2) The body text. Those that try to be fluid and more friendly so they work in body copy, and also try to avoid being eccentric like the next two. Myriad and Frutiger go here. Corbel almost does, but some of its little ticks and flourishes work against it. Calibri too.\n\n3) The calligraphic: those that try to look a bit hand drawn and avoid straight lines. Many of these look best when they're quite chunky so you can see the details. Ideal Sans (especially in its bold weights), Goudy Sans, Alegreya.\n\n4) The stripped serif. Those that strongly take after body text serif fonts. Heavy overlap with category 3. Very 90s-they look a bit dated now. Scala comes here. The normal problem these have is that copying a serif font too closely leaves them with an 'a' that looks weird-you end up with an aperture that's too small at the bottom.\n\nI liked H&FJ's [description of how they came to make Ideal Sans](http://web.archive.org/web/20150415031349/http:/www.typography.com/fonts/ideal-sans/overview/), that Gill and Johnston were \"chilly and austere designs shaped by unbending rules, whose occasional moments of whimsy were so out of place as to feel volatile and disquieting\". And I know what you mean about FF and Scala, which saddens me since I love Majoor's writing on font design. It's not something I can put my finger on, but it just seems to be the result of copying serif fonts too literally.\n\nOn this topic, I like Mr Eaves a lot - it captures a lot of the whimsy of the serif but you can make it lose it through switching in alternates if you prefer.\n\n"
    },
    {
      "time": "18 Mar 2015 — 12:31pm",
      "content": "Apologies for late-comng to this party. I find Legacy Sans very readable and fairly economical of space. When I want to print something out for my own use to read in hard copy, a few pages or even a whole manual to study, my default is Legacy.\n\nI checked out Brandon - it is handsome, but would it read well at length?\n\n"
    }
  ]
}
