{
  "id": "120875",
  "title": "What are serifs for?",
  "forum": "Design",
  "tags": [
    "function",
    "Sans",
    "serif",
    "survey",
    "Design"
  ],
  "content": "Hello to all!\n\nAs some of you may know, I've been writing type-related articles at [learn.scannerlicker.net](http://web.archive.org/web/20150414213807/http:/learn.scannerlicker.net/). So I want to ask you guys (that are way more knowledgeable than I am at the subject) the following two questions:\n\n1. What are serifs for; what's their function?\n2. Why did sans-serif fonts became more used than serif ones?\n\nI have my own theories about it and I'll post them here in due time.\n\nThank you in advance for helping me out!\n\nCheers!\n\n",
  "author": "scannerlicker",
  "time": "27 Oct 2014 — 1:35pm",
  "uid": "10256",
  "comments": [
    {
      "time": "27 Oct 2014 — 2:30pm",
      "content": "> Why did sans-serif fonts became more used than serif ones?\n\nDid they?\n\n"
    },
    {
      "time": "27 Oct 2014 — 4:12pm",
      "content": "@riccard0: Yeah, I think they did. I might be wrong, but it's a feeling I have.\n\n"
    },
    {
      "time": "27 Oct 2014 — 6:43pm",
      "content": "Serifs don't serve a function, they are artifacts of the carving/writing process of early lettering:  \n [http://en.wikipedia.org/wiki/Serif](http://web.archive.org/web/20150414213807/http:/en.wikipedia.org/wiki/Serif \"http://en.wikipedia.org/wiki/Serif\")\n\nSans serif typefaces have been around since the first half of the 19th century, but didn't become widely used for setting text (as opposed to headlines or display type) until nearly a century later. The creation of typefaces like Edward Johnston's bespoke typeface for the London Underground signage (1916), Futura by Paul Renner, 1929), and Gill Sans (1928–1932) by Eric Gill are credited with starting the 20th century ascent of the sans serif.\n\nEconomic and social factors (growing industrialism, new social and political orders) played a part as well, as the style was seen as more rational and modern than older roman faces.\n\nI believe Johnston's typeface was the first sans serif to be used for wayfaring/signage, Futura grew out of the popular Bauhaus style/movement and became closely associated with its emphasis on functionalism and simplicity, and Gill Sans was one of the first geometric sans serif typefaces to enjoy wide use and distribution (Monotype promoted the hell out it).\n\nSans serifs certainly seemed to be everywhere post-WWII (Helvetica, anyone?), but I wouldn't sound the death knell of serif faces quite yet.\n\n"
    },
    {
      "time": "27 Oct 2014 — 8:16pm",
      "content": "Though they are artifacts, I would argue that they have a function. If they were not useful, they would have vanished from use much more rapidly and completely. I believe that by marking exactly where strokes end, much like the perpendicular segments that bracket measurements on a diagram, serifs communicate a certainty of intent that compensates for infidelity in printing, reproduction, and vision. For example, \"rn\"/\"m\" confusion doesn't tend to turn up in serif faces the way it does in sans. When there are accidental markings or occlusions, it is easier to tell that they are out of place. I think that even where there is no ambiguity, the marked ends help us recognize shapes more readily.\n\n"
    },
    {
      "time": "27 Oct 2014 — 10:24pm",
      "content": "1. The purpose of serifs is to ﬁnish strokes.  \n2. Sans serifs only became more popular than serifs with the advent of low resolution pixel displays, which were too coarse to display serifs nicely.\n\n"
    },
    {
      "time": "28 Oct 2014 — 4:10am",
      "content": "Here's a little bit more of coal to steam this up:\n\n> (...) The importance of serifs now becomes clear. Serifs help the designer — I strongly suspect — the reader to define - and outer-space more definitely and more easily.\n> \n> Smeijers, Fred, in Counterpunch, 2nd edition, Hyphen Press\n\nAlthough I feel that it has another function in readability, Smeijers discusses that the serif has a role in defining the border of white space between letters.\n\nThoughts?\n\n"
    },
    {
      "time": "28 Oct 2014 — 7:02am",
      "content": "I have to agree with cerulean here:\n\n> Though they are artifacts, I would argue that they have a function.\n\nAnd he makes a very good point, here:\n\n> If they were not useful, they would have vanished from use much more rapidly and completely.\n\nAlthough the reason cerulean and Nick posed, the one that \"The purpose of serifs is to ﬁnish strokes.\", is rather simplistic. True, but simplistic: said this way, it can be interpreted as a stylistic tick, resulting in a circular argument being \"the purpose of a formal characteristic is to be formal\".\n\nCerulean came close to what I think here:\n\n> I believe that by marking exactly where strokes end, much like the perpendicular segments that bracket measurements on a diagram, serifs communicate a certainty of intent that compensates for infidelity in printing, reproduction, and vision. For example, \"rn\"/\"m\" confusion doesn't tend to turn up in serif faces the way it does in sans.\n\nI believe, though, that serifs have two main functions, other than declare the end of a stroke:\n\n1. Serifs play a major role in negative space adjustments, by defining borders between glyphs' white space and by _invading_ it, making small serif adjustments enough to solve some spacing problems;\n2. It increases form variation and, consequentially, diversity from glyph to glyph, improving character recognition, and thus, readability.\n\nDrop your two cents. :)\n\n"
    },
    {
      "time": "28 Oct 2014 — 7:27am",
      "content": "As for sans serifs, I think there was a variety of factors:\n\n1. Sans serifs are easier to kern, since it's possible to solve most of the spacing through metrics (you don't have to tackle serifs in pairs like _nn_, _no_, _on_ and _oo_). In metal type, this also means less ligatures (for negative kerning pairs), which is a strong production and economic factor. So, as kthomps5 mentioned, industrialization had a big role in here;\n2. Sans serifs are more simple and geometric in construction and this rationalization makes the production of type easier to comprehend (at least in a superficial level);\n3. Computers have played a major role in the proliferation of type, especially in sans serifs, due to resolution constraints, as Nick pointed out;\n4. And, in my opinion, the major role in this: schools. For what I could see in students, so far, one can do an entire BA program without having to set a text texture, at least here in Portugal; I've met some cases where students were actually discouraged of trying so, so they would have a more consistent-looking project, and thus achieving a better overall grade.\n\nLearning how to compose text was a mandatory activity to anyone willing to learn the graphic arts, before computers and graphic degrees came into play. And with a new generation of teachers that haven't gone through the experience of arranging text with serif fonts, the know-how deteriorates even more.\n\n"
    },
    {
      "time": "28 Oct 2014 — 9:32am",
      "content": "Although the idea that geometric faces were somehow rational was way overblown, so is the idea that serifs aid readability. From what I remember of the research, people read best what is most familiar to them. I think there is at least an element of serifs providing a sought-after impression of history and craft, copperplate performs a similar function for formal invitations - it just looks like what the reader expects.\n\n"
    },
    {
      "time": "28 Oct 2014 — 11:11am",
      "content": "matesrates: Thanks for your answer!\n\nI have some doubts, though:\n\n> Although the idea that geometric faces were somehow rational was way overblown (...)\n\nBy _rational_, I meant _superficially intelligible_, since they're stripped down to a basic construction.\n\n> (...) so is the idea that serifs aid readability. From what I remember of the research, people read best what is most familiar to them.\n\nThere's several ideas, here, that I'd like to refuse, if you may.\n\nFirst, let's approach familiarity as a factor. It's no mystery that we build knowledge as a continuous stacking of relatable items or, if you prefer, classes. So this is the first flaw I see in these studies: if familiarity plays a role on readability, the study environment should control this factor (by eliminating familiar typefaces or classes of typefaces [even serifs or sans], or by working exclusively with typefaces that are familiar to the text subject), otherwise it will compromise the conclusions.\n\nWith this said, a study about legibility that concludes that legibility is a major factor says very little about the micro legibility factors, so it serves very, very little.\n\nI believe, in a relative level (let's keep it in an overall idea), that serifs are more legible than sans. And I have reasons for this belief:\n\n1. We do know that the more idiosyncratic the glyph is (compared to a cluster of glyphs), the more readable (i.e. _legible_) it is;\n2. Overall, serifs tend to have more formal variation between closely skeleted glyphs than sans.\n\nAnd thus, the average serifs tend to be more legible, or readable, than the average sans serifs, because they improve character recognition.\n\nI think that cases like [Dyslexie](http://web.archive.org/web/20150414213807/http:/www.fastcodesign.com/1664561/dyslexie-a-typeface-designed-to-help-dyslexics-read) or the discussion about [Apple adopting Helvetica Neue as an UI typeface](http://web.archive.org/web/20150414213807/http:/www.creativebloq.com/computer-arts/helvetica-wrong-choice-mac-os-81412755) (and yes, I'm giving sans serifs as examples) back this idea.\n\n"
    },
    {
      "time": "28 Oct 2014 — 12:04pm",
      "content": "Sans serifs are often used in situations where legibility is important, e.g. in way finding and news headlines. So the dynamic is not entirely clear. Those are both short form texts, where the flexibility of the sans, in width, in weight, allow a form of shouty unadorned clarity that the serif does not match. Of course that is still influenced by historical ideals. Serifs are still preferred for long form texts, where reading the text is a different. more arduous and measured, experience. I don't think anyone can say absolutely that one is preferable, you could not do a controlled experiment on it.\n\n"
    },
    {
      "time": "28 Oct 2014 — 12:17pm",
      "content": "matesrates: I completely agree with you.\n\nEven though, I wonder if it's just a historical tick.\n\nWhile designing serif faces, I end up using the serif's length to balance the white space, for example, and I can see how it changes spacing so dramatically.\n\n"
    },
    {
      "time": "28 Oct 2014 — 4:34pm",
      "content": "Kevin called it early - serifs started out to finish off the end of carved letters. So serifs are a stroke to finish off any element in a letterform.\n\n"
    },
    {
      "time": "28 Oct 2014 — 7:39pm",
      "content": "Everybody repeating the \"fact\" that serifs are an artifact of letter carving should read Edward Catich's book _Origin of the Serif_.\n\n"
    },
    {
      "time": "28 Oct 2014 — 8:34pm",
      "content": "Craig, the salient point I hoped people would take from the Wikipedia link I posted was that serifs were a function of the tools used to create the lettering. The article specifically mentions Edward Catich's theory that Roman inscriptions were painted with a brush before they were carved.\n\nWhether it was a stylus cutting cuneiform into clay, brush and ink on stone or vellum, quill or nib pen on parchment, the tools used contributed to the shapes of the characters they left behind. I don't think any of those scribes gave a moment's thought to how the serifs helped to adjust negative space or to make individual glyphs more recognizable.\n\nAs letter forms and their serifs developed and evolved, those hand-drawn artifacts were incorporated into widely taught and read alphabets, and became standardized.\n\nStating that serifs don't serve a function was too reductive on my part. Serifs do help a reader distinguish between characters, and can help balance the negative space of a line of type, but those benefits are byproducts of the process of reproduction (by hand or by press) and evolved over time. While such benefits were not the genesis of the serif, they did contribute to the longevity and popularity of the form.\n\n"
    },
    {
      "time": "29 Oct 2014 — 2:48am",
      "content": "eliason: Can you gives us a summary? The book is going to take a while to get to my hands.\n\nkthomps5:\n\n> I don't think any of those scribes gave a moment's thought to how the serifs helped to adjust negative space or to make individual glyphs more recognizable\n\nWhy not?\n\n"
    },
    {
      "time": "29 Oct 2014 — 7:52am",
      "content": "Why not?\n\nBecause I have a problem ascribing modern type designers' concerns to artisans working centuries ago, artisans whose principal concerns were accurately recording information and making their patrons (e.g., the Roman emperor, the Catholic Church, the King or Queen of the moment) happy. Which is not to say that some weren't innovative, or artistic, but the purposes you and others propose that serifs serve didn't arise until much later, with the advent of moveable type.\n\n"
    },
    {
      "time": "29 Oct 2014 — 8:01am",
      "content": "As kthomps5 said, Catich argued that Roman inscriptions were painted with a brush before they were carved. Most importantly, he demonstrated that (at the scale of most inscriptions) there is no reason to think that carving tools necessitated such ending strokes. Rather, the serifs come from the brush that made the letters before the chisel was brought out.  \nThe chisel-artifact theory was popular before Catich's book, and is still often repeated despite his quite thorough debunking of it.\n\n"
    },
    {
      "time": "29 Oct 2014 — 9:19am",
      "content": "_I don't think any of those scribes gave a moment's thought to how the serifs helped to adjust negative space or to make individual glyphs more recognizable._\n\nJust because they didn’t produce a formalized written theory and discuss it, doesn’t mean they didn’t think about it.\n\nYou can learn how to catch a ball without studying calculus, and the brain is nonetheless involved.\n\nDesign is a form of thought—non-literal, non-numerical.\n\n"
    },
    {
      "time": "29 Oct 2014 — 9:18am",
      "content": "Kthomps5: I don't know if you've interpreted my question as provocative, but it was not: it was pure curiosity.\n\nIn the other hand, I'm not putting myself in the position of a know-it-all: it's quite the opposite: you guys know way much more than I do, and that's why I started this thread and make questions. At the same time, that is why I discuss my thoughts with you, too see if I'm on the right track or not.\n\nSo, please apologize me if I misused language, since I'm not a native English speaker. And thank you for your dedication on scrupulously reply to me.\n\neliason, Kthomps5: I don't want to be over picky with this, but if a brush produces a certain artifact, isn't it possible to use it at will, for some reason? Even subconsciously? I know that we can't get into the minds of a medieval scribe or roman stonemason, but when I see such finesse in their work, I have a hard time believing that it was unintentional.\n\n"
    },
    {
      "time": "29 Oct 2014 — 12:14pm",
      "content": "No one said it was unintentional, unthinking, or subconscious. Quite the contrary.\n\n> Whether it was a stylus cutting cuneiform into clay, brush and ink on stone or vellum, quill or nib pen on parchment, the tools used contributed to the shapes of the characters they left behind.\n\nI have no doubt that early scribes quickly discovered that applying stress at a particular point in a stroke created a visually pleasing form, or that one way of drawing a shape was more economical or \"felt\" better than another. As someone trained as a painter and printmaker, I was always taught and encouraged to explore and exploit the native characteristics of a certain medium or tool. Find that juncture between what a tool can do and making it serve your vision, and you can create art.\n\nBut to ascribe contemporary type design considerations such as \"negative space adjustment\" and \"diversity from glyph to glyph\" as the genesis and function of serifs overreaches, I think.\n\nEarly type designers were part of the Renaissance revival of all things classical, and based their designs on letterforms found on Roman inscriptions. The writing style of medieval manuscripts influenced early italic typefaces. Type styles evolved over the centuries, and certain attributes—such as serifs—became part of the canon.\n\nBut I would argue that the form, in this case, predated the function.\n\n"
    },
    {
      "time": "30 Oct 2014 — 7:12am",
      "content": "kthomps5:\n\n> But to ascribe contemporary type design considerations such as \"negative space adjustment\" and \"diversity from glyph to glyph\" as the genesis and function of serifs overreaches, I think.\n\nWell, we were talking about such notions in their direct sense: notions. And don't believe that they had the same names, but I do believe that it was a concern.\n\nBut I do agree with you when there considerations are not the genesis of the serifs, that's an almost comical inference.\n\n> But I would argue that the form, in this case, predated the function.\n\nBecause form always predates function. Always. Function is an attribute, not a starting point. Before we knew what serifs were for, well, we needed serifs. Or façades. Or hands. Or feet. And their function is pretty much whatever we wish them to be, as long as the form allows.\n\nTo all:  \nAnyway, the dicussion went a bit off-rails, here. I'm not very concerned with the serif's history and genesis, I'm more concerned about what we can do with them, beyond artistic expression.\n\n"
    },
    {
      "time": "22 Nov 2014 — 10:35am",
      "content": "Sorry to write something without reading the entire thread first, but:\n\nSerifs help fuse letters together into boumas. Which does not mean they're always helpful; individual letters are generally less confusable without serifs. So in a paradoxical way, serifs make letters less themselves so they can be more helpful in a group. Sort of like people in a society.\n\nhhp\n\n"
    },
    {
      "time": "23 Nov 2014 — 11:18am",
      "content": "Team work.\n\n ![](http://web.archive.org/web/20150414213807im_/http:/typophile.com/files/Bouma_3611.jpg)\n\n"
    },
    {
      "time": "23 Nov 2014 — 11:23am",
      "content": "Nice one! :-)\n\nhhp\n\n"
    },
    {
      "time": "24 Nov 2014 — 2:01pm",
      "content": "But sans serifs became popular in the mid nineteenth century. I would have said their popularity is the result of the belief that they give instant recognition to the reader--at least of their shape as they are simpler, perhaps not of the idea of the letter itself, as we are more used to reading serif letters--and designers began to believe that less is more, as the guy who wrote Le Petit Prince said. Also having a new fashion of typeface available created diversity. Finally, with the new machines that were available sans serifs were, ironically, probably easier to carve, and they could be mass-printed more easily on cheaper and more crude printers.\n\n"
    }
  ]
}
