{
  "id": "121048",
  "title": "19th-cent sans, not Founders...",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": " ![](http://web.archive.org/web/20150317145100im_/http:/typophile.com/files/Screen%20shot%202014-11-04%20at%206_5789.32.56%20PM.png)\n\nFont:&nbsp;\n\n Founders Grotesk! \n\nSolved By:&nbsp;\n\n [kthomps5](http://web.archive.org/web/20150317145100/http:/typophile.com/user/175823 \"View user profile.\")\n\n",
  "author": "cpkc",
  "time": "4 Nov 2014 — 4:39pm",
  "uid": "815",
  "comments": [
    {
      "time": "4 Nov 2014 — 6:16pm",
      "content": "Hate to break it to you, but it is Founders Grotesk:\n\n ![](http://web.archive.org/web/20150317145100im_/http:/typophile.com/files/founders2_6287.png)\n\n[https://klim.co.nz/retail-fonts/founders-grotesk/](http://web.archive.org/web/20150317145100/https:/klim.co.nz/retail-fonts/founders-grotesk/ \"https://klim.co.nz/retail-fonts/founders-grotesk/\")\n\n"
    },
    {
      "time": "4 Nov 2014 — 7:51pm",
      "content": "Where did that 'r' come from, Kevin? It doesn't appear in any of Klim's examples and the PDF doesn't show any alternates.\n\n"
    },
    {
      "time": "5 Nov 2014 — 3:15am",
      "content": "What kind of tool do you use, Kevin?\n\n"
    },
    {
      "time": "5 Nov 2014 — 5:57am",
      "content": "It's there, you have to go to page 28 (and the following pages) of the PDF, to Founders Grotesk TEXT.\n\nI didn't dig too far into the code of the Academy of American Poets page, so perhaps they used the non-text version of Founders on that one character to get the less ornate |r| seen in the sample. Or maybe they had Klim customize the web font for them to align with their logo design.\n\nFounders Grotesk Text is also where you will see the more open |c| that's visible in the sample.\n\nAnd I just noticed that the sample has an |i| with a round tittle. That I can’t find anywhere in the character set. Also custom?\n\n"
    },
    {
      "time": "5 Nov 2014 — 10:36am",
      "content": "Thanks very much for the detective work. I'd gone to Klim's site but didn't go far enough...it was the /t/ that I didn't see in the samples I set...  \nBut my first guess was Founder's, so I give myself partial credit...\n\n"
    },
    {
      "time": "5 Nov 2014 — 6:18pm",
      "content": "Riccardo, I use a Firefox plugin called Type Sample to identify CSS-styled type on websites.\n\nAnd cpkc, you are quite welcome. Thanks for the mystery to solve. There are enough differences between the text and standard versions of Founders Grotesk to see why you were skeptical, and the logo itself mixes and matches fonts within the family (the |r|, for example; plus, it uses a custom dot over the |i|).\n\n"
    }
  ]
}
