{
  "id": "121181",
  "title": "How to classify the fishtail-dogbone serif of Stempel Schneidler",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "serif fishtail dogbone Stempel-Schneidler"
  ],
  "content": "I am seeking suggestions as to how to classify how to classify the fishtail-dogbone serif of Stempel Schneidler\n\n ![](http://web.archive.org/web/20150317073621im_/http:/typophile.com/files/StempelSchneidlerMed_n_4961.jpg)\n  \nFor Fontlab IBM Class would Clarendon Serifs fit?  \nFor Fontlab Panose would Obtuse Square Cove fit?  \nWhat would be better?  \nThanks.  \nDon\n\n",
  "author": "donshottype",
  "time": "10 Nov 2014 — 1:07am",
  "uid": "205259",
  "comments": [
    {
      "time": "10 Nov 2014 — 1:09am",
      "content": "No way to edit my post. Please ignore the duplicate \"how to classify.\"  \nDon\n\n"
    },
    {
      "time": "10 Nov 2014 — 8:09am",
      "content": "I would prefer to categorize it as a 9 - exaggerated, because it doesn't fit my concept of a Clarendon or Square. It really is an odd man out in the serif world.\n\nOf course, if measurements were made according to the very hard-to-find documentation, it may fall elsewhere.\n\n"
    },
    {
      "time": "10 Nov 2014 — 7:51pm",
      "content": "Thanks George, I can see the logic in what you are saying about 9-exagerated as perhaps being the best of the limited choices under Panose in Fontlab.  \nAny thoughts about the best place to pigeonhole it in the IBM Class choices?  \nBTW, if anyone else cares to venture a view, on either the Panose or IBM choices, perhaps you might share it.  \nDon\n\n"
    },
    {
      "time": "11 Nov 2014 — 11:31am",
      "content": "My best shot at IBM would have to be Class 7, Subclass 15 -- Free-Form Serif, Miscellaneous. My second choice would be to use Class 7, Subclass 1 -- Free-Form Serif, No Classification.\n\nNothing else really fits. You could just omit the IBM classification entirely as others often do. Personally I only use Panose.\n\n"
    },
    {
      "time": "11 Nov 2014 — 7:34pm",
      "content": "Thanks George.  \nDon\n\n"
    }
  ]
}
