{
  "id": "121296",
  "title": "Open Source Font Editors",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi community !\n\nI use to work on Fontlab but I need to try an Open Source font editor software, or at least a free one, for my students.  \nWhich one would you recommend?  \nI must confess that I tried FontForge but find it very slow and confusing (maybe because it runs on a mac…?).  \nSomething more simple, for newbies type designers, would be perfect! I just want them to experimented type design: it doesn't need to be extensive.\n\nThank you in advance for your help!\n\n",
  "author": "Lucie Baratte",
  "time": "13 Nov 2014 — 8:15am",
  "uid": "214122",
  "comments": [
    {
      "time": "13 Nov 2014 — 8:24am",
      "content": "FontForge is the only open source font editor out there that I know of.\n\nFontLab's TypeTool and Glyphs Mini are both inexpensive options, less than $50 USD.\n\n"
    },
    {
      "time": "13 Nov 2014 — 11:21am",
      "content": "You could want to investigate online browser-based tools. I know there are a few,\\* but personally haven’t had time to determine their quality.\n\n\\* There also is fontstruct.com, but, while it could be a fun and instructive tool, I don’t think it would be a real first step into font editors.\n\n"
    },
    {
      "time": "13 Nov 2014 — 12:52pm",
      "content": " **Type light** might be what you are looking for. It is freeware for Windows and Mac (and an older version is also available for Linux), and is generally considered 'easy-to-use' (as far as font editors go). The freeware version has only basic drawing tools though.\n\n[http://cr8software.net/typelight.html](http://web.archive.org/web/20150419210404/http:/cr8software.net/typelight.html) (Windows)  \n [http://cr8software.net/typex.html](http://web.archive.org/web/20150419210404/http:/cr8software.net/typex.html) (Mac & Linux)\n\n"
    },
    {
      "time": "17 Nov 2014 — 8:24am",
      "content": "FontForge is acutally as mighty as FontLab, but certain builds of it are very crashy. I work in it on both Mac and Windows, works good. If you have X11 or XQuartz installed, you can get a premade build here :  \n [http://fuuko.libferris.com/osx/packages/](http://web.archive.org/web/20150419210404/http:/fuuko.libferris.com/osx/packages/).  \nThen just open X11, then open FontForge, should work nice (but not like a native app).\n\nOn Windows you can find a build here:  \n [http://fontforgebuilds.sourceforge.net/](http://web.archive.org/web/20150419210404/http:/fontforgebuilds.sourceforge.net/)\n\n"
    }
  ]
}
