{
  "id": "121291",
  "title": "Adobe Font licensing for PC games",
  "forum": "General Discussions",
  "tags": [
    "Adobe",
    "Games",
    "General Discussions",
    "License"
  ],
  "content": "I've posted in Adobe's community forums but does anyone know if Adobe's standard font license covers use of fonts in PC games? I've tried using their help system to find out directly but it seems its not possible to contact Adobe unless you either buy a product or pay for support and I don't have access to either directly at work.\n\nIn my experience font foundries always require a special license for use of fonts in games. However I've been told that Adobe's standard font license covers use in games and I'd like to confirm this. I very much doubt its true but does anyone know for a fact?\n\nThanks everyone.\n\n",
  "author": "AngelFlonne",
  "time": "13 Nov 2014 — 6:58am",
  "uid": "2519",
  "comments": [
    {
      "time": "13 Nov 2014 — 7:10am",
      "content": "After posting that I found an email address on this page [http://www.adobe.com/products/type/font-licensing/additional-license-rig...](http://web.archive.org/web/20150414233031/http:/www.adobe.com/products/type/font-licensing/additional-license-rights.html \"http://www.adobe.com/products/type/font-licensing/additional-license-rights.html\")\n\nI've written to them so lets see if they reply.\n\n"
    },
    {
      "time": "13 Nov 2014 — 7:12am",
      "content": "I would start here:  \n [http://www.adobe.com/products/type/font-licensing.html](http://web.archive.org/web/20150414233031/http:/www.adobe.com/products/type/font-licensing.html \"http://www.adobe.com/products/type/font-licensing.html\")  \n [http://www.adobe.com/products/type/font-licensing/end-user-licensing-agr...](http://web.archive.org/web/20150414233031/http:/www.adobe.com/products/type/font-licensing/end-user-licensing-agreements.html \"http://www.adobe.com/products/type/font-licensing/end-user-licensing-agreements.html\")\n\nEdit: I'm a slow typer...\n\n"
    },
    {
      "time": "13 Nov 2014 — 11:13am",
      "content": "Thanks for the fast reply. I got a reply from Adobe. The font we want to use is licensed by Monotype and they say we should contact them directly. However they were able to confirm that their standard license does not cover the use of fonts in games as I thought.\n\nWe are trying to get out of using Adobe fonts and want to be able to choose fonts from other foundries but we're being told we have a license from Adobe that covers us. Hence the question.\n\nThanks for taking the time to answer.\n\n"
    },
    {
      "time": "15 Nov 2014 — 6:31am",
      "content": "Just an update for anyone reading this. We got replies from Adobe and Monotype. Their standard license doesn't include use for games as you'd expect. I had to ask though because we were being told it did by another party.\n\nYou have to contact them directly and request a quote for use in games. Why there is no transparent pricing policy is beyond me, fonts in games must be a common request and it all seems a bit opportunist of the big font foundries to me.\n\n"
    },
    {
      "time": "16 Nov 2014 — 1:58pm",
      "content": "\"Why there is no transparent pricing policy is beyond me\"\n\nPrimarily because the font or a derivative is included with the game itself, and most foundries will charge for redistribution based on the projected distribution of the product, so a lower fee for an indy game vs a font for say Halo or Madden.\n\n"
    }
  ]
}
