{
  "id": "121214",
  "title": "Fair pricing for a font?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all,\n\nI'm a font making noob, if you will, and I've designed a font which I sell on my website for only $10 (personal or commercial use). A very large corporation has contacted me with interest in licensing the font from me. I sell primarily to individual users so I'm at a loss for how to structure the pricing.\n\nMy EULA specifies that there must be a separate license purchased for each individual user but that wouldn't work for such a large company. They said they own several fonts from larger foundries and they license it to them for a flat fee based on their usage.\n\nI know it's a personal decision but I don't want to grossly over or undercharge. Is there an average industry standard or at least a ballpark that is fair? Thanks in advance for any insight.\n\n",
  "author": "vr4jen",
  "time": "10 Nov 2014 — 4:49pm",
  "uid": "224244",
  "comments": [
    {
      "time": "10 Nov 2014 — 7:17pm",
      "content": "Corporate enterprise licenses, depending on ultimate use, generally go for somewhere between $9000 and $20,000 per font or more. Questions to ask: Desktop only? Web fonts\" Applications? Commercial embedding? The more answers yes to these questions the higher the license fee.\n\nGood luck noob.\n\n"
    },
    {
      "time": "11 Nov 2014 — 7:54am",
      "content": "Thanks so much for your help. I just requested a list of their intended uses so hopefully I can narrow it down a bit from there. I can't believe the price tag on corporate licenses... wow. Fingers crossed they decide to accept!\n\n"
    },
    {
      "time": "15 Nov 2014 — 7:02am",
      "content": "If they do accept you best hire a lawyer to draft the license agreement.\n\nI would recommend Frank Martinez, [http://www.martinezgroup.com](http://web.archive.org/web/20150122202208/http:/www.martinezgroup.com/ \"http://www.martinezgroup.com\")\n\n"
    }
  ]
}
