{
  "id": "12120",
  "title": "n! family",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "I'm hoping for some serious input on what to do with this face I've been working on. The italic is maybe half finished, the roman is 99% done. Or are they? And is it any good? Be honest, is it rough, irregular, derivative, bland, uninspired, brilliant, not terrible, pretty good, ... I'm to close to the forms to judge them objectively and I would really appreciate some no-holds-barred feedback. So here are the first 5 chapters of \" [Three Men in a Boat](http://web.archive.org/web/20130818210945/http:/www.grodworks.com/temp/Book.pdf)\" it prints nicely on postscript laser printers at 1200x1200 dpi, and OK on everyday office printers. The cover image and layout is temporary, btw.  \nIn addition to the book weight I'm working on a semi-expanded family with a full range of weights. [Sample](http://web.archive.org/web/20130818210945/http:/www.grodworks.com/temp/various.pdf)\n\n",
  "author": "grod",
  "time": "6 May 2005 — 4:18pm",
  "uid": "5267",
  "comments": [
    {
      "time": "8 May 2005 — 7:19pm",
      "content": "I take it you are all dumbstruck with admiration? Seriously, I don't mean to be self-obsessed, but I'm really curious what it means when the efforts of some get lauded/criticized/remarked upon while others, mine included though not exclusively, are passed over.\n\n"
    },
    {
      "time": "9 May 2005 — 8:03pm",
      "content": "I think that part of it is that posts to the Critique section aren't showing up on the front page yet, and people are just coming back to the site.\n\nAs for a critique of the face, it depends on your goals. It is too rough and unfinished for display sizes, but it works better at \"book\" sizes. It seems to be in the vein of 20s and 30s Eastern European faces like Preissing, Antykwa Torunska, among others. If that is the direction you want to go, you're on track. The lc g calls too much attention to itself, and the lc e isn't quite happy either. The axis is basically vertical, so I see no reason for the crossbar to be slanted.\n\n"
    },
    {
      "time": "9 May 2005 — 10:38pm",
      "content": "Thank you. I'm glad you say it works better at book sizes as that is the intended purpose. Your comment has led me to rethink the \"e\", I feel it is echoed in the crossbar on the \"t\" and \"f\", and I personally prefer slanted to straight \"e\"s, this is probably not a good reason to leave it as is, though.\n\n"
    }
  ]
}
