{
  "id": "121294",
  "title": "Masthead redesign for established national magazine (draft for critique)",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design",
    "magazine logo",
    "Magazine masthead",
    "national magazine"
  ],
  "content": "Was up all night creating this so I can't see straight right now. To cut on time I went straight into the computer to start building the letters without having skated out what I was going to do first and now I am second guessing myself. Maybe it's just the lack of sleep that is keeping me from liking this but I can't figure out at this moment what it is that bothers me about it.\n\nNot going to get into the politics of why it has to be done in this rushed manner if it is going to get done at all. I will only disclose that I am trying to covertly insert as much quality as I can into the redesign of the magazine despite begin straightjacketed in what I am permitted to do.\n\nThe letters are still in separate pieces so the serifs joining the ligatures are off as there not done yet. Concerned about the width of the serifs on the \"F\" and \"E\". Not sure on the tail of both \"R's\". Also contemplating making the \"A\" a bit wider.\n\nPlease don't pull any punches in the critique and be very specific.\n\nThanks in advance.\n\n ![](http://web.archive.org/web/20150317202342im_/http:/typophile.com/files/WIP_masthead_sample_6566.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [WIP\\_masthead\\_sample.jpg](http://web.archive.org/web/20150317202342/http:/typophile.com/files/WIP_masthead_sample.jpg) | 153.78 KB |\n\n",
  "author": "not real name",
  "time": "13 Nov 2014 — 7:50am",
  "uid": "224325",
  "comments": [
    {
      "time": "13 Nov 2014 — 9:41am",
      "content": "All over, I think it looks very nice.\n\nA: Have you considered adding a little bit of weight to the crossbar? I would have taken another look at the transition to serif in the left diagonal. Its top serif is a little tame, no?  \nS: The spine appears slightly bumpy in the top/right side curve.  \nR: Where the leg and bowl of the R meets, there is a dark spot. The bowl is not as “determined” as similar curves in S.  \nO: I think I would have tried to make the internal white less pointy in the top and bottom.  \nU: Needs some work on the transition from straight to curve on the right side of the left stem.  \nF: I would reconsider the width. Narrower, IMO.\n\n(I suspect I’m not qualified to give a proper critique, but I would love to see if someone else also notices the things I do.)\n\n"
    },
    {
      "time": "13 Nov 2014 — 9:52am",
      "content": "Well, the one obvious thing is that the apex of the A falls far too short. It should overshoot at least as high as the serifs go. The plunge of the N, on the other hand, is rather extreme, and might better be truncated like the other N's.\n\n"
    },
    {
      "time": "13 Nov 2014 — 12:13pm",
      "content": "I too noticed the |A| looking a bit short compared to the surrounding letters. Also the different treatment of |N|, while understandable, is especially striking because of the proximity of the three.  \nWhat bothers me a little is the “Connoisseur” part. I can’t pinpoint it, but it gives me the impression of being a bit cramped, or too dark, or too close to “Fine Art”, or uneven, or a combination of the above.\n\n"
    },
    {
      "time": "14 Nov 2014 — 10:34am",
      "content": "What a difference a fresh pair of eyes makes: Thanks for all the input. Most of what was listed I found to be spot on and even the suggested tweaks that I don't quite agree with helped me spot areas were further refinement can occur.\n\nIn particular, the comments on the top serif of the \"A\" being a little tame and short made me laugh as I was caught red handed. That was a last second adjustment I made when I realized that the original apex I was planing on creating could of been noticed by a non typophile and I could of very well received a directive of \"Don't use any font with a weird \"A\" for the masthead.\" Of course, this is 100% made from scratch but that is an incomprehensibly alien notion to the powers that be. Covertly inserting quality, is the only strategy that stands a chance.\n\nThanks once more and keep it coming if there is more that can be added.\n\n"
    },
    {
      "time": "14 Nov 2014 — 1:32pm",
      "content": "Thanks for the detailed info.\n\n"
    },
    {
      "time": "10 Dec 2014 — 1:33pm",
      "content": "A Google search for the existing magazine indicates that the mast never covers the artwork or other graphics, and I'm assuming that will be the case going forward as well.\n\nEven so, does the magazine depend on newsstand sales, or is it solely based on subscriptions? What I'm getting at is that from a distance, those ultra-thin strokes tend to disappear, which compromises both aesthetics and readability.\n\nIf the design of the cover ever does change to accommodate full-bleed imagery, those thin strokes will really cause problems — from most any distance.\n\n"
    },
    {
      "time": "17 Dec 2014 — 8:34am",
      "content": " ![](http://web.archive.org/web/20150317202342im_/http:/typophile.com/files/WIP_masthead_sample_99_5156.jpg)\n\nOk, spent the weekend recutting each letter.\n\nThylacine, you are correct that the logo will still be seen on top of white and never over any artwork. The magazine is 9 inches wide so the mast is quite large and newsstand read is therefore not compromised.\n\nIt may interest you to know that in the U.S., even though magazines are sold on newsstands, after a few years in business the paid subscriptions becomes the largest portion of paid circulation. I have worked on magazines from a few different countries so I know that in those other countries newsstands sales tend to outperform paid circulation.\n\nPlease don't pull any punches in the critique and be very specific.\n\nThanks once more.\n\n"
    },
    {
      "time": "17 Dec 2014 — 6:39pm",
      "content": "Just because I did not post this bit before, the aesthetic direction of the masthead is supposed to communicate very high end luxury.\n\n"
    },
    {
      "time": "17 Dec 2014 — 7:56pm",
      "content": "I like the new touches! The tail of the final R is much too heavy and does not quite recapture the grace of the big R.\n\n"
    },
    {
      "time": "18 Dec 2014 — 5:18am",
      "content": "All improvements. I agree on the need to better harmonise the two |R| legs (I for one, prefer the less \"clawy\" joining of the smaller |R|, but its stroke is indeed too heavy).\n\n"
    },
    {
      "time": "18 Dec 2014 — 5:21am",
      "content": ".\n\n"
    },
    {
      "time": "18 Dec 2014 — 5:22am",
      "content": ".\n\n"
    },
    {
      "time": "18 Dec 2014 — 5:22am",
      "content": "Oh, the joys of an unstable internet connection!\n\n"
    },
    {
      "time": "22 Dec 2014 — 9:52pm",
      "content": " ![](http://web.archive.org/web/20150317202342im_/http:/typophile.com/files/WIP_masthead_sample_100_3982.jpg)\n\nThanks for the input. I did indeed decide to reconsider the thickness of the smaller R's tail and also made the transition slightly more graceful. Funny that the cut of the R's tails which I consider to be the most, if not the only, original aspect of the mark is what is drawing such attention and opposing opinions. It is funny that I cannot recollect having seen a junction to tail transition cut exactly like this before even though the cuts at the top of an R's tail is an ideal that has been around for a very long time. Now I am curious if anyone, has in the past, spotted an R who's tail has the same \"clawy\" cut as the one I devised.\n\n"
    },
    {
      "time": "23 Dec 2014 — 10:37am",
      "content": "For the capital R, I would try to expand the right leg slightly towards the baseline. Or rather, make it slightly narrower towards the bowl. I suspect this optical correction is mostly due to the inherent “gravity” of letterforms. I’m not yet entirely satisfied with the transition from straight to curve in your serifs. Have a closer look at the transitions in the diagonals, and also both sides of the stem in R. I would keep the lower right “cut” in N in the smaller size. The same goes for R’s junction&nbsp;– more equal in both sizes. Consider being even more flamboyant in the apex of A. It should relate to R and N.\n\n"
    },
    {
      "time": "24 Jan 2015 — 1:45pm",
      "content": "I suppose the final product is long out the door, but I had a few observations:\n\nThe new masthead is going to be considerably taller than the old one, changing the balance of the entire cover. Assuming that was approved as acceptable before design started.\n\nMaintaining the same stem width between the two lines of text creates an awkward juxtaposition. The top line looks elegant and airy while the bottom one ends up looking almost thuggishly short. It creates a visual incongruity beyond that which is difficult to put a finger on. A certain dissonance.\n\nThe double \"s\" in connoisseur has a visual density that attracts attention to itself. I feel like they should be a bit wider to open them up.\n\nThe unique treatments of the upper line \"n\" and the \"r\"s looks a little weird because they call attention to themselves. Everything else looks classical and so they end up looking like gratuitous flourishes.\n\nDon't like the differing treatment of the \"n\"s. It's discordant.\n\n"
    }
  ]
}
