{
  "id": "121351",
  "title": "Most impressive typefaces",
  "forum": "Design",
  "tags": [
    "advanced",
    "favorite",
    "impressive",
    "typeface",
    "Design"
  ],
  "content": "It's a common question to ask what your favorite typeface is but I usually get stuck because there are so many typefaces that are amazing in different ways, it's difficult to select any and exclude others. I have an extensive collection of pictures of typefaces on my computer so I know what's around generally speaking. However, at least once a year a typeface is released that's so clever and so well done it makes me realize there is a lot more to do in type design besides emulating old classics.\n\nSo now I want to ask you if you could name typefaces that are absolutely impressive to you when it comes to the design from an aesthetic and technical point of view. This time I'm not interested in hearing what typefaces work best for you or which have the most features or best spacing or whatever. This time I'm mostly curious in the quality of the use of lines.\n\nSo in short, which typefaces are you most impressed by when functionality and application are not considered?\n\n",
  "author": "Martin Silvertant",
  "time": "16 Nov 2014 — 3:15pm",
  "uid": "52182",
  "comments": [
    {
      "time": "16 Nov 2014 — 4:03pm",
      "content": "One of the most technically impressive I’ve seen lately: [https://www.behance.net/gallery/19004863/Nihon-Typeface](http://web.archive.org/web/20150414193210/https:/www.behance.net/gallery/19004863/Nihon-Typeface \"https://www.behance.net/gallery/19004863/Nihon-Typeface\")\n\n"
    },
    {
      "time": "16 Nov 2014 — 4:06pm",
      "content": "Oh I saw it last weekend. I was very impressed by that as well.\n\n"
    },
    {
      "time": "17 Nov 2014 — 3:17pm",
      "content": "[Magniﬁcat](http://web.archive.org/web/20150414193210/http:/it.wikipedia.org/wiki/File:Magnificat-font.png)\n\n"
    },
    {
      "time": "17 Nov 2014 — 8:54pm",
      "content": "Legato  \nSatura\n\nMagnificat: didn't know it – very cool!\n\nhhp\n\n"
    },
    {
      "time": "17 Nov 2014 — 11:16pm",
      "content": "It was especially impressive in Letraset, where I ﬁrst encountered it!\n\n"
    },
    {
      "time": "18 Nov 2014 — 1:11pm",
      "content": "Magnificat is very cool indeed. Hrant, why do you find Satura to be impressive?\n\nHere are a few that have impressed me (relatively) recently:  \n [Alegreya](http://web.archive.org/web/20150414193210/http:/www.myfonts.com/fonts/huertatipografica/alegreya-ht-pro/)  \n [Garonne](http://web.archive.org/web/20150414193210/http:/www.pampatype.com/custom-garonne.html)  \n [Katari](http://web.archive.org/web/20150414193210/http:/typefacedesign.net/typefaces/year/2010/katari/)  \n [Lumen](http://web.archive.org/web/20150414193210/http:/www.typographyserved.com/gallery/Lumen/4512489)  \n [Signo](http://web.archive.org/web/20150414193210/http:/typophile.com/wiki/https%3A/%252Fwww.myfonts.com/fonts/r-type/signo/)\n\nI often find typefaces from the type course at the University of Reading and the Royal Acadamy in The Hague to be particularly impressive. Usually aesthetically, but from this year I also found myself to be enthralled by [Lewis](http://web.archive.org/web/20150414193210/http:/typemedia2014.com/lewis) due to its capability to set mathematics so beautifully.\n\n"
    },
    {
      "time": "18 Nov 2014 — 5:35pm",
      "content": "Satura is impressive because it's a system that... systematically :-) breaks new ground.\n\nLumen is special too.\n\nhhp\n\n"
    },
    {
      "time": "19 Nov 2014 — 9:34am",
      "content": "I'm awed by Lumen, and mightily entertained by Nihon :) (Although I'd have loved to see Sinhalese support in Lumen...)\n\n"
    },
    {
      "time": "19 Nov 2014 — 1:55am",
      "content": "Hrant's mention of Satura reminded me of another impressive one: [http://www.octaviopardo.com/sutturah/](http://web.archive.org/web/20150414193210/http:/www.octaviopardo.com/sutturah/ \"http://www.octaviopardo.com/sutturah/\")  \nI'm also impressed by Yanone's latest output: [https://www.fontfont.com/designers/yanone](http://web.archive.org/web/20150414193210/https:/www.fontfont.com/designers/yanone \"https://www.fontfont.com/designers/yanone\")\n\n"
    },
    {
      "time": "19 Nov 2014 — 7:27am",
      "content": "Satyr/Faunus.\n\nAntithesis.\n\nEssay Text.\n\n"
    },
    {
      "time": "21 Nov 2014 — 2:14am",
      "content": "I agree Magnificat is impressive caligraphy.  \nIt is a design by Frederich Peter for Letraset in 1973 and was produced as a dry transfer product.  \nDiscussion of digital font issues [http://www.typophile.com/node/12716](http://web.archive.org/web/20150414193210/http:/www.typophile.com/node/12716 \"http://www.typophile.com/node/12716\")  \nAs far as I know the only digital version is a \"free\" one by Flanker.  \nFlanker has been a Typophile member [http://www.typophile.com/user/12174](http://web.archive.org/web/20150414193210/http:/www.typophile.com/user/12174 \"http://www.typophile.com/user/12174\") for eight years but has not been recently active.  \nDon\n\n"
    },
    {
      "time": "21 Nov 2014 — 2:27am",
      "content": "Luc Devroye's page on Katari and its designer: [http://luc.devroye.org/fonts-55201.html](http://web.archive.org/web/20150414193210/http:/luc.devroye.org/fonts-55201.html \"http://luc.devroye.org/fonts-55201.html\")  \nDon\n\n"
    },
    {
      "time": "21 Nov 2014 — 2:41am",
      "content": "Working link for Signo [http://www.myfonts.com/fonts/r-type/signo/](http://web.archive.org/web/20150414193210/http:/www.myfonts.com/fonts/r-type/signo/ \"http://www.myfonts.com/fonts/r-type/signo/\")  \nDon\n\n"
    },
    {
      "time": "21 Nov 2014 — 2:41am",
      "content": "Satura is indeed interesting. The strokes in the letter-forms morph from an extreme reverse contrast that looks somewhat Arabic into sturdy humanist sans that could substitute for Officina Display on the cover of the Economist magazine.  \nDon\n\n"
    },
    {
      "time": "22 Nov 2014 — 10:24am",
      "content": "Speaking of reverse contrast, here are two nice ones:  \n [Caslon Italian](http://web.archive.org/web/20150414193210/http:/www.moderntypography.com/Typedesign/Classics/CaslonItalian/index.html)  \n [Karloff](http://web.archive.org/web/20150414193210/http:/ilovetypography.com/2012/09/25/beauty-and-ugliness-in-type-font-design/)\n\nI had never seen that extreme reverse of contrast before Karloff.\n\n"
    },
    {
      "time": "26 Nov 2014 — 11:07am",
      "content": "If it still has thin strokes, there's room for more contrast. ;-)\n\nhhp\n\n"
    },
    {
      "time": "22 Nov 2014 — 2:07pm",
      "content": "Could have called it DrJekell&MrHyde :)  \nDon\n\n"
    },
    {
      "time": "26 Nov 2014 — 11:03am",
      "content": "Martin Silvertant wrote: _\"So in short, which typefaces are you most impressed by when functionality and application are not considered?\"_\n\nIt's difficult for me to look at typography that way. Judging a typeface without considering the context of how it might be used seems a bit like judging an automobile without considering how well it runs. In other words, if it has trouble getting me from point A to point B, it's not especially impressive — despite whatever aesthetic beauty it might have.\n\nThere's certainly a place in the world for art existing simply for the sake of art, but I have trouble looking at typography that way. Aesthetics play a big part in good type, but it's a supporting role that aids type's real purpose, which is helping to communicate a message.\n\n"
    },
    {
      "time": "27 Nov 2014 — 7:36pm",
      "content": "> There's certainly a place in the world for art existing simply for the sake of art, but I have trouble looking at typography that way.\n\nI suspect we all think that way, which is why I asked to leave practicality and application out of the consideration. I think you're somewhat evading the question.\n\nWhat I'm looking for are typefaces that inspire me as a type designer. Typefaces that are so well executed I wish I would have designed them. Typefaces that feature a highly sophisticated use of line and structure. Typefaces that set a new standard in quality. Certainly you've seen typefaces like that. I don't think you need to consider application necessarily to just appreciate a typeface from a technical and aesthetic point of view. This is not the usual \"name your favorite typefaces\", as one might ask to a graphic designer, but really \"what typefaces thoroughly impress you as a type designer?\". As a graphic designer we have to consider application, but I'm sure the type designers among us have many inspirations and admiration.\n\n"
    },
    {
      "time": "28 Nov 2014 — 4:51pm",
      "content": "> I suspect we all think that way, which is why I asked to leave practicality and application out of the consideration. I think you're somewhat evading the question.\n\nYou asked us to name impressively designed typefaces while only considering aesthetics and technical proficiency. My short answer is that I have none. My longer answer is that I have none because it would be similar to saying that I was impressed by the design of a car without considering whether or not it even ran.\n\nMaybe your question was less about design and more about judging form in the absence of function. Even then, though, I don't think it's really possible to judge only form and technique in typography without viewing it through the lens of whether or not it actually functions as such. Function is part and parcel to what typography is, and without considering function we're really just judging the degree to which purposeless shapes tickle our fancy.\n\n"
    },
    {
      "time": "29 Nov 2014 — 3:58pm",
      "content": "> My longer answer is that I have none because it would be similar to saying that I was impressed by the design of a car without considering whether or not it even ran.\n\nYes, and I don't accept that as an answer to my question because I'm asking you to disregard the notion whether it ran. Certainly you can say something about just the aesthetic design of a car, without knowing if it is a functional car at all. Does a car stop being a car when it doesn't move? It stops being a functional car, but you can still say something about the perceived beauty.\n\n> Function is part and parcel to what typography is, and without considering function we're really just judging the degree to which purposeless shapes tickle our fancy.\n\nNot at all [regarding the second part of your statement]. We're still viewing the typefaces as type designers. As such we can be impressed by the way a type designer handled the line work and structure, without making a consideration of its application and function. Beauty can be viewed independently.\n\nBesides, what purposeless shapes? I said nothing about typefaces without function. I'm saying this time I don't want to hear which typefaces are being selected most often because the considerations to use a specific typeface could be many which are not necessarily linked to its quality. This time I want to hear which typefaces impress you most in terms of quality and originality. That would for example lead me to name a typeface like Trinité, even though I never actually used it. In fact, I may not necessarily find the typeface to be aesthetically beautiful (though I do), but the typeface sure does impress me due to the subtle details the typeface features. That latter bit is essentially what I'm asking. I'm not asking what you find most beautiful, but what has impressed you the most. I feel like you're saying typefaces can't impress you until you see how it's used. I find that to be a nonsensical statement.\n\nIf I were to turn my question around I would understand your answer, because if I were to ask which typefaces you find most impressive from a functional point of view, then you should also make a consideration of its application and how the functionality relates to that. There is certainly a relation between aesthetics and application as well, but we can simply see typefaces as objects of beauty and disregarding application for a moment.\n\nAre you saying there is nothing to be said about the quality of lines if the typeface isn't functional? Are you implying you couldn't give criticism to a starting type designer's work until he made it into an actual font, or could you tell him his design is bad before it's a working typeface or even before knowing what the target application is? The target application is an extra consideration to rate the quality and functionality of a typeface, but it's certainly not a requirement to say anything about the aesthetics of a typeface at all.\n\nAlso, I'm not asking what typefaces you consider to be most beautiful (although equally, I don't see how you can't say anything about a typeface's beauty) but which typefaces you find technically most impressive when looking at the flow of lines. How does its application relate to what I'm asking in any way? I feel you're stuck in the consideration of what a typeface should be, but that's not what I'm asking.\n\n> You asked us to name impressively designed typefaces while only considering aesthetics and technical proficiency. My short answer is that I have none.\n\nHow could I ask my question in such a way that it becomes a question you have an answer to?\n\n"
    },
    {
      "time": "29 Nov 2014 — 1:50pm",
      "content": "I've seen this resistance before. I think it generally comes from the well-intended but dogmatically applied respect for context.\n\nhhp\n\n"
    },
    {
      "time": "29 Nov 2014 — 3:52pm",
      "content": "I think I understand where it comes from but I don't see it as justifiable. I understand we shouldn't undersell the importance of the functionality of typefaces (and in fact as Cory said in different words functionality is inherent in any typeface), and the fact that many if not most graphic designers seem to base their choice of typeface on what they personally like really frustrates me and even downright angers me at times, but I don't think this has be taken into account when talking among fellow type designers as I don't expect us to think that way. I asked what I asked with the exclusive understanding that we all value the functionality of a typeface as well as its beauty. Hence, I put a few restrictions on my question so you wouldn't all name the same typefaces that have been named on Typophile before.\n\nIf I would've asked about your favorite typefaces, a typeface like Magnificat would never have been mentioned. I'm hoping some of us are impressed by very specific and mostly overlooked examples of type. Mentioning those might make for good discussion or inspiration. I must also say most typefaces that impress me very much I've actually not had the pleasure to use yet. Most of these typefaces are rather specific in style and I simply haven't had a need for them yet.\n\nAlso, I don't know what refusing to answer my question implies in regard to the other type designers who did answer my question.\n\n"
    },
    {
      "time": "29 Nov 2014 — 7:21pm",
      "content": "I'm sorry if my views on this are frustrating, but they are what they are.\n\nLet me respond from another direction. I'm so familiar with Western typography that I find it impossible to divorce its form from its function. I automatically see familiar letters and not simply aesthetically pleasing shapes. If the letter doesn't fit within the sideboards of typical convention for that letter, it influences my opinion, even though it might be a very nice shape and work well with the shapes around it.\n\nOn the other hand, I'm not especially familiar with southern Asian typography. I really don't know what the glyphs are or what they're supposed to look like. Instead, I just see positive and negative shapes, rhythms, balances, proportions and the other various elements of design and composition. In other words, the glyphs don't pass through my filter of biases and expectations that have built up over a lifetime of exposure to Western typography.\n\nWith that in mind, I find the following aesthetically impressive, but I haven't a clue whether or not it's part of a well-designed typeface.\n\n![](http://web.archive.org/web/20150414193210im_/http:/sanpitch.com/junk/bengal1.png)\n\n"
    },
    {
      "time": "29 Nov 2014 — 8:54pm",
      "content": "> I automatically see familiar letters and not simply aesthetically pleasing shapes. If the letter doesn't fit within the sideboards of typical convention for that letter, it influences my opinion, even though it might be a very nice shape and work well with the shapes around it.\n\nI think the same way; I think we all do.\n\n> In other words, the glyphs don't pass through my filter of biases and expectations that have built up over a lifetime of exposure to Western typography.\n\nSame here, which is why I add that I actually have no insight when I do comment on scripts I'm not familiar with. I can admire the beauty without understanding if it's contextually beautiful as well. But beauty isn't an objective principle anyway. Beauty is in the eye of the beholder, so an understanding of the script in question isn't necessarily required. That's not to say it's a matter of opinion though. A lot of people's tastes come from ignorance. Wisdom does affect opinion. I can reason much better whether I like or dislike a typeface based on what I know, while I used to like or dislike typefaces based on feelings and vague notions of beauty. I used to dislike Gill Sans because I didn't understand it.\n\n> I really don't know what the glyphs are or what they're supposed to look like.\n\nIn this regard I definitely understand your point. However, it's too much to say you couldn't say anything about a typeface's beauty without considering functionality and context. You just did. In fact, you just did it to a script you're unfamiliar with, which I didn't even think of doing. So what's the trouble in considering beauty in the Latin script?\n\n> With that in mind, I find the following aesthetically impressive, but I haven't a clue whether or not it's part of a well-designed typeface.\n\nI love the picture you provided and I actually haven't seen a typeface like it. I couldn't judge in what way it's different and whether it's different in a good way at all, but the style is amazing to me and it could certainly inspire. Do you know the name of the typeface?\n\n"
    },
    {
      "time": "30 Nov 2014 — 1:45am",
      "content": "One aesthetic achievement related to typefaces I find impressive is the offering of families or sets of typefaces that aren’t bound to the Univers schema, nor to the Noordzij cube or to the “superfamily” ones, but instead offer a wide variety of very different styles nonetheless designed to harmoniously work together.  \nIt’s not a brand new concept, but it seems to me that recently they became more common and with a wider scope than before (example: [http://www.myfonts.com/fonts/laura-worthington/adorn/](http://web.archive.org/web/20150414193210/http:/www.myfonts.com/fonts/laura-worthington/adorn/ \"http://www.myfonts.com/fonts/laura-worthington/adorn/\")).\n\n"
    },
    {
      "time": "30 Nov 2014 — 5:29am",
      "content": "Hmm is that a difficult achievement? I find it more impressive when the typefaces still have a stronger relationship and certain elements are being exaggerated near the extreme ends of the weight.\n\nI do like seeing these packages of fonts though. That is quite an old concept but I've never seen packages of such high quality as the ones that seem to be popping up lately, where typefaces are designed to be packed, rather than very different typefaces put together merely because they're all scripts for instance.\n\n"
    },
    {
      "time": "30 Nov 2014 — 6:27am",
      "content": "> is that a difficult achievement?\n\nI think it’s not a small feat, involving different skills (not all directly related to “traditional” typeface design), a strong sense of aesthetic, and the ability to convey it. Thus, when it’s done well, I find it impressive.\n\n"
    },
    {
      "time": "30 Nov 2014 — 8:00am",
      "content": "Riccardo, I have to agree with Martin on too much variation.  \n [http://typographica.org/typeface-reviews/instant/#comment-74843](http://web.archive.org/web/20150414193210/http:/typographica.org/typeface-reviews/instant/#comment-74843 \"http://typographica.org/typeface-reviews/instant/#comment-74843\")  \nThat said I think Adorn takes an approach that avoids this issue.\n\nhhp\n\n"
    },
    {
      "time": "30 Nov 2014 — 8:34am",
      "content": "I also want to mention [Karol](http://web.archive.org/web/20150414193210/http:/typophile.com/wiki/https%3A/%252Fwww.myfonts.com/fonts/typeotones/karol/). I find the angles in that typeface to be inspirational.\n\nAlso, this is no finished work but I love [Alpine](http://web.archive.org/web/20150414193210/http:/brianskywalker.deviantart.com/art/Alpine-Font-30-March-2012-293114480) by Brian M Zick. I actually calligraphed his prolific 'g' (not from Alpine) often because it's fun to do and I think it's brilliant how the black and white space has been evenly distributed.\n\n ![](http://web.archive.org/web/20150414193210im_/http:/typophile.com/files/oh_gee_by_brianskywalker-d4trslu_5478.png)\n\n[Aria Text](http://web.archive.org/web/20150414193210/http:/www.r-typography.com/aria_text.html) is also great. I just love the design of the white space; particularly in /a /c.\n\n[Litania](http://web.archive.org/web/20150414193210/http:/www.r-typography.com/litania.html) has a rather unusual flow of lines which I love. I'm not a big fan of the Lombardic style usually, but this is very cool.\n\n[Nara](http://web.archive.org/web/20150414193210/http:/media.tumblr.com/tumblr_lrsg5oRRTF1qb9ht8.jpg) is very cool, though in this case I like the individual letters much more than the typeface as a whole.\n\nI've lately also been enamored with Christian Thalmann's designs; [Octant](http://web.archive.org/web/20150414193210/http:/www.myfonts.com/fonts/catharsis-fonts/octant/), [Brilliance](http://web.archive.org/web/20150414193210/http:/www.myfonts.com/fonts/catharsis-fonts/brilliance/), [Traction](http://web.archive.org/web/20150414193210/http:/typophile.com/node/104308) and [Paramond](http://web.archive.org/web/20150414193210/http:/typedrawers.com/discussion/791/paramond-an-extreme-display-serif#latest).\n\n"
    },
    {
      "time": "30 Nov 2014 — 8:21am",
      "content": "Instant is really awesome! I recently saw a typeface with a similar concept. I believe it went from a serif to a sans as the weight increases. It was probably one of the typefaces from KABK or possibly Reading.\n\n"
    },
    {
      "time": "30 Nov 2014 — 8:48am",
      "content": "> I think Adorn takes an approach that avoids this issue.\n\nThat’s the part I probably find most impressive. Because, to me, it’s the hard part. The variations you lament in your Typographica comment can bring interesting results, impressive ones, even, but are programmatic, iterations of the metafont concept. They may be clever, but are algorithmic, they proceed from the glyph out.  \nCollections like the ones offered lately aren’t based on a single concept, but on a broader approach, they proceed from the idea in.\n\n"
    },
    {
      "time": "30 Nov 2014 — 8:56am",
      "content": "But it's dysfunctional.\n\nhhp\n\n"
    },
    {
      "time": "30 Nov 2014 — 10:09am",
      "content": "How so?  \nI think it’s perfectly functional. But then, I use type, I don’t make it ;-)\n\n"
    },
    {
      "time": "30 Nov 2014 — 10:15am",
      "content": "Actually the package you linked to may not be the most optimal example of this package principle. I recently saw a package of several typefaces which are all linked to a specific century so you can just use the package to make something that looks authentic rather than having to select the typefaces yourself.\n\nAt the other hand, I don't quite know what to think about selections of typefaces being handed to you so you don't have to think about the selection of typefaces anymore. Sometimes I suppose the type designer could be trusted to make better choices than the graphic designer when it comes to selecting typefaces, but it's not actually the type designer's job to do so. Perhaps these packages make graphic designers lazy.\n\n"
    },
    {
      "time": "30 Nov 2014 — 10:26am",
      "content": "Riccardo, I actually meant for users! I tried to explain in that Typographica comment.\n\nhhp\n\n"
    },
    {
      "time": "30 Nov 2014 — 3:18pm",
      "content": "Zick \\_g\\_ looks like jumping rabbit. Unique.  \nDon\n\n"
    }
  ]
}
