{
  "id": "12145",
  "title": "Elements of Typographic Style",
  "forum": "Home",
  "tags": [
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20150327015254/http:/typophile.com/wiki/Indices) : [Books](http://web.archive.org/web/20150327015254/http:/typophile.com/wiki/Books) : Elements of Typographic Style, The**\n\nBy [Robert Bringhurst](http://web.archive.org/web/20150327015254/http:/typophile.com/wiki/Robert%20Bringhurst), published by [Hartley & Marks](http://web.archive.org/web/20150327015254/http:/typophile.com/wiki/Hartley%20%2526%20Marks). There are many references to typography in English, but there is only one <cite>Elements of Typographic Style</cite>. Less a how-to guide, manual, or textbook than a distillation of several hundred years' worth of wisdom on the typographer's craft. No less an authority than [Hermann Zapf](http://web.archive.org/web/20150327015254/http:/typophile.com/wiki/Hermann%20Zapf) has proclaimed it as a natural candidate to become \"the [Typographer's Bible](http://web.archive.org/web/20150327015254/http:/typophile.com/wiki/Typographer%27s%20Bible)\". It encompasses a list of typographic relations analogous to Strunk & White's <cite>Elements of Style</cite>, but goes on to outline the basics of humanist book design, and includes a lengthy and valuable overview of classic and useful typefaces (which is as revealing for what it omits as well as what it includes). It also includes several encyclopedic reference sections of special extended Latin and non-Latin characters as well as perhaps the most useful illustrated glossary of typographic terms available. While there is much this book will not teach you, it is an education in itself, and nearly impossible to overvalue.\n\n**Comments on this Title**\n\nAnyone relatively new to typography and eager to learn needs to have a copy of Bringhurst’s Elements… I often say about that book that I wish I’d never read it, so that I could read it again for the first time. It single-handedly exploded my interest in typography. And once you’re done with that book, simply hit the bibliography at the back as a guide to other books to take a look at.  \nThe thing with Bringhurst is that he does a very good job of outlining what to look for in a font; not just if you “like” it, but what a good font needs to have in its arsenal.  \n--Jason Dewinetz\n\n**Discussion:**  \n [The Elements of Typographic Style](http://web.archive.org/web/20150327015254/http:/typophile.com/node/28541)\n\n",
  "author": "Thomas Phinney",
  "time": "7 May 2005 — 2:19am",
  "uid": "909",
  "comments": [

  ]
}
