{
  "id": "121416",
  "title": "Apple Watch’s San Francisco",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Apple has just released WatchKit along with its custom typeface for free. Somebody will eventually post the same thread so I’m doing it.  \n ![]()http://i.imgur.com/laxcc0q.png\n\nA brief collection of (somewhat hostile) opinions I’ve seen:  \n1. Apple, are you seriously making a mimicry of Roboto, which the typographic community have despised for a million times?  \n2. Apple, are you seriously copying prevalent neo-grotesks like Akkurat or LL Circular? (This rhetorical question is followed usually by an onslaught against Apple’s degraded moral integrity.)  \n3. Apple, your copycat neo-grotesk is done so badly, it’s like Arial when in comparison with Helvetica.  \n4. Apple, are you out of your ideas? Another Helvetica mimicry? I was waiting for a more original design and you’ve disappointed me.  \n5. For no reason, sans-serifs – especially neo-grotesks – are inherently bad. Those who are obsessed with this “Helvetica fad” are out of their minds.\n\nYour thoughts?\n\n",
  "author": "grubstreet",
  "time": "19 Nov 2014 — 12:16am",
  "uid": "205070",
  "comments": [
    {
      "time": "19 Nov 2014 — 2:26am",
      "content": "6. Susan Kare's original San Francisco was better.  \n [http://typedia.com/explore/typeface/san-francisco/](http://web.archive.org/web/20150322115858/http:/typedia.com/explore/typeface/san-francisco/ \"http://typedia.com/explore/typeface/san-francisco/\")\n\n"
    },
    {
      "time": "19 Nov 2014 — 11:45am",
      "content": "I was going to say, \"Apple already has a font named San Francisco,\" but you're right, the original was better. Most of the people working at Apple today probably don't remember Mac OS shipping with it.\n\n"
    },
    {
      "time": "19 Nov 2014 — 10:02pm",
      "content": "I think the new San Francisco typeface is technically nicely nuanced (I downloaded it and took a look) but I do have to agree with those saying it makes the Watch look like an Android device, which is quite lame in terms of branding.\n\nThe silver lining is that this is still the most typographic savvy Apple has mustered in the past decade or two.\n\nhhp\n\n"
    },
    {
      "time": "20 Nov 2014 — 6:26am",
      "content": "\"Your thoughts?\"\n\nI think some people grossly overestimate the importance of system font selection, and few can do better than grossly underestimate the complexity of system font deployment.\n\nFor example:  \n\"6. Susan Kare's original San Francisco was better.\"\n\nOpinions abound, but the original S.F. did not play out so well to all of unicode, as this font must. So who cares? People who will argue over the techno-aesthetic comparison of two fonts that share nothing but the same name and publisher, kind of seem weirdly tripped out to me.\n\nCan't wait for a watch, but I will. That's the One and Only Way to know how good this font is. Pretty good marketing to type designers, no?\n\n"
    },
    {
      "time": "20 Nov 2014 — 6:46am",
      "content": "David, mine was intended as an obviously humorous remark.  \n(but intentionally trying to widen the perspective referring to another device-constrain-driven typeface from the same source, and not to the latest \"à la mode\" sans serif for cool kids)\n\n"
    },
    {
      "time": "20 Nov 2014 — 5:06pm",
      "content": "I definitely don't think it's a Helvetica knockoff, or that it looks like any of the Android fonts.\n\nWhat it reminded me of was DIN, but moderated in the direction of a conventional sans-serif like Univers or Helvetica. Roboto may have some DIN influence too in its upper-case, but not to the same extent; by comparison, Roboto is close to News Gothic.\n\nAkkurat? Not even close.\n\nSo to me, the question is: will the straight sides taken from DIN really improve the appearance of this typeface on dot-matrix displays, which is presumably the intent? Or, given the prevalence of high-resolution displays on mobile devices, was this an unfortunate step at the wrong time?\n\n"
    },
    {
      "time": "21 Nov 2014 — 9:50am",
      "content": "San Francisco fonts are pre-release and full of problems by now. Avoid using them, especially considering them become the system font upon installation on Yosemite.\n\nThe display set uses proportional figures as default, what disrupts alignment on date or size columns (and also some menubar apps). Its huge x-height may work in very small displays with a minimum of text, like Apple Watch, but soon becomes very annoying in other scenarios — like Mac OS menus and dialogs.\n\nAlthough better, the text set shares a number of problems with the display one:  \n– error on dollar symbol;  \n– bad interpolated heavy Œ;  \n– breve accent misplaced in every occurrence;  \n– grave/acute bad positioning, especially with i;  \n– poor tilde and caron design.\n\nThe fonts also support only Latin extended, without Cyrillic, Greek and phonetic sets (Mac OS will invoke another font for these). Note that San Francisco is part of Apple Watch SDK, aimed to developers. So, this is not a beta testing initiative by Apple to improve font quality. It is simply an incomplete, unpolished typeface which may or may not be corrected upon Watch release.\n\n"
    },
    {
      "time": "21 Nov 2014 — 4:38pm",
      "content": "\\> become the system font upon installation on Yosemite\n\nBased on what I've read, San Francisco doesn't become the system font unless a series of deliberate steps are followed. And it can be uninstalled.\n\nIt should be considered pre-release (as you mentioned) until the watch is released.\n\n[https://github.com/wellsriley/YosemiteSanFranciscoFont](http://web.archive.org/web/20150322115858/https:/github.com/wellsriley/YosemiteSanFranciscoFont \"https://github.com/wellsriley/YosemiteSanFranciscoFont\")\n\n"
    },
    {
      "time": "21 Nov 2014 — 2:54pm",
      "content": "I donwloaded the font from the link above. The license description (NameID=13) is\n\n> This San Francisco font is licensed to you by Apple Inc. (“Apple”) in consideration of your agreement to the following terms. If you do not agree with these terms, do not use the San Francisco font.\n> \n> You may use the San Francisco font solely for purposes of design and development of applications for the Apple Watch. The foregoing right includes the right to show the San Francisco font in screen shots, images or mock-ups of an Apple Watch application.\n> \n> This San Francisco font is pre-release and is subject to change and should not be relied upon as a final commercial release of the San Francisco font. You may use this font only for the purposes described in this License and only if you are a Registered Apple Developer who is part of an iOS Developer Program team, or as otherwise expressly permitted by Apple in writing. To the extent that there are any inconsistent terms in any applicable Apple software license agreements, these terms shall govern your use of the San Francisco font.\n\nHow come then that the site above is providing a ruby script to install the font on OS X 10.10 given those terms ?\n\n"
    },
    {
      "time": "21 Nov 2014 — 3:47pm",
      "content": "Because they don’t give a damn about the license. This marks the day the EULA died.\n\n"
    },
    {
      "time": "21 Nov 2014 — 4:50pm",
      "content": "I doubt if Apple cares if folks play with it, they just want to protect themselves if the pre-release version is used for non-intended purposes and causes any problems.\n\n"
    },
    {
      "time": "21 Nov 2014 — 6:44pm",
      "content": "For a big corporation a EULA is simply an aid in suing people.\n\n> It should be considered pre-release (as you mentioned) until the watch is released.\n\nGood point. However Apple's dual track records of not caring much about typographic quality lately and not really believing in open beta-testing mean the release version of these fonts will probably maintain many of these problems.\n\nhhp\n\n"
    },
    {
      "time": "22 Nov 2014 — 6:21am",
      "content": "By the way, all the fonts from the link given in [http://typophile.com/node/121416#comment-594054](http://web.archive.org/web/20150322115858/http:/typophile.com/node/121416#comment-594054 \"http://typophile.com/node/121416#comment-594054\") have an emsize of 984. How can that affect rendering?\n\n"
    },
    {
      "time": "23 Nov 2014 — 12:27am",
      "content": "> not really believing in open beta-testing\n\nThis is not true considering Yosemite’s public beta programs.\n\nI think Apple will take the time to make things right. Apple Watch has been introduced as the first “one-more-thing” after Jobs, and that reflects how serious and ambitious Apple is regarding this product. If the Hellvetica mania on Yosemite is Jony Ive’s personal obsession, then I think this time San Francisco won’t be affected by that.\n\nOne of my friends has replaced his iOS system font with San Francisco. Everything seem to have been working fine for now.\n\n"
    },
    {
      "time": "23 Nov 2014 — 9:29am",
      "content": "984 is a multiple of 328, which apparently will be the resolution of the AppleWatch display.\n\n"
    },
    {
      "time": "23 Nov 2014 — 9:54am",
      "content": "Ah, interesting. I guess deviating from 1000 to facilitate integer point sizes makes sense.\n\nhhp\n\n"
    },
    {
      "time": "24 Nov 2014 — 2:21am",
      "content": "<cite>Based on what I've read, San Francisco doesn't become the system font unless a series of deliberate steps are followed. And it can be uninstalled.</cite>\n\nYou do not need to do any additional step. Simply install SF and it becomes the system default. Uninstall and restart, the system come back to its original condition. It seems that specifications inside the font are read by Yosemite to define that.\n\n"
    },
    {
      "time": "24 Nov 2014 — 8:24am",
      "content": "\"How can that affect rendering?\"\n\nThe resolution of the fonts is around 3 times the resolution of the watch face, so the units per em of this font file would not likely effect rendering on this device. The reason 984 was chosen for this font is likely to be found in the combination of divisibility and file size reduction.\n\nIf this is a 1 x 1.25 inch device with a 384 dpi display, (which BTW, is 4.555 pixels per point), it's likely that a 984 unit font would work faster, and take up less space than a 2048 per em font, without any visual degradation. This would also save untold byte space in a font with an extensive glyph repertoire.\n\nIt is that extensive glyph repertoire, and previous hints of Apple not keeping much in residence on future devices, and knowing just how precious every single bit of space and processing power is in a wearable, that leads me to believe this font is going places. ;)\n\n"
    },
    {
      "time": "24 Nov 2014 — 8:54am",
      "content": "Oh, I was wrong about the integer point size advantage. Might there be an integer advantage somewhere else?\n\nSo I don't see how it makes sense to use 984 instead of 1000 after all. The savings (assuming compression, since otherwise anything from 513 to 1024 is the same) is very minimal, and sticking to 1000 (even with 2048 being an option) still has advantages in terms of robustness. In fact people have been reporting a bug related to deviating from 1000 UPM in OSX; it's ironic that Apple's own flagship typeface suffers from that.\n\n> this font is going places.\n\nIn the heart of every fanboy, there was never any doubt; for some even Chalkboard would've been hailed as a genial choice. Nevermind that using a font that makes Apple look like Android (just like the size jump of the new iPhones) is supposed to be highly offensive, and more significantly, weakens the brand.\n\nhhp\n\n"
    },
    {
      "time": "24 Nov 2014 — 9:44am",
      "content": "Just out of curiosity I installed SF as Yosemite System Font. Gosh it’s so dilapidated for now... Definitely switching back.\n\nBut one thing does strike me: there’s no way this looks like Roboto. Upon installation I feel like my Mac is occupied by DIN.\n\n"
    },
    {
      "time": "24 Nov 2014 — 10:31am",
      "content": "As a designer you have DIN on your mind; the mind of a consumer of portable devices is much more attuned to Roboto. Don't get me wrong, I'm not accusing Apple of direct plagiarism, I just think something consciously less like Roboto would have been smarter in terms of branding.\n\nhhp\n\n"
    },
    {
      "time": "24 Nov 2014 — 11:00am",
      "content": "Why 984, @hrant? Well, it is 328×3, which f.ex. gives the software folk a grid that makes anti-aliasing or sub-pixel rendering easy.\n\n"
    },
    {
      "time": "24 Nov 2014 — 11:28am",
      "content": "Easy as in faster to render? I wonder if the –probably minor– gain is worth it.\n\nhhp\n\n"
    },
    {
      "time": "24 Nov 2014 — 12:35pm",
      "content": "The two’s letterforms may look similar when closely examined separately. But when put into performance and the nuances come into play, the difference is dramatic. You can easily distinguish one from another – I mean, I use SF on my Yosemite Mac and also am using Android on my phone. It strikes me because I’m surprised how two typefaces that may look similar on the larger scale would be so much different when put into actual use. Especially when at smaller point sizes in UI, Apple’s optical fine-tuning helps a lot (minute things like stroke stress, terminals, stroke emphasis and overshoot suppression etc.).\n\nPeople might think that Apple is ripping off Roboto, but I think that impression would be dispersed once they see and use the actual Apple Watch.\n\n"
    },
    {
      "time": "24 Nov 2014 — 1:37pm",
      "content": "I'm the furthest thing on this site from representing the typographic community, but I quite like it. I hate it when type designers and the like argue over typefaces that all look the same as Helvetica, but the differences here are in all the right places in my opinion. It's a very pleasant-looking cross between geometric faces and neo-grotesques.\n\n"
    },
    {
      "time": "24 Nov 2014 — 2:53pm",
      "content": "BTW it's funny how certain people accuse Android of ripping off FF DIN, without even bothering to learn where that comes from.\n\nhhp\n\n"
    },
    {
      "time": "24 Nov 2014 — 2:53pm",
      "content": "This kind of thing is clearly not graspable by all, but I see the idea of internationalizing Latin without much notice. One could also call it an Asianization of Latin. The monolining of Latin for low resolution just about finished bouncing out to the ends of Unicode, for better and worse, and now the monowidth thing of kanji is reflecting onto Latin UI design.\n\nSo, while 'everybody' is reaching just about the same lowest common, international, cross platform, device independent, type design solution, denominator— yawn deceptively;), another whole totally related thing is that this kind of simple typographic identity requires a range of weights and size masters, to accomplish. Telling to anyone who wants to accurately present a typographic identity on a single device, much less for those seeking accurate multidevice multi-font family typographic identities.\n\n"
    },
    {
      "time": "24 Nov 2014 — 3:32pm",
      "content": "Even with a range of weights, it is difﬁcult to design complex, hierarchical layouts, which have traditionally beneﬁted from contrast between sans and serif.\n\nThe classic mid-century modern identity, using one typeface, also relied heavily on asymmetric white space to differentiate layout elements, which is not always available.\n\nFutura has persisted, and its descendants Avenir and Gotham/Proxima, so I don’t see an overwhelming hegemony for Lowest Common Denominator typefaces. And with higher resolutions making screen typography more like traditional print, I would imagine that things will become less “Asianized” in the future.\n\nStill, perhaps the vogue for all-cap headings is another symptom of Asianization, if not Americanization (3rd Grade English, according to Conan).\n\n"
    },
    {
      "time": "24 Nov 2014 — 4:24pm",
      "content": "I have never seen a single typeface whose Chinese characters bore any resemblance of character at all to its Roman letters, because the two bear no/little common ground historically or linguistically. In SimSun for instance, while said characters and letters bear comparable weights and serifs (if the Chinese call them that), because the two systems function differently, a reader wouldn't generally draw the comparison. Therefore I would draw the conclusion that there is no benefit to the reader or appearance of design cohesion whatsoever to designing typefaces with asian and western capabilities. However in forcing Roman letters to conform to Chinese formatting, the letter 'i' becomes barely comparable to 'm'.\n\nOn the other hand, in the past several decades the Chinese language has been compromised far more brutally by Roman standards, and while even bold Chinese text doesn't carry the same significance as bold Roman, italicised Chinese characters would be greatly insulting, which could possibly be a future consequence of 'Asianisation'.\n\n"
    },
    {
      "time": "24 Nov 2014 — 5:08pm",
      "content": "> Asianization of Latin.\n\nRiiight.\n\nHenry: agreed.\n\nhhp\n\n"
    },
    {
      "time": "24 Nov 2014 — 5:10pm",
      "content": "> the same lowest common, international, cross platform, device independent, type design solution, denominator— yawn deceptively;)\n\nApple is definitely doing something on the cross-language typesetting aspect. First they’ve replaced most of the website typefaces with PingHei (CN, by Sinotype) and Apple TP (JP, by Type Project). And now this... I think they’ve definitely thought about multilingual typography.\n\nIncreasingly confining latin letterforms to the grid is one thing to harmonize Latin and CJK scripts, but I think it’s far more than that. There’s already a consciousness about pairing typefaces based on their personalities and formal qualities, and I think it’s also possible to explore their pasts and work from the origin ground up (also a kind of denominator?), i.e. examining calligraphic reminiscence or history of how a particular typeface was achieved.\n\n"
    },
    {
      "time": "24 Nov 2014 — 5:21pm",
      "content": "> I think they’ve definitely thought about multilingual typography.\n\nWhich makes sense, considering emerging markets. What worries me is that properly harmonious multi-script fonts are arguably the hardest thing in type design, and Apple's recent efforts (especially in contrast to the things MS has been commissioning) don't make me think they can pull it off.\n\nhhp\n\n"
    },
    {
      "time": "24 Nov 2014 — 5:30pm",
      "content": "> properly harmonious multi-script fonts are arguably the hardest thing in type design\n\nDefinitely true. One have to have deep knowledge in both fields to pull this stuff off. But no, I don’t think they’re inept in this. They’ve got the right partners – On the CN side, Sinotype has been a long time partner with Apple (starting from Snow Leopard’s Heiti SC/TC) and also an influential foundry in China; on the JP side, Apple has Dainippon Screens (reliable foundry whose Hiragino Sans GB has been unanimously praised) and AXIS, whom I think is a new but promising partner. I don’t know for the Korean side, but in both CN and JP, Apple’s got some of the best people in this industry.\n\nP.S. I know Dainippon Screens and AXIS are great foundries, but I wonder why Apple hasn’t cooperated with Morisawa...\n\n"
    },
    {
      "time": "24 Nov 2014 — 5:43pm",
      "content": "Morisawa is hooked up with Adobe.\n\nI'm not familiar with all the foundries you mention, but expertise in one script is weakly correlated with proper _harmonization_ of multiple scripts; in fact experts in a script can be stubborn when it comes to adapting... Most \"contemporary\" multi-script fonts typically take a textbook Latin design (like the Frutiger genre) and cosmetically adapt a non-Latin script to it, sometimes riding roughshod over the requirements of the script. Frankly MS has done a much better job in this respect, as has Adobe.\n\nhhp\n\n"
    },
    {
      "time": "24 Nov 2014 — 6:01pm",
      "content": "Oh yeah almost forgot that...\n\nThat’s exactly my point. Harmony between CJK and Latin is stuck at exactly where you mentioned – say, pick a Frutiger and attach Gothic to it, or pick a Garalde and then attach Mincho. That’s why I say in the above post that we need to go deeper.\n\n"
    },
    {
      "time": "24 Nov 2014 — 7:17pm",
      "content": "\\> multilingual typography\n\nChina is a huge market. The iPhone 6 pre-orders in China were roughly double those in the U.S.\n\n"
    },
    {
      "time": "24 Nov 2014 — 8:26pm",
      "content": "Nick: \"so I don’t see an overwhelming hegemony for Lowest Common Denominator typefaces. \"\n\nThen I'd classify you as legally blind. Find another job?\n\n\"I'm not familiar with all the foundries you mention...\"\n\nWhat here are you familiar with. There will be millions of these watches in a few months, and they will most likely contain this font, and the brand will grow and the font will spread. Then people will copy it and make huge signs to put in front of your house. It will come and eat up your xp and then your cat. That is how important you are to this font, and to Apple's plan for world domination through price.\n\n\"That’s why I say in the above post that we need to go deeper.\"\n\nI think it's not possible, but do try;) Nick, Hrant and Henry don't have a lot of experience with UI work, small devices or international issues, but good luck.\n\n"
    },
    {
      "time": "24 Nov 2014 — 9:22pm",
      "content": "When have I said that livestock don't buy crap? When have I said that I'm important to Apple? Mainly I'm simply presenting two thought-out opinions based on my own observations and experience since at least the early 80s:  \n1: People without a single multi-cultural bone in their body shouldn't be trusted to deeply address multi-script type design. Compared to maybe a hundred people I know –and yes, including myself– you really have little clue beyond Latin. And Apple has some holes in that respect as well – just look at the Armenian that comes with OSX!  \n2: No matter how many devices this new San Francisco typeface gets shipped on, the logic pointing to its inadvisable proximity to its main competitor's core typeface would remain. It's simply not OK for somebody to look at an Apple Watch and think –even for an instant– that Samsung made it. This situation was entirely avoidable, but I think Apple has become more imitative than many people realize.\n\nAs before, I think your recurring core problem here is that any hint of criticism of Apple (just a few months ago you were fervently defending Helvetica as a great choice for UI...) results in an arrogant lashing out, even to the point of ignoring the obvious. You give zero credit for anything to anybody who disagrees with you on anything, no matter how many years they're wrestled with something you've never thought cost-effective to bother with.\n\nhhp\n\n"
    },
    {
      "time": "24 Nov 2014 — 9:21pm",
      "content": "> I think it's not possible, but do try;)\n\nJust out of curiosity, Mr Berlow, why do you think it’s impossible to go deeper than typeface pairing?\n\n"
    },
    {
      "time": "24 Nov 2014 — 10:56pm",
      "content": "I saw improvements on script and language support from OS 10.8 to 10.10, but there are still problems even with Latin and Cyrillic support. A number of characters for expanded Unicode blocks are absent, while others do use a poor design choice. Enhancement on typographic matters seems to be always slow.\n\n"
    },
    {
      "time": "25 Nov 2014 — 1:13am",
      "content": "I don’t expect the vogue for sans serifs to last forever.  \nI see it as very much associated with the era of low-res screens.  \nHigh-res screens should prompt designers to use more serif types, emulating the capabilities of print. That’s already happening in many apps.\n\nThe Apple watchface layouts have been designed from the outside, matching the simplicity and modernity of the hardware, and using the corporate UI style. But there are typographic means other than the mid-century modern International Style, to present information on such devices.\n\n ![](http://web.archive.org/web/20150322115858im_/http:/typophile.com/files/Shinn_Watches_4684.jpg)\n\n"
    },
    {
      "time": "25 Nov 2014 — 8:05am",
      "content": "Now that’s what I’d call a great and legible design, Nick. Apple could probably charge twice as much for the Watch if they’d take your typographic design … x-height could be 1 pixel large I guess. That would probably allow the loops of the italic e not to smear.\n\n"
    },
    {
      "time": "25 Nov 2014 — 8:43am",
      "content": "My guess is that just getting the watch out the door is a huge project, so initially they're keeping it simple with one font. Software updates later may offer font choices.\n\nThis also makes it easier for developers, most of whom don't have an actual watch for testing purposes.\n\nRegarding serif fonts, they are easier to read for large amounts of text, not sure if it makes much difference for the tiny amount of text on the watch (other than personal preferences).\n\n"
    },
    {
      "time": "25 Nov 2014 — 8:36am",
      "content": "Nick, agreed.\n\nSerif typography is especially relevant since an expensive watch is about high fashion (and yes, not legibility). In fact this clearly applies to Apple as a whole, since they've been hiring high-profile execs from the fashion world lately.\n\nOne technical issue however is that serif type doesn't mesh as well with Apple's anti-hinting philosophy.\n\nhhp\n\n"
    },
    {
      "time": "25 Nov 2014 — 9:01am",
      "content": "@hrant:  \n<cite>BTW it's funny how certain people accuse Android of ripping off FF DIN, without even bothering to learn where that comes from.</cite>\n\nTo me, DIN means Deutsches Institut für Normung; they specified a style of lettering for use in drafting. (The Russians tended to use this style of lettering as well; in the U.S., Keuffel & Esser's Leroy lettering guides were more influential - being a richer country, such luxuries were more affordable, and hand lettering was looked down on in drafting.) That it was FontFont that made a font called DIN based on this lettering style is, to me at least, secondary.\n\nWhile San Francisco isn't similar enough to DIN to be called a copy, it comes closer to DIN than it does to several of the other typefaces of which it has been accused of being a copy.\n\n@Nick Shinn:  \n<cite>But there are typographic means other than the mid-century modern International Style, to present information on such devices.</cite>\n\nLooking at information presented on the high-resolution screen of my smartphone, I can well believe that it is not strictly necessary to use a sans-serif typeface in order to maintain the illusion of infinite-resolution print.\n\nFor branding reasons, though, no doubt designers at both Google and Apple want their devices to fairly shout _Modernity!_, and for that, a sans-serif face is more appropriate.\n\nAs to your illustration, however, the use of narrow italics, a change of font to upper-case/small capitals instead of boldface, a typeface with a small x-height, and oldstyle figures... represents a direction in which they will not go for _good_ reason.\n\nIf they use a serif face, it would be something more like, say, Corona.\n\nAs to whether \"the vogue for sans serifs\" will \"last forever\" - well, literally, the Latin alphabet will not last forever. Sans-serif, though, is a simple option, whereas there are many different styles of serif. Bracketed serifs, the mainstay of serif type, are more likely to disappear from use than sans-serif.\n\nHowever, just as Bell Gothic was useful in letting I, 1, and l be distinguishable, a more reasonable alternative they might consider, if one needs a monoline face to disguise resolution limits, would be an Egyptian like Memphis or Stymie.\n\nAs for the Asianization of Latin script - San Francisco is not a typewriter-like monospace font, and so I don't immediately see how that could be a factor here, at least in a simple and direct manner.\n\n"
    },
    {
      "time": "25 Nov 2014 — 9:03am",
      "content": "A quick check of expensive watches via Google shows that some (but not all) use sans serif fonts.\n\nThe Rolex below (over $10,000 at Amazon.com) uses a considerable amount of sans serif.\n\n ![](http://web.archive.org/web/20150322115858im_/http:/typophile.com/files/rolex_5401.jpg)\n\n"
    },
    {
      "time": "25 Nov 2014 — 9:16am",
      "content": "Quantity likes sans, while quality՝ serif.\n\nhhp\n\n"
    },
    {
      "time": "26 Nov 2014 — 8:05am",
      "content": "\"– you really have little clue beyond Latin. [] – just look at the Armenian that comes with OS X!\"\n\nI know, so why send me to look!? The way I see Armenian, all the \"good\" stuff appears designed for an auto body repair shop, and all the \"bad\" stuff looks like it was designed by the auto body repair shop.\n\n\"Mr Berlow, why do you think it’s impossible to go deeper than typeface pairing?\"\n\nWell, I’ll be killing two birds with one stone, which won’t sit well. There’s this IP running loose, saying every light font in the universe is: “Anorexic!”, (or even more entertainingly, Apple Computer’s way of promoting anorexia). Laughable, I know — I do constantly. That same, loose-running IP says: “The Latin Script” killed the world’s other scripts, including his beloved auto body shop script.\n\nBut if you are concerned about UI font design and specification, as oppposed to the typical fear and anger of the future, do this simple math, you’ll see neither of those are really true and/or unavoidable: The average Latin word is 5 glyphs, the average Latin glyph has 2 strokes (conservatively), for an average of 10 strokes per Latin word. The average Latin stroke in a Latin readability font is 1/10th of the em, and... the average Latin word has as much space horizontally, as it takes, to present that word.\n\nThe average Chinese glyph is two words and has as much space horizontally as all other Chinese glyphs. Two words with a conservative Latin stroke count, is already 20 Chinese glyph strokes (not at all uncommon among Chinese glyphs). If one is lucky ;) 1/2 half of those average average average Chinese glyph strokes are vertical and 1/2 horizontal. But if the Chinese design has the same weight as a readable Latin, the em is full of strokes in both directions, with 0 white space. Nothing is too important to leave out entirely, so something’s got to give, and that is the ideal reading weight of the Latin.\n\nThis is all just rule of thumb, unless one has fonts fully dictionaried with a 1:1 contour to stroke ratio, and python, it’s hard to be more precise, (and I have a lot of NDAs). But anyone with a brain can tell you for sure, even before seeing Chinese on the watch, Some of Apple’s Latin system fonts are lighter than Latin’s ideal weight. And this little talk is only about strokes and space, leaving out the other 6 parts of the universal mantra from nothing (space), to ideas (glyph or string of glyphs), which is also full of compromises by each script.\n\nIt is a very small world we are looking at here. So, no room yet for serifs, hinting, script wars, or complete residence, i.e. “these fonts are going places” was not a fan reaction?, it was a technical specification, duh.;)\n\n"
    },
    {
      "time": "26 Nov 2014 — 10:04am",
      "content": "> all the \"good\" stuff appears designed for an auto body repair shop\n\nThat's just evidence of your blindness. But you can't admit any failing; for example not that an Armenian typeface delivered to a client a few years ago had a couple of entirely defective letters, even though the client was charged an arm and a leg. I know people who do better work for free.\n\nLatinization is a real problem, and I'm not remotely the only one saying it. Only cultural chauvinism (perhaps stemming from not having a single cultural, nevermind multi-cultural, bone in one's body) prevents the admission of that. This is something I was sad to realize many years ago, when reading a talk synopsis, which I will one day dig up. It was basically an ineloquent version of the following by Morison:\n\n\"The Roman alphabet is not merely in possession, but it is in possession by right of conquest. The conquest was not made possible, or even expedited, by external authority; the victory of the Roman letter was due to its inherent flexibility and rationalism.\"\n\nWill Latin one day start shifting to look more like Chinese? That's entirely plausible, considering the world's probable economic future. But there is no evidence at all that it has already started down that path. And anyway, for the short term, instead of using voodoo math as blinders to actual design, come to Granshan in July to open your eyes to the broader world of type.\n\nhhp\n\n"
    },
    {
      "time": "26 Nov 2014 — 11:12am",
      "content": "This face had me wondering if someone has been cross-breeding DIN 1451 and Univers.\n\nAnd, @hrant... An integer ratio between font resolution and screen resolution means the renderer can (no idea if it does) use a small look-up table to determine the opacity when composing a (presumably anti-aliased) bitmap. No idea what the speed-up would be for that operation, though. Double? Triple? Quadruple? More?\n\n"
    }
  ]
}
