{
  "id": "12149",
  "title": "wiki navigation: help keep our wiki clean!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "i remember about a year or so ago i was dreaming that typophile would have its own wiki, and now it does! hoorah! i’ve had some fun updating some entries thus far, but i’ve noticed that the wiki can be hard to get around in if the authors of articles forget to leave out a navigation line at the head of the article. I propose that we copy the navigation line that can be found at the begining of the page for designers so that the top of the page reads something like this for each article:  \n **[Indices](http://web.archive.org/web/20071105035156/http:/typophile.com/wiki/Indices) : [Designers](http://web.archive.org/web/20071105035156/http:/typophile.com/wiki/Designers) : Gerald Giampa**  \nthis makes it easier to navigate so that you don’t have to back your browser out of an article to get back to the indicies and you don’t have to go up top to the typowiki link and then click on the indices link, anyway... it just makes things easier. Help keep our wiki clean!\n\n [‹ What design considerations are primary in the design of the 'bar' glyph?](http://web.archive.org/web/20071105035156/http:/typophile.com/node/30146 \"Go to previous forum topic\") [Raph talks (to the penguin) ›](http://web.archive.org/web/20071105035156/http:/typophile.com/node/30175 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071105035156/http://typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": "<br>",
  "uid": "7006",
  "comments": [
    {
      "time": " 7.May.2005 2.56am",
      "content": "I also noticed that when a wiki link (with the small superscript ’w’) gets split unto two lines the superscript ’w’ stays on the top line and the word will have a small space to the right of it where the superscript ’w’ should have been. I’m using IE6 on PC.\n\nHere’s an example (not sure if it will work on all browsers):  \n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - [Gerald Giampa](http://web.archive.org/web/20071105035156/http:/typophile.com/wiki/Gerald%252BGiampa)’s yacht.\n\n"
    },
    {
      "time": " 7.May.2005 3.02am",
      "content": "Hmm, Lauri, it works just fine in Safari 1.3.9 on Mac OS X 10.3.9, so maybe that’s an IE quirk (gosh, is that even possible?).\n\nPaul, that’s a great idea, and if I have time, I’ll go back and clean up the entries I’ve made so far to conform to your standard. It’s kind of a mystery to me what the categories we’re entering with our entries are used for.\n\nAlso, I sure hope we’re going to have revision histories available for wiki entries at some point. They’re extremely useful on the [Wikipedia](http://web.archive.org/web/20071105035156/http:/www.wikipedia.org/).\n\n"
    },
    {
      "time": " 7.May.2005 3.15am",
      "content": "Forrest,\n\nYeah, it wouldn’t surprise me at all if it’s an IE bug... there’s plenty of those. It’d be nice if IE conformed to all the standards. But until it does you often have to code for it since so many people use the browser.\n\n"
    },
    {
      "time": " 7.May.2005 9.39am",
      "content": "Thats a really good idea for improving the navigation in the typowiki. I added that to a few just now.\n\n"
    },
    {
      "time": " 7.May.2005 10.10am",
      "content": "thnx everybody! small things like this make AR types like me happy. ;^)\n\none thing... don’t forget to wrap your navigation lines in the html strong tag.\n\n"
    },
    {
      "time": " 7.May.2005 10.15am",
      "content": "There is a revision history; we’ve just not figured out how to make it available to all users. This is on our list of to-do’s so you can rollback any given wiki entry to see what revisions have happened to it, and who made them.\n\nAs for the breadcrumb (Wiki \\> Designers \\> Gerald Giampa) it’s my understanding that this is not standard navigation for a wiki, which tends to be a little more free-form. Adding a series of Indices is our little twist to allow the wiki to take the place of the (former) Open Directory Project. No use keeping both around with all that the Wiki is capable of.\n\n"
    },
    {
      "time": " 7.May.2005 10.19am",
      "content": "_As for the breadcrumb (Wiki \\> Designers \\> Gerald Giampa) it’s my understanding that this is not standard navigation for a wiki_\n\nso is there a better way to make it more navigable? I was just getting tired of having to back out of every post...\n\n"
    },
    {
      "time": " 7.May.2005 10.31am",
      "content": "I didn’t know there was a standard but Paul’s suggestion seems to work good. Always having to go back to typowiki and then click the Indicies just gets a bit tedius after a while.\n\n"
    },
    {
      "time": " 7.May.2005 12.00pm",
      "content": "Wikis that use _some_ structure and _some_ hierarchy are much easier for people not familiar with the Wiki concept to use. The basis indices and the use of a standard breadcrumbing format really make the Wiki that much more valuable a tool.\n\nIt would be nice to be able auto-generate the breadcrumbing somehow.\n\n"
    },
    {
      "time": " 7.May.2005 5.36pm",
      "content": "hmmmm.... i just realized why breadcrumbs isn’t wiki standard... it makes restructuring hard when you have to go change the strand after shuffling some pages...\n\n"
    },
    {
      "time": " 7.May.2005 11.45pm",
      "content": "paul: breadcrumbs, while maybe not traditional wiki standard, are certainly used in the [Wikipedia](http://web.archive.org/web/20071105035156/http:/typophile.com/wiki/Wikipedia). There, you just put [[Categories: Typefaces]] at the end of an article, and it automatically shows up on the Category page.\n\nOf course, that would mean more programming for our kindly hosts, but now that the new site is done, they have plenty of time on their hands, right? :)\n\n"
    },
    {
      "time": " 8.May.2005 12.19am",
      "content": "True Grant. Automating the breadcrumb would be a nice-to-have. I love the fact that you don’t have to know any URLs to make the breadcrumb... you just type brackets around the categorie(s).\n\n"
    },
    {
      "time": " 8.May.2005 1.03am",
      "content": "Yeah definitely, the ease of linking to the entries is great. For a student like myself with less knowledge on the topic of type design than most of the people here, I tend to lurk a lot on many of the critique threads. I think such a resource like typowiki will make it much easier to understand when an unfamiliar term comes along :)\n\nThe automation would be a good feature to add, if not it is not much effort to do it manually, but yeah I see where that could perhaps not be so good if the structure changed as mentioned.\n\n"
    },
    {
      "time": " 9.May.2005 5.41am",
      "content": "Sorry if I’ve missed something here, but isn’t the Wiki missing an way of differentiating links to existing and “empty” nodes?\n\nI’ve been squinting at the screen assuming if I look hard enough the text or “w” icon will be a different colour.\n\n"
    },
    {
      "time": " 9.May.2005 12.09pm",
      "content": "Elliott, this is on our wish list too: The ability to discern between active wiki entries and “stubs.” However, right now we’re considering how to go about delivering on this without excessive server/database pings every time there is a wiki reference. (Essentially you’d have to ping the DB for every wiki entry on page load, and clearly that could slow things down.)\n\nWhat does everyone think of the link color change and superscript W to distinguish wiki links from others? Is it enough, not enough, overkill?\n\n"
    },
    {
      "time": " 9.May.2005 12.39pm",
      "content": "i like the color/superscript w, but the superscript w can look funny in particular combinations, especially when placed before ’s.\n\n"
    },
    {
      "time": " 9.May.2005 1.47pm",
      "content": "Jared: I personally dislike the super-W, because it’s visually so similar to TM. I’m all in favor of using color to indicate wikified nodes.\n\nI have this feeling that the DB queries wouldn’t actually be all that slow, because their high frequency and relative small size of the DB should ensure they’re cached and would always get served out of RAM. However, I know almost nothing about your particular setup.\n\nAs I’ve said before, I expect the typowiki to seriously rock. The community we have here has ideal characteristics for maintaining a wiki: expertise, mutual respect, and passion. Thanks again for putting it online!\n\n"
    },
    {
      "time": " 9.May.2005 5.51pm",
      "content": "What if the superscript ’w’ prefixed the term instead? That would eliminate the confusion with apostrophe’d terms and trademark attributions, but would still clearly indicate that the link is wiki-derived.\n\n"
    },
    {
      "time": " 11.May.2005 5.32am",
      "content": " **Diacritics  should we use it or not...**  \nI found a problem. In the Designers list, there was name of Vojtěch Preissig written with correct diacritics. But Vojtěch Preissig is mentioned in other wiki entries as `[[Vojtech Preissig]]` and this is therefore not connected with `[[Vojtěch Preissig]]` entry.\n\nI suggest NOT TO USE DIACRITICS in names of wiki entries - this solution will also help people without particular keyboard layouts to entry the wiki links. But we should USE DIACRITICS in the description fields to publish correct spelling.\n\nAnother soultion is to map Vojtěch Preissig to `[[Vojtech Preissig]]` using `[[Vojtěch Preissig|Vojtech Preissig]]`, but this somehow doesn’t work for me.\n\n"
    },
    {
      "time": " 11.May.2005 8.48am",
      "content": "Actually, filip, you’ve got that backwards. You want to use the format [[actual\\_wiki\\_link | readable diacritic link]]\n\n"
    },
    {
      "time": " 11.May.2005 9.19am",
      "content": "Jared, thanks. But it doesn’t work. If you use it on ’Designers’ entry, some strange ’class=’ words will appear and the link will disappear!\n\n"
    },
    {
      "time": " 11.May.2005 9.27am",
      "content": "I definitely agree we should pick one or the other as a standard, and given the problems people have with character sets and encodings, I would go with the non-diacritics version.\n\nIn any case, it would be really helpful to have redirect pages. I ran into a similar problem with [Hans (Giovanni) Mardersteig](http://web.archive.org/web/20071105035156/http:/typophile.com/wiki/Hans%252B%252528Giovanni%252529%252BMardersteig), having created the Giovanni entry before realizing that the former version was in the [Designers](http://web.archive.org/web/20071105035156/http:/typophile.com/wiki/Designers) index.\n\n"
    },
    {
      "time": " 11.May.2005 10.06am",
      "content": "filip, i got it to work in my entry for [The Terminal](http://web.archive.org/web/20071105035156/http:/typophile.com/wiki/The%252BTerminal). What I had to do was make all other links in the same paragraph follow the “actual\\_wiki\\_link|readable link” format, using the same term for the acutal and the readable links.  \nof course this is just a hack... hopefully the bug gets squashed soon.\n\n"
    },
    {
      "time": " 3.Nov.2005 6.47am",
      "content": "well it’s been what, 6 months? and it seems more and more people are getting comfortable with using the [typowiki](http://web.archive.org/web/20071105035156/http:/typophile.com/wiki/typowiki), and i love it. but it can always be improved upon. I just wanted to bump this thread so that it gets renewed attention. Just to simply restate my original sentiment, let’s try to make the wiki as navigable as possible by leaving bread crumbs (see above). At the very least, i think linking back to the Indices page at the top of each article is a good idea, with complete strings of breadcrumbs being preferable. As moderator with responsiblity for the wiki, i try to make sure that these are there, but i can’t go back and check all of the almost 1000 articles now. So, if you come across a page that you see needs to be enhanced, either change things yourself (c’mon, get yer feet dirty!) or bring issues to my attention. thanks for your attention and all your contributions to the wiki. i think it’s beginning to become a good resource for research and answering questions, but we’re not even close to scratching the surface of its potential. let’s keep up the good work and i’m sure it’ll get there in time.\n\n"
    },
    {
      "time": " 22.Dec.2006 1.47pm",
      "content": "this is a new idea:  \nsince tracking changes to the wiki can be kind of a chore with comparing changes by looking at each version of an articl separately, i propose wiki authors add notes to describe changes made to articles. This would happen by authors manualy adding comments to the end of the article that would look something like this:\n\n`<!-- 12/22/06 added external link to site xyz.com ~pdh -->`\n\nso basically we have the date (in US date format: mm/dd/yy), the comment, and initials of the person making changes. this should make changes to the wiki easier to track (for those of us that are curious)\n\nwhat do others think of this idea?\n\n"
    },
    {
      "time": " 25.Dec.2006 9.52am",
      "content": "bump\n\n"
    },
    {
      "time": " 25.Dec.2006 1.00pm",
      "content": "I like the idea Paul. You may need to re-bump the thread after the holidays though to get a bigger response.\n\nChrisL\n\n"
    }
  ]
}
