{
  "id": "121458",
  "title": "Please help - looking for a good typeface/font match",
  "forum": "Typography / Composition",
  "tags": [
    "body text",
    "classic",
    "clean",
    "combinations",
    "glamour",
    "luxury",
    "Modern",
    "sophisticated",
    "Typography / Composition"
  ],
  "content": "I'm new to Typophile, so please forgive me (and re-direct me if you know otherwise) if this has been posted in the wrong forum topic!\n\nI've recently created a logo design for a bespoke fashion brand using the typeface Lulo Clean One Bold (see: [https://www.myfonts.com/fonts/yellow-design/lulo-clean/](http://web.archive.org/web/20150320223041/https:/www.myfonts.com/fonts/yellow-design/lulo-clean/ \"https://www.myfonts.com/fonts/yellow-design/lulo-clean/\")) and I'm trying to put together the rest of the brand identity.\n\nHowever, I'm struggling to find a font that compliments Lulo Clean for body copy. The purpose I have in mind is for short body copy - i.e. descriptions of clothing online, perhaps sub headings / tag lines in italics? Ordinarily I'd try to match up fonts by using the x-height as an indicator of if the two fonts work together - but as Lulo Clean is an all caps font I don't think I can apply this rule (please correct me if I am wrong).\n\nHere are some of the key words for the project, to give a feel of the tone/mood required: modern-classic blend, sophisticated, luxurious, glamorous, high quality. I'm thinking of using Lulo Clean One for the sub headings / menu text, and thought that Source Sans Pro Regular or Open Sans Regular might work for the body copy (I'm trying to find a complimenting serif but none seem to convey the key words as well as these so far...).\n\nI'd really appreciate any help/advice that the community here can offer.\n\nThank you!\n\n",
  "author": "shillstypes",
  "time": "20 Nov 2014 — 4:40am",
  "uid": "224473",
  "comments": [
    {
      "time": "20 Nov 2014 — 5:13am",
      "content": "For short texts, a safe choice would be to use another geometric/circular |O| typeface (one with a lowercase, of course).  \nAs serif (or stressed sans), you could try a text cut didone.\n\n"
    },
    {
      "time": "20 Nov 2014 — 5:42am",
      "content": "I’d go for Gotham or Avenir.\n\n"
    },
    {
      "time": "20 Nov 2014 — 6:50am",
      "content": "Maybe even Gill Sans would work.\n\n"
    },
    {
      "time": "21 Nov 2014 — 2:49pm",
      "content": "Thanks for your thoughts.\n\nI tried out Avenir and Gill Sans (unfortunately Gotham is still on my wish list), explored didone and geometric styles, but nothing seemed quite right, so I think I will need to go with a different font for the menu text/headlines which is similar enough to fit with the logo's use of Lulo Clean.\n\nAfter playing around for a while, I decided Proxima Nova was my best option. I've done a very crude layout just to provide a rough idea of how the text could be used and would love to hear your opinions on which combination works best.\n\nProxima Nova & Open Sans  \nProxima Nova & Adobe Garamond Pro  \nProxima Nova & Calluna  \nProxima Nova & Merriweather\n\nEdit: Removed links as I have decided to go with varying Proxima Nova weights/styles.\n\n"
    },
    {
      "time": "21 Nov 2014 — 2:52pm",
      "content": "I also liked Proxima Nova & Lora.\n\nEdit: Removed link as I decided to go ahead with varying Proxima Nova weights/styles.\n\n"
    },
    {
      "time": "20 Nov 2014 — 12:26pm",
      "content": "The text appears awfully small to me. Also your Garamond and Calluna samples are the same.\n\n"
    },
    {
      "time": "21 Nov 2014 — 2:45pm",
      "content": "Thanks for letting me know, I was in a little bit of a rush yesterday so I must have muddled the links up.\n\nI've decided to play it safe and use Proxima Nova throughout in different weights and styles.\n\n"
    }
  ]
}
