{
  "id": "121644",
  "title": "FontLab pasting from illustrator issue",
  "forum": "Build",
  "tags": [
    "Background",
    "fontlab",
    "Illustrator",
    "pasting",
    "Build"
  ],
  "content": "Hi everyone,\n\nI'm hoping for some help with FontLab. I'm pretty new to the program and am having some difficulties when pasting in from illustrator. Based on a friend's good knowledge, I think the glyphs are pasting as a background layer, as they are not editable and show as a filled object rather than outlines like they normally would. Hopefully this makes sense. Does anyone know how to turn off [?] pasting as a background layer?\n\nThanks in advance!!\n\nRo\n\n",
  "author": "roro",
  "time": "28 Nov 2014 — 6:03am",
  "uid": "224634",
  "comments": [
    {
      "time": "28 Nov 2014 — 6:37am",
      "content": "One simple way: In Illustrator use your select tool to go around a glyph. You should see the nodes highlighted. Do copy. Open a new blank file. Paste the information. You should see just the gyph. If you see more, delete the extra stuff -- this may be simple or complex depending on your source. Transform by expanding scale, e.g. 500%. Copy. Paste into FontLab. Adjust scale. Close open contours etc.  \nDon\n\n"
    },
    {
      "time": "28 Nov 2014 — 6:57am",
      "content": "Thanks for the help. I don't think that's the issue though, unless I'm not understanding you fully. I am definitely just pasting the glyph in to FontLab, no 'extra stuff' and the glyphs are already at the correct size for the FontLab file, any bigger and it just pastes in as the correct size but still as what I'm guessing is a background layer.\n\n"
    },
    {
      "time": "28 Nov 2014 — 2:18pm",
      "content": "Make sure that in the FontLab editing layer palette all of the layers are checked - then you should be able to just copy and paste into a glyph window. If it does not work - what version of Illustrator and FontLab are you using?\n\n"
    },
    {
      "time": "1 Dec 2014 — 3:21am",
      "content": "Thanks bojev. Doesn't work as far as I can tell but, maybe I'm not actioning your instructions correctly! There's a strong possibility. I'm using FontLab Studio 5 and Illustrator CS6.\n\n"
    },
    {
      "time": "1 Dec 2014 — 1:26pm",
      "content": "Keep in mind that a point in Illustrator is equal to 1 FontLab unit, so a 700 unit cap H will need to be 700 points tall in Illustrator. Make sure your AI clip board preferences are set like this:\n\n ![](http://web.archive.org/web/20150317232846im_/http:/typophile.com/files/AI-prefs_5331.png)\n\n"
    },
    {
      "time": "4 Dec 2014 — 7:25am",
      "content": "Thanks for your help. These are my current settings, yes.\n\nHere's a picture of what I'm experiencing, maybe it'll be much easier that way!\n\n ![](http://web.archive.org/web/20150317232846im_/http:/typophile.com/files/fontlab_4284.jpg)\n\nSometimes the glyph is shown as an outline and whatever I paste in appears like this, in purple. I'm not able to edit the glyph at all.\n\nThanks again everyone for trying to help I really appreciate it! I'm sure it's a silly thing but am not experienced enough in FontLab to work this out easily...!\n\n"
    },
    {
      "time": "4 Dec 2014 — 7:26am",
      "content": "[if you view the whole image I posted you can also see the editing layers panel, if that's any help]\n\n"
    },
    {
      "time": "4 Dec 2014 — 7:53am",
      "content": "I think you have somehow hidden your outline layer. It's also locked.\n\nThat grayed out A is the default bitmap image in the background layer.\n\n"
    },
    {
      "time": "4 Dec 2014 — 10:00am",
      "content": "Ah thanks. I've unlocked it now but, it doesn't appear to want to let me un-hide it...\n\n"
    },
    {
      "time": "4 Dec 2014 — 12:41pm",
      "content": "Try clicking the little icon at the top right corner of the Editing Layers panel. That will give you the simplified view of the panel. You should be able to un-hide the Outline layer there.\n\nI'm not sure how that layer would be hidden or disabled. FWIW, I don't use FontLab as much as I used to, so I might be forgetting something.\n\nIf none of these suggestions work, I would recommend you ask over at the FontLab user forum. People who work at FontLab often answer.\n\n[http://forum.fontlab.com](http://web.archive.org/web/20150317232846/http:/forum.fontlab.com/ \"http://forum.fontlab.com\")\n\n"
    },
    {
      "time": "4 Dec 2014 — 4:47pm",
      "content": "Try unchecking Outline at top of editing layers palette - leave all of that line unchecked and try pasting.\n\n"
    },
    {
      "time": "23 Dec 2014 — 4:44pm",
      "content": "How come you mention shapes having a fill, yet in the picture you posted there is no letter apart from the one that is in the background, which is default in FontLab. Are you actually seeing the letter you past into FontLab at all? Because I can imagine if you copy/paste straight from Illustrator, your letters may be pasted into FontLab too small to see, or outside of the field. I have a separate Illustrator file that correlates to the dimensions of FontLab, so I don't actually copy/paste from the Illustrator file where I have the typeface directly into FontLab. I copy/paste the shapes into the secondary Illustrator file with the correct dimensions, and copy/paste that into FontLab.\n\nAlso, if you do see your letters but they have no counters anymore, one of your nodes is broken. If this is the case you will notice a cross over the broken node. Select the node in Illustrator and press Cntrl + J. This will join the node(s) so it's not broken anymore. I've experienced sometimes when working in different versions of Illustrator (CS5 and CS6 for example), sometimes some of the nodes will break. You don't actually see that until you copy/paste your design into FontLab, in which case your letter has a complete fill without any counters.\n\nIf you're not experiencing either issue, I have no idea what's going on. I've never had FontLab turning layers off or losing the ability to edit your shapes in FontLab.\n\n"
    }
  ]
}
