{
  "id": "121726",
  "title": "What would go with Gotham condensed (bold)?",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "#logo #typography #typeface #gotham #gothamcondensed #businesscard #id #identity",
    "Logos / Corporate ID Design"
  ],
  "content": "What typeface should I pair up with Gotham Condensed (bold)? I'm using Gotham condensed in my logo and was wondering about the typeface that would best compliment it in an identity system. Please help!!!\n\n",
  "author": "cheetu",
  "time": "1 Dec 2014 — 8:18pm",
  "uid": "209352",
  "comments": [
    {
      "time": "1 Dec 2014 — 8:31pm",
      "content": "Font pairing is a bit subjective under the best of conditions, but without being able to see your logo I’d hesitate to make a recommendation.\n\nThe website Fonts in Use may be of help to you. Depending on whether you are looking for a serif or another sans serif typeface to pair with Gotham, the samples at this link might provide some inspiration:  \n [http://fontsinuse.com/typefaces/20/gotham](http://web.archive.org/web/20150317213508/http:/fontsinuse.com/typefaces/20/gotham \"http://fontsinuse.com/typefaces/20/gotham\")\n\n"
    },
    {
      "time": "1 Dec 2014 — 8:37pm",
      "content": "Thanks a lot for the link! I'm still working on my logo, but here's a picture of what I have so far.. do let me know what you think best suits this. The 'A' is a different typeface that I incorporated.\n\n ![](http://web.archive.org/web/20150317213508im_/http:/typophile.com/files/Screen%20Shot%202014-12-01%20at%2011_5330.32.20%20PM.png)\n\n"
    },
    {
      "time": "3 Dec 2014 — 4:04pm",
      "content": " ![](http://web.archive.org/web/20150317213508im_/http:/typophile.com/files/Screen-Shot-2014-12-03-at-3_4586.22.49-PM.jpg)\n\n"
    },
    {
      "time": "28 Dec 2014 — 5:37am",
      "content": "Thank you so much! That is so helpful! My first instinct was to use Trade Gothic too. I think to use a serif compliments this really well. I eventually made a website for this logo/ identity system, so would Minion pro work well as a web font? Or should I stick to a serif?\n\n"
    }
  ]
}
