{
  "id": "121704",
  "title": "Advice for everyday brand font and similar ones",
  "forum": "Design",
  "tags": [
    "#font #alternative #freefont #free",
    "brand font",
    "Design"
  ],
  "content": "I'm trying to find a font to use in everyday: emails, text and documents for a Live performing business bringing a new type of Immersive audio visual live shows.\n\nI'm searching for a futuristic font with square lines to transmit the following messages: Futuristic, forward thinking, cutting edge, fresh, next generation.\n\nDoing a quick search; I came up with the following fonts (see attached image)\n\nA- Anita semi square  \nB- Capella extra condensed  \nC- Nextwave condensed  \nD- Nano Low  \nE- Radio space  \nF- 5th Agent\n\nWhich one do you think could suit best ?\n\nHave you got an advice for a better font ?\n\n| Attachment | Size |\n| --- | --- |\n| [Zipporobotics fonts.jpg](http://web.archive.org/web/20150419203703/http:/typophile.com/files/Zipporobotics%20fonts.jpg) | 814.81 KB |\n\n",
  "author": "Zipporobotics",
  "time": "1 Dec 2014 — 8:14am",
  "uid": "224675",
  "comments": [
    {
      "time": "1 Dec 2014 — 8:49am",
      "content": "Disclaimer: I'm an old dude and clearly not in your target market.\n\nI am a graphic designer, though, and based on my experience, nobody--not even cutting-edge, next-generation people--likes to read whole sentences or paragraphs in all caps, so I'd advise against B, C, and D.\n\nE and F are fine for a logo, but too hard to read for a whole sentence or paragraph. But maybe that's the effect you're aiming for: something that looks like a secret code that only the cool kids can read, and their parents (me) can't read.\n\n"
    },
    {
      "time": "1 Dec 2014 — 8:51am",
      "content": "Another vote against all caps; it's okay for a few words but it's hard to read sentences/paragraphs set that way.\n\n"
    },
    {
      "time": "1 Dec 2014 — 9:37am",
      "content": "Sounds like a job for…Bank Gothic!\n\n"
    },
    {
      "time": "1 Dec 2014 — 10:03am",
      "content": "\\> emails, text\n\nWon't work. Emails and texts use fonts the recipients have on their computers/tablets/phones. If you use an unusual font which those folks don't have, it will appear in a different font on their devices.\n\nAn alternative for email might be to send the message as a graphic or PDF to preserve the fonts and appearance. Keep in mind that some folks (mostly on cell phones or tablets using data plans) don't download graphics automatically so they won't go over their bandwidth allotment, which may reduce readership.\n\nAnother option is to include a link to a web page.\n\n"
    }
  ]
}
