{
  "id": "121728",
  "title": "Typeface with historical link to hospitals and medical care",
  "forum": "Design",
  "tags": [
    "hospitals",
    "Medicine",
    "Design"
  ],
  "content": "Hello,\n\nI'm working on a website for a scientific lab within an academic medical center, and I'd like to choose a typeface that has some historical link to hospitals or medicine. I'll need typefaces for paragraphs of text as well as headings, and any references would be much appreciated!\n\nRegards,  \nJeff\n\n",
  "author": "jeff.hammerbacher",
  "time": "1 Dec 2014 — 10:35pm",
  "uid": "224690",
  "comments": [
    {
      "time": "2 Dec 2014 — 9:45am",
      "content": "Mr. Shinn’s [Scotch Modern](http://web.archive.org/web/20150419203343/http:/www.myfonts.com/fonts/shinn/scotch-modern/) resembles a sort of type in which many many scientific books have been printed, over decades from ca. 1880.\n\n"
    },
    {
      "time": "2 Dec 2014 — 11:22am",
      "content": "Scotch Modern in a nice font, but I'm not sure Jeff why you want a font with historical links to medicine. I could understand if you were making an old-fashioned-looking medicine label, but a modern lab website?\n\nI could see using them in the logo — maybe, if that projects the image your lab wants to convey (which I doubt) —&nbsp;but for text fonts I'd think you'd want fonts that were more associated with a modern scientific lab.\n\n"
    },
    {
      "time": "3 Dec 2014 — 11:31am",
      "content": "Jeff, if you don't mind me questioning your reasoning just a bit, I'm not so sure that an obscure historical tie-in between medicine and a typeface would be noticed or appreciated by anyone viewing the website. You might, on occasion, have the opportunity to tell someone that you were using the same typeface as, say, JAMA used in the 1890s. That person would then nod his or her head in appreciation, but really, no one else will ever notice.\n\nMuch more important is using a typeface that reads well on a computer, smartphone or tablet display and that looks professional in a way that seems appropriate for the scientific lab in question. To me, a nice, clean sans-serif would make a more professional, scientific and forward-thinking impression than a typeface that might have been commonly used in the 1800s. I definitely wouldn't compromise readability for the sake of style — for headlines, maybe, but definitely not for text.\n\n"
    },
    {
      "time": "3 Dec 2014 — 10:55am",
      "content": "I feel like hospitals and clinics always seem to use Optima for signage. But that would look very dated today.\n\n"
    },
    {
      "time": "3 Dec 2014 — 7:51pm",
      "content": "You might consider that Springer, a major publisher of scientific and medical books uses Myriad Condensed for its book covers.  \nMany of the viewers of your website would have seen some of these books and could associate Myriad with reputable medical information.  \nDon\n\n"
    }
  ]
}
