{
  "id": "121797",
  "title": "Honest Critiques Only",
  "forum": "Serif",
  "tags": [
    "1800 something",
    "1800's",
    "critique",
    "design",
    "font",
    "fontlab",
    "serif",
    "Serif",
    "typeface"
  ],
  "content": "Hey guys,\n\nI'm working on a typeface this quarter for a school class and need some critique from you type experts. The name of my typeface is \"1800 Something\" because it was Inspired by the “Franklin TYPE Foundry - Book of Specimens Edition of 1889”. The goal with this font was to use characteristics of 1800 typefaces and make them relevant again for type nerds alike. Basically i'm looking for any critique but I am specifically concerned with my drop shadow alternates, how can I make the drop shadow less illustrator stroke looking, it feels too blocky.\n\nThanks for any comments and all your critiques!\n\nKyle\n\n ![](http://web.archive.org/web/20150317162303im_/http:/typophile.com/files/1800-something-specimen_5564.jpg)\n\n",
  "author": "Kyle Davila",
  "time": "4 Dec 2014 — 6:57pm",
  "uid": "224769",
  "comments": [
    {
      "time": "5 Dec 2014 — 2:26am",
      "content": "Before worrying about drop shadows, you should address the modulation of strokes and the smoothness of letter shapes.  \nAnyway, you could look at accomplished chromatic typefaces for clues (a suggestion: instead of applying some effect to one glyph, you could start placing one glyph over an identical one, then nudge it around until you're satisfied with the result).\n\n"
    },
    {
      "time": "5 Dec 2014 — 8:15am",
      "content": "Thanks for the feedback riccard0! Can you point out the letters you think need some work? I am new to font design and would appreciate some further feedback if you have the time.\n\nThanks\n\n"
    },
    {
      "time": "5 Dec 2014 — 3:27pm",
      "content": "I will start by saying that this style isn’t exactly my cup of tea, so please keep in mind that some of my comments could be more a matter of taste than else.  \nAlso, in your image the outlines look jagged, making it difficult to see if a problem lies in the curve or just in the rendering of it.  \nIn random order:  \n- |G|’s top serif is different from anything else in the typeface.  \n- The chisel-shaped “closing” serifs on |E|F|L|T| look a bit weak, and out of character next to the triangular ones.  \n- Not a fan of the elephant-trunk-like middle arm of |E|.  \n- |A| could be wider.  \n- |&| could do with less overshot.  \n- |R|’s leg is a bit weak.  \n- |C|’s top and bottom curves look heavier than the vertical stroke.  \n- Overall, horizontal and vertical strokes vary sensibly from letter to letter, not in an organic way.\n\nHope it helps.\n\n"
    },
    {
      "time": "10 Dec 2014 — 12:37pm",
      "content": "I appreciate it riccardo, I will take a look at these points, I think you made some valid concerns. The type from these periods have a few letters that feel off from the rest of the alphabet, that was intentionally done, but maybe poorly on my part.\n\nThanks!\n\n"
    },
    {
      "time": "11 Dec 2014 — 2:51am",
      "content": "Hi Kyle,\n\nI'm not qualified to comment personally, but Peter (aka ['bobisheowl'](http://web.archive.org/web/20150317162303/http:/typophile.com/user/215216)) is currently working on a similar typeface and might be able offer his thoughts. I'm not sure how active he is on these forums, but you can also find him at [dafont](http://web.archive.org/web/20150317162303/http:/www.dafont.com/profile.php?user=109186).\n\nGood luck!\n\n"
    }
  ]
}
