{
  "id": "121876",
  "title": "Bot Mono",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "While I’m still working on the greater releases of the Hikari font family and Theory Serif, Sans and Mono, I was crazy enough to begin work on a fifth font project.\n\n ![](http://web.archive.org/web/20150421234834im_/http:/typophile.com/files/Bot-Mono-Sheet-sml_4651.png)\n\nThe idea was born out of a personal need. For months I have been working in Coda to write CSS and HTML code, and I got tired of the array of fonts in the monospaced category, some of which come with the system, some I collected over the past couple of years. From Menlo (Apple) to Droid Sans (Google), I couldn’t find a font that I found was well designed for an on-screen reading experience. Designers of monospaced fonts often claim they were thinking about computer displays first, but when you look at the results, especially in common sizes ranging from 10 to 18 points, the letter shapes often look washed up and have sometimes been just compressed or extended to fit a space (I’m looking at you, first version of Source Code Pro). Bad hinting and unclear shapes result in a nearly unidentifyable letter shape and the overall legibility is suffering.  \nOf course, the very idea of a monospaced font is actually against improved legibility, because it takes away nearly all options to even out white space and create a harmonic experience.\n\nWhat can be changed though is the individual shape. I think nowhere else it is more crucial to get this part right, than with a monospaced typeface designed for screen. We have various screen resolutions today, ranging from tiny devices (like wrist watches) to an iMac with a 5k Retina Display. For programmers looking at a display for hours, the reading experience becomes as much, if not more, relevant than other practical considerations when choosing a monospaced font.\n\nSo this is Bot Mono, a very young, fresh project of mine and I hope you will share your thoughts and critique with me. There will be a few more changes and a large set of glyphs need yet to be worked out, the numbers are missing yet, but it’s already showing a lot of its personality and I am curious to hear what you think.\n\n(Attached is a PDF for closer inspection)\n\n**Questions**\n\n- Do you think I’m on a good path overall? Do you see major mistakes or things you’d change, and why?\n- You may have noticed the inconsistency of what Erik Spiekerman calls “the canon”, the pattern of shapes used for letters such as c, e, b and a. Some are closing, some have an open, humanist shape. The idea was partly inspired by Roboto and Nick Shinn’s recent release, Neology, which I love, by the way. What are your thoughts on this part? Do you think it works and doesn't disturb the reading flow?\n\n| Attachment | Size |\n| --- | --- |\n| [Bot-Mono-Sheet.pdf](http://web.archive.org/web/20150421234834/http:/typophile.com/files/Bot-Mono-Sheet.pdf) | 37.54 KB |\n\n",
  "author": "Core0",
  "time": "8 Dec 2014 — 2:26pm",
  "uid": "181047",
  "comments": [
    {
      "time": "10 Dec 2014 — 12:30pm",
      "content": "I like the overall DIN-ish aesthetic, and it seems to work on small sizes.  \nNot a fan of closed counters, though, and in bigger sizes the mismatched details tends to be distracting.  \n(one pet-peeve of mine is that I like the slashed |0| with a backslash, to unambiguously differentiate it from any other glyph)\n\n"
    },
    {
      "time": "10 Dec 2014 — 1:18pm",
      "content": "I like the overall design. It looks so much lighter than Menlo, for example.\n\nThe /i and the /r could be just a smidgen wider. Perhaps move the /i a bit to the right in its box.\n\n"
    },
    {
      "time": "10 Dec 2014 — 3:00pm",
      "content": "You might try distinguishing G from C in the same way that you've distinguished e from c.\n\n"
    },
    {
      "time": "10 Dec 2014 — 6:47pm",
      "content": "I've been using Source Code Pro for coding websites. Comparing the two, I like what I see in Bot Mono. If the counters were opened up a bit on the c, s, G, C, etc., though, it might improve legibility at typical 11, 12-pt working sizes. Then again, preferences are often the result of what one gets used to.\n\n"
    },
    {
      "time": "12 Dec 2014 — 3:58am",
      "content": "@cerulean: That’s an idea worth to be exploring. Thank you!\n\n"
    },
    {
      "time": "12 Dec 2014 — 4:12am",
      "content": "To the open/closed counter discussion:\n\nThe fact some counters are closed and some are open is of course not by accident. The idea is to distinguish individual glyphs more, without sacrificing overall readability.\n\nThe thought model that readability of a sans serif (or any font) is _always_ improved by open counters _everywhere_, is a bit outdated, if you ask me. Closed counters improve readability by forming invisible rails, just like the baseline and x-height, or caps height. Open counters are wanted, necessary even, if the overall shape becomes muddled (as it would be the case if I kept the lowercase “e” counters closed as I have done it with the “c”). In the case of the lowercase “c” and “s”, the shape’s distinctive characteristics are emphasized, they would become less distinctive if I kept the canon.\n\nThe current design tries to join the best of both worlds, the closed counters-philosophy with open counters where it helps distinction. Keep in mind I was designing the font to be used in 12 to 18 point sizes (on regular, modern displays). If you keep a distance of a foot or more to the display, anything below 12 point will look closer to 7 or 8 point on a printed business card. Bot Mono is not well suited for large sizes, unless imperfection is part of the message you want to express.\n\nI am truly greatful for all your input. It’s great to be pointed to details and think them over. Work is still in progress, as this is a young project, but I’m dedicated to finish up by the end of the year and release it under an open license, perhaps on Google fonts or Font Squirrel. Beta testers are welcome, there will be updates every week now. Just send me an email, you’ll find it on [http://core-ux.com/contact](http://web.archive.org/web/20150421234834/http:/core-ux.com/contact \"http://core-ux.com/contact\").\n\n"
    },
    {
      "time": "14 Dec 2014 — 10:02am",
      "content": "Looking really good\n\nJ could be a bit wider I think.\n\n"
    },
    {
      "time": "15 Dec 2014 — 9:59am",
      "content": " ![](http://web.archive.org/web/20150421234834im_/http:/typophile.com/files/Bot-Mono-Numbers-01_3629.png)\n\nThe numbers are making progress. Next are ampersand, dollar sign and other special characters, before I’m cleaning up the diacritics (they are rudimentary right now).\n\n"
    },
    {
      "time": "5 Apr 2015 — 10:10am",
      "content": "Really ambitious. I like the result so far and would totally see myself using it for coding. I might agree that the 'J' could be wider but it doesn't bother me the way it is either.\n\n"
    }
  ]
}
