{
  "id": "121877",
  "title": "“Typo”",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "nomenclature"
  ],
  "content": "I’ve been seeing the curious use of “typo” to mean “font” or “typeface” with what seems increasing frequency, usually from folk who identify themselves as tyros. Where has this odd usage come from? From where is it being picked up? Are these people truly unaware that “typo” means an error in typesetting? It makes their posts both baffling and amusing.\n\nDavid\n\n",
  "author": "David Vereschagin",
  "time": "8 Dec 2014 — 4:09pm",
  "uid": "103753",
  "comments": [
    {
      "time": "8 Dec 2014 — 4:18pm",
      "content": "Curiously enough, I am also used to call an error a \"typo\" but, quite surprising, the [Online Etymology Dictionary](http://web.archive.org/web/20150417045354/http:/www.etymonline.com/index.php?term=typo) tells me\n\n> typo (n.)  \n> 1816, \"compositor,\" short for typographer; 1892 as short for typographical error.\n\n... so it's actually the _reverse_. So I am apparently a typo!\n\n"
    },
    {
      "time": "8 Dec 2014 — 4:55pm",
      "content": "I seem to recall a similar thread on the subject from a few years ago.  \nMy hunch is that the majority of the posters that use it aren’t native English speakers.\n\n"
    },
    {
      "time": "8 Dec 2014 — 7:00pm",
      "content": "\"Typo\" is used frequently by graphic designers and copywriters to indicate an error, but I've never heard it used to mean font. Can you give a URL of someone using it that way?\n\n"
    },
    {
      "time": "8 Dec 2014 — 9:30pm",
      "content": "Here's a recent example:  \n [http://www.typophile.com/node/121875](http://web.archive.org/web/20150417045354/http:/www.typophile.com/node/121875)\n\nI'm assuming that in some languages the word cognate to \"typography\" can mean \"typeface\", and people use \"typo\" for short. I've seen speakers of some other Romance languages (Spanish certainly, maybe Portuguese and Catalan too?) do this here as well.\n\n"
    },
    {
      "time": "8 Dec 2014 — 9:41pm",
      "content": "> David Vereschagin wrote: _\"...from folk who identify themselves as tyros.\"_\n\nEqually baffling to me was word \"tyros.\" Despite having lived several decades speaking and reading English, I've never once encountered this word. I just looked it up and it means novices or beginners, but then I'm likely the only one here who didn't already know that.\n\n"
    },
    {
      "time": "9 Dec 2014 — 12:27am",
      "content": "Cory, you’re not the only one, that was new to me too :)\n\n"
    },
    {
      "time": "9 Dec 2014 — 4:59am",
      "content": "It probably is something from people whose first language isn’t English, then. I was wondering if it might be some new idiomatic expression with its origin in the interwebs.\n\n--  \nDavid\n\n"
    },
    {
      "time": "9 Dec 2014 — 8:38am",
      "content": "I've never heard \"tyros\" either, but I found it in several dictionaries.\n\nDerivation is \"Medieval Latin, from Latin TIRO young soldier, tyro, First Known Use: 1587\". Synonyms include apprentice, fledgling, freshman, greenhorn.\n\n"
    },
    {
      "time": "9 Dec 2014 — 12:04pm",
      "content": "The first time I saw 'typo' used about something other than a typing error was on this site. IIRC, that was a mass noun (singular; no article), short for 'typography' and came from French.\n\n"
    },
    {
      "time": "9 Dec 2014 — 1:09pm",
      "content": "As is commonly taught in our middle schools the average American has a vocabulary of just 1500 words… Most youngsters in Europe command more than that in each of the (on average three) languages they learn, around the age of sixteen.\n\n"
    },
    {
      "time": "12 Dec 2014 — 5:49am",
      "content": "That's really interesting, Bert. I don't mean to detail this topic, but do you have suggestions as to where the difference may come from? Do you reckon Europeans are generally more linguistically developed because the close proximity of foreign languages pretty much forces us to?\n\nI also find it's beneficial to speak an EU language when reading foreign languages. I can understand Dutch and German, and with that I also have quite a lot of insight into French (though I did learn it at school), Spanish, Italian and the Scandinavian languages. Speaking Dutch also helps with the pronunciation of other EU languages. Polish is a big exception though. I can't get the hang of it.\n\n"
    },
    {
      "time": "12 Dec 2014 — 10:15am",
      "content": "> Bert Vanderveen wrote: _\"As is commonly taught in our middle schools the average American has a vocabulary of just 1500 words…\"_\n\nI'm unsure where you got your information on this, but it differs considerably from I was able to find.\n\n[http://econ.st/16fiqV3](http://web.archive.org/web/20150417045354/http:/econ.st/16fiqV3 \"http://econ.st/16fiqV3\")  \n [http://bit.ly/SBhB2l](http://web.archive.org/web/20150417045354/http:/bit.ly/SBhB2l \"http://bit.ly/SBhB2l\")  \n [http://bit.ly/1wnxF6u](http://web.archive.org/web/20150417045354/http:/bit.ly/1wnxF6u \"http://bit.ly/1wnxF6u\")\n\nI wouldn't be surprised if only about 1,500 words are needed for typical conversations, but according to the information in these links (and the studies they reference), most adults have a vocabulary in the neighborhood of 30,000 to 60,000 words.\n\nUnlike most Europeans, it's unfortunate, but true, that most Americans can only speak English. Still, it's understandable given the number of native languages spoken in Europe as opposed to the lack of linguistic diversity the U.S..\n\nDespite being similar in land area, Europe has a couple dozen major languages and many more distinct regional dialects. A day's drive through Europe can easily cross several borders where entirely different languages are spoken. This just doesn't happen in the U.S., where English is spoken throughout. It's becoming increasingly useful to know some Spanish, but not really necessary in day-to-day life for most.\n\nEven those Americans who have learned new languages while living abroad often tend to forget, over time, most of what they learned upon returning home. Unlike Europe (or much of the world), only limited opportunities exist to, even, use another language.\n\n"
    },
    {
      "time": "12 Dec 2014 — 10:56am",
      "content": "\\> most adults have a vocabulary in the  \n\\> neighborhood of 30,000 to 60,000 words\n\nRegardless of the sources, I find that hard to believe. And I can't imagine how you'd test for that. If a test took 5 seconds per definition, testing 60,000 words would take 83 hours!\n\n"
    },
    {
      "time": "12 Dec 2014 — 11:56am",
      "content": "I'm a bit skeptical of the high numbers given on those sites too. My best guess is an average American adult vocabulary (knowing the definition of words as opposed to simply recognizing them) consists of around 15,000 to 20,000 words, but, hey, I'm no expert.\n\nFor what it's worth, here's an online vocabulary test (English) that claims to estimate the vocabulary of those taking it. The statistical results from those taking the test are, of course, skewed in the direction of those choosing to take the test and, likely, having larger vocabularies. These skewed results showed an cumulative median to be around 30,000 words.\n\n[http://testyourvocab.com/](http://web.archive.org/web/20150417045354/http:/testyourvocab.com/ \"http://testyourvocab.com/\")\n\nNo matter where the more accurate numbers lie, though, it seems clear that an average American has a vocabulary far larger than 1,500 words.\n\n"
    },
    {
      "time": "12 Dec 2014 — 12:26pm",
      "content": "Big distinction between how many words one knows the meaning of, how many one uses in everyday speech, and how many one uses in written work.\n\n"
    },
    {
      "time": "13 Dec 2014 — 12:46am",
      "content": "<cite> Are these people truly unaware that “typo” means an error in typesetting?</cite>\n\nWell, a word means what people agree upon it means. Meanings change over time or change with context. So if enough people agree that typo is another word for typeface, than it can be a “correct” use.\n\nI think it’s rather clear where this newer meaning comes from. When people talk about typography, the choice of typefaces is mostly the main aspect. In a corporate design manual for example, there is usually a section titled “typography” and then it shows the corporate fonts. Typo — short for typography&nbsp;—&nbsp;then becomes a synonym for typefaces.\n\nI discourage people from using that new meaning though. It’s useful to have a distinction between the use of typefaces and the typefaces itself. Blurring those meanings is not helpful.\n\nBut I wouldn’t call it “baffling and amusing” when other people use different meanings of words. The way they learned those meaning through interacting with other people, is not different from how you might have learned the other, older meaning (typing error). Your meaning is not more “correct” because it is older. That’s not how language works.\n\n"
    },
    {
      "time": "13 Dec 2014 — 9:33am",
      "content": "\\> Meanings change over time\n\nThat's right, meaning can change, new words appear, old words can disappear. That's why dictionaries are updated periodically.\n\nBut I hope it doesn't happen with \"typo\".\n\n"
    },
    {
      "time": "13 Dec 2014 — 12:37pm",
      "content": "> This just doesn't happen in the U.S., where English is spoken throughout. It's becoming increasingly useful to know some Spanish, but not really necessary in day-to-day life for most.\n\nWell, you said it yourself; it does happen, though only with Spanish. I don't see how learning Spanish not being necessary for day-to-day life is an argument though. Do you reckon I have to speak German every day? I never speak German generally, though every time something German is on TV I have to smile because although I probably would never have taken on German myself, the fact that it was forced on me has been really beneficial. I'm rather upset by the fact we weren't taught Spanish in school.\n\nI originally come from the south of the Netherlands, close to the border of Germany. For us it's beneficial to speak German, especially since many go to Germany for gas and groceries, but it becomes increasingly irrelevant as new generations of Germans speak English. Most of the Netherlands doesn't have a need for it though and in fact further away from the border of Germany people aren't fluent in German despite being taught in school. Despite that, I consider it to be absolutely beneficial to learn at least one extra language, despite not needing it for day-today life. It's probably a good thing for your linguistic capabilities in general.\n\nWhat I find particularly interesting is that people think their language gives them the ability to communicate anything and everything. I find using one language to be stifling. Even knowing all the languages in the world should feel one restricted when faced with deeper reality. We can discuss this in another topic if interested, but I've experienced things for which there are simply no words as these experiences came about by neurological pathways which are normally not accessed. I submit that with every language, there are certain minor neurological pathways you would normally never use. I often find both English and Dutch to be lacking, so at times it's good to know multiple languages so I at least have the insight of what the language is lacking. If I didn't have that insight, I suppose in some instances I may be under the impression that I'm communicating accurately while this is in fact not the case.\n\nAlso, I'm sad I don't master mathematics as this language seems to give many insights which are very hard to get to with ordinary languages.\n\nI guess this has been a long winded way of saying \"one language is never enough, regardless of where you live\".\n\nAs for the notion that Americans have a vocabulary of 1500 words, I feel stupid for just accepting the statement blindly. I just read that the average native 4 year old has a vocabulary of 5000 words. The most common vocabulary size for foreign test-takers is 4500 words (and a different source says foreigners commonly have a vocabulary of 4000–9000 words). I just did a test to see how large my English vocabulary is, and apparently it's 20.600. I'm rather disappointed with that number, though I guess it falls perfectly within the average vocabulary of native speakers. I just thought my vocabulary was higher. I can barely imagine many native speakers knew any of the last words of the test. [testyourvocab.com](http://web.archive.org/web/20150417045354/http:/testyourvocab.com/)\n\n"
    },
    {
      "time": "13 Dec 2014 — 8:05pm",
      "content": "I don't disagree with what you're saying, Martin. It's most definitely unfortunate that most Americans only speak English. My main point, though, is that it's more difficult to adequately learn a second language in the U.S. since there's relatively little opportunity to use, practice or keep up with it without really going out of one's way to do so.\n\nYou mentioned growing up in the Netherlands, so within an extended region the size of the U.S. state in which I live, you had native speakers of Dutch, German, Flemish, French, English and, maybe, Danish. It might not have been strictly necessary to learn multiple languages there, but with that kind of diversity packed into such a small area, it seems logical that so many do so — especially given the largely borderless nature of travel, business and residency within the EU.\n\nThat kind of linguistic diversity doesn't exist in most of the U.S.. So unless one lives on the border with Mexico or Quebec, the most practical and immediate reasons for most Americans to learn a second language don't exist, and the most effective opportunities to do so are absent as well. Whether this is good, bad or a mixed bag is another matter, but it is what it is.\n\n"
    },
    {
      "time": "13 Dec 2014 — 9:24pm",
      "content": "I took French in high school and the only use I've had for it was a short vacation in France, but nearly everyone I met was used to tourists and spoke some English.\n\nSpanish isn't needed where I live, but it's useful in some parts of the U.S., especially the southwest.\n\nIt's a very different situation in Europe where one can drive through several countries in one day, and a knowledge of multiple languages is very useful. One of my grandfathers was a Polish immigrant and spoke 4 or 5 languages.\n\n"
    },
    {
      "time": "13 Dec 2014 — 9:44pm",
      "content": "> I don't disagree with what you're saying, Martin.\n\nHaha I actually wasn't trying to make a big argument against you. I started with a slight disagreement and then got carried away with my own story and forgot I was responding to anyone in particular.\n\n> My main point, though, is that it's more difficult to adequately learn a second language in the U.S. since there's relatively little opportunity to use, practice or keep up with it without really going out of one's way to do so.\n\nI get that, and I don't think the average American can do much about it, though I do think there will be plenty of opportunities to take Spanish at school. However, I believe some languages should become part of the standard subjects you take at school. It's probably not so much about practicality as it is about general insight and becoming well versed with languages. I started learning English at school at age 10 or 11, French at 13 and German at 14. For some reason French just didn't stick, though I can read some. I think it's a beautiful language but rather difficult, and I guess I didn't really see the practicality of it. I still don't. In the Netherlands you get to choose a profile at high school and each profile has specific classes. I chose \"culture & society\" which included a particular focus on language, so I had to choose between advanced French or German and chose the one which I thought was easier.\n\nIf I had the choice I honestly don't know if I would have chosen a language besides English at all, but I'm very glad it was forced on me. I think people should start learning languages very young. I consistently scored higher at English than I did at Dutch because I find English grammar to be easy and I basically grew up with the language, where everything on TV was subtitled in Dutch and all my games were in English. It got to the point where I install Windows and all other software in Dutch, because I hate having it all in Dutch.\n\n> It might not have been strictly necessary to learn multiple languages there, but with that kind of diversity packed into such a small area, it seems logical that so many do so — especially given the largely borderless nature of travel, business and residency within the EU.\n\nActually I don't think that's exactly the case. English is supposedly taught anywhere, but in the EU there are many countries where people just refuse to speak a foreign language. The Netherlands is quite an exception and in fact we get a lot of exchange students simply because we're well versed in languages and most of our schools teach in English. I'm supposed to be doing my study in Dutch, but half of it is in English because of exchange students. I love that, but a few people of my class have complained because they're not very well at talking English and didn't choose a Dutch study for nothing, because we also have official English studies at our school. I considered doing my degree in English. I didn't, so now I'm just glad I get to talk English half the time anyway.\n\nIn the last years the Netherlands has been dubbing cartoons for kids, but I actually grew up with English cartoons with subtitles. I consider it to be a regression that we're dubbing now. It seems in every country where people refuse to speak foreign languages, they dub everything. So, I think part of the reason why people aren't great with languages in other countries is because they refuse to become intimate with it. They dub absolutely everything and I've heard many Germans actually don't know what the actors really sound like because they're used to the German dub. They do it in Spain, Portugal, France, Germany, Italy, Ukraine, Poland and probably a lot more countries. We still don't do that for movies unless they're for children. When I was in Paris 9 years ago, I saw posters for English lessons everywhere in the metros, but no one around me could talk English and if they did, they refused to. Things may have changed since then, but I find it a bit hard to believe. The new generations do obviously learn English though.\n\nAlso, we Dutch learn English, German and French almost by default and some schools offer options for more unusual languages. If you study at a high level you also get to learn Latin and Greek, but I suppose that's the case in other countries as well. However, other countries certainly don't learn Dutch. I've never heard of Germans learning Dutch, French or Italian, of Italians learning German, of French learning Dutch (even though half of Belgium speaks Dutch and the Belgians certainly learn French) or Spanish. So it's really not like we're all learning extra languages because of our close proximity. English is the only language that is taught everywhere. Years ago I hung out with a Polish family in Italy and despite the fact that their teenage kids listened to Eminem non-stop (or perhaps because of it), they couldn't speak any English.\n\n"
    },
    {
      "time": "15 Dec 2014 — 5:22am",
      "content": "Martin, Latin and Greek used be part of public education in the US, but by the time I entered high school (1980) it had been out of fashion for at least 20 years (not that I’m a particular fan, but as an example our former President, Bill Clinton, studied four years of Latin at Little Rock High School in Arkansas in the early 1960s). Classical languages held on longer—and are still taught—in private preparatory or “prep” schools and in Catholic elementary and high schools, but usually as electives these days, not as required parts of the curriculum.\n\nThanks to a 9th-grade English teacher who used to be a Latin teacher, I learned the Greek and Latin etymology of English words and am grateful for the instruction. As for foreign languages, even the high school in my remote, Midwestern hometown offered Spanish, German, and French. Unfortunately, those elective classes were scheduled opposite the art, chemistry, physics, biology, and advanced English classes I also wanted to take. So, no foreign language for me in high school.\n\nWhich is why I picked a private liberal arts college that required proficiency in a foreign language of all its graduates. While my choices were much broader than in high school (they included Japanese, Chinese, Russian, Hebrew, Latin, Greek, Portuguese, Italian, Marathi, and Arabic), I had the same scheduling problem—the language I wanted to study (Russian) was scheduled opposite all my required art classes. So I ended up studying four years of French, living in the French language interest house, and getting fluent enough to be asked to work as a grader for the French department. The experience improved my grasp of English grammar, allowed me to do primary source research in art history in the original language, and broadened my social world.\n\nBut to your point, unless I make a concerted effort to practice the language, I don’t speak it often these days. And given my choice of language and where I live, I don’t encounter many other people who speak it, either. The last time I remember using it in public was at the Philadelphia Museum of Art, when a French couple was getting bad advice as to where to hail a taxi from one of the museum shop clerks. When I added my two cents in French, they seemed pleasantly surprised and grateful for the assistance. After the couple left, the clerk asked me if I were French, too, and was surprised when I said no.\n\nI still watch unsubtitled French films and read books in the language, but it’s not the same thing as speaking the language every day.\n\nThe average American still adamantly hangs on to the notion that if you live in this country, English is the only language you should speak. Bilingual education for recent immigrants has fallen out of favor, foreign language instruction in public schools is often seen as an unnecessary luxury, and people look at you sideways for pronouncing foreign words correctly. Sadly, because the rest of the world teaches English in its schools, we have the arrogance to think we don’t have to learn their languages. And we are poorer for it.\n\n"
    },
    {
      "time": "15 Dec 2014 — 10:21pm",
      "content": "<cite>… and people look at you sideways for pronouncing foreign words correctly. </cite>\n\nWhen I posted an article ( [now turned into a video](http://web.archive.org/web/20150417045354/https:/www.youtube.com/watch?v=os4lUpj3nvw)) demonstrating the original spellings of European typeface names, many Americans even got angry by the pure notion there exists another way than just pronouncing everything like it was an English word. I definitely felt some arrogance there.\n\n"
    },
    {
      "time": "16 Dec 2014 — 4:38am",
      "content": "Helvetica Neue engenders the most ridicule....\n\n"
    },
    {
      "time": "16 Dec 2014 — 4:43am",
      "content": "I may have used some hyperbole in my statement about the vocabularies… In fact that 1500 words is the vocabulary of US English speakers ‘in daily use’.\n\nBut this IS an interesting discussion… : )\n\n"
    },
    {
      "time": "17 Dec 2014 — 9:15am",
      "content": "Bert, I considered that, but I saw several articles based on the same source that stated men generally use 7000 words per day while women use 20.000 words per day. Would the 1500 words be unique words?\n\nAs for the pronunciation of typefaces, I feel words like \"neue\" should be pronounced correctly. When it comes to the names I would actually encourage your own pronunciation. Also, I find it odd Americans get angry by the notion there is an alternate pronunciation and indeed it's arrogant to pretend the English pronunciation is the correct one, but I must say people often sound pretentious when they pronounce foreign words correctly. In my opinion that should be done when you speak the language, but I think in the Netherlands people would also look at me weird if I were to pronounce all Italian foods correctly. We're so used to the Dutch pronunciations of Italian names (who even says 'spaghetti' the way Italians do?), it's just too obtrusive to use a foreign pronunciation in a sentence in your own language. I feel the same way about the names of typefaces. Especially the German names sound odd when spoken by an English speaker.\n\n> Martin, Latin and Greek used be part of public education in the US, but by the time I entered high school (1980) it had been out of fashion for at least 20 years\n\nActually, when it comes to Latin and Greek I think it's justified that it's not part of standard education. In the Netherlands Latin and Greek are only taught to the people who do high school at the highest level, since I suppose these are the people who are more likely going to be doctors, biologists, historians, linguists etc. There's no need to learn Latin if you intend to become a barber, of course.\n\n> As for foreign languages, even the high school in my remote, Midwestern hometown offered Spanish, German, and French. Unfortunately, those elective classes were scheduled opposite the art, chemistry, physics, biology, and advanced English classes I also wanted to take. So, no foreign language for me in high school.\n\nI was forced to do either advanced French or German as it was part of the profile I chose. I think if I would have had free choice, I might have chosen a scientific class instead. I'm not sure if that would have been better for me. Back then I wasn't particularly fond of school, but right now if I could re-do it I would have loved to do both. I feel guilty about every opportunity I miss to learn.\n\n> The experience improved my grasp of English grammar, allowed me to do primary source research in art history in the original language, and broadened my social world.\n\nThat's really what I encourage. I know there are many people who don't see the practical use of learning a secondary or tertiary language, but it opens up so many possibilities. Suddenly you have access to documents you didn't have access to before. I would love to be fluent in French, Spanish, Latin, Greek and Russian at least. I live in a house with Chinese people, so I guess Mandarin would also be handy, but just for fun. It would be great to be able to read any old book you might find in whatever language.\n\n> Sadly, because the rest of the world teaches English in its schools, we have the arrogance to think we don’t have to learn their languages. And we are poorer for it.\n\nExactly. In hindsight I find it hard to understand people don't learn several languages. I don't really know what Dutch is good for though.\n\n"
    }
  ]
}
