{
  "id": "121894",
  "title": "Caslon Catalog",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "In my web searches, I just came across a mention of Caslon Catalog, designed by\n\nIt is described as a Caslon with thicker hairlines. This sounds like the sort of thing I'd be interested in.\n\nHowever, I haven't been able to turn up a specimen anywhere. One confusing thing is that Robert Wiebking had also designed another revised Caslon, Clearface Caslon - and the description of it in a specimen notes that it was given thicker hairlines to look better on glossy paper, as used in catalogs. But that typeface was an earlier design of his, distinct from Caslon Catalog (also known as Caslon Antique, but having no connection with the better-known typeface by that name).\n\nAs I've noted, I'm interested in a Caslon that's a tad more authentic than Adobe Caslon, allows itself a bit more stroke contrast than Williams Caslon - but which doesn't have the look of an 'authentic' Caslon when printed with a 'kiss' impression - or digitally, or by lithography and phototypesetting.\n\nMy ideal Caslon would look a lot like the original printed broadsheet of the Declaration of Independence - an authentic Caslon thickened just enough by the printing process.\n\n",
  "author": "quadibloc",
  "time": "9 Dec 2014 — 5:31am",
  "uid": "50554",
  "comments": [
    {
      "time": "9 Dec 2014 — 5:54am",
      "content": "Oh, and here's the page where I saw Caslon Clearface:\n\n[http://dailytypespecimen.com/post/34493063700/caslon-clearface-type-specimen](http://web.archive.org/web/20150317075225/http:/dailytypespecimen.com/post/34493063700/caslon-clearface-type-specimen)\n\n"
    },
    {
      "time": "9 Dec 2014 — 6:26am",
      "content": "Luc Devroye discusses Caslon Catalog here (sadly, no specimen):  \n [http://luc.devroye.org/fonts-71395.html](http://web.archive.org/web/20150317075225/http:/luc.devroye.org/fonts-71395.html \"http://luc.devroye.org/fonts-71395.html\")\n\n"
    },
    {
      "time": "9 Dec 2014 — 3:19pm",
      "content": "Incidentally, I've learned from Gerald Giampa's P22 web site that American Caslon and New Caslon were closely related - American Caslon is stated there to be \"the same face with longer ascenders\". Actually, as can be seen from the specimen images on [that site](http://web.archive.org/web/20150317075225/http:/typophile.com/wiki/https%3A/%252Fwww.p22.com/lanston/giampa/NewCaslon.html), the _descenders_ are (also?) longer for American Caslon.\n\n"
    },
    {
      "time": "10 Dec 2014 — 6:18am",
      "content": "Here is the sample from Mac Mcgrews \"American Metal Type Faces of the 20th Century\"\n\n ![](http://web.archive.org/web/20150317075225im_/http:/typophile.com/files/CaslonCatalog_6079.jpg)\n\n"
    }
  ]
}
