{
  "id": "121875",
  "title": "Help to create a typography",
  "forum": "General Discussions",
  "tags": [
    "creating",
    "General Discussions",
    "help",
    "typography"
  ],
  "content": "Hello everyone, i'am new to this site, i need some help on FontLab Studio, i and a friend just finished designing a typo on illustrator, and we are looking to export it as otf and ttf, i copied/pasted all my vectors, and when i try to generate the font it displays an open contours warning, our typography is based on a complex grid with lots of crossing vectors, there is always a circle in front of or in the letter.  \nWhen it exports, a weird F symbol appears on nearly every letter.\n\nThank you in advance,\n\nArthur\n\n",
  "author": "p0ip0i",
  "time": "8 Dec 2014 — 2:18pm",
  "uid": "224846",
  "comments": [
    {
      "time": "8 Dec 2014 — 3:32pm",
      "content": "Being new to a site does not necessarily mean you can post anything, anywhere you want. You should at least have read the various descriptions on the home page; then, you would have seen the best place to ask technical support is in the [Build](http://web.archive.org/web/20150420161631/http:/typophile.com/forum/6) sub-forum.\n\n"
    },
    {
      "time": "9 Dec 2014 — 6:03am",
      "content": "One thing is for sure: you are trying to generate fonts with the demo version of FontLab, which is why you are getting the \"weird F symbol on nearly every letter.\"\n\n"
    },
    {
      "time": "9 Dec 2014 — 1:22pm",
      "content": "In addition to the \"F\" problem...\n\nIllustrator allows line segments and stray points to be scattered around, which works fine for most things that most people use Illustrator to do. Making a font, however, means adhering to a few more exacting expectations, like clean, closed contours that define filled shapes. FontLab has a few features that help facilitate clean-up chores under the Contour menu heading. If all your glyphs are riddled with these sorts of issues, though, you might have a job ahead of you that will require a large degree of manual fixing.\n\n"
    },
    {
      "time": "15 Dec 2014 — 8:20am",
      "content": "(Also: the correct term here rather than \"typography\" would be font, or maybe typeface. \"A typography\" is not a meaningful term in English.)\n\n"
    }
  ]
}
