{
  "id": "121850",
  "title": "Match for typewriter-type for graphic novel?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi!  \nI’m new here (though I’ve nosed around earlier).  \nI’m working on a graphic novel, or actually it’s more like a ‘graphic bio’ – a biography in the form of a picture book.\n\nIn the book, there are 3-4 different kinds/lines of text – the narrator’s voice, my main character’s voice – and then excerpts from letters, song texts and poems, written for and by my main character.  \nThe 3 different kinds of text change a lot throughout the book, so that I sometimes will have all three kinds on one page or spread. Every page is illustrated and sometimes text is set on top of a drawing.\n\nThe two first kinds of text, the narrator and my main character, I think would work with quite many different typefaces,  \nMy story takes place mostly in the 1960-1980s, when my character was young – in a beatnik-/alternative surrounding. I’d like the typeface for her and the narrator’s voice to have some warmth, but without attracting too much attention to itself. Maybe slightly handwritten and/or casual.  \nFor now, I am leaning towards Cronos, and earlier I’ve looked at Joanna, Perpetua or Legacy Sans.\n\nBut, but, but: the letter/poem-texts are causing me a head ache! The only thing that I think really works for them, is using a “oldschool-typewriter”-face (like “Pitch”.) One with a vintage-typewriter-feel.  \nBut I don't think the typewriter-face doesn't mix very well with any of the above mentioned. The shapes, perhaps, but also when combined with a typewriter face, they look a little (too) formal.  \nI looked at Nexus and Eureka, which both have a monotype-version, that I thought of using in stead of vintage- typewriter-type, but I think those monotypes look too contemporary for my book. Sigh.\n\nDoes this make sense? Do you have any ideas or suggestions?\n\nI know this is the kind of thing you should discuss with a colleague, while having a coffee – but I don’t have that person right now. So – if anyone has thoughts, opinions or suggestions on this, it will be very much appreciated! Thanks so much!\n\n",
  "author": "scillas",
  "time": "7 Dec 2014 — 10:48am",
  "uid": "224820",
  "comments": [
    {
      "time": "7 Dec 2014 — 11:02am",
      "content": "Related perhaps, earlier typewriter discussion:  \n [http://typophile.com/node/121353](http://web.archive.org/web/20150418115001/http:/typophile.com/node/121353 \"http://typophile.com/node/121353\")\n\n"
    },
    {
      "time": "7 Dec 2014 — 5:18pm",
      "content": "\\> My story takes place mostly in the 1960-1980s,  \n\\> ...in a beatnik-/alternative surrounding\n\nWould a beatnik be using a typewriter? I was a young person back then and most young folks didn't use them except maybe in upper-class schools, for college term papers, and office work. And it's harder to imagine a beatnik or hippie using one. You might need to include an explanation of why they are using it.\n\n"
    },
    {
      "time": "7 Dec 2014 — 3:28pm",
      "content": "It depends on how much “graphic” and how much “novel” the result: if the typewritten text is visually framed, it shouldn’t clash with the rest.  \nIf that is the case, I would go for an accurate rendition either historically (which model of typewriter?) and/or visually (a “worn out” face, like [http://www.fontfont.com/fonts/trixie](http://web.archive.org/web/20150418115001/http:/www.fontfont.com/fonts/trixie \"http://www.fontfont.com/fonts/trixie\")).  \nIf the lines (pun intended) between the different kind of text are more blurred, you could use either a classic text face with a monospaced cut (like Century) or a proportionally spaced typewriter face (like the ones suggested in the aforelinked thread or [http://www.fontsquirrel.com/fonts/lekton](http://web.archive.org/web/20150418115001/http:/www.fontsquirrel.com/fonts/lekton \"http://www.fontsquirrel.com/fonts/lekton\")).  \nAbout the text faces you mention, I’m most familiar with Perpetua, and I wouldn’t recommend it, finding it a bit “frail” and maybe even pretentious.\n\n"
    },
    {
      "time": "8 Dec 2014 — 4:35am",
      "content": "On The Road was written on a Underwood Typewriter - Beat writers used typewriters. Dafont has many typewriter fonts - some quite good.\n\n"
    },
    {
      "time": "8 Dec 2014 — 6:00am",
      "content": "Thank you very much for your answers and for pointing me to the older typewriter-discussion. I'll take a closer look at Triplicate.\n\n@ James: they did use typewriters – but also a lot of handwriting. I'm reluctant to post text and illustrations from the book, as it is not yet approved, but I can share with you a little piece of sixties typewriting: several little notes like this one, \"just left - will be back later\"-sort of notes, survived all these years and I feature some of them in the book. They feels like text messages from 50 years ago.  \n@ riccard0: yes. The lines are blurred – and the texts not always visually separated. Century – that might work!\n\nThanks again.\n\n ![](http://web.archive.org/web/20150418115001im_/http:/typophile.com/files/type_sixities_typrewriter_5836.jpg)\n\n"
    },
    {
      "time": "8 Dec 2014 — 9:07am",
      "content": "\\> @ James: they did use typewriters – but also a lot of handwriting.\n\nI agree. I'm just saying it's not like today when everyone has a computer. Many folks didn't even own a typewriter. I was the editor of a newsletter in the 1970s and almost all submissions were handwritten.\n\nI'm not saying that typewriting is a bad idea. I'm just saying that you might want to mention why a beatnik is using one.\n\n"
    },
    {
      "time": "8 Dec 2014 — 11:32am",
      "content": "[The Last Whole Earth Catalog](http://web.archive.org/web/20150418115001/http:/en.wikipedia.org/wiki/Whole_Earth_Catalog) (1971) was assembled using photocopies and IBM Selectric type.  \nWhat typefaces best approximate the quality of “golf ball” typography?  \nI would suggest my [Brown](http://web.archive.org/web/20150418115001/http:/www.fontspring.com/fonts/shinntype/brown-gothic), for its patina of distress, although metrically it is consistent and without bounce.\n\n"
    },
    {
      "time": "8 Dec 2014 — 2:58pm",
      "content": "@ James, they did a lot of writing in her \"group\". They published a magazine.  \nAnd both her parents were writers. You mentioned social class, and when they met in the 1940, her mother, who came from a middle class family, owned a typewriter, while her father, coming from a working class background, didn't. Her's was an Erica/Erika – I know that.  \n@ Nick – I like it Brown. It's has this slight vintage-tint. I like it. And nice story about WEC.  \nIt's hard to make the typewriter-/monospace/slab work with a serif, so I think it must be a sans. Brown could mix nicely, I think. If anything, perhaps I could use something a little more ...casual, perhaps. But it is a good suggestion.\n\n"
    },
    {
      "time": "8 Dec 2014 — 6:38pm",
      "content": "Sounds good.\n\nIncidentally I've got a bunch of old ones that belonged to my dad, who did some writing. Nothing fancy, this is an old Royal still in it's carrying case.\n\n ![](http://web.archive.org/web/20150418115001im_/http:/typophile.com/files/typewriter2_5046.jpg)\n\n"
    }
  ]
}
