{
  "id": "122065",
  "title": "Tuscan typeface",
  "forum": "Home",
  "tags": [
    "Display"
  ],
  "content": "I was digging through some old Type ID threads and saw this typeface that donshonttype had posted. Does anyone know what typeface this is or what it is derived from? I suppose donshonttype would know best.\n\nFont:&nbsp;\n\n Customized Latin CT \n\nSolved By:&nbsp;\n\n [donshottype](http://web.archive.org/web/20150317114251/http:/typophile.com/user/205259 \"View user profile.\")\n\n| Attachment | Size |\n| --- | --- |\n| [ClotRatPack.jpg](http://web.archive.org/web/20150317114251/http:/typophile.com/files/ClotRatPack.jpg) | 44.03 KB |\n\n",
  "author": "tylor.reimer",
  "time": "17 Dec 2014 — 11:30am",
  "uid": "25880",
  "comments": [
    {
      "time": "18 Dec 2014 — 2:42am",
      "content": "The base font for this lettering is CastleType's Latin CT, and uses a blend of the condensed width\n\n ![](http://web.archive.org/web/20150317114251im_/http:/typophile.com/files/LatinCTCondAsClot_5953.gif)\n and regular width \n ![](http://web.archive.org/web/20150317114251im_/http:/typophile.com/files/LatinCTAsClot_6653.gif)\n  \nCastleType's products are well make and worthy of purchase.  \nThrough an oversight I did not mention the foundry in my earlier post. Here is a link to the fonts [https://www.myfonts.com/fonts/castletype/latin-ct/](http://web.archive.org/web/20150317114251/https:/www.myfonts.com/fonts/castletype/latin-ct/ \"https://www.myfonts.com/fonts/castletype/latin-ct/\")  \nThe spurs are added to demonstrate the ease of making something similar to the \"Bowery\" style of lettering that Nike has used for its clothing [http://typophile.com/node/103278](http://web.archive.org/web/20150317114251/http:/typophile.com/node/103278 \"http://typophile.com/node/103278\")  \nHave fun making your own version.  \nDon\n\n"
    },
    {
      "time": "18 Dec 2014 — 7:09am",
      "content": "Great, thanks donshottype. Looks like you did a fair bit of tweaking to make your sample. Nice work!\n\n"
    },
    {
      "time": "18 Dec 2014 — 8:58am",
      "content": "Thank you Tylor for the kudos.  \nThe result seems to be successful as a Latinate serif with spurs, but I find the spiky tone of the resulting design to be somewhat aggressive and appropriate mainly for bikers, angry rock bands and the ilk.  \nWhen the same spurs are used on a font with a softer serif treatment, such as a plush fish tail Tuscan, the effect is more of an ornamented space filler that producdes a font that has a tone suitable for applications from stock certificates to restaurant menus. The spurs might also work for a similar wide range of applications if it is used on font with a Clarendon or thick slab serif.  \nDon\n\n"
    },
    {
      "time": "18 Dec 2014 — 11:59pm",
      "content": "For examples of the use of median spurs on a Clarendon and on a plush fish tail Tuscan see [http://www.typophile.com/node/117209](http://web.archive.org/web/20150317114251/http:/www.typophile.com/node/117209 \"http://www.typophile.com/node/117209\")  \nDon\n\n"
    },
    {
      "time": "19 Dec 2014 — 6:42am",
      "content": "Thanks Don. I'm actually quite intrigued by the sharp angular serif typefaces found in Latin CT and an example from the last link you posted (Dan X. Solo's Olympian). I think they would make good candidates for a spur transplant. What would be some good keywords to search for those kind of typefaces?\n\n"
    }
  ]
}
