{
  "id": "12205",
  "title": "German nationalism",
  "forum": "Home",
  "tags": [

  ],
  "content": "**[Indicies](http://web.archive.org/web/20150413075142/http:/typophile.com/wiki/Indicies) : [History](http://web.archive.org/web/20150413075142/http:/typophile.com/wiki/History) : German nationalism**\n\nSometimes, this has reared its head and turned out to be a bad, bad thing. However, one could make the case that almost any form of nationalism is inherently bad.\n\nLike nationalism in almost every other country, German nationalism has had various forms over time. Each has had different characteristics. For instance, before 1871, Germany had never been a unified country. So, nationalism pre 1871 in Germany took the form of a strict drive toward unifaction. The German language and the German scripts ( [Blackletter](http://web.archive.org/web/20150413075142/http:/typophile.com/wiki/Blackletter)) were seen as binding elements across all German peoples at this time. This sort of German nationalism was support by people like Beethoven, Wagner, and Strauss, but also Otto von Bismarck.\n\nSince the end of the second World War, many West Germans have been skeptical of nationalism. However, in recent years, German nationalism has come on the scene again in two forms, both mostly amoung younger people. One branch of German nationalism is very small, and is overtly right-wing (Neo-Nazi). Another has been \"proud of being German,\" recognizing Germany's cultural, technological, political, and business successes of the modern era. Interestingly enough, both sides seem to draw some sort of inspiration from the fall of the Berlin Wall and the reunification of the country in 1990.\n\nWhile too many Neo-Nazis embrace [Blackletter](http://web.archive.org/web/20150413075142/http:/typophile.com/wiki/Blackletter) types, too-many younger Germans in the other camp seem to associate them with German nationalism instead of seeing them in some positive cultural light.\n\n",
  "author": "dan_reynolds",
  "time": "7 May 2005 — 2:42pm",
  "uid": "1085",
  "comments": [

  ]
}
