{
  "id": "122026",
  "title": "About designing and releasing a font family",
  "forum": "General Discussions",
  "tags": [
    "big family",
    "General Discussions",
    "question",
    "releasing",
    "time"
  ],
  "content": "I'm designing a huge, multi-script sans serif family with true italic. At the moment I've almost finished the regular and started the italic. The thin and black masters are also at the very beginning. The question is—should I release and start selling regular and italic and later add other weights later (this is better for me) or wait and release the whole family (this, I think, would be more fair for customers).\n\nWhat would you do? I've seen both release models on MyFonts and I'm not sure which one to choose.\n\n",
  "author": "goloub",
  "time": "16 Dec 2014 — 2:58am",
  "uid": "215967",
  "comments": [
    {
      "time": "16 Dec 2014 — 3:21am",
      "content": "If you prefer a delayed release, as a start I would suggest you offer at least a basic family (two styles, two weights).\n\n"
    },
    {
      "time": "17 Dec 2014 — 8:29pm",
      "content": "For me, and I suspect most type designers, the experience of designing the additional weights will help you uncover bugs and issues in the original regular and italic, which will have previously escaped your notice. So waiting to finish the family will lead to a higher-quality initial release.\n\n"
    },
    {
      "time": "18 Dec 2014 — 11:25am",
      "content": "Once you release part of the typeface, it pretty much locks you into the design. Six months from now, as you're working on the other weights, you'll be kicking yourself for not having made the bowls rounder or the corners sharper or the descenders shorter or whatever -- only it'll be too late to change it.\n\nThen again, putting what you have out there now will give you some insight into whether or not it's worth the effort to create all those additional variations in the family.\n\n"
    },
    {
      "time": "23 Dec 2014 — 5:14pm",
      "content": "> Then again, putting what you have out there now will give you some insight into whether or not it's worth the effort to create all those additional variations in the family\n\nNot necessarily. I can imagine a lot of typefaces aren't purchased simply because they lack weights and styles. For example, unless it's for display use I have no use for a typeface that only consists of Regular and Italic. I've never purchased a non-display typeface that lacks a bold weight. I can imagine the more fonts the typeface features, the higher the potential that it will sell.\n\nI'm actually in a similar situation. I designed two typefaces of 3 weights each. I have the design for the italics ready but haven't turned those into fonts yet except for Light Italic, which is not done yet. I currently have other things to work on so it may take some months before the italics are added. Both typefaces are related though, so finishing the italics for one of them means most of the work is done for the other as well.\n\nAdded to the situation is the fact that one of these typefaces was for a client and he has exclusivity on it for a year. I haven't been payed for the exclusivity agreement though (at the time I thought it was standard that the client who pays for the design has exclusivity for a while, or he would be spending a lot of money on a design that is going to be available to others for little money) and no contract was made for such an agreement, but I don't want to be unethical so I'm sticking to the agreement. But this does mean that if I would like to release both typefaces together—which seems to be the best choice—I will have to wait one more year. This gives me the time to finish the italics, but I don't like the fact that three of my fonts are just catching dust. Six fonts if you consider that there is no official agreement on the exclusivity deal.\n\n"
    },
    {
      "time": "4 Jan 2015 — 11:11pm",
      "content": "Agreed that the number of styles is part of the versatility of the typeface, and that people will choose (or not choose) typefaces based in part on this. Most especially for text faces.\n\n"
    },
    {
      "time": "5 Jan 2015 — 8:22pm",
      "content": "Hmmm, I didn't notice that only the regular and italics were finished. I guess that I just assumed there would be at least a regular, bold and italics of each. So no, I wouldn't release anything that might pass as a text face without the bold weights. A display face, maybe, but it would depend.\n\nAs for the heavy, light, thin, medium, demi, condensed, expanded or whatever, I don't think it's as important to release them all at once. It's true that purchase decisions are often made on how many variants are in the family (at least I do). Even if buying only the bold and italic, I'll want to know that more flexibility is an option if needed down the road.\n\nThat said, assuming regular, bold and both italic weights are available, and if a bigger family isn't in the offing for a year or so, I'm not sure it's as big of a concern. Sure, a few sales would be lost by releasing only a partial family, but they'd also be lost by holding off.\n\nI'm making a similar decision myself, I'm just finishing up the four base fonts in a family, but plan on building both heavy and light versions. With close to 800 glyphs in each, the thought of waiting versus seeing some sort of return on all the work is a tough one. I seem to be learning more toward holding off, though — for all the reasons mentioned in my previous post.\n\n"
    }
  ]
}
