{
  "id": "122086",
  "title": "Electric Bicycle Company Text Font",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "I was working on a logo for an electric bicycle company and after drawing the few glyphs needed for the logo, I thought it would be interesting to flesh out the whole font. I was thinking that making the tops and bottoms of the glyphs line up horizontally with no overshoots would give the thing a lot of forward momentum. And I am hoping it might work well as a web font (for not real large copy blocks) since there will need to be very little hinting. I am liking it but it is still early in the design stage so it's a good time for a critique.\n\n| Attachment | Size |\n| --- | --- |\n| [ElctrcBike.png](http://web.archive.org/web/20150317181222/http:/typophile.com/files/ElctrcBike.png) | 70.2 KB |\n\n",
  "author": "Robby Woodard",
  "time": "18 Dec 2014 — 9:50am",
  "uid": "703",
  "comments": [
    {
      "time": "18 Dec 2014 — 1:50pm",
      "content": "K, k: Pull in the arm and/or push out the leg.\n\n"
    },
    {
      "time": "19 Dec 2014 — 1:27am",
      "content": "I like the font with something new around every bend - but the overall pattern is square. No problem - vehicles such as bikes with square wheels are technically possible! Really:  \n [http://cyberneticzoo.com/walking-machines/1954-square-walking-wheel-albe...](http://web.archive.org/web/20150317181222/http:/cyberneticzoo.com/walking-machines/1954-square-walking-wheel-albert-sfredda-american/ \"http://cyberneticzoo.com/walking-machines/1954-square-walking-wheel-albert-sfredda-american/\")\n\n"
    },
    {
      "time": "19 Dec 2014 — 6:58am",
      "content": "I actually like the way the strokes of the k's are flush right. But I agree there is something a little uncomfortable about them.\n\nI have increased the angle of the arms a bit and I think they look more K-ish now.\n\nI may push them around a bit more when I look at everything in context.\n\n ![](http://web.archive.org/web/20150317181222im_/http:/typophile.com/files/k_6070.jpg)\n\n"
    },
    {
      "time": "19 Dec 2014 — 9:05am",
      "content": "Thanks, Vladimir. The engineers I am working with got a kick out of the square wheels link.\n\nThe supporting graphics all around this font will be round, round, round. I thought a square based font would contrast that. And I was hoping that the sharp edged base lines and cap and x heights might give a strong sense of horizontal motion. Or speed even.\n\nInstead of wheels, I was kind of basing the letter shapes on the tubing that bicycle frames are made from. Evenly weighted strokes with apparent geometric circular bends.\n\n\"Apparent\" being the key word. I know actual geometric circles coming off straight edges look abrupt and need to be adjusted optically. I had to do a LOT of that kind of adjusting with these shapes and I did it mostly by feel.\n\nI was wondering if there was any agreed upon formula for these kind of optical adjustments or does everybody just futz with things until they feel right?\n\nBTW, Vlad, I LOVE your magical pen stereoscopic drawings! Is there anywhere I might see more of them?\n\n"
    },
    {
      "time": "19 Dec 2014 — 9:19pm",
      "content": "Of course I was only kidding about a wheel-like font. One does not want to be too literal like in this bicycle font!  \n [http://www.wielertaal.nl/2011/02/16/bicycle-font-bicycle-typogram/](http://web.archive.org/web/20150317181222/http:/www.wielertaal.nl/2011/02/16/bicycle-font-bicycle-typogram/ \"http://www.wielertaal.nl/2011/02/16/bicycle-font-bicycle-typogram/\")  \nThanks about the 3D work!\n\n"
    }
  ]
}
