{
  "id": "122168",
  "title": "The distinction between transitional and didone",
  "forum": "Design",
  "tags": [
    "didone",
    "transitional",
    "Design"
  ],
  "content": "I saved pictures from typefaces from the foundry Swiss Typefaces and I always sort out the pictures I save according to category so I can find everything back on my computer. Now, I have a bit of trouble with categorizing two of their typefaces: [Romain](http://web.archive.org/web/20150317180456/http:/typophile.com/wiki/https%3A/%252Fwww.swisstypefaces.com/fonts/romain/) and [Sang Blue](http://web.archive.org/web/20150317180456/http:/typophile.com/wiki/https%3A/%252Fwww.swisstypefaces.com/fonts/sangbleu/), which are both related. I have the feeling it's just the contrast that makes me think they're didone-like, while the model is actually transitional.\n\nThe design of both typefaces is obviously inspired by Romain du Roi, which I always thought of as a transitional typeface (though exploring the boundaries thereof as it clearly takes things further than Baskerville). Gert Wiescher designed a digital version called Royal Romain, which on MyFonts is tagged as Bodoni (which I don't quite see, but I suppose it could just refer to Giambattista Bodoni's work in general) and Didone. On Wiescher's website his Royal Romain is labeled under \"Antiqua fonts\".\n\nSo how would you label these typefaces? I think the flat top serifs give the designs a didone atmosphere, but they're less mechanical and lack the teardrop terminals usually associated with the didone style. Am I right to consider these typefaces to be transitional?\n\nAlso, where exactly do you draw the line, or is there simply no line? I recently stumbled upon [Valentina](http://web.archive.org/web/20150317180456/http:/pedroarilla.com/en/valentina), which I would consider a didone but it's clearly blurring those lines quite a bit.\n\n",
  "author": "Martin Silvertant",
  "time": "23 Dec 2014 — 12:47pm",
  "uid": "52182",
  "comments": [
    {
      "time": "24 Dec 2014 — 12:31am",
      "content": "According to Ralf Herrmann, le Romain du Roi, with its geometric construction, is the seed from which the moderns evolved: [https://www.youtube.com/watch?v=FWOlltzqo1w](http://web.archive.org/web/20150317180456/https:/www.youtube.com/watch?v=FWOlltzqo1w \"https://www.youtube.com/watch?v=FWOlltzqo1w\")\n\n"
    },
    {
      "time": "24 Dec 2014 — 7:20am",
      "content": "Thanks for the video. That's very interesting. I still don't quite see it as just to call Romain du Roi a proper didone though. To me it seems like a bridge from transitional to didone. It would almost be deserving of its own style name, if only there were more typefaces like it. It's actually quite strange that this style was \"developed further\" rather than reproduced like the styles that came before it.\n\nI guess perhaps the style saw a quick development because of technological advances; as far as I know Baskerville was also an experiment to seek out the limits of design and technology, and after Romain du Roi it was important to take it an extra step further, rather than stick with a style that perhaps was seen as perfect in its own right. This is pure speculation from my part. Does anyone know why it's not a widely seen style?\n\n"
    },
    {
      "time": "24 Dec 2014 — 11:09am",
      "content": "Because of the capital-ish serifs atop lower case ascenders, /i and /j. And that funny “tick” halfway up the /l.\n\n"
    },
    {
      "time": "24 Dec 2014 — 12:45pm",
      "content": "I heard you like transitions.\n\n"
    },
    {
      "time": "24 Dec 2014 — 1:53pm",
      "content": "> Because of the capital-ish serifs atop lower case ascenders, /i and /j. And that funny “tick” halfway up the /l.\n\nBut that's exactly why I admire it.\n\n"
    },
    {
      "time": "24 Dec 2014 — 2:06pm",
      "content": "Well, aside from considerations on how accomplished a design it was or wasn’t, IIRC there also the fact that it was expressly made only for royal approved use, and copies of it were prohibited.\n\n"
    },
    {
      "time": "29 Dec 2014 — 3:23pm",
      "content": "> Now, I have a bit of trouble with categorizing two of their typefaces: Romain and Sang Blue, which are both related.\n\n¶ Based on the serif style, _Romain_ is a transitional and _Sang Bleu_ is a modern.  \nBoth are hybrid, post-modernistic typefaces.\n\n¶ _Sang Bleu_ features the trade mark of the French Royal Printing House on the lower-case \"l\" called the \"sécante\".\n\n¶ Swiss designer François Rappo used to fashion his own version of _Romain du Roi_ called _LaPoliceBP_ that he removed from the market.\n\n¶ Don't foget that the original _Romain du Roi_ was digitized by Frank Jalleau in 1995 at the I.N.\n\n"
    },
    {
      "time": "10 Jan 2015 — 10:41am",
      "content": "> Based on the serif style, Romain is a transitional and Sang Bleu is a modern.  \n> Both are hybrid, post-modernistic typefaces.\n\nWhat difference do you see in serif style between Romain and Sang Bleu?  \nTo me the it looks exactly the same.\n\nFor me Didones represent a pointed pen contrast, which Romain clearly isn't.\n\nI think you shouldn't waste time on these classifications systems, they are really limited and outdated. They're necessary to give some initial understanding to students and beginners, but otherwise, describing typefaces by characteristics and other elements such as time of creation, epoch, country, mixes of influences… makes more sense to me – and is much more interesting – then trying to make them fit into boxes with essentially historical parameters. What happens with boxes is you always end up with boxes for \"whatever don't fit in those other boxes\".\n\nAlso, the tags on myfonts don't mean much. Essentially it just means the designer hopes somebody searching bodoni will find his font and like it.\n\nValentina feels like a mix of Bodoni and Fleischmann.\n\n"
    },
    {
      "time": "10 Jan 2015 — 2:35pm",
      "content": "> I think you shouldn't waste time on these classifications systems, they are really limited and outdated.\n\nI agree they are limited, but still very useful. Any model is limited but useful. As for classification systems being outdated, I have two responses to that. Firstly, I was making a consideration of classification about a typeface based on a historical one, so at least within this context the type classification system is not outdated. As for when it does seem outdated, how about upgrading the type classification system?\n\nI'm very aware of the limitations of classification systems, how some typefaces don't fit within certain classifications\\* and how predominantly new typefaces tend to not fit nicely within classes any longer. They're still working very well for me though and serves as a basis for all the characteristics and elements you mention. A type classification system and the rest you mention are not mutually exclusive. A type classification system should probably stand at the base of the rest you mention.\n\n\\*This doesn't happen as often as you might expect, as I currently have over 2500 pictures of typefaces sorted on my computer according to my own classification system with only 93 pictures in a miscellaneous folder. That amounts to 16 typefaces, and it's not like I didn't know how to classify them, but rather the miscellaneous folder includes display typefaces of varying classifications which I could have sorted among the other folders but I like to keep them in a distinct folder because the designs are distinct.\n\nThe greater the amount of pictures within a category, the larger the need for sub-categories. This is how classification systems inherently work. The fact that current type classification systems are outdated is because it will be in hindsight that we will achieve the insight to classify them. Regarding the serif category the last sub-category I use (counting the slab serifs as a distinct model with its own sub-categories ) after \"didone\" is \"contemporary\", which at the moment is indeed an arbitrary category which fails to define the style in strict terms, but if or when we will be working with a new style, all typefaces designed currently which I couldn't fit into the historical categories will be redefined. Not using classification systems because they're outdated seems silly. You're essentially saying not to use any models at all when one model is outdated.\n\n> describing typefaces by characteristics and other elements such as time of creation, epoch, country, mixes of influences… makes more sense to me – and is much more interesting\n\nI agree, but it's not an option between all these elements and a type classification system. In fact, the classification system is based on that and only serves as a model to get more insight. By looking at all the other information I can validate aspects of the typeface in regard to the model or realize in what ways the typeface deviates from the model and why, and this in turn will give a lot more insight into the typeface than \"merely\" looking at the time and country it was created in.\n\n> What happens with boxes is you always end up with boxes for \"whatever don't fit in those other boxes\".\n\nHow is that an argument against it though? Models are inherently incomplete or not fully descriptive of reality. That's why they're models. When the quantity within a certain (arbitrary) category becomes great enough you will achieve new insights regarding how they could be defined and categorized. For me the problem is not necessarily how to categorize the miscellaneous designs, but how to name these new categories.\n\n> Also, the tags on myfonts don't mean much. Essentially it just means the designer hopes somebody searching bodoni will find his font and like it.\n\nI'm aware they don't necessarily mean much because it's generally not professional type designer and researchers that are tagging typefaces. The end users mostly tag, and so there are often tags being included which say something about the design but are not proper categories, and indeed you will sometimes find mistakes or loose associations in the tags as well. And yet, all these tags together can be somewhat descriptive of the typeface and offer (loosely) associated typefaces as well. I do find it useful to look at the tags, but also questioning them. I certainly don't confuse these tags to be a historical classification system though. It's not much more than a search system which is only partially based on the terms grounded in historical classification systems.\n\n"
    }
  ]
}
