{
  "id": "122172",
  "title": "Typenovas",
  "forum": "Design",
  "tags": [
    "implosion",
    "Nova",
    "type",
    "Design"
  ],
  "content": "I don't want to make a habit out of posting random designs, but I figured some of you may take take some enjoyment in seeing this. I took several letters from my typeface Baran and made these abstract illustrations. They're like type implosions.\n\nTypenova I features /a and /e.\n\n ![](http://web.archive.org/web/20150317151017im_/http:/typophile.com/files/Typenova%20I%20small_6346.jpg)\n\nTypenova II features /g, /s and /x.\n\n ![](http://web.archive.org/web/20150317151017im_/http:/typophile.com/files/Typenova%20II%20small_4068.jpg)\n\nTypenova III features /y, /d and /i.\n\n ![](http://web.archive.org/web/20150317151017im_/http:/typophile.com/files/Typenova%20III%20small_5253.jpg)\n\n",
  "author": "Martin Silvertant",
  "time": "23 Dec 2014 — 11:13pm",
  "uid": "52182",
  "comments": [
    {
      "time": "6 Jan 2015 — 9:29am",
      "content": "it will much meaningful if you take the letters from a word, like /g, /o, and /d or /s, /e, and /x\n\n"
    },
    {
      "time": "6 Jan 2015 — 11:39am",
      "content": "Veer published some lovely typographic “screensavers” 15 years ago.  \nThis symmetry reminds me of one they did for Morphica, in which all 26(?) letters were layered on top of one another, centred, semi-transparent.\n\n"
    },
    {
      "time": "10 Jan 2015 — 1:06pm",
      "content": "Meaning doesn't seem relevant to me in this case, however I do like the notion of using full words as a way to project an identity onto the designs. Like, you could entitle these \"god\", \"sex\" etc. rather than using arbitrary titles.\n\nThe series would probably get meaning by doing it over and over again, and the series wouldn't be particularly interesting until it's a big collection. If I were to do that, than certainly it seems a smart idea to use words rather than arbitrary letters.\n\n> Veer published some lovely typographic “screensavers” 15 years ago.\n\nThat's interesting, because I made a consideration of whether I should continue this series considering that technically these designs are not impressive at all right now. They would have been far more impressive 15 years ago. But as I said, this series could become interesting with quantity.\n\n"
    }
  ]
}
