{
  "id": "122101",
  "title": "DTL OTMaster 5.0 released",
  "forum": "Release",
  "tags": [
    "dutch type library",
    "editing",
    "FontLab Ltd.",
    "OpenType",
    "OT Layout features",
    "SFNT",
    "truetype",
    "URW++",
    "Release"
  ],
  "content": "A new version of DTL OTMaster (OTM), the highly sophisticated tool for reviewing, editing, and altering tables and glyphs of fonts with a SFNT-ﬁle structure, has become available since today. OTM is a must-have for professional font developers. To quote Adam Twardoch, product and marketing manager at Fontlab Ltd.: ‘_OTMaster works with surgical precision: it will only modify the portions of the font that the developer wishes, leaving all other structures unchanged. This makes OTMaster a great companion to any font editor and an indespensable element even in the most complex OpenType font production workﬂow._’\n\n ![](http://web.archive.org/web/20150317102549im_/http:/typophile.com/files/OTM_5_illu_1_5180.jpg)\n\nVersion 5.0 contains a range of additional functionality, among which:\n\n— New powerful _Text Viewer_, which includes Harfbuzz for the interpretation of OpenType Layout features. It contains a nice three-state features selector (on / default / off).  \n— Support for all the competing color OpenType font extensions: Microsoft’s ‘COLR’/‘CPAL’, Adobe’s ‘SVG’, Apple’s ‘sbix’, and Google’s ‘CBDT’/‘CBLC’.  \n— Updated _Font Viewer_, containing now a search ﬁeld for glyphs, unicodes...  \n— Updated _Side by Side Viewer_, which contains among other new options, a ‘Winding ﬁll’ as opposed to the standard ﬁll option.  \n— Enhanced and now fully mature _Glyph Editor_ (basically a compact version of DTL FontMaster), with improved guideline and grid functionality, improved measurement options, new clipboard with support for multiple entries, etcetera, etcetera.\n\n ![](http://web.archive.org/web/20150317102549im_/http:/typophile.com/files/OTM_5_illu_2_6342.jpg)\n\nDTL OTMaster 5.0 is available for Mac OS X, Windows and Linux. Please note that because of the inclusion of Harfbuzz the lowest supported Mac OS X version is Lion (instead of Snow Leopard in case of version 3.7) now.\n\n ![](http://web.archive.org/web/20150317102549im_/http:/typophile.com/files/OTM_5_illu_3_3571.jpg)\n\nFrom today on until the 6th of January 2015, OTM 5.0 can be purchased with a special 25% _Christmas-holiday_ discount. Current 3.7 licensees are eligible for an upgrade against € 7.50 administration and handling costs. FontLab Ltd. customers can do this via FL Ltd.’s [website](http://web.archive.org/web/20150317102549/http:/www.fontlab.com/content/view/319/191/) and DTL customers can apply for this via DTL’s [FontTools shop](http://web.archive.org/web/20150317102549/http:/www.fontmaster.nl/Shops/FM_Shop/index1.html). Registered users owning any other previous versions can upgrade for € 50.\n\n ![](http://web.archive.org/web/20150317102549im_/http:/typophile.com/files/OTM_5_illu_4_5953.jpg)\n\nDTL OTMaster can be purchased directly from FontLab Ltd. and DTL’s FontTools shop (web adresses are mentioned above).\n\n",
  "author": "blokland",
  "time": "19 Dec 2014 — 4:51am",
  "uid": "1688",
  "comments": [

  ]
}
