{
  "id": "122283",
  "title": "Logo Redesign/Realign Starting Point",
  "forum": "Design",
  "tags": [
    "blackletter",
    "handdrawn",
    "logo",
    "redesign",
    "Uncial",
    "Design"
  ],
  "content": "Good day everyone,\n\nI have been considering a realign of my families brand for a few years, and the legibility of the current logo has recently been discussed and not being ready for moving into a larger market, which we are considering.\n\nI am an amateur at this, and before I go stumbling through this process, I was wondering if you all had any suggestions on where to start.\n\nThis is what I am starting with: [http://i.imgur.com/gsk45Dz.jpg](http://web.archive.org/web/20150317175434/http:/i.imgur.com/gsk45Dz.jpg \"http://i.imgur.com/gsk45Dz.jpg\")\n\nFor some background, this was hand lettered by a calligrapher friend of my Mother's about 20 years ago, and I was put in charge of digitizing it for advertising. I made a vector version in Illustrator 3, and stayed as true to the original as possible, even the uneven curves. As we have moved to the web, and billboards, the vector version has been updated to be a bit more legible, lightening the accent lines, and bringing a bit of depth into the main letterforms at the request of my family members (I like it just flat black).\n\nWhat I am looking for is a typographic direction to move in to retain the character, but increase legibility and refresh the brand a bit. There are some bits that seem based on the Blackletter Rotunda style, with a heavy Uncial primary character, but I am at a loss for what I should be looking for to replace it or at least to clean it up.\n\nI have considered replacing it entirely, and just finding a good pseudo-Uncial to work with, or modernizing it and making a nice and clean logotype without the baggage, so to speak. There are a lot of people I know of and respect on these boards, and I am just looking for a bit of guidance before it hit the big-bad dark forest alone.\n\nThanks very much in advance,  \nA type-piker.\n\n",
  "author": "lunyboy",
  "time": "1 Jan 2015 — 10:23am",
  "uid": "7323",
  "comments": [
    {
      "time": "1 Jan 2015 — 2:13pm",
      "content": "Or you could keep the Initial Letters and combine them with something (This is with Tranjanus Bold Italic)\n\n ![](http://web.archive.org/web/20150317175434im_/http:/typophile.com/files/screenshot_01_3568.jpg)\n\n"
    },
    {
      "time": "1 Jan 2015 — 1:46pm",
      "content": "You might want to back up a step or two and ask yourself what personality your business has, what personality you want it to have and what audience you're targeting.\n\nNot knowing anything about your your jewelry business, I really can't say what's appropriate. Your existing logo, however, is complicated and nostalgic. I hope this doesn't come out wrong, but it doesn't say jewelry to me as much as it suggests old-fashioned confectionaries, sarsaparillas, horseless carriages and my great grandfather's antique pocket watch.\n\nIf that's the look that you want and feel is most appropriate for your business, great; it's probably time to think about cleaning up the lettering a bit. On the other hand, if the business might benefit from something a bit more contemporary and more apt to appeal to a younger target audience, you might want to consider a more fundamental redesign.\n\nWould an old-fashioned look be most appropriate, or should it be a bit more modern? Should it be sleek and svelte or elegant and elaborate? Should it appeal to wealthy 50-somethings or style-conscious, but not-quite-so-wealthy 30-year-olds? I guess what I'm saying is that it generally helps to decide on a destination before changing one's clothes.\n\n"
    },
    {
      "time": "1 Jan 2015 — 1:54pm",
      "content": "@ Bojev\n\nThat ain't no 'Stone Informal', that would be 'Trajanus - Bold Italic'\n\n"
    },
    {
      "time": "1 Jan 2015 — 2:14pm",
      "content": "Very good catch Les, typed wrong font off list - will fix it above.\n\n"
    },
    {
      "time": "1 Jan 2015 — 6:35pm",
      "content": "Agree with Thylacine's comments.\n\nIt's difficult to judge a logo without knowing much more about your company, the style of your shop, your future plans, your competitors, etc.\n\nIt looks very old-fashioned. If you have a quaint, old-fashioned store that might be appropriate. But if that's not the image you're looking for, a fresh start might be more appropriate than tweaking the old one.\n\n"
    },
    {
      "time": "2 Jan 2015 — 5:25am",
      "content": "My thoroughly inexpert comment would be to look at the various Andron variants. Yes, Hr. Stötzner, I’m talking about your stuff.\n\n"
    },
    {
      "time": "2 Jan 2015 — 8:49am",
      "content": "Thanks for the feedback, and to answer your questions about tone and theme, I think we are wanting to move in a more \"modern\" and \"sophisticated\" direction, while maintaining a tie to the pseudo-Victorian flavor, since we specialize in antique jewelry.\n\nI attempted to examine the House Luxury typefaces for a possible replacement, but their licensing seems to be a bit... difficult, considering this will be going on ring boxes, bags, identity stationery, and signage at least. I even looked at generic solutions to just increase legibility at a distance with engraving-based type, which instead of making it look more refined, only served to make it look pedestrian.\n\nAt any rate, thanks very much, I will wrestle with this some more, and if anyone has any more suggestions, they will all be accepted thankfully and thoughtfully.\n\nThanks,  \nA Letter-Err-er\n\n"
    },
    {
      "time": "2 Jan 2015 — 9:39am",
      "content": "Keep in mind that you'll want all your materials to coordinate -- logo, stationary, website, advertising, signage, etc.\n\nYou might consider hiring a good local graphic designer. Some of your business associates might have recommendations. If money is tight a graphic design student at a nearby college might take it on for a minimal fee.\n\n"
    },
    {
      "time": "2 Jan 2015 — 6:38pm",
      "content": "Actually, I am a fairly competent graphic designer, and have been diligently working on this for some time. I just was curious if the typographic professionals could see something I can't with this.\n\n"
    },
    {
      "time": "3 Jan 2015 — 3:12am",
      "content": "> I am a fairly competent graphic designer\n\nI’m afraid here calligraphy and lettering skills are needed first.  \nAdding to what was already said, I think the mark needs to be redrawn, regardless of if or how much you want to “modernise” it. If anything the curves on the initials need to be cleaned up (or, if deemed appropriate, given a proper quill/brush rough effect), and the repeating letters need to be harmonised.  \nThat said, I like the overall lombardic feel of it, and think that, if you restrain its swirls a bit, the |A| would make a very nice mark/punch for jewellery.\n\n"
    },
    {
      "time": "25 Feb 2015 — 12:34pm",
      "content": "Sorry to bump an old thread but if you're wanting to clean it up i'd personally remove the grey decorative stuff from the logotype and maybe simplify and reduce the flourishes on the capital letters. Neaten up the curves of all the letters and maybe try increasing the contrast between stroke widths.\n\nThe 'n's look very gaelic rather than germanic in the original example. Maybe have a search for some contemporary celtic / gaelic uncial type for some inspiration.\n\n"
    }
  ]
}
