{
  "id": "122219",
  "title": "Italian script XIX century",
  "forum": "General Discussions",
  "tags": [
    "#script",
    "General Discussions"
  ],
  "content": "I'm looking for examples of ITALIAN script typefaces from XIX century.  \nThanks for suggestions and specimens.\n\n",
  "author": "venticaratteruzzi",
  "time": "28 Dec 2014 — 11:24am",
  "uid": "27543",
  "comments": [
    {
      "time": "28 Dec 2014 — 1:40pm",
      "content": "Early, late or mid 19th century?  \nItalian script styles over 100 years would have been diverse but there would not have been a great number of metal typefaces.  \nPerhaps calligraphy and engraving might be good sources. Although much of this could be derivative of the English styles of the 18th century.  \nHere is a digital font based on a Bodoni script in a specimen book of his fonts issued in 1818 at Parma, Italy by his widow. [http://www.myfonts.com/fonts/parachute/pf-bodoni-script-pro/](http://web.archive.org/web/20150110152731/http:/www.myfonts.com/fonts/parachute/pf-bodoni-script-pro/ \"http://www.myfonts.com/fonts/parachute/pf-bodoni-script-pro/\")  \nBased on very late 19th century Italian handwriting styles, Diva by Nebiolo, as digitized by Rebecca Alaccari [http://www.myfonts.com/fonts/canadatype/diva/](http://web.archive.org/web/20150110152731/http:/www.myfonts.com/fonts/canadatype/diva/ \"http://www.myfonts.com/fonts/canadatype/diva/\")  \nDon\n\n"
    },
    {
      "time": "28 Dec 2014 — 2:01pm",
      "content": "I have no information as to whether Sackers Italian Script [http://www.myfonts.com/fonts/mti/sackers-italian-script/](http://web.archive.org/web/20150110152731/http:/www.myfonts.com/fonts/mti/sackers-italian-script/ \"http://www.myfonts.com/fonts/mti/sackers-italian-script/\") is based on 19th century Italian scripts.  \nLuc Devroye has this to say about Sackers Italian Script and the other fonts in the Sackers family of fonts:  \n---start quote---  \nThe Sackers family (Monotype, and before that Agfa) contains a gorgeous tall-legged open style, Sackers Open Antique Roman. There are also Sackers Roman, Sackers Gothic (sans), Sackers Square Gothic, Sackers English Script, Sackers Classic Roman and Sackers Italian Script subfamilies. As a whole, this is an elegant but curious collection. There are few clues as to its origins, which may be a bit louche because we can easily recognize Engravers Gothic in the Sackers Gothic, for example. All typefaces look like they originate in the 19th century, and started probably out as engraved (copperplate) lettering. Monotype has these families: Sackers English Script, Sackers Gothic Light, Sackers Gothic Medium, Sackers Heavy Gothic, Sackers Heavy Roman, Sackers Italian Script, Sackers Light Classic Roman, Sackers Light Roman, Sackers Open Antique Roman, Sackers Solid Antique Roman, Sackers Square Gothic. Any information is welcome.  \n---end quote---  \n [http://luc.devroye.org/calligraphy.html](http://web.archive.org/web/20150110152731/http:/luc.devroye.org/calligraphy.html \"http://luc.devroye.org/calligraphy.html\")  \nDon\n\n"
    },
    {
      "time": "28 Dec 2014 — 2:19pm",
      "content": "Thanks, I'm really looking for something like this \"Sackers Italian Script\"... I would like to imagine an italian context from around 1830-40...\n\n"
    }
  ]
}
