{
  "id": "122376",
  "title": "The Black Javanese Letters",
  "forum": "Design",
  "tags": [
    "blackletter javanese fusion",
    "Design"
  ],
  "content": "Hi folks,\n\nI submitted my poster to a Typoday competition, India. But seemingly not to be announced as finalist. Here i would like to share the type design (not the whole poster), to all of you. So i would like to get the commentary.\n\nI inspired by a very old poster to celebrate Wilhelmina Queen in Dutch Colonial era in Java. One best thing Dutch people do that time is they conserved our indigenous writing system. Fuse it with European style, ie Blackletter. So i do that again in the modern days. I hope you like it, and comment it.\n\nP.S:  \nThe phrase \"měmayu båwånå\" is taken from famous Javanese proverb \"měmayu hayuning båwånå\" which means \"to make the beauty of universe more beautiful\"\n\n ![](http://web.archive.org/web/20150317153403im_/http:/typophile.com/files/javanesescript_3721.jpg)\n\n",
  "author": "Gunarta",
  "time": "6 Jan 2015 — 10:19am",
  "uid": "89178",
  "comments": [
    {
      "time": "6 Jan 2015 — 9:08pm",
      "content": "Interesting!\n\nSo this writing system is no longer in use?\n\nhhp\n\n"
    },
    {
      "time": "6 Jan 2015 — 11:30pm",
      "content": "Thanks @hrant\n\nit's very limited in use. We are officially use Latin. I'm one of minority who help to recovering this writing system.\n\n"
    },
    {
      "time": "7 Jan 2015 — 8:36am",
      "content": "Good luck! We need such efforts.\n\nhhp\n\n"
    },
    {
      "time": "17 Jan 2015 — 10:39pm",
      "content": "Very interesting.\n\n> We need such efforts.\n\nWhy? I don't think I would use the word \"need\" here.\n\n"
    },
    {
      "time": "18 Jan 2015 — 7:08am",
      "content": "Well, reviving dormant writing systems is needed more than reviving typestyles.\n\nhhp\n\n"
    },
    {
      "time": "18 Jan 2015 — 7:29am",
      "content": "How would you argue that?\n\n"
    },
    {
      "time": "18 Jan 2015 — 7:34am",
      "content": "It can open a world of stories, and stories of shapes.\n\nhhp\n\n"
    },
    {
      "time": "18 Jan 2015 — 8:19am",
      "content": "Culture is one field in which preservation is a basic principle.  \nSince a writing system, just as a language, is a living thing, a meaningful preservation would entail using it.\n\n"
    },
    {
      "time": "18 Jan 2015 — 8:53am",
      "content": "> Since a writing system, just as a language, is a living thing, a meaningful preservation would entail using it.\n\nThat's what I would think. Its relevance is predominantly dictated by its prevalence and use, whereas Hrant seems to imply we have a need for it regardless of prevalence and use.\n\n"
    },
    {
      "time": "18 Jan 2015 — 9:02am",
      "content": "A writing system doesn't have to be currently used to be educational. Also, Hebrew was dormant for a long time.\n\nhhp\n\n"
    },
    {
      "time": "18 Jan 2015 — 9:49am",
      "content": "> Its relevance is predominantly dictated by its prevalence and use\n\nI would beg to differ. For oh so many reasons!\n\n"
    },
    {
      "time": "19 Jan 2015 — 7:07am",
      "content": "> A writing system doesn't have to be currently used to be educational.\n\nI didn't say it isn't educational. I question its objective relevance.\n\n> I would beg to differ. For oh so many reasons!\n\nCould you name a few?\n\n"
    },
    {
      "time": "19 Jan 2015 — 11:05am",
      "content": "> Could you name a few?\n\nBecause culture thrive in diversity.  \nThe value of a cultural artefact couldn’t be measured on “prevalence”.  \nAs I already said, preservation is the most important thing: without it there’s no sense of history. And, to clarify my first post, I meant the term “using” in a broad sense: the poster submitted by Gunarta is a way to keep an old writing system alive even if it’s not generally used.\n\n"
    },
    {
      "time": "19 Jan 2015 — 11:26am",
      "content": "I see its historic value, but when someone says we <cite>need</cite> (as opposed to want) to recover old writing systems no one uses anymore I question that. I must clarify though that I make a distinction between understanding a writing system and using it. I can see the relevance of understanding a writing system and mining the information within it, but I don't see how we <cite>need</cite> to revive such systems. Culture thrives on diversity, but there are also reasons why certain writing systems are abandoned. In that regard its relevance is predominantly dictated by its prevalence.\n\n"
    },
    {
      "time": "19 Jan 2015 — 11:29am",
      "content": "And for the record, I do praise these kind of efforts. I only question how large the group is that benefits from it. I suppose you can't necessarily foresee that, as a writing system just might get in use again. Probably not a blackletter fusion though. But it looks cool in any case. I would love to see longer texts set in this. It might just convince me.\n\n"
    }
  ]
}
