{
  "id": "122345",
  "title": "Does Constructivism art (esp. typography) correlate Communism?",
  "forum": "General Discussions",
  "tags": [
    "communism",
    "constructivism",
    "General Discussions",
    "history"
  ],
  "content": "Hi folks,\n\nI was currently in such brainstrorming about ideas of thesis/research as communication student. I found phenomenon that constructivism typography are famous and strongly applied among Indonesian proletariat. Due to Indonesia was the third biggest communist nation after Soviet and China, (but now we are adopting American democracy, capitalism and liberalism). Is it having relationship between constructivism and communism as ideology. Does Constructivism art (esp. typography) correlate Communism?\n\nThanks,  \nGunarta\n\n",
  "author": "Gunarta",
  "time": "5 Jan 2015 — 12:14pm",
  "uid": "89178",
  "comments": [
    {
      "time": "5 Jan 2015 — 12:57pm",
      "content": "Historically, it does.\n\n"
    },
    {
      "time": "5 Jan 2015 — 2:39pm",
      "content": "Maybe you will be interested in El Lissitzky's essay _[Our Book](http://web.archive.org/web/20150425090531/http:/www.iheartcd.com/ourbook/)_.\n\nYou could also read Jan Tschichold's preface to _The New Typography_ (_The New World View_).\n\nAlso Tschichold wrote the essay _Wirken sich gesellschaftliche und politische Umstände in der Typographie aus?_ (_Does Political and Social Context Influence Typography?_), but, it seems, it is not translated to English.\n\nOf course, it does.\n\nConstructivism is connected with communist ideas same way as neoclassicism of 20th century is connected with totalitarianism and fascism, or as romanticism is connected with French Revolution... But it's too general conclusion.\n\nCould you show some examples of Indonesian constructivism?\n\n"
    },
    {
      "time": "5 Jan 2015 — 2:40pm",
      "content": "In general I'd say it does, but folks who are aware of art history might look at it differently than average folks who may know little about the subject.\n\nAlso the contents of the piece will influence how people look at it.\n\n"
    },
    {
      "time": "6 Jan 2015 — 1:33am",
      "content": "these lettering are being decrased since digital/graphic design introduced. And nowadays the vernacular lettering artists are starting to adopt the appearance of digital typography, especially those faces that so pupular and bundled in Microsoft.\n\n@nivke here some\n\n ![](http://web.archive.org/web/20150425090531im_/http:/typophile.com/files/indonesianconstructivism_3449.jpg)\n\n"
    },
    {
      "time": "6 Jan 2015 — 1:36am",
      "content": "Yes. I was doubt to my self that something constructive to me actually just a simplest way of creating letters for them.\n\n"
    },
    {
      "time": "6 Jan 2015 — 2:40am",
      "content": "In effect, your samples look more “constructed“ than “constructivist”.  \nKeep in mind that the deconstruction and reconstruction of letters is a process which is always going on, in type design as well as in vernacular lettering or avant-garde art movements.\n\n"
    },
    {
      "time": "6 Jan 2015 — 7:42am",
      "content": "The constructivist aesthetic, like communism itself, reflects a sometimes-uneasy relationship between the things people make and the process of making them.\n\nConstructivist typography celebrated the fact that printing is an industrial process, unlike drawing or painting. The geometry of the constructivist poster is the mirror of the metal type locked up in the bed of the printing press. At the same time, constructivist artists set up a kind of Marxist dialectic by doing things with metal type that it wasn't designed to do, such as setting it on a curved line or a diagonal.\n\nTo my eye, the contemporary Indonesian examples don't look like the constructivist typography of early Communist-era Russia. For example, the Russian constructivists often preferred asymmetrical compositions, but the Indonesian signs are mostly symmetrical. What the Indonesian signs have in common with constructivist posters is:  \n(1) The process of making them--in this case, hand-painting--is part of the aesthetic.  \n(2) The artists use letterforms as decorative shapes, not just as pieces of words. (_Es bir kocok_ is an especially good example.)\n\nThe individuality and inventiveness of hand-painted signs has all but disappeared from the US, and it's a great loss. I hope that Indonesia doesn't see its vernacular art displaced by the ubiquitous Arial and Comic Sans.\n\n"
    },
    {
      "time": "6 Jan 2015 — 11:29am",
      "content": "IIRC this book contains the Constructivist manifesto.  \nSemantically, it’s really not at all about “constructing” block-shaped art and letter forms.  \n [http://books.google.ca/books/about/Graphic\\_Design\\_History.html?id=nvlPV1...](http://web.archive.org/web/20150425090531/http:/books.google.ca/books/about/Graphic_Design_History.html?id=nvlPV1UNcMkC \"http://books.google.ca/books/about/Graphic\\_Design\\_History.html?id=nvlPV1UNcMkC\")\n\nArchitecturally, we have the idea that construction is assembling basic rectilinear components, a Victorian idea—Paxton, rather than Nervi or Gehry.  \n [http://vintagetoyadvertisements.com/images/1944/1944%20CONSTRUCTO%20AIRP...](http://web.archive.org/web/20150425090531/http:/vintagetoyadvertisements.com/images/1944/1944%20CONSTRUCTO%20AIRPLANE%20MOTOR.jpg \"http://vintagetoyadvertisements.com/images/1944/1944%20CONSTRUCTO%20AIRPLANE%20MOTOR.jpg\")\n\n"
    },
    {
      "time": "6 Jan 2015 — 11:59am",
      "content": "Gunarta, I'm surprised that you referred to Indonesia as a formerly Communist country. If my history lessons haven't failed me, Indonesia once had a very influential Communist party that very nearly came to power in a coup during the mid 1960s. After that the party was pretty much dismantled and made illegal.\n\nAs for constructivist art and type, yes, it's associated with Communism, but it's simply a stylistic association dating back to the Bolsheviks. The example signs look to me as though they were painted that way mainly because blockish sorts of letters are easier to paint by hand.\n\n"
    },
    {
      "time": "6 Jan 2015 — 12:43pm",
      "content": "Gunarta, the signs you posted don't look Constructivist or communist to me (although perhaps in your country there are cultural associations that I don't have). The switch to digital sign making is because it's a faster and cheaper way to make signs and doesn't require the services of skilled hand letterers.\n\nIf you Google \"Constructivist Art\" and click the Images link you'll get a general idea of what this art looks like.\n\n"
    }
  ]
}
