{
  "id": "122412",
  "title": "JOB HIRING “font specialist” at Oxford University Press",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've been doing some consulting for OUP in recent months, and they have rightly come to the conclusion that they need to bring more font expertise in-house. They are hiring a \"Font Specialist/Senior Designer\" in their UK offices. Full details here:  \n [https://eu1.advorto.com/OUP/VacancyInformation.aspx?VId=18443](http://web.archive.org/web/20150414042839/https:/eu1.advorto.com/OUP/VacancyInformation.aspx?VId=18443 \"https://eu1.advorto.com/OUP/VacancyInformation.aspx?VId=18443\")\n\n",
  "author": "Thomas Phinney",
  "time": "7 Jan 2015 — 9:48am",
  "uid": "909",
  "comments": [
    {
      "time": "7 Jan 2015 — 2:11pm",
      "content": "Of course, there was the time when (presumably) they _had_ a lot of typeface expertise in-house. Thus, _The Printing of Mathematics_, was by T(heodore) W(illiam) Chaundy, a mathematician who taught at Oxford, and Charles Batey, \"printer to the University\" - and P. R. Barrett, whose role I cannot identify, but he may well have been the actual Monotype operator in the group.\n\n"
    },
    {
      "time": "7 Jan 2015 — 11:23pm",
      "content": "Mr Barrett was the specialist maths proof-reader in the printing division of OUP in Oxford, and, as a young proof-reader myself, I was privileged to know him there in the early 1980s, shortly before his retirement.\n\nThere was indeed considerable in-house expertise in the printing house, but the printing division in Oxford was to some extent separate from the publishing division, and only dealt with a small part of the total amount published by OUP in the UK. The publishing division (‘them upstairs’) had a considerable body of experts of its own. But that was a long time ago. :)\n\n"
    },
    {
      "time": "8 Jan 2015 — 7:34am",
      "content": "Thank you very much for the information! Yes, times change, and what with desktop computers and laser printers having the potential ability to put out near-professional-quality typesetting, replacing typesetters with typists was understandably an overwhelming temptation.\n\n"
    }
  ]
}
