{
  "id": "122461",
  "title": "Type on screen",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello. I'm new here- I fall in as one of those guys who's read articles occasionally the past few years and is finally posting.\n\nI'm fairly new to typography- finishing up my undergrad at the moment, and I'm having trouble learning about type on screen. I have a lot of questions, and was wondering if there are any books or articles on the subject that are worth their salt.\n\nTo be specific, I'm working on a magazine which will be released digitally, and potentially in print down the road. I'm trying to find an appropriate typeface for the body copy, but I'm beginning to see that my current methods of selection is a bit… young. Aesthetics aside at this point, where would you start if you were trying to find something intended to work well on screen? Is there a difference between type to be read on a desktop computer and type to be read on a tablet/phone?\n\nAll the best,  \n~Jordan\n\n",
  "author": "Jordan Youngberg",
  "time": "9 Jan 2015 — 10:48am",
  "uid": "218847",
  "comments": [
    {
      "time": "14 Jan 2015 — 3:12am",
      "content": "I would start with [Font Bureau's Reading Edge series of fonts](http://web.archive.org/web/20150317180346/http:/www.fontbureau.com/ReadingEdge/) and/or [Monotype's eText series of fonts](http://web.archive.org/web/20150317180346/http:/www.monotype.com/etext/).\n\nYou could also check out [Ellen Lupton's Type On Screen website](http://web.archive.org/web/20150317180346/http:/typeonscreen.info/), which also provides links to purchase the associated book.\n\n"
    },
    {
      "time": "15 Jan 2015 — 6:42pm",
      "content": "\"Aesthetics aside …\"\n\nNoooo! Aesthetics not aside! The display technology is finally mature enough that decisions about type on screen do not need to start by taking into account the weaknesses of the technology. Start by identifying a style or tone that you're looking for, as you would when designing in any other medium. Start, in other words, with the ideal. Then worry about making it work on screen.\n\nAnd to answer your second question — yes, the resolution on phones and tablets is typically higher than on computers, which is nice. But computers are catching up.\n\n"
    },
    {
      "time": "16 Jan 2015 — 8:37am",
      "content": "How will this be distributed? Some eBook formats allow the reader to choose the font.\n\n"
    }
  ]
}
