{
  "id": "122551",
  "title": "FOR SALE: Photo-Lettering, Inc ALPHABET THESAURUS Nine Thousand",
  "forum": "Release",
  "tags": [
    "1960",
    "Alphabet Thesaurus",
    "book",
    "Nine Thousand",
    "photo-lettering",
    "specimen",
    "Release"
  ],
  "content": "Hello,\n\nTo all collectors and type enthusiasts, I'm selling my pristine copy of the book listed below. I thought you guys passionate about typography might be interested to own one of the most elusive and sought-after book of typography, lettering and phototypesetting.\n\nCheck the photos from this link : [http://imgur.com/a/irOS7](http://web.archive.org/web/20150317082320/http:/imgur.com/a/irOS7 \"http://imgur.com/a/irOS7\")  \nPrice is $1000 (excl. shipping). If you are interested, please contact me from my Typophile profile page.\n\nTitle : Alphabet Thesaurus Nine Thousand  \nAuthor : Photo Lettering, Inc., 1960. PROFESSIONAL EDITION.\n\nPhoto Lettering, Inc. - ALPHABET THESAURUS NINE THOUSAND. New York. Original Edition. First Edition. Professional Edition, 1960 (at the time they were also selling a Reference Edition –abridged– sold at a cheaper price). Text in English. Some pages printed in color others in black. The cloth bound cover is lightly worn at the edges (see pictures). Binding is intact. Except one page with a side note in colored pencil (see photo), all pages are clean. A very good copy. Only one previous owner who took great care of it. A milestone of typography in the United States and worldwide. The book consists of an impressive collection of over 700 pages of original typefaces crafted by the world’s greatest letterers and artists. VERY RARE. Get your chance to own one of the most sought-after and elusive typography book.\n\nPrinted in USA.  \n12\" x 9 1/4\" x 2 1/4\" (DIN A4 format, 60mm of thickness).\n\nContributing letterers and artists for this book include : Josef Albers, Alexey Brodovitch, J. Albert Cavanagh, Joseph Binder, Edward P. Diehl, Harold Hite, Harry Winters, Albert E. Nolan, Albert Soroka, Charles J. Freericks, George Suman, Herbert Feuerhake, Pete Dom, Gustav V. Meidel, William H. Millstein, Emil A. Schaedler, M. M. Davison, Tommy Thomson, C. E. Coryn, Tony Stan, George F. Trenholm, Sol I. Immerman, Oscar Ogg, Edwin W. Shaar, Garnett Megee, Herman Spinadel, Hollis Holland, Saul Haupt, Denis A. Edridge, Sidney Lisson, Sol Nodel, J. J. Karle, James D. Brooks, Victor Lamkay, Nasri Khattar, Alfred R. Bosco, John A. Karafa, Milton Crown, L’Harl Copeland, David B. Hills, Milton K. Zudeck, Melvin M. Tuch, M. R. Kaufmann, Maximilian R. Kerr, S. E. Norton, Frederick Blakeslee, Arthur Ohlman, George Piscitelle, Rodolfo Wallenberg, John S. Allen, AND MANY MORE…\n\n| Attachment | Size |\n| --- | --- |\n| [photo 1.JPG](http://web.archive.org/web/20150317082320/http:/typophile.com/files/photo%201_13.JPG) | 441.5 KB |\n\n",
  "author": "Ian_E",
  "time": "14 Jan 2015 — 5:40am",
  "uid": "215571",
  "comments": [
    {
      "time": "14 Jan 2015 — 1:19pm",
      "content": "A number of the 1965 edition are for sale for around $225 - do not know if they have less content but have 970 pages. The one above sounds interesting but costly.\n\n"
    },
    {
      "time": "15 Jan 2015 — 1:27am",
      "content": "This edition is the very first Alphabet Thesaurus from Photo-Lettering, Inc. Released in 1960. It is the professional edition and has nothing to do with other editions. The main thing is that many alphabets found inside were not reissued in the other editions.\n\nAlso, it’s usually found in poor condition with the spine detached.\n\n"
    }
  ]
}
