{
  "id": "12265",
  "title": "Writing Systems wiki",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "While prowling in the new Typowiki (sure to be another excellent procrastination tool), I noted that there was a hesitant ‘Alphabets’ index that linked to a small number of writing systems, only some of which were actually alphabets. So I took it upon myself to retitle this [Writing Systems](http://web.archive.org/web/20051207043856/http:/typophile.com/wiki/Writing%20Systems), and to add under this general heading Abjads, Abugidas, and Alphabets, each of which I’ve populated with as exhaustive a list as I can come up with, largely thanks to the brilliant [Omniglot](http://web.archive.org/web/20051207043856/http:/www.omniglot.com/). Later I will add other classifications of writing systems under the general heading, unless someone beats me to it. In the meantime, I encourage people to start populating the wiki nodes for individual writing systems.\n\nObviously, this represents quite a lot of work, so if you have bright ideas for changes to the overall arrangement of the Writing Systems indices, perhaps you could contact me and we can discuss them — or post them here —, rather than just going and making wholesale changes to what I’ve done. Wikis still unnerve me somewhat: where’s the editor? no editor? what do you mean there’s no editor?\n\n",
  "author": "John Hudson",
  "time": "8 May, 2005 - 6:52pm",
  "uid": "1262",
  "comments": [
    {
      "time": " 8 May, 2005 - 7:39pm",
      "content": "i knew you’d come along and fix it up for me, john. thnx! ;^)\n\n"
    },
    {
      "time": " 8 May, 2005 - 10:24pm",
      "content": "I take it Katakana and Hiragana would go under Syllabaries, another top-level writing system? It looks like the omniglot people know what they’re talking about, but I’m still not completely sure that the categories are the Absolute Truth. Typographically, Hangul is composed of syllables, while Devanagari is essentially alphabetic, which strongly suggests that their classification is all about the implicit vowels. Wait a minute, what this “vowel” thing? All I see are pretty shapes :)\n\nThe typowiki is obviously going to be one of the coolest, most rocking wikis around. The combination of lots of flow through tight integration with the rest of the site, a high concentration of actual experts, and a respectful community is dynamite.\n\nWhere should I post my wishlist for the wiki? On the forum, or perhaps on another wiki node, as is often done in purist wiki sites? An item high on the list is to indicate wiki links by color, rather than the cute but distracting superscript W.\n\n"
    },
    {
      "time": " 8 May, 2005 - 10:43pm",
      "content": "Yes, I will be adding Syllabaries as another top level index.\n\nA pure alphabet has distinct symbols (letters) for consonants and vowels, both of which are _always_ written in full.\\* So Devanagari and the other Brahmic-derived scripts are not ‘essentially alphabetic’ in a pure sense, because the inherent vowel is presumed. That is the defining feature of an abugida. Hangul, on the other hand, although it is written in a way that composes letters (jamo) into syllabic blocks, is an alphabet and not a syllabary, because it is the jamo that are the basic building blocks of the script, not the syllables. One could write Hangul sequentially using jamo, like the Latin alphabet. if one were inclined to; native readers would find it very odd, of course, but the writing system permits this because it is fundamentally alphabetic.\n\n\\* This leads to some confusion in the classification of some scripts. Arabic and Hebrew are classified as abjads, i.e. cosonantal alphabets in which the writing of vowels is optional, because this is what they are when used to write the Arabic and Hebrew languages. But the Arabic script used to write Kurdish is an alphabet, as is Hebrew used to write Yiddish. Also, even for writing Hebrew, these is some limitation on the optionality of vowels, as the letter vav may be either a consonant or a vowel (holam male), and is always written even when a vowel.\n\n"
    },
    {
      "time": " 19 May, 2005 - 10:10am",
      "content": "\\> Hangul, on the other hand, although it is written in a way that  \n\\> composes letters (jamo) into syllabic blocks, is an alphabet and  \n\\> not a syllabary, because it is the jamo that are the basic building  \n\\> blocks of the script, not the syllables.\n\nI think that’s too creator-centric. There are much more readers of Hangul than makers of Hangul fonts, a script should first serve its users, and [adult] readers read the “blocks” as whole syllables\\*; so if I had to choose, I’d list it as a syllabary (with a proper elaboration on its alphabetic aspect).\n\n\\* It’s their boumas. :-)\n\nhhp\n\n"
    },
    {
      "time": " 20 May, 2005 - 2:25pm",
      "content": "Hi,\n\n<cite>One could write Hangul sequentially using jamo, like the Latin alphabet.</cite>\n\nIn Korea, it is called Segmented Writing (pul.uh.su.gi) which has been experimented and used since 1914. There are on-going debates and discussions of its use among the interests. Its research and applications have been usually for machine writing, but the idea and its actual use can be found in some extreme examples of Non-Tetragonal type of fonts. These days, the Segmented Writing is pervasive in logo types and commercial graphic design work. It is so popular that it became sort of a cliché.\n\nYes, defining Hangul either as an alphabet or a syllabary is in every ways very fuzzy.\n\nSeonil\n\n"
    },
    {
      "time": " 20 May, 2005 - 2:38pm",
      "content": "\\> it is called Segmented Writing\n\nIn “The Korean Alphabet” (Young-Key Kim-Renaud ed., 1997), Chin W Kim calls it “deblocked” (p 151), while Ross King calls it “on line” (p 225). I think I prefer “segmented” though.\n\nAnd yes, Hangul really deserves its own category… and on many levels!\n\nhhp\n\n"
    },
    {
      "time": " 20 May, 2005 - 3:02pm",
      "content": "now that’s what i call a “sticky wiki”… sorry, couldn’t help myself.\n\n"
    }
  ]
}
