{
  "id": "12279",
  "title": "modernist typeface suggestions?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello,  \nAs part of a project I've been asked to set a series of essays; two of these are on Modernism. However, each essay has to be set in a different face that echoes (or re-inforces) the topic it is speaking on. I wonder if anyone would be able to make any suggestions, as I'm having quite a difficult time selecting suitable faces!\n\n_Long Live Modernism!_ by Massimo Vignelli  \ncurrently set in Gill Sans, which is an issue - Italian-American author set in an English face, not too great a choice on my behalf. This is the one I'm having major issues setting.\n\n_The New World View_ by Jan Tschichold taken from _The New Typography_  \ncurrently set in Univers. I'm pretty settled on the setting for this one, as I feel Univers reflects the content and authorship of the essay.\n\nAny suggestions / critiques of my choices would be very helpful.\n\n",
  "author": "<a href=\"/web/20120125075525/http://typophile.com/user/7180\" title=\"View user profile.\">mb</a>",
  "time": "<br>",
  "uid": "7180",
  "comments": [
    {
      "time": "",
      "content": "Perhaps futura for the massimo vignelli piece.\n\n"
    },
    {
      "time": "",
      "content": "i'd suggest helvetica for massimo vignelli or bodoni\n\nand sabon for tschichold.\n\n"
    },
    {
      "time": "",
      "content": "Sabon would definitely be a good one for Tschichold; if you wanted to use a sans serif, this may be an option: [Tschichold](http://web.archive.org/web/20120125075525/http:/www.presencetypo.com/Pages-html/MoTs.html)\n\n"
    },
    {
      "time": "",
      "content": "thanks for the replies.\n\nI initially set the Tschichold essay in Sabon, but then discovered on further reading that 'A New World View' was taken from _The New Typography_ where he argues against serifs and for asymmetrical typography (including sans serif faces). Sabon was designed after he decided the views expressed in _The New Typography_ were a little too radical and that serifs weren't so bad after all. (All the Penguin books are set in a serif, as per his detailed instructions).  \nSo not sure whether that reflects the content as strongly. I guess ideally it would be set in the same face as _The New Typography_ but I don't have it to hand to check what it's set in! It would be quite ironic to find it set in a serif...\n\nWill try helvetica and futura for the Vignelli - at the moment I'm thinking about Hevetica Neue as Vignelli is arguing for a revival/continuation of Modernist thought and a re-worked version of a Modernist face would be quite apt for this. Although so would Futura...I didn't realise this would be so tricky...! Thanks again.\n\n"
    },
    {
      "time": "",
      "content": "oh. right! well then you \\*must\\* use a sans for the tschichold. as for vignelli, i'll reiterate that helvetica is the right choice. if you look at his work he habitually/predictably/happily used helvetica and bodoni.\n\n"
    },
    {
      "time": "",
      "content": "Saw you as I was researching, thought id say hi! Its Claire by the way. good to see you have been doing your research too.... Hope its coming along well. I have to say I have gone along with the choice of Caslon for Tschichold and Memphis for Vignelli. Im just enjoying setting the type now. Good luck!\n\nshare - [www.thisbert.co.uk](http://web.archive.org/web/20120125075525/http:/www.thisbert.co.uk/ \"www.thisbert.co.uk\") (currently in development)\n\n"
    },
    {
      "time": "",
      "content": "\"as for vignelli, i’ll reiterate that helvetica is the right choice. if you look at his work he habitually/predictably/happily used helvetica and bodoni.\"\n\nYou got that right! A Vignelli pub on Modernism set in anything else but Helvetica would be downright silly (and I don't even like Helvetica).\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "=^D\n\nBut, Chris, don't you think there is something about the way in which he uses Helvetica that makes you like it?\n\n"
    },
    {
      "time": "",
      "content": "You mean he only uses it for Barbarella posters?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Tiff,\n\nI love Massimo's work. He uses a typeface as a neutral tool and makes the page come to life with his use of space, alignment, and tension. The typeface does not do the work, Massimo does. To that end, Helvetica is a good choice (though I much prefer Univers).  \nMassimo's work would still be the same had he replaced Helvetica with either Univers or AG. I don't mean to say that it would have been better. I am just trying to say that he chose a small set of tools and used them to their fullest. That was just his way of working. I would much rather have a Vignelli piece (all done in Helvetica) hanging on my wall than any lesser designers work with all of my favorite type faces used.  \nMassimo is a Helluva' master (and he mastered Helvetica to boot).\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> The typeface does not do the work\n\nWhich of course is exactly his problem.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\"Which of course is exactly his problem.\"\n\nActually, it is not his problem, it is exactly his solution.\n\nImagine \"Jack\" was a builder in the 1950s and only had a few hand tools to work with but he was able to make sturdy, yet beautiful buildings anyway. Jack did good work because he was a master builder, not because he had a full range of tools. Let's say that we give someone of mediocre skill and talent (call him \"Bob\") a complete set of the finest power building tools our modern era can produce and have him build a house. Would you rather have the house that Bob built or the house that Jack built?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I would rather Jack use more, better, more suitable tools, assuming he could afford it.\\* I wouldn't want Jack to show off how well he can use his favorite hammer to apply mortar, only to end up with an inferior house.\n\n\\* And I don't think Vignelli couldn't afford more fonts.\n\nAs impressive as it can be to do a good job with something as restrictive and deficient as Helvetica, ignoring the expressive potential of **other fonts** is simply bad design, sorry.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\"ignoring the expressive potential of other fonts is simply bad design, sorry.\"\n\nHrant,  \nI am quite willing to allow you your opinion. I certainly don't agree with you. Massimo's work is very good design, sorry.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I'm with Chris on this one. The typeface is only part of the solution in Massimo Vignelli's work. Of course, Helvetica, out of the can, isn't such a beautiful typeface. But, Massimo Vignelli takes it to that level with how he uses it. I'd be interested to see him revisit his work with other faces to see if they still had the same feel. You are most likely, maybe, right, Chris. But, for me Massimo Vignelli is Bodoni and Helvetica.\n\n"
    },
    {
      "time": "",
      "content": "\\> I am quite willing to allow you your opinion.\n\nThank you, and same here.  \nBut do know that -just like you- I'm not alone in my opinion:\n\nHere's how the second sentence of a synopsis I just got from Oak Knoll for a new book entitled \"Book Typography\" starts: \"It examines the essential factors of a well designed book - attractive and suitable type, ...\"\n\nI'm not alone in thinking that type is the first thing a good designer worries about.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> The typeface is only part of the solution in Massimo Vignelli’s work.\n\nIt seems to be no part of the solution to me.\n\n\\> Massimo Vignelli takes it to that level with how he uses it.\n\nSo his great achievement is making Helvetica look better? Is the role of a designer to redeem fonts? Or is it to make things that express and serve.\n\nI know it's hard to admit critique of sacred cows one admires, but sometimes those cows happen to be sporting quite massive blinders. For me at least, great technique doesn't overcome using inadequate tools.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant,  \nI never thought you would be the only one with your opinion--only that you would be the most vocal in expressing it :-)\n\n\"...For me at least, great technique doesn’t overcome using inadequate tools.\"\n\nThe Great Pyramids, the Parthenon, the Trajan Column, and the Stradivarius Violin were all created with inferior tools yet great technique prevailed. Matisse, during the latter years of his life, was crippled to the point that he could only barely use crude scissors yet managed great works of art using his inadequate tools and less adequate hands. With all the computer driven knowledge and high-tech laser tools available today, there has never been a violin created to rival the 17th Century Italian masters.\n\nI much prefer greater-than-adequate skill and talent to the greatest set of tools imaginable.\n\nIf someone were to give me the most amazing surgical tools on Earth to use, I am sure you would not be willing to have me perform surgery on you. The result would surely be Grotesque (pun intended :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\"You are most likely, maybe, right, Chris. But, for me Massimo Vignelli is Bodoni and Helvetica.\"\n\nTiff,  \nYou are right about Bodoni but since the initial post said the book was on Modernism, it seemed Helvetica was much more indicative of Modernism than Bodoni--and I like Bodoni :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> ... were all created with inferior tools\n\nWhy do you say that? Is there any reason to believe they didn't use the **best available** tools? That's my point. I certainly wouldn't blame Vignelli if he only had Helvetica and Bodoni available to him. His pyramids are made of reed.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\"Is there any reason to believe they didn’t use the best available tools?\"\n\nThey used whatever tools they felt comfortable using, so did Vignelli. His pyramids are made of talent.  \nYou choose to attribute much more to tools than I feel tools merit. I prefer to attribute the majority of any success to the skill and talent of the human doing the work. A resourceful person can make do with whatever tools he chooses. A person of mediocre skills can't do Jack with the best tools ever invented. There has never been a violin to rival Stradivari's. Modern man has far better tools than Stradivari ever had but not the talent to equal his.\n\nI would be very curious to see some of your typography just to be able to see what you consider good work.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\"Comfortable using\"? That seems pretty shallow, anti-craft.\n\n\\> A person of mediocre skills can’t do  \n\\> Jack with the best tools ever invented.\n\nAgreed.  \nBut that doesn't mean Vignelli's skills at using a couple of fonts can make moot his ignorance of the full spectrum of the expressive and technical dimensions of type.\n\n\\> I would be very curious to see some of your typography  \n\\> just to be able to see what you consider good work.\n\nI suck at typography. But anyway that's beside the point.  \nThe simple truth you keep avoiding in this argument is:\n\nFONTS EXPRESS THINGS  \n+  \nHUMAN EXPRESSIONS ARE MORE THAN A FEW  \n=  \nA FEW FONTS ARE NOT ENOUGH\n\nThis is why Vignelli is limited; an artist uninterested  \nin the potential in type, just the potential in himself.\n\nhhp\n\n"
    }
  ]
}
