{
  "id": "122863",
  "title": "I'm a novice and would love some feedback",
  "forum": "Serif",
  "tags": [
    "calligraphic",
    "classic",
    "hand drawn",
    "Neoclassical",
    "new typeface",
    "Serif"
  ],
  "content": "Hello all,\n\nI'm new here and I'm also new to type design. Having said that, I've been drawing type since I was a child and eventually grew up a little and became a graphic designer along the way. My hobby is now taking a serious turn as it's about time I tried to share and even sell my typeface designs. My first attempt was a hand drawn, all caps, neoclassical serif face that I named 'Carrig'. Carrig being the Irish word for 'rock' (I'm based in Ireland) and the typeface itself was strongly influenced by classic letterforms carved into stone and weathered by time.\n\nSo, now I am developing Carrig into a full family and here, with the Roman weight, I have drawn a full set of lowercase characters to suit the style of their uppercase parents.\n\nBefore I release this to the world, I would absolutely love some considered criticism (or praise!) so that I may improve it. As I am a novice, I am a little bit wary of making \"schoolboy errors\" and any advice anyone here can give will be greatly appreciated. And... as this is my first post, I promise to become involved with the community – if you'll have me :)\n\nYou can look at further examples on my website – [Carrig Roman](http://web.archive.org/web/20150317155927/http:/paulogoode.com/carrig-roman-typeface)\n\n| Attachment | Size |\n| --- | --- |\n| [Carrig Example for Typophile.jpg](http://web.archive.org/web/20150317155927/http:/typophile.com/files/Carrig%20Example%20for%20Typophile.jpg) | 669.83 KB |\n\n",
  "author": "paulogoode",
  "time": "27 Jan 2015 — 3:32pm",
  "uid": "225869",
  "comments": [
    {
      "time": "29 Jan 2015 — 3:16am",
      "content": "Correct image below:\n\n ![](http://web.archive.org/web/20150317155927im_/http:/typophile.com/files/Carrig-Example-for-Typophile_3937.jpg)\n\n"
    },
    {
      "time": "28 Jan 2015 — 5:26pm",
      "content": "This is very good, charming and distinctive. The only thing I can really object to is the numeral 3, the upper half of which is stunted and lacking on all counts. The bowls of the numerals could generally stand more polishing for weight distribution.\n\n"
    },
    {
      "time": "29 Jan 2015 — 12:53am",
      "content": "Looks good! Maybe the spacing is just a bit tight for text use?\n\n/S and /V look like they're leaning over to me, but that might be an intended part of the historical style you're aiming at.\n\n"
    },
    {
      "time": "29 Jan 2015 — 1:19am",
      "content": "Thank you @cerulean, yes, you spotted my Achilles’ heel immediately. I know I have to rework my numerals, thanks for giving me confirmation. I'm equally happy that you appreciate the rest, cheers!\n\nThank you @Catharsis, before publishing this I had loosened the kerning on each individual letter as it was much tighter, I will view again. I can't see the leaning issue myself, but then again, I'm so close to this, it's hard to step back and be objective... hence coming here for opinions. I will check my axes once more. Thank you!\n\n"
    },
    {
      "time": "29 Jan 2015 — 10:52am",
      "content": "I can corroborate that the right arm of /V /v /y appears to range farther than the left and leaves a lot of space under it. I recommend pulling the bottom a bit to the right and preserving the present width.\n\nA forward-balancing /S tends to work just fine in context and can be left to personal taste. That said, I hope you will consider re-creating the dollar sign independently, perhaps with different terminals as well.\n\n"
    },
    {
      "time": "29 Jan 2015 — 12:35pm",
      "content": "Thank you @cerulean, that's exactly the kind of feedback I was hoping for when advised to sign up here. I will take those points on board and yes, I was being lazy with the dollar symbol and I already have that down to be reworked.\n\nMy next question to anyone would be, is my font saleable? Is it too similar to another? I've been heavily influenced by Baskerville and the inscriptions from the Trajan column, is that obvious and therefore detrimental? Or do you see Carrig having its own merits and personality?\n\nI've made a conscious decision to avoid any straight lines in the letterforms (punctuation excepted) with the aim of giving the typeface a natural warmth and friendliness... does that come across?\n\nThanks again for your considered opinions.\n\nPaulo\n\n"
    },
    {
      "time": "30 Jan 2015 — 2:38am",
      "content": "I like it. It has that transitional feeling without being as sharp as a Baskerville or Times. Much will depend on what the italic looks like, but the warmth you want is certainly there. I rather like (and am considering buying at the moment) [Ashbury](http://web.archive.org/web/20150317155927/http:/www.fontspring.com/fonts/hoftype/ashbury) for similar reasons, so it's a font I can imagine buying myself.\n\nMy one concern (though this is true about Ashbury as well) is the x-height. It depends on what you want it to propose it be used for, I suppose, but isn't it a bit big, perhaps, for body text? I also don't like that Q - perhaps it's me, but strokes not connecting when they should always subliminally make me feel like there's some kind of glitch. But I like the curve of it a lot.\n\n"
    },
    {
      "time": "30 Jan 2015 — 2:38am",
      "content": "I like it. It has that transitional feeling without being as sharp as a Baskerville or Times. Much will depend on what the italic looks like, but the warmth you want is certainly there. I rather like (and am considering buying at the moment) [Ashbury](http://web.archive.org/web/20150317155927/http:/www.fontspring.com/fonts/hoftype/ashbury) for similar reasons, so it's a font I can imagine buying myself.\n\nMy one concern (though this is true about Ashbury as well) is the x-height. It depends on what you want it to propose it be used for, I suppose, but isn't it a bit big, perhaps, for body text? I also don't like that Q - perhaps it's me, but strokes not connecting when they should always subliminally make me feel like there's some kind of glitch. But I like the curve of it a lot.\n\n"
    },
    {
      "time": "30 Jan 2015 — 1:39pm",
      "content": "You can say that again @Glider (sorry – it had to be said!). Fair comment about the x-height being big, that's been a deliberate decision because it's my first proper attempt at font creation and I'm designing via a combination of what I like and what feels intuitive. My original drawings (16 years ago) were calligraphic, hence the remnants of a hand drawn/unfinished style that you're picking up on and, as a strong influence, I've always loved how (some) Garamonds have an open /P bowl. I'm leaning towards keeping the /P and /R open to retain personality and differentiation, but will definitely look at joining the /Q.\n\nCheers!\n\n"
    },
    {
      "time": "30 Jan 2015 — 2:31pm",
      "content": "> will definitely look at joining the /Q.\n\nWhat about open it too? I’m thinking of a gap at the bottom of the circle, while the right part of the bowl joins the tail.\n\n ![](http://web.archive.org/web/20150317155927im_/http:/typophile.com/files/Carrig-Example-for-Typophile_3937_4652.jpg)\n  \n(brutally ham-fisted chopping to illustrate the idea)\n\nBy the way, I very much like the flow of your |g| (though perhaps it could be very slightly wider at the bottom left).\n\n"
    },
    {
      "time": "30 Jan 2015 — 3:06pm",
      "content": "I'm liking that idea a lot @riccard0 –&nbsp;I will definitely try that and maybe have it as another alternative character. I haven't looked at modifying my /g –&nbsp;would you believe that was the first draft? I will add that to the snag list and try some subtle curve adjustments.\n\nGosh, I still have so much to do, but thanks to everyone here for your valued input. I will start posting some revisions when I'm happy with them.\n\n"
    },
    {
      "time": "30 Jan 2015 — 3:10pm",
      "content": "I think that's its big selling point, a generous x-height and classical warmth at the same time. People looking for both don't have a lot to choose from. I think this is because ever since ITC turned Garamond into plastic in 1975, everyone has been warning against doing that again, while laying all the blame on one attribute.\n\n"
    },
    {
      "time": "2 Feb 2015 — 3:32pm",
      "content": "I've taken on board the majority of your suggestions and am happy to present an update for your perusal.\n\n ![](http://web.archive.org/web/20150317155927im_/http:/typophile.com/files/Carrig-Example-for-Typophile-v2_3789.jpg)\n\n"
    },
    {
      "time": "10 Feb 2015 — 6:43pm",
      "content": "I'm noticing the 8 is really bold. I know it's hard to mess with an 8's weight after you've gotten the curves just so, but set it among some lowercase and I think you'll see the need.\n\n"
    },
    {
      "time": "10 Feb 2015 — 7:56pm",
      "content": "In the smallest setting the tittles look too small, but maybe that's a rasterization issue?  \n/e/c/o/ look too wide to me. maybe /r/, /U/ too?  \nTerminals of /C/G/S/ need more weight.  \nBottom vertex of /N/ should dip down a bit lower.  \nBottom half of /s/ looks a bit too angular and off-balance, though of course you don't want to smooth the character out of it completely.\n\n"
    },
    {
      "time": "11 Feb 2015 — 2:06am",
      "content": "Thank you and thank you. In the last week or so since I put up the screen grab, I've made some of those design tweaks already. I'm sure all type designers suffer from being too close to their projects to see the flaws at times?\n\nThis is a great learning curve for me and it's been rather rapid, but thanks to the valued input here, I am getting much closer to where I want it to be.\n\n"
    },
    {
      "time": "14 Feb 2015 — 6:44am",
      "content": "I think this is wonderful, though I think the ascenders (and /f/) could do with being a bit taller.\n\n"
    },
    {
      "time": "14 Feb 2015 — 3:11pm",
      "content": "Thank you Steve, you’re very kind to say so. I take your point on the ascenders and, in particular, the /f/. I do like things as they are, but I am open to trying a variation for a sister font (still in the pipeline).\n\n"
    }
  ]
}
