{
  "id": "122839",
  "title": "How to scale font fallback to fit the original font?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI have designed non-Latin font, but when it's combined with Latin letters, it's (Latin letters and numeral) looks bigger than my non-Latin font!\n\nSo, is there any way to scale font fallback to fit my design? Something other than designing Latin letters\n\n",
  "author": "ott",
  "time": "26 Jan 2015 — 9:15pm",
  "uid": "186362",
  "comments": [
    {
      "time": "27 Jan 2015 — 3:09am",
      "content": "The apparent size and position of the letters at a certain point size (or pixel size), is determined by the size of the letters – for Latin fonts, the lowercase letters in particular – in relation to the units per em (UPM) and the vertical metrics in the font. The apparent size of Latin fonts also vary quite a bit though. Something that looks as big as Georgia, will look to big next to Garamond.\n\ntl;dr: it depends on how big the letters are relative to the size of the «em».\n\n"
    },
    {
      "time": "27 Jan 2015 — 3:36am",
      "content": "Hello  \nYou have to redesign the Latins, but it is not too difficult. In Fontlab open a full-height Latin glyph like H, go to Tools/Action/Contour/Scale tool to make a Latin outline smaller until it matches the required height and width you like to match the non-Latin. OK. Command Z to redo and try another number. Experiment with various vertical and horizontal percentages until you find a suitable scale. You can apply the same scaling to all selected Latin glyphs.\n\nIf the resulting Latin outline is too thin, try the Tools/Action/Effects/Bold (and check the \"keep glyph dimensions\" box) and again experiment with how many points you want the stroke width and height to be increased by, to approximate the non-Latin. (Use negative numbers to make a font outline thinner).  \nGood luck. It will not be a perfect Latin, but at least it will not look too strange next to the non-Latin. Can you post an example of the two scripts together?\n\n"
    },
    {
      "time": "27 Jan 2015 — 4:55am",
      "content": "[http://caniuse.com/#feat=font-size-adjust](http://web.archive.org/web/20150424032717/http:/caniuse.com/#feat=font-size-adjust \"http://caniuse.com/#feat=font-size-adjust\")\n\n"
    },
    {
      "time": "28 Jan 2015 — 8:54pm",
      "content": "Thank you all,,\n\nActually designing Latin letters and numerals are hard and long time solution\n\nI just checked some non-Latin fonts like Google Droid Arabic, it doesn't has Latin letters but the font fallback is very scaled to arabic!  \n [http://www.google.com/fonts/earlyaccess](http://web.archive.org/web/20150424032717/http:/www.google.com/fonts/earlyaccess \"http://www.google.com/fonts/earlyaccess\")\n\nThis is why I am looking for solution instead of designing Latin letters!\n\n"
    }
  ]
}
