{
  "id": "122821",
  "title": "Adjusting word spacing for corporate typeface",
  "forum": "General Discussions",
  "tags": [
    "Adjusting a Typeface",
    "General Discussions",
    "word spacing"
  ],
  "content": "Hello,\n\nI am looking to purchase a headline typeface for use in a corporate identity type system. However the word spacing is a bit wider than I would like. From experience would anyone recommend trying to adjust the word spacing in a program such a glyphs and saving out a new version? If that is too much of an undertaking them I will contact the type designer directly to see if something could be worked out.\n\nThanks,\n\n",
  "author": "erikweikert",
  "time": "26 Jan 2015 — 8:14am",
  "uid": "220832",
  "comments": [
    {
      "time": "26 Jan 2015 — 9:40am",
      "content": "Because of licensing issues contacting the designer is your best option. The space character is about the easiest adjustment possible so they shouldn't charge you much if they are willing to do so. Also, I'm not very familiar with the workings of InDesign, but I think it offers space options that override that of the font.\n\n"
    },
    {
      "time": "26 Jan 2015 — 11:04am",
      "content": "With InDesign you can adjust the word spacing for a Paragraph Style in the Justification settings. Then apply that style to the text. Also works for text that's flush left, etc.\n\n ![](http://web.archive.org/web/20150128232626im_/http:/typophile.com/files/spacing_5958.jpg)\n\n"
    },
    {
      "time": "26 Jan 2015 — 11:38am",
      "content": "Thanks Guys!\n\nWe considered the ability change the word spacing in InDesign and Illustrator but seeing as someone in the company might use the typeface is MS Word, Powerpoint, etc. we were hoping to find an option that wouldn't require any adjustments on the users end.\n\nI will give the type designer a shout and see if we can an adjusted version.\n\nThanks again for the help!\n\n"
    },
    {
      "time": "26 Jan 2015 — 12:17pm",
      "content": "With PowerPoint you could makes slides in InDesign, then export them as JPEGs and place the JPEGs in the PPT. But obviously that won't work for staff that doesn't know InDesign.\n\n"
    },
    {
      "time": "26 Jan 2015 — 3:55pm",
      "content": "I think the OP is right to modify the font to work out of the box, rather than hope that most (any?) users will follow guidelines, use stylesheets, or care even one whit about wordspacing. In fact, you could argue that it's the duty of the branding designer to anticipate and remove as many of those responsibilities from the end user as possible.\n\n(Letterspacing can be adjusted in PowerPoint and Word, and the space character is adjusted along with it, but I'm not aware of any way to adjust wordspacing independently.)\n\n"
    }
  ]
}
