{
  "id": "122895",
  "title": "Rebrand for a gallery in oslo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "#logo",
    "contemporary",
    "format",
    "gallery",
    "Logos / Corporate ID Design",
    "rebrand"
  ],
  "content": "What do you guys think ?\n\n[Gallery format](http://web.archive.org/web/20150317170524/http:/on.be.net/1y6SfXy)\n\n",
  "author": "andreasbsogn",
  "time": "28 Jan 2015 — 2:54pm",
  "uid": "217598",
  "comments": [
    {
      "time": "28 Jan 2015 — 7:49pm",
      "content": "It's creative. Not sure I understand why the O was deleted.\n\nOne concern I have is that most folks (at least in the U.S.) transfer business card info to their computer and devices. How they would enter the name — \"f rmat\", \"frmat\", \"format\", or what? And in the graphic below you spell it 2 different ways.\n\n ![](http://web.archive.org/web/20150317170524im_/http:/typophile.com/files/format_3825.jpg)\n\nAlso your spacing between the \"f\" and \"rmat\" is very inconsistent. I know you're trying to vary it depending on the layout, but it creates a very inconsistent look.\n\nNot trying to sound negative, it's a creative solution, just pointing out a few things.\n\n"
    },
    {
      "time": "31 Jan 2015 — 8:14am",
      "content": "Why would you name a gallery \"floormat\"?\n\nMy point is that I think it's a bad idea, from a branding perspective, to omit a letter, particularly a vowel, entirely from the logo. A logo should be easy to read, not difficult. While it's thought provoking and the conceptual idea is interesting and fun, you're really stretching the metaphor by applying it to the logo.\n\nI agree that you should not play with the spacing and it should be fixed. It's bad branding practice to \"play\" with the design of your logo in ways that undermine it's coherence as a symbol. That said, it \\*is\\* an art gallery and breaking those very rules might be part of it's mission or culture. I'm just quoting branding bible and verse.\n\n"
    },
    {
      "time": "31 Jan 2015 — 1:47pm",
      "content": "I like it a lot, but this definitely needs something to connect f to rmat and, ideally, to hint that it's O and not, say, E. The [most obvious way](http://web.archive.org/web/20150317170524/http:/www.designer-daily.com/wp-content/uploads/2009/09/more-logo.jpg) is already taken, but perhaps something as simple as this -\n\n ![](http://web.archive.org/web/20150317170524im_/http:/typophile.com/files/format-1_4823.png)\n\nor this -\n\n ![](http://web.archive.org/web/20150317170524im_/http:/typophile.com/files/forrmat-2_5831.png)\n\nThe main problem with the original is that if it appears on a routine document (rather than a business card), it will look like a formatting glitch rather than a logo. As if someone accidentally selected the o and hit Tab, pushing f and rmat to the left- and right-aligned tabstops at the sides of the page.\n\n"
    },
    {
      "time": "1 Feb 2015 — 7:33am",
      "content": "Reminds me of one of MySpace redesigns…\n\n"
    },
    {
      "time": "1 Feb 2015 — 2:00pm",
      "content": "How about something like this, where the oversized /O/ both connects the /f/ to the /rmat/ and also represents the white space in the gallery?\n\n ![](http://web.archive.org/web/20150317170524im_/http:/typophile.com/files/Format_4704.png)\n\n"
    }
  ]
}
