{
  "id": "122824",
  "title": "Packaging design crit",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hey folks! I haven't been on here in a loooong time (so long that I had to make a new username, couldn't remember the old one!), stepped away from design for a bit while starting a food company. Now, I'm in the process of designing bags for our caramel popcorn, and could use some feedback!\n\nName of the company is Boujie Baking Co., (from \"bourgeois\"). Tagline is Fancy Schmancy Goodness. Basically, we make gourmet foods without the gourmet attitude. (Sir Kensington's is a great example of a similar brand message.)\n\nThis packaging is for our line of Beer Kissed caramel popcorn; we have a few other Beer Kissed product lines that will be designed once this is done. Inspiration was taken from Art Deco era (bourgeois, but more modern than, say, the baroque/rococo era). Type is nostalgic but not overly Deco-y, as I don't want it to fall into the \"novelty\" category. Should still be familiar enough to today's shoppers to be a comfortable purchase.\n\nThe part I'm really struggling with is the \"The Original Beer Kissed Caramel Popcorn\", at the top, as well as the logo placement at the very top. This is kind of a parent brand / sub brand situation, so I'm not worried about the Boujie logo being too prominent. There are two options in the attached PDF.\n\nOf course, I'll take any sort of feedback you give!\n\nThanks!\n\nPS I understand Beer Kissed type is rough, I'll clean it all up once I have a direction chosen.\n\n| Attachment | Size |\n| --- | --- |\n| [Full TRIP2opt.pdf](http://web.archive.org/web/20150317170610/http:/typophile.com/files/Full%20TRIP2opt.pdf) | 1.97 MB |\n\n",
  "author": "rubiarubia",
  "time": "26 Jan 2015 — 11:51am",
  "uid": "225839",
  "comments": [
    {
      "time": "26 Jan 2015 — 11:52am",
      "content": "(Also, the images are obviously mock ups, and the colors need to be tightened up — these are just drafts!)\n\n"
    }
  ]
}
