{
  "id": "12289",
  "title": "Fontographer Has a New Home at Fontlab Ltd.",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "Fontlab Ltd., 136 E 8th St., Port Angeles WA 98362, USA\n\n**FONTOGRAPHER HAS A NEW HOME AT FONTLAB LTD.**\n\nFontlab Ltd. Licenses Legendary Font Editor, Plans to Continue Development\n\nFor Immediate Release  \nMonday, May 9, 2005  \nContact: Ted Harrison  \nFontlab Ltd.  \nTel: +1 (509) 272-3260  \n [contact@fontlab.com](mailto:contact@fontlab.com)\n\nPort Angeles, WA, USA, May 9, 2005: Fontlab Ltd. is pleased to announce  \nthe licensing from Macromedia Inc. of the Fontographer product line.  \n“Fontographer is a respected name in the field of digital typography,”  \nsaid Ted Harrison, president of Fontlab Ltd. “We are proud to add this  \nlegendary font editor to our lineup of products.” As of today, Fontlab  \nwill continue to sell the current version of Fontographer while beginning  \nwork on fixing bugs and preparing a new version - expected to be released  \nearly next year.\n\n“With nearly two decades of presence on the market, Fontographer has  \ngained a reputation as an easy-to-use and reliable tool for creating  \ndigital fonts, and continues to boast a strong and dedicated user  \ncommunity among desktop publishers, graphic designers and typographers. We  \nfeel that Fontographer will find a secure and comfortable home at Fontlab  \nLtd. Our team is committed to continuing the development of a brand-new  \nversion of the product,” said Harrison. Harrison continues, “With our TypeTool product we have a font editor for  \nbeginners, hobbyists and students. FontLab Studio and AsiaFont Studio are  \nour high-end products with a certain degree of technical complexity, aimed  \nat professional type designers. With Fontographer, we now have a tool that  \nfills the gap between those products - a font editor for graphic designers  \nand desktop publishers, powerful enough for real-world typography but  \nwithout all the bells and whistles of our high-end products.”\n\nFontlab Ltd. will offer upgrade paths from TypeTool 2 to Fontographer 4.1  \n(US$249) and from Fontographer 4.1 to FontLab Studio (US$299) and to  \nAsiaFont Studio (prices to be announced.)\n\nFontlab will assume support for Fontographer version 4.1+ from Macromedia  \nand will retain the services of Fontographer guru Jim Gallagher, who has  \nnurtured Fontographer for the last ten years, and who will advise the  \nFontlab development team in their task of updating Fontographer.\n\n**About Fontlab Ltd.**\n\nFontlab Ltd. is the world’s leading developer of digital typography  \nsolutions. Their full line of products is dedicated to solving typographic  \nissues ranging from the simple to the most complex. These products  \ninclude: AsiaFont Studio™, BitFonter™, FontLab Studio™, ScanFont™,  \nTypeTool™, TransType™, FontFlasher™, FONmaker™, SigMaker™  \nCompoCompiler™ and Photofont. More information on all Fontlab products  \ncan be seen at [www.fontlab.com](http://web.archive.org/web/20140813084257/http:/www.font.to/cgibin/at.cgi?a=227536).  \n ###\n\n",
  "author": "Jared Benson",
  "time": "9 May 2005 — 8:38am",
  "uid": "3",
  "comments": [
    {
      "time": "9 May 2005 — 10:05am",
      "content": "Holy mother of pearl. I never thought I would see the day when something like this would happen. I am agog. Thank you Fontlab.\n\n"
    },
    {
      "time": "9 May 2005 — 10:17am",
      "content": "I don't know too much about fontographer since I have never used it, but it seems like it was a competetor to Fontlab just with less recent features because Macromedia stopped developing it. Now that Fontlab has bought Fontographer, do you think it will be sort of like a version of Fontlab with less features or something greater?\n\n"
    },
    {
      "time": "9 May 2005 — 10:39am",
      "content": "The thing that remains attractive about Fontographer is the simplicity of the interface and the font generation options. I use Fontlab, but become enormously frustrated with the number of options and setting just to generate a single typeface. Fontographer doesn't get in the way of the generation of the file. Certainly, it's not nearly as flexible or powerful and it cannot produce OpenType fonts, but most of time (for what I do anyway) I don't need those features. There are folks like me who have been using Fontographer since it first came out (late 80s) and are used to how it works and where the tools are and what the expected outcome of the generated file should be. Fontlab is too cumbersome to learn when you have little time to change your work habits.\n\nOf course, this is one person's opinion.\n\nI think that Fontlab (the company) taking over Fontographer development and support can only lead to good things in the long term.\n\n"
    },
    {
      "time": "9 May 2005 — 10:48am",
      "content": "Insane and very interesting.\n\n"
    },
    {
      "time": "9 May 2005 — 11:17am",
      "content": "my first font is done in fotographer. i'm impressed but everybody knows about the power of fontlab\n\n"
    },
    {
      "time": "9 May 2005 — 11:47am",
      "content": "Insane? Only as insane as the \"Font Information\" windows in Fontlab. For some, simpler is better.\n\n"
    },
    {
      "time": "9 May 2005 — 11:55am",
      "content": "Grant, what quality assurance tests do you put your Fontographer fonts through? My concern with Fontographer is that it never actually generated very good quality fonts. This wasn't obvious to most people because almost no one tested the fonts in any kind of rigorous way, and there has never been a proper quality assurance process for Type 1 fonts outside of Adobe. Some years ago, Adobe were testing various commercial font tools to see if any might be suitable replacements for their old Unix-based development tools. At the time, neither Fontographer nor FontLab produced PostScript code that the Adobe RIP engineers thought was of a satisfactory standard. Now, of course, FontLab uses Adobe code to generate CFF OpenType fonts, (as for Type 1 most people know my opinion of 8-bit font formats and what should happen to them), and presumably a new version of Fontographer from the FontLab people would do the same. But it seems likely to me that all that will remain of Fontographer will be the UI: they are going to need to replace the entire back end of Fontographer with something that produces better quality fonts.\n\n"
    },
    {
      "time": "9 May 2005 — 12:49pm",
      "content": "The QA we used for years was basic and functional. Did the fonts print on multiple output devices? Did the font names map cross-platform? Did glyphs drop out? Did the visual appearance remain consistant between Type One and TrueType flavours? It wasn't rocket science. In the 16 or so years that I have used Fontographer, the inherent quality of the fonts depended more upon the consistancy and attention to detail in the design of the outlines and the tweaking of the metrics than that of the engine which generated the final files. Perhaps I'm not as particular or granular about the same details as other type designers, but over the years we produced, developed, generated, sold, and supported thousands and thousands of Fontographer-based Type One and TrueType fonts without any customer (or internal - as we have always eaten our own dog food) feedback indicating that the technical quality of the fonts were anything less than fine and dandy.\n\nThis is not to say that Fontographer couldn't stand a good soak and scrub behind the ears.\n\nMy excitement about this announcement has less to do with the potential of improving the back-end services of Fontographer (which I agree, certainly would not hurt) and more about continuing to give designers an alternative tool to develop fonts. Fontographer fits my workflow more than the likes of Fontlab or TypeTool. If I was more involved in producing double byte OTFs, I am certain that my priorities in terms of font design toolsets would change.\n\n"
    },
    {
      "time": "9 May 2005 — 2:40pm",
      "content": "The font business had a pretty easy ride during most of the 1990s with regard to quality assurance. PostScript RIP engineers went out of their way to accomodate all sort of font bugs that would not have been accepted in Adobe's own fonts, and printer manufacturers effectively cut their TrueType teeth on some of the worst fonts ever made, because for several years only a handful of company actually knew how to make good TrueType fonts. So we could afford to be less than particular about spec conformance. But I think we need to wake up to the fact that those times are changing. Windows began preventing some kind of problem fonts from being installed, although they were still pretty generous about what they would accept. Apple is now doing likewise. We're looking at a future of digital signatures in which corporate customers will likely refuse installation of software from unapproved vendors, including fonts. I think all font developers, big and small, need to be aware of this; especially the small ones, if we want to maintain the diverse and dispersed font business that we've created in the past fifteen years. The demand for assured technical quality -- especially spec conformance -- in fonts is going to increase, and we need to be able to deliver. The good news is that font tool developers like FontLab are aware of this, and Microsoft, Adobe and Apple are all helping by providing testing tools for OT and TT fonts. But we're the ones who have to learn to use these test tools and develop workflows that incorporate them.\n\n"
    },
    {
      "time": "19 Jun 2005 — 1:20pm",
      "content": "What glorious news. I might try actually designing some fonts now.\n\nDavid  \n [http://www.kadavy.net](http://web.archive.org/web/20140813084257/http:/www.kadavy.net/ \"http://www.kadavy.net\")\n\n"
    },
    {
      "time": "23 Jul 2005 — 12:53pm",
      "content": "I wonder if Fontlab is going to make a merge tool for combining font families to create new ones. Fontographer had been able to do that before they stopped created updated drivers.\n\n"
    },
    {
      "time": "24 Jul 2005 — 11:15am",
      "content": "Why?\n\n"
    }
  ]
}
