{
  "id": "122932",
  "title": "Pink Glyph Window",
  "forum": "Build",
  "tags": [
    "glyph window",
    "Build"
  ],
  "content": "Anyone know why the g window is pink (see attached)? What does this pink mean in Fontlab terms?\n\n| Attachment | Size |\n| --- | --- |\n| [Screen shot 2015-01-29 at 4.49.49 PM.png](http://web.archive.org/web/20150320223047/http:/typophile.com/files/Screen%20shot%202015-01-29%20at%204.49.49%20PM.png) | 11.58 KB |\n\n",
  "author": "pablo@designisc...",
  "time": "29 Jan 2015 — 1:50pm",
  "uid": "225921",
  "comments": [
    {
      "time": "29 Jan 2015 — 1:51pm",
      "content": " ![](http://web.archive.org/web/20150320223047im_/http:/typophile.com/files/Screen%20shot%202015-01-29%20at%204_5762.49.49%20PM.png)\n\n"
    },
    {
      "time": "29 Jan 2015 — 2:10pm",
      "content": "Never mind. Figured it out!\n\n"
    },
    {
      "time": "30 Jan 2015 — 7:16am",
      "content": "Paint me pink with anticipation. What does it mean?\n\nThere is also a gray background, and on the right a single gray character. Do all of these things mean something?\n\n"
    },
    {
      "time": "30 Jan 2015 — 7:28am",
      "content": "In my experience, the pink background indicates a problem with either the glyph name or its Unicode number. For any given character set, the gray character means that the glyph slot is \"active\" but there's no glyph in it, and the gray background means the glyph belongs to that character set, but there is no glyph present.\n\n"
    },
    {
      "time": "30 Jan 2015 — 9:29am",
      "content": "If you have Python installed and go to Macros and \"Mark Problems\" it shows up pink when points are not at the right place or when point should be inserted.  \n@oldnick. Unicode problems show up in red, but only at the unicode value, not at the part were the glyph is previewed.  \nGrey means that the glyph is part of the characterset, but is not active. If you would make an empty glyph, it would not show up grey.  \n...on the other hand.. I use FontLab on Windows (that's an OS made by a company called Microsoft [http://en.wikipedia.org/wiki/Microsoft](http://web.archive.org/web/20150320223047/http:/en.wikipedia.org/wiki/Microsoft \"http://en.wikipedia.org/wiki/Microsoft\")) so it could be different on a Mac\n\n"
    },
    {
      "time": "30 Jan 2015 — 10:07am",
      "content": "I agree with Micha. When I've run into that it's usually something along the lines of a stray node or unconnected outline.\n\n"
    },
    {
      "time": "2 Feb 2015 — 6:37pm",
      "content": "This coloration can also be manually invoked by the user, just as a way of tagging a glyph for future reference. (Which could happen by accident.)\n\nPablo, instead of repeatedly posting \"never mind, I figured it out,\" perhaps you could share your discoveries?\n\n"
    },
    {
      "time": "20 Feb 2015 — 10:05pm",
      "content": "Nice read! The published is written in excellent quality and incredibly good details to read here.  \n **[Visit This Walking Dead Season 4 Jacket](http://web.archive.org/web/20150320223047/http:/www.fitjackets.com/products/Women-The-Walking-Dead-Season-Rick-Grimes-4-Jacket.html)**\n\n"
    }
  ]
}
