{
  "id": "122999",
  "title": "Gloucester/Cheltenham",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello all  \nMaybe this topic has always been discussed somewhere on Typophile, but I've been unable to find out…  \nDoes anybody have any information about the renaming of Cheltenham Old Style, which became Gloucester (series 99) in 1911 for British Monotype ? Thank you very much.\n\n",
  "author": "Celeste",
  "time": "1 Feb 2015 — 11:15am",
  "uid": "11083",
  "comments": [
    {
      "time": "1 Feb 2015 — 10:04pm",
      "content": "According to Jaspert's Encylopaedia of Type [1970] Cheltenham [1896 and 1904-11] had several imitators, as follows: The Monotype version was \\_Gloucester\\_. It had an italic \\_p\\_ with the normal closed bowl. Stephenson Blake had \\_Winchester\\_, which may be distinguished by the curl of the ear in \\_g\\_ and the serifs of the \\_s\\_. Intertype had \\_Cheltonian\\_. Berthold originally called their version \\_Sorbonne\\_ [1905].  \nDon\n\n"
    },
    {
      "time": "2 Feb 2015 — 1:11am",
      "content": "Thank you very much, Don.  \nI personnaly have doubts about Gloucester being an <cite>imitation</cite> of Cheltenham, since Lanston Monotype (British Monotype’s US parent company) had bought the rights of the face from ATF in order to make it available on its composing machines. I just wonder why it was thus renamed for the British (and European) market, and how the ‘Gloucester’ name came about.\n\n"
    },
    {
      "time": "2 Feb 2015 — 7:10am",
      "content": "Since it was the British Monotype company that gave the world Times Roman, along with revivals of Baskerville, Plantin, Garamond, and such faces as Bembo and Poliphilus, even though it was descended from the original American Lanston Monotype company, it seems to have become independent of it. Thus, Lanston Monotype faded to such obscurity that it ended up being owned by a participant in this forum (one Gerald Giampa), while the British Monotype firm is a very major player in the digital type era.\n\nWhile Lanston Monotype opened its British branch in 1897, the British operations issued stock in Britain in 1936, so they became independent then or earlier.\n\n"
    }
  ]
}
