{
  "id": "12305",
  "title": "Omine Type Launches",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am pleased to announce the opening of my [personal foundry](http://web.archive.org/web/20131010211021/http:/www.omine.net/).  \nThree new typefaces are available for now, exclusively in the OpenType format.\n\n_The typefaces_  \n [Maest](http://web.archive.org/web/20131010211021/http:/www.omine.net/maest.htm) is an unusual script typeface constructed with straight lines. It features 4 styles of figures (tabular lining, tabular oldstyle, proportional lining, proportional oldstyle), swash capitals, ending forms, f-ligatures, and 3 weights (from regular to black).\n\n[Bunker](http://web.archive.org/web/20131010211021/http:/www.omine.net/bunker.htm) is a versatile stencil type family with lowercase characters and a extensive character set that covers the Latin, Central European, Turkish and Baltic codepages. This type family is comprised of 4 interchangeable styles (a character occupies the same advance-width in all of the fonts) and features 4 styles of figures.\n\n[Gotica Lumina](http://web.archive.org/web/20131010211021/http:/www.omine.net/gotica.htm) is a new blackletter. The soft version features gentle contours that contains no corners. The sharp version, more suitable for display usage, is more rigid and slightly lighter than the soft one. There is an alternate font\\* for each style, and all fonts have 4 styles of figures, standard ligatures and discretionary ligatures.\n\n\\* The alternate characters are also available in the \"main\" font, through the \"salt\" feature, but considering the current general lack of support to this specific OpenType feature, alternate fonts have been made available.\n\n_50% off until May 31!  \nPromotional price valid for Gotica Lumina, Bunker and Maest.  \nCheck the prices by following the links above or directly at [MyFonts](http://web.archive.org/web/20131010211021/http:/www.myfonts.com/foundry/ominetype/)._\n\n",
  "author": "eomine",
  "time": "9 May 2005 — 3:09pm",
  "uid": "1353",
  "comments": [
    {
      "time": "9 May 2005 — 3:54pm",
      "content": "You know, I'm rewriting my post to say that at first (actually when you mailed this to the brazilian typography list) I ended up not paying much attention to Lumina (I'm ashamed!). But now that I have actually payed some attention (and read the related typophile thread), I think it's wonderful. Congratulations Eduardo!\n\n"
    },
    {
      "time": "9 May 2005 — 4:42pm",
      "content": "Congratulations, Eduardo!!! Gotica Lumina is abolutely beautiful. I can't decide whether to license the smooth or the sharp version first! so what's the official name of yer foundry? I'm itchin to get it in the wiki. ;^D\n\n"
    },
    {
      "time": "9 May 2005 — 5:18pm",
      "content": "My congratulations as well, Eduardo. All innovative, interesting, and well executed faces. Best of Luck!\n\n"
    },
    {
      "time": "10 May 2005 — 6:41am",
      "content": "Congratulations, Eduardo.. _I particularly favour ' [Bunker](http://web.archive.org/web/20131010211021/http:/www.omine.net/bunker.htm)' and ' [Maest](http://web.archive.org/web/20131010211021/http:/www.omine.net/maest.htm)'.. :)_\n\n_( I even just 'recommended' 'Bunker', in [here](http://web.archive.org/web/20131010211021/http:/typophile.com/node/12313).. :)_\n\n"
    }
  ]
}
