{
  "id": "12306",
  "title": "Big Fleischmann Bake-Off Imminent",
  "forum": "Bald Condensed's blog",
  "tags": [

  ],
  "content": "You have been requesting a comparative review of Mercury and Farnham in Bald Condensed, and I am happy to announce I will be able to offer twice the fun. [Hoefler & Frere-Jones](http://web.archive.org/web/20150420052220/http:/www.typography.com/)' [Mercury](http://web.archive.org/web/20150420052220/http:/www.typography.com/catalog/mercurydisplay/index.html) will be compared not only to [Christian Schwartz](http://web.archive.org/web/20150420052220/http:/www.fontbureau.com/people/ChristianSchwartz)'s [Farnham](http://web.archive.org/web/20150420052220/http:/www.fontbureau.com/fonts/Farnham), but to [Matthew Carter](http://web.archive.org/web/20150420052220/http:/www.fontbureau.com/people/MatthewCarter)'s Fenway -- the type family he designed as a replacement for Times Roman in Sports Illustrated -- and [Erhard Kaiser's](http://web.archive.org/web/20150420052220/http:/www.dutchtypelibrary.nl/Kaiser.html) [DTL Fleischmann](http://web.archive.org/web/20150420052220/http:/www.dutchtypelibrary.nl/FleischmannDRegular.html) as well. Funny thing is that DTL Fleischmann -- which is the odd one out as it is the most faithful (and quirky) digitisation -- unexpectedly has a new competitor in [Mário Feliciano](http://web.archive.org/web/20150420052220/http:/www.secretonix.pt/ftf/index.html)'s as of yet unreleased Eudald. This is a Didone which is based on the work of Eudald Pradell, a Spanish imitator of Fleischmann. So five typefaces in total will contend for the coveted title of _Most Totally Awesome Fleischmann Digitisation™_.\n\nOh, one more thing: I would like to stress that I have no academic background whatsoever, so don't expect any roaring theories nor historical contexts. I review type from a gut feeling and using common sense. So if I get it wrong, please feel free to laugh at my expense. Like, really hard.\n\n",
  "author": "Bald Condensed",
  "time": "9 May 2005 — 3:49pm",
  "uid": "110",
  "comments": [
    {
      "time": "9 May 2005 — 6:07pm",
      "content": "Woo - Hoo! I'm honing my big knife so I can gleefully attack as soon as you say anything. Just kidding :) Thanks for taking this on; I look forward to reading it.\n\n"
    },
    {
      "time": "9 May 2005 — 6:47pm",
      "content": "Clearing my throat for a hearty pejorative and guttural laugh. Just kidding.\n\n"
    },
    {
      "time": "9 May 2005 — 8:31pm",
      "content": "a bake-off? well there is nothing quite like the gout-hollandaise! :^)\n\n"
    },
    {
      "time": "17 May 2005 — 6:41am",
      "content": "Yeah! Looking forward to the review. I'm kinda disappointed Mercury does not come with OSF. Am I the only one?\n\n"
    }
  ]
}
