{
  "id": "123037",
  "title": "Sans Serif used for The Reef: Residences at Atlantis.",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": "I did a few font identification searches and have not been able to successfully identify this typeface. The number 9 and 6 should have a curved tail and all of the search results I found lacked that. If you can help, that would be awesome. Thank you.\n\n ![](http://web.archive.org/web/20150317051500im_/http:/typophile.com/files/IMG_6369%20-%20Copy_6443.jpg)\n\nFont:&nbsp;\n\n Noto Sans \n\nSolved By:&nbsp;\n\n [Ryuk](http://web.archive.org/web/20150317051500/http:/typophile.com/user/22675 \"View user profile.\")\n\n",
  "author": "whitgreen",
  "time": "3 Feb 2015 — 7:18am",
  "uid": "226029",
  "comments": [
    {
      "time": "3 Feb 2015 — 7:21am",
      "content": "Any help would be great. If you need more details, feel free to ask.\n\n"
    },
    {
      "time": "3 Feb 2015 — 7:29am",
      "content": "[Noto Sans](http://web.archive.org/web/20150317051500/http:/www.fontsquirrel.com/fonts/noto-sans)\n\nHint: as usual when it happens to be an online piece of text, always link to the original [web page](http://web.archive.org/web/20150317051500/http:/ownthereef.com/) and if you like to get an immediate answer, quoting R. from this [post](http://web.archive.org/web/20150317051500/http:/typophile.com/node/117175#comment-580410)\n\n> Here’s one handy thing to know: If you want to identify a webfont, you can select the text that uses it, right-click on your selection and then select ‘Inspect Element’ from the context menu (in Firefox and Chrome). The font name will be shown on the right-hand side in the panel at the bottom of the screen. You might want to click on the tab ‘Fonts’ in Firefox or ‘Computed’ in Chrome for a neater overview.\n\nOther handy options: Chrome [WhatFont](http://web.archive.org/web/20150317051500/http:/chengyinliu.com/whatfont.html) app by Chengyin Liu and [Fontface Ninja](http://web.archive.org/web/20150317051500/http:/fontface.ninja/)\n\n"
    },
    {
      "time": "3 Feb 2015 — 7:32am",
      "content": "WOW... Your sample has changed... This is a completely different one... First time, it was a blue text on white background saying \"The Reef Residences are the only residential beachfront opportunity at Atlantis. Here you can relax and play like nowhere else in the world. Superbly appointed for luxury living, these designer-furnished studio, one or two-bedroom condominiums overlook the most beautiful beach on Paradise Island. Balance an ambience unrivaled for tranquil Paradise Island beauty with the infinite adventures of Atlantis as your personal playground, and The Reef Residences will surely become your most prized vacation home.\"  \nBug?\n\n"
    },
    {
      "time": "3 Feb 2015 — 7:47am",
      "content": "Sorry, I had to change it to the photograph with the text because that is specifically what I am supposed to recreate. I tried to make the change as swiftly as possible :). I really appreciate your response and your suggestions. Thank you very much.\n\n"
    }
  ]
}
