{
  "id": "123033",
  "title": "Font Size problem",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I'm new to font creation and have almost finished making a font based on an artists hand writing. The problem I have is when I go to \"Quick Test\" the font the glyphs appears small while the cursor itself if huge (see pic). This also happens when I generate the font and test in Illustrator. I'm sure it's something simple but I was unable to find where to change this value. I would prefer not to recreate the font from scratch. Thanks in advance. Cheers\n\n| Attachment | Size |\n| --- | --- |\n| [example.jpg](http://web.archive.org/web/20150318003341/http:/typophile.com/files/example_8.jpg) | 176.56 KB |\n\n",
  "author": "darcstorm",
  "time": "3 Feb 2015 — 4:02am",
  "uid": "225208",
  "comments": [
    {
      "time": "3 Feb 2015 — 5:00pm",
      "content": "Hi  \nI reproduced part of your problem by changing the UPM value from 1000 to 10000 in Font Info Metrics and Dimensions panel. Could that be the problem? A typical value is 1000.  \nChanging UPM makes the glyphs larger or smaller. No need to redesign the font. Tools/ Action.../ Contour/Scale with checking the scale metrics and proportional scale boxes checked. This can change the size of any selected glyph. Use a copy of your font to experiment on. Change UPM. Select the H and g glyphs (typical ascender and descender) and apply the scaling Action. Quick Test HgHgHg. If OK apply to entire font by checking the box bottom left of the Scale panel in Action.  \nMake sure you use copies of the font and apply Ctrl Z to revert while experimenting.  \nGood luck hope this solves it.  \nVladimir\n\n"
    },
    {
      "time": "4 Feb 2015 — 7:33pm",
      "content": "Yes, it is probably an issue with the font size vs UPM, or possibly other vertical metrics in the font.\n\n"
    },
    {
      "time": "5 Feb 2015 — 2:09am",
      "content": "I think your outlines and upem are okay, but you should check the spacing metrics; e.g. Win Ascent, Win Descent, as well as the Ascender and Descender values.\n\n"
    }
  ]
}
