{
  "id": "1232",
  "title": "Dentist logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey everyone, it's my first time posting here. I've started working on a logo for a dentist and want to avoid showing a tooth or tooth brush and all of that. From what I know, he is an older dentist and would want something more on the conservative side. He is one of the only dentists in the region who does cosmetic dentistry (teeth whitening, replacing silver fillings with white ones and so on).   \n   \nLet me know what you think.   \n   \n ![dentist logo](http://web.archive.org/web/20150417150552im_/http:/www.typophile.com/forums/messages/29/15915.gif)\n\n",
  "author": "secondtoughest",
  "time": "10 Sep 2003 — 1:17pm",
  "uid": "2277",
  "comments": [
    {
      "time": "10 Sep 2003 — 1:59pm",
      "content": "Hi David! I really like the mc monogram. One thing you could try on that is using a heaver \"c\".   \n   \nThe horizontal rule and type alignment, however, are unbalanced. You might be better off eliminating the line and center-aligning \"Michael Contardo\" with the monogram. A smaller point size might help the balance, too.   \n   \nPaul\n\n"
    },
    {
      "time": "10 Sep 2003 — 2:51pm",
      "content": "I'm not sure that dropping the right leg of the \"M\" is adding anything to the logo. I guess it is a bit distracting to me. I agree that the monogram is nice.   \n   \nmb\n\n"
    },
    {
      "time": "10 Sep 2003 — 4:09pm",
      "content": "To me, that extended leg on the M gives it character. It's a conservative logo, but it has just a dash of playfulness in it.\n\n"
    },
    {
      "time": "10 Sep 2003 — 6:28pm",
      "content": "First and Foremost:   \n   \nwhat do you mean by \"from what i know, he is an older......\" ?   \n   \n   \nyou don't know your client?   \n   \n   \n   \n   \nDavid Hamuel\n\n"
    },
    {
      "time": "10 Sep 2003 — 6:34pm",
      "content": "David,   \nI am a designer at an agency who was handed this project. It is just the way things work here\n\n"
    },
    {
      "time": "11 Sep 2003 — 6:26am",
      "content": "Here are some revisions and color choices. I used a heavier weight c in the monogram and played around with the shape a bit. I like the top left one, but my main concern is that it\n\n"
    },
    {
      "time": "11 Sep 2003 — 6:27am",
      "content": "sorry for the double post\n\n"
    },
    {
      "time": "11 Sep 2003 — 7:54am",
      "content": "Hi David,   \n   \nI like the one on the right hand side second from the bottom (with the hairline around the ochre circle -- BTW ochre may not be the best color choice since he's a whitening specialist :-).   \n   \nTwo thoughts.   \n1) Try his name smaller 80-90%   \n2) Give\n\n"
    },
    {
      "time": "11 Sep 2003 — 8:21am",
      "content": "The Logo is a bit generic. Although I don't think that a logo necessariyl has to say anything about the client, maybe there is a way of showing what he doesn without the old teethe&brush clich\n\n"
    },
    {
      "time": "11 Sep 2003 — 1:32pm",
      "content": "i dont' believe anything you say, HD\n\n"
    },
    {
      "time": "11 Sep 2003 — 1:38pm",
      "content": "Of course referring to HD's animated gificon, which reads:   \n   \n\"DON'T BELIEVE ANYTHING I SAY\"\n\n"
    },
    {
      "time": "11 Sep 2003 — 1:43pm",
      "content": "This is looking very good, David. I really like the top two on the right. Experiment with some more colours - even an unusual colour like maroon or taupe might look nice.   \n   \nPaul\n\n"
    },
    {
      "time": "11 Sep 2003 — 3:16pm",
      "content": "Here's some more revisions and color choices. I changed the proportions between the name and the monogram and i think it worked nicely. Again, thanks for the great feedback.   \n   \n ![contardo](http://web.archive.org/web/20150417150552im_/http:/www.typophile.com/forums/messages/29/16051.gif)\n\n"
    },
    {
      "time": "11 Sep 2003 — 9:28pm",
      "content": "I thought maybe HD's\n\n"
    },
    {
      "time": "11 Sep 2003 — 10:30pm",
      "content": "I've been following this critique, but I haven't had time to offer any input until now.   \n   \nRE: Color\n\n"
    },
    {
      "time": "11 Sep 2003 — 3:31pm",
      "content": "I appreciate the simplicity of your design. I do like these new colors as well. My only comment -- and don't mind be proved wrong -- is that I read \"mc\" as in a last name McCahalan or something like that. I think it is because the 'c' appears smaller than the 'm'.\n\n"
    },
    {
      "time": "11 Sep 2003 — 5:12pm",
      "content": "Tiffany, you're right. It's a nice mark, but it does read as Mc.   \n   \nAlso, the latest color palette is great. Fresh without being   \ntoo minty.\n\n"
    }
  ]
}
