{
  "id": "123297",
  "title": "logotype critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "brush lettering",
    "even weight",
    "Logos / Corporate ID Design",
    "vector"
  ],
  "content": "Long time anonymous browser, first time poster.  \nI'm trying my hand at vectorizing some brush lettering for a friend, and can't seem to get an even weight through the whole mark. I think it's the \"r\"s? Does the \"y\" look too upright? That last \"s\" is super weird, right? Any suggestions on how to fix anything would be much appreciated! I'm finding that you have to make a lot of very purposeful decisions in Illustrator that you wouldn't notice while drawing everything an inch high in pen.  \nThanks so much!  \nJenna\n\n| Attachment | Size |\n| --- | --- |\n| [Screen Shot 2015-02-15 at 3.21.56 PM.png](http://web.archive.org/web/20150317183904/http:/typophile.com/files/Screen%20Shot%202015-02-15%20at%203.21.56%20PM.png) | 25.97 KB |\n\n",
  "author": "likenickel",
  "time": "15 Feb 2015 — 12:50pm",
  "uid": "226316",
  "comments": [
    {
      "time": "16 Feb 2015 — 12:00pm",
      "content": "Welcome to Typophile. Maybe some variation in the identical letters would be nice —&nbsp;the Es and Rs — so it doesn't look like a word just set in a font, I think you'd want more of a handwritten look. Also do you really need the apostrophe at the end? I'm not a grammar expert but it looks a bit odd in a single word by itself.\n\n"
    },
    {
      "time": "16 Feb 2015 — 12:26pm",
      "content": "@JamesM Thanks for the feedback, that's so true! I must have gone a little crazy trying to make everything look slick and lost some of the original sketch along the way.\n\nHere's where I am now—I'm trying to talk the client out of the berries at the bottom, as it's already going on the label for homemade jam. Maybe having a less rigid baseline might help a little, too.\n\n ![](http://web.archive.org/web/20150317183904im_/http:/typophile.com/files/Screen%20Shot%202015-02-16%20at%203_4526.23.26%20PM.png)\n\nThanks so much for your feedback!!\n\n"
    },
    {
      "time": "16 Feb 2015 — 12:28pm",
      "content": "Oof, forgot to mention it's a cute retired couple who make jam together, and they wanted their last name as the possessive to \"homemade.\" Apostrophes at the end do look weird, though!\n\n"
    },
    {
      "time": "16 Feb 2015 — 12:46pm",
      "content": "With \"homemade\" added the apostrophe makes sense. (I presume their name ends with an S, otherwise the apostrophe would come between the Y and S.)\n\nI don't care for the berries either. One consideration is that when the logo is small, the berries become a blur. Probably not a factor on the label, but a logo needs to work in a small size.\n\n ![](http://web.archive.org/web/20150317183904im_/http:/typophile.com/files/berry_5523.jpg)\n\nI hope they're not going to pay with with jam. ;)\n\n"
    },
    {
      "time": "17 Feb 2015 — 4:36am",
      "content": "Why not make the apostrophe the berry, an ovalish rather than a roundish berry\n\n"
    },
    {
      "time": "17 Feb 2015 — 11:11am",
      "content": "JamesM—definitely paying money, not preserves, haha.  \nThat's a good idea, Anthony! Here's where I am now—a bit more irregularity and no berry at all.\n\n ![](http://web.archive.org/web/20150317183904im_/http:/typophile.com/files/RoseberryHomemade_6272.jpg)\n\n"
    },
    {
      "time": "17 Feb 2015 — 2:18pm",
      "content": "Anthony has a good idea. Berries come in different shapes so maybe with the right berry it could work. But I think you'd need to make it work as a silhouette, as surface details would be lost in small sizes.\n\n"
    },
    {
      "time": "17 Feb 2015 — 6:18pm",
      "content": "Consider increasing the space between e/b/e/r. The e/b pair feels tight now that you've made the eye of the first 'e' larger. Conversely, the new shape of the second 'r' makes the r/y spacing feel a bit open.\n\n"
    },
    {
      "time": "18 Feb 2015 — 2:40pm",
      "content": "I would consider losing the \"ears\" at the top of the \"e\"s. I assume you put it in as it reflects the one in the \"o\", but an \"e\" is not drawn like an \"o\", with the stroke rising and then reversing counterclockwise to complete the letter. I think the overall logotype would look a little cleaner and less busy if you take them on the out on the \"e\"s.\n\nI agree that the berry should come off the logotype. It looks very odd having this little detailed drawing dangling off this bold smooth flowing text. I think using it as an apostrophe would be lovely, if you can find a way of abstracting it a bit so it's more a shape than an illustration.\n\nThe \"homemade\" font is bugging me. It looks very severe and static compared to the type above it. I get the retro feel that you're going for, and I think it's appropriate, it just needs a bit more warmth to it. Maybe going from black to bold would soften it a bit?\n\n"
    },
    {
      "time": "23 Feb 2015 — 7:11am",
      "content": "Thanks so much for your time, everyone! Things definitely require more tinkering.\n\n"
    }
  ]
}
