{
  "id": "123204",
  "title": "Type Made for Kerning",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A thought struck me today; during the era of hot metal type, why is it that no one ever invented the following -\n\nSince the kerns for letters like j and Q in some typefaces are very fragile, why couldn't they have been made more durable by a strategem like the following:\n\nIn the area of a type slug below the baseline, for characters without descenders, cut a groove into the shoulder of the type, or lower the shoulder, so that there is room to put a reinforcing base below kerns.\n\nOr simply make the shoulder lower everywhere, so that the part of the type that is in the shape of the particular letter is deeper and hence stronger.\n\nIn the case of letters with descenders that are on only one side of the letter, like p and q, the groove or lowering of the shoulder should still be present on the side the descender does not occupy.\n\n",
  "author": "quadibloc",
  "time": "10 Feb 2015 — 2:26pm",
  "uid": "50554",
  "comments": [
    {
      "time": "11 Feb 2015 — 6:29am",
      "content": "An interesting exercise in hindsight!  \nIt would make things clearer if you illustrate your idea with a diagram.\n\n"
    },
    {
      "time": "11 Feb 2015 — 11:45am",
      "content": "I agree that a diagram would help, but I felt it would be difficult for me to prepare one. But here we are:\n\n ![](http://web.archive.org/web/20150317111647im_/http:/typophile.com/files/kern_6315.GIF)\n\nThis shows a kerned Qq in Garamond, with the downwards step in the shoulder on the q only going part way across since that letter has a descender.\n\n"
    },
    {
      "time": "11 Feb 2015 — 2:18pm",
      "content": "I suspect that it would be cheaper to cast replacement sorts than to cast a whole font that way.\n\n"
    },
    {
      "time": "12 Feb 2015 — 5:23am",
      "content": "Nice idea and drawing it reminds me of traditional Japanese carpentry joints. Now put it in a time machine and send it back to when it can do most good.\n\n"
    },
    {
      "time": "12 Feb 2015 — 8:53am",
      "content": "I am full of obsolete inventions.\n\nBack before laser printers, mainframe computers used big line printers to produce lots of output on paper quickly. Some used a rotating drum, with all the characters provided repeated at each character position, with a hammer at each character position forcing the paper and a ribbon against the raised character.\n\nOthers used a means of moving the characters across the page, so that only one (or a few, since the width of the page would be 132 characters, while usually 64 different characters or less could be printed - but in this case, unlike the drum printer, the characters were often spaced apart by more than the size of a column on the page) copy of each character would be needed.\n\nOf these printers, some used a flexible band, some used a chain of linked slugs with characters, and others used a print train where the hammer pushed a slug that could move forwards to the paper.\n\nIf the hammer hit at a slightly wrong time, for a drum paper the line was wavy, with letters displaced up and down; for one of these printers, the character would be moved to the right or left.\n\nWell, the thought struck me that this could be exploited, and a line printer could be made (with extra-wide hammers that would have to be able to be displaced horizontally into more than one position) that could do proportional spacing. Perhaps only crudely, like an IBM Executive typewriter.\n\nAnd as it happened, IBM made a line printer that moved the characters horizontally, but which used a solid bar with the characters rather than a band or belt or train.\n\nThat gave me the idea of using a print drum that moved horizontally to present each character to each print position for printing, and which rotated to make a different character set available.\n\nAn impact line printer that could print in Chinese? Along with doing, say, four-line mathematics?\n\n"
    },
    {
      "time": "12 Feb 2015 — 10:22am",
      "content": "I guess before letterpress became a more revered form of art, foundries were just too lazy or didn’t want to spend more time and energy producing kerned type. I’ve seen wood type being kerned by saws, but rarely with metal text faces. I’ve seen metal initials being kerned though.\n\nOr you could cast the letterform out of the face. ATF Garamont I worked with has its italic /f letterform protrude out of the rectangular face. That’s extra annoyance in the composing stick because you have to carefully sneak other letters under, but the /f is definitely kerned more in.\n\n"
    },
    {
      "time": "12 Feb 2015 — 5:36pm",
      "content": "@quadibloc - \"I am full of obsolete inventions.\"  \nTell me about it. I spent years developing a perspective-drawing machine, just when the PC started becoming popular and could draw such scenes. In other cases I would get an idea, jot a few pages of notes and go to the next thing. One such idea of 1983 was for super-resolved microscopy using time-resolved florescence. The idea, but not me, got the 2014 Nobel prize in chemistry!\n\nAs to protruding letters these days most modern Arabic fonts redesign the ra ر to descend vertically downwards and not cause trouble conflicting with the next letter ريا I had to spend months learning how to use OT features to adjust the dots of the next letter but did not change the ra shape.\n\n"
    },
    {
      "time": "12 Feb 2015 — 11:31pm",
      "content": "Vladimir Tamari \\> I had to spend months learning how to use OT features to adjust the dots of the next letter but did not change the ra shape.\n\n@ Move/change ra shape and/or move/rotate dots easily with QB! [http://typophile.com/node/120811](http://web.archive.org/web/20150317111647/http:/typophile.com/node/120811 \"http://typophile.com/node/120811\")\n\n"
    },
    {
      "time": "13 Feb 2015 — 6:47pm",
      "content": "I've never liked being the bearer of bad news, but...\n\n![](http://web.archive.org/web/20150317111647im_/http:/sanpitch.com/junk/kern_metal.jpg)\n\n"
    },
    {
      "time": "13 Feb 2015 — 8:18pm",
      "content": "Your pictures mostly show conventional kerned type, except in the case of the capital TA, were we see mortised type.\n\nI'm saying that conventional kerned type was recognized historically as being awfully fragile.\n\nOne way to deal with it would be simply to make the \"letter\" part of the type deeper, and the \"block\" part of the type shallower - that wouldn't change the nature of the kern, only the proportions of the type body, but it would make the kern tougher.\n\nYes, though, the \"letter\" still does have a bit of a base on it that's above shoulder height. But I'm suggesting drastically thickening that base and lowering that shoulder.\n\n"
    },
    {
      "time": "13 Feb 2015 — 11:31pm",
      "content": "I see what you mean. I should have read more carefully.\n\nJust speculation, but could these mortised bodies be a bit awkward in the sense that they might need to be cast to fit specific letter combinations? The size and shape of the notch needed for, say, a _TA_ might be different from a _T—_. In other words, it might be just as efficient and less troublesome to cast these particular pairings into a single body (a ligature, of sorts, I suppose).\n\nAlso since kerns were mostly reserved for display sizes where even spacing throughout the line of type would be most noticeable, slug bodies that fit together a bit like jigsaw puzzle pieces might not work with the usual quad spacers.\n\nAgain, though, just speculation. I really have no idea.\n\n"
    },
    {
      "time": "14 Feb 2015 — 9:49am",
      "content": "Well, just as the type would have to be modified, so would the quads and spaces - they would have to be shortened, to only reach to the level of the troughs that make room for kerns.\n\n"
    }
  ]
}
