{
  "id": "123392",
  "title": "Lucida Sans , ITC Syndor or What -- Unable to decide what is the font ?",
  "forum": "Home",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello Everyone,\n\nKindly advice me the right font face.\n\nThanks everyone in advance for their help, input or even looking.\n\nRegards,  \nHasnain\n\nFont:&nbsp;\n\n Androgyne \n\nSolved By:&nbsp;\n\n [Ryuk](http://web.archive.org/web/20150317055441/http:/typophile.com/user/22675 \"View user profile.\")\n\n| Attachment | Size |\n| --- | --- |\n| [garden.jpg](http://web.archive.org/web/20150317055441/http:/typophile.com/files/garden_0.jpg) | 29.06 KB |\n\n",
  "author": "hasnain125",
  "time": "20 Feb 2015 — 8:00am",
  "uid": "213115",
  "comments": [
    {
      "time": "20 Feb 2015 — 8:31am",
      "content": "[Androgyne](http://web.archive.org/web/20150317055441/http:/www.dafont.com/androgyne-tb.font) by Dimitri Castrique  \n(and another freebie for the tagline with [Sansation](http://web.archive.org/web/20150317055441/http:/www.fontsquirrel.com/fonts/sansation))\n\n"
    },
    {
      "time": "20 Feb 2015 — 1:20pm",
      "content": "I read the comments at Dafont regarding Androgyne including this accusation of piracy:\n\n----start quote---  \nxDupre Aug 02, 2010  \nI don't know how long Mr. Bigelow spent to design TEXTILE but I know I spent more than one year to design FF TARTINE SCRIPT.\n\nThis Androgyne is an interpolation between these 2 fonts. I did this operation, we arrive to the same result in less than 2 minutes. Then, you probably spent 1 or 2 hours to remove the inconsistencies...\n\nDimitri, if you want to mix Textile and FF Tartine Script, you can do it for your personal use BUT NOT sharing it on DAFONT.\n\nI invite users to use professionnal fonts to support designers who spend a lot of time designing typefaces.  \nCheck out my website to discover food types like the real FF Tartine Script or the completely new FF MASALA!  \n----end quote---  \nI would be very hesitant to use this font for anything commercial.  \nDon\n\n"
    }
  ]
}
