{
  "id": "123358",
  "title": "font with lower case that has same height as upper case",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hi and sorry if my english is a bit square.  \niam searching for fonts that has lower case with the same height/size as upper case.  \ndo you know any good fonts like that?  \nis there a special name for fonts with that feature?\n\ni need it for a logo of a group that uses a strange short cut like FuBaSa but i want all letters in the same height like its FUBASA.  \ni have a graphic that will be on the top. that graphic has a flat bottom like a straight line and the space that appears between that line and the lower case makes me saaaaaaaaad.\n\nthank you for any tips!\n\n",
  "author": "TKK",
  "time": "18 Feb 2015 — 1:19pm",
  "uid": "223674",
  "comments": [
    {
      "time": "18 Feb 2015 — 1:31pm",
      "content": "[\"Unicase\"](http://web.archive.org/web/20150322044530/http:/myfonts.us/td-kLWtw8) will be a useful search term. Although in most unicase fonts the \"case\" is determined by the shape of the letter (those with extenders are given uppercase form, the others, lowercase). It sounds like you want the /u/ and /a/ to be lowercase form and the /F/B/S/ to be uppercase?\n\n"
    },
    {
      "time": "18 Feb 2015 — 2:18pm",
      "content": "yes that is right but in my case it would be a and u. i can imagine the difference on u and U will be complicated. but i will try to search for unicase. thanks alot!\n\n"
    },
    {
      "time": "18 Feb 2015 — 2:45pm",
      "content": "1 Use Small caps and lower case - they are usually designed to do exactly what you want - and may only need some small fractional adjustment in size and or weight to look right.  \n2 If the above is not possible - and it depends on whether you have already chosen the font or had it chosen for you ... A thought occurs - in teaching typography years ago - I used to get all my students - to understand the importance of x-height by getting them to work out conversion factors across a wide variety of professional fonts so that in a piece of running text they could set paragraphs utilising a wide range of types but ensure that all the x-heights matched even if from word to word if the font was changed from what would have been large appearing typefaces to small appearing typefaces eg Helvetica to Park Avenue. I used to arbitrarily take times new roman 10pt as the base index and run a sheet of xxxxxxx’s each one with the name of the font and adjust the type size until I got an exact match to the times new roman x-height and then record the size required for the visual match.  \nIf I had your problem I might try two weights of the font the lighter one for the lowercase and character by character apply a similar conversion factor to the typesize so that the lowercase was enlarged to match the caps.  \nLove little problems like this that show off the brilliance of continuous digital adjustment ... and suggest new standards yet to be set - like measurement by actual appearing x-height - the most meaningful measure for the reader & lets do it in q (quarter of millimetre typographic points). Have fun ...\n\n"
    },
    {
      "time": "18 Feb 2015 — 3:31pm",
      "content": "Shinntype unicase typefaces:  \n [Parity](http://web.archive.org/web/20150322044530/http:/shinntype.com/typefaces/parity/)  \n [Panoptica](http://web.archive.org/web/20150322044530/http:/shinntype.com/typefaces/panoptica/)\n\nShinntype fonts with small cap height equal to x-height:  \n [Worldwide Regular](http://web.archive.org/web/20150322044530/http:/shinntype.com/typefaces/worldwide/)  \n [Scotch Modern Display](http://web.archive.org/web/20150322044530/https:/www.myfonts.com/fonts/shinn/scotch-modern/)\n\n"
    }
  ]
}
