{
  "id": "123419",
  "title": "Do you think praising Helvetica as the world most beautiful and perfect font is excessive?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "Helvetica",
    "Sans",
    "swiss"
  ],
  "content": "just came out with an idea who stand up for Comic Sans that judged as the world ugliest (famous) font with abundant inappropiate using.\n\n",
  "author": "Gunarta",
  "time": "22 Feb 2015 — 1:21am",
  "uid": "89178",
  "comments": [
    {
      "time": "22 Feb 2015 — 7:16am",
      "content": "While Comic Sans is not the world's prettiest or most perfect font, it has its uses but it should be limited to those. In a perfect world, we would have laws mandating its permitted use with enormous financial penalties for inappropriate use or perhaps even prison time.\n\nThere are certainly fonts that are far uglier which have also been used inappropriately, but that's just my opinion. There are also fonts that are technically well made and otherwise inoffensive that others consider ugly. Beauty is in the eye of the beholder.\n\n"
    },
    {
      "time": "22 Feb 2015 — 9:27am",
      "content": "In my opinion, in a perfect world, the First Amendment would be the law of the land in every nation. This would mitigate against penalties for inappropriate use of Comic Sans. Thus, the rule _de gustibus non disputandum_, usually translated as \"there is no accounting for taste\", should continue to hold.\n\nThis, of course, does not change the fact that in a _perfect_ world, no one would be _tempted_ to misuse Comic Sans. Maybe Microsoft would license an appropriate typeface from Comicraft to include with Windows that would replace it for the uses to which it is not suited.\n\nOh, wait a moment. In a **perfect** world, we wouldn't be _using_ Microsoft Windows on our computers.\n\nBut I do think it's excessive to praise Helvetica as the world's \"most beautiful\" typeface. It _is_ a beautiful one that nears perfection. But it's still excessive to praise Helvetica, Times Roman, Baskerville, Garamond, or even Eusebius, Centaur, or Doves in that respect. There are too many typefaces out there that are beautiful and near perfection to single out just one as standing above all the others.\n\n"
    },
    {
      "time": "22 Feb 2015 — 11:23am",
      "content": " ![](http://web.archive.org/web/20150322033439im_/http:/typophile.com/files/comic_5385.jpg)\n\nActually I don't love it, but as others have mentioned the problem is that it's used inappropriately.\n\nI like Helvetica and use it all the time (some of my clients use it as a corporate font), but you need to be careful as it was heavily used a few decades ago and work can look dated if you're not careful, especially using the heavier weights. For heads I try to stick to lighter and/or condensed.\n\n"
    },
    {
      "time": "22 Feb 2015 — 2:01pm",
      "content": "I don’t specifically hate Helvetica; I hate those who tries to give it metaphysical depth and talk BS like “it’s the most neutral typeface that doesn’t interfere with the conveyance of content”.\n\n"
    },
    {
      "time": "22 Feb 2015 — 5:07pm",
      "content": "“Helvetica is neutral” is a myth, to be sure.\n\nSome people doubtless think it the most beautiful. I don’t share that view, and I think those who do are a minority among typographers and even among designers in general, but beauty is in the eye of the beholder. Still, Helvetica’s biggest fans should be aware that plenty of other typefaces are at least as likely to win a beauty competition.\n\n"
    },
    {
      "time": "22 Feb 2015 — 8:51pm",
      "content": "> beauty is in the eye of the beholder\n\nThis is slightly off-topic, but there’s also a risk of being called “type snob” if I use Christian Schwartz’s Neue Haas Grotesk (which actually pleases me a lot more than the Linotype ver). “Like, way to go, identify yourself as having a slightly better taste than all your other Helvetica-loving mates.”\n\n"
    },
    {
      "time": "23 Feb 2015 — 7:26am",
      "content": "<cite>“it’s the most neutral typeface that doesn’t interfere with the conveyance of content”</cite>\n\nDepends on the content. I agree that this is \"nonsense\" in one way: Helvetica isn't even a particularly good text typeface. Univers is much better for that purpose if one must use a sans-serif.\n\nHowever, Helvetica Medium does get overused for signage for a reason. In that sphere, it is what people are used to, what they don't notice, what is invisible as a typeface. That, though, is clearly culturally based - a consequence of exposure to current fashions in typefaces.\n\nThe biggest problem with such comments is that they're dated. Extravagant praise of Helvetica was warranted when it first came out, as it gave the typographer something that just wasn't provided by previous sans-serif typefaces, whether of American or European origin. Today, though, its lessons have been fully assimilated by designers of sans-serif faces, and so many alternatives exist.\n\n"
    },
    {
      "time": "23 Feb 2015 — 11:30am",
      "content": "_Do you think praising Helvetica as the world most beautiful and perfect font is excessive?_  \nIt’s not excessive, it’s not even a question.\n\n"
    },
    {
      "time": "23 Feb 2015 — 6:50pm",
      "content": "Ubiquity breeds acceptance.  \n... And makes people think, \"this thing is so darn popular, it must have some merit\".\n\n"
    },
    {
      "time": "23 Feb 2015 — 10:35pm",
      "content": "Well, ubiquity breeds invisibility, and that is a meritorious trait in and of itself. So even Comic Sans could become a crystal goblet if it gets overused enough.\n\nOr _could_ it?\n\n"
    },
    {
      "time": "25 Feb 2015 — 5:42am",
      "content": ":o)\n\n"
    }
  ]
}
