{
  "id": "123442",
  "title": "Are rounded sans-serif typefaces good for signage/wayfinding?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "rounded",
    "signage",
    "typefaces"
  ],
  "content": "Hello,\n\nCould anyone link me to reading on the topic of rounded sans-serif typefaces being used for signage/wayfinding? I'm wondering what the pros/cons are of using a rounded typeface.\n\nThank you.\n\n",
  "author": "sstaccato",
  "time": "23 Feb 2015 — 12:32pm",
  "uid": "225769",
  "comments": [
    {
      "time": "23 Feb 2015 — 8:52pm",
      "content": "Why not?\n\nFF Info is a rounded (or roundish) sans designed for wayfinding.\n\nAccording to Erik Spiekermann, the rounded corners can save a lot of time in plotting and weeding the vinyl when manufacturing a large number of signs.\n\n"
    },
    {
      "time": "24 Feb 2015 — 7:35am",
      "content": "Yeah, definitely. I just imagined with all the testing and research that goes into way finding typefaces there surely would be some commentary on rounded typefaces in signage. Seems like there are successful typefaces for way-finding both rounded and not.\n\n"
    },
    {
      "time": "24 Feb 2015 — 10:02am",
      "content": "Since vinyl plotters slow down around curves, I'm not sure how you could save time plotting a font with rounded corners.\n\nWeeding is different though, it would probably be easier there.\n\n"
    },
    {
      "time": "24 Feb 2015 — 10:59am",
      "content": "My nephew works in a sign shop. I just texted him and he says their vinyl cutting equipment can handle any font without problems, and the speed seems around the same to him.\n\nMaybe it was different in the past. Talk to the company making your signs.\n\nI'd think that readability is the main factor if it needs to be read from a distance or from a moving vehicle. A full size mockup, when practical, is good for testing purposes.\n\n"
    },
    {
      "time": "24 Feb 2015 — 10:53am",
      "content": "<cite> I just imagined with all the testing and research that goes into way finding typefaces there surely would be some commentary on rounded typefaces in signage.</cite>\n\nI don’t know studies which researched such a specific design feature. In my opinion: It simply isn’t a relevant factor. Letter skeleton, stroke width, letter-spacing and of course type size are so much more important. So I would say it’s more a matter of stylistic freedom to pick a rounded font or not.\n\nI am also not clear about how much roundness you are thinking about. Something like [DIN Rounded](http://web.archive.org/web/20150322035528/http:/www.myfonts.com/fonts/linotype/din-next-rounded/refby=opentype)? Or just rounded corners as in FF Info or Wayfinding Sans?  \nIf it’s extreme as in DIN Rounded, I would say it slightly decreases legibility, because you remove information from the stroke ends. They are more “fuzzy” and not as articulated as they could be. But like I said: that’s a minor effect and can easily be compensated.\n\n"
    },
    {
      "time": "24 Feb 2015 — 2:12pm",
      "content": "I've seen my type family Chevin used as the wayfinding family for the Spitalfields area of London. It looked very clear and readable, and pretty good to me. (Well, it would of course).\n\n"
    },
    {
      "time": "24 Feb 2015 — 6:09pm",
      "content": "I guess I would say that there are other features of a sans serif other than whether or not it is rounded that make it better or worse for wayfinding. Rounding probably hurts a bit, but I expect that the difference between say Helvetica and Frutiger is still much greater than that between Helvetica and Helvetica Rounded.\n\n(Actually, in the case of Helvetica, the rounding might help, as it slightly opens the nearly-closed apertures that are the big problem of Helvetica.)\n\n"
    },
    {
      "time": "24 Feb 2015 — 9:07pm",
      "content": "There are situations where research does go into the selection of typefaces for signage. Thus, we have the special typefaces used for highway signage in the United States - because legibility, even under the poorest conditions, will save lives.\n\nIn other circumstances, though, the choice of typeface is left up to individuals who make their choices based on aesthetics and the image they wish to project.\n\nThus, Helvetica Medium has been treated as the ideal typeface for certain kinds of signage - subway stations, airline terminals, and the like - modern, efficient, inoffensive.\n\nUnless there are critical legibility concerns, therefore, if you happen to like a particular rounded sans-serif typeface, go for it.\n\n"
    },
    {
      "time": "25 Feb 2015 — 8:12am",
      "content": "I'm designing one, actually. I do want it rounded to some extent as it's based off hand-painted letters that include rounding, but I'm deciding whether it should be rounded to the extent of DIN Rounded or [Tondo](http://web.archive.org/web/20150322035528/http:/typophile.com/wiki/https%3A/%252Fwww.myfonts.com/fonts/daltonmaag/tondo/), or just rounded corners like Wayfinding Sans (which is a big inspiration). I know I will not reach the functionality of mentioned fonts but I am having fun learning. Thanks for the helpful discussion.\n\n"
    },
    {
      "time": "25 Feb 2015 — 12:25pm",
      "content": "I was thinking that sharp cuts would always improve legibility, then realised that one of my favourite wayfinding typefaces is quite rounded: [http://typography.guru/journal/guia-typeface/](http://web.archive.org/web/20150322035528/http:/typography.guru/journal/guia-typeface/ \"http://typography.guru/journal/guia-typeface/\")\n\n"
    },
    {
      "time": "2 Mar 2015 — 6:08am",
      "content": "Make a full size sign with both rounded and unrounded designs for the legends. Get 5 friends together and walk back well past the intended viewing distance. See what happens.\n\n"
    }
  ]
}
