{
  "id": "123406",
  "title": "Used in Black Sun Press in 1920s & 1930s",
  "forum": "Home",
  "tags": [
    "Serif"
  ],
  "content": " ![](http://web.archive.org/web/20150415022448im_/http:/typophile.com/files/TypeSample_4107.jpg)\n\n",
  "author": "QualePress",
  "time": "21 Feb 2015 — 6:59am",
  "uid": "226469",
  "comments": [
    {
      "time": "21 Feb 2015 — 8:03am",
      "content": "Are you certain the book was published by Black Sun? It is not listed in their body of works. Mr. Crosby did own a copy of the first English translation of Krafft-Ebing's \"Psychopathia Sexualis\", Rebman, London 1905, but I see no evidence he ever reprinted it. Frankly its content does not fit within the scope of what they normally published.\n\nAll that being said, you still want to know the font. Knowing where it was published and by whom might make identification a bit easier.\n\n"
    },
    {
      "time": "21 Feb 2015 — 11:54am",
      "content": "OK, here's what I can find....\n\nThe font in the picture has not been identified. It does, however, have many quirky characters which the old metal face Grasset (Deberny & Peignot, 1898; ATF, 1904; and Monotype, 1912) has in common. The overall look is very similar.\n\nI suspect the font in the picture is based on Grasset -- or the other way around. Grasset is not available in digital form under that name that I could find, but there are two digital versions under other names.\n\nOctavian, at [http://www.myfonts.com/search/octavian/fonts/](http://web.archive.org/web/20150415022448/http:/www.myfonts.com/search/octavian/fonts/ \"http://www.myfonts.com/search/octavian/fonts/\") (not a very good version -- look at the lowercase /t -- it is way over-size)\n\nGrantham, free download at [http://www.moorstation.org/typoasis/designers/lloyd/grantham.htm](http://web.archive.org/web/20150415022448/http:/www.moorstation.org/typoasis/designers/lloyd/grantham.htm \"http://www.moorstation.org/typoasis/designers/lloyd/grantham.htm\"). This appears to be a pretty good version and should at least give you the appearance you are looking for.\n\nUnless, of course, you are wishing to digitize the font in the picture. If that is the case, you still have to identify it and find a usable specimen of it.\n\n"
    },
    {
      "time": "21 Feb 2015 — 1:21pm",
      "content": "The book is Sleeping Together, by Harry Crosby, published by Black Sun Press in 1929 in Paris. I'll look into the typefaces you recommend.\n\n"
    },
    {
      "time": "21 Feb 2015 — 1:41pm",
      "content": "Some good approximations but I'm looking to get something that best matches that extended crossbar on the cap A.\n\n"
    },
    {
      "time": "21 Feb 2015 — 7:23pm",
      "content": "Hmm. That title is not in a list of Black Sun's works.\n\nIs the entire book set in that font?\n\n"
    },
    {
      "time": "21 Feb 2015 — 11:53pm",
      "content": "I think Louvaine, designed in 1928 and issued in 1929, but did not last long enough to appear in the 1934 ATF catalog, is closer than Grasset. Consider Louvaine Medium:\n\n ![](http://web.archive.org/web/20150415022448im_/http:/typophile.com/files/LouvaineMed@McGrew204b@30pct_5365.jpg)\n  \nComments by Jaspert: \"...designed by M.F. Benton, based on a Bodoni model, but with the peculiarity found in a number of modernistic types of making the thicks and thins meet at an angle. This is especially noticeable in the O and the S. The g and y have cursive tails....\"  \nComments by McGrew: \"LOUVAINE series was designed by Morris F. Benton for ATF in 1928. It is an adaptation of Bodoni (the working title was Modern Bodoni), and many of the characters are identical. Only g and y are basically different; otherwise the distinction is in the more abrupt transition from thick to thin strokes in this series. In this respect, Ultra Bodoni has more affinity to Louvaine than to the other Bodoni weights. The three weights of Louvaine correspond to Bodoni Book, regular, and Bold. This series did not last long enough to appear in the 1934 ATF specimen book, the next complete one after its introduction. \"  \nDigital bold weight -- no Medium or Light -- from Bulldog [http://www.fontshop.co.uk/a\\_to\\_z\\_listing/id/21999](http://web.archive.org/web/20150415022448/http:/www.fontshop.co.uk/a_to_z_listing/id/21999 \"http://www.fontshop.co.uk/a\\_to\\_z\\_listing/id/21999\")  \nDon\n\n"
    },
    {
      "time": "22 Feb 2015 — 12:29am",
      "content": "The a plumb-line, vertically-stemmed \\_y\\_ tail was a feature of some pre 1917 century Cyrillic fonts\n\n ![](http://web.archive.org/web/20150415022448im_/http:/typophile.com/files/PanTadeusz1902detail_5212.jpg)\n and a semi vertical form was found in Bauer Bodoni as a metal type.  \ndon\n\n"
    },
    {
      "time": "22 Feb 2015 — 6:07am",
      "content": "Why it might not appear in the Black Sun catalog is that it is volume 3 of Collected Works. It's that distinctive extended crossbar on the cap A that's critical.\n\nTitle: Sleeping together; a book of dreams.  \nAttribution: With a memory of the poet by Stuart Gilbert.  \nAuthor / Creator: Crosby, Harry, 1898-1929.  \nPublished: Paris, Black Sun Press, 1931.  \nDescription: 65, ix p. port. 23 cm.  \nLanguage: English  \nAuthor / Creator: Crosby, Harry, 1898-1929. Collected poems, v.3.  \nSeries: His Collected poems, v.3  \nCreation Date: 1931  \nHOLLIS Number: 005073186  \nPermalink: [http://id.lib.harvard.edu/aleph/005073186/catalog](http://web.archive.org/web/20150415022448/http:/id.lib.harvard.edu/aleph/005073186/catalog \"http://id.lib.harvard.edu/aleph/005073186/catalog\")  \nSource: HVD ALEPH\n\n"
    },
    {
      "time": "22 Feb 2015 — 6:39am",
      "content": "Might be a lead in this account of the Black Sun Press:\n\n---start quote---  \nStarted in 1927 by Harry and Caresse Crosby ... young expatriates living in Paris, the Black Sun Press was created to publish its founders’ ... attempts at verse in beautifully bound, hand set books. ... the Crosbys found Roger Lescaret, a \"master printer\" whose previous works had been primarily funeral notices, to print Harry’s poems in a fine edition. They were so delighted at the result, Red Skeletons, with illustrations by their friend Alastair [the professional name of Hans Henning von Voight], that they decided to found a press. In a typical combination of high ideals and deflating humor, it was first called Éditions Narcisse – after their black whippet, Narcisse Noir.  \n---end quote---  \n [http://www.english.illinois.edu/maps/poets/a\\_f/crosby/blacksun.htm](http://web.archive.org/web/20150415022448/http:/www.english.illinois.edu/maps/poets/a_f/crosby/blacksun.htm \"http://www.english.illinois.edu/maps/poets/a\\_f/crosby/blacksun.htm\")  \nSo perhaps a bespoke typeface for or by Roger Lescaret.  \nDon\n\n"
    },
    {
      "time": "22 Feb 2015 — 6:50am",
      "content": "Another example of the BSP font, perhaps including an italic [http://www.english.illinois.edu/maps/poets/a\\_f/crane/blacksun.htm](http://web.archive.org/web/20150415022448/http:/www.english.illinois.edu/maps/poets/a_f/crane/blacksun.htm \"http://www.english.illinois.edu/maps/poets/a\\_f/crane/blacksun.htm\")  \nDon\n\n"
    },
    {
      "time": "22 Feb 2015 — 6:55am",
      "content": "Also perhaps the italic for the BSP font [http://commons.wikimedia.org/wiki/File:Prospectus\\_of\\_James\\_Joyce%27s\\_Col...](http://web.archive.org/web/20150415022448/http:/commons.wikimedia.org/wiki/File:Prospectus_of_James_Joyce%27s_Collected_Poems_from_the_Black_Sun_Press,_1936.jpg \"http://commons.wikimedia.org/wiki/File:Prospectus\\_of\\_James\\_Joyce%27s\\_Collected\\_Poems\\_from\\_the\\_Black\\_Sun\\_Press,\\_1936.jpg\")  \nDon\n\n"
    },
    {
      "time": "22 Feb 2015 — 6:59am",
      "content": "It's very strange to me that the content shown in the image would appear in a \"collected works\" volume, even more so because Mr. Crosby did not write the content shown.\n\nAside from that, if it is only the /A that is critical, why not use Grantham and ask someone to modify the /A for you, or download FontForge (free font editor) and do it yourself? Since Grantham is a free font, I'm sure the license will allow you to do that if you don't plan on redistributing the font.\n\nI agree with Don that perhaps the font in question was never a commercial font.\n\n"
    },
    {
      "time": "22 Feb 2015 — 10:55am",
      "content": "Mr. Thomas, I assure you that Harry Crosby wrote the material in the photograph. It is from his book Chariots of the Sun ( [http://www.poemhunter.com/poem/psycopathia-sexualis/](http://web.archive.org/web/20150415022448/http:/www.poemhunter.com/poem/psycopathia-sexualis/ \"http://www.poemhunter.com/poem/psycopathia-sexualis/\")). I apologize because I inadvertently used the photograph of that page thinking that it was from his book Sleeping Together. Both use the same typeface. My assistant took the photo and I forgot that I had instructed her to photograph all prose poems that were not included in Sleeping Together. (See: [http://www.amazon.com/The-Collected-Poems-Harry-Crosby/dp/B004CULP6M](http://web.archive.org/web/20150415022448/http:/www.amazon.com/The-Collected-Poems-Harry-Crosby/dp/B004CULP6M \"http://www.amazon.com/The-Collected-Poems-Harry-Crosby/dp/B004CULP6M\").)\n\nInformation from everyone has been extremely helpful. I was hoping that the typeface would be commercially available. Looks like it was a minor early 20th century typeface that was probably not used for much bookwork since Lescaret did not primarily focus on books. If I want to use that typeface for my press, I'll have to make alterations to an existing similar typeface that has an open license. All those leads above on similar typefaces are very helpful and I again thank Mr Thomas and Don for their expertise.\n\n"
    },
    {
      "time": "22 Feb 2015 — 12:43pm",
      "content": "I wouldn't hold out hope that this face is commercially available. To my eye, it's a real dog's dinner of a typeface, combining elements of Grasset, Louvaine, Bewick Roman and Graybar Book, without really resolving the differences among them.\n\n"
    },
    {
      "time": "22 Feb 2015 — 1:52pm",
      "content": "Good point. No disputing that the typeface verges on Frankenfontism. The most striking feature is the pregnant \\_S\\_ and \\_s\\_, but this is not reconciled with other features such as the Louvainesque feature of making the thicks and thins meet at an angle, the German single story \\_g\\_, the Didotesque \\_y\\_ with the plumb drop vertical descender, and some of the quirky touches in the styles of Grasset, Bewick Roman and Graybar Book.  \nHowever, perhaps it was appropriate for a press that dealt with topics that were far from conventional.  \nDon\n\n"
    },
    {
      "time": "23 Feb 2015 — 11:21am",
      "content": "I agree with Nick. I hunted in all my books and Graybar/Louvaine are the closest I could find. A problem is that Lescaret may have used an existing (but obscure to us) French typeface. I don't know about you guys, but my collection of information about European types is pretty sketchy. (I searched McGrew's book, in case it was an American type, but I didn't see it.) Then I suppose there is also the possibility that he may have developed his own typeface, but if he did he escaped the notice of Luc Devroye. That makes me suspect he used something that was available to him, but perhaps from an obscure foundry.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "23 Feb 2015 — 1:06pm",
      "content": "The production runs were very short, so I believe that this is a letterpress font rather than something that meets the technical specs for a typecasting machine like Linotype. So I wouldn't rule out bespoke.  \nPrivate presses in the early 20th century with aspirations to uniqueness sometimes made the effort to have a unique typeface. Recall for example the Doves Press. In these cases vanity trumped profitability.  \nMight be worth a search of the books on private presses to see if there is anything on Black Sun Press.  \nfor example Hugh Ford's \\_Published in Paris: American and British writers, printers, and publishers in Paris, 1920-1939 [1975]\\_ [http://www.amazon.com/Published-Paris-American-publishers-1920-1939/dp/0...](http://web.archive.org/web/20150415022448/http:/www.amazon.com/Published-Paris-American-publishers-1920-1939/dp/0855112123 \"http://www.amazon.com/Published-Paris-American-publishers-1920-1939/dp/0855112123\") I trust there are others. For more leads Google \"Paris private presses black sun\" or visit a good university library and check their holdings for LOC classification Z321 and nearby.  \nDon\n\n"
    }
  ]
}
