{
  "id": "123495",
  "title": "Cultural Imperialism",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Saw this Spiekermann piece on Medium: [https://medium.com/@espiekermann/cultural-imperialism-stems-from-ignoran...](http://web.archive.org/web/20150322035107/https:/medium.com/@espiekermann/cultural-imperialism-stems-from-ignorance-7bb32f1de196 \"https://medium.com/@espiekermann/cultural-imperialism-stems-from-ignorance-7bb32f1de196\")\n\nApparently Spiekermann is writing to resonate with the medium team’s piece that self-praises how great and inclusive their typography is. He writes\n\n> US clients often wonder why they need to pay for all those obscure accents. A bit of cultural imperialism in play, or plain ignorance, which is not the same, but has the same outcome.\n\nNot wrong at all. But it got me thinking: do you really need to buy a Pro version of a typeface that supports extended Latin, when your client has a super limited budget and they’re sure they will only deal with English-speaking regions? Big companies like Google will definitely need as much language coverage as possible, but “all US clients” seems to be overstating.\n\n",
  "author": "grubstreet",
  "time": "25 Feb 2015 — 4:55pm",
  "uid": "205070",
  "comments": [
    {
      "time": "25 Feb 2015 — 7:07pm",
      "content": "I'd tell the client what both versions cost and let them decide. If they pick the non-pro version and regret it later, it was their decision.\n\n"
    },
    {
      "time": "25 Feb 2015 — 8:54pm",
      "content": "I suppose it depends on how much is being charged for \"all those obscure accents\".\n\nObviously, if the type designer is constrained to expend effort on covering a wide range of languages using the Latin script with his font, that labor needs to be paid for. If this is done by making an extensive range of accents the dividing line between the regular and \"Pro\" versions of a font - the way that a Xeon or Opteron processor has features that a consumer processor does not, and comes at a considerable price premium - then those who don't need them won't buy them.\n\n"
    },
    {
      "time": "25 Feb 2015 — 11:28pm",
      "content": "> they’re sure they will only deal with English-speaking regions\n\nIn this day and age, that’s presumptuous.  \nWhat about, just to make an example, clients’ names?  \nThat said, I found that the first obstacle to a more-than-just-ASCII typography (which includes, other than diacritics, proper quotations, etc.) aren’t fonts, but software support and input methods.\n\n"
    },
    {
      "time": "26 Feb 2015 — 6:07am",
      "content": "It could be an overtly naïve attitude vis-à-vis accepted études in loanwords.\n\n"
    },
    {
      "time": "26 Feb 2015 — 7:22am",
      "content": "Well, common loanwords usually just use the basic European accents found in ISO 8869-1, which usually don't cost extra.\n\n"
    },
    {
      "time": "26 Feb 2015 — 6:50am",
      "content": "Theunis de Jong and riccard0, yes, a writer in today's world will need that stuff.\n\n"
    },
    {
      "time": "26 Feb 2015 — 6:55am",
      "content": "A straightforward solution would be, of course, a modular/incremental upgrade pricing, along the lines of webfonts’ subsetting.\n\n"
    },
    {
      "time": "26 Feb 2015 — 9:25am",
      "content": "The client is always right.\n\n"
    },
    {
      "time": "26 Feb 2015 — 12:49pm",
      "content": "> modular/incremental upgrade pricing\n\nI haven’t seen that coming very often. On the contrary, I’ve seen several foundries’ licensing terms that explicitly denies possibility for upgrading. Basically you just don’t pay extra to upgrade; you pay the full amount again.\n\n"
    },
    {
      "time": "26 Feb 2015 — 1:55pm",
      "content": "??  \nThis almost sounds like pricing fonts by the glyph. Does anyone do that?\n\nFor what it is worth, language support is the same in all my fonts, \"pro\", free or otherwise. It's the OT features and general complexity that increase prices. Why would I charge someone who needs some of those “obscure foreign accents” more than I’d charge anyone else? Or put another way, how can I expect to sell any fonts in Turkey or Esperantia if I ignore language support?\n\nFrom the client's perspective, it also depends on the application. In two recent projects, I commissioned signage versions of two typefaces for my employer. I didn't specifically say to the designers, \"Don't include all those obscure foreign accents.\" but I did suggest that for at least one of the typefaces that the designer could limit language support to Latin 1 - But not because I thought I'd save anyone any money. Since our signs will only ever be set in English and French, by the time the projects passed all the hurdles of getting approved, the time to actually do the work was getting really tight and it seemed like a logical place to save a little bit of time – Although how much time, is a good question. They'e components. They update automatically.\n\n"
    },
    {
      "time": "28 Feb 2015 — 2:45pm",
      "content": "I would modify the comment \"It's the OT features and general complexity that increase prices\" to read \"It's the OT features and general complexity that increase costs.\"  \nIt takes relatively little time to churn out a full set of accents using a modern fontmaking program. It is time consuming to design ligatures and do correct OT coding. Time is cost.\n\nHowever, if I retained anything from my economics degree of many years ago, it's the concept that the price of a font -- like everything else in a free market -- is determined by the intersection of supply and demand. What this ends up meaning in the real world is that the price at which a font will actually sell bears no direct relationship to cost. Some fonts make a profit and others end up being \"a labor of love\" which will never pay for the cost of developing them.\n\nThis applies both to bespoke fonts and retail ones.  \nFor a bespoke font any pricing scheme -- no matter how peculiar it may seem to the fontmaker -- works if it is what the client wants.\n\nLawyers can get rich from \"billable hours.\" Any fontmakers who could get this deal would be in the lap of luxury.\n\nDon\n\n"
    },
    {
      "time": "28 Feb 2015 — 3:07pm",
      "content": "I forgot to mention monopoly power. Does not apply to a font maker. But it does come into play when the providers of web fonts can charge on the basis of measurable usage or on an annual subscription basis. Similar deal as the cable companies that charge monthly for the broadcast stations that they pick up for free.  \nDon\n\n"
    }
  ]
}
