{
  "id": "12341",
  "title": "Lanston Type Co.",
  "forum": "Home",
  "tags": [
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/Indices) : [Foundries](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/Foundries) : Lanston Type Co.**\n\nLanston Type's rich history dates back to 1887 when [Tolbert Lanston](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/Tolbert%20Lanston) received his first patent for a mechanical typesetting device. Later refinements led to the Monotype casting machine and the emergence of the Lanston Monotype Company as one of the most renowned type supply companies in the world. The [Monotype caster](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/Monotype%20caster) was revolutionary and along with other automated typesetting machines helped to usher in a new age of printing technology. Typesetting had, until this time, remained the same as [Gutenberg](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/Gutenberg)'s first hand-set movable type.\n\nIn the late 1800s, Tolbert Lanston licensed his technology to an English sister company and became a major international force. Lanston grew rapidly with America's pre-eminent type designer, Frederic Goudy, holding the position of art director from 1920-1947. The Philadelphia-based Lanston Monotype eventually parted ways with its English counterpart. English Monotype became simply known as [Monotype](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/Monotype) from that time forth. Lanston was acquired by [American Type Founders](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/American%20Type%20Founders) in 1969. After a series of other owners, the company found its way to master printer [Gerald Giampa](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/Gerald%20Giampa), who moved it to Prince Edward Island in 1988. During its time of transition, Lanston continued supplying the American market for monotype hot metal type needs until January 21, 2000, when the majority of Lanston's machinery and historical records were tragically destroyed by a tidal wave.\n\nGiampa was one of the earliest developers of PostScript fonts. After the loss, he focused on digitization to an even greater extent. Under his stewardship, Lanston's classic faces were digitized in a style that was true to the sources, which are the brass and lead patterns from which the metal type was made. The past few years have seen Giampa and Lanston travel from Canada to Finland, and back again. In late 2004, Lanston has completed another journey back to the United States to come under the care of a new steward: [P22 type foundry](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/P22). Giampa is answering the call of the sea. He has traded his type founder's hat for that of a ship's captain to sail the northern Pacific coast. During his shore leaves, Giampa continues to act as typographic consultant to Lanston-P22.\n\nLanston Type continues its hundred-plus year tradition of supplying quality type for discerning users. Now under the P22 type foundry family of font collections, Lanston-P22 will present many of the famous type designs of [Frederic Goudy](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/Frederic%20Goudy) and [Sol Hess](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/Sol%20Hess) as well as typographic classics that every designer should have in their library such as the [Bodoni](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/Bodoni) and [Caslon](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/Caslon) families. Periodic releases will be announced along with introductory special pricing. Lanston-P22 reaffirms its dedication to the work of Lanston's most famous type director; Frederic Goudy with eventual release of all of the Goudy faces based on the most authentic surviving sources. Many of the Lanston digital faces were digitized from the actual metal patterns which were used to make the master punches from which the type was originally cast. The addition of [OpenType](http://web.archive.org/web/20150202174252/http:/typophile.com/wiki/OpenType) will allow for expanded font character sets as well as alternates and ligatures. The historical focus of the P22 font collections and the colorful history of the Lanston Monotype company offer a combined resource suitable for a wide variety of design solutions.\n\n[http://www.p22.com/Lanston/](http://web.archive.org/web/20150202174252/http:/www.p22.com/Lanston/ \"http://www.p22.com/Lanston/\")\n\n",
  "author": "James Grieshaber",
  "time": "10 May 2005 — 10:28am",
  "uid": "633",
  "comments": [

  ]
}
