{
  "id": "123537",
  "title": "LF Font name for this \"Roman\"(?) font",
  "forum": "Home",
  "tags": [
    "Serif"
  ],
  "content": "I used this font at some point for an old business logo ... I refreshed my computer a few weeks ago, and I thought I saved the font...\n\nI think it's a Roman Serif font: howver it has decoration to the letters. Hope somone can help. I've tried most of the font finders, but I just can't seem to find it.  \nI've included an attachemtn so that you can download it if you need to.  \nThanks !\n\n ![](http://web.archive.org/web/20150417042535im_/http:/typophile.com/files/Untitled-1_6348.png)\n\nFont:&nbsp;\n\n Trajan modification \n\nSolved By:&nbsp;\n\n [me](http://web.archive.org/web/20150417042535/http:/typophile.com/user/188844 \"View user profile.\")\n\n| Attachment | Size |\n| --- | --- |\n| [Untitled-1.png](http://web.archive.org/web/20150417042535/http:/typophile.com/files/Untitled-1_29.png) | 31.47 KB |\n\n",
  "author": "Kirnath",
  "time": "27 Feb 2015 — 9:33pm",
  "uid": "214140",
  "comments": [
    {
      "time": "27 Feb 2015 — 10:00pm",
      "content": "Looks like someone has been modifying Adobe Trajan...\n\n"
    },
    {
      "time": "27 Feb 2015 — 11:26pm",
      "content": "If someone did it wasnt me :) It's an actual font, pretty sure I made the caps small caps too.... I srsly have way too many fonts to go through...(11,000 and counting), and I'm not even sure if I saved it....thankfully I don't have them load all at once!\n\n"
    },
    {
      "time": "28 Feb 2015 — 12:18am",
      "content": "I found it, and Yes it was a Trajan modification. oddly tho I odn't remember where I got it... I normally only buy fonts, try not to do free ones unless they are from google... so I wonder if it's been a older one since I started doing this anyway.... :)\n\n"
    },
    {
      "time": "28 Feb 2015 — 2:18pm",
      "content": "My apologies Kirnath, I wasn't accusing; just making an observation. This, at least to my eyes, clearly started out life as Trajan and was modified by adding the swash details. Also, each letter was altered by changing or clipping one or more serifs as well as clipping the ascender on the 'N' and extending the peak of the 'A'. While it might be presumptuous of me to say so, I think this was an attempt to avoid copyright infringements.\n\n"
    }
  ]
}
