{
  "id": "123548",
  "title": "“Un-authoritative” Serif Body Typeface Suggestions",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all,\n\nI’m doing a branding project for my school’s library, and admins wanted a typeface that doesn’t evoke academia, or suggest anything about teaching, expertise, tradition, poise or authority. So Venetian and Garalde are immediately off the list. Also don’t want to use French modern or Scotch Roman (too delicate, too Vogue-like).\n\nThis is a body typeface that will be paired by an either softened Neo-Grotesk or a humanist sans. I’m a bit out of ideas: what kind of serif performs well in long-form text while does not have too much calligraphic reminiscence to be considered classy? I proposed Lyon, which is already non-traditional enough (Noordzij style very obvious though) but still got rejected. Do I have to go with a slab?\n\n",
  "author": "grubstreet",
  "time": "1 Mar 2015 — 12:46am",
  "uid": "205070",
  "comments": [
    {
      "time": "1 Mar 2015 — 2:11am",
      "content": "I don’t know if you consider it a slab serif, but I think something like Chaparral could work.\n\n"
    },
    {
      "time": "1 Mar 2015 — 4:48am",
      "content": "The Guardian face.  \nOr Beaufort, that’s quite bland too.\n\n"
    },
    {
      "time": "1 Mar 2015 — 9:20am",
      "content": "There's a lot about what they want it to NOT be, but you don't have a direction until you know what they DO want it to be. From the context, my chips are on \"fun\", in which case you are probably going to have to go well outside the realm of what are conventionally considered text faces before you have something unsubtle enough to be approved. Start with humanist slabs, and if you're very lucky, you won't be picking among casual comic hands in the end.\n\n"
    },
    {
      "time": "1 Mar 2015 — 11:56am",
      "content": "Maybe something like Rayuela?\n\n[http://www.myfonts.com/search/rayuela/fonts/](http://web.archive.org/web/20150322044608/http:/www.myfonts.com/search/rayuela/fonts/)\n\n"
    },
    {
      "time": "1 Mar 2015 — 12:22pm",
      "content": "Two other options:  \n [http://www.huertatipografica.com/fonts/alegreya-ht-pro](http://web.archive.org/web/20150322044608/http:/www.huertatipografica.com/fonts/alegreya-ht-pro \"http://www.huertatipografica.com/fonts/alegreya-ht-pro\")  \n [http://www.fontspring.com/fonts/exljbris/calluna](http://web.archive.org/web/20150322044608/http:/www.fontspring.com/fonts/exljbris/calluna \"http://www.fontspring.com/fonts/exljbris/calluna\")\n\n"
    },
    {
      "time": "1 Mar 2015 — 3:14pm",
      "content": "I think some of these non-slab serif faces could work -- they're playful (quirky even), contemporary and at the same time are perfectly suited for long bodies of text:\n\nDolly ( [http://www.underware.nl/fonts/dolly/](http://web.archive.org/web/20150322044608/http:/www.underware.nl/fonts/dolly/))  \nFeijoa ( [http://www.vllg.com/klim/feijoa](http://web.archive.org/web/20150322044608/http:/www.vllg.com/klim/feijoa))  \nYoga ( [http://www.fontfont.com/fonts/yoga](http://web.archive.org/web/20150322044608/http:/www.fontfont.com/fonts/yoga))\n\nI'm also partial to last year's Franziska ( [http://www.fontfont.com/fonts/franziska](http://web.archive.org/web/20150322044608/http:/www.fontfont.com/fonts/franziska))... It's just a tad more slab-ish, but it shares so much of the versatile but playful characteristics of the others I didn't want to leave it out.\n\n"
    },
    {
      "time": "2 Mar 2015 — 7:09am",
      "content": "Font Bureau's [Prensa](http://web.archive.org/web/20150322044608/http:/www.fontshop.com/families/prensa)?\n\n"
    },
    {
      "time": "2 Mar 2015 — 1:07pm",
      "content": "Should things go really droll, you could always try waving something like PT Serif or Liberation Serif or even Luxi Serif at them.\n\n"
    },
    {
      "time": "2 Mar 2015 — 2:04pm",
      "content": "A classic slab-serif like Cairo or Memphis or Stymie certainly is suitable for extended text in a pinch.\n\nObviously, you don't want to use Comic Sans; not only isn't it a serif typeface, but it's badly overused.\n\nIs it possible you might be able to get away with Century Expanded or Goudy Old Style... or Corona, or Ionic No. 5? Textype, based on Century Expanded, and available from Bitstream as Century 731, doesn't seem too authoritarian in appearance.\n\n"
    },
    {
      "time": "2 Mar 2015 — 2:17pm",
      "content": "I guess most fonts designed for newspaper publishing should do; [Mercury](http://web.archive.org/web/20150322044608/http:/www.typography.com/fonts/mercury-text/overview/) and [Swift](http://web.archive.org/web/20150322044608/https:/www.myfonts.com/fonts/linotype/swift/) come to my mind.\n\n"
    },
    {
      "time": "3 Mar 2015 — 11:08am",
      "content": "I overlooked the obvious, because in general I'm not too fond of this typeface...\n\nBookman!\n\n"
    },
    {
      "time": "3 Mar 2015 — 11:45am",
      "content": "Ok, I forgot this one. Here is a citation from [A Backward Glance at Eighty](http://web.archive.org/web/20150322044608/http:/www.readcentral.com/chapters/Charles-A-Murdock/A-Backward-Glance-at-Eighty/011) by Charles Murdock\n\n> In my publications I followed a somewhat severe style of typography, especially priding myself on the possession of a complete series of genuine old-style faces cast in Philadelphia from moulds cut a hundred and seventy years ago. In these latter days a few bold men have tried to improve on this classic. One Ronaldson especially departed from the simplicity and dignity of the cut approved by Caxton, Aldus, and Elzévir, and substituted for the beautiful terminal of, say the capital T, two ridiculous curled points. I resented it passionately, and frequently remarked that a printer who would use Ronaldson old-style would not hesitate to eat his pie with a knife.\n\nGiven the specs, that would, I guess, justify using [Ronaldson](http://web.archive.org/web/20150322044608/https:/www.myfonts.com/fonts/canadatype/ronaldson/).\n\nBy the way, Ronaldson was used for textbooks at least here in Quebec at the beginning of the twentieth century.\n\n"
    },
    {
      "time": "7 Mar 2015 — 12:23pm",
      "content": "A\n\nNAME\n\nhas bubbled to the surface from the depths of my **subconscious mind**.\n\n[Benguiat](http://web.archive.org/web/20150322044608/http:/www.identifont.com/show?N9)\n\n"
    },
    {
      "time": "7 Mar 2015 — 11:12pm",
      "content": "Thanks for all the advice.  \nWe’re set on Cronos & Elena for now...\n\n"
    }
  ]
}
