{
  "id": "123518",
  "title": "On a building built in 1868",
  "forum": "Home",
  "tags": [
    "Display"
  ],
  "content": " ![](http://web.archive.org/web/20150424032727im_/http:/typophile.com/files/Institute%201868.jpg)\n\nI feel like I’ve seen this elsewhere, but I can’t pin it down. It’s a little similar to fonts that are called Lombardic, but it much less flowing. Can anyone identify it?\n\n| Attachment | Size |\n| --- | --- |\n| [Institute 1868.jpg](http://web.archive.org/web/20150424032727/http:/typophile.com/files/Institute%201868.jpg) | 15.91 KB |\n\n",
  "author": "seanos",
  "time": "26 Feb 2015 — 9:45pm",
  "uid": "213635",
  "comments": [
    {
      "time": "27 Feb 2015 — 1:21am",
      "content": "Lettering on buildings of the era was custom designed by the architect or builder rather than being copied direct from a font. As you note it's similar to Lombardic. The medial spurs and Tuscan terminals make it a true Victorian Frankenfont.  \nFor digital fonts with some similarity to the Lombardic design you could also check for fonts tagged uncial, medieval, illuminated, Irish, medieval and Celtic.  \nI posted a fairly comprehensive set of links to this genre of fonts in [http://typophile.com/node/123144](http://web.archive.org/web/20150424032727/http:/typophile.com/node/123144 \"http://typophile.com/node/123144\")  \nDon\n\n"
    },
    {
      "time": "10 Mar 2015 — 12:07am",
      "content": "Thanks for the reply Don. I should have realised it wouldn’t be a font as such. I wonder though if they did work from some kind of examples.\n\nI knew there was something incongruous about it all, but as frankenfonts go I don’t find it too appalling. I don’t need to reproduce it. I was just doing some research on the history of the building—some of the descriptions of early picture shows there are quite amusing.\n\n"
    },
    {
      "time": "10 Mar 2015 — 1:21am",
      "content": "I agree that the letters say Victorian neo-gothic whimsy more than appalling.  \nIn my opinion, there is nothing wrong with a Frankenfont if the mash-up creates a coherent mood.  \nThey would work quite well for a dragons/steampunk/Harry Potter milieu.  \nPerhaps the letters will inspire a lettering artist or fontmaker to venture a full alphabet.  \nDon\n\n"
    }
  ]
}
