{
  "id": "123507",
  "title": "The First Integral",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Some time ago, on Google Books, I happened to run across this volume of a journal,\n\n[https://books.google.ca/books?id=FvU7AQAAMAAJ](http://web.archive.org/web/20150317100157/http:/typophile.com/wiki/https%3A/%252Fbooks.google.ca/books%3Fid%3DFvU7AQAAMAAJ)\n\nand noticed, in a paper in the second of two volumes bound in the tome (volume 8), equations like this:\n\n ![](http://web.archive.org/web/20150317100157im_/http:/typophile.com/files/limit_pound_5059.jpg)\n\nIt turns out that the British pound sign, being a stylized L for \"librum\", was here used instead of the usual abbreviation \"lim\" for limit.\n\nSomewhat later, out of curiousity, I looked for examples of the early development of the integral sign, and I found out that its very first use was in the paper in which Leibnitz explained this newfangled thing called calculus. It was signed \"G. G. L.\" - Wilhelm was Latinized to Giugielmo, as in Marconi, and it was signed by his initials since he was one of the founders of the journal, Acta Eruditorum, in which it was published.\n\n ![](http://web.archive.org/web/20150317100157im_/http:/typophile.com/files/first_integral_4883.jpg)\n\nThis was from July, 1686. Note that while the long s was indeed used as a symbol with the meaning 'summation', it was a normal Roman long s rather than an italic long s in its first appearance.\n\n",
  "author": "quadibloc",
  "time": "26 Feb 2015 — 6:50am",
  "uid": "50554",
  "comments": [
    {
      "time": "26 Feb 2015 — 7:37am",
      "content": "And here's a very early example of the modern notation for the definite integral,\n\n ![](http://web.archive.org/web/20150317100157im_/http:/typophile.com/files/definite_4831.jpg)\n\nfrom Fourier's Théorie Analytique de Chaleur.\n\nExcept for putting the du first instead of last, and putting a period after the abbreviation for the sine function, this differs little from modern notation. However, in other places, there are bigger differences; an integral from 0 to X of an integral in dx appears in one spot - today, the use of the upper and lower case of the same letter would be considered confusing, and avoided sedulously - and while some integrals are shown as going from -∞ to +∞, at other points in the book 1/0 is used instead of the infinity symbol.\n\n"
    },
    {
      "time": "27 Feb 2015 — 12:41am",
      "content": "{.}\n\n"
    }
  ]
}
