{
  "id": "12360",
  "title": "Who is going to TYPO Berlin?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I will be at TYPO Berlin again this year. I know that several students from Offenbach will be there as well. And Adam Twardoch will be there. That leaves about 990 or so other registrants…\n\nroll-call?\n\n",
  "author": "dan_reynolds",
  "time": "11 May, 2005 - 8:13am",
  "uid": "1085",
  "comments": [
    {
      "time": " 11 May, 2005 - 8:15am",
      "content": "Also, being the king-dork that I am, I will be seeing _Star Wars_ at least once during the week (or half-week, or however long it is…) that I’ll be in Berlin, since it premieres while I’m there…\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20051110154401/http:/www.typeoff.de/)\n\n"
    },
    {
      "time": " 11 May, 2005 - 8:25am",
      "content": "[Typo Magazine](http://web.archive.org/wiki/Typo%20Magazine) crew will be there too!\n\n"
    },
    {
      "time": " 11 May, 2005 - 8:32am",
      "content": "I don’t know if my schedule will actually allow attendance, but I will be in Berlin May 20-24 and I was told that I’d have a pass for entry. Will Star Wars debut in Berlin at the same time as the US? When I was there last year, it appears that they were slightly behind on the films. If they debut it, I’d love to go see it.\n\nAnyways I’d be happy to meet up in the evening with anyone who’d care to get together.\n\njared\n\n"
    },
    {
      "time": " 11 May, 2005 - 9:57am",
      "content": "The big films are timed to coincide with US releases. The German Star Wars premiere will be on May 17th (that’s right, the 17th) in Berlin. On the 18th (when I arrive), it would be showing on limited screens. On the 19th, I suspect that there won’t be a movie theater that is not showing it. The “official” German release date is on May 19th, just like the “official” US release date.\n\nSo you will be in Berlin from the 20th? During the conference, I’ll be in the Linotype stand for the duration (stop by and pick up our new brochures!). On the evening of the 21st, I’ll probably attend FontShop’s closing party. But I’m game for anything on the 20th. I could see Star Wars then for (perhaps) the third time!  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20051110154401/http:/www.typeoff.de/)\n\n"
    },
    {
      "time": " 12 May, 2005 - 2:10am",
      "content": "Most of the time, american films (and with “american” I mean ALL America, not only the US) are shown a slight delay in Germany.\n\nDan, I would love to but haven’t got the money. Maybe you could later on share your impressions with us.\n\n"
    },
    {
      "time": " 12 May, 2005 - 3:19am",
      "content": "Don’t worry mosh, I write and talk too much, so I’m sure that I’ll end up putting something about TYPO Berlin together.\n\nLike last year, several other students from my school will be at the conference. Unlike last year, I’ll be working in the Linotype stand instead of attending the lectures, so I won’t be in the best position to write a good summary of the conference myself. But TypeOff is rebuilding its website, and we’ll get an article up about the conference on it somehow.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20051110154401/http:/www.typeoff.de/)\n\n"
    },
    {
      "time": " 12 May, 2005 - 6:29am",
      "content": "In case this is exciting for anyone… I’ll be there. And I’ll be pontificating about something or other in regards to this and that. Dinner or drinks with busy Jared sounds fun.\n\n"
    }
  ]
}
