{
  "id": "12374",
  "title": "Design Logo Fraktal",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi, I'm just trying to make a decent logo for our new \"design agency\". Just wanted to know what do you think, what's wrong and what can make it better. Sorry gifs, aint very good quality.\n\nThanx. Saludos!\n\n| Attachment | Size |\n| --- | --- |\n| [1.gif](http://web.archive.org/web/20131019042509/http:/typophile.com/files/1.gif) | 3.64 KB |\n| [2.gif](http://web.archive.org/web/20131019042509/http:/typophile.com/files/2.gif) | 4.61 KB |\n| [4.gif](http://web.archive.org/web/20131019042509/http:/typophile.com/files/4.gif) | 5.36 KB |\n| [5.gif](http://web.archive.org/web/20131019042509/http:/typophile.com/files/5.gif) | 4.06 KB |\n| [3.gif](http://web.archive.org/web/20131019042509/http:/typophile.com/files/3.gif) | 4.36 KB |\n| [6.gif](http://web.archive.org/web/20131019042509/http:/typophile.com/files/6.gif) | 5.12 KB |\n\n",
  "author": "ganza",
  "time": "12 May 2005 — 4:28am",
  "uid": "4810",
  "comments": [
    {
      "time": "12 May 2005 — 5:42am",
      "content": "Some thoughts: The spacing in Fraktal is bad in all versions. The biggest crime is the KTA, you could drive a truck through those spaces. In #2 I don't like the forced justification of the word design, its just not balanced. In #3 why not bleed the F from the left hand side of the box and the L from the righthand side of the box. Also try loosing the word design all together and make it part of a tagline that describes the kind of design business you are creating. In #4 The mark almost becomes an S. Number 6 is just a forced design. I think you have a good start keep going!\n\n"
    },
    {
      "time": "12 May 2005 — 6:07am",
      "content": "I second the observations on the kerning problems.\n\nThe fractal mark (the S shape) is interesting, but visually weak. I'd recommend making it stronger/larger/bolder/more striking, something. It's meant to be a focus and a unique feature, but many of your designs come off as ways to make up for the wiry quality of the mark. However, all of those framing elements around it tend to detract or distract from the primary focus of the mark. Plus, the internal spirals clot up as they converge, which will be a problem in both print and screen media. Perhaps a [GIS for 'op art' will help inspire some stronger fractal-esque images](http://web.archive.org/web/20131019042509/http:/images.google.com/images?q=op%20art&hl=en&lr=&c2coff=1&safe=off&client=safari&rls=en&sa=N&tab=wi).\n\nI prefer 1 and 6. 6 for the strength of the box (but not of the fractal), and the balance of the type. 1 for the simplicity of the overal logo and the contrast between the typefaces. However, both need work and refinement (as mentioned above).\n\n"
    },
    {
      "time": "16 May 2005 — 5:59am",
      "content": "The image reminds me of a mutated ammonite rather than the recurring shapes of a fractal (which as Chris mentioned will always be a compromise in print) while you could make an animated logo for screen use (although quite distracting), for print you will have to make a cutoff point which allows you to show a fractal's nature and allows you to print without creating a mark that contains too many, too close repeats. As a starting point to consider [http://mumble.net/~jar/visuals/fractal.html](http://web.archive.org/web/20131019042509/http:/mumble.net/~jar/visuals/fractal.html \"http://mumble.net/~jar/visuals/fractal.html\"). The problem you set yourself is that many will have some basic knowledge of a fractal's properties, I wonder if it is possible to create this feel with type alone?  \nTim\n\n"
    },
    {
      "time": "16 May 2005 — 9:02am",
      "content": "it's not a fractal, but a cloned, fusioned ammonite. yes you are right :P . I didnt thought of those obvious printing problems. Will try to make it simple and give it a more fractal form, even i would like to be not very obvious, and i was looking to search those forms in nature, as to put together maths complexity reasoning organizing with beauty, sensibility we are able to found in nature for example\n\n"
    },
    {
      "time": "16 May 2005 — 9:31am",
      "content": "I based my comments too literally on the name rather than appreciation of your image, however I think the name will provoke a similar reaction to many. Ammonites and Nautilii, which I too find most intriguing and beautiful shapes, put me more in mind of Fibonacci.  \nTim\n\n"
    },
    {
      "time": "20 May 2005 — 3:32pm",
      "content": "no.5..I like the colour choice of blue..I would justify the two names. The \"A\" is a great font choice..don't lose that but I would work on the proportions of the icon in the middle of the 6/7/(can't remember the sides..but the unique black uneven side shape and make the icon in the middle lager to fill more black space. I think you have all the elements..just need to experiment with more combos..post the updates..would like to see...good luck!\n\n"
    }
  ]
}
