{
  "id": "12380",
  "title": "typeface design book suggestions?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Could anyone suggest any titles of books that deal with typeface design, particularly the basics of letterform construction - ie with pen, ruler & compass? Ideally with visual examples of how the different forms are constructed…  \nI’ve been trying to construct some ‘traditional’ faces for a poster, but am struggling with some of the letterforms (particularly s, g and e…) I had a look through my college library and considering the size and reputation of it it doesn’t seem to have any such books!  \nMany thanks.\n\n",
  "author": "mbusher",
  "time": "12 May, 2005 - 8:23am",
  "uid": "7180",
  "comments": [
    {
      "time": " 12 May, 2005 - 11:39am",
      "content": "mbusher … look under the subject of ‘lettering’ and you might have better luck.\n\n[HERE IS A SCAN](http://web.archive.org/web/20051111100839/http:/www.agency26.com/letters1.jpg) from _Lettering Art in Modern Use_ by Raymond A. Ballinger. (1952)\n\nYou can see the mechanical pencil outlines on the tissue paper. Underneath, is  \nthe revision with optical corrections.\n\n"
    },
    {
      "time": " 12 May, 2005 - 12:20pm",
      "content": "Doyald Young’s [two books](http://web.archive.org/web/20051111100839/http:/www.delphipress.com/) (Logotypes & Letterforms, Fonts & Logos) are pretty strongly oriented towards lettering-based font construction, and Leslie Cabarga’s Logo, Font & Lettering Bible has a lot of good stuff. As for the rest, yeah, use Google to search Typophile and look for threads on [lettering](http://web.archive.org/wiki/lettering). The Cabarga and Young books have the advantage of being in print, but when it comes to lettering, they only touch the top of the iceberg.\n\n"
    },
    {
      "time": " 13 May, 2005 - 4:29am",
      "content": "i’ll try that monday when i’m back at college. i was looking in the typography / type design section, which is probably why i couldn’t find anything. according to the catalogue they have a copy of the book you suggested so i’ll pick it up.  \nThanks for the suggestions.\n\n"
    },
    {
      "time": " 26 May, 2005 - 4:00pm",
      "content": "I’ll just add that there is little in type design that \\*actually\\* uses a compass. Even stuff that looks geometric usually isn’t, and normal lettering is much more organic than constructed.\n\nThat isn’t to say that there isn’t consistency - but it’s of a different sort.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 29 May, 2005 - 12:39am",
      "content": "_I’ll just add that there is little in type design that \\*actually\\* uses a compass. Even stuff that looks geometric usually isn’t, and normal lettering is much more organic than constructed._\n\nNot to mention that no existing font format (that I’m aware of, at least) supports rational curves, so even if the type was designed with a compass, it won’t be perfectly circular.\n\n"
    }
  ]
}
