{
  "id": "123820",
  "title": "Right Type and Kerning for this Headline Poster",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi guys,  \nI am designing a poster. Here is the link\n\n[http://issuu.com/uzapuca/docs/\\_\\_cartel\\_iom\\_-\\_mar\\_2015\\_-\\_imprenta\\_](http://web.archive.org/web/20150326043210/http:/issuu.com/uzapuca/docs/__cartel_iom_-_mar_2015_-_imprenta_ \"http://issuu.com/uzapuca/docs/\\_\\_cartel\\_iom\\_-\\_mar\\_2015\\_-\\_imprenta\\_\")\n\n1) I am undecided about which of the two fonts will work better in this project. What do you think?\n\n2) Could you help me out with the kerning? Specially in the very condensed version. The poster is A3 size and the current kerning 60 pt.\n\n3) On the other hand, i don't know if it is better to open the space between words (in the condesed font) a bit more or not.\n\nThanks for all your help and best,  \nS\n\n",
  "author": "uzapucax",
  "time": "14 Mar 2015 — 9:59pm",
  "uid": "9533",
  "comments": [
    {
      "time": "15 Mar 2015 — 2:01am",
      "content": "1. I think the condensed one works better in this instance, mainly because of the gained white space (yellow space?) between text and figure.\n2. I think _tracking_ could be reduced (which also would allow to increase point size a bit).\n3. You should either reduce the tracking or increase the word spacing.\n\n"
    },
    {
      "time": "15 Mar 2015 — 6:53am",
      "content": "Thanks for the good tips Riccard ;-)\n\nI will reduce tracking then. I was kind of worry to reduce it since very condensed font tend not to read very well with tight tracking i think.\n\nThe condensed font is Knockout. The good thing it has many weights. Do you think of any alternative to Knockout type?\n\nThanks!  \nS\n\n"
    },
    {
      "time": "15 Mar 2015 — 2:13pm",
      "content": "As an aside (if this were me) I would take the time to separate the shadow from the skull in photoshop and then set the shadow portion to 'multiply'\n\n"
    },
    {
      "time": "15 Mar 2015 — 9:04pm",
      "content": "Good tip Les ;-)\n\nYou are right, there was something in the shadows that was bothering me in the general design. I think if i set it to multiply it will change a lot.\n\nWhat do you think about the fonts? I am not sure about the condesed version now...\n\nCheers,\n\n"
    },
    {
      "time": "16 Mar 2015 — 12:30am",
      "content": "Well I definitely prefer the condensed titling face. Maybe close up the ES, NT & ET slightly? Regarding some other typographic observations (and please take these with a grain of salt as I'm not familiar with Spanish typographic rules).\n\nI would raise the En dashes so the're closer to the midline of capitals.\n\nI would personally replace full spaces with thin spaces in Tel. No's.\n\nNot sure about the period after E-Mail ? (I understand it's a contraction but it's so endemic as too almost be a new & complete word in it's own right).\n\nMy 2 cents :)\n\n"
    },
    {
      "time": "16 Mar 2015 — 7:12am",
      "content": "Hi Les,\n\nThanks for the very very useful tips! the poster look much better now.\n\nI have to learn more about the fine tuning art of kerning. It really does makes a difference. I have also reduced the space between words too. Do you know of a good book on kerning?\n\nHere is the final versions. I also tried one model without all caps. As Erick Spiekermann once said \"Don't Use All Caps\" hehe. The second one has a texture background too. What do you think?\n\n[http://issuu.com/uzapuca/docs/\\_\\_cartel\\_iom\\_-\\_mar\\_2015\\_-\\_imprenta\\_\\_5af31c...](http://web.archive.org/web/20150326043210/http:/issuu.com/uzapuca/docs/ __cartel_iom_-_mar_2015_-_imprenta__ 5af31c4cc1f07e \"http://issuu.com/uzapuca/docs/\\_\\_cartel\\_iom\\_-\\_mar\\_2015\\_-\\_imprenta\\_\\_5af31c4cc1f07e\")\n\nThanks again for your kind help :)\n\n"
    },
    {
      "time": "16 Mar 2015 — 7:25am",
      "content": "By the way, I don't know why the shadow as multiply is not showing in the PDF now. I did that trick and it looks much better. Here is the right link\n\n[http://issuu.com/uzapuca/docs/\\_\\_cartel\\_iom\\_-\\_mar\\_2015\\_-\\_imprenta\\_](http://web.archive.org/web/20150326043210/http:/issuu.com/uzapuca/docs/__cartel_iom_-_mar_2015_-_imprenta_ \"http://issuu.com/uzapuca/docs/\\_\\_cartel\\_iom\\_-\\_mar\\_2015\\_-\\_imprenta\\_\")\n\nUPDATE: for some unknown reason, ISSUU is not showing the mask with the multiply effect. Don't know why.\n\nBest ;)\n\n"
    },
    {
      "time": "16 Mar 2015 — 9:34am",
      "content": "Just regarding the kerning, it's a bit uneven. For example, look at the tightness of ESE in the first line, as opposed to the looseness of PRET in the second line.\n\nAs for a book on kerning, I'm not so sure a book would help. Good kerning is mostly a matter of seeing, then making those adjustments and compromises necessary to achieve the best possible distribution and balance of positive and negative spaces.\n\nHave you seen the following online kerning game: [http://type.method.ac](http://web.archive.org/web/20150326043210/http:/type.method.ac/ \"http://type.method.ac\"). I don't always agree with some of the designer's solutions, but it's good practice.\n\nFor what it's worth, I like the poster.\n\n"
    },
    {
      "time": "16 Mar 2015 — 12:33pm",
      "content": "I have to agree with Thylacine here, the kerning is still uneven. It's a difficult thing to advise on because doing one thing has a flow on affect for the rest of the 'word picture'. What you're trying to achieve is optically balanced white space around each letter whilst maintaining whole word cohesion (if that makes sense! I think it's more difficult to describe. than do) :)\n\nTake D E S E O, I see it more as D ESE O. Kerning is not a science but IS all about the EYE (of which you appear to have a very good one, as this design as a whole attests)\n\nRegarding the skull's shadow, I'm not sure what program you're using so again it's difficult to advise, but I'm pretty sure you need to split the skull from it's shadow somehow, so you have 2 separate objects.\n\nHope this helps\n\n"
    },
    {
      "time": "16 Mar 2015 — 1:41pm",
      "content": "Thanks guys, both gave me very good tips indeed ;-)\n\nI will work the kerning again...it happens somethings when you are so fix in one work that you \"don't see anymore\".\n\nThe shadows is working right in the original PDF but ISSUU does make it flatten when it upload the file to its website.\n\nBest,\n\n"
    }
  ]
}
