{
  "id": "12391",
  "title": "RSS",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "well now that everything’s been switched to RSS, can anyone recommend a good RSS reader for Windows?\n\n [‹ Time to Spank the Stewf](http://web.archive.org/web/20080829190526/http:/typophile.com/node/13935 \"Go to previous forum topic\") [G4 Mac Power Book battery ›](http://web.archive.org/web/20080829190526/http:/typophile.com/node/34201 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080829190526/http://typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": "<br>",
  "uid": "7006",
  "comments": [
    {
      "time": " 12.May.2005 7.15pm",
      "content": "If you are not particularly attached to your current browser, you might consider switching to Opera 8.0, which has a pretty good built-in RSS reader.\n\n"
    },
    {
      "time": " 12.May.2005 10.01pm",
      "content": "i think i have opera on here somewhere...\n\n"
    },
    {
      "time": " 12.May.2005 11.29pm",
      "content": "a follow-up question... are the RSS feeds working for anyone else?\n\n"
    },
    {
      "time": " 13.May.2005 12.16am",
      "content": "The RSS feeds do indeed work, but only the initial post in any thread is included. Until “comments” (posts after the first) are included in the RSS they aren’t a substitute for the email notification of the old Typophile. But I’m confident they will be included.\n\n"
    },
    {
      "time": " 13.May.2005 12.17am",
      "content": "included included included\n\n(it’s late)\n\n"
    },
    {
      "time": " 13.May.2005 2.07am",
      "content": "The [SAGE](http://web.archive.org/web/20080829190526/http:/sage.mozdev.org/) extension for Firefox works fine for me. Have a look.\n\n— [astype.de](http://web.archive.org/web/20080829190526/http:/www.astype.de/)—\n\n"
    },
    {
      "time": " 14.May.2005 9.37am",
      "content": "I am using a Mac with OS 9.2, and apparently RSS readers for that configuration are poor if they exist. I found that there are online RSS readers that let you be independent of your platform. I just started using [Bloglines](http://web.archive.org/web/20080829190526/http:/www.bloglines.com/) and it seems to work fine.\n\nI have to say I also miss having the notifications when something new happens at the Type ID Board. :(\n\nAlthough Stephen’s comment gives me hope.\n\n"
    },
    {
      "time": " 16.May.2005 6.25am",
      "content": "I have ’Pluck’\n\n"
    },
    {
      "time": " 18.May.2005 10.17am",
      "content": "What’s RSS?\n\n"
    },
    {
      "time": " 18.May.2005 10.52am",
      "content": "yes, jared, can we get a small tutorial like the one you gave on [wiki authoring](http://web.archive.org/web/20080829190526/http:/typophile.com/node/12418)?\n\n"
    },
    {
      "time": " 18.May.2005 10.58am",
      "content": "RSS ain’t workin’, and not just because only getting the initial post in a thread is hopelessly inadequate. I configured RSS in my Thunderbird (on WinXP-Home) but when I first fired it up I got 15 entries (no idea how/why/which), and since then... nothing.\n\nUnless email is brought back, or RSS works for real, yours truly for one will remain pretty much a headless chicken here, because the overhead in scanning the “tracker” takes too much time/energy.\n\nhhp\n\n"
    },
    {
      "time": " 18.May.2005 11.53am",
      "content": "I might have missed something already discussed in another thread since I have been on vacation, but I got the feeling that I only get 5% of the discussions when I use an RSS reader (no matter if it is Thunderbird or RSSOwl, both recommended RSS readers). I haven’t found a descent way to read the discussions on the web, to check the end of each thread each day and try to remember what one have read and not read is not very convenient.\n\nAny recommendations on how to read the forums?\n\n/mårten\n\n"
    },
    {
      "time": " 18.May.2005 1.26pm",
      "content": "Well, my comment went all ascii on me. Basically the best thing to do is use the tracker, specifically to track your threads. Very convenient actually. Now I don’t have to have my e-mail set to check every 5 minutes! :^P\n\n"
    },
    {
      "time": " 18.May.2005 2.32pm",
      "content": "The problem is that the “main” feed ( [http://www.typophile.com/rss](http://web.archive.org/web/20080829190526/http:/www.typophile.com/rss \"http://www.typophile.com/rss\")) is not working properly. I have subscribed to the specific feeds (links [here](http://web.archive.org/web/20080829190526/http:/typophile.com/feeds)) and these are working fine (except for the Critique: Blackletter feed).\n\n\\* \\* \\*\n\nThis is what I’ve been doing to read the forums:  \nFirst thing: log in to Typophile. Then, on [FeedReader](http://web.archive.org/web/20080829190526/http:/www.feedreader.com/), I read the new threads from the forums I’ve subscribed to; and also the replies to them (by clicking on the permalinks at the bottom of the message).\n\nAfter checking out the new threads with the RSS reader, I use the tracker to look for new posts to old threads. The tracker shows me which threads have new posts (must be logged in to work).\n\n"
    },
    {
      "time": " 19.May.2005 11.07am",
      "content": "Here’s an efficient way to catch up for people in Headless Chicken Mode like me:  \n1) Write down the day/time.  \n2) Starting with the Forum/General-Discussions section:  \n2a) sort by Last Reply (reverse chronologically);  \n2b) find the break at the beginning of May (right now on page 3 for G-D);  \n2c) open each thread in a new window, skim or peruse, reply as needed;  \n2d) when you get to the day/time you started, stop.  \n3) Repeat step 2, skipping sections you don’t want.  \n4) Go to the Tracker, and check out the new threads since you started.\n\nI caught up with the whole of the General-Discussions section in under an hour (including making 6 posts). The only problem is that the Tracker doesn’t show which section a post is in (in case you want to skip any).\n\nThis is better than using only the Tracker for the whole catch-up process, because that requires going through 23 pages, and remembering what threads you’ve already looked at throughout the process.\n\n—\n\nBut still, guys:  \nRelying on the Tracker for “real-time” catch-ups is so... 2004.\n\nhhp\n\n"
    },
    {
      "time": " 21.May.2005 6.55pm",
      "content": "Pluck is EXCELLENT... Best out there in my opinion...\n\n"
    }
  ]
}
