{
  "id": "1239",
  "title": "Further Studios Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey, this is my first time posting here, but I've read your critiques for a long time and have always valued them. I was just playing around with the idea of a new logo for my firm, and came up with this - and want to know what you all think. Thanks!   \n ![Possible Further Studios Logo](http://web.archive.org/web/20150417154514im_/http:/www.typophile.com/forums/messages/29/15936.gif)\n\n",
  "author": "furtherstudios",
  "time": "10 Sep 2003 — 7:05pm",
  "uid": "2286",
  "comments": [
    {
      "time": "10 Sep 2003 — 8:05pm",
      "content": "It looks very seventies.   \n   \n   \nNeat forms though, if not every legible.\n\n"
    },
    {
      "time": "10 Sep 2003 — 8:55pm",
      "content": "Thanks, Chris. Do you think the design \"works\"? Or does the legibility work against it too much?   \n   \nI was trying to go for something abstracted far enough that it's more of a _design_ than just _initials_, but I know that a logo also shouldn't need an explanation for it to work.   \n   \nThanks for the comment, and I'd love to hear more crits!\n\n"
    },
    {
      "time": "10 Sep 2003 — 10:20pm",
      "content": "The only thing I'd point out is that those narrow slits have to size-sensitive (wider for smaller sizes) to avoid closing up.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Sep 2003 — 10:40pm",
      "content": "Thanks HHP. I've got a slightly altered version for when it gets down to really small sizes.   \n ![small](http://web.archive.org/web/20150417154514im_/http:/www.typophile.com/forums/messages/29/15948.gif)\n\n"
    },
    {
      "time": "10 Sep 2003 — 11:17pm",
      "content": "It is an interesting form. There are two things about the form that are unsettling to me, but only on a personal level: (1) the form looks like it's going to roll/tip over to the right, and (2) for some reason the curve at the bottom of the \"f\" isn't working for me (unfortunately, I am not offering any suggested resolutions tonight).   \n   \nGood luck!   \nScott\n\n"
    },
    {
      "time": "11 Sep 2003 — 12:12am",
      "content": "I'll work on a version of the logo without the curve (on the 'f'), but it'll still look like it's going to tip over. I don't know if that'll bother other people or not - I didn't even really think about it.   \n   \nI'm sort of wondering if I should just stick with the logotype on the temporary page 2 of our site:   \n [http://www.furtherstudios.com/](http://web.archive.org/web/20150417154514/http:/www.furtherstudios.com/) (just click the splash, no need to read the outlandish manifesto-esque text unless you really want to)   \n   \nThanks again.\n\n"
    },
    {
      "time": "11 Sep 2003 — 12:35am",
      "content": "Okay, here's version 2. One question - you don't think it looks too phallic, do you? A better question is, you wouldn't have thought it looked phallic if I hadn't mentioned it, would you?   \n ![v.2](http://web.archive.org/web/20150417154514im_/http:/www.typophile.com/forums/messages/29/15957.gif)\n\n"
    },
    {
      "time": "11 Sep 2003 — 6:53am",
      "content": "i like the old logo, with the tops of the letters shifted to the right. it looks hot.   \n   \nthis new one is not memorable enough. and something about those straight white lines going thru it makes it look just... weird. it''s not helping it form space and dimension, it's just breaking it up in weird places. an FS monogram may be cool, but i dont think this should be it...\n\n"
    },
    {
      "time": "11 Sep 2003 — 7:06am",
      "content": "I agree with Loren. I like the old one better too\n\n"
    },
    {
      "time": "11 Sep 2003 — 11:57am",
      "content": "Your old/current logo is much stonger. The f/s mark is now saying \"Korean paperclip manufacturer\" to me. Your current logo is \"hot\", as Loren put it, but could probably still use a little attention (i.e. font selection and vertical spacing of \"studios\"). I'm anxious to see your site when it is finished.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "11 Sep 2003 — 1:51pm",
      "content": "there's a great logo - in my opinion, of course - Suomi-Yhito - a Finnish insurance provider. i'll try to post it later. this logo can give an idea about stylized letters.   \n   \n   \n   \nDavid Hamuel\n\n"
    },
    {
      "time": "11 Sep 2003 — 2:17pm",
      "content": "\"Thanks, Chris. Do you think the design \"works\"? Or does the legibility work against it too much?   \n   \nI was trying to go for something abstracted far enough that it's more of a design than just initials, but I know that a logo also shouldn't need an explanation for it to work.   \n   \nThanks for the comment, and I'd love to hear more crits!\"   \n   \nFor normal usage you could put the symbol and then right next to it \"further studios\", then for places where it wouldn't be appropriate to have the text you could just use the logo. It is definitely unique and memorable, so I think it would work fine on it's own.   \n   \nI like how the S cuts into the F on the new logo, however I think I like how the F and the S meet at the bottom on the old version.\n\n"
    }
  ]
}
