{
  "id": "12392",
  "title": "Visible from space?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Today’s <cite>National Post</cite> featured this image of Jebel Ali ‘Palm Island’ being built on the coast of Dubai. As you can see, some of the floating islands are in the shape of Arabic text, making up what must surely be the largest piece of lettering in the world.\n\n| Attachment | Size |\n| --- | --- |\n| [JebelAli.jpg](http://web.archive.org/system/files?file=JebelAli.jpg) | 190.37 KB |\n\n",
  "author": "John Hudson",
  "time": "Thu, 2005-05-12 18:53",
  "uid": "1262",
  "comments": [
    {
      "time": " Thu, 2005-05-12 19:03",
      "content": "I’ve heard it said that size doesn’t matter (but I haven’t heard that from a typophile).\n\nAccording to [the palm’s website](http://web.archive.org/web/20050526123513/http:/www.thepalm.co.ae/) the “elevated retreat homes linked by boardwalks” spell out a passage from a verse by H.H. Sheikh Mohammed bin Rachid Al Maktoum, “Take wisdom from the wise — not everyone who rides a horse is a jockey.”\n\nHelpful, if you thought all horse riders were jockies.\n\n"
    },
    {
      "time": " Thu, 2005-05-12 22:08",
      "content": "I wonder what size that is in points?\n\n"
    },
    {
      "time": " Thu, 2005-05-12 22:08",
      "content": "Actually, wait, I think you measure type that big in lines, yeah?\n\n"
    },
    {
      "time": " Thu, 2005-05-12 22:37",
      "content": "I wondered if maybe the text was a message to commuting aliens: ‘If you lived here, you would be home now’.\n\n"
    },
    {
      "time": " Fri, 2005-05-13 01:49",
      "content": "“If you knew Arabic, you could read this from space.”\n\n(Which reminds me, I must get out my Pimsleur Arabic sometime.)\n\n"
    },
    {
      "time": " Mon, 2005-05-23 12:41",
      "content": "Holy Christ\n\n"
    },
    {
      "time": " Mon, 2005-05-23 12:42",
      "content": "Umm, I mean Ins’allah…\n\n"
    },
    {
      "time": " Wed, 2005-05-25 10:01",
      "content": "Here’s a collection of links to Google Maps satellite photography featuring [Large Type](http://web.archive.org/web/20050526123513/http:/www.googlesightseeing.com/category/post-cats/large-type/)\n\n"
    },
    {
      "time": " Wed, 2005-05-25 10:28",
      "content": "Oh, and it seems that London’s Millenium Dome is to be recast as the “0” in mobile phone company 02’s logo:\n\n[BBC news](http://web.archive.org/web/20050526123513/http:/news.bbc.co.uk/1/hi/in_pictures/4579529.stm)\n\nI think the dome is exactly 1 km in circumference making the 0 over 1 million points high (unless I’ve missed a decimal place somewhere)\n\n"
    },
    {
      "time": " Wed, 2005-05-25 14:40",
      "content": "Maybe I’m stretching a point here, but I tend to think that a “dome” should be self-supporting, a 360º arch perhaps.\n\nThe structure on what is now termed the Greenwich Peninsula (I’ll have to check this) is more of a tent in my opinion. Admittedly an impressive tent, but not a dome.\n\n"
    },
    {
      "time": " Wed, 2005-05-25 15:49",
      "content": "Indeed. It doesn’t have ears or a trunk either, but it’s still a white elephant.\n\n"
    }
  ]
}
