{
  "id": "123903",
  "title": "Logotype face/weight/spacing feedback",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm struggling with a typeface choice and weight/size/spacing issue. The logo below needs to function across a broad range of uses, from relatively small in a web site header all the way up to banner size. I initially used Helvetica Neue condensed black for its strength, compactness, and classic qualities, but am having doubts. The top line in the image is Helvetica, the bottom line Myriad, which is more \"modern\" or lack of a better adjective. However, Myriad is not as compact and I don't want to horizontally scale to made it more so.\n\nMy primary struggle is with the treatment for \"ocean race\". It's essentially a modifier and \"Annapolis Bermuda\" needs to be dominant, or at worst they need to be equal in prominence. The logo needs to be able to stand alone without the date year, and as a result I'm not comfortable with aligning \"ocean race\" left or right and reducing the spacing.\n\nAny and all feedback and suggestions on how to treat \"ocean race\" and 2016 are welcome, and feel free to suggest alternate faces for the the entire logotype.\n\n| Attachment | Size |\n| --- | --- |\n| [A2B\\_logos\\_types.png](http://web.archive.org/web/20150320223057/http:/typophile.com/files/A2B_logos_types.png) | 53.39 KB |\n\n",
  "author": "Suijin",
  "time": "18 Mar 2015 — 8:39am",
  "uid": "225801",
  "comments": [
    {
      "time": "18 Mar 2015 — 10:23am",
      "content": "\"Annapolis Bermuda needs to be dominant\"\n\nTo me the dominance is: 1. 2016; 2. Ocean Race; 3. Annapolis Bermuda\n\nHave you tried putting Annapolis and Bermuda on separate lines so you can make them bigger?\n\n"
    },
    {
      "time": "18 Mar 2015 — 12:08pm",
      "content": "Thanks James. I have not tried that because I don't want to make the type stack taller than it already is, although I will now go back and play with it. In addition, there is the potential for a named race sponsor being added, further expanding the length of the name to \" Annapolis Bermuda Ocean Race\".\n\nI'm fine with making the year light/thin, and was headed in that direction to make it less dominant. I guess what it comes down to is how to treat \"ocean race\" so it is of equal or less dominance than Annapolis Bermuda.\n\n"
    }
  ]
}
