{
  "id": "12408",
  "title": "Lovin'.. logo critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "hey guys, I'm new to the forums, been a fan of Typophile for a while.. I'm looking for constructive comments to this logo. The direction is final and I know it's a pretty obvious solution (the client jumped on one of the early directions. The logo is for a young, female independent caterer with a distinct style. She wanted something 'groovy' and something that would set her apart from the corporate-ish caterers in town. The main type is based from Bookman w/ swashes and the 'from the' is hand drawn. Any suggestions/crits are more than welcome. thanks!\n\n| Attachment | Size |\n| --- | --- |\n| [lovecomp.gif](http://web.archive.org/web/20131020071349/http:/typophile.com/files/lovecomp.gif) | 11.06 KB |\n\n",
  "author": "waves",
  "time": "13 May 2005 — 8:41pm",
  "uid": "7324",
  "comments": [
    {
      "time": "13 May 2005 — 11:08pm",
      "content": "I'm lovin' it™.. :) Cute one.. I really like the vintage, retro treatment..  \n_( The only thing that slightly bothers me is the kinda uneven swashy end of the 'n' in 'Oven'.. )_\n\n"
    },
    {
      "time": "14 May 2005 — 2:06pm",
      "content": "You've captured that early seventies look pretty well. I think it just need to be tightened up; smooth out the curves so everything flows nicely. There are some spots that need attention such as the upper right serif on the L. I would make the apostrophe longer; give it a more prominent tail. You might try to find some old photo headline type specimen catalogs for reference on how the swashes were done, particularly with Souvenir and Cooper Black.\n\n"
    },
    {
      "time": "20 May 2005 — 4:12pm",
      "content": "This would look great on a vintage t-shirt! New kind of uniform of a cater company\n\n"
    },
    {
      "time": "28 May 2005 — 11:54pm",
      "content": "The spacing seems _very_ tight; maybe loosen it up a bit?\n\n"
    },
    {
      "time": "7 Jun 2005 — 12:53am",
      "content": "I think \"from the\" gets lost between the massive main words. What do you think about pulling the small text out to the left so that it leads into \"Oven?\" It makes the logo a little less compact, but I think it gains a bit more readability and flow.\n\n(I'd post an example, but I can't see that attachments are allowed in comments. Let me know if you'd like me to email an example gif to illustrate what I'm saying.)\n\nMike\n\n"
    },
    {
      "time": "17 Jun 2005 — 2:03am",
      "content": "\"from the\" doesn't seem to match the rest of the type and the heart shape is a little indistinct.\n\n"
    },
    {
      "time": "21 Jun 2005 — 2:25am",
      "content": "Nice work, the feel is spot on. To my eyes the heart sits a bit too tight between the L and the v. Might be problematic in low quality or small size situations. The position of 'from the' can be improved as well, I think.\n\n----------------------------------------------------  \nMy work is a game. A very serious game [M.C. Escher]\n\n"
    }
  ]
}
