{
  "id": "12415",
  "title": "Did Rudy Dis Typophile?!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was blowing though this month’s Print magazine and read an interview with rudy Van der Lans of Emigre. In it he referred to Typophile as an example of an online blog that did not offer anything of real value.\n\nDid anyone see that? I was surprised and thought it sounded small.\n\nMike\n\n [‹ Clean Modern font for Medical website](http://web.archive.org/web/20080906160527/http:/typophile.com/node/12491 \"Go to previous forum topic\") [Talking Fonts ›](http://web.archive.org/web/20080906160527/http:/typophile.com/node/12473 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906160527/http://typophile.com/user/1689\" title=\"View user profile.\">mike gastin</a>",
  "time": "<br>",
  "uid": "1689",
  "comments": [
    {
      "time": " 14.May.2005 7.23am",
      "content": "I just wish their fonts worked small.\n\nValue: I could write a short book  \nof how much Typophile has helped me.\n\nhhp\n\n"
    },
    {
      "time": " 14.May.2005 7.39am",
      "content": "I haven’t seen the context of the remark, but it sounds like a rather self-centered perspective. Typophile may not offer much of value to Rudy Van der Lans, but it does offer tremendous value to me as a comparative novice. You have roughly half the board of ATypI who post on Typophile, some quite regularly, and others of comparable experience and accomplishment. They obviously enjoy talking type both to each other and to help mentor those of us of lesser experience - from whom they might even learn a thing or two now and then.\n\nSo I say Hooray Typophile!\n\nNow if they would just fix the damn measure and type size on the new site design...\n\n"
    },
    {
      "time": " 14.May.2005 8.04am",
      "content": "Well, have a look at it. Maybe I am not reading it right, or am reading too much into his comment. Would like to know what others think.\n\nI do agree with Hrant and William that there is deep value here. It would not be so successful and well used if there was no real value to the participants.\n\n—  \nMike\n\n"
    },
    {
      "time": " 14.May.2005 9.18am",
      "content": "I’ve not seen the issue yet, and this is the first I’ve heard of it. Maybe he’s just sour grapes because I’ve let my subscription lapse :)\n\nDo they still run letters to the editor?\n\n(Mike, can you post the text here?)\n\n"
    },
    {
      "time": " 14.May.2005 9.50am",
      "content": "Who the hell is Rudy, and why should I care?\n\n"
    },
    {
      "time": " 14.May.2005 9.53am",
      "content": "Let’s be honest. Some people on this board have written some very presumptuous, uninformed disparaging things about Emigre. And moderators let it stand in some spirit of “openness” or what have you. If I were in Emigre’s position, I’d want to go elsewhere for discussions or answers. It’s not enough for Emigre’s detractors to simply not buy and use Emigre fonts. They simply cannot accept Emigre’s profound success and influence.\n\nAnd people either need online forums or they don’t. I happen to need them. I work on type alone, so online interaction is my only interaction. And I will say now it is the WORST kind. Face-to-face or even the telephone is better. Once I write something online, some yapping Pomeranian can always waltz in, scrutinize the tiniest discrepancy and derail the whole thread from ever arriving at a satisfactory answer. And online arguments wear me out. Online a cowering twit can talk and act like a hulking thug. It only takes two or three such people to drive away those who have the most to contribute to a forum.\n\nThat said, I would first point at the technical forums and the new editable wiki pages as examples of the most useful parts of typophile. And the Critique forums are a treasure chest full of young new designers looking for a good home at a foundry. And I have had rewarding first encounters here on typophile—Dan Reynolds, Tiffany Wardle and Andreas Seidel, for example. And Joe!\n\n"
    },
    {
      "time": " 14.May.2005 10.48am",
      "content": "Hey, people on this board have written some very presumptuous, uninformed disparaging things about me too, but I’m still here! Because I like the abuse? No, because I’m strong enough to prevent it from stopping me from benefiting from Typophile. Although it sort of helps that 99% of them have been anonyrats. Oh yeah, I’m sure it’s because if they’d used their real names I’d gun ’em down... Also, people have written crap about a bunch of other people and organizations too (like Linotype and Bitstream), but Dan (your buddy) for example is going strong.\n\nBTW, one thing you should know (and I think you do, it’s just more convenient for you to ignore it) is that Rudy and I have been on decent terms since 2002. That doesn’t mean we agree on everything (or even much), like what makes a Good Font, but it sort of throws a wrench in your polarization...\n\n\\> people either need online forums or they don’t.\n\nWell of course. As William said, the issue isn’t what’s useful to Rudy, but what’s useful to people as a whole. Some people are more fruitful communicators via ponderous, hierarchic magazine articles, others via a whirlwind of ASCII, others via lapdancing, others whatever. Don’t stick your nose up at an environment you can’t handle. And don’t show up exclusively to strike us down.\n\nTypophile members (like those who’ve had actual font releases after a long public gestation here) constantly express their appreciation. And what kind of organization manages to soft-sell people memberships in return for virtually nothing? Face it, it’s a good thing, overall. Don’t defend somebody who thinks otherwise simply because it’s an opportunity to attack certain people.\n\n\\> it is the WORST kind.\n\nYeah, it really sucks that it doesn’t cost anything, it overcomes geographic barriers, and everything is archived.\n\n\\> I have had rewarding first encounters here on typophile—Dan  \n\\> Reynolds, Tiffany Wardle and Andreas Seidel, for example.  \n\\> And Joe!\n\nHey, same here! Many people you like don’t like other people you like. What does that mean? As for me, the only people I tend to have trouble with is fundamentalists.\n\nhhp\n\n"
    },
    {
      "time": " 14.May.2005 11.46am",
      "content": "Whoah, mister, calm down. I totally understand what John Butler is saying: online interaction is the worst not because it’s bad in absolute terms, it’s the worst because it’s worse than other forms of interaction, like meeting someone face to face. I went to see you speak at CCSF not because I thought you were going to say anything different than what you’ve said online (and, indeed, I recognized an awful lot of your presentation materials), but just to see Hrant Papazian in action. The person I saw was modest, knowledgeable and charming. If I lived in LA, I’d totally sign up for your class. I think it’s going to be a lot of fun. Would I have wanted to before I saw you speak? Probably not, because the online Hrant is a pretty schizophrenic entity, frankly.\n\nBeing a type nerd can be a really alienating thing. I’m lucky, because San Francisco is a designer’s town, and it’s not hard for me to find people to talk to about my obsession with fonts and type design. Talking to friends about what I’m doing and showing them my feeble efforts at type design have done a lot to fuel the fires of my passion. I get a lot out of Typophile, but it’s sort of removed, at a distance.\n\nI can understand why [Emigre](http://web.archive.org/web/20080906160527/http:/typophile.com/wiki/Emigre) would be pissy towards Typophile, for exactly the reasons John outlines. I wrote the entry on [Zuzana Licko](http://web.archive.org/web/20080906160527/http:/typophile.com/wiki/Zuzana%252BLicko), who is probably one of my favorite type designers, and even that, though positive and short, is pretty far from hagiography. Lots of people here have bagged on their work numerous times. That said, it’s a little surprising they’d care enough about the smack that gets talked here to single Typophile out. I’ve always been pleased at how moderate and cordial Typophile is, but then again, I’ve been dealing with Internet culture for a long time. My expectations are pretty low.\n\n"
    },
    {
      "time": " 14.May.2005 11.59am",
      "content": "Jared,\n\nSorry, I can’t post the copy as the mag is at my studio and its the weekend. Maybe on Monday if someone else does not beat me to it.\n\n—  \nMike\n\n"
    },
    {
      "time": " 14.May.2005 12.09pm",
      "content": "\\>And I will say now [on line] is the WORST kind [of interaction].\n\nHmmm, this is getting interesting.\n\nJohn, it is the worst in the ways you mention - people tend to be much ruder than in person, and the garrolous and irrelevant talkers have much more power in an on-line conversation.\n\nBut it also has some unique benefits that face to face conversation does not. It enables communication at a time of your convenience - a fabulous thing about e-mail also. And it enables you to reach a wide group of people of like interests all across the world, and to learn from each other - and to form new friendships, as you mention.\n\nI find this instant, international reach of the internet dazzling and wonderful.\n\nI haven’t explored other on-line discussion venues much, but when I follow links to others, I haven’t seen anything that compares to Typophile. Maybe it is something about the size of the interest group (not too little or too big) or its common passion, but the sustained discussion over time on a pretty high level is quite impressive to me.\n\nAnd of course Jared and Joe deserve the hats off for creating and now recreating it.\n\n"
    },
    {
      "time": " 14.May.2005 12.24pm",
      "content": "\\> it’s worse than other forms of interaction\n\nI don’t agree. Clearly, each environment has its pros and cons. And yes, different people are more in tune with different environments. John likes telephone conversations better; to me the telephone is quite abhorrent. But I’d never claim it has no value. And you like Typophile yourself, and I bet not just because it’s moderate and cordial, not because you have an unfortunate addiction to it or something, but because it’s stimulating and educational - because it has value to you. You don’t show up just to throw a hissy-fit.\n\nYes, you attended my talk (thank you), but you nonetheless realize the geographic barriers at play in the fact that hundreds of other people didn’t attend. You are lucky that you live in the Bay Area. But maybe you’re unlucky that you don’t live close enough to Beirut. Maybe Rudy is lucky that he doesn’t need Typophile. But you and Rudy are just single individuals, not benchmarks against which my talk, Typophile, or anything else should be judged.\n\nYou think I’m a schizo online, but fine in person. Other people appreciate my online presence (I know because they email me out of the blue to tell me so), but are sometimes disappointed that I can seem downright boring in person. Everybody is different, and that’s exactly why saying Typophile has no value -and eagerly defending people who say that- is a bad reflection on such people.\n\nhhp\n\n"
    },
    {
      "time": " 14.May.2005 12.26pm",
      "content": "This is very interesting. It surprises me a bit because I’ve only ever encountered one RvdL statement about Typophile before. In fact, that one statement can be found on the bottom of page 6 of _Emigre No. 66: Nudging Graphic Design_ (Princeton Architectural Press, 2004). The article is the issue’s introduction, in which RdvL sings the praises of Armin Vit and SpeakUp.\n\nQuote: “There are other type-related blogs I visit. Typographi.ca and Typophile.com are musts if you’re interested in type design. If you think _Emigre_’s discussions on legibility in the early 90s were somewhat tedious, check out the depth and extent to which these bloggers discuss the topic.” (Author’s emphasis)\n\nSo, RdvL seems to have written that in 2004 that Typophile was very important to type designers, while subtly belittling its participants at the same time. I have not seen the above-mentioned issue of _Print_.\n\nIt is no secret that some key leaders of the type industry dislike Typophile. Incorrect rumors spread here that can hurt individuals or sales, and some (almost always anonymous) posters can just be plain rude. However, it has been my experience that these people are almost always shot down, or at least well rebuted, by regulars (who are not anonymous).\n\nAs an aside, I am grateful for Typophile, and have enjoyed every opportunity to meet fellow posters live at various conferences. If it hadn’t been for Typophile, I’m sure that I woun’t have met any of you yet. Every time I hear a disparaging mark about Typophile (in person, or on another forum) I get very sad.\n\nI could understand if RvdL had a grudge against this board’s discussions, though. The wiki listing for Mrs. Eaves is actually quite rude. And it has been a whipping boy in too many discussions. Do you think that makes RdvL and Zuzana Licko more likely, or less likely to want to chime in?  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080906160527/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 14.May.2005 12.30pm",
      "content": "Hrant, I’ll admit that I was a bit worried before I met you in person. I thought that I was going to get it for all the disagreement we’d had online, especially those that took place before and after the last US election. But it was a delight to meet you in Beirut. You certainly were not boring, a little “quieter” perhaps, but that is never boring (I think that the people who can’t stop talking are the most boring…).\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080906160527/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 14.May.2005 12.40pm",
      "content": "\\> The wiki listing for Mrs. Eaves is actually quite rude.\n\nFor the record: although that phrase in mine, I didn’t make that wiki entry (in fact I’ve barely even checked out the Typophile wiki stuff). Somebody must have thought it’s a good encapsulation of the typeface. Personally, although I stand by that characterization, I think Mrs Eaves is a complex enough face that it deserves at least a full paragraph, to put things in an adequate context. Also, believe it or not I do think there’s a place for tact, and there are things you can say -and ways you can say them- in “conversation” that are better left out of something “formal” like a wiki, or at least not given all the weight. On the other hand, there’s also something to be said for admitting that one’s font is badly spaced, coming to terms with it, and moving on - not letting it cloud your objectivity towards everything else, not letting it foster a bad attitude inside you.\n\nhhp\n\n"
    },
    {
      "time": " 14.May.2005 1.05pm",
      "content": "Dan, meeting you in Beirut I was just worried that you wouldn’t want to talk to me [much], but you seem to be a resilient person - I like that. Or maybe your hair kept distracting me.\n\nhhp\n\n"
    },
    {
      "time": " 14.May.2005 1.08pm",
      "content": "The nice thing about the wiki is that it’s editable, so I (and somebody else, apparently) went in and tweaked the [Mrs Eaves](http://web.archive.org/web/20080906160527/http:/typophile.com/wiki/Mrs%252BEaves) entry. Which says something about the Typophile community: we _are_ a community, and we don’t speak with a single voice. I happen to think Mrs Eaves is the bees’ knees. That’s one of the most valuable things about the forums: John Hudson and Hrant rarely agree on anything, but I’ve learned a ton by watching the sparks fly between the two of them.\n\nAnd yeah, sure, Hrant: different forms of communication work better for different temperaments. It seemed to me like you were disparaging John’s subjective preferences by trying to turn his statements into an objective characterization, but maybe that was just my reading.\n\n"
    },
    {
      "time": " 14.May.2005 1.10pm",
      "content": "I just got a haircut, on Tuesday :(\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080906160527/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 14.May.2005 2.37pm",
      "content": "I just get irked when someone refers to Typophile as a blog, as if nothing existed before [Six Apart](http://web.archive.org/web/20080906160527/http:/www.sixapart.com/) got their big idea.\n\njb\n\n"
    },
    {
      "time": " 15.May.2005 4.31am",
      "content": "I wish someone had the interview. I am worried that all this is over one comment that may not be as negative as I read it ...\n\nThis is still a great conversation.\n\nWith regard to format and value, I agree with both John and Hrant, because I can’t see where they are differing.\n\nJohn says this is not ideal for communication, but I know he is referring to having a one-on-one conversation - and he is right.\n\nHrant is looking at the larger community that is drawn together here and how that has opened up the opportunity to have an ongoing dialogue about type and type related issues - and he is right.\n\nTypophile is quite amazing when you think about it. The only other way to accomplish what it does would be to move all the participants into a single high rise in NYC and live and work together and I can just guess how long that would last.\n\n—  \nMike\n\n"
    },
    {
      "time": " 15.May.2005 9.34am",
      "content": "It is no secret that some key leaders of the type industry dislike Typophile.\n\nI’m curious about this generalization. Is it really true? As much as I try to steer clear of rose-colored glasses, I’ve not sensed this from the leaders I’ve come in contact with. Who are we really talking about here?\n\nBecause Typophile is an open forum, and we’ve traditionally kept the moderation to a minimum, I can understand that designers or companies that have a need to protect themselves may choose not to participate in discussions that may center around their products. I can understand the need to control the messaging around one’s goods or services. Public opinion is a double-edged sword; a word of praise can boost sales, while a disparaging one can harm it.\n\nOne thing I have learned is this: They may not be participating, but they’re definitely reading along.\n\nHowever this really shouldn’t be about _us_ vs. _them_. I have always found it refreshing that certain professionals have not feared taking part, even if their posts are fewer in number than some of the regulars.\n\nTypophile has always had, at its core, the goal of helping those who are isolated or have less experience benefit from the community experience. During the last five years, we’ve learned a lot about this community. Great collaboration happens, as do bickering and fights. It seems every family has that wacky outspoken in-law character who ruffles everyone’s feathers.\n\nIn order to make others feel welcome here, I think we as a community need to be cautious about negativity. The day that others perceive that posting to Typophile will be met only with criticism and negativity, this venue could wither away.\n\nI take Rudy’s comment (which I’ve not yet read) with a grain of salt. I can understand that he might not benefit as much from Typophile as others, but I’d hope that he could acknowledge that the Typophile community has helped many independents refine their craft which ultimately supports this industry.\n\nUltimately it’s our collective responsibility to make the conversations here stimulating ones, to stimulate thought and facilitate deeper discussion. Such discussions benefit everyone regardless of professional experience.\n\n"
    },
    {
      "time": " 15.May.2005 9.53am",
      "content": "Well, I just wrote “some.” Certainly, most reactions from non-posters that I have heard have been positive ones. To the critique-points—some of which are valid (I can’t name any sources :( )—here we go:\n\n1. A few old-foggies have told me that Typophile was just a collection of “people who have nothing better to do with their time.” I almost bit my tongue off listening to that…\n\n2. I’ve also heard from some others that that the dialogue is counter-productive here. Not a condemnation of the site per se, but still wrong in my opinion. It can be difficult for some older designers to understand just how important this resource is for the new generation. But some just see the bad-mouthing, and not the great sharing and critique.\n\nThe business pages of US newspapers are full of examples of how blogs are beginning to directly effect business and sales. This site is important. But there are people who overlook that.\n\n3. Lastly, (and this a totally different topic, really) I have heard from many German graphic designers (all younger ones) that Typophile is great, but they don’t trust their language ability enough to post. This makes me very, very sad. Especially because I post such terribly-written posts on German sites all the time. I imagine that there are alot of other designers in other countries, too, who wish that they could get more involved, but see a language barrier.\n\nJared, I think that you are right. Everybody reads along. Everybody in the industry. I’m sure of that.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080906160527/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 15.May.2005 11.02am",
      "content": "_The wiki listing for Mrs. Eaves is actually quite rude._  \nMy bad, all apologies. I just have one of those love/hate relationships with [Emigre](http://web.archive.org/web/20080906160527/http:/typophile.com/wiki/Emigre)’s stuff. [Mrs Eaves](http://web.archive.org/web/20080906160527/http:/typophile.com/wiki/Mrs%252BEaves) - gorgeous, Mason - stunning, Matrix Script - genius, Dalliance - sumptuous! hopefully that goes a ways to balancing out some of my other comments online. (not that anyone pays attention anyway)\n\n_And I will say now [on line] is the WORST kind [of interaction]._  \nI disagree. you’ll see a whole different side of me online than you would ever see in person (unless you know me REAL well). it’s easier to be uninhibited online and that can be both a good thing and a bad thing. also, i like having an archive of commentary i can go back to and reference later instead of saying to myself “now what was it that so-and-so said about such-and-such?” Without [Typophile](http://web.archive.org/web/20080906160527/http:/typophile.com/wiki/Typophile), I’d be utterly lost in the who’s who of type design and i’d probably be working at some crappy job i hate instead of cutting my teeth in the industry, so i can’t say enought good things about having a _great_ online network of like-minded (and not-so-like-minded) individuals in the world of type.\n\n_but they don’t trust their language ability enough to post._  \nThat IS sad! I love the occasional spanish posting that you’ll find here on typophile. It would be great to see some German (or any other language) as well. You should encourage your friends to post, maybe putting a babelfish translation at the bottom to give others the “jist” but keep the original post in the native tongue so that people who DO speak German or who care to know the exactly what is meant can hear these opinions that need to be heard!\n\n"
    },
    {
      "time": " 15.May.2005 12.28pm",
      "content": "22 posts and I am the only one who has read the article so far. Somebody please get a copy, read it, and tell me what you thought of Rudy’s comment.\n\n—  \nMike\n\n"
    },
    {
      "time": " 15.May.2005 1.41pm",
      "content": "\\> Who are we really talking about here?\n\nMostly people who don’t want anything bad said about them or their work, sometimes because they’re insecure, but I think much more often because they simply don’t have the time to challenge any of it (usually because they’re successfully busy, although sometimes because they’re lousy communicators on a personal level), and it’s frustrating, especially if you can’t help lurking! They feel that a lot of what many people (like me) write is hot air, or confrontational for its own sake, etc. One can sympathise with them, and anybody who loves Typophile wouldn’t want to get in the way of its full flowering\\*; on the other hand, you could say: it comes with the territory, and they have to live with that human reality - it’s no use getting angry at individuals; and if they really value a medium like Typophile they will grow tougher skin. And If they don’t value a medium like Typophile, then there’s nothing to be done (except nobody loose sleep over it).\n\n\\* Which is why I personally still have that standing offer: anybody who doesn’t want me to participate in threads they initiate, or reply to any of their posts, just tell me. No hard feelings (because I don’t have to force myself to care about you).\n\n\\> people who have nothing better to do with their time.\n\nRight. Which totally explains that I get paid to write magazine articles and give talks, am given design commissions, sell fonts (unifinished ones, mind you) and collect free promotional materials (including high-gloss catalogs, a newspaper, etc.) done with my fonts, all 90% because of Typophile. Like I said, I could write a short book.\n\n\\> they don’t trust their language ability enough to post.\n\nThis is also true of some other groups, like French designers.  \nYes, it’s sad, and I wonder what can be done about it.\n\n\\> Without Typophile, I’d be utterly lost\n\nDude, without Typophile, Paul wouldn’t be working at P22 now. And P22 wouldn’t have bought Lanston. And I wouldn’t have actual newspaper issues set in Patria. It’s all related, in a really really nice way too. Come on, jump in! Even the sharks here are never really that hungry.\n\nhhp\n\n"
    },
    {
      "time": " 15.May.2005 2.21pm",
      "content": "You guys are a real funny bunch. I never said that “Typophile is an example of an online blog that did not offer anything of real value.” Not even close. Although I may think that now, knowing you guys just make stuff up.\n\nHere’s what I said in Print:\n\n——  \nIt’s curious, though. I’ve always hoped for more design discourse, but now that it’s here, in the form of blogs, I’m a bit disappointed. The one thing I really miss about design discourse on blogs is that there’s very little connection between the participants and their own work. Everybody is a critic talking endlessly about the work of others, but you get very little sense of what bloggers think about their own work.\n\nAnd then there’s the disconnect between what they’re saying and how they’re saying it. Look at Typophile, a blog about type and typography. They spill literally tens of thousand of words each month on the finer points of type, legibility and readability, and it’s all set in the most unimaginative layout using a barely legible low resolution typeface. That’s a bit of a contradiction, don’t you think? The way they present their thoughts on type almost always undermines their own convictions. When Emigre discussed similar issues, we put our ideas into action, on paper, and distributed the results. We talked the talk AND walked the walk, so to speak. We experimented in public. Now you have all these bloggers going on and on about what’s right and what’s wrong without ever putting those ideas to work. That for me is the biggest disappointment with blogs. I’m all for theory, but at a certain point I want to see ideas put into practice.  \n——\n\nSee, didn’t say anything about typophile having no value.\n\n"
    },
    {
      "time": " 15.May.2005 2.34pm",
      "content": "\\>A few old-foggies have told me\\<\n\nI hope you don’t think they represent all of us “old foggies”? Remember, everyone here is either on the path to **olde-foggiedom** or prepared to die at a young age.  \nOld age is wasted on the wrinkled. :-)\n\nChrisL\n\n"
    },
    {
      "time": " 15.May.2005 2.55pm",
      "content": "\\>See, didn’t say anything about typophile having no value.\\<\n\nNo, you didn’t. You just voiced your opinion in a public forum. That is pretty much what everyone else does on Typophile or any other such forum. The difficulty is, we all get misquoted or even unquoted. In a magazine, replies are hard to make and slow to pursue. On the web, opinion is so quick to come that it is unedited and more open to error—the good news is, you can respond to your percieved-to-be detractors quickly and without being edited. “Truth” (however inacurate it may be) is opined by the reader having read the whole thread. No one said this was fair unbiased reporting. It is a collection of all bias in one place and the reader must take from it what he defines for himself.\n\nChrisL\n\n"
    },
    {
      "time": " 15.May.2005 3.01pm",
      "content": "Emigre, thanks for the correction/clarification/elaboration. You know one really great thing about Typophile though? A false premise can still lead to fruitful discourse, and yes, to better fonts even. And that ain’t gonna be stopped by nobody. And sure, we make stuff up sometimes, but at least it can quickly and openly be addressed. Claptrap published in a magazine can takes months if not years to correct.\n\nAs for the theory versus practice issue: those two worlds are to some extent opposite, and certainly different people like a different mix of each. Most of all, the two halves (like Yin/Yang) can and do benefit from each other.\\* Realizing that is more important than expressing one’s personal preference for one over the other. Also: quite obviously, you need to seperate what individuals here write versus what the owners of the site’s design believe - for example I’d like to be able to set my posts in Mana, but I just can’t; and many of us do put the theory that comes out of these discussions to work - we just don’t charge people to look at them (by mailing tree parts).\n\n\\* You know what’s really funny? I’m having a similar discussion right now with David Berlow on the ATypI list - but that costs $100 a year.\n\nhhp\n\n"
    },
    {
      "time": " 15.May.2005 3.13pm",
      "content": "Hello Mr. VanderLans.\n\nSorry that I responded to an inaccurate version of your comments; I did give a ’caveat’ that I didn’t know the context of the statement. Thanks for putting it here.\n\nThat being said, I don’t think what you actually said is entirely accurate.\n\nI do agree with you to a degree about the issue of readibility on the site. On the old design, I didn’t like the size of type and the Arial. Still, the old site was good in many ways. I have just been complaining about the size of type in the new design being too small, and having too long a measure, as well as low contrast - as have others.\n\nI see I and others were heard, though. The type has been switched to Georgia from Verdana (I think) and its measure now is more like 88 instead of 110 per line that is was. thanks! It would be better below 75, and a bit bigger in my opinion.\n\nIt would be great if you would give your opinion on the new design and how it might be improved. Joe and Jared are responsive, I see.\n\nThat being said, almost all of those who post are not the designers of this web site, and their own views are reflected in their own work. And some of those who post do discuss their own work. John Hudson recently discussed his own work, as has Nick Shinn, and the late Mr. Bloesma recently discussed his work recently here - and many, many others.\n\nSo your statement is not accurate in this respect.\n\nFurthermore, there is a lot of disagreement about what constitutes good design from the point of view of reabibility. And there are plenty of books about type that are not very readible in my opinion. Often the effort to achieve a different look results in poor readibility.\n\nThere are some annoying and boring posts here, but there are many with genuine insight, and I think you will be pleasantly suprised if you actually participate.\n\nSo Welcome to Typophile!\n\n"
    },
    {
      "time": " 15.May.2005 3.16pm",
      "content": "Looks like there is just now another change in the type!\n\n"
    },
    {
      "time": " 15.May.2005 3.18pm",
      "content": "If the bold type is not a bug, I think it would be better bigger and not bold!\n\n"
    },
    {
      "time": " 15.May.2005 3.49pm",
      "content": "Case in point: a bug on the site -certainly not a design decision- is causing everything after dezcom’s first post to be in bold... So besides the separation between the thoughts of members and the design decisions of the site owners, there’s of course the classic difference between print and the web: you don’t design a final product, your sort of “metadesign” something as best you can and cross your fingers. So complaining that some of the content does not always match the presentation (especially coming from the WRBWWRM camp - noting that what many of us have been reading most for years is Typophile!) holds no water in [at least] two ways.\n\nhhp\n\n"
    },
    {
      "time": " 15.May.2005 4.02pm",
      "content": "Closed the “strong” tag in Dezcom’s post. Bold type gone. This looks a lot better.\n\nBTW I didn’t chime in any earlier, but I think this thread might’ve benefited from better informed postings. I wouldn’t dare commenting on stuff that I just heard of, not actually read myself. I can understand Mr. Vanderlans was annoyed by this. Pity.\n\nStill, referring to Typophile as a blog is inaccurate and doing it injustice.\n\n"
    },
    {
      "time": " 15.May.2005 4.04pm",
      "content": "Hey, I actually managed to edit someone else’s post. This must mean my superpowers are slowly coming back! :-)\n\n"
    },
    {
      "time": " 15.May.2005 4.23pm",
      "content": "Typophile used to have a perfectly legible typeface.\n\nI might not be the most enthusiastic member on Typophile and might go as far as saying that none of you have anything better to do with your time (because there is nothing better than a nice cup of Hrant in the morning), but calling Arial a barely legible typeface is really begging for it.\n\n_{ editted by moderator }_\n\n"
    },
    {
      "time": " 15.May.2005 5.05pm",
      "content": "Ah! That is better - Rudy, thank you for posting and for setting the record straight. I was much too general in my original post. My intent was to get clarification, as I thought a number of other Typophiles would have read the interview and have a better take on it.\n\nI am sorry that my post has caused you to feel unfairly treated.\n\nMan - now I feel badly. I completely misread your comments.\n\n—  \nMike\n\n"
    },
    {
      "time": " 15.May.2005 6.02pm",
      "content": "\\>Closed the “strong” tag in Dezcom’s post. Bold type gone\\<\n\nGood Heavens! Sorry Yves. I didn’t know I had such power. Who would have thought that my failure to endtag would have persisted beyond my own post. Is this a bug or am I to assume that anyone failing to endtag can cause this to occur again?\n\nChrisL\n\n"
    },
    {
      "time": " 15.May.2005 6.13pm",
      "content": "Rudy,\n\nI really appreciate your comments. When speculation starts to fly around here, there’s no better grounding force than to have the source set the record straight.\n\nI’m right with you regarding Typophile’s forum design, which has always been a sore point for me personally as well. It’s a good example of letting the software dictate the aesthetic which goes against my views whether I happen to be wearing the Typophile hat or the Punchcut one. I absolutely agree that we have not practiced what we preached. In the defense of the greater Typophile community, they’ve been suggesting we improve things for quite some time now, which we were not able to address due mostly to time issues.\n\nI am pleased that we were able to make many enhancements in the relaunch, many of which were technical ones that we’re still refining during this beta phase. One key improvement that brings us up to speed with sites today is simply the use of CSS to drive the styles throughout the site. Making font changes site-wide to improve readability, etc is now a very easy thing to do — as easy as making a CSS change or offering an alternate theme that users can turn on for larger type — something that we weren’t able to do on the old site.\n\nSpeaking to everyone now: Thank you for your input. Feedback and/or design improvements (design comps would be a nice medium) are always welcome, especially during this beta phase.\n\nsend to: —\\> typophile (at) punchcut (dot) com\n\njB\n\n"
    },
    {
      "time": " 16.May.2005 1.56am",
      "content": "I hate moderators on this board.\n\n"
    },
    {
      "time": " 16.May.2005 5.21am",
      "content": "Why, thank you! :)\n\nBTW I didn’t edit your comment, but I still think it was a pretty cheap remark.\n\n"
    },
    {
      "time": " 16.May.2005 8.07am",
      "content": "\\>there’s very little connection between the participants and their own work.\n\nI have often posted samples of my work (and theories) into a thread.  \nI liked the way you could make a JPG of black type on a white background, and (providing your post happened to fall on the white background, rather than the alternating gray), you could get it to fit into the layout of the Typophile page, flush left with the type column.\n\nWith the new layout, I’m disappointed not to be able to do this, and find that too much attention is taken by the avatars, which are too close to the main column. (Square is also not a comfy shape for heads.)\n\nLike Sergej, I really dislike the new basic layout of the threads, with the constant interruption to the vertical flow caused by posters’ names, dates, and “reply”, and the excessive measure. And that huge serif type at the start of each thread, puhleeze...\n\n"
    },
    {
      "time": " 16.May.2005 8.09am",
      "content": "BTW, what percentage is the grey background tint?\n\n"
    },
    {
      "time": " 16.May.2005 8.12am",
      "content": "May I ask who it was? (I wouldn’t want to offened that sensitive individual with my dumb humour if I ever meet him/her in person.)\n\n"
    },
    {
      "time": " 16.May.2005 9.37am",
      "content": "_And that huge serif type at the start of each thread, puhleeze…_\n\nThat serifr type with the shadow at the top of each thread is actually my favorite part of the redesign.\n\nSergej, why the negative tone?\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080906160527/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 16.May.2005 9.41am",
      "content": "_Random thoughts from my gut that are probably out of order, but will hopefully make some sense._\n\nThe beauty of the world is that we are all given the choice to our own subjective opinion about the things we see around us. The key words be _“subjective opinion”_ What one person perceives as useless, another sees as incredibly useful.\n\nPerhaps it could be said, and from my own chair with my own opinion, Emigre would never have become what it is today without questioning authority. For that we now have a large body of work which—in one way or another—has probably had affect on each of us as most of us here are designers and/or typographers.\n\nIf we don’t question, we don’t learn for ourselves. If we don’t learn for ourselves, we are merely puppets. But, the _content_ of what we learn is going to be different and make us unique. If we all read the same books, and perceived the information in the same way, wouldn’t the world be a hella-boring place to live?\n\nIn some ways, I wonder aloud, if the questioning of authority has simply been given more outlets with the advent of forums (Typophile) and blogs (Typographica). And perhaps the _“unimaginative layout”_ is less important than the words being shared.\n\n_As to Typophile and whether it is content rich or content poor._ The internet has created a means by which each of us can instantaneously question authority. Perhaps this speed is a double-edged sword. I doubt very much if very many of us write our thoughts out and then edit them. Again, this is a beautiful and an ugly thing. It creates more of a conversation, but in conversation we always have the problem of wishing we could have edited our thoughts first.\n\nRudy has his opinion, and I have mine, and you have yours, and they have theirs. But isn’t it great that we have a forum here at Typophile where we can meet and share, learn and educate, learn and grow?\n\nVery random. All apologies.\n\n"
    },
    {
      "time": " 16.May.2005 10.22am",
      "content": "Good points by Rudy VanderLaans. One point of this – and other forums, as this sure is not a blog – is that we critique the work of our peers (and I’m heartily doing so as well), and I see how that CAN come across as scholastic, especially of paired with the rather standard (or, for a lack of a better term, practical) design of this board. Now, personally I feel that the critique-section is a helpful spot and I’m still learning there, even while not displaying my own work there. But I can see that – from the standpoint of design as a journey of discovery that emigre always stood for – RV simply wants more from an online-design-platform.\n\nBut maybe this is the wrong place for this kinda experiment.\n\nMost forums and blogs are based on standard-software these days and I’d say that the experiments in the digital realm aren’t prone to work for a forum with so many members, which – above all - need reliability and accessibility. I must WORK. An experiment in design, alas, has the built-in tendency to fail (sometimes beautifully, but still). Typophile is a platform, not an experiment. AS a platform, it’s an experiment in itself (CAN designers cactually communicate with each other?), but formally of course it is a rather regular website. And as such it shares the fundamental design shortcomings of almost every site compared to printed matter. There are some sites by individual designers who experiment quite happily along the lines of what Emigre did in the world of print in the 80s, but maybe... just maybe... the time still isn’t right. See, when Rudy and Zuzana came along with Emigre, they created a magazine that operated on the basis of the history of print since Gutenberg... and ithe experiments theydid harkened back to stuff that had been done before, while being rather fresh and acute because of the advent of the Macintosh dtp possibilities. In a turbulent time of change from analog to digital print, Emigre was among the lucky few to be in the front line and embodied that change like almost no other magazine could, in a brilliant mixture of theory and practical work.\n\nMaybe, just maybe, we’re not at such a tipping point in the world of online communication, though. There IS massive change in the air, we all can feel it, the way we will communicate has changed drastically within a handful of years and we all know in our bones (and thanks to Bruce Sterling and Co.) that we’re only at the beginning of an evolution in our everyday communication that will make Gutenberg seem like a wet fart.\n\nAnd; I#d like to think, there ARE designers at work in this area, experimenting with online stuff, working with the possibilities of a global network of cellphone cameras, SMS and so on. It’s happening out there and it’s ad intoxicating as Emigre and Fuse and all that have been in the 80s.\n\nIt’s just that Typopile is probably rather the place to discuss such experiments than actually undertake them. Structurally, the interface you need for an efficient blog and the kind of interface that works well with experimental stuff... aren’t quite congruent at the moment.\n\nSo yeah, I’d agree that we need more online stuff doing what VanderLans and Licko did on Paper (and digitally in their typefaces).\n\nBut maybe, just maybe, this really isn’t the place for it :-D.  \nHD Schellnack\n\n"
    },
    {
      "time": " 16.May.2005 10.47am",
      "content": "Rudy,\n\nThanks for posting the source. Nothing better than that.\n\nTo answer your critique of Typophile (a forum) and others (online blogs) it’s worth highlighting the main differences between a magazine and a forum. A magazine (or even a blog) can have an editorial body that creates a point of view - nurtures it over time, as Emigre did. Typophile is an open community, a forum with hundreds of contributors and nobody art directing the masses. Typophile is not a blog where a handful of authors state their piece and let others comment.\n\nConsider [Design Observer](http://web.archive.org/web/20080906160527/http:/typophile.com/wiki/Design%252BObserver) (a blog), where the authors use it as an online journal to chronicle their thoughts and observations. Their design is coming through in their professional work, not manifested through their blog. (It’s not the stated purpose of their blog to push the boundaries of online design.)\n\nIt’s all about putting the medium to its best use. In the case of Typophile it’s best use is to connect people who come with a varied pool of ideas, cultures and perspectives.\n\n"
    },
    {
      "time": " 16.May.2005 1.24pm",
      "content": "Nick,\n\nWe’re still working out bugs across browsers - some browsers such as IE are not displaying the CSS properly. Safari has got it right, if you use Mac.\n\nThe giant serif at top of the thread is a bug - Type should be approx 12pt Georgia throughout, with post name/date and icon on the left side.\n\n(Ah, the pain of a public beta)\n\njared\n\n"
    },
    {
      "time": " 16.May.2005 1.50pm",
      "content": "“Hey, people on this board have written some very presumptuous, uninformed disparaging things about me too, but I’m still here! Because I like the abuse?”\n\n::laughter::\n\nAnyway... I enjoy, benefit from, and sometime get irked by both Emigre and Typophile, for the reasons both have given. Fancy that.\n\nA side note: I’m sad that _Emigre_ will no longer be published. Right when I was really getting energized by it, too. (I still can’t believe I sat through as much of that DVD as I did.) Looks like maybe Typophile might have to start doing some of the “walk” to pick up that slack, eh?\n\n"
    },
    {
      "time": " 16.May.2005 3.26pm",
      "content": "Jared, I had a look at the site on Safari, as opposed to IE, which I have been using, and lo and behold, all the design faults I had criticized have vanished!\n\nMy apologies.\n\nHowever, my password, which is fine on IE, doesn’t work on Safari!\n\nBTW, the reason I use IE as my main browser is because it is the most-used browser, and as I have my own web site, I always try to make it work best on the most-used browser first.\n\n"
    },
    {
      "time": " 16.May.2005 3.27pm",
      "content": "Chris, absolutely. The more this community can \\_demonstrate\\_ their expertise, the more Typophile’s reputation (as a community) will grow. I think the unique nature of what we have to offer here, though, is that we have the added dimension of thousands of designers from around the world unifying their effort on a given project.\n\nOne of the key objectives with the new Typophile v2 is to promote collaborative Projects (hence the presence of Projects in the global navigation. It is very intentionally placed just after the Forums and Wiki. We’re still migrating content over to the new site but have high hopes that the Projects section will be just the venue for designers to walk the walk.\n\njb\n\n"
    },
    {
      "time": " 16.May.2005 3.33pm",
      "content": "Sorry, I forgot I changed my password.  \nLuckily, I remembered it.  \nNow I am in Safari. Must remember to use it.\n\n"
    }
  ]
}
