{
  "id": "1241",
  "title": "MyDefinition Chollorized typographic logo",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "A logo I just completed for a nightclub.   \nCan't decided if it works best with or without the tail on the last \"n\". Opions?   \nLettering is modified Chollo Unicase by   \nSibylle Hagmann   \n(distributed by Hrant's favorite type foundry)   \n ![My Definition Final Logo.jpg](http://web.archive.org/web/20150417203212im_/http:/www.typophile.com/forums/messages/29/1595.jpg)\n\n",
  "author": "designalchemy",
  "time": "27 Jun 2002 — 5:46am",
  "uid": "804",
  "comments": [
    {
      "time": "27 Jun 2002 — 6:21am",
      "content": "it's better without it.   \n   \nI like it by the way ![:)](http://web.archive.org/web/20150417203212im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "27 Jun 2002 — 8:11am",
      "content": "Without...   \n   \nThe \"with\" version looks like the tail was just tacked on, I don't think it fits with the rest of the letterforms, especially since the other \"n\" doesn't have tail.   \n   \nI like it.\n\n"
    },
    {
      "time": "27 Jun 2002 — 8:57am",
      "content": "Take the with version and wrap the tail around and back to the front - you'll have a 2050 baseball team logo :D   \n   \nJust kidding - I'm with the group, without the tail becuase instead of adding, it does take something away from the design.   \n   \nStuart :D\n\n"
    },
    {
      "time": "27 Jun 2002 — 9:05am",
      "content": "I like the tail, but I think it needs more weight. I would keep the width consistent through the bend, and even extend it a bit.\n\n"
    },
    {
      "time": "27 Jun 2002 — 10:54am",
      "content": "Ole - Maybe you can ligaturize the fi combo...   \n   \nbj\n\n"
    },
    {
      "time": "27 Jun 2002 — 2:11pm",
      "content": "I'm with Marc. I like the idea of the tail, but as it's drawn, it's not working. The outer curve of the tail should be less circular and more acute, thickening the stroke and emphasizing the angle of the bend a bit more. You still might ultimately decide against the tail, but you'll have a better tail to consider. ![:)](http://web.archive.org/web/20150417203212im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI also like bj's idea of an \"FI\" ligature. It's worth a try.   \n   \nDavid\n\n"
    },
    {
      "time": "27 Jun 2002 — 5:49pm",
      "content": "Here is some versions with the ligature fi. I tried this early on, but did not really like it. It seemed like it could look a bit like a stylized 'A\"   \n ![MD1.jpg](http://web.archive.org/web/20150417203212im_/http:/www.typophile.com/forums/messages/29/1600.jpg)\n\n"
    },
    {
      "time": "27 Jun 2002 — 5:51pm",
      "content": "Decided the tail on the \"n\" was more trouble than it was worth\n\n"
    },
    {
      "time": "28 Jun 2002 — 9:15am",
      "content": "the top one is probably the most readable option? where   \n is hrant when we need him? does anyone see the   \npotential for an 'n' in horizontally flipping that top lig?\n\n"
    },
    {
      "time": "28 Jun 2002 — 11:32am",
      "content": "Met with client last night, they want the center   \ndesign with the fi ligature. Tiffany your idea of   \ndoing a horizontal flip on one of the \"n\"s sounds   \ninteresting. I think I will try that. Thanks\n\n"
    },
    {
      "time": "28 Jun 2002 — 3:51pm",
      "content": "Here is the version with the flipped \"n\"   \n ![Def1.jpg](http://web.archive.org/web/20150417203212im_/http:/www.typophile.com/forums/messages/29/1604.jpg)\n\n"
    },
    {
      "time": "28 Jun 2002 — 4:13pm",
      "content": "Ole - I'm not sure what Tiffany meant exactly, but flipping the second 'n' sted of the first might 'frame' it...?   \n   \n ![def.jpg](http://web.archive.org/web/20150417203212im_/http:/www.typophile.com/forums/messages/29/1605.jpg)   \n   \nwith liberty. just an ideer.   \n   \n   \nbj\n\n"
    },
    {
      "time": "20 Jul 2002 — 3:29pm",
      "content": "I'm always there when you don't need (or at least don't want) me.   \n   \nBTW, Ole:   \nMy favorite foundry is actually this small, obscure outfit where they make fonts that are less legible than anybody else's. It's called Emigraine.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Jul 2002 — 4:58pm",
      "content": "Okay. BJ was thinking along the same lines, but not quite   \nthe same. So the top of these two images is what I meant,   \nbut now I take it back cause there are too many tricks in   \nthis bag. ¶ So then I tried the bottom of the two. I   \nremoved the cholla-ness of the letter (although it would   \nbe better to just draw your own shapes) and added a little   \nuniqueness. Only for the sake of ideas. ¶ As for tests and   \nfinding a good fit when working on any identity (logo,   \nwhatever) IMO if you plan on altering the type to make it   \nmore \"ownable\" by the company, it is always easier (and   \nbest?) to start from a simple (yet strong) foundation and   \nadd. When using type that is too unique already (too   \ntricky, trendy) it is difficult IMO to avoid making things   \neven more tricky.   \n   \n   \n ![nothis.gif](http://web.archive.org/web/20150417203212im_/http:/www.typophile.com/forums/messages/29/1755.gif)\n\n"
    },
    {
      "time": "20 Jul 2002 — 4:59pm",
      "content": "haha. sorry about the absolutely sloppy image.\n\n"
    },
    {
      "time": "22 Jul 2002 — 4:12pm",
      "content": "Tiffany, the second one is very cool.\n\n"
    },
    {
      "time": "27 Jul 2002 — 12:59am",
      "content": "I have been busy that past couple of weeks and did not notice all the re-workings/posts till' tonight.   \nI guess the thing to mention is that the client is kind of a minimalist. I tried a few extra mods that did not exactly increase legibility and client wanted it as simple as possible considering the budget ran out and new mods would cost extra them extra. I think perhaps the fi ligature is a bit too close to resembling a cap 'A\" but it has gone to print and there is unfortunantly no more time for exploration. I appreciate the input.\n\n"
    }
  ]
}
