{
  "id": "12418",
  "title": "How about some Typowiki Tutorials? FAQ?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Evidently this 'user-created encyclopedia' is supposed to be a reference source for all of us, but when I click on any links from the Indices, I don't see articles. Instead I get a place to enter content. ( I was hoping to learn about one of the listed designers)\n\nAm I the only one who doesn't get what this Typowiki is about? Are only certain members allowed to use it?\n\nWhat qualifications do we need to write an article in one of these 'nodes'? What are 'nodes' anyway?\n\nI think the assumption that all of us who use Typophile will already know about this and how to use it is sure not valid in my case.\n\nPlease provide more information about this prominent site feature, and how we can use it and participate, if that's what we are supposed to do.\n\nThanks  \n- Mike Yanega\n\n",
  "author": "bowfinpw",
  "time": "14 May 2005 — 10:04am",
  "uid": "2088",
  "comments": [
    {
      "time": "14 May 2005 — 10:22am",
      "content": "I'm no wiki or typography expert, but as far as I know, anyone can edit any entry of a Wiki. The only requirement, I believe, is that what you enter is true, valid information. Opinions and discussions are what the the forum is for :)  \nThe Typowiki has just started (less than two weeks ago) so there are many entries yet to be filled, and new ones to be created.\n\nFor more information on Wikis, I suggest you visit the [Wikipedia](http://web.archive.org/web/20130919051807/http:/www.wikipedia.org/). It's a very large Wiki (maybe it's the original Wiki? I don't know) and their [help section](http://web.archive.org/web/20130919051807/http:/en.wikipedia.org/wiki/Help:Contents) could probably help you a lot with understanding Wikis better.\n\n"
    },
    {
      "time": "14 May 2005 — 11:56am",
      "content": "[Wikipedia](http://web.archive.org/web/20130919051807/http:/en.wikipedia.org/) is far from being the original wiki. Wikis were originally designed to be tools for rough and ready collaboration among teams of programmers, and predate Wikipedia by a few years. However, Wikipedia is definitely the _best_ public wiki out there, and anyone wanting to see how the Typophile wiki ought to work could learn a lot from Wikipedia, and not just about wikis.\n\nThere are two key concept to wikis: anyone can enter information, and anyone can modify information after it's entered. Allowing both those things is a pretty radical idea on today's (rude, foul-mouthed, malicious, partisan) internet, and it's worked out surprisingly well in practice. Even the most contentious entries on Wikipedia eventually stabilize towards something approaching the truth, especially because everyone can see the modification history of the page, and Wikipedia has some moderation controls that the comparatively simple Typophile wiki hasn't implemented yet. Moderation is still the exception rather than the rule, though.\n\nOne of the key benefits of wikis is how fast and dirty they are. I tend to really heavily crosslink the entries I write, assuming that some other day when I get bored I'll come back and fill in some of the cross-referenced articles if nobody's gotten around to it yet. The brilliant thing is that sometimes somebody has, as Dan Reynolds did with a bunch of German / blackletter entries I'd linked to in passing. The results are stronger than what either of us would have done working on our own, and they'll only get better over time as more people come in and add additional information, edit for structure, and correct the inevitable mistakes.\n\nSo yeah, that's the idea: anybody who cares enough about an entry to write something is qualified to write it, because unless they're operating completely maliciously, they're not going to do damage to the wiki or Typophile; somebody else will come along eventually and fix stuff up if they notice it's wrong. If you want to add stuff, then do it! It's fun!\n\n"
    },
    {
      "time": "14 May 2005 — 8:53pm",
      "content": "Thanks Gabriel and Forrest. I did look at the Wikipedia, so now i guess it's time to try ours again and see if i can make sense of it now that I have learned a bit.\n\nStill think some sort of introductory tutorial wouldn't hurt, for those of us who are not familiar with the concept and practice of developing a wiki reference site.\n\n"
    },
    {
      "time": "14 May 2005 — 10:24pm",
      "content": "Mike,\n\nYou're right, we should not have made the assumption that most people would know what it was and dive right in.\n\nIn a nutshell, the Typowiki is an encyclopedia of typography for the Typophile community. Since it is a community-driven tool that can take shape in virtually infinite ways, it's a natural evolution of the forum in that we can now separate factual information from opinion and discourse.\n\nBest of all, the forums and wiki are fully integrated, so now we can all refer others users to other topical areas simply by wrapping the term in question in double brackets [[ like this] ]. Typophile will color the link green and precede the term with a small superscript \"W.\"\n\nAn entry does not have to exist to reference the wiki. If you want to create a reference to [Mike Yanega](http://web.archive.org/web/20130919051807/http:/typophile.com/wiki/Mike%20Yanega) simply wrap it in double brackets, and let someone else create the entry. These entries are typically referred to as \"stubs.\" We're exploring ways to differentiate standard wiki entries from stubs.\n\nPersonally I'm hoping that the wiki can become the go-to place for frequently asked questions that normally end up in the forums. Is there any reason why the wiki couldn't or shouldn't resolve questions like:\n\n1. Does anone know any fonts that look like _font x_?  \n2. What fonts go well with _font x_?  \n3. Can you guys recommend any good [quirky rodeo](http://web.archive.org/web/20130919051807/http:/typophile.com/wiki/quirky%20rodeo) fonts?\n\n"
    },
    {
      "time": "15 May 2005 — 9:08am",
      "content": "Thanks Jared, that perspective was helpful. I think I need to bookmark this thread.\n\nThe idea, especially in your concluding examples, would certainly have potential use for the Type ID Board, _as long as we can describe it with the same key words_.\n\nI can also imagine wanting to be able to link to Designer or Foundry Typowiki entries.\n\n"
    },
    {
      "time": "15 May 2005 — 10:06am",
      "content": "Keywords are tough. I occasionally work on keywords for the Linotype site. MyFonts is the most extensively keyworded type site that I'm aware of. Don't they have over 40,000 keywords?\n\nKeywords are only good if they are acurate, and if they are updated, I think. But a wiki is a great way to handle keywords. Then you get more than you would if it was just handled by a few moderators or editors.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130919051807/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    }
  ]
}
