{
  "id": "12427",
  "title": "Urgent Logo help",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Ever stare at something so long your'e not even sure if its good or really, really bad? thats the problem iam having with this logo. the font isbryant (i like it its nice and friendly), but please bear in mind that this is a hand-rendered version of the font as i have not yet made my final selection. What really bothers me is the logo symbol though - is it cheesy? is it badly done? anycrits would be greatly appreciated! i haveonly just graduated and feel lost without my lecturers...\n\n| Attachment | Size |\n| --- | --- |\n| [logo.jpg](http://web.archive.org/web/20131020061541/http:/typophile.com/files/logo.jpg) | 16.05 KB |\n\n",
  "author": "meaculprit",
  "time": "14 May 2005 — 3:29pm",
  "uid": "7338",
  "comments": [
    {
      "time": "14 May 2005 — 3:35pm",
      "content": "My first concern when seeing this centered around how well it would hold up at the size and medium in which it will be used. Can you provide those details?\n\n"
    },
    {
      "time": "14 May 2005 — 3:43pm",
      "content": "Que? erm yes well eh heh. of course it will be much smaller, and i will have to work out at which point sizes it will most legible etc etc. my main concern at this point is whether it is viable,whether the typeface of the logo symbol is not putridly horribly distorted beyond all recognition, and whether the concept is a go. from then on i can work out the rest in detail (thismayseem like a backwards way of going about things, but, hey.) as for usage, it will be appearing on all manner of material, from web to print. my initial thoughts are that the 'd'/speech bubble should eventually be able to work on its own, without the supporting type...\n\n"
    },
    {
      "time": "14 May 2005 — 6:41pm",
      "content": "The D/speech bubble is a good concept; but right now it needs work to be obvious. I think it needs more weight to stand on its own. Also, the way that the speech arrow flows into the D seems awkward. I think this element needs to stand out a little more. Maybe you could try shifting it a little farther up on the stem of the D.\n\n"
    },
    {
      "time": "15 May 2005 — 5:08am",
      "content": "thanks for the help y'all...\n\n"
    },
    {
      "time": "16 May 2005 — 4:24am",
      "content": "My initial reaction to the D mark is that the speech arrow and the inside top left corner would be more \"friendly\" if they curved and worked more in relationship with the final choice of text rather than centred, try hanging it off the lettering.  \nTim\n\n"
    }
  ]
}
