{
  "id": "124213",
  "title": "Ephemeral Fraud - Typographic Ignorance",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "Wedding Text"
  ],
  "content": "While researching the German calligrapher Conrad Scherzer, and a book which he illustrated in the late 1930s, I ran across a website selling Nazi era objects and ephemera. While scanning the listings looking for the item the search had flagged, I ran across what would probably prove to be a rare bit of printed ephemera. If it were genuine.\n\nThe item is purported to be Heinrich Himmler's calling card, and as the description describes,\n\n\"It was found in Himmler's apartment by a US Soldier, and brought back home. then he forgot about it. After he died, his widow found them, and the Hitler cards, and sold them to the guy I bought them from. These cards are larger than US business cards - approx. 6.3 cm x 10.5 cm.\"\n\nIntrigued by what typeface the card might be set in (some Antiqua by Koch, Tiemann, Renner, Erbar, et al.) I clicked the thumbnail to see an enlargement.\n\nAs you can see, it's MF Benton's \"Wedding Text\".\n\nSeriously. The amazing typographic (and historic) naiveté. Not even using the alternate, less Anglicized H either.  \nAnd then there's that SS. . .\n\n ![](http://web.archive.org/web/20150405123206im_/http:/typophile.com/files/HH-card_4914.jpg)\n\nI should note that I found nothing on-line on Scherzer in English. Gerry Cinamon's very comprehensive [site](http://web.archive.org/web/20150405123206/http:/www.germandesigners.net/) makes no mention.\n\n",
  "author": "interrobang_lp",
  "time": "30 Mar 2015 — 12:11pm",
  "uid": "2089",
  "comments": [
    {
      "time": "31 Mar 2015 — 1:37am",
      "content": "You’re sure this is real? Anyway, this looks like a chef’s business card from a five star restaurant.\n\n"
    },
    {
      "time": "31 Mar 2015 — 2:19pm",
      "content": "No, it's NOT real, but is being offered for sale ($199.00) as if it is.\n\n"
    },
    {
      "time": "31 Mar 2015 — 8:11pm",
      "content": "Amazing... Probably laser jet printed too. Oh those Nazis and their crazy inventions.  \n(I started to have my doubts when I read the part where the soldier only found one calling card in Himmler's apartment instead of a drawer full.)\n\n:o)\n\n"
    },
    {
      "time": "2 Apr 2015 — 6:55pm",
      "content": "better yet, it's probably thermography. . .\n\n"
    }
  ]
}
