{
  "id": "12424",
  "title": "Let's discuss Wiki Etiquette",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[This thread](http://web.archive.org/web/20130919052855/http:/typophile.com/node/12415) prompted me to write the following. Discuss. =)\n\nI'm not a Wiki expert, but in order for it to work and be a valuable, unbiased resource, protocol (call it culture or etiquette or whatever) demands that you not let your own biases show, but that you couch biases in terms of general camps of thought without acknowledging the rightness or wrongness of the position. This is where it would be inappropriate to treat yourself as an authority and write with an authoritative air.\n\nFor example the current wiki post for [Mrs Eaves](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Mrs%20Eaves) could use a scrubbing. Here's the phrase there now:\n\n_\"Mrs Eaves is beloved by graphic designers and regarded with mild suspicion by typographers, who question its legibility and fitness for use in body text.\"_\n\nThis has a connotation that designers like it and typographers don't and that somehow one is more authoritative. Here's my suggested edit (that someone else will surely edit after me):\n\n_Mrs Eaves is a highly popular typeface among graphic designers as evidenced by it's wide use. It's popularity can be attributed to Licko's fresh take on a classic - with an infusion of delicate features and a robust set of ligatures. Some of its wide adoption can also be attributed to [Emigre's](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Emigre) popularity and visibility among graphic designers as a foundry willing to push the boundaries of conventional typography._\n\nSome designers question Mrs Eaves fitness for use in body text. These designers believe its readability as a text face suffers due to it's relatively tall [ascenders](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/ascender).\n\n(And this is where I'd fully expect someone to elaborate on this, suggesting alternate reasons why it's legibility is in question. Others might write their piece suggesting why the legibility of Mrs Eaves is just fine. But this wiki post for Mrs Eaves should not become a wiki entry on readability.\n\nSee how both positions are put forward. There may be some of my own biases showing, but its presented in terms of both sides of the argument. It would be uncool if someone now edited the post and said, \"it rocks\" or \"it sucks.\"\n\nNow, too bad there's nothing under [Comic Sans](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Comic%20Sans) yet. =)\n\n",
  "author": "Joe Pemberton",
  "time": "14 May 2005 — 2:32pm",
  "uid": "1160",
  "comments": [
    {
      "time": "14 May 2005 — 2:51pm",
      "content": "So I guess the question is:\n\nThe wiki should be factual and objective, right? Subjective entries are bad? How should personal wiki entries differ (like [Stephen Coles](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Stephen%20Coles)' entry)?\n\nI think that the forum is the proper place to discuss the merits of a typeface. Shouldn't the wiki just say something like, \"Mrs. Eaves was designer by [Zuzana Licko](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Zuzana%20Licko) in… … [John Baskerville](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/John%20Baskerville)… …number of weights… … [John Butler](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/John%20Butler), [OpenType](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/OpenType)… …available from [Emigre](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Emigre).\"\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130919052855/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "14 May 2005 — 2:59pm",
      "content": "Yes, let's discuss this!\n\nAs the author of some of the contentious bits of that article, let me explain my rationale. I'm an avid reader of reference books like [encyclopedias](http://web.archive.org/web/20130919052855/http:/www.amazon.com/exec/obidos/tg/detail/-/031213486X) or [grammars](http://web.archive.org/web/20130919052855/http:/www.amazon.com/exec/obidos/tg/detail/-/0198602634). From the best of those I've learned that the best writing in such resources is concise, complete, and unafraid to pass judgment. People come to reference works for context, so they don't want to get bogged down in details (although, uh, I sure like to provide them) and they do want to know where certain things fit in. A little bit of opinion isn't going to hurt.\n\nLet's look at your revisions to [Mrs Eaves](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Mrs%20Eaves). To my eye, _[Its] popularity can be attributed to Licko’s fresh take on a classic -- with an infusion of delicate features and a robust set of ligatures_ reads less like a \"fair evaluation\" and more like marketing copy, and _These designers believe its readability as a text face suffers due to it’s relatively tall ascenders_ doesn't really capture the Typophile sentiments I've seen expressed by Hrant and others (although his punchy quote that I placed at the beginning of the entry captures this sentiment wonderfully). I personally love Mrs Eaves, but I thought the sentence I wrote did an accurate, and concise, job of summing up the divide in opinion I've seen on the face on place like Typophile and in the real world. I've run into lots of folks online who don't like Mrs Eaves, but almost all of my designer friends in real life count it as one of their favorite typefaces.\n\nLike I said [elsewhere](http://web.archive.org/web/20130919052855/http:/typophile.com/node/12418), the nice thing about wikis is that the tendency is for entries on them to gradually evolve towards equilibrium. With wikis like [Wikipedia](http://web.archive.org/web/20130919052855/http:/en.wikipedia.org/), this is helped by the fact that all visitors who care can see the page's revision history, and restore things that they feel have been cut unfairly. I've read that Typophile's wiki tracks revisions, although the UI has not yet been exposed. I'd prefer to write opinionated things and allow folks to tweak them as they see fit, and to come back and tweak them later myself, than to try to pretend to a dispassion I don't feel when I first write entries. I get enough \"he said / she said\" journalism from the media, where \"balance\" has replaced accuracy (to say nothing of facts or the truth). Typophile is a crusty, opinionated community. I think our resources will be more entertaining -- and more useful -- if we allow them to reflect that fact.\n\n"
    },
    {
      "time": "14 May 2005 — 3:03pm",
      "content": "Also, I'd like to politely suggest that people who would like to make radical alterations to existing wiki entries might want to send a short note to the author or last modifier(s) of the entry notifying them that they're about to do so. We all think hard about what we write to the wiki, and especially in the longer entries, if we come back to something on which we've spent a lot of time, we're likely to be surprised and dismayed if it no longer reflects the spirit of what we wrote.\n\nIt would be better, towards that end, if the revision history and authorship status of wiki entries was exposed sooner rather than later. Wikipedia's UI presents this information well, and since it's open source, there's no reason we can't coopt their interface design for our own purposes.\n\n"
    },
    {
      "time": "14 May 2005 — 3:07pm",
      "content": "I'm the one who moved the Hrant quote from the first line to the last. Now its back up top and I think that it ridiculous. Here is why:\n\nI don't mind this opinion entering into the wiki-thread. But the wiki is supposed to a source of information. The \"first word\" about a topic should not be subjective. The \"first word\" of the Mrs. Eaves' entry should not be about its disputed spacing.\n\nThe \"first word\" about Mrs. Eaves should be that it is a type family designed by Zusana Licko, etc.\n\nThe perfect place for Hrant's quote, IMO, was after the part about the typographer dispute. It is a great spice to that preceeding sentance. Obviously someone did not agree with me.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130919052855/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "14 May 2005 — 3:13pm",
      "content": "An aside: I think that the wording of the last sentence of the Mrs. Eaves entry is a bit confusing \"See also: Licko, Zuzanna (from which this description of the typeface was taken), Emigre\"\n\nThe first time I read that, I thought, \"oh, someone just copied the text from the Emigre website, or it is something that Zuzana said.\" Then I realized that the Emigre website wouldn't publish a text like that, and I realized that it was just referencing the the Licko wiki entry.\n\nSince we don't have a modification log displayed, and no one knows who really wrote which text in a wiki entry, I don't think that it is necessary to credit text taken from another entry. If someone wrote an \"article\" on typophile, I think it would be approriate to write \"this text is taken from Forrest's article on Mrs. Eaves.\" But the wiki doesn't work that way…\n\nDoes that make any sense? Its getting late over here…\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130919052855/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "14 May 2005 — 3:14pm",
      "content": "Dan, I think sticking strictly to the facts would be boring. If we're going to do that, we might as well just restrict ourselves to pointing browsers at the web page for the font on Emigre's web site or on MyFonts (or FontShop, or Linotype, or whatever). You're never more than a quick Google hop away from more information on something like that. The wiki is -- or I should say I think it should be -- a repository of Typophile's wisdom on these subjects, to help the members of our community orient themselves and look for further information on their own. I think it'll be a much more fun resource if we allow ourselves to include some of the value judgments that have come out of our conversations elsewhere in the wiki. Obviously errors of fact can't be allowed to stand, and we're restricted by the rules of commonsense netiquette and libel law, but we're trying to inform rather than sell.\n\nI think people should be able to write whatever the hell they want about themselves, whether it's straight-up self promotion, wacky (and fake) bios, or detailed information about their histories and their work. I also think that it's inevitable that people are going to go in and make tweaks to the bios for more eccentric / beloved / argumentative Typophiles' bios, and it really comes down to the members in question how they deal with that. Wikipedia has mechanisms to prevent situations in which people go back and forth editing each others' entries, and it may turn out we'll need some of that, but I think over time we'll get this stuff figured out on our own.\n\n"
    },
    {
      "time": "14 May 2005 — 3:21pm",
      "content": "That someone would be me, and it was also me pilfering from my own entry on Ms. Licko. I'll try to clarify the wording at the end there.\n\nI like Hrant's quote, which is why I left it when I originally expanded the entry to include my text from Zuzana's entry (prior to that, the entry on Mrs Eaves consisted of _only_ the quote). In its crusty way, it sums up one of the most notable opinions of the face stated on Typophile. It would be best if that linked back to the original discussion, so that people can see the context (and also see that's not the only opinion on the face on Typophile), but it presents a Typophilic point of view, which as I've said, is one of my favorite things about a Typophile wiki. If we're not going to have something different about our content, then why have it at all? Why not just have another boring link list, or go and add our content to Wikipedia?\n\nThat said, if you want to move it again, I think my main objection wasn't so much that it got pulled down from the beginning as that it didn't really fit jammed into a parenthesis at the end of a paragraph. I'm pretty anal about how I use language, and I felt like that marred the flow of the entry. But I did also like the way it framed the rest of the entry. Mrs Eaves is a quirky typeface. I think it deserves a quirky description.\n\n"
    },
    {
      "time": "14 May 2005 — 3:22pm",
      "content": "_…a repository of Typophile’s wisdom on these subjects…_\n\nThe comment on the Mrs. Eaves wiki entry isn't wisdom, its entertainment.\n\nI certainly don't have a problem with personal expression on the wiki. I just pulled out [Stephen Coles](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Stephen%20Coles)' entry because I thought it was pretty funny. That shouldn't go away. But no one is going to be misled about Stephen's character by that. I didn't even mind the entertaing Hrant quote in the Mrs. Eaves article. I didn't delete it, I just moved it. I don't see what is so bad about that. The wiki would still cool that way…\n\nBut we do need some sort etiquette. We have an entry of [German nationalism](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/German%20nationalism). This is touchy (I was surprised that you \"wikified\" it at all in your Koch entry). If someone were to edit that in a negative light, it would make the wiki look bad and less reliable. I think that it is just a matter of time, too, before someone edits someone's personal wiki entry with something slanderous in it (\"so and so is the Javert of type…\"). And nobody wants to see that happen.\n\nCertainly saying that Mrs. Eaves has a speech impediemnt isn't comparable, but I still think that we should respect the typeface enough to put that anywhere else in an entry instead of the biginning.\n\nI'm ranting too much about this, sorry…\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130919052855/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "14 May 2005 — 3:38pm",
      "content": "I don't think you're ranting, I think this is something important to get right, and to get right earlier rather than later. I think the wiki has a lot of potential to be both useful _and_ entertaining, and I'm trying to get in on the ground floor and make sure it works out that way. I read the entire <cite>Encyclopedia of Science Fiction</cite> from cover to cover not so much because I wanted to know everything in it but because it's as useful as a critical resource as it is an informative one. Reading the <cite>Encyclopedia of Science Fiction</cite> teaches you what the science fiction community thinks of itself, and without its occasionally opinionated judgments, it wouldn't do nearly as good a job of that.\n\nObviously we have to use discretion, and obviously we all have to keep an eye on the content. I created a cross-reference to German nationalism in my Koch entry because I think it's key both to forming an accurate understanding of pre-WWII German typefounding and to people who seek to conflate German type with Nazism. The Blackletter special interest group wouldn't exist on Typophile if this weren't a topic that had come up several times in the past (viz. all the discussions on Steven Heller and his frequent borderline implications that blackletter is somehow inherently Nazi). It's possible that neofascists could come in and hijack that entry and it would turn into some sort of gigantic fandango. At the same time, I feel like it's important to include Koch's nationalism as well as his Christianity, because it had a huge impact on how he thought about type. And to fully discuss the nationalism of people like Rudolf Koch and the other German type crafters of the era, it's important to place into context that German nationalism at that time and place could have more to do with Goethe than [Goering](http://web.archive.org/web/20130919052855/http:/en.wikipedia.org/wiki/Goering) (the Wikipedia entry is worth reading in light of this discussion). You know?\n\n"
    },
    {
      "time": "14 May 2005 — 3:44pm",
      "content": "_it’s important to place into context that German nationalism at that time and place could have more to do with Goethe than Goering. You know?_\n\nOf course. German nationalism belongs in any wiki entry about Koch. But I assumed that you would just \"write out\" German nationalism, instead you wikified it. That made me think. I was surprised, actually, that you didn't wikify \"Christianity\" as well. I didn't want to tinker too much with your tour de force Koch piece, so I did not wikify that. I just put Lutheran Protestant in parentheses behind it, since Koch was an arduant Lutheran. Very differnt personality at the time than a German Catholic might have had.\n\nChristianity (and I don't want to start a big discussion about religion in this thread, please, please, please!) is arguably just as important an elemnt in type design as nationalism. I can't imagine Koch's body of work, not to mention [Eric Gill](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Eric%20Gill)'s or [John Hudson](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/John%20Hudson)'s, without it.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130919052855/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "14 May 2005 — 3:50pm",
      "content": "For sure! Blackletter, in particular, is far more deeply entwined with Christianity than it ever was with Nazism, and there'd be no movable type without the Bible. I just didn't think to wiki that because German nationalism was more on my mind, and also because I forgot.\n\n"
    },
    {
      "time": "14 May 2005 — 4:59pm",
      "content": "<cite>\"Now, too bad there’s nothing under <a href=\"http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Comic%20Sans\" class=\"freelinking\" rel=\"nofollow\">Comic Sans</a> yet.\"</cite>\n\nYour wish is my command. Is that a reasonable entry? I personally could take or leave Comic Sans, but I tried to give it the same balanced, yet, opinionated, treatment I gave Mrs Eaves. Would the Mrs Eaves entry seemed objectionable if we hadn't just been talking about how much Typophile seems to have it in for Emigre?\n\n"
    },
    {
      "time": "14 May 2005 — 5:15pm",
      "content": "Revision history:  \nYes, the wiki has revision history built in - we are still ironing out the implementation of it. Rest assured it can be rolled back if someone is vandalizing an entry.\n\nCopyrighted text:  \nIt's not cool to paste copyrighted text form people's sites. Don't do it. If the company or organization said it better themselves consider linking to the text or excerpting small portions of it.\n\nForrest, the [Comic Sans](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Comic%20Sans) entry is better than the [Mrs Eaves](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Mrs%20Eaves) entry (I'm not implying you wrote the whole of either of these). Some bias is showing, but it successfully presents both sides of the story.\n\nI have to concur with Dan that the reference to Mrs. Eaves, the person belongs at the bottom as a reference to how the font got named, and not as it describes the font. It is certainly not the main point of the entry.\n\nIf that entry helps someone make an informed decision about using or not using Mrs Eaves then it's working. If the entry makes someone think, \"man, these Typophile kids sure hate Mrs Eaves\" then it's not succeeding at credibility or usefulness.\n\nIn other words, if someone have a beef with Mrs Eaves or with Emigre or any other topic, it doesn't belong in the wiki. What belongs there is intelligent facts and commentary that presents both sides of a topic.\n\nRegarding [Stephen Coles'](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Stephen%20Coles) entry: he originally wrote that to be funny, while we were in testing. I went back and added the bit about \"Stephen Coles describes himself as...\" so that the entry was not in the first person.\n\n"
    },
    {
      "time": "14 May 2005 — 5:43pm",
      "content": "Typowiki boundaries:  \nSome things are better left for other wikis. If there are entries on Typophile for [German nationalism](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/German%20nationalism) or [Christianity](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Christianity) for examples they should center around the typography related aspects of these topics. It is not in the scope of the typowiki to encompass every conceivable topic.\n\nI'm not saying these entries shouldn't exist here - not at all. Type history is as much a product of its circumstances as anything else. I'm just suggesting that we know where to prune and know when it's better to link to Wikipedia's entry.\n\n"
    },
    {
      "time": "14 May 2005 — 5:52pm",
      "content": "More important to me than the value of the quote is its provenance; Hrant acknowledges the quote as one of his, but I can't find an original source for it, so it's gotta go.\n\nGenerally speaking, there seems to be some confusion about what the wiki is for. Is it a purely informational resource? Is it a usage guide? Is it a sales tool? My guess is that it's all of these things at once, in which case there are going to be lots of different styles to the entries in the wiki, which is fine.\n\nDoes the current entry (edited to remove the Hrant quote) say, <cite>“man, these Typophile kids sure hate Mrs Eaves”</cite>? I don't think it does. In fact, as the author of what remains there, I know I didn't write it out of malice or disrespect. I have no beef with Emigre or Zuzana, and have nothing but respect and admiration for what I believe is the Bay Area's most successful and cutting edge type foundry. If I had to choose a side, I'd be on the side of the graphic designers I know who make excellent, and restrained, use of Mrs Eaves on a frequent basis.\n\nThe entry does, however, have a mildly mocking tone, which is really more an insular thing, intended for Typophiles more than the general public. I find it simultaneously charming and annoying that typophiles are so elitist and extreme in their evaluations; in that regard my entries on [Comic Sans](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Comic%20Sans) and [Mrs Eaves](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Mrs%20Eaves) are two sides of the same coin. You know, most people really can't see the difference between Helvetica and Arial, but one is grudgingly accepted and the other is vilified. What's coming through here is that if people find my writing critical of Ms. Licko's work, I was being too subtle or just a poor writer.\n\nI'm going to stand by my assertion that pure information is not what the wiki ought to be about. We can argue about what it _is_ about, but a lot of the joy I get from Typophile derives from its squirelly and insular take on typography, and really all I'm trying to do when I write the way I do is reflect some of that culture in distilled form. If there's value to maintaining the Typophile wiki as something independent from Wikipedia (which I'm sure would welcome our input), that's what I think it is.\n\n"
    },
    {
      "time": "14 May 2005 — 8:52pm",
      "content": "Forrest, sorry. I could've been more clear. I wasn't saying that the Mrs Eaves entry goes anywhere near that extreme. I was just pointing out the extreme to illustrate the nuanced difference - all with the aim of starting this discussion. (And it's a healthy one.)\n\n"
    },
    {
      "time": "15 May 2005 — 5:43am",
      "content": "Forrest, what do you think of this? I just wrote an entry for [Rudolf Koch](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Rudolf%20Koch)'s book [Das Schrieben als Kunstfertigkeit](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Das%20Schrieben%20als%20Kunstfertigkeit). After introducing the book (and admitting that the only visual example I had available was the third edition), I described the thing.\n\nThen, under the word **Critique** , I listed three beefs, one I had, one I think that [Hans Peter Willberg](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Hans%20Peter%20Willberg) had, and another from [Hermann Zapf](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Hermann%20Zapf). I don't have a source for the Zapf point, but I think that it is legit enough that it can stay unlinked.\n\nLastly, I recommend that people buy the book. If the book were really bad (and the critique points had been really awfull), I think that it would have been okay to recommend that people NOT buy the book.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130919052855/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "15 May 2005 — 10:21am",
      "content": "okay i'll confess... i started the [Mrs Eaves](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Mrs_Eaves) article with the silly quote by [Hrant](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Hrant_Papazian), but I did it only to get the ball rolling. It doesn't bother me that the quote was omitted altogether, but the resulting article _is_ a tad bland. I'm not saying that [TypoWiki](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/TypoWiki) entries have to be entertaining, but I think that some information on the various opinions about Mrs Eaves would make a more interesting and enlightening article, a synopsis of the arguments for and against the merits if you will. That said, I think that opinions need to be clear as such. By just entering the line \"Mrs Eaves is a beautiful woman...\" I was guilty of not giving the facts. I realize that if I'm going to make the effort of making a wiki entry I need to put some serious thought into it and not be lazy and expect others to come along and clean up my messes. I guess that would be my comment on wiki ettiquite.\n\n"
    },
    {
      "time": "15 May 2005 — 2:05pm",
      "content": "Yeah, well, Paul, so far my original version of the [Mrs Eaves](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Mrs%20Eaves) entry still lives on in the entry for [Zuzana Licko](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Zuzana%20Licko), which I personally would like to maintain in its present state, unless somebody wants to expand it. I think you and I agree, for what it's worth.\n\nI've learned how to write this stuff from the sources I mentioned before and the Economist, all of which are publications who trust and respect their readers' ability to sort opinion from fact, and as a consequence mix the two freely in their content. Dan, I like your entry, but I see no need to so clearly delineate the factual and critique bits in the stuff I write. Am I being obtuse in thinking it would be easier and more entertaining to just sort of embed opinions right along with the facts?\n\n"
    },
    {
      "time": "15 May 2005 — 7:13pm",
      "content": "I use [wikipedia](http://web.archive.org/web/20130919052855/http:/www.wikipedia.org/) fairly often, mainly because I’ve found it generally to be reliable, not because it's clever -- I don’t consult it for entertainment or to get a dose of attitude. Maybe the typowiki can be different but I would be inclined to go with something that is known to work. Opinion is actually quite helpful -- when it is attributed.\n\n"
    },
    {
      "time": "15 May 2005 — 7:54pm",
      "content": "We do have the option of turning on comments for every wiki entry, but we figured that would only create more noise. However it would be the ideal place to discuss the editting of a particular entry. What do you think?\n\n"
    },
    {
      "time": "15 May 2005 — 8:31pm",
      "content": "maybe link to commentary on articles, but not necesarily have the article and commentary on the same page?\n\n"
    },
    {
      "time": "16 May 2005 — 5:16am",
      "content": "I would like to point out that although the [Christianity](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Christianity) entry refers and links to [Eric Gill](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Eric%20Gill), the Gill entry makes no mention of it, I suppose this kind of anomaly is something that will be corrected over time but if an author goes so far as to link one subject to another then he/she should make the reverse link. I pick this out as an example, not as a criticism of someone who has taken the trouble to make the entry and I suppose I could edit it to make a contribution, however I wouldn't feel entirely comfortable editing someone else's work and I'm not confident in my linking abilities\\*. Although I would point out that in Eric Gill's case it was (Anglo-) Catholicism and communism (with a small c) that appealed to and informed him.  \nTim  \n\\*witness my failure to get one of those green entries with a superscript w\n\n"
    },
    {
      "time": "16 May 2005 — 8:54am",
      "content": "Tim,\n\nThere is good reason to link to wiki entries that do not yet exist. It ensures that when an [Eric Gill](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Eric%20Gill) entry does exist that the [Christianity](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Christianity) entry will link to it, without someone having to go back to all the old threads and link up Eric Gill.\n\nThere's been some discussion about creating a different wiki superscript to denote empty wiki entries. I'm not sure of the feasibility of this, but I suspect Christian or Jared know.\n\n"
    },
    {
      "time": "16 May 2005 — 9:04am",
      "content": "I'm going to post from my gut first, to get it off of my chest, and then come back later after I've had a chance to articulate my thoughts on this topic of debate.\n\nFirst, I don't think the wiki should be used to voice our opinions about any given topic. For a wiki to be useful, from an academic point of view, it needs to stay clear of opinion and focus on what is known and true. However, I think Dan's idea of separating the wheat from the chaff is good. If someone must post opinion it needs this is a good way to do it.\n\nSecond, the wiki could become a very useful tool for students most of whom are still very malleable and perhaps too receptive to the opinion of others. The forums are a good place for them to read what others think, but I think the wiki should be a place where they can go to find information. Perhaps even using it in their own essays. The wiki will not be able to be used academically if it is full of opinion. Well, ok, that isn't entirely true. But, by posting opinion you are muddying the academic water.\n\nStudents read these forums and some of them just assume what we say is true and stop looking. Now we all know that this isn't right and perhaps they need to think a little more. But, I've seen it happen in other forms. Just think before you type, consider appropriateness and consider Dan's method.\n\nIn regards to the [Mrs. Eaves](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Mrs.%20Eaves) wiki entry. The more useful think to do, if you do think your thoughts are true: \"Both type families are beloved by graphic designers and regarded with mild suspicion by typographers.\" Please explain why. Start a thread, link to a thread. Students will follow the links. They will want to know why so when they go to class the next day and someone is using Mrs. Eaves in what might be perceived as erroneous they will be able to contribute to the critique in a more articulate fashion.\n\n"
    },
    {
      "time": "16 May 2005 — 9:34am",
      "content": "\"I’m an avid reader of reference books like encyclopedias or grammars. From the best of those I’ve learned that the best writing in such resources is concise, complete, and unafraid to pass judgment\"\n\nForrest is actually right on. Despite their pedantic qualities, reference works are literature, and literature contains opinions. If anyone were to read my Zapotec dictionary straight through, you'd have no doubt that I lean strongly toward anarchy as a political belief.\n\nNow, if you want to do this Wiki right, we should all be leaving an author code after writing an entry, as well as after editing or commenting on an entry. A history is then established, and a particular author must take responsibility for his/her opinion. It's really the only way to do a reference work where multiple individuals are producing the material. It's just professional.\n\nA.\n\n"
    },
    {
      "time": "16 May 2005 — 10:17am",
      "content": "Joe,  \nThe Eric Gill wiki entry does exist, it just doesn't mention his Catholicism, my point was more along the lines that if you write in one subject (Christianity) about a subject and link to that subject (Gill) you should be prepared to add or elaborate your link. As I said I don't mean this as a criticism of whoever wrote the original entries more as an general example for authors to consider.  \nTim\n\n"
    },
    {
      "time": "16 May 2005 — 3:38pm",
      "content": "I am torn about this. On the one hand, there's no point having a Wiki which is just a free-for-all, with people endlessly scrubbing and rewriting each other's views, so I write \"Wilbur Poodlesmith was a genius who designed some of the most beautiful but under-rated typefaces of the mid-19th century\" and you come in and change it to \"Wilbur Poodlesmith was an alcoholic monster who designed some of the most misbegotten letters ever to see the light of day\", and I scrub out yours and you scrub out mine ... and so on.\n\nOn the other hand, if all we have is \"Wilbur Poodlesmith, typeface designer, mid 19th-Century\" it's going to get pretty dull. Without some opinions expressed it's going to get pretty dull.\n\nCan I suggest the following. (1) People should try to include more than _just_ opinions, and should try to make it clear what is fact and what is opinion. So \"Wilbur Poodlesmith, 19th century type designer. Some of his type is pretty awful.\" is just about OK, but \"Wilbur Poodlesmith. Guy whose type sucks.\" is not. (2) Where you know opinions differ, it would be best to make that clear. (3) If you come across an opinion that you disagree with, try not just to change it but to modify it so that it becomes balanced. So if someone has written \"Wilbur Poodlesmith, horrible romantic type\" but you happen to think it's great, try \"Wilbur Poodlesmith. His reputation is controversial: opponents dislike his \"horrible romantic type\", but others see greatness in the romanticisim.\" (4) In extreme cases, remove the opinion topic to a thread on the forum and link to that, so that readers can see the \"raw debate\". (5) Where there is a known \"majority opinion\", people who are in the minority should be especially careful not to present their own known-to-be-minority views as simply true. Conversely, where there is a known minority view, majoritarians should not suppress that.\n\nIn other words, we should try to be objective enough to strive to produce not facts-without-opinion or facts-with-our-opinion, but facts-with-balanced-opinion. It will take time to shake down, but I should have thought it is possible.\n\n"
    },
    {
      "time": "16 May 2005 — 3:50pm",
      "content": "any links to the types of Poodlesmith? ;^D\n\n"
    },
    {
      "time": "17 May 2005 — 2:56am",
      "content": "I have to say, Tiffany, that I disagree. Dan hasn't even talked me around to his comparatively more moderate way of seeing things. I think a curious student is going to learn very quickly that much of typographical \"history\" and \"practical advice\" is a sea of subjective claptrap masquerading as fact (see the Design Observer's [discussion of BS](http://web.archive.org/web/20130919052855/http:/www.designobserver.com/archives/002559.html)). I think we all go through a phase where we show off to our friends and families our mastery of some body of knowledge by parroting some \"facts\" we got out of our reading, rather than articulating beliefs we've arrived at after research and deliberation. In fact, some (many? most?) designers never get beyond that point.\n\nI am, always have been, and always will be a student. Learning is what I do. I _never_ assume that anything anybody tells me is the straight truth. I believe everyone writes even the driest of factual writing from their own point of view, and never rest any important judgment on a single source, even if it's one I generally trust. That's just good scholarship to me. Much of American pedagogical and journalistic discourse is based on the idea of \"objective\" and \"balanced\" truth, which means in practice that everyone hides their ax-grinding behind a façade of dry, disinterested \"facts\".\n\nMeanwhile, I get my news from the Economist, which is opinionated to the point of pugnaciousness (and represents a worldview _very_ different from my own). It's very clear where their editors and writers are coming from. The New York Times may have a public ombudsman and struggle to maintain balance, but the Economist does a much better job of informing me, because they lay their prejudices out where I can see them, and therefore allow me to set my error bars accordingly.\n\nStripped of all the fancy rhetoric, here's what I'm saying: I don't think we have any obligation to pitch the Typowiki to the lowest common denominator. It's our collective vision of the typographic world. 9 times out of 10, that means that what we're going to have is going to be no more subversive or radical than any other reference someone has on their shelves. But that 10th time, somebody might end up provoked, amused, or even educated in a way they wouldn't have otherwise. We have an obligation to be fair, but being fair doesn't always mean being balanced, and balance isn't always useful.\n\nLet me put it another way: which would you rather read, the <cite><a href=\"http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Elements%20of%20Typographic%20Style\" class=\"freelinking\" rel=\"nofollow\">Elements of Typographic Style</a></cite> or a bland, generic typography textbook?\n\nI do think that in a collaborative environment such as the Typowiki attributions are probably necessary. The Economist doesn't attribute their articles, but they also have an editorial board that's ultimately responsible for the content of the magazine, a luxury we don't have (or even want, right?).\n\n"
    },
    {
      "time": "17 May 2005 — 10:26am",
      "content": "I don't disagree and have hope that most students will realize that what is being stated is most likely more opinion and less fact. However, does that mean we can't try to _not_ be claptrap? We shouldn't strive to give people a _real_ resource? I suppose my situation is different from yours. I'll admit that I'm more interested in a resource that gives me the opportunity to form my own opinion. But, I don't think of the wiki as being something comparable to Bringhurst's book. For the reason that Bringhurst's book is his opinion and nobody else's. It is easy for the reader to realize that as he reads it is all one man's opinion. The wiki is going to be filled with more than one person's opinion and therefore more likely to confuse the reader/researcher/student.\n\nI suppose I don't entirely disagree with you. But, Bringhurst isn't my only source for information about typography as I probably would also read the dry generic typography textbook as comparison.\n\nThis has nothing to do with showing off. I'm simply of the opinion that the wiki should be clear of as much \"claptrap\" as possible. For instance, going back to Mrs. Eaves. I think a discussion thread is the more appropriate place to talk about how some people find it completely useless as a text face thus allowing others to respond with how they have used it and how they used it. Perhaps teaching listeners how to set up their H&Js to accomodate it as a text face. If we allow opinion not backed up by fact in the wiki it will become nothing more than another form of discussion area.\n\n"
    },
    {
      "time": "17 May 2005 — 10:35am",
      "content": "Forrest, it is obvious that we both consider ourselves students. My thoughts became jumbled as I tried to see where we were disagreeing exactly.\n\nI do think if we allow too much opinion into the wiki it will become necessary to have editors whom have the ultimate say and can disallow future editing to the wiki-node.\n\nI do think if someone has something to say which is debatable, i.e. statements about the quality of a typeface, it should be taken to the forums and not stated in the wiki.\n\n"
    },
    {
      "time": "17 May 2005 — 10:40am",
      "content": "going back to [Mrs Eaves](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Mrs%20Eaves), what do you think of the article as it stands now? (or whenever you read it)\n\n"
    },
    {
      "time": "17 May 2005 — 12:18pm",
      "content": "I think that is fair and good, Paul. Nice work.\n\nPerhaps we should have a point at which we do no longer allow edits without approval. Ok ok. I'm being too much of a mom. Sorry!\n\n"
    },
    {
      "time": "17 May 2005 — 12:45pm",
      "content": "Then it wouldn't be a wiki anymore.\n\nBesides, there will always be relevant new info to add to the entry (prominent uses, maybe logos, books, articles, a new redesign with better spacing…)\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130919052855/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "17 May 2005 — 1:12pm",
      "content": "Dan, that is true. Very true. But, I still think that too much opinion means it should be a discussion and not a wiki-node. The editing done by Paul on [Mrs Eaves](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Mrs%20Eaves) works for me. There is opinion, but it is backed up by links to threads and others locations where you can learn more. So, I suppose I'm mostly opposed to inappropriate use and opinion in the wiki.\n\n"
    },
    {
      "time": "17 May 2005 — 1:39pm",
      "content": "I think we're all getting closer to consensus, but I'd like to make a couple more points.\n\nThe first, and more important, is that I don't want Typowiki turning into a haven for ranting any more than anyone else. Its use to all of us goes down as the amount of iconoclastic opinion stated as fact goes up. I should have stated this more clearly earlier, but a good portion of the reason why I've been defending the ability to editorialize in wiki entries -- aside for it simply making for a more refreshing, entertaining read -- is that when people are denied the ability to editorialize, there is a tendency to masquerade opinion as fact.\n\nIf I make a statement like, <cite>\"These two fonts are beloved by graphic designers but regarded with mild suspicion by typographers\"</cite>, it's obvious that somebody's making a generalization, and anyone past a freshman English class should know that generalizations never hold true for all cases. In other words, it's obviously a statement of opinion. If I say, <cite>\"It is recommended that you not use Mrs Eaves in text settings because some typographers argue that it has inappropriately wide spacing for that use,\"</cite>, that has more of an air of objectivity to it, but\n\n1. it uses the passive voice, which is never a good sign and\n2. it's even more a subjective piece of writing than my first statement\n\nWhat we're really discussing here is how much subjectivity is appropriate, I think. We're all in agreement (I think) that stating our unsupported personal opinions is bad, and that at least an attempt should be made to represent the spectrum of opinion on controversial topics (unless some of you prefer avoiding controversy altogether, which does not appeal to me -- there's a lot to be learned from seeing what topics in a field are controversial). Whether we do this by pointing to forum threads or by directly embedding the opinions in the entries themselves, we should always use our own discretion and judgment and keep in mind that the wiki isn't a place to air our opinions so much as it is to provide a useful and entertaining (and both pieces are important, I think) for a broad typographic community.\n\nThe [Elements of Typographic Style](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/Elements%20of%20Typographic%20Style) is a useful and entertaining resource, and is, along with some of the other books I've mentioned in this thread, my guide in choosing an auctorial voice in the wiki. Do you seriously think there's any decent typographer, student or professional, who treats the Elements as inviolable law? That's an honest question -- compared to many of you here, I'm a rank newbie, but even I see that Bringhurst has his quirks and don't treat his word as law. And even plain textbooks contain much that is subjective, but they present everything so dully they bore you into accepting it much less critically. I don't know; fundamentally I treat even reference literature as a discourse, and it's useful to me to see the breadth of the discussion as well as being offered the facts.\n\n"
    },
    {
      "time": "17 May 2005 — 1:43pm",
      "content": "Also, wikis tend to evolve towards some sort of factual homeostasis over time, as people correct and change each others' work. It's possible for moderation wars to erupt, as die-hards squabble over the wording of some controversial topic, but in my experience this happens less often than I feared, and the real risk is that a wiki is left untended, so people's sneaky attempts to subvert the content are allowed to go unchallenged because nobody else who cares ever sees them. I'd be more worried about that in the case of the Typowiki than, say, two of our more opinionated members getting in an argument over the wiki entry on readability. We are, for the most part, grownups here.\n\n"
    },
    {
      "time": "17 May 2005 — 1:59pm",
      "content": "_Do you seriously think there’s any decent typographer, student or professional, who treats the Elements as inviolable law?_\n\nOh yes, they do exist.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130919052855/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "17 May 2005 — 2:42pm",
      "content": "Jeez, that's scary.\n\n"
    },
    {
      "time": "17 May 2005 — 4:45pm",
      "content": "Ok. I agree with you Forrest.\n\nYes, scary but true people treat Bringhurst's book as a sort of typographic scripture. His is a voice of reason, but I'm of the opinion that while his book is a good one to include in one's library, it isn't the only sound one out there.\n\n- I agree that the wiki shouldn't be left unattended.  \n- I also agree that if someone has a beef/problem/concern with a wiki-node that this be brought up in a thread and not spiral into an out-of-control editing war.\n\nPhew.\n\n"
    },
    {
      "time": "17 May 2005 — 9:46pm",
      "content": "Wait a second. Concensus in 42 posts? Where's Berkson Hudson Papazian & Shinn\\* to swoop in with some reasoned and biting input? =)\n\nFor what it's worth Forrest, I think you've put your finger on what I like about _The Economist_.\n\nThanks everybody for the input. Is it too much to ask someone to sum this up into a concise bullet list to add the the [FAQ](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/FAQ)? Paul? Forrest?\n\n\\* Berkson Hudson Papazian & Shinn. How'd you like to be put on notice from _that_ law firm? =)\n\n"
    },
    {
      "time": "18 May 2005 — 11:35am",
      "content": "I just put a stub for [FAQ\\_Wiki](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/FAQ_Wiki) under the [FAQs](http://web.archive.org/web/20130919052855/http:/typophile.com/wiki/FAQs) section (with an 's'). I'll get to it after work, that is if Forrest doen't beat me to it.\n\n"
    },
    {
      "time": "18 May 2005 — 1:15pm",
      "content": "I'll let Paul have the first whack at it, and then I'll beat it beyond recognition, and we can have this whole discussion all over again! Yay!\n\nOr maybe not. But I might tweak it a little.\n\n"
    },
    {
      "time": "18 May 2005 — 4:05pm",
      "content": "ok, forrest, it's all yours.\n\n"
    },
    {
      "time": "18 May 2005 — 10:38pm",
      "content": "Nicely done Paul. Thanks.\n\n"
    },
    {
      "time": "19 May 2005 — 5:05pm",
      "content": "Paul, I left your writing mostly unmolested and added a brief dialog of my own to the end, just to address a few further points. You did an excellent job of summarizing the discussion thread, and only area in which I disagreed with what you wrote was your use of the word \"objective\", but I think my concerns are adequately addressed in this thread, so the link to it more than does the job. Thanks!\n\n"
    },
    {
      "time": "12 Apr 2006 — 12:54pm",
      "content": "There is an excellent article on Linn Boyd Benton, Morris Fuller Benton, and type making at ATF that I think would make a good reference addition to the Wiki listings for these three. What is the etiquette of providing such a change?\n\n"
    },
    {
      "time": "12 Apr 2006 — 2:22pm",
      "content": "_What is the etiquette of providing such a change?_\n\nany registered typophile user can make changed to the typowiki. if you think you can improve upon something that's been written, by all means do it!\n\n"
    }
  ]
}
