{
  "id": "124308",
  "title": "Proxima nova light, Capital letters look too heavy, is this a printing problem or the font?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I have just had a small bit of text printed in Proxima Nova (light), and I have noticed that the weight of some letters look bolder than others (noticeably the numbers, capital letters and v, w and y).\n\nI cant figure out if this is a font problem or a printing problem.  \nIt seems strange to be a printing problem, as it is consistently the capitals that look off  \nBut also strange that the font always looks fine on screen.\n\nI do understand that its meant to be a web font but I still wouldn't expect these results when printing.  \nShould I just not be using this font for print?\n\nThanks for any help in advance, I'm very new to this kind of thing.\n\n ![](http://web.archive.org/web/20150405123013im_/http:/typophile.com/files/Screen%20Shot%202015-04-02%20at%2001_4884.26.49.png)\n\n",
  "author": "scarlettoliva90",
  "time": "1 Apr 2015 — 5:30pm",
  "uid": "227516",
  "comments": [
    {
      "time": "1 Apr 2015 — 7:38pm",
      "content": "\"Should I just not be using this font for print? \"\n\nThat is correct. You need to use the desktop font for print.\n\n"
    },
    {
      "time": "2 Apr 2015 — 5:30am",
      "content": "Thanks for your help,\n\nI have tried to do a little research and i'm not entirely sure what version I need to be looking for for the desktop font. the version I have is the .otf file if this helps.\n\nThanks for your help, sorry for being a complete noob.\n\n"
    },
    {
      "time": "2 Apr 2015 — 7:01pm",
      "content": "Send Mark Simonson an email and ask him; he used to post here a lot but I don't think I've seen him around these parts lately.\n\n"
    },
    {
      "time": "3 Apr 2015 — 9:35am",
      "content": "Which app and printer are you using? I assume that was just a desktop printer? Laser? I have seen problems like this which were simply caused by the printer driver. The stroke width in those capital letters and figures IS larger than in the lowercase letters. So something in your print process might emphasize this.  \nPlaying with the driver/quality settings could resolve this and it will probably not appear when another printer is used or it printed in offset.\n\n"
    }
  ]
}
