{
  "id": "124514",
  "title": "What do you think about this type combinations?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nI'm choosing the typefaces for a Web project (a library catalog), with the additional constraint that they have to be open source. So far, I've selected a typeface for the text: Clear Sans, from Intel. I think it is a pretty legible, neutral typeface and has a beautiful texture. I've considered other options like Open Sans, Roboto, Droid Sans and Ubuntu, but settled for Clear Sans. My problem is with the typeface for the headings. I've narrowed down my choices to two fonts: Amaranth and PT Sans, but I'm not quite sure which one to use. Amaranth is kind of an upright italic and I think it combines beautifully with Clear Sans, but I'm not quite sure it evokes the right mood. PT Serif is an old style serif that also combines quite well with Clear Sans, but the contrast between them is not as high as I would like. I've attached two samples of the combinations (the text is in Spanish). I'd like to hear your opinion and anything you have to say will be more than welcome. Thanks in advance!\n\n| Attachment | Size |\n| --- | --- |\n| [clear sans and amaranth.png](http://web.archive.org/web/20150417002306/http:/typophile.com/files/clear%20sans%20and%20amaranth.png) | 86.48 KB |\n| [clear sans and pt serif.png](http://web.archive.org/web/20150417002306/http:/typophile.com/files/clear%20sans%20and%20pt%20serif.png) | 79.98 KB |\n\n",
  "author": "alber2410",
  "time": "11 Apr 2015 — 3:13pm",
  "uid": "222392",
  "comments": [
    {
      "time": "11 Apr 2015 — 4:21pm",
      "content": "I like the [Amaranth](http://web.archive.org/web/20150417002306/http:/www.fontsquirrel.com/fonts/amaranth) version better, it's more playful and relaxed. For a library catalog though, they might look for something more authoritative and stark in which case [PT Serif](http://web.archive.org/web/20150417002306/http:/www.fontsquirrel.com/fonts/pt-serif) seems a better fit.\n\n"
    },
    {
      "time": "11 Apr 2015 — 4:32pm",
      "content": "My choice would certainly be Amaranth, for the very reason that you mention - contrast (I think that Amaranth sample is very fine by the way and I don't have a problem with it re: mood)\n\n"
    },
    {
      "time": "13 Apr 2015 — 9:36am",
      "content": "OK, thanks very much. I'll start with the Amaranth combination then and let's see what they think about it ;-)\n\n"
    }
  ]
}
