{
  "id": "12477",
  "title": "Typesetting Japanese Characters - Help!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "So, tomorrow I'm going to be typesetting the Japanese version of an English document I designed. I've never done this before, and don't have any Japanese character typefaces other than the ones that come with OS X. I'll be using InDesign CS. I really have no idea what to expect.\n\nCan anyone give me any tips/advice/warnings/recommendations before I dive in head first? Anything is appreciated.\n\nOh, just as an FYI: the English was set in [Whitman](http://web.archive.org/web/20130328072350/http:/kentlew.com/Type.html).\n\n",
  "author": "Chris Rugen",
  "time": "16 May 2005 — 1:55pm",
  "uid": "2172",
  "comments": [
    {
      "time": "16 May 2005 — 5:05pm",
      "content": "Hi,\n\nMay I presume that you know how to turn on the Kotoeri input method in the international control panel in System Preferences? Also I guess that you are not going to mix English and Japanese next to each other in a text. If not, it can be trickier than the simple tips that are suggested below:\n\n1. Fonts  \nOS X comes with Hiragino fonts that you can set with. Osaka is the Japanese system font for menus.\n\n2. Styles  \nIf you select Hiragino, it will provide you with three different styles with different weights. Mincho can be regarded as a Japanese counterpart of a serifed style, Gothic, a sans-serif, Maru, a sort of rounded sans-serif. Select a style that you want to set with Whitman. But consider that you may want to change the style of your choice after you actually set the text with different character sets of Japanese.\n\n3. Size, Weight  \nWhen you compare the size of Whitman and the latin alphabet in Hiragino fonts, Hiragino is about 15% bigger than Whitman. Adjust the size to find the Hiragana and Katagana still appear about 10% bigger than the latin alphabet, which is normal for CJK fonts. There are several reasons for this, such as inter-stroke space considerations and the basic letter design space of CJK and so on, but this might help you to find the right font size to go well with Whitman. You may consider reducing Hiragino again about 3% if the Japanese text will not contain any Romanji, but please remember that whenever you reduce the size, the overall grayness--thickness of strokes--can get lightened so you should keep that in mind.\n\n4. Kanji  \nIf you are to use Kanji as well, choose one Kanji character--better to pick a relatively complex looking one--which can feel like about as much bigger as the ratio between Kana and the latin alphabet depending on the glyph that you have chosen. This is tricky, as Kanji characters can have only one stroke to tens of them. I would keep the size the same as Kana, but, if your choice is Mincho, you may realize the strokes of Kanji are quite different from those of Hiragana and Katagana and the high contrast between thick and thin may ruin the compatibility of Whitman and Mincho style. But it is up to your decision and the text that you are going to set.\n\nI only hope that this helps you a bit.  \nI am looking forward to hearing some more advice on this subject.\n\nSeonil\n\n"
    },
    {
      "time": "17 May 2005 — 2:35am",
      "content": "Also keep in mind that InDesign has many features for setting text in Japanese, but they're poorly documented and are there mostly to support the Japanese version of InDesign, which is a much different (and more expensive) beast than its Western counterpart. Try to keep your first layout simple, and don't try to get everything right (i.e. setting the text vertically and right to left) unless you're asked to do so.\n\nIf you want to match Whitman, your best choices are probably Heisei Mincho or Hiragino Mincho. The Heisei family is bundled with Adobe CS. I think it might be a slightly better fit than Hiragino, which is more of a Times equivalent for Japanese.\n\nGood luck!\n\n"
    },
    {
      "time": "17 May 2005 — 8:46am",
      "content": "Thank you very, very much, Forrest and Seonil. I've just gotten the copy about 10 minutes ago and am stumbling around quite a bit. I'm going to read over your tips in depth and integrate what I can.\n\nI'll let you know how it works out. Unfortunately, I can't show any layouts, as the information is proprietary, but I'll convey as much as I can.\n\n"
    },
    {
      "time": "18 May 2005 — 8:10am",
      "content": "So, I ended up using Hiragino Mincho (which the client liked), since I don't seem to have Heisei (is it part of an extras package?) It seemed to go well because one of my Japanese coworkers helped me make sure the type was the right size and she wrote: are you sure you don't speak Japanese? So I guess that's a sign that it's at least legible and readable.\n\nThanks again for the help and advice. I'm sure my typesetting is still pretty rough, but it works. For the next time (next month) I'm going to apply your suggestions more carefully. There are a few English numbers and one or two email addresses sprinkled in the Japanse text, so that will complicate matters a bit.\n\nThe most interesting part (aside from the obvious character differences) was the difference in acceptable point sizes. The smaller numbers were a bit disorienting. The other interesting part is the extra-smooth, rags that come from setting a series of individual glyphs, rather than grouped ones. Much of the text appeared fully justified. Is this acceptable? Should I be fully justifying? Or is allowing the slight variation in the rag OK? I suppose the left-to-right and horizontal layout makes many Japanese typographic conventions harder to achieve, either way.\n\nBy the way, what is 'Romanji'?\n\n"
    },
    {
      "time": "18 May 2005 — 9:19am",
      "content": "Hi,\n\nRomanji is the use of Roman characters to phonetically spell out Japanese (along the same lines as Pinyin for Chinese.) Some refer to any use of Roman characters in Japanese text as ‘Romanji’ even if it is not expressly used to spell out Japanese.\n\n"
    },
    {
      "time": "18 May 2005 — 12:00pm",
      "content": "Glad to know it helped.\n\nConcerning H&Js, there are some special text formatting functions that you may have to consider in addition to the usual H&J values. There is a rule called Prohibited Character Processing which strictly limits the use of certain characters in beginning or ending lines. To keep this rule, word processing applications automatically adjust lines according to the types of hyphenation options a user chooses.\n\nAnother thing that might interest you is that CJK are designed monospaced. It is actually typesetting systems that space Kana or Hangul (Korean script) proportionally. The soft ragged look is partially because of this and the above hyphenation algorithm. If you want to justify the spacing between every letter, you have to consider the fact that Japanese require no space between words. So it may affect the readability. The full justification is usually used in a table listing names and so on.\n\nAlso, as you set both English and Japanese horizontally, you have to be careful in setting the baseline grid for Japanese. CJK use different letter alignment systems and if you try both languages on the same baseline, they won't read comfortably. Depending on the font size that you choose for Hiragino, you might have to fiddle with a different grid system for the Japanese text to have them appear on the optically same baseline.\n\nYes, Romanji is just the Japanese equivalent to Roman or Latin characters (Romaja in Korean). Just as Hanji (Chinese), Kanji (Japanese), Hanja (Korean), Hantu (Vietnamese) refer all to Chinese characters or Han characters.\n\nIf you are further interested in CJK processing systems, there is an excellent reference site of Ken Lunde at [http://www.praxagora.com/lunde/](http://web.archive.org/web/20130328072350/http:/www.praxagora.com/lunde/ \"http://www.praxagora.com/lunde/\").\n\n"
    }
  ]
}
