{
  "id": "12480",
  "title": "Bembo",
  "forum": "Home",
  "tags": [
    "Typeface",
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20150302015313/http:/typophile.com/wiki/Indices) : [Typefaces](http://web.archive.org/web/20150302015313/http:/typophile.com/wiki/Typefaces) : Bembo**\n\n![](http://web.archive.org/web/20150302015313im_/http:/upload.wikimedia.org/wikipedia/commons/3/36/WmBembo.png)\n\nBembo was a [Monotype](http://web.archive.org/web/20150302015313/http:/typophile.com/wiki/Monotype) \"recutting\" (in effect a revival and reworking) of type used by Aldus Manutius. It is named because it was based on a type used by Aldus in Pietro Bembo's dialogue _De Aetna_ (1495).\n\nIt was the second attempt while [Stanley Morison](http://web.archive.org/web/20150302015313/http:/typophile.com/wiki/Stanley%20Morison) was adviser to the (English) Monotype Corporation at a revival of Aldus's type. The first, some six years earlier, had produced Poliphilus (roman) and Blado (italic). Those types had been, in effect, attempts at facsimile, preserving artifacts such as ink spread from the printed samples. Bembo and its italic (of which more below) were an attempt to revive the essential form of the letter without the antiquarian fuzz. Their excellence probably owe as much to the skill of the [Monotype](http://web.archive.org/web/20150302015313/http:/typophile.com/wiki/Monotype) drawing office as to Morison's aesthetic and historical abilities.\n\nIn letterpress, there were two Bembo italics. One was designed by the calligrapher Alfred Fairbank in 1928: a very upright chancery cursive. There is some debate whether (as Stanley Morison maintained in <cite>A Tally of Types</cite>) Fairbank had been asked to design an italic to marry with Bembo, and failed, or whether (as Fairbank maintained) he had been asked to design an independent italic, which Morison had then attempted unsuccessfully to marry with Bembo. Either way, Fairbank's italic did not sit happily with [Bembo](http://web.archive.org/web/20150302015313/http:/www.jinnlife.com/) roman. A different, less intrinsically interesting, italic was developed but with the merit of being relatively self-effacing. Morison's own judgment was that while Fairbank's italic \"has too much personality, the second has too little.\" But it works well enough as a companion face.\n\nBembo was a frequently used book typeface from the 1930s so long as books were printed letterpress, and many found (and find) it one of the most satisfactory types for extended texts: elegant without being prissy, with a moderate x-height, neither too condensed nor too expanded. It did not survive adaptation to photocomposition very well, though; nor, in due course, digitization (the digital version apparently being carried out from the photocomposition version). The photo and digital versions lost some of Bembo's elegance (for instance, the x-height was increased, and cap-height and ascender height equalised), probably because they were adapted from a version intended for small text (8 pt). At the same time the digital version was rather thin, and tended to produce dull grey pages. It nevertheless continued to see rather frequent use. And foundries other than Monotype managed to produce versions or new typefaces inspired by Bembo which were rather more satisfactory, including Matthew Carter's typeface for [Yale](http://web.archive.org/web/20150302015313/http:/www.yale.edu/printer/typeface/history.html) and Jack Yan's [Aetna](http://web.archive.org/web/20150302015313/http:/www.myfonts.com/fonts/jya/aetna-jy/) (on which see the useful comparison on [Daidala](http://web.archive.org/web/20150302015313/http:/www.daidala.com/05jul2002.html)) and David J. Perry's [Cardo](http://web.archive.org/web/20150302015313/http:/scholarsfonts.net/cardofnt.html) (designed as acontribution to the [Medieval Unicode Font Initiative](http://web.archive.org/web/20150302015313/http:/helmer.aksis.uib.no/mufi/)). The design of Andreas Stötzner’s [Andron](http://web.archive.org/web/20150302015313/http:/www.signographie.de/cms/front_content.php?idart=282&changelang=2) owes something to Bembo, too, though it was not inteded as a Bembo recut.\n\nIn 2005, Agfa Monotype released a new digital version, Bembo Book. This restores much of the elegance of metal Bembo; it is darker and more lively; it has a reduced x-height and its capitals are lower than the ascenders. It comes in an [Opentype](http://web.archive.org/web/20150302015313/http:/typophile.com/wiki/Opentype) format which enables easy use of such things as ff, ffi and ffl [Ligature](http://web.archive.org/web/20150302015313/http:/typophile.com/wiki/Ligature)s (which Bembo really needs), alternate forms such as long-tailed Q and short-tailed R, proper small capitals and oldstyle figures.\n\n",
  "author": "hey",
  "time": "16 May 2005 — 2:41pm",
  "uid": "14425",
  "comments": [

  ]
}
