{
  "id": "12503",
  "title": "Financial Services Text Face?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hi,\n\ni’m doing a couple of spreads in a magazine as an extra promotional section for selected financial services providers in the LA area…i’m looking for some opinions on what a good text face might be?\n\ni’m leaning more towards sans serif but serif is not out of the question…\n\nright now, there’s some ITC Franklin Gothic small giving address/phone number etc, but that is flexible depending on the textface chosen….opinions would be greatly appreciated\n\nthanks\n\nw|m\n\n",
  "author": "Will Miller",
  "time": "Tue, 2005-05-17 08:36",
  "uid": "4552",
  "comments": [
    {
      "time": " Tue, 2005-05-17 08:53",
      "content": "If you’re setting tables of financial data and blocks of text, a face with lining and oldstyle numerals is probably a good bet. That’s more common in serif faces, but is becoming more common in contemporary sans.\n\nWithout knowing more, that’s as specific as I can get.\n\n"
    },
    {
      "time": " Tue, 2005-05-17 10:09",
      "content": "a little more….\n\nit’s not going to use tables or speak on financial data, for the most part, it’s mostly a piece (6 to 12 pages) that’s highlighting certain “wealth management firms”\n\ni guess it’s a little bit about the people, the office, their specialties, some of their past clients…\n\ni’m just having a hard time zeroing in on a text face that conveys assurance, confidence and longevity in dealing with this subject\n\nw|m\n\n"
    },
    {
      "time": " Tue, 2005-05-17 10:15",
      "content": "I would think [Giacomo](http://web.archive.org/web/20050825013538/http:/terminaldesign.com/retail_specimen.php?ID=1176&viewFam=1), a sweet sans by Terminal Design, might be ideal. It has tabular lining figures as well as proportional oldstyle figures, and looks great in a magazine.\n\nEdit: I just missed your second post. In that light, here are two more that might fit the bill: [Apex Sans](http://web.archive.org/web/20050825013538/http:/thirstype.com/fonts.php?font=ApexSans) from Thirstype, and [Section](http://web.archive.org/web/20050825013538/http:/lux.thirstype.com/fonts.php?font=Section) from Lux Typographics. To me, each conveys strength but with a modern flair.\n\n"
    },
    {
      "time": " Tue, 2005-05-17 10:35",
      "content": "Hard to go wrong with [Mercury.](http://web.archive.org/web/20050825013538/http:/www.typography.com/catalog/mercurytext/index.html)\n\n"
    },
    {
      "time": " Tue, 2005-05-17 10:46",
      "content": "yeah, these are great! unfortunately we lack the licenses for all of those but it’s a great starting point. giacomo fits the bill nicely i think\n\nw|m\n\n"
    },
    {
      "time": " Tue, 2005-05-17 12:18",
      "content": "Considering the audience, I would think a serif font would be more appropriate. They are easier to read, and it’s what the audience is used to. The Wall Street Journal’s text font is a variation of Scotch, so Scotch Roman may work…  \n [http://www.myfonts.com/fonts/linotype/scotch/](http://web.archive.org/web/20050825013538/http:/www.myfonts.com/fonts/linotype/scotch/)\n\nModern extended is also nice (imho).  \n [http://www.myfonts.com/fonts/urw/modern-extended/](http://web.archive.org/web/20050825013538/http:/www.myfonts.com/fonts/urw/modern-extended/)\n\nThere’s my 2¢,\n\nCheers!\n\n"
    }
  ]
}
