{
  "id": "12507",
  "title": "Sony PS3 goes \"Spiderfont\"",
  "forum": "Design",
  "tags": [

  ],
  "content": "Interesting font choice for the upcoming PS3.\n\n[http://www.gaminghorizon.com/games/screenshots/465/465-0-1116292760.jpg](http://web.archive.org/web/20050901021526/http:/www.gaminghorizon.com/games/screenshots/465/465-0-1116292760.jpg)\n\nI’m sure the bloggers will soon notice that the new logo and the Spider-Man movie font are based on T26 Mata, the same font apparently used as the basis of the original Xbox logo.\n\nSi\n\n",
  "author": "sii",
  "time": "Tue, 2005-05-17 10:35",
  "uid": "1049",
  "comments": [
    {
      "time": " Tue, 2005-05-17 10:48",
      "content": "Makes you wonder if the majority of console gamers will notice. My suspicion is that the market’s attention span is counted in seconds, and that many will be too glazed over to see the connection. But nice catch, sii.\n\n"
    },
    {
      "time": " Thu, 2005-05-19 00:03",
      "content": "i saw the connection to the spiderman font, but i dont know much about identifying typefaces so i couldn’t relate it to T26 mata. Although it is a new, as such ‘futuristic’ font, i do not think that it relates with the console that well.\n\n"
    },
    {
      "time": " Wed, 2005-06-22 08:38",
      "content": "I cringed at the first sight of this. Not fitting whatsoever, especially in light of the Spiderman AND XBOX relations.\n\nDuring my stint at T26, we “retired” roughly half of the library from active promotion due to low sales and poor quality. Mata nearly got the ax, but the Spiderman phenomenon kept it selling. Microsoft was considering OEM licensing Mata for Windows… not sure what happened with that.\n\nMata was one of the first T26 fonts. It’s amusing to see such a dated design make such a (IMO) premature comeback on so many high profile fronts. A true life testament to publishing your designs… setting them loose upon the world for reckless and uninspired art directors to pitch for huge accounts. Too bad Greg Samata is only seeing chump change for the usage.\n\n"
    },
    {
      "time": " Thu, 2005-06-23 07:13",
      "content": "\\>Microsoft was considering OEM licensing Mata for Windows… not sure what happened with that.\n\nFirst I’ve heard about that and I’ve been invovled in MS fonts for ten years. Who did you talk to at MS? Perhaps this was for non-Windows usage? There was some interest in Luggage at one point and of course we only have limited rights to Flexure.\n\n\\>Too bad Greg Samata is only seeing chump change for the usage.\n\nWhat are you guys doing to promote the link? Have you made an Italic version to match the Sony derivative, or a version to match the Xbox logo (where the curves are rotated 90 degrees)? Seems like a bit of a missed opportunity?\n\nCheers, Si\n\n"
    },
    {
      "time": " Mon, 2005-07-11 15:58",
      "content": "<cite>First I’ve heard about that and I’ve been invovled in MS fonts for ten years. Who did you talk to at MS? Perhaps this was for non-Windows usage? There was some interest in Luggage at one point and of course we only have limited rights to Flexure.</cite>\n\nThis was a few years ago. Very preliminary inquiries, but I think it was for Windows. Perhaps Office.\n\n<cite>What are you guys doing to promote the link? Have you made an Italic version to match the Sony derivative, or a version to match the Xbox logo (where the curves are rotated 90 degrees)? Seems like a bit of a missed opportunity?</cite>\n\nLife is full of missed opportunities.\n\n"
    },
    {
      "time": " Mon, 2005-07-11 16:02",
      "content": "i. Maybe, might have been in the Flexure licensing time-period which was licensed for Publisher, part of Office.\n\nii. True\n\nThanks for following up.\n\nSi\n\n"
    }
  ]
}
