{
  "id": "12518",
  "title": "Custom Script Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is my first attempt at a custom script. It's for a place called Gallery Bistro. Any and all comments would be welcome on the script. The sans 'bistro' is fpo and will be changed.\n\nThanks!\n\nChad Brewer\n\n| Attachment | Size |\n| --- | --- |\n| [gallerybistro\\_1.jpg](http://web.archive.org/web/20131023005457/http:/typophile.com/files/gallerybistro_1.jpg) | 72.12 KB |\n\n",
  "author": "chadbrewer",
  "time": "17 May 2005 — 5:16pm",
  "uid": "7357",
  "comments": [
    {
      "time": "17 May 2005 — 5:19pm",
      "content": "I'd work on the modulation of the stroke widths a little. Right now it's a little \"gloopy\" and looks like it was autotraced from a scan. The loop on the y seems a little anemic, too. I do like the articulation in the e and the r, although you might want to consider making them a continuous, and cursive, script. That notch in the upper right of the e is pretty hot, although not very scripty.\n\nOverall, not bad!\n\n"
    },
    {
      "time": "17 May 2005 — 6:57pm",
      "content": "Thanks for the comments Forrest - I've been working on it a bit, and it's looking better. Once I figure out how to attach a file to a reply (there doesn't seem to be an option to) I'll post an update.\n\n¡Cheers!\n\n"
    },
    {
      "time": "18 May 2005 — 6:22am",
      "content": "Chad get a Calligraphy pen and draw your letter forms again. By doing so you will see where the inconsistancies on where the thins and thicks of the letter forms, then you can adjust. I'm not suggesting not using what you have, but using the Calligraphy pen as a guide to letter form corrections.\n\n"
    },
    {
      "time": "18 May 2005 — 6:58am",
      "content": "I actually started with pen & ink for this. I scanned the letters and then created outlines in illustrator - then I started playing with the outlines, and I probably tried to smooth everything out a bit too much. I'll take a look back at the orginals - thanks for the tip!\n\nCheers!\n\n"
    },
    {
      "time": "28 May 2005 — 11:51pm",
      "content": "Can we see the original scan?\n\n"
    }
  ]
}
