{
  "id": "1253",
  "title": "26",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'd like to solicit a few opinions about our name, Apollo 26. I thought it was rather inocuous...to me, apollo = exploration, 26 = alphabet... but a fellow type designer who works with T26 today said in an email that Apollo 26 was kinda uncool, in his opinion. I wrote to CS at T26 and he expressed his thoughts in a very direct pleasant manner.   \n   \n   \nSo...Anyone have any thoughts about the number 26?   \n   \nwould apollo 26 create confusion in the marketplace among type buyers?   \n   \nthen there's the Apollo Program, elliott earls.   \n   \nArggh! Anyone have any lucid thoughts?   \n   \n   \nbj\n\n",
  "author": "beejay",
  "time": "28 Jun 2002 — 4:42pm",
  "uid": "1014",
  "comments": [
    {
      "time": "28 Jun 2002 — 8:11pm",
      "content": "BJ, you've hit the nail on the head - both of those names have \"industry saturation\" in that they both have associations with other foundries.   \n   \nTo that end, going with that name will decrease your \"uniqueness\" to the marketplace, especially if you're trying to build your own unique brand.   \n   \nFocus on what it is you want to accomplish with your foundry, print out one line showings of all the fonts you've created for commercial sale and look at what you've got.   \n   \nIn short order, it should become obvious what it is you're really going as a foundry. From there, it's a matter of finding a name that compliments that vision and brings it to another level.   \n   \nAlso, make the name memorable and easy to remember because one day a few years from today, when somebody mentions your foundry by its contacted name, everybody who reads about it will know exactly what foundry is being referred to.   \n   \n(eg: House, Emigre, Font Diner, you get the pocture)   \n   \nWhereas if somebody posts, check out the new Apollo fonts, or the new 26 fonts, chances are they won't know it was referring to you. . .   \n   \nJust my thoughts . . .   \n   \nStuart :D\n\n"
    },
    {
      "time": "29 Jun 2002 — 9:16pm",
      "content": "BJ: I concur totally with what Stuart said, and I think you should wipe the slate clean and rename.   \nIn naming a font - which I think is a discussion we had here already - it is preferable if the name is evocative. But naming a font/design company I think all bets are off. You don't have to be literal and you might get away with anything. Look at Yahoo!, eBay, Frog, etc. etc. Printing out the one line examples could help, but the stuff between the lines - the business plan inside your head might be the clarifying factor in gelling/choosing a name.\n\n"
    },
    {
      "time": "29 Jun 2002 — 10:53pm",
      "content": "Stuart and Mart. Thanks for the input. For the sake of discussion, do you suggest renaming because...   \n   \na) Apollo 26 is not unique   \n   \nb) because T26 has the 'corner' on the number 26   \n   \nc) some sort of legal reasons.   \n   \nd) something else   \n   \n   \nbj\n\n"
    },
    {
      "time": "30 Jun 2002 — 2:31pm",
      "content": "A, B, and C.   \nPersonally, I prefer \"macho\" names - for want of a better description - and I think, from what I know of your work that you need something punchy rather than something esoteric. (Ironically, Apollo is about as macho as you could get.)\n\n"
    },
    {
      "time": "30 Jun 2002 — 3:50pm",
      "content": "A & B - don't know about C . . .   \n   \nTo further illustrate the pont of industry saturation, it'd be like calling yourself 'Test Pilot Bureau' . . .   \n   \n- They are two names already belonging to two distinct foundries being blended into one like a Reese Peanutbutter Cup and yet having no unique flavor of its own. . .   \n   \nIt's not that I don't appreciate the name 'Apollo 26' it's a fine name, it unforunatly lends itself to other rather well known companies within this industry and could easily force comparisons if not animosity from one of the owners who may see it as 'borrowing' their identity.   \n   \nIf there are names out there that you would be just as happy with, pick one you really like and could enjoy for years and years. The more unique the name, the more pride you will have in knowing it's like nothing else in the industry.   \n   \nStuart :D\n\n"
    },
    {
      "time": "30 Jun 2002 — 9:25pm",
      "content": "Also avoid names like Heidelberger Monotype, HouseFaces, BlackYellow, The Bureau of Fonts, T22, P26, The Garage Diner...   \n   \nTake the friendly advice he gave you. It don't get any friendlier. :-)\n\n"
    },
    {
      "time": "1 Jul 2002 — 12:08pm",
      "content": "Ha! There's an idea that really blows.   \n   \nbj   \n   \n   \n ![:)](http://web.archive.org/web/20131106044851im_/http:/www.typophile.com/forums/clipart/happy.gif) ![:)](http://web.archive.org/web/20131106044851im_/http:/www.typophile.com/forums/clipart/happy.gif) ![:)](http://web.archive.org/web/20131106044851im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "1 Jul 2002 — 12:27pm",
      "content": "Of all the Greek gods, I'd have to say Apollo would be my last choice as a representative for the creative process in general and the typographic arts in particular (even though he's oft depicted as the God of Arts). Sure, he's more than qualified to act as poster god for the Art of Hinting, along with his sister Artemis, but this is only one aspect of the process. (In a similar vein, the 26 letters are only a small sampling of the typographic realm.)   \n   \nImo, as far as greek gods are concerned, some kind of partnership between Hephaistos, Dionysus and Hermes would be a good team. From a practical matter, as far as the general public is concerned anyway, you may as well name your foundry Three Stooges, Inc. If you had to pick just one, the Roman analogue to Dionysus, \\*Bacchus\\*, might make for a cool logohead... Just a thought.   \n   \n- Sean\n\n"
    },
    {
      "time": "1 Jul 2002 — 1:29pm",
      "content": "Thanks again Stuart and Mart, Sean John and Andy?. I know this is kind of a silly discussion, blah, blah, pixels for words. But instead of regretting a hasty post, I'll try to embrace it. So...   \nWe have our first retail release coming later this month, DEFCON, a preview of which will be available late Wednesday. Certainly, I'd like to do the \\*right\\* thing, but...I have a partner who has an opinion, CS has an opinion, probably EE has an opinion, and what is \\*right\\*? And how does \\*that\\* differ from what is pragmatic?   \n   \nLooking back at my computer files, the first record of Apollo 26 is from last November. So it's almost been Nine Months. Hmmm. In nine months, my partner and I have taken on the identity of the name and our work reflects it. We \\*are\\* the name and the name \\*is\\* us. To us it means exploration, creative freedom, no mo status quo. It's difficult to quantify or qualify, but to us, it's \\*deep\\* and \\*real\\*. Also, last November, EE was pretty much dormant in the industry. So when the name popped into my head, it wasn't a synthesis of EE or CS or any of that.   \n   \nInitially, Apollo 26 was going to be an online magazine to fan my burning passions for type and letterforms, with 26 handy issues, one every two weeks, a mix of design and journalism. I had the themes plotted out, the interview lists ready...hey Stuart, you were going to be featured in the RETRO-themed issue. The '26' worked three different ways -- the alphabet, the bi-weekly issues, and Apollo 13X2.   \n   \nThe Apollo 13 mission has personal significance to me, besides being a great moment in \\*thinking\\*, it coincided with an important event in my life without which I wouldn't be here: birth.   \n   \nOn general principle, to me, the number 26 is fair game but A26 is too close. '26' as a number to describe the alphabet (Alphabet 26) or type or fonts is not 'wholly original' to T26, not like Test Pilot Collective is wholly original. And Sean gave us a concise history of Apollo. I can see how people 'in' the industry would get flustered by the name, irritated, or just plain roll their eyes. True, as a 'practical business matter', the name should be changed but sometimes principle is stronger than practical.   \n   \nThanks for the input,   \n   \nGet ready for a sneak peek at DEFCON, the first retail release from...   \n   \n   \nbj\n\n"
    },
    {
      "time": "1 Jul 2002 — 2:04pm",
      "content": "How 'bout just \"ApolloType\"? Such a name would preserve your emotional/historical relationship to the word \\*Apollo\\*, but avoid industry confusion by dropping the \"26.\"   \n   \nYou could then name your magazine \"Apollo 26,\" which would dovetail nicely with your corporate name, the alphabet theme and publication frequency.   \n   \n- Sean\n\n"
    },
    {
      "time": "1 Jul 2002 — 3:15pm",
      "content": "At the risk of opening a can of worms, I have to admit that I always found T26 and P22 just a teensy bit samey in the name department, but they seem to co-exist just fine and dandy. They seem far closer in my opinion than T26 and Apollo26.   \n   \nFar more of a worry is Apollo26 vs the Apollo Program - did you try and get in touch with the other Mr Earls for his opinion?   \n   \nAll that said, I am sort of with Stuart on this one; if there are similarities with other brands out there, you risk (without wanting to sound like some prat in a suit at Wolff Olins) diluting your brand. That does no-one any favours.\n\n"
    },
    {
      "time": "1 Jul 2002 — 4:40pm",
      "content": "I haven't tried to email the other Mr. Earls, but it might be moot. I looked on his site for an email and couldn't find one. If you have an email for him, i'd appreciate it.   \n   \nSean, thanks for the Apollo idea. The online magazine idea, well, that passed. If anyone is interested in expanding the concept and devoting attention to it, I'd be more than happy to share the themes, just email me.   \n   \nbj   \n   \nand is there anyone who knows if that was \\*the\\* Andy Cruz?\n\n"
    },
    {
      "time": "1 Jul 2002 — 9:50am",
      "content": "Apollo 26?!?!   \n   \nHow about \"BJs FONTs\"? Then you can market your free fonts as \"FREE BJs\".   \n   \nAndy   \nHouse Industries\n\n"
    },
    {
      "time": "2 Jul 2002 — 4:09pm",
      "content": "...why don't you just call your site myfontssuck.com and leave it at that.\n\n"
    }
  ]
}
