{
  "id": "12571",
  "title": "Logo for myself!",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "hi there,\n\ni'm in the process of designing a logo for my one-man company, and i would like to hear some words from you.\n\nthanks,  \nea\n\n| Attachment | Size |\n| --- | --- |\n| [ealogo.gif](http://web.archive.org/web/20131020063501/http:/typophile.com/files/ealogo.gif) | 3.05 KB |\n\n",
  "author": "ea",
  "time": "19 May 2005 — 12:36pm",
  "uid": "7378",
  "comments": [
    {
      "time": "19 May 2005 — 2:04pm",
      "content": "Emre,  \nyou have to tell us a litle more about what you actually do. (Pyromaniac? :) So far it looks pretty bland to me. I don't think there is enough contrast between your name and the symbol. Also it feels like a two-men company (I think the space between your firts and last name is too big). But again, I don't know what message you want to send.\n\nP.S. I just saw a dog's ear and a Q-tip in it, sorry, can't stop seeing it now. I just got a dog, that's probably why. I wouldn't worry about that:)\n\nJan\n\n"
    },
    {
      "time": "19 May 2005 — 2:19pm",
      "content": "i do visualfx(compositing) work for commercials and feature films, i mainly use the somehow-industry-standard software packages called flint-flame-inferno, hence the symbol inbetween my name. it also remotely calls for \"new idea\" :)\n\nea\n\n"
    },
    {
      "time": "20 May 2005 — 5:14am",
      "content": "My problem with making a mark that reflects software is what if that software becomes an antique or the company that makes it get bought. I would suggest finding another image for a mark or just use your name and a line explaining what you do like: visualfx compositing.\n\nThe type is well spaced but boring, visit some of the Indie type companies and see some more contempory, leading edge font ideas.\n\n"
    },
    {
      "time": "20 May 2005 — 10:55am",
      "content": "The very first thing I thought of was The Rolling Stones' _Flashpoint_ album cover. Not sure how you feel about this association, that is probably going to be very strong with some people.\n\nHere are the [Google Image Search results](http://web.archive.org/web/20131020063501/http:/images.google.com/images?q=rolling%20stones%20flashpoint&hl=en&lr=&c2coff=1&safe=off&client=safari&rls=en&sa=N&tab=wi). See what I mean?\n\nThat said, I don't think it's a bad logo, but it's treading familiar ground in a very common manner. The personality is missing. Make it your own. Make it unique.\n\n"
    },
    {
      "time": "20 May 2005 — 10:56am",
      "content": "And no, I'm not over 40.\n\n"
    },
    {
      "time": "20 May 2005 — 2:10pm",
      "content": "You need equal space between your first name and surname(to much space before Aypar) I would also think about adding another outline around the flame and experiment with the image in the middle of the flame..it doesn't look fluid enough..a little choppy as far as the illustration goes. The kerning looks very good and the font will work well with a more unique icon in the middle.\n\n"
    }
  ]
}
