{
  "id": "12570",
  "title": "Type Identification Book? Pages of As, Bs, (cross posted)",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "This post is cross-posted on General Discussion.\n\nI have a vague memory of a book that was available on line (and may still be) whose purpose was to help in identificaton of fonts. Each page was set up with a grid of maybe 30 squares and in each square was a letter in 60 point or thereabouts. Underneath the letter was the typeface name. Apparently this book had pages and pages of cap As, then cap Bs, and so on.\n\nI’m not referring to **Rookledge’s International Typefinder**. I have that book and find it useful. The book I’m vaguely recalling did not have one-line specimens for each typeface, it simply had various incarnations of each letter of the alphabet grouped together.\n\nI never actually saw the book and have no idea if it would be helpful. However, one of our art directors is looking for info on the book and I seem to have misplaced the url or any information about it.\n\nSo can anyone help an old lady with her senior moment? What the heck was that book? Did anyone actually purchase it and/or find it useful?\n\nThanks!\n\n",
  "author": "kristin",
  "time": "Thu, 2005-05-19 09:56",
  "uid": "1553",
  "comments": [
    {
      "time": " Thu, 2005-05-19 12:19",
      "content": "[www.namethisfont.com](http://web.archive.org/web/20050526123545/http:/www.namethisfont.com/)\n\nEven just the specimines of this book are helpful.\n\n"
    },
    {
      "time": " Thu, 2005-05-19 12:24",
      "content": "That’s the one, Sarah. Thanks for the link!\n\nSee also other books suggested in the general discussion forum.\n\n"
    },
    {
      "time": " Sat, 2005-05-21 08:00",
      "content": "I’m sorry if I am about to repeat something from the other forum’s comments\\*, but I had a look at those books, and the varieties are so limited that the book’s value is also very limited. I think the number of fonts shown was something like 300, or at least a relatively small number, which is not even 1% of available fonts. It’s a nice concept, but too token a sampling to be very useful (in my opinion) for anyone but font newbies.\n\n\\*(I am on my sister’s very slow dialup computer that can’t handle Flash graphics, so I can only check a page at a time.)\n\n- Mike Yanega\n\n"
    }
  ]
}
