{
  "id": "12582",
  "title": "Logotypes and Letterforms",
  "forum": "Home",
  "tags": [

  ],
  "content": "**[Indices](http://web.archive.org/web/20130516070046/http:/typophile.com/wiki/Indices) : [Books](http://web.archive.org/web/20130516070046/http:/typophile.com/wiki/Books) : Logotypes & Letterforms**\n\nBy [Doyald Young](http://web.archive.org/web/20130516070046/http:/typophile.com/wiki/Doyald%20Young), published by his own [Delphi Press](http://web.archive.org/web/20130516070046/http:/typophile.com/wiki/Delphi%20Press). This large, expensive, thick book is less a manual or a reference as a catalog of Young's own design work that happens to be very informative and educational. Young has been based in Los Angeles for his entire career, and has spent much of that time closely associated with the [Art Center College of Design](http://web.archive.org/web/20130516070046/http:/typophile.com/wiki/Art%20Center%20College%20of%20Design) there. He studied under [Hermann Zapf](http://web.archive.org/web/20130516070046/http:/typophile.com/wiki/Hermann%20Zapf), whose work has clearly influenced him profoundly, and due to his location has done much work designing [logotypes](http://web.archive.org/web/20130516070046/http:/typophile.com/wiki/logotypes) and bespoke alphabets for clients in the entertainment, cosmetics, and hotel fields.\n\nMuch of the book is a display and discussion of this work; in some cases he displays the set of design comps for a logotype, as well as a discussion of the thinking that went into them. He also -- somewhat unusually -- takes the next step of discussing which typefaces go well with many of the logotypes, demonstrating how corporate and brand identities can be designed outward from one piece of work.\n\nYoung loves scripts and cartouches, so there are many fine examples of elaborate scripts in the book. He also loves [Optima](http://web.archive.org/web/20130516070046/http:/typophile.com/wiki/Optima), which pops up in many, many guises and references, along with [Morris Fuller Benton](http://web.archive.org/web/20130516070046/http:/typophile.com/wiki/Morris%20Fuller%20Benton)'s [Franklin Gothic](http://web.archive.org/web/20130516070046/http:/typophile.com/wiki/Franklin%20Gothic). Since these typefaces are respectively half a century and a century old, Young can't fairly be accused of being subject to the whims of fashion (even though, much of the time, he's working for the fashion industry), but at the same time, it is often easy to guess the age of many of his designs. It seems contradictory that his designs can be both conservative and dated, and it is intriguing to attempt to figure out why this is.\n\nThe last part of the book is a set of specimens of some (most?) of Young's own typefaces, and is in some ways the most interesting part of the book. Young has, like his mentor Zapf, been unafraid to stick himself right into the middle of technological developments. He's designed an uncial-style unicase script for teletype machines and a typeface for transcribing American Sign Language, as well as creating a simplified sans for use in daisy-wheel impact printers. He has also indulged his love for scripts with his one commercially available typeface, Young Baroque, a beautiful baroque script.\n\n",
  "author": "Forrest L Norvell",
  "time": "20 May 2005 — 12:13am",
  "uid": "5605",
  "comments": [

  ]
}
