{
  "id": "12580",
  "title": "Preserving emotions and inspiration (taking pictures that last)",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "We all take pictures, not just of type events but of things that inspire us and moments we want to preserve. Thanks to companies like Nikon we won’t be able to use the digital images we take now, a few years or decades from now.\n\nHere’s a link to an organization that tries to fight this moronic behavior of obfuscating image formats. [OpenRaw.org](http://web.archive.org/web/20081013182628/http:/www.openraw.org/ \"Open Raw\")\n\nWhat can you do to help? I would say stop buying cameras from companies that lock-up their formats.\n\n [‹ Lanston Garamont](http://web.archive.org/web/20081013182628/http:/typophile.com/node/12656 \"Go to previous forum topic\") [The RE/MAX Logo ›](http://web.archive.org/web/20081013182628/http:/typophile.com/node/12723 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013182628/http://typophile.com/user/2444\" title=\"View user profile.\">Frank Jonen</a>",
  "time": "<br>",
  "uid": "2444",
  "comments": [
    {
      "time": " 20.May.2005 6.16am",
      "content": "I believe there is presently a massive drop in the sale of digital cameras.  \nCellphones/mobiles are taking over.\n\nI’ve been using a Ricoh for 3 or 4 years, it’s cool, but I am considering getting a classic Rollei twin lens reflex as my next camera. My grandad used to have one, and I was recently at the Lee Miller exhibit at the National Portrait Gallery, and it’s what she used. All I need now is a good 2 1/4’ film scanner.\n\nThe way I figure it, a 35 mm frame is the equivalent of 15 megapixels, and a Nikon film scanner will get all that, plus the film grain. So it’s still OK to use film.\n\n"
    },
    {
      "time": " 20.May.2005 6.55am",
      "content": "a good 2 1/4” film scanner will set you back atleast £2000-4000. The only one you can get that’s cheap and usable is one like the Canoscan D2400UF that is a flatbed scanner that supports film up to 4x5”\n\nI’ve been using an Epson something or other with a film attachment that works ok but has a tendancy of cropping 35mm and 6x7cm negatives and doesn’t seem to recognize some slides at the end of a strip or dense negatives. It likes underexposed ones better.\n\nI’ve compared 35mm prints to prints from a 4.1mega pixel [Nikon D2-H](http://web.archive.org/web/20081013182628/http:/www.dpreview.com/reviews/nikond2h/) and the prints from the digital are BETTER than the 35mm ones.\n\nI’ve scanned some 6x7cm negatives and that works well.\n\nI’ve also shot some 6x7cm negatives from a [Mamiya RZ67 pro II](http://web.archive.org/web/20081013182628/http:/www.mamiya.com/cameras.asp?id=1&id2=1&id3=8) and scanned them to various resolutions with success.\n\nRight now most professional photographers are shooting 50-100% digitally. Some are still shooting film since thier magazine requires it. But, even fashion photographers are using Leaf or other digital backs on medium format cameras. These are in the £17,000 (17megapx)-20,000 (22megapx) range.\n\nThe new Canon and Nikon pro cameras are in the 12.5 - 15 mega pixel range. But 4-5 mega pixel is good enough for most magazines.\n\nI’ve recently submitted a portrait photo for [Hannah Sandling](http://web.archive.org/web/20081013182628/http:/www.sueridermanagement.co.uk/presenters/Hannah/hannah.htm) to a magazine and they requested the image be under 2 mega bytes!!!\n\nI shoot in RAW format (NEF) and so don’t most fashion pros. They usually have a photographer and a techy editor that cleans the images.\n\nRAW formats let you adjust the exposure, white balance and lots more than you can do with compressed jpgs.\n\n"
    },
    {
      "time": " 20.May.2005 7.00am",
      "content": "Also many of the ink jet paper companies like Kodak are saying some of thier papers will last 100 years.\n\nNo one has ever said a colour print will ever last. Only B&W prints were archivally processed (converting the silver to something more stable). Colour will always fade.\n\nSo the current technology with [giclée prints](http://web.archive.org/web/20081013182628/http:/www.naturalworldphotos.com/giclee.htm) and pigment based prints without the use of photo chemicals that could contaminate the paper these prints will be more stable than silver, dye or chemical based prints.\n\nI also am finding that 400 ASA or higher black and white negatives (Ilford or Kodak films) scan a bit grainier than they would print directly from a negative to print. [(see this review of an Epson scanner)](http://web.archive.org/web/20081013182628/http:/www.virtualtraveller.org/epson2450.htm) This can be corrected in Photoshop.\n\n"
    },
    {
      "time": " 20.May.2005 8.24am",
      "content": "I think the point that Frank was trying to make has nothing do with the format you choose to use—I don’t think he has anything against analog photography—but that we should push the developers of the technology to become more user friendly. Besides, it seems we’ve already had the [analog photography](http://web.archive.org/web/20081013182628/http:/typophile.com/wiki/analog%252Bphotography) v [digital photography](http://web.archive.org/web/20081013182628/http:/typophile.com/wiki/digital%252Bphotography) conversation [before](http://web.archive.org/).\n\n"
    },
    {
      "time": " 20.May.2005 8.41am",
      "content": "Well yes the NEF is Nikon RAW specific. But I-photo 5.0 and Photoshop CS support NEF as RAW... so they support the basic RAW format with the added proprietery information.\n\nmost non-pro photos are taken in .jpg formats. I can get about 900 jpgs on a 2gig card, and about 360 RAW photos on a 2 gig card.\n\nSo what is the problem with archiving .jpgs or even RAW? They both are well supported.\n\nMy first digital camera was a Kodak DC10 which saved in it’s own KDC format. So I wonder if that is obsolite?\n\n"
    },
    {
      "time": " 20.May.2005 9.33am",
      "content": "\\> a 35 mm frame is the equivalent of 15 megapixels\n\nHow did you figure that? To me it seems that ~5Mpix is almost always good enough. The other day I made an 8x10 print from a 3.3Mpix image, and the aliasing was quite mild.\n\nBTW, what Ricoh do you have - the RDC-7? That’s what I have (got it used for $160), and I LOVE it. The macro feature is staggering - translating to over 2000dpi. BTW, during the conference in Beirut I met somebody else with an RDC-7, and we almost started a fan club right there.\n\n\\> it’s still OK to use film.\n\nWell, I have a lot of emotional attachment to my Canon SLR (have had it since ’92), but to me the big advantage of digital is convenience: taking too many pictures, cleaning up as needed, and not having to stare through a hole\\*. My only real complaint about (affordable) digital cameras is the latency from pressing the button to actually taking the photo; sometimes though I hit the button slightly before I need to, and quickly frame the image afterwards.\n\n\\* Recently in Paris I took some “spy video” (low-grade though) of a metro car making a stop, and it’s so authentic it’s scary - there was even an accordion player, nervously checking for les gendarmes...\n\nhhp\n\n"
    },
    {
      "time": " 20.May.2005 10.29am",
      "content": "\\>My only real complaint about (affordable) digital cameras is the latency from pressing the button to actually taking the photo;\n\nWell the pro digital cameras don’t have the delay. My Nikon D2H shoots at 8 frames per second. It was made for News and Sports photography and came with a wireless transmitter that can connect to a wireless network.\n\nSo the Canon and Nikon high end ones act just like film cameras and you get the same shutter like feedback. My older Nikon FM-2 with a Nikon motordrive (MD-12) was surprising loud when I used it to shoot a Typocircle third tuesday event at a pub. But the mechanical sound of the drive is cool and retro like and old film.\n\nMy Canon G3 has the delay but the Nikon D70 is under £1000 and might not have a delay and can handle real lenses.\n\n"
    },
    {
      "time": " 20.May.2005 2.22pm",
      "content": "[photos 3, 4, 8, 9 and 11-18 all shot on B&W film](http://web.archive.org/web/20081013182628/http:/www.connare.com/lifestyles/lifestyles_content.html) in the lifestyle section on my site scanned on an Epson 1640SU with a Nikon FM-2. Kodak or Ilford film 400-3200 ASA.\n\n"
    },
    {
      "time": " 20.May.2005 3.40pm",
      "content": "I love my digital but I am thinking of (mostly) ignoring it and going back to medium format SLRs. I used to use my leica & nikon 35mm film cameras quite a bit but they’re gone now. Anyone have an older Bronica SLR they want to sell?\n\n"
    },
    {
      "time": " 21.May.2005 3.53am",
      "content": "\\> a 35 mm frame is the equivalent of 15 megapixels\n\nI read it in a magazine, but it seems about right.  \nThere is some subjectivity involved, but in my experience, if you scan a 35mm trannie high-res, when you get up to 50mb, you start to get film grain, rather than picture detail.  \nA 3.1 megapixel image (2048x1536) is a 9mb file (RGB), so if you multiply by five, you get a 15 megapixel file, with a 45mb file size.\n\nYes, my camera is an RDC-7, which I bought new when it came out for around $1k.  \nYeah, the macro feature is very neat. Check out the close-up of letterpress at shinntype.com\\>essays\\>punch cuts\\>fig.2\n\nI think I bought it because i liked the way the screen swivels so you can see your self-portraits — i have a lot of pictures I’ve taken of “me with so-and-so”, although even with arm at full extension, my nose always seems too big (the lens is a bit “fishy”).\n\nTo return to the thread topic, I don’t understand what Frank means by “obfuscating image formats”, or what “RAW” is.\n\n"
    },
    {
      "time": " 21.May.2005 5.11am",
      "content": "<cite>So what is the problem with archiving .jpgs or even RAW? They both are well supported.</cite>\n\nIt only seems like that, that’s the big issue here. Nikon has different RAW formats for each of their cams. The newer (except for the D-70 for some reason) all have the white balance information encrypted, so if you are not Nikon, you have a problem. An Nikon has no clue how to make user-friendly software, or software at all, since their “photo suite” is a pain in the keister to use. Nikon has long forgotten about their users and might even suffer the Leica fate in the future who made similar mistakes, both didn’t listen to users.\n\nWith obfuscating a file format I mean exactly that. It’s not like film where the basic information can be restored to a certain level by scanning and additional processing steps. but with file “negatives” since that’s what RAW files could be compared with(given that they have way more information than a chemical negative ever had) the whole issue is different.\n\nWe can use images that are 50 years old. In 50 years the images from companies like Nikon will be useless. Nobody will be able to open them since in a worst case scenario the company doesn’t anymore exist since 20 years and no one is left that knows how to work that secret format.\n\nAdobe’s foray with the Digital Negative is quite limited as a format itself (I don’t use it btw) and photographers don’t trust it (except the endorsers). I don’t know the whole spec but it seems to be limited to carry 16bit per channel images as a max.\n\n"
    },
    {
      "time": " 21.May.2005 6.29am",
      "content": "\\>An Nikon has no clue how to make user-friendly software, or software at all, since their “photo suite” is a pain in the keister to use.\n\nI actually prefer the Nikon View (6.1) and Editor to I-Photo... I bought a Mac G4 12” powerbook because they claimed to handle RAW files.. but It didn’t. I had to upgrade to the toy they call I-Photo 5.\n\nI use Nikon View on Windows and it’s fine. It shows all the shooting data and meta data. On the Mac it doesn’t work well importing since some ranges may go missing ie. I was importing 500 jpgs once and about 10 shots were missing.\n\nThe D2-H is not protecting the white balance information so the ’as shot’ value is readable. The D2-X is suppose to be placing the white balance in an encrypted part of the file format and Nikon and Adobe are at odds with this change. But it still doesn’t make the RAW file format unusable. You just have to use Adobe’s white balance setting, set it to what you want and then go. The whole reason with shooting RAW is to be able to tweak any image just in case you messed up.\n\nI set my camera’s white balance to flash when shooting studio flash stuff and haven’t really found it necessary to change the white balance in the final images. I suppose if I forget to reset it when shooting in natural light I might need to change it.\n\nWonder how much film for my old original polaroid Land Camera is available or cost? I also own the [Polaroid 35mm 1981](http://web.archive.org/web/20081013182628/http:/www.central-camera.com/polaroid/for_creative_users.htm) or something. So everything gets old eventually.\n\n"
    },
    {
      "time": " 24.May.2005 5.25am",
      "content": "I found this [Canon 8400F](http://web.archive.org/web/20081013182628/http:/consumer.usa.canon.com/ir/controller?act=ModelDetailAct&fcategoryid=120&modelid=10242) in a local store for cheap. First results are it handles up to 12 35mm frames in one scan, or 3 6x7cm medium format frames.\n\nQuality was acceptable and I could scan all frames with no cropping. It’s newer, better and less fiddly than the old Epson 1640SU photo scanner I was using, ie. good negative carriers for 35mm, 120 or 35mm slides. The scans I’m not convinced are clearer though. But it’s early days.\n\n"
    },
    {
      "time": " 24.May.2005 5.34am",
      "content": "This should be old news to you, but Adobe has introduced a new publicly available RAW-format called [DNG (digital negative).](http://web.archive.org/web/20081013182628/http:/www.adobe.com/products/dng/main.html)\n\nI haven’t tried it out yet, but everything seems to make sense. First I have to make sure the conversion to DNG isn’t doing any harm to the images.\n\n"
    },
    {
      "time": " 26.May.2005 4.53pm",
      "content": "I must say I’m one of those that don’t wholly trust the DNG format. Not just because Adobe took too long to add real 16-bit editing to Photoshop and then took too long to add basic 32-bit editing to it. What do you think would happen to your images when looking from that angle? I’ll rather wait.\n\nSince my cam’s format (x3f) is not too widely supported and Photoshop’s RAW plug-in misinterprets a lot of the colors and has no support for the Fill-Light option (see proprietary formats) I had to set up my own workflow which uses ILM’s Open EXR format so I’ll be good for long after the ill fated but great Foveon format (no thanks to Sigma for that!).\n\nOpen EXR is supported by CoreImage on Tiger and in QuickTime. Since Apple hasn’t dropped a single codec yet that they added to QuickTime over the years I’m not too worried about my images that are converted already.\n\n"
    }
  ]
}
