{
  "id": "1260",
  "title": "Logo for 25 ANNIVERSARY",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey everyone, it's my first time posting here.   \nso here are versions of a logotype for universidad de Alicante   \nfor celebrates 25 ANNIVERSARY   \nGive me some comments on this if you please ![l</p />\n</p>\t</div>\n  \n          <div class=](http://web.archive.org/web/20150417161004im_/http:/www.typophile.com/forums/messages/29/16081.jpg)\n\n- [Login](http://web.archive.org/web/20150417161004/http:/typophile.com/user/login?destination=node%2F1260%23comment-form) or [register](http://web.archive.org/web/20150417161004/http:/typophile.com/user/register?destination=node%2F1260%23comment-form) to post comments\n\n",
  "author": "canape",
  "time": "12 Sep 2003 — 2:13am",
  "uid": "2229",
  "comments": [
    {
      "time": "12 Sep 2003 — 3:34am",
      "content": "Bienvenido Sergio, from one from Madrid...   \nAt first sight I like it but 3 ideas:   \nI think you should work with \"UA\", even though I like them with \"UN\", but this is the problem, I read UN (la Universidad de Navarra...?)   \n25 ok in the same color, have you tried in the blue one?   \nI like the text in gray but it is kind of hard to read for me, maybe becouse the gray is too light and the font thin, I don't know if this could be more legible in Upper case.   \nWell, I hope it helps, y bienaventurados aquellos que pueden trabajar al lado del mar .... algun dia lo conseguire.\n\n"
    },
    {
      "time": "12 Sep 2003 — 4:35am",
      "content": "gracias por contestar ..   \n   \n   \ni think i got a problem with the colors ...   \n   \ntry to me help me thx ![logotpe](http://web.archive.org/web/20150417161004im_/http:/www.typophile.com/forums/messages/29/16092.jpg)\n\n"
    },
    {
      "time": "12 Sep 2003 — 7:01am",
      "content": "when the \"25\" is dark blue, it takes too much attention. it's best in dark orange or dark gray.   \n   \nthe best one might just be the bottom left one for me. the colors are nice, and i can come closer to being able to read that thin font. but i think that thin font should change..to something legible. maybe it should be dark dark gray too.   \n   \nactually, i like the one to the right of that one, because the \"UA\" is orange and yellow, similar in color. just make the text readable, and it'll be much better.\n\n"
    },
    {
      "time": "12 Sep 2003 — 7:49am",
      "content": "Watching the logo of the university... why don't you take the first or second of the first row (Red Yellow Gray) and put it in an outline rectangle with blue lines, just a thought.\n\n"
    },
    {
      "time": "12 Sep 2003 — 10:56am",
      "content": "For me the third on the top row is the most appealing. It has a fresh appeal to me, celebratory and sunny   \n   \nBut the text below it need be darker\n\n"
    },
    {
      "time": "14 Sep 2003 — 6:59am",
      "content": "the type in the bottom (Aniversari...) is extremely hard to read, especially with such a light color\n\n"
    }
  ]
}
