{
  "id": "12618",
  "title": "(x) Nutrition facts on food product labels - (generally) Helvetica {Lex}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "What font is used on the food label of products which indicates the information of **Nutrition Facts**? Saddened, I have no image. This piece of information appears on the label of all the products. It gives to the consumers of the information onto Calories, Fat, Carbonhydrate, and so on.\n\nTo me, it seems to be Helvetica condensed or Trade Gothic but I'am really not sure.\n\nThanks in advance\n\n",
  "author": "<a href=\"/web/20120110102038/http://typophile.com/user/5264\" title=\"View user profile.\">sim</a>",
  "time": "<br>",
  "uid": "5264",
  "comments": [
    {
      "time": "",
      "content": "I don't think there is a standard typeface used for the \"Nutrition Facts\" labels. Right here I have a box of apple juice that uses Helvetica/Helvetica bold, and a can of soup that uses Helvetica light condensed/Helvetica bold condensed.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Looking over the food in my pantry, all of the \"Nutrition Facts\" or \"Nutrition Information\" labels seem to be set in some weight of Helvetica.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Aye. Pretty sure it's all [Helvetica](http://web.archive.org/web/20120110102038/http:/typophile.com/wiki/Helvetica).\n\n"
    },
    {
      "time": "",
      "content": "Hehehe, I recently designed some chocolate wrappers, chocolate peanuts bags and jam labels, and I set the nutrition facts all in [Solex](http://web.archive.org/web/20120110102038/http:/www.emigre.com/Volume.php?p=UPEMSOLFM). It's very economic and stays perfectly readable at very small point sizes. I just hope I won't get arrested by the food label police. :-P\n\nI think it's all to do with the tired myth that [Helvetica](http://web.archive.org/web/20120110102038/http:/typophile.com/wiki/Helvetica) is the best readable typeface -- which is total and utter bollocks, pardon my French -- and also due to laziness of the \"designers\" involved. It doesn't take a lot of thinking to just pick the most obvious and overused face in your font menu. In a perfect world professional pride should prohibit you from neglecting even the tiniest details on stuff you design, so the most trivial and mundane piece of information should get the same kind of attention as the cover or headline.\n\nThere _are_ clients who notice and appreciate that.\n\n"
    },
    {
      "time": "",
      "content": "Actually, in the US the FDA mandates the nutrition panel information, which must follow certain guidlines to maintain uniformity across diverse brands and products. This was done within the last ten years in order to make the nutrition panel more uniform and easier to understand for most consumers (before it was a mess!). Typefaces are not mandated but certain typefaces are recommended (Helvetica Black, Franklin Gothic Heavy) which is probably why Helvetica is used everywhere. Check **[here](http://web.archive.org/web/20120110102038/http:/www.cfsan.fda.gov/~dms/labtr.html)** and **[here](http://web.archive.org/web/20120110102038/http:/www.cfsan.fda.gov/~dms/flg-5-1.html)** for specific typeface and other design guidelines on the \"Nutrition Facts\" panel. It also specifies leading, size of horizontal rules, etc.\n\n"
    },
    {
      "time": "",
      "content": "Interesting... I just looked at a lot of similar wrappers and labels and went from there.\n\n"
    },
    {
      "time": "",
      "content": "I don't think the Nutrition Facts area is something that should be treated overly creative. So using other fonts than Helvetica to me isn't good design. Wherever the n. facts area on a product is, I automatically identify it for the Helvetica Bold on white background with smaller type below. So I don't have to use extra brain cells for finding it, which makes it good design to stick with the norm.\n\nNo offense to the person who designed it with Solex, but if I was your art director I hadn't let it out...\n\n"
    },
    {
      "time": "",
      "content": "I had to set some Nutrition info for a sauce and used Franklin Gothic Condensed, also quite readable in various weights. Using a condensed font made it take up less space.\n\nEdit: in fact, I used Franklin Gothic Compressed, not condensed. Worked very well - readable and unobtrusive.\n\n"
    },
    {
      "time": "",
      "content": "I don't think I follow you Herb. So you're saying that the simple selection of a typeface that's far more readable and far more economic is \"overly creative\" and \"not good design\". Interesting... Would you mind explaining that to me, please? I'm always eager to learn, and I certainly don't want to repeat this mistake.\n\n. : . : . : . : . : . : . : . : . : . : .\n\n_Wherever the nutrition facts area on a product is, I automatically identify it for the Helvetica Bold on white background with smaller type below._\n\nNo kidding? I usually identify it for the bold words spelling out \"Nutrition Facts\" that run above a box with really tiny type. Maybe it's just me ...\n\n_So I don’t have to use extra brain cells for finding it, which makes it good design to stick with the norm._\n\nHey, it's not _my_ fault you haven't got the extra brain cells to spare! :-P\n\nBut you're absolutely right when you say it makes good design to stick with the norm. Innovation, research, experimentation... that's all been grossly overrated in art and design history. No no no, we'll have none of that. Conformism is what we truly need, safe and comfy conservatism. Helvetica rules. Big time.\n\n"
    },
    {
      "time": "",
      "content": "I personally think that if the client is open to originality and this originality fits within the bounds of readability and legibility and still resembles the afore-mentioned item then I see no reason why solex can't rock it better than helvetiicamonica.\n\n"
    },
    {
      "time": "",
      "content": "I did a double take when I saw a brand of pasta use [Futura](http://web.archive.org/web/20120110102038/http:/typophile.com/wiki/Futura) on their boxes for the nutrition facts.\n\n"
    },
    {
      "time": "",
      "content": "wow, a lot of attitude I stirred up there. Kinda fitting to your nickname, uh? Sorry.\n\nAre you trying to say creativity is automatically achieved when you do something off the norm everytime you do something? Wouldn't that be a new norm on it's own?\n\nAnd yes, conformism is the way to go for such things as Nutrition Information areas.\n\nI hate to have to spell this out, but that \\*doesn't\\* mean you shouldn't be innovative and experiment where you are free to do so.\n\nYou actually remind me of some of the kids who are trying make every design piece they do look like a flyer for a techno party and then they don't understand that they cannot work for high profile clients.\n\nJudging from your photo you aren't even that young.\n\nOh well I shouldn't waste my time with people like you, so bye.\n\n"
    },
    {
      "time": "",
      "content": "There are clients who notice and appreciate that.\n\nSo you haven't realized yet that you aren't designing for the client, but for the client's client?\n\nHow long are you in the business, kid?\n\n"
    },
    {
      "time": "",
      "content": "Well, Mr Fassbinder, I think you may have just 'outdone' yourself with these posts / replies, and you are, what, a member of Typophile for only a tad more than a week, now.? 'Nice' one.. _( You sure do seem like a bitter, sad, oh, and old, man.. )_\n\nBye..\n\n"
    },
    {
      "time": "",
      "content": "Wait a minute…\n\nI don't want to mandate any typeface for anything, but I think that the real beauty of the American Nutrition Labels in that they are relatively homogenous.\n\nThese labels were conceived to be the same across the board. They are not subject to branding. They allow consumers to quickly identify ingredients, and compare products based on their nature and not on their package design. Sometimes, this get a little silly. I remember the first time that I saw this label on a bottle of water (Dasani, from Coca-Cola); its label had a zero next to everything. That was funny. It was also sad, I thought, that it was now necessary to put ingredient information on water…\n\nAnyway, I think that it is a service to the customer (the viewer, reader, etc) that these all look nearly identical. That is the whole point of the labels. Living in Germany now, I actually miss these labels quite a bit. Ingredients here are usually listed in the tiniest of type, at the very bottom of the package. That is illegible and does not help anyone do anything. The manufacturers here probably just put those on a package because they have to. The American standard is much better, I think, because at least it is clear and legible.\n\nWhether the spec recommends Helvetica, Franklin Gothic, Solex, or Remedy is sort of irrelevant to me. I think that this \"lack-of-design\" is good.\n\nDidn't the AIGA declare these labels to be the best piece of design produced in the US during the entire 1990s? There is some truth there. They are good info. design…\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20120110102038/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "",
      "content": "I'm going to get it for this…\n\nI think that these would even be OK in Arial.\n\nSo many people seemed to have used Helvetica, probably because most designers have it and were trying to be intentionally neutral. Arial would be even more neutral, because everyone has it.\n\nThat must have been the reason that the John Kerry campaign picked Georgia as their face… every computer (almost) had it installed.\n\nSometimes, the lowest common denominator is good. Think about the end-user! Here we are talking about stressed-out shoppers, who have little time to compare products. Give them something easy to understand. They'll thank you for it.\n\nHelvetica and Arial are not the most legible typefaces. That is no surprise. But what is a more legible typeface that would be easy to get to every designer servicing the American market? Myriad maybe?\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20120110102038/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "",
      "content": "_So many people seemed to have used Helvetica, probably because most designers have it and were trying to be intentionally neutral._\n\nI don't think intention has much to do with it. The FDA in no uncertain terms recommends and strongly encourages Helvetica (or Franklin Gothic), and uses them in their examples. This is why designers used them when the label was overhauled and this is why those faces continue to be used on US Food packaging.\n\nNow as to why the FDA chose Helvetica ... there neutrality may have been a factor.\n\n"
    },
    {
      "time": "",
      "content": "Herb,\n\nI agree with formlos, I think Typophile can very well be without rude people like you. Yves Peters (troubleman) is a very talented and brave designer and shouldn't have to stand nasty comments like yours, when just sharing his views and ideas.\n\nLove, Peace & Understanding!\n\n"
    },
    {
      "time": "",
      "content": "Herbert, it appears to me that you're making a lot of sassy comments without even knowing what I'm talking about. Let me clarify a few things:\n\nI live in Belgium. We don't have an FDA that spells out how Nutrition Facts should look like. I wasn't aware of these standardisations and frankly I don't even _need_ to be, as they only apply in the USA. It's up to the designer to make this information as clear and legible as possible within the limited space available on food packaging (I realise this amount of freedom may sound terifying for someone like you, but it really isn't). I achieved this by carefully selecting a typeface, and a before-and-after comparison with several similar food packages proved that ours was by far the clearest and easiest to read. Unlike what you are trying to imply, Herbert, this process took me a couple of minutes at the most, as I do know my type and usually can predict what the effect will be. Setting a simple box with legible type is not \"trying make it look like a flyer for a techno party\".\n\n_Are you trying to say creativity is automatically achieved when you do something off the norm everytime you do something? Wouldn’t that be a new norm on it’s own?_\n\nI didn't say nor imply this _in any way_, that's just your imagination talking. But when the norm here seems to be way too small _all caps Futura Condensed_, you might understand that sticking to the norm is not very user-friendly. If trying to improve on that is bad design, than I'll happily be a bad designer. These were diet products for diabetics, so I wanted to make sure that the consumer would have no trouble at all reading this crucial information. So conformism was absolutely not the way to go in this pecific case. Don't worry, if the norm works, I'll stick to it.\n\n_No offense to the person who designed it with Solex, but if I was your art director I hadn’t let it out…_\n\nJudging from your photo you aren’t even that young.\n\nOh well I shouldn’t waste my time with people like you, so bye.\n\nSo you haven’t realized yet that you aren’t designing for the client, but for the client’s client?\n\nHow long are you in the business, kid?\n\nAnd you tell me you are surprised that you \"stirred up a lot of attitude\"? After making such demeaning statements? I don't mind a well-informed opinion and a healthy debate, but I do take offense at mean-spirited comments and plain rudeness. Just listen to yourself! You don't know me, and you went way out of line, several times in a row. Who do you think you are, and frankly, what makes you think you'd ever be in a position to be my art director?\n\n"
    },
    {
      "time": "",
      "content": "Impressive, to where a simple technical question can go. That's design!\n\n"
    },
    {
      "time": "",
      "content": "Sorry that your thread turned ugly, André. That's always a risk when you ask people that are passionate about what they do. ;-)\n\nI hope this won't scare you away from participating in the future. As long as everyone stays courteous there's no risk in this kind of situations repeating themselves. On the whole we're a very mild-mannered and polite bunch, really, when you compare this forum to others.\n\n"
    },
    {
      "time": "",
      "content": "Yves is not worried. I adhered to the forum, I stay there. I know the risks and I am ready to assume them. It was an observation without consequence. With this thread I received more answer than I hoped.\n\n"
    },
    {
      "time": "",
      "content": "Does Herb remind anybody else of Type that guy that was insulting graphic designers a few months back?\n\nIf we left all our graphic design decisions up to government agencies the world would be a sorry (and ugly) place. A Nutrition Facts box may not be the place for a bold design statement but there is no reason for information graphics not to have a little style if no legibility is lost?\n\nThat said, there are a lot of \"kids\" out there who think of type as merely a design element and not something to be read.\n\n"
    },
    {
      "time": "",
      "content": "_That said, there are a lot of “kids” out there who think of type as merely a design element and not something to be read._\n\nQuite right, but I think it's all inherent to the learning curve. We all \"sinned\" when we were young, didn't we? :-)\n\nAnd BTW it's certainly not just the kids (maybe that's why you added the quotation marks). There are some young guys who do amazing typographic work, and then there are graphic designers with years of experience who'll probably _never_ learn. Especially the majority of the ad agencies here appear to have no clue whatsoever how to properly set type.\n\n"
    },
    {
      "time": "",
      "content": "Not to mention that every idiot with a PC thinks they're a designer now. I love the computer and wouldn't go back to cut and paste for anything but I think it has, to some extent, taken design out of the hands of professionals and with not such good results.\n\n"
    },
    {
      "time": "",
      "content": "_every idiot with a PC thinks they’re a designer now._\n\nand everyone with a camera thinks she's a photographer. and everyone with a set of paints thinks he's an artist. and everyone who has a hammer -- a carpenter, &c.\n\nJust as certain people appreciate fine photography or excellent cuisine, only certain people are going to fully understand the importance of good design. let the rest of 'em live on mac n cheese.\n\n"
    },
    {
      "time": "",
      "content": "hey. no dissin' on the mac and cheese, paul, if you use asiago or padano and add a nice ground pepper it can be good.\n\n"
    },
    {
      "time": "",
      "content": "A little pancetta adds a nice touch too.\n\nDifference is the computer has made design newly available to the masses so there's been an explosion of dreadful design in the last 20 years. Ugly art and bad photography are nothing new.\n\n"
    },
    {
      "time": "",
      "content": "Troubleman,\n\nread the posts in order and then you'll see you're the one who started being nasty and I only responded the same way.\n\nI guess when I said \"if I was your art director...\" some deep frustration in you broke out and you had to make all the nasty comments about me not liking freedom of speech etc.\n\nAs you are the regular here and not me, I had no chance in the first place, because that's how internet forums work...\n\nToo bad!!! I am soooo defeated now.\n\n"
    },
    {
      "time": "",
      "content": "Herbert, this is getting too silly for words. I'm sorry we got off the wrong foot. Let's stop this bickering and move on. I hope to meet you in another thread where the debate promises to be lively.\n\nBye for now.\n\nYves\n\n"
    },
    {
      "time": "",
      "content": "This has NOTHING to do with type but here is maybe the most hostile thread I've ever seen. Cycling anyone?\n\n[http://thorntree.lonelyplanet.com/messagepost.cfm?postaction=reply&catid...](http://web.archive.org/web/20120110102038/http:/thorntree.lonelyplanet.com/messagepost.cfm?postaction=reply&catid=32&threadid=776884&messid=6606542&STARTPAGE=1&parentid=0&from=2&showall=true \"http://thorntree.lonelyplanet.com/messagepost.cfm?postaction=reply&catid=32&threadid=776884&messid=6606542&STARTPAGE=1&parentid=0&from=2&showall=true\")\n\n"
    },
    {
      "time": "",
      "content": "troubleman, okay I am ready to go all emo with you, my dear :)\n\nBut it has to be stated that, if you read this thread chronologically, you are the one who started with the bad bad wording.\n\nLet's just not forget that. I don't know WHY you now desperately want to continue in another thread, I just hope it's not to detract from the fact.\n\nThe truth will prevail!\n\n"
    },
    {
      "time": "",
      "content": "\"Does Herb remind anybody else of Type that guy that was insulting graphic designers a few months back?\"\n\nwhat are you talking about? insulting graphic designers -- who? what way? what did i say? the Trajan thing still in your head huh? move on lady.\n\n"
    },
    {
      "time": "",
      "content": "This is starting to sound like a schoolyard brawl, and boy do I hate those.\n\nHerb, Type, why don't you go get a life.\n\nBoth of you.\n\nSheesh... kids. :-/\n\n"
    },
    {
      "time": "",
      "content": "Troubleman (Yves), huggyGiraffe (Herb), Type, Pattyfab (Patricia). I realize your discussion surrounds a design-related issue so, it's clearly on topic. But please do it without the name calling and the drama. There's no need to question someone's age. There's no need to question someone's \"brain cells\" or bring the user Type into it.\n\nThere, that was the obligatory chastisement. Being a moderator, Yves should know better than to spout off without at least 2 or 3 more smiling emoticons. If you don't know Yves you should know that he often comes with some salty remarks, underpinned by his usual charm. I'm going to chalk this one up to a bad day. What you may not know about Yves is that he is a very reasonable person, is genuinely easy to get along with, puts in a lot of hours helping with these boards and most importantly, when it comes to type he knows his stuff - all reasons why he is an excellent moderator.\n\nNow that that's off my chest...\n\nI have to agree with some of the sentiments here that a nutrition label is not an area to customize or put a brand spin on. Sure, I'd question Helvetica for this use, but I'd put that question to the standards body (if there truly is one in this case). But I certainly wouldn't put it to every individual designer out there making one-off decisions about the given package they're working on. And that's not a judgement about the use of Solex either. Solex might work perfectly well. I'm simply arguing that standards in this case are warranted.\n\nTo Dan's comment, I'm not sure I'd be eager to make a correlation between what is very common on people's computers, and what is the most generic or most appropriate for this kind of facts label. (Comic Sans holds up to that same criteria.)\n\n"
    },
    {
      "time": "",
      "content": "The whole point of making nutrition labeling standard in the US was in part because food producers were putting huge amounts of sugar, salt and fat into their products and then misrepresenting them through marketing and advertising. Most recently their has been a movement to expand the labeling to fast food chains like Burger King etc.\n\nFor that reason the FDA required that the labels be large and the type to be an easy to read san serif. This isn't about design, its about protecting the public from bad food processing practices.\n\n"
    },
    {
      "time": "",
      "content": "You could compare this (Nutrition labeling - how readable is the 'standard'?) to the way cigarette packaging has to show a health warning (speaking about The Netherlands). The size of those warnings has been set in regulations, but the producers use very condensed and extremely tight type, so these warnings turn into ornaments, being almost unreadable.\n\nMaybe the US Nutrition labeling has just became that: a token gesture, turned into a ornament, just as the UPC barcode... So there is a just reason for questioning the validity of the present practice. Imagine redesigning those tables to convey some REAL information, eg the fact that a product provides all of the Vitamin C needed in just one dose. Or making clear that there is a dangerous dose of salt in it. (Designers could go crazy...) In any case: making them more readable. By readable I don't mean just legible, but also INFORMATIVE.\n\nOn another note: I have been in Forums for quite a few years now, even moderated a few in the days they were in BBS's and not on the Internet, and I think one should disregard obnoxious, irritating, etc. posts if they occur occasionaly (everyone has bad days). On the other hand: someone who is a constant heckling presence should be banned.  \nIn this case I have not noticed Mr Herb doing a lot of nasty stuff, so maybe it's better to let it rest...\n\n"
    },
    {
      "time": "",
      "content": "I don't know... I think nutrition labels are pretty darn usable because they're universal and generally large enough. But, if we put nutrition labels and cigarette warning labels on a spectrum it would fall something like this (in order of most readable to least):\n\nNutrition Labels (generous size, consistent placement)  \nVideo Game Rating labels (sizable enough, generally consistent placement)  \nMPAA Movie Ratings (very tiny, inconsistent placement)  \nCigarette Warning Labels (condensed sans, all caps, but large and prominent)  \nDrug Warning labels (wrapped in tiny text on small bottles or boxes)  \nMovie Poster Credits (extremely condensed, thin, all caps)\\*\n\n(\\*Okay I threw that in there for laughs. This info may be harmful but it's not life threatening.)\n\n(This is not to say nutrition labels could not be improved by any means. Just trying to illustrate that they function well compared to some other informational labels.)\n\n"
    },
    {
      "time": "",
      "content": "Ok so I found this thread on my search to find an layered Illustrator file/template. Any one have one built to spec, here?  \nI thought will all these experts I could get a killer CS3 version. Adobe Exchange is usually good for this but  \nits down right now. Anyone ? Bueller....Bueller?\n\n"
    }
  ]
}
