{
  "id": "12617",
  "title": "two radio stations / two logos",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi, I´ve been browsing the forums for quite a while, but this is actually my first post. I´m willing to get some feedback and directions on two projects that I´m currently working on for a contest (the deadline is may 27 for both of them).\n\nScenario 1:  \nCristal fm - logo for a radio station, client guidelines as follows: modern, young (18-35 years old, middle-high socioeconomical class), prestige, frecuency number must be first in visual hierarchy, institutional color: green (no particular green, though), versatility of use (vertical banners, diverse merchandising, etc). Their current slogan translates to something like “Music for real”.  \n Well, with this briefing in mind (even though I found some of the guidelines contradictory) I came up with a rough sketch (the one with first-sketch in its filename). I showed it to the client on a preliminary meeting (again, the deadline is may 27) and he liked the versatility of use and posible articulation of its elements, but he wanted it to be more prestigious, so he “suggested” me to use a serif typeface. I don´t think that using serifs is the only way to imply prestige, but he´s the one that´s making the choices in the final selection :)  \n Please tell me what you think of it, suggestions, critiques, etc. Some pointers on how to solve the frecuency number typeface issue (I haven´t really worked on it yet, it´s getting on my nerves) will be really helpful.\n\nScenario 2:  \nHollywood - logo for another radio station (same owner), client guidelines: adult audience (35-40some years old, middle-high socioeconomical class), timeless plus 80´s & 90´s soft music classics, chill out, relaxation, versatility of use (it´s one of those clients who wants his logos to do everything right). The client really liked the isotype (the relaxing guy icon) and the infinity double “o” ligature (related to the timeless & bonding concept, kinda cheesy to me). I didn´t wanted to go retro on this logo because they´re looking for a fresh new image (plus ALL the previous requirements).  \nAgain, let me know your thoughts about it and any critiques/comments you may have, they´re all welcome.\n\nThanks in advance\n\nf\n\nPS: I´m sorry for my pathetic english\n\n| Attachment | Size |\n| --- | --- |\n| [cristalfm-first-sketch.jpg](http://web.archive.org/web/20080519014456/http:/typophile.com/files/cristalfm-first-sketch.jpg) | 6.73 KB |\n| [cristalfm.jpg](http://web.archive.org/web/20080519014456/http:/typophile.com/files/cristalfm.jpg) | 42.6 KB |\n| [hollywood.jpg](http://web.archive.org/web/20080519014456/http:/typophile.com/files/hollywood.jpg) | 17.76 KB |\n\n [‹ Logo critique](http://web.archive.org/web/20080519014456/http:/typophile.com/node/12653 \"Go to previous forum topic\") [Design Logo Fraktal ›](http://web.archive.org/web/20080519014456/http:/typophile.com/node/12374 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080519014456/http://typophile.com/user/7473\" title=\"View user profile.\">fedezz</a>",
  "time": "<br>",
  "uid": "7473",
  "comments": [
    {
      "time": " 22.May.2005 1.21am",
      "content": "First, there is no need to apologise for your English.  \nI don’t think unicase is the way to go to hint at prestige I would look at more “traditional” serif faces. Also I wonder if you could make the circle round the frequency into a crystal so that the frequency on its own could be used if required. I found your first sketch more in keeping with the demographic although an alternative to the existing typeface might be more elegant Bliss leaps to mind but there are many alternatives, and look at upper and lower case. The fm ligature works very well in the first sketch version.  \nFor the second I would also look at upper and lower case, this might sort out the spacing issues of the LYW, instead of the infinity moebius loop you could look at an oo ligature in the vein of Mrs Eaves. The point for the frequency should move up to align with the centre of the 3. The illustration is charming, but maybe it should move down a bit and the weight of the bubble chair stroke could be a bit lighter.  \nTim\n\n"
    },
    {
      "time": " 22.May.2005 5.45am",
      "content": "fedezz, these days who cares about am or fm. Most radio stations have a link to on-line streaming. My point being, in emphsis bury the fm all together make it tiny.\n\nThe 107.9 cristal are static not dynamic. Make the 107.9 shape move or give it dimention. Maybe its exploding with sound, like how you would feel if you were stuck in front of a sub-woofer. That age group is a go-go group (think ipod, or ishuffle) media goes with them (cell phones with internet access). The type isn’t the problem.\n\n101.3 Hollywood is just boring. Try doing something with the traditional Hollywood hills lettering. Also explore something classy and classic like a Tragian movie title look. The mark on the first version leaves me cold, it means nothing to anyone.\n\nNow you’ve made a good start, keep going, and post some more. Think less about design and more about your target audience and you will have winners.\n\n"
    },
    {
      "time": " 22.May.2005 7.27am",
      "content": "timd: the problem with u/l cases is that I only have one ascendent in the whole word (l), and gives me a weird shape. In hollywood it gets even worse. What do you mean with “make the circle into a crystal”? The shape? Volume, 3d or some effect? Where can I get information about Bliss? I looked in myfonts.com and found no info there...  \nRegarding the second logo, your comments were quite useful, I´ll try to update that as soon as possible.\n\ndgweaver53m: actually, the client made emphasis in the importance of the station name being “cristal fm” (forbidding cristal, fm cristal or any other combination). I have no saying in that matter. I´m keeping in mind the target, the problem is that reality is a little bit different here in Argentina than in Europe or the states :) The actual logo has the word “Cristal” set in an Illustrator-condensed Bodoni, and the client wants to mantain at least some relation with it. Besides, being a contest, I have to make peace between what I like and think about design and the client´s willings :)  \nActually I thought about the hills thing, but I think it´s kinda cheesy, and it will not relate to the music or the concept. Also, it´s supossed to comunicate calm, relax, chill.\n\nThanks for the feedback, I will post some updates soon.\n\n"
    },
    {
      "time": " 22.May.2005 6.15pm",
      "content": "You can find Bliss here:  \n [http://www.typography.net/type/bliss.htm](http://web.archive.org/web/20080519014456/http:/www.typography.net/type/bliss.htm \"http://www.typography.net/type/bliss.htm\") directly from [Jeremy Tankard](http://web.archive.org/web/20080519014456/http:/typophile.com/wiki/Jeremy%252BTankard)\n\n"
    },
    {
      "time": " 23.May.2005 2.51am",
      "content": "I am not a fan of all uppercase setting, but you have ascenders (of a sort) with the C, i, and t. HOLLYWOOD set in uppercase gives you all kinds of problems with negative space around the centre of the word which, with application, you could reduce. I didn’t want to dictate the shape of the final logo (and I’m not certain it will work) so I left the suggestion of shape hanging but you could start with a simple lozenge and introduce 3d, just to see if you think it will work.  \nWhile you are looking at Bliss take a look at Aspect.  \nWith re-reading my comments on the Hollywood illustration are not clear I meant the figure should move down to settle it into the chair.  \nTim\n\n"
    },
    {
      "time": " 23.May.2005 2.00pm",
      "content": "fedezz, my thought on the Hollywood hills lettering was about demographics (its dated), wouldn’t be associated with anything but middle aged listeners. I didn’t realize your dealing with a South American client. Try researching the lettering of the period of the music they play, maybe something will grab you.\n\nSince this is a competition, your competitors might try some more edgy designs and catch lightning in a bottle. Don’t paint yourself into a corner or you will loose. My problem with your logos is they aren’t promotional enough yet. They don’t screem enough, and radio stations scream!\n\n"
    },
    {
      "time": " 25.May.2005 2.20am",
      "content": "Dan,  \nI would suggest that using fonts from the 80s and 90s would produce a logo not quite dated enough to be retro and in fact might appear in need of an update. As for the Hollywood Hills lettering when does that date from?  \nTim\n\n"
    }
  ]
}
