{
  "id": "12622",
  "title": "Baskerville",
  "forum": "Home",
  "tags": [
    "Typeface",
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20150315014517/http:/typophile.com/wiki/Indices) : [Typefaces](http://web.archive.org/web/20150315014517/http:/typophile.com/wiki/Typefaces) : Baskerville**\n\n![](http://web.archive.org/web/20150315014517im_/http:/cdn.ilovetypography.com/img/baskerville-sample1.gif)\n\nBaskerville is a \"transitional\" typeface, designed by John Baskerville in England in the mid-18th century, revived in the early 20th century and widely used for books and other long texts. Many versions are available.\n\nThe various versions of \"Baskerville\" take as their starting point types used by [John Baskerville](http://web.archive.org/web/20150315014517/http:/typophile.com/wiki/John%20Baskerville) in England in the mid-18th century. Baskerville had been a \"writing master\", but at a time when the model to which writing aspired was not the humanist model, but one based much more closely on the work of engravers. When, having made a fortune in the japanning business, John Baskerville turned his attention to printing, he seems to have aspired to this aesthetic. He main works were monumental and classical in every sense: physically large editions of great classics (Virgil, the Bible). The type was crisp, the paper smooth and pale. They are often classified as \"transitional\" type, because they bridge the gap between \"old-style\" type (with its oblique stress and relatively low contrast) and \"modern\" type, with its vertical stress, high contrast, and sharp finish. Baskerville's roman is fairly round and open, with a vertical stress but relatively low contrast.\n\nBaskerville's type (which he probably helped design, but which was cut for him by others at a time when punchcutting could never be mere transcription) was highly successful only for a short time--though the glow lasted longer in France. By the early 19th century the modern face had superseded it, and when the reaction against the modern occurred in the late 19th century, it was to earlier \"old face\" types that people returned. Interest in Baskerville seems to have revived in the early 20th century, with [Bruce Rogers](http://web.archive.org/web/20150315014517/http:/typophile.com/wiki/Bruce%20Rogers) among others taking an interest in him. It came to be suspected that the transitional label, which suggested that Baskerville was simply a stretch of road between two distinctive peaks of design, did not do justice to its originality.\n\nNot surprisingly, therefore, the type was revived for mechanical composition in the 20th century. [ATF](http://web.archive.org/web/20150315014517/http:/typophile.com/wiki/ATF) was first, followed by English Monotype in 1923, and thereafter other manufacturers (notably linotype) followed suit. Monotype Baskerville (Series 169), perhaps the best-known of these revivals was a commercially successful type despite (or perhaps because) it was heavily \"cleaned up\" by the Monotype drawing office producing what Sebastian Carter, in <cite>Twentieth Century Type Designers</cite>,aptly describes as a \"somewhat odourless type\". It was, however, widely regarded as well-proportioned: Hugh Williamson, in <cite>Methods of Book Design</cite> (1956), regarded it as \"one of the most readable and pleasant designs now in use\", and his judgment probably reflects a fairly broad consensus among mid-twentieth century book designers.\n\nBaskerville (like Caslon) had quite different designs for use at different sizes. Monotype's was based on a font designed for use at a fairly large size in an edition of Terence's comedies published in 1772. ATF and Linotype used strikes from genuine punches of a smaller size type; it is not therefore surprising that different versions of Baskerville look noticeably different: they are (or may) still be \"authentic\".\n\nBaskerville, in its various versions, was popular for book work during the letterpress era. How has it survived digitization and offset printing? In principle, it should do well: Baskerville's printing technique did not depend (indeed it eschewed) the three-dimensional element of letterpress. His model was planographic or sharp-edged: the inscription and the engraving. He ought to thrive.\n\nAs usual, the picture is mixed, but there is now a fair range to choose from. Although opinions may differ, digital [Monotype Baskerville](http://web.archive.org/web/20150315014517/http:/www.myfonts.com/fonts/agfa/baskerville-mt/) seems to lack something: it inclines to the anaemic, and tends to \"glitter\" unattractively. Digital, photographic and offset reproduction also seems to accentuate some features which were known to be faults in the letterpress version, especially the relatively darker stroke of the uppercase. It may well be one of the early digitizations in which something important was lost. [ITC New Baskerville](http://web.archive.org/web/20150315014517/http:/www.myfonts.com/fonts/agfa/itc-new-baskerville/) ( [Matthew Carter](http://web.archive.org/web/20150315014517/http:/typophile.com/wiki/Matthew%20Carter) and [John Quaranta](http://web.archive.org/web/20150315014517/http:/typophile.com/wiki/John%20Quaranta), 1978) has better weight, but it is purchased at the price of a more extreme contrast which leads to reservations about its suitability as a text-font for long-distance immersive reading (see, e.g., Dean Allen's [comment](http://web.archive.org/web/20150315014517/http:/www.textism.com/textfaces/index.html?id=7): \"quite usable but unsuitable for use in immersive reading\"). [Frantisek Storm](http://web.archive.org/web/20150315014517/http:/typophile.com/wiki/Frantisek%20Storm)'s [John Baskerville](http://web.archive.org/web/20150315014517/http:/www.myfonts.com/fonts/storm/john-baskerville/john-baskerville/) is a more recent version, which promises to be an \"absolutely ordinary and inconspicuous typeface\" (the very virtues which recommended Monotype Baskerville in metal), based on 14pt types used for Baskerville's editions of the Bible and Virgil. There is a version specifically designed for use at small sizes (10pt and below): Storm's thus has all the hall-marks of a revival designed for use in text. [Lars Bergquist's](http://web.archive.org/web/20150315014517/http:/typophile.com/wiki/Lars%20Bergquist) [Baskerville 1757](http://web.archive.org/web/20150315014517/http:/typophile.com/wiki/Baskerville%201757) is another attempt to re-create John Baskerville's original type. Another extremely popular font inspired by Baskerville, but with a very different aim, is [Mrs Eaves](http://web.archive.org/web/20150315014517/http:/typophile.com/wiki/Mrs%20Eaves).\n\n",
  "author": "pstanley",
  "time": "21 May 2005 — 2:05pm",
  "uid": "1670",
  "comments": [

  ]
}
