{
  "id": "12633",
  "title": "Is Logo Lounge worthwhile?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Are there any Typophiles who are members (past/present) of LogoLounge.com? Have you found the content useful? Is/was it worth the $100 yearly membership?\n\nI'm an experienced publication designer who's interested in doing more corporate ID work, and wonder if the site would provide useful feedback and inspiration.\n\n",
  "author": "marcox",
  "time": "22 May 2005 — 4:12pm",
  "uid": "1062",
  "comments": [
    {
      "time": "23 May 2005 — 9:45am",
      "content": "I've had an itch to join just to see what it is that makes it worthwhile. However, if it is anything like the other \"pay only\" forums I'd say it is not worth it. Just buy the book and continue to read [Speak Up](http://web.archive.org/web/20141003154452/http:/www.underconsideration.com/speakup/).\n\n"
    },
    {
      "time": "23 May 2005 — 2:22pm",
      "content": "Thanks, Tiffany -- that's sort of what I figured. But I still hope someone with firsthand experience will chime in.\n\nWhat other \"pay only\" forums have you experienced?\n\n"
    },
    {
      "time": "23 May 2005 — 8:54pm",
      "content": "I guess the specific one I'm thinking of isn't a forum, per se, but it is something that I didn't bother renewing this year as I didn't feel as if I was getting very much out of it. Out of respect for the people, I won't list names or places publicly. I know that sounds lame, I apologize for that, but just because the site isn't worth doesn't mean the people don't have a lot to offer. It is a one person decision.\n\n"
    },
    {
      "time": "23 May 2005 — 9:28pm",
      "content": "I feel as if I need to clarify a little more.\n\nIf my business were only based upon business identities I would pay to have access to the site. It would be something that I would feel compelled to stay on top of in that way. However, as I find the book to be enough for what I do, I don't pay the subscription. I would, of course, read it if it were free, but sadly it isn't so I have to make a choice.\n\n"
    },
    {
      "time": "24 May 2005 — 5:18am",
      "content": "For me the $100 has been very useful in marketing and promoting my work more than anything else. For the fee you are able to post your identity work in their galleries and then work posted in a given time period is considered for inclusion in LogoLounge books. I have work in both of the first volumes. Art directors, creative directors and potential clients have used the site and books to find their way to me. The text content is good - but for me that alone would not be enough for me to be a subscriber.\n\nJeff Fisher :: Engineer of Creative Identity  \n [Jeff Fisher LogoMotives](http://web.archive.org/web/20141003154452/http:/tinyurl.com/5y8bm)\n\nAuthor: [Savvy Designer's Guide to Success](http://web.archive.org/web/20141003154452/http:/tinyurl.com/5o7ud) from HOW Design Books\n\n"
    }
  ]
}
