{
  "id": "12640",
  "title": "Opinion on Scriptorium?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I am interested in submitting a font in order to sell it to Scriptorium. Does anyone here have an opinion or experience with this company? Is it a reliable, trustworthy company one can seel fonts to with no further hassles or disappointments?\n\n",
  "author": "mosh",
  "time": "23 May 2005 — 2:05am",
  "uid": "6146",
  "comments": [
    {
      "time": "23 May 2005 — 8:34am",
      "content": "Hi Mosh,\n\nI don't know anything about Scriptorium, but I do know about some other foundries where you could submitt your work. I'd like to talk to you about this offline, but your profile doesn't support recieving e-mails when you are not online. Can you e-mail me at [dan@typeoff.de](mailto:dan@typeoff.de)?\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20131017080735/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "23 May 2005 — 8:59am",
      "content": "Scriptorium/FontCraft have been around for quite a while, in fact I think they were one of the first independents to post a Web site. Dave Nalle was semi-regular on Typo-L but I can't say I've seen him active elsewhere online or at type conferences so it's difficult to form an opinion. His fonts certainly have a following - Tim Burton, and The Pirates of the Caribbean spring to mind. I would assume he's been reasonably successful to have stuck with it for so long, especially when other vendors have given up.\n\nCheers, Si\n\n"
    },
    {
      "time": "23 May 2005 — 6:48pm",
      "content": "i don't know about scriptorium, but another distributor you could always consider is [IHOF](http://web.archive.org/web/20131017080735/http:/typophile.com/wiki/IHOF). [www.p22.com/ihof](http://web.archive.org/web/20131017080735/http:/www.p22.com/ihof \"www.p22.com/ihof\")\n\n"
    },
    {
      "time": "26 May 2005 — 3:47am",
      "content": "Dan, I'll write a message to you. By the way, you can reach me at viejo\\_amargadoINhotmail.com. I am certainly eager to hear some bit about the best options for dealing one's fonts with.\n\nAnd yes, Scriptorium has been on a long time now. They have specialized in antique fonts, some of them quite interesting. Since one of my almost-completed fonts is a conversion from a XVII-Century printed book, I found Scriptorium an option for wanting to distribute it. But I wanted to know an opinion on the foundry's seriousness.\n\nI'll also search for IHOF, Paul.\n\n"
    },
    {
      "time": "1 Jun 2005 — 4:53am",
      "content": "Mosh,\n\nThere are a bunch of friendly indie foundries around, I would consider Fountain, Psy/Ops and Veer.\n\nGood luck\n\n"
    }
  ]
}
