{
  "id": "12643",
  "title": "New Icon for FontLab?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Some time ago I remember someone designed an alternative icon for FontLab.  \nWhere could I see it?\n\nThanks in advance.\n\nRamiro.\n\n",
  "author": "RamiroE",
  "time": "Mon, 2005-05-23 07:08",
  "uid": "1137",
  "comments": [
    {
      "time": " Mon, 2005-05-23 09:07",
      "content": "Pejot (Pawel Jonca) has been designing much of Fontlab Ltd.’s new corporate elements. This includes logos for our new product versions: [http://www.pejot.com/logo/](http://web.archive.org/web/20050525003717/http:/www.pejot.com/logo/) and some product illustrations: [http://www.pejot.com/ilustracje/](http://web.archive.org/web/20050525003717/http:/www.pejot.com/ilustracje/)\n\nThe new FontLab Studio icon will be included in FontLab Studio 5, of course :)\n\nRegards,  \nAdam\n\n"
    },
    {
      "time": " Mon, 2005-05-23 10:51",
      "content": "Well, these look quite nice. The Transtype one is nifty to boot. :-)\n\n"
    },
    {
      "time": " Mon, 2005-05-23 11:46",
      "content": "The forums hate me. Boohoo. I’m not that much of a space cadet. There is a post in there, if you edit it.\n\nWhat I said was:\n\nRamiro I think you are referring to [this thread](http://web.archive.org/web/20050525003717/http:/www.typophile.com/forums/messages/30/4820.html?1045092418).\n\nHowever, it looks like the FontLab guys have found a brilliant artist for the forthcoming icons.\n\n"
    },
    {
      "time": " Mon, 2005-05-23 15:40",
      "content": "Very nice.\n\nIt does bother me that the spline control points in the _FontLab Studio_ icon are wrong. I think those could be fixed without detracting too much from the design of the icon.\n\nIt’s also a little disconcerting to see that the split-up pieces of the _BitFonter_ logo contain partial pixels of the _B_ glyph. The pieces should be split on exact pixel boundaries.\n\nFinally, I’m confused as to the purpose of the _r_ that exists in the negative space of the _TransType_ logo. It seems to just clutter up the logo — probably more so in the smaller versions of the icon, such as the Windows-typical 32×32. It also doesn’t work at all with the upside-down _T_. I’d probably keep the two _T_s and eliminate the _r_ entirely.\n\n"
    },
    {
      "time": " Mon, 2005-05-23 19:26",
      "content": "_It does bother me that the spline control points in the FontLab Studio icon are wrong._\n\nMaybe they should have a font audit arrow in there somewhere. ;^D\n\n"
    }
  ]
}
