{
  "id": "12642",
  "title": "Sharptype has been updated to version 1.3",
  "forum": "Build",
  "tags": [

  ],
  "content": "Microworld Sharptype is a filter plug-in for Photoshop, it mainly concerns on generating ultra-clear type at small font size in Photoshop or any compatible host. Sharptype can provide far sharper type than the built-in Photoshop engine, which will improve your compositions’ readability dramatically. Sharptype is similar to Microsoft Cleartype and Adobe Cooltype, it uses a distinct method to render font, and does not use functional routines provided by operating system, and however, it optimizes vector information to sharpen the vertical and horizontal lines. Sharptype provides 5 rendering methods and 3 enhancing modes, and currently has support of Truetype and Opentype fonts. Flexible combination of bold, italic, underlined and outlined rendering styles, font preview, can search additional user defined font directory other than system default, built-in character map makes the insertion for figure fonts easier. Global encoding and native keyboard layout enable us to support multiple languages inside one unique version.\n\nV1.3 (23 May 2005)  \nNew slightly-fitted rendering arithmetic, which can provide better shape than grid-fitted;  \nNew LCD enhancing mode, which can provide clearer type for LCDs and mobile electronic manufactures,  \nit is similar to Microsoft Cleartype and Adobe Cooltype;  \nAdded LCD screen striping control for management of LCD enhancing mode;  \nFixed some bugs.\n\n| Attachment | Size |\n| --- | --- |\n| [screenshot\\_3.gif](http://web.archive.org/web/20060718193115/http:/typophile.com/files/screenshot_3.gif) | 31.68 KB |\n| [screenshot\\_4.gif](http://web.archive.org/web/20060718193115/http:/typophile.com/files/screenshot_4.gif) | 11.99 KB |\n\n",
  "author": "<a href=\"user/6467\" title=\"View user profile.\">evolrof</a>",
  "time": "<br>",
  "uid": "6467",
  "comments": [
    {
      "time": " 24 May, 2005 - 12:44am",
      "content": "[www.sharp-type.com](http://web.archive.org/web/20060718193115/http:/www.sharp-type.com/)\n\n"
    }
  ]
}
