{
  "id": "12653",
  "title": "Logo critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello,\n\nI created this logo for a client. It is a very upscale jewellery and watch store, that’s what is says on the tag line. The client wants the logo to look very elegant, but also modern. What do you think? Also, they suggested a script type similar to Cartier’s logo. Do you know a similar font?\n\nThanks,\n\nEdgardo\n\n| Attachment | Size |\n| --- | --- |\n| [logo.gif](http://web.archive.org/web/20060522215338/http:/typophile.com/files/logo.gif) | 2.26 KB |\n\n",
  "author": "<a href=\"user/7501\" title=\"View user profile.\">vivirenet</a>",
  "time": "<br>",
  "uid": "7501",
  "comments": [
    {
      "time": " 23 May, 2005 - 12:58pm",
      "content": "Check the kerning on the Initial C and the L, they seem a little tight.\n\n"
    },
    {
      "time": " 23 May, 2005 - 9:09pm",
      "content": "The type seems to be set to tight overall. Enlarging the last letter reduces the readability and seems little too tricky for something that is meant to be elegant and upscale. Does this typeface have smallcaps? If you do want to use larger cap letters for each word you either need real smallcaps or you need to work the two caps to fit with the stroke weights/widths of the smaller letters.\n\nAs this is for a high-end jeweler the typographer needs to be shooting for that, as I think it is starting to, before the viewer even reads the tagline.\n\nThe tagline is too tightly fit to the main wordmark. Instead of forcing that fit, perhaps you should work the letter-spacing looser and allow the tagline to float below it with more letter- and word-spacing as well. Or not. Simply centered or aligned differently. Think of Tiffany’s … no tagline. The color almost does the work. Granted they have years and years and a movie worth of history to back up their “brand” mystique, but that doesn’t mean you can’t aim for that with yours. I see the beginnings of this, but I think you could do more by not using fake small caps and working with the lettershapes and spaces.\n\n"
    },
    {
      "time": " 25 May, 2005 - 9:56am",
      "content": "I agree with Tiffany. The logo is alittle tight. I would increase the letterspacing. Maybe try a different font. Serif fonts always gives more elegant look while sans serif give a modern elegant feel. Try both.\n\nMost high end stores have a simple clean logo. If they have a tagline, its centered under the logo. The logo is kept simple.\n\n"
    }
  ]
}
