{
  "id": "12654",
  "title": "Winnipeg typophiles?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am curious to know if there are any Winnipeg typophiles on these forums. Or am I the only one? If you don't know what or where Winnipeg is, then you're definitely not one!\n\n",
  "author": "nepenthe",
  "time": "23 May 2005 — 1:29pm",
  "uid": "4886",
  "comments": [
    {
      "time": "23 May 2005 — 1:52pm",
      "content": "Hey! My 2 best friends are from Winnipeg. They just make fun of me for my type obsessions, however. But I'll ask them if know of any type-afflicted folks up in the desolate prairie lands of the Great White North.\n\n"
    },
    {
      "time": "23 May 2005 — 5:23pm",
      "content": "Awesome, thanks Nathan! I didn't think anyone here would even know about Winnipeg. Unless ... Nick S or John H, aren't you guys in Canada? Any chance either of you have any colleagues in town?\n\n"
    },
    {
      "time": "23 May 2005 — 6:54pm",
      "content": "Hi. It's funny you asked. I live in Brooklyn but we're moving to Winnipeg in the summer. I'm definitely looking to meet up with like-minded type/design folks. Where do you live in Winnipeg?\n\n"
    },
    {
      "time": "24 May 2005 — 5:31am",
      "content": "Zab Hobart is a mighty fine typographer practising in Winnipeg.  \nI don't think she frequents the boards.\n\n"
    },
    {
      "time": "24 May 2005 — 9:47am",
      "content": "You know what -- my friend Zena's father is the Dean of the art department at the University of Manitoba in Winter-peg. She said she'd ask him if he knew of anyone there who specialized in type. Though it'll be a while. He just got hitched for the 5th time, so he's in Gay Paree now. You crazy Canadians ;-)\n\nThanks for the Zab Hobart mention, Nick. I'll have to look her work up next time I head up to the Land of Black Flies the Size of Dogs.\n\n"
    },
    {
      "time": "24 May 2005 — 10:27pm",
      "content": "Thanks for talking to your friend, Nathan. It would be great if this query turns up anything. But black flies? Who told you that? They're called \"mosquitoes,\" but they are in fact the size of dogs ...\n\nNick, thanks for the tip about Zab. I can't find much about her online except that she is a graphic designer and an ATypI member. Does she have a studio here?\n\nAndrew, are you moving indefintely, or just for awhile? It is actually not bad here in the summer, but **watch out** for the winters! I actually live in Osborne Village now but will be moving closer to the University of Winnipeg mid summer, mainly because of the cold. (20 minute walks are nice in summer, but not in -30 windchills). Send me an email when you're going to be moving. It'll be nice to know someone else into type here in town.\n\n"
    },
    {
      "time": "5 Sep 2007 — 8:33pm",
      "content": "Nothing like better late than never. I've successfully relocated to Winnipeg, two years ago, from Brooklyn. It's good to be here; design and typography, specifically, are somewhat alive and relatively well here. Nepenthe, send me an email if you're still here. It would be nice to meet up.\n\n"
    }
  ]
}
