{
  "id": "12651",
  "title": "Advice needed for NEW DESIGNER of tried and tested rules of KERNING",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "As a typographer working in the field for less than a year I still have difficulty catching all the areas of kerning. I see there are allot of experts on this forum and any advise,rules you follow, experience would be greatly appreciated. I'm working mainly with letterheads, brochures and invites. An example...I recently designed a letterhead using Palentino and found I needed to kern spaces between the customers name which was set in 12pt and between a few letters. I assumed, before I was made aware by my manager, that fonts like Times, Palentino, Garamond in smaller point sizes didn't need much kerning..but I see I'm missing the idea. I usually kern type for design effects or when designing a logo. Many Thanks to all the Type Experts, I appreciate any TIPS!!!!\n\n",
  "author": "fontobsession",
  "time": "23 May 2005 — 12:25pm",
  "uid": "5299",
  "comments": [
    {
      "time": "23 May 2005 — 3:01pm",
      "content": "I'm not really a designer so beware but ...\n\n(1) Above all, look. Adjusting the space between letters is a matter of eye. You are aiming for something that _looks_ even. The human eye is a wonderfully acute instrument. Look at type around you and see what looks good and what looks bad.\n\n(2) I'm not sure if you really mean just kerning, or if you also mean \"tracking\" or letterspacing (especially in your reference to spaces in the customer's name). The conventional wisdom here is that lines in all caps or small caps often benefit from a little space, but that lowercase generally doesn't. Don't overdo it, though: you don't want to turn words into letters on a conveyer belt. And try to end up with something that looks even not only within a line but between lines of text on the same page: that means don't track one line a lot, and the next a little, and the last hugely.\n\n(3) With text-size type set without extra tracking, start from the assumption that the kerning built into the font will be OK. (Use f- ligatures where you have them.) Only adjust if you really need to. If you use InDesign, feel free to try out the optical spacing, and see if that solves your problem. Like a good doctor, reserve surgery for the serious cases. I'd be very chary of kerning \"between a few letters\" at text sizes.\n\n(4) If you are letterspacing it's more likely that you will need to make optical adjustments, aiming for an even line. The general aim is to try to produce even spacing between the letters. The problem letters tend to be those where, left unkerned you get large gaps. Consider the words LATTE and SLALOM. You can immediately see some of the problem areas: LA, AT, TT, LO naturally tend to have more space between them, because of the way the strokes fall than TE, SL, OM or AL. So you will probably want to compensate for that by putting a little more space between the close combinations.\n\n(5) Beware of overdoing it though. It's easy to get carried away, especially with combinations that seem like they could \"fit\" together (AV, VA, LT, AW, WA) and fit them too tight. Then you will get problem cases which you can't do that to, and lose the even-ness. Imagine you were trying to kern VAVOOM: the temptation to close up VAVO is great, but it may lead you into trouble with OOM. (Some fonts have special sorts like an OO ligature where the Os overlap for precisely this reason.)\n\n(6) The problems will be different in different fonts: if M has straight sides it behaves differently from an M that has a slant to its legs, ditto with W. Some Rs have long tails, some have short ones. The hardest words are always those which combine \"naturally\" tight combinations (HI) with naturally loose ones (RA, TA, LA). Practice with potentially troublesome words and phrases (THE LATIN HILLY POTATO RAVINE).\n\n(7) With small type, be especially cautious. Metal type had almost no kerning as such, but it still looked good. In small sizes combinations like Vo and Va often don't need kerning, and as many efforts at spacing are destroyed by over- as by under-kerning. I'd generally set this as it comes out of the box. It's only when you think the type is really going to be \"looked at\" rather than read that you need to go by hand.\n\n(8) In every case, the adjustments you are making are likely to be much too fine to make on screen. You have to print it out, on the best printer you have, and then look at it, decide what adjustments you need to make, and do it again. They human eye can detect tiny adjustments (1/2pt or so), which is really amazing.\n\n(9) Dowding's \"Finer Points on the Spacing of Type\" is a useful book on this sort of typographical detail. Many books on typographical subjects also include illustrations of title pages and so forth set by people like Tschichold and Smoller: sometimes with examples of proofs where they were adjusting the spacing (add 1/2 pt here etc). Looking at these is very informative.\n\n"
    },
    {
      "time": "24 May 2005 — 12:02pm",
      "content": "Thank you taking the time to inform me on the details of type spacing..I'm excited to experiment with the word and letter combinations suggested. I'm also going to buy the book by Dowding's.\n\n"
    },
    {
      "time": "26 May 2005 — 3:32am",
      "content": "I found that very useful.\n\n"
    },
    {
      "time": "26 May 2005 — 6:59am",
      "content": "A useful way of viewing your type is to print it on a laser printer at the intended final size and view it upsidedown, fooling your eyes into looking at the blacks and whites rather than reading the letters. You can also squint at the document/screen to blur the type and the spaces become more obvious.  \nTim\n\n"
    }
  ]
}
