{
  "id": "12669",
  "title": "Typing with accents",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I never learned how to type certain accents over letters. I have a client that needs the macron (I just found out its name) accent ' ¯ ' over the letter ' e ' but most fonts have premade é characters only as the closest (and incorrect) equivalent. I know that the accent is included, but aside from typing the ' \\< ' key while holding down the Shift and Option keys on a Mac to get the accent by itself, I don't know how to get this accent over the vowel.\n\nCan someone tell me how to do this? I learned page layout programs by myself in the 90s as I finished graphic design back when we still did paste-up, so I'm feeling rather unsophisticated about how to use accent features. But I figure I'd rather ask for help than go dumb - it's an accent I need for a particular client whose name is always mispronounced.\n\nAdditionally, since many fonts have pre-made letters with accents, is this something that would be better off with a specific letter e with the macron already pre-placed? It will always be used with this client, and I'm not sure if larger display layouts would represent the best application of the accent.\n\nAny help would be greatly appreciated.\n\n| Attachment | Size |\n| --- | --- |\n| [macron\\_e.gif](http://web.archive.org/web/20140923080404/http:/typophile.com/files/macron_e.gif) | 413 bytes |\n\n",
  "author": "bakla",
  "time": "24 May 2005 — 8:33am",
  "uid": "4309",
  "comments": [
    {
      "time": "24 May 2005 — 9:03am",
      "content": "Sorry, typophile newbie here, and not sure how to view the full post I submitted as I'm only seeing the trimmed version (even if the full version shows up when i try to edit it). Any assistance navigating the forum workings would be appreciated.\n\n"
    },
    {
      "time": "24 May 2005 — 9:36am",
      "content": "Bakla, I edited your post for you. There is a bug in the system. Ok, not a bug. If you use ' \" ' followed by ' \\< ' it instantly watches for the rest of the code as if you were formatting something. I removed the \" and replaced them with ' so you can now see you entire entry. Now maybe someone can help with your question.\n\nYour problem has nothing to do with being a newbie. Glad you are here and joining in the discussions.\n\n"
    },
    {
      "time": "24 May 2005 — 10:05am",
      "content": "If you're using Quark, a simple -- if somewhat inelegant solution -- is to type the e followed by an \\_underscore. Select the underscore, then shift the baseline up the equivalent of 83% (five-sixths) of the point size you are using (more or less, depending on the typeface), and use negative tracking to place the underscore over the e. Crude, but effective.\n\n"
    },
    {
      "time": "24 May 2005 — 8:24pm",
      "content": "If you're using InDesign or Illustrator, go to Type ; Glyphs and double click on the letter you want (in this case the ē) and it should appear in your text box.\n\nNot all fonts will have this character though - I found it in Myriad Pro. though\n\n"
    },
    {
      "time": "24 May 2005 — 10:28pm",
      "content": "Thanks for the assist, Tiffany. And thanks oldnick and chad. I'm using Tstar specifically for this client, and the font has the accents as separate keystrokes (including the macron), but I just don't know how to apply them to specific letters. Oldnick, your solution sounds like a creative stopgap measure in case I don't learn how to apply those accents. Chad, unfortunately, I use Quark Express a lot, and the glyph function isn't available in this program to my knowledge. Sadly, even in Illustrator, I couldn't get the glyph item in the Type menu to highlight with Tstar, so I'm still at a loss. Maybe someone will know exactly how this is done...\n\nIn the meantime, I've emailed the font designer for assistance. Hopefully he can help.\n\n"
    },
    {
      "time": "25 May 2005 — 6:26am",
      "content": "For now you can copy and paste this one: ē  \nAnd here's the capital: Ē\n\nēēēēēēē  \n Ē Ē Ē Ē Ē Ē Ē\n\n"
    },
    {
      "time": "25 May 2005 — 7:07am",
      "content": "In Quark, another inelegant answer, type the macron as you say above and the vowel following and kern the one under the other (approximately -80) at least you won't have to baseline shift each time, if you have an i to do the dotless i is option shift b. I tried Chad's copy and paste but got an umlaut over an i and circumflex over i.  \nTim\n\n"
    },
    {
      "time": "26 May 2005 — 11:40am",
      "content": "Actually, you can't copy and paste that letter into QuarkXPress from the web page. Even the \"Passport\" version of QXP that supports old single-byte CE encodings still doesn't speak Unicode.\n\nT\n\n"
    },
    {
      "time": "26 May 2005 — 11:51am",
      "content": "you know one of my instructors keeps telling us he prefers Quark over InDesign because of its typographic features – what features?\n\n"
    },
    {
      "time": "28 May 2005 — 8:41pm",
      "content": "Chad,\n\nAdmittedly, working for Adobe (and with the InDesign team half my time), I am surely biased. But typography features are one area where InDesign has been ahead of QuarkXPress since day one, and that gap has only widened with time. People can like Quark's interface better, or be happier with some particular features, but I can't imagine somebody who is honestly familiar with both programs arguing that QuarkXPress has better typographic features.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "29 May 2005 — 2:06am",
      "content": "Another slightly more elegant solution could be to make a kerning pair for macron+e in each font you need for the job.  \nTim\n\n"
    },
    {
      "time": "29 May 2005 — 12:09pm",
      "content": "Bringhurst says that you can remap your keyboard to allow access to any accents available in unicode fonts, but I have yet to discover how this is possible. It seems strange to me that in TeX (which is over 20 years old) all accents are readily accessible, but in modern software you have to go to a glyph palette to do this. For example, for e+macron in TeX you just type \\={e} which is so much easier than locating a glyph from a palette or character map; but then, font installation and graphics in TeX are not exactly intuitive...\n\n"
    },
    {
      "time": "29 May 2005 — 12:23pm",
      "content": "I just found [this](http://web.archive.org/web/20140923080404/http:/www.microsoft.com/downloads/details.aspx?FamilyId=FB7B3DCD-D4C1-4943-9C74-D8DF57EF19D7&displaylang=en) on Microsoft's website. I haven't tried it yet, but it might do the trick.\n\n"
    },
    {
      "time": "29 May 2005 — 2:54pm",
      "content": "Timd, that sounds like a great solution for now! Thanks!\n\nIn a way, I'm kinda glad that no one really knows the perfect way to type this accent in properly - it makes me feel less inept! I was under the impression that it was something I was just unaware of, especially in a typographic forum like this one, where I imagine people who create fonts would know all the keystrokes to type them.\n\ntphinney, I'm anxiously looking forward to trying out InDesign. After waiting for my printers to begin supporting it, and after much positive feedback about it, my loyalties to Quark are wavering. I've avoided upgrading to OSX until now specifically because Quark Xpress was still buggy on all my fellow Art Directors computers, despite Quark's upgrades to supposedly make them OSX native (although I hear 6.5 is better). After using Quark Xpress for over 12 years, I'm so used to it that I didn't want to relearn a new program, but methinks now is the time. Hell, if I didn't go with the flow, I'd probably still be using Syquest disks when sending things to the printers! ;)\n\nNepenthe, since I'm on a Mac, the Windows link you presented doesn't help me. But thanks all for the suggestions and info so far.\n\n"
    }
  ]
}
