{
  "id": "1266",
  "title": "GGrapidograph",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "i made this font - a oneline font to get easy the weights from ultra thin to extrabold. for the moment, there are just the illustrator drawings, no kerning - no spacing. i just want to hear some opinions about the forms, and the mood of the alphabet.   \n ![GGrapidograph_reg.gif](http://web.archive.org/web/20150414205043im_/http:/www.typophile.com/forums/messages/29/1612.gif)\n\n",
  "author": "guerillagrafik",
  "time": "1 Jul 2002 — 4:54am",
  "uid": "933",
  "comments": [
    {
      "time": "3 Jul 2002 — 7:32pm",
      "content": "Even though the face repeatedly uses some obvious devices it still lacks unity. I think the error lies not in the forms themselves, but in the counterforms they create. For example the negative space around the k has no relationship to anything else. The g has similar problems. The extension on the M also causes some awkwardness. The 5 and the G also demonstrate the same idea. While it is obvious the device used to create them, the resulting counterforms are completely inconsistent with the rest of the face.   \n   \nAnother note: the tails on the lc letters feel like they are floating. Try decreasing the angle of the slant and lengthening them.\n\n"
    },
    {
      "time": "4 Jul 2002 — 4:45am",
      "content": "christian   \nit seems, that you think my typeface is kind of crap. but your critique was really helpful to me and i'm willing to finish the typeface anyway.   \n   \nso i change quite a lot. the lower case g and k were really strange in the kontext of a text. so i changed them to another mood.   \nalso the slants of the lc letters a,b,d,u i changed so they reach the baseline. the slants of m,n,p,q,r i leave the same as they are.   \n   \nwhat do you think   \n ![GGrapid_fine.gif](http://web.archive.org/web/20150414205043im_/http:/www.typophile.com/forums/messages/29/1623.gif)\n\n"
    },
    {
      "time": "4 Jul 2002 — 5:33am",
      "content": "Thom -- I think you're going in the right direction with this typeface. The only aspect that I find jarring are the ears, such as on the r and m. For me, this is a very smooth font and I don't believe the ears add any readability. Anyone else agree or disagree?\n\n"
    },
    {
      "time": "4 Jul 2002 — 5:51am",
      "content": "I agree. Btw, it has an eerie familiar feeling. Anyone used those plastic stencils... uhm, hard to explain. Looks like those though, I like it.   \n   \nBtw, the new \"k\" is a huge improvement.\n\n"
    },
    {
      "time": "4 Jul 2002 — 6:01am",
      "content": "john   \n   \ni agree with you, that this is a smooth font. it was just the intention to get a bit of originality what makes me doing these ears. otherwise i'm afraid this typeface is too techno. i wanted to get a bit of a typwriter mood in it.   \ndo you think these ears are disturbing the other fletters?   \n   \nand john - what do you think lc \"a\". i have the impression it is a bit too wide, perhaps it should be a bit more condensed..?   \n(sorry about my lousy english)   \n ![Det_lcA.gif](http://web.archive.org/web/20150414205043im_/http:/www.typophile.com/forums/messages/29/1624.gif)\n\n"
    },
    {
      "time": "4 Jul 2002 — 8:42am",
      "content": "I think this a very subtle font.   \n   \nDid you try to use round ears?   \n   \nWhat about a solution for your 'k', which is between the 2 samples you've shown us?   \nI made a little flash-image to show you what I mean.   \n   \nJacques\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414205043im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">kkk.swf<br><a href=\"http://web.archive.org/web/20150414205043/http:/www.typophile.com/forums/messages/29/kkk.swf\"><b>kkk.swf</b></a> (&lt;1 k)</td></tr></table></center>!-/attachment-!\\>!-attachment:\\> \n"
    },
    {
      "time": "4 Jul 2002 — 10:14am",
      "content": "Sorry if I sounded harsh. I try to say it as I   \nsee it. I do think the face has some good stuff   \ngoing on. I also think you are heading in the   \nright direction. Now all you need is something to   \nmake the face stand out from all of the other   \nlineal geometrics out there.   \n   \nI actually think that the ears are a start in that   \ndirection. When set in copy I think they give the   \nface a unique feel. They still feel a little abrupt,   \nbut I think they are the key. Is there a subtle way   \nto incorporate the feel of the ears' kinked line   \nother places in the face (like the caps)? For   \nexample, what if the arm of the E and the F were   \nto bend slightly? I'm just throwing out ideas now.   \nGood job. Keep it up (I don't think that it is crap.   \nJust a work in progress ![:)](http://web.archive.org/web/20150414205043im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "5 Jul 2002 — 5:02am",
      "content": "allright - thanks to everybody. it is good to get critique for workin hard. i'm still sitting behind the face, and made some experiments, about the ears, and found with it also a solution to change the general form - just a little bit, but with this changement, i think, i found perhaps a way to make my GGrapidograph stand out from all the other linear geometric faces out there - like christian said.   \n   \ni hope you guys are still helping me to develop my font to a good end, so i can finish it, and agree with it.\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414205043im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">GGrapidograph03.swf<br><a href=\"http://web.archive.org/web/20150414205043/http:/www.typophile.com/forums/messages/29/ggrapidograph03.swf\"><b>ggrapidograph03.swf</b></a> (8 k)</td></tr></table></center>!-/attachment-!\\>!-attachment:\\> \n"
    },
    {
      "time": "5 Jul 2002 — 5:23am",
      "content": "I suggest a merge between the lowest samples (nr 4) and the ones at the top. Just a small bend on the tails (?) would be good...\n\n"
    }
  ]
}
