{
  "id": "12674",
  "title": "Adobe Reader fonts",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "As some people know, Adobe Reader 7 comes with Minion Pro and Myriad Pro typefaces. What exactly are the limitations on the usage of these font files? Can I use them for whatever I want as long as they stay on the computer where I installed Adobe Reader?\n\n(No, I'm not going to read any EULAs.)\n\n",
  "author": "hankzane",
  "time": "24 May 2005 — 10:08am",
  "uid": "2064",
  "comments": [
    {
      "time": "28 May 2005 — 5:15am",
      "content": "sergej wrote:\n\n<cite>(No, I’m not going to read any EULAs.)</cite>\n\nI have read it (although the German version), and one section made me wondering:\n\n<cite>2.5 No modification. […] You are not authorized to integrate or use the Software with any (a) plug-in software not developed in accordance with the Adobe Integration Key License Agreement or (b) other software or enhancement to programmatically interface with the Software for the purpose of (i) saving data locally (on the same Computer), except when allowed through the use of Document Feature(s) that have been activated using enabling technology from Adobe, (ii) creating a file that contains data (e.g., an XML or comments file), or (iii) saving modifications to a PDF file.</cite>\n\nDoes a desktop publishing system that generates PDF files (with the included fonts) _programmatically interface_ with the Adobe Reader?\n\nBy the way: Did someone compare the included fonts with their commercial counterparts? I remember that one version of the Microsoft Reader came with Frutiger but this included font had a very bad kerning (if at all) so it was quite useless outside this application.\n\nGunther\n\n"
    },
    {
      "time": "28 May 2005 — 8:43am",
      "content": "The mumbo-jumbo you quote is why cannot be bothered with EULAs. I take it for granted no modification is allowed, but I don't consider that usage so it doesn't matter in this case. I want to know whether I can publish a book using the included fonts, for example. Is anyone going to stop me?\n\n"
    },
    {
      "time": "24 Jun 2005 — 8:01am",
      "content": "This business of high quality fonts bundled with Acrobat Reader 7.0 has set me wondering. I do not like mumbo-jumbo any more than Sergej, but I thought it worth a look, in case it is OK to use the bundled fonts in the normal way.\n\nWhen I first installed Acrobat Reader 7.0 on Linux, it was a pre-release version or something, available on an Adobe ftp site, but not through their usual download area. This version had a short license agreement about the fonts, as below:  \n<cite><br>\nThe font software contained in this package is being licensed to you solely<br>\nfor use with the Adobe Acrobat Reader product (\"Acrobat Reader\") subject to<br>\nthe terms and conditions of the Electronic End User License Agreement<br>\naccompanying the Acrobat Reader.<br>\n</cite>  \nI assumed from this that you are not allowed to use the fonts in any other application, so I did not make them accessible to my other applications. I did not read the main EULA.\n\nSince the first install, my Linux distribution has packaged Acrobat Reader 7.0, and I am now using the packaged version. I looked for the font license, to post it here, but I could not find it. I had an old system with the original Acrobat installation on it, and copied the license stuff from there. Having read the old EULA, it looked as if it was OK to distrubute the fonts to others by embedding. You could also distribute the fonts to, say, a print company, provided they have a valid license for the fonts. These are the clauses about the fonts:  \n<cite><br>\n2.6. Font Software. If the Software includes font software -<br>\n2.6.1. You may Use the font software as described above on the Permitted Number<br>\nof computers and output such font software on any output devices connected to<br>\nsuch computers.<br>\n2.6.2. If the Permitted Number of computers is five or fewer, you may download<br>\nthe font software to the memory (hard disk or RAM) of one output device<br>\nconnected to at least one of such computers for the purpose of having such font<br>\nsoftware remain resident in the output device, and of one additional such<br>\noutput device for every multiple of five represented by the Permitted Number of<br>\ncomputers.<br>\n2.6.3. You may take a copy of the font(s) you have used for a particular file<br>\nto a commercial printer or other service bureau, and such service bureau may<br>\nUse the font(s) to process your file, provided such service bureau has a valid<br>\nlicense to Use that particular font software.<br>\n2.6.4. You may convert and install the font software into another format for<br>\nuse in other environments, subject to the following conditions: A computer on<br>\nwhich the converted font software is used or installed shall be considered as<br>\none of your Permitted Number of computers. Use of the font software you have<br>\nconverted shall be pursuant to all the terms and conditions of this Agreement.<br>\nSuch converted font software may be used only for your own customary internal<br>\nbusiness or personal use and may not be distributed or transferred for any<br>\npurpose, except in accordance with the Transfer section below.<br>\n2.6.5 You may embed the font software, or outlines of the font software, into<br>\nyour electronic documents to the extent that the font vendor copyright owner<br>\nallows for such embedding. The fonts contained in this package may contain both<br>\nAdobe and non-Adobe owned fonts. You may fully embed any font owned by Adobe.<br>\nRefer to the font sample sheet or font information file to determine font<br>\nownership. See the Documentation for location and information on how to access<br>\nthese sheets and files.<br>\n</cite>  \nThis appears much more permissive than I had assumed.\n\nThe new EULA says very little about the fonts. They are mentioned in the list of stuff that constitutes the Software, but there are no specific clauses about embedding, printing, etc. The only bits that look relevant say:  \n<cite><br>\n...\"Use\" or \"Using\" means to access, install, download, copy or otherwise benefit from using the functionality of the Software in accordance with the Documentation.<br>\n...<br>\n2. Software License. As long as you comply with the terms of this Software License Agreement (this \"Agreement\"), Adobe grants to you a non-exclusive license to Use the Software for the purposes described in the Documentation.<br>\n</cite>  \nTrouble with this, I cannot find anything about the bundled fonts in the documentation, which I assume means the user manual available within Acrobat.\n\nAnybody know the score here? Is Adobe really giving away 8 fonts that would normally cost $35 a pop?\n\n"
    }
  ]
}
