{
  "id": "1268",
  "title": "Cross-border relations",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Has there ever been such a thing as a British Isles typeface?   \n   \nIn other words, a typeface that reflects the whole of the British archipelago, rather than the individual countries/nations (Ireland, England, Scotland, Wales, etc) that make it up.   \n   \nMatha\n\n",
  "author": "matha_standun",
  "time": "12 Sep 2003 — 12:47pm",
  "uid": "1352",
  "comments": [
    {
      "time": "12 Sep 2003 — 1:26pm",
      "content": "Caslon\n\n"
    },
    {
      "time": "12 Sep 2003 — 1:35pm",
      "content": "Why Caslon ?\n\n"
    },
    {
      "time": "12 Sep 2003 — 2:26pm",
      "content": "Fredrik, why?   \n   \nCould: I think many fonts do indeed have a certain ethnic/geographical character.   \n   \nShould: Nationalism doesn't have to be bad. And sometimes it's the only tool for a culture to survive the massive attack of Capitalism. I agree that a British type isn't something that needs to worry us too much (unless -like I suspect Matha- we need it as something to _counter_), but maybe a Serbian one (like Sava\\*, which I just found out about) does deserve [positive] attention?   \n   \n\\* [http://www.adobe.com/type/browser/P/P\\_1506.jhtml](http://web.archive.org/web/20131020083611/http:/www.adobe.com/type/browser/P/P_1506.jhtml) (The Cyrillic component, and maybe the rest too.)   \n   \nhhp\n\n"
    },
    {
      "time": "12 Sep 2003 — 3:06pm",
      "content": "\"The mere notion that a typeface in any way could or should reflect a country or any area whatsoever is preposterous.\"   \n   \nUpdike's and McLean's studies of historical typeface development would seem to indicate the very opposite.\n\n"
    },
    {
      "time": "13 Sep 2003 — 2:21am",
      "content": "_preposterous..._   \n   \nA very dramatic word that, Fredrik. You need to be standing, handcuffed in a courtroom to get the full effect, though. Otherwise, I think it's a bit strong.   \n   \nAs to a typeface reflecting a country, I think that if it's used for printing practically everything in a particular geographical area or if it's used nowhere else, we would certainly be tempted to associate the place with face.   \n   \nFor a certain number of people, Gaelic typefaces reflect Ireland. Caslon was the typeface used for official publications of the British government and at one stage was used for nearly everything else too (I think).   \n   \nDid it enjoy the same popularity in Ireland as in mainland Britain? Did it manage to get into the corners of Scotland? I don't know.   \nCould we call it an Anglo-Saxon typeface rather than a British Isles one? I'm thinking of its use in America.   \n   \nMatha\n\n"
    },
    {
      "time": "13 Sep 2003 — 3:10am",
      "content": "_unless -like I suspect Matha- we need it as something to counter.._   \n   \nThat wasn't the direction I was heading in, Hrant. I was thinking more about the positive things that the different cultures of the British Isles have in common. We've been living together for long enough, something must have rubbed off.   \n   \nMatha\n\n"
    },
    {
      "time": "13 Sep 2003 — 4:14am",
      "content": "Strictly geographical or state-based typography may be a red herring. But typography that reflects culture is, of course, very much a part of our world.   \n   \nBritain, being a union of several countries and even more cultures (in England, Cornish culture is still identifiably different to, say, Tyneside culture), would find it difficult to be identified by one typeface.   \n   \nPut it this way. Ask any visitor to the UK who has travelled around the various countries and regions about (aural) accents, and you begin tog et a flavour for just how varied the regions and cultural bases are.\n\n"
    },
    {
      "time": "13 Sep 2003 — 4:55am",
      "content": "No need to be excused, Fredrik. I tend to exaggerate myself.   \n   \nDavid, I agree that the British Isles are overflowing with different cultures and accents but don't forget that we've all been communicating with each other for centuries in English.   \nI think a typeface could reflect that link.   \n   \nMatha.\n\n"
    },
    {
      "time": "13 Sep 2003 — 3:07pm",
      "content": "To me, a face representing the UK would be Gill Sans. Especially considering the BBC uses it for everything.\n\n"
    },
    {
      "time": "13 Sep 2003 — 3:23pm",
      "content": "That's an interesting approach to the question, Chris.   \nThe BBC's audience isn't just restricted to UK either. It reaches most of the Republic of Ireland too and is certainly something that links the whole archipelago.   \n   \nMatha\n\n"
    },
    {
      "time": "13 Sep 2003 — 3:33pm",
      "content": "Mind you, there's no Irish equivalent of BBC Northern Ireland.   \n   \nM.\n\n"
    },
    {
      "time": "14 Sep 2003 — 2:35pm",
      "content": "I think Jonathan Barnbrooks fonts have something very British about them.   \n   \nJim   \n===\n\n"
    },
    {
      "time": "14 Sep 2003 — 5:46pm",
      "content": "Mostly, any shared culture in the UK has come from the colonial capital, London, and that would certainly be true in the bulk of the 20th century, when the dominant fonts were made for Linotype and Monotype machines. So, that means Times and Gill Sans.   \n   \nHowever, during much of the 19th century, Scotland was a stronger cultural player than subsequently (on the world scene, too).   \n   \nSo perhaps the 19th century \"Scotch Roman\", which was influential on a lot of London founders, makes the \"Modern\" style that was so dominant in that century (and for the first decade of the 20th) a better candidate to represent more than just London.   \n   \nIt must be said, however, that this style became popular throughout the English speaking world -- the US and the Empire, so it lacks an exclusive UK association.\n\n"
    },
    {
      "time": "15 Sep 2003 — 12:37pm",
      "content": "_Mostly, any shared culture in the UK has come from the colonial capital, London, and that would certainly be true in the bulk of the 20th century._   \n   \nI wouldn't go that far, Nick. The shared Culture of the British Isles is more about internal migration than anything else. The non-stop movement of enormous numbers of people between Ireland and mainland Britain (and between Scotland and the North Eastern corner of Ireland in particular) has been going on for thousands of years.   \n   \nAns don't forget that 25% of Britons have at least one Irish relative.   \nWho's been colonising who?   \n   \nMatha\n\n"
    },
    {
      "time": "15 Sep 2003 — 12:45pm",
      "content": "\\>A very dramatic word that, Fredrik. You need to be standing, handcuffed in a courtroom to get the full effect, though.   \n   \nI love the visual: \"...and yet, it still kerns!\"\n\n"
    },
    {
      "time": "17 Sep 2003 — 10:55am",
      "content": "OK, so I thought the above was pretty damn funny, but nobody responded and I started to wonder. I googled \"Galileo\" and \"inquisition\", and found out that I had totally mis-remembered what he said when he \"...raised his voice against the ignorance of the Middle Ages.\" I thought it was \"And yet, it still turns,\" but it really was \"And yet, it moves.\"   \n   \nSo, instead of rhyming with \"kerns\" and being clever, it's just stupid ... and totally off-topic, to boot.   \n   \nI'm going into the corner to eat kerns.\n\n"
    },
    {
      "time": "17 Sep 2003 — 11:18am",
      "content": "Jay,   \n   \nFeed us full of coffee and other lovely stimulants the next time and we'll do our best.   \n   \nHe didn't say it in English, after all. I'm sure \"And yet, it moves.\" is only one possible translation. You may well have come across \"And yet, it still turns,\" somewhere else and remembered that.   \n   \nYou can come out of the corner and rejoin the class.   \n   \nM.\n\n"
    }
  ]
}
