{
  "id": "12698",
  "title": "2 sans sereif typefaces in a magazine?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "okay, would it make you puke if, say, a magazine which in the past has used helvetica nueu exclusively started using a different sans serif for titles and pull quotes?\n\n",
  "author": "Thousand Leaves",
  "time": "25 May 2005 — 10:26am",
  "uid": "7536",
  "comments": [
    {
      "time": "25 May 2005 — 11:24am",
      "content": "Depends on what it looks like. Seeing is believing.\n\nChrisL\n\n"
    },
    {
      "time": "25 May 2005 — 11:54am",
      "content": "No. I actually rebelled when Harper's Bazaar, which was using mostly Didot switched to sans. But, then I warmed to it. I really was sad when they switched back to Didot. It seemed a great way to liven the entire line of Bazaar's up. That magazine has not been the same since Liz Tilberis (RIP) passed away. Photography is still brillliant, but the design has repeatedly fallen short. IMHO.\n\nSo. I see no reason why a magazine cannot change as long as it is for the better.\n\n"
    },
    {
      "time": "25 May 2005 — 1:34pm",
      "content": "i think certain magazines should change, hell, every mag could use a lift once in a while. and i tend to think that it would be okay for me to mix two sans's but i'm not sure how to do it. i was thinking about using Interstate (all caps) for titles and pull quotes and leaving the text helvetica but i'm a bit leery about using two overexposed, lower quality typefaces together. i do like the way Interstate looks all caps, though.\n\n"
    },
    {
      "time": "25 May 2005 — 3:15pm",
      "content": "When I was young and daring, I used Interstate in conjunction with Agenda. Interstate did the heavy work while Agenda was strictly in the text. I'm not sure if I should be admitting such a combination but it still seems to work in an odd sort of way.\n\nMixing sans is a difficult thing to do. I think either (A) they both have to be of the same lineage, i.e. Humanist, Grotesque, Geometric; or (B) the title face needs to be more geometric or grotesque and the text face needs to be very humanist. This is only a theory. I hope others respond to this as I'd be interested in others opinion.\n\nYou are right. Magazines should not become stale.\n\n"
    },
    {
      "time": "25 May 2005 — 3:25pm",
      "content": "i've had similar thoughts on the matter. which brings me to another question, if i can do some hard convincing and change the typeface of the body text, what typeface would you recommend as an alternative. i've always been partial to news or trade gothic but i would love to be exposed more typefaces.\n\n"
    },
    {
      "time": "25 May 2005 — 5:10pm",
      "content": "How much text are you setting with a sans? Just out of curiosity?\n\nYou might consider a grittier sans such as [Sophisto or Stalemate](http://web.archive.org/web/20131018054915/http:/www.macrhino.com/) for the heads, captions, callouts and other things.\n\nI find that magazines which do use all sans tend to have difficulty setting forth a clear hierarchy. One important factor to consider is contrast. One obvious way to include contrast is sans versus serif. With using only sans you elimate that.\n\n"
    },
    {
      "time": "26 May 2005 — 10:40am",
      "content": "i hear you, but this magazine has to be all sans. on top of that, the publisher is tough and doesn't trust anybody's opinion. so if i want to make things better i'll have to do it without a lot of fanfare. those typefaces are nice but i'm thinking classic geometric with less contrast. also, i'm setting anywhere from 200-1200 words.\n\n"
    },
    {
      "time": "26 May 2005 — 11:31am",
      "content": "I have difficulty thinking of a sans that I'd be willing to read an entire magazine in. I pick up such magazines at the newsstand, take a look, and put them back down. To me, such publications are saying \"we're more concerned with our image than whether you are comfortable reading our publication.\" To which I say \"fine, I'll take my readership elsewhere.\"\n\nThat being said, if you want to mitigate that tendency as much as possible, a good humanist sans would help a bit.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "26 May 2005 — 11:40am",
      "content": "\\> I have difficulty thinking of a sans that I’d be willing to read an entire magazine in.\n\nThere is one. Legato.  \nHuman, without being a cloying humanist.\n\nhhp\n\n"
    },
    {
      "time": "26 May 2005 — 11:46am",
      "content": "haha, it just so happens i'm working at just that type of magazine. i wish i could just use a serif.\n\n"
    },
    {
      "time": "26 May 2005 — 2:39pm",
      "content": "let me be redundant. does it absolutely have to be geometric? if it doesn't you will do better with a humanist or grotesque sans.\n\n"
    },
    {
      "time": "26 May 2005 — 6:38pm",
      "content": "I would look at [Amira](http://web.archive.org/web/20131018054915/http:/fontbureau.com/fonts/Amira). I haven't seen it in use but it has a modulation of stroke that I suspect will make it work more like a serif.\n\n"
    },
    {
      "time": "27 May 2005 — 4:01pm",
      "content": "Legato aint all that. (Not to dis' Mr. Bloemsma) but it's like Optima - only it's better than Optima. Ugg. If I want a sans to perform like a serif, I'll just use a serif!\n\n"
    },
    {
      "time": "27 May 2005 — 4:15pm",
      "content": "Let me see if I can post a retraction before Stephen Coles chastises me. =)\n\nThe comparison to Optima is off... Apologies for that. Legato is successful at what it set out to do... But I still don't think it's _all that_.\n\nNow, if I wanted a Gill Sans alternate, I'd turn to Legato every time.\n\n"
    },
    {
      "time": "27 May 2005 — 5:01pm",
      "content": "It is [Natural Health](http://web.archive.org/web/20131018054915/http:/www.fontbureau.com/fonts/Amira/more) magazine which uses it, William. Good suggestion.\n\n"
    },
    {
      "time": "27 May 2005 — 7:59pm",
      "content": "Natural Health \\*used\\* to use Amira -- they've already redesigned their not-so-recent redesign! There's still some residual Amira on their [web site](http://web.archive.org/web/20131018054915/http:/www.naturalhealthmag.com/), but not in print. I think The Sans took its place...\n\nAnyway, to comment on T. Leaves question: If you can swing it, spring for a humanist sans with a wide range of weights, and use the extremes in display settings (e.g. extra light or black) to introduce the contrast you're after. [Whitney](http://web.archive.org/web/20131018054915/http:/www.typography.com/catalog/whitney/index.html) comes to mind.\n\n"
    },
    {
      "time": "27 May 2005 — 10:22pm",
      "content": "Joe, what do you think Legato sets out to do?\n\nhhp\n\n"
    },
    {
      "time": "27 May 2005 — 11:52pm",
      "content": "I quite agree that you can't read an magazine with sans serif fonts.  \nThe text becomes quite difficult to read and hard on the eyes.  \nI feel, Types like Optima it is okay.  \nBut on the whole it should be a combination of Serif & Sans for a magazine.\n\n"
    },
    {
      "time": "28 May 2005 — 1:12am",
      "content": "This: [http://www.evertbloemsma.nl/legato/about\\_legato/about\\_legato.asp](http://web.archive.org/web/20131018054915/http:/www.evertbloemsma.nl/legato/about_legato/about_legato.asp \"http://www.evertbloemsma.nl/legato/about\\_legato/about\\_legato.asp\")\n\n"
    },
    {
      "time": "28 May 2005 — 2:05pm",
      "content": "_Natural Health \\*used\\* to use Amira — they’ve already redesigned their not-so-recent redesign! There’s still some residual Amira on their web site, but not in print. I think The Sans took its place…_\n\nA very strange step backwards.\n\n"
    },
    {
      "time": "28 May 2005 — 3:20pm",
      "content": "Amira is not to my taste, so I wasn't sorry to see it go. The Sans is an inoffensive but relatively unimaginative replacement.\n\n"
    },
    {
      "time": "28 May 2005 — 5:40pm",
      "content": "Just a few suggestions:  \n [Body Copy Sans Pro](http://web.archive.org/web/20131018054915/http:/www.myfonts.com/fonts/bergsland/body-copy-sans-pro/)  \n [URW Classico](http://web.archive.org/web/20131018054915/http:/www.myfonts.com/fonts/urw/classico/)\n\nI really hope this isn't a trend - I'm going to have a hard enough time reading 10-11pt type when I'm old, even more so if its all sans.\n\n"
    },
    {
      "time": "29 May 2005 — 12:20am",
      "content": "_\"Mixing sans is a difficult thing to do. I think either (A) they both have to be of the same lineage, i.e. Humanist, Grotesque, Geometric\"_\n\nI though the whole point of the \"don't mix sans with sans\" rule was that fonts with a common lineage tend to clash. The small differences between them will subconsciously be seen as mistakes, while two very different fonts would establish contrast.\n\nSo my advice is not to mix sans unless they are very obviously distinct.\n\n"
    },
    {
      "time": "29 May 2005 — 12:24am",
      "content": "So Joe, what do you have against Legato, exactly? For a text face, what's more important than to \"build proper word and line images\"? And if you believe Bloemsma about that, and you consider **how** it's supposed to be doing that, then it sort of follows that no other font (certainly no other sans) does this, so...\n\nAmira: I have a lot of trouble liking it.\n\nhhp\n\n"
    },
    {
      "time": "29 May 2005 — 3:21am",
      "content": "_I though the whole point of the “don’t mix sans with sans” rule was that fonts with a common lineage tend to clash. The small differences between them will subconsciously be seen as mistakes, while two very different fonts would establish contrast._\n\nSo my advice is not to mix sans unless they are very obviously distinct.\n\nI disagree -- I often perform experiments against all those tried and true golden rules, and the \"never mix sans unless they are very obviously distinct\" doesn't hold up if you know what you're doing. I redesigned a large format magazine combining FF Meta with FF Info and it looked perfectly fine. Agreed, it takes some more effort and thinking through to pull it off, but that shouldn't stop you.\n\n"
    },
    {
      "time": "30 May 2005 — 9:07am",
      "content": "i hope i don't sound too ignorant, but humanist sans are not really to my liking. i'm wondering, is there an advantage in using a humanist sans instead of a serifed typeface?\n\n"
    },
    {
      "time": "30 May 2005 — 11:28am",
      "content": "The humanist sans is most certainly greatly over-rated. Which doesn't mean it's useless: compared to most any serif design for example it can express a distinct casualness; and compared to a geometric sans, it can express more humanity, and also be more readable. The fallacy of course is that a typeface has to be either humanist or constructed; \"with us or against us\".\n\nhhp\n\n"
    },
    {
      "time": "30 May 2005 — 11:47am",
      "content": "so hrant, is your favorite legato somewhere in between? or how would you classify that one? in a league of its own?\n\n"
    },
    {
      "time": "30 May 2005 — 12:15pm",
      "content": "\"...I often perform experiments against all those tried and true golden rules...\"\n\nBravo Yves, that's the spirit! Use your own eyes and mind and trust (the Force) within you. Too often people are hindered by rules and fear critique from others. The only rule I adhere to is: \"There is no rule that should always be adhered to\"\n\nChrisL\n\n"
    },
    {
      "time": "30 May 2005 — 1:23pm",
      "content": "Legato is constructed anti-chirographically and following a desire to create readability-optimal notan. That's the least worst kind of constructed there can be.\n\nhhp\n\n"
    }
  ]
}
