{
  "id": "12692",
  "title": "Simple personal logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi there, I would be very grateful if you could take the time to make a few comments about the personal logo I'm trying to put together.\n\nI wanted to:\n\n1. Show my initials \"EM\" only  \n2. Play on \"em\" as a unit of measure in print and web  \n3. Keep the logo as simple and rational as possible in line with my own approach  \n4. Use only my own work - i.e. avoid adapting an existing typeface\n\nSo I have been experimenting with grid-based letters inscribed in a square.\n\nHaving come up with the first logo in the attachment, I can't say I'm happy - particularly with the \"e\" and wonder if the whole thing works better with just the \"m\" - cf the second logo in the attachment.\n\nWhat do you think? Do I need to drop the very strict grid?\n\n| Attachment | Size |\n| --- | --- |\n| [em1.gif](http://web.archive.org/web/20131023113858/http:/typophile.com/files/em1.gif) | 2.86 KB |\n\n",
  "author": "elliot100",
  "time": "25 May 2005 — 9:00am",
  "uid": "7181",
  "comments": [
    {
      "time": "25 May 2005 — 12:13pm",
      "content": "Your wants seem to have been met. Using the idea of the \"em\" is fun, and it will be a gee whiz moment for anyone that actually understands it. They both work, but the single m seems more interesting to me. Are these your first comps or do you have others which you could share?\n\n"
    },
    {
      "time": "25 May 2005 — 2:02pm",
      "content": "How about a positive \"e\" to the left, mostly outside the square, set as it normally would be to read the word \"em\"?\n\n"
    },
    {
      "time": "26 May 2005 — 2:23am",
      "content": "Thanks for your input. That's all I have at the moment but will try the \"e\" outside the square and maybe post back here when I can.\n\ncheers!\n\n"
    },
    {
      "time": "17 Jun 2005 — 3:16am",
      "content": "I like the simplicity. I suggest trying other font though, the idea is good, keep the 'em' thing. You should try a hundred different combinations. Heck, even handwritten typo. Keep on going with them designs. It's easy to just streamline 2 letters in a cool font. Try lineto.com and type the 'em' in the typewriter to see the result. Other typesite have preview possibilities too.\n\nK.\n\n"
    },
    {
      "time": "18 Jun 2005 — 1:06am",
      "content": "I think the single 'm' looks more interesting, but retaining the 'em' is more interesting as an idea.  \nWhat about using two squares and placing each letter in its own? See how the neg space of the square changes by the placement and shape of the letter.\n\n"
    }
  ]
}
