{
  "id": "12696",
  "title": "TYPO Berlin, and why clients are always wrong",
  "forum": "dan\\_reynolds's blog",
  "tags": [

  ],
  "content": "I just got back from this year’s [TYPO Berlin](http://web.archive.org/web/20120801113348/http:/typophile.com/wiki/TYPO%20Berlin), the _international_ conference organized every year at [Haus der Kulturen der Welt](http://web.archive.org/web/20120801113348/http:/typophile.com/wiki/Haus%20der%20Kulturen%20der%20Welt) by [FontShop](http://web.archive.org/web/20120801113348/http:/typophile.com/wiki/FontShop). TYPO Berlin may be Europe’s largest graphic design conference, and its theme this year was **change** , perhaps because after 10 years, [Erik Spiekermann](http://web.archive.org/web/20120801113348/http:/typophile.com/wiki/Erik%20Spiekermann) had announced that this would be his last round as one of the organizers.\n\nUnlike 2004, I spent this year working inside the [Linotype Library](http://web.archive.org/web/20120801113348/http:/typophile.com/wiki/Linotype%20Library)’s stand in the lobby. My whole review should be read with a grain of salt, as I only took time off from speaking with customers to see three of the lectures.\n\nFrom what I have heard, the real theme that ran throughout the conference’s presentations what not **change** , but **vacation pictures**. It seems that designers do in fact _go on vacation_. Once there, they take photographs, usually of type or lettering. And sometimes, the cool pictures they will go on to influence great work and big projects; but not always. We probably all do this.\n\nIf I have any critique of the conference, it was its “international” moniker. This may have been international as far as a designer conference goes, but it didn’t seem so wide in scope. Even though visitors from a number of countries were in attendance, most seemed to be either from Germany, Austria, or Switzerland. Or they were Danes or Dutch who spoke German. The speakers’ list was more geographically rounded out than previously, and credit must be given for that. This year, in addition to speakers from Germany, Holland, and the US, there was one speaker from Africa (Zimbabwe), one from South America (Brazil), and one from Asia (China, although she currently lives in Berlin).\n\nThe part of the conference that I most enjoyed was meeting the designers from [Magma](http://web.archive.org/web/20120801113348/http:/typophile.com/wiki/Magma), who had traveled from Karlsruhe. They seemed to have had some sort of symbiosis with Hewlett-Packard, at whose exhibition stand they spent the three days showing (you guessed it) vacation photos. Magma is a design studio that runs [Slanted](http://web.archive.org/web/20120801113348/http:/typophile.com/wiki/Slanted)—a German type blog—and [Volcano Type](http://web.archive.org/web/20120801113348/http:/typophile.com/wiki/Volcano%20Type), a small type foundry. These projects go along way toward creating and supporting real typographic dialogue within Germany, and it was good that their organizers were invited to speak.\n\nTYPO Berlin, save a few last minute changes to the schedule, was well organized—especially the weather. Whoever it was at FontShop who played a role at _that_ must definitely be commended, that was the biggest improvement over last year. Attendance seemed slightly lower than in 2004, but I don’t know the real figures, and in any case, the event was still well attended, especially by students. It is always good to see such a hefty percentage of students at conferences like these. They have the most to gain from large-scale design events, and FontShop’s generous student pricing made their volume of attendance possible.\n\n––  \nThose of you who’ve read this far deserve a treat. Here is one (non-TYPO Berlin) related goody: SoFake’s [Top Ten Commandments](http://web.archive.org/web/20120801113348/http:/www.wefail.com/twats/) for dealing with clients. I got this link from David Linderman, a professor in Offenbach who is also from the United States, and currently living in Berlin. So true; take a look!\n\n",
  "author": "dan_reynolds",
  "time": "25 May 2005 — 10:19am",
  "uid": "1085",
  "comments": [
    {
      "time": "25 May 2005 — 12:18pm",
      "content": "uhhhmm hahahhahahahahhahahahahahhaha..... give up now everyone and be a skateboarder instead!!!!!!! or take pics of chicks!!!!!!\n\n"
    },
    {
      "time": "25 May 2005 — 12:40pm",
      "content": "_or take pics of chicks!!!!!!_\n\nIs this your back-up plan? Maybe I'm in the wrong line of work…  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20120801113348/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "25 May 2005 — 2:12pm",
      "content": "Comic Sans was a mere ploy to nab the babes.\n\nhhp\n\n"
    },
    {
      "time": "2 Aug 2011 — 3:36pm",
      "content": "Your name:  \n VenusMattson579  \n Comment: \\*  \nLink to content with [some text](http://web.archive.org/web/20120801113348/http:/typophile.com/wiki/some%20text), where \"some text\" is the title of existing content or the title of a new piece of content to create. You can also link text to a different title by using [show this text](http://web.archive.org/web/20120801113348/http:/typophile.com/wiki/link%20to%20this%20title). Link to outside URLs with [some text](http://web.archive.org/web/20120801113348/http:/www.example.com/), or even [http://www.example.com](http://web.archive.org/web/20120801113348/http:/www.example.com/). Allowed HTML tags: [ _**<cite> <code> <img>\n<ul>\n</ul>\n<ol>\n<li>\n<dl>\n<dt>\n</dt>\n<dd>\n<blockquote>Lines and paragraphs break automatically.Web page addresses and e-mail addresses turn into links automatically.More information about formatting options<br>\nmattson<br>\n<a href=\"http://web.archive.org/web/20120801113348/http:/www.cafetiere-expresso.org/\" rel=\"nofollow\">cafetiere espresso</a>\n</blockquote>\n</dd>\n</dl>\n</li>\n</ol></code></cite>**_](http://web.archive.org/)\n\n"
    }
  ]
}
