{
  "id": "12695",
  "title": "ID Redesign - Critique and direction",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey Everyone,\n\nI'm currently the only in-house graphic designer at T-Metrics, Inc., a small telecommunications software company. This summer they want me to re-design their entire identity. At first they refused to let me touch the logo, in fear of losing connection with the loyal customer base they've had for the 15 years it has been in use. But I wrote a 4 page document explaining why they should change their logo to better compete in the contemporary market. After all, they are a software company...they shouldn't look dated.\n\nSo now they are open to the idea, but understandably, they don't want their customers to have to re-learn the mark entirely. So I need to keep some elements of the existing logo that are worth working with. It currently has a gradient motion trail or something like that, which I would just love to drop altogether. The interaction between the T and M letters seem to be it's strongest point...to me.\n\nMy first shot at this simplifies the mark, while hopefully keeping the letters recognizable. What I currently have seems to work a bit, but overall I think it looks a little stocky and not quite as elegant as I would like it to be. Some embellishment would probably help. The type in the new logo is Myriad, but that will change as soon as I bring my fonts over from my other computer...I think keeping it thin though will give it a more contemporary look.\n\nWhat do you guys like about the old logo? Any direction?\n\nThanks for any help...glad to be on Typophile!\n\n| Attachment | Size |\n| --- | --- |\n| [1.gif](http://web.archive.org/web/20131019042548/http:/typophile.com/files/1_0.gif) | 8.31 KB |\n| [Slabs.gif](http://web.archive.org/web/20131019042548/http:/typophile.com/files/Slabs.gif) | 3.53 KB |\n| [Curve.gif](http://web.archive.org/web/20131019042548/http:/typophile.com/files/Curve.gif) | 4.72 KB |\n\n",
  "author": "jtyler",
  "time": "25 May 2005 — 9:59am",
  "uid": "7500",
  "comments": [
    {
      "time": "25 May 2005 — 11:40am",
      "content": "The \"slabs\" version with the serif on the T (bottom one) works for me.\n\n"
    },
    {
      "time": "25 May 2005 — 1:45pm",
      "content": "A couple of points you are right to want to get rid of the gradient. Just pointing out the production problems in print applications should of convinced your in-house client. My problems with your first attempts at a TM combination is I don't see the M. I think most of your clients aren't designers and won't get it. Try this keep your original idea, and make two more that are more and more obvious TM combination and test the 3 versions with an informal focus group of clients. This way you will get feedback so you aren't working in alone.\n\n"
    },
    {
      "time": "25 May 2005 — 9:50pm",
      "content": "I'll second dan's comments - at first it reads T1.\n\n"
    },
    {
      "time": "26 May 2005 — 6:36am",
      "content": "I like the direction of the bottom slabs version, however the centre of the M needs to move to the left to centre between the stems. I wonder if putting the diagonal seperator in the opposite direction would remedy the concerns expressed above. The title is causing a problem with its alignment, trying another position, like to the left or above might solve it.  \nTim\n\n"
    },
    {
      "time": "26 May 2005 — 10:03am",
      "content": "Thanks for the feedback guys.\n\nI just added another image to the top post up there ^, curve.gif. To make the logo a little less harsh I turned the division between the letters into a curve. I think it does something to make the M more apparent, because instead of acting as two different pieces they look like they fit like a puzzle. But now I'm wandering it the first part looks like a T, or just an ugly odd arm on the M. What do you think? does the curve help?\n\n"
    },
    {
      "time": "26 May 2005 — 1:22pm",
      "content": "The curve most decidedly does not help. For starters, the two curves (between the letters) don't match, and beyond that it makes the right half look even less like an M. I think the slab variant you were playing with above is the best so far.\n\n"
    },
    {
      "time": "26 May 2005 — 3:22pm",
      "content": "Even the new version looks forced. Don't become so lock stepped with what they did in the past. It just looks dated. Try a different direction, my thought is TM like a Trade Mark. I would add the line under it: A Telecommunications Software Company. Just a thought. But before you get deep into the logo redesign, you have to have feed back and not just from designers.\n\n"
    },
    {
      "time": "28 May 2005 — 10:10am",
      "content": "If it helps I also read \"T1\" at first.\n\nIf the letters have to be combined doesn't a 'T' fit better centrally inside an 'M'? [I couldn't resist a sketch...](http://web.archive.org/web/20131019042548/http:/www.onewatt.co.uk/wattsisname/tm.jpg)\n\nSpot the student with too much time on his hands! It might not read much better but there's certainly more ways to combine the letterforms. Other than that I agree with Dan- apart from the Trade Mark idea! ;)\n\n"
    },
    {
      "time": "7 Jun 2005 — 9:39am",
      "content": "Not sure if this is still being worked on, but I prefer the '1' version over all of the others. Perhaps making the gap between the two forms thinner will help the 'M' read more quickly. Also, get rid of the Myriad as soon as possible. A geometric, constructivist sans would be more harmonious with the logo than something with the relatively humanist and consistently modulated strokes of Myriad.\n\nI don't like the slab serifs. They don't feel contemporary or clean enough for a telcom software company. Unless they're going for something heavier, with a construction feel to it.\n\nGood luck.\n\n"
    },
    {
      "time": "8 Jul 2005 — 2:30pm",
      "content": "It seems a healthy start, but I would try to push it a bit more.If alerted and properly marketed to, your existing customer base will follow right along. You have to ask - would we lose any customers that we currently have if our logo was different versus, would we gain any customers if our logo was better/clearer? Imgine most of your current customer's reaction. We honestly delude ourselves somewhat thinking that our current customers lie awake thinking about our logos. For the vast majority - if it is relatively simple and clear - their thoughts willbe \"it is what it is.\" Those that caputer the new look will more than likely be excited by it. A small few won't like it - regardless. There are just some people who no matter what you change they won't accept it and they tend to like to make phone calls and send emails. I don't think many companies have gone belly up because of a bad logo design if the rest of teh company was working. What you do have to worry about is capturing new market share. That's when the logo becomes your ambassador. Then you have to ask how do new customers and potential customers see us. and Will a new logo help that. Having worked on several rebranding projects and a few renaming ones, I have found that dedication and excitement of the company are key elements to a rebranding's success. If they support it and make a big deal out of it - it will have a great chance of success. I don't think that rebranding is always something you want to try and \"sneak\" by your customers. Sure we all get the jitters for trying something different, but sometimes it is necessary. I would maybe keep a couple that are close like you are,but try a few that are slightly more radical departures (just keep it within the same vein versus an updated retelling of the same logo). OK I know that wandered a bit,but you get hat I am saying - good start - try something a little further out.\n\n"
    }
  ]
}
