{
  "id": "1269",
  "title": "Raed the txet...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "John, you should know that when two objects collide there is actually an extremely small chance that they will pass through each other without harm. Human \"reality\" is not physical.   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "17 Sep 2003 — 6:04pm",
  "uid": "1250",
  "comments": [
    {
      "time": "17 Sep 2003 — 7:50pm",
      "content": "\\>relativism is a way of thinking with doubt   \n   \nI agree, but I think there are much better ways to acknowledge our fallibility and the uncertainty of all our beliefs.   \n   \nPopper, with whom I studied, forged a third path between the Positivists - who wanted certainty or a surrogate for it - and relativists who wanted to do away with truth as a regulative idea. His idea was that we strive through collective effort and looking at evidence to improve our grasp of reality, though it is never sure.   \n   \nThe problem with the relativist way of saying that truth is relative and there is no reality is that it destroys rational argument.   \n   \nIn my view it is quite wrong to think that relativism supports tolerance and open-mindedness. In fact, tolerance of the relativist only goes so far as he or she interacts with you. It allows for no rational discussion between people who disagree, for their two viewpoints are equally valid, and there is no reality, or evidence of reality to shed light on which is best. Argument is killed.   \n   \nHeidigger and his followers don't debate issues, they just pontificate.   \n   \nRelativism is in fact profoundly illiberal. My mentioning Sartre and Heidigger's tolerance of totalitarean regimes was actually on point. They are greatly admired by contemporary relativists, and they illustrate that anything can be justified by relativism. Relativism seems to be humble, but in fact is a supremely arrogant philosophy.   \n   \nFor a start, when you deny reality, you can deny the reality of the suffering of others.   \n   \nPopper in fact saw the upholding of standards of rationality as key to the advancement of knowledge and to regimes that were open to listening to the people and bettering their lot. And he argued so in his famous book 'The Open Society and its Enemies', specifically against the Nazi and Communist tyranies he had seen arise during his lifetime.   \n   \nA year ago I attended the Centennial celebration of Popper's birth in Vienna, and was touched by people from all over the world for whom his ideas had been a beacon of humaneness and liberalism under oppressive regimes.   \n   \n\\>it appears to me a little pretentious to say : i have the truth, it's this, or that.   \n   \nI agree completely that to claim you are certain that you know the truth is pretentious and even ridiculous. And I never said or believed such a thing. But it is equally ridiculous to deny that there are such things as truths and reality.   \n   \nAnd no, the first tests of reality - as I have said earlier and no one have given any counter argument - are not linguistic. A child learns the reality of objects (which yes are partly an hypothesis - a true hypothesis) before language. Animals also learn about reality of objects, other animals, food and sex without ever speaking.   \n   \nRelativism is just an excuse to dismiss those you don't agree with, rather that having to look at facts, and search for the truth. It is the death of reason, and as Hogarth said, \"The death of reason gives birth to monsters.\"\n\n"
    },
    {
      "time": "17 Sep 2003 — 8:32pm",
      "content": "It might sound like I'm joking, but I think relativism is relative! Recursive, if you will.   \n   \nFor example, William's viewpoint is rock solid -and the view to have- in his village, but falls apart with distance, goegraphic and otherwise - as illustrated so well on Typophile for example. I hope he can learn from the experience, and become a true world citizen.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Sep 2003 — 9:03pm",
      "content": "William, shouldn\n\n"
    },
    {
      "time": "17 Sep 2003 — 9:25pm",
      "content": "I do apologize; it is just my general inability to spell. I am sane, though ;)   \n   \nHere is another story, I believe from Abraham Lincoln.   \n   \n\"If you call a dog's tail a leg, how many legs does it have?\"   \n   \n\"Five.\"   \n   \n\"Four. Calling it a leg don't MAKE it a leg.\"\n\n"
    },
    {
      "time": "17 Sep 2003 — 9:32pm",
      "content": "Actual US Citizienship question: \"Which president freed the slaves?\"   \nCorrect but inadvisable answer: \"Is that a trick question?\"   \n   \n--   \n   \nSuggested Typophile motto: \"You're not in Kernsas any more.\"   \n   \nhhp\n\n"
    },
    {
      "time": "18 Sep 2003 — 3:55am",
      "content": "i think the debate is useless as far as our basis paradigm can't be the same. You think there's an absolute truth discoverable; i don't think so, believing that even if there was a Truth with a cap T, it won't be accessible for us (rabelaisian).   \nYou think goal of all sciences is to discover that Truth; i think it's to try to go on, and on. To learn, without necessary definitive results. In the same way you think that arguing is for convincing the opponent that your point is the Truth; i think it's to learn from each other is own truth (with a little t).   \n   \nAgreeing a solid rock is solid don't appear to me to drive to great discoveries. It's not that important. I really think trying to figure how we perceive that rock, with all our senses (because here, the vision seems to be the only one) is more interesting.   \n   \nThat lacks in your way of thinking, in my view, is something else than reason. Of course, reason is one of the thing that make us humans, and the most. But we feel, too, and many things are in us which are all but reason. Believings, customs, etc\n\n"
    },
    {
      "time": "18 Sep 2003 — 5:43am",
      "content": "_You think there's an absolute truth discoverable_   \n   \nWho said that? As far as I've been able to tell, William and I are both arguing that there is such a thing as the real and the true. Neither of us has claimed that we can know the real or the true in its totality (although it isn't a logical impossibility, only an empirical improbability based on our limited perception and imperfect reason (and leaving aside for now the question of revelation)).   \n   \nGuillaume, I'm not sure that we mean the same thing by relativism. You seem to be saying that we live with doubt about many things, and need to discuss and debate these things and try to come up with reasonable and generally agreeable ways of behaving based on whatever much or little we can determine. I have no argument with that, and I don't think that constitutes relativism.\n\n"
    },
    {
      "time": "18 Sep 2003 — 6:05am",
      "content": "yeah, i should have said \"you think there's an absolute truth\". When i say it's not discoverable in a rabelaisian way, i mean God. But i'm not a believer, i just don't know so i keep the possibility.   \nWhat i thought was relativism, is that there was no such things as truth, in ANY ways (not in some, as you say,\n\n"
    },
    {
      "time": "18 Sep 2003 — 6:19am",
      "content": "\\>the debate is useless as far as our basis paradigm can't be the same.   \n\\>Agreeing a solid rock is solid don't appear to me to drive to great discoveries. It's not that important.   \n   \nJohn, these are typical statements of relativism. But he thinks the only alternative to relativism is dogmatism, and that is why he mistakes me for a dogmatist.   \n   \nGuillaume, the word 'paradigm' in the sense you are using it was introduced by Thomas Kuhn, partly in criticism of Popper. Popper's reply is in his essay 'The Myth of the Framework.'   \n   \nAccording to Popper, your key mistake is to think that agreement on a rock being solid is unimportant. It is precisely such mundane agreed-upon statements are the basis for testing theories in science and indeed in politics. Particularly in science we move closer to the truth about reality through such a testing process.   \n   \nSo far, our understanding of social process is much weaker, but even in politics basic truths are important. For example, the economic (as well as moral) failure of centrally planned Leninist states eventually has led to abandonment of this economic model. Acknowledgement of the failure is from observing such mundane facts as the wealth in the Leninist states vs the mixed economies of the West and East Asia.   \n   \nThe mundane facts matter because they help guide us to greater truths, if we are looking for them. Abandon the idea of truth and reality, and you abandon the search, and the fruitful collaborative debate.\n\n"
    },
    {
      "time": "18 Sep 2003 — 6:22am",
      "content": "I should have added: this testing process is what enables to communicate and in fact decide between competing frameworks, or 'paradigms'.\n\n"
    },
    {
      "time": "18 Sep 2003 — 6:44am",
      "content": "ouh good examples.   \nI guess agreeing in solidity of rock may be important for hard sciences. But you've always understood that's not my \"speciality\" if i have one.   \nAbout your politic example, with the wealth of URSS you missed a marxist \"paradigm\" here. For the Marx ideas to work, after what he said, the revolution need to take place in a wealth country. That wasn't really the case of the Russia, if i'm not wrong; Marx spoke, too, of an industrialised country while Russian people were mainly peasants.   \nAnd i'd be very careful with \"wealth\". Because URSS, with all the  there was in that i can't deny, was also, thanks to the state, nearly totally alphabetised, for example. That's not nothing, especially for us i think (well, one can say too that Saddam got a unesco education prize in the end of the 70's).   \nThe problem of your idea of \"testing\" is that things are more complicated. Testing one side doesn't tell any truth. It may eventually tell one particular irrelevant truth of the side tested, but that's all.   \nAbandoning the idea of truth don't mean abandoning the idea of search. You've just to know that while searching\n\n"
    },
    {
      "time": "18 Sep 2003 — 7:23am",
      "content": "Guillaume, you can't use logic without the concept of truth. When you throw out truth, then contradictions are permitted. And it is a basic principle of logic at anything follows from a contradiction. All fruitful debate goes out the window. The beautiful Socratic tradition is killed.   \n   \nTesting doesn't tell you which theories are true, but it is a very good indication of which theories are false. It is up to us to invent better theories that are consistent with all the evidence, and then test them further.   \n   \nIn politics, the acknowledgement of the suffering caused or not caused by policies are very important mundane truths. Refusing to be guided by them as a reality is \"dangerous. Very dangerous.\"   \n   \nI have continued to comment in this thread because I dislike seeing what I view as a poison in intellectual life going unchallenged.   \n   \nI wanted to make clear that there is a well-developed alternative to the fashionable relativism, and to inform people that there is third side to the story - you don't have to be either a relativist or dogmatist. And that relativism may not be a benign, tolerant philosophy.   \n   \nBy the way, Popper did point out, as Guillaume notes, that the socialist revolution taking place first in a poor country (Russia) refutes Marx. It is in fact an example of how social facts are important to testing theories in social science and politics, as well as physical science.\n\n"
    },
    {
      "time": "18 Sep 2003 — 7:43am",
      "content": "I know pretty well that contradictions are permitted. I'd say hopefully, because if not all arguing become sterile and dead. As for me, the socrate tradition is rotten. One man asks questions with the answers inside, and the poor partner only can say \"yes\" or \"exactly\" or synonyms. Not fruiful, in my view. Socrate was really interesting, and beautiful in many ways, but he was also a pure dogmatist, not really interested in ideas of others, mocking of revolutionary people who wanted to discuss slavery etc. He was, also, a very fine rhetorician.   \nThe acknolewdgement of sufferings caused by policies is, of course, important. But you really can say neither stalinism nor nazism are relativism. Because people precisely can't question anything in that systems.   \nAnd you can also search for the goods, even in the more horrible systems, 'cause there are still some. My idea is to try to think with all the complexity possible.   \nYou obviously have to simplify to make any system, any frame of analysis. But if, after that, you don't come back to the complexity (and so on, classical dialectic), you loose many things and surely goes to something irrelevant.   \n   \nI just wonder something : is Popper\n\n"
    },
    {
      "time": "18 Sep 2003 — 7:49am",
      "content": "\\> William and I are both arguing that   \n   \nIs it a coincidence that both of you are strongly religious? It probably works great for you - maybe it gives your lives meaning for you - you're lucky. But I have to say I see a problem with anything based purely on faith _when you try to mix it up with people outside your village_. But a more nagging problem is that William holds his religion firmly behind his back so we can't see it (probably because he knows that some people will [rightly] hold that against him), whereas you at least don't try to hide it consistently. This is not a distraction - it really is the heart of the matter.   \n   \nBTW, I would also apply this to Jon Coltz's thread, but I think that's better left alone.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Sep 2003 — 8:11am",
      "content": "\\>ouh good examples.   \n   \nThanks, Guillaume, for your open-mindedness. I appreciate that you are seeking the truth on these matters!   \n   \n\\> I know pretty well that contradictions are permitted.   \n   \nSorry, I wasn't clear. Of course contradictions are permitted in the sense that different views of the truth contradict one another. What I meant was that if contradictory views are accepted as equally valid, or correct or true, then debate and scientific testing are both impossible. I can for example accept both a universal theory and evidence that conflicts with it. But this acceptance of conflicting viewpoints as valid (one for one person or group, the other for the other) is precisely what relativism does.\n\n"
    },
    {
      "time": "18 Sep 2003 — 8:23am",
      "content": "That Hrant's insults and verbal abuse are pointless and tiresome is, as the Coltz thread shows, an internationally accepted point of view! ![:-)](http://web.archive.org/web/20131015071022im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "18 Sep 2003 — 8:28am",
      "content": "mmm William (you know that we've the same name\n\n"
    },
    {
      "time": "18 Sep 2003 — 8:31am",
      "content": "That's exactly the kind of blinders I'm talking about - a finely tuned coping mechanism that discards any turths that go against the faith. You don't even realize that you're in a tight little demographic here. But -like I said- the problem isn't your beliefs, it's your desire to subjugate others to them - which is part and parcel of your religious zeal - and that's the _real_ problem in this highly heterogenous place.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Sep 2003 — 8:37am",
      "content": "Yves, YOU MUST NOT DOUBT THE FAITH!   \nIt doesn't matter what the faith is, as long as you choose one and you don't doubt it, and you make sure everybody else follows you.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Sep 2003 — 8:56am",
      "content": "\\>William, it is your narrow-mindedness that's destructive.   \n   \nYves, try this on for size and see if you think it is off the point and personal:   \n   \n\"Yves, it is your narrow-mindedness that's destructive.\"   \n   \nSee what I mean? Name-calling, not argument.   \n   \nIncidentally, I am happy to discuss my religion when it is relevant, which it isn't here.   \n   \nThe tradition of rational debate was developed in ancient Greece independent of Judaism and before the rise of Christianity and Islam. It subsequently influenced all three, but has also been in tension with them, fueling a somewhat independent strand of secular, often anti-religious thought.   \n   \nI have blown a morning posting. Got to get back to work!\n\n"
    },
    {
      "time": "18 Sep 2003 — 9:03am",
      "content": "You religion is the wellspring of your opinions and behavior here.   \nThe compartmentalization of discourse is an escapist convenience.   \nAs is your propensity for feeling insulted, instead of taking advice.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Sep 2003 — 9:06am",
      "content": "BTW, William, what's your proportion of type versus off-topic posts on Typophile?   \n   \nIf you must have the last word, go ahead. I've had enough of preaching to deaf people, concerning non-typographic issues no less.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Sep 2003 — 9:19am",
      "content": "i don't want to discuss religious beliefs here; i love to talk with believers, i used to have a talk with a pastor each week at the university which was very interesting (though his creationism was frightening).   \nBut the point of Greece for debate is not fair : thanks to Nietzsche (and pals), we know the bounds between christianity and platonism. The first being, for the great philosopher, a kind of platonism light.   \nBoth share that idea of absolute truth.\n\n"
    },
    {
      "time": "18 Sep 2003 — 9:25am",
      "content": "\"The compartmentalization of discourse is an escapist   \nconvenience. As is your propensity for feeling insulted,   \ninstead of taking advice.\"   \n   \nwe must all remember, Hrant is open-minded, those   \nwho disagree with him are not. take heed, typophilers.   \n   \nno offense, Hrant -- I do love hearing your passionate   \narguments!\n\n"
    },
    {
      "time": "18 Sep 2003 — 9:39am",
      "content": "Hrant,   \n   \n_I've had enough of preaching [...]_   \n   \nFine irony, when you\n\n"
    },
    {
      "time": "18 Sep 2003 — 2:12pm",
      "content": "Hrant: _Is it a coincidence that both of you are strongly religious? It probably works great for you - maybe it gives your lives meaning for you - you're lucky._   \n   \nI don't think it is necessary to believe in God in order to give meaning to life. I think humans are quite capable of developing meaning -- whether worthwhile or not: some people live to shop -- without religion. I think Hrant is voicing a frequent misconception of infidels -- i.e. 'unbelievers' -- that religious people are religious in order to give meaning to their lives.   \n   \nI am not a Catholic because Catholicism gives meaning to my life. I am a Catholic because I believe the teachings of Catholicism to be _true._ If I were just looking for meaning, I would have picked something easier.\n\n"
    },
    {
      "time": "18 Sep 2003 — 3:38pm",
      "content": "_Matha, we've been over the reality/ interpretation/opinion thing on Typophile before._  \n   \nand, so far, I've been thoroughly enjoying myself. Your posts on the subject are exellent.   \n   \n_By 'reality' I mean that which is real, beginning with the physically real and the logically true._   \n   \nI know what you mean, John.   \nMy problem is not with the physically real - I don't deny that I'm walking on solid ground or that the metro vibrates a lot while I'm on my way to work.   \n   \nOn the other hand, I am deliberately questioning the stability of the language we use to interact with these sorts of situations. William's story sums up my argument very nicely:   \n   \nIf enough people are involved, calling something a 'leg', does actually make it a leg. If the Oxford English Dictionary says it's a leg, who am I to argue?   \n   \nLanguage is, in my opinion, too vague and imprecise and far too unpredictable (think about the English word 'wan': it used to mean Black) to analyse what is real and what is not real in the scientific way William advocates. I'm with Gottlob Frege on that.   \n   \nUntil language corresponds exactly to what is real, contradictory views can indeed be accepted as equally valid. But yes of course there are limits : we have to decide what we mean by valid and question how we act when we think we have valid viewpoints.   \n   \nm.\n\n"
    },
    {
      "time": "18 Sep 2003 — 3:46pm",
      "content": "_narrow-mindedness...See what I mean? Name-calling, not argument_   \n   \nA matter of opinion, I'd say. We'll have to agree to differ.\n\n"
    },
    {
      "time": "18 Sep 2003 — 3:49pm",
      "content": "_I profusely apologize for not being well-equipped enough linguisticly to participate in this very interesting thread._   \n   \nDon't be intimidated Yves. Long words and jargon do not make the man.   \n   \nM.\n\n"
    },
    {
      "time": "18 Sep 2003 — 5:33pm",
      "content": "\\>The thing is that you really absoloutly want to judge. You don't want just to learn and build a living on a fruitful learning, which doesn't necessary evaluate.   \n   \nGuillaume, the idea that you yourself don't make judgments is a mistaken idea.   \n   \nYou make a judgment every time to decide to eat the food rather than the plate, every time you step over a hole in the road.   \n   \nYou also make judgments of other people and political judgments - such as the one you made above about bad things that went on in the Soviet Union. We all make judgments, I just think it is a better idea to make them after looking at evidence and grounding them as much in reality as possible. Using logic and reason is part of being a responsibile human being. So is being open-minded enough to accept new evidence and argument and change one's mind.   \n   \nThe relativist's claim not to make judgments is just pretense, not reality. It shows the hollowness of the philosophy.   \n   \nI never said that Nazis or Communists were relativists. I said that Heidegger and Sartre used relativism to defend them. My point was that once you break loose your standards from evidence and reality, anything goes.   \n   \nI see from your bio here that you are a student. If you are interested you can get Popper's works in French. I think 'Conjectures and Refutations' is his best. My own book on Popper, 'Learning from Error' is in English and a German translation (Lernen aus dem Irrtum), but not in French.   \n   \n\\>If enough people are involved, calling something a 'leg', does actually make it a leg. If the Oxford English Dictionary says it's a leg, who am I to argue?   \n   \nWith all due respect, Matha, you miss the point of Lincoln's story: changing language doesn't change reality. The fixing of meaning is conventional - the sound 'he' refers to a man in English and to a woman in Hebrew. But once the meanings are relatively fixed in a language community, then sentences refer to reality, and are true or false. The reality doesn't change even though we may get it wrong or fail to understand it.   \n   \nFor example once 'weapons of mass destruction' is given a clear meaning, the claim that they were in Iraq gets meaning, and the reality of whether they were there or not doesn't change no matter what George Bush or Hans Blix says.   \n   \nThe idea that language determines reality is such a crock. Eating keeps us alive, sex makes babies - and you don't need talk when you are doing either one!   \n   \n\\>William, I see your point, but I guess we must have   \ndifferent tresholds, no offense.   \n   \nYves, no offense given or taken. I noted the rudeness because don't think it should be accepted as a normal course of action, on these boards or anywhere else.   \n   \n\\>instead of taking advice   \n   \nHrant, I recently accepted 100% of your typographic advice on my book project, and thanked you for your kindness. And meant it.\n\n"
    },
    {
      "time": "19 Sep 2003 — 2:47am",
      "content": "William, i obviously make judgements everytime. And of course, when the question is important, logic and reason are my better friends (well, let say apart about love).   \nBut i try to avoid them as much as i can when they're not needed. And, all the more, i try not to make judgements systematically. If something is pure occidental, it's that frenetic need to eveluate, to give labels. I am myself pushed to do that, as it's a main point of our culture, but i try as much as i can not to do so if the situation don't call for a judgement. Just a free look.   \nAbout it as a phylosophy, you know, a philosophy hasn't to be taken litteraly for living. Maybe i just have, as i want it, to try to do it more often.   \nFor now i really haven't time to read anything else than what i already have to, but when i'll have such time, i'll try to get a look on your master. I think my reading of Leo Strauss make me a quite honest idea of your position ?   \nAbout language. Of course it doesn't determine reality itself. But it sure determines the way we see it, and so the way we analyse it, because we simply haven't any other way to think.   \nI disagree strongly that WMD has a clear sense. Planes driven by fanatic people are now supposed to be so. If any unexpected use of something potentially dangerous on a big scale, it would be added on the list. So it's not that clear. I'm just studying that for my work, so it's not a so easy question. And here, particuliarly, what Bush says change many things because he can say \"they are there\" without being sure\n\n"
    },
    {
      "time": "19 Sep 2003 — 6:17am",
      "content": "In an effort to bring this thread back on topic, let me quote a comment on [Uncle Jazzbeau's Gallimaufrey blog](http://web.archive.org/web/20131015071022/http:/www.bisso.com/ujg_archives/000060.html) from the author of the research which is apparently being referred to in this whole scrambled letter hoohah.\n\n> * * *\n> **quote:**\n> \n> Actually I am pretty sure it is my research people are talking about as it was my letter to the New Scientist. It was research for my PhD and the UNievrsity was Nottingham, PhD submission 1976, available on line I am told, title The Significance of Letter Position in Word Recognition. **\\*It shows clearly that word shape (the theory at the time) is not that significant as shuffling the letters changes the shape substantially.\\*** I did 36 or so experiments with all kinds of changes, keeping first and last in position, or first two and last two letters. Should be easy to write a programme which deos this now. For me it meant learning machine code and compressing everything to get it in. NOw I just help people invent things.   \n>    \n> Thanks for all the interest in my PhD after all these years. At the time I could not get publication as the reviewers were the ones whose theories my research results contradicted!   \n>    \n> Oh well.   \n>    \n> Graham   \n> Posted by: Dr Graham Rawlinson on September 19, 2003 01:43 AM\n> \n> * * *\n> !-/quote-!\\>!-quote-!\\>\n\n[_Note:_ my emphasis]   \n   \nThis should provoke on-topic reply from hhp. ;-)\n\n"
    },
    {
      "time": "19 Sep 2003 — 6:53am",
      "content": "If the dictionary says that what used to be called a dog's **tail** is now called a **leg** , it is most definitely now a **leg**. It's shape or function or colour obviously doesn't change but the reason for calling it a tail (ie. this was it's given name) has disappeared. Would you continue to call it a 'tail' under those circumstances? When a company changes its name, do you continue to use the old name?   \n   \nCompare the way you look at a **tail** that is renamed a **leg** with someone who has never seen either a leg or a tail. Wait a generation and compare your reaction with someone who wasn't alive when a tail was a tail. In a leg you see an ex-tail. The youngsters just see a leg. The interaction with reality is different on the level of the language and the poor dog can't do anything about it.   \n   \nTake Nationalists and Unionists in Northern Ireland. They see the same geographical area completely differently. You might say we are talking about opinions here but when opinions are codified in constitutions they tend to encourage people to interpret reality in a particular way.   \n   \nThe definition of a nation is a good example of how reality (because in this case the reality of the situation is based on vague abstract principles expressed through even vaguer language) can be completely different depending on your age/religion/ethnic background.   \n   \nWhat is reality in a country where two groups accuse each other of oppression and claim victim status for themselves. Are they both right? both wrong ? do we support the underdog ? or the one that is most like us?   \n   \nMatha.\n\n"
    },
    {
      "time": "19 Sep 2003 — 7:05am",
      "content": "_You gents have totally hijacked an otherwise interesting thread. I don't see how your basic problems with each other...._   \n   \nYour 'You gents' is a bit vague there, Joseph. Who are you talking about? And what are these basic problems ?   \n   \n_an otherwise interesting thread_   \n   \nThat's a matter of opinion, surely.   \n   \nM.\n\n"
    },
    {
      "time": "19 Sep 2003 — 7:53am",
      "content": "\\> you can test the hypothesis yourself.   \n   \nNot on yourself, though. Deliberation precludes immersion.   \n   \n--   \n   \nKent, I was going to request Dr Rawlinson's paper through UCLA, but he seems so accessible I'll try directly first.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Sep 2003 — 9:56am",
      "content": "\\>You gents have totally hijacked an otherwise interesting   \nthread.   \n   \nA little harsh, Joseph, given the amount of non-type relevant political discussion that comes into this board.   \n   \nAs I said at the start of my discussing relativism, I did it reluctantly, having resisted earlier, but because it has come up repeatedly on these boards. And evidently people were interested in discussing it.   \n   \nBecause this stuff is actually my expertise, I wanted to inform people that there are other well developed alternatives to relativism - and that it is in the view of some, including me, profoundly illiberal - I jumped in.   \n   \nAnd evidently there were a number of people interested in discussing the issue.   \n   \nHaving made clear that there is a well-developed alternative - by Popper and his followers - I won't go further on this, unless others really want to, or want to do it privately by e-mail.   \n   \nNow that we know the source, and that Dr Rawlinson saw his work as at least a partial refutation of the Bouma theory, I look forward to Hrant admitting the error of his ways! ![:-)](http://web.archive.org/web/20131015071022im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "19 Sep 2003 — 10:32am",
      "content": "About the leg and the tail:   \n   \nMatha, yes we can start calling a dog's tail a leg, and if we establish the convention it might stick. But most people want language to be useful -- not perfect, not all revealing and encompassing -- just useful for talking about the reality around them. Calling a dog's tail a leg doesn't change the nature of the thing attached to a dog's arse. It remains pysically different from the other things we call leg. So by calling tails legs we've just made language less useful because we've removed the linguistic distinction between things that are distinct in reality.   \n   \nNow, and this is quite interesting, language reflects cultural priorities insofar as language embodies classification. The distinction between tail and leg is one of classification, and the fact that we have two separate words for them indicates that we consider the classification to be important. It is conceivable that there is another culture that would have a single word for 'long skinny things attached to the body of a dog', which would be used for both legs and tails. Such a word would indicate that this culture has never considered the physical or functional differences between legs and tails to be important: they have different priorities in classification.   \n   \nSo language reflects priority in the classification of reality, but it does not affect the nature of that which is classified: the physical and functional distinctions between legs and tails persist whether a language defines the distinctions or not. Calling a tail a leg does not change the dog, only the language.\n\n"
    },
    {
      "time": "19 Sep 2003 — 11:14am",
      "content": "Hehe. Since John is being naughty in continuing on relativism, a note in answer to Guillaume:   \n   \n\\>I think my reading of Leo Strauss make me a quite honest idea of your position ?   \n   \nI haven't studied Leo Strauss, but I know he is very different from Popper. He was not a relativist, but he was a traditionalist and an elitist. Popper believed in social reform, and was passionate for democracy.   \n   \nMany American conservatives are followers of Leo Strauss. A fellow student of Popper who is a political philosopher told me he finds them thoroughly annoying.   \n   \nTo my knowledge, Strauss did not develop an alternative to dogmatism and relativism, as Popper did.\n\n"
    },
    {
      "time": "19 Sep 2003 — 11:23am",
      "content": "\\>I'll try to sound less   \njudgemental in my proddings to get back on topic.   \n   \nYour intervention was good. Please be at least as judgmental when people start in with the personal attacks!\n\n"
    },
    {
      "time": "19 Sep 2003 — 11:44am",
      "content": "\\> I know I shouldn't feed you guys more fodder for philosophical debate.   \n   \nYes, that was not opportune at all.   \n   \nProper list behavior isn't a matter of absolutes, it's a matter of thresholds. So while the occasional non-typographic post is both inevitable and often even useful, using Typophile mainly for non-typographic debate is just plain inconsiderate, especially while using the pretext of personal weakness of character to justify bad behavior. This is especially true in a list like this where the posts are arranged sequentially on one page, and somebody wading thought it all for some _type_ discussion might get discouraged. If you allow this to go on, the least you could do is rename the thread.   \n   \nBut I recommend simply continuing such discussions here:   \n [http://www.rcs.re.it/banfi/lists.htm](http://web.archive.org/web/20131015071022/http:/www.rcs.re.it/banfi/lists.htm)   \n   \nIf you want a recent case of how loss of focus can be laregly cured, see Stephen's   \nintervention on Typo-L last week. And that stuff was at least remotely related to words.   \n   \n--   \n   \nAnd please spare us the token typographic participation in the t-shirt thread. _That_ is insulting to me.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Sep 2003 — 1:51am",
      "content": "_distinction between tail and leg is one of classification, and the fact that we have two separate words for them indicates that we consider the classification to be important..._   \n   \nYou're right, John, that is food for thought. And well argued, too.   \n   \nOn the other hand, when people's lives are at stake (if we're manipulating words in international politics, for example), useful language isn't good enough. It needs to be perfect.   \n   \nAs it never will be perfect, we need to acknowledge the imperfection and be careful what we use it for. I'm thinking of the word 'Nation'. An extremely dangerous word - imperfect, vague and very much abused - and yet the keystone of international relations.   \n   \nMatha.\n\n"
    },
    {
      "time": "20 Sep 2003 — 4:12am",
      "content": "Yes William, with your last point, i think i misjudged what was exactly the ideas you defend. Maybe the Popper reading could be interesting.   \nBut still, there's something Popper and Strauss\n\n"
    },
    {
      "time": "20 Sep 2003 — 8:07am",
      "content": "Matha, 'when people's lives are at stake (if we're manipulating words in international politics, for example)' language isn't the problem: peoples' intentions are. William made the very good example above: we understand what the phrase 'weapons of mass destruction' means, and we understand what the phrase 'in Iraq' means, so we have a perfectly clear proposition which is either true or false. The problem is not the language, but the intention of men to whom the truth of falsity of the proposition is irrelevant.   \n   \nLanguage is never perfect -- point of information: only God is perfect --, but most of the time it is pretty darn clear. But it hardly matters how clear it is if the intent of the person speaking is not matched by his words. Well, that's original sin for you.   \n   \nThis book might interest you:   \n [http://www.amazon.com/exec/obidos/tg/detail/-/0631205101/qid=1064070288/sr=8-1/ref=sr\\_8\\_1/102-5516056-5162560?v=glance&s=books&n=507846](http://web.archive.org/web/20131015071022/http:/www.amazon.com/exec/obidos/tg/detail/-/0631205101/qid=1064070288/sr=8-1/ref=sr_8_1/102-5516056-5162560?v=glance&s=books&n=507846)   \n   \nI don't think the word 'nation' is vague, and it isn't the fault of the word if it is much abused. I just don't think nation states turned out to be a very good idea. ![:-)](http://web.archive.org/web/20131015071022im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "20 Sep 2003 — 10:52am",
      "content": "Where i disagree with you, Joseph, is when you say that intention and language are two different things. The language isn't a pure system, to take out of context. The context is part of the language. The system is virtually pure, but everytime it's used, it become a more complex (and confusing) thing, made of phonems, letters, significations, voice, attitude etc. You can't separate the different elements that are a whole thing once it's used. WMD can be a specific range of real weapons, described by specific attributes; but it can be anything enough powerful to make a big damage.   \nAnd if a \"leg\" seems clearly refer to one specific thing, the majority of the language depend on many factors for its sense to be clear. And it's never completely obvious.   \nforget \"one word = one thing\". It's irrelevant.\n\n"
    },
    {
      "time": "20 Sep 2003 — 10:57am",
      "content": "We call it \"semic density\" : some technical words sure refers nearly exactly to \"one thing\", they have a big semic density; but many have a lighter one, which means their signification is very harder to fix, and depends on many factors (such as \"intention\", attitude, culture, place etc.)   \n   \nBTW if questions of relativism may be irrelevant in a type forum, language questions obviously are not.\n\n"
    },
    {
      "time": "20 Sep 2003 — 11:33am",
      "content": "_forget \"one word = one thing\". It's irrelevant._   \n   \nI never said one 'word = one thing', although Matha indicated that it is desirable (this is why I recommended Eco's history of the vain search for a perfect language). Of course words can have multiple meanings, and the clearer you want to be about your meaning the more words you need to use to clarify how you are using specific phrases.   \n   \nHowever, one word = anything is also irrelevant, and not only that it is dangerous. We can and should, for example, demand a specific definition of 'weapons of mass destruction' from our political leaders, and they can and should provide such a definition: it is possible to state what they mean, even if it isn't in their interests to do so. The vagueness isn't in the language, it is in the intention not to use language clearly.   \n   \nBetween the vain idea of a perfect language, in which there is a one-to-one natural correspondence of word and thing, and the vain idea of total deconstruction of meaning in which there is no correspondence of word and thing other than a momentary and individual interpretive one, there is the linguistic world that most people operate in on a daily basis. There are conventional correspondences between words and things embodied in usage, and these can be explained and understood in terms of a matrix of such correspondences. So when I say 'This is a duck', I can go on to explain what a bird is, what distinguishes this duck bird from other birds, and can relate all these concepts to physical specimens. There is no one-to-one natural correspondence between the word duck and the thing duck, not least because there are different breeds of duck and the word duck is also a verb that has nothing to do with water fowl, but we have adequate functionality of language in talking about the thing we call a duck. If the functionality wasn't adequate, we would make it adequate by devising new ways of talking about the thing, which is something at which we are very adapt.   \n   \nAs an aside, the fact that you call me Joseph does not make me Joseph ![:-)](http://web.archive.org/web/20131015071022im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "20 Sep 2003 — 2:19pm",
      "content": "As people still want to talk about this, I will put in one more round.   \n   \nYes, language is sometimes ambiguous, a social product, and some concepts (such as justice) are interpreted differently by different cultures.   \n   \nAll this does not change the fact that there are a huge number of simple facts on which almost everyone agrees: that there many different languages, that we need food to live, and so on. It is this very broad agreement on observed facts that provides a basis for testing more general ideas, and for cross-cultural communication.   \n   \nThe reality of many ambiguities in language does not answer my, and Popper's point that these basic agreed-upon observations (including of observation of human suffering) provide a basis for common communication and for meaningful debate in science and politics.   \n   \nMatha, if you do not address the importance of cross-culturally agreed-upon observational facts, then you are not answering Popper's argument against relativism.   \n   \nGuillaume, I think your concept of 'absolute truth' does not characterize Popper's view. He distinguishes between truth in the ordinary sense of the statement 'most dogs are born with four legs' being true, and the sense of Truth being about the meaning of life etc. Incidently, if you are interested, the logician Alfred Tarski defined this simple sense of 'truth' in formal logic.   \n   \nYour view that we cannot get closer to the truth, and therefore the concept of truth is useless, is one which Popper would contest. For example, we are closer to understanding the truth about the nature of the moon than people were a thousand years ago.   \n   \nHaving already tried the patience of those not interested in philosophy, I am reluctant to go further in this thread. My article 'Skeptical Rationalism' (Inquiry, 22, p. 281-230) lays out my own views in depth.   \n   \nThe main question I would have for Matha and Guillaume is: What is gained by being a relativist? If you think the answer is a more tolerant point of view, I think you are making a serious mistake - though one that has nothing to do with type!\n\n"
    },
    {
      "time": "20 Sep 2003 — 2:58pm",
      "content": "\\> As people still want to talk about this, I will put in one more round.   \n   \nHow convenient. The difference of course is that _those_ people can justify their overall presence here with a manifest interest in _type_ - and not just their own either.   \n   \nPreviously you had expressed an interest in Javal's work\\*. Now that there a whole thread for it, you don't care.   \n   \n\\* [http://www.typophile.com/forums/messages/30/11991.html](http://web.archive.org/web/20131015071022/http:/www.typophile.com/forums/messages/30/11991.html) (Monday, June 02, 2003 - 5:54 am)   \n   \nYou are abusing this forum, and I for one feel insulted. I ask you to improve your behavior - not according to _your_ standards, but to those of this _typographic_ community. They're not very high standards (which in this case is a feature, not a bug), but they certainly do include respecting the raison d'\n\n"
    },
    {
      "time": "20 Sep 2003 — 4:10pm",
      "content": "Hrant, I agree with you that the discussion of relativism, which Matha and John started and I and Guillaume took up, should be in a separate thread.   \n   \nI look forward to your and others' discussion of Dr. Rawlinson's paper. It sounds like a serious challenge to Bouma's theories. If the moderators don't separate the discussion of relativism, you can of course start a new thread.   \n   \nAs to the standards of this typographic community, I am glad to hear and abide by them.\n\n"
    },
    {
      "time": "20 Sep 2003 — 4:23pm",
      "content": "\\> It sounds like a serious challenge to Bouma's theories.   \n   \n1) It was about a decade earlier.   \n2) From what has come out during the thread on Typographica, I'd assume the opposite.   \n   \n\\> you can of course start a new thread.   \n   \nClearly, it's the hijacker's responsability to do that.   \n   \n\\> I am glad to hear and abide by them.   \n   \n [http://typophile.com/about/](http://web.archive.org/web/20131015071022/http:/typophile.com/about/)   \n   \nObviously, a participant who makes more off-topic posts than on-topic ones is \"problematic\", to say the least.   \n   \nhhp\n\n"
    }
  ]
}
