{
  "id": "12718",
  "title": "hidden typographic messages 'red reveal'/'blue reveal'",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "i am interested in trying out a technique whereby one would use a filter to reveal a message from an overlay of coloured type, a little like the 3d glasses principle.\n\ndoes anyone have any idea what the print process is for this, for example which pantones are recommended, where to get the filters etc...\n\ni have found a printers that can do this, but it is not a big run and i don't have the budget. can anyone help?\n\n",
  "author": "unitprodesign",
  "time": "26 May 2005 — 5:24am",
  "uid": "6504",
  "comments": [
    {
      "time": "26 May 2005 — 9:02am",
      "content": "Back in the 1950s, if I lost the glasses that came with a 3D comic book, I could make my own with lollipop wrappers (cherry and grape -- worked pretty well, actually). Many years later, when a local TV station broadcast \"Creature from the Black Lagoon\" in 3D, I made my own glasses (and those for several guests at a 3d TV party) from theatrical lighting gels. The gels are more readily available at stage lighting companies (check the Yellow Pages), are consistent in color and are reasonably priced.\n\nPrinting process is not important -- good-quality color copies will work as well as printing, but the exact colors you use will probably have to be determined by trial and error. In my limited experience of goofing around with 3D drawing, I found that lighter shades or red and blue work better at \"disappearing\" when the appropriate gel is used.\n\n"
    },
    {
      "time": "26 May 2005 — 9:40am",
      "content": "Stefan Sagmeister did that trick on the cover of his book, didn't he? I would think the inks need to be semi-transparent. It seem I have a book at home that has the english in red and the dutch in blue...or something like that. I'll have to find that and check it out for you. Unless, of course, someone knows how at the moment.\n\nIt seems to me that the printer you have found that can do this would know which colors you should use. No?\n\n"
    },
    {
      "time": "26 May 2005 — 4:11pm",
      "content": "he was very anal and would not give anything away... think it's a bit of a secret! i will have a look at the book though, thanks.\n\n"
    },
    {
      "time": "5 Jun 2005 — 7:22pm",
      "content": "Colored cellophane is easy to find in craft stores now.\n\nFrom what I remember of the cheap \"magic window\" stuff, all you need is a pure red for the obscuring pattern and a light cyan for the hidden print. Both should be screened if possible. That way, the eye doesn't pick up telltale outlines because all it can see are dots.\n\n"
    },
    {
      "time": "22 Jul 2008 — 10:37pm",
      "content": "How can i make hidden typographic messages 'red reveal'/'blue reveal' for this any software or any trick. please suggest me ASAP.\n\nThanks\n\n"
    },
    {
      "time": "28 Sep 2009 — 3:06am",
      "content": "_It seem I have a book at home that has the english in red and the dutch in blue...or something like that._\n\nI need to know that title! If you or anyone else could help - much appreciated. I've seen an article about this book somewhere but I can't find it. Thanks.\n\n\\_\\_\\_\\_\\_\\_\\_\\_  \n [AL](http://web.archive.org/web/20150317151328/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "28 Sep 2009 — 5:25am",
      "content": "There is a picture of the book you seek on this page:  \n [http://www.thonik.com/read.php?sub=9](http://web.archive.org/web/20150317151328/http:/www.thonik.com/read.php?sub=9 \"http://www.thonik.com/read.php?sub=9\")\n\nIt is for sale as a collector’s item at the best known bookresellers/antiquarians of the Netherlands:  \n [http://www.deslegte.com/node/130405](http://web.archive.org/web/20150317151328/http:/www.deslegte.com/node/130405 \"http://www.deslegte.com/node/130405\")\n\nI have it, but its in storage.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "28 Sep 2009 — 6:27am",
      "content": "Thanks Bert!\n\n\\_\\_\\_\\_\\_\\_\\_\\_  \n [AL](http://web.archive.org/web/20150317151328/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "28 Sep 2009 — 11:09am",
      "content": "no idea how to do it--but i love the effect!\n\nhere's it in use on Jay-Z's album Kingdom Come\n\n ![](http://web.archive.org/web/20150317151328im_/http:/typophile.com/files/photo_6250.jpg)\n\n ![](http://web.archive.org/web/20150317151328im_/http:/typophile.com/files/photo2_3564.jpg)\n\n ![](http://web.archive.org/web/20150317151328im_/http:/typophile.com/files/photo3_5653.jpg)\n\n ![](http://web.archive.org/web/20150317151328im_/http:/typophile.com/files/photo4_4792.jpg)\n\n"
    },
    {
      "time": "28 Sep 2009 — 11:38am",
      "content": "Cheers Evan. I wonder where you could buy such a transparent foil in the UK?\n\n\\_\\_\\_\\_\\_\\_\\_\\_  \n [AL](http://web.archive.org/web/20150317151328/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "28 Sep 2009 — 11:55am",
      "content": "(I'm tracking this thread)\n\n"
    },
    {
      "time": "1 Oct 2010 — 8:35am",
      "content": "I am currently sourcing the acetate paper for this. Is anyone willing to share their resources? Where did you find the transparent red acetate? Anyone have success with the effect? Which colors did you use?  \nThanks!!\n\n"
    },
    {
      "time": "18 Dec 2014 — 1:45pm",
      "content": "I just came across this thread after tirelessly looking for the book mentioned above! Would anyone have the name? The posted links are dead after so long.\n\n"
    },
    {
      "time": "18 Dec 2014 — 2:55pm",
      "content": "Don’t know anything about the Dutch book, but the other book referenced is simply titled Sagmeister, written by Peter Hall, and published by Booth-Clibborn Editions (2001).\n\nIt features a red plastic slipcase that, when on the book, displays an image of a happy German Shepard named Xeno. When you remove the slipcase, the image of Xeno changes from friendly hound to snarling attack dog. You can see it here:  \n [http://designblog.rietveldacademie.nl/?tag=dog](http://web.archive.org/web/20150317151328/http:/designblog.rietveldacademie.nl/?tag=dog \"http://designblog.rietveldacademie.nl/?tag=dog\")\n\n"
    },
    {
      "time": "18 Dec 2014 — 7:09pm",
      "content": "\\> When you remove the [red] slipcase, the image of Xeno  \n\\> changes from friendly hound to snarling attack dog.\n\nInteresting technique. Some early black-and-white movies (such as one of the early Dr. Jekyll and Mr. Hyde movies) used red/green makeup and red/green lights to make a character's appearance change in real time. Since it was a b&w movie the audience couldn't see the color change.\n\n"
    }
  ]
}
