{
  "id": "12711",
  "title": "Freeware to convert Type1 fonts for Mac??",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hey people,\n\nI need to convert a Type1 to Truetype on Mac but the only solution is TransType, and I don't want to buy it for this one problem. Any ideas??\n\nThanks in advance!\n\n/Henriko\n\n",
  "author": "<a href=\"/web/20101013074741/http://typophile.com/user/1388\" title=\"View user profile.\">henriko</a>",
  "time": "<br>",
  "uid": "1388",
  "comments": [
    {
      "time": "",
      "content": "buy the TrueType version of the font.\n\n"
    },
    {
      "time": "",
      "content": "FontHopper is a free program that runs on OS9. It was bought out by Adobe and then discontinued (wonder why). A resourceful and patient body might be able to find an old copy lurking on the web though.\n\n"
    },
    {
      "time": "",
      "content": "Fontographer or TransType will do it. Problem with most freeware is that you may not be able to properly encode, transfer metrics, etc. You end up with a junk font. For that matter, even with commercial programs, if you don't pay attention to the proper sequences, you end up with junk.\n\nGerald\n\n"
    },
    {
      "time": "",
      "content": "Just because something is discontinued, that doesn't make it free. Finding FontHopper online somewhere for free is no more legal than finding any other retail program online.\n\nAdobe didn't continue any Ares software after acquiring the company; it was bought exclusively for its \"Chameleon\" font compression technology, which was an option in PostScript 3 devices. Look up \"Type 14 fonts\" for more info.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "I thought that software could be resold if contained on the original disk and no longer on the seller's drive. Similar to selling a used book. Is this not correct?\n\nGerald\n\n"
    },
    {
      "time": "",
      "content": "Upgrade to OSX\n\n"
    },
    {
      "time": "",
      "content": "Upgrading isn't a solution; it's just usually the only option. Someone once told me this was because of the \"chip mafia.\" Meaning, I guess, there is no reason any software can't be backward compatible; it's just that the powers that be like to have their control, and would like to have your money. I guess they need it more than you do. Don't know why. Ever read the book (or see the movie), The Time Machine?\n\nGerald\n\n"
    },
    {
      "time": "",
      "content": "Most software licenses are tranferable (though it depends on the terms). And re-reading Chad's post, I realize that it was probably referring to exactly that. Sorry for any misinterpretation.\n\nCheers,\n\nT\n\n"
    }
  ]
}
