{
  "id": "12726",
  "title": "Separating words and phrases",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am setting a large list consisting of city names and addresses (for a magazine ad). Some cities have up to 4 addresses, some have just one address. Everything should be centered (! not my “idea”), and when it is - there is just this whole list of addresses and no place for the product at all. Pretty bad, taking into consideration it is a product in a luxury segment of goods.\n\nSo I was thinking, maybe there is a way it can be centered but separated somehow different? A middle dot is the only thing which comes into my mind. What else would you use?\n\nCheers,  \nAlexey\n\n",
  "author": "<a href=\"user/1788\" title=\"View user profile.\">popovich</a>",
  "time": "<br>",
  "uid": "1788",
  "comments": [
    {
      "time": " 26 May, 2005 - 12:10pm",
      "content": "You could use a bullet or some embellishment or ornament or a line, or an ornate line.  \nOf course space can be used.  \nOr you could alternate styles to separate them (bold/light, roman/italic.  \nColor can be used too.\n\nCheers!\n\n"
    },
    {
      "time": " 26 May, 2005 - 1:15pm",
      "content": "Can you choose any fonts? I suggest convincing the client to set up the list as one paragraph using a script font like Kuensler two bold for the name of the City and Centaur for the address info.The script font will serve as an obvious indication that a new name&info is beginning. These two fonts look classy when used together. Plus the main focus is the product and not 3/4 of a page used up by space for lines and lines of typed addresses.\n\n"
    },
    {
      "time": " 28 May, 2005 - 2:22pm",
      "content": "I’ve used bullets ( • ) middle dots ( · ), slashes ( / ) and vertical bars ( | ), but I’ve grown tired of all those. I look forward to hearing separator suggestions from others.\n\n"
    },
    {
      "time": " 29 May, 2005 - 5:55am",
      "content": "I cannot really choose a font. Arial (kill me, but that’s what the design guideline says - when using a non-latin language) and, as a possibility, Engravers’ Gothic. I could use EG for city names and Arial bold and regular for store names and addresses. The list still eats up a lot of page space. My suggestion was to leave the city names, or - if that is too little - city name and a store name, without all the details… We’ll see if the idea comes through.\n\nMiddle dots and bullets could work fine together.\n\n"
    },
    {
      "time": " 31 May, 2005 - 4:05pm",
      "content": "I’ve used 3 spaces or 4 spaces for separation. A lack of type can give the reader a sense of pause and/or separation\n\n"
    },
    {
      "time": " 31 May, 2005 - 4:25pm",
      "content": "I’m sick of it now, but I’ve been known to whore myself to the double colon ( :: ).\n\n"
    }
  ]
}
