{
  "id": "12747",
  "title": "A good Chair to work.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everybody,\n\nOnce i heard about Gerard Unger´s Chair and it´s comfort to spend hours in design development.  \nI don´t know if it´s a common matter of discuss but i think it is. Do you think the same?\n\nI like one chair in particular, well 2: The Egg and the Swan (Arne Jacobsen) but i can´t afford them since they are very expensive (us$5.000 and up). They look both comfortable and with style. I dont know much about chair design but maybe there are a way to build them cheaper. I ask to a locar industrial designer here and he told me that those chair patents where finished..that´s pretty interesting if i find a model as a guide to build.\n\nMaybe some of you love comfortable modernist furniture too but the price its always unable to afford. On internet i only fond this sold out book: [http://www.digmodern.com/go/book/4079](http://web.archive.org/web/20140504090413/http:/www.digmodern.com/go/book/4079 \"http://www.digmodern.com/go/book/4079\")\n\nAnyone know where i can find something more?\n\n| Attachment | Size |\n| --- | --- |\n| [aj0437.jpg](http://web.archive.org/web/20140504090413/http:/typophile.com/files/aj0437.jpg) | 25.69 KB |\n\n",
  "author": "Miguel Hernandez",
  "time": "28 May 2005 — 2:20pm",
  "uid": "1109",
  "comments": [
    {
      "time": "28 May 2005 — 2:45pm",
      "content": "I used to spend a lot of my time in an imitation [Eames](http://web.archive.org/web/20140504090413/http:/www.designaddict.com/design_index/index.cfm/fuseaction/designer_show_one/designer_id/63/index.cfm) lounge with my PowerBook in lap. Currently I'm on my new [Crush Chaise](http://web.archive.org/web/20140504090413/http:/www.eq3.com/cat-eq3/30028-06.html) built by EQ3, with the PowerBook on their handy adjustable [Boomerang table](http://web.archive.org/web/20140504090413/http:/www.eq3.com/cat-eq3/3020-032.html). I can work this way for hours. Comfy alternative to a desk.\n\nRelated: I've started a [Mid-Century Modern group](http://web.archive.org/web/20140504090413/http:/www.flickr.com/groups/mid-century/) on Flickr and it's growing nicely. I try to post interesting deals I find on craigslist and eBay, but I guess that's not very useful to you down in Chile. Hmm.\n\n"
    },
    {
      "time": "28 May 2005 — 3:06pm",
      "content": "Reminds me of the [_Men in Black_ chair](http://web.archive.org/web/20140504090413/http:/images.google.com/imgres?imgurl=http://www.allesoverballen.com/images/stoel2.jpg&imgrefurl=http://www.allesoverballen.com/engels/BALSTOEL.html&h=296&w=247&sz=14&tbnid=EywA_QQZ2MUJ:&tbnh=110&tbnw=92&hl=en&start=1&prev=/images%3Fq%3Dchair%2B%2522men%2Bin%2Bblack%2522%26hl%3Den%26lr%3D%26client%3Dsafari%26rls%3Den%26sa%3DG). =)\n\n"
    },
    {
      "time": "28 May 2005 — 5:23pm",
      "content": "[This is the chair](http://web.archive.org/web/20140504090413/http:/www.americanstandard-us.com/trade/article_files/Champion%20One%20Piece%20Toilet.JPG) where I'm usually sitting when my best ideas come.\n\n"
    },
    {
      "time": "28 May 2005 — 6:10pm",
      "content": "Maybe too obvious, but I haven't seen a butt not like one of [these](http://web.archive.org/web/20140504090413/http:/www.hermanmiller.com/CDA/SSA/Product/0,,a10-c440-p8,00.html).\n\n"
    },
    {
      "time": "28 May 2005 — 8:37pm",
      "content": "I'm hooked on the [Herman Miller Aeron chair](http://web.archive.org/web/20140504090413/http:/www.hermanmiller.com/CDA/SSA/Product/0,1592,a10-c440-p8,00.html). Adobe is kind enough to supply these for all employees, and they are truly wonderful.\n\nI have occasional lower back problems from an accident many years ago. Not only have I had far fewer back problems since I started using the Aeron (despite having gained weight during that time), I also find that when I am having back discomfort, sitting in the Aeron is the best thing I can do - even better than lying down. A couple of years after I started at Adobe I had a recurrence of back trouble, so I went out and bought one for home as well. Since then my back has been almost trouble-free.\n\nAerons are expensive (I see them at $400-500 used, $550-800 new), but if you can scrounge the money, they're worth every penny. They have a 12-year warranty as well.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "29 May 2005 — 4:54am",
      "content": "I sit in the Aeron all day - great chair.\n\n--  \nMike\n\n"
    },
    {
      "time": "29 May 2005 — 7:36am",
      "content": "As I work at a desk where I sometimes stand I use a [ergoGenesis](http://web.archive.org/web/20140504090413/http:/www.bodybilt.com/?module=product&action=view_category&id=11) stool. It's help cut my chiropractor visits to just a few times a year. Their desk chairs are very comfortable, too.\n\nJeff Fisher :: Engineer of Creative Identity  \n [Jeff Fisher LogoMotives](http://web.archive.org/web/20140504090413/http:/www.jfisherlogomotives.com/)\n\nAuthor: [Savvy Designer's Guide to Success](http://web.archive.org/web/20140504090413/http:/www.amazon.com/exec/obidos/tg/detail/-/1581804806/ref=ase_jefffisherlog-20/103-9746903-7811817?v=glance&s=books) from HOW Design Books\n\n"
    },
    {
      "time": "29 May 2005 — 4:35pm",
      "content": "Herman Miller Aeron chair is my savior as an old geezer.\n\nChrisL\n\n"
    },
    {
      "time": "30 May 2005 — 3:28am",
      "content": "Aeron, best chair around, had mine for years now and still as good as ever. Great investment.\n\nNow if I could only afford a nice new Apple 23‘‘ Cinema Display…  \nmy butts happy but my eyes are cross(ed)…\n\n"
    },
    {
      "time": "30 May 2005 — 8:06am",
      "content": "I sit on a Eames chair, made by Vitra. Polished aluminum, black leather, coasters. Expensive, I know... but I lucked out a few years ago when Vitra opened it's new show room in my country and they had a 2-for-1 sale for one day...  \nBut I digress: on last years visit to New York I discovered a shop where they sold \"replica's\" that were a lot cheaper. The owner of the shop explained to me that he used the \"Seven Changes Method\" eg his replica's (he did a lot of those classics...) differ in at least 7 details from the original and thereby don't impede on existing copyrights and patents (so he said, please don't shoot the messenger).  \nA nice replica could be your solution...\n\n"
    },
    {
      "time": "30 May 2005 — 8:49am",
      "content": "My wife bought an Aeron chair a few years ag. I sat in it for about fifteen minutes and then went out and bought my own.\n\n"
    },
    {
      "time": "31 May 2005 — 10:16am",
      "content": "Aeron, I'm another who's back it has saved.\n\n"
    },
    {
      "time": "31 May 2005 — 4:41pm",
      "content": "What about great design furniture for short people?\n\n"
    },
    {
      "time": "31 May 2005 — 4:42pm",
      "content": "Ack, sent to soon.\n\nI sit at a desk that is too high in a chair that is too large with a foot rest. :^/ Quite a bizarre situation for me. I'm sure my posture is paleolithic because of this.\n\n"
    },
    {
      "time": "31 May 2005 — 4:46pm",
      "content": "Akira Kobayashi works standing up.\n\n"
    },
    {
      "time": "31 May 2005 — 6:32pm",
      "content": "Interesting, John. Does he have one of those soft foot pads that grocery store checkers use?\n\n"
    },
    {
      "time": "31 May 2005 — 6:33pm",
      "content": "An interesting book for those interested in thinking through this question with more than anecdotal evidence from friends and colleagues (though that info is pretty important) is Galen Cranz's _The Chair: Rethinking Culture, Body, and Design_ (Norton, 1998/paper, 2000).\n\nCranz makes a point of showing the utter uselessness and even harmfulness of many of the \"designed\" chairs (think Bauhaus, Eames, etc.), and the bad consequences of designing general office furniture for uses other than allowing us to assume a healthy posture while we do stationary work. Almost invariably the furniture in an office reflects and reinforces our (in America, anyway) nearly Puritan prejudices about what it means to be and look \"at work.\" (Hmm . . . it seems I've heard many on this site make many similar comments about typefaces that reflect concerns about idealized or preconceived notions of beauty, balance and symmetry, contrast, and so on, rather than legibility and readability. Rotis, anyone?) One irony I remember from the book: the typical \"executive\" chair is more poorly designed than the typical \"task\" or secretarial chair.\n\nCranz also discusses how what is \"comfortable\" for many, perhaps most people seems instead to be what we _imagine_ to be comfortable, what we \"know\" to be comfortable prior to or regardless of our experience (cushiness, low back supports, curved spaces for buttocks, and so on). It turns out a lot of that is mythology (though different people have different bodies, and there are exceptions to practically everything you can say about ergonomics and healthy bodies).\n\nFor what it's worth--and not to naysay those who have testified on behalf of Hermann Miller here--Cranz thinks the Aeron is about as good as it gets for a chair of its type, but it still perches the sitter with her legs and torso at 90 degrees. About 135 degrees is a better position, she echoes physiognomists in concluding, and when the torso is upright with the legs at that angle, the muscles at the front and back of the abdomen can work together to hold the sitter up. (Of course, you also need a high and inclined work surface before you, too, so as not to have to pull your head and shoulders down to your work. I have yet to figure out how to combine that with a computer.)\n\nAgain for what it's worth, she has many good things to say about Peter Opsvik's designs, most notably the balans Variable--the original with the rocking base, not the cheap flat-bottomed knockoffs. (You can see and lust after the whole dearly-priced Opsvik ouevre at Opsvik's website, [http://www.opsvik.no/index.asp?page=home&ver=6](http://web.archive.org/web/20140504090413/http:/www.opsvik.no/index.asp?page=home&ver=6 \"http://www.opsvik.no/index.asp?page=home&ver=6\").) My partner (a yoga teacher) and I are in the process of testing her ideas; I've just managed to pick up a pair of Variables (thank you, eBay!) for about 2/3rds of their normal $320 (each) price tags.\n\nFair warning: Cranz drifts into some well-meaning but treacly utopianism about the ideal office towards the end of the book. Still, you can breeze through that stuff pretty easily. It's well worth a look for people thinking about how to set up their offices and homes for better health. I know I was sold on many of her ideas--or, at least, many of her complaints resonated in my own experience, and the one thing that I (a political theorist) have in common with the designers, typographers and typesetters, and software engineers on this forum (besides a love of type) is that I spend a lot of my professional life on a chair at a desk.\n\n"
    },
    {
      "time": "31 May 2005 — 8:38pm",
      "content": "That's really interesting, Mojo. Thanks for sharing all that.\n\nWRT the Aeron, they come in three sizes (A, B and C) and are massively adjustable. So I don't see why one wouldn't be good for a short person. I'm right on the edge size-wise, so I am comfy in both the B and C models, I've found.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "31 May 2005 — 9:35pm",
      "content": "I just read Thomas's post, and, yeesh--\"mojo,\" alone in the post? I wish I'd paid attention as my account shifted over. Mojo is me, I am mojo.\n\nJust in case anyone was inclined to get something out of my contribution but is still mad at me for running on and on about Hannah Arendt this spring.\n\n"
    },
    {
      "time": "1 Jun 2005 — 8:40am",
      "content": "I've been through a number of chairs and have found either the Aeron or \"none\" to be the best. In essence, if I must sit\\*, HM makes the best chairs. You can spend $1,000(s) on these, or you can find a place that's liquidating a failed Co. and get 'em for $400-$500, which is still 2x cost, but a good deal because they last 10-20 times longer than most Companies that spend $50,000 on start-up seats.\n\n\\*As for standing, I used to split my time between modes to avoid becoming numb and because it's pretty near perfect to kern in the dancing position. Now, I'm looking forward to doing so again, and adding surfing and stuff like this (writing) from the full lounging position. This'll be complete whenever Apple's latest endangered great cat/OS is font man friendly, all again possible because the once-tossed (what do you s'pose  w e r e thin king!?) ¡ jumbo cursor is back ! :)\n\nP.S.  \nAllowed HTML tags: a em strong cite code etc.  \nLines and paragraphs break automatically.  \nWeb and e-mail addresses are automatically converted into links.  \nSmartyPants will translate ASCII punctuation characters into “smart” typo....\n\nBut I did nothing.\n\n"
    },
    {
      "time": "1 Jun 2005 — 9:35am",
      "content": "Similar to the Aeron, I use the Mirra.  \nA chiropractor and daily stretching helps too.\n\n"
    },
    {
      "time": "1 Jun 2005 — 11:15am",
      "content": "Also an Aeron junkie . . .\n\nThe sale for me wasn't necessarily because it felt so nice but because after long hours in the thing, I could get up from it feeling fine. Mind you, this chair only works with an appropriate desk and monitor at a reasonable level to save the neck . . .\n\nLest we forget, an all day Aeron complient, the all night Tempurpedic Bed :D\n\nStuart :D\n\n"
    },
    {
      "time": "1 Jun 2005 — 12:50pm",
      "content": "When I hurt my back, I asked my neighbor the occupational therapist  \nfor advice on my chair and computer set-up. She gave me some pages  \nthat were very helpful, and my back hasn't hurt since. She said that  \nthe main thing is for the chair to be adjustable, and then to adjust  \nit right.\n\nIf I remember rightly here are some points: The back should lean back  \nslightly - past 90 degrees between your upper leg and torso; your  \nupper leg should be parallel to the ground or slightly elevated (I  \ndon't remember which) and feet should be forward of your knees and  \nrest on the ground or on an angled foot rest. Your upper arms should  \nbe forward from your body. Forearm should be parallel with the  \nground, and wrist and hand in line with it, with curled fingers  \nresting on the keyboard.\n\nI want to get one of those fancy Aeron things, but with all of the  \ncorrect adjustments my standard issue Office Depot inexpensive chair  \nis quite comfortable and no back problems from sitting in it.\n\n"
    },
    {
      "time": "1 Jun 2005 — 3:00pm",
      "content": "I use a director's chair and I have no problems because I walk about 2 hours a day. Walking is great for strething the lower back. I suggest a long walk for everyone at Typecon in either Central Park or Prospect Park.\n\n"
    },
    {
      "time": "8 May 2009 — 9:39am",
      "content": "Don't get me started on Memory Foam Mattresses.\n\nLong story short; sleeping on uncomfortable hard mattress, thinks - ah, memory foam mattress, that looks really comfy, buy said comfy mattress for £640. Bliss at first, 2 weeks later - agony, like sleeping on a hammock. Solution - buy mattress topper from IKEA for £75 and put on hard initial mattress. Nice.\n\nDon't let that put you off - Super King Luxury Support memory foam mattress for sale - near mint condition - £250 anybody?\n\nNick Cooke\n\n"
    },
    {
      "time": "8 May 2009 — 10:39am",
      "content": "lol - nice way to toy with the spam Nick!\n\n"
    },
    {
      "time": "8 May 2009 — 3:38pm",
      "content": "I had an Obus Forme chair for a while, it was good for 15 years, but then the back snapped and I got an Aeron 3 years ago, which is brilliant.\n\n"
    },
    {
      "time": "9 May 2009 — 10:16am",
      "content": "I use the [Capisco](http://web.archive.org/web/20140504090413/http:/www.ergodepot.com/HAG_Capisco_p/8106.htm) chair since five years, it's a great chair.\n\n"
    },
    {
      "time": "9 May 2009 — 10:45am",
      "content": "I once worked in an office that had [Knoll Life chairs](http://web.archive.org/web/20140504090413/http:/www.dwr.com/product/life-chair.do?keyword=life&sortby=ourPicks). They are absolutely amazing. Infinitely more comfortable than Aerons. Unfortunately I cannot afford one, so I use a $99 chair from K-Mart.\n\nEventually I plan to replace my desk and drawing table with a massive Alvin worktable and just sit in a tall draftsman’s chair. I love those things.\n\n"
    },
    {
      "time": "9 May 2009 — 11:46am",
      "content": "Astronauts sleeping in zero-gravity naturally recline at about a 30 degree angle, leading some researchers to conclude that this is the best position for the human body at rest. I'm thinking about completely re-designing my work space around this concept. Get rid of the desk. Replace the chair with a kind of divan, curved to support the body comfortably in a reclined position. Have my keyboard and pointing device on a swivelling platform above my lap. Have my monitor suspended from the ceiling at an appropriate height and angle to look at from the reclined position.\n\nOf course, this might just lead to falling asleep a lot.\n\n"
    },
    {
      "time": "9 May 2009 — 12:22pm",
      "content": "John - that's exactly what I did when I worked from home. I'm convinced it's the best way to use the computer.\n\n"
    },
    {
      "time": "9 May 2009 — 12:49pm",
      "content": "[1000 Chairs](http://web.archive.org/web/20140504090413/http:/www.amazon.com/1000-Chairs-Charlotte-Fiell/dp/3822857602).\n\nPersonally, my favorite chair is one with the smallest environmental footprint possible, requires no additional consumption of resources and ideally has more than one function. Like the milk crate I found on the side of the curb.\n\n"
    },
    {
      "time": "9 May 2009 — 12:52pm",
      "content": "Stephen, do you have any photos of your set-up?\n\n"
    },
    {
      "time": "9 May 2009 — 12:56pm",
      "content": "Christopher, are you figuring into your environmental calculation future consumption of resources resulting from spinal and joint problems, regular physiotherapy or chiropractic care, painkillers, etc.?\n\n"
    },
    {
      "time": "9 May 2009 — 1:21pm",
      "content": "@ Hudson,\n\nThanks for the laugh. Having a bit of a rough day.\n\n"
    },
    {
      "time": "9 May 2009 — 1:32pm",
      "content": "[Here's a link](http://web.archive.org/web/20140504090413/http:/www.ccohs.ca/oshanswers/ergonomics/sitting/sitting_position.html) from the Canadian government that basically gives the same guidelines I passed along above, which I got from an occupational therapist.\n\nMy neighbor actually recommended not vertical, but leaning back somewhat.\n\nI found I could use the same cheap chair, properly adjusted. Of course it would be nice to have a fancier one, but for avoiding aches and pains, I think that advice on how to set up your chair, key board and screen is really the key thing.\n\n"
    },
    {
      "time": "9 May 2009 — 4:22pm",
      "content": "I don't have a photo of mine, John, but here's the [lounge](http://web.archive.org/web/20140504090413/http:/eq3.com/cat-eq3/process/locale/en_CA/currency/en_CA/page/30028-06.html) and here's the [table](http://web.archive.org/web/20140504090413/http:/eq3.com/cat-eq3/process/locale/en_CA/currency/en_CA/page/03252.html).\n\n"
    },
    {
      "time": "5 Feb 2010 — 8:18am",
      "content": "I use a [Chesterfield](http://web.archive.org/web/20140504090413/http:/www.distinctivechesterfields.co.uk/) as i love the aspect, support and the wide arms are great for piling up reference materials lol.\n\n"
    },
    {
      "time": "5 Feb 2010 — 10:06am",
      "content": "I found my next chair. The Embody.\n\n[http://www.hermanmiller.com/CDA/SSA/Product/0,1592,a10-c440-p8,00.html](http://web.archive.org/web/20140504090413/http:/www.hermanmiller.com/CDA/SSA/Product/0,1592,a10-c440-p8,00.html \"http://www.hermanmiller.com/CDA/SSA/Product/0,1592,a10-c440-p8,00.html\")\n\nLove this thread, by the way.\n\n"
    },
    {
      "time": "5 Feb 2010 — 5:51pm",
      "content": "I recently discovered the [Perfect Chair](http://web.archive.org/web/20140504090413/http:/www.humantouch.com/perfect-chairs.html), and have been trying to figure out how to get a keyboard, trackball and screen arrangement to work with this. I even sketched an all-in-one reclining work-station that would tip me into a zero-gravity position with the screen etc. moving relative to my line-of-sight. Then again, in the zero-gravity position I'd probably just fall asleep.\n\n"
    },
    {
      "time": "5 Feb 2010 — 7:00pm",
      "content": "Aeron all the way. Tempurpedic all the way. Recaro ergonomic all the way.\n\nFood and comfort are not things to skimp on.\n\npbc\n\n"
    },
    {
      "time": "10 Aug 2010 — 2:38pm",
      "content": "Why are you posting into **several** non-related threads?\n\n"
    }
  ]
}
