{
  "id": "1276",
  "title": "RIP: J.R. CASH",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've seen no sign of (typophile) acknowledgement of the passing of this great man.   \n   \nSo here is mine:   \n   \nHis music has been with me since I was a child, I am very sad to see him go.\n\n",
  "author": "Hildebrant",
  "time": "13 Sep 2003 — 12:46am",
  "uid": "1286",
  "comments": [
    {
      "time": "13 Sep 2003 — 6:59am",
      "content": "I fixed my old turntable so I could listen to the \"I walk the line\" LP, which I got from my mum when I was 8.\n\n"
    },
    {
      "time": "13 Sep 2003 — 7:11am",
      "content": "I was so hoping that he'd have won at least one of the two MTV MusicAwards he was nominated for. The video was one of the most touching I've seen in a very long time, the song is a killer and it would simply have been nice to see someone like Cash win something... anything... on a channel like MTV. Instead we get Justin Timberlake. Yeah... right. I hope now that Cash is dead, someone at MTV is kicking him- or herself in the bee-hind ;-).\n\n"
    },
    {
      "time": "13 Sep 2003 — 9:05am",
      "content": "He received a few Grammys. Forget MTV, afterall MTV is to music like KFC is to chicken.\n\n"
    },
    {
      "time": "13 Sep 2003 — 9:37am",
      "content": ":-)   \nI really wuld have liked that though, it would have been so against the grain of what MTV usually stands for. I was utterly surprised to even see Cash nominated and thought it would have been neat if the old man snatched away the moon man from singers that grew out of drawing-board-designed boy bands. I'm not that big a fan of Cash, but it would have been a great moment anyway.\n\n"
    },
    {
      "time": "13 Sep 2003 — 12:32pm",
      "content": "Some words about songs and Cash by Tim Robbins.   \n   \n ![JCASH](http://web.archive.org/web/20131020185550im_/http:/www.typophile.com/forums/messages/30/16151.jpg)   \nFrom the Score for \"Dead Man Walking\" (Including \"In Your Mind\" by J Cash). Columbia, Sony.   \nBooklet Design: Christine Wilson\n\n"
    },
    {
      "time": "13 Sep 2003 — 3:08pm",
      "content": "John Ritter died the same day too, don't forget.\n\n"
    },
    {
      "time": "13 Sep 2003 — 6:57pm",
      "content": "In Justin Terblake's defense:   \n   \nIt was nice to see that he said \"He didn't deserve the award, and that he was just 'accepting it' for Cash.\"   \n   \nThat in my mind was very cool.\n\n"
    },
    {
      "time": "13 Sep 2003 — 11:01pm",
      "content": "Yes, I thought so too. Sounded quite honest as well.\n\n"
    },
    {
      "time": "14 Sep 2003 — 1:18pm",
      "content": "\"General Discussions   \nAnything goes.\"   \n   \nIf what your saying is true -- maybe this should not be the title of the area in the forum. Maybe it should be   \n   \n\"General Discussions   \nAnything TYPE related goes.\"   \n   \nTo me, and maybe I'm crazy for thinking this, anything goes, means anything goes. To me this means anything from the perspective of a member of the type community.   \n   \nno?   \n   \nhildebrant.\n\n"
    },
    {
      "time": "14 Sep 2003 — 2:26pm",
      "content": "No problem.   \n   \nMore a statement than anything.\n\n"
    },
    {
      "time": "21 Sep 2003 — 7:08am",
      "content": "my baseball team in london has used 'Ring of Fire' as a theme song since the beginning for the Richmond Flames. [www.londonbaseball.co.uk](http://web.archive.org/web/20131020185550/http:/www.londonbaseball.co.uk/)  \nhas a story since the day he died on the first link below the main story, 'Cash goes down swinging'. There was a nice piece on NPR yesterday about June Carter Cash.\n\n"
    },
    {
      "time": "21 Sep 2003 — 12:50pm",
      "content": "\\>anything goes, means anything goes   \n   \nSure, but especially appreciated are comments on typography associated with Johnny Cash (Yay, Ignacio).   \n   \nNot being a Cash fan, I draw a blank there. (But would have been willing to discuss the cover of \"London Calling\" at great length.)\n\n"
    },
    {
      "time": "21 Sep 2003 — 3:10pm",
      "content": "London Calling.. Clash ... it was a copy of Elvis LP cover... It was a punk copy of king rock Elvis..Poor Joe Strummer..\n\n"
    },
    {
      "time": "21 Sep 2003 — 10:46pm",
      "content": "\\> There was a nice piece on NPR yesterday about June Carter Cash.   \n   \nYeah I cought that, it was a re-play from the show they did right after she died. She was quite a spectacular women too. It was inspiring to see how much in love they were after soo many years. Something Johhny never failed to do was praise his wife and keep there relationship as fresh as the day they met.   \n   \nHildebrant.\n\n"
    },
    {
      "time": "14 Sep 2003 — 11:08am",
      "content": "_I've seen no sign of (typophile) acknowledgement of   \nthe passing of this great man._      \nWell, we can't be _too_ inclusive, can we? This still   \n_is_ a type related board. I don't think this thread   \nreally belongs here. And BTW recently Joe Strummer   \ndied too, and what about Katharine Hepburn, and so   \non and so on... Where does it stop?   \n   \n_He received a few Grammys. Forget MTV, after all MTV   \nis to music like KFC is to chicken._      \nGrammys don't mean $h!t neither, pardon my French.   \n   \nDon't get me wrong: as a musician in a rock band,   \nI held the man in great esteem and am saddened by   \nhis passing, BUT it wouldn't have bothered me if   \nthis hadn't been mentionned on Typophile.\n\n"
    },
    {
      "time": "14 Sep 2003 — 1:44pm",
      "content": "Okay with me. I just tried to find an answer to the thing   \nthat puzzled you:   \n_\\> I've seen no sign of (typophile) acknowledgement of   \nthe passing of this great man._\n\n"
    }
  ]
}
