{
  "id": "1277",
  "title": "Handwritten Letters vs Email",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Good day. I am working on solving the problem of understanding the much more intimate feeling one receives from getting a letter in the mail, verses receiving an email in their inbox... I am working on solving this problem typographically and have looked at numerous script typefaces, such as work by Jill Bell, Hermann Zapf, the typeface Dalliance along with many others. And I ask: What makes a good \"handwritten\" face?   \n   \nAnd: What kind of application could give the same effort, care, love & time that is put into a handwritten letter?   \n   \nI have a couple of ideas, but I haven't hit the lightbulb, any help would be appreciated. Thanks!   \n   \njessie\n\n",
  "author": "jrepovsch",
  "time": "13 Sep 2003 — 10:33am",
  "uid": "1430",
  "comments": [
    {
      "time": "13 Sep 2003 — 12:59pm",
      "content": "On an handwritten letter, you have not only the forms of the letters used, but the texture, the color, the size, the smell, the noise from the paper, you have also the envelop you need to open, you have the stamps, in fact, many many small details who can't be compared to a perfect screen of a computer.   \n   \nSo, its not Zapfino who will solve alone the problem. Sadly...\n\n"
    },
    {
      "time": "13 Sep 2003 — 1:34pm",
      "content": "I think the central problem is essentially insurmountable. :-(   \n   \nThe \"warmth\" from handwriting I think comes from two things:   \n1) Handwriting -especially handwriting that's read by _others_- is getting rarer, and this creates an aura of value.   \n2) It's different for every person writing.   \n   \nI guess #1 could theoretically be overcome by using a font that's so variable that the reader can't tell it's type. Problems with this:   \n- It's technically very difficult. The Letterror twins have done some work in this direction, but as seminal as it is it's not the real thing.   \n- It's very hard to tell if it's working or not, because of the difference between conscious deliberation versus our subconscious \"firmware\". Merely asking a reader if he thinks it's handwriting or type doesn't cut it.   \n   \nAs for #2, it's much much trickier! How do you make a font vary -convincingly- for each person? For one thing, no current (or past) font technology [I know of] supports such variance. But even if it did, the hypercomplex code would have to be written. I actually know [of] only one person doing something like this: Vlad Atanasiu, who recently finished a PhD dissertation on the quatification of Arabic calligraphy. His work is jaw-dropping, and makes even Tomas Milo's herculean efforts in making Arabic type look authentic seem oversimple. BTW, it's interesting that even though Latin is much more widespread and the west generally engages in quantification more than anybody else, nobody has tried to do for Latin what Atanasiu and Milo are doing for Arabic, at least not at all convincingly.   \n   \n--   \n   \nThe thing is, why do you want to do this? Certainly \"warmth\" is generally a good thing to convey, I agree. But in terms of emulating handwriting, since it's technically so difficult, and I'd say essentially anti-typographic, maybe there's another way to convey warmth in type? I would have to admit that it's much harder, or at least a lot less obvious. But maybe the qualitatively greater capacity of type to express abstraction can be used to convey a warmth of universalities, as opposed to individualities? Dunno.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Sep 2003 — 5:01pm",
      "content": "Both of your answers are sort of what I expected, I thought, maybe, just maybe, I was over looking something.   \n   \nWhen it comes to looking at the work of Vlad Atanasiu is there any out right now that is not in french?? or is his studies that recent?? In a nutshell what is it that makes his work so much more authentic than Thomas Milo's?? Is it simply making \"the eye think it's written?\"   \n   \nAnd to go off of the feeling of \"warmth\" in a handwritten letter, do you think it is the familarity of someone elses handwritting that conveys that for a person? Or is it all of the idiosyncrasy?   \n   \n???   \njessie\n\n"
    },
    {
      "time": "13 Sep 2003 — 5:49pm",
      "content": "Hrant: where can we can \\*see\\* the work of Vlad Atanasiu? I echo Jessie's curiosity about this person's work. I'm really regretting not being able to witness the goings-on at TypeCon this year, what with the slew of Arabic-related discussions.   \n   \nedit: Or am I thinking of ATypI? Either way, not gonna be there.   \n   \nAlan\n\n"
    },
    {
      "time": "14 Sep 2003 — 1:34pm",
      "content": "First: I think my comparison between the work of Atanasiu and that of Milo was misleading. If I left the impression that the former is somehow a superset of the latter, that is not correct. Milo applies the intricate rules of Arabic calligraphy to render arguably the best Arabic type out there (if you subscribe to the chirographic school). Atanasiu first of all doesn't even have any software (public or otherswise) that actually does typography; his project involves the quantification of actual hands in Arabic calligraphy, such as that of ibn Muqla, and his algorithms work with continuums, so you could automatically render a hybrid hand between two \"presets\" for example; conceivably this means he can extend his work to render handwriting differently for each person, possibly by defining parameters like \"speed\", \"confidence\" or who knows what else. Vlad has a book out\\*, and it's one of the most wonderful works I've ever read, not least because he fuses the aesthetic and mathematical spheres in that ancient way that hasn't been fashionable since the Enlightenment, even though it's really the most natural and effective way to explore reality. One small insight into this \"style\" is a graph in his book: it shows the letter usage frequency for half a dozen or so Western langages, with an illustration of a... full-on winged jinni sitting on top of it! :-\\> As if to remind us: \"Don't forget the whole point of your humanity\"! Too much - too good.   \n   \n\\* [http://www.typophile.com/forums/messages/30/2371.html](http://web.archive.org/web/20131018212357/http:/www.typophile.com/forums/messages/30/2371.html)   \n   \nHere's Atanasiu's site:   \n [http://www.atanasiu.freesurf.fr/thesis/](http://web.archive.org/web/20131018212357/http:/www.atanasiu.freesurf.fr/thesis/)   \n   \nBTW, both Vlad and Thomas are very interesting characters in person, and I personally feel a link with both of them: the former because of that ancient style of science that [I hope] I share, while the latter because he has experienced the Lebanese Civil War.   \n   \n--   \n   \n\\> is his studies that recent??   \n   \nThe book came out in 2000, but there's only the French version. His PhD defence was this past May - which reminds me that I should ask him how it went... The paper was a 244-page tour de force, but also in French.   \n   \n\\> \"warmth\"   \n   \nI think most of all it comes from the reader knowing (or actually, merely thinking) that somebody used the tangible world to create it. This didn't used to be a big deal, but since the Industrial Revolution and especially the Computer Age, it's gained inceasing value mostly through its rarity, but also because in the end humans are at least half physical things.   \n   \n--   \n   \nAlan, the Arabic \"symposium\" is at ATypI-Vancouver in less than 2 weeks. I too will have to miss that event, sadly. But Prague for sure.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Sep 2003 — 11:33am",
      "content": "I think the 'warmth' of a letter has a lot less to do with anything type-related and a lot more to do with the simple fact that it took more effort on the senders part to get it to you.   \n   \nThat said, I hate paper mail these days. Way too inconvenient. ;o)\n\n"
    },
    {
      "time": "15 Sep 2003 — 1:31pm",
      "content": "Something just hit me like a ton of broad-nib pens:   \n   \nA very big difference between manual versus mechanical   \nwriting is that in the latter corrections are invisible.   \n   \nIt's not that there are no typos (in fact there might   \nbe more, or at least of a different kind), it's that   \nyou can fix typos (or simply change your mind about   \nwhat to write) without the reader seeing that.   \n   \nThis is I think even more important than the usual   \ndifference people point out about handwriting and   \ntypography: that no two letters are exactly alike.   \nIn fact the mechanics of saccades (where one can   \nsee only a maximum 4 letters totally clearly, and   \nwhere arguably the short term memory about exact   \nletterforms isn't retained between fixations) can   \nmean that if you have like three variants for each   \nletter and use them in a cyclic fashion (just like   \nthe Letterror boys do) then you're OK there.   \n   \n--   \n   \nBut since this is issue is at the type composition   \nlevel (as opposed to type design) type designers are   \noblivious and/or powerless about it - so it's the job   \nof the software, but maybe with help from OpenType?   \n   \nSo if you want a typographic system (as opposed to just   \na font) to be a convincing substitute for handwriting, it   \nmust incorporate a way to show mistakes/changes\\_of\\_mind.   \n   \nAlso: Analysis of how people type with typewriters (at least   \nthose that don't allow correction) might give some insight.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Sep 2003 — 6:21pm",
      "content": "No handwriting font or font technology could replace the warmth and human quality of handwriting. It's the direct, physical act of writing that makes it so unique, so human.   \n   \nI grew up without any mechanical means to write other than to do it by hand. When I was in school, we produced class magazines by handwriting. Informal posters, notes, letters, handouts, everything was handwriting. Very few things were typewritten even (with manual Chinese typewriters!). If I wanted type, the only way to get it was to get it from a typesetting firm. There was a clear distinction between published and informal work. We're losing that all thanks to the computer. I still love handwriting things. The very act of writing is so satisfying and so contemplative.   \n   \nI write in English most of the time now, and I must say I really like the computer as a tool for writing. I can type so much faster than I can write, so using the computer to write is so much more efficient for me. But at the same time it's also sad that we don't see handwriting so much any more.   \n   \nThe case is reversed for Chinese. My Chinese typing is extremely slow, so writing on the computer is an extremely tedious process. I simply can't write efficiently in Chinese on the computer. But then again writing by hand in Chinese is also a slow process. That's why handwriting is still used a lot in Chinese-speaking countries. And good handwriting continue to be an important skill to have. As the Chinese say, handwriting is a person's clothes.   \n   \nWe need to move away from handwritten fonts, I think. A good everyday, informal typeface should not be a handwriting typeface. Ligatures and OpenType is not a solution. On the other hand, we need to revive and sustain handwriting in our increasingly typeset world!\n\n"
    },
    {
      "time": "31 Oct 2003 — 2:42pm",
      "content": "\\> So if you want a typographic system (as opposed   \n\\> to just a font) to be a convincing substitute   \n\\> for handwriting, it must incorporate a way to   \n\\> show mistakes/changes\\_of\\_mind.   \n   \nI just ran into a very interesting article in an old issue of Journal of Typographic Research: \"Slips of the pen\" by Andrew Ellis (V13, #3). It tries to quantify the mistakes during handwriting, and I think it might serve as a great starting point for faking handwriting digitally.   \n   \n----   \n   \nBTW, this post is my 10^12-th, which means it's time for me to take 12 months off from Typophile.   \n   \nhhp\n\n"
    },
    {
      "time": "31 Oct 2003 — 2:45pm",
      "content": "PSYCH! :-\\>   \n   \nhhp\n\n"
    },
    {
      "time": "31 Oct 2003 — 5:46pm",
      "content": "There are some nice handwritten faces at [Fontana](http://web.archive.org/web/20131018212357/http:/www.fontanatype.hu/home.html). There home page also makes a fair attempt a creating warmth through the paper texture and classic print styles and line drawings. Still, it's _far_ cry from an actual handwritten letter.\n\n"
    },
    {
      "time": "1 Nov 2003 — 6:06am",
      "content": "The term junk mail came well before the personal computer. Things that make junk mail obvious are bold graphic statements on the envelopes. The only envelopes I open (other than bills) are plain envelopes that have no graphics on them and a simple return address, no logo. More often than not it a sales promotion, but they achieved their purpose, I opened the envelope. With e-mail I have filters that do most of the work, I'd say 75% and I just can look at the sender and tell the other 25% of the junk and delete it with no eyeballs on it. I don't think type has any bearing on mail, but handwriting would. Just my opinion, Dan\n\n"
    }
  ]
}
