{
  "id": "1278",
  "title": "(x) Diet Cherry Coke - Aspire {James Gareth}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello All,   \n   \nI thought I had this one licked when I first saw it. I thought it was Smudger. Upon investigation though, it didn't match. Can't help but think it's familiar. Does anyone have any idea?   \n   \nAny help appreciated.   \n   \nJames ![](http://web.archive.org/web/20050528000411im_/http:/www.typophile.com/forums/messages/83/16155.jpg)\n\n",
  "author": "James Gareth",
  "time": "Sat, 2003-09-13 13:23",
  "uid": "1797",
  "comments": [
    {
      "time": " Mon, 2003-09-15 12:11",
      "content": "Yves,   \n   \ndon't insult Coca-Cola. coke and freeware? no way ![:-)](http://web.archive.org/web/20050528000411im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n   \n   \nDavid Hamuel\n\n"
    },
    {
      "time": " Mon, 2003-09-15 13:55",
      "content": "![:-)](http://web.archive.org/web/20050528000411im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " Wed, 2003-09-17 15:02",
      "content": "Here's another sample. I hope this one makes it easier to recognize to someone. It's gone beyond what's needed for work. I just want to know what it is now. I hope this helps.   \n   \nIt has a felt tip sort of flavor. I'm sure it's not freeware either.   \n   \n ![Diet Cherry Coke Logo Typeface](http://web.archive.org/web/20050528000411im_/http:/www.typophile.com/forums/messages/83/16343.jpg)\n\n"
    },
    {
      "time": " Wed, 2003-09-17 15:33",
      "content": "Wow! This was hard. Do you guys ever get obsessed about finding out what a particular typeface is? This one wouldn't let me go.   \n   \nI thought this one would have been Adobe or something similar since the Diet Vanilla Coke design used Robert Slimbach's Caflish script. Obviously no one recognizes immediately putting that idea out to pasture. Nothing similar at myfonts.com after exhaustive searching, nothing at the fontbureau, nothing at fonthaus or houseindustries. Since T-26 was included in the myfonts.com search I left it alone. Just for grins though and perhaps out of desperation I went to the site, and checked under script. Nothing. However, when I saw the tiny down arrow and scrolled down further, there was another category--Handdrawn. I clicked it. There in my face was \"Aspire\", the very font I had been looking for. Designed by One Way Out. Kind of a surreal moment when you find what you've been looking for. Whoooo hooo!!\n\n"
    },
    {
      "time": " Sun, 2003-09-21 06:21",
      "content": "In the future, you might also want to consider looking for handwritten fonts in my Script Font ID Guide. \"Aspire\" was displayed in Part 11, Everyday Hand-Printing, right at the [top of page 4 (of 19) in that category.](http://web.archive.org/web/20050528000411/http:/bowfinprintworks.com/Script11Pg4.html)\n\n"
    },
    {
      "time": " Sun, 2003-09-21 07:17",
      "content": "Thanks Yves. It's an ongoing work that started just over 2 years ago, and I have had a lot of help. I have gotten type samples from probably 40 or more people scattered all around the world, including some of the foundries and designers themselves. It's been a very gratifying collaborative effort that I am trying to make into the most comprehensive Guide to hand-drawn fonts you can find anywhere, online or in print. The [Script Font Reference List](http://web.archive.org/web/20050528000411/http:/bowfinprintworks.com/ListPages/ScriptListAB.html) that goes with it, lists every font and its source, designer and date of design, along with alias names, and other information, as well as who supplied the sample, and where it can be found in the Guide.   \n   \nIt's one of three Font ID Guides I have online at my site. The first was [The Bauhaus-style Font ID Guide](http://web.archive.org/web/20050528000411/http:/bowfinprintworks.com/BauhausFaces.html), followed by the Script Font ID Guide, and the other current project is the [Sans Serif Font Identification Aid/Guide](http://web.archive.org/web/20050528000411/http:/bowfinprintworks.com/SansIDPage.html), which uses 7 letters (a, e, g, G, M, R and y) as keys to help identify Sans Serif font families.   \n   \nI have plans for a Serif Font ID Guide using a similar approach to the one in the Sans ID Guide. I have always been dreaming of using an identification Key scheme like that used in natural history books to identify fish, plants and insects, but applied to fonts.   \n   \nWanna help? I'm always looking for volunteers. :-)\n\n"
    },
    {
      "time": " Sun, 2003-09-21 09:05",
      "content": "\\> points for persistaciousness\\* and thoroughnicity\\*!   \n   \n\\> \\*I know I know I just contamimade those up...   \n   \n   \nYves, you might like:   \n   \n [http://www.enlumine.com/](http://web.archive.org/web/20050528000411/http:/www.enlumine.com/)\n\n"
    }
  ]
}
