{
  "id": "12783",
  "title": "URGENT - Cyrillic characters won't display.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "We received a Russian translation for a Dutch brochure as an MS Word document. Our contact in the Netherlands says the text opens and displays perfectly on her PC, but when we open the document on our Macs or import it into Adobe InDesign CS all cyrillic characters are substituted by underscores. We have tried this using different fonts — the default Arial (which I presume is Unicode), Myriad Pro OpenType, Helvetica LT OpenType and Pragmatica. Neither of them do the job.\n\nDoes anyone know if there is a way I can check which coding was used for this Cyrillic text, or is there anyone who is willing to take a quick look at the attached text and tell me what I need to do to access the cyrillic characters?\n\nThank you very much,\n\nYves\n\n| Attachment | Size |\n| --- | --- |\n| [AAE leaflet - final Russian2.doc](http://web.archive.org/system/files?file=AAE%20leaflet%20-%20final%20Russian2.doc) | 44 KB |\n\n",
  "author": "troubleman",
  "time": "Mon, 2005-05-30 07:08",
  "uid": "110",
  "comments": [
    {
      "time": " Mon, 2005-05-30 07:55",
      "content": "Hi Yves,\n\nI opened the file in Word (latest version for Mac) and changed the typeface to Myriad Pro and it displays something that looks a lot like real Russian to me.  \nSo it appears to be Unicode…  \nHope this helps.\n\n"
    },
    {
      "time": " Mon, 2005-05-30 07:59",
      "content": "Elaborating: I also tried copying over the MS Word text (set in Myriad Pro) into an InDesign doc. At first this displays as a lot of gobbledygook (default font is Myriad). Changing font formatting to Myriad Pro solves this. Seems to me be the same as the Word file…\n\n"
    },
    {
      "time": " Mon, 2005-05-30 08:42",
      "content": "I’ve made two text files from the document: one Unicode encoded and one Mac Cyrillic encoded (in case you need something to work with 8-bit fonts).\n\nBut what the heck happened to the ‘upload attachments’ function in Typophile??? It has disappeared.\n\n"
    },
    {
      "time": " Mon, 2005-05-30 14:45",
      "content": "“But what the heck happened to the ‘upload attachments’ function in Typophile??? It has disappeared.”\n\nOther “Enquiring Minds” also want to know. Is this just a temporary Beta thing?\n\nChrisL\n\n"
    },
    {
      "time": " Mon, 2005-05-30 14:47",
      "content": "Hi Bert and John, thank you so very much for looking into this.\n\nBert, it is weird that you did what I think was the same as I did and it works for you but not for me. I’ll try a couple of different settings, because if it is Unicode it should indeed display correctly in InDesign CS with Myriad Pro. This is very frustrating…\n\nJohn, that’s great of you to convert the document into text files. I know the attachments are not working yet — the Punchcut guys are working on it and this feature should be back shortly. If you could e-mail them to me I’d be much obliged, thanks. Please send them to [yves@makingmagazines.be](mailto:yves@makingmagazines.be)\n\n"
    },
    {
      "time": " Tue, 2005-05-31 00:57",
      "content": "Thank you everyone, some additional fiddling solved the problem. I still don’t get it why it didn’t work in the first place. I have one relieved lay-out girl sitting next to me. :-)\n\nAbout the attachments — Jared said “soon”. I’ll let _you_ know more as soon as _I_ know more. :-)\n\n"
    }
  ]
}
