{
  "id": "1279",
  "title": "Font names and copyright",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi   \n   \nI was interested to see that a 'Large Foundry' have threatened legal action against Cape Arcona Fonts for a font name which is similar. And that Cape Arcona have changed the name of that font as a result.   \n   \nI wondered if anyone knows where the law stands on this kind of issue, are there any cases where this has reached court.   \n   \nAs a german based firm, is Cape Arcona liable to the law as it is judged in Germany, or can it be called to account by a US firm in the US where copyright of font name is more strongly protected.   \n   \nJim   \n===\n\n",
  "author": "union",
  "time": "14 Sep 2003 — 4:10am",
  "uid": "614",
  "comments": [
    {
      "time": "14 Sep 2003 — 5:05am",
      "content": "Jim --   \n   \nJust to clarify: Typeface names are protected (if at all) by **trademark** law, not copyright. That is, typeface names can be protected as product names -- elements of business and trade -- not as intellectual property.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "14 Sep 2003 — 12:41pm",
      "content": "Nick Curtis was being sued by Berthold for the same thing. The names were different, but still infringing :rolleyes:   \n   \nI haven't heard anything new about it, however.\n\n"
    },
    {
      "time": "15 Sep 2003 — 7:01am",
      "content": "\"I wondered if anyone knows where the law stands on this kind of issue\"   \n   \nTypically, the law stands on the side of those with the bigger lawyers and bankroll.   \n   \nWell, to be fair, the law may not stand on their side, but the litigation procedures favor their side negating the need for the law to really ever get involved.\n\n"
    },
    {
      "time": "15 Sep 2003 — 9:48am",
      "content": "The law is made by the rich, for the rich.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Sep 2003 — 9:52am",
      "content": "Which \"large foundry\" is sending the letters?\n\n"
    },
    {
      "time": "15 Sep 2003 — 12:38pm",
      "content": "In the UK the person who looses a case has to pay the fee's of both parties. Is that not the case in the US & Germany?\n\n"
    },
    {
      "time": "15 Sep 2003 — 3:08pm",
      "content": "How about naming a font as Hertbold or Huckfertbold?\n\n"
    },
    {
      "time": "15 Sep 2003 — 6:04pm",
      "content": "\\> Now that that's made very clear...   \n   \nRiiight. You need to realize that such disclaimers only fend off potential _legitimate_ lawsuits...   \n   \n\\> they fake the whole \"Berthold successor\" thing.   \n   \nTell that to Baseline magazine, RE their most-recent directory (digital font foundries)...   \n   \nhhp\n\n"
    },
    {
      "time": "15 Sep 2003 — 6:07pm",
      "content": "\\> sue as a way to eliminate competition.   \n   \nIt's worse than _that_ - it's simply to make money - it's a business.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Sep 2003 — 1:12am",
      "content": "Burthold   \n   \n\"OK, lets start a fund, everyone give ten dollars and we'll register a trademark 'fuckberthold' for use as a font name worldwide.\"   \n.....   \n   \nA typefounders\n\n"
    },
    {
      "time": "19 Sep 2003 — 7:57am",
      "content": "By the way, here's another example of Berthold's litigious bullying: they sued Myfonts in June.   \n   \n [http://cgm.cs.mcgill.ca/~luc/bertholdvsnick.html](http://web.archive.org/web/20131015071403/http:/cgm.cs.mcgill.ca/~luc/bertholdvsnick.html)\n\n"
    },
    {
      "time": "19 Sep 2003 — 8:03am",
      "content": "Uh, sorry, I thought that was a big scoop. Looks like Luc is staying on top of this one.\n\n"
    },
    {
      "time": "19 Sep 2003 — 1:49pm",
      "content": "another frivolous lawsuit...   \n   \nAbercrombie & Fitch is suing American Eagle to   \nprevent AE from using the number '22\"   \non its apparel.   \n   \nAbercrombie claims a \"common-law\" trademark   \nand has sued AE several times in the past   \nunsuccessfully.   \n   \nCould Berthold be suing to get some insight into   \nmyfonts/bitstream's finances?\n\n"
    },
    {
      "time": "19 Sep 2003 — 1:59pm",
      "content": "Little late to seeing the 17-pg. declassified PDF,   \nbut I find it priceless. Nice work putting that together   \nStefan.   \n   \nKeep giving Berthold rope...\n\n"
    },
    {
      "time": "19 Sep 2003 — 3:16pm",
      "content": "Well, DIN was never really a font.   \nIt's basically to FF DIN what \"Highway Alphabet Series E(Modified)\" is to Interstate.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Sep 2003 — 9:56am",
      "content": "\\> _Well, DIN was never really a font._   \n   \nIt's still a font, Hrant. It's displayed in my 1985 Letraset catalogue as DIN 16(m), DIN 17(m), and DIN 17. What would make it \\*not\\* a font? The fact that it was an industrial or governmental standard? I'm just curious as to your rationale. Quite frankly, I consider Highway Alphabet Series E (Modified) a font as well...\n\n"
    },
    {
      "time": "20 Sep 2003 — 1:57pm",
      "content": "\\> [DIN is] displayed in my 1985 Letraset catalogue   \n   \nOh yeah? Huh, I thought it was only used internally by the German highway system. So then sure, it is a font - as long as the spacing is defined too\\*. And I guess I'm with Joe about wondering why the FF DIN name was not an issue. Maybe because both the Letraset one and FF one are derived from the original German highway one, and _that_ one is in the public domain? In the same way that there are many fonts that look like Interstate, but FontBureau can't complain.   \n   \n\\* If there's no spacing info, you could say it's not really a font - it's just a bunch of letters. A font is notan, not just the blackbodies.   \n   \n\\> I consider Highway Alphabet Series E (Modified) a font as well.   \n   \nWell, even though it's in the public domain (which is probably why the name is not protected - except it's too clunky to \"borrow\" anyway), since from what I know it's a bunch of letterform drawings with spacing definitions, then I guess it is indeed a font, even though it requires a human to render it by hand (the way it's \"encoded\") - kinda like Letraset in fact!   \n   \nhhp\n\n"
    },
    {
      "time": "20 Sep 2003 — 4:16pm",
      "content": "\\> _So then sure, it is a font - as long as the spacing is defined too_   \n   \nJust like all Letraset dry-transfer lettering, the character spacing is defined by little tick marks positioned at the baseline of each character. By matching up the ends of the ticks, you would approach reasonably correct letter spacing. (Subjective kerning and tracking decisions aside.) As you said, if it's 'a bunch of letterform drawings with spacing definitions, then I guess it is indeed a font...' Well, that sounds like a sheet of Letraset to me.   \n   \ng.\n\n"
    },
    {
      "time": "20 Sep 2003 — 4:26pm",
      "content": "Considering Interstate was derived from the glyph shapes and spacing published in the MUTCD it has no right to complain about look alikes, but it does have a right to complain about pirated font software.   \n   \nThe Highway Alphabet Series B, C, D, E, E(mod) and F exist both as; drawings & spacing charts, stand alone fonts and as integrated fonts in various sign creation applications. (SignCad, TraffiCad, etc)   \n   \nIf the design is a typefce and the software is a font then the Highway Alphabet series exists as both, but was only published in the MUTCD as a typeface.   \n   \nJames\n\n"
    },
    {
      "time": "21 Sep 2003 — 1:01pm",
      "content": "Come on, let's use the word \"font\" accurately. In digital terms, how about \"A software utility that sets type.\"?   \nThat distinguishes it from a typeface. And from a page-layout application.   \n   \nCould you call a draftsman's template (Just imagine using a DIN template with a Rapidograph pen) a font?   \n   \n\\*\\*\\*   \n   \nAlso in the Highway Gothic \"genre\", Ray Larabie's \"Blue Highway\" (He must have been a Billy Idol fan...)\n\n"
    },
    {
      "time": "21 Sep 2003 — 1:20pm",
      "content": "\\> Could you call a draftsman's template ... a font?   \n   \nWhy not? Just because there's no technology to actually render it a blazing speeds doesn't mean anything. It's a font. And this is coming from one of those uptight purists. :-)   \n   \nhhp\n\n"
    },
    {
      "time": "14 Sep 2003 — 2:47pm",
      "content": "The case zangofonts:   \n [http://www.zangofonts.com/bertholdlegal.html](http://web.archive.org/web/20131015071403/http:/www.zangofonts.com/bertholdlegal.html)   \n [http://typographi.ca/000500.php](http://web.archive.org/web/20131015071403/http:/typographi.ca/000500.php)   \n   \nInteresting, in the letter Melissa M. Hunt uses the term \"Berthold Types Limited (\"Berthold Types\") is the successor to the H. Berthold type foundry and ...\" This is not true!   \nBerthold Types GmbH was bankrupted without any legal successor. The Hunts bought the trademarks and some of the digital outlines and photo type data before this happened. So all the rights are based on trademarks only. Berthold is dead.   \n   \nHRB 31501 Berthold Types GmbH (Teltowkanalstr. 1 - 4, 12247 Berlin). Die Gesellschaft ist infolge rechtskr\n\n"
    },
    {
      "time": "14 Sep 2003 — 3:35pm",
      "content": "OK lets start a fund, everyone give ten dollars and we'll register a trademark 'fuckberthold' for use as a font name worldwide.\n\n"
    },
    {
      "time": "15 Sep 2003 — 1:17am",
      "content": "they approached me again. Cosmolab, as we renamed it, is still too similar to Cosmos. Funny isn\n\n"
    },
    {
      "time": "15 Sep 2003 — 5:59am",
      "content": "Stefan,   \n   \ntry Cosma, Cozma or Costa. C=K?\n\n"
    },
    {
      "time": "15 Sep 2003 — 3:40pm",
      "content": "[ Moderator Comment: Typophile cannot be held liable for   \nany comments, remarks or statements made by public   \nusers of these forums. Opinions posted here do not   \nnecessarily represent the viewpoint of Typophile. ]\n\n"
    },
    {
      "time": "15 Sep 2003 — 3:45pm",
      "content": "Now that that's made very clear...   \n   \nI wish somebody had a list of the font names out there that   \nhave been litigated over, and by whom. I'm sure it would be   \nvery telling to see which are legitimate and which are   \nfabricated.\n\n"
    },
    {
      "time": "15 Sep 2003 — 4:49pm",
      "content": "Do not blame on Berthold, it was a fine type foundry. Blame the Hunts - they fake the whole \"Berthold successor\" thing. [http://www.myfonts.com/foundry/berthold-ag/](http://web.archive.org/web/20131015071403/http:/www.myfonts.com/foundry/berthold-ag/)   \n   \nIs someone thinking that Kurt Weideman or URW gets a cent of the sales of the Corporate series from the bertholdtypes site?\n\n"
    },
    {
      "time": "15 Sep 2003 — 6:04pm",
      "content": "So, don't hate the game, hate the playa?   \n\\_\\_   \n   \nJim, I believe that's the case in the US also.   \n   \nIt's a legal game of chicken, played by people with money   \nto scare the people without money.   \n   \nSpeaking generally (since the practice isn't limited to the   \ntype industry) it's common for firm A to threaten firm B,   \nin full knowledge that they (firm A) don't have the legal   \ngrounds to win. They just know firm B doesn't have the   \nfunds to engage in a long legal battle. In many instances   \nfirm B would go bankrupt before they could win and have   \ntheir court costs paid by firm A. So firm B just has to suck it   \nup and change their behavior or compete differently or   \nwhatever the issue is.   \n   \nI should finish by saying I'm all for the use of the law when   \nit's necessary to protect legitimate copyrights / trademarks /   \ntrade names / trade dress / et cetera. It just pains me when   \npeople can't see how to make a real living and just sue as a   \nway to eliminate competition.\n\n"
    },
    {
      "time": "18 Sep 2003 — 3:39am",
      "content": "I visited Cape-Arcona.com today and saw on their first page, that Cape Arcona took down their font CA COSMOLAB.   \nFolks, you know they had problems with that big font foundry (it's Berthold right?) because CA renamed his CA COSMO who was to similiar to Bertholds font COSMO.   \nAnd after that, Bethold claimed, that the announcement that they renamed the font is not legal and that they must rename CA COSMOLAB to some other name WITHOUT mention that to CA customes. It's insane!   \nHaha, on a sidenote, they say \"thank you\" to the \"unnamed type foundry\" that they made Cape Arcona famous for that.\n\n"
    },
    {
      "time": "19 Sep 2003 — 1:35am",
      "content": "Or a font called \"The Hunts\" using the styles \"Melissa\" & \"Harvey\".   \n   \nGerlad: This \"legal fund\" needs an efficient lawyer too, knowing the bad practices of the Hunts.\n\n"
    },
    {
      "time": "19 Sep 2003 — 2:40am",
      "content": "Cape Arcona case update:   \n   \n [http://web1.158052.vserver.de/claudius/CA\\_catalog1.pdf](http://web.archive.org/web/20131015071403/http:/web1.158052.vserver.de/claudius/CA_catalog1.pdf)\n\n"
    },
    {
      "time": "19 Sep 2003 — 6:52am",
      "content": "That was very well done.   \n   \nI wonder if the E.F.F. would be interested in this case?   \n   \nSomeone needs to start a \"boycott Berthold\" campaign.\n\n"
    },
    {
      "time": "19 Sep 2003 — 7:51am",
      "content": "The hardest hit for the Hunts. To sue against the statement \"legal Berthold successor\".   \n   \n [http://www.bertholdtypes.com/info/pr\\_bof.html](http://web.archive.org/web/20131015071403/http:/www.bertholdtypes.com/info/pr_bof.html)\n\n"
    },
    {
      "time": "19 Sep 2003 — 2:57pm",
      "content": "Of all these instances, I can see how CA Cosmo is too   \nsimilar to Cosmo. I can see the argument that it could   \ncause confusion in the marketplace and be unfair   \ncompetition. (That said I don't get how DIN and FF DIN   \ncan exist and get along together.)   \n   \nBut is Omicron Delta too close to Delta or City Slicker too   \nsimilar to City?   \n   \n\\_\\_\\_\\_\\_\\_   \nHere's another area re: naming:   \nI worked with a creative director who once worked with   \nEstee Lauder. She explained to me that Lauder wanted to   \ntrademark a product line called Beautiful, but couldn't. The   \ntrademark folks said it was too common a word.   \n   \nYou can see this play out. If Lauder could call their line   \nBeautiful, they could potentially prevent Mary Kay and MAC   \nand anybody else from saying their products are beautiful.   \n   \nSimilarly, the agency where I worked had the same problem   \nwhen they were naming JetBlue. One possible name was   \n\"it.\" They took the name (and a few others) all the way   \nthrough the review process and got stuck in legal because   \nthe name was, again, too ubiquitous to trademark. (The   \nFAA had the final veto, but that's another issue.)   \n   \n\\_\\_\\_\\_\\_\\_   \nOther lameness: Apple Computer, Inc.'s iTunes Music store   \nis being [sued](http://web.archive.org/web/20131015071403/http:/money.cnn.com/2003/09/12/technology/beatles_apple.reut/) by Apple Corps., the Beatles' label, because   \nApple is now in the music industry...\n\n"
    },
    {
      "time": "19 Sep 2003 — 3:12pm",
      "content": "I remember it as \"CA Cosmo-Saturn\" vs \"Cosmos\" right?\n\n"
    },
    {
      "time": "19 Sep 2003 — 4:14pm",
      "content": "Ewww. Anonymous, you're right. At least according to [Luc Devroye](http://web.archive.org/web/20131015071403/http:/cgm.cs.mcgill.ca/~luc/berthold.html).   \n   \nCA Cosmo-Pluto and CA Cosmo-Saturn versus Berthold's Cosmos.   \n   \nFF New Barmen versus Barmeno.   \n   \nBoogaloo Boulevard versus Boulevard.   \n   \nUnbelievable.\n\n"
    }
  ]
}
