{
  "id": "1280",
  "title": "Half condensed serif text face?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am looking for a serif type face that is slightly condensed or half condensed.   \n   \nUp to now I have been using ITC Garamond Condensed or Times New Roman Condensed. I feel the readability is jeopardized with these condensed faces when a certain amount of copy is required.   \nI know that I can use regular book text copy and drop a point and use tracking to achieve a copy fit but would rather use a slightly condensed serif text face if there is one available.   \n   \nI have searched around but have not turned up any suitable face.   \n   \nThe copy is usually for marketing brochures and I try to get the client to cut copy but there are times I just have to go with what is supplied.   \n   \nThanks for any suggestions.\n\n",
  "author": "anonymous",
  "time": "14 Sep 2003 — 10:14am",
  "uid": "1203",
  "comments": [
    {
      "time": "14 Sep 2003 — 12:01pm",
      "content": "If you're looking for something that is actually condensed, just not a squished as the two you mention, then you might consider Minion Condensed or Kepler Condensed. They're not quite as narrow and work passably in text. Stone Print is also a decent option. You might also look at Concorde Nova.   \n   \nI find that Minion (regular, not condensed) runs a little on the narrow side, but probably not enough for you all by itself. It's too bad that you can't get the Multiple Master any more, because then you could make up just the right custom width -- something right in between. _\\*sigh\\*_   \n   \nGood luck.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "14 Sep 2003 — 3:34pm",
      "content": "Since we are blowing horns, try Rawlinson Condensed   \n   \n [http://www.terminaldesign.com/retail\\_specimen.php?ID=1152&viewSubFam=1](http://web.archive.org/web/20131020191933/http:/www.terminaldesign.com/retail_specimen.php?ID=1152&viewSubFam=1)\n\n"
    },
    {
      "time": "14 Sep 2003 — 4:13pm",
      "content": "I will back Hrant in Patria's ability to be ondensed well, this is something I found to be true, even before he had mentioned it.   \n   \nRawlinson condensed is also quite a great face.   \n   \nThat will be my next purchase from you James ;)   \n   \nhildebrant.\n\n"
    },
    {
      "time": "14 Sep 2003 — 4:30pm",
      "content": "BTW, Janet, it seems counter-intuitive but it might be better to use a slightly _extended_ face at a smaller point size instead of a narrower face at your chosen point size. This is something to try especially if the atmosphere of elegance that narrowness conveys doesn't fit the subject - so it depends on that context.   \n   \nI'm still trying to figure this stuff out (since the people who really know what's going on, like the experts at FontBureau, won't talk freely about such \"trade secrets\") but it's starting to seem to me that when you match the economy (surface area usage) of a narrower font versus a wider font at a smaller size, the latter maintains a greater apparent size - something readers generally appreciate.   \n   \nAlso note that the more linebreaks in the copy, the less narrowness will help you (versus wide&small), because the horizontal savings you're accumulating over each line of a paragraph gets negated for every linebreak where you haven't saved an entire line thanks to the savings. Did I explain that OK?   \n   \n--   \n   \nThanks Kyle! Note that Patria's _italic_ however starts becoming insufficiently differentiable from its roman \"master\" in the role of emphasis when condensed, because its slight slant starts becoming invisible. The good news is that the face has four closely gradated weights, so you can substitute the Light (or maybe even the Demi) italic in a body of regular if it's blending in too much (I'm talking about when it's condensed). BTW, Patria's close weights also enable acceptable fake smallcaps - this I learned from Kyle! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "14 Sep 2003 — 5:04pm",
      "content": "Several of my designs are semi-condensed.   \nBeaufort, Worldwide. And Brown, a matching sans. They were mostly developed for a client/friend of mine, Tony Sutton, who likes them that way for newspaper use.\n\n"
    },
    {
      "time": "14 Sep 2003 — 7:21pm",
      "content": "Aw c'mon Kent come clean. You always say you don't like condensed faces. Don't recommend something you don't like.\n\n"
    },
    {
      "time": "14 Sep 2003 — 9:12pm",
      "content": "\"Patria's close weights also enable acceptable fake smallcaps - this I learned from Kyle! :-)\"   \n   \nI still have about 4 differnt character styles setup in that Indesign Document for this. ![:-)](http://web.archive.org/web/20131020191933im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nIm still waiting for you to take the settings and \"make\" the small caps. ;) at least for ease of use, if not true small caps.   \n   \nThen theres OT.. :p   \n   \nhildebrant.\n\n"
    },
    {
      "time": "16 Sep 2003 — 8:19am",
      "content": "Thanks for all the suggestions.   \n   \nI ended up using Minion Narrow MM since it fitted the space and was highly readable set at 10/13. I also happened to have that font in my collection. It was a much better choice than what I had been using before since it did not have that squished look and it took up the same amount of copy space as ITC Garamond Condensed or Times New Roman Condensed.   \n   \nThanks once again.   \n   \nJanet\n\n"
    },
    {
      "time": "14 Sep 2003 — 11:28am",
      "content": "I'd suggest Octavian and Stone Print.   \n   \nBut there's another way: choose a font that compresses well, like much of Unger's work. BTW, my own Patria\\* is also designed to compress well: even down to 65% it's hard (except for some type designers) to see distortions. Please email me if you're interested.   \n   \n\\* [http://www.typophile.com/forums/messages/29/805.html](http://web.archive.org/web/20131020191933/http:/www.typophile.com/forums/messages/29/805.html)   \n   \nhhp\n\n"
    }
  ]
}
