{
  "id": "12816",
  "title": "Any font suggestions for a multimedia designer's resume?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi there. Since i'll soon be done with my BA hons Multimedia Arts in a few months, its time for me to start floating my resume around :D.\n\nBeing relativey new to typography, I'd love to have some of your opinions and suggestions on choosing fonts for a 2 page resume for a guy with a year's experience, type which is humble, non-submissive and truthful :).\n\nI really don't know much about typography so please pardon me if I do say something silly :o!\n\nAs of now I'm considering Helvetica Black, Shannon Book, Stone Sans, Myriad Pro, Cochin, Stempel Garamond Roman and even Frutiger 55 Roman.\n\nIs it ok to have three fonts for the heading, sub-heading and the text or should I just stick to two?\n\nLooking forward to your suggestions and opinions :D.\n\n",
  "author": "inverse",
  "time": "1 Jun 2005 — 2:58am",
  "uid": "5414",
  "comments": [
    {
      "time": "1 Jun 2005 — 7:56am",
      "content": "first, i would say NOT to have a resume be longer than two pages, for the design fields it can look a bit amateurish. also, picking a typeface isn't just about what you think looks nice, it is about what typeface best reflects you and your work. for example, what type of work do you want to do (corporate, fun, bands, movies, etc...)? i don't think anyone can tell you what typeface to use because its very personal.\n\nsecondly, although i'll go as far as saying i think its too much to use more than ONE typeface...some will say its okay to use more than that. i personally stick with one typeface and go with different weights and variations of the same face (ie, frutiger bold, frutiger roman, frutiger light, frutiger italic).\n\nreally there are no rules, just make it look right.\n\n"
    },
    {
      "time": "1 Jun 2005 — 12:30pm",
      "content": "From my experience at work..I'm allowed to use 2 fonts in 3 sizes total per design. For a resume I would use the same font (different weights like suggested in previous post) I cant use two different serifs or san serifs in the same design. I mix a fancy original serif or script with a more plain serif like futura. I usually allow about 3-4 pts of size in between titles,subtitles and info like addresses on business cards or letterhead. For a resume you could use 10pt for info 12 for subtitles and 14 for your name. I would suggest exploring all the different weights in Frutigar..it's a great font with allot of options. My best advice is to keep it clean and simple and maybee put a nice logo at the top to represent yourself. Some people say a logo is even too much but I think it's helped me find work and gives it an original touch without having to spend too much time with fancy type. Good Luck\n\n\\*\\*\\*Shannon looks like a conservative comic text, its the most original looking to me out of all the ones you listed.\\*\\*\\*\\*\n\n"
    },
    {
      "time": "1 Jun 2005 — 3:15pm",
      "content": "Your problem isn't about how your résumé looks, its about content. Use something as bland as Times Roman. Keep it short and have your portfolio on-line with a link to it in the text. You have to think about the hiring process. Their is a screener to kill the first 100 applicants and narrow it down to a few. No design will affect these type of people.\n\n"
    },
    {
      "time": "1 Jun 2005 — 10:51pm",
      "content": "I ended up using Helvetica Bold for my name, Shannon Book for the title and the rest of headings, sub-headings and text are done in variations of Myriad Pro.\n\n@ tbiddy  \n Thanks for the advice. My resume fits in two pages now. If I were to reflect personal design, my resume would be too dekon and i really don't think that would work very well for me :).\n\n@fontobsession  \n Thanks for the advice on font sizes. I've implemented those. With the sizes you suggested, my resume fits in two pages now. I'd personally love to have my logo but am at present ruling out on that. I hope 10 pt for info is readable. I'm going to print the file out right now and hope its legible enough to be read with ease :).\n\n@dan weaver  \n Lol. True. I hope my resume passes through the meaner screener! I did keep him in mind while making my resume but can never be too sure... : o.\n\n"
    },
    {
      "time": "1 Jun 2005 — 10:52pm",
      "content": "On the contrary, since resumes for a given position are generally pretty predictable, good design is exactly what can tip the scales sometimes; and it certainly can't hurt! If they're looking for a bland person, and you don't mind acting like one, then by all means do use Times.\n\nhhp\n\n"
    },
    {
      "time": "1 Jun 2005 — 11:23pm",
      "content": "Oh yeh, and I should add, the one i'm creating is for placement agencies and not creative agencies and stuff.\n\n"
    }
  ]
}
