{
  "id": "12815",
  "title": "Mare Comments",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi all,\n\nI've been working on a new font (Mare), and would appreciated any feedback.\n\nThanks again for your input,  \nI've made some slight adjustments.\n\n| Attachment | Size |\n| --- | --- |\n| [MareType.pdf](http://web.archive.org/web/20150123134701/http:/typophile.com/files/MareType.pdf) | 24.35 KB |\n| [Untittled.pdf](http://web.archive.org/web/20150123134701/http:/typophile.com/files/Untittled.pdf) | 24.22 KB |\n\n",
  "author": "coop",
  "time": "1 Jun 2005 — 1:58am",
  "uid": "5642",
  "comments": [
    {
      "time": "1 Jun 2005 — 12:19pm",
      "content": "good quality workmanship. I think lower case \"g\" is a little more flowing/curvacious and playfull than the rest of the characters. I do not mind that but wonder if it was intentional or?  \nIt seems these days the lc \"g\" often get a bit more play.  \nI am not sure I see the reason it is called \"Mare\". I think of \"Mare\", a female horse and expect something bold, strong and curvacious. Name change should be a consideration unless you will be building very bold weights.\n\n"
    },
    {
      "time": "6 Jun 2005 — 3:16am",
      "content": "I think it looks good.\n\nThe 's' and 'S' are tilting to the right. (The dollar sign as well)\n\nThe ear on the 'g' needs some work.\n\nThe 'æ' would probably look better without the tail on the 'a'.\n\nThe 'Registered trademark' is too big. It should be superscript. But that is nitpicking. :)\n\nMKSG\n\n"
    },
    {
      "time": "7 Jun 2005 — 9:30am",
      "content": "This is impressive, nicely balanced. Something is not quite right about the m - does the left half need to be wider? Or the trick of narrowing the middle leg a hair to give the left arch a little more space? Also the middle of the W looks not quite right. The M I like. The g I like a lot.\n\n"
    },
    {
      "time": "8 Jun 2005 — 3:42am",
      "content": "Thanks for your comments, they are a great help.  \nI've made a few adjustments.\n\nI carn't seem to upload a PDF when replying.  \nHow can I upolad a PDF without starting a new thread\n\n"
    },
    {
      "time": "8 Jun 2005 — 8:32am",
      "content": "edit your initial thread and add an attachment. that _should_ do it.\n\n"
    },
    {
      "time": "8 Jun 2005 — 10:37am",
      "content": "Thanks paul\n\nI've placed an updated version on the initial thread.  \nIs this one of the to do's after the beta version?\n\n"
    }
  ]
}
