{
  "id": "12821",
  "title": "Subcultural movements in the written language and typographic art (puh!)",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi again.  \nThanks to the great feedback I got for my last post at this forum ( [http://typophile.com/node/12689](http://web.archive.org/web/20051110021521/http:/typophile.com/node/12689)), I understand this place is packed with people sitting on a lot of knowledge. Would therefor like to see if there are any interesting answers to this question:\n\nI am looking for examples/books/website/opinions etc on ways of using typography and written language in ways that have more of a “sub”cultural aspect to it. What I mean is groups of people, changing the way their (written) language is communicated, to state a belonging to a group or such. An example of this is “Leet Speak”\\* , used by computer gamers/hackers/etc. New ways of adding values to the written language, based on for example technical limitations.  \nThere are more examples on this from the computer era (the smileys could be considered one), but I havn’t yet come across any from the pre-computer age so that is what I am especiallt interested in.\n\nI am also looking for ways of using existing typography in other visual ways, such as ASCII-art\\*, art done with typewriters, ANSI-art\\* etc etc. If you have other examples for this I’d love to know more about them.\n\n\\* More on…  \nLeet:  \n [http://en.wikipedia.org/wiki/Leet](http://web.archive.org/web/20051110021521/http:/en.wikipedia.org/wiki/Leet)\n\nAn experiment with Leet and Caslon I did a while ago:  \n [http://burnfield.com/peter/work/caslon-leet](http://web.archive.org/web/20051110021521/http:/burnfield.com/peter/work/caslon-leet)\n\nASCII-art:  \n [http://en.wikipedia.org/wiki/Ascii\\_art](http://web.archive.org/web/20051110021521/http:/en.wikipedia.org/wiki/Ascii_art)\n\nANSI-art:  \n [http://en.wikipedia.org/wiki/ANSI\\_art](http://web.archive.org/web/20051110021521/http:/en.wikipedia.org/wiki/ANSI_art)\n\nThanks,  \nPeter\n\n",
  "author": "haraldpeter",
  "time": "1 June, 2005 - 7:40am",
  "uid": "4693",
  "comments": [
    {
      "time": " 1 June, 2005 - 3:19pm",
      "content": "Peter,\n\nFuturist and Dadaist poetry come to mind as examples of pre-digital sub-culture typographic expressiveness….Marinetti, Apollinaire, etc. Johanna Drucker’s book “The Visible Word: Experimental Typography and Modern Art, 1909-1923” (University of Chicago Press, 1994) goes into great detail about their work…the punk fanzine aesthetic of the late 70s - early 90s established its own visual language (via typographic expressiveness) as a way of sub-culture identification…\n\nHave you checked out Saki Mafundikwa’s book [Afrikan Alphabets](http://web.archive.org/web/20051110021521/http:/www.amazon.com/exec/obidos/tg/detail/-/0972424067/ref%3Dpd%5Fsl%5Faw%5Falx-jeb-9-1%5Fbook%5F5094816%5F3/002-3013161-5862407)? He covers the writing systems of several African language, many of which were established during and post-colonial rule as a way of establishing and maintaining cultural heritage.\n\nThis is [a paper](http://web.archive.org/web/20051110021521/http:/www.typetalkfonts.com/frame_orthography.html) I wrote in grad school this year about non-standard orthography and non-standard dialects that you might find interesting…i cited Haitian Kreyol and Rastafarian Jamaican as examples where nonstandard orthography is used to express national/ social identity.\n\nSounds like a good topic, good luck!\n\namy\n\n"
    }
  ]
}
