{
  "id": "12848",
  "title": "Why Gothic?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Why are sans serif faces sometimes called 'gothic?'\n\n",
  "author": "cubanica",
  "time": "2 Jun 2005 — 11:31am",
  "uid": "4202",
  "comments": [
    {
      "time": "2 Jun 2005 — 12:27pm",
      "content": "Maybe it has something derrogatory to it? \"Gothic\" architecture wasn't called gothic in th Middle Ages, rather \"The New Style\" or \"The French Style\" or even sometimes \"The International Style.\" During the Renaissance, it because known as gothic after it was surpased by the Italian classicist revival… the \"goths\" had destroyed the Roman Empire, i.e., all that was true and good in architecture for the Renaissance Italians. Therefore, medieval architecture was Gothic (barbarian), while their new style was \"true to the roots,\" so to speak.\n\nSans Serifs first appeared in the 1800s. The Gothic style of architecture was undergoing an international revival during this time. Maybe type people of the day called those sans serifs \"gothics\" because they didn't like them (the German term for this style of sans serif is Grotesk, which seems to imply that people must have, at one point, found them \"grotesque\").\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20140504174716/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "2 Jun 2005 — 5:07pm",
      "content": "According to the New Oxford American Dictionary, _gothic_ at one time meant \"not classical,\" i.e., not Greek or Roman.\n\nThe term was/is used mainly by American type founders. Besides the German \"grotesk\" there is also the British \"grotesque\" and the French \"antique\" designations for the style.\n\n"
    },
    {
      "time": "2 Jun 2005 — 5:29pm",
      "content": "For type there are seldom really nice clean answers. Especially when looking at type's history. The more you look the messier it is. That's one of the reasons why this board is so useful.\n\n"
    },
    {
      "time": "2 Jun 2005 — 11:36pm",
      "content": "Gothic architecture has circular arches instead of pointed ones. Most of the first gothic fonts were constructions of circles and lines. I see a connection there.\n\nI'm just glad there's still someplace in the world where people don't say \"gothic\" when they mean blackletter.\n\n"
    },
    {
      "time": "3 Jun 2005 — 12:06am",
      "content": "I thought it was the other way around. Gothic arches are pointed and Roman arches are rounded. At least that´s what they always teached me in art history classes.\n\nAnd that´s why it is so confusing that sans serif typefaces sometimes are called gothic.\n\n"
    },
    {
      "time": "3 Jun 2005 — 6:02am",
      "content": "Hmm. I checked, and somehow I've had it backwards all this time. It might be that the typefaces are responsible for my misremembering.\n\n"
    },
    {
      "time": "3 Jun 2005 — 6:39am",
      "content": "Blackletter is related to Gothic architecture in style and date, Gothic is more reflective of the Industrial Revolution. However the compact OED gives this definition, see point 4, however point 3 could be more reflective of early sans serifs, I don't have access to the OED so I can't give the etymology.  \nGothic  \n• adjective 1 relating to the ancient Goths or their extinct language. 2 of the style of architecture prevalent in western Europe in the 12th-16th centuries, characterized by pointed arches and elaborate tracery. 3 portentously gloomy or horrifying. 4 (of lettering) derived from the angular style of handwriting with broad vertical downstrokes used in medieval western Europe.  \nTim\n\n"
    },
    {
      "time": "3 Jun 2005 — 10:29am",
      "content": "Somethings in type are just arbitrary - there is no sense to be made of them. Accident of history. In many cases an ideosycratic personal history.\n\nEverything I have read on this topic suggest that Dan's explanation above is accurate - btw.\n\n"
    },
    {
      "time": "4 Jun 2005 — 3:52pm",
      "content": "Dan is closest to the mark, I think. The OED gives one definition of 'gothic' as:\n\n_4. Barbarous, rude, uncouth, unpolished, in bad taste._\n\nciting as the earliest used in English literature:\n\n_1695. Dryden. 'All that has nothing of the Ancient gust is call'd a barbarous or Gothique manner.'_\n\nThis usage was certainly well established -- and reinforced by the prejudices of neo-classicism -- by the time the first sans serif types appeared in the early 19th century. Later in that century, of course, there was a Gothic revival in art and architecture in Britain, which found its typographic expression in the works of the Kelmscott, Vale, etc. presses.\n\n"
    },
    {
      "time": "4 Jun 2005 — 5:29pm",
      "content": "An interesting comment on this subject is offered by JamesMosley in his essay “The Nymph and the Grot: The revival of the sanserif letter” (London: Friends of the St. Bride Printing Library, 1999). That essay, first published in 1965 (_Typographica_, new series, no. 12, London: Lund Humphries, 1965, pp.2–19) was reissued in connection with the exhibition [_Primitive Types_](http://web.archive.org/web/20140504174716/http:/www.stbride.org/soanepr.htm) (29 January – 24 April 1999) organised by The Friends of The St. Bride Printing Library in association with Sir John Soane’s Museum. Sir John Soane’s revival of sans-serif (1816) most curiously coincides with the apparition of the well-known “Egyptian” type in the specimen book of William Caslon IV.\n\n"
    },
    {
      "time": "4 Jun 2005 — 5:42pm",
      "content": "Maxim,\n\nDid you just fix your link to St Bride (removing \"url\" from the end of the URL) or was it just my imagination?\n\nChrisL\n\n"
    },
    {
      "time": "5 Jun 2005 — 6:25am",
      "content": "The Goths DID sack Rome. And Gothics did trash Romans -- at least for a while...\n\n"
    },
    {
      "time": "5 Jun 2005 — 7:39am",
      "content": "While the Goths certainly sacked Rome, I wouldn't so far as to say that gothic type trashed Roman faces (or anything else, for that matter) ;-)  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20140504174716/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "5 Jun 2005 — 3:49pm",
      "content": "But Dan, look at the various best-seller lists...\n\nhhp\n\n"
    },
    {
      "time": "5 Jun 2005 — 10:00pm",
      "content": "Just because they sell better doesn't mean that they have trashed them.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20140504174716/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "6 Jun 2005 — 12:54am",
      "content": "The type bestseller lists reflect the fact that the majority of designers service the advertising industry, in which sans serif and display faces dominate, rather than book publishing. Of course, one could make a case that the triumph of advertising over literature represents a new kind of sack of civilisation.\n\nThe Goths, at least, having sacked Rome, settled down and became Romans. :)\n\n"
    },
    {
      "time": "6 Jun 2005 — 3:56am",
      "content": "Yeah, and look at some of the newer fonts -- Gothics that are growing serifs... (Thesis anyone?). La histoire se repête... ; )\n\n"
    },
    {
      "time": "6 Jun 2005 — 5:14am",
      "content": "Irony de jour is the font named both after a guy named after a small plot of land tended by little Franks, (not the wee wieners you get at cheap cocktail parties), and their ancient rivals, de Goths, with whom they fought almost continuously for all the centuries they coexisted in the west— you might better name a font Yankees Red Sox, Bush Bin Laden or Microsoft Europa ;) And, from my reading of history, the fact that the Goths never settled down to become good Romans is precisely why we know and have so little evidence of them, their name is associated with barbarism, compared to, Burgundians, Lombards and especially Franks, who did become Romananized, Holy even, and to this day Palatino and Franklin should not be used together.\n\n"
    }
  ]
}
