{
  "id": "12864",
  "title": "gray pixel fonts",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "Here are two visuals that illustrate one of my standard pixel fonts, before and after some gray treatment.\n\nWhat do you think? Are the grays used effeciently, or could they be better?\n\nThe main difference in this post, as opposed to other's I've submitted in the past, is that these are gray fonts that I've actually built and published, rather than studies done in photoshop—title, text, and signature fonts included.\n\nI've tried to limit my selection of grays to black and three shades, although I think I ended up with four.\n\n| Attachment | Size |\n| --- | --- |\n| [deluxe.gif](http://web.archive.org/web/20150414065834/http:/typophile.com/files/deluxe.gif) | 24.37 KB |\n| [regular.gif](http://web.archive.org/web/20150414065834/http:/typophile.com/files/regular.gif) | 19.87 KB |\n\n",
  "author": "tyleryoung",
  "time": "3 Jun 2005 — 2:57am",
  "uid": "2139",
  "comments": [
    {
      "time": "3 Jun 2005 — 10:10am",
      "content": "Hey Tyler. Nice to see you venturing into such \"bookish\" territory!\n\nThis is quite a light touch. Frankly I think a bit too light to justify the \"technology difference\" for the typical user. On my Windows setup there **is** an improvement compared to the 1-bit version, but it's at the textural level: it has a subtle softness, unlike the quite harsh 1-bit rendering. But on a Mac even that will be lost (since the gamma is flatter). So I would suggest moving a bit more towards stronger gray usage; in my experience it has to look a **hair** too blurry on Windows for the font to work optimally in the overall. That said, the basics of the design (especially the proportions) are well done.\n\nAs for number of shades, I've found that there's only one reason to limit the number of shades used: controlling confusion on the designer's part! More than about 8 shades and I for one start forgetting what shade I'm supposed to use for what \"task\"\\*. But -as far as pixelfonts are concerned- there's no real reason to. If you're making embedded bitmaps though and you're worried about filesize, then you'd either go 2 shades (plus b&w), or all the way to 6. In fact I think a bit depth of 3 might not even be supported (robustly), so your choice above 2 might be 14.\n\n\\* A bit hard to explain, that.\n\nBTW, when you say \"publish\", may I ask what channel you're using? I don't see this design on Ultrafonts. Are you using BitFonter to deliver \"real\" bitmap fonts (as opposed to pixelfonts)? If so, have you gotten that to work on MacOS? Or maybe you've figured out a custom way of (reliably?) rendering out the desired grays in a pixelfont, and are selling it yourself?\n\nhhp\n\n"
    },
    {
      "time": "3 Jun 2005 — 12:20pm",
      "content": "Hrant,\n\nThank you for giving such a thorough review of my samples. It's funny, the confusion you speak of concerning keeping track of shades and their \\*usage\\* is even lower for me than for you, which is one of the reasons why I've been trying to keep my grays to a minimum.\n\nAnother reason, is due to the questionnaire feed back I've been getting. As you probably know, I offer free fonts in exchange for pixel font market feedback. There are many interesting trends I've discovered over the last year, and one of them is that an alarming number of people have said they would NOT purchase gray pixel fonts from MT should it start rolling them out.\n\nThis says to me that designers are divided in what a pixel font's main purpose ought to be: clarity above all, or sophistication for small typefaces.\n\nSo I've been trying to develop a style that would set my work slightly apart from the other gray pixel font artists, in that I'm trying to take \"the edge\" off of my pixel fonts while making them as reminiscent of \"hard edged\" pixel fonts as possible.\n\nIt's a funny sort of line I'm trying to balance on in an effort to please everyone. I really don't have to, if you think about it, because I continue to develop so many traditional pixel fonts. Still, I like the idea of trying to create a series of gray fonts that will look gray to those looking for gray fonts, and black and white to those looking for black and white fonts.\n\nAs for publishing, I simply meant that I've built these fonts in Fontlab and \"exported\" them to mac tt and pc tt and tested them in Flash and Photoshop. I don't have immediate plans to sell them, as a new web standards compliant MT store is on its way, and I see no point in investing any more energy into the existing Flash store.\n\nHowever, I am experimenting with my own production workflows for gray pixel fonts in light of UltraFonts recent shift in its stance over \"ownership\" of the technology. For that matter, I've been in recent talks with Jose, and it appears that new UF developers are low on his priority list. His system (as it exists now) won't work for many of my fonts anyway. I have some pretty big fonts.\n\nIf you know more about UF's market position than I do, please feel free to let me know. The last written dialog I had with Chris was actually here on these boards, where he said that UF no longer laid claim to the technology, and was shifting its model to working with designers to further the technology as a whole.\n\nI design on the mac, and everything looks pretty good on my end. By that, I mean that they render successfully in Flash and Photoshop.\n\nIt's pretty easy, really, to build them in Fontlab, but right now it's pretty time intensive, because I'm doing everything my hand and experimentation.\n\n"
    },
    {
      "time": "3 Jun 2005 — 2:23pm",
      "content": "Yes, there certainly are a lot of viewpoints out there, some of them quite strange! On one extreme you have the bitmap purists who like to stick to the ideology of Work With The Medium - a fine sentiment, as long as it doesn't become a barrier to improved functionality; and the Medium, after all, does support shades of gray! On the other extreme you have the print-centric artistes who don't care how goddam blurry it looks as long as it's \"my darling Futura\" or whatever their pet font (or flavor of the week) is. But there are also a whole swath of people (I think the majority) who simply need to be provided with: good quality products; and good examples of the new benefits. If you leave it to their imagination to decide if something new is useful or not, they'll just revert to their favorite little ideologies to strike down something new, and thereby feel more in control. There are few people out there who know in advance that there's room for improvement, and are willing to give new things a try with little prompting.\n\nSo in this design you're trying to deliver grays sort of under your clientele's radar? I guess that's better than nothing. But I think a thorough exposition of the benefits of grayscale pixelfonts -which has yet to be done- would convert a chunk of people, at least among those who don't feel smugly confident (read: insecure) about their pre-existing design decisions/philosophy. But always remember: just like in the outline font realm, there are mass-market fonts, and there are fonts that can only appeal to an astute minority. The latter are willing to pay more for greater quality, and this is where you can make up the smaller number if cutomers. And this is why -or at least one big reason- grayscale pixelfonts sell for more money. In contrast, it's much harder to sell 1-bit pixelfonts (all things being equal). My hunch is that something in between will end up appealing to neither group, or at least not appealing in the right way to make money; after all, you can't charge more for the people who realize the benefits of grayscaling! :-)\n\nAs for UF: things have changed (again, and in more than one way) since Chris wrote that on Typophile... But in any case I'm not privy to the inner working of UF.\n\nhhp\n\n"
    },
    {
      "time": "3 Jun 2005 — 3:06pm",
      "content": "Hrant,\n\nYour thoughts have taken on a much larger scope than I was expecting! I'm caught agreeing with many of your assesments while simultaneously learning about them.\n\nAn \"I never thought about it that way before\" sort of thing.\n\nAs for trying to pass off gray pixel fonts as 1-bit fonts and vice-versa, that's not really my intention. I simply mean to say that creating a line of gray pixel fonts that take just enough edge off to improve themselves over their 1-bit cousins, while remaining true to their sharp, aliased roots might turn out to be an appealing solution for a big portion of the pixel font buying market.\n\nIt is my intention to sell any gray pixel fonts I build for a higher price, and to differentiate them from my other product lines. This is why it is good for me to get any feedback I can on the prototypes. I want them to offer an increased value that will justify a higher price.\n\n"
    },
    {
      "time": "8 Jun 2005 — 2:31pm",
      "content": "Hi Tyler and Hrant.\n\nBitfonter´s seem to be not interesed at all, in Grayscale ttf emulation tools. That´s Bad.\n\nI think that they have a poor feedback/knowledge with pixelfont developers. Well, forums are builded for this. This is the instance (bitfonter email feedback its down i think?).\n\nI dont understand, really, why they launch \"Bitfonter 2\" without this development petition from us (256 or more greyscale emulation on vector shapes), pixelfont designers, even a single one coment in the forums. Actually UF fontlab´s tool only suport 16 greys, who its very limited, specially for greyscale icon design.\n\nIf Fontlab´s Bitfonter team is not interesed in this i got a theory: its because they don´t know about our needs.\n\nA question: Who is going to spend us$500 for export font formats who dont exist in our customers needs and dont support flash custom type for web and cellphone designers?\n\nmh.\n\n"
    },
    {
      "time": "8 Jun 2005 — 4:18pm",
      "content": "Miguel, it might [also] have to do with the patent situation, which is apparently still in place after all. BTW, I think 16 shades is plenty.\n\nhhp\n\n"
    },
    {
      "time": "8 Jun 2005 — 4:24pm",
      "content": "why Bitfonter developers don´t answer?\n\n"
    },
    {
      "time": "9 Jun 2005 — 8:19am",
      "content": "Yeah, I'm at a bit of a loss as to why Fontlab has gone to the effort to produce Bitfonter without really setting it apart in function from Fontlab.\n\nAs it stands, I believe that Fontlab 4 with the Python pixel editor is a far more powerful, flexible system for building pixel fonts; especially when you consider the price difference (or lack thereof) between the two products.\n\nI agree that they should make Bitfonter either: a) more powerful that Fontlab when it comes to pixel font creation, metadata management, and file export flexibility, or b) cut the price quite a bit.\n\nAnd this is coming from someone who owns both programs. : )\n\nMy copy of Bitfonter is collecting digital dust, whereas my Fontlab is shiny and well-worn.\n\n"
    },
    {
      "time": "14 Jun 2005 — 9:09pm",
      "content": "Hi Tyler,\n\nDid you read my last email?\n\nPlease answer,\n\nThanks,\n\nmh.\n\n"
    }
  ]
}
