{
  "id": "12875",
  "title": "Old English",
  "forum": "Blackletter",
  "tags": [
    "Blackletter"
  ],
  "content": "Does anyone know anything about who first developed Old English typeface into what it is now and when was this done?  \nI was also wondering are there any diffrerences beween Old English by Elsner & Flake and Old English by Linotype Library. Is there an \"official\" version?\n\n",
  "author": "Jenni",
  "time": "4 Jun 2005 — 4:48am",
  "uid": "7526",
  "comments": [
    {
      "time": "4 Jun 2005 — 6:42am",
      "content": "If you look at the Linotype page for Old English ( [http://www.linotype.com/11949/oldenglish-font.html](http://web.archive.org/web/20150317111758/http:/www.linotype.com/11949/oldenglish-font.html \"http://www.linotype.com/11949/oldenglish-font.html\")), you'll notice that its dscription says that it was designed by Monotype. So, this design came to us by way of them. I suspect that E+F's version was licensed from Monotype, too. Orm they may have digitized their own version of a similar pre-digital face, in which case they would have there own.\n\nIn this case, you could license the face from whichever company you prefer to get your fonts from. I'm sure that they are all good fonts.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150317111758/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "4 Jun 2005 — 3:24pm",
      "content": "cheers for that. do you also happen to know anything about the people who designed it for monotype or where this info maybe found?  \nthanks for you help\n\n"
    },
    {
      "time": "4 Jun 2005 — 4:28pm",
      "content": "Jenni\n\nThe earliest of the Old English variants is generally credited to Morris Benton at ATF in 1901. There were many others that followed: Intertype, BB&S, more ATF, Ludlow, more ATF, Monotype. It was known as Engravers Old English, Engravers Old Black, etc. Likely the worst interpretation of blackletter ever to grace the planet.\n\nGerald\n\n"
    },
    {
      "time": "11 Jul 2012 — 5:54am",
      "content": "think new\n\n"
    },
    {
      "time": "30 Jul 2012 — 8:49pm",
      "content": "think old\n\n"
    }
  ]
}
