{
  "id": "12883",
  "title": "Typographic checklist...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi folks,\n\nAs I'm sure is the case with most of you, my notebook is randomly filled with various bugs and hiccups that I try to remind myself to scan for when starting work on a new book. The problem, of course, is that these hints & nudges are spread out all over the place. For a while now I've been meaning to compile these notes, and an upcoming wayzgoose has prompted me to put them together either as a chapbook or a series of broadsheets. However, I know that the list I've gathered is cursory and incomplete at best, so I wondered if anyone wanted to add their favourite quirks.\n\nThis list obviously isn't absolute, as various spacing and kerning issues will be different from one face to another. The idea was/is simply to put together a list of things to look for with each project.\n\nThe list has nothing really to do with layout: that is, I haven't put in anything about leading or sizing or H&J settings, etc. This is purely about typesetting issues, such as what to place on either side of an en-dash or how to handle singe-quotes inside double-quotes.\n\nAlso, at the moment the list is specific to the house-style used at [greenboathouse books](http://web.archive.org/web/20141113073542/http:/www.greenboathouse.com/), a small press I started up a while back. This means many of you will likely have different opinions about many of the setting \"rules\" I have in the list. Hopefully what I have listed doesn't make anyone too crazy.\n\nWhile I'm curious and eager to hear different takes on different bugs, I'm primarily interested in the many details the list is currently missing entirely.\n\nI realize some out there may not be too eager to give away their secrets, so if you're the quiet type, I understand completely. But for those of you willing to share, please post anything that comes to mind.\n\nAt the moment I've set the list without much hoopla, designing it primarily with a letterpress setting in mind, so it's a fairly humble looking PDF at the moment.\n\nWhile this idea started out as a potential reference tool for my students, really it just seems like a good exercise, and while I was at it I thought some of you might like to stretch your muscles a bit as well.\n\nI look forward to anything you might have to offer...\n\nHere's the link: [A Typographer's Checklist](http://web.archive.org/web/20141113073542/http:/www.greenboathouse.com/dewinetz/pdf/a-typographers-checklist.pdf) (so far).\n\nJason\n\n",
  "author": "jason",
  "time": "4 Jun 2005 — 7:31pm",
  "uid": "3771",
  "comments": [
    {
      "time": "5 Jun 2005 — 1:05am",
      "content": "Great document, Jason. One quibble: why \"include closing slash with simple domains\"?\n\n"
    },
    {
      "time": "5 Jun 2005 — 1:33am",
      "content": "Why is US an exception without small capitals?\n\n"
    },
    {
      "time": "5 Jun 2005 — 10:42am",
      "content": "Stephen: Good question. I can remember making the decision with a book a while back to include the closing slash, but now that this practice is posed back as a question, I can't seem to find a functional reason. Thanks for drawing attention to this one.\n\nsergej: I avoid setting US in small caps simply because in many faces, despite obvious context, it has the potential to look like \"us\" (\"We're going to the movies. What to come with us?\") USA is a different matter and should, of course, be in small caps.\n\nThanks for these two comments so far. This is part of the reason I decided to post the list: to have some of these things questioned. Keep it coming...\n\n"
    },
    {
      "time": "5 Jun 2005 — 3:52pm",
      "content": "Except in a font with properly-designed smallcaps (visibly taller than the x-height).\n\nhhp\n\n"
    },
    {
      "time": "5 Jun 2005 — 5:23pm",
      "content": "hrant: The list I put together was primarily based on my experience with Minion, which is what I use for most of my academic/scholarly book design. Minion's small cap x-height is level with the lowercase (well, very close to it), and while the small cap U is obviously distinct from its lowercase relative, the small cap S is just too similar; thus the word itself is very easily read as \"us.\" While in principle I agree with you (and thus this is an issue I reconsider often), the reality in many of the projects I've worked on is that principle in this case isn't as important as clarity for the reader.\n\nExample: [no longer available]\n\n"
    },
    {
      "time": "5 Jun 2005 — 5:40pm",
      "content": "While we're on the topic of small caps, I'm curious what others do with pluralized small cap acronyms?\n\nIn the example below the acronym is \"IPR,\" but pluralizing the acronym looks a whole lot like \"IPRS\" in small caps (especially at 10pt). An apostrophe doesn't work gramatically (turning the acronym possessive) so this always stumps me. Any thoughts?\n\nExample: [no longer available]\n\n"
    },
    {
      "time": "6 Jun 2005 — 12:20am",
      "content": "Hence another problem with typeface designs in which the small caps are at x-height.\n\n"
    },
    {
      "time": "6 Jun 2005 — 12:07pm",
      "content": "Great document. I would love to publish similiar documents for all European languages at [Typo.cz](http://web.archive.org/web/20141113073542/http:/euro.typo.cz/). Unfortunately it is very difficult to find basic type setting rules for minor languages. But people here at Typophile could join and help you create such PDF's for other languages too. It would be a fantastic tool.\n\n"
    },
    {
      "time": "7 Jun 2005 — 10:17am",
      "content": "About pluralizing the acronyms. It find it very interesting how different languages solve these types of problems. In spanish I believe there is a convention of doubling the letters in the acronym to indicate plural words, for example the acronym _EE.UU._ for _Estados Unidos_ (United States). In swedish we typically use a colon, for example _IPR:s_ or in small caps _IPR:S_.\n\n"
    },
    {
      "time": "7 Jun 2005 — 10:25am",
      "content": "I find, generally, that I use lc s follow as in NASAs ... again it is ugly and wish people would write to avoid this. :^/\n\n"
    },
    {
      "time": "7 Jun 2005 — 10:41am",
      "content": "I don't use small caps for two letter strings, just three or more. I haven't really minded the \"bump\" caused in the bouma by them.\n\nState abbreviations for instance… I think that they read better in caps. But USA, definitely small caps and USSR or NASA ist just ugly when typed out without them…\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20141113073542/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "7 Jun 2005 — 11:03am",
      "content": "Small caps can also be differentiated from lower case by letterspacing. (Tracking them out.)\n\nI don't have a problem with the apostrophe for pluralization. Context will make the distinction. The apostrophe glyph already does triple duty, used for possesive, abbreviations, and as a right quote.\n\n"
    },
    {
      "time": "7 Jun 2005 — 11:08am",
      "content": "Thanks for the input so far, but I'm getting the feeling you folks are holding out on me. I had half-expected (and hoped for) an onslaught of bugs I'd overlooked. Any suggestions?\n\nAlso, Tiffany, as a writer & editor myself, I've often made the foolish mistake of trying to convince authors that a small adjustment to their grammar would help me enormousely in setting their work. Alas, I may as well wish that poets would recognize that a book page isn't as wide as the letter-sized sheets they're typing their ridiculously long-lined poems on.\n\n"
    },
    {
      "time": "8 Jun 2005 — 2:14am",
      "content": "Nice post Jason!\n\nI have some comments (excuse me for not using bullets on this list):  \nIn regard to the last point on bullets, I don't understand why you wouldn't use a period if the items are not continuation of list title. Wouldn't you then choose to capitalize the items, and use a period?\n\nI also have a preference for en bullets instead of em bullets. Em bullets take far to much attention, especially since they're also indented.\n\nHere are some notes I have made about bullets, taken from Brinhurst and David Jury among other places. Sorry for not giving credit to everyone, I didn't bother to jot down where I got it from since I only wrote it down for myself.\n\nBullets can be solid or outline, and come in two standard sizes, em bullets (which are almost as big as capital letters) and en bullets (which are about half the size of em bullets).\n\nEm bullets: Are almost always too big, should be limited to cap letters and should be set in outline form for minimum text disruption.\n\nEn bullets: Should centre on cap height when in the beginning of a line and should centre on lowercase x-height when used with lowercase text.\n\nEn bullets can be set even smaller when less emphasis is required, when very many or very few bullets are used, when they’re used with a typeface that has a small x-height and whey they’re used with a condensed typeface.\n\n"
    },
    {
      "time": "8 Jun 2005 — 2:32am",
      "content": "I also have two comments in regard to ellipses.  \nHow would you differentiate between the omittance of a word, and the omittance of a sentence? For instance:  \nHe was going to Norw….  \nHe was going to Norway….  \nIs there any other way to do this?\n\nAnd why would you put the comma before the ellipsis and after the first sentence? Doesn't that all depend on wheter the word(s) that have been omitted in the first or the second sentence? If the words have been omitted in the last sentence, I agree, but except for that I think the comma should be placed after the ellipsis, as with all other punctuation marks.  \nHere's the excample from your document:  \ntext,… text\n\n"
    },
    {
      "time": "8 Jun 2005 — 3:31am",
      "content": "\\> holding out\n\nFYI here is a style guide I prepared earlier this century, which shows examples of some of the issues:  \n [http://www.shinntype.com/Assets/Depts/Essays/DigginIt.pdf](http://web.archive.org/web/20141113073542/http:/www.shinntype.com/Assets/Depts/Essays/DigginIt.pdf \"http://www.shinntype.com/Assets/Depts/Essays/DigginIt.pdf\")  \n(2.2 Mb)\n\nYour suggestions for \"hair\" spacing is problematic in that the effect will vary with different styles of font (especially roman vs italic, and serif vs. sans), and with the different spacing strategies built into fonts.\n\n\\* dashes: the amount of sidebearing included with a dash varies with the font. Some have it built-in, others don't. See example.\n\n\\* spacing ellipses: similar thing. Traditionally, the ellipsis appears to have been an em in width (1000 units), with the period and comma about a quarter of that. However, many digital fonts have the width of the ellipsis as three times the period/comma (and that's how I do all my fonts), so you don't need to add hairs between it and other marks.\n\n\\* possessive \"s\" is roman in italicized words: this is a real makework project, when you consider the extra kerning that will be involved (could use InDesign \"optical\" tho'): Also, many fonts have kerned apostrophes (very necessary following \"f\") already. Sometimes, the different angle can look noticeably silly, like a wrongfont mistake.\n\n\\* kerning figures: I consider the sidebearings of the \"1\" to be part of the character -- when they are too small, as is often the case in proportional figures, it doesn't look right. This is possibly because we see so much of tabular figures, and didone figures, which have plenty of side-bearing built-in to the \"1\". So when the old-style figure is the \"little\" 1 that looks like a dotless \"i\", as is the case with Minion, there really isn't enough \"one-ness\". Keeping adequate space on either side helps preserve that.\n\nHowever, it always helps to kern between a space and a following \"1\".\n\n\\* Roman parentheses with italic content. This is a bit precious. Again, it creates all kinds of kerning problems. Italic f with roman brackets is incredibly horrible, creating gaping wounds in the text flow. The technique can look great for Didone types with their huge pothooks, and other italics with prominent serifs, but creates a really unbalanced inprression with sans serif fonts.\n\nRather than specify procedures for different circumstances, it may be better to suggest a desirable visual outcome, and leave it for the typographer to implement. For instance, state that the goal to be attained in a sequence is the appearance of four equally spaced periods.\n\n"
    },
    {
      "time": "8 Jun 2005 — 9:17am",
      "content": "Very nice, thanks Nick. What is the Sans used in the title of the piece?\n\n"
    },
    {
      "time": "8 Jun 2005 — 9:26am",
      "content": "Jason -- It's true, I assume too much and hope for too much when it comes to designers and copywriters working together in harmony. =^D It's also true that I'd never ask a poet or an author of some of literary prose to re-write their words. I suppose I was just thinking in terms of advertising. Mea Culpa. :^)\n\nThis is all very interesting thanks for sharing all of this, by the way.\n\n"
    },
    {
      "time": "8 Jun 2005 — 11:46am",
      "content": "Great, thanks to each of you for the input. I'm going to speak to each here, one at a time.\n\noyestein (bullets):  \nThe notes on bullets are very specific & helpful. Any chance you could dig up where they're from? I'm going to add them to the list but would like to give credit. I'll also adjust the list itself to exemplify the practice described (I'll let everyone know when an updated version of the list is ready).\n\noyestein (ellipses):  \nThe samples I have in the list were pulled from the marginal examples in Bringhurst (p.82 in v.3.0), but here are my understandings (please ignore spacing issues in HTML text below):\n\n\"text...text\"  \n= omission of one or more words\n\n\"text..., text\"  \n= omission of remainder of comma-distinguished clause\n\n\"text,... text\"  \n= omission of entire comma-distinguished clause(s) following a comma\n\n\"text.... Text\"  \n= omission of remainder of sentence\n\n\"text....\"  \n= omission of remainder of paragraph\n\n(final period in last 2 examples above could be exclamation or quesion)\n\nNick (spacing ellipses & dashes):  \nAs I mentioned in a comment above, the list I posted is based on my work with Minion (which I use often for body copy) and thus the spacing suggestions are specific to Minion. Beyond that face, the list is meant simply to draw my attention to various tricky settings, each of which will need to be addressed differently depending on the face & size in use at any given time. Thus, the list isn't meant to be accurate in all cases, but is meant to itemize issues that will need to be examined & adjusted in each project.\n\nNick (possessive roman \"s\" with italicized words):  \nI agree, it's a bit of a make-work project, but in my experience they don't crop up too often and can be addressed easily enough. The idea here, I think, is to find a solution - specific to each book project - that will work throughout that project and apply it consistently.\n\nNick (kerning/spacing proportional oldstyle \"1\"):  \nI think what you're saying here is that generally speaking \"1\" needs some attention. It is, after all, the loneliest number.\n\nNick (roman parentheses with italic content):  \nI'm a hard-ass on this one, siding with Bringhurst, and ultimately my opinion here is simply aesthetic: italic parentheses, brackets & braces look ridiculous. Working with an italic \"f\" and a roman right parenthesis is indeed tricky, but it's doable (this may horrify some, but in the past I've kerned that paren out and then [god forbid] put a 5 degree slope to it [example no longer available].\n\nNick (your final comment):  \n\"Rather than specify procedures for different circumstances, it may be better to suggest a desirable visual outcome, and leave it for the typographer to implement.\"\n\nAbsolutely. My goal is to set up the list (using Minion) to serve as a visual guide (which happens to have specific directions for using Minion). From there the idea is to examine these issues in whatever face/size I'm using and produce similar visual results.\n\nPhew. Thanks to each of you for taking the time to respond, I really appreciate the input on these topics. I'm going to try later today to update the list to reflect the suggestions so far, and will let you know when the new verison is posted, but in the meantime please keep'm coming.\n\n"
    },
    {
      "time": "8 Jun 2005 — 8:54pm",
      "content": "Jason\n\nI noted that in your original post that this information may be destined for letterpress practitioners? Not all that is digital typographic practice is necessarily appropriate for letterpress. Even style manual-wise. You mentioned the problem of poets writing long lines. Well, this is something that might only bother a letterpress printer. It's somewhat a matter of presswork. The purely digital folks won't understand the problem.\n\nGerald  \n [http://BielerPress.blogspot.com](http://web.archive.org/web/20141113073542/http:/bielerpress.blogspot.com/ \"http://BielerPress.blogspot.com\")\n\n"
    },
    {
      "time": "8 Jun 2005 — 10:18pm",
      "content": "Jason, thanks for the thoughtful thread and for sharing your work. Nick, thanks for sharing \"Diggin' It\". This is the perfect primer and reference sheet for our interns and production designer(s).\n\nWhat do you all think of putting this 'checklist' into the wiki? Would the idea of multiple people adding to the primer help it? I tend to think it would. (But, Jason, it's of course your document and I'll just suggest it.)\n\n\\_\\_\\_\\_  \nSince Nick's PDF didn't get linked by the system, I've pasted it here:  \n [http://www.shinntype.com/Assets/Depts/Essays/DigginIt.pdf](http://web.archive.org/web/20141113073542/http:/www.shinntype.com/Assets/Depts/Essays/DigginIt.pdf \"http://www.shinntype.com/Assets/Depts/Essays/DigginIt.pdf\")\n\n"
    },
    {
      "time": "8 Jun 2005 — 11:09pm",
      "content": "_Why include closing slash with simple domains?_\n\nOne possible explanation is that the formal syntax for a URL requires there to be a path following the domain, and the shortest legal path is \"/\". But this is a technical argument, not a typographical one. Perhaps some techie had browbeaten you into adopting that rule.\n\nAnother reason might be that a trailing slash serves as a visual marker that this is a URL and not an ordinary word. Usually a leading \"www\" serves this purpose, but domains don't always include it. If the parts of the domain can together form a word (consider inter.com) it might mask the fact that this is a URL.\n\nBut the trailing slash does look odd.\n\n_What do others do with pluralized small cap acronyms?_\n\nI don't have any solution but I certainly admire the problem. -- Ashleigh Brilliant\n\nI do note that I see this phenomenon all the time in _The Economist_ magazine and it throws me off every time. They pay enough attention to this stuff that I'd think they'd do it differently if they could think of a better way.\n\ns'marks\n\n"
    },
    {
      "time": "8 Jun 2005 — 11:23pm",
      "content": "I overlooked one of oyestein's questions above:\n\n\"In regard to the last point on bullets, I don’t understand why you wouldn’t use a period if the items are not continuation of list title. Wouldn’t you then choose to capitalize the items, and use a period?\"\n\nIn the document I posted I mentioned 3 types of lists, which I'll run again here with explanations:\n\n1  \nItems are capped with closing punctuation. This is where the title/introduction is a complete sentence, as are the items.\n\nThe list title is what introduces the list:\n\n- Each list item is a complete sentence.\n- Complete sentences make use of initial caps.\n- Closing punctuation is required for complete sentences.\n\n2  \nItems are not capped and conclude with semicolons. Such lists make up one complete sentence.\n\nThis list has a variety of parts including:\n\n- an introductory clause;\n- some bullets;\n- and multiple items.\n\n3  \nItems are not capped and use no punctuation. This is a simple itemized list, where the items are not part of the title/introduction.\n\n- white\n- black\n- red\n- blue\n\nThese aren't the best examples, so I may simply be making this more complicated, but this is more-or-less how I set such lists.\n\n"
    },
    {
      "time": "8 Jun 2005 — 11:36pm",
      "content": "bieler: You're absolutely right. What part of this thread has reminded me is that what we're talking about here has nothing to do with setting metal. Coppers & brasses are not hair & thin spaces, and setting lead bullets has nothing to do with tabs. Thus, my notion of producing this list as a letterpress broadsheet has been set aside.\n\nAs for the long-line poems, in addition to designing I'm also a publisher & a poet (if you're really bored [take a look here](http://web.archive.org/web/20141113073542/http:/www.greenboathouse.com/dewinetz/)), and I think line-length still has plenty of impact on digitally produced books. For example, look at Patrick Lane's recent _Go Leaving Strange_. It's painful to open. Due to Patrick's desire for a long line, the text measure is less than 1cm from the outside edge, made so much worse by the fact that the body text is set in a condensed face. Sure, the publisher could have moved up to a larger format for the book, but do you know any trade publishers that would do so for a book of poetry (other than Gaspereau [I'm speaking of the Canadian scene here])?\n\nMy point is that as a writer myself it doesn't seem so much to ask that poets recognize the medium they're working with (books), and perhaps learn a tiny bit about their means of production and thus their (commercial) limitations.\n\nDon't get me wrong, I run a small press for exactly this reason: to produce books that serve the writing, not the other way around. Most trade publishers, however, don't have that luxury.\n\n"
    },
    {
      "time": "9 Jun 2005 — 10:44am",
      "content": "Jason\n\nThere is an acceptable way of breaking a line of poetry (by indenting the remainder of the line) but most contemporary poets would be quite upset if you do so.\n\nI was once shown a manuscript of poems by a well-respected upper midwest poet and commented to the publisher that the poet's habit of using an isolated instance of an extremely long line in an otherwise short line measure poem was problematic both in terms of design and presswork (letterpress). It was simply a comment regarding production rather than a criticism of the work but because of it the publisher decided to give the book to a less fussy and opinionated printer.\n\nOne of the problems with formats (in trade publishing) is that any deviation from standard sizes kicks up the unit price. But yes, you rarely seen oddities from poets who have had some experience on the production end. Walt Whitman wrote extremely long lined free verse but since he also had experience as an itinerant printer he fully understood the need for breaking lines. Even Marinetti understood the restrictions of \"the page form\" and consulted with his printer as to how to achieve his intended effect.\n\nGerald\n\n"
    },
    {
      "time": "9 Jun 2005 — 10:15pm",
      "content": "Jason\n\nShould have mentioned this. I did look at the site. Congrats on the awards, well deserved. Pleased to see this kind of energy. Best with it all.\n\nGerald\n\n"
    },
    {
      "time": "9 Jun 2005 — 11:30pm",
      "content": "Hi Gerald,\n\nThanks for your kind words. I've just put together who you are and I do appreciate your input here. During a visit last summer Robert B. was describing his experiences working on Koch's _Parmenides_ and we talked a fair bit about photopolymer. He leant me a copy of your _Printing digital type..._ which was very informative & encouraging for a designer like myself seemingly dependant on my computer. I don't have a press myself, but have done some metal setting & printing with Caryl Peters of Frog Hollow Press here in Victoria, and am looking forward to an opportunity to print a project with photopolymer somewhere down the road. For the moment I just wanted to say thanks for your posts, but if/when that project reveals itself, I may reach out to seek your well-informed advice. Thanks again...\n\n"
    },
    {
      "time": "9 Jun 2005 — 11:53pm",
      "content": "Below is a link to the latest version of the checklist. It's still in progress, & if I have any time this weekend I may attempt to give it a bit of character, but it is what it is for now. Thanks to everyone who has contributed discussion so far, but please do keep it coming.\n\n{Keep in mind that this list details setting directions for use with 10pt Minion specifically (as that is what the list is set in). Beyond this face & size the idea is simply to draw attention to tricky typesetting issues that may pop up at any time in any face/size combination. As with any typographic \"rule,\" this list is meant to illuminate, not dictate.}\n\nTypographer's Checklist (v.2) [Link removed; see mid-February 2006 posts for new a version of this file.]\n\n"
    },
    {
      "time": "10 Jun 2005 — 2:45pm",
      "content": "Maybe include something about how the @ symbol often needs some baseline shifting, particularly in older fonts where it sits on the baseline (too high). The character was originally used with lining figures, but now it's almost always used with lowercase in email addresses.\n\n"
    },
    {
      "time": "10 Jun 2005 — 6:18pm",
      "content": "Yes, and not only the at but the copyright symbol as well. And to further it a bit, reduce them in size to a bit larger than the x-height of the font, and with the reduction in size, change them to a heavier weight (and if you don't have the extra weight, make one in FL or FOG). They look real nice that way, and hey, isn't that what its all about?\n\nGerald\n\n"
    },
    {
      "time": "14 Jun 2005 — 9:50am",
      "content": "Good stuff Jason.\n\n"
    },
    {
      "time": "16 Jun 2005 — 2:11pm",
      "content": "You could consider a different practice: Use periods with abbreviations of 2 letters, no periods for 3 letters or more. Thus, you would write U.S. but USA (all in small caps). Then you could use small caps for all, which I find less jarring than small and large caps for terms that are logically similar.\n\n— Kathleen\n\n"
    },
    {
      "time": "16 Jun 2005 — 5:21pm",
      "content": "Kathleen,\n\nThanks for bringing this up; I do tend to use periods with U.S. (& E.U., U.K., etc.), but don't usually set these in small caps. Your bringing it up is good food for thought.\n\nHowever, this doesn't really solve the issue above in terms of plural abbreviations/acronyms. What I've done in a current project on this front is set the abbreviation/acronym in small caps and reduce the 's' by a point in a slightly heavier weight. The idea of course is to maintain consistent colour on the page and give some visual indicator that the abbreviation/acronym is plural, without tripping the reader up on a too-obviously shrunken character.\n\nThanks also to Stephen & Gerald for reminders about the @ and © glyphs; I'll add something on each in the next version of the list.\n\n"
    },
    {
      "time": "17 Jun 2005 — 8:16am",
      "content": "I don't think you need the colon following the title that appears at the top of each page. (In general I think combining colons and line breaks is excessive.)\n\n"
    },
    {
      "time": "17 Jun 2005 — 6:08pm",
      "content": "Nice stuff! Thanks a lot!\n\nWouldn't it be nice to have something like this focused on web typography? I've aways had problem on impleting typographycal rules in web content.\n\nPS: Is that Pacella?\n\n"
    },
    {
      "time": "18 Jun 2005 — 3:29am",
      "content": "What about punctuation marks and quotation marks? I've read that the comma, like the period, is always placed inside the closing quotation mark, while colon and semicolon is placed outside the quotation mark unless it is part of the quoted matter.\n\nAgree/disagree?\n\n"
    },
    {
      "time": "18 Jun 2005 — 7:16am",
      "content": "This is great, Jason.\n\nI'm not sure how expansive you intend to get on _The Typographer's Checklist_ or to what degree of sophistication (is this a guide for graphic designers, novice publishers) but I think it might be helpful to include some of these instances or at least cautionary words to the reader:\n\n<dl>\n<dt><strong>Oldstyle Figures</strong></dt>\n<dd>When available, to be used within text for expression of dates and on occasion expression of whole numbers. (You can find many references on this.)</dd>\n<dt><strong>Lining (old terminology) &amp; Monospaced Figures</strong></dt>\n<dd>Just a caution for correct use. I've seen annual reports using fitted numerals!</dd>\n<dt><strong>Small Caps</strong></dt>\n<dd>We never used them unless they were available as true cuts. But that was our house style.</dd>\n<dt><strong>Large and Drop Caps</strong></dt>\n<dd>I'm not sure if you want to approach this, but Nick cites some useful hints in his <em>DigginIt</em> compilation. I know that you hadn't intended this for layout but use of small cap words after drop cap is a nice refinement. This could just be added as a recommended use in the small cap section without advice on drop caps.</dd>\n</dl>\n\nWhat about combing for possible ligatures?  \nSorry for the quick post, just wanted to get some thoughts in before we head to the mountains.  \n--------------------------------------  \nYes, I'm old, but I'm back in style!\n\n"
    },
    {
      "time": "26 Jun 2005 — 1:19pm",
      "content": "Oystein, I've avoided issues such as the one you mentioned as there tend to be different schools of thought on whether punctuation should be placed inside or outside quotes. In my part of the world I stick to the following guidelines, but I think this issue is normally a matter of cultural (_ie._ double-quotes [“x”] vs. guillements/chevrons [«x»]) &/or house style:\n\n- period, comma: always inside right quote\n- question, exclamation: inside right quote ONLY if part of quote\n- colon, semicolon: always outside right quote\n- footnote superscript: always outside right quote (kerned carefully)\n\nI haven't included this in the checklist as it seems more an editorial decision than a typographic one (despite the fact that I fight for the above when working with [misguided] editors).\n\n\\*  \nNorbert, thanks too for your suggestions. As above, I haven't bothered to discuss the use of old style or lining figures only because I'm assuming that's relatively obvious. One only has to read a few books on typography to have the proper use of numbers drilled into one's head, and if less than a few such books have been read, one shouldn't be typesetting anything. Ditto for use of small caps: if the font doesn't have true small caps, find another font. And ditto again for small caps after drop caps: this seems more a matter of style than a technical typesetting issue (despite the need for careful kerning after the drop cap).\n\nAs for combing for possible ligs, I've added a new section at the start of the checklist discussing various things that should be noted & potentially replaced throughout a project. Take a look and please do let me know if anyone has anything that could be added to this section.\n\nPlease keep in mind that this little project continues to be ultimately geared to my own taste & needs. I don't suggest that anyone follow these guidelines exactly. Instead, I hope that posting the list might encourage others to modify it to best serve their own workflow.\n\nHere's the latest version: Typographer's Checklist (v.3)  \n[Link removed; see mid-February 2006 posts for a new version of this file.]\n\n"
    },
    {
      "time": "26 Jun 2005 — 2:30pm",
      "content": "Lookin' good. How's this for fussy: the 'RA' kern in TYPOGRAPHER'S is too loose.\n\n"
    },
    {
      "time": "26 Jun 2005 — 6:07pm",
      "content": "Ah, yes, display copy. Thanks Stephen, I far too often get stuck in body copy thinking I'll get back to headings later. Later, however, occasionally ends up being too late.\n\n"
    },
    {
      "time": "26 Jun 2005 — 6:43pm",
      "content": "Well, if we're going to be fussy:\n\nWhy is the head set in small caps?  \nThey are optimized for body copy, and don't have enough contrast and finesse of detail for display use (at least, not in conjunction with text weights of the same face, as here).  \nAlso, an all small caps setting puts the apostrophe way out of position.\n\n"
    },
    {
      "time": "26 Jun 2005 — 7:58pm",
      "content": "Nick, thanks for your comment; I love these questions as they push me to investigate my preferences, and I think that's what learning & experience is based on.\n\nIn this sort of instance I tend to prefer using small caps for headings (unless using caps for a heading & subhead, in which case I use all-caps for the head & small caps for the sub).\n\nI realize using small caps on their own for a heading isn't the convention, but in many cases I'm drawn to small caps for exactly the reasons you mentioned: less contrast & finesse. To my mind, larger-set caps tend to begin to look a bit too \"modern\" (that is Bodoni- or Didot-ish), and the delicacy of the serifs begin to irritate me. (Let alone using an actual [optical] Display weight, as there is for Minion.) I'm a sucker for stocky Renaissance type and thus tend to shy away from the sort of refinement you're advocating.\n\nThe odd thing here is that while I favour a darker Book rather than Regular weight, and have a fondness for Medium & Semibold weights of various book faces, Bold and Black weights make me extremely uncomfortable.\n\nAs for the mis-positioned apostrophe, that's an excentricity I haven't quite found the restraint to abandon. If my ongoing journey towards conservative setting continues, it shouldn't be more than a few weeks before I look at that apostrophe in horror. But for the moment I'm going to enjoy its abandon out in the great white open.\n\n"
    },
    {
      "time": "26 Jun 2005 — 8:11pm",
      "content": "Also, I've cleaned up the kerning in the heading & added a note about lifting parens/brackets/braces with caps, and am about to add something about adjusting the size/baseline for @ & ©, but I won't bother posting another version of the list for a few more days.\n\nBringhurst told me a while back that this is essentially how _Elements..._ started, beginning as a modest primer which grew and continues to grow into an important & comprehensive set of field notes. I'm certainly not attempting anything close to the same here, but I have a feeling this checklist will continue to grow and improve.\n\n"
    },
    {
      "time": "5 Jul 2005 — 4:23am",
      "content": "Nice work Jason!\n\nJust some comments about dashes.\n\nAccording to Geoffrey Dowding's 'Finer Points in the Spacing & Arrangement of Type' en dashes are rightly used in a sequence of figures, as you have done.\n\nFor text copy he uses em dashes without spaces between words. He points out that in any case dashes should be separated from the word or words they relate to by a hair space only, otherwise they appear to be floating, making the line of text becoming too gappy.\n\n"
    },
    {
      "time": "5 Jul 2005 — 10:21am",
      "content": "Like it's been said in other threads, I think the long dash situation is largely dependent on the font's color and dash lengths.\n\n"
    },
    {
      "time": "5 Jul 2005 — 1:50pm",
      "content": "l\\_vazquez  \nWhile I'm familiar with Dowding's (and others') view on dashes, and while I recognize Stephen's comment about colour & length, my approach to dashes used for asides -- like this\\* -- comes down to an editorial perspective.\n\nDashes used for this purpose are meant to distinguish a secondary comment (the aside) from the primary statement (the sentence). Using an non-spaced em-dash for this purpose really doesn't make visual sense because such a setting JOINS the two separate components (comment & statement) rather than distinguishing them from one another.\n\n(Granted, a non-spaced em-dash creates physical space between the sentence & the aside, but the glyph itself creates a visual binding that, to me, works against the purpose of the aside as a comment or response to the sentence it resides in.)\n\nThe same goes for hair-spaced dashes, whether en or em. While Dowding might say that thin- or word-spaced dashes are left \"floating,\" to my mind thin-spacing is the best compromise between editorial clarity and typographic colour.\n\n\\*As always, please excuse HTML's clumsy handling of dashes in this example. HTML uses em's rather than en's, which is what exactly the practice I'm speaking against.\n\n"
    },
    {
      "time": "6 Jul 2005 — 7:02pm",
      "content": "never mind \\*sheepish grin\\*\n\n"
    },
    {
      "time": "7 Jul 2005 — 2:59am",
      "content": "Goudy's idea (which the old guys stole from him) of using an angled hyphen makes a clear distinction between hyphens and dashes.\n\n\\*\\*\\*\n\nAs a writer-typographer, I often leverage punctuation to maximize the visual interest of text. I use the em dash as an alternative to little spotty marks (especially the colon) -- it's so much more brisk and exciting! I also use parentheses as part of this visual scheme: text which incorporates parentheses and dashes, as well as the usual spot marks, is very lively.\n\nSo, for an aside, nothing beats parentheses, and then a hearty dash will plunge the reader right back into the main text stream.\n\n\\*\\*\\*\n\nI also find that in (stacked) bulleted lists, the bullet can be a bit strong, and the period-centered a bit weak, while a dash can provide just the right amount of emphasis. A hyphen always looks like something's missing.\n\n"
    },
    {
      "time": "8 Jul 2005 — 1:36pm",
      "content": "Nice Jason. I got to grips with most of the content within Mr Bringhurts 'Elements of Typographic Style' a few years back. I would advise any student wishing to further their knowledge within typography to indulge. It still sits upon my desktop. While I was learning I would try and take something from it every day … and then when time for seminar grouping, I would impress the group with my knowledge of horizontal motion. And I'm being specifically typographic here.\n\n"
    },
    {
      "time": "7 Feb 2006 — 1:17pm",
      "content": "Jason, did you finish this or remove and replace it? Is this available still?\n\n"
    }
  ]
}
