{
  "id": "12891",
  "title": "Need an early critique - Terra Sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I need an early critique for the sans-serif face. I would especially appreciate any comments on the cyrillic part.  \n(There are no kerning pairs yet, so I had to use optical kerning from Adobe Illustrator to make the text preview).\n\n| Attachment | Size |\n| --- | --- |\n| [terra\\_sans\\_light.pdf](http://web.archive.org/web/20150123044203/http:/typophile.com/files/terra_sans_light.pdf) | 54.43 KB |\n\n",
  "author": "Conxt",
  "time": "5 Jun 2005 — 10:56am",
  "uid": "5630",
  "comments": [
    {
      "time": "5 Jun 2005 — 11:54am",
      "content": "Занятно, что Вы обращаетесь за советами о дизайне Вашей кириллицы — _сюда_. Считайте, что комплименты Вам обеспечены, Андрей.\n\n"
    },
    {
      "time": "5 Jun 2005 — 1:06pm",
      "content": "Максим, я обратился именно сюда не потому, что по каким-то причинам не хочу писать на ru\\_typography, а просто потому, что, возможно, смогу здесь получить более развернутые ответы касательно латиницы :)  \nА в коммьюнити пост появится немного позже, когда будет готово немного больше.  \nКстати, по поводу советов относительно кириллицы, — я в первую очередь имел в виду вас, — именно ваш совет был бы мне наиболее интересен :)\n\n"
    },
    {
      "time": "5 Jun 2005 — 3:57pm",
      "content": "Hey, translations please!\n\nIn the Latin lc, \"g\" and \"r\" I think need [the most] work. And in the Latin UC, the widths are a bit incoherent. Spacing: needs a lot of work, and is a bit loose overall. But I like the overall style.\n\nhhp\n\n"
    },
    {
      "time": "5 Jun 2005 — 4:13pm",
      "content": "I forgot something:  \nAlthough I can't properly judge the character-wise structural [de]merits of your Cyrillic, I do have the following belief\\* concerning multi-script font systems, and it applies stongly to Latin+Cyrillic efforts: the vertical proportions cannot be \"normalized\" blindly across scripts. In the case of Cyrillic for example, the \"x-height\" needs to be higher; and that's just for starters. For a full elaboration of this \"complexity\" please see my article in issue #4 of Spatium magazine.\n\n\\* Something Maxim -and many others- disagree with.\n\nhhp\n\n"
    },
    {
      "time": "5 Jun 2005 — 7:19pm",
      "content": "1. I dont like the URW style of Д (afii10021) and Л (afii10029); same for the lc.  \n2. usualy Ш (afii10042) and (afii10043) are wider  \n3. M reminds me of rotated W\n\nK.\n\n"
    },
    {
      "time": "6 Jun 2005 — 3:03am",
      "content": "I like the look of your typeface.\n\nHowever I second Hrant on the 'r' and 'g'.  \nThe 'r' seems too wide and maybe the arm should join the stem lower.  \nThe 'g' looks very top heavy.\n\nAlso the 'a' is unbalanced to me. Looks like it is tilting a tad to the left. Maybe if the bottom of the bowl extended a little more to the left it would balance better.\n\nThe 's' and 'S' are also a bit unbalanced right now. They are not resting properly. The top part should probably be a little bit smaller than it is now. Both s's also looks too thin on the middle part.\n\nAside from that I think it looks like a nice typeface. I like the beginning and ending strokes of the letters. The diagonal cut.\n\nI can't really say anything about the cyrillic letters.\n\nMKSG\n\n"
    }
  ]
}
