{
  "id": "12896",
  "title": "General Type Design Inquiry",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am close to having some letters to post for a critique, but just as a general question on ITALICS. How do you create Italics while retaining the character of the roman...leaving the impression of it being in the same family?\n\n [‹ What's the best font for a novel?](http://web.archive.org/web/20080404180209/http:/www.typophile.com/node/13627 \"Go to previous forum topic\") [Type suggestions (cross post) ›](http://web.archive.org/web/20080404180209/http:/www.typophile.com/node/14521 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080404180209/http://www.typophile.com/user/6194\" title=\"View user profile.\">Eric_West</a>",
  "time": "<br>",
  "uid": "6194",
  "comments": [
    {
      "time": " 6.Jun.2005 5.22am",
      "content": "This depends a lot on what class of type it is and its intended usage(s). Each class has different numbers of, and kinds of, stylistic tendrils that reach between the two...post visuals and it’ll be easier to see.\n\n"
    },
    {
      "time": " 6.Jun.2005 7.35am",
      "content": "It also depends on whether you wish your face to be informed by writing and typographic tradition or just a variant to be used for emphasis. In this situation, you can theoretically invent anything you want, provided it has visual consistence with the “Roman”.  \nThis could go for any language’s Script, I think, as long as you are willing to experiment instead of applying common rules.\n\nIf you are interested in serious text type, just post a sample and follow David Berlow’s advice. Don’t lose the opportunity.\n\n"
    },
    {
      "time": " 10.Jun.2005 8.24am",
      "content": "Actually, there are no general rules for roman and italic.  \nMany historic typefaces had no italics and either italics created later or the roman was matched with an existing italic.\n\nThe general trend for the last fifty years is to design a complementary italic for each roman weight.\n\nIf your design is a true text type, then you have some options based on the nature of the design. You neglected to mention a type classification for our reference.\n\nSometimes the italic weights can rival the roman version. I always felt Matthew Carter’s ITC Galliard italics were truly outstanding.\n\nJust some thoughts to ponder.\n\nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 10.Jun.2005 5.49pm",
      "content": "The face I’m working on is, I hope, an old style serif. Def. a text face, might do a display later, if I have time.\n\nI was really wondering about how you carry over those attributes. ( Guarding face ) It just seems italics on most roman faces dont vary that much...\n\n?\n\n"
    },
    {
      "time": " 11.Jun.2005 8.15am",
      "content": "If you are designing an old style typeface, it depends on what your intent is and what applications the face is more suitable for.\n\nIf the design is primarily for book publication and lengthy text, you might try a more traditional approach. It always helps to do a little research on how some of the best type designers resolved the same problem.\n\nFor traditional book face examples, review these famous versions of Garamond:\n\nStempel Garamond™ from Linotype  \n [http://www.linotype.com/1500/stempelgaramond-family.html](http://web.archive.org/web/20080404180209/http:/www.linotype.com/1500/stempelgaramond-family.html \"http://www.linotype.com/1500/stempelgaramond-family.html\")  \nPlease make sure to read the descriptive text below the samples as it illustrates how many source specimens and how many iterations a design can go through.\n\nBerthold Garamond  \n [http://www.bertholdtypes.com/bq\\_library/90076.html](http://web.archive.org/web/20080404180209/http:/www.bertholdtypes.com/bq_library/90076.html \"http://www.bertholdtypes.com/bq\\_library/90076.html\")  \nIf you want to review the full character complement and text samples, download the Old Style pdf samples from their home page: [http://www.bertholdtypes.com/home.html](http://web.archive.org/web/20080404180209/http:/www.bertholdtypes.com/home.html \"http://www.bertholdtypes.com/home.html\")\n\nThese specimens will clearly illustrate how the italic cuts can differ and how the character shapes and widths complement the roman.\n\nIf you are taking a more contemporay approach and feel your design is better suited for advertising, brochures, medium to short text applications, try looking at ITC Garamond.\n\nITC Garamond (from Linotype)  \n [http://www.linotype.com/664/itcgaramond-family.html](http://web.archive.org/web/20080404180209/http:/www.linotype.com/664/itcgaramond-family.html \"http://www.linotype.com/664/itcgaramond-family.html\")  \nAgain, read the descriptive material below the samples. It illustrates how intended use will greatly affect your design decisions.\n\nOf course the final decision on how to approach the italics is up to you. You may be able to take a more innovative approach and perhaps give the type world something fresh and exciting.  \nGood luck.\n\nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 10.Aug.2005 3.18pm",
      "content": "{Bump}\n\nhhp\n\n"
    },
    {
      "time": " 10.Aug.2005 5.27pm",
      "content": "what/why {Bump}?\n\n"
    },
    {
      "time": " 10.Aug.2005 5.37pm",
      "content": "If this thread were a woman and I were a hair product commercial:  \n“Because you deserve it.”\n\nhhp\n\n"
    },
    {
      "time": " 11.Aug.2005 6.33am",
      "content": "I think somebody at Apple read that last bit of descriptive material for ITC Garamond.  \nTim\n\n"
    },
    {
      "time": " 11.Aug.2005 6.57am",
      "content": "Eric,  \nDid you see this thread?\n\nTips For Constructing True Italics  \n [http://typophile.com/node/13743](http://web.archive.org/web/20080404180209/http:/typophile.com/node/13743 \"http://typophile.com/node/13743\")\n\nChrisL\n\n"
    },
    {
      "time": " 12.Aug.2005 10.01pm",
      "content": "Hey,\n\nWow. Thanks ...\n\nEric\n\n"
    }
  ]
}
