{
  "id": "12907",
  "title": "Apple Eats the Intel Fruit",
  "forum": "Joe Pemberton's blog",
  "tags": [

  ],
  "content": "[http://arstechnica.com/news.ars/post/20050606-4974.html](http://web.archive.org/web/20080314123222/http:/arstechnica.com/news.ars/post/20050606-4974.html \"http://arstechnica.com/news.ars/post/20050606-4974.html\")\n\nUpside: The future could mean running OS X won’t require Apple hardware. In other words, the ability to run OS X on any Intel box. It also means that a huge body of people with existing Intel hardware will be able to use OS X.\n\nDownside: I may never get a G5 Powerbook, but will have to wait for the G6 in 2006.\n\nI’m reading between the lines here a little. But the news is very interesting.\n\n",
  "author": "<a href=\"/web/20080314123222/http://typophile.com/user/1160\" title=\"View user profile.\">Joe Pemberton</a>",
  "time": "<br>",
  "uid": "1160",
  "comments": [
    {
      "time": " 6.Jun.2005 4.23pm",
      "content": "I was having a good day until I read this. So, will apple get out of the hardware side of things? I JUST DONT UNDERSTAND. The PowerPC chip was touted as being much more efficent data processor than standard P2,3,4 whatever. How do they justify this. This is almost as bad a someone killing my dog.So, no-one will pay big bucks for a mac, because ’a mac’ as we know it, will no longer exist?\n\nOhh ... my brain.\n\n"
    },
    {
      "time": " 6.Jun.2005 4.44pm",
      "content": "How will the argument go now? It was PC v Mac ... yeah, I’m with you Eric, this hurts my brain too.\n\n"
    },
    {
      "time": " 6.Jun.2005 6.02pm",
      "content": "I was worried, too, only recently (2 yrs) having finally and (I thought) permanently made the switch to Mac.\n\nBut, then, I thought, the speed and ease of use with the Mac OS comes mainly from the fact that it’s (a) well designed, (b) written for a narrow range of hardware, and, since OS X, (c) on a Unix base. So, as long as they keep all three of these characteristics, and provide some means for helping legacy users make the switch—this will be the real toughie—what does it matter what hardware Apple uses? The processor and the motherboard were the last proprietary hardware holdouts, anyway. (I bracket for the time being the issue of diversity in processor manufacturing; I doubt that Apple will be interested in making sure that its builds of future OSs will run as well on AMD chipsets as on Intel ones.) And the case design won’t revert to beige and black boxes.\n\nI found a (non-techie) post on a blog on my regular rounds (Crooked Timber) that puts this announcement in perspective pretty well, I think: [http://crookedtimber.org/2005/06/06/apple-switches/](http://web.archive.org/web/20080314123222/http:/crookedtimber.org/2005/06/06/apple-switches/ \"http://crookedtimber.org/2005/06/06/apple-switches/\"). This should be the permanent link; apologies if I screwed it up. (the Internets are pretty confusing sometimes.)\n\n"
    },
    {
      "time": " 6.Jun.2005 6.56pm",
      "content": "I guess this was inevitable. It’s kinda like... computer socialism ! Universal box!\n\nI’m sure it will take time. A LONG TIME ... For people to grasp WHY it’s so much better, and bring down the empire that is M\\*\\*\\*\\*\\*\\*\\*t. Once it doesn’t cost an arm and a leg, maybe folks will givitashot.\n\nI hope Apples’ OS’s take over, and the light will be seen by all... \\*\n\n\\*gong chimes, doves ascend into the heavens\n\n"
    },
    {
      "time": " 7.Jun.2005 10.19am",
      "content": "Ok. I’ll just say what I’m thinking. — After I spoke with someone who is a little bit more of a geek than myself this stuff was made more clear to me. So now I am embarassed about my post above, and your original entry, Joe, makes more sense to me.\n\nThe only thing changing is the chip, from motorola to intel, and nothing else. Right? So really none of us will have to even joke about “switching”. I was told intel chips run cooler and faster, among other things, so it really is a good switch. Am I still confusing the information?\n\n"
    },
    {
      "time": " 7.Jun.2005 10.33am",
      "content": "\\> The only thing changing is the chip\n\nRight. But the chip is the brains! Everything (like the OS!) has to be **at least** recompiled; then certainly tested up the wazoo, and parts rewritten...\n\n\\> intel chips run cooler and faster\n\nQuite the contrary.  \nThis seems like typical “Apple can do us no wrong” disinformation.\n\nI think the main reason for the switch is marketing, and a desire for more sales: Intel has a much stronger reputation among laymen than Motorola/IBM, so Apple can start advertising “Intel Inside” hogwash, and sell more crap to less sophisticated people.\n\nhhp\n\n"
    },
    {
      "time": " 7.Jun.2005 10.35am",
      "content": "One of my co-workers said that this was like Anakin Skywalker going over to the dark side of the force.\n\nI use Macs because I have always used them (or, I have always preferred using them). I remember a time when there was no PowerPC inside. I like MacOS, in all of its iterations, and I love my PowerBooks (I’m on my second one; first black, then alumninum).\n\nI’ll keep using Macs, I suspect. I really don’t care what processor is inside as long as it is fast. I don’t see how an intel chip will suddenly slow down MacOS, or make the machines suck. Can someone explain to me if/how they would? Or is this just some sort of “booo! PCs suck” pride thing?\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080314123222/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 7.Jun.2005 10.54am",
      "content": "\\> I remember a time when there was no PowerPC inside.\n\nBut it was still Motorola - the same people who now make the PowerPC! In fact back then both Motorola and Intel were making CISC (not RISC) chips, so they were architecturally closer! The main practical advantage Motorola had back then was in math (think 3D rendering), while the main advantage it has now is power-efficiency (think laptops).\n\nAnd it’s not a matter of short-term performance, but long-term platform issues: Will Apple eventually start making only -or mainly- software? And gadgets?\n\nhhp\n\n"
    },
    {
      "time": " 7.Jun.2005 11.24am",
      "content": "Well, is not the first time that Apple transitioned to new hardware and it won’t be the last time.\n\nSince IBM didn’t let Apple use their dual core G5 processors but used them in their own server systems it was only a matter of time until Apple was fed up. Steve Jobs isn’t known as the most patient man on the planet.\n\nYes I know that Intel processors are weaker under fire (heavy performance over longer time) compared to PowerPC, but since they consume less power you could simply have 4 or 6 of them in one machine with Apple’s current cooling systems.\n\nBut no one said that the retail version ships with the current intel chips, which are laughable at best when compared to chips like the PowerPC or the MIPS R16000 line.\n\nJobs didn’t show performance heavy applications like FinalCut Pro and only the nice and easy filters of Photoshop CS2.\n\nIt is definitely going to be interesting.\n\nFrank\n\n"
    },
    {
      "time": " 7.Jun.2005 3.53pm",
      "content": "Disclaimer: I actually know something about CPU architecture.\n\nFor 90% of Mac users, it won’t make much difference whether the CPU is PPC or Intel. What distinguishes the Mac is the operating system. OSX will still be robust, offer a nice user experience, and not collect spyware and viruses like Windows.\n\nNew versions of actively maintained software will just have to be recompiled; you won’t see much difference. Older, legacy software will run in an emulation layer; if all goes well, it’ll just be slower. Of course, there will be times when all does not go well.\n\nPeople debate the relative merits of the PPC and Intel architecture until they’re blue in the face, but there’s not that much practical difference. In areas where one had the edge (the G4 with its Altivec instruction set), the other caught up (SSE2 is as good; I know, as I’ve ported my vector-optimized inkjet halftoning code to both architectures). What does matter is the multibillion dollar investment Intel is putting into making a variety of chips across their product line, including cool-running laptops (Pentium M) and powerful server chips. It also helps that Intel has AMD nipping at their heels and keeping them honest. Apple was held hostage by PPC chip manufacturers (Motorola with the G4, IBM with the PPC970 = G5) who didn’t really need Apple’s business and weren’t willing to invest enough. In the case of the G4, the clock speed is stuck at a small fraction of what’s available in the rest of the world, and in the case of the PPC970, IBM wasn’t willing to do the engineering to make a low-power, laptop friendly version of the chip.\n\nFarther down the road, it’s hard to say what the implications will be. Apple plans to only ship OS X on their branded hardware, but in reality their gear won’t be any different than a beige box. Indeed, the Darwin kernel at the heart of OS X already runs on commodity Intel gear. Count on hackers to port the rest of the OS X runtime. I can’t say now whether this will remain a curiosity, or will cross over to being a mainstream alternative, just as all serious gamers now mod-chip their X-boxes.\n\nOverall, while this move signals the end of the era where aesthetics of computer architecture counted one whit, compared with the inexorable power of money, I see it as a good thing. Since Apple will be selling the exact same hardware as Dell, they will be forced to become price-competitive. Meanwhile, Mac users will actually get laptops with decent raw compute power, which otherwise would never have happened. There will probably be some adjustment pains, but when that’s over, I bet Apple will pick up another point or two of market share, which is absolutely necessary if for no other reason than to keep Microsoft honest.\n\n(oh, and not to flame-war, but current Intel chips are definitely not laughable. A 3.6GHz Pentium 4 delivers about 1700 base CINT2000 Specmarks, compared to about 986 for a 2.2GHz PPC970; it’s hard to get real benchmark data for the PPC architecture because Apple doesn’t seem to participate in the official Spec benchmark process; even the 2GHz Pentium M clocks in at a very respectable 1528. In the arena of raw processing power, Intel beats PPC hollow in price/performance, and that gap is likely to widen).\n\n"
    },
    {
      "time": " 7.Jun.2005 5.29pm",
      "content": "I think Apple just got fed up with poor supply from both Motorola and IBM and just went with the guy who can supply chips instead of promises. The chips will also be cheaper because of volume and even Mac hardware will become a bit cheaper. Apple will still sell better hardware and probably maintain its 9% market-share. It will also sell a heck of a lot more of $150 OS-X software to boot. Microsoft seems to make a buck or two on software alone it seems.\n\nChrisL\n\n"
    },
    {
      "time": " 7.Jun.2005 7.32pm",
      "content": "All I have to say, is I have a 1.25 ghz G4 w/1 gig of memory that runs faster, cleaner and smoother than a 3 ghz PC w/windows XP pro at my old job. That thing could barely keep Itunes and InDesign open at the same time.\n\n"
    },
    {
      "time": " 8.Jun.2005 3.35pm",
      "content": "For a few years at least, even with the Intel processors on board, Apple will still have the advantage of selling the “whole widget,” with box, OS, and some applications all tuned. There may be unauthorized hacks to bring the OS onto other makers’ wares, but Apple will point to the tuned environment as the real experience. And they’ll be able to champion and support the best technologies in advance of the rest of the industry, as they did with USB.\n\n= David Randolph Koski =\n\n"
    },
    {
      "time": " 8.Jun.2005 4.23pm",
      "content": "\\> And they’ll be able to champion and support the best  \n\\> technologies in advance of the rest of the industry\n\nExcept in the realm of type, where they’ve sucked hard for a while now. :-(\n\nhhp\n\n"
    },
    {
      "time": " 10.Jun.2005 6.50pm",
      "content": "Raph wrote:  \n_Since Apple will be selling the exact same hardware as Dell, they will be forced to become price-competitive._\n\nI disagree. This is true of the chip only, but won’t be true of any other hardware. Apple’s industrial designers are some of the most lauded in their field. I will still expect to pay more for Apple’s brand.\n\nRaph also wrote:  \n_Meanwhile, Mac users will actually get laptops with decent raw compute power, which otherwise would never have happened._\n\nThat’s what I’m looking forward to.\n\nSome are speculating that Apple will solely focus on the operating system and get out of selling boxes. I don’t think that’s true. Jobs killed the cloning business because the Mac clones were suffocating Apple profits (this was a move to not only stay in the hardware business, but keep it exclusive to Apple). Then again, that was 1997 or something.\n\nOthers are speculating (and this is where I think it gets interesting) that Apple wants an Intel chip because, unlike IBM, Motorola or AMD, Intel is supposedly close to a chip that will handle digital rights management (DRM). Doing so would put Apple in position to continue to dominate media on the desktop in the age of DRM.\n\nIn the end, what I like about Apple hardware is that I can buy one and bring it home and never have to crack it open (if I don’t want to). What plagues Windows is having to be compatible with every device manufacturer. It’s Windows’ strength and it’s main weakness - being that open leaves room for incompatibilities, security holes and viruses.\n\n"
    },
    {
      "time": " 10.Jun.2005 9.22pm",
      "content": "\\> never have to crack it open\n\nI think this difference between the platforms is a myth. I think you -and many others- prefer Apple mainly because it’s hip; and this is clearly a cornerstone of Apple’s branding/marketing. The fact that Intel is not less hip than Motorola is crucial to this new development.\n\nhhp\n\n"
    },
    {
      "time": " 11.Jun.2005 3.13am",
      "content": "That is exactly (part of) the reason why I like Apple, Hrant. I don’t see anything wrong with that, either. It is my money afterall…\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080314123222/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 11.Jun.2005 2.24pm",
      "content": "Dan, I **know** you’re not that materialistic.\n\nhhp\n\n"
    },
    {
      "time": " 11.Jun.2005 3.16pm",
      "content": "Hrant what I mean is that…\n\nI’ve been using computers since I was 4. Macs & PCs since I was 14. I just like Macs better. This has very little to do with the chip that is inside, it is just a matter a preference and habit. And I like the way that they look. I’m willing to pay more for that, even though experience tells me that I really can get the same results a (rather little) less money.\n\nSpending money on quality and design doesn’t make me overly materialistic. When I go shirt shopping, sometimes I will buy a more expensive shirt because I just like it better. Sometimes, I buy a cheaper one because looks don’t matter. In the near future I will probably buy a car. It won’t be a luxury car, but it probably won’t be the absolute cheapest one on the lot (over here, that would be a Skoda or a Renault) either. I’d rather buy a VW. There isn’t a compelling NEED there. Is that so bad?\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080314123222/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 12.Jun.2005 11.32am",
      "content": "Because it’s hip? Sorry hrant, I’d get out of design if I had to use windoz 24/7...\n\nI dont have the patience for it.\n\n"
    }
  ]
}
