{
  "id": "12915",
  "title": "Printable type/font reference book",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Does ANYONE know where I could find a \\*\\*FREE\\*\\* downloadable type/font reference document. Way back in 1996 when I started designing, the design firm had a 500 page reference book with fonts.\n\nI have YET to find one of these free. I know about the Adobe Type Library Reference book version 2, but that doesn’t have everything.\n\nAny help with this would be greatly appreciated.\n\nI just don’t find looking at gif images of samples very efficient...\n\nThanks!  \n-cardo\n\n [‹ TypeCon2005???](http://web.archive.org/web/20080421031509/http:/www.typophile.com/node/12771 \"Go to previous forum topic\") [Job Opening ›](http://web.archive.org/web/20080421031509/http:/www.typophile.com/node/13026 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080421031509/http://www.typophile.com/user/7717\" title=\"View user profile.\">cardoe</a>",
  "time": "<br>",
  "uid": "7717",
  "comments": [
    {
      "time": " 6.Jun.2005 6.50pm",
      "content": "Well... you could order catalogs from a bunch of foundries you like... but those aren’t going to have everything. I picked up a few older type books at a used book sale a while back, they weren’t free but they were worth the $3. [Rookledge’s International TypeFinder](http://web.archive.org/web/20080421031509/http:/www.amazon.com/exec/obidos/tg/detail/-/1856694062/qid=1118108739/sr=1-2/ref=sr_1_2/104-2474722-6202353?v=glance&s=books) was one of them, I have the 1983 edition. Worth a look on eBay, maybe?\n\n"
    },
    {
      "time": " 11.Jun.2005 8.55am",
      "content": "I don’t think you will find a complete compendium of available typefaces, and sadly, the old type catalogs from type houses and foundries have gone the way of the doing manual character counts for text fitting.\n\nIt simply isn’t practical and incredibly expensive and time consuming to produce one, even in PDF without actually printing one.\n\nYou can still get a hard copy of:  \n“The Type Specimen Book: 544 Different Typefaces With over 3000 Sizes Shown in Complete Alphabets”  \nby & M Typographical Inc.  \nThis only shows 544 styles, a drop in the bucket to what’s available.\n\nBerthold has great downloadable PDF versions of their type library, very well done, but again, not even close to what you want.  \n [http://www.bertholdtypes.com/home.html](http://web.archive.org/web/20080421031509/http:/www.bertholdtypes.com/home.html \"http://www.bertholdtypes.com/home.html\")\n\nIf you are interested in old type specimen books, you can go to the Univerity of Delaware Library site and view samples and descriptions:  \n [http://www.lib.udel.edu/ud/spec/guides/bookarts.htm](http://web.archive.org/web/20080421031509/http:/www.lib.udel.edu/ud/spec/guides/bookarts.htm \"http://www.lib.udel.edu/ud/spec/guides/bookarts.htm\")  \nThat way you can know what titles to search for on EBay or Google.\n\nI have a modest size collection of type specimen books going back to the early 1900’s and they are great for reference but not relevant to fonts being sold today. Remember, most hot metal and phototype fonts were retooled for digital fonts and many have lost their design subtleties.\n\nYes, I’m old, but I’m back in style!\n\n"
    }
  ]
}
