{
  "id": "12913",
  "title": "PC Laptop vs. Virtual PC for font testing.",
  "forum": "Build",
  "tags": [

  ],
  "content": "I am developing fonts on a Mac Poweerbook 15 inch and I want to test them on a PC to see how they render to screen - it occured to me that I could do this ( maybe ) with Virtual PC or some other PC emulator - I haven’t researched the software in detail yet. I think MS is the only one who offers this now... Anyway.\n\nI was wondering if anybody has gone this route or if maybe it’s really stupid idea because:\n\na. - The rendering hardware/software is still Mac/Quartz so it isn’t a good test.  \nb. - The screen on my laptop cannot show me 96 dpi anyway.  \nc. - Virtual PC is just too slow on a mac laptop to ever be a viable/humane way of working\n\nor\n\nd. - some other reason If haven’t come up with.\n\nAlso, in the meantime, is there some non-OS oriented way of quickly testing a font at 96 dpi emulated? It seems like the microsoft browser did some kind of font size switching on mac that let you see web sites as they would render on a PC & Mac both. Amybody used that or some other technique?\n\nThanks!\n\n [‹ Letter Design : width - proportion](http://web.archive.org/web/20081006023750/http:/www.typophile.com/node/13073 \"Go to previous forum topic\") [Why is InDesign CS converting fonts into CID? ›](http://web.archive.org/web/20081006023750/http:/www.typophile.com/node/13023 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081006023750/http://www.typophile.com/user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 6.Jun.2005 3.06pm",
      "content": "If you’re wanting to test the robustness of your fonts, your best bet is to use an actual Windows machine. But if you just want to see what they’re going to look like, all you really need\\* is a way to bump up the gamma on your Mac display; and the dpi issue is moot, since it’s nominal anyway - just do the math (multiply the point size by 4/3 and use that), or even create a document in Photoshop and set it to 96dpi.\n\n\\* Unless you’re using heavy TT hinting...\n\nOne thing though: if you’re making grayscale pixelfonts and want to see what they look like in “native” Windows (like Word, as opposed to Photoshop), then that’s a problem, since there’s a pronounced lightening that goes on in that situation, to the point of requiring different cuts of your fonts.\n\nhhp\n\n"
    },
    {
      "time": " 7.Jun.2005 8.48pm",
      "content": "If you have the money and the space, an actual PC is a better way to go. You can get a refurbished one for not much more than the cost of Virtual PC and it will run faster. If you’re short of space, VPC does have the advantage of taking up zero desk space.\n\n"
    },
    {
      "time": " 7.Jun.2005 10.36pm",
      "content": "It sounds like an actual machine is what I am going to want.\n\nNow if I could only run all OSes on an Intel chip. Wait-now we are almost there... Sweet!\n\nThanks for the feedback!\n\n"
    },
    {
      "time": " 8.Jun.2005 7.47am",
      "content": "_Now if I could only run all OSes on an Intel chip._\n\nYou can actually run multiple versions of Windows (or even Linux, I think) by using Virtual PC for Windows. I haven’t tried this myself, though.\n\n"
    },
    {
      "time": " 9.Jun.2005 12.59am",
      "content": "I was just talking ( obliquely ) about the apple announcement that they will be moving from power pc chips to intel chips. This won’t be done for a while 2007 is the date they are talking about - but in theory you could run Windows, linux, & mac OS X 10.? - all on the new intel based hardware architecture apple will be coming out with.\n\nI would like it a lot if I could have a minimal sized Multi OS platform. And it looks like I have 2-3 years to wait now.\n\nIn the meantime, I need a junky laptop or desktop. I am doing TT hinting.\n\nBut I can dream.\n\n"
    },
    {
      "time": " 12.Jun.2005 2.35am",
      "content": "I checked yesterday about my IE question - the answer is yes - IE on the mac let’s you set the text at 96 dpi ( simulated ) or 72dpi. When you set your font in prefs as one of the defaults types of text you can get an idea of what it will look like at both rez types and pretty fast - it’s not a perfect test - but good for a quick check.\n\n"
    }
  ]
}
