{
  "id": "12949",
  "title": "A www ligature",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Won't a www ligature be terribly useful? Or do ligatures have to be Siamese twins, not triplets?\n\n",
  "author": "karenhuang",
  "time": "7 Jun 2005 — 7:41pm",
  "uid": "7022",
  "comments": [
    {
      "time": "7 Jun 2005 — 8:04pm",
      "content": "I actually made one for Patria. I think it could be useful, in a gimmicky sort of way, as long it looks like more than two \"w\"s. BTW, ligatures can be formed of a **lot** more than two characters! Just ask Granjon about his Greeks.\n\nhhp\n\n"
    },
    {
      "time": "7 Jun 2005 — 8:19pm",
      "content": "For me, I think it'll be very useful. I like to italicise urls, but then they always end up looking a little spacy, like this:\n\n[http://www.manic.com.sg/blog/images/www.gif](http://web.archive.org/web/20131018081741/http:/www.manic.com.sg/blog/images/www.gif \"http://www.manic.com.sg/blog/images/www.gif\")\n\n"
    },
    {
      "time": "8 Jun 2005 — 8:24am",
      "content": "well, one option is to dump the 'www' prefix when it's not needed. But I do think a www ligature would be nice to see.\n\n"
    },
    {
      "time": "8 Jun 2005 — 8:29am",
      "content": "i _love_ salmiak's www logotypes.  \n [http://letterror.com/catalog/salmiak/index.html](http://web.archive.org/web/20131018081741/http:/letterror.com/catalog/salmiak/index.html \"http://letterror.com/catalog/salmiak/index.html\")  \n [http://letterror.com/catalog/salmiak/specimens/Salmiak\\_Catchwords\\_px.pdf](http://web.archive.org/web/20131018081741/http:/letterror.com/catalog/salmiak/specimens/Salmiak_Catchwords_px.pdf \"http://letterror.com/catalog/salmiak/specimens/Salmiak\\_Catchwords\\_px.pdf\")\n\n"
    },
    {
      "time": "8 Jun 2005 — 9:10am",
      "content": "I think the www ligword works for Salmiak because it is such an illustrative typeface and the ligword itself moves beyond a combination of letters and becomes a sort of illustration. I'd wonder if the www just becomes a pattern and agree that it really isn't needed any longer.\n\n"
    },
    {
      "time": "8 Jun 2005 — 5:20pm",
      "content": "I only wish that www wasn't needed anymore. At least around here, I still see a lot of domains that show different pages (usually 404s) when accessed without www.\n\n"
    },
    {
      "time": "8 Jun 2005 — 5:39pm",
      "content": "See the www ligs in Eidetic Neo from PsyOps. There's one for every weight, including italics. You might need to download the PDF to see them but they're there.\n\n[http://www.psyops.com/html/spec\\_eideticneo.html](http://web.archive.org/web/20131018081741/http:/www.psyops.com/html/spec_eideticneo.html \"http://www.psyops.com/html/spec\\_eideticneo.html\")\n\n"
    },
    {
      "time": "8 Jun 2005 — 7:16pm",
      "content": "yea, www needs to go away, like 5 years ago.\n\nEverybody knows. Most browsers don't even need it. Maybe all. Annoys the crap outta me when I see an ad with this giant line of\n\n[www.comevisitusatourinernetaddress.com](http://web.archive.org/web/20131018081741/http:/www.comevisitusatourinernetaddress.com/ \"www.comevisitusatourinernetaddress.com\")\n\nVery unneccesary.\n\n'thumbs nose'\n\n"
    },
    {
      "time": "8 Jun 2005 — 9:00pm",
      "content": "We only managed to shed http:// not so long ago.\n\nYou'll be surprised when designing to reach the masses (eg for internet banking, govt sites, etc), you have to be very explicit.\n\nI don't know how old everyone else is, but I always use my parents as a gauge. They're not internet saavy at all. If my target audience include people like them, I feel I have to include www, just to make it that much more obvious that it's a website, not anything else.\n\nThere are all kinds of confused people out there. Once I saw an email address like this [email@www.domain.com](mailto:email@www.domain.com).\n\nAnd another time, in a test, where we ask people to guess where clicking on each button will bring them. This nice lady said, \"If I click here, I will get articles on home and cooking, etc...\" It was the HOME button!\n\n"
    },
    {
      "time": "8 Jun 2005 — 9:08pm",
      "content": "Maybe something could be done with a 'W' and a '3' ?\n\n"
    },
    {
      "time": "8 Jun 2005 — 9:23pm",
      "content": "Or \"U\" and \"6\".\n\nhhp\n\n"
    },
    {
      "time": "9 Jun 2005 — 1:38am",
      "content": "Hrant is really funny these day! Must've taken a funny pill. :-D\n\n"
    },
    {
      "time": "9 Jun 2005 — 8:55am",
      "content": "_Everybody knows. Most browsers don’t even need it. Maybe all._\n\nIt's a server issue. [www.domain.com](http://web.archive.org/web/20131018081741/http:/www.domain.com/ \"www.domain.com\") and domain.com can point at two completely different web sites. Most competant web admins will make sure they point at the same, but as was mentioned, you still run into poorly set up sites that force you to use the www\n\n"
    },
    {
      "time": "9 Jun 2005 — 10:57pm",
      "content": "Hrant,\n\nIn some languages the double-u (uu) is called double-v (vv) instead.\n\n"
    },
    {
      "time": "9 Jun 2005 — 11:45pm",
      "content": "I have a fascination with thresholds. You know those mini ketchup and mustard bottles, the ones that are short & stout, with [relatively] very wide openings? Well, is such a container a bottle, or a jar? How short/shallow does the neck have to be before a bottle is actually a jar? And who decides, how? And if this sort of thing can be determined empirically, over how long a period would such a determination stay valid (within the confines of the margin of error of the experiment), considering that mindsets and terminology change over the generations, or even within one person over his lifetime? And all this applies to glyphs too: Can we design a glyph that people simply won't be able to decide if it's a \"u\" or a \"v\"? Some people will quickly be sure; others will refuse to make a determination. I think most people would deliberate about it, then eventually decide (if only because they're asked to). Now, there must be a 50-50 threshold, but would the bell curve be spiky enough to justify the time spent finding it? And most of all: how can such ambivalent glyphs be useful, I mean in the practical realm of communication? Can they say two things at once, or maybe say nothing, and as a result convey something fundamental about the human condition? Gorgias was right, really - to hell with my SMC philo teacher, historical-revisioning that he killed himself in a confused stupor (while in fact he retired to horticulture, like Sumner Stone), doubtless to give his own narrow existence less insignificance.\n\nhhp\n\n"
    },
    {
      "time": "10 Jun 2005 — 10:22pm",
      "content": "Hrant\n\nWe tried tonight. Did everything as we were supposed to. But Granjon did not respond. Maybe tomorrow night.\n\nGerald\n\n"
    },
    {
      "time": "10 Jun 2005 — 10:35pm",
      "content": "Hrant\n\nI just have to ask this. Is the ketchup and musturd monologue the longest paragraph you have ever posted?\n\nGerald\n\n"
    },
    {
      "time": "10 Jun 2005 — 10:52pm",
      "content": "\\> Granjon did not respond\n\nMaybe your French was too modern.\n\n\\> longest paragraph you have ever posted?\n\nSeems pretty unlikely, statistically.\n\nhhp\n\n"
    },
    {
      "time": "11 Jun 2005 — 10:50am",
      "content": "\\> longest paragraph you have ever posted?  \nI really doubt that.\n\nWhat about Granjon?\n\n"
    },
    {
      "time": "11 Jun 2005 — 11:36am",
      "content": "[http://www.themicrofoundry.com/other/Granjon-Greek.gif](http://web.archive.org/web/20131018081741/http:/www.themicrofoundry.com/other/Granjon-Greek.gif \"http://www.themicrofoundry.com/other/Granjon-Greek.gif\")\n\nIt's like Twister™ in lead.\n\nhhp\n\n"
    },
    {
      "time": "12 Jun 2005 — 1:53pm",
      "content": "I found a posting for a freelancer the other day from the company 'prolific playaz'. Anyway this was the email listed,\n\n[www.prolificplayaz@domain.com](mailto:www.prolificplayaz@domain.com)\n\nFunny stuff.\n\n'ps. I prefer to be a 'prolific poster' --- Checkitout. Woo! Watchout hrant and tiffany\n\n"
    }
  ]
}
