{
  "id": "12954",
  "title": "Is this so bad?",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "My work pal and I recently proposed some covers for a 2006 agenda which is going to contain sales tactics and advice for sales people. Our client returned them telling us that \"people\" didn´t like them, that they were boring and weren't creative or modern.\n\nI know this has not been one of our best works (mainly because of limited time and client budget) and that it´s pretty plain, but is this really as bad as she said?\n\nHere are some sketches of a couple of proposals:\n\n- I added after a sample of the approved style for the inner pages -\n\nHéctor\n\n| Attachment | Size |\n| --- | --- |\n| [Muestras 1.jpg](http://web.archive.org/web/20141124231653/http:/typophile.com/files/Muestras%201.jpg) | 7.68 KB |\n| [Muestras 2.jpg](http://web.archive.org/web/20141124231653/http:/typophile.com/files/Muestras%202.jpg) | 9.37 KB |\n| [Muestras 3.jpg](http://web.archive.org/web/20141124231653/http:/typophile.com/files/Muestras%203.jpg) | 8.87 KB |\n| [Muestras A.jpg](http://web.archive.org/web/20141124231653/http:/typophile.com/files/Muestras%20A.jpg) | 13.12 KB |\n| [Muestras B.jpg](http://web.archive.org/web/20141124231653/http:/typophile.com/files/Muestras%20B.jpg) | 13.45 KB |\n| [Muestras C.jpg](http://web.archive.org/web/20141124231653/http:/typophile.com/files/Muestras%20C.jpg) | 13.97 KB |\n| [Muestras D.jpg](http://web.archive.org/web/20141124231653/http:/typophile.com/files/Muestras%20D.jpg) | 13.3 KB |\n| [Interior.gif](http://web.archive.org/web/20141124231653/http:/typophile.com/files/Interior.gif) | 23.72 KB |\n\n",
  "author": "rs_donsata",
  "time": "7 Jun 2005 — 8:46pm",
  "uid": "1530",
  "comments": [
    {
      "time": "7 Jun 2005 — 9:05pm",
      "content": "What kind of company is it ? ( context ) Then we can critique.\n\n"
    },
    {
      "time": "7 Jun 2005 — 9:20pm",
      "content": "Our client is a retired teacher who has written a couple of fairly successful books and wants to invest her capital into this product and sell it to small and mid sized companies like departamental stores, car agencies, insurance agencies and any company dealing with detailed sales work.\n\nThe agenda is meant to be for the average sales person, but bought by their bosses.\n\nHéctor\n\n"
    },
    {
      "time": "7 Jun 2005 — 9:26pm",
      "content": "What is the product ( if you can say ) and what is the significance of the up and down arrows on the 1st file.\n\n"
    },
    {
      "time": "7 Jun 2005 — 9:38pm",
      "content": "The product is a tool to rise sales trough knowledge.\n\nThe arrows are meant to stand for an achieved transaction in the first proposal and also are meant to contextuallice into the realm of  \nstrategy and planification in both proposals.\n\nHéctor\n\n"
    },
    {
      "time": "8 Jun 2005 — 2:55am",
      "content": "My problem with the designs is one: Arrow graphics for sales are over done. two: Everything on the cover is fighting for attention. Prioritize the information. If Tactica is the most important statement, make it dominate. Make Agenda and 2006 small. Think of process over graphics, maybe a textured cover weight paper could carry message. Just some thoughts\n\n"
    },
    {
      "time": "8 Jun 2005 — 8:50am",
      "content": "The ideas in the covers aren't bad as designs on their own, and I'm a sucker for elegance/simplicity. However, many of the layouts feel like first passes, rather than finished ones. Plus, as Dan said, the hierarchy isn't working yet, which is often harder than one expects with only 3 elements on the page. Overall, I prefer the black designs to the white ones. I like the blue and red arrows in 'Tactica', too.\n\nGenerally speaking, sales people love pop, sizzle, sexiness, and any other poorly articulated term for a lot of stuff going on and crazy visual effects. In that sense, your designs my not strike the target audience where it counts, so that's probably why your client didn't like them.\n\nAgain, not bad, but could be better.\n\n"
    },
    {
      "time": "8 Jun 2005 — 5:23pm",
      "content": "You could put some really cheasy photoshop work in there, whith everybodies picture with blurry edges and big 'ol smiles, lots of color, Arial or Times roman embossed in photoshop\n\n... I'll bet you 20 they'd love it.\n\nBut seriously, I agree with the first pass and hierarchy comments by crugen... I think the blue and red arrows are a possibility, but at this point weaken the headline, makes it feel a bit indecisive. Try integrating the arrows into the background, having them move through the headline, don't know how, just experiment.\n\nEric\n\n"
    },
    {
      "time": "23 Jun 2005 — 7:00pm",
      "content": "Tanks a lot for the input, the client finnaly turned down the job (after knowing the printing cost) so I'll take this as a leargning experience about how to deal with clients (and doing better work).\n\nHéctor\n\n"
    }
  ]
}
