{
  "id": "12965",
  "title": "(x) Looking for Prisma PostScript or OpenType version - Koch Memorial {Mike F}",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Anybody know if there is a postcript or opentype version available of a font commonly known as Prisma, I have a TT version which wont outline in illustrator. The typeface is made up of four geometric thin lines and it looks like it is based around Futura or similar and as far as I can tell ther is only a caps version.\n\n| Attachment | Size |\n| --- | --- |\n| [prisma.jpg](http://web.archive.org/web/20130118024312/http:/typophile.com/files/prisma.jpg) | 42.32 KB |\n\n",
  "author": "lumo",
  "time": "8 Jun 2005 — 10:54am",
  "uid": "7748",
  "comments": [
    {
      "time": "8 Jun 2005 — 11:08am",
      "content": "The only versions I could find were also TTF. I think this font was used as a film typeface. I show a number of old scans as well as some current multi-line fonts in the [Lined Fonts ID Guide](http://web.archive.org/web/20130118024312/http:/bowfinprintworks.com/LinedFontGuide01.html). That might help you find an alternative. Sources are listed in the Guide.\n\nAnother possbility, which may not work well, is to convert the font from TTF to Type1. I say it may not work well, because the TT outlines may not be good quality, and that would make 'garbage in- garbage out' situation.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "8 Jun 2005 — 11:41am",
      "content": "thanks for your help, I tried converting to all different formats through fontlab 4.6 - no joy, there seems to be charcters missing and some characters with missing strokes. I was convinced that there was a \"proper\" version of this font around, as in it may have a different name.Your link was very helpful but nothing of any real use for my current piece of design, I think I'll redraw the characters that don't outline correctly - unless anybody has an answer.\n\n"
    },
    {
      "time": "8 Jun 2005 — 12:27pm",
      "content": "Prisma was originally produced by the [Klingspor](http://web.archive.org/web/20130118024312/http:/typophile.com/wiki/Klingspor) foundry. It is a special version of [Rudolf Koch](http://web.archive.org/web/20130118024312/http:/typophile.com/wiki/Rudolf%20Koch)'s [Kabel](http://web.archive.org/web/20130118024312/http:/typophile.com/wiki/Kabel). I am working on a digitization of it. I don't have a complete version of it. E-mail me offline, and I will let you know if there is anything that I can do to help you.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130118024312/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "8 Jun 2005 — 12:41pm",
      "content": "thanks Dan, I've deciced to redraw in this instance as I only need it for a 13 character typographic treatment at present, will indeed contact you if needing any further help, thanks again.\n\nps. how do I close this post as I think it's done with?\n\n"
    },
    {
      "time": "8 Jun 2005 — 12:47pm",
      "content": "Lumo, only moderators can close threads. Good luck with Prisma! Its characters a whole lota \"fun\" to draw…\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130118024312/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "8 Jun 2005 — 1:55pm",
      "content": "Nothing is ever closed on Typophile as we like to give Hrant the opportunity to have the last word.\n\n;^D\n\n"
    },
    {
      "time": "8 Jun 2005 — 2:16pm",
      "content": "If an Opentype version would help, Dieter Steffmann digitized Prisma for the TypOasis [Koch Memorial](http://web.archive.org/web/20130118024312/http:/moorstation.org/Koch_Memorial/dl/dl_02.htm).\n\n"
    },
    {
      "time": "8 Jun 2005 — 2:36pm",
      "content": "Hmmm, that is unfortunate. No need for me to finish working on my version if his is already available…\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130118024312/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "9 Jun 2005 — 6:51am",
      "content": "Thanks to everyone, the opentype version is perfect for me\n\n"
    },
    {
      "time": "9 Jun 2005 — 8:23am",
      "content": "Dan - I hope that you hadn't gotten too far with that Prisma digitization. That must have been a real bear to do.\n\nPerhaps you could work on [Stack](http://web.archive.org/web/20130118024312/http:/bowfinprintworks.com/LinedFontGuide05.html) instead? I've never seen a digital version of that. Nah. The fact that Letraset holds the copyright probably rules Stack out.\n\n"
    },
    {
      "time": "9 Jun 2005 — 8:36am",
      "content": "I had it pretty much done. Spacing needed to be worked on, and the special characters. I'll find a use for my files some day.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130118024312/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "9 Jun 2005 — 9:06am",
      "content": "Mike, Once again I am very impressed with the extent of your knowledge about existing digitizations. Do you have a database with all this info? You must spend a lot of time scouring the web's free sites. If Dieter's fonts were shown with samples that didn't require clicking to a new page to see, I am sure I would have found many more useful revivals. As it is, many of my Guide samples have come from his collection.\n\nThanks for pointing this one out. I'll be sure to add it to that Guide.  \n- Mike Yanega\n\n"
    },
    {
      "time": "9 Jun 2005 — 1:04pm",
      "content": "Thanks Mike. I've got a very marked up Solotype Catalog in which I note every digitization (excluding renamed clones) that I find of a typeface shown in there. I've started, too, to make notations in my Homage To The Alphabet and an old VGC catalog as well for the typefaces in those that don't make an appearance in the Solotype Catalog.\n\nMy days of \"scouring the web's free sites\" – except for a few Asian ones - are well behind me. Pretty much the only freebie revivals I see any more come from those who contribute fonts directly to Cybapee's wonderful TypOasis. Herr Steffmann used to offer his fonts – complete with graphic samples – from his own website, but that got too expensive and Petra stepped in to the rescue (as seems to be in her nature).\n\nI rely on DaFont's New Releases to monitor what's out there freebie-wise and I check TypOasis and MyFonts' What's New pages regularly. On the latter, I love to see new revivals pop up by Dan Solo, Nick Curtis and Canada Type (the latter splendid old scripts, but you probably are well aware of their stuff).\n\n"
    },
    {
      "time": "10 Jun 2005 — 8:28am",
      "content": "Mike F.,  \nIf you are looking for a digital version of Stack: Rafael Dinner digitized it as a shareware font called Reverb. However it has a very limited characterset but if you only need a few letters maybe this one will do for you.  \n [http://www.stanford.edu/~rdinner/fonts.html](http://web.archive.org/web/20130118024312/http:/www.stanford.edu/~rdinner/fonts.html \"http://www.stanford.edu/~rdinner/fonts.html\")\n\n"
    },
    {
      "time": "10 Jun 2005 — 8:37am",
      "content": "Why are so many of the typOasis fonts only available for the PC? It seems so strange since every graphic designer I know uses the Mac.\n\n"
    },
    {
      "time": "10 Jun 2005 — 11:47am",
      "content": "Sander - Thank you very much for pointing me to that digitization of Stack. It's amazing how many years those fonts have been offered on that web page - which has changed very little in all that time. I'd forgotten about it.\n\nI registered Stiletto Silver from Rafaael Dinner years ago (this being one of two digitizations I'm aware of of Calypso Initials), but somehow never made the connection between his Stack and the one in the Catalog.\n\n"
    },
    {
      "time": "10 Jun 2005 — 1:55pm",
      "content": "Patty, I thought most of us Mac users had our utilities to convert TTF files to Mac format (I use Fontgrapher, but there are cheaper options). For my purposes that has always worked well.\n\nI think typOasis is geared to _most_ font users, which are PC users (just based on the distribution of computers, with Macs still not much above 10%), whether we like it or not. You'd also have to admit that not all font lovers are professional graphics designers (yet), and even that not all graphics designers use Macs any more.\n\nMike, I'd love to get my hands on your copy of the Solotype Catalog. I have also got mine full of notes, but I have apparently not been as thorough, or wide-ranging, in my correlations.\n\n- Mike Yanega\n\n"
    }
  ]
}
