{
  "id": "12960",
  "title": "Linotype's Arabic Type Design Competition",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Dear all,  \nWe’ve had many interesting discussions about Arabic type design on this forum and there are many gifted designers who read this. I should have put this in the news section but I can’t seem to find my way around the RSS feed (sorry). So, if anyone is interested, Linotype is hosting its first Arabic Type Design Competition and the deadline is October 31, so there’s a lot of time still left!\n\nThe jury is made up of renowned calligraphers, type designers, and academics who have each offered a great contribution to the development of Arabic typography. They are Samir Sayegh (Lebanon), Fiona Ross (UK), Mamoun Sakkal (Syria/USA), Kris Holmes (USA), and Huda Abi Fares Smitshuijzen (Lebanon/Netherlands). Also participating as an honorary guest juror is the master calligrapher and type designer Hermann Zapf.\n\nThe competition has 3 categories: text, display, and calligraphic. The text category is reserved for text faces, the display category for designs intended for larger sizes, and the calligraphic category is intended for designs based on calligraphic models or any undigitised work.\n\nFor details about the submission of typefaces and for further details please contact:  \n+49 (0) 6172 484 2460 or by mail to [contest@linotype.com](mailto:contest@linotype.com)\n\nMore information is available at the website at [www.linotype.com/contest](http://web.archive.org/web/20080603020959/http:/www.linotype.com/contest \"www.linotype.com/contest\")\n\nAlso, you can find the full press release at: [http://www.linotype.com/18374/19\\_05\\_05-doc.html](http://web.archive.org/web/20080603020959/http:/www.linotype.com/18374/19_05_05-doc.html \"http://www.linotype.com/18374/19\\_05\\_05-doc.html\")\n\n [‹ Forum window](http://web.archive.org/web/20080603020959/http:/www.typophile.com/node/12884 \"Go to previous forum topic\") [Porsche Carrera Fonts ›](http://web.archive.org/web/20080603020959/http:/www.typophile.com/node/12934 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080603020959/http://www.typophile.com/user/2869\" title=\"View user profile.\">nadine_chahine</a>",
  "time": "<br>",
  "uid": "2869",
  "comments": [
    {
      "time": " 8.Jun.2005 9.22am",
      "content": "Nadine, you can e-mail any News item text to me and I can always post it for Linotype. Also, if Linotype has a news rss we can add that to the aggregator.\n\n"
    },
    {
      "time": " 8.Jun.2005 10.28am",
      "content": "Linotype does not have an RSS-Feed yet :(  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080603020959/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 8.Jun.2005 10.36am",
      "content": "It’s OK, Typophile doesn’t have a **working** one anyway... :-/\n\nhhp\n\n"
    }
  ]
}
