{
  "id": "12983",
  "title": "Logo critic for marketing company",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Please offer some reviews / critic  \nThanks  \nMik\n\n| Attachment | Size |\n| --- | --- |\n| [NavixIdentity5.gif](http://web.archive.org/web/20131019062938/http:/typophile.com/files/NavixIdentity5.gif) | 15.28 KB |\n\n",
  "author": "mik",
  "time": "9 Jun 2005 — 3:53am",
  "uid": "5857",
  "comments": [
    {
      "time": "9 Jun 2005 — 4:05am",
      "content": "sorry for all the confusion with the double post.\n\n"
    },
    {
      "time": "9 Jun 2005 — 6:05am",
      "content": "Since I know nothing about the company, I can only voice my preference for the look. I prefer the second one (yellow balloon, sans). If you use the serif face, try the sans for the tagline. I assume the shape above the 'i' is supposed to look like a word balloon. Is that true?\n\nAlso, at smaller sizes, 'complete communications' will turn into ant tracks. Be careful. It should probably be at least 150-200% larger, I'd guess.\n\n"
    },
    {
      "time": "9 Jun 2005 — 6:24am",
      "content": "I have to agree with version 2, although the na needs a hair more space, the strapline (what is that face by the way?) seems caught between ranging right and centred under the yellow bubble (enlarging it would help avoid that). I think the bubble needs some work if it is to be a speech bubble.  \nTim\n\n"
    },
    {
      "time": "9 Jun 2005 — 7:41am",
      "content": "Version 2. But I miss something in the yellow dot, try a spiral gradient or something...but don't overdo it either.\n\nK.\n\n"
    },
    {
      "time": "9 Jun 2005 — 8:09am",
      "content": "Thanks for all your help.\n\nI have done a number of mods to those designs i shall post soon for discussion.\n\ntimd - The strapline in number 2 is \"Plume DaMa\"\n\n"
    },
    {
      "time": "9 Jun 2005 — 8:27am",
      "content": "_\\> try a spiral gradient_\n\nAre you serious.? :)\n\n_( As I previously stated, [here](http://web.archive.org/web/20131019062938/http:/typophile.com/node/12982), I like / prefer the 2nd version, but I still think you will probably loose the finer lower end part of the 'speech bubble' / 'quote' detail, on the 'i', when scaling down the logotype.. )_\n\n"
    },
    {
      "time": "9 Jun 2005 — 9:05am",
      "content": "thanks\n\n"
    },
    {
      "time": "9 Jun 2005 — 11:12am",
      "content": "To start \"Creative Marketing\" or \"Creative Communications\" work better but are very vanilla. Can you say something stronger about your business? \"Complete Communications\" once again could be a book publisher.\n\nOn the new logos: the top left the dot looks like a printing registration mistake. I like the middle left logo without the extra letter spacing. The talk balloon is cute.\n\n"
    },
    {
      "time": "10 Jun 2005 — 1:21am",
      "content": "ok thanks -- we are thinking more about the copy.  \nthe general concensus is to develop the talk ballon one.\n\nthanks all\n\nmik\n\n"
    },
    {
      "time": "10 Jun 2005 — 7:40am",
      "content": "I like the talk balloon one as well. Also, 'creative marketing' isn't a very creative tagline.\n\n"
    },
    {
      "time": "11 Jun 2005 — 12:05pm",
      "content": "That talk balloon is really great. I agree with Dan: I like the middle left logo without the extra letter spacing.\n\n"
    },
    {
      "time": "16 Jun 2005 — 3:09am",
      "content": "thanks all.\n\n"
    }
  ]
}
