{
  "id": "12988",
  "title": "Quark Churns",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "So what do we make of the ouster of Quark’s CEO?\n\n[http://www.quark.com/about/presscenter/prview.jsp?idx=600](http://web.archive.org/web/20050826085201/http:/www.quark.com/about/presscenter/prview.jsp?idx=600)\n\n",
  "author": "speter",
  "time": "Thu, 2005-06-09 08:41",
  "uid": "2663",
  "comments": [
    {
      "time": " Thu, 2005-06-09 09:09",
      "content": "Doesn’t sound like a planned event, so that’s no good. Wasn’t Aulakh helping to lead Quark on its new mission to fight InD and change their image?\n\n"
    },
    {
      "time": " Thu, 2005-06-09 12:51",
      "content": "Quark is by now so far in the dung heap that hiring Superman as CEO couldn’t pull them out of the manure.\n\nChrisL\n\n"
    },
    {
      "time": " Fri, 2005-06-10 01:26",
      "content": "Couldn’t agree more, Quark has been resting far too long on it’s laurels earned years back when it had no competition.\n\nQuark 6.5 is a buggy piece of rubbish on Tiger and a change in CEO can do nothing to harm the company in my humble opinion.\n\n(That’s better, I needed to get that off my chest).\n\n"
    },
    {
      "time": " Fri, 2005-06-10 05:01",
      "content": "I’m hoping new management helps them solve their problems because the vision of an Adobe only software provider is frightening. We (as consumers) need Quark.\n\n"
    },
    {
      "time": " Fri, 2005-06-10 05:35",
      "content": "I haven’t “upgraded” since 4.3  \nFirst, because I didn’t need to, being quite happy with that version, and then later because Quark had major shortcomings — “running in Classic” and lack of OpenType support were no good — so I switched to InDesign a couple of years ago.\n\nHowever, I recently saw a demo of Quark 7, which will support OpenType, and it looked good, so I will definitely get it when it comes out “later this year”. As it was the first software I learned (1989, for goodness sake!) I have a soft spot for it.\n\n"
    },
    {
      "time": " Fri, 2005-06-10 07:33",
      "content": "_We (as consumers) need Quark._\n\nNo, we as consumers need more variety of good software companies. Quark isn’t one of them.\n\n"
    },
    {
      "time": " Fri, 2005-06-10 08:07",
      "content": "Competition in design and typography software is healthy and vital to consumers who need it to be well supported, updated with features we need, and reasonably priced for our typically meager means. I am sorry to see Macromedia absorbed and hope a new player has the guts to join the fray.  \nI used and championed Quark since version one (complete with parent/child boxes) and for years hoped they would pick up on the customer service thing. They refused and hence will die. I feel it is too late for anything with the Quark brand to succeed. Someone else will have to buy it, change the name and do it right to succeed in the Adobe only world. I do not fault Adobe, they have done a good job and should be applauded. I just feel that the lack of competition will take its toll and end up with less happy customers than now.\n\nChrisL\n\n"
    },
    {
      "time": " Sat, 2005-06-11 15:35",
      "content": "Hmmm;  \nI hope Adobe does not go the same way as QuarK.  \nI’ve downloaded a couple of CS2 tryout apps (golive & illy) today, and I was very, very disappointed.\n\n/Rant mode on/\n\nGolive is outdated IMHO, and tries to look like a pro web-authoring app but still is a kind of bloated wysiwyg web-editor. From a professional CSS-webdesigner point of view, it seems useless.  \nNVU is freeware and still in progress, but does a far better job.\n\nIllustrator seemed more like an 11.5 update than a 12. Agreed, the trace-tool is cool, and the control-palette is a fine idea, but there are still features missing. And the UI consistency between the CS apps is not much better either. Somebody has to tell those guys that UI goes beyond the fact that every palette has the same “ugly rounded cornered tab”.\n\nI couldn’t see Indesign CS2 yet, but it seems the updates there are more substancial.\n\nGuess I’ll keep my money ;-)\n\n/Rant Mode Off/\n\n"
    },
    {
      "time": " Sun, 2005-06-12 00:25",
      "content": "I’m of two minds about all this. On the one hand I really like the fact that InDesign is replacing Quark. I always hated XPress with a fervor and every time I have to touch it again I remember why… it’s one of the most anti-intuitive tools ever. I work with InDesign and hardly touch anything else anymore, it’s simply the best layout software available right now. So yeah, bye Quark, good riddance.\n\nOn the other hand, you don’t monopolize without a reason. You monopolize to cash in. We will see that a monolithic Adobe will do less and cost more, the creativity will go from developing software into how to squeeze as much money as you can out of your customers. This doesn’t HAVE to happen (Photoshop already is the singular pro-tool for editing print images, yet they still deliver new features with every version), but I’m sure it will tend towards that scenario.\n\nInDesign came out of the need to have something BETTER than Pagemaker to compete with Quark. Without the competition, there will be a lack of stimulus to come up with something «better». And we will all lose because of that.\n\nIn the long run, I reckon, small companies will make up for that, and OpenSource software might pop up doing a fine job of keeping the market on its toes, but you never know… there might not be an OpenOffice-pendant for Indesign. And Gimp, so far, is no Photoshop either.\n\nSo yeah, while a part of me is more than happy to see Quark go to its well-deserved rest at the elephant graveyard, another part of me is very very frightened about Adobe becoming the kings and queens of all they survey.\n\nHD Schellnack\n\n"
    },
    {
      "time": " Sun, 2005-06-12 03:14",
      "content": "Corel stopped making Mac upgrades for their Corel Draw and their version of Photoshop when they polled their clients and found that less than 1% were Mac users. So they aren’t likely to jump back into that market. Another hope is Apple, they seem to be getting back into the software application busniess, maybe they will see an opportunity.\n\n"
    },
    {
      "time": " Sun, 2005-06-12 04:23",
      "content": "The company I work for (I work in Reprographics) has just updated to Quark 6.5. The first and foremost reason is that they have literally thousands of existing Quark documents that are continuously being twaeked and reprinted. We experimented with opening the Quark docs in InDesign but too much changed on import to make it economical. Because we have a pure pdf workflow we were able to look at other options for what app to use. Quark was still the easiest transition for us and our work flow.\n\nHaving said that, I am disappointed with the performance of 6.5. Having upgraded from v5 (and hence working in Classic) I was expecting the OS X native version to fly. It doesn’t. It is however still a good layout and typesetting app which is what it is supposed to be.\n\nWhen dabbling with InDesign I find I cannot control the trapping as well as I can in Quark. For example InDesign has a preference for overprinting black and it is either ticked or not ticked. In Quark you control the trapping for each item in the Trapping palette which is exactly what I want to do. As a reprographic operater I want total contol over things like trapping settings. InDesign feels like half a design app and half a page layout app whereas I see Quark as a big cooking pot where you put all of your elements, lay them out and get them ready for the printers. I should really use InDesign a lot more for pure page layout and reprographics to give it a fair chance.\n\nQuark really need to get their act together though. Speed, stability and little niggling bugs all need to be weeded out. Half arsed attempts at putting features in that Photoshop will do, and has done much much better for a good few years now, is not what Quark needs. Similarly, Adobe need to address what the app (InDesign) IS. They ship the CS Suite with Illustartor, Photoshop and Acrobat. Is processing power, speed and fluidity being wasted on features in one app that are far superior in another app in the same suite?\n\nQuark may have left it too late. V7 needs to overcome a lot of hurdles, mainly to persuade people that have moved away from the app that they do actually care and listen to the people that buy and use the software and that the users of the app, and what it is used for, are the most important factors in its survival and not how many useless features can be packed in.\n\n"
    },
    {
      "time": " Sun, 2005-06-12 08:18",
      "content": "\\>InDesign has a preference for overprinting black and it is either ticked or not ticked. In Quark you control the trapping for each item in the Trapping palette which is exactly what I want to do.\n\nIn InDesign you can do this by the “attributes”-palette. It’s possible to include it into paragraph styles/character styles, and, in CS2, into object-styles as well.\n\n"
    },
    {
      "time": " Sun, 2005-06-12 08:53",
      "content": "Ahhh, that’s lovely. I was getting confused between the actual box colour and whether that had a fill and what trap settings were applied. Didn’t realise that I could then select the text and the attributes could then be re-set to accomodate. I could kick myself.\n\nAs I said, I have much more experience with Quark and really must start to seriously use ID so I can get around things like this. That preference with the always overprint black kind of threw me. What was happening was the overprint black box was ticked so no matter what I set the attributes to, I could never get the black text to knock out….\n\nAlso I have to spend more time on the Trap Styles as well. In Quark there is the single trapping dialog. You select the item, be it text, picture, filled box etc and simply select the trapping amount, overprint, knockout for each item. That’s my next task for gaining more experience in ID.\n\nThanks again Tina\n\n"
    },
    {
      "time": " Sun, 2005-06-12 10:08",
      "content": "I used to be a Quark-user for many years. About 1 and half year ago I switched over to InDesign, The way Quark act towards users and their “backwardness” rater than the oposite, together with the smooth transition with InDesign makes mew 100% sure I will never return. If Quark doesn’t do something really drastic (like lower their prize 80% or so) they will go out of business soon. By that I don’t say it’s a blessing having Adobe in control almost everywhere, but the crappy management which Quark show as a company in simply amazing and they will mostly have themselves to blame.\n\n"
    },
    {
      "time": " Mon, 2005-06-13 07:16",
      "content": "_Corel stopped making Mac upgrades for their Corel Draw_\n\nReally? Damn. I was thinking of making the switch when it came time for my next major upgrade.\n\nFYI, seeing as a few folks have mentioned some open source alternatives, I wrote up a mini article about that a while back when the Maradobe merger was announced:\n\n[http://www.underconsideration.com/speakup/archives/002282.html](http://web.archive.org/web/20050826085201/http:/www.underconsideration.com/speakup/archives/002282.html)\n\nWhile I didn’t mention it in the article, one of the commentors pointed out an open source page layout application, Scribus:\n\n[http://www.scribus.org.uk/index.php](http://web.archive.org/web/20050826085201/http:/www.scribus.org.uk/index.php)\n\n"
    },
    {
      "time": " Tue, 2005-06-14 10:40",
      "content": "[http://www.creativepro.com/story/news/23032.html?cprose=6-24](http://web.archive.org/web/20050826085201/http:/www.creativepro.com/story/news/23032.html?cprose=6-24)\n\nA couple of thoughts on what happened at Quark\n\n"
    }
  ]
}
