{
  "id": "12985",
  "title": "Worst use of Fette Fraktur ever",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I think I just found the worst use of [Fette Fraktur](http://web.archive.org/web/20101111140451/http:/typophile.com/wiki/Fette%2520Fraktur) ever.\n\n[http://ratzingerfanclub.com/](http://web.archive.org/web/20101111140451/http:/ratzingerfanclub.com/)\n\nThe webmasters must have been thinking, \"oh, oh, he's German!!!\"\n\nI can think of many Blackletters that could speak volumes about Pope Benedict XIV, either for or against (depending on type choice, layout, etc). This doen neither. Instead, it speaks volumes bout the general publics understanding of typographic history :(\n\n",
  "author": "<a href=\"/web/20101111140451/http://typophile.com/user/1085\" title=\"View user profile.\">dan_reynolds</a>",
  "time": "<br>",
  "uid": "1085",
  "comments": [
    {
      "time": "",
      "content": "I think the problem with many people in specialized fields is that they (we) often forget what its like to be a neophyte or a design civilian. You can't expect everyone to be on the same playing field. I think Fraktur is a nice face and it doesn't look that bad in the application.\n\nI think blackletter is a speciality of yours Dan...Could you name some better alternatives for those of us who aren't as knowledgable about the style? :)\n\n"
    },
    {
      "time": "",
      "content": "The Ratzinger fan club has some hilarious stuff on Café Press. I know someone who bought an RFC beer stein that said 'Putting the smackdown on heresy since 1982'.\n\n"
    },
    {
      "time": "",
      "content": "Blackletter isn't always blackletter… I like Fette Frakture. I just don't like it in this application, because I think that it is inappropriately spec'd. I would react the same way if something equally as wierd, like Hobo, would be on the screen.\n\nFette Fraktur is one of the best Romanticist frakturs. For Revolution of 1848 things, or for 19th Century-type Gemütlichkeit advertisements, it is great. There is a local museum in the next town over with the word \"Heimatmuseum\" painted across it in Fette Fraktur. Just perfect!\n\nThis site seems to be a legit fan club (if it was tounge-in-cheek, like [www.whitehouse.com](http://web.archive.org/web/20101111140451/http:/www.whitehouse.com/ \"www.whitehouse.com\"), then a real Nazi-like [Schaftsteiffelgrotesk](http://web.archive.org/web/20101111140451/http:/typophile.com/wiki/Schaftsteiffelgrotesk) like [Tannenberg](http://web.archive.org/web/20101111140451/http:/typophile.com/wiki/Tannenberg) would be appropriate). I would recommend something really Catholic and old-school. Like a [textura](http://web.archive.org/web/20101111140451/http:/typophile.com/wiki/textura).\n\nThese can be hard to come by in digital form. But [Karlgeorg Hoefer](http://web.archive.org/web/20101111140451/http:/typophile.com/wiki/Karlgeorg%2520Hoefer)'s Notre Dame is a start. Or maybe something Reformation/Counterreformation. Benedict the XIV strikes me as a real Counterreformation-type of guy, even though I've heard that he admires Martin Luther. Why not get the best of both typographic world and use a [Swabacher](http://web.archive.org/web/20101111140451/http:/typophile.com/wiki/Swabacher)? [Elsner + Flake](http://web.archive.org/web/20101111140451/http:/typophile.com/wiki/Elsner%2520%252B%2520Flake)'s Alte Schwabacher is good. Another good choice might be a real decorative Bavarian fraktur, something that would fit in on a beer label from one of the brewery's near Benedict XIV's home town. That might seem wierd, but it would have a lot more of a tangible connection that this!\n\nBlackletter can be so lyric (here is just one [example](http://web.archive.org/web/20101111140451/http:/www.typeoff.de/?p=27), which I happend to photgraph today). Fette Fraktur is a great old jobbing face. But it has nothing to do with Benedict XIV, the Catholic Church, or this funny website.  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20101111140451/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "",
      "content": "John, my father sent me this via e-mail today:\n\n_I ran across this web page during the sede vacante._\n\nIf you are willing to overlook the fact that Ratzinger is against free speech, he's a great guy.\n\nI look forward to the day when he either retires or dies. Either way, I doubt that he will return to Bavaria.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20101111140451/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "",
      "content": "Dan, I think you should be beside yourself  \nwith relief that they didn't use Comic Sans.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "test\n\n"
    },
    {
      "time": "",
      "content": "Being that his new home is Rome, you'd think they'd use something more... Roman. =)\n\n"
    },
    {
      "time": "",
      "content": "_If you are willing to overlook the fact that Ratzinger is against free speech, he’s a great guy._\n\nI don't think he is against free speech. In his role as prefect of the Congregation, he insisted that people teaching _in Catholic institutions_ should agree not to teach anything contrary to Church doctrine. That doesn't seem to me an unreasonable requirement, and people not willing to accept that requirement left and went to teach at non-Catholic institutions. They continue to publish and to teach, just not in Catholic colleges.\n\nDuring the twenty-two years that Ratzinger headed the Congregation, only one theologian, Tissa Balasuriya, was excommunicated: for misrepresenting the doctrine of original sin and casting doubts on the divinity of Christ. If one doesn't accept such basic Christian beliefs, it seems to me one effectively excommunicates oneself _latae sententiae._ The excommunication was rescinded only a year later, after discussions in which Balasuriya clarified his opinions to the satisfaction of the Holy See. Ironically, given the charge that Ratzinger is opposed to free speech, the most important thing that came out of the whole Balasuriya episode, were new norms of investigation by the Congregation _aimed at safeguarding the rights of theologians accused of unorthodox opinions._\n\nThe only other excommunications during Ratzinger's time at the Congregation were of seven women who were illicitly ordained by a schismatic priest, himself illicitly declared a 'bishop' by a schismatic sect.\n\n"
    },
    {
      "time": "",
      "content": "\\> for misrepresenting the doctrine of original sin  \n\\> and casting doubts on the divinity of Christ.\n\nStill, Balasuriya seems a \"saint\" compared to this [commendably sincere] fellow:  \n [http://news.bbc.co.uk/1/hi/world/europe/3795411.stm](http://web.archive.org/web/20101111140451/http:/news.bbc.co.uk/1/hi/world/europe/3795411.stm \"http://news.bbc.co.uk/1/hi/world/europe/3795411.stm\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I'm often amazed at how people want to push notions of 'free speech' onto private organizations like churches, the 4H Club, the Boy Scouts, et cetera. Ironically, people pushing that agenda are treading on the free speech of the very organizations they claim to want to improve. Corporations and public (governmental) institutions are one thing, but private organizations (clubs, private schools, churches, newspapers) are quite another.\n\nWhy should you or anybody else have to apologize for a religious leader calling their followers to follow (and removing from their positions of authority those who will not)? The notion of a God-run organization (as the Catholic church purports to be) answering to the will of the people is strange at best and heretical at worst.\n\nIf you disagree with Catholicism or any other organization, club or institution, go get enlightened and create your own. (Speaking highly simplistically of course.)\n\n"
    },
    {
      "time": "",
      "content": "_the Boy Scouts_\n\nI'm an Eagle Scout, and I worked for the Boy Scouts of America locally for a brief time. During that time, a regional manager gave us the \"official speech\" regarding homosexuality. Until that point, I had always argued (vehemently), that as a private organization, the Boy Scouts of America had a right (upheld by the US Supreme Ciurt on multiple occasions) to choose its own memebership policiies. After I discovered what the people who ran the organization were really like, I lost a lot of my resepect. Basically, he told us (after making some insulting remarks not just about homosexuals, but also about journalists, democrats, and Americans in general) that the organization could not admit gay leaders because one church had threatend the organization with cutting off all funds should they change their policy. I won't name this church, but it was at the time the biggest ecclesiastic financial supporter of the organization, and had told the Scouts that it would even form a _counter_ movement, should the organizers get out of line.\n\nThat was not moral values (on behalf of the Scouts, I mean… on the church's part, maybe). Money was more important to them than holding on to a belief or making a stand. I would have had more respect for them if the talk had been something like, \"we think this is wrong. period.\" But that was not the case.\n\n_If you disagree with Catholicism or any other organization, club or institution, go get enlightened and create your own. (Speaking highly simplistically of course.)_\n\nBut the Catholic Church has a long history of being reformed from within. It has been a cycle for over a millenium. Of course one has to hold on to a certain set of beliefs to be a Catholic. But there are certain traditions within the Church that are not doctrinal. That Jesus is divine, the resurrection, etc, that IS Doctrine. The Immaculate Conception and Mary's Assumption into Heaven, even the Papal infallability that made these beliefs dogmatic, those are Doctrine, too. How the Church will live in the modern world is not a dogmatic decision to be made, but rather a question of dialogue, love, charity, and relationships (with God, and with each other).\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20101111140451/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "",
      "content": "I like the use of Fette on that site.  \nAnd really I don't agree with the worst use/best use co-ordinate for typography. Choosing the 'right type for the job' is highly personal and depends upon what type is at your disposal.\n\nnewlyn.com\n\n"
    },
    {
      "time": "",
      "content": "[http://www.cafepress.com/ratzfanclub.12586147](http://web.archive.org/web/20101111140451/http:/www.cafepress.com/ratzfanclub.12586147 \"http://www.cafepress.com/ratzfanclub.12586147\")  \nYou really wouldn't expect this badge to have a reflection would you?  \nTim\n\n"
    },
    {
      "time": "",
      "content": "The Church is in the late stages of her 500-year cultural struggle with protestantism, which is now primarily a struggle with the highly sucessful materialist and effectively atheist societies that protestantism has produced. As you say, Dan, the Church has a long history of reform from within, but the sign of that reform has always been that the Church cleaves _more faithfully_ to its perrenial teachings, i.e. that it to some degree withdraws from its engagement with the world and the values of the world, and reaffirms its distinctiveness from the world. As Christ said to his apostles: 'You are in the world but you do not belong to the world'. This is what the Church is called to be: in the world but not of the world. So the question 'how will the Church live in the modern world?', cannot be framed in terms of the values of the world -- which are in any case inconstant and largely deterministic --, because as soon as you frame it that way you have already surrendered and given up on your vocation. These things that you list: dialogue, love, charity\\*, and relationships are exactly right, because they are part of that vocation, and also because, genuinely pursued, they are counter to the simultaneously sentimental and cynical values of our society, which treat dialogue, love, charity, and relationships as either 'warm feelings' of license or as means to power and possession.\n\n\\* Charity, of course, _is love;_ specifically, Christian love, as distinct from eros and also from agape. The principle quality of charity that distinguishes it from other forms of love is freedom. There is a deterministic element to both eros and agape, in that each is preceded by a bond (of attraction or of family).\n\n"
    },
    {
      "time": "",
      "content": "How did the Inquisition figure into this concept of Christian love?\n\n"
    },
    {
      "time": "",
      "content": "<cite> Instead, it speaks volumes bout the general publics understanding of typographic history :(</cite>\n\nDan and everyone:  \nWhat do you think the general public's understanding of typographic history should be?\n\n"
    },
    {
      "time": "",
      "content": "I would be happy if people understood that different fonts represent different historical periods, and are often influenced by specific national cultures or traditions.\n\nAlso, just as no one font = American, one font cannot equal French, German, Chinese, or even Armenian.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20101111140451/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "",
      "content": "\\>How did the Inquisition figure into this concept of Christian love?\n\nLike all earthly powers, organized religion maintains its rule by doublethink, saying one thing and doing the opposite. Blessed are the peacemakers, indeed, but don't expect the Pope to tell those \"Christian\" warmakers Blair and Bush to pull their armies out of Iraq.\n\nThe church is conveniently, selectively \"not of this world\" on certain issues, splitting power over human affairs with secular governments. Two sides of the coin.\n\n"
    },
    {
      "time": "",
      "content": "\\>the highly sucessful materialist and effectively atheist societies  \nthat protestantism has produced.\n\nI am an outsider to this debate, but I really don't see that  \nhistorically Prostestantism has had much to do with creating atheism.  \nI would have thought that had much more to do with the rise of modern  \nscience, with the positivism that treated science as a surrogate  \nreligion, and with Darwinism, which made it conceivable that humanity  \nis an accident. Weren't Voltaire etc originally Catholic? Wasn't  \nCompte, the founder of positivism?\n\nI agree with Weber etc that Protestantism had an important part in  \ncreating capitalism, but I don't see the atheism bit at all. Why do  \nyou think this?\n\n"
    },
    {
      "time": "",
      "content": "_don’t expect the Pope to tell those “Christian” warmakers Blair and Bush to pull their armies out of Iraq._\n\nI'm not sure how John Paul II could have been more anti-Iraq war than he was… and he certainly told Bush and Blair how he felt about it. And anyone who would listen.  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20101111140451/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "",
      "content": "<cite>And anyone who would listen.</cite>\n\nSo sad that the ones in charge are the ones who wouldn't listen!\n\n"
    },
    {
      "time": "",
      "content": "Well, that is very sad. It was quite intersting how poltical leaders from all over the world—most of which never took a bit of the Pope's advice—flocked to his funeral.\n\nAt the funeral, strange types came together. The presidents of Israel and Iran greeted each other, and I think they even kissed cheeks. Where else does that kind of coordiallity take place? Certainly not at the UN (where it really belongs…).\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20101111140451/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "",
      "content": "_don’t expect the Pope to tell those “Christian” warmakers Blair and Bush to pull their armies out of Iraq._\n\nDid you actually pay any attention at all to Pope John Paul's pronouncements against the war in Iraq, which began long before the invasion started and continued as it proceeded. If you are wondering about the opinion of the new pope, that too was well known and voiced long before he was elected: [http://www.comunione-liberazione.org/articoli/eng/1/nowar.html](http://web.archive.org/web/20101111140451/http:/www.comunione-liberazione.org/articoli/eng/1/nowar.html \"http://www.comunione-liberazione.org/articoli/eng/1/nowar.html\")\n\n"
    },
    {
      "time": "",
      "content": "\\>Did you actually pay any attention at all to Pope John Paul’s pronouncements against the war in Iraq\n\nIt's true that he was initially against the war, but my understanding is that the Vatican's position is now that the US should stay in Iraq to help preserve stability or whatever. Many people in the west have the view that, hey, it was a mistake, but we're in there so me might as well stay. I would be pleasantly surprised if the new Pope began a vociferous campaign to urge Bush and Blair to withdraw their armies.\n\n"
    },
    {
      "time": "",
      "content": "Monotheism was the first big step towards atheism. And sans serif design.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_my understanding is that the Vatican’s position is now that the US should stay in Iraq to help preserve stability or whatever_\n\nI understood it more along the lines of: now you've created this mess, don't just walk away from it like you walked away from Afghanistan.\n\nIt seems to me very difficult to say what might be the best option for Iraq at this stage. If the US and British pulled out right now, civil war between the Shia and Sunni seems very likely. That would probably encourage the Kurds to declare an independent state in the north, which would alarm the Turks, and the whole situation could get very, very much worse than it is now. Trying to create a stable multi-ethnic and multi-religious state in Iraq probably strikes most people as a better option, regardless of their opposition to the invasion.\n\n"
    },
    {
      "time": "",
      "content": "\\>Trying to create a stable multi-ethnic and multi-religious state in Iraq probably strikes most people as a better option, regardless of their opposition to the invasion.\n\nNowhere should be occupied by a foreign army.  \nSurely \"most people\" in Iraq would consider the better option to be for the occupying forces to leave, so that they can sort things out for themselves.\n\n"
    },
    {
      "time": "",
      "content": "_and the whole situation could get very, very much worse than it is now._\n\ndoesn't the bible predict that these kinds of things will happen in the end times?\n\n"
    },
    {
      "time": "",
      "content": "And our Steve Peter has pointed out that the White House is currently populated heavily by people who believe that prophesy quite literally. \"Let's get it all over with so we get to Heaven already...\" It is people like that who cause my personal opposition to the death penalty to waver.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant\n\nI suspect the Skull and Bones thing or Century Club or whatever the hell that secret society is that Bush belongs to isn't concerned so much with the biblical prophesy as much as it is with the sort of nationalistic translation that puts American as the center of Christian hope. The \"last great hope,\" but a bit twisted in this contemporary version. So it's not a matter of let's get it over so much as let's get them before they get us. The rationale is that the US is on the decline (and will be usurped) and so take as much as we can get while we can get it. Consequently, the implemented Bush Doctrine allows for first strike, which was previously not US policy. Basically, yeah, likely, if we are unfortunate, we will bring about the end of times. Note: my use of we or us had nothing to do with my own thinking in this regard. I'd rather we all just peaceably wait a couple of million years and let the Sun democratically just boil it all away, Fette Fraktur included.\n\nGerald\n\n"
    },
    {
      "time": "",
      "content": "_doesn’t the bible predict that these kinds of things will happen in the end times?_\n\nWar and rumour of war? Yes, but then there has never been a time in many, many millennia when human beings somewhere on this planet were not engaged in war. It is a perrenial state of human affairs. So war isn't a very reliable indicator of coming end times.\n\nMore importantly, Christ urges us not to try to guess when the end will come, but instead to be always ready for 'the thief in the night'. I don't think the revelation, or Apocalypse, recorded by St John on Patmos is given so that we can read it like so many entrails to guess what will happen when. Rather, it is an image of the final judgement against which we can judge ourselves _now,_ and a promise of the renewed creation.\n\nIdeas about the end time are one of the largest areas of disagreement between Catholicism/Orthodoxy and fundamentalist protestantism of the kind believed by many members of the Bush administration. The whole notion of 'the rapture' -- the taking up of the elect before the tribulation --, which is central to the fundamentalist hope for the Apocalypse, has never been a part of orthodox Christian teaching: it is the invention of late 18th and early 19th century American 'dispensationalist' ministers, most widely popularised by John Darby, founder of the Plymouth Bretheren. The word 'rapture' does not occur anywhere in the Bible: it is an English corruption from the Latin _simul rapiemur_ (shall be caught up together) from 1 Thess 4:15-17. Ironically, in this very passage St Paul makes it clear that he is referring to what happens to the just who are still alive at the time of the resurrection of the dead at the Second Coming. There is no way that the fundamentalist fantasy of the rapture can be derived from this passage.\n\n"
    }
  ]
}
