{
  "id": "12995",
  "title": "looking for clue on kerouac/underwood typeface",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "my friend wants a tatoo featuring a kerouac quote, im searching for either :\n\na photograph of the original manuscript\n\nsomeone with a underwood typewriter, the same type as kerouac’s ofcourse.\n\nsomeone with knowledge of what typeface underwood use/d for their typewriter.\n\nor knowledge on what digital and commercially available typefaces are the best alternatives.\n\nhope someone out there can help,\n\nthanks in advance\n\nchristian zander  \ncopenhagen\n\n",
  "author": "<a href=\"user/7769\" title=\"View user profile.\">zandercph</a>",
  "time": "<br>",
  "uid": "7769",
  "comments": [
    {
      "time": " 9 June, 2005 - 2:54pm",
      "content": "[Maybe this](http://web.archive.org/web/20060409220350/http:/www.myfonts.com/fonts/ihof/p22-typewriter/)\n\n"
    },
    {
      "time": " 9 June, 2005 - 3:26pm",
      "content": "I have an Underwood typewriter, but a much earlier model than the portable used by Kerouac. Do you know precisely what model Kerouac used?\n\nThe model I have is the [No.5](http://web.archive.org/web/20060409220350/http:/www.typewritermuseum.org/collection/brands/index.php3?machine=underwood5&cat=kf), but without the tab set keys at the front shown in the Virtual Typewriter Museum photos.\n\n"
    },
    {
      "time": " 9 June, 2005 - 8:25pm",
      "content": "Christian\n\nThe orginal ms “scroll” for On the Road is currently on tour. Heard about it on MPR a while back. Apparently a dog ate the end of it. There is probably a photo or two that can be obtained via Google.\n\nGerald\n\n"
    },
    {
      "time": " 10 June, 2005 - 9:22am",
      "content": "[Here’s a scan](http://web.archive.org/web/20060409220350/http:/www.flickr.com/photo_zoom.gne?id=18538754&size=l) of Monotype’s printing face based on the Underwood Typewriter design. You can use this for reference in choosing [a Typewriter font](http://web.archive.org/web/20060409220350/http:/www.myfonts.com/search?search%5Btext%5D=typewriter), many of which have been digitized. It looks like Bulletin Typewriter may be a good match? Or perhaps Typewriter Elite…\n\n"
    },
    {
      "time": " 10 June, 2005 - 12:23pm",
      "content": "Bulletin is actually an old metal face cast by BB&S. Designed in large sizes (18pt, 24pt) in 1925. And then in 36pt in 1933. I have all the sizes in several cases. It was quite a nice looking typewriter face. A bit absurd to have a typewriter face in such large sizes but it fit a niche (display) and sold well in its time. It was cast as a monospaced font and required special spacing. I printed a large broadside “chain letter” in it once. Quite fun. The page form weighed 70 pounds!!!\n\nAs an aside, but alluding to your remark about Kerouac and tattoos, and perhaps indicative of our changed times: as sceptical and suspicious of authority (or the powers that be) as the beats and hipsters were, I suspect they would have avoided permanent identificational markings.\n\nGerald\n\n"
    },
    {
      "time": " 10 June, 2005 - 11:28pm",
      "content": "[Vintage Type](http://web.archive.org/web/20060409220350/http:/vintagetype.com/) sells typewriter fonts and I think the founder Susan Townsend knows quite a bit about typewriters.\n\n"
    }
  ]
}
