{
  "id": "12999",
  "title": "V.2 / Book for confirmed interview !",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey everybody, I went the simple route with this. Got good advice from Armin on my previous post. Just want to see if anyone had a suggestion or two. It’s not done. Interview is Wednesday, want to get early just to make sure nothings screwy.\n\nMy main concern right now is page 11 of the pdf. Dont know how thats working. I dont have the original files, all I have is pics, and the book. Also, I know you’re only supposed to put 10-12 of your best pieces in your book. I’m presenting in letter format, and I have at least 2 projects ( books ) with more than 1 spread each, and thats pushing my page count up.\n\nPages 3-10. any ideas on how to narrow this down?\n\nThanks\n\nEric\n\n| Attachment | Size |\n| --- | --- |\n| [newformat.pdf](http://web.archive.org/system/files?file=newformat.pdf) | 318.93 KB |\n\n",
  "author": "Eric_West",
  "time": "9 June, 2005 - 5:26pm",
  "uid": "6194",
  "comments": [
    {
      "time": " 9 June, 2005 - 6:01pm",
      "content": "Eric the work tags in the bottom of the page are too shy from my point of view.\n\nFor narrowing the spread of pages in your publication (and to put some action on the page) you could use a vertical or diagonal grid composed of only one tile and various colums.\n\nHéctor\n\n"
    },
    {
      "time": " 9 June, 2005 - 6:15pm",
      "content": "Hector,  \ncould you elaborate on …\n\n” you could use a vertical or diagonal grid composed of only one tile and various colums.”\n\nThanks\n\n"
    },
    {
      "time": " 11 June, 2005 - 9:14pm",
      "content": "I made an example of what I meant, but how do you upload images? I’ll open a new topic to show it.\n\nBy the way, I liked very much your printed work.\n\nHéctor\n\nP.D. The topic is called Gif Sample on this same Design Forums.\n\n"
    },
    {
      "time": " 11 June, 2005 - 11:19pm",
      "content": "Héctor,\n\nReplaced previously posted pdf. Have only 2 partial samples, but I think I’m getting closer…See updated file and let me know what you think\n\nEric\n\n"
    },
    {
      "time": " 12 June, 2005 - 10:13am",
      "content": "I think that this way your work will be more economically and more interestingly displayed, maybe the stroke of the grid could be less strong. I think it would be ok to have at least a single plain view of each work, so the viewer can have some orientation about what he is seeing in the grid.\n\nFrom your previous sample I liked the clean layout and I think that now the tag is too big, a bit noisy. Maybe the upper right clear space is fine to fit the tag in.\n\nHéctor\n\n"
    },
    {
      "time": " 12 June, 2005 - 10:30am",
      "content": "Sorry,\n\nthe grid lines are just placeholders, those are just picture boxes that I havn’t filled yet.\n\nEric\n\n"
    }
  ]
}
