{
  "id": "13000",
  "title": "current status of Rick Tharp",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A friend just mentioned that he had heard Rick Tharp passed away today - is this true? Can anyone confirm? I hope it’s not true.\n\n [‹ Extension for Constructa](http://web.archive.org/web/20080608221021/http:/typophile.com/node/13999 \"Go to previous forum topic\") [Gerrit Noordzij's books ›](http://web.archive.org/web/20080608221021/http:/typophile.com/node/13875 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080608221021/http://typophile.com/user/1706\" title=\"View user profile.\">jlt</a>",
  "time": "<br>",
  "uid": "1706",
  "comments": [
    {
      "time": " 9.Jun.2005 9.16pm",
      "content": "More reports trickle in. Apparently Rick took his own life earlier today. He had suffered from almost crippling tinnitus for years and apparently was unable to take it any longer. I keep hoping this is some kind of sick joke but three people have confirmed this so I guess it’s true.\n\n"
    },
    {
      "time": " 12.Jun.2005 9.56pm",
      "content": "jlt, sadly these reports are true, I knew Rick since I was barely able to walk. He was one of my dad’s best friends, and in the last few months my father (Thom Marchionna) had been helping Rick out in trying to help him with work and his personal issues. Rick was one of those guys who I looked up to as a kid and still do, he was and still is the funniest and smartest men I’ve ever had the honor of knowing.\n\nRick had been fighting depression due to his health, and while I know the details of what happened I feel it inappropriate to mention them here.\n\nHowever please contact me at [isaac@lawndartdesign.com](mailto:isaac@lawndartdesign.com). I feel it important that his friends honor Rick as the amazingly talented, smart, and funny man he was, rather then what his illness had made him become. A great human being I hope wherever he his he’s at peace.\n\n"
    },
    {
      "time": " 13.Jun.2005 10.03am",
      "content": "Who’s Rick Tharp?\n\n"
    },
    {
      "time": " 13.Jun.2005 10.49am",
      "content": "[http://www.tharpdidit.com/](http://web.archive.org/web/20080608221021/http:/www.tharpdidit.com/ \"http://www.tharpdidit.com/\")\n\nSi\n\n"
    },
    {
      "time": " 13.Jun.2005 12.01pm",
      "content": "Very unfortunate news. Mr. Tharp’s design work always appeared, to me, to be coming from the heart of a maverick.\n\n"
    },
    {
      "time": " 14.Jun.2005 11.26am",
      "content": "A gentle correction: Rick is officially missing. That’s what’s really known at this time. A San Jose police detective is working on the case. People can go to [www.wadc.org](http://web.archive.org/web/20080608221021/http:/www.wadc.org/ \"www.wadc.org\") for information - the Western Art Directors Club has a page that will be updated as information comes in. And you can sign up to be kept informed or to participate in events as appropriate. It’s hard as hell to wait, but that’s where we are with things right now.\n\n"
    },
    {
      "time": " 14.Jun.2005 2.13pm",
      "content": "I will hope for the best then. I hope the rumors of his death were nothing more than rumors, and I am sorry I helped propagate them.\n\n"
    },
    {
      "time": " 14.Jun.2005 4.31pm",
      "content": "Rick was a great friend. I have known him since our 2nd year at Miami University in 1971. We shared a house in our last year there. When I went to Australia in 1975 his was one the hardest goodbyes I had to make. He was smart, witty and extremely fun to be around. I have spent most of the years inbetween in Australia so haven’t seen a lot of him since then. We kept in touch and I followed his career in what ever way I could. Those of you who know him will agree that he was a brilliant graphic designer. Not just in an artistic sense, but also in the wit and fun he incorporated in all his work. I miss him enormously. Yes he was a great human being. I too hope that he is at peace.\n\n"
    },
    {
      "time": " 15.Jun.2005 8.17pm",
      "content": "The Silicon Valley Metro newspaper “Why are we so afraid of our food” issue ran an article about Rick Tharp on pg.6 last week.  \nthere is a download at  \n [http://www.metropdf.com/mt.html](http://web.archive.org/web/20080608221021/http:/www.metropdf.com/mt.html \"http://www.metropdf.com/mt.html\")\n\n"
    },
    {
      "time": " 16.Jun.2005 1.00pm",
      "content": "The Los Gatos community newspaper ran an article yesterday, and the SF Chron had an article the day before that. Both contained what I believe are inaccuracies regarding his disappearance, but confirmed Rick’s popularity, renown and dedication to his work and ideals. He is missing, and the loss weighs heavily indeed for many, many people.\n\nAgain, I think the best place to check for information is [http://www.wadc.org](http://web.archive.org/web/20080608221021/http:/www.wadc.org/ \"http://www.wadc.org\")\n\n"
    },
    {
      "time": " 10.Jul.2005 2.27pm",
      "content": "I remembered seeing this thread a few weeks ago and wanted to make you all aware of an article I wrote about Mr. Tharp. My thanks to Ken (writerguy) for his contributions to the piece. The article was posted on [Creative Latitude](http://web.archive.org/web/20080608221021/http:/www.creativelatitude.com/) this past week.\n\n- J.\n\nJeff Fisher :: Engineer of Creative Identity  \n [Jeff Fisher LogoMotives](http://web.archive.org/web/20080608221021/http:/tinyurl.com/5y8bm)\n\nAuthor: [Savvy Designer’s Guide to Success](http://web.archive.org/web/20080608221021/http:/tinyurl.com/5o7ud) from HOW Design Books\n\n"
    },
    {
      "time": " 20.Jul.2005 6.51am",
      "content": "Mr. Tharp’s body has been found and identified. Here’s the latest from the San Francisco Chronicle this morning:\n\n[http://sfgate.com/cgi-bin/article.cgi?f=/c/a/2005/07/20/BAGV0DQLB51.DTL](http://web.archive.org/web/20080608221021/http:/sfgate.com/cgi-bin/article.cgi?f=/c/a/2005/07/20/BAGV0DQLB51.DTL \"http://sfgate.com/cgi-bin/article.cgi?f=/c/a/2005/07/20/BAGV0DQLB51.DTL\")\n\n- J.\n\nJeff Fisher :: Engineer of Creative Identity  \n [Jeff Fisher LogoMotives](http://web.archive.org/web/20080608221021/http:/tinyurl.com/5y8bm)\n\nAuthor: [Savvy Designer’s Guide to Success](http://web.archive.org/web/20080608221021/http:/tinyurl.com/5o7ud) from HOW Design Books\n\n"
    },
    {
      "time": " 20.Jul.2005 11.42am",
      "content": "This is so sad. We will miss you, Mr. Tharp.\n\n"
    },
    {
      "time": " 20.Jul.2005 12.35pm",
      "content": "Rick Tharp’s Body Found  \nPositive identification was made last night July 18th after the Contra Costa Coroner’s office finished dental DNA testing.  \nRicks body was found July 7th. Family members were not contacted until the news article came out in the Contra Costa times on July 15th and was spotted by a friend, who kindly called. Rick Tharp’s request to be cremated can now be carried out.  \nThe Article in the Contra Costa News reads:  \nCoroner’s deputies are asking for the public’s help in identifying a body found floating in the San Francisco Bay.  \nThe Yerba Buena Coast Guard recovered the body of a man south of the Richmond-San Rafael Bridge, west of the Richmond Shoreline near Red Rock on July 7, according to a press release.  \nThe remains were turned over to the Contra Costa Coroner’s Office at the Richmond Marina.  \nAn autopsy determined the man died of multiple blunt force trauma consistent with a fall from a bridge or other high structure, the coroner’s office said.  \nThe coroner believes the body was in the water for about a month, making fingerprint identification impossible. Dental and DNA results are pending.  \nThe victim was described as white or Latino and approximately 5-feet-8-inches tall. He was wearing Calvin Klein briefs with white-trim and black-and-gray Nike gym shoes without socks.  \nOther Information:  \nDesignated contributions to the Rick Tharp Scholarship Fund can be made to: “Western Art Directors Club Rick Tharp’s Scholarship Fund” P.O. Box 996  \nPalo Alto, CA 94302  \nInformation provided by: Lourdes Pollard Founder/President [www.phoenixdatacenter.org](http://web.archive.org/web/20080608221021/http:/www.phoenixdatacenter.org/ \"www.phoenixdatacenter.org\")\n\n"
    }
  ]
}
