{
  "id": "1301",
  "title": "Trinary",
  "forum": "Bitmap Display / Script",
  "tags": [
    "Bitmap Display / Script"
  ],
  "content": "Ok, I have to post this quickly, as the men in the nice white coats are coming to take me away to the nuthouse. I'm guessing this font will get me some funny looks and raised eyebrows at the next Typophile get-together.   \n   \n ![trinary](http://web.archive.org/web/20150317125105im_/http:/www.typophile.com/forums/messages/29/16269.gif)\n\n",
  "author": "Jared Benson",
  "time": "16 Sep 2003 — 8:24pm",
  "uid": "3",
  "comments": [
    {
      "time": "16 Sep 2003 — 9:01pm",
      "content": "how did u translate exclamation points and periods and other punctuation?\n\n"
    },
    {
      "time": "17 Sep 2003 — 10:37am",
      "content": "Don't forget the upright italics.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Oct 2003 — 12:37pm",
      "content": "its gonna be _pretty hard_ to make an italic version for one pixel..\n\n"
    },
    {
      "time": "2 Oct 2003 — 12:43pm",
      "content": "but im not saying its impossible, just work hard on it ![:-)](http://web.archive.org/web/20150317125105im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "30 Nov 2003 — 1:22am",
      "content": "What you need is a one-pixel sep between characters to make your 3-value clumps evident. Nice as the wavy line is, it becomes WinAmp-irrelevant in quantity, even the (extra-clever) bold version. Do you have a version including letter AND graph in one glyph? cause that would be crazy valuable, white coats be darned.   \n   \nalso, to paraphrase TW, Unibody is dopetastic.   \nI do NOT recommend an italic because for pixel characters this requires an overlap of approx. 1 px which would further wipe out the graph fidelity. But hey, it's your brain.   \n   \n'spect,   \n-chris\n\n"
    },
    {
      "time": "7 Sep 2004 — 10:52am",
      "content": "Hrant and his uphill-upright italics battle.   \nI think this is a great idea, and i like that the bars look like eualizer bars, connecting the concept of letters as visual references to sounds.   \n   \nGood work\n\n"
    },
    {
      "time": "16 Sep 2003 — 9:34pm",
      "content": "Right now all punctuation is represented by a simple dot. I'll most likely adjust this as soon as I have an idea to support it. Mostly just wanted to get this base set out as a proof-of-concept.   \n   \njb\n\n"
    },
    {
      "time": "17 Sep 2003 — 10:34am",
      "content": "Can't forget this.   \n   \n ![trinary-bold](http://web.archive.org/web/20150317125105im_/http:/www.typophile.com/forums/messages/29/16286.gif)\n\n"
    },
    {
      "time": "2 Oct 2003 — 2:05pm",
      "content": "It seems a good example of an upright italic bitmap would be that of Underware's [unibody](http://web.archive.org/web/20150317125105/http:/www.underware.nl/site2/index.php3?id1=unibody&id2=overview). But maybe that isn't what you need. :^\\\n\n"
    },
    {
      "time": "16 Sep 2003 — 8:46pm",
      "content": "Codes is cool.   \n   \nReminds me of something the NoFont guy once did. Even though (because?) he still owes me a t-shirt.   \n   \nhhp\n\n"
    }
  ]
}
