{
  "id": "13032",
  "title": "TypeCon2005: Who? When? What?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Alright! Now the site is live and registration\\* available, let’s starting a running list of who’s going, when they are arriving/leaving, and what you hope to do/eat/see in the big apple!\n\nWho: Me, myself and I, aka Miss Tiffany, Tiff, Tif, and to close friends and family, T.\n\nWhen: I’m hitting the east coast the Friday before it all starts to hang out with an old friend and will arrive at the official conference hotel, [The Roosevelt Hotel](http://web.archive.org/web/20081011015851/http:/www.theroosevelthotel.com/) late Sunday night or Monday morning. I’ll be leaving, thoroughly satiated and happy, the following Monday.\n\nWhat: I really hope to visit: [The Chisholm Poster Gallery](http://web.archive.org/web/20081011015851/http:/www.chisholm-poster.com/) — [The Metropolitan Museum of Art](http://web.archive.org/web/20081011015851/http:/www.metmuseum.org/) to see two of my favorite paintings by Pierre-Auguste Cot - The Storm and Springtime. But I can’t say no to the Lehman collection or anything from the PreRaphaelite era or the Dutch, hmm, or Kandinsky, or Caravaggio. Yikes. — [MoMA](http://web.archive.org/web/20081011015851/http:/www.moma.org/) to see the new changes in architecture. — But most of all, to see my friends at the conference whom are all just my type.\n\n\\* The only browser experience problems at this time is Internet Explorer and only on a PC. However, these people can see some of the content on the site and can still register and see most of the content if they skip directly to [http://www.sotalink.com/register.html](http://web.archive.org/web/20081011015851/http:/www.sotalink.com/register.html \"http://www.sotalink.com/register.html\") — We are aware of the problem and are working toward a solution.\n\n [‹ strange and unusual ligatures](http://web.archive.org/web/20081011015851/http:/typophile.com/node/13966 \"Go to previous forum topic\") [i need help identifying that type.... ›](http://web.archive.org/web/20081011015851/http:/typophile.com/node/13967 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081011015851/http://typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": "<br>",
  "uid": "108",
  "comments": [
    {
      "time": " 11.Jun.2005 10.54am",
      "content": "I (Chris Lozos; Chris) hope to arrive Tuesday night at the Roosevelt and leave Sunday night. I would like to see MoMA as well but plan to spend most of my time at the conference. I hope to put faces to names for once. Since this will be my first TypeCon, I don’t quite know what to expect but I have signed up for all the conference events and the 2 FontLab sessions on Wednesday.\n\nChrisL\n\n"
    },
    {
      "time": " 11.Jun.2005 11.24am",
      "content": "I will be attending my first-ever TypeCon. I will be in the Roosevelt hotel, arriving Tuesday, departing Sunday. I look forward to meeting you all there!\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20081011015851/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 11.Jun.2005 11.26am",
      "content": "When: Jamie and I arrive Thursday, July 14 after a red-eye. So we really won’t be conscious until Friday. We hang out with my friends [Norm](http://web.archive.org/web/20081011015851/http:/flickr.com/photos/norman/) and Priya for a couple days and help set up the FiFFteen Exhibit at the FIT. Saturday, we settle in at the Roosevelt for a week of fontfreaking. We leave Sunday, July 24.\n\n"
    },
    {
      "time": " 11.Jun.2005 2.29pm",
      "content": "I’ll also get into town Thursday, July 14, after the joy that is red-eye travel. Heading to the gala opening of the TDC winners exhibition at the Cooper Union that night (the early kick-off to Type Week in New York). Staying at the Roosevelt with lots of other typeheads. Departing early Tuesday, July 26. I won’t be doing much sightseeing or hitting the museums this time around, as TypeCon and FiFFteen activities will keep me way busy, but I’ll have a great time seeing my type friends.\n\n"
    },
    {
      "time": " 11.Jun.2005 5.07pm",
      "content": "I, JLT, will arrive on Thursday AM once the meeting is already moving and will leave on Sunday evening. Wife & I are staying at the Roosevelt, and look forward to much sushi, and the usual Saturday or Sunday brunch at Florent. Anyone interested in a trip to my favorite breakfast place (and a sort of pilgrimage in honor of Tibor Kalman) is invited along.\n\n—-\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20081011015851/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rock & roll mf\n\n"
    },
    {
      "time": " 12.Jun.2005 4.15am",
      "content": "Howdy folks!\n\nMe (Stefan Hattenbach) will arrive on July 19th and enjoy every second of TypeCon. This chance to meet friends and colleagues within the business is totally unbeatable. Hope to get some spare time as well, to see good old NYC again, for the first in 15 years!!! I expect the city to be as cool as ever?! Heading back home to Stockholm July 24th (late evening), probably with a tear in my eye... Btw my friend Peter Bruhn is having the same flight dates as me.\n\nPS. Also staying at the Roosevet.\n\nSee you all soon, cheers  \n/SH\n\n"
    },
    {
      "time": " 12.Jun.2005 5.51am",
      "content": "I’m arriving on Tuesday 19th, staying at the Roosevelt, and leaving late on Sunday 24th.  \nAnyone care to share a double room?\n\n"
    },
    {
      "time": " 12.Jun.2005 5.52am",
      "content": "References available\n\n"
    },
    {
      "time": " 12.Jun.2005 12.56pm",
      "content": "I — Yves _(which you pronounce like “Eve”)_ Peters — am arriving on Tuesday 19th, staying at the Roosevelt, and leaving on Monday 25th as I don’t want to miss the wrap party. I’ll be sharing a room with my viking buddy Stefan Hattenbach.\n\nI really don’t know if I’ll be able to see any of New York as I plan to meet everyone in the flesh, but if anyone is going anywhere interesting and I have some spare time, I’ll gladly join in if you are willing to suffer my [savage and uncivilised ways](http://web.archive.org/web/20081011015851/http:/www.typophile.com/node/12978).\n\n"
    },
    {
      "time": " 12.Jun.2005 6.06pm",
      "content": "”...I have signed up for all the conference events and the 2 FontLab sessions on Wednesday.”\n\nSigned up? Can someone tell me why after signing up for the Typecon mailing list TWICE was I not notified about when registration opened?\n\nOn another note: what I’ll be doing is hopefully meeting you all and learning how to actively pursue the profession.\n\nSince I already live in New York, the only thing extra I’ll be doing is taking the subway further uptown. :)\n\n"
    },
    {
      "time": " 12.Jun.2005 7.13pm",
      "content": "See you all in NYC. I’ll be staying with my son, who lives downtown.\n\n"
    },
    {
      "time": " 12.Jun.2005 7.16pm",
      "content": "Terry,\n\nI never got an announcement either. I just kept checking the site everyday until it was up.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Jun.2005 7.20am",
      "content": "_I never got an announcement either._\n\nDitto here. :-/\n\n"
    },
    {
      "time": " 13.Jun.2005 7.34am",
      "content": "Well, I signed up as soon as I found out about it. All I really cared about was getting into the workshops that I wanted to be in.\n\nSince I live in New York, if anyone has ideas about things they want to do while they’re here in the city I’d be happy to help if I can.\n\n"
    },
    {
      "time": " 13.Jun.2005 7.42am",
      "content": "“I’ll be staying with my son, who lives downtown.”\n\nWilliam, this always make me smile because New York doesn’t have the share the same concept of downtown as a lot of cities do. Its something I learned after moving here a few years ago. :) “Downtown” in New York can be based entirely on geographic location.\n\nSo will you be in lower Manhattan then? What region of the city?\n\n"
    },
    {
      "time": " 13.Jun.2005 9.20am",
      "content": "My son just moved apartment from NoHo to Chinatown, which is a world in  \nitself. I love it because it is full of families, with all ages present.  \nThe food is great at amazingly cheap prices also.\n\nAlso, it seems like every other basement has a small print shop! The  \nsigns are in general completely chaotic - no concept of design, though  \nsometimes you come across a nice one.\n\n"
    },
    {
      "time": " 13.Jun.2005 11.30am",
      "content": "OK, for those of you who haven’t received TypeCon news, we found out there was a glitch in our listserve. Sorry for the inconvenience. We’re resending the the “registration is open” announcement as soon as the problem is fixed (probably tomorrow).\n\n"
    },
    {
      "time": " 13.Jun.2005 12.16pm",
      "content": "I’ll be attending my first ever typecon, though, sadly, I can only attend the first 2 days :(  \nI have signed up for 2 FontLab sessions on Wednesday as well.\n\nFlying in Tuesday through Thursday for me @ the roosevelt\n\nHope to meet some of the people from the forum while I am out there\n\n"
    },
    {
      "time": " 13.Jun.2005 12.42pm",
      "content": "Who?: Me, I’ll be there, staying at the Roosevelt (with Shinn).\n\nWhen?: Tuesday to Monday morning.\n\nWhat?: Oh, you know Con stuff. Of course we have to check out some of the world-class cuisine in the City. And the Pierpont Morgan Library always has interesting book arts exhibits.\n\n"
    },
    {
      "time": " 13.Jun.2005 1.33pm",
      "content": "After you got my hopes up I sadly just read the Pierpont is closed to the public for its major expansion and renovation project, the Morgan will reopen in spring 2006.\n\n"
    },
    {
      "time": " 13.Jun.2005 6.17pm",
      "content": "I’ll be there, arriving the Saturday before it all starts. This year I’m bringing my family along, all three of us staying at the Roosevelt. This will my daughter’s first time to Manhattan. Her mother and I have been there many times either together or separately. So this will be sort of a family vacation this year, with me abandoning them for TypeCon more as the week goes on. Hopefully, they will get a chance to see a little of it, too.\n\nThis will be my third, but I still get excited when I click those confirmation buttons on the airline and hotel reservation pages.\n\n"
    },
    {
      "time": " 13.Jun.2005 8.45pm",
      "content": "I’ll be getting there the weekend before, I think (haven’t made the reservation yet). I have a talk for the NYC InDesign Users Group the evening of Monday the 18th. Veronica and Miranda will most likely be coming with me, to prevent me from getting excessive amounts of sleep.\n\nI’m looking forward to seeing everybody! One cool thing about TypeCon for me is always that it’s my first type conference of the season, so I get to renew old acquaintances.\n\nT\n\n"
    },
    {
      "time": " 13.Jun.2005 9.00pm",
      "content": "Arriving on 19th, leaving Sunday (or maybe Monday). Staying at the Roos. May bring the family with me, to prevent me from drinking excessive amounts of alcohol. If so it will be Lily’s fifth type conference (ATypI Copenhagen, TypeCon Toronto, ICTVC 1, ATypI Vancouver) not bad for someone who won’t be four years old ’til August.\n\nSi\n\n"
    },
    {
      "time": " 14.Jun.2005 5.14am",
      "content": "”...We’re resending the the “registration is open” announcement as soon as the problem is fixed”\n\nTamye,  \nMy email announcement arrived yesterday so it seems you have “fixed” it :-)\n\nChrisL\n\n"
    },
    {
      "time": " 14.Jun.2005 9.07am",
      "content": "William, that is definitely a neat part of town. There are actually a good amount of textile and supply places for designers there. A lot of designers and students go down there to get supplies for comps, projects (plastic, resin and other materials).\n\nI like not having a concept of design, as a designer its refreshing to see things that are purely functional. A lot of times there is a lot of character and personality to something that wasn’t overthought by a designer.\n\n"
    },
    {
      "time": " 14.Jun.2005 9.11am",
      "content": "emel, I spent my first semester of undergrad at CCAD. I wonder if we had some of the same professors.\n\n"
    },
    {
      "time": " 14.Jun.2005 10.59am",
      "content": "Like **tbiddy** , I am already in NYC (Brooklyn, to be precise). See you all in July!\n\n"
    },
    {
      "time": " 14.Jun.2005 5.20pm",
      "content": "I will be flying in the 15th and leaving the 25th. Staying at the Roosevelt. After a few days of slaving away for Tamye (in a very positive way), I will be enjoying TypeCon and will be up for almost anything. Looking forward to it.\n\n"
    },
    {
      "time": " 14.Jun.2005 6.06pm",
      "content": "“emel, I spent my first semester of undergrad at CCAD. I wonder if we had some of the same professors.”-tbiddy\n\nI’m sure you had a couple of them if it was foundation year.  \nWhich year did you attend?\n\n"
    },
    {
      "time": " 14.Jun.2005 7.47pm",
      "content": "“Which year did you attend?”\n\n1997, I only spent one year there and I transferred to Howard University in DC after that. I went from wanting to be an animator, to being a filmmaker, to being a designer, and back to being an artist/illustrator, and now a typographer.\n\n“Like tbiddy, I am already in NYC (Brooklyn, to be precise).”\n\nRicardo, I also live in Brooklyn.\n\nAnyone taking the second FontLab workshop?\n\n"
    },
    {
      "time": " 14.Jun.2005 8.51pm",
      "content": "I’m extremely sorry I will not be at TypeCon this year (friends are getting married that weekend). Have a wonderful time, everyone!\n\n"
    },
    {
      "time": " 14.Jun.2005 9.11pm",
      "content": "The Punchcut contingent will be there representing Typophile - myself, Jared Benson, Christian Robertson and Zara Evens. Looking forward to screening the second Typophile Film Fest. (Oh, and Zara, is it true that Pepito won’t be able to make it?)\n\n(Chesh, sorry you can’t make it. We’ll be sure and represent Emeryville for you.)\n\n"
    },
    {
      "time": " 15.Jun.2005 6.47am",
      "content": "“Anyone taking the second FontLab workshop?”\n\nI am taking the both sessions of the workshop. I wasn’t sure about taking the first session since I read Leslie Carbargas book and figured it was a good primer, but I’d rather learn more and have some redundancy than miss something.\n\n"
    },
    {
      "time": " 15.Jun.2005 8.26am",
      "content": "I’ve read Cabarga’s book too. I’ve also had two go rounds with a font family when I was working on my Thesis project. After the second go around and watching James Montalbano use FontLab, I picked up on a lot of tricks.\n\nI really need to learn about Unicode, hinting, and polishing off for a professional look and all of that jazz. Plus, some of us recent grads don’t have an extra $100 to throw around. :(\n\n"
    },
    {
      "time": " 15.Jun.2005 12.19pm",
      "content": "Correction: <cite>Pepito</cite> is actually <cite>Puppet-O</cite> (however, pronounced like Pepito), and he/it will not be in attendance.\n\nI am looking forward to seeing everyone there, details of my travels to come.\n\n"
    },
    {
      "time": " 15.Jun.2005 1.23pm",
      "content": "If there’s no puppets I really don’t see why I’m going all the way out there.\n\n"
    },
    {
      "time": " 15.Jun.2005 9.08pm",
      "content": "\\> _Chesh, sorry you can’t make it. We’ll be sure and represent Emeryville for you._\n\nHow about if I bring my commemorative Cheshire Dave hand puppet as well?\n\nIt’s no _Puppet-O_, but still...\n\nThis TypeCon will be the first with two (count ’em, two) representatives from Veer. Jon Parker will be accompanying me on the trip from the prairies. It looks like we’ll be landing on Tuesday evening and winging it back to cowtown late Sunday. We’ll be residing for the duration at the (apparently) lovely Roosevelt as well.\n\nI imagine we should bring along a bit more Veer schwag than last year... any requests?\n\n"
    },
    {
      "time": " 16.Jun.2005 10.12am",
      "content": "<cite>I imagine we should bring along a bit more Veer schwag than last year… any requests?</cite>\n\n[Typography hoodies!!](http://web.archive.org/web/20081011015851/http:/www.veer.com/products/merchdetail.aspx?image=VPR0001140) (for girls and boys)\n\n"
    },
    {
      "time": " 16.Jun.2005 10.53am",
      "content": "I, Andrea Emery, just registered for the conference and I am very excited to be going! The list of speakers looks great and all the activities look fun - it’s always such a treat to travel from Ottawa to the big city. I look forward to making some new type friends - See you all there!\n\n(And YES, please bring hoodies!)\n\n"
    },
    {
      "time": " 16.Jun.2005 1.05pm",
      "content": "Typography hoodies? Yay! :-)\n\n"
    },
    {
      "time": " 16.Jun.2005 2.39pm",
      "content": "Creatives understand : )\n\n"
    },
    {
      "time": " 17.Jun.2005 8.37am",
      "content": "Those hoodies rock.  \nIf you read the type in columns they spell out “TYGR POAPHY” lol.  \n(tiger poopy?)\n\n"
    },
    {
      "time": " 17.Jun.2005 9.08am",
      "content": "“I imagine we should bring along a bit more Veer schwag than last year… any requests?” -Grant Hutchinson\n\nI suggest Oral Fixation Mints, typographers have the worst breath...  \n;)  \n [http://www.veer.com/products/merchdetail.aspx?image=VPR0005250](http://web.archive.org/web/20081011015851/http:/www.veer.com/products/merchdetail.aspx?image=VPR0005250 \"http://www.veer.com/products/merchdetail.aspx?image=VPR0005250\")\n\n"
    },
    {
      "time": " 17.Jun.2005 9.51am",
      "content": "\\>Veer schwag … any requests?\n\nDude. Anything with Shinn fonts on it.\n\n"
    },
    {
      "time": " 18.Jun.2005 2.13pm",
      "content": "Ok, I’ll see what I can do. No absolute promises, but I have been assured by our marketing wonks that I’ll be able to spread around a fair bit of wearable Veer love at TypeCon. It’s going to boil down to how much Jon and I can carry around with us, I suppose.\n\n\\> _Dude. Anything with Shinn fonts on it._\n\nNick... we’re working on that very thing.\n\n"
    },
    {
      "time": " 19.Jun.2005 6.05pm",
      "content": "Another thing to do while at Typecon: do not miss the [world’s largest metal type](http://web.archive.org/web/20081011015851/http:/typographi.com/000839.php), on display in midtown Manhattan.\n\n"
    },
    {
      "time": " 19.Jun.2005 9.54pm",
      "content": "If Victorian era metal & wood type interests you, then be sure to visit [Bowne & Co., Stationers](http://web.archive.org/web/20081011015851/http:/www.southstseaport.org/places/bowne.shtm)\n\n"
    },
    {
      "time": " 20.Jun.2005 4.48am",
      "content": "_Who:_ [Chris Rugen](http://web.archive.org/web/20081011015851/http:/currentconfig.com/)\n\n_When:_ Arriving Wed 20th; Leaving Sunday 24th. Staying at the Roosevelt.\n\n_What:_ It’s my first TypeCon, and I’m so psyched about the events and workshop (Reproducing Brush Lettering 4 LYFE), that I haven’t thought it out much, even though I work in NYC two days a week. Bowne & Co. sounds pretty good though...\n\nI’ve got a question for the TypeCon vets: bringing a laptop – a hassle or a necessity?\n\n"
    },
    {
      "time": " 20.Jun.2005 5.07am",
      "content": "Is there WLAN access at Parsons?  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20081011015851/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 20.Jun.2005 10.32am",
      "content": "Laptop might be useful in the hotel room, but you won’t want it at the conference. A pain to drag it around along with all the great _schwag_ you pick up. And why have your face in a screen when you can be talking to cool people like me and Dan?\n\n"
    },
    {
      "time": " 20.Jun.2005 10.58am",
      "content": "Wow. I am honored to be on such a shortlist of cool people ;-)\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20081011015851/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 20.Jun.2005 1.21pm",
      "content": "“_...why have your face in a screen when you can be talking to cool people like me and Dan?_”\n\nGood point. And that’s actually one of the things I’m looking forward to the most: talking with cool (type) people _in person_.\n\n"
    },
    {
      "time": " 20.Jun.2005 4.18pm",
      "content": "What, no iChatting to each other in the same room?\n\nYay for humans!\n\n"
    },
    {
      "time": " 20.Jun.2005 5.05pm",
      "content": "Hey Stewf, I don’t have time to visit any gym, so carry my laptop around is my only chance of doing some “bodybuilding”. I can carry and talk at the same time, promise ;-)\n\nSee you there, buddie\n\n"
    },
    {
      "time": " 20.Jun.2005 9.54pm",
      "content": "I will actually be interacting with you via laptop only, while hiding out in the back room at McHale’s.\n\n"
    },
    {
      "time": " 21.Jun.2005 12.25pm",
      "content": "I was wondering if any type-girls want to share a room at the Roosevelt, during the conference. I’ll be there from Tuesday evening, the 19th, straight through to Sunday the 24th. I don’t snore and am generally nice and easygoing.\n\n"
    },
    {
      "time": " 23.Jun.2005 10.59am",
      "content": "Andrea, hope you found a roomie! If anyone is desperately in need of a share at the Roosevelt, post here, and we’ll try to hook you up.\n\n"
    },
    {
      "time": " 23.Jun.2005 5.35pm",
      "content": "Just talked w/ the reservations desk at the Roosevelt. There are indeed rooms available. Be sure you get the conference rate cuz it’s about $60 better than their normal rate.\n\nWe’re getting giddy over here.\n\n"
    },
    {
      "time": " 24.Jun.2005 1.05am",
      "content": "Yes, the Roosevelt added more rooms to our block - they’re the best! The hotel is getting full of type geeks. I don’t know how long the rooms will last, so anyone waiting until the last minute to book may be sad. Same with TypeCon... don’t wait until we’re sold out!\n\nWe’ve extended early bird for a few more days... but prices go up next Tuesday. Save some money for shopping, fine dining, or buying type goodies while you can.\n\n"
    },
    {
      "time": " 24.Jun.2005 6.40am",
      "content": "Hey Tamye - i did fine a roomie - and it’s because I posted here. (Thanks to Tiffany’s Suggestion, I might add). How awesome is that?! With every TypeCon reminder or email message, I am \\*really\\* getting excited about the event and the speakers ... and, of course, seeing all the Veer schwag/type goodies up close!\n\n"
    },
    {
      "time": " 27.Jun.2005 11.04am",
      "content": "Are there any men looking for roommates? Not for me, but a male friend who might fly over from Belfast.\n\n"
    },
    {
      "time": " 27.Jun.2005 1.49pm",
      "content": "Ou la la, Tiff, an Irish “friend”?\n\nI’ll keep it in mind... people are looking...\n\n"
    },
    {
      "time": " 27.Jun.2005 1.57pm",
      "content": "By the way - the extended early bird discount ends today. AND - the speaker schedule is now live, so you can see when your favorite is onstage. Detailed program info coming shortly.\n\nRegister before midnight tonight, Pacific time, to save some bucks!\n\n[www.typecon.com/register/](http://web.archive.org/web/20081011015851/http:/www.typecon.com/register/ \"www.typecon.com/register/\")\n\n"
    },
    {
      "time": " 29.Jun.2005 8.37am",
      "content": "Kind of a weird question...I noticed that the FontLab workshops are full. If I have the software on my laptop though, is there any way I still might be able to get into it even though there is only room for 24 in the Mac lab?\n\n"
    },
    {
      "time": " 29.Jun.2005 10.01am",
      "content": "Hmmm. Seems as though the Roosevelt is booked solid. Anyone know of a decent, cheap hotel (ha!) near either the Roosevelt or Parsons?\n\n[Sorry. False alarm. I’m too stupid to use the online booking system.]\n\n"
    },
    {
      "time": " 30.Jun.2005 2.29am",
      "content": "One crazy (but lovable) male Brazilian speaker seeks roomie at the Roosevelt for TypeCon. Arrives Wed., July 20, departs Mon., July 25. Please respond here, or email tamye @ typesociety.org if you want a match. Guaranteed a good time!\n\n"
    },
    {
      "time": " 5.Jul.2005 6.21pm",
      "content": "Tamye,  \nI registered for TypeCon a while ago but now want to add Nick Shinn and Adam Twardoch’s opentype session on Thursday morning. Is there a way I can do this without redoing the whole sign-up process?\n\nChrisL\n\n"
    },
    {
      "time": " 5.Jul.2005 6.50pm",
      "content": "Hi, Chris. We can take care of the workshop addition over the phone or by fax. I’ll email you the digits.\n\nAnyone else that needs to add a workshop, email me at info (at) typesociety.org, and I’ll send instructions.\n\nTamye\n\n"
    },
    {
      "time": " 10.Jul.2005 12.50pm",
      "content": "I’ll be staying on the geek floor at the Roosevelt. Will be rooming with my two girlfriends and am arriving in NYC on Tuesday night before the event. Taking a couple of workshops too. This will be my 2nd TypeCon - the first being Minneapolis 2003. See you there. I’ll be the one with a drink on my mind or in my hand. :)  \nSean\n\n"
    },
    {
      "time": " 10.Jul.2005 6.19pm",
      "content": "Sean,  \nTwo girlfriends and drinks? Will you be seeing any of the conference? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 10.Jul.2005 7.04pm",
      "content": "I think the big question is: will the stars of [Wedding Crashers](http://web.archive.org/web/20081011015851/http:/www.weddingcrashersmovie.com/crashthistrailer/index.htm?id=24567) be making a special TypeCon appearance?\n\n"
    },
    {
      "time": " 11.Jul.2005 5.11am",
      "content": "Steuf,  \nThat is a scream!!!  \nThanks for taking the time. It is priceless :-)\n\nChrisL\n\n"
    },
    {
      "time": " 14.Jul.2005 10.59pm",
      "content": "Type Fever has hit the Big Apple! A slew of Typophiles, TypeCon attendees, and more type geeks mingled with TDC members, competition winners, and folks from the NYC type community at the TDC exhibition opening at Cooper Union.\n\nThe show looks great, and there were lots of cool people in attendance, including many TypeCon speakers.\n\nThe official mayoral proclamation for Type Week is pretty sexy, too - we’ll post images soon.\n\nTomorrow, more TypeCon fun as Miss Tiffany hits town, and we journey to TDC offices and Parsons to continue plotting and planning. Can’t wait to see you all next week!\n\n"
    },
    {
      "time": " 15.Jul.2005 8.19am",
      "content": "_who:_ Jesse Ragan, typeface designer\n\n_when:_ I live in Brooklyn, so I’m around as long as you are.\n\n_what!?_ I keep a low profile online, but I’m far more engaging in person. I look forward to meeting more of you fine folks at the conference next week!\n\n"
    },
    {
      "time": " 15.Jul.2005 1.41pm",
      "content": "Jesse, I have a [Compatil](http://web.archive.org/web/20081011015851/http:/www.linotype.com/200000/compatil-clan.html) brochure for you.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20081011015851/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 15.Jul.2005 2.45pm",
      "content": "Those rule.\n\nhhp\n\n"
    },
    {
      "time": " 16.Jul.2005 10.12pm",
      "content": "A consensus has been taken late night at the Roosevelt hotel and we have decided there should be more exciting, expectant chatter about TypeCon 2005. We don’t really know what, but its late and we are preparing for the festivites.\n\n"
    },
    {
      "time": " 17.Jul.2005 8.10am",
      "content": "Yes! I agree.\n\nAre Typophiles gathering anywhere to hang out/meet up on Wednesday night? Perhaps a post-FiFFteen soirée? Or is everyone planning to head back to the Roosevelt and hang out in the hotel bar?\n\nI’ll be the one holding my ’I like type’ tshirt molded into the shape of a red carnation...or something.\n\n"
    },
    {
      "time": " 17.Jul.2005 8.12am",
      "content": "a red carnation? Really? can you do that? : )\n\n"
    },
    {
      "time": " 17.Jul.2005 8.18am",
      "content": "Um. Yes...\n\n::furiously scrunches tshirt::\n\n"
    },
    {
      "time": " 17.Jul.2005 8.20am",
      "content": "A post-exhibition bash on Wednesday is definitely in order (in fact, I’m looking for something to do on Tuesday night as well!!!). I do not know New York well enough to suggest anything, but I am up for everything ;-)  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20081011015851/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 17.Jul.2005 8.20am",
      "content": "I certainly would like to post gather afterwards. Since I only have everyone’s icon to go by, I’ll be looking for tshirt scrunchers and the like (you’re hillarious crugen!)\n\n"
    },
    {
      "time": " 17.Jul.2005 8.21am",
      "content": "Chris, I have no red t-shirt to scrunch into a carnation, but my hair is bigger and redder than that of anyone else who is likely to attend the conference… you can’t miss me.  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20081011015851/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 17.Jul.2005 8.24am",
      "content": "I’m in town Tuesday night too - anyone else coming in early? Any city event suggestions?\n\n"
    },
    {
      "time": " 17.Jul.2005 8.42am",
      "content": "I am arriving Tuesday night as well, and think a drink at the hotel bar might be nice. I’ll be there, wearing the day-glo green baseball cap, yellow/blue striped sweater with a picture of a kitten on the front, hot pink feathery boa, military issue camo pants, and no shoes, smoking a cigar. Oh yes, with a yellow flower in my hair. So, who wants to hang out with me?\n\n:)\n\n"
    },
    {
      "time": " 17.Jul.2005 8.48am",
      "content": "Gee Zara... um... I’ll definitely look out for you! : )\n\n"
    },
    {
      "time": " 17.Jul.2005 9.03am",
      "content": "OK, now that I have frightened everyone – here is the truth. I will be wearing shoes, and they will either be black, orange, red or pink. Definitely not purple.\n\n"
    },
    {
      "time": " 17.Jul.2005 9.06am",
      "content": "Now you’re all making me want to stay in town on Tuesday (I work in Manhattan on Tues. and Thurs.). I had planned to show up Wednesday.\n\nHmmm.\n\n"
    },
    {
      "time": " 17.Jul.2005 9.08am",
      "content": "Yeah Chris - we can all meet up in the hotel bar - why don’t you stay in town? I’m thinking everyone should be wearing something red (be it hair or shoes or carnations!)\n\n"
    },
    {
      "time": " 17.Jul.2005 9.31am",
      "content": "Hotel Bar! Yeah! What time?\n\nStay, Chris, stay…\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20081011015851/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 17.Jul.2005 9.36am",
      "content": "Hmmm... what time do you arrive into NY, Dan? Zara?  \nHow about 7 pm? What do you think?\n\n"
    },
    {
      "time": " 17.Jul.2005 9.41am",
      "content": "I will probably show up at the hotel around 10 or so.\n\n"
    },
    {
      "time": " 17.Jul.2005 9.54am",
      "content": "I suspect to be in the Hotel by 6pm.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20081011015851/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 17.Jul.2005 10.05am",
      "content": "Well Dan, I can look for you in the hotel bar around 7 and we can toast to Zara’s arrival at 10 ish.\n\n"
    },
    {
      "time": " 17.Jul.2005 10.14am",
      "content": "OK!\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20081011015851/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 17.Jul.2005 1.13pm",
      "content": "BE WARNED: The Roosevelt Hotel, while über-posh, doesn’t allow checking in until 3:00pm. So, you arrive earlier than that prepare to let them hang on to your luggage. If you get into town and want to start helping out immediately, call me on my mobile. (If you want my mobile find stephen and ask him.)\n\nThe events this year are going to keep you busy. Lots and lots of fun has been prepared for you and you won’t be lacking for activities. (I still need to find time to go shoe shopping, but i’m not prepared to hold my breath.)\n\nYipee! can’t wait for more and more to arrive!\n\n"
    },
    {
      "time": " 17.Jul.2005 1.13pm",
      "content": "I arrived late last night (Saturday, that is). I have my partner and out daughter along. We made the mistake of having breakfast in the hotel restaurant this morning. The food was fine, but the price was outrageous. When we left the hotel, we discovered that there is a ten-block long street market just outside on Madison Avenue with lots of reasonably priced food options. D’oh!\n\nWe wandered around Manhattan this morning and went on a walking tour of Central park earlier this afternoon. That was pretty cool, but we’re pretty beat already.\n\nAnyone else here yet? I haven’t seen anybody, but I also haven’t been hanging around the hotel.\n\n"
    },
    {
      "time": " 17.Jul.2005 1.15pm",
      "content": "almost forgot. when you arrive, for those of you who arrive on monday, please find me to sign a certain someone’s birthday giftie. :^)\n\n"
    },
    {
      "time": " 17.Jul.2005 1.35pm",
      "content": "The lobby bar at the Roosevelt is swell - a super cool hangout place with tasty snacks, great drinks, and a relaxing atmosphere. Great for people-watching! We (Miss Tiffany, Mr. Coles, Jonny Coltz, Brian B and his girl Sheri, Ghost of Steuf, FontShop crew, myself and a few others) will be glad to meet up in the bar Tuesday night after a rough day of moving TypeCon goodie bags, TypeGallery, and other stuff from the TDC to Parsons. We’ll be at the bar 7:30-8ish, ready to toast the arrival of our Typophile friends.\n\n"
    },
    {
      "time": " 17.Jul.2005 1.35pm",
      "content": "Attention those whom are STILL interested in submitting to the TypeGallery. The absolute drop-deadline for entries is Wednesday, July 20th, at 10am EST. You may bring them to Parsons yourself as long as we have digital versions by tomorrow, Monday, at 5:00 pm EST. We appreciate all entries and really do not want to turn anyone away, but we must set a deadline.\n\n"
    },
    {
      "time": " 17.Jul.2005 2.46pm",
      "content": "TypeCon goodie bags?!  \nCan’t wait!!! (I feel giddy!)\n\n"
    },
    {
      "time": " 17.Jul.2005 7.44pm",
      "content": "I will be arriving at the Hotel at about 9pm. I don’t do carnations (reminds me of the Prom) but will wear a type related T-shirt :-)\n\nChrisL\n\n"
    },
    {
      "time": " 17.Jul.2005 10.39pm",
      "content": "Chris,\n\nThat’s a cute little icon you’ve crafted for yourself!\n\n"
    },
    {
      "time": " 18.Jul.2005 4.56am",
      "content": "Looks like I’ll be crashing in NYC Tuesday night, so I’ll be at the Roosevelt around 7–7:30. I’ll be wearing something type-related and red, ready to relax and toast hard work and a good time.\n\n"
    },
    {
      "time": " 18.Jul.2005 6.01am",
      "content": "Lauri,\n\nThanks! it is made completely from glyphs of my typeface “Leporello” so it is my face made from my face. I am having T-shirts made but they may not be ready in time for TypeCon. :-(\n\nChrisL\n\n"
    },
    {
      "time": " 18.Jul.2005 6.55am",
      "content": "I’ll be in on Tuesday night too - I hope to see some people in the bar that night as well.\n\nOn a side note, not being a new yorker, what is the easiest way to get to parsons for the workshops? Walk? Bus? Subway?\n\n"
    },
    {
      "time": " 18.Jul.2005 8.09am",
      "content": "You can walk - it’s under 2 miles and it’s a fairly scenic route. You can also take the subway - it’s a direct line. If you think you will be taking more subway than walking, you can invest in a 7 day pass, as well.\n\nSo New York typophiles - how hot and sticky is it in the city right now?\n\n"
    },
    {
      "time": " 18.Jul.2005 10.08am",
      "content": "It’s been between 85 and 95 most days. VERY humid. (I melt in humidity.)\n\n"
    },
    {
      "time": " 18.Jul.2005 10.24am",
      "content": "\\> _how hot and sticky is it in the city right now?_\n\nI just stepped out to grab some lunch and I would deem the humidity right now somewhere between _miserable_ and _unbearable_. And Wednesday is supposed to be even “better”. If you walk on the shaded side of the streets it ain’t that bad.\n\n"
    },
    {
      "time": " 18.Jul.2005 10.35am",
      "content": "Yucky - thanks guys - I imagine a few change of clothes will be necessary.\n\n"
    },
    {
      "time": " 18.Jul.2005 11.46am",
      "content": "Thai silk shirts, people. Bangkok makes NY feel like the Gobi.\n\nBut I’m sure you’ll still all have a blast! I’m envious...\n\nhhp\n\n"
    },
    {
      "time": " 18.Jul.2005 2.19pm",
      "content": "The Washington, DC area makes New York feel like Arizona :-)  \nI am looking forward to NYC and the dryer climate.\n\nChrisL\n\n"
    },
    {
      "time": " 19.Jul.2005 1.40am",
      "content": "Ok, now that Miss Tiffany has finished hijacking my computer I can remind everyone that tomorrow (that is Tuesday) we will be meeting around 8pm in the Bar Lobby at the Roosevelt. If you are in town already you have no excuse not to be there. All the cool kids are gonna be there. Don’t you want to be cool?\n\n"
    },
    {
      "time": " 19.Jul.2005 1.51am",
      "content": "It is sticky! But everyone is enjoying the city in all its glory, and each other’s company, regardless of the melt factor. See you at the bar...\n\n"
    },
    {
      "time": " 19.Jul.2005 5.21am",
      "content": "yes I want to be cool. I will be at the bar.\n\nIn fact, I am off to the airport now...\n\n"
    },
    {
      "time": " 19.Jul.2005 6.01am",
      "content": "Ugh. Came into the city for work today. The subway was suffocating.\n\nExtra reason to come to the bar tonight and be cool.\n\n"
    },
    {
      "time": " 19.Jul.2005 2.18pm",
      "content": "wish I was there dude’s.  \nmiles\n\nnewlyn.com\n\n"
    }
  ]
}
