{
  "id": "13040",
  "title": "(x) 2 Fonts on a printed(!) text, please help to identify - proprietary Atari Signum fonts AKZ\\_\\_\\_13, ANTIKR\\_N {self (Joshua K)}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "This is a printed and scanned text. I hope ypu can help me to identify the two fonts on it (main text and title)...\n\nThank you very much.\n\nThe whole paper:  \n [http://www.pc-schachtel.de/sonstiges/font.jpg](http://web.archive.org/web/20150414060306/http:/www.pc-schachtel.de/sonstiges/font.jpg)\n\nA part in detail is attached!\n\n| Attachment | Size |\n| --- | --- |\n| [6f047f6bdd2550b839fcd9b24b6c7f04.26918.jpeg](http://web.archive.org/web/20150414060306/http:/typophile.com/files/6f047f6bdd2550b839fcd9b24b6c7f04.26918.jpeg) | 26.29 KB |\n\n",
  "author": "Joshua K.",
  "time": "12 Jun 2005 — 5:40am",
  "uid": "7800",
  "comments": [
    {
      "time": "12 Jun 2005 — 8:10am",
      "content": "My (uneducated...) guess would be two of the variants of Knuth's MetaFont (not to be confused with FF Meta by Erik Spiekermann).\n\n"
    },
    {
      "time": "13 Jun 2005 — 7:38am",
      "content": "Where can I find an example of these fonts or the possibility to buy them?  \nThanks\n\n"
    },
    {
      "time": "14 Jun 2005 — 6:59am",
      "content": "From what I could understand from [this site's article](http://web.archive.org/web/20150414060306/http:/www.math.utah.edu/~beebe/fonts/metafont.html) about Knuth's Metafont, it is a font creation tool that works similar to Adobe Multiple Master. It is not a font, as such, because it is used to create fonts. The article includes a list of fonts developed with Metafont, and Knuth developed one called 'Computer Concrete' and another called 'ransom'. Bert, is it one of those?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "14 Jun 2005 — 9:38am",
      "content": "That's the interesting point!\n\n"
    },
    {
      "time": "14 Jun 2005 — 10:51am",
      "content": "The sans reminds me of Adobe Sans which works the same way (as does Adobe Serif). This serif is more attractive than Adobe Serif for sure.\n\n"
    },
    {
      "time": "14 Jun 2005 — 12:40pm",
      "content": "The serif reminds me, somewhat, of Golden Cockerel from ITC. Seems Gill-like. Not a match though.\n\n"
    },
    {
      "time": "14 Jun 2005 — 10:16pm",
      "content": "Looking in Jaspert's 'Encyclopaedia of Type Faces' turned up 'DeRoos' designed in 1947. It matches almost all the letters, except the C, quite closely.\n\nI am feeling that Bert's lead to the MetaFont direction is not getting the answer.\n\nBiggest problem is that I don't know of a digital version. In the pre-update days, I would have posted a scan of the type sample, so you could all compare for yourselves, but we still don't have that capability. (Please, when?)\n\n- Mike Yanega\n\n"
    },
    {
      "time": "15 Jun 2005 — 7:44am",
      "content": "My pointing towards Knuths fonts may have been a fluke, sorry...  \nI came to that because the sample reminded me of the illustration on Page 196 in Richard Southall's \"Printer's type in the twentieh century\" (very interesting book, but foul-smelling!) and because it's obviously quite low res...  \nAlso, the distorted sans serif seemed to me on par with Knuth's ideas on \"proper\" typesetting (irony intended).\n\nTo make a real comparison I'd have to hunt for the Knuth book I have somewhere, among hundreds of more or useless computer books, packed in cardboard boxes in three locations.\n\n"
    },
    {
      "time": "15 Jun 2005 — 8:03am",
      "content": "Bert, no criticism intended, but from the comments it seems that none of us can find any of the MetaFont creations that match the sample. Your suggestion sounded like a promising direction, because Joshua says (in separate e-mails) that this sample came from a manual written and printed by a teacher, within the last year. That says that this should be digital, and maybe not too hard to find, or expensive. Sorry I do not have Southall's book. Is it possible for you to post a scan of the sample there? If you don't have a place to post it, I would put it on a temporary page on my site, if you e-mail a copy to me.\n\nThe Knuth MetaFonts seemed mostly intended to be used for Math texts, where Joshua's sample was from a manual about language, or grammar, as I could understand it. This would not require special fonts with Math symbols.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "15 Jun 2005 — 8:12pm",
      "content": "Was this letterpress printed? The heavier ink hit on the top line (larger scan) and the variance of the two lowercase e's makes it appear as if it were. The text font looks Eastern European. That little lowercase r has a very distinctive flag on it, unless that is just ink or scanner distortion.\n\nGerald\n\n"
    },
    {
      "time": "16 Jun 2005 — 6:40am",
      "content": "Gerald, I've been writing to the poster, who originally contacted me about this ID, and Joshua told me this was done by a teacher, for his classes, as I mentioned in my last post. It seems unlikely to me that he would have printed this manual of grammar on letterpress.\n\nI like the 'Eastern European' idea, because none of us seems to know of a match, and \"The Fonts of Eastern Europe\" would be a book I'd love to see, if there was such a thing -- in other words, that's a big void in my information. The Russian fonts seem very 'derivative' if ParaType is typical. Czech fonts, other than Storm Type are also poorly known to me (sorry if I am forgetting others from here, but Peter Bil'ak, for example, is associated with Dutch type. Others of Czech origin like Ruzicka, Menhart and Licko have done their work in the U.S. or Western Europe, or have been known here through versions of their type published in Western foundries: Fairfield, Primer and Ruzicka Freehand (Ruzicka), Figural, Elysium and Oldrichium [derived from 'Manuskript'] (Menhart). Zuzana Licko, of Emigré, is well known and hard to categorize.)\n\nThe flagged 'r' you mentioned, is also found in the typeface 'DeRoos', by the Dutch designer of that name; and it resembles the 'r' in Bembo somewhat.\n\nCan you suggest some Eastern European candidates for this font?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "16 Jun 2005 — 11:40am",
      "content": "Mike\n\nI spent a bit of time (far too much) going through whatever East European stuff I have (as well as all the usual sources). Looking specifically for a similar flag on the lowercase r. The DeRoos does not match nor any other. The r appears to have a bit of calligraphic grace to it but it must be an anomaly in reproduction (which is why I asked about letterpress and the possibility of ink distortion).\n\nThere is a very strange mix of typographic study/specimen book titled Typo graphia &/2 (done for ITC in 1981) by Oldrich Hlavsa and Karel Wick that oddly includes (as a matter of pride I suspect) a large number of Czech type faces not normally seen by western eyes. But I was unable to pinpoint the typeface in question. Likely I am seeing something on that r that is not there.\n\nGerald\n\n"
    },
    {
      "time": "16 Jun 2005 — 12:02pm",
      "content": "That \"r\" is very Gill...  \nOr maybe something by Kindersley, Gill's former pupil?\n\nhhp\n\n"
    },
    {
      "time": "16 Jun 2005 — 1:01pm",
      "content": "If Joshua's professor wrote and had this printed in the last year I'd think the easiest solution would be to just ask him what font was used.\n\nI have since been able to find a similar flagged lowercase r or two. In revived transitional fraktur to roman faces typical of the Incunabula period. Gotico Eporedia has a very similar flag. ATF Verona has something near similiar.\n\nGerald\n\n"
    },
    {
      "time": "16 Jun 2005 — 6:15pm",
      "content": "Gerald, Joshua had told me that it was no longer possible for him to contact this teacher. That was why he was asking for help identifying the typeface. I agree that the De Roos 'r' has a different shape, but overall that typeface is still the most similar, for the most characters, that I could find for the typeface. I have nothing that shows 'Gotico Eporedia', but I have a sample of ATF 'Verona' and while it's true that the 'r' has a similar flag, that is almost its only resemblance to the sample text, since it looks like a pen drawn type.\n\nAs Hrant noted Gill has at least one face with a similar 'r' and a stemmed U ( [Gill Facia](http://web.archive.org/web/20150414060306/http:/www.fonts.com/findfonts/detail.htm?pid=206040)), but the W and many other letters are not very close. His Perpetua isn't much like this font, except for the stemmed U, and none of the other Gill serif faces I know (Pilgrim, Joanna and Solus) has a stemmed U, or a W like the sample type. Hrant, did you have another Gill candidate to offer?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "16 Jun 2005 — 6:41pm",
      "content": "Golden Cockerel?\n\nhhp\n\n"
    },
    {
      "time": "16 Jun 2005 — 9:09pm",
      "content": "Well, given all we know or don't know, likely this is one of those ubiquitous TrueType free fonts that pervade the web. The piece certainly wasn't professionally set and printed.\n\nGerald\n\n"
    },
    {
      "time": "17 Jun 2005 — 8:45am",
      "content": "_\"Golden Cockerel?\"_\n\nHrant, I forgot to mention that one, but from the posted sample and the samples of Golden Cockerel, there seem to be very few similar characters.\n\nI would have to agree with Gerald. By a process of elimination, and assuming that the budget of academics for exotic typefaces is non-existent, a web freeware font is as good a guess as any. However, there is too much that seems professional about this type, suggesting that some type 'borrowing', and maybe some font editing, created this font. I'm at a loss to identify the possible sources of any specific letters, because there is so little that seems really distinctive besides the flagged 'r'.\n\nIf I had to try to create this, I think I would use Perpetua, so I guess I am agreeing with the Gill camp. The 's' seems similarly flattened, the 'f' seems right, the 'k' is the same style, and it has the stemmed 'U'. I would need to modify the W and the M to make it closer, but the more I look at this, the more I think it IS a version of Perpetua. The Stephenson Blake version shown in Jaspert (p.177) is very close, except for the two letters I mentioned, and the 'y'. Joshua's W is more stepped, and the M is straight-sided, rather than splayed; the 'y' has a serif on the tail, more like the Monotype version.\n\nMy final answer: This is a modified version of Perpetua, possibly one of the 'budget' clone varieties found on the 3,000 fonts for $9.95 CD's.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "17 Jun 2005 — 8:50am",
      "content": "I can see I have to eat my own words: _\" Perpetua isn’t much like this font, except for the stemmed U\"_, but I was looking at the few differences, and not the similarities.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "19 Jan 2010 — 7:10am",
      "content": "This thread is really old now, but some time ago I found out the source of the two searched typefaces, and as I now stumbled over this thread, I thought it would be fair to let you know because of your efforts. Just in case someone cares.\n\nI found out that my former teacher uses the Atari word processor “Signum”, and I managed to get a copy of it. This program uses bitmap fonts in its own format, and formerly there were several suppliers for Signum fonts. Many of the fonts come in different sizes and resolutions.\n\nThe two fonts used in the shown paper are supplied with the program. The headline font is called “AKZ\\_\\_\\_13”. Because of the name, I thought it may be modelled after Akzidenz-Grotesk; it is, however, different. (Maybe someone has an idea if there’s a similar typeface which could have served as a model?) A sample is attached.\n\nThe serif font is called “ANTIKR\\_N”, I attached a sample of it, too. It seems you were right, Mike, and it’s a version of Perpetua. And I like it! I'm fond of these fonts’ rough charm.\n\nThe 3rd and 4th attached image are samples (in the size of 13 and 50 pt.) of another interesting Signum font I like—and couldn’t withhold from you—named “Transitional”. Maybe someone knows if a typeface exists that was its model?\n\nBest regards, Joshua\n\n[akz\\_\\_\\_13.png](http://web.archive.org/web/20150414060306/http:/i50.tinypic.com/2d7slxd.png)  \n [antikr\\_n.png](http://web.archive.org/web/20150414060306/http:/i49.tinypic.com/307x8q1.png)  \n [trans\\_13.png](http://web.archive.org/web/20150414060306/http:/i46.tinypic.com/71nwk0.png)  \n [trans\\_50.png](http://web.archive.org/web/20150414060306/http:/i47.tinypic.com/2z9k1ec.png)\n\n"
    },
    {
      "time": "19 Jan 2010 — 10:26am",
      "content": "Fascinating typophilic ephemera!\n\n"
    },
    {
      "time": "19 Jan 2010 — 11:02am",
      "content": "Very cool.  \nI'm curious: it looks like those samples were made by actually opening the fonts; were they in some standard format (BDF?) or did you hack them open? Unless you have a running Atari on hand... :-)\n\nBTW, the third one seems to be modeled on Times.\n\nSomething else: I just realized the original sample up top reminds me of Emigre's Matrix, which was tellingly modeled on bitmap printer fonts.\n\nhhp\n\n"
    },
    {
      "time": "19 Jan 2010 — 12:14pm",
      "content": "The fonts have a Signum-specific format. I ran the program inside an Atari emulator (Gemulator) and printed the sample to a PCL file which I then opened with a PCL viewer (OpenPCL).\n\nTimes is indeed similar, as well as [Adobe’s Old Style 7](http://web.archive.org/web/20150414060306/http:/new.myfonts.com/fonts/adobe/old-style-7/).\n\nEmigre’s Matrix is interesting. Thanks for that hint!\n\n"
    }
  ]
}
