{
  "id": "13058",
  "title": "Hedera",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi people!\n\nHedera. Umm... what is it exactly? Ivy leaf... a horticultural dingbat... This little fellow ( [see veer's t-shirt](http://web.archive.org/)) has caught my attention a few times - always sitting by itself for no apparent reason. Is it just pretty? Or is there more to it than that?\n\nOr am I just being haunted by the thing?\n\n",
  "author": "higashi",
  "time": "13 Jun 2005 — 7:20am",
  "uid": "7452",
  "comments": [
    {
      "time": "13 Jun 2005 — 10:12am",
      "content": "The Hedera was one of the first punctuation marks of Greek and Romans (beside Interpuncts). In the Middle Ages this meaning was forgotten and it became a decoration for title pages and so on. In Germany we also call it Aldus-Blatt, because the famous italien printer Aldus Manutius used it very frequently.\n\nRalf\n\n[http://www.fonts.info](http://web.archive.org/web/20150218042647/http:/www.fonts.info/ \"http://www.fonts.info\")\n\n"
    },
    {
      "time": "14 Jun 2005 — 12:53am",
      "content": "Thanks Ralf, a great answer. I can rest a little easier now. Judging by the web pages I have found, it would seem that the Hedera/Aldus-Blatt has been given more recognition in Germany than in other countries ( [example](http://web.archive.org/))... is that the case?\n\nI feel a little guilty that the meaning passed me by, although I am sure I am not alone...\n\nIn the <cite>Character Palette</cite> (Apple OS X 10.4) I have found the hedera listed under <cite>Ornamental Punctuation</cite> as a <cite>floral heart</cite> and a <cite>rotated floral heart bullet</cite>. Both in Zapf Dingbats. Now I am forced to ask three more questions:\n\n1/ Is it commonly known in Europe as a hedera, but more commonly referred to as a floral heart in the States? (I am British).\n\n2/ Other than Dingbats, which character sets include the hedera?\n\n3/ Was the original use always as a bullet?\n\nPlease forgive my ignorance!\n\n"
    },
    {
      "time": "14 Jun 2005 — 6:58am",
      "content": "<cite>it would seem that the Hedera/Aldus-Blatt has been given more recognition in Germany than in other countries </cite>\n\nYes, because Germany's most famous publisher of design and typography books (\"Hermann Schmidt Verlag\") uses it as their brand mark.  \nBut I don't think the ancient roots and the name Hedera are well known in Germany or elsewhere.\n\nYou can find some more information in Parkes \"Pause and Effect – an introduction to the history of puntuaction in the west\" and in Paul Saenger's \"Space between Words\".\n\nI don't know which other typefaces include a Hedera. But if you find out more, please let me know. I would like to compare the different designs.\n\nRalf\n\n[http://www.fonts.info](http://web.archive.org/web/20150218042647/http:/www.fonts.info/ \"http://www.fonts.info\")\n\n"
    },
    {
      "time": "15 Jun 2005 — 3:52pm",
      "content": "[Hedera](http://web.archive.org/web/20150218042647/http:/typophile.com/wiki/Hedera) n. Latin, meaning ivy. One of the earliest typographic [ornaments](http://web.archive.org/web/20150218042647/http:/typophile.com/wiki/ornaments), present in many Greek inscriptions.\n\n"
    },
    {
      "time": "24 Jun 2005 — 8:06am",
      "content": "Linotype [ornaments](http://web.archive.org/). So… a needless or much needed flourish?\n\nRalf: [Minion Ornaments](http://web.archive.org/) has quite a selection of Hedera.\n\n"
    }
  ]
}
