{
  "id": "13061",
  "title": "What is a good font to represent freezing and quickness?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What is a good font to represent freezing and quickness?\n\n",
  "author": "mystic",
  "time": "13 Jun 2005 — 8:27am",
  "uid": "5212",
  "comments": [
    {
      "time": "13 Jun 2005 — 11:30am",
      "content": "Unless you are looking for some sort of novelty font (like one with icycles hanging off of it) the font, itself, doesn't usually have that literal of a meaning. It's more to do with how you use it than the specific typeface.\n\n"
    },
    {
      "time": "13 Jun 2005 — 12:49pm",
      "content": "Yeah, I don't want anything lame like icicles. I'm making a logotype for a freezer company. They just have a warehouse where they freeze things for people. They wanted to advocate that they did things quickly, hence why I wanted a typeface that advocated frost and speed.\n\nI'm still not really sure what I want to do for the logo type. Any of the obvious stuff is taken by competitors. In fact, all of their competitors are some shade of blue, from teal to like navy blue. They mentioned that they wanted some kind of stainless steel look, but even their largest competitors is already doing that. So my main focus was to do something very different and unique for them. Something to really set them apart from the rest of the competition.\n\nSome of their competitors use snow on top of the letters and it looks really, really gay. Others have like snowmans and stuff. It's just so unprofessional and ugly looking.\n\nPretty much the best competitor is this site:  \n [http://www.versacold.com/template.asp?pageID=5#warehouseserv](http://web.archive.org/web/20141009140954/http:/www.versacold.com/template.asp?pageID=5#warehouseserv \"http://www.versacold.com/template.asp?pageID=5#warehouseserv\")\n\n"
    },
    {
      "time": "13 Jun 2005 — 2:07pm",
      "content": "Freeze = Stop  \nSpeed = Motion\n\nHmm. Quandary. What about something like [Convecta](http://web.archive.org/web/20141009140954/http:/letterheadfonts.com/contributors/chuckdavis/convecta.shtml) or [Quantum](http://web.archive.org/web/20141009140954/http:/letterheadfonts.com/contributors/chuckdavis/quantum.shtml) which could both hint at the idea of an ice cube or rather carved into ice?\n\n"
    },
    {
      "time": "13 Jun 2005 — 2:57pm",
      "content": "_Some of their competitors use snow on top of the letters and it looks really, really gay._\n\nPlease don't explain it that way to the client. ;o)\n\nAgain I don't think you'll find a specific typeface that 'says' fast or cold. In fact, I'm not sure if the logotype even needs to 'say' that. It really is just a mark to represent the company. The marketing and branding of the company should say that, with the logotype simply being the mark used to label all of that.\n\n"
    },
    {
      "time": "13 Jun 2005 — 3:28pm",
      "content": "Cooper Black\n\n"
    },
    {
      "time": "13 Jun 2005 — 4:14pm",
      "content": "_Cooper Black_\n\nHuh? I always thought of Cooper Black as warm and fuzzy. I think that slab serifed egyptiennes can be quite cold.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20141009140954/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "13 Jun 2005 — 5:25pm",
      "content": "Creating a <cite>freezing quick</cite> logo using a typeface alone might not do it. What I mean is, there may be something potentially interesting in the actual letters used in spelling whatever the word or name is.\n\nWhen I create a logo I look at specific characters within what's being spelled, be it a word or initials. When you create a memorable and recognizable logo, you sometimes rely on the uniqueness of individual characters and not the whole typeface.\n\nSometimes replacing or modifying one of the characters makes it sing.  \nMaybe instead of trying to look freezing it could look ultra futuristic giving it a super high-tech feel. Being literal is not always creative.\n\nJust for a trial reaction, spell the name out using the EPCOTT or DECOTECH fonts available on the Disney Experience site: [http://www.disneyexperience.com/fonts.htm](http://web.archive.org/web/20141009140954/http:/www.disneyexperience.com/fonts.htm \"http://www.disneyexperience.com/fonts.htm\")\n\nor SPACE AGE at MickeyAvenue Fonts:  \n [http://www.mickeyavenue.com/fonts/spaceage/](http://web.archive.org/web/20141009140954/http:/www.mickeyavenue.com/fonts/spaceage/ \"http://www.mickeyavenue.com/fonts/spaceage/\")\n\nSee if that melts their popcicle!  \n---------------------------------  \nYes, I'm old, but I'm back in style!\n\n"
    },
    {
      "time": "14 Jun 2005 — 6:49am",
      "content": "There was a Chank font called Polar Bear – cold and fast.\n\n"
    },
    {
      "time": "14 Jun 2005 — 7:31am",
      "content": "Dan,\n\nJOKE\n\nEric\n\n"
    },
    {
      "time": "14 Jun 2005 — 7:36am",
      "content": "sorry… :(\n\nHairline fonts strike me as cold, too BTW (not a joke)\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20141009140954/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "14 Jun 2005 — 7:44am",
      "content": "Check out the heavier weights of [Armada](http://web.archive.org/web/20141009140954/http:/fontbureau.com/fonts/Armada/styles). The blockiness of this might work for you.\n\n"
    },
    {
      "time": "14 Jun 2005 — 8:49am",
      "content": "[Refrigerator](http://web.archive.org/web/20141009140954/http:/www.ms-studio.com/FontSales/refrigerator.html) , and not just for the name.\n\n"
    },
    {
      "time": "14 Jun 2005 — 8:49am",
      "content": "As well as the two previous suggestions, picking something somewhat angular could work well as it might speak to the crystaline nature of ice without having to be incredibly literal (icicles etc). i can't think of any examples however..\n\n"
    },
    {
      "time": "14 Jun 2005 — 10:31am",
      "content": "Thanks for the font suggestions. I'll try and incorporate some logos and post them up in that section of the forum. The name of the company is called Windsor Freezer btw. It's not the most original name in the world because the first name is just the City we live in. It looks kind of long when you put both the words together side-by-side.\n\n"
    },
    {
      "time": "14 Jun 2005 — 10:55am",
      "content": "Does Eras have a condensed?\n\nhhp\n\n"
    },
    {
      "time": "14 Jun 2005 — 11:26am",
      "content": "Ah, well the name changes everything. It has the word \"wind\" in it. Quick, freezing wind. You need a script. Something with swashes and 'scenders whipping all over the place.\n\n"
    },
    {
      "time": "14 Jun 2005 — 12:10pm",
      "content": "Ahh, cool. I guess I never thought of that. However, Windsor is still pretty generic and others probably have used that wind effect in the title (it's still an average size city).\n\nThey also wanted to convey \"clean\", \"fresh\" and maybe incorporate stainless steel (not my recommendation since competitors do it), blue water and \"white\"\n\nThey also suggested using an iceberg cracking into a sheet of ice water, but I'm not skilled enough to draw something like that, even if it just a simple 2-color line drawing in Macromedia Freehand.\n\nWhat do you mean exactly by swashes and 'scenders? I don't really know what you mean by that. I'll play with your suggestions and see what I come up with. Thanks!\n\n"
    },
    {
      "time": "14 Jun 2005 — 1:39pm",
      "content": "Maybe an industrial font - Something chunky - or even a boldish UNIVERS - combined with a snowfake would work nicely. The rough & tough against the delicate. Then it could be a one color design - white knoock out text with a blue flake. my 2 cents.\n\n"
    },
    {
      "time": "14 Jun 2005 — 1:54pm",
      "content": "egervari, how good are you in photoshop? Using styles you could make a cold clean logo.\n\n[http://share.studio.adobe.com/Default.asp](http://web.archive.org/web/20141009140954/http:/share.studio.adobe.com/Default.asp \"http://share.studio.adobe.com/Default.asp\")\n\nGo over to Adobe Studio Exchange and check out the Photoshop styles.\n\n"
    },
    {
      "time": "14 Jun 2005 — 3:22pm",
      "content": "I meant the sort of scripts whose capitals, ascenders, and descenders have enormous loops that overlap and span whole words, thus evoking a swirling storm. Not sure what you might find that seems cold enough, though. Upon reflection, your client probably wouldn't like my idea anyway.\n\nHow about Handel?\n\n"
    },
    {
      "time": "14 Jun 2005 — 3:28pm",
      "content": "An italic snowflake?\n\nhhp\n\n"
    },
    {
      "time": "14 Jun 2005 — 4:14pm",
      "content": "[Frozone!](http://web.archive.org/web/20141009140954/http:/images.google.com/images?q=frozone&hl=en&lr=&safe=off&client=safari&rls=en&sa=N&tab=wi)\n\n"
    },
    {
      "time": "14 Jun 2005 — 8:57pm",
      "content": "With an industrial client - tastfulness is probably not an issue - an italic snowflake with Chunky type might be just the kind of sick predictable hybrid logo they LOVE. On the other hand it could be awesome in a designers republic sort of way.\n\n"
    },
    {
      "time": "15 Jun 2005 — 1:39pm",
      "content": "Well, unfortunately speaking from experience, it is difficult to take the high road on things like this. That being said, there is a different aesthetic maybe to look for.\n\nIce can be delicate like a flake or hard and blocky. Some of the type suggested hits that blocky note. I know an ital Serpentine bold can work like that, but haven't we all seen enough of that. Solid and cold and fast maybe?\n\nAlso Officina Serif bold ital with some illustrative exageration can do what you need.\n\n"
    },
    {
      "time": "15 Jun 2005 — 8:05pm",
      "content": "illustrative exageration?\n\n"
    },
    {
      "time": "16 Jun 2005 — 8:58am",
      "content": "I'd like to suggest [Berthold City](http://web.archive.org/web/20141009140954/http:/www.bertholdtypes.com/adobe_lib/080222000.html) (bold) as a possible candidate.\n\n- Lex\n\n"
    },
    {
      "time": "16 Jun 2005 — 12:28pm",
      "content": "What do you like about that one? It has a certain pig iron qulaity to it - tough & so on. But is it chilly?\n\n"
    },
    {
      "time": "16 Jun 2005 — 6:44pm",
      "content": "how about [http://www.myfonts.com/fonts/scriptorium/platthand/](http://web.archive.org/web/20141009140954/http:/www.myfonts.com/fonts/scriptorium/platthand/ \"http://www.myfonts.com/fonts/scriptorium/platthand/\") ? A little work in illustrator and it can be made to look like lines and swirls in ice, for clarity you'd need to adjust the swashes and make the word itself appear darker. The for that industrial look something blocky with back turing serifs ... can't think of an example... totally different and should convey the concept.\n\n"
    },
    {
      "time": "17 Jun 2005 — 1:07am",
      "content": "hee hee - frozone.\n\n:-)\n\n"
    },
    {
      "time": "17 Jun 2005 — 6:36am",
      "content": "You might be able to use frost, as opposed to snow or icicles, in a non-corny way. There are [photos](http://web.archive.org/web/20141009140954/http:/blog.chadbrandos.com/archives/2004/12/25/frost/) on the internet as well as [fractal recreations](http://web.archive.org/web/20141009140954/http:/www.fractality.com/950404/frost.JPG) of frost that might give you ideas.  \n [Here's](http://web.archive.org/web/20141009140954/http:/livingindryden.org/images/weather/frostOnly.jpg) another photo. Frost can be incredibly varied in look and sometimes quite beautiful. If you have swash caps, the ends might turn into frost - like frozone! Sometimes the most obvious is best, if well executed. Another way is to have Windsor solid and Freezer outlined with the frost inside, in a fat face like FF Trademarker fat.\n\nI don't know, they may look awful, or great. You could try.\n\n"
    },
    {
      "time": "17 Jun 2005 — 8:25am",
      "content": "I like this idea. It is probably to subtle for an industrial client. But I like it.\n\n"
    }
  ]
}
