{
  "id": "13078",
  "title": "Calling all typophile/language experts!!",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey everyone,\n\nI'm working on a somewhat complex project, because it involves a large variety of alphabets with which I have no previous experience. The gist of the project involves the typesetting the phrase \"I Love You\" in the following languages:\n\nAfrikaans, Arabic, Basque, Bengali, Cantonese, Cherokee, Croatian, Czech, Danish, Dutch, English, Esperanto, Finnish, French, German, Greek, Hebrew, Hindi, Hungarian, Indonesian, Italian, Japanese, Javanese, Klingon, Korean, Latin, Malay, Mandarin, Mongolian, Morse Code, Norwegian, Persian, Pig Latin, Polish, Portuguese, Romanian, Russian, Sign Language, Sioux, Spanish, Swahili, Swedish, Tagalog, Thai, Tibetan, Turkish, Vietnamese, Welsh, Wolof, Zulu.\n\nI'm facing a few problems:\n\n1) For the latin face, I need a condensed sans serif. The studio I am working for is currently using Arial ( I didn't choose it), because the unicode version supported a ton of extra alphabets. I can't let that slide. At worst, I'd like it to at least be Helvetica, but if there are any other faces that also have Cyrillic, Greek and/or other alphabets, I'd like some options. Again, it needs to be condensed sans-serif.\n\n2) For the non-latin alphabets, how do I go about choosing typefaces that will go well with the latin? I don't have experience working with anything other than the latin alphabet, so I am not familiar with faces from other alphabets.\n\nHopefully the collective wisdom of the typophile community can help me. I know a lot of you out there work with non-latin alphabets!\n\nthanks\n\neric\n\n",
  "author": "ericgio",
  "time": "13 Jun 2005 — 7:54pm",
  "uid": "3814",
  "comments": [
    {
      "time": "13 Jun 2005 — 8:03pm",
      "content": "Myriad Condensed Pro will support all of the Latin-based alphabets, Cyrillic, and Greek. I think it will probably support Vietnamese, but I could be wrong. For some of the Native American languages, you may be in trouble. I'm not aware of many sans serif faces (period) that support them. I'm sure John Hudson will know better than me. The squared-off ideographic typefaces (what Japanese call \"kaku\" typefaces) will match reasonably well with Myriad -- Hiragino Kaku, for example.\n\nAs an aside, most Klingon fonts suck horribly. I'm pretty sure Klingon has a Unicode plane (ah, no, but it does have a private use area), but I don't know of any professional designers who are depraved enough to include it in their designs. In general, you probably just want to make sure the general weight and proportions match, but good luck doing that with things like Tibetan.\n\nAnd to forestall Hrant, you probably ought to tack Armenian onto your list.\n\n"
    },
    {
      "time": "13 Jun 2005 — 10:46pm",
      "content": "yeah...a couple of those are meant to be humorous\n\n\\>And to forestall Hrant, you probably ought to tack Armenian onto your list.\n\nhmmm. I'm hoping to get his input, but they have not including Armenian on the list, so now I'm afraid he'll be offended...\n\n"
    },
    {
      "time": "14 Jun 2005 — 12:06am",
      "content": "For the Thai fonts, you could look at this website [http://www.behaviourgroup.com/tbtha/tbmenu.html](http://web.archive.org/web/20130821083951/http:/www.behaviourgroup.com/tbtha/tbmenu.html \"http://www.behaviourgroup.com/tbtha/tbmenu.html\")  \nThey made some beautiful Thai fonts, also some that could go well with Latin sans serif fonts.\n\n"
    },
    {
      "time": "14 Jun 2005 — 10:43am",
      "content": "Who is \"they\", exactly?\n\nBTW, what about Gentium?\n\nhhp\n\n"
    },
    {
      "time": "14 Jun 2005 — 12:11pm",
      "content": "\"They\" is [Knock Knock](http://web.archive.org/web/20130821083951/http:/www.knockknock.biz/)\n\nThe project is a new line of [Wheels](http://web.archive.org/web/20130821083951/http:/www.knockknock.biz/commerce/product_info.php?cPath=35_36&products_id=296).\n\nIs Gentium a language or a typeface?\n\n"
    },
    {
      "time": "14 Jun 2005 — 1:02pm",
      "content": "gentium is a serif face and I need sans serif.\n\nit also needs to be condensed, since we are very tight on space. We're already down to 6 pt size\n\n"
    },
    {
      "time": "14 Jun 2005 — 2:04pm",
      "content": "Well, it's true that Armenians don't diverge much from their Apostolicism... But still.\n\nAnd a caution: smaller sizes need **wider** fonts, not narrower.\n\nhhp\n\n"
    },
    {
      "time": "14 Jun 2005 — 2:25pm",
      "content": "there is no running text, just short (2-3 word) phrases, so I don't think the readability will be TOO much of a problem. I'm obviously trying to maximize the space, but something's gotta give.\n\nwhat languages is armenian related to? we had to edit down the list to only 50, so some languages that are closely related to others got the boot.\n\n"
    },
    {
      "time": "14 Jun 2005 — 2:31pm",
      "content": "\\> something’s gotta give.\n\nI figured, but a wide 5-point font would work better  \nthan a narrow 6-point (economy being the same).\n\nArmenian is a separate branch of the IndoEuropean family; for a long time people thought it was a dialect of Farsi (since we **have** borrowed a lot of words from there) but Armenian's linguistic singularity has been established for long time now. As for our script, we use a \"custom\" alphabet (which some claim was derived from the Greek) designed by a priest in 401 AD.\n\nhhp\n\n"
    },
    {
      "time": "15 Jun 2005 — 9:01am",
      "content": "The Myriad is working well so far. It's also better in terms of space economy than Arial too.\n\nAny suggestions for a particularly good Hebrew face?\n\nwhen it comes to the other alphabets, I am pretty clueless about the subtleties that make them good or not. Arial Unicode supports quite a few so that's what we're using for the moment, but I have to imagine there are much better faces out there.\n\nHelps me understand how the general population views typefaces.\n\n"
    },
    {
      "time": "16 Jun 2005 — 7:16pm",
      "content": "Hi Eric,\n\nFor Korean, try AppleGothic that comes with OS X or Dotumche with Windows. I would not recommend Arial Unicode MS in setting the language. Also try the following sites for some other Unicode fonts:\n\n1.  \nDavid McCreedy's Gallery of Unicode Fonts [www.travelphrases.info/fonts.html](http://web.archive.org/web/20130821083951/http:/www.travelphrases.info/fonts.html \"www.travelphrases.info/fonts.html\") would allow you to view some of Unicode fonts that are available. It might confuse you more as some of those fonts enlisted could be pretty ugly for the eyes of native typographers, but still very useful and helpful.\n\n2.  \nAlan Wood's Unicode Resources [www.alanwood.net/unicode/fonts.html](http://web.archive.org/web/20130821083951/http:/www.alanwood.net/unicode/fonts.html \"www.alanwood.net/unicode/fonts.html\") is a very good compendium page for Unicode fonts. However, there is no sampling.\n\n<cite>Helps me understand how the general population views typefaces.</cite>\n\nIsn't it wonderful... It would be also very interesting if you could list all those names of typefaces that you carefully choose for all those different languages as an end note...\n\nHave fun.\n\n"
    },
    {
      "time": "21 Jun 2005 — 8:26pm",
      "content": "<cite>Any suggestions for a particularly good Hebrew face?</cite>\n\nWell, from the Hebrew Wikipedia is a list of Hebrew Font designers.  \nSome of them are :  \n1. Y. Mendelsson at [http://www.mendelsson.co.il/yakov/myfonts.htm](http://web.archive.org/web/20130821083951/http:/www.mendelsson.co.il/yakov/myfonts.htm \"http://www.mendelsson.co.il/yakov/myfonts.htm\")  \n2.Ben's Foundry at [http://hafontia.oketz.com/](http://web.archive.org/web/20130821083951/http:/hafontia.oketz.com/ \"http://hafontia.oketz.com/\")  \n3. Oketz Fonts at [http://www.oketz.com/fonts/all.html](http://web.archive.org/web/20130821083951/http:/www.oketz.com/fonts/all.html \"http://www.oketz.com/fonts/all.html\")  \nI think that these are all free fonts, which should make it a bit easier for your project. Good luck!\n\n"
    },
    {
      "time": "22 Jun 2005 — 10:34am",
      "content": "Ok, so I need a couple more choices for the main typeface. Myriad is a no go for now, even though it is perfect for the project. Don't ask.\n\nI guess I really only need a face that supports Latin, Cyrillic and Greek since this makes up about 95% of the text on the project. That is the main issue right now. Generally the company uses Trade Gothic on most of its stuff, so I'd like to find something close to that.\n\nThanks for all the replies for other scripts. I'm checking those out as well.\n\n"
    },
    {
      "time": "22 Jun 2005 — 11:11am",
      "content": "We are actually using Apple Gothic for the Korean.\n\nI'll put up a list of the faces we used in a couple weeks when all is finalized. I'm going back and trying to find some better ones now. Also we were going to use a latin alphabet for cherokee (which is how most cherokee is written nowadays I believe) but I found a Cherokee face that should work pretty well.\n\nthanks for the suggestions, also. the resources are excellent\n\n"
    }
  ]
}
