{
  "id": "13117",
  "title": "Searching system-wide for FOND IDs",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Oh type gurus, might you be so good as to offer your suggestions for an application which I might employ to search our voluminous company font archive for bitmap and font outlines with matching FOND IDs?\n\nBack in the day, _Font Reserve_ used to be the bees knees for extracting such information but these days it misbehaves terribly (at least on my system). _Suitcase_ doesn’t offer the option of searching for FOND ID, and neither does _FontAgent Pro_.\n\nI have recently employed Morrison SoftDesign’s _Font Doctor_ to bring order to our collections, but it doesn’t pay much attention to the differences between fonts of the same name from different foundries, opting to simply keep one copy of a font of a particular name. I am left thinking if only Font Doctor could build its archive in a similarly robust fashion to the Font Reserve of yore (ie: same-named fonts neatly stowed in folders named after their foundry), then I would be sure that my bitmaps paired with my printer fonts.\n\nAs it is, I’m left chasing around my Mac for fonts with matching IDs to better ensure compatibilty. (Please tell me I’m doing right in this respect?!)\n\nKeeping abreast of the licensing of our company font assets is proving a vast undertaking, so if you feel a particular application really cuts the mustard when it comes to building accurate font collections, I’d be extremely inerested to hear about it!\n\n [‹ ATypI Helsinki - Looking for a roommate](http://web.archive.org/web/20080828043028/http:/www.typophile.com/node/13107 \"Go to previous forum topic\") [The Digital Curtain -or- Will you stop staring please and say something?! ›](http://web.archive.org/web/20080828043028/http:/www.typophile.com/node/12574 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080828043028/http://www.typophile.com/user/2060\" title=\"View user profile.\">oddjobboy</a>",
  "time": "<br>",
  "uid": "2060",
  "comments": [

  ]
}
