{
  "id": "13122",
  "title": "Building up a new Foundry/Font Distributor: Typenation",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I'm thinking on building up a small Foundry/Font Distributor web based company for Portuguese/Portuguese comunity Indie Font Developers. Already bought the URL, TYPENATION.com, and I wanted to ask you typophiles what are the legal/comercial aspects I have to start with.\n\nFor instance, is the fonts licence issues a foundry responsability? On myfonts.com what is the process to add up the foundry on the list?\n\nAny help on these issues/warnings is welcome.\n\nJim, from unionfonts.com or Grant from Veer.com, any help would be appeciated :)\n\nthanks.\n\n",
  "author": "adriano",
  "time": "16 Jun 2005 — 4:12am",
  "uid": "1735",
  "comments": [
    {
      "time": "21 Jun 2005 — 8:33am",
      "content": "Is it me, or do I have to post at type ID or design to get attention? :P\n\n"
    },
    {
      "time": "21 Jun 2005 — 9:23am",
      "content": "The issue of font licensing varies. Agfa-Monotype (now Monotype Imaging) distributes all of the fonts at its website under their own license; MyFonts.com distributes all of the fonts at its website under the issuing foundry's license. The important matter to consider here is that, when you \"sell a font,\" you are not actually selling a piece of software, but only a license to use that software.\n\nThe advantage Monotype gains from their practice is that, since they are selling their own licenses, they can determine the selling price (and collect a heftier commission). MyFonts.com merely serves as a sales agent, and collects a smaller commission.\n\nWithout going into details, let me say that, personally, I do not intend to renew my distribution agreement with Monotype when its current term expires, but will continue with MyFonts.com as long as they'll have me.\n\n"
    },
    {
      "time": "21 Jun 2005 — 9:58am",
      "content": "Thanks Oldnick. So basically I want to distribute fonts, and the designer make their prices just like Myfonts. And this way I can add my foundry on myfonts under the same conditions.\n\nAnything important to add/think?\n\n"
    },
    {
      "time": "21 Jun 2005 — 11:35am",
      "content": "Liability laws differ from country to country, but it would me a good idea in your distribution agreement to have a clause that shields you from indemnity in the event that one of the foundries that you represent is sued.\n\n"
    }
  ]
}
