{
  "id": "13129",
  "title": "Logo IT company",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "What do you think of this one?  \nIt's for a company called Telindus. I threw away the \"e\" , just like in T Mobile.  \nThe 3 arrows represent different IT problems that can be solved by them obviously. Maybe it's too heavy, anyone...?\n\nK.\n\n| Attachment | Size |\n| --- | --- |\n| [T-LINDUS.jpg](http://web.archive.org/web/20131019075002/http:/typophile.com/files/T-LINDUS.jpg) | 24.72 KB |\n\n",
  "author": "krisdisk",
  "time": "16 Jun 2005 — 8:14am",
  "uid": "7725",
  "comments": [
    {
      "time": "16 Jun 2005 — 9:03am",
      "content": "Hi!\n\nFirst impressions - I like it. It's clean, modern and polished.\n\nBut...  \nI'm unsure about changing a company name - if they've already bought the domains etc., and registered the company under the 'Telindus' name, then it's probably unfeasible to alter it. Also, the T-Mobile comparison seems a bit askew - The 'T' almost certainly stands for something, but the company is universally known as T-Mobile and isn't dropping letters to accommodate a hyphen for stylistic reasons. It's very problematic to change names because of the confusion it could cause to new & existing customers and possible financial implications for the company. If you're in at the inception stage of the company (your post doesn't say if it's a new company or a existing company that's rebranding) and nothing's set in stone then it might be worth looking at a new name - for what it's worth I like both names, persoanlly I'd stick with 'Telindus'.\n\nAside from this, I'm concerned about the light colour you've used - light blues can 'hide' when photocopied, so they'll disappear on photocopied sheets.\n\nI hope this helps - it's looking good!\n\nSimon\n\n"
    },
    {
      "time": "16 Jun 2005 — 10:01am",
      "content": "I think I agree with Simon. My first impression is that it'snice. But I'm not sure following T-Mobile is a good move. Also, I think the weight of the words may be too light, especially at smaller sizes.\n\n"
    },
    {
      "time": "16 Jun 2005 — 11:30am",
      "content": "i agree and agree...you should try making smaller variations of this mark at say, 75% and seeing how it translates. i'd guess that face becomes too thin. maybe using a more regular weight instead of a lighter weight (if it's available) would solve a problem.\n\ni dont mind the light blue in the mark, but for the lettering, i agree with simon, it might be too light in small instances. maybe using the black (typical) or if youre set on these colors, you can try using the maroon. darkening the blue a bit is an option as well.\n\nthe actual mark is nice too but something feels unstable. something with angles i think. the outer angles are close to the the inner angles of the arrows but not the same so it's making my eyes kinda move in strange directions. (if that makes any sense) you could try color placement changes as well. maybe the red at the top looks better than the black, and the black could go to the right.\n\ni'm just throwing out ideas here and playing devil's advocate. it's lookin pretty good in my opinion...i just dont like that 't' thing. not my cup of tea and it doesnt seem to make much sense. plus the letter looks strange with the lindus letters. something looks wrong. i'm not a fan of the dot seperator either. i think a dash would make more sense if you stuck with it\n\nw|m\n\n"
    },
    {
      "time": "17 Jun 2005 — 12:39am",
      "content": "These are all very good reasons to work on it some more. This is the first of many sketches I made, this one I finetuned a bit obviously.  \nThe T Lindus indeed is not a good solution, I admit.  \nThe comments all make very good sense guys. Thank you. I'll post the final result in a few days, asking for your opinions ok? Cheers\n\nK.\n\n"
    }
  ]
}
