{
  "id": "13144",
  "title": "Art Nouveau Lettering",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello!\n\nI'm trying to create some lettering for a logotype. I didn't _art direct_ this, so the concept isn't at all mine - I'm just an intern trying to create something \"from scratch\" that will stop my superiors from simply typing the word in a font they like, converting it to curves and saying \"that's it!\" (and don't even get me started on the name itself).\n\nIn any case, it's supposed to say \"19th century\"(very vague I know) so I went for a late 19th century art nouveau feel.\n\nI'm looking mostly for advice on letterforms and spacing, and maybe pointings to historical references. As I said, the direction/concept isn't mine and I can't really change it.\n\nI've included three variations for comparison. Top one includes a \"ligature\" that in my opinion looks nice but I fear it may be too hard to read.  \nI like the middle one better but the space in TA and AL seems too uneven; I tried spacing everything to see if it got better (bottom) but it didn't, really. Plus the letterspaced version looks weaker.\n\nOkay, I've said too much already, thanks for any advice or comments ;)\n\n| Attachment | Size |\n| --- | --- |\n| [STALL2.pdf](http://web.archive.org/web/20131023113834/http:/typophile.com/files/STALL2.pdf) | 22.9 KB |\n\n",
  "author": "gabrielhl",
  "time": "16 Jun 2005 — 7:59pm",
  "uid": "5081",
  "comments": [
    {
      "time": "17 Jun 2005 — 5:50am",
      "content": "In my opinion the LL ligature is not only hard to read; it creates a strong imbalance between the \"black\" and the \"white\". A better alternative for a LL ligature is to \"stack\" one \"L\" into the other.  \nOut of the three variations the middle one is the best. But the spacing does look uneven; try to positively track the TA pair. The space between \"T\" and \"A\" should be slightly larger than the space between \"A\" and \"L\", because of the horizontal stroke on \"T\". And finally, the \"S\" needs work; the curves are too irregular.\n\n"
    },
    {
      "time": "17 Jun 2005 — 6:53am",
      "content": "I don't think your type choice is very [Art Nouveau](http://web.archive.org/web/20131023113834/http:/www.nga.gov/feature/nouveau/exhibit_intro.shtm) I think you need to incorporate a more florid organic assymetric feel.  \nTim\n\n"
    },
    {
      "time": "17 Jun 2005 — 8:32am",
      "content": "Eduardo, _obrigado pelos comentários!_\n\nTimd, I agree that it isn't very Art Nouveau, but that's not my intention. It's more of an influence than an attempt to recreate that period's style.\n\nThe faces on your link may be more historically accurate, but they're too \"caricaturized\" for what I need. Thanks for the link, though, has some nice examples.\n\n"
    },
    {
      "time": "17 Jun 2005 — 1:16pm",
      "content": "If you intend to perservere with your design, I recommend the spacing in the third option, but you will need to work on the S start with a more symmetrical shape and develop the smaller top from that and work on the modulation of the stroke. I think that as a logotype it needs something to pull it together to stop it looking like a word, you have a strong shape in the bar of the A, the style of the 19th century would be reinforced by something enclosing the whole or the kind of gradation that an engraver would produce.  \nTim\n\n"
    },
    {
      "time": "17 Jun 2005 — 2:14pm",
      "content": "Tim, thanks for your input. I should have been more careful with my words - it's not really a logotype in the normal sense of the word; it's a product name to be applied on packaging. So I'm hoping it'll gain a lot of strenght from the context. The good thing of analyzing it out of such context, I suppose, is that it has to stand by itself and be good just like that.  \nAnd you're right that it needs something to make it more of an image and less of a word. Again, thanks. When I have something relevant I'll post a link here (I still have to show it to my boss to see I should keep going or not!) :)\n\n"
    }
  ]
}
