{
  "id": "13142",
  "title": "Tonights Title Bout!!! | Auto vs. Vista — who wins?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Which font, Auto by Underware, or Vista by Emigre, would reign as a superior sans serif for a magazine? Please list pros and cons and who wins. I’ll be buying the champion tomorrow for our alumni magazine redesign. Thanks!\n\n [‹ PDF's ..Can you change text in a document?](http://web.archive.org/web/20071126054811/http:/typophile.com/node/12994 \"Go to previous forum topic\") [What is a good font to represent freezing and quickness? ›](http://web.archive.org/web/20071126054811/http:/typophile.com/node/13061 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071126054811/http://typophile.com/user/7517\" title=\"View user profile.\">bDIN</a>",
  "time": "<br>",
  "uid": "7517",
  "comments": [
    {
      "time": " 16.Jun.2005 2.38pm",
      "content": "Auto. Three Italics.\n\nVista. No OpenType yet. More time needed to set expert characters.\n\nI’d go with Auto myself, even though Vista is a beautiful face.  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20071126054811/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 16.Jun.2005 3.50pm",
      "content": "Auto 1! Auto 2! Auto 3!\n\nAs Dan said, Auto has three wonderful italics – nuff said. :)\n\nAmpersands. This alone should help you with your decision.\n\nThis family can provide you with a lot of flexibility within your design. It contains a nice variety of weights and styles allowing for strong typographic contrast, as well as an extended European character set, if required.\n\nI support Auto, vote today. Did I mention how H O T the third italic is?\n\n"
    },
    {
      "time": " 16.Jun.2005 5.35pm",
      "content": "Auto was one of the five best recent fonts that I  \nsingled out in my April article in Design In-Flight:\n\n[http://designinflight.com/](http://web.archive.org/web/20071126054811/http:/designinflight.com/ \"http://designinflight.com/\")\n\nIn the next issue (due out in July) I will contribute  \npart 1 of a 2-part article about Bloemsma and Legato.\n\nThat said, I’m not nearly a big a fan of Auto#3 as Zara is.  \nBut maybe that’s because I’m not a **gurl**.\n\nhhp\n\n"
    },
    {
      "time": " 16.Jun.2005 5.48pm",
      "content": "it all depends on what “look” you’re going for. if you want something with personality, i’d definately choose Auto. If you want something a bit more subtle, choose Vista. Personaly, i always love to see interesting type in magazines, and i think Auto is absolutely gorgeous. if it were my choice, i’d choose Auto.\n\n"
    },
    {
      "time": " 16.Jun.2005 10.23pm",
      "content": "I haven’t used Vista but I might disagree with Paul on the point about personality... Vista alternates provide plenty in the personality department. I have used and worked with Auto and I love it. The roman is very capable and the italics are stunning. There’s a lot of versatility built in to the different italics.\n\n"
    },
    {
      "time": " 16.Jun.2005 10.39pm",
      "content": "of course every face has its own personality, i just meant to say Vista has a more subdued personality, not quite as lively as Auto’s. But not having actually used either, i will defer to your expertise.\n\n"
    },
    {
      "time": " 17.Jun.2005 7.00am",
      "content": "While Auto’s italics are stunning, I would probably only use them sparingly in the magazine. Sort of a secret weapon to throw out there occasionally. As long as Auto will function as a workhorse typeface for sidebar copy, captions, blurbs, etc., it seems like it could be the right choice. It’s fresh, exciting, critically acclaimed (will be recognized in TDC’s next annual). Any further comments/experiences/advice? Thanks.\n\n[bDIN.com](http://web.archive.org/web/20071126054811/http:/www.blakedinsdale.com/)\n\n"
    },
    {
      "time": " 17.Jun.2005 11.08am",
      "content": "Every font needs a secret weapon. =)\n\n"
    }
  ]
}
