{
  "id": "13145",
  "title": "Fruddy - A self promo logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Aloha!\n\nThis is my first time designing a logotype for self promo. most likely, i will be doing it on the website 1st and then print... wanted to design something seamless and yet simple-looking. Will be creating an animation for \"Fruddy\" in the later stage.\n\nThe colors are not fixed yet but hoping someone here could help me see if the structure of \"U\" or any of alphabets is looking weird here.\n\nWould appreciate if typofiles here could provide me with critqs and comments.\n\nThanks!\n\n| Attachment | Size |\n| --- | --- |\n| [fruddy\\_upload.jpg](http://web.archive.org/web/20131019075216/http:/typophile.com/files/fruddy_upload.jpg) | 16.68 KB |\n| [fruddy\\_sketch.jpg](http://web.archive.org/web/20131019075216/http:/typophile.com/files/fruddy_sketch.jpg) | 25.69 KB |\n| [fruddy\\_1st.jpg](http://web.archive.org/web/20131019075216/http:/typophile.com/files/fruddy_1st.jpg) | 3.95 KB |\n\n",
  "author": "godzi",
  "time": "16 Jun 2005 — 11:45pm",
  "uid": "7872",
  "comments": [
    {
      "time": "17 Jun 2005 — 5:31am",
      "content": "hi-\n\nyou're idea of seamless and simple arent getting through to me. each letter, with the exception of the middle few, seem to be chopped up by little white lines or areas that seperate each letter as if it were on top or below the other letters.\n\nthe color also weakens the idea of seamless and simple i think. the gradient you have going on is loosely depicting depth or dimension. this might not have been your intent but working with the seperation lines from letter to letter, this kind of seems to happen. i dont think using a gradient is going to reinforce your idea of seamless, i think making this one whole mark with no breaks will reinforce that idea better.\n\nalso, the spacing between the R, U and first D is huge and forces the viewer to span that gap. it's a tough problem to deal with...maybe try pulling the top part of the leg of the R (can't remember what that is called) to the left vertical stroke. that will close that space up and since you stretched the Y to become part of the D, why not pull the rounded part of the R into the empty space a little to close it up? not too much, but it might be worth a try.\n\nyou might want to experiment with some a little less high and maybe a little longer. i'd say going thicker or going thinner would be worth trying too. the strokes seem very bland in weight right now and maybe bringing the cap-height down and increasing the width of the mark as a whole will emphasize your seamless quality you are trying to convey.\n\ni do like the fluidity of the shape in the Y though, although i think where it joins the D needs a little work. keep going though, i think it's a good start, i would just start from by losing the gradient and connecting it all together\n\nw|m\n\n"
    },
    {
      "time": "17 Jun 2005 — 6:12am",
      "content": "It looks Muddy, not Fruddy\n\nAs Will says it doesn't read. Make a black and white version that reads then experiment with color. This is especially important if you are working in print. Your current logo in a business card size it won't read.\n\n"
    },
    {
      "time": "17 Jun 2005 — 7:43am",
      "content": "Is Fruddy your name? If not, does the word have any meaning?\n\n"
    },
    {
      "time": "17 Jun 2005 — 9:02am",
      "content": "aloha!\n\nWill/Dan \\> thanks for your kind comments! :) i guess i got to rework on the entire style of the logo. will post something up realli soon!\n\nAlumium \\> Fruddy is one of my names for one of my characters for an animation. I think i am going to work on the logo from the personality of my characters rather than trying to make it look simple and sleek i guess. :)\n\n"
    },
    {
      "time": "17 Jun 2005 — 1:31pm",
      "content": "Godzi, now you have the right idea. Definately have Fruddy design his own look, it will reinforce the illustrations and it will be simplier.\n\n"
    },
    {
      "time": "6 Jul 2005 — 11:52pm",
      "content": "aloha i m back.. :)\n\ni did numerous sketches but i tot i just post this particular one that i really liked. (pls refer to the 1st post, attachment called fruddy\\_sketch.jpg)\n\nI wanted the alphabets 'd', 'd', 'y' to form a facial xpression of my character. i did one initial graphic drawing frm the sketch. (pls refer to the 3rd attachement on the 1st post, called fruddy\\_1st.jpg) i m not too sure abt the eyes in the 'dd's itself, wonder if its too literal?\n\nI m still fine tuning the individual alphabets but kinda of confuse how it shld flow. I know this is tricky cos i am using a tablet to draw this.\n\nPlease kindly share your comments here. Appreciate it.\n\nThanks!\n\n"
    },
    {
      "time": "7 Jul 2005 — 4:22am",
      "content": "godzi, I love the last one with the eyes the y is a smile very cleaver. Very appropriate with the illustrations.\n\n"
    },
    {
      "time": "7 Jul 2005 — 2:00pm",
      "content": "i like the last one where the eyes in the d's make a face with the smile from the y. its fun and witty\n\nthe way the eyes look to the side makes the character appear fun and mischievous. if that is the character of 'fruddy' that would work very well.\n\n"
    }
  ]
}
