{
  "id": "13163",
  "title": "Uppercase and lowercase",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "At the University of Reading in 2000 we never referred to Capital as Uppercase and small letters to lowercase.\n\nThe terms are incorrect and referred to typecases and the placements of the metal slugs.\n\nCapitals is the correct term referring to there Roman roots. And small letters is the only real term for those little versions of the original Capitals.\n\nNow we need to know are they Figures (figgers: UK English) or Numerals?\n\nIt would be interesting to know what the non-english terms are for Capital letters and small letters?\n\n [‹ Apple's Font Tools 3.0](http://web.archive.org/web/20081205034212/http:/www.typophile.com/node/13214 \"Go to previous forum topic\") [Origin of tracking ›](http://web.archive.org/web/20081205034212/http:/www.typophile.com/node/13202 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081205034212/http://www.typophile.com/user/7029\" title=\"View user profile.\">vinceconnare</a>",
  "time": "<br>",
  "uid": "7029",
  "comments": [
    {
      "time": " 17.Jun.2005 1.27pm",
      "content": "pff. Semantics. Boring, dogmatic semantics. pff. ;^)\n\n"
    },
    {
      "time": " 17.Jun.2005 1.33pm",
      "content": "in that case why people say Font and not Typeface?\n\n"
    },
    {
      "time": " 17.Jun.2005 1.38pm",
      "content": ":D Ok. I should add I was _taking the mickie_ with Vince. Sorry. Didn’t mean to sidetrack the conversation.\n\n"
    },
    {
      "time": " 17.Jun.2005 1.59pm",
      "content": "Hold your horses, Vince. There are a lot of expressions that allude  \nto old technology. Tiffany was not really climbing on her high horse  \nabout semantics. So you can say upper and lower case and font and  \nfoundry, even though you are just talking about some code in a  \nprogram. And ’small letter’ ascenders are usually taller than  \ncapitals, so if you want to be nit-picky (nobody actually has to pick  \nnits, lice eggs, out of anyone’s hair, since we’ve got good  \nmedicines!) that horse won’t run either.\n\nI’d like to know about figures vs numerals too, though.\n\n"
    },
    {
      "time": " 17.Jun.2005 2.29pm",
      "content": "Small letters could be _Capitals_ set in 2pt, couldn’t it? :)\n\nAs for the names in other languages, in portuguese we use _maiúsculas_/_minúsculas_ much more than _caixa alta_/_caixa baixa_. My french is rusty, but I think it goes like that, too.\n\n"
    },
    {
      "time": " 17.Jun.2005 2.35pm",
      "content": "Vince the terms uppercase and lower aren’t “incorrect.” Earlier scribal terms were majuscule and minuscule and these are still common in calligraphy. Uppercase and lowercase are printers terms in the sense that the terms are not used before the introduction of printing and do refer to storage and distribution placement. But the words are common usage and definitional. The word type, also a printer’s term, itself was not used to describe “letters” until as late as 1701.\n\n“Capitals” and “small letters” seem less useful in that they are less precise and can refer to other things. University of Reading huh?\n\n"
    },
    {
      "time": " 17.Jun.2005 2.43pm",
      "content": "I prefer numerals, simply because it is more widely understood and has close parallels in so many different languages. Figures seems to have been a specialised Anglo-American typographers term, and awkwardly has other meanings, e.g. diagrams or illustrations in a book.\n\nI prefer uppercase and lowercase to capital and small, similarly, because they are more precise. What’s a ’small letter’? 5pt?\n\nThe best technical terms are majuscule and miniscule, which of course predate typesetting, but they are not familiar to many people.\n\nYes, the terminology of upper and lower derives from typesetters’ cases, but it is widely used outside of the type business and has been for a very long time. It also figures (oh, look, there’s that imprecise word again) in the user interfaces of many applications that non-specialist users employ on a daily basis without difficulty. For instance, my text editor has a ’To Uppercase’ text conversion function.\n\nAlso, while upper and lower clearly refer to typesetters’ cases, we call alphabets that have a functional majuscule/miniscule distinction ’bicameral’. So there is another sense in which our alphabet is ’cased’, that is now independent of the origins of the term; there is for instance some evidence that the Crimean ’palochka’ letter has recently ’assumed case’, i.e. a monocameral letter has become bicameral.\n\n"
    },
    {
      "time": " 17.Jun.2005 2.45pm",
      "content": "\\>nobody actually has to pick nits, lice eggs, out of anyone’s hair, since we’ve got good  \nmedicines!\n\nActually, it is better to nit-pick than douse with pesticide, which is what the active ingredient is in anti-lice shampoo — and the shampoo is not 100% effective anyway.\n\n"
    },
    {
      "time": " 17.Jun.2005 3.08pm",
      "content": "“Capitals” and “small letters”?! How provincial, how base. The ONLY acceptable terms here are Majuscule and Minuscule. Anything else is VERBOTEN, schnell! Pfft on all of you.\n\n\\> I prefer numerals\n\nMe too. “Figures” and “Numbers” have [more] problems.\n\nhhp\n\n"
    },
    {
      "time": " 17.Jun.2005 3.47pm",
      "content": "In math a figure is an entire number (e.g. 5,340 or 210) but each individual digit (e.g. 4 or 7) is called a numeral.\n\n"
    },
    {
      "time": " 17.Jun.2005 3.49pm",
      "content": "\\>douse with pesticide\n\nresisting, resisting, resisting....\n\n"
    },
    {
      "time": " 17.Jun.2005 3.51pm",
      "content": "\\>in math a figure is an entire number (e.g. 5,340 or 210) but each individual digit (e.g. 4 or 7) is called a numeral.\n\nAh ha! the light dawns. Thanks Joe.\n\n"
    },
    {
      "time": " 17.Jun.2005 4.05pm",
      "content": "Once again, a University program (instead of an art school) has come in handy for something.\n\n"
    },
    {
      "time": " 17.Jun.2005 4.42pm",
      "content": "There is a correspondence between upper case and the way pressing the shift key on a typewriter raises the carriage.\n\n"
    },
    {
      "time": " 17.Jun.2005 7.14pm",
      "content": "Fowah guawds sake, it is numbah :-)\n\nChrisL\n\n"
    },
    {
      "time": " 18.Jun.2005 1.49am",
      "content": "In Finnish the commonly used terms are “iso kirjain” and “pieni kirjain”, translated big letter and small letter.\n\n"
    },
    {
      "time": " 18.Jun.2005 2.39am",
      "content": "When I did hand setting the case was always set out uppercase on the right and lowercase to the left with numerals, punctuation and spacing sharing the uppercase side, what is the origin of upper and lower?  \nTim\n\n"
    },
    {
      "time": " 18.Jun.2005 3.34am",
      "content": "After body text was always normally set in Linotype or Monotype, hand  \nsetting was only done for display, and so a case didn’t need to hold so  \nmuch type. So one combined case was used, called in the US the  \n“California job case”. That is what you worked on. But in the days when  \nall type was hand set, the lower case, most convenient to the hand of  \nthe compositor, held the more common miniscule letters, and the upper  \ncase, where he had to reach, the majescule.\n\n"
    },
    {
      "time": " 18.Jun.2005 10.58am",
      "content": "I thought the California job case predates hotmetal. In fact the legend is that it was invented to take up less room on gold-rush-bound wagons...\n\nhhp\n\n"
    },
    {
      "time": " 20.Jun.2005 9.20am",
      "content": "Because I’m Black, I don’t like how that word looks —-\\>”figgers.” I’ll take “numerals” instead. :)\n\n"
    },
    {
      "time": " 20.Jun.2005 2.03pm",
      "content": "It may also depend on whom it is you are speaking with when either choice comes into play. As long as you are not speaking over someone’s head, use the appropriate term accordingly. You and I and other designers, wordsmiths, typographers, etc. may know the difference, but the averge joe (ie: Client) may not care and as long as they get the drift, whether you use the terms “uppercase” or “capitals”, it is all well and good in the end.\n\n"
    },
    {
      "time": " 21.Jun.2005 8.22am",
      "content": "Well when I wrote figures (said figgers in the UK) I was making a small comment about how Americans say (fig-gurs)\n\nThis reminds me of the PostScript name for French quotes: guillemot, (’guillemotleft’) which must come from Linotype since it’s German or the [English name of a bird with duck like feet](http://web.archive.org/web/20081205034212/http:/www.rspb.org.uk/birds/guide/g/guillemot/index.asp), and not French which is [guillemet](http://web.archive.org/web/20081205034212/http:/www.yourdictionary.com/ahd/g/g0305650.html).\n\n"
    },
    {
      "time": " 21.Jun.2005 9.35am",
      "content": "From what I know “guillemot” is a legacy typo.\n\nhhp\n\n"
    }
  ]
}
