{
  "id": "13160",
  "title": "inDesign question...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Does inDesign have a feature which would enable me to control the line lenght? I'd like to be able to control how deep/shallow the rag is.\n\nFor example if I have a paragraph of text which is aligned flush-left (ragged-right), can I specify a maximum rag (or minimum lenght) before it hyphenates?\n\nHow about the same thing in Quark?\n\n",
  "author": "boole",
  "time": "17 Jun 2005 — 11:25am",
  "uid": "1393",
  "comments": [
    {
      "time": "18 Jun 2005 — 8:04pm",
      "content": "I don't know of a setting to set specific limits, but there is a \"balance ragged lines\" option in the Paragraph Palette menu.\n\n"
    },
    {
      "time": "19 Jun 2005 — 3:14am",
      "content": "Boole why not just specify the width of the box containing your type? As for using \"balance ragged lines\" option (it stinks), it makes all the lines short. If the lines have to be a specific length you will have to use a justified paragraph or you will have to manually adjust each line.\n\n"
    },
    {
      "time": "20 Jun 2005 — 6:27am",
      "content": "In Quark there is an option in the H&Js pallette called Hyphenation Zone which works from the righthand margin. It will hyphenate a word when the previous word ends before the Hyphenation Zone and an acceptable hyphenation point falls within the Hyphenation Zone.  \nTim\n\n"
    },
    {
      "time": "22 Jun 2005 — 12:38pm",
      "content": "InDesign has a similar control setting box for hyphenation off the upper right options arrow of the paragraph palette.\n\n"
    },
    {
      "time": "22 Jun 2005 — 10:13pm",
      "content": "The closest InDesign comes to letting you control line lengths in rags is the \"Hyphenation Zone\" settings in the Hyphenation settings (you get to it from the Paragraph or Control palette menu). Words that overlap the \"zone\" that you specify either get hyphenated or bumped down, depending. Hyphenation Zone settings are often overriden by the Paragraph Composer. Thomas Phinney (from memory) said that the multi-line Paragraph Composer softens a rag.\n\n"
    }
  ]
}
