{
  "id": "13161",
  "title": "Scangraphic Fonts. When digitized?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Can anyone shed some light on when the Scangraphic phototype library was digitized? Any history on the foundry would also be appreciated. Thanks.\n\n",
  "author": "James Gareth",
  "time": "17 Jun 2005 — 11:28am",
  "uid": "1797",
  "comments": [
    {
      "time": "17 Jun 2005 — 4:21pm",
      "content": "Very early in 1980. Have a look to their website.\n\n[http://www.scangraphic-fonts.com](http://web.archive.org/web/20120729091248/http:/www.scangraphic-fonts.com/)  \n [http://www.myfonts.com/foundry/scangraphic](http://web.archive.org/web/20120729091248/http:/www.myfonts.com/foundry/scangraphic \"http://www.myfonts.com/foundry/scangraphic\")\n\n-- [astype.de](http://web.archive.org/web/20120729091248/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "17 Jun 2005 — 5:32pm",
      "content": "I've read that statement, which is similar to the one on their website. It seems to imply that their typefaces were developed for phototypesetting (non-digital) beginning in 1980. Is this a correct interpretation?\n\nFurther, were there any digital SG fonts prior to 2004 or was this the first time the SG fonts were digitized?\n\n"
    },
    {
      "time": "17 Jun 2005 — 7:31pm",
      "content": "James\n\nI have a couple of Scanographic digital fonts that are dated 1992 (with their trademark). I think Scanographic was initially analog (of proprietary nature).\n\nGerald\n\n"
    },
    {
      "time": "17 Jun 2005 — 7:39pm",
      "content": "Scangraphic was recently purchased by Elsner+Flake.\n\n"
    },
    {
      "time": "17 Jun 2005 — 9:56pm",
      "content": "1992 ... That's interesting. Thanks for the information, guys. I wonder if there's a list of their entire catalog from 1992 somewhere. Perhaps someone from Elsner+Flake should know. Thanks again.\n\n"
    },
    {
      "time": "18 Jun 2005 — 11:42am",
      "content": "There were Scangraphic specimen books around in the early 1990s. Somewhere I have a set, one with black covers, the other with white. I don’t remember for sure what the difference was, but perhaps one was for the proprietary library, the other for desktop (Type 1) offerings. (Or maybe film and digital.)\n\nLater, the company exhibited for a year or two at either Seybold or MacWorld, and gave away a smaller book of one-line showings of fonts available in PostScript Type 1. (All this is from memory; can’t find the books right now.)\n\nFontHaus used to sell Scangraphic fonts; I have Zapf Renaissance and Today Sans from that period.\n\n-- Kathleen\n\n"
    },
    {
      "time": "18 Jun 2005 — 12:37pm",
      "content": "Current Scangraphic resellers: [FontHaus](http://web.archive.org/web/20120729091248/http:/www.fonthaus.com/products/fonts/list_supplier.cfm/supplier/ScangraphicPrepress/), [FontShop](http://web.archive.org/web/20120729091248/http:/www.fontshop.com/showfont.cfm?mID=22), [MyFonts](http://web.archive.org/web/20120729091248/http:/www.myfonts.com/foundry/efscangraphic/)\n\n"
    },
    {
      "time": "18 Jun 2005 — 9:38pm",
      "content": "Before I contact E&F, does anyone know if they added any fonts to their catalogue when they redid them in 2004, or if they refreshed only existing fonts.\n\nThanks for the additional information, Kathleen!\n\n"
    },
    {
      "time": "18 Jun 2005 — 11:23pm",
      "content": "They've added a few that were off the market, such as Avant Garde Alt.\n\n"
    },
    {
      "time": "18 Jun 2005 — 11:33pm",
      "content": "Writing a book, James?\n\n"
    },
    {
      "time": "20 Jun 2005 — 3:11am",
      "content": "Scangraphic fonts were digitized on Ikaurs equipment in close collaboration with URW in the 1980s. Scangraphic is based in Hamburg, just like Elsner+Flake and URW++, and the activities of the companies are somehow interconnected. Veronika Elsner, now co-head of Elsner+Flake, was the first type designer who worked at URW (she was hired by Peter Karow in 1975 or so). Jelle Bosma (now Monotype Imaging) worked at Scangraphic when the company digitized their type collection. The Scangraphic fonts were converted to Type 1 about 1992 and used to be sold via some channels mentioned above. Since Scangraphic literally abandoned the font business, last year Elsner+Flake has taken over their font collection. They added Euro characters to all the fonts, remastered them, re-issued in Type 1 format and additionally published in OpenType PS format.\n\nAdam\n\n"
    },
    {
      "time": "20 Jun 2005 — 9:44am",
      "content": "Thanks for the great info, Adam! That helps, a lot. No book, Stephen, just some curiosity which then led to some nagging questions which I had to try to get answered.\n\n"
    },
    {
      "time": "20 Jun 2005 — 6:29pm",
      "content": "Am looking for Pointille IMA 307 or IMA 566\n\n"
    }
  ]
}
