{
  "id": "13173",
  "title": "Adobe \"optical\" fonts -- a team effort?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was looking at a sample of Adobe Garamond Premier Pro and drooling a little when I began to wonder, as I have about faces like Minion Pro, whether the Pro fonts are a team effort? I find it hard to imagine one person sitting and drawing a the complete character set not just once for each weight but then adjusting each weight to achieve the finely balanced “optical” fonts. I suppose they could be using multiple master technology to do some of the work, but no matter how much they automate there is far too much for one person to do by hand. Or is there? And if I’m right, who are these people and what other team efforts exist, and if I’m wrong, what team efforts exist?\n\n",
  "author": "<a href=\"/web/20090924021631/http://www.typophile.com/user/5267\" title=\"View user profile.\">grod</a>",
  "time": "<br>",
  "uid": "5267",
  "comments": [
    {
      "time": " 18.Jun.2005 8.14pm",
      "content": "It’s reported that Slimbach has been working on Garamond Premier Pro for more than 12 years.\n\n"
    },
    {
      "time": " 19.Jun.2005 12.44pm",
      "content": "_and if I’m wrong, what team efforts exist?_\n\nAny East Asian font is almost certainly a team effort, simply on account of the size of the glyph set.\n\nI’ve collaborated with other designers on Thai typeface design, and of the non-design aspects of complex script font production are often team work.\n\n"
    },
    {
      "time": " 19.Jun.2005 12.55pm",
      "content": "Many production tasks are often done by individuals other than the designer. Hinting is very often done by others. Some large type family have even been kerned by others.\n\nOpenType feature programming is on other step which is often done by someone else.\n\nOf course, there are many designers who do all of these things on their own as well. It depends on the designer, if he works for someone, and who commissioned the fonts (if the fonts were commissioned in the first place).\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20090924021631/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 19.Jun.2005 4.20pm",
      "content": "where did you find the sample of Garamond Premier Pro? I couldn’t find anything on the Adobe site.\n\n"
    },
    {
      "time": " 19.Jun.2005 5.30pm",
      "content": "Google search [“garamond premier pro”](http://web.archive.org/web/20090924021631/http:/www.google.com/search?q=garamond+premier+pro+sample). Try the first result. It doesn’t _look_ like any other Garamond I’ve seen, so I assume it is a legit sample, though I haven’t investigated the site that hosts it so I don’t know for certain.  \n**edit**  \nHmmm, just took a look at the site hosting the file, and read the actual content of the file instead of looking at the pretty characters. This person is a bit of a looney, still, the sample seems real enough.\n\n"
    },
    {
      "time": " 19.Jun.2005 9.37pm",
      "content": "I wouldn’t trust anything that person says. His articles are only filled with strange vendettas.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20090924021631/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 22.Jun.2005 5.07am",
      "content": "By the way, does anyone of you know about a Garamond Premier Pro release date? Or is it out already (I don’t think so)? There’s nothing on Adobe’s site.\n\nJudging from the character set alone this typeface is a masterpiece! I’m seriously excited about it, lots of weights and optical sizes and a **huge** character palette (eg Greek small caps) Unfortunately, it may not be affordable for ordinary people.\n\n"
    },
    {
      "time": " 22.Jun.2005 6.51am",
      "content": "When you register the CS2 suite, you get it. So, it is alreday out, at least in part.  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20090924021631/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 22.Jun.2005 2.04pm",
      "content": "I did a whole lot of font “editing” with the submissions I processed at T26, from constructing missing glyphs to overhauling or hand-tuning metrics. Many of the releases after 2001 were collaborative to some extent, whether I applied a hands-on effort or verbal feedback for improvements. Some designs were submitted as single weights which were then fleshed out into usable families through a collaborative process. Some submissions were a team-effort before they came in, but the majority were solo endeavors.\n\nFont Bureau puts some team effort into their releases, from what they express in their submission/publishing terms. [http://fontbureau.com/submissions/](http://web.archive.org/web/20090924021631/http:/fontbureau.com/submissions/ \"http://fontbureau.com/submissions/\")\n\n"
    }
  ]
}
