{
  "id": "13181",
  "title": "Use of Diaerisis in name",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "My daughter was born about 3 weeks ago and we're just now getting around to sending out the birth announcements. Being the stickler that I sometimes am, I want to make sure, once and for all, that I understand the usage of a diaerisis in her name. Her name is Chloë. We live in the States and have Canadian heritage.\n\nI researched the diaerisis before naming her and found info in [wikipedia](http://web.archive.org/web/20101227070039/http:/en.wikipedia.org/wiki/Diaeresis) on the mark. It was that info that led my wife and I to want to include it in her name.\n\nOn her announcement, I wanted to include a simple explanation of the diaerisis for people, so I looked it up again. This time I found more info over at the [Diactitics project](http://web.archive.org/web/20101227070039/http:/diacritics.typo.cz/index.php?id=14). Now I'm not sure if we should use it or not.\n\nDoes anyone know the proper use of the diaerisis in english names?\n\nThanks\n\n",
  "author": "<a href=\"/web/20101227070039/http://typophile.com/user/3457\" title=\"View user profile.\">Bouch</a>",
  "time": "<br>",
  "uid": "3457",
  "comments": [
    {
      "time": "",
      "content": "Bouch, as the diaresis is not common in English, your daughter will run into interesting situations throughout her life. Typists of official documents will invariably not know how to enter the ë on their keyboards. They will spell Chloë's name Chloe. This isn't a reason not to name her Chloë, though.\n\në is an ancient abreviation of the ee combination, I believe. The proper way for Chloë to spell her name usung ASCII-only systems would be Chloee. She should be able able to tell people that. Like the DMV attendant, etc.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20101227070039/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "",
      "content": "Dan, I think you're confusing the dieresis with the umlaut. They're different things, even though they are the same mark.  \n\"Gödel\" = \"Goedel\". That's an umlaut.  \n\"Naïve\" contains a dieresis, which simply indicates that the two vowels should be pronounced separately instead of as a diphthong. It's not supposed to be \"naieve.\"\n\nAmerican official documents tend to disregard all diacritics, and using them is up to the individual, just as pronunciation is. A person can suddenly decide to start writing their name with an accent at their own discretion, without getting any kind of official name change.\n\n"
    },
    {
      "time": "",
      "content": "But isn't an umlaut just one sort of dieresis?\n\nnaïve is pronounce \"nai-eve\", the \"ï\" is broken into two sounds, \"ai\" and \"ee\". With the dieresis, naïve would be pronounced \"nive\" (naive… \"ai\" usually sound like a long i)\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20101227070039/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "",
      "content": "No, a vowel with an umlaut is a distinct letter, which is always written that way regardless of context. It is pretty much limited to the orthographies of some Germanic language. In all other languages I can think of, the two dots indicate a diaeresis, which is placed above the second vowel in a two-vowel sequence to indicate that they are pronounced independently and not as a diphthong or compound vowel (e.g. coöperation, a spelling that has fallen out of use in English). Since you're living in Germany, I'm not surprised that you are confused :)\n\nI suspect that the diaeresis originated in Greek texts, where it is known as dialytika, and distinguishes e.g. εϊ from the diphthong ει\n\nChloë and Chloe are both accepted spellings in English. Many people will consider the diaeresis optional, so your daughter can probably get through life using either spelling.\n\n"
    },
    {
      "time": "",
      "content": "I stand corrected :-)\n\nBouch, if your daughter becomes an artist or designer, she may be thankful that you put a diaeresis in her name. It offers so many possibilities.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20101227070039/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "",
      "content": "The indication of \"Umlaut\" and the \"diaeresis\" had been different forms of sign before:  \nThe Umlaut consists of two strokes. As I read somewhere (maybe here?) it roots from a small \"e\" written in brokenscript (formed like an \"11\") over the umlaut base character. The german word \"Umlaut\" means \"a change in the sound\".  \nThe diaeresis obviously always had been two dots - indicating two different sounds. The greek word \"diairesis\" means \"splitting up, dividing, cutting up\" (and it belongs to same field as \"heretic\" meaning division that separates from the others).\n\nSo confusion of both is only coming from the reduction of the two strokes to two points.  \nAs german language for a long time has been associated and developped in brokenscript (with strokes) and on the other hand latin script evolved without a sign for \"umlaut\" the confusion began, when the two strokes where taken from broken script to latin script and interpreted as points.\n\n"
    },
    {
      "time": "",
      "content": "We named our daughter Zoë. She's an adult now, but as a child she always enjoyed putting the two dots above the e. In handwriting, and by keyboard.\n\n"
    },
    {
      "time": "",
      "content": "Good. We'll keep it then. It doesn't really matter to me if most people won't bother with the diaerisis. And she can choose to use it, or not, when she's older. I've seen the name Chloë with and without the diaerisis and people still seem to pronounce it correctly. Like \"coöperation\", I never realized before that \"cooperation\" was technically wrong, yet, it's so accepted. Funny. Hopefully she'll grow up to enjoy and appreciate the special mark in her name.\n\nThe trick is explaining to people how to type the diaerisis on a Windows system. It's amazing to me that _they_ (the big M…) made using diacritics so obscure and complicated. Come on!\n\nThanks for all your feedback.\n\n"
    },
    {
      "time": "",
      "content": "Interesting discussion, which strangely seems to have missed one important aspect of your question altogether:\n\nCongratulations on the birth of your daughter. All the best to you and your family! ;-)\n\n"
    },
    {
      "time": "",
      "content": "strangely indeed - the most important aspect!\n\nCongratulations and best wishes on the birth of Chloë!\n\n"
    },
    {
      "time": "",
      "content": "Thanks!\n\nAnd if anyone is interested, [some pictures](http://web.archive.org/web/20101227070039/http:/chloe.sillyoldme.com/).\n\n"
    },
    {
      "time": "",
      "content": "Wow you guys are great, I am in exactlky the same situation as Bouch, and you almost answered all my questions which are like Bouch's. My only question now is, I just noticed some are spelling Chloe with an acute accent. What pronunciation does that produce?\n\n"
    },
    {
      "time": "",
      "content": "It indicates that they understand the name as coming via the French language. I don't think that will make any difference in US pronunciation ;-)\n\nAndreas (or Andrëas, if you like)\n\n"
    },
    {
      "time": "",
      "content": "The ¨ character really needs a more generic name along the lines of 'double dot’. Umlaut and Diaeresis both indicate a particular function, so don't serve particularly well as a name for the accent itself. They also don't exhaust the list of functions served by this particular diacritic, since the n̈ character used in Malagasy and Jacaltec denotes neither umlaut nor diaeresis. And Jacaltec n̈ has entirely distinct function from the n̈ in ‘Spın̈al Tap’ (which I assume is proncounced [spaɪ̯nəl] rather than [spɨŋal]).\n\nSince English too suffers from umlaut, I propose we start spelling words like ‘geese’ as ‘gööse’. This would not constitute an appreciable orthographic improvement, but it would force English speakers to learn how to type diacritics.\n\nAndré\n\n"
    },
    {
      "time": "",
      "content": "One of our local congresscritters (16th dist. CA) goes by the name Zoe, without a dieresis, and prefers the pronunciation \"zō\". For some people, it matters.\n\n"
    },
    {
      "time": "",
      "content": "America needs more diacritics. If so no other reason than to let American type designers see all that work put to use.\n\n"
    },
    {
      "time": "",
      "content": "FWIW, when a dieresis is used in what would normally be an English diphthong, it is meant to indicate the the second letter is pronounced: e.g., coöperate is pronounced co-operate rather than cooper-ate. In your example, the name is pronounced C(h)lo-e rather than clue, as in shoe, or cloe, as in sloe.\n\n"
    },
    {
      "time": "",
      "content": "I am a Finn, and in my language a and ä are individual letters, as are o and ö. But in Latin filology, like John said earlier, I've been thaught that dieresis is used as an emphasis, or as a hyphen. Apart from German umlaut u, which is pronounced as y.\n\nI am not a scholar, but this is my two cents worth.\n\n"
    }
  ]
}
