{
  "id": "13197",
  "title": "Windsor Freezer Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "This is some logos I've been putting together this morning for a company that offers refridgerated storage. They mainly do food, like fish, meat, produce, etc. and specialize in making quick transactions (i.e. getting the good in and out of the warehouse as quickly as possible. They wanted a clean logo (to symbolize clean place with and fresh food) that was blocky, cold/frozen as well as quick. Here are some things I came up with. I'm having trouble coming up with a mark or an actual logo for them. I think the type I use (FF Trademarker, suggested by eben\\_sorkin) was the best fit, although I tried 20 or so others that were okay. I'd appreciate any advice you could provide. Thanks!\n\n| Attachment | Size |\n| --- | --- |\n| [windsor-freezer-logo2.jpg](http://web.archive.org/web/20110403051403/http:/typophile.com/files/windsor-freezer-logo2.jpg) | 15.93 KB |\n\n",
  "author": "<a href=\"/web/20110403051403/http://typophile.com/user/5212\" title=\"View user profile.\">mystic</a>",
  "time": "<br>",
  "uid": "5212",
  "comments": [
    {
      "time": "",
      "content": "Just for fun\n\n[example ( fixed )](http://web.archive.org/web/20110403051403/http:/www.eyebytes.com/wfreezer.gif)\n\nI think the designs you posted have the right feeling but they are a bit overly complicated. I like to see simpler designs. Actually, if the company in question did any advertising the logo could be even simpler like a curving ice skate path making a W and then a F. With advertising a simpler logo can make sense.\n\nIf you think about it the apple logo for instance makes no sense at all - but it is distictive & with advertising & exposure distictive is enough.\n\n"
    },
    {
      "time": "",
      "content": "I would say that the apple logo makes a lot of sense. It's an apple. However, the type you've chosen just seems too hokie. Try something tighter cleaner. Maybe use a blur effect on part of it to make it look like you're looking through ice at the logo. Get creative and really think differently. Think about what the company does. They don't freeze things, they provide longevity. They provide extended life. Get extremely abstract. Get so abstract to the point where the next day you look at your work and don't even remember what you were thinking or what it's supposed to represent. When you get to that point, bring back a to the literal a little bit more and you'll find yourself in the perfect situation for an outstanding trademark.\n\nP.S. If you have't thrown your tablet across the room in a fit of frustration, you're not done yet. If you're not using a tablet, I'm going to cry.\n\nJoseph Szala  \nPrestidigitator Extraordinaire\n\n"
    },
    {
      "time": "",
      "content": "Spend time in a freezer. Taste some glacial ice. Wear a polar bear suit. But don't forget that tablet... okay just kidding.\n\nWhat if the logo was a broken icicle?\n\nActually it might be fin to give them a mascot that wears a parka. Maybe thats too much south park - or maybe the michelin man is whispering in my ear that he has a cousin that needs work too.\n\n"
    },
    {
      "time": "",
      "content": "I like number 3 in the first GIF, its commercial, simple, and says cold without going over the top. This is a case where you shouldn't over think the process.\n\n"
    },
    {
      "time": "",
      "content": "Four or more rotated w's put together make a snowflake (a stylized version of nr 3 in the first .gif); the standard symbol for freezer.  \nan idea to pursue?\n\n"
    },
    {
      "time": "",
      "content": "Hey guys. Thanks for the comments so far. I've been working a few more logos so I posted those up here. I actually really like the Trademarker Fat font that I used. I've tried several others that I own but Trademarker speaks \"cold\" and \"speed\" the best. It looks fairly unique too since I haven't seen it used in logos before.\n\nI tried to incorporate the rotated W's to make a snowflake but everything I came up with looked complicated or you couldn't see the \"W\" anymore in it.\n\nI like the leaf because it's simple, although I don't like the leaf itself. If there was another small, simple shape like that, I think it would look great. Anyway, you can see that in the 4th gif file.\n\nI put up another logo that uses the infinity symbol to represent longevity. It looks okay, but it's too big. I tried using a serif font with small caps to give the same effects as the bolder types, but I'm not very impressed with that one. It does kind of look like mountains or hills and has the shape of the W in it too though.\n\nThe company is pretty concerned with getting something that's corporate looking, because they have a lot of major clients (mcdonalds, costco, outback stakehouse, maple leaf foods, etc.) They want to look credible and large to those clients and not like a smaller owned business. So finding something that's clean and simple that conveys this is really important. That's why I want to avoid blurs and other overly \"creative\" effects. Also, their refrigerated systems are very clean and they keep food fresh, so the logo should have this built in indirectly.\n\nAnyway, I remember there was this Canada Bread logo that was fantastic, so I'm going to try and do something similar to represent storing food/longevity with the letters 'W' and 'F' instead of 'C' and 'B' and see how that goes.\n\nThanks again for your comments. I'll keep the logos coming.\n\n"
    },
    {
      "time": "",
      "content": "Dan, I agree with you. Do you think Serpentine is better than the TradeMarker font in this case, or did you just like the slanted snowflake I drew?\n\nI'm not sure I really like the snowflake itself though. I'm not the best artist in the world, so maybe there is a better way to get a more unique snowflake that meshes with the font better. It seems kind of separated to me... like it doesn't click into the type as if it was one entity.\n\nMaybe I'll try to draw some more interesting snowflakes and see where that goes.\n\n"
    },
    {
      "time": "",
      "content": "Why not just do a google search for \"snow flake images\" and use an image you find as a template for your illustration. It doesn't bother me that the snow flake isn't directly tied into the words. People will get it. Remember don't over think this logo it doesn't need it.\n\n"
    },
    {
      "time": "",
      "content": "Okay, I'll try doing that. I just want something that fits what someone would expect to be a logo and just not a graphic.\n\n"
    },
    {
      "time": "",
      "content": "Heh... I found this site. You can make your own flakes and save them as eps files :)\n\n[http://snowflakes.lookandfeel.com/](http://web.archive.org/web/20110403051403/http:/snowflakes.lookandfeel.com/ \"http://snowflakes.lookandfeel.com/\")\n\n"
    },
    {
      "time": "",
      "content": "These are really nice - some of them. What about a retro thing with a windsor in an arc above the snowflake with freezer written across?\n\n"
    },
    {
      "time": "",
      "content": "Which of the logos do you like the most eben\\_sorkin?\n\nI'm not certain the retro looks is going to work for this client, so I've tried to stay away from that. This is an industrial corporate client and they want to be represented as something modern and they are looking for a logo that will last them for the next 30 or 40 years. Their clients are also corporations, not individual consumers or anything like that. To me, retro looks out-dated and competes with the image they are trying to convey. Maybe if I saw an example of what you had in mind (like a modern retro feel) I could invision what you mean.\n\nAlso keep in mind that I am not a graphic designer or typographer by any means. I'm merely an amateur and this is basically the 3rd logo I've worked on in the last year. I'm actually a software developer.\n\n"
    },
    {
      "time": "",
      "content": "Hmm - that makes this deeper to be sure. I think you have done admirable work so far given your background then. To be honest I don't LOVE any of the examples posted so far. I wouldn't use any of them so far - given a choice. I would want something simpler. For 100 reasons. Longevity is certaily one of them.\n\nI did want to encourage you. It is a process. I love logo & identity design. But it's like writing a haiku. A good final solution needs to be short & evocative.\n\nHow long a time period did you negotiate? If they want something that will last then they need to give you enough time to work something out that is a quality logo.\n\nIf you are in a hurry though I would look for a Snowflake that reads well - maybe a fat version of the universal snowflake the site uses before it shows us the actual designs. A snowfalke says frozen which is good. It mean that you just have to deal with the type - one problem down and all of that...\n\nIf you have some time I would take a little of what vigorgraphics said seriously. I would sketch ideas & do research. Let your mind wander & see what pops in for a visit. See what other folks have done in the past & see if you can think of an inventive way of riffing off of what you like.\n\nIn the meantime I have yet another idea - okay several. What if you had a snowman character? Old fashioned I know but there are ways of making old good too. What if you used icecubes & cut W & F into them? Minimal. Modern. What if There was one cube & the w was written in water & the F was the cube? Also mordern. Maybe too cute. What if you built W & F out of brioken icicles? Sort like andy goldsworthy. Know his stuff? Could be quite strong. What if you have a hole cut in ice & there was an F fishing with a W? Maybe too cute again. Maybe not. What if the logo was Windsor freezer written by hand on Frosty glass? Very modern - hard to reproduce well in all media.\n\nSo maybe you had better say how the logo would be used. On trucks? Or just letterhead?\n\nAlso Windsor Freezer is so 20th century. That's half of the problem. You are are working with iffy materials in some ways. Espcially if the new direction is meant to be modern. Maybe you should pitch to change the name of the company too. Two word names & especially two words with locality in them are not really part of the global progresive business branding mindset. And a name change with a logo change could be just the ticket.\n\nOn the other hand a solid retro treatment would match the retro name.\n\nIf you want - contact me & I will talk to you about it.\n\n"
    },
    {
      "time": "",
      "content": "I like 1.4, with the thermometer marks on the F. If you end up going with any of the Trademarker variations, make sure the oblique angles of \"Windsor\" and \"Freezer\" match; right now they're slightly off.\n\n"
    },
    {
      "time": "",
      "content": "Companies don't last 30 or 40 years and Idenities change often. What you think is timeless now will be outdated in 5 years. I promise you that. What you need to concentrate is what is needed now. Windsor might not even in that line of business in 5 years.\n\nWhat ever you do keep it simple. Remember your client probably doesn't have so much money to market the logo like an IBM to make it memorable to people other than direct clients, and they don't care how the logo looks, only how their service works.\n\n"
    },
    {
      "time": "",
      "content": "I would recommend that you alter the shear on your lighter weight oblique to the same angle as the heavy oblique – I think that's one reason why the Serpentine worked well. The mountain should be improved by using the pallette you have rather than just one colour and the basic shape I don't think the curvy horizon is really relevant. The snowflake, if you choose that option, should be simpler in design as per 5.2, though it might be worth looking at a non-sheared version.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Have you thought about making the 'W' into a mountain? Like using the negative space under the 'W' for the mountain top.\n\nFrom what you've posted so far I prefer the second one in #2. The font looks professional and corporate. The others that you've got look too 'cool.' The fonts in #1 look like something you'd see used for a skateboarding company or on a Mountain Dew can.\n\nI know it can be frustrating at this point in the process, but keep at it and when you're done you'll have something you can really be proud of.\n\n"
    },
    {
      "time": "",
      "content": "I was looking over the art again today & I have to say the type on #3 seems like a good match. Sorry about some of my earlier comments - I hadn't noticed the new work that had been posted. I assumed incorrectly that new work would be in later posts.\n\nI would even consider just using #3 with no supporting graphic. They key thing would be to space the letters more carefully.\n\n"
    },
    {
      "time": "",
      "content": "On the new snowflake versions, the third one looks like a flower. I agree they should be a very simple shape. If you go with the mountains concept make sure it doesn't look like a smiling face.\n\n"
    },
    {
      "time": "",
      "content": "Well, thanks for your input everyone. I decided to drop the flowers altogether and the client had me do a bunch of mountain ones. I didn't send them here though, but I put up the final logo he selected. I was wondering if there was anything else I could do to improve this one but to keep it more or less the same. I kind of like it too and it's probably the best of the bunch that I showed here.\n\n"
    },
    {
      "time": "",
      "content": "I like the shadow created on the Evian logo but the mountain is too jagged in my opinion ( [http://www.ferraud.com/france/pro/TISTRA/Tistra%207438.html](http://web.archive.org/web/20110403051403/http:/www.ferraud.com/france/pro/TISTRA/Tistra%207438.html \"http://www.ferraud.com/france/pro/TISTRA/Tistra%207438.html\")), I'm not suggesting that you follow the style entirely but using your pallette of light and dark blue you should be able to avoid the outline aspect of it – possibly light blue as sky, dark blue as deep shadow/rocky outcrop everything else is snowy mountain or light blue shadow, dark blue rock snowy mountain. Also the shear on the type doesn't look equal to me.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "I agree with timd's comments about the mountains in general - I still don't know that the mountains help as they are, I find them distracting. I made these for fun:\n\n[\\* example1 \\*](http://web.archive.org/web/20110403051403/http:/www.eyebytes.com/wf1.jpg)  \n [\\* example2 \\*](http://web.archive.org/web/20110403051403/http:/www.eyebytes.com/wf2.jpg)\n\nI also think the type would work on it's own too.\n\n"
    },
    {
      "time": "",
      "content": "BTW - I think the effect in the 2nd one could be done with flat color - it would take some cleverness but it could be done.\n\n"
    }
  ]
}
