{
  "id": "13202",
  "title": "Origin of tracking",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello everyone,\n\nin a brazilian typography discussion group we’ve been talking about typographic terms and how we use so many english terms like kerning, tracking, leading, etc. When trying to translate, we often run into the problem of not fully understanding the english term. One word we have some trouble translating is _tracking_. Although we all understand what tracking “does”, I was wondering if anyone knows the origin of this term and any synonyms it might have. I’ve tried a dictionary but no luck.\n\nThank you!\n\n",
  "author": "gabrielhl",
  "time": "20 June, 2005 - 2:17pm",
  "uid": "5081",
  "comments": [
    {
      "time": " 20 June, 2005 - 9:10pm",
      "content": "My recollection is fuzzy, but may be of use anyway.\n\nSome old photosetting machine (I’m thinking Compugraphic MCS, but may well be mistaken) used a mechanism for controlling letterspacing that was, in some ways at least, more sophisticated than what we have now. Instead of one horizontal spacing value each for left side bearing, right side bearing, and kerning adjustment (per letter pair, in a big table), these values were stored in some number of tracks. I’m vaguely recalling 9, arranged something like: touching, very tight, tight, slightly tight, normal, slightly loose, loose, very loose, and h e l l a &nbsp; l o o s e. These values could be individually adjusted by the typeface designer. For example, “no” and “on” pairs in a serif face would be brought a lot closer together in the touching track than “nn” and “oo”. In any case, I believe the word “tracking” was used to refer to selecting a track, probably in parallel with “kerning”.\n\nWhen desktop publishing happened, fonts didn’t actually have separate tracks for spacing information, but you could fake the overall effect (loose or tight letterspacing) just by adding or subtracting a constant amount of space between each letter pair, in addition to the side bearings and kern pairs. It was arguably sloppy language to call this setting “tracking,” but it seems to have stuck.\n\nIn the Star Trek future, we may get the sophistication of 1970’s phototypesetting machines back, and once again have fonts with more intelligent spacing info, probably around the same time optical scaling once again becomes the standard as it was in the metal days. Then, I’m sure the marketing people will have to invent a new word to distinguish it from the constant spacing offset known as “tracking” in common usage.\n\nHope this helps, and I’d be curious to see what you end up with for the Brazilian translation.\n\n"
    },
    {
      "time": " 21 June, 2005 - 3:37am",
      "content": "\\>these values were stored in some number of tracks\n\nOn magnetic tape, presumably.\n\nSo the origin of the word goes back to “you ain’t heard nothin’ yet!” — ie the addition of a sound track to movies in the 1920s (and on to multi-track sound recordings in the 1940s).\n\nA track is a linear sequence of marks/traces; which describes movie film. And film, with its frames and sprockets, visually resembles a railroad track.\n\nTwo tracks running side by side is a good metaphor to describe how image and sound work together. Hence “soundtrack”.\n\n"
    },
    {
      "time": " 21 June, 2005 - 6:06am",
      "content": "Compugraphic’s AutoKern was developed for the EditWriter in 1979. For kerning each character was assigned values to describe the outline at the baseline, x-height, and ascender. Tracking was based on an algorithm that defined three levels of compensation. BookSet, AdSet, and TightSet. All values were input on a chip and card.\n\n"
    },
    {
      "time": " 21 June, 2005 - 6:26am",
      "content": "Thank you everyone! :)\n\nKeeping on: what the current softwares call tracking, what would you (ideally) call it?\n\n"
    },
    {
      "time": " 21 June, 2005 - 9:33am",
      "content": "Joffre, “Broadcast Titler” on the Amiga (back in the early 90s) used a similar algorithm to auto-kern. It wasn’t exceptionally good (like it would over-kern sometimes), but at TV resolutions it was better than nothing.\n\nhhp\n\n"
    }
  ]
}
