{
  "id": "13225",
  "title": "Software for Authors",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi,\n\nI was reading an existential article about typewriters the other day. Typewriters are dedicated writing machines, whereas computers do many different things. I was wondering what kind of software autors use, more specificaly if there is some kind of software that lends itself particularly well to actual writing with a keyboard. This is basically a question of interface. I was thinking of a few ways of creatng an interface that is suited to writing.\n\n- Chris\n\n",
  "author": "Chris Washer",
  "time": "22 Jun 2005 — 4:30am",
  "uid": "4816",
  "comments": [
    {
      "time": "22 Jun 2005 — 9:44am",
      "content": "[It's been done.](http://web.archive.org/web/20131023141107/http:/office.microsoft.com/en-us/FX010857991033.aspx) ;-)\n\nPersonally, I prefer a simple text editor when I'm writing. About the only extras I like to have are some simple formatting options (style, font, tabs), search and replace, and basic spell checking. Being able to paste in a graphic is handy sometimes. Everything else just gets in the way. The one I like best right now is TextEdit (comes with OS X), but I have used TexEdit (great shareware app) a lot, too.\n\n"
    },
    {
      "time": "22 Jun 2005 — 9:58am",
      "content": "I like writing on paper, too. If I had some kind of magic paper with undo, cut and paste, and spell checking, that would be ideal. It would have to look and feel just like pen and paper. Electronic tablets and styluses don't feel right to me (so far). Too slippery, too disconnected, and handwriting recognition is too unreliable..\n\nI used typewriters when I was young (thank goodness I learned how to type), but they were not very conducive to writing for me. I loved the tactile qualities, though.\n\n"
    },
    {
      "time": "22 Jun 2005 — 8:04pm",
      "content": "Speaking of typewriters, Prof Micheal Twyman, of all people, claimed on Monday that they're making typewriters again - anyone heard anything about this?\n\nSi\n\n"
    },
    {
      "time": "23 Jun 2005 — 4:08am",
      "content": "my absolute favourite is scribble papers (pc only):  \n [http://www.scribblepapers.de.vu/](http://web.archive.org/web/20131023141107/http:/www.scribblepapers.de.vu/ \"http://www.scribblepapers.de.vu/\")\n\n"
    },
    {
      "time": "23 Jun 2005 — 6:43pm",
      "content": "I like [Arachnophilia](http://web.archive.org/web/20131023141107/http:/www.arachnoid.com/arachnophilia/index.html) quite alot, especially because you can change it to do just what you want. Plus, since it's a Java program, it looks and works the same on my Mac, PC and Sun machines.\n\n<cite>Arachnophilia is a good example of open software design -- a design the user can change in the field to meet requirements the programmer (me) cannot possibly think of himself, including new requirements that do not exist at the time of development. By the way, Arachnophilia is a descendant of my classic best-seller \"Apple Writer,\" an early word processor for the Apple II that also was field-extendable by way of a macro language (in an era when macro languages were virtually unheard of</cite>\n\n"
    },
    {
      "time": "23 Jun 2005 — 9:41pm",
      "content": "Si,\n\nWhat kind of typewriters? I know they still make basic low end electrics.\n\nE\n\n"
    }
  ]
}
