{
  "id": "13220",
  "title": "Latin American typefaces",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I need to find a typeface that when you see it inmediately you think: Latino América.  \nIs there such thing as »recognizable« Latin American typefaces? or typefaces that people  \ncould define as such, as is the case for example of Cheltenham, Century,  \nNews Gothic, Goudy in North America?\n\nThanks\n\nPatricia\n\n",
  "author": "patty",
  "time": "21 Jun 2005 — 1:49pm",
  "uid": "4467",
  "comments": [
    {
      "time": "21 Jun 2005 — 4:29pm",
      "content": "That's a very good question. There are certainly fonts that stereotype Latin America, or have been used so often for Latin American content that they have become falsely associated with the culture ( [Lithos](http://web.archive.org/web/20150417022458/http:/www.fontshop.com/showfont.cfm?fid=LH.398.0.0)).\n\nFor something authentic I'd look to almost anything by [Gabriel Martínez Meave](http://web.archive.org/web/20150417022458/http:/www.kimera.com.mx/mac/tipoinicioing.html).\n\n"
    },
    {
      "time": "21 Jun 2005 — 4:33pm",
      "content": "Also, it's good to remember that South America is a big place, filled with very different cultures. I once asked my Argentinean friend a similar question. His retort: \"I'm looking for a good European font. Can you help me?\"\n\n"
    },
    {
      "time": "21 Jun 2005 — 5:45pm",
      "content": "Hello,\n\nfirst is very difficult (almost impossible i think) to estabilsh a identity concept about latin america. We are multicultural, plural and each country have different cultures and reallities.\n\nFor a panorama o latin america prodution in the last years take a look in this website:  \n [http://www.letraslatinas.com/bienal2004.shtml](http://web.archive.org/web/20150417022458/http:/www.letraslatinas.com/bienal2004.shtml \"http://www.letraslatinas.com/bienal2004.shtml\")\n\nIn Brasil take a look in those links  \n [http://www.tipografica.com/57/?id=4](http://web.archive.org/web/20150417022458/http:/www.tipografica.com/57/?id=4 \"http://www.tipografica.com/57/?id=4\")  \n [http://jeff.cs.mcgill.ca/~luc/brasilfonts.html](http://web.archive.org/web/20150417022458/http:/jeff.cs.mcgill.ca/~luc/brasilfonts.html \"http://jeff.cs.mcgill.ca/~luc/brasilfonts.html\")\n\n"
    },
    {
      "time": "21 Jun 2005 — 6:00pm",
      "content": "Patty, latin american typographic scene has been under great efervescence during the last three or four years. Since then some quality foundries have appeared and as Stephen Coles noted every place is developing it's own characteristic work.\n\nGabriel Martínez is a must, he is actually the most oustanding mexican typographer, but south america -specially Argentina- has a more developed type scene. To my eye Alejandro Lo Celso's work has a very refined latinamerican taste.\n\nI can only say that there is not enough tradition in latin american type as to have characteristic faces yet. If I had to define the distinctive characteristic of latinamerican typefaces of the last years I would say that chunkyness, quirkness and organic angularity, but there are as well another trends towards, voluptuosity and roundness.\n\nYou may want to read this interview \"Latin Alphabet in Latin Hands\"  \n [http://www.typofonderie.com/gazette/articles/latintype](http://web.archive.org/web/20150417022458/http:/www.typofonderie.com/gazette/articles/latintype \"http://www.typofonderie.com/gazette/articles/latintype\")\n\nLetras Latinas (Latinamerican type biennial)  \n [http://www.letraslatinas.com](http://web.archive.org/web/20150417022458/http:/www.letraslatinas.com/ \"http://www.letraslatinas.com\")\n\nLook at Alejandro Lo Celso's work  \n [http://www.pampatype.com](http://web.archive.org/web/20150417022458/http:/www.pampatype.com/ \"http://www.pampatype.com\")\n\nThis site shows work from various argentinian designers  \n [http://www.sudtipos.com/](http://web.archive.org/web/20150417022458/http:/www.sudtipos.com/ \"http://www.sudtipos.com/\")\n\nThis site shows work from various chilenian designers  \n [http://www.tipografia.cl/](http://web.archive.org/web/20150417022458/http:/www.tipografia.cl/ \"http://www.tipografia.cl/\")  \nThe site is in remodelation so try this( [http://www.tipografia.cl/sitioantiguo/index.htm](http://web.archive.org/web/20150417022458/http:/www.tipografia.cl/sitioantiguo/index.htm \"http://www.tipografia.cl/sitioantiguo/index.htm\"))\n\nHéctor\n\n"
    },
    {
      "time": "21 Jun 2005 — 7:09pm",
      "content": "Hi Patty,\n\nThere are latinamerican culture inspired letterforms & typedesigners living in southamerican countries.\n\nNice Links Guys, i just like to show some Latinamerican inspired pixel modular typefaces,  \ntake a look at my LatinoPak fonts here:\n\n[http://www.atomicmedia.net/hernandez.php](http://web.archive.org/web/20150417022458/http:/www.atomicmedia.net/hernandez.php \"http://www.atomicmedia.net/hernandez.php\")\n\nSaludos,\n\nmh\n\n"
    },
    {
      "time": "22 Jun 2005 — 12:46am",
      "content": "Great post Héctor! Thanks for expanding my weak attempt.\n\n"
    },
    {
      "time": "23 Jun 2005 — 6:59am",
      "content": "Hi!  \nThanks a lot all for the links.  \nStephen you are right about Lithos (help!); but which other fonts stereotype Latin America outside Lithos or Optima? (Only to know for not to use them and break the chain)\n\nthanks\n\nPatricia\n\n"
    },
    {
      "time": "23 Jun 2005 — 10:25am",
      "content": "There was a great article about stereo_types_ somewhere, but I can't find it. I think it was printed in one of the design mags and ported online. Hopefully someone recalls.\n\n"
    },
    {
      "time": "23 Jun 2005 — 8:04pm",
      "content": "Well, Optima could qualify as a latin american looking face as I find that it shares some similarities with Gabriel Martinez's work.\n\nA very popular byble edition the \"Biblia Latinoamericana\" is set on Korinna, indeed many ITC and Bitstream \"ugly\" faces with a naive charming intention may match this kind of look such as Belwe, Benguiat, Seagull or Souvenir.\n\nI think that the essencial characteristic behind this look is the hand carved or hand made quality, which is present in many in the previously posted examples.\n\nStephen, you're welcome.\n\nHéctor\n\n"
    },
    {
      "time": "23 Jun 2005 — 8:09pm",
      "content": "Miguel if by the chance you read this, what happened with Quetzal?\n\nHéctor\n\n"
    },
    {
      "time": "23 Jun 2005 — 8:10pm",
      "content": "One adjective: fauve. Works like a charm.  \nAnd Eastern Euro design enjoys that too.\n\nhhp\n\n"
    },
    {
      "time": "23 Jun 2005 — 8:26pm",
      "content": "Here's an interesting thread on Moiguel's Quetzal  \n [http://www.typophile.com/forums/messages/29/49880.html?1061796101](http://web.archive.org/web/20150417022458/http:/www.typophile.com/forums/messages/29/49880.html?1061796101 \"http://www.typophile.com/forums/messages/29/49880.html?1061796101\")\n\nHéctor\n\n"
    },
    {
      "time": "24 Jun 2005 — 6:29am",
      "content": "Some stereotypes to avoid: [Tango](http://web.archive.org/web/20150417022458/http:/www.myfonts.com/fonts/linotype/tango/) and the House [Latino! Pack](http://web.archive.org/web/20150417022458/http:/houseind.com/index.php?page=showfont&id=142).\n\n"
    },
    {
      "time": "24 Jun 2005 — 7:15am",
      "content": "Interesting, Hrant. According to [this](http://web.archive.org/web/20150417022458/http:/en.wikipedia.org/wiki/Fauvism), _fauve_ is French for wild beast. Makes me think about the idea of the [bon savage](http://web.archive.org/web/20150417022458/http:/en.wikipedia.org/wiki/Jean-Jacques_Rousseau#The_theory_of_the_.27noble_savage.27); the civilized ones being condescending to the wild ones.\n\n"
    },
    {
      "time": "24 Jun 2005 — 9:09am",
      "content": "Not condescending. Note my \"enjoys\" above. I love Nature immensely, and I think fauve design is helping prevent its loss.\n\nhhp\n\n"
    },
    {
      "time": "24 Jun 2005 — 9:12am",
      "content": "Further:  \nWhat I disdain -or maybe just pity- is Constructivism, Modernism, Das Grid, etc.  \nSo the cornerstones of what one might term \"civilization\"... But not me.\n\nhhp\n\n"
    },
    {
      "time": "25 Jun 2005 — 11:34am",
      "content": "when i hear the word _fauve_, i think of the artistic movement of the same name: [fauvism](http://web.archive.org/web/20150417022458/http:/en.wikipedia.org/wiki/Fauvism). another word that could be used to describe a quality of many latin designs (but not all) is \" [chunky](http://web.archive.org/web/20150417022458/http:/typophile.com/node/5303).\"\n\n"
    },
    {
      "time": "25 Jun 2005 — 11:57am",
      "content": "Tellingly, the defining attribute of Fauvism is the use of vivid,  \njuxtaposed colors; and one could say that fauve type design does  \nthe same with **typographic** color!\n\nhhp\n\n"
    },
    {
      "time": "26 Jun 2005 — 6:25pm",
      "content": "Patty, what aspect of Latin America are you trying to convey? Unless you can bring your project into tighter focus you're not likely to get a good result.\n\n"
    },
    {
      "time": "27 Jun 2005 — 2:29pm",
      "content": "When I initially wrote I was thinking on two things: one, a great interest on knowing what is going on in the latin america typographically speaking. The second a could-be project for a nonprofit latinamerican organization in Germany, where the audience is 80 percent latin, 20 percent german.\n\nthanks\n\npatricia\n\n"
    },
    {
      "time": "27 Jun 2005 — 9:00pm",
      "content": "That sounds very general. My instinct would be to go for something sharp and modern, to avoid various stereotypes. There are good links in posts above from rafaelneder, rs\\_donsata, and Miguel Hernandez. Not to beat it to death, but Latin America is a big place, and not at all uniform. Best of luck.\n\n"
    },
    {
      "time": "28 Jun 2005 — 6:00am",
      "content": "I'm with the folks who advocate avoiding stereotypes. I live in an area that has a 40% Hispanic population, and there are a couple of free Spanish-language newspapers available at the bus stop I use every day to get to work. Every now and then, I pick up a copy and use my VERY limited knowledge of Spanish to see what's buzzing among many of my neighbors. Being typographically inclined, I also notice that there is precious little, typographically speaking, to distinguish these publications from the others, all written in English for English speakers, that are available at the bus stop.\n\nSo, if you want to know what constitutes up-to-the-minute Latino typography, visit Spanish-langauge websites, go to a library and check out their Spanish publications, or hang out at bus stops.\n\n"
    },
    {
      "time": "28 Jun 2005 — 8:09am",
      "content": "But yours is an expat community (as is mine, in LA). Look instead at something like Mexico's \"El Universal\" newspaper, which uses the zesty Zocalo. People are different, as much as they are the same. Do we avoid leveraging that?\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2005 — 8:37am",
      "content": " **_People are different, as much as they are the same. Do we avoid leveraging that?_**\n\nNot in the least. As much as I love fresh peach ice cream, the world would be a poorer place if that were the only flavor available.\n\n"
    },
    {
      "time": "2 Jul 2005 — 2:54pm",
      "content": "Or typefaces are different, as much as they have a purpose to meet.  \nBut I think is true that one thing is how people from other parts of this world think of what will convey Latinamerica, (using Hrant word, or how expats think they have to portray themselves to the eyes of other cultures: (the stereotype-face),  \n [latina.gif](http://web.archive.org/web/20150417022458/http:/typophile.com/desktop/latina.gif)  \n_-for cultural fanzine_  \nas what Latinamerica actually uses.  \n [sabor.gif](http://web.archive.org/web/20150417022458/http:/typophile.com/desktop/sabor.gif)  \n_-book tittle_\n\npatty  \n are we allowed to load pictures in Beta?\n\n"
    },
    {
      "time": "3 Jul 2005 — 10:22am",
      "content": "Bureau Grotesque (once labeled as having \"too much salsa\" by the AD of Time Mag.), Giza, Rhode and now FB Titling Gothic are all working hard down there. In addition, Cyrus' faces, like Prensa and Dispatch do very well. We've been doing a lot of custom work and licensing in L.A. (admittedly a huge place), over the past 10 years. I'm not sure if this is because we speak the language (literally), or our fonts do, but having exchanges with designers, editors and publishers every week, if not every day, also helps. By and large, I feel L.A. publications, ones that must attract L.A. audiences in the 100's of thousands, are drawn to organic, hand-made-looking and humanist inspired fonts rather than modernist, computer modernist styles, or anything \"Germanic\" (whatever that is). We are expecting to see, in the next 2-5 years, much more home rown design there and expect it to go along these same stylistic lines, but who knows.\n\n"
    },
    {
      "time": "3 Jul 2005 — 10:55am",
      "content": "David, can you cite any examples? The publication that comes to mind when I think of the City of Angels is \"Los Angeles\" magazine, which makes prominent use of Neutraface, a face whose origins are both modernist and \"Germanic\" (well, Austrian anyway).\n\n"
    },
    {
      "time": "3 Jul 2005 — 12:05pm",
      "content": "Marc, I think by L.A. David meant \"Latin America,\" rather than Los Angeles. I was thrown by that also.\n\n"
    },
    {
      "time": "3 Jul 2005 — 12:18pm",
      "content": "That makes sense, William. I read most of the thread in one pass, and assumed David was replying to Hrant's comments about Los Angeles.\n\nHrant, thanks for the pointer to \"El Universal.\" A handsome newspaper, that one.\n\n"
    },
    {
      "time": "4 Jul 2005 — 1:09pm",
      "content": "Prensa, Zocalo, Bureau Grotesque are more for Newspapers.  \nWhich ones would you recommend for Corporate Identity?\n\nPatricia\n\n"
    },
    {
      "time": "4 Jul 2005 — 1:21pm",
      "content": "I actually wouldn't recommend Zocalo for a newspaper. Although technically it seems super, it simply has too much character. News is better told by a balding middle-aged man (sure, with a Jalisco accent) not by a morena Acapulcan vixen. Here's an example of what I mean:\n\n[http://www.themicrofoundry.com/other/universal.gif](http://web.archive.org/web/20150417022458/http:/www.themicrofoundry.com/other/universal.gif \"http://www.themicrofoundry.com/other/universal.gif\")\n\nIt's really way too... ¡festive! in a context like this. Unless maybe you're a Palestinian whose home has been razed or something.\n\nhhp\n\n"
    },
    {
      "time": "4 Jul 2005 — 9:37pm",
      "content": "Patty, go for the cliché if this is what your audience can easily digest and understand, I don't suggest you should use Lithos or Latino Pack (but if it works fine then it must be ok) but we also must remember that strong conventions are necesary for plain understanding.\n\nHéctor\n\n"
    },
    {
      "time": "4 Jul 2005 — 9:54pm",
      "content": "Hrant I actually like Zócalo a lot on El Universal, it has the exact amout of energy needed to tell the news, because news usually have a very strong flavour in México, not to say this is the common place or healthy practice but many newspaper's most popular section is the \"red news\" (la nota roja).\n\nHéctor\n\n"
    },
    {
      "time": "5 Jul 2005 — 10:28am",
      "content": "I completely forgot to mention the [TDC Award](http://web.archive.org/web/20150417022458/http:/www.tdc.org/news/2005Results/Rumba.html)-winning [Rumba](http://web.archive.org/web/20150417022458/http:/just.letterror.com/ltrwiki/LauraMeseguer_2fSpeCimen), which was not designed by a Latin American, but Laura Meseguer, who is from Spain.\n\n[Here's another nice sample.](http://web.archive.org/web/20150417022458/http:/icograda.com/web/galeria-past-single.shtml?pfl=galeria-single-past-2.param&op2.rf1=183&op4rf1=1&op4rt1=15)\n\nRumba will be featured in Interrobang 3, which will be available at TypeCon05 and mailed to SOTA members.\n\n"
    },
    {
      "time": "6 Jul 2005 — 10:02am",
      "content": "\"News is better told by a balding middle-aged man (sure, with a Jalisco accent) not by a morena Acapulcan vixen.\"\n\nHa ha! How about if the typographic voice has flavor AND the headlines are written to match? Forget the illusion of objectivity, go for the local identity, right down to the editorial and design voices.\n\nI've always thought there should be colorful, genuine TV announcers with lots of subjective flavor to their reports. Not everyone needs to pretend to be \"fair and balanced\".\n\n"
    },
    {
      "time": "12 Jul 2005 — 2:35am",
      "content": "Patty,\n\nI wouldn't say there's a particular type to associate with Latin-America, since our foundries -when printing started in America- used European material for their labour (mostly). Even though, modern attempts have been made. Héctor's fonts are a good example, in my opinion.\n\n....................\n\nI am not sure if the following can help you, but anyway I post it. These are some qualities I have noticed in present, hand-drawn lettering in my homecountry (México). Maybe it could help you when choosing your type. At least, the display type.\n\nCorrosion (due to climate factors or to cheapness of materials)  \nIrregular baselines  \nElaborate -almost Victorian- ornamentation (outlines that outline outlines!)  \nLack of mechanical precision  \nColour explosion (primary colours). Words might even have different colours to them in a single sentence.  \nMixed use of serifs in the same \"font\".  \nMixed use of bold type along with italics set in smaller sizes and in diagonal angles.  \nLots of ornamental \"dingbats\" like stars, dots, lines...  \nA lot of signs are still done by hand and not by computer. A colleague of mine has a formal training in Graphic Design, but still makes hand-rendered signs for several clients.\n\nThere's even a design style in vogue in México called Feísmo (\"uglyism\" is my free translation of the term). Some fonts have been made with that approach in mind (I recall \"Luchita Payol\" from Edgar Reyes, another colleague of mine- you can ask him for samples at [fabrikavisual@hotmail.com](mailto:fabrikavisual@hotmail.com)).\n\n.................\n\nOf course there are stereotypes, but stereotypes are not to be avoided without a second thought. Stereotypes have the great advantage of aiding in easiness of communication. I have seen lots of (in my opinion: farfetched) type from US products that try to depict Latin-America. Although they seem to me to be more a Tex-Mex result, they actually convey the flavour of the latin countries to the US people due to repeated media exposure.\n\n..................\n\nI wouldn't say Lithos would be the wisest choice. I would go for a more grungier contour...\n\n..................\n\nI am living in München. If I can be of any further help for your project, feel free to contact me at [moshdesignerERASETHIS@yahoo.com](mailto:moshdesignerERASETHIS@yahoo.com)\n\n-Mosh\n\n"
    },
    {
      "time": "12 Jul 2005 — 5:00am",
      "content": "\"Which ones would you recommend for Corporate Identity?\"  \nCorporate Identity, Eldorado.\n\nSorry to confuse the L.A., with LA, I call the ciudad LAX, and someone who used to live there, Ex-LAX.\n\n"
    },
    {
      "time": "12 Jul 2005 — 6:57am",
      "content": " **Stefan Hattenbachs** Oxtail**, which has recieved much deserved attention recently, has a rather latin flavour to it, I think.  \nThat's the typeface I'd choose if ever anyone asked me to set the word** Caramba.\n\nƒ\n\n"
    },
    {
      "time": "13 Jul 2005 — 5:38am",
      "content": "Its hard to tell what is a latinamerican type. I m thinking about music and I could not say Piazzola is more or less latin than Shakira or Cafe Tacuba... so different fonts will talk about them, right?\n\nwe dont have tradicional latinoamerican text font but a lot of display ones that I feel represent latinamerican spirit like [Murga](http://web.archive.org/web/20150417022458/http:/www.sudtipos.com/fonts-mariabrug.htm), [Candombe](http://web.archive.org/web/20150417022458/http:/www.sudtipos.com/fonts-candombe.htm), [Habano](http://web.archive.org/web/20150417022458/http:/www.sudtipos.com/fonts-habanos.htm) and maybe some others like [La Portenia](http://web.archive.org/web/20150417022458/http:/www.sudtipos.com/fonts-portenia.htm)\n\nSorry for my english  \nbest  \nAle\n\n.www.sudtipos.com\n\n"
    },
    {
      "time": "13 Jul 2005 — 9:23am",
      "content": "ale, have you ever considered doing a text font? it would be interesting to see one come from the sudtipos group.\n\n"
    },
    {
      "time": "14 Jul 2005 — 10:07am",
      "content": "I agree with the Oxtail suggestion.\n\n"
    },
    {
      "time": "26 Jul 2005 — 2:30am",
      "content": "thanks all for the neat input, I certainly have a broader idea of how to approach the project if it materialize.  \nIn the mean time…I think I am in love with El Dorado and its lucious italic.  \nTalking about Oxtail, in the beggining I didn't see what you were saying then I tested it and indeed it could work, the tail and the counters (d, b specially) give a nice twist to its egyptian origin.\n\npatty\n\n"
    },
    {
      "time": "7 Oct 2008 — 7:42am",
      "content": "[www.latinotype.com](http://web.archive.org/web/20150417022458/http:/www.latinotype.com/ \"www.latinotype.com\") its an excellent chilean foundry!! and to cheap!\n\n"
    }
  ]
}
