{
  "id": "13246",
  "title": "(x) Looking for the best cut of Helvetica {Mark S}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I know the following question has been posted innumerable times on Typophile, so I apologise in adavance, but...\n\nI wanted to know which foundry has the best cut of Helvetica, by “best” I mean loyal to the original design.  \nI have Adobe’s Helvetica and am assuming it is a butchered version, is Linotype the closest?\n\nThanks.\n\n [‹ (x) Looking for fonts with calligraphic ornaments - various {gang}](http://web.archive.org/web/20080415135552/http:/www.typophile.com/node/13271 \"Go to previous forum topic\") [(x) African Tonic advertising slogan - Fandango {Dav} ›](http://web.archive.org/web/20080415135552/http:/www.typophile.com/node/13265 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080415135552/http://www.typophile.com/user/1636\" title=\"View user profile.\">Jem</a>",
  "time": "<br>",
  "uid": "1636",
  "comments": [
    {
      "time": " 22.Jun.2005 6.30pm",
      "content": "Adobe’s is identical to Linotype’s. If you are at all familiar with the old display versions (say, from an old Letraset catalog or headline setting machine or even the metal foundry version), you may notice that it looks different. This is because Linotype’s version was designed primarily for text setting (although you could set it larger on their machines).\n\nThe version that most closely matches the original Helvetica display sizes is URW’s [Nimbus Sans](http://web.archive.org/web/20080415135552/http:/www.urw.de/cgi-bin1/dalcgi/english/schnellsuche.htd?searchchar=helvetica). They don’t have a license to use the name, but it’s the most faithful version of the display version in digital format.\n\n"
    },
    {
      "time": " 22.Jun.2005 8.57pm",
      "content": "Thank you Mark.\n\nActually this begs the question, is the original version of Helvetica the best?  \nHave later developments and changes to the font improved it, or not.\n\n"
    },
    {
      "time": " 22.Jun.2005 9.04pm",
      "content": "Since metal type came in size-specific designs, and digital type generally doesn’t (and I’ve never heard of optical sizes of digital Helvetica) you might need to define the point size you’re talking about to really answer this question. I’m guess not all digital Helveticas are based on the identical size master?\n\nhhp\n\n"
    },
    {
      "time": " 22.Jun.2005 10.06pm",
      "content": "The size I am using Helvetica is approx 130 pt.  \n(for a poster)\n\n"
    },
    {
      "time": " 23.Jun.2005 7.53am",
      "content": "Here is a comparison of the early Linotype Helveticas and the original Haas version:\n\n[http://www.marksimonson.com/Helveticas-compared.gif](http://web.archive.org/web/20080415135552/http:/www.marksimonson.com/Helveticas-compared.gif \"http://www.marksimonson.com/Helveticas-compared.gif\")\n\nThe differences are most visible in the e and a.\n\nIn the top four you can see the source for the Linotype/Adobe version. The bottom two differ slightly, so you can see there were differences in the various point sizes that were cut in metal. The very bottom one is the version that was usually seen in display type before digital type took over, and the one URW sells as Nimbus Sans D.\n\nThere is a third version, Helvetica Neue. This was created by Linotype around 1980. It’s supposed to be an improvement, and in many ways it is, particularly in terms of consistency of letterforms between weights. But it is even more different from the Haas original than the earlier Linotype version. I think it lacks some of the roundness that the original had.\n\nClearly, some versions of Helvetica are more “authentic” than others. The original display version was designed for display use, so I would use that one for a poster if I could. Ultimately, it’s pretty subjective.\n\n"
    },
    {
      "time": " 23.Jun.2005 9.32am",
      "content": "Mark, nice! Thanks.\n\nAnd check out the flaring in the 14pt Haas. Heavy.\n\nhhp\n\n"
    },
    {
      "time": " 23.Jun.2005 10.36am",
      "content": "Looking more at this, it does appear that Linotype’s version followed the smaller Haas cut pretty closely.\n\n"
    },
    {
      "time": " 23.Jun.2005 10.06pm",
      "content": "Thank you again Mark & Hrant.  \nExcellent information.\n\n"
    }
  ]
}
