{
  "id": "13249",
  "title": "Big Fleischmann Bake-Off Online (at last)",
  "forum": "Bald Condensed's blog",
  "tags": [

  ],
  "content": "[It's live.](http://web.archive.org/web/20131106065028/http:/www.typographer.org/2005_06_01_digests.html#111945232557055739) Sorry it took so long, but, you know, life happens. ;-)\n\nAbout the Fire Hydrant Incident -- I'll just plead momentary insanity. _Hmmm... Actually that's a pretty permanent state of mind in my case. I wonder if they'll fall for that._\n\n",
  "author": "Bald Condensed",
  "time": "23 Jun 2005 — 5:23am",
  "uid": "110",
  "comments": [
    {
      "time": "23 Jun 2005 — 7:30am",
      "content": "where?\n\n"
    },
    {
      "time": "23 Jun 2005 — 9:08am",
      "content": "Hey, pretty good! It's both accessible and learned, full of praise and constructive criticism - but no fawning, thankfully. I hope more people emulate what you've done here - we need more type reviews. And thanks for the quoting.\n\nTwo small things:  \n- A typo: \"overfly\" instead of \"overly\". Were you on a plane? :-)  \n- You write \"3/4 or hybrid numerals\", but they're not the same thing.\n\nOh, and:  \n\"But when you’re living with your song for too long, constantly developing and refining it, you risk losing some of the freshness. The cost of being able to play it flawlessly is the loss of its initial spontaneity.\" Wow. I want a poster of that.\n\nhhp\n\n"
    },
    {
      "time": "23 Jun 2005 — 9:12am",
      "content": "Oh, I forgot:  \nEben, you just had a problem I've been having with the redesign: the dark blue link highlight (the first words of Yves's post) is hard to see.\n\nhhp\n\n"
    },
    {
      "time": "23 Jun 2005 — 11:02am",
      "content": "R I G H T . . .\n\nYeah, Thats what I have been making links like this now { link }. But yeah, a change in the css would be better.\n\n"
    },
    {
      "time": "23 Jun 2005 — 2:17pm",
      "content": "_(...) thanks for the quoting._\n\nHey, like I'm going to pretend I discovered those Fleischmann references myself? ;-) Credit where credit's due.\n\n_Two small things:  \n- A typo: “overfly” instead of “overly”. Were you on a plane? :-)  \n- You write “3/4 or hybrid numerals”, but they’re not the same thing._\n\nFixed, and fixed. Type terminology regarding numerals [(or is it figures?)](http://web.archive.org/web/20131106065028/http:/typophile.com/node/13163) is [prone to confusion](http://web.archive.org/web/20131106065028/http:/66.102.9.104/search?q=cache:umkAtexIfy0J:www.typophile.com/cgibin/discus.pl%3Fpg%3Dprev%26topic%3D30%26page%3D23763+site:typophile.com+lining+hanging+figures&hl=en), and I got caught in it myself. Just to be sure: 3/4 numerals are lining but smaller than caps and bigger than x-height? And hybrid numerals have ascenders and descenders that overshoot only a little bit, not as much as the ascenders and descenders of the lowercase characters? (Or is it small letters?) ;-)\n\n_Oh, and:  \n“But when you’re living with your song for too long, constantly developing and refining it, you risk losing some of the freshness. The cost of being able to play it flawlessly is the loss of its initial spontaneity.” Wow. I want a poster of that._\n\nThanks. Never thought playing in a rock band would open my mind to philosophical... errr... stuff. ;-)\n\n"
    },
    {
      "time": "23 Jun 2005 — 2:38pm",
      "content": "\\> 3/4 numerals are lining but smaller than caps and bigger than x-height?\n\nYup. Just watch how you use \"lining\"... :-/ Damn number thingies.\n\n\\> And hybrid numerals have ascenders and descenders that overshoot only a little bit,  \n\\> not as much as the ascenders and descenders of the lowercase characters?\n\nSounds good. And they're [normally] shorter than the UC and/or ascenders overall.  \nAnother way is to say they're oldstyle numerals with \"bodies\" larger than the lc x-height.\n\nNow let me tell you about poodlemix numerals... Or maybe some other day.\n\nhhp\n\n"
    },
    {
      "time": "24 Jun 2005 — 1:07pm",
      "content": "Nice job! It really needs a Fenway sample.\n\n"
    },
    {
      "time": "24 Jun 2005 — 1:07pm",
      "content": "Nice work, Yves. All gorgeous families for different reasons and, I think, all worthy of use for different purposes.\n\nCorrection: Second to last paragraph, fourth line. I believe you meant \"... _or_ and imitator of ...\"\n\nI have to say that I agree with Stephen's quibble.\n\n"
    },
    {
      "time": "24 Jun 2005 — 2:11pm",
      "content": "doesn't Typophile support \"strike\" or \"strikethrough\"? well, ignore my correction. I had it explained to me. Mea Culpa.\n\n"
    },
    {
      "time": "24 Jun 2005 — 2:11pm",
      "content": "I'll ask Robb if he can do something about a Fenway sample. I've got two PDfs, but I'm very cautious with review materials. Not doing anything without getting permission.\n\n"
    },
    {
      "time": "24 Jun 2005 — 7:43pm",
      "content": "Are the PDFs public? If they are public, they're public.\n\nhhp\n\n"
    },
    {
      "time": "25 Jun 2005 — 5:23pm",
      "content": "If they were public, I think they would be readily available on the FontBureau, Inc. website. ;-)\n\n"
    },
    {
      "time": "28 Jun 2005 — 12:33am",
      "content": "The discussion continues [here](http://web.archive.org/web/20131106065028/http:/typophile.com/node/13307).\n\n"
    }
  ]
}
