{
  "id": "13293",
  "title": "Is Trebuchet a right choice for writing long texts?",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "Hi,\n\nIn our company we use Trebuchet to create every document. I find the long texts written in it unreadable. What are your comments? The boss has asked me to give 1-2 printed pages using different fonts. Which fonts should I choose? I am thinking aout Garamond and Palatino. What leading I should keep for these fonts at 11pt and 12pt? I am planning to write the text on typography. Do you have any suggestions for the text? Thank you very much in advance.\n\nBest Regards,  \nRahul.\n\n [‹ Ambigram](http://web.archive.org/web/20071017181204/http:/typophile.com/node/12566 \"Go to previous forum topic\") [\"ng\" a Problem Kerning Pair for Palatino SC? ›](http://web.archive.org/web/20071017181204/http:/typophile.com/node/13255 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071017181204/http://typophile.com/user/8020\" title=\"View user profile.\">rahul</a>",
  "time": "<br>",
  "uid": "8020",
  "comments": [
    {
      "time": " 25.Jun.2005 3.57am",
      "content": "Trebuchet is excellent for onscreen text, in my opinion. But for print, I would use something else. I think that Palatino is a great choice.  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20071017181204/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 25.Jun.2005 4.02am",
      "content": "Rahul, my suggestion for the text is to use something that will have your boss looking at the legibility of the text not the content. I suggest something like a chapter of Alice in Wonderland or Through the Looking Glass.\n\nDepending on the font I’d look at 9 or 10 pt type. I think 12 pt type is way to large. Think of your local newspaper or common magazine.\n\nThere are a lot of Garamonds, specify which one you were thinking of using. Take a look at Plantin as well as Palatino and Melior.\n\nJust some thoughts\n\n"
    },
    {
      "time": " 25.Jun.2005 9.48am",
      "content": "Exactly what Dan R said: superb onscreen, avoid in print.\n\nhhp\n\n"
    },
    {
      "time": " 25.Jun.2005 11.55am",
      "content": "Trebuchet: Ick!\n\nRahul, can you purchase fonts, or do you have to pick a system font? Are you restricted to certain sizes? Different fonts look bigger or smaller at the same sizes. Digital Palatino works better than Trebuchet for text, but it’s so expansive, it looks best at about 8.5 - 9 point, and frankly clumsy at 12 point. I suspect the Palatino on everyone’s system was made from 9-point drawings.\n\nIf you are picking a single type family for use in all documents, make it something very quiet and serviceable, like Minion, Sabon, or the robust [Clifford Nine](http://web.archive.org/web/20071017181204/http:/www.fontshop.com/?fuseaction=catalog.fontdetail&searchby=manufacturer&displayfontid=FF.11069.7.27) or [Verdigris](http://web.archive.org/web/20071017181204/http:/www.mvbfonts.com/html/fonts/verdigris/pk_verdigris.htm). Those last 2 would allow you to use a smaller size, like 9 point, without anyone complaining, and you might save a tree. Then there’s the elegant and economical [Laurentian](http://web.archive.org/web/20071017181204/http:/www.fonts.com/FindFonts/detail.htm?pid=414154). There are many useful text faces that are better than Trebuchet out there. It depends on how hard the typeface has to work and what kind of budget you have.\n\n"
    },
    {
      "time": " 25.Jun.2005 12.02pm",
      "content": "Plus Palatino is actually a display face (although a case could be made for using a darker weight -tracked looser- for small sizes). Zapf in fact made a text counterpart to Palatino: Aldus.\n\nhhp\n\n"
    },
    {
      "time": " 25.Jun.2005 12.14pm",
      "content": "I think that Palatino Linotype (which comes with some MS products, I think) is a fine text face.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20071017181204/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 25.Jun.2005 12.20pm",
      "content": "Palatino was foundry type, and was adjusted for different sizes. Unfortunately the one everyone sees is from a small master. If you look at signage, often you will see the more refined, slender display version. For some reason every parking garage in SF uses it. Hrant’s point is good; Aldus performs quite well in text, and is more economical as well. It’s likely, though, that few people in the typical office will be able to tell Aldus and Palatino apart....\n\nDoes anyone offer the Palatino Display in digital version?\n\n"
    },
    {
      "time": " 25.Jun.2005 1.02pm",
      "content": "I have to agree with Hrant on Aldus. It probably depends also on size  \nand paper, but I have seen Palatino looking great and awful as text.  \nI suspect that the ’great’ was actually Aldus.\n\nHere is Linotype on Aldus:\n\n“Designed by Hermann Zapf for D. Stempel AG, this typeface was  \noriginally intended to be the book or text weight for his Palatino™  \nfont family. It was instead released as a separate font with the name  \nAldus™ in 1954. Aldus has the distinction of being lighter and  \nnarrower than Palatino, which makes it a good choice for book  \ntypography, though Palatino has also gained popularity as a text  \nface.”\n\n\\>Depending on the font I’d look at 9 or 10 pt type. I think 12 pt  \ntype is way to large. Think of your local newspaper or common  \nmagazine.\n\nI think the ’depending on the font’ needs clarification. It may be  \nthat Palatino will work much better at small sizes, because it is  \ndark and wide - but others will be worse at small sizes. In general  \nyou need to consider your page dimensions, number of columns, the  \nmeasure (width) of the columns, the possible leading, and the  \nx-height of the face. Some 12 point type will look fine and others  \n(maybe Palatino) bad.\n\nIt is the combination of size, measure and leading and face that are  \ncritical for readability, not one by itself. The width, x-height and  \ndarkness of the type, as well as the measure, affect the leading.  \nBringhurst says that 45-75 lower case characters is the generally  \nagreed-upon acceptable range, with 66 lower case characters, or about  \ntwo and a half lower case alphabets ideal for single columns. I think  \nthis is one of the most important and too often neglected variables.\n\nIn my opinion don’t even think about a sans serif for extended text.  \nBut you can get away with it to some degree if you have narrow  \ncolumns and enough leading.\n\n"
    },
    {
      "time": " 25.Jun.2005 2.53pm",
      "content": "_Does anyone offer the Palatino Display in digital version?_\n\nVery soon, Linotype will release Hermann Zapf’s Palatino nova, the most extensive digital Palatino ever. It will have two display weights, both based on more old metal Stempel Palatino alternates, Michelangelo and Sistina. An Aldus nova is also part of the overall release (although I think that Palatino nova works well in text sizes, too).\n\nMany here may remember Akira Kobayshi’s presentation of Palatino nova at TypeCon last year. There, he also announced that a Sans family has been designed by Hermann Zapf as well.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20071017181204/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 25.Jun.2005 3.07pm",
      "content": "\\>Palatino nova\n\nSounds fabulous. Will the shapes be somewhat more excentric but beautiful curves of the original foundry version of eg. the A and S or the more ironed-out later versions? Or both versions in different weights?\n\n"
    },
    {
      "time": " 25.Jun.2005 3.28pm",
      "content": "William, you should see the sans. It actually overshadows the serif.  \nAs I’ve said before, I think Zapf is lucky to have Kobayashi.\n\nhhp\n\n"
    },
    {
      "time": " 25.Jun.2005 4.12pm",
      "content": "I missed the Palatino Nova presentation. I imagine a delicious Palatino Sans will renew interest in the Serif version as well. I must say I’ve been waiting for HZ to really turn his attention toward a Sans design. Dan, any ETA for those new Palatinos?\n\n"
    },
    {
      "time": " 25.Jun.2005 4.20pm",
      "content": "Actually, Kobayashi did the sans. It’s really on another  \nlevel, both in intention -more like bravado- and execution.\n\nhhp\n\n"
    },
    {
      "time": " 25.Jun.2005 9.21pm",
      "content": "Trebuchet is good for screens. I am using it in my papers which is supposed to be readed online and I made my text small paragraphs because if they printed it .. I don’t think it can handel huge text. And all what I got from what you said is that you want a font for several amounts of text.. alot of fonts are good but it depends on the layout and the porpose of your design. if you gone for 9 pt -12 pt avreage I advice you to use serif fonts.. because serifs help the conception of reader to remember recognize the letter shape faster, at this point you have alot of fonts to select.\n\n"
    },
    {
      "time": " 26.Jun.2005 2.05am",
      "content": "Hrant, I wouldn’t discount Hermann Zapf like that. He drew the letters (at least on paper) and worked very closely with Akira Kobayashi throughout the entire digitalization process.\n\nI don’t have an ETA, sorry. The serif faces will all come out at once, within the next few months. The sans faces will then come out a bit later. Each will have its own detailed brochure (the brochures are also designed by Hermann Zapf), though neither of them will be ready by TypeCon.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20071017181204/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 26.Jun.2005 6.21am",
      "content": "Palatino IS the house face of faber & faber. Hundreds of books are clear testimony to the perfect usability of Palatino. (Caveat: In the hands of a good book designer...)\n\n"
    },
    {
      "time": " 26.Jun.2005 6.29am",
      "content": "Bert, does Faber & Faber use Palatino at smaller text sizes - 10 pt and under? Where I saw Palatino - a great typeface - looking bad as text was at larger text sizes, and I believe the printing/paper had spread the forms a bit.\n\n"
    }
  ]
}
