{
  "id": "13307",
  "title": "Yves reviews Fleischmann revivals",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Over at [Typographer](http://web.archive.org/web/20130819205747/http:/www.typographer.org/) Yves Peters, in response to requests from typophiles, including this one, reviews Fleishmann revivals Mercury, Farnham, Fenway, DTL Fleishmann and Eudald. A thoughtful and insightful review that was obviously a lot of work. Thanks Yves!\n\nOverall, it seems that Yves admires the audacity and stylishness of Farnham, but favors Mercury as the most usable and elegant version.\n\nAny thoughts from other typophiles who have used these?\n\n",
  "author": "William Berkson",
  "time": "26 Jun 2005 — 8:01am",
  "uid": "1551",
  "comments": [
    {
      "time": "26 Jun 2005 — 10:17am",
      "content": "yer a bit behind the times, willy b.\n\n[http://typophile.com/blog/110](http://web.archive.org/web/20130819205747/http:/typophile.com/blog/110 \"http://typophile.com/blog/110\")\n\n"
    },
    {
      "time": "26 Jun 2005 — 10:25am",
      "content": "Yeah, I just started looking at the tracker, and saw that after I posted. Blogs don't show up in the main listings. Still, I would be interested in any who have actually used these fonts for additional views. They are really all outstanding work, which makes the comparison interesting.\n\n"
    },
    {
      "time": "26 Jun 2005 — 10:38am",
      "content": "\\> Blogs don’t show up in the main listings.\n\nI thought they did (since Tiff's does), but you're right about this one.  \nSo I guess sometimes yes sometimes no... A bug, then.\n\n\\> I would be interested in any who have actually used these fonts for additional views.\n\nTotally. But I think Paul is hinting there's already a place to do that.\n\nhhp\n\n"
    },
    {
      "time": "26 Jun 2005 — 2:33pm",
      "content": "Could be because Tiff is a moderator?\n\n"
    },
    {
      "time": "26 Jun 2005 — 2:43pm",
      "content": "pardon the intrusion, but i don't have the fonts and i want to say a word or two:\n\nyou need a lot of courage to say that the work by Matthew Carter is great, but not so so great \" because it is a commissioned type family, designed within certain editorial constraints, it has become the most mainstream and “slick” adaptation.  \nCertain creative decisions must’ve steered it away from the Fleischmann model, insofar that it makes me wonder if I’m doing Fenway a disservice by including it in this comparative review instead of looking at it separately.\n\nso...there's a need to ask him\n\n"
    },
    {
      "time": "26 Jun 2005 — 6:39pm",
      "content": "Sometimes, you have to say something wrong/borderline (although not intentionally - that sucks) to trigger a reliable correction. People react more often to correct something, instead of to reinforce it. Unfortunately. As I've said before -to Stephen's great amusement, I remember- reckless speculation (which this isn't even) is the key to efficient data mining.\n\nhhp\n\n"
    },
    {
      "time": "26 Jun 2005 — 7:52pm",
      "content": "_you need a lot of courage to say that the work by Matthew Carter is great, but not so so great_\n\nnot really, you just need to have your own oppinion and not be afraid to voice it. you should have some good reasons to make such a statement, however.\n\n"
    },
    {
      "time": "26 Jun 2005 — 9:03pm",
      "content": "I like it, even Pelé failed penalties, why should Matthew Carter be inmune?\n\nAltough I don´t have any of the faces and only know them by ocassional sighting this critic is a good place to start knowing them.\n\nHéctor\n\n"
    },
    {
      "time": "26 Jun 2005 — 11:28pm",
      "content": "first and foremost: I didn't talk about \"inmune\" or to \"be afraid to voice\" your own opinion.\n\nlet's read it again:\n\nit is a commissioned type family, designed within certain editorial constraints...\n\nCertain creative decisions must’ve steered it away from the Fleischmann model...\n\nit makes me wonder if I’m doing Fenway a disservice by including it in this comparative review instead of looking at it separately.\n\n• • •\n\nin my opinion there was a need to talk to Matthew Carter; to hear about the \"certain editorial constraints\" that \"steered it away from the Fleischmann model\".\n\nmaybe the client didn't want the exact model? who knows.\n\nthen — when you have the point of view by Matthew Carter — you can say: i need to look at it separatley. or not. and why.\n\n"
    },
    {
      "time": "27 Jun 2005 — 12:13am",
      "content": "Tina, I think that your are being a bit harsh on Yves. His article was a great review. That being said, I would have liked to have heard what motivated Carter's design decisions, too.  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130819205747/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "27 Jun 2005 — 12:24am",
      "content": "\"I think that your are being a bit harsh on Yves\"\n\nwhy? no. i don't think so. we are here to talk and not to insult. this is like chemistry — a chain reaction.\n\nand as Paul said: you just need to have your own opinion and not be afraid to voice it. you should have some good reasons to make such a statement, however.\n\n"
    },
    {
      "time": "27 Jun 2005 — 8:35am",
      "content": "You're both being a bit prickly!\n\nI think it would certainly have been nice to ask Carter (and the others too!) about this, but Yves was probably already over-drawn on this. And maybe he thought it would be too much of an imposition.\n\nhhp\n\n"
    },
    {
      "time": "27 Jun 2005 — 10:59am",
      "content": "Maybe we can all sit down with Matthew at TypeCon and ask him. I'd be game.\n\n"
    },
    {
      "time": "27 Jun 2005 — 1:20pm",
      "content": "I used Fenway a lot in 2002 and 2003, first in typesetting _Language Culture Type_, and then in all the print material for the ATypI conference in Vancouver. For the former, I made an extended OpenType version with additional diacritics, e.g. for Arabic transliteration, which I sent to Matthew for approval.\n\nJudged as a Fleischman revival, I think Fenway is inevitably going to compare less favourably with most of the other designs that Yves reviews. But I'm not sure that it makes sense to judge Fenway in these terms. Fenway was designed as a text face for a magazine, and that is the first basis on which it should be judged. The fact that it is based in large part on ideas that can be traced to Fleischman's types seems to me a secondary consideration. Fenway isn't really a Fleischman revival; at least, it is no more a Fleischman revival than Galliard is a Granjon revival, and probably less so. One of Matthew's great talents is the ability to reinterpret historical models as entirely modern typefaces, without any lingering whiff of antiquity: the models are clearly evident in the resulting designs, but the treatment of the ideas is very fresh and, as in the case of the Fenway 'k', open to influences outside the model, or to multiple models.\n\nI would go so far as to say that in one important respect at least Fenway may be superior to -- or at least more interesting than -- the various recent Fleischman revivals or Fleischman-inspired designs: what Matthew has taken from Fleischman's types is not the baroque details that make the original so immediately distinctive but which, on closer examination, are quite superficial. What he has revived is not Fleischman's style, but Fleischman's ideas about readability, applied to an entirely contemporary typeface for a specific design brief and printing environment.\n\n"
    },
    {
      "time": "27 Jun 2005 — 2:32pm",
      "content": "John, great stuff. Except the \"Fleischman’s ideas about readability\" bit: these have yet to be applied, as far as I'm concerned.\n\nhhp\n\n"
    },
    {
      "time": "27 Jun 2005 — 2:43pm",
      "content": "ah ha. great stuff, John (I just hope that Yves isn't going to hate me :) ).\n\n"
    },
    {
      "time": "27 Jun 2005 — 3:22pm",
      "content": "I'm going to hate nobody, relax! I haven't read anything harsh or unfair until now. :-)\n\nThis is a great thread, and I'm truly honoured that my review instigated this interesting discussion. While I'd like to delve a little deeper into the different points raised here, I'm terribly busy right now preparing a special little something to promote Typographer.org at Typecon, which needs to go to the printer's by next Monday (groan). So please bear with me, I _will_ respond to your remarks (some of which are a bit off the mark I think)... but not right now. ;-)\n\nOh, and please don't mind me: carry on! :-)\n\n"
    },
    {
      "time": "27 Jun 2005 — 4:08pm",
      "content": "\\>the baroque details ... are quite superficial.\n\nI don't think so.  \nFleischmann put them there for a reason. They're part of the design.  \nMost typographers follow the Morison line, favoring bland text types.  \nI prefer the strong beer. With blue cheese.\n\n"
    },
    {
      "time": "27 Jun 2005 — 8:38pm",
      "content": "One of the pleasures (and challenges) of working with historical sources is that they force you to articulate what it is you like about them. With so many type designers engaged in this kind of work, it's increasingly difficult to find new ways to react to old fonts; I really wonder whether the world really needs another Caslon revival, and we surely haven't seen the last of them. But I also felt this way ten years ago, and from the vantage point of 2005 I really can't imagine typography without Matthew Carter's \"Big Caslon.\" (Substitute Justin Howes' \"Founders Caslon,\" or Mark Andresen's \"NotCaslon,\" if you like -- the point is that each of these designers reacted to something different, but very specific, in the same source, and in expressing this reaction produced something truly vital.)\n\nThis might be a good time for me to confess something I shared with Yves, which is that I don't really think of Mercury as a Fleischman revival. I did in the beginning: my first drawings in 1996 attempted a strict facsimile of Fleischman's No. 65 & 66, complete with all the baroque details both general and specific (droopy ball terminals, dart-like serifs on the caps, a very narrow italic, and those blobby serifs that imitate the look of letterpress.) I presented these to the art director of Esquire, who politely told me that he didn't think they were right for the magazine. In struggling to express what what was wrong with the fonts, his assistant came closest when he characterized the fonts as \"sluggish.\" I returned to the drawing board, and tried to figure out whether there was a way to \"quicken\" my drawings, or whether I should start from scratch.\n\nIn trying to solve the problem, I spent some time thinking about what I liked about Fleischman in the first place, to see whether these attributes could be reconciled with my newly focussed brief. I discovered that it wasn't the details that I liked: I don't especially like the mannered peak of the cap A, or the sleepy lowercase g, and I quite dislike the rococo serifs on the caps E, F, T, L, C, G, S and Z. What I loved was the economy of the design -- its thrify proportions and excellent fit -- and its sparkle. I wondered if these attributes could be amplified, even at the expense of historical fealty, and decided to give it a shot.\n\nHappily, Esquire loved the result, and I did too. I found that the less I looked at Fleischman types in the Enschede books, the happier I was with Mercury. As Yves observes, there is indeed some Rosart in Mercury's Italics -- there's also some Fournier, and a little Luce. The italics may be the part of Mercury that departs most dramatically from Fleischman, which perhaps also explains why the italic is my favorite part of Farnhamn: Christian figured out a way to capture all the virtues of Fleischman's italics, and still make the font look badass. I also think Fenway deserves a closer look: among other things, Matthew is the only designer who has ever managed to wrangle Fleischman's figures into a workable font. Fenway's figures have all the ardor and wit of Fleischman's, and that Matthew managed to imbue his short-ranging figures with the qualities of these old-style ones speaks to both his skill and sensitivity as a designer.\n\nYves mentioned that Fenway was \"designed within certain editorial constraints,\" as obviously was Mercury, but I can't think of this as a shortcoming. External constraints give you something to push against, as Tobias likes to say; they demand that you substantiate your choices, and they provide criteria for evaluating a design's success. This is not to say that a revival that's subject to extraordinary constraints will be historically accurate (imagine a Cresci italic for cellphone screens), but the result can still achieve originality and even greatness. It will certainly be better than a historical revival that takes no position whatsoever, which to my mind is the direct route to blandness. Happily, I don't think any of our homages to Fleischman are guilty of this particular sin.\n\n"
    },
    {
      "time": "27 Jun 2005 — 10:48pm",
      "content": "Excellent post, Jonathan. Thanks for the insight into your process.\n\n"
    },
    {
      "time": "27 Jun 2005 — 10:55pm",
      "content": "....and guys — please keep this thread clean...\n\n"
    },
    {
      "time": "28 Jun 2005 — 4:19am",
      "content": "Having done several revivals, that stray from the original to varying degrees, I do of course agree with the legitimacy of adapting it to one's own muse, or that of one's client.\n\nAnd I would have to admit that typefaces do have a life of their own, beyond the initial intentions of their designer: Futura, for example, with most of Renner's signature characters falling by the wayside. But some remained, such as the straight-line j and the splayed M.\n\nThe classics have their signature characters which have not been bowdlerized by future generations: the broken lower bowl of the Baskerville \"g\", the lower left serif on the Bodoni \"b\", the different angle of the top serifs on Garamond T etc. These are the exception, however, established by long usage in fine books, prior to mass media.\n\nThe case for the original must still be made, exactly as rendered by its inventor, 'warts' and all.\n\nThe fact that the idiosyncrasies do not belong in the typography of a particular type designer, art director or publication is an indicator of mainstream conservatism when confronted with something a little \"over the top\", rather than a mistake by the original designer. In other words, it is a question of aesthetic preference, not ergonomics.\n\nSo, a mass-circulation publication's text type will have discreet features, because it must satisy the bell-curve's hump of readers' tastes, not because there is any inherent poor readability in the occasional idiosyncrasy.\n\n"
    },
    {
      "time": "28 Jun 2005 — 8:05am",
      "content": "Readability is a lot more than mere familiarity (not that the latter is even remotely understood by anybody in type anyway). Many people reject this because it makes their job harder.\n\nIn the case of Fleischmann, the idiosyncracy is also in his **structures** ; that's where his readability kicks in, and that's what has yet to be revived. Would that people would revive his **ideas** , instead of just his quaint forms.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2005 — 8:14am",
      "content": "_Would that people would revive his ideas, instead of just his quaint forms._\n\nsounds like you have your work cut out for you, hrant. ;^D\n\n"
    },
    {
      "time": "28 Jun 2005 — 8:27am",
      "content": "Touché, my friendly cowboy! But you should see what I'm doing with my Baskerville's italic. It will be what JB would have done... if he were a well-meaning zombie haunting the 21st century.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2005 — 11:32am",
      "content": "<cite>-- Would that people would revive his ideas, instead of just his quaint forms.</cite>\n\nDid you not read my post? Or do you just think my font sucks?\n\n"
    },
    {
      "time": "28 Jun 2005 — 12:28pm",
      "content": "I've always read every word you've written. Did you read Yves's review? He quotes me thus: \"To me they all seem like great fonts.\" This is because there's a lot more to a good font than Hrant's ideas of how best to carry out a revival. Type is about the user, not one of us. This however cannot stop each of us from having personal opinions.\n\nNon-literal revivalism doesn't necessarily revive the original's ideas; generally it reinterprets the **forms** according to the ideas of the reviver. This is certainly not useless. But it also doesn't go deep enough in a certain direction, in this case that of structures conducive to greater readability.\n\nWhat I was referring to was more a process of:  \n1) Trying to figure out what the original designer was thinking; not just observing/borrowing what he ended up with.  \n2) Deciding which of his (presumed) ideas are worth reviving.  \n3) Applying those ideas to forms of this age.\n\nI think Fleischmann was a genius\\*, somebody whose thoughts -not just products- are worth paying attention to. But what could he have been thinking in making his #65?! I mean beyond the superficial baroque styling. Certainly nothing that shows up in any of the fonts here, not even Kaiser's, somebody who explicitly started with my #1 above. Maybe what he was thinking is incompatible with contemporary design. Sure, that's not something to ignore; but at least let's recognize what it is, or even just what it might be, and discuss it.\n\n\\* And I don't use that word lightly.\n\nTo be fair, the sort of design I'm thinking of is quite unlikely to make it into a review of Fleischmann revivals. People would go \"Huh? That's **nothing** like the dresses Marylin used to wear!\"\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2005 — 12:29pm",
      "content": "\\> (not that the latter is even remotely understood by anybody in type anyway)\n\nOf course. Only the gifted outsider knows the truth.\n\n"
    },
    {
      "time": "28 Jun 2005 — 12:29pm",
      "content": "sorry, inadvertant double click.  \na \"delete\" button in the edit mode would be nice.\n\n"
    },
    {
      "time": "28 Jun 2005 — 12:34pm",
      "content": "No, I know virtually nothing about Familiarity! :-/ It's one of the biggest holes in my understanding - probably the biggest. I've asked Kevin for help on that, since studying empirical research is the best foundation (although it can only take you so far). So at least I want to learn, grow. My ideal business card would have \"Eternal Student\" as my title.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2005 — 12:40pm",
      "content": "\\>I know virtually nothing\n\nIf you know nothing, how can you tell whether others do or do not know anything?\n\n"
    },
    {
      "time": "28 Jun 2005 — 12:52pm",
      "content": "From the things they say, the arguments they put forth. You don't have to grasp something completely to detect that some people are just making it up as they go along, gilding the cage. That's what's so comical about the common ideas concerning Familiarity: the chirographers use it to justify their pet ideology, and the PoMo/Emigre crowd does the same, but of course both groups are very careful to avoid intelligent debate and empirical research about it... Christ, who knows what inconvenient places Thought and Logic can lead! Bah, those are just shackles on a Great Artiste, after all. Screw the reader.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2005 — 1:04pm",
      "content": "Nick wrote: _The fact that the idiosyncrasies do not belong in the typography of a particular type designer, art director or publication is an indicator of mainstream conservatism when confronted with something a little “over the top”, rather than a mistake by the original designer._\n\nThe thing with idiosyncrasies, it seems, is that they should be properly personal, as the term suggests, so the whole question of idiosyncrasies in revivals is problematic. A copied idiosycrasy is no longer idiosyncratic: it has lost the personal touch that made it meaningful and, often, made it work. When Fleischman cuts his idiosyncratic rococo details, he is exercising a personal creative decision within the decorative context of his cultural milieu. When someone copies those details in a 21st century revival, neither the personal creativity nor the cultural milieu is preserved, so what was gloriously idiosyncratic in the 18th century becomes affectation.\n\nI like true idiosyncrasy in type design. The first time I saw František Štorm's Biblon I was dancing inside. But when it comes to revivals, I'd rather see the idiosyncracies of the reviver than the slavishly copied idiosyncracies of the original.\n\n"
    },
    {
      "time": "28 Jun 2005 — 1:19pm",
      "content": "\\>empirical research\n\nI don't think you can find out anything that will help design better typefaces, in a lab.\n\nThe best lab is the centuries of research and experimentation that have occurred in the \"marketplace\" of typography, where a consensus has emerged as to what are the features desirable for readability in a typeface.\n\n"
    },
    {
      "time": "28 Jun 2005 — 1:22pm",
      "content": "In the right hands, I think that both approaches are valid. It's interesting to see the work that Gerard Unger is doing these days, as he's bringing a decidedly personal (and modern) style to a number of different historical idioms; it's equally interesting to see what happens when a thoughtful designer intentionally tries to slavishly imitate an artifact warts and all (I always think of Justin Howes' \"Founders Caslon\" here), in the interest of providing designers another type of raw materials with which to work. I think typography, and all of us here, are big enough to admit both kinds of typeface.\n\nHrant, you seem to be suggesting that Mercury looks like Fleischman. I really don't think it does; it was the intention of the design to participate in some of the qualities of Fleischman's work that I described above, but not to actually replicate any of Fleischman's shapes. (That was the point of my post, and as always you're making me regret the forty-five minutes that I spent writing it.) I'd really encourage you to look at both designs a little more closely, after which perhaps you'll share whatever additional specific observations you have.\n\nYou asked in another discussion about my thoughts regarding historical revivals in general, and in considering the question I've been straining to articulate precisely how my feelings have changed over the years. While I chew on this a little longer, I can at least leave you with this: Mercury represents the kind of work I'm most interested in doing right now, and it's consistent with an approach that Tobias and I have explored for the last few years. See [Gotham](http://web.archive.org/web/20130819205747/http:/www.typography.com/catalog/gotham/features.html) for more information.\n\n"
    },
    {
      "time": "28 Jun 2005 — 1:35pm",
      "content": "would you mind (any of you) to post a sample? so we'll see what is No.65, 66.\n\nthank you\n\n"
    },
    {
      "time": "28 Jun 2005 — 1:49pm",
      "content": "\\> I don’t think you can find out anything that will help design better typefaces, in a lab.\n\nWell, somebody who's not looking won't find it **anywhere**...  \nUnless by \"better\" one means \"more expressive of me me me\". (Shudder.)\n\n\\> you’re making me regret the forty-five minutes that I spent writing it.\n\nI shouldn't have that power over you (and I don't think I do). When you post something, it can never be a conclusive monolith. I've noticed that you tend to make long, neat, carefully-crafted posts, and if somebody takes issue with anything in it, you snap back with a one-liner. It's like you don't want anybody to touch what you've sculpted; even if it can't be the last word, at least it can float in its ether, unsoiled. Well, purity and closure are not features of free exchanges. A magazine article, sure; an interview, usually; but not Typophile. Nothing to do with me.\n\nAnd certainly don't write anything just for me! Think of all the varied people benefiting.\n\n\\> I’d really encourage you to look at both designs a little more closely\n\nWhere are the things that make the #65 so unique? The variance in finish (like the foot versus head serifs) is admittedly there, but the deeper stuff isn't.\n\n\\> You asked in another discussion about my thoughts regarding historical revivals in general\n\nYes, and I appreciate that whenever you have the time/desire. But even more welcome would be exchanges, not monologues, since that's what helps the most people most. There are people here who disagree with a lot of what you say and make -way more than me- but in the interest of comfort and tact they remain quiet. Typophile loses.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2005 — 1:57pm",
      "content": "Sorry, Tina, of course! :-/\n\n[http://www.themicrofoundry.com/other/Fman65.gif](http://web.archive.org/web/20130819205747/http:/www.themicrofoundry.com/other/Fman65.gif \"http://www.themicrofoundry.com/other/Fman65.gif\")\n\n(BTW, the bitmap font is Mana-16.)\n\nThe #66 is its Italic. I don't know much about that. Mostly because I don't see \"true italics\" as an indispensable part of a system (which doesn't make them useless however). I'm interested in Fleischmann's **ideas** , and they are most evident -or more accurately least obstructed- in the Roman #65 (something Andy Crewdson originally made me realize).\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2005 — 2:03pm",
      "content": "I gave David the scans Hrant e-mailed me, but now I notice he didn't put them online. :-/ I'll ask about it.\n\nAnd I just got a message from Robb that he's going to let me know about publishing theFenway PDFs.\n\n"
    },
    {
      "time": "28 Jun 2005 — 2:06pm",
      "content": "Thanks for all of your insights, especially to Jonathan Hoefler for your extensive  \nexplanation of your development of Mercury.\n\nJonathan, please don't be put off typophile by Hrant's obtuse remarks. Hrant benefits  \ntypophile by stirring the pot with provocative remarks. And he harms it when he goes off  \ninto his 'bizarro world,' as you put it, in which muddled generalizations are mixed with  \npersonal insults. Since I enjoy typophile, I just try to appreciate Hrant when he is on point  \nand ignore him when he goes bizarro. Thousands will read your comments, so don't be  \nput off by the loudest guy in the room.\n\n"
    },
    {
      "time": "28 Jun 2005 — 2:19pm",
      "content": "Hey, it's even harder for me! I have to try to ignore that you're an apologist for  \nfascism and rape. That's worse than the worst font anybody could ever make.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2005 — 2:36pm",
      "content": "I think you owe William an apology, Hrant.\n\n"
    },
    {
      "time": "28 Jun 2005 — 2:48pm",
      "content": "Maybe. But I guess I should apologize to Typophile. I'm sorry.\n\nWilliam can cause me to lose control in disgust, and I can't just shut that on and off, especially when he uses the ruse of pampering Jonathan's psyche to mount a classic veiled little Western personal attack. We're insulted by different things; you're not more human than I am.\n\nOf the hundreds and hundreds of type people I've met, he's the only one I can't stand; think about what that implies. I guess as a self-defense I want people to know that, to know what he's like under the neoclassical veneer.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2005 — 2:50pm",
      "content": "Nothing riles Hrant more than the threat of being ignored.\n\n;/\n\n"
    },
    {
      "time": "28 Jun 2005 — 2:51pm",
      "content": "Yeah, that's out of line. If I were a moderator, I would delete that post.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20130819205747/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "28 Jun 2005 — 3:17pm",
      "content": "Hrant, I said you owed him an apology, not another round of insults.\n\nWhat's all this anti-West BS anyway?  \nI thought you were proud to live in LA.\n\n"
    },
    {
      "time": "28 Jun 2005 — 3:47pm",
      "content": "Have you been to LA? Anyway. There are good things about the West, and bad things; same for the East (like its sickly fatalism). I'm in the middle. This here is a Western environment. I like to point out flaws, with the hope of improvement, no matter where I am. When I was in Beirut in April I was complaining about the problems there. That should explain a lot. As for William, to me he primarily represents a lot of the things wrong with the West, things that are causing my people grief (and not just 90 years ago). This is more important than fonts. Most people here enjoy the luxury of not really being under cultural/ethnic pressure. They are -understandably- more interested in enforcing a stable social environment, by censorship if need be. They don't understand the anger somebody like me can feel, so they have trouble absorbing the resultant lapses of control. Lucky them.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2005 — 4:57pm",
      "content": "\\>Most people here enjoy the luxury of not really being under cultural/ethnic pressure.\n\nWilliam was right to call you on \"muddled generalizations\".  \nYou're making an awful lot of assumptions about \"most people\".  \nHow can you presume to know, and minimize, the pressures others feel, in relation to your own, as an excuse for losing your cool?\n\nThe fact is, you are a bully who enjoys putting people down.  \nNo sooner has Jonathan dipped his feet in the Typophile waters than you accuse him of not properly getting into the spirit of exchange, diss his typeface for not being deep enough, and hint darkly that there are hordes of lurkers who dislike his work even more than you do. Yeah, you want to engage him in a pissing match, but he has too much class to take the bait.  \nMost recently, you have satirized me as the \"Great Artiste\" whose attitude is \"Screw the reader\".  \nWhere do I cast my ballot to vote you off the show?\n\n"
    },
    {
      "time": "28 Jun 2005 — 5:59pm",
      "content": "I guess the same place you do everything else, like formulate your arguments, hoard all the perceived insults (and not just against you), and even design type: your imagination! Voting. A show. Indeed.\n\nBTW, if anybody ever suggested that William be excluded from Typophile, for whatever reason real or imagined, I would be the first to oppose them. If that's too complex for you, I understand.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2005 — 7:27pm",
      "content": "Maybe it was the pizza\\* I just had, but: William, I'm sorry for exploding. I can't and won't apologize for how I feel about you, but I can and should apologize for how I behave, no matter how anybody else does. Especially in an environment I value so much.\n\n\\* So was it the Italians or the Chinese who invented it? ;-\\>\n\n--\n\nBut the questions, those remain:  \nWhat was Fleischmann thinking? If the funky stuff in the #65 is not a mistake (and how could it be? not a rhetorical question), why does it go unrevived? Also: am I the only person who wants to hear Nick, Jonathan, and the other Nick discuss (as opposed to monologue, even thought that's better than nothing) the [de]merits of revivalism, in all -or at least some- of its many shades? In the furore I forgot to commend Jonathan for his \"I’ve been straining to articulate precisely how my feelings have changed over the years.\" Change is good. Strain builds character. And maybe if/when Jonathan goes to the trouble of elaborating further, that can be a springboard for a catalytic **exchange** , something the Undecided (which I myself always am to some extent, if never totally) certainly value greatly.\n\nI hope we care about the content, about Typophile, more than about exposing mutual character flaws and feeling insulted. If we do, we will not fail to address the **content**.\n\nhhp\n\n"
    }
  ]
}
