{
  "id": "13309",
  "title": "TypeCon2006 and SOTA",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "1. Typecon 2006 - where (& why?), when?\n\n2. SOTA — who’s the founder? what was the idea back then — and today? why and how to join?\n\n",
  "author": "parker",
  "time": "Sun, 2005-06-26 15:38",
  "uid": "4955",
  "comments": [
    {
      "time": " Sun, 2005-06-26 17:12",
      "content": "1. It’s a badly kept secret, but still a secret.\n\n2. Bob Colby. A support group for type lovers (then and now). [www.typesociety.org](http://web.archive.org/web/20050728011302/http:/www.typesociety.org/). To support the work of the organization, especially if you can’t make to TypeCon.\n\nSi\n\n"
    },
    {
      "time": " Sun, 2005-06-26 17:19",
      "content": "The TypeCon2006 venue will be announced in New York - until then, the location is heavily cloaked under a veil of secrecy ;) Why at that for-now-undisclosed location? Tell ya later. Count on the ‘con happening in the last half of July as usual.\n\nSi summed up SOTA and its founding by Bob - please visit the website to find out more [www.typesociety.org](http://web.archive.org/web/20050728011302/http:/www.typesociety.org/)\n\nand email us at info |at| typesociety.org if you need more info.\n\n"
    },
    {
      "time": " Sun, 2005-06-26 18:54",
      "content": "1. I hope it will be Tijuana (if you guys had any sense ;-) but I fear it will be Chicago.\n\n2. Bob’s original intent was much more inclusive, maybe too ambitious: he wanted a broader base beyond just type people, like bibliophiles, etc. I don’t know which way is better though.\n\nhhp\n\n"
    },
    {
      "time": " Sun, 2005-06-26 18:58",
      "content": "BTW, the original SoTA membership (formed during the first conference) was tiny. I wonder if we could see that list, somehow. Another mystery: all but one of the speakers that first year accepted to not turn in their expenses for reimbursement (because otherwise Bob would have lost his life savings or something). Who was it?\n\nhhp\n\n"
    },
    {
      "time": " Sun, 2005-06-26 20:25",
      "content": "Tina - you ask some interesting questions but please be more descriptive with your thread titles. Clearer titles help when there are several threads on the same topic — such as TypeCon. I edited the title of this thread to give you the idea.\n\n"
    },
    {
      "time": " Sun, 2005-06-26 21:58",
      "content": "I love Chicago.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20050728011302/http:/www.typeoff.de/)\n\n"
    },
    {
      "time": " Mon, 2005-06-27 00:09",
      "content": "thanks. I didn’t know this is a top secret. Stephen — I was hungry (when I’m hungry Idon’t think. for some reason :) )\n\nI’ll read about SOTA (and I’m sure I’ll have more questions)\n\n"
    },
    {
      "time": " Mon, 2005-07-25 21:34",
      "content": "So, is there any word from Typecon regarding the location of next year’s con?\n\n-Jon-\n\n"
    },
    {
      "time": " Mon, 2005-07-25 22:01",
      "content": "Boston.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20050728011302/http:/www.typeoff.de/)\n\n"
    },
    {
      "time": " Tue, 2005-07-26 04:22",
      "content": "I was able to talk with Bob at TypeCon in NYC and he had said there were only a hundred or so people at the first two TypeCons in 1998 and 1999. Also it was in no was supported by any organizations. He couldn’t believe how large it and SOTA had become in the last few years. It was then in Westborough, Mass. It will be nice to see the conference return to Mass. next year.\n\n"
    },
    {
      "time": " Tue, 2005-07-26 05:53",
      "content": "\\>Bob’s original intent was much more inclusive\n\nRead the SOTA charter: it’s inclusive.  \nhttp://www.typesociety.org/about.html  \nMaking that happen is a logistical challenge, not exclusionary.  \nTwo of the most interesting presentations at TypeCon NY were on grafitti and tattooing!  \nI hope you will come to Boston, volunteer your time (volunteers are crucial to help the show run), and persuade lots of bibliophiles to attend.\n\n"
    },
    {
      "time": " Tue, 2005-07-26 08:27",
      "content": "\\> there were only a hundred or so people at the first two TypeCons in 1998 and 1999.\n\nThe second one was in 2000, and from what I know the headcount was about 30…\n\nYou know what would be fun? To get a list of the original attendees from the first conference.\n\n\\> Read the SOTA charter: it’s inclusive.\n\nMore legalese. Bob was chronically unhappy that he could only get type designers to show up. Nobody is unhappy now. That’s that.\n\n\\> persuade lots of bibliophiles to attend.\n\nWhy would I do that? I prefer to hang out with type designers. Specifically text type designers.\n\nhhp\n\n"
    },
    {
      "time": " Tue, 2005-07-26 09:42",
      "content": "Ah, yes, I remember the early days. I designed the logos and some of the other materials, but I was never able to attend. I thoroughly enjoyed typeradio this year, though. And some day, I will manage to show up! Are the dates set for Boston next year?\n\n"
    },
    {
      "time": " Tue, 2005-07-26 10:41",
      "content": "Hrant is right, TypeCon 2000 had about 30 attendees (including speakers) I wrote up a little account at the time…\n\nDay 1 http://www.microsoft.com/typography/links/news.aspx?NID=1323  \nDay 2 http://www.microsoft.com/typography/links/News.aspx?NID=1324  \nDay 3 [http://www.microsoft.com/typography/links/News.aspx?NID=1325](http://web.archive.org/web/20050728011302/http:/www.microsoft.com/typography/links/News.aspx?NID=1325)\n\nPictures [http://www.microsoft.com/typography/links/news.aspx?NID=1331](http://web.archive.org/web/20050728011302/http:/www.microsoft.com/typography/links/news.aspx?NID=1331)\n\nI ♥ TC, Si\n\n"
    },
    {
      "time": " Tue, 2005-07-26 16:00",
      "content": "TypeCon2006 has a lot to live up to as this year was off the hoozazzle. But, I’m willing to bet that it will exceed the joy of this year’s event. Boston has a lot to offer to the Typophile who might attend.\n\n"
    },
    {
      "time": " Tue, 2005-07-26 16:16",
      "content": "BOOOOOSTOOOOOOOOOOOON!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nI love that dirty water.\n\n(Although you can swim in it now)\n\n"
    },
    {
      "time": " Tue, 2005-07-26 16:22",
      "content": "Can’t forget calling MC the “shiznit”.\n\n"
    },
    {
      "time": " Wed, 2005-07-27 11:11",
      "content": "Hrant: _I hope it will be Tijuana (if you guys had any sense_\n\nFor a guy who deplores mixing the discussion of lettering arts with type, you sure picked an odd host city to fight for. That said, they do have some [great stuff](http://web.archive.org/web/20050728011302/http:/www.flickr.com/photos/chalkdog/29031949/) down there.\n\n"
    },
    {
      "time": " Wed, 2005-07-27 12:47",
      "content": "Mexico City would be a fantastic idea if we want to increase participation of the Latin American contingent. Cheaper for me to fly there from SFO than NYC or Boston, too, and rooms at a nice convention hotel won’t run much more than US$120 a night, and I bet that rate could be negotiated down to under $100. Lots of great letterpress and bookbinding there too, lots of great bookshops, fantastic restaurants.\n\n"
    },
    {
      "time": " Wed, 2005-07-27 13:05",
      "content": "Stephen:  \n1) TypeCon is lettering-centric. I’m working with it.  \n2) Tijuana has a lot more than vernacular (gag me with a spoon for using that term) lettering. The fact is, if you’re a graphic designer in Mexico, you better be in Tijuana.\\* Probably because it’s so seriously eclectic (being so close to the US).  \n3) TypeCon is also fun-centric. Enough said.\n\n\\* This has been formally authenticated by no less than Armin Vit.\n\nAs soon as SoTA feels ready to go outside the US (sorry Canada, you’re too much like a really big state), Tijuana is the clear choice (at least for the first time). Then, Buenos Aires. Go where ATypI doesn’t.\n\nhhp\n\n"
    },
    {
      "time": " Wed, 2005-07-27 14:07",
      "content": "\\>TypeCon is lettering-centric.\n\nActually, it’s centred on type, as the name would suggest.\n\n\\*\\*\\*\n\nA significant portion of attendees at each Typecon come from the local area.  \nPeople get involved with the conference years before it is located in their area.  \nAt the moment, there doesn’t appear to be a “Tijuana contingent”, so it’s unlikely that TypeCon will be held there.\n\nWe’ve had regular attendance by people from Sao Paulo, so that would be a better bet than Buenos Aires.\n\n"
    },
    {
      "time": " Wed, 2005-07-27 14:22",
      "content": "And TJ is so close to LA Hrant?  \n:-)\n\nChrisL\n\n"
    },
    {
      "time": " Wed, 2005-07-27 14:24",
      "content": "Compared to the ATypI conferences, TypeCon leans quite strongly towards lettering. Also, TypeCon generally has a less type-technical bent than some of us (like Thomas Phinney) would like - but that’s OK - most attendees seem to prefer the pronounced lettering slant. But denying this slant makes one seem like a lawyer. For Michael Jackson.\n\nAs for Sao Paulo, it isn’t a bad choice, but it seems too far from the states for SoTA right now; Tijuana is a much better choice.\\* Also, more important than the number of past TypeCon attendees from a country\\*\\* is -as you say- the number of **locals** who would attend. You’d do well to pay attention to things like tipoGrafica magazine. And Typophile.\n\n\\* I gave a talk there last year, and believe me, the interest in type is over-flowing, and the youthful energy is singular. I got the best Q&A questions there I’ve ever heard. Wasn’t Tamye in touch with Jorge de Buen on this? He’s your man.\n\n\\*\\* And don’t forget to account for the respective economic situations when gauging apparent interest. There are virtually no Argentinian entries in the (expensive) TDC contest, but a lot of great type has been coming out from down there, as attested in part by the results of Morisawa, a free competition.\n\nhhp\n\n"
    },
    {
      "time": " Wed, 2005-07-27 14:26",
      "content": "Chris, last year I also went to Novosibirsk, Siberia. For a day-and-a-half.\n\nhhp\n\n"
    }
  ]
}
