{
  "id": "13312",
  "title": "Open Type font development",
  "forum": "Build",
  "tags": [

  ],
  "content": "Since type is progressing towards newer technology, how soon do you think it will be before Open Type technology is completely embraced by software developers? Which Type format do you personally prefer when generating your intial designs?\n\n",
  "author": "Terry Biddle",
  "time": "26 June, 2005 - 7:34pm",
  "uid": "7475",
  "comments": [
    {
      "time": " 26 June, 2005 - 7:43pm",
      "content": "OpenType is fully embraced now by software developers, as least by Windows devs and by Open Source devs - as it’s really the only accepted way to support complex script languages like Arabic.\n\n"
    },
    {
      "time": " 26 June, 2005 - 10:03pm",
      "content": "Terry, I work in a Mac, and generate all of my work files as Mac PS. But I will soon be generating OpenType files, as that is the only way to test OpenType features ;-)\n\nI’ll be generating OT CFF, since I’m drawing with PostScript outlines.\n\nI think that all of the big foundries have put everything on OpenType by now. You gotta wonder about some of the smaller ones who haven’t…  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20051125105130/http:/www.typeoff.de/)\n\n"
    },
    {
      "time": " 27 June, 2005 - 7:35am",
      "content": "Well, I know type foundries are embracing Open Type…I’m speaking specifically about design and type related software (i.e. Adobe and Microsoft products). I know that those companies are behind Open Type technology, I just wonder why they don’t seem fully integrated into their software yet.\n\n"
    },
    {
      "time": " 27 June, 2005 - 7:38am",
      "content": "I also do all my generating in Mac PS, but I often want to rip my hair out when naming multiple fonts within a family to a suitcase. As I’ve not generated any type in Open Type, how is hinting and code different from that of True Type and Postscript?\n\n"
    },
    {
      "time": " 27 June, 2005 - 6:45pm",
      "content": "_I think that all of the big foundries have put everything on OpenType by now._\n\nI contacted Font Bureau about a year ago to ask if they offered their libarary in OT format. They said that their clientelle hasn’t really been demanding it, so they don’t offer OT fonts. The did say they would develop OT fonts if I were interested. I think there are several foundries that have yet to offer anything in OpenType.\n\n"
    },
    {
      "time": " 28 June, 2005 - 5:32am",
      "content": "Now that Apple and Quark are finally getting on the Opentype bandwagon, I think that demand will increase dramatically, especially in shops that handle a lot of cross-platform work. And I suppose that I need to get on the bandwagon as well. I just wish that (a) the technical info offered by Adobe and Microsoft weren’t written in such a high level of geekspeak; or (b) that someone would write a manual/treatise that made the format a little more accessible; or (c) that I had the time to attend an in-depth seminar (the one at the aTYPI convention in Helsinki looks very promising, but no way am I going to be able to make that one). Anyone have any suggestions on option (b)?\n\n"
    },
    {
      "time": " 29 June, 2005 - 9:15am",
      "content": "nick, i’d gladly help you with some OT development. if you’re interested, please contact me and we’ll work something out.\n\n"
    },
    {
      "time": " 29 June, 2005 - 10:05am",
      "content": "Paul,\n\nThanks for the offer: I would be delighted to discuss the possibilities. However, the webpage info in your personal profile appears to be out of date. Please drop me a note [here](mailto:himself@nicksfonts.com).\n\n"
    }
  ]
}
