{
  "id": "1331",
  "title": "Enfin Javal!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "So yesterday afternoon I finally got my hands on an actual book by Javal, specifically his cornerstone \"Physiologie de la lecture et de l'\n\n",
  "author": "hrant",
  "time": "19 Sep 2003 — 1:23pm",
  "uid": "1250",
  "comments": [
    {
      "time": "19 Sep 2003 — 1:30pm",
      "content": "\\> (no, that's not a type)   \n   \nAh, a Freudian slip? :-/ Well, _that_ of course _was_ a typo!   \n   \nhhp\n\n"
    },
    {
      "time": "19 Sep 2003 — 2:05pm",
      "content": "Interesting connection!   \n   \nhhp\n\n"
    },
    {
      "time": "19 Sep 2003 — 3:24pm",
      "content": "Well, Javal is conceptually exactly the reverse of the later Bauhaus and so on.   \n   \nMake forms different as possible to help word shapes. Note that different doesn't mean that they seems different at actual size of their use for the reader. (Beatrice Warde globets are not far!)\n\n"
    },
    {
      "time": "19 Sep 2003 — 5:13pm",
      "content": "\\> letter shape simplification   \n   \nI think maybe a better way to look at this (and thereby compare it to Bauhaus stuff) is letterform _\"essentialization\"_. That's not a word, but you know what I mean.   \n   \n\\> do you have more samples? Are you working on more?   \n   \nWell, I have the book for [at least] another two weeks, and I'll be perusing it, although I probably won't read the whole thing - the rest of my reading list would gang up and stage a mutiny overnight. Javal shows that funky font at various sizes, but there's a lot of other strange diagrams and such too. Stay posted!   \n   \nhhp\n\n"
    },
    {
      "time": "22 Sep 2003 — 8:50am",
      "content": "So I skimmed through Javal's book, reading some short passages, photocopying longer ones for later (who knows when...), and scanning up a few things. What might be relevant in this thread is a comparison of the two alphabets made by Dreyfuss for Javal (although it's not clear how much direct guidance he got). Except for that large sample I showed above, they're both shown reduced by a \"photoengraving\" method to very small sizes. The largest size is 5 point, and here's what they look like:   \n   \n ![Javal_a.gif](http://web.archive.org/web/20131020095451im_/http:/www.typophile.com/forums/messages/30/16606.gif)   \n   \n ![Javal_b.gif](http://web.archive.org/web/20131020095451im_/http:/www.typophile.com/forums/messages/30/16607.gif)   \n   \nJaval concludes by saying that the first one doesn't go far enough while the second goes too far.   \n   \n--   \n   \nTiffany, I didn't see any explicit connections made by Javal with graphic minimalism (the Bauhaus per se didn't yet exist at his time), but I still think there's some commonality there, even though as JF says their conscious directions ended up very different.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Sep 2003 — 2:07pm",
      "content": "The Dreyfus' alphabets are really interesting   \n(the top one on your last post is quite ugly   \nindeed, but I like the bottom one).   \nNow, why did he design them for Javal? Why is   \nbiggest size 5 pts? I suppose the size decision   \nwas very important to his research?   \n   \nAnd wasn't Javal blind by that time ( [this article](http://web.archive.org/web/20131020095451/http:/www.ophthalmologytimes.com/ophthalmologytimes/article/articleDetail.jsp?id=28363)   \nsays he was completely blind by 1900!) ?\n\n"
    },
    {
      "time": "23 Sep 2003 — 2:56pm",
      "content": "This is classic:   \n\"His body was cremated with the exception of   \n his left eye, which he had promised to send   \n to Priestly Smith upon his death.\"   \n   \nDreyfuss did the graphic work most probably because he was the illustrator (and a very good one, looking at his stuff in the book). I'm not sure when Javal evaluated Dreyfuss's alphabets, but I guess he must have still had enough of his vision, otherwise it would be pretty funny. The book must have come out some time afterwards\\*. On the other hand, Javal did continue to contribute greatly to science (including work on Braille) way after his blindness. He was da man.   \n   \n\\*   \nBut he _must_ have done the dedication in the book after going blind!   \n   \n ![Javal_sig.jpg](http://web.archive.org/web/20131020095451im_/http:/www.typophile.com/forums/messages/30/16780.jpg)   \n   \nThat's better than my handwriting, and I have 20/15 vision!   \n   \n\\> Why is biggest size 5 pts?   \n   \nI guess essentially because larger sizes are always legible if you give yourself enough time. Although Javal was the first to show that we read in saccades (and not in a flow), I don't think he -or anybody else- yet knew about boumas and such. Maybe he didn't realize that readability is distinct from legibility.   \n   \nAlso, the chapter containing those alphabets is called   \n\"Th\n\n"
    },
    {
      "time": "24 Sep 2003 — 11:18am",
      "content": "\\> That's better than my handwriting, and I have   \n\\> 20/15 vision!   \n   \nYeah, that's amazing indeed.   \nBut, of course, for \"non-blind\" people, better vision   \ndoesn't necessarily mean better handwriting.   \n   \n\\> it's about saving space.   \n   \nThanks. I thought it was related to his theories   \nabout \"speed reading\", since, apparently, Javal is   \nbetter known because of those theories.   \n   \nAnother thing:   \n\\> Javal concludes by saying that the first one   \n\\> doesn't go far enough while the second goes   \n\\> too far.   \n   \nDoes he say why? :-)\n\n"
    },
    {
      "time": "24 Sep 2003 — 11:52am",
      "content": "\\> \"speed reading\"   \n   \nWell, at any size speed has relevance - it's all One Big Thing, with different factors pulling in different directions. Although I guess you can target speed for an optimal size as well (which would be much higher than 5).   \n   \nBTW, he actually shows two versions of the second alphabet, one with shorter extenders than the one I've scanned up.   \n   \n\\> Does he say why?   \n   \nNot really. The language is vague\\*. I had to look up a couple of words but still can't extract any possible reasoning. The only fault he explicitly states about the second one is that it requires great illumination. The first he just says it's not innovative enough!   \n   \n\\*   \nHere's the closing paragraph:   \n ![Javal_last.gif](http://web.archive.org/web/20131020095451im_/http:/www.typophile.com/forums/messages/30/16827.gif)   \n   \nhhp\n\n"
    },
    {
      "time": "24 Sep 2003 — 4:00pm",
      "content": "What typeface is used for that paragraph, Hrant, do you know?\n\n"
    },
    {
      "time": "25 Sep 2003 — 12:16am",
      "content": "It's interesting, isn't it? Kind of like a missing link in the evolutionary ladder between Baskerville and Didot. Some of the glyphs are superb, and rare.   \n   \n ![Javal_detail.gif](http://web.archive.org/web/20131020095451im_/http:/www.typophile.com/forums/messages/30/16876.gif)   \n   \nLook at the power of the \"y\", and the functional elegance of the \"g\", and the interesting skewed \"v\", and the small x-height. It's tempting to think yet again: \"they don't make them like they used to\"...   \n   \nBTW, unlike the vast majority of legibility researchers, Javal had great typographic sensitivity (even though he recommended leading values most good contemporary typographers would see as too little - but I personally think whitespace is overrated these days). You can tell just by looking at the first page:   \n   \n ![Javal_first1.gif](http://web.archive.org/web/20131020095451im_/http:/www.typophile.com/forums/messages/30/16877.gif)   \n   \nThe first word of the whole book, the title \"Introduction\" has a footnote that's better than your average colophon!   \n   \n ![Javal_first2.gif](http://web.archive.org/web/20131020095451im_/http:/www.typophile.com/forums/messages/30/16878.gif)   \n   \nIn the footnote he says that the typeface (in three sizes) was the work of Deberny (I guess before they joined with Peignot), but on that page 226 he doesn't add anything more about it.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Sep 2003 — 10:33am",
      "content": "\\> \"they don't make them like they used to\"...   \n   \nTempting indeed, but dangerous...   \nThat type is very nice, yes, but the \"g\" still   \nlooks strange to me.   \n   \n\\> whitespace is overrated these days   \n   \nLOL. :-)   \nNot sure if I agree or not...   \n   \nBTW: does \"C'est une sorte de gageure\" means   \nsomething like \"It's sort of impossible\"?   \nBabelfish couldn't translate that.\n\n"
    },
    {
      "time": "25 Sep 2003 — 10:45am",
      "content": "\\> Tempting indeed, but dangerous...   \n   \nAnd false. I don't really believe it myself - it's just that there's so much crap out there these days.   \n   \nThe \"g\" I personally like, but the vertical proportions of the font are off.   \n   \nMy Collins-Robert translates \"gageure\" as something like \"almost impossible task\".   \n   \nhhp\n\n"
    },
    {
      "time": "25 Sep 2003 — 12:35pm",
      "content": "Being a (low) myope myself, I must agree with that paragraph.   \nThis is great:   \n   \n\"...our modern writings, since that of the young schoolboy until   \nthe typography more elegant, constitute an offence with the good   \ndirection and are tolerated only thanks to the secular routine which   \ntransmits them from generation to generation...\" (Babelfish translation)\n\n"
    },
    {
      "time": "26 Sep 2003 — 3:44pm",
      "content": "\"It's interesting, isn't it? Kind of like a missing link in the evolutionary ladder between Baskerville and Didot. Some of the glyphs are superb, and rare.\"   \n   \nIt is quite nice. A lot of paperback books from the 50s have the same feeling to them that I get from looking at that face. I wish it has a digital equivalent ![:-(](http://web.archive.org/web/20131020095451im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": "26 Sep 2003 — 6:10pm",
      "content": "If anybody is serious about digitizing it, I can provide 600 dpi scans (like the \"typographie\" above), and would only ask for passing credit. That's assuming there isn't an actual type specimen of it somewhere accessible.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Sep 2003 — 8:51pm",
      "content": "I've been wanting to make myself a font for awhile now, this might be a good thing to start on as opposed to creating my own alphabet first. I am pretty handy with the pen tool as well...   \n   \nCould I get them from you, Hrant?\n\n"
    },
    {
      "time": "27 Sep 2003 — 4:22pm",
      "content": "\\> Could I get them from you, Hrant?   \n   \nI think we can do this. Although the more I look at this design the more I want to do it myself! :-/ It seems to represent that \"missing link\" even more than I originally thought. I realized this in looking at the italic (for which I was happy to find a setting in English):   \n   \n [http://www.themicrofoundry.com/other/Javal\\_italic.gif](http://web.archive.org/web/20131020095451/http:/www.themicrofoundry.com/other/Javal_italic.gif)   \n   \nIt's a slanted roman of the highest order - the best I've ever seen. Not a result of saving money (like the ATF slanted romans), but an ideology tempered with typographic intelligence (unlike the fanatical approach of Morison). I thought my Patria italic was progressive - this is much more so. And it was designed over a hunder years ago!   \n   \nBut the roman is no slouch either. The whole seems to be what the Grandjean/Jaugeon effort was _supposed_ to be, without the sterility of the Didone class. A new well of possibilities!   \n   \n--   \n   \nThe thing is, Chris, I'm not sure you even need me. There _must_ be good specimens of this design. I think you should ask JFP for help in tracking those down (and in making sure nobody already has the rights to it - which I highly doubt). What you'd be looking for is Maison Deberny specimens from the late 19th century, or very early 20th.   \n   \nBut let me know if you have other preferences of how to do this. Hey, maybe we should make it a Typophile collaboration? A revival might in fact be more managable for that model than an original creation - although not as intellectually challenging.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Sep 2003 — 8:45pm",
      "content": "A collaboration would be interesting.   \n   \nI haven't the resources to go about tracking specimens down, as much as I would like to; I've only seen those few samples, yet I've become quite enamoured with the design.   \n   \nAnd you're right, that italic is quite nice.\n\n"
    },
    {
      "time": "27 Sep 2003 — 10:58pm",
      "content": "Ok, here's what I'd suggest:   \nBarring a sudden general interest in doing a collaborative Typophile deal, I'll try to track down the best specimen available: besides JFP, a \"font-line\" lead is Christian Paput (the Imprimerie Nationale's punchcutter, who once graciously gave me a tour of that venerable institution), although I only have a snailmail address for him. Once the best sample is made available, I'll get in touch with you and maybe I could serve as an informal consultant in the project, especially if you get brave and decide to do two optical masters (as this design deserves). Sound good?   \n   \nhhp\n\n"
    },
    {
      "time": "28 Sep 2003 — 2:53pm",
      "content": "Okay.\n\n"
    },
    {
      "time": "29 Sep 2003 — 9:54am",
      "content": "Does anybody here have access to \"Arts et M\n\n"
    },
    {
      "time": "29 Sep 2003 — 10:19am",
      "content": "Is there anybody with access to the Garbhorn Collection at the SF Public Library\\* who's willing to help out?   \n   \n\\* [http://sfpl4.sfpl.org/librarylocations/main/bookarts/typespecs.htm](http://web.archive.org/web/20131020095451/http:/sfpl4.sfpl.org/librarylocations/main/bookarts/typespecs.htm)   \n   \nI'm looking for these two:   \n\"   \nDeberny. Fonderie Deberny & Cie, Tuleu & Girard, Srs. Le livret typographique. Sp\n\n"
    },
    {
      "time": "30 Sep 2003 — 8:34am",
      "content": "Hrant --   \n   \nRegarding _Arts et M_\n\n"
    },
    {
      "time": "30 Sep 2003 — 8:41am",
      "content": "Right, that's why I was looking for a body at RIT! Or at least an index. I need to see if any of the issue show the #16/#17/#18, although I'm realizing that's unlikely, mostly because AeMG started much later.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Sep 2003 — 10:50am",
      "content": "Sorry--I haven't been following, 'til Kent alerted me to your post. What exactly are you looking for? Something in AMG or a DP specimen. We have both at the Cary Collection & I'm the one who did the AMG index above, which has since been moved to [http://ellie.rit.edu:1213/](http://web.archive.org/web/20131020095451/http:/ellie.rit.edu:1213/)\n\n"
    },
    {
      "time": "30 Sep 2003 — 12:28pm",
      "content": "Volume 1 from the DP 1924 specimen has showings of the \"labeurs ordinaires\" which include all the Deberny fonts named by a series number or letter, namely 10, 11, 12, 14, 15 16, 17 or series A, E, G, K, O, X. There's no series #18 in this volume. (Incidentally this is the first book specimen to come from Deberny et Peignot as a merged company. Merger happened in 1923.)   \n   \n15, 16 & 17 include the open lower bowl design for l.c. \"g\" all in small sizes--until in 16, which goes to 30 & 36 pt., then switches to a one story \"g.\" Strange! Can't tell which typeface is what you're looking for without taking some pics and looking at better ones from your book--they are all very similar.   \n   \nIn this volume, #16 seems to be the most completed typeface, with more weights, from 5 pt. to 36, and even a showing of an initials font.   \n   \nWhat next?\n\n"
    },
    {
      "time": "30 Sep 2003 — 3:28pm",
      "content": "Wow, Amelia, great!! (Thanks Kent.)   \nYes, I saw that the Cary had that stuff, but wasn't expecting so much help so soon!   \n   \nAs much as AMG seems fascinating, I don't need anything from it right now if you have actual Deberny specimens of the fonts in question. The fonts were made under the direction of Tuleu some time between 1878 and 1905, but I guess they were still selling them in 1923. They strike me as the sort of thing Charles Peignot wouldn't have liked, so maybe by the next specimen they got rid of them? Anyway, that's just a side question.   \n   \n\\> switches to a one story \"g.\"   \n   \nFirst: switching to a monocular \"g\" for the display sizes makes perfect sense to me (it's great to see some people had already realized that and actually implemented it long ago\\*) because the binocular \"g\" is great for readability, but lacks harmony with the rest of the alphabet during conscious appreciation. I will be doing what Tuleu did in my own text fonts from now on.   \n   \n\\* I also like that old French style of old-style figures (with the 3 and 5 ascending) more than our general convention.   \n   \nThat \"g\" is actually why I thought the #17 was the one I wanted. In the Javal book (which uses the #17 and the #18\\*) he shows a sample of the #16 at 30 point, and it has the mono \"g\". So I thought the #17 was the one I wanted. I'm still a little bit confused though because he also shows a 5 point sample of #16, and that has the mono \"g\" as well\\*\\*. So I would most like to see samples of #15-#16 I guess. What do you see as the differences between them? And what are the chances you could provide a hi-res scan of the full character set?   \n   \n\\* Javal mentions the #18 as being a variation on the #17 (with longer descenders, bringing the 9 point forms to 10 point). Not sure where it ended up. BTW, he also mentions the 8 point #17 as being a short-descender version of its 9 point - which would make it a nice cheap method of optical scaling.   \n   \n\\*\\* Could they have switched to a mono \"g\" at the bottom range as well, to cater to legibility?! That would rule even more.   \n   \nIn case you're wondering why Chris and I like this design:   \nI think Chris likes it because he likes it (the best reason!), while I like it mostly because of its evolutionary singularity: it's like a \"missing\" offshoot from the Romain du Roi. I've been reading up on Fournier, Baskerville, Bodoni, Luce and Didot, and none of them are even close to it. Not even Grandjean had an italic that \"pure\". It's like an entire class of font that I'd never seen before. Both Chris and I would like to see it digitized - preferably by ourselves! BTW, do you see any legal/ethical complications with that?   \n   \nWaiting for a reply with bated breath! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "30 Sep 2003 — 4:54pm",
      "content": "\\> I would most like to see samples of #15-#16   \n   \nSorry, I meant all three: #15, #16 and #17.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Sep 2003 — 10:28pm",
      "content": "Amelia, in case it might help figuring out what's what, I've made a collage from the 10 point (Didot measure) type in the Javal book (the #18, I think - which is apparently just a #17 with longer extenders, like I said). The caps are a larger size though (around 18 point).   \n   \n ![Javal_18.gif](http://web.archive.org/web/20131020095451im_/http:/www.typophile.com/forums/clipart/your_image.gif)   \n   \nhhp\n\n"
    },
    {
      "time": "30 Sep 2003 — 10:32pm",
      "content": "[http://www.themicrofoundry.com/other/Javal\\_18.gif](http://web.archive.org/web/20131020095451/http:/www.themicrofoundry.com/other/Javal_18.gif)   \n   \nhhp\n\n"
    },
    {
      "time": "19 Sep 2003 — 1:59pm",
      "content": "I'm horrible with dates. Perhaps this is the beginning of simplifying the lettershapes ala bauhaus. Your small sample reminds me, visually, of some of Massin's work.   \n   \n[edit]   \n   \nAlthough Massin was never related with the bauhaus.\n\n"
    },
    {
      "time": "19 Sep 2003 — 4:38pm",
      "content": "I was thinking along the lines of _letter shape simplification_ when I made the comparison to the bauhaus. However, I can see how the word shapes in Hrant's sample do show the concept of which you speak JF. It is interesting that this is so apparent. I'm going to look through some books. Although the visual tie to the bauhaus is still there for me, perhaps it is not Massin whom I am really reminded.   \n   \nHrant, do you have more samples? Are you working on more?\n\n"
    },
    {
      "time": "3 Aug 2008 — 12:11pm",
      "content": "I have been studying this work by Emile Javal, so naturally have ended up here.\n\nI should mention that the reference to page 226 makes more sence if you look on page 225 where M. Telu gets a mention as does the beginning of the turned paragraph thanks ‘La maison Deberny’.\n\nI think seeing the series 16 type as the missing link is interesting.\n\nAs I try to transcribe and create a gist translation of Chapter XVII, I see that some of M. Javal talks about is a typographic missing link. He is making many observations some of which I have not specifically had related to me before, but were more inert understandings.\n\nHe does have a somewhat methodical approach conducting his own experiments (apparently at home) and takes those results as a basis for his criticism.\n\nI wonder if M. Javal consulted with M. Telu at Deberney et Cie in the development of series 16 (He and M. Telu definatly communicated), or that his finding are much based on what was relayed to him by M. Telu. M. Javal taking it upon himself to push typography further.\n\nIt has been good to see that kakaze continued with research and developed \"Telu\" - Good!\n\n[http://home.cfl.rr.com/kakaze/type/tuleuspecimen.pdf](http://web.archive.org/web/20131020095451/http:/home.cfl.rr.com/kakaze/type/tuleuspecimen.pdf \"http://home.cfl.rr.com/kakaze/type/tuleuspecimen.pdf\")\n\n/u1\n\n"
    },
    {
      "time": "3 Aug 2008 — 2:51pm",
      "content": "but what about digitising the two dreyfuss alphabets made for javal (and seen at top of thread)??\n\n"
    },
    {
      "time": "3 Aug 2008 — 4:48pm",
      "content": "Oh,\n\nThomas Huot-Marchand (256tm) has done an amazing job of this:\n\nMany of the \"Rules\" of M. Javal have been used in the creation of this family!\n\nSee Deux Regular especially.\n\n[http://www.256tm.com/downloads/MINUSCULE\\_SPECIMEN.pdf](http://web.archive.org/web/20131020095451/http:/www.256tm.com/downloads/MINUSCULE_SPECIMEN.pdf \"http://www.256tm.com/downloads/MINUSCULE\\_SPECIMEN.pdf\")\n\nhowever they are not exact replicas - M. Javal insists that there is room for improvement as noted by Hrant - it is for you to judge if indeed M. Huot-Marchand has succeeded where M. Drefuss probably began to find the criticism tiresome and gave up! (Conjecture).\n\n"
    },
    {
      "time": "16 Nov 2008 — 6:49am",
      "content": "Here is my interpretation:\n\n[http://www.flickr.com/photos/ekusupo/3034197893/](http://web.archive.org/web/20131020095451/http:/www.flickr.com/photos/ekusupo/3034197893/ \"http://www.flickr.com/photos/ekusupo/3034197893/\")\n\n ![](http://web.archive.org/web/20131020095451im_/http:/typophile.com/files/Deyfuss-Javal_5558.png)\n\n"
    },
    {
      "time": "16 Nov 2008 — 11:29am",
      "content": "Notes accompanying my previous post:\n\nUntitled – Size 5, (Experimental typeface proposal), 1905 [Charles Dreyfuss/Émile Javal].\n\nDrefuss and Javal produced two sets of experimental letterforms embodying the principles set out in Émile Javal’s book. The following study looks at the “size 5”, the larger of the two unless direct comparisons are made. The font lacks typographic niceties, so looks unusual compared to other more refined typefaces like Fleischmann and Didot. Indeed the letters look like caricatures or cartoons of letterforms where their visual features are exaggerated.\n\nThe bold nature of the design means that it will still be visible at very small sizes. Shapes are used with non reliance on the counters. Other ways have been introduced to differentiate characters from each other. The act of identification of the letters is more important than the act of reading, therefore the set of letters lack cohesion. Because the letters are made up of even width strokes and geometric forms, the tops of the characters tend to have the same appearance density. Javal himself points out that the top half of the letters are important in identifying the character, however the type developed from his ideas lacks adherence to this observation.\n\nIn the type example given in the book [particulière se (fig. 68) p.229] some of the more challenging letters (in terms of structure) are omitted. These include the letters k, j, y and z. This means that the Javal ‘Size 5’ proposal lacks a full set of characters which would have gone a long way to prove his case. Non completion of the character set possibly have contributed to a negative effect on the popularisation of his ideas.\n\nIt is noted that the s looks very similar to the lowercase Didot s, which looks out of place with the other characters. The s does seem to be one of the most challenging letters when it comes to reduction and exhibiting it at a small size. The s could look to the proposed z from the smaller character set as a potential solution.\n\nBibliography:  \nJaval, Émile. Physiologie de la lecture et de l'écriture. Bibliothèque scientifique internationale, 105. Paris: F. Alcan, 1905.\n\nFleischman–Roman  \nEnschedé, Ch, Harry Graham Carter, Netty Hoeflake, and Lotte Hellinga. Typefoundries in the Netherlands, from the Fifteenth to the Nineteenth Century: A History Based Mainly on Material in the Collection of Joh. Enschedé En Zonen at Haarlem. Haarlem: Stichting Museum Enschedé, 1978.\n\nDidot Elder–Roman  \nEnschedé (Firm) type specimen\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nMichael Hernan\n\n"
    },
    {
      "time": "6 Mar 2010 — 5:55am",
      "content": "what happened to the mystery of the body text?\n\n"
    },
    {
      "time": "6 Mar 2010 — 7:41am",
      "content": "Chris (kakaze) did end up making a revival of it.\n\nhhp\n\n"
    },
    {
      "time": "21 May 2010 — 2:53am",
      "content": "where can we get a look at this? the above link to telu doesn't seem to work and i can't contact chris..\n\n"
    },
    {
      "time": "21 May 2010 — 3:20am",
      "content": ".\n\n"
    }
  ]
}
