{
  "id": "13330",
  "title": "from Illustrator to working font.",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello.\n\nJust want to know how you guys go from type to font.\n\nI'm drawing my type outlines in [Illustrator](http://web.archive.org/web/20150331013245/http:/typophile.com/wiki/Adobe%20Illustrator) (cs).  \nSo how do I get to [Fontographer](http://web.archive.org/web/20150331013245/http:/typophile.com/wiki/Fontographer) (4.1) from there?  \nI can't seem to import the ai or eps files.  \nIt keeps saying Syntax error in file.  \nI've tryed saving in older formats, but that dos'nt seem to help.\n\nSo what I've been doing so far is pasting a bitmap into Scanfont... but that just screws up the type totaly.\n\nOR, should I just get used to drawing it all in Fontographer?!  \nMan I'd hate to do that, since I work really quick and effectively in Illustrator.  \n(I've seen someone using TypeTool, but it seems like you have to import the characters in eps one by one.)\n\nAnybody got a solution? How do you guys work?\n\nThanks  \n- Lasse\n\n",
  "author": "LasseFernov",
  "time": "28 Jun 2005 — 5:49am",
  "uid": "7313",
  "comments": [
    {
      "time": "28 Jun 2005 — 6:15am",
      "content": "Cut and paste one by one is the only way I could get characters into Fontographer from Illustrator 10 files, more than that, you need to have a box for each glyph of the height, or slightly more, of the combined height of your tallest ascender and lowest descender so that you keep the scale of each glyph and then once pasted in, delete the box (if you don't use the box everything will be the same height). You can vary the width of the box to set your sidebearings as well.  \nTim\n\n"
    },
    {
      "time": "28 Jun 2005 — 7:18am",
      "content": "Illustrator Experts: correct me if I'm wrong, but...\n\nIllustrator CS format is not backwards compatible, so you will have to export your drawings as Legacy AI or EPS files. But first, you'll have to copy and paste each individual character into a new document (reusing the same one will work), because Illustrator does not give you the option of exporting only selected elements on a page. Exporting as Illustrator 3 ought to work. In Fontographer, select File, Import, EPS, then import your glyphs one by one.\n\nCreating a \"bounding box\" as **timd** describes is important, so that all of your imported glyphs retain their size relative to each other. Also, before you begin, set your font's ascent at 1000 and descent at 0. AFTER you have imported all of your glyphs, you can reset the baseline where it should be.\n\n"
    },
    {
      "time": "28 Jun 2005 — 7:58am",
      "content": "Nick is right - you have to set your Illustrator for older formats and import or go back to an older version of Illustrator - I still have Illustrator 8 on my G5 and it will cut and paste into Fontographer if the letter form has no stroke or fill. FontLab can do this up to current versions.\n\n"
    },
    {
      "time": "29 Jun 2005 — 4:11am",
      "content": "Ok thanks for the anwsers.  \nBut I still cant get anything into Fontographer.  \nI can in TypeTool so I'll just do that.\n\n"
    },
    {
      "time": "29 Jun 2005 — 5:17am",
      "content": "Chank still has on his site the how-to creation of a font from Illustrator to Fontographer. Whether or not you can still use the newer version of Illustrator is a question. See the guide at  \n [http://www.chank.com/howto/index.php](http://web.archive.org/web/20150331013245/http:/www.chank.com/howto/index.php \"http://www.chank.com/howto/index.php\")\n\nChank may be a bit goofy, but this is still a good guide, especially on the importance of drawing a bounding box next to the letters for consistent height. I have exported eps files created in Illustrator to Fontographer, but with Illustrator 8 (I think?). Cut and paste is probably the best method. With Chank and the above comments and help, something should work. Also, look for the updates on Fontographer from the new owners of the program, the FontLab folks.\n\n"
    },
    {
      "time": "29 Jun 2005 — 5:23am",
      "content": "Newer versions of Illustrator will not work. The cut and paste method has not worked for me in OSX at all. I would use native OS9 (or under) if you can. That is still the best environment for Fontographer.\n\nHopefully, everything will go more swimmingly when FontLab releases the OSX version of Fontographer later this year.  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150331013245/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "29 Jun 2005 — 6:03am",
      "content": "Dan,\n\nWill you be recommending os x fontographer over fontlab?\n\n"
    },
    {
      "time": "29 Jun 2005 — 11:42am",
      "content": "No. FontLab, especially FontLab Studio 5, is the most wacked-out software program I've ever had the privilege to use. FontLab 4.6 on the Mac is already much better than FOG. Right now, I have only used Beta versions of FontLab Studio 5 for the PC. Eventually it will be fully released, and later a Mac version will follow. I can't see how any FOG upgrades could ever match the upcoming FL 5.\n\nI stared dabbling in type design in 1999, with FOG. I didn't make the switch to FontLab until February, when I began working on commercial projects. The only regret that I have post-switch is not having switched earlier.\n\nBesides, the first OSX FOG will just be the old FOG with native OSX capabilities, no new features.  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150331013245/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "29 Jun 2005 — 11:52pm",
      "content": "Ok thanks for the info guys.  \nI now import one line of glyphs, and then distribute by cut/paste. Like Chank explains.  \nBut into TypeTool. Works for now. Sounds like I should bye FontLab... :)\n\n"
    },
    {
      "time": "30 Jun 2005 — 5:40am",
      "content": "TypeTool works for me just fine. I'm sure that FontLab is a great program, and will get it some day soon. The benefit of TypeTool is that you do, I believe, get a discount on FontLab if you own it. And TypeTool is a great program at a very affordable price. And yes, I forgot to mention that you can only use FOG in Classic OS9. As for the first OSX FOG, even if it doesn't add any new features, the original program was after all used by zillions of font designers in the first place. Just write a new manual, please!\n\n"
    },
    {
      "time": "30 Jun 2005 — 5:59am",
      "content": "It _was_ used by zillions of font designers. But FontLab is just wicked better. That wasn't always so…\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150331013245/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "30 Jun 2005 — 10:31am",
      "content": "The only problem with Type Tool is that you can't generate fonts in Open Type. Kerning is also a big problem. For the nitty-gritty stuff I agree with Dan. You should go with FontLab.\n\n"
    },
    {
      "time": "8 Jul 2005 — 11:35am",
      "content": "I also design my characters in Illustrator CS, I think eventually I'll use Fontlab as is apparently quicker, but for now, I need to make it work via illus!\n\nI swear I had it, I'm sure I was importing Illus CS EPS files into Fontlab 4.6, but now it won't import?! What do I save in Illus to make it work?\n\n"
    },
    {
      "time": "8 Jul 2005 — 12:01pm",
      "content": "File\\>Export\\>Legacy EPS.\n\n"
    },
    {
      "time": "8 Jul 2005 — 1:20pm",
      "content": "AH Yes. Cheers OldNick\n\n"
    },
    {
      "time": "10 Jul 2005 — 10:55am",
      "content": "Apologies for the basics: I have been using Fontlab 4.6 for a couple of days, I import from Illus into Fontlab, the points are snapping to the nearest em I think. Does anybody have any suggestions for me so I don't have to adjust the points in Fontlab? Is there any way of getting round this? My apologies for the straight out quesiotn, I realise this is a forum and not a source for me to find solutions! The last I promise … I have the Fontlab Manual coming next week!\n\n"
    },
    {
      "time": "10 Jul 2005 — 11:07am",
      "content": "Hi,\n\nto get the points not to change in FontLab, you need to draw correctly in Illustrator first. Here is a link to a great set of instructions on how to prep your work in Illustrator for FontLab:\n\n[Click Here](http://web.archive.org/web/20150331013245/http:/groups.msn.com/fontlab/tipsandtricks.msnw?action=get_message&mview=0&ID_Message=2675)\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150331013245/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    }
  ]
}
