{
  "id": "13339",
  "title": "\\*sigh\\*",
  "forum": "paul d hunt's blog",
  "tags": [

  ],
  "content": "i love typophile. i really do. but sometimes it makes me more than a bit sad to see us attacking eachother on _personal_ issues. i realize that type doesn’t exist in a vacuum and that even type design is interconnected with languages, cultures, ideologies, politics, &c. Passion is what brings a lot of us to typophile—a passion for type. it would be ludicrus to expect that such passionate folks wouldn’t be passionate about other things as well. likewise, it’s unreasonable to to believe that we’ll all see things the same way. this is what makes typophile so wonderful—to see the head-to-head comparison of ideologies concerning different aspects of type and type design. however, i think it’s a travesty when such wonderful discussions spiral out of control and begin to include vicious attacks on each other. it’s dissappointing to see persons for whom you hold so much respect sink to a dog-eat-dog level, meteing out insults on an “eye for an eye” basis. aren’t we better than that? is it too much to ask for us to use a little tact in what we say here on typophile? i’ll admit i’m not faultless in this regard, but i do my best to show respect to all of you and i would hope to enjoy the same.\n\n",
  "author": "<a href=\"user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": "<br>",
  "uid": "7006",
  "comments": [
    {
      "time": " 28 June, 2005 - 9:55pm",
      "content": "I second the motion, on a branching topic, I frequently feel confused by conversations on typophile. I’m may be guilty of this as well, with the shennanigans today, it just seems we read into a topic, far enough that we think we have an idea, and respond, without actually understanding. And on the other side, I’ve also seen topics that are less than articulate.\n\n\\* wow, things are getting pretty nasty on **Yves reviews Fleischmann revivals**\n\n"
    },
    {
      "time": " 29 June, 2005 - 3:43am",
      "content": "Paul, if you look at the 5 year history of Typophile you can readily see that the drama takes more than one person, but there’s always the presence of this same guy. I think you could guess who I’m talking about.\n\nIn the [Fleischman](http://web.archive.org/web/20060504205206/http:/typophile.com/node/13307) thread someone suggested a moderator delete the offensive post. I think I prefer to leave it there in its stinking, festering form so people can see for themselves the kind of person who otherwise seems to be knowledgeable and helpful.\n\n"
    },
    {
      "time": " 29 June, 2005 - 6:26am",
      "content": "joe, i wasn’t singling out any one person: i could point fingers at a few off the top of my head, but as i say, i myself am not guiltless so i won’t. not to mention finger pointing is counterproductive. my personal feeling is that if folks want to vent on politics &c. then their own blog is a more appropriate vehicle for such things. that way 1) threads on type don’t get hijacked and B) others can skip over blogs by persons they may not agree with.\n\n"
    },
    {
      "time": " 30 June, 2005 - 2:24am",
      "content": "Paul, thanks for your mature thoughts. I confess that in this instance I’ve let it get to me more than I usually allow it. Peace.\n\n"
    },
    {
      "time": " 30 June, 2005 - 4:21pm",
      "content": "thanks for sharing your thoughts, paul. i agree that it is sad that control isn’t always easy. i’m just glad no one sits next to me where they would _really_ get to see me lose control. seriously, i think you hit the nail on the head. people whom are passionate thinkers are usually passionate in more than mind. \\*sigh\\* indeed.\n\n"
    }
  ]
}
