{
  "id": "13348",
  "title": "Space around a logotype",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi all, I've not got a logo to crit, but I thought my post might be better suited to this area of the forum... I wanted to ask if anyone has got a good formula to work out the amount of 'no-go' space that should surround a logotype - I can then factor this in so I'm not making the space around the logo too claustrophobic. Is it all down to the eye or is there a more scientific way to do this? Does anyone know of any good brand guidelines that are out there worth looking at to see exactly how good guidelines are created?\n\nCheers\n\nSi\n\n",
  "author": "Duckworth",
  "time": "29 Jun 2005 — 5:29am",
  "uid": "7561",
  "comments": [
    {
      "time": "29 Jun 2005 — 12:50pm",
      "content": "One method of determining the space around the logo is use the height of a word mark around the logo. As for logos with graphics, thats a tough call. What I would determine would be the smallest and the largest usage for your logo and see what you can use as a safe space around it. Many times logos are designed to be used in a limited size range and when they exceed the limits, your directed to use another version that compensates for reproduction limitations.\n\n"
    },
    {
      "time": "30 Jun 2005 — 12:28am",
      "content": "Thanks Dan, for a while there I thought I'd posted in the wrong part of the forum! Are there any referennce books you'd recommend that target this area of branding/producing brand guidelines? I'm being called upon to do some sometime soon, so I need to get clued up and I thought that forum recommendations from people that know their stuff was a good place to start.\n\nMany thanks for your reply,\n\nSi\n\n"
    },
    {
      "time": "30 Jun 2005 — 3:06am",
      "content": "Its been a while since I've done a CI. What I know is research is the key. You have to know the background of the company, its history, its client base and its culture to make logial graphic decisions.\n\nSee if you can find anything by or about Paul Rand.\n\nExample: Dime Savings Bank is a Thrift with an older client base. The management wanted to make the client base to a younger and retain the older clients. What we did was to have a series of focus groups and interviews and eventually got enough information to make a CI manual that everyone could agree to.\n\n"
    },
    {
      "time": "30 Jun 2005 — 4:24am",
      "content": "Thanks!\n\nAs it happens, I've got a book about Paul Rand (I got into his work after reading John Maeda's first book, which cites him as an influence)... I forgot about those early identity manuals he did - I vaugely remember one with a stylised bird identity, I'll have to dig it out tonight, just moved house so not unpacked all my design books!\n\nStill get gutted every time I see one of those brown vans covered with the new UPS livery!\n\nThanks for explaining what you did, it's really interesting to see how others go about solving the problem - you seem to be on a much larger scale than the one we'll be working to; focus groups are, unfortunately, out of our budget, the client is a blue-chip SME (about 50 - 100 personnel) so I don't think it needs to be as far reaching as your store identity... Our job at our design agency is to renew the brand, and the client wants to see a brand 'manual' so they know how to treat the identity - it's got to be foolproof, mainly applied to paper-based and electronic media.\n\nThanks again for your help\n\nSi\n\n"
    },
    {
      "time": "30 Jun 2005 — 6:37am",
      "content": "I have never encountered guidelines that cover every eventuality, but then they are called guidelines. But I would look at doing templates for a variety of uses, for example, Powerpoint or other electronic presentation, Word for paper-based at different sizes A5, A4 portrait and landscape with the logo, fonts and colours in place, that would cover most in-house work. And develop a basic manual for external suppliers incorporating stationery, type use, livery, a pallette of colours in CMYK, Spot and RGB &c &c. Try not to be too restrictive or to answer every possible scenario.  \nAs for the clearance area as Dan says this often based on the height or width of a character in the logo as this is an easy method and an always present element, I often amend a logo with an invisible block to the clearance area for importing into Quark or similar, however there cannot be a general rule, it would be affected by the design elements of the logo.  \nTim\n\n"
    },
    {
      "time": "30 Jun 2005 — 8:16am",
      "content": "Thanks Tim, That's a good place to start... thanks for the clearance rule, I'll give it a go!\n\nCheers,\n\nSi\n\n"
    },
    {
      "time": "30 Jun 2005 — 9:36am",
      "content": "In most cases the distance from the edge of the logo to the edge of the exclusion zone is defined in terms of the length/height of a constituent of the logo. Establishing what to use depends on the logo itself. Very often, as suggested by Dan, the height of one of the characters in the logotype is used. It's customary to use a square character for this purpose, so 3M use the height of the 'M' (not the '3' which has overshoots) as their standard unit.\n\nThis distance itself varies greatly from logo to logo, some zones are much tighter than others. Some companies (eg BP) specify a 'minimum' and an 'ideal' exclusion zone. Some don't tie it down at all. GE have a dynamic logo where they actually cut bits off the logo and use it as a backdrop which would be sacrilege with some logos.\n\nSometimes it makes some sense to make the vertical space different from the horizontal space (see Akzo Nobel [www.akzonobel.com/company/identity/n0/n1\\_4/f1234.htm](http://web.archive.org/web/20150226174246/http:/www.akzonobel.com/company/identity/n0/n1_4/f1234.htm \"www.akzonobel.com/company/identity/n0/n1\\_4/f1234.htm\")). This is because the outer extremities of the logo may not be the optical edge. This approach may cause more problems than it solves.\n\nThe exclusion zone around the Exel logo was defined using a grid (60 x 24 units). ( [http://identity.exel.com](http://web.archive.org/web/20150226174246/http:/identity.exel.com/ \"http://identity.exel.com\") **(ii) Visual Identity Guidelines/1 Basic Elements**). The special relationship between logo and exclusion zone on this particular grid meant that when we came to specify signage etc the positioning of the logo on particular signs conveniently 'dropped out' because of the maths. Some time after defining the 60 x 24 exclusion zone (5:2 ratio) I started adding a further six units all the way round made the exclusion zone 72 x 36 (2:1 ratio) which was often more useful in some cases than the 5:2 zone, giving the logo much more space to breathe. However the larger exclusion zone would not have worked well on a flag where the logo would have looked too small. After all, what is an ideal zone in one situation may not be in another.\n\nIdeally you probably want the logo visually and mathematically centered on the clearspace. Here's one to avoid: The front paw of the Exel lion naïvely sticks out beyond the marquee at the right hand end. As a result, very few people centered the logo properly. Save yourself some trouble - if you are going to let bits stick out make sure they stick out the same distance either side so that centering is not affected. 3M do not take the upper and lower overshoot for the '3' into account when specifying the clearspace since the overshoots are identical top and bottom. Similarly Fujitsu ignore the serifs on the 'F' and 'U' at the left and right end. These too are almost certainly equal in size.\n\nIncidentally, some designers find it helps to build reference points into a logo. For example BD (Beckton Dickinson) has the left hand edge of the B (ignoring the slab serif) on the halfway line. These features can be very helpful with alignment etc when designing with the logo later on.\n\nWhatever you do, don't underestimate clearspace because people love to break the rules. You may consider that is worth overcompensating (ie overprotecting a logo) to counter irresponsible designers.\n\nHave a look at [www.identityworks.com/tools/guidelines\\_and\\_standards\\_manuals.htm](http://web.archive.org/web/20150226174246/http:/www.identityworks.com/tools/guidelines_and_standards_manuals.htm \"www.identityworks.com/tools/guidelines\\_and\\_standards\\_manuals.htm\") This will give you lots of different logos and their respective exclusion zones.\n\n"
    },
    {
      "time": "30 Jun 2005 — 11:23am",
      "content": "[www.cidoc.com](http://web.archive.org/web/20150226174246/http:/www.cidoc.com/ \"www.cidoc.com\") is an invaluable resource.\n\nI don't think they are any hard and fast formulas, but through building the logo a formula reveals itself and determines its unique set of rules.\n\nmost importanly though, trust your eyes.\n\n"
    },
    {
      "time": "30 Jun 2005 — 1:29pm",
      "content": "Markatos is right their aren't any hard, fast rules but as a designer you have to develop them for your client. Because as Nick points out the end user will try to work around the standards. The \"guy/doll who designs the newsletter that goes to the softball team\" type is your biggest problem. It might be a good Idea to make templates for simple documents that they produce often, Newsletters, Letterheads 3 panel brochures. You might also post examples of what not to do with the logo.\n\n"
    },
    {
      "time": "1 Jul 2005 — 1:18am",
      "content": "I just wanted to say thanks very much... Cheers guys for the very comprehensive responses! It's exactly the starting point I need... those resources look invaluable.\n\nCan't wait to start creating my very own manual now!\n\nSi\n\n"
    },
    {
      "time": "5 Jul 2005 — 8:52pm",
      "content": "Like Nick Job said, all the style guides I have received define clear space by an 'x' height (or 'x' width or both), which has always been based on some measurable component(s) of the logo. It is not necessarily one of the height of one of the letters or shapes, it can also be the space between two components. As long as it's measurable and consistent, it can be honored…  \npeace\n\n"
    }
  ]
}
