{
  "id": "13342",
  "title": "I want to create a bitmap/pixel font: any recommendations on a (reasonable) PC App?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Kind of not sure how to get started but I would really like to create a pixel font for a website I’m designing. This isn’t something I’ll be doing much of, and I have no idea how to begin.\n\nIs there anyone that has suggestions as to where I can start to find some information about this? What are the tools people usually use for this?\n\nThanks!  \nScott\n\n",
  "author": "<a href=\"user/5990\" title=\"View user profile.\">tomjonesrocks</a>",
  "time": "<br>",
  "uid": "5990",
  "comments": [
    {
      "time": " 15 July, 2005 - 9:25am",
      "content": "Twenty-plus years ago, the Chyron IV character generator used by many television stations had a function for creating true pixel fonts, but that technology has long since been eclipsed. Nowadays, I am reasonably confident that all of the pixel typefaces you see are TTF, PS1 or OT fonts that have been designed to reproduce cleanly without antialiasing.\n\nHere are a few tricks for creating a workable pixel font:\n\n1) Work with a clearly defined grid: 7x7 is probably the smallest workable area.\n\n2) The smallest design unit is a true square. All other elements will be composed of whole-number multiples of the height or the width of that square.\n\n3) Have fun and take chances.\n\nIf you would prefer not to re-invent the whell, there are a lot of serviceable and clever examples already available: [Yuji Adachi](http://web.archive.org/web/20060718193023/http:/dafont.com/en/author.php?author=308) is one of my favorite pixelware designers.\n\n"
    },
    {
      "time": " 15 July, 2005 - 9:44am",
      "content": "Scott, Nick is his being usual insightful self. But:\n\n\\> all of the pixel typefaces you see are TTF, PS1 or OT fonts that  \n\\> have been designed to reproduce cleanly without antialiasing.\n\nSuperhinted TT fonts (like the previous generation of the MS core fonts) are this sort of thing. But they take a lot of effort. Which is why so many people now make what are called “pixelfonts”, which has come to mean something different than “bitmap font”, because it involves the use of an outline font to map pixels to a “virtual grid” - basically little outline blocks of one sort or another that map to exact bitmaps at a certain point size. The main reasons for this are that: Flash didn’t support “true” bitmap fonts; and increasing (like MacOS now) bitmap fonts are not [properly] supported. Furthermore, if you want to handmake **grayscale** bitmap fonts (which I’ve been doing) you can only do it through pixelfonts (at least robustly and portably).\n\n\\> 1) Work with a clearly defined grid: 7x7  \n\\> is probably the smallest workable area.\n\nBut please don’t make really small pixelfonts! We have too many, and their expressiveness is necessarily in proportion to their unreadability.\n\n\\> 2) The smallest design unit is a true square. All other elements  \n\\> will be composed of whole-number multiples of the height or the  \n\\> width of that square.\n\nExcept if you make grayscale ones…\n\n\\> 3) Have fun and take chances.\n\nYes!\n\nhhp\n\n"
    },
    {
      "time": " 15 July, 2005 - 10:03am",
      "content": "Thanks, Hrant, for the additions and clarifications. I hate to see questions go unanswered:, if I can offer even a small morsel of information, I go ahead and do so, because…\n\n1) If I’m wrong, I am confident that someone will contradict me (like a duck on a Junebug, as we used to say in Texas); and\n\n2) I am not afraid of being wrong. I have been **very** wrong about some things in the past (like, I voted for Ronald Reagan in 1980), and will doubtless be wrong many times in the future (but, hopefully, never _that_ wrong).\n\n"
    },
    {
      "time": " 15 July, 2005 - 10:13am",
      "content": "We’re quite alike then! Although over the years I’ve realized the need to back off. Yes, I have been backing off. :-) Which is why Norbert actually passed me on the Prolific Posters list… well, at least until I woke up this morning.\n\nhhp\n\n"
    },
    {
      "time": " 15 July, 2005 - 10:19am",
      "content": "_We’re quite alike then!_\n\n**Please** tell me that it’s the other stuff I said, and **not** that you voted for Reagan in 1980.\n\n"
    },
    {
      "time": " 15 July, 2005 - 10:45am",
      "content": "I don’t vote, of course.\n\nhhp\n\n"
    },
    {
      "time": " 15 July, 2005 - 11:18am",
      "content": "That’s a pity, really. I have to go along with the Lotto theory: if you don’t play, you can’t win; likewise, if you don’t vote, you can’t bitch. Of course, I could be wrong about that.\n\n"
    },
    {
      "time": " 15 July, 2005 - 11:29am",
      "content": "If You Play, You Can’t Save A Dollar.\n\nhhp\n\n"
    },
    {
      "time": " 15 July, 2005 - 11:34am",
      "content": "N: _if you don’t play, you can’t win._\n\nH: _If You Play, You Can’t Save A Dollar._\n\nN: _If I’m wrong, I am confident that someone will contradict me._\n\nNo matter: it’s win-win for me. If I’m wrong, I’m right…at least about being called on it.\n\n"
    }
  ]
}
