{
  "id": "13341",
  "title": "Can anyone please help with the font for Amelie?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi, I was wondering if anyone could tell me the name of the font (or a similar one) used for the logo on the front of the box for the movie “Amelie”.\n\nHere’s a link:\n\n[http://images-eu.amazon.com/images/P/B000069JDB.02.LZZZZZZZ.jpg](http://web.archive.org/web/20091213031721/http:/images-eu.amazon.com/images/P/B000069JDB.02.LZZZZZZZ.jpg \"http://images-eu.amazon.com/images/P/B000069JDB.02.LZZZZZZZ.jpg\")\n\nIf anyone could help, I’d really really appreciate it.\n\nDave.\n\nPS-If you haven’t already seen it, you should definately check out this movie!\n\n",
  "author": "<a href=\"/web/20091213031721/http://www.typophile.com/user/8088\" title=\"View user profile.\">trundrumbalind</a>",
  "time": "<br>",
  "uid": "8088",
  "comments": [
    {
      "time": " 28.Jun.2005 8.05pm",
      "content": "Berthold Champion\n\n"
    },
    {
      "time": " 28.Jun.2005 8.31pm",
      "content": "It’s [**Impuls** by P. Zimmermann](http://web.archive.org/web/20091213031721/http:/www.myfonts.com/fonts/bitstream/impuls/#stylelist) available from Bitstream.\n\nAnd yes... Amelie is a delightful film.\n\n————————————————————-  \nYes, I’m old, but not too old for Amelie!\n\n"
    },
    {
      "time": " 28.Jun.2005 8.59pm",
      "content": "Yes! It IS Impuls! Your font knowledge is insanely impressive! Just curious, did you know that because you’ve used it yourself before and went through the hunt or do you just know a lot about every font imaginable?!\n\nAnd yes, Amelie IS delightful :-)\n\nThank you again for all your time and help.\n\nDave\n\n"
    },
    {
      "time": " 28.Jun.2005 10.32pm",
      "content": "Hmm ... the answer to this question was always Champion – like Paul said – so I was curious what was afoot here.\n\nTurns out that your cover image, Dave, is NOT the original that we are always shown. [This is](http://web.archive.org/web/20091213031721/http:/www.suite101.com/article.cfm/11647/85002). And that is Champion. Impuls is delightful, too, though.\n\n"
    },
    {
      "time": " 29.Jun.2005 12.48am",
      "content": "_Turns out that your cover image, Dave, is NOT the original that we are always shown._\n\nThat’s what happens when the designer for the foreign adaptation of the DVD box fails to ask for our help. :-)\n\n"
    },
    {
      "time": " 29.Jun.2005 6.58am",
      "content": "Yes, I was aware that the UK version of the cover is quite different from the original, Japanese-made one.\n\nHowever, I’d read elsewhere that it was actually Champion but couldn’t even find that font anywhere! So I just tried my hand here using the UK cover but I’m very pleased with the result.\n\nDoes anyone actually have an idea of where I can download Champion?\n\nMany thanks,  \nDave\n\n"
    },
    {
      "time": " 29.Jun.2005 8.34am",
      "content": "If it’s [**_Champion_**](http://web.archive.org/web/20091213031721/http:/www.bertholdtypes.com/bq_library/90056.html) you want it is available at [Berthold](http://web.archive.org/web/20091213031721/http:/www.bertholdtypes.com/bq_library/90056.html).\n\nI went for Champion at first, but it didn’t match the sample you showed us. Impuls did.\n\nBut also, just curious, did most of you assume it was Champion based on your knowlege of the original, and just gave David’s sample a cursury glance?\n\n————————————————————  \nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 29.Jun.2005 7.01pm",
      "content": "heh, i knew it didn’t look quite right. but my brain just automatically put Amelie and Champion together. Guess i should have not just glossed over it. Nice catch Mr. InStyle!\n\n"
    }
  ]
}
