{
  "id": "1335",
  "title": "Comments please...",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "![cioffi.jpg](http://web.archive.org/web/20150417073250im_/http:/www.typophile.com/forums/messages/29/1649.jpg)   \n   \n   \nMrs Eaves/Palatino Italic/Mercury\n\n",
  "author": "garyw",
  "time": "11 Jul 2002 — 9:13pm",
  "uid": "807",
  "comments": [
    {
      "time": "12 Jul 2002 — 5:01am",
      "content": "Why an italic 'i'? I'd prefer a dotless i.   \n   \nJacques\n\n"
    },
    {
      "time": "12 Jul 2002 — 6:54am",
      "content": "Mercury?\n\n"
    },
    {
      "time": "12 Jul 2002 — 8:45am",
      "content": "Just a thought, but a little more information could help the critique. Perhaps even the reasoning behind this specific solution?\n\n"
    },
    {
      "time": "12 Jul 2002 — 8:53am",
      "content": "Many variations have been explored with the client. Discussions with the architect directed me to create a visual identity that left a sense of \"creative formality\". By good fortune the name allowed for the beauty of the f-f-i ligature. The italic 'i' was chosen as a solution because of the interesting tension it created. Is the italic looking too forced? Is it the correct weight? Here's an earlier study:   \n   \n ![cioffi2.jpg](http://web.archive.org/web/20150417073250im_/http:/www.typophile.com/forums/messages/29/1651.jpg)   \n   \nThe Mercury caps have two characteristics I like in this composition. The slab serif on the 'I' and the spur on the 'C'. The earlier study here uses Futura. Do you think that is a better choice?   \n   \nThanks.\n\n"
    },
    {
      "time": "12 Jul 2002 — 10:04am",
      "content": "One weakness in your earlier version -- the lc 'io' also read as '10'. -- Futura is better (although I know some of you are tired of it.) -- 'ARCHITECT' seems to have no reason for ending at the point underneath the 'o', is it centered of the 'o'? it isn't that i dislike it, it is only that is calls more attention to the 'Cio', or rather it almost causes the words 'cio' and 'offi' to appear? maybe this is not a negative thing. The word 'cioffi', is this a last name or does it have other meanings or connotations?\n\n"
    },
    {
      "time": "12 Jul 2002 — 12:19pm",
      "content": "It is the client's last name. The \"A\" centered under the \"o\" is still not feeling quite right to me either. Thanks for the input.\n\n"
    },
    {
      "time": "12 Jul 2002 — 12:23pm",
      "content": "I highly recommend Peter Bilak's Fedra for the   \n\"architect\" there is less than 50 copies of this font in circulation and I am sure the client can see the reason for getting something more exclusive in their branding/identity.\n\n"
    },
    {
      "time": "14 Jul 2002 — 11:09pm",
      "content": "Jonathan - This [Mercury](http://web.archive.org/web/20150417073250/http:/www.fountain.nu/fonts/spec/mercury.html).\n\n"
    },
    {
      "time": "14 Jul 2002 — 11:12pm",
      "content": "ole - Mercury is much more appropriate for architecture   \nthan Fedra. Perhaps _too_ appropriate.\n\n"
    },
    {
      "time": "15 Jul 2002 — 8:59am",
      "content": "I like Mercury but find it a bit to \"fun\" for use in graphics for an architecture firm. Have you looked at the swiss beauties from Lineto. A bit expensive but worth it.\n\n"
    },
    {
      "time": "15 Jul 2002 — 9:27am",
      "content": "Here's a detail. Mercury caps here seems serious enough. I'm most concerned with the weight of the italic 'i' and overall kerning.   \n ![detail.jpg](http://web.archive.org/web/20150417073250im_/http:/www.typophile.com/forums/messages/29/1663.jpg)\n\n"
    },
    {
      "time": "15 Jul 2002 — 9:33am",
      "content": "I think it looks great as it is, gw. Nice spacing,   \ngood type choices. Make sure you also give it   \na look at small (sub-1\") sizes. \"Architect\" may   \nneed to be enlarged in such instances.\n\n"
    },
    {
      "time": "15 Jul 2002 — 9:47am",
      "content": "Gary -- Can we see a complete version with this current change?\n\n"
    },
    {
      "time": "15 Jul 2002 — 10:26am",
      "content": "I'm going to put 3 versions on the table to discuss with the client. I'll also present them in application on stationery, drawing sheet title block and site signage. I enjoy the collaboration with this client, I'll follow-up when a decision is made. Thanks!   \n   \n ![alt.jpg](http://web.archive.org/web/20150417073250im_/http:/www.typophile.com/forums/messages/29/1664.jpg)\n\n"
    },
    {
      "time": "15 Jul 2002 — 10:30am",
      "content": "Looking at the first image you've posted, I still think that this sans is calling too much attention to itself. You have the elegance of the serif (Mrs. Eaves?) and then your sans is almost ... it is almost anti-design? It almost looks like a mono-space sans, again to me it looks this way. -- I do like this sans, but perhaps for other situtations. -- I'm also not so sure about the greying down of the word itself. -- ;) How about Anisette Petite? -- One more thought. The placement of the word 'ARCHITECT'. Correct me if I'm wrong, but the architect's job starts with a solid foundation, no?\n\n"
    },
    {
      "time": "15 Jul 2002 — 5:00pm",
      "content": "Gary - this is one of those subjective things, but the lower spur on the 'C' made me read Gioffi the first time I looked at it. Overall, very classy. I like the italic 'i' better than the dotless 'i'.   \n   \nOle, that's puzzling info on Fedra Sans. Only 50 copies sold. Hmmm.   \n   \nbj\n\n"
    },
    {
      "time": "15 Jul 2002 — 7:55pm",
      "content": "I took the liberty of doing a bit of experimentation. Hope it may be of some help   \n ![Cioffi 1.jpg](http://web.archive.org/web/20150417073250im_/http:/www.typophile.com/forums/messages/29/1678.jpg)\n\n"
    }
  ]
}
