{
  "id": "13365",
  "title": "Star Wars flying text - word spacing problems",
  "forum": "Motion / 3d / Experimental",
  "tags": [
    "Motion / 3d / Experimental"
  ],
  "content": "Has anybody alreay discussed ( & condemned ) the word spacing on the flying text at the beginning of the most recent Star Wars films? It happens in part because the text is not allowed to be ragged right....\n\nProbably all the others too - but this one was especially obvious to me.\n\n",
  "author": "ebensorkin",
  "time": "30 Jun 2005 — 8:04am",
  "uid": "2942",
  "comments": [
    {
      "time": "30 Jun 2005 — 8:16am",
      "content": "Yes.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150317162219/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "30 Jun 2005 — 8:19am",
      "content": "I don't know if it's been discussed, but I do know the word spacing was pretty bad on the 1st film (episode #4). I didn't notice it at the time (I was too young, and the effect was so new, my only feeling was \"WOW\"), but recently I re-watched the original, and I noticed the bad spacing.\n\nI also noticed that Harrison Ford was extremely young, and that the acting could have been better in spots.\n\nIt seems impossible that that came out 25+ years ago.\n\n"
    },
    {
      "time": "30 Jun 2005 — 8:28am",
      "content": "in English:  \n [http://typographi.com/001002.php](http://web.archive.org/web/20150317162219/http:/typographi.com/001002.php)\n\nin German (some of the links have good pictures):  \n [http://praegnanz.de/weblog/644/krieg-der-luecken](http://web.archive.org/web/20150317162219/http:/praegnanz.de/weblog/644/krieg-der-luecken)  \n [http://guillemets.de/weblog/moege-die-macht-mit-der-typo-sein](http://web.archive.org/web/20150317162219/http:/guillemets.de/weblog/moege-die-macht-mit-der-typo-sein)  \n [http://guillemets.de/weblog/moege-die-macht-mit-der-typo-sein-2](http://web.archive.org/web/20150317162219/http:/guillemets.de/weblog/moege-die-macht-mit-der-typo-sein-2)  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150317162219/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "30 Jun 2005 — 8:45am",
      "content": "You'd have to adress John Knoll -- he did the original titles (probably still does them), but he's like a saint, because he co-invented PhotoShop. And where would the world be without PhotoShop?\n\n"
    },
    {
      "time": "30 Jun 2005 — 8:49am",
      "content": "Thanks. I thought I HAD to have been.\n\n"
    },
    {
      "time": "30 Jun 2005 — 11:38am",
      "content": "Ruined the ENTIRE movie.\n\n"
    },
    {
      "time": "30 Jun 2005 — 11:46am",
      "content": "Actually, the odd thing to me was the abscence of anybody reading anything ever. That was probably the result of a non-stop action, but I did like the original star wars for it's 3d games (chess in 3d), combat computers and GUIs. The last star wars is textless - i think. Apart from the opening of course...\n\n"
    },
    {
      "time": "4 Jul 2005 — 5:12am",
      "content": "Oh well, thank you very much, Dan for your hyperlink to me. I wonder of this referrer from typophile.com to my website, so that I visit this link. So now we meet us again. :)\n\n"
    },
    {
      "time": "4 Jul 2005 — 6:52am",
      "content": "\\>The last star wars is textless\n\nYeah, all those advanced civilizations without street advertising.  \nDe-texting must have caught on.\n\nMaybe it's like in The Diamond Age, where you get the ads beamed straight into your visual cortex. If you're rich, you can see the world without them.\n\nAs a sports fan, I really enjoyed Wimbledon for the lack of commercial images on the playing surface and surrounds. Even the tennis players' clothing is de-texted.\n\nSorry, wandering off topic again.\n\n"
    },
    {
      "time": "4 Jul 2005 — 9:59pm",
      "content": "The word spacing is pretty terrible. But, oddly enough, I don't actually care.  \nI like to go to the pictures to not think about what I think about most of the  \ntime. I find it helpful and relaxing. The Star Wars logo is pretty terrible too,  \nbut I still don't care!\n\nkris.\n\n"
    },
    {
      "time": "5 Jul 2005 — 12:11am",
      "content": "I find I can't stop noticing & thinking about text/fonts anymore, especially at films. Like Erik Spiekermann said : paraphrasing : Typophilia is a terrible disease.\n\nNick, text on de-texting! :-)\n\nActually it is relaxing for me to be without texts, for the reason above. Have been somewhere where there is lots of text which you can't read? I find that also relaxing...\n\nI guess I was thinking of the most recent star wars film as a kind of vision of the future like the film 2001 was meant to be\\* and the abscence of writting seemed to me somehow not like wimbeldon as you describe it, but as kind of purposely bland, almost neutered vision - because of the abscence of incidental text - as opposed to simply advertising.\n\n\\*silly already i know. Really it's just a marketing vehicle after all.\n\nThis is the opposite of The Lord of the Rings, where text is central. It's on the ring. Or Blade Runner where incidental text is everywhere to create atmosphere.\n\nI think what I am getting at is that there was a missed opportunity to make this Star Wars more compelling. But then with dialog like that - it is not too surprising...\n\n"
    },
    {
      "time": "5 Jul 2005 — 7:53am",
      "content": "I haven't seen episode 3 yet (I know, I know) but maybe it's a good thing it doesn't have any text: the text in episode 2 (like outside the bar on Coruscant) was just horrid.\n\nBTW, Tolkien was a linguist, that's why!\n\nhhp\n\n"
    },
    {
      "time": "5 Jul 2005 — 8:35am",
      "content": "Knowing that Speilberg is often faithful to his inspirational sources, I tried finding pics of Flying Crawl chapter titles seen in old Flash Gordon serials of 1936.\n\nOf the few I found (very poor resolution) it is evident that the visual effect of words gliding off to the distance is best achieved with justified copy. That way both left and right margins clearly follow one-point perspective.\n\nOddly enough, the Flash Gordon title seemed fairly well spaced, but too small to see any detail.\n\nI remember being slightly irked by the opening crawl in Star Wars Episode III, but really, I was too excited to care.\n\n-------------------------------------------------------------------------  \nYes, I'm old, but I remember Yoda when he had hair!\n\n"
    },
    {
      "time": "5 Jul 2005 — 12:33pm",
      "content": "I just saw [this](http://web.archive.org/web/20150317162219/http:/images-eu.amazon.com/images/P/B00082IJ0I.02.LZZZZZZZ.jpg) online today. If you thought that Episode III's flying text was bad, the album cover is just…  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150317162219/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "5 Jul 2005 — 12:49pm",
      "content": "Too too right.\n\n"
    },
    {
      "time": "5 Jul 2005 — 2:53pm",
      "content": "If you have the chance, for the sake of comparison, play the  \nlego star wars game on ps2. The titles are hilariously bad,  \nthey have split each episode into about 6 chapters. The best  \nbit: they are set in FF Sari!\n\n"
    },
    {
      "time": "7 Jul 2005 — 6:25pm",
      "content": "So I just finally caught Episode 3. Amazing movie, one of the best I've seen - much better than I expected. No stupid one-liners, very intense, both in emotion and action - reminds nicely of the original long, long ago, in a state of youth far, far away. I especially liked the little things, like catching a glimpse of the young Grand Moff Tarkin on the sidelines.\n\nBTW, I did notice **some** type: on the computers on Musafar. It looked a little bit like those ancient Hebrew Dead Sea inscriptions. But yeah, otherwise type was absent. And the titles? I was too excited to check. I can hear Jabba scoffing: \"He's no type Jedi!\"\n\nhhp\n\n"
    },
    {
      "time": "7 Jul 2005 — 9:41pm",
      "content": "Did you notice that the big shuttle ship that Obi Wan gets into on Coruscant, when he and Anakin part as friends, has \"CIA\" written on it?\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150317162219/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "7 Jul 2005 — 9:50pm",
      "content": "Really?  \nWell then I'll have to go see the movie again won't I! :-)\n\nhhp\n\n"
    },
    {
      "time": "8 Jul 2005 — 12:04am",
      "content": "To be fair, I think that the CIA-like glyphs are part of a bigger word. And I haven't heard anyone else notic this. But I have seen the film four times, and I noticed it each time.  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150317162219/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "8 Jul 2005 — 12:31am",
      "content": "Hmm Maybe somebody will post some stills when the DVD comes out...\n\n"
    }
  ]
}
