{
  "id": "13372",
  "title": "Font Reserve (yikes)",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Does anyone have experience trouble shooting this less than stellar program?  \nI've found that large PostScript T1 families (in this case 12 fonts or more) will cause  \nsome styles to show up and others disappear. And sometimes the reverse,  \nor sometimes somewhere in between the two.\n\nThis is OS9.  \nMaybe both FR and OS9 will quietly vanish from the earth...\n\n",
  "author": "eolson",
  "time": "30 Jun 2005 — 2:05pm",
  "uid": "1087",
  "comments": [
    {
      "time": "1 Jul 2005 — 9:02am",
      "content": "_Maybe both FR and OS9 will quietly vanish from the earth…_\n\nI thought they already had. Upgrade to OS X, sir! Your work will go smoother, truly.\n\n"
    },
    {
      "time": "1 Jul 2005 — 11:52am",
      "content": "Stephen -\n\nIt's me Eric - maybe it's my new beard ;)  \nTrust, me I'm not touching OS9 and certainly not Font Reserve.  \nThis question pertains to a customer inquiry.\n\nIn the hopes of figuring this out, I dowloaded the FR demo  \nfrom Extensis and it turned all of my system menu and application fonts  \nto Helevetica. And wouldn't switch them back...  \nSounds like a grad student fantasy of some sort.\n\n"
    },
    {
      "time": "11 Jul 2005 — 4:38pm",
      "content": "To me, a well tuned OS 9 box is a lot like an air-cooled Volkswagen beetle. Sure it's underpowered and a little dodgy on hills, but you can keep 'er running because the thing is so darned \\*simple\\*.\n\nMany software vendors can't support OS 9 simply because there are now few clients running said OS. However, if stuff was working at the point when the main user base left the building, there's no reason why it wouldn't continue to chug along. FR 3.1.3 ran on OS 9. However, it sounds like it f'd up the WYSIWYG menu add-on software. Unfortunately, you're sort of stuck between using the ancient installer and the updated (and probably last OS 9) version, which was probably only tested on stock systems.\n\nAldus SuperPaint Forever!!\n\n"
    }
  ]
}
