{
  "id": "13383",
  "title": "Sleek - Digital Audio systems design Firm",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "My second matter of business (I couldn't wait to post again!):\n\nA Business card and logo design for a digital audio design firm called FiberPack Audio. As you can guess by the name they specialize in fiberoptic packetized transmission of digital audio, specifically multichannel as in broadcast stations and concert halls.\n\nThey wanted something very cool and modern, with a simple layout, emphasizing the form as the design. Somewhat of a cross between an architecture firm and a modern art gallery design.\n\nI went for black text on a grey card to give that concrete wall feel.\n\nLet me know what you think:\n\n| Attachment | Size |\n| --- | --- |\n| [fiberpack-business-card-3.gif](http://web.archive.org/web/20131020210958/http:/typophile.com/files/fiberpack-business-card-3.gif) | 7.73 KB |\n\n",
  "author": "anticowboyism",
  "time": "1 Jul 2005 — 12:51am",
  "uid": "8128",
  "comments": [
    {
      "time": "1 Jul 2005 — 1:02am",
      "content": "I think the type, for 'Fiberpack Audio' is neither too 'cool' nor 'modern' and it rather looks pretty 'old school', or even vintage.. :) _( And, I may have to admit, that I am not quite fond of the 'barcode' element in there, but maybe thats just me.. )_\n\n"
    },
    {
      "time": "1 Jul 2005 — 5:36am",
      "content": "First nothing stands out. All your elements are fighting for attention. Ask yourself what do I want the viewer to see first? The band of fiber below the business discription is distracting and doesn't add to the look. Now my pet pieve, why, is it that every design now has to have type letterspaced. There is no reason for it, it doesn't help your design. Please look at other typefaces, how about Mecury that is used for the titling at this forum. Change the gray to silver. Just some thoughts\n\n"
    },
    {
      "time": "1 Jul 2005 — 8:31am",
      "content": "Thanks for the comments! I was not too pleased with the Fiberpack Audio typeface myself. It is actually just a modified Gill Sans, but it didn't quite turn out how I thought it would. The letterspacing is a client request. He showed me some examples of other designs he liked and pretty much all of them were letterspaced. But I would certainly be open to some ideas on how fill out the horizontal space of this businesscard without it.\n\nThe Mercury-Alt might be nice. Part of the reason I joined typophile is to learn what new faces are out there that I have never used before. So thanks for that!\n\n[Here](http://web.archive.org/web/20131020210958/http:/typophile.com/files/fiberpack-business-card.gif) is a very different version that I think has a stronger design, but conforms less to the company identity.\n\n"
    },
    {
      "time": "1 Jul 2005 — 12:45pm",
      "content": "One of the best things about printing on a mid tone background is that black and reversed out type works well if you print it as a two colour job. To me your layouts look a little too much like the back of a credit card. Try an asymmetrical layout. The later logo using that bauhaus type is not a good choice for modern/clean.  \nFrom a type point of view in the telephone numbers consider raising the braces and the dash so that the numerals aren't bursting from the top and individually kern them the space around the 1s is too great whereas the at symbol in the e-mail address is large.  \nTim\n\n"
    },
    {
      "time": "1 Jul 2005 — 1:22pm",
      "content": "What about exploring the potential graphic potential of optical fiber. It's use of light waves, gives it enormous potential. Though the work is derived from calculations/variations of such, the work of Casey Reas is often inspirational point for myself.\n\nThere are probably alot more sources that are more appropriate, but who know where you could jump from there.\n\nHave you done background research on exactly what optical fiber is?\n\n[www.wikipedia.org](http://web.archive.org/web/20131020210958/http:/www.wikipedia.org/ \"www.wikipedia.org\") - for simple overview.\n\nYour example says nothing new as related to any architecture fir/modern art gallery. I would agree with the dated look.\n\nExplore the technology a bit, get a feeling, then create.\n\n"
    },
    {
      "time": "1 Jul 2005 — 1:24pm",
      "content": "Think of that favorite white shirt you have and put a dot of ink on it. Your eye will go directly to that dot of ink. Thats what you have to think of with your card. The persons name and email address can be a lot smaller and probably shouldn't be knocked out of a black bar. White space even if its gray is a good thing. Did you investigate creating a mark that represents the company (weaving fiber optics?) and not over designing the type.\n\n"
    },
    {
      "time": "5 Jul 2005 — 8:28am",
      "content": "If you're still taking advice and critiques...\n\nI see two themes in the comments here that could lead you in strong directions:\n\n1) The type in both examples is retro, not contemporary. Avoid type that screams 'I am from X decade!' (Also, choose type that's either the same family, or has more contrast than your first example.)\n\n2) Explore the technology further. Both sound and fiber optics have threading/weaving curves. Your design could take so many vibrant and energetic directions based on that alone. The unique aspect is the packeted data. This, to me, suggests mindfully breaking the curves into segments, which could set your logo design apart from other wave-based logos. There's a lot of simple, modern potential here, particularly with elegant curves and figure-to-ground tricks using breaks in the curves.\n\nLet the type and the mark coalesce through your explorations. The visual potential here is probably strong enough to lead the type choice.\n\n"
    },
    {
      "time": "6 Jul 2005 — 10:38am",
      "content": "Thank you for such helpful comments! I'm working on a new design in this regard. Will post probably thursday. :)\n\n"
    },
    {
      "time": "6 Jul 2005 — 3:03pm",
      "content": "To clarify some amibuous phrasing in my post, I meant \"Also, choose typefaces that are either from the same family, or have more contrast between them than your first example.\" Not sure why I wrote it the other way.\n\n"
    },
    {
      "time": "7 Jul 2005 — 8:25am",
      "content": "I understood it. :) Gill Sans and Twentieth Century are too similar to use together.\n\n"
    },
    {
      "time": "7 Jul 2005 — 4:14pm",
      "content": "Here is a completely new design. Hopefully it is closer to modern this time. ;) I'm also working on a third design that incorporates crugen, blackbirdsings, and dan weaver's suggestions.\n\n[New Design](http://web.archive.org/web/20131020210958/http:/typophile.com/system/files?file=Fiberpack-business-card-2.gif)\n\nThe contact info on the card is bogus filler, just in case you try calling.\n\n"
    },
    {
      "time": "8 Jul 2005 — 6:47am",
      "content": "I like the your new design but I don't think the square with the stars is giving the right impression. Especially with the green color, it made me think of an army depot or something like that. The name says otherwise obviosluy, but that little icon says a lot. Maybe a speaker? Headphones, somerthing that screams audio. Other than that I think the focus has definately shifted to the name, which is where it sould be.\n\n"
    },
    {
      "time": "8 Jul 2005 — 11:00am",
      "content": "Ok, after experimenting with twisted fibers as a mark, I've come up with something nice. I think you're all going to like this one.\n\n[Design 5](http://web.archive.org/web/20131020210958/http:/typophile.com/system/files?file=Fiberpack-business-card-5.gif)\n\nAnd just to be complete, here is another idea\n\n[Design 6](http://web.archive.org/web/20131020210958/http:/typophile.com/system/files?file=Fiberpack-business-card-6.gif)\n\n"
    },
    {
      "time": "8 Jul 2005 — 12:56pm",
      "content": "Number 6 is an interesting take. You might consider alternate ways of tying the A in Audio into the twisted pair design.\n\n"
    },
    {
      "time": "8 Jul 2005 — 1:51pm",
      "content": "I would suggest stepping away from the computer right now. It seems like your client needs a logo first, a business card second. Do some research on their business, what fiber optics are, what the client's business goals are, competitor's logos, etc. Then get a pad of paper and sketch. It doesn't matter if you can't draw. Just get some ideas quickly on paper. You'll find that ideas will start to form out of each other. It may go slow at first, but if you keep trying you'll hit that magic point where things just flow.\n\nAim higher than these fairly mundane examples you have shown. It seems like you are just opening the font menu and scrolling through your fonts, finding something that looks interesting and trying to force a concept to fit around that font. You need to come up with a solid concept first, that will make choosing your typeface much easier.\n\nGood luck.\n\n"
    },
    {
      "time": "8 Jul 2005 — 2:00pm",
      "content": "The new designs are working better but don't make everything green. For contrast make the name the paper color (white?). It will add separation from the name and all the other information you are providing. Another idea would be to make the fibers a tint of gray so they are subtitle and push back. Another way to do that is use an Aquious coating on the card and print matte black ink over it covering the black other than the fibers and they would be glossy.  \nMake an effort to open up the spacing between the tagline and the mark. Try making all elements 10% smaller.  \nAnd Adnix is right get away from the keyboard for a while.\n\n"
    },
    {
      "time": "12 Jul 2005 — 12:17pm",
      "content": "I agree about getting away from the keyboard. Also, avoid the standard font list, if you can. It's not helping.\n\nThe new designs are better, without a doubt. I'm not so sure about #6. It doesn't read as an 'F' to my eye and it might be too much hassle to make it work (but that's for you to judge). As for #5, it's definitely going in the right direction, but the fibers are very wispy and fragile looking. They look a bit cluttered, and at small sizes a logo like that will fall apart. The thick-to-thin as they curve is very nice, but make each thread a bit thicker and make the group more orderly. I'm not digging the Optima, either. I'd go with something more geometric and constructivist, actually (closer to what you used in the bar code business card). Or, a nice, clean contemporary serif font.\n\n"
    }
  ]
}
