{
  "id": "13381",
  "title": "Salon Rebrand",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Well, i don't know if have broken any boundaries, venturing away from the uniformity of salon identities that seem to be all similar.\n\nThats why i pose the question here.\n\n1609(yes its the address)is the new name of this salon. This place had existed for the past 11 years under a different name, but had to rebrand for reasons you can make a reasonable guess, but which i won't disclose.\n\nWhen the name turned over, so did the ownership or at least the person who's name is listed as such. So physically they are the same staff, management and service, but under a different name.\n\nWell...i don't know how many of you have done jobs where a number was the name, but it is not an easy feat. Generally, i avoided drawing figurative aspects of the business into the mark. Since they are a \"salon & spa\" they offer a wide ranges of services that cannot be wittled to wavy locks or leaves. With them being one of the hipper places in the city to get your hair cut, the goal(with the client's vision)was to find a strong solution that has the potential to be an iconic mark, that symbolizes the attitude and quality of this salon.\n\nIm just going to get out of the way and let you go at it.\n\njp\n\n| Attachment | Size |\n| --- | --- |\n| [typo\\_samp\\_3.gif](http://web.archive.org/web/20150415100717/http:/typophile.com/files/typo_samp_3.gif) | 6.5 KB |\n| [1609.gif](http://web.archive.org/web/20150415100717/http:/typophile.com/files/1609.gif) | 9.35 KB |\n| [t\\_shirt\\_sample.jpg](http://web.archive.org/web/20150415100717/http:/typophile.com/files/t_shirt_sample.jpg) | 158.13 KB |\n\n",
  "author": "blackbirdsings",
  "time": "30 Jun 2005 — 8:05pm",
  "uid": "3063",
  "comments": [
    {
      "time": "30 Jun 2005 — 8:39pm",
      "content": "Josh,\n\nMy personal favorites are 1a and 1e. Maybe you could try a variation of this theme using a less geometric font, or something thinner? But I guess it can't be too historical looking or people will think 1609 represents the year.\n\nI think you're off to a great start!\n\n"
    },
    {
      "time": "30 Jun 2005 — 8:58pm",
      "content": "1a & 1d\n\n"
    },
    {
      "time": "1 Jul 2005 — 12:45am",
      "content": "I also think '1d' is nice, and I really like the 3rd one, seen in ' [typo\\_samp\\_1.gif](http://web.archive.org/web/20150415100717/http:/typophile.com/system/files?file=typo_samp_1.gif)'..  \n_( Maybe try to make the '1' just a plain 'line' and rotate it / slant to match the upstroke ending of the '6' / the downstroke ending of the '9'.? [Lousy Scribble](http://web.archive.org/web/20150415100717/http:/www.formlos.net/Tmp/1609Scribble)..)_\n\n"
    },
    {
      "time": "1 Jul 2005 — 3:42am",
      "content": "I do also like 1c, but the decorative elements should be 30-40 percent more contrasty, it kind of blends into the text, contrasty like 1d.\n\n"
    },
    {
      "time": "1 Jul 2005 — 5:28am",
      "content": "I think you are over thinking the process. In terms of elegance I like the idea of spelling out the name but I'd use a script face and keep it simple. I might also incorporate a line near the name like: Salon & Spa\n\n"
    },
    {
      "time": "1 Jul 2005 — 7:52am",
      "content": "formlos- Danke sehr fur dein Vorschlag. Ich habe dieses Variation gemacht und es schaut sehr schwerfallig. Ich habe die \"6\" und \"9\" Charakter ein bisschen gedreht, aber habe ich kein Gluck.\n\ndan - I am not really a big fan of script faces. If they are in some kind of vogue, i would have to see the application to decide. For this project the client and I believe on creating a strong presence, that has some visual mass with a bit of elegance.\n\nIn the three block area there are a variety of places to get you hair cut. Some are cheapo chains, the other look retro 80's, to the harmonious Aveda look. Seemingly its is always about blending in the salon industry.\n\nWe are trying to punch it up a little bit. Though not known as agressive or anything the client really want to be closer to Nylon than Elle. They aren't cutesy and to retain the small male clientele base they have, they want to have their service be known, not a bias toward sexes. Script has a definite slant toward women. I know its not all very feminine and its very classic, but its a direction that does not fit the client.\n\nEric - I think you mean with less contrast or maybe i don't fully understand the meaning of contrast, but a thinner weight in commoner terms. Gotcha.\n\n"
    },
    {
      "time": "1 Jul 2005 — 1:30pm",
      "content": "The problem with edgy designs rather than elegant ones is they go out of fashion before you put the sign up. I would look to make the word mark more conserative.\n\n"
    },
    {
      "time": "1 Jul 2005 — 3:40pm",
      "content": "Contrast as in more thins, so you have a greater range of stroke weight.\n\n"
    },
    {
      "time": "3 Jul 2005 — 1:16am",
      "content": "1e catches my eye most – I think you might have to work on the 9 which could pass as an 8 (in a bad light with one eye shut), maybe by closing the counter or at least reducing the gap, and the 1 looks rotated 180 degrees. I think the skeleton of it could become the focus of a developing attractive logo.  \nTim\n\n"
    },
    {
      "time": "4 Jul 2005 — 4:51am",
      "content": "Hey there, Josh,\n\nWhile I like the variations 1a through f very much, still I feel they are not the potentially iconic mark the salon looks for. Maybe that's because of the ornamented treatment you use. Correct me if I am wrong, but isn't iconicity rather related to visual simplicity? In that sense, the 'sixteen O nine' sketches do a better job. The O could be the very icon you are looking for.\n\nYou say the salon wants it's quality and attitude reflected, so maybe a bold choice for a very simple mark might be the thing. To my eyes the ornaments have a hip feel, but will they be as hip three years from now? Using a relatively simple logo and allowing some time for it to be filled with meaning may be a much better choice.\n\nStill, I enjoy looking at the ornaments... :-)\n\n----------------------------------------------------  \nMy work is a game. A very serious game [M.C. Escher]\n\n"
    },
    {
      "time": "7 Jul 2005 — 2:25pm",
      "content": "as this is a hip salon spa I think the hip edgy nature of the first series is probably more suited. Like all things of a trendy nature, you may find that the identity is somewhat ephemeral and will need to be revisited more often then that of say a bank (hee hee).  \nHaving said that - I like 1c and 1d, but I think that the actual type could be just a bit more legible - easier to distinguish at first glance what the markings are. I was looking for letter forms that weren't there instead of OH DUH NUMBERS! So perhaps look for a face with attitude and weight and ornament those. I think it is crazy on the right track because it looks very hip. You have to almost alwasy imagine how a salon logo would look printed fairly small in the center of a black t-shirt on some stylist with the sleeves rolled up slightly (smirk). In this case it works.\n\n"
    },
    {
      "time": "8 Jul 2005 — 7:13am",
      "content": "1 series is super hot!!! I vote 1a, but I don't have time to look at them too closely..\n\nDid you use some decoration fonts to add the visual elements? If so, what typeface for 1a?\n\nGood job! :D\n\n"
    },
    {
      "time": "8 Jul 2005 — 8:13am",
      "content": "I'm for 1a, 1b and 1d. It's trendy, but I don't think it's a big deal. They're the most interesting to me, and the most legible.\n\nIf you want to notch down the trendy as a trade-off for the iconic/longevity qualities, then I'd go with the 'sixteen O nine'. The first one is the weakest in that series, so I'd choose from the other three.\n\n"
    },
    {
      "time": "9 Jul 2005 — 2:34pm",
      "content": "Thanks for the new comments since my last post. It get a bit difficult to see ones work with fresh eyes and i appreciate you all looking.\n\nSince the last post. The iconic, flourishes number mark is out. Though i did have some attachment to them, they are pursuing the forementioned(by other users)work mark ala \"sixteen O nine\".\n\nI have been a fan of the wordmark since its conncoction. Though it all must be pretty pretty in the end, the interesting part of this solution is the way the number is said. Naturally as humans we are lazy at times and often give a \"zero\" an \"oh\" treatment when we speak. So this solution naturally evolved. Hopefully I can strike a balance with the traditions/similarities of salon branding and interjecting some fresh, yet sturdy typography to create a mark with equal longevity.\n\njp\n\n"
    },
    {
      "time": "10 Jul 2005 — 11:11pm",
      "content": "See files above.\n\nI deleted the versions that many liked from an artistic standpoint, but not functionally. The 1609.gif includes the simple word mark, and variations for the future and/or secondary element use.\n\nThis is not a final version yet, but i think the strongest.\n\n"
    },
    {
      "time": "11 Jul 2005 — 9:51am",
      "content": "I definitely see some potential in the new logotypes. Maybe try a more organic O rather than using the same typeface I think the visual elements would flow more rather than just pop out from a geometric shape in the 0.\n\n"
    },
    {
      "time": "11 Jul 2005 — 1:35pm",
      "content": "Thanks dgiliati. Whether it is student project or elsewise, your \"A CUT ABOVE\" mark is excellent. Sometimes it all comes together. I wish this would.\n\nBart-Your opinions inspired me and i took some mental stimulation from the Centraal Museum identity that Thonik did in the Netherlands. Unfortunately this is the U.S. where the person who talks the loudest and says the most stupid things is the winner. Hope you saw my variations in that respect.\n\nI would give a body part of some sort to work in the Netherlands.\n\n"
    },
    {
      "time": "11 Jul 2005 — 5:30pm",
      "content": "I guess I'm the only one who saw a dirty pun when I first saw the the images pop-up on the screen, especially with that big O in the middle. It's even more emphasized with the stylized 0 and especially the third example where the 0 is replaced with the towel-headed girl. I'm just saying that some people will mistake the 0 as a graphic element and just read the words \"sixteen nine\". You might end up with clients looking for, ahem, other services.\n\nOf course the talk about stroke weight in later posts didn't help. I'm just sayin'...\n\nI would recommend redrawing the towel girl based on earlier suggestions and going with a numerical solution like 1609 Spa. Less chances for confusion.\n\n"
    },
    {
      "time": "11 Jul 2005 — 7:13pm",
      "content": "Well the idea was not to use the iconographic marks until the brand could be introduced. A library of images could be created for the different services to be portrayed and for use on business cards for the individual employees. Later, they \"could\" be used and new ones created to signal special events, sales, etc. the place could be having.\n\nI was thinking about how the mark could evolve, from the first treatment in the image above. But they and i were not entirely convinced of it totally. So on the merry go around i go again.\n\ni'll send some more samples soon.\n\njosh\n\n"
    },
    {
      "time": "12 Jul 2005 — 1:56am",
      "content": "I'm actually going to select 2c as my favorite.\n\nModern, easily read, and sticks in the mind easily.\n\n"
    },
    {
      "time": "12 Jul 2005 — 7:22am",
      "content": "\"_It’s even more emphasized with the stylized 0 and especially the third example where the 0 is replaced with the towel-headed girl._\"\n\nI saw a finger with a curling design painted on it. I wouldn't play with the '0' that much, as David said. It doesn't read properly that way.\n\nHonestly, I'd stick with the type only.\n\n"
    },
    {
      "time": "12 Jul 2005 — 5:50pm",
      "content": "Well. Now that i know typographers all have dirty minds(haha)i can rest easily. I think we should keep that on the DL about how close it sounds to sixty nine. Just imagine. Way to ruin the day, Adnix.\n\nI met with some fellow designers today and they were not really discouraged by some of the marks, but more of my selling the idea. So i included some new and older marks with some new approaches above(see t\\_shirts)as applied hypothetically to a t-shirt. Not everyone knows a good mark when they see it alone and that the sense i am getting with my client. So im going to apply it and see if one can be sold in his mind.\n\nThanks to everyone for agreeing that this is a hard solution to find. Stupid address. Well at least its not 666(or 616).\n\nP.S. The battery of sexual conotations will be deserved this time.\n\n"
    },
    {
      "time": "13 Jul 2005 — 8:07am",
      "content": "LOL - it all comes down to the t-shirt with salons (smirk). I actually like the second one with the o in the shape of a finger hole from a pair of scissors - very nice. the SIXTEEN OH NINE is also nice, but for some reason says broadway play rather than salon and for the life of me I can't figure out why. The ones with the extra large O for keep reminding me of the cirque du soleil show O and though they don't have a corner on the O market with Oprah Magazine and others - it just reads like its something else. Overall though I really like it - even though you had to go with this approach.\n\nGood work!\n\n"
    },
    {
      "time": "13 Jul 2005 — 9:39am",
      "content": "It's sort of hard to say which one works the best. Salons and spas have a personality and that's what needs to be portrayed with the logo. If the salon is traditional and conservative then the identity needs to reflect that. If they're hip and edgy then some of these are working.\n\nAs far as design goes I think the third one down in the first file is the best. The mark is great but it doesn't say \"O\" it looks like it says sixteen nine.\n\nMore work and I think you'll nail it.\n\nJoseph Szala  \nVigor Graphic Design, LLC.  \n [www.vigorgraphics.net](http://web.archive.org/web/20150415100717/http:/www.vigorgraphics.net/ \"www.vigorgraphics.net\")\n\n"
    },
    {
      "time": "14 Jul 2005 — 10:09am",
      "content": "The t-shirts are a good way to show the marks. The color's adding a lot.\n\nThe second one actually reminds me of [this](http://web.archive.org/web/20150415100717/http:/store.valvesoftware.com/s.nl/sc.8/category.-108/it.A/id.9/.f) (which is a good thing to _me_, at least). But I like it as much as 1 and 4.\n\nI'm not a fan of the third one (red 'OH').\n\nIt really is about matching the feel of the salon to the mark.\n\n"
    },
    {
      "time": "14 Jul 2005 — 3:19pm",
      "content": "Well after skirting aspects of trying to draw from visuals of the salon, it comes down to the scissor handle being the winner(#2 that is)or the client accepting it. I thought it was gonna be alot smoother in the beginning, but thats just my youth. But im glad that the best mark and nearly the last one of many finds the middle ground.\n\nIm hoping to really bust it open for the application.\n\nThanks to everyone for building me up and shooting down the bad ones.\n\n"
    },
    {
      "time": "24 Jul 2005 — 5:41pm",
      "content": "Of them all, I most like the T-shirt design which alludes to the scissors handle -- call it \"3b?\" BUT, I think some might read it as \"sixteen nine\" rather than \"sixteen o nine.\"\n\nThe first series actually confused me. I though \"1c,\" which adnix describes as \"the towel-headed girl\" was a finger/fingernail with some fancy polish design. The good thing is that whether its a towel head or a fingernail, they both just happen to work for a salon. Did you plan it that way? Am I the only one to interperetet as such?\n\nBack to \"3b.\" Both \"6\" and \"9\" offer an opportunity to show the scissors handle concept. I would experiment with that. I think you can push this a lot further. I like Dan W's suggestion to incorporate a \"Salon & Spa\" line, and in a contrasting face. If your going to produce ephemera (t-shirts, etc) you don't want people not knowing it's a Salon. Other than \"3b,\" I see the design on a t-short and be like 'hmm, what's sixteen o nine? At least if Salon and Spa was there I would know what to tell information when trying to find a phone #.\n\nI used to not be too keen on script faces myself, but you can do wonderful things contrasting a clean sans with a script. Think about it. Keep sketching. Looking forward to the next iterations. One last thing, a lot of people mentioned a thinner stroke for the sans, I agree.\n\n"
    }
  ]
}
