{
  "id": "13404",
  "title": "DTL Kernmaster",
  "forum": "Build",
  "tags": [

  ],
  "content": "Does anyone have any practical experience with DTL Kernmaster (or can you point me to an older thread that discusses its merits in detail)?\n\nThe version included in the Fontmaster Light suite has been disabled, which makes it pretty much useless for evaluation.\n\n",
  "author": "<a href=\"/web/20091225143429/http://typophile.com/user/6470\" title=\"View user profile.\">oldnick</a>",
  "time": "<br>",
  "uid": "6470",
  "comments": [
    {
      "time": " 5.Jul.2005 10.41am",
      "content": "Thom Phinney explained it to me this way in an email:\n\n“DTL FontMaster is a very capable and interesting tool, but the price and approach make it best suited for use in a type foundry environment - an entire team of people working together to make fonts.”\n\n"
    },
    {
      "time": " 8.Aug.2005 8.10am",
      "content": "The disabling of the kerning does indeed leave not much space for testing  \nthe Light version of DTL KernMaster. I will discuss the option of generating  \na limited number of kerning pairs in the Light version during the next  \nmeeting with the FM programmers.\n\nThe separate modules in combination with the batch functionality makes DTL  \nFontMaster especially suitable for larger font productions. However, in the  \nnew 2.5 edition, which is scheduled for this autumn and which I will show in  \nHelsinki, it is not necessary anymore to do most things in batch when only a  \nfew fonts are in production. Fonts can be directly imported and exported  \n(including OpenType fonts with automatically generated features) from both  \nDTL Bezier- and IkarusMaster. Also the improver functions can be applied to  \na complete font in the editors. Furthermore the drawing capabilities are  \nbeing enhanced at this very moment and will be much easier to handle. The  \ninterface is also undergoing a facelift.\n\nBasically this means that DTL Bezier- and IkarusMaster will function as full  \npowered standalone applications. For checking, improving and generating  \n(OpenType) fonts in batch, respectively ContourMaster and DataMaster can be  \napplied still.\n\n"
    },
    {
      "time": " 8.Aug.2005 9.30am",
      "content": "Thanks for the update, Frank. I look forward to seeing the new products.\n\n"
    },
    {
      "time": " 8.Aug.2005 9.44am",
      "content": "...but the price — wow. $2000 +-. why is that? there’s no competition (with FontLab); and with that price I can buy FontLab, TransType, ScanFont....and keep the change.\n\n"
    },
    {
      "time": " 8.Aug.2005 11.56am",
      "content": "It is true that the complete FM suite costs somewhat more than Euro 2000.  \nHowever, the price of the enhanced Bezier and Ikarus editors, which will  \nfunction now as standalone programs, will remain Euro 382.50 per editor.  \nThe new functionality will also be part of the new and free Light versions.\n\n"
    },
    {
      "time": " 9.Aug.2005 7.29am",
      "content": "Frank,\n\nis that new and improved version going to be OS X native?\n\n"
    },
    {
      "time": " 6.Sep.2005 3.16am",
      "content": "Bert,\n\nSorry for this somewhat delayed reply. The new 2.5 edition of FM will be available for Windows and Mac OS 9 / Classic. An OS X version of FM is under development but it will take some still before this will be released. However, the new 2.5 release is more than worth to install Classic or even to switch to Windows.\n\nI have never had any doubts about the superiority of FM when it comes to the production of fonts, especially OpenTypes. The technical quality of the produced data and the automation of OT features generation make FM hard to beat. As you probably know, the listed typographic features in the FM Feature file are automatically generated when the corresponding characters are in the glyph database. Actually I would not be surprised to see this method becoming standard in OT font production software in the near future.\n\nNow also the drawing functionality of FM has been enhanced a lot, including a series of guideline related functions and for instance also a variable display of points. In the 18 years that I have been working with font tools I have never seen better drawing functionalities than the ones in the new FM edition. Finally, the interface has been polished and all icons replaced.\n\nAlthough producing font tools is very interesting, at the end these are meant to produce type. In time the technology will be mostly forgotten but well designed and well produced type will remain. This autumn/winter the Dutch Type Library will present DTL Antares by Erhard Kaiser. DTL Antares is the serif companion for DTL Prokyon and is, of course, produced with DTL FontMaster. A preview can be found at: [http://www.dutchtypelibrary.nl/PDF/M504/DTL%20Antares\\_preview.pdf](http://web.archive.org/web/20091225143429/http:/www.dutchtypelibrary.nl/PDF/M504/DTL%20Antares_preview.pdf \"http://www.dutchtypelibrary.nl/PDF/M504/DTL%20Antares\\_preview.pdf\")\n\nTo return to the initial question of this topic: with the new Light version of DTL KernMaster it should be possible to generate 25 kerning pairs at the time.\n\n"
    },
    {
      "time": " 6.Sep.2005 9.15pm",
      "content": "Antares seems quite interesting - bravo for releasing  \nsuch a design. In fact I’ve started a thread about it:  \n [http://typophile.com/node/15010](http://web.archive.org/web/20091225143429/http:/typophile.com/node/15010 \"http://typophile.com/node/15010\")\n\nThere is one small thing that immediately bothers me though: Frank, how does Erhard/DTL implement trapping? For example, why does the “M” have a trap (and the “R” too?) but no other glyph? I’ve noticed similar inconsistencies in DTL Fleischmann. If you decide to reply, please feel free to do so on that dedicated thread instead of here - thank you!\n\nhhp\n\n"
    },
    {
      "time": " 6.Sep.2005 9.34pm",
      "content": "[http://typophile.com/node/14863](http://web.archive.org/web/20091225143429/http:/typophile.com/node/14863 \"http://typophile.com/node/14863\")\n\nFrank, I’ve been trying to contact you. Is your email down? I requested the EULA from any foundry attending the TechForum at ATypI this year. Your name is on the attendees list. Can you e-mail the DTL EULA to me? wardle [at] typophile [dot] com — Thanks!!\n\n_Sorry to interrupt the thread. As you were._\n\n"
    },
    {
      "time": " 7.Sep.2005 2.34am",
      "content": "Tiffany,\n\nWe are updating our EULA somewhat currently and I will send you the new edition before the TypeTech Forum.\n\n"
    },
    {
      "time": " 2.Mar.2006 7.24am",
      "content": "Any news on OSX availability yet?\n\nChrisL\n\n"
    },
    {
      "time": " 3.Mar.2006 6.39am",
      "content": "As it looks now, at least a couple of the batch files -probably including DTL KernMaster- will come available later this year for OS X. As I have stated earlier, from a font production point of view so far I actually did not see much reason for porting the stuff to Mac OS X. The Classic version functions fine and there is, of course, also an excellent Windows version. However, I am quite aware that a number of potential users of FM only want to work with Macs and is only interested in OS X versions. With the latest Intel based Macs and the ending of the Classic mode, we now basically have no other choice than to release OS X (Universal) versions of the FM modules.\n\n"
    }
  ]
}
