{
  "id": "13406",
  "title": "Famous Quotes from Type Designers",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Alright fellow Typophiles, what are your favorite quotes from famous type designers. Can't tell you why, it is a surprise. However, we could also put these in the wiki. I'll start:\n\n\"Anyone that would letterspace blackletter would steal sheep.\" [Frederic W. Goudy](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Frederic%20W.%20Goudy)\n\n",
  "author": "Miss Tiffany",
  "time": "2 Jul 2005 — 8:07am",
  "uid": "108",
  "comments": [
    {
      "time": "2 Jul 2005 — 8:31am",
      "content": "\"There are now about as many different varieties of letters as there are different kinds of fools.\" [Eric Gill](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Eric%20Gill)\n\n"
    },
    {
      "time": "2 Jul 2005 — 10:58am",
      "content": "\"_Berthold_ is still a good typeface, but even _Berthold_ has some less than attractive features, and then I just cut them off because I didn't like them.\" - [Wolfgang Weingart](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Wolfgang%20Weingart)\n\n"
    },
    {
      "time": "2 Jul 2005 — 11:11am",
      "content": "\"Bodoni would be an admirable letter for a death notice!\"  \n- [G. W. Ovink](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/G.%20W.%20Ovink)\n\n[http://www.designingwithtype.com/essays/1\\_2.html](http://web.archive.org/web/20150312203856/http:/www.designingwithtype.com/essays/1_2.html \"http://www.designingwithtype.com/essays/1\\_2.html\")\n\nThere's a lot more there too.\n\nhhp\n\n"
    },
    {
      "time": "2 Jul 2005 — 11:14am",
      "content": "I've tried to find the english translation for this quote by [Giambattista Bodoni](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Giambattista%20Bodoni), but without luck I try to do it myself (from the Swedsih book I have)...\n\n\"The letters don't get their true delight, when done in haste & discomfort, nor merely done with diligence & pain, but first when they are created with love and passion.\"\n\n"
    },
    {
      "time": "2 Jul 2005 — 2:08pm",
      "content": "Tiffany, are you sure you have that Goudy quote correct? It is normally cited as 'lowercase', not 'blackletter'. Letterspacing blackletter is actually a well established convention to indicate emphasis, in the absence of italics, which has been practiced in Germany and other countries with long blackletter traditions, for at least two centuries.\n\n"
    },
    {
      "time": "2 Jul 2005 — 2:09pm",
      "content": "'Continued experiment with dog today' - [Eric Gill](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Eric%20Gill)\n\n"
    },
    {
      "time": "2 Jul 2005 — 3:00pm",
      "content": "**John,  \nI believe Tiffany got the quote all right.  \nWhen Goudy in 1936 recieved a handlettered certificate of excellence set in a heavily letterspaced uppercase blackletter, those were the words he uttered.  \nThe reason why it has changed over the years is not as much a mis-quotation as sometimes is suggested but rather a sort of evolution. I mean, it has a good punch to it, and lower case are easier to relate to.  \nMy guess, for what it's worth.**\n\nƒ\n\n"
    },
    {
      "time": "2 Jul 2005 — 3:19pm",
      "content": "\"Typography has one plain duty before it and that is to convey information in writing. No argument or consideration can absolve typography from this duty.\" -- [Emil Ruder](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Emil%20Ruder)\n\nChrisL\n\n"
    },
    {
      "time": "2 Jul 2005 — 3:35pm",
      "content": "\"After I came up with the idea to write a book that would, I hoped, become the standard, a sensation and win me the Nobel Prize for Literature, I started to feel uneasy.\" -- [Alessio Leonardi](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Alessio%20Leonardi)\n\nChrisL\n\n"
    },
    {
      "time": "2 Jul 2005 — 3:39pm",
      "content": "A type of revolutionary novelty may be extremely beautiful in itself; but, for the creatures of habit that we are, its very novelty tends to make it illegible, at any rate to begin with.  \n_Typography for the Twentieth-Century Reader_  \n **[Aldous Huxley](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Aldous%20Huxley)**\n\nType design moves at the pace of the most conservative reader. The good type-designer therefore realizes that, for a new fount to be successful, it has to be so good that only very few recognize its novelty.  \n_First Principles of Typography_  \n **[Stanley Morison](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Stanley%20Morison)**\n\nType well used is invisible _as_ type, just as the perfect talking voice is the unnoticed vehicle for the transmission of words, ideas.  \n_Printing Should Be Invisible_  \n **[Beatrice Warde](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Beatrice%20Warde)**\n\nIf you remember the shape of your spoon at lunch, it has to be the wrong shape. The spoon and the letter are tools; one to take food from the bowl, the other to take information off the page... When it is a good design, the reader has to feel comfortable because the letter is both banal and beautiful.  \n_Keynote Speech/Type90_  \n **[Adrian Frutiger](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Adrian%20Frutiger)**\n\nWhen we experience disappointment with the relationship with letters let's not be afraid to do what come naturally to us: Let's draw.  \n_Graphis Typography 1 (1994)_  \n **[Gerard Huerta](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Gerard%20Huerta)**\n\nAs we say in Berlin, there are many ways to bake a parrot.  \n_Rhyme & Reason_  \n **[Erik Spiekermann](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Erik%20Spiekermann)**\n\nYes, I'm old, but I'm back in style!  \n_Typophile Forum (2005)_  \n **[Norbert Florendo](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Norbert%20Florendo)**\n\n"
    },
    {
      "time": "2 Jul 2005 — 3:52pm",
      "content": "Tiffany, John and Fredrik\n\n**\"Men who would letterspace lower case would shag sheep\" - [Frederick Goudy](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Frederick%20Goudy)**\n\nI noticed the discrepancy in the quote a while ago, so i had looked into it. Thats what I came up with. I wonder if there is a definitive source for this.\n\nI saw some letterspaced lowercase the other day. Blarg. I'm sure letterspaced blackletter is equally hideous, never tried it, thats a good thing right?\n\nTiff, I've actually never heard that version before. I've heard the ' lowercase would steel sheep.' I prefer the 'sheep shag' version myself, but it'd be nice to find out for sure. It makes more sense if you think about it. Other than being theft of personal property, what is so disgusting about 'stealing' sheep anyway? So, if stealing sheep isn't exactly looked upon as repulsive, the shagging makes a little more sense. But I'm no goudy expert.\n\n"
    },
    {
      "time": "2 Jul 2005 — 4:06pm",
      "content": "_I’m sure letterspaced blackletter is equally hideous, never tried it, thats a good thing right?_\n\nThe keynote speaker at the [ATypI](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/ATypI) conference in Copenhagen referred to a lovely typographic metaphor in one of [Søren Kierkegaard](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/S%C3%B8ren%20Kierkegaard)'s books. In the original, blackletter edition approved by the author, who took a keen interest in the typography of his books, the metaphor relates a feeling of existential alienation and disconnection to being l e t t e r s p a c e d. In a later edition, typeset in antiqua (roman) type, the typesetters interpreted the letterspaced blackletter as italics, as was normal in resetting in antiqua from blackletter originals, and then, since the metaphor was now lost, actually changed the text. So in this later edition the existential alienation was bizarrely likened to being _italicised_.\n\n"
    },
    {
      "time": "2 Jul 2005 — 4:14pm",
      "content": "It could be this \\_\n\n“Men who would letterspace blackletter would shag sheep” - Frederick Goudy\n\n"
    },
    {
      "time": "2 Jul 2005 — 5:57pm",
      "content": "Of all the achievements of the human mind, the birth of the alphabet is the most momentous.  \n-- Frederic Goudy\n\n"
    },
    {
      "time": "2 Jul 2005 — 6:35pm",
      "content": "Yes. Hmm. I think we need to provide bibliographic information as Norbert has done. This will keep me from using quotes that are actually mis-quotes. So, if you can supply bibliography please do, if not still share your quote, maybe someone else will know.\n\n---\n\nI've heard that particular quote so many different ways that I'm not sure which is correct.\n\n"
    },
    {
      "time": "2 Jul 2005 — 7:16pm",
      "content": "The restrictions of two-dimensional communication appealed to my need for structure and my desire to have my work speak for me. The challenge of communicating an idea or feeling within the further confines of the Latin alphabet lad me from graphic design into type design.\n\n[Carol Twombly](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Carol%20Twombly)\n\n"
    },
    {
      "time": "2 Jul 2005 — 7:23pm",
      "content": "This one was used on the TypeCon2001 materials:\n\n\"We are type designers, punch cutters, type founders, compositors, printers and bookbinders from conviction and with passion. Not because we are insufficiently talented for other, higher, things, but because to us the highest things stand in the closest kinship to our own crafts.\" - [Rudolf Koch](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Rudolf%20Koch)\n\nI can't remember the bibliographic information on this one.  \n\\_\\_\\_\\_\n\nAbout the Goudy quote - I thought it was \"leterspace lowercase\" and \"bugger a sheep\". But I don't have any bibliographic information to back it up.\n\n"
    },
    {
      "time": "2 Jul 2005 — 8:28pm",
      "content": "“Typography has one plain duty before it and that is to convey information in writing. No argument or consideration can absolve typography from this duty.”  \n— [Emil Ruder](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Emil%20Ruder). page 6, \"Typographie\", 1967.\n\n“After I came up with the idea to write a book that would, I hoped, become the standard, a sensation and win me the Nobel Prize for Literature, I started to feel uneasy.”  \n\"From the Cow to the Typewriter\", page 8— [Alessio Leonardi](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Alessio%20Leonardi)\n\nChrisL\n\n"
    },
    {
      "time": "2 Jul 2005 — 9:02pm",
      "content": "\"Watching me work is like watching a refrigerator make ice.\"  \n- M Carter\n\nhhp\n\n"
    },
    {
      "time": "2 Jul 2005 — 9:15pm",
      "content": "There is an archived thread on here where [Erik Spiekermann](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Erik%20Spiekermann) talked about the sheep shagging/stealing quote but I can't find it. If I remember correctly, he said [Adobe](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Adobe) was behind changing ‘shag’ to ‘steal.’ There is this though.. [http://www.spiekermann.com/iblog/C1109747452/](http://web.archive.org/web/20150312203856/http:/www.spiekermann.com/iblog/C1109747452/ \"http://www.spiekermann.com/iblog/C1109747452/\") (search for the word shag)\n\n"
    },
    {
      "time": "3 Jul 2005 — 1:48am",
      "content": "\"Type production has gone mad, with its senseless outpouring of new types… only in degenerate times can personality (opposed to the nameless masses) become the aim of human development\" –&nbsp;Jan Tschicold; The New Typography; 1928  \n\"All the old fellows stole our best ideas.\" –&nbsp;Frederic Goudy; date unrecorded  \n\"The shapes of letter do not derive their beauty from any sensual or sentimental reminiscences. No one can say the O's roundness appeals to us only because it is like that of an apple or of a girl's breast or of the full moon. Letters are things, not pictures of things.\" – Eric Gill; Autobiography; 1940  \n\"I fought linotype and montype for some time because it would not justify as well as handset could be made to do; but at last, as always happens, the machine outdid the hand, and got all the best types on it.\" – George Bernard Shaw; Letter to Ruari McLean, 28/3/1949  \nTim\n\n"
    },
    {
      "time": "3 Jul 2005 — 9:21am",
      "content": " **Losing Sleep**  \n_by Ephram Edward Benguiat_\n\nThe following passages are taken from an undated typewritten manuscript. It's very likely these were used as notes for one of Ed's speaking engagements. There is no known date of publication.\n\n_\"To me designing has never been a job or profession. It's a way of life, like a priest or rabbi.\"_\n\n_\"Doing something a long time does not mean you're good. It only means you've done it a long time.\"_\n\n_\"Doing something and getting paid for it doesn't mean you're doing it well. It only means you're doing it.\"_\n\n_\"I don't think that success is the premise to what is good or bad.\"_\n\n_\"The contributions that one makes in typography, design, and art in general cannot be, and must not be measured on how much money is involved. That would lead to total chaos. The word itself (contribution) is to give to a common purpose.\"_\n\n-------------------------------------  \nYes, I'm old, but I'm back in style!\n\n"
    },
    {
      "time": "3 Jul 2005 — 11:07am",
      "content": "Hey Folks: No k in Frederic Goudy. Sheep stealers!\n\nJim\n\n"
    },
    {
      "time": "3 Jul 2005 — 11:46am",
      "content": "Some of my faves:\n\n\"People who love ideas must have a love of words. They will take a vivid interest in the clothes that words wear.\" - [Beatrice Warde](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Beatrice%20Warde)\n\n\"Perfect typography is certainly the most elusive of all arts. Sculpture in stone alone comes near it in obstinacy.\" [Jan Tschichold](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Jan%20Tschichold), Homage to the Book, 1968\n\n\"Each letter should have a flirtation with the one next to it.\" [Mac Baumwell](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Mac%20Baumwell)\n\n\"Writing is not a series of strokes, but space, divided into characteristic shapes by strokes.\" [Gerrit Noordzij](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Gerrit%20Noordzij)\n\n\"The most popular typefaces are the easiest to read; their popularity has made them disappear from conscious cognition. It becomes impossible to tell if they are easy to read because they are commonly used, or if they are commonly used because they are easy to read.\" - [Zuzana Licko](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Zuzana%20Licko)\n\n"
    },
    {
      "time": "3 Jul 2005 — 11:57am",
      "content": "I found another version of Beatrice Warde's quote and think this one is better:\n\n\"People who love ideas must have a love of words, and that means, given a chance, they take a vivid interest in the clothes which words wear.\"\n\nAnd two more:\n\n\"Typography, a perfect fusion of form and meaning in which beauty is born, is raised from mere craft and can claim the title of a philosophy; for it also includes ethics, that enobling factor of man's destiny. Thus the printed word is in touch with the spirit.\" - Raul Mario Rosarivo, 1951.\n\n\"Any work of art that makes us feel the artist tried too hard lacks clarity.\"  \nClayton Whitehill, The Moods of Type, 1947\n\n"
    },
    {
      "time": "3 Jul 2005 — 7:03pm",
      "content": "Some additional info on Erik Spiekermann's paraphrase of Goudy's quote --\n\nSource:  \n**Stop Stealing Sheep**  \n& find out how type works  \n_Erik Spiekermann & E.M. Ginger_  \nFirst printing: December 1992  \nCopyright © 1993 Adobe Systems\n\nOn the first page of text, Erik added a sidebar to explain his use of Goudy's quote:\n\n_In 1936, Frederic Goudy was in New York City to receive an award for excellence in type design. Upon accepting a certificate, he took one look at it and declared that \"Anyone who would letterspace black letter would steal sheep.\"_\n\nEric goes on to mention:\n\n_You might have noticed that our book cover reads \"lower case,\" while here it reads \"black letter\" -- two very different things._\n\nHe then added a small sample of CAPITALS, lower case and black letter (printed in black letter) to illustrate the difference to the uninformed reader.\n\nEric continues:\n\n_We're not sure how \"black letter\" got changed to \"lower case,\" but we've always known it to be the latter; whichever way, it makes infinite sense._\n\n-------------------------------------  \nYes, I'm old, but I don't shag sheep!\n\n"
    },
    {
      "time": "4 Jul 2005 — 12:31am",
      "content": "'If you don't get your type warm it will be just a smooth, commonplace, third-rate piece of good machine technique - no use at all for setting down warm human ideas - just a box full of rivets... By jickity, I'd like to make a type that fitted 1935 all right enough, but I'd like to make it warm - so full of blood and personality that it would jump at you.  \n**From Dwiggins fictional argument over the modern age of steel and speed.**  \nWilliam Addison Dwiggins\n\n"
    },
    {
      "time": "4 Jul 2005 — 2:59am",
      "content": "Googled with \"letterspace sheep Goudy\":\n\n[http://www.eyewire.com/magazine/columns/robin/blackletter/](http://web.archive.org/web/20150312203856/http:/www.eyewire.com/magazine/columns/robin/blackletter/ \"http://www.eyewire.com/magazine/columns/robin/blackletter/\")\n\nBlackletter it appears to be. Confirmed by Wikipedia (?):\n\n[http://en.wikipedia.org/wiki/Frederic\\_Goudy](http://web.archive.org/web/20150312203856/http:/en.wikipedia.org/wiki/Frederic_Goudy \"http://en.wikipedia.org/wiki/Frederic\\_Goudy\")\n\n"
    },
    {
      "time": "4 Jul 2005 — 3:16am",
      "content": "[Helvetica](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Helvetica) is the jeans, and [Univers](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Univers) the dinner jacket. Helvetica is here to stay . [Adrian Frutiger](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Adrian%20Frutiger)\n\nIn a way, The Beatles are the Helvetica of pop; just like Helvetica is The Beatles of typefaces . Experimental Jetset\n\nIf you have no intuitive sense of design, then call yourself an \"information architect\" and only use Helvetica . [David Carson](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/David%20Carson)\n\nAnyone who uses Helvetica knows nothing about typefaces . [Wolfgang Weingart](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Wolfgang%20Weingart)\n\nI discovered that I never really used Helvetica but I like to look at it. I like the VW beetle, too, although I've never driven one . [Stefan Sagmeister](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Stefan%20Sagmeister)\n\nI have never designed a logotype without first trying it in Helvetica. It is still the most versatile, classic and readable of all typefaces. [Steff Geissbuhler](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Steff%20Geissbuhler)\n\nAny good typeface can be completely destroyed when misused or extensively overused. Helvetica seemed to sustain a beating like no other. Still fresh, still popular Helvetica is king . [Alexander Gelman](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Alexander%20Gelman)\n\nThere was once a typeface that had the reputation of being more legible and functional than all the others. It was used everywhere and for everything, from signs to logos. Then one day readers couldn't stand seeing it anymore and decided to stop reading it – despite its superior legibilty. Bit by bit designers forgot about it and it was only used by lay people. Then it was rediscovered for a while and in fashion again. Even books were published about it . [Ruedi Baur](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Ruedi%20Baur)\n\nHelvetica is the typeface for a deserted island . [Friedrich Friedl](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Friedrich%20Friedl)\n\nWe hate to like Helvetica . [Hamish Muir](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Hamish%20Muir)\n\nI remember a time at Yale when my work was being critiqued by [Paul Rand](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Paul%20Rand). Mr. Rand told me only to use Helvetica as a display face never in text, then he squinted, leaned in, and whispered in my ear, \"because Helvetica looks like dogshit in text\" . [Kyle Cooper](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Kyle%20Cooper)\n\n(all from the flyer to the book «Helvetica - Homage to a Typeface», edited by [lars müller](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/lars%20m%C3%BCller))  \n12 x 16 cm, 256 pages, 800 illustrations, hardcover.  \n--- more infos on [www.lars-mueller-publishers](http://web.archive.org/web/20150312203856/http:/www.lars-mueller-publishers/ \"www.lars-mueller-publishers\") --\n\n"
    },
    {
      "time": "4 Jul 2005 — 6:52am",
      "content": "Hey, what's going on!? Why hasn't anyone quoted me yet?\n\n"
    },
    {
      "time": "4 Jul 2005 — 6:59am",
      "content": "\"I'm also interested in calligraphy and occasional book-burning.\" - Sergej Malinovski\n\n(careful what you wish for... : ) )\n\n"
    },
    {
      "time": "4 Jul 2005 — 7:09am",
      "content": "\"In former times producing a typeface was an effort architectural in scale. A typeface was exquisitely expensive to cut. The choice to make one had a you-bet-your-company gravity to it.\" - Mike Parker, Bitstream\n\n\"Set a page in Fournier against another in Caslon and another in Plantin and it is as if you heard three different people delivering the same discourse — each with impeccable pronunciation and clarity, yet each through the medium of a different personality.\"  \n- Beatrice Warde, 1933\n\n\"Discipline in typography is a prime virtue. Individuality must be secured by means that are rational. Distinction needs to be won by simplicity and restraint. It is equally true that these qualities need to be infused wiht a certain spirit and vitality, or they degenerate into dullness and mediocrity.\" - Stanley Morison\n\n"
    },
    {
      "time": "4 Jul 2005 — 12:36pm",
      "content": "\"If you like what you do, and you’re lucky enough to be good at it, do it for that reason.\"\n\nPhil Grimshaw\n\n"
    },
    {
      "time": "4 Jul 2005 — 12:38pm",
      "content": "\"Bring back the old Typophile\"  \n-- Sergej\n\nChrisL\n\n"
    },
    {
      "time": "4 Jul 2005 — 3:32pm",
      "content": "I found this in David Jury's About Face: Reviving the rules of Typography, 2004. It's an anonymous quote and not really about typefaces per se, but I thought you'd enjoy it nonetheless:\n\nEye halve a spelling chequer  \nIt came with my pea sea  \nIt plainly marques four my revue  \nMiss steaks eye kin knot sea.  \nEye strike a quay and type a word  \nAnd weight four it too say  \nWeather eye yam wrong or write  \nIt shows me strait a weigh.  \nAs soo as a mist ache is maid  \nIt nose bee fore two long  \nAnd eye can put the era rite  \nIts rare lee ever wrong.  \nEye have rune this poem threw it  \nI am shore yore pleased two no  \nits letter perfect awl the weigh  \nMy chequer tolled me so.\n\n"
    },
    {
      "time": "5 Jul 2005 — 8:47am",
      "content": "\"…a work of art, i.e. a thing made by a man who, however laughable it may seem to men of business, loves God and does what he likes, who serves his fellow men because he is wrapped up in serving God — to whom the service of God is so commonplace that it is as much bad form to mention it as among men of business it is bad form to mention profits.\"\n\n\"I think it is generally agreed that picture writing was the beginning of our lettering. You might wish to communicate something to someone at a distance. If you have no letters or none common both to you & your correspondent, what else can you do but draw a picture? — the language of pictures is common to all. After a time your pictures are used to signify words and not simply things, and as the system develops and communications become more precise, the pictures become simpler and simpler, more & more conventional, and they come to signify single sounds rather than whole words. And the pictures, by now, have ceased to be pictures. They are, by now, hardly recognizable as representations of things: they are conventional signs, & their pictorial origin is forgotten.\"\n\n–Eric Gill, An Essay on Typography, 1936\n\n"
    },
    {
      "time": "5 Jul 2005 — 10:42am",
      "content": "\"A typeface is an alpahbet in a straightjacket\"  \n- Alan Fletcher\n\n"
    },
    {
      "time": "5 Jul 2005 — 10:49am",
      "content": "I think this is from \"Letters of Credit\" by [Walter Tracy](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Walter%20Tracy), but I can't put my hand on it at the moment:\n\n\"A great typeface is not a collection of beautiful letters, but a beautiful collection of letters.\"\n\n"
    },
    {
      "time": "5 Jul 2005 — 10:53am",
      "content": "I think Matthew Carter said that (Logo, Font & Lettering Bible)\n\n"
    },
    {
      "time": "5 Jul 2005 — 10:55am",
      "content": "William, do you have a copy of Walter Tracy's \"Letters of Credit\"?  \nIf not, I can check the quote this evening at home.\n\n--------------------------------------------------  \nYes, I'm old, but I'm back in style!\n\n"
    },
    {
      "time": "5 Jul 2005 — 10:58am",
      "content": "Norbert, I have it, but I seem to have misplaced it (arrrrghh! as Charlie Brown used to say).\n\n"
    },
    {
      "time": "5 Jul 2005 — 11:07am",
      "content": "My copy of [Leslie Cabarga](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Leslie%20Cabarga)'s 'Bible' is to hand. On p. 200 the quote from [Matthew Carter](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Matthew%20Carter) is\n\n\"As the saying goes, type is a beautiful group of letters, not a group of beautiful letters.\"\n\nSo Carter felt he was quoting someone else. Maybe Tracy?\n\n"
    },
    {
      "time": "5 Jul 2005 — 1:56pm",
      "content": "“You can do a good ad without good typography, but you can't do a great ad without good typography.”  \n **[Herb Lubalin](http://web.archive.org/web/20150312203856/http:/typophile.com/wiki/Herb%20Lubalin)**\n\nSource:  \n_Herb Lubalin obituary, Baseline issue four, TSI Typographic Systems International Limited, 1981_\n\n"
    },
    {
      "time": "5 Jul 2005 — 3:31pm",
      "content": "You have pre-#10 issues of Baseline?!\n\nhhp\n\n"
    },
    {
      "time": "5 Jul 2005 — 3:53pm",
      "content": "This one was £2 at the [Bristol Book Barn](http://web.archive.org/web/20150312203856/http:/www.bookbarn.co.uk/). It has only 20 pages but every article is very readable today. Excellent short pieces on New Johnston, Renault, Usherwood's Caxton, Baskerville and Adrian Frutiger. (I give out that Book Barn link reluctantly. On the road to Bath, it is a kind of purgatory for books: a cold, depressing place with free instant coffee. But you have to check it every now and then.)\n\n"
    },
    {
      "time": "5 Jul 2005 — 4:12pm",
      "content": "type is a beautiful group of letters, not a group of beautiful letters = Tracy\n\n"
    },
    {
      "time": "5 Jul 2005 — 4:19pm",
      "content": "\"From an early age he loved letters in the literal rather than literary sense.\"  \n**Timothy Rogers, writing of Will Carter**\n\n\"It is a rarer gift to lay words out properly than to write them\"  \n**Nicholas Barker, writing of Will Carter**\n\n\"The seventies were my fattest decade. Overall I think the seventies were distinctly bulbous. People looked chunky, typefaces were rounded, writing implements penile.\"  \n**Will Self**\n\n"
    },
    {
      "time": "5 Jul 2005 — 6:02pm",
      "content": "_There is a distinct advantage in being a practising typographer when it comes to deciding on a new typeface design. There seems little sense in designing faces that will not be profitable for the typesetter and it happens too often that designers tend to go down just one path as opposed to designing the variety of faces needed to ensure a good mix. As a result, their designs tend to look too much like each other._\n\n**Les Usherwood**  \nArticle on release of TSI Caxton (pages 6 -- 9)  \nBaseline, International Typographics Magazine, Issue four\n\nOddly enough, I also have a copy of Baseline issue four. Somehow it managed to survive in my old files.\n\n--------------------------------------------  \nYes, I'm old, but I found my Baseline!\n\n"
    },
    {
      "time": "6 Jul 2005 — 3:09am",
      "content": "Hello  \nMy name is German Bold Italic  \nI am a type face  \nWhich you have never heard before  \nWhich you have never seen before  \nI can compliment you well  \nEspecially in red  \nExtremely in green  \nMaybe in blue blue blue\n\nYou will like my sense of style  \nYou will like my sense of style\n\nI fit like a glove - ooh!\n\nGut ja!  \nGut ja!\n\n-Kylie Minogue (said it sung it)\n\n"
    },
    {
      "time": "6 Jul 2005 — 4:15am",
      "content": "Kylie? I thought it was Towa Tei.\n\n"
    }
  ]
}
