{
  "id": "13436",
  "title": "InDesign: Page/spread setup of self-published book",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,  \nI'm trying to find a good way of printing a little book project from a standard inkjet and A4 format.  \nWhat I want to do is set up a layout in Indesign that lets me do the following:\n\n1. book will be printed one side only  \n2. A4 divided in four to provide 4 pages  \n3. Pages 3,4...7,8...etc. rotated so I can fold the sheet an trim it at lower edge (Book will have the paper-fold towards reader)\n\nsee attachment.\n\nI could of course just set up the A4 and do the layout there, but is there any way of setting up a Spread like this in Indesign? Or any other clever way of doing it?\n\n| Attachment | Size |\n| --- | --- |\n| [a4\\_four.gif](http://web.archive.org/web/20120107044637/http:/typophile.com/files/a4_four.gif) | 2.79 KB |\n\n",
  "author": "<a href=\"/web/20120107044637/http://typophile.com/user/7905\" title=\"View user profile.\">Fredrik</a>",
  "time": "<br>",
  "uid": "7905",
  "comments": [
    {
      "time": "",
      "content": "As far as I can see, InDesign doesn't really provide much in the way of imposition support. Which is a little frustrating. There are various plugins of which [InBooklet](http://web.archive.org/web/20120107044637/http:/www.alap.com/products/inbooklet.html) is the one I use if I'm doing something small like this. You can download a free trial from their web site.\n\nAlternatively, I remember seeing some free plugins for Adobe Acrobate which will turn an exported PDF into various predefined impositions. Have a look on [Version Tracker](http://web.archive.org/web/20120107044637/http:/www.versiontracker.com/php/search.php?mode=basic&action=search&str=imposition&plt%5B%5D=macosx&x=0&y=0).\n\nHope this helps\n\n\\_  \nNick\n\n"
    },
    {
      "time": "",
      "content": "The whole idea with ID is that outside vendors would produce plugins to be used with it.\n\n"
    },
    {
      "time": "",
      "content": "The imposer I use is Imposer Pro by ALAP, [http://www.alap.com/](http://web.archive.org/web/20120107044637/http:/www.alap.com/ \"http://www.alap.com/\") They also have a free trial download. If you end up buying it, its a bit pricey, but well worth if you are into publishing books in small runs. The only other way is to figure out what the pages positions would be in their imposition states and drag them manually to those spots. The best way I have found to do this is by making a dummy and visually matching up the pages. It can get tricky though. If you have pages numbers, you have to make sure they are not shifting around with any kind of automation. If you have images they run over the gutters, you have to duplicate each side for each page. But, it is possible. I have done it many times. It would be even trickier to do a 4-up situation like you want, but possible. It can be real annoying with a very long book though. And, save that file as another version before you start dragging pages around!\n\n"
    },
    {
      "time": "",
      "content": "Thanks for your comments.  \nI've learned a lot today from following up on your suggestions and links. Imposition. Typophile is great.  \nThe referenced plugins sound like the thing to get - I gather that InBooklet is a bit like a \"light\" version of Imposer.\n\nShu, that's a lovely 11, but mighty big 60x60 pixels, no? ;)\n\n"
    },
    {
      "time": "",
      "content": "Yes, I've been meaning to bring down the 11's imposing anger, but it keeps slipping my mind. Glad you like it though. It was a fun mark to make.\n\n"
    },
    {
      "time": "",
      "content": "Just curious, what happens if you print the page spreads to pdf, take it to Kinko's and say, \"I want twenty copies spiral bound\"? Will they figure out the impostion stuff for you, or will they screw it all up?\n\n"
    },
    {
      "time": "",
      "content": "Just curious, what happens if you print the page spreads to pdf, take it to Kinko's and say, \"I want twenty copies spiral bound\"? Will they figure out the impostion stuff for you, or will they screw it all up?\n\n"
    },
    {
      "time": "",
      "content": "They'll tell you your file is corrupt and proceed to print it so it folds against the grain, of course.\n\nSDK  \nSusan Kirkland  \nSDKirkland Master Designer  \nAuthor of  \nStart & Run a Creative Services Business ISBN 155180607X  \nView my work and excerpts from the book (click the book icon) at [www.sdkirkland.com](http://web.archive.org/web/20120107044637/http:/www.sdkirkland.com/ \"www.sdkirkland.com\")\n\n"
    },
    {
      "time": "",
      "content": "InD CS 2 includes InBooklet, but it's not the full version. It'll re-order reader spreads into printer's spreads, but I don't think it'll do what you're looking for.\n\nKinko's is now FedEx Kinko's, so your now half as likely to get someone who even understands the computer they're working on, let alone printing techniques. I've had bad experiences there, even with simple printing instructions.\n\n"
    },
    {
      "time": "",
      "content": "\\> book will be printed one side only...  \n\\> Book will have the paper-fold towards reader\n\nSo the bound book will consist of pages folded in half with the fold towards the reader? Why not just print on both sides of each page in the conventional manner?\n\n"
    },
    {
      "time": "",
      "content": "Oops, didn't notice the original post was 5 years old.\n\n"
    }
  ]
}
