{
  "id": "1344",
  "title": "31Three Graphic Design Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello,   \nI've often visited these boards but this is my first time posting. I've always seen typography as the upper echelon of design... and I find it a little intimidating.   \n   \nAnyway... on to my post. I've been running a graphic & web design business for a little over two years now and I'm in need of a makeover for my site and identity. You can view what I have now here:   \n   \n [http://www.31threedesign.com](http://web.archive.org/web/20150417143521/http:/www.31threedesign.com/)   \n   \nI want to start with a new logo but I've had a real hard time finding the right font to use, mainly because of the shape of the word and the fact that it begins with the number 3.   \n   \nThis is something that I've been thinking of using... but it's still lacking in something.   \n   \n ![31three logo](http://web.archive.org/web/20150417143521im_/http:/www.typophile.com/forums/messages/29/16523.gif)   \n   \nIt's a modified bank gothic. I've very open to suggestions and modifications. The illustrator file is [here](http://web.archive.org/web/20150417143521/http:/www.31threedesign.com/31three.zip) for those who like to mess with stuff.   \n   \nI'm not trying to get you to do my work for me... I'm just really stuck and need some help to get me rolling in a new direction.   \n   \nThanks!   \nJesse BC\n\n",
  "author": "Jesse Bennett-C...",
  "time": "21 Sep 2003 — 11:45am",
  "uid": "2331",
  "comments": [
    {
      "time": "21 Sep 2003 — 1:33pm",
      "content": "I think there might be a problem with people trying to read it as one of those funky number/letter swapping things, you know what I'm talking about? But this isn't like that, and it would throw them off. Maybe put some kind of separation between \"31\" and \"THREE\".   \n   \nThe \"R\" doesn't seem to be working.   \n   \nI think you should shear the terminals of the \"3\" horizontally.   \n   \nhhp\n\n"
    },
    {
      "time": "21 Sep 2003 — 3:25pm",
      "content": "Thanks for the quick feedback... I've made some tweaks to the file...   \n   \n ![31three logo](http://web.archive.org/web/20150417143521im_/http:/www.typophile.com/forums/messages/29/16539.gif)   \n   \nAlso... here's another spin on the logo...   \n   \n ![31three logo](http://web.archive.org/web/20150417143521im_/http:/www.typophile.com/forums/messages/29/16540.gif)\n\n"
    },
    {
      "time": "21 Sep 2003 — 4:12pm",
      "content": "whoops... double post\n\n"
    },
    {
      "time": "21 Sep 2003 — 5:31pm",
      "content": "Jesse:   \n   \nThe first thing that comes to mind is to reverse the \"E\" to create the three. this will begin to help with the shape of the word. Next I might try combining the \"1\" and \"T\" using the left arm and stem of the \"T\" to create the \"1\", while separating (through space or color) the right arm of the \"T\". As for a type recommendation, I would probably look for something less soft (less rounded corners) to correlate with the forwardness of the title.   \n   \nOf course, this is just what I might try. I wish you luck coming to the perfect solution. I'm sure you'll get a lot of valuable assistance from some typophiles who are much more qualified than I am.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "22 Sep 2003 — 12:56pm",
      "content": "One possibility is that the difficulty you are having comes from the fact that the (arabic) numerals and (roman) letters have a different inner logic & rules of thick-thin contrast.   \n   \nIf this is the case, then you might find a solution by making the numerals more different and contrasting, using weight, style, color etc., rather than more similar. You could also try separating them by a dash, dot, etc.   \n   \nI can see that you might improve on the current logo on your web site, but it does go the contrast/separation route. Maybe another solution on that same route will work for you.\n\n"
    },
    {
      "time": "22 Sep 2003 — 3:43pm",
      "content": "I had a minute to checkout your site today. I love the simplicity of it and you've done some very nice work. Have you considered dropping the numeral/letter approach altogether? I was drawn to the \"31:3\" on your portfolio page. It reminds me of traditional chapter:verse referencing. Considering the style you seem to convey through your work, I think this is an approach you could pull off very well.   \n   \n31:03, (31:03), [31:03], etc\n\n"
    },
    {
      "time": "23 Sep 2003 — 12:34am",
      "content": "Hi Jesse,   \n   \nI agree with Joseph. I also visited your website and it seems to me that you have a very 'classical' style. If this is your strength, use it. If not, and you want to reach also a younger audience, then change it.   \nBut don't change it that much. My advice is to keep it still a little bit classical. That's what seems to be your strength.   \n   \nI like the idea from Scott to use the 31:3. Or use the 3 as an 'E'.   \n   \nRegards,   \nRen\n\n"
    },
    {
      "time": "23 Sep 2003 — 5:10am",
      "content": "Thanks for all the input guys... this really is a great forum. I'm curious about using the 31:03 or 31:3 however the registered name of the business is actually 31three. I'm afraid that I'll start getting cheques made out to 31:3... which would be a hassle. 31:Three might help me out though. The name is actually based on Exodus 31:3.   \n   \n [Bible Gateway Link](http://web.archive.org/web/20150417143521/http:/www.biblegateway.com/cgi-bin/bible?passage=EXOD%2B31%3A3-4&showfn=on&showxref=on&language=english&version=NIV&x=8&y=6)   \n   \nI'm going to start messing with some more classical stuff. I've been avoiding serifs... but I'll revisit them. I'll post some more ideas as I get them.   \n   \nThanks again.\n\n"
    },
    {
      "time": "23 Sep 2003 — 5:26am",
      "content": "Bezalel and Oholiab were definitely crafty typophiles. -Randy\n\n"
    },
    {
      "time": "23 Sep 2003 — 7:46am",
      "content": "As you may know, the Bezalel Academy is the name of the premier school for design in Israel. Here is the English site: [http://www.bezalel.ac.il/sitee/homepage.asp](http://web.archive.org/web/20150417143521/http:/www.bezalel.ac.il/sitee/homepage.asp)\n\n"
    },
    {
      "time": "24 Sep 2003 — 7:37am",
      "content": "![31Three Logo](http://web.archive.org/web/20150417143521im_/http:/www.typophile.com/forums/messages/29/16806.gif)   \n   \nI've been looking on t26's site for some fonts and found a beautiful one called paralucent. I was wondering how you think it works for this name.   \n   \nIt's one of the few that I found where the 3 is strong and on the same baseline as the rest of the glyphs.   \n   \nThe sample I posted up there are just screenshots so they're kinda messy... but If I were to go with this font I would obviously purchase it.   \n   \n- Jesse\n\n"
    },
    {
      "time": "24 Sep 2003 — 7:44am",
      "content": "Forgot to mention as well... thanks for all the advice so far. I tried flipping the E to be a 3 but it just wasn't working for me.   \n   \nThe main thing I hear about my design is that it's \"clean\". I want my logo to express this as well as have something that is going to last and not be too trendy. I think my first post is a bit on the trendy side. This last font is a bit more timeless. Thoughts?\n\n"
    },
    {
      "time": "24 Sep 2003 — 8:05am",
      "content": "I think your best bet is doing the \"three\" all-lc.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Sep 2003 — 9:47am",
      "content": "The Paralucent harmonizes the 3 and the Roman caps well and cleanly, but the 3 does look contemporary. To me that's fine, but I don't know how traditional you want to look.   \n   \nOne way to go more traditional is with small caps and a colon between the numberals and letters. Goudy Old Style, with its diamond shaped dots, would also give the hint that it is Biblical reference.\n\n"
    },
    {
      "time": "24 Sep 2003 — 10:01am",
      "content": "I think my style has shifted a lot in the past few years. When I was first transitioning from print to web I had a more classical style... but now that most of my time is spent on webdesign... it's taken a lot more contemporary feel.   \n   \nFor example... here are two of my latest projects... still under development.   \n   \n [http://sea.surpasshosting.com/~lwc/](http://web.archive.org/web/20150417143521/http:/sea.surpasshosting.com/~lwc/)   \n [http://www.frame24productions.com/index2.php](http://web.archive.org/web/20150417143521/http:/www.frame24productions.com/index2.php)   \n   \nI'm really liking paralucent. It's a very beautiful font. It reminds me of helvetica neue that everyone is using these days... but it's also kinda unique.   \n   \nI just wish I could play with it a bit more before I plunked down the cashola.\n\n"
    },
    {
      "time": "24 Sep 2003 — 10:21am",
      "content": "I just tried Hrant's suggestion of all l.c. & also made the whole thing italic with Paralucent's 'completeold' option on their typesetter. You might check it out; I thought it worked quite nicely.   \n   \nI agree that contemporary usually works better on the web. Maybe it's because the low-res needs bolder types, with fewer small details...\n\n"
    },
    {
      "time": "25 Sep 2003 — 9:13am",
      "content": "Ok... I just bought paralucent light and whipped up this logo... I don't have an icon for it yet... but let me know what you think of this...   \n   \n ![31threelogo](http://web.archive.org/web/20150417143521im_/http:/www.typophile.com/forums/messages/29/16919.gif)\n\n"
    },
    {
      "time": "25 Sep 2003 — 9:46am",
      "content": "This has some potential. As far as an icon goes, I think if you went this route (as shown in your latest posting) the the prominence of the 1/T makes that a no brainer icon. I think you would either have to use or lose this element. Regardless, I would love to see it explored.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "25 Sep 2003 — 2:08pm",
      "content": "My only thought on the logo is I don't like that everything is the same size. Why not make the 31 smaller and tuck it under the cap T in Three. I like the type face Jesse chose the e's adn the g are interesting.\n\n"
    },
    {
      "time": "11 Nov 2003 — 4:15pm",
      "content": "[http://www.31three.com/beta/](http://web.archive.org/web/20150417143521/http:/www.31three.com/beta/)   \n   \nHere's the final logo that I ended up with... just thought I'd post it here to complete the entry.   \n   \nThanks for all of your help!   \n   \nJesse BC\n\n"
    },
    {
      "time": "12 Nov 2003 — 2:00am",
      "content": "Jesse, the site looks fantastic...   \nyou have a knack for great design, imo.   \n   \nbj\n\n"
    },
    {
      "time": "12 Nov 2003 — 8:09am",
      "content": "I second that! As well as being impressive to the design community, your site has elements that have excellent corporate appeal. You should be able to land some good sized corporate clients by marketing to your website. Congratulations!   \n   \nAloha,   \nScott\n\n"
    },
    {
      "time": "13 Nov 2003 — 4:45am",
      "content": "Yeahh, I agree with the rest! Your website is a exellent and beautiful product.   \n   \nMay I ask what font you used for this logo?   \n   \nCheers and gongratz!   \n/Henriko   \n   \n ![31logo](http://web.archive.org/web/20150417143521im_/http:/www.typophile.com/forums/messages/29/20400.gif)\n\n"
    },
    {
      "time": "13 Nov 2003 — 4:55am",
      "content": "Looks like Paralucent:   \n [http://www.veer.com/results.asp?Image=DET0000190](http://web.archive.org/web/20150417143521/http:/www.veer.com/results.asp?Image=DET0000190)\n\n"
    },
    {
      "time": "13 Nov 2003 — 7:44am",
      "content": "The way you have made the site visually exciting while keeping a very simple structure is wonderful. Congrats.\n\n"
    },
    {
      "time": "22 Sep 2003 — 7:09pm",
      "content": "I agree that your current 'classical' look could use a refresh,   \nbut I wouldn't go so far as to base it on Bank Gothic. (But my   \nbias against Bank is showing.)   \n   \nWhat I mean is, give your identity an update, but don't   \ntotally reinvent it.\n\n"
    }
  ]
}
