{
  "id": "13449",
  "title": "text face in Bob Woodward's \"The Secret Man\"",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "[Here is the image.](http://web.archive.org/web/20051126220321/http:/images.amazon.com/images/P/0743287150.01._SCLZZZZZZZ_.jpg)\n\nI was walking through Target and saw this yesterday. I recognized the type on the jacket, and thought I was seeing Carter’s Mantinia, but when I cracked open the cover to see the title page, the display and text face looked very similar and played very well with it. I was curious if anyone could confirm Mantinia or if someone who has picked it up could confirm the text face. (As Mantinia is impossible.)\n\nThanks\n\n",
  "author": "rjhunter",
  "time": "5 July, 2005 - 7:01am",
  "uid": "3282",
  "comments": [
    {
      "time": " 5 July, 2005 - 8:09am",
      "content": "I haven’t seen the book, but my first guess would naturally be [Galliard](http://web.archive.org/web/20051126220321/http:/www.identifont.com/show?NU).\n\n"
    },
    {
      "time": " 5 July, 2005 - 8:49am",
      "content": "Check out the B’s in Galliard and Mantinia. The B on the book cover, the cross bar where the 2 bowls of the b meet. Galliards closes both bowls, Mantinia leaves the bowls connected and open.\n\nAlso check out the ‘foot’ of the R’s. Galliards is rather plain, whilst Mantinia’s has a rather pronounced brush flair.\n\nI vote Mantinia.\n\n"
    },
    {
      "time": " 5 July, 2005 - 9:38am",
      "content": "I’d agree that this is Mantinia.\n\n"
    },
    {
      "time": " 5 July, 2005 - 9:38am",
      "content": "The cover is definitely Mantinia — I was taking a guess at the text face. Galliard plays very well with Mantinia. ;)\n\n"
    },
    {
      "time": " 5 July, 2005 - 10:28am",
      "content": "Yes, agreed. I wish I had scans. I’ll get them up if I can pick up the book sometime soon.\n\n"
    },
    {
      "time": " 23 July, 2005 - 6:43am",
      "content": "I was in Borders yesterday and took a look at this book. The text font appears to be John Hudson’s [Manticore](http://web.archive.org/web/20051126220321/http:/www.myfonts.com/fonts/tiro/manticore/), but there was no colophon to be sure.\n\n"
    }
  ]
}
