{
  "id": "13458",
  "title": "Compound Paths Suck",
  "forum": "Build",
  "tags": [

  ],
  "content": "I’m not sure if this is specific to my universe or not, but when I am making a vector object in Illustrator, in this case a logo, if I turn something into a compound path the elements that are reversed out become much much fainter.\n\nConversly, if keep those reverses as solid shapes and just layer them over the background fill then the reverse are strong.\n\nThis happens both on screen and on paper!\n\nWhat the hell?\n\nI wouldn’t mind it so much, but in the case of a logo, I have to have a bunch of extra shapes in there so that it will work. Kinda gets messy.\n\nI didn’t have this problem before CS though.\n\nIn my attachment the logo piece uptop is compound, down below if layered/non compound. I’d really love some insight on this. Oh, and I should add, those are the same EXACT shapes.\n\n| Attachment | Size |\n| --- | --- |\n| [compoundPathsSuck.gif](http://web.archive.org/web/20081007161324/http:/typophile.com/files/compoundPathsSuck.gif) | 1.66 KB |\n| [test.pdf](http://web.archive.org/web/20081007161324/http:/typophile.com/files/test.pdf) | 401.61 KB |\n\n [‹ Inlining…](http://web.archive.org/web/20081007161324/http:/www.typophile.com/node/13443 \"Go to previous forum topic\") [Is there any utility for rename the opentype font ›](http://web.archive.org/web/20081007161324/http:/www.typophile.com/node/13447 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007161324/http://www.typophile.com/user/1839\" title=\"View user profile.\">markatos</a>",
  "time": "<br>",
  "uid": "1839",
  "comments": [
    {
      "time": " 5.Jul.2005 4.02pm",
      "content": "Peter could you get us some larger images. I see what you are saying, but i can’t really make out what could be going on.\n\n"
    },
    {
      "time": " 5.Jul.2005 4.43pm",
      "content": "sure. though when you see them large the problem disappears.\n\nI’ll post a pdf.\n\nIn that pdf both stars are exactly the same size. what gives?\n\n"
    }
  ]
}
