{
  "id": "13471",
  "title": "Josef Muller-Brockmann",
  "forum": "Home",
  "tags": [
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20131019144228/http:/typophile.com/wiki/Indices) : [Designers](http://web.archive.org/web/20131019144228/http:/typophile.com/wiki/Designers) : Josef Müller-Brockmann**\n\nJosef Müller-Brockmann, was born in Rapperswil, Switzerland on May 9th 1914. By the early 1930's he became an apprentice as a graphic designer and later in 1936 opened his own Zürich based studio. Brockmann became interested in many forms of design such as poster design, corporate identity, and exhibit design, as well as some illustration (found mostly in his earlier works).\n\nOver time Brockmann's style became very recognizable based on strict principals and beliefs which in time ended up becoming key aspects of what was dubbed the \"Swiss Style\", and later \"The International Typographic Style\". Moreover, a major component in this movement was a Swiss publication co-published by Brockmann called \"Neue Graphik\" (1959-1965).\n\nBrockmann structured his work using grids which allowed for very percise positioning of elements, and the creation of systems to consistently organize content with a clear hierarchy. Often he is credited as being the inventor of the modern grid system and one of the biggest authorities on the subject. In 1961 he published his book [Grid Systems in Graphic Design](http://web.archive.org/web/20131019144228/http:/typophile.com/wiki/Grid%20Systems%20in%20Graphic%20Design) which became a very important text for designers learning to use the grid properly and effectively for a wide variety of purposes. Furthermore, Brockmann almost always used sans-serif type ( specifcally his typeface of choice: [Akzidenz Grotesk](http://web.archive.org/web/20131019144228/http:/typophile.com/wiki/Akzidenz%20Grotesk) ) which he believed to be <cite>An expression of our age</cite> which he writes about in his 1961 book, \"The Graphic Artist and His Design Problems\". Graphic Design history texts would consider Brockmann a modernist designer, similar to others of the time, such as [Paul Rand](http://web.archive.org/web/20131019144228/http:/typophile.com/wiki/Paul%20Rand), and other proponents of the grid like [Massimo Vignelli](http://web.archive.org/web/20131019144228/http:/typophile.com/wiki/Massimo%20Vignelli).\n\nToday Brockmann is most well known for his stunning work he did as a poster designer, specifcally for Opernhaus Zürich, and misc. other opera and orchestra events throughout Switzerland. Additionally, during his career he has lectured all over the world and designed exhibits in Zürich, Basel, Paris, New York, Barcelona, and Prague to name a few.\n\nBrockmann died in 1996 (the same year as other great graphic designers Saul Bass and Paul Rand) in Zürich.\n\nBooks Written by Brockmann:\n\nThe Graphic Artist and His Design Problems (1961)  \nThe History of Visual Communication (1971)  \nHistory Of The Poster, co-published with his wife Shizuko Müller-Brockmann (1971)  \nGrid Systems in Graphic Design (1981)\n\nOther texts:\n\nIn 2004 Imagenow (located in Dublin, Ireland) published a small book entitled \"Forty-Eight Posters\" to compliment a gallery of 48 of his most prolific posters.\n\n\"Josef Müller-Brockmann: Pioneer of Swiss Graphic Design\" by Lars Müller\n\n",
  "author": "rafael_lueder",
  "time": "5 Jul 2005 — 9:40pm",
  "uid": "5681",
  "comments": [

  ]
}
