{
  "id": "13474",
  "title": "A nice article about pricing design services",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.graphics.com/modules.php?name=Sections&op=viewarticle&artid=2...](http://web.archive.org/web/20071107163439/http:/www.graphics.com/modules.php?name=Sections&op=viewarticle&artid=243 \"http://www.graphics.com/modules.php?name=Sections&op=viewarticle&artid=243\")\n\nby Jeff Fisher\n\n [‹ Scala Sans for Artist Book?](http://web.archive.org/web/20071107163439/http:/www.typophile.com/node/13803 \"Go to previous forum topic\") [LiveType Project - Open Source Collaborative Type Design ›](http://web.archive.org/web/20071107163439/http:/www.typophile.com/node/13565 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071107163439/http://www.typophile.com/user/2203\" title=\"View user profile.\">Dan Weaver</a>",
  "time": "<br>",
  "uid": "2203",
  "comments": [
    {
      "time": " 6.Jul.2005 3.47pm",
      "content": "Wow! That is a great article, Dan - thank you for posting it!\n\n(I just got back from court, where I had to take a client who would not pay me for a website I had designed. He said he was not happy with my work, despite the fact he has been using the site for 9 months (unchanged), it was generating business and I had sign offs on artwork as well as a contract! Needless to say, the judge ruled in my favour. Never underestimate the importance of proper detailed pricing and a well written contract!)\n\n"
    },
    {
      "time": " 6.Jul.2005 4.11pm",
      "content": "Jeff Fisher’s book is excellent...only a few bucks and more than well worth it. I’m only a student, but I’m reading it a second time through already. Also, as I begin freelancing it is helping me create the contract and documents necessary to protect myself.\n\n"
    },
    {
      "time": " 6.Jul.2005 6.06pm",
      "content": "Gee, I think I’ll have a look at that book.\n\nJason, the absolute best $20 I have recently spent was on Business and Legal forms for Graphic Designers, by Tad Crawford and Eva Bruck. Not only are the forms laid out in the book, along with detailed explanations, but all of the forms are available on a handy cd rom, in 3 different formats, that you can alter to your heart’s content. It’s a definite must for any freelancer!\n\n"
    },
    {
      "time": " 6.Jul.2005 6.42pm",
      "content": "Thanks, andigirl. I’ll have to take a look at it!\n\n"
    },
    {
      "time": " 7.Jul.2005 10.36am",
      "content": "That book isn’t bad, but I think a better book is [Graphic Artists Guild Handbook : Pricing & Ethical Guidelines](http://web.archive.org/web/20071107163439/http:/www.amazon.com/exec/obidos/tg/detail/-/0932102115/qid=1120757665/sr=1-1/ref=sr_1_1/102-1869208-3701708?v=glance&s=books) which is now up to its 15th edition. Sample contracts, break-downs for reasons, many many useful links.\n\n"
    },
    {
      "time": " 7.Jul.2005 10.37am",
      "content": "andigirl: thanks for the books suggestion, I haven’t seen that one before.\n\n"
    },
    {
      "time": " 7.Jul.2005 1.38pm",
      "content": "The Guild Handbook sounds really good too - I’ll look it up. We have the rgd (registered graphic designers) association up here in Canada that also has a great handbook for us Canucks.\n\nAndrea\n\n"
    },
    {
      "time": " 7.Jul.2005 1.46pm",
      "content": "Nothing to do with typo or design business, but anybody know what book is best for learning Dreamweaver MX? I’ve really gotta get things going on my site!\n\n"
    },
    {
      "time": " 7.Jul.2005 7.00pm",
      "content": "You know, I just started using the app without a book and it was pretty intuitive. Of course I’ve used Adobe Go Live before and it was really easy. Why don’t you try the visual quick start guides? I find they’re really great for getting going.\n\n"
    },
    {
      "time": " 8.Jul.2005 3.27am",
      "content": "Jason its going to be a problem down the road with Dreamweaver being Adobe aquired Macromedia. Either GoLive or Dreamweaver will bite the dust or be changed dramaticaly. I wouldn’t invest a ton of time learning it (just do something simple with your site) until we find where the chips fall. Its just a thought.\n\n"
    },
    {
      "time": " 8.Jul.2005 6.23am",
      "content": "Thanks for the suggestions. I have started tinkering with it to the point where I was able to get some necessary information up and I probably will plan on keeping things simple. I’m not too big on flashy. Yea, and it wasn’t too difficult either.\n\nDan, how do you suppose the Adobe acquisition of Macromedia will affect Flash?\n\n"
    },
    {
      "time": " 8.Jul.2005 6.28am",
      "content": "Flash will ROCK.\n\n"
    },
    {
      "time": " 8.Jul.2005 10.51am",
      "content": "GoLive and SVG (thankfully) will get the boot.\n\nhhp\n\n"
    },
    {
      "time": " 8.Jul.2005 1.27pm",
      "content": "I tend to agree with you Hrant, but don’t put it past Adobe to try and squeeze every drop out of that GoLive stone. I went to a seminar about the Creative Suite 2 and the bells and whistles they added are in a practicle world almost useless for the amount of money they want for upgrades. Also I get a e-mail today offering me a special savings on training seminars. There must be a lot of pressure from the stock holders for them to show a huge profit.\n\n"
    },
    {
      "time": " 8.Jul.2005 1.31pm",
      "content": "Jason they bought Macromedia for Flash and Dreamweaver. My guess is they will sell off all the other products. Its the reason Live Motion was dropped (LiveMotion was billed as Adobe’s Flash killer).\n\n"
    },
    {
      "time": " 10.Jul.2005 2.11pm",
      "content": "Dan -\n\nThanks for posting the link to the excerpt from my book. It stunned me a bit when I first opened this thread and saw the reference to the link.\n\nAnother great source of articles about the design business, to which I am just one of many contributors, is [Creative Latitude](http://web.archive.org/web/20071107163439/http:/www.creativelatitude.com/)\n\nJeff Fisher :: Engineer of Creative Identity  \n [Jeff Fisher LogoMotives](http://web.archive.org/web/20071107163439/http:/tinyurl.com/5y8bm)\n\nAuthor: [Savvy Designer’s Guide to Success](http://web.archive.org/web/20071107163439/http:/tinyurl.com/5o7ud) from HOW Design Books\n\n"
    },
    {
      "time": " 10.Jul.2005 4.20pm",
      "content": "Jeff,\n\nThank you for the link to the Creative Latitude website. It has a tremendous amount of resources! Thanks also for your many contributions in general to the design industry. I love your book!\n\n"
    },
    {
      "time": " 10.Jul.2005 4.31pm",
      "content": "Jason -\n\nThanks so much!\n\n- J.\n\nJeff Fisher :: Engineer of Creative Identity  \n [Jeff Fisher LogoMotives](http://web.archive.org/web/20071107163439/http:/tinyurl.com/5y8bm)\n\nAuthor: [Savvy Designer’s Guide to Success](http://web.archive.org/web/20071107163439/http:/tinyurl.com/5o7ud) from HOW Design Books\n\n"
    },
    {
      "time": " 11.Jul.2005 4.22am",
      "content": "Jeff just keep writing and I’ll keep posting. The information is invaluable not only to the registered people at Typophile but the lurkers as well.\n\n"
    },
    {
      "time": " 13.Jul.2005 7.42am",
      "content": "Jason:\n\nBuy an HTML book. Learn HTML (and CSS). Once you know HTML, then the particular piece of software you use to write it becomes irrelevant.\n\n"
    },
    {
      "time": " 13.Jul.2005 12.21pm",
      "content": "aluminum,\n\nYea, I’ve been learning it little by little. Do you recommend any particularly good ones?\n\n"
    }
  ]
}
