{
  "id": "13490",
  "title": "Where to start with type design?",
  "forum": "Design",
  "tags": [

  ],
  "content": "As a graphic design student with an overwhelming interest in typography I am happy to be able to use the Typophile forums as an invaluable resource. In fact, I will even be attending TypeCon in a few weeks. However, as I venture towards my first actual typeface design project this summer I must say I feel quite unprepared. I am hoping that some of you can provide me with some resources. Whether it may be books, magazines, websites, interviews, articles, or anything else you feel maybe helpful, please post them here. Best of all, of course, would be plain, old advice.\n\nI would also like to thank all of you who post here. Typophile has provided me with an education I cannot receive in a classroom or on the job in the future. There is an abundance of information available here due to the comradery among designers and the collaboration that takes place.\n\n",
  "author": "<a href=\"/web/20110226084825/http://typophile.com/user/7350\" title=\"View user profile.\">Jason Alejandro</a>",
  "time": "<br>",
  "uid": "7350",
  "comments": [
    {
      "time": "",
      "content": "Bookwise, there's the triumvirate:  \n\"Letters of Credit\", W Tracy  \n\"Anatomy of a Letter\", A Lawson  \n\"The Elements of Typographic Style\", R Bringhurst\n\nSee also:  \n\"Fonts & Logos\", D Young  \n\"Learn FontLab Fast\", L Cabarga\n\nBut most of all: think, draw, think, erase; repeated eternally.\n\nAnd yeah, Typophile - priceless - should be in a Mastercard commercial.  \nHey, is that a [too-late] idea for the TC film-fest or what?!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hi Jason,\n\nI feel the same about the typophile education. About your question, it´s a good one.\n\nFirst of all, there are a lot of methods, almost one for every typedesigner.  \nIf we are all agree, form follow function in typedesign, specially in readable type.  \nAs Hrant says, you can stay drawing letterforms for hours.. but we read words more than  \nletters one by one.. To design a readable type you must have to think in macrotypography and then microtype (letter details) in my opinion... i mean the greytones in the page.  \nA type family its the way to create readable grey shades in the page, these are tones of different paragraph colors who can build an logical order in the way that you scan pieces of information, after and at the same time that you read.\n\nI this that this part of typedesign its very important, specially for graphic designers to know how to select the right font for the right layout and content in information design..\n\nActually, i looking forward to understand typedesign better in this way...\n\nmh.\n\n"
    },
    {
      "time": "",
      "content": "Jason,\n\nLook at everything. Notice everything about type wherever you see it. This becomes a curse, and a bane to the spouses of type nerds everywhere, but it is the trained eye that will guide you through the many, layered, interdependent processes that result in a typeface, well made for a real need.\n\nStart by dissecting: Blow up small type, reduce large type, notice what works and what doesn't. Why is Avant Garde a display typeface? What is a text typeface? Why do some typefaces look \"bigger?\" Get some good type and dissect it in a type drawing program. How about those asymmetrical serifs?... What are these little segments in all the narrow crotches?....\n\nThe only thing I'd add to Hrant's mantra is LOOK. Draw and re-draw. Your ability to perceive subtleties, combined with sure draftsmanship, will be bedrock for your future endeavors. Nothing is precious while you're learning. Throw away your first typeface. You'll be glad later.\n\nYou're on your way, if you keep your eyes (and mind) open. And you'll definitely jump-start the process to attend TypeCon. We'll see you there.\n\n"
    },
    {
      "time": "",
      "content": "check out:  \n [How-To](http://web.archive.org/web/20110226084825/http:/typophile.com/wiki/How-To)  \nand in particular [Drawing\\_How-To](http://web.archive.org/web/20110226084825/http:/typophile.com/wiki/Drawing_How-To)  \nfeel free to add any info you deem useful\n\n"
    },
    {
      "time": "",
      "content": "I imagine doing/researching calligraphy would be adventagous. Construction of basic roman, upper, lower, all with pen and ink. It seems quite a few Typophiles here are straight digital, but I recommend at least starting analog... actually, a few quotes ...\n\nFrom the introduction of Frederic W. Goudy's The Alphabet and Elements of Lettering ...\n\n\" Good lettering must be founded on good models; for the use of beginners they ought especially to be simple, dignified forms that are free from archaisms and mannerisms of the scribes and that exhibit in a high degree the essentials of legibility, beauty and character\"\n\nthere's another one in their that says ( paraphrasing )\n\n\" one must master the basics before creating something new \"\n\nSo, given the lineage of type design, I'd say it's fairly safe to say, when first learning why wouldn't you want to do it the same way as the masters?\n\nStudying proportion of classic types, Garamond, Caslon, Goudy, Jenson and learning how to truly see. Making the translation from eye to hand is the key...And if you draw it out by hand, and you think you've got it, check it with some sample letters of the aforementioned fathers of type. Then do it again. And Again, And Again.It will give you much better understanding of the character of letters, their history ... thats all i've got for now.\n\n"
    },
    {
      "time": "",
      "content": "I think that's a double-edged sword. Your advice can also foster lethargy.\n\nAlso: analog doesn't have to be calligraphic. Draw the border between black and white, instead of drawing the black and letting the white merely fall into place.\n\nOh, and you're right Carl, sorry:  \nLook, think, draw, think, erase; repeat.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I'm not saying it has to be, but starting from the beginning is never discouraged when learning. It's all about context. We speak of beginnings.\n\nHow will it foster lethargy?\n\n"
    },
    {
      "time": "",
      "content": "1) When you're told how to do something you're less likely to innovate.  \n2) In type design most people will teach you to make the black, instead of making notan. This is bad.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "im nearly a total beginner. i made two or three not really useable typefaces until now, all which were based on a very rigid grid. right now im trying to figure out my first normal sans for display purposes.\n\n1. read books on both micro- and macrotypography.  \n2. look at fonts, closely, even at text size.  \n3. try to draw your first letters based on a rigid grid, if you feel confortable with it, be creative about letter shapes.  \n4. start with the \"easier\" letters (in my opinion: n, m, o, r, p, d, g, a, P, T, L), then try the \"harder\" ones (esp. S, s, R, G, g, Y, y).  \n5. then.. i dont know, im not any further right now :)\n\nat least thats what i have done, and i dont regret it. im not anything near \"real typeface design\", im just trying out and having fun. but trying to do this grotesk sans right now, im learning ALOT.\n\nand [have a look at this one](http://web.archive.org/web/20110226084825/http:/www.typeworkshop.com/index.php?id1=type-basics).\n\nagain: im a total beginner, too. thats just what i experienced in the last few months..\n\n"
    },
    {
      "time": "",
      "content": "I'm also a total beginner. I've made a few crappy fonts and have started making hopefully my first half-decent one. I'm not going to offer any technique advice since I'm still learning myself, but I do think there are a couple of books that you should check out.\n\n1) I HIGHLY recommend this book as it is one of the few modern type books that actually shows a little about technique: \"Logo, Font & Lettering Bible\" by Leslie Cabarga. A must have for any beginner I think.\n\n2) This one is a bit harder to track down, you might have to special order it (I did). Idea Magazine is a Japanese design magazine and last summer they did an entire issue about typography. It is No. 303 July 2004. The issue is \"Type Design Today.\" Its a great resource, it is more of a book than a magazine. Jean-François Porchez, Akira Kobayashi, Matthew Carter, André Baldinger, Fred Smeijers, the LettError guys and a few others all have features in this issue...great stuff.\n\n3) Trust your own judgement, if it feels right it probably is.\n\n4) Lastly, I just say look at the type designers and type designs you like the most.\n\n"
    },
    {
      "time": "",
      "content": "TBTD as well (total beginner type designer).\n\nI found Jonathan Hoefler's type design 101 in the Resource section extremely helpful to get me started. (Resource section seems to be down right now - but check it out when it's working again). I also found Letters of Credit really really helpful.\n\nI also purchased TypeTool (very basic application and very cheap to start off), and that really motivated me to get going! (I also draw and erase a lot!)\n\n"
    },
    {
      "time": "",
      "content": "I am also starting (the first characters from my new font are almost ready). So here's my two cents:\n\nRead the Microsoft typography specifications. There's some good piece of advice on the technical side of constructing fonts. I think you must read on the expressive and technical aspects of design.\n\nI found a PDF file a couple of months ago which proved to be VERY helpful. The name: Fontographer: Type by Design. The author: Stephen Moye. If you find the book and buy it, it will make you and the author happy, even if you don't use Fontographer. I found the link to it in this forum.\n\nIn my experience: make the first characters by hand. Doodle a lot until you get the look & feel for your font. Then turn on your computer. Of course you can start right down on your favourite vector editor, but I think you'll end up with a livelier font if you start with handwork.\n\n"
    },
    {
      "time": "",
      "content": "by the way, i got recommended the book \"Thinking with type\" (also see [www.thinkingwithtype.com](http://web.archive.org/web/20110226084825/http:/www.thinkingwithtype.com/)) and it got delivered yesterday, havent had much time to check it out, but it looks good.\n\n"
    },
    {
      "time": "",
      "content": "I just had a look at Micheal Harvey's Creative Lettering Today on Amazon and it looks like a great start out book. Anyone have it?\n\n"
    },
    {
      "time": "",
      "content": "yes.I like the book.\n\n"
    },
    {
      "time": "",
      "content": "You can check the LiveType Project Links page:  \n [http://livetype.sourceforge.net/links.htm#education](http://web.archive.org/web/20110226084825/http:/livetype.sourceforge.net/links.htm#education)\n\nStill not finished. Wonder if it'll ever be?  \nBut I promise this - in there willl be links to what I think are the most rewarding resources on the web to learn type design.\n\nYou shoul also keep an eye on the [Documents](http://web.archive.org/web/20110226084825/http:/livetype.sourceforge.net/documents.htm) section - how to build a typeface from scratch - \"amateur style\" (still to be done - if you want to help...)\n\nCheers,  \nPedro\n\n——  \n [LiveType Project](http://web.archive.org/web/20110226084825/http:/livetype.sourceforge.net/)\n\n"
    },
    {
      "time": "",
      "content": "As far as digitizing is concerned, and if you are using FontLab, Leslie Cabarga's [<cite>Learn FontLab Fast</cite>](http://web.archive.org/web/20110226084825/http:/www.amazon.com/exec/obidos/tg/sim-explorer/explore-items/-/0965762858/0/101/1/none/purchase/ref%3Dpd%5Fsxp%5Fr0/104-9591422-6619911) is very helpful.\n\n"
    },
    {
      "time": "",
      "content": "Just on the topic of buying books, I just found Walter Tracy's 'Letters of Credit' for seven bucks on abe.com. Great place to get used books.\n\n"
    },
    {
      "time": "",
      "content": "I've bought most of these books and hopefully I should have some drawings for some of you to critique at Typecon, as well as the forum here.\n\n"
    }
  ]
}
