{
  "id": "13500",
  "title": "Resolution at TypeCon to better NYC transport signage",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "In [this thread](http://web.archive.org/web/20110812200615/http:/typophile.com/node/13473#comment-78104) Terry Biddle said he can't get the New York MTA to listen to him about the need for better way finding. Dan Weaver chimed in confirming they are awful. I observed lousy new signs in a visit.\n\nSince Mayor Bloomberg has declared 'Type Week' why don't we get a resolution or petition going at TypeCon to have the MTA invest in a project for the superb, coherent signage that NYC deserves?\n\nDan Weaver, or others, do you know the current history of this?\n\nSince Bloomberg has already declared the 'Type Week' we might be able to get press on it, and make something happen.\n\n",
  "author": "<a href=\"/web/20110812200615/http://typophile.com/user/1551\" title=\"View user profile.\">William Berkson</a>",
  "time": "<br>",
  "uid": "1551",
  "comments": [
    {
      "time": "",
      "content": "As a resident of NJ I am in the city about 3 times a month and I couldn't agree with you more.\n\n"
    },
    {
      "time": "",
      "content": "Thanks, William. For my Thesis project I spent a year rethinking the wayfinding system in the New York City Subway and made a custom face (please be kind as it was my first attempt at creating typeface). Accompanying my project I wrote a 100+ page standards and process book and made 3 signage replicas. 2 of which were actual size.\n\nYou can check them out here: [www.aigadesignjobs.org/terrybiddle](http://web.archive.org/web/20110812200615/http:/www.aigadesignjobs.org/terrybiddle \"www.aigadesignjobs.org/terrybiddle\")\n\nThere is one more Station Identification sign that isn't fully visible here, and the minute someone tells me how to post a jpg on this site, I'll post it. I'm HTML challenged. :)\n\n"
    },
    {
      "time": "",
      "content": "I'm also currently in the process of redrawing my typeface (as I've learned quite a bit since my initial go 'round). I hope to have the Roman weight completed by TypeCon.\n\n"
    },
    {
      "time": "",
      "content": "Terry what I would do with your signage is make the symbols for the trains different for each line. A star shape for the F train a circle for the 6 etc. This way a visitor from anywhere could navagate using symbols and not words.\n\n"
    },
    {
      "time": "",
      "content": "William the MTA subway posters are all in Helvetica. They look dated and boring and I doubt they are even read. One problem with signage with the MTA is (at least with posters) is often they have to set the message in multiple languages. That might be a big task for one type face or type family.\n\nAnd remember the new rule: You can't have an open container of anything (coffee, tea, etc.) or you will get a ticket. It doesn't matter that the air conditioning doesn't work just don't drink that soda.\n\n"
    },
    {
      "time": "",
      "content": "Terry, I started using MTA regularly about 3 months ago, and I have to admit I've never had any trouble navigating the subways, but seeing which station we're pulling up to while in the train has always driven me nuts, because of the total lack of consistency. However, I only use the same two lines two days a week, so my opinion isn't the most comprehensive/experienced around.\n\nHowever, standardizing and improving a signage system is never a bad thing. I'll sign.\n\nOff topic: How was Pratt? I'm looking at grad schools in the NE and I'd be very interested in your experiences there. If you'd like to share, drop me a line at c\\_rugen at hotmail.\n\n"
    },
    {
      "time": "",
      "content": "I gather that the MTA signage (post-Vignelli) is a grab-bag of Helvetica and Akzidenz Grotesk, along with an occasional other face. I think there's a past discussion of this somewhere on Typophile that has a more complete list, but I'm not sure exactly where.\n\nRelated, a [Creative Pro article on subway signage](http://web.archive.org/web/20110812200615/http:/www.creativepro.com/story/feature/12396.html).\n\n"
    },
    {
      "time": "",
      "content": "So Dan you're saying that an F isn't a different enough symbol than say a 6. So that the solution is to put another layer of iinformation on the train id system. F+star and 6+circle. 26 letters and 10 figures aren't enough variation already? What are unique symbols you propose for the: A, B, C, D, E, F, G, J, L, M, N, R, S, Z, 1, 2, 3, 4, 5, 6, 7 trains. They are already organized by color as well. Have you really thought about this?\n\n"
    },
    {
      "time": "",
      "content": "The \"total lack of consistency\" is partially due to the fact that the NYC subway system began life as three separate private rail lines. IRT (Interborough Rapid Transit) IND (Independent Subway Lines) and BMT (Brookly and Manhattan Transit). The different lines are built on different guage track, so all trains cannot run on all lines. Long time residents still refer to the different lines by those designations, and while I believe there is certainly room for improvement in the signage and wayfinding of the system, I would hate for it to lose some of its \"less than consistent\" identity.\n\n"
    },
    {
      "time": "",
      "content": "Dan, while your at those symbols, I forgot to menton the V, W, and Q trains.\n\n"
    },
    {
      "time": "",
      "content": "My feeling about the NYC transport signs is in agreement with both John Berry's review in Chris's link, and James Montalbano's comments, above.\n\nI agree with Berry that the main problem is not the way finding of the map and guide signs, but the internal station signs. But the look of the way-finding (Helvetica and Akzidenz Grotesk) is tired, and could benefit from a general update.\n\nWhat upset me was to see newly installed internal station signs that are obviously by somebody who knows nothing about letters, and are awkward and ugly.\n\nAs to consistency, I agree with James that this is not so important as concerns the internal signs. What is important is that they are easy to see and look good, which is not always the case now. Many are in digraceful disrepair also. There could be different styles on different lines, for example.\n\nOne suggestion I have is that NYC could commission different foundries to do the internal station signs for different lines, with consistent guidelines as to size and location. There is a lot of talent out there, and this could come up with varied, good looks.\n\nI lived in London for five years, and to me perhaps no typeface is so much a part of a city as Johnston's Underground sans, used throughout the London Underground. Its plain but personal letters are like an old friend when you travel the 'Tube.' (I write as the horror of terror attacks in the Underground is reported. Heartbreaking.)\n\nJust because of the disrepair of many of the station signs, there is plenty of reason to rethink the signage for the whole system.\n\nThe other big thing is the New York bus system. London seems to have redone the guide signs at the bus stops, and it is really first rate. In New York, there seems to be nothing on the bus stops, so that only locals can use them, and then have to work to figure out the system. The busses really do need a new way finding system.\n\n"
    },
    {
      "time": "",
      "content": "\"What are unique symbols you propose for the: A, B, C, D, E, F, G, J, L, M, N, R, S, Z, 1, 2, 3, 4, 5, 6, 7 trains. They are already organized by color as well. Have you really thought about this?\"\n\nThanks, James. I couldn't have said it better myself. :) James brings up some very good points and it is something that I had to come to grips with when I was trying to redesign the system. Familiarity is something that shouldn't necessarily be broken when restructuring a system. I went completely out-there when I first started working on this project, but towards the end I realized what did work and kept many of the strong ideas Vignelli originated. Here's what I found didn't work:\n\n1) The phrasing on the signs is not consistent nor is it always clearly articulated  \n2) The signs themselves lack crucial information needed to make split second decisions when arriving at platforms  \n3) The background color creates an undesirable mood in an underground environment  \n4) The typography is too large for the sign positioning and the rider's actual proximity to the words displayed  \n5) Chris brought up a good point in that the Station Identification signs are completely inconsistent, they also are not clearly marked or positioned properly to the height of the windows in subway cars.  \n6) Same number or line designations (A, 7, 6) that follow DIFFERENT train paths\n\nWhile I have made an attempt to correct those issues as I saw them, I'm not going to say that I made the end all be all solution to these problems. BTW, if someone can tell me how to post jpgs here, I'd be more than happy to show my solution to the Station Identification problem.\n\nYes, the subway uses Akzidenz-Grotesk (originally) and Helvetica. Vignelli originally chose Akzidenz-Grotesk and chose the type to be shown in negative rather than positive contrast. There are still remnants of some of these signs in various stations around the city. For whatever reason the MTA switched later to Helvetica and made the signs black with white type. I do think that the decision to go with positive rather than negative contrast was a change for the better.\n\n"
    },
    {
      "time": "",
      "content": "Additionally, there are some inconsistencies in typography within the system. While there's the obvious tile displays (which I don't think should be changed). I have seen Helvetica Condensed, Akzidenz and even Copperplate Gothic printed in the subways. Also, because many (if not all) of the signs were produced using photo-lettering techniques some of the signs have a slightly more condensed Helvetica as well. There need to be clear standards that are adhered to.\n\n"
    },
    {
      "time": "",
      "content": "William, Johnston is a great point. I visited London earlier this year to check out their subway system first hand. In the manual I wrote I referred to both London and Paris. Paris in fact is doing pretty much exaclty what you mentioned, getting designers involved in reworking their system. As I'm sure you all know Jean François is heavily involved with the RATP.\n\n"
    },
    {
      "time": "",
      "content": "\\>) The background color creates an undesirable mood in an underground environment\n\nInteresting. What is the background color? When I think about it the best name I get for the color of the subway is the Yiddish \"schmutz\".\n\n"
    },
    {
      "time": "",
      "content": "The background color is just black (I was talking about the sign backgrounds). Though the walls are pretty boring. :)\n\n"
    },
    {
      "time": "",
      "content": "\\>I believe there is certainly room for improvement in the signage and wayfinding of the system\n\nJames, do you think my idea of some kind of a resolution at Typecon to Bloomberg's attention is a good idea or not?\n\nBeing both the current Chairman of the Type Director's Club, co-sponsor of Typecon, and the developer of Clearview, your views on this have a lot of weight with me and I'm sure will with others.\n\n"
    },
    {
      "time": "",
      "content": "I think that anything that is not about large stadiums being built or international sporting events being held are unlikely to hold much attention from our dear mayor.\n\nI don't have much faith in the success of formal resolutions. In matters of this sort, money talks and everything else walks.\n\nThe MTA has such enormous shortfalls of cash that I can't see them being in a position to do much about wayfinding, at least in the near future.\n\nAs to the \"Type Week\" proclamation. Carol Wahler of the TDC contacted tha Mayor's office told them of the conference and suggested they proclaim it Type Week. Since it doesn't cost the city anything the city agreed. If you start bothering them with resolutions and proclaimations regarding their lousy subway graphics, they may just declare Type Week over.\n\n"
    },
    {
      "time": "",
      "content": "I agree that money over at the MTA is tight, and after today's events in London, I suspect that it will get even tighter.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20110812200615/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "",
      "content": "\\>after today’s events in London, I suspect that it will get even tighter\n\n\\>If you start bothering them with resolutions and proclaimations regarding their lousy subway graphics, they may just declare Type Week over\n\nHmmm. It could be argued, not unreasonably, that good wayfinding and station identification is a part of security, so people can exit or go home efficiently in the event of an attack. So they might even be able to get Federal money for it.\n\nAlso, I don't think they can declare type week over. They've already gone and done it. But I won't push if nobody else is keen.\n\nMy thought is, if we don't speak up for beautiful and functional signs, who will?\n\n"
    },
    {
      "time": "",
      "content": "It's as knarly as a single language wayfinding problem can get, as far as I can think. Hardly anyplace has had mass transit for as long, or as continuously upgraded. A lot of the current wayfinding is set in stone, ya know...so changing shapes, changing fonts, and making new layers/boundaries of signage within the existing system, (i mean, it'd take 20 years right?), is, i.e. asking the mayor for a lot and might really be stretching the welcome. And I'm an NYC lifer-in-exile, so I don't need no stinkin' signage, and if His Honor starts taxing the local type types for the proposed resolutional insult, well, I'm out of his economic reach. : )\n\n"
    },
    {
      "time": "",
      "content": "How does something like this even begin to get off the ground?\n\n"
    },
    {
      "time": "",
      "content": "\"How does something like this even begin to get off the ground?\"\n\nThe question I've been asking myself for over a year. I also have to disagree David. The things you mentioned are not set in stone. Those changes have nothing to do with:  \n1) Sign placement  \n2) Navigational symbols  \n3) Legibility\n\nAll of which CAN be improved upon. Paris is undergoing these changes as we speak. London, Paris and New York's subway systems were all created within around 10 years of each other. Also, London's system is actually OLDER than New York's. If you have seen their transportation systems up close before, you would see there is no comparison as to who the winner is in regards to system upkeep. Additionally, if we want to discuss system complexity and wayfinding, Paris' system trumps New York's in regards to the number of daily subway riders annually. Add all these factors up and there is really no excuse for New York's system to be deteriorating the way it is.\n\nI also wanted to point something out to some non-New York residents. The mayor has absolutely NO control of the MTA. The MTA is operated by the Port Authority of New York, which is run by the state, not the city. The man ultimately in charge is Governor Pataki, not Mayor Bloomberg. This is part of the problem. Bloomberg made a play earlier in his term to gain control over the MTA. Unfortunately, the plan fell through. This is why some of you may have been hearing about fund distribution problems in regards to Homeland Security money. The money that is given to the city for transit security is allocated by the state, not the city government. Too many hands having to pass the buck ultimately loses a few.\n\n"
    },
    {
      "time": "",
      "content": "\\>as knarly as a single language wayfinding problem can get\n\nI don't think the whole thing has to be done all a once. Just commissioning Font Bureau, HFJ, and Terminal Design to re-do the dilappidated internal station identifying signs for the three lines would be great. :)\n\nAnd the bus signs are not in stone.\n\nI am hearing the New Yorkers and ex-New Yorkers say \"forget it\". I'm ready to, but NYC's transport look is just so pitiful compared to London's. I just don't see why it has to be so bad.\n\n\\>The mayor has absolutely NO control of the MTA.\n\nWell, then complaining to the Governor won't offend the Mayor, who named 'type week'. All the better.\n\n"
    },
    {
      "time": "",
      "content": "Here's some stats:\n\nSystem Completion  \nLondon: 1863  \nParis: 1900  \nNew York: 1904\n\nNumber of yearly subway riders (in millions):  \nLondon: 832  \nParis: 1,170  \nNew York: 1,132\n\nThis is according to stats published after 2003. So as you can see, I was off be about 30 years in regards to New York's system! London's is indeed the oldest. New York of the other two, is the youngest. In defense of New York I should add that it has far more stations to maintain than either of those cities AND it is the only one of these systems that stays open 24 hours. While it wins in convenience (most days) I think being open 24 hours is like shooting yourself in the foot maintenance wise.\n\nWhen was the last time anyone has been to a pristine 24 hour restaurant? I certainly have never been inclined to eat eggs off the floor at Waffle House. :)\n\n"
    },
    {
      "time": "",
      "content": "\\> I think that anything that is not about large stadiums being built  \n\\> or international sporting events being held are unlikely to hold  \n\\> much attention from our dear mayor.\n\nOr any other mayor. Or any other politician.  \nGet real, guys - let's start fights we can win.\n\nBTW, Moscow's system is not the oldest, but it dwarfs the others in terms of traffic. And it's easy to figure out. And it's about 20 cents a ride. And Chechen bombs are relatively small.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Terry,\n\nI'm not sure if you've been to this site or not -- [**Subway.com.ru**](http://web.archive.org/web/20110812200615/http:/subway.com.ru/), but it has a lot of field shots of NYC, Moscow and Montreal Subway stations, signage, etc.\n\nSome of the jpgs could be useful to superimpose suggested way finding treatments.\n\nIt also has a section of NYC Subway maps from 1925 through May 2005, the key one being [Massimo Vignelli's 1972 redesign](http://web.archive.org/web/20110812200615/http:/subway.com.ru/maps/1972.htm).\n\n-----------------------------------------  \nYes, I'm old, but I'm back in style!\n\n"
    },
    {
      "time": "",
      "content": "It terms of signage in Mahattan, if you ever tried to navigate the NYC Greenway (on bike or foot) without a guide you'd end up on the FDR and scramble to save your life. The city doesn't put a lot of effort into signage unless it will cost them money. An example is the 12' maximum height for trucks by the Battery Park underpass. No way could you miss that signage.\n\n"
    },
    {
      "time": "",
      "content": "Thanks Norbert, I actually already had those sites bookmarked on computer at home. I've also got photocopies and printouts of the Vignelli map and several others between 1948 and 1999.\n\n"
    },
    {
      "time": "",
      "content": "Just a note -- In Vignelli's book he says the reason the subway signs were changed from white with black lettering to black with white type was concern over grafitti.\n\n"
    },
    {
      "time": "",
      "content": "\"London’s is indeed the oldest.\" Sorry, but you don't know how to measure age. Boston started the first subway in the world (electri-city you know), and NY was very close behind, finishing its first line, the Canarsie, I think, before Boston. If you're measuring by who finished first, they are all incomplete :) .\n\n"
    },
    {
      "time": "",
      "content": "\\>Get real, guys - let’s start fights we can win.\n\nCynicism about the political process is now the most common excuse for inaction, but it is a poor one.\n\nOutside, the signage for the NYC subway has class, though the design is a bit stale. Inside, the subway just assults you with its noise, grime, smell, and the disrepair and frequent ugliness of its signage.\n\nI detect here something of the cynicism of the locals in the New Yorkers' resignation to the current state of affairs. Those of us who more recently have come to love the city, such as Terry--me as well--just don't see the current state of affairs as inevitable.\n\nDavid says that this would be a 20 year project. Well a journey of a thousand miles begins with a single step, as the Chinese say. It seems to me that Typecon and especially the TDC would be the perfect ones to establish a committee to try to make something happen, and get a movement going.\n\nIn the 60s the movement to save the old Penn Station failed, but that the effort sparked the historical preservation movement, which has succeeded in saving many worthwhile buildings around the country. I myself with a friend started a successful movement to block an ugly public statue from being installed locally, so I know citizen efforts can succeed.\n\nI know there is a kind of pride of New Yorkers in being tough enough to ignore the assault of the subway. But a perverse pride it is, given that other major world cities have done better.\n\nNew York is the capital of the graphic design community in the US, but the single most often seen example of graphic design in the city--the transport system--is pitiful in many respects. Is this really OK with the design community--private splendor and public squalor?\n\nI read with some bemusement the regular attacks on private 'capitalist' corporations here by designers whose work is in fact generally for private corporations. Well, here's a chance to make a positive difference in the public space.\n\n"
    },
    {
      "time": "",
      "content": "_Is this really OK with the design community—private splendor and public squalor?_\n\nWilliam, that attitude is--unfortunately--\"as American as apple pie.\"\n\n"
    },
    {
      "time": "",
      "content": "\"Sorry, but you don’t know how to measure age. Boston started the first subway in the world (electri-city you know)\"  \n1863 London, 1897 Boston, (Steam powered, the Smoke you know)  \nTim\n\n"
    },
    {
      "time": "",
      "content": "The problem with transit statistics is that they often just record \"rail records.\" This can be underground, cable, or elevated rail for example. Boston for example, has a combination of these, as does New York. Separating these elements which are components of a larger system doesn't seem to make sense to me when we are discussing \"mass transit\" or subway systems. The name of the Subway certainly doesn't change when I go over the Manhattan Bridge.\n\n"
    },
    {
      "time": "",
      "content": "_The name of the Subway certainly doesn’t change when I go over the Manhattan Bridge._\n\nIt _does_ change names in Chicago, depending on where you live along the line. At either end, where the train is aboveground, its the \"el\"; downtown, it's the subway.\n\n"
    },
    {
      "time": "",
      "content": "The idealist in me certainly agrees with you William. Change must begin somewhere, and it is indeed an uphill battle. James has PLENTY of experience in regards to this sort of matter and I'm sure what he states has a large degree of truth.\n\nStill, it is certainly a dream of mine to be involved in a mass transit wayfinding project and I would hope to someday help fix New York's problem. Given the many unreturned phone calls and even being \"stood-up\" for an appointment (with no call-back) it is becoming increasingly apparent that the MTA has a lot of people working for them that frankly, \"just don't give a sh\\*t\".\n\nWhile I respect native New Yorkers opinions, I have noticed many inner-city political issues becoming stagnant based on some natives' reluctancy for change. This city is supposed to be one of the most liberal, yet at times it seems stuck in the past and not wanting to move forward...the most common complaint I have heard is about \"convenience\". Plenty of New Yorkers don't want to be inconvenienced (main complaint of the 2012 Olympics). the economy is having hard times here and I don't see why the city and state government don't see 2 crucial elements that can drive more money and tourism in the city:  \n1) Rebuilding the WTC site  \n2) Rebuilding the Subway system  \nPeople would travel JUST to see these things. Its New York for crying out loud, let's innovate!\n\n"
    },
    {
      "time": "",
      "content": "\"It does change names in Chicago\"\n\nReeeeeeeeally? Is it colloquial or is it officially a name change? Like the Tube is always the Tube, and the Subway is always the Subway (in New York). Please elaborate Nick as I know nothing about Chicago's system.\n\n"
    },
    {
      "time": "",
      "content": "_Reeeeeeeeally? Is it colloquial or is it officially a name change?_\n\nActually, it's both, in a sense. Chicago's transit system began as disparate companies, which were later unified under what was to become the CTA. More info on the history of Chi-town mass transit [here](http://web.archive.org/web/20110812200615/http:/www.chicago-l.org/history/index.html), if you're interested.\n\n"
    },
    {
      "time": "",
      "content": "The long journey does begin with a single step. But it is the experience of the Clearview development team that the government isn't interested in anything that will cost them money. Also the \"this has been working fine all these years\" attitude is everywhere. Terry has an idea for a redesign of the NYC transit wayfining system, he should keep pursuing it. If he can get some money and conduct some research that somehow proves his redesign has a benefit (faster exiting under emergency situations, would be an appealing approach) then the govenment will have to begin to pay attention. It took 14 years from Don Meeker's original idea for Clearview till its adoption by FHWA. How long you been working on this Terry?\n\n"
    },
    {
      "time": "",
      "content": "So far, only 2 years. Actively pursuing it, I would say about 1.5 years. Seeing as I know how long you and Don worked on Clearview, I know I've got my work cut out for me. :) My original angle for the transit change was updating for the 2012 Olympics...as we now know has fallen through.\n\n"
    },
    {
      "time": "",
      "content": "I think the safety issue is the best way to get people's attention. \"This wayfinding system functions better than the current on under these circumstances, because...\" Concrete research that backs you up is a requirement. Have you been in touch with any human factors researchers to begin to design a study?\n\n"
    },
    {
      "time": "",
      "content": "Tbiddy, I think after the London attack money for signage will be the last priority. The calls for today is increased electronic survellance equipment and bomb detecting devices. I don't think they care where you get lost as long as you get there in one piece.  \nThat aside why don't you try bidding on a smaller transit project to get in the door. Once you meet people and they get to know you, then maybe your ideas will be heard.\n\n"
    },
    {
      "time": "",
      "content": "Just a couple of points on the politics of this.\n\n1. Any resolution does not have to be an insult to the powers that be, and in fact should definitely not be. How is a resolution to take improvement of the graphics of the transport system as a goal be an insult to anybody?\n\nI am reminded of a New York comedian characterizing New Yorkers. One innocently says to the other: 'Nice haircut.' Response: 'What the f\\*\\*\\* do you mean by that? Nothing's wrong with it you sarcastic b\\*\\*\\*\\*\\*\\*\\*.\"\n\n2. On the view that they won't do anything that costs money.  \nMany public officials are keen on beautification to leave a legacy of appreciation. The curren Mayor Daly in Chicago is one who is spending a lot on renovation parks--some think too much as an ego trip. And I just heard that New York itself is undertaking to beautify parks, with a lot of construction going on now.\n\nAnd specifically on the subways, Mayor Guilliani spent a lot to clean up the graffiti.\n\nIs it such a stretch to think that a politician would want a legacy of appreciation for beautifying and making more convenient the subways?\n\n"
    },
    {
      "time": "",
      "content": " **Boston**  \nDavid is right about Boston's T claims. The Green Line does claim to be the world's oldest subway. But it has always been indicatively American to claim superlatives (our [insert item here] is the [biggest/greatest/oldest/richest/etc] in the world). I feel like fall into American superlativeness all the time whenever I talk about anything\n\n"
    },
    {
      "time": "",
      "content": "Not that it matters, but the PATH trains, (Port Authority Trans Hudson) formally know as the Hudson Manhattan Tubes, are older than the NYC subway. I read somewhere that they are the oldest subway system, but really, who cares which one is older, they all run like they were built when they were built. The PATH signage is pretty lousy as well.\n\nOne of the unique things about the NYC subway is it has a two track system, with express trains running on separate tracks than the local trains. This was one of the most important factors in allowing the city to grow and have workers able to commute from far flung city locales in a timely fashion.\n\n"
    },
    {
      "time": "",
      "content": "As previously stated, the mayor of NYC has little control over the MTA. Guiliani cleaned up the graffitti, turned midtown into a suburban mall, as well as shipping all the homeless to points unknown. (they're back) Whatever money the MTA has spent restoring the system came about from the public rejection of the collapsing subway system. Less ridership, less revenue. The improvements all came about because of economic pressure from the city's business sector to have a fuctioning subway system, not becuase of aestheics. The fact that Gov. Pataki holds the purse string on the MTA is significant. Albany has not increased its allocation to the subway (most of the funds to support and improve suburban rail lines). To finance the subway improvements has meant the MTA has borrowed too much, and almost all of its budget for the forseeable future will go to paying off the debt. Not much left for anything else. You can already feel the decay of the subways beginning again.\n\n"
    },
    {
      "time": "",
      "content": "\\>You can already feel the decay of the subways beginning again.\n\nSo sad. Has there been public discussion of this, for example in the New York Times?\n\n"
    },
    {
      "time": "",
      "content": "\"Have you been in touch with any human factors researchers to begin to design a study?\"  \nNo actually, and that is an angle that I wanted to expand upon in my research. Any ideas on where to get started in those regards?\n\nDan R., do you have any information on the number of stations in the Munich system? How old is the system is the system itself? The Munich system sounds like a major undertaking and I'm curious how many millions of dollars were spent and where those dollars came from.\n\nParis' system I believe has signs in Helvetica, Frutiger (all caps) and Parisine. At least Paris is making a solid attempt at system revisions even though I agree with you Dan; at the rate they're going it will be time for another revision.\n\n\"You can already feel the decay of the subways beginning again.\"  \nYou can say tht again. The MTA as you stated previously is having some serious budget problems. I read an article in New York magazine comparing the current financial crisis to that of the great subway decay of the 1980's. God forbid.\n\n"
    },
    {
      "time": "",
      "content": "Right after the switching room fire that knocked out the A & C trains this winter, New York magazine ran an indepth article on the growing problems of the subway. The public discussion goes on everywhere. (Except at the NY Times)\n\n"
    }
  ]
}
