{
  "id": "13536",
  "title": "Irony Sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "It's been a while since I last touched this project.\n\nHere goes a revised and sort of working version of the font.\n\nNew poster's up.\n\n| Attachment | Size |\n| --- | --- |\n| [irony\\_7\\_7\\_05.gif](http://web.archive.org/web/20150124131504/http:/typophile.com/files/irony_7_7_05.gif) | 20.54 KB |\n| [irony\\_7\\_7\\_05\\_words.gif](http://web.archive.org/web/20150124131504/http:/typophile.com/files/irony_7_7_05_words.gif) | 7.75 KB |\n| [the\\_past.gif](http://web.archive.org/web/20150124131504/http:/typophile.com/files/the_past.gif) | 10.18 KB |\n| [irony\\_7\\_10\\_05.gif](http://web.archive.org/web/20150124131504/http:/typophile.com/files/irony_7_10_05.gif) | 25.36 KB |\n| [Ironia\\_sample.pdf](http://web.archive.org/web/20150124131504/http:/typophile.com/files/Ironia_sample.pdf) | 11.5 KB |\n| [rs\\_ironia\\_2007.pdf](http://web.archive.org/web/20150124131504/http:/typophile.com/files/rs_ironia_2007.pdf) | 31.34 KB |\n\n",
  "author": "rosaiani",
  "time": "6 Jul 2005 — 9:59pm",
  "uid": "4563",
  "comments": [
    {
      "time": "17 Jul 2005 — 11:41pm",
      "content": "Hey everyone,  \nCrits on this font will be more than welcome!  \nAppreciate it.  \nRodrigo\n\n"
    },
    {
      "time": "18 Jul 2005 — 10:35pm",
      "content": "Rodrigo,\n\nIt's a relaxed sans that kind of reminds me of Myriad and Ed Gothic. I like it a lot!\n\nThe lc c is one of my favorites. The only thing that bugs me are uc M an N. Maybe make spot where the diagonal stroke joins the vertical a little bit thinner? I'm talking as a graphic designer, since I haven't even finished my first font as a type designer.\n\nBest of luck with the project!\n\n"
    },
    {
      "time": "18 Jul 2005 — 11:15pm",
      "content": "Would you set some body of text in this & give us some additional headlines? I find it hard to evaluate with the examples the way they are. It seems like it's pretty solid though.\n\n"
    },
    {
      "time": "23 May 2007 — 3:05pm",
      "content": "Hi! I just updated this thread that has been dead for long! Check out the PDF sample on the original post. I'd love to hear comments on this, once more :D I updated a lot of stuff, made a lot of changes, so it might be nicer just to look at it as it was just starting.\n\nThank you so much  \nRodrigo\n\n"
    },
    {
      "time": "23 May 2007 — 6:20pm",
      "content": "Wow, what a difference it makes to see it set. I think your basic forms may be okay but to fine tune them up you will have decide on your spacing right now because unfortunately the font is not very well spaced yet. After you do that you may also realize that you can alter the lettershapes for better fit too. And then you space things again. And around & around. Hopefully not infinitely. Anyway, that is my suggestion.\n\nAlso, you might want to move the ear of the g up to make spacing easier.\n\n"
    },
    {
      "time": "23 May 2007 — 6:31pm",
      "content": "Thanks for the response Eben!  \nIt's the first time I try to letterspace it (No kerning at all at this point). It was done pretty much based on Avenirs metrics, just so I didn't start from scratch and not to be as awful as the time I tried doing it without any reference at all :D But we'll get there! Thank you very much for the answer and I'll keep on refining it.\n\nAbout the g, I have to restart on the double story g and the ear of the g will be up by then :D Let's see how it goes :D\n\nThanks again!  \nRodrigo\n\n"
    },
    {
      "time": "23 May 2007 — 6:35pm",
      "content": "Your welcome!\n\nI think the face is well named. It does feel snarky or ironic.\n\nI will look foreward to the PDF!\n\n"
    },
    {
      "time": "25 May 2007 — 6:34pm",
      "content": "Very nice! I like your font quite a lot.\n\nThe only suggestion I have matches that of antiphrasis: the joins of M, N, W, and w look too black. This could be fixed, for instance, on the top left of the M by shifting the vertical leg to the left.\n\nI think the irony's going over my head. ;) To me, the font seems just very clean and solid. A bit refined, maybe.\n\n"
    },
    {
      "time": "27 May 2007 — 4:57am",
      "content": "I like it too, some of your letters remind me Kai Bernau's _[Neutral](http://web.archive.org/web/20150124131504/http:/www.letterlabor.de/)_, it will be useful to make a light and bold version of it. I don't know why but my computer has some problems with the point of your lower case i… Anyway good job.\n\n"
    },
    {
      "time": "1 Jun 2007 — 6:01am",
      "content": "Hey guys, thanks for the encouraging comments,  \nwhile I don't really have new stuff to post yet, I'm working on the spacing, numerals and getting the rest of the characters, punctuation etc. roughed out.  \nI was studying how the numerals get to be cohesive with the letters. Where in the alphabet could I find parts, that would help build the numbers and make them more cohesive with the rest of the font. Any thoughts on that would be greatly appreciated!\n\nThanks a lot!  \nRodrigo Saiani\n\n"
    },
    {
      "time": "1 Jun 2007 — 6:04am",
      "content": "I need to include a new punctuation mark in my typeface:  \n [http://www.underware.nl/site2/index.php3?id1=underware&id2=custom-type&i...](http://web.archive.org/web/20150124131504/http:/www.underware.nl/site2/index.php3?id1=underware&id2=custom-type&id3=irony-mark&id4=&id5=&idpic=01 \"http://www.underware.nl/site2/index.php3?id1=underware&id2=custom-type&id3=irony-mark&id4=&id5=&idpic=01\")  \nCheers  \nRodrigo Saiani\n\n"
    },
    {
      "time": "2 Jun 2007 — 4:15pm",
      "content": "Hello! Here's a sample of a revised version of the font.  \n [http://typophile.com/files/rs\\_ironia\\_2007.pdf](http://web.archive.org/web/20150124131504/http:/typophile.com/files/rs_ironia_2007.pdf \"http://typophile.com/files/rs\\_ironia\\_2007.pdf\")\n\nRevision of all uppercase characters is needed, I think the curved characters like \"O\" are not optically adjusted to match straight topped characters.\n\nRespaced the whole thing using Briem's tips ( [http://briem.ismennt.is/](http://web.archive.org/web/20150124131504/http:/briem.ismennt.is/ \"http://briem.ismennt.is/\")) and then refining. It's getting better.\n\nCheers!  \nRodrigo\n\n"
    }
  ]
}
