{
  "id": "13568",
  "title": "MyFonts: In Your Face!",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "IN YOUR FACE -- THE MYFONTS NEWSLETTER -- JULY 2005\n\nTechnicolor version:  \n\\* [http://www.myfonts.com/newsletters/iyf/200506.html](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/newsletters/iyf/200506.html \"http://www.myfonts.com/newsletters/iyf/200506.html\")\n\nIn This Issue\n\n1. Where do fonts come from?  \n2. Our 10 new foundries  \n\\* Breaking the Norm  \n\\* Lanston Type Company  \n\\* Typo5  \n\\* Archive Type  \n\\* Omine Type  \n\\* Swansbury  \n\\* Jason J Brown  \n\\* Kenneth Woodruff  \n\\* Roy Cole  \n\\* Puckertype  \n3. More new fonts  \n4. NYC Type Week  \n5. Type designers speak  \n6. Regulars\n\n===============================================================================\n\n\"I found out about MyFonts - it changed my life. I really enjoy being a type designer only now. I have hundreds of ideas for new typefaces in my little black book.\"  \n- Gert Wiescher, 2005\n\n\"Mommy, where do fonts come from?\" - It's what every parent dreads. Over 97% of parents reported that they had been embarrassed by the question, and mumbled something like \"they come from computers\". Well, you already know that MyFonts is the easiest way to get hold of the latest fonts online. But where on earth do we get them from?\n\nTruth is, they are created by talented individuals around the world who get a kick out of making that one undefinable element for your designs. Whether they're from the masters and mistresses of pen and brush, from the stone-carver and the metal-carver, or from the mouse-masher and the pixel-popper, new designs for letters are imported into the FontLab program, tweaked and tested until they make a coherent new typeface, then saved out as fonts ready for market.\n\nAnd why do they bring them to MyFonts? First, MyFonts hands back 65% of the retail price you pay to the designers. This gives them an unprecedented incentive to come up with great new designs. Second, MyFonts lets type designers know day-to-day what's selling and what's not. This lets them know just what kind of fonts you want! Read what just four of our participating designers have to say below.\n\n===============================================================================\n\nLETTER FROM THE EDITOR\n\nA super summer for font lovers is in store, with New York City holding Type Week, TypeCon bringing font makers and font lovers together - and of course plenty of new fonts from MyFonts. We're delighted that we're able to continue introducing such a wide variety of font genres to MyFonts users from our existing foundries and the ten foundries new this issue. Feeling funky? Then check out the refreshing and youthful Breaking the Norm collection. Fine revivals of American classics? Then the Lanston collection is where we'd like to direct your attention. Want an antique 19th century look? Archive Type adds a ton of fonts for you. And yes, there's more from that most fontologically active continent, South America.  \nHappy font finding!  \n-- Laurence Penney, In Your Face Editor\n\n===============================================================================\n\nINTRODUCING OUR 10 NEW FOUNDRIES\n\nBREAKING THE NORM is a new American foundry. Until their debut here at MyFonts, the amazing collection of 500 BTN fonts, all brand spanking new, has only been available for specialist purposes. This is a fantastic collection of affordable fonts to add all kinds of flavors to your designs. Talented designers Stuart Sandler and Brian J. Bonislawsky worked with a team of seasoned font engineers to bring the project together. Our faves? We love the cheery comic-book sans-serifs Surfer Shop, Candy Round and Mandingo. Scrumptious scripts include Youngsook, Bleedblob, Holiday Springs, and Tropicali Script. And a series of picture fonts like Tribal Dividers and Lil' Tipsy rounds off the collection. Browse 102 colorful graphics to see them in action! And the prices? Just $12.99 each.  \nBTN fonts are 20% off for 4 weeks!\n\n\\* [http://www.myfonts.com/foundry/btn/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/btn/ \"http://www.myfonts.com/foundry/btn/\")\n\n\\* [http://www.myfonts.com/browse/foundry/btn/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/browse/foundry/btn/ \"http://www.myfonts.com/browse/foundry/btn/\")\n\nARCHIVE TYPE is a great collection of historic fonts compiled and digitized by Archive Type of Slovenia. The foundry specializes in old typefaces found in old prints, books and samples. The thirty fonts, with the imperfections from years of good service all perfectly preserved, bring all the script, sans-serif and poster styles from a 19th century print shop to the digital age! Our faves are Archive Grotesque Shaded, Archive Penman Script and Archive Lightface Extended. Character sets are just as found, so please check if you need more than basic English. Fonts $14.95 each, with permanent discounts of 10 fonts at discount of 30%, 30 fonts for 50% off.\n\n\\* [http://www.myfonts.com/foundry/archivetype/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/archivetype/ \"http://www.myfonts.com/foundry/archivetype/\")\n\n\\* [http://www.myfonts.com/browse/foundry/archivetype/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/browse/foundry/archivetype/ \"http://www.myfonts.com/browse/foundry/archivetype/\")\n\nKENNETH WOODRUFF is the foundry outlet of the San Francisco-based designer and animator of the same name. He designed Next Stop, a set of 6 fonts that mimics the appearance of text panels in buses, trams and other public transport, a super alternative to tired old LCD and bitmap fonts. Recommended use: animate messages on websites using a \"glow\" effect in Photoshop! Fonts $15 each.  \nThese fonts are 40% off for 4 weeks!\n\n\\* [http://www.myfonts.com/foundry/kennethwoodruff/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/kennethwoodruff/ \"http://www.myfonts.com/foundry/kennethwoodruff/\")\n\n\\* [http://www.myfonts.com/browse/foundry/kennethwoodruff/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/browse/foundry/kennethwoodruff/ \"http://www.myfonts.com/browse/foundry/kennethwoodruff/\")\n\nROY COLE is a British typographer (biography) who trained under Emil Ruder at the Allgemeine Gewerbeschule Basel in Switzerland in the 1960s. Now based in Wells, England, he recently completed his own Swiss-style sans, Lina. Slightly condensed, of tall x-height, open of counter, sensibly spaced, Lina has superb legibility. The capitals and figures are lower than the lower-case ascenders, letting in some air even when set tight. The roman font, Lina 30, was drawn originally by hand and later its character set extended and digitally redrawn with the aid of Fontographer. We think it's a fine alternative to the usual sans fonts you might choose when you have lots of text to fit in a small space: catalogs, recipes, packaging, map labels - and of course websites. It comes in 3 weights, each with italics. Each font $21.  \nRoy Cole fonts are 40% off for 4 weeks!\n\n\\* [http://www.myfonts.com/foundry/roycole/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/roycole/ \"http://www.myfonts.com/foundry/roycole/\")\n\n\\* [http://www.myfonts.com/browse/foundry/roycole/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/browse/foundry/roycole/ \"http://www.myfonts.com/browse/foundry/roycole/\")\n\nPUCKERTYPE is the own label of Christopher Risdon who lives in Brooklyn, New York. Satellite PT is a family of three geometric sanserif fonts with a feel of primitive electronic equipment, released along with two other families, SAV PT and Cheek PT.  \nPuckertype fonts are 50% off for 4 weeks!\n\n\\* [http://www.myfonts.com/foundry/puckertype/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/puckertype/ \"http://www.myfonts.com/foundry/puckertype/\")\n\n\\* [http://www.myfonts.com/browse/foundry/puckertype/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/browse/foundry/puckertype/ \"http://www.myfonts.com/browse/foundry/puckertype/\")\n\nLANSTON TYPE COMPANY is one of the most historic names in printing history, and their success marks the point where the USA took the technological lead in printing. In 1887 Tolbert Lanston received his first patent for a mechanical typesetting device. Later refinements led to the revolutionary Monotype casting machine and the emergence of the Lanston Monotype Company of Philadelphia as one of the most renowned type supply companies in the world. Development of the Lanston typeface library was directed by leading American type designer Frederic Goudy from 1920 and later Sol Hess. Read more at our page about Lanston.  \nIn 2004 Lanston was acquired by P22 type foundry of Buffalo, NY. The classic designs of Goudy and Hess, along with newer designs by such contemporary masters as Jim Rimmer, Dave Farey, and Gerald Giampa, have now been relaunched in definitive new versions. We think fans of classic text fonts will be delighted to see versions of Goudy's Deepdene, Goudy Thirty and LTC Garamont, while of the newer designs we are struck by the beauty of Giampa's LTC Jacobean Initials. Color each layer separately for perfect drop capitals at chapter beginnings. Fonts from $19.95.  \nLanston fonts are 25% off for 4 weeks!\n\n\\* [http://www.myfonts.com/foundry/lanston/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/lanston/ \"http://www.myfonts.com/foundry/lanston/\")\n\n\\* [http://www.myfonts.com/browse/foundry/lanston/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/browse/foundry/lanston/ \"http://www.myfonts.com/browse/foundry/lanston/\")\n\nTYPO5 fonts are our latest addition from Latin America. Award-winning designer German Olaya from Bogota, Colombia, has 6 families with us. His fonts aren't exactly grunge... post-apocalyptic seems a better word for them. Civility, even delicacy, is evident -- but only beneath layers of grime. When your daughter marries that Hell's Angel, design the wedding invitation with Chato Band. Liner notes for a thrash/harmonious band? Use Kab. Typo5's fonts have been used worldwide in magazines, music industry, snowboard designs, books, TV, and Hollywood movies. Fonts from $16.95.  \nTypo5 fonts are 15% off for 2 weeks!\n\n\\* [http://www.myfonts.com/foundry/typo5/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/typo5/ \"http://www.myfonts.com/foundry/typo5/\")\n\n\\* [http://www.myfonts.com/browse/foundry/typo5/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/browse/foundry/typo5/ \"http://www.myfonts.com/browse/foundry/typo5/\")\n\nOMINE TYPE is the foundry of Eduardo Omine (Sao Paulo, Brazil). He brings us three OpenType feature-rich families. Bunker unites stencil types with and without serifs, allowing for interesting stylistic combinations. Gotica Lumina is an excellent attempt to modernize blackletter - a font family with historical flair but easily readable by today's user. Maest is an unconventional blend between calligraphy and constructed type. Surprisingly legible, this 3-weight set would be great for film titles, we reckon.  \nOmine fonts are 40% off for 4 weeks!\n\n\\* [http://www.myfonts.com/foundry/ominetype/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/ominetype/ \"http://www.myfonts.com/foundry/ominetype/\")\n\n\\* [http://www.myfonts.com/browse/foundry/ominetype/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/browse/foundry/ominetype/ \"http://www.myfonts.com/browse/foundry/ominetype/\")\n\nSWANSBURY of Aberdeen, Maryland specilaizes in handwriting fonts designed by Nan Jay Barchowsky. Barchowsky Fluent Hand is a simple flowing style. By copying the strokes indicated in Barchowsky Dot, you can help your own handwriting to develop a more flowing style too. These are advanced fonts with contextual ligatures: watch them fly in OpenType-aware applications such as Adobe Creative Suite. Fonts $24 each.  \nSwansbury fonts are 30% off for 4 weeks!\n\n\\* [http://www.myfonts.com/foundry/swansbury/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/swansbury/ \"http://www.myfonts.com/foundry/swansbury/\")\n\n\\* [http://www.myfonts.com/browse/foundry/swansbury/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/browse/foundry/swansbury/ \"http://www.myfonts.com/browse/foundry/swansbury/\")\n\nJASON J BROWN of Toronto offers us Brownhand, a font as friendly as Comic Sans but with serifs. Use it when you need that naive look, but don't want to to look like everybody else. Price $29.  \nJason J Brown fonts 50% off for 4 weeks!\n\n\\* [http://www.myfonts.com/foundry/jasonjbrown/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/jasonjbrown/ \"http://www.myfonts.com/foundry/jasonjbrown/\")\n\n\\* [http://www.myfonts.com/browse/foundry/jasonjbrown/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/browse/foundry/jasonjbrown/ \"http://www.myfonts.com/browse/foundry/jasonjbrown/\")\n\n===============================================================================\n\nMORE FONTS FROM OUR CURRENT FOUNDRIES\n\nOf the hundreds of new fonts, those that particularly struck the MyFonts eye were:  \n\\* text families Esta from DSType, Relato from emtype, Vista Sans from Emigre  \n\\* the sans and serif OpenType superfamily Amor from Storm with small caps and old style figures  \n\\* OpenType feature-rich fonts Mecheria, Meposa, Amienne and babyish Boopee from Typodermic  \n\\* Milk Script and Mama Script from Sudtipos; Fleurie from Wiescher Design; Flirt from Canada Type  \n\\* blackletters Avebury and Cabazon from Parkinson  \n\\* display fonts Sailor, Nightlife, Jojo and Rush from Canada Type  \n\\* And finally, Kate Greenaway's Alphabet, also from Wiescher Design.\n\n===============================================================================\n\nNEW YORK CITY HOSTS TYPE WEEK\n\nNew York, with its advertising and magazine industries to the fore, has always been the most typographic of cities. And this summer Mayor Michael Bloomberg is celebrating the great contribution made by typography to the city, declaring July 18-24 to be Type Week.\n\nAnd during that week, finding out more about font conception, gestation and birth (returning to our lead story) has never been easier. The fun and inexpensive TypeCon2005 conference takes place at Parsons School of Design, New York, July 20-24. Learn from the pros how to make letters, listen to talks on typo-topics, then party with typographic designers and aficionados. Join in the week of typographic excitement! Price $235 (pro), $140 (student). Of course MyFonts will be there too. Official site: TypeCon2005\n\n\\* [http://www.myfonts.com/info/typecon-2005/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/info/typecon-2005/ \"http://www.myfonts.com/info/typecon-2005/\")\n\n\\* [http://www.typecon.com/](http://web.archive.org/web/20141127072338/http:/www.typecon.com/ \"http://www.typecon.com/\")\n\n\"You can do a good ad without good typography, but you can't do a great ad without good typography.\"  \n -- New York type designer Herb Lubalin (1918-1981)\n\n===============================================================================\n\nTYPE DESIGNERS SPEAK ABOUT MYFONTS\n\nWe recently asked some of our designers what they thought of MyFonts, what inspired them, what drove them to design more typefaces. Here is a selection of what they had to say...\n\nPatrick and Rebecca Alaccari of Canada Type:  \n\"MyFonts changed our perspective on many things, heightened our senses in a way. We're very observant of every design around us now. We are being creative on every level, and are very aware of the creativity of everything around us as well. It feels like a much more creative and bubblier form of existence. Who needs arguing over the remote when you can debate type aesthetics and design flexibilities instead?\"\n\n\\* [http://www.myfonts.com/person/alaccari/rebecca/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/person/alaccari/rebecca/ \"http://www.myfonts.com/person/alaccari/rebecca/\")\n\n\\* [http://www.myfonts.com/foundry/canadatype/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/canadatype/ \"http://www.myfonts.com/foundry/canadatype/\")\n\nNick Curtis of Nick's Fonts:  \n\"I couldn't be more pleased with MyFonts, both as a medium for offering my typefaces to the world and as a tool for helping me do it better. Nobody does it better, nor does anybody even do it as well.\"\n\n\\* [http://www.myfonts.com/person/curtis/nick/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/person/curtis/nick/ \"http://www.myfonts.com/person/curtis/nick/\")\n\n\\* [http://www.myfonts.com/foundry/nicksfonts/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/nicksfonts/ \"http://www.myfonts.com/foundry/nicksfonts/\")\n\nStuart Sandler of Breaking the Norm:  \n\"What is so impressive is that in the very short history of MyFonts, it's become a significant sales and distribution vehicle for typefaces and it's usually the first \"top of mind\" URL people head to, much the same way Google became the default search engine.\"\n\n\\* [http://www.myfonts.com/person/sandler/stuart/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/person/sandler/stuart/ \"http://www.myfonts.com/person/sandler/stuart/\")\n\n\\* [http://www.myfonts.com/foundry/btn/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/btn/ \"http://www.myfonts.com/foundry/btn/\")\n\nGert Wiescher of Wiescher Design:  \n\"I have started so many typefaces, I lost count. And I am sure some of them got lost. But there was no way for me to market those designs. The big type manufacturers did not want to have them all, too much hassle. Then I found out about MyFonts - it changed my life. I really enjoy being a type designer only now. I have hundreds of ideas for new typefaces in my little black book and I still have a mountain of unfinished fonts hiding on my hard disk so that I think I will not run out of work for the rest of my life. It is great fun.\"\n\n\\* [http://www.myfonts.com/person/wiescher/gert/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/person/wiescher/gert/ \"http://www.myfonts.com/person/wiescher/gert/\")\n\n\\* [http://www.myfonts.com/foundry/wiescherdesign/](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/foundry/wiescherdesign/ \"http://www.myfonts.com/foundry/wiescherdesign/\")\n\n===============================================================================\n\nREGULARS\n\nCheck our What's New and Special Offers pages for live updates of all the new fonts that go on sale, and the great promotions we run! The Starlets page is our chart of great new fonts.\n\n\\* [http://www.myfonts.com/WhatsNew](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/WhatsNew \"http://www.myfonts.com/WhatsNew\")\n\n\\* [http://www.myfonts.com/Promotion](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/Promotion \"http://www.myfonts.com/Promotion\")\n\n\\* [http://www.myfonts.com/starlets.html](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/starlets.html \"http://www.myfonts.com/starlets.html\")\n\nWe always like to hear of good and bad experiences you have at MyFonts. Just e-mail us at and we'll get back to you!\n\nIn Your Face is sent out every three months to MyFonts users. It announces every new foundry signing up with MyFonts, new fonts from current foundries, and introduces all the useful and fun new features on the site. To unsubscribe or manage your subscriptions, go here:\n\n\\* [http://www.myfonts.com/MailingList](http://web.archive.org/web/20141127072338/http:/www.myfonts.com/MailingList \"http://www.myfonts.com/MailingList\")\n\nThe font used for our In Your Face masthead is Walburn Tooled from ShinnType.  \nMyFonts.com, Inc.  \n245 First Street, 17th floor  \nCambridge MA 02142  \nUSA  \nCopyright (c) 2005 MyFonts.com, Inc.\n\n",
  "author": "Miss Tiffany",
  "time": "7 Jul 2005 — 10:10am",
  "uid": "108",
  "comments": [

  ]
}
