{
  "id": "13569",
  "title": "We can each have our own Blog?",
  "forum": "James Grieshaber's blog",
  "tags": [

  ],
  "content": "Crazy. OK, let’s try this out. Will people actually read this?\n\nGetting excited about [TypeCon](http://web.archive.org/wiki/TypeCon)? I’m getting my [Type Gallery](http://web.archive.org/web/20060504205155/http:/typophile.com/node/13288) samples ready. Anyone attending TypeCon is entitled to display their recient fonts in the [SOTA](http://web.archive.org/wiki/SOTA) Type Gallery for free.\n\nWow, what some people will do for a free [T-shirt.](http://web.archive.org/web/20060504205155/http:/typophile.com/node/13459)\n\n",
  "author": "<a href=\"user/633\" title=\"View user profile.\">James Grieshaber</a>",
  "time": "<br>",
  "uid": "633",
  "comments": [
    {
      "time": " 7 July, 2005 - 10:38am",
      "content": "Yeah, you and Dan should order a really really large size and pretend to be conjoined twins or something. But I guess the severe capillary discrepancy would ruin the effect.\n\nhhp\n\n"
    },
    {
      "time": " 7 July, 2005 - 12:05pm",
      "content": "Boooooo! Hrant, where is your Wiki spirit? How about some more [bouma](http://web.archive.org/wiki/bouma)-related entries?\n\nJames, I’m kind bummed that this blog thing hasn’t generated more interest. I was really excited about when the site relaunched. I though that the blogs would degenerate into weird coolness. One one side, Hrant could have a \\*real\\* soap box, from which to talk about legibility, [Gerrit Noordzij](http://web.archive.org/wiki/Gerrit%20Noordzij), politics, pixels, or whatever would be on his mind. On another side, others would go deep into their latest project or revival…\n\noh well…\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20060504205155/http:/www.typeoff.de/)\n\n"
    },
    {
      "time": " 7 July, 2005 - 12:06pm",
      "content": "Besides, James and I are writing about \\*totally\\* different topics.  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20060504205155/http:/www.typeoff.de/)\n\n"
    },
    {
      "time": " 7 July, 2005 - 12:31pm",
      "content": "Hrant - I guess you answered my first question.\n\nDan - Hmmm, interesting… maybe I can focus some new threds on more specific projects, rather than just rambelings. Do you know of a way to scan a listing of all the Blogs on Typophile. I can’t seem to find a way to the Blogs other than directlly through someones profile page.\n\nYes, everyone should Wiki early and often.\n\n"
    },
    {
      "time": " 7 July, 2005 - 12:34pm",
      "content": "I’m a bit frustrated by the apparent wiki bug. Many links lead to “access denied,” so one cannot see a lot of the older topics. Since there is not a real search yet either, I don’t think that one can really search the wiki, making it more difficult to fill holes!\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20060504205155/http:/www.typeoff.de/)\n\n"
    },
    {
      "time": " 7 July, 2005 - 12:35pm",
      "content": "[www.typophile.com/blog](http://web.archive.org/web/20060504205155/http:/www.typophile.com/blog)  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20060504205155/http:/www.typeoff.de/)\n\n"
    },
    {
      "time": " 7 July, 2005 - 1:36pm",
      "content": "Thanks. The powers-that-be (you know who you are) should put a link to the blogs in the navagation.\n\nOK, about the “access denied” thing, this is what I have figured out so far. It appears that the Wiki is making up incorrect addresses for some of the links, and the addresses are case sensitive. For example, when you click on the “Indicies” link, it uses this address - [http://typophile.com/wiki/indices](http://web.archive.org/web/20060504205155/http:/typophile.com/wiki/indices). But it should be this - [http://typophile.com/wiki/Indices](http://web.archive.org/web/20060504205155/http:/typophile.com/wiki/Indices). The difference is the cap “I” on “Indices” in the address.\n\nAnother example: This link to Blackletter - [http://typophile.com/wiki/Blackletter](http://web.archive.org/web/20060504205155/http:/typophile.com/wiki/Blackletter), should have a lower case “b”. So there doesen’t seem to be any rhyme or reason to the link names case.\n\nI have also found this kind of link - [http://typophile.com/wiki/sans%20serif](http://web.archive.org/web/20060504205155/http:/typophile.com/wiki/sans%20serif), which dosen’t work. the “%20” part of that address represents a “space”, so that is OK. But if I change the first “s” to a “S” then it works. Hmmm.\n\nI have also found this oddity. In a Wiki link to a string like ” Barnhart Brothers & Spindler”, it will truncate it to “Barnhart Brothers”, ignoring everthing after the “&”… sometimes… not all the time.\n\nI think I understand the -Title Link|Title Displayed- syntax, but I don’t think everyone gets this. Not everyone is going to type -American Type Founders|ATM-. And since there is not a real search yet, it is sometimes hard to tell if a Wiki link does not have an entry or if it is not linking properlly to an existing entry. I guess we just have to police this as best we can to try to avoid multiple entrys.\n\n"
    },
    {
      "time": " 7 July, 2005 - 5:04pm",
      "content": "What I really need to have is a dedicated domain for my ramblings: [www.hhpov.com](http://web.archive.org/web/20060504205155/http:/www.hhpov.com/)\n\nhhp\n\n"
    },
    {
      "time": " 7 July, 2005 - 6:54pm",
      "content": "Maybe I have more access, but if you go here — [http://typophile.com/blog/](http://web.archive.org/web/20060504205155/http:/typophile.com/blog/) — you can see everyone’s blogs.\n\n"
    },
    {
      "time": " 7 July, 2005 - 6:56pm",
      "content": "or here — [http://typophile.com/uppercaseblogs/](http://web.archive.org/web/20060504205155/http:/typophile.com/uppercaseblogs/)\n\n"
    }
  ]
}
