{
  "id": "13565",
  "title": "LiveType Project - Open Source Collaborative Type Design",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": " **LiveType Project**  \nOpen Source Collaborative Type Design  \n [http://livetype.sourceforge.net](http://web.archive.org/web/20141011132333/http:/livetype.sourceforge.net/)\n\nThe [LiveType Project](http://web.archive.org/web/20141011132333/http:/typophile.com/wiki/LiveType%20Project) focuses on the development of complete Fonts using **[Fontforge](http://web.archive.org/web/20141011132333/http:/typophile.com/wiki/Fontforge)**.  \nThis project aims that everyone involved can and will learn more about typography and type **developing in a collaborative method**. It will provide the fonts and the font files regularly to users, developers and anyone with an interest in type.\n\nWhat are you waiting for? **[Get involved!](http://web.archive.org/web/20141011132333/http:/livetype.sourceforge.net/getinvolved.htm)**\n\n",
  "author": "pedamado",
  "time": "7 Jul 2005 — 9:53am",
  "uid": "3937",
  "comments": [
    {
      "time": "7 Jul 2005 — 10:58am",
      "content": "Is the idea to help improve the FontForge production tool, or is the idea to create better quality free fonts?\n\nThere are probably a few professional type designers here who might be opposed to adding more free fonts (esp good quality ones) to the large number already available. And perhaps a few people who would see a free font development tool as a threat to the commercial font development tools available.\n\nCheers, Si\n\n"
    },
    {
      "time": "7 Jul 2005 — 11:58am",
      "content": "Why just Fontforge? Can't we use FontLab?\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20141011132333/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "7 Jul 2005 — 12:05pm",
      "content": "No offense to anyone, but I have yet to see a freeware program that has been anywhere remotely close in terms of quality to a commercial program.\n\n"
    },
    {
      "time": "7 Jul 2005 — 12:07pm",
      "content": "\"And perhaps a few people who would see a free font development tool as a threat to the commercial font development tools available.\"\n\nSimon, I don't think that will be a problem. :)\n\n"
    },
    {
      "time": "7 Jul 2005 — 12:23pm",
      "content": "This thread seems to have been a double post. Some more comments are [here](http://web.archive.org/web/20141011132333/http:/typophile.com/node/13563).\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20141011132333/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "7 Jul 2005 — 12:40pm",
      "content": "\\<\\>\n\nI would agree with you, Terry, that this is generally true, but I think [NOAH](http://web.archive.org/web/20141011132333/http:/typophile.com/wiki/NOAH) is an exception. While it was never intended as a design tool, it allows you to hack fonts on an Postscript level, which I have found useful from time to time when I had problems with a font I was working on. And [Manutius](http://web.archive.org/web/20141011132333/http:/typophile.com/wiki/Manutius) is a pretty capable program for the price (free).\n\n"
    },
    {
      "time": "7 Jul 2005 — 3:47pm",
      "content": "Si:\n\nIf, in the process we manage to help improve Fontforge with it's use... GREAT. The idea here is --\\> **Colaboration** to develop better tools for the good of the community. _This sounds kinda comunist..._ ;)\n\nAs for _a free font development tool as a threat to the commercial_ ones... well, if the people who develop commercial software were really interested in developing good reliable software that keeps up with evolution probably **we would already be working on Fontographer MX 2004** lol\n\n(also don't you find it strange that Macromedia controls the development of both major Font Editors?)\n\nFinally... Microsoft developed MSWord ages ago and even so **not all of us can write novels** ;)\n\n"
    },
    {
      "time": "7 Jul 2005 — 3:55pm",
      "content": "_(also don’t you find it strange that Macromedia controls the development of both major Font Editors?)_\n\nHuh? Macromedia doesn't control any Font Editors. They never controlled FontLab. They did have Fontographer, but after the Adobe merger was announced they licensed it to FontLab. So **FontLab, Inc.** has both major editors.\n\nLike I said in the other thread, I think you would be better off supporting FontLab. FontLab\\* **is** the little guy. I get kind of annoyed by the idea that people who take money = bad, while OpenSource is always somehow more heroic. There is no better font development tool than FontLab. And I think that it will be at least a decade before there could be any significant competition.\n\n\\*Besides, like I also said in your other thread, FontLab supports the best OpenSource technologies. So, really, your students would be getting the best of both worlds if they used FontLab.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20141011132333/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "7 Jul 2005 — 4:13pm",
      "content": "tbiddy:  \nYou are so right... [this is me struggling to get things done under Fedora Core 4 + Fontforge]\n\nNevertheless I believe (like Manuel Castells says) that there is a brighter future if we commit ourselves to colaborative open [source] development in order to faster and better improve ourselves.\n\nFollowing this idea I decided to try out an all-open-source-got-it -right-with-fedora-core-4-now aproach to see if it is possible to do it. With the goal only to learn more about type design and typography and share it with others I still find it possible to do. **Even though I'm a Linux newbie, up until now things have gone pretty well...** I know things (Linux Distros, Fontforge, etc...) seem pretty rough right now, but you'll see it comming in the next five years. As we read this, more and more people are building the foudations of this Open Source future.\n\nThe only thing I'm sorry about is not being able to help George Williams more developing fontforge to commercial quality. Right now I can only help promoting it by use. Maybe we'll have a post here someday arguing about wich are better, Open Source or Commercial softs. Maybe some day, who knows?.\n\n"
    },
    {
      "time": "7 Jul 2005 — 4:22pm",
      "content": "I hate to inject a little pessimism here, but unfortunately there is no greater incentive for change than the all mighty dollar (or Yen, or Euro, whichever your currency may be). While in an ideal world it would ring true that independent freeware could compete with commercial software, it seems highly unlikely to me.\n\nOn the other hand the idea behind Unix/Linux based systems and their ability for user improvements I'm sure has been a motivator for Apple to constantly improve their OSX systems while Microsoft in comparison seems a bit behind the times.\n\n"
    },
    {
      "time": "7 Jul 2005 — 4:25pm",
      "content": "Dan:\n\nSorry about the double post.\n\n<cite>And they are the cutting edge of font-making technology. I think that students would really get a service if they were exposed to those…</cite>\n\nI'm sorry if I didn't make myself clear. I think you are absolutely right. But the thing I'm trying to say is, students **should** be exposed to as many different technologies as possible in order for them to improve in the path they set their minds into. Why not the cutting edge? Of course they should!\n\nAnd... why not **ALSO try to learn some alternatives** (they will probably be a significant part of the future too). Probably before Fontlab you were a Fontographer user right? Why did you change? Keep your mind open to alternatives. This is the only thing I'm trying to say.\n\nCheers!\n\nP.S.: Almost forgot... my Faculty does not have the budget to acquire a Fontlab license right now... is this sad or what? ;)\n\n"
    },
    {
      "time": "7 Jul 2005 — 4:41pm",
      "content": "Ups... :(\n\n<cite>announced they licensed it to FontLab</cite>  \nUps... looks like I got a bit confused with the news sorry! Somehow I thought Fontlab would develop Fontographer FOR Macromedia then again in my mind, they would interfere with the development etc... Once again... sorry! Really don't know what happened.\n\nStill I don't like the idea that one company is doing it all... no matter who.\n\n<cite>So, really, your students would be getting the best of both worlds if they used FontLab. </cite>  \nOnce again I have to excuse myself. Don't know if I made it clear already, but **Fontlab really is the best.**\n\n<cite>I get kind of annoyed by the idea that people who take money = bad, while OpenSource is always somehow more heroic</cite>  \nMy speech is starting to have a strange feeling to it doesn't it? I really don't mean it that way. All my life I've been a MS user (also a huge MS defensor) but lately... I don't know. I really feel that online communities like sourceforge.net have something special to them. Maybe I'll never figure this strange facination out. Meanwhile I hope I can learn something out of it!\n\n"
    },
    {
      "time": "7 Jul 2005 — 5:16pm",
      "content": "\\> there is no greater incentive for change than the all mighty dollar\n\nUtter rubbish.\n\nhhp\n\n"
    },
    {
      "time": "8 Jul 2005 — 1:29am",
      "content": "In my opinion, free software like Fontforge definitely has a place alongside commercial software like Fontlab. In my case, I would never have got started on type design if the only tools available cost hundreds of dollars. Fontforge is probably not as good as Fontlab for a professional type designer, but it is good enough, I think, to provide an introduction to type design for students and amateurs. Most of the important aspects of type design are not dependant on the software tools used to create a typeface. It is quite possible to produce rubbish using the best tools, and to produce a good typeface with tools that are merely \"good enough\".\n\n"
    },
    {
      "time": "8 Jul 2005 — 4:48am",
      "content": "_Most of the important aspects of type design are not dependant on the software tools used to create a typeface. It is quite possible to produce rubbish using the best tools, and to produce a good typeface with tools that are merely “good enough”._\n\nI agree wholeheartedly with Glyn on this point. The best tool for the job is one that works for you and the way _you_ work, but the best tool in the world isn't going to save a bad design, and a good design won't be ruined by a humble tool.\n\nFor the folks working on the FontForge project, here are a few suggestions of things **not** to emulate in the programs which are currently available...\n\n**Fontographer** : work in whole em units only; develop a sensible interactive scaling tool (the Freehand model Fontographer uses is ridiculous, and FontLab's isn't much better); and, if you include an autokerning feature, make it a lot less promiscuous.\n\n**FontLab** : if you include a Font Audit function, get a grip on what a flat curve really is; develop more flexible drawing tools than the Primitives panel; allow the user to specify more default options for repetitive information; and, if you include an autokerning feature, make it a little less timid.\n\n"
    },
    {
      "time": "8 Jul 2005 — 9:02am",
      "content": "Pedro, don't waste yourself too much in here. Your enthusiasm will find sympathy among some of us, but I doubt it will convert anyone, least of all the old priests.\n\nI saw what you've done already — it's better than nothing. So, go on with your work, if you feel capable. I'll still be around to see the final results of your labour.\n\n"
    },
    {
      "time": "8 Jul 2005 — 11:32am",
      "content": " **Sergej:**  \nThanks! The only thing I really wish is to have people (students, professionals and amateurs alike) interested in developing thir (our) skills. If this project helps doing that...\n\n<cite>it’s better than nothing</cite>\n\nAnd at least I will finally feel that I gave something back ;)\n\nCheers!\n\n——  \n [LiveType Project](http://web.archive.org/web/20141011132333/http:/livetype.sourceforge.net/ \"LiveType Project - Get Involved\")\n\n"
    },
    {
      "time": "8 Jul 2005 — 12:01pm",
      "content": "Pedro, I like your enthusiasm. I hope you continue with your efforts because I think the world could use more people like you seem to be. My only concern would be, and I feel this is particularly true in the design field, is if you can't use the standard programs, you can't get a job. No matter how many times you've used InDesign for example, if you don't know Quark as well, you don't get hired. Sometimes the tools are more important than the talent. This I think is unfortunate. I would be willing to give Fontforge a try once things get a little less hectic for me.\n\nHrant, good or bad, having money (or the lack thereof) is a significant motivator. Also...here's an idea: instead of saying things like \"utter rubbish\" why not just say \"I disagree\". It comes off much less condescending that way. :)\n\n"
    },
    {
      "time": "8 Jul 2005 — 12:22pm",
      "content": "I disagree. “Utter rubbish” sounds much better.\n\n"
    },
    {
      "time": "8 Jul 2005 — 12:52pm",
      "content": "Sergej,\n\nHow does that old Iditarod saw go? Oh, yeah...\"If you're not the lead dog, the view is always the same.\"\n\n"
    },
    {
      "time": "8 Jul 2005 — 1:10pm",
      "content": "\"I disagree. “Utter rubbish” sounds much better.\"\n\nSigh...\n\n"
    },
    {
      "time": "8 Jul 2005 — 2:13pm",
      "content": "_Maybe we’ll have a post here someday arguing about wich are better, Open Source or Commercial softs. Maybe some day, who knows?._\n\nThat's like Windows vs. Mac. Why force yourself to use only one when you can use both? FontLab itself leverages open source software ( [Python](http://web.archive.org/web/20141011132333/http:/typophile.com/wiki/Python)) to extend its capabilities. That's part of what makes it so powerful.\n\nOpen source software does have a price: you need to participate in its debugging and development to get the most out of it. Well, so be it. It's good for you.\n\n[FontForge](http://web.archive.org/web/20141011132333/http:/typophile.com/wiki/FontForge) is the best software for doing anything with [Apple Advanced Typography](http://web.archive.org/web/20141011132333/http:/typophile.com/wiki/Apple%20Advanced%20Typography). I don't know how important [AAT](http://web.archive.org/web/20141011132333/http:/typophile.com/wiki/AAT) will be six months from now, but you're not hurting FontLab by using FontForge. You can still buy and use [FontLab](http://web.archive.org/web/20141011132333/http:/typophile.com/wiki/FontLab). Different jobs, different tools.\n\nPedro, I salute and applaud your efforts and hope to get involved eventually.\n\n"
    },
    {
      "time": "8 Jul 2005 — 4:23pm",
      "content": "I would like to see more opinions here on Pedro's idea of developing a typeface on open source lines. My gut feeling is that it will not work.\n\nOpen source projects prosper when they meet a common need. The Linux kernel filled a gap in the GNU system, and was rapidly adopted and developed. The whole thing appeared to grow magically. But it it was not magic, just people helping each other towards a common aim.\n\nIs there a common need for a particular typeface, such that many people would wish to contribute to its development? And how would they contribute?\n\n"
    },
    {
      "time": "8 Jul 2005 — 10:56pm",
      "content": "Terry, I can only assume you write what you mean. Look back carefully at exactly what I objected to. Previously you've been sloppy with interpreting what I've written; don't get angy at me for not doing to same to you! As for the words I use, they're intended to reflect the different levels and types of emotion I'm feeling. It's my duty to be clearly understood, and then others can decide what to feel/think/do in turn. I do not manipulate.\n\nAnyway, my point was:  \nAnybody who really believes in his heart that money makes the world go 'round can never make really good type (or really good software for making type).\n\nhhp\n\n"
    },
    {
      "time": "9 Jul 2005 — 1:45pm",
      "content": "Anyway Hrant, I think you misunderstood me. You reacted without really asking for clarification in what I meant. I'm only saying that money can cause huge problems, and can be a great benefit. If that weren't true, there'd be no G8 summit going on now. That's all I mean, nothing more.\n\nI like when people express themselves, I just think it can be tactful. Your comments come off very rude and condescending and I'm certainly not the only one who feels that way. Alas, it is my problem in thinking I can get you to change and be more respectful of others. So, I won't bug you again about it.\n\n\"Pedro, I salute and applaud your efforts and hope to get involved eventually.\"  \nDitto for me as well.\n\n"
    },
    {
      "time": "9 Jul 2005 — 3:16pm",
      "content": "Pedro,\n\nLiveType is a trademark of Apple used in context of fonts:  \n [http://www.apple.com/legal/trademark/appletmlist.html](http://web.archive.org/web/20141011132333/http:/www.apple.com/legal/trademark/appletmlist.html \"http://www.apple.com/legal/trademark/appletmlist.html\")  \nTherefore, you might want to come up with a different name for the project.\n\nOther than that, I think the project is interesting. I've tried using FontForge myself several times and in the end I have always given up and reverted to something else (FontLab, the Apple ftx tools, TTX) but I still am very impressed with George Williams' work. I've been using his little fondu utility (to convert between .dfont and .ttf) myself. Very useful.\n\nThe more different tools are available the better. I wish George decides at some point to integrate FontForge with Python -- the ability to tie together FontLab, FontForge and TTX in different steps of a workflow could be really interesting.\n\nI don't think the availability of free fonts or free tools can harm. It drives competition, makes the tools available to people who couldn't afford commercial software etc.\n\nMost end-user open-source products I know are emulating existing commercial software: OpenOffice wouldn't exist without Microsoft Word, Firefox wouldn't exist without Netscape Navigator, Internet Explorer and Opera. Plus, one needs to remember that open source software often isn't really \"free\": a lot of open source software is being developed as research projects at universities and institutes, often state-funded. So it's all tax payers who pay for the development rather than the individual users. I believe that both methods of funding have their advantages and need to co-exist.\n\nAs John Butler points out, we at Fontlab Ltd. have been using open source software in our software a lot, for example Python, FreeType and FontTools/TTX. I don't think that there necessarily has to be an either-or for FontLab and FontForge. Similarly, I'll gladly see free fonts to exist along with commercial fonts.\n\nRegards,  \nAdam\n\n"
    },
    {
      "time": "9 Jul 2005 — 3:21pm",
      "content": "\\> Almost forgot… my Faculty does not have the budget  \n\\> to acquire a Fontlab license right now… is this  \n\\> sad or what? ;)\n\nPlease remember that Fontlab Ltd. offers 50% up to even 80% discounts to academic users of our software. This applies not only to FontLab but also to TypeTool and Fontographer:  \n [http://www.fontlab.com/Font-utilities/Academic-Purchases/](http://web.archive.org/web/20141011132333/http:/www.fontlab.com/Font-utilities/Academic-Purchases/ \"http://www.fontlab.com/Font-utilities/Academic-Purchases/\")\n\nRegards,  \nAdam Twardoch  \nFontlab Ltd.\n\n"
    },
    {
      "time": "11 Jul 2005 — 1:00am",
      "content": "Terry wrote:  \n_No offense to anyone, but I have yet to see a freeware program that has been anywhere remotely close in terms of quality to a commercial program._\n\nHey, don't knock open source... This site (and countless others) are built with PHP, an open-source client-side scripting language that rivals ASP, .NET and ColdFusion. It's caught on widely because it's free and because there are lots of eager people wanting to see it succeed. It also works because it is produces quality results.\n\n(Of course, I'm speaking as someone who hasn't used FontForge... ;-)\n\n"
    },
    {
      "time": "11 Jul 2005 — 6:38am",
      "content": "Let me all try to cut the edge.  \nBriefly, I am learning these days Linux, and I have installed in my computer Linux Fedora Core. I want to say the topic of free software comeing from Sourceforgue is great idea. But I want to point out some problems I have faced in Linux developement and promoting.\n\n1- The graphics softwares are not friendly users! I know for an example that GIMP software has more features than Photoshop. But let's face it the enterface of Photoshop is well designed and make me safe my time.\n\n2- The problem of Linux people that they think the MAC, and Windows users can easily go to LINUX and use its softwares in 2 days.. or more, while it is wrong. I spent alot of my time trying to learn LINUX it is more secure and more stable system I agree, but it is very hard one. Same for most graphics softwares there, they need time to learn, they need resources.. and Who has time to learn a new software after spending our money in Fontlab? You guys should think more from marketing point of view rather than thinking from the view of some programmers want to show that they are better than microsoft. You challange in graphics is not against microsoft, nor against MAC. You are against names like Adobe and Macromedia who don't make their softwares for free. And if you really can make a better software for free you need more than being just a clever programmer.\n\n3- I didn't find till now any software designed for our PRINT industry.. most graphics of Linux are for screens even SVG programs. I didn't find a software that I can make my prepress on it. Nor a software like Adobe InDesign or Quark Xpress!\n\n4- When I look at the interface design, I found that it depend on Helvitica font, and others.. but there is no font designed for screens. There is no Trebuchet, nor Verdana. I understand you guys dislike Microsoft, but Helvitica looks really distorted in screen!\n\nThank you for your time, NOTE that I am just new linux user, but may be my nots make sense for you.\n\n"
    },
    {
      "time": "12 Jul 2005 — 5:48pm",
      "content": "Congratulations for your decision on trying out a Linux Distro.  \nAnd yet no one said it would be easy. **I've also been trying to adapt for several months to Linux OS** (I've only tried Ubuntu, Knoppix and Fedora). JUST DON'T GIVE UP so soon.\n\nYes. Linux is still far from being _user friendly..._  \nNevertheless it doesn't take you long to get used to well develop software like The Gimp. You have to keep an open mind to it. Hey, I remember the first time I used a Mac I got my floppy disk \"stuck\" inside the drive. It took me two days just to learn how to \\< command + e \\> it. As a windows user, I also bitched about how <cite>Mac people thought windows users could learn how to use MacOS in two days...<cite></cite></cite>\n\nSoftware takes time to learn. That's true. But, are you still using Quark 4.0? Or MacOS 8.6?\n\nWhat if you could learn the inside rules of your particular task and then adapt the methods used to accomplish it? This is what I'm saying. You CAN learn how to compose type, and then DO it different ways, like with Quark, InDesign, Pagemaker, MS Word, Windows MacOS,... Linux? The better you know how to compose (and the more practice you get) the easier it gets. And there's more - the more different methods you use, the easier it'll be to adapt to a new situation. Now just change the word \"method\" to \"software\" and the word \"situation\" to \"job\" or \"operating system\" and you'll see what I mean ;)\n\nI'm not saying \"give me a stick and some glue and I'll build you a steamboat!\" You have to have the proper tools to do good job, but you can also accomplish it with alternative tools. Nowadays you have to become more and more versatile. You never know what the future holds for you... (actually this is my mother's speech...)\n\nIf you're really into self improvement you'll keep learning tools on your spare time (like I'm trying to do) so you can eventually adapt easier. Whattheheck, I've already had to do a commercial 40 page booklet on MS Word!!! Who the hell wants to use word to do this??? I'd rather do it on Open Source Software like Scribus.  \nSpeaking of Scribus...\n\n<cite>I didn’t find till now any software designed for our PRINT industry...</cite>  \n [Scribus](http://web.archive.org/web/20141011132333/http:/www.scribus.org.uk/index.php) - It seems you didn't look enough...\n\n<cite>I didn’t find a software that I can make my prepress on it.</cite>  \nWell some seems to have found a way to do it with Scribus. [Check these news.](http://web.archive.org/web/20141011132333/http:/www.scribus.org.uk/modules.php?op=modload&name=News&file=article&sid=75&mode=thread&order=0&thold=0) Like this one there are plenty of cases (at least in the EUA). Just check their website.\n\nSo far I've kind of agreed to Linux is not easy or user friendly, the transition is hard, it takes time, and lots of patience, but if there's one thing I really don't agree with you is <cite>You challange in graphics is not against microsoft, nor against MAC. You are against names like Adobe and Macromedia who don’t make their softwares for free.</cite>\n\n**First** , I believe on hard earned money. And believe me, specially those guys at Adobe deserve it.  \n**Second** , I'm writing these words on a Windows PC.  \n**Third** , who the hell is complaining about software not being for free? Just trying to find decent alternatives, trying to learn more.  \n**Finally** if Adobe were to create an OS... UAU! Is someone at Adobe reading this? Hello? Adobe OS? How cool would it be? I would buy it for sure!\n\n<cite>I am just new linux user, but may be my nots make sense for you.</cite>  \nAlthough it may not seem to, but **I relate to what you're saying more than you can imagine**. Here, now is currently 1:40 AM. I still have to check my e-mail on Windows MS Outlook go to bed, get up at 8:30 AM, go to work no Macromedia and Adobe based MacOSX machine, and, if I'm lucky, tomorrow night I'll boot Fedora Core to start sketching the Uppercase Diacritics for LiveType Project... I think the main thing is not giving up! That's life...\n\nCheers, and cheer up! Maybe some day it'll be you giving advice not to give up on Open Source.\n\n———  \n [LiveType Project](http://web.archive.org/web/20141011132333/http:/livetype.sourceforge.net/)\n\n"
    },
    {
      "time": "12 Jul 2005 — 5:55pm",
      "content": "Right on Joe!\n\nTerry wrote:  \n<cite>No offense to anyone, but I have yet to see a freeware program that has been anywhere remotely close in terms of quality to a commercial program.</cite>\n\nJoe wrote:  \n<cite>Hey, don’t knock open source… This site (and countless others) are built with PHP, an open-source client-side scripting language that rivals ASP, .NET and ColdFusion.</cite>\n\nJust to give an example of this **people often forget that [Apache](http://web.archive.org/web/20141011132333/http:/www.apache.org/) is an Open Source project and yet is one of the most used webservers all over.**\n\nJoe wrote:  \n<cite>It’s caught on widely because it’s free and because there are lots of eager people wanting to see it succeed.</cite>\n\n———  \n [LiveType Project](http://web.archive.org/web/20141011132333/http:/livetype.sourceforge.net/)\n\n"
    },
    {
      "time": "12 Jul 2005 — 6:13pm",
      "content": "Adam:\n\nThanks for the Apple Trademark warning. Ever since I satrted the project at Sourceforge I've been wondering if I can get away with LiveType Project as a name... gess not!\n\nKnowing this is a collaborative project I wonder if I should open up a thread to **discuss suggestions about a new name**. After all I'll have to change it before the next site update or it'll just be dumb of me!\n\n<cite>I believe that both methods of funding have their advantages and need to co-exist.</cite>  \nI'm glad you feel this way too. With the recent European Union Software Patents law rejected earlier this week I feel bit more confident in the future ;)\n\n<cite>Please remember that Fontlab Ltd. offers 50% up to even 80% discounts to academic users of our software. This applies not only to FontLab but also to TypeTool and Fontographer</cite>  \nUnfortunatelly the budget decisions are not mine to make... but as these lines are read the Faculty Council is probably analising a software acquisition proposal that contemplates Fontlab licences. Nowadays we seem to be lacking everything! Maybe it's this year... Thanks for reminding me of the academic licenses though.\n\nCheers, and keep up the good work at Fontlab!  \nPedro\n\n——  \n [LiveType Project](http://web.archive.org/web/20141011132333/http:/livetype.sourceforge.net/)\n\n"
    },
    {
      "time": "13 Jul 2005 — 4:14am",
      "content": "\\> Congratulations for your decision on trying  \n\\> out a Linux Distro.\n\nSeriously speaking, I personally see no reason why I should use Linux. Mac OS X is a solid Unix-based system that includes a X11 graphic environment as well as a very good Mac OS X Cocoa graphic environment. With Microsoft Virtual PC, you can run Windows on it. On my Mac OS X, I can run Mac Classic, Mac OS X, Unix and Windows applications side-by-side. See the screenshot that shows Fontographer 4.1 for Mac OS 9, FontLab 4.6 for Mac OS X, FontLab Studio 5 for Windows and Font Forge on X11 running at the same time:  \n [http://www.twardoch.com/tmp/osxfonttools.png](http://web.archive.org/web/20141011132333/http:/www.twardoch.com/tmp/osxfonttools.png \"http://www.twardoch.com/tmp/osxfonttools.png\")\n\nRegards,  \nAdam\n\n"
    },
    {
      "time": "13 Jul 2005 — 6:56am",
      "content": "Yikes! :O\n\nThis is what I mean! Versatility!  \nYou sir, **you deserve my respect!**\n\nCheers,  \nPedro\n\n——  \n [LiveType Project](http://web.archive.org/web/20141011132333/http:/livetype.sourceforge.net/)\n\n"
    }
  ]
}
