{
  "id": "13578",
  "title": "Graphics tablets",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m looking into buying a graphics tablet to help with work for my graphic design degree. I don’t want be spending loads on it in case i don’t take to it. I was just wondered if anyone had any good opinions on wether they’r worth buying and any brands that are particularly good. I’d be using it with programs like quark xpress, adobe illustrator and photoshop.\n\nany comments would be a great help\n\nthanks alison\n\n [‹ I'm writing an article on font design for Computer Arts magazine](http://web.archive.org/web/20080204005135/http:/typophile.com/node/13792 \"Go to previous forum topic\") [Help on Philippines Typo ›](http://web.archive.org/web/20080204005135/http:/typophile.com/node/13778 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080204005135/http://typophile.com/user/5292\" title=\"View user profile.\">alison</a>",
  "time": "<br>",
  "uid": "5292",
  "comments": [
    {
      "time": " 7.Jul.2005 2.27pm",
      "content": "I would suggest a WACOM tablet. I’m really not sure of any other professional solution. They have multiple sizes and price points, so there should be something that would fit your need. Check out there site: [http://wacom.com/index2.cfm](http://web.archive.org/web/20080204005135/http:/wacom.com/index2.cfm \"http://wacom.com/index2.cfm\")\n\nHope that helps.\n\n"
    },
    {
      "time": " 7.Jul.2005 2.42pm",
      "content": "I’ve used a Wacom tablet for 14 years, and I honestly believed it’s saved me from repetitive stress syndrome.  \nThe 8” x 6” is big enough.  \nThe new fat styluses really suck, get the skinniest they have.\n\n"
    },
    {
      "time": " 7.Jul.2005 2.45pm",
      "content": "yes thankyou, iv seen a wacom one that i quite like and i’d read that they’r worth paying a little bit more for than some cheaper alternatives. the a6 size (active) doesn’t seem very big but as iv never used one before i wouldn’t know just how big you can work well with?\n\n"
    },
    {
      "time": " 8.Jul.2005 7.36am",
      "content": "I have a 9 x 12 at work and I have to restrict the area that is active because of the size. Here at home I have a 6 x 8. That seems to be just fine. If you can afford it definitely get the Intuos line. The pressure sensitivity is worth the extra money. I agree with Mr. Shinn. I originally got one because I was getting carpel tunnel syndrome from the mouse. The Wacom solved that…  \npeace\n\n"
    },
    {
      "time": " 12.Jul.2005 2.53pm",
      "content": "I’ve got a 6 x 8 Intuos from Wacom and I love it. And I actually prefer the new fat stylus to the older, thinner versions, but I guess that just comes down to personal preference.\n\nOne other thing, RSI-wise: the only problem I have with the size of the tablet is that it means mousing or tableting way over to the side of the keyboard, which is harmful in its own right. I ended up getting myself a special split keyboard that doesn’t have a 10-key area, so that the tablet could be more directly in front of me.\n\n"
    },
    {
      "time": " 12.Jul.2005 3.51pm",
      "content": "I’ll have to try a tablet again. I got a Wacom 12x12 back in the day, and it’s just difficult to handle.\n\n"
    },
    {
      "time": " 12.Jul.2005 6.20pm",
      "content": "Alison:\n\nMy advice is to buy an inexpensive small but very efficient tablet like Wacom Volito 2. This way you can try it out without spending to much money and figure out what are specifically your needs on a tablet. Later on you can buy a professional tablet. Maybe this works for you. It works for me (right now I need a scroll on my tablet pen lol)\n\nCheers,  \nPedro\n\n——  \n [LiveType Project](http://web.archive.org/web/20080204005135/http:/livetype.sourceforge.net/)\n\n"
    }
  ]
}
