{
  "id": "13574",
  "title": "Century Schoolbook | ITC Century | New Century Schoolbook",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Forgive me for taking advantage of your collective brainpower today. The dentist had to needle me 3 times to numb my face and so I've lost all focus.\n\nMatthew Carter designed [New Century Schoolbook](http://web.archive.org/web/20150310225843/http:/www.myfonts.com/fonts/linotype/new-century-schoolbook/). I have licenses for ITC Century (Adobe) and Century Schoolbook (Bitstream). Do either of my licenses compare?\n\n",
  "author": "Miss Tiffany",
  "time": "7 Jul 2005 — 12:34pm",
  "uid": "108",
  "comments": [
    {
      "time": "7 Jul 2005 — 1:50pm",
      "content": "is this question _that_ boring?\n\n"
    },
    {
      "time": "7 Jul 2005 — 1:55pm",
      "content": "Not to me. Just checked it out. ITC Century is different. Designed by Tony Stan, it has the trademarked large x-height. Bitstream Schoolbook and New Century Schoolbook look very similar. I can't tell you the differences. In \"Typographically Speaking\" Matthew Carter only credits himself for the Greek version of New Century Schoolbook.\n\n"
    },
    {
      "time": "7 Jul 2005 — 2:06pm",
      "content": "I thought Morris Fuller Benton designed New Century Schoolbook... Carter did some additional work on it after WW2...\n\n"
    },
    {
      "time": "7 Jul 2005 — 2:30pm",
      "content": "Thank you for clearing that up, both of you. I had forgotten is was only the Greek. I need to buy that book. Maybe at TypeCon.\n\n"
    },
    {
      "time": "7 Jul 2005 — 2:32pm",
      "content": "Linn Boyd Benton designed the metal 'Century'. His son Morris Fuller Benton designed a number of variations, including 'Century Schoolbook'. The father invented the pantographic punch cutter, but the son was the better type designer. Who worked on the digital versions is not clear on the web sites.\n\n"
    },
    {
      "time": "7 Jul 2005 — 2:34pm",
      "content": "This is all starting to sound like a Wiki entry for [New Century Schoolbook](http://web.archive.org/web/20150310225843/http:/typophile.com/wiki/New%20Century%20Schoolbook)\n\n"
    },
    {
      "time": "7 Jul 2005 — 2:38pm",
      "content": "Well, there is a cool T-Shirt contest going on for wiki entries…\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150310225843/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "7 Jul 2005 — 2:46pm",
      "content": "The big differences are the misssing serif on the lowercase h, m, n in the ITC.\n\nThe color of ITC Century is not good at smaller text sizes.  \nHowever, its Light weight is really cool at larger text sizes (eg 14 pt), especially the italic.\n\n"
    },
    {
      "time": "7 Jul 2005 — 4:45pm",
      "content": "FYI --  \nA quick summary of the Century Family before Matthew Carter\n\nTheodore Low DeVinne (1829--1914), printer of _The Century_ magazine, designed a stronger, bolder and more readable face for the magazine and commissioned Linn Boyd Benton (1844--1932) of ATF to cut it.\n\nL.B. Benton cut it on the newly invented Benton punch-cutting machine and in 1895 was christened Century Roman. Afterwards, a companion face was created for ATF by L.B. Benton: Century no. 2, later called Century Broad-face. This face became the basis for Century Expanded, designed by L.B.'s son, Morris Fuller Benton in 1902. Over the course of three more years, the italic, bold and bold italics were developed.\n\nThen after a few more years, Morris Fuller Benton developed Century Oldstyle.\n\n_\"While the essential appearance of Century Roman and Century Expanded derived from Bodoni and Didot, that of Century Oldstyle seems to have been based on Caslon.\"_ -- Paul Shaw\n\nIn 1915, redevelopment of Oldstyle face began and was renamed Century Book.\n\nSoon after, ATF was approached by Ginn & Co., the textbook publisher, with a request for a new typeface for schoolbooks. M.F. Benton began review of research done at Clark University on the relationship between the legibility of type and the eyesight of children.\n\nConsequently, Benton increased the space between letter, the x-height of each letter, and the weight of each stroke, and balanced the color of the type by opening up the counters. The result was Century Schoolbook, completed in 1919.\n\nIn 1964 ATF commissioned Charles E. Hughes to design a new proportion for Century Expanded... the result, Century Nova, which was more condensed.\n\nUnder license from ATF, Tony Stan designed the sixteen weight ITC Century family between 1975 and 1980 for International Typeface Corporation.\n\nThe greater part of this summary is from  \nTHE CENTURY FAMILY  \nan article by Paul Shaw for _Fine Print_ magazine\n\nYes, I'm old, but I'm back in style!\n\n"
    },
    {
      "time": "7 Jul 2005 — 4:55pm",
      "content": "How's your face?\n\n"
    },
    {
      "time": "7 Jul 2005 — 5:08pm",
      "content": "A little wrinkled but otherwise not bad.\n\n---------------------------------------  \nYes, I'm old, but I'm back in style!\n\n"
    },
    {
      "time": "8 Jul 2005 — 9:11am",
      "content": "Norbert and others. You really need to go to the wiki and add your information. If you don't I will.\n\n"
    },
    {
      "time": "8 Jul 2005 — 5:29pm",
      "content": "But Tif, that would be a Century of progress :-)\n\nChrisL\n\n"
    },
    {
      "time": "8 Jul 2005 — 11:26pm",
      "content": "rim shot !\n\n"
    },
    {
      "time": "9 Jul 2005 — 3:40am",
      "content": "New Century Schoolbook was designed 1979-81 in the New York Lettering office of Merganthaler Linotype based on Century Schoolbook, long after the Benton's had passed on. It was the second face, after New Baskerville, that was digitized and expanded using Ikarus (digital technology). The Bitstream version is a near exact copy, only being moved from a 54 unit to a 2000 or so unit design.\n\n"
    },
    {
      "time": "9 Jul 2005 — 9:25am",
      "content": "Thanks, David.\n\nWe should really compile this information into a new wiki on the Century Family. Do we have a volunteer? Not me, I have Wikiphobia.\n\n"
    },
    {
      "time": "9 Jul 2005 — 4:36pm",
      "content": "Don't forget crazy Phil's [Grad](http://web.archive.org/web/20150310225843/http:/ms-studio.com/FontSales/grad.html).\n\n"
    },
    {
      "time": "11 Jul 2005 — 4:23am",
      "content": "\"Wikiphobia?\" I've got Wikirejectme. So far I've only penetrated its defenses once, otherwise it tells me I don't have \"authorization.\" Meanwhile, the truth and accuracy goes on crookedly over there. . . ;)\n\n"
    },
    {
      "time": "11 Jul 2005 — 4:30am",
      "content": "Truth and accuracy take a step back when there's a cool T-shirt to be won. ;-)\n\nAgh, I'm just being mean. Isn't it the nature of the beast that Wiki entries start out a little dodgily and evolve into their definite form through several stages of additions and corrections by the various editors?\n\n"
    },
    {
      "time": "11 Jul 2005 — 8:39am",
      "content": "Please help David fix stuff.\n\nhhp\n\n"
    },
    {
      "time": "12 Jul 2005 — 4:51am",
      "content": "IT's running amok right now.\n\n"
    }
  ]
}
