{
  "id": "1359",
  "title": "Implicit logotype",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "implicit is a east coast based house dj, when speaking to him about how he saw his work, he expressed himself alot about being part constructor/scientist .. being very focussed about his precision and skill in his mixing   \ni wanted to convey his love of a) simplicity and the meeting between scientific (metaphoricly math/ simplicity in combination of forms) and music (flow/change)   \n   \n   \n ![implicit logo](http://web.archive.org/web/20150417053246im_/http:/www.typophile.com/forums/messages/29/1659.gif)\n\n",
  "author": "zander",
  "time": "15 Jul 2002 — 4:32am",
  "uid": "1183",
  "comments": [
    {
      "time": "15 Jul 2002 — 4:37am",
      "content": "thought i'd include the flow of variations before landing with the final one above   \n   \n ![implicit variations](http://web.archive.org/web/20150417053246im_/http:/www.typophile.com/forums/messages/29/1660.gif)\n\n"
    },
    {
      "time": "15 Jul 2002 — 8:49am",
      "content": "Experimental with good forms. I however think it is too cryptic and will not be understood by most   \npeople.\n\n"
    },
    {
      "time": "15 Jul 2002 — 9:17am",
      "content": "keep in mind the meaning of implicit (which is the reason for the missing stems of the i's   \n   \nim·plic·it\n\n"
    },
    {
      "time": "15 Jul 2002 — 4:56pm",
      "content": "Christian - distinctive and clever considering the name and the genre, house music. To me, it seems okay that the 'i' stems are not there because of the nature of the client and his work.   \n   \nMaybe it wouldn't work for a dot com or something, but it seems appropriate for the genre.   \n   \nalso enjoyable is seeing the process.   \nwhat did implicit say about the logo?   \n   \nbj\n\n"
    },
    {
      "time": "16 Jul 2002 — 4:39am",
      "content": "thanks for the nice words bj   \n   \ni got good reception from implicit.   \nunfortunately i couldn't work on the cd cover for which the logo was created, due to bad timing.   \n   \nbut all in all the process was very straighforward (rare case) with the ideas i had falling in good ground at the client.\n\n"
    }
  ]
}
