{
  "id": "13624",
  "title": "Best Serif Faces for the screen",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m curious if people have any favorite “screen-friendly” serif faces. I am thinking headline/subhead size, image/flash based (I’m not talking about “HTML” text fonts here).\n\nI ask because some clearly work better than others. for instance Bodoni with its extreme thins tends to break apart at anything other than large sizes. What are the serif faces that hold up better in digital media?\n\nI’ve been poking around this site (please get the search feature working soon!) looking for a topic about this, but didn’t see one. If it exists, please point me to it.\n\nThanks,\n\nJohn-Paul  \n [http://www.nsideas.com](http://web.archive.org/web/20081026081555/http:/www.nsideas.com/ \"http://www.nsideas.com\")  \n [http://www.mmodule.com](http://web.archive.org/web/20081026081555/http:/www.mmodule.com/ \"http://www.mmodule.com\")\n\n [‹ Typesetting chemical elements and equations](http://web.archive.org/web/20081026081555/http:/typophile.com/node/13848 \"Go to previous forum topic\") [lining numerals for Palatino LT ›](http://web.archive.org/web/20081026081555/http:/typophile.com/node/13786 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081026081555/http://typophile.com/user/8133\" title=\"View user profile.\">jwalton</a>",
  "time": "<br>",
  "uid": "8133",
  "comments": [
    {
      "time": " 8.Jul.2005 11.02am",
      "content": "Georgia is great, for smaller sizes. Yes, even anti-aliased.\n\nBut if you can wait for my Atanasia...\n\nhhp\n\n"
    },
    {
      "time": " 9.Jul.2005 3.32pm",
      "content": "I think [Fedra Serif A](http://web.archive.org/web/20081026081555/http:/www.typotheque.com/site/fonts.php?id=2) is ideal here.  \nYou can test it at [FontShop](http://web.archive.org/web/20081026081555/http:/www.fontshop.com/showfont.cfm?fid=EF.104015.0.0).\n\n"
    },
    {
      "time": " 10.Jul.2005 7.25pm",
      "content": "I think pretty much anything works well at headline/subhead size, provided it doesn’t have any excessively thin strokes. (as you noticed)\n\nMost fonts specifically made for screen use are only hinted with small text sizes in mind anyway.\n\nMaybe if you narrowed down what feeling you’re aiming for?\n\n"
    },
    {
      "time": " 11.Jul.2005 8.39am",
      "content": "I would have though the rule of the thumb is something with minimal stroke modulation, so any old-style based font would be perfect.\n\n"
    },
    {
      "time": " 11.Jul.2005 10.43am",
      "content": "I don’t think stroke modulation is a problem as long as the width of the narrowest line isn’t too low.\n\nIn other words, a heavy black serif might have tons of stroke modulation, but look fine on the screen because the minimum stroke width is still pretty beefy.\n\n"
    },
    {
      "time": " 12.Jul.2005 12.30pm",
      "content": "Here’s a short article by Daniel Will-Harris called [**_The Best Faces for the Screen_**](http://web.archive.org/web/20081026081555/http:/www.will-harris.com/typoscrn.htm), oddly enough. He does add several typeface recommendation plus in his opinion why.\n\n—————————————————————————-  \nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 12.Jul.2005 1.41pm",
      "content": "[This article](http://web.archive.org/web/20081026081555/http:/www.typographer.org/2004_03_01_digests.html) by David Earls is quite interesting on type for the TV screen.\n\n"
    },
    {
      "time": " 13.Jul.2005 5.00am",
      "content": "“Most fonts specifically made for screen use are only hinted with small text sizes in mind anyway.”\n\nI’m pretty sure this is not entirely true. The fact is that most fonts hinted for use on computer screens contain hints for all ranges of sizes. What is true is that some outline fonts designed to be hinted and used on computer screens have been designed with small sizes in mind, so like any good text face the lowercase is too big and spindly for larger sizes...\n\nWhat makes these fonts no better than anything else for you purpose, is that  \n“headline/subhead size, image/flash based” specification. So, you are best off selecting something with niether small black, nor small white features, be they thin strokes, spaces ’twixt serifs, or anythinig else that a relatively unintelligent rasterizer would confuse with nothing, and make disappear, or something else that’d make these wee features look bigger than they are s’posed to be.\n\nSo, yeah, don’t Bodoni.\n\n"
    },
    {
      "time": " 13.Jul.2005 8.12am",
      "content": "In Photoshop and Fireworks, you can adjust the anti-aliasing “strength” of the font, which means that you can use just about any font, except Bodoni 72, at 18pt and above, in those programs.\n\n"
    }
  ]
}
