{
  "id": "13627",
  "title": "What's the best font for a novel?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi there,\n\nWe're designing a novel, a literairy thriller, to be exact, and I'm looking for a good typeface to be used as a reading text. Very often 'Times-look a like's' are used, but we are looking for something with a bit more personality. The novel will be around 250 pages, so the typeface has to be very legible and comfortable for the eye to read.\n\nIt will be used in combination with my **Nordic Narrow** ( [www.characters.nl](http://web.archive.org/web/20120623023754/http:/www.characters.nl/ \"www.characters.nl\")). This willl be the typeface used for headlines and the cover of the book. So if it would fit to that, it would be more than great.\n\nDoes anyone have a good suggestion?\n\nRegards,  \n®ené\n\n**Also tired of Helvetica?** Get an **[Insider](http://web.archive.org/web/20120623023754/http:/www.characters.nl/)** with more personality\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20120623023754/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n",
  "author": "Rene Verkaart",
  "time": "8 Jul 2005 — 9:09am",
  "uid": "1946",
  "comments": [
    {
      "time": "8 Jul 2005 — 9:18am",
      "content": "René you might be interested in [Paperback](http://web.archive.org/web/20120623023754/http:/www.houseind.com/index.php?page=showfont&id=171) from House Industries, designed in conjunction with (by) John Downer. I am really interested to see this baby set long.\n\nOk. Jumped the gun a bit. Your \\_Nordic Narrow\\_ is pretty character rich. Perhaps some from Storm?\n\n"
    },
    {
      "time": "8 Jul 2005 — 9:46am",
      "content": "[Warnock](http://web.archive.org/web/20120623023754/http:/store.adobe.com/type/browser/P/P_1709.html) is a good text face with some bite, like your Nordic narrow.\n\n"
    },
    {
      "time": "8 Jul 2005 — 11:06am",
      "content": "Look at The Foundry's stuff.\n\nhhp\n\n"
    },
    {
      "time": "8 Jul 2005 — 12:00pm",
      "content": "I have always had a weakness for [**Poppl Laudatio**](http://web.archive.org/web/20120623023754/http:/www.bertholdtypes.com/bq_library/90089.html). Its slightly condensed letterforms, large x-height and authoritative boldface allow you to pack a lot of info into tight spaces.\n\n"
    },
    {
      "time": "8 Jul 2005 — 3:58pm",
      "content": "\\> I have always had a weakness for Poppl Laudatio.\n\nWow, me too! But its x-height is just too huge, so I use it mostly for screen work, where it really shines.\n\nhhp\n\n"
    },
    {
      "time": "9 Jul 2005 — 12:44am",
      "content": "Thanx a lot for the tips. Keep 'm coming. I will check the fonts on monday when I'm back at work and try to get some samples of the fonts in use.\n\nRegards,  \n®ené\n\n**Also tired of Helvetica?** Get an **[Insider](http://web.archive.org/web/20120623023754/http:/www.characters.nl/)** with more personality\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20120623023754/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": "9 Jul 2005 — 6:55am",
      "content": "I remember once being completely enchanted by the pleasant reading of a novel set in [**Life BT**](http://web.archive.org/web/20120623023754/http:/www.myfonts.com/fonts/bitstream/life/)\n\n"
    },
    {
      "time": "8 Aug 2005 — 12:39pm",
      "content": "Hrant, Warnock is perfect for the job. You were absolutely right about it having an own personality. I just love it.\n\nTHANKS,  \n®ené\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20120623023754/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": "8 Aug 2005 — 1:19pm",
      "content": "Uh, that was William.  \nBut I do like Warnock.\n\nhhp\n\n"
    },
    {
      "time": "8 Aug 2005 — 1:33pm",
      "content": ":-) Your right!  \nYour critical eye-icon is always in my face, hypnotizing me into thinking that you own this thread. Or is it threat? :D\n\nSorry William.\n\n®\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20120623023754/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": "9 Aug 2005 — 8:34am",
      "content": "I'm sure I had a copy of \"A Canticle for Leibowitz\" somewhere set in Melior. I've seen comments elsewhere from people who thought it looks horrible for body text, but I kinda like it.  \nIt's at least sufficiently non-Timesy...\n\nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "10 Aug 2005 — 3:44am",
      "content": "» Poppl Laudatio.\n\nHow ironic! I just set a book of poetry in this, it is a surprisingly  \neconomical typeface, with all the correct parts for decent typographical  \nwork. Quadraat has a great texture on the page, and has all the bits and  \nbobs to do nice things. Oh, but I see you have settled on the optically  \ntuned magnificent Warnock! Good choice.\n\n"
    },
    {
      "time": "10 Aug 2005 — 5:32am",
      "content": "Welcome back Kris, I have not seen you post in quite a while.\n\nChrisL\n\n"
    },
    {
      "time": "10 Aug 2005 — 5:38am",
      "content": "Quadraat is a great font. Though some people 'hate' its details. If you use it bigger, all the interesting (IMHO) personality details come out. My collegue really hates it for that. In small sizes it's just beautifull.\n\nFor me Warnock works best. The client likes it and I love it. What more do you want?\n\n®\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20120623023754/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": "10 Aug 2005 — 7:30am",
      "content": "oh, if I had to write another novel about a font, I'd pick...Trajan, because you can write about over 1,000 years of history, and get a good Hollywood deal.\n\n"
    },
    {
      "time": "10 Aug 2005 — 7:34am",
      "content": "\"…Trajan, because you can write about over 1,000 years of history, and get a good Hollywood deal.\"\n\nLOL!!! Capital idea!\n\nChrisL\n\n"
    },
    {
      "time": "10 Aug 2005 — 8:41am",
      "content": "\\>Trajan\n\nMarcus Ulpius Traianus, may his bones be blasted.\n\nEmperor Traianus had, according to Rabbinic sources, initially favored the Jews of Alexandria over the majority Greek population, but when the Jews of Cyrenaica (in Libya) rebelled against him, he ended up leading the complete destruction of the Jewish community of Alexandria, then greatest next to Jerusalem, and personally destroying its magnificant synagogue. The community, which had given rise to philosopher Philo Judeas and had done a Greek translation of the Torah known as the Septuagent, vanished, and was never heard from again.\n\nBut we the rest of us still survive, and we don't forget.\n\nMarcus Ulpius Traianus, may his bones be blasted.\n\nBut he hired some damn good letterers. And his story would make a great blood-and-guts Hollywood movie. Coming soon to your screens starring Mel Gibson ;)\n\n"
    },
    {
      "time": "10 Aug 2005 — 8:42am",
      "content": "\\>Quadraat is a great font.\n\nI love it, and read a lot of it in the London Review of Books, which uses it for everything except the nameplate. However, it does have a flaw, the huge overhang of the \"f\". It stretches across wordspaces, almost touching capitals such as \"T\", as in \"A Tale of Two Cities\". I can appreciate the merit of the clever way it forms nice ligatures with b, h, f, i, j, k, and l, and it's OK in the middle of a word, but at the end it can be obtrusive. A good candidate for OpenType.\n\n"
    },
    {
      "time": "10 Aug 2005 — 8:59am",
      "content": "For a novel book I'd say Kepler!\n\n"
    },
    {
      "time": "12 Aug 2005 — 8:33pm",
      "content": "» Welcome back Kris, I have not seen you post in quite a while.\n\nKia ora to you too, Chris! I have been tied up with starting a  \ndesign business with my good friend Gus. We are officially  \n\"the Letterheads ltd\". And the Klim site needs a redesign, so that  \nis happening. What is up in yo' world?\n\n» For me Warnock works best. The client likes it and I love it. What more do you want?\n\nA post of the cover, perhaps :-)\n\n» A good candidate for OpenType.\n\nI have too been thinking about this. Do any typefaces incorporate a  \ndual version 'f' that doesn't stretch across wordspaces?\n\n"
    },
    {
      "time": "12 Aug 2005 — 9:09pm",
      "content": "It's a shame to truncate the only descent ascender in the entire Latin alphabet, especially at the end of a word where it can really kick in, bouma-wise. Much better to simply have a positive kerning pair for \"f\"-space.\n\nhhp\n\n"
    },
    {
      "time": "12 Aug 2005 — 10:17pm",
      "content": "I like the old but good Janson. That's what all those Tom Wolffe novels are set in.\n\nSDK  \nSusan Kirkland  \nSDKirkland Master Designer  \nAuthor of  \nStart & Run a Creative Services Business ISBN 155180607X  \nView my work and excerpts from the book (click the book icon) at\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:09am",
      "content": "True, Hrant. There is something quite nice about a grunty f. Especially when it can make auto ligs with other glyphs.\n\n"
    },
    {
      "time": "13 Aug 2005 — 3:58am",
      "content": "\\>a positive kerning pair for “f”-space.\n\nYou might be able to use that strategy, but it would require class kerning with a three-glyph action, because it would only be activated in [f\\_space\\_\"tall glyph\"] situations. Otherwise, it would create a big wordspace after every f-terminated word, which would look like a mistake.\n\nHowever, if you need that kind of OT ability to solve the problem, why not just have a contextual alternate \"f\", with less of a flair?\n\nThis kind of use of contextual alternates to improve clour and lessen confusion is something that OT can provide -- another example would be an alternate \"r\" for sans faces, to solve the \"r\\_n = m\" problem.\n\n"
    },
    {
      "time": "13 Aug 2005 — 11:03am",
      "content": "I wouldn't kern it **too** much, just strike a balance. And anyway, an occasional big wordspace is still better than neutering such a valuable facilitator of immersive reading. Our reading mechanism has no problem skipping over a blank space no matter how wide it is - it just has to be wide **enough** ; its only real drawbacks are: when the leading is extra tight (a bad idea anyway) the wordspace can overpower the line separation, leading to the reading of a word on the following line by mistake; and it uses up the retina's acuity faster than necessary. \"Look like a mistake?\" There's no time for such conscious sensitivity during immersion.\n\nAnd don't forget: there is after all such a thing as too much even color; evenness is ideal for display, but can -and by display face designers, usually is- taken too far, like a luxury car that insulates you too much from the driving environment. By the logic of totally even color, one would have an I-never-leave-the-house \"f\" for **every** situation.\n\nhhp\n\n"
    },
    {
      "time": "13 Aug 2005 — 3:41pm",
      "content": "On further reflection, I think the difficulty with Quadraat I'm seeing in the LRB is caused by the justification settings: there is probably a \"minimun wordspace\" value of 85 or 90% which very occasionally results in tightset lines such as...\n\nEnoch Powell's rivers of blood speech, and\n\n...where the f gets a bit too close to the b. Obviously, due to the rare occurence of this kind of thing, it's not a big deal. Perhaps the only reason I notice it is because I'm aware of the \"faux ligature\" structure of the f, as it's something I did in Goodchild, another small x-height oldstyle. However, that too was designed for publication setting where there isn't even the luxury of a simple f\\_i or f\\_l ligature, so the structure of the f is crucial.\n\nPutting in an [f\\_space] positive kern to solve this rare circumstance would be a mistake, as it would damage the spacing in the majority of situations, where [f\\_space] is not followed by a tall glyph.\n\nAs the topic of this thread is a font for a novel, there's nothing wrong with Quadraat there, as the difficulty is caused by magazine-column justification.\n\nThe reason I mentioned Quadraat's tiny \"flaw\" is because it conerns an intriguing design problem.\n\n"
    },
    {
      "time": "13 Aug 2005 — 8:05pm",
      "content": "\\> it would damage the spacing\n\nEven if a designer (like you, strangely enough) ignores your previous good idea of \"class kerning with a three-glyph action\" to solve the problem in a sophisticated way, and decides to choose between the two low-tech solutions of an \"f\"-space kern or simply neutering the \"f\", it's obvious that the occasional slightly-too-wide space is less bad than damaging any bouma with an \"f\" in it (especially ones that end in an \"f\"). Unless of course you have a \"belief imbalance\" between boumas and even color; but in that case you're outside the realm of text fonts. The \"f\" is one of the few good things the Latin alphabet has going for it, and you want to castrate it.\n\nhhp\n\n"
    },
    {
      "time": "13 Aug 2005 — 8:14pm",
      "content": "An April Fool's joke from way back, but probably still  \nfulfilling some people's delusions of Even Color, that  \nmost pretty among the many spawns of Regularity:  \n [http://www.themicrofoundry.com/ss\\_uniglyph1.html](http://web.archive.org/web/20120623023754/http:/www.themicrofoundry.com/ss_uniglyph1.html \"http://www.themicrofoundry.com/ss\\_uniglyph1.html\")\n\nhhp\n\n"
    },
    {
      "time": "14 Aug 2005 — 2:57pm",
      "content": "\\>The “f” is one of the few good things the Latin alphabet has going for it, and you want to castrate it.\n\nWhat on earth are you talking about?\n\nI'm talking about the problem of the generous ear in oldstyle faces, and the difficulty it causes when followed by tall glyphs. If one tries to solve it by making the ear of the f extra wide, wide enough to form faux ligatures, it can create an occasional problem, which seems to be most apparent when the face has a small x-height (like Quadraat) and when the justification setting includes a reduced wordspace value.\n\nTwo solutions, by glyph shape, rather than kerning, are: (1) a face like Galliard, where the ear has more of a ball on it: this seems to deter unwanted horizontal movement. (2) Palatino, where the ear is drastically narrowed.\n\nI'm pondering a third solution, hypothetical, which would be to use contextual alternates of the f. This is not much different than having ligatures anyway, because if you look at the f ligatures of most fonts, you will see that the ear is much wider in the ligatures than in the single f. So in effect, fonts with ligatures already have two widths of f in them.\n\n\\>it’s obvious that the occasional slightly-too-wide space is less bad.\n\nI would have thought the opposite was obvious. Perhaps you would care to demonstrate your assertion with a typeset example?\n\n"
    },
    {
      "time": "14 Aug 2005 — 4:30pm",
      "content": "\\> Perhaps you would care to demonstrate  \n\\> your assertion with a typeset example?\n\nWhat a waste of time that would be; you'd only see what you want to see. I can't put the correct mindframe in your head, you'll have to acquire it yourself. But just for the hell of it, here's a \"big picture\" synopsis: the \"problem\" you're focusing on is only such in the realm of display type, while in the realm of text type, it is in fact a feature.\n\nhhp\n\n"
    },
    {
      "time": "14 Aug 2005 — 5:15pm",
      "content": "\\>What a waste of time that would be;\n\nRather like having a discussion with you about type design.\n\n"
    },
    {
      "time": "15 Aug 2005 — 7:47pm",
      "content": "try Berling, makes for a quiet beautiful typographic color on the page with a hint of nordic :-)\n\ndesigned by Swedish calligrapher and typographer Karl Erik Forsberg and issued in 1951 by the Berlingska Stilgjuteriet foundry of Lund.\n\n[http://www.myfonts.com/fonts/linotype/berling/](http://web.archive.org/web/20120623023754/http:/www.myfonts.com/fonts/linotype/berling/ \"http://www.myfonts.com/fonts/linotype/berling/\")\n\n"
    },
    {
      "time": "15 Aug 2005 — 7:58pm",
      "content": "Berling was chosen for the MS Reader application a while back. I remember first thinking \"why the hell that old codger?\" but then realizing what a smart choice Bill Hill and his team had made, with its super-short descenders, particular color, and strong serifs.\n\nhhp\n\n"
    }
  ]
}
