{
  "id": "13626",
  "title": "U&lc the Book!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "On a designer friend’s coffee table the other day, I came across a big gorgeous book that was nothing but a collection of the best of [U&lc](http://web.archive.org/wiki/Uandlc) magazine! (For anyone too young to remember, U&lc, Upper & lower case, was this brilliant oversized typography and design magazine that was around from the 70’s until 1999.) In any case, it was a “must read” for graphic designers and I’m baffled that I hadn’t heard of this book before. You can order it straight from the publisher [http://www.markbattypublisher.com](http://web.archive.org/web/20061123004134/http:/www.markbattypublisher.com/) who has lots of other interesting graphic-design books. (Check out the book about [graffiti](http://web.archive.org/wiki/graffiti) in the Paris Underground, it’s fascinating.)\n\n",
  "author": "<a href=\"user/8210\" title=\"View user profile.\">Henry Hauger</a>",
  "time": "<br>",
  "uid": "8210",
  "comments": [
    {
      "time": " 8 July, 2005 - 9:04am",
      "content": "For those of you whom are interested in the lovely book, including myself, we’ll have it — last time I checked — in the vendor area at TypeCon2005 in New York.\n\n"
    },
    {
      "time": " 8 July, 2005 - 9:07am",
      "content": "Ah, yes!  \nU&lc\n\nUnfortunately the book is 9 1/4 x 12 7/8 inches (with some fold outs).  \nIt would have been great to see complete pages reproduced in the original large format newsprint size.\n\nBut any version is great for younger designers to review.  \nI, luckily enough, was on the U&lc mailing list from the debut issue Vol. I No. 1 and for years stalked the mailman for my issues.\n\nBTW, if you didn’t know, [Mark Batty](http://web.archive.org/wiki/Mark%20Batty) was president and CEO of ITC after [Aaron Burns](http://web.archive.org/wiki/Aaron%20Burns).\n\n————————————————————————————  \nYes, I’m old, and I’ve got original U&lc to prove it!\n\n"
    },
    {
      "time": " 8 July, 2005 - 1:41pm",
      "content": "Do you remember the issue where they published the longest word. It happened to be the name of a train station I think in Welch.\n\n"
    },
    {
      "time": " 8 July, 2005 - 2:11pm",
      "content": "I was and am a huge fan of the magazine, especially [MvB’s](http://web.archive.org/wiki/MvB%20Design) excellent collage-like layout work. I look forward to picking up a copy of the book.\n\n"
    },
    {
      "time": " 8 July, 2005 - 2:49pm",
      "content": "Dan,  \nthey also displayed the longest sentence written in English literature in a two-page spread. I believe it was from James Joyce’s _Ullyses_, which clocks in at 4,391 words.\n\n————————————————————  \nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 9 July, 2005 - 3:17am",
      "content": "Llanfairpwllgwyngyllgogerychwyrndrobwllllantysiliogogogoch  \nA name created purely for marketing a village as a tourist destination.  \nTim\n\n"
    },
    {
      "time": " 9 July, 2005 - 4:59am",
      "content": "But Tim didn’t that name mean something like: The place over the hill by the river around the church etc, and Norbert I remember that spread on Ullyses the funny thing is I remember the designs but I couldn’t tell you what faces they used for those layouts.\n\n"
    },
    {
      "time": " 9 July, 2005 - 7:49am",
      "content": "You are right Dan, it means “St Mary’s Church in a hollow of the white hazel near to the rapid whirlpool and St Tysil’s Church of the red cave”, however that name was coined by a cobbler to attract tourists to a village on Anglesey, it was originally called Llanfair Pwllgwyngyll, which means”The Mary church by the pool near the white hazels”  \nhttp://www.bbc.co.uk/h2g2/guide/A403642  \nTim\n\n"
    },
    {
      "time": " 9 July, 2005 - 9:14am",
      "content": "On the longest sentence spread:\n\nActually, this was a spread displaying two consecutive sentences from James Joyce’s _Ulysses_. Both sentences have more words than Victor Hugo’s famous sentence from _Les Misarables_.\n\nEach page was composed in six “newspaper style” columns set in what looks like ITC Garamond Book. The first sentence opens with the word “YES” in large caps, and the last sentenced ends with “YES” in large caps.\n\nOn the longest words.  \nThis was a theme used from time to time as part of Herb’s fascination with long words.\n\nOn the longest town name.  \nIn one of these articles they dispayed the name of a village in New Zealand containing 70 consecutive characters:\n\nRaumatawhakatangakoauauatamateapokaiwhenuakitanantahuwhakatamahangakoa\n\nwhich translates: “Hill crest where the traveller Tamatea piped on his nose flute for his beloved one.”\n\nI retreived all the above info from U&lc page reproductions in _Herb Lubalin_ by Gertrude Snyder & Alan Peckolick.\n\nI just don’t have the patience to dig through my archieves for the original U&lc issues, which are hermetically sealed behind a brick wall in my wine cellar (not!).\n\nAll of this reminiscing must seem boring to young readers, especially since we’re not showing images. I guess it’s sort of like old coots talking about a baseball game from the 1940s.\n\n——————————————————————————-  \nYes, I’m old, and that’s the TRUTH (raspberries)!\n\n"
    },
    {
      "time": " 9 July, 2005 - 10:34am",
      "content": "Love the typographic reminiscence, Norbert! Please continue…\n\n"
    },
    {
      "time": " 9 July, 2005 - 1:47pm",
      "content": "I haven’t seen the [newly released book](http://web.archive.org/web/20061123004134/http:/www.markbattypublisher.com/servlet/book_view?number=23) (edited by [John D. Berry](http://web.archive.org/wiki/John%20D%20Berry)), but I’m sure there is a lot of background details and stories behind the graphic phenomenon of U&lc.\n\nMost of the early editions were representative of the _[New York School](http://web.archive.org/wiki/New%20York%20School)_ style of design, made popular by [Lubalin](http://web.archive.org/wiki/Herb%20Lubalin), [Chwast](http://web.archive.org/wiki/Seymore%20Chwast), [Glaser](http://web.archive.org/wiki/Milton%20Glaser) ( [Pushpin Studios](http://web.archive.org/wiki/Pushpin%20Studios)) to name only a few of the giants involved. Also, it became a gallery of the superb work of [Tom Carnase](http://web.archive.org/wiki/Tom%20Carnase), [Tony Di Spigna](http://web.archive.org/wiki/Tony%20Di%20Spigna), [Ed Benguiat](http://web.archive.org/wiki/Ed%20Benguiat), again, only naming a few.\n\nBut the most brilliant aspect of the publication is that it became a “mother” of a marketing tool for the infant [International Typeface Corporation](http://web.archive.org/wiki/ITC). This came about through the passionate leadership of Aaron Burns.\n\nITC used U&lc to sell the idea of “Licensing” typeface designs. In other words, it made it a _moral_ issue not to use ITC typefaces unless they had the official “seal of approval”. A list of the ITC licensed foundries was published towards the back of each issue.\n\nAs the popularity of ITC typefaces grew, this added a little pressure for more and more foundries and manufacturers of typesetting equipment to sign on with ITC.\n\nWhat made this so unique, is that ITC through U&lc had found a way of popularizing their designs even BEFORE they were released and available for typesetting.\n\nYou can imagine how many young designers who read U&lc looked for the very first opportunity to emmulate their heros by specifying ITC typefaces.\n\n——————————————————————  \nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 9 July, 2005 - 3:29pm",
      "content": "Norbert - I’ll happily buy you a copy of Berry’s book if you’ll write a review for Typographica.\n\n"
    },
    {
      "time": " 9 July, 2005 - 4:36pm",
      "content": "Can you get it signed by John D. Berry?  \nI’m a pushover for signed editions.\n\n——————————————————-  \nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 9 July, 2005 - 5:40pm",
      "content": "Done.\n\n"
    },
    {
      "time": " 9 July, 2005 - 6:58pm",
      "content": "U&lc been Berry, Berry good to Norbert :-)\n\nChrisL\n\n"
    },
    {
      "time": " 10 July, 2005 - 1:12am",
      "content": "I can’t wait to read the review. Way to go Stephen!\n\n"
    },
    {
      "time": " 10 July, 2005 - 3:24am",
      "content": "Great job Steven you rock but so does Norbert\n\n"
    },
    {
      "time": " 10 July, 2005 - 2:06pm",
      "content": "I’ve been slobbering over the book since I got it a couple months ago. When I was in high school - back in the 70’s - U&lc was a major source of inspiration in my decision to go into design as a profession.\n\n- J.\n\nJeff Fisher :: Engineer of Creative Identity  \n [Jeff Fisher LogoMotives](http://web.archive.org/web/20061123004134/http:/tinyurl.com/5y8bm)\n\nAuthor: [Savvy Designer’s Guide to Success](http://web.archive.org/web/20061123004134/http:/tinyurl.com/5o7ud) from HOW Design Books\n\n"
    },
    {
      "time": " 10 July, 2005 - 5:10pm",
      "content": "Jeff,\n\ndid you see your first U&lc issue in school, or did you get it in the mail?\n\nI’m trying to figure out how extensive the first few mailings were. I know that I used to buy typesetting from [Photo-Lettering, Inc.](http://web.archive.org/wiki/Photo-Lettering,%20Inc.), in NYC, so that’s how I got on the mailing list.\n\n[Milton Kaye](http://web.archive.org/wiki/Milton%20Kaye), founder and publisher of [GraphicDesignUSA](http://web.archive.org/wiki/GraphicDesignUSA), told me he gave [Aaron Burns](http://web.archive.org/wiki/Aaron%20Burns) his mailing list of subscribers. Obviously Aaron sent them to schools and colleges around the country as well.\n\nIf you or anyone can add any info I’d appreciate it as I would like to find out how Aaron built the mailing list for the first year of U&lc. I guess one person to ask is [Ed Rondthaler](http://web.archive.org/wiki/Ed%20Rondthaler), who was one of the three founders of ITC. If I’m not mistaken, I believe Mr. Rondthaler recently celebrated his 100th birthday.\n\nHe and [Ed Benguiat](http://web.archive.org/wiki/Ed%20Benguiat) will be speakers at TypeCon2005 on Friday, July 22nd if someone in attendance is willing to ask him.\n\n———————————————————-  \nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 10 July, 2005 - 5:27pm",
      "content": "Why won’t you be in attendance, Norbert? You’re making me cry.\n\n"
    },
    {
      "time": " 10 July, 2005 - 6:16pm",
      "content": "My copies of U&lc came to me in the mail. It also was sent to the office I worked in at the time. I also got promos from U&lc and ended up buying a mammoth type specimen book in 1980 which doesn’t fit on any bookshelf I own. The book is hard-bound and about 13” square and about 2” thick. The cover and titles are set in ITC Benguiat. I would bring it to TypeCon for Ed to sign but I would get a hernia carrying it :-)\n\nChrisL\n\n"
    },
    {
      "time": " 10 July, 2005 - 6:32pm",
      "content": "I just found my favorite copy of U&lc—it has an image of Picasso on the cover made from several weights of ITC Korrina, This was published in 1989. Since then, many have used this technique but this is still the best.  \nThis issue also has clay sculpture portraits of numerous type biggies of the day. The paper is yellowing badly. Darn nice printing for newsprint though.\n\nChrisL\n\n"
    },
    {
      "time": " 10 July, 2005 - 6:46pm",
      "content": "Sorry Stephen, not this year, but I’ll be there in spirit. Be sure to say hello to Ed Benguiat, Erik Spiekermann and Allan Haley for me.\n\nChris, it’s a treasure. I also have the same ITC specimen book _THE ITC TYPEFACE COLLECTION_. It’s great since you can see all of the original alternates designed for Avant Garde Gothic, ITC Benguiat, ITC Zapf International Italics (no alternates for the roman), etc.\n\n“26 good reasons to use (name of typeface)” was the running sentence used for each weight of a typeface.\n\nIn the back, there is a definitive list of all the designers of ITC typefaces up until 1980, a detailed explaination of the “ITC Concept” and instructions to designers for submission of type designs.\n\nI was very fortunate enough to get a copy from Aaron Burns when I was at Compugraphic (before Agfa).\n\n————————————————————  \nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 10 July, 2005 - 7:08pm",
      "content": "That portrait of Picasso on the cover of U&lc inspired me to create a portrait of [Ed Benguiat](http://web.archive.org/wiki/Ed%20Benguiat) using [ITC Barcelona](http://web.archive.org/wiki/ITC%20Barcelona). We turned it into a poster and sent it to all Compugraphic Type customers.\n\nOne evening after one of Ed Benguiat’s lectures, several designers and myself met him for a few drinks. I framed the portrait of Ed and wrap it up as a present and asked [Janice Prescott-Fishman](http://web.archive.org/wiki/Janice%20Prescott-Fishman) (designer of [Shannon](http://web.archive.org/wiki/Shannon) with [Renee LeWinter](http://web.archive.org/wiki/Renee%20LeWinter)), if she wanted to present it to him. Unbeknownst to Janice, I inserted a photo of a bikini clad beauty with Janice’s face superimposed which covered the poster before I wrapped it.\n\nEd opened the present (with the back of the framed picture facing Janice), looked up a Janice, smiled and thanked her very much. Then he turned it around to show all us all. What a fun night! Janice, wherever you are, I hope you’ve forgiven me.\n\n———————————————————  \nYes, I’m old, and a joker as well!\n\n"
    },
    {
      "time": " 10 July, 2005 - 7:22pm",
      "content": "Chris,  \ntake another look at your issue of U&lc with Picasso on the cover. I think you’ll find the date of publication as Sept. 1979 (not 1989, unless they republished the portrait). Why take ten years off an “antique”.\n\n————————————————————  \nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 10 July, 2005 - 8:51pm",
      "content": "Norbert -\n\nOriginally saw it in our public library in Salem, Oregon of all places and I remember typing a letter to U&lc asking if they would add me to their mailing list. That would have been late 1973 or early 1974. I was then on their mailing list for years. I remember that the Journalism library at the University of Oregon had it in 1974-75 as well.\n\n- J.\n\nJeff Fisher :: Engineer of Creative Identity  \n [Jeff Fisher LogoMotives](http://web.archive.org/web/20061123004134/http:/tinyurl.com/5y8bm)\n\nAuthor: [Savvy Designer’s Guide to Success](http://web.archive.org/web/20061123004134/http:/tinyurl.com/5o7ud) from HOW Design Books\n\n"
    },
    {
      "time": " 11 July, 2005 - 5:05am",
      "content": "Norbert,  \nIt was 1979, my typo made it more youthful—wish I could do the same for my own age:-)\n\nChrisL\n\n"
    },
    {
      "time": " 11 July, 2005 - 5:16am",
      "content": "A facsimile (or “best of”) of an issue of U&lc, size as, but on archival-quality paper would be interesting. I have a spotty collection from back in the day, but the dirty brittle newsprint detracts from the overall effect.\n\n"
    },
    {
      "time": " 11 July, 2005 - 6:14am",
      "content": "Nick,  \nI think the book is supposed to fit the description you just made. When the original U&lc issues came out, I liked the newsprint large format idea. Admittedly, after 30 years in my flat file, the paper has gone pretty far south. Since it was a give-away, cost was a factor then and each issue did not seem as precious as they do now in hindsight. I threw most of mine away sadly while moving some years ago.\n\nChrisL\n\n"
    },
    {
      "time": " 11 July, 2005 - 6:35am",
      "content": "Some of my issues have held up fairly well, not too much discolorization, while others aged poorly. I literally stored them away in sealed plastic containers and haven’t handled them for six or seven years.\n\n"
    },
    {
      "time": " 11 July, 2005 - 7:29am",
      "content": "Here is my [U&lc book review](http://web.archive.org/web/20061123004134/http:/www.p22.com/terminal/Uandlc.html) for our new book reviews section of “ [The Terminal](http://web.archive.org/wiki/The%20Terminal)”.\n\n"
    },
    {
      "time": " 11 July, 2005 - 7:48am",
      "content": "Thanks for the link Richard!\n\nNorbert—You were right about the “Hermetically sealed in a mayonaise jar under Funk and Wagnel’s porch” idea :-)\n\nChrisL\n\n"
    },
    {
      "time": " 11 July, 2005 - 10:52pm",
      "content": "I love this thread… I’m going to read it again. (Now who’s going to take a crack at the [U&lc](http://web.archive.org/wiki/Uandlc) wiki entry?)\n\n"
    },
    {
      "time": " 12 July, 2005 - 12:12pm",
      "content": "Richard,\n\nyour “You and Elsie” review is great. I didn’t know the repro of pages retain the aged patina instead of bleaching them white.\n\nNow I’m really eager to drool all over the pages, just like I did with the originals.\n\n——————————————————————————  \nYes, I’m old, and drool too!\n\n"
    },
    {
      "time": " 13 July, 2005 - 1:54pm",
      "content": "Norbert do you have any other issues or articles we should remember. I recently posted my favorite quotes I got from U&LC like: A bore is a person who opens his mouth and puts his feats in it.\n\n"
    },
    {
      "time": " 13 July, 2005 - 2:06pm",
      "content": "So Dan,  \nyou are really trying to convince me to go down into the crypt and literally _dig up_ my old copies of U&lc!\n\nI’ll have to put on my Spielunking gear to get down there.\n\n—————————————————————————————————  \nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 14 July, 2005 - 4:15am",
      "content": "When you go mining you might come up with gold or at least something to laugh about.\n\n"
    },
    {
      "time": " 21 July, 2005 - 11:52am",
      "content": "Fresh out of my U&lc archives:\n\n**The Longest Word (In the Language) Series**\n\nHerb Lubalin had a fascination for long words which became a theme used many times in U&lc magazine. It all started in Vol. 1, No. 1 with this [featurette](http://web.archive.org/web/20061123004134/http:/www.acmedigital.net/JianSabu/Aimages/Ulc-longwrd-1.jpg) designed by Seymour Chwast, set using ITC Tiffany.\n\n(I intentionally downgraded the repro so it’s not useful for reprints, but you can get the general idea.)\n\n————————————————————————————  \nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 21 July, 2005 - 1:32pm",
      "content": "I love the longest word and its quirky layout. Thats what made that magazine fun.\n\n"
    },
    {
      "time": " 21 July, 2005 - 5:14pm",
      "content": "WOO HOO!\n\nI got the copy of _U&lc influencing design & typography_, edited by John D. Berry\n\nNow I owe Stephen Coles a review on the book. I must say it’s really a gem, even if it’s not on newsprint.\n\n————————————————————  \nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 21 July, 2005 - 8:12pm",
      "content": "Yikes, you made me order this book along with Type Spaces and Paul Rand: A Designer’s Art. Goodbye fancy camping equipment.\n\nI hope U&lc to be the best of the three (since it has been so nicely praised and it is the more expensive) and to have the satisfaction of not lending it to anyone muajajaja.\n\nI’m getting tired of reading books in english but I can’t seem to find good books for this kind of topics in spanish.\n\nHéctor\n\n"
    },
    {
      "time": " 21 July, 2005 - 8:19pm",
      "content": "By the way, anyone who has read Edward Tufte’s books, are they worthy? I find his three main books\\* to be too similar in topic, if I only could buy one, which would you recommend?\n\n\\*  \nThe Visual Display of Quantitative Information  \nVisual Explanations  \nEnvisioning Information\n\nHéctor\n\n"
    }
  ]
}
