{
  "id": "13647",
  "title": "Looking for suggestions/opinions on a pseudo-logo/insignia",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Putting together a personal portfolio site and although I’m not “in business for myself” I’m considering using something of a pseudo-logo to go with the “theme” of my website.\n\nThe website itself has a “1920s telegram” feel with some modern elements to it, and this logo evolved based on a Western Union logo of the same era with some changes. This isn’t really going to be a real “brand” though—not in the sense of the way real companies use logos. Oh, and one more thing, the actual “tagline” here is somewhat “for position only”. I want some obligatory cliche-type text/slogan found in 20s signage to go here but I don’t know that the text I actually placed here will stay.\n\nAnyway, looking for any general opinions though on the typefaces, kerning, design, etc., to see if any glaring problems jump out at anyone. Thanks!\n\n| Attachment | Size |\n| --- | --- |\n| [logo\\_exper.gif](http://web.archive.org/web/20060522215512/http:/typophile.com/files/logo_exper.gif) | 22.02 KB |\n| [machinewash\\_comp.gif](http://web.archive.org/web/20060522215512/http:/typophile.com/files/machinewash_comp.gif) | 243.93 KB |\n\n",
  "author": "<a href=\"user/5990\" title=\"View user profile.\">tomjonesrocks</a>",
  "time": "<br>",
  "uid": "5990",
  "comments": [
    {
      "time": " 8 July, 2005 - 2:24pm",
      "content": "As a non-logo graphic meant to give flavor I think it’s pretty good. If you were going to use it as a logo I would make it punch harder - but for your described purpose it seems good. Care to show us the context you will be using it in?\n\n"
    },
    {
      "time": " 8 July, 2005 - 2:44pm",
      "content": "The context its in is really in-progress at the moment, but it’s going on a distressed-paper background and “vintage” type fonts. That’s about as much as I can provide immediately.\n\nWould like to hear suggestions on the “punch harder” part though, just for future reference!\n\nThanks!\n\n"
    },
    {
      "time": " 9 July, 2005 - 5:29am",
      "content": "I like the mark it fits with the era but might be more 1940s than 20s. You might consider using Mr. Retro’s Machine Wash filters on the mark to give it an aged look. Also check out Font Diner fonts while you are at it.\n\n"
    },
    {
      "time": " 9 July, 2005 - 1:30pm",
      "content": "Experimented with the Machine Wash filters per your suggestions; added an attachment above of those highlights.\n\nYou may be right about the era; I’ll have to take that into consideration in the design of the context around it.\n\nNot sure if Font Diner had anything in the vein I’m looking for—most of those typefaces seemed 50’s and 60’s to me.\n\n"
    },
    {
      "time": " 10 July, 2005 - 5:12pm",
      "content": "Misfeed looks best to me. The others seem to subtle. I still want to see some more context for use - even if it’s rough. I can imagine to a point but…\n\n"
    },
    {
      "time": " 10 July, 2005 - 11:21pm",
      "content": "I like the ‘Choketone’ filtered one.. Typewise I think I like what you have now.. :)\n\n_( If I still were to recommend some alternate types.: ‘ [Landry ( Gothic )](http://web.archive.org/web/20060522215512/http:/www.myfonts.com/fonts/ephemera/landry-gothic/)’, by Andrew Leman / E-phemera, pretty much everything by [Archive Type](http://web.archive.org/web/20060522215512/http:/www.myfonts.com/foundry/archivetype/), and, the ‘ [HPLHS Prop Fonts](http://web.archive.org/web/20060522215512/http:/www.cthulhulives.org/toybox/PROPDOCS/PropFonts.html)’.. )_\n\n"
    },
    {
      "time": " 11 July, 2005 - 4:40am",
      "content": "I agree with Eben I like Misfeed. Whats cool about those filters is you can control the effect because they are layer masks\n\n"
    },
    {
      "time": " 11 July, 2005 - 10:34am",
      "content": "Thanks for all these suggestions—Wow—these E-phemera and Archive Type fonts are really cool. More temptation!\n\nActually did purchase the HPLHS Prop Fonts (they’re a steal). The type appearing below each Machine Wash example in the comp above is the Gothic from that collection—and I make use of that font on the site itself. Went with ITC Blair instead in the logo though.\n\nBased on these comments I may make the Wash effects a bit more severe (these are subtle as Eben mentioned, as I actually left the effects on the subtle-side). Food for thought.\n\nAlso will perhaps will put some of the context up as soon as I can semi-finalize a bit more of it. Thanks!\n\n"
    },
    {
      "time": " 11 July, 2005 - 2:48pm",
      "content": "Also, with the effect you have the option of making it subtle in print & less substle online - And more subtle as the ‘logo’ scales up in size & maybe less subtle if it will be small. The effect is meant to be a bit random after all!\n\n"
    },
    {
      "time": " 8 August, 2005 - 6:05pm",
      "content": "I appreciate the aesthetic, very ‘obey giant’\n\nI don’t really think the filter applied matters much, but play into the filter with the texture of what it’s on. A more cloth type filter on a flag, more bricky type on a masonry thing. Play into that.\n\n"
    }
  ]
}
