{
  "id": "1368",
  "title": "Spraytrix",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Another 1st timer be gentle but honest what   \nya reckon?   \n   \n ![Spraytrix.jpg](http://web.archive.org/web/20131023143028im_/http:/www.typophile.com/forums/messages/29/1666.jpg)\n\n",
  "author": "nathaniel",
  "time": "15 Jul 2002 — 4:36pm",
  "uid": "586",
  "comments": [
    {
      "time": "15 Jul 2002 — 5:07pm",
      "content": "Nathaniel - A lot of people have tried this type of dotted typeface (myself included), and I think you've got some cool (read: different) forms. Somebody did it first, I'm not sure who, but yours is certainly a fresh take. It's hard to see exactly what's happening with each letter, but if you can post a Flash sample, it'd be easier to give feedback on the individual letters.   \n   \n   \nbj\n\n"
    },
    {
      "time": "15 Jul 2002 — 5:57pm",
      "content": "I'm not running flash at the moment but here are some larger versions so you can have a better   \nlook at individual characters.   \n ![Spraytrixlight.jpg](http://web.archive.org/web/20131023143028im_/http:/www.typophile.com/forums/messages/29/1667.jpg)   \n ![Spraytrixregular.jpg](http://web.archive.org/web/20131023143028im_/http:/www.typophile.com/forums/messages/29/1668.jpg)  \n ![Spraytrixbold.jpg](http://web.archive.org/web/20131023143028im_/http:/www.typophile.com/forums/messages/29/1669.jpg)\n\n"
    },
    {
      "time": "15 Jul 2002 — 10:16pm",
      "content": "Nathaniel - favorite forms: the lc 'a' and 'e'   \n   \nleast favorite 's' and 'k'   \n   \nthis could be a usable specialty face, but in my humble opinion it could be improved.   \n   \nyou wanted gentle but honest criticism, so the main thing:   \n   \n I would clean up the face. Spraytrix light looks like a mishmash of diff. circular shapes but none of them look clean. The repeated shape could be a circle, square, star, whatever, but clean and uniform seems like it would work better than misshapen.   \n   \nit's not a bad first attempt so keep on trying new stuff,   \n   \nbj\n\n"
    },
    {
      "time": "15 Jul 2002 — 10:26pm",
      "content": "I feel the opposite, bj. It's the irregularity   \nof the dots that makes Spraytrix different from   \nthe other dotted grid fonts. I really believe   \nthe Light is marketable as a worn face printed   \nby some arcane machine.   \n   \nStephen\n\n"
    },
    {
      "time": "15 Jul 2002 — 10:33pm",
      "content": "Stephen - i urge you to reconsider!   \n   \njk ![:)](http://web.archive.org/web/20131023143028im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "16 Jul 2002 — 3:16am",
      "content": "Great!, the irregualrity gives the font a human look. It's more like a humanistic interpretation of those very rigid forms. The difference between the light & bold is good; it makes the typeface diverse, and interesting to watch. It gives the typeface a certain personality.   \n   \nI love those capitals;the S & K are beautiful.   \n   \nI think the next step is to transform it to a typeface. Spacing, Kerning etc...   \n& designing al the other elements; all the punctuations etc.   \n   \nthe typedesigner 'Peter van Blokland' designed in the early eighties the font 'vijfzeven'. Look at it at \" [http://xml.petr.com/buro/products/vijfzeven//nl](http://web.archive.org/web/20131023143028/http:/xml.petr.com/buro/products/vijfzeven/nl)\"   \nor try finding at \"http://www.petr.com\" There are a lot of similarities between his and your design. Though his font is more cleaned up (as what bj suggested), I think you should try to keep it more rough.   \n   \nMaking it clean is easy, keeping it rough, but also usefull is the tricky part.   \n   \ngood luck   \n   \n& try to do what you think is best   \n   \n(it's your design, in the end)\n\n"
    },
    {
      "time": "16 Jul 2002 — 3:24am",
      "content": "The irregular dots thats due the the spray paint   \ni used to create the grid. Its based on this   \n ![SprayGrid.jpg](http://web.archive.org/web/20131023143028im_/http:/www.typophile.com/forums/messages/29/1688.jpg)   \nHere are some new versions of the lc 's' and 'k'   \nThe lc 's' in the original looks that way because   \nthe others i tried were starting to look like the number five.   \n ![Newsk](http://web.archive.org/web/20131023143028im_/http:/www.typophile.com/forums/messages/29/1689.jpg)   \nThe light was the original but it didn't work   \nso well large so i made it heavier. Bold versions   \nare just to add a bit of versitility. I like fonts you   \ncan overlay to get 3D/misregistered styles.   \n ![Styles](http://web.archive.org/web/20131023143028im_/http:/www.typophile.com/forums/messages/29/1690.jpg)\n\n"
    }
  ]
}
