{
  "id": "13698",
  "title": "Rubylith",
  "forum": "Home",
  "tags": [
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20131020191743/http:/typophile.com/wiki/Indices) : [Terminology](http://web.archive.org/web/20131020191743/http:/typophile.com/wiki/Terminology) : Rubylith**\n\nIn the days of phototypesetting, which lasted from about the second World War until 1984, letters slowly moved away from being metal type.\n\nIn 1945, there were two kings of metal type, generally speaking. Lead type, sometimes called \"cold metal type,\" has still being cast for handsetting. This was Gutenberg's method—500 years old, but still in use. Lead type was produced by a [matrix](http://web.archive.org/web/20131020191743/http:/typophile.com/wiki/matrix). These matrices usually were made by stamping steel punches into some other sort of softer metal, sometimes copper. The other kind of metal type also used a combination of poured lead at matrices: \"hot metal type,\" or machine casting (using Linotype, Monotype, Intertype machines, etc.). The matrices for these machines were usually not made by hand, but rather with pantographic cutters, descended from [Lynn Boyd Benton](http://web.archive.org/web/20131020191743/http:/typophile.com/wiki/Lynn%20Boyd%20Benton)'s famous invention.\n\nThese cutting machines used large-scale letter drawings as their guides. These drawings were still necessary after the days of metal type had past. The drawing were again used as models to cut (either by machine or by hand) a new sort of matrix: **rubylith friskets**. A rubylith frisket was a very large letter (about the size of an 8.5\" x 11\"—or A4—sheet of paper), on a sheet of plastic. This sheet had been covered by rubylith—which is red—and the letter shape had been cut out of it. These new matrices could then be photographically reduced to produce the lettershapes found in phototypesetting systems, all of which were different from manufacturer to manufacturer, and even from product to product.\n\n**See also [Amberlith](http://web.archive.org/web/20131020191743/http:/typophile.com/wiki/Amberlith)**\n\n",
  "author": "Ken Messenger",
  "time": "10 Jul 2005 — 3:46am",
  "uid": "11693",
  "comments": [

  ]
}
