{
  "id": "13709",
  "title": "FAQ Font Sharing",
  "forum": "Home",
  "tags": [
    "Other",
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20150312040506/http:/typophile.com/wiki/Indices) : [FAQs](http://web.archive.org/web/20150312040506/http:/typophile.com/wiki/FAQs) : Font Sharing**\n\n_What About Sharing Fonts?_  \nGraphic Designers and computer users often ask, \"what's wrong with sharing font files?\" The truth is that there may not be anything wrong with the situation. But the answer to the question requires much thought and consideration.\n\nFonts are software, and software is generally used according to terms set out by its author. If the author does not want anyone to ever use his software under any circumstances, he probably will never share it with anyone. But, should he choose to let it out into the world, he would be wise to consider how he would like to to be used.\n\nSome fonts are [freeware](http://web.archive.org/web/20150312040506/http:/typophile.com/wiki/freeware). These files have had no restrictions placed on them by their creator, other than that (perhaps) they should not be sold by other parties.\n\nFonts that are not freeware all contain some sort of license. When a user uses this font, it would be nice and proper of him to do so within the terms set out by the license. Licensed fonts remain the property of their creator. Fonts that are purchased are not really purchased. What the user purchases is the license, allowing him or her to use the font data under the conditions set out in the license agreement ( [EULA](http://web.archive.org/web/20150312040506/http:/typophile.com/wiki/EULA)).\n\n[Shareware](http://web.archive.org/web/20150312040506/http:/typophile.com/wiki/Shareware) fonts also have licenses. These licenses could stipulate any number of things, like redistribution, and in which projects they may be used. Some shareware licenses may require monetary transfers to take place before the data may properly be used in a certain way. Many shareware licenses will allow some sort of free trial use period.\n\nWith commercial fonts: in almost all cases, the user must agree to the license agreement and pay for the license before the font files may even be downloaded or installed on the user's computer.\n\nSo, can you share fonts with other users? That depends. Did the font have a license regulating the sharing? If the font did not have a license, do you think that it should have?\n\nIf the license forbids sharing (as most commercial licenses do, save in some instances sharing with printing agencies), then one cannot in good faith share the font files. This would constitute unfair use.\n\nTechnically, the font software will \"allow\" one to share it, even if sharing is forbidden by a EULA. This is because font files just assume that they are being used honestly.\n\nCan you break the law and share fonts anyway? Yes, you are physically able to do so. But it is bad for karma.\n\n",
  "author": "paul d hunt",
  "time": "10 Jul 2005 — 6:09am",
  "uid": "7006",
  "comments": [

  ]
}
