{
  "id": "1370",
  "title": "Typographic Redesign for MoMA",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Jared posted this to News and Events. Discuss it here.   \n   \n ![](http://web.archive.org/web/20131018121727im_/http:/www.typophile.com/forums/messages/4100/16672.jpg)   \n   \nWhy is the logo on top \"digital,\" \"soulless\" and downright   \n\"hideous,\" while the logo on bottom shows \"character,\"   \n\"warmth\" and a \"profound respect for the past?\"   \n  \nRead [The Modern's Other Renovation](http://web.archive.org/web/20131018121727/http:/www.nytimes.com/2003/09/21/arts/design/21BLUM.html?ex=1065148517&ei=1&en=1be8df3acdcde974) by Andrew Blum.   \n(The New York Times)\n\n",
  "author": "Joe Pemberton",
  "time": "22 Sep 2003 — 12:57pm",
  "uid": "1160",
  "comments": [
    {
      "time": "22 Sep 2003 — 6:22pm",
      "content": "Oops. This is a cross post. [Go the real thread \\>](http://web.archive.org/web/20131018121727/http:/www.typophile.com/forums/messages/30/16543.html)\n\n"
    },
    {
      "time": "22 Sep 2003 — 2:13pm",
      "content": "The Jpeg process has been unkind to both, but to my eyes, the one on top's fuzzy around the edges. It was probably screenshotted from a nice scan and sampled down.   \n   \nThe one on the bottom shows a \\*great\\* sharp cleaving to the pixel, looking a lot more like print to my eye. If \"soulless\" means ignoring subtleties on the altar of Speed and Progress, sure, the above sucks more. The only other difference I can see is the spacing.   \n   \n ![difference filter between old and new logos](http://web.archive.org/web/20131018121727im_/http:/www.typophile.com/forums/messages/4100/16676.gif)   \nThe upper one was a tad bigger so I scaled it down - still - I can't really see the different cut to Franklin onscreen. The only difference besides the fuzzy edges is the obvious letterspacing. No comment on that though I'm reading <u>Stop Stealing Sheep</u> (great stuff).   \n   \n'Hideous' means shockingly ugly. Both designs are competent and have similar 'boumas'. The difference seems more of a gnat's whisker/RCH. Please, someone scan the new and old ones and REALLY compare the difference.\n\n"
    }
  ]
}
