{
  "id": "13717",
  "title": "Logo Feedback wanted",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi,\n\nI haven’t done too many logos and am looking for feedback on these. It’s for a highend ceramics gallery that also has a studio next door. Any feedback would be great!\n\nOne more thing…how many logos should I present to the client?\n\nThanks,  \nKay\n\n| Attachment | Size |\n| --- | --- |\n| [logos\\_1.gif](http://web.archive.org/web/20060522215556/http:/typophile.com/files/logos_1.gif) | 50.11 KB |\n\n",
  "author": "<a href=\"user/8057\" title=\"View user profile.\">kay</a>",
  "time": "<br>",
  "uid": "8057",
  "comments": [
    {
      "time": " 10 July, 2005 - 9:14am",
      "content": "I like the background / border imagery of ‘4’ and ‘5’, but I am not too sure about the related type, and the ‘clean’ symbol.. _( Maybe something more ‘handmade’, handdrawn, slightly ‘rougher’.? )_\n\n"
    },
    {
      "time": " 10 July, 2005 - 9:38am",
      "content": "I enjoy #4 & #5 as well… if youre going to use the water/paint drops in #4 I suggest trying that they be more random rather than being such a plain shape. Maybe you can have some single drops not connecting… but then again it could look too messy.. maybe give it a try.\n\n"
    },
    {
      "time": " 10 July, 2005 - 9:52am",
      "content": "Only show them any ones YOU are happy with. I repeat, DO NOT show them anything YOU do not like. ( experience :( )\n\n"
    },
    {
      "time": " 10 July, 2005 - 9:59am",
      "content": "Yea, I may second Erics remark about presenting ideas and proposing logotypes you may not love yourself.. Dont do it.. _( They will sure go for the ones, you like the least, well, ‘pretty often’.. :)_\n\n_Trust us.. :)_\n\n"
    },
    {
      "time": " 10 July, 2005 - 9:17pm",
      "content": "It looks like you’re designing two logos, one for the gallery and one for the studio. I like #4 for the studio, the splashes remind me of ceramic glazes, but I agree with dgiliati, it needs some variation in the shapes (maybe actual ceramic glaze?). The identies can be similar, but should be more distinct than just the fine print, consider the people trying to find one or the other.\n\n"
    },
    {
      "time": " 12 July, 2005 - 1:47am",
      "content": "Many have said that less is more, but you can take this farther.\n\nThe overall look is dull and it’s just like looking at clipart. Not to discourage you, of course, just push the design more.\n\n"
    },
    {
      "time": " 12 July, 2005 - 7:27am",
      "content": "I prefer 4 and 5, but the type (particularly the ‘clinton’ and ‘guild’) is flat and dead next to the mark. Try a serif with more humanist features and softening elements; more quirk!\n\nThis assumes you’re going for&nbsp;a softer image. Your designs span a wide range of looks: hand-done, creative, stoic, professional, modern/contemporary. Clarifying that may help you pick which to show.\n\nNever show a logo you don’t want them to choose (if you have a choice). I usually never show more than 3 major variations (sometimes I include sub-variations). If I can, I show 1.\n\n"
    },
    {
      "time": " 24 July, 2005 - 5:59pm",
      "content": "Ceramics are handmade. I think the typeface should reflect that. They’re all interesting concepts, but I thnk the shapes overpower the letterfomrs in all of them.\n\n"
    },
    {
      "time": " 24 July, 2005 - 6:01pm",
      "content": "At least the font used for “Ceramics” should reflect handmade, and you could set “Clinton” and “Guild” in a contrasting font.\n\n"
    },
    {
      "time": " 25 July, 2005 - 8:47am",
      "content": "“Ceramics are handmade. I think the typeface should reflect that.”\n\nI might disagree with that. When I think ‘ceramics shop’ I think of the truly handmade crap you see in every semi-artsy tourist town. Usually a gallery with hundreds of sloppily made mugs and ash trays with glaze slapped all over it.\n\nAs such, I’d try to distance this company, which is ‘high end’ away from that. When I think high-end, I tend to think much more refined forms. And while the forms may be organic, I think a more ‘high end’ feel to the type wouldn’t hurt.\n\n"
    },
    {
      "time": " 25 July, 2005 - 4:11pm",
      "content": "Nonetheless, ceramics (of whatever quality) are all handmade. Handlettered can be organic and at the same time refined. I think you can evoke “high-end” through the elegant shapes of the images AND the font used to set “clinton” and “guild.”\n\n"
    },
    {
      "time": " 25 July, 2005 - 6:25pm",
      "content": "Well I think #2 has the most harmony. The type and mark relate well, but do tend to look a little plain.\n\n4 has some potential. I would echo the comments on making the splats more random. I would also echo the humanist serif idea.\n\nThis is a guild, right. Perhaps one mark can show one pottery element made of different pieces, illustrating the guild aspect.\n\nI also can’t help but thinking about how this type would look blind embossed into some clay. Perhaps thinking along those lines might open up another creative direction for you. Go to a china shop, or a japanese cookware store and look at the bottoms of the pieces. You are bound to get some ideas from that.\n\n"
    }
  ]
}
