{
  "id": "13752",
  "title": "(x) Thompson's Candy - Jancyzk Jubilee {Evan (self)}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Can anyone ID this font - from a british candy company\n\n| Attachment | Size |\n| --- | --- |\n| [thompsons.gif](http://web.archive.org/web/20060604052314/http:/typophile.com/files/thompsons.gif) | 58.73 KB |\n\n",
  "author": "<a href=\"user/5948\" title=\"View user profile.\">evan</a>",
  "time": "<br>",
  "uid": "5948",
  "comments": [
    {
      "time": " 12 July, 2005 - 9:28am",
      "content": "I think that this is probably a custom lettering (artwork) job, but the font shown as Diana in the Solotype Catalog, and sold as [Ballantines Script](http://web.archive.org/web/20060604052314/http:/www.myfonts.com/fonts/ef/ballantines-script/ef-bold/testdrive.html?s=Thompsons&p=48)might be a fairly close substitute.\n\nAt least it would be a place to start, and with a few modifications, you could come fairly close.\n\nYou could also browse the Casual Flowing Script samples in [Part 7 of the Script Font ID Guide](http://web.archive.org/web/20060604052314/http:/bowfinprintworks.com/Script07Pg1.html) for similar styles.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 12 July, 2005 - 3:09pm",
      "content": "No exact matches, but I’d take a look at [Letterhead’s scripts.](http://web.archive.org/web/20060604052314/http:/letterheadfonts.com/styles/script.shtml)\n\n"
    },
    {
      "time": " 12 July, 2005 - 8:06pm",
      "content": "After much hunting and realizing that this was probably done on some type of vinyl cutting machine (like Gerber) I tracked down this font where most all of the letters are the same - it looks like the lower case o was modified and some new “connections” were created between letters.\n\nThe font appears to be called Jancyzk Jubilee  \n [http://lendaproducts.com/graphics/letstyle/page201.htm](http://web.archive.org/web/20060604052314/http:/lendaproducts.com/graphics/letstyle/page201.htm)\n\nCuriously, any idea of it’s origins?\n\n"
    },
    {
      "time": " 12 July, 2005 - 9:20pm",
      "content": "I’d like to know how you found that! Maybe you should be on this panel, if you can pull that one out of a hat like that. Looks like some of their typefaces are using the ‘real’ names, and some are renamed, so Jancyzk Jubilee might be anything.\n\nThe style resembles Brody, but I can’t find anything else very close. It looks like the 30’s era styles that Nick Curtis and Harold Lohner have mined so well from old lettering books.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 12 July, 2005 - 9:27pm",
      "content": "I took my own advice about looking in Part 7 of the Script Guide and Jason Walcott’s [‘Hucklebuck’](http://web.archive.org/web/20060604052314/http:/bowfinprintworks.com/Script07Pg9.html)is a very similar style. If he tells where he found that one I think you’d be close to your source. (The font is sold by Veer in the Jukebox collection).\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 12 July, 2005 - 9:32pm",
      "content": "On the page before that one is an even closer one from Art and Sign fonts called [Rister](http://web.archive.org/web/20060604052314/http:/bowfinprintworks.com/Script07Pg8.html). I’m guessing a lot of folks had access to the same sample books maybe?\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 13 July, 2005 - 4:54am",
      "content": "Gee, folks, I’m just not seeing what you seem to be seeing.\n\nIf the object is to find a match to the sample GIF, I would say that [Monotype Script](http://web.archive.org/web/20060604052314/http:/www.myfonts.com/fonts/linotype/monotype-script/) is a lot closer than any of the other options offered so far.\n\nOr, you might consider a couple of my humble offerings: [Moonshine Script](http://web.archive.org/web/20060604052314/http:/www.myfonts.com/fonts/nicksfonts/moonshine-script-nf/) or [Pismo Clambake](http://web.archive.org/web/20060604052314/http:/www.myfonts.com/fonts/nicksfonts/pismo-clambake-nf/).\n\n"
    },
    {
      "time": " 13 July, 2005 - 5:07am",
      "content": "Monotype script has NO matching letters - it IS Jancyzk Jubilee with some minor modifications - specifically the lower case o.\n\nAs for finding it, I remember it from my old days working at a sign shop - I knew that I had seen it before and then I had one of those “ah-hah” moments that come out of nowhere.\n\nSome people want exact and similar just won’t cut it.\n\n"
    },
    {
      "time": " 13 July, 2005 - 5:10am",
      "content": "Mike, well if you consider checking in every hour or so to help ID fonts, I am on this panel - I set up an account a few months ago and try to help.\n\nBut, it’s like the game show Jeopardy. Too many people “buzz in” before me and ID the font before I can.\n\nThere are some amazing people here that can recognize obscure fonts from independent foundries. My problem is that I know I’ve seen the fonts before, but cannot remember the name or where to find it.\n\n"
    },
    {
      "time": " 13 July, 2005 - 8:21am",
      "content": "Evan,\n\nI’m sorry if I hadn’t noticed you before. We can always use the help of people with a lot of type ‘exposure’, and your sign shop experience should help, but it will be a big handicap if you have trouble remembering the names or where you saw them ;).\n\nAnyway, thanks for trying. It’s less important _who_ gets the ID than it is that we _do_ get the ID.\n\n- Mike Yanega\n\n"
    }
  ]
}
