{
  "id": "13767",
  "title": "FontLab freezes when generating OTF. I seek for help.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello\n\nI am in the process of developing a font with FontLab (I am a newbie to it) and I want to know if I can get some aid from you.\n\nFontLab will freeze when trying to export the characters to OpenType. It will be OK when generating TrueType, though. When trying to generate either format, an error message pops up stating that some characters contain open contours.\n\nSo, question 1:\n\nAny idea of why FontLab will freeze through the export dialog when generating the OT font? The TT Font weighs 406 Kbs so far and contains around 500 characters.\n\nQuestion 2:  \nDo you know of any FontLab forum that can be accessed through a) Outlook and/or b) web?\n\nQuestion 3 (a bit off the main theme):  \nHow can I turn the colour red off the glyph cells that are supposed to have open contours once I've made sure that the contours are closed? (No more nodes marked with an X). When I re-open the font the cells are still marked red.\n\nThanks,  \nMosh\n\n",
  "author": "mosh",
  "time": "12 Jul 2005 — 2:01am",
  "uid": "6146",
  "comments": [
    {
      "time": "12 Jul 2005 — 3:01pm",
      "content": "1) I'm not sure this is what's causing your problem, but if you try to save an OTF font, and you have the \"Export only OpenType name records\" option off in Preferences, _and_ you have not filled in the \"Other Names\" page in the Font Info screens, FontLab will quit unexpectedly (OS X).\n\n2) [http://groups.msn.com/FontLab/\\_whatsnew.msnw](http://web.archive.org/web/20150328232240/http:/groups.msn.com/FontLab/_whatsnew.msnw \"http://groups.msn.com/FontLab/\\_whatsnew.msnw\") (The fact that it is hosted through MSN Groups sucks, but the good news is that at some point in the near future it will move to FontLab's own site, according to the FontLab people.)\n\n3) You have to manually \"turn off\" the red marks after fixing the glyphs--they are a nice touch, but not dynamically self-updating. Right-click on a glyph cell and choose Mark \\> None. BTW, you can use this marking facility however you want, for example, to help keep track of glyphs you are working on. I have even seen Python scripts that mark characters with different colors based on certain criteria. I'm not quite that sophisticated myself (yet).\n\n"
    },
    {
      "time": "13 Jul 2005 — 4:25am",
      "content": "Also, you're welcome to contact FontLab support at  \n [http://www.fontlab.com/Font-tools/FontLab-Product-Support/FontLab-Proble...](http://web.archive.org/web/20150328232240/http:/www.fontlab.com/Font-tools/FontLab-Product-Support/FontLab-Problem-Report/ \"http://www.fontlab.com/Font-tools/FontLab-Product-Support/FontLab-Problem-Report/\")\n\nPlease make sure to include the font file (.vfb and the final font if possible) so we can test it ourselves.\n\nRegards,  \nAdam Twardoch  \nFontlab Ltd.\n\n"
    },
    {
      "time": "20 Jul 2005 — 8:01am",
      "content": "Thank you very much, Adam...\n\n"
    },
    {
      "time": "25 Jul 2005 — 1:34am",
      "content": "(And thanks to you Mark, also)...\n\n"
    }
  ]
}
