{
  "id": "13792",
  "title": "I'm writing an article on font design for Computer Arts magazine",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everyone - i’m writing a feature for a UK-based gfraphic design mag called Computer Arts on what life for font designers is like at the moment - what do you guys think?\n\n1) Is it easy for font designers to sell work and make money - is it a good career move?\n\n2) Is there enough new blood coming into the industry?\n\n3) Do colleges and universities do a good enough job of getting students intersted in font design and helping them persue the art as a career?\n\nThanks\n\nDom Hall\n\n [‹ LiveType Project - Open Source Collaborative Type Design](http://web.archive.org/web/20080917021513/http:/www.typophile.com/node/13565 \"Go to previous forum topic\") [Graphics tablets ›](http://web.archive.org/web/20080917021513/http:/www.typophile.com/node/13578 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080917021513/http://www.typophile.com/user/8279\" title=\"View user profile.\">Dom Hall</a>",
  "time": "<br>",
  "uid": "8279",
  "comments": [
    {
      "time": " 13.Jul.2005 3.49am",
      "content": "Dom,\n\na hint: people prefer to say “type design” rather than “font design”. Typefaces are the letterform designs while fonts are merely the digital files that store them. Similarly, you wouldn’t call a digital photographer a “JPEG designer”.\n\nRegards,  \nAdam\n\n"
    },
    {
      "time": " 13.Jul.2005 4.38am",
      "content": "“1) Is it easy for font designers to sell work and make money - is it a good career move?”  \nMaking the move into type design is not only accomplished by springing up with an irresistable and original new design. There are other jobs too, but I a person is talented enough to start out with best sellers, yeah! it’s a good career move. .\n\n“2) Is there enough new blood coming into the industry?”  \nOver the last 10 years, I think there’s been enough new blood to make a couple of Hollywood epics. New designers are coming into the industry in better shape than ever.\n\n“3) Do colleges and universities do a good enough job of getting students intersted in font design and helping them persue the art as a career?”  \nSome do, and those send not just designers/ Other universities are not so thorough, but for the top 1% of potential type designers, it’s the student, not the school.\n\n"
    },
    {
      "time": " 13.Jul.2005 5.00am",
      "content": "1) Is it easy for font designers to sell work and make money - is it a good career move?\n\nIt’s very difficult to make all your income from type design. Many independent foundries are run by people with supplememtnal forms of income, such as graphic design and teaching. Many successful foundries don’t rely on retail font sales, but on commissioned work. Starting out with a best seller, hmm, you may be a one-hit wonder! (But hopefully the royalties will last for a few years, subsidizing subsequent flops, and the reputation will lead to commissions.)\n\n2) Is there enough new blood coming into the industry?\n\nAll the time. Independent foundries have blossomed as a business sector, thanks to e-commerce.\n\n3) Do colleges and universities do a good enough job of getting students intersted in font design and helping them persue [sic] the art as a career?\n\nAs good as can be expected, given that it’s a small industry. If you are looking to study type design, you will probably not find it as a separate course near you, and it is an oddity as part of a general design degree. There are very few places where type design can be studied in depth, such as the MA at Reading University.\n\n"
    },
    {
      "time": " 13.Jul.2005 5.16am",
      "content": "I think Nick has it right. I don’t think people go into type design for the money—designers go into it because they have a burning interest. If what you call a good career move is doing something that interests you then yes. If you think you will make Bill Gates jealous, then you will be disappointed.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Jul.2005 6.46am",
      "content": "Dom:\n\nI won’t post anytinhg new here, but I think the insight of someone working at a Faculty (as a Design Technician) can probably add some factual data to your magazine feature.\n\n3)  \nI work in a faculty in Porto, Portugal. It’s a traditional Fine-Arts School.  \nThe course is “traditional” Graphic Design oriented, having a strong multimedia component on the last 2 of a 5 year course. So as Nick said, to study Type Design in deph, here too is complicated:\n\n<cite>“If you are looking to study type design, you will probably not find it as a separate course near you, and it is an oddity as part of a general design degree.”</cite>\n\nActually, Type Design as a discipline, is integrated on the second year of the Graphic Design course and it can not be taught separately. It must stress that, on the second year, students also do composition and poster design. So it can be tricky for them to invest enough effort in this subject, and drawing, and history, and geometry, and...\n\nNevertheless, there are some students who do persue Type Design as a “personal quest” all the way to the fith year and develop very interesting work.\n\nActually this last year there was a pretty valuable effort from one of the fourth year teachers to implement a Type Design assignment - Students were required to complete a working digital font from scratch. So many of them who had never used font software really had to take this on. The only problem here was that the school lacks the infrastructure to do this... maybe next year we’ll be ready. This is due in part to the old traditional way of aproaching Type Design - Paper Drawings! I’m not against it, I still do them as a mandatory phase of Type developing, but the problem develops if you don’t materialize your fonts and test them on real samples.\n\nSo, you can say that at least this Faculty (taking on account that this is a traditional school) is doing it’s share <cite>on getting students intersted in font design and helping them persue the art as a career</cite>\n\nThis takes me to the other two questions.\n\n2)  \nAt least here is very difficult to develop Type Design as a profession because there’s a very small demand for it, and usually it’s lettering. So the few that develop should really be enough to “freshen the industry bood”. Altough... I really don’t know this. My doubt comes from the last “big clients” like Fundação de Serralves, Grupo BPI and Grupo EDP. They all comissioned their work from international companies... so I think that, as a nation, we need to overcome our national prejudice first to stregthen our own industry.\n\n1)  \nChris said it all!\n\nBy the way, which computer arts issue will your feature be on? I’d like to read it then!\n\nCheers,  \nPedro\n\n——  \n [LiveType Project](http://web.archive.org/web/20080917021513/http:/livetype.sourceforge.net/)\n\n"
    }
  ]
}
