{
  "id": "138",
  "title": "Type Trends",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I thought to share an interesting graph that I recently stumbled across:   \n [http://www.themicrofoundry.com/other/trends.gif](http://web.archive.org/web/20150417032813/http:/www.themicrofoundry.com/other/trends.gif)   \n   \nIt's from page 195 of \"The shaping of our alphabet\" by Frank Denman (Knopf, 1955). The chapter home to the graph (#12, \"Where do we go from here?\") is actually a riveting read itself, and contains a completely unexpected and very eloquent defense of... alphabet reform! I tell you, the things one finds by mistake.   \n   \nAnyway, rather than offer my interpretations of the graph,   \nI'd like to stay quiet and hear of the things you see in it.   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "7 Apr 2002 — 2:20pm",
  "uid": "1250",
  "comments": [
    {
      "time": "7 Apr 2002 — 5:10pm",
      "content": "I don't understand the chart.\n\n"
    },
    {
      "time": "7 Apr 2002 — 5:28pm",
      "content": "It's supposed to show the use of various styles of type over the years. For each \"row\" the first hill is the main movement, the second is a revival. Note that this thing seems to be \"pseudo-quantitive\": it's not based strictly on numbers (as the author admits), but it does contain views of certain specific things. For example, note the little wobble in the descent of the revival of \"Victorian Bizarre\". Also, the hills don't seem to be to relative scale. For example, the peak of \"Modern\" should be much higher than that of \"Caslon\" (considering the greater use of type 200 years later), but it's all been normalized instead.   \n   \nI'd love to have a graph that extends to today. But I'm not remotely qualified to make it, especially since I have a feeling it starts getting really messy in the past 20 years.   \n   \nSo, what do you guys think about:   \n1. The [supposed] regularity of the main trends.   \n2. The timing of the revival hills.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2002 — 5:44pm",
      "content": "If foundries would be more willing to release   \nfont sales numbers, we'd wouldn't be far from   \ncreating that new graph.   \n   \nStephen (says this in all jest)\n\n"
    },
    {
      "time": "8 Apr 2002 — 12:07pm",
      "content": "I stand corrected. MyFonts.com too:   \n [http://www.myfonts.com/BestSellers](http://web.archive.org/web/20150417032813/http:/www.myfonts.com/BestSellers)   \n   \nI suppose a rough graph could be drawn using   \nat least those foundries that post results   \non a regular basis.   \n   \nStephen\n\n"
    },
    {
      "time": "8 Apr 2002 — 2:53pm",
      "content": "The thing with the graph is that it doesn't have to be (and maybe even shouldn't be) strictly quantitative to be useful. Note how it's showing classes of fonts, not individual designs - and that's a good thing. So the hard numbers would undoubtedly help, but it would take the analysis and insight of a real guru to \"distill\" it into something really useful.   \n   \nMaybe we can build a foundation here, with this small seed question: what are the main style categories since the 1950s? I'm thinking of stuff like \"American Grotesk\" (Franklin Gothic) or \"Humanist Sans\" (Syntax) or \"Aldine Revival\" (JY Aetna), etc. BTW, even just determining the optimal level-of-detail on this thing is an issue of itself...   \n   \nAlso, maybe we're getting ahead of ourselves: Is Denman's graph even a solid foundation to build from? Franklin Gothic, for example, isn't represented...   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2002 — 2:40pm",
      "content": "Thanks, Hrant. I saw this graph on the AtypI list the other day, bookmarked it, and have meant to bring it up. Very interesting stuff! I wonder how a graph today might look.\n\n"
    },
    {
      "time": "8 Apr 2002 — 11:53am",
      "content": "Quite a few foundries do this, by the way. Emigre posted their top nine sellers in the last issue; FontShop and Jean-François Porchez do the same on a regular basis. The big yellow FontShop book lists the top sellers for a number of foundries.\n\n"
    }
  ]
}
