{
  "id": "13818",
  "title": "Village Type Collective Open!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "An exciting new type collective, [Village](http://web.archive.org/web/20131108163833/http:/vllg.com/), opened its virtual doors today:\n\n\"Village is a type co-op. We are the union of nine (soon to be twelve) young type foundries who have decided to go it alone, together. vllg.com is the information channel and boutique storefront for this group of equals.\"\n\nThe nine foundries are: Feliciano Type Foundry (Mário Feliciano), Joshua Darden, KLTF (Karsten Lücke), Lux Typographics (Michael Rey, Greg Lindy), Orange Italic (Christian Schwartz), Thirstype (founded by Rick Valicenti, with contributions from Barry Deck, Magnus Rakeng, Patric King, chester, Frank Ford, Patrick Giasson, Claudio Piccinini, and soon Hugo d’Alte), Type Initiative (Michail Semoglou, Keith Chi-hang Tam), Underware (Akiem Helmling, Bas Jacobs, Sami Kortemäki) and Village (chester, Tracy Jenkins). According to the site, \"Village is the 'house brand' and founding member of the type collective.\"\n\nSome _beautiful_ typefaces are or soon will be available, some of them for the first time to the type community at large, including [Local Gothic](http://web.archive.org/web/20131108163833/http:/vllg.com/OrangeItalic/) by Orange Italic (first conceived in 1999 and used in the TypeCon 2005 identity) and the long-awaited [Crank 8](http://web.archive.org/web/20131108163833/http:/vllg.com/Lux/Crank8/Example+About/) by Lux Typographics (seen originally in _Esquire_ magazine). Wow.\n\nEdit: I just took a closer look at [Litteratra](http://web.archive.org/web/20131108163833/http:/vllg.com/KLTF/Litteratra/mudTyper+Weights/), by Karsten Lücke. It has to be seen to be believed!\n\n",
  "author": "Mark Foster",
  "time": "13 Jul 2005 — 7:18pm",
  "uid": "5237",
  "comments": [
    {
      "time": "13 Jul 2005 — 10:37pm",
      "content": "Wow, what a group. Best of luck to them.  \nNice name too. Except maybe: [http://www.villagetype.com/](http://web.archive.org/web/20131108163833/http:/www.villagetype.com/ \"http://www.villagetype.com/\")  \nI was in touch with Dan Franklin on and off from 2001 to 2003, but  \nhave no idea if still calls himself Village Typography. A problem?\n\nhhp\n\n"
    },
    {
      "time": "14 Jul 2005 — 2:27am",
      "content": "Great idea, nicely done!\n\n"
    },
    {
      "time": "14 Jul 2005 — 2:27am",
      "content": "Good to see several previously commercially unavailable fonts here, although ones that Typophiles may be familiar with.\n\n"
    },
    {
      "time": "14 Jul 2005 — 4:03am",
      "content": "Best of luck!\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20131108163833/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "14 Jul 2005 — 5:40am",
      "content": "Fabulous collection of talented designers and wonderful faces. Best of Luck!\n\n"
    },
    {
      "time": "14 Jul 2005 — 6:10am",
      "content": "Amazing stuff. Tangentially, this raises a question I've had for some time. Pricing. The very attractive _Litteratra_ has a price tag of $135 per license. While I'm sure it is worth every penny, there are equally amazing fonts sold for prices in the $20-40 range. I read the license and it seems very user friendly. So, how do they arrive at this number? I mean, if a foundry produces an excellent text face and lets it go for $30/weight and BigPublishingCo. purchases two or three licenses and sets the next Harry Potter book in that face, shouldn't the foundry be paid more than say TheLittleGuyCo who uses it to print a run of 1000 pamphlets? Likewise, if MassiveRetailCo hires a hip new firm to handle there next international ad campaign, and the hip new firm purchases a hip new display face on MyFonts for $29.95, isn't the designer/foundry being ripped off? The whole workstations model of licensing seems flawed. That $135 buys you the right to have 4 copies of _Litteratra_ installed but says nothing about how many eyeballs see it. If it's used for a local marketing strategy and 100,000 people see it or if it's used for a national campaign and 1,000,000 people see it the price is the same? That doesn't seem right. So how does this stuff work?\n\n"
    },
    {
      "time": "14 Jul 2005 — 6:28am",
      "content": "Beautiful! I'll be browsing often...and hopefully licensing soon.\n\nMy thoughts on font pricing: I agree that it doesn't seem logical, but I don't think anyone would be able to adequately control the licenses, audit their use, or apply accountability very well. Print runs are often client-driven, not designer-driven. If the client bumps the print quantity up, but doesn't tell the designer (the license purchaser), that puts everyone in an awkward position financially and legally. Plus, people are accustomed to the current model, which favors their convenience, so I don't think a change would work too well. Isn't there a foundry that's testing a per-word traditional typesetting model where you pay a much lower per-character fee for an EPS of a headline or word set in their font? That seems like a more reasonable approach to making font commerce easier/more affordable for everyone. In the case of Literatra, imaybe it has to do with expected sales? Lower, more rarified demand means less repeats of per-unit profit, so they bump up the price to compensate? Text fonts don't really work individually, they require italics, etc., whereas Literatra is complete as-is? Maybe? Dunno.\n\nOf course, I write all of this as a type consumer, not a producer/retailer.\n\n"
    },
    {
      "time": "14 Jul 2005 — 6:57am",
      "content": "Litteratra has about 1900 glyphs, so I think it is worth the price.\n\nConsider this against some other fonts with enormous character sets. Linotype's [Palatino Linotype](http://web.archive.org/web/20131108163833/http:/www.linotype.com/57056/palatinolinotype-family.html) has 1325 glyphs per weight. Each wight costs 99 dollars (or Euros), before taxes. [Helvetica Linotype's](http://web.archive.org/web/20131108163833/http:/www.linotype.com/48344/helveticalinotype-family.html) weights cost the same, but have 1866 glyphs per weight.\n\nA \"normal\" font has 256 characters, and costs about $25. Maybe $21 at MyFonts.com.\n\n1900 divided by 256 is almost 7.5 (and just 7 x $20 would be $140).\n\nIf Karsten were working with old \"expert fonts,\" you'd have to buy at least seven fonts to get what you get in just one now. And just one font is way more convenient for the user than seven. So actually, I think that the price for Litteratra is fair, considering what you get!\n\nPlus, Karsten _is_ the \"little guy.\" He doesn't have a team of glyph drawers or OpenType programmers to help him out. If I remember correctly, this typeface has been in production for at least five years! I don't think it would be fair to expect him to sell a font—which very few fonts on the market can match in terms of capabilities, BTW—for just around $30. That isn't the direction that other \"real\" OpenType fonts are going in either.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20131108163833/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "14 Jul 2005 — 8:04am",
      "content": "_Isn’t there a foundry that’s testing a per-word traditional typesetting model where you pay a much lower per-character fee for an EPS of a headline or word set in their font?_\n\n[LettError](http://web.archive.org/web/20131108163833/http:/www.typophile.com/wiki/LettError) has developed [Letter Setter](http://web.archive.org/web/20131108163833/http:/www.letterror.com/lettersetter/index.html). And i believe that [House](http://web.archive.org/web/20131108163833/http:/www.typophile.com/wiki/House%20Industries) will be using this technology to do pretty much what you described to distribute the stuff they got from [PLINC](http://web.archive.org/web/20131108163833/http:/www.typophile.com/wiki/PLINC).\n\n"
    },
    {
      "time": "14 Jul 2005 — 8:17am",
      "content": "Noah, I think you've started a very interesting topic. But, I think for browsers of the site so they don't miss any vital information maybe another thread should be started.\n\n"
    },
    {
      "time": "14 Jul 2005 — 9:35am",
      "content": "\\> So how does this stuff work?\n\nNobody knows, exactly. :-)  \nBut there's something to be said for shooting for  \na higher price point in such an overcrowded field,  \nand one that's so easy on pirates.\n\n\\> LettError has developed Letter Setter.\n\nYes, arguably inspired by URW++'s earlier effort.\n\nhhp\n\n"
    }
  ]
}
