{
  "id": "13820",
  "title": "Century",
  "forum": "Home",
  "tags": [
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20150125063659/http:/typophile.com/wiki/Indices) : [Typefaces](http://web.archive.org/web/20150125063659/http:/typophile.com/wiki/Typefaces) : Century**\n\nTheodore Low DeVinne (1829—1914), printer of The Century magazine, designed a stronger, bolder and more readable face for the magazine and commissioned Linn Boyd Benton (1844—1932) of ATF to cut it.\n\nL.B. Benton cut it on the newly invented Benton punch-cutting machine and in 1895 was christened Century Roman. Afterwards, a companion face was created for ATF by L.B. Benton: Century no. 2, later called Century Broad-face.\n\nThis face became the basis for Century Expanded, designed by L.B.’s son, [Morris Fuller Benton](http://web.archive.org/web/20150125063659/http:/typophile.com/wiki/Morris%20Fuller%20Benton) (1872-1948) in 1902. Over the course of three more years, the italic, bold and bold italics were developed.\n\nThen after a few more years, Morris Fuller Benton developed Century Oldstyle.  \nIn 1915, redevelopment of Oldstyle face began and was renamed Century Book.  \nSoon after, ATF was approached by Ginn & Co., the textbook publisher, with a request for a new typeface for schoolbooks. M.F. Benton began review of research done at Clark University on the relationship between the legibility of type and the eyesight of children.\n\nConsequently, Benton increased the space between letters, the x-height of each letter, and the weight of each stroke, and balanced the color of the type by opening up the counters. The result was Century Schoolbook, completed in 1919.\n\nIn 1964 ATF commissioned [Charles E. Hughes](http://web.archive.org/web/20150125063659/http:/typophile.com/wiki/Charles%20E.%20Hughes) to design a new proportion for Century Expanded… the result, Century Nova, which was more condensed.\n\nUnder license from ATF, [Tony Stan](http://web.archive.org/web/20150125063659/http:/typophile.com/wiki/Tony%20Stan) designed the sixteen weight ITC Century family between 1975 and 1980 for International Typeface Corporation. It has the characteristic large x-height of 70s era ITC fonts. Some differences from Century are the missing serif on the lowercase h, m, n in the ITC. One view of ITC Century is that its color is not good at smaller text sizes, but its light weight is excellent at larger text sizes (eg 14 pt), especially the italic.\n\nNew Century Schoolbook was designed 1979-81 in the New York Lettering office of Merganthaler Linotype, based on Century Schoolbook. It was the second face, after [New Baskerville](http://web.archive.org/web/20150125063659/http:/typophile.com/wiki/New%20Baskerville), that was digitized and expanded using [Ikarus](http://web.archive.org/web/20150125063659/http:/typophile.com/wiki/Ikarus) (digital technology). The [Bitstream](http://web.archive.org/web/20150125063659/http:/typophile.com/wiki/Bitstream) version is a near exact copy, only being moved from a 54 unit to a 2000 or so unit design. [Matthew Carter](http://web.archive.org/web/20150125063659/http:/typophile.com/wiki/Matthew%20Carter) designed the Greek version of New Century Schoolbook.\n\nA recent, somewhat eccentric version of Century School Book is Grad by [Phil Martin](http://web.archive.org/web/20150125063659/http:/typophile.com/wiki/Phil%20Martin), digitized by [Mark Simonson](http://web.archive.org/web/20150125063659/http:/typophile.com/wiki/Mark%20Simonson).\n\n",
  "author": "William Berkson",
  "time": "13 Jul 2005 — 8:40pm",
  "uid": "1551",
  "comments": [

  ]
}
