{
  "id": "13822",
  "title": "angular script logotype",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "hello friends. I’d like some comments on an angular script logotype i’m working on as a personal project. I’m pretty inexperienced when it comes to drawing letters. My main concerns at this point are trying to get a nice even x-height across the lowercase letters and achieving bold, foward moving slant to the right and legibilty.\n\nHere is another go at it. Ive removed the flourishes from the W and increased the height of the middle hump. comments?\n\n| Attachment | Size |\n| --- | --- |\n| [workday\\_script01.gif](http://web.archive.org/web/20060522215627/http:/typophile.com/files/workday_script01.gif) | 6.61 KB |\n| [workday\\_script02.gif](http://web.archive.org/web/20060522215627/http:/typophile.com/files/workday_script02.gif) | 5.94 KB |\n\n",
  "author": "<a href=\"user/8295\" title=\"View user profile.\">workday</a>",
  "time": "<br>",
  "uid": "8295",
  "comments": [
    {
      "time": " 14 July, 2005 - 1:21am",
      "content": "Reminiscent of two scripts discussed [here](http://web.archive.org/web/20060522215627/http:/www.typophile.com/forums/messages/83/20332.html?1069226113).  \nThe main difficulty I have with reading it is the shape of the bowl on the y and the baseline of the W which is making the o seem high and breaks the angle of the lowercase. The two flourishes on the W and y are also fighting the direction of the lowercase, perhaps if you applied the same angle on the flourishes that might resolve it.  \nTim\n\n"
    },
    {
      "time": " 14 July, 2005 - 12:21pm",
      "content": "Russ,\n\nCheck out this typeface, it isn’t quite a script face, but it is a connected angular sans.\n\n[Lingua](http://web.archive.org/web/20060522215627/http:/www.processtypefoundry.com/typefaces/lingua/index.html) by [Eric Olson](http://web.archive.org/wiki/Eric%20Olson) of [Process Type Foundry](http://web.archive.org/wiki/Process%20Type%20Foundry).\n\n"
    },
    {
      "time": " 14 July, 2005 - 8:51pm",
      "content": "ive added a second version to my original post. how do i add images to my replies?\n\n"
    },
    {
      "time": " 18 July, 2005 - 11:21pm",
      "content": "You cannot in the new typophile. You have to add them to the top. I don’t like it but it’s the way it is for now. I am having trouble understanding how your type will work. Is the idea that you will type it & then Alter the baseline to be on an angle?\n\n"
    },
    {
      "time": " 19 July, 2005 - 8:29am",
      "content": "thats a shame about the image posting functionality.\n\nEbe, I am not designing a typeface. What you are seeing is the development of a script logotype. Is it unconventional to design a script on an angle? Should I, instead, design it on a horiztonal baseline and then skew the entire thing?\n\n"
    },
    {
      "time": " 19 July, 2005 - 2:20pm",
      "content": "Yes it is a shame. It gets in the way of efficient use of the boards!\n\n\\>No t a typeface\n\nOh! I thought it was a font that you could use to build a logo with….\n\nOkay that makes sense now.\n\nWhat is this for anyway? Can we have more context?\n\n"
    },
    {
      "time": " 18 August, 2005 - 12:12am",
      "content": "Russ, since you aren’t designing a “typeface,” I’m going to move this thread to the “logo” discussion area of the critique forum. Maybe you’ll get more feedback there!\n\n"
    }
  ]
}
