{
  "id": "1383",
  "title": "Improvements, suggestions, please!",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hi there!   \n   \nHere is a sample of a serif I'm currently working on. I've never done this before, so I'm anxious to hear your comments. The italics is killing me!   \n   \nBest,   \n   \nH\n\n",
  "author": "botvide",
  "time": "23 Sep 2003 — 9:44am",
  "uid": "2340",
  "comments": [
    {
      "time": "23 Sep 2003 — 11:09am",
      "content": "Personally I find it a little bit too \"classic\" for my own tastes, but it certainly looks well-made, at least from that sample. Anyway, if you could provide better sample it would be easier to spot problems. From that sample the only things I myself would suggest are:   \n- The \"A\" is too tall.   \n- The \"G\" needs work.   \n- The \"Q\" needs a much braver tail.   \n- The spacing is nice and tight.   \n- The italics is great [for this genre of face].   \n   \nBTW, it reminds me a little bit of Vendetta, and Scala Serif too.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Sep 2003 — 1:26pm",
      "content": "Hi again!   \n   \nThanks a lot for your comments. I think I agree with all of them. My problem is that I'm getting stuck. Everything has gone quite smoothly until now, but now suddenly everything I do seem to make things worse. And not being a type professional I think I need to stop and take a deep breath. And sleep. Goddammit, I haven't slept for two days because of this! Is this how you type maniacs lead your life? The last thing you think of before you fall asleep is a possible curve of a lc \"c\"?   \n   \nAnyhow, here is a pdf, which perhaps makes it easier to look at the font. Please, feel free to send comments - I'm listening. I just need to take a nap first!   \n   \nBest,   \n   \nH\n\n"
    },
    {
      "time": "23 Sep 2003 — 1:26pm",
      "content": "Hi again!   \n   \nThanks a lot for your comments. I think I agree with all of them. My problem is that I'm getting stuck. Everything has gone quite smoothly until now, but now suddenly everything I do seem to make things worse. And not being a type professional I think I need to stop and take a deep breath. And sleep. Goddammit, I haven't slept for two days because of this! Is this how you type maniacs lead your life? The last thing you think of before you fall asleep is a possible curve of a lc \"c\"?   \n   \nAnyhow, here is a pdf, which perhaps makes it easier to look at the font. Please, feel free to send comments - I'm listening. I just need to take a nap first!   \n   \nBest,   \n   \nH\n\n"
    },
    {
      "time": "23 Sep 2003 — 1:54pm",
      "content": "It looks like you're using overlapping letterform parts to make the letters... That makes it hard to appreciate what it will _eventually_ look like. I assume at least some of the irregularity is intentional though, and that I feel is a good thing in this case.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Sep 2003 — 2:40pm",
      "content": "Yes,   \n   \nyou're right that I have done some overlapping, but only at certain, for me, especially tricky parts, and only to get \"forward\", so I can move ahead, see what works, what does not, get the feel of at least some kind of holistic perspective. This is only a first rough draft, nothing more, just as I pointed out in the beginning. At this stage I am more interested in what creates a flow, not the individual letters (which, naturally, is the key anyway - but these I can work on from scratch as soon as I know my direction). It is not as if it is the last check before it goes to the type store. I am not interested in copying someone's work, rest assure.   \n   \nAnd Hrant, you're also right right about the irregularities. But some seem to disturb, others looks tempting to the eye. I just can't see any system in it. But you have to start somewhere, I guess.   \n   \nBest   \nH\n\n"
    },
    {
      "time": "23 Sep 2003 — 12:44pm",
      "content": "Botvide -- Can I ask you to post this sample in a different way? Can you enlarge the separate letters (x2), shrink the sample setting (x2) and change the color to black? Just to \"see\" things a little more in the black and white. Oh and save it as a .GIF not .JPG   \n   \n ![:-)](http://web.archive.org/web/20150417095531im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI really like the angularity of the italic.   \n   \nQuick thoughts:   \n• The w looks pinched from both sides on the bottom.   \n• The i seems taller than the normal x-height.   \n• The g seems to be falling backward.   \n• The v seems to be leaning forward.   \n• Perhaps the G could become more Elzevirian.   \n• The k seems a bit tall, the x-height portion of it.   \n   \nAnd, I agree with Hrant's remarks. Accept, of course, the classic remark. I'm all about the classic.\n\n"
    }
  ]
}
