{
  "id": "1384",
  "title": "Those Wild & Crazy Font Guys!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Okay, so most of you professional types already know about this site, but for those of us who might not...check out [www.crank.com](http://web.archive.org/web/20050516140936/http:/www.crank.com/). Almost all my graphic/web design is for non-profs for free and most of them are for kids. Crank has some really fun/wacky fonts. I know they aren't up to Adobe standard but in the right situation can be just the right thing. I'm going to purchase several for a website I'm currently designing. So if you're looking for something really off the beaten type path, check this site out. As a hockey mom, I think the Candian fonts really got to me! They actually have some fairly decent fonts as well. Enjoy! (Some of the type descriptions are worth visiting on their own)\n\n",
  "author": "figrsk8r",
  "time": "Tue, 2003-09-23 12:22",
  "uid": "2328",
  "comments": [
    {
      "time": " Tue, 2003-09-23 12:27",
      "content": "I no, I no...too many late knights werking. Can't spel. CANADIAN (caught it as I clicked the post button)\n\n"
    },
    {
      "time": " Tue, 2003-09-23 16:59",
      "content": "I guess even us old codgers can learn something new everyday! I guess it's a blessing to know that even with very little sleep and kids the brain still works enough to laugh at your mistakes. Didn't even know it was there, let alone what it was for.\n\n"
    },
    {
      "time": " Tue, 2003-09-23 20:33",
      "content": "Are you sure that's a font site? It doesn't seem like there are any fonts there.\n\n"
    },
    {
      "time": " Tue, 2003-09-23 21:13",
      "content": "Were you thinking of chank?\n\n"
    },
    {
      "time": " Tue, 2003-09-23 21:53",
      "content": "See I do need to get some sleep! You are correct.   \n [www.CHANK.com](http://web.archive.org/web/20050516140936/http:/www.chank.com/) Fruedian slip, who knows maybe crank.com is just my permanent state of mind these days.\n\n"
    },
    {
      "time": " Tue, 2003-09-23 21:57",
      "content": "Well, in many ITC faces they're almost the same.   \n   \nhhp\n\n"
    }
  ]
}
