{
  "id": "13860",
  "title": "Website help",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am designing this site for myself and I am a terrible customer. I have changed my mind about type so many times that I am now totally confused. I would appreciate any advice you can give me. Attached are examples of my home page and one of my gallery pages.\n\nI would also be interested in knowing if my colors appear putrid on your screen.\n\nThanks for your time, I would really like to make this look better.\n\nSharon\n\n| Attachment | Size |\n| --- | --- |\n| [home.jpg](http://web.archive.org/web/20080324121119/http:/typophile.com/files/home.jpg) | 23.76 KB |\n| [Nantucketgallery.jpg](http://web.archive.org/web/20080324121119/http:/typophile.com/files/Nantucketgallery.jpg) | 43.22 KB |\n\n [‹ Recipe card typography](http://web.archive.org/web/20080324121119/http:/www.typophile.com/node/13944 \"Go to previous forum topic\") [InDesign: Page/spread setup of self-published book ›](http://web.archive.org/web/20080324121119/http:/www.typophile.com/node/13436 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080324121119/http://www.typophile.com/user/3775\" title=\"View user profile.\">Sharon Van Lieu</a>",
  "time": "<br>",
  "uid": "3775",
  "comments": [
    {
      "time": " 14.Jul.2005 1.37pm",
      "content": "Sharon,\n\nI think it’s great...  \nUnderstated and classy.  \nTo my eye, the only thing that looks off is the spacing on “Photography.” The O-G-R-A needs to be opened up just a tad more.\n\nGood luck with the site.\n\n"
    },
    {
      "time": " 14.Jul.2005 1.40pm",
      "content": "Thank you, Norbert. That means a lot to me!\n\nSharon\n\n"
    },
    {
      "time": " 14.Jul.2005 1.51pm",
      "content": "Are the two posted files the first page, and the second when you click on a gallery?  \nI absolutely love your home page, it just seems the gallery page could tie in with the first better. Suggestions anyone?\n\n"
    },
    {
      "time": " 14.Jul.2005 1.59pm",
      "content": "Yes, that’s right Eric. There will be another gallery page for Texas which will be the same format as the Nantucket gallery page and then a contact page. Any suggestions will be appreciated.\n\nSharon\n\n"
    },
    {
      "time": " 14.Jul.2005 10.40pm",
      "content": "I think the colors - black brown cream & white are a little too ’done’ in the photography world. This was fashionable in ’93. I would choose different colors to be more distictive. I realize your is not the fashion business where you can be ( & should be ) black one moment & magenta the next - but even so.\n\nGalleries are always bloddy shirking the identity aspect ( YES, shirk!) and I cannot figure out why. Maybe it’s a lack of cash... But it’s like they all have to wear the same little black dress. Yes, it’s fine but isn’t there something more that could be done? Maybe this sounds too heavy. I hope not. I want to encourage. I really do.\n\nI think the buying public has been in enough Pradas, Anthopologies, L’Occtaines and other chain boutiques with wild colors - so now - an art gallery - even a photo gallery can & should get do more. The bar has been raised!\n\nChances are your customer has a vivid red, blue or green bedroom now.\n\nDo you see what I mean?\n\nLive a little.\n\n"
    },
    {
      "time": " 14.Jul.2005 11.24pm",
      "content": "Eben, thanks for your comments. I do get your point and I’ve noticed the color choices you’ve mentioned in design magazines etc. Nantucket is pretty conservative, but you are right in saying that my customers may not be. I’ll give it some thought.\n\nYou didn’t sound too heavy at all. I appreciate your thoughts.\n\nSharon\n\n"
    },
    {
      "time": " 15.Jul.2005 12.17am",
      "content": "Actually as a gallery owner maybe you can speak a bit more about how you think about your business & its - identity - logo - colors - etc. I was expressing some frustration - \\*but also my lack of insight\\*. I know thare is a minimalist tradition with art galleries in Soho NYC - but museums & galleries do seem to be moving away from black white & grey, classic serif fonts or classic sans serif fonts & finding other ways of ’framing’ ( not literaly ) the art they present. How do you think about your business identity? How do you think about that ’framing’? What is their relationship?\n\n"
    },
    {
      "time": " 15.Jul.2005 1.01am",
      "content": "I’m not a gallery owner, just a photographer. I started with that fisheye picture of the stairs on my home page as inspiration. I pulled the colors from that. I thought about the black/grey thing but I guess I thought the russet color would make it more distinctive.\n\nMy business identity would be how I see my work. I have a unique eye and I prefer simple compositions. I don’t shoot something because I think it will sell, but rather because I think it will be a good picture according to my standards. My Nantucket pictures have been described as evoking an earlier time here. My Texas pictures are more quirky. I do fine art photography only.\n\nSo I want to frame my pictures as my art, how I see things, and that I think they will stand on their own. I want to show my work simply, without apology.\n\nYou have made me think differently about this and I thank you for that.\n\nSharon\n\n"
    },
    {
      "time": " 15.Jul.2005 3.54am",
      "content": "Sharon, my opinion don’t change the colors they are neutral and the focus is on your work. I love how fast the pages load, good work.\n\n"
    },
    {
      "time": " 15.Jul.2005 6.52am",
      "content": "Sharon,\n\nThe examples look very good. Great to see tasteful restraint - especially on the web - it’s like balm for the eyes. I agree with Dan about the colour. Maybe the rounded shapes on the main page could be used in some way on the gallery pages to tie everything together.\n\nI would suggest using the same typeface that you’ve used for Pearlstreet Photography for the navigation and any other text, but in upper and lower case. The benefits being a unified, strong look to the pages (which seems to be the effect you’re after). A two typeface solution would be the way to go if there were pages with a lot of text, but from the examples you’ve posted I don’t think this is the case.\n\nNavigation wise, assuming that the two main sections of the site are Galleries and Contact I would be inclined to have a different type size for the gallery locations as they are a sub level of Galleries, and remove the coloured square from Contact. You could then use the two remaining colours to differentiate the gallery pages of the two locations. All you’d need would be another coloured square for Texas once you added it to the list.\n\nHope this helps\n\n"
    },
    {
      "time": " 15.Jul.2005 8.20am",
      "content": "Thank you both. Chris, that’s what I needed to know about the type. Combining different typefaces is not my strong point.\n\nThanks again,\n\nSharon\n\n"
    },
    {
      "time": " 15.Jul.2005 1.18pm",
      "content": "Sharon do you know about Lomography.com? I have a Zero Image 35mm Pinhole camera I got from them. You can see my most recent shots at:\n\n[http://homepage.mac.com/dgweaver53m](http://web.archive.org/web/20080324121119/http:/homepage.mac.com/dgweaver53m \"http://homepage.mac.com/dgweaver53m\")\n\nI also have a bunch of pinhole camera shots of The Gates if you are interested.\n\n"
    },
    {
      "time": " 15.Jul.2005 1.36pm",
      "content": "Now that’s cool. I’ve never used a pinhole camera although I’ve heard of them. How do I see your Gates shots? I looked on the lomography site and saw the fisheye camera they sell. Have you used that? I’m going to check that site out more thoroughly.\n\nSharon\n\n"
    },
    {
      "time": " 15.Jul.2005 5.09pm",
      "content": "I’ve seen some increadable shots from homemade pinhole cameras at school. Black and White seems to work really well. Gives everything a really ethereal quality.\n\ncheckitout. ..  \n [http://www.digitalwhiplash.com/arts/about3dark.html](http://web.archive.org/web/20080324121119/http:/www.digitalwhiplash.com/arts/about3dark.html \"http://www.digitalwhiplash.com/arts/about3dark.html\")\n\n"
    },
    {
      "time": " 15.Jul.2005 5.57pm",
      "content": "I like the idea of distorting the paper. I thought those were really cool, especially the space needle one. Thanks for the link.\n\nSharon\n\n"
    },
    {
      "time": " 15.Jul.2005 10.51pm",
      "content": "Regarding the colour scheme, there’s of course a reason why so many photo galleries use black/grey/white: it foregrounds the work. I’d agree with previous comments about sticking to a neutral colour scheme and let the work do the talking.\n\nWhile I agree with Chris’s thoughts on the typeface(s), I can understand that you may wish to use a second typeface apart from the Orator on a purely technical basis: to avoid having to set text as images. (Unless you are intending of working in flash that is.)  \nI like the Orator, and would say that any more-or-less ’websafe’ type, whether sans (Arial, Verdana) or serif (Georgia, Courier), would do fine as a compliment. Since Orator is a typewriter font, perhaps Courier could be an interesting alternative?  \nYou need to decide whether to use all-caps or not (compare the image caption with the section heading). Image caption, which is off-center, would perhaps be better left-aligned?\n\nAre all your photos portrait format? If not so, it would be interesting to see how you treat a landscape/square format image.\n\nYou may be interested in looking at the work of [adoptdesign](http://web.archive.org/web/20080324121119/http:/www.adoptdesign.dk/), who has made quite a few great gallery sites, for inspiration.\n\n"
    },
    {
      "time": " 15.Jul.2005 11.06pm",
      "content": "Just because they work okay doesn’t mean that they work great. That said great work can be done in any pallette. Even the one you are working in. I just thought it seemed dated as I found it. So far typophiles seem to disagree. But then they are typophiles - not designers maybe.... Maybe that will be good for stiring the pot!\n\nThe idea of working in a really classic pallette appeals to me much more.\n\n"
    },
    {
      "time": " 15.Jul.2005 11.51pm",
      "content": "<cite>“Just because they work okay doesn’t mean that they work great. That said great work can be done in any pallette.”</cite>  \nAbsolutely. I agree 100%. I just don’t agree with the idea that “used a lot” equals “dated”.\n\n(Eben, what’s the status of your APT?)\n\n"
    },
    {
      "time": " 16.Jul.2005 3.29am",
      "content": "To my eye the P of your logo looks a little condensed especially as an initial cap and the ST kerning could be a touch tighter. On the first page the menu seems too close to the logo. On the second the Title and the images don’t seem to have a relationship to the russet block and the enlarged image, I feel that the image caption could be removed from the frame or the frame extended at the bottom to accommodate it, as it is a bit intrusive and the alignment is troubling. Try using one face (as recommended above) with upper and lowercase for the navigation and captions and solus uppercase reserved for the logo. The colours combine well and are dark/neutral.  \nTim\n\n"
    },
    {
      "time": " 16.Jul.2005 8.31am",
      "content": "I’m really interested in the color argument. I would have called my site more of a brown site than a gray or black site which are the colors I see in most of the photography sites. It doesn’t sound like that’s how others perceive it though. But I would agree that the design of the gallery page is lacking. I’ll work on that.\n\nThanks for all type advice. I’ll incorporate that this weekend.\n\nEben, thanks for speaking your mind. I don’t want to be too “set in cement”.\n\nSharon\n\n"
    },
    {
      "time": " 16.Jul.2005 8.40am",
      "content": "Ah, I forgot to answer Fredrik. Most of the pictures are in landscape format and I fit in a couple of panos also. I’ll repost a picture this weekend after I rework things a bit.\n\nSharon\n\n"
    },
    {
      "time": " 18.Jul.2005 12.40am",
      "content": "Dated is obviously in the eye of the beholder. Completely.\n\nSharon, I’ll be keen to see you continue to try things out. I mostly want to encourage you to find a design that isn’t merely conventionally elegant but is harmonious with yourself & your clients. With yourself first & foremost. No matter what I like - or anybody else. I actually think that will improve business for you & make you happier too.\n\nFredrick, APT is still in testing mode - I need to get access to a high end laser printer to do some final checking. Then I will probably get them out into the world with myfonts.\n\n"
    },
    {
      "time": " 18.Jul.2005 2.48am",
      "content": "Sharon I’ll post some of my pinhole shots of The Gates on my site today. I had over 30 mgs of them and took them off to post some of the newer stuff. Being slow exposure 5 seconds for 100 ASA color film I got great results from the wind blowing. It was the only February that I looked forward to the snow and wind.\n\nAs for your site, it begs the question, what do you want your viewers to notice? The site or the work. If its the work then make the site plain vanilla, if its the site then jazz it up.\n\n"
    },
    {
      "time": " 18.Jul.2005 4.15am",
      "content": "Sharon I just put up the folder: The Gates Zero Pinhole Camera Shots, at my site, enjoy.\n\nI also love the newest camera they have at Lomography, its a Chinese camera that has a rewind feature, designed for double exposures and best of all its all of about $50. My Zero 35mm Pinhole Camera (made of Teak and Brass) only cost me $140. They have great bargins there as long as you are looking for the unusual.\n\n"
    },
    {
      "time": " 18.Jul.2005 4.50am",
      "content": "Nice shots, Dan!\n\nI’m into the Lomo thing too, but I’m not sure about the rewind camera - why not just pick up a half-decent SLR, shoot a roll and manually rewind then shoot again to get your double exposures - then you’re not stuck with something with a dubious lens on it! I recently dusted off my Minolta XG-M SLR, and am going to try and use it more, it fell out of favour because of my little Lomo, so I’m going to run some slide film through it, get them cross-processed (with white borders, natch) and see what I get. I think because shops are pushing digital, it should adversely effect the prices of old-school SLRs (I’m sure now’s the time to try and get your mitts on an Olympus OM-1)\n\nI think the Lomo thing is fuelled by shrewd marketing... I’ve got an LC-A but having bought my girlfriend the coloursplash, it’s put me off the rest of their products, it feels nasty and the results haven’t been great from ours (I should’ve bought the coloursplash flash for the LC-A instead). Having said that, I like what I’ve seen from your pinhole camera, nice distinctive results.\n\nYou might be able to answer this - what’s the best slide film to run through an LC-A? I keep experimenting but each brand seems to give a particular cast to the prints, most seem to give a greeny cast to the prints, even when you’ve got a strong sky blue for example!\n\nSorry this post’s gone so wildly off topic! Ahem... back to the typefaces...\n\nSi\n\n"
    },
    {
      "time": " 18.Jul.2005 6.31am",
      "content": "Dan, I couldn’t locate your Gates folder. Could you post a link? I’m going to get one of those cameras when I get back from vacation. I like the option to get something different. Have you used a lensbaby? I wonder how they compare.\n\nSi, not off-topic at all.\n\nStill working on the site. Will post the final result.\n\nSharon\n\n"
    },
    {
      "time": " 18.Jul.2005 1.40pm",
      "content": "I’ve read about the Lensbaby it sounds like fun. Sure Lomography is about selling products but they are also about old school photography. I have nothing against digital photography, it has introduced people to photography who might not have tried it because of film and processing. A percentage of people who shoot digital will get interested in the roots of photography and might even discover their creative roots in the media. I will check my site and see why The Gates photos aren’t showing.\n\n"
    },
    {
      "time": " 18.Jul.2005 2.24pm",
      "content": "Sharon I fixed the problem, I feel like Homer Simpson d’hoy, I needed to make a page for the images I uploaded. The Gates are now available for viewing.\n\n"
    },
    {
      "time": " 18.Jul.2005 3.02pm",
      "content": "Dan, this camera does give a feeling to these pictures that I think is suited to something like the Gates. Wind 2, for example, and Cherry Hill 2 and Under the Bridge. They all seemed so temporary, just like the Gates themselves. (hope that makes sense) I think I’ll have to try this myself. Thanks!\n\n"
    },
    {
      "time": " 18.Jul.2005 4.34pm",
      "content": "_home.jpg_  \nThe coloring system which based on dark background with a lighten object inside the design which looks like if it is the light source of all the design is very ok in my opinion with the photography issue. It reminds me of the old camera when you get inside dark room and see the world from a rounded lence. I guess it will not remind all people with same but I guarntee the eyefish picture which make person say what a strange prespective? is a good way to drive people more that site is about photographer even before we read the text.  \nBut personally before I read the text, I felt that it is a site about decoration.. because the image it self is for an indoor well modern decorated space, may be the font also drive me so.  \nAt this manner I will advice you to change the picture with something more imaginative .. may be the sky? may be a strange portrait? something say that you are into artistic thing done by photography?\n\nI want to add that the white wall which has some value of lighten gray is not that rich color with browns and yellowish colors.. it looks alittle separated of the composition. may be the yellow light over is trying to break it.. and the dynamic curve of the form it colors makes a cool shock for the eye.. and make it move fast and dynamically inside the design, but I am still NOT 100% sure of it.\n\nI think regarding you put your picture in a circle, and regarding there is no straight vertical line inside the picture neither a straight horiziontal line, there is a very dynamic movement for eye and you need a strong CROSSED lines in your design. You already made horiziontal lines by the type.. but the only strong vertical element is being driven for me by “P” letter, and the 3 squares under it.. try to make a long line in gray in vertical under that line and make sure it will have some empty space between it and the bottom edge of the design, and enjoy the stability.\n\nI think the space between “T” letter (of word Pear Streer) and right edge is need to be more bigger just to give some air.\n\nIn fonts I am not 100% agree with makeing a contrast between serif and sans serif fonts in this dynamic design, I think you may use 2 sans serif fonts ( to increas the feeling of modernism ) but make the contrast is based on its form, a font based on letters that are shorter than the other font as an example. photography word may need to have better appear and you may make it italic.\n\n_Nantucketgallery.jpg_  \nThis design is very prof. but I am still giving the same note & advice about fonts.\n\nThank you\n\n"
    },
    {
      "time": " 18.Jul.2005 5.50pm",
      "content": "Thank you for such a detailed response. I will certainly study it carefully.\n\nYou have all been more helpful than I could have dreamed.\n\nSharon\n\n"
    },
    {
      "time": " 18.Jul.2005 9.42pm",
      "content": "You’re more than welcome, Sharon.\n\n"
    },
    {
      "time": " 18.Jul.2005 10.31pm",
      "content": "Sharon, will you be posting any new stuff?\n\n"
    },
    {
      "time": " 18.Jul.2005 10.38pm",
      "content": "Yes, I will have something soon. I know I’m slow. :-) You guys have given me a lot to think about.\n\nSharon\n\n"
    },
    {
      "time": " 18.Jul.2005 11.24pm",
      "content": "No rush, I was just wondering. And Curious. I hope you post messed-up & in-process stuff too & not just polished ideas. I’d like to understand your thinking...\n\n"
    },
    {
      "time": " 19.Jul.2005 8.14am",
      "content": "I’ll do that.\n\n"
    },
    {
      "time": " 19.Jul.2005 7.25pm",
      "content": "I think you are all going to find me dull. I can’t seem to disconnect from my original design in any significant way. When I started, I liked Bell Gothic for the Nantucket and Texas titles so I went back to that and tightened up the thumbnails a bit. I incorporated the advice about the font on the galleries section of the home page but I’m not sure about Bell gothic there. Once you choose a circle or square, you have built yourself a corral...at least for me it feels that way.\n\nPlease let me know if the changes have totally missed the mark. I haven’t tried all the suggestions yet, especially the one about crossed lines on the home page. I don’t think I understand that one so any clarification would be great.\n\nThe gallery page is with the largest picture I would possibly use.\n\n[http://www.acksite.com/fmforum/home2.jpg](http://web.archive.org/web/20080324121119/http:/www.acksite.com/fmforum/home2.jpg \"http://www.acksite.com/fmforum/home2.jpg\")\n\n[http://www.acksite.com/fmforum/Nantucket2b.jpg](http://web.archive.org/web/20080324121119/http:/www.acksite.com/fmforum/Nantucket2b.jpg \"http://www.acksite.com/fmforum/Nantucket2b.jpg\")\n\nThanks,\n\nSharon\n\n"
    },
    {
      "time": " 19.Jul.2005 7.51pm",
      "content": "As in photography, crispness can be valuable in onscreen type.\\*  \nHere’s some quick splicing I just did - I hope that’s OK with you.  \n [http://www.themicrofoundry.com/other/sharon.jpg](http://web.archive.org/web/20080324121119/http:/www.themicrofoundry.com/other/sharon.jpg \"http://www.themicrofoundry.com/other/sharon.jpg\")\n\n\\* Although the JPEG artifacts (especially in “PHOTOGRAPHY”) reduce the effect...\n\nSome parts (like the copyright string) probably work better for you than others (like “Nantucket”), but I just wanted to show off I guess...\n\nhhp\n\n"
    },
    {
      "time": " 19.Jul.2005 8.05pm",
      "content": "Oh, that’s nice, Hrant. Now, how did you do that. :-)\n\nSharon\n\n"
    },
    {
      "time": " 19.Jul.2005 8.14pm",
      "content": "Those are [the Regular weights of] [the] three sizes of Mana, my first -and still only- grayscale pixelfont family. The two larger sizes (16 and 13 PPEM) are available now (through ultrafonts.com), while the smallest size (11 PPEM) will be available in two weeks. Each has a bold, and a darker alternate cut\\* (and 1400+ kerning pairs). A 9 PPEM size is... intended.\n\n\\* For setting light-on-dark text (and for use in “native” Windows).\n\nNow back to your regularly scheduled programming...\n\nhhp\n\n"
    },
    {
      "time": " 19.Jul.2005 8.17pm",
      "content": "Actually, the only thing there from the 13 PPEM size is that initial “P” in “PHOTOGRAPHY”... Here’s a full view of the 13:  \n [http://www.daidala.com/mana-13.html](http://web.archive.org/web/20080324121119/http:/www.daidala.com/mana-13.html \"http://www.daidala.com/mana-13.html\")\n\nhhp\n\n"
    },
    {
      "time": " 19.Jul.2005 8.24pm",
      "content": "I like that. Did you see the last post I made of the gallery page? Could I use mana for the photography and copyright and picture titles and leave Nantucket in Bell Gothic or would that not work? I definitely like the readablility and crispness of your font.\n\n"
    },
    {
      "time": " 19.Jul.2005 8.35pm",
      "content": "I think Bell and Mana might indeed work well together, since they’re both narrow and somewhat ridig. Some of the characters (like the “g”) might clash, but I guess if the sizes are different enough few people would mind.\n\nhhp\n\n"
    },
    {
      "time": " 19.Jul.2005 8.38pm",
      "content": "Thank you,\n\nSharon\n\n"
    },
    {
      "time": " 19.Jul.2005 9.23pm",
      "content": "Some aspects of on screen crispness have to do with the environment you use to set text in. For example Macromedia’s Fireworks did a great job of making texts pixel aligned athe base where as photoshop has always been a bit of a pig where this is concerned even if it does have 6 kinds of font smoothing to pick from now. Image ready might be better but I don’t know for sure....\n\n"
    },
    {
      "time": " 19.Jul.2005 9.24pm",
      "content": "Adobe Imageready that is.\n\n"
    },
    {
      "time": " 19.Jul.2005 10.52pm",
      "content": "I’ll try that Eben. Thanks!\n\n"
    }
  ]
}
