{
  "id": "13882",
  "title": "What is this mystery machine??",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everyone, I'm hoping someone here might be able to identify this machine.\n\nSomeone in rural Western New York called us up here at the Cary Collection. She found a machine in a garage, and thought it might be a piece of printing equipment. The previous owner of the house used to work at Kodak. It was hard to describe over the phone, so we sent one of our student assistants on a road trip to take pictures.\n\nThe machine is in pieces, but you can see it has a keyboard, and a cluster of wheels/gears with letters. Any chance someone out there might have an idea what this thing might do? We can't figure it out.\n\nThe pictures are here: [http://wally.rit.edu/cary/mystery\\_machine/mystery\\_machine.html](http://web.archive.org/web/20131020030516/http:/wally.rit.edu/cary/mystery_machine/mystery_machine.html \"http://wally.rit.edu/cary/mystery\\_machine/mystery\\_machine.html\")\n\nAny help would be appreciated! :)\n\n",
  "author": "marnie",
  "time": "15 Jul 2005 — 12:43pm",
  "uid": "6115",
  "comments": [
    {
      "time": "15 Jul 2005 — 5:04pm",
      "content": "I can likely answer your question when I get up to Oregon. I have reference material that should lead me to an explanation. It may be an important machine, although the paint points otherwise.\n\nMeanwhile you should write the Printing Museum at Andover.\n\nGerald Giampa\n\n"
    },
    {
      "time": "16 Jul 2005 — 6:23am",
      "content": "Yes, we sent the photos to the Printing Museum as well. If we hear back from them first, I'll post the answer here.\n\nThanks Gerald!\n\n"
    },
    {
      "time": "16 Jul 2005 — 5:35pm",
      "content": "As one of the evaluators on the UK Antiques Roadshow once said about an unidentifiable obect: \"I don't know what it is, but it looks like a very good one\".\n\nJim\n\n"
    },
    {
      "time": "16 Jul 2005 — 6:16pm",
      "content": "The default answer in cases like this should be \"a trouser press\"\n\nCheers, Si\n\n"
    },
    {
      "time": "16 Jul 2005 — 9:56pm",
      "content": "It appears to be a metal type embossing/debossing machine for stamping copy and numbers into a hard substrate. The large flywheel and pneumatics point to a heavy industrial machine.  \nThat is only an educated guess.\n\ngln\n\nPosted with 100% post-consumer recycled electrons.\n\n"
    },
    {
      "time": "17 Jul 2005 — 2:02am",
      "content": "Without any doubt whatsoever: an anti-magnetic triple-expansion kerning modulator with a tertiary integral phase adjust by-pass switch... latin version.\n\nAll you have to do is ask.\n\n"
    },
    {
      "time": "17 Jul 2005 — 3:14pm",
      "content": "Question remains, where on this device would one insert the dilythium crystals?\n\nSi\n\n"
    },
    {
      "time": "17 Jul 2005 — 9:27pm",
      "content": "Right next to the Flux Capacitor, of course !!!\n\n"
    },
    {
      "time": "18 Jul 2005 — 10:26am",
      "content": "Without any actual expertise to back up my hypothesis I would have to guess that \"it\" is some sort of Rotary Moveable Type machine which has been motorized...\n\n~ Rusty\n\n"
    },
    {
      "time": "1 Aug 2005 — 8:36am",
      "content": "Mystery solved: the machine is a \"Graphotype.\"\n\nThe Graphotype was used to stamp rows of type into small metal plates. Then, you could print from the plates with an Addressograph machine. For example, you could use the Graphotype to set plates for all the names and addresses on your mailing list. Then, you could print all your envelopes with the Addressograph.\n\nThe Graphotype was also used to make dog tags!\n\nEvidently, there are many of these, and as with anything these days, you can find them on eBay.\n\nMore pictures and information here: [http://www.dogtagsrus.com/addressograph%20graphotype.htm](http://web.archive.org/web/20131020030516/http:/www.dogtagsrus.com/addressograph%20graphotype.htm \"http://www.dogtagsrus.com/addressograph%20graphotype.htm\")\n\n"
    },
    {
      "time": "1 Aug 2005 — 1:29pm",
      "content": "Yes indeed, Marnie is 100% correct - the machine in the photo is an Addressograph Graphotype. The model in the photo is either an 6340 (emobsser)((characters raised as on a credit card)) or a 6341 (debosser)((characters indented in like on a dog tag)).\n\nThis machine has seen better days. It is missing key parts and would cost a fortune to rebuild. It appears that this machine is destin for the scrap yard - it is such a shame - these machines are great that is why we collect them and preserve them. This machine would have been made between 1926 and the mid 1960's. Currently we have 14 project machines and they can be reviewed at [http://www.dogtagsrus.com/projects.htm](http://web.archive.org/web/20131020030516/http:/www.dogtagsrus.com/projects.htm \"http://www.dogtagsrus.com/projects.htm\")\n\nThe Graphotype is made of cast iron and as such the 6300 class machines weigh about 390 lbs. each. The machines ran on a 1/4 hp 110 Vac motor. As delivered from the factory the machine would have had a clipboard to hold copy and a work light for the operator. The original factory color would have been either black, a real funky dark green or grey.\n\nThe Graphotype was a support machine that made the plates that were used by the Addressograph for addressing documents. In the early 1940's the military adopted the Graphotype to make dog tags.\n\nThe Graphotype is a machine that shaped our nation but alass the computer has religated them to the local land fills and scrap yards. At present you can pick up almost any newspaper in a large city and you will find in the obituaries that someone was at one time or another an addressograph operator . . . it is so sad to see the machine in this photo in such a state of disrepair it makes me think of all the stories that machine might hold of the people that used it.\n\nIf you wish to review more information about these machines you can visit: [http://www.dogtagsrus.com](http://web.archive.org/web/20131020030516/http:/www.dogtagsrus.com/ \"http://www.dogtagsrus.com\") and click on the history and information section. We are constantly updating our information and are always seeking information and photographs of Addressograph Graphotype machines.\n\nIf you have ANY information on ANY graphotype machines, new, old, forsale, in a colletion, in a dump or where ever or you may have photos of these machines you may contact me direct at [tagtech@dogtagsrus.com](mailto:tagtech@dogtagsrus.com)\n\nThank You  \nKobie\n\n"
    },
    {
      "time": "1 Aug 2005 — 6:16pm",
      "content": "This kind of machine was used for the original metal \"charge Plates\" issued by department stores beforte the era of credit cards. Ah, good old Boggs & Buhl.\n\nChrisL\n\n"
    },
    {
      "time": "1 Aug 2005 — 8:52pm",
      "content": "If only everything came in a real funky dark green.\n\n"
    }
  ]
}
