{
  "id": "13887",
  "title": "digital to metal does anyone do it?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was just wondering if one were so inclined, could one have a font made from, well, a font? Are there foundries that do this and are there books printed with metal and ink where the metal was created directly from digital outlines? That would be pretty cool, I think.\n\n [‹ NY Times Magazine - Type Time](http://web.archive.org/web/20071126132320/http:/www.typophile.com/node/13905 \"Go to previous forum topic\") [1967/1968 Ganster Typography ›](http://web.archive.org/web/20071126132320/http:/www.typophile.com/node/13780 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071126132320/http://www.typophile.com/user/5267\" title=\"View user profile.\">grod</a>",
  "time": "<br>",
  "uid": "5267",
  "comments": [
    {
      "time": " 15.Jul.2005 6.41pm",
      "content": "\\>if one were so inclined\n\nhow much money would ’one’ be willing to spend? ;-)\n\nI’m sure all the equipment needed to create matrices based on some kind of printed master still exists in museums, and at least a few of the craftsmen who knew how use them are still alive. The process would require quite a bit of human interaction.\n\nCheers, Si\n\n"
    },
    {
      "time": " 15.Jul.2005 6.44pm",
      "content": "I think Jim Rimmer can do it.  \nAnd maybe Neufville in Barcelona.\n\nhhp\n\n"
    },
    {
      "time": " 15.Jul.2005 7.04pm",
      "content": "i was gonna say [Jim Rimmer](http://web.archive.org/web/20071126132320/http:/www.typophile.com/wiki/Jim%252BRimmer). He has done some stuff for us at [P22](http://web.archive.org/web/20071126132320/http:/www.typophile.com/wiki/P22).  \nSee this thread: [http://www.typophile.com/node/12554](http://web.archive.org/web/20071126132320/http:/www.typophile.com/node/12554 \"http://www.typophile.com/node/12554\")\n\n"
    },
    {
      "time": " 15.Jul.2005 7.22pm",
      "content": "I should mention that “one” is not me, I’m so broke (and without income) right now that I skip meals to save money for food. I’m just curious. There are custom books, art-type things, etc. printed with metal and I wondered if any of these companies have taken the step of casting metal from digital.\n\n"
    },
    {
      "time": " 15.Jul.2005 10.15pm",
      "content": "Paul, seems as if Grod wants the metal type to be as close to the digital orignal as posible - without any artistic interpretation a traditional punch-cutter might insert into the work. Can Jim provide that type of service? Any idea of how long it would take him to produce a set\\* of punches for Verdana for example?\n\nCheers, Si\n\n\\*just the lower ascii, no need to do the full WGL4 and Vietnamese.\n\n"
    },
    {
      "time": " 16.Jul.2005 12.46am",
      "content": "I’ve made a lot of magnesium cuts from digitally-set type and art. I once had planned on making a full font of digitally-altered Mrs. Eaves; I had straightened the italic and was using it for a project, but eventually I only had a portion of the font made and never used it as the metal was damaged.\n\nIf you don’t mind wood backing - I know this isn’t exactly what you had in mind - Valley Graphic Arts Engravers in Sacramento are inexpensive and do a great job.\n\nOf course, this isn’t casting, but rather engraving - a very different situation. I bet you could do this relatively easily with photopolymer with magnetic backing. Talk to Gerald Lange, I bet he’s experimented with this.\n\n"
    },
    {
      "time": " 16.Jul.2005 4.21pm",
      "content": "Si\n\nI have recently been cutting in metal some designs of mine that I had previously done in digital format. One was cut from the digital version called Lancelot Light Titling, into metal as Duensing Titling in five sizes. One I just sompletd the cutting of is Alexander Quill cut in 14 point and named simply Quill in its metal clothing.\n\nI have cast about a 100 pounds of type from the matrices and will very likely have to cast another 100 or so pounds for the little book I am doing on my Press and Foundry.\n\nLast year I cut a 14 point metal version of Carl Dair’s cartier. I was an absolute slave to Dair’s original drawings in the various steps in cutting metal, so I think it’s a good match.\n\nThere are few individuals out there cutting metal type in both direct matrix, and punch form. I can’t speak for their accuracy in translating a design from digital to lead, if indeed any of them have done that, but I feel that I have gained sufficient skill and knowledge from my own experimentation to do so as far as accuracy of form and weight is concerned. You should keep in mind that even if a tyope is cut spot-on to the original digital font it will look different when printed letterpress as opposed to being litho’d.\n\nUnfortunately it would be costly because of the great many hours of labour involved in the process, but I found your question an interesting one.\n\nIncidentally, there is a young man her in the Vancouver BC area attending ECIAD who is hand-cutting a font of wood type. He came out to my workshop to show it to me a couple of months ago. His skill is outstanding. I have heard that he is continuing to add to the font.\n\nJim\n\n"
    },
    {
      "time": " 16.Jul.2005 5.21pm",
      "content": "Thanks Jim for the detailed explanation. I doubt we’ll ever need a letterpress Verdana cut, but stranger things have happened. We’ll know who to call.\n\nCheers, Si\n\n"
    },
    {
      "time": " 16.Jul.2005 10.09pm",
      "content": "Fascinating, I wonder how long it takes to learn to cut a font in wood.\n\n"
    },
    {
      "time": " 17.Jul.2005 7.47am",
      "content": "Grod\n\nI think cutting woodtype is not too difficult; much like cutting a linoblock. After a few letters things go quite easily. There is like with everything a bit of a learning process, inthis case getting familiar with how the wood cuts across the grain etc.\n\nJim\n\n"
    },
    {
      "time": " 17.Jul.2005 10.43am",
      "content": "Certainly Jim Rimmer is the first one I would approach. Adobe and Lanston refit Stone for hotmetal in the early nineties. Fitting the face took substantial planning.\n\nDigital to film works for burning polymer plates sized for patterns. Polymer plates are also a method of going from digital text to letterpress.\n\nWe have also gone from digital to wood using a signage compaines Cad/Cam router. The first time we use that method was for Bill Ried’s indian prints. This method, cut on lead instead of wood could be used for making lead patterns for a pantograph.\n\nI just noticed a comment by grod.\n\nWe worked with the Canada Research Council in the late eighties in this regard. Yes you could go from film to matrices or punches using Cad/Cam technology. In otherwords, a digital pantograph.\n\nAlso you could have a digital engine to run a polymer plate maker.\n\nWe, at Lanston fit our faces identical to hotmetal. Our faces were exact duplicates. One of our mechanical projects were to build fonts along with a computer controlled Monotype Caster. This would enable a digital laser output to either be used as final copy, or to have the type output directly from the same file on the caster.\n\nI am sorry if this note is not detailed enough, I am just passing through.\n\nGiampa\n\n"
    },
    {
      "time": " 17.Jul.2005 10.43am",
      "content": "Certainly Jim Rimmer is the first one I would approach. Adobe and Lanston refit Stone for hotmetal in the early nineties. Fitting the face took substantial planning.\n\nDigital to film works for burning polymer plates sized for patterns. Polymer plates are also a method of going from digital text to letterpress.\n\nWe have also gone from digital to wood using a signage compaines Cad/Cam router. The first time we use that method was for Bill Ried’s indian prints. This method, cut on lead instead of wood could be used for making lead patterns for a pantograph.\n\nI just noticed a comment by grod.\n\nWe worked with the Canada Research Council in the late eighties in this regard. Yes you could go from film to matrices or punches using Cad/Cam technology. In otherwords, a digital pantograph.\n\nAlso you could have a digital engine to run a polymer plate maker.\n\nWe, at Lanston fit our faces identical to hotmetal. Our faces were exact duplicates. One of our mechanical projects were to build fonts along with a computer controlled Monotype Caster. This would enable a digital laser output to either be used as final copy, or to have the type output directly from the same file on the caster.\n\nI am sorry if this note is not detailed enough, I am just passing through.\n\nGiampa\n\n"
    }
  ]
}
