{
  "id": "13886",
  "title": "Caslon Catalogue",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anyone have early catalogues, specimen sheets, showing with reference dates from the Caslon Letter Foundry promotional material. I am especially interested in anything between 1800-1924. If you do I have some questions and may ask for scans.\n\nI know that Hrant will have what I need. If not John Hudson or Gerald. (If he is around)\n\nThanks in advance.\n\n",
  "author": "Giampa",
  "time": "15 Jul 2005 — 4:52pm",
  "uid": "3861",
  "comments": [
    {
      "time": "16 Jul 2005 — 2:48am",
      "content": "I might have access to one of the last Caslon specimen books (1920s or 30s?).\n\nI'll get back to you next week, after I can check.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20131221004418/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "16 Jul 2005 — 8:58am",
      "content": "I got nothin'. I could scour UCLA though... if you were my sister. :-)  \nTell you what: tell me **exactly** what you're looking for (as in a specific date of a specific publication) and next time I'm at UCLA I'll try to find it.\n\nhhp\n\n"
    },
    {
      "time": "17 Jul 2005 — 11:03am",
      "content": "Dan,\n\nI am after a scan from the the Calson 1924 catalogue of the traditional Caslon ornaments. My notes say page 32. Also I am after a scan of the two used on the end papers. I would like a scan, if you could be so kind, of exact size and of an elargement.\n\nHrant\n\nI am looking for the date, I think about 1800 where Caslon was dropped from their own catalogue, also the date, or catalogue that shows the first return. Also I would like scans, which in this case sounds impossible, of the ornaments. Since that is unlikely I would just for interest sake, know if the ornaments were ever discontinued. Probably not.\n\nThis is not a mad rush. I have no specific timetable. In othewords soon would be great.\n\nGiampa\n\n"
    },
    {
      "time": "17 Jul 2005 — 11:31am",
      "content": "I would need exact dates.\n\nhhp\n\n"
    },
    {
      "time": "17 Jul 2005 — 6:15pm",
      "content": "The catalogue date I believe is 1800. Your are correct, the other catalogue of reappearance may be hard to find, although more recent. Do you have recommendations?\n\nAs you know I am writing a book on ornaments, Caslon ornaments seems to come up. I have questions about these ornaments, refit only one of them. As you know the point and pica system as we know it is recent, well fairly recent but not reently recent? What ever that means.\n\nBut look, any help would be appreciated. I would never ask if I did not respect your obvious merits.\n\nGiampa\n\n"
    },
    {
      "time": "17 Jul 2005 — 7:28pm",
      "content": "I'm not getting anything at UCLA...  \nHere's an idea: go ahead and use this link  \n [http://catalog.library.ucla.edu/cgi-bin/Pwebrecon.cgi?DB=local&PAGE=First](http://web.archive.org/web/20131221004418/http:/catalog.library.ucla.edu/cgi-bin/Pwebrecon.cgi?DB=local&PAGE=First \"http://catalog.library.ucla.edu/cgi-bin/Pwebrecon.cgi?DB=local&PAGE=First\")  \nto find what you need, and let me know.\n\nJust one thing: if what you want shows up at the Clark library, that's harder.\n\nhhp\n\n"
    },
    {
      "time": "17 Jul 2005 — 7:53pm",
      "content": "Hrant,\n\nThank you I will give this a try.\n\nDan, I would really appreciate a scan if you find your catalogue of those ornaments.\n\nThanking all in advance.\n\nGiampa\n\n"
    },
    {
      "time": "24 Jul 2005 — 8:51am",
      "content": "I own a copy of the 1924 book if you still need the scans. Let me know and I'll try to get you what you need.\n\n"
    },
    {
      "time": "24 Jul 2005 — 2:35pm",
      "content": "Hey Addison,\n\nCould I get some of that Caslon lovin too?\n\n[ericwest@cinci.rr.com](mailto:ericwest@cinci.rr.com)\n\n:))\n\n"
    },
    {
      "time": "24 Jul 2005 — 2:47pm",
      "content": "Let me scan that page and some others -- I may just post them on my website. I've actually been meaning to do it for a long time...\n\n"
    },
    {
      "time": "24 Jul 2005 — 2:56pm",
      "content": "Somebody here rocks ! Wooo !\n\n"
    },
    {
      "time": "24 Jul 2005 — 5:35pm",
      "content": "_I am looking for the date, I think about 1800 where Caslon was dropped from their own catalogue..._\n\nLater than that, I think. I have some pages of William Caslon III's specimen, and this includes the Caslon oldstyle type. They're framed, so I can't offer to scan them.\n\n"
    },
    {
      "time": "24 Jul 2005 — 5:37pm",
      "content": "Correction: my specimen is probably Caslon IV (I don't have it handy). In any case, it is early 19th century.\n\n"
    },
    {
      "time": "24 Jul 2005 — 10:31pm",
      "content": "Gerald\n\nThe Caslon Old Face disappeared with the issue of the 1805 specimen. The Caslon revival began with Chiswick in 1844.\n\nGerald\n\n"
    },
    {
      "time": "24 Jul 2005 — 10:40pm",
      "content": "Gerald\n\nA further note. I have Justin Howe's cataloging of the Caslon materials. I will look for the ornament dates tomorrow. I'm only \"here\" on the weekends. :—)\n\nGerald\n\n"
    },
    {
      "time": "24 Jul 2005 — 10:50pm",
      "content": "Oh, a further note. I have believed this for some time. That the Chiswick Press revival of Caslon was the first \"revival\" ever (of any typeface). Anyone know different?\n\nGerald\n\n"
    },
    {
      "time": "25 Jul 2005 — 11:59am",
      "content": "Gerald\n\nAccording to Howes the \"authentic\" Caslon Old Face likely saw its last hurrah in the specimen catalog of 1766. Afterwhich there appears to be repair and replacement work up until 1805. The Chiswick revival of 1844 is based on the recovery of punches and matrices in 1839. Howe's inventory does not list ornaments as original to Wm Caslon I or II. The only mention of ornaments is the cutting of them for the Gresham Press in 1876 (but not necessarily cut or cast by the foundry). Anything offered by Stephenson & Blake would not be authentic in terms of lineage (to punches and matrices).\n\nAdobe Caslon is based on specimens from \"1738 and 1786\" [sic 1785 ?]. As I recall the Adobe Caslon ornaments supplied with the font were from \"later\" issue. They might likely be late 19th or even early 20th c. additions. The printer Wesley Tanner was involved in some way with the Adobe Caslon ornaments.\n\nGerald\n\n"
    },
    {
      "time": "25 Jul 2005 — 12:43pm",
      "content": "Gerald\n\nOne final bit here. My last post may lead astray. Since Founder's Caslon does have a suite of ornaments it is likely Justin found them somewhere. He doesn't mention the ornaments in \"The Compleat Caslon\" the piece he wrote on his forthcoming Ligature Caslon [Founder's Caslon] which appeared in Matrix.\n\nGood luck\n\nGerald\n\n"
    },
    {
      "time": "29 Jul 2005 — 1:16pm",
      "content": "Check Printing Types by Updike. Vol II has some info on Caslon's Flowers. Hopefully that can be of some help.\n\n"
    },
    {
      "time": "2 Aug 2005 — 1:26pm",
      "content": "Well, I haven't had time to scan the pages properly, but I found some old scans from a couple of years ago (please forgive the quality). When I get the opportunity, I'll try to make some better scans.\n\n[Pages from 1924 Caslon Specimen](http://web.archive.org/web/20131221004418/http:/www.addisonhall.com/caslon-1924-specimen/)\n\n"
    },
    {
      "time": "2 Aug 2005 — 2:06pm",
      "content": "i see you even have a portrait scanned. my personal favorite portrait of Caslon is [this one](http://web.archive.org/web/20131221004418/http:/photos21.flickr.com/30707252_26e4953359.jpg?v=0), which we used for promo posters for LTC Caslon. gotta love that pringing press-as-halo effect!\n\n"
    },
    {
      "time": "18 Aug 2005 — 12:42pm",
      "content": "Looking for something eles, I found an old -and quite short- article in PaGA written by Dwiggins about the Caslon flowers. Not a lot of hard dates or anything, but a nice read.\n\nhhp\n\n"
    },
    {
      "time": "18 Aug 2005 — 12:48pm",
      "content": "PaGA?\n\n"
    },
    {
      "time": "18 Aug 2005 — 12:58pm",
      "content": "Printing and Graphic Arts, a journal from the 50s, with some really good content on occasion.\n\nhhp\n\n"
    },
    {
      "time": "18 Aug 2005 — 1:15pm",
      "content": "Hrant, I would like a copy of that. Hmm. I need to see if the University here has that.\n\n"
    },
    {
      "time": "18 Aug 2005 — 1:16pm",
      "content": "i'd like a copy too. if you please. ;^D\n\n"
    },
    {
      "time": "18 Aug 2005 — 1:21pm",
      "content": "It is done.\n\nhhp\n\n"
    },
    {
      "time": "26 Sep 2005 — 8:57am",
      "content": "FYI, in Dreyfus's \"Into Print\" (Godine, 1995) there are two great pieces on ornaments: one about Baskerville's, another about French stuff. The articles were each published previously elsewhere, but those are probably harder to find anyway.\n\nhhp\n\n"
    }
  ]
}
