{
  "id": "13885",
  "title": "Metafont",
  "forum": "Home",
  "tags": [
    "Book / Website / Information"
  ],
  "content": "Metafont, while barely used today, was extremely innovative in its day, and has had much influence on mainstream technologies. The first version was developed by [Donald Knuth](http://web.archive.org/web/20141017115506/http:/typophile.com/wiki/Donald%20Knuth) in 1977, and it continued to be refined for many years, with a particularly significant revision in 1985 in conjunction with his PhD student John Hobby. It is this version which is documented in Knuth's books \"Metafont: the Program\" and \"The Metafont book\". It is the font-design counterpart to [TeX](http://web.archive.org/web/20141017115506/http:/typophile.com/wiki/TeX), Knuth's groundbreaking typography system.\n\nThe central concept of Metafont is that a font is a computer program, its output the images of individual glyphs. A sufficiently sophisticated designer can write the program to be sensitive to a number of parameters, such as the weight of the font, as well as more subtle features such as the length of ascenders and descenders.\n\nThe major font family accomplished in Metafont is [Computer Modern](http://web.archive.org/web/20141017115506/http:/typophile.com/wiki/Computer%20Modern), itself essentially a revival of Monotype’s Modern No. 8. This font was chosen not for its aesthetic or technical merits, but because it was popular in setting works of mathematics, including earlier editions of Knuth's Art of Computer Programming. This font has dozens of tunable parameters, and its flexibility has made it exceptionally useful for the intended purpose of setting complex mathematics and computer science. Of particular interest is the fact that it is one of the earliest digital font systems to implement [Optical Scaling](http://web.archive.org/web/20141017115506/http:/typophile.com/wiki/Optical%20Scaling), a feature that is still taking many years to become popular in mainstream typographical systems.\n\nEven though Metafont has many sophisticated features, it also bears several weaknesses that have stopped its popularity. First and foremost, writing computer programs to draw fonts requires significant analytical and technical skill in addition to the traditional drawing and typographic skills needed to create good fonts. The Metafont language, though quite powerful, is considered unfamiliar and difficult even for experienced computer scientists. As a result, only a handful of people have ever been expert type designers in the Metafont system. Another weakness is its somewhat isolated role in the broader environment; Metafont fonts have only been used in conjunction with TeX, and the output has been restricted to resolution-dependent bitmaps. Although theoretically feasible, nobody has ever developed a native conversion from Metafont to mainstream vector formats such as [TrueType](http://web.archive.org/web/20141017115506/http:/typophile.com/wiki/TrueType) (although see Piska's work, cited below, for work towards autotracing large bitmaps generated by Metafont). Today, most TeX users use Type 1 fonts, even for Computer Modern, for which Type 1 versions were made in the early '90s, and freely released.\n\nThere are still many good ideas in Metafont which have not yet been adopted by the mainstream, including morphable fonts (Adobe's [Multiple Master](http://web.archive.org/web/20141017115506/http:/typophile.com/wiki/Multiple%20Master) technology takes a step in this direction, but is very limited in many ways, including the number of parameters). Those seeking to influence the future of font technology would do well to fully understand its past, and Metafont is an extraordinarily important piece of that past.\n\nExternal link:\n\nWikipedia entry on [Metafont](http://web.archive.org/web/20141017115506/http:/en.wikipedia.org/wiki/Metafont)\n\n[Creating Type 1 Fonts from METAFONT Sources: Comparison of Tools, Techniques and Results](http://web.archive.org/web/20141017115506/http:/www-hep2.fzu.cz/~piska/TUG2004/piskatb2.pdf), by Karel Piska.\n\n[Computer Modern and AMSFonts in Type 1 (PostScript) Form](http://web.archive.org/web/20141017115506/http:/www.ams.org/tex/type1-fonts.html)\n\n[Metaflop](http://web.archive.org/web/20141017115506/http:/www.metaflop.com/) is a web based platform for experimental fonts and type related projects using Metafont.\n\n",
  "author": "raph",
  "time": "15 Jul 2005 — 3:02pm",
  "uid": "4406",
  "comments": [

  ]
}
