{
  "id": "13896",
  "title": "Astronomical Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello,\n\nI’d like to tweak this logo to perfection, so any and all tips would be greatly appreciated.\n\nThanks!\n\n| Attachment | Size |\n| --- | --- |\n| [sari\\_sig\\_3\\_color.jpg](http://web.archive.org/web/20060522104334/http:/typophile.com/files/sari_sig_3_color.jpg) | 95.83 KB |\n| [sari\\_sig\\_1\\_color.jpg](http://web.archive.org/web/20060522104334/http:/typophile.com/files/sari_sig_1_color.jpg) | 85.49 KB |\n\n",
  "author": "<a href=\"user/7357\" title=\"View user profile.\">chadbrewer</a>",
  "time": "<br>",
  "uid": "7357",
  "comments": [
    {
      "time": " 17 July, 2005 - 2:43am",
      "content": "I suppose the first question should be whether the client would be happy to see their activities reduced to a very basic interpretation.  \nIf the answer is yes then the weight of the strokes of the observer and star might be better if they were equal and the arm might benefit from being more geometric like the star and head. As you have chosen Futura Condensed the bar of the A formed by the arm is rather high. There is a shape formed by the inside of the top bowl of the S that could be used as a left shoulder that might be worth exploiting. The telescope doesn’t immediately reveal itself, the tapered/irregular shape could be a megaphone, maybe a more conventional telescope, a series of rectangles perhaps. Have you looked at having the objects filled rather than stroked, at least in the colour version it might be too much in the black version, the head looks too close to the S.  \nFor the type I would look at having equal tracking throughout and centred, maybe tighter tracking and larger point size or as a single line, the looser tracking of the second line is too light and the alignment of the I, L and E will be difficult to bring off.  \nTim\n\n"
    },
    {
      "time": " 17 July, 2005 - 8:27am",
      "content": "Echoing what Tim said: It’s a bit too ambiguous for me right now. I have a hard time picking it apart visually and mentally. The forms aren’t distinct enough for me yet, but I like the direction. Maybe avoid outlined shapes and make the telescope mildly less abstract.\n\nNormally I’d never say this, but the shapes of the mark and the type might be too integrated. Mainly it’s the circle, which I assume is a head. It’s too much like a letter to me, but not enough like the type, so my mind’s eye keeps trying to resolve it, like an optical illusion that flickers between two interpretations. Find a balance between contrasting the shapes and the type and integrating them. Also, the star is a bit close to the telescope. My wife commented that it read like a cannon for her, rather than a telecsope, at first glance.\n\nRegardless, it looks like you’ve got a strong concept in mind and a clear sense of the aesthetics. Keep refining, and it’ll be really sharp.\n\n"
    },
    {
      "time": " 19 July, 2005 - 9:26pm",
      "content": "What type of research is done at SARI? I ask because not all professional astronomy is visual observation. Where is the facility located? Is it named for Harlow Shapely?\n\nIf this will be reduced for letterhead, the two lines of text will be very small, and the different letterspacing of each line might be distracting. I\n\nMost observatories don’t really have logos, so this is cool.\n\n"
    },
    {
      "time": " 24 July, 2005 - 4:59pm",
      "content": "It’s WAY too literal, and the telescope actually distracts from legibility. Also, consider more contrast between “SARI” and the words below. Think about simplifying the telescope concept visually, and possibly trying to integrate the scope directly into the letterforms. I thnk there is definatelly room for the star somewhere in the final. Keep scetching. PLAY with the letterforms.\n\n"
    },
    {
      "time": " 2 September, 2005 - 10:18am",
      "content": "Chad, I’m curious to see the design progress, please update when you get a chance.\n\n"
    },
    {
      "time": " 5 September, 2005 - 3:16pm",
      "content": "First off, I’d like to thank all of you for your thoughts and ideas! :) Sorry it’s taken so long to reply, I’ve been a busy man (new baby, new summer job). But now work is done, and I’m back to school - my last semester. This logo was a project in school, and I’d like to refine it for my portfolio.\n\nThis particular logo will be on hold for a few more weeks, as I need to work on my self-identity first, so I can get some cards and stationary printed. (Maybe I’ll show you all that too, as I work on it)\n\nI’ll definitely work on the shape of the telescope, to make it more readable. And play around with the star some more (it was originally filled, not outlined). When I’ve come up with some new stuff I’ll post it.\n\nAbove all, I want to keep the logo economical and efficient. So saying that it’s simplistic is sort of okay - that’s what I’m going for. I believe a scientific group would appreciate an economical solution. And being able to visually represent an activity with a few geometrical shapes is my goal.\n\nAnd yes it’s named for Harlow Shapley, a much under-appreciated astronomer imho. (I was almost a physics/astronomy major).\n\nThanks,\n\nChad\n\n"
    },
    {
      "time": " 5 September, 2005 - 3:33pm",
      "content": "I’d remove the trap from that [barless] “A”.\n\nhhp\n\n"
    }
  ]
}
