{
  "id": "13907",
  "title": "The Woodland Group",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nI'm working on a redesign of a website for a small business consulting group ( [http://www.thewoodlandgrp.com](http://web.archive.org/web/20131018162219/http:/www.thewoodlandgrp.com/ \"http://www.thewoodlandgrp.com\") ). However, I feel like the firm's current typography used in the logo is working against the spirit of the organization.\n\nThe current logo is set in Camellia and a bright yellow/green. This modern look conflicts with the organic nature of the firm's collaborative process, symbolized in the logo.\n\nThe image of a tree connects to the tagline \"Nothing changes until action is taken at the root level.\" The tree's leaves serve as a symbol for a company's products/productivity, which only can fully be achived with internal growth, embodied in the roots.\n\nSome options to ponder:\n\n• The logo to the left (1) or set among the text (2)  \n• Type options A, B, C, D  \n• Am I crazy and the original is fine\n\nThanks for any guidance!  \nJacob\n\n| Attachment | Size |\n| --- | --- |\n| [typophile-sample.gif](http://web.archive.org/web/20131018162219/http:/typophile.com/files/typophile-sample.gif) | 32.5 KB |\n\n",
  "author": "giaccoppo",
  "time": "17 Jul 2005 — 12:18pm",
  "uid": "4497",
  "comments": [
    {
      "time": "17 Jul 2005 — 10:54pm",
      "content": "Jacob,\n\nI would say something like 1A.\n\nI totally agree that the modern logo clashes with the more traditional look of the website. So in my opionon, the typeface in A would suit the site perfectly since it's more traditional looking than the site.\n\nFor example, a script logo could go perfectly with some modern techno-ish layout, while you really can't have an ultra-modern logo with some really traditional serif fonts. But that's just me.\n\n"
    },
    {
      "time": "18 Jul 2005 — 12:40am",
      "content": "Out of these, Id 'vote' for 1 + A, as well..\n\n"
    },
    {
      "time": "18 Jul 2005 — 3:09am",
      "content": "I like number 1 with these changes first remove the rule under the name. The tag line is over whelming in all caps and could be rewritten in english. The average person wouldn't get it. Maybe that isn't important if you have a narrow target audience. I would also give space between the name and the tag line. Try making the tagline Sentence Case and a serif face.\n\nMy problems with the current look is the type is hard to read and the tree breaks up the name and the unessary rule.\n\n"
    },
    {
      "time": "18 Jul 2005 — 5:06am",
      "content": "Yeah, 1 + A was what I've been leaning towards. Very helpful to get feedback!\n\nI'll post the next iterations very soon.\n\nDan, thanks for the feedback. The only thing that's causing me to shy away from setting it in Clearface is that the logo already resembles the [Timberland](http://web.archive.org/web/20131018162219/http:/www.timberland.de/images/timberland_logo.gif) mark, which also is set in a similar face. Timberland has a large local presence and I certainly wouldn't want the two to get visually confused.\n\nOh, and about the tagline... technically it is a part of the company's official registered name, so I'm afraid that it's here to stay.\n\nJ\n\n"
    },
    {
      "time": "18 Jul 2005 — 5:25am",
      "content": "Hi Jacob,\n\nI think the logo's a bit much... I'm not sure about the choice of typeface, maybe using a more contemporary serif (Stone?) might pull it round a bit. I agree with the post about dropping the line. The current logo kind of looks like a bit like a bar or club (with a bizarre tree theme!)\n\nI know the tagline might be part of the registered name of the company, but that doesn't necessarily mean that you can't drop it from the logo... as long as you state it on the letterhead itself (i.e. where the registered office etc., details go)... the previous logotype kept it simple. I suppose it depends on how the company is known. If a company is limited company (which would technically be part of the company's name), you don't necessarily have to put it on the logo, as long as it's stated somewhere on the letterhead.\n\nAlso, the tagline has a typo in it - you've got a superfluous T on 'through'.\n\nIs there any way of getting the tree refined?... is there any way of making a more abstract representation of the roots - I know that there's a important underlying reason for displaying the roots, but they don't seem friendly to me at the moment. Maybe a pictogram approach would be a friendlier approach. What about symbolising internal growth through the rings of a tree instead? Just a thought...\n\nHope this helps\n\nSi\n\n"
    },
    {
      "time": "18 Jul 2005 — 7:02am",
      "content": "I would second refining the tree, it is just too much for that logo, however I would look at having a tree in full leaf as it looks a bit dead at the moment, btw the roots should spread more horizontally. I prefer the placement of 2 although it should be slightly lower so the roots start beneath the baseline. Clearface is moving too close to Timberland maybe it will work much better with a sans (although the original is too light).  \nOn another note I was looking for an image to explain my point clearly and came across this [looks familiar?](http://web.archive.org/web/20131018162219/http:/www.commonsensemedicine.org/)  \nTim\n\n"
    },
    {
      "time": "18 Jul 2005 — 7:31am",
      "content": "Tim,\n\nWow, that really is too close for comfort...\n\nI didn't design the original logo art and I have to discuss with the client the idea of modifying it.\n\nThanks for pointing that out.\n\nJ\n\n"
    },
    {
      "time": "18 Jul 2005 — 11:02am",
      "content": "J,  \nGiven the poor general quality of that website I reckoned that they had stolen it from your client but I would still try to talk the client into changing their tree.  \nTim\n\n"
    },
    {
      "time": "18 Jul 2005 — 1:54pm",
      "content": "Don't worry about the Clearface type because they are about as far apart from end users as you can get. You are talking to corporate types and Timberland is a retail outfit. The cultures will never cross. As for the tree wouldn't be cool if you were viewing the tree from the roots like a worm, looking up through the roots and seeing the forshortened trunk and branches and leaves(You have to have leaves or its a dead tree). Just some thoughts\n\n"
    },
    {
      "time": "19 Jul 2005 — 6:29am",
      "content": "Thanks for all of the comments!\n\n[Here's the next batch.](http://web.archive.org/web/20131018162219/http:/homepage.mac.com/macman1984/typophile/typophile-sample2_01.gif) I'm still working on logo tweaks.\n\nJ\n\n"
    },
    {
      "time": "19 Jul 2005 — 6:44am",
      "content": "Dan,  \nI think you are underestimating the acuity of viewers, although there is a gulf between the products of both companies there are parallels that can be drawn through the proposed and existing logo – tree, chunky serif, horizontal format – maybe enough to cause someone to have the thought that one resembles the other, which is obviously something to be avoided. There are many logos which do bear a resemblance to each other and it would be near impossible to design something that was unique, but if you have the opportunity, I think one should distance one's design from an existing design.  \nOn the other hand I might be overestimating the situation.  \nTim\n\n"
    },
    {
      "time": "19 Jul 2005 — 6:58am",
      "content": "J.  \nFirst impressions are that the strap line is way too close to the logotype and that the initial caps are distracting, I realise that initial caps have been used in the website but it really isn't doing the company a favour to prolong that. The strap is also very small considering the uses it might be put to, I think for reproduction purposes you might need to go to the full measure of the logo.  \nThe kerning, especially F, is too tight except in the area it needs tightening Wo. Seeing the tree at that scale the root system needs some attention, due to its jagged style it could appear that the tree is being pulled up from the ground. I find the serif face too organic, approaching a tree nursery or similar.  \nTim\n\n"
    },
    {
      "time": "24 Jul 2005 — 5:10pm",
      "content": "Well, your certainly not crazy. The current logo leaves much to be desired. Why is \"LLC\" bigger than the company name? The choice and weight of the font speaks little of the company's services.\n\nThe tree is too complex and detailed. It needs simplification. Of the choices you offer, I'm inclined towards A, BUT I would explore more typefaces.\n\nI echo the above suggestion about not setting the tagline in all caps and dropping the horizontal line. Take everything away, and work with the letterforms. Consider a vastly simplified tree, ala olympic iconograms.\n\n"
    }
  ]
}
