{
  "id": "13926",
  "title": "Shinn vs. Papazian challenge",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "legibility",
    "papazian",
    "shinn"
  ],
  "content": "About a year ago in a Typophile thread, in response to Hrant's advocacy for a science-based, theoretically-driven approach to legibility, I argued that legibility was a practical matter really, and that any typeface could be turned into a text type, without benefit of science or theory. He suggested I try my own Eunoia.\n\nSorry for the delay. It hasn't taken that long to do, just finding the time and motivation has delayed it.\n\n[Here](http://web.archive.org/web/20131012214608/http:/www.shinntype.com/Eunoia_Text.pdf) is a pdf comparing Eunoia Text with Eunoia, Helvetica Medium Condensed, Univers 57, and ITC Franklin Gothic Book Condensed.\n\nI've shown the face 8/9 justified, in a newspaper column format. I don't think this is a book face, as Hrant would probably prefer, but the challenge was to make a text face, and the news setting is a good test of that, and certainly qualifies as immersive reading.\n\nI could have taken it further, but that would have departed from the type design, which is necessarily high contrast and condensed.\n\nI would have liked to have shown it compared with faces that also have this quality, such as Britannic or Ocean, but I don't have anything like that.\n\nHave I proved my point?\n\n",
  "author": "Nick Shinn",
  "time": "18 Jul 2005 — 6:37am",
  "uid": "2021",
  "comments": [
    {
      "time": "18 Jul 2005 — 1:13pm",
      "content": "i'm surprised no one has commented on this! maybe i was the only one excited to see this experiment. now my only question is: who will be the judge(s) of whether this makes a sucessful text face or not?\n\n"
    },
    {
      "time": "18 Jul 2005 — 1:25pm",
      "content": "Nick, I like your Eunoia Text, I'd need to read articles set in it for a while to get use to the variations in the strokes. This is especially true since this is the first time I've seen it, unlike Helvetica etc. Its a lot like tasting a new food for the first time, you might not get it but with additional tastings you get it.\n\n"
    },
    {
      "time": "18 Jul 2005 — 2:24pm",
      "content": "\" I argued that legibility was a practical matter really, and that any typeface could be turned into a text type, without benefit of science or theory.\"\n\n\"Have I proved my point?\"\n\nWell, I think if you were trying to prove that you could take an advertising display face and turn it into an adverstising text face, with the benefit of typographic science and theory to guide you, e.g. that you make proven design changes to facilitate better reading, then either you proved your point or the opposite. I did not read the original thread. . .\n\n"
    },
    {
      "time": "18 Jul 2005 — 3:12pm",
      "content": "\\>with the benefit of typographic science and theory\n\nThe idea was not to use science and theory.  \nThe reason this face was chosen for the experiment was, I think, because it has features which are not conducive to legibility, according to theory.  \nYou hit the nail on the head by saying that the design changes are \"proven\" -- they are based on established type design practice and principles, rather than reading theory.\n\n"
    },
    {
      "time": "18 Jul 2005 — 5:22pm",
      "content": "Reading the previous thread would probably prove beneficial to my understanding of the matter, but as far as proving anything I wonder exactly what. That any font may be readable?\n\nA new font as constrasted as Eunoia - very nice design btw -, in the context of a text setting, has the same effect for my eyes as an old typeface like Bodoni: vertical lines vibrate too much to really enjoy the text and - better - forget the font and concentrate on the content...\n\nI'll go put my bulletproof vest now that I got in between Mr Shinn and Mr Papazian.\n\n"
    },
    {
      "time": "18 Jul 2005 — 5:56pm",
      "content": "I suspect that you and Hrant are talking past each other a bit. It seems to me that what you have done is to make a version of Eunoia that stands up to being used at bodytext _sizes_, and this is, as you say, a practical matter involving tried and true design adjustments that require no theoretical basis or justification. Stems need to be strengthened, counters need to be enlarged, etc. and these are practical procedures that would be applied to any display face in order to make it function at small sizes. But I really don't think this is what Hrant is talking about, because there is a significant difference between making a typeface function at small sizes and making a typeface that is comfortable to read for extended text, which is what we typically mean by readability.\n\nNow, this is not to say that I agree with Hrant that text face design should proceed _from_ theoretical and/or empirical understanding of the reading process (see the recent Noordzij thread). Although I am quite interested in how it can proceed _to_ that understanding. There are plenty of practical ways in which to begin the design process, including looking closely at typefaces that one enjoys reading and figuring out what contributes to that experience.\n\n"
    },
    {
      "time": "18 Jul 2005 — 6:33pm",
      "content": "\\>there is a significant difference between making a typeface function at small sizes and making a typeface that is comfortable to read for extended text,\n\nI find that much of the technique is the same. It's not just a question of strengthening stems and enlarging counters -- that's a legibility rquirement, to enable the details to have sufficient presence. Rather, it's a question of making the letters combine to create a texture appropriate to their size, and hence maximize the efficiency of the reading process.\n\n"
    },
    {
      "time": "18 Jul 2005 — 7:18pm",
      "content": "Darn. When I cracked open this thread I was hoping that Shinn was going to challenge Papazian to a boxing match or at least a dance contest at [TypeCon](http://web.archive.org/web/20131012214608/http:/typophile.com/wiki/TypeCon) this week. =/\n\nNice stuff Nick. I can definitely see how Eunoia Text is a much better alternative to the regular.\n\n"
    },
    {
      "time": "18 Jul 2005 — 7:56pm",
      "content": "I'm not clear on what exactly is at stake in the issue between science v.s. experience in the case of which typefaces are most comfortable to read. If it is a case of having physical descriptions of how the eye moves about while reading, etc., I don't really see how this will help. I say this because it seems to me that which typefaces are most readable is discoverable via preference determination. In other words since we want typefaces that are most comfortable to read, and comfort pertains to subjective response, it seems most pracical to just ask readers which they prefer. And since type has evolved over time at least in part in response to reader preferences, I don't see how lab research provides an edge over the \"wisdom\" garnered over the years. Readability may have objective and observable entailments, but what seems to be most relevant is the subjective preference of the reader and not the accounts we provide of those preferences.\n\nIf I prefer to read Type X over Type Y, then this you can find out by asking me. You don't need to quantify electro-chemical responses in the brain or nervous system to figure this out. Even if you could what more would you discover other than some other description telling you exactly what I just told you? Is it a question of _why_, in EM terminology? For example, \"John-Paul prefers to read Caslon over Meta because the serifs allow his brain to process word shapes 4% faster in the former.\" How would you know this except by asking me and timing my responses? It's not like you can measure the time between photons impinging on the retinas and the comprehension of the word meaning by following the neural impulses (although that would be cool). You'd take what you could measure (eye movements and the like) and combine that with my accounts of subjective responses and develop a theory out of that. But all you'd be doing, really, is accounting for preferences in a very roundabout way.\n\nBasically what I'm saying is that even if there are fixed physical characteristics which act as constraints upon preferences toward particular qualities in font design, what's at stake seems to be the preferences themselves and not whatever theories we happen to develop to account for those preferences. The best way to determine those preference is just to ask readers which they prefer. Personally I prefer Comic sans printed in bright green on yellow paper. (Actually if I ever saw that I'd probably try to kill myself.)\n\n"
    },
    {
      "time": "18 Jul 2005 — 10:59pm",
      "content": "Nick, I found the thread you were refering to here at the begining of this thread while I was looking for comment you had made about 'sparkle'. I wondered if this was going to happen. It seemed like no, since it had been so long.... but here it is. I am surprised!\n\nI have to admit that I don't know if I would define this face as a text face yet. But I am reacting I am sure to the lack of serifs - and the lowercase a keeps stopping my eye. It still seems too unfamilair in feeling to be a text face.\n\nOn the other hand if you decided to you could no doubt keep altering the face until it felt more like the other sans faces. A slight reduction in contrast and 15% less height would probably work to ake it feel more text ready to me.\n\nNo doubt you have improved the legibility at small sizes. If that counts as a win then chalk up a win in my book. If you are claming better readability than any of the other sans faces in the PDF then I am not ready to accept that.\n\n"
    },
    {
      "time": "19 Jul 2005 — 9:06pm",
      "content": "What can be measured? A big question, right?  \nProportion of thick to thin, rate of change from thick to thin, average width of the letters, average descender length, the list goes on for miles. \"Design is relationships\", and if you want to measure readability it's a matter of figuring out which relationships are most important. With art in general, it usually means contrast, color, texture, balance - all of which apply to type.\n\nBut you do have to consider that type is becoming more \"personal.\" With more people learning about type, they are starting to have predisposed tendencies. This would affect, and have to be considered, in any emperical study of readability to have a true bearing with today's readers.\n\nTherefore, to say that one typeface is the most legible because of certain characteristics.. well.. you might just be getting a Kinkade.\n\nSo maybe we should say readability potential? This implies that even if someone has certain predispositions, the typeface itself has more potential for better readability, if one were to \"stick with\" reading it.\n\nAs for Eunoia specifically, even in basic analysis, \"glyph recognition time\" is out the window. But at least it isn't.. well.. a font of light.\n\n"
    },
    {
      "time": "20 Jul 2005 — 12:00am",
      "content": "(Brian, love love love your icon. I'm going to remember to laugh about it later too.)\n\n"
    },
    {
      "time": "20 Jul 2005 — 2:10am",
      "content": "Hi,\n\nI would like to read the original thread, can't find it though...\n\nCan anyone please post the URL?  \nThanks in advance!\n\nSander\n\n"
    },
    {
      "time": "20 Jul 2005 — 6:16am",
      "content": "I'll post a link, but i'm afraid that the original thread got fractured when it was ported over and pieces are missing and it may not make sense, but i'll give it a search.\n\nhere are a couple bits of it:  \n [http://www.typophile.com/node/6020](http://web.archive.org/web/20131012214608/http:/www.typophile.com/node/6020 \"http://www.typophile.com/node/6020\")  \n [http://www.typophile.com/node/6174](http://web.archive.org/web/20131012214608/http:/www.typophile.com/node/6174 \"http://www.typophile.com/node/6174\")  \n [http://www.typophile.com/node/5908](http://web.archive.org/web/20131012214608/http:/www.typophile.com/node/5908 \"http://www.typophile.com/node/5908\")\n\nthe original (in parts):  \n [http://www.typophile.com/forums/messages/30/42553.html?1091979376](http://web.archive.org/web/20131012214608/http:/www.typophile.com/forums/messages/30/42553.html?1091979376 \"http://www.typophile.com/forums/messages/30/42553.html?1091979376\")  \n [http://www.typophile.com/forums/messages/30/43155.html?1092409128](http://web.archive.org/web/20131012214608/http:/www.typophile.com/forums/messages/30/43155.html?1092409128 \"http://www.typophile.com/forums/messages/30/43155.html?1092409128\")  \n [http://www.typophile.com/forums/messages/30/42042.html?1093405089](http://web.archive.org/web/20131012214608/http:/www.typophile.com/forums/messages/30/42042.html?1093405089 \"http://www.typophile.com/forums/messages/30/42042.html?1093405089\")\n\nokay, i hope i got all of it (cuz i won't be able to edit this entry if i didn't, grrrr!). enjoy!\n\n"
    },
    {
      "time": "20 Jul 2005 — 11:38am",
      "content": "_I’m not clear on what exactly is at stake in the issue between science v.s. experience in the case of which typefaces are most comfortable to read._\n\nComfort is only one of the criteria by which readability can be judged, and yes, it is the most subjective, although one shouldn't assume that there is nothing to be measured or that preference necessarily corresponds to measurable aspects of comfort, e.g. eye-strain. The other major criteria are reading speed and reading accuracy. There is inevitably an inverse relationship between these two: as speed increases, accuracy typically drops. At some point, an increase speed in forward saccades is lost because of the number of regressions caused by misreadings. When Hrant talks about improved readability, I think what he is referring to is increased speed without loss of accuracy. So let's assume a base level of accuracy: Hrant wants to know how to maintain that while increasing the reading speed. If that is your goal, then taking an interest in the mechanics of reading makes a lot of sense.\n\n"
    },
    {
      "time": "26 Jul 2005 — 11:25am",
      "content": "My intention in undertaking this design was to demonstrate that any theory of reading acquired in scientific studies has no practical use, because type designers already know what works. Sure, we may think that people read by recognizing word shapes, and this may be incorrect, but that has no bearing on the efficacy of our work.\n\nI was taken by a definition of design from Alex Isley, at Typecon, \"right and wrong answers need to be developed through experimentation.\"\n\nThat's what I did with \"Eunoia Text\". There are several versions which I produced, which are not as successful as the one I showed. At least, in the designer's opinion. What else can you trust, unless...\n\nSurely, the way to combine reading research with design development would be to test prototype options?\n\n"
    },
    {
      "time": "26 Jul 2005 — 12:34pm",
      "content": "_Surely, the way to combine reading research with design development would be to test prototype options?_\n\nYes. I think my position is somewhere between yours and Hrant's, but also orthogonal to them and at a distance. As I've said repeatedly, I think the mass of everyday experiential evidence indicates that readerability matters much more to the reading process than the readability of what is read. But I don't think this should be taken as license to ignore empirical study of reading: I think the statement that 'type designers already know what works' is misleading if we think it applies to design. What we know works is readerability, our incredibly sophisticated and adaptive pattern recognition skills. This system is so good that we have to consider the possibility that our type designs succeed _despite their design._ In design terms, the question is not what works but why it works and, considering that, _what else might work._\n\n"
    },
    {
      "time": "26 Jul 2005 — 3:07pm",
      "content": "\"In design terms, the question is not what works but why it works and, considering that, what else might work.\"\n\nIsn't exactly what Nick is saying when he writes: \"I was taken by a definition of design from Alex Isley, at Typecon, “right and wrong answers need to be developed through experimentation.”?  \nScientists need designs which exist to have something to measure. All of these designs were made by people using their own measure of success. The differences in type perceived by readers is quite subtle. How do we measure it? Does a very good sans read better than a bad serif face? Someone please show me data on exactly how much faster people read a \"good\" face rather than a \"bad\" one. Is the difference dramatic or so small that it does not matter much? There are dozens of variables to separate and control.  \nCan a face which reads slower actually aid in communication? (stopping to smell the roses).  \nMy car can go 140 miles per hour. Should I drive that fast? Should I take \"Scenic route 1a\" or \"I-95\" on my journey up the East coast of the U.S.? Would I rather read the scrawled handwriting of my Grandparents who died years ago or just see their letters in Din on a highway sign? If someone scrawls in their own blood \"Help Me!\" on a wall does it say more than a perfectly formatted typography in the most readable face known to science? Context matters, layout and design matters, value added matters. We can measure saccades but what does it really mean? We have to be able to put all the variables back together to get information that is meaningful but this is almost impossible. I am not saying don't do research. I am saying don't read more into its implications than is really there.\n\nChrisL\n\n"
    },
    {
      "time": "27 Jul 2005 — 5:21am",
      "content": "Terry Biddy reminded me of an old thread I started last year in his post on the Design section. He points to:\n\nWe often tilt at readability/legibility here on Typophile but never seem to come to a workable solution. Perhaps that is an indication of how slippery a beast legibility really is?\n\nChrisL\n\n"
    },
    {
      "time": "27 Jul 2005 — 5:23am",
      "content": "sorry, the link is:  \n [http://typophile.com/node/6026](http://web.archive.org/web/20131012214608/http:/typophile.com/node/6026 \"http://typophile.com/node/6026\")\n\nChrisL\n\n"
    },
    {
      "time": "27 Jul 2005 — 4:07pm",
      "content": "...And the best research can only test what goes into it. Hrant's critique of the reasearch up to this date makes this point. Lots of reasearch is done on all kinds of things all the time. But there is high quality reseasrch, inspired research, and churned out research not worth the paper it's printed on.\n\nStill, I disagree with Hrant's emphasis on denigration of creativity/art. Craft is fine & needed - but inovation comes from inspiration as well as insight.\n\nI also have to take issue with Nick Shinn when he says 'designers know what works'. Sure, a good designer feels what is working & what isn't without the aid of saccade research etc & font design has come a long way without this research. And to prove it you can get enormously beautiful and fuctional type today! But let's not throw away useful tools.\n\nNick you are in favor of experimentation ( who isn't really ) but do you or or don't you mean 'scientific' experiementation? Is it saccade research that you think isn't meaningful - maybe for the reasons Chris L brought up - or scientific analysis of type & reading in general? Re-reading your most recent paragraph confuses me more & more!\n\n\\> readerability\n\nJohn, You may have said what you meant by this term but I missed it. Could you remind me/us?\n\n\\> Chris L - nice points!\n\n"
    },
    {
      "time": "27 Jul 2005 — 7:31pm",
      "content": "\\>do you or or don’t you mean ‘scientific’ experiementation?\n\nFirst, I'm stating that design involves experimentation.  \nIn the designer's studio, I'll design glyphs and see which kind work best in a sample piece of text, refine the design, and so on. Then also in the typographic culture at large, because that's where the success, dare one say readability, of typefaces is determined, by whether new designs are bought and used. The knowledge type designers acquire by carrying out their work is derived from studio and marketplace experiments with typefaces. Not scientific, but practical.\n\nCompare this with biometric experiments to develop theories on how people read.  \nIf these are to be connected with the goal of making better fonts (faster, according to the Larson standard), then why not design fonts to test specific aspects of the reading process? Research and development. Unless type design is integrated into readability experiments, they will have little practical use for making more ergonomic types.\n\nClaude Hopkins invented \"Scientific Advertising\" in the 1920s, with split-run direct mailing, to determine which techniques were most effective.\n\n"
    },
    {
      "time": "27 Jul 2005 — 11:33pm",
      "content": "_readerability_\n\nQuite simply, reader ability. I compressed it into one work to stress the comparison to readability. Before we can meaningfully debate the readability of typeface design, we need to have a reasonable appreciation of the typical ability of the reader, which I maintain is very high indeed.\n\n"
    },
    {
      "time": "28 Jul 2005 — 12:12am",
      "content": "Illuminating! Both of you! Thanks.\n\n"
    },
    {
      "time": "28 Jul 2005 — 4:03am",
      "content": "\\>Unless type design is integrated into readability experiments,\n\nThis has happened with the Cleartype fonts, and their performance has proved to be measurably better with Cleartype on than with it off. However, while the process may have helped with micro-rendering, I don't believe that reading research has helped designers with specifics about glyph forms, which they didn't already know. For instance, Gary Munch says \"it's important to keep them [the letters] open and clear, and to space them so they read well in small sizes\". Surely this is common knowledge.\n\nJohn, can you identify any features or principles of your Cleartype face which were developed and tested, optimizing its performance? Is any of this contrary to established wisdom?\n\n"
    },
    {
      "time": "28 Jul 2005 — 11:16am",
      "content": "The design of the ClearType font collection and the research that the MS Advanced Reading Technologies team has been doing on screen readability are better seen as parallel developments: the briefing to the designers was primarily concerned with the the rendering technology, not with the study of the impact of that technology on screen reading speed and accuracy. The research that had been done up to that date had been concerned with testing whether there was a measurable improvement in readability with ClearType as opposed to traditional greyscale antialiasing or b/w bitmaps. That research didn't attempt to arrive at design recommendations, but it did provide the justification for designing new types that would take advantage of the benefits of ClearType (x-direction resolution enhancement) while compensating as much as possible for the device-imposed limitations (no antialiasing in the y-direction at text sizes). Testing during the design process involved seeing how the shapes were rendered on screen at different sizes in ClearType environments, and trying to improve that rendering. I'm not sure that I would characterise anything in the design of Constantia as being 'contrary to established wisdom', but I definitely made a lot of design decisions that I would not have made if I had been designing solely for print media. But, again, this was in response to the particular target rendering circumstances, not in response to readability studies per se.\n\nThere is a new line of study being followed by MS, partly as a result of the legibility forum at last year's conference Thessaloniki, which is concerned with testing specific 'received wisdom'. Kevin Larson has been conducting tests on spacing, measuring the impact of looser or tighter letterspacing on reading accuracy. This is the sort of work that may challenge traditional practices.\n\nThe question -- which Mary Dyson put to the assembled type designers in Thessaloniki -- is whether we would actually do anything different if empirical evidence ran contrary to our beliefs and practices. Hrant's repeated response to any evidence that is contrary to what he believes is to find reasons to dismiss that evidence. This is a good impulse so long as it is honestly applied, and not only to evidence that is inconvenient but to all the evidence, empirical and anecdotal.\n\nMy theory that readerability is the dominant factor in reading is based on my experience designing for multiple writing systems. The variety of human writing systems in use -- variety not only of form and style (design), which also exists within individual writing systems, but also variety of phonemic system, direction, layout -- and the proficiency with which they are _all_ read on a daily basis, strongly suggests that the impact of design, once a base level of legibility had been achieved, is minimal. This is not to say that design in of no importance to readability, but that its importance is particular rather than general; it is important, for instance, to specific circumstances of reproduction, e.g. resolution, print conditions, etc.\n\n"
    },
    {
      "time": "28 Jul 2005 — 11:30am",
      "content": "john, feel free to contribute to the new entry on [readerability](http://web.archive.org/web/20131012214608/http:/typophile.com/wiki/readerability).\n\n"
    },
    {
      "time": "28 Jul 2005 — 1:26pm",
      "content": "\\> This is not to say that design in of no importance to readability, but that its importance is particular rather than general; it is important, for instance, to specific circumstances of reproduction, e.g. resolution, print conditions, etc.\n\nWe can enumerate ways in which this is so -\n\n1. Size - Glyphs designed for use as headlines need different shapes & emphasis than a glyph to be used at 6pt.  \n2. Paper - Newsprint is different than glossy sheet. Glyphs must change accordingly  \n3. Screen - Glyphs have to be designed with awareness of grid & in some cases rendering engines  \n4. Film - Spikes to ensure a sharp edge etc.  \n5. Hyper large building size type probably has it's own needs...  \n6. Neon too.  \n7. Driving signage...\n\nHave I left anything out? I bet I have. Undersea type?\n\nOn the other hand are you really saying that comfort in reading due to glyph distinctiveness, consistancy, color rythym & so on are not important? No, you are are saying doing a superb job with these ( & maybe even with notan ) can offer very marginal additional benefit in readability beyond that which exists in designs we have already got.\n\nRight?\n\nIf so, then the job of a type designer must be to match type to a purpose and the condition of use & then maybe to meet aesthetic criteria if needed.\n\nSpeed is not going to change too much - so why be too concerned?\n\nHave I understood you?\n\n"
    },
    {
      "time": "28 Jul 2005 — 5:20pm",
      "content": "_you are are saying doing a superb job with these ( & maybe even with notan ) can offer very marginal additional benefit in readability beyond that which exists in designs we have already got._\n\nYes, that is a good summary of my position. Note, however, that I see this as a starting position, not as a concluding position. It defines the functional foundation of readability on which rest the other aspects of type design, such as those you enumerate and also, of course, the cultural and aesthetic aspects. I've often been at odds with Hrant when he has seemed to suggest that readability is a difficult to achieve goal; I think of it as a prerequisite: one that is reasonably easy for an experienced type designer to achieve, thanks to readerability. Readerability is really what makes the immense richness of typography possible; if reading were difficult and required the designer's attention to be completely focused on maximising readability, there would probably only be two or three type designs that met the narrow criteria.\n\n"
    },
    {
      "time": "28 Jul 2005 — 6:15pm",
      "content": "\\>Have I proved my point?\n\nGiven how unsuited Eunoia is to text--you said you designed it to shimmer and sparkle--you have moved it astonishingly far toward text. But as I said in the original thread, whether it succeeds as a text font depends on what you mean by 'text font.'\n\nIf by a text font you mean a font that can be read in masses of text, such as in a book or long magazine article, my answer would be, no, you have not proved your point. Now I don't think any of your comparitor fonts are 'text' fonts by this standard, either. They are suitable for a few paragraphs at most in an ad or report, in my opinion. But even by comparison with those three, your Eunoia--which will be admiradably eye catching for display--still has too much shimmer compared to the other fonts, a quality I think is undesirable in a text font.\n\nOn the issue of the role of science, I don't get what the argument is about. I think the reality is that science hasn't yet penetrated to the reading process to the point to give good advice type designers. Maybe Kevin Larson will discover new facts about spacing that will help type designers. If so great; I think designers would be foolish to ignore these facts, if they are relevant to the design brief they are undertaking.\n\n"
    },
    {
      "time": "28 Jul 2005 — 6:47pm",
      "content": "\\>If by a text font you mean a font that can be read in masses of text, such as in a book or long magazine article,\n\nNo, I mean immersive reading in general, not just long texts.  \nThe sample I showed would be suitable for a magazine sidebar.\n\nI admit it's a little too contrasty for many applications, and condensed sans serifs don't make good book faces, but it's still a genuine text face, thanks to readerability.\n\n"
    },
    {
      "time": "28 Jul 2005 — 9:52pm",
      "content": "John - I agree with you about the richness of type. Any idea what lies out there in the great beyond - that is beyond the starting point? Any guesses?\n\nNick - What do you think of John's assertions? It sounds like you like the basic tenets of readerability as expressed so far no?\n\nNick - Ah so THATS what you mean. Of course this is never going to satisfy Hrant but ...  \nI do agree that it could be used as a magazine sidebar but I dont know that I would with this version. I guess one mans text face is another man's display face. The magazine would have to be pretty funky.\n\nI am still impressed that you did it all the same.\n\n"
    },
    {
      "time": "29 Jul 2005 — 3:24am",
      "content": "\\>What do you think of John’s assertions?\n\nWe share the same understanding, if not the same taste.\n\n"
    },
    {
      "time": "29 Jul 2005 — 9:53am",
      "content": "Where are the pertinent, focused questions, people? I don't want to sound condascending, but I do think all the noise -some of it wonderful, but still distracting- is preventing this thread from becoming truly fruitful.\n\nAsking good questions is the real \"challenge\".\n\nhhp\n\n"
    },
    {
      "time": "29 Jul 2005 — 12:17pm",
      "content": "_Any idea what lies out there in the great beyond - that is beyond the starting point? Any guesses?_\n\nHow about most of the history of type design? It seems to me that consciously or otherwise, the majority of type design has accepted the reality of readerability, and has legitimately focused on the cultural and aesthetic aspects of typography. Every once in a while in that history, usually in response to changes in media, the basic question of readability resurfaces and is reconsidered _in the particular circumstances._ What this tells us is that readability is an issue of particularity, and is generally taken for granted. Quite simply, the cultural and aesthetic aspects of e.g. Bodoni's types are more important than their relative readability compared to, say, Caslon's types, because readerability can handle them _well enough._ We can object that these romantic types are not easy to read, even in measurable terms, but the fact remains that entire generations of Italian and French readers read almost nothing else, and they read a lot and they wrote a lot, and they painted a lot, and they composed a lot, and these types formed part of the cultural milieu that inspired them. And that is probably more important than the fact that they cannot be considered optimally readable. So this is what I think lies beyond the prerequisite of readability.\n\nNow, while readerability allows us to take readability for granted much of the time, we shouldn't always take it for granted, because that would just make us lazy. As alluded to above, developments in new reproduction technologies and media may demand new approaches to type design, and at such times the question of readability should be reviewed. One shouldn't presume that what worked in one medium will work in another, although often one will find that lessons and experience do carry over.\n\nAlso, we shouldn't underestimate the cultural and aesthetic achievements that might result from seriously thinking about readability, achievements that might well be more significant than any measurable improvement in reading speed and accuracy. What benefits type design is the seriousness of the thinking. I think Legato is an excellent example of this.\n\n"
    },
    {
      "time": "3 Aug 2005 — 12:57pm",
      "content": "Hrant, ask some! I want to know what you think needs asking.\n\nAlso, this is a bit far fetched ( but so was this project ) - but what if nick let us have eps vectors of say 3-5 important letters from the new text version & let us change them to indicate what we think it would take to make a genuine text version. This way our ideas are made a bit more visible. Any takers? Is this a decent enough number of letters?\n\nNick - What do you think of this idea?\n\nJohn, I imagine I can intuit some of what you mean by seriousness when I look at legato - but it seems so wonderful I am overwhelmed. I could just study it for a long time. - Actually that is what I am going to do\n\nand I found this\n\n[http://www.typophile.com/forums/messages/30/53822.html](http://web.archive.org/web/20131012214608/http:/www.typophile.com/forums/messages/30/53822.html \"http://www.typophile.com/forums/messages/30/53822.html\")\n\nwhich I am still reading\n\nBut what is that you notice that make you use the word serious?\n\nWhoa! I didn't ever hope to get so much from Evert! Especially now that he's gone.\n\n"
    },
    {
      "time": "3 Aug 2005 — 4:47pm",
      "content": "\\>Nick - What do you think of this idea?\n\nI'm afraid I don't think there's much point in it -- I've taken this typeface just about as far as it can go in the direction of being a legible text face, while still maintaining its personality. Sure, the contrast could be reduced, and changes made to the letter shapes to increase character distinction (eg an asymmetric \"n\"), but then it wouldn't be the same typeface, it would start to turn into Dax.\n\n"
    },
    {
      "time": "4 Aug 2005 — 5:11am",
      "content": "\"it would start to turn into Dax\"\n\nor maybe UPS :-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Aug 2005 — 6:04am",
      "content": "I remember Evert Bloemsma leading a discussion in our typography-class at the academy, about legibility. He seemed to be an advocate for legibility as a function of typedesign and environment (paper, printing conditions, lighting, etc.).\n\nI think that in the end this a nature-nurture like discussion.\n\nScientific understanding almost dictates that there should be geometrical properties of type that enhance legibility (i.e. speed up perception, in the same way a symmetrical form takes less time to perceive and recognize than an assymmetrical one. A friend of mine just finished his thesis on this subject, proving that symmetry and repetition are perceived using less 'processing power').\n\nOn the other hand, there is Evert's point. Reading is not a one dimensional process. Environment does play a crucial part. Rather like genes - the most well adapted genotype can still fail miserably in a hostile environment.\n\nThis places the typographer somewhere in the middle between hard facts and soft knowledge. I see both ends as mere viewpoints. Looking through science I understand and learn. Following Evert I understand an learn.\n\n----------------------------------------------------  \nMy work is a game. A very serious game [M.C. Escher]\n\n"
    },
    {
      "time": "4 Aug 2005 — 7:57am",
      "content": "Bart, that's exactly how I feel. You're so lucky to have been Evert's student.  \nMost students are simply trained to mimic the mainstream - sad.\n\nHowever, as much as I love the topic of readability, and anything to do with Evert\\*, I would like to see the good direction taken by Eben and Nick built upon. They've managed to regain focus here - let's help that. Nick's post specifically contains one of the main keys to this whole conundrum.\n\n\\* See my article here: [http://www.designinflight.com/](http://web.archive.org/web/20131012214608/http:/www.designinflight.com/ \"http://www.designinflight.com/\")\n\nThat said, I think your introduction of the \"symmetry factor\" is wonderful, and deserves its own thread. I myself have a few ideas concerning that. So it would be great if we could springboard from it... but not here! :-)\n\nhhp\n\n"
    },
    {
      "time": "4 Aug 2005 — 8:48am",
      "content": "Point taken, hrant. :-)\n\n----------------------------------------------------  \nMy work is a game. A very serious game [M.C. Escher]\n\n"
    },
    {
      "time": "4 Aug 2005 — 8:58am",
      "content": "And don't ya just love the use of Alfon and Giacomo in Design In Flight!\n\n"
    },
    {
      "time": "4 Aug 2005 — 9:04am",
      "content": "for a followup to John Hudson's readerability comments in this thread, see: [http://typophile.com/node/14373](http://web.archive.org/web/20131012214608/http:/typophile.com/node/14373 \"http://typophile.com/node/14373\")\n\n"
    },
    {
      "time": "8 Aug 2005 — 10:42am",
      "content": "Is this thing still on?\n\nhhp\n\n"
    },
    {
      "time": "8 Aug 2005 — 12:21pm",
      "content": "There is so much to read on this & these related threads that maybe everybody is still chewing on what's on their plates already...\n\nI am trying to paint my houses' trim this week & it's cutting into typophilia time.\n\n"
    },
    {
      "time": "8 Aug 2005 — 12:27pm",
      "content": "\\> everybody is still chewing on what’s on their plates already…\n\nHowever, this thread:  \n1) went quiet before the current -wonderful- explosion.  \n2) is the most challenging.\n\nI recommend re-reading Nick's most-recent post carefully, to see the key.\n\nAnd where's Forrest?\n\nhhp\n\n"
    },
    {
      "time": "14 Nov 2008 — 1:47am",
      "content": "dear nick\n\ni'd like to read this interesting thread, but the link to your font is broken:  \n [http://www.shinntype.com/Eunoia\\_Text.pdf](http://web.archive.org/web/20131012214608/http:/www.shinntype.com/Eunoia_Text.pdf \"http://www.shinntype.com/Eunoia\\_Text.pdf\")\n\nmight you restore it?\n\ndenis\n\n"
    },
    {
      "time": "14 Nov 2008 — 2:09am",
      "content": "I officially declare today 'Day of the Living Dead (Threads)'\n\n"
    },
    {
      "time": "14 Nov 2008 — 3:26am",
      "content": "This phenomenon even has a name: _necroposting_\n\nI sincerely hope it won't make typophiles into necrophiles.\n\n"
    },
    {
      "time": "14 Nov 2008 — 6:43am",
      "content": "The nerve, to discriminate against necrophiliacs!  \n(Reminds me of a _killer_ cartoon in my college paper.)\n\n--\n\nSeriously: I was looking for this thread the other day\\* but couldn't find it.  \nNick, could you _please_ revive that PDF, or at least a GIF rendering?\n\n\\* Because of this:  \n [http://news.bbc.co.uk/today/hi/today/newsid\\_7697000/7697762.stm](http://web.archive.org/web/20131012214608/http:/news.bbc.co.uk/today/hi/today/newsid_7697000/7697762.stm \"http://news.bbc.co.uk/today/hi/today/newsid\\_7697000/7697762.stm\")\n\nhhp\n\n"
    }
  ]
}
