{
  "id": "13929",
  "title": "Licensing Fee",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "hello\n\nim pretty much a beginner when it comes to typography, but somehow i got the chance to maybe see one of my fonts being used in a pretty big videogame. this is really exciting for me, but im being asked to tell them what im thinking of in terms of licensing fees.  \nnow, i dont have much information about this business. i thought that they'd be able to buy a font and use it as much as they want (lets say helvetica neue for example), paying an amount of money for one time. but how much?\n\ni already did the font more or less, i \"only\" have to do kerning and add some accents so that they can make a spanish/french/german interface, etc.\n\ni dont want to say something that is too high or too low, thats why im asking here.\n\nthanks for ANY help!  \nthierry blancpain\n\n",
  "author": "thierry blancpain",
  "time": "18 Jul 2005 — 9:10am",
  "uid": "7345",
  "comments": [
    {
      "time": "21 Jul 2005 — 12:47pm",
      "content": "If you're a real rookie, with no track record of commercial success, that first sale is an important milestone. Unless you are totally convinced that the font would generate a LOT of income if you retained the rights, rather than selling them, try asking for 500€, but be willing to bargain down to half that amount.\n\nI am sure other people will tell you that 250€ is not enough, but it's 250€ more than you have now.\n\n"
    },
    {
      "time": "6 Aug 2005 — 12:00pm",
      "content": "I don't think the 250 Euro is a realistic number at all. Way too low! 500 is way too low as well. Questions you should have asked.  \nHow many copies of the game will be sold?  \nWhat will the retail price of the game be?\n\nDepending on those numbers, you would be well within excepted practices to charge a whole lot more.\n\nIt might have been 250 Euro you didn't have before, but lowballing prices affects the entire industry. Would it surprise you to know that your probably could have charged 10 to 16 times that \"high\" price, and maintained the rights to it.\n\nWake up and smell the licensing!!!\n\n"
    },
    {
      "time": "6 Aug 2005 — 12:01pm",
      "content": "That would be \"accepted\" practices. Sorry I got a bit excited.\n\n"
    },
    {
      "time": "8 Aug 2005 — 4:54am",
      "content": "_Would it surprise you to know that your probably could have charged 10 to 16 times that “high” price, and maintained the rights to it_\n\nYes, James, Thierry could have ASKED that price but, since by his own admission he's a newbie with no sales track record and no established reputation, he could also have LOST the sale by asking that price. Please can the \"artistic integrity\" and \"affecting the whole industry\" stuff -- everyone's got to start somewhere, and making the sale can lead to better things down the road.\n\n"
    },
    {
      "time": "8 Aug 2005 — 5:40am",
      "content": "\"You can make money in the font business\" Please repeat this over and over, till you believe it..\n\nIt doesn't matter what his \"sales record\" is or his reputation. He created a font that a \"pretty big video game\" manufacturer was interested in. That is really all that matters. Do you think they care who created it? The fact that he sold it for 250 euro, now makes that the price the next time that company wants to license a font. Better to lose a sale asking the fair price than to get one for peanuts. \"Better things down the road\" will mean he is the guy to go to for a cheap license.\n\nI never said anything about \"artistic intergrity\" this is business.\n\n"
    },
    {
      "time": "8 Aug 2005 — 6:16am",
      "content": "_Better to lose a sale asking the fair price than to get one for peanuts. “Better things down the road” will mean he is the guy to go to for a cheap license_\n\nSo, I suppose that when, say, Comcast offers broadband internet access for $19.95 a month for six months, then $42.95 a month thereafter, they fully expect people to drop the service after the price goes up? Or, do they expect that, once users have tried broadband, they won't want to go back to dial-up again, and will pay the higher price? Special introductory offers can apply to other things, too...\n\n"
    },
    {
      "time": "8 Aug 2005 — 6:25am",
      "content": "Licensing IP and buying cable services are a bit different, no? Please be my guest and conduct your business anyway you want. I really don't care.\n\nBut I have never seen \"special introductory offers\" work in a IP licensing model or for any design service for that matter. \"Oh will you do this job on the cheap, I promise the next one will be for a higher price.\" The next one never really comes through does it? I always offer to do the first job at full price and once we establish a relationship I can give you a break on future jobs.\n\nOnce you are identified as someone who asks for peanuts in exchange for your work, changing that perception is a very difficult job.\n\n"
    },
    {
      "time": "8 Aug 2005 — 6:29am",
      "content": "OK, fine: you win. May you live long and prosper.\n\n"
    },
    {
      "time": "8 Aug 2005 — 9:57am",
      "content": "Solution:\n\nNewbies: ask early.  \nPros: reply promptly.\n\nhhp\n\n"
    },
    {
      "time": "8 Aug 2005 — 11:42am",
      "content": "\\> Newbies: ask early.\n\nBut not during TypeCon!\n\n\\> Pros: reply promptly.\n\nKesh got a prompt response when the question was posted to the general forum...\n\n[http://typophile.com/node/13963](http://web.archive.org/web/20131015154929/http:/typophile.com/node/13963 \"http://typophile.com/node/13963\")\n\nCheers, Si\n\n"
    },
    {
      "time": "8 Aug 2005 — 12:47pm",
      "content": "_Solution:_\n\nNewbies: ask early.  \nPros: reply promptly.\n\nActually, Hrant, the solution is not to try to argue with someone who says apples are oranges when it suits his argument.\n\nShow business is the only business like no other; all other business is business, and what works, works. Consider ATMs: when they first appeared, transactions carried no fees, neither by the owner of the terminal nor your bank. AFTER people started using them more and more, the fees appeared, and nobody kicked. Now, some poor slob will pay $4.00 in fees to get $20.00 out of his own bank account -- in effect, 20% interest to borrow the money from himself. Introductory offers work.\n\nIf James feels that his livelihood is threatened by cut-rate fontoliers, that's one thing...I am sure he has NEVER sold any of his work at a discount. But EVERYONE has to start somewhere. If the buyer of Thierry's typeface likes his WORK, they'll come back to him, at which time he can explain the \"special introductory offer,\" and ask for more. If the buyer likes his PRICE, they can find another newcomer looking for a feather in his cap, and cut a deal with him.\n\n"
    },
    {
      "time": "8 Aug 2005 — 1:02pm",
      "content": "You may be sure of yourself, but please don't ever be sure of what I have or have not EVER or NEVER done.\n\nAs to Thierry's fonts, perhaps people will come back. I just think you gave him poor advice regarding a major vido game maker wanting to license his work. That sort of license deal is complicated and potentially very lucrative even for a beginner.\n\n"
    },
    {
      "time": "8 Aug 2005 — 1:36pm",
      "content": "they can find another newcomer looking for a feather in his cap, and cut a deal with him\n\nThis is the problem. They will almost certainly do this, and might recommend that others do it, too, creating a bad marketplace assumption (for type designers).\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20131015154929/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "8 Aug 2005 — 1:46pm",
      "content": "I have to agree with James on this one. It is an almost impossible job to change the opinion of the client, when you've made yourself cheap. I know, I've had exactly that over the last months. The client was always begging me to go down with the price, because he was a poor and needy starter. I went along with him, because the project was very interesting.  \nBut now I'm stuck in his opinion as the designer who's price you can split in half and get away with it. I had a fight with him about that and told him not to work for him anymore. After he thought about it (and sadly tried some other designers) he came back to me. This time I won the fight.\n\nMy argument is the same as James'. It makes no difference how long you've been in the type business and how many prizes you took home. Ask a fair and reasonable marketprice. It's the normal price and they will pay for it, because too they know it IS the marketprice!! You can be sure about that.\n\nKesh, go for it, and ask the market price. If they like it that much, it's worth it.\n\nGood luck,  \n®ené\n\nPS I didn't see anything indicating that apples should be oranges...\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20131015154929/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": "8 Aug 2005 — 2:10pm",
      "content": "_I just think you gave him poor advice regarding a major vido game maker wanting to license his work_\n\nWell, James, at least I _gave_ him some advice, which is more than I can say for ANYONE else. While the high practitioners of the typographic arts discuss, _ad infinitum_, the arcana of the game elsewhere, requests like Thierry's get ignored by the illuminati.\n\n_please don’t ever be sure of what I have or have not EVER or NEVER done_\n\nAll I have to go by is what you say: if you recommend never cutting prices, I must assume that you never cut prices yourself...unless, of course, you are a \"do as I say and not as I do\" kinda guy.\n\n"
    },
    {
      "time": "8 Aug 2005 — 2:21pm",
      "content": "\"Once you are identified as someone who asks for peanuts in exchange for your work, changing that perception is a very difficult job.\"\n\nVery well said James and very true. The peanut man gets to sell peanuts. As soon as someone wants a Steak, they call in the steak guy. Not just because they think people who sell peanuts don't know anything about steak, but because it never even occurs to the client that peanut guys are even in the game.\n\nChrisL\n\n"
    },
    {
      "time": "8 Aug 2005 — 2:46pm",
      "content": "_But now I’m stuck in his opinion as the designer who’s price you can split in half and get away with it. I had a fight with him about that and told him not to work for him anymore. After he thought about it (and sadly tried some other designers) he came back to me. This time I won the fight._\n\nPlease 'splain to me why this DOESN'T reinforce my observation that, if the client likes your WORK, they will come back and accept the fact that the lower price was a SPECIAL INTRODUCTORY-FREAKING OFFER!!!\n\nNow that I think about it, don't explain. A lot of you people are really pathetic: you can offer oh-so-enlightened criticism at the drop of a hat but, when it comes to offering advice to a newcomer who asks for it, you roundly ignore those entreaties until someone else drops his hat in the ring, then pounce on the advice offered. Fine...unlike many of the prolific posters hereabouts, I have better things to do with my time.\n\n"
    },
    {
      "time": "8 Aug 2005 — 3:30pm",
      "content": "The price was NOT a special introductory-freaking offer. From that moment on ALL the prices had to be that low, because I started off to low with him. A client can't imagine why a logo now costs 1.500 and the next time 3.000 euro.  \nThe reason he came back to me, was because the other designers didn't let him do that to them. They were more clever than I, at the time.\n\nNo go do something better with your time.\n\nThierry, I saw your website and like your work. I see that you have more 'free work' than 'paid work' so perhaps you are afraid to ask a reasonable price because you are a newby?  \nSince ANYONE else didn't give you any advise, I'd say go up with the price and I'm sure they'll still buy it from you. But no less than 2.500 euro. :D\n\nRegards,  \n®ené\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20131015154929/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": "8 Aug 2005 — 8:25pm",
      "content": "\\>Well, James, at least I gave him some advice, which is more than I can say for ANYONE else.\n\nYou missed my post - Tiffany, Chris and myself gave him prompt advice when he posted this question to the general forum.\n\nSi\n\n"
    },
    {
      "time": "9 Aug 2005 — 5:12am",
      "content": "_You missed my post - Tiffany, Chris and myself gave him prompt advice when he posted this question to the general forum_.\n\nSo I did, so, not everyone is pathetic, or rather apathetic.\n\nThierry, why not take the wonderful advice the other folks here have given, and ask -- no, DEMAND -- at least 2,500€ for the rights to your font. Then, please let us know the results.\n\n"
    },
    {
      "time": "9 Aug 2005 — 1:06pm",
      "content": "Thierry, thanks for asking such a good specific question, some of us other newbies here certainly need to know such details.\n\nNick, as a freelance designer I think it might be unreasonable to go so low in price. After all, it sometimes actually does come down to eating. Why are you so upset?\n\nOn that note, I must also ask that when it DOES come down to whether or not you will be able to pay your rent or eat, isn't there a such thing as going \"too high\"?\n\n"
    },
    {
      "time": "10 Aug 2005 — 8:52am",
      "content": "_as a freelance designer I think it might be unreasonable to go so low in price. After all, it sometimes actually does come down to eating. Why are you so upset?_\n\nI fully realize that we all need to make a living: that's not the point. What the other \"contributors\" to this discussion fail to realize is that the typeface in question **is not going to be marketed as a typeface** : it's going to be used in a videogame interface. The manufacturer is not going to realize any additional revenue by using Thierry's typeface: they just happen to like it.\n\nIf the manufacturer WERE intent on reselling the typeface, then I would agree that the suggested sale price was far too low; however, this is not the case, and the other voices here don't seem to GET that. Under these circumstances, my advice was perfectly reasonable and offered Thierry an excellent chance of making the sale, and putting that feather in his cap. Of course, he **can** ask for much more, but I sincerely doubt that he would get it.\n\n"
    },
    {
      "time": "10 Aug 2005 — 12:56pm",
      "content": "IMHO: Nick, I think you don't GET it. It makes no difference if the fonts was going to be marketed as a typeface or not. The creation of the font ánd the use of it in the videogame has it's price. 500 euro for itself is way too low. And telling Thierry that he has to be willing to be bargained down to 50% of his price, is just plain bad advice. End of story.\n\nAnd that's all I'm going to say to this thread. I'm going on a holiday for two weeks right now and forget this conversation ever took place.\n\n®\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20131015154929/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": "11 Aug 2005 — 4:38am",
      "content": "_It makes no difference if the fonts was going to be marketed as a typeface or no_\n\nNo, René, YOU don't get it. Business is business: if an intellectual property generates revenue for a company, it should be priced one way; if that property is simply going to be used as window dressing, it should be priced another way. Insisting that the two instances are the same is, besides pigheaded ignorance, a sure way to lose a sale. It is _your_ advice which is bad, under the circumstances, because it is totally disconnected from the reality of the situation.\n\n"
    },
    {
      "time": "11 Aug 2005 — 4:44am",
      "content": "Fonts aren't window dressing. They convey textual information. Even in video games.\n\n"
    },
    {
      "time": "11 Aug 2005 — 5:17am",
      "content": "_Fonts aren’t window dressing. They convey textual information. Even in video games._\n\nTell that to the man signing the check.\n\n"
    },
    {
      "time": "11 Aug 2005 — 5:29am",
      "content": "wow, havent looked into this thread for a long time it seems :)\n\n<cite>Thierry, I saw your website and like your work. I see that you have more ‘free work’ than ‘paid work’ so perhaps you are afraid to ask a reasonable price because you are a newby?</cite>\n\nthats more a wrong \"labelling\" than really what you think. my \"free\" work is just personal art i've done for myself, not unpaid commercial work. the paid work is some of the stuff that i got paid for, the commercial stuff.\n\nright now its totally unclear if they gonna use it or not, but i seriously doubt it. but thanks alot for the discussion, it gave me some insight about pricing and licensing!\n\n"
    },
    {
      "time": "11 Aug 2005 — 6:16am",
      "content": "You're welcome, Thierry; sorry that the advice was so contradictory. I offered mine because I _have_ assigned exclusive rights to one of my freeware fonts (Laconick) to a videogame manufacturer (Electronic Arts), and I know what the market will bear, which is a claim I doubt _any_ other contributors here can make. But I could be wrong...\n\n"
    }
  ]
}
