{
  "id": "13933",
  "title": "kisbefe2",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Yeah, I'm recycling names. The only influences on this face so far have been rum, burbon, beer, and the lc -b- from the earlier kisbefe. Any suggestions on how to improve what I have so far? [here is a sample](http://web.archive.org/web/20150123211311/http:/www.grodworks.com/temp/firstdraft.pdf \"kisbefe2 sample\")\n\n",
  "author": "grod",
  "time": "18 Jul 2005 — 9:59am",
  "uid": "5267",
  "comments": [
    {
      "time": "20 Jul 2005 — 2:31am",
      "content": "Well, since no one has anything to say I guess I've managed to create perfect letters. Here is a [sample of the ligatures. Because the ligatures depend on the basic character forms it would be nice if the basic character forms really were perfected before I make too many more (I'm planning on somewhere between 20 and 500).](http://web.archive.org/web/20150123211311/http:/www.grodworks.com/temp/errligs_draft1.pdf)\n\n"
    },
    {
      "time": "21 Jul 2005 — 6:09am",
      "content": "[regular and bold](http://web.archive.org/web/20150123211311/http:/www.grodworks.com/temp/thirddraft.pdf)\n\n"
    },
    {
      "time": "26 Jul 2005 — 4:40pm",
      "content": "\\*crickets\\*\n\n"
    },
    {
      "time": "27 Jul 2005 — 10:40am",
      "content": "Forgive me Noah, as I've not read all of your other threads about this face. I'm a novice type designer and still have a lot to learn, but I can offer a little bit of a few things that I feel when looking at your face.\n\n1) I haven't quite figured out the logic of your rounded corners vs. your squared off corners. I don't see any consistency in that design aspect.\n\n2) Watch the weight of your strokes and stems, for example your K needs more weight on the strokes because your stem looks much heavier. On your R the bowl needs to be heavier and the weight of your junction strokes need to be consistent with your D and B.\n\n3) Your X doesn't quite make sense to me, it seems you're going for a sans serif with a high stroke contrast... I think you can play it up more with this character. The rounded corners also don't quite work for me.\n\n4) The Q has too many features. I would simplify it.\n\n5) Your \"c\" has the perception of being too narrow in comparison to your b, d, and e. Your e and c look like they're from different planets.\n\n6) V and A need a closer relationship.\n\n7) None of your hooks (J, j, g, y) have a consistent style.\n\n8) Crossbar of \"t\" is too heavy.\n\nI hope that's not too harsh. All in all, I like the ideas, but if this face is to be used at all for body copy you have to limit the number of features. People should read words, not identify individual letters. While your letters are nice to look at, there doesn't seem to be a complete harmony between them yet. I think what you have posted is a definite improvement over before, and I have seen your other type designs posted here as well and I think you have a promising future ahead. I hope this helps, good luck.\n\n"
    },
    {
      "time": "28 Jul 2005 — 5:44pm",
      "content": "tbiddy, Thanks. I've revised some, tell me what you [think](http://web.archive.org/web/20150123211311/http:/www.grodworks.com/temp/kis2__rRev2.pdf \"kisbefe2 revision\") I left the hooks because every strategy to harmonize them ended up ugly.\n\n"
    },
    {
      "time": "28 Jul 2005 — 8:22pm",
      "content": "Some definite improvements. Still gotta watch your bowl balance and junction strokes. At the very least your J and j have to match stylistically. By the way, what is your purpose for this face?\n\n"
    },
    {
      "time": "28 Jul 2005 — 8:46pm",
      "content": "I was originally thinking text settings but now I'm thinking it works better around 16pts, though I'm never certain how I'm supposed to determine the best point size.\n\n"
    },
    {
      "time": "28 Jul 2005 — 9:57pm",
      "content": "Here is another revision and two examples of possible uses. ... [more](http://web.archive.org/web/20150123211311/http:/www.grodworks.com/temp/more.pdf \"more revisions\")\n\n"
    },
    {
      "time": "29 Jul 2005 — 1:51pm",
      "content": "your question prompted me to try to make a version more suitable for text, this is still rough, but **[here it is](http://web.archive.org/web/20150123211311/http:/www.grodworks.com/temp/kisbefe2book.pdf)**\n\n"
    },
    {
      "time": "1 Aug 2005 — 11:46am",
      "content": "Absolutely amazing. About 5 or 6 years ago, when I started messing around with Font Design, I created a typeface almost exactly to what you have created here. I have since ditched the font for a later revival. Absolutely amazing. I'll post a picture of it when I get home from work, my very old website wasn't archived on the 'way back' machine.\n\n"
    },
    {
      "time": "1 Aug 2005 — 12:33pm",
      "content": "I did my research you can actually see previous versions of my font, which is called 'whipple.' [This](http://web.archive.org/web/20150123211311/http:/typophile.com/node/3715) is the first round I posted almost three years ago. Then I revised [whipple](http://web.archive.org/web/20150123211311/http:/www.typophile.com/forums/messages/29/whipple2-5173.swf) a little bit more.\n\nWhile the letter forms aren't exact, the similarities are pretty amazing. My letters are much more square, while your letters are slightly more rounded. There are glaring issues in my character design & kerning efforts, however I was working on that font almost two years ago and still haven't finished.\n\nI'm not saying that you copied my font by any means, but it's darn close.\n\n"
    },
    {
      "time": "1 Aug 2005 — 5:26pm",
      "content": "I'm sorry to disapoint, however; not only is this the first time I've ever seen your font but I also fail to see any similarities between \"whipple\" and kisbefe2 beyond the fact that they are both sans serif. Whipple has irregular strokes and a handwritten feel (the loop in the \"d\" or the exit stroke on the \"t\" are two examples).\n\nFrankly, were I not convinced that your \"I'm not saying that you copied my font by any means\" is not an attempt at apophasis so much as a poor choice of words, I would be offended by the implication of your statement and amazed that you would attempt to make such a tenuous connection. The evolution of kisbefe2 can be traced through this forum from its beginnings as a one hour doodle [shown here](http://web.archive.org/web/20150123211311/http:/www.typophile.com/forums/messages/29/nsans1a-65284.pdf) ( [thread here](http://web.archive.org/web/20150123211311/http:/typophile.com/node/9241)) to a more mature but still rather poor face called [KisbefeSans](http://web.archive.org/web/20150123211311/http:/typophile.com/node/12522) and later just Kisbefe. The proportions, stress, and style are very different.\n\n"
    },
    {
      "time": "1 Aug 2005 — 5:28pm",
      "content": "...should read... The proportions, stress, and style are very different between kisbefe2 and your font.\n\n"
    },
    {
      "time": "2 Aug 2005 — 2:00am",
      "content": "[Here is a slightly more refined](http://web.archive.org/web/20150123211311/http:/www.grodworks.com/temp/k2b2.pdf) version of the text style. tbiddy, hrant, or anyone else, would you care to comment?\n\n"
    },
    {
      "time": "2 Aug 2005 — 7:49am",
      "content": "The stroke contrasts in your diagonals are all over the place. I'd recommend looking at existing contasty fonts for guidance (unless you're trying to break new ground in contrast application - but that's hard).\n\nhhp\n\n"
    },
    {
      "time": "3 Aug 2005 — 2:20am",
      "content": " **hrant** , [how about now](http://web.archive.org/web/20150123211311/http:/www.grodworks.com/temp/k2b3.pdf \"better contrast on the diagonals?\")?  \nThanks,  \n-Noah\n\n"
    },
    {
      "time": "3 Aug 2005 — 10:11am",
      "content": "OK dude, here's the deal:  \nI'll do some more critting, but then I have to stop. Really. Sorry.  \nHas to do with my New Years resolution, you see.\n\n--\n\nThe diagonals are nicely fixed.\n\nThe terminals of the \"C\" don't work: just do what you did in the \"G\".\n\nI'd lower the bar of the \"F\".\n\nI'd give the \"P\" a bigger head.\n\nI'd worry about the clotting in the \"Q\".\n\nThe \"S\" is a bit **too** malformed.\n\nUC Widths:  \nMake the \"K\", \"W\" and \"Y\" wider.  \nMake the \"U\", \"X\" and \"Z\" narrower.\n\nThe \"f\" should have a thinner stroke at top.\n\n\"i\"/\"j\": raise dots\n\nThe \"w\" is a bit wide.\n\nSpacing: too tight.\n\nhhp\n\n"
    },
    {
      "time": "3 Aug 2005 — 2:09pm",
      "content": "Your \"E\" and \"F\" are too narrow as well.\n\nThe hook on your lowercase g still draws too much attention.\n\nThere are a lot of proportion issues here that you should work out first. Your stem and stroke weights are also inconsistent. I would say you should take a break for awhile and really make some major adjustments before posting. Look at Optima and study other typefaces with high stroke contrast.\n\n"
    },
    {
      "time": "3 Aug 2005 — 8:55pm",
      "content": "Hrant, thanks for the feedback it is, as usual, incredibly helpful. And thanks for bending your resolution to help out a total newbie stranger. If more people on this board were willing to take the time to aid beginners such as myself everyone would benefit.\n\ntbiddy, would you suggest a bicameral g instead? And thanks for taking the time to comment.  \n<cite>I would say you should take a break for awhile and really make some major adjustments before posting.</cite>  \nMaybe so.\n\n"
    },
    {
      "time": "3 Aug 2005 — 9:27pm",
      "content": "\\> If more people on this board were willing to take the time  \n\\> to aid beginners such as myself everyone would benefit.\n\nYyyup.\n\nhhp\n\n"
    },
    {
      "time": "7 Aug 2005 — 1:01pm",
      "content": "OK, I took a break, made some changes, and came back for more input. [here is another sample](http://web.archive.org/web/20150123211311/http:/www.grodworks.com/temp/k2b4.pdf \"kisbefe2 book revision who\\_the\\_hell\\_is\\_counting?!\")\n\n"
    },
    {
      "time": "7 Aug 2005 — 2:23pm",
      "content": "Wow Noah, some MAJOR improvements here. Two things that jump out at me, your \"c\" and \"e\" widths need to match more closely and the hook of your \"y\" doesn't work for me. I think you can go a little more ornate with your \"y\". All in all...great tweaking from the last showing.\n\n"
    },
    {
      "time": "7 Aug 2005 — 4:14pm",
      "content": "tbiddy, I've fixed the c&e and I'll post them when I've made a more substantial revision. I'm interested in your opinion on the \"y\". As it stands it is bland and I'm having trouble rescuing it from that fate. I've tried half a dozen variations and made one that seems a slight improvement **[here](http://web.archive.org/web/20150123211311/http:/www.grodworks.com/temp/yy.swf \"two y's\")** but if you can think of something better feel free to post a sketch or link to an example I've no problem with visual aids :-)\n\n"
    },
    {
      "time": "10 Aug 2005 — 8:53pm",
      "content": "Listen to your typeface. What I mean by that is look at the structure of your other characters to see what best matches. What I would do is look to the hook of your \"g\". If that doesn't work, try other parts of your characters to match a consistent flow. You're getting really close...\n\n"
    },
    {
      "time": "12 Aug 2005 — 8:30pm",
      "content": "I've made some changes and begun working on a display version. What **[do you think](http://web.archive.org/web/20150123211311/http:/www.grodworks.com/temp/k2b5.pdf)**?\n\n"
    },
    {
      "time": "17 Aug 2005 — 2:11pm",
      "content": "[Regular, Italic, Bold](http://web.archive.org/web/20150123211311/http:/www.grodworks.com/temp/k2b6.pdf \"Regular, Italic, Bold\"). Any suggestions on the Italic? It is narrower than the roman, but not by much and is more an oblique than an italic. I crave feedback (how am I supposed to learn [short of paying for a course, something I would do if I could] if those who could teach me remain silent?)\n\n"
    }
  ]
}
