{
  "id": "13957",
  "title": "A case for a specialized TypoWiki",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "So as I've been writing wiki entries over the past few days, more than once I've found myself consulting wikipedia.org. I am in awe of the Wikipedia. Somehow they have created a community that with a diverse yet consistent voice. The information presented is almost always relevant and just enough to get started into any subject. The authors, for the most part seem to understand their audience, who for the most part are not specialists. They are most likely a member of the general public, looking to gain a basic understanding of a topic. Wiki authors understand this concept of a broad audience partly because of wikipedia's encyclopedia metaphor.\n\nNeedless to say, I'm particularly interested in the articles relating to type design. Unfortunately, there is a lot of work to be done there. I've jumped in a couple of times to add to the mix, but I could admittedly do more to expand both mine and the public's understanding of type design.\n\nSo why should there be a specialized TypoWiki? The thought occurred to me as I was writing a few paragraphs on the [Python](http://web.archive.org/web/20131021213350/http:/typophile.com/wiki/Python) language in the TypoWiki. Wikipedia's article was very complete with additional articles on Guido van Rossum and other similar languages. It occurred to me, though, that there were important parts missing. Like, for example, that Python is the primary scripting language of [FontLab](http://web.archive.org/web/20131021213350/http:/typophile.com/wiki/FontLab) or that [RoboFab](http://web.archive.org/web/20131021213350/http:/typophile.com/wiki/RoboFab) is written in Python (as well as a couple other wonderful tools from [LettError](http://web.archive.org/web/20131021213350/http:/typophile.com/wiki/LettError)). It then occurred to me that it would be completely inappropriate to mention RoboFab in the Python article on Wikipedia (though it should probably have it's own entry). If one were to list every piece of software written in Python on the Wikipedia page, it would be enormous, and probably not that useful. What do I care if some agronomical engineer in Iowa wrote a corn calculator in Python?\n\nHowever, Python's FontLab connection is very important to type designers. It's question of audience. Type designers need a different, though related set of information about type design. They need a more specialized set of information. Articles in the TypoWiki should assume that the reader has more interest in, if not more knowledge about type design than the general reader of the Wikipedia.\n\nSo now I'm more convinced of the value of the TypoWiki. It's not competing with the Wikipedia, it's providing a venue for a more specialized audience. Already there are a lot of great articles in the TypoWiki. I'm excited to see what happens. I'm excited for edit wars. I'm excited for heated discussion around type controversies. What is a [bouma](http://web.archive.org/web/20131021213350/http:/typophile.com/wiki/bouma) anyway?\n\n",
  "author": "Christian Robertson",
  "time": "18 Jul 2005 — 9:56pm",
  "uid": "1",
  "comments": [
    {
      "time": "18 Jul 2005 — 10:27pm",
      "content": "Christian, you do good stuff - thanks.\n\n\\> there is a lot of work to be done there.\n\nI wonder, aren't the chances pretty good that that's the general situation with **any** field Wikipedia tries to represent?\n\n\\> What is a bouma anyway?\n\nSure as hell ain't a word shape. Why am I not going in and \"fixing\" that? Because there already was a Bouma entry before, which Forrest started and I edited - but now it's gone... Plus it sounds like many people are having general access issues. So maybe make the thing robust first? That said, I agree, the potential is super. Like look at Raph's \"Optical Scaling\" entry - very nice.\n\nhhp\n\n"
    },
    {
      "time": "19 Jul 2005 — 2:47am",
      "content": "Ahem, what Hrant meant was, \" [Optical Scaling](http://web.archive.org/web/20131021213350/http:/typophile.com/wiki/Optical%20Scaling) entry...\"\n\n=)\n\n"
    },
    {
      "time": "19 Jul 2005 — 5:18am",
      "content": "It's filling up with garbage, fast, and there's no one to clean up. This is common with all x-pedias but with the preponderance of blowhards in and around this industry, the crisis stage has already been reached and soon the swamp will only be worth venturing into if you're desparate, or bored, in my humble opinion.\n\n"
    },
    {
      "time": "19 Jul 2005 — 6:06am",
      "content": "interesting... why do you feel that way, david?\n\n"
    },
    {
      "time": "19 Jul 2005 — 6:59am",
      "content": "\"why do you feel that way, david?\"\n\nWell...here's a example of a short definition, and my analysis of it as an example:\n\n\"TrueType is a type rendering technology created by Apple to compete with Adobe’s PostScript based Type 1 fonts. TrueType differs from Type 1 in that it uses quadratic as opposed to cubic bezier curves. TrueType excels at on screen rendering with sophisticated hinting allowing for customized bitmaps at a variety of sizes. TrueType rendering technologies have found their way into new OpenType standards.\"\n\n\\>TrueType is a type rendering technology  \nNo. There is a tt rasterizer but TT is not a rendering technology. It is a type technology, but since that has not been defined, i.e. what constitutes a type technology, either in the -pedia or in the authors definition, it's easy to understand nothing :)\n\n\\>created by Apple to compete with Adobe’s PostScript based Type 1 fonts.  \nThat may have been the effect, but it was definitely not the cause!\n\n\\> TrueType differs from Type 1 in that it uses quadratic as opposed to cubic bezier curves.  \nTrue, but so what? What's the difference between the two?\n\n\\> TrueType excels at on screen rendering  \nGrammar no count?\n\n\\>with sophisticated hinting allowing for customized bitmaps at a variety of sizes.  \nOkay, so where is the \"custom bitmap\" utility? and besides that, how many TT fonts have ever had customized bitmaps in them? The point being that \"customized bitmaps\" is a wholly different thing than \"sophisticated hinting allowing for bitmaps of the highest possible quality, at all sizes\", no variety involved.\n\n\\>TrueType rendering technologies have found their way into new OpenType standards.  \nThis is mis or dis information. Seeing as the rendering technology is not the point, or the definition of TT, so it couldn't be plural. If one bothered to create a generic definition of \"type technology\", one'd see the opposite is actually true of the back end of the sentence, namely, that the contours, hints, 90% of the tables, kerning and composite technologies of OT are all 99.99% pure Apple TT, and but 1.01% was added to become OT. Right!?\n\nSo, I don't mean to pick on one thing or an author, but making -pedias that spread this erroneous information is in my opinion much, much worse than no -pedia at all.\n\nHistory though usually written by the winners, is always edited by someone. Magazines have em! Newspapers have 'em. Books have 'em. Even the little bios in our font database has an editor who looks at the stuff, checks spelling grammar, facts, opinions, and makes suggestion to/demands of the author. Somewhere in the history of reporting on internet innovations, someone thought an unedited database of definitions would be a great idea. They were, in my opinion, wrong. Let's not let our knowledge become trivialized by laziness.\n\nI have to go take a Wikipedia, and then get on to work, but I look forward to what others think, (I at least am easily editable ;)\n\n"
    },
    {
      "time": "19 Jul 2005 — 7:07am",
      "content": "_and there’s no one to clean up._\n\nit looks like you could do a bit of cleaning up (if you felt so inclined), as could any registered user of typophile who had more knowledge on the subject.\n\n"
    },
    {
      "time": "19 Jul 2005 — 8:01am",
      "content": "[TrueType](http://web.archive.org/web/20131021213350/http:/typophile.com/wiki/TrueType)  \nany improvement? need some kinks ironed out? give it a go!\n\n"
    },
    {
      "time": "19 Jul 2005 — 8:01am",
      "content": "Ah, the drama. This is what it's all about. It's true that when you read a wiki, you have to take it with a grain of salt. That being said, I happen to know that 'editorial' content can be a little wobbly itself, but who can correct it? Of course, the TrueType article you pointed out has been tweaked since you wrote about it. Thanks for the feedback :)\n\nOf course, there is always the possibility that someone could correct the wiki incorrectly, but that being said, the real power of the wiki is in the edit history, which is yet to be exposed in our case, but it's there. Different viewpoints on controversial topics are quickly exposed as edits are made. If you look closely, you will be able to figure out which authors/edits can be trusted. If nothing else, you know what the different viewpoints are, and can make up your own mind. Equally valuable is the discussion surrounding the article.\n\nThe death of a wiki is a lack of passion from it's audience (or lack of audience alltogether). Then there truly is \"no one to clean up\". Fortunately, there is no lack of passion in this community, and plenty of people who are either desperate or bored. :)\n\n\\>True, but so what? What’s the difference between the two?\n\nClick on the wiki links :)\n\n"
    },
    {
      "time": "19 Jul 2005 — 8:19am",
      "content": "David, you mentioned elsewhere that he didn't have access/privies to edit/post in the wiki. Has this been corrected.\n\nTypoWiki _could_ be and in many ways already _is_ something where educators point there students, but I agree that unless people that have the truth can correct/help/educate us blowhards. :^D\n\n"
    },
    {
      "time": "19 Jul 2005 — 8:29am",
      "content": "so how'd i do on your entry, [miss tiff](http://web.archive.org/web/20131021213350/http:/typophile.com/wiki/Tiffany%20Wardle)?\n\n"
    },
    {
      "time": "19 Jul 2005 — 8:47am",
      "content": "erm. wow. uh. -- i love being part of typophile, but i'm not so sure i belong in the wiki.\n\n(paul are you coming to the party tonight?)\n\n"
    },
    {
      "time": "19 Jul 2005 — 10:59am",
      "content": "I'd just like to see the entirety of the Typowiki linked with or imposed upon the type/design portions of Wikipedia perhaps a year from now once our own site is a bit more complete.\n\n"
    },
    {
      "time": "19 Jul 2005 — 11:19am",
      "content": "So, the Wikipedia entry on [TrueType](http://web.archive.org/web/20131021213350/http:/en.wikipedia.org/wiki/Truetype) is pretty damn good. It has detailed history, including both the Apple and Microsoft connections, and the all-important credit to [Sampo Kaasila](http://web.archive.org/web/20131021213350/http:/typophile.com/wiki/Sampo%20Kaasila). The technical bits are also good.\n\n<cite>I’d just like to see the entirety of the Typowiki linked with or imposed upon the type/design portions of Wikipedia perhaps a year from now once our own site is a bit more complete.</cite>\n\nWhen jlt writes this, the immediate question that comes to mind is whether the copyright licenses between the two wikis are compatible. Certainly, the Wikipedia side is open to such linking or integration, but I have no idea about the Typowiki. Simply declaring that all content in the Typowiki is licensed under the [GFDL](http://web.archive.org/web/20131021213350/http:/en.wikipedia.org/wiki/Wikipedia:Text_of_the_GNU_Free_Documentation_License) would solve the problem. Is that a practical step? Or do we really want to maintain a barrier so that text cannot flow freely between the two wikis?\n\n"
    },
    {
      "time": "19 Jul 2005 — 3:09pm",
      "content": "Not to damped passion, but David does have a point. And one could say that there's an inherent and depressing problem here: the more specialized a public fount (sorry) of knowledge wants to be, the more it relies on people who are \"too busy\"... For example, I'm just happy David is contributing to Typophile. If he went to the trouble of fixing some wikis, I'd be ecstatic. But anything more, and I'd be black-and-blue from pinching myself repeatedly.\n\nhhp\n\n"
    },
    {
      "time": "20 Jul 2005 — 12:21am",
      "content": "It's true that the wiki is only as good as its authors. But take a look at the Wikipedia entry for [Imperial Stormtrooper](http://web.archive.org/web/20131021213350/http:/en.wikipedia.org/wiki/Imperial_Stormtrooper) and you can guess that all that info was not put there by [George Lucas](http://web.archive.org/web/20131021213350/http:/en.wikipedia.org/wiki/George_Lucas) and that it didn't require his input or approval!\n\n"
    },
    {
      "time": "20 Jul 2005 — 4:11am",
      "content": "Thanks! TT is much better now. As Hrant says, there is a counter-dynamic going on here. I will do the best I can with the time I have available and take bad entries to mean \"HELP!\" as opposed to \"\\*\\*ck to truth, let us type.\" I'll see some in NYC, and those unable to attend, I will write a thorough trip report.\n\n"
    }
  ]
}
