{
  "id": "13966",
  "title": "strange and unusual ligatures",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Ligatures are fun, everyone knows this is true and yet there is very little application for them outside of display uses like advertising, book covers, greeting-cards, and the like. OK, so there are plenty of uses. But for the most part we see the same fi fl ff ffi ffl fj and increasingly Th. The ct and st ligatures look old, but we've got them too. There are 953234362662886047744000000 two-letter combinations possible, ignoring case and allowing for same-letter pairs like \"ff.\" Very few text fonts ( [Mrs Eaves](http://web.archive.org/web/20140307094619/http:/www.emigre.com/EF.php?fid=142 \"Mrs. Eaves Ligatures\") springs to mind) go beyond the basic five or six ligatures. What would make an attractive though non-essential ligature varies by face. My question, what are you favorite strange, unusual, totally unnecessary ligatures and what fonts have you seen them in? Second, what ligatures would you (be you a type user or type designer or a 12-year-old with a pirated copy of Adobe Font Folio and a type fetish) love to see available just for the hell of it? Please, no scripts. This is limited to serif and sans whether for display or text. It's a slow day and I'm curious.\n\n",
  "author": "grod",
  "time": "19 Jul 2005 — 10:01am",
  "uid": "5267",
  "comments": [
    {
      "time": "19 Jul 2005 — 10:07am",
      "content": "TV TT LA OO oo\n\n"
    },
    {
      "time": "19 Jul 2005 — 10:26am",
      "content": "With both LA and OO I can see at least two attractive solutions, overlapped or just joined. OO could join like OE, for example. What did you have in mind?\n\n"
    },
    {
      "time": "19 Jul 2005 — 2:27pm",
      "content": "The other day I realized that it would be nice to have a \"kk\" ligature in an italic (or more accurately, cursive) face. Some word with a \"kk\" in it triggered this, but now I don't remember what the word was... But anyway I think Scandinavian languages have that a lot no?\n\nhhp\n\n"
    },
    {
      "time": "19 Jul 2005 — 2:44pm",
      "content": "Finnish has lots of 'kk's, and lots of other strangle common double consonants.\n\n[Sauna](http://web.archive.org/web/20140307094619/http:/www.underware.nl/site2/index.php3?id1=sauna&id2=ligaturesboldswash) a Finnish design (?) has a non-joining kk ligature.\n\nEd\n\n"
    }
  ]
}
