{
  "id": "13963",
  "title": "Licensing",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "i started a thread in the licensing forum, but now i realized that this subforum isnt too well frequented.. is there any (external?) ressource on contracts when dealing with typefaces (selling a unique typeface to a client), and can i find any pricing suggestions anywhere?\n\ni just really dont know where to start or how i could find an appropriate pricing for my font..\n\n",
  "author": "thierry blancpain",
  "time": "19 Jul 2005 — 7:09am",
  "uid": "7345",
  "comments": [
    {
      "time": "19 Jul 2005 — 9:22am",
      "content": "as someone who license type -- not designs -- quality, well crafted fonts can start at $29.95 and go up to $500.00 (or so) for a family and I won't blink. You might consider starting at $19.95 and get your name out there. This question is very difficult to answer, I would think, for any type designer.\n\nIf you use the advance search in google searching only on typophile.com you will find other convesations about this topic. Good Luck.\n\n"
    },
    {
      "time": "19 Jul 2005 — 10:27am",
      "content": "kesh, if the plan is to license fonts to end users in the traditional way the pricing Tiffany suggests sounds about right. But from your post its not clear if this is what you have in mind, or if you're licensing your work exclusively to a particular client.\n\nIf you can give a bit more background, especially around what rights you want to hand over to your customers, and how much you charge for other design work (eg hourly rate for regular design work) then that might help us suggest something more helpful.\n\nCheers, Si\n\n"
    },
    {
      "time": "19 Jul 2005 — 10:30am",
      "content": "Another bet is to find foundries ( [here's a list to peruse](http://web.archive.org/web/20150122202224/http:/www.beadesigngroup.com/blog/archives/2005/07/typorama.html#more)) that fit your niche and price accordingly. Also as a type consumer, I expect fonts to fall in the range Tiffany mentioned. I gather there's not much of a science beyond seeing what's been done and 'what the market will bear' if you don't have expected sales data to work with.\n\n"
    },
    {
      "time": "20 Jul 2005 — 12:37am",
      "content": "sorry for not being clear enough in my first post, i didnt wanna get it to be too long.  \nthe client is a big videogame creator/distributor, and it will be one of the top titles for the xbox360, so their production budget is big. the plan is that this will be the only use for this font, so its a \"unique typeface\". it would be used throughout the UI of the game.\n\nmy hourly rate changes from client to client, those who can bear it pay about $30, others $20 per hour. its a low rate, i know, but im still a beginner with no formal education.\n\n"
    },
    {
      "time": "20 Jul 2005 — 10:27am",
      "content": "Sounds like it's a custom design and you're handing over all rights lock, stock and barrel to the game maker. In that case I think you should charge based on the effort you put in, based on your higher hourly rate. I'd pad the price a bit due to inevitable modifications the company will ask you to make.\n\nGiven the sad state of font (c) you might make the case to the customer that exclusivity is not really worth paying extra for. You might want to suggest that after a few years rights revert to you.\n\nI suppose you might consider giving them a discount if you're allowed to publicize your association with the game. This can be tricky - what if they mess with it prior to using it and you don't want to be associated with the result. Also software makers often reserve the right not to use a font they license, in that case they'd be no publicity.\n\nHope this helps, if you're in NYC please say hi.\n\nCheers, Si\n\n"
    }
  ]
}
