{
  "id": "13993",
  "title": "Self Promo Question",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "What is ethical to include in self-promotion? Specifically, can you include work you created while working at other shops? How do you deal with collaborative work? Too many details about what you’ve contributed can start to sound a little crazy.\n\nAlso, my wife is an editor, and I’m working with ideas to incorporate what she does and market ourselves as a package. How do I handle work she is involved with currently since she is employed by an institution?\n\n [‹ Gerrit Noordzij's books](http://web.archive.org/web/20081022142631/http:/typophile.com/node/13875 \"Go to previous forum topic\") [Remembering AtypI 95 Barcelona ›](http://web.archive.org/web/20081022142631/http:/typophile.com/node/13995 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081022142631/http://typophile.com/user/4204\" title=\"View user profile.\">jupiterboy</a>",
  "time": "<br>",
  "uid": "4204",
  "comments": [
    {
      "time": " 20.Jul.2005 10.10am",
      "content": "Most **working** people build their portfolios while working for someone, whether clients or a boss. As long as you (and your wife) actually **did** the work you are claiming to have done, there shouldn’t be a problem. And, if you worked as a member of a team, be honest about that.\n\n"
    },
    {
      "time": " 20.Jul.2005 10.37am",
      "content": "Honest is crucial and your reputation is affected by credibility.\n\nIn my CV, I have a section called: _Summary of Projects, Collaborations and Consultancies_\n\nMy own guidelines for wording:  \nFor projects I did — _created, developed_ at or for  \nprojects I directed — _directed_  \nPart of project team — _collaborated with, contributed to_  \nConsulting — depends on level — _consulted, contributed, directed_\n\n—————————————————————————————————————————  \nYes, I’m old, but consult my creative consultants when collaborating!\n\n"
    },
    {
      "time": " 20.Jul.2005 11.13am",
      "content": "Thanks guys. I like Norberts take and specific wording. I have a tendency to get a bit too technical, which can make me seem a bit wobbly.\n\nOldnick. Not sure about your bold usage. Hope I’ve not done anything to make myself seem suspicious. I have never and would never misrepresent myself, although I can see from posts on Typophile that this is more common than I might suspect.\n\nHere’s an example. My wife just finished editing a catalogue for an upcoming exhibition of the work of Anselm Kiefer. I’m not the designer on the project. If I show the book I’ll be very clear about what’s what. My question would be whether to show an image of the book or not?\n\n"
    }
  ]
}
