{
  "id": "14002",
  "title": "how do you market your work",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "How do you market your work? — lettering? type design? design?\n\nDo you send postcards? Can you show your samples?\n\nThank you\n\n",
  "author": "parker",
  "time": "20 Jul 2005 — 10:33am",
  "uid": "4955",
  "comments": [
    {
      "time": "20 Jul 2005 — 11:22am",
      "content": "Yeah, good question.\n\nAnd I personally would be interested in feedback from small foundries who have placed ads in major magazines, like Eye and Step.\n\nhhp\n\n"
    },
    {
      "time": "20 Jul 2005 — 11:32am",
      "content": "Are you wanting to do retail sales? Or are you wanting it to get picked up by a foundry?\n\n"
    },
    {
      "time": "20 Jul 2005 — 12:02pm",
      "content": "Both... I want to \"see\" the world — I'm young; so let's say I want to start with lettering, graphic design...and maybe later I'll join a foundry or BBDO :)\n\n"
    },
    {
      "time": "23 Jul 2005 — 7:31am",
      "content": "no one.........?\n\n"
    },
    {
      "time": "23 Jul 2005 — 8:52am",
      "content": "hey man - they are all on typecon! ;-)\n\nI can say, all my marketing is made through my web site. But if you understand marketing in a wider range, its goes beyond physical (visual) things. Its good to have some friends and colleagues in the scene. They can make a note on the right spot, a review or just use your work. But all this needs time and passion. You have to be present on some point and the things will happen. Maybe not the fastest way.\n\nClassic ads for type faces I have seen last in magazines from the late 50ths. In a time type faces costs real money. Will it work today? Maybe, if you have the new Futura it could be worth.\n\nToday many small foundrys made their own stuff - books, magazines, posters and the little goodies. Don't know if this realy helps selling the fonts, but it spreads the word and its worth a news. - So hopefully they get their adverts in a form of an nice article for \"free\".\n\nI expect to see more and more cooperations of independent designers like The Village ( [www.vllg.com](http://web.archive.org/web/20131108175128/http:/www.vllg.com/ \"www.vllg.com\")) in the near future, so they can bundle their strengthens.\n\n-- [astype.de](http://web.archive.org/web/20131108175128/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "23 Jul 2005 — 4:45pm",
      "content": "[ hey man - they are all on typecon! ;-)  \nI know. I wanted the thread.... alive :) ]\n\n"
    },
    {
      "time": "24 Jul 2005 — 12:17am",
      "content": "Most foundries have a submission process. I'd find a foundry that seems to fit with your work and create a list of foundries you want to solicit. They usual have a submission process they want you to follow. Some are okay reviewing semi-completed work, others want final fonts.\n\nStarting your own retail operation takes a lot more work, and involves order fulfillment and tech support for your fonts that lots of designers avoid by going through a foundry.\n\n"
    }
  ]
}
