{
  "id": "14067",
  "title": "Hagalil, new Hebrew typeface",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Please take a look at my new Hebrew typeface, Hagalil (\"Galilee\", Hebrew). You're more than welcome to give me your opinion.\n\n[http://img2.tapuz.co.il/CommunaFiles/4681048.pdf](http://web.archive.org/web/20150124112507/http:/img2.tapuz.co.il/CommunaFiles/4681048.pdf \"http://img2.tapuz.co.il/CommunaFiles/4681048.pdf\")\n\n",
  "author": "oribendor",
  "time": "23 Jul 2005 — 7:47am",
  "uid": "8409",
  "comments": [
    {
      "time": "23 Jul 2005 — 2:21pm",
      "content": "I really like what you did so far.  \nThe serifs reminds me of display types used in the 50's, but the letters are much more modern in appearance.\n\nI think the יו\"ד is a bit out of place, though. It seems larger than it should.\n\nAnd I'm not so sure about the עי\"ן either, something about the left stem seems too bold (in appearance, not weight.)\n\nIf I may ask, why do you name it Hagalil? Nothing about it seems Galileean to me.\n\n"
    },
    {
      "time": "24 Jul 2005 — 12:57am",
      "content": "Hi, Shay.\n\nAt [http://img2.tapuz.co.il/CommunaFiles/4690612.pdf](http://web.archive.org/web/20150124112507/http:/img2.tapuz.co.il/CommunaFiles/4690612.pdf \"http://img2.tapuz.co.il/CommunaFiles/4690612.pdf\") you could find a newer version with the Yud and Ayin corrected (among others). For the full list of corrected letters please turn to [http://www.tapuz.co.il/communa/userCommuna.asp?Communaid=3055](http://web.archive.org/web/20150124112507/http:/www.tapuz.co.il/communa/userCommuna.asp?Communaid=3055 \"http://www.tapuz.co.il/communa/userCommuna.asp?Communaid=3055\") (in Hebrew).\n\nAs for the name, like you suggested yourself, the face is inspired by types used in the 50's. That made me think of it as being a \"zionistic\" type, which led me to the name Atzmaut (\"Independence\", Hebrew). However, this name has already been taken (by two different fonts! One from Masterfont and one from Yanek Iontef). Thereafter it was only a matter of my own associations, and the Galilee was one of the first.\n\nHow would a Galileean typface look to you?\n\nThanks,  \noribendor\n\n"
    },
    {
      "time": "24 Jul 2005 — 7:14am",
      "content": "I'm a bit reluctant to register with Tapuz, but will probably do it soon.\n\nI still think the Yod is a bit too large: you should make it both shorter and narrower, imo.\n\nTo me, the immediate association of Galileean Hebrew writing is Jewish occult -- think of all the Kabbalah masters that used to live there.  \nI'd imagine such font as an ornate, hard to read Ashkenazi letters, like those gracing all those new-age books (think Culmus Druglin Italics, or Fontbit's Ashkenazi).\n\nShay.\n\nbtw, what is it with mathematicians and typography?\n\n"
    },
    {
      "time": "29 Jul 2005 — 10:05pm",
      "content": "As somebody who admittedly doesn't know Hebrew, my only observation is that you might want to reconcile the smooth, flary terminals with the abrupt shears differently. For example: the ascender of the Lamed seems to need a flare; the top-left \"trench\" of the (non-final) Mem should probably be abrupt; and the (non-final) Tsadi seems to need a flare, somewhere. And maybe more.\n\n\\> what is it with mathematicians and typography?\n\nGood question! And what is it with programmers and type design? I think it has to do with type design being accomodating of an analytical spirit, while fostering a creative/expressive dimension that writing code doesn't.\n\nhhp\n\n"
    },
    {
      "time": "5 Aug 2005 — 11:48am",
      "content": "Thank, hrant. I've tried, for example, a flare on the Lamed, but it made it too complex, while I wanted to keep it simple. I think it works fine just the way it is. You should bear in mind that it's a modern typeface.\n\noribendor\n\n"
    },
    {
      "time": "5 Aug 2005 — 11:58am",
      "content": "\\> I think it works fine just the way it is.\n\nYou mean the Lamed, or the whole thing?  \nBecause if it's the latter, I have to wonder why it's in the critique section.\n\nhhp\n\n"
    },
    {
      "time": "5 Aug 2005 — 4:11pm",
      "content": "Ori,  \nI don't have a clue about Hebrew letterforms but as form/counterform, your font is gorgeous! It has a flavor of Asian calligraphy mixed with a Constructivist formalism.  \nWish I understood the language to be able to be of help to you.\n\nChrisL\n\n"
    },
    {
      "time": "5 Aug 2005 — 4:21pm",
      "content": "\\> You mean the Lamed, or the whole thing?\n\nI mean the whole terminals thing.\n\noribendor\n\n"
    },
    {
      "time": "5 Aug 2005 — 4:22pm",
      "content": "\\> but as form/counterform, your font is gorgeous!\n\nThanks, I guess :)\n\noribendor\n\n"
    },
    {
      "time": "5 Aug 2005 — 4:53pm",
      "content": "\"form/counterform\"\n\nIn more Gestalt terms: The way the negative space (Ground) is active and supports positive space (figure).\n\nThe black and white play well together :-)\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2007 — 6:40pm",
      "content": "Hi, I like your font very much. I don't speak hebrew but need to carve some wooden letters (shalom) for a gateway to a kid's camp and thought this would be neat.\n\n"
    }
  ]
}
