{
  "id": "14079",
  "title": "Adobe Reader OpenType fonts (Myriad Pro and Minion Pro)",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Dear typophiles,  \nI've just downloaded the latest version of Adobe Reader for Windows. After installing this free software I can see a new folder on my hard disk with some Adobe OpenType fonts (Myriad Pro, Minion Pro and Courier Std). Since Adobe Reader is a free software I suppose these great fonts are a free gift from Adobe. Am I right? Can I use these fonts for commercial projects? Where can I get the license agreement?\n\nMany thanks  \nalbertoxic\n\n",
  "author": "albertoxic",
  "time": "24 Jul 2005 — 2:31pm",
  "uid": "5269",
  "comments": [
    {
      "time": "24 Jul 2005 — 6:59pm",
      "content": "As far as I understand it the use of Adobe's bundled fonts is governed by the EULA for the software, of which the font is a part. [see Section 1 subsection iii](http://web.archive.org/web/20140923080409/http:/www.adobe.com/products/acrobat/acrreula.html) <cite><strong>1. Definitions.</strong> \"Software\" means (a) all of the contents of the files, disk(s), CD-ROM(s) or other media with which this Agreement is provided, including but not limited to (i) Adobe or third party computer information or software; (ii) related explanatory written materials or files (\"Documentation\"); and (iii) fonts; and (b) upgrades, modified versions, updates, additions, and copies of the Software, if any, licensed to you by Adobe (collectively, \"Updates\"). ... </cite>  \nSo the font is governed by the same EULA as Acrobat Reader.\n\n"
    },
    {
      "time": "25 Jul 2005 — 12:47am",
      "content": "This topic has come up before. The problem I have with understanding the EULA is that it is difficult to interpret the rest of the agreement in terms of using the fonts as such. For example, the paragraph about \"No Modification\" puts restrictions on how other software may interface with the Software, but these only make sense when talking about interfacing with Acrobat Reader: i.e. creating plug-ins for it, or integrating it into other applications. You really have to stretch the meaning to understand such \"interfacing\" in terms of the fonts.\n\n"
    },
    {
      "time": "27 Jul 2005 — 8:48am",
      "content": "Albertoxic, can you link us to the EULA? I'd be interested in reading it.\n\n"
    },
    {
      "time": "27 Jul 2005 — 2:48pm",
      "content": "Hi Tiffany,  \nfonts bundled with Acrobat Reader have not a specific license agreement. Probably their use is governed by Acrobat Reader's license: [http://www.adobe.com/products/acrobat/acrreula.html](http://web.archive.org/web/20140923080409/http:/www.adobe.com/products/acrobat/acrreula.html \"http://www.adobe.com/products/acrobat/acrreula.html\")\n\nBut, as Glyn Adgie said, it's not so simple to interpret the software EULA regarding bundled fonts...\n\n"
    },
    {
      "time": "27 Jul 2005 — 3:17pm",
      "content": "Under _Software Use_ it states: _2.1 General Use. You may install and Use a copy of the Software on your compatible computer, up to the Permitted Number of computers._\n\nI would take _use_ in this instance to allow for graphic design work.\n\nUnder _Definitions_ it states: _\"Use\" or \"Using\" means to access, install, download, copy or otherwise benefit from using the functionality of the Software in accordance with the Documentation._\n\nI would find the word benefit to include design work.\n\n"
    }
  ]
}
