{
  "id": "141",
  "title": "Quotidian sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "This is my second typeface attempt and my first attempt at a text face. I began it while at grad school and have been working on it in my spare time. The caps have not been touched since grad school, I have been concentrating on the Lc. I have tried to follow a lot of the critiques here online, but I could use an external opinion. Thanks for any help you can give me.\n\n",
  "author": "anonymous",
  "time": "7 Apr 2002 — 6:11pm",
  "uid": "1203",
  "comments": [
    {
      "time": "7 Apr 2002 — 7:42pm",
      "content": "David,   \n   \nThis is awfully similar to Scala Sans.\\*   \nHow would you describe your inspiration?   \n   \nI enjoy your pointed caps and prefer   \nyour lc 'a' to Scala's.   \n   \nStephen   \n   \n\\* [http://www.fontfont.de/packages/scala11119/scareg21860/scareg21860\\_xx.html](http://web.archive.org/web/20150414170058/http:/www.fontfont.de/packages/scala11119/scareg21860/scareg21860_xx.html)\n\n"
    },
    {
      "time": "8 Apr 2002 — 6:17am",
      "content": "I think that the discussion about Scala sans comes from the fact that I am after the same intention: to work towards a sans face that is humanist, but I did not look at scala sans for inspiration. I have tried to stay away from it, but apparently not enough. I have been looking at a lot of serif typefaces and I guess that's why scala sans comes up.   \n   \nThanks so far for the input. And yes, that is my real email address.\n\n"
    },
    {
      "time": "8 Apr 2002 — 10:15am",
      "content": "David,   \nI think the Flash player is trashing your outlines real bad (at least on my end). Like zoom in to your UC \"B\"...   \n   \nSo could you please put up a higher-fidelity sample? Try this possible quick-fix: output the font as a TrueType and use that for the Flash movie.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Apr 2002 — 10:16am",
      "content": "oops. Sorry. I have been reworking the caps and it will be a while b4 I have it all together to upload a new image. Some of them are driving me crazy.   \n   \nDavid\n\n"
    },
    {
      "time": "27 Jul 2002 — 6:25pm",
      "content": "Revised Quotidian:\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414170058im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">This_Is.swf<br><a href=\"http://web.archive.org/web/20150414170058/http:/www.typophile.com/forums/messages/29/this_is.swf\"><b>this_is.swf</b></a> (6 k)</td></tr></table></center>   \n   \n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414170058im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">Hamburegefonstiv_v3.swf<br><a href=\"http://web.archive.org/web/20150414170058/http:/www.typophile.com/forums/messages/29/hamburegefonstiv_v3.swf\"><b>hamburegefonstiv_v3.swf</b></a> (11 k)</td></tr></table></center>!-/attachment-!\\>!-attachment:\\>!-/attachment-!\\>!-attachment:\\> \n"
    },
    {
      "time": "29 Jul 2002 — 6:14am",
      "content": "David,   \n   \nit's getting better, we all can see.   \n   \nBUT   \n   \nthere are still great resemblances between your face and others. I think that the comparison between scala sans and Quotidian (what does that word actually means?) is not quite right. I think you should check out the 'syntax' and the 'foundry sans' at [http://www.thefoundrystudio.co.uk/](http://web.archive.org/web/20150414170058/http:/www.thefoundrystudio.co.uk/)   \nThe capitals looks very much like the Gill Sans, by the way. (Except the Q)   \n   \nI personally think there's not so much sense in designing typefaces, which have been done before. But it's a very good study.   \n   \nTry to make the face more typical. Original accent's etc. otherwise no one will notice the novelty of it.   \n   \nsucces\n\n"
    },
    {
      "time": "29 Jul 2002 — 7:20am",
      "content": "Matthijs,   \n   \nThank you for the input. I really appreciate your opinions. Type design and graphic design is basically a self-taught thing for me. I did go to graphic design school, but it is one that did not have classes (Cranbrook). In that respect, I have learned a lot, like I had to reduce the cap height otherwise Uc color was too pale. Something I never noticed about other faces until now...   \n   \nI have been using this typeface as an exercise in trying to \"see\" the structure of type better. I am not even considering using it on personal projects: You are right, it looks like a lot of other faces that are better designed anyways.   \n   \nBTW, Quotidian means \"ordinary,\" \"everyday\".   \n   \nThank you again for your patience.\n\n"
    },
    {
      "time": "29 Jul 2002 — 7:46am",
      "content": "TANGENT (sorry David):   \n   \n\\> I personally think there's not so much sense in designing typefaces   \n   \nAs far as I'm concerned, we're just warming up.   \n   \nThe real thing (a craft free of calligraphy, and to a lesser extent lettering - one that can best serve the \\*reader\\*) is still in the cocoon. BTW, the reason most type designers -including some of the best- seem to be stuck in a rut these days (I mean from an ideological perspective) is because they're afraid to jump into the analytical aspect of written communication. As a result, we generally see three types of (misguided) directions: stale revivals; artistic ego-trips, often disguised as \"experiments\"; or the current menace: the VERNACULAR! :-/ A rare example of somebody doing it right? Gerard Unger.   \n   \nLook deeper, not sideways.   \n   \nhhp\n\n"
    },
    {
      "time": "29 Jul 2002 — 11:19am",
      "content": "david,   \n   \nthe great thing of this site, is that there's room for discussion and a free meaning.   \nI didn't react to criticise your project in a bad way, but to give you food for thought.   \n   \nI think that everybody should do what he think is best. We can all give critique and response but in the end it's your own work and you make your own decisions.   \n   \nI think it's a great exercise to design a typeface like you did. Don't feel bad, see it as a good lesson in class.   \n   \ngreetings   \n   \nBeside this i'd like to respond on Hrant's reaction.   \n   \nWhat I meant with 'I personally think there's not so much sense in designing typefaces, which have been done before.' is the fact that we're not living in the days that stanley morison wrote his 'first principles' and said that \"The good type-designer therefore realizes that, for a new fount to be succesful, it has to be so good that only very few recognize its novelty.\" Type-design is in my eyes not meant to be bearly noticed.   \n   \nI'm sorry, but I disagree the fact that Gerard Unger is someone who's doing it right in the field of 'the vernacular'. Gerard Unger IS a classicist. & I disagree the fact that most type designers -including some of the best- seem to be stuck in a rut these days. There are a lot of great things going on.   \n   \nOf course typedesign is for a part rooted in a long and cultural-rich history, but for a great part, I'm personaly convinced that type & typography is more part of the present society. Type should be a representation of the age in where it is used. There are no beter or worse times of typography. The present is inspiration for typography. This time is full with inspiration. And... ...maybe the 'well-known' designers are stuck, but below that layer of celebrities there is a lot of good work being done.   \n   \nMaybe, it's nice to start a discussion about the present typography, where we're heading at, and what typography should be about anno 2002. (Should it be purely functional, or should we try giving it a more social function?)   \n   \nMatthijs   \n   \n(By the way, Hrant; how can you combine anarchie & the monarchie in one person?)\n\n"
    },
    {
      "time": "29 Jul 2002 — 2:38pm",
      "content": "Matthijs, I misunderstood you - I guess we agree that imitation sucks?   \n   \nBut:   \n\\> I disagree the fact that Gerard Unger is someone who's doing it right in the field of 'the vernacular'.   \n   \nOK, here \\*you\\* misunderstood \\*me\\*! :-) I was giving Unger as an example of a designer \\*not\\* following any of those three (misguided) directions.   \n   \n\\> Type should be a representation of the age in where it is used.   \n   \nAgreed 100%. But it can/should also push boundaries, no?   \n   \n\\> There are no beter or worse times of typography.   \n   \nWell, that type of relativism does contain truth.   \n   \nBut it's not crazy to complain, for example, that -in contrast to about a hundred years ago- contemporary type designers don't pay enough attention to readability. They like to think of type design as an \"Art\" (since that's what society values more these days, sadly), and this obstructs analytical design. We have people saying \"anything can be a text face if you read it enough\" - these people should be openly ridiculed by anybody who seriously considers human physiological realities. A [text] font is not a painting - it's not [primarily] a vehicle for self-expression. Art is selfish - Craft is populist.   \n   \n----   \n   \nAnarchy is the utopia (since society = injustice), but it cannot be achieved. It's nice to keep it in mind (especially as a means to completely destroy existing corrupt systems - which cannot be reformed), but eventually we need something that works. Strangely enough, in the end Monarchy is the least unfair achievable system (and I like reminding people that it worked fine for thousands of years). Communism is the second least unfair system that can be achieved. Democracy (which may have started out with good intentions) is in effect a tool for usurpers, the most effective and poisonous weapon of Capitalism - and the fact that it \\*seems\\* fair to the average peon is its darkest feature. BTW, if voting could change anything, it would be illegal. The shocking nefariousness of Democracy is becoming clearer each passing day - \\*if\\* you're brave enough to open your eyes and reconsider what your schools have told you, brave enough to doubt the true intentions of your leaders. Bottom line: the people are not qualified to decide matters of state, so they must relinquish governement of their nation to a benign philosopher king/queen. Hard to find one? Sure, but much easier than finding 10 benign capitalists.   \n   \nI've said my part, and I should stop here. If anybody wants to reply, I can't stop you, but I would only consider replying in turn if you bring to the table something I have yet to consider. If I don't reply it's probably because your argument has been considered, it holds no water, and I can shoot it down in five words or less. :-)   \n   \nhhp\n\n"
    },
    {
      "time": "7 Apr 2002 — 9:30pm",
      "content": "-post deleted-\n\n"
    },
    {
      "time": "7 Apr 2002 — 6:25pm",
      "content": "<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414170058im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">quotidian_sans.swf<br><a href=\"http://web.archive.org/web/20150414170058/http:/www.typophile.com/forums/messages/29/quotidian_sans.swf\"><b>quotidian_sans.swf</b></a> (7 k)</td></tr></table></center>  \n   \nSorry, here is the image.   \n   \ndc!-/attachment-!\\>!-attachment:\\> \n"
    }
  ]
}
