{
  "id": "14127",
  "title": "Texter, Live Web-based Typeface Preview",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "It was a slow weekend, I had an idea and so Texter was born. Texter is a web-based tool to allow the previewing of typefaces and I hope it will be some use to people here. Try it [here](http://web.archive.org/web/20131016041834/http:/www.bombsites.co.uk/texter/)\n\nIt runs on Javascript and Flash with most of the hard work being done by [sIFR](http://web.archive.org/web/20131016041834/http:/www.mikeindustries.com/sifr/) there is no server-side programming used. It is a light and simple alternative to the likes of Mudtyper\\*.\n\nIt is not a massively complicated system, so I'm not going to ask for money to licence Texter, but instead I would like to provide Texter licences in return for font licences. I hope this is a fair system, let me know what you think.\n\nIt's early days with this yet, so all and any feedback would be appreciated. More information on [my website.](http://web.archive.org/web/20131016041834/http:/www.bombsites.co.uk/index.php?id=17)\n\nThanks,\n\nEd\n\n\\*It has been pointed out to me that Mudtyper supports kerning, unfortunatly Texter can't as dynamic text in flash doesn't support kerning.\n\n",
  "author": "edeverett",
  "time": "25 Jul 2005 — 6:45am",
  "uid": "5157",
  "comments": [
    {
      "time": "25 Jul 2005 — 12:02pm",
      "content": "Hi Ed,\n\nIt looks quite nice and I'm sure it will find its usage. But it could be a problem, that nothing in a flash file is secure. There are some handy tools around that can extract anything from a flash file. The nature of a font previewer is to test the font, so you have to include the all common characters and it will be delivered as outlines.\n\n-- [astype.de](http://web.archive.org/web/20131016041834/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "25 Jul 2005 — 3:24pm",
      "content": "Yes, I know that embedding fonts like this can be seen as a security risk, but there are steps to be taken to secure the fonts and pretect copyright abuse. The guidelines [here](http://web.archive.org/web/20131016041834/http:/wiki.novemberborn.net/sifr/show/Protecting+Commercial+Fonts), show 1) how to someone \"prevent somebody from downloading the .swf file and using it on their own PC and potentially taking the font file\", and 2) restrict someone using the .swf file from a different domain.\n\nI'm not sure how water-tight these steps are. But I'm sure circumventing them is a lot harder than going to the wrong places and downloading the whole of the Adobe library (for instance). I don't think this method is less secure than posting a sample PDF is it?\n\nI'll look into the security side of things over the next couple of days and report back.\n\nThanks for the comments,\n\nEd\n\n"
    },
    {
      "time": "25 Jul 2005 — 3:26pm",
      "content": "Flash is -generally- more secure than PDF.\n\nhhp\n\n"
    },
    {
      "time": "26 Jul 2005 — 2:36am",
      "content": "It is a tool around that can extract font data (icluding kerning and spacing) form swf files as TrueType font! All proctetion settings have no effect. You can't hide the swf file from the client system.\n\nA PDF file is an other thing. Its not real interactive. You don't have to include all the characters or you can inculde some pages as bitmaps only. Kerning and the spacing is lost if you extract the font data. So its real hard to made a font out of it.\n\n-- [astype.de](http://web.archive.org/web/20131016041834/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "26 Jul 2005 — 4:11am",
      "content": "Andreas,\n\nCan you [email me](http://web.archive.org/web/20131016041834/http:/www.bombsites.co.uk/index.php?id=4) any details about the tool? I don't want to be offering something that is insecure. I have been experimenting with .swf decompilers that claim to turn the .swf back to a .fla, but I'm not able to extract any useful data. The fonts just get exported as another .swf, which ought to be, again, useless.\n\nCould someone really just take Gotham out of the header on this site? If this is real, then putting fonts in flash files is tantamount to freely distributing them.\n\nI really hope this isn't the case.\n\n"
    },
    {
      "time": "26 Jul 2005 — 4:40am",
      "content": "If I read the specs correctly, Texter utilizes SIFR technology to display the fonts, and SIFR -- again, If I read the specs correctly -- _has_ safeguards built in the prevent use of the .swf files anywhere else except in domains specified in the .swf file itself.\n\n"
    },
    {
      "time": "26 Jul 2005 — 6:26am",
      "content": "Yes. Thats right.\n\nThe issues are whether the safeguards work. So far I've not been able to get around them to the extent of getting anything useful out of the file. But I'll carry on trawling the dirty under-belly of the web for a bit to see if I can find something that can.\n\nI don't see how this can be any less secure than useing a font embedded in any other flash application. Most people seem to find that level of security acceptable.\n\nIn the meantime, If anyone would like to offer advice on how I can make it a better tool then I would be very grateful. I am working on the ability to select different typefaces via a drop-down list. This should be ready by the end of the day (London time).\n\nI have discovered that it is possible to batch process the .swf via the method shown [here](http://web.archive.org/web/20131016041834/http:/www.communitymx.com/content/article.cfm?cid=243EE). Which could save anyone who wants to use this a lot of time.\n\nDo people find it works well and efficiently? I'm stuck here on a 2.2Mbit connection, so find it hard to judge what it is like other connections and other places.\n\nThanks for the help,\n\nEd\n\n"
    },
    {
      "time": "26 Jul 2005 — 6:39am",
      "content": "Hi Ed,\n\nif your website would be online - I would send you the link to this tool. But its no secret, Google is your friend.\n\n-- [astype.de](http://web.archive.org/web/20131016041834/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "26 Jul 2005 — 7:23am",
      "content": "Thanks for the email Andreas,\n\nMy website is now working again, I think my hosts must have left the work experience boy in charge while they went to lunch.\n\nSo there **is** a program that does claims to be able to extract .ttf files from .swf files. Which is quite scary. Have you seen it in action? Would it work if a non truetype font was embedded? (I guess it would)\n\nI think there are some important questions here. One thing to say it that Texter is no less secure than any other flash based apps out there. I guess there is nothing to be done about this? :-(\n\nThis is all troubling.\n\n"
    },
    {
      "time": "26 Jul 2005 — 7:36am",
      "content": "Hi Ed,\n\nI'm sure it works and as a review says. It also can convert any flash file back to an .fla project, so every flash file is open like any javascript or html file.\n\nA way could be to convert the font symbols, (every glyph is a symbol attachet to a global font symbol), to an grayscale image with alpha channel. I think this would work, but someone have to code such a conversation tool.\n\n-- [astype.de](http://web.archive.org/web/20131016041834/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "26 Jul 2005 — 7:46am",
      "content": "On the plus side, I've not been able to find a version of this program(4.04+), that is able to extract fonts, lying around on the internet in the usual dodgy places. So it is likely that if someone wanted to steal a font, they would have to actually buy the program first. Which seems to be against the ethos of most of the people we are worried about.\n\nStill, Texter is available for use if anyone is prepared to allow their fonts to be used in flash files.\n\n"
    },
    {
      "time": "26 Jul 2005 — 8:01am",
      "content": "Thanks for the suggestions Andreas, I'm not worried about the .fla file, as sIFR is opensource, just peoples font outlines.\n\nI'm not a good enough coder to start playing with complicated scripts, this was just meant to be a simple alternative for displaying fonts made from readily available components. I wanted something like this for myself and had an idea how to make it happen.\n\nAs a summary, I guess putting (or allowing people to put) any font into a public flash file clearly has risks. Some people are prepared to take those risks, some aren't. These risks are obviously highlight for type designers. It is however much better to know about this than not.\n\nIf anyone would be prepared to risk putting their outlines in a flash file and thinks they could make use Texter let me know. It's been made now.\n\nThanks for the all the comments.\n\nEd\n\n"
    },
    {
      "time": "26 Jul 2005 — 8:46am",
      "content": "Andreas, has something changed in the past year or so? Because the last time we hashed through Flash-versus-PDF security, the conclusion was that PDF is easier to hack (robustly).\n\nhhp\n\n"
    },
    {
      "time": "26 Jul 2005 — 9:39am",
      "content": "Regardless of the potential security risks inherent in flash, I've added the ability to swap typefaces on the fly.\n\nAdding fonts is as easy as adding their names to the drop-down list.\n\nSee it [here](http://web.archive.org/web/20131016041834/http:/www.bombsites.co.uk/texter/)\n\n"
    },
    {
      "time": "26 Jul 2005 — 9:51am",
      "content": "I have made some trys. If you export your pdf directly form InDesign all Type1 & OpenType CFF fonts will be included CID encoded. The \"spacing\" (glyph wide) will be set to zero or around zero.  \nThere is a tool around - and some acrobat versions too, with the ability to extracting these data. But its hard to add an OpenType header to it. So in the end, the user gets the CFF encoded data and with the right tools he can import the glyphs into FontLab. But everything, mapping, spacing, kerning, OpenType features are lost. In case of a large OpenType font like Zapfine Pro, you must be a really informed font developer to get some usage out of it.\n\nSo its cheaper to license the fonts. But all depents on the method of how a pdf will be generated. Some people made it with the default distiller functions and the encoding will be preserved. This happens a lot on simple Type1 fonts.\n\nIn general I recomend setting up nice specimen files, but to avoid the showing of whole alphabets or to made special bitmap renderings of these pages and include these pages into the \"normal\" pdf.\n\nBut you have to generate the pdf files without these full alphabet pages, since you can delete a page afterwards, but the font data will be untouched.\n\nExample:  \nspecimen file showing samples on page 1 and all glyphs on page 2.\n\n1. Generate the pdf from InDesign.  \n2. Print page 2 as Bitmap file into a new pdf.  \n3. Generate the same pdf file without the last page showing all glyphs (page 2)  \n4. Attach the bitmap pdf to the last generated pdf (Step 3.)\n\nSo you have a nice printable specimen file but without all the glyphs in it.\n\nBut its just a suggestion to made it real hard.\n\nBack to the flash issue, its a matter of time if this tool or any other is spreaded over the net, and its an easy click and save to TrueType function, not possible today for pdfs. But even this can change.\n\n-- [astype.de](http://web.archive.org/web/20131016041834/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "30 Jul 2005 — 2:55pm",
      "content": "I must correct something about my statment above. The spacing / wide of the glyphs will be preserved in 99% of the PDF creation. But I have in my mind some strange pdfs with all glyphs set to zero or negative wide. Maybe it is a technique around to do it, maybe some of the Adobe guys can help.\n\n-- [astype.de](http://web.archive.org/web/20131016041834/http:/www.astype.de/)--\n\n"
    }
  ]
}
