{
  "id": "14136",
  "title": "Best design schools around the world",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi, folks!  \nI was wondering how typography is included in graphic design courses, specially at the best design schools. I teach digital typography and typographic design at Barcelona Univesity, Spain.  \nFirst I would think about the top ten schools, in order to study their programs.  \nHere in Europe I would say Reading and KABK, but some help would be apreciate.  \nThanks,\n\nDaniel\n\n [‹ what the heck is this?](http://web.archive.org/web/20070911194943/http:/typophile.com/node/14214 \"Go to previous forum topic\") [Lettering Artists ›](http://web.archive.org/web/20070911194943/http:/typophile.com/node/14184 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911194943/http://typophile.com/user/3788\" title=\"View user profile.\">cursusductus</a>",
  "time": "<br>",
  "uid": "3788",
  "comments": [
    {
      "time": " 25.Jul.2005 10.02am",
      "content": "Based on my experience in design, it seems that there are few schools here in the states that really have a well integrated typography program. I just got my Master’s degree in design a few months ago and mostly everything I’ve learned about digital typopgraphy has been self-taught. There’s a market for type here, just not much emphasis on the actual production.\n\n"
    },
    {
      "time": " 25.Jul.2005 10.47am",
      "content": "could you please name these schools?  \nThanks\n\n"
    },
    {
      "time": " 25.Jul.2005 10.59am",
      "content": "Hello Daniel,\n\nThe Type Directors Club posts a [**list of schools**](http://web.archive.org/web/20070911194943/http:/www.tdc.org/views/index.html#schools) offering course work in type and typography which you can use as a starting point.\n\nBy the way, is **ADG** FAD (Agrupació FAD de Directors d’Art, Dissenyadors Gràfics i Illustradors) still active? I had visited with the group several times and had the pleasure of meeting many designers from Spain.\n\nAlso, do you know [**Ricardo Rousselot**](http://web.archive.org/web/20070911194943/http:/www.grupoerre-rousselot.com/)? He was one of the most gracious and gifted designer/typographer I met in Barcelona years ago.\n\n———————————————————————————————-  \nYes, I’m old, and have danced in the moonlight on La Rambla!\n\n"
    },
    {
      "time": " 25.Jul.2005 10.59am",
      "content": "I can put in a plug for my alma mater, Carnegie Mellon University in Pittsburgh (CMU). This makes particular sense if your name is Chris or similar—CMU was also attended by Typophile Chris Rugan and the renowned type designer Christian Schwartz. :-)\n\nChrisL\n\n"
    },
    {
      "time": " 25.Jul.2005 11.07am",
      "content": ":))  \nYes, Norbert, ADGFAD is still active, and Ricardo and I meet together last year in the first spanish typography congress. Thanks 4 the link.\n\n"
    },
    {
      "time": " 25.Jul.2005 12.06pm",
      "content": "Could somebody put me in touch with the people who  \ndid the website for the Ligaduras 2004 conference?\n\nhhp\n\n"
    },
    {
      "time": " 25.Jul.2005 12.56pm",
      "content": "Hrant, try to write to: [ligaduras@catalanadetipos.com](mailto:ligaduras@catalanadetipos.com)  \nthey will tell you (hope so)\n\n"
    },
    {
      "time": " 25.Jul.2005 1.38pm",
      "content": "I tried that (back in August)... I wanted to get permission to show comparison images of their pages (which had some massively blurry Solex), splicing in my onscreen Mana fonts. Not a peep.\n\nhhp\n\n"
    },
    {
      "time": " 25.Jul.2005 2.44pm",
      "content": "Take a look at [www.artcenter.edu/](http://web.archive.org/web/20070911194943/http:/www.artcenter.edu/ \"www.artcenter.edu/\")\n\n"
    },
    {
      "time": " 25.Jul.2005 3.08pm",
      "content": "I too will rave about my alma matter, the University of Illinois at Chicago’s School of Art and Design. While it may not seem like much, I learned an immense amount of typographic knowledge here, and they have an exchange with the Hochschule fur Gestaltung und Kunst in Luzern. Needless to say, we studied the International Style.\n\n"
    },
    {
      "time": " 25.Jul.2005 4.01pm",
      "content": "There is a big difference between typography (the use of typefaces)  \nand type design (the creation of typefaces).\n\nI did the typeface design course in Reading, and I can really recommend it.\n\nDecades ago the best school for typography was Basel,  \nbecause they taught both attention to detail (microtypography)  \nand a systematic approach to design.  \nNow it seems that there are many universities and schools  \nwhere a lot of good typographic designers/typographers are teaching,  \nbut often they stay only for a certain time, and afterwards these schools  \nfall back into mediocrity.\n\n"
    },
    {
      "time": " 25.Jul.2005 9.51pm",
      "content": "Unfortunately there are some type designers who have no idea what typography is. Most of the successful type designers I have encountered ultimately realize that type must be used by an end user, thus typography. Although they can be separated, the relationship should be that of siamese twins. As we said at Typecon, type cannot exist in a vacuum. It relies on very specific contexts: publication, identity, video, etc....not merely a speciman for marketing to other designers. Type doesn’t exist unless it meets the public.\n\nI recently finished the Type & Media course at the KABK. If strong cultural tradition (Dutch) coupled with the tremendous possiblities of backend technology are important to you then I would go to the Hague. I may be wrong, but I believe they have the largest number of teachers who are actually practicing type designers.\n\n"
    },
    {
      "time": " 25.Jul.2005 10.22pm",
      "content": "\\> there are some type designers who have no idea what typography is.\n\nVery true. Part of it is that some type designers don’t **want** to know, because they know they’re not good at it (the two tasks require very different skills) or they just find it boring.\\* The good news is that as long as a type designer realizes the importance of the user (which is sometimes the reader more than the graphic designer, for example in the case of newspapers) he can still manage to make good fonts; in fact I think there’s a certain benefit to being somewhat detached from the actual usage of fonts - you can look beyond current practice and maybe mark some real progress. So I think the main factor is respecting the user, as opposed to merely knowing the mechanics of current practice.\n\n\\* I mean, really, how could the arrangement of parts made by other people into something static ever be as rewarding as the making of a useful, self-contained little machine that is a font? I can’t dig it.\n\nMy impressions of KABK versus Reading is that the former is better for quickly learning to make high-quality mainstream fonts of a certain -admittedly attractive- style, while the latter is better for theoretical groundwork and non-Latin design. As you might be able to tell, I personally lean more towards Reading - but that’s just me. Maybe it’s partly because I feel more Armenian than Dutch... Really, isn’t some certain thing lost when let’s say a South American is taught to make Dutch type? Especially when he’s an impressionable student and he’s -unavoidably, unwittingly- made to **prefer** Dutch type? I myself prefer to learn the underlying secrets, not how to elaborate a certain visual style.\n\nhhp\n\n"
    },
    {
      "time": " 26.Jul.2005 12.39am",
      "content": "Hrant, Dutch Type?  \ndo you mean calligraphic tendence?\n\nhave you seen Rumba, from Laura Meseguer?  \nThat’s not very dutch, I think...\n\nI think that KABK focus is on calligraphy as a system, not as a visual style. I don’t know Reading, but it seems to be more on legibility and language.  \nWhat about France, Germany, Italy and the rest of Europe?  \nAny interesting school there?\n\n"
    },
    {
      "time": " 26.Jul.2005 2.53am",
      "content": "Hrant, you know nothing about KABK teachings. But giving strong opinions  \nwith no knowledge about the matter is your main feature, isn’t it?\n\n"
    },
    {
      "time": " 26.Jul.2005 3.49am",
      "content": "Hey boys, let’s not convert this in a discussion KABK vs Reading.  \nLet’s open the eyes to another interesting schools, please.  \nIf you want, we can compare the different aproaches to type design.  \nKABK represents the calligraphic one. At Barcelona University (Arts faculty) we use a similar point of view. Anybody else?  \nPeople who studied at Reading, can you tell us something more?\n\n"
    },
    {
      "time": " 26.Jul.2005 7.56am",
      "content": "Germany has the HBK in Leipzig. That is very good.\n\nHere is a link to a similar article/discussion over at Typographi.com:  \n [http://typographi.com/000938.php](http://web.archive.org/web/20070911194943/http:/typographi.com/000938.php)\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20070911194943/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 26.Jul.2005 8.42am",
      "content": "\\> have you seen Rumba, from Laura Meseguer?\n\nThat was actually on my mind when I wrote that! :-/  \nYou don’t think it looks Dutch?\n\nJust to be clear, I don’t think there’s anything wrong with the Dutch look - in fact I think it’s quite nice actually, as far as looks go. But then I would ask: What is wrong with Laura being more true to her own culture? (I’m assuming she’s not Dutch, of course.)\n\nRamiro, I know what I see, which is certainly not everything, but still something. Just because we disagree as to where type design should be headed doesn’t mean I don’t understand.\n\nAlso, I think chirographic type can have a fair amount of variety; which explains GN’s mockery of Zapf’s work.\n\nhhp\n\n"
    },
    {
      "time": " 26.Jul.2005 9.18am",
      "content": "\\>how typography is included in graphic design courses,\n\nI’ve taught at the B.Des course at York University, Toronto.  \nTypography is well integrated, from letterpress to type design.  \nIn fact, it was a special requirement when the faculty moved into a new high-tech building in 2003, replacing studios with computer labs, that provision also be made for all the old metal type presses and their volatile chemicals. So students can get ink on their fingers.  \nThe course I taught to 3rd-year students involved designing and making a digital typeface, creating a poster for it, and and a 15-second animation using it.\n\nDesign professor David Scadding is the man most responsible for York’s typographic thoroughness. Students are impressed:  \n [http://www.ratemyprofessors.ca/ShowRatings.jsp?tid=101521](http://web.archive.org/web/20070911194943/http:/www.ratemyprofessors.ca/ShowRatings.jsp?tid=101521 \"http://www.ratemyprofessors.ca/ShowRatings.jsp?tid=101521\")\n\n"
    },
    {
      "time": " 26.Jul.2005 9.46am",
      "content": "CMU, when I was there from ’97–’01, excelled at the mental and conceptual aspects of design, but didn’t wow me in the technical and craft areas. It’s not that they didn’t make an effort, but it wasn’t satisfactory in my mind. Everyone seemed to expect someone else to cover it.\n\nThat being said, because the CMU School of Design is part of the larger university, it’s an incredible place to be, particularly for the self-directed. The people, facilities, faculty, and community are a very rich resource.\n\nIf you want to learn to design type specifically, you may not want to go there. But, as Chris L. said, Christian would know best about that.\n\n"
    },
    {
      "time": " 26.Jul.2005 11.08am",
      "content": ":)  \nI’t’s incredible how two persons can see the same thing so different...  \nRumba doesn’t look Dutch to me, may be a Dutch drunk with spanish wine, the stomach plenty of tapas and dancing untill the sun rises...  \nLaura is spanish, like me, and I don’t think she’s betrying any culture... she told some where that dutch collegues had found this type very latin, so I’m not alone ;)\n\n"
    },
    {
      "time": " 26.Jul.2005 11.25am",
      "content": "I don’t know why it matters what country you are from. People should just design the type that comes out of them as an individual human being. There is no need to pass a litmus test of national origin. Let Laura design whatever and however she wishes. She is a grown women who needs no help to make up her mind. She has done good work on her own merits. In this international world fed by internet communication all of these borders between countries blurr anyway. Let the individual do as they see fit.\n\nChrisL\n\n"
    },
    {
      "time": " 26.Jul.2005 11.40am",
      "content": "\\> People should just design the type that comes  \n\\> out of them as an individual human being.\n\nAgreed. I am however concerned with the undue influence that a teacher can often have. Everybody is impressionable, and to me at least the best teachers are the ones who get you to ask intelligent questions, as opposed to merely teaching you how to make fonts in a certain style. Just like design itself, design education should be a balance between what a teacher thinks is good versus what the student **might** think is good. Self-doubt is critical in a good teacher; so is the ability to draw out what’s “different” in each student. Also, since I think chirographic type is essentially flawed, anybody who teaches it as gospel can only produce the types of students I think we need **in spite** of him.\n\nhhp\n\n"
    },
    {
      "time": " 26.Jul.2005 1.27pm",
      "content": "Academia often ruins creative endeavor. Take a look at jazz now that it’s taught in universities. I’m really glad Miles Davis didn’t learn his chops from a professor. When artists all know the same thing, culture dies a little.  \nOn the other hand, I am glad my doctor has a degree…  \npeace\n\n"
    },
    {
      "time": " 26.Jul.2005 4.11pm",
      "content": "I think we have to give students credit for deciding what to accept while in school and what to reject later. It is fair to give something a good effort as a student so that they have experienced it before rejecting it. We all have had both dogmatic teachers and those open to dialogue. I have learned from both but sometimes did not see the value (or the folly) until years later. Imagine having a professor who says path “A” is always a mistake and path “B” is always the choice to take. If we agree with him, life is simple (at the time). If we don’t agree, we are in for a bumpy ride. Later, we might have other life experiences which causes us to reverse positions. What I am saying is that a bright student is not condemned to a life sentence of agreement or opposition to what they experienced in school.\n\nChrisL\n\n"
    },
    {
      "time": " 26.Jul.2005 4.42pm",
      "content": "Agreed.  \nBut an auto-didact gets to learn what they want, when they want. Can it lead to an “incomplete” education? Yes, but it can also lead to an original body of knowledge.  \nFor me this is most evident in music, especially jazz. The forward strides that were made historically in jazz pretty much stopped as soon as academia started teaching people how to play it correctly.  \nI also believe fine art has suffered at the theoretical hands of higher learning.  \nLike all things, academia is a double edged sword…  \npeace\n\n"
    },
    {
      "time": " 26.Jul.2005 6.50pm",
      "content": "\\> a bright student is not condemned to ...\n\nOK, but the less bright are people too.\n\nPaul: Right on, all around.  \nListen to us Angelenos, guys. :-)\n\nhhp\n\n"
    },
    {
      "time": " 27.Jul.2005 12.31am",
      "content": ""
    },
    {
      "time": " 27.Jul.2005 12.34am",
      "content": "sorry, something waas wrong...\n\n\\>Also, since I think chirographic type is essentially flawed\n\nCan you explain that, Hrant? (arguments are welcome)\n\n"
    },
    {
      "time": " 27.Jul.2005 1.30am",
      "content": "school of life.\n\nyou can’t teach talent\n\n;-)\n\n"
    },
    {
      "time": " 27.Jul.2005 4.52am",
      "content": "“OK, but the less bright are people too.”\n\nThe same applies as for bright students.\n\nChrisL\n\n"
    },
    {
      "time": " 27.Jul.2005 8.41am",
      "content": "There’s really a fine line. There seemed to be a few types of students to me. One is a student who accepts whatever he/she is told because they feel that the professor has more knowledge in the subject and should be always listened to. Another student questions what the professor says and asks why and challenges both the professor’s viewpoint and his/her own. I fell in the later category. While I feel I was respectful in my questioning of ideas (wisdom should never be underestimated) road number two often gets you less respect.\n\nIn the later example I feel the student learns less because they question nothing, they learn less. Anyone can regurgitate an idea, but it takes thought and questioning to produce something original. At my recent alma mater The Pratt Institute (Manhattan) I felt that the students that mirrored the “cool” design in annuals and made the slickest looking projects got the most recognition. With a few exceptions, concept seemed merely an afterthought.\n\nSometimes methods become archaic and are not practical by today’s standards. This is something that I often combated. Theory and history are important elements to learn, but sometimes new developments can make old practices obsolete...like using new technology for example. Many of my professors from the golden age of design rejected such modern conveniences as the computer and saw it is the death of the field that many were once prominent in. Whenever a human being reaches a point where they feel they have nothing left to learn, they become obsolete.\n\n"
    },
    {
      "time": " 27.Jul.2005 12.36pm",
      "content": "Daniel, I’ve already rambled on too much about that, including (in fact most of all) on Typophile... :-/ Does anybody here with a younger memory have an archive link handy? If not, I’ll try to provide a synopsis (so as not to derail this thread).\n\n\\> Whenever a human being reaches a point where they feel  \n\\> they have nothing left to learn, they become obsolete.\n\nWell said.  \nThe best teacher is an eternal student.\n\nhhp\n\n"
    },
    {
      "time": " 27.Jul.2005 1.45pm",
      "content": "Class size is very important.  \nIf there is a low enough student to teacher ratio, that allows the teacher to spend some time with each student and help them solve design problems their own way.\n\n"
    },
    {
      "time": " 27.Jul.2005 5.37pm",
      "content": "Sorry, I wasn’t online yesterday, so I have to catch up…  \nSome comments:\n\n\\>Hrant:  \n\\>I mean, really, how could the arrangement of parts made by other people into something static ever be as rewarding as the making of a useful, self-contained little machine that is a font?\n\nIf you design a book and you try to make all the different levels of information - of linear reading and non-linear reading, of cross-references, footnotes, of captions, etc. - really working, then you also design a useful machine. The same applies for a signage system and for any serious (typographic) design job that tries to be more than just superficial decoration.\n\n\\>Cursusductus:  \n\\>Let’s open the eyes to another interesting schools, please.  \nThere is also a type design course at the Atelier Nationale de Recherche Typographique in Nancy, but I hardly know more than the name…\n\n\\>People who studied at Reading, can you tell us something more?  \nIn Reading, calligraphy is important to understand the structure of the letter, but probably it is less important when it comes to actually design of the letters. This is my perception of having studied there, but other Reading students may have come to different conclusions. Generally people are encouraged to design also non-latin typefaces. Writing papers (essay, dissertation) is also part of the assignment.\n\n\\>Paul Cutler  \n\\>Academia often ruins creative endeavor.\n\nSorry, I disagree. Of course, learning about the history of letterforms does not help you immediately to design a better ‘d’ or ‘s’. The ability to form well shaped letters is not so much a matter of controlling the movements of your hand (or your mouse?) as it is a matter of learning how to see, how to look at letters. So the most important thing is to train your eye, and this is best done by trying - and probably failing (failure is an important part of the learning process, probably more important than the all too easily achieved success) - to design letter forms, not by reading about them. But type design is also embedded in a broader cultural context, and this is where theory becomes important again. For me, design is nothing but the visual representation of a series of (hopefully well-informed) decisions about about how to structure and organize content. I do not think that ignorance of theory helps anyone to become a better designer.\n\n\\>tbiddy  \n\\>sometimes new developments can make old practices obsolete…  \nFor this reason, I think design schools must not rely too much on teaching computer programs, but they should teach design skills. Computer programs come and go. Good designer know what they want the computer program to do in order get a specific result, instead of producing easily predictable work by just using pre-defined program features.  \nPeople who are just applying the last photoshop-filter are not much more than decorators. The same applies by the way also to typographers who always use the trendiest type (sometimes the might have even enough taste to choose a really good typeface), but who do not take the pains to analyze the actual requirement of a specific job… This work is actually bound to be an ‘arrangement of parts made by other people into something static.’\n\n"
    },
    {
      "time": " 28.Jul.2005 1.45pm",
      "content": "Wolfgang -  \nYou imply that theory must be learned from a professor. Picasso, Miles Davis and many others prove this is incorrect.  \nI fully agree with your last point. For me the technology is just a tool. Too bad I have to learn it over and over again. The musician learns how to play and never has to relearn his instrument as long as he stays in touch with it. The trumpet doesn’t change.  \nYou see I have many theories, even though I didn’t like school…  \npeace\n\n"
    },
    {
      "time": " 28.Jul.2005 3.22pm",
      "content": "– Picasso, Miles Davis and many others prove this is incorrect.  \n**What does it prove? That the super-duper-talented will make it anyway? So? The best graphic designers** today **have good education, simple as that.  \nAlthough graphic design may look easy, it is in fact a real **Profession** , just like being a **Doctor**.  \nNow, would You seek medical advice from someone who got his education from the University of the Internet?**\n\nIf Picasso was a young aspiring designer today, I wouldn’t be surprised if he’d be interested in doing his Masters at the RCA in London.\n\nƒ\n\n"
    },
    {
      "time": " 28.Jul.2005 5.34pm",
      "content": "\\>You imply that theory must be learned from a professor  \nAlso reading books might help ;)\n\nI do not think that theoretical understanding can only be obtained by formal education. The most important prerequisite is the curiosity of the student. It is more important to ask intelligent questions than to find too fast and ready made answers. Academic or formal (theoretical) education might only help you to formulate your questions more stringent. Probably your curiosity will be more focussed and therefore more ’fertile’. And if you are lucky, the place where you study is providing an atmospere which encourages curiosity. But that’s about it. If you are not curious enough, if you think you already know it all, then the best formal education won’t help you.\n\nThere is no guarantee that theoretical understanding will have any direct positive influence on the (aesthetic) quality of your design. As far as the formal or aestetic side of design is concerned, the arbiter is the eye, and the eye needs to get educated by training, by doing. Theoretical explanations do not help much at this point. But design is embedded in a wider field (there is such a thing as society) and has also functional aspects. To get this aspect of design right, you can not only rely on your eye. You have to be able to ask the right questions and come along with conclusions.\n\nThe third important part (apart from the training of the eye and of the theoretical understanding) in design education is in my view to teach the students design methods. This should help students to develop ideas further and to not just to add one potential solution to another. It is important that the student learns how to develop ideas ans turn a potential design solution to an actual solution. For this reason I mentioned Basle as an extraordinary example of the teaching of design methods, especially for typographic design. Without the teaching of structure, the danger of design being not more than superficial decoration is always at hand. But on the other hand, the teaching of methods is also a quite tricky point, because there is always the danger that after a while people tend to get lazy and the methods might turn into dogmas or into all to easy recipies. A school might produce ony clones of a specific style.\n\nBy the way, some of the best designers I know had no formal qualification at all.\n\nI just think that the notion that all talent is so by nature, birth or destiny and that thinking only drives away your muses is simply bullshit. It just cuts you from the opportunity to learn and is an excuse for intellectual lazyness.\n\nYou can be pretty sure that Miles Davis was quite curious and eager to learn.\n\nYes, the trumpet is always the same, but there is more than one way to how play it.\n\n"
    },
    {
      "time": " 28.Jul.2005 5.46pm",
      "content": "And of course, all intellectual eloquence does not help to save a poor design work. Since it is reproduced it has to be strong enough to stand on its own, without any explanations...\n\n"
    },
    {
      "time": " 28.Jul.2005 7.19pm",
      "content": "Wolfgang, I completely agree with everything you said. One of my favorite professors died suddenly and he was a big Charlie Parker fan. To use another jazz comparison, shortly before he died he mentioned this quote by Charlie Parker:\n\n“First you master your instrument. Then you master the music. Then you forget about all the shit you just learned and just play.”\n\nI think the same rules apply here.\n\n"
    },
    {
      "time": " 28.Jul.2005 8.01pm",
      "content": "\\>Picasso, Miles Davis and many others prove this is incorrect.\n\nAccording to the Wikipaedia: [http://en.wikipedia.org/wiki/Miles\\_Davis](http://web.archive.org/web/20070911194943/http:/en.wikipedia.org/wiki/Miles_Davis \"http://en.wikipedia.org/wiki/Miles\\_Davis\") , Miles Davis first had formal trumpet lessons, and then a series of mentors, including Clark Terry and Charlie Parker.\n\nPicasso’s father was a drawing teacher and was a strict master to him. The story I read is that the father had his son draw a pigeon over and over again, each time pointing out its failings, and how to improve the drawing. Then one day the son came to him with a drawing of the Pigeon that stunned him. The father quitely packed up his drawing kit, presented it to young Pablo, and never drew again.\n\nBoth Miles Davis and Picasso were genius prodigies, but they also had plenty of instruction from professionals.\n\n"
    },
    {
      "time": " 28.Jul.2005 8.14pm",
      "content": "The promised tangent:\n\nDaniel, the main reason chirography is flawed for text face design is that it creates the black bodies through “movements” (GN’s “moving front”, with the elaborations of translation, rotation and pressure), and this has nothing to do with the act of reading (the main point of typography, no?) which deals with black-white relationships. Basically, making type by thinking primarily about the border between the black and white is the ideal, and chirography confuses this.\n\nLike I said, I’ve already written a lot about this on Typophile, and don’t want to clutter this thread. Which doesn’t mean I don’t want to discuss it further - quite the contrary - just not here. But I didn’t want to seem to spurn you, hence the above elaboration.\n\nhhp\n\n"
    },
    {
      "time": " 29.Jul.2005 5.13am",
      "content": "\\>Which doesn’t mean I don’t want to discuss it further - quite the contrary - just not here. But I didn’t want to seem to spurn you, hence the above elaboration.\n\nI agree, Hrant, this is not the place to discuss about chirography, but you post a lot and it’s difficult to follow you ;)\n\n"
    }
  ]
}
