{
  "id": "14140",
  "title": "Favorite Moments of TypeCon2005 -- Post your photo links!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m sure everybody’s got ’em...so let’s hear about your favorite TypeCon 2005 moments!\n\n [‹ A new book](http://web.archive.org/web/20080829190410/http:/typophile.com/node/14980 \"Go to previous forum topic\") [Seattle types? ›](http://web.archive.org/web/20080829190410/http:/typophile.com/node/14971 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080829190410/http://typophile.com/user/7475\" title=\"View user profile.\">biddy</a>",
  "time": "<br>",
  "uid": "7475",
  "comments": [
    {
      "time": " 25.Jul.2005 1.21pm",
      "content": "how ’bout you go first. ;^D\n\n"
    },
    {
      "time": " 25.Jul.2005 1.32pm",
      "content": "how about photos?\n\n"
    },
    {
      "time": " 25.Jul.2005 1.36pm",
      "content": "Ed Rondthaler blowing out the single candle on his birthday cake!\n\n"
    },
    {
      "time": " 25.Jul.2005 1.48pm",
      "content": "I’ll have some of my photos up tonight or tomorrow. I just realized, though, that my 256 sd card is corrupt. So... I will have less photos than I actually shot :(\n\n"
    },
    {
      "time": " 25.Jul.2005 3.08pm",
      "content": "One of my favorite moments was seeing [Gary Munch's](http://web.archive.org/web/20080829190410/http:/typophile.com/wiki/Gary%252BMunch) presentation on Cyrillic alphabet... “Ya, arr!”\n\nAnother was realizing what a dancing machine [Yves Peters](http://web.archive.org/web/20080829190410/http:/typophile.com/wiki/Yves%252BPeters) is... His new name is Yves “Gumby” Peters.\n\n"
    },
    {
      "time": " 25.Jul.2005 3.34pm",
      "content": "I would like to post a VERY BIG THANK YOU to everyone involved in putting TypeCon together this year. I don’t know who everyone was so I can’t name all the names. I know Tamye, Tiffany, Jared, Joe, Yves, and Zara were part of gang but there were many other smiling helpful faces putting in tons of volunteer hours to make it a big success.  \nTo all of you, THANK YOU it was a wonderful experience.\n\n(The only chilly reception was the temperature in the auditorium :-)\n\nChrisL\n\n"
    },
    {
      "time": " 25.Jul.2005 7.00pm",
      "content": "Please don’t forget to post your pics to the [TypeCon Flickr](http://web.archive.org/web/20080829190410/http:/www.flickr.com/groups/typecon/) ...\n\nI’m going to try and write a readable post about TypeCon soon. But the conference was amazing on many levels. It was, yet again, an intense week — give or take a day — of type, typography and friends.\n\n"
    },
    {
      "time": " 26.Jul.2005 6.17am",
      "content": "One moment would be tough to highlight, so many good ones.\n\nThe worst thing about TypeCon is its effect as a serendipity engine: each year I go I end up with enough new ideas that would take many years to realize. So many embryos to freeze.\n\n"
    },
    {
      "time": " 26.Jul.2005 8.00am",
      "content": "Watching Yves dance was truly a sight to behold. BTW, Yves you’re still supposed to show me some moves. A highlight for me was also watching Alessio Leonardi’s presentation...very, very funny.\n\nJason, I didn’t get to meet you at TypeCon. :(\n\n"
    },
    {
      "time": " 26.Jul.2005 9.53am",
      "content": "There were lots of great moments but, for me, playing drop-the-stuffed-toy and pick-up-the-stuffed-toy with Thomas’s utterly charming baby girl heads the list.\n\nChrisL\n\n"
    },
    {
      "time": " 26.Jul.2005 12.23pm",
      "content": "Favorite quote - “Over 50% of people in Iceland consult the elves when building a house” David Berlow during his tribute to Matthew Carter.\n\nFave moment - being on stage when Matthew received the SoTA award.\n\nI ♥ MC Si\n\n"
    },
    {
      "time": " 26.Jul.2005 12.52pm",
      "content": "Well I have been trying to think of one moment, but had come to the conclusion that it is completely impossible. So many great memories. I can’t think of a more inspiring, insane, influential, intense, karaokeing, dancing, insominia inducing, and at many moments dumbfounding time. Perhaps a list of moments to come.\n\nShu\n\n"
    },
    {
      "time": " 26.Jul.2005 1.22pm",
      "content": "Low point - having to take a cab to JFK without Shu - Sorry, I waited til 5.15 :-( hope you caught your flight.\n\nSi\n\n"
    },
    {
      "time": " 26.Jul.2005 1.48pm",
      "content": "Ed Rondthaler was amazing to watch. I really like his alphabet song and he impressed the heck out of me with his memory – never missed a beat when it came to remembering a name or date. Alessio Leonardi gave a very entertaining talk, and sweating with everyone at Roger Black’s lovely sauna was also quite memorable. The duck at Les Halles was brilliant and juicy. There are so many wonderful experiences that I could write a book, but overall I was very inspired by the people I met and everything that I learned from them.\n\nPhotos to come soon on [my Flickr page](http://web.archive.org/web/20080829190410/http:/flickr.com/photos/zara)– don’t forget about the [TypeCon Flickr pool](http://web.archive.org/web/20080829190410/http:/flickr.com/groups/typecon/pool/)!\n\n"
    },
    {
      "time": " 26.Jul.2005 1.53pm",
      "content": "Low point - waking up late and making Si wait for me for no reason. I did make my flight, no problems there, but I sure felt bad.\n\n"
    },
    {
      "time": " 26.Jul.2005 2.00pm",
      "content": "No worries. Glad you made it home.\n\nCheers, Si\n\n"
    },
    {
      "time": " 26.Jul.2005 2.51pm",
      "content": "Finally convincing Dave Farey to expand his [Cachet](http://web.archive.org/web/20080829190410/http:/www.fontshop.com/showfont.cfm?fid=C.103160.0.0&searchby=searchresults) family. (Sometimes it takes a few nudges from some cogent [friends](http://web.archive.org/web/20080829190410/http:/www.normanhathaway.co.uk/).)\n\n"
    },
    {
      "time": " 26.Jul.2005 2.56pm",
      "content": "favorite moment: taking my pants off (in the elevator, in the ballroom, in my room, in other folks’ rooms), ass-biting, “whatever.”\n\n"
    },
    {
      "time": " 26.Jul.2005 3.21pm",
      "content": "Favorite moments:  \nWatching friends eat “cow dick” fear factor style.  \nEnjoying the Ed, Ed & Ken talk.  \nMeeting so many wonderful new friends.\n\nI’ve posted my favorite photos to the [Typecon Flickr Pool](http://web.archive.org/web/20080829190410/http:/flickr.com/groups/typecon/) as well.\n\n\\> !&\\*[^${-#\\<%)/~=@+(\\?;\\>”}-\n\n[www.typotect.com](http://web.archive.org/web/20080829190410/http:/www.typotect.com/ \"www.typotect.com\")  \nWhereSquaresGoForDimension\n\n"
    },
    {
      "time": " 26.Jul.2005 4.18pm",
      "content": "Low point: realizing at 2am that I’ve got to wake at 4am for a 6am flight. Still recovering from that one.\n\nHigh point: Seeing [Donald Beekman](http://web.archive.org/web/20080829190410/http:/typophile.com/wiki/Donald%252BBeekman) on the turntables. That guy can spin!\n\nFunniest point: [Christoph Winkler](http://web.archive.org/web/20080829190410/http:/typophile.com/wiki/Christoph%252BWinkler) (technical guru at [Linotype](http://web.archive.org/web/20080829190410/http:/typophile.com/wiki/Linotype)) telling us to stop playing records backwards and to just play some classic rock! Christoph, no hard feelings, but you’ve got to be more specific. I assumed that since you’re German you’d appreciate some techno. Cheers mate.\n\nEpiphany: Speculating with [Si](http://web.archive.org/web/20080829190410/http:/typophile.com/wiki/Simon%252BDaniels) about why [Apple](http://web.archive.org/web/20080829190410/http:/typophile.com/wiki/Apple) doesn’t make it to these conferences. If they’re really a design oriented company, where are they in the type world? (They’re only at [ATypI](http://web.archive.org/web/20080829190410/http:/typophile.com/wiki/ATypI) it seems).\n\nRealization: Contrasting how nice [Paula Scher](http://web.archive.org/web/20080829190410/http:/typophile.com/wiki/Paula%252BScher) is in person to... someone else.\n\nRealization: Re-remembering how much I love [Cyrillic](http://web.archive.org/web/20080829190410/http:/typophile.com/wiki/Cyrillic).\n\nRealization: San Francisco weather really is the best weather in the whole friggin’ world.\n\n"
    },
    {
      "time": " 26.Jul.2005 5.04pm",
      "content": "My images are incredibly random, but I’ve just added some of them to the [TypeCon Flickr Group](http://web.archive.org/web/20080829190410/http:/www.flickr.com/groups/typecon/).\n\n"
    },
    {
      "time": " 26.Jul.2005 11.50pm",
      "content": "Hi all,  \nit was great to bet at the TypeCon and meet so many of you in person. I’ve got an hard time to get used to NY — and now it seems like Lisbon is a ghost city! Nobody here!  \nI’m still jetleging! so, no serious comments. A big Thank you! and a big Hello!  \nHave Fun!  \nM Feliciano\n\n"
    },
    {
      "time": " 27.Jul.2005 7.46am",
      "content": "Seeing Ed Rondthaler so sharp at age 100 was amazing. So much wisdom, I can’t imagine all the things he’s seen in his lifetime. Getting my type critiqued by Matthew Carter, John Downer, Akira Kobiyashi, and Erik Spiekermann was a dream come true. I met a lot of neat people and in contrast to the fields I was previously involved in (entertainment and the arts) everyone I met seemed very down to earth.\n\n"
    },
    {
      "time": " 27.Jul.2005 12.30pm",
      "content": "Terry, could you please describe your type crit experience more deeply?  \nNot necessarily in this thread.\n\nhhp\n\n"
    },
    {
      "time": " 27.Jul.2005 2.02pm",
      "content": "Shu! I didn’t realise up till now you were the hairy eleven! Send me yo’ e-mail address, dude! :)\n\nThe highlight of the conference for me was finally meeting so many people I already knew, plus getting to know some of them better (this includes Shu, beautiful guy and the unsung hero of this conference).\n\n"
    },
    {
      "time": " 27.Jul.2005 3.24pm",
      "content": "You know the biggest clue that I am the hairy Eleven is that is says shu right above that. It is tricky though. That’s one of those logos I designed for my firm that never got used so I figured I should use it in some way. My boss assured me that it is going to reappear in some way. We can only hope. Might change that logo soon though, kinda bored with it.\n\nYves! You are definitely on my list of highlights. Although I can’t really say I am too unsung. Running the risk of being oversung, perhaps. Will send my address once you come back online.\n\n"
    },
    {
      "time": " 27.Jul.2005 4.32pm",
      "content": "UNSUNG!\n\n"
    },
    {
      "time": " 27.Jul.2005 4.49pm",
      "content": "Mario, your presentation was great and I was drooling over the faces. It was nice to hear about a topic that is not always obvious to typophiles.\n\n"
    },
    {
      "time": " 27.Jul.2005 7.10pm",
      "content": "_Epiphany: Speculating with Si about why Apple doesn’t make it to these conferences. If they’re really a design oriented company, where are they in the type world? (They’re only at ATypI it seems)_\n\nActually, it has been a while since we’ve seen Apple at ATypI. Peter Lofting was in Rome in 2002, but that was the last time Apple were represented. Frankly, I’d be happy to see them only attending TypeCon if it were an indication that they were paying any serious attention to type. :(\n\n"
    },
    {
      "time": " 27.Jul.2005 8.28pm",
      "content": "I think “Hairy Eleven” should be Shu’s new(est) nickname.\n\n"
    },
    {
      "time": " 27.Jul.2005 8.50pm",
      "content": "Apple’s Peter Lofting attended TypeCon2003 in Minneapolis, and I \\*believe\\* I chatted with him briefly at TC04 in SF last summer (I seem to recall he was traveling and could only make it for one day or something like that). Apple kindly loaned us Macs for the conference last year, which was a huge help for registration, the store, and attendee “surf stations.”\n\nThere was another Apple rep or two registered last year, but I’m sure that was due to Apple’s proximity to the conference venue. No Apple folk were in attendance in NYC.\n\nI think our little type events are a tiny blip on a radar filled with larger events better targeted to Apple’s marketing/recruitment/etc. strategies... but we can always hope for more participation in the future.\n\n"
    },
    {
      "time": " 28.Jul.2005 9.33am",
      "content": "This conference was a wonderful experience for me. Various highlights:\n\n1. Discussing my efforts in type design with some experienced type designers. Like Terry, I was overjoyed that you can actually get the best in the world to discuss your work, and found it tremendously stimulating and thought-provoking.\n\n2. The chance to meet Typophiles in the flesh and blood. Typophile is great, but meeting in person way better.\n\n3. Presentations: Paula Sher’s exciting typography. Mario Feliciano’s wonderful revivals of Spanish types. Yves Peters courageous criticism of corporate type pirates—and his amazing dancing.\n\n4. The ’Subway Blues’ workshop, which I moderated. It was great that Tamye was willing to put it on the program and find space to talk about NYC transport signage. And it was terrific to have such a stellar panel all agree to be on the round table: Neysa Pranger of Straphangers.org, Eric Spiekermann, James Montalbano, Terry Biddle, and John Berry. All had really interesting and different points to make. I will post more to the thread on it.\n\n5. I was sad that in arranging the round table and getting critiques I missed: Nick Shinn’s workshop on Open type, John Downer on ’Paperback’ and the Graffiti presentation.\n\nOk, Ok I know, too many superlatives. But this was in fact hands down the best experience for me at a conference, ever!\n\n"
    },
    {
      "time": " 28.Jul.2005 9.52am",
      "content": "I had a great time, this was my first typecon. I learned alot listening to the speakers and doing a few of the workshops. Great to meet so many from the forum. Learned a lot about the industry, thanks to everyone I talked to.\n\nOn a side note, the Roosevelt’s bar and restaurant prices were (are) awful!\n\n"
    },
    {
      "time": " 28.Jul.2005 10.01am",
      "content": "Emel, it wouldn’t be fair to pick on one place in particular. Pricing all over NYC is quite high.\n\n"
    },
    {
      "time": " 28.Jul.2005 10.07am",
      "content": "Hotels are notoriously expensive in their food service in big cities.\n\nChrisL\n\n"
    },
    {
      "time": " 28.Jul.2005 10.14am",
      "content": "I paid 3.50 for a cup of coffee in the hotel one morning. Regular coffee. No frill coffee. I almost fainted.\n\nThat was my lowest point of the conference.\n\n"
    },
    {
      "time": " 28.Jul.2005 10.41am",
      "content": "lol I understand food in NY can be expensive, but the cafes and delis around the hotel were much much cheaper. Roosevelts pricing was bandit-like.\n\n"
    },
    {
      "time": " 28.Jul.2005 10.45am",
      "content": "It’s a beautiful hotel though to be sure - in fact next time I’m in NY im going to stay there.\n\n"
    },
    {
      "time": " 28.Jul.2005 11.38am",
      "content": "I remember the (hors-conference) food at ATypI-99 being quite sad. The hotel had a small over-priced bakery with stale goods. That was it. It was called “Au Baun Pain”, but Simon dubbed it “Au Big Pain”.\n\nhhp\n\n"
    },
    {
      "time": " 28.Jul.2005 12.04pm",
      "content": "“Au Baun Pain” is a chain of feaux French bakeries/sandwich shoppes accross the East. If it is a chain, it is a pain :-)\n\nSo did you buy one of those fur coats Hrant? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 28.Jul.2005 12.30pm",
      "content": "From Novosibirsk? No, but I have a great photo of a fur shop there.\n\nhhp\n\n"
    },
    {
      "time": " 28.Jul.2005 12.48pm",
      "content": "some high points:\n\nsitting in the “hot seat” for a type critique  \nseeing that beautiful onestorey/twostorey “a” along with some other stunning blackletter  \nbeing introduced to a gay version of clarendon  \nand above all... i’d hafta agree that meeting friends from online was the most amazing thing\n\n"
    },
    {
      "time": " 28.Jul.2005 3.36pm",
      "content": "Guys, guys, hotel bars and restaurants are almost always subpar and overpriced. That is the rule, not the exception. Best to judge the hotel by its location and price, especially when there are so many eateries in a close vicinity.\n\n"
    },
    {
      "time": " 28.Jul.2005 5.28pm",
      "content": "True Stephen. I was very happy with the Roosevelt and especially glad we stayed in the ’official’ conference hotel. (And Au bon Pain is a chain store in every mall in America... you were duped!)\n\nThe wireless at Parsons was a disappointment though - but I’m spoiled by [FlashForward](http://web.archive.org/web/20080829190410/http:/typophile.com/wiki/FlashForward).\n\n"
    },
    {
      "time": " 28.Jul.2005 7.48pm",
      "content": "Duped? You mean like into needing food to live?  \nThere really was nothing else to eat there. :-(\n\nhhp\n\n"
    },
    {
      "time": " 29.Jul.2005 8.37am",
      "content": "For those of you who wish for a tricky way to add your photos to the [TypeCon Flickr Group](http://web.archive.org/web/20080829190410/http:/www.flickr.com/groups/typecon/) and wish to do it more quickly than one at a time:\n\n(1) Make sure you’ve joined the group  \n(2) Go into the **Organizer**  \n(3) Click on the **Your Groups** tab  \n(4) Select **TypeCon**  \n(4) One at a time, patience is key, hold the **a key** down and click on the photos you wish to add.\n\nFlickr is down at the moment, but I’ll double check this in a while. _These instructions are courtesy of Quasistoic, Flickr Maestro and Zen Master._\n\n"
    },
    {
      "time": " 29.Jul.2005 9.24am",
      "content": "I just uploaded 13 photos (that maxed out my free 20mb for July; since August 1 is just on MOnday, maybe I can get some more photos up then?). This was the first time I had used Flickr. Is the “add one at a time” method described above the only way to get photos onto a group like this?\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080829190410/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 29.Jul.2005 9.35am",
      "content": "Once you’ve joined the group you can use the mass share with the group described above or you can do it even more slowly:\n\n(1) Viewing the image  \n(2) Above the image, in the icons, second icon over, **Share with Group**\n\n"
    },
    {
      "time": " 29.Jul.2005 10.02am",
      "content": "If you use iPhoto, the [Flickr Export plugin](http://web.archive.org/web/20080829190410/http:/www.speirs.org/flickrexport/) is handy.\n\n"
    },
    {
      "time": " 29.Jul.2005 11.11am",
      "content": "I just upgraded to Tiger today (from 10.2.8… ugh!), and I am very pleased, although performance speed on my Powerbook is way down. I used the Flickr export plug-in. I just wish it would have add the photos to groups, too.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080829190410/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 29.Jul.2005 11.51am",
      "content": "Here, Here! I agree with you, Dan. I love that little export plugin, but wish it did allow for automatic inclusion under groups.\n\n"
    },
    {
      "time": " 29.Jul.2005 12.27pm",
      "content": "Also available is the flickr [“Uploadr”](http://web.archive.org/web/20080829190410/http:/www.flickr.com/tools/) It’s a small install  \nIt lets you upload multiple photos at a time and you just drag and drop them into it.\n\n"
    },
    {
      "time": " 29.Jul.2005 9.05pm",
      "content": "I’ve added a bunch of my photos to the [TypeCon group](http://web.archive.org/web/20080829190410/http:/www.flickr.com/groups/typecon/) already, but I also have quite a few (albeit slightly less TypeCon specific) shots from my trip to New York in [this Flickr set](http://web.archive.org/web/20080829190410/http:/www.flickr.com/photos/splorp/sets/624032/). They’re mostly buildings and signs and streets and such. I guess I was too shy to take pictures of the fine people I met during the conflagration. Next year, ok?\n\n"
    },
    {
      "time": " 30.Jul.2005 3.19am",
      "content": "Flickr export plugin!? Rock on.\n\n"
    },
    {
      "time": " 30.Jul.2005 9.39am",
      "content": "[Fraser Speirs](http://web.archive.org/web/20080829190410/http:/www.flickr.com/people/fraserspeirs/), the developer of the Flickr plugin, is very open to suggestions and bug reports. It’s a fantastic free add-on to iPhoto. Rock on, indeed.\n\n"
    },
    {
      "time": " 30.Jul.2005 11.29am",
      "content": "I think its time to change the name of this topic to Flickr Fanatiks.\n\n"
    },
    {
      "time": " 2.Aug.2005 9.50am",
      "content": "James, please come and join us! No need to be jealous of our picture sharing. What’s your email and I’ll invite you.\n\n—\n\nI think the funniest moment, for me — well one of the funnier moments — was when Harry Parker compared my skin to his and told me the freckles would never meet up and to stop trying.\n\n"
    },
    {
      "time": " 2.Aug.2005 11.12am",
      "content": "Who is this “Harry Parker” character?\n\n"
    },
    {
      "time": " 2.Aug.2005 11.17am",
      "content": "Ack! Harry Parker is Mike Parker’s son. Man, I can’t seem to get the names straight. Of course, I meant Mike Parker! Did I say that on Flickr too? Oh dear.\n\n"
    },
    {
      "time": " 2.Aug.2005 11.20am",
      "content": "You see, Matthew Carter’s father’s name is Harry Carter. Mike Parker’s son’s name is Harry Parker ... so I will probably continue to get there names all mixed up. So sorry. :^!\n\n"
    },
    {
      "time": " 2.Aug.2005 9.35pm",
      "content": "Speaking of naming typographic offspring... I discovered during the talk by [Daniel Pelavin](http://web.archive.org/web/20080829190410/http:/typophile.com/wiki/Daniel%252BPelavin) that his daughter’s names are Anna (which I knew from his typeface) and Molly - the same names as my two daughters. You could have knocked me over with a sheet of dry transfer lettering.\n\n"
    },
    {
      "time": " 2.Aug.2005 11.39pm",
      "content": "Mr. Parker, er, I mean Miss Tiff...  \nYou seem to be a bit confused with all the names. I actually thought you were quoting Sir Parker or making some bizarro typographic reference to Harry Potter.\n\n"
    },
    {
      "time": " 3.Aug.2005 1.26pm",
      "content": "I thought the conference was awesome in so many ways. I really enjoyed putting warm human faces to the icons pictured here on typophile and it was great to meet more typophiles and share information. I learned so much!\n\nI was completely inspired by Paula Scher’s presentation and wandered around the city afterwards finding a lot of her work and photographing it; I loved Jakob Trollback’s moving type presentation: totally awesome work; I thought Gerard Huerta’s working sketches were fantastic and now I can say I KNOW who designed the ACDC logo! The presentation by Alexander Isley was really great, too - so much great design and use of typography in it. My favourite presentation overall was the typographic tattoos - something I never really gave much thought to.\n\nMeeting Matthew Carter was the icing on the cake for me. And I thought Carlos Mare 139 Rodriguez summed up the conference, in his last slide, which read:  \n“Embrace Competitiveness  \nChallenge your Mentors  \nContribute Originality  \nExpand the Dialogue  \nHonour your Mentors”\n\nThanks to everyone for such a great time.\n\n"
    },
    {
      "time": " 3.Aug.2005 2.28pm",
      "content": "Andi,\n\nWere you hiding? I never saw you there.\n\nChrisL\n\n"
    },
    {
      "time": " 3.Aug.2005 2.31pm",
      "content": "Andi was there and we did have a chance to chat. Great that you wrote that down, Andi, I meant to myself. Thanks for posting that.\n\n"
    },
    {
      "time": " 3.Aug.2005 3.08pm",
      "content": "I was there Chris, but I was a bit shy.\n\nI did manage to introduce myself to Terry, Nick Shinn, William, Tiffany, Dan, Tamye and a few others. I had a bit of a weird experience with someone when I tried to introduce myself to them at the start of the conference and that put me off being too forward and friendly. : (\n\nI did manage to corner Grant and give him a hard time about the lack of Veer shwag at the conference, though and I drowned my sorrows in the many type tshirts I did buy. (Yes, I know Grant, I know...)\n\n"
    },
    {
      "time": " 3.Aug.2005 3.10pm",
      "content": "Did you get a hoody?  \n:-)\n\nChrisL\n\n"
    },
    {
      "time": " 3.Aug.2005 3.13pm",
      "content": "Lots of cool tshirts - alas, no hoodies though...\n\n"
    },
    {
      "time": " 3.Aug.2005 3.17pm",
      "content": "I got lots of shirts too. My wife thought I was nuts but of course she is right.\n\nSorry about your bummer encounter of the “wierd experience” type.\n\nChrisL\n\n"
    },
    {
      "time": " 3.Aug.2005 3.46pm",
      "content": "Yeah, well, the nice people at the conference (most everyone) made up for the bad experience tenfold and I plan to try to be more forward at next year’s conference!\n\nAndi\n\n"
    },
    {
      "time": " 3.Aug.2005 3.49pm",
      "content": "Yes, Andi, don’t let that keep you from joining us on our little excursions. I’m still sour about that and wish it hadn’t of happened.\n\n"
    },
    {
      "time": " 3.Aug.2005 4.04pm",
      "content": "Bwaaa... no worries - it’s all cool,  \nThanks though Tiff!\n\n"
    },
    {
      "time": " 3.Aug.2005 4.08pm",
      "content": "what happened?\n\n"
    },
    {
      "time": " 3.Aug.2005 4.13pm",
      "content": "Would rather not get into details but since you asked:\n\nI introduced myself to someone and asked if they were at the conference too (I recognized their photo from the typophile site) and they answered with a “No”. I felt a bit embarassed, apologized and left them.\n\nI then saw them join up with other typophiles. And they ignored me all conference long. I was quite suprised! I mean, I checked for bad breath and all but couldn’t quite figure out what happenned.\n\nAnyway, it made me a bit more cautious after that and I met a lot of very very cool people with a lot more class afterwards, who admitted they WERE at the conference.\n\nLife. You gotta love it!\n\n"
    },
    {
      "time": " 3.Aug.2005 4.25pm",
      "content": "wow. disgusting behavior.\n\n"
    },
    {
      "time": " 3.Aug.2005 4.32pm",
      "content": "and man, is Matthew Carter ever tall!\n\n"
    },
    {
      "time": " 3.Aug.2005 4.37pm",
      "content": "I think of Matthew Carter as being the James Bond of the type design community. And by James Bond, I mean Sean Connery, not Roger Moore or Timothy Dalton, but perhaps Pierce Brosnan but only in the Tomorrow Never Dies.\n\n"
    },
    {
      "time": " 3.Aug.2005 4.40pm",
      "content": "As they said in the presentation to Mr. Carter: “I didn’t think you would look like THAT.”\n\nChrisL\n\n"
    },
    {
      "time": " 3.Aug.2005 6.43pm",
      "content": "Andi, sorry someone was rude to you! That is strictly verboten at TypeCon... we’ll have to do some serious ass-kickin’ if it happens again.\n\n"
    },
    {
      "time": " 3.Aug.2005 7.11pm",
      "content": "no worries, no worries - did you like the prezzie Tamye?\n\n"
    },
    {
      "time": " 3.Aug.2005 7.39pm",
      "content": "Andi, I did like it! Thank you so much... very sweet (in all ways). Shared with my son Jonathan...\n\n"
    },
    {
      "time": " 3.Aug.2005 8.10pm",
      "content": "Ah great!\n\nI was just on the typeradio site: [http://www.typeradio.org/loudblog/index.php?cat=Interviews](http://web.archive.org/web/20080829190410/http:/www.typeradio.org/loudblog/index.php?cat=Interviews \"http://www.typeradio.org/loudblog/index.php?cat=Interviews\") and got to listen to interviews and experience the conference all over again. I just love their logo too!\n\n"
    },
    {
      "time": " 3.Aug.2005 8.49pm",
      "content": "Andi said:\n\n_“I did manage to corner Grant and give him a hard time_  \n_about the lack of Veer shwag at the conference...”_\n\nI am truly sorry about that. It ended up being a mess with the manpower and logistics this year. You weren’t the only attendee that filled our collective ear. I promise (really promise) that we’ll load up a ’tee-party’ full of shwag for Boston. Even if I have to truck the darn stuff there myself.\n\n"
    },
    {
      "time": " 3.Aug.2005 9.43pm",
      "content": "you’re a good man, Grant Hutchinson.\n\n"
    },
    {
      "time": " 4.Aug.2005 2.08pm",
      "content": "Update to TypeCon misunderstanding that I complained about here in this thread: All fixed, everyone happy, virtual hug may have occured, belief in Santa Claus and Easter Bunny once more. Thank you TypeCon gods and goddesses for intervention. Mwa, mwa, mwa.\n\n"
    },
    {
      "time": " 4.Aug.2005 2.30pm",
      "content": "_I had a bit of a weird experience with someone when I tried to introduce myself to them at the start of the conference and that put me off being too forward and friendly._ : (\n\nThat would be me. : (\n\nI just received an e-mail from Andi, asking about the Roosevelt incident, and all I can say is I’m so totally and utterly sorry for what happened. I could attribute it to me being nervous at the prospect of meeting Jonathan Hoefler and Stephen not showing up and being in New York for the first time and the lack of sleep of the past days combined with the jetlag, but the bottom line is I _completely misunderstood_ Andi. There really is no excuse for how I behaved, even if it was unwittingly.\n\nI could let this go by quietly as I already sent an e-mail to Andi profusely apologising for this horrible misunderstanding, but I feel public apologies are in order. I hope that people know me well enough to realise this was completely out of character for me. I feel _so_ bad about all this and just wish I could do something, anything to set things right.\n\nAgain, please accept my sincerest apologies, Andi.\n\nAnd anybody, if I zone out and anything like this _ever_ happens again, just friggin’ slap me. Like, really hard.\n\n"
    },
    {
      "time": " 4.Aug.2005 2.38pm",
      "content": "Yves, bravo - you’re a man in a boy’s world.\n\nhhp\n\n"
    },
    {
      "time": " 4.Aug.2005 2.40pm",
      "content": "I’m proud of you, Yves. I had a feeling it was a misunderstanding and should’ve told Andi to approach — and slap — you at the conference. It takes humility to apologize publicly. I guess that ego isn’t so out of control after all.\n\n"
    },
    {
      "time": " 4.Aug.2005 2.42pm",
      "content": "I appreciate you owning up to the adventure, Yves. Apology accepted of course. Thank you.\n\n"
    },
    {
      "time": " 4.Aug.2005 3.57pm",
      "content": "Yves, thanks for clearing this up... but we can still slap you if we want, right?\n\n"
    },
    {
      "time": " 4.Aug.2005 4.38pm",
      "content": "Yes, I still want to slap him. On the ass.\n\n"
    },
    {
      "time": " 4.Aug.2005 5.45pm",
      "content": "If you slap Yves “on the...”, you’ll mess up his dance moves ability—it would be a shame if he would be reduced to mearly recognizing typeface names :-)\n\nChrisL\n\n"
    },
    {
      "time": " 4.Aug.2005 10.45pm",
      "content": "Errr... I feel there should be a time limit on the slapping, and it should be limited to the concerned parties. It’s not like this isolated incident would give everybody and his dog slapping credits for the next twenty years to come. Seriously, my poor ...\n\n"
    },
    {
      "time": " 6.Aug.2005 5.36am",
      "content": "My favorite moment was seeing just one Type Person live to be 100, I was waiting for him to put his hands behind his back, mutter something about “having to go now..”, and pffft! disappearing entirely, with not even a cloud of wordspaces...Getting to teach a new generation how to determine if they’re left or right eyed with the master, Ed B. who taught me the wandering thumb trick. was a close second. . . and I’m not doing another 8. :)  \nP.S. whoever herein returned my authoring rights, thanks.\n\n"
    },
    {
      "time": " 6.Aug.2005 8.09am",
      "content": "Thank you David for being on the critique team. It was good being in the “hot seat” with such illustrious tutors at the helm.\n\nChrisL\n\n"
    },
    {
      "time": " 6.Aug.2005 8.25am",
      "content": "Chris, that was John Downer on the critique team, with Matthew Carter and Akira Kobayashi.\n\n"
    },
    {
      "time": " 6.Aug.2005 9.33am",
      "content": "Opening mouth, Inserting foot :-\\<\n\nChrisL\n\n"
    },
    {
      "time": " 8.Aug.2005 3.12pm",
      "content": "“That would be me. : (“\n\ntroubleman. troubleman :)\n\n”...wish I could do something, anything to set things right.”\n\nsend good comics :)\n\n"
    },
    {
      "time": " 8.Aug.2005 3.33pm",
      "content": "Hey, I was nervous, I was phased, my ears were still adapting to American English (I’m used to British), I misunderstood! I really thought Amy was somebody attending some conference at the hotel. I feel terrible about this, give me a break. :^/\n\n_send good comics_ :)\n\nWell, actually, you’re closer to the truth than you might suspect. :^P\n\n"
    },
    {
      "time": " 8.Aug.2005 5.58pm",
      "content": "Ah, Alexander Isley’s presentation was great some great points about showing clients work in progress. I loved Carlos Rodriguez’s presentation as well...very inspirational. One of these days I’m gonna reward myself with some type tattoos.\n\nI’m surprised no one has mentioned Ray Cruz’s presentation, I thought it was very interesting and different. How does somebody just decide to start doing that?\n\n"
    },
    {
      "time": " 8.Aug.2005 8.13pm",
      "content": "\\> American English\n\nNow you’ve **really** pissed Andrea off. ;-)\n\nhhp\n\n"
    },
    {
      "time": " 8.Aug.2005 9.07pm",
      "content": "\\>adapting to American English\n\nThat is a real problem. I met my wife in England and she claims that she couldn’t understand me for a year because of my American accent. By that time were were married and it was too late!\n\nDon’t slap Yves, kiss him or shake his hand. He had the courage to stand up to corporate pirates at TypeCon. And everybody does something idiotic now and then, but it takes a [mentsh](http://web.archive.org/web/20080829190410/http:/www.mentsh.com/) to admit it and move on.\n\n"
    },
    {
      "time": " 9.Aug.2005 3.31am",
      "content": "Don’t stir up trouble, Hrant. : ) Yves already referred to me as “Amy” in his last post. And I’m Canadian, for the record, so I don’t have an accent, eh?\n\nAnd yes, we all do idiotic things periodically. It happens. But I doubt that my english is so incomprehensible that someone would not understand me if I asked a question. Let’s move along now, shall we?\n\n"
    },
    {
      "time": " 9.Aug.2005 4.21am",
      "content": "Oops, sorry x 2 Andi. I made the same mistake a foreign friend of mine usually makes, when he calls me Peter instaid of Yves. :-/\n\nBTW I’ll post my favourite moments in the next Bald Condensed on [Typographer.org](http://web.archive.org/web/20080829190410/http:/typographer.org/), which is due somewhere this week.\n\n"
    },
    {
      "time": " 9.Aug.2005 4.33am",
      "content": "Yves, Il n’ya pas de quoi fouetter un chat. (No worries)\n\n"
    },
    {
      "time": " 9.Aug.2005 8.16am",
      "content": "Andrea, how rude of you not to have approached Peter in French. ;-\\>\n\nhhp\n\n"
    },
    {
      "time": " 9.Aug.2005 1.34pm",
      "content": ":-P\n\n"
    },
    {
      "time": " 10.Aug.2005 10.21am",
      "content": "Well, I had trouble with his Parisian accent. .. :O\n\n"
    },
    {
      "time": " 10.Aug.2005 3.42pm",
      "content": "“Silly little _Belgian_ detective, Madame, not French.”  \nHercule Poirot\n\n"
    },
    {
      "time": " 10.Aug.2005 3.53pm",
      "content": "send good comics :)\n\nWell, actually, you’re closer to the truth than you might suspect. :^P\n\nand what is the truth? :)\n\n"
    },
    {
      "time": " 11.Aug.2005 4.51am",
      "content": "[This](http://web.archive.org/web/20080829190410/http:/typographi.com/001024.php) is the truth. There aren’t any left now (the last 40 disappeard within a day after posting on Typographica) so it has truly become a limited edition collector’s item.\n\nWe will do something special with number 200 though, I guess somewhere in September.\n\n"
    },
    {
      "time": " 11.Aug.2005 5.34am",
      "content": "Yves,  \nNow I feel “oh so speycial” having number 55 on your limited edition book :-)\n\nChrisL\n\n"
    },
    {
      "time": " 11.Aug.2005 8.00am",
      "content": "Yves, I should’ve had you jot a note or something on it when I got it from you at TC. Then I could be _extra_ and exclusive.\n\n"
    },
    {
      "time": " 12.Aug.2005 1.26am",
      "content": "Hearing Tiffany’s voice for the first time was kind of cool. It made me feel tired.\n\n"
    },
    {
      "time": " 12.Aug.2005 8.25am",
      "content": "Oh no! Sergej you have to expound on that! Why?\n\n"
    },
    {
      "time": " 12.Aug.2005 9.44am",
      "content": "Well, it was mostly gone for most of the conference... :^P\n\n"
    },
    {
      "time": " 12.Aug.2005 10.04am",
      "content": ":^P But why did it make Sergej feel tired? Did I sound _that_ bad? Oh blast!\n\n"
    },
    {
      "time": " 12.Aug.2005 10.48am",
      "content": "Favorite moments...hmm probably sitting across from Yves at lunch, after lugging 8 boxes of TypeCon shirts back from UPS, and discussing type stuff (duh) then realizing that I had been visiting his website for months now ( [www.typographer.org](http://web.archive.org/web/20080829190410/http:/www.typographer.org/ \"www.typographer.org\")) and now I was face to face with the man himself! I thouroughly enjoyed spending time and talking with you Yves, and I’ve enjoyed my ’Limited Edition’ review booklet. I’ll be sure to go to TypeCon2006 in Boston. I also look forward to meeting some of the other people and getting to experience the next conference not as a volunteer. :D\n\n"
    },
    {
      "time": " 13.Aug.2005 9.25am",
      "content": "Well, for some reason I imagined you wearing a very heavy hat.\n\n"
    },
    {
      "time": " 13.Aug.2005 3.37pm",
      "content": "Huh?\n\n"
    },
    {
      "time": " 15.Aug.2005 7.17am",
      "content": "“Thank you David for being on the critique team.”\n\nI guess it’s kind of like the 60’s, hu. I think the proper symbol is :-O 5-arch-heel\n\n"
    },
    {
      "time": " 31.Aug.2005 2.22pm",
      "content": "My report is up at typographer.org, but does anybody know about anyone else’s report anywhere?\n\n"
    },
    {
      "time": " 2.Sep.2005 2.57pm",
      "content": "One of the highlights for me was [this minor incident](http://web.archive.org/web/20080829190410/http:/dreamer.nitro.dk/scans/akira-san.html).\n\nThe guy was later seen walking through the streets of Bad Homburg, Germany, mumbling “Biisuto, biisuto …” as the only reaction to numerous attempts of establishing contact with him.\n\n"
    },
    {
      "time": " 3.Sep.2005 1.10pm",
      "content": "”... I think the proper symbol is :-O 5-arch-heel”\n\nOr how about :-O \\<-U ? or is the horse shoe too much hoof-and-mouth disease?\n\nChrisL\n\n"
    }
  ]
}
