{
  "id": "14153",
  "title": "Time Design",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "This logo is for a Concierge Service that aren’t the traditional “keeper of the keys”. They are basically personal assistants that run errands, secritary duties, cook, clean, remind you of appointments & birthdays, and many more things.\n\nThe hard part of this logo is that you can’t show anything specific from what they do because there is such a large amount of duties. I decided to use time as the center of the name and logo (I thought of the name as well). I don’t like using a clock to represent time. An hour glass seems the best solution.\n\nIn the illustrations, the hour glass is alot more sand in it because Time Design frees up your time. I didn’t want to make the hour glass too specific to an actual hour glass. I tried to simplify it, but I am not happy with it and would like fresh perspectives.\n\n| Attachment | Size |\n| --- | --- |\n| [sundial2.gif](http://web.archive.org/web/20060522215749/http:/typophile.com/files/sundial2.gif) | 9.92 KB |\n| [FINALhourglass.August5.gif](http://web.archive.org/web/20060522215749/http:/typophile.com/files/FINALhourglass.August5.gif) | 5.06 KB |\n\n",
  "author": "<a href=\"user/2214\" title=\"View user profile.\">signs79</a>",
  "time": "<br>",
  "uid": "2214",
  "comments": [
    {
      "time": " 26 July, 2005 - 1:45pm",
      "content": "Well in New York City Concierge Service isn’t about time its about being connected into every service available in the city. Even American Express here gets it, their radio commercial has a woman talking to her butler giving him his orders for the day, he calls AE Concierge Service and all his duties are accomplished and of course the woman catches him at the spa. Its about being connected and about speed or time, a good Concierge could get you anything anytime.\n\n"
    },
    {
      "time": " 26 July, 2005 - 2:01pm",
      "content": "Dan,\n\nDo you suggest that the name and the idea doesn’t work. I am open to suggestions.\n\nMy client said time was a big factor because their goal is to save you time by doing meaningless chores. She stresses that she organizes events, activities, transportation, airlines, etc. She also doesn’t want to stress speed, because many tasks she does doesn’t require speed and she doesn’t want to seem that in those tasks they rush.\n\nShe is happy with the name time design. I want to try and make that work, but I am curious to know if you all think that it doesn’t work. It isn’t set in stone.\n\n"
    },
    {
      "time": " 26 July, 2005 - 5:41pm",
      "content": "If she doesn’t want to stress speed, why name her company “Time Design?” And why design? That makes me think of graphic or interior design. Everytime they answer the phone, they’ll have to say “Time Design Concierge” which is a mouthful.\n\nIf you still go forward with the hourglass concept, perhaps you could incorporate the hourglass into the “g” in Design, as they have similar shapes.\n\nBut Dan is right when a concierge is more about being connected, regardless of the city. Speed is almost a given.\n\n"
    },
    {
      "time": " 27 July, 2005 - 4:41am",
      "content": "Don’t emphsise speed with service. Emphsise quality and personal service. She should use her name as the business name (even if you make up the name)\n\n"
    },
    {
      "time": " 27 July, 2005 - 5:19am",
      "content": "Thanks for the feedback. I am talking with the client about changing the name to something like OnPoint or Baldwin Concierge. I appreciate the feedback. Once we change the name I think there will be more possibilities for a better icon.\n\n"
    },
    {
      "time": " 27 July, 2005 - 8:20am",
      "content": "Well, here’s a vote for ‘time design’. I like it. I think it makes sense.\n\n"
    },
    {
      "time": " 27 July, 2005 - 11:18am",
      "content": "The owner has decided to stay with the name Time Design. She stresses organizing over the other functions of concierge and the design fits what she does. I am going to do an icon with more illustrative qualities. She felt the icon I did was boring.\n\n"
    },
    {
      "time": " 27 July, 2005 - 3:07pm",
      "content": "Well it might make sense where you live, but in Manhattan it just doesn’t float the boat. Speed is an attrabute not the primary function of a Concierge. A concierge here could get you tickets to an opera that was sold out. A concierge here could get you into a nightclub that is impossible to get in to. These are points you should teach the client about.\n\n"
    },
    {
      "time": " 27 July, 2005 - 3:16pm",
      "content": "Once our Druze concierge in Beirut did some PI work brandishing his M-16 to get our stolen Yorkshire Terrier back. The image of him standing at our door, grinning ear-to-ear, with a machine gun in one arm and Ourpig (“little Friday”) tucked in the other is firmly burned into my synapses.\n\nhhp\n\n"
    },
    {
      "time": " 27 July, 2005 - 3:55pm",
      "content": "Hrant that is outragious, are you James Bond or was it your concierge?\n\nb\n\n"
    },
    {
      "time": " 27 July, 2005 - 7:53pm",
      "content": "I was just a bourgeois pre-teen growing up in a really messy war, the kind that’s fought in alleys by people without uniforms. Ourpig was actually stolen a second time, by some militiamen who cornered my brother while he was taking the poor thing on its evening walk. But I guess that case exceeded Abou Imaad’s concierge skills.\n\nhhp\n\n"
    },
    {
      "time": " 28 July, 2005 - 9:57pm",
      "content": "I like your hourglass. What about loosing the frame for it & playiong with the hourglass shape. In fact - this is a little out there but women are said to hjave hourglass figures. What if it was a a female siluwhette with sand pouring inside? Maybe too outragous… Maybe a absract form is better.\n\n"
    },
    {
      "time": " 1 August, 2005 - 6:25am",
      "content": "I find the hourglass image you have drawn a bit ambiguous, maybe you could approach it with a more literal representation which I think would work better with your choice of font, as an alternative you could look at a sundial.  \nTim\n\n"
    },
    {
      "time": " 2 August, 2005 - 7:44am",
      "content": "I think the name works great. It has something mysterious about it, for what _is_ Time Design? It leaves a question in the potential customer’s mind, the answer to which creates a great opportunity to communicate the focus of the company. (You can easily imagine the conversation, can’t you)\n\nFor this to work and not be too mysterious, you need the word concierge. I think that combination works great to set the client’s company apart.\n\nAs for the imagery: I feel the hourglass isn’t conveying the ‘design’ element of the name. It just says ‘time’, which is the least important of the two. Maybe you could think up a way to visualise by using another graphic approach of the hourglass? Something constructed of diverse elements for example (an hourglass made of modern elements, or jigsawlines, etc?)\n\nIn general, I like the idea very much.\n\n——————————————————————————  \nMy work is a game. A very serious game [M.C. Escher]\n\n"
    },
    {
      "time": " 2 August, 2005 - 8:27am",
      "content": "I am attaching a new logo to my original first post. I am using both an hourglass idea and sundial. The sundial looks classier and more interesting. I would love to have feedback on both.\n\n"
    },
    {
      "time": " 2 August, 2005 - 9:58am",
      "content": "That sundial does look good, however the “numerals” shouldn’t go all the way round and should be staggered like [this](http://web.archive.org/web/20060522215749/http:/www.1worldglobes.com/DiscSundials/discsundialsbrass.htm) because the sun doesn’t travel 360 degrees in daylight and the shadow cannot be cast at the front of the dial with the time shadow in the opposite direction. On the other hand you are looking for an instantly recognisable image rather than a literal representation. Having said that the hourglass as g is looking good as well, although the overall look is a bit heavy. I would have a look at the kerning on both, it seems too tight to me except in the me & De combinations.  \nTim\n\n"
    },
    {
      "time": " 2 August, 2005 - 1:08pm",
      "content": "I have updated the sundial with better kerning, and more accurate illustration. Comments would be appreciated.\n\nThanks,\n\n"
    },
    {
      "time": " 3 August, 2005 - 1:42am",
      "content": "Nice illustration - though i think it the ‘arm’ of the dial (forgive my choice of words, my english idiom is realtively small) might be a bit more stylized.\n\nI do wonder if the sundial evokes a feeling of slowness… shadows creeping. And still it only illustrates only the time element, while the design part is the most telling of this client’s activities.\n\nGreat fun to see your development!\n\n——————————————————————————  \nMy work is a game. A very serious game [M.C. Escher]\n\n"
    },
    {
      "time": " 3 August, 2005 - 1:52am",
      "content": "I think this might work. I would do several more versions of the illustration in different styles and maybe work to refine one in this style too. I would try some additional type as well. This is okay but is maybe too precious for a service. I feel like it should either look more or less expensive than this. I think the dial has a few too many details to punch to it’s full potential. It could be simpler & more contrast-y. The whole thing seems a little to soft or grey so far. It gives a contemplative feeling that I like though - like there might be time enough to design your time in.\n\n"
    },
    {
      "time": " 3 August, 2005 - 5:38am",
      "content": "Greg,\n\nI agree with BartvanderGriendt that the name works, but as he and others have said, you’re emphasizing the less important aspect: the passage of time. Why not emphasize its organization (it’s ‘design’). Also, I think the imagery you’re using is counter-productive. Hourglasses and sundials imply older, slower technologies and a certain pastoral simplicity (though I like your original designs). Does a modern ‘time design’ service would want these elements associated with them? If you do use them, I’d make them much more modern and abstract. However, the idea of organization seems more important to the concept.\n\nThe style of mark you’re working with now is well integrated with the type. The character of Rotis and the illustration match, but as Eben said, there are a lot of wispy details. If you print these at a smaller size, they may break or disappear. However, and this is entirely a personal preference, Rotis is really overused right now and isn’t that great anyway. Honestly, I’d drop it. What is it saying for Time Design? I’m not sure it’s saying anything beneficial.\n\nI prefer the design with the hourglass in the ‘g’. Also, I think the type benefits from tighter setting and a cutom adjustment or two (like the ‘Ti’), but I’m not sure about the second headless i.\n\nIt’s an interesting design problem. I can see the good ideas in your work and look forward to see where you go with it.\n\n"
    },
    {
      "time": " 3 August, 2005 - 12:17pm",
      "content": "Crugen has some good points. It might be good to explore the org aspect.\n\nActually you could use an abstracted time date org model with the cattapilars ( or whatever they are called) running next to each other on a chart showing when each thing begins & ends & run it as as a bit more abstract…\n\nOr if the symbol itself ( the cattipillar ) is sufficiently recongnizable because of start & end marks - maybe use it like a ribbon & tie a knot in it to indicate mastery.\n\n"
    },
    {
      "time": " 4 August, 2005 - 10:12am",
      "content": "She wants to stay with the hourglass. I have uploaded under my original message a new version that I think works. I am open to new typefaces and would appreciate any suggestion. I am metting with the client Friday.\n\nThanks,\n\n"
    },
    {
      "time": " 4 August, 2005 - 1:41pm",
      "content": "Here is what I think I would do given the assignment and a short deadline … I like simpler solutions.\n\n[http://www.eyebytes.com/timedesign.gif](http://web.archive.org/web/20060522215749/http:/www.eyebytes.com/timedesign.gif)\n\n"
    },
    {
      "time": " 5 August, 2005 - 3:19am",
      "content": "My first impression was that you had added a scythe to the hourglass which brings a different meaning to Time Design. I think you need to work more with the illustration, maybe using a similar treatment as you have above for the frame. You might also look at making the rules heavier so they are more sympathetic to Rotis. The Ti could be tighter.\n\n<cite>Here is what I think I would do given the assignment and a short deadline … I like simpler solutions.<br>\nhttp://www.eyebytes.com/timedesign.gif</cite>  \nEben,  \nThere used to be a convention in these forums that those giving a crit on a design would only publish their own ideas if they had received an invitation to do so. You are obviously unaware of this, but I think you ought to ask permission of the poster before posting your own interpretations unless it actually assists in your crit. Although why anyone would want a dripping concierge is beyond me.  \nTim\n\n"
    },
    {
      "time": " 5 August, 2005 - 5:16am",
      "content": "Timid, I got your suggestions this morning, so I don’t have enough time to address the type before I submit my first layouts. I did work on the illustration before you said anything because the top bothered me like it did you. I have attached what I will be submitting to her today.\n\nEben, the thing that concerns me about your layout is that it wouldn’t look good at smaller sizes.\n\nI will continue to work on it after our meeting.\n\n"
    },
    {
      "time": " 5 August, 2005 - 6:17am",
      "content": "Tim, sorry for the mistype.\n\n"
    },
    {
      "time": " 5 August, 2005 - 6:21am",
      "content": "The bottom one looks the pick of the bunch to me, although the hourglass looks a bit top heavy, the new (amended) name is good too. Hope the presentation goes well.  \nTim\n\n"
    },
    {
      "time": " 5 August, 2005 - 6:23am",
      "content": "<cite>Tim, sorry for the mistype.</cite>  \nI’ve been called far worse :)\n\n"
    },
    {
      "time": " 5 August, 2005 - 8:41am",
      "content": "I have added 1 more version with color at my original post called FINAL. This is what I showed the client. She loved it!\n\nIf anyone has advice on tweeking the type, please let me know. Thanks for all the help you all have given!\n\n"
    },
    {
      "time": " 6 August, 2005 - 12:43am",
      "content": "\\>would only publish their own ideas if they had received an invitation to do so.\n\nTMID - ( Tim ): What are you talking about? People often express visual ideas visually here on the form. Sometimes it’s the only quick way to explain something. Wrong side of the bed today or something?\n\nAnd what do you mean by ‘publish’ thats a strange word to use. Maybe your meaning is hooked up in that. It’s not like I tried to contact this guys client or did something unethical here…\n\nObviously, if an idea is not useful to the person who started the thread they can ignore it. - no biggie.\n\n\\> Smaller sizes\n\nMaybe so. It’s a quick & rough… I’m not sure I see what you mean. Would you elaborate? Congradulations on your result!\n\n"
    },
    {
      "time": " 6 August, 2005 - 1:13am",
      "content": "Eben,  \nI was pointing out a convention that has existed for several years on these forums, particularly the critique forum. I was not attacking you or implying that you behaved unethically, this convention was created because some posters did not appreciate uninvited amendments to their designs published (making a point of view generally known).  \nI accept and agree that it is sometimes a useful way to express your comments, however you should ask the thread poster before publishing (that word again). I don’t want to put you off posting, I wrote that part of that post so that you would be aware of the convention and so that you didn’t discourage others from posting, and I am certain that everyone has enough imagination to understand the concepts behind your post if they had been published in written form, which might be more useful than a quick & rough sketch.  \nApologies to Greg for hijacking the thread.  \nTim\n\n"
    },
    {
      "time": " 6 August, 2005 - 10:38am",
      "content": "Having been on this critique area for about 6 months ( or so ) I have not observed the kind of permission you describe being ask for or given. I have just seen people who come on have an idea & solicit for opinions. Sometimes ( mostly ) the opinions are written. Sometimes ( less commonly) an idea is expressed with an image. Sometime people find the ideas ( written or otherwise ) useful and say so - sometimes they are ignored. Sometimes there is a stupid flame war.\n\nSo far folks have either been happy with or ignored what I have to say - or show. It’s been kinda fab.\n\nI have never seen an objection to images being linked to - until now.\n\nBTW - Are you making a distiction between referencing an image that you didn’t make & one that you made? This idea of yours is so vague so far…\n\nBut my bottom line is you are suggesting a convention exists that I have never seen. Maybe you’r right about this - but so far I don’t see any evidence.\n\nWhen you used the word ‘publish’ I thought maybe you meant something specific by it. May I assume for now that you just mean showing the folks a visual idea on typophile on a thread started by someone other than yourself? Or do you mean even linking to a photo of a sign for instance?\n\n\\> so that you didn’t discourage others from posting,\n\nI can’t figure out what you mean by this. I know you are trying to clarify this idea of yours but so far I am afraid I find it as opaque as ever. Do you think people would be so put off by am image link that they would fail to come & ask for an opinion? Really?\n\n\\> everyone has enough imagination to understand the concepts behind your post if they had been published in written form\n\nThats a big assertion. I don’t buy it. First of all ‘Everyone’? You have to admit that’s going a bit far. Everyone is too big. Some people are imaginatuion challenged. Thats why there are designers. And that is why we show clients proofs - so they don’t have to imagine using just words.\n\nSecondly, every medium has it’s strengths and words are powerful to be sure - but they don’t & can’t do the same job as an image. That’s why we have images. Maybe my specific ideas were simple & stupid enough to have been expressed in words - you could have just said that instead of evoking ‘everyone’.\n\n\\> Apologies to Greg for hijacking the thread.\n\nMe too.\n\nGreg, did you in fact feel injured by my post in some way? If you did I’d like to know. If you did feel irked I hope you know I had no intention of irking you.\n\nTim, why don’t you start a thread where you can explain this so far strange point of etiquette. That way we can have this conversation properly & in the right place. And if your point is bourne out then you will have served typophile well & helped me too. However as of now, your idea appears to me to be not a convention to defend, but an uneforceable and incomprehensable innovation - so I think the onus\\* is on you.\n\n\\* [http://dictionary.reference.com/wordoftheday/archive/2002/09/12.html](http://web.archive.org/web/20060522215749/http:/dictionary.reference.com/wordoftheday/archive/2002/09/12.html)\n\nStart your thread!\n\n"
    },
    {
      "time": " 6 August, 2005 - 12:02pm",
      "content": "Eben,\n\nI agree with Tim. I’ve read posts here on Typophile for couple of years and I was aware of the convention and I’ve seen it discussed several times. I’ll see if I can find some links.\n\nWhen you comment on (e.g.) logos and suggest improvements using words the designer is free to implement them any way they want, but when they’re shown an image of an improved logo they might not be comfortable adopting that approach since it’s somebody else’s idea, and they’d feel like it didn’t belong to them any longer. So in a way, you might be robbing them of an avenue they might have travelled down on, if they could’ve done most of the legwork themselves.\n\nThis is just how I feel. So it might be a good idea to ask for permission first… and I’m in no way admonishing you (at all) since you weren’t aware of the convention and were just trying to help.\n\n"
    },
    {
      "time": " 6 August, 2005 - 12:21pm",
      "content": "Here’s one [typophile post](http://web.archive.org/web/20060522215749/http:/64.233.179.104/search?q=cache:MHtaOCZRpB8J:www.typophile.com/cgibin/discus.pl%3Fpg%3Dprev%26topic%3D29%26page%3D26543+%2B) from last year where it’s discussed. There’s more, but it’s a pretty abstract concept to search for.\n\n"
    },
    {
      "time": " 6 August, 2005 - 12:30pm",
      "content": "Eben,  \nI have accepted your invitation to start a thread on the subject of etiquette [here](http://web.archive.org/web/20060522215749/http:/typophile.com/node/14424), I will take this opportunity to repeat that I was in no way attacking or insulting you, I was pointing out that a convention, which you were not aware of, existed, I am sorry if you felt otherwise. I have tried to make the reasons behind this convention plain and failed, perhaps the new thread will.  \nTim\n\n"
    },
    {
      "time": " 6 August, 2005 - 12:57pm",
      "content": "Tim & Lauri - Thanks!\n\nI will take up the thread there and see if I can understand your ideas. I think we want the same thing anyway - a better typophile & better interactions on it.\n\n"
    }
  ]
}
