{
  "id": "14163",
  "title": "mini printed type",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "neither having a typometer nor a printer with me at the moment,  \ni am wondering if anyone could tell me the minimal legible size for printed  \nserif fonts and sansserif fonts. i know that it really depends on the typeface,  \nand it is extremely relative, but i need to put copyright (all rights reserved ......)  \ninfo on a CD design (onto the actual CD - using AG Book Rounded, either Regular or Medium) and want  \nit to be tiny but still legible..... is 2 points too small? maybe 3 points?\n\nthx!!\n\n [‹ You may navigate this site without clicking!](http://web.archive.org/web/20071224095013/http:/www.typophile.com/node/14060 \"Go to previous forum topic\") [Type in the Koran ›](http://web.archive.org/web/20071224095013/http:/www.typophile.com/node/13590 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071224095013/http://www.typophile.com/user/3434\" title=\"View user profile.\">elastik</a>",
  "time": "<br>",
  "uid": "3434",
  "comments": [
    {
      "time": " 26.Jul.2005 3.47pm",
      "content": "i would say both are too small, especially given your typeface choice. i’d say minimum is 4 or even 5 pts.\n\n"
    },
    {
      "time": " 26.Jul.2005 3.59pm",
      "content": "[http://www.tdc.org/news/2005Results/Minuscule.html](http://web.archive.org/web/20071224095013/http:/www.tdc.org/news/2005Results/Minuscule.html \"http://www.tdc.org/news/2005Results/Minuscule.html\")\n\nhhp\n\n"
    },
    {
      "time": " 26.Jul.2005 4.19pm",
      "content": "The smallest I’ve ever printed on a cd face has been 6 pt Franklin Gothic. I think the limit is probably around 5 pt, I would be really nervous about going any smaller than that. From my experience, this is small enough if you put the copyright information around the outside rim.  \nA serif font would need to be printed a little bigger because the thins tend to fill in. If you’re knocking the text out it also needs to be bigger because of the ink spread.\n\n"
    },
    {
      "time": " 27.Jul.2005 4.27am",
      "content": "Minuscule. It’s still legible in 3pt size due to the designer’s awareness on inkspread and legibility issues. I’ve seen printed samples, i.e. Thomas Huot-Marchand has put together all 30-something pages of “Physiologie de la lecture et de l’ecriture” by Emile Javal on one DIN A4 sheet.  \nMinuscule is still being fine tuned afaik. It will be available “at the end of summer” at [http://www.256tm.com/](http://web.archive.org/web/20071224095013/http:/www.256tm.com/)  \nA sample of the 2pt “Minuscule deux” (or was that the 3pt? correct me if I am wrong) can be found [here](http://web.archive.org/web/20071224095013/http:/www.themicrofoundry.com/other/Javal_b.gif).\n\n"
    },
    {
      "time": " 27.Jul.2005 6.13am",
      "content": "I have a cd on my desk that has 5pt Helvetica Roman reversed out of black which is just readable but it is not very reader-friendly and my copy of Illustrator 9 has what looks like 4pt in a condensed sans which is surprisingly good. I suppose the primary questions are how many colours you are printing, what print process you are using and what surface the cd has in the first place.  \nTim\n\n"
    },
    {
      "time": " 27.Jul.2005 7.52am",
      "content": "wow! that miniscule is wild! i’d be interested to see it in actual application.\n\n"
    },
    {
      "time": " 27.Jul.2005 8.12am",
      "content": "Ok so what you are all proving to me is that I need to get my eyes checked. :^P\n\nChris Burke’s [Celeste Small Text](http://web.archive.org/web/20071224095013/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=FF.11068.0.0) does work very well quite small.\n\n"
    },
    {
      "time": " 27.Jul.2005 8.47am",
      "content": "For AG Buch Rounded, don’t go below 4 pt, all caps.  \nAnd use the Medium, not the Regular.\n\n"
    },
    {
      "time": " 27.Jul.2005 12.44pm",
      "content": "Stephan:  \n1) “Physiologie de la lecture et de l’ecriture” is about 300 pages.  \n2) Just to be clear: that sample on my site is by Javal, not Thomas.\n\nBTW, I feel that below of certain point size it’s better to use all-caps (for a “conventional” typeface).\n\nhhp\n\n"
    },
    {
      "time": " 27.Jul.2005 1.49pm",
      "content": "As far as i know, CD’s are still printed using screen-printing processes, which in my past experience means relatively low resolution and lots of choking and bleeding. I would suggest  \nconverting the final type to paths and make mods to compensate, ie. ink traps and opening the counters a bit.\n\n"
    },
    {
      "time": " 27.Jul.2005 2.30pm",
      "content": "I’m sorry but you have a legal problem. If you set the copyright information below a certain point size then its considered deception and illeagal. Consult your companies attorney.\n\n"
    },
    {
      "time": " 27.Jul.2005 2.35pm",
      "content": "Hmmm. What is the legal definition of point size? Sheesh.\n\nhhp\n\n"
    },
    {
      "time": " 27.Jul.2005 3.48pm",
      "content": "hrant you can’t decive the public, there are minimum sizes to present to the end user. Yes there are leagal minumum point sizes. I’m sure you can understand this as an issue.\n\n"
    },
    {
      "time": " 27.Jul.2005 7.43pm",
      "content": "\\> there are leagal minumum point sizes.\n\nI’m not saying there aren’t. But they can only mean something if “point size” is defined. Is the “point size” that number you choose in an application? Because you must understand that that has no real bearing on the actual size of the text that comes out... That’s the problem I was alluding to.\n\nhhp\n\n"
    }
  ]
}
