{
  "id": "14169",
  "title": "Check out my new portfolio site - has some hebrew typography!",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello all!\n\nMy name is Yotam, and im a 4th year student at the Bezalel academy, Jerusalem.  \ni just finished my portfolio site \\>\\> [www.yotamhadar.com](http://web.archive.org/web/20071009211605/http:/www.yotamhadar.com/)\n\nthe site has some typo works, graphic design, illustration, and motion graphics.  \ni’d love to know what you guys thing about the site, the works, the presentation, anything really.\n\nand just a reminder because this came up a couple of times - hebrew is written right-to-left :P\n\nthanks in advance  \nYotam\n\n [‹ Master Degree Type Suggestions](http://web.archive.org/web/20071009211605/http:/typophile.com/node/14205 \"Go to previous forum topic\") [What San Serif Works Well with Century? ›](http://web.archive.org/web/20071009211605/http:/typophile.com/node/14370 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071009211605/http://typophile.com/user/3259\" title=\"View user profile.\">Yotam</a>",
  "time": "<br>",
  "uid": "3259",
  "comments": [
    {
      "time": " 27.Jul.2005 8.08pm",
      "content": "You have some interesting work there! I think that you work deserves a better laid out site than just stacking things all on one page, though :)\n\n"
    },
    {
      "time": " 29.Jul.2005 9.49pm",
      "content": "This looks pretty cool. I especially liked the Galvanized Tin one.  \nAnd if you start a thread for Slorca, that might be interesting.\n\nhhp\n\n"
    },
    {
      "time": " 30.Jul.2005 1.52pm",
      "content": "looks fresh, like your line drawings and photos too!\n\nTheres a peice in there with chinese wordings, what inspired that and the purpose?\n\n"
    },
    {
      "time": " 1.Aug.2005 2.30pm",
      "content": "A lot of very nice work. I like the ’lechem eretz’, which retains its readability even with the elegant swashy design.\n\nThe ’Chinese’ sign looks fake and awkward because the stuff in the center violates the rules of how Chinese characters have to be formed.\n\nYour effort at reversal of weight for Hebrew characters in Slorca doesn’t work for me. But my Hebrew is poor and I am not used to reading it, so I am probably not a good judge. To me the Hebrew font ’Erica’ does pull off such a reversal (but only a slight one) very well, if I remember rightly. If you were doing a cross of horizontal and vertical strokes in a Roman cap, you would if anything thin the horizontal near the intersection, as Albertus does. Here thickening the horizontal looks awkward to me. But as I say, I am not looking with eyes thoroughly accustomed to Hebrew, so I may be off in this comment.\n\n"
    },
    {
      "time": " 4.Aug.2005 3.39pm",
      "content": "Thank you all for your replies and comments,\n\n\\* I really should start a thread for Slorca. i’d be very interested to hear what people around here have to say about it. I think I need to find the time to give it a few more sessions, at least to have a full set of the alphabet, and then i’d post it. now the problem is finding the time for that...\n\n\\* about the chinese print - actually korean.  \nit was actually a technical study of the screenprinting process - i didnt design this piece, i just scanned an old korean balm or something and traced it, every line, ornament and letter is the way it was on the original tag. maybe i should write it next to the print.\n\nThanks again for your comments, Feel free to contact me or post further replies\n\n"
    }
  ]
}
