{
  "id": "14185",
  "title": "Thoughts on new NHL logo",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi folks,\n\nNHL hockey will be back this fall after a year off due to labour problems. With the announcement of a new CBA came the announcement of a new logo. The old NHL logo is on the left, the new one is on the right. Personally, I think the change makes the sheild look a little more trendy but does not really change the fact that it does a bad job at portraying hockey. This redesign will likeley lead to another redesign soon as I think the new one will get stale more quickly than the old one.\n\nThoughts?\n\n| Attachment | Size |\n| --- | --- |\n| [nhlshields.gif](http://web.archive.org/web/20120428180600/http:/typophile.com/files/nhlshields.gif) | 3.99 KB |\n\n",
  "author": "dlabrosse",
  "time": "27 Jul 2005 — 12:55pm",
  "uid": "1274",
  "comments": [
    {
      "time": "27 Jul 2005 — 1:54pm",
      "content": "At least the 'NHL' acronym is headed in an upward direcion.\n\n"
    },
    {
      "time": "27 Jul 2005 — 2:36pm",
      "content": "If I got the job, with the brief to \"maintain tradition but look forward\" (I'm guessing, but what else could it possibly say?), this would be an obvious option: make the slant orthodox, and add some dimensionalization. But of course, I'm sure the designers racked their brains to come up with a lot of other good stuff that couldn't compete with the rightness of this.\n\n"
    },
    {
      "time": "27 Jul 2005 — 2:40pm",
      "content": "I hate the new logo. It looks like all logos created on a computer, gimicy and not well thought-out. Its just a retread. What they need to do is hire a designer like Mark Simonson to really think what the direction of the NHL should be and create a custom mark.\n\n"
    },
    {
      "time": "27 Jul 2005 — 2:55pm",
      "content": "Dan, they wanted a retread.  \nJust be thankful it still looks like the original.  \nGotta be synchronous with those awesome original six logos and uniforms!\n\n"
    },
    {
      "time": "27 Jul 2005 — 3:10pm",
      "content": "Nick you should redesign the NHL logo. At least you would make it more interesting. Its boring!\n\n"
    },
    {
      "time": "27 Jul 2005 — 5:39pm",
      "content": "I agree. It lack the appeal of an old looking logo & has none of the sanzzyness of a new one. Not that sport team logos are any guide either - they universally bite - the ones I have seen re-done in the last 10 years.\n\n"
    },
    {
      "time": "28 Jul 2005 — 5:39am",
      "content": "How about a jock strap with NHL on it and the \"L\" becomes a hockey stick:-) Ahhh, slap-stick comedy at its best:-)\n\nChrisL\n\n"
    },
    {
      "time": "28 Jul 2005 — 6:15am",
      "content": "Does anyone care any more? After last year's nonseason, at least they ought to add a tagline, like \"We're only in it for the money.\"\n\nOr maybe just \"Hey, fans: puck you.\"\n\n"
    },
    {
      "time": "28 Jul 2005 — 8:09am",
      "content": "I'm inclined to think that the players are a scapegoat, and the real action is in building stadiums.\n\n"
    },
    {
      "time": "28 Jul 2005 — 8:45am",
      "content": "Like most modern industry, the employees are always the scapegoat.\n\nThe new logo is fine, IMHO. Looks like the old one with a bit more modern style. Seems to target their core audience just fine (remember when 'classic' uniforms were brought back out...pro sports fans are huge nostalgia buffs and change isn't usually a good thing)\n\n"
    },
    {
      "time": "28 Jul 2005 — 12:12pm",
      "content": "\". . .Looks like the old one with a bit more modern style. …pro sports fans are huge nostalgia buffs and change isn’t usually a good thing)\"\n\nThen why change it at all? There is no value added with this redesign. It costs to replace all the old logos and is only worth it if there is some benefit to be found. (At least the designer got a few bucks out of it.)\n\nChrisL\n\n"
    },
    {
      "time": "28 Jul 2005 — 1:10pm",
      "content": "This is definitely \"better\".\n\nThe typography is much more solid, the slant is, as Nick said, \"more orthodox\".\n\nWhat is represented here is a \"dimensional\" version of the logo set beside the \"non-dimensional/flat\" version of the previous. The previous had a \"dimensional\" version as well. It might be more appropriate to compare apples to apples (forgive the metaphor).\n\nThis said, if we were to compare the solid color/flat versions of both, how could you deny that this is an improvement?\n\nThere is a lot more to consider than the pure aesthetics of the mark. This is where a lot of the \"critique\" conversations go awry. We fail to consider the \"big picture\". Does the brief dictate \"improvements\" of the previous mark? I would think yes. If so, how far away from its predecessor can you afford to stray? Among MANY other things we must consider the brand equity invested in the previous mark.\n\nIf I was to \"assume\" the brief stated what I think it may have, I would consider this a success. It speaks to its market and it is defiantly a typographic improvement. The addition of the serifs adds a more aggressive and forward motion feeling to the mark.\n\nI won't say that I like the aesthetical direction ANY of the major sporting (US considered) identities take, BUT considering the market by which they are being consumed -- I believe them to be appropriate. I could go into a lengthy stereotyping of how I view American sports fans, but that would take all day.\n\nI also won't say I endorse the idea of \"needing a redesign\" for the NHL -- but that is not the debate here.\n\nIf I were to look at the previous mark, I think that the typographic changes and the change of slant made to the new mark, while leaving the colors and shape of the original, would have been a \"more appropriate\" way of proceeding.\n\nIn conclusion I say it is a positive move. Was it necessary? I don't think so.\n\n"
    },
    {
      "time": "28 Jul 2005 — 1:58pm",
      "content": "I bet the reason behind the redesign is sports marketing. Get your jersey, water bottle etc. with the \"New\" NHL logo. Its all about revenue streams.\n\n"
    },
    {
      "time": "28 Jul 2005 — 2:44pm",
      "content": "\"Get your jersey, water bottle etc. with the “New” NHL logo.\"\n\nI think Dan has hit the nail right on the head!\n\n\\>  \n\"There is a lot more to consider than the pure aesthetics of the mark. This is where a lot of the “critique” conversations go awry.\"\n\nKyle, I was not intending any aesthetic judgement whatsoever. I find nothing aethetically appealing about either mark. I was just saying that if the audience was anti-change, why spend the money to rebrand? Dan has answered that question perfectly. As they say in the sports biz, \"Show me the money.\"\n\nChrisL\n\n"
    },
    {
      "time": "28 Jul 2005 — 2:52pm",
      "content": "_Then why change it at all?_\n\nHmm...maybe I'll rephrase.\n\nDrastic change = sports fans no like  \nSubtle change = sports fans only notice enough to realize they need to now buy new merchandise.\n\nAlso, let's not forget that 'NHL' is really a secondary mark to the individual team logos most of the time.\n\n"
    },
    {
      "time": "28 Jul 2005 — 2:52pm",
      "content": "Oops...posted before reading what Dan said.\n\nSo, yea, what Dan said. ;o)\n\n"
    },
    {
      "time": "28 Jul 2005 — 2:57pm",
      "content": "I concure with the previos statements, too.  \nThats what I was hinting at when mentioning the \"big picture\".\n\n"
    },
    {
      "time": "28 Jul 2005 — 3:58pm",
      "content": "Actually, the backward slant of the original is more interesting.  \nPerhaps it has some heraldic significance.  \nHeraldry -- now there's a venerable form of design that not a lot of people go in for these days. Heraldry 101 as part of your design studies, anyone?  \nCould be big in cross media, say, tattooing.\n\n"
    },
    {
      "time": "28 Jul 2005 — 8:00pm",
      "content": "It looks more like a 'fix' to me, than really a 'new' logo. On the topic, has anyone seen this? In an attempt to make Indy car racing a 'sport' they've adopted the red/white/blue slant composition... Just check it out. Funny as ...well, racing!\n\n[http://www.openwheelracing.com/images/logos/IndyCar\\_Series\\_Logo\\_-\\_1-20-0...](http://web.archive.org/web/20120428180600/http:/www.openwheelracing.com/images/logos/IndyCar_Series_Logo_-_1-20-05.JPG \"http://www.openwheelracing.com/images/logos/IndyCar\\_Series\\_Logo\\_-\\_1-20-05.JPG\")\n\n"
    },
    {
      "time": "28 Jul 2005 — 10:15pm",
      "content": "Well, considering you are talking to a huge F1 fan right here, you might not want to bring up the \"racing is not a sport\" talk. ;) -- of course, Indy is not F1. But that logo, now thats not right.\n\n"
    },
    {
      "time": "29 Jul 2005 — 12:57am",
      "content": "That logo ( Indy ) made me laugh. It's ridiculous! Whose cousin did that one?\n\nI'm with nick. The old NHL was cooler. The reverse angle was always a bit out of whack but then so was the NHL. I think they could have made way MORE money if they had signed up somebody who does retro style really well to have enhanced the old feeling. Then it would have felt like something was really happening maybe. Instead we all just go on speculating on the money. Look at oriole stadium. Did they do it to make money? Sure! But it's NICE. Fans are loyal to the stadium as much as to the Orioles. Logos can be the same way. They can inspire. Not this one though.\n\n"
    },
    {
      "time": "29 Jul 2005 — 1:49am",
      "content": "I say bring back the orange and black! I don't care for the reflective texture of the new one...however i bet it will look great in the video game...\n\n"
    },
    {
      "time": "29 Jul 2005 — 2:30am",
      "content": "I like the new update. It's appropriate and the letterforms are much improved. The L is much less awkward with the tighter angle, than the forced open one in the old logo. Also the weight of the letters are improved and the serifs are nice.\n\nIf they're going with traditional heraldic symbols, they've gone from a \"bend\" (the diagonal band from top left to bottom right) to a \"bend sinister\" (bottom left to top right) which is \"occasionally used as a mark of illigitimacy.\"\n\nThat is, according to this:  \n [http://www.houseofnames.com/xq/asp/sId./kbId.10/title.Ordinaries+of+Hera...](http://web.archive.org/web/20120428180600/http:/www.houseofnames.com/xq/asp/sId./kbId.10/title.Ordinaries+of+Heraldry/qx/knowledgebase.htm \"http://www.houseofnames.com/xq/asp/sId./kbId.10/title.Ordinaries+of+Heraldry/qx/knowledgebase.htm\")\n\n"
    },
    {
      "time": "29 Jul 2005 — 5:59am",
      "content": "Indy logo: blood on the track.\n\n"
    },
    {
      "time": "29 Jul 2005 — 7:04am",
      "content": "This is interesting -- To me it seems as though they've ditched the old logo just as its look (2-3 colour screen-printey) is becomming relevant again. Although i would personally side with Eben in that maybe a tasteful retro redesign may have been better, the new logo is probably more consistent and appropriate for the hockey crowd.\n\nOne thing that hasn't been mentioned is that the diagonal lines and the slant of the lettering in the old logo really evokes a shaft-of-the-hockey-stick feel for me, where the new one does not.\n\nok, back to lurking for me.\n\n"
    },
    {
      "time": "29 Jul 2005 — 7:08am",
      "content": "Nick,  \nWas that a body check or were you just sticking it to them?  \n:-)  \nChrisL\n\n"
    },
    {
      "time": "29 Jul 2005 — 7:54am",
      "content": "What? Is this a political left vs. right thing? The new logo looks like it could be a emblem on the front of Batman's sporty little weekend convertible.\n\nJeff Fisher :: Engineer of Creative Identity  \n [Jeff Fisher LogoMotives](http://web.archive.org/web/20120428180600/http:/tinyurl.com/5y8bm)\n\nAuthor: [Savvy Designer's Guide to Success](http://web.archive.org/web/20120428180600/http:/tinyurl.com/5o7ud) from HOW Design Books\n\n"
    },
    {
      "time": "29 Jul 2005 — 8:31am",
      "content": "\\> It’s appropriate and the letterforms are much improved\n\nthe typography may be improved but that not everything in a logo - just an aspect ( shreiks heard ) :-p\n\nAppropriate? Do you mean it has continuity? Or something else?\n\n"
    },
    {
      "time": "29 Jul 2005 — 10:24am",
      "content": "\\>Was that a body check or were you just sticking it to them?\n\nI used to give my son a 2-minute penalty (stand in the corner) for bad behavior.  \nHe understood.\n\n"
    },
    {
      "time": "29 Jul 2005 — 11:17pm",
      "content": "That's all I meant by appropriate - it's true to what it was, but gives a relevant update while cleaning up the type. I might have pushed to keep the orange, but whatever. The downside with the black and white is that it looks a lot like the Oakland Raiders (which is less than a mile from me. =)\n\nOakland Raiders: [http://images.google.com/images?q=oakland%20raiders&hl=en&lr=&client=saf...](http://web.archive.org/web/20120428180600/http:/images.google.com/images?q=oakland%20raiders&hl=en&lr=&client=safari&rls=en&sa=N&tab=wi \"http://images.google.com/images?q=oakland%20raiders&hl=en&lr=&client=safari&rls=en&sa=N&tab=wi\")\n\n"
    },
    {
      "time": "29 Jul 2005 — 11:18pm",
      "content": "Do you ever tell your son to go \"upstairs with the peanut butter?\"\n\n=)\n\n"
    },
    {
      "time": "30 Jul 2005 — 12:36am",
      "content": "When did the Raiders buy NHL?\n\n"
    },
    {
      "time": "30 Jul 2005 — 12:49am",
      "content": "Yeah, it's too close to the Raiders. =/\n\nFor those wondering, 'upstairs with the peanut butter,' if i'm not mistaken, means the puck is on top of the goal. =)\n\n"
    },
    {
      "time": "30 Jul 2005 — 12:57pm",
      "content": "We should have given Parson's auditorium a penalty for iceing :-)\n\nChrisL\n\n"
    }
  ]
}
