{
  "id": "14187",
  "title": "Why would anyone pay for an expensive licence?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I have been busy recently with trying to find out what goes in the market of Custom Typefaces. A collegue asked me to make a typeface for him from his logo. So he wants a price from me.  \nIt's not easy to find out what reasonable prices are for creating custom fonts. And then the licences. Does the client want it exclusive, and if yes, for how long. There seem to be different licences for magazines, corporate material, websites, etc. etc.\n\nThe question I hear very often is; \"Why should we pay for an expensive licence when I can just buy the font for 40 dollars?\"  \nGraphic designers buy more often single fonts or families. They very often use them for different projects, not just the one they bought it for. If they decide to use later on it in a magazine they go \"why not, I bought it already\".\n\nMy question is; should they contact the licencor to discuss the licence for using this particular font in a magazine? Or can they just use it?\n\nCan anyone shed some light on this?\n\nThnx,  \n®ené\n\n**Also tired of Helvetica?** Get an **[Insider](http://web.archive.org/web/20131014055731/http:/www.characters.nl/)** with more personality\n\n\\*\\*\\* [Characters](http://web.archive.org/web/20131014055731/http:/www.characters.nl/) { Typography to express yourself } \\*\\*\\*\n\n",
  "author": "Rene Verkaart",
  "time": "27 Jul 2005 — 3:39pm",
  "uid": "1946",
  "comments": [
    {
      "time": "27 Jul 2005 — 10:26pm",
      "content": "In most cases, once a designer licenses a font, he can use it for any project he wants. What foundries are most concerned about is how many machines the font is being used from, not how many copies of a product will be produced.\n\nWith Myriad, or almost any other big name font, you can either design a logo, so set text in a book that will be sold 10 million times. Doesn't matter.\n\nBut, you are of course free to stipulate other conditions in your EULA. If you want to charge an extra licensing fee for certain projects and/or print runs, go for it. But you may need to come up with a good marketing concept to explain your reasoning to designers…\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20131014055731/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "29 Jul 2005 — 9:20am",
      "content": "_The question I hear very often is; “Why should we pay for an expensive licence when I can just buy the font for 40 dollars?”_\n\nThe answer is, \"So can thousands of people. If you want exclusive, you have to pay for it.\"\n\n"
    },
    {
      "time": "29 Jul 2005 — 9:32am",
      "content": "If the license were to include exclusivity for a certain amount of time, of course, $40 isn't enough to pay for that. However, if a foundry were to shoot themselves in the foot and not allow the basic EULA licensee to include use in a book without paying extra for a fee, the foundry deserves what they get. Which I would think would be fewer/no licenses purchased. And I'm talking printed book, not PDF book for resell, I can understand, perhaps, additional fees for that as well.\n\nOr am I misunderstanding.\n\n"
    },
    {
      "time": "29 Jul 2005 — 10:15am",
      "content": "Careful what you compare: An Ad agency that wants to distribute a font to 300 designers worldwide isn't paying $40. They need to pay for a license for each workstation, and that amount grows if they add workstations. Though most foundries offer quantity discounts, agencies routinely discover the cost effectiveness of custom type, especially if they will have it exclusive from its inception. Custom type allows them to own the font (forever, or just for a few years), without any additional cost in licenses.\n\nThe gray area being introduced by embedding issues has got a lot of people thinking that fonts are like repro art. When you sell a font, as long as the license is agreed on and paid, typically the foundry can't tell the licensor what to do with the font. How would that be policed? In every other type format, once you got the font (discs, strips, matrices, etc) into your shop, you could use it for as much or as little as you want. This may be repetitive, but printed copies of a document are not equivalent to digital copies of a font. When a magazine uses a font, they have a license to use it every month, for everything, big and small.... If they choose to use it for headings on 4 pages, that doesn't make it cheaper for them. It's like a chair: put plastic on it and forbid anyone from sitting in it, or use it every day for decades. You're paying for rights, not actual uses. I can't tell the La-Z-Boy slaesman I should pay less because I'll only be putting plastic on it and looking at it.\n\n"
    },
    {
      "time": "29 Jul 2005 — 12:21pm",
      "content": "I see it the same, but I think the biggest problem is verification. How can a foundry check whether the purchaser is telling the truth? If you licence a font for a magazine you know that that isn't done on one workstation. But would you sue someone for that?  \nVery often the graphic designers descide what font to use. I've been in the business for 10 years now and I haven't heard any graphic designer talking about an expensive licence, simply because it's not worth it to the client. They expect all fonts are standard on the PC. Verdana will do just fine.\n\nI think the whole font licencing business is a gentleman's agreement. I wish there were more gentlemen so there were less font piracy.\n\nRegards,  \n®ené\n\n**Also tired of Helvetica?** Get an **[Insider](http://web.archive.org/web/20131014055731/http:/www.characters.nl/)** with more personality\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20131014055731/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": "29 Jul 2005 — 12:25pm",
      "content": "_I wish there were more gentlemen so there were less font piracy._\n\nAlso: no wars, less senseless death on the highways, and fewer lawyers.\n\n"
    },
    {
      "time": "29 Jul 2005 — 12:26pm",
      "content": "Another cool bumper sticker:  \n\"Kill the lawyers first.\"\n\nhhp\n\n"
    },
    {
      "time": "29 Jul 2005 — 12:31pm",
      "content": "_“Kill the lawyers first.”_\n\nIt oughta be good: it's paraphrased Shakespeare (_Richard III_).\n\n"
    },
    {
      "time": "29 Jul 2005 — 12:33pm",
      "content": "Hrant,\n\nI think you meant to post that to that other thread. Too bad the edit doesn't work at the moment, eh? :)\n\n"
    },
    {
      "time": "29 Jul 2005 — 12:34pm",
      "content": "If someone licenses a font from a foundry, and then installs it on 100 computers instead of five, I don't think that there is any way for a foundry to be able to know that yet.\n\nFoundries do tend to trust their customers, though. And very often, five-seat licenses are upgraded by larger businesses, who more often than not want to be legit in terms of computer licensing. I mean, I think that Microsoft does check large companies out. So, while going through the process of cleaning up their apps for an MS audit, I suppose that some businesses will get all of their ducks in oder, even though MS probably couldn't care less if anyone's Adobe fonts weren't properly licensed.\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20131014055731/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "29 Jul 2005 — 12:54pm",
      "content": "Lauri, oldnick actually mentioned the \"L\" word, but yes, I was on a roll from that other thread!\n\nBTW, editing **is** apparently available to moderators...  \nAs if we didn't mistrust them enough already. ;-)\n\nhhp\n\n"
    },
    {
      "time": "29 Jul 2005 — 11:33pm",
      "content": "Hrant,\n\nI noticed the connection after I posted, my mistake... and of course I couldn't edit it. But if you read all the posts on the forum you should be able to post wherever you want. Fight the power! :)\n\n"
    },
    {
      "time": "30 Jul 2005 — 1:30am",
      "content": "René, some in the industry would advocate licensing based on usage, but fonts are so cheap (compared to photography and illustration!) that it's too much hassle to manage licensing that way.\n\n[And one moderator correction. Editing is not enabled by moderators, except for the initial post that begins a thread. We're in the process of re-enabling editing since everybody's life is better if we can edit our foot out of our mouth. =)]\n\n"
    },
    {
      "time": "22 Aug 2005 — 7:44am",
      "content": "... Or fix our typos in text - or links that don't work!\n\n"
    },
    {
      "time": "22 Aug 2005 — 7:57am",
      "content": "Oh yeah, and what they said - exclusivity.\n\nAlso, for the exclusive font you could offer an unlimited user # in the license ( unlimited # of computers inside the company ). I don't know if that is typical. If you did do this then perhaps you can remind the company that at 1000+ users the license for a '$40.00 font' is way more that $40. Then you can go back and compare to your exclusive use + unlimited user size to indicate value.\n\njust an idea.\n\nWhat do you all think?\n\n"
    }
  ]
}
