{
  "id": "14204",
  "title": "Futura SC question",
  "forum": "Design",
  "tags": [

  ],
  "content": "Some time ago we bought the Bitstream Type Odyssey which contains a very nice **[Futura](http://web.archive.org/web/20080908024125/http:/typophile.com/wiki/Futura)** version. Unfortunatly it doesn’t come with SC&Osf. And [Bitstream](http://web.archive.org/web/20080908024125/http:/typophile.com/wiki/Bitstream) doesn’t provide them either. So I stumbled upon the **[Neufville](http://web.archive.org/web/20080908024125/http:/typophile.com/wiki/Neufville)** versions. But I wonna know if those versions play (formally) well together before I take out my Magic Plastic Card. Does anybody has any experience combining the two?\n\n [‹ Please help in my Baskerville dilemma!](http://web.archive.org/web/20080908024125/http:/typophile.com/node/14322 \"Go to previous forum topic\") [What should I pair with Gill? ›](http://web.archive.org/web/20080908024125/http:/typophile.com/node/14333 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080908024125/http://typophile.com/user/1361\" title=\"View user profile.\">lettertiep</a>",
  "time": "<br>",
  "uid": "1361",
  "comments": [
    {
      "time": " 28.Jul.2005 7.01am",
      "content": "not a direct answer, but if you’re open to replacing Futura right out, [Mark Simonson](http://web.archive.org/web/20080908024125/http:/typophile.com/wiki/Mark%252BSimonson)’s [Proxima Nova](http://web.archive.org/web/20080908024125/http:/www.ms-studio.com/FontSales/proximanova.html) has all the bells and whistles.\n\n"
    },
    {
      "time": " 28.Jul.2005 3.51pm",
      "content": "For technical reasons I would suggest buying the entire family, rather than just the SC version, then trying to pair with the other family. being that these have different metrics, I would assume that they would not look quite as good together. Although, I don’t have direct experience using them in this way.\n\n"
    },
    {
      "time": " 28.Jul.2005 3.59pm",
      "content": "forrest norvell (who’s gone missing of late) calls Neufville’s version “the most elegant version of the modern Futura.” in a review of futura versions, which you can read at [http://www.typomancy.org](http://web.archive.org/web/20080908024125/http:/www.typomancy.org/ \"http://www.typomancy.org\").\n\n"
    },
    {
      "time": " 29.Jul.2005 2.43am",
      "content": "I feel your pain but have to agree with Paul and Kyle... in the long run you’ll probably be happier with the family version - but it’s worth a try to see if the two will play nicely together.\n\n"
    },
    {
      "time": " 29.Jul.2005 7.18am",
      "content": "It’s tempting to buy the whole family, but my budget doesn’t allow me just yet. I’ll see what I can do with combining the 2.\n\n"
    },
    {
      "time": " 29.Jul.2005 8.32am",
      "content": "Futura, I find, looks very uncomfortable with too much old style usage. Also, Bitstream’s Futura, depending on how you are using it, can be finagled. If you use the right weights and alter the percentage to which you set the smallcaps. But, large but, one can only get away with this if used sparingly.\n\n"
    },
    {
      "time": " 29.Jul.2005 10.21am",
      "content": "In the interest of completeness, Berthold also has a “complete” Futura product (not mentioned in the typomancy article). Very nice, very complete, kind of expensive, but on par with the others.\n\n[http://www.bertholdtypes.com/home.html](http://web.archive.org/web/20080908024125/http:/www.bertholdtypes.com/home.html \"http://www.bertholdtypes.com/home.html\")\n\n"
    },
    {
      "time": " 29.Jul.2005 3.57pm",
      "content": "I didn’t post about the Berthold version because, well, sometimes it’s hard to find good information about Berthold types, for reasons that are documented elsewhere. At some point I may do a followup to that article where I can talk about that, as well as talk about some of the Futura-alikes out there, as well as give my own (sure to be popular) opinion on that eternal question: Futura or Neutraface?\n\nAnd yeah, I’ve been missing, first because of vacation, then because of computer “issues” (had to replace my laptop’s hard drive twice, had a bad backup that had to be worked around and which sort of required me to upgrade to Tiger, had to replace the motherboard and display, etc), then had to play catchup at work for a while, but now I’m back. I’m sure you’re all relieved.\n\n"
    },
    {
      "time": " 29.Jul.2005 4.53pm",
      "content": "welcome back forrest! and not that it’s a look alike, but have you seen Mark Simonson’s Proxima Nova? It was love at first sight for me and i’ve been raving about it since.\n\n"
    },
    {
      "time": " 6.Aug.2005 4.56pm",
      "content": "I checked out Proxima Nova, and while I like it, and it’s certainly geometric in some ways, it feels more like a humanist sans to me. It’s less rigid than Futura, and while I’m slowly getting tired of Futura’s rigidity, I think its “precision” or “tightness” are probably the sources of its appeal to most people. It’s definitely a more complete family than most of the easily available versions of Futura, though.\n\n"
    }
  ]
}
