{
  "id": "14245",
  "title": "Depot Update",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi all,  \nI posted [this](http://web.archive.org/web/20131013063920/http:/homepage.ntlworld.com/c.dickinson40/Type/2-DepotType.pdf) before. but I've made a few updates, so see what you think.  \nAny comments or suggestions?\n\n",
  "author": "coop",
  "time": "29 Jul 2005 — 12:08pm",
  "uid": "5642",
  "comments": [
    {
      "time": "16 Sep 2005 — 5:03am",
      "content": "To me, your link does'nt work.\n\n"
    },
    {
      "time": "4 Oct 2005 — 2:15pm",
      "content": "Sorry I wasn't getting any response and it was on a friends server. I've put it back up if anyone has any comments\n\n"
    },
    {
      "time": "4 Oct 2005 — 4:49pm",
      "content": "Overall, I like this typeface. I'd make some adjustments though.  \nNumber 4 looks smaller than other numbers.  \nThe «oblique» cut you use on some letters are not regular. I think it would be better if it was.\n\nThe lower k would have advantage to look like the K.  \nW : Middle join should be raise and horizontal  \na numeral has a too short lower tail.\n\n"
    },
    {
      "time": "5 Oct 2005 — 1:32am",
      "content": "Sim,\n\nThanks for your comments, I haven't worked on this for while so all feedback helps towards me finishing it. I'll post further updates\n\n"
    },
    {
      "time": "7 Oct 2005 — 10:18am",
      "content": "I wonder about if you should have a more narrow wW & M & lower the join given the rest of the design. Also - it looks like ytou have not worked on iterletter spacing yet. In a way it's hard to know about the forms without seeing at least a preliminary spacing/kerning. The space character should maybe be a bit wider - the words are running together a bit too much for me.\n\n"
    },
    {
      "time": "7 Oct 2005 — 10:26am",
      "content": "I always have problems with spacing and kerning, I haven't found a good system to getting correct spacing. Do you have any advise ?\n\n"
    },
    {
      "time": "7 Oct 2005 — 10:51am",
      "content": "Hmmm\n\nThere are a lot of posts on Typophile about this. And I am less expert than most of the folks here. By all means read up on what they say about this topic & process.\n\nBut if pressed I suppose I would have to say these kinds of things:\n\n1. Type shapes need to be bourne out of not just an idea of how they could be shaped but how they combine with other letters/numbers/punctuation (glyphs). The whole relationship is important & all the elements feedback on each other. This makes for a design process not unlike a hall of mirrors. This is true in general for all type - but it is \\*especially true\\* in a face that may be meant for text - which yours seems to be. Getting to the point where the shapes are designed in this way will probably take lots of time and maybe even several typeface designs.\n\n2. Before worrying about Kerning try to get as good a set of basic Spacing as you can. Learn which combinations are likely to give you trouble anyway and discount them for the purposes of initial spacing. An example is 'Av'. The spacing on this combination will need to be kerned later, but the spacing on Ao should not have to be kerned. Get that one right with basic Spacing. But search here on Typophile & on google. Remember, your forms will also dictate. Whatever rules you find, your own eye has to be the final judge.\n\n3. When you get the basic spacing right apply kerning to the special cases.\n\nTest the face & you may decide to alter your shapes, basic spacing or kerning - or all three.\n\nAnd then you go around & around again with this process until you think it's good.\n\nI like your shapes BTW.\n\n"
    },
    {
      "time": "8 Oct 2005 — 12:17am",
      "content": "The process I use at the moment is described in 'Letters of Credit, by Walter Tracy'. This involves spacing characters like oonnoo and oohhoo, then using the side bearing values for other characters with the same shapes, so the spacing for the left side of the lowercase 'c' would be the same as that for the lowercase 'o'. I had actually spent time spacing Depot, but I obviously need more practise.  \nI feel more confident with Kerning, but the spacing needs to be more complete, Depot does have Kerning at the moment, its proably not apparent as the spacing is incorrect.\n\n"
    }
  ]
}
