{
  "id": "14244",
  "title": "Interstate -vs- FHWA",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Yesterday I spent some more time than usual on the freeways, driving more casually than usual (so deliberative driving, not immersive :-) and something hit me\\*: I saw a “p” with its shear at the bottom in the opposite direction as Interstate. In know that Interstate is touted as a “cleaned-up” version of the FHWA design (with this particular difference striking me as chirographic in motivation - and actually less effective than the original) and now I’ve become quite interested in analysing the differences between the two. I think such analysis would expose interesting clues as to how a designer thinks. If TFJ himself would elaborate, that would of course rule.\n\n\\* I mean besides that loose bumper piece - damn thing knocked a fog light loose.\n\nhhp\n\n [‹ Where to buy decrotive boxes online?](http://web.archive.org/web/20080324121133/http:/typophile.com/node/43343 \"Go to previous forum topic\") [Learning Calligraphy ›](http://web.archive.org/web/20080324121133/http:/typophile.com/node/43269 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080324121133/http://typophile.com/user/1250\" title=\"View user profile.\">hrant</a>",
  "time": "<br>",
  "uid": "1250",
  "comments": [
    {
      "time": " 29.Jul.2005 1.55pm",
      "content": "Are you going to post some pictures of what it is that you have observed?\n\n"
    },
    {
      "time": " 29.Jul.2005 2.04pm",
      "content": "I don’t have pictures. But both Interstate and the FHWA stuff are easily viewable, no? Actually, where **is** a good place to see the latter?\n\nhhp\n\n"
    },
    {
      "time": " 29.Jul.2005 2.24pm",
      "content": "Standard Alphabets for Traffic Control Devices PDF: [http://mutcd.fhwa.dot.gov/SHSe/Alphabets.pdf](http://web.archive.org/web/20080324121133/http:/mutcd.fhwa.dot.gov/SHSe/Alphabets.pdf \"http://mutcd.fhwa.dot.gov/SHSe/Alphabets.pdf\")\n\nSee also Roadgeek fonts: [http://www.triskele.com/fonts/](http://web.archive.org/web/20080324121133/http:/www.triskele.com/fonts/ \"http://www.triskele.com/fonts/\")\n\n"
    },
    {
      "time": " 29.Jul.2005 2.49pm",
      "content": "FHWA could use some work I must say.  \nI know that Don Meeker and James Montalbano were trying to get the highway admin. to approve the “Clearview” typeface which they developed to solve the many problems that the current typeface (series-d) created. The last I heard about the project was over a year ago. I wonder what is going on with the approval process.\n\nI found a link  \n [http://www.clearviewhwy.com/](http://web.archive.org/web/20080324121133/http:/www.clearviewhwy.com/ \"http://www.clearviewhwy.com/\")\n\n-John\n\n"
    },
    {
      "time": " 30.Jul.2005 3.18am",
      "content": "A couple states are going ahead and using Clearview... both Pennsylvania and Texas are using Clearview on their new signs. From what I’ve seen, Texas is pulling it off better, despite the fact the new standards still call for FHWA Series C on route markers.\n\nThe first image here is a good example of how it’s being used:\n\n[http://www.lonestarroads.com/pr-022.html](http://web.archive.org/web/20080324121133/http:/www.lonestarroads.com/pr-022.html \"http://www.lonestarroads.com/pr-022.html\")\n\n"
    },
    {
      "time": " 30.Jul.2005 10.17am",
      "content": "Michigan is switching over to Clearview  \n [http://www.michiganhighways.org/route\\_markers\\_clearview.html](http://web.archive.org/web/20080324121133/http:/www.michiganhighways.org/route_markers_clearview.html \"http://www.michiganhighways.org/route\\_markers\\_clearview.html\")\n\nI also ran across an essay some kid wrote slamming clearview  \n [http://briantroutman.com/highways/clearview.html](http://web.archive.org/web/20080324121133/http:/briantroutman.com/highways/clearview.html \"http://briantroutman.com/highways/clearview.html\")  \nIt would be better if the author knew what he was talking about but the conclusion is too good not to link.\n\n“Clearview is very un-American; if it was any less American, it would be riding public transportation.”  \nrofl\n\n"
    },
    {
      "time": " 30.Jul.2005 10.24am",
      "content": "_any less American, it would be riding public transportation._\n\nHa! :o)\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080324121133/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 30.Jul.2005 10.43am",
      "content": "Don’t be treadin’ on my big white truck, gol’dangit!\n\nhhp\n\n"
    },
    {
      "time": " 30.Jul.2005 11.35am",
      "content": "Not that this has anything to do with the thread Hrant started but... Our Clearview design has been granted interum approval by FHWA for use on all federal roads. Texas, Pennsylvania, Michigan, Virginia have started using the fonts for various aspects of their transportation signage. There are a number of states that are poised to make the change to Clearview.\n\nThe fact that some kid slammed Clearview for being un-American only makes me happy.\n\n"
    },
    {
      "time": " 1.Aug.2005 1.41am",
      "content": "[http://briantroutman.com](http://web.archive.org/web/20080324121133/http:/briantroutman.com/ \"http://briantroutman.com\")\n\nyou’ve got to laugh, ’cause if you didn’t you’d cry...\n\nThis site makes me wish there was some kind of enforced quality control on the web (lol) :)\n\n"
    },
    {
      "time": " 2.Aug.2005 10.49am",
      "content": "Hrant, Interstate is far better than the actual FHWA. I believe I’ve even seen signs using the redraw instead of the official FHWA original.\n\nJames, I also wanted to tell you that I’ve been on quite a few roadtrips through Pennsylvania. Your typeface is VERY legible and one of the best uses of functional typography I have ever seen. You should really be proud of your work. Anyone on the road could not disagree with that.\n\n"
    },
    {
      "time": " 2.Aug.2005 10.58am",
      "content": "\\> Interstate is far better than the actual FHWA.\n\nI certainly agree, in the overall.  \nBut I’m wondering about the micro stuff, bascially  \nhow/why it’s better (or let’s jusy say different).\n\nhhp\n\n"
    },
    {
      "time": " 19.Mar.2008 1.49am",
      "content": "Is it possible that the “p” that sparked this whole thread was in fact a “q” applied backwards? I’ve seen a sign that used an upside down “m” instead of a “w”. Anyway, all the sheared stems in FHWA are cut southwest-to-northeast. Does Interstate do that differently with some letters?\n\nBy the way, I also like the new Clearview fonts for the most part; I’m not so enthusiastic about the numerals, however. I thought the FHWA numerals were quite effective, and some of the Clearview numerals look too much alike — specifically, the free strokes of the 6 and 9 curve back towards the loops more than in FHWA, making them less distinct from 8. I also miss the inflection in the middle of the curved stroke of the 2, but that may be more a matter of personal taste than function.\n\nDoes this font make me look fat?\n\n"
    }
  ]
}
