{
  "id": "14263",
  "title": "Differences between Windows XP versions?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m in the throws of getting a new Windows machine as a second computer. What is the difference between XP Home Edition and XP Professional Edition? I have a small network at home linking two, maybe three computers and one printer. Nothing special, really…\n\n [‹ Typophile broken links](http://web.archive.org/web/20080204005144/http:/typophile.com/node/14363 \"Go to previous forum topic\") [FontLab 4.6 -- Creating Variants ›](http://web.archive.org/web/20080204005144/http:/typophile.com/node/14358 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080204005144/http://typophile.com/user/1085\" title=\"View user profile.\">dan_reynolds</a>",
  "time": "<br>",
  "uid": "1085",
  "comments": [
    {
      "time": " 30.Jul.2005 10.24am",
      "content": "[http://www.microsoft.com/windowsxp/pro/howtobuy/choosing2.mspx](http://web.archive.org/web/20080204005144/http:/www.microsoft.com/windowsxp/pro/howtobuy/choosing2.mspx \"http://www.microsoft.com/windowsxp/pro/howtobuy/choosing2.mspx\")\n\nThat’s pretty self explanatory.\n\n-Dave\n\n"
    },
    {
      "time": " 30.Jul.2005 12.13pm",
      "content": "I think you should get Pro Edition. If you are getting another PC for a member of your family who just use the PC for basic internet use or school work, then get Home.\n\nIf you are getting a PC put together from components, think about getting the OEM version of whichever edition you choose. Its half price ... one caveat is that the license is tied to the hardware, it means you cannot move that version of windows to another PC after Activation (30 days). If you don’t activate during that 30 days, you can’t do Windows update (a simple workaround was published in slashdot regarding this). What happens if you don’t activate? Answered here ( [http://www.annoyances.org/exec/forum/winxp/t1010414167](http://web.archive.org/web/20080204005144/http:/www.annoyances.org/exec/forum/winxp/t1010414167 \"http://www.annoyances.org/exec/forum/winxp/t1010414167\"))\n\nSo after activation you will not be allowed to install it to another PC even if your PC exploded! I think the activation might be tied to the motherboard and processor? My harddisk recently broke and had to change the drive, this was allowed, but could notdo activation over the internet anymore, you will have to call a provided number by the activation screen (it is so annoying being treated like a crook when you paid for the goods!!). I was plenty stressed out during re-installation, was relieved that that was allowed (very very annoying).\n\nSince you are getting XP, beware fo spyware, adware and viruses, plenty of online articles regarding how to protect yourself from these. When surfing the internet use Firefox instead of IE as your main browser.\n\nugh I’m so longwinded ...\n\n"
    },
    {
      "time": " 30.Jul.2005 2.07pm",
      "content": "The biggest difference for normal home use seems to be that the Home edition makes it harder for you to play around in the system files. This can normally be got around by using safe mode. I’ve had to do this once or twice to remove nasty viruses. Nearly all default settings treat you like you’re an idiot, but they can mostly be changed.\n\nIf it’s for ’nothing special, really...’ I’d save your money and go with Home.\n\nEd.\n\n(ps. yes, as Edwh said, the first things to get are a firewall\\* and antivirus software\\*\\*, don’t trust the ones that come built in.\n\n\\* [Zone Alarm](http://web.archive.org/web/20080204005144/http:/www.zonelabs.com/store/content/catalog/products/sku_list_za.jsp?lid=dbtopnav_zass) and \\*\\* [AVG](http://web.archive.org/web/20080204005144/http:/free.grisoft.com/doc/Get+AVG+FREE/lng/us/tpl/v5) keep my PC clean for free.)\n\n"
    },
    {
      "time": " 31.Jul.2005 8.29am",
      "content": "why to buy Windows XP? what about Vista?\n\n"
    },
    {
      "time": " 31.Jul.2005 8.31am",
      "content": "Because I’m buying the computer this week, not fall 2006.  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080204005144/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 1.Aug.2005 4.53pm",
      "content": "Dan,\n\nI’m a pretty advanced PC user and I’ve used both versions of Windows XP and I haven’t really noticed a difference at all. So I’d recommend getting Home and saving some $’s.\n\n"
    },
    {
      "time": " 1.Aug.2005 8.43pm",
      "content": "Thanks!  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20080204005144/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": " 2.Aug.2005 3.09am",
      "content": "XP Pro should really be named something like “XP Network Administrator Edition”.\n\n"
    },
    {
      "time": " 2.Aug.2005 10.59pm",
      "content": "XP pro, or possibly 64 bit, if you are going to go 64 bit AMD or something.\n\n"
    },
    {
      "time": " 3.Aug.2005 12.21am",
      "content": "I heard PRO is supposed to be more like 2000. Which was more stable.\n\n"
    },
    {
      "time": " 3.Aug.2005 3.25am",
      "content": "I’ve been using XP Home on my Toshiba Laptop and I still haven’t discovered anything I can´t do with it that XP Pro (at Office Workstation where I am now) can do better.\n\nSo, just follow antiphrasis advice... go Home and save some $\n\nCheers,  \nPedro\n\n——  \n [LiveType Project](http://web.archive.org/web/20080204005144/http:/livetype.sourceforge.net/)\n\n"
    },
    {
      "time": " 3.Aug.2005 7.29pm",
      "content": "Eric,\n\nI don’t think Pro is any more stable than Home, since they mostly share the same code. Pro just has some added functionality... Check out this [website](http://web.archive.org/web/20080204005144/http:/www.winsupersite.com/showcase/windowsxp_home_pro.asp).\n\n"
    },
    {
      "time": " 4.Aug.2005 7.08am",
      "content": "“Pro just has some added functionality”\n\nOr, rather, ’Home’ has crippled functionality.\n\nThe real names are\n\nPro = ’windows xp’  \nHome = ’crippled pain-in-the-ass windows xp’\n\nIf you just browse the web and type emails, then it doesn’t really matter. If you are the least bit geeky though, and want to dive into the guts a bit easier and/or do things like web development and need a local server, then XP is the route to take.\n\nOr a Mac ;o)\n\n"
    }
  ]
}
