{
  "id": "14264",
  "title": "The End User's Manifesto",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "If you were to make a manifesto for the [EULA](http://web.archive.org/web/20150126052717/http:/typophile.com/wiki/EULA), what would you include? I'm talking about the basic EULA, not the multi-server, multi-user, EULA. Do you think manifesto too strong a word? I don't, I want to make a statement. Do any of you really read the EULA before licensing type? Do any of you really NOT license type from a given foundry because of their EULA? Which foundry? Don't be shy. Let's dish!\n\nJust wanted to toss this idea into the pit and see what came back.\n\n",
  "author": "Miss Tiffany",
  "time": "30 Jul 2005 — 9:27am",
  "uid": "108",
  "comments": [
    {
      "time": "30 Jul 2005 — 9:47am",
      "content": "How about **The End User's Manifesto**?\n\nI think \"EULA Manifesto\" is too unspecific. Who is manifesting? Users, designers, or producers? I'm assuming that you are speaking from an end user's point of view. If I'm wrong, then maybe the \"Licensing Manifesto\"? Or the \"Pay-Us-What-Is-Due-To-Us Manifesto\"? (for foundries/designers, respectively).  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150126052717/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "30 Jul 2005 — 9:51am",
      "content": "Assumption correct, Dan. I'm speaking for the End User. But, Isn't it End User License Agreement? I would think that End User is implied. Fair enough. But that still leaves the other questions.\n\n"
    },
    {
      "time": "30 Jul 2005 — 10:06am",
      "content": "I think that End Users have very specific demands (or at least wishes) for the way EULAs be written. If they were to have a manifesto, that would express these, right? So it is their manifesto, and not a EULA manifesto.\n\nBut this is really your manifesto, isn't it? I shouldn't try to twist you into anything ;-)\n\n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20150126052717/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "30 Jul 2005 — 10:07am",
      "content": ":^o Busted! Yes, it is my manifesto. But, I am hoping other end user's will share their opinions and realities.\n\n"
    },
    {
      "time": "30 Jul 2005 — 10:39am",
      "content": "\\> How about The End User’s Manifesto?\n\nThat sounds just right. What we should be paying attention to.\n\nhhp\n\n"
    },
    {
      "time": "30 Jul 2005 — 11:33am",
      "content": "Of course, most foundries are protecting themselves with their EULA, which is as it should be. The foundry is making explicit their demands of the end user.\n\nIn my opinion, it doesn't hurt for the foundry to reflect the reality on the ground. (Many foundries will disagree with me.) The EULA for Village was written to protect the foundry, the end user, and the designer of the typeface. The language is simple and clear, and not legalistic, and above all it acknowledges that this kind of agreement is \"faith-based\". As a small foundry, we can't afford to prosecute those who infringe the agreement; we therefore ask that customers agree to comply with the terms of the agreement to the best of their ability, and in good faith.\n\nThe full text of the EULA follows. I'd love to hear feedback and comments. Especially from you, Tiffany. Does this EULA do anything for you as an end user?\n\n/ / / / /\n\nVillage End User License Agreement / version 1.2, July 2005\n\nThis is an agreement between you, the purchaser, and Village Type & Design LLC (Village). In accepting the terms of this agreement, you acknowledge understanding and promise to comply with its terms. If you do not accept the terms, please do not complete the purchase transaction.\n\nWhat you are purchasing from Village is the license to use digital typeface software - hereafter \"fonts\" - on a certain number of computers within your organization; you are not purchasing the copyright to the design of the fonts, but the rights to use the fonts.\n\nIf you are purchasing 1 license, you may use the fonts on a maximum of 4 computers within your organization; If you are purchasing 2 licenses, you may use the fonts on a maximum of 10 computers within your organization; If you are purchasing 3 licenses, you may use the fonts on a maximum of 25 computers within your organization; If you are purchasing 4 licenses, you may use the fonts on a maximum of 50 computers within your organization; If you are purchasing 5 licenses, you may use the fonts on a maximum of 100 computers within your organization; If you are purchasing 10 licenses, you may use the fonts on a maximum of 500 computers within your organization; If you are purchasing 20 licenses, you may use the fonts on an unlimited number of computers within your organization. You can purchase additional licenses at any time, which grant you the rights to use the fonts on additional computers, as noted above.\n\nYou can make archival copies of the fonts for your own purposes. You will not distribute the fonts to people outside of your organization. A copy of the fonts may be sent as part of a file release to a prepress bureau, if absolutely necessary. The fonts can be embedded in other software files, such as Portable Document Format (PDF) or Flash files, but you will take all reasonable care to embed the fonts in such a way that they cannot be extracted from the files you create.\n\nYou may modify the fonts for your own purposes, but the copyright remains with Village, and the number of computers covered by the license remains the same. You may not commission a third party to modify the fonts without first gaining permission from Village. You may not sell or give away modified versions of the fonts.\n\nWe have done everything we can to produce our fonts to the highest and most up-to-date technical standards, and we test the fonts extensively in the latest versions of technically-compliant applications. If you do experience any difficulties with our fonts, we will do everything that we can to work with you to resolve any issues. If, after we have worked to resolve any technical issues, you are still not satisfied with our product, we will be pleased to refund your money, which shall be the limit of our liability in this transaction.\n\nWe grant the rights of use of our fonts to you in good faith, and request that you promise to adhere to the terms of this agreement to the best of your ability, and in good faith.\n\n"
    },
    {
      "time": "30 Jul 2005 — 5:39pm",
      "content": "Chester, what an incredibly reasonable EULA.\n\nI don't want people to think that I'm slowly trying to convince foundries to change at their core(s). If there could be some sort of standardization, I would be for that. However, some things which Chester/Village have has allowed would probably never happen on other foundries EULA.\n\n"
    },
    {
      "time": "30 Jul 2005 — 9:14pm",
      "content": "I blush.\n\nTiffany, I'm sure that there are foundries out there who would find the Village EULA to be too reasonable and permissive. As a recovering graphic designer I am well aware of the way things work out in the world, and I felt that our EULA should reflect that experience.\n\nRetail type design is a gamble: type designers work on types for months or years, getting them just right aesthetically and technically, in the hope that they will make money from sales for years to come. We invest in time and hope for return on investment in the form of money. (This is very similar to artists and writers, except we small guys never get advances.) The end user most likely doesn't know this. Readers of Typophile probably do, but they're in the minority.\n\nMany graphic designers use their fonts illegally, either because they have not licensed them at all, they are using them more widely than their licenses allow, or they are embedding or doing other things the licenses don't allow. The huge majority of these people didn't read the EULA, just as they didn't read the EULA for their page layout software, or the privacy statement on the back of their credit card bill. People are immune to legal documents; they click the \"Agree\" button automatically, never intending to follow the agreement: they don't even know what they're agreeing to.\n\nMy hope is that by simplifying our EULA people will actually read it. And that by making it easier to actually comply with its terms, people will uphold their end of the agreement.\n\nAt Thirstype, I once devised a really complex sliding pricing table for multiple-user licensing. It was a logirithmic nautilus affair, and was hard for purchasers to swallow. We would often get calls from people wanting to license a font for, say, 8 computers, but once they learned the price they changed their minds and would only license the font for one computer. If our licensing was more reasonable, customers would have been more willing to ante up for the correct licensing for their needs. And hopefully they would respect us for understanding their situation.\n\nThis is what I was thinking in drawing up the Village EULA and licensing table. I wanted them to reflect the way that designers actually use type. Type publishers just don't have the time to go around enforcing the correct licensing of their types, so we have to place our trust and faith in our customers. We have to believe that they will try their hardest to follow the terms of the agreement, that they will purchase the right number of licenses for the number of computers on which they plan to install the fonts, and that they will try not to let the fonts loose.\n\nAs for an End User Manifesto... I think it's a good idea. There are too many EULAs out there which are egregious in some or all of their stipulations. Should one cross one's fingers while clicking \"Agree\", or should one cancel one's order/installation, etc.?\n\n"
    },
    {
      "time": "31 Jul 2005 — 4:21am",
      "content": "Chester:  \nYour EULA is what I, as a user, want.\n\nI \\_do\\_ read EULAs. I won't buy fonts that forbid embedding in PDFs - it's not worth it to me to buy a font if I can't send a client a PDF proof, and besides, I don't want to keep track of which ones are forbidden, so I just won't buy them.\n\nAnd modifications:\n\nJust yesterday I was going to buy Monticello from Linotype, until I noticed that the EULA doesn't allow modifications. Now, the Linotype EULA offered at MyFonts does allow modification, but Monticello isn't offered there. It's a pain.\n\nIt's a pain, especially now, as we hover halfway between OpenType and Type 1. If I buy Monticello (type one only), I can't combine the smallcaps with the roman into OT for convenience in InDesign. The fractions are a separate font. How...quaint.\n\nMeanwhile, I have FontFont's Absara Sans OT. I'd like to can get at the smallcaps to use on a form in FileMaker, but that isn't possible in FileMaker without rearranging the font.\n\nNow, I have a nice guide put out by FontShop Canada some time ago: \"FontShop's Guide to Legal Typeface Use\". It states the \"most font manufactures will allow you the right to produce a modified version.\" It then goes on to give an example: producing swash caps for Baby Teeth, they suggest, would be all right as long as everyone involved is within the EULA for the original.\n\nSo, I can just go ahead and rearrange the position of the small caps in Absara, right? NO! The FontFont's EULA requires me to obtain \\_written permission\\_ first. I have asked, and Danny Dawson is looking into it for me, but my inquiry was made a couple of weeks ago, and I wouldn't be surprised if I have to wait a few more weeks to get an answer.\n\nSurely this isn't good for me, or profitable for FontShop.\n\nWill I buy from FontFont again? Probably, especially if they solve my problem. Will I consider the added hassle when deciding between a FontShop face and, say, one from Village or ShinnType? For sure.\n\nI know that all designers are free to set whatever conditions they want on their work, and it's up to me to make my decision based on these conditions.\n\nIf more people read the EULAs, and took them to heart, the marketplace might function properly. EULAs that allowed me to actually USE the fonts would boost sales, and other designers would follow suit.\n\nUnfortunately, I get the feeling that many buyers blithely ignore the EULA and make their purchases without reference to them, and make use of the fonts outside of the EULA. There's no reasonable possibility that LinoType is ever going to know if someone slipped a couple of the nut fractions into the roman cut of Monticello, and most designers wouldn't even know (or care) that they had broken the EULA if they did so.\n\nI, on the other hand, end up feeling like a sucker for abiding by it.\n\n"
    },
    {
      "time": "31 Jul 2005 — 3:58pm",
      "content": "\"I won’t buy fonts that forbid embedding in PDFs - it’s not worth it to me to buy a font if I can’t send a client a PDF proof, and besides, I don’t want to keep track of which ones are forbidden, so I just won’t buy them.\"\n\nThat is the crux of it for me as well. I password protect the PDFs before I send them to anybody.\n\nChrisL\n\n"
    },
    {
      "time": "1 Aug 2005 — 6:04am",
      "content": "_I, on the other hand, end up feeling like a sucker for abiding by it_\n\nThat's a pretty common feeling for people who abide by the rules when so many around them don't; however, it's generally better to be part of the solution than part of the problem.\n\n"
    },
    {
      "time": "1 Aug 2005 — 11:35am",
      "content": "<cite>swash caps for Baby Teeth</cite>\n\nOMG!  \nI want it.\n\n"
    },
    {
      "time": "3 Aug 2005 — 9:48am",
      "content": "It seems I'm not the only one that feels somewhat penalized. In development, I can prepare many PDFs. Taking each one and re-opening in Acrobat to add password protection takes real time. I feel like I spend increasingly more time trying to keep my end of the deal. I also don't stray much from very commonly available type with my lower end clients because of the hassle.\n\nThis makes me think of what people say about a police state, that you craft enough laws that everyone is in violation of a few at any given time.\n\nI think this thread and others are a testament to the fact that all the efforts to protect the type sellers and designers are creating a drag on the industry. I find it odd that as the promise of technology has paid off, the time saved having functioning hardware and software can be spent fussing with EULAs and patching up PDFs to prevent font theft. I don't even know how to pull a font out of a PDF. Now I feel I should figure out how it is done so I can best try to prevent it. The burden is on the honest, which doesn't seem fair. But then again, what's fair?\n\n"
    },
    {
      "time": "3 Aug 2005 — 2:42pm",
      "content": "Which EULA's require password protection of PDF's? I can't recall seeing this before. Not mentioned at all in the bible... [http://fontlab.wikidev.net/Image:Interrobang2-EULA-chart.gif](http://web.archive.org/web/20150126052717/http:/fontlab.wikidev.net/Image:Interrobang2-EULA-chart.gif \"http://fontlab.wikidev.net/Image:Interrobang2-EULA-chart.gif\")\n\nCheers, Si\n\n"
    },
    {
      "time": "3 Aug 2005 — 2:47pm",
      "content": "OH NO! That isn't the bible, Si, I've been told by numerous foundries that there are now errors and mistakes because they have changed or Nathan and I misunderstood the EULA.\n\nI would also be curious to know who requires this assanine requirement.\n\n"
    },
    {
      "time": "3 Aug 2005 — 4:34pm",
      "content": "Explain embedding. Maybe I'm off on a tangent.\n\n"
    },
    {
      "time": "4 Aug 2005 — 6:57am",
      "content": "Font embedding is an Acrobat option that lets you include the fonts used in the document within the PDF. Foundries have EULA restictions around the embedding their fonts, as well as the distribution of the PDF that include their fonts. However, I've not seen a font EULA require that a PDF be password protected - although they might exist. But if you're not obligated to pass-word protect why are you doing it?\n\nCheers, Si\n\n"
    },
    {
      "time": "4 Aug 2005 — 7:32am",
      "content": "I was under the impression password protection was the only way to limit the editing of a PDF. I may have wrongly assumed this was associated with preventing extraction of the font data.\n\nFollowing your link Si, I notice the Adobe restrictions listed \"additional license available for documents that are editable\", and \"technical restrictions such as print & preview only\".\n\nI've used the password function to prevent editing of the doc. etc. for various reasons, but one of those reasons is usually associated with the EULA and trying to protect the font from theft. I've had PDFs sent to print without my knowledge without full res. images.\n\nAnyway, I'll look at Acrobat with more depth and get up to speed before I rant anymore.\n\n"
    },
    {
      "time": "4 Aug 2005 — 9:26am",
      "content": "Embedding is a problem word as it can be in reference to PDF and/or formats similar to SWF. I do think these are two different kinds of embedding, but I wonder if foundries see embedding as a value add when used in SWF and so reason they should be able to get more money. (That could also be a question.)  \n--  \nI appreciate, as a user, that Chester, you and Village, have approached this with new thought and reason. You are right most of the time people, even I, click agree without thinking. Bad habits die hard. There are basic uses which designers hope they can do with there fonts. Your EULA, Chester, seems to make sense in that maybe designers will meet you half-way and will read your EULA.  \n--  \nWhat are those basic things we, designers, need to be able to do with our fonts when we license them?  \n- Print: I have several printers in my office. But, according to some EULAs I have to choose a printer. This seems antiquated.  \n- Embed for proofing and service bureau output.  \n- Archive  \n- Modify: At my own risk. This one isn't so important to me, but John does make a good case for it. My situation is such that I wouldn't trust myself to modify the font. I'd rather have the foundry do that for me so if something is wrong I can talk to them.  \n- Transferability: This is important to me. (Read below)  \n- More than 1 user, at least 2: I have no idea how to rationalize this beyond my own personal experience as someone in a small office.  \n--  \nWhat about resale? If I were to create a book, for online sale, as a PDF. Is it reasonable that foundries charge extra for this? Should their be a resale EULA? Or is this yet another case of trying to get us to pay more? I think it is fair. But, what do you think?  \n--  \nI'd be interested to actually see someone crack a PDF and find out how useful the font is once cracked. It seems to me that those who can crack open a PDF to get a font aren't designers but bored geeks out to prove something.  \n--  \nIt seems to me that Chester, you, are trying to infuse trust into your EULA. I appreciate that. This is not to say that I don't find trust in other EULAs.  \n--  \nThere are two people in my office that might be considered \"designers\". I use quotes because he is more or less in charge of production. However, when I license type from a foundry, such a The Font Bureau, I have to make sure that the other \"designer\" doesn't copy the fonts off of my machine as I only license them for my machine. I also pay for the licenses myself with the understand, from all of the foundries from whom I license, that I will take the fonts with me when I leave. Am I creating a nightmare for them? Probably. But, I've taken the time to create relationships with these foundries based on trust and common understanding. It needs to be said that I have searched his hard drive and have deleted fonts that I know he shouldn't have. I feel a little guilty, but I doubt he even notices. I'm the police in my office. I take the steps necessary to respect my associates and friends.  \n--  \nAnother tangent. If more people actually took time to create relationships with the foundries, and vice versa, I think more people would find themselves wanting to abide by the rules.  \n--  \nShould I be speaking to the technical forum at ATypI? Or, am I already talking to the converted? This is, in a nutshell, what I am trying to figure out.\n\n"
    },
    {
      "time": "4 Aug 2005 — 2:09pm",
      "content": "\\> I was under the impression password protection was the only way to limit the editing of a PDF. I may have wrongly assumed this was associated with preventing extraction of the font data.\n\nFor TTF and OTF's the 'print and preview' restriction is encoded in the font itself, and Acrobat will respect that setting. For Type 1 fonts, perhaps jumping through those hoops might be the only option to stay within the EULA - that's a bit annoying. In my world I don’t have to deal with Type 1, so things are somewhat less complicated.\n\n\\>Should I be speaking to the technical forum at ATypI? Or, am I already talking to the converted? This is, in a nutshell, what I am trying to figure out.\n\nYes! There will be people there who will benefit from this, especially in the context of the other talks lined up for Thursday morning.\n\nCheers, Si\n\n"
    },
    {
      "time": "4 Aug 2005 — 3:06pm",
      "content": "Did you guys know that the Emigre EULA fobids you to send your service bureau a file containing converted-to-outlines of their fonts? That's gotta be a really good example of either monumental hubris, or engrained idiocy. Or both. This is definitely even worse than any no-mod clause. And I wonder what it says about making a logo from their letterforms... It should just come out and say: \"If you **think** about not giving us more money, you thereby owe us twice that amount.\"\n\nhhp\n\n"
    },
    {
      "time": "4 Aug 2005 — 3:15pm",
      "content": "To be fair, their EULA says nothing about outlines specificially, as I would use the phrase \"turn the type to outlines\". Could others read it and maybe help clarify. It could be that I am misunderstanding their use.\n\n[http://www.emigre.com/EUL.php](http://web.archive.org/web/20150126052717/http:/www.emigre.com/EUL.php \"http://www.emigre.com/EUL.php\")\n\n"
    },
    {
      "time": "4 Aug 2005 — 3:17pm",
      "content": "Number 6 says you can't make EPS files.\n\nhhp\n\n"
    },
    {
      "time": "4 Aug 2005 — 5:18pm",
      "content": "Type designers can set the embedding bit in TTFs to one of four options. These options affect how you can use and share a font from a license standpoint. The option in Acrobat to embed fonts is more of a toggle button, and the embedding rights in the font need to agree with it:\n\n1. Downloadable: Anyone can squeeze the fonts out of a PDF and install them on their machine for unlimited use in other docs\n\n2. Editable: The whole (not subsetted) font is embedded in the PDF, enabling co-authors to edit the file but not download it\n\n3. View and Print: Subsetted fonts are embeddable in PDFs for distribution, but no editing is possible\n\n4. Restricted: Font can't be embedded, so fonts revert to system or substitution fonts when PDF is shared.\n\nObviously the first is horrible for a type designer, and the last is horrible for the document user and author.\n\nThe term 'embedding' for fonts needs a qualifier to discuss meaningfully.\n\nAdobe allows downloadable embedding in all its new font products. Adobe's main business is Acrobat. See?\n\n"
    },
    {
      "time": "4 Aug 2005 — 6:17pm",
      "content": "\\> Adobe allows downloadable embedding\n\nI think you mean editable. The point you make is interesting and reminds me of something Bruno said at TypeCon about foundries basing their output device restrictions on Adobe's font EULA. Seems odd that any foundry would today follow the lead of a software vendor (especially one selling font-related apps, tools and technology) when setting embedding bits and writing licenses.\n\nCheers, Si\n\n"
    },
    {
      "time": "4 Aug 2005 — 9:43pm",
      "content": "Hrant, to your point on article 6, the sentence that follows this restriction has more to do with article 9 where Emigre states they won't be held responsible for somebody using their fonts or derivative works for fitness for a particular purpose . . .\n\nImagine an ad agency uses an Emigre font or creates EPS outlines from an Emigre font and runs an ad campagin for a major client like MegaFlicks in a national campaign and it reads in the paper as MegaF\\*cks and the agency gets fired and blames it on the font rather poor art direction and decides to sue Emigre. Legally, Emigre would still be on the hook for this unless articles 6 and 9 were in their EULA.\n\nIt's a totally unlikely scenario, but the language is clear that there is no guarantee that font software licensed to an end user is guaranteed to work for any specific purpose. I believe this is one of those misunderstood passages that comes off as 'license everything from us or else' . . .\n\nOn the flip side of the coin, lets say one of the many Digital Scrapbookers (the fastest growing new trend) decides it's OK to make a digital alphabet from an Emigre font and resells it for $6 for a set of .EPS letters. This becomes a derivative work which is being resold and redistributed as software and for all intents and purposes violates the EULA to say the least . . .\n\nI'm not sure Emigre's EULA is that dogmatic, but it does in very general terms create enough of a statement to the end user that should they need to bring suit to get them to stop selling these digital alphabets, they have a strong case to do so with . . .\n\nThink of a EULA like a 3 year-old child . . . If you don't specifically say 'NO' or 'DON'T DO THAT', the child assumes the answer to every question is 'YES' or 'YOU HAVE MY PERMISSION' - And make no mistake, most end users are very generous in their assumptions about what is allowed and what is not.\n\nAt least twice a week I am pleased to get questions from folks wondering if their use falls under our standard EULA and I make sure to answer them thoroughly . . .\n\nAlso, I'm not inclined to debate Emigre's EULA point by point, but I prefer to explain to the best of my understanding as to what each passage means to both the foundry and the end user. Often times from what I read about EULAs on boards, it does come off as an us vs. them kind of deal when in reality it's more like defining the terms of a relationship between two parties kind of like a pre-nupt.\n\nAs a foundry owner I feel responsible for defining this, else its my own fault if I don't provide any information on what the purchase price entitles you to. And, for any fonts that do NOT have EULAs, many of them end up on CDs for sale at eBay for $15 and the creator is often none the wiser that somebody else may be profiting off of their work, EVEN if the creator intended that nobody should pay for it and distributed it as freeware to the masses.\n\nSo I guess what I'm saying in not so many words is that the buyer and the seller need a EULA. How clear or restrictive it is, is solely the responsibility of the foundry and as the creator of the products they are selling they have the ultimate last word in how they wish their products be used.\n\nHere is an interesting snippet from the House Industries Vector Image EULA that demonstrates how specific a foundry can define their use:\n\n'If images featuring a person will be used in connection with unflattering or controversial subject matter, or used to imply connection to or endorsement of a product, the image must be accompanied by a statement that states the person is a model used for illustrative pruposes only.'\n\nMy 2¢\n\nStuart :D\n\n"
    },
    {
      "time": "4 Aug 2005 — 10:03pm",
      "content": "Stuart, you've thought a lot more about this than I have - thank you for elaborating on how complex this can be. But the bottom line is that a designer\\* is forbidden from carrying out a routine, legitimate and indispensable activity. A foundry's liability is one thing, imposing hyper-restrictive blanket requirements is another; as I've expressed before, I think all unreasonable demands do is encourage bad behavior - they don't actually stop much. Also, it seems to me that EULAs often leverage over-simplification to create an intimidating aura of ambiguity that seems to serve only the foundry - but ends up leaving a bad impressions with the user. The fact that section 9 is in all-caps is a clue as to what's really going on.\n\n\\* Who even bothers reading the thing.\n\n\\> Think of a EULA like a 3 year-old child\n\nTo me it seems a lot more like a nasty, slick, middle-aged lawyer.  \nWho writes this stuff, anyway? Come on.\n\n\\> most end users are very generous in their assumptions  \n\\> about what is allowed and what is not.\n\nEnd users who bother taking a EULA seriously should be treated with respect - not like this. And end users who don't, you have to learn to ignore.\n\nhhp\n\n"
    },
    {
      "time": "5 Aug 2005 — 9:32am",
      "content": "I agree you've got some good points here Hrant. The question is, how can one craft a EULA that reads at an end user 'understandable' level yet has enough weight to hold up in a court of law if need be.\n\nSomething else to consider is that all EULAs were written long before the indie internet foundry boom of the mid 90s becuase at that time most foundries selling fonts were selling them to art directors whereas todays audience is quite honestly anybody with a computer so the language of EULAs has not evolved to meet this new audience.\n\nFor myself, when I started my foundry in 1996, I did a cut/paste job and subbed my foundry name for the one that was there. Certainly years later when I GOT the purpose of a EULA, I did get saavy about understanding what I wanted mine to say. I think this holds true for many foundries from that time period as well as plenty of the current MyFonts foundries who don't totally GET EULAs but think they should have one to seem 'official'\n\nIn part, I don't think many font creators totally get the concept of a EULA and I think most of the spanning of the gap occurs from the foundry side, not the end user side and I certainly agree with Hrant on this. And to this point, as I mentioned earlier, the end user is becoming a more sophisticated buyer than ever before so EULAs are being read by end users.\n\nTiffany made a point earlier about embedding and this one is tricky. The idea of somebody selling an ebook with an embedded font, does this warrant additional licensing fees? What about a computer gaming company using a font prominently in their product? What about embroidery machines that will sew your name on a shirt using a specific font? What about a network running promos for a TV show using a specific font?\n\nIn all of these cases, the end user is enhancing or creating a product using the font as part of the product. As the creator of the font being used, I do honestly feel that using the font in these manners does warrant the need to extend licensing since part of what is being sold or promoting the sale is the font.\n\nStuart :D\n\n"
    },
    {
      "time": "5 Aug 2005 — 10:48am",
      "content": "How is an eBook different than a print book? Why wouldn't the same rules apply?\n\nChrisL\n\n"
    },
    {
      "time": "5 Aug 2005 — 11:10am",
      "content": "Two thoughts I have on this are:\n\n1) Because technically it's still a form of software distribution which is forbidden in most EULAs. Different than sending PDFs with embedded fonts to a service bureau or client, when an eBook author sells a book, they are selling the font(s) as well. Both sides could be argued to death, but it's clearly an issue that requires discussion . . .\n\nAs far as eBooks go, it's is no different than a game developer embedding a font in a video game or a kiosk developer embedding a font in a stand along kiosk or digital slot machine. If they are intending to sell something or make money with something the software is part of, I personally feel it's still a form of software distribution that requires additional licensing.\n\n2) I think the difference between a printed book is that the font is no longer accessable and the product is truly 'finished' - In cases of eBooks, the font software outlines are still 'live' because they are required to render text to output devices like monitors and printers via computers. So, for all intents and purposes, the font is still very much a part of what is being sold.\n\nStuart :D\n\n"
    },
    {
      "time": "5 Aug 2005 — 11:55am",
      "content": "I have a few thoughts too...\n\n1. having digital fonts (bitmap fonts or outline fonts) embedded in eBooks, video games, help systems, etc., clearly adds value to these products. The fonts reduce file size (no need to pre-render flat bitmaps for each page of content), they aid modification (easier to fix typos without regenerating bitmaps), make localization easier (update a linked text file ratehr than a bitmap), are easily searchable (no need to jump through the additional hoops Octavo do/did in their eBooks by having searchable text 'behind' the bitmap pages) etc., etc.,\n\n2. Embedding permissions in fonts relate to \"document\" embedding. Clearly a video game is not a document, but for a commercially sold eBook some font vendors make the case that eBooks are “products” and not documents in the embedding sense.\n\nSo on the one hand because eBooks were not really covered by older EULAs (which talk about document embedding) font vendors could take advantage of this and put restrictions around the eBook embedding without visibly taking away existing rights from customers.\n\nOn the other hand clearly embedding fonts in eBooks adds considerable value and functionality to these products so it's not unreasonable for customers to pay more for these rights.\n\nFears of extraction of fonts from eBooks is really a red-herring - the restrictions are based on the value the fonts add to the products.\n\nCheers, Si\n\n"
    },
    {
      "time": "5 Aug 2005 — 7:46pm",
      "content": "Hmmmm... I see Suart's point about \"live versus static\", but I would say that this kind of extra payment scheme is akin to one's bank taking extra money for every transaction. It's beyond the pale.\n\nI mean, imagine paying FontLab extra money every time you generate a font; this is the final task of the software, and we expect this functionality. And we should. Which is why we ship out OTF or TTF or PST1 files to our licensees, not VFBs. (Not everyone has a copy of FontLab lying around to roll their own fonts.)\n\nThe more restrictions we place on the potential licensees of our types, the less interested they are going to be in abiding by those restrictions.\n\nTime for another analogy: You're in the market for a new car. The EULA for the car stipulates that you cannot drive above 45 miles per hour, but you want to drive your car on the highway. So you have to decide: do you buy the car knowing that you can't exceed 45 mph, or go look elsewhere for a car without such a restriction?\n\nI know I've posted this elsewhere, but David Foster Wallace wrote a very interesting piece for Harper's magazine about dictionaries taking either a descriptive or prescriptive approach. If you have a couple of spare hours, you can read it here:  \n [http://instruct.westvalley.edu/lafave/DFW\\_present\\_tense.html](http://web.archive.org/web/20150126052717/http:/instruct.westvalley.edu/lafave/DFW_present_tense.html \"http://instruct.westvalley.edu/lafave/DFW\\_present\\_tense.html\")\n\nWe publishers each have to decide if we're going to focus on describing - our approach at Village - or prescribing the allowable use of licensed types.\n\n"
    },
    {
      "time": "5 Aug 2005 — 8:44pm",
      "content": "Si:  \nI think that fonts, as individual designs, add more value to a printed piece than an electronic one, so I don't really buy your arguments.\n\nThe fonts on the cover of a book, the look of a printed page, help convince the browser in the bookstore to pick up the book and buy it. (Or, at least, they engage me.) \\_That's\\_ added value for the book producer.\n\nI doubt that many PDFs are sold because of the format. The person buying a PDF is more likely focused on the content, rather than the look. If it all shows up as Adobe Sans, (or Verdana or Georgia) on their system, they'll still get the content, and probably won't be disappointed. The \"functional\" nature of the font, its search-abilty, its compact format, aren't tied to its individual design qualities.\n\nSo, one might say the fonts, qua individual designs, have \\_less\\_ value, not more in an electronic doc. One certainly might have a hard time convincing someone holding the purse strings to spend extra for the \"restricted\" fonts, over easily available unrestricted ones.\n\nAgain, market forces should discourage restrictive EULAs, but I suspect that much of the market is already treating fonts as unrestricted regardless of the EULAs.\n\n"
    },
    {
      "time": "5 Aug 2005 — 11:45pm",
      "content": "John, to be honest I don't think people are buying eBooks yet, so the issue isn't exactly relevant right now. Font vendors added these eBook clauses to their EULAs when eBooks were being hyped as the next big thing - that hasn't happened yet - maybe it never will.\n\nIf and when eBooks do take off designers may stick with system core fonts but it's likely they'll want the same flexibility they have in print. Even if many customers will be happy with Arial and Comic Sans.\n\nCheers, Si\n\n"
    },
    {
      "time": "9 Aug 2005 — 5:14am",
      "content": "For what it's worth, I've heard back from Danny Dawson at FontShop USA about modifications to FF fonts, and the short answer is, no, you can't do any.\n\nI have found my dealings with Danny to be very satisfactory, and I believe he is trying his best to help me and explain the Fontshop terms to me. It's a thorny area, and I get prickly when I enter it. He's spent a lot of time replying to my pesky queries. Fontshop has a good and patient worker there.\n\nSpecifically, you may recall that I wanted to be able to rearrange the font to allow me to use the smallcaps in Filemaker. Danny says that modifications have to be done by the designer, or by Fontshop staff, and that I am \"effectively prohibited from making the changes yourself.\" He says there may be some situations where FontShop might allow user mods, but he doesn't know of any.\n\nI've asked him how much such a modification would cost, but he hasn't replied to me yet. Practically, I'm sure it would be much cheaper to just buy the Type 1 smallcap font, but I was curious.\n\nI've also asked him what it would cost to have the ff ligatures from Seria Sans added to the regular font, something I would have done myself in about 5 minutes. I also wondered why FontShop persists in putting ff ligs in a separate font when, for example, Storm includes them in the regular font (even the Type 1), and names them properly so that InDesign finds and uses them.\n\nI haven't asked, but wonder how much time and money it would cost me to have kerns for smallcaps to numerals added to a Fontshop font. Canadian postal codes alternate letters and numerals, like this \"M5W 7V6\". It doesn't take an obsessive compulsive to find fonts that end up with ugly spaces with these babies! Do all the FontShop fonts cover these pairs? I don't know, but I doubt it. Since I'm not allowed to modify the fonts, I'm going to be stuck reviewing addresses individually if I do mailing labels with a Fontshop font. Hmmm, maybe I'll use an Adobe font, or Panoptica! Life's too short.\n\nSo, I'm disappointed in FontShop. I think their EULA is a tease. It states \"If you want to make modifications to the Font Software, you must obtain the prior written consent of FSI.\" Am I the only one who thinks this implies that one \\_might\\_ obtain that consent? Shouldn't it state \"you are effectively prohibited from making the changes yourself\", since that is, in fact, the policy?\n\n"
    },
    {
      "time": "9 Aug 2005 — 8:20am",
      "content": "\\> Life’s too short.\n\nExactly. Do it.\n\nhhp\n\n"
    },
    {
      "time": "9 Aug 2005 — 11:04am",
      "content": "_... The person buying a PDF is more likely focused on the content, rather than the look. ..._\n\nYou are right, but it is generally the designer who wants to guarantee the look of the book/brochure/whatever across media which means embedding the font. _Should I be saying subsetting instead of embedding?_ If designers are fine with Adobe Sans and Adobe Serif then there isn't a problem. However, isn't it a messy PDF when you allow for re-flow? Won't you have to create a version of the book/whatever allowing for re-flow? The table of contents will suddenly not count for much.\n\n--\n\nJohn, can you e-mail me the EULA which you are using as reference?\n\n--\n\nI wouldn't call it a tease, well, ok, _maybe_, but after reading so many EULAs, and not calling myself a lawyer or legal-eagle or expert, it seems to me it is in the best interest of foundries and users to have some text left vague. Perhaps more for the foundries, but it leaves it open to the user to create dialogue and develop a relationship. You could disregard the help which Mr. Dawson has offered. You could read into it and find a rationalization. It seems to me he hasn't given you a final NO, so maybe you could wait a little longer?\n\nEconomics say you've probably spent more time (which equals money) on researching this option than it would take to license the type and write a script for replacement? I'm probably over-simplifying.\n\nThe things you've stated need to be addressed, not just by FontShop, but all foundries. I'm not trying to create argument.\n\nPerhaps the reason they haven't compiled all of the ligs/figs into the same font is they are slowly upgrading everything to opentype. Maybe. Only a guess. I have some fonts that drive me crazy in similar ways. I do own a license to FontLab, but I'll be the first to admit my total lack of knowledge. IF I were to open a typeface and start monkeying around I'm sure I'd make a bigger mess than a simple find-and-replace would solve.\n\nAm I to understand that the EULA for FSI Canada is different that FSI?\n\n"
    },
    {
      "time": "9 Aug 2005 — 2:44pm",
      "content": "Tiffany:  \nOf course I've spent more time (=money) on this than if I had done a search and replace. My point is that I shouldn't have to jump through such hoops.\n\nThe fact that you don't feel comfortable with FontLab is unfortunate. I'm no expert, but the kind of modifications I'm talking about aren't difficult, and aren't dangerous.\n\nBelieve me, it takes far less time to add ff ligs to a font for use in InDesign than it does doing S&R every time you use the font, and then remembering to redo the S&R if you change fonts. If I switch my headings from Seria to Seria Sans, I'm going to have to go over to the Sans \"expert\" (ha!) set to get the ligs again.\n\nAm I the only one who's printed a piece with a word like \"office\" showing up as \"oVce\" because I missed a expert set switch after changing fonts? Thanks, but no thanks.\n\nI don't mind terribly that they haven't compiled the ligs into the fonts. I \\_do\\_ mind that they won't let me do it for my own work. I'd be happy if they said modifications \"voided the warranty\". (Oh, that's right, there is no warranty, is there?)\n\nThe FontShop EULA I'm referring to is the one offered if you go through the checkout process at FontShop USA. You, or anyone else, can view it there if you wish. I can email it to you if you'd like.\n\nI don't know the current status of FSI Canada. I don't get the impression that the current Canadian terms are different from the USA ones. I was referring to a pamphlet sent to me several years ago by FSI Canada entitled \"FontShop's Guide to Legal Typeface Use\". I had, naively, relied on it in the past.\n\nI can't find EULAs for any FS Canada font purchases. I have FF Clifford on floppies from them, but the disks don't seem to have EULAs on them. I have some original compressed packages sent to me by FontShop on my hard drive, but, unfortunately, they will no longer open on my Mac, even in Classic. The floppies may have come wrapped in a printed EULA, but it's no longer to be found. I suppose I thought the pamphlet told me what I needed to know. Ah, youth!\n\n"
    },
    {
      "time": "9 Aug 2005 — 2:55pm",
      "content": "FWIW, Tiffany:  \nI'm not sure, because I never use them, but I think that the Adobe substitution fonts maintain line breaks.\n\n"
    },
    {
      "time": "10 Aug 2005 — 10:10am",
      "content": "Dan, I think I will use your idea. After thinking about it, and obviously having misunderstood you the first time, I do like the idea that this is _\"The End Users Manifesto\"_.\n\n--\n\n_**Of course I’ve spent more time (=money) on this than if I had done a search and replace. My point is that I shouldn’t have to jump through such hoops.**_\n\nSorry. I was stating the painfully obvious.\n\nThanks for e-mailing your EULA. Yes, I'll agree, it is mis-leading of them to tell you to obtain written consent when in fact, so far, it seems you won't be granted consent. I think you might agree that if they had simply said, \"modifications are not allowed,\" you wouldn't have bothered with them or their type. Or, at least you wouldn't have wasted time hoping and writing. The fact that you are in correspondence should show them you do care. Perhaps it will end on you side of the user fence.\n\nFS Canada no longers exists. Using that guidebook, as helpful as it _might have been_ can only cause problems for you now. When foundries change their license I believe all past users who licensed are now held to the new license.\n\n"
    },
    {
      "time": "10 Aug 2005 — 1:25pm",
      "content": "\"When foundries change their license I believe all past users who licensed are now held to the new license.\"\n\nWell, no I don't think so. If that were true, \\_I\\_ could change the terms of the agreement! That would be a unilateral re-negotiation of the \"contract\". I can't possibly be held to a new license—I didn't agree to it. I can only be held to the license I agreed to at the time of the transaction.\n\nThat's why, for example, the Berthold fonts I obtained in the distant past I can still use, although I have no intention of getting any new ones. And that's why I wouldn't be too worried about making an OpenType version of faces I licensed from FS Canada.\n\n"
    },
    {
      "time": "10 Aug 2005 — 1:53pm",
      "content": "If you licensed an FF font from FS Canada, I assume that your license was not with FS Canada, but with FSI (just like if you bought a ShinnTypes font from FSI, the EULA is from the foundry being distributed by the distributor, not the distributor itself).\n\nFSI does still exist, and you would still be bound by your agreement with them if that is the way the EULA really worked (which I'm pretty sure it would… can any FontShoppers help me out here?).\n\n"
    },
    {
      "time": "10 Aug 2005 — 1:55pm",
      "content": "Dan, I'm the one disagreeing, not John. I have always understood that as EULAs are updated those are the EULAs which we are held by. No? I mean say I license a typeface in 1999, but the foundry updates their license. I have questions and call them. I am now bound by the new/updated EULA, right?\n\nI'd like more feedback on that question too.\n\n"
    },
    {
      "time": "10 Aug 2005 — 2:02pm",
      "content": "Tiffany, I was responding to this line of John's last post:\n\n_And that’s why I wouldn’t be too worried about making an OpenType version of faces I licensed from FS Canada._\n\nI would be worried about that, from a fair use perspective.\n\nAs to your question, T, I really don't know what the answer would be! I suspect that a foundry could include in its EULA a clause like, \"we reserve the right to modify our license at any time; this will not validate our agreement, etc.\" But I am not a lawyer. I don't know what any foundry's position is on this. I bet that Thomas, Si, or John Hudson would have better answers, though.\n\n"
    },
    {
      "time": "10 Aug 2005 — 2:35pm",
      "content": "Dan:  \nIn what way would fair use be violated if I acted within the agreement I made with FS when they took my money and mailed me a font? I would say that altering software to ensure fitness of purpose would be \"fairer\" than an after-the-fact prohibition on alteration.\n\nReally, please explain the fair use objection. When I made the agreement with FontShop, they were distributing literature (unsolicited—just because I was on their mailing list) telling me it was okay to alter fonts for personal use. I purchased a licence, sending the money to FS Canada. Um, would it not be \"fair\" for me to assume I was allowed to do what they said I could do?\n\nIf software vendors wish their agreements to have the force of contracts, they can't possibly expect be able to re-negotiate them without, well, negotiating. It doesn't take an Oliver Wendell Holmes to know that a binding agreement is binding on BOTH parties.\n\nI'm no lawyer, but I suspect that any contract that suggested \"we reserve the right to modify our license\" would, if it ever came to court, be difficult to defend. It would be tantamount to stating that the contract, as written, did NOT \"constitute the whole of the agreement\" (ever notice how often you see that in software agreements?). It would leave the whole thing up for grabs.\n\nYou can't have an agreement if one party says: \"I agree now, but I might not agree later\". That's not an agreement, that's a discussion.\n\n"
    },
    {
      "time": "10 Aug 2005 — 2:40pm",
      "content": "John, do you have a credit-card? :-/\n\nhhp\n\n"
    },
    {
      "time": "10 Aug 2005 — 2:48pm",
      "content": "Sorry, I don't follow. You mean the floating rates? Yeah, okay.\n\nBut, really, Dan's hypothetical EULA with a future modification clause is just that. I don't think any font vendor has ever stooped THAT low. I might be impatient with them, but I'm not about to lump them in with loan sharks and credit card companies!\n\n"
    },
    {
      "time": "10 Aug 2005 — 2:48pm",
      "content": "John, is the license from FS Canada, or FSI (FontShop International)? I believe that the FontFont library is owned by FSI. If that is so then FS Canada was merely the intermediary—your agreement was with FSI. If you had bought a font from a non FontShop-related foundry through FS Canada (Adobe, Monotype, Shinn, etc), your licenses wouldn't be voided just because FS Canada closed.\n\nLike I said, I really don't know what your situation was exactly. But even if the literature (flyers, etc) said that fonts were modifiable, those were the license. And it is the license that counts, isn't it?\n\nHave you asked anyone at FontShop in SF if they/FSI offer modification licenses? Some foundries will change your license to allow for modification for a specific fee. This would then be \"written permission.\" Other foundries don't do this, they probably don't want anyone to change their font data ever.\n\n"
    },
    {
      "time": "10 Aug 2005 — 2:57pm",
      "content": "Credit cards can do pretty much anything they want.\n\n\\> I don’t think any font vendor has ever stooped THAT low.\n\nMaybe, maybe not. But since few people read EULAs (that's why they're so long and cryptic, duh) they're more motivated to.\n\nhhp\n\n"
    },
    {
      "time": "10 Aug 2005 — 3:40pm",
      "content": "Oh, Dan, I've been in discussion for over a month with Fontshop in SF. See my previous posts above.\n\nAnd the issue of my 'legacy\" EULA isn't who it was with, it's what it allowed; and further, (as I've argued), what \\_it\\_ allowed, not what current FSI EULAs allow.\n\nI'm not suggesting that my licence is void, quite the contrary. I'm suggesting that it can't be annulled unilaterally. (I don't think FSI is planning to give me back my money.)\n\nAt least that's how I see it, unless you can further elucidate for me how it wouldn't be \"fair\" for me to exercise the rights an EULA gave me.\n\n"
    }
  ]
}
