{
  "id": "14270",
  "title": "GloroxyTech logo - close to Corel Glacier",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I have this typeface to find :-(\n\nIt is doing my nut :-(\n\nCorel’s Glacier is the closest I can find and Glyphic Neue is also similar, but not cutting the mustard…\n\nPLEASE HELP!!!!!!!!!!!! :-(\n\nJake :-)\n\n| Attachment | Size |\n| --- | --- |\n| [whatfont.jpg](http://web.archive.org/system/files?file=whatfont.jpg) | 11.89 KB |\n\n",
  "author": "gandalf123987",
  "time": "30 July, 2005 - 4:00pm",
  "uid": "8546",
  "comments": [
    {
      "time": " 30 July, 2005 - 4:27pm",
      "content": "I’m going to say that it’s “lettering”; that is to say a bit of custom type and not a typeface. Why? Because the “x” is symmetrical, the bar of the “t” is heavier than one might expect, and the crossbar of the small cap “h” is also heavy. It all says “constructed” to me. I’ll be surprised if it’s actually a font.\n\n"
    },
    {
      "time": " 31 July, 2005 - 12:06am",
      "content": "Thanks for the quick respone!! :-)\n\nI hadn’t thought of that… although they are a very small company and having met them cannot believe they are that clever ;-)\n\nIt’s definately got me scratching my head :-)\n\nThanks again :-)\n\n"
    },
    {
      "time": " 31 July, 2005 - 4:10am",
      "content": "It has the look of an old Letraset (Rubdown tansfer lettering) Catalog typeface. Do you have any idea when the mark was created? It might help with the ID\n\n"
    },
    {
      "time": " 31 July, 2005 - 1:22pm",
      "content": "Sorry… Not the first blue clue :-(\n\nI know I am not being much help, but I only stumbled over this site and forum after a whole day of searching the net for this font… :-(\n\n"
    },
    {
      "time": " 31 July, 2005 - 9:55pm",
      "content": "How about customizing [Gogobig](http://web.archive.org/web/20051110025658/http:/www.myfonts.com/fonts/bogusky2/gogobig/gogobig/testdrive.html?s=Chloroxy+tech&p=60)? It’s pretty close to start, so it might serve your purposes just to go ahead and try to slightly customize an existing font.. because as everyone else has already suggested with reasoning, this design seems to be lettered.\n\n"
    }
  ]
}
