{
  "id": "14304",
  "title": "LinkLetter",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[http://www.educationalfontware.com/HB\\_style.html](http://web.archive.org/web/20130529064103/http:/www.educationalfontware.com/HB_style.html \"http://www.educationalfontware.com/HB\\_style.html\")\n\n\"When you type using a cursive font, some of the letters aren't linked...All you have to do to get the proper connections is to run the LinkLetter program we supply you--after you have finished your typing.\"\n\nWhat is this \"auto-join\" software? Anyone have details, or used it?\n\n",
  "author": "Brian_",
  "time": "1 Aug 2005 — 8:44pm",
  "uid": "7208",
  "comments": [
    {
      "time": "2 Aug 2005 — 4:24am",
      "content": "I think it only works with their fonts.\n\n"
    },
    {
      "time": "2 Aug 2005 — 6:40am",
      "content": "Some cursive font makers (for example Signature Software) map the alternate cursive forms to upper ASCII characters (eg all those accented characters) they then use a macro to switch these alternates into a passage of text. Apart from being a bit of a hack, the text is not searchable or cut and paste-able, and if you switch fonts becomes gibberish. Another reason why OpenType is a better bet.\n\nSi\n\n"
    },
    {
      "time": "2 Aug 2005 — 7:06am",
      "content": "The Cursive handwriting font requires individual characters to have multiple beginning and ending strokes depending on the character pair combination used in a word. Around 1992 I designed and developed the typefaces for Zaner-Bloser Publishing who had the original drawing. Because the character set was limited I developed several font and a colleague designed a custom application to switch fonts on the fly. I assume this application is very similar.  \nYour right Si, OpenType would have made the project more interactive.\n\n"
    },
    {
      "time": "2 Aug 2005 — 7:59am",
      "content": "Yes, font-switching would provide more accessible results - cut and paste and search would likely work. I made this IE font embedding demo a few years back which used that technique.\n\ndetails - [http://www.microsoft.com/typography/web/embedding/demos/8/about8.htm](http://web.archive.org/web/20130529064103/http:/www.microsoft.com/typography/web/embedding/demos/8/about8.htm \"http://www.microsoft.com/typography/web/embedding/demos/8/about8.htm\")  \ndemo - [http://www.microsoft.com/typography/web/embedding/demos/8/demo8.htm](http://web.archive.org/web/20130529064103/http:/www.microsoft.com/typography/web/embedding/demos/8/demo8.htm \"http://www.microsoft.com/typography/web/embedding/demos/8/demo8.htm\")\n\nCheers, Si\n\n"
    },
    {
      "time": "2 Aug 2005 — 8:51am",
      "content": "a few years ago??? you made that about 1997!!\n\n==================================  \nI'm a Londoner, you can't scare me.\n\n"
    },
    {
      "time": "2 Aug 2005 — 9:32am",
      "content": "As any Beiruti will tell you: You don't have to be scared to be in danger.\n\nhhp\n\n"
    },
    {
      "time": "2 Aug 2005 — 3:17pm",
      "content": "\\> you made that about 1997!!\n\nYou're right, how time flies when you're having fun.\n\n\\> You don’t have to be scared to be in danger.\n\nYou don't have to be in danger to be scared.\n\nCheers, Si\n\n"
    },
    {
      "time": "2 Aug 2005 — 3:21pm",
      "content": "\\> You don’t have to be in danger to be scared.\n\nWow, that's good, Simon.\n\nhhp\n\n"
    }
  ]
}
