{
  "id": "14320",
  "title": "Apple's Mighty Mouse",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hmm, I still remember an [an old thread about mouse(s)](http://web.archive.org/web/20131106084211/http:/www.typophile.com/forums/messages/4100/17677.html?1064937003), wishes for a one-button mouse with a scrollwheel and oddball sites that scroll horizontally (making you wish a horizontal scrollwheel).\n\nFast forward today, [Apple introduces Mighty Mouse](http://web.archive.org/web/20131106084211/http:/www.apple.com/mightymouse/). Not single buttoned anymore. Well, sort of...\n\nI'm waiting for reviews :)\n\n",
  "author": "boole",
  "time": "2 Aug 2005 — 12:58pm",
  "uid": "1393",
  "comments": [
    {
      "time": "2 Aug 2005 — 1:30pm",
      "content": "Yes. I just saw this. Looks very intriguing. I'm also curious to hear what users have to say.\n\n"
    },
    {
      "time": "2 Aug 2005 — 2:10pm",
      "content": "Where's the type?\n\nhhp\n\n"
    },
    {
      "time": "2 Aug 2005 — 2:12pm",
      "content": "I want one!  \n\\_\\_  \n [www.typeoff.de](http://web.archive.org/web/20131106084211/http:/www.typeoff.de/ \"www.typeoff.de\")\n\n"
    },
    {
      "time": "2 Aug 2005 — 2:12pm",
      "content": "The type is under the mouse just below the Apple logo, set in Myriad I believe :-)\n\nChrisL\n\n"
    },
    {
      "time": "2 Aug 2005 — 2:31pm",
      "content": "The type is alway is Chris, its their current corporate standard. No offense intended\n\n"
    },
    {
      "time": "2 Aug 2005 — 3:15pm",
      "content": "Dan,  \nI don't understand your post but I am sure there is no offense taken. I was just joking about Hrant's post so nothing serious anyway.\n\nChrisL\n\n"
    },
    {
      "time": "2 Aug 2005 — 10:56pm",
      "content": "Dan, I believe you were actually drunk when you typed that last post. ;)\n\n"
    },
    {
      "time": "2 Aug 2005 — 11:14pm",
      "content": "Kyle, your comment cracked me up! :)\n\n"
    },
    {
      "time": "3 Aug 2005 — 5:01am",
      "content": "I want to test drive one of these. I'm having a hard time believing that I won't constantly set off the mouse buttons unintentionally when I'm tapping my fingers, etc.\n\n"
    },
    {
      "time": "3 Aug 2005 — 11:58am",
      "content": "Speaking of mouses, does the lamebrain pointer acceleration on MacOS bother anybody else? I know there must be a lot of Mac users on this site. Well I use both PC and Mac at work, and jumping over to Mac gives me a sensation of slamming my fingers in a door because of how the mouse pointer responds.\n\nIf anybody relates to what I'm talking about, well here's a brand new fix that doesn't require USB Overdrive.  \n [http://www.knockknock.org.uk/mac/](http://web.archive.org/web/20131106084211/http:/www.knockknock.org.uk/mac/ \"http://www.knockknock.org.uk/mac/\")\n\nAnd for anyone who is interested, here's a totally rad \"Pointer Ballistics\" white paper from a company that got it right.  \n [http://www.microsoft.com/whdc/device/input/pointer-bal.mspx](http://web.archive.org/web/20131106084211/http:/www.microsoft.com/whdc/device/input/pointer-bal.mspx \"http://www.microsoft.com/whdc/device/input/pointer-bal.mspx\")  \n\\_\\_  \nHeck Ya™\n\n"
    },
    {
      "time": "3 Aug 2005 — 12:13pm",
      "content": "Finally, after twenty-five years, Steve Jobs has conceded that Mac users are NOT morons, and can handle more than one button...\n\n"
    },
    {
      "time": "3 Aug 2005 — 12:26pm",
      "content": "I guess I will have to own up to the Moron quotient. I really like one button mouse and the pointer acceleration. Mostly, I like the mouse feel when drawing on a Mac. I HATE when I have to use a PC. Different strokes, as they say.\n\nChrisL\n\n"
    },
    {
      "time": "3 Aug 2005 — 12:42pm",
      "content": "Chris, I didn't say that Mac users were morons, but it appears that that's the assumption Jobs and Wozniak made when they opted for a one-button mouse (they looked at several other alternatives).\n\nThe best tool is the one that works for you. I do most of my work on PCs, and the Mac's lack of right-clickability bugs me (yes, I know about control+click, but it slows me down). PC programs also generally have a lot more keyboard shortcuts built in, which I also appreciate. But that's just me...\n\n"
    },
    {
      "time": "3 Aug 2005 — 1:04pm",
      "content": "Nick,  \nI know you didn't say Mac users were morons. It is just my sense of humor to poke fun at myself :-)  \nNo sweat by me.\n\nChrisL\n\n"
    },
    {
      "time": "3 Aug 2005 — 1:36pm",
      "content": "I doubt The Woz was of the same mind as Jobs - and that's probably why he ended up leaving. Wozniak was one of the original old-school personal computer geeks, relishing the complexity of the new tool. Jobs is just a sweet-smelling technocRAT.\n\nhhp\n\n"
    },
    {
      "time": "3 Aug 2005 — 1:46pm",
      "content": "Being a convert from PCs to Macs I always preferred (and still do) the right click mouse on a PC. I started to like Macs more, but given that my iMac won't start anymore, Macs include virtually no troubleshooting manuals, no diagrams detailing how to do simple tasks (like adding RAM) and offer very little MANUAL commands in the event of system failure, I'm getting a bit fed up with Apple's sleekness. Style means jack if the device doesn't function properly. I'm sure at the very least the new mouse will \"look cool\".\n\n"
    },
    {
      "time": "3 Aug 2005 — 2:05pm",
      "content": "Not to mention the pukey screen type.  \n\"But dude, the sheen on that titanium lid is pure ice, dude!\"\n\nhhp\n\n"
    },
    {
      "time": "3 Aug 2005 — 2:13pm",
      "content": "Terry,  \ncontrol-option-escape or else just hold the restart button down for 10 seconds.\n\nChrisL\n\n"
    },
    {
      "time": "3 Aug 2005 — 2:23pm",
      "content": "The lack of right click doesn't slow me down. When you use it constantly, it no big deal, know where the cntrl key is. What else are you doing with your other hand? If you can draw type and lasso vectors all at the same time, you got it made.\n\n"
    },
    {
      "time": "3 Aug 2005 — 2:28pm",
      "content": "Thanks Chris, but my computer won't acutally start up. I was just told by an Apple tech on the phone that I'm going to have to get my HD replaced. Goody, goody.\n\n"
    },
    {
      "time": "3 Aug 2005 — 2:28pm",
      "content": "\\> What else are you doing with your other hand?\n\nTea.\n\nWhy not use more fingers on your god-given hand?  \nTo make Minimalists in overpriced eyeglasses happy?\n\nhhp\n\n"
    },
    {
      "time": "3 Aug 2005 — 2:42pm",
      "content": "A few years ago I had a long web development project on-site and had to use a PC with a multi-button mouse for 10 hours a day for 9 months. No, I did NOT have a baby but I did get a serious case of Carpal Tunnel. After going back to my minimalist-modernist-capitalist-americanist-yuppyist-designerist Mac my troubles faded away. I was happy and the world became a better place. I guess I should have stuck with the royalist-boumaist-communist-holyerthanthouist-virusist-securityleakist PC and retired on a disability :-)\n\nChrisL\n\n"
    },
    {
      "time": "3 Aug 2005 — 2:49pm",
      "content": "\"virusist\"\n\nYes...this makes PCs for me difficult to deal with. I think I'll just ditch computers altogether and go write in the sand. I don't need no stinkin' silicon middle man.\n\n"
    },
    {
      "time": "3 Aug 2005 — 3:01pm",
      "content": "\"I don’t need no stinkin’ silicon middle man\"\n\nLove it Terry!!! LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": "3 Aug 2005 — 4:02pm",
      "content": "The only Apple product I own is an iPod Mini. I bought it because its small and holds three gigs on mp3s. Fortunately, I haven't had any trouble with the interface, but iTunes is another story. Once I found out all it was good for was clicking on glossy buttons, I had to open its system files and delete them with extreme pregidous. It wouldn't allow me to export mp3s from the iPod! Useless! (theft protection? give me a break.)\n\nSo, bluntly, there's no way in Hell I would buy an iComputer.\n\nOr its silly, silly iMouse.\n\n"
    },
    {
      "time": "3 Aug 2005 — 5:29pm",
      "content": "Just tried it out at the Apple store here in Columbus, Ohio. Very nice. The whole two-button reaction — without having two buttons — actually works. Ordering one in 3, 2, 1...\n\n"
    },
    {
      "time": "4 Aug 2005 — 4:28am",
      "content": "While I'm airing gripes about Macs, one thing that REALLY bugs me about OS X is its refusal to give an explanation when an operation fails, particularly when copying a file with a name that longer than 32 characters or when trying to write to a full disk. A little feedback about the exact nature of the problem is always helpful.\n\n"
    },
    {
      "time": "4 Aug 2005 — 7:27am",
      "content": "Pottspotts,  \nTry this (there are other software apps that do the same thing a little searching should find them) I haven't used it and since I am Mac based I am unlikely to, so I can make no claims for it. Still it might calm you down :)\n\n[http://www.ipodaccess.com/ipodaccess/indexWin.html](http://web.archive.org/web/20131106084211/http:/www.ipodaccess.com/ipodaccess/indexWin.html \"http://www.ipodaccess.com/ipodaccess/indexWin.html\")\n\nI'm also going to stick with a single button mouse, I tried a 5 function mouse on a pad for a while but found that most of the buttons only worked intermittently and did different things in different software.  \nTim\n\n"
    },
    {
      "time": "4 Aug 2005 — 10:07pm",
      "content": "Mr. Jobs,\n\nIt's about friggin' time.\n\n(By the way scroll-wheel fans, horizontal scrolling is possible with any wheeled mouse (in Mac OS X) by holding the shift key while scrolling.)\n\n"
    },
    {
      "time": "4 Aug 2005 — 10:11pm",
      "content": "Mr. Jobs,\n\nWait a second... $49 and it's not even bluetooth? What are you thinking?\n\n"
    },
    {
      "time": "4 Aug 2005 — 10:55pm",
      "content": "This thread is all over the place but for what it's worth, I know someone who bought one and this is what he had to say:\n\n_Well so far it's been just trying to say something new about what is essentially just a mouse._\n\nRan the installer which required 152mb of space?!! Mighty is not the word.  \nRestarted and set up the preferences to use the scroll ball as Expose--\\> Show desktop and the side buttons to Expose--\\>Show all windows\n\nThe scroll ball is quite springy in that pressing down. I was expecting it to be quite rigid but any amount of force will press it down into it's hole. I would wonder about the durability of this as it does seem mounted on a soft spring. The side buttons do require a good squeeze between the thumb and ringfinger. The sound they emit is very quiet though the scroll ball sound is very realistic\n\nI have put up the tacking speed on everything to it's highest as I like a fast mouse. The right click action is identical to the action I use on the intellimouse.  \nBeen using it in Photoshop/Preview in place of the usual spacebar action to move around the document and it works well though a bit jerkier.It means a quicker workflow in some instances.\n\nThe short cord is actually good for powerbook users as I use it on the right with the cord plugged in on the left hand side. It definitely would be awkard plugging it into a g5 under the desk and using it that way.\n\nAll in all a good mouse for creative work but I'll have to road test it a bit more.\n\nHe's an icon designer, if you were wondering.\n\n"
    },
    {
      "time": "5 Aug 2005 — 12:24am",
      "content": "_Finally, after twenty-five years, Steve Jobs has conceded that Mac users are NOT morons, and can handle more than one button…_\n\n...so long as it doesn't _look_ like more than one button.\n\nMy mouse is designed by [Philip S+arck](http://web.archive.org/web/20131106084211/http:/www.microsoft.com/hardware/mouseandkeyboard/productdetails.aspx?pid=027), and looks like it just came in from Alpha Centauri. I only bought it because my old Logitech mouse died and this was the only one in the shop that night with similar functionality (I don't trust wireless mice). But it turns out to be a really excellent mouse, and I'm enjoying using it.\n\n"
    },
    {
      "time": "5 Aug 2005 — 12:28am",
      "content": "Hmm. If the edit function were restored I would go back and correct my spelling of Philippe S+arck's name.\n\n"
    },
    {
      "time": "5 Aug 2005 — 4:57pm",
      "content": "_Wait a second… $49 and it’s not even bluetooth? What are you thinking?_\n\nMy thoughts exactly. It's not even wireless!\n\n"
    },
    {
      "time": "6 Aug 2005 — 7:57am",
      "content": "_Wait a second… $49 and it’s not even bluetooth? What are you thinking?_\n\nMaybe he's thinking \"let's not make this one eat batteries.\"\n\nBluetooth is a nightmare. One of the worst examples of Engineering By Committee. Someone just wrote a Linux program that lets you break into the Bluetooth Audio channel used by new luxury cars for their speakerphone function and yell at the driver. \"Hey you in the Crackura! Pull your head out of (etc.)\"\n\nSo the Mighty Mouse is multiple button yet it isn't. This is ultimately a concession by Apple. The first thing I do when I get a Mac is hook up a four-button PC trackball. I'll see if this new one is better than discrete buttons.\n\n"
    },
    {
      "time": "6 Aug 2005 — 9:23pm",
      "content": "I wanna bluetooth VR headset.\n\n"
    }
  ]
}
