{
  "id": "14322",
  "title": "Please help in my Baskerville dilemma!",
  "forum": "Design",
  "tags": [

  ],
  "content": "My organisation uses [Baskerville](http://web.archive.org/web/20071111142943/http:/www.typophile.com/wiki/Baskerville) in its identity. There are ten distinct branches; the attachments show the central office and (in better clarity) one of the regional offices. You can find out more here:\n\n[http://www.gos.gov.uk](http://web.archive.org/web/20071111142943/http:/www.gos.gov.uk/ \"http://www.gos.gov.uk\")\n\nAll are part of the UK government.\n\nI’ve recently been asked, in my capacity as a designer at one of the offices, to help with branding guidelines. The current branding was issued in 1994, and is in use at 11 offices across England, each employing about 300 people (so maybe 3500 total). It appears on business cards, signage, stationery, PowerPoint presentations and everything else you’d associate with a large corporation.\n\nGiven the installed base, I can’t recommend substantial alteration to the identity. But I am considering resetting the text. You’ll have noticed it uses artificial small caps: in my opinion, this is a poor choice, particularly as the ITC New Baskerville used has a [small caps version](http://web.archive.org/web/20071111142943/http:/www.myfonts.com/fonts/agfa/itc-new-baskerville/). Thus, I’m considering the following options:\n\n1. Leave everything as it is. This is cheapest, and no hassle.\n\n2. Switch to ITC New Baskerville (small caps), and recommend upgrading all signage, stationery and so on immediately at considerable expense.\n\n3. Switch to ITC New Baskerville (small caps), and recommend that it’s implemented when possible (eg. change website immediately, b/c on next order, signage can remain).\n\n4. Recommend switching to one of the [other](http://web.archive.org/web/20071111142943/http:/www.myfonts.com/fonts/storm/john-baskerville/john-baskerville/) [baskervilles](http://web.archive.org/web/20071111142943/http:/www.myfonts.com/fonts/agfa/baskerville-mt/) [available](http://web.archive.org/web/20071111142943/http:/www.emigre.com/EFoIMrsOT.php), and either update all immediately (as 2) or when necessary (as 3).\n\nLet me know your thoughts, and arguments for or against change. I need to make a presentation on this a week today; after that, I’d need to get buy-in at director level. Change is possible, but I need to project a very cogent case.\n\n| Attachment | Size |\n| --- | --- |\n| [natlogo.jpg](http://web.archive.org/web/20071111142943/http:/typophile.com/files/natlogo.jpg) | 8.73 KB |\n| [gonw.png](http://web.archive.org/web/20071111142943/http:/typophile.com/files/gonw.png) | 22.26 KB |\n\n [‹ Results & Guaranteed: A visual representation](http://web.archive.org/web/20071111142943/http:/www.typophile.com/node/14452 \"Go to previous forum topic\") [Futura SC question ›](http://web.archive.org/web/20071111142943/http:/www.typophile.com/node/14204 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071111142943/http://www.typophile.com/user/8589\" title=\"View user profile.\">m-ga</a>",
  "time": "<br>",
  "uid": "8589",
  "comments": [
    {
      "time": " 2.Aug.2005 1.37pm",
      "content": "Well, IMHO \\*any\\* Baskerville is better than ITC’s... I think Adobe’s Berthold Baskerville has a lot more character and is probably more usable in an office environment (due to less contrast). Addin g the Book variant to the mix gives you even more options.  \nBTW: These are available as OpenType.\n\n"
    },
    {
      "time": " 2.Aug.2005 1.38pm",
      "content": "4.b — Switching to ’ [John Baskerville](http://web.archive.org/web/20071111142943/http:/www.stormtype.com/jbasker.html)’, by František Štorm..\n\n[www.typophile.com/wiki/Baskerville](http://web.archive.org/web/20071111142943/http:/www.typophile.com/wiki/Baskerville)\n\nDav, [formlos](http://web.archive.org/web/20071111142943/http:/www.formlos.net/)\n\n"
    },
    {
      "time": " 2.Aug.2005 1.39pm",
      "content": "Storm’s Baskerville is a lovely, complete system, that even has a sans version. It has a great deal of flexibility, extensive language support, and is available in Type 1 and OpenType.\n\nYou’d have to test it out, but I bet you could implement in stages, a la your option 3, without anyone noticing.\n\n"
    },
    {
      "time": " 2.Aug.2005 1.49pm",
      "content": "i cast my vote for [storm's](http://web.archive.org/web/20071111142943/http:/www.typophile.com/wiki/storm%252Btype%252Bfoundry) john baskerville as well, if you’re able to make a switch. i would advise against setting text in [mrs eaves](http://web.archive.org/web/20071111142943/http:/www.typophile.com/wiki/mrs%252Beaves).\n\n"
    },
    {
      "time": " 2.Aug.2005 1.55pm",
      "content": "Thanks for the comments so far. Do you really think I can implement in stages without anyone noticing?\n\nBear in mind also that it will being used for display only, as the attachments I sent. Largest size will be A0 signage, smallest size a business card (or web graphic). Maybe I need different versions to cope with this.\n\n"
    },
    {
      "time": " 2.Aug.2005 2.04pm",
      "content": "By the way, could someone with these fonts send me the text “Government Offices for the English Regions” in small caps? I’d understand if you don’t want to send outlines, but a PNG at least as good as PDF specimen sheets would save me heaps of time making a presentation.\n\n"
    },
    {
      "time": " 2.Aug.2005 4.42pm",
      "content": "I just looked at Storm’s JB—gorgeous stuff! I didn’t see any sans though John.\n\nChrisL\n\n"
    },
    {
      "time": " 2.Aug.2005 5.25pm",
      "content": "It’s called John Sans.\n\n"
    },
    {
      "time": " 2.Aug.2005 6.27pm",
      "content": "Thanks! I’ll check it out.\n\nChrisL\n\n"
    },
    {
      "time": " 2.Aug.2005 7.31pm",
      "content": "well if it’s all display, mrs eaves might actually be a good choice. if you want previews, you should be able to set thing using myfont.com’s preview panel\n\n"
    },
    {
      "time": " 2.Aug.2005 10.24pm",
      "content": "If you need an “authentic” but functional Baskerville, I think the ITC cut is great (although the italic sucks). If you want something attractive that’s in the genre, Mrs Eaves is your lassie (just make sure to space everything manually).\n\nhhp\n\n"
    },
    {
      "time": " 3.Aug.2005 6.20am",
      "content": "Storm’s [Baskerville Ten](http://web.archive.org/web/20071111142943/http:/www.myfonts.com/fonts/storm/baskerville-ten/) is also worth a look for smaller sized usage.  \nTim\n\n"
    },
    {
      "time": " 3.Aug.2005 7.03am",
      "content": "Here’s what I’ve got so far:\n\n[http://gtmail.150m.com/baskervilles.gif](http://web.archive.org/web/20071111142943/http:/gtmail.150m.com/baskervilles.gif \"http://gtmail.150m.com/baskervilles.gif\")\n\nI found some Baskervilles not previously mentioned (look near the top of [this page](http://web.archive.org/web/20071111142943/http:/jeff.cs.mcgill.ca/~luc/choice.html)), including Timberwolf’s Baskerville 1757. My graphic compares this with ITC New Baskerville, Storm’s John Baskerville, and Mrs Eaves.\n\nTwo Baskervilles I couldn’t find samples of, and would have considered, are the [Berthold](http://web.archive.org/web/20071111142943/http:/www.bertholdtypes.com/bq_library/90131.html) and [Monotype](http://web.archive.org/web/20071111142943/http:/www.fonts.com/findfonts/detail.htm?pid=243211) versions. Are these worth pursuing?\n\nSo far, I’m favouring ITC New Baskerville, since it’s nearest to what we’re already using. The Storm design has a low small caps height, which I’m not keen on. I do really like Mrs Eaves, although it’s a bit of a departure. Viewed with the arms, they look like this:\n\n[http://gtmail.150m.com/Arms-version.gif](http://web.archive.org/web/20071111142943/http:/gtmail.150m.com/Arms-version.gif \"http://gtmail.150m.com/Arms-version.gif\")\n\nI think what I might do, rather than giving the decision makers the choice between artificial small caps (as we have now) and genuine small caps, is to give them the choice between ITC small caps and Mrs Eaves. I’d be happy with either.\n\n"
    },
    {
      "time": " 3.Aug.2005 8.01am",
      "content": "\\> give them the choice between ITC small caps and Mrs Eaves.\n\nSounds like a plan. There is such a thing as freedom **from** choice too!\n\nTo me, Mrs Eaves looks more attractive, but the ITC is more British.\n\nBTW, those links need a “www” to work.\n\nhhp\n\n"
    },
    {
      "time": " 3.Aug.2005 8.27am",
      "content": "[Berthold](http://web.archive.org/web/20071111142943/http:/www.bertholdtypes.com/bq_library/90131.html)  \n [Monotype](http://web.archive.org/web/20071111142943/http:/www.fonts.com/findfonts/detail.htm?pid=243168)  \nYour first link is not working.  \nThe ITC version of the Arms is looking better than Mrs Eaves which looks a bit lacking in contrast, however the ITC version needs some attention paid to the kerning.  \nTim\n\n"
    },
    {
      "time": " 3.Aug.2005 8.43am",
      "content": "I’m temporarily without webspace. There are small versions of the files here:\n\n[http://mysite.wanadoo-members.co.uk/cdg/images/2-picture1.gif?0.52221832...](http://web.archive.org/web/20071111142943/http:/mysite.wanadoo-members.co.uk/cdg/images/2-picture1.gif?0.5222183262699215 \"http://mysite.wanadoo-members.co.uk/cdg/images/2-picture1.gif?0.5222183262699215\")\n\n[http://mysite.wanadoo-members.co.uk/cdg/images/2-picture2.gif?0.35300150...](http://web.archive.org/web/20071111142943/http:/mysite.wanadoo-members.co.uk/cdg/images/2-picture2.gif?0.35300150970408484 \"http://mysite.wanadoo-members.co.uk/cdg/images/2-picture2.gif?0.35300150970408484\")\n\nI would have uploaded them with the attachments feature, but it seems to be only for the opening post.\n\ntimd: I made these with the website samples, not worth spending time on kerining at this point.\n\n"
    },
    {
      "time": " 3.Aug.2005 9.11am",
      "content": "There is a small bug, I’m guessing, here that is causing that link you, M-ga, just posted not to work. Just include www in front and it works.\n\nAs much as I want to vote for Mrs. Eaves, and it could very well be that I’m biased, it just is too precious for use in a government situation. I vote for Storm, but scale the small caps up a hair more. And when I say hair, I mean 1 or 2 percent ... maybe 3.\n\n"
    },
    {
      "time": " 6.Aug.2005 3.12pm",
      "content": "Option 3.  \nAside from aesthetic considerations (I would go for ITC New Baskerville (small caps), anyway) there is no real argument for any other kind of change...’I’d like to change the identity to XXX typeface because it looks better’.. This is neither relevant, useful nor valuable.  \nFixing the error (artificial small caps) is useful, since ’auto small caps’ can be application dependent, i.e. default small caps values vary. I fail to see the point of specifying percentages for caps when there’s a well design small caps font in the family\n\n"
    },
    {
      "time": " 7.Aug.2005 11.31pm",
      "content": "A vote here for ITC.\n\n"
    }
  ]
}
