{
  "id": "14327",
  "title": "New logo for a digital photo lab",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I just stumbled across this site while looking for some ideas for a logo for our new Photo kiosk bar in my photolab. I was hoping somone might be able to give me some suggestions on improving our logo. We are required to use one of teh two Kodak logos I have attached (attachment 2 & 3) and our current logo is attachment 1. We have changed the tagline on the logo several times over the past 3 years.\n\nYour picture experts  \nYour film & Digital experts  \nYour digital picture experts  \n“Cleverly hidden on E. Johnstown Rd. at Hamilton Rd.”\n\nAny tips, pointers or suggestions?\n\nBen  \n [www.photoplus.us](http://web.archive.org/web/20060522215829/http:/www.photoplus.us/)\n\n| Attachment | Size |\n| --- | --- |\n| [sample.jpg](http://web.archive.org/web/20060522215829/http:/typophile.com/files/sample_7.jpg) | 530.79 KB |\n\n",
  "author": "<a href=\"user/8602\" title=\"View user profile.\">mcfotomgr</a>",
  "time": "<br>",
  "uid": "8602",
  "comments": [
    {
      "time": " 2 August, 2005 - 8:18pm",
      "content": "I would change the font to a clean sans-serif that complements the Kodak logo.\n\nI would also get rid of the centering, and experiment with putting the whole name on one line.\n\n"
    },
    {
      "time": " 3 August, 2005 - 4:59am",
      "content": "Take a look at Vista from Emigre. A nice Sans Serif face with character. I would make your company name prominate. Stack it above the Kodak logos where possible and make the Kodak logo a lot smaller. What is important isn’t the process or the equipment, or the potential client would just send their images straight to Kodak. Your company and your people make the difference. Kodak is just a trademark that they can trust.\n\nThe problem with your current typeface is it doesn’t look serious enough. It would be a great typeface for an ice cream vendor.\n\n"
    },
    {
      "time": " 3 August, 2005 - 8:29am",
      "content": "Does your relationship with Kodak mean you have certain guidelines for the placement, size-relationship, colour? Hobo is definitely not working for your logo.  \nTim\n\n"
    },
    {
      "time": " 3 August, 2005 - 6:29pm",
      "content": "The only restriction from Kodak is that we must use their logo (either the square one or the rectangle one) and that the two parts (their logo and our name/logo) must fall in between the 60%-40% mark. Theirs could be 60% or 40% of the entire logo or anything in between.\n\nActually the 60/40 is only for the sign out front but I would like the sign and the logo to compliment each other.\n\nBen  \n [www.photoplus.us](http://web.archive.org/web/20060522215829/http:/www.photoplus.us/)\n\n"
    },
    {
      "time": " 3 August, 2005 - 6:41pm",
      "content": "You know its sad. I created a logo for a friend of mine who also owns a photo lab and I like his much better. But as far as I’m concerned mine sucks.\n\nHeres his  \n [www.blossers.com](http://web.archive.org/web/20060522215829/http:/www.blossers.com/)\n\n"
    },
    {
      "time": " 5 August, 2005 - 7:10am",
      "content": "I think, given those restrictions, you should look at emphasising that you are a company who happens to use Kodak equipment, in other words your name should appear first when reading left to right or top to bottom, also consider a colour away from the red of Kodak. I would steer clear of using a similar shaped box, icon or typestyle (in fact I wouldn’t use any icon or swoosh, as it will probably clash with the Kodak logo). I am not suggesting you produce anything that looks like the two elements are fighting, more that you give your company a prominence that Kodak doesn’t need.  \nSo sketch out the areas/shapes that your logo will have if you work with a 50:50 split with the Kodak logo. Look at colours that could be an alternative to red without clashing (so that will cut out many greens), or being too light to read if printed on white (yellow), then try to create a shortlist of the kinds of typeface that you feel works for your company name.  \nHope this gives you a start.  \nTim\n\n"
    },
    {
      "time": " 5 August, 2005 - 8:06am",
      "content": "I have taken your comments to heart and reworked the logo. The new logo is attached in the original post as “sample” Please tell me what you think.\n\nBen\n\n"
    },
    {
      "time": " 5 August, 2005 - 12:06pm",
      "content": "The last two versions are better. Please don’t set your name verticaly. It looks like a mistake. Make it smaller and flush left with the word photo. If you can make it work have the Kodak Image Center Solutions appear after and not before your name. The version on the white background (color wise) works. If you insist on the red back ground make your name and Photo in white. Remember Stop signs are white type against a red background for a reason. They can be seen from far off. Also you have to make a white stroke around the blue Plus and stripes because the value of blue and red are the same. If you were to xerox the blue against the red on a black and white copier the Plus and stripes would disappear.\n\n"
    },
    {
      "time": " 5 August, 2005 - 5:28pm",
      "content": "OK, I think I like this one much better. Perhaps use both the red and the white or more accurately the dark background and teh light background. What do you think? Better?\n\nBen  \n [www.photoplus.us](http://web.archive.org/web/20060522215829/http:/www.photoplus.us/)\n\n"
    },
    {
      "time": " 7 August, 2005 - 3:46am",
      "content": "I think 3.2 represents an advance in that your company is dominant (although the ratio seems to have been reduced to 80:20 in your favour), the colours separate your business from the Kodak logo and the basics of your services are clear. However, the camera icon has a dated appearance and might be unnecessary, the speed lines might work better if they joined the P of Plus and tapered to the left or the slant that you presently have on the right could be moved to the left. The black outline on the white out text could also be viewed as unnecessary, if you decide that you prefer to retain the outline perhaps you could look at making them of equal weight. In the strapline I suggest that you use an en dash instead of a hyphen and consider whether developing is a term that customers would accept in place of, for example, processing which has more correlation with digital photography and still relates to the developing and printing of film. I am not clear on your intentions for using both but I would advise against it in order to retain a single identity, if you are concerned about the background to which you are applying your logo you could look at using a white border on the red box and reverse out the type for a dark background. My overall view is that in order to produce a logo which sits comfortably with the set element (the Kodak logo) you should go with a simple style.  \nTim\n\n"
    }
  ]
}
