{
  "id": "14330",
  "title": "Underware",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi to all,\n\nI wish to hear your opinions about one of the newest type foundries who follows the same direction of humanist emotional connotations who inspired me everyday on my latino vernacular handpainted neighbourhood signage.  \nI think that the sense of humor and the emotional relation of his products samples design to his customers its a great strategy.  \nThe Logo brand its a handpainted swashy lettering who is very similar to some humoristic comercial signage here in Chile..  \nI think that Sauna and Dolly are the better works from Underware until now, because they are very versatile. Auto its a great work too but its ductos is maybe too much squared and geometrical. Bello pro its a nice Display font but i think that its very hard to read..maybe they can do a better version keeping the same flavour but adding more functionality as a type. I wish to add some critique to his display works because i feel that i am in the same way or direction to this guys and i like to see more and more type designs like Dolly and Sauna from independent designers.\n\nBTW, i like to know which method use Underware to design fonts, they work in group right?  \nPersonally i wish to be oriented to get sucessful finished fonts with a similar way of work..\n\nBest,\n\nmh.\n\n [‹ How to make font design fun?](http://web.archive.org/web/20080828000542/http:/www.typophile.com/node/14289 \"Go to previous forum topic\") [A critique of the (Latin) alphabet at SpeakUp ›](http://web.archive.org/web/20080828000542/http:/www.typophile.com/node/14387 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080828000542/http://www.typophile.com/user/1109\" title=\"View user profile.\">Miguel Hernandez</a>",
  "time": "<br>",
  "uid": "1109",
  "comments": [
    {
      "time": " 3.Aug.2005 12.16am",
      "content": "Underware’s work is definitely amazing. If you haven’t seen their workshop stuff you should totally check it out. The projects provide a good insight into the way they approach type. [www.typeworkshop.com](http://web.archive.org/web/20080828000542/http:/www.typeworkshop.com/ \"www.typeworkshop.com\") They also published a little booklet called five point that is a good read, I think you can still order it.\n\n"
    },
    {
      "time": " 3.Aug.2005 3.55am",
      "content": "dito on the [5 Pts. booklet](http://web.archive.org/web/20080828000542/http:/www.underware.nl/site2/index.php3?id1=underware&id2=publications&id3=pts&id4=5pts&id5=general). nice read / must have. you can still get it. and as said before, visit their workshops.\n\n"
    },
    {
      "time": " 3.Aug.2005 4.58am",
      "content": "I’ve become completely enamoured with Underware’s work, particularly Dolly, Sauna, and Bello. I got my hands on their Dolly and Sauna specimen books w/ free trial versions of the fonts (what a great idea) and 5 pts at TypeCon. I opened up my laptop on the way home and started playing with the fonts. Underware just seem to be genuinely enjoying and loving what they do and having mischievous fun, while still doing great work. On top of that, they’re teaching students how to do the same thing. Their font specimens are full of funny and interesting writing, not just strings of meaningless words, another reason I like getting my hands on their stuff.\n\nMy appreciation of their work has a lot to do with what I know of Undeware as a whole, not just how much I like the fonts. Their work has been instrumental in getting my ass in gear on a font, as well.\n\nSo, yeah. I like Underware.\n\n"
    },
    {
      "time": " 3.Aug.2005 7.07am",
      "content": "Underware´s classes looks very fun and i receive an email a couple of months ago, with the idea of make online type clases too in the near future.  \nI wish to find the way that the underware team works for building his fonts; they are Akiem Helmling, Bas Jacobs and Sami Kortemäki. Who is the specific work of each one?\n\n"
    },
    {
      "time": " 3.Aug.2005 12.10pm",
      "content": "Nobody thinks the same in any way?\n\n"
    },
    {
      "time": " 3.Aug.2005 2.41pm",
      "content": "I always follow they workshop and other stuff like typereadio at typecon 2005 showing some black gothic new font in action. It´s anyone informed about how Underware work with the elaboration of his fonts? I don´t know if any media related magazine or website have interview the underware guys asking similar questions..i am looking forward to know more about them.\n\nBTW, its a good idea for Typographica or Typophile to make posts dedicated to interview or make questions to typographers, foundries or people who are interesting to learn with.  \nMaybe a new forum called “Interviews”, depends if the typographers are available or open to respond direct questions from users of the forums.\n\nI think that they first Underware workshops rules. Making type solutions for common design issues in a fun way, its something that i wish to take too for a model of education in graphic design classes too.\n\n"
    },
    {
      "time": " 3.Aug.2005 3.38pm",
      "content": "Miguel, _[font 004](http://web.archive.org/web/20080828000542/http:/www.typophile.com/wiki/font%252Bmagazine)_ features an article on Underware including some info on their working style. Email me your address and I’ll get one to you.\n\n"
    },
    {
      "time": " 3.Aug.2005 4.47pm",
      "content": "Amazing Stephen. Thank you.\n\n"
    },
    {
      "time": " 4.Aug.2005 8.09am",
      "content": "Miguel, I also am just bowled over the brilliance and freshness of the Underware work—and like you I prefer Dolly and Sauna, for the same reasons you give.\n\nAccording to the article Stephen refers to (half in reversed type, white out of mauve, not even bolded—give me a break!) the three work as a true collaborative.\n\nAnd there is this: “[Sami] mentions the importance of the Royal Academy’s practical approach of hand sketching, where the student learns to trust hand and eye.”\n\nHrant is always railing against “chirography”, type influenced by the hand, but judging by Underware we should more often let go of the mouse, and pick up the pencil. (I know, I know, sketching type and writing are two different things.)\n\nI asked to Karsten Luecke (part of the amazing Village collective, including Underware) at TypeCon: “These Underware guys are so amazing, where \\*do\\* they come from?” His answer: “Holland, of course.” Judging by the students and students of students of G. Noordzij, I am sure going to reread his book Letterletter again, and read the one about to come out in English.\n\n"
    },
    {
      "time": " 4.Aug.2005 8.29am",
      "content": "\\> judging by Underware we should more often let go of the mouse\n\nThat’s your consciousness talking. Which is only half the story of Man.\n\nBTW, I myself have always liked Underware’s style.  \nBut I wait for the day they will set foot in the dark side.\n\nhhp\n\n"
    },
    {
      "time": " 4.Aug.2005 9.22am",
      "content": "_“Holland, of course.”_\n\n[Sami Kortemäki](http://web.archive.org/web/20080828000542/http:/www.underware.nl/site2/index.php3?id1=underware&id2=general&id3=sami) is as Finnish as [sauna](http://web.archive.org/web/20080828000542/http:/peacecountry0.tripod.com/sauna.htm). :)\n\n"
    },
    {
      "time": " 4.Aug.2005 9.40am",
      "content": "\\>Sami Kortemäki is as Finnish as sauna. :)\n\nYeah, but went to school at the Royal Academy in the Hague. Its the the person and the school, more than the nationality.\n\n"
    },
    {
      "time": " 4.Aug.2005 9.42am",
      "content": "William,\n\nGetting good education like that would probably turn me Dutch too!\n\n"
    },
    {
      "time": " 4.Aug.2005 10.10am",
      "content": "Yes it would! I think that was Karsten’s point—only one of the three is Dutch, but all three studied and met at KABK.\n\n"
    },
    {
      "time": " 4.Aug.2005 10.12am",
      "content": "<cite>But I wait for the day they will set foot in the dark side.</cite>\n\nDoes Unibody count even a little?\n\n"
    },
    {
      "time": " 4.Aug.2005 10.17am",
      "content": "Unibody? How so? To me, the most significant thing about Unibody is that the italic doesn’t work. But maybe I’m missing something?\n\nhhp\n\n"
    },
    {
      "time": " 4.Aug.2005 10.46am",
      "content": "Ever heard of “formative period”? Sami grew up in Finland (I’m presuming), not Holland. OF COURSE that’s relevant.\n\nhhp\n\n"
    },
    {
      "time": " 4.Aug.2005 12.15pm",
      "content": "\\>OF COURSE that’s relevant.\n\nYes, it’s relevant. How relevant depends on the person. As I said, person, school, nationality, in that order. If nationality is emotionally important to the person it becomes more important. But school, and here I mean the formative, professional schooling (eg graduate school for academics,) I think often trumps nationality, when the person is working in the profession.\n\nRightly or wrongly, I associate rather austere, pristine beauty with Dutch, German and Finnish design. Underware has that discipline of northern Europe craft, but the exhuberance of Mediteranean countries. I think their freedom from national stereotype is part of their charm.\n\n"
    },
    {
      "time": " 4.Aug.2005 12.38pm",
      "content": "1) Childhood formation is deeply active, whether we like it, realize it, or not.  \n2) A more accurate order is: parenting, ethnicity, school.  \n3) I don’t see Underware/Holland being very similar to Finland.  \n4) Underware is waaay more Dutch than Mediterranean.\n\nhhp\n\n"
    },
    {
      "time": " 4.Aug.2005 12.47pm",
      "content": "_A more accurate order is: parenting, ethnicity, school_\n\nUnfortunately, the influence of school is being hijacked by the push for standardized testing in American schools. Far from being independent, school curricula are increasingly being dictated by the test-writers, who tend to have their own agenda to promote.\n\n"
    },
    {
      "time": " 4.Aug.2005 12.53pm",
      "content": "I think we are talking about graduate school work in this case, Nick. More specifically type design. — I for one can totally see the “Gout Hollandaise” in students coming on of the KABK and I love it!\n\n"
    },
    {
      "time": " 4.Aug.2005 1.35pm",
      "content": "FYI, I researched Dolly a bit for a project and noticed that Pierre Huyghe & Philippe Parreno had set a book in the face.\n\nVerlag der Buchhandlung Walther König, Köln  \nISBN: 3-88375-664-4\n\n"
    },
    {
      "time": " 4.Aug.2005 5.06pm",
      "content": "Hi William, thank you for mention handdrasw type.  \nI use to draw type by hand, almost 45 minutes every day..i am addict to draw letterforms.  \nThere are one big important thing that i like about Ultrafonts vision. To conect venecian and roman proportions with a cute small exageration in some letters..i think that this combination is my personal conection with vernacular signage here in my town. I think its amazing to feel that the same forms are present in other cultures. It seems like the innocent child face like cute proportions are universal principles of design who will be always recognised as fresh, nice, cool, fun and friendly.\n\n"
    },
    {
      "time": " 4.Aug.2005 5.43pm",
      "content": "<cite>How so?</cite>\n\nIt’s made out of boxes?\n\n"
    },
    {
      "time": " 4.Aug.2005 6.03pm",
      "content": "I don’t get it. Maybe my humor chip needs an upgrade?\n\nhhp\n\n"
    },
    {
      "time": " 4.Aug.2005 6.15pm",
      "content": "Jackson, there is a book who shsow this child face principle, check it out:  \nUniversal Principles of Design.  \n [http://www.amazon.com/exec/obidos/tg/detail/-/1592530079/104-2310075-332...](http://web.archive.org/web/20080828000542/http:/www.amazon.com/exec/obidos/tg/detail/-/1592530079/104-2310075-3321548?v=glance \"http://www.amazon.com/exec/obidos/tg/detail/-/1592530079/104-2310075-3321548?v=glance\")\n\nBtw, Underware´s (eccept dolly, Bello and sauna) seems to be in different styles. That´s pretty good for new horizons experimentations but i really want to believe that they are back in good text fonts instead of been near to HouseInd fashionist display fonts.  \nIts this the dark side?\n\n"
    },
    {
      "time": " 4.Aug.2005 8.41pm",
      "content": "I might be totally wacked, but, aren’t there a TON of good text fonts already? I’m assuming that Underware will continue to develop text fonts alongside of good decorative fonts, but, i personally really like the decorative directions they’re taking.\n\nIf they continued to put out more display fonts than they did text fonts, that would be OK with me.\n\n: )\n\n"
    },
    {
      "time": " 4.Aug.2005 9.42pm",
      "content": "\\> aren’t there a TON of good text fonts already?\n\nNot the right kind though.  \nEvert would have probably made the first one.\n\nhhp\n\n"
    },
    {
      "time": " 5.Aug.2005 1.14am",
      "content": "Sauna is nice, Bello is great. But Auto is probably their most usable and also versatile faces. There’s a degree of refinement to [Underware's](http://web.archive.org/web/20080828000542/http:/www.typophile.com/wiki/Underware) work that pushes it distinguishes it from typical display fonts — even though this seems to be where their work comes from.\n\nThe three Underware principals don’t work in the same office and they deliberately blur the ownership of their fonts. Even though each face has a primary designer and the other two will give input and ideas, they don’t attach their individual names to their fonts.\n\nPS: Bill, sorry for making you strain at the white text. We wanted to make people earn it. I’m kidding — in truth the pink tint came out a degree lighter than we expected.\n\nPPS: It’s a joy to kern upside down... Everyone should try it. =)\n\n"
    }
  ]
}
