{
  "id": "14341",
  "title": "Peculiar Letterforms - Advice Needed",
  "forum": "Build",
  "tags": [

  ],
  "content": "I’m currently trying to construct two very unusual glyphs to go with the Minion font family.\n\nThe first is the IPA character for the sound _j_ as in “les _j_eux sont faits”, sometimes called “ezh”, Unicode 0292. Unfortunately, I haven’t found a suitable example. The glyph looks like the top of the z glyph combined with the bottom of the numeral 3.\n\nThe second is the character “hv” used in Gothic transliteration. It looks like a combination of the h and u glyphs but without the lower right foot/serif of the u. Unicode scalar value is 0195, plus I’ve attached my first feeble attempt at creating one.\n\nUnfortunately, I have no experience at all in designing type.  \nAre there any language/letterform aficionados who have dealt with these characters and who have two minutes to drop a comment?\n\nThank you!\n\n| Attachment | Size |\n| --- | --- |\n| [hv.jpg](http://web.archive.org/web/20080705145637/http:/typophile.com/files/hv.jpg) | 15.11 KB |\n| [m\\_vs\\_hv.jpg](http://web.archive.org/web/20080705145637/http:/typophile.com/files/m_vs_hv.jpg) | 27.87 KB |\n| [measure.jpg](http://web.archive.org/web/20080705145637/http:/typophile.com/files/measure.jpg) | 19.18 KB |\n| [pleasure.jpg](http://web.archive.org/web/20080705145637/http:/typophile.com/files/pleasure.jpg) | 18.71 KB |\n| [two\\_versions.jpg](http://web.archive.org/web/20080705145637/http:/typophile.com/files/two_versions.jpg) | 16.02 KB |\n\n [‹ Specifying lining/ranging numerals in webpages](http://web.archive.org/web/20080705145637/http:/www.typophile.com/node/14444 \"Go to previous forum topic\") [anybody up on the AFP font format? ›](http://web.archive.org/web/20080705145637/http:/www.typophile.com/node/14490 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080705145637/http://www.typophile.com/user/7689\" title=\"View user profile.\">davidb</a>",
  "time": "<br>",
  "uid": "7689",
  "comments": [
    {
      "time": " 3.Aug.2005 12.23pm",
      "content": "best advice: attach the file.\n\n"
    },
    {
      "time": " 3.Aug.2005 12.35pm",
      "content": "oldnick, it is attached.\n\n"
    },
    {
      "time": " 3.Aug.2005 12.38pm",
      "content": "david,  \nIf you send me an E-mail to [aboutype@comcast.net](mailto:aboutype@comcast.net), I’ll send you some samples of characters that I designed for dictionary publishers.\n\n"
    },
    {
      "time": " 3.Aug.2005 12.43pm",
      "content": "_oldnick, it is attached._\n\nI get a 404 message...lucky me.\n\n"
    },
    {
      "time": " 3.Aug.2005 1.42pm",
      "content": "David, the first symbol does have a name: dram.  \nThe second symbol, I can’t picture.\n\nProbably the best place to look is Gentium:  \n [www.sil.org/~gaultney/gentium](http://web.archive.org/web/20080705145637/http:/www.sil.org/~gaultney/gentium \"www.sil.org/~gaultney/gentium\")  \nAnd it’s free!\n\nTiff, it looks like you’re the only one seeing attachments,  \nin any thread... Another “feature”? ;-)\n\nhhp\n\n"
    },
    {
      "time": " 3.Aug.2005 2.36pm",
      "content": "Oh, really? Yikes!\n\n"
    },
    {
      "time": " 3.Aug.2005 3.15pm",
      "content": "Wow, the Gentium website looks promising, I didn’t know about it, so thanks for that one.\n\nJoffre, your offer is most welcome as well, so I’ll send you a message as soon as possible.\n\nAs you may all have noticed already, I’ve put up an attachment that works (for me, at the very least). It’s a quite funny character, indeed, so do check it out.\n\n"
    },
    {
      "time": " 3.Aug.2005 8.13pm",
      "content": "Funny, that looks a lot like an Armenian “xeh” (kheh), with its descender stunted!\n\nhhp\n\n"
    },
    {
      "time": " 4.Aug.2005 6.39am",
      "content": "[http://www.evertype.com/standards/wynnyogh/index.html](http://web.archive.org/web/20080705145637/http:/www.evertype.com/standards/wynnyogh/index.html \"http://www.evertype.com/standards/wynnyogh/index.html\")\n\nThis is part of the website of a man who is an author and editor for Unicode Standard version 3.0. This shows a ezh and a hwair (also yogh and wynn)  \nTim\n\n"
    },
    {
      "time": " 4.Aug.2005 3.04pm",
      "content": "So, in conclusion one may assume that the forms of these two characters are very much in the hands of the designer — I’m still quite unsure about the details of the glyphs, as there is little material to study and compare. They are just too rare.\n\n(eg the right part of the “hv” — a lowercase u? Something else? And the bottom of “ezh” or “dram” — numeral 3? lc j? lc one-story g? Oh well.)\n\n"
    },
    {
      "time": " 4.Aug.2005 3.10pm",
      "content": "Hey, be happy you have some freedom! :-) For most characters, you do something original, and certain people try to snarl and guffaw you into shame.\n\nhhp\n\n"
    },
    {
      "time": " 4.Aug.2005 11.54pm",
      "content": "David, your hwair is quite respectable looking. One thing to check: the two counters should be slightly narrower than those of the h and u, in the same way that the counters of the m are usually narrower than that of the n. This stops the letter from being too wide overall.\n\nI recently had to design an ezh for my SBL BibLit typeface. Earlier, in the unreleased IPA portion of Sylfaen that I made for Microsoft in 1998, I reversed the contrast on the upper strokes, which seems quite common and follows a natural broadnib ductus. But for textual harmony I think it is better to match the stroke contrast of the z. I’ve put an image of the SBL Biblit ezh online at [http://www.tiro.com/John/ezh.gif](http://web.archive.org/web/20080705145637/http:/www.tiro.com/John/ezh.gif \"http://www.tiro.com/John/ezh.gif\")\n\n"
    },
    {
      "time": " 8.Aug.2005 1.39pm",
      "content": "Well, John, that’s exactly what I feared would be inevitable: Meddling with those tricky Bézier curves! (I was hoping I could somehow cobble the glyphs together with parts of other, existing glyphs ...)\n\nInterestingly enough, the lc “m” in Minion consists of almost exactly two “n” glyphs together! The basic “n” form is consistent in other glyphs, as well — an “m” in the mask layer of the “hv” glyph (which consists of “h” and “u”) fits it exactly!\n\nStill, as you will observe in the uploaded picture “m\\_vs\\_hv.jpg”, the “hv” glyph appears to be somehow wider, even too wide, and less dark than the “m”. Hrm.\n\n"
    },
    {
      "time": " 8.Aug.2005 2.17pm",
      "content": "Oh, that’s because the serifs close the “m” glyph, whereas the smooth curves and the absence of serifs open up the “hv” glyph. Clever.\n\n————\n\n_New and Improved!_ · See the attached file “measure.jpg” for a brand-new “ezh”/”dram” glyph!\n\n"
    },
    {
      "time": " 9.Aug.2005 4.56am",
      "content": "I can’t see the new and improved but John’s comment and ” Oh, that’s because the serifs close the “m” glyph, is right on! Most fonts, the m and w are not simply two of something else, but I think a lot of Adobe fonts are effected by low expectations of the rasterizer...\n\n"
    },
    {
      "time": " 10.Aug.2005 1.27pm",
      "content": "The ezh-dram looks better in this new version “pleasure.jpg” and “two\\_versions.jpg”, I believe. Comments/critique appreciated.\n\n"
    },
    {
      "time": " 11.Aug.2005 6.07am",
      "content": "David,  \nI prefer the terminal shape of the lefthand version (in “two versions”) but I think the width of the righthand one works better, though my preference is no guarantee of authenticity.  \nTim\n\n"
    }
  ]
}
