{
  "id": "14357",
  "title": "Keep the typoflames burning... ATypI, anyone?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Whew. Now that TypeCon2005 has ended (at least on the physical plane), our thoughts turn to the future... in between TypeCon lovefests lies the (mostly) European typographic oasis that is ATypI.\n\nWho’s going? When ya gettin’ there? Who needs a roommate (several people I know are looking)? Who will sport the coolest typo tee? And, most importantly, will Yves show us some more spectacular dance moves?\n\n [‹ Idle in neutral](http://web.archive.org/web/20080324121139/http:/typophile.com/node/15113 \"Go to previous forum topic\") [When 45 point isn't 45 point. ›](http://web.archive.org/web/20080324121139/http:/typophile.com/node/15089 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080324121139/http://typophile.com/user/107\" title=\"View user profile.\">tamye</a>",
  "time": "<br>",
  "uid": "107",
  "comments": [
    {
      "time": " 3.Aug.2005 8.06pm",
      "content": "Hey Hey Hey I’ll be there. Arrive on Monday ... err, the 19th? and leave the following Monday. Tamye is my roomie and we’re staying at the Presidentii.\n\n"
    },
    {
      "time": " 4.Aug.2005 5.35am",
      "content": " **I’m still at vacation, so I’m not sure where we’re booked but** Presidentii **does ring a bell.  \nBesides type events I’d like to visit Aki and Mika Kaurismäkis bar,  \nI expect it to be... interesting.**\n\nƒ\n\n"
    },
    {
      "time": " 4.Aug.2005 5.36am",
      "content": "You mean Yves has even MORE dance moves than he showed in New York?\n\nChrisL\n\n"
    },
    {
      "time": " 4.Aug.2005 7.42am",
      "content": "Hey hey, that’s enough, or the ego problem Tiff made numerous references to will seriously blow out of proportions. ;^P\n\nI’m arriving Thursday September 15th in the afternoon, and leave Sunday eve September 18th. I booked a single room at the Presidentii, but wouldn’t mind checking if can convert that into a double if anyone is brave enough to share a room with a hard-living, albeit non-drinking nor smoking Belgian.\n\n"
    },
    {
      "time": " 4.Aug.2005 9.51am",
      "content": "Is [this](http://web.archive.org/web/20080324121139/http:/www.opodo.co.uk/otpbvpl/Jsp/opodo/StrutsServlet/HotelDetailsView?BV_SessionID=@@@@1802833007.1123174014@@@@&BV_EngineID=ccdiaddfflemdehcefecenhdhhldfni.0&hotelCode=66539) the hotel you guys are talking about?\n\nIf so, Presidentii —\\> Presidentti. :)\n\n"
    },
    {
      "time": " 4.Aug.2005 10.01am",
      "content": "ok ok mea culpa ... spelling is, sadly i’m part of the generalized about group, not one of my strong suits. :^P\n\n"
    },
    {
      "time": " 4.Aug.2005 10.38am",
      "content": "Tiffany,\n\nAfter seeing it three times, some Finnish\\* pride surfaced, and had to stop the abuse. ;)\n\n\\* I’m 50% Finnish.\n\n"
    },
    {
      "time": " 4.Aug.2005 10.40am",
      "content": "no problemo, Lauri, corrections are readily accepted. :^)\n\n"
    },
    {
      "time": " 4.Aug.2005 11.01am",
      "content": "Tiff,\n\nThanks! I’m not really such a stickler for spelling, but my brain picks them out when other people do them, but not when I spell something wrong. But that’s probably because I dislike re-reading anything I type... but I’m being more careful now that mere mortals can’t edit their posts. ;)\n\n"
    },
    {
      "time": " 4.Aug.2005 2.47pm",
      "content": "Yeah what’s up with that!? I want the edits back.\n\nOh, and I just picked up the bad spelling from Tiff. O:-) Should’ve checked thou...\n\n"
    },
    {
      "time": " 4.Aug.2005 6.26pm",
      "content": "I’ve been using “Presidentii” for the past few weeks too - what’s up with that? Anyhow I’m going to be residentti in the Presidentti from Monday to Monday but plan to stay on in Finland for another week after the conference with my family. Anyone have any suggestions as to where to stay and what to do? I’m not opposed to renting a motor, for a few days.\n\nCheers, Si\n\n"
    },
    {
      "time": " 4.Aug.2005 6.38pm",
      "content": "Not to pull tourist away from the land of Kimi Raikkonen, but I heard St Petersburg is quite close, and amazing. Just watch out for falling balconies, apparently. But do get an early start on a Russian visa, otherwise you might find yourself paying $300+ for one like I did last year...\n\nhhp\n\n"
    },
    {
      "time": " 4.Aug.2005 8.14pm",
      "content": "Hmm wish I could go, but I don’t think I could afford the trip! I’m sure it’ll be a good time though!\n\n"
    },
    {
      "time": " 5.Aug.2005 3.14pm",
      "content": "I’ll be attending TypeTech and ATypI along with three other brazilians. We’re staying at Eurohostel, as the Presidentti was too much for our pockets.\n\nHrant, funny you should mention falling balconies in St. Petersburg. I took a trip there as a kid (some 12 years ago), and one of my strongest memories is a balcony that looked like it was about to fall onto my head. Scary.\n\n"
    },
    {
      "time": " 5.Aug.2005 3.33pm",
      "content": "Hey Tiff,  \nI am diggin’ your new icon!\n\nChrisL\n\n"
    },
    {
      "time": " 5.Aug.2005 3.42pm",
      "content": "thanks, chris. :^)\n\n"
    },
    {
      "time": " 5.Aug.2005 4.23pm",
      "content": "Yours is really neat as well, Chris, but aren’t you supposed to only use letters that make up your name? ;-)\n\n"
    },
    {
      "time": " 5.Aug.2005 4.48pm",
      "content": "Maybe if you combine the German version and the Czech version of my name, it does :-)\n\nActually, since I did my face in my typeface, I thought that was enough of a faceoff—but maybe I am just a hockey puck for thinking that (:-D\\>\n\nChrisL\n\n"
    },
    {
      "time": " 5.Aug.2005 5.03pm",
      "content": "I’m just off to book my flight.\n\n"
    },
    {
      "time": " 5.Aug.2005 8.44pm",
      "content": "Thanks, Yves, for cleaning up after me. — Chris, I really do like your icon. The coolest part is that it _does_ look like you. :^D\n\n"
    },
    {
      "time": " 6.Aug.2005 8.02am",
      "content": "It would be tougher to look ike me if I had hair, then I would have to use the same font as “Hairy 11”\n\n:-\\>\n\nChrisL\n\n"
    },
    {
      "time": " 6.Aug.2005 8.04am",
      "content": ":^D\n\n"
    },
    {
      "time": " 8.Aug.2005 7.46am",
      "content": "Is it a bird? Is it a plane?  \n**No, that was my vacation, so fast and** _so_ **over.  \nAs I thought, the Presidentii it is, now I better go get some dance lessons if I’m going to impress anyone. See You soon.**\n\nƒ\n\n"
    },
    {
      "time": " 8.Aug.2005 1.43pm",
      "content": "I am looking forward to seeing the real person behind the scary melting face icon... and even better if you have some slick dance moves to show off, fredo!\n\n"
    },
    {
      "time": " 8.Aug.2005 1.49pm",
      "content": "Well, Chris, the ol “Hairy 11” isn’t a whole typeface. Just a logotype I made. But, due to its apparent popularity perhaps I will create the real deal in all my spare time.\n\n"
    },
    {
      "time": " 8.Aug.2005 2.02pm",
      "content": "Shu,  \nPerhaps you could call it Rogaine :-)\n\nChrisL\n\n"
    },
    {
      "time": " 8.Aug.2005 10.10pm",
      "content": "Right, plane ticket purchased, hotel booked. I’m staying at the Sokos Hotel Torni, the older of the three official ATypI hotels. It’s going to be a brief trip this year: in on the Thursday and out on the Monday, so I expect other typophiles will ransack the bookshops before I even arrive. :(\n\n"
    },
    {
      "time": " 10.Aug.2005 11.56am",
      "content": "Bought my plane tickets... happy that Miss Tiffany is coming to SF so we can fly to Helsinki together. Will ease the pain of too many boring hours confined in planes! We arrive Mon. Sept. 12, depart Helsinki on the 19th, and will spend that night in Amsterdam before heading back to the US on the 20th.\n\nWe’ll be seeing the sites in Helsinki before we set up the SOTA TypeGallery2005 on Thursday (same day of Tiff’s speaking engagement at the Type Tech Forum).\n\nLooking forward to seeing everyone!\n\n"
    },
    {
      "time": " 12.Aug.2005 2.36pm",
      "content": "Well, it’s a shame San Fran is a bit too far out of my way, or I’d have joined the both of you. ;^)\n\n"
    },
    {
      "time": " 12.Aug.2005 5.42pm",
      "content": "Hey! nice to know that all of you are going. Me too!!! so hope to meet you all there.  \nIs funny, because I´ll be meeting a brazilian friend there, that I´m sure gabrielhl most know...  \nAny way, see you soon!\n\n"
    },
    {
      "time": " 15.Aug.2005 4.48pm",
      "content": "Jimmy G needs a roommate! Anyone?\n\n"
    },
    {
      "time": " 15.Aug.2005 5.02pm",
      "content": "Me! Me! Me!\n\n"
    },
    {
      "time": " 15.Aug.2005 9.00pm",
      "content": "My wife spotted this...\n\n[http://www.helsinkidesignweek.com/](http://web.archive.org/web/20080324121139/http:/www.helsinkidesignweek.com/ \"http://www.helsinkidesignweek.com/\")\n\nSeems like the week after ATypI is Helsinki Design Week - they must have timed this deliberately to occur once the troublesome font people have left town.\n\nSi\n\n"
    },
    {
      "time": " 15.Aug.2005 11.56pm",
      "content": "Of course I’ll be there, and I look forward to seeing old friends and meeting new ones, as always.\n\nVeronica (my wife) and Miranda (our 14-month-old daughter) won’t be coming, though. New York City was Miranda’s big trip for the season. I’ll miss them!\n\nIf you’re planning on coming but haven’t registered yet, please do so. It helps with our planning to not have a lot of registrations at the last minute.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 16.Aug.2005 2.47am",
      "content": "_Seems like the week after ATypI is Helsinki Design Week - they must have timed this deliberately to occur once the troublesome font people have left town._\n\nYup, only DIN 1451 and Neue Helvetica Ridiculously Thin allowed! :^P\n\n"
    },
    {
      "time": " 31.Aug.2005 2.20pm",
      "content": "Two weeks and counting... ;^)\n\n"
    },
    {
      "time": " 31.Aug.2005 2.47pm",
      "content": "Ack!!\n\n"
    },
    {
      "time": " 31.Aug.2005 3.15pm",
      "content": "Tiff, don’t be nervous. I will help you rehearse your talk all the way across the Atlantic...\n\n"
    },
    {
      "time": " 9.Sep.2005 4.44pm",
      "content": "**I would love to see You all at the [presentation](http://web.archive.org/web/20080324121139/http:/www.atypi.org/07_Helsinki/30_program/20_main_program/view_presentation_html?presentid=221) of** Berling Nova **at 11.30 on friday. Örjan Nordling will present our precious project and I will clap and cheer. Please join in! Any questions later that evening will be dealt with at the** Presidentii **hotel bar (or wherever questionable advice leads us). You will recognize me from my striking good looks, impeccable taste in clothes and a phlegmatic grin upon my childish handsome face.**\n\nƒ\n\n"
    },
    {
      "time": " 13.Sep.2005 12.15pm",
      "content": "Greetings from Helsinki,\n\nBeen installed in the Presedentti hotel since Monday night, and we went to see the main venue this morning. It looks great. We even got to meet the students. Peter Bilak was supposed to give a talk to the students this afternoon but had to cancel - Tiffany and myself were drafted in to fill in for him and Miss T gave a wonderful unrehearsed talk about Typophile - expect lots of hits from Finland!\n\nTyporati are beginning to arrive, I’m writing this from the hotel bar and have seen a number of people check in and head up to their rooms. Unfortunately Helsinki is crawling with font doppelgangers - already spotted three David Lemon look-a-likes and two Matthew Carters.\n\nEarly night is in order as tech forum starts tomorrow - unfortunately I’m still working on my talk.\n\nCheers, Si\n\n"
    }
  ]
}
