{
  "id": "14359",
  "title": "what with Ministry Script",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Okay, i chose [Ministry Script](http://web.archive.org/web/20131017002931/http:/www.veer.com/products/typedetail.aspx?image=UMT0000149) for names for my sis's wedding invites. what should i set text in? Would Californian be OK? or something more along the lines of Bodoni? oh, and [here's the card](http://web.archive.org/web/20131017002931/http:/www.annswedding.com/ProductCluster.cfm?prev=1&TempPrev=0&blnPreviewRequestSubmitted=0&recordsperpage=9&CompletedOrder=0&sBasketID=0&ClusterItem=Clust3099&iSubGroupID=1405&alogo=1&menu=none&morethanonepage=YES&HostDomain=0&FirstTimeThrough=1&option=ProductCluster.cfm&format=PG0269&CFID=1814966&CFTOKEN=70572151) it'll be printed on (my sis picked it, it's a done deal). Any thoughts/suggestions are welcome.\n\n| Attachment | Size |\n| --- | --- |\n| [Invite.pdf](http://web.archive.org/web/20131017002931/http:/typophile.com/files/Invite.pdf) | 457.05 KB |\n| [Invite.gif](http://web.archive.org/web/20131017002931/http:/typophile.com/files/Invite.gif) | 32.51 KB |\n| [InviteRedux.gif](http://web.archive.org/web/20131017002931/http:/typophile.com/files/InviteRedux.gif) | 42.31 KB |\n\n",
  "author": "paul d hunt",
  "time": "3 Aug 2005 — 9:57pm",
  "uid": "7006",
  "comments": [
    {
      "time": "3 Aug 2005 — 10:18pm",
      "content": "Bodoni?! It's a wedding, not a funeral.\n\nWhy not just use Ministry (a great match for those cards - which are nice btw) for everything? Everybody knows what a wedding invitation says anyway. As long as the numerals are unambiguous (for address & date/time) you should be fine. Just maybe lighten the names manually, since you'll probably be setting them larger, but you don't want them to scream - unless it's that kind of wedding I guess.\n\nBTW, with all those kerning pairs I bet you're  \nseriously tempted to include a colophon eh? ;-)\n\nhhp\n\n"
    },
    {
      "time": "3 Aug 2005 — 10:47pm",
      "content": "Don't go too old school. Cronos.\n\n"
    },
    {
      "time": "3 Aug 2005 — 10:49pm",
      "content": "No Cezanne Pro? Let's hope Jimmy G isn't reading this.\n\n"
    },
    {
      "time": "3 Aug 2005 — 10:50pm",
      "content": "i think you're right hrant. that's the conclusion i was coming to--all in ministry. i think i'll set it without frills (well you know what i mean!) except the names, which i'll fancy up a bit (hopefully not _too_ much. i have a tendency to overdo that kinda thing.) so i'll pitch all ministry at my sis, but for some reason she wanted everything in a plain text font (but the names) so just for backup, still taking suggestions...\n\n"
    },
    {
      "time": "4 Aug 2005 — 1:53am",
      "content": "Paul, OT, but I can't find a link to your website anymore. You had a font that was unreleased. I wish I could remember the name but I can't. Are you planning on releasing this anytime in the near future. Thanks, Sharon\n\n"
    },
    {
      "time": "4 Aug 2005 — 5:57am",
      "content": "hey sharon, thanks for your interest. i haven't done much with any of those fonts for a while, but if you're interested in a particular one i might be able to finish it up for you. try to describe it in an email and we'll figure it out. if you click on the contact tab on my profile, you should be able to reach me that way.\n\n"
    },
    {
      "time": "4 Aug 2005 — 6:50am",
      "content": "hey Paul, I want to see the final design pleeeaseee! hehehe  \nBest,\n\nAle Paul  \n [www.sudtipos.com](http://web.archive.org/web/20131017002931/http:/www.sudtipos.com/ \"www.sudtipos.com\")\n\n"
    },
    {
      "time": "4 Aug 2005 — 9:47am",
      "content": "Paul, I might've suggested something like Parisine Clair Regular in small doses.\n\n"
    },
    {
      "time": "6 Aug 2005 — 4:01pm",
      "content": "hello, is this thing on? well i attached a PDF of what i've got so far, but i'm not sure anyone will be able to view it!!! (the attachment is attached to my first post) Anyhow, if you CAN view it, i did lighten the names a bit, but did i do enough? Did i go overboard with swashes? (i tend to do that) anyhow, hopefully i can get a crit on this somehow. I'm afraid i might have to post a jpeg or a gif for anyone to see... i might do that just now...\n\n"
    },
    {
      "time": "6 Aug 2005 — 6:11pm",
      "content": "I think too many typefaces on those cards would be certain death anyway, so Ministry Script is fine. I like the treatment, but I think I'd like the bride and groom's names just a wee bit smaller and / or lighter. They're kinda shouty right now, or at least the disparity in sizes between the small and large text makes it seem so.\n\n"
    },
    {
      "time": "6 Aug 2005 — 7:52pm",
      "content": "Paul, try to find different alts when you have descender and asceder colliding. Is there a way to combine them? I would have really like to see a separate typeface combined with this. Why? I think, in this instance, especially since the enlarged letters appear to be heavier weight, that a different typeface would allow the two names, in the script, to appear ... hmmm ... more hand drawn? I can't think of the word. Does this typeface have different weights?\n\n"
    },
    {
      "time": "7 Aug 2005 — 9:10am",
      "content": "okay, check out the redux version attached to the first post... i agree with norvell, those names were just _too_ huge. hopefully they're better now. as stated before i _did_ lighten the names up a bit, but do i need to go further? (this face doesn't have different weights). should the names match the rest of the text in weight? or is it ok for them to be slightly heavier? tiff, are there any spots in particular where the ascenders/descenders are a problem? any other feedback? thnx for what you've given so far!\n\n"
    },
    {
      "time": "7 Aug 2005 — 12:42pm",
      "content": "Much better, and I still think using the single face works well in context. With the tweaked sizes, I don't think it needs to be any lighter.\n\n"
    },
    {
      "time": "8 Aug 2005 — 6:06pm",
      "content": "Paul, with the changes you made -- sorry for not noticing you had changed the weights -- I think the main areas have been resolved. The descender g, in Egan, no longer bumps into the Ch, in Charles. As well, reducing the contrast in size helps with the visual divergence of the two point sizes. Could you make the names a little lighter?\n\n"
    },
    {
      "time": "9 Aug 2005 — 1:33pm",
      "content": "it's now outta my hands. thank for your help folks!\n\n"
    },
    {
      "time": "9 Aug 2005 — 1:35pm",
      "content": "How about a little more space in between the LD combo in LDS? And a little less space in between the ' (apostrophe) and the c in o'clock?\n\n"
    },
    {
      "time": "9 Aug 2005 — 1:35pm",
      "content": "Bottom line: The word spacing seems too loose after 1451\n\n"
    }
  ]
}
