{
  "id": "14378",
  "title": "Freestyle Remix Challenge",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Take a font with a defective glyph, and fix it.\n\nFirst challenge: the \"g\" in Matrix.\n\nLet's see what you got guys! And girls. The winner  \ngets a free license to some font. Or something.\n\nBut of course just show the new glyph (maybe in  \na word) don't go passing around derivative fonts!!  \nAnd if you don't have the font, use a rendering  \nfrom MyFonts or something.\n\nhhp\n\n",
  "author": "hrant",
  "time": "4 Aug 2005 — 1:34pm",
  "uid": "1250",
  "comments": [
    {
      "time": "5 Aug 2005 — 6:45am",
      "content": "great idea hrant -- and a good choice for the first glyph. I'll take a stab at this later today when i should be doing 'work'..\n\n"
    },
    {
      "time": "5 Aug 2005 — 10:16am",
      "content": "Just out of curiosity: what kind of font could the prize be?\n\noribendor\n\n"
    },
    {
      "time": "5 Aug 2005 — 10:47am",
      "content": "Ben, can't wait.\n\n\\> what kind of font could the prize be?\n\nSome freeware? :-/  \nSorry, the prize is actually just Satisfaction.\n\nhhp\n\n"
    },
    {
      "time": "5 Aug 2005 — 10:58am",
      "content": "Maybe the prize should be Patria? :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Aug 2005 — 11:05am",
      "content": "The \"g\".\n\nhhp\n\n"
    },
    {
      "time": "15 Aug 2005 — 3:47am",
      "content": "Hmmm... I thought this sounded an interesting idea/challenge. I keep looking back here to see if anyone's had a go at it. I can only assume they're all taking their time to get it right... ;-D\n\nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "15 Aug 2005 — 2:01pm",
      "content": "\\>I can only assume they’re all taking their time to get it right\n\nI wouldn't presume to improve upon the work of Zuzana Licko, even if I thought one of her glyphs wasn't up to par.\n\n"
    },
    {
      "time": "15 Aug 2005 — 2:18pm",
      "content": "I know she is (or at least used to be) your biggest idol, but that doesn't make her infallible. But anyway, this isn't about her, it's about how to improve a font, in this case how to fix the Achilles Heel of an otherwise wonderful design. Designers do that all the time to existing fonts, even to those by people who are not dead yet. Of course you don't have to participate (just like you never help out in the critiques - and I know exactly why, don't you doubt it - I'm just playing nice) but please don't discourage others; those of us who are here to learn can gain a lot from such an exercise. Heck, with some fancy coding an end-user could conceivably get a much more usable font out of the process even! :-)\n\nA font is not a painting.\n\nhhp\n\n"
    },
    {
      "time": "15 Aug 2005 — 4:35pm",
      "content": "\\>But anyway, this isn’t about her,\n\nBut it is Hrant. Perhaps other people are having second thoughts about joining in your personal vendetta against Ms Licko.\n\n"
    },
    {
      "time": "15 Aug 2005 — 4:49pm",
      "content": "\\> (just like you never help out in the critiques - and I know exactly why, don’t you doubt it - I’m just playing nice)\n\nHrant, perhaps the reason I don't \"help out\" is that you would take the opportunity to trash whatever I said. I don't know why I bother opening my mouth on Typophile, every time I do you jump down my throat.\n\n"
    },
    {
      "time": "30 Nov 2007 — 10:16pm",
      "content": "(The following was actually posted on August 15 of 2005, but when I tried to edit a typo just now it got bumped to current time. So I'm adding this note to avoid certain confusion. For the record. Etc, etc, etc. As you were.)\n\n--------\n\nI'm not a Vendetta kind of guy. Don't scare people away with your self-serving imagination. In fact, ever since RvL graciously apologized to me for what some people associated with Emigre tried -and failed- to do to me, I've actually been helping them out more than pointing out their flaws. When I see something good (like Tarzana) I freely point it out. When I see something bad (like the \"Q\" in Tarzana) same thing.\n\n\\> you jump down my throat.\n\nI'm not giving you any special treatment. But I used to.  \n(I sincerely hope you can figure out what I just wrote.)\n\n--\n\nI chose Matrix because the contrast between its overall merits and that ludicrous \"g\" is greater than any other case that comes to my mind. The idea for this thread popped into my head when somebody in another thread trashed Matrix outright. But I'm not fixated on Matrix, I really do just want to teach/learn. So feel free to suggest another font that's marred by a single (or two) horrid glyphs. And I don't mean you in particular, because anybody who refuses to crit fonts -for the reason I believe you harbor, the same reason you're defending Matrix, and the same reason you turned frigid when Eben suggested you provide some Eunoia glyphs for public modification- is unlikely to participate in this thread... except of course to sabotage it. Who's jumping down whose throat again?\n\nhhp\n\n"
    },
    {
      "time": "24 Aug 2005 — 5:35am",
      "content": "Here's one for you:\n\n[http://www.fontbureau.com/fonts/tester.php?fontstyletoken=Amplitude-Regu...](http://web.archive.org/web/20120927043331/http:/www.fontbureau.com/fonts/tester.php?fontstyletoken=Amplitude-Regular&fontsize=36&text=ugly@amplitude.com \"http://www.fontbureau.com/fonts/tester.php?fontstyletoken=Amplitude-Regular&fontsize=36&text=ugly@amplitude.com\")\n\nThe \"@\" in Amplitude.\n\nI absolutely love this typeface and others by Christian Schwartz, but I think the \"@\" could have been done a lot better. I think it looks out of place compared with the rest of the characters in the family. Possibly because the stroke of the loop around the \"a\" is so much lighter than the other characters.\n\n"
    },
    {
      "time": "24 Aug 2005 — 12:42pm",
      "content": "Yeah, that is pretty bad. Plus an At with a binocular \"a\" in the middle is too distracting I think; the \"normal\" form with the mono \"a\" allows the character to be more itself - which would be an easy fix.\n\nNobody's \"man\" enough to tackle the \"g\" in Matrix? :-)\n\nhhp\n\n"
    },
    {
      "time": "24 Aug 2005 — 2:43pm",
      "content": "_Nobody’s “man” enough to tackle the “g” in Matrix? :-)_  \nIt's a pretty ugly glyph, I've gotta finish my finals but I'll have a go even though I've never really done any type design.\n\n"
    },
    {
      "time": "25 Aug 2005 — 6:19am",
      "content": "Here my first _tackle._\n\nThe [Krutgeira](http://web.archive.org/web/20120927043331/http:/webmaestro.qc.ca/scm/Krutgeira.gif) game.\n\n"
    },
    {
      "time": "25 Aug 2005 — 8:32am",
      "content": "Hey, you took the easy way out - going mono! :-)  \nFor a mono though I think it works, except that  \nthe terminal is coming too close to the bowl.  \nIn situations like this it's not unacceptable  \nto lift the bowl off the baseline a bit.\n\nhhp\n\n"
    },
    {
      "time": "25 Aug 2005 — 10:34pm",
      "content": "Although I'd still like to see somebody try his/her hand at a better binocular \"g\" for Matrix, I have another one:\n\nThe \"d\" in Perpetua.  \nBut it would be too easy making it totally mainstream, so what would be cool is if it were made to keep some level of idiosyncracy.\n\nhhp\n\n"
    },
    {
      "time": "26 Aug 2005 — 4:41am",
      "content": "_Hey, you took the easy way out - going mono! :-)_\n\nIs in the rules we had to take a specific way? ;-)  \nI'll be come back with a double storey one.\n\n"
    },
    {
      "time": "26 Aug 2005 — 4:47am",
      "content": "Hrant,\n\nWich Perpetua are you talking about. Could you show a sample? Thanks\n\n"
    },
    {
      "time": "26 Aug 2005 — 8:09am",
      "content": "[http://www.myfonts.com/fonts/linotype/perpetua-2/perpetua/win-t1/114833/...](http://web.archive.org/web/20120927043331/http:/www.myfonts.com/fonts/linotype/perpetua-2/perpetua/win-t1/114833/character/0064/CP2/1/ \"http://www.myfonts.com/fonts/linotype/perpetua-2/perpetua/win-t1/114833/character/0064/CP2/1/\")\n\nhhp\n\n"
    },
    {
      "time": "26 Aug 2005 — 12:16pm",
      "content": "My second attempt with a binocular «g» [graphic](http://web.archive.org/web/20120927043331/http:/webmaestro.qc.ca/scm/graphic.gif)\n\n"
    },
    {
      "time": "26 Aug 2005 — 12:22pm",
      "content": "Hey, this doesn't seem half bad! I might make the join less steep, make the head bigger, lighten things up a bit, and maybe point the ear upwards. Overall cool effort though. What do others think?\n\nhhp\n\n"
    },
    {
      "time": "26 Aug 2005 — 5:50pm",
      "content": "Seems there is'nt lots of people to be concerned by this challenge :-/\n\n"
    },
    {
      "time": "26 Aug 2005 — 5:57pm",
      "content": "On a good day making a decent binocular \"g\" is pretty hard. For something \"literal\" like Matrix, such an organic structure becomes a True Challenge for the Brave and Skilled.\n\nhhp\n\n"
    },
    {
      "time": "28 Aug 2005 — 10:57pm",
      "content": "I just found the thread. I'll consider having a slash.\n\n"
    },
    {
      "time": "29 Aug 2005 — 12:43am",
      "content": "<cite>Hey, this doesn’t seem half bad! I might make the join less steep, make the head bigger, lighten things up a bit, and maybe point the ear upwards. Overall cool effort though. What do others think?</cite>\n\nI'd second that.\n\n"
    },
    {
      "time": "29 Aug 2005 — 7:43am",
      "content": "My most recent attempt with a binocular «g» [graftage](http://web.archive.org/web/20120927043331/http:/webmaestro.qc.ca/scm/graftage.gif)\n\n"
    },
    {
      "time": "29 Aug 2005 — 8:36am",
      "content": "BTW - Nick, if your reading this I would prefer you say whatever suits you irrespective of what is said afterwards.\n\n"
    },
    {
      "time": "29 Aug 2005 — 11:23am",
      "content": "To me, Matrix is what it is. If you go changing it, it's not quite Matrix anymore. But if you want to engage in revisionist type design, I'm game. André asked me to comment on his solution. It's a nice looking g and does pick up on Matrix's design elements, but loses some of its essential mechanical quality. I would redo it more like this:\n\n[http://www.marksimonson.com/matrix-redux.gif](http://web.archive.org/web/20120927043331/http:/www.marksimonson.com/matrix-redux.gif \"http://www.marksimonson.com/matrix-redux.gif\") (before on left; after on right)\n\nI've tried to keep the basic design similar to the original, but I've shifted the proportions and weight around a bit. In doing so, I think it feels more comfortable in its surroundings, but has lost some of its iconoclasm.\n\n"
    },
    {
      "time": "29 Aug 2005 — 11:38am",
      "content": "This was pretty fun. I could not spend too long on it so the usual excuses apply. Maybe I'll have another go later. For now you can slice this up.\n\n\\* [Check It Out](http://web.archive.org/web/20120927043331/http:/www.eyebytes.com/g1.jpg)\\*\n\nIt's interesting trying to walk the line between a very text like understucture and the ornamental serifs.\n\nBTW - My crit of what I have seen so far is that the examples don't have the sparkle of matrix. They are nice letters but they don't seem in keeping with the spirit of the face. You might disagree with that spirit on some level - but a replacement g needs to fit in with it's neighbors - no?\n\n"
    },
    {
      "time": "29 Aug 2005 — 11:39am",
      "content": "I hadn't seen Mark's solution. I like it!\n\n-e.\n\n"
    },
    {
      "time": "29 Aug 2005 — 12:02pm",
      "content": "So far, I tried to go far away from the g Matrix spirit, to see if it's possible to change it. My sketches do not give what I expected.\n\nEben: your third option seems to have the best chance, What do you think of changing the tail?  \nMark: Your right _right_ looks good, but I still have problem with the underground storey «g».\n\n"
    },
    {
      "time": "29 Aug 2005 — 3:00pm",
      "content": "\\> What do you think of changing the tail?\n\nI think change is needed! I won't be able to try anything until tommrow or maybe later than that so have at it if you want to!\n\nGo for it.\n\nLooking at my 3 again I should maybe comment that the 3rd one was an attempt to keep the feeling matix-y which yeilded a surprise. The surprise being that 3 looked like a g at all! I thought it was neat-o. But I actually don't think any of the examples I posted are real solutions. They are just sketches/experiments. They didn't do what I expected either! I am finding it hard to draw letters in illustrator now.\n\n"
    },
    {
      "time": "29 Aug 2005 — 3:29pm",
      "content": "Mark: I find what you've done is really an interesting way.\n\nCould you do more? Double storey?\n\n"
    },
    {
      "time": "29 Aug 2005 — 5:23pm",
      "content": "[This](http://web.archive.org/web/20120927043331/http:/cerulean.st/misc/matrixgag.gif) hardly took half a minute, and you can tell. But it works.\n\n"
    },
    {
      "time": "29 Aug 2005 — 6:00pm",
      "content": "Cerulean - that works - but it makes my eyes jingle-jangle!\n\nMake another please!\n\n"
    },
    {
      "time": "30 Aug 2005 — 7:25am",
      "content": "\\> My most recent attempt\n\nI'm thinking that closing the bottom might in fact be a good idea here. But now it's leaning all kinds of funny. Why not reduce the angle of the diagonal? Of all the ones I've seen so far I think this has the most potential.\n\n\\> Matrix is what it is. If you go changing it,  \n\\> it’s not quite Matrix anymore.\n\nWell, OK. So name the rose with its errant petal tamed something else if you like. But the point and purpose remain.\n\nMark, I think your angle is not without merit, dealing with \"micro\" improvements while leaving the existing character of the design as unaltered as possible. But I have to doubt that if it gets rid of the distracting \"spike\" in texture that was the original complaint (at least on my end). I think in every other way Matrix can be a text face (or at least come very close).\n\n\\> This hardly took half a minute\n\nI think it has an elegance. I'd just lift the bowl off the baseline a tad.\n\nhhp\n\n"
    },
    {
      "time": "30 Aug 2005 — 10:27am",
      "content": "Somebody want to play [cribbage](http://web.archive.org/web/20120927043331/http:/webmaestro.qc.ca/scm/Criggage.gif)\n\n"
    },
    {
      "time": "30 Aug 2005 — 11:07am",
      "content": "_Well, OK. So name the rose with its errant petal tamed something else if you like. But the point and purpose remain.  \nMark, I think your angle is not without merit, dealing with “micro” improvements while leaving the existing character of the design as unaltered as possible. But I have to doubt that if it gets rid of the distracting “spike” in texture that was the original complaint (at least on my end). I think in every other way Matrix can be a text face (or at least come very close)._\n\nOkay, then:\n\n[http://www.marksimonson.com/double-g.gif](http://web.archive.org/web/20120927043331/http:/www.marksimonson.com/double-g.gif \"http://www.marksimonson.com/double-g.gif\")\n\n"
    },
    {
      "time": "30 Aug 2005 — 11:33am",
      "content": "I think the original «g» ear has a better look in this [second game](http://web.archive.org/web/20120927043331/http:/webmaestro.qc.ca/scm/Cribbage2.gif)\n\n"
    },
    {
      "time": "30 Aug 2005 — 12:16pm",
      "content": "I say this speaking from the point of view of a graphic designer - I think what made matrix so popular in it's day was it's energy openess & brightness. It's has a can-do feeling. It's very california. Optomistic in character. I really like Mark's most recent effort because it maintains these qualities. In some ways his new g fits better than the old one! My only quibble/crit would be that the left side of the bottom bowl feels a tiny bit wonky.\n\n\\> To me, Matrix is what it is. If you go changing it, it’s not quite Matrix anymore.\n\nYes, I agree. But your 'g' make for a better matrix than matrix! At least for texts. Advertising might be another issue. And Matrix, to be fair, wobbles between text & display - no?\n\nSim (Andr) , Your g's, while excellent in their way, don't seem to fit as well as mark's to my eye. I feel as if I am seeing a 'g' from a page of a pulp novel. It's too scotch-ish I think... Maybe that last part is wrong. The angled terminal is part of the reason I think this. It has no similar feature to draw on in the face so it jumps out. But the real reason I like it it less is the slanted angle of the lower bowl. I think if it were straight I would like it better. Still, they are impressive!\n\nJust my usual 35 cents...\n\n"
    },
    {
      "time": "30 Aug 2005 — 1:11pm",
      "content": "I tried a few different ideas on the lower left curve; the one shown seemed to work best, but, yeah, it's not quite there yet.\n\n"
    },
    {
      "time": "30 Aug 2005 — 3:35pm",
      "content": "I had faith that this would get interesting.\n\nI think both Mark's and sim's latest attempts are getting close, and in nicely different directions. I agree with Eben that sim's glyph is somewhat out of character (although the new ear helps). I can think of two things that should help: an angular join between the two bowls; and/or a straight top part to the bottom bowl. Also, I might try to make the bottom bowl open (after all). As for Mark's, I think the midsection might just be right on, but: 1) Maybe it's all not \"round\" enough. Should the head be smaller and the bottom bowl more full? 2) The left of the bottom bowl is totally out of character. Maybe just leave it open - and just like the original? Or turn the triangle terminal towards an \"upcurl\", instead of having it lay flat? I think sim tried something like that before.\n\nhhp\n\n"
    },
    {
      "time": "31 Aug 2005 — 9:58am",
      "content": "I worked on one of the first double storey I've already made. The one with an [open lower bowl](http://web.archive.org/web/20120927043331/http:/webmaestro.qc.ca/scm/Fatigability.gif). The difference between the two g _(of course, except the caps F ;-)_ is the link of the upper bowl and the lower storey.\n\n"
    },
    {
      "time": "31 Aug 2005 — 5:23pm",
      "content": "That one seems to fit quite admirably! :-)\n\n"
    },
    {
      "time": "31 Aug 2005 — 8:51pm",
      "content": "[Does this count?](http://web.archive.org/web/20120927043331/http:/www.klim.co.nz/images/matg1.gif) Might not have the spunk, but shares the ear of the 't', and serif of the  \n's'…\n\n"
    },
    {
      "time": "1 Sep 2005 — 8:10am",
      "content": "Kris, I think yours may have the most in common with the typeface as designed. To my eyeIt really really fits. On the other hand the join between the bowls is quite sparkley. I think if you wanted the g to be set in long texts the join might be better off in the form of the arm of the 'r'. I don't think Matrix is really a long text sort of face myself though... so it's a matter of intent. What do you think?\n\n"
    },
    {
      "time": "1 Sep 2005 — 8:48pm",
      "content": "Cheers Eben! I just fiddled for a few minutes till it 'looked right'. I wouldn't be able to tell at all how effective and appropriate it is until Isaw it in extended text. Like you I am not a huge fan of Matrix. But this throws up two things:\n\n1) I find that if I don't initially like something that, on good authority, is supposed to be good then I end up liking it through repeated exposure and time. Especially with music, when it immediately appeals to me it has severely limited longevity.\n\n2) I think I remember Hrant saying something about text faces having to have an inherent 'ugliness' to them in order to remain effective at smaller sizes. I think there is some truth to this, and Matrix to me is rather ugly. But only large, which doesn't really count. I used to be repulsed by Antique Olive as well, but now I love it!\n\nHow bout that for a rave?\n\nkris\n\n"
    },
    {
      "time": "1 Sep 2005 — 8:58pm",
      "content": "I think the best one is Kris's g. It plays so well along with the space, the other letters and the style. I like Eben's last slashy g as a good display alternate.\n\nAll the other ones are good attempts, this is a nice excersie, How did I lost it so long?\n\nWhat's the next glyph?\n\nHéctor\n\n"
    },
    {
      "time": "1 Sep 2005 — 9:12pm",
      "content": "Nice one, Kris. I like yours, too.\n\n"
    }
  ]
}
