{
  "id": "14398",
  "title": "inciting incidents and specimens - what began your type fixation?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was just reading [another thread](http://web.archive.org/web/20131014041306/http:/typophile.com/node/7596) where someone mentioned that their interest in typography began with a particular cover of a book. This got me thinking about where my own (though relatively recent) type fixation came from and why i now spend far too many hours reading typophile posts..\n\nSo as a bit of a friday afternoon diversion, would anyone be interested in posting about the incidents, specimens, book covers, articles etcetera that kicked off their own obsession?\n\ni'll go first, i suppose -- strangely enough it was a note about the type at the end of tim burton's twisted illustrated book of poems \"The Melancholy Death of Oyster Boy\" which was set in Goudy's [Scripps College Oldstyle](http://web.archive.org/web/20131014041306/http:/www.fonts.com/findfonts/detail.htm?pid=261386). It said that Goudy himself had remarked that the type was without any 'freakish characteristics' which i thought played off of the mildly disturbing poetry brilliantly. It also made me sit up and think \"hey wait a sec.. that font didn't come with my computer..\"\n\n",
  "author": "ben millen",
  "time": "5 Aug 2005 — 9:26am",
  "uid": "7535",
  "comments": [
    {
      "time": "5 Aug 2005 — 10:10am",
      "content": "For me, it was Matthew Carter's Galliard. I was working on a literary magazine with a professor back in school. We were looking for a type to use in redesigning his magazine, and we both loved Galliard as soon as we saw it.\n\nLater, when I worked for the university press at the same school, designing and editing books, I introduced them to Galliard as well, and by that time we could get the Carter & Cone version with all the extras and alternates. It immediately became one of our standard faces.\n\n"
    },
    {
      "time": "5 Aug 2005 — 10:45am",
      "content": "The desire to make Armenian (and shortly afterwards Arabic) 8x8 bitmap fonts for my Commodore-64. Needless to say, this scarred me for life.\n\nhhp\n\n"
    },
    {
      "time": "5 Aug 2005 — 10:48am",
      "content": "it was growing up with ton's of Tolkien books (my father is a huge fan) and the illustrations that they contained. when i was 3 or 4, before i could read, my father would read the books to me before i would fall asleep. i would pick up the books and just stare at the symbols and letters that began the books along with the maps and various other things. i started immitating those letters and symbols which i knew nothing about but imagineatively believed i did. as i got older i looked into these 'runic' symbols which opened up a whole world of type and symbols for me. i've always continued drawing letterforms but it was definitely Tolkien's books that got me hooked at a young age on art and typography\n\n"
    },
    {
      "time": "5 Aug 2005 — 10:49am",
      "content": "In school - 9th through 12th grade - I took letterpress and photography instruction with Mr. John Thompson at Albany High School in Albany, California. The shop consisted of a proof press, 2 large motorized C&Ps, lots of wood and metal type, a linotype and a few ABDick offset presses, plus a very well-equipped school photo and graphic arts darkroom. In the \"library\" room were a first generation mac and an ENORMOUS collection of U&LCs and years worth of Communication Arts back issues. I read every single one of them. Since then the scents of blanket wash, fixer, ink and lead have been my favorite smells (after bacon, maybe).\n\n"
    },
    {
      "time": "5 Aug 2005 — 10:54am",
      "content": "Marks scratched on the streets made by kids (so was I at the time) to play Hop-scotch or other children's games.\n\nChrisL\n\n"
    },
    {
      "time": "5 Aug 2005 — 11:01am",
      "content": "Will, as a teen I attempted a custom alphabet - but as I was developing it I suddenly realized it was getting closer and closer to Tolkien's Elven script! I stopped.\n\nhhp\n\n"
    },
    {
      "time": "5 Aug 2005 — 11:24am",
      "content": "For me, creating monospaced 8x8 bitmaps on graph paper during class at high-school, converting them to hex and keying them into my VIC20.\n\nA few years later working alongside airbrush artists who were creating video-game logos for the company I worked for (here's one [http://www.clive.nl/images/10098.jpg](http://web.archive.org/web/20131014041306/http:/www.clive.nl/images/10098.jpg \"http://www.clive.nl/images/10098.jpg\") - I wrote the blurbs and took the screenshots etc.,)\n\nIn my next job doing tech support on Corel Draw and Bitstream font packs for a software distributor in Basingstoke.\n\nIt was these experiences that led me to switch courses (from Psychology to Typography at the UofR) and the rest is history.\n\nSi\n\n"
    },
    {
      "time": "5 Aug 2005 — 11:33am",
      "content": "My mom says I was meant to play with type from birth as I learned to say the alphabet before anything else, well short of mommy and daddy.\n\nMy dad started his ad agency when I was 11. I hungout in the art director's office reading his commarts and u&lc ... sneaking off with the typespec book ... enlarging the letters on the stat camera.\n\nI was on the yearbook staff starting in 7th all the way through 12th. Editor for the last two years. All of this time I had access to a darkroom. Just like Josh, the smell of fix makes me smile. I had entered BYU as a photography major. I blame an ex-boyfriend for my chickening out on photography. The goal had been to move to NYC and work for Rolling Stone magazine as a photographer. But in the end it was good. I switched to graphic design ... dropped out to rebel a little ... went back and graduated with a BFA, emphasis Graphic Design.\n\nI suppose I blame U&lc for my addiction.\n\n"
    },
    {
      "time": "5 Aug 2005 — 11:51am",
      "content": "My parents kept the lettering manuals they had in college and beyond. My father taught at Pratt Institute in the 50's, when lettering and calligraphy still had a place in the general design curriculum. I first came upon an old, worn copy of [Lettering And Alphabets](http://web.archive.org/web/20131014041306/http:/store.doverpublications.com/0486200531.html) at about 4 years of age. Somehow I also got a look at Pen and Graver as a child, though I can't figure out where. In high school my mother gave me her 1941 copy of the Speedball Lettering Guide.\n\n"
    },
    {
      "time": "5 Aug 2005 — 12:04pm",
      "content": "Somewhere I have my copy of the \"Speedball Lettering Gude.\" It was a mid-fifties vintage though. I still remember those stroke directions :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Aug 2005 — 12:39pm",
      "content": "Most of the foundation for my type fixation was constructed unconsciously: I wasn't aware of type per se through most of it. My mother taught me some basic calligraphy (Johnston's foundational hand) when I was struggling with handwriting at a child -- I still struggle with handwriting and my calligraphy is slow and plodding, but I imbued some basic idea that letters can be made in a variety of ways. After university, I worked in the antiquarian book trade for a few years, and this was my real introduction to type, although I still wasn't consciously thinking about type in itself as an interest. I remember very clearly the title page of a Bodoni works of Cicero that I stumbled across in the shop, and being aware that this was something unusual and splendid. I also remember looking at a first edition of Wordsworth's \\_Preludes\\_, and this came to mind later and helped me understand the connection between romantic typography and romanticism in the other arts.\n\nIt was only later, meeting Gerald Giampa who was then based in Vancouver, that the bits and pieces of this unconscious typographic background fell into place. Then I was hooked.\n\n"
    },
    {
      "time": "5 Aug 2005 — 2:32pm",
      "content": "I had been interested in letterforms for ages (alternating writing with a Rapidograph and with an Osmiroid pen through high school), but only became fixated on typography when in about 1980 I began working for a computer graphics start-up in Pittsburgh. I spent the better part of a summer editing bitmaps of Cheltenham Bold 24, trying to simulate kerning, trying to guess how different degrees of magnificaiton and different color schemes would affect the appearance of the face. It was maddening, addictive, and dangerous; I know enough to be annoying both to people who know nothing about typography, and also to people who actually know a plausible amount.\n\n"
    },
    {
      "time": "5 Aug 2005 — 3:50pm",
      "content": "I thought of another \"event\" when I was a student. I was working in a darkroom and to test dmin and dmax, I took a discarded piece of a lith neg from typesetting and haphazardly put it in the enlarger. I projected it down on to the easel and exposed a scrap of paper. When watching it come up in the developer tray, I noticed the power of the extremely enlarged letterforms bleeding off and cut off at random angles. The form and counterform was more powerful than any Motherwell I had ever seen. I then started superimposing type negs and double exposing others. The power of the letterforms shown through the visual beating I had given it and came out even stronger. I was starting to learn to \"see\".\n\nChrisL\n\n"
    },
    {
      "time": "5 Aug 2005 — 5:34pm",
      "content": "I guess it was when I has at \"high school\" and liked to draw rock band's logos on the back of my notebooks (in boring classes). That made me aware or letterforms and their exquisiteness.\n\nI drawed a font based on Caifane's logo and wanted to make it digital so I got a buggy freeware program but abandoned it after the fifth glyph (it was really hard).\n\nHéctor\n\n"
    },
    {
      "time": "5 Aug 2005 — 7:24pm",
      "content": "I recall being aware of type when I was learning to read in first grade. I remember noticing the \"fi\" ligatures in the reading primers. They also had large letters accompanied by pictures (e.g., Ss with a picture of a snake) hanging on the classroom wall and I remember staring at the typographic forms, not really wondering about how they were made, just being fascinated by the shapes and how perfect they looked. It was probably Century Schoolbook if my memory is reliable.\n\nThroughout my childhood I was vaguely aware of type, though my interests were elsewhere (cartooning especially). I remember noticing the Latin Wide type they used in _Mad_ magazine. It was easy to imitate, with those big triangular serifs, and I doodled words in that style all over my note books when I was about 10. From then on I became increasingly aware of type and lettering and began doing a lot on my own, trying to draw letters correctly, the way they looked in type. I still have a hand drawn copy of a headline from the Hertz \"We Try Harder\" campaign that I did in 8th grade (Perpetua Bold, though I didn't know it at the time).\n\nI was also influenced by two uncles, one on each side of my family. One was an artist who also did sign painting and cartooning. The other was going to art school when I was a kid and became a graphic designer. From him I learned about Helvetica and _serious_ graphic design. Like many others, the Speedball book was a factor. I was a big user of rub-down type starting in high school. My dad was friends with the guy who did all the in-house graphics stuff were he worked, so there was some influence there, too. He gave me an Alphabet Innovations specimen book which had a big impact on me.\n\nThe clincher was seeing an early issue of U&lc. in 1974 when I was taking graphics courses in college. All the pieces just fell into place and I decided then and there that someday, somehow, I wanted to design typefaces.\n\n"
    },
    {
      "time": "6 Aug 2005 — 6:59am",
      "content": "I also had a big interest in cartooning growing up. Because I loved to draw, I was asked in high school to make several flyers and t-shirt designs. Although then it wasn't apparent, I always had an interest in experimenting with different styles of lettering.\n\nIt wasn't until I entered the graduate design program at Pratt where I really made the connection of typography to my illustration. I started understanding letterforms and from there I was able to polish my lettering a bit more, often making my own typography for design projects. My Thesis project (as its been mentioned many times by now) where I sat down and actually made my first set of typefaces completely sealed the deal for me. I'm now obsessed for life.\n\n"
    },
    {
      "time": "6 Aug 2005 — 8:52am",
      "content": "Typography II class with John Langdon this past winter....now I'm way past the 'recovery' point! :D\n\n"
    },
    {
      "time": "6 Aug 2005 — 10:55am",
      "content": "I too, first became interested in _letters_ as a kid when I found an old Speedball instructional lettering book in my grandparents attic. I studied it and was fascinated by all the different styles and moods letters could invoke. I remember designing a report cover in 5th grade in a Speedball poster lettering style that I thought captured the feel of the Vikings. I was so much more enthused about the report cover than the report itself. And, of course, I had to teach myself _Old English_.\n\nI later became interested in _type_ when I was studying Graphic Design in college. I think I had an epiphany in my first typography class—that the basic units of graphic communication are letters. And what could be a more pure form of graphic design than the design of the type itself? I think from that point on I was hooked.\n\n"
    },
    {
      "time": "6 Aug 2005 — 1:04pm",
      "content": "If you all are interested in hearing the experiences of a non-profi: There were two things that made my typophilia inevitable.\n\nOne was the layout of MIT Press's philosophy and political/social theory books that I encountered in graduate school. MIT used and still uses Baskerville--first MT, I think, and now ITC New--to excellent effect, despite the criticisms I have heard especially of the latter digitization. The first fonts I ever bought licenses for (it's how I discovered MyFonts) were faces of ITC New Baskerville.\n\nThe other was the New Left Review's redesign in 2000. The updated design combined Majoor's Scala and Scala Sans. The look of the journal kept me subscribing long after I realized that the content had become shrill and obscurantist, and I spent money I should have been saving to get me out of my crappy position buying a few of those licenses. (Thanks to FSI's keywording project I now have the complete array.) How deeply did I fall in love with those fonts? I recently used InDesign to create a template for my course syllabi just like that of the NLR. Those Scala 7s still draw my eye, every time.\n\n"
    },
    {
      "time": "6 Aug 2005 — 7:59pm",
      "content": "It was mostly Transworld Skateboarding/Snowboarding and Thrasher magazine in the early 90's that got me into type and design. I was also very inspired by skateboard company logos and drew them over and over again.\n\nWhat really pulled me in was the 1995 Emigre catalog. I must have paged through that thing a couple of thousand times.\n\n"
    },
    {
      "time": "6 Aug 2005 — 9:33pm",
      "content": "What a great thread.\n\nI had been printing for about six months and was scouring the libraries for anything on printing, typography, fine press books. . . and one day I found a book on the shelf that was a Random House publication of one of Poe's poems. The format looked odd so I must have been drawn to it. The first line was \"the demon put his hand on the little boy's head.\" At least that is what I remember. It was in Preissig Antiqua. That was the first time I understood the power of letterforms.\n\nI discovered Preissig did a number of letterpress books for Random House and, interestingly enough, in hunting down some reviews of these books, I discovered the Anglo-American typographic community was outraged by the typeface. Which, of course, made it even more dear.\n\nGerald\n\n"
    },
    {
      "time": "6 Aug 2005 — 9:34pm",
      "content": "Somewhere between fifth and sixth grade I got tired of using stencils to title coversheets on my book reports and started to draw letters freehand.\n\nBy the seventh grade we had options for \"shop\" class, so I selected Printing. The Junior High had an old platen letterpress machine in the basement and a decent assortment of metal type in California job cases. My first project was a business card, and the first type font I used was Kaufmann Bold.\n\n--------------------------------------------------------  \nYes, I'm old, and learned to set hot metal by hand!\n\n"
    },
    {
      "time": "6 Aug 2005 — 10:58pm",
      "content": "I think I was always interested in type on some level, being a nerdy child who spent much of his childhood buried in dictionaries, encyclopedias, and other typographically complex books. Long before I was able to name typefaces on sight, I was able to tell that different typefaces gave texts different feels, and I thought that was important, even though I couldn't really say why.\n\nMy mom spent a lot of time editing newsletters when I was a kid, and so I got a pretty good feel for 70s-80s era DiY design: typewriters, transfer lettering, pasteup. I spent hours with our first dot matrix printer trying to get it to do interesting things with its built-in typefaces (just getting them all to work felt like an achievement), and then when WordPerfect 5.0 came out for the PC, I spent forever playing with its WYSIWYG tools, eventually getting incredibly frustrated by how hokey the whole thing was. What I really wanted was a Mac, because my school had just gotten some, and I'd spent a lot of time tweaking font bitmaps (and doing lots of other things) with ResEdit. ResEdit helped me figure out that I could make pretty things without programming\n\nAround then, my mom got a copy of one of the early low-end WYSIWYG desktop-layout packages (PFS: First Publisher ring any bells for anyone?), and I went to town. I wrote a book of poems to impress a girl (didn't work) and I think I used every single font it offered, at least twice (I don't know which is more embarrassing -- the spectacularly awful poetry or the over the top \"design\"). Shortly thereafter I got internships at a software company (designing presentations for one of the trainers) and a comic book company (helping set up their digital prepress and doing production design), so I got exposed to a pretty broad set of skills, from the old-school (stat cameras) to the cutting edge (high-end Agfa RIPs, Illustrator 88 / PhotoShop 1.0).\n\nThen, in college, I had several radio shows, and produced what I think is still my best design work, to promote a series of show that ran at 2 in the morning and only drunk frat brothers and lonely high school misanthropes ever heard. Excellent! Somewhere around here I decided that there was probably more to life than Futura and Optima, and started getting more anal about dealing with my type collection.\n\nI became a rave promoter a little later, and was determined to not repeat the same mistakes that every rave promoter since the dawn of time has made in designing flyers (they all seemed to end up looking like technicolor yawns, which is probably appropriate that there were DJ names like \"Psychoactive Frog\" and \"Rumpleforeskin\" all over them -- one of those is an actual DJ name, and I'll allow you all the pleasure of deciding which). Despite the fact that my flyers were relatively tasteful and restrained, people still showed up to my parties. Perhaps it was because I was living in a small city and had a captive audience.\n\nI also got seriously into TeX and LaTeX, mostly just because they're a tweaker's paradise, but was seriously frustrated with what I saw as TeX's piss-poor support for type (I spent some time dallying with Metafont, but that was seriously ridiculous).\n\nSince 1995, I've been working in web design and software development, which means I've been exposed to a lot of crappy type and hideously unreadable interface design, but I've lived in San Francisco, one of the most design-savvy cities in the world. Type has been an important but peripheral part of my life for a long time, but it's only in the recent past that it's started becoming more central, to the point that now I'm going through the process of sweating blood trying to learn how to design typefaces. I'll keep you all up to date on how that goes (so far: very slowly).\n\n"
    },
    {
      "time": "6 Aug 2005 — 10:59pm",
      "content": "Jeez, that was long. Sorry!\n\n"
    },
    {
      "time": "6 Aug 2005 — 11:40pm",
      "content": "Neville Brody & Peter Saville. They shot my brain full of wonder. I resisted type design for a long time. But in the end the pull was to strong.\n\n"
    },
    {
      "time": "7 Aug 2005 — 9:49am",
      "content": "hrant, even to this day i find my quickest sketches paying homage to the Tolkien influence. i guess you just can't shake your roots. i must have looked such the 'nerd' in study hall drawing letters trying to explain how really 'cool' they are\n\ni give the LOTR movies 1.5 thumbs down for skipping over a lot of my favorite parts of the books. mostly the times where nothing is happening and they are just sitting around a fire. those were the parts where i felt i was really in it. the hollywood movie version moves much too quickly for my taste. (little off topic)\n\n"
    },
    {
      "time": "7 Aug 2005 — 4:25pm",
      "content": "oh la la...... I don't have any story (i.e. fifth grade I designed.....). and I don't have any fixation (even i was around art director, photographer, creative director, production designer, fashion designer......)\n\nI started with photography & drawing/painting; I love it. I love type & design. but no fixation.\n\nthat is my story. more or less.\n\n"
    },
    {
      "time": "7 Aug 2005 — 4:33pm",
      "content": "I guess anyone who used certain gifs to use as Typophile personal icon the links are busted.\n\n[http://www.typophile.com/forums/clipart/happy.gif](http://web.archive.org/web/20131014041306/http:/www.typophile.com/forums/clipart/happy.gif \"http://www.typophile.com/forums/clipart/happy.gif\")\n\n"
    },
    {
      "time": "9 Aug 2005 — 3:54pm",
      "content": "For me it was when I was a kid and my parents would take me to a restaurant, like Pizza Hut, and I would draw on the back of the placemat. I would spend the whole time before the food came drawing the alphabet.\n\n"
    },
    {
      "time": "10 Aug 2005 — 3:29am",
      "content": "There was this wee book called \"the Lettering Book\", obtainable through primary school book clubs. When it came to Social Studies projects all I ever cared about was the layout and title page design! I spent ages looking at the letterforms, slavishly copying them to the best of my ability. Ahh, the spiral bound beauty of the Lettering Book.\n\n"
    },
    {
      "time": "10 Aug 2005 — 5:25am",
      "content": "This is long, print it if you like.\n\nIt was a hot dusty day and the sun hadn't risen yet. The camels were parked on the shadowed face of the dune taking in the last of their water before slobbering off to sleep. I had walked to the top of a dune to see if we'd been followed out the last dry river bed and the rest were making camp. We would pass the day inside our thickly carpeted tents, because it would be just too hot outside. Just then, as I looked back to the tents, a tumbling of sand colored shapes came sprinting out of the shadow of a dune beyond the camp from where I stood. A more dangerous threat could not have emerged as lions, two young males and a female, bore down on the camp. I cried out as loud as I could, but I was downwind and they couldn't hear my warnings. By the time I'd run back the lions had taken my wife who'd been gathering wood, and everyone was screaming and running around.\n\nI sprinted to Yaboodi's third horse, and jumped on, chasing the fiendish beasts over many dunes to a wooded grove around a spring. But by the time I arrived there was nothing left but my poor Ruthie's head, hair all knarled and twisted in sticks, dirt and blood that covered her whole face. As I bent down to gently cradle my love's head to my chest one last time, I felt the horse tug, looked up, dropped Ruthie's head and bracing the butt of my spear to my foot just in time I fixed my point in the hideous fanged mouth of the young lion as he leapt from the forest gloom. Down in the dust he went, groaning and choking in his own blood. Hearing a snort, I turned in time to see the horse crush the rib cage of the other male with a flying hind kick as the beast was leaping at my back. I beheaded the first kill and then neck speared the rib-wounded male while keeping my eye on the female I saw lurking off in the trees with the rest of Ruthie. She ran further off when Yaboodi's brother Ot arrived with two others on drowsy but frightened camels.\n\nAfter we'd taken the lion heads and bodies and Ruthie's head back to camp, I sat down and started to cry and tear my hair out in our tent. In a while, Yaboodi's wife, Clu came in from Ruthie's ritual washing, which had taken only ten minutes, but she stopped almost at once so the tent flap fell back down on over her head. She said, \"Wow what a good idea!\", and then backed out of the tent. I was too heartbroken to care and sat for a while longer before Ot came in and said Yaboodi was coming to see me. So, I straightened out my hair, stood up and rested one hand on the head of a young male lion and the other on my spear to greet my clan boss. After a suitable commotion outside, Yaboodi too came in and stopped short, his spearmen clattering into him from behind and the side causing ugly grunts and strained looks all around. But then Yaboodi's gaze ran down to my chest where he stared and then muttered \"Wow!\" I then looked down and saw what appeared to be a distorted view of...Ruthie!\n\nWell, Yaboodi thought this was so cool he outfitted all his guys in Lion faced shirts, wouldn't let me make them for anyone else, and all I got out of it was the Ruthie shirt, which everyone loved but I couldn't copy. I spend my days editing the hunting of lions down to the best faces, and making lots of copies. But then I convinced Yaboodi to let me make a monkey face for his jester, and that went over so well everyone wanted them for their kids, and for parties. Then, Yaboodi died in a game of \"spite your face\" with neighbor boss, Nose. Nose's real name was not Nose, but everyone called him that because he had no nose. Anyway, Yaboodi was just barely dead with a knife in his nose when we had to offer out allegiance to Nose, Ot and all.\n\nNose loved the faces and soon I was making two, three and four-lion face shirts for him and his guys. Then one fine spring day Nose gave me his daughter Claire to replace Ruthie finally. Claire was named for the fact that her face was smoother than everyone else's and was clever enough to figure out you could print a face without dying in your own blood. So she made an unauthorized shirt of her own Claire face with goat blood. This caused great consternation in the village and eventually Nose found out and wanted one of his own face. Well, it was pretty much the first grotesque I'd made, 'cause without a nose, the eyes and mouth are too clear. But nose didn't care as it looked a lot like him and scared everyone even when the shirt was drying on the line.\n\nIn my later years Nose killed an Egyptian near the river, so I got to make one of those, and that's when I became more interested again. But soon, I became disenchanted with the whole bloody process and started thinking about simpler, less stressful ways of making good faces. One day, washed up on the shore of a land Ot was governing for Nose, they found a Thin Roman, and a matching Italic. I would have handed the business on then, but we also found a barrel of black liquid; sticky, but impervious to water, and never faded or changed colors like blood. Well, then I was totally hooked and I wanted to do every single face in the world but I was very old then. This is also the point at which the PR and marketing departments stepped in and said my bio cannot be comprised completely of experiences gained by consultations with a neo-pagan, blood-type advisers, and contacts with the netherworld via spells. They insist on bio material that can be verified by \"normal\" means, so the rest of the story is on our web site in my bio. But it's boring.\n\n"
    },
    {
      "time": "10 Aug 2005 — 6:00am",
      "content": "David,  \nwhat horrors you endured for art.  \nDid you come upon the corpses of Goths or Latins during your bloody travels?\n\n------------------------------------------  \nYes, I'm old, but I've faced it!\n\n"
    },
    {
      "time": "10 Aug 2005 — 6:46am",
      "content": "Shucks, my wife is named Ruthie. Now, every time I look at her, I will just want one of your T-shirts:-)  \n So, did you ever figure a way to have the marketing guys do a meeting with the Lions? I think that would have made a big impression on them--being the type of guys they are. You might then have to name your Lion Vandercook (at least Vandercook washes up after making an impression).\n\nChrisL\n\n"
    },
    {
      "time": "10 Aug 2005 — 7:38am",
      "content": "David, that was good.\n\nhhp\n\n"
    },
    {
      "time": "15 Aug 2005 — 7:31am",
      "content": "\"So, did you ever figure a way to have the marketing guys do a meeting with the Lions?\"\n\nYeah sure! This eventually evolved and Fred Ebrahimi of Quark taught me the modern method: Every few months, he'd wander through that department firing 25-30% of the staff, waiting to see if it had any effect on marketing, and then either firing more, or hiring a few back. But back in the really old days, when \"fired\" had a different meaning all together, the lions were still happy in the end if you used the right amount of salt and cheese, and absolutely no pepper (the Philly cheese steak, after all, was named after Phillip of Macedon who had way too many marketing people and lions...), but that's a whole 'nother age of my type history.\n\n"
    },
    {
      "time": "15 Aug 2005 — 8:34am",
      "content": "So there was my Uncle Ben, at the peak of his career, Editor of the San Francisco Chronicle. Being curious about everything and full of energy, he wanted to understand the presses. So he went down to the press room. The press men sent him packing: \"You can't touch the presses, you aren't Union.\"\n\nSo, unstoppable that he was, he bought his own small printing press to learn about printing. Fair enough to say he fell in love with everything to do with printing. Meanwhile the Chronicle changed owners in a corporate upheaval and put in a new editor. So Uncle Ben went over to the 'dark side' and went into public relations. But his passion for everything to do with printing just increased.\n\nHe founded his own 'Myriade' press, leading the private press movement in the New York area. He wrote 'Types of Typefaces'--a superb book--and 'Printing as a Hobby', and tried to spread printing and paper making in poor countries. And he founded the American Printing Historical Society, whose annual lecture is named after him. He also bought and installed in his house the Kelmscott press, on which William Morris had printed his famous 'Chaucer'. He was in the process of printing (on another press) the first edition of Mac McGrews 'American Metal Typefaces' when he died.\n\nMarried to my Mother's sister, he talked my Dad into taking up printing as a hobby, printing the stationary for his dental office. And I ended up helping him do it, and printing stuff for myself just for fun. That was fun, but the most fascinating thing to me was typefaces. So I kept on looking at type for the next thirty years (ok forty, but who's counting), calling out 'Baskerville' and 'Optima' at odd moments, and getting extremely strange looks from everyone, including my family.\n\nThen I discovered 'Typophile'.\n\nOh-oh.\n\n"
    },
    {
      "time": "15 Aug 2005 — 9:52am",
      "content": "I think Chris Ware got me really interested in letters.  \n [http://www.hammergallery.com/Artists/Ware/ware\\_chris.htm](http://web.archive.org/web/20131014041306/http:/www.hammergallery.com/Artists/Ware/ware_chris.htm \"http://www.hammergallery.com/Artists/Ware/ware\\_chris.htm\")\n\n"
    },
    {
      "time": "19 Aug 2005 — 1:20pm",
      "content": "\"...printing the stationary for his dental office.\"\n\nWilliam, So tht is how you cut your teeth on typography :-)\n\nChrisL\n\n"
    }
  ]
}
