{
  "id": "144",
  "title": "Forum Access",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "When Typophile first launched almost two years ago, the doors were wide open. In light of recent events, we've decided to hire a bouncer.   \n   \nCritique, News & Events, and Technical Issues will now require an account to post.   \n   \nGeneral Discussions will still allow users to post under a pseudonym without an account. If a forums user would like to post free of anonymous respondents, they can post to Technical Issues.   \n   \n**Typophile Forum accounts are still free** - if you haven't done so yet, join the hundreds of others who have clicked \"Login/Register\" to sign up for instant registration. It's quick and hassle-free.   \n   \nWhile we encourage healthy debate and meaningful discussion, posts containing inflammatory remarks and/or personal attacks will be deleted in their entirety by the board moderator.   \n   \nPlease send moderator nominations to : [forums@typophile.com](mailto:forums@typophile.com)\n\n",
  "author": "Jared Benson",
  "time": "8 Apr 2002 — 11:08am",
  "uid": "3",
  "comments": [
    {
      "time": "11 Apr 2002 — 9:45am",
      "content": "A step away from the communist ideal, there, Joseph?\n\n"
    },
    {
      "time": "11 Apr 2002 — 9:53am",
      "content": "Communist? A die-hard capitalist who drives a Ford Mustang in the \\*UK\\*?! I can hear Marx pounding the lid of his coffin.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Apr 2002 — 11:15am",
      "content": "Christian, the issue was that Jared wants to close off a good portion of the forums to anonymous posters - I think it's better if he creates a members-only area than close existing access.   \n   \nMy Mustang gets a mention here, a sad day indeed - mines a long way from the site of it's birth (Nottingham, England), I bought it in Wellington, about five years ago - must be some kind of Commonwealth thing, there's a few Raleighs around here.   \n   \n [http://www.mtbreview.com/passion/messages/235641.html](http://web.archive.org/web/20131018135908/http:/www.mtbreview.com/passion/messages/235641.html)   \n   \nAnd picture here:   \n   \nhttp://www.club-ghost.de/anfang.jpg   \n   \nWouldn't you have to convert a Ford Mustang to right hand drive in the UK Hrant? What kind of gas mileage do you get out of it? Got to go to work... later!\n\n"
    },
    {
      "time": "11 Apr 2002 — 11:54am",
      "content": "\\> Jared wants to close off a good portion of the forums to anonymous posters   \n   \nCorrection: It's a done deal.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Apr 2002 — 3:04pm",
      "content": "If I may, this seems a bit wide-ranging.   \n   \nIf you want a members only area, then have one, dedicated, members only area.   \n   \nIf you want to keep it really \"sane\" then make it by invitation only (ie only a sub set of \"members\").   \n   \nIf the discussion then migrates to the members only area, then the inference will be clear.\n\n"
    },
    {
      "time": "8 Apr 2002 — 11:29am",
      "content": "thank you - the \"lawsuit\" thread was getting ridiculous.\n\n"
    }
  ]
}
