{
  "id": "14419",
  "title": "First Font—Parker Sans (still untitled…)",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "ok. my first font. I worked (only) with Illustrator. So— what do you think?\n\n| Attachment | Size |\n| --- | --- |\n| [Untitled-2.jpg](http://web.archive.org/web/20150123112328/http:/typophile.com/files/Untitled-2.jpg) | 128.86 KB |\n| [numb1.jpg](http://web.archive.org/web/20150123112328/http:/typophile.com/files/numb1.jpg) | 84.52 KB |\n| [newsample.jpg](http://web.archive.org/web/20150123112328/http:/typophile.com/files/newsample.jpg) | 148.16 KB |\n| [newversion?.jpg](http://web.archive.org/web/20150123112328/http:/typophile.com/files/newversion?.jpg) | 92.65 KB |\n| [pan.jpg](http://web.archive.org/web/20150123112328/http:/typophile.com/files/pan.jpg) | 126.81 KB |\n\n",
  "author": "parker",
  "time": "6 Aug 2005 — 8:27am",
  "uid": "4955",
  "comments": [
    {
      "time": "6 Aug 2005 — 8:36am",
      "content": "This should be in the 'critique' section. I like the modulation of the strokes; it has a welcoming look. There are problems with getting the weights of the strokes of different characters to harmonize. The e stands out as too heavy. I think if you get this into FontLab, you will find it easier to harmonize and develop it.\n\n"
    },
    {
      "time": "6 Aug 2005 — 9:18am",
      "content": "\"There are problems with getting the weights of the strokes of different characters to harmonize\"\n\nlike what?\n\n"
    },
    {
      "time": "6 Aug 2005 — 9:29am",
      "content": "By the e being too heavy I mean in comparison to the o and c. Also the right diagonal of the A seems to be heavier than the left diagonal of the V.\n\nI like what you have drawn, and think it is promising. But I think there is a lot of work on such matters to make it look polished and balanced. It will be worth the effort. Compare with such very polished stuff such as Frutiger, Scala, Syntax, Thesis and Fedra for ideas--also Franklin, as you have a touch of it in your c etc. [adding again]--also Optima.\n\n"
    },
    {
      "time": "6 Aug 2005 — 9:34am",
      "content": "I personally wouldn't expect to encourage something as \"mainstream\" as this, but then it hit me that it combines the good traits from a number of \"classic\" fonts, and does it rather well. So yes, finish it!\n\nhhp\n\n"
    },
    {
      "time": "6 Aug 2005 — 12:26pm",
      "content": "thank you. I have more samples (numb1.jpg)\n\n"
    },
    {
      "time": "6 Aug 2005 — 1:46pm",
      "content": "Tina,  \nThe \"e\" problem mentioned by William may be a \"total width\" problem as opposed to a stroke weight problem. Without measuring, widen the e, keeping the stroke weight the same, until it feels equal to the o. You will probably have to test text sizes to really know if it works. Letters with several strokes can start to feel heavy--the 2 story g is typical but even e and a have need for optical correction. The diagonal crossbar on your e causes dark spots at joins but that doesn't mean don't do it, it just means you have to find other ways to counter the effect. You will probably learn more about designing glyphs as a set by doing it your way than doing it an easier way so keep it up!\n\nChrisL\n\n"
    },
    {
      "time": "6 Aug 2005 — 2:41pm",
      "content": "I think this has a lovely 'classic' feel to it. I agree with Hrant that it's worth while finishing it.  \nPersonally I kinda like the 'e'. OK, it will give you problems solving the graytone in your font, but if I see how you've managed your first curves, I'm fairly confident you'll do just fine.  \nGet it into FontLab and you can more easily work on the harmony of the font.\n\nSome little things you might wanna look for:  \n- Maybe give the foot of the 'y' a bit more weight. It ends a bit to thin, if you ask me.  \n- The spine of the 'S' is to heavy. And it seems to be hanging backwords just a bit. You might wanna rotate a degree clockwise.  \n- The 'M' could be more heavy overall.  \n- Perhaps you should modify the bowl of the 'p'. It's to much an 'o' with a stem stuck to it. Technically you did it right, but optically something bothers me about the bowl/stem configuration (look at the word 'Up'). The 'q' seems fine to me.\n\nI love:  \n- Your big 'O'  \n- Your numerals look very promissing. I want to see more, please. I think they'd be very lovely as OSF (Old Style Figures).  \n- Your sharp curves, they have a freshness to it.\n\nKeep up the good work and give us an update when you've put it into FontLab. I'd like to see some text set in this font.\n\nRegards,  \n®ené\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20150123112328/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": "6 Aug 2005 — 7:06pm",
      "content": "thank you guys.\n\nyou can see \"newsample\" ( with more letters). I didn't fix a lot since i didn't have a lot of time.\n\n[by the way,sorry about the U — the first sample; there's a little \"hill\" since of the gauge ball and other lines/guides. my mistake)\n\nthank you again.\n\n"
    },
    {
      "time": "6 Aug 2005 — 7:13pm",
      "content": "So let's see a pangram. Preferably an alphabetically-ordered one:  \n\"Abacist's deaf dog hijacked luminous parquetry studio, avows ex-yakuza.\"\n\nhhp\n\n"
    },
    {
      "time": "7 Aug 2005 — 12:09am",
      "content": "This seems like a typeface that Doyald Young would love, largely because it feels like it descends from an inscriptional model (i.e. the caps feel a lot like Optima to me). It's very clear and fresh feeling, although there's a tiny whiff of late-70s high-class apartment lobby to it (don't ask me where I come up with these associations, I just do).\n\nMore specifically, the bar on the R feels weak, I like the X although I fear it's a little out of character for the rest of the font, and the slanted bar in the e is cute, although it inevitably calls Kabel to mind. I want to see b, d, p and q larger, because right now I'm not sure I'm that enthusiastic about the d and the p's counters.\n\n"
    },
    {
      "time": "7 Aug 2005 — 2:21am",
      "content": "Take another look at the R. The bowl/leg connection is very thin. I would make it as thick as the P. Now it falls a bit out of place.  \nAnd if you descide to change it, perhaps slant the leg a bit more. Rotate it counterclockwise. This will give the R a bit more profile and sharpness.\n\nRegards,  \n®\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20150123112328/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": "7 Aug 2005 — 5:25am",
      "content": "PS: Perhaps you might wanna try to open the G a bit more. Try bringing the top curve a little more up.\n\n®\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20150123112328/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": "9 Aug 2005 — 9:26am",
      "content": "Ooh, an alphabetically ordered pangram. That's genius! I'm adding it to the [pangram](http://web.archive.org/web/20150123112328/http:/typophile.com/wiki/pangram) entry. (Hrant, can I credit it to you?)\n\n"
    },
    {
      "time": "9 Aug 2005 — 9:52am",
      "content": "First thoughts:\n\n\\_R\\_ the weight of the bottom part of the upper bowl is too thin. the extending leg seems to be a little heavy.  \n\\_S\\_ & \\_s\\_ the shape seems to be skewed backwards a hair.  \n\\_G\\_ appears to be larger than the \\_O\\_\n\nThis is really nice. I'd be curious if you are working on an italic to work with it. Are you?\n\nI see shades of Cosmos in this as well.\n\n_Rene, your icon, while I love the colors, doesn't help when I have a headache. :^P_\n\n"
    },
    {
      "time": "9 Aug 2005 — 9:59am",
      "content": "Tina,\n\nWhat you have taken on is quite difficult for a first font. It looks great, so keep going! There are several influences that might be hard to reconcile: The 2 looks like a good old grotesque, the e says \"70's\" to me, and the vertical stroke axis is reminding me faintly of Peignot. Otherwise it looks like a very strong, classic humanist sans with a little geometric stiffness thrown in. Nice!\n\nI hope you have been looking at other modulated sans designs all the while. Though the style is very different (and should stay that way), look at Legacy Sans for ideas about distributing weight and how far to go with modulation. Stellar is another design you could study; it's quite subtle and interesting (metal versions preferably). Also Charlotte Sans, which is subtly modulated if a bit stiff.\n\nI'm intrigued you are exploring this area; If we are going to have another century of Sans Serif type, it ought to evolve, and modulating the stem weights opens a lot of possibilities for typefaces which have been seen as limited in usefulness.\n\n"
    },
    {
      "time": "9 Aug 2005 — 10:19am",
      "content": "\\>a tiny whiff of late-70s high-class apartment lobby\n\nI think that in developing this font you have the challenge of creating self-made 'rules' consistently carried out (such as problem of the light weight of the bottom of the R bowl), but without making it staid or stale--you don't want that 'tiny wiff' to become more than that.  \nBalanced and consistent, but still fresh--not easy to pull off, but great if you can.\n\n"
    },
    {
      "time": "9 Aug 2005 — 10:35am",
      "content": "Joe, glad you like it. I made it\\* for P22's pangram contest, and won a free font. Some of the higher finishers (I think I got 9th) were quite good though. Where's the link again?\n\n\\* And a variant. Let's see more, people!\n\nI think ordered pangrams are quite useful, because they ease the quick evaluation of a font. And they don't cost anything. They sort of help alleviate the lack of a charset showing, and provide an impression of the spacing that a charset can't anyway.\n\nBTW, nowhere near \"genius\", more like three days of pure torture. :-/\n\nhhp\n\n"
    },
    {
      "time": "9 Aug 2005 — 10:58am",
      "content": "Tiffany, is your headache any better now? Drink some water, and go early to bed and everything will be fine tomorrow. ;-)\n\nRegards,  \n®ené\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20150123112328/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": "9 Aug 2005 — 11:08am",
      "content": "_Thanks, René_\n\n"
    },
    {
      "time": "10 Aug 2005 — 1:03pm",
      "content": "thank you (i'll post more soon). thank you again.\n\n"
    },
    {
      "time": "10 Aug 2005 — 2:17pm",
      "content": "Hrant, only 9th? You wuz robbed!\n\nTina, what are you trying to do?  \nIs your design positioned against other faces such as Optima or Stellar?  \nOr is it the working out of some principles?\n\n"
    },
    {
      "time": "10 Aug 2005 — 2:39pm",
      "content": "Thanks. Some of the higher ones were quite good though:  \n [http://www.p22.com/products/pangramcontest.html](http://web.archive.org/web/20150123112328/http:/www.p22.com/products/pangramcontest.html \"http://www.p22.com/products/pangramcontest.html\") \\_  \nI really think #7 should have won - I think it was  \nRichard's fav too. And you can see mine's variant.\n\n(BTW, that \" \\_\" is to trigger linking without a linebreak.)\n\nhhp\n\n"
    },
    {
      "time": "14 Aug 2005 — 12:30pm",
      "content": "Tina,\n\nI don't have much to add to what's already been said. There are definite problem areas which have mostly been mentioned, like the too-thin part of the R.\n\nIt does appear that you have a good grasp of the basic tricks of construction (e.g., correcting for optical effects, visual vs. geometric center, etc.).\n\nI would agree with Carl about the numbers. They are very nice, but don't seem to fit the rest of the design.\n\nI think I would rather see a horizontal bar on the e. The Jenson e does not really seem to fit this design. If want to keep it, you could try to work more angular stress into the overall design. Then it might work better.\n\nI would be tempted to put a crossbar on the G. In a face like Optima, you can get away with that form because all the other curved forms are very open. Here, your curved forms are more closed, so it leave a sort of trapped empty space in the G. A crossbar might mitigate this. It's worth a try, anyway.\n\n"
    },
    {
      "time": "18 Aug 2005 — 7:14am",
      "content": "Keep up the great dialogue as part of [Critique Thursday](http://web.archive.org/web/20150123112328/http:/typophile.com/node/14678)!\n\n"
    },
    {
      "time": "18 Aug 2005 — 9:20am",
      "content": "I still find the R too spindly in the waist.\n\n"
    },
    {
      "time": "18 Aug 2005 — 9:48am",
      "content": "I'm here for this one... if Tina puts up a pangram/charset.\n\nhhp\n\n"
    },
    {
      "time": "18 Aug 2005 — 10:00am",
      "content": "here's some advice to take with a grain of salt:\n\noverall the contrast patter seems rather spotty: too spinly in some places, too beefy in others. i'll try to point out some trouble spots i felt were distracting.  \nToo heavy: upper arm of K, upper join of R's bowl to the stem, as are the points (both) where the bowl of the P joins the stem.  \nToo light: the diagonal stroke of the N, also the second stroke of the M (middle left).  \nThe S needs more contrast between thicks and thins.  \nThe e with a diagonal bar feels out of place. maybe it just needs to be more subtle.\n\n"
    },
    {
      "time": "18 Aug 2005 — 11:13am",
      "content": "Hello all...... from New Zealand — and don't ask me what I'm doing there :) :)\n\nThank you very much. and i hope this is ok to say that: thank you to Mr. David Berlow that offered his help. So i'll try to finish the font.\n\n• The main reason that I didn't rush to post, or to fix this problem or another is:  \n I wanted to be a little far away from the font — in order to have a better point of view; like drawing/painting.\n\n• Model: I don't have any model — I just studied other fonts and started to draw (first by hand). only now i know about Stellar. thank you.\n\n• FL : I hope to buy soon (sometimes I can work with it when I see my friend; but when she's not around I work with Illustrator)\n\n• \"R\" — yes I know about the problem; the main reason that I posted the R is to see if there's a problem with the proportion.\n\n• i tried to create a new version (?)...........\n\nedit: the new version — don't look (yet) for kerning, spacing.....\n\n"
    },
    {
      "time": "18 Aug 2005 — 11:31am",
      "content": "I like the extreme contrast in the middle of the R. The leg is a little too wide, and the terminal needs help, but the original idea is great. However, the character seems out of place in the greater context of the font. You need to either add some of that extreme contrast somewhere else, or take it out of the R. Don't take it out, though. It's the best idea in the font so far.\n\n"
    },
    {
      "time": "18 Aug 2005 — 11:53am",
      "content": "\\> It’s the best idea in the font so far.\n\nHmmm, I have to admit you do have a point... But really, elaborating on that would turn this into a grunge affair. Not totally without merit, and in fact possible to pull off tastefully, but still wasteful of all the balancing/conventionality that's already gone into it... So here's an idea: have two (preferably uniwidth) cuts, one normal, one nuts. You could even use the nuts one as an italic!\n\nTina, no charset or pangram?\n\nhhp\n\n"
    },
    {
      "time": "18 Aug 2005 — 11:55am",
      "content": "Christian has a point. I agree. That is the reason I have critiqued the R as wrong. If, however, the irregular contrast is what you want, then go for it. Contrast is King!\n\n"
    },
    {
      "time": "18 Aug 2005 — 12:03pm",
      "content": "Tina, no charset or pangram?\n\nsoon....soon\n\np.s.  \nabout the \"R\" —are you talking about the new version or the old one?\n\n-------  \n posted another sample — \"pan\"\n\n"
    },
    {
      "time": "18 Aug 2005 — 1:14pm",
      "content": "oh. I didn't notice those. -- ok I was talking about the old R. However, it is still a little thin. But, if you are going for contrast, then I would refer to Christian's post above. As an R I don't have problems with it. However, as part of the entire typeface you are presenting it is too thin-waisted.\n\n"
    },
    {
      "time": "18 Aug 2005 — 1:54pm",
      "content": "Tina, I think your new version went too far and ironed out the magic, the potential in what you had done--the weight with the modulation of the strokes was fresh.\n\nI would rather see just small corrections on the weights of strokes rather than making this into a 'grunge' style font.\n\nBasically you can decide on whatever the 'rules' are, but they do need to be consistently carried out to satisfy the eye, I think.\n\n"
    },
    {
      "time": "9 Jan 2006 — 6:39pm",
      "content": "It's pretty darn nice as a first attempt at type design. It does certainly have echoes of Optima or Stellar, but those aren't necessarily bad influences.\n\nSorry I missed the original critique timeframe.\n\nCheers,\n\nT\n\n"
    }
  ]
}
