{
  "id": "14430",
  "title": "Chirography & Notan in Japanese Calligraphy + Notan in Roman letterforms",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A while ago there was a debate going on about Chirography in roman texts and Hrant suggested/stated that Chirography was antithetical to good Notan in letter/type design. Thinking about this I wrote at the time that Japanese Caligraphy seems to have both & without suffering for it - especially when it is exceptionally good. The greatest Japanese Caligraphy I know of ( and I am not \\*so\\* educated about this so feel free to post your own examples ) is the Caligraphy of the swordsman Teshsu. Here are some pages about him.\n\n[http://www.traditionaloshigata.com/articles/Tesshu.htm](http://web.archive.org/web/20090531082714/http:/www.traditionaloshigata.com/articles/Tesshu.htm \"http://www.traditionaloshigata.com/articles/Tesshu.htm\")  \n [http://www.daito-ryu.org/kako3.html](http://web.archive.org/web/20090531082714/http:/www.daito-ryu.org/kako3.html \"http://www.daito-ryu.org/kako3.html\")\n\nI have also atteched some scans from a book I re-found recently. Check em out. 001 is actually not Teshsu’s but his teacher’s. Pretty fine too - no?\n\nWhat I wanted to point out is that in these examples there is tremendous flow, beautiful balance and assorted other caligraphic virtues. And beautiful notan. It seems to me that contrary to Hrants assertions, great notan & chirography should be able to exist in a roman typeface as long as beautiful notan is one of the variables being striven for. It may be that this was only seriously possible with roman caligraphy until recently because of the compromises inherent in a metal & then electronic & finally digital type design - but with Open type it seems like a caligraphic level sensitivity to letter relations (both shape & placement) and therefore notan is quite possible now. Bello seems like an early example to me.\n\nBeing just a budding typophile I may be making a hash of this set of ideas - but this is what I am thinking today. I invite further comment & greater enlightenment.\n\n| Attachment | Size |\n| --- | --- |\n| [003.jpg](http://web.archive.org/web/20090531082714/http:/typophile.com/files/003.jpg) | 284.8 KB |\n| [002.jpg](http://web.archive.org/web/20090531082714/http:/typophile.com/files/002.jpg) | 65.9 KB |\n| [001.jpg](http://web.archive.org/web/20090531082714/http:/typophile.com/files/001.jpg) | 134.72 KB |\n\n",
  "author": "<a href=\"/web/20090531082714/http://typophile.com/user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 6.Aug.2005 7.10pm",
      "content": "Towards the Display end of the Display-Text axis, I agree. But:  \n1) The Text end drifts away from conscious, superficial appreciation.  \n2) I would ask the loaded, quasi-rhetorical question: what is Beauty?\n\nhhp\n\n"
    },
    {
      "time": " 6.Aug.2005 8.01pm",
      "content": "“Beauty is truth and truth beauty . . .”\n\nChrisL\n\n"
    },
    {
      "time": " 6.Aug.2005 8.53pm",
      "content": "\\> Towards the Display end of the Display-Text axis, I agree.\n\nWell, thats something anyway!\n\nThe remaining thing is to talk about text faces.\n\n\\> The Text end drifts away from conscious, superficial appreciation.\n\nDo you mean unconscious?\n\n\\> I would ask the loaded, quasi-rhetorical question: what is Beauty?\n\nYes. yes. Of course I did probably use that word a bit much in my post. I am not sure what to substitute. For now let’s say attractive - engaging to the eye. That is something you could even measure by jingo! Not that I think that’s essentuial about it for a minute.\n\nI would certainly admit that the most flowing/energetic examples I showed are most similar to display text in that they are show personality. The more rigorous example on the other hand (003) is a model of clarity. It does not however lack chirographic influence or notanic sensitivity. Admittedly it has a kind of monospaced quality to it because of the grid used which complicates the analogy quite a bit.\n\nStill looking at it I feel like there is room for a chirographic forms to have notan that isn’t compromised but enhanced even in a text face. It’s nothing I can ’proove’ until I do it myself or notice somebody doing. My main point is that chirography and Gerrit’s ideas about a moving black front are not be the same thing. These examples show chirography & notan working to reinforce each other.\n\nIn a similar vein, do you think that subtle variations in font shape add to the readability of a text?\n\nLike this\n\n[http://www.letterror.com/foundry/kosmik/index.html](http://web.archive.org/web/20090531082714/http:/www.letterror.com/foundry/kosmik/index.html \"http://www.letterror.com/foundry/kosmik/index.html\")\n\nOkay not so subtle in this case but - That is the claim made by Erik van Blokland about Kosmic. His examples were pretty convincing to me. However with opentype the switching could be deliberate rather than random and the changes might be much more subtle.\n\nWhat I am saying is you could have this & notan too. This kind of thing is certainly chiorographically inspired.\n\nSo maybe if the historical sense of chirography & an enhanced reading experience are opposed ( still not sure about that yet myself ) it isn’t so much notan that’s the reason, except maybe an artifact of western design history.\n\nMaybe what you object to is only the restriction in form that can arise when designing a roman font with a historicly chirographic/black centric sense of \\*shape\\*. This historic tendency/prejudice isn’t the sam thing as chirography per se & particularly not the same thing as chirography in the context of caligraphic practices/sensibilities/virtues. Western Caligraphy can be all about notan too.\n\n"
    },
    {
      "time": " 6.Aug.2005 9.09pm",
      "content": "Oh yeah, \\*AND\\*\n\nI wonder if caligraphic chirography might not lend some ’flow’ to what can sometimes be be pretty lifeless - text faces. I find more & more the fonts I like best both text & otherwise have a sense of flow be it chirographic in nature or otherwise. But that might be a new thread.\n\n"
    },
    {
      "time": " 7.Aug.2005 8.23am",
      "content": "\\>not lend some ‘flow’ to what can sometimes be be pretty lifeless - text faces.\n\nNice. I think you’re on to something there. The pen (or brush) moves, the eye moves. I am starting to feel that there is a deep connection between writing and reading that makes it good to have that sense of motion in type. In other words, G. Noordzij had something basically right about the ’moving front’ being important to type design.\n\nJohn Hudson, writing over in the build forum in [this thread](http://web.archive.org/web/20090531082714/http:/typophile.com/node/14228), says that the sense of greater speed of writing is something he now tries to get into the italic. But a sense of motion is valuable in the Roman as well, I suspect.\n\n"
    },
    {
      "time": " 7.Aug.2005 9.53am",
      "content": "\\> there is a deep connection between writing and reading\n\nWhat is it, exactly? Is there also a connection between footprints and reading? Hey, why doesn’t anybody do footsy calligraphy? I mean people with arms.  \n [http://news.bbc.co.uk/2/hi/south\\_asia/3253168.stm](http://web.archive.org/web/20090531082714/http:/news.bbc.co.uk/2/hi/south_asia/3253168.stm \"http://news.bbc.co.uk/2/hi/south\\_asia/3253168.stm\")\n\nThis “movement” business is stuck in the conscious  \nrealm, where text type only spends its holidays.\n\nhhp\n\n"
    },
    {
      "time": " 7.Aug.2005 10.54am",
      "content": "More: Gary Munch’s justification for chirography is that gestures are important in personal communication. Sure. Except I don’t know about you, but I use my mouth more than my hands during personal communication. Which means of course that chirographers should be using their lips to manipulate their pens. Chilography! Hey, make it chiloglaphy, and there’s your oriental connection... ;-)\n\nhhp\n\n"
    },
    {
      "time": " 7.Aug.2005 2.11pm",
      "content": "Chilography? Type designed by mouth it must be... But oriental conection? Please explain.\n\n\\> Nice. I think you’re on to something there. The pen (or brush) moves, the eye moves.\n\nMaybe...\n\nSorry - I wanted to suggest two things and judging by the responses here I can see that I haven’t - yet.\n\n1. That maybe the eastern caligrapher’s model - one that is very aware of notan - can apply more to western caligraphy despite differences in materials & ’pens’ and that notan aware typography created in open type might well result - a good thing I think\\*.\n\n2. That if we are talking about a text face the idea of flow in the design need not be chirographically inspired ( but it could be ) - but that it is in my opinion ( today anyway ) that this flow makes for a livelier face as long as it is moderate or even subtle.\n\nI suppose that what I am saying is that whereas some chirographicaly inspited type & caligraphy seems to have been ’written’ slowly and resists the rapid movement of my eye because it is too rigid - other type & caligraphy ( eastern & western) seems to have been written with greater speed - and as long as it has great focus & notan, it seems to carry my eye faster, easier & more pleasantly.\n\nI know that the debate lines about readability chirography etc have been set for a long time here on Typophile - but I am trying to disentangle some distinct ideas that I think have ben bound together by tradition & history to disrupt what I see as a somewhat stagnant arguement and suggest a possibly fruitful new direction.\n\nHubris? Me?\n\n\\* This idea is different than an endorsement of a ’moving front’ idea per se. It certainly seems so to me. Also to be fair I still haven’t received a copy of letterletter so I can’t say I understand the idea in any other way than from reading posts on typophile. A poor substitute. So I can’t really endorse something I haven’t read yet anyway.\n\n"
    },
    {
      "time": " 7.Aug.2005 3.55pm",
      "content": "I found this by accident today. I think it suggests that Evert Bloemsma was thinking about improvement of faces via substitutions too:\n\n[http://groups.msn.com/FontLab/general.msnw?action=get\\_message&mview=0&ID...](http://web.archive.org/web/20090531082714/http:/groups.msn.com/FontLab/general.msnw?action=get_message&mview=0&ID_Message=1472&LastModified=4675407696735913723 \"http://groups.msn.com/FontLab/general.msnw?action=get\\_message&mview=0&ID\\_Message=1472&LastModified=4675407696735913723\")\n\nThe thread starts:\n\n” Dear FontLab.msn members,\n\nI hope to find a feature that replaces two specific characters  \nby TWO (not ONE like a ligature!) other specific characters.\n\nFor example:  \n“a”+”b” is replaced by “\\_a” + “ab”.\n\nThis in order to let the shape of the previous character depend  \non the next/following character.  \nAll features I found replace two characters by one single  \ncharacter, am I right?”\n\n"
    },
    {
      "time": " 7.Aug.2005 6.12pm",
      "content": "The connection between reading and writing is probably similar to the connection between inhabiting a house and building a house. There is a recognition, which works in both the conscious consideration of the structure and in the unconscious, ’immeserive’ experience of living in it, of the formal qualities of something that is made by man for man, with the hand and mind for the eye and mind.\n\nThe question ’What is beauty?’ doesn’t need to be answered in any definitive way; what is important is to recognise that we have a concept of beauty (an extensible concept, in fact) and assign importance both individually and culturally to beauty, i.e. to things to which we are attracted. Our appreciation of beauty encompasses much of the natural world, but finds a particular expression in the work of human hands, in the things that we make or our fellow humans make. There is a recognition of what the hand has made and made well, and an attraction to it. From this stems our appreciation not only of the idea behind a thing, but of the qualities of the making and of the thing as evidence of a common humanity expressed in art and craft. It is in this recognition that there is a connection between writing and reading, I think: in the appreciation of written forms as evidence of the human hand and mind working together to form a thing. Of course, none of this is intended to suggest that there is a hard _preference_ for written forms against other kinds of lettering — any more than there is a general human preference for certain ways of making a sculpture over other ways —; I am only suggesting why we have an attraction to written forms, and how this attraction plays a part in both our conscious appreciation of text and our unconscious immersion in it during reading.\n\nThis relates directly to the theme of Robert Bringhurst’s keynote address at the ATypI conference in Vancouver, which began with the observation that for most of human history readers have also been writers, and the letterforms that they read were most often similar to the forms that they would make. In such a heritage, the connection between writing and reading is much more obvious: they are two sides of literary activity. Typography and mass literacy have changed the relationship because they have changed the nature of the reader, most of whom are now consumers of text and only seldom writers. This is a change that Hrant has often made reference to in order to dismiss any significance of writing to type design, and to try to focus attention on the importance of reading as the thing that we most do with letters. Where I part company with Hrant is that I think there is a continued significance of writing to reading in our recognition of the passage of the human hand in certain forms _however they are actually made._ You don’t throw off several thousand years of our relationship to writing overnight; apparently you don’t throw it off after 550+ years of typography either. We like the chirographic element in type: it gives us pleasure, it makes us comfortable, we recognise ourselves in it.\n\nChirography is seldom, if ever, the only element in type, and there are many good reasons to explore other aspects of type design and other approaches to the making of letterforms. The idea of increasing our understanding of how we read and making use of that knowledge in directly manipulating notan in designs that are increasingly removed from chirographic influence is a good one. But it is an idea that needs to find its place alongside the acknowledgement that we have a longstanding attraction to written forms that is not going to suddenly disappear.\n\n"
    },
    {
      "time": " 7.Aug.2005 6.32pm",
      "content": "\\> But oriental conection? Please explain.\n\nChiloglaphy. The “r”-\\>”el” thing. Stupid joke.\n\n\\> it seems to carry my eye faster\n\nExcept the eye is not “carried”. That’s in [some of] our heads.\n\n\\> Evert Bloemsma was thinking about improvement of faces via substitutions\n\nThis is something I actually once discussed with Peter:  \nThe desirability of manipulating notan accounting for pair frequencies.\n\n\\> The connection between reading and writing is probably similar  \n\\> to the connection between inhabiting a house and building a house.\n\nI’m sorry, I think that’s a stretch.\n\n\\> there are many good reasons to explore other aspects of type  \n\\> design and other approaches to the making of letterforms.\n\nYeah, so let’s, already.\n\nhhp\n\n"
    },
    {
      "time": " 7.Aug.2005 7.20pm",
      "content": "\\>What is it, exactly?\n\nI don’t know, but I feel it is there, and would like to understand it better.\n\n\\>This “movement” business is stuck in the conscious  \nrealm, where text type only spends its holidays.\n\nHow do you know?\n\nJohn’s eloquent and I think accurate tribute to our attraction to works of the hand calls to my mind the book of the great furniture artisan, James Krenov. In his wonderful ’A Cabinet Maker’s Notebook’ he explains that you can make by hand a dovetail joint that looks like it was made by a machine. But if he is going to do it by hand, he is going to \\*make\\* the presence of the hand felt. Not by arbitrary slickness, but by intelligent response to the grain of the wood and the evolving design of the piece of furniture. So that the person may own it an after ten years may look at a corner and suddenly say, “Ah, I understand,” a human connection with the maker.\n\nOn ’notan’. This and the zen concepts of design are of course a translation from the Chinese, though the Japanese developed these ideas into their own distinctive tradition. ’Notan’ I am guessing is a translation of Yin-Yang, which is literally ’dark-light’. Recall the Taoist symbol of white and black swirling into each other, with a dot in reverse on each. The characters have many other other associations, such as female and male. I have not yet looked at Taoist design theory, but just from skimming the internet, I see that they involve not only balancing dark and light, but also thick and thin, warm and cold, and sharp and blurred.\n\nSo if there is something in this idea of balancing opposing qualities, maybe static form and motion is one of those balances that makes for good type.\n\n"
    },
    {
      "time": " 7.Aug.2005 9.21pm",
      "content": "\\> How do you know?\n\nThere is no flow in reading. The overall macro rightward direction of Latin transcription does not imply a rightward direction at the micro reading level. And it turns out (please, it’s been over 100 years already) that reading is saccadic. There simply is no lifting, carrying, pushing, or anything of the sort. And certainly not at the letterform level, come on! Do your eyes follow the “paraphrased” pen in Garamond, or even in Meier’s hyperchirographic fonts? Only at 200 point, and only if you’re a type designer. During a fixation, we absorb, we choose a subsequent fixation point, and we saccade there. We don’t need little shapes to tell us to saccade to the right and not to the left, and little shapes certainly aren’t going to provide some kind of ballistic boost to the saccade. Serifs don’t need to have little arrowheads to the right.\n\nThe flow is an illusion - yes, a potent one, which is why it took so long to disprove it.\n\n\\> But if he is going to do it by hand, he is  \n\\> going to \\*make\\* the presence of the hand felt.\n\nTo me this seems a bit artificial.\n\nThat said, I do indeed agree with much of what John wrote. I have explicitly stated the inadvisability of **shunning** chirography (at least once I’ve cooled down from a rhetorical flurry :-) and the need for anything a human makes to be... human! What I would like to see however is more respect given to function, to the user. I would simply like to hear people say “yes, we know it harms readability, but we enjoy it, and many of our users do too”. That would be really nice. Happily, I see an increase in this attitude amongst some people involved in these discussions. Thank you. But there is still too much chirographic apologism, and an engrained “don’t cramp my artistry” attitude.\n\nNotan vs Yin/Yang: the former is preferable because it refers directly to luminosity, something tangible and directly applicable to type. The latter, although it might be the seed, and is certainly a superset, is more useful in the realm of philosophy.\n\nhhp\n\n"
    },
    {
      "time": " 7.Aug.2005 11.10pm",
      "content": "I don’t think you are going to get people to say ’Yes, we know it _harms_ readability...’, because there is no evidence of that, at least to the degree that chirography is normally applied in type design (and Meier’s ’hyperchirographic’ types are definitely not normal). Arguably, most text type design already represents a combination of the favour of chirographic elements with non-chirographic elements, designed to work together to make the overall reading experience comfortable, efficient and pleasurable. The fact that this combination of chirographic and non-chirographic elements developed without a systematic empirical understanding of how we read, but based purely on experience, is actually quite impressive. Again, we come up against the reality that people read a lot of stuff in these parachirographic (thanks, Peter) typefaces, and they do so quickly and accurately and in comfort. So whatever you might be able to get people to agree to, it seems very unlikely to include an acknowledgement that chirography is actually _bad_ for readability. Rather, we might consider whether chirography is _limited_ in terms of its positive contribution to readability, i.e. that it can only go so far, and that more readable typefaces might be possible by reducing the reliance on chirography and adopting a more deliberately notanal design methodology. It would be difficult for anyone to say that this isn’t a reasonable set of considerations. I’m not convinced that there actually will be significant measurable improvements in reading speed, accuracy or comfort in typical circumstances: I suspect any measurable benefit will be in edge cases of the reading experience — low resolution, small sizes, information-critical, etc —, which is where readability issues are already encountered. But that is good enough reason to take these ideas seriously.\n\n"
    },
    {
      "time": " 7.Aug.2005 11.51pm",
      "content": "I spent a week in Japan and so have been thinking quite a bit about the relationship between Japanese and western concepts of graphic design. I was particularly struck by the relative crudeness of lettering in Roman scripts compared to Japanese kana and kanji. In fact, most of the problems were of spacing and chirographic consistency, which are not obviously specific to one alphabet.\n\nHrant: Obviously we can reject simplistic theories such as chirography being a primary engine behind the planning of saccades in immersive reading. However, I wonder if you are going too far in the other direction. There are a number of plausible hypotheses I can imagine in which chirography has a positive effect on immersive reading. I offer these for your amusement:\n\n1. Before immersive reading actually happens, there is a process of “immersion” which is essentially training the visual system to discriminate enough information to allow the “big gulps” per saccade characteristic to immersive reading. During this period, saccades tend to be smaller and higher resolution images of letterforms are available in the central fovea. Chirographic cues (based on higher spatial frequencies) help discriminate more accurately than images based on the lower spatial frequencies alone.\n\n2. During immersive reading, there are occasional failures in which the information taken in during a saccade is not accurately enough discriminated, causing retrograde saccades. Again, the availability of chirographic cues allows more accurate discrimination and thus a quicker recovery.\n\nHmm. All this talk of frequencies makes me think of the analogy to perception of speech. It’s well known in telephony that almost all of the information content in speech is in the range of 300-3000 Hz. Further, if you have a lot of noise or a hearing disability (or both), you generally want to filter out everything outside that range.\n\nEven so, if you listen to speech samples side-by-side, the ones with the high frequency content always sound clearer. And, for music, filtering out those higher frequencies is absolutely unacceptable (hi-fi audio equipment is all about reproducing them accurately).\n\n(obligatory [audiology](http://web.archive.org/web/20090531082714/http:/www.audiologyonline.com/articles/arc_disp.asp?id=477) link)\n\nFood for thought, in any case.\n\n"
    },
    {
      "time": " 8.Aug.2005 7.17am",
      "content": "Hrant, on flow I wasn’t implying that our eyes follow every stoke of a letter in the way that it would be written. You are attacking a straw man there.\n\nWhat is mean is that the indications of flow to the right are natural and somehow functional. For example, in Latin script the stems are predominantly on the left, and the bowls and branches move to the right. The characters open to the right. In Hebrew, read from right to left, it is just the opposite. The E and F point to the right, whereas the resh and dalet point to the left. The C opens to the right, whereas the kaf opens to the left, etc. And this is inspite of the fact that the square Hebrew letters are also written with a movement left to right, just like Latin letters.\n\nSo I accept your point earlier that messing with the signs of the hand in letters doesn’t necessarily mess up the legibility of letters, and withdraw my statement on that. (Though I do think this often results in aesthetic problems.) But I think some indications of flow, which the moving hand naturally lends itself to, are somehow helpful and comfortable in reading.\n\nBy the way, on notan, are you sure this is not a more general notion than dark-light? If it is a translation of yin-yang, it would have a more general meaning. Any Japanese speakers out there can help us with this?\n\nBy the way, it is historically incorrect to say that yin-yang is a ’seed’ of notan. The applications of the Taoist philosopy to painting and calligraphy were well developed in China before they came to Japan, from what I can see. Japanese culture on these matters is derivative from the Chinese, just as American is derivative from the European. And both have become separate and evolved their own traditions. In the Japanese case, there was a prior culture, so the Chinese-Japanese differences are perhaps greater, though I suspect not in this field of painting and calligraphy.\n\n"
    },
    {
      "time": " 8.Aug.2005 8.02am",
      "content": "\\>a more general notion than dark-light\n\nI would expect our visual system to be multi-dimensional.  \nThe way I understand the biology, there are different regions in the brain which respond to different visual properties. I’m assuming that they correspond with aesthetic categories which we find useful, such as repetition, angularity/roundness, verticality/horizontality, separation/contiguousness, as well as qualities like sharpness, tonality, and colour. These algorithms are used to construct the picture in one’s field of vision.\n\nThey also have parallels in classical rhetoric: an example that touches several areas would be rhyming verse.\n\nI believe that all these neural algorithms can be exploited in the packaging of reading information (aka type design), and type designers can combine them in different ways.\n\nFor instance, against the ground of repetitive counters in b, d, p and q, in Century, the strong serifs on these glyphs serve to distinguish the characters in “non-transformable” ways (ie you can’t make any of them by rotating or flipping any of the others). However, in Garamond, the counters vary, as do the serifs; but the serifs are not as big as in Century, so the task of making these glyphs non-transformable is shared by counter and serif. It would be very difficult to test the relative merits of these two design solutions in a laboratory. Related: Comic Sans, non-transformable b, d, p and q, and no serifs.\n\nBTW, we need another version of Comic Sans, renamed to reflect its serious side (with small caps and OSF p’raps. Maybe Vince is working on an OT version right now?) Rather like the Harry Potter books for children and adults, identical inside, but with different covers. Speaking of which, when you sell millions of books in a couple of days, surely you can afford a font that has true small caps? — Upgrade the Berkeley Old Style to Califonian, huh?\n\n"
    },
    {
      "time": " 8.Aug.2005 8.19am",
      "content": "\\> chirographic cues\n\nWhat are these cues?  \nAre all of them good?\n\nhhp\n\n"
    },
    {
      "time": " 8.Aug.2005 8.38am",
      "content": "[John Hudson] “So whatever you might be able to get people to agree to, it seems very unlikely to include an acknowledgement that chirography is actually bad for readability. Rather, we might consider whether chirography is limited in terms of its positive contribution to readability, i.e. that it can only go so far, and that more readable typefaces might be possible by reducing the reliance on chirography and adopting a more deliberately notanal design methodology. It would be difficult for anyone to say that this isn’t a reasonable set of considerations.”\n\nI think that’s right.\n\n[Raph] “Chirographic cues (based on higher spatial frequencies) help discriminate more accurately than images based on the lower spatial frequencies alone.”\n\nI think that’s right too. Chirography introduces slight differences into the shapes of the counters of the pdqb. These are discernable at high frequencies, and the receptive fields of the visual cortex are probably sensitive to them. The inflections of shape at these higher frequencies probably contributes to the perceived sharpness of the word image at the visual recognitional moment. So there is a readability benefit. This benefit I take to be of the same order as those Hrant wants to introduce with his contrast manipulations at the border between black and white.\n\nHrant wants to press beyond where chirography has left the variablity in counters, and I think that’s a fruitful avenue to explore. But there is a limit to this. Not enought modularity and the alphabetic system looses some of it’s functionlity.\n\n[Hrant] “There is no flow in reading.”  \nI think categorical statements such as this are troublesome.  \nThere is a rhythmic succession (flow) of saccades both on the time and on the extent axis, when reader ability is developed and text is well formatted. And there is a flow of visual information in text, for example a deployment of stems around a rhythmic mean (in properly spaced text). And the visual cortex depends on this to do it’s job effectively.\n\n"
    },
    {
      "time": " 8.Aug.2005 9.50am",
      "content": "\\> the indications of flow to the right are natural and somehow functional.\n\nI’m not seeing that.\n\n\\> in Latin script the stems are predominantly on the left, and the bowls and branches move to the right.\n\nSure (and this particular constructivism is called “augmentation”).  \nBut that’s writing, not reading.\n\n\\> on notan, are you sure this is not a more general notion than dark-light?\n\nActually, the value of the term “notan” lies in much more than something like “chiaroscuro” for example; the relevance is in its valuation of the **relationship** between dark and light, in their unity & opposition.\n\n\\> I would expect our visual system to be multi-dimensional.\n\nYou’re talking about cognition; the usefulness of notan is firmly in the context of perception.\n\n\\> algorithms\n\nNot algorithms, heuristics. Huge difference.\n\n\\> These are discernable at high frequencies\n\nBut critically, not in the parafovea.\n\n\\> Not enought modularity and the alphabetic system looses some of it’s functionlity.\n\nAgreed, although I think it has to do with texture, not modularity. But in any case, we need to explore these limits, and within the limits of chirography, we can’t. You can’t find that other continent by hugging the coast of yours; you need an astrolabe: an understanding of and a respect for readability.\n\n\\> There is a rhythmic succession (flow) of saccades\n\nI think this is part of the illusion. I see no reason for rhythm in reading, because I see no benefit; and the subconscious doesn’t waste time. The only rhythm in typography is at the level of linebreaks, and that of course is beyond the realm of type design.\n\n\\> a deployment of stems around a rhythmic mean\n\nThat’s where I use “pattern”. One more time, guys: the term “rhythm” creates an affected, escapist apologism for chirography that’s holding us back. Please stop using it.\n\nhhp\n\n"
    },
    {
      "time": " 8.Aug.2005 11.18am",
      "content": "Please stop using it.\n\nNo. All I mean by rhythm in the typographic domain is that the pattern of strokes has a periodicity (or phasal regularity) in spatial frequency space that hovers around a definable mean.\n\n"
    },
    {
      "time": " 8.Aug.2005 11.53am",
      "content": "\\> algorithms\n\nI think what you mean is ’factors’ or ’variables’, rather than ’algorithm’ - or heuristic. An algorithm is a procedure that leads to a definite, end, like the algorithm for adding numbers. An ’heuristic’ procedure is one that is more open-ended. But here you are talking about ingredients in a process, if I understand you rightly, rather than a process.\n\n"
    },
    {
      "time": " 8.Aug.2005 11.58am",
      "content": "\\>But in any case, we need to explore these limits, and within the limits of chirography, we can’t. You can’t find that other continent by hugging the coast of yours; you need an astrolabe: an understanding of and a respect for readability.\\<\n\nI don’t perceive chirography (what of it I can grasp) as some constrictive shell within which we are trapped who cannot see the potential for other dimensions. Please help clarify what chirography is. Isn’t it now a somewhat esthetic set of conventions we can employ more or less, to support, accentuate or possibly overwhelm other ingredients of a typeface? Isn’t chirography one of those ingredients that can be used well or badly, depending on the chef? I can see that overdependence on chirographic conventions can cripple the functionality of a typeface that is purportedly for text, but isn’t that an issue of balance? A skilled designer, who has recognized what makes readability happen, will take the limitations of chirography into account and use them in moderation, along with the other ingredients. I don’t see chirography as such an explosive or dangerous ingredient. Just a highly attractive one, prone to overuse, like cilantro.\n\n"
    },
    {
      "time": " 8.Aug.2005 12.15pm",
      "content": "\\> Hmm. All this talk of frequencies makes me think of the analogy to perception of speech. It’s well known in telephony that almost all of the information content in speech is in the range of 300-3000 Hz. Further, if you have a lot of noise or a hearing disability (or both), you generally want to filter out everything outside that range.  \nEven so, if you listen to speech samples side-by-side, the ones with the high frequency content always sound clearer. And, for music, filtering out those higher frequencies is absolutely unacceptable (hi-fi audio equipment is all about reproducing them accurately).\n\nSorry for such a long quote - I think this analogy is a good one - What you \\*can\\* do as a result of design & what \\*feels good\\* and therefore encourages you to do more, are quite different. Each is important. Hrant seems to be thinking first of the ’can do’ aspect which is fine but my arguement has to do with the ’want to do’ aspect I think.\n\n\\> The flow is an illusion - yes, a potent one, which is why it took so long to disprove it.\n\nThis ’potent illusion’ - if that’s what it is - ( I neither accept or deny this idea being ignorant of the research... ) is part of what I think I am interested in. And I think that maybe some chirographic character in the context of a more caligraphic contextual glyph successsion ( as opposed to the more common kern table model of glyph succession ) will probably create an agreeable pleasant sensation when reading.\n\n- This is going to sound like my teacvhing your gradmaother to suck eggs but hang on - Just one of the reasons that type glyphs have to be designed differently than caligraphic ones is the abscence of a practical way of handeling the variability of glyphs characterized by the best caligraphy. Since there was going to be just one standard spacing letterforms had to change to meet this restriction. We all agree on this. No? With Open type some of this restriction is lifted which is an opportunity to give type a light dose of caligraphic pleasantness via contextually sensitive notan.\n\nDoing that seems seems like a great tool to sweeten a text typeface - maybe doing this would be \\*just\\* art or beauty. Maybe too much preoccupation with it is counterproductive - like food that is all too sweet. Cetainly it could be overdone. It is text faces we are talking about here. In fact I would go so far as to say it would probably be best if it was subtle enough to be an unconscious effect!\n\nWhat I do know is that when a typeface is agreeable it encourages me to read & read longer. In these cases I feel that the typeface is in service to me as a reader.\n\nWhich brings me to my tenative thesis again: While chirography might be a stumbling block to better text type design in the case of the Kerning Only font, (because unlike in the case of fine caligraphy be it eastern or western, the chirographic charcter is not & cannot be context sensitive & therefore sufficently sensitive to notan); an Open Type font that is Context Sensive could perhaps use chirographic character, in small doses and in an appropriately notanicly aware manner - like a caligrapher might. Thus restoring chirography to the service of beauty & function in one go.\n\nI am not suggesting that we would all be better off reading caligraphy for text as such. No.\n\nI am just saying that chirography in small doses is perhaps not antithetical to good notan or text face improvement once it is in a contextually aware open type font. Maybe in this specific context chirography is not a sort of useless inflamed appendix that needs to be removed for the sake of readers.\n\n"
    },
    {
      "time": " 8.Aug.2005 1.18pm",
      "content": "\\> algorithms\n\nI do mean algorithms, although it is not the term usually applied.  \nIf a part of the brain responds to specific visual stimuli, such as verticality, it is because it is “wired” or programmed to seek out that quality in the data it receives from the eye. In turn, the eye muscles develop a technique for meaningful saccadic action over text, geared to feeding the algorithmic pattern-seekers with information. A feedback loop: reading.\n\n\\> the flow is an illusion\n\nAs I mentioned before (the dance anecdote), that part of the brain which supervises writing may be stimulated by reading. The flow is part of how we write, so cannot be discounted, it’s part of our relationship with written language. Perhaps it is more fundamental to language: the gaps we put between characters and letters do not exist in spoken language.\n\n"
    },
    {
      "time": " 8.Aug.2005 3.29pm",
      "content": "[Nick Shinn] “the gaps we put between characters and letters do not exist in spoken language.”\n\nIsn’t that part of Evert Bloemsma’s justification for the contrast manipulations in Legato? Consolidation for vision of the word image. The very same dynamic that Gerrit Noordzij sees as explaining the developments in writing from the 7th through the 16th century.\n\n"
    },
    {
      "time": " 8.Aug.2005 4.11pm",
      "content": "\\> Isn’t chirography one of those ingredients that can be used well or badly\n\nIndeed, I agree. With the display-text axis having central relevance to that.\n\nJust know what you’re doing, what effects your choices and tools have - that’s basically the crux of what I’m saying. If I often sounds more “militant”, it’s because it seems I have to manage the discoursive load of 10 grown designers. For example, I myself love lard, even though I know its negative effects. Know chirograhy’s pros and cons, admit them, work with them. Until quite recently, nobody talked about the cons (at least not beyond a vague/abstact unease felt by some). Now, some of us are. That little thing honestly makes me happy.\n\nhhp\n\n"
    },
    {
      "time": " 8.Aug.2005 10.05pm",
      "content": "Peter: _All I mean by rhythm in the typographic domain is that the pattern of strokes has a periodicity (or phasal regularity) in spatial frequency space that hovers around a definable mean._\n\nThis is all I mean by rhythm too, and I was planning to take you to task for mentioning rhythm in the same breath as flow, since I’ve spent so long trying to persuade Hrant that there is no implied flow when we speak of rhythm in visual terms (whereas there is always implied flow when we speak of rhythm in musical terms because music is temporal). Hrant says to use ’pattern’ instead of rhythm. I think we should be able to use either, and also to specify ’rhythmic pattern’, because this describes quite precisely the periodicity of Latin letters. There are other kinds of pattern, e.g. what we might call melodic pattern, in which the periodicity is much longer and subject to greater variation.\n\nNow, as I talked about in the MS book _Now read this_, it is important to realise that different writing systems have different periodicity and hence may be more or less rhythmic than other writing systems, so it is a mistake to say that rhythm is part of reading per se in any common sense; rather, the particular rhythm of the Latin script is part of reading in the Latin script, and the particular melody of the Greek script is part of reading in the Greek script. An interesting thing to consider is how the brain might utilise the particular patterns of different writing systems to develop readerability in a script. Almost all scientific study of reading seems to have been limited to the Latin script, unless e.g. Chinese cognitive scientists have been busy without our knowing it. I am not convinced that what we know about reading in one script can be applied directly to type design in another script.\n\n"
    },
    {
      "time": " 8.Aug.2005 10.11pm",
      "content": "In fact comparing the read[er-]ability of various  \nscripts would provide unparalled insight I think.\n\nBut honestly, “melody”, now?! :-/\n\nhhp\n\n"
    },
    {
      "time": " 8.Aug.2005 10.28pm",
      "content": "Well I can’t think of a specifically visual term at the moment. Rhythm is a term that is applied to both visual and musical composition. For me it is natural to use melody in the same way, but I acknowledge that the term is not normally applied to visual composition. But maybe it should be. We need to be able to identify and talk meaningfully about spatial arrangement that is not characterised by strongly rhythmic elements, in which there is less modularity and greater variation and in which the subsequent patterns in text are typically longer and less obvious. If someone can suggest a better term than the semi-metaphorical ’melodic’, I’m happy to consider it.\n\n"
    },
    {
      "time": " 9.Aug.2005 4.16am",
      "content": "\\>Almost all scientific study of reading seems to have been limited to the Latin script,\n\nAnd there, to non-connected forms, rather than written cursive “script”. Wimps.\n\n\\>a better term than the semi-metaphorical ‘melodic’\n\nThere’s always harmony and counterpoint. And the golden section. As I’ve mentioned before, having a scalar relationship of glyph widths creates a pleasing, harmonic appearance to text, comfortable and hence functional. These concepts are useful analytical and creative tools.\n\nThe great fear I have of the lab-testing “scientific” approach to human perceptual mechanics is that it will be proved that Elton John’s song’s have optimum listenability. (Thank goodness for listenerability, and hence Sonic Youth, not to mention SOAD.)\n\n"
    },
    {
      "time": " 9.Aug.2005 5.02am",
      "content": "_the gaps we put between characters and letters do not exist in spoken language._\n\nThe gaps we put between characters do not exist in written language: words are identified ideographically, and meaning is conveyed analogically, through a triad of referee - reference - referent. The sole advantage that alphabetic writing systems have over ideographic writing systems is, at least theoretically, new words encountered in the alphabetic system can be sounded out (sometimes with greater or lesser degrees of precision: witness in English **bough — cough — dough — tough** ). Well, that and alphabetic systems allow for a lot more flexibility in the design of their individual elements.\n\n"
    },
    {
      "time": " 9.Aug.2005 5.31am",
      "content": "\\>scalar relationship of glyph widths\n\nCould you explain what you mean? I missed your earlier discussion of this.\n\n\\>melody\n\nMaybe ’dance,’ also sometimes used to describe a quality of text, is better, as this is more visual.\n\n’Flow,’ as compared with rhythm, it seems to me is a gestural quality of letters, which complements rhythm. By the way, don’t the saccades occur with a consistent rhythm?\n\n"
    },
    {
      "time": " 9.Aug.2005 5.46am",
      "content": "\\>The gaps we put between characters do not exist in written language\n\n...except when the form says “PRINT IN BLOCK LETTERS ONLY” :-)\n\n\\>scalar relationship of glyph widths\n\n[http://www.typophile.com/node/9344](http://web.archive.org/web/20090531082714/http:/www.typophile.com/node/9344 \"http://www.typophile.com/node/9344\")\n\n"
    },
    {
      "time": " 9.Aug.2005 5.55am",
      "content": "\\>scalar relationship of glyph widths\n\nThanks, interesting. A question I have is how the traditional variation in width and spacing you describe contributes to readability. It seems to, but I don’t understand why.\n\n"
    },
    {
      "time": " 9.Aug.2005 6.23am",
      "content": "[Nick Curtis] “The gaps we put between characters do not exist in written language.”\n\nMight it not be preferable to say: “do not exist in read language”; on the other hand, my contention has been that ’evoked’ whites are information for the visual cortex, so we should not think of them as gaps, i.e., areas of no information toward visual wordform resolution.\n\n[John Hudson] “melodic”  \nCould it be said that the rhythms in Arabic scripts are undulant, i.e., that variations in indulance around a mean have cue-value in arabic texts?  \nAlso, I do think reading in ’non-western’ scripts involves a retraining of the ’plastic-ware’ in the visual and cerebral cortex. There is some discussion now in the cognitive scientific literature of whether the area of the cerebral cortex dubbed the visual wordform area developes in the same way in readers of far eastern scripts, like chinese or japanese. Or if a comparable specialization develops in a different area.\n\n[some more thoughts on notan]  \n1) are there guidebooks or oral traditions in Japanes culture on how to acheive notan?  \n2) I wonder what eye-movement studies of good writers writing might reveal. I suspect it will reveal that there is a constant moving back and forth between white and black, maybe even a concentration of attention on the white formed in writing. The hand already ’knows’ the gestural routines of the script, and if he or she is good, the writer can be confident of the visual integrity of the stroke. The only gross varible, given a certain sized pen and a steady hand is the consistency of the white. If it is true that the consistency of the white has the importance it might be shown to have in simple acts of writing, perhaps writing with the broad-nibbed pen is the prepartatory school for notan. And provides a benchmark (not an end-point).\n\n[Let it be known that, because on the face of it there seems to be something to Hrant’s argument about the moving front vis a vis absolute notan, I have to keep worrying it and the claims it motivates. I have to keep worrying it from both ends. The ’moving front’/ ’priority of the black’ end and the ’definition’ and ’relevance of notan’ end]\n\n"
    },
    {
      "time": " 9.Aug.2005 6.31am",
      "content": "\\>how the traditional variation in width and spacing you describe contributes to readability.\n\nHarmonic relationships form a conceptual grid against which the distinction between information and noise can be maximized. They are pleasing because they make sense, as opposed to random or more difficult matrices.\n\nWithout harmonic relationships, you get clumping, which creates false significance.\n\n"
    },
    {
      "time": " 9.Aug.2005 6.35am",
      "content": "[William Berkson] “...but I don’t understand why.”\n\nIt tried to touch on this in my Sat, 2005-08-06 14:58 post on the readerability / readablity thread. My speculation there dovetails for the most part with Nick Shinn’s reply\n\n"
    },
    {
      "time": " 9.Aug.2005 6.43am",
      "content": "\\>guidebooks or oral traditions in Japanes culture on how to achieve notan?\n\nI haven’t got hold of them yet, but my internet search came up with these:\n\nNotan: the dark-light principle of design. By Dorr Bothwell, Marlys Mayfield  \nThe Yin/Yang of Painting, by Hongnian Zhang  \nChinese Calligraphy: An introduction to its aesthetic and technique. Yee Chiang.  \nChinese Brushwork in Calligraphy and Painting: Its History, Aesthetics, and Techniques. Kwo Da-Wei\n\nAs I said, the theory applying Taoist ideas to painting and calligraphy was developed in China, not Japan, though there may be additional Japanese contributions.\n\nIf you do a search on ’notan’ you will also get lessons that a school teacher developed for teaching art students about notan.\n\n"
    },
    {
      "time": " 9.Aug.2005 7.40am",
      "content": "\\>Harmonic relationships form a conceptual grid against which the distinction between information and noise can be maximized.\n\nInteresting and plausible. That would imply that proportional spacing is a definite advantage, no? I would like to think so, but are monospaced fonts like Courier really less readable? Or perhaps the effect of traditional widths and spacing is greater effeciency at smaller size?\n\n"
    },
    {
      "time": " 9.Aug.2005 8.29am",
      "content": "[Nick Shinn] “information / noise”  \n[William Berkson] “but are monospaced fonts like Courier really less readable?”\n\nHere is where trying to imagine the passage of the material through the visual cortex is a useful exercise. The question seems to me to be one of efficient perceptual processing on a visual cortex level, with low computation costs and economy of spiking (in neurological terms).\n\nTo think through this passage through the visual cortex we need to understand the functioning of the different levels of the visual cortex of course, and that is still a bit of a grey area, but there are interesting suggestions about how may levels there are and what they do, based on sophisticated empirical probing in the neuro-biological literature, that seem to me to fit nicely with a perspective on this such as Nick’s.\n\n"
    },
    {
      "time": " 9.Aug.2005 8.40am",
      "content": "I think though that it is necessary to distinguish between good and bad noise, Some noise obstructs visual wordform resolution by introducing distracting areas of salience and altering the necessary topographies of cue-value rich information; other ’noise’ contributes to gestural / atmospheric particularity—the feel of the text.\n\nA master-designer manages salience for functionality and adjusts noise to cultural-demographic effect.\n\n"
    },
    {
      "time": " 9.Aug.2005 8.41am",
      "content": "_Might it not be preferable to say: “[The gaps we put between characters] do not exist in read language”_\n\nPeter, that’s an excellent point...it is in the _reading_ that the interstitial spaces are irrelevant, just as they are in spoken language, because we do not hear individual letters spoken (except I or O, as words), but **phonemes**.\n\n"
    },
    {
      "time": " 9.Aug.2005 8.41am",
      "content": "\\>are monospaced fonts like Courier really less readable?\n\nYes and no. Monospacing is a simple form of harmony (think 2/2 march) which provides an easy matrix. However, the disposition of the normal alphabet within this creates awkward stem relationships. My experimental Panoptic alphabet tackles this problem by using unicase as a solution. If I were to continue along these lines, I would incorporate extenders.\n\nIt seems strange that a scale of horizontal visual proportions can be considered harmonic, when horizontal measurements in text readily suggest tempo.\n\n"
    },
    {
      "time": " 9.Aug.2005 8.47am",
      "content": "\\>“information / noise”\n\nThe problem of design is that you have at least two criteria to satisfy, and the information of each is the other’s noise.\n\n"
    },
    {
      "time": " 9.Aug.2005 9.01am",
      "content": "oldnick, in saying that “‘evoked’ whites are information for the visual cortex, [...] we should not think of them as gaps” I wanted to propose that the perceptual processing process uses the shapes of interstitial spaces as well. It reads them as information. They are not irrelevant. What it gets from them is contributory to visual wordform resolution, co-valent with counter shapes and stroke conformities. This is one of the things parallel letter recognition models of word recognition have so far failed to consider, or so it seems to me.\n\n...and why the preservation of bundled spacing in a properly spaced font makes sense...\n\n"
    },
    {
      "time": " 9.Aug.2005 9.07am",
      "content": "\\>The problem of design is that you have at least two criteria to satisfy, and the information of each is the other’s noise.\n\nThis seems to come back to the need for balance between different factors, which indeed seems at the heart of the problem of good type design—with different balances for different purposes.\n\nWhat did you have in mind here as the two competing criteria? Or in other words in what way is monospaced font less readable or not less reabable?\n\n"
    },
    {
      "time": " 9.Aug.2005 10.16am",
      "content": "John, all you need is “pattern”. Really.  \nI know it’s sort of sad, but hey.\n\n\\> don’t the saccades occur with a consistent rhythm?\n\nNope.  \nUnless the content is deliberately written in such a way as to cause rhythmic saccades. Never been done AFAIK, but could be interesting - like a sort of reading hypnosis... But even then, it’s the content doing it, not the letterforms, so it’s outside our scope.\n\n\\> Harmonic\n\nAnother misleading term.  \nAs if we’re not already drowning in a terminological miasma.\n\n\\> “Notan: the dark-light principle of design”\n\nThat’s the one I have. It’s cool.\n\n\\> That would imply that proportional spacing is a definite advantage, no?\n\nYou don’t need voodoo to imply such a thing. The (perceptual/cognitive) reason that proportional is more readable than monowidth is that we read boumas. And this is related to the fact that it’s easier to catch typos in a mono setting.\n\n\\> are monospaced fonts like Courier really less readable?\n\nOf course.  \nOnly a readability relativist thinks otherwise, and a readability relativist has no business on the analytical end of understanding readability.\n\nhhp\n\n"
    },
    {
      "time": " 9.Aug.2005 10.25am",
      "content": "\\>\\> are monospaced fonts like Courier really less readable?\\<\n\nTry reading a novel set in Courier. Can’t find one? Hmmmm.... There’s a reason.\n\n"
    },
    {
      "time": " 9.Aug.2005 12.27pm",
      "content": "I’d like to add a point which, as far as I’ve found out, hasn’t been mentioned yet. There has been a big discussion about writing (german) nouns with or without capitals some time ago, and the subject keeps reemerging now and then. One of the most striking arguments which speaks against writing everything (german) in lower case letters is that the experienced and fast reader of german texts uses to jump from one noun to the next to get the content. Here it is very helpful that the noun identifies itself by its uppercase first letter (operating as a kind of bouma-boost).  \nWithin english texts, as linguists say, the main part of the content concentrates in the verb. Due to the lack of an explicit verb-marker, readers have to identify it otherwise, which is by its characteristic location within a sentence.  \nIn both cases the gaps between the words play important roles as word-separators, which, according to the theory described above, is even more important in languages where nearly everything is written in lowercase letters.\n\n"
    },
    {
      "time": " 9.Aug.2005 12.51pm",
      "content": "_I wanted to propose that the perceptual processing process uses the shapes of interstitial spaces as well. It reads them as information. They are not irrelevant. What it gets from them is contributory to visual wordform resolution, co-valent with counter shapes and stroke conformities_.\n\nPeter, I agree with the first part of the statement: both positive and negative space define the ideograph, and thus provide the referent from which we divine meaning. However, I wouldn’t accord counter shapes or stroke conformities the same “transmission” weight: their function is, I believe, more aesthetic.\n\n"
    },
    {
      "time": " 9.Aug.2005 2.16pm",
      "content": "\\> this is something I actually once discussed with Peter:  \nThe desirability of manipulating notan accounting for pair frequencies.\n\nWhat did he say? Is there a thread to read?\n\n\\> we need another version of Comic Sans, renamed to reflect its serious side\n\nmade me laugh. thanks!\n\n\\> If someone can suggest a better term than the semi-metaphorical ‘melodic’, I’m happy to consider it.\n\nI agree with nick that Harmony is a good descriptive choice - Even though it is a musical term it has also been applied to visual culture for a long time and seems easily comprehensible. Two examples - architecture & color theory. The idea is that a the a pleasing relationship of the parts is achieved. What is sensed as harmonic is often somewhat culturally bound. That’s why unfamiliar color choices & combinations may feel wacky or crazy at first & then be accepted and enjoyed later.\n\nIn a text face the the harmony is refined and quite subtle which is why it takes a long time to see & understand. When Hrant talks about a necessary ugliness in a text font this makes sense too; the anology I think of is the notes in a melody that western culture tends to think of as ’sad’ or ’dissonant’. They are used & then contrasted with whole notes for additional source of contrast drama & harmonic effect in a song.\n\n\\> Harmonic relationships form a conceptual grid against which the distinction between information and noise can be maximized. They are pleasing because they make sense, as opposed to random or more difficult matrices.\n\nI agree, but I think learned harmonic sense it is (too an extent) a cultural or learned set of distinctions which allows us to make sense, more rapidly interpret & appreciate more fully and deeply. Our ability to learn about a new kind of harmony in the unfamiliar is what is refered to in the early emigre mantra about what we read most... etc. I think that for a text face a new ’culture’ of harmony, even one which uses increased notanal sensitivity as it’s basis will have to introduce change in a subtle way. That subtlety will be powerful nonetheless.\n\n\\> It seems strange that a scale of horizontal visual proportions can be considered harmonic, when horizontal measurements in text readily suggest tempo.\n\nThis isn’t so strange when you consider that the horizontals on their own are just one element in the design which is ideally harmonized with all the others.\n\n\\> ( Harmony) Another misleading term. As if we’re not already drowning in a terminological miasma.\n\nPlease explain more why you don’t like the term. ’It’s too artsy’ isn’t really an explaination BTW - just a indication of your cultural preferences. I want to know why it obsures rather than clarifys. If that’s what its doing...\n\n\\> (proportional spacing is a definite advantage) You don’t need voodoo to imply such a thing.\n\nI agree. I think differences in relative horizontal size give us two great things:\n\nIn the Hrantian/Ennesonian sense: They help differentiate forms - it’s another ’cue’ like counters, & serifs to aid in rapid processing of the text as enneson would have it.\n\nThey create another formal design element with which to create harmony.\n\n\\> Try reading a novel set in Courier.\n\nExactly.\n\nAnd yet many universities insist on Courier for formal disertations. It must be masochism...\n\nAs you see I am hardly an obsolute readability relativist. Actually, who is? Nick, are you?\n\nWhat would the opposite be? An A-cultural Readabilty Absolutist? Hrant are you?\n\nI doubt it in each case.\n\nNotan is I think, just an element in the overall potential harmony within a font design. Similarly I think Notan is also a sub category of visual contrasts - in this case having to do with the interplay of darks & lights.\n\nNotan is a Japanese word & I think I can shed a bit light on it’s origins - I think that because Ink painting (rather that Oil) was a dominant form of art in China & Japan, and because the monochome styles were in vogue at the time when relations with China withered at the beginning of the Edo period (1603-1867), and finally because Zen Caligraphers went on to be in vogue and they especially favored monochome expression; Notan, as an aesthetic benchmark naturally became more important than it would have otherwise been.\n\nA side note - Sargent’s Oil paintings draw much of their power from a profound & subtle use of Notan. Vermeer and Monet seemed pretty interested too. You can’t tell by looking at photos or on the web either. The range of contrast in each case is nowhere near enough for their Notan to be reproduced. You have to see them in person.\n\n"
    },
    {
      "time": " 9.Aug.2005 2.20pm",
      "content": "\\> is even more important in languages where nearly everything is written in lowercase letters\n\nInteresting! And nicely written too.\n\n"
    },
    {
      "time": " 9.Aug.2005 2.44pm",
      "content": "\\> What did he say? Is there a thread to read?\n\nI think he didn’t see a point (although I could be remembering wrong). Maybe because it’s not ideologially pure enough, hence unappealing to a Modernist philosopher. It was a private exchange.\n\n\\> Please explain more why you don’t like the term.\n\nIt adds noise, and nothing else. I don’t think it’s a good idea to apply parallels between composed music and reading. A text face is more like a wild bird chirping.\n\n\\> What would the opposite be?\n\nSomebody who thinks Familiarity and Culture play no roles in reading.  \nNot me.\n\nVermeer is indeed impressive, in person. When I was a kid he was my favorite painter. But I think that’s more chiaroscuro, less notan.\n\nhhp\n\n"
    },
    {
      "time": " 9.Aug.2005 2.59pm",
      "content": "An harmonic scale is assumed to have a mathematical basis, although in the visual arts this is hard to put numbers to. However, Luc de Groot’s mathematical curve that he uses to plot the relative weights of type family members is an example. The golden section has a mathematical definition, of course. Bringhurst, in his Elements, discusses Fibonacci series. Even if artists and designers are unaware of the maths, I suspect that through acquiring the implicit knowledge of their discipline, and through experimentation which develops their good taste, their work tends towards such mathematically pure proportions.\n\n"
    },
    {
      "time": " 9.Aug.2005 3.16pm",
      "content": "Hm, perception can change throughout lifetime, right? Just as an example, I always wonder when the time will come and I’ll stop considering some sort of free jazz interpretations as noise instead of harmony, even if it’s “mathematically” pure?\n\n"
    },
    {
      "time": " 9.Aug.2005 3.48pm",
      "content": "[Nick Curtis] I wouldn’t accord counter shapes or stroke conformities the same “transmission” weight: their function is, I believe, more aesthetic.\n\nAs carriers of linguistic meaning, I wouldn’t either.  \nPerhaps stroke conformities is a misleading term. I meant to imply that both role architectural particulars and role architecturally evoked particulars, including the between-letter shapes evoked by placing two or more letters side by side, are functioning agents in visual wordform resolutional tasks. (Parallel letter recognition models of word recognition only consider the black)\n\nThe idea is a hunch. And I tried to develop it in my Typo#13 contribution. I do not know of any hard evidence. But it seems consistent with some current understandings of how transmission of information through the visual cortex works.\n\nWhat sparked the notion was consideration of the Stuart Gluth graphics reproduced with my Typo#13 contribution, and Gerrit Noordzij’s method of correcting word blindess, by forcing the word blind person to see the shapes of the areas between adjacent letters (kind of like imprinting), as well as his insistance that the letter is two shapes, the white and the black. All the while familiarizing myself with the neuro-biology of the visual cortex.\n\n"
    },
    {
      "time": " 9.Aug.2005 3.55pm",
      "content": "\\> But I think that’s more chiaroscuro, less notan.\n\nI think when you consider light & dark & composition in the same thought you are thinking about notan.\n\n\\> It adds noise, and nothing else. I don’t think it’s a good idea to apply parallels between composed music and reading. A text face is more like a wild bird chirping.\n\nEven if you don’t like a musical analogy, harmony is still a term used by lots of other arts & crafts. Even in engineering. I think in some ways its a reduction of the thought - ’this works for me’ or ’this is a pleasing combination’. Has pleasure really got no place in readability? It seems like it must have to me. Not the only role, but a role.\n\n\\> the time will come and I’ll stop considering some sort of free jazz interpretations as noise instead of harmony\n\nIt’s happened to me over & over. I used to find Chinese color schemes horrible but now I like them. I used to think that arab/persian/central asian music was squeaky and discordant. Now I like it. I used to hate cilantro - it tasted like soap - now I like it (alot).\n\nI think I leaned to find the ’harmony’ or pleasure in these things. I aculturated them.\n\n\\>and through experimentation which develops their good taste, their work tends towards such mathematically pure proportions.\n\nYou don’t need a theory to know something feels right to you. Still, it is interesting.\n\n\\> Luc de Groot’s mathematical curve that he uses to plot the relative weights of type family members is an example.\n\nI looked into that. This turned out to be similar not be a quite the same as the Fibonacci series, or the golden # series ( which are also similar but not the same ). I am guessing that that was because Luc(as) adjusted his curve until it felt right to him. I still recall that Jean Porchez warned us to use our eyes not numbers when designing font or something to that effect. The thread is theoretically still on typophile.\n\n"
    },
    {
      "time": " 9.Aug.2005 4.13pm",
      "content": "\\> Has pleasure really got no place in readability?\n\nOf course it does. But many people here are looking in the wrong direction.\n\nDiscord is not lack of harmony. Harmony is everywhere.  \nDiscord is a given person’s inability to see the harmony.\n\n\\> Jean Porchez warned us to use our eyes not numbers\n\nMath is a tool. Just a tool. But a very useful one. But not the only one.\n\nhhp\n\n"
    },
    {
      "time": " 9.Aug.2005 4.17pm",
      "content": "\\>noise instead of harmony,\n\nFree jazz — sounds like a Fuse fonts project.\n\n"
    },
    {
      "time": " 11.Nov.2006 5.26pm",
      "content": "the thing i wanna point out is 003.jpg actually is a page of chinese, not japanese. Form a chinese perspective, i donot very like 003, the proportion is a bit odd and some parts are even distorted in wrong positions , could be a certain kind of style, i am not 100% sure.\n\nif East Asian calligraphy is interested, i suggest to look at the origin.\n\n[http://en.wikipedia.org/wiki/East\\_Asian\\_calligraphy](http://web.archive.org/web/20090531082714/http:/en.wikipedia.org/wiki/East_Asian_calligraphy \"http://en.wikipedia.org/wiki/East\\_Asian\\_calligraphy\")\n\n(I do not have any hatred of japanese calligraphy, but in a pure sense of writing chinese characters, original ones look more “right” to me. )\n\nBTW: some english materials i found about it, without carefully reading, I am not sure the copy, but the examples are the “right” ones to me..  \n [http://www.art-virtue.com/history/index.htm](http://web.archive.org/web/20090531082714/http:/www.art-virtue.com/history/index.htm \"http://www.art-virtue.com/history/index.htm\")  \nMy personal favor would be Sung Dynasty, Yuan Dynasty and Ming Dynasty.\n\nespecially this one: http://www.art-virtue.com/history/sung/HueiZong1(complete).jpg  \nfor me, it is true art with incredible confidence.\n\nalso: [http://www.art-virtue.com/history/chin%20&%20han/TsuiYuan.jpg](http://web.archive.org/web/20090531082714/http:/www.art-virtue.com/history/chin%20&%20han/TsuiYuan.jpg \"http://www.art-virtue.com/history/chin%20&%20han/TsuiYuan.jpg\")  \n [http://www.art-virtue.com/history/tang/HuaiSu1.jpg](http://web.archive.org/web/20090531082714/http:/www.art-virtue.com/history/tang/HuaiSu1.jpg \"http://www.art-virtue.com/history/tang/HuaiSu1.jpg\")\n\n"
    },
    {
      "time": " 13.Nov.2006 1.10pm",
      "content": "Beautiful examples. Are you a calligrapher?\n\n"
    }
  ]
}
