{
  "id": "14440",
  "title": "Underline = underscore ?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi all,\n\nShould the underline be positioned (in it's FontLab settings) the same hight below the baseline as the underscore glyph?\n\nAnd what about the underline thickness? Equal to the underscore?\n\nthx!\n\n",
  "author": "Martin LAllier",
  "time": "7 Aug 2005 — 5:40pm",
  "uid": "7309",
  "comments": [
    {
      "time": "8 Aug 2005 — 4:14am",
      "content": "I have no idea what the accepted practise is, but it really bugs me when a URL uses an underscore and is then underlined as a link and you can't see the underscore any more. But that is probably an HTML thing rather than a wider typographical problem.\n\nI'm sure there are people here who can be more useful than me (I'd quite like to know myself).\n\nEd.\n\n"
    },
    {
      "time": "8 Aug 2005 — 5:42am",
      "content": "accepted parctice is to match underline and underscore.  \nbut Ed's point is a good one. I guess that since you don't have spaces in urls, then you must assume that there's an underscore there.\n\n"
    },
    {
      "time": "8 Aug 2005 — 6:21am",
      "content": "For those poor souls who work in Word or whatever, aligned underlines and underscores make for neater-appearing forms...for what that's worth.\n\n"
    },
    {
      "time": "8 Aug 2005 — 6:33am",
      "content": "Here's my approach: The underscore glyph is designed to work when it replaces a space in word\\_strings\\_like\\_this. The underscore's thickness can matches the horizonal stroke in glyphs like \"f\" and \"t\". (You want it to look good, so don't match a really fat font with a really fat underscore if it's goofy.)  \nThe underline should similarly work and look good. I make all underline settings in a font family the same, quite thin (30 units), and position them approximately in the middle of the descender depth. Since underline is either off or on, you want to make sure it looks good running through a word like \"jugpoppy\" with its many flavours of descenders.  \nMes deux sous.\n\n"
    },
    {
      "time": "16 Feb 2007 — 6:48am",
      "content": "Here I go picking up a very old thread, but it would be interesting to hear more opinions on this. I have looked at a whole lot of fonts. It seems that there are three different approaches here, well actually more, but if we divide them in three approaches, they could look like this:\n\n1. Underline = underscore = same positions and width in the whole family. Light, bold, regular – they have the same underscore/line value.\n\n2. Underline = underscore = same positions and width, but they both change together, depending on weight. Is it light, bold or regular; then the underscore and underline also shows it. It \"follows\" the other characters, so to speak.\n\n3. All the others: These ones don’t really follow any logic. Underline have one position and one weight and is placed below the underscore – or in the middle of underscore – or alignes on the top of the unnderscore. The underscore could change in weight, but not the underline – it always stays the same.\n\nWhat could be the ultimate solution to this? I think I prefer alternative two, but maybe there is some crucial information about this today?\n\n"
    },
    {
      "time": "16 Feb 2007 — 12:47pm",
      "content": "An underscore is a distinct character with special meanings in various scripting/programming/markup languages, not the least of which is HTML (principally in frame and window targeting, in that instance). In those situations (i.e.: writing code), at least, it would be prudent to have an underscore character that can be easily recognized as such even when underlined, and not be mistaken for an underlined space.\n\n"
    },
    {
      "time": "16 Feb 2007 — 1:10pm",
      "content": "<cite>An underscore is a distinct character with special meanings in various scripting/programming/markup languages</cite>\n\nBut are underlining really used when programming code? Is is even possible?\n\n"
    },
    {
      "time": "16 Feb 2007 — 1:16pm",
      "content": "As far as I know, no, underlining is not used when programming code. However, I could conceive of it being used in textbooks teaching programming, and there an underlined underscore might come into play.\n\n"
    }
  ]
}
