{
  "id": "14465",
  "title": "Party Alert For Bay Area Type Geeks!",
  "forum": "San Francisco",
  "tags": [
    "San Francisco"
  ],
  "content": "First: join the grouop: [http://groups.yahoo.com/group/sfbaytype/](http://web.archive.org/web/20150317162413/http:/groups.yahoo.com/group/sfbaytype/ \"http://groups.yahoo.com/group/sfbaytype/\")\n\nSecond: Note that there is a party brewing on the 20th. Details will be found on the SFBAYTYPE group (and here). However, you must join the group to get the invite.\n\n(I'll move this thread to the appropriate location soonish.)\n\n",
  "author": "Miss Tiffany",
  "time": "8 Aug 2005 — 4:54pm",
  "uid": "108",
  "comments": [
    {
      "time": "8 Aug 2005 — 5:08pm",
      "content": "Nuts! Looks like I'll just miss that party...\n\n"
    },
    {
      "time": "9 Aug 2005 — 8:49pm",
      "content": "aww, can't ya have just one party in las vegas, tiff? cum-on puhleeze? we even have a gawd-awful cemetary for defunct signs...\n\n"
    },
    {
      "time": "9 Aug 2005 — 9:05pm",
      "content": "ehehe. vegas this winter, i promise!\n\n"
    },
    {
      "time": "9 Aug 2005 — 10:09pm",
      "content": "So girlie, you gonna lemme in to your super-swank, ultra-exclusive type geeks group or what? I might have to hang myself if ya don't. Also, have ya checked out Jon's piece re: Anthropologie on his site? Funny stuff.\n\n"
    },
    {
      "time": "10 Aug 2005 — 9:00am",
      "content": "This isn't invitation only. For the record. It started out as an intimate little gathering of about 20 ... but then we kept thinking of more people that we needed to invite and then we worried we'd miss someone. If you are going to be in SF on the 20th of August please join the list!\n\n_Join the list anyway to be alerted to future events._\n\n"
    },
    {
      "time": "10 Aug 2005 — 9:02am",
      "content": "Sheri, where is this thingy written by Jon? I just went to his site and didn't find anything.\n\n"
    },
    {
      "time": "18 Aug 2005 — 4:00pm",
      "content": "Watch this space. Information will be posted soon (today or tomorrow).\n\n"
    },
    {
      "time": "19 Aug 2005 — 3:55am",
      "content": "Greetings, everyone!\n\nFirst off, if you are interested in keeping up to date with future events, please go to [http://groups.yahoo.com/group/sfbaytype/](http://web.archive.org/web/20150317162413/http:/groups.yahoo.com/group/sfbaytype/ \"http://groups.yahoo.com/group/sfbaytype/\") and sign up. You'll receive email messages about and can participate in discussion about future events we'll plan. These gatherings will also be announced on Typophile, but the Yahoo group will have more detailed discussion not appropriate to this forum.\n\nOur first social event of the season is this Saturday, August 20, 2005. Miss Tiffany is in town for the weekend, and we want to show her some of the beauty of SF that she didn't see during TypeCon2004. We're going to have a gathering on the beach, with a bonfire, marshmallows, socializing, and fun. This is a chance for us to get together informally and have a good time. Bring spouses, buddies, and other loved ones who would enjoy this. Please feel free to forward this message to your friends and colleagues not on this list - everyone is welcome. Even if you (or your friends) can't make it this time, we'd love to see you at future gatherings.\n\nFor this gathering:\n\nSaturday, August 20  \nMeet on the beach directly in front (west) of the Beach Chalet  \nJohn F Kennedy Dr & Great Hwy  \nMap: [http://shurl.org/Bonfire+Beach+Spot](http://web.archive.org/web/20150317162413/http:/shurl.org/Bonfire+Beach+Spot \"http://shurl.org/Bonfire+Beach+Spot\")\n\nMeet between 4:45 and 5:15 pm, and we'll go as a group to the site of our bonfire.\n\nThe area just west of Golden Gate Park is one of the few beach areas where bonfires are legal.\n\nWe need more firewood, kindling, and newspaper. Any firewood must be completely free of nails and staples and other such foreign objects.\n\nThis is a true potluck event. We could use one or two small grills/Hibachis (with charcoal, starter, etc.) to make it easier to cook - can anyone bring a grill? We plan to roast hot dogs, tofu dogs, marshmallows, etc., over the fire, but it would be great to have grills to allow us to have non-bonfire-friendly foodstuffs. We will supply marshmallows and other light snacks. Everyone is responsible for bringing their own \"real\" food (meat items, salads, sandwiches, etc. - whatever you care to bring for your own dinner or to share). You don't to bring something to share, just make sure you at least bring whatever you need to fortify yourself for the evening, as marshmallows are not yet recognized as one of the basic food groups.\n\nIt is essential that no one bring ANY glass bottles or other glass containers to this event. Alcohol is not allowed on the beach, but those of you who are discreet in this matter should not be bothered. Best idea is to place ALL beverages in plastic cups, plastic soda bottles, etc, to ensure there are no problems.\n\nDress in layers for typical crazy SF weather - warm at times, but chilly if foggy or misty. Bring blankets, beach chairs, etc., whatever you want to sit on and get comfy with. Bring whatever else will make your time at the beach fun!\n\nPlease email me at tamye at typelife.com or post here to let us know that you're coming and what you will bring. You can also call - my # is on the typecon.com site under contact section for those in the know.\n\nLook forward to seeing anyone who can make it.\n\nWe'll plan another event for late September-ish - we'd like to make this a monthly gathering, so please feel free to offer your ideas for get-togethers and/or activities we can do together.\n\nSee you this weekend, or later!\n\nAll the best,  \nTamye\n\n"
    },
    {
      "time": "20 Aug 2005 — 1:50pm",
      "content": "One last thing... if you can't be there between 4:45 and 5:15, no worries. Just come on down later and park and walk to the beach by the Beach Chalet. You'll find us... we'll be the ones talking about letters instead of singing kum-bah-ya...\n\n"
    },
    {
      "time": "10 Apr 2006 — 4:42am",
      "content": "Heya, I ll be in San Francisco between May 20th and 27th, any type meeting around? See u!\n\n"
    }
  ]
}
