{
  "id": "14468",
  "title": "Letters on Irish copper token from the 1790s",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I am hoping that someone on this list might be able to assist me in identifying a specific font. However, the unidentified font is not from a printed work, but rather on an Irish copper token from the 1790’s. In the standard production of coinage dies, letter punches were created to punch the various legends into the obverse and reverse of the dies used to create tokens or coins.\n\nI am working on a book related to these specific tokens, and if it all possible, I would like to identify the typeface used on these tokens. I have created a very minimal webpage that includes images of the obverse and reverse of the token, as well as close-ups of the individual letters. The webpage is available at:\n\n[http://copland.udel.edu/~gregg/camac.htm](http://web.archive.org/web/20051111130629/http:/copland.udel.edu/~gregg/camac.htm)\n\nAny assistance or suggestions would be greatly appreciated and would of course be acknowledged in any publications.\n\nThank you very much!\n\n— Gregg A. Silvis\n\n",
  "author": "gsilvis",
  "time": "8 August, 2005 - 6:34pm",
  "uid": "8689",
  "comments": [
    {
      "time": " 8 August, 2005 - 9:27pm",
      "content": "It’s a hard one and I’m no expert but this could be custom made for the coin judging by the bottom splited stems in some letters.\n\nHéctor\n\n"
    },
    {
      "time": " 9 August, 2005 - 12:35pm",
      "content": "Do you know who was the founder of these coins? You mention Irish, but do you have a name? I doubt it will be a typeface, but it is an interesting question from a historic point of view.\n\n"
    },
    {
      "time": " 10 August, 2005 - 10:54am",
      "content": "Gregg,\n\nHaving had a more than passing interest in numismatics at one point in my life, I think I can state with some certainty that the lettering on this coin is not a specific typeface, but rather an amalgam or workable letters in the punch-cutter’s bag of tricks. Also, stylistically the letters and numbers really don’t belong together.\n\nIf you’re looking for something close to these letters, your might consider Letteror’s [Federal Series](http://web.archive.org/web/20051111130629/http:/www.letterror.com/catalog/fed/index.html); the numbers are another story — their design reminds me of early sixteenth-century stuff. You might check out [Dave Nalle’s](http://web.archive.org/web/20051111130629/http:/www.fontcraft.com/csa/fontcraft.php) stuff.\n\n"
    }
  ]
}
