{
  "id": "14466",
  "title": "hidef web design logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "We are having an awful time of trying to pick and design a logo for our web company. No matter how many designs we have we aren’t really satisfied with any of them, and my designer is threatening hari-kari.\n\nHere’s what we are working with now.  \n [http://www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/Text-New-Series.gif](http://web.archive.org/web/20060522104404/http:/www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/Text-New-Series.gif)\n\n[http://www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/Text-New-Series-1.gif](http://web.archive.org/web/20060522104404/http:/www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/Text-New-Series-1.gif)\n\n[http://www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/Text-New-Series-2.gif](http://web.archive.org/web/20060522104404/http:/www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/Text-New-Series-2.gif)\n\n[http://www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/New-Series-3.jpg](http://web.archive.org/web/20060522104404/http:/www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/New-Series-3.jpg)\n\n[http://www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/New-Series-4.gif](http://web.archive.org/web/20060522104404/http:/www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/New-Series-4.gif)\n\n[http://www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/New-Series-5.gif](http://web.archive.org/web/20060522104404/http:/www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/New-Series-5.gif)\n\nsee why he’s ready to commit hari-kari?\n\nWell I like #15 on series 4, as well as 8,12,16 from the same set.  \nBut none of them make me think ‘hey, lets draft up the site, the cards, and the letter head now’  \nI’d appreciate any and all feedback.\n\n-Matt\n\n",
  "author": "<a href=\"user/8686\" title=\"View user profile.\">MattSEG</a>",
  "time": "<br>",
  "uid": "8686",
  "comments": [
    {
      "time": " 8 August, 2005 - 8:43pm",
      "content": "Ahhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh…\n\nTMI! TMI! Choking on the choices …\n\n"
    },
    {
      "time": " 8 August, 2005 - 9:37pm",
      "content": "It seems that you don’t really know what do you want and so your designer doesn’t have a concept to work on.\n\nGive your designer more input on the project so he can build the logo from a concept and a strategy. And so you will have a critery to choose.\n\nHéctor\n\n"
    },
    {
      "time": " 9 August, 2005 - 3:48am",
      "content": "Hector, is right, these are good examples of design for design sake. Questions I have are who is your target audience, what are you trying to sell (hosting?, design?), What does hidef mean? Even IBM was International Business Machines before it became IBM. You need not just a mark but spell out your name and create a positioning line (even if you don’t use it with the logo). This isn’t a logo project its a CI (Corporate Idenity) project and takes a lot more work than just torturing your designer.\n\n"
    },
    {
      "time": " 9 August, 2005 - 7:23am",
      "content": "Is it hidef as in high definition? If so, I think you need to split the word: hi-def, as ‘hidef’ just looks a little odd (hedef? hide f? hid def? I also think the variations where ‘web’ is on a separate line work much better.\n\nAs for the options, it looks like the shotgun approach. You need to start narrowing things down. Personally, I like the simplicity of series 3.\n\n"
    },
    {
      "time": " 9 August, 2005 - 8:18am",
      "content": "Our audience: 100k/yr-20m/yr businesses. Web design, hosting, consultation, custom programming, software development, some IT, and some print design. We’ve had the name for 3 years and it would be tricky to change at this point, we are just hitting a big growth spurt right now and we want to get our brand up to that.\n\nOur designer is a gifted and wonderful fellow, and we treat him well. I was trying to steer more toward a text based logo rather than merely a brand mark. I think that would allow for greater growth, and a more serious look. I’ve told him this, though we disagree some.\n\nWe are doing identity, we have the colors picked out, we are narrowing down fonts (this will depend partly on the logo), and we are getting ideas for cards and everything else. We are just trying to stick a logo to use as the basis for what is to come. He knows it’s a helluva project, as do we.\n\nWe’ve gone from more marked logos to more text logos, so we are certainly going in a direction, but I am trying to guide it to something I like.\n\nAluminum, I like your thoughts about splitting it up…. except our company name is “hidef web solutions llc” so I think legality might bind us a bit. And (not sure if I can post this) [www.hidefweb.com](http://web.archive.org/web/20060522104404/http:/www.hidefweb.com/) is our domain. Of course if I were to name it it would be the core members last names, or conflict design (since my business partner is Iranian and I am Jewish).\n\n"
    },
    {
      "time": " 9 August, 2005 - 11:54am",
      "content": "At a glance, series 3. But as others have said, it’s all stylistic choice without substantive reason.\n\nDoes your designer know you’re posting his work here? He might be interested to read this stuff directly/defend his decisions/benefit from the idea exchange.\n\n"
    },
    {
      "time": " 9 August, 2005 - 12:09pm",
      "content": "Personally, I feel that any of the choices in the very first link you provided will fill your need for a strong, text-based logo. All are simple, clean and direct. My favorite in that series is 3rd from the bottom. The font fits well within the web development community. It’s modern and technical…without looking geeky. :) It’s been said before, but I also feel that it is a matter of personal preference. Just find the right color combo and you are all set.\n\n"
    },
    {
      "time": " 9 August, 2005 - 4:55pm",
      "content": "He does know I posted, and i sent him a link, but since he can’t read english very quickly he wanted me to digest it for him and give him the feed back.\n\nPersonally logo’s like:  \nThe Bell & Ross logo http://www.bellross.com  \n [http://www.sevensalotti.it/](http://web.archive.org/web/20060522104404/http:/www.sevensalotti.it/) their logo.  \nOrange (cellular provider) http://www.orange.co.uk/  \n [http://hillier.com/](http://web.archive.org/web/20060522104404/http:/hillier.com/) just their logo, and cleanness  \n [http://www.inmagine.com/](http://web.archive.org/web/20060522104404/http:/www.inmagine.com/)\n\n"
    },
    {
      "time": " 10 August, 2005 - 8:39am",
      "content": "_Aluminum, I like your thoughts about splitting it up…. except our company name is “hidef web solutions llc” so I think legality might bind us a bit._\n\nIANAL, but my understanding is that you can use a variation of your legal name as long as somewhere you declare your proper name:\n\nBob’s really long legal company name incorporated LLC DBA (doing business as) BobCo!\n\nYour current logo, with the lowercase ‘i’ does help a bit tpo make it readable as ‘hi def’\n\n"
    },
    {
      "time": " 17 August, 2005 - 6:58am",
      "content": "Looking at the logo’s you like, I’d say you dislike visual clutter. It also leads me to think a sans serif would be a good choice for type.\n\nIt might help to make an image of all the concepts that follow these two: visual simplicity, sansserif type. Narrowing down the choices should give more of a sense of direction.\n\n——————————————————————————  \nMy work is a game. A very serious game [M.C. Escher]\n\n"
    },
    {
      "time": " 18 August, 2005 - 12:31am",
      "content": "Well…we got one.\n\nit’s going to be some iteration of this.  \n [http://www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/LogoWorked.jpg](http://web.archive.org/web/20060522104404/http:/www.hidefweb.com/basecamp/hidefweb/hidefidentityredesign/LogoWorked.jpg)\n\n"
    },
    {
      "time": " 18 August, 2005 - 6:55am",
      "content": "MattSEG,\n\nI noticed you have 2 main focal points:\n\n1.) The semi-geometric shape which contains the name.\n\n2.) Visual treatment done to the “e”.\n\nI would advise you to pick one and stick to it. To use both  \nis conceptually confusing and visually competitive within itself.\n\nLastly, I ask what is the concept behind that semi-geometric shape?  \nIt looks akin to a trend…\n\n"
    },
    {
      "time": " 18 August, 2005 - 7:03am",
      "content": "I agree with caboume…you have two strong elements that are competing right now…not complimenting. Pick one and go with ti.\n\nI like the ‘e’ but I’d stay away from the 3-d sphere logo as that’s very stereotypical of the dot-com bubble/crash era.\n\nThe only issue I have with the shape (and I’m admittedly REALLY stretching here…) is that it looks like a lemon. Lemon is usually a bad connotation unless you are selling lemonade.\n\n"
    },
    {
      "time": " 18 August, 2005 - 8:17am",
      "content": "Hi!\n\nSorry to be negative, but I think Aluminium’s nailed it…\n\n[http://www.e3direktiv.com](http://web.archive.org/web/20060522104404/http:/www.e3direktiv.com/) are a .com, web agency. It’s v. similar.\n\nI actually like the lemon shape but I’m unsure of the reasoning for it, it looks a bit like a stylised leaf to me. Nothing really seems to say ‘high-definition’ - I’m assuming that’s what Hi-Def stands for. Maybe something along the lines of clarity, quality, sharpness, high-end, upmarket - these are all adjectives that might associate well with High Definition. Conceptualise the brand first. Dress it up second… it’s just an exercise in style otherwise. If you revist that, you’ll give yourself the chance to hit on a concept that can then permeate everything associated with your brand - i.e. web, brochures etc., which will aid brand recognition and give it a cohesive look. Just as long as you’ve got a clear idea propping it all up, it’ll be fine.\n\nMy tip would be to switch off your Apple Mac and logically work out your ideas on paper first. Logos that aren’t great look better when they’ve been through Adobe Illustrator, so finding the one/s that work is a bit trickier if you’re just making everything look slick - it’s easy to convince yourself that a logo works because it looks slick.\n\nSorry if it’s all negative sounding, it wasn’t meant to be. I’m trying to back up any criticism with constructive comment - it wouldn’t be a critique otherwise.\n\nSi\n\n"
    },
    {
      "time": " 18 August, 2005 - 8:28am",
      "content": "What bothers me a little about all of the designs is that they seem to be focusing more on image/trendiness and less on communicating what this company is about. It seems to me that these designs would be just as well suited for a clothing line as a dot com. What’s your company’s unique trait that you’d like to convey? Customer service? Quality work? Defining this will help you make a selection. If anything, HiDef, as in high-definition, suggests top-of-the-line. Your previous logo separated the words more, using upper and lowercase to break them into understandable chunks, I think this was a good start. All lowercase letters, as in your current iteration, doesn’t do much to communicate the concept.\n\n"
    },
    {
      "time": " 18 August, 2005 - 9:26am",
      "content": "why focus on the \\_e\\_?\n\n"
    },
    {
      "time": " 18 August, 2005 - 2:05pm",
      "content": "I think this had to be a horrible process for the designer. Total mess, unfocused, no business plan and the last looks are still all over the place. I don’t think I’d ever hire you to design a site for me.\n\n"
    },
    {
      "time": " 21 August, 2005 - 6:30pm",
      "content": "The ‘e’ needs counseling, or just kill itself. Just strikes me as odd. Not in a good/odd way either. Bastard child of the hulk and a pygmy rat.\n\n"
    },
    {
      "time": " 21 August, 2005 - 7:29pm",
      "content": "My comments are akin to Dan W’s. Hence, no comment.\n\n"
    },
    {
      "time": " 31 August, 2005 - 8:13pm",
      "content": "_“…and some print design.”_\n\nI love it when IT professionals and web developers delve in the arena that is “print.”\n\nFOCUS, FOCUS, FOCUS.\n\n"
    }
  ]
}
