{
  "id": "14462",
  "title": "Typecon Film Festival",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "are there any links or mentions of the films that were in the typecon film festival? I missed the festival and was curious if there was any sort of post mortem coverage.\n\n-phil\n\n [‹ MS Word and OpenType](http://web.archive.org/web/20080827235603/http:/www.typophile.com/node/9830 \"Go to previous forum topic\") [Shinn vs. Papazian challenge ›](http://web.archive.org/web/20080827235603/http:/www.typophile.com/node/13926 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080827235603/http://www.typophile.com/user/8635\" title=\"View user profile.\">illop</a>",
  "time": "<br>",
  "uid": "8635",
  "comments": [
    {
      "time": " 8.Aug.2005 3.21pm",
      "content": "im still still waiting for my DVD from the Typophile film festival numero uno. ahem, ahem\n\n"
    },
    {
      "time": " 8.Aug.2005 4.00pm",
      "content": "Although SOTA and TypeCon would love to take credit for coming up with the Typophile Film Festival, this is Jared and Joe’s brainchild. We are just happy as can be to give them a venue for the festival, and to help promote it. So it’s not the TypeCon Film Festival, but the Typophile Film Festival, produced by Punchcut. Which debuts at TypeCon...\n\nWhew. So now, if only Jared and Joe didn’t have to run Punchcut and Typophile and have families, and were rich, oh, and didn’t have to get permission from copyright holders, they could get that DVD out ;)\n\nOne of these days... and it will be worth the wait!\n\n"
    },
    {
      "time": " 9.Aug.2005 7.13am",
      "content": "[http://www.underconsideration.com/speakup/archives/002374.html](http://web.archive.org/web/20080827235603/http:/www.underconsideration.com/speakup/archives/002374.html \"http://www.underconsideration.com/speakup/archives/002374.html\")\n\nThis has a short report, it also has links to some of the films available to view in Quicktime  \nEtched in Stone and Little Yellow Writing Hood are well worth viewing.  \nTim\n\n"
    }
  ]
}
