{
  "id": "14477",
  "title": "\"The London Free For All\" lovely script font",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "[http://www.goodfornothingmag.com/advertisers/\\_images/london\\_free\\_for\\_all.gif](http://web.archive.org/web/20051110155836/http:/www.goodfornothingmag.com/advertisers/_images/london_free_for_all.gif)\n\nDo you rekon it is something made up just for the magazine?\n\nIt would be brilliant if it is available from somewhere…\n\n",
  "author": "bene",
  "time": "9 August, 2005 - 7:54am",
  "uid": "8696",
  "comments": [
    {
      "time": " 9 August, 2005 - 8:26am",
      "content": "While the letters which match are the same, I wonder if it isn’t a cut-and-paste lettering project in illustrator?\n\n"
    },
    {
      "time": " 9 August, 2005 - 9:13am",
      "content": "Yeah I got that feeling as well, you might be right, but I’ve seen using the same font for some titles inside the magazine as well…\n\nNow, it takes quite a lot of effort to put together all those letters all the time…maybe it is really a font?\n\n"
    },
    {
      "time": " 9 August, 2005 - 9:15am",
      "content": "Maybe THEY made it into their own custom font.?\n\nDav, [formlos](http://web.archive.org/web/20051110155836/http:/www.formlos.net/)\n\n"
    },
    {
      "time": " 9 August, 2005 - 9:28am",
      "content": "In that case… I have no hope.. :(\n\n"
    },
    {
      "time": " 9 August, 2005 - 9:35am",
      "content": "It seems to me they have a few basic shapes which they’ve converted into the typeface. You might start with dissecting the shapes. It could turn into a fun side project for you.\n\n"
    },
    {
      "time": " 9 August, 2005 - 1:47pm",
      "content": "I assume that at least the lc ‘l’ has been customized … I find it difficult to imagine that any foundry would dare to market a font with such a screwed up character, turning “london” into “jondon”. I’d be hard pressed to find a reason why anyone would mirror an ‘l’ that would otherwise (i. e. the right way around) fit just fine into the font.\n\nPlease excuse my small-mindedness. :)\n\njpg\n\n"
    },
    {
      "time": " 9 August, 2005 - 2:11pm",
      "content": "The “el” and “y” in Emigre’s Suburban are flipped equivalents.\n\nhhp\n\n"
    },
    {
      "time": " 9 August, 2005 - 6:54pm",
      "content": "Hi hrant. I certainly don’t depreciate character mirroring/flipping. Suburban’s flipped ‘el’ (I adopt your notation of the lc ‘L’) and ‘y’ are a pretty, thought-out design feature and neither prone to be confused with each other nor with any other character of that font.\n\nUnlike that, the mirrored ‘el’ in the above font is very likely to be read as a ‘j’. (In fact, it will only be recognized as an ‘el’ when its context - the word - rules out a ‘j’. While such ambiguity is common with certain characters such as ‘el’, ‘I’ and ‘1’, there is, IMHO, no need to invent new sources of confusion.) That mirrored ‘l’ is, in my view, an injudicious, pointless modification of the letterform, not adding any sophistication to the font, but definitely impairing its readability. I’d like to see “Jolly Joker” set in the above unknown font.\n\njpg\n\n"
    },
    {
      "time": " 10 August, 2005 - 9:32am",
      "content": "Greyhound Script has a similar feel - you could start with that.\n\nhttp://www.myfonts.com/fonts/agfa/greyhound-script/greyhound-script/testdrive.html?s=the+london+free+for+all&p=48\n\n"
    },
    {
      "time": " 11 August, 2005 - 7:58am",
      "content": "Thank you a lot guys for all the precious info!  \nThat Greyhound font looks just as lovely, although I really loved the “f” letter in that unknown typeface example…\n\n"
    },
    {
      "time": " 11 August, 2005 - 8:07am",
      "content": "I agree with jpg on the lower case l (or el) though, it does look like a J.\n\n"
    }
  ]
}
