{
  "id": "14487",
  "title": "MAC Rhino Fonts goes West!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all!\n\nThis might sound like a trend or something, but I'm also heading out West and yes the city in mind is of course San Francisco. It has been on the agenda for quite some time and now the timing is perfect. It won't be forever, but 6 month will give me (and my family) the opportunity to experience daily life in this fantastic city. And since SF also is a good community regarding type design and graphic design, this will probably lead to new connections one way or the other. Already having some close friends there, I would still like to point out to all you other locals here on typophile, that I look forward to meet some new faces during my stay.\n\nCheers & long live San Francisco!\n\n",
  "author": "Stefan H",
  "time": "9 Aug 2005 — 2:34pm",
  "uid": "4404",
  "comments": [
    {
      "time": "9 Aug 2005 — 3:26pm",
      "content": "I know Typophile isn't meant to be an \"employment service\", but I would also like to point out that apart from the work I'll bring myself, I'm always open to collaborate on typedesign with some local design companies. Please step forward – I'm all ears!\n\nSalute!\n\n"
    },
    {
      "time": "9 Aug 2005 — 3:32pm",
      "content": "what is going on with San Francisco? :)\n\n"
    },
    {
      "time": "9 Aug 2005 — 3:39pm",
      "content": "San Francisco's rad, that's all. Plus we're less cranky than New Yorkers (although just as mean in our kind, \"it's all good\" way).\n\n"
    },
    {
      "time": "9 Aug 2005 — 4:05pm",
      "content": "Can't wait for you and the family to arrive, Stefan.  \nit will be a great 6 months...\n\n"
    },
    {
      "time": "9 Aug 2005 — 4:08pm",
      "content": "Mean? Come on dude.\n\nTo me, there are four livable cities in the US: LA, SF, NY, and Nawlins.\n\nhhp\n\n"
    },
    {
      "time": "9 Aug 2005 — 4:36pm",
      "content": "I followed Stefan to Stockholm. Stefan follows me here. It's called the circle of life, my friends. Will be great to have you at the local type gatherings, Mr. MAC!\n\n"
    },
    {
      "time": "9 Aug 2005 — 4:39pm",
      "content": "Right on, Timon.\n\nhhp\n\n"
    },
    {
      "time": "9 Aug 2005 — 4:53pm",
      "content": "Hrant: try living here for a while.\n\nStefan: We promise to be nice to you and to pet the rhino. You'll have fun!\n\n"
    },
    {
      "time": "9 Aug 2005 — 4:55pm",
      "content": "I lived in Palo Alto for 2.5 years as a kid. It's what softened me up.\n\nhhp\n\n"
    },
    {
      "time": "9 Aug 2005 — 4:58pm",
      "content": "\\>what is going on with San Francisco?\\<  \n\\>San Francisco’s rad, that’s all. Plus we’re less cranky than New Yorkers (although just as mean in our kind, “it’s all good” way)\\<\n\nPassive aggression is the new abrasive, baby. New York is so 20th century.\n\n;)\n\nActually, you may have heard, \"It's the cheese\".\n\n"
    },
    {
      "time": "9 Aug 2005 — 5:23pm",
      "content": "The cheese can be good! Especially the cheese from [Cowgirl Creamery](http://web.archive.org/web/20131020190925/http:/www.cowgirlcreamery.com/)!\n\n"
    },
    {
      "time": "9 Aug 2005 — 6:15pm",
      "content": "My favorite story about the differences between the coasts comes from the 60's. The hippies from the West Coast and the yippies from the East Coast decided to surround the Pentagon, hold hands, and raise it in the air. The East Coast contigent, led by Abbie Hoffman, looked at it as a great media event. The West Coast contigent believed it could be done…  \npeace\n\n"
    },
    {
      "time": "9 Aug 2005 — 6:18pm",
      "content": "Woohoo! Its contagious!\n\n"
    },
    {
      "time": "9 Aug 2005 — 8:58pm",
      "content": "Looking forward to having you around Stefan!\n\n"
    },
    {
      "time": "10 Aug 2005 — 1:52am",
      "content": "Thanks Tamye and Zara ;-)\n\n"
    },
    {
      "time": "10 Aug 2005 — 2:24am",
      "content": "Stefan, it'll be great to have you around. Will you make it to Tiffany's get-together?\n\n\\_\\_\\_\\_\\_\\_\\_\\_\n\nHave you heard this one?\n\n\"You should live in New York, but leave before you become too hardened. And you should live in San Francisco but leave before you get too soft.\"\n\nI always thought that was about politics, which could be true. But after my return to NYC for [TypeCon](http://web.archive.org/web/20131020190925/http:/typophile.com/wiki/TypeCon), I think it's all about the weather.\n\nOne thing about New York though, to my relief I didn't see one pair of Birkenstocks or Doc Martens. SF could take a lesson from NYC in the shoe category. =)\n\n"
    },
    {
      "time": "10 Aug 2005 — 4:39am",
      "content": "Cranky, whoes cranky, I anin't cranky, who freggin called New Yorkers cranky…\n\n"
    },
    {
      "time": "10 Aug 2005 — 5:21am",
      "content": "\"Will you make it to Tiffany’s get-together?\"\n\nI'm not sure if I'm even invited? Even less aware if I will get there in time. Our flight leaves August 28th (arrival 1:50 PM local time)... I would be happy to join though ;-)\n\n"
    },
    {
      "time": "10 Aug 2005 — 5:47am",
      "content": "_live in San Francisco but leave before you get too soft._\n\nthe way i heard it was live in **Northern California**... in Baz Lurhman's [Everybody's Free (to wear Sunscreen)](http://web.archive.org/web/20131020190925/http:/spaces.msn.com/members/emma-mulholland/Blog/cns!1pa-CZeNoK5IJ5uY5YQmh5qw!498.entry) In which case I think Napa, Redding, Eureka, Dixon, Davis and Sacramento all qualify. (I lived in all of those cities, for a couple months anyway). Never been to SF tho. Maybe since everyone else is doing it...\n\n"
    },
    {
      "time": "10 Aug 2005 — 7:48am",
      "content": "“Will you make it to Tiffany’s get-together?\"\n\nWhen is this shin-dig happening? And, uh sorry for butting in if its invitation only. :)\n\n"
    },
    {
      "time": "10 Aug 2005 — 8:51am",
      "content": "Stefan, Terry, see this thread for info on Miss Tiff's shindig: [http://typophile.com/node/14465](http://web.archive.org/web/20131020190925/http:/typophile.com/node/14465 \"http://typophile.com/node/14465\")\n\n"
    },
    {
      "time": "10 Aug 2005 — 8:56am",
      "content": "Stefan, OF COURSE, you'd be invited ... if you were going to be there in time. Somehow I think there will be another shindig in your honor when you arrive.\n\n_It isn't really_ my _shindig, so much as I just happen to be visiting._\n\n"
    },
    {
      "time": "10 Aug 2005 — 8:58am",
      "content": "Tbiddy the _shindig_ is next weekend, the 20th. It isn't invitation only, but you (whomever) need to get on the list (found at the node listed above) to receive instructions.\n\n"
    },
    {
      "time": "10 Aug 2005 — 11:49am",
      "content": "Everyone in SF Bay Area permanently or visiting on August 20 - join the type event planning Yahoo Group... everyone is invited, but you have to be on the list to get all the scoop.\n\nThere will be more events in the future - yeah, let's honor the arrival of Stefan and Terry with a September get-together.\n\n[http://groups.yahoo.com/group/sfbaytype/](http://web.archive.org/web/20131020190925/http:/groups.yahoo.com/group/sfbaytype/ \"http://groups.yahoo.com/group/sfbaytype/\")\n\n"
    },
    {
      "time": "10 Aug 2005 — 1:34pm",
      "content": "Tiffany,\n\nThanks for the invitation. I'll be missing the first gathering though, but stay ready for the September dito!\n\nCheers\n\n"
    },
    {
      "time": "10 Aug 2005 — 8:39pm",
      "content": "That's very sweet of you Tamye, thank you. See ya in September!\n\n"
    }
  ]
}
