{
  "id": "14486",
  "title": "web design logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am from a cartoon background, no typography skills compared to what I have seen just browsing this forum. I have become a decent web site developer and am trying to create my logo. I want to do simple, clean websites. So I wanted a simple logo. But how simple is too simple? That is my problem. So far the one I came up with is just straight helvetica neue bold. In an attempt to not be too dull, I came up with the not so unique idea of reversing the last letter and giving it a different color. Not the most brilliant idea, but now I sort of like it. Any suggestions are greatly appreciated.\n\n| Attachment | Size |\n| --- | --- |\n| [logo1.gif](http://web.archive.org/web/20140307105008/http:/typophile.com/files/logo1.gif) | 3.41 KB |\n\n",
  "author": "jeffrey",
  "time": "9 Aug 2005 — 2:05pm",
  "uid": "8705",
  "comments": [
    {
      "time": "9 Aug 2005 — 2:11pm",
      "content": "Sorry Jeff, it looks like a mistake unless you animate it and have the y revolve. You might also develop a positioning line like: Elegant website design. You need something to direct people to your core business, even if its not a tagline.\n\n"
    },
    {
      "time": "9 Aug 2005 — 2:19pm",
      "content": "You really think people could think that's a mistake? I actually like it - it creates a playful separation between a \"real\" word and a colloquial suffix (assuming it's supposed to say \"designy\", not \"design-why\" or something). But what I might try is: Futura; and a \"y\" of a flipped-\"j\" + \"u\" form.\n\nhhp\n\n"
    },
    {
      "time": "9 Aug 2005 — 2:42pm",
      "content": "I am confused by the concept. Is it design-ee or design-why?\n\n"
    },
    {
      "time": "9 Aug 2005 — 3:27pm",
      "content": "The concept is design-ee. I'm not sure how to clarify that best in the logo either. Would just keeping it one color help?\n\nI would like a tagline, I just haven't thought of one that sounds designy enough yet. If the tag line simply said web development or web dev, would that be enough to make it read as design-ee for most people?\n\nThanks for the comments so far! I will put them to work on my next effort. I have browsed quite a few threads and seen some nice results from the advice on the forum.\n\n"
    },
    {
      "time": "9 Aug 2005 — 4:04pm",
      "content": "\\> I’m not sure how to clarify that\n\nBy making the \"y\" as much a part of the word as possible. Which is why I suggested that alternate form (it allows more convincing spacing).\n\nhhp\n\n"
    },
    {
      "time": "9 Aug 2005 — 6:44pm",
      "content": "...But loose the light green - not enough contrast. A deeper green or a greyer would work better.\n\n\\> I am confused by the concept. Is it design-ee or design-why?\n\nClients will ask this too & clients don't like to feel stupid & do at the drop of a hat. I worry about this concept for that reason. What about a similar name that sets up a dialog. Like Ydesign. This & designy may both already exist. Have you checked? What about the URL? Can you get 'designy.com'?\n\n"
    },
    {
      "time": "9 Aug 2005 — 7:03pm",
      "content": "I don't think it's the concept that's the problem, just the treatment.  \nAs Hrant suggested, you may have to take it up a few levels before it can become _brilliant_!\n\nYour skills as both a designer and problem solver must be demonstrated by your \"mark.\" I won't tell you what to do, but I will tell you that it's not a bad idea.\n\nMaybe the word/sound/meaning of _disign-ee_ works more against you than your concept. IS your company name \"Design-y\"?  \nMaybe there are other variants which might be more interesting:  \nDizyn-e, Dezynee, Desygn?\n\nAnyway... Hrant, do you want to show them how flipping characters can be interesting?\n\n------------------------------------------------  \nYes, I'm old, but I flip characters with style!\n\n"
    },
    {
      "time": "9 Aug 2005 — 7:29pm",
      "content": "\\> do you want to show them how flipping characters can be interesting?\n\n:-\\>  \nIn the presence of the master?!  \n(FYI guys, Norbert has an interesting Typographica nameplate in the pipeline...)\n\nhhp\n\n"
    },
    {
      "time": "9 Aug 2005 — 8:07pm",
      "content": "Over a week ago, before I left for vacation, I was working on a nameplate design for [Typographica](http://web.archive.org/web/20140307105008/http:/www.typographi.com/) (they openly invite design submissions). I had been playing around with Hrant's typeface Patria and after a few tweaks and emails after I got back, we both agreed on a version to submit.\n\nStephen Coles will try to get it into their nameplate rotation at Typographi.com (hit refresh button on their site and the nameplate changes) but you can see a [preview here](http://web.archive.org/web/20140307105008/http:/www.acmedigital.net/Aimages/typog_5.jpg).\n\nWe weren't planning to show it on Typophile, but after you see it you'll understand why this topic kinda forced us to.\n\nWith all do respect to Jeffrey and the Forum, we do not want to divert from the main reason for this thread... critique of \"designy.\"\n\n"
    },
    {
      "time": "9 Aug 2005 — 8:19pm",
      "content": "Whoops! Hit \"Post Comment\" by mistake.\n\n"
    },
    {
      "time": "9 Aug 2005 — 9:42pm",
      "content": "Jeff,\n\nI like the name, and I think it's a good idea to keep it simple. Have you tried keeping Design all upper case and y lowercase? **DESIGNy** , or do it the other way around. And maybe try out some other fonts.\n\n"
    },
    {
      "time": "9 Aug 2005 — 9:50pm",
      "content": "Hrant,\n\nI'm really impressed with Patria. Looks really wonderful!\n\n"
    },
    {
      "time": "9 Aug 2005 — 9:55pm",
      "content": "Norbert,\n\nGreat-looking nameplate! I love old paper, print, and anything that has that worn look from decades of use. Lately, I've been bidding on old paper, and photographs (tintype, etc) on eBay for personal design projects. And I'd like to get a complete wood type alphabet, and maybe digitize it.\n\n"
    },
    {
      "time": "10 Aug 2005 — 6:45am",
      "content": "Thanks, Lauri,\n\nbut let's not forget Jeffrey's request for guidance.\n\nJeffrey,  \nto restate my opinion of flipped 'y' it's a good concept but make it work within the context of the message. My flipping of \"gra\" made sense in that the audience is type-minded and will recognize the significance in both type design and as homage to the hot metal days of \"backwards and upside down\" (though mine are just flipped).\n\n"
    },
    {
      "time": "10 Aug 2005 — 6:54am",
      "content": "I was going to suggest flipping/rotating and colouring a different character so that the designy reads without any ambiguity, it might be possible that just colouring the dot on the i might give that simple, clean appearance. If you decide you prefer the y flipped you need to close up the space with the n. To emphasise the meaning and comfort your reader your tag could be something that also ends in a (coloured, flipped) y (either real or created) like simply or pretty (that's why I'm not a copywriter).  \nTim\n\n"
    },
    {
      "time": "10 Aug 2005 — 8:21am",
      "content": "\\>What about the URL? Can you get ‘designy.com’?\n\nYes, that is domain. So I really want to work this so that designy reads design-ee and not design why. I just read some of the new suggestions, and will be working on my logo some more today. Thanks again for the really helpful input everyone! I will be back soon with a few new attempts. :)\n\n"
    },
    {
      "time": "10 Aug 2005 — 8:35am",
      "content": "I like it. The problem, though, is that 'designy' doesn't equate to 'I want to do simple, clean websites.'\n\nTo me, 'designy' is a generic term for 'fluff it up by adding a bunch of fru-fru decoration to it' which seems to be the opposite of 'simple, clean websites'.\n\nBut that could just be me. ;0)\n\n"
    },
    {
      "time": "10 Aug 2005 — 9:30am",
      "content": "Here's a quick thought. Design-E\n\nwhere \"E\" stands for excellence, exceptional and \"Ever so cool!\"  \nGotta run, back on line later.\n\n----------------------------------------------  \nYes, I'm old, but I'm back in style!\n\n"
    },
    {
      "time": "10 Aug 2005 — 9:40am",
      "content": "What about \"Designee\", as in the client is one? But really, I think \"Designy\" is best. Sure, it's a little bit self-deprecating, but it's a humble, humerous and honest way to break the ice.\n\nhhp\n\n"
    },
    {
      "time": "10 Aug 2005 — 10:29am",
      "content": "I am hoping it will be a playful thing. \"Designy\" being a little \"froufrou\" but the design being clean and simple.\n\nHere is my latest attempt, using Futura. I kept it all black for now to avoid posting 30 different color combinations. I used the idea of a custom y also.\n\n[logo2.gif](http://web.archive.org/web/20140307105008/http:/designy.com/logo/logo2.gif)\n\n"
    },
    {
      "time": "10 Aug 2005 — 10:39am",
      "content": "I think the son-of-my-idea, #3, works best. The \"d\": at first I was going to suggest trimming its ascender, but then I realized it gives a nice character to the mark; and you could shorten it (hey, maybe even lengthen it!) as needed, maybe even using the vertical line as a \"flexible\" part of your identity. One thing I **would** change though is make the descenders of the \"g\" and the \"y\" the same, probably by trimming the former and lengthening the latter, maybe even making both end horizontally (no up-curve).\n\nHere's another idea, if you wanted more whimsy/complexity:  \nmake the righthand stem of the \"n\" a slight diagonal, and use a  \nparallel diagonal arm in the \"y\" (instead of the \"u\" component).  \nOr what about joining the \"n\" and \"y\" by sharing a stem?\n\nhhp\n\n"
    },
    {
      "time": "10 Aug 2005 — 12:33pm",
      "content": "\\> Or what about joining the “n” and “y” by sharing a stem?\n\nI like that. It feels less 'clever' but that might be the right feeling.\n\nYou could also just color a lower case y grey & be done.\n\nor make the descender go straight ( maybe long? ) to mirror the d.\n\nI think Darrel ( Aluminum) is right when he talks about the venacular associations of the name but that is an opportunity as much as a pitfall. More clients including marketing folk think we might just be too designy - as Hrant said bringing it up in the name is also humourous. Then being wicked simple in style is a great visual joke in and of itself. Like writting fat in skinny letters or the opposite.\n\nThe reversed y is a little designy actually. But just a little.\n\n"
    },
    {
      "time": "10 Aug 2005 — 1:35pm",
      "content": "I'm not too worried about the association, I think it will be more of a positive than a negative. But I would like to get it to read \"design-ee\" rather than \"design-why\" as much as possible.\n\nNo. 3 was my favorite also, despite my wanting a backwards \"y.\" Here is my next round based on that.\n\n[logo3.gif](http://web.archive.org/web/20140307105008/http:/designy.com/logo/logo3.gif)\n\nedit: got a little eager and added this.\n\n[logo3f.gif](http://web.archive.org/web/20140307105008/http:/designy.com/logo/logo3f.gif)\n\n"
    },
    {
      "time": "10 Aug 2005 — 2:09pm",
      "content": "I think 3a has a slightly better chance of being read correctly, but 3c is quite a bit more interesting. But for both of them, a taller \"d\". And I might also try dumping the dot of the \"i\".\n\nhhp\n\n"
    },
    {
      "time": "10 Aug 2005 — 2:35pm",
      "content": "Please chime in, but I read the new ones as design ny as Design New York. Jeffery where are you located will this be a problem?\n\n"
    },
    {
      "time": "10 Aug 2005 — 2:42pm",
      "content": "I think you might need to think of other concepts like: DesignER (emergency room, or emergency repair) or web catching design, implying designs that forfill website commerence goals. Just a couple of thoughts\n\n"
    },
    {
      "time": "10 Aug 2005 — 3:24pm",
      "content": "I agree that 3a is the most promising direction. The direction represented by 3c and 3d is certainly more graphical, but it gets lost between the typographical and the graphical. By that I mean: it's not far enough one way or the other, and ends up coming across as 'clever'.\n\nAs such, it takes me out of the mental state of percieving the brand the logo represents, and makes me think of how clever the designer is, what he might be reaching for, and whether or not he succeeded.\n\nSo: I vote for a less obtrusive direction, probably typographic, and let the notion of the word 'designy' speak your message, without any graphical wizardry to reinforce that message (notice I could have used the word 'sans' there, but resisted and used 'without' instead).\n\nTaking that train of thought to your 3f series, while I like the fact that the 'e' takes your eye to the dot in the 'i', I think the treatment is largely unnecessary, and even slightly destructive to the delivery of the brand.\n\n"
    },
    {
      "time": "10 Aug 2005 — 5:04pm",
      "content": "\\>I vote for a less obtrusive direction, probably typographic, and let the notion of the word ‘designy’ speak your message, without any graphical wizardry to reinforce that message\n\nI agree. I think I've gone a little too far. Hmm. now I'm back to Helvetica neue. It's simple, I actually love Helvetica Neue—it has a pretty 'y' and I think that keeping everything one color helps.\n\n[logo4.gif](http://web.archive.org/web/20140307105008/http:/designy.com/logo/logo4.gif)\n\n"
    },
    {
      "time": "10 Aug 2005 — 5:35pm",
      "content": "Too dark (a problem especially at small sizes and onscreen).  \nToo much separation between \"design\" and \"y\".  \nToo Helvetica.\n\nhhp\n\n"
    },
    {
      "time": "10 Aug 2005 — 7:35pm",
      "content": "Not 'designy' enough for me...\n\nHelvetica has to be used in a pretty careful & deliberate manner to work well. That was too easy. The y links up while it is in reverse for the first time though...\n\nMaybe a bold version of another face will help. You will to modify the face ( or something) to make the thing yours though.\n\n"
    },
    {
      "time": "10 Aug 2005 — 7:53pm",
      "content": "Is there a good font that has a similar look to Helvetica, in particular the \"y\"? I don't really know why Helvetica is a problem. I'm guessing it is overused? Here it is in Futura again, same basic idea. A little lighter color. I'm not sure what the final color will be yet, but it probably will not be grey with a white background.\n\n[logo5.gif](http://web.archive.org/web/20140307105008/http:/www.designy.com/logo/logo5.gif)\n\nI like the bottom 2 the best. But I also liked the Helvetica version. ;)\n\n"
    },
    {
      "time": "10 Aug 2005 — 8:21pm",
      "content": "Of those, I would go with 5g.  \nBut I think 3a and 3c were better.\n\nHelvetica's problem here (it has others elsewhere)  \nis indeed that it's too common. It's not designy.\n\nhhp\n\n"
    },
    {
      "time": "10 Aug 2005 — 8:22pm",
      "content": "One other thing: with the two descenders facing away from each other like that, the pattern is too strong I think, too distracting. When they were facing the same direction it worked, but now I might actually suggest making them different (again).\n\nhhp\n\n"
    },
    {
      "time": "10 Aug 2005 — 9:18pm",
      "content": "Thank you for all the input, hrant. I will try the lighter version of Futura again with this idea tomorrow. I alternated the descenders in this version.\n\n[logo6.gif](http://web.archive.org/web/20140307105008/http:/www.designy.com/logo/logo6.gif)\n\nedit: I am sleepy. I meant to do this to 5g but did it to the wrong ones.\n\n"
    },
    {
      "time": "10 Aug 2005 — 10:32pm",
      "content": "Wow. When you first suggested dropping the dot over the 'i', Hrant, I resisted. That is, I didn't think it would work, because that dot not only balances the ascender value of the logo with the descender (left to right, that is), but it gave the logo a playful quality that I liked.\n\nBut now that I see it without the dot, I must admit, the word flows quicker through my mind than before. In fact, I don't even realize it isn't there at first.\n\nYou guys have amazing eyes for detail.\n\nGood show.\n\n"
    },
    {
      "time": "11 Aug 2005 — 6:25am",
      "content": "<cite>Helvetica’s problem here (it has others elsewhere)<br>\nis indeed that it’s too common. It’s not designy.</cite>\n\nI think the fact that it is common and isn't designy are its virtues in this case, the adventures with Futura look as though have too much effort put into them, whereas Helvetica, due in part to its ubiquity, can claim that clean and simple tag. I would like to see you try the same style with the roman weight, to increase the common feel (or Arial, if I tag this on here maybe no-one will notice).  \nThe context of the logo should also be addressed, what else is going to appear on the screen, how much air you give it, scale etc. will be critical.  \nTim\n\n"
    },
    {
      "time": "11 Aug 2005 — 8:06am",
      "content": "I admit I am a fan of Helvetica. But I don't want to appear _too_ common or simple either! I also had another idea last night, which may be cartoony. But while I want to go for \"clean and simple\" I don't want to go for dull, so cartoony might be a good thing.\n\nI also thought the dot on the \"i\" would look better, but I agree after removing it that it looks better without.\n\nHere are the latest.\n\n[logo7-12.gif](http://web.archive.org/web/20140307105008/http:/designy.com/logo/logo7-12.gif)\n\n"
    },
    {
      "time": "11 Aug 2005 — 8:30am",
      "content": "\\> try the same style with the roman weight\n\nIf you want an ironic effect, I think this is right. The difficulty in pulling of an ironic design can be higher... The question is what effect are you gunning for? I don't want suggest that one effect or the other is right. Whatever effect is desired it should be a delibertate and historically aware decision.\n\n\\> The context of the logo should also be addressed\n\nYes. Totally!\n\nJeffery, there is alot of carry-over mid century modernism in graphic design for the architecture/retail trade. Lighting, pens, furniture. It's a kind of 'safe' othodoxy. It's seems like one of the things that emigre magazine was in opposition to. It's a kind of retro style. It also remains very popular. This isn't bad ( or good ) per se - it's just that there is a history & you should probably be aware of it. Do you know what I am talking about? If so, is this history something you want to tap? Or is you intended direction different? You might have something quite different in mind.\n\nhere are some urls that trade in the sensibility I am refering to  \n [http://www.cassina.com/index\\_ok.html](http://web.archive.org/web/20140307105008/http:/www.cassina.com/index_ok.html \"http://www.cassina.com/index\\_ok.html\")  \n [http://www.petermiller.com/](http://web.archive.org/web/20140307105008/http:/www.petermiller.com/ \"http://www.petermiller.com/\")\n\nGiven that you are a web developer the direction I have described makes sense to me in that you can be seen as an un-fussy & reliable source of services. But to be seen as more than 'simple' the design will have to be sophiticated. The power of the identity will come from the context or way that that your mark is used in as much as or ideally more than the logo itself.\n\nI think that's why Tim is quite rightly bringing up context.\n\nOne thing I am not completely clear on is, is yours a technical service in the main, or primarily a design service? I thought I knew & then I re-read the posts & I realized that i was making an assumption that you were mainly offering design. Now I think I may have mis-understood. If I have - that would be part of the context too.\n\n"
    },
    {
      "time": "11 Aug 2005 — 8:32am",
      "content": "If you must use a grot, use Unica.\n\nOf those, 8.\n\nhhp\n\n"
    },
    {
      "time": "11 Aug 2005 — 10:39am",
      "content": "Jeffery, these are looking good. You've got a great concept and you're getting some great results. I would agree with what some others have said, that Helvetica is not the best choice here. To me, it comes across as too industrial and sterile--not very designy.I think my favorite so far is 5g, but in lighter style like 11. As a side note, do you have any of your previous web design work you could post on your site? I love seeing other designer's work.\n\nTo everyone else: your input is great, keep it coming. I know from [past](http://web.archive.org/web/20140307105008/http:/typophile.com/node/10008 \"Critique of law firm logo\") [experience](http://web.archive.org/web/20140307105008/http:/typophile.com/node/12743 \"Critique of design logo\") how much help it is to have your input on a logo design and I'm sure Jeffery is feeling the same way. Just reading through this thread, I've already learned a lot.\n\n"
    },
    {
      "time": "11 Aug 2005 — 12:20pm",
      "content": "Hold up.\n\n3b, with the futura has great promise.\n\nIMO here is why:\n\n1.)\"Designy\" is a term used for over-design, over-decoration..\n\n2.) Using Futura and having the n & y connect; is so simple,  \nit's anything but designy -- nice oxymoron (proper usage?)--smart.\n\n"
    },
    {
      "time": "11 Aug 2005 — 12:24pm",
      "content": "Logo 10 is also good.\n\nLight, simple, and the flip of the y makes a great contradiction  \nto the name \"designy\".\n\nThe beauty of 10, is that the flipped character, as a focal point,  \nis even more simple than 3b, though it's not as elegant.\n\nIMO.\n\n"
    },
    {
      "time": "11 Aug 2005 — 12:53pm",
      "content": "Thanks to all for sticking with me on my quest for a good logo!\n\nOne thing I think I may not have made clear is the concept of clean and simple. I think that was too short a description, so I will try to explain my idea more clearly. It's not that I want to do simple design like Jakob Nielson's [useit.com](http://web.archive.org/web/20140307105008/http:/useit.com/). While it is simple and clean, I also find it visually horrid. I find typophile.com to be simple and clean while also being visually pleasing and to me it is what \"designy\" _should_ mean! So I think that my real goal might be to change the meaning, at least for some.\n\nThat said, type is one area where I am no master. But I am certainly willing to be persistent in my pursuit of a visually appealing mark. :)\n\nToday, I tried yet a different font and a more designy approach. I liked the fact that it had a different \"g\" than helvetica while it had a similar \"y\". It's another common font, Franklin Gothic. I did alter the \"d\" and \"y\" a little though.\n\n[logo13.gif](http://web.archive.org/web/20140307105008/http:/designy.com/logo/logo13.gif)\n\n"
    },
    {
      "time": "11 Aug 2005 — 2:27pm",
      "content": "Since you flopped the y the chopped off d looks like a flopped h. Plus you made the d bigger so it weight is heavier than the other characters. Keep going, I like the Franklin Gothic g better its more interesting.\n\n"
    },
    {
      "time": "11 Aug 2005 — 7:47pm",
      "content": "Here it is with a normal \"d\", I just extended it's ascender to be about as tall as the Futura version. Not sure why, but I like it a little taller.\n\n[logo14.gif](http://web.archive.org/web/20140307105008/http:/designy.com/logo/logo14.gif)\n\n"
    },
    {
      "time": "11 Aug 2005 — 9:24pm",
      "content": "What if you started puuling the bits around to meet each other like Hrant was talking about? I see some other connections you could make. It could even be a woven shape around the word. That would suggest planning / architecture / design all in one. Then you would not need a reversed 'y'. Just thinkin'...\n\n"
    },
    {
      "time": "11 Aug 2005 — 10:06pm",
      "content": "\\>As a side note, do you have any of your previous web design work you could post on your site?\n\nI could put up some links to a few sites if that is okay here.\n\nI haven't got many that I have done myself, I've been going thru 3rd parties for the last few years, and most won't let me claim anything as mine. Which is why I am wanting to get my own site up and ween myself off the third party work that requires that. ;)\n\nI also do some \"experimental\" and humor stuff just for fun.\n\n"
    },
    {
      "time": "11 Aug 2005 — 10:17pm",
      "content": "\\>Then you would not need a reversed ‘y’.\n\nBut I like the reversed \"y\"! Is it not getting any more readable? I have played around with coming up with a graphic icon, an astronaut with a capitol \"D\" for a helment, but it turned out looking more like a mascot and probably no one would notice the helment was a \"D\". Any idea how I could use an astronaut succesfully here? My idea was the astronaut sort of leaning in from the left of the logo, with a word bubble coming from him and the logo in that bubble.\n\n"
    },
    {
      "time": "12 Aug 2005 — 12:34am",
      "content": "What if you riffed off of the Applomission sewn patches? The it would be less litteral but you could cop the style. That would be cool. The Orb did that with their album U.F.ORB...\n\n"
    },
    {
      "time": "12 Aug 2005 — 12:37am",
      "content": "These\n\n[http://gerathsdesign.com/penplaque001.JPG](http://web.archive.org/web/20140307105008/http:/gerathsdesign.com/penplaque001.JPG \"http://gerathsdesign.com/penplaque001.JPG\")\n\n&\n\n[http://www.electroshot.com/orb/ufoffback.jpg](http://web.archive.org/web/20140307105008/http:/www.electroshot.com/orb/ufoffback.jpg \"http://www.electroshot.com/orb/ufoffback.jpg\")\n\n"
    }
  ]
}
