{
  "id": "14497",
  "title": "Trajans Column",
  "forum": "Home",
  "tags": [

  ],
  "content": "**[Indices](http://web.archive.org/web/20150110232805/http:/typophile.com/wiki/Indices) : [History](http://web.archive.org/web/20150110232805/http:/typophile.com/wiki/History) : Trajan's Column**\n\nMarcus Ulpius Traianus was born in 53 AD, and died in 117 AD. He was Roman Emperor from 98–117, during which point the Empire would reach it's greatest extent. During his reign, the Senate and People of Rome as errected a memorial to his wars, which slightly extended the Empire's frontiers even further into \"barbarian\" territory than they had already been.\n\nThis memorial is called \"Trajan's Column\" today. Although the object is mostly sculptures in nature (it is a tall column, which has a frieze of relief scultures spiraling up its shaft), a small inscription above the doorway on its base has driven type-minded people mad for centuries.\n\nContrary to the belif of some, this inscription is neither the debut of the [Roman Alphabet](http://web.archive.org/web/20150110232805/http:/typophile.com/wiki/Roman%20Alphabet), nor the first time that it had used [serifs](http://web.archive.org/web/20150110232805/http:/typophile.com/wiki/serifs). It is, however, probably the most famous example of both.\n\nWhile Roman handwriting was very different from Roman monumental lettering (whether hand painted, engraved, cut out of metal, or cut into stone), the letters on Trajan's Column represent one of the best examples left to us from antiquity. Trajan's Column, and samples like it, would go on to influence the development of the Roman alphabet, and later typeface design, for the next 2,000 years.\n\nWhat was so special about the Roman's inscriptional lettering? The Romans—who did not invent the idea of the alphabet—where the first to put serifs on their letters. It is speculated that the [serif](http://web.archive.org/web/20150110232805/http:/typophile.com/wiki/serif)'s origin was a result of applying a brush to the stone before it was carved. Others speculate the serifs were purely an aesthetic addition, put there by the stone carver(s).\n\nThere have been several typefaces that are direct \"revivals\" of the lettering on Trajan's Column. The most direct and most popular—and the only one to simply bear the name [Trajan](http://web.archive.org/web/20150110232805/http:/typophile.com/wiki/Trajan)—is [Carol Twombly](http://web.archive.org/web/20150110232805/http:/typophile.com/wiki/Carol%20Twombly) cut for Adobe.\n\n",
  "author": "dan_reynolds",
  "time": "10 Aug 2005 — 12:02am",
  "uid": "1085",
  "comments": [

  ]
}
