{
  "id": "14503",
  "title": "Elegantia",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Kia ora folks. I scanned a speciman of what I believe is Polyphilus. I got it from \"the Typographic Book\" by Stanley Morrison if I remeber correctly. It struck me as having a very nice feel to it, a combination of irregularity and odd character shapes. I know this is a third generation image, but that doesn't worry me. The image I saw in the book was really beautiful. To help understand why it felt so nice as a typeface, I did a quick digitisation by eye (called polyfiller in the pdf) and some print-outs to get the feel. I then drafted a new version (called elegantia, after a pretty word in the speciman copy) based on my observations.\n\nIn elegantia there is a heavy baseline emphasis. The upper serifs have been blunted / triangulated. I also noticed a subtle right-hand lilt to the original, and have incorporated this subtlety into the serif and stroke treatment. It is only an unhinted draft at this stage. What does it do to your eyeballs?\n\nKris.\n\n| Attachment | Size |\n| --- | --- |\n| [Elegantia 1.3.pdf](http://web.archive.org/web/20130818194127/http:/typophile.com/files/Elegantia%201.3.pdf) | 113.85 KB |\n\n",
  "author": "kris",
  "time": "10 Aug 2005 — 5:31am",
  "uid": "1519",
  "comments": [
    {
      "time": "10 Aug 2005 — 5:36am",
      "content": "If the attachment doesn't work, try this link:\n\n[http://www.klim.co.nz/downloads/Elegantia\\_1.3.pdf](http://web.archive.org/web/20130818194127/http:/www.klim.co.nz/downloads/Elegantia_1.3.pdf \"http://www.klim.co.nz/downloads/Elegantia\\_1.3.pdf\")\n\n"
    },
    {
      "time": "11 Aug 2005 — 10:33pm",
      "content": "Kris, your original specimen is Monotype Poliphilus, not the original Griffo's font used in Hypnerotomachia Poliphili, 1499. Monotype Poliphilus is an experimental replica cut in 1923 under direction of F.H. Pierpont, later digitized and currently sold as Poliphilus MT.  \nI think your idea of reinterpreting ink squash (two layers of it!) as intentional features might bring some interesting results. The first verion of Elegantia is encouraging, but I see a conflict between chiseled features of u, z, and unexpectedly slick e and g. Also, your o has an unusual axis not supported by other letters.\n\n"
    },
    {
      "time": "12 Aug 2005 — 6:38am",
      "content": "As Sergei says, this has been digitized by Monotype, who I'm sure have the rights. It was also something of a failed experiment of getting the look of 16th century ink spread into a 20th Century type. The simulated antique look I think has limited appeal.\n\nThe smooth redrawing of Poliphilus as Bembo was wonderful and deservedly successful in metal. The digitization of Bembo was not successful, and Bembo Book has recently been drawn to try to achieve that. But my impression is that it hasn't captured the magic of the metal. Aetna is a version of the original Griffo type that some people have spoken highly of.\n\nI think that as it stands your digital version, like the Monotype original and digital versions, is uneasily positioned between being a faithful reproduction of an antique--like Founders Caslon--and a modern redrawing, such as Adobe Garamond.\n\n"
    },
    {
      "time": "12 Aug 2005 — 8:11pm",
      "content": "I was sure that the image is from a reproduction of the Hypnerotomachia Poliphil, but stand corrected! I am aware of the roots of Polyphilus and Bembo (doesn't Bembo look absolutely fabulous in Edward Tufute's books!). I haven't seen Jack's version of Aetna in print, but heard a lot about it. It is a little uneasy, I agree. It is almost an informal experimant more than anything. I have no real interest in creating a faithful reproduction, I find most simulations a tad contrived. It is the feel and quirkiness that I want! Ahh, contradictions.\n\nThanks for your feedback chaps, it is appreciated.\n\n"
    },
    {
      "time": "12 Aug 2005 — 9:05pm",
      "content": "I think it has a \"charming\" feeling but it has loose spacing. Compare it to the scanned example.\n\nHéctor\n\n"
    }
  ]
}
