{
  "id": "14501",
  "title": "Looking for type similar to Neil Young's \"Harvest\" album",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Does anyone know who created the type used on Neil Youngs classic 'Harvest' album?  \nIs it based on an existing font and where can I get some typefaces like this?\n\nAlso, are there any dingbat fonts that have those magical swirly embelishments?\n\nCheers,\n\nDom\n\n| Attachment | Size |\n| --- | --- |\n| [harvest.jpg](http://web.archive.org/web/20141104203707/http:/typophile.com/files/harvest.jpg) | 22.53 KB |\n\n",
  "author": "Dominic Forde",
  "time": "10 Aug 2005 — 1:42am",
  "uid": "8711",
  "comments": [
    {
      "time": "10 Aug 2005 — 2:00am",
      "content": "Have you checked out [Letterhead fonts](http://web.archive.org/web/20141104203707/http:/www.letterheadfonts.com/) for something similiar?\n\n"
    },
    {
      "time": "10 Aug 2005 — 6:29am",
      "content": "\\>_magical swirly embelishments_\n\nThankfully, the most magical of swirly embelishments are still created in the context of the total design, not individual characters.\n\n"
    },
    {
      "time": "10 Aug 2005 — 7:29am",
      "content": "I discovered the inspiration for this piece of lettering years ago in one of those \"old engraving\" swipe books:\n\n[http://www.marksimonson.com/menu-cut.gif](http://web.archive.org/web/20141104203707/http:/www.marksimonson.com/menu-cut.gif \"http://www.marksimonson.com/menu-cut.gif\")\n\nIt's a standard cut (sort of like clip art) produced by the MacKellar, Smiths & Jordan Foundry of Philadelphia in the 1800s.\n\nI've also got a copy of the original Harvest LP. The designer is listed (Tom Wilkes) but no specific credit for the lettering. Could be the designer did it. It's skillfully done, whoever did it. It's very faithful to the design of the MacKellar cut.\n\n"
    },
    {
      "time": "10 Aug 2005 — 4:13pm",
      "content": "Thanks guys,\n\nI checked out Tom Wilkes's work and he's done loads of great album covers!  \n [http://wilkesworks.com/gallery.html](http://web.archive.org/web/20141104203707/http:/wilkesworks.com/gallery.html \"http://wilkesworks.com/gallery.html\")\n\nThat old engraving type is the one he's been looking at alright Mark.\n\nCheers.\n\n"
    },
    {
      "time": "10 Aug 2005 — 5:00pm",
      "content": "This is why I love Typophile! Yay!\n\n"
    },
    {
      "time": "6 Jul 2011 — 1:11pm",
      "content": "I had some fun replicating this look recently for a band... I used Birch Std as the basis for the lettering. It's not quite there, but it did the trick.\n\n ![](http://web.archive.org/web/20141104203707im_/http:/typophile.com/files/sheepdog-sm_5611.jpg)\n\n"
    },
    {
      "time": "21 Jul 2011 — 7:40pm",
      "content": "Ben, that is really lovely.\n\n"
    },
    {
      "time": "22 Jul 2011 — 10:17am",
      "content": "Never saw the original thread, but love this - old and new.\n\nBen - I visited your website and thoroughly appreciate your work. As to Sheepdogs, the bulimic-waisted 'S' - especially being the leading letter - grates a bit, but, overall, it's splendid.\n\nThanks to all. Especially, again, Mark - for the historical reference.\n\n"
    },
    {
      "time": "22 Jul 2011 — 2:43pm",
      "content": "The \"Harvest\" lettering has a similar mistake (or maybe it's intentional) with the thin vertical stroke on the \"H\". The original \"Menu\" cut, on the other hand, follows the rules for letter construction. I definitely think \"Sheepdogs\" would look better with proper stroke weights on the \"S\". 'Course, that probably means losing the dots in the middle (which could be why it was done wrong on the \"Harvest\" lettering).\n\n"
    },
    {
      "time": "23 Jul 2011 — 4:22am",
      "content": "You could have holes in place of the dots in a wider stroke.\n\n"
    }
  ]
}
