{
  "id": "14516",
  "title": "identity for modern art gallery",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "My goals for the design are modern, european, clean. This is for a gallery space I will be opening next month but I can’t seem to find exactly the right typeface, and I don’t have the skills to create my own.\n\nIn the current design I like the forms of the “e” and “o” although the dots above the “o” were put in by me and I don’t like the size or position yet. I was hoping someone would know of a font that was very close to this but a more uniform ear on the “r” and a flat terminal on the “t”.\n\nI hope I said all of that correctly without sounding like a complete neophyte.\n\nAny help would be GREATLY appreciated since I’m on a very rushed deadline now that I am able to move in a month early than I was previously able to.\n\n| Attachment | Size |\n| --- | --- |\n| [logo-design-totre.jpg](http://web.archive.org/web/20060522104441/http:/typophile.com/files/logo-design-totre.jpg) | 9.22 KB |\n\n",
  "author": "<a href=\"user/5469\" title=\"View user profile.\">cocorobot</a>",
  "time": "<br>",
  "uid": "5469",
  "comments": [
    {
      "time": " 10 August, 2005 - 1:44pm",
      "content": "Greetings. You are on the right track with the design you have so far. It appears very clean and modern…but I don’t know if the typeface alone reads as “European”. Do the dots above the “o” help in pronunciation, or are they simply there to create the feeling of a European name? Have you tried any fonts as common as “Helvetica” or “Helvetica Neue” bold? Both offer a “t” with a flat terminal. I was a little unclear on what you meant by a uniform ear on the “r”. Best of luck on your next stage in the creative process.\n\n-Ben\n\n"
    },
    {
      "time": " 10 August, 2005 - 2:47pm",
      "content": "What does the mark mean? If it isn’t directly related to the gallery drop it. Try Din or Dax for the European typeface look. I’m making an assumption you mean northern Europe not Spain/Italy etc.\n\n"
    },
    {
      "time": " 11 August, 2005 - 6:00am",
      "content": "The umlaut softens the pronunciation so Tötre should be read as Toetre, so if the pronunciation is different you might consider losing it. Helvetica is the nearest to your sample, you might also look at Futura for a more geometric look or [Jeremy Tankard’s](http://web.archive.org/wiki/Jeremy%20Tankard%E2%80%99s) [Aspect](http://web.archive.org/web/20060522104441/http:/www.typography.net/type/aspect.htm) as a modern example. I like the image (someone looking at a picture was my interpretation, but only after I read that this for a gallery). Also töt(re) could be roughly translated from German to English as kill(er) or tot(re) as dead(er) if that is something you need to consider.  \nTim\n\n"
    },
    {
      "time": " 11 August, 2005 - 6:25am",
      "content": "_Also töt(re) could be roughly translated from German to English as kill(er) or tot(re) as dead(er) if that is something you need to consider._\n\nI’m not so sure about that. “Tot” means dead in German (adjective). A “Töter” is a kiler, but “Tötre” doesn’t have any meaning, and neither does “totre.”\n\nEven if the gallery’s name were “killer,” I don’t think that would automatically be bad. It might even be cool, in a pomo way… But in any event, not a real concern because the word ends in “re” instead of “er.”\n\n"
    },
    {
      "time": " 11 August, 2005 - 6:55am",
      "content": "<cite>Roughly</cite> translated. I should have made it clearer, I was talking about pronunciation.  \nI don’t claim that it is important nor that it is detrimental to the name of the gallery.  \nTim\n\n"
    },
    {
      "time": " 12 August, 2005 - 1:02pm",
      "content": "Thanks for everyones comments.\n\nI’ve tried changes with the typefaces everyone had suggested, but there is something about “Akkurat” that I like so I think I’m going to use it. Although I tightened up the kerning a bit, and now it feels more like an identity to me. Any thoughts?\n\n[http://www.totre.com/totre-version-2.jpg](http://web.archive.org/web/20060522104441/http:/www.totre.com/totre-version-2.jpg)\n\nThe umlaut is necessary for the pronuciation, plus it adds a bit of a european feel I want. Kind of cheesy I know, but I’m building this brand from scratch and don’t have a huge marketing budget to throw at it yet.\n\nOriginally when I search for totre I came up with a meaning in sanskrit “whip in the right hand” which I thought was mildly amusing. However I really like the idea it being similar to “killer”, not sure how I can use that to my advantage yet but it will be fun trying.\n\nAs far as the mark goes I’m still working on that. Orginally it was supposed to be a commentary on ultra simplified modern art (ie one circle on a canvas) and at the same time creating a clean simple mark. I’m going to work on it some more today and tomorrow and see what I can come up with.\n\n"
    },
    {
      "time": " 12 August, 2005 - 1:26pm",
      "content": "The e need to be tighter not much but a bit.\n\n"
    },
    {
      "time": " 15 August, 2005 - 9:36pm",
      "content": "I tightened up the “e” a bit more and now I pose my pill problem.\n\nNumber 3 or number 4?\n\n[www.totre.com/totre-version-3.jpg](http://web.archive.org/web/20060522104441/http:/www.totre.com/totre-version-3.jpg)\n\n[www.totre.com/totre-version-4.jpg](http://web.archive.org/web/20060522104441/http:/www.totre.com/totre-version-4.jpg)\n\n"
    },
    {
      "time": " 16 August, 2005 - 9:49am",
      "content": "I don’t understand.\n\nIt isn’t always appropriate to include such a 1 to 1 relationship  \nbetween the logo subject matter and the company/organization it  \nrepresents.\n\nI’m not sure how you could make this mark “European” nor if visually  \nit has to be.\n\nAs for it being modern and for an art gallery, the trademark  \nyou have created, while simple, fails to be memorable and/or unique.\n\nAnd I think that is because conceptually it isn’t as refined.\n\nWhat does a pill have to do with a gallery?\n\nI’m not trying to be a smartass, however the point of having a logo  \nmark is to have it surplant a written name. Nike is Nike without  \nsaying its name, just the swoosh. At the very least have this ability.\n\nAt this stage, I highly recommend concentrating on defining the  \nvisual mark before going on to the type.\n\nOr\n\nYou don’t need a visual mark and should just focus on the type as  \nthe mark.\n\n"
    },
    {
      "time": " 17 August, 2005 - 6:27am",
      "content": "I don’t get the point of the pill. Before you introduced it, you were on your way to a nicely abstract logo. The pill makes it so much more figurative that a) you lose the European feel and b) you risk stirring associations you might not want.\n\nIf by European you mean highly simplified and sober, I’d go back to the first image. Using the pill makes me think much more of American than European logo’s.\n\nSomething else: have you tried scaling the image slight up? I think the subtly round edges should aline with the round tops of the o and e. Optically round forms need to extend slightly over the top and bottom of the x-height to create the illusion of eveness.\n\nIt is promising, though — keep at it!\n\n——————————————————————————  \nMy work is a game. A very serious game [M.C. Escher]\n\n"
    },
    {
      "time": " 17 August, 2005 - 7:44am",
      "content": "I don’t get the pill either.\n\nI second the idea of playing with the scale. Try making the mark (the dot one) much larger and see what happens.\n\n"
    },
    {
      "time": " 17 August, 2005 - 1:32pm",
      "content": "One reason Nike swoosh works is because of the Millions of Dollars put into pushing it as their Corporate Idenity. Same goes for Rebok or any other major retailer worldwide. A mark for an art gallery might work but it will have to work over time. The gallery will never have the marketing or buying power to make it well known, but if it is adapted over time it could become a symbol for the gallery. The question is it memorable and appropriate. The pill might be constrewed for a drug company or pharmacy.\n\n"
    },
    {
      "time": " 18 August, 2005 - 6:48am",
      "content": "Agreed, Dan.\n\nI am not convinced the current prototype is  \nmemorable, appropriate, or unique enough.\n\ncocorobot,\n\nI hope these suggestions are helpful.\n\n"
    },
    {
      "time": " 18 August, 2005 - 1:29pm",
      "content": "I’d really like to thank everyone for their comments so far, its good getting feedback like this. I think I should explain a little bit more about how this “gallery” is going to operate.\n\nOur gallery will be selling original art, but our major focus will be generating a diverse collection of prints we want to sell from a large variety of artists. Try to make art & design that we like more widely available to those who can’t really spend $4000 on a painting, and artists who can’t afford to purchase 100 prints of their work up front.\n\nOur branding and marketing efforts will run along the same lines as:\n\n[Threadless](http://web.archive.org/web/20060522104441/http:/www.threadless.com/)  \n [Defunker](http://web.archive.org/web/20060522104441/http:/www.defunker.com/)  \n [Urban Outfitters](http://web.archive.org/web/20060522104441/http:/www.urbn.com/)  \n [Diesel](http://web.archive.org/web/20060522104441/http:/www.diesel.com/)\n\nThe big difference is that we’ll be selling art and not clothing.\n\nAny further comments?\n\n"
    },
    {
      "time": " 18 August, 2005 - 2:01pm",
      "content": "It still doesn’t explain the mark. The mark does look like a pharamacy and not a Kmart Gallery. I would loose the mark and keep the name as is.\n\n"
    },
    {
      "time": " 18 August, 2005 - 2:17pm",
      "content": "will it be like deviant art?\n\n"
    },
    {
      "time": " 18 August, 2005 - 2:23pm",
      "content": "Damien Hirst did have that restaurant in London called _Pharmacy_. But [apparently](http://web.archive.org/web/20060522104441/http:/news.bbc.co.uk/1/hi/entertainment/arts/3755120.stm) even that concept was too high-brow for the masses.\n\nOn the one hand, art can be medicinal. I guess I see that tie-in. However, I think you are using the sledgehammer when all you really need is a tack hammer. Subtlety will be key is you press forward with this concept.\n\nEdit: That is a very old article. I was simply trying to make a point.\n\n"
    },
    {
      "time": " 18 August, 2005 - 4:42pm",
      "content": "The business model isn’t like deviant art where an artist can create and upload anything they want to sell. This is run more like an art gallery, where different pieces are selected by us, and offered for sale on the site and in the physical gallery space. However we will be able to create prints of different work we offer in house, making it cheaper for us and the artists we will represent.\n\nI guess I’m really not sure how to explain the brand I am trying to create. If someone sees a pill and a name I guess their first impression will be a drug company. Just like if I created an image of an easel before the text you would think art gallery, maybe. Although seeing the design in an advertisement, business card or in our gallery space (which is in a building with 20 other galleries) people would read more into the choice of using the pill.\n\nThe whole “European” thing was more about the typeface than the symbol. So I guess that’s really not that intregal part of the over all design.\n\nI think what I’m going to do is do a little market research with some fellow design students and get their impressions before going further with this to see how much confusion there is.\n\nThanks again for everyones advice.\n\n"
    },
    {
      "time": " 18 August, 2005 - 4:52pm",
      "content": "I went to Pharmacy (found it while just walking around) a few years ago. And although I tend to hate clinical stuff, it was a cool, memorable experience.\n\nhhp\n\n"
    },
    {
      "time": " 22 August, 2005 - 2:53pm",
      "content": "“I guess I’m really not sure how to explain the brand I am trying to create.”\n\nFirst, deal with that; then with the logo (with/without the symbol)\n\n“The whole “European” thing was more about the typeface…”\n\nNever heard about European typeface.\n\nBTW, what kind of art? digital? oil? pencil? watercolor?\n\n"
    }
  ]
}
