{
  "id": "14525",
  "title": "Exercise: Upside down & backwards",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "Thanks for visiting the Typographic Edumacators topic area.\n\nFollowing through on simple exercises that might be useful in teaching typography to graphic design students:\n\nI've been thinking about some of the routine activities some of us old typographers did that helped sharpen our \"typographic eye.\"  \nSetting lines of metal type and then putting each character back into the typecase.\n\nSounds like the most mundane of activities, but we set lines of copy that was visually upside down and backwards.  \nIn other words, mind your 'p' and 'q' and 'b' and 'd'. Eventually reading metal type became easier. At one point I could amaze friends by reading pages aloud quickly from a book held upside down... I have a hard time doing that nowadys.\n\nMaybe there was something useful in training the mind to quickly differentiate characters regardless of orientation.\n\nI think I know enough about Flash that I could put together a rough prototype.  \nHere is a rough sketch of [**Upside Down & Backwards**](http://web.archive.org/web/20150417142836/http:/www.acmedigital.net/Aimages/upside.gif).\n\nThe basic premise is that a word or phrase (typewritter styled letters) would show up in the white window below the \"metal\" characters.- All the student has to do is \"set\" the words by clicking the mouse on each successive character until they complete the line.\n- There is no time limit during training, but the game starts with a timer ticking away. Hey... it's a production shop!\n- Difficulty variables could be changing the typeface or reducing the point size.\n\nMaybe, even if the excercise had no real value in improving design skills, it might be fun from an historic point of view.\n\n",
  "author": "Norbert Florendo",
  "time": "10 Aug 2005 — 1:50pm",
  "uid": "7764",
  "comments": [
    {
      "time": "10 Aug 2005 — 7:27pm",
      "content": "It sounds like the sort of thing that could be done as a flash or shockwave file. Maybe there is a student out there with the flash skills... I might need some more convincing to really want to spend time at it though.\n\n"
    },
    {
      "time": "11 Aug 2005 — 11:55am",
      "content": "I know, Eben.\n\nAfter posting the concept, I wasn't convinced that I would even do it myself. Somehow it just isn't fun enough if you can't shoot or blow something up.\n\nWhat I really look forward to is the real time collaborative critique program that may be developed for Typophile. That in itself has great educational potential.\n\n"
    },
    {
      "time": "11 Aug 2005 — 12:24pm",
      "content": "I do imagine that is something there. You know - bet that if you had inexpensive 'metal' type ( could be anything - wood, platic metal etc ) for sale in design bookstores to play with, and especially if it could be held in a line & inked and then pressed into paper - you might have a typophile stocking stuffer...\n\nYou could offer them in classic faces and maybe one recent one. So people would want to collect them. Then they would be playing your game, having fun & making you a profit. Win-win & all that sort of thing.\n\n"
    },
    {
      "time": "11 Aug 2005 — 12:56pm",
      "content": "I'm already focused on a little for profit project having to do with something similar... fun eighteenth and nineteenth century illustrations and letterforms to be made into gifts.\n\nBut I'll never get around to finishing them since Typophile is taking up way too much of my extra time. But it's fun.\n\n"
    },
    {
      "time": "11 Aug 2005 — 1:42pm",
      "content": "Cool.\n\n"
    },
    {
      "time": "25 Aug 2005 — 8:44pm",
      "content": "I will take up the challenge and make this in Flash or perhaps director. I have many years experience developing in flash, but am learning director and this would be the perfect opportunity to really get me going. The basic engine should be pretty straight forward to implement. All I need is a few weeks to slot it in when I can. I'm actually working on something for school using director for type, but more about that later. I will probably post some prototypes here.  \nYay!!!\n\n"
    },
    {
      "time": "25 Aug 2005 — 8:49pm",
      "content": "OOOO I'm all fired up about this now! It would be nice to be able to print out a page that has been set too. I will have to investigate the possibilities, but this should be fairly easy to do as well.  \nCool\n\n"
    },
    {
      "time": "26 Aug 2005 — 12:04am",
      "content": "Go Bruce!\n\nWill ink stains be involved?\n\nWhat about accidental lead or antimony poisoning? You should have a feature that tells students to wash their hands after moving the type around!\n\n"
    },
    {
      "time": "26 Aug 2005 — 5:59am",
      "content": "Go for it, Bruce!\n\nGlad to know that this topic wasn't lost in the \"Dead Thread\" department.\n\nDon't be shy to share any early versions. I would be glad to help in any way I can. I can also do Flash, Director and Shockwave, but I'm rusty (no comments from the Peanut Gallery, please) and did not want to tackle it alone.\n\nIt's got to be fun, easy and intuitive if we're going to catch the attention of students... SO HAVE FUN!\n\n"
    },
    {
      "time": "26 Aug 2005 — 6:20am",
      "content": "Just had another thought.\n\nWhat if we used actual photo images of metal type. That would help cut down drawing time, plus it would visually simulate the experience of composing a line of hot type.\n\nIf you build a basic engine, it would be possible to add an optional feature to \"select font.\" Imagine the degrees of difficulty between setting lines of old hot metal Franklin Gothic, Garamond Italic, Brush Script and even Engravers' Old English (M.F. Benton).\n\nThis is really major!\n\n"
    },
    {
      "time": "26 Aug 2005 — 8:35am",
      "content": "I would want the photos images - more gritty realism... Outlines would of course be way faster...\n\n"
    },
    {
      "time": "26 Aug 2005 — 8:39am",
      "content": "Faster three ways\n\n- to produce  \n- in screen rendering  \n- in movement smoothness with slow processors\n\nI suggest you do it that way to begin with for the proof of concept. Actually, I wonder if you could tap into local fonts & then have acess to whatever was installed on the machine...\n\n"
    },
    {
      "time": "26 Aug 2005 — 9:21am",
      "content": "Having access to lots of different fonts maight be cooler than the relative realism of the photos... I don't know.\n\n"
    },
    {
      "time": "26 Aug 2005 — 10:06am",
      "content": "True, Eben,I think a ran a little too quickly with concepts (it's fun though).\n\nLet's go back to the original intent of this topic. The ultimate goal of the project is to help stimulate interest in typography and type design, and to help develop initial skills and sensitivity in those who are interested. The target group is students in general graphic design programs and novices who seek improvement.\n\nThe premise of \"Upside down & backwards\" is based on simple observations of routine activities done by typesetters/typographers, and the theory is that composing lines of metal type helped to sharpen character recognition. All theory and no evidence that it's a valid premise.\n\nSo, with that as the basis, developing a prototype is more important than visual embellishments at this time. I do agree that outlines would move it along faster.\n\nAs we are convinced that the whole idea is worth developing, then features such as changing \"fonts\" or even photographic images of type can be debated. I would just be happy to see a skeletal concept piece working.\n\n"
    },
    {
      "time": "26 Aug 2005 — 1:49pm",
      "content": "Agreed.\n\nJust to clarify - I was thinking that it \\*might\\* be just as easy to tap a local typeface compared to importing vector outlines as art for the purpose. Also Grabbing outlines might viaolate a EULA - would it? - but using a local installed font would not. If you are using an installed font then building font choice into the project would probably be easy. Then again if the program itself resides online then you would have to go with sprites ( bitmaps ) or vector data anyway... So maybe I have argued myself back the other way.\n\nI might be wrong about any of these points - but that was what I had been thinking about.\n\nThink Bruce is awake yet?\n\n"
    },
    {
      "time": "29 Aug 2005 — 5:47pm",
      "content": "Ah, yes I am awake. I'm not going to get a chance to play with this for a few weeks. Maybe we can start hammering a staged features list and sort all that out in the interim.\n\nModes: what various modes are there - production and learning  \nInterface: what features on the interface - what navigation/means of control  \nGraphics: roughly what size do the lettrers need to be?  \nLayout: what particular layout considerations are there - is the image provided indicitive?\n\nEtc\n\n"
    },
    {
      "time": "30 Aug 2005 — 8:07am",
      "content": "Great! Many of us are also busy at the moment too.  \nWe have no deadlines to do this, but it would be wonderful if we could all help to have a well thought out and working beta version before TypeCon 2006.\n\nBruce, Eben and I will keep the ball rolling at a reasonable pace. For now we can use this thread for sharing development ideas.\n\n---------------------------------------------------------------------------------------  \nYes, I'm old, but I'm upside down and backwards with joy!\n\n"
    },
    {
      "time": "30 Aug 2005 — 12:26pm",
      "content": "\\> Modes: what various modes are there - production and learning\n\nI guess I would start by just making it simple. I will describe a deluxe version & you should maybe toss out 50% or more of it to create a basic engine. Let me see if I can describe what I think should happen... You get a word: ( random, but the best would be a list which uses the most common words more! ) and you have a case of letters ( in reverse display ) to build the word with. The word should maybe be big-ish. The letter not small but smaller, and small because you need to show all 26X2 + maybe numbers & punctuation.\n\nSo maybe you start with lower case & then go to upper & lower & then numbers & then punctuation too.\n\n\\> Interface: what features on the interface - what navigation/means of control\n\nI think it should be mouse driven in terms of play. And you need ( timer? ) restart, score, high score ( world high score? ) , and quit buttons. The score & the rest of the info on otrher screens might be displayed backwards too. the game might say 'eybdoog' when you quit for instance... ( with letters reversed of course ).\n\n\\>Graphics: roughly what size do the lettrers need to be?\n\nI think the target word should perhaps be 7-9 characters max and could take up 1/5th of the screen & the letters & other interface UI would take up the rest. The letters etc will size themselves based on what is left I would guess...\n\n\\>Layout: what particular layout considerations are there - is the image provided indicitive?\n\nNot a question for me.\n\nTake all this with a grain of salt.\n\n"
    },
    {
      "time": "31 Aug 2005 — 1:01pm",
      "content": "In addition to the actual \"Upside Down & Backwards\" prototype, I feel that we should add a small intro section on the historic context of the exercise which is based on [hand composition](http://web.archive.org/web/20150417142836/http:/www.collectionscanada.ca/presses/t15-450-e.html#hand) of metal type.\n\nIt might give students some appreciation of what typesetters and typographers did for centuries before the advent of machine typesetting.\n\n"
    },
    {
      "time": "1 Sep 2005 — 5:16pm",
      "content": "Yes, this all sounds great guys. TypeCon 2006 sounds like a good \"deadline\", but a little to far to travel for me :(\n\n"
    },
    {
      "time": "1 Sep 2005 — 8:21pm",
      "content": "Bruce, TypeCon 2006 is just an arbitrary but reasonable deadline. Since it is essentially a Typophile members project we will make it available for review and comments within the Forum. At some point we should also discuss rights of intellectual property.\n\nMy general feeling is that all contributors get credited and that somehow the final piece (revisions and spin-offs) come under the auspices of the Typophile organization.\n\nThe original and ultimate intent is to provide educators and novice type lovers something to improve typographic knowlege and skills. Frankly, I'm certain that there will not be an X-Box version. Game Boy Advance... maybe.\n\n"
    },
    {
      "time": "2 Sep 2005 — 7:17am",
      "content": "That sounds fine to me. Really it's Bruce who will do the most heavy lifting.\n\n"
    },
    {
      "time": "4 Sep 2005 — 9:09pm",
      "content": "I would be happy with a \"creative commons\" type of open source arrangement or something like that, depending on what you think. As it's a learning exercise and I will be working on it here, it's really no skin off my nose. I'm not sure actually if creative commons is exactly what we need, but I will look into that too.  \nCan we find out more about the typofile organisation somehow? Might be worth getting this sorted first.\n\nHmmm, x-box port. Interesting...\n\n"
    },
    {
      "time": "7 Sep 2005 — 11:00pm",
      "content": "I see that there is another thread dealing with raising who's in charge. I'll keep adding to this one tho. Anyway.\n\nFrom my point of view, it would be great to have an area somewhere that could host project docs and tests etc. I have had a look at getting a sourceforge project started, but there is a small fee involved. I am happy to pay this, but want to kow if there is any chance soon to get an area set up here, which would be a lot easier.  \nIn any case, I am happy to be the custodian of the documentation and essentially project manage, if that is ok with everyone else.  \nIn terms of art direction, and concept, I will keep out of that side and just focus on building it to whatever spec we decide.\n\n"
    },
    {
      "time": "7 Sep 2005 — 11:10pm",
      "content": "Oh, and a working title, \"UBex\"? - presuming that upside down is in fact one work. Which it isn't...\n\nAnd not that it closely resembles teh first two characters of my handle. It is a day chock full of conincidences really...\n\n"
    },
    {
      "time": "8 Sep 2005 — 8:31am",
      "content": "Thanks Bruce.  \nEventually, so I'm told, an area will be set up for projects on Typophile (like the previous version).\n\nI think you should hold off on any real work until we get some of the rights of ownership issues ironed out. Not that I'm anal about ownership, but a few good points have been brought up on copyrights.\n\nI just want to make sure that NO ONE ELSE will profit (literally $$) from any of the work we contribute as a group.\n\nBTW -- what kind of \"fee\" is involved. You can email if you like since I turned on the email capability on my Typophile contact from.\n\n----------------------------------------------  \nYes, I'm old, but I'm back in style!\n\n"
    },
    {
      "time": "8 Sep 2005 — 5:11pm",
      "content": "Yes, I've been following that post with interest and posted a response, I'm sure you're aware.  \nI think that the thing about it going open source is that as soon as it's on the web, it's fair game.  \nWe don't neccessarily have to release the source though, just the actual application. That would still be that part that is free for all. I don't think we would have an issue then. After all, that's the part that we want to be for the community.  \nI just applied for a sourcefore account, which seems to be free. The one for fee seems to be something else, it's a bit confusing. Anyway, I'll see what happens when I get confirmation.  \nI would still like to have a working area here, but maybe too hard to arrange right now? Does anyone know when the project area might be reinstated?\n\n"
    }
  ]
}
