{
  "id": "14530",
  "title": "Ligature Accuracy",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "First, I'm not sure if this is the correct subcategory of the forums for my request, but here goes: I'm interested employing Avant Garde for a side project. Since this would only be a masthead, I'm drawing it vector, which is no problem. Although there are many out there who'll disagree with the decision to use this oft misused font, but, like I said, I'm concerned with accuracy, for accuracy's sake, in specific regard to the ligatures. Any help is greatly appreciated.\n\n| Attachment | Size |\n| --- | --- |\n| [traction.jpg](http://web.archive.org/web/20120501042332/http:/typophile.com/files/traction.jpg) | 38.4 KB |\n\n",
  "author": "eyecantstop",
  "time": "10 Aug 2005 — 8:38pm",
  "uid": "8701",
  "comments": [
    {
      "time": "10 Aug 2005 — 9:29pm",
      "content": "Not sure what your question is - and this probably belongs in the Design forum. Personal opinion: the TR ligature is fine, but the TI is problematic since Avant Garde doesn't have serifs - your serif in the \"I\" feels forced. I like the bottom one better, the C is more interesting.\n\nIt is readable and I like the use of ligatures for that name TRACTION.\n\n"
    },
    {
      "time": "11 Aug 2005 — 10:06am",
      "content": "Yes, I agree that the CT interaction is a bit more dynamic. My question is this? WWHLD? (What would Herb Lubalin do?)\n\n"
    },
    {
      "time": "11 Aug 2005 — 10:29am",
      "content": "I've moved this thread because I think it needs critiquing not ID'ing. This is fun to see someone creating their own ligatures. I personally love Avant Garde and the wacky alternates. Anyone that doesn't can jump in a lake.\n\nJust like spice, a little goes a long way. I think the TR lig works, but I wonder if you could do a version only using the CT lig? The TI lig isn't working at all. I have a hunch you might be best off just using the TR lig.\n\nNice.\n\n"
    },
    {
      "time": "11 Aug 2005 — 10:35am",
      "content": "eyecantstop,\n\nwhat are you using for source? Avant Garde has a whole heck of a lot of ligatures for caps that have not been digitized.\n\n"
    },
    {
      "time": "11 Aug 2005 — 10:44am",
      "content": "Norbert,  \nA little online research led me to some established ligatures, but the CT is original, I believe. It seems to follow the aesthetic, so I think it's okay. What do you think?  \nPattyFab,  \nYou're right about the \"i\"  \nThanks.\n\n"
    },
    {
      "time": "11 Aug 2005 — 11:02am",
      "content": "\\> _What would Herb Lubalin do?_\n\nHe wouldn't sweat it and start breaking the rules!  \nBTW, what's the audience for this... skateboarders? NASCAR fans? Tractor Pull competitors? It could help guide what the next revision should look like.\n\n"
    },
    {
      "time": "11 Aug 2005 — 11:11am",
      "content": "Norbert, are you holding out on us? Do you have links and images to share?\n\n"
    },
    {
      "time": "11 Aug 2005 — 11:42am",
      "content": "Links, no.  \nImages, si.\n\nI have, and I think ChrisL does too, a 10 lb. coffee table sized book with the early ITC typeface specimens.\n\nThere are a whole slew of uppercase ligatures that were designed. When ITC released typefaces to licensed font manufacturers, each manufacturer developed fonts using their standard complement. Special characters, swash and alternate characters would be offered on another font... IF they were released at all.\n\n"
    },
    {
      "time": "11 Aug 2005 — 11:56am",
      "content": "Norbert,  \nI'd love to see some relevant ligatures from your resource! 'Traction' is the masthead for a progressive bicycling (tricks) magazine, the audience of which is an eclectic group. Generally young impressionalbe males, but I'm hoping to instill a higher sense of design awareness. Concentrating on style and unity and less on type of bike or difference. (BMX, Mountain Bike, Courier, Wheelie King, Whatever) Basically a reflection in print of what I (want to) see happening right now. But, selling ad space is another experiment that'll happen in October at the annual bike industry trade show...\n\n"
    },
    {
      "time": "11 Aug 2005 — 11:58am",
      "content": "I have the big ITC book, too (_The ITC Typeface Collection_, 1980), but its ligature showing is pretty small, just AA, CA, CO, EA, FA, FR, GA, HT, KA, LL, LA twice, MM, NT, PR, RA, SS, ST twice, TH, UT, VV, and WW\n\nNot even close to the new set that FontShop seems to be offering. Here's a link to an image I took at TypeCon in the Type Gallery: [http://www.flickr.com/photos/typeoff/33210312/](http://web.archive.org/web/20120501042332/http:/www.flickr.com/photos/typeoff/33210312/)\n\n"
    },
    {
      "time": "11 Aug 2005 — 11:59am",
      "content": "I just remembered that [Keith Tam](http://web.archive.org/web/20120501042332/http:/typophile.com/wiki/Keith%20Tam) has [several pages](http://web.archive.org/web/20120501042332/http:/www.keithtam.net/) of images with the Avant Garde liggies for our happy enjoyment.\n\n"
    },
    {
      "time": "11 Aug 2005 — 1:33pm",
      "content": "Wow, that's a lot more Avant Garde ligatures that I've ever seen.  \nLooks like you have all the source inspiration you need, eyecantstop. (I promise not to make jokes about your forum name.)\n\n-----------------------------------------------------------  \nYes, I'm old, but I stopped before going blind!\n\n"
    },
    {
      "time": "11 Aug 2005 — 1:48pm",
      "content": "Joking is fully welcomed! My real name is David Smith. Was I supposed to think people would believe that? Keith Tam – yeah, that's where I got a few relevant images.\n\n"
    },
    {
      "time": "24 Sep 2005 — 9:39pm",
      "content": "I love this place.  \nChuckGroth\n\n"
    }
  ]
}
