{
  "id": "14536",
  "title": "Font question",
  "forum": "Design",
  "tags": [

  ],
  "content": "top of the morning to ya... ok im new to the mac- font- world... i went to a web page and downloaded a font but i cant use it or put it in my font book....the end of the file name is ” .si ” is that why? so what im trying to ask is how do you download a font? and get it into your font book\n\nthanks for your help :)  \n ERICA\n\n [‹ Help with styling a resume, please...](http://web.archive.org/web/20071109095838/http:/www.typophile.com/node/14541 \"Go to previous forum topic\") [Hip Handwriting Font? ›](http://web.archive.org/web/20071109095838/http:/www.typophile.com/node/14431 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071109095838/http://www.typophile.com/user/8706\" title=\"View user profile.\">EricasDesign</a>",
  "time": "<br>",
  "uid": "8706",
  "comments": [
    {
      "time": " 11.Aug.2005 8.29am",
      "content": "Maybe it’s a StuffIt archive. These usually have the extension “.sit”, but maybe the t got cut off. Try adding the t at the end. The Finder may ask if you are sure you want to do this—you do. The icon should turn into a StuffIt icon. You should be able to just double-click on it to un-stuff the font.\n\nIf it’s not a StuffIt archive, I don’t know what it is.\n\n"
    },
    {
      "time": " 11.Aug.2005 8.48am",
      "content": "OHH yes im sorry it is ” .sit ” but it wont let me do anything with it when i click on it from the desktop where it put it..... it says  \n“there is no defalt application specifies to open the document .sit ” ...... what do i do ?\n\n"
    },
    {
      "time": " 11.Aug.2005 9.00am",
      "content": "Make sure you have the _( free )_ StuffIt Expander installed on your Mac..  \n [www.stuffit.com/mac/index.html](http://web.archive.org/web/20071109095838/http:/www.stuffit.com/mac/index.html)\n\nDav, [formlos](http://web.archive.org/web/20071109095838/http:/www.formlos.net/)\n\n"
    },
    {
      "time": " 11.Aug.2005 9.04am",
      "content": "and that is what? (the free stuffIt Expander) and where do i get it?\n\n"
    },
    {
      "time": " 11.Aug.2005 9.06am",
      "content": "Well, Its a software tool for expanding ’stuffed’ / packaged folders, containing font files, for example.. :)\n\n_Corporate Blabla.: ’..StuffIt Expander easily expands and decodes all those files you download from the Web or receive in your email. It quickly accesses StuffIt files, unzips zip files created by WinZip® and other zip utilities, plus decompresses tar, gzip and bzip files for Unix users. Just drag, drop, and you’re done! Expander works seamlessly with Web browsers such as Internet Explorer™ and Netscape™. From BinHex to zip, StuffIt to MIME, Expander accesses more formats, in less time, with zero hassles..’_\n\nDav, [formlos](http://web.archive.org/web/20071109095838/http:/www.formlos.net/)\n\n"
    },
    {
      "time": " 11.Aug.2005 9.08am",
      "content": "You can get a free limited-time demo [here](http://web.archive.org/web/20071109095838/http:/www.digitalriver.com/dr/v2/ec_dynamic.main?SP=1&PN=14&sid=52277)\n\n"
    },
    {
      "time": " 11.Aug.2005 9.12am",
      "content": "StuffIt Expander is free, not a limited-time demo. You don’t need StuffIt Deluxe just to open StuffIt files.\n\n"
    },
    {
      "time": " 11.Aug.2005 9.34am",
      "content": "As far as I’m concerned, if you could get along without Stuffit Deluxe altogether, you’d be better off. Allume Systems, the successor to Aladdin Systems, really made a hash of v9 for PC...\n\n"
    },
    {
      "time": " 11.Aug.2005 11.47am",
      "content": "I’m perfectly perfectly happy with my old Aladdin Stuffit Deluxe.\n\n"
    }
  ]
}
