{
  "id": "14542",
  "title": "Mavis from Chester of Village",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "Hi!\n\nIt's now four weeks since the launch of Village. If you hadn't heard the news, we're a type co-op; the union of ten (soon to be twelve) young type foundries who have decided to go it alone, together. vllg.com is the information channel and boutique storefront for this group of equals.\n\nThe members of our group hail from Canada, Finland, Germany, Greece, Italy, The Netherlands, Portugal, Switzerland, the UK, and the US. We are Feliciano Type Foundry, Joshua Darden, Karsten Luecke Type Foundry, Lux Typographics, Orange Italic, Thirstype, Type Initiative, Underware, Village, and a soon-to-be-announced tenth member. Village is based in New York City.\n\n[http://vllg.com/](http://web.archive.org/web/20141114132724/http:/vllg.com/ \"http://vllg.com/\")\n\nMany thanks for all of the encouragement and good wishes we have received; we are especially grateful to those who blogged about us, posted about us, and otherwise spread the word via the internets.\n\n/\n\nNew release:\n\nMavis from Chester of Village. A knowingly, purposefully, and unapologetically dumb typeface with some very smart functionality.  \n [http://vllg.com/Village/Mavis/mudTyper+Weights/](http://web.archive.org/web/20141114132724/http:/vllg.com/Village/Mavis/mudTyper+Weights/ \"http://vllg.com/Village/Mavis/mudTyper+Weights/\")\n\nUpcoming releases:\n\nOmnes by Joshua Darden. A multi-weight gestural sans serif with immense joie-de-vivre.  \n [http://vllg.com/JoshuaDarden/](http://web.archive.org/web/20141114132724/http:/vllg.com/JoshuaDarden/ \"http://vllg.com/JoshuaDarden/\")\n\nLocal Gothic by Christian Schwartz of Orange Italic. The first self-published font from the great Mr Schwartz, with intelligent OpenType substitution programming.  \n [http://vllg.com/OrangeItalic/](http://web.archive.org/web/20141114132724/http:/vllg.com/OrangeItalic/ \"http://vllg.com/OrangeItalic/\")\n\nKaas by Hugo d'Alte for Thirstype. A blackletter face for the 21st century, with Latin, Cyrillic, and Hebrew alphabets.\n\n/\n\nHuge thanks to the Society of Typographic Aficionados (aka SoTA) for this year's TypeCon in New York City; much fun was had by many. Several Village people were there: Christian Schwartz, Joshua Darden, Karsten Luecke, Mario Feliciano, Chester, and Akiem Helmling and Sami Kortemaki from Underware, who spent the entire conference locked away in a makeshift radio studio microcasting and streaming TypeRadio. Check out the Podcasts at [http://TypeRadio.org/](http://web.archive.org/web/20141114132724/http:/typeradio.org/ \"http://TypeRadio.org/\")\n\n/\n\nThanks for reading.  \nVillage\n\n/ / / / / / / / / / / / /\n\n[http://vllg.com/](http://web.archive.org/web/20141114132724/http:/vllg.com/ \"http://vllg.com/\")\n\n1.646.654.1506 / phone + fax  \n1.917.547.3826 / alternate phone\n\n168 Second Ave #253 / New York NY 10003 USA\n\n/ / / / / / / / / / / / /\n\n",
  "author": "Miss Tiffany",
  "time": "11 Aug 2005 — 1:45pm",
  "uid": "108",
  "comments": [

  ]
}
