{
  "id": "14550",
  "title": "What to do in Chicago?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am going to be in Chicago in the first week of September. And I would like to hear your suggestions re anything type and/or design related worth visiting… So?\n\n(BTW General suggestions also appreciated!)\n\n [‹ Typography manual in English](http://web.archive.org/web/20080220142426/http:/www.typophile.com/node/14622 \"Go to previous forum topic\") [Indesign CS2 UNderline/Strikethrough problems!!! ›](http://web.archive.org/web/20080220142426/http:/www.typophile.com/node/14623 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080220142426/http://www.typophile.com/user/3972\" title=\"View user profile.\">bert_vanderveen</a>",
  "time": "<br>",
  "uid": "3972",
  "comments": [
    {
      "time": " 12.Aug.2005 4.33am",
      "content": "In the Art Institute of Chicago, they have rebuilt the interior of the main room from the demolished Chicago Stock Exchange building, which was designed by Louis Sullivan. If you go in the back entrance, you can go inside this room for free (the hallway to it is before you get to the check-in desks). Or, at least is was that way in 2000. But anyway, taht interior is worth it!\n\n"
    },
    {
      "time": " 12.Aug.2005 4.54am",
      "content": "If you can go to a White Sox game they are the best in the American League and they play little ball which is exciting.\n\n"
    },
    {
      "time": " 12.Aug.2005 5.28am",
      "content": "“If you can go to a White Sox” ahaaa! Get the type out! This is deep, but there is a captured German Sub at the Field, I think, and it’s got cool type on the dials and gauges...;)\n\n"
    },
    {
      "time": " 12.Aug.2005 5.45am",
      "content": "although i havent been yet (finding time is tough) i heard the newberry library on oak and clark is wonderful. it’s mentioned at least 3 times in Anatomy of a Typeface by A. Lawson...i believe they have some original drawings of Centaur there as well as tons of illuminated manuscripts and all sorts of other goodies.\n\nthe tech guy at my work told me you just have to have a purpose of research (private library), give them $5 and you get a card to come back whenever. i think this is how it works. sorry for the fuzziness, but i have been told definitely go there.\n\nalso, try some pubs in the wicker park area. type and letters never look sweeter until you’ve had a few. double door is always fun. or if youre a beer in cans kinda person, try to find the Hideout. good luck though. when you see the desolate street hidden by factories on either side with a crudely spray painted sign hidden by a bushy tree pointing left to hideout, youre on the right track.\n\nwill\n\n"
    },
    {
      "time": " 12.Aug.2005 8.50am",
      "content": "The Newberry is a must. If you’re not from Illinois, you can get a one day Readers’ Room pass. Illinois residents can get a one year pass. It’s entirely free. Be aware that 75% of their collection is still referenced by a card catalog (not online), which is brilliant. Most books of typographic interest will have a call number beginning with ’Wing’ and will be on the fourth floor.\n\nAs Will said, they have an amazing collection. They do in fact have original drawings of the Centaur types, as well as a large collection of other Bruce Rogers stuff. Other things off the top of my head in their collection : 3 Nuremberg Chronicles (2 German in rough shape, 1 Latin with great rubrication); Ratdolt’s Euclid and some Calendariums but without the great tip-ins; Plantin’s Polyglot Bible; Manutius’ Poliphili, De Aetna, and a ton of octavos; a nice selection of Adolf Rusch; the Champ Fleury; and on and on.\n\nThe U-Boat at the Museum of Science and Industry is definitely worth checking out (get there early if you want to take a tour of the inside). There’s also an exhibit of plasticized human cadavers that I hear will blow your mind.\n\nSox games sell out these days, but they’re great if you can get tickets. Go to Puffers for beers after the game.\n\n1104 S Wabash, 2nd Floor is Columbia College’s Center for Book and Paper Arts. They have cool exhibitions once in a while.\n\nI’ll try to post more stuff later.\n\n"
    },
    {
      "time": " 12.Aug.2005 9.14am",
      "content": "Thanks to everyone for the suggestions in this thread. I just got an awesome job and am moving to Chicago in two weeks.\n\nThe art museum is free on tuesdays. They have a big Toulouse-Lautrec special exhibition right now but it costs more. The best type related stuff I could find during my visit was a copy of the new U&LC book in the gift shop.\n\nIf you make it to a Sox game, sit in right field by Carl Everett and bring a giant picture of a dinosaur. That would make my day. Go Tigers.\n\n"
    },
    {
      "time": " 12.Aug.2005 1.13pm",
      "content": "Thanx so far, guys! Love the inside about the Newberry (even though all the italic references are illegible in my configuration – Safari on OS X 10.4.2), Curious about “more stuff”. Just keep it coming ; )\n\n"
    },
    {
      "time": " 12.Aug.2005 3.16pm",
      "content": "Powell’s Bookstore  \n2850 North Lincoln Ave.  \nChicago, IL 60657  \n’In the heart of the North Side. This store offers our best selection of Art, Architecture and Photography, and is host to our largest rare book room. Lots of fiction, a large children’s section and a coffee bar.’  \nOpen 11 am- 9 pm Sunday-Friday, 10 a.m. to 10 p.m. on Saturday.  \n(773) 248-1444\n\n"
    },
    {
      "time": " 15.Aug.2005 8.11am",
      "content": "Oh yeah, Powell’s! Christ, I dumped a bundle of money in that place during grad school :-/ There’s another Powell’s in Hyde Park, as well as the Seminary Co-op Bookstore (new books, not used or rare), and Ohara’s (one of the only rare-ish type bookstores about). If you head down that way — perhaps after a visit to the U-boat — eat at Salonica (caddy corner to Powell’s). Frank Lloyd Wright’s Robie House is also nearby — currently being overshadowed by the loads of crap new construction going on at Univ. of Chicago — and the place for libations is Jimmy’s Woodlawn Tap on 55th.\n\nThere’s also a used/rare book/map store somewhere around Oak street (not Hyde Park, but north of the Loop). That’s so ambiguous it’s useless, but I’ll try to dig up an address. Haven’t been there in years.\n\n[I removed the italics from my previous post, Bert. Hope it’s readable now.]\n\n"
    },
    {
      "time": " 15.Aug.2005 8.20am",
      "content": "Check out Prairie Avenue Boosktore, too. One of the better architecture/design bookstores in the city. It’s about 800 or so South Wabash.\n\n"
    },
    {
      "time": " 15.Aug.2005 8.26am",
      "content": "Take the Red Line north to the Argyle stop. You’ll be smack in the middle of Little Southeast Asia, and confronted with not only an inordinate amount of olfactory and gustatory delights, but with some truly amazing lettering (Thai, Vietnamese, Khmer, etc.).\n\nJust south of that (the Devon stop) is Little India. Besides the lettering, Sher-a-punjab has a great buffet.\n\n"
    },
    {
      "time": " 15.Aug.2005 8.54am",
      "content": "One more thing about the Newberry. You can’t take photos (in fact, you can’t enter the actual library with a camera, and if you pull out an ink pen in the Readers’ Room, a librarian will do a flying roundhouse kick to your throat). But they do have a reproduction services department. Images are avilable in JPEG and TIFF formats (with TIFFs being substantially more expensive). IIRC, there’s a $10 set-up fee per book, and JPEGs are about $5 a shot. I forget the cost of TIFFs.\n\nSo if you have a particular book/era/typographer you’re interested in, you might want to consider that as an option while you’re there. They can either email the files or ship you a CD.\n\n"
    },
    {
      "time": " 15.Aug.2005 9.01am",
      "content": "If you take the Green Line south to 35th-Bronzeville, you’ll be at the IIT campus. Besides Mies van der Rohe’s Crown Hall, OMA recently built the new student center. It’s not their greatest work, but it’s a pretty cool building. The train also passes through an elliptical corrugated metal tube perched above the building. It’s southern neighbor is a new student housing development by Helmut Jahn. I think there’ve been some other new building projects going on at IIT recently.\n\nIf you actually are going to a Sox game, you can walk to Comiskey (I refuse to call it US Cellular Field) from IIT.\n\n[Sorry for the diarrhea of posts...]\n\n"
    },
    {
      "time": " 15.Aug.2005 9.57am",
      "content": "You may also want to stop for some ice cream at one of [these places](http://web.archive.org/web/20080220142426/http:/www.gapersblock.com/detour/the_ice_cream_scene/ \" Reviews of Chicago's best ice cream\"). I haven’t been to any of them myself, but I want to try a few out when I get back to school.\n\n"
    },
    {
      "time": " 15.Aug.2005 10.29am",
      "content": "There’s a place in bucktown that has amazing shaved ice called Miko’s. They always have a dozen flavors and you can mix them up. It’s a few blocks north of the blue line on Damen.\n\nCan anyone recommend some vegetarian friendly resturants?\n\n"
    },
    {
      "time": " 15.Aug.2005 11.20am",
      "content": "Wow all this talk about the Sox.\n\nFrom what I understand, Chicago is still a Cubs town.\n\nBtw, I live in Chicago, and I didn’t even know about  \nmost of this stuff posted in this thread..\n\nGood suggestions!\n\n"
    },
    {
      "time": " 15.Aug.2005 1.35pm",
      "content": "Cubs town!? Hey, I’m a south-sider. I suppose there’s a good chance I’m the only typographer in the Back o’ the Yards, though.\n\nDefinitely go to Margie’s. I’ve never eaten there (I have absolutely no sweet tooth), but it comes highly recommended by my father and several friends. It’s worth it for the interior alone.\n\nVegetarian friendly resaurants:\n\nLula’s in Logan Square is a favorite of many. (But if you’re in Logan & not vegetarian, have the corned beef hash at Johnny’s. Superb.)  \nThe Chicago Diner (despite the connotations of its name) is entirely meat-free and quite good. North Halsted above Addison.  \nEarwax in Wicker Park is mostly vegetarian, IIRC.  \nThere are also a few vegetarian soul food restaurants in the southside, if you’re into biscuits and collard green like me. Soul Vegetarian East is on 75th Street — I ate there in school, and haven’t been back since, but it’s phenomenal. And there’s Vegetarian Express on 111th. Never been there, but I believe there’s a connection between the two.\n\n"
    },
    {
      "time": " 15.Aug.2005 1.49pm",
      "content": "Awesome. Thanks!\n\n"
    },
    {
      "time": " 15.Aug.2005 1.50pm",
      "content": "I would never eat at a place called Earwax, are you kidding?\n\n"
    },
    {
      "time": " 15.Aug.2005 2.07pm",
      "content": "Earwax is/was pretty cool — their old space across the street had more character than their new digs. The entirety of Wicker Park has gotten a bit too...I was going to say ’cool’ or ’hep’, but really it’s neither — it’s just expensive, but I have fond memories of eating at Earwax during the hey-day of the trashy & cheap Wicker. Decent video rentals upstairs too. Although the idea of organizing by director is overly art-school-cool.\n\nMyopic, just south on Milwaukee, has a good selection of used books. Nothing rare though, and their fiction and art selection is vastly superior to their type & design.\n\n"
    },
    {
      "time": " 15.Aug.2005 2.12pm",
      "content": "Incidentally, Bert, if you find yourself in the Wicker Park area, my favorite eats in the whole neighborhood have to be from the food vendor carts in the mini-plaza at Ashland and Division. Mango bits with fresh limes squeezed over them, covered in chili pepper. And elotes: corn (on the cob or in a cup) smothered with mayo, butter, parmesan cheese, and red pepper. Two in the same day will cause a massive coronary. But once in a while won’t kill you. I hope.\n\n"
    },
    {
      "time": " 15.Aug.2005 4.35pm",
      "content": "Ex-Chicago. If you must go to the trendy Wicker Park neighbrhood, stop at Quimby’s, 1854 West North Avenue. Great books and ephemera. Eat at Hi Ricky (Thai). Walk around. Enjoy. Good design books at the Museum of Contemporary Art, 220 East Chicago Avenue, one block east of Michigan Avenue.\n\n"
    },
    {
      "time": " 16.Aug.2005 6.27am",
      "content": "Wonderful! With six full days to spend in Chicago there’s not gonna be a free moment left, I guess.  \nBTW: I aim to be at the InDesign User Group meeting on Sept. 8, but can’t find a location or time for that. Any Chicagan InDesigners around who know?\n\n"
    },
    {
      "time": " 16.Aug.2005 1.48pm",
      "content": "My favorite veggie restaurants are Earwax and Pick-Me-up Cafe. For breakfast food, Victory Banner in Roscoe Village is super (vegan). Karyn’s has got a great raw veggie menu and Sultan’s in Wicker Park has got the best Middle-Eastern cheap eats around.\n\n"
    }
  ]
}
