{
  "id": "14558",
  "title": "tell me what you think",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello all.. here i have attatched 2 “.jpg” , and there are 3 logos in each . tell me what you think. i had to design them for class. im really being steared toward the colored ones and especially the green but im sure it to busy or something.. thanks for your comments\n\n| Attachment | Size |\n| --- | --- |\n| [Nagli1.jpg](http://web.archive.org/web/20060522215851/http:/typophile.com/files/Nagli1.jpg) | 70.92 KB |\n| [Nagli2.jpg](http://web.archive.org/web/20060522215851/http:/typophile.com/files/Nagli2.jpg) | 154.75 KB |\n\n",
  "author": "<a href=\"user/8706\" title=\"View user profile.\">EricasDesign</a>",
  "time": "<br>",
  "uid": "8706",
  "comments": [
    {
      "time": " 12 August, 2005 - 10:25am",
      "content": "one comment. the hyper-extended bars on the T make it hard to “read” as a T. At first i kept thinking it said “Naglilech.” I think it’s very important that there be no confusion about what the name of the company is with its logo.\n\n"
    },
    {
      "time": " 12 August, 2005 - 1:34pm",
      "content": "Erica, work on the kerning its very inconsistant the gap between T and e in Tech is so large you could drive a truck through it. I suggest you try a version where you separate the mark from the type (two elements) when you combine them it makes the “logo”, “art” not very business like. Your choices in typefaces are interesting not boring.\n\n"
    },
    {
      "time": " 12 August, 2005 - 9:31pm",
      "content": "thank you :) …now does anyone think that something should be done with the orange or with the green spirals??? should they be changed in anyway?\n\n"
    },
    {
      "time": " 12 August, 2005 - 10:48pm",
      "content": "Erica, please in future posts make the samples smaller. Make the orange and green sprials less important than the the type (tint of a solid color)\n\n"
    },
    {
      "time": " 13 August, 2005 - 8:17am",
      "content": "ok thats a good idea ill go try that now, thanks.. and sorry if the size is to big it came out just fine on my end. sorry\n\n"
    },
    {
      "time": " 15 August, 2005 - 7:42am",
      "content": "1) reduce the size of your images before posting\n\n2) when asking for a critique, we need to know some context. What are the logos for? What does the company do? What are the project paramaters? What’s your concept? hat are the reasons for using the type/elements that you are using?\n\n"
    }
  ]
}
