{
  "id": "14566",
  "title": "Blackletter Ligatures",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Why do i have such a thing for [ligatures](http://web.archive.org/web/20150322042425/http:/typophile.com/wiki/ligature)? I don't know. Anyhow, i'm wondering if we have an expert on [blackletter](http://web.archive.org/web/20150322042425/http:/typophile.com/wiki/blackletter) ligatures in the house. I know that the [half r](http://web.archive.org/web/20150322042425/http:/typophile.com/wiki/half%20r) can follow \"round\" letters (b d o p) to form ligatures. I know that the \"e\" can be attached to these round letters as well. i'm familiar with the double-p ligature. and then there are always your f-ligs and longs-ligs. then you have your historical German ck and ch ligs, which i'm informed are no longer relevant. And then there's tz, which is used in German. Are there more? I know that potentially _everything_ could be a ligature, but i'm talking about fairly standard blackletter ligature conventions here. anyhow, if anyone knows of any other interesting combinations, pipe up!\n\n",
  "author": "paul d hunt",
  "time": "12 Aug 2005 — 12:36pm",
  "uid": "7006",
  "comments": [
    {
      "time": "12 Aug 2005 — 1:04pm",
      "content": "\\> Why do i have such a thing for ligatures?\n\nMaybe the same reason as me: boredom.\n\nhhp\n\n"
    },
    {
      "time": "12 Aug 2005 — 1:07pm",
      "content": "Ligatures for Blackletter? After all of the noise Goudy generated about stealing sheep, I've been afraid to touch it. Not to hi-jack the topic, but what did the guy mean? I would assume anyone who would use ligatures would also be concerned enough about appearance to letterspace as well...\n\n"
    },
    {
      "time": "12 Aug 2005 — 2:23pm",
      "content": "\"historical German ck and ch ligs, which i’m informed are no longer relevant!\"\n\nAhm no sir! If you set German texts in Fraktur or any black letter typeface, you have to stuck to the old traditional rules since no one has change it. This means at least the long\\_s and hopefully the common ligatures. The round r is outdated since the time of Fleischmann.  \nCommon ligatures are:  \nc\\_h  \nc\\_k  \nlongs\\_c\\_h  \nlongs\\_longs  \nlongs\\_i  \nlongs\\_t  \nlongs\\_z (germandbls)  \nf\\_f  \nf\\_i  \nf\\_l  \nf\\_t  \nt\\_z  \nl\\_l  \nEven more ligatures are possible. Have a look at the original lead typeface of Klingspor Gotisch (not the Linotype digi version).\n\nBut anyway, dump, naive people set even German texts like common texts today - and it looks awful. But were is no standard of a Fraktur codepage or a Fraktur keyboard layout. Only a pseudo standard \"Dfr\" (Deutsche Frakur) is available - setting up the long\\_s and its ligatures on false glyphs on a standard codepage.\n\nJohn, how is the status of the Fraktron project?  \n [http://fraktron.sourceforge.net/](http://web.archive.org/web/20150322042425/http:/fraktron.sourceforge.net/ \"http://fraktron.sourceforge.net/\")\n\n-- [astype.de](http://web.archive.org/web/20150322042425/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "12 Aug 2005 — 2:25pm",
      "content": "\"I would assume anyone who would use ligatures would also be concerned enough about appearance to letterspace as well…\"\n\nWell, one would hope.\n\n"
    },
    {
      "time": "12 Aug 2005 — 2:30pm",
      "content": "This may be of some blackletter relevance.\n\nI ran across this archve last week.\n\n- [http://moorstation.org/typoasis/designers/steffmann/index.htm](http://web.archive.org/web/20150322042425/http:/moorstation.org/typoasis/designers/steffmann/index.htm \"http://moorstation.org/typoasis/designers/steffmann/index.htm\")\n\n(FYI: I can't attest to the 100% legality of this archive)\n\n"
    },
    {
      "time": "12 Aug 2005 — 2:42pm",
      "content": "I think its all legal since all designs are pre 1950, but the technical quality is not my cup of tea. In overall it opens a little the univers of black letters for todays people.\n\n-- [astype.de](http://web.archive.org/web/20150322042425/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "12 Aug 2005 — 3:07pm",
      "content": "Andreas,\n\nThe quality, of course, does leave a lot to be desired.  \nBut it is a nice reference point -- for free none the less.\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:20am",
      "content": "Paul, you know that you are a blackletter-expert, too!\n\nI've found that old specimens (like that for Wilhelm Klingspor Gotisch) often you you everything you need to know. Richard must have some, right? E-mail me if you can't find anything…\n\nAlso, I think that some of the ligatures are style dependent. If you are designing a real textura,\\* for instance, then the half-r would be kind of cute, even though printers stopped using them in the 18th century. But a fraktur, unless it was a Nuremburg fraktur, could probably do without them, etc.\n\n\\*As long as your texura isn't an Old English…\n\n"
    },
    {
      "time": "13 Aug 2005 — 8:26am",
      "content": "expert-texpert\n\n"
    },
    {
      "time": "13 Aug 2005 — 12:53pm",
      "content": "In the [Christian Gothic](http://web.archive.org/web/20150322042425/http:/typophile.com/node/9245) (Imprimerie Nationale, 1902), I'm working on, the complete set of ligatures is:\n\nff, fi, ffi, ct, tt, ll\n\nNote that fl, in particular, is not ligated. Obviously, fj is uncommon in French, but presumably it would follow the same rules as fi.\n\nAdditional variants include: final s, final n, initial v. There are also final-swash e, t, r.\n\nWhen I release the font, all these ligatures and variants will be included. I'm still undecided which ones to make optional, though - I think that'll take more experience using the type in present-day settings.\n\n"
    },
    {
      "time": "13 Aug 2005 — 4:35pm",
      "content": "_John, how is the status of the Fraktron project?  \nhttp://fraktron.sourceforge.net/_\n\nShamefully paralyzed and festering. :-( That should change soon though...\n\n"
    },
    {
      "time": "13 Aug 2005 — 5:11pm",
      "content": "Paul, there are literally thousands of scribal ligatures used in the original blackletter calligraphy and in Gutenberg's own B42 type. The most common is any letter with a bar over it indicating a doubled letter. For an exhaustive survey see Ulrico Hoepli's _Lexicon Abbreviaturarum_. Horrible cameraphone pictures of it here: [1](http://web.archive.org/web/20150322042425/http:/eccentrifuge.com/hoepli/hoepli1.jpg) [2](http://web.archive.org/web/20150322042425/http:/eccentrifuge.com/hoepli/hoepli2.jpg) [3](http://web.archive.org/web/20150322042425/http:/eccentrifuge.com/hoepli/hoepli3.jpg). (Bottle shown for size comparison purposes. Urp.)\n\nYou should also give [Carter & Cone](http://web.archive.org/web/20150322042425/http:/carterandcone.com/) a call and buy Flammande and Flammande Archaic.\n\n"
    },
    {
      "time": "13 Aug 2005 — 5:51pm",
      "content": "cool. is there anywhere that the full [Carter & Cone](http://web.archive.org/web/20150322042425/http:/typophile.com/wiki/carterandcone) catalog can be previewed. Flammande isn't in [Indie Fonts](http://web.archive.org/web/20150322042425/http:/typophile.com/wiki/Indie%20Fonts) and that's the best C&C resource i've got my hands on at the moment.\n\n"
    },
    {
      "time": "14 Aug 2005 — 12:16am",
      "content": "John, the _Dizionario di Abbreviature..._ is by Cappelli; Hoepli was just the publisher. It is often referred to simply as 'Cappelli'. Another good reference book for scribal contractions is _The Record Interpreter_ by Charles Trice-Martin. This is more specifically British in its focus, being intended as an aid to deciphering public rolls, parish records, etc.\n\n[The equivalent volume for Greek is T.W. Allen's _Abbreviations in Greek Manuscripts_, which is helpfully included in the more recent collection _Abbreviations in Greek inscriptions, papyri, manuscripts and early printed books_ edited by Oikonomides.]\n\nThere is also what looks like a really useful electronic dictionary, [Abbreviationes](http://web.archive.org/web/20150322042425/http:/www.ruhr-uni-bochum.de/philosophy/projects/abbrev.htm). I have not used this, largely because it is only available for the Mac, but it seems very promising.\n\n"
    },
    {
      "time": "14 Aug 2005 — 7:26am",
      "content": "Aack. My mistake. And thanks for reminding me about Abbreviationes.\n\nIt looks as if I've been misspelling Flamande, too. Paul, there is a [sample of Flamande here.](http://web.archive.org/web/20150322042425/http:/www.dutchtypelibrary.nl/Deltahinting.html) Along with some lovely Orgelmusik to download.\n\n"
    },
    {
      "time": "16 Aug 2005 — 10:10am",
      "content": "i've never seen a blackletter ll ligature. can anyone link me to an image?\n\n"
    },
    {
      "time": "16 Aug 2005 — 11:41am",
      "content": "Paul,\n\nA few of [Helzel's](http://web.archive.org/web/20150322042425/http:/www.romana-hamburg.de/fraktur1.htm) fonts have them. They're generally the exact same l just doubled. It's more of a German typecase ergonomics issue than a design issue.\n\n"
    },
    {
      "time": "19 Aug 2005 — 11:57pm",
      "content": "Sure. Here's a [600 dpi excerpt](http://web.archive.org/web/20150322042425/http:/levien.com/type/myfonts/xgothic-600dpi.jpg) from page 14 of Christian's Debuts book. As you can see, it's a real ligature, not just two individual 'l' glyph stuck together. I didn't realize such a thing was so rare.\n\n"
    }
  ]
}
