{
  "id": "14568",
  "title": "Dilworth Typographics Inc.",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I just wanted some feedback on this initial launch of my website.\n\n[http://dilworthtypographics.com](http://web.archive.org/web/20071016210552/http:/dilworthtypographics.com/ \"http://dilworthtypographics.com\")\n\nThanks!\n\n [‹ New World Organics](http://web.archive.org/web/20071016210552/http:/typophile.com/node/14640 \"Go to previous forum topic\") [Gatorade Font ›](http://web.archive.org/web/20071016210552/http:/typophile.com/node/14631 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071016210552/http://typophile.com/user/7929\" title=\"View user profile.\">silas</a>",
  "time": "<br>",
  "uid": "7929",
  "comments": [
    {
      "time": " 12.Aug.2005 3.54pm",
      "content": "It’s not clear whether the fonts shown are for sale, custom, or under development.\n\nI like the spare black and white design of the site.\n\n"
    },
    {
      "time": " 12.Aug.2005 4.33pm",
      "content": "Silas,\n\nThe site is beautifully exectuded. I love the restrained, understated design. The emblem is brilliant. Love the di cut on the card. Is that standard biz card dimensions or wider?\n\nA few notes about the User Experience (UX):\n\n1. Navigation Design: it would be prefereably to, however subtly, visually differentiate the navigation label/link (“portfolio” etc.) to reflect the current location within the IA (info architecture).\n\n2. The “email away” link on the about page may confuse users. Most would be expecting a mailto: link, rather than a link to the contact section. Either change the wording, or make it an actual mailto: link.\n\n3. Contact form: it’s unclear that all fields are required. Also it would be smart to use a script to clear the field when the user clicks on it, thus saving them the step of having to select the text b4 entering their data. For that matter, having the cursor be in the name field on page load is also a good idea.\n\n4. Typo nitpick: do you need the colon after section headers (“About:”)?\n\nNice work.\n\n-t\n\n"
    },
    {
      "time": " 12.Aug.2005 11.22pm",
      "content": "Silas,\n\nI’m really impressed with all the typefaces you’ve worked on. The website is nice and clean; I like the whole greyscale idea.\n\nYou might want to add an image or some text to the right-hand column on the Services page. Maybe a glyph that you’re tweaking (with bezier curves and handles)? In b/w of course!\n\n"
    },
    {
      "time": " 13.Aug.2005 12.18am",
      "content": "I really like the simple, smooth and clean site, and structure..\n\n_I also think your logo / emblem is nice, I even had a rather similar one myself, some time ago.: :)  \n\\> [dav.formlos.net/folio/dh.gif](http://web.archive.org/web/20071016210552/http:/dav.formlos.net/folio/dh.gif)_\n\n"
    },
    {
      "time": " 13.Aug.2005 2.00am",
      "content": "Silas, I really like your site.\n\nYou might want to edit your “About” text a little. It sounds a bit to informal for my taste. And you have some extra words.\n\nAlso, in your portfolio, it seems that some of the faces are carried by T-26? What about a link to the T-26 page for that font, so that visitors can go buy the available fonts directly?\n\n(of course, if your typefaces were work for hire, then maybe you wouldn’t want to do this, as you wouldn’t get anything from it)\n\n"
    },
    {
      "time": " 13.Aug.2005 3.17am",
      "content": "Great idea Antiphrasis! It will bring consistency to the interface.\n\n"
    },
    {
      "time": " 13.Aug.2005 1.03pm",
      "content": "Silas,\n\nNice work, and some good typefaces in there as well. I like the strict design for sure, but I would add some colours here and there, very mosdest and discret. Like lines, headlines, titels etc. And of course low key flavours like “earthy” style. On the type section there ought to be links to retailer if sold elsewhere. And I wouldn’t mind to see more of each typeface, at least upper- and lowercases plus numbers and a few more common signs. Apart from this it’s a very good start.\n\nCheers  \n/Stefan H\n\n"
    },
    {
      "time": " 13.Aug.2005 2.27pm",
      "content": "The clean black and white design is striking, and the typefaces strong. I think your home screen is visually significantly stronger than the others, because of the visual contrast of the two cards. They others are a bit grey and weak compared to the dramatic opening screen.\n\nAntiphrasis’ idea is good for the services screen. Also on the portfolio screens, think about balancing the showings vertically, so there are blacker weights mixed through the showing. Look at FontBureau’s showings for examples. You might try adding a single large character on the right also, to see if that helps or hurts.\n\nAlso it would help if you would have navigation to page through your portfolio without going back to the home screen. See Jim Parkinson’s site for an example. Incidentally, both Parkinson’s and FontBureau’s sites are excellent models of well-designed type sites, in my opinion.\n\n"
    },
    {
      "time": " 13.Aug.2005 8.28pm",
      "content": "Thanks to all for the feedback. I knew I would get some quality critique here. I must confess, this is a rushed/beta version. Sorry to heap a half-baked site on you all!\n\nI’m glad everyone appreciates the simplicity. I strive for it.\n\nNone of my designs are available for retail licensing (yet). There will certainly be links or disclaimers soon. I’m keeping the Portfolio section slim for now... just a taste of my design sensibilities/capabilities.\n\nThe opening image will be randomly selected from snapshots of my fonts in use or my custom lettering work (or even doodles). A bit of entertainment/stickiness value not unlike what I have set up on my other site... [http://silasdilworth.com](http://web.archive.org/web/20071016210552/http:/silasdilworth.com/ \"http://silasdilworth.com\")\n\nYes, the opening image is of my business card mockup. Is the D-shaped die-cut overkill? I haven’t printed them yet because I’ll be relocating next month.\n\nRegarding the navigation oversights and inconsistencies, I’m certainly taking this baby back to the drawing board with all that was noted above. Thanks for the attention to these details.\n\n"
    },
    {
      "time": " 14.Aug.2005 9.08am",
      "content": "Very nice site! A small note on your silasdilworth.com, some of the art links are wrong. I’m not sure what is going on but for instance, on the following page, the sections that have php-based sublinks aren’t working right.\n\nif viewing 01, 02 links to 01  \nif viewing 03, 04 links to 03\n\n[http://silasdilworth.com/art.php](http://web.archive.org/web/20071016210552/http:/silasdilworth.com/art.php)\n\nI just started at the end and went backwards to view them all once i realized I was missing some images, but most people are probably going to miss a few nice images.\n\n"
    },
    {
      "time": " 15.Aug.2005 7.38am",
      "content": "don’t forget to declare a default background color.\n\n"
    },
    {
      "time": " 15.Aug.2005 12.12pm",
      "content": "The site looks really good. Only a couple things, and this is nitpicking: 1) Your copyright is hard to read (of course, no one’s probably reading it anyway). 2) On your portfolio page, I thought “Collaborations” was a font name and I tried to click on it. Is there a way to differentiate the “Originals” and “Collaborations” headings from the actual fonts? Maybe a horizontal rule that spans both columns.\n\nBy the way, Trauen looks great. Do you have specimens available?\n\n"
    },
    {
      "time": " 15.Aug.2005 1.10pm",
      "content": "Very nice. I agree with everyone, it is spare and successful. I do agree with Stefan, hints of color here and there could be quite powerful.\n\n"
    },
    {
      "time": " 15.Aug.2005 1.29pm",
      "content": "Silas, impressive body of work. I think the black and white works just fine. I agree with Stefan though, you should certainly include more glyphs in your samples. Stop teasing us and show us your glyphs! :)\n\n"
    },
    {
      "time": " 15.Aug.2005 4.00pm",
      "content": "I’ll post again when more robust previews are available, most likely after the fonts are more readily available for purchase.\n\n"
    },
    {
      "time": " 16.Aug.2005 11.24am",
      "content": "Silas, great site. It’s clean and clear but has a distinct feel to it. Nice work.\n\nOnly one thing bugged me. The front page photo (which I know will be random in the future). If you’re going to show type and the fonts are the focus, please make at least the largest type more immediately legible. It really bugged me that I couldn’t easily read some of the type on the business card(?).\n\nI look forward to more content.\n\n"
    }
  ]
}
