{
  "id": "14560",
  "title": "Open Source Typeface",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Would there be any interest in an online tool for collaborative font design of open source fonts?\n\nI have been trying for a while to work a way to combine my love of type design and passion for creating beautifully useful websites. After a drunken chat with a developer friend we have come up with a few ideas for a way of building a tool for fostering a community based font design collective that would release final products as Open Source fonts.\n\nBefore I go into how this might work how much interest would there be in such a tool?\n\n",
  "author": "mijlee",
  "time": "12 Aug 2005 — 11:03am",
  "uid": "8699",
  "comments": [
    {
      "time": "12 Aug 2005 — 1:30pm",
      "content": "i think that's an amazing idea. i'm sure i'd waste countless hours medling with opensource fonts.\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:16am",
      "content": "Yeah, I would definately contribute to an opensource typeface. The idea of a typeface being remixed appeals to me.\n\n"
    },
    {
      "time": "13 Aug 2005 — 4:30am",
      "content": "OK now for the technical bit.\n\nWhat format would be best for the editing? I have an idea of how it might work but it is obviously based around the software that I use to build my fonts, and also the process is based on my methods too.\n\nThe way I see the process working is something like this;\n\n<dl>\n<dt><strong>1. Direction</strong></dt>\n<dd>Discussion based starting point where the style and purpose of the font is set out. This will result in the basic brief and outline of the fonts specs.</dd>\n<dt><strong>2. Grid</strong></dt>\n<dd>From the initial discussion we should be able to design a grid which will form the template for all charecters.</dd>\n<dt><strong>3. Template characters</strong></dt>\n<dd>An initial group of characters would be created to set the tone and style of the font. </dd>\n<dt><strong>4. Character set</strong></dt>\n<dd>We now move into covering the full Character set. There will be a navigation page that has a whole for all full ASCII set, each one will hold alternatives for each character for discussion, any of which can be downloaded, edited, and uploaded.</dd>\n<dt><strong>5. Creating the font</strong></dt>\n<dd>Once all the characters have been created a font can be created from the outlines by the font admin. This font can only be edited by one user at a time and must be signed out and in whenever anyone makes the change. OpenType is my preferred format.</dd>\n<dt><strong>6. Version tracking</strong></dt>\n<dd>The obvious advantage to this kind of development is that the font can evolve and improve endlessly. Missing characters can be added, languages covered. And issues dealt with</dd>\n<p>How does all that sound as start?</p>\n</dl>\n"
    },
    {
      "time": "13 Aug 2005 — 7:18am",
      "content": "sounds pretty good, but you didn't answer the software question. i think that's a important piece of this puzzle. of course i'd prefer everything to be in FontLab's vfb format, but i understand that other developers use different tools. maybe it would be best to just save as [OpenType](http://web.archive.org/web/20140827180846/http:/typophile.com/wiki/OpenType) [CFF](http://web.archive.org/web/20140827180846/http:/typophile.com/wiki/Compact%20Font%20Format) format or perhaps even in [TrueType](http://web.archive.org/web/20140827180846/http:/typophile.com/wiki/TrueType) format?\n\n"
    },
    {
      "time": "13 Aug 2005 — 8:19am",
      "content": "Sounds like an interesting project, but why make the resulting fonts open-source? You'll attract a wider range of skilled collaborators if the resulting fonts were not added to the pile of freeware fonts out there. Why not license the resulting fonts in order to finance and sustain the web site or for some worthy charity?\n\n"
    },
    {
      "time": "13 Aug 2005 — 11:13am",
      "content": "I'd think the point here is not just a collaboration, but rather a free one, allowing all to join the effort. Such collaborative efforts are usually fun, drawing people you otherwise won't dream of working with. However, they do require a firm control: some benevolent dictator to guide it in the right path. After all, have you ever seen a group of people, let alone type designers, uniformly agree on anything? (let alone a worthy charity.)\n\n"
    },
    {
      "time": "13 Aug 2005 — 11:24am",
      "content": "sii, i think your idea would be great for Typophile Uppercase members. Maybe something like that could help offset the costs of Typophile? Just a hare-brained idea...\n\n"
    },
    {
      "time": "13 Aug 2005 — 12:29pm",
      "content": "Shay, I think that type designers would be more willing to contribute if the end product wouldn't add to the mountain of existing free fonts which obviously make it harder for them to earn a living from font design.\n\nI think that's why you see so little contribution from the typographic community on the existing OSS efforts... [http://sourceforge.net/search/?type\\_of\\_search=soft&words=fonts](http://web.archive.org/web/20140827180846/http:/sourceforge.net/search/?type_of_search=soft&words=fonts \"http://sourceforge.net/search/?type\\_of\\_search=soft&words=fonts\")\n\nPaul, yes if the results went to support Typophile I think you'd likely get support from the designers who contribute here.\n\nCheers, Si\n\n"
    },
    {
      "time": "13 Aug 2005 — 1:30pm",
      "content": "sii, if I read you correctly, your idea (donate the profits from the collaborated font) will help the designers fiscal status just as if they designed a free font. I can understand why some people dislike free fonts, as most, sadly, suck. But if someone decides he'd like to charge for a font just so it won't be free, that guy, imo, is a fucktard.\n\n"
    },
    {
      "time": "13 Aug 2005 — 1:43pm",
      "content": "Designers don't like free fonts just because most free fonts are of poor quality, they dislike free fonts because they erode the credibility of the whole design economy. When people can get inferior products for free, they will often go with those in lieu of paying for better quality. Even a lot of graphic designers who don't make fonts feel this way… fonts could just be the beginning (actually, royalty-free stock photo and illustration was probably the beginning…). No graphic designer wants to see his market dry up.\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:15pm",
      "content": "Shay you didn't read my post correctly or I didn't explain myself properly. To many type designers contributing to a \"free\" font just further erodes the perceived value users put in fonts. Contributing to a charity font does not do this - the publicity around such an effort increases the perceived value of fonts - a user may say \"I've never purchased a font before, but this is for a good cause\" - that customer will be more likely to come back in the future and pay for a commercial font.\n\nContrast the very low involvement in OSS fonts by professionals and the huge number of type designers who contributed to the FontAid projects.\n\nCheers, Si\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:50pm",
      "content": "I am fully aware of the ethical issues of projects like these and would hate to see the type industry damaged in any way. Opening a project up to designers and technicians from different backgrounds and cultures in an open non profit way always results in something that is at the very least interesting and at best brilliant.\n\nThere are ways around ethical and quality issues with considered rules and guidance from a well informed steering group. There are also well developed legal presidents for similar projects that cover the designers, the project and the end user. For example [Creative Commons](http://web.archive.org/web/20140827180846/http:/creativecommons.org/) offers a way to openly copyright work.\n\nI think there should be a central pot where the project can collect donations from people using fonts for profit. I do this on a regular basis when using open source products and always openly tell clients that part of their fee is going to the community that helped make the framework possible to develop their sites.\n\nI think the first step is probably to discuss how people would like to see this working and any ideas that you may have to make it live up to the potential i think it has. There is a lot of work to do to make something like this happen and would appreciate as much help as anyone can give :)\n\n"
    },
    {
      "time": "13 Aug 2005 — 3:20pm",
      "content": "You could be right, but the various FontAid organizers could easily have decided to make a free font, and then asked users to make donations directly to the cause in question. However my feeling is that there would have been considerably less professional participation if that had been the case.\n\nI don't think this is really a question of ethics - I don't think its unethical to make and distribute a free font. I think everyone has the right to create something and put it in the public domain if they so wish. My arguments were around attracting skilled participants. I could be wrong, I just feel that looking at unpaid OSS font efforts in the past they have not attracted professional participation.\n\nAnyway best of luck with the project. It certainly looks interesting and I hope it goes well.\n\nCheers, Si\n\n"
    },
    {
      "time": "14 Aug 2005 — 6:05pm",
      "content": "What's the business model? Open source software is great, but it is generally based on something other than volunteerism, usually involving the possibility of making money from service contracts. So you make the software, give it away, and then get people to pay you to help them use it, customise it, support it, etc. This is the typical business model for open source development. The huge open source industry is not made possible by a bunch of well meaning programmers working for nothing.\n\nThe problem of a viable business model for open source fonts has been around for a while now, and no one has come up with a really good solution to it. This is why there are so few open source fonts. If you want the quality of professional font development, you generally need to figure out some way for professionals to make money.\n\n"
    },
    {
      "time": "15 Aug 2005 — 1:40am",
      "content": "Yes your right most larger Open Source projects do have a support element but i think most of the money comes from donations, for example corporates like IBM put a lot of money into Linux.\n\nI'm not really seeing this as a business proposition.\n\nI am just interested in seeing the outcome of an open collaborative project. I guess if you wanted to build a business model for this you would probably have to create some kind of subscription based membership with a small enough payment to not put the majority of people off and may actually insure that only those who are truly committed will be involved. But this to me is missing the point, I don't want this to be exclusive in any way, I want people to be able to put forward ideas that may be a little left field, they can always be rejected, but that's how you get truly original work.\n\n"
    },
    {
      "time": "15 Aug 2005 — 11:29am",
      "content": "John Hudson asked:\n\n<cite>What’s the business model?</cite>\n\nI've been thinking about free fonts for a while, and have come to a slightly different conclusion than yours. I believe that many people miss that _learning_ is one of the most powerful motivations to do free software development. There is no reason why this can't apply to fonts as well.\n\nIf one follows this theory, then the ingredients for a successful free font community include:\n\n- Mentoring by more skilled type people, particularly constructive critique.\n- A two-way communication with an appreciative user base. It's much more fun to meet a specific need than to draw yet another crappy font to be added to the zillions already available at dafont and related sites.\n- An attractive presentation of the results. Good organization, test settings, maybe even an interactive preview. Feature the \"good stuff\" prominently to avoid getting bogged down too much by [Sturgeon's Law](http://web.archive.org/web/20140827180846/http:/en.wikipedia.org/wiki/Sturgeon%27s_law).\n\nI personally don't think the choice of tools matters all that much. Hardcore free software folk (as well as starving students) will probably go for FontForge, while others will want to use commercial tools. I'm working on my own tools which I think will be especially useful for beginners, so I'd hate to see lock-in to particular tools.\n\nAs for the business / ethics / etc. issues, I'm still mulling all this over, which is one reason I haven't pushed harder on free fonts myself. I'm personally inclined to think that a body of extremely high quality free fonts is a net good for society, but I also respect arguments to the contrary.\n\n"
    },
    {
      "time": "15 Aug 2005 — 11:52am",
      "content": "Raph, don't all of the learning points you mentioned occur in commercial ventures as well?\n\n"
    },
    {
      "time": "15 Aug 2005 — 1:44pm",
      "content": "Raph,\n\nYour comments about learning are fine, but they don't address the problem that John and Si are pointing out. Nobody has said that you wouldn't have a fair number of novice and journeyman contributions. But where do you get the experts who the other folks can learn from, if those experts aren't motivated to contribute?\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "15 Aug 2005 — 1:46pm",
      "content": "_’m personally inclined to think that a body of extremely high quality free fonts is a net good for society..._\n\nI think so too, which is why I'm happy making fonts such as the SBL collection which are available under free license to individuals (but not open source). I have no complaint at all against fonts being made freely available, so long as the people who make the fonts are adequately rewarded (usually with money, but not necessarily so). Type design is a profession, and people shouldn't be doing it for nothing: that just undermines the marketability of our skills.\n\n"
    },
    {
      "time": "15 Aug 2005 — 7:25pm",
      "content": "As is often the case, John and I agree. The thing that makes something like SBL Hebrew work is that \\*somebody\\* is paying the designer, even if they are in turn making the font freely available.\n\nT\n\n"
    },
    {
      "time": "16 Aug 2005 — 9:47am",
      "content": "Well I guess I need to build a beta version or even a non functioning demo.\n\nThen we can discuss how it might be financed and how I could attract the correct mix of people. To be honest I just want to see what happens, good or bad it is bound to be interesting as long as we get enough people involved and the actually contribute something worthwhile.\n\n"
    }
  ]
}
