{
  "id": "1456",
  "title": "Traphik type",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "[http://www.traphik.com](http://web.archive.org/web/20131021222830/http:/www.traphik.com/)   \ncrit is welcome on this logotype, still working on it, its for a photography portfolio, automotive-related. crit is welcome. sorry if i posted this twice, not sure where the other one went. readability is not a huge concern.\n\n",
  "author": "foss",
  "time": "18 Jul 2002 — 10:13am",
  "uid": "653",
  "comments": [
    {
      "time": "18 Jul 2002 — 10:40am",
      "content": "I like the tire-tread thing that's happening.   \nReadability may not be a huge issue, but I think this   \nis sufficiently unreadable as to warrant another   \npass. (e.g., is that 'hi' ligature helping or hindering?   \nAnd that cap A looks a lot like a cap R.)\n\n"
    },
    {
      "time": "18 Jul 2002 — 12:12pm",
      "content": "does the unreadability take away from the logo? if you're going to traphik.com will someone assume it says traphik and forget about it and just see the logotype as a symbol or will someone try to make sure the letters spell something? i agree the A is very close to R\n\n"
    },
    {
      "time": "18 Jul 2002 — 12:47pm",
      "content": "Phil \\_ Joe makes some valid points, but the \\*readability\\* question is hard to figure unless you tell us who is going to traffic traphik.   \n   \nIf a 'graf' crowd is going there, then your logo is \\*too\\* readable. You probably know what I mean. If it's a general audience, then maybe the hi ligature needs to be explained, the A fixed, etc.   \n   \nI do like how the dot on the i has a sense of balance with the ear of the r.   \n   \nThe best/clever part of the logo is the tread/traffic idea. You might strengthen that.   \nI pulled down some guides on the logo. I don't know, maybe pulling it into a grid might help it achieve a sense of balance.   \n   \n ![traph.jpg](http://web.archive.org/web/20131021222830im_/http:/www.typophile.com/forums/messages/29/1734.jpg)   \n   \ngood luck,   \n   \nbj\n\n"
    },
    {
      "time": "19 Jul 2002 — 12:40am",
      "content": "I'm glad you did that. I def need some more alignment with the figures that are almost the same height. the very first version of this logo was very aligned and it didn't come across as tire tread. It's funny- my original idea was to make a logotype that resembled the \\<\\< signs that tell you a sharp left corner is coming up...\n\n"
    },
    {
      "time": "19 Jul 2002 — 1:50pm",
      "content": "Phil -- I really like this. I don't think that (perhaps) readability should even be mentioned (?) For instance, the 3rd character from the left could almost (also?) be an 'R'. Only within context does it read as an 'A'. The only character that could perhaps use some 'tweaking' is the 'T' -- Did you try a lowercase 't'? -- Looking at it again, in a strange way the 'T' looks like an 'R'. -- Anyway, I do like it and the cryptic nature of it is what I like most about it.\n\n"
    },
    {
      "time": "30 Jul 2002 — 10:03pm",
      "content": "thanks for the feedback. ive been working on it some more, maybe its getting too complex now...   \n ![traphik5](http://web.archive.org/web/20131021222830im_/http:/www.typophile.com/forums/messages/29/1897.gif)\n\n"
    },
    {
      "time": "31 Jul 2002 — 2:05am",
      "content": "Pretty cool... but this seems like a starting point for me. What sort of colors/textures were you thinking?   \n   \nI bet you could do a GNARLY version in 3D, either using some sort of software like Studio Max or simulating the look in Illustrator.\n\n"
    },
    {
      "time": "31 Jul 2002 — 8:59am",
      "content": "Superb concept.   \nBut I think legibility (and not \"readability\", guys :-) might be more important here that we might like to pretend, assuming the logo has to stand alone and actually convey a name to the regular Joe (which Pemberton is obviously not)...   \n   \nhhp\n\n"
    },
    {
      "time": "31 Jul 2002 — 4:19pm",
      "content": "whoops\n\n"
    },
    {
      "time": "31 Jul 2002 — 4:21pm",
      "content": "john, i want the 3d version of this look like a chunk of tire tread that has some yellow paint on it that makes the logo visible. but heres a more \"legible\" attempt...   \n ![traphik3](http://web.archive.org/web/20131021222830im_/http:/www.typophile.com/forums/messages/29/1905.gif)\n\n"
    },
    {
      "time": "31 Jul 2002 — 4:40pm",
      "content": "Phil, you got 3D skills so maybe the legibility/readability will be enhanced when it looks like ireal tread. Can you show us?   \n   \nHrant, fill us/me in on the difference between readability and legibility. In all seriousness. And essential and non-essential clauses, too. ![:)](http://web.archive.org/web/20131021222830im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nstop dangling your modifiers!   \n   \nbj\n\n"
    },
    {
      "time": "31 Jul 2002 — 5:06pm",
      "content": "My Chinese horoscope sign Monkey, mister. I dangle good.   \n   \nPut simply:   \nLegibility depends on letterforms that are easy to decipher. Readability depends on letterforms that come together to form boumas (word shapes) that are easy to decipher. BTW, the \"style\" of decipherment depends on the reading state (contemplative versus immersive).   \n   \nA couple of real-world implications: legible fonts have bigger x-heights that readable fonts. Sans fonts are more legible but less readable.   \n   \nhhp\n\n"
    },
    {
      "time": "31 Jul 2002 — 5:26pm",
      "content": "makes sense.   \n   \nlechter to clarice: Ethrall me with your acumen.\n\n"
    }
  ]
}
