{
  "id": "14574",
  "title": "New York, New York its a hell of a town…",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "TOO DARN HOT  \nFrom the show \"Kiss Me Kate\" (1948)  \n(Cole Porter)\n\nIt's too darn hot  \nIt's too darn hot\n\nI'd like to sup with my baby tonight  \nand play the pup with my baby tonight  \nI'd like to sup with my baby tonight  \nand play the pup with my baby tonight  \nbut I ain't up to my baby tonight  \ncause it's too darn hot  \nIt's too darn hot  \nIt's too darn hot\n\nI'd like to stop for my baby tonight  \nand blow my top with my baby tonight  \nI'd like to stop with my baby tonight  \nand blow my top with my baby tonight  \nbut I'd be a flop with my baby tonight  \ncause it's too darn hot,  \nit's too darn hot  \nit's too darn hot\n\nI'd like to fool with my baby tonight  \nbreak ev'ry rule with my baby tonight  \nI'd like to fool with my baby tonight  \nbreak ev'ry rule with my baby tonight  \nbut pillow you'll be my baby tonight  \ncause it's too darn hot  \nit's too darn hot\n\n\\*BRIDGE\\*  \nAccording to the Kinsey report  \nev'ry average man you know  \nmuch prefers to play his favorite sport  \nwhen the temperature is low  \nbut when the thermometer goes way up  \nand the weather is sizzling hot  \nMister Adam for his madam is not  \ncause it's too too  \nit's too darn hot, it's too darn hot  \nIt's too too too too darn hot\n\nI'd like to call on my baby tongiht  \nand give my all to my baby tonight  \nI'd like to call on my baby tongiht  \nand give my all to my baby tonight  \nbut I can't play ball with my baby tonight  \ncause it's too darn hot  \nit's too darn hot\n\nI'd like to meet with my baby tonight  \nget off my feet with my baby tonight  \nI'd like to meet with my baby tonight  \nget off my feet with my baby tonight  \nbut no repeat with my baby tonight  \ncause it's too darn hot  \nit's too darn hot\n\nI'd like to coo with my baby tonight  \nand pitch some woo with my baby tonight  \nI'd like to coo with my baby tonight  \nand pitch some woo with my baby tonight  \nbut sister you fight my baby tonight  \ncause it's too darn hot  \nit's too darn hot\n\nAccording to the Kinsey report  \nev'ry average man you know  \nmuch prefers to play his favorite sport  \nwhen the temperature is low  \nbut when the thermometer goes way up  \nand the weather is sizzling hot  \nMister GOB for his squab,  \na marine for his queen  \na G.I. for his cutie-pie is not  \nCause it's too too too darn hot  \nIt's too darn hot  \nIt's too darn hot\n\n",
  "author": "<a href=\"/web/20100815060543/http://typophile.com/user/2203\" title=\"View user profile.\">Dan Weaver</a>",
  "time": "<br>",
  "uid": "2203",
  "comments": [
    {
      "time": "",
      "content": "We've had more than enough 90º + degree days this summer\n\n"
    },
    {
      "time": "",
      "content": "\\>Mister GOB for his squab,\n\nPlease explain...\n\n"
    },
    {
      "time": "",
      "content": "Nick for that one I think we need Old Nick, Norbert or Chris to help out. There are at least two other variants on the lyrics of this tune.\n\n"
    },
    {
      "time": "",
      "content": "My friend Google, who seems to know everything, says that GOB was once slang for a sailor, which makes sense in the context of the song.\n\n"
    },
    {
      "time": "",
      "content": "Bingo.  \nGOB=sailor  \nBut I've never seen it written out, and have no idea what the initials G-O-B stand for. _Gone On Board_... just a wild guess.\n\nMeanwhile, Boston is baking beans right out on the street.  \nBut as they say, it's not the heat, it's the HUMDITITY which is 70+.\n\n------------------------------------------  \nYes, I'm old, but I sweat in style!\n\n"
    },
    {
      "time": "",
      "content": "\"Gob\" is an expression for mouth. It has been used by James Joyce and many others. Perhaps it means eating the squab is something your mouth will enjoy as in \"thanks to your mouth for allowing you to eat squab.\"\n\nChrisL\n\nPS: Temperature rising above the usual Hades-in-a-steam-bath in DC--going to the beach for the week and hoping Fenwick Island is more comfortable.\n\n"
    },
    {
      "time": "",
      "content": "Name this tune:\n\n_She certainly can can-can!_\n\n"
    },
    {
      "time": "",
      "content": "Heatwave\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "as in Oyving Boilin :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "_temperature rising above the usual Hades-in-a-steam-bath in DC_\n\nI just got back to NJ from DC. Both are too darned hot, but most buildings in DC are nicely air-conditioned. In fact, at the National Museum of the American Indian, it was too cold!\n\n"
    },
    {
      "time": "",
      "content": "AC in DC is A MUST because muggy summers are normal here.  \nThe Museum is new, give it a few years.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "The first air conditioned building in Washington DC was the Capitol Building, specifically the House and Senate chambers.\n\n"
    },
    {
      "time": "",
      "content": "The difference between NY and DC is that DC apartments actually have central air, you're lucky to find one of those places here in New York. The coolest room in my apartment reads 80 degrees, and that's WITH the AC blowing. San Fran is looking better every day. :)\n\n"
    },
    {
      "time": "",
      "content": "Have some chowder in a bread bowl for me man and sit and watch the sea lions honk :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Nothing different in Philly, hopefully when I move to NYC next month it'll be a little cooler!\n\n"
    },
    {
      "time": "",
      "content": "It's been in the 70s for the last couple of days in St. Paul. New York usually gets our weather a few days later. Enjoy.\n\n"
    },
    {
      "time": "",
      "content": "Gob a sailor in the U.S. Navy (Websters Dictionary)\n\nWhat is used commonly in crossword puzzels is (Tar) a sailor\n\nMark, today 85º about 70% humidity (chance of rain) maybe we will get your weather tomorrow 75º chance of rain\n\n"
    }
  ]
}
