{
  "id": "14581",
  "title": "Favorite Designer Fonts Under 30 Bucks!",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "I'm strapped for cash but i need to build a larger designer font toolbox.  \nI was wondering which fonts are your favorite 'value' fonts?\n\nI've been enjoying creampuff a lot & Deftone Stylus. They're very sexy fonts & free  \n(well for non-commercial uses i think)\n\n",
  "author": "chrisjleenet",
  "time": "13 Aug 2005 — 1:27pm",
  "uid": "6261",
  "comments": [
    {
      "time": "13 Aug 2005 — 1:34pm",
      "content": "Are you looking for single fonts that each cost under $30? Almost every PostScript or TrueType format font on [http://www.linotype.com](http://web.archive.org/web/20130621094758/http:/www.linotype.com/ \"http://www.linotype.com\") costs less than $30, and quite a high percentage, I think, of fonts at [http://www.myfonts.com](http://web.archive.org/web/20130621094758/http:/www.myfonts.com/ \"http://www.myfonts.com\") are the same.\n\nOr do you want a package of fonts that costs $30 all together? That isn't quite realistic(although every month, Linotype has a value pack of five fonts around a certain theme that costs $30).\n\n"
    },
    {
      "time": "13 Aug 2005 — 1:38pm",
      "content": "I like Creampuff a lot (here is a [link](http://web.archive.org/web/20130621094758/http:/desktoppub.about.com/library/fonts/hs/uc_creampuff.htm) at about.com). [Deftone Stylus](http://web.archive.org/web/20130621094758/http:/desktoppub.about.com/library/fonts/hs/uc_deftonestylus.htm) is similar, but not as successful, in my opinion. Are you looking for more fonts like these, or just great fonts in general? (In the case of the later, you might want to be more specific about your intended uses, so we can offer a better gauged answer)\n\n"
    },
    {
      "time": "13 Aug 2005 — 1:38pm",
      "content": "A lot of free- and shareware fonts are of dodgy quality, but there are of course the exceptions that confirm the rule, and some reputable foundries have free fonts as well (sometimes for a limited amount of time). Please keep in mind that quite a few of those dodgy freeware fonts are actually rip-offs of legit commercial fonts and are hurting the type designers and the type industry in general, so be careful what you use. For example Creampuff is an illegal pirated copy, a big no-no in my book. Deftone Stylus is pretty safe.\n\nI have been thinking of building an archive of legit quality freeware fonts for this board, but I fear this won't be received very well by people who actually have to make a living out of designing fonts. :^/ What do other people think?\n\n"
    },
    {
      "time": "13 Aug 2005 — 1:41pm",
      "content": "Didn't we, at one time, have a resource area? We did have a listing of places to download free fonts but it was locked so as to keep people from adding to it.\n\n"
    },
    {
      "time": "13 Aug 2005 — 1:42pm",
      "content": "I think your time is better spent elsewhere.  \nIt's not like you're bored, are you? :-)\n\nhhp\n\n"
    },
    {
      "time": "13 Aug 2005 — 1:44pm",
      "content": "I forgot to add something _very_ important: even with freeware fonts -- or especially? -- **always read the license agreement**. Some are licensed for unlimited use, some only for private use but not for commercial jobs. You don't want to take advantage of the kindness and generosity of the people who designed them; it's _really_ bad for your karma. And you don't want to risk that, do you?\n\n"
    },
    {
      "time": "13 Aug 2005 — 1:47pm",
      "content": "I think **reading the license agreement, aka Font EULA** is something that needs to be taken as part of the font licensing process.\n\n"
    },
    {
      "time": "13 Aug 2005 — 1:47pm",
      "content": "_Creampuff is a an illegal pirated copy, a big no-no in my book_\n\nWait a minute. Really? The about link says it is from Nick Curtis, a newer poster here. Is it a rip-off of Nick's work? Or…\n\nOK, Chris, listen to Yves! He is right, of course. With anything free, you always have to do your homework.\n\nBut I count asking around on Typophile as doing your homework ;-)\n\n"
    },
    {
      "time": "13 Aug 2005 — 1:53pm",
      "content": "First ones to spring to mind are the [MACRhino](http://web.archive.org/web/20130621094758/http:/www.macrhino.com/) freebies Hattrick SCOSF, Kerning Unicase, Stylish SCOSF and Montessori Script. The first three are single weights of early designs that [Stefan Hattenbach](http://web.archive.org/web/20130621094758/http:/www.typophile.com/wiki/Stefan%20Hattenbach) retired because he thinks they compare unfavourably to his more recent work.\n\n"
    },
    {
      "time": "13 Aug 2005 — 1:55pm",
      "content": "I downloaded the font from About.com… The font's copyright reads Nick Curtis, but it seems that another party has converted it to TrueType format… that might explain why the curves are so bad (the curves are quite bad, the points just wack…).\n\nThen I went to Nick's site. His free fonts are on Font Freak. I downloaded \"Creampuff\" from there, and its the same font file! Same copyright info, same troublesome point situation.\n\nWhat's the scoop Yves?\n\n"
    },
    {
      "time": "13 Aug 2005 — 1:58pm",
      "content": "Dan, You may want to compare 'Creampuff' to ' [Eclat](http://web.archive.org/web/20130621094758/http:/www.fonts.com/findfonts/detail.htm?pid=405832)', _by [Doyald Young](http://web.archive.org/web/20130621094758/http:/www.typophile.com/wiki/Doyald%20Young)_.?\n\nDav, [formlos](http://web.archive.org/web/20130621094758/http:/www.formlos.net/)\n\n"
    },
    {
      "time": "13 Aug 2005 — 1:58pm",
      "content": "There has always been a lot of discussion about Creampuff, and I might have come off too strong, so sorry about that. Although we appreciate Nick Curtis' work reviving all those great vintage styles, in the case of Creampuff somebody ought to do a comparison on Bézier-point level. Let's just say the jury is still out on that one.\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:00pm",
      "content": "Yves, I just found images of all of the Hattenbach fonts online, and they aren't anything like Creampuff. Have you looked at Creampuff? It is sort of a retro script face. The Hattenbach faces aren't scripts at all.\n\n?\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:01pm",
      "content": "I know for a fact that [Doyald Young](http://web.archive.org/web/20130621094758/http:/www.typophile.com/wiki/Doyald%20Young) isn't exactly very happy with Creampuff...\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:01pm",
      "content": "Thanks Dav, those two are very similar.\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:05pm",
      "content": "_Yves, I just found images of all of the Hattenbach fonts online, and they aren’t anything like Creampuff._\n\nWell, that's what happens when a seemingly virgin thread starts filling up with posts like mad! :^D\n\nI was starting my list of favourite freefonts, but with all the other posts popping up inbetween mine, it got all confusing. I never meant to say the Hattenbach freebies look like Creampuff, really, althought it might seem that way in the new context. ;^)\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:08pm",
      "content": "Sorry, my post-volume on this thread is probably bothersome. I get what you were trying to say now. Sorry for the confusion.\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:09pm",
      "content": "_Back on topic.:_ Chris, You may find some quality [_Free_ Fonts](http://web.archive.org/web/20130621094758/http:/www.identifont.com/free-fonts.html) listed at IdentiFont.:  \n_\\> [www.identifont.com/free-fonts.html](http://web.archive.org/web/20130621094758/http:/www.identifont.com/free-fonts.html)_\n\nOr these [Value Packs](http://web.archive.org/web/20130621094758/http:/www.myfonts.com/ValuePacks) and [Special Offers](http://web.archive.org/web/20130621094758/http:/www.myfonts.com/Promotion), at myFonts.:  \n_\\> [www.myfonts.com/ValuePacks](http://web.archive.org/web/20130621094758/http:/www.myfonts.com/ValuePacks), [www.myfonts.com/Promotion](http://web.archive.org/web/20130621094758/http:/www.myfonts.com/Promotion)_\n\nDav, [formlos](http://web.archive.org/web/20130621094758/http:/www.formlos.net/)\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:09pm",
      "content": "So, to continue my list, the best grunge freefonts _ever_ are to be found on [Eduardo Recife](http://web.archive.org/web/20130621094758/http:/www.typophile.com/wiki/Eduardo%20Recife)'s [Misprinted Type](http://web.archive.org/web/20130621094758/http:/misprintedtype.com/v3/fonts.php) rebirth 3.0.\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:13pm",
      "content": "Then, if you like a modern slender and sleek sexy sans, you know you want [Heinrich Lischka](http://web.archive.org/web/20130621094758/http:/www.typophile.com/wiki/Heinrich%20Lischka)'s [Samba](http://web.archive.org/web/20130621094758/http:/fontboutique.de/).\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:17pm",
      "content": "i found one i liked today at chank [newcastle](http://web.archive.org/web/20130621094758/http:/chank.com/freefont_detail.php?sku=1095) from [chank](http://web.archive.org/web/20130621094758/http:/www.typophile.com/wiki/chank). this could be a derivative work tho? what's the consensus?\n\nalso, the free silverware from [www.fontdiner.com](http://web.archive.org/web/20130621094758/http:/www.fontdiner.com/ \"www.fontdiner.com\") have always been some of my favorites.\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:19pm",
      "content": "_I think your time is better spent elsewhere.  \nIt’s not like you’re bored, are you?_ :-)\n\nActually Hrant, I'd rather direct people to legit free stuff so maybe they might learn to appreciate good quality type and move to commercial fonts later on, than have them scour the internet, fill up their hard drives with the most foul garbage and stick with that. Perception is everything baby! ;^)\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:24pm",
      "content": "_i found one i liked today at chank newcastle from chank. this could be a derivative work tho? what’s the consensus?_\n\nLooks like Kevin Hayes had some fun with [Fette Fraktur](http://web.archive.org/web/20130621094758/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=LH.107979.0.1&attributes.sampleSize=48&sampleText=newcastle&sampleSize=48&attributes.paraSize=14&paraSize=14)... :^/\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:31pm",
      "content": "Although there are [seemingly legit typefaces](http://web.archive.org/web/20130621094758/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=GF.112180.0.3&attributes.sampleSize=48&sampleText=ITC+Veljovic%3F&sampleSize=48&attributes.paraSize=14&paraSize=14) that have [a dubious history](http://web.archive.org/web/20130621094758/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=EF.116678.0.1&attributes.sampleSize=48&sampleText=ITC+Veljovic%21&sampleSize=48&attributes.paraSize=14&paraSize=14) as well. A lot of the fonts from the grunge boom in the 90s suffer from that.\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:38pm",
      "content": "Personally, I promote free fonts only if they nicely fill a strong need.  \nExample: Gentium.\n\nhhp\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:40pm",
      "content": "_Looks like Kevin Hayes had some fun with Fette Fraktur… :^/_\n\nthat's what what i was afraid of.\n\nalso, i noticed chank is having a sale and had to get [nomadic egyptian](http://web.archive.org/web/20130621094758/http:/chank.com/font_detail.php?sku=5550) for $10!\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:40pm",
      "content": "_Personally, I promote free fonts only if they nicely fill a strong need._\n\nFair enough, but that's only because you are the Ayatollah of Type. I don't mind a bit of frivolity, some quirks and even redundancy. :^D ;^P\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:42pm",
      "content": "when's gentium pro going to get release? maybe i should volunteer to help out with that...\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:43pm",
      "content": "I guess that's not as bad as \"Font Fuhrer\".\n\nhhp\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:47pm",
      "content": "_\\> I guess that’s not as bad as “Font Fuhrer”._\n\nHey, _I'm_ not the one making references to nazis on an occasional basis! :^D ;^P\n\n_Awww, that was mean of me Hrant. But you know I like you, I truly do. That's the sole reason I feel entitled to take the piss out of you for just this once._\n\n"
    },
    {
      "time": "13 Aug 2005 — 2:50pm",
      "content": "Whoa, this thread got bumped to 4th place in the \"Hottest\" list on the front page within the hour. Crikey!\n\n"
    },
    {
      "time": "13 Aug 2005 — 3:07pm",
      "content": "Ayatolla isn't half bad, actually. And you can even provide the dome.\n\nhhp\n\n"
    },
    {
      "time": "13 Aug 2005 — 3:36pm",
      "content": ":^D\n\n"
    },
    {
      "time": "13 Aug 2005 — 3:56pm",
      "content": "_Looks like Kevin Hayes had some fun with Fette Fraktur… :^/_\n\nIs that, ummm, fast food type design ? How do you in good faith release derivative works like that?\n\nI guess CHANK doesn't have a very good rep for a reason, eh ?!\n\nI really really really want to use an interobang !!!\n\n"
    },
    {
      "time": "13 Aug 2005 — 4:09pm",
      "content": "I think your time is better spent elsewhere.  \nIt’s not like you’re bored, are you? :-)\n\n@hrant - I was actually looking for fonts that were on sale; I'm willing to pay for good fonts; i'm just looking for some good deals.\n\nWhen i'm not a broke college student i'll definately be able to afford full scale commercial fonts; we're all artists here.\n\n"
    },
    {
      "time": "13 Aug 2005 — 4:20pm",
      "content": "I like the [Cape Arcona](http://web.archive.org/web/20130621094758/http:/www.cape-arcona.com/) fonts they seem to be on sale too.\n\ni also like the idea of wiki/open collaboration of fonts would be very cool since i would like to learn from others how to create better fonts.\n\n"
    },
    {
      "time": "13 Aug 2005 — 4:50pm",
      "content": "For display don't forget [TypeCo](http://web.archive.org/web/20130621094758/http:/www.typeco.com/)\n\nOh and don't forget [P22](http://web.archive.org/web/20130621094758/http:/www.p22.com/) which has several different libraries available now. Their fonts are all reasonably priced.\n\n"
    },
    {
      "time": "13 Aug 2005 — 7:26pm",
      "content": "_\"I think reading the license agreement, aka Font EULA is something that needs to be taken as part of the font licensing process.\"_\n\nNot to play devils advocate here, but when was the last time one of you actually read the intire -- or even partial -- EULA for the OS that you are using? When you upgraded to OSX and XP PRO, did you take the hour and a half to read the EULA, or did you just scroll to the bottom and 'hit next'.\n\n_Can we not be honest with ourselves?_\n\nThe reality is NO ONE (with the occasional exception of one of us \"type people\") will read the EULA. If designers/foundries wish to make 'certain points' of these EULAs known, they are going to have to take a more non-traditional approach.\n\nI won't even touch on the subject of ridiculous restrictions like PDF embedding. (yeah, I said ridiculous).\n\n(sorry if I have taken this off topic)\n\n"
    },
    {
      "time": "13 Aug 2005 — 7:52pm",
      "content": "Kyle, please go to this thread -- [The End User's Manifesto](http://web.archive.org/web/20130621094758/http:/typophile.com/node/14264) -- and share your feelings with us. I am interested in what you have to say.\n\nNo you are right though. However, the licenses for software, for instance Adobe's CS, are much more difficult to violate though. Especially now that they have all of that fancy stuff built in that can actually detect if another person on the network is using the same serial number.\n\n"
    },
    {
      "time": "13 Aug 2005 — 7:53pm",
      "content": "I'll add that foundries could make it a total pain in the kiester for us, I mean if they wanted to. Consider again Adobe CS. They have now added an activation key. Even creating a new user on my machine, because the other user went haywire, I had to re-activate the license. What if foundries started doing that to us?\n\n"
    },
    {
      "time": "13 Aug 2005 — 8:19pm",
      "content": "The only time I read an EULA is when somebody  \npoints out something preposterous in one.\n\nhhp\n\n"
    },
    {
      "time": "13 Aug 2005 — 8:40pm",
      "content": "Thanks Yves for the free typeface links, I'm always interested to check out 'quality' free faces to see how they compare!\n\n"
    },
    {
      "time": "13 Aug 2005 — 9:53pm",
      "content": "_\"What if foundries started doing that to us?\"_\n\nWhat if Adobe wanted to charge us \"extra\" to be able to send our indesign/photoshop/illustrator files to the printer?\n\nI see the activation and anti-piracy issues as an occasional nusance -- nothing more.\n\n_\"I’ll add that foundries could make it a total pain in the kiester for us\"_\n\nVery true.\n\nMy major issues are with single seat and pdf embedding.\n\nIf I cant embed a font in a PDF, it is USELESS to me -- and my clients. The foundries that make me jump through hoops (purchase additional/supplimental licenses) to embed fonts in PDFs, are the foundries that will not get my firms business.\n\nOn a more positive note, I think the Village's EULA is PERFECT.  \n(Congrats Chester)\n\nI will got post on that thread now, and hopefully bring this back on track... ...so, fonts 'for sale?' -- has anyone seem many font sales?\n\n"
    },
    {
      "time": "13 Aug 2005 — 10:22pm",
      "content": "An archive of (mostly) blackletter.\n\nAlthough not exactly the highest quality, still very usefull.  \n [http://moorstation.org/typoasis/designers/steffmann/index.htm](http://web.archive.org/web/20130621094758/http:/moorstation.org/typoasis/designers/steffmann/index.htm \"http://moorstation.org/typoasis/designers/steffmann/index.htm\")\n\n"
    },
    {
      "time": "14 Aug 2005 — 12:57am",
      "content": "_Spam.:_ Chris, If you are seeking slightly experimental, trendy, technoish designer display types, as well, you may want to take a look at ' [( formlos ) PlayR](http://web.archive.org/web/20130621094758/http:/www.formlos.net/formlosTF/PlayR)'.? :)  \n_( Which happens to be on sale, as well.. )_\n\nDav, [formlos](http://web.archive.org/web/20130621094758/http:/www.formlos.net/)\n\n"
    },
    {
      "time": "14 Aug 2005 — 2:17am",
      "content": "Chris,\n\nYou might want to check out the [Indie Fonts](http://web.archive.org/web/20130621094758/http:/www.typophile.com/wiki/Indie%20Fonts) books... They're available at the [P22 site](http://web.archive.org/web/20130621094758/http:/www.p22.com/indiefonts/index.html) for $34.95, or you can try your luck on eBay or elsewhere online and you might be able to get yours for $30. I bought mine signed from [Joe Kral](http://web.archive.org/web/20130621094758/http:/www.typophile.com/wiki/Joe%20Kral).\n\nThe books come with a CD with a bunch of fonts... plus the books are really awesome in themselves! So I'd recommend trying these out.\n\n"
    },
    {
      "time": "14 Aug 2005 — 3:45am",
      "content": "Chris you should (by now) be able to find the Indie Fonts books at your local library.\n\n"
    },
    {
      "time": "15 Aug 2005 — 12:42pm",
      "content": "A couple of things (geez, take a weekend off, and you miss all kinda stuff)...\n\n**Creampuff** is indeed based on Eclat (I acknowledged that fact when my website carried my freeware), but it was **completely** redrawn, and several characters were redesigned (the original lowercase \"r\" sucks, IMHO, and there were a few other \"problems\" I corrected). As far as permitted uses, as long as the fonts is not resold AS A FONT, it can be used for personal or professional (paid) projects.\n\nAnd, if anyone's interested, I have about 20 copies of _Indie Fonts 2_ that I'll part with -- PLEASE READ THIS CAREFULLY -- for $25 postpaid to the US; $30 postpaid to Canada, or $32 postpaid anywhere else in the world. Drop me a note [here](mailto:himself@nicksfonts.com) if you'd like one.\n\n"
    },
    {
      "time": "14 Mar 2006 — 9:31am",
      "content": "For the sake of the record, an [alternate 'r'](http://web.archive.org/web/20130621094758/http:/www.typophile.com/node/9957) existed in the Image Club release of Eclat.\n\nAlso: [http://typophile.com/node/18520](http://web.archive.org/web/20130621094758/http:/typophile.com/node/18520 \"http://typophile.com/node/18520\")\n\n"
    }
  ]
}
