{
  "id": "14597",
  "title": "international corporate identity",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Dear Typophile,\n\nThe logotype will be used in the Corporate ID design for an international business consulting company, that will start a targeted advertising campaign in most western countries by the end of Q4. Looking forward to your comments and ideas.\n\n",
  "author": "<a href=\"user/8779\" title=\"View user profile.\">Anton</a>",
  "time": "<br>",
  "uid": "8779",
  "comments": [
    {
      "time": " 15 August, 2005 - 5:01am",
      "content": "Hello Anton and welcome to Typophile. I hope you enjoy your stay here.\n\nI like your word! I think i’ve heard it before ;o) I’m curious though, what kind of business will Expantium provide?\n\nOne typeface just sprung to mind and its FF’s OLSEN LF… I think its a beautiful font, that combines a classical and modern feeling (which I think is a really difficult task).\n\nTake a look at it!\n\n[http://www.identifont.com/show?2LX](http://web.archive.org/web/20060522215945/http:/www.identifont.com/show?2LX)\n\nAnd good luck Anton\n\nMark,  \nCopenhagen Denmark  \n(Ajax-fan as it is)\n\n"
    },
    {
      "time": " 15 August, 2005 - 6:54am",
      "content": "\\> _I would like to learn how to emphasize its expressive power via the use of an extraodinarily well-chosen typeface._\n\nHello Anton,\n\nAs I understand it, your intent is to express the (non-)word “EXPANTIUM” without the use of any graphical elements and without any modification or modulation of the selected typeface.\n\nWhy are you limiting yourself?  \nI can understand if you have given yourself a personal challenge to find what seems like the “right typeface,” but I fear that even AFTER you have made the decision, you may be haunted with the notion that you are “not sure if that’s absolutely the right one.”\n\nWhat do I mean? There will always be a typeface that you have missed (digitized or not), and even if you have seen them all there are NEW ones created all the time. It may even be that a contrast of typeface weights or a combination of more than one type family may provide the best solution.\n\nSelecting typefaces to be used in graphic design, and creating a unique logotype are completely different challenges. You may not be aware of this, but even logos that appear to be using only a typeface, may be in fact MODIFIED, even slightly. Even after a logo has been created, it may be necessary to modify or update the look when appropriate.\n\nSample: Resurection of the [**ATARI brand**](http://web.archive.org/web/20060522215945/http:/www.brandequity.com/frame_communications1.htm) (look just at the letterforms).\n\nAsk yourself if your personal challenge of using only ONE UNMODIFIED typeface is more important than finding an exceptional expression of “EXPANTIUM.” Even the sound of the word begs a dynamic and not static use of letterforms.\n\nPlease understand that I am not diminishing your intent. I just want you and other readers to understand that creating a unique identity is NOT solely the task of finding the “right typeface.”\n\n"
    },
    {
      "time": " 15 August, 2005 - 7:02am",
      "content": "Hi Mark,\n\nThanks. The services that Expantium offers are in the area of planning and opinion research. For more, visit the website of expantium.\n\n"
    },
    {
      "time": " 15 August, 2005 - 7:24am",
      "content": "Formally speaking,\n\nThe word Expantium is derived from the base word “expand”.\n\nI also noticed you have the typeface set in caps and kerned  \nwide.\n\nIt appears, you are correlating the visual with the verbal.\n\nYou might want to avoid such a 1 to 1 approach because, it  \nwould be like using a “chop suey” typeface to describe an  \nAsian restaurant — corny, and not clever.\n\n"
    },
    {
      "time": " 15 August, 2005 - 7:46am",
      "content": "Dear Norbert,\n\nThank you for the right-on-the-mark review and clear advice.\n\nBest regards.\n\n"
    },
    {
      "time": " 15 August, 2005 - 8:34am",
      "content": "Anton,\n\nFrank Lin’s (Caboume) suggestion bears merit in avoiding the obvious treatment of extended typefaces.\n\nDavid Berlow’s revival and expansion of Morris Fuller Benton’s Agency Gothic might provide a unique treatment using the typeface alone.\n\nI have been trying to find a type vendor’s site where my suggested treatment can be seen without you re-inputting the characters, but for now look here:\n\n[AgencyFB Family](http://web.archive.org/web/20060522215945/http:/www.fontbureau.com/fonts/AgencyFB)  \nNote the alternate cap “M”  \nThere are a variety of weights, but one of the condensed faces can give a visual message of “reaching for the heights” as opposed to expressing width.\n\n[AgencyFB Regular Condensed](http://web.archive.org/web/20060522215945/http:/www.myfonts.com/fonts/fontbureau/fb-agency/agencyfb-regularcondensed/charmap.html)  \nBoth caps and lowercase offer possibilities, but I think carefully letterspacing E-X-P-A-T-I-U-M using the alternate “M” might be closer to what you are looking for.\n\nJust my suggestion, Anton.  \nGood luck.\n\nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 15 August, 2005 - 10:02am",
      "content": "Dear Norbert,\n\nThank you for these excellent references.\n\n"
    },
    {
      "time": " 15 August, 2005 - 2:10pm",
      "content": "Anton, I hate to harp on useage but I will. A knocked out logo at small sizes can fill-in so you might need to develop a logo that works when not knocked out. The current type and spacing when set as type in small sizes will fall apart (visually). Once again this isn’t a type design problem but a Corporate Idenity problem and needs more research and feedback (focus groups?). I don’t have any emotional response to the name, maybe if it were attached to a service or product. I was once asked to do a review of the RubberMaid logo. My suggestions included testing the shape around the logo, the RubberMaid red and the typeface independantly. The idea was to see what elements were important in the CI, not just the elements like the typeface.\n\n"
    },
    {
      "time": " 16 August, 2005 - 11:38am",
      "content": "Anton, I am a _big_ fan of the URW Craw Modern Regular, production issues aside. However, my first response, before visiting your site, was ‘high-end men’s clothier’. Not sure if this influences your decision. Expanded, wide-set, all caps type is an earmark of high fashion and luxury because it communicates: “we can afford the space to luxuriate it”. So much so, in fact, that [two enterprising young type designers even created a hyper-exclusive (read: “expensive”) font set based on that concept/aesthetic](http://web.archive.org/web/20060522215945/http:/www.orangeitalic.com/luxury/).\n\nRegardless, I agree with the others here who encourage looking at your production needs and also considering a custom logotype. I like the aesthetic as it stands, particularly if classic, high-end, and somewhat conservative is your goal.\n\n"
    },
    {
      "time": " 16 August, 2005 - 4:20pm",
      "content": "Dear Crugen,\n\nYou very well sensed this particular aspect in expantium’s positioning. Thanks for the high-quality advice.\n\n"
    },
    {
      "time": " 16 August, 2005 - 9:33pm",
      "content": "Consider Quadraat Sans Regular or Bold all caps.\n\n[Sample 1](http://web.archive.org/web/20060522215945/http:/www.myfonts.com/fonts/fontfont/ff-quadraat-sans/regular/testdrive.html?s=E+X+P+A+N+T+I+U+M&p=72)\n\n[Sample 2](http://web.archive.org/web/20060522215945/http:/www.myfonts.com/fonts/fontfont/ff-quadraat/small-caps/testdrive.html?s=e+x+p+a+n+t+i+u+m&p=72)\n\n[Sample 3](http://web.archive.org/web/20060522215945/http:/www.myfonts.com/fonts/fontfont/ff-quadraat-sans/bold/testdrive.html?s=E+X+P+A+N+T+I+U+M&p=48)\n\nHéctor\n\n"
    },
    {
      "time": " 17 August, 2005 - 7:14am",
      "content": "“_Your reference to the luxury font is highly interesting and from The Netherlands (Holland is a sobre place where luxury is sometimes considered as a sin) I express my gratitude for this, wherever you live on earth. I will contact the foundry for a sample._”\n\nYou’re welcome.\n\nThe Netherlands is one of the best countries in the world for both quality and innovation in type design, so you’re in the right place to find great type and type designers. The aesthetic you’re seeking may not be part of the culture there, as you noted, but you could easily find a very skilled foundry to create some custom type for a logotype or even an entire custom typeface for you. This is, for many, the ultimate signifier of a completly distinct brand identity.\n\nHere are a few lists:  \nhttp://www.dutchtype.org/foundries.html  \n [http://www.myfonts.com/country/nl/](http://web.archive.org/web/20060522215945/http:/www.myfonts.com/country/nl/)\n\nYour concept of “gold-tech” is very interesting. You seem to have a clear image of what you want and the ability to articulate it, which could feed a strong creative brief for a type project. Though your appreciation of the new UPS logo is likely to draw some criticism from designers, who tend to disdain it. : )\n\nIf you go with the original you posted, Norbert’s suggestion about letterspacing is, as usual, a good one. The current spacing is slightly uneven across the word. Fortunately there are no major sins, but it should be immaculate, particularly for something like this. Also, size it down to about 25% (not an uncommon size for on-screen use) and determine whether it’s still working for you. The thinner strokes begin to close up, which might call for a custom on-screen drawing for small sizes or a typeface with a heavier light stroke.\n\n"
    }
  ]
}
