{
  "id": "14593",
  "title": "Page Layout Class",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "This is not strictly typophiliac but I would like to promote this class of mine:\n\nNeed to learn QuarkXPress for your job? Need to update your page layout skills?\n\nIf you enjoy online communities, this online class maybe just the thing for you! Under the guidance of a caring instructor with over ten years of experience with QuarkXPress, you will work on individual and group projects, on your own time!\n\nThere is no less expensive or more thorough instruction in QuarkXPress available in the Bay Area.\n\nFor more informaion about the class, please read [this page](http://web.archive.org/web/20080409024857/http:/fog.ccsf.edu/~aconger/99aonline.html).\n\nTo apply at CCSF (free!), go [here](http://web.archive.org/web/20080409024857/http:/www.ccsf.edu/Offices/Matriculation/step1.htm).\n\n(Face-to-face classes are also available. See the full schedule of graphics classes [here](http://web.archive.org/web/20080409024857/http:/www.ccsf.edu/Schedule/Fall/graphic_communications.html). Classes start 8/17/05)\n\n [‹ Beck Mono](http://web.archive.org/web/20080409024857/http:/www.typophile.com/node/14618 \"Go to previous forum topic\") [RIP David Loeb Weiss ›](http://web.archive.org/web/20080409024857/http:/www.typophile.com/node/14611 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080409024857/http://www.typophile.com/user/1629\" title=\"View user profile.\">abecedarienne</a>",
  "time": "<br>",
  "uid": "1629",
  "comments": [
    {
      "time": " 15.Aug.2005 2.45pm",
      "content": "Abe, could you have cut it closer. You post this class two days before the first class is given. Why didn’t you post this class in June? I mean give yourself some lead time. Now that its late, post when you have other classes in the making, so a potential student can PLAN to attend your group.\n\nAnother thought, you might also add an InDesign class to your group.\n\n"
    },
    {
      "time": " 15.Aug.2005 5.59pm",
      "content": "Dan,\n\nI understand your point about giving students lead time. For some, this an issue, for some, it is not.\n\nJust to clarify: the first meeting is on **Saturday** , not Wednesday. The second - and last - meeting is in Decemeber. This is an **online** class. Both meetings are optional.\n\nTo answer your question, I didn’t think I’d **have** to advertise! I am a little low on students. But actually, I have advertised earlier, just not here.\n\nAnd to answer the second point, we will have a complete InDesign class very soon. Currently, we have an “InDesign for QuarkXPress Users” class (which is face-to-face).\n\nThanks for your interest,\n\nAmy\n\n"
    }
  ]
}
