{
  "id": "14608",
  "title": "First \"Critique Thursday\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "To help revive the type sections of the Typophile Critique Forum (and as my first official moderator shin gig), I'd like to inaugurate a trial **»Critique Thursday«** this Thursday, August 18th.\n\nThe critiquing will take place right here on Typophile, from 1–3 pm Eastern Standard Time (that should be 10 am–12 noon in California, 19:00–21:00 in Central Europe, etc.).\n\nI'll select one thread from each typeface style sub-section within the critique forum for special critique. That thread will have its name changed, just like marked threads in the Type ID forum. Everyone is invited to send some time in the alloted time slot checking out those threads and making great suggestions.\n\nI haven't selected any types yet. If anyone has suggestions, just e-mail 'em to me. Self promo is ok ;-)\n\n",
  "author": "dan_reynolds",
  "time": "15 Aug 2005 — 11:42am",
  "uid": "1085",
  "comments": [
    {
      "time": "15 Aug 2005 — 12:04pm",
      "content": "Are you soliciting fonts in progress, or is this limited to existing threads? In the spirit of self-promotion, I'd be happy to offer either my [Century Catalogue](http://web.archive.org/web/20131015124451/http:/typophile.com/node/5985) (now very close to completion) or [Christian Gothic](http://web.archive.org/web/20131015124451/http:/typophile.com/node/9245).\n\n"
    },
    {
      "time": "15 Aug 2005 — 12:16pm",
      "content": "Raph, it certainly isn't limited to existing threads, but existing threads will be selected if nothing new and (as) exciting presents itself. Do you have a favorite of the two, or one that might elicit more critique discussion and less discussion discussion?\n\n"
    },
    {
      "time": "15 Aug 2005 — 1:05pm",
      "content": "Great idea, Dan. You might end up having your hands full. ;-)\n\n"
    },
    {
      "time": "15 Aug 2005 — 6:42pm",
      "content": "Excellent idea, I'll give this a bump. I won't be much help in the critiques, but I may poke my head in and check it out!\n\n"
    },
    {
      "time": "15 Aug 2005 — 6:55pm",
      "content": "Can't wait!\n\nI wonder if we need to:  \n1) Offer some more incentive(s). Maybe the font's designer could choose a person as having been \"the most helpful\" at the end of the session, and that person gets a Typophile shirt? (If so, it'd be a shame that I already have too many shirts to really be motivated myself, but hey. :-)  \n2) Limit the number of fonts \"on air\", like maybe to two.\n\nBTW, I nominate this: [http://typophile.com/node/14419](http://web.archive.org/web/20131015124451/http:/typophile.com/node/14419 \"http://typophile.com/node/14419\")\n\nhhp\n\n"
    },
    {
      "time": "18 Aug 2005 — 6:32am",
      "content": "so when's this goin down? what's the dealy-o?\n\n"
    },
    {
      "time": "18 Aug 2005 — 6:40am",
      "content": "Paul, it's goin down in three plus hours. There is no delay-o. But, I'll have the threads changed in an hour or so, and I will post them here for those of us who are impatient ;-)\n\n"
    },
    {
      "time": "18 Aug 2005 — 7:04am",
      "content": "Paul (and everyone else), please visit [http://typophile.com/node/14678](http://web.archive.org/web/20131015124451/http:/typophile.com/node/14678 \"http://typophile.com/node/14678\") for this week's list!\n\n"
    },
    {
      "time": "18 Aug 2005 — 11:08am",
      "content": "Sweet!\n\n"
    },
    {
      "time": "18 Aug 2005 — 12:04pm",
      "content": "So, what's the word on critique Thursday… now that the two-hour time span has \"officially\" ended?\n\nAnother one next week?\n\nFuture critique Thursdays may not have \"one\" rep. from each category… some categories are used less than others, and some sorts of designs may need more assistance and others. I dunno… any feelings?\n\n"
    },
    {
      "time": "18 Aug 2005 — 12:14pm",
      "content": "Well, I think we got more crits that we would have otherwise; and people will certainly pay some more attention to those highlighted fonts for a short while after it has ended now. But I was hoping for more. You don't think an extra incentive is a good idea?\n\nhhp\n\n"
    },
    {
      "time": "18 Aug 2005 — 12:56pm",
      "content": "i'm disappointed there weren't more players. but it's good to see there are still some people you can count on to make constructive comments. are a lot of people just not in today?\n\n"
    },
    {
      "time": "18 Aug 2005 — 1:24pm",
      "content": "Very sorry I missed it. Don't give up, it will eventually take off.\n\n"
    },
    {
      "time": "18 Aug 2005 — 1:49pm",
      "content": "Dan, could you post time zone times, I just glossed over the times and missed the first one.\n\n"
    },
    {
      "time": "18 Aug 2005 — 2:11pm",
      "content": "I thought it was great to be pointed to some of the best stuff out there. That alone is valuable.\n\nIt will be interesting to see how it plays out over several weeks. I suspect the quantity the quantity is too high and that focusing on one per category may be too many.\n\n"
    },
    {
      "time": "19 Aug 2005 — 1:01pm",
      "content": "I was away on vacation. Where is the thread for yesterday's critique?\n\nChrisL\n\n"
    },
    {
      "time": "19 Aug 2005 — 2:06pm",
      "content": "Sorry, I wasn't home during the critiques.\n\n"
    },
    {
      "time": "24 Aug 2005 — 11:04am",
      "content": "i too was away from the forum for much of last week, and missed the event. bummer.\n\nbut i agree with joe, that for a two-hour period, one pick from each font category might be a bit much.\n\n"
    },
    {
      "time": "24 Aug 2005 — 11:21am",
      "content": "Well, I'm still glad that I was able to shed so much light on so many fonts in so little time, but going forward, it just won't be practical to highlight one font per category: some categories have way less fonts in them.\n\nSo, tomorrow ( [http://typophile.com/node/14813](http://web.archive.org/web/20131015124451/http:/typophile.com/node/14813)), I'm only going to feature two fonts.\n\nHere's some discussion I most definitely would like some feedback on: post numbers.\n\nI've received several requests from designers wanting their fonts to be selected for critique, which is great. But some of those fonts have a lot of posts on their threads already (one even has 70+). I'd much rather pick out fonts that have gotten less attention… I think that Critique Thursday would be of more benefit to those designers than to others who have already gotten a lot of feedback from the usual suspects (posters like Paul and Hrant, without whom, there really wouldn't be much of a critique forum to discuss). Of course we want as many people to post, but I think that is more likely to happen if so much hasn't been covered yet.\n\n???\n\nAnd to Hrant's suggestion about prizes: I think that is a great idea, but I also don't think that we are ready for something like that yet. There needs to be much more volume of posting, I think, and some real \"objective\" judging process. And prizes. I don't have any toys yet to give away… :(\n\n"
    },
    {
      "time": "24 Aug 2005 — 11:23am",
      "content": "Chris, last week's threads can be seen [here](http://web.archive.org/web/20131015124451/http:/typophile.com/node/14678).\n\n"
    }
  ]
}
