{
  "id": "14621",
  "title": "most common repeating character sets",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Having just discovered that making random characters appear within a range of alternates isn’t supported by typesetting software, I’ve now resigned myself to making a large set of contextual alternates, and faking it.\n\nDoes anyone know if there is any common knowledge of the most common repeating sets of two characters in the english language?\n\nthanks!\n\n",
  "author": "dux",
  "time": "16 August, 2005 - 3:16am",
  "uid": "2193",
  "comments": [
    {
      "time": " 16 August, 2005 - 5:10am",
      "content": "- Most common two letter combinations - TH, HE, AN, IN, ER, RE, ES, ON, TI, AT\n- Most common three letter combinations - THE, AND, HAT, ENT, ION, FOR, TIO, HAS, TIS\n- Most common doubled letters - LL, TT, SS, EE, PP, OO, RR, FF, CC, DD, NN\n- Most common two letter combinations that show up as reversals of themselves - ER RE, ES SE, AN NA, ON NO, TI IT, EN NE, TO OT, ED DE\n\n…or so the folks who make cryptograms say.\n\n"
    },
    {
      "time": " 16 August, 2005 - 7:57am",
      "content": "nice one oldnick ;)\n\n"
    },
    {
      "time": " 16 August, 2005 - 8:26am",
      "content": "\\> Having just discovered that making random characters  \n\\> appear within a range of alternates isn’t supported by  \n\\> typesetting software\n\nI guess some application developers thought that having a document being typeset differently and completely reflow each time the user opens it or goes to a next page and back wouldn’t be such a good idea…\n\nA.\n\n"
    },
    {
      "time": " 16 August, 2005 - 9:31am",
      "content": "Here’s some data I once manually compiled based on the “famed” Kucera & Francis (AKA Brown) corpus, roughly arranged in “clumps” of frequency:\n\n—\n\nll\n\nee  \nff  \ngg  \noo  \nss  \ntt\n\nnn  \npp  \nrr\n\nzz\n\n—\n\nhhp\n\n"
    },
    {
      "time": " 16 August, 2005 - 9:51am",
      "content": "\\> I guess some application developers thought that having a document being typeset differently and completely reflow each time the user opens it or goes to a next page and back wouldn’t be such a good idea…\n\nInteresting that it was completely rejected rather than built in as an option. After all, it is something that requires user input, be that installing a font, or ticking a box for alternates. I hope to see this in the future, as I feel it opens up a world of possibilities.\n\nI assumed this on-the-fly chaos was how those dutch chaps ran their Beowolf font — now I guess they applied code to an existing font in production, and just output several versions. Or perhaps they built a little bespoke engine? At the end of the day those who build typesetting software are unwittingly restricting creativity, so good on them if this was the case.\n\nThanks for that hrant. I found a solitary pdf on said subject, but it doesnt look like something my brain, currently operating on basic motor skills, is capable of digesting without some serious homework. Cheers again.\n\n"
    }
  ]
}
