{
  "id": "14653",
  "title": "Fonts for Logos and Video Games",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was wondering if I could get some tips from anyone who would know where to find some really good fonts for something like a Logo or a Video Game.\n\nany help would be well appreciated.\n\n:D\n\n",
  "author": "spook",
  "time": "17 Aug 2005 — 10:14am",
  "uid": "8832",
  "comments": [
    {
      "time": "17 Aug 2005 — 10:18am",
      "content": "For the interface or the advertising?\n\n"
    },
    {
      "time": "17 Aug 2005 — 10:22am",
      "content": "both possibally.\n\nWe haven't made the game yet, it is still in design.  \nBut, whatever you can help me with would be great\n\n"
    },
    {
      "time": "17 Aug 2005 — 10:24am",
      "content": "If you have adobe illustrator (and know how to use it or know someone who can show you), just take some text, expand it, and rearrange or distort it to your liking. I usually come out with a cool logo that way.\n\n"
    },
    {
      "time": "17 Aug 2005 — 10:28am",
      "content": "Well, Half-Life 2 uses [FF DIN](http://web.archive.org/web/20131115042952/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=FF.9467.0.0) for its interface.\n\nCan you be more specific? Fonts can say just about anything. What do you want them to say?\n\n"
    },
    {
      "time": "17 Aug 2005 — 10:28am",
      "content": "thx, I think once I get my computer fixed and get Illustrator re-installed then I will try that.\n\n"
    },
    {
      "time": "17 Aug 2005 — 10:34am",
      "content": "well, I was thinking about using it for this wresltling game that is in the making.  \nI was wanting to go for a tough, macho-type feel, but I am out of ideas.\n\n"
    },
    {
      "time": "17 Aug 2005 — 10:35am",
      "content": "sorry about your computer. good luck and all....\n\nDo you want to purchase a font or do you want a free one...because I don't think that you will be able to use most free fonts for your game because of royalties and copyrights and whatnot...\n\n"
    },
    {
      "time": "17 Aug 2005 — 10:36am",
      "content": "its cool, Thx\n\nwell, I was trying to buy some fonts.\n\nI know about the royalties though.\n\n"
    },
    {
      "time": "17 Aug 2005 — 10:42am",
      "content": "Ok then, just be careful in your search for fonts. And good luck.\n\n"
    },
    {
      "time": "17 Aug 2005 — 10:47am",
      "content": "<cite>just take some text, expand it, and rearrange or distort it to your liking.</cite>\n\nOh dear.\n\n"
    },
    {
      "time": "17 Aug 2005 — 10:55am",
      "content": "\\> just take some text, expand it, and rearrange or distort it to your liking.\n\nAnd make sure you don't show it around here.\n\nWrestling: I assume you mean the lucha libre stuff, not Greco-Roman. In which case you might consider Motter Corpus.\n\nhhp\n\n"
    },
    {
      "time": "17 Aug 2005 — 11:07am",
      "content": "\\> Wrestling: I assume you mean the lucha libre stuff, not Greco-Roman. In which case you might consider Motter Corpus.\n\nI think Lithos would work in both cases.\n\nBut, seriously if you're looking to include the font or a derivative in your game (say for UI use) you'll need to work out licensing rights with the font owner. I've not seen a standard off-the-shelf EULA that allows distribution of fonts or derivatives with games.\n\nIf the font is going to be used to generate a static bitmap logo then almost any font will do - almost all EULAs allow you to make complete logos and redistribute them in bitmap form with products like games.\n\nMore info on the type of game may help us guide you towards some good font choices. Are you looking for fonts with rivets?\n\nCheers, Si\n\n"
    },
    {
      "time": "17 Aug 2005 — 11:13am",
      "content": "Spook, I think you'll be able to find some great typefaces that would suit your needs for an identity and/or interface, without resorting to the destruction of something else, (not to say that this method doesn't work for some people). There are a lot of questions to be answered first in order to give a proper recommendation. What kind of game is it?\\*  \nI have looked at a lot of new game promos recently, and much of what I have seen in the logos don't exactly fit a distorted, or even a grunged out aesthetic. Many of the darker games are using [Blackletter](http://web.archive.org/web/20131115042952/http:/www.typophile.com/wiki/Blackletter), and I see a lot of clean, sans serifs being used for war-based games and fantasy RPGs. I guess I just hate to see game design fall into such a generic style.\n\n\\*sorry, I missed the Wrestling part earlier\n\n"
    },
    {
      "time": "17 Aug 2005 — 11:17am",
      "content": "And think of some of the [most established game logos](http://web.archive.org/web/20131115042952/http:/www.doom3.com/) and [most popular series](http://web.archive.org/web/20131115042952/http:/www.macsoftgames.com/products/halo/MacSoft-Halo.html): all custom type.\n\n"
    },
    {
      "time": "17 Aug 2005 — 12:05pm",
      "content": "well these all seem like good fonts, yeah It lucha libre.\n\nI was actually thinking of using the Motter Corpus, I think the logo would probably be a little like Rockstar games and Altar. Maybe I just want a really sharp clean logo but still hard and heavy.\n\nbut yeah what would EULA be?  \nit is short for something right?\n\n"
    },
    {
      "time": "17 Aug 2005 — 12:06pm",
      "content": "Hey, what about Amplitude?\n\nhhp\n\n"
    },
    {
      "time": "17 Aug 2005 — 12:19pm",
      "content": "[EULA](http://web.archive.org/web/20131115042952/http:/www.typophile.com/wiki/EULA) = End User License Agreement.\n\n"
    },
    {
      "time": "17 Aug 2005 — 12:32pm",
      "content": "Would [Knockout](http://web.archive.org/web/20131115042952/http:/www.typography.com/catalog/knockout/index.html) just be lame...or just right?\n\nMaybe not enough personality and too much boxing association.\n\n"
    },
    {
      "time": "17 Aug 2005 — 1:12pm",
      "content": "\\>And think of some of the most established game logos and most popular series: all custom type.\n\nI think this has always been true for game logos - probably because they're almost never flat single color affairs - there's almost always some texture, effects, lens-flare or similar going on. Back when I was in games we had airbrush artists do the logos, often basing the designs on stuff in the letraset catalogs. Nowdays it's all Photoshop?\n\nCheers, Si\n\n"
    },
    {
      "time": "17 Aug 2005 — 1:35pm",
      "content": "_\"If you have adobe illustrator (and know how to use it or know someone who can show you), just take some text, expand it, and rearrange or distort it to your liking. I usually come out with a cool logo that way.\"_\n\nI honestly just cried. I certainly hope this is a bad case of sarcasm-to-post miscommunication. If not, well...\n\n_\"thx, I think once I get my computer fixed and get Illustrator re-installed then I will try that.\"_\n\nPlease don't. I am assuming this is a serious game devlopment project, if so, I wouldn't think you would hire your mom to create your 'next generation particle effects algorithms'.\n\nHire a professional.\n\n"
    },
    {
      "time": "18 Aug 2005 — 9:22am",
      "content": "thx everyone, You all have been a big help.\n\nThough I did like all of the font segustion I think I might would like to step more to the Motter Corpus.\n\nAtleast for the Game, though the logo to me is a little more harder to figure out.\n\nI would have liked to see the Blackletter is sounds real familar.\n\nI would like to let everyone know, that I am now thinking I would like to find a font the puts more focus on the \"W\" since that to me in a abrv. toward wrestling.\n\nThx for all the advise it has helped me alot.  \n:D\n\n"
    },
    {
      "time": "19 Aug 2005 — 12:10am",
      "content": "Sorry for posting off topic slightly, but this wouldn't happen to be for the Pro Wrestling X project would it?\n\n"
    },
    {
      "time": "20 Aug 2005 — 9:41am",
      "content": "When in doubt hire a designer. Preferably one that knows type.\n\nIf you want it done for free, offer them sex or alcohol. That usually does the trick.\n\nFYI: Every time someone stretches a letter for no logical reason, somewhere in the world, a typographer drops dead.\n\n"
    },
    {
      "time": "20 Aug 2005 — 11:22am",
      "content": "Lithos is way too femenine for this. Thick and bold slab serifs, thunders and flames. muajaja.\n\nHéctor\n\n"
    },
    {
      "time": "20 Aug 2005 — 11:34am",
      "content": "Greco-Roman Wrestling = lithos?\n\n"
    },
    {
      "time": "20 Aug 2005 — 11:40am",
      "content": "\\> Lithos is way too femenine\n\nEven if it's Greco-Roman wrestling in chain-mail bikinis, in mud?\n\nhhp\n\n"
    },
    {
      "time": "20 Aug 2005 — 1:12pm",
      "content": "Four words: Zena the Warrior Princess\n\n"
    },
    {
      "time": "20 Aug 2005 — 10:00pm",
      "content": "Should have thought of this earlier...\n\n[http://images.google.com/images?q=wrestling+logo&hl=en&btnG=Search+Images](http://web.archive.org/web/20131115042952/http:/images.google.com/images?q=wrestling+logo&hl=en&btnG=Search+Images \"http://images.google.com/images?q=wrestling+logo&hl=en&btnG=Search+Images\")\n\n[http://search.msn.com/images/results.aspx?q=wrestling+logo&FORM=SSIN](http://web.archive.org/web/20131115042952/http:/search.msn.com/images/results.aspx?q=wrestling+logo&FORM=SSIN \"http://search.msn.com/images/results.aspx?q=wrestling+logo&FORM=SSIN\")\n\nLooks like the Adobe Illustrator distortion school of logo design, is slightly out numbered by the Corel Draw fit-to-curve-fake-small-caps tribe.\n\nSi\n\n"
    },
    {
      "time": "21 Aug 2005 — 4:06pm",
      "content": "Si,\n\nLOL, great post.\n\n"
    }
  ]
}
