{
  "id": "14662",
  "title": "Type Specimens & Eye",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Here is another topic I hope to expand in the [Typographic Edumacators](http://web.archive.org/web/20090803213341/http:/typophile.com/forum/16) topic area after additional research and illustrations.\n\nI’ve been searching through many of the topic threads concerning type specimens, both online and in print. Typically, users are looking for a way of making visual comparisons between type styles in order to select or match typefaces for a particular project. Online representations are generally adequate enough for most decisions, but completely inadequate for close scrutiny required in order to make highly sophisticated typographic comparisons.\n\nThere are many distinctions that can be made by close inspection of printed specimens (including magnified scrutiny using a printer’s lupe — wow, an antique item nowadays). For this thread, I am focusing on only one of several aspects that may be useful for educating graphic design students about typography.\n\n**Type Scaling — Display vs. Text design within the same family.**  \nYounger designers may be familiar with typefaces, but few are aware of the many subtle design adjustments made to hot metal typefaces in developing a range of point sizes to span small to mid-sized text, 18 pt — 48 pt ranges, to larger display sizes. Is this significant anymore, perhaps no. But scaling issues encountered when using a single digital font never even enters the minds of younger designers today.\n\nI have just put together a very quick illustration which in time will be expanded with sharper scans, more samples and better source files. For now, I invite you just to examine the concept.\n\n[Eric Gill’s _The Four Gospels_ comparitive sample.](http://web.archive.org/web/20090803213341/http:/www.acmedigital.net/JianSabu/gill_specimen.htm)\n\nAll I’ve done so far is pulled a sample jpg from [RIT’s Gary Collection](http://web.archive.org/web/20090803213341/http:/wally.rit.edu/cary/cc_db/20th_century/7.html). The first four levels of point sizes are tagged and the bottom samples show characters from the respective line. The jpg sample was then scaled up detailing the cap W and N. Obviously the best way to make a visual comparison is to make a high res scan of the actual printed piece then scale to match x-heights. But the idea is character widths and subtleties of stroke, serifs, etc., have been modified by Gill for each point size in order to be more harmonious to the form. Better illustrations to follow.\n\n",
  "author": "<a href=\"/web/20090803213341/http://typophile.com/user/7764\" title=\"View user profile.\">Norbert Florendo</a>",
  "time": "<br>",
  "uid": "7764",
  "comments": [
    {
      "time": " 17.Aug.2005 2.49pm",
      "content": "You are an invaluable resource to this community Norbert.  \nMany thanks.\n\nEric\n\n"
    },
    {
      "time": " 17.Aug.2005 3.35pm",
      "content": "BTW — one of the reasons why I selected Eric Gill’s _The Four Gospels_ is because there is a wealth of information on his work with [The Golden Cockerel Press](http://web.archive.org/web/20090803213341/http:/desktoppub.about.com/gi/dynamic/offsite.htm?zi=1/XJ&sdn=desktoppub&zu=http%3A%2F%2Fwww.itcfonts.com%2Fulc%2Farticle.asp%3FnCo%3DAFMT%26sec%3Dulc%26amp%3Bissue%3Darticles%26art%3Dericgill), his initial trials and questions about designing typefaces, issues about scaling mathemetically and photographically, and the revival of the Golden Cockerel typefaces by the International Typeface Corporation. All of this makes for a very interesting story (at least for me) in the hopes that students might learn about the deeper mysteries of typography.\n\nOther issues related to examination of printed type specimens include:\n\n- High-res output vs. screen resolution\n- Better sense of “type color” of text blocks\n- Details for making decisions between one vendor’s version vs. another\n- Subtleties of letterform lost in small point size samples\n- and any other ideas you care to contribute\n\n——————————————————————-  \nYes, I’m old, but I’m back in style!\n\n"
    }
  ]
}
