{
  "id": "14677",
  "title": "Piracy?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Someone please correct me if I'm wrong, but this website _\\*URL removed by moderator\\*_ seems to be distributing some commercial fonts for free. Shouldn't someone take action on this?\n\n",
  "author": "<a href=\"/web/20101015062416/http://typophile.com/user/1844\" title=\"View user profile.\">Miguel Sousa</a>",
  "time": "<br>",
  "uid": "1844",
  "comments": [
    {
      "time": "",
      "content": "Ummmm, whoa... Yeah, there does seem to be a little something not quite right about this.\n\n"
    },
    {
      "time": "",
      "content": "Yep, a quick check shows that these are the real stuff (Linotype Aroma has the original copyright notice...). I think the lawyers have to be let loose by LinoType, Adobe, ....\n\n_\\*server information removed my moderator\\*_\n\n"
    },
    {
      "time": "",
      "content": "The DNS is textdrive.com\n\nThat doesn't mean it's being hosted by them, but I'm sure if you emailed textdrive they'd be quick to delete the DNS record (FYI, textdrive is a great web host if you need one...)\n\n"
    },
    {
      "time": "",
      "content": "Oddly enough, Linotype are one of the google ads at the bottom of the page.\n\nMe thinks this may be a promotional gig, I wouldn't be surprised if the fonts were \"donated\" by the bigger companies to increase awareness...\n\nSeems a bit too blatant to be a pirate, no?\n\n{n.a–b}  \nest.1971\n\n"
    },
    {
      "time": "",
      "content": "The ad is probably generated automatically by an ad service a la GoogleAds. I don't think this is a Linotype gig.\n\nThis is exactly the sort of site that chafes my hide raw. goodfonts.org is hugely popular, probably the most-bookmarked font site on [del.icio.us](http://web.archive.org/web/20101015062416/http:/del.icio.us/search/all?search=fonts) (see \"essential fonts\") and constantly linked at \"design\" weblogs as an \"awesome resource\". Font archives like goodfonts.org that mask themselves as legitimate can deal a significant blow to the industry that underground piracy never can. They turn an uneducated public into unwitting pirates. The notion it breeds: \"If I can freely download gobs of professionally made font families from the web, why should I ever pay for a font?\"\n\n"
    },
    {
      "time": "",
      "content": "We really need to make an effort not to post URLs which direct others to sites containing fonts for download illegally. The best thing you can do when you find such sites is to e-mail the people whom you know which work at the foundries. Or, you can e-mail me as I'm in touch with some of the larger foundries in regards to this issue. Please edit your posts and remove the URLs. Thank you.\n\n"
    },
    {
      "time": "",
      "content": "I dunno Tiff. This one is so widespread it makes more sense at this point to call it out as illegal than to pretend it doesn't exist. The problem here, I think, is that the most folks know the site (or find it with Google) but they don't realize it's illegitimate.\n\nI do agree on your other point. The foundries _should_ be notified, for sure.\n\n"
    },
    {
      "time": "",
      "content": "Yes, I realize that. But why have the URLs here on Typophile when we don't support it?\n\n"
    },
    {
      "time": "",
      "content": "Having the URLs here on Typophile in this context, within a discussion on what's **wrong** with font piracy, is probably a good thing.\n\nAt least someone looking for free fonts who stumbles upon the link _here_, stands a good chance of thinking twice before trundling ahead and downloading pirated work...\n\n{n.a–b}  \nest.1971\n\n"
    },
    {
      "time": "",
      "content": "_At least someone looking for free fonts who stumbles upon the link here, stands a good chance of thinking twice before trundling ahead and downloading pirated work…_\n\nMore likely, \"Hey, these type nerds are arguing about some site that has free fonts. Hey, wait--free fonts!? \\<click\\>\"\n\n"
    },
    {
      "time": "",
      "content": "Instead of beating the 6-feet-under horse that is discussion of piracy, let's crit:  \n [http://typophile.com/node/14678](http://web.archive.org/web/20101015062416/http:/typophile.com/node/14678 \"http://typophile.com/node/14678\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "<cite> &gt; At least someone looking for free fonts who stumbles upon the link here, stands a good chance of thinking twice before trundling ahead and downloading pirated work…</cite>\n\nThis is a very good point. We can sway them with guilt, er, I mean by educating them.\n\nI see your point Tiff, and agree that we don't want to steer anyone down the wrong path (the path of evil! «Insert echo here»). However, I believe that there is a benefit to having the URLs posted, at least within discussions such as this (vs a collection of sorts that could potentially act as a resource for free font hunters), as a means of creating awareness – awareness within the type design community and also the general design community, those utilizing the fonts. It is so easy to take advantage of Google for these types of searches and it is probably the first step taken anyway, so I don't see any harm in the link being here.\n\n"
    },
    {
      "time": "",
      "content": "<cite>The best thing you can do when you find such sites is to e-mail the people whom you know which work at the foundries. Or, you can e-mail me as I’m in touch with some of the larger foundries in regards to this issue.</cite>\n\nSorry. I'll remember to do that next time.\n\n"
    },
    {
      "time": "",
      "content": "Mike don't apologize. Please.\n\nI suppose I'm trying to keep temptation from out of everyone's path. Which is, of course, in itself a completely unrealistic thing to do. If you are tempted by something and want it badly enough you won't stop looking until the so-called itch has been scratched. So to speak.\n\nAs I posted previously I did have second thoughts. But, obviously I didn't pause long enough. It comes down to trust. If we had a wiki full of \"evil sites not to visit\" would it become a bad thing? Or would it be educational. There isn't a black or white. I know that it would be used for evil and good. Gray is my color today.\n\nFor the record, I wasn't the moderator in this instance. I did ask for Mike to remove the URL and didn't intend to remove it. Well, not today anyway. But, I would have done it eventually.\n\nHow can we approach this? Putting it in the uppercase would be like preaching to the converted. Should there be a wiki? A wiki specific to sites that are wide-spread already but that need to be pointed out as bad?\n\nI am in agreeance. Sorry, my moderator hat was on a little too tight. Let's do something about this.\n\n"
    },
    {
      "time": "",
      "content": "sorry if i was a little trigger-happy. i'm still new at this moderator gig. i guess i need to follow tiff's lead on things like this still.\n\n"
    },
    {
      "time": "",
      "content": "In your view, is the FontSite selection kosher?\n\n"
    },
    {
      "time": "",
      "content": "The other concern is that, whether it's piracy or not, the folks who are being accused of piracy might sue the poster and/or Typophile itself for defamation/libel. Although I can't get into details, this sort of thing has happened before.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Tiffany was right the first time, Thomas is right, please don't link to pirated sites here. Find the biggest, most powerful foundry (heh, powerful) whose fonts are pirated on the site you find and report it to a contact at that foundry. Word will rapidly spread to the right people at the smaller foundries affected. That's just how it needs to be done. It sucks, but you learn some things the hard way. Perhaps the typophile posting guidelines should be updated.\n\nThe above is my opinion (I have no authority here, I'm just a user) but I do have some experience with this issue.\n\n"
    },
    {
      "time": "",
      "content": "\"Yes, I realize that. But why have the URLs here on Typophile when we don’t support it?\"\n\nTalking about something doesn't mean you support it.\n\nI find the removing of the URLs to raise more suspicions than the actual subject of the thread (in general).\n\n"
    },
    {
      "time": "",
      "content": "Allow me to hem and haw. Is that the right phrase?\n\nFirst. I don't take back my stating that education is important. Very important.\n\nThis topic went to bed with me and haunted my dreams. Call me paranoid. We have had a few ugly instances on Typophile in which I have had to archive and delete entire threads because of threats, veiled and otherwise, from lawyers, as well as to protect friends and other typophiles.\n\nI think we need to make it a habit and a rule of thumb not to post URLs to sites. However, getting the word out to foundries, for warning, can be done through me if need be. Also, if you have a question about a suspicious site, contact one of the moderators. I am personally involved in a private alert group. This is the best way to get sensitive material shared.\n\nSo, I guess I am retracting my second retraction.\n\n"
    },
    {
      "time": "",
      "content": "Squash the pirate URLs, and squash the pirates. Paul did the right thing. Tiffany has the right idea, but is tender-hearted--a sweet and admirable trait, but in this instance I think digging in the heels to fight the bad guys is the right approach.\n\n"
    },
    {
      "time": "",
      "content": "I think some folks in this thread may not understand the ubiquity of the site in question. Far more know about this site than know about Typophile. del.icio.us is a good indicator of a site's popularity and link volume. The fact that its popularity exceeds that of _any other font site_ -- commercial or free -- shows where the the bulk of the web is going for fonts. It's already out there, and already Google PageRanked up the yizzang. The likelihood that those who are apt to use pirated fonts will discover the site through Typophile is very low. They know about it already.\n\nWe are being naive if we believe this forum can prevent traffic to the site. What we _can_ do, as a body that cares deeply about the craft and industry, is document the problem and educate the public.\n\n"
    },
    {
      "time": "",
      "content": "well it seems that this is clearly illegal. is there no way to quash the site? or get them to remove commercial fonts at least?\n\n"
    },
    {
      "time": "",
      "content": "Stephen hit the nail on the head. I personally don't believe that hiding something is the way to solve the problem. You can't simply act like it doesn't exist. There are always legal ramifications in situations like this, and while its best to not \"defame\" a person's name during a discussion you shouldn't talk about it like its a phantom either.\n\nTo me its no different than telling teens that abstinence is the best choice and expecting them to not have sex. Is that really realistic?\n\n"
    },
    {
      "time": "",
      "content": "What stephen and tbiddy said.\n\n\\*not\\* mentioning the site does \\*nothing\\* to increase awareness of the \\*problem\\*.\n\n"
    },
    {
      "time": "",
      "content": "I don't expect removing the URL from Typophile to stop the traffic on that site. But, it prevents traffic from originating at Typophile. I think discussing the fact that there are sites out there that people need to avoid is good. Posting the URLs so others, those not so in the know -- even if the numbers are huge already thanks to google -- can't say they found the URL on Typophile.\n\nDiscussion is good. URLs are bad.\n\nIf we mention and continue to mention that there are many illicit sites out there perhaps there can be education even still.\n\n"
    },
    {
      "time": "",
      "content": "Typophile is a fragile entity. We don't want to get sued out of existence. Please respect our fears. And abstinence from sex is the best choice, _yo!_\n\n"
    },
    {
      "time": "",
      "content": "\" But, it prevents traffic from originating at Typophile.\"\n\nBut the point is that if you leave the URL here, then people coming here know of the site \\*and\\* know what's wrong with the site.\n\nNow we have this useless thread that doesn't refer to anything specific...how does that benefit anyone?\n\n\"Please respect our fears.\"\n\nFear or paranoia? ;o)\n\n"
    },
    {
      "time": "",
      "content": "It isn't useless as now there is an official stance. On the other hand, aluminum, if we can name you as owner of the URL ... ;^)\n\n"
    },
    {
      "time": "",
      "content": "By the way it isn't paranoia as we've had problems already with previous threads and previous URLs.\n\n"
    },
    {
      "time": "",
      "content": "and akshully... i didn't remove all of the url instances... it's in here once more but there's no link attached, so i left it. (in stewf's first post) so anyone reading along can still know who we're talking about.\n\n"
    },
    {
      "time": "",
      "content": "This might say too much about me ... It might show you how crazy I am ... but I actually woke up thinking about EULAs and Piracy. It occurred to me that another way we could approach this is to create a list of trusted freeware/shareware font sites. No?\n\n"
    },
    {
      "time": "",
      "content": "\"The other concern is that, whether it’s piracy or not, the folks who are being accused of piracy might sue the poster and/or Typophile itself for defamation/libel\"\n\nReally? why is that?\n\n"
    }
  ]
}
