{
  "id": "14706",
  "title": "Hanging punctuation",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm having a lot of trouble with getting people to understand the importance of hanging bullets and punctuation. I'm pretty good at talking about design, but for some reason I keep hitting a wall on this topic. The strongest opposition to them is that \"not used to seeing hanging bullets, they look like an error.\"\n\nCould anyone help me out with some talking points and logic so that I can make a good argument for them?\n\nthanks,  \nRandy\n\n",
  "author": "oest",
  "time": "19 Aug 2005 — 7:44am",
  "uid": "8462",
  "comments": [
    {
      "time": "19 Aug 2005 — 8:10am",
      "content": "Hanging stuff is often indeed taken so far that it looks wrong. To me, putting quotes completely outside the paragraph block is a design affectation. The reason to hang puctuation is to reduce gaps; causing a proportional black spec in the other direction is not a solution. So there has to be balance, visually. Basically, people aren't even supposed to notice anything is going on at all, much less bother to form opinions that it's \"right\" or \"wrong\".\n\nhhp\n\n"
    },
    {
      "time": "19 Aug 2005 — 8:13am",
      "content": "There are a few threads that tackled this subject.\n\nJason's [A Typographer's Checklist](http://web.archive.org/web/20130426170611/http:/typophile.com/node/12883) reviews several refinements in detail.\n\nNick Shinn's [DigginIt (pdf)](http://web.archive.org/web/20130426170611/http:/www.shinntype.com/Assets/Depts/Essays/DigginIt.pdf) in inspirationally informative for typographers.\n\nHanging puctuation has several levels of implementation and means different things to different designers. All forms of punc refinement was integral to the \"house style\" when I was in charge of advertising at Compugraphic/Agfa Type Division many years ago. We were trying to impress the high-end typography market, so all of the work had to be exemplary.\n\nI rarely see such diligence of this level in today's print, and yes, most consider it to be a violation as opposed to a refinement.\n\n---------------------------------------------  \nYes, I'm old, that's why my punc is hanging!\n\n"
    },
    {
      "time": "19 Aug 2005 — 8:17am",
      "content": "\\> _Basically, people aren’t even supposed to notice anything is going on at all_\n\nBTW -- Hrant is right, in my opinion.\n\nSo if you do it right, your boss won't even notice. No sense in arguing what is unnoticeable.\n\n"
    },
    {
      "time": "19 Aug 2005 — 8:27am",
      "content": "<cite> Basically, people aren’t even supposed to notice anything is going on at all</cite>\n\nThe problem is that I'm working on a design team where the construction of the project isn't done by me and this is the first time that everyone has heard this request and I'm getting fought on the issue. I'd prefer to do it myself to have total control, but alas my new environment doesn't work that way. So that means I have to make a strong debate. Hence my request here.\n\nThanks for the links, I'll read them soon. But everyone keep the comments coming if you have something to say!\n\n-Randy\n\n"
    },
    {
      "time": "19 Aug 2005 — 8:36am",
      "content": "Arguing with designers is like trying to shoo magpies. Each one defends their right to be there. -- _Kung Pao Cro_\n\nDon't argue!  \nShow them an an award winning example by a highly regarded designer.\n\n"
    },
    {
      "time": "19 Aug 2005 — 8:46am",
      "content": "I'll google around for some!\n\nthanks!  \n-Randy\n\n"
    },
    {
      "time": "19 Aug 2005 — 9:07am",
      "content": "Randy check out [this thread](http://web.archive.org/web/20130426170611/http:/www.typophile.com/node/10368) for an extensive discussion of hanging punctuation.\n\n"
    },
    {
      "time": "19 Aug 2005 — 10:59am",
      "content": "So just a finer question, what about bullets and numbered lists? Should they be hung as well?\n\n-Randy\n\n"
    },
    {
      "time": "19 Aug 2005 — 11:21am",
      "content": "I have to add that the degree to which you hang punctuation is affected greatly by the point size, the typeface, and the final way in which it will be viewed.\n\n"
    },
    {
      "time": "19 Aug 2005 — 11:28am",
      "content": "\\> _what about bullets and numbered lists?_\n\nSome of this is also covered in the links I referenced above.\n\n"
    },
    {
      "time": "19 Aug 2005 — 1:01pm",
      "content": "I was once urged to hang punctuation (in lead of course) to avoid the \"unsightly notch\" left by flushed punc. So I did and the unsightly little dits hanging out in the margin drove me crazy. For my money the world can suffer the notches. I think Hrant is right,too.\n\n\"\"\"\"\"\"\"?Jim!\"\"\"\"\"\"\"\n\n"
    },
    {
      "time": "20 Aug 2005 — 8:07am",
      "content": "Gutenberg Bible hangs hyphens, but they're much lighter in weight, and hyphens hang on the right side, which is usually not the dominant edge of a paragraph (but it could be).\n\nI think hanging looks great in headlines, callouts, quoting poetry, or some other special type treatment (which is almost always in larger type sizes). However, with regular text sizes, just because of the shape of the character, you either have a space going in or a mark going out. It's anyone's opinion as to which is the stronger line. If one can ignore the mark, why not ignore the space?\n\nEven in larger text sizes for paragraphs, say a children's book or information for elderly, you usually won't need to hang punctuation. The example below is an extreme case of what could happen with quotes. In 13 pt text (ugh) I increased paragraph indents from my usual em to 15 pts, so that the indents stand out when quote marks on following lines or quotes at the beginning of following indented lines occur. Even when it's a combo of quote-W, a little kerning is pretty much all you need. There's been times I did hang indents that started with a quote mark, (like the \"Eu in the example) but if you do, just be consistent throughout the entire text.\n\n[quick example (century school infant, not shown at actual size of 13/18)](http://web.archive.org/web/20130426170611/http:/mywebpages.comcast.net/brian912/linked/typoImages/Untitled-1.html)\n\n"
    },
    {
      "time": "20 Aug 2005 — 9:59am",
      "content": "BTW, this is another reason to use [guillemets](http://web.archive.org/web/20130426170611/http:/www.typophile.com/wiki/guillemets).\n\nhhp\n\n"
    },
    {
      "time": "20 Aug 2005 — 10:02am",
      "content": "Very true Hrant, very true…\n\n"
    },
    {
      "time": "20 Aug 2005 — 10:23am",
      "content": "So what do people think of InDesign's \"optical margin alignment\"?\n\n"
    },
    {
      "time": "20 Aug 2005 — 1:14pm",
      "content": "I use it.\n\n"
    },
    {
      "time": "20 Aug 2005 — 2:50pm",
      "content": "By default I keep it turned on and turn it off if it's not behaving right.\n\n"
    },
    {
      "time": "20 Aug 2005 — 3:20pm",
      "content": "In the book I have been setting, I found it immediately improved the spacing of the text in InDesign, with the paragraph composer. For me the 'whiskers' were discrete enough that the gain in better spacing was definitely worth it.\n\nI haven't yet experimented with the 'size' feature in the 'story' dialogue box, where you mark optical margin alighment. I have just set it to the current size of the type, but I will play with it before the final.\n\nIn the earlier thread some people mentioned that em dashes can be a problem. I will have to go through the text and check on all this before the final.\n\n"
    }
  ]
}
