{
  "id": "14701",
  "title": "Er...what is a font?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI am a self-taught graphic designer and I have been lacking some real understanding of typography. I know very little about the history of typography, it's technological evolutions and the rules of best practice. I see the world of typography as being as complicated and unfriendly as the messy font collection we have at work. When I dive into FontAgent at the office, I don't know where the fonts come from, what they where made for and how I can best understand and use them (nor does my boss).\n\nI've been reading some intersting articles on different sites dedicated to type and I've learned quite a lot but I feel there is still a website to make about typography vernacular. The language used is often confusing, contradictory and esoteric. For exemple what is a font? Seems like a silly question since I use the word everyday, but if I think about it I don't really know where the word comes from and what it really refers to. Last night I was reading an advert for the excellent [Enigma](http://web.archive.org/web/20150408084854/http:/www.typography.net/), it read <cite>“Enigma has 3 fonts, 2 wheights, and 4 styles”</cite>. Er... excuse me but I thought that Enigma was the font ?!\n\nAt this point I would like to recommand an article that has really helped me understand some of the fonts I am using at work. [<cite>When typefaces were experimantal</cite>](http://web.archive.org/web/20150408084854/http:/designforum.aiga.org/content.cfm?ContentAlias=%5Fgetfullarticle&aid=1112055) by Paul Shaw is the kind of essential literature for grahic designers to understand where those long lists of fonts in their machines come from. I just wish they were some more of that didactic stuff on the web or in books.\n\nI have a straight question for you, it's probably not the most important but it really bugs me. Why do Herculanum, papyrus and odd fonts like that come standard with my OS X system?\n\nSeb\n\n",
  "author": "sebsan",
  "time": "19 Aug 2005 — 5:12am",
  "uid": "8785",
  "comments": [
    {
      "time": "19 Aug 2005 — 6:13am",
      "content": "Yeah, the language is a mess for a variety of reasons. Here's my understanding of the 'correct' usage:\n\n**[font](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/font)**: refers to the _file_, the data on your machine, the 'font' from which the type springs (so to speak), common usage for 'font' makes it interchangeable with 'type' or 'typeface', even though it's imprecise\n\n**[typeface](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/typeface)**: the literal face of the font, the design. Common usage often makes this refer to the roman, with the implication that the other weights and styles are part of the typeface, which is, again, imprecise.\n\n**[type](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/type)**: refers to characters that use a predetermined design for assembling into words, etc. Also refers to the output (type on a page, etc.), common usage makes it interchangeable with font, but is imprecise.\n\n**[type family](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/family)**: a group of typefaces that have a common design origin/theme\n\n**[glyph](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/glyph)**: a specific visual mark/design, doesn't necessarily carry any meaning or symbological cues\n\n**[letter](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/letter)**: the set of shapes upon which we all loosely agree on that carry certain alphabetic meanings and cues, which can be expressed with different glyphs and typefaces, as long as it shares enough of the commonly recognized shapes that it is recognized as a meaningful symbol, blah, blah, blah, philosophy.\n\n**[character](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/character)**: a printed/displayed/written letter or symbol, refers to the thing without referring to its design attributes (I think)\n\n**[lettering](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/lettering)**: any creation of letters not employing type/fonts (implying that it's done by hand)\n\n**[sort](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/sort)**: a piece of metal type\n\n**[weight](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/weight)**: the visual darkness or lightness of the strokes in a character: ultra light, light, semibold, black, ultrablack, etc.\n\n**[style](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/style)**: an alteration in the design that is distinct but isn't weight-related: italic, roman, regular, text, display, small caps, etc.\n\nThis is my own working understanding of these [terms](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/terminology). There are others here who probably disagree (or know better than I do), and my definitions are meant to be brief, not comprehensive.\n\n\"_Why do Herculanum, papyrus and odd fonts like that come standard with my OS X system?_\"\n\nBecause most people can't see the difference between [Garamond](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Garamond) and [Times New Roman](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Times%20New%20Roman), and selling is about 'perceived value', so more different-looking fonts = value. Also, most people don't have the design mind or skills to add true charater to a layout, so a novelty/display face allows them to 'paint on the aesthetic' with the click of their mouse. The less cynical view: there's a good use for any type (font), and variety is the spice of life.\n\n"
    },
    {
      "time": "19 Aug 2005 — 6:16am",
      "content": "Oof. I realized that there's some strict inconsistencies in there, but I'm not diving headlong into that thicket.\n\n\"Do I contradict myself? Very well, then I contradict myself, I am large, I contain multitudes.\"\n\n– Walt Whitman\n\n"
    },
    {
      "time": "19 Aug 2005 — 6:19am",
      "content": "\"what is a font?\"\n\nI know it's confusing. Part of this comes from incorrect use of terms by the wide assortment of participants, from newbie founders to the aged and beyond...\n\nNo one knows for sure where the word comes from except that it's mostly believed to originated in France, where the idea of a spring of water, was close enough to the ideas that spring from words, I guess, to merit the additional definition of the word...\n\nBut eventually, font came to mean a single size of a single style, remembering that before multiple masters and scaleable outlines, (film aside), a font was metal, or wood, and so it was only good for a single size...\n\nDigital outline font, means a bit more can be done with this new kind of font. Font Family, means a clooection of styles meant to be used in conjunction, like Roman, italic and bold. Font library them means a collection of families and styles... and so on. . .\n\n\"Enigma has 3 fonts, 2 wheights, and 4 styles\"  \nI don;t know what this means either, and I've been around for while. Maybe, it's a marketing ploy to make Enigma enigmatic.\n\n\"Why [...] fonts like that come standard with my OS X system?  \nOriginally, fonts came with OS so you could see the OS, like Chicago, or something. But then, when OS makers wanted to attract broader audiences, they expanded the fonts they \"bundled\" with the OS. Now, the OS folk want certain classes of users, (not graphic designers e.g. but dentists, e.g.), to have all the fonts they needed from the start, to make the documents they needed. So, Herculanum was included for people interested in sharing ideas that felt buried under volcanic ash, or somethin'.\n\nHope that helps...\n\n"
    },
    {
      "time": "19 Aug 2005 — 7:06am",
      "content": "<cite>\"the ‘font’ from which the type springs (so to speak)\"</cite>\n\n<cite>\"it’s mostly believed to originated in France, where the idea of a spring of water, was close enough to the ideas that spring from words, I guess, to merit the additional definition of the word…\"</cite>\n\nOn an etymological side note.\n\nOur \"font\" has nothing to do with the font as in fountain, or spring -- it comes from the French _fondre_ (Lat. _fundere_), to melt. So traditionally, our word \"font\" would refer to the founded metal type set (correct?).\n\n"
    },
    {
      "time": "19 Aug 2005 — 7:07am",
      "content": "Font?\n\nNot to spread any more misinformation than already exists, I will share my understanding of the origin of the term _font_.\n\nAs told to me by several \"old coot\" typesetters (skilled craftsmen who set lines of copy professionally prior to Macs and PostScript), the term _font_ is derived from _fount_ and _foundry_ going back to the manufacture of type using molten metal. The _fount_ was the reservoir or pot of molten [lead/tin/antimony](http://web.archive.org/web/20150408084854/http:/www.bastoky.com/Typo.htm) which was used for casting individual type characters, and eventually complete lines of type (linecasters, Linotype contraction of \"line-of-type\").\n\nType casting referred to the manufacture of typefaces, hence it was often done by metal [foundries](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/foundry). The _font_ then loosely referred to the finish casted _[sort](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/sort)_ of the typeface, which was a SINGLE point size set of individual type characters sufficient enough for composing typical print jobs.\n\nSo, that is the mysterious origin of _font_ as told to me by the errant Knights of [Aldus Manutius](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Aldus%20Manutius)... again, just legend.\n\n-------------------------------------  \nYes, I'm old, mwah-ha-ha!\n\n"
    },
    {
      "time": "19 Aug 2005 — 8:17am",
      "content": "Sebastien, I would highly recommend one pivotal book that will go a long way towards giving you \"comfort\" in the world of type: Alexander Lawson's \" [Anatomy of a Typeface](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Anatomy%20of%20a%20Typeface)\" (although it deals much more with history than dissection).\n\nhhp\n\n"
    },
    {
      "time": "19 Aug 2005 — 9:52am",
      "content": "Another reason terminology gets confusing is because the original defintions were loose to begin with and commonly misused in advertising copy.\n\nHence, a typeface (specific design like \"Neue Helvetica\") might be part of a family (also called \"Neue Helvetica\") which generally follows a convention of weight and style variants.\n\nWeights HAD generally referred to versions created with different [stem](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/stem) thickness (Thin, Light, Medium, Book, Demi, Bold, Extrabold, Heavy, Ultra, 45, 55, 75, etc. are just some common terms used and abused).\n\nStyles HAD generally referred to commonly excepted design variants which maintained visual continuity of look and feel -- though not ALWAYS true - [Italic](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Italic) (though sometimes regarded a \"weight\"), [Oblique](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Oblique), 46, 56, Cursiv, Condensed, 47, 57, Compressed, Expanded, Extended, [Inline](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Inline), Outline, [Handtooled](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Handtooled), Shadow, [Titling](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Titling), [Diplay](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Diplay), [Poster](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Poster), are just a few of the dizzying nomenclature thrown about.\n\nWhen Linotype made [Neue Helvetical Family](http://web.archive.org/web/20150408084854/http:/www.myfonts.com/fonts/linotype/packages/172714/) available in 51 _Styles_ purchasable as a single part number, things really got confusing. What was Helvetica 57 Condensed Oblique? A [Squooshed](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Squooshed) slanted version of 57, or did they really just mean Helvetica 58? It's [Adrian Frutiger's](http://web.archive.org/web/20150408084854/http:/www.fonthaus.com/xheight/typefam.cfm) fault for using those [damned numbers](http://web.archive.org/web/20150408084854/http:/www.fonts.com/AboutFonts/Articles/fyti/TypeFamilies.htm).\n\nDoes a type vendor license typefaces from a type foundry, so they in turn can manufacture a font that the end user can install the font and who license to right actually use the typeface design AND the software technology under a set of legal agreements? Yup, I think that's right.\n\n"
    },
    {
      "time": "19 Aug 2005 — 10:40am",
      "content": "Here's my simple explanation:\n\nYou've got a collection of letters, numbers, symbols, etc. that can be used together to form words, paragraphs, tables, etc.\n\nThe physical embodiment of such a collection (whether it's a case of metal pieces or a computer file) is a **font**.\n\nWhen referring to the _design_ of the collection (the way it looks) you call it a **typeface**.\n\nA **typeface family** or **font family** refers to a related collection of typefaces or fonts.\n\n**Weight** refers to the thickness of the strokes that make up the letters, numbers, etc. of the typeface (light, bold, etc.).\n\n**Style** refers to a distinct design variations within a typeface family (italic, condensed, etc.).\n\n"
    },
    {
      "time": "19 Aug 2005 — 11:41am",
      "content": "A little off topic (but not much):  \nI've always wondered about [Futura Black](http://web.archive.org/web/20150408084854/http:/www.myfonts.com/fonts/itfmecanorma/futura-black/) ever since I saw it in high school. What's the story with the single to double-story \"a\"? Actually, in high school I said, \"Far out. What's up with that, man?\"\n\n"
    },
    {
      "time": "19 Aug 2005 — 11:56am",
      "content": "Start with:\n\n1. Anatomy of A Typeface by Alexander Lawson  \n [The History and Technique of Lettering](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/The%20History%20and%20Technique%20of%20Lettering) by [Alexander Nesbit](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Alexander%20Nesbit) — if you want to have a nice background about letters & typefaces.\n\n2. [The Complete Manual of Typography](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/The%20Complete%20Manual%20of%20Typography) By [James Felici](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/James%20Felici).\n\n"
    },
    {
      "time": "19 Aug 2005 — 12:54pm",
      "content": "When I was serving my apprenticeship during the age of dinosaurs, my ITU lesson books explained pragmatically that \"font\" sprung fom the word \"fount\" (still used today in the UK) meaning a source from which words gushed. It went on to say that a Font is an assemblage of enough letters, punctuation and figures with which to set a collection of words. So I guess I am saying about the same things that Mark has said.\n\nThe smaller the point size, the more characters of each you got; following what was called a \"font scheme\", which meant that you got more a's that z's roughly.\n\nI realize that the common useage of \"font\" today is for the actual stye of the typeface. I have no argument with that. Many terms in current use have come from ancient ones, and even thopught somewhat bastardized they become the modern nomenclature.\n\nA couple of months ago I received a commission to make a simple wordmark for a young art director,and at first was confused becuase she wanted it to be an origianl \"font\". Once we were on the same page everything was OK.\n\nIn my world a font is still a font of so many pounds of lead when I cast fonts for printers and designers, and I've gotten used to calling a digital face a font.\n\nJim\n\n"
    },
    {
      "time": "19 Aug 2005 — 1:40pm",
      "content": "Lost Terminology of the Print Trade  \nWhat does it mean when a pica-thumper is pieing in his case?  \n [Metaltype.co.uk](http://web.archive.org/web/20150408084854/http:/www.metaltype.co.uk/stories/story18.shtml) has a great glossary of old typesetter trade terms.\n\n-------------------------------------------------------------------  \nYes, I'm old, but I'm a Swinger Wayzgoose Nailing on The Stone!\n\n"
    },
    {
      "time": "21 Aug 2005 — 4:52am",
      "content": "\"Our “font” has nothing to do with the font as in fountain, or spring — it comes from the French fondre (Lat. fundere), to melt.\"\n\nyeah yeah yeah. I've heard that one before. So what you're saying is our word for a composition-ready package of type comes from the French \"to melt\"? People, even French people, use words that mean something, so they remember. (Souvenir, by the way was originally drawn for the French Tax Department, according to Ed, remember?). So believe what you will, but I, when all evidence trails off, try my best to make sense. :)\n\n"
    },
    {
      "time": "21 Aug 2005 — 8:19am",
      "content": "\\>make sense\n\nAccording to my Oxford Concise Dictionary, the word Fount (English spelling) and Foundry come from the same French root, 'fondre', which means according to my French dictionary not only 'melt,' mentioned above, but more relevantly 'cast', as in casting a metal statue. So a foundry is a place that casts metal, and a 'fount' or 'font' is a casting of an alphabet in metal. Makes sense to me.\n\n"
    },
    {
      "time": "21 Aug 2005 — 9:02am",
      "content": "I guess the 'old coot' typesetters weren't pulling my leg after all.  \nHmmmm... I better get rid of those type lice before I pull the furniture from the chase.\n\n"
    },
    {
      "time": "21 Aug 2005 — 9:23am",
      "content": "Don't lounge on that chase without the keys or you will be locked up for improper use of furniture :-)\n\nChrisL\n\n"
    },
    {
      "time": "21 Aug 2005 — 10:40am",
      "content": "Yeah, but you'll have the 'quoins' for your trouble.\n\n"
    },
    {
      "time": "21 Aug 2005 — 10:54am",
      "content": "Good one William :-)\n\nChrisL\n\n"
    },
    {
      "time": "22 Aug 2005 — 3:02am",
      "content": "Interesting thread. Perhaps Typophile.com could organise a Typography 101 for us newbies...\n\n"
    },
    {
      "time": "22 Aug 2005 — 4:40am",
      "content": "Alexei,  \nWe are hoping to expand the \" [**Typographic Edumacators**](http://web.archive.org/web/20150408084854/http:/typophile.com/forum/16)\" topic thread to include not only suggestions for educators of design and typography classes, but also to include information useful to students and newbies.\n\nFor now, try the TypoWiki section for detailed and specific type info, and of course, ask questions -- that's how these topics get started.\n\n--------------------------------------------  \nYes, I'm old, but not too old to learn!\n\n"
    },
    {
      "time": "22 Aug 2005 — 8:19am",
      "content": "Writing to the Typophile community is the best thing I've done for my graphic design career in a long time.\n\nI am not sure how the TypoWiki works though. Often the the links take me to an empty entry field.\n\n"
    },
    {
      "time": "22 Aug 2005 — 8:23am",
      "content": "sebsan if there is a red \"w\" superscript to the right of a wiki link it means the page is empty either because it was just created by making the link to it or because no one has gotten around to filling it in yet.\n\n"
    },
    {
      "time": "22 Aug 2005 — 7:56pm",
      "content": "I've just completed cutting Eastern and Western dialect Cree matrices in 14 point from a new design of my own. The problem I now have aside from being completely illiterate in the language is how to font it. In other words a font count (scheme). Does anyone have any idea where a person can find such numbers? I have scoured the Aboriginal councils and various bodies, but have come up with nothing.\n\nAny lead would be appreciated.\n\nJim\n\n"
    },
    {
      "time": "22 Aug 2005 — 8:33pm",
      "content": "_Perhaps Typophile.com could organise a Typography 101 for us newbies…_\n\n...it's called [The Elements of Typographic Style](http://web.archive.org/web/20150408084854/http:/www.typophile.com/wiki/Elements%20of%20Typographic%20Style)\n\nJim, I think your last post deserves its own thread. Email me if you need help on making a new posting: pauldhunt (a) yahoo . com. (take out the spaces and put the at symbol i there)\n\n"
    },
    {
      "time": "16 Dec 2007 — 1:04pm",
      "content": "@Mark Simonson:\n\nAfter a long period of confusion, I think I finally get it. Thanks a lot.\n\n"
    },
    {
      "time": "2 Sep 2009 — 4:54am",
      "content": "Suggested Reading:  \nThe History and Technique of Lettering  \nby Alexander Nesbitt\n\nHistory of Graphic Design  \nby Philip B. Meggs\n\nWolfgang Weingart: My Way to Typography  \nby Wolfgang Weingart\n\nPioneers of Modern Typography  \nby Herbert Spencer\n\n::  \n:: cheryl clifford  \n:: [cmclifford@gmail.com](mailto:cmclifford@gmail.com)  \n::\n\n"
    }
  ]
}
