{
  "id": "14718",
  "title": "Alternative to Fedra Serif B?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm in a bit of a dilemma here. I've recently had an opportunity to work with Typoteque's [Fedra Serif B](http://web.archive.org/web/20150410092523/http:/www.typotheque.com/site/fonts.php?id=6) family and I've become quite fond of it. However, I have a few concerns:\n\n1 The \"f\" ligatures are awful and I'd want to clean them up.  \n2 The EULA doesn't allow for modification.  \n3 I'd want to combine the PS fonts into an OpenType family.  \n4 The EULA doesn't allow for modification.  \n5 The EULA is too restrictive regarding PDF embedding.  \n6 The EULA is ruining my day.\n\nThat said, I really like the proportions and personality of the face, it has a decent glyph palette (with the Expert set), the small caps and oldstyle figures are there and good, there is a solid range of ligatures including a \"Th\" lig that I like to have, and there are some great alternate characters as well (multiple ampersands in the roman and italic, a couple of long-tailed Qs, etc.)\n\nIt kills me that the only thing I DON'T like about this font are the \"f\" ligs, which would be easy to clean up, if it weren't for that pesky EULA. At the end of the day, regardless of how much I like the face, I don't want to support a foundry that is so restrictive with its EULA.\n\nTo make matters worse, the fonts I've found that have the same feel to them have the same bloody restrictions in their EULA (UnderWare's [Dolly](http://web.archive.org/web/20150410092523/http:/www.underware.nl/site2/index.php3?id1=dolly&id2=overview), Enschede's [Collis](http://web.archive.org/web/20150410092523/http:/www.teff.nl/fonts/collis/collis.html)).\n\nI'm wondering if anyone can suggest a good alternative to Fedra/Dolly/Collis that is distributed by a foundry more open-minded in terms of usage.\n\nThanks in advance...\n\n",
  "author": "jason",
  "time": "19 Aug 2005 — 1:46pm",
  "uid": "3771",
  "comments": [
    {
      "time": "19 Aug 2005 — 3:15pm",
      "content": "I don't understand: If you need an OpenType version of the family or if you need an upgrade of the license, why don't you just talk to the foundry? Have you tried? License agreements, like any sorts of contracts, are subject for amendments and negotiation.\n\nA.\n\n"
    },
    {
      "time": "19 Aug 2005 — 3:51pm",
      "content": "Don't see a way around your dislike of the ligs or OT version without talking to Peter. With respect to the embedding it seems as if he offers multiple levels of embedding - do none of these meet your needs? What are you trying to do?\n\nBasic EULA - [http://www.typotheque.com/site/static\\_pages.php?id=14](http://web.archive.org/web/20150410092523/http:/www.typotheque.com/site/static_pages.php?id=14 \"http://www.typotheque.com/site/static\\_pages.php?id=14\")\n\nEmbedding - [http://www.typotheque.com/licensing/embedding\\_license\\_addendum/](http://web.archive.org/web/20150410092523/http:/www.typotheque.com/licensing/embedding_license_addendum/ \"http://www.typotheque.com/licensing/embedding\\_license\\_addendum/\")\n\n"
    },
    {
      "time": "19 Aug 2005 — 5:42pm",
      "content": "Well, the OT angle is probably hopeless, but for the f-ligs you could make your own from scratch, put them in a dummy font, and sub them in manually. Tedious, inelegant, but hey.\n\nBut do talk to Peter - he's a reasonable person. It's just hard to have a reasonable EULA in this environment.\n\nBTW, it's great to see this groundswell of EULA dissent.\n\nhhp\n\n"
    },
    {
      "time": "19 Aug 2005 — 6:03pm",
      "content": "If you need to distribute PDFs beyond printers and the like, it seems you'd have to go with the embedding license at 300 euros a year. If you're working for a small organization, I can see how this could be a deal-breaker.\n\nWhy not have a look at [Apex Serif](http://web.archive.org/web/20150410092523/http:/www.vllg.com/Thirstype/ApexSerif/mudTyper+Weights/)?\n\nIf you do decide on Apex, I'd email both foundries to tell them what figured in your considerations.\n\n"
    },
    {
      "time": "19 Aug 2005 — 6:04pm",
      "content": "Thanks for the input Adam, Simon & Hrant,\n\nYou're right in that I haven't contacted Peter at Typoteque. I'm a pretty small-time freelancer and thus costs are always a major factor, and as I've never contacted a foundry directly to inquire about this sort of thing, doing so simply didn't occur to me as a viable route to pursue. By that I mean that I had and do assume that procuring such permissions would double/triple (?) the price and, at my budget, the base cost for a decent bundle of the Fedra family is already a bit daunting (like I said, small-time).\n\nDon't get me wrong, my whole point here is that I'm willing to spend the money for a font I know I'll use a lot and which I'm very fond of; the trick seems to be finding such a font with what I think should be \"given\" rights with purchase (modification, conversion, embedding, etc.).\n\nI will, however, contact Peter and simply inquire what the cost might be to gain these permissions. You've been very encouraging in your kind words about Peter and thus I'll venture a note and see what develops.\n\nHrant, what you've suggested is simple enough, yet, as you said, inelegant. Perhaps I'm just expecting/wanting too much all at once: a well-drawn and constructed font with a decently comprehensive glyph palette in a convenient format and at a price that doesn't make an embarrassment of my bank balance. Strange that such a description seems quite reasonable, yet also hopelessly naive.\n\nWhile at first I felt a bit foolish on reading your posts -- that is, for not taking the small step to contact the foundry before giving up on Fedra -- those same posts have now pushed me to do so. So, thanks.\n\n"
    },
    {
      "time": "19 Aug 2005 — 6:22pm",
      "content": "John,\n\nThanks for mentioning Apex; after reading Chester's post(s) in [The End User's Manifesto](http://web.archive.org/web/20150410092523/http:/typophile.com/node/14264) thread I was keen to look into Village/Thirstype, but I didn't find quite what I'm looking for at the moment. I do like Apex (great design, decent palette, great format, reasonable full-bundle price, AND a great EULA), but it's not quite what I'm looking for right now. Like Lucas' [TheSerif](http://web.archive.org/web/20150410092523/http:/www.lucasfonts.com/), [Apex](http://web.archive.org/web/20150410092523/http:/www.vllg.com/Thirstype/ApexSerif/mudTyper+Weights/) is a bit blockier than what I'm seeking. Lucas' TheAntiqua is pretty close, but, again, EULA.\n\nAs Fedra was what I began looking for, I'm going to pursue it a bit more and see what develops there. If that doesn't pan out, the search will continue.\n\nThanks for your input...\n\n"
    },
    {
      "time": "19 Aug 2005 — 6:34pm",
      "content": "\\> my whole point here is that I’m willing to spend the money for a font\n\nIndeed. And people who bother to even notice that EULAs exist shouldn't be the ones who are punished.\n\nhhp\n\n"
    },
    {
      "time": "19 Aug 2005 — 7:09pm",
      "content": "Jason,\n\nthe FontFont library just got a more liberal license:  \n [http://www.microsoft.com/typography/links/news.aspx?NID=5037](http://web.archive.org/web/20150410092523/http:/www.microsoft.com/typography/links/news.aspx?NID=5037 \"http://www.microsoft.com/typography/links/news.aspx?NID=5037\")  \nso you may be interested in looking at one of the many FF fonts.\n\nAdam\n\n"
    },
    {
      "time": "19 Aug 2005 — 8:04pm",
      "content": "The new FF license \\_is\\_ very nice in many ways, and they certainly have some very nice fonts.\n\nThey don't allow modifications, though. As long as the formats offered are what you want, and you're reasonably sure you won't want to tweak anything (don't forget that altering kerning pairs is a modification of the font file!), they may be attractive to you.\n\nI have a couple of other suggestions for you Jason:  \nChaparral and PMN Caecilia Std. Both are available from Adobe in Opentype with favourable EULAs.\n\nChaparral is, I think, under appreciated, has optical variations, and, I believe, even allows editable embedding. (Check that EULA yourself though!)\n\nYou can see it used to good advantage in Bringhurst's _The Solid Form of Language._\n\n"
    },
    {
      "time": "19 Aug 2005 — 9:18pm",
      "content": "\\> altering kerning pairs is a modification of the font file!\n\nActually, I kinda remember David Lemon once pointing out that AFM files are not protected - not sure. Plus Quark does that sort of thing \"on the side\", no?\n\nhhp\n\n"
    },
    {
      "time": "19 Aug 2005 — 9:40pm",
      "content": "John, I humbly disagree: Apex Serif is no alternate for Fedra Serif; Peter's design is much better realised than mine.\n\nJason, I would add my voice to the chorus urging you to contact Peter directly. If you have paid for appropriate licensing for what you are doing with Fedra, he may smile upon your requests for modification. And I would imagine he would insist that the embedding stipulated in his EULA be followed.\n\n(Speaking personally, I am grateful for the insight which other designers can bring to my work; if my ligatures are awkward, I want to know so that I can do better next time. Adam Twardoch has graciously tweaked my ogoneks in the past, so I now know how to make them myself. A customer in Iceland has helped me with my eths and thorns, and a Norwegian designer has helped me reimagine how I make æscs, etc. etc.)\n\nI trust that you have done this kind of OpenType font collation before; it's not difficult, but it's not easy either.\n\nHrant, AFM files are superfluous in a Macintosh DTP environment, and altering them doesn't affect the kerning of the font: All of the spacing and kerning info is built into the PostScript Type 1 printer and screen fonts. Windows is a different kettle of wax altogether.\n\nAnd you wrote, \"people who bother to even notice that EULAs exist shouldn’t be the ones who are punished.\" Hallelujah! I couldn't agree with you more. I'm overwhelmed with bright joy when a customer buys more than one license, acknowledging that they are licensing a font for more than 4 computers. I would estimate that the ratio of properly to improperly licensed fonts is something in the neighbourhood of 1:10. Amongst professional designers, I'm guessing.\n\n"
    },
    {
      "time": "20 Aug 2005 — 1:22am",
      "content": "Hrant, both of your suggestions/comments are exactly what gall me about most EULAs. I'm not quite sure where the ethical line is to be drawn between re-writing AFM files (yawn), time-consuming and awkward hacks in the setting application (InDesign/Quark), or simply tweaking a good font at the source. I mean, of course I understand the time and effort and experience and dedication that goes into designing and engineering a well-made font, and it is exactly that understanding that makes me hesitant and respectful when it comes to such tweaking.\n\nI'll admit that in the past I -- like many, I'm sure -- simply crept in and made the adjustments I thought necessary to the fonts I was working with. This was both due to a lack experience and an arrogance in thinking I knew what was best for the project at hand. Yet underneath both of these excuses is also an honest goal: well-set text without ridiculous arm-twisting.\n\nFor example, I use Minion a lot for book work and I have to admit that if I could figure out how to work with VOLT I'd be in there in a second fixing a variety of small quirks that I've mentioned in the [thread](http://web.archive.org/web/20150410092523/http:/typophile.com/node/12883) around my little [Typographer's Checklist](http://web.archive.org/web/20150410092523/http:/www.greenboathouse.com/dewinetz/pdf/typographers-checklist.pdf). FontLab won't recompile this font and VOLT gives me a migraine, so as far as my trusty work-horse goes, I'm stuck with awkward hacks and numerous character-styles to get the font to do what I want it to do.\n\nThis, it seems to me, is the issue. I'm a designer/typographer (not, per se, a type designer) trying to set type well. And too often very, very well-made fonts won't let me do so. Maybe it's an \"ff\" lig with oddly long arms (_ahem,_ Fedra Serif), or tight kerning on 37 and 47, or a thousand other tiny bugs. The point is that a good font is an instrument with which to make good music: a viola or a piano. And, as Bringhurst says, both violas & pianos need to be tuned.\n\nThe tricky part is, who's to do the tuning? The inexperienced thug I was a few years ago, or the somewhat educated novice I am today? I'd like to think that the last 4 or 5 years of modestly dedicated application & study have taught me something, but, really, each day I'm just made aware of how much more I have to learn.\n\nJohn, I do have Chaparral holstered in the background, ready to pull out if I need to, and I agree Robert made it look beautiful in _Solid Form_, but it still isn't quite what I have my heart & keyboard set on, and what good are any of us if we're not discerning & insanely picky?\n\nWhat is incredibly frustrating is that the understandably trepidatious position of foundries to refuse designers the permission to \"modify\" fonts is based on a fear not so much that they might do a disservice to the design (it seems to me that if you're able to both recognize & correct something like a metrics problem, you're probably good to do so), but that there is a fear of improving the design to make a profit at it. I'm sure there are many out there striving to do just that. Yet I don't know anyone that would do so. I don't want to be paid for filling a pot-hole, I want to design a highway using a concrete that will guide my plans and the driver's tires where they're meant to go.\n\nNobody gets into typography for fun. It's just where some of us end up. I want to practice it well. And I want fonts that will let me do so.\n\n"
    },
    {
      "time": "20 Aug 2005 — 9:54am",
      "content": "Two answers to all your problems:\n\n(1) Fedra now comes in OpenType, with additions and improvements.  \nsee: [http://www.typotheque.com/site/fonts.php?id=1](http://web.archive.org/web/20150410092523/http:/www.typotheque.com/site/fonts.php?id=1 \"http://www.typotheque.com/site/fonts.php?id=1\")\n\n(2) Contact Peter: [info@typotheque.com](mailto:info@typotheque.com)\n\n_(Also, I have forwarded this thread on to him, he may or may not respond here)_\n\nBTW, Jason, your posts have been very eloquently stated. I imagine if I only took the time to write properly, the world might be a better place.\n\n"
    },
    {
      "time": "20 Aug 2005 — 11:07am",
      "content": "Kyle, Fedra Sans is indeed available in OpenType, but I've been going on and on about Fedra Serif. There's also no real rush here as I'm socking away some money to purchase a few fonts later this fall; all of this is just research.\n\nI look forward to talking to Peter; regardless of the outcome of this process, I know I'll learn a lot as it unfolds, as is already the case.\n\nAs for your kind words regarding my posts, it usually takes about 10 minutes after posting before it dawns on me what a pompous ass I can be. 2 English degrees probably help to compose adequate sentences, but eloquent? Hardly. I know that many at Typophile take much time and care to respond to many rookie queries, and I'm very appreciative of the highly skilled community here, so I'd like to at least to explain my fumbling with a modicum of clarity & as few comma-splices as possible (although, like typos, they sneak in all over the place, and sometimes I just can't help throwing in the odd horribly mixed metaphor).\n\n"
    },
    {
      "time": "20 Aug 2005 — 12:57pm",
      "content": "Thanks for inviting me here to clarify those questions.\n\nFor the last two years or so, we've been working on the OpenType version of Fedra Serif. Rather than just wrapping the PostScript fonts into OpenType, we've tried taking advantage of the format. That's why it takes a bit longer than expected.\n\nKyle has mentioned that Fedra Sans is now available in OpenType, in two different versions:\n\n[http://www.typotheque.com/OpenType\\_Pro](http://web.archive.org/web/20150410092523/http:/www.typotheque.com/OpenType_Pro \"http://www.typotheque.com/OpenType\\_Pro\")  \n [http://www.typotheque.com/OpenType\\_Std](http://web.archive.org/web/20150410092523/http:/www.typotheque.com/OpenType_Std \"http://www.typotheque.com/OpenType\\_Std\")\n\nFedra Serif Pro will follow shortly, and will offer even larger character set than the Sans, supporting all European languages including Greek and Cyrillic, scientific and math glyphs, and more.\n\nThis has given a possibility to revisit also the Latin set, and many modification have been made. I agree with Jason that the 'f' ligatures in Serif B Book have been too wide, and not really usable. The ligatures, and many more fixes were addressed in this update. Fedra Serif Pro will become available this autumn, and Typotheque clients will receive free update in the format they have licensed, and a possibility to upgrade to OpenType for a small fee.\n\nNow to the EULA: it has been written in 1999, and it might be a subject to some modifications as things have changed. However, it will still disallow reverse engineering and modifications. Typotheque is a small foundry and as such we have been always trying to come forward to meet the needs of diverse projects. This is not a money-making scheme, in fact most of these small modifications were made as part of a standard (free) service. However, knowing which versions of fonts are being used by the clients is the only way to guarantee functionality of the fonts. The issue will become even more complex with inclusion of digital signatures in fonts, as this will have consequences on how the fonts will be displayed in the OS.\n\nOur standard EULA allows sending PDF files to your printer, proof-reader, client, however for publishing PDFs online, or distributing it third parties you will need to get an embedding addendum.  \nPeter Bilak / Typotheque\n\n"
    },
    {
      "time": "20 Aug 2005 — 1:39pm",
      "content": "Peter, thanks so much for responding to this thread. I had planned to contact you directly (and likely will still do so) but I'm glad you responded here so others can reap the benefits of this exchange.\n\nI'm very pleased to hear that Fedra Serif is forthcoming in OpenType, and as I'm budgeting to purchase a few fonts later this fall it appears the timing may be perfect. You referred to the updated font as Fedra Serif Pro (without the A or B suffix); will the two be combined in some way? I ask because I'm partial to the taller of the two.\n\nOne of the things I'm still a bit unclear about, though, is the embedding addendum. Up until very recently I had posted samples of various projects on-line and have shipped such samples to prospective clients, completely ignorant that there was anything poetentionally problematic with such an exchange. In this day and age PDF has simply become second-nature, and, in the quest for work, posting samples on-line seemed all but necessary. I suppose it's fairly simple to extract a non-subsetted font from a PDF, it had just not occured to me that anyone would bother to do so, and thus I went ahead and posted away.\n\nWhat I'm uncertain of at the moment is whether such an exchange is permitted in the standard EULA; that is, while posting on-line seems to be a no-no, what about providing samples of previous projects to prospective clients? Would this qualify as sending a PDF to a client, even thought they're not a client yet? Logically, clearly not, but this sort of exchange seems commonplace and all but vital.\n\nAs a side-comment, directed to the community at large, I'm curious about one of the comments Peter made:\n\n\"[K]nowing which versions of fonts are being used by the clients is the only way to guarantee functionality of the fonts.\"\n\nI suppose that makes sense, but couldn't there simply be a stipulation that modifying a font nullifies any such guarantee? The warranty on my car, for example, states quite clearly that not keeping up with basic maintenance can result in the termination of said warranty. I'm thinking here that if a modification I make results in the font no longer functioning properly, it seems to me that breakdown is my own fault and thus the consequences are my problem, not the foundry's. But, I assume this brings us into the ugly world of avoiding responsibility, as I'm sure there are many out there who do just this and then complain about faulty product. On the other hand, as is often the case, perhaps I simply don't know what I'm talking about.\n\nI'm constantly learning when I visit Typophile, and am thus consistently grateful that such an opportunity exists to exchange ideas, information and contact with those who clearly have a lot to offer those of us who clearly have a lot to learn.\n\n"
    },
    {
      "time": "20 Aug 2005 — 2:12pm",
      "content": "<cite>You referred to the updated font as Fedra Serif Pro (without the A or B suffix); will the two be combined in some way? I ask because I’m partial to the taller of the two.</cite>\n\nBoth packages will come in OpenType Std, and OpenType Pro, and you can license what you like.\n\n<cite>What I’m uncertain of at the moment is whether such an exchange is permitted in the standard EULA; that is, while posting on-line seems to be a no-no, what about providing samples of previous projects to prospective clients? Would this qualify as sending a PDF to a client, even thought they’re not a client yet? Logically, clearly not, but this sort of exchange seems commonplace and all but vital.</cite>\n\nTypotheque licensing basically recognizes two different kinds of PDF embedding: _distribution_ and _non- distribution_, while the former requires a special addendum for putting PDF online, on a network of computers, or embedding into products; the latter allows, for example, you as a licensed font user sending a PDF file to an unlicensed third party, being it your client, client-to-be, or your wife if you abide certain conditions.\n\n<cite>I suppose that makes sense, but couldn’t there simply be a stipulation that modifying a font nullifies any such guarantee?</cite>\n\nYour suggestion of a license with disclaimer is interesting, but I would like to hear the reasons for modifications first. For example, now I would save you probably making your own OpenType fonts. Again, I would gladly discuss possible reasons for changes - we do publish updates of fonts, so if there is really a need for a change, perhaps it would be beneficial for the complete font.\n\n"
    },
    {
      "time": "20 Aug 2005 — 2:22pm",
      "content": "I agree, Jason.\n\nOne could stipulate that no support will be offered for user modifications. One could even require that modified fonts be identified as such, perhaps mandating a suffix to be added to the font name, e.g. \"Fedra Serif\\_x\".\n\nIt might be argued that users wouldn't comply with this term of the EULA, but if that were the case, they probably wouldn't comply with the no modification clause either.\n\nI'm not a font designer, though, and I have no idea how much time is taken up supporting fonts. Naively, I thought that most correctly built fonts would require little \"tech\" support, and that allowing user modifications would, in fact, lighten the load on the font designer. Unusual kerning and the like could be dealt with by the user, without a lot of fuss.\n\n"
    },
    {
      "time": "20 Aug 2005 — 3:02pm",
      "content": "_a suffix to be added to the font name, e.g. “Fedra Serif\\_x”_\n\nI'm not sure that would work. Proper font naming, especially with OpenType fonts, is more complicated that that. Just changing the font name isn't enough. In some circumstances, the old and new wouldn't work together at the same time… tinkering with pre-existing OpenType fonts requires a certain learning curve. (one that I haven't mastered yet, for instance ;-) )\n\n"
    },
    {
      "time": "20 Aug 2005 — 4:23pm",
      "content": "I've been thinking about this (\"tagging\" modified fonts) and it seems too quickly to spiral out of control even within the confines of my own head. There are various ways one might \"tag\" a font to indicate that it has been modified, what the modifications are, when they were made, etc., but what would be the point considering that we're talking about personal modifications that would not be distributed in any way? I mean, of course we're shipping files to service bureaus, but from what I know, printers don't have the time or energy to actually \"keep\" submitted fonts, let alone organize a thousand slightly different versions. The folks I know who work at print-shops can't delete font files quickly enough to avoid any problems with them. This is a fairly slippery slope, it seems, so I do understand foundries' reluctance to venture that'a'way.\n\nAs to Peter's question around what sort of modifications I had in mind, in this specific case I really feel/felt the \"f\" ligs needed some work, but I'm curious now to see how they've been cleaned up in the new version Peter mentioned. This, to me, is an extreme case of modification; normally I'd avoid any font that had characters I was so uncomfortable with that I'd want to edit the glyphs directly. In this case, however, I'm fond enough of the font as a whole that I really did feel (perhaps arrogantly) that I could tidy up a couple of glyphs to the benefit of the font as a whole (and, thereby, the text being set).\n\nBeyond this all I really have in mind are slight customizations in metrics & kerning (and, perhaps, some baseline shifting, etc.) that every font seems to require. For instance, I prefer a bit more space inside left & right parens than most fonts build in; certain number combinations seem always to be poorly kerned; etc., etc. Again, it seems to me that regardless of how much work goes into a well-made font (and I know that a LOT of work goes in there) there will always be small issues both general and specific-to-taste that could benefit from tweaking.\n\nHowever, what I'm confronted by whenever I think about this is the simple question: am I up to the task? Can I, honestly, improve the font? Or am I just mucking things up to be clever? I know that my experience in this field, guided by a few very kind folks more experienced than I, brings with it a large sense of respect & restraint, but it also brings some understanding both of faults and possible solutions.\n\nI'm very encouraged by this thread and by Peter's participation. There is, it seems, an uncommon level of open-mindedness and curiosity in this community that I wish existed in other areas of both my professional and personal life.\n\nI think what I'll do in this situation is wait for the OpenType version and go for it. Then, if I discover any small issues, I'll contact Peter directly to seek his advice/recommendation/etc. For the moment, Peter, thank you again for joining this thread. I look forward to corresponding with you soon.\n\n"
    },
    {
      "time": "20 Aug 2005 — 6:23pm",
      "content": "Well, maybe renaming is too weird, I don't know. I was under the impression that this was common practice in the olden days when agencies would enhance the kerning of their fonts. (Remember Agency Fit?)\n\nI've haven't had all that many problems with font naming when I follow naming conventions that are established as functional. I often let FontLab's automatic name building give me a hand.\n\nI have seen problems that I don't understand when using numbers in a font name, so I tend to avoid them. And, I agree that, for some reason, giving families members names like Nolan Fancy, Nolan Swishy and Nolan Boring sometimes presents problems, and I often can't figure out why, but I can't recall any cases where adding a simple suffix has messed me up. What problems have you seen?\n\nI didn't mean to suggest a complex name change. I was just attempting to allay concerns that the font might be mistaken for the original. If one wanted to keep track of versions and the like, I think one would do that within the version or notice and description fields. Come to think of it, if people felt that renaming was too risky, perhaps an alteration to the notice or description field would do.\n\n"
    },
    {
      "time": "21 Aug 2005 — 2:09am",
      "content": "With PostScript Type 1 fonts, renaming isn't so bad. Think that just three things have to change (note: I've never produced final fonts for a professional environment myself).\n\n1. The font name (although, one has to be careful about PS family groupings, which can only have four fonts in them).\n\n2. The unique PostScript ID.\n\n3. the FOND ID.\n\n(If these are incorrect, please fell free to correct me!!!)\n\nNot changing all three values will lead to the new font replacing the old one, instead of living side by side with it. OpenType fonts seem to have a lot more naming information in them, and I can't contribute any knowledge here.\n\n"
    },
    {
      "time": "21 Aug 2005 — 4:20am",
      "content": "I haven't seen too many problems with IDs. FOND IDs are obsolete.\n\nSee: [Unique ID Numbers, ID Registration and Related Topics.\"](http://web.archive.org/web/20150410092523/http:/partners.adobe.com/public/developer/opentype/index_id.html)\n\n"
    },
    {
      "time": "21 Aug 2005 — 5:11am",
      "content": "<cite>FOND IDs are obsolete.</cite>\n\nQuark XPress 6.5 in Mac, which is the latest version available, will give you error messages when the FOND IDs within the family are not unique. You might argue that Quark is obsolete, but as long as people use it, font developers will have to take those issues into consideration. PostScript ID is also obsolete (not required in latest Adobe applications), but you will again need them when workign with some older software.\n\nPeter  \n [http://www.typotheque.com](http://web.archive.org/web/20150410092523/http:/www.typotheque.com/ \"http://www.typotheque.com\")\n\n"
    },
    {
      "time": "21 Aug 2005 — 6:05am",
      "content": "Thanks for that, Peter. I've never used any version of Quark, but I didn't mean that it was obsolete. I was relying on the Adobe docs, and my very limited experience.\n\nWould you anticipate problems when adding a suffix, say an \"x\", to the Vendor ID Code at the end of the family name part of the font name? When altering fonts that do permit modifications, one pretty well has to do some kind of renaming, or chaos must surely follow.\n\nI altered Adobe Caslon in order to make old style figures the default, allowing me to use them in FileMaker and the like. I renamed it Adobe Caslon OSF in order to distinguish it. In my ignorance, and with blind luck I guess, I've managed to get away with this sort of thing.\n\nI'm not claiming any sort of expertise here. As I've said before, I'm a puppeteer, not a font designer. I have only an amateur interest in all this.\n\n"
    },
    {
      "time": "21 Aug 2005 — 6:24am",
      "content": "ID numbering in Type 1 fonts is a deep pool to wade into. Your number needs to be seven digits for the ID and four digits for the FOND. Somewhere between 8000 and 9999 is best. OpenType font naming is another issue, and is no less complex.\n\n(John, that knocking on your door is the font modification police.)\n\n"
    },
    {
      "time": "21 Aug 2005 — 6:37am",
      "content": "I was afraid of that!\n\n"
    },
    {
      "time": "21 Aug 2005 — 10:07pm",
      "content": "Not sure about usage restrictions but Jeremy Tankard's \"Enigma\" reminds me a little of Fedra.\n\n[http://www.typography.net/type/enigma.htm](http://web.archive.org/web/20150410092523/http:/www.typography.net/type/enigma.htm \"http://www.typography.net/type/enigma.htm\")\n\n"
    },
    {
      "time": "22 Aug 2005 — 11:33am",
      "content": "Jem, thanks for the suggestion. While the general shape of Enigma does seem along the same lines, there are a few aspects of the font that aren't quite fitting with what I'm seeking. One of the things I like about Fedra Serif B is the proportion of x-height/ascender. Both Fedra's have a substantial x-height, but I'm fond of the longer ascenders. Enigma seems to have a similar structure, but the cap-height and ascenders are considerably shorter (closer to Fedra Serif A). There are also a few personality traits a bit too close to Mrs Eaves for my taste: the hooks off r, m, n, p, the open loop of g, the sharp cut on the bowl of the a. All of these are great quirks, adding personality to the face, but for book work I think they'd be a bit too distracting. That said, for certain circumstances I would definitely turn to Enigma before Mrs Eaves, so I appreciate your mentioning it. It does have a nice palette, it's OpenType, the price seems comparable to other full-family bundles. Definitely a face I'll keep in mind.\n\nI glanced at Jeremy's EULA and it rules out decompilation, which I'm assuming means no modification. I'll have to give it a closer read, but if I've learned anything from this thread it's to contact the foundry directly to get specific info on whether fine-tuning would be permitted.\n\n"
    },
    {
      "time": "23 Aug 2005 — 10:39am",
      "content": "\"With PostScript Type 1 fonts, renaming isn’t so bad.\"\n\nI actually find it to be quite a headache. I can't tell you how many hours I've spent trying to figure out what name was wrong. For example if I have two fonts in the same suitcase that are both Condensed it will freak out unless I change each to: Cond, Cnd, Condensed or any other letters that look like the word \"condensed\".\n\nWhat has driven me up the wall is that I have actually been able to name all as \"condensed\" for example without an issue. Most commonly what happens when I've tried to render PS Type 1 suitcases is I only get two weights that pop out of a 4 weight or higher family.\n\nAfter taking Adam's workshop, I think I'm more likely to go with the OpenType naming process for any type I render. For example:\n\nBiddleSchrift Condensed Bold or BiddleSchrift Light (FOND name)  \nregular  \nitalic  \nsmall caps (other weights)\n\nLucas' Thesis Family probably has the best naming system in these regards. But alas, this is a whole 'nother thread....\n\n"
    },
    {
      "time": "23 Aug 2005 — 5:29pm",
      "content": "John Nolan writes \"FOND IDs are obsolete\" and then includes a reference to Adobe's documentation on Type 1 Unique ID numbers. It's like I would say \"Nobody needs phone numbers\" and would point to an article talking about ZIP codes being abandoned. FOND ID numbers have nothing to do with Type 1 Unique ID numbers.\n\nFOND ID numbers are devised by Apple, placed in the \"FOND\" resource of the Mac Type 1 suitcase, and are used on Mac OS only. They are not obsolete, they are used to enumerate fonts on the system and to classify the fonts by their primary codepage. Each FOND ID should be unique. In FontLab, you set the FOND ID numbers in Font Info / Encoding and Unicode.\n\nType 1 Unique ID numbers used to be devised by Adobe, placed in the \"LWFN\" files (the \"printer font file\") on Mac OS or in \".pfb\" files in Windows. They are obsolete these days. In FontLab, you set the Type 1 Unique ID numbers in Font Info / Version and Identification / Key identification settings.\n\nNeither ID number is used in TrueType or OpenType fonts (although OpenType PS fonts may contain Type 1 Unique ID numbers).\n\nRegards,  \nAdam\n\n"
    },
    {
      "time": "23 Aug 2005 — 6:00pm",
      "content": "Jason:  \nHave you looked at OurType's Fresco?\n\nAdam:  \nThanks for clearing this up for me. Stating that they are obsolete was an obvious error, as both you and Peter have pointed out. Clearly, I should have been more careful.\n\nThe main point I was trying to make in this thread isn't that altering fonts is easy, or that I know very much about how to do it. I was suggesting that users who wished to try, and who were prepared to put up with any problems they created, might be allowed to lie in a bed of their own making.\n\nI'm surprised by the tone these posts are taking: they seem to suggest that an average joe such as myself shouldn't even attempt to use FontLab to effect minor tweaks to a font without risking...what? Mortal danger? Having to try again? Having to read the manual?\n\nThere \\_is\\_ a passage in the referenced doc which refers to FOND IDs, despite the doc's title. I expected interested parties would find it, but I've quoted it here to save people the trouble:\n\n\"Macintosh FOND ID (NFNT, or screen font) numbers  \nFont developers often ask about FOND ID numbers, which are numbers that were once assigned by Apple for use with Macintosh screen fonts. Once famous for causing font ID conflicts in a Macintosh system, they are rarely a problem now that both System 7 and most applications handle fonts by name, rather than by number.\n\nApple no longer allocates these numbers as they were limited to 32,768 numbers, all of which have long since been assigned. As this number is still a required part of a Macintosh screen font, font vendors can just pick any range or random numbers from the appropriate range. Use any number between 1024 and 16,384 for Roman fonts, and from 16,385 to 32,768 for non-Latin fonts. If you develop non-Latin fonts, please try to find out about the appropriate range for your fonts, as it may make a difference in some applications.\"\n\nSo, yes of course, they are not \"obsolete\". Still, to the uninitiated like myself, this passage seems to imply that one needn't be too concerned with them. I read it to mean that they weren't a big problem. Has FontLab been taking care of these problems for me?\n\n"
    },
    {
      "time": "23 Aug 2005 — 7:56pm",
      "content": "Josh, being much in the same trial-and-error position that you're in - more or less slashing my way through various attempts to understand how fonts really work - I would imagine there is a certain amount of frustration for some folks here as those like you and I fumble along, thinking out loud, and perhaps speaking before we've got all the facts. Or maybe Adam and others have just had lousey days. Who knows. What I appreciate is the fact that I had no idea whatsoever about FOND numbers, so, as often happens when I pull up Typophile, I'm learning something from the turn this thread has taken.\n\n"
    },
    {
      "time": "23 Aug 2005 — 8:15pm",
      "content": "Also, Josh, thanks for mentioning OurType's Fresco, you're right on the money in terms of what I've been looking for, and it appears both the serif & sans are available in OpenType, and the bundles are quite reasonably priced. I'm a fan of Fred Smeijers's Quadraat Sans, but was unaware of the OurType foundry, so thanks again for pointing me in that direction. Also, that's a hell of a website. In case anyone else out there is in the position I was a few minutes ago, take a look: [http://www.ourtype.be/](http://web.archive.org/web/20150410092523/http:/www.ourtype.be/)\n\n"
    },
    {
      "time": "24 Aug 2005 — 12:59am",
      "content": "After a certain amount of trial and error, though,\\* it becomes cheaper just to pay the font's original designer to do all the modifications for you.\n\n\\*This depends on how much you bill an hour. Some designers I know in Germany bill at 60 Euros an hour, some bill over 200 per hour. Everyone has a different threshold…\n\n"
    },
    {
      "time": "24 Aug 2005 — 3:43am",
      "content": "My sister is a craftsperson. A couple of years ago, during a slow time, she spent weeks applying a painstaking finish to her kitchen cupboards. I asked her why she didn't hire someone for the job, and she said: \"If nobody's paying me, my time's worth nothing.\"\n\nOf course, the fact is, she was enjoying it, producing something she wanted while learning. This is common with \"do-it-yourselfers\".\n\nI enjoy tinkering with things, including the fonts I use. I find it interesting to try to figure out how things work, more interesting than trying to hire someone else to do it. I wouldn't hire myself: \"I'm slow, but I'm cheap.\" It's just fun to do it yourself.\n\nAs Blake said: \"If the fool would persist in his folly, he would become wise.\"\n\n"
    },
    {
      "time": "24 Aug 2005 — 11:09am",
      "content": "I just try to remember what Bringhurst has to say on this subject:\n\n\"What doesn't need tuning or fixing shouldn't be touched. If you want to revise the font just for the sake of revising it, you might do better to design your own instead. And if you hack up someone else's font for practice, like a biology student cutting up a frog, you might cremate or bury the results.\"\n\nI've made a royal mess of many an attempt to understand how things work, and while I haven't cremated all of these experiments, I do bury them away in a \"practice\" folder, along with notes, so that I can return to relearn certain lessons when necessary.\n\nMy point is that, like John, slicing & slashing away at a perfectly good font is indeed a great way to learn about it, I'm just very hesitant about presuming to fix or improve an organism I know relatively little about. But I'm still going to continue with ever more delicate and specialized tools until I'm confident enough to perform surgery on a frog (ahem, font) I think will survive my attempts to improve its kidney, lungs, heart, etc.\n\n"
    },
    {
      "time": "31 Aug 2005 — 7:56pm",
      "content": "Jason, maybe it's a bit late and not necesary any more but check out Alejandro Lo Celso's [Borges](http://web.archive.org/web/20150410092523/http:/www.pampatype.com/) which shares style with collis and is available trough Myfonts.\n\nHéctor\n\n"
    },
    {
      "time": "1 Sep 2005 — 2:00pm",
      "content": "Hi Héctor,\n\nThanks for the suggestion, and thanks to everyone else who made suggestions in my search, but mostly thanks to those who encouraged me to get in touch with Peter at Typoteque. I've now made contact with him and we've been discussing the upcoming release of Fedra Serif Pro, and it looks like most of my issues/concerns with the font will be addressed with the new OpenType version, along with a bunch of additional improvements to the font that should be quite exciting (new glyphs, improved ligatures, plenty of OpenType features). As mentioned above, Peter is indeed very kind, and despite being very busy he's been quite generous to indulge my interest in the font. I'll have more to add on this topic over the next few weeks, but for the moment I'll just thank everyone again for their input and suggestions.\n\n"
    },
    {
      "time": "5 Sep 2005 — 8:55pm",
      "content": "After reading through this thread -- It must have appeared while tiffalicious was on duty -- I'm further convinced that foundries are right to not allow modifications.\n\nA) Because it appears as if a small nightmare could be waded into.  \nB) Because if we talk about it enough, the changes we want to be made will be made _and_ will be made by the designer of the original font. Bonus!\n\n"
    },
    {
      "time": "6 Sep 2005 — 4:25am",
      "content": "Tiffany:  \nDon't be scared: I've had very little trouble altering fonts, and I'm a puppeteer, not a designer!\n\nI'm not suggesting bad things can't happen, but in my experience simple alterations aren't that difficult. Lots of people on this forum have successfully made fonts from scratch, for heaven's sake, and emerged without any lasting injury.\n\nFurthermore, if I do find myself with a problem, it's my problem, of my making. And I can always go back to the original.\n\nYou know, lots of people do minor work on their cars without a mechanic's license: they change the oil, replace the filter. They might not know how to put in a new transmission, but that's no reason to say that the hood of your car should only be open by the original manufacturer.\n\n"
    },
    {
      "time": "6 Sep 2005 — 7:37am",
      "content": "Tiffany, sorry, but you seem to have reverted back to font house lala-land.\n\n\\> if we talk about it enough, the changes we want to be made will  \n\\> be made and will be made by the designer of the original font.\n\nOh yes, Zapf, Slimbach, Licko, they're all avid, open participants on Typophile.\n\nhhp\n\n"
    },
    {
      "time": "6 Sep 2005 — 10:38am",
      "content": "Typophile, sadly, isn't the epicenter for all people. I was speaking generally. I personally think that the more we talk about our needs, speaking about graphic designers, someone will hear us. Lala-land?\n\n--\n\nJohn, I am of two minds about this. Somehow I'm sitting in between. On the one hand, we, graphic designers, want certain allowances in the EULA. On the other hand, we don't want to pay a billion dollars for a family. On the third hand, foundries want to maintain quality control of their typefaces. John, would you pay a little extra to be allowed to modify?\n\n"
    },
    {
      "time": "6 Sep 2005 — 10:47am",
      "content": "It's not just about Typophile; it's about the reality that not all type designers are good listeners. Another reality is that most type users are also not good listeners (to the EULA). And in neither case can we do much about it. Ignoring all this does indeed put one in lala-land.\n\nhhp\n\n"
    },
    {
      "time": "6 Sep 2005 — 11:20am",
      "content": "I suppose you are right. However, I'm talking to those who will listen, from both sides of that fence. I've never been assuming everyone is listening.\n\n"
    },
    {
      "time": "6 Sep 2005 — 6:03pm",
      "content": "In this specific case (the topic of this thread) things have turned out quite well. My exchange with Peter at Typoteque continues to be encouraging, so I'm very glad I wrote that first post way up there, and grateful to those who encouraged me to ask more questions and to do more research.\n\nAs to John's last post (no threat of personal injury in font modification), that is more or less my position as well, except that it doesn't address a very, very important point: who's to judge an improvement from a mutilation?\n\nIf we're talking about correcting the metrics & kerning a bit, I simply can't/don't see anything wrong with that (if I can do it in my typesetting application, why not in the font file...), but as soon as I take a step further, I'm uncomfortable. For instance, I'm really not fond of unattached tails on cap Q, but modifying the font file to attach that tail seems to me to be crossing a very important line.\n\nYet that line, like most, is a thin one. My point is that I try to force myself to honestly consider whether I'm making a small modification, or changing the \"nature\" of the face and its glyphs. Not always an easy determination to make.\n\nAll I can say at this point, based on recent and current experience, is that asking others for input, contacting the designer/foundry, and taking things one step at a time has worked out very well. I was more or less ready to write Fedra off for a number of reasons, but after this thread and contact with Peter, almost all of my concerns have been addressed.\n\nNow, granted, these are rare and unexpected circumstances, as Peter's work on the soon-to-be-released OpenType Pro version of Fedra Serif miraculously addresses almost everything I had to complain about, but what I've learned and gained from this experience has been well worth the effort.\n\n"
    },
    {
      "time": "6 Sep 2005 — 6:41pm",
      "content": "Tiffany and Jason:  \nThe type of modifications I undertake are usually of this sort:  \nrearranging glyphs for ease of use;  \ncombining smallcaps and ff ligatures with roman into a convenient opentype version;  \nadding unusual kerning pairs if I find a need;  \nand, very occasionally, adding ff ligatures where none exist.  \nOh, I think I've also prebuilt a fraction or two.\n\nAs you can see, my modifications don't change the nature of the face...with the exception of the ff ligs they're invisible.\n\nI'd be happy if these mods were generally allowed. Would I pay a premium for this? Well, yes, but as it happens, many of the foundries that forbid mods are already premium priced. Go figure!\n\n"
    },
    {
      "time": "7 Sep 2005 — 11:18am",
      "content": "I think it's a tragedy that people don't feel like they can tinker with fonts, and worse that type designers don't allow it. Type designers enable designers; they don't produce a finished product. I see it like a composer/performer relationship. I never felt bad altering pieces to my liking when I played piano. It drove my teacher nuts, but I was the one playing. It's like trying to shame Glen Gould for the Gouldberg variations. It's not just preposterous, it's sad.\n\nThat being said, it's definitely uncool for people to modify and sell someone else's fonts, or to alter them to avoid paying the original designer. It's also silly to expect a foundry to support hacked up versions of their fonts. The type design industry needs to get away from the software model of selling fonts anyway, but that's a whole other thread.\n\n"
    },
    {
      "time": "7 Sep 2005 — 11:27am",
      "content": "Christian, right on.\n\nAnd can you imagine the font houses of yesteryear taking action against a typographer who would file his sorts this way or that to make his results <cite>just right?</cite> As Gerald Lange once taught me, you could recognize a really good typographer by how sawed up his sorts were. Punishing the good ones is just plain dumb. Not that it can actually be carried out... But thumping your chest and yelling demands only makes you look even more dumb.\n\nhhp\n\n"
    },
    {
      "time": "7 Sep 2005 — 12:49pm",
      "content": "i think no mod clauses are fairly pointless. if i had my own foundry tho, i'd like to have a clause that any mods made must be resubmitted to me (the foundry), that i retain the copyright on all mods and may use any changes/improvements in future releases of the font and all other EULA restrictions/privelages apply to all mods.\n\n"
    }
  ]
}
