{
  "id": "14724",
  "title": "A Midsummer Night's Puzzle",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "This is not exactly a type-ID, and not exactly a type crit.\n\nI’ve scanned this rendering of a font (the chop job on the left isn’t my doing) and I’d like people to: take guesses as to who made it and/or when it was made; and give opinions about it (even though there isn’t much there, I admit). If you already know for a fact who made it, don’t spill the beans please, but feel free to opine on it (assuming you can remain objective even though you know who made it\\*). Just a midsummer night’s puzzle, really.\n\n\\* That’s not [necessarily] a hint. But it might very well keep you guessing, and there’s nothing like speculation to get the mental juices flowing!\n\nhhp\n\n| Attachment | Size |\n| --- | --- |\n| [ABMfmg.gif](http://web.archive.org/web/20060524170939/http:/typophile.com/files/ABMfmg.gif) | 14.13 KB |\n\n",
  "author": "<a href=\"user/1250\" title=\"View user profile.\">hrant</a>",
  "time": "<br>",
  "uid": "1250",
  "comments": [
    {
      "time": " 20 August, 2005 - 12:08am",
      "content": "<cite>If you already know for a fact who made it, don’t spill the beans please, but feel free to opine on it (assuming you can remain objective even though you know who made it*).</cite>\n\nCareful! You’re verging on one of the [top ten things not to say on Typophile!](http://web.archive.org/web/20060524170939/http:/typophile.com/node/12938). In any case, Walter Tracy, in [Letters of Credit](http://web.archive.org/wiki/Letters%20of%20Credit), claims that the original upon which this sample is based is “obese and, to my mind, vulgar.” And this version is “superior; not so dark, but dark enough, and with cleaner profiles — the work of a designer familiar with, and respectful of, the letter forms of traditional printing types.” I take this as evidence that Tracy sometimes doesn’t know what he’s talking about. To my mind, this ripoff is not as friendly as the original, and well deserves its lack of popularity.\n\nAlso keep in mind that the metal had a number of alternates and swashes, including a ‘g’ of much more traditional form. These would probably be worth bringing back, at least.\n\n"
    },
    {
      "time": " 20 August, 2005 - 4:26am",
      "content": "raph, unless I’m totally off in identifying the face the LTC version has an Extras font that includes the tradition _g_ and a bunch of other alternates and swashes.\n\n"
    },
    {
      "time": " 20 August, 2005 - 7:56am",
      "content": "_To my mind, this ripoff is not as friendly as the original, and well deserves its lack of popularity._\n\n\\*gasp!\\* LOL  \nOf course, I disagree. The original is overused IMHO and this one is a nice alternative if you want something fat and friendly. The LTC version includes all the original characters and some extras designed by yours truly. Check it out on this [t-shirt](http://web.archive.org/web/20060524170939/http:/www.p22.com/products/images/LTC_Tshirt_FB.gif).\n\n"
    },
    {
      "time": " 20 August, 2005 - 10:10am",
      "content": "I’m not sure if it’s better or worse than Cooper (which I don’t like much). But I do agree with Loxley that it was “ahead of its time”. It’s almost Underware.\n\nhhp\n\n"
    },
    {
      "time": " 20 August, 2005 - 11:57am",
      "content": "Ah, I was unaware of the extras in the LTC version. Good job!\n\nAnd, just to stir things up further, how do you think these fonts compare with Kompakt, another one we don’t see much of these days? If we’re going to have a font designer deathmatch, how can we not pull in HZ?\n\n"
    },
    {
      "time": " 20 August, 2005 - 12:05pm",
      "content": "I really like Kompact. Has it been digitized?\n\nhhp\n\n"
    },
    {
      "time": " 20 August, 2005 - 1:11pm",
      "content": "But of course! It’s such a great face. And for the record, it is spelled with two k’s ;-)\n\nHere is a link to the font: [Kompakt](http://web.archive.org/web/20060524170939/http:/www.linotype.com/913/kompakt-family.html).\n\n"
    },
    {
      "time": " 20 August, 2005 - 1:24pm",
      "content": "i like kompakt as well. glad it’s there in digital form. of this genere, i think pabst extra bold is the least sucessful.\n\n"
    }
  ]
}
