{
  "id": "14720",
  "title": "All-round text companion for Optima",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Greetings!\n\nI'd like some recommendations for a text companion face to be used with [Optima](http://web.archive.org/web/20131012184712/http:/typophile.com/wiki/Optima). Optima is being used in an identity for a medical practice, and I'd like to find a good workhorse (but elegant) companion text family to be used for correspondence, letter writing, advertising, etc.\n\nAny thoughts? Your views are greatly appreciated.\n\nThanks in advance,\n\nAndrew\n\n",
  "author": "andrewh",
  "time": "19 Aug 2005 — 3:28pm",
  "uid": "8874",
  "comments": [
    {
      "time": "19 Aug 2005 — 3:31pm",
      "content": "[http://typophile.com/node/12100](http://web.archive.org/web/20131012184712/http:/typophile.com/node/12100 \"http://typophile.com/node/12100\")\n\ni've always liked [Palatino](http://web.archive.org/web/20131012184712/http:/typophile.com/wiki/Palatino) as well. dunno if you can wait for Palatino Nova which is due to be released soon. Paging Dan Reynolds! ;^D\n\n"
    },
    {
      "time": "19 Aug 2005 — 5:27pm",
      "content": "Optima can serve in text. It's not been used a lot for books, but it is designed for that use. You might investigate the new Optima Nova, whose italics are more useful for their intended purpose than the original sloped romans. It has 7 weights, small caps, even italic small caps, plus a few condensed weights. There are several weights that would be very nice to see used together in small sizes. If you have the budget, spring for the whole family and get the beautiful titling caps too.\n\nOtherwise, Optima is quite difficult to use with other faces. Other Zapf designs seem most comfortable with it. Try Aldus, or Melior, or for a little freshness Zapf Renaissance or Aurelia.\n\n"
    },
    {
      "time": "19 Aug 2005 — 5:51pm",
      "content": "\\> Optima can serve in text.\n\nYou really think so? Maybe you're thinking of the metal...\n\nAndrew, if you were lucky, digital Pascal would already be released. Alas...\n\nhhp\n\n"
    },
    {
      "time": "19 Aug 2005 — 6:27pm",
      "content": "I'd wait for Palatino Nova to see what's in store, but I've long preferred Aldus for text. Both have their merits, but I'm a sucker for long extenders.\n\n"
    },
    {
      "time": "19 Aug 2005 — 6:31pm",
      "content": "\\> I’m a sucker for long extenders.\n\nSo are readers (even though they think the opposite).\n\nhhp\n\n"
    },
    {
      "time": "20 Aug 2005 — 2:30am",
      "content": "Palatino nova will include an Aldus nova, John!\n\nOptima nova works great in text, IMHO, just like the metal did.\n\n"
    },
    {
      "time": "20 Aug 2005 — 7:22am",
      "content": "The original metal Optima was too light and grey in text, IMHO.\n\nI suspect Optima Nova is better in text, because it has added weight, especially at what were light terminals.\n\nThis might be a terrible idea or a good one--I haven't tried it because I don't own Optima--but Century Schoolbook might pair with the regular or bold weight of Optima. It also is a great workhorse, and works better than most on letter size paper because of its width.\n\n"
    },
    {
      "time": "23 Aug 2005 — 1:12pm",
      "content": "Century Schoolbook + Optima????\n\nAhem.\n\nYes, Optima in metal. I think the usefulness of Optima might be revitalized by the presence of so many new text weights in Optima Nova. The Regular, Medium and Demi could help relieve some of the wispiness, but the design is relentlessly vertical in its axis, which can give a sleepy texture at any weight.\n\nZapf has described Optima as a serifless Modern face, which implies that Bodoni would be a good companion, but the proportions are so different from most Moderns that I would expect to reject a pile of them before you found one that worked. Still, it's worth a try, if you think the text can withstand it.\n\n"
    },
    {
      "time": "23 Aug 2005 — 4:38pm",
      "content": "If a modern is wanted, how about FF Acanthus or Adobe's Kepler?\n\n"
    },
    {
      "time": "25 Aug 2005 — 11:27am",
      "content": "_Zapf has described Optima as a serifless Modern face_\n\nchapter, verse! i wanna reference for that one.\n\nto me Optima is the epitome of the [humanist](http://web.archive.org/web/20131012184712/http:/typophile.com/wiki/humanist) [sanserif](http://web.archive.org/web/20131012184712/http:/typophile.com/wiki/sanserif). And apparently i'm not the only one, as that's the category Lawson puts it in in [Letters of Credit](http://web.archive.org/web/20131012184712/http:/typophile.com/wiki/Letters%20of%20Credit). As noted before, the proportions are all wrong, and the flaring strokes are so calligraphic it's not even funny. I think that geometric sans pair better with [modern](http://web.archive.org/web/20131012184712/http:/typophile.com/wiki/modern) faces, and Optima is anything but geometric. i believe Bringhurst will back me up on the modern/geometric pairing convention, but if you call my bluff, i'll look up references for you...\n\n"
    },
    {
      "time": "25 Aug 2005 — 11:33am",
      "content": "Yes, Optima is much more Humanist Sans than Modern.  \nAlthough Syntax is much more of the \"epitome\" there.\n\nhhp\n\n"
    },
    {
      "time": "25 Aug 2005 — 12:47pm",
      "content": "I'm not going to call your bluff. I remember what Bringhurst says about a sans companion to Bodoni. That's interesting!\n\nHZ says:\n\n\"Optima was designed in 1952 ...... It is an alphabet design between a neo-classical roman (like Bodoni) and a sans serif (like Futura).\"\n\nThis is from his notes in the Grolier Club exhibit catalog \"The Fine Art of Letters\".\n\nOptima is also described as a serifless roman. Because of its contrast, it's a little of an outlier if included in the \"Humanist Sans\" category.\n\nZapf's modern faces also have many of the aforementioned traits. In Marconi, Zapf Book, etc. etc. he reshapes the proportions of the Modern idiom to something more juicy, more calligraphic, with a little more proportional interest. So it's no surprise he sees Optima as a serifless version of what would be a \"modern\" face in his hands.\n\nI'm not going to argue about how to classify Optima. The reason is the very problem raised in this thread: What can you use with it? Again, stay inside the world of Zapf's faces and you're sure to find a suitable serifed companion. There are plenty.\n\nI think John Nolan's suggestions are excellent. Acanthus' italic would agree nicely with the new italics in Optima Nova.\n\n"
    },
    {
      "time": "25 Aug 2005 — 1:03pm",
      "content": "i just wanted some more context about that quote, carl. thanks for the very enlightening post. i guess i was a bit abrasive in my last post, but the info you provided was exactly what i was looking for. thnx again.\n\n"
    },
    {
      "time": "25 Aug 2005 — 1:15pm",
      "content": "Carl, you make some good points. And really, Optima might be too lapidary/monumental/architectural (at least in its UC) to qualify as a true Humanist Sans.\n\nI would however add:  \n1) Maybe Zapf's \"between\" business was due to terminological paucity and/or a layman-targeted dumbing-down thing.  \n2) You could say that stroke contrast makes it **more** humanist... So maybe Paul was in a way right that it's the epitome.\n\nhhp\n\n"
    },
    {
      "time": "25 Aug 2005 — 6:05pm",
      "content": "Optima is very humanist in its modulation of stroke and perhaps also in the variation in the width of its caps. But it is much more like the 'modern' typefaces and geometric sans in having very wide bowls in its lower case. The more recent sans called 'humanist', following syntax, have oval bowls.\n\n"
    }
  ]
}
