{
  "id": "14759",
  "title": "Symbols for Swearing?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've Googled and Wikipedia'd, but I'm unable to find an answer: is there a term for using punctuation/symbols to hide explitives?\n\n(My friend who asked is of the opinion that there _must_ be, given the existence of the [interrobang](http://web.archive.org/web/20121006033541/http:/en.wikipedia.org/wiki/Interrobang). Heh.)\n\n",
  "author": "dotsara",
  "time": "22 Aug 2005 — 11:15am",
  "uid": "578",
  "comments": [
    {
      "time": "22 Aug 2005 — 11:30am",
      "content": "If there isn't one we should invent one - to get the ball rolling I propose the rather weak \"Bleepmarks\" in the hopes of getting some better suggestions...\n\n"
    },
    {
      "time": "22 Aug 2005 — 11:30am",
      "content": "I bet it was developed as a device in comics and may not have been typographic originally, but instead used skull-and-crossbones, stars, etc. The visual nature of the practice just doesn't seem to fit historically with typographic practice.\n\nThis is all guesswork on my part, of course.\n\n"
    },
    {
      "time": "22 Aug 2005 — 11:32am",
      "content": "According to [this source](http://web.archive.org/web/20121006033541/http:/www.halfbakery.com/idea/Standardized_20curse_20symbols), they're called 'maledicta'.\n\n"
    },
    {
      "time": "22 Aug 2005 — 11:43am",
      "content": "Even more info from [this page](http://web.archive.org/), about halfway down.\n\n\"-- Blurgits, plewds, maledicta and speed lines: Just a few of the terms that define the stuff you see in comic books all the time.\n\nEverything has a name -- the left arm of chair has a different name than the right side of a chair, to a carpenter. And to comic-book people, the various things we do, use and see have names.\n\nMaledicta: It's Latin for roughly, \"bad words.\" It refers to \\*^%&$#@!! Every time Sarge Snorkel uses symbology for \"bad words,\" it's maledicta. Not the same as Sgt. Fury, who uses substitute words -- \"Lantern-jawed, gold-brickin', pink-eyed son of a bob-tailed hyena\" isn't maledicta. That's \"euphemism.\" Maledicta is lightning bolts, death's-heads, and crapola from the top line of the keyboard to indicate bad words. Bad words: maledicta. (Mal=bad, as in malfeasance. Dicta, as in words, as in dictionary.)\n\nPlewds: Great big sweat beads that leap off a character's head to show anxiety. Outside of Beetle Bailey, it's not done much any more in American comics (which invented them). But you see it in manga times 10. It happens on Teen Titans on Cartoon Network every week. Those big ol' sweat beads that jump off someone's head to indicate to the viewer an emotional state are PLEWDS.\n\nBlurgits: Repetitive motion indicated by drawings that shows arms or legs seeming to be in several places at once in phantom fashion. See: The Flash. Related to speed lines.\n\nSpeed lines: Awwww, you know what they are. I[d say the Japanese had made a science of them, except that Carmine Infantino beat them to it.\"\n\n"
    },
    {
      "time": "22 Aug 2005 — 11:48am",
      "content": "Well how about that; I like that word, maledicta.\n\nThanks! (:\n\n(I hit the Halfbakery page during my first search, but all I saw was the proposal for a standard and then I got distracted and never read the rest of the page. Egg-on-face.)\n\n"
    },
    {
      "time": "22 Aug 2005 — 1:03pm",
      "content": "I'm not sure maledicta is quite right, it just means \"bad words\" and doesn't seem to be used to specifically relate to one type of graphic treatment. See [http://www.ajr.org/article\\_printable.asp?id=2122](http://web.archive.org/web/20121006033541/http:/www.ajr.org/article_printable.asp?id=2122 \"http://www.ajr.org/article\\_printable.asp?id=2122\") for other options.\n\nSi\n\n"
    },
    {
      "time": "26 Oct 2008 — 12:11am",
      "content": "They are called ' [grawlix](http://web.archive.org/web/20121006033541/http:/www.typophile.com/wiki/grawlix)' accoring to: [http://tinyurl.com/6ebtz4](http://web.archive.org/web/20121006033541/http:/tinyurl.com/6ebtz4 \"http://tinyurl.com/6ebtz4\") via [http://tinyurl.com/5fsuk8](http://web.archive.org/web/20121006033541/http:/tinyurl.com/5fsuk8 \"http://tinyurl.com/5fsuk8\")\n\ncheers\n\n"
    },
    {
      "time": "27 Oct 2008 — 1:17am",
      "content": "[http://itre.cis.upenn.edu/~myl/languagelog/archives/003942.html](http://web.archive.org/web/20121006033541/http:/itre.cis.upenn.edu/~myl/languagelog/archives/003942.html \"http://itre.cis.upenn.edu/~myl/languagelog/archives/003942.html\")\n\nZwicky has been investigating the topic of them and generally just calls them cursing characters. Grawlix is specifically the spiral shaped character.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "1 Nov 2008 — 4:03pm",
      "content": "hmmm, maybe someone should tell H&FJ so they can amend their blog post...\n\nthanks!\n\n"
    }
  ]
}
