{
  "id": "14760",
  "title": "Down Tempo Chill: P22 Records and Lanston Type Co.",
  "forum": "Home",
  "tags": [

  ],
  "content": "—  \nFrom P22 Records and Lanston Type Co.\n\n——————————————————————-  \nThe William Caslon Experience  \nWilliam Caslon was an 18th century type designer. The William Caslon Experience is an accomplished musical duo who create unique, lush electronic downtempo landscapes. The P22 record label has teamed up with FLT5 records to compile some of our favorite tracks of The William Caslon Experience onto a new CD. This CD contains a brand new remix by Odiorne in addition to a brand new “remixed” Caslon font. The exclusive font can ONLY be purchased by getting this CD.\n\nThe special CD “discfolio” packaging has been hand printed in three colors by letterpress designer Bruce Licher of Independent Project Press. Each CD is numbered and comes with a fold out broadside liner notes sheet/ poster.\n\nGet the CD free with the purchase of the LTC Caslon family  \n [http://www.p22.com/lanston/products/caslon.html](http://web.archive.org/web/20060329211835/http:/www.p22.com/lanston/products/caslon.html)  \nor buy it separately for only $15.95  \nFor more information see: [http://www.p22.com/records/](http://web.archive.org/web/20060329211835/http:/www.p22.com/records/)\n\n——————————————————————-  \nOdiorne is the musical brainchild of P22s very own Jimy Chambers. The new Odiorne CD released on file 13 records can also be bought via iTunes, but the first Odiorne EP cannot.  \nIt can however be purchased at a special reduced price from P22. http://www.p22.com/records/  \nGet “Want them leaving more” for only $5.95 – and if you order at the same time as the William Caslon Experience, save on combined shipping!\n\nThat’s all for now.  \n——————————————-  \nP22 type foundry, Inc.  \nNot your typical type™  \nPO Box 770  \nBuffalo, NY 14213  \nhttp://www.p22.com  \nPhone: 716-885-4490  \nFax: 716-885-4482  \n——————————————-\n\n",
  "author": "Miss Tiffany : 22 August, 2005 - 11:14am",
  "time": "",
  "uid": null,
  "comments": [
    {
      "time": " 22 August, 2005 - 11:20am",
      "content": "If you like your music ambient and surreal, this is a must have item. All 12 tracks ooze with down tempo chill. The packaging and poster, both letterpress printed, are items worthy of any emphemera collector’s treasure trove.\n\n"
    },
    {
      "time": " 22 August, 2005 - 11:43am",
      "content": "The full press release info:\n\nThe question to be asked:  \nWhat does a downtempo electronic music duo have to do with a semi-famous 18th Century type designer?\n\nNothing & Everything would be the answer.\n\nP22 type foundry has digitized new versions of the famous William Caslon fonts. The William Caslon Experience took their name from the same person that these fonts are associated with.\n\nThe William Caslon Experience is an accomplished musical duo who create unique, lush electronic downtempo landscapes. The William Caslon Experience have released 4 full length CDs and have had tracks remixed by DJ luminaries- The Herbaliser & Fila Brazillia. The Thievery Corporation has called their sound “some kind of cross between Medeski, Martin and Wood, Stereolab and Tortoise.”\n\nThe P22 record label teamed up with FLT5 records to compile some of The William Caslon Experience’s best tracks onto a new CD. This CD contains a brand new remix by Odiorne in addition to a brand new “remixed” Caslon font. This exclusive font can be loaded onto any computer and can only be purchased with this CD.\n\nThe CD “discfolio” packaging has been hand-printed in three colors by letterpress designer Bruce Licher of the Independent Project Press in Sedona, Arizona. Mr. Licher’s work has been featured in countless design magazines with his distinctive style.\n\nEach CD is numbered and comes with a foldout broadside liner notes sheet/ poster.\n\nThe CD is available through independent music distributors and directly from P22 as a separate purchase or as a premium with the purchase of the new LTC Caslon Family font set.\n\n"
    },
    {
      "time": " 6 September, 2005 - 4:57pm",
      "content": "I can’t decide if the music is cooler than the packaging or vice versa… The disk has raised fleurons, as if the fleurons got printed first and then flood overprinted with black.\n\nThe music is perfect for the office — unobtrusive and modern. Kudos [P22](http://web.archive.org/wiki/P22).\n\n"
    }
  ]
}
