{
  "id": "14777",
  "title": "Shipwrecked - revived",
  "forum": "Bitmap Display / Script",
  "tags": [
    "Bitmap Display / Script"
  ],
  "content": "I'm having trouble getting the hang of this new  \nforum (not that new, i know). I keep trying to  \ndelete one of my attachments and killing the  \nentire topic. Oh well.\n\nPlease check out the below:\n\n| Attachment | Size |\n| --- | --- |\n| [Shipwreck\\_lc\\_1.2.gif](http://web.archive.org/web/20150317112715/http:/typophile.com/files/Shipwreck_lc_1.2_0.gif) | 1.37 KB |\n| [Shipwrecked.gif](http://web.archive.org/web/20150317112715/http:/typophile.com/files/Shipwrecked_0.gif) | 1.72 KB |\n\n",
  "author": "Chris Washer",
  "time": "23 Aug 2005 — 4:47am",
  "uid": "4816",
  "comments": [
    {
      "time": "23 Aug 2005 — 6:31am",
      "content": "It \\*appears\\* to be very nice, but it's hard to say because your images are too low res... Please put up larger images!\n\n"
    },
    {
      "time": "23 Aug 2005 — 6:31am",
      "content": "I did that a few times too. The delete button at the bottom, stay away from it. The check boxes should be the only thing you use to handle attachments. one will say list ( i think ) and the other delete. i think just check the action you want taken w/the file and hit 'submit'. I think.\n\nI think that is a pixelfont. am i correct?\n\n"
    },
    {
      "time": "23 Aug 2005 — 8:26am",
      "content": "Yes, it is a pixel font. That's why it's in the Bitmap Display / Script section.  \nOh yeah, I'll put in an image with the upper and lowercase together. All in favour say '∆'.\n\n"
    },
    {
      "time": "24 Aug 2005 — 3:01am",
      "content": "chris, i really like the directions you tackle with your pixel font designs. they are not easy directions, really. the larger the pixel font, the more frail it appears, imo, making every pixel and its placement really count.\n\nin some ways, making a 'traditional' pixel font of this type is more difficult than making a 'gray' pixel font. placement of each 'notch' must be in the spirit of the overall design, and in a funny sort of way, actually becomes the spirit of the design, just as much as the overall shapes your glyphs are built from.\n\nyou might try to build these as non-italics fonts too. i believe they'd be slightly more sophisticated in their achievement.\n\nwhat do i mean by that?\n\nas it stands, your designs evoke the idea of sophistication (at least to me), but the actual execution of the idea is a little shaky. this is not your fault at all. this just comes from pushing the envelope--and creating a large, one-pixel wide cursive italics font is just about as difficult as it gets.\n\n"
    }
  ]
}
