{
  "id": "14775",
  "title": "E-mail & URL",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi\n\nI am working on a brochure with very narrow columns and our client doesn’t want the very long E-mail and URL addresses to be hyphanated. I can’t set them in a smaller size and they will obviously not shorten their addresses. Is there a miracle solution?\n\nBy the way I’ve seen in Dot dot dot magazine that they encapsulate URLs in \\< \\> symboles. Just like this \\<www.dot-dot-dot.nl\\>. Is this a typographic standard?\n\n",
  "author": "sebsan",
  "time": "23 August, 2005 - 3:08am",
  "uid": "8785",
  "comments": [
    {
      "time": " 23 August, 2005 - 4:26am",
      "content": "It’s not a typographic standard as such, but the way some mail programs show url’s — in the same way as underscoring.  \nBut I do think it’s an elegant solution to your problem. The only thing that could be bothersome is hyphenation: I think that’s undesirable (could be confusing!), so don’t use it and doublecheck all url’s in your text before going to print…\n\n"
    },
    {
      "time": " 23 August, 2005 - 5:49am",
      "content": "“…Just like this . Is this a typographic standard?”\n\nSome applications used the bracketing with greater/lesser than as a way to automate creating links from URLs in text. This is less of an issue now since most apps are smart enough to make links on the fly. In printed documents, the advantage is that you know the beginning and end. This does not help your problem when you have long URLs. The only solution is using one of the phonebook fonts (perhaps Telefont) which are designed for use at small sizes.\n\nChrisL\n\n"
    },
    {
      "time": " 23 August, 2005 - 5:55am",
      "content": "Hi Sebsan!\n\nThe only thing I can think of is to omit the ‘www’ part from the URL - check first that the server can cope with short URLs eg. ‘typophile.com’ because it can sometimes be a problem.\n\nThis doesn’t really help with email addresses though… make sure you don’t hyphenate them, your client won’t thank you for it!\n\nSi\n\n"
    },
    {
      "time": " 23 August, 2005 - 6:32am",
      "content": "Some italics will save you horizontal space over the roman, depending on the family…\n\nNot sure if this is practical, but it looks like practical and your project aren’t coinciding so much. I assume you’ve already tightened the tracking (within reasonable limits).\n\n"
    },
    {
      "time": " 23 August, 2005 - 7:25am",
      "content": "Some people like to use the Logical Not character instead of a hyphen for URL linebreaks.\n\nhhp\n\n"
    },
    {
      "time": " 23 August, 2005 - 7:32am",
      "content": "\\> By the way I’ve seen in Dot dot dot magazine that they encapsulate URLs in symboles. Just like this . Is this a typographic standard?\n\nURLs are often set this way in printed bibliographies. I believe it is the MLA standard…\n\n"
    },
    {
      "time": " 23 August, 2005 - 7:43am",
      "content": "Hi all,\n\nthanks for your suggestions\n\nLogical Not is a great idea. I am not sure my client will like it as much as me though.  \nHe will certainly argue that his readers will want to input the addresses as they see them (with the Not)\n\nSorry, but I don’t know what the MLA is?\n\n"
    },
    {
      "time": " 23 August, 2005 - 8:04am",
      "content": "The Modern Language Assotiation (MLA) puts out a [style guide](http://web.archive.org/web/20051126220835/http:/en.wikipedia.org/wiki/The_MLA_style_manual).\n\nI believe the MLA standard is _not_ to include web addresses in body copy, but to list them in something such as a bibliography or list of references. I think that web addresses in running copy look really ugly, but how to get around it…?\n\n"
    },
    {
      "time": " 23 August, 2005 - 12:31pm",
      "content": "I like paul’s suggestion. At least in editorial content, I always prefer a sidebar where the URLs are pulled out separately.\n\n"
    },
    {
      "time": " 24 August, 2005 - 11:45am",
      "content": "I am a bit of a professional amateur, so please forgive me for the next question.  \nAs Hrant suggested I tried to insert a _logical not_ to break E-mails and URLs. I am having a few problems:\n\n1. the text is justifed and that means it is hyphenated. How do I get rid of the hyphen and replace it with the logical not?\n2. when I inster a logical not at the end of a sentence, the sentence doesn’t break in the right place. The sentence either moves forward or backward. What is it that I am doing wrong appart from being a obvious beginner?\n\n"
    },
    {
      "time": " 24 August, 2005 - 1:03pm",
      "content": "Sebastien,\n\nTry adding a logical not at the place where you want the line to break and press shift+enter.\n\nI hope that works for you.\n\n"
    }
  ]
}
