{
  "id": "14786",
  "title": "Creative Review Type Design Awards",
  "forum": "Home",
  "tags": [

  ],
  "content": "—  \n**_Honouring excellence in typeface design_**  \n(in association with the Typographic Circle)  \n—\n\nCreative Review invites members of the Friends of St Bride to submit entries for its first ever type design award. Any typeface designed, first sold or first used between June 2004 and October 2005 may be submitted to the competition. Entries will be judged with reference to aesthetics, craftsmanship, technical excellence, originality and suitability for use. The winning entries will be those which, in the opinion of the judges, best combine all these qualities. The judges will select a winner and runners-up for each category.\n\nDEADLINE  \n5 October 2005\n\nJUDGES  \nBruno Maag, _Dalton Maag_  \nNick Hayes, _Identikal_  \nDave Wakefeld  \nFiona Ross  \nJason Smith, _Fontsmith_  \nDomenic Lippa, _Lippa Pearce_\n\n—  \nFor further information and an application form please visit  \n [www.typevents.com](http://web.archive.org/web/20060329211739/http:/www.typevents.com/) or www.creativereview.co.uk  \n—\n\n",
  "author": "Miss Tiffany : 23 August, 2005 - 8:42am",
  "time": "",
  "uid": null,
  "comments": [
    {
      "time": " 23 August, 2005 - 11:00am",
      "content": "Nice contesst, congratulations to the Friends of St Bride initiative.\n\nMy question:  \n- Which are the prizes?\n\nBest,\n\nmh\n\n"
    },
    {
      "time": " 30 August, 2005 - 10:18pm",
      "content": "The prize is probably publication in their magazine. Which makes me ask: what do people know about Creative Review, in terms of “suggestive influence”, and among what category of people?\n\nhhp\n\n"
    },
    {
      "time": " 31 August, 2005 - 6:40am",
      "content": "Creative Review is probably the best known (which shouldn’t imply it is the best, although there is a dearth, so it is popular) magazine on design in Britain. Over the last five years or so it has been trying to reposition itself and never quite achieving the right blend for my tastes. In appearance it is a square(ish) format, the layout is gridtastic. The demographic is designers in all media, mainly graphic. Recently it has published a 2 part interview with Matthew Carter which although interesting, was fairly superficial, and Bruno Maag has just started a column on typography, which I have seen as a pdf from the [Dalton Maag website](http://web.archive.org/web/20060329211739/http:/www.daltonmaag.com/news/19.html).  \nMy (jaded) opinion is that it makes a good magazine to leave in reception for clients to glance through but not a very satisfactory read.  \nI visited the site and downloaded the entry form out of curiosity but there is no mention of what the prize(s) are, I suspect that Hrant might be right. Bruno Maag often contributes here so maybe he can expand on that.  \nTim\n\n"
    }
  ]
}
