{
  "id": "148",
  "title": "Tiresias",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Anyone have any comments on Tiresias? It is a typeface designed for those with low vision, and comes in several flavors: for printed matter, computer monitors, signage, etc.   \n   \nThe designer is listed as Dr. John Gill, with help from Bitstream. A little more digging brought up the name Peter O'Donnell (Type Consultant).   \n   \nThe site at [http://www.tiresias.org/index.htm](http://web.archive.org/web/20131018231128/http:/www.tiresias.org/index.htm) has a bunch of interesting stuff.   \n   \nJay Fraser\n\n",
  "author": "jay",
  "time": "15 May 2003 — 2:21pm",
  "uid": "956",
  "comments": [
    {
      "time": "20 May 2003 — 9:59am",
      "content": "... as in, does anyone know how they came up with that particular design? What were the influences, etc.?   \n   \nI'm wading my way through the research that's posted on their site, but all I've been able to understand is that Tiresias is more readable than Ariel or TNR. I'd like to know why.   \n   \nAnyone? Thx.   \n   \nJay\n\n"
    },
    {
      "time": "20 May 2003 — 10:22pm",
      "content": "don\n\n"
    },
    {
      "time": "1 Jun 2003 — 2:58pm",
      "content": "Try asking Joe Clark - he once interviewed Dr Gill.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jun 2003 — 12:48am",
      "content": "Tiresias was developed by Gill after finding the closed captioning font on his television difficult to read. There was an article about this in a Print Magazine from about a year ago. At that time there was no italic, not sure if that has changed.\n\n"
    },
    {
      "time": "13 Jun 2003 — 1:20am",
      "content": "Joe Clark is quite critical of Tiresias, but I can't remember the details of his criticism.\n\n"
    },
    {
      "time": "13 Jun 2003 — 7:41am",
      "content": "Joe's criticism (at least the one in his Print piece) was partly based on an admission by Gill himself (during an interview) that the whole process was a committee-decision type deal with deadline pressures and inadequate direction.   \n   \nTo me that just means it could have been even better, since I think Tiresias is a useful design.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jun 2003 — 11:37am",
      "content": "I gave up trying to read the research; I never did find the \"why\". If it was a committee-driven process, that kind of follows.   \n   \nBut even if they published the minutes of the meetings, that'd give a little more insight as to how they came up w/ the design.   \n   \nI'll try to find that Print article. Thx.\n\n"
    },
    {
      "time": "25 Jun 2003 — 2:55pm",
      "content": "I am visually impaired and involved in design of products for the visually impaired. Am using Tiresias right now as my personal style sheet main font and it looks great.   \nMy question is what are the alternatives if any? Prior to using this as my default web font I was using Verdana, what else?\n\n"
    }
  ]
}
