{
  "id": "14808",
  "title": "wedding invitation font suggestions/questions....",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hello all! i'm a newbie and have spent hours and hours searching for the fonts for my wedding invitations on myfonts.com and came up with the following ones i love:  \nscript - Inspiration ROB (like best cuz it's funky and more casual)  \nrest of invite - garden party or cataneo light OR  \nscript - p22 Ruthie  \nrest of invite - locarno light\n\nmy questions are these: will those fonts work in a smaller size? say 14 to 16? do you have any other suggestions for good fonts that won't cost me an arm n leg and that will print nicely? also, does the P22 mean anything on the font name - like it prints best or only at 22 pt?  \nthank you so much for your help!! have a great week! karen\n\n",
  "author": "tweekgirl27",
  "time": "24 Aug 2005 — 7:08am",
  "uid": "8930",
  "comments": [
    {
      "time": "24 Aug 2005 — 7:20am",
      "content": "P22 is the foundry name: it has nothing to do with what sizes it will print best at. Most of the invitations we do in our print shop are set no smaller than 16 point, with 20-24 pt. being most common. Maybe it's because older recipients have poorer eyesight (and are more likely to have bigger bank accounts = better gifts).\n\n"
    },
    {
      "time": "24 Aug 2005 — 7:45am",
      "content": "If you like \"Inspiration\" I cannot recommend [Ministry Script](http://web.archive.org/web/20130612014347/http:/www.veer.com/search/results.aspx?keyword=ministry+script&pricemodel=RF,RM&producttype=IMG,ILL,TYP) highly enough!\n\nIt's also an opentype font that pushes it's glyph set to the max!\n\n(which is nice)\n\n{n.a–b}  \nest.1971\n\n"
    },
    {
      "time": "24 Aug 2005 — 8:09am",
      "content": "I recently did [my sister's wedding invitation](http://web.archive.org/web/20130612014347/http:/typophile.com/system/files?file=InviteRedux.gif) in Ministry Script and she loved it. I splurged on the type cuz its part of my present to her and i just wanted an excuse to purchase it. but if you're looking for something a little easier on your invitations budget, it looks like [Rob Leuschke](http://web.archive.org/web/20130612014347/http:/www.myfonts.com/search?search%5Btext%5D=rob+leuschke) designs are what you're looking for. If you like the Minsitry Sript suggestion, take a look at some more stuff by [Sudtipos](http://web.archive.org/web/20130612014347/http:/www.sudtipos.com/fonts2.htm). I just love their scripts. If I ever get married, I'm gonna use [Plumero Script](http://web.archive.org/web/20130612014347/http:/www.myfonts.com/fonts/sudtipos/plumero-script/) on my invites.  \n...oh and [p22](http://web.archive.org/web/20130612014347/http:/www.typophile.com/wiki/p22) fonts should work at any size, if they don't email me directly! ;^D\n\n"
    },
    {
      "time": "24 Aug 2005 — 12:48pm",
      "content": "I used Dalliance on ours. Our whole wedding had a 'traditional with a twist' thing.\n\n"
    },
    {
      "time": "24 Aug 2005 — 1:03pm",
      "content": "I would love to see someone get funky with [Zanzibar](http://web.archive.org/web/20130612014347/http:/www.fountain.nu/catalogue/zanzibar.asp) on their wedding invites. Can't have a wedding without swashes!\n\n"
    },
    {
      "time": "24 Aug 2005 — 1:29pm",
      "content": "I think P22 Ruthie won't work well at the smaller sizes - it's got lots of fine details. I just made [my invitations](http://web.archive.org/web/20130612014347/http:/www.itsmyinternet.com/wedding_invitation.jpg)in [P22 Avocet](http://web.archive.org/web/20130612014347/http:/www.p22.com/sherwoodtype/avocetset.html), which has nice alternatives and ligatures.\n\n"
    },
    {
      "time": "24 Aug 2005 — 1:30pm",
      "content": "i have that in mind for a second marriage, zara... ;^P\n\n"
    },
    {
      "time": "25 Aug 2005 — 9:55am",
      "content": "thank you one and all for your suggestions! i really appreciate your helpfulness. i've narrowed it down to between two \"types\" of invites and am still working on the font situation. it looks like the smallest they'll need to go w/b 16 pt (but that's from using bradley hand from word, so not sure what the actual font will need to print at to make it fit). must say i do LOVE the ministry script but think it's a bit formal for what we'll be doing (not much formal or traditional about this wedding!) :D thanks again!\n\n"
    },
    {
      "time": "31 Aug 2005 — 1:30am",
      "content": "Karen - do post your invitation if you've got time for feedback. Heck, you should post it even if you don't have time, I for one am curious on how your unformal non-traditional invitation will turn out.\n\n"
    }
  ]
}
