{
  "id": "14807",
  "title": "Good Newspaper Serif",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Working at a newspaper right now, and it's in desperate need of a redesign. Any ideas on a good serif font with a lot of styles and weights that looks good on newsprint? Downer's \"Paperback\" is one of my early thoughts. Ideally it would be fresh and reasonably new.\n\n| Attachment | Size |\n| --- | --- |\n| [Avenues.jpg](http://web.archive.org/web/20131012195534/http:/typophile.com/files/Avenues.jpg) | 101.31 KB |\n| [AvenuesSpread.jpg](http://web.archive.org/web/20131012195534/http:/typophile.com/files/AvenuesSpread.jpg) | 802.48 KB |\n\n",
  "author": "glutton",
  "time": "24 Aug 2005 — 6:24am",
  "uid": "1204",
  "comments": [
    {
      "time": "24 Aug 2005 — 7:10am",
      "content": "It's not terribly new and it's often overlooked, but [Poppl Pontifex](http://web.archive.org/web/20131012195534/http:/www.bertholdtypes.com/adobe_lib/080245000.html) is classic but slightly edgy, has a reasonably large x-height (reads well in small sizes), and has an expert range to go with it.\n\n"
    },
    {
      "time": "24 Aug 2005 — 7:13am",
      "content": "Thanks, that's a good suggestion. I do appreciate its readibility. Any other suggestions?\n\n"
    },
    {
      "time": "24 Aug 2005 — 7:54am",
      "content": "how about Dolly? Or Storm's Lido?\n\nI found a delightful (and delightfully outdated) book about a week ago called _Functional Newspaper Design_ published in 1956 by Edmund C. Arnold (then editor of Linotype News) which, not surprisingly, pushes Corona rather strongly.\n\nIn no particular order, why not look at:  \n Criterion (URW++)  \n Worldwide (Shinntype)  \n Andulka (Storm)  \n Kandal (Mark Simonson)\n\n"
    },
    {
      "time": "24 Aug 2005 — 7:57am",
      "content": "OurType's Arnhem doesn't have a broad range, but it's a very attractive design.\n\nAnd, of course, you should check out the broad offerings at Font Bureau.\n\n"
    },
    {
      "time": "24 Aug 2005 — 8:12am",
      "content": "when i was working at a newspaper and wanted to redesign, I really wanted [Miller Daily](http://web.archive.org/web/20131012195534/http:/fontbureau.com/fonts/MillerDaily). unfortunately, my corporation wouldn't spring for the idea, so i left... ;^P  \nOh, and one thing... newspaper readers want their content to be serious, so the typeface should be, to quote hrant, \"honest.\" IMO, Paperback, although very gorgeous, is too decorative for news usage. i mean i love the design, so much so that i'm looking for an excuse to license it, but i think it would just be inappropriate in a news setting.\n\n"
    },
    {
      "time": "24 Aug 2005 — 8:33am",
      "content": "That's a great comment about the seriousness of the typeface, Paul. The publication in question is an \"Arts & Entertainment\" sort of deal and possibly we could get away with a more playful typeface. But we have a sister publication that is more conservative and I want a new face for that one too.\n\nKandal is really cool and also is appropriate in that the paper is located in Mark's hometown of St. Paul, Minn. I got a PDF specimen of that to add to the stack.\n\nKeep 'em coming!\n\n"
    },
    {
      "time": "24 Aug 2005 — 8:50am",
      "content": "FontBureau is the biggest foundry for newspaper types. If you talk to them they will give you suggestions. The new Mercury from Hoefler & Frere-Jones (typography.com) has special newspaper weights. And Nick Shinn (Shinntype.com) has newspaper types that a number of papers use.\n\n"
    },
    {
      "time": "24 Aug 2005 — 8:57am",
      "content": "I really like PDF specimens and I wish H&F-J and Nick had them.\n\n"
    },
    {
      "time": "24 Aug 2005 — 9:03am",
      "content": "I'm really grooving on [Farnham](http://web.archive.org/web/20131012195534/http:/www.fontbureau.com/fonts/Farnham) the most of everything I've seen. It's a little on the crazy side but maybe that's good! This newspaper needs a little zing.\n\n"
    },
    {
      "time": "24 Aug 2005 — 9:13am",
      "content": "for A&E i think it's pretty much perfect.\n\n"
    },
    {
      "time": "24 Aug 2005 — 9:25am",
      "content": "That's not a question, that's a book! :-)  \nA lot of good suggestions so far. But we still need to know at least the basics about the paper and its readership. Yes, a newspaper font needs to me more transparent than most, but there are still so many choices that narrowing it down based on things like the \"angle\" of the newspaper, the age of its readership, etc. actually helps - noting once again that Design is largely about constraints.\n\nhhp\n\n"
    },
    {
      "time": "24 Aug 2005 — 9:30am",
      "content": "Check Gerard Unger´s type collection:  \n [http://www.gerardunger.com/allmytypedesigns/allmytypedesigns01.html](http://web.archive.org/web/20131012195534/http:/www.gerardunger.com/allmytypedesigns/allmytypedesigns01.html \"http://www.gerardunger.com/allmytypedesigns/allmytypedesigns01.html\")\n\nmh\n\n"
    },
    {
      "time": "24 Aug 2005 — 9:43am",
      "content": "I agree with Hrant and I think you have good suggestions. However —\n\n1. What kind of paper? daily— more news? weekly— news+ stories?\n\n2. What is the size of the paper?\n\n3. B/W only? with color?\n\n4.Why \"it’s in desperate need of a redesign\"?\n\nA typeface is only one part of the redesign.\n\n"
    },
    {
      "time": "24 Aug 2005 — 9:57am",
      "content": "The paper is monthly ,full color, neighborhood news combined with regional entertainment. Paper size is tabloid, usually around 40 pages. The demo is 35-55 and loaded.\n\nThe paper is in need of redesign because nobody here was a designer until I came. I put an example of the cover of the paper in the original message in this thread. And it actually looked much worse than the jpg because the ink gain made the colors less contrasty.\n\nAs you can see it needs a lot more help than just a new typeface. The font is just one part of a myriad of solutions.\n\n"
    },
    {
      "time": "24 Aug 2005 — 10:22am",
      "content": "BTW... right side, white text — what is that? grocery list? :)\n\nDo you have another sample? spread?\n\n"
    },
    {
      "time": "24 Aug 2005 — 10:26am",
      "content": "You are probably aware of the newsfeed here from\n\n[http://www.newsdesigner.com/blog/](http://web.archive.org/web/20131012195534/http:/www.newsdesigner.com/blog/ \"http://www.newsdesigner.com/blog/\")\n\nand the links there. If not, check them out; newspaper design is a whole field in itself.\n\n"
    },
    {
      "time": "24 Aug 2005 — 10:33am",
      "content": "Yeah, those are story \"teasers\" though how a whole paragraph of text could actually tease someone I'll never know.\n\nI don't want to slam my coworkers... they're great people. I just want to help make a great publication even better.\n\nI put a spread up on the initial message.\n\n"
    },
    {
      "time": "24 Aug 2005 — 10:43am",
      "content": "Gotta say Farnham is indeed a great choice!\n\nA couple of others you might not have considered are [Meridien](http://web.archive.org/web/20131012195534/http:/www.myfonts.com/fonts/linotype/meridien/medium/) (lovely sharp serifs) or [Apolline](http://web.archive.org/web/20131012195534/http:/www.typofonderie.com/alphabets/view/Apolline/?SID=75ba8de25a74bebf9fcaddcb6ebd415d)  \n(delicious ligatures though very \"classique\").\n\nGood luck...\n\n{n.a–b}  \nest.1971\n\n"
    },
    {
      "time": "24 Aug 2005 — 10:48am",
      "content": "In reply to - Miguel Hernandez:\n\nDon't know how I've missed seeing [Gulliver](http://web.archive.org/web/20131012195534/http:/www.gerardunger.com/allmytypedesigns/allmytypedesigns14.html) before!\n\nWhat a fine piece of work that is... Mmmmm must get Newspaper client...\n\n{n.a–b}  \nest.1971\n\n"
    },
    {
      "time": "24 Aug 2005 — 11:07am",
      "content": "John:\n\nSo what is your plan? what do you want to change/can change (i.e. layout...)?\n\n\"I don’t want to slam my coworkers… they’re great people\"\n\nI'm sure they are great.\n\n"
    },
    {
      "time": "24 Aug 2005 — 11:29am",
      "content": "1) The logo needs to be tweaked to improve contrast.  \n2) The cover design needs to be taken out of the realm of the template. Each cover must be designed individually, with sufficient leadtime to allow for a good job.  \n3) I want to expand the selection of page templates and provide for more editorial color -- boxes, lines, and headlines in full color.  \n4) The headline and body fonts need to be replaced with cooler options.  \n5) Strict guidelines on typography need to be instituted to elminate the tracking-together of glyphs and the widows & orphans which are in almost every story.\n\nOne stumbling block is that page layout is done by the editors -- us production people do photoshopping and ads only.\n\n"
    },
    {
      "time": "24 Aug 2005 — 11:47am",
      "content": "_page layout is done by the editors_\n\nthat was the problem with my paper, too. wassup with that? if they're going to take on that function, they should take basic design classes or take it upon themselves to read up on design concepts for newspaper.\n\n"
    },
    {
      "time": "25 Aug 2005 — 6:47am",
      "content": "I've published an overview of newspaper typefaces in Typo magazine issue #1. Although it was written in the end of 2002, I think it is still a good source of information about the topic. You could download it here [http://www.magtypo.cz/download/TYPO\\_2003\\_01.pdf](http://web.archive.org/web/20131012195534/http:/www.magtypo.cz/download/TYPO_2003_01.pdf \"http://www.magtypo.cz/download/TYPO\\_2003\\_01.pdf\") - it's free.\n\n"
    },
    {
      "time": "26 Aug 2005 — 9:55am",
      "content": "If you e-mail Hoefler & Frere-Jones they'll most likely be able to provide you with a .pdf sample. I have a Mercury showing they were gracious enough to send, and have also previously requested one from Lucas Fonts for a few of their faces which they provided as well. Speaking of which - you may want to check out LucasFonts \"The Antiqua\" series.\n\n"
    },
    {
      "time": "29 Aug 2005 — 5:58pm",
      "content": "I am the editor of a small student newspaper, and we just went through a redesign initiated by my Ad Manager and myself. We went from Palatino (a good basic font) to a great one called \"Utopia\"... the link is below. It can go very small before the visibility is compromised. We keep it at 9 pt with a 10pt leding.\n\nTake a look:\n\n[http://www.myfonts.com/search?search%5Btext%5D=utopia](http://web.archive.org/web/20131012195534/http:/www.myfonts.com/search?search%5Btext%5D=utopia \"http://www.myfonts.com/search?search%5Btext%5D=utopia\")\n\n-Andrew Welfle\n\n"
    },
    {
      "time": "30 Aug 2005 — 3:46am",
      "content": "[http://www.magtypo.cz/download/TYPO\\_2003\\_01.pdf](http://web.archive.org/web/20131012195534/http:/www.magtypo.cz/download/TYPO_2003_01.pdf \"http://www.magtypo.cz/download/TYPO\\_2003\\_01.pdf\") - it’s free.  \nIt's not there for me. Anyone else?\n\n"
    },
    {
      "time": "30 Aug 2005 — 4:57am",
      "content": "\\>I really like PDF specimens and I wish H&F-J and Nick had them.\n\nSorry I don't have individual PDF specimens for my fonts (except Bodoni Egyptian).  \nOne of many \"must-do's\".  \nHowever, there is a PDF of my whole collection (one page per typeface) on my home page, which gives some idea.\n\nA good PDF resource for news faces is [www.newseum.org](http://web.archive.org/web/20131012195534/http:/www.newseum.org/ \"www.newseum.org\").  \nYou can download today's front pages for hundreds of papers from around the world.  \nAnd Acrobat enables you to identify the faces used.  \n(Two with mine in are The Birminghman News, Alabama, and the Globe and Mail, Canada)\n\n"
    },
    {
      "time": "30 Aug 2005 — 11:22am",
      "content": "Thanks, Nick, I downloaded the big specimen PDF.\n\nRight now the faces I like the best are Mercury and Farnham, but oy, the prices on those two! I don't think a little paper like ours can afford $1400+ for a 5-user license.\n\n"
    },
    {
      "time": "30 Aug 2005 — 12:04pm",
      "content": "Well, I showed my font printouts to the owner and he picked six that he liked:\n\nDelicato by Mr. Hattenbach  \nFarnham by Mr. Schwartz  \nGrad & Kandal by Mr. Simonson  \nMercury by H&F-J  \nWorldwide by Mr. Shinn\n\nSo, some beautiful faces are on the shortlist. Thanks for your help!\n\n"
    }
  ]
}
