{
  "id": "14801",
  "title": "Client Extranet Software",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I realize this might be a far stretch for this forum, but where else do I have to turn?\n\nI am looking for some suggestions for a Client Extranet Software. This would need to be PHP based with MySQL database conncetions. Run on Apache.\n\nIt's purpose would be for client proofing/approval/communication.\n\nI am trying to find some suggestions, as we re-structure our online proofing.\n\n",
  "author": "<a href=\"/web/20110625050540/http://typophile.com/user/1286\" title=\"View user profile.\">Hildebrant</a>",
  "time": "<br>",
  "uid": "1286",
  "comments": [
    {
      "time": "",
      "content": "Mac or Windows?\n\n"
    },
    {
      "time": "",
      "content": "Its not a client side application we are looking for. Rather a server side application. Which would be run on a Apache Server, utilizing PHP, and a MySQL database.\n\nThis would be a web-based client extranet.\n\n"
    },
    {
      "time": "",
      "content": "I've not used it myself, but everyone seems to recomend [Basecamp](http://web.archive.org/web/20110625050540/http:/www.basecamphq.com/index.php).\n\nI've not managed to find a usable open-source one.\n\nEd.\n\n"
    },
    {
      "time": "",
      "content": "I will check that one out.\n\n"
    },
    {
      "time": "",
      "content": "It seems to be much more project management, than a client extranet. All we really need is a extranet proofing application.. preferably one we can tweak code on. Suggestions?\n\n"
    },
    {
      "time": "",
      "content": "This is a good site, but it seems to be broken right now:\n\n[www.opensourcecms.com/](http://web.archive.org/web/20110625050540/http:/www.opensourcecms.com/ \"www.opensourcecms.com/\")\n\nIt listed heaps of open source content management systems and let you preview them all. It rated them too.\n\nNot as open source, but a huge list:\n\n[http://www.cmsmatrix.org/](http://web.archive.org/web/20110625050540/http:/www.cmsmatrix.org/ \"http://www.cmsmatrix.org/\")\n\nGood luck\n\n"
    }
  ]
}
