{
  "id": "14805",
  "title": "Omnium Sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "This is Omnium Sans. He is the shy younger brother of Omnium Serif. He hasn’t actually talked yet but he seems very reserved and he has a much quieter personality than his sister. He has similar aspirations, but tends to follow in her shadow, supporting her and allowing her to have most of the glory. This dynamic makes them happy playmates, I think.\n\nLike his older sibling, Omnium hopes to grow up to be a text typeface. His family history suggests that he’ll be about 10pt tall. His sister is a semi-light-- more of a book than a regular—and he hopes to follow in her footsteps, appearing the same colour on the printed page.\n\nThey definitely have the same parents, or do you think the postman was involved?\n\nA PDF of Omnium Sans can be viewed here:\n\n[http://omnium.danmilne.fastmail.fm/files/Omnium\\_sans\\_30.pdf](http://web.archive.org/web/20131012115423/http:/omnium.danmilne.fastmail.fm/files/Omnium_sans_30.pdf \"http://omnium.danmilne.fastmail.fm/files/Omnium\\_sans\\_30.pdf\")\n\nThe Typophile Thread for Omnium Serif is here:\n\n[http://typophile.com/node/14576](http://web.archive.org/web/20131012115423/http:/typophile.com/node/14576 \"http://typophile.com/node/14576\")\n\nI’d love to hear your thoughts.\n\nThanks,\n\nDan\n\n",
  "author": "Dan Milne",
  "time": "24 Aug 2005 — 3:42am",
  "uid": "8741",
  "comments": [
    {
      "time": "24 Aug 2005 — 9:35am",
      "content": "I can see the family resemblance! :-)\n\nThis is looking pretty solid already. The caps especially are actually really good; this is a font that should have smallcaps. The \"m\" and \"C\" are a bit wide. The bar of the \"K\" stands out a bit too much. The \"Q\" has too much serif in it. I'd make the \"T\" a bit narrower. The bottom of the \"U\" is malformed.\n\nFor 10 point, it's pretty light, and a bit loose. In fact I think it would be useful to match the serif in color and fit. If we assume the serif to have stabilized, the sans should be a bit tighter and slightly darker.\n\nI predict this sister-and-brother team is gonna be famous, in  \na starlet kinda way I mean, not like the Osmonds or anything. :-)\n\nhhp\n\n"
    },
    {
      "time": "25 Sep 2005 — 7:59am",
      "content": "Here is a [revised version](http://web.archive.org/web/20131012115423/http:/omnium.danmilne.fastmail.fm/files/omnium_sans_65_ital_44.pdf) of Omnium Sans. I’ve added the italic and small caps.\n\nAlong with some minor changes to the character shapes, I’ve increased the weight of the roman slightly and tightened it up considerably. I’ve had a lot of trouble with spacing the roman: in trying to match the serif in colour. Any suggestions?\n\nI haven’t touched the kerning pairs yet.\n\nI'd love to hear your observations / criticisms.\n\nCheers,\n\nDan\n\n"
    },
    {
      "time": "26 Sep 2005 — 5:27am",
      "content": "Could you put the [previous PDF](http://web.archive.org/web/20131012115423/http:/danmilne.fastmail.fm/Omnium_sans_30.pdf) back online?  \nThis new vesion looks very good, but I would like to be able to compare it to the previous one.\n\n-- [omine.net](http://web.archive.org/web/20131012115423/http:/www.omine.net/)\n\n"
    },
    {
      "time": "26 Sep 2005 — 7:40am",
      "content": "My apologies.\n\nThe previous PDF is now back online. I have updated the original link as well.\n\nCheers, Dan\n\n"
    },
    {
      "time": "4 Oct 2005 — 4:47am",
      "content": "I have recut [omnium sans.](http://web.archive.org/web/20131012115423/http:/omnium.danmilne.fastmail.fm/files/omnium_sans_107.pdf)\n\nI have further simplified the curves and terminals and have removed most of the flaring from the stems, so that it better matches its [serif counterpart.](http://web.archive.org/web/20131012115423/http:/typophile.com/node/14576) I see this sanserif as a secondary typeface for the serif, so I don’t want it to compete for attention.\n\nI have also simplified the s, which I felt was disturbing the peace [before.](http://web.archive.org/web/20131012115423/http:/omnium.danmilne.fastmail.fm/files/omnium_sans_65_ital_44.pdf)\n\nOh, and I’ve loosened up the spacing some.\n\nI appreciate any feedback you can provide.\n\nThanks very much,\n\nDan\n\n"
    }
  ]
}
