{
  "id": "14816",
  "title": "The contextually sensitive notan",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "i was actuall thinking about this recently, but eben put it very succintly when he wrote:\n\n_At one point I was trying to convince Hrant that if the caligraphic quality found in dutch type could be married to a carefully made set of conditional substitutes in open type font, then an opportunity for a better interletter spacing or ‘notan’ could be reached - similar to what a latin caligrapher naturally would do. Or what arabic & chinese/japanese caligraphers do. What made me think about it was the way in which japanese/chinese charcters have to be written out. Each of the complex characters is made of an accumulation of simpler parts. A bit like a word is made with letters but arranged with more freedom of relative placement. When a kanji/character is written it is made \\*very\\* contextually. When I look at your logo work I see a lot of that contextual sensitivity. That is one of the things that deeply impressed me about your work. So far I don’t think Hrant agrees with my ‘more caligraphic’ idea - for long texts anyway. I think that he thinks that the best inter letter spacing and legibility will be achived not by a bigger set of conditional shapes but instead by better ‘notanic’ design of the glyphs and the spaces between them._ typophile thread [software developer](http://web.archive.org/web/20131217075731/http:/typophile.com/node/12648?from=50&comments_per_page=50)\n\nI tend to agree with Eben. I mean some letter combinations are just nightmares. For example, \"ra\" can leave a big hole in the middle of the word. (or is that just in poorly designed faces?) wouldn't text benefit overall if you had contextual alternates or ligatures that took into account the notion of notan? Comments please!\n\n",
  "author": "paul d hunt",
  "time": "24 Aug 2005 — 2:44pm",
  "uid": "7006",
  "comments": [
    {
      "time": "24 Aug 2005 — 3:52pm",
      "content": "Absolutely!\n\nI am working on a large project right now, creating a stylised redraw of some actually quite famous handwritten text, and I didn't realize at the inception of this project exactly how many of the letter combinations would end up essentially as ligatures. I thought maybe 20-25% of the pairs would end up that way but it's more like 50-55%!\n\nIf I am ever able to fully flesh this work out into a bona fide typeface (something I **really** hope is possible), I have already realized it would need some pretty complex utilization of the opentype format.\n\nIn fact, what you've quoted from Eban above is almost _exactly_ what would need to be done.\n\n{n.a–b}  \nest.1971\n\n"
    },
    {
      "time": "24 Aug 2005 — 6:22pm",
      "content": "Thanks for starting this thread! I don't know that I am correct about this notan/type idea, but intuitively it seemed strange to me to talk about notan completely outside of the context of the caligraphic process that gave rise to the term.\n\nI have thought a tiny bit more about this since I wrote about this. Some of this is probably obvious but...\n\nAs Spiekermann & Smeijers remind us, type needs to serve a purpose - or put another way, it has to be grounded in a context. Context is partly use - In this case we are talking about a text face. But it is also the environment/technology in which the face is used.\n\nFor example, to be successful a text face that used this idea/technique would probably have to used in a very high rez envirnoment like paper or film - as opposed to a computer screen. I think the subtle shifting implied by a caligraphic kind of adjustment/replacement would tend to look overly blurry on screen except at pretty large sizes. So a font using this approach would have to be targeted at appropriate use. But this is a pretty small issue in a way.\n\nThe most serious reasons that doing this would be quite hard are:\n\n- First, it will be difficult to integrate what is done almost reflexively and without much analytic process by a caligrapher 'in the moment' to what has been a comparatively analytic and much slower process of font design. The two processes are like different kinds of personality. The person who successfuly makes 'contextual replacement based notanic text faces' ( how is that for jargon?) will probably have to have to be sympathetic/sensitive to both the slow & the fast kinds of creative process'. It might even take a team of two or more people to get both kinds of skills and insight.\n\n- Secondly, and maybe more difficult, our text face culture has for a long time developed a fine sense of what is possible, beautiful and fuctional in the context of a stable set of design options and limitations. Even massive technological change from metal to photo & then to computer type has not shifted the idea that there is one shape for an 'a' in the font.\n\nOur whole idea of what a text face is ( and our whole text face culture ) is based on superb adaption to these limitations. To throw off the idea of a single a ( or maybe 3 to 5 of them for point sizes ) is to throw out a basic tenant of text face design that begins with gutenberg. This is no small mental leap - like that of kerning pairs. It would be a fundamental shift in culture.\n\nThe exception proves the point - we have gone backwards in many cases because type designs are mostly not made specifically for a given pt. size any more - a kind of hold over of caligraphic awareness now mostly discarded. To have a more complete kind of progress we would idealy have contextual substitution for text size as well.\n\n- Third, The work load imposed by this kind of change is enormous. It is this core simplicity that made the shift from scribe to type such a big advantage. For example, assume you made a single weight and the letter 'a' required mere 5 variations in shape & kerning, add to this for the sake of purity some pt size variations. Say 5 of them. Now we have 25 'a's. Now make a bold & a thin and their italics. 6x25 is 300. Small caps? Double it - 600. Numerical variations don't concern us yet. And that is for what was formerly one glyph, or with the weights & so on : 40 glyphs. 40 to 600 is big change. I have a feeling I am underselling the complexity of this by a factor of 2x to 4x. But the point is it would be a hell of a lot of work.\n\n- Fourth and finally, the slowest kind of change we see in the font world is that of text types. Some have blamed the conservatism of users/editors/reader. Whatever the reason, or the rightness or wrongness of this the text face made in this way would have to face a notoriously tough audience.\n\nI still love the idea anyway.\n\nBTW - When I wrote \"When I look at your logo work I see a lot of that contextual sensitivity. That is one of the things that deeply impressed me about your work.\" I was writting to Mark Simonson. Here is an example of what I think of as Mark's sensitive and contextual letter/word design.\n\n[http://www.ms-studio.com/Lettering/Resources/baseballbig.gif](http://web.archive.org/web/20131217075731/http:/www.ms-studio.com/Lettering/Resources/baseballbig.gif \"http://www.ms-studio.com/Lettering/Resources/baseballbig.gif\")\n\n"
    },
    {
      "time": "26 Oct 2006 — 6:35am",
      "content": "I've thought a bit more about this and have wondered if trying to make all notans balance \"perfectly\" with the surrounding letter shapes would produce too even a color so that bouma recognition is thrown off (a bit). What say ye, hrant?\n\n"
    },
    {
      "time": "26 Oct 2006 — 9:20am",
      "content": "Over eveness of color is one of Hrant bugbears. Of course optical eveness as measured by computers & sensors is one thing & a dynamic balance is another. I probably agree that the first is undesirable.\n\n"
    },
    {
      "time": "26 Oct 2006 — 9:57am",
      "content": "Information comes from contrast. Totally even color is pure gray - it's a lack of notan. The trick is carefully limiting contrast\\* to avoid errant fixations during reading. The rest is just style.\n\n\\* Which however is not limited to color. Think for example of how two  \nborderline-too-distracting \"g\"s can come together to in fact become too  \ndistracting in pattern.\n\nhhp\n\n"
    },
    {
      "time": "26 Oct 2006 — 10:50am",
      "content": "Hrant, nice points! It might be worth trying to describe what I mean by dynamic balance. I think it is the same sort of thing that Hrant means by contrast. I think we are talking about a balance in which there is a certain amount of regular rhythm but also dynamic swings to keep the eye interested. This dynamic quality is what makes for the contrast Hrant is talking about.\n\nTo be theoretical for a minute, I think these swings should ideally come at the point where Peter Enneson ( if I grok his ideas) might be looking for salient features that distinguish glyphs from each other - the better they distinguish themselves the higher the cue value. However too strong a cue and the overall balance is ruined. I think my idea is that stronger than usual cues which would wreck a conventional typeface could perhaps be better tolerated or even leveraged for better readability if their form could be contextually met & balanced by the next glyph. When I look at Beorcana in the heavy weights and especially the small sizes the forms of the letters individually seem grotesque to me. But they play together beautifully. I think that's because the forms balance each other and because their small size effectively quiets the final imapct of their potent shapes. The reason I mention this is that what I am describing theoretically may sound grotesque at first. But I think it could be wonderfuly strong and balanced too. It might even be that the contextual notanic substitution is most helpful at small sizes...\n\n"
    },
    {
      "time": "26 Oct 2006 — 2:44pm",
      "content": "You know I don't go for the \"rhythm\" stuff. Plus I don't think the eye (here meaning our core perception/cognition mechanisms) needs to be kept \"interested\": I think the eye is a grunt, a (domesticated) animal - it does what it's told, bullishly. Instead of your balance between contrast and regularity (which can be said to be the \"classical\" view) I would offer the duality of bouma decipherment versus the need to flow through a text - if you get my drift.\n\n\\> distinguish glyphs from each other\n\nNot glyphs, boumas.\n\n\\> stronger than usual cues which would wreck a conventional  \n\\> typeface could perhaps be better tolerated or even leveraged  \n\\> for better readability if their form could be contextually  \n\\> met & balanced by the next glyph.\n\nI agree.  \nKeep giving readers due credit in spite of themselves.\n\nhhp\n\n"
    },
    {
      "time": "26 Oct 2006 — 2:48pm",
      "content": "Going back to the essense of this thread:  \nEben, as much as I think your core idea is essentially really great, the part that bothers me about it is perhaps encapsulated in your claim that it would be \"similar to what a latin caligrapher naturally would do\". No. What you need to do is only circumstantially related to chirography; essentially it is <cite>not</cite> related at all to writing facilitation.\n\nhhp\n\n"
    },
    {
      "time": "26 Oct 2006 — 5:02pm",
      "content": "Ach! I am wounded@!\n\nNo, Just kidding. Actually I don't think we actively disagree because the aspect of Calligraphy I am interested in is not the chirography per se but the contextual sensitivity which the caligrapher has in potential par excellance. Much much more than we do. Stone Carvers too. That chirography comes with Calligraphy it may or may not be unfortunate. I am inclined to think that you are basically right about chirography but that your fear of it is maybe over devloped. If it does have an anti-notanic effect I think it is probably compensated for by great contextual notanic adjustment in the best caligraphy. I can't proove this but there you have my idea about it. BTW How are you feeling these days about chirography & stone carving? I am guessing that Chirography may not even be the right term because the tool is different. What about the Chinese brush? I have idea about what you might say but will you indulge me?\n\nI would say similar things about rhythm vs. flow & glyphs vs boumas. I like your ideas but I haven't settled on them.\n\nStill, I appeciate your pointing out my sloppy conceptual construction!\n\n"
    },
    {
      "time": "26 Oct 2006 — 5:48pm",
      "content": "Eben, while I think the notion of 'notan' is one useful concept to describe the kind of balance you are talking about I think it can be somewhat misleading.\n\n1. Kindersley, an master stone carver looked upon design of letters and spacing of letters based on the black, and its dispersion over the advance width. In other words, you are looking at the generally assymetrical balance of different parts of the black of the glyph.\n\n2. The notion of notan has several meanings. Originally 'notan' (nóng dàn in Chinese) means how the artist balances ink of greater and less density in an ink brush painting--in other words shades of black and grey, with the extreme being white.\n\nIn the West, what seems to have been picked up is the significance of the white areas of a painting, drdawing or photograph, particularly when these come to the foreground. The example of the 'yin-yang' symbol is given, for example. Here the white fights with the black for attention on an equal level. In illustrations from China and Japan, examples are often given where, eg. white comes to the foreground as snow, and has presence to the eye of the viewer.\n\nG. Noordzij points out that in this diagram:\n\n ![](http://web.archive.org/web/20131217075731im_/http:/typophile.com/files/NoorddzijIllustration_5388.gif)\n\nthe white and black oscillate, trading places as foreground and background. Noordzij them points out that ordinarily in glyphs for text, the effort is made to \\*avoid\\* this effect. The white is kept in the background.\n\nThat white shape in the background is important, but so is the balance of blacks, as Kindersley's work indicates.\n\nPs. Nick Shinn pointed out to me that sometimes you want more dazzle, particularly in a display face. He explained that he designed [Eunoia](http://web.archive.org/web/20131217075731/http:/shinntype.com/) to get dazzle from the 'picket fence effect'.\n\n"
    },
    {
      "time": "26 Oct 2006 — 6:55pm",
      "content": "William, you have me scratching my head. I am not quite getting you. But clearly you are making an effort so I will too.\n\nRe Kindersley: If I have given the impression that I am interested in plain old balance I apologize. That's not the idea I have at all. Asymetricality is very much needed. And besides the letters themselves don't really lend themselves to anything less. Are you equating the idea of Notan with Pure Symetrical Balance? Surely not...\n\nRE the box example: I do think that the way you acheive good notan with white on black is likely to be different for a whole variety of reasons. But I don't think I am interested in promoting white on black per se... Also, in the field of fine art and in your example there is a substantially constraning frame. Type is different. It usually has an enormous frame for it's size compared to an figure or other element of a painting.\n\nI don't know that I have gotten your points here so I may be responding to the wrong ideas. Would you explain further what your concerns or skepticism is about?\n\nAlso, do you find the problems shown in this thread good exaples of problems to be solved? Perhaps you would characterize the solutions in some other way than involving Notan.\n\nThe lack in this thread so far is obviously graphic examples of solutions. But I hope later on to offer many many examples to all the difficult combinations and to some combinations perhaps that are not obviously problems or are not problems at all too.\n\nI think of Dazzle as being something which cuts evenly from good to bad Notan. Obviously everything effects everything else in type but I think of Notan as not being either pro or anti-dazzle in character. What do you think? Why?\n\n"
    },
    {
      "time": "26 Oct 2006 — 7:35pm",
      "content": "Eben, I wrote \"assymetrical balance\", and never mentioned symmetry. Few letters are symetrical, and cannot be balanced in that way. I am certainly not equating good notan or good type design with symmetry.\n\nI am saying that you can overemphasize the role of the white in good type design. You have to look at the blacks. My icon--my drawing of Caslon Pica II italic ampersand--is in reverse, but it's an example. Getting the terminals the right place in space and the right weight so the whole thing balanced was a matter of looking at how the blacks related, not just the negative space. Because of the spirals there is more assertive negative space here than most characters, but still looking at the blacks is key to achieving good balance and color of the letter. The same for your concern of two characters together that may be awkward--it's not just the negative space but the weight and location of the blacks in relation to each other, and not the shape of the negative space.\n\nI'm not saying I understand this stuff. But I am saying that nobody does. And when it is understood my conviction is that the weight and location of blacks will be important, not just relationships of white and black, and the shape of the negative space.\n\nA few other points:\n\nGood notan in text type is generally anti-dazzle, as Noordzij points out, because dazzle is fatiguing. And you want to be able to read text for extended periods. If you want to dazzle in display type to get attention, that is fine, but it is restricted to that.\n\nTo me, glyphs do have a very constraining frame, theoretically the side bearings and body size; in practice the letter on one or two sides, and the pierced band of white above and below.\n\n"
    },
    {
      "time": "26 Oct 2006 — 10:03pm",
      "content": "\\> your fear of it is maybe over devloped.\n\nOr over-stated. But the plan there is to even the balance against the larger, if less vocal, pro-chirography hordes. Like how smaller dogs [have to] bark louder.\n\nhhp\n\n"
    },
    {
      "time": "26 Oct 2006 — 10:46pm",
      "content": "<cite>Overemphasize the role of the white</cite> &  \n<cite>how the blacks related, not just the negative space.</cite>\n\nIs that happening? Where? How can you tell? Is anyone Just working with Negative Space? I am still not with you yet except that I am inferring you are saying that the black of the glyph is primary perhaps. Is that your point? If so, then you are against the idea of Notan which does suggest that you consider each issue equally. And certainly considering each aspect with seriousness is what Noordzij encourages as well. I can go dig up a quote if anybody wants me to.\n\nWhich is why I don't see how you can relate Notan either for or against to dazzle. Notan is just about a potential balance occuring despite the overwrought conflated claims of new-age art types. It could be a balance between extremes ( lots of dazzle probably ) or a balance of quiet differences. It's still Notan. And actually from a Notanic perspective you can have a successful balance or not. The presence of Notan isn't predicated on that balance. In other words, visual phenomena don't lack Notan as a result of a lack of balance. Notan is just a way of thinking about what's there.\n\nAlso, Has Noordzij ever talked/writen about Notan by name? If so I would love to read that!\n\n<cite> very constraining frame </cite>  \nGlyphs have a very constrained theoretical frame. But in litteral or practical use this frame is only implied only. Notan exists inside the theoretical box where the black might go & outside it too. What's more designing glyphs requires thinking ( sorry boys & girls it's cliche time) thinking outside the em square. ;-) Because there is white out there (usually). See what I mean?\n\nBTW, When I was talking about the frame earlier I was refering to a painting's frame - or the frame of your black box. Neither one is a good example to use for glyphs because the frame is way too tight in comparison. Put another way, I don't think you can compare the notanic relatonship of glyphs & of paintings with each other all that well because the frame on the painting is more defining for that notan than the frame of an em box is. The painting's edge is far far more absolute in almost all cases - except where the painter/sculptor violates this boundry. And in the case of a painting it's surroundings, the color of a room etc effect the Notan of the painting too. The only exception to this that I can think of readily & it is a partial exception; would be a diptych or tryptich where you have two or three painting side by side. Then there is at least a potential relationship.\n\n"
    },
    {
      "time": "26 Oct 2006 — 10:49pm",
      "content": "<cite>smaller dogs</cite>\n\nNow you have me laughing again.\n\n"
    },
    {
      "time": "27 Oct 2006 — 7:50am",
      "content": "\\>I don’t see how you can relate Notan either for or against to dazzle\n\nI thought I was clear, but obviously not. I wrote that \"Good notan in text type is generally anti-dazzle.\" I didn't mean that the balance or influence of white and black on each other--notan--is not operating--it is. I meant what I thought I wrote, which is that if there is dazzle in a text face, particularly the lower case, it is notan operating, but not good notan. In fact 'notan' as seems to be used often to refer just to such assertive white, and I was saying that would be misleading to say we are after that kind of notan in text faces.\n\n\\>\\>Overemphasize the role of the white &  \nhow the blacks related, not just the negative space.\n\n\\>Is that happening? Where? How can you tell? Is anyone Just working with Negative Space?\n\nHere, from the Wikipedia article on Frutiger, is the locus classicus of this discussion:\n\n\\*\\*\\*\n\nThe form of the Yin and yang, perfectly balancing black and white impressed Frutiger...\n\n[quoting Frutiger]  \n“The white surface of the paper is taken to be ‘empty’, an inactive surface, despite the visible structures that are present. With the first appearance of a dot, a line, the empty surface is activated. A part, if only a small part, of the surface is thereby covered. With this procedure, the emptiness becomes white, or light, providing a contrast to the appearance of black.\n\n\"Light is recognizable only in comparison with shadow. The actual procedure in drawing or writing is basically not the addition of black but the removal of light. The sculptor's work also consists essentially of taking something away from the block of stone and in this manner forming it: the final sculpture is what remains of the material” (Rauri, ?)\n\nA professor of Frutiger's, Alfred Williman said: “Do not apply black but cover up white, so as to make the light of the white sheet active.” (Traces) Frutiger took this as his mantra.\n\n\\*\\*\\*\n\nFrutiger is one of the greatest type designers, and awareness of the influence of white is important, and he was right to emphasize it.\n\nBut the quote from the professor taken literally as a 'mantra' is misleading, as the Noordzij illustration shows. In text faces we want to keep the light as background in text faces, not push it forward. The occassional rare character, such as the italic Caslon ampersand or swash Q, which do have the 'vibration' of whites asserting themselves, add a pinch of spice to a text face (the italic itself appearing occasionally as a complement to the much more readable roman). But in general, contrary to the 'mantra', the whites should stay in the background.\n\nAs to results, there is just better and worse type. I don't know how it was arrived at. What we are talking about here is the heuristic to guide the process of drawing type. I think Noordsij's diagram shows that we shouldn't take Frutiger's teacher literally when we draw type.\n\nThe other part of this which is quite important is the fact that Kindersley was able to get pretty far in spacing issues looking at the black alone.\n\nBut at this point I have to get back to drawing type!\n\n"
    },
    {
      "time": "27 Oct 2006 — 8:42am",
      "content": "Armin Hofmann, reknowned Swiss graphic designer and educator at the Basle school, demonstrated and taught the importance of negative space. His philosophy about it sounds very much like Frutiger's. Typographer Emil Ruder also was a great proponent of negative space defining positive space an vice versa. He also used the term \"activates the space\". Ruder and Hofmann were colleagues at the Basle school and certainly were friendly with Frutiger. If you look at both Hofmann and Ruder's books from the mid 60's, you may see what I mean.\n\nChrisL\n\n"
    },
    {
      "time": "27 Oct 2006 — 8:56am",
      "content": "Like positive and negative space, rhythm needs counter-rhythm. The expected pulse of stroke and counter widths is countered by the variations that the individual glyphs bring to bear and the shape of their adjoining space in interaction. All of these things can build notan and the recognition of pattern broken by the counter pattern glyph pairings make. It may be that the replacement scheme that Eben seeks to make more harmonious fit and more even color could actually harm pattern recognition and defeat the balance. An r next to a v can be a problem to space compared to an n next to a u but this visual \"problem\" may actually aid in recognition of the glyph pattern forming notan. I don't know this to be true at all. I just feel it is as valid a concept to explore as alternate glyph substitution.  \nCalligraphers naturally adjust each character to meet its neighbor but I have never seen data that says this aesthetic quality reads better than type without alternate contextual substitution. That would be intriguing research! Compare very fine calligraphy to equal quality typography to see if there are truly advantages in writing over typesetting. I personally doubt it but I have been wrong countless times before :-)\n\nChrisL\n\n"
    },
    {
      "time": "27 Oct 2006 — 9:22am",
      "content": "\\> considering each aspect with seriousness is what Noordzij encourages as well.\n\nLip service.\\* You can't get there from chirography.  \nYou have to be averting your gaze not to see that.  \nLook to Bloemsma istead.\n\n\\* Reminds me of Israel saying: \"No, we LOVE the Lebanese people, really!\"  \nWell, not the fairest comparison certainly, but just as tragicomic.\n\nhhp\n\n"
    }
  ]
}
