{
  "id": "1482",
  "title": "Bloemsma Past and Future",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "What do people (specifically you) think about the   \nwork, philosophy, and potential of Evert Bloemsma?   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "21 Jul 2002 — 12:56pm",
  "uid": "1250",
  "comments": [
    {
      "time": "21 Jul 2002 — 3:35pm",
      "content": "Great work...   \n   \nHe's working with one hand in the very old tradition of typedesign, and on the other, he's pushing the limits of it. His 'Balance' typedesign is a sort of hommage towards Roger's Excoffon Antique Olive (very un-dutch in it's design; compare it with the 'traditional' dutch-designers like Gerard Unger & martin majoor). His other typefaces, like 'avance' & 'cocon' are very modern and unique.   \n   \nHis typefaces are always from extreme quality.   \n   \nI'm sorry, for my bad english. I'm dutch. (I've just finished my study at the art-academy in Arnhem, the netherlands; where Evert Bloemsma has studied also.)\n\n"
    },
    {
      "time": "5 Aug 2002 — 2:14pm",
      "content": "I was looking at a special awards issue of ID magazine, and they gave an award to a book called \"John Kelly\", and it uses the rara avis Avance to great effect (I'll know more when I see the book itself), both in text and titles. But of course there's nothing about the font in the award review...   \n   \nhhp\n\n"
    },
    {
      "time": "5 Aug 2002 — 4:16pm",
      "content": "there are publications, from the fontshop, about evert bloemsma types.\n\n"
    },
    {
      "time": "5 Aug 2002 — 5:11pm",
      "content": "Could you please elaborate?   \n   \nhhp\n\n"
    },
    {
      "time": "6 Aug 2002 — 4:16pm",
      "content": "Hrant,   \n   \nI'm sorry, I didn't make it very clear, but the fontshop (in Holland) made a few excellent publications, regarding some of their typefaces. Like the Scala, Quadraat, Fago and also the Avance (by Bloemsma). Note!! ...they're all designed by dutch designers (I know that Ole Schafer, who designed the 'FF Fago' is German, but he studied in the Hague typedesign...)   \n   \nI think the publications can be ordered at [http://www.fontshop.be](http://web.archive.org/web/20131018143750/http:/www.fontshop.be/) (the interface is in dutch, that might be difficult)   \n   \n& recently, the book 'letters' was published in Holland. The book is enterily in Dutch but it consist of many texts by typographers like 'Erik van Blokland, Bram de Does (from the beautiful Lexicon & Trinité, by [http://www.TEFF.nl](http://web.archive.org/web/20131018143750/http:/www.teff.nl/) ), Gerard Unger, Martin Majoor, Fred Smeijers, and... Evert Bloemsma.'   \n   \nthere is a small view of the book at   \n [http://www.zooproducties.nl/prod21.html](http://web.archive.org/web/20131018143750/http:/www.zooproducties.nl/prod21.html)   \n   \nis this a bit more elaborate?   \n   \nforgive my bad english,   \n   \nML\n\n"
    },
    {
      "time": "6 Aug 2002 — 4:36pm",
      "content": "\\> Scala, Quadraat, Fago and also the Avance   \n   \nI have the first three (and the Profile one also, #5), but am delighted to learn that there's one for Avance - I'll request it from them pronto - thanks.   \n   \nBTW, is the Avance booklet the #4? And did #6 (Dax) already come out?   \n   \n\\> [http://www.zooproducties.nl/prod21.html](http://web.archive.org/web/20131018143750/http:/www.zooproducties.nl/prod21.html)   \n   \nYet another reason to learn Dutch...   \n   \nThanks!   \n   \nhhp\n\n"
    },
    {
      "time": "7 Aug 2002 — 4:44pm",
      "content": "Hello Hrant, in fact the #4 is (Meta) and I have the #6 (Dax) since 5 or 6 mouths ago.   \n   \nRegards / Ricardo\n\n"
    },
    {
      "time": "7 Aug 2002 — 5:07pm",
      "content": "Thanks Ricardo - I need to ask them for those too! (Say NO to font addiction...)   \n   \nSo is the Avance one a separate publication?   \n   \nhhp\n\n"
    }
  ]
}
