{
  "id": "14824",
  "title": "Typography Collage/Poster",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hey guys/girls, I had a little bit of extra time tonight and this is what became of it. Purely a collage of a lower case Didot Bold 'y'. Maybe I was thinking about Pirates of the Caribbean that I watched earlier, not really sure. Opinions? Throw it out? Keep it? I kind of like it...but what do you think? It was kind of random so either way it's all good.\n\nMy only feeling is that it might be a tad top heavy, I'm thinking maybe to add a few y's in the bottom left corner (black) to give some more movement to it. Maybe even move the title down there?\n\nSometimes I do random stuff like this with no real intent and I like to see what others think because as 'art' it's hard for me to critique myself.\n\nThanks.\n\n-Dave\n\n| Attachment | Size |\n| --- | --- |\n| [ymarks.png](http://web.archive.org/web/20150317151436/http:/typophile.com/files/ymarks.png) | 205.78 KB |\n\n",
  "author": "dave bailey",
  "time": "24 Aug 2005 — 7:33pm",
  "uid": "8451",
  "comments": [
    {
      "time": "24 Aug 2005 — 9:45pm",
      "content": "I agree with it being top heavy. I'd make the tag line \"y marks the spot\" more prominent by modifying you layout: try playing with the darher letters converging towards the white area that contains the tag line.  \nAlso, maybe consider making it a bit rougher and dirtier in texture. You could add some transparency to the letters to give it some colour differentiation, thus building up the texture that you have going there.  \nTry to play with the concept that the text is bringing to it: If y marks the spot, what is the spot it is marking?  \nEnjoy!\n\n"
    },
    {
      "time": "25 Aug 2005 — 3:21am",
      "content": "David, I think you've missed the essential beauty of that \"y.\"  \nYou've picked up the strong diagonals in your collage, but negate the contrast of it's gentle teardrop descender.\n\nYou have no \"curves\"... it could have been \"v marks the spot\"... if you chose the \"y\" then explore it's unique shape. Just a suggestion.\n\nBut have fun, it's the only way you can tease beautiful accidents.\n\n"
    },
    {
      "time": "25 Aug 2005 — 3:53am",
      "content": "Of note, take a look at [Oded Ezer's](http://web.archive.org/web/20150317151436/http:/www.ezerdesign.com/) home page. It's essentially a portfolio, but also shows some interesting letterform collages, found object photos, doodles, etc.\n\n"
    },
    {
      "time": "30 Aug 2005 — 3:02pm",
      "content": "Why make an X out of you y's. It might make a nice statement Y marks the spot. That would be a Herb Lubalin type (haha) of solution.\n\n"
    },
    {
      "time": "31 Aug 2005 — 7:03am",
      "content": "I have to agree with Norbert the terminal is definitely worth exploring, you do have a kind of cyrillic vodka label crossed with swastika thing going as well. As far as art/illustration the treasure map/'y marks the spot' concept is hindered by the large grey y on the right and the need for a strapline, although you might want to modify your concept away from the pirate theme (what's on tonight?:) (btw Norbert your link to Oder Ezer's site isn't working).  \nTim\n\n"
    },
    {
      "time": "1 Sep 2005 — 5:07pm",
      "content": "Thanks for all the comments, just getting an outside response really. I abandoned the project. Maybe I'll go back to it someday, maybe not, just a creative venting piece really (evidently not so creative :) )\n\n"
    },
    {
      "time": "1 Sep 2005 — 5:29pm",
      "content": "Absolutely not! It is plenty creative.\n\n"
    },
    {
      "time": "15 Sep 2005 — 9:03pm",
      "content": "Is it just me--when you look in the middle of the X made by the 'y's--does it start to look like a swastika? It's not completely, but it's really close.\n\nJust saying.\n\n"
    },
    {
      "time": "15 Sep 2005 — 9:13pm",
      "content": "You mean the primordial symbol of harmony and good fortune?\n\nhhp\n\n"
    },
    {
      "time": "16 Sep 2005 — 2:01am",
      "content": "I'm glad it's not just me, do you see the cyrillic as well?  \nTim\n\n"
    },
    {
      "time": "16 Sep 2005 — 7:43am",
      "content": "\"You mean the script of the Evil Empire?\"\n\nhhp\n\n"
    },
    {
      "time": "16 Sep 2005 — 7:51am",
      "content": "More the script of a generic vodka  \nTim\n\n"
    },
    {
      "time": "14 Jan 2015 — 4:03am",
      "content": "thanks a lot for this informative post.I like this post.  \n [Learn German](http://web.archive.org/web/20150317151436/http:/languagecentre.net.au/)\n\n"
    }
  ]
}
