{
  "id": "14839",
  "title": "Who on Typophile (or else where) makes Hebrew fonts?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was asked today if I could modify a Hewbrew font. If the modifiucation is easy I may just do it myself but if I am out of my depth I would like to have a list of folks to refer this client to.\n\nHrant, - do you have time?\n\nThanks!\n\n [‹ Number of bars on a yen](http://web.archive.org/web/20071109060727/http:/typophile.com/node/18616 \"Go to previous forum topic\") [char set order ›](http://web.archive.org/web/20071109060727/http:/typophile.com/node/18791 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071109060727/http://typophile.com/user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 25.Aug.2005 1.44pm",
      "content": "My usefulness in Hebrew type design is limited to the “writing system performance” domain, and the couple of Hebrew fonts I did a while back were cheesy imitative efforts, so you don’t want me doing this, especially since there seem to be like half a dozen actual Hebrew type designers here. Just give them a few hours to wake up.\n\nOh, and no, I don’t have time either. :-/\n\nhhp\n\n"
    },
    {
      "time": " 25.Aug.2005 1.58pm",
      "content": "What do you need to modify? what font?\n\n"
    },
    {
      "time": " 25.Aug.2005 2.32pm",
      "content": "Might want to contact Adi Stern or Zvika Rosenberg, both designers are based in Tel Aviv. If you’re looking for a North American based company you could do worse than Ascender (they’ve done Hebrew work), John Hudson of course, and I think Monotype Imaging have Hebrew expert on staff.\n\nCheers, Si\n\n"
    },
    {
      "time": " 25.Aug.2005 4.07pm",
      "content": "Thanks for all the answers! Now I can pass this on if I need to for sure.\n\nI finally got the font to look at it. The font is a terrible mess because it was made from auto-tracing. In order to spare the company involved I won’t name the foundry ( if you can call it that ) or the ’designer’. In fairness, it is probably a small market. Think how hard it is to sell a font for english use?\n\nI have a couple of questions:\n\n- For future reference what Hebrew fonts are actually well made?\n\n- Some hebrew specific questions: When You have a daled with a sh’va & a dagesh (dot) the sh’va should still be centered under the leg or descender of the daled right? What about the size of the sh’va? Should it become smaller when there is a daled - or stay the same size?\n\n"
    },
    {
      "time": " 25.Aug.2005 4.16pm",
      "content": "Zvika has a library of OpenType Hebrew fonts. Adi’s Reading Uni font Noam won a TDC prize.\n\nYou might want to check out SBL Hebrew for model behavior. Contact me off-list and I’ll get you a less complex model font with VOLT sources.\n\nCheers, Si\n\n"
    },
    {
      "time": " 25.Aug.2005 4.24pm",
      "content": "Awesome!\n\n"
    },
    {
      "time": " 25.Aug.2005 6.50pm",
      "content": "“When You have a daled with a sh’va & a dagesh (dot) the sh’va should still be centered under the leg or descender of the daled right? “\n\n“What about the size of the sh’va? Should it become smaller when there is a daled - or stay the same size?”\n\nEdit: Eben, I emailed you a sample.\n\n"
    },
    {
      "time": " 25.Aug.2005 7.04pm",
      "content": "If I remember rightly from reading Ada Yardeni’s ’Book of Hebrew Script’ in modern times some of the most well received and most used text fonts have been Frank-Ruehl, Hadasa, David and Narkis. You can see many, many at [Masterfont’s web site](http://web.archive.org/web/20071109060727/http:/www.masterfont.co.il/web_articles_show_e.php?article_id=1)\n\nThe names are listed in Hebrew script, though.\n\n"
    },
    {
      "time": " 25.Aug.2005 8.14pm",
      "content": "Thank you for the sample David!\n\nAs far as posting pictures - when I have not started the thread & can’t post to the directly I post things to the web & link to them. It’s not a great work around but it’s okay.\n\nWould you like me to post the image you sent me to this thread?\n\nI was wondering, what features of a font have been seen as attactive in Narkis etc. - especially for extended text book use?\n\n"
    },
    {
      "time": " 25.Aug.2005 8.45pm",
      "content": "“Would you like me to post the image you sent me to this thread?”\n\nYeh, why not.\n\n“I was wondering, what features of a font have been seen as attactive in Narkis etc. - especially for extended text book use?”\n\nOh, this is like you ask about Sabon, Caslon, Janson...\n\n"
    },
    {
      "time": " 23.Mar.2006 12.59pm",
      "content": "IMHO the best Hebrew fonts are made by Fontbit in Israel. [www.fontbit.co.il](http://web.archive.org/web/20071109060727/http:/www.fontbit.co.il/ \"www.fontbit.co.il\").  \nIf you need a font fixed up, then it depends what you need. If you need the outlines cleaned up, then you should contact Fontbit. If you have outlines and you need the font converted for Opentype (including nikud) then the expert is Arieh Marzel. If you need to contact him, then get in touch with me off-line since he doesn’t like his contact details posted online for obvious reasons.\n\n"
    },
    {
      "time": " 23.Mar.2006 1.15pm",
      "content": "Oh, and Habib Khoury, multiple winner at the TDC with his Hebrew faces, is as nice as he’s talented and skilled - let me know if you need to get in touch with him.\n\nhhp\n\n"
    },
    {
      "time": " 24.Mar.2006 8.10pm",
      "content": "Thanks for the updates folks. I have no continuing need myself ( at the moment ) but no doubt the information is usefull to typophiles.\n\n"
    }
  ]
}
