{
  "id": "14833",
  "title": "Identity for group promoting creativity.",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello everyone.  \nI have been reading these forums for quite a while and finally decided to register.\n\nI am doing an identity for a group whose purpose is to promote creativity, in the form of the arts, music, etc. So I thought it would be cool/useful to see what you, the good people of Typophile, thought were some fonts that ’feel’ innovative, exciting, and/or creative. I am not as knowledgeable as I would like to be on available typefaces, and I am looking to expand my collection, as well as find a good font to use as a starting place for this logo.\n\nThanks.\n\n-Nate\n\n [‹ Good Newspaper Serif](http://web.archive.org/web/20080828043449/http:/www.typophile.com/node/14807 \"Go to previous forum topic\") [Hiring a freelancer... ›](http://web.archive.org/web/20080828043449/http:/www.typophile.com/node/14887 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080828043449/http://www.typophile.com/user/8944\" title=\"View user profile.\">nate p</a>",
  "time": "<br>",
  "uid": "8944",
  "comments": [
    {
      "time": " 25.Aug.2005 10.18am",
      "content": "[http://www.myfonts.com/fonts/linotype/blue-island/](http://web.archive.org/web/20080828043449/http:/www.myfonts.com/fonts/linotype/blue-island/ \"http://www.myfonts.com/fonts/linotype/blue-island/\")\n\nhhp\n\n"
    },
    {
      "time": " 25.Aug.2005 10.22am",
      "content": "i’d hafta say that fonts that _are_ innovative will _feel_ innovative. I think a good reference would be [Typographica’s list of favorite fonts for 2004](http://web.archive.org/web/20080828043449/http:/typographi.com/000969.php). These are all innovative designs in different ways. You’re bound to find something that’ll work for you on that list. Some personal favorites on this list: Auto, Andulka, Olduvai & Pill Gothic.\n\nI think typographica’s list is due for an update sometime soon as well, so there will be new favorites posted in the next few days?\n\nan aside... you really love that Blue Island, doncha Hrant? why is that?\n\n"
    },
    {
      "time": " 25.Aug.2005 10.30am",
      "content": "I used to think it’s cheesy, but when I started growing up about ligatures I realized its depth. Hopefully one day Jeremy will make the full OT version he’s always dreamed of. BTW, the single most amazing use of Blue Island I’ve seen was in Huda AbiFares’s “Experimental Arabic Type” - simply genial.\n\nhhp\n\n"
    },
    {
      "time": " 25.Aug.2005 5.11pm",
      "content": "thanks for your helpful suggestions!\n\n"
    },
    {
      "time": " 26.Aug.2005 8.13am",
      "content": "I also think the individual characters within the name often inspires treatment. Once you know the “signature” (written name like “Coca-Cola” or “FedEx”) you (or we) can begin exploring possibilities.\n\nThink of the “ [**A&E**](http://web.archive.org/web/20080828043449/http:/saltlake2002.paralympic.org/front_features/assets/ae_network.gif)” logo.\n\n"
    },
    {
      "time": " 29.Aug.2005 7.01pm",
      "content": " **My issue with Blue Nile is** that it is so overly mannered and unique, that if you use it for an identity, and someone else uses it for an identity, you really end up lacking any form of identity at all.\\*\n\nThis is something find myself ranting about quite frequently. There is something to be said for a touch of neutrality in CI typography. Now if you were able to have exclusive license, or custom development of something like Blue Nile, you are in even better shape. But if this is available to all, then it is something I would strongly suggest staying away from.\n\n_\\*Let me know your address so I can bill you for the word of wisdom. ;-_\n\n"
    },
    {
      "time": " 29.Aug.2005 7.16pm",
      "content": "Whenever anyone actually uses the term “creativity” to describe almost anything, I get the creeps, because I know that the last thing they are really after is “creativity”.\n\n"
    },
    {
      "time": " 29.Aug.2005 7.23pm",
      "content": "The one key about using typefaces with a lot of character is to not use them direct from the can. I wouldn’t shy away from a typeface simply because it might have too much character, but I would make sure its character supported the character of the company.\n\n"
    },
    {
      "time": " 29.Aug.2005 10.19pm",
      "content": "Tiffany,\n\nI am going to disagree with you (strongly) on this topic. I don’t disagree with the type supporting the ’character’ of the company — that is a very basic aspect of any corporate identity. I still stand behind the idea of too much ’typographic character’ in a publicly available font, used as a wordmark for a corporation/organization, as being a bad thing.\n\nI have witnessed multiple situations where this type of application has put the business in a very bad position.\n\n"
    },
    {
      "time": " 29.Aug.2005 10.25pm",
      "content": "Allow me to give an example:\n\nTwo florist shops both set thier name in the Papyrus font. One is called Southland Florist, the other is Sally’s Florist. This is a potentially very confusing identity for the consumer to digest.\n\n"
    }
  ]
}
