{
  "id": "14837",
  "title": "Arial alternate - no laughing please",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I have to present a business plan which is REQUIRED to be set in Arial 12pt, this made me feel sick and want to relinquish to a good business oportunity but I'm trying to figure my way out of this and I'm looking for a good Arial alternate besides Helvética which can make a good text work and not being evident to the untrained eye of the bureaucrat.\n\nHéctor\n\n",
  "author": "rs_donsata",
  "time": "25 Aug 2005 — 10:59am",
  "uid": "1530",
  "comments": [
    {
      "time": "25 Aug 2005 — 11:09am",
      "content": "Unica.\n\nhhp\n\n"
    },
    {
      "time": "25 Aug 2005 — 11:11am",
      "content": "Come on Héctor,  \nJust use Arial. Taken in small doses it's not lethal.\n\n"
    },
    {
      "time": "25 Aug 2005 — 11:31am",
      "content": "The bureaucrat may not spot that the font has changed but they'll likely smell that something isn't quite right and that may cause them to be generally suspicious of your submission.\n\nPerhaps keeping the body in Arial 12pt would stay within the letter of the law but do something more interesting with the display typography and any captioning or small print.\n\nSi\n\n"
    },
    {
      "time": "25 Aug 2005 — 11:41am",
      "content": "I've grown to appreciate Unica almost as much as Hrant. Unfortunately it's hard to find these days (ask Linotype why). How about the lovely [GalaxiePolaris](http://web.archive.org/web/20131019025710/http:/vllg.com/Village/GalaxiePolaris/)?\n\n"
    },
    {
      "time": "25 Aug 2005 — 12:31pm",
      "content": "Akzidenz Grotesk, Helvetica's parent, has a much smaller x-height and better spacing. Use that at 12 point, and the suits might not notice, but the overall effect would be much less [horsey](http://web.archive.org/web/20131019025710/http:/typophile.com/wiki/horsey). Might even be pleasant, readable even!\n\n"
    },
    {
      "time": "25 Aug 2005 — 1:35pm",
      "content": "Arial is like white bread. It's universally available, almost tasteless and nonetheless nice once in a time… I like it toasted with cream cheese and some paste of chili!\n\nOK – No joking: there is a whole history of imitation, plagiarism and so on with those ubiquitous sans serifs, BUT there is a reason why they are used so often.\n\nAnd being Dutch, I think you should use OUR copy (at least that's the one we had in our cases in the print shop of the academy) and that's called Folio (guess what: there are several digitized versions available, as far as I know, but so what, you process any of the others through FontLab and there is...).\n\nThe latest one is an OpenType...\n\n"
    },
    {
      "time": "25 Aug 2005 — 2:56pm",
      "content": "are you submitting it electronically? Perhaps that's the reasoning.\n\n"
    },
    {
      "time": "25 Aug 2005 — 3:04pm",
      "content": "Héctor, I hate to be the boring conservative ... are you planning on discussing the change with your client?\n\n"
    },
    {
      "time": "25 Aug 2005 — 3:24pm",
      "content": "Perhaps do what they want, and draft an alternative. politely show them afterwards why your new and improved version is much better, and suggest that they take it up. Don't just change it, you are being paid by them afterall! Think long-term, break them in. If they aren't interested, then do you really want to work with them?\n\n"
    },
    {
      "time": "25 Aug 2005 — 4:22pm",
      "content": "I'd relinquish on the small fights, but hold firm on the big ones...\n\n"
    },
    {
      "time": "25 Aug 2005 — 4:45pm",
      "content": "\\> I’ve grown to appreciate Unica almost as much as Hrant.  \n\\> Unfortunately it’s hard to find these days (ask Linotype why).\n\nUnica is available at the new Scangraphic site:  \n [http://www.myfonts.com/url?7175869274b81103a23e8280b93084b3](http://web.archive.org/web/20131019025710/http:/www.myfonts.com/url?7175869274b81103a23e8280b93084b3 \"http://www.myfonts.com/url?7175869274b81103a23e8280b93084b3\")\n\n(The Scangraphic font library has been acquired by Elsner+Flake)\n\nAdam\n\n"
    },
    {
      "time": "25 Aug 2005 — 9:33pm",
      "content": "I'm impressed by the good response I got, thanks a lot!\n\nActually the paper is for me, I'm in a contest for a business coaching and funding program and all the papers are required to be set in Arial at 12pt, so I guess the client is going to be pleased with the change ;).\n\nUnica and Galaxie Polaris are very nice options which I would love to try but I only have Helvética and some weights of Azkidenz Grotesk so I think I'm going to stick to any of those two.\n\nNow I understand the reason behind asking such a specific setting: avoiding people to deliver business papers in 14pt Comic Sans... I even understand why the chose Arial: it's everywhere. But at 12pt? it looks huge and horrible to me. Sometimes they even ask Arial 12pt double spaced =/\n\nUnica seems to have a very tight setting, is it intended for text or display?\n\nHéctor\n\n"
    },
    {
      "time": "25 Aug 2005 — 10:31pm",
      "content": "Unica's spacing is actually much more conducive to readability than Helvetica's.\n\nhhp\n\n"
    },
    {
      "time": "26 Aug 2005 — 10:03am",
      "content": "One of my favourite sans in the \"ubiquitous\" category is [Swiss](http://web.archive.org/web/20131019025710/http:/www.myfonts.com/fonts/bitstream/swiss-721/swiss-721/), originally released by Bitstream I believe(?).\n\nAnyway, I find it to be much more even in color and tone than Arial or Helvetica with a slight hint of geometric conformity too.\n\nIf any of you smart historian types care to enlighten me more on it's history, I'd be very interested.\n\n{n.a–b}  \nest.1971\n\n"
    },
    {
      "time": "26 Aug 2005 — 6:26pm",
      "content": "Héctor - Like other Scangraphic fonts, Unica comes in two versions with varying spacing. From the [Scangraphic Fonts page](http://web.archive.org/web/20131019025710/http:/www.fontshop.com/showfont.cfm?mid=22) at FontShop:\n\n_Scangraphic offers an extensive range of fonts, all available in two special Scangraphic design formats called “Bodytext” and “Headline”._\n\nScangraphic Bodytext (“SB”) faces are ideal for text in small point sizes. The hairlines and serifs of the Bodytext faces are thicker than normal hairlines and serifs to make them more legible in fine print. In addition to this, they have a special ink-traps incorporated in the font design to prevent blurring and loss of print quality.\n\nThe Scangraphic Headline (“SH”) faces are made for text in large point sizes. Scangraphic optimized the Headline fonts specifically for this purpose, for example, by narrowing the spacing of the fonts and re-designing the umlauts in order to make them work better aesthetically with the overall design.\n\n"
    },
    {
      "time": "29 Aug 2005 — 8:15pm",
      "content": "Héctor, I feel your pain. About once every 2 months I have to deal with an RFP that specifies \"Arial 12 pt\". What's worse, it will also have a page limit, and the engineers I work with consider that a challenge to cram as many words on a page as possible. The result is Arial set 12/12, on a 48 pica line. Makes me cringe, but I get a paycheck every 2 weeks.\n\nI think one option is to use arial, but use it well. Some very good typography has been done w/ grotesks. The fact that some really ugly typography has been done w/ arial shouldn't stop you from using it.\n\nAnother option is to do a work-man job on a arial version, then do an excellent job on an alternate version w/ a different typeface. Use this as an opportunity to educate someone as to the joys of typography.\n\nJay\n\n"
    },
    {
      "time": "29 Aug 2005 — 9:27pm",
      "content": "Thanks Jay, I actually made it in Arial 12 pt since the difference between Helvética, AG and Arial was too much obvious to me, I think that after all it wasn't that bad with a bit of type care.\n\nThanks everyone for your input.\n\nHéctor\n\n"
    },
    {
      "time": "30 Aug 2005 — 2:08am",
      "content": "<cite>Now I understand the reason behind asking such a specific setting: avoiding people to deliver business papers in 14pt Comic Sans… I even understand why the chose Arial</cite>\n\nHéctor:\n\nIt's also possible that they've asked for it in Arial 12pt to stop submitters trying to be creative with their typography so that they can concentrate on what the proposal actually says.\n\nIn my experience, if they're asking so specifically for something, it's best to give it to them as asked. You may be penalised for trying to be creative :) While they may not notice the difference between your alternate choice and Arial in isolation, put next to a number of other documents all set in Arial 12pt, yours will stick out like a sore thumb.\n\nI'd just bite the bullet and go with Arial if I were you.\n\nJordan\n\n"
    },
    {
      "time": "1 Sep 2005 — 8:30pm",
      "content": "That's a smart suggestion Jordan. I actually made it Arial and I hope to be selected.\n\nThanks everyone, I love Typophile.\n\nHéctor\n\n"
    }
  ]
}
