{
  "id": "14850",
  "title": "Serif Question",
  "forum": "Design",
  "tags": [

  ],
  "content": "So I’ve been scanning some sketches and drawing over them in Fontlab/Illustrator…when i got to this one it boiled up a question: is the bottom serif of the letterform ‘d’ in this example considered an ‘ok’ practice?\n\ni went browsing through my small collection of fonts and looked at a few examples online and all i seemed to find were bottom serifs that were nearly the same as the ascender serifs except flipped a little.\n\nso is the hook serif considered ok? it might be a stupid question, but i’m pretty new to this and it’s my only pencil sketch that was really like this (mostly because i don’t draw d’s very well and obsessively draw a’s) also, if this is a method of serif others have used, what is the benefit of ending a letter in this manner in regards to text faces and in contrast to the sharper angled ending serif?\n\nplease note, these sketches are very rough and really unrefined. only for question purposes completely.\n\nthanks  \nw|m\n\n| Attachment | Size |\n| --- | --- |\n| [experiment\\_002.jpg](http://web.archive.org/system/files?file=experiment_002.jpg) | 28.26 KB |\n\n",
  "author": "Will Miller",
  "time": "25 August, 2005 - 8:38pm",
  "uid": "4552",
  "comments": [
    {
      "time": " 25 August, 2005 - 10:26pm",
      "content": "That’s totally OK.  \nFor a “d” that ellicits howls in an otherwise mainstream design, see Perpetua.\n\nhhp\n\n"
    },
    {
      "time": " 26 August, 2005 - 8:01am",
      "content": "Eric Gill had a thing about “d” and not only in [Perpetua  \n](http://web.archive.org/web/20051126203022/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=M.240.0.1&attributes.sampleSize=48&sampleText=bdpq&sampleSize=96) [Gill Sans “d”](http://web.archive.org/web/20051126203022/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=LH.107989.0.18&attributes.sampleSize=48&sampleText=bdpq&sampleSize=96) (but not on all weights)  \n [Joanna “d”](http://web.archive.org/web/20051126203022/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=M.2535.0.1&attributes.sampleSize=48&sampleText=bdpq&sampleSize=96)\n\nYes, I’m old, but I’m d-lightful!\n\n"
    },
    {
      "time": " 26 August, 2005 - 8:18am",
      "content": "Of course old Eric didn’t draw all of the Gill Sanses — some were done by anonymous draughtsmen at Monotype. Maybe that d-feature is the clue to which are Eric’s and which are not… : )\n\n"
    },
    {
      "time": " 26 August, 2005 - 8:20am",
      "content": "Exellent point, Bert!\n\nMaybe Typophile can start a new topic area— “CSI:Type”\n\n"
    },
    {
      "time": " 26 August, 2005 - 9:31am",
      "content": "Not OK to my eyes. On the d, the bottom serif balances the top one, which is prominent in old syle or transition fonts—which yours seems to be. In the ‘a’ you don’t have a serif above it on the same stem, so the design problem is different. Putting the a tail on the d looks weak to me.\n\nAll depends on how the whole face is done, so it might end up looking good in context, but not right now side by side.\n\n"
    },
    {
      "time": " 26 August, 2005 - 11:34am",
      "content": "NO! YOU’RE DOING IT WRONG! ; D\n\nYou can draw a single letter any way you want. If you’re drawing a logo for a product or making a sign, each letter can be its own little gem. No rules. But, it sounds like you want to build a typeface. Typefaces are systems of interchangeable parts that repeat and have to function in any combination, giving a consistent pattern. There’s room for expressiveness, but it has to be distributed and balanced across all the components (letters).\n\nIn my opinion, Eric Gill never really understood this functional difference; he was a lettercarver till the end.\n\nTry setting a few words where the shape repeats: hidden, padding. Then some where the d is paired with similar shapes: armada, audacious. Is your u going to use that tail too? Set words that combine the d with anything else, v, s, t, b, m, n, o. You might want to spend some time drawing the “boring” letters like d, r, i, n, that make up a significant proportion of printed text. If your types have several strong letters and several weak ones, that doesn’t help the typeface, or the reader. You’ll want to have the same confidence in drawing s or j that you have drawing an a. Even a lettering artist needs that skill. Type designers these days are called upon to not only deliver these alphabets but ones from other scripts like Cyrillic and Hebrew.\n\nLook at Jeremy Tankard’s Enigma. In it there are a lot of unconvential shapes, yet he makes them work. It’s not impossible, but it does require a lot of attention to consistency and harmony among the different parts. It’s type, not lettering. Same with Goudy’s Californian. It works.\n\nPlease share more of your alphabet when you get it digitized, Will.\n\n"
    }
  ]
}
