{
  "id": "14860",
  "title": "What's in your work-flow?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,\n\nMy daily routine consists of dropping text into InDesign, fixing it and sending it to the client for corrections. I’ve learned that there are a number of things that you can fix in you clients document before you import it into InDesign. Let say I receive a MSwords document, I will search for double spaces, unecessary paragraph breaks, spaces before final points, comas, interogation and exclamation marks, simple ligatures, etc. Once the text is in InDesign I check on the special ligatures, Euro and other money signs, small caps, bold, etc.\n\nI am interested to know how different people go about this job. Do you follow the same guide? I hope not otherwise this will be one of those pointless self-indulgent forum prose.\n\nCheers\n\n",
  "author": "sebsan",
  "time": "26 August, 2005 - 11:31am",
  "uid": "8785",
  "comments": [
    {
      "time": " 26 August, 2005 - 12:33pm",
      "content": "Sebastien,\n\nI’ve never tried this application myself, but I’ve heard it works wonders. [TextSoap](http://web.archive.org/web/20051111043651/http:/www.unmarked.com/textsoap/) by Unmarked Software. There seems to be versions for both Mac and Windows.\n\n"
    },
    {
      "time": " 26 August, 2005 - 12:44pm",
      "content": "Unless a file has an awful lot of bolding and italicizing in it, I usually save MS Word files as ASCII text, to remove any evil RTF markup that may be lurking therein.\n\n"
    },
    {
      "time": " 26 August, 2005 - 2:25pm",
      "content": "I use TexEdit.  \nhttp://www.tex-edit.com/  \nChrisL\n\n"
    },
    {
      "time": " 26 August, 2005 - 2:36pm",
      "content": "Hi,\n\nTextSoap looks promising. Could save me a lot of time.  \nI work in a design office where I often finish off work started by other designers. Since some of them don’t always save the text in ASCII, I end up rewriting all the E-mail addresses in InDesign because they are all framed in a blue box (I guess evil RTF markup). Is there an easy way to get rid of that blue box around E-mails? Playing with paragraph styles was unfruitful so far.\n\n"
    },
    {
      "time": " 26 August, 2005 - 2:54pm",
      "content": "Hi,\n\nTextEdit looks great, thanks.  \nI guess Automator might perform some of the basic clean up tasks?\n\n"
    },
    {
      "time": " 28 August, 2005 - 11:22pm",
      "content": "_\\>Is there an easy way to get rid of that blue box around E-mails?_\n\nIt is simple: Open word, Open Indesign, Open notepad (or mac equiv.) copy all from word and past into notepad. Copy all from notepad and past into Indesign. Its a fairly common pratice. I reallly easy way to remove all of the RTF formatting.\n\n"
    }
  ]
}
