{
  "id": "14891",
  "title": "Is Letterhead Fonts wrong?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Continued from the EULA discussion. Started by Lauri's comment:\n\n_Not sure if this has been covered yet, but it looks like Letterhead Fonts won’t release any new fonts before they have a working activation/copy protection in place (link). It looks like some of their fonts were pirated and they won’t have none of it.  \nNot sure how possible this is, and how it will interfere with the workflow… I’m really curious to see how this gamble will work out._\n\nAbout this link: [http://www.letterheadfonts.com/support/viewtopic.php?t=179](http://web.archive.org/web/20150124161701/http:/www.letterheadfonts.com/support/viewtopic.php?t=179 \"http://www.letterheadfonts.com/support/viewtopic.php?t=179\")\n\n",
  "author": "Miss Tiffany",
  "time": "29 Aug 2005 — 1:03pm",
  "uid": "108",
  "comments": [
    {
      "time": "29 Aug 2005 — 1:33pm",
      "content": "Tiffany,\n\nThanks for starting a new thread about the topic.\n\nI don't know that much about ttf, otf, or ps font technology, but I would think that [Letterhead Fonts](http://web.archive.org/web/20150124161701/http:/typophile.com/wiki/Letterhead%20Fonts) won't be able to do that much to the font files themselves, but they'd need some kind of a secondary program that controls and limits the use of the font on their machine. How could they stop a registered user of the font, to open the font in FontLab and recompile under a different name? And this \"new\" font would then not have the same restrictions as the original.\n\n"
    },
    {
      "time": "29 Aug 2005 — 1:38pm",
      "content": "As Simon mentioned, not only will their EULA probably become hellacious, but they will proably annoy some potential customers. I love their type, I won't be one of the annoyed, but they will annoy some people.\n\nSimon, can't they turn some little switch within the software to create limitations? I see to recall that House Industries did this for PDF embedding.\n\n"
    },
    {
      "time": "29 Aug 2005 — 1:48pm",
      "content": "This seems short-sighted to me, from a purely commercial and self-interested perspective. My thinking is as follows:\n\n(1) A foundry only loses financially through piracy if either (a) a person who would otherwise have licensed a font and paid for it does not do so because they buy a pirated copy or (b) people buying pirated copies \"devalue\" the font by using it badly.\n\n(2) But (a) probably very few people who would buy a pirated copy of a font would have licensed it anyway and (b) those people are probably not \"major users\" of the font so they are unlikely to devalue it much.\n\n(3) On the other hand, if you implement a sophisticated automatic licensing system like that proposed (a) it will cost you money to do so which will increase the price of your fonts/reduce your margin and (b) you will probably lose at least some sales because of workflow problems and concerns by users that the technology may become obsolete.\n\n(4) Plus if you suspend sales of new fonts while you develop the system, you lose additional sales on those fonts.\n\n(5) Let P1 be the value of the sales that would be lost to pirates (i.e., the value of the sales from those who would have purchased from you but instead purchase from the pirates: one excludes the value of the sales that are made by the pirates but would never be made by you). Let P2 be the value of the sales that are lost because people will not buy your fonts if they know there are pirated versions out there. Let D1 be the costs of developing the solution. Let D2 be the sales that are lost because people are chary of the technology. Let D3 be the sales that are lost developing the new technology.\n\n(6) It is rational to suspend sales and develop the new technology only if P1 + P2 \\> D1 + D2 + D3. I doubt very much that this will hold: I suspect that P1 and P2 are very small, and that D1 and D2 are quite large. If it did hold one strongly suspects that the bigger commercial foundries (who could develop things like this in-house at relatively low cost) would have done so. You also have to bear in mind that the solution has got to be watertight: if people can extract the outlines, e.g., and use them to make an \"unprotected\" font, then the solution will not have stopped the piracy at all.\n\n(7) My guess is that there are much lower-cost ways to tackle piracy. Expensive as we are it will be much, much cheaper to get lawyers to write nasty letters to E-bay and pirates than it will be go through this hassle.\n\nIndeed, in purely economic terms I suspect that the only reason for foundries to do anything about piracy is that they \"owe it\" to those who have purchased the fonts properly to take some steps in that direction. (If I purchased a font and then found it was freely available, I would be fed up.) From that point of view what you definitely do not do is publicise the fact that you have a problem with piracy.\n\n"
    },
    {
      "time": "29 Aug 2005 — 2:54pm",
      "content": "I wish Letterhead the best with this initiative. It will be interesting to see how it works out. But I fear it's more of an emotional reaction to piracy than a practical one.\n\nA font vendor's R&D money would be better spent in [try-before-you-buy](http://web.archive.org/web/20150124161701/http:/www.subtraction.com/archives/2005/0804_try_before_y.php) technology rather than anti-piracy technology. _New sales_ is where the money is. There is very little cash to be had from those who pirate.\n\n"
    },
    {
      "time": "29 Aug 2005 — 4:03pm",
      "content": "Any technology that puts constraints on the honest punishes the honest for the misdeeds of the dishonest, and will probably only encourage the dishonest to be ever-more ingenious.\n\nA pirate can easily copy music by simply capturing its analogue output. Why am I stopped from moving my MP3s back to my mac from my ipod, forcing me to find and re-encode 150 CDs after a disaster? A typeface pirate can ultimately reproduce a typeface with the same or similar techniques - so why annoy those willing to financially support you?\n\nAs Stephen says, there's little financial support from pirates.\n\nIncidentally, all the music I own is readily available illegally for free. I'm not at all fed up that I bought my CDs though.\n\n"
    },
    {
      "time": "30 Aug 2005 — 12:28pm",
      "content": "It’s difficult, no one can say that these actions are wrong. I just can’t help but feel that hiring the developer to build this system won’t solve the problem. If such a system could be built someone would have done it already, no? Even if the dev pulls it off I think it will have the result mentioned in the other thread ( [http://typophile.com/node/14914](http://web.archive.org/web/20150124161701/http:/typophile.com/node/14914 \"http://typophile.com/node/14914\"))...\n\n1. Honest people might be kept more honest.  \n2. Honest people are annoyed and frustrated by the hoops they have to jump through to use the fonts. Support costs go through the roof, and customer sat goes down the tube.  \n3. Dishonest people will overcome the system and clone the fonts regardless.\n\nPersonally I think this approach (Linotype’s?) is still the most sensible.\n\n1. Unobtrusively stick a unique identifier in the font (serial number if you like) to link a font to a customer in your database. Then you know who’s being bad.  \n2. Trademark the font names. In this country the value is in the names not the design. The cloners will stay away from properly registered TM’s.\n\nCheers, Si\n\n"
    },
    {
      "time": "30 Aug 2005 — 12:37pm",
      "content": "Wrong is a strong word in this case. I love their type and am sad Chuck sees this as the answer. However, it is his foundry and he should be able to license the type how he sees fit. This will be interesting to discuss again when the new site is live and the fonts are available for license.\n\n"
    }
  ]
}
