{
  "id": "14902",
  "title": "Bayopic",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Display / Script",
    "Bitmap Text"
  ],
  "content": "A while ago I created a pixel font based on Herbert Bayer's Bauhaus alphabet, I suppose it could reside in the Bitmap Text area, as it does work pretty well in text settings (IMO) but I think display is right for now.\n\nAny opinions on it would be most welcome and gratefully received.\n\nThanks all.\n\nJordan\n\n| Attachment | Size |\n| --- | --- |\n| [bayopic\\_sample.gif](http://web.archive.org/web/20150317122438/http:/typophile.com/files/bayopic_sample.gif) | 5.27 KB |\n| [bayopic\\_QG4\\_alts.gif](http://web.archive.org/web/20150317122438/http:/typophile.com/files/bayopic_QG4_alts.gif) | 392 bytes |\n\n",
  "author": "Jordan Harper",
  "time": "30 Aug 2005 — 2:17am",
  "uid": "2278",
  "comments": [
    {
      "time": "30 Aug 2005 — 3:14am",
      "content": "Jordan,\n\nI think it looks beautiful; it works really well as pixel font. The only letter I have any problem with is uc Q. It seems like the vertical line at the bottom is a little bit too thick. You would only need to remove one pixel from the tail (or whatever that part is called).\n\n"
    },
    {
      "time": "30 Aug 2005 — 3:50am",
      "content": "Nice, nice... not sure about the rather ornamental uc g, though. Reading the lines it stands out a wee bit too much, i think.\n\n"
    },
    {
      "time": "30 Aug 2005 — 4:03am",
      "content": "very nice, I really like it.  \nI like the uc G. But I agree with antiphrasis that the uc Q seems to be to thick at the bottom. And why is your number 4 not a lining figure like the rest of your numbers?\n\n"
    },
    {
      "time": "30 Aug 2005 — 4:19am",
      "content": "Thanks for the comments all.\n\n**antiphrasis**  \nI agree about the Q, it doesn't look right. But I can't decide what does.\n\n**Bart**  \nI like the ornamental G, but I agree that it doesn't work in text. Maybe I should have a display+text version...\n\n**ine**  \nGood question. The answer re:4 is ... I don't know :) I didn't even notice it stuck out that much! (Which it clearly does). The upper half of it looks very skinny.\n\nI've uploaded some alternates for the controversial characters, let me know what you guys think.\n\n"
    },
    {
      "time": "30 Aug 2005 — 7:47am",
      "content": "This is good stuff.\n\nhhp\n\n"
    },
    {
      "time": "30 Aug 2005 — 8:04am",
      "content": "Thanks Hrant, any opinion on the alternate Q, G and 4?\n\nJordan\n\n**PS** I've uploaded the image to my opening post, as I don't seem to be able to add them to any replies. Nor do I seem to be able to use inline images -- should I be able to?.\n\n"
    },
    {
      "time": "30 Aug 2005 — 8:34am",
      "content": "First, I must say I really like it!\n\nNow, the rightmost 4 isn't good, it just doesn't look much like a 4. As for the middle one, it'll be much easier to tell if you provide of a few strings of different figures with 4 included.\n\nAs for the Q, have you considered making the tail one bit longer? It'll give you more flexibility.\n\nFinally, you might want to consider providing of two different G's, a more usual one and the one with the long tail for special occasions. Anyway, between the two, I like the left one, with the longer tail, better.\n\noribendor\n\n"
    },
    {
      "time": "30 Aug 2005 — 8:40am",
      "content": "Thanks for your input Oribendor.\n\nI think alternate Gs are a must (though I'll probably do it through separate display/text faces).\n\nGood idea re: the Q.\n\nI agree with you re: the 4, I think the middle version is the best, and though this hangs by 1px over the baseline, the glyph doesn't look bottom heavy to my eyes.\n\nJordan\n\n"
    },
    {
      "time": "30 Aug 2005 — 10:47am",
      "content": "I think 3 pixels of descender on the UC might be too much. I like the \"Q\" with nothing coming inside its body. I might descend the \"J\" too. The \"4\": if you're going to allow it to break the bounds I'd try OS nums all around.\n\nSomething bigger: I'd give the lc ascenders an extra pixel.\n\nhhp\n\n"
    },
    {
      "time": "30 Aug 2005 — 1:32pm",
      "content": "That's my favourite Q too. And you're spot on about the captial descenders -- why the G doesn't harmonise with the Q anyway, I don't know. Not overly sure about the J, it may deviate from Bayer's original too much, but it's worth an experiment for sure, and all OS numerals -- that may be a bit too un-Bauhaus for me (or for Bayopic at least) :)\n\nlc ascenders: you may be on to something there.\n\nJord\n\n"
    },
    {
      "time": "1 Sep 2005 — 12:36am",
      "content": "i'm no type historian, that's for sure. this pixel font may or may not faithfully obide by the original bauhaus alphabet's dimensions/porportions--i wouldn't know.\n\nbut i do feel that pixel fonts almost never work as 'renditions' of more sophisticated original typographic works. the reason is, that pixel grids just don't allow for the necessary nuance; the fine variation in width, and flexibility in diagonals to faithfully get the job done.\n\nso: i'd like to see shorter descenders, a higher ascender on the 'k', less width on the 'x', perhaps even less width in the 's' and 'z', make an entirely new font out of the 'G' and remove it from this font, and although you have held a mathematically consistent width for much of the uppercase, it looks oddly inconsistent to me.\n\ni'd try a narrower 'A', 'C', 'F', 'H', wider 'W', narrower 'Z'\n\nalso, you might try to make your x-height the same as your cap-height right now. make the whole font bigger. that way, your more sophisticated 'X' and 'N' and 'Y' might be used for the lowers, and bigger, equally sophisticated uppers may accompany them.\n\nyou'd also have greater control over the width of all of your uppercase characters, which is something you could use right now, in my opinion. one pixel taken from four is a lot more noticeable than one pixel taken from 6.\n\n"
    },
    {
      "time": "1 Sep 2005 — 2:18am",
      "content": "Tyler:\n\nThanks for your comments. FWIW, an example of Bayer's Bauhaus letters can be found [here](http://web.archive.org/web/20150317122438/http:/perso.wanadoo.fr/les.besnardtypo/typographies/ecritures/Images/Dbauhaus.gif) (check out the `g` and the `k`) (how the hell do we post images inline?).\n\nAs you can see, my pixel font is not a perfect 'pixelisation' of the letterforms, the `c`, `g` (to some extent), `s`, `x` and `z` exhibit differences that I choose to make bayopic more readable. For instance, the narrower `x` didn't work at all, it just got lost in the text, and curving the `c` in at the stroke ends just didn't work either.\n\nI think re: the caps, it's important to note that Baypoic isn't supposed to be a text face. The caps and lowercase don't really harmonise because they didn't exist in Bayer's original, initial caps look out of place because they're so wide -- to fit in with the style, not the lc. (Though I agree with you re: the `W`, it's definitely too narrow -- it's the same width as the lc `w` for heaven's sake!)\n\nI think I'll definitely create two faces:\n\n- **Baypoic display:** as seen above, with a wider `W`\n- **Bayopic text:** with narrower Uc, an extra px on the lc ascenders, and one less on the descenders, a less extreme `g` and a more conventional `k`.\n\nAnd I love your idea of a uniheight version -- essentially, Bayer's alphabet was unicase anyway, caps have only been added by designers since. Definitely font-3 in the family :)\n\nThanks again.\n\nJordan\n\n"
    }
  ]
}
