{
  "id": "14905",
  "title": "Generous & Caring?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m going to be working on a 64 or so page booklet/pamphlet highlighting charity events and charities over the next year in the city of Chicago. i was wondering what a good typeface might be for use in text passages and also one that would be used for headlines or as display in conjunction. Maybe a quick explanation as to why for each as well would be really helpful.\n\nthanks-  \nw|m\n\n",
  "author": "<a href=\"user/4552\" title=\"View user profile.\">Will Miller</a>",
  "time": "<br>",
  "uid": "4552",
  "comments": [
    {
      "time": " 30 August, 2005 - 5:42am",
      "content": "What about [Chicago](http://web.archive.org/web/20061127050821/http:/www.myfonts.com/fonts/apple/chicago/)? :-D\n\n"
    },
    {
      "time": " 30 August, 2005 - 5:42am",
      "content": "Or this [Eponymous font](http://web.archive.org/web/20061127050821/http:/www.myfonts.com/fonts/itfmecanorma/chicago/)?\n\n"
    },
    {
      "time": " 30 August, 2005 - 6:43am",
      "content": "I’d use [Goudy Oldstyle](http://web.archive.org/web/20061127050821/http:/www.p22.com/lanston/products/goudyoldstyle.html) or another of Goudy’s faces. His formative years were spent in Chicago, he comes from the mid-west, and his typefaces have the warmth and unpretentiousness that I associate postively with the midwest (I come from there). Goudy Oldstyle will have a reassuring familiary with the generous and caring overtone.\n\n"
    },
    {
      "time": " 30 August, 2005 - 6:47am",
      "content": "Before making suggestions, can you answer thoses questions?. Who will read this book? What types of text passages are they, long or shrot? What size will have the book? On what kind of paper your book will be print. Will you have more than on color for the text?\n\n"
    },
    {
      "time": " 30 August, 2005 - 7:53am",
      "content": "What he asked. Always, first.\n\nhhp\n\n"
    },
    {
      "time": " 30 August, 2005 - 8:25am",
      "content": "Important questions, but I thought Will already answered most of them, or implied the answers. The readership of a charitable pamphlet is likely to have many people over 50 years old, well off contributors or potential contributors. A pamphlet is usually 6 x 9. He implied that there will be some extensive text passages. A pamphlet is usually not on coated paper. There will likely be extensive lists of names of contributors and sponsors…\n\nAm I right?\n\n"
    },
    {
      "time": " 30 August, 2005 - 9:49am",
      "content": "William, pretty much right on.\n\nThe audience is mostly 40 and up crowd. people with money looking to donate and to have a good time at particular charity events through the next year.\n\nthere will be a mix of short and long text passages as their will be many columnar listings and a few features or call-outs of certain events.\n\nthe size will be somewhere between the 6x9 to 8x10 range…(yet to be finalized and decided upon)\n\nthe paper will most likely be matte stock, although this will be running and shipping as an insert to our larger and main magazine, they may get a deal on the stock we are currently using.\n\ntext color will be black with a splash or two of accent color that i have yet to decide upon\n\ni like the idea of the Goudy types…warm and unpretentious, and his Chicago connections are right on. subtle details for those who care. it’s important to not make this look too inaccessible to the general public. this insert booklet needs to span the bridge between the usual reader of our main magazine and the common person who picks it up, not knowing what the main magazine is about (fashion and expensive everything).\n\nw|m\n\n"
    },
    {
      "time": " 30 August, 2005 - 2:50pm",
      "content": "If you are looking for donations don’t make the booklet look cheap by making it small. Make it over-sized, uncoated stock (with a texture (linen?)) with lots of white space.\n\n"
    },
    {
      "time": " 31 August, 2005 - 3:31am",
      "content": "Another Goudy face that might be useful in Village.\n\nI don’t have the new reworking of Lanston Village, but Font Bureau’s version is very nice. The display cuts are good to have.\n\n"
    },
    {
      "time": " 31 August, 2005 - 6:43am",
      "content": "I’ve one suggestion for the text: [Proforma](http://web.archive.org/web/20061127050821/http:/www.fontbureau.com/fonts/Proforma/styles).\n\nAs the headlines or as display in conjunction I’d suggested to choose among this 2 typefaces: [Amplitude](http://web.archive.org/web/20061127050821/http:/www.fontbureau.com/fonts/Amplitude/styles) or [Relay](http://web.archive.org/web/20061127050821/http:/www.fontbureau.com/fonts/Relay/styles).\n\n"
    }
  ]
}
