{
  "id": "14914",
  "title": "Is it time for a DRM'ed format?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I've been gearing up to launch a new version of my site and been busting out some new fonts (some of which will be posted here for critique in the near future), to include taking some of my old, free-for-download fonts, and reworking them into a full character set.\n\nIn poking around the web, I'm dismayed at the number of sites out there that redistribute fonts with impunity, and the number of people asking around in forums for \"clones\"...it really makes me wonder how I'll ever actually recoup my investment in hardware, books, training, art supplies, etc.\n\nSo I'm wondering...is it time to add DRM (digital rights management) to fonts? Maybe a DRM'ed OpenType format? Here in the States, we're not covered by copyright, and I'm sick of seeing others profit from my work. In the past I've been rabidly anti-DRM, but the more I poke around, and the more fonts I see from myself, and the people I know, being offered for free, the more and more annoyed I get.\n\nAnyone have any opinions? Does there need to be an OpenType 2.0 format with support for DRM?\n\n",
  "author": "fontosaurus",
  "time": "30 Aug 2005 — 10:36am",
  "uid": "1587",
  "comments": [
    {
      "time": "30 Aug 2005 — 11:21am",
      "content": "I’d say so. It’s way too easy to steal fonts as it stands. It makes me feel like it would be a really bad idea to attempt to create typefaces for anything other than a hobby. Why create a product that, as soon as it is released, loses it’s initial value because it is free in the eyes of so many?  \nIt could work like the iTunes Music Store’s m4p format. If you buy a license for 5 CPUs, it would have to be authorized on all 5 computers. It would be a big harry deal to get implemented and for it to work across networks but it would be worth it.\n\nJosh\n\n"
    },
    {
      "time": "30 Aug 2005 — 11:49am",
      "content": "_Note: I'm not playing devil's advocate. For a change._\n\nHow will DRM keep people from pirating typefaces?\n\n"
    },
    {
      "time": "30 Aug 2005 — 12:02pm",
      "content": "It wouldn't stop anything. It would just be another small hurtle for pirates to jump,\n\n"
    },
    {
      "time": "30 Aug 2005 — 12:02pm",
      "content": "_How will DRM keep people from pirating typefaces?_\n\nProbably the same way many programs keep people from pirating software. In order to use the font, it would have to be activated over the internet. The process of activation would identify the font registration number and the ID of the computer. A five-seat license would allow activation up to five times, then would refuse to validate any other further requests for activation. Font pirates could steal all the fonts they wanted to, but they would find them pretty useless if they couldn't install them on their computers.\n\nThe BIGGEST problem with this approach is, then, how do you legally send your fonts to a printer or a service bureau? Special exception activation for recognized/registered professionals? Or, maybe, a new font format -- let's call it Portable Font Format -- that would travel with a job, install on one machine and one machine only, download to a RIP, and then self-destruct in _x_ number of days. Or there may be a better, more elegant solution...\n\n"
    },
    {
      "time": "30 Aug 2005 — 12:12pm",
      "content": "Even the most secure and well thought out DRM 'might' help keep the honest people honest (it will annoy them in the process) but it won't stop people from cloning your fonts.\n\nHopefully Tom can talk about Adobe's experience with copy-protection, and why it didn't work out for them.\n\nCheers, Si\n\n"
    },
    {
      "time": "30 Aug 2005 — 12:18pm",
      "content": "I know a little something about the technical aspects of DRM. It's _very_ hard to get right. My advice to type people is to let Hollywood go through all the pain of trying to implement a workable DRM first, and then adopt any successful solutions that may emerge from there.\n\nIn any case, for a bad implementation of DRM to take hold would be one of the biggest boons I can imagine for the free type scene. Bands of font users will happily pool funding for type designers to release their work freely so they don't have to deal with the hassles of DRM, versions of software that don't support it, etc. Of course, monkeys will fly out of my butt first, but that hasn't stopped proponents of DRM from advancing their schemes in the past.\n\n"
    },
    {
      "time": "30 Aug 2005 — 2:45pm",
      "content": "\\> the same way many programs keep people from pirating software.\n\nHeh heh. The only programs where DRM keeps people from pirating them are the ones that are not popular enough to be cracked. Practically every DRM scheme in the world can be cracked, one way or another. In doubt, a cracker can always run the software in a \"sandbox\" environment, wait for the software to unprotect the content and load it into memory, then make a memory dump and put the content back into unprotected form.\n\nSoftware activation schemes can be very very annoying. I nearly returned Acrobat 7 because its activation scheme was implemented in a way that had the program force me to re-activate it about twice a week.\n\nPlus, I hope you realize that a new DRM-protected format would require new operating systems, new applications, new printers and new document formats to be developed. Otherwise, after being unlocked, the font would still need to travel unprotected at some point -- with the risk of being grabbed there. From a PostScript file, PDF file, operating system cache, a Bezier drawing application etc. You cannot protect the outlines from being read, while on the other hand allowing some application to draw the outlines on the screen. It's a conceptual contradiction.\n\nAnd if everything fails, you can always plug an audio in jack into your audio out socket and record the music onto a different device, print the password-protected document, scan and OCR it back in, and do an analogic action to a font.\n\nI think it's already quite an effort and achievement to have a customer pay money for a piece of bits and bytes (e.g. a font) in the first place.\n\nThe best copy protection mechanism for a font is never to release it.\n\nA.\n\n"
    },
    {
      "time": "31 Aug 2005 — 5:06am",
      "content": "_I hope you realize that a new DRM-protected format would require new operating systems, new applications, new printers and new document formats to be developed_\n\nI don't regard that proposition as beyond the realm of possibility, sometime in the near future. Nonetheless, I agree with most of what Adam has said. I'm just wondering why anyone \"talented\" enough to crack ANY protection scheme is bothering with fonts; shouldn't they be working for a spy agency?\n\nIn the end, all of us who make and sell fonts are dependent upon the honest people who respect our work, and are willing to pay for it. The thieves will always be with us: it's an unfortunate fact of life. If you let the thieves dictate your behavior, they've stolen more than just fonts.\n\n"
    },
    {
      "time": "31 Aug 2005 — 11:50am",
      "content": "\\> crack ANY protection scheme is bothering with fonts\n\nThe thing is: it cannot be \"any\" protection, it can be fairly simple at best. \"Spy-quality\" protections can be very sophisticated because they're single-purpose. They are typically used by a small closed group of trained individuals, to communicate within the same organization. A DRM system for fonts cannot be hugely complex because you expect fonts to be used in different environments: different operating systems, different applications, developed by very different people using different software toolkits. OpenType is aiming at ISO standardization now.\n\nOf course, anybody is free to develop their own proprietary font format, with a proprietary protection scheme, and have these fonts work in specialized software. This has been done in the past. DMC Calamus, a professional and very sophisticated layout and typesetting system for Atari ST/TT used its own font format (.cfn) that was protected: each font was encrypted and tied to a specific serial number of Calamus installed by the user. This was 15 years ago and digital fonts were hot stuff back then, so the protection scheme was cracked in no time.\n\nWith more than 50,000 fonts available on the market today, it's really a challenge for the foundry to come up with new qualities for the typeface to be attractive. I think if you build up additional barriers and annoying copy protection mechanisms, you run the risk that potential customers will turn their backs on you. They'll stick with the fonts they have or will go to the competition who sells fonts at more liberal terms. This is already happening. Some vendors try blocking the possibility of embedding their fonts into electronic documents and you will notice customers voting with their wallets: they revert to other vendors who don't have the limitation.\n\nIn my personal opinion, it's better to compete by quality or pricing than by barbed wires and muzzles.\n\nA.\n\n"
    },
    {
      "time": "3 Sep 2005 — 2:10pm",
      "content": "There are many problems with DRM for fonts.\n\nOne big problem is that there are so many reasonable uses of fonts that many foundries might want to permit, which would be nigh-impossible to reconcile with DRM. Oldnick's question about service bureaus is high on the list, for instance.\n\nAs mentioned by Adam, the difficulty of plugging holes is a particular problem. Because fonts are accessed by virtually every application, and must be compatible with virtually all printer drivers, much of the key value of the font must be made accessible to these third party bits. How you let fonts be accessible to apps and printable without exposing the IP so that an application could scoop it up is a big problem.\n\nFinally, there's the problem of ticking off your legitimate users by making things difficult for them. As Raph says, it's very hard to get DRM just \"right\" to strike a useful balance between security and usability. I happen to believe that the DRM currently used by Adobe's apps is one of the least irksome implementations I've ever seen. But Adam's particular workflow manages to totally trip up Adobe's DRM, and it is really an unhappy experience for him (I forget exactly what it is - I think he sometimes boots off an external HD and sometimes not, or something like that). There is no DRM scheme yet implemented that isn't at least this problematic.\n\nAdobe has indeed implemented DRM (copy protection) for fonts three times now. First the earliest Type 1 fonts were tied to a particular output device (this in the days before true WYSIWYG for fonts). We eventually dropped that. Then later we came up with some intricate stuff for install-based protection of Asian fonts (Type 1 CID-keyed fonts). Finally we even flirted with doing much the same thing for OpenType, also intended for the Asian market. But we decided not to go down that path, as well as discontinuing our scheme for protected Asian fonts.\n\nWhy not? When we totalled up the engineering costs, plus the hassle to our users, it really easily outweighed the value of the presumably prevented piracy.\n\nAt the moment, Adobe corporately has approximately zero interest (rounded to the nearest percentage) in DRM for fonts.\n\nAll this being said, if you really want to, you can do DRM for fonts today. PACE Interlok technology works. Of course, you have to pay them a bunch of money (their web site doesn't even say how much). I've seen some Asian fonts that were using it. Of course, we couldn't immediately figure out why the protected fonts weren't working quite right, because the font was encrypted.... [http://www.paceap.com/](http://web.archive.org/web/20131014083224/http:/www.paceap.com/ \"http://www.paceap.com/\")\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "3 Sep 2005 — 2:12pm",
      "content": "Oops, I should have mentioned that Adobe's own protection for Type 1 CID-keyed fonts was using or based on PACE technology.\n\n"
    },
    {
      "time": "3 Sep 2005 — 2:24pm",
      "content": "One last thing. Fontosaurus wrote: \"Here in the States, we’re not covered by copyright....\"\n\nAs stated, this is simply untrue. What is true is that your copyright covers the font software, not the abstract design. But font software is covered by copyright, and this has been upheld in federal court (Adobe vs. SSI).\n\nRegards,\n\nT\n\n"
    }
  ]
}
