{
  "id": "1492",
  "title": "Fontsite/Softmaker: so what?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello Typophiles,   \n   \nI've read the following statement in another   \nthread (Understanding the legal issues...):   \n   \nNathan Matteson:   \n_\"I think James is hitting it right on the head   \nhere. I've been trying to get my school to buy a   \ndecent font collection - even if only for two or   \nthree \"type specific\" labs - for nigh on three   \nyears now. We just had a good instructor quit   \nover the lack of type and the beaurocratic hoops   \nyou have to jump through to [not] get it.   \n   \nAnd the closest we got was our bookstore selling   \nthe dubious FontSite CD. :-/\"_      \n   \nWell, that statement came in good time. I've   \nbeen browsing the websites of many typefoundries   \nlooking for a basic font CD collection to use   \non everyday's work at my office.   \n   \nI've considered all my options, from Bitstream   \nto URW, and they range from U$ 120 to U$ 500...   \nThat was until yesterday, when I found both   \nSoftmaker (Megafont XXL) and Fontsite (CD 500)   \ncollections, priced as low as U$ 39 and U$ 49...   \n   \nSo, what's up here? I've recognized many fonts   \nunder different names but I didn't get if those   \ncollections are legal or even \"ethical\".   \n   \nI'm planning to buy a font CD collection not   \nonly to be \"clean\", but also because I want   \nto make sure that the designers would receive   \ntheir proper royalties. I mean, what would   \nAdrian Frutiger receive if I buy FrontPage\\*   \ninstead of Frutiger?   \n   \nI want to make clear that I'm not distrusting   \nany company/person. I'm just curious why and how   \nthose similar font collections can have so   \ndifferent prices.   \n   \nThere's a Brazilian proverb that says \"o barato   \nsai caro\", wich means something like you cannot   \nhave something for nothing... (In fact, I guess   \nit's not even Brazilian, it's an universal law).   \n   \nBest regards,   \nhC   \n   \n\\* This font equivalence was taken from Luc   \nDevroye's website.\n\n",
  "author": "hugocristo",
  "time": "1 Oct 2003 — 6:40pm",
  "uid": "1542",
  "comments": [
    {
      "time": "6 Oct 2003 — 3:56pm",
      "content": "Well..   \n   \nIt seems that this subject isn't interesting at   \nall or maybe it's too complex to be discussed   \nhere in Typophile.   \n   \nBTW thanks for the messages I've received   \nprivately. I hope I've choosen the right   \npurchase option.   \n   \nhC\n\n"
    },
    {
      "time": "6 Oct 2003 — 4:28pm",
      "content": "Didn't see this thread. Sorry Hugo. From my experience:   \n   \nThe fonts I saw on the Fontsite CD were pretty terrible. Technically. I.e., fonts with absolutely no hinting, contours running on the wrong direction, etc.   \n   \nI never did a comparison between their fonts (e.g., FS Caslon) and a font a _knew_ to be reputable (e.g., Adobe Caslon) so I don't know if they were pure rip-offs or not. (Though I'm interested to do that right now - I'll let you know.)   \n   \nI certainly don't want to suggest that they're an unethical bunch if they're not. But frankly, the fonts are dubious enough to put me off. And really appalling from the technical side.   \n   \nI think those are 2 of the reasons certain font collections are so cheap. Technically inferior & (perhaps) merely stolen outlines from a proper foundry.\n\n"
    },
    {
      "time": "6 Oct 2003 — 4:33pm",
      "content": "OK. That said, I think a lot of my students still use the Fontsite CD (some, unfortunately, for professional work). I suppose it's better to have FS Caslon at your disposal than to be stuck with Times New Roman for every project - if you're broke and you're school (in my case) doesn't provide a proper collection from Bitstream, Adobe, etc. Maybe.\n\n"
    },
    {
      "time": "6 Oct 2003 — 6:18pm",
      "content": "Thanks Tiffany and Nathan for the feedback.   \n   \nBuying fonts directly from the foundry always   \nseemed to be the best choice for me. That's   \nwhy those collections surprised me so much.   \n   \nI've almost decided wich collection I'll buy,   \nprobably Bitstream's Cambridge. But what still   \nmakes me curious is how that font renaming   \nthing works. I mean, isn't there any legal way   \nof preventing an unauthorized redrawing and   \nreselling of an original font? And I'm not only   \ntalking about things like Softmaker/Fontsite's   \nSabon x Savoy, but also like Bitstream's   \nHumanist 521 x Gill Sans.   \n   \nLet me put it better: What else, beyond ethics,   \nprevents anybody from redrawing one of my fonts   \nand reselling them under other names?   \n   \nhC\n\n"
    },
    {
      "time": "6 Oct 2003 — 7:55pm",
      "content": "I think it was the FontSite CD that was discussed on Typo-L many years ago, and it turned out that the guy selling it (Sean Cavannaugh) got the rights to all those fonts legitimately, when the parent font house (I forget who) did a barter with some money they owed him. So it's more the parent font house's fault.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Oct 2003 — 8:28am",
      "content": "\\>legitimately, when the parent font house (I forget who) did a barter   \n   \nThat's really interesting. I was at an old student's office last night and was looking at the FontSite CD - and I was wondering how it was possible to have \"URW Grotesk\" if it wasn't licensed. Makes more sense now. But it still doesn't explain why so many of the fonts aren't technically up to par.   \n   \n\\>What else, beyond ethics,   \nprevents anybody from redrawing one of my fonts   \nand reselling them under other names?   \n   \nAs far as I understand it, if you work in the US, nothing prevents that. You can copyright the name of your typeface, but not the outlines. So anyone can rip off your outlines, change the name, and redistribute the font.\n\n"
    },
    {
      "time": "7 Oct 2003 — 8:30am",
      "content": "\\>but also like Bitstream's   \nHumanist 521 x Gill Sans.   \n   \nHugo, I believe there was a discussion about Bitstream and their naming conventions a month or two ago on Typophile. I'll try to dig up the link for you.   \n   \nTry [here](http://web.archive.org/web/20130215013534/http:/www.typophile.com/forums/messages/30/14101.html) and [here](http://web.archive.org/web/20130215013534/http:/www.typophile.com/forums/messages/30/14158.html).\n\n"
    },
    {
      "time": "7 Oct 2003 — 6:28pm",
      "content": "Hugo, also take a look at [this discussion re: Gill Sans](http://web.archive.org/web/20130215013534/http:/www.typophile.com/forums/messages/30/16873.html?1065576010).\n\n"
    },
    {
      "time": "7 Oct 2003 — 8:11pm",
      "content": "Nathan said:   \n\\>So anyone can rip off your outlines, change the   \nname, and redistribute the font.   \n   \nWell, that's really sad. Most of Brazilian   \nsoftware-related laws are based on US   \nstandards so I guess there's nothing to   \ndo about it here.   \n   \nTalking about the renaming issue, those links   \nwere very helpful. I already knew most of those   \nthreads but this time I've read them carefuly   \nand many of my questions became clear.   \n   \nAnother curious thing is the poor quality   \nNathan mentioned. One would find lots of   \nstatements on Softmakers' site telling how   \nprofessional, polished and well hinted their   \nfonts are. And they even include expert sets.   \n   \n---   \n   \nHrant: I'm digging the Typo-L archives to find   \nthe messages you said, but I still think that   \n'fantasy' name thing is somehow strange, mostly   \nbecause that equivalence list I've mentioned   \ncan be found everywhere on the web.   \n   \nThanks everybody.   \n   \nhC   \n   \n(Now even the Cambridge CD seems 'evil' to me)\n\n"
    },
    {
      "time": "7 Oct 2003 — 8:47pm",
      "content": "[Here](http://web.archive.org/web/20130215013534/http:/listserv.heanet.ie/cgi-bin/wa?A2=ind9807&L=typo-l&P=R31918&I=-3) are the messages Hrant was talking about and [this](http://web.archive.org/web/20130215013534/http:/listserv.heanet.ie/cgi-bin/wa?A2=ind9807&L=typo-l&D=0&I=-3&P=96116)   \nis Sean Cavanaugh's (from FontSite) full explaination.   \n   \nhC\n\n"
    },
    {
      "time": "7 Oct 2003 — 9:15pm",
      "content": "Aaah, the good old days. ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "7 Oct 2003 — 9:50pm",
      "content": "Yeah, really.   \n   \nThat archive works like a contemporary history   \nclass for me. I had just entered college when   \nthose messages were written. ![:-)](http://web.archive.org/web/20130215013534im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI agree with some opinions I read there - like   \nnewer typefaces should be more expensive than   \nthe older ones - but marketing education is a   \ndifficult subject, isn't it?   \n   \nhC   \n   \nPS: The wise proverb shows up again, revised -   \nyou can't get something for nothing, even   \nif it's old and dusty ![:-)](http://web.archive.org/web/20130215013534im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "8 Oct 2003 — 8:25am",
      "content": "Thanks for digging up that link Hugo. Very interesting read. I feel somewhat bad now for assuming the FontSite CD was a piece of questionable garbage.   \n   \nI'm wondering now, however, if I should go back to recommending the CD to my students. I suppose there's two ways to look at it. (1) If they don't buy the Fontsite CD, they'll probably just pirate fonts from some file-share network or other - and the CD _is_ legal after all; (2) there's Hrant's view (which I assume you still hold, hhp) that the CD is detrimental to the type industry as a whole - so purchasing it is, in the long term, a \"bad thing.\"   \n   \nI suppose there's no easy answer to all of this.\n\n"
    },
    {
      "time": "8 Oct 2003 — 1:33pm",
      "content": "Isn't that like saying buying a chair at Wal-Mart is detrimental to the furniture design industry as a whole?\n\n"
    },
    {
      "time": "8 Oct 2003 — 7:25pm",
      "content": "Darrel,   \n   \nI don't agree with that. Design shouldn't be   \nunderstood as a way of selling products for   \nhigher prices, but as way of making things   \nbetter, more accessible, cheaper, easier to   \nuse etc.   \n   \nI really don't know why fonts are so expensive   \nor if they should be cheaper.   \n   \nThe only thing I know is that if someone does   \neverything I do as twice as fast and with the   \nsame quality, he should double his price as well   \nand not divide it at half.   \n   \nI'm not saying that the Fontsite CD is evil.   \nMy point is that its costumers must understand   \nits real purpose (educational/beginner's kit)   \ninstead of thinking that everything else is   \nwrong, too expensive and not worth buying.   \n   \nI think making a Wal-Mart Font CD wasn't Sean's   \noriginal purpose either ![:-)](http://web.archive.org/web/20130215013534im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nhC\n\n"
    },
    {
      "time": "9 Oct 2003 — 10:06am",
      "content": "\"The only thing I know is that if someone does   \neverything I do as twice as fast and with the   \nsame quality, he should double his price as well   \nand not divide it at half.\"   \n   \nThat goes against basic competition in the open market. Some people prefer to sell on price, some on quality, a few can do both.   \n   \n\"My point is that its costumers must understand   \nits real purpose (educational/beginner's kit)   \ninstead of thinking that everything else is   \nwrong, too expensive and not worth buying.\"   \n   \nWell, it'd be nice if people realized that shopping at Wal-Mart isn't necessarily good for the planet or society as a whole. But that's how American Capitalism works. We sell as much as we can as cheap as we can. I'm not saying that's right, that's just what it is. I agree that the only solution is probably more consumer education.\n\n"
    },
    {
      "time": "6 Oct 2003 — 4:01pm",
      "content": "Hugo -- I actually meant to reply to this thread, and just kept forgetting. I would always recommend going directly through the foundry, as a first choice. But, that said, going through MyFonts is just as good an option. I purchased a couple different \"collections\" through MyFonts and see no reason to have done differently. Is this close to an answer?\n\n"
    },
    {
      "time": "2 Oct 2012 — 1:52am",
      "content": "I wish you will discover the power of comma separated list items as soon as possible.\n\n"
    },
    {
      "time": "2 Oct 2012 — 2:32am",
      "content": "Hey, Ray Larabie!\n\nHow many you figure are ripoffs of our freeware stuff?\n\n"
    },
    {
      "time": "2 Oct 2012 — 3:49am",
      "content": "Years ago, I analyzed all Softmaker and Fontsite fonts:\n\n[http://www.sanskritweb.net/forgers/#MEGAFONT](http://web.archive.org/web/20130215013534/http:/www.sanskritweb.net/forgers/#MEGAFONT \"http://www.sanskritweb.net/forgers/#MEGAFONT\")\n\nNote that these fonts had been renamed repeatedly.\n\n"
    },
    {
      "time": "2 Oct 2012 — 4:29am",
      "content": "Mr. Redux...\n\nwhere are your sources, as I know a thing or two about fontsite and softmaker from previous research. Nothing you say is actually confirmed, and the dates seem just imaginary. can you explain?\n\nedit:  \nYou seem to be quite happy believeing in your own rumours, with posts by a certain Derek from California all over Topix on these themes. In fact the the new Megafont and infinitype release dates were denied in softmakers own forum. What do you wish to archieve with these posts??\n\nSpam, anyone :P\n\n"
    },
    {
      "time": "2 Oct 2012 — 2:19pm",
      "content": "Moderators... this is getting silly, can you please look into this, this is SPAM.\n\n"
    },
    {
      "time": "3 Oct 2012 — 7:38am",
      "content": "[The canonical response: The spam skit](http://web.archive.org/web/20130215013534/http:/www.youtube.com/watch?v=anwy2MPT5RE).\n\n"
    },
    {
      "time": "4 Oct 2012 — 9:07am",
      "content": "you tell us\n\n"
    },
    {
      "time": "4 Oct 2012 — 1:52pm",
      "content": "You should ask Martin Kotulla, and you might as well ask Sean Cavanaugh about the Fontsite opentype collection...\n\n"
    },
    {
      "time": "5 Oct 2012 — 1:50pm",
      "content": "You are hilarious, tell me, what will you do this weekend? hanging around with Sean and Martin and having a good old ball with 2,222 font names that I just showed and no multiple variation font names (Rough, Funky, Dirty, etc.) and featuring approx. 15,000+ typefaces in Windows & Macintosh OpenType format that each comes in two forms - \"TrueType\" and \"PostScript\" - marking as a total of approx. 30,000+ typefaces included.\n\nThis party, which may cost very expensive, should be LOTS of fun, be sure to post some snapshots, straight to us, off course!\n\n"
    },
    {
      "time": "5 Oct 2012 — 6:26pm",
      "content": "DDD1988Redux, a simple question: is spamming discussion boards what you wanted to be doing with your life when you were a child and imagined what future you might have?\n\n"
    },
    {
      "time": "5 Oct 2012 — 10:29pm",
      "content": "There's a very thin line between a very smart robot and a very stupid human.\n\nhhp\n\n"
    },
    {
      "time": "6 Oct 2012 — 3:21am",
      "content": "_There's a very thin line between a very smart robot and a very stupid human._\n\nNot that I've noticed…except that very stupid humans can vote. Bummer.\n\n"
    },
    {
      "time": "6 Oct 2012 — 12:03pm",
      "content": "@hrant – Look at \" [Computer Stupidities](http://web.archive.org/web/20130215013534/http:/www.rinkworks.com/stupid/)\". I do not think any robot with a skerrick of intelligence, let alone self-respect, would be caught out like that.\n\n"
    },
    {
      "time": "18 Oct 2012 — 4:03am",
      "content": "Thank you very much. This is actually a useful list to have.\n\n"
    },
    {
      "time": "20 Oct 2012 — 11:21am",
      "content": "+1 to what Indra said. Thanks.\n\nBetter yet, how did you derive it?\n\n"
    },
    {
      "time": "20 Oct 2012 — 12:51pm",
      "content": "Can you prove you're human?\n\nhhp\n\n"
    },
    {
      "time": "20 Oct 2012 — 12:57pm",
      "content": "@Derek  \nWhen you post long lists, it would be much easier for everyone if you could either post them to a website (providing a link here) or at least convert the format to a plain old comma-separated list instead of a three or four-yard long vertically scrolling text list :)\n\nPersonally, I find your lists quite useful. It's nice to have fairly complete lists of these collections - no matter what their origins may be.\n\n- Herb\n\n"
    },
    {
      "time": "20 Oct 2012 — 2:17pm",
      "content": "might be interesting to find out what softmaker have to say:\n\n[http://www.softmaker.com/forum/viewtopic.php?f=5&t=11972&p=42225#p42225](http://web.archive.org/web/20130215013534/http:/www.softmaker.com/forum/viewtopic.php?f=5&t=11972&p=42225#p42225 \"http://www.softmaker.com/forum/viewtopic.php?f=5&t=11972&p=42225#p42225\")\n\nthey seem to know Derek, as do the MyFonts people, apparently. I don't know what to think about this now. If, Derek, you do understand what I am saying, please read the words by mr Kotulla in the Softmaker forum. It seems at least some things you have said are not true, according to him. I am interested in real knowledge on these subjects, but now it is hard to tell if it is, or if it isjust fantasy. Please explain why you post this stuff...\n\nsorry, if I hurt your feelings with previous posts, but please understand that this can easily be misunderstood as spam.\n\n"
    },
    {
      "time": "20 Oct 2012 — 11:12pm",
      "content": "HVB:\n\nFor your convenience, I uploaded a ASCII file here:  \n [http://www.sanskritweb.net/forgers/megafont.txt](http://web.archive.org/web/20130215013534/http:/www.sanskritweb.net/forgers/megafont.txt \"http://www.sanskritweb.net/forgers/megafont.txt\")\n\nQueneau:\n\nThe list is no \"baloney\", as Mr. Kotolla said at his sofmaker forum.  \nIn fact, the list is more or less Mr. Kotulla's own font renaming list.\n\nPlease note: I only stated that the above **LIST** is no \"baloney\".\n\n"
    },
    {
      "time": "21 Oct 2012 — 2:11am",
      "content": "Ah Uli, glad you chime in here.\n\nYou seem to know a lot about all this stuff. I would like to know what are current and/or former connections between URW (URW++), Softmaker and FontSite. I still do not understand it. Basically the comparable fonts by URW, SM and FS have the same outlines (I checked) so they can be set in one paragraph without noticable difference. The do have different kerning and character sets though, and the FS fonts are now in OpenType with several OT features. They seem to develop the same base material on their own. So do Softmaker. But I thought that Softmaker licensed the fonts from URW, or bought the rights when they went bankrupt. But they claim to have licensed them from URW++ (URWs succesor), which brings the question if they now activily work together or not? I would not be interested in this, if the core set of fonts (outlines, metrics) was not sound, which they are, but I am curious how they can be offered for such different prices, under so many different names....\n\nBTW It seems a core set of fonts that features on the SM collections, seem to be on almost all cheap font CDs here, like the Data Becker CD, Franzis font collections, Clickart packages, Serif font collections, etc. It's a jungle out there...\n\n"
    },
    {
      "time": "23 Oct 2012 — 3:43am",
      "content": "Derek,\n\nForgive me for pointing this out, but this entire thread smells suspiciously of Spam…\n\n"
    },
    {
      "time": "23 Oct 2012 — 5:11am",
      "content": "It's blatant advertising, sure, but at least it is relevant to this site.\n\n"
    },
    {
      "time": "23 Oct 2012 — 5:24am",
      "content": "Just found this discussion on myfonts:\n\n[http://www.myfonts.com/WhatTheFont/forum/case/160396/](http://web.archive.org/web/20130215013534/http:/www.myfonts.com/WhatTheFont/forum/case/160396/ \"http://www.myfonts.com/WhatTheFont/forum/case/160396/\")\n\n"
    },
    {
      "time": "23 Oct 2012 — 6:49am",
      "content": "I must say: impressive, even if you just made it all up. Jeez\n\n"
    },
    {
      "time": "24 Oct 2012 — 5:01am",
      "content": "Too bad that bumping a big post doesn't get it re-read. Not! ]:-D (That's the 'devilish laughter' smiley, btw.)\n\n"
    },
    {
      "time": "24 Oct 2012 — 5:16am",
      "content": "> ]:-D (That's the 'devilish laughter' smiley, btw.)\n\nI have always used }:-D, the square bracket striking me as more of a crown.\n\n"
    },
    {
      "time": "24 Oct 2012 — 5:30am",
      "content": "Odd. The curly bracket reminds me of a tiara...\n\n"
    },
    {
      "time": "24 Oct 2012 — 5:41am",
      "content": "Hmmm, perhaps it is best not to dabble in such things... I do like this combo though {]:-D\n\n"
    },
    {
      "time": "24 Oct 2012 — 9:25am",
      "content": "Karl...that's some interesting reading.\n\n"
    },
    {
      "time": "24 Oct 2012 — 9:55am",
      "content": "Get his teacher to explain that here too.\n\nhhp\n\n"
    },
    {
      "time": "24 Oct 2012 — 12:58pm",
      "content": "If Mr Despie is indeed autistic and obsessed with type, maybe there is some way to channel that obsession into something more interesting and useful to the community than a collection of clones of old fonts that no one much cares about. Seriously, this is deeply boring stuff: the detritus of the desktop publishing rush to digitise. The diamonds among the heaps of slag are few and far between, and most of them have long since been produced in better digital versions by the true trademark owners.\n\n"
    },
    {
      "time": "25 Oct 2012 — 2:59am",
      "content": "It is something like a cross between Luc and Uli's content but without their unique filters and could be put to far better uses. I suppose if it continues that it may well attract the same attention as it did on MyFonts and Wikipedia.\n\n"
    },
    {
      "time": "25 Oct 2012 — 4:42am",
      "content": "Hey, you can always use them to build the DTP System From Hell: Get a Pentium MMX system with Win98 and slap Serif Publisher or Greenstreet Publisher on it.\n\n"
    }
  ]
}
