{
  "id": "14922",
  "title": "Georgia on the Mac",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm redesigning my website and I'm in the process of testing out the build in different browsers. Everything looked fine on IE6, IE5.5, FF, and Opera on the PC, but when I had it tested in Safari on the Mac, I noticed that the machine didn't have Georgia at all and the text was rendered in Times instead. This got me thinking, how common is Georgia on the Mac? I did some research and found out that it seems to be bundled with the newest versions of OSX and IE on Mac.\n\nMy question is this: What font should I substitute Georgia with for those users that don't have it? I'm thinking of some a seriffed face with a large x-height and a big appearance like Georgia does. This would have to be a standard Mac font that has been bundled with OS's for the last 5-10 years. A Scotch roman would be perfect. But anything with a large x-height that comes bundled with the Mac will work. Times looks so small compared with Georgia.\n\nThis is how it would be styled:  \n`font-family: georgia, mac-font, serif;`\n\nThanks!\n\n",
  "author": "antiphrasis",
  "time": "30 Aug 2005 — 9:19pm",
  "uid": "3247",
  "comments": [
    {
      "time": "30 Aug 2005 — 9:59pm",
      "content": "Georgia is very common. So I'm surprised that a system with Safari doesn't have Georgia. However if you're looking for another common mac serif font you could try Hoefler Text.\n\nOf course, now that I just reread your large x-height requirement I'd say that Hoefler probably won't do.\n\n"
    },
    {
      "time": "30 Aug 2005 — 11:58pm",
      "content": "Ken,\n\nI'm using [iCapture](http://web.archive.org/web/20131011021610/http:/www.danvine.com/icapture/) for my Safari testing and they seem to have a pretty decent setup. OS 10.3.1 and Safari 1.2. So could it be that they erased some fonts from their system?\n\nThanks, I think I'll use Hoefler text as an alternative unless I find something a little bigger.\n\nYou've got a really nice website! Is that 58 Rodeo you use for the headings? I also comped out a \"current reading\" (under a different name) for my website. [The Fabric of the Cosmos - Brian Green]\n\n"
    },
    {
      "time": "31 Aug 2005 — 12:18am",
      "content": "I guess the problem seems to be that with OS X 10.3, if you don't install IE you don't get the Microsoft web fonts (Verdana and Georgia).\n\nHere's an article at: [WhatdoIknow.org](http://web.archive.org/web/20131011021610/http:/whatdoiknow.org/archives/001312.shtml).\n\n"
    },
    {
      "time": "31 Aug 2005 — 1:02am",
      "content": "Here's a list of the fonts installed with 10.3. As you can see Georgia is supposed to be installed with Internet Explorer, unless you disable the install.  \n [http://docs.info.apple.com/article.html?artnum=25710](http://web.archive.org/web/20131011021610/http:/docs.info.apple.com/article.html?artnum=25710 \"http://docs.info.apple.com/article.html?artnum=25710\")\n\n(Ok, you beat me to it, forgot to refresh before posting:)\n\n"
    },
    {
      "time": "31 Aug 2005 — 10:02am",
      "content": "Oystein,\n\nThanks for link! It seems like a majority of Mac users have Georgia, so I guess I shouldn't rack my brain too much with this one.\n\n"
    },
    {
      "time": "31 Aug 2005 — 1:01pm",
      "content": "A later WhatDoIKnow article claims to have worked out the details...\n\n[http://www.microsoft.com/typography/links/news.aspx?NID=4881](http://web.archive.org/web/20131011021610/http:/www.microsoft.com/typography/links/news.aspx?NID=4881 \"http://www.microsoft.com/typography/links/news.aspx?NID=4881\")\n\nCan't confirm or deny this as our agreements with Apple are confidential.\n\nSi\n\n"
    },
    {
      "time": "31 Aug 2005 — 1:30pm",
      "content": "Does the Safari you are using ... this could be a stupid question ... Are you using a different style sheet? Does it have plug-ins enabling specific font usage?\n\n"
    },
    {
      "time": "31 Aug 2005 — 4:05pm",
      "content": "Simon,\n\nThanks, I came by that article too in my search. So it appears that Tiger ships with the MS web fonts, which is great since they're great on the screen.\n\nI guess that in a couple of years people will be using the Vista/Longhorn fonts on their webpages, and Mac users won't have access to those, so we'll run into the same kind of problem again, down the road.\n\n"
    },
    {
      "time": "31 Aug 2005 — 4:15pm",
      "content": "Tiffany,\n\nI don't know too much about the Safari browser setup since I'm screenshots from an online service. I'm just using one stylesheet since fonts aren't really browser-specific, and no plug-ins at all.\n\nMy problem pretty much is that there's no good standard serif to subsitute Georgia with on those machines that is missing the font since everything else looks pretty tiny in comparison. A six-line paragraph would be only about 4 lines when you use Times, Baskerville, or other standard seriffed text fonts. What would be ideal is to increase the size of the text from let's say 11px to 12px for any other font than Georgia.\n\nSo we'd have something like:  \n`Georgia 11/16 or Times 12/16`\n\nAnd this isn't possible using regular CSS and I don't want to use SIFR, or anything like that. So I guess I have to assume that most users have Georgia, and if they don't the text will be a bit smaller.\n\n"
    },
    {
      "time": "31 Aug 2005 — 7:49pm",
      "content": "\\>I guess that in a couple of years people will be using the Vista/Longhorn fonts on their webpages, and Mac users won’t have access to those, so we’ll run into the same kind of problem again, down the road.\n\nThe ClearType team is not promoting these as Web fonts. Specifically because…\n\n1. No plans to produce a redistributable pack - the thing that convinced Web page designers that Verdana, Georgia et al would always be freely available even if not bundled.  \n2. Fonts only target ClearType - don't render well 'down-level' on platforms with no CT support or where CT is turned off.\n\nRegardless people will start specifying them on Web pages. Hopefully they'll be testing the pages with fall-back font choices as well as cross platform.\n\nCheers, Si\n\n"
    },
    {
      "time": "31 Aug 2005 — 9:47pm",
      "content": "Simon,\n\nYou're always helpful, thanks! I bet, though, that the Vista/Longhorn fonts will look really beautiful on LCD screens running the new operating system. I can't wait. :)\n\n"
    },
    {
      "time": "1 Sep 2005 — 1:10am",
      "content": "I did some further experimenting with Georgia and Times New Roman on Windows XP. In Photoshop I need to have 12px TNR for a paragraph of text to be as long as 11px Georgia (I tried different anti-alias modes; single line composer; no optical kerning). But doing the same experiment in IE6 using CSS, I needed 15px TNR to cover the same length as a paragraph of text in Georgia 11px (TNR was taller but as wide).\n\nI used pixel sizes in both Photoshop and in HTML/CSS so that it'd be resolution independent and all that jazz. How come there is such a big difference in size btween Photoshop (CS2) and the web? Is it all about rendering? Georgia is hinted in such a way that it appears real big and wide?\n\nI love Georgia, but it's hard to use an alternative since all text will reflow dramatically. If you can't tell, I obsess over small details. :)\n\n"
    },
    {
      "time": "1 Sep 2005 — 2:52pm",
      "content": "I’m sure you know this, but you really cannot control what font, font size, or word wrap people will see.\n\nBut of course it does make sense to try to allow for some control for viewers who don’t circumvent it.\n\nThe Codestyle web site surveys font usage on the web (using RSS sampling in some way, so it is at least somewhat objective). According to the most recent list (August 27), the web-optimized fonts most in use on both platforms are, in order: Verdana, Trebuchet MS, and Georgia. FWIW.\n\n[http://www.codestyle.org/css/font-family/sampler-CombinedResults.shtml](http://web.archive.org/web/20131011021610/http:/www.codestyle.org/css/font-family/sampler-CombinedResults.shtml \"http://www.codestyle.org/css/font-family/sampler-CombinedResults.shtml\")\n\n(Cannot figure out how to cloak that URL on this system.)\n\n--Kathleen\n\n"
    },
    {
      "time": "1 Sep 2005 — 4:55pm",
      "content": "Kathleen,\n\nThanks for the link! Very interesting results, according to them more Macs than PC's have Georgia installed on them.\n\nI'm aware that people are able to circumvent the font size in the CSS in several different ways (user-side CSS, browser options, etc). I'm trying to keep the browsing experience the same for people on different platforms who leave it up to me to make the decisions.\n\nFor nicer URI's, use HTML:  \n`<a href=\"http://www.microsoft.com/\">Microsoft</a>`\n\n"
    },
    {
      "time": "1 Sep 2005 — 5:45pm",
      "content": "For nicer URIs … Oh, dumb me. Of course! I must have been especially dim this afternoon! Thanks.\n\nA Mac user who installs OS 9 or any OS X gets MS Internet Explorer as a matter of course, and the screen fonts are installed as well. If they do nothing, they have them. OS X users also get Lucida Grande, of course; it has no italics, but does have a larger x-height.\n\nMac users account for less than 15% of web surfers, of course.\n\nAnyway, we do need to keep reminding ourselves that we have very little control over the way readers see our sites. That is the path toward sanity!\n\nGood luck with your site.\n\n--Kathleen\n\n"
    },
    {
      "time": "1 Sep 2005 — 5:59pm",
      "content": "\\>more Macs than PC’s have Georgia installed on them.\n\nMy guess is that there are many more antiquated Windows machines in use than antiquated Macs - until Windows 98 IE was not bundled with the OS. Prior to that IE was a download and Georgia and Treb were part of an optional add-on font pack for IE.\n\nSi\n\n"
    },
    {
      "time": "1 Sep 2005 — 6:01pm",
      "content": "Kathleen,\n\nThanks, I really appreciate all the input on my little quest!\n\nFor total control, I guess there's always flash and text as images... but I don't like those too much. :)\n\n"
    },
    {
      "time": "1 Sep 2005 — 10:36pm",
      "content": "Simon,\n\nThanks, that makes perfect sense. There's lots of old Win 95 machines out there, and I don't even want to think about Win 3.X. I remember when the web font pack became available for download, I got it right away.\n\nMaybe in a couple of years Microsoft (and Apple) should create some more high quality web fonts to be widely disributed?\n\n"
    },
    {
      "time": "2 Sep 2005 — 6:42am",
      "content": "Install Virtual PC w/XP or Microsoft Office. Virtual PC with XP will get you all the latest fonts. Or subscribe to MSDN and get the Windows \"Vista\" beta with all those great new Longhorn OT fonts.\n\n"
    },
    {
      "time": "6 Sep 2005 — 1:08pm",
      "content": "Somewhat related blog posting from ZDNet - [http://blogs.zdnet.com/Murphy/index.php?p=414](http://web.archive.org/web/20131011021610/http:/blogs.zdnet.com/Murphy/index.php?p=414 \"http://blogs.zdnet.com/Murphy/index.php?p=414\")\n\n\\> I'll contemplate an Air Canada electronic ticket I just got that requires Acrobat Reader 6 but is hardwired not to allow font substitution -meaning that if you don't have Microsoft's Verdana fonts installed, you can't read the ticket. \\<\n\nSeems as if, save for this one poor chap, Air Canada customers have Verdana installed.\n\nSi\n\n"
    },
    {
      "time": "6 Sep 2005 — 1:58pm",
      "content": "Si, if I follow what you just posted, that is one example of incorrect embedding. Ouch!\n\n"
    },
    {
      "time": "6 Sep 2005 — 7:57pm",
      "content": "Simon,\n\nYou just gave me a good idea... I'll hardwire the website to use Georgia and allow no substitution... so if you don't have it you can't read anything. ;)\n\n"
    },
    {
      "time": "7 Sep 2005 — 8:32pm",
      "content": "Not too hard... specify \"Georgia, Webdings\" ;-)\n\nSi\n\n"
    },
    {
      "time": "7 Sep 2005 — 9:33pm",
      "content": "Simon,\n\nGreat idea! I was thinking along the same path.\n\nBut we'd need to list some symbol fonts on other platforms to fall back on for those who don't have Webdings, otherwise they'd get Times... ;)\n\n"
    },
    {
      "time": "7 Sep 2005 — 9:41pm",
      "content": "For those who are interested, here's the one page I've finished so far: [Antiphrasis.com](http://web.archive.org/web/20131011021610/http:/www.antiphrasis.com/). The navigation is disabled at the moment. So don't bother clicking. :)\n\nI'm using Georgia and Verdana for the text, plus FF Din Medium Alt for headers and navigation.\n\nI haven't had much time to add content yet, it took a sweet little while to make the site work on various browser, whilst keeping the code clean.\n\n"
    }
  ]
}
