{
  "id": "14941",
  "title": "New Orleans",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "The news just announced that the National Guard is being sent into New Orleans to evacuate it for the next two months. So all the displaced residents will need the help of organizations like the Red Cross. Would it be a good idea for the Typographic community to make a relief glyph font to be sold to raise money for an organization like the Red Cross? Fortunately all the New York radio stations are doing public service announcements appealling for donations of time or money to the Red Cross. Any Thoughts?\n\n [‹ Help Stamp out Zero Response](http://web.archive.org/web/20080312104649/http:/typophile.com/node/14960 \"Go to previous forum topic\") [POLL: \"Edumacators\" or \"Educators\" ›](http://web.archive.org/web/20080312104649/http:/typophile.com/node/15088 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080312104649/http://typophile.com/user/2203\" title=\"View user profile.\">Dan Weaver</a>",
  "time": "<br>",
  "uid": "2203",
  "comments": [
    {
      "time": " 31.Aug.2005 2.55pm",
      "content": "If there’s an organization dedicated to improve  \nUS city planning, we should help them instead...\n\nhhp\n\n"
    },
    {
      "time": " 31.Aug.2005 2.57pm",
      "content": "Hrant, Its an amazingly poorly planned city, but this is an emergency. The comparison was made to an earth quake in San Francisco. You probably could give the date. This is a human tragedy.\n\n"
    },
    {
      "time": " 31.Aug.2005 9.30pm",
      "content": "Yes, it is tragic and yes Louisiana needs a better solution in the immediate and long term...\n\nI would be curious to ask Jim or Tamye how much of an impact they’ve made with the previous [FontAid](http://web.archive.org/web/20080312104649/http:/www.typesociety.org/fontaid.html) programs.\n\n"
    },
    {
      "time": " 31.Aug.2005 11.13pm",
      "content": "While Font Aid and Building Letters cannot make a giant impact in comparison to overall disaster relief efforts, that should never stop us from doing what we can. As of tonight, the Font Aid III effort has raised over $17,600 to benefit the victims of the Southeast Asian tsunami and floods. This figure is from sales of the collaborative “Fleurons of Hope” font and the donated proceeds from sales of specific fonts from a group of MyFonts foundries earlier in the year.\n\n“Building Letters,” Jim Richardson’s side of the project, is not yet available, and I don’t have a release date at this moment. But when BL does go on sale, it will certainly raise more money for the cause.\n\nThe Font Aid II September 11 font raised more than $5,000 in 2001-2002. I am not privy to the results of the inaugural Font Aid sales, as the project was under designer Claes Källarsson’s direction at that time (he originated the first Font Aid to assist war and disaster refugees).\n\nIf you haven’t done so already, license your copy of Fleurons of Hope, please! Not only does every cent of the selling price go to a good cause, it’s a beautiful font and a heartfelt gift from the international type and design community who worked together to create it.\n\n[http://www.myfonts.com/fonts/fontaid/fleurons-of-hope/](http://web.archive.org/web/20080312104649/http:/www.myfonts.com/fonts/fontaid/fleurons-of-hope/ \"http://www.myfonts.com/fonts/fontaid/fleurons-of-hope/\")\n\nAnd thanks again to all who have contributed their time, creativity, and cash to help others.\n\n"
    },
    {
      "time": " 1.Sep.2005 1.59pm",
      "content": "The latest on New Orleans. It seems it is like its like the wild, wild west down there with geniuses taking gun shots at the very relief helicopters coming to give them aid or evacuate them. There were people screeming for food and water outside the Super Dome and they can only evacuate about 25,000 people per day. There is a fear of Typhoid and other deseases carried in the sewage flood waters. If you can help do so!\n\n"
    },
    {
      "time": " 1.Sep.2005 7.45pm",
      "content": "Okay, this is a human tragedy and I’m supposed to buy some stupid font. Riiiight.\n\n(You asked for thoughts.)\n\n"
    },
    {
      "time": " 1.Sep.2005 8.38pm",
      "content": "Sergej, different people are motivated to donate money via different “triggers”. Buying a font (hopefully one that isn’t stupid) is a natural trigger in this context.\n\nhhp\n\n"
    },
    {
      "time": " 2.Sep.2005 12.35am",
      "content": "What boggles me is how poorly the administration is handling this situation. They knew exactly when and where this disaster would hit, yet the relief efforts are utterly inadequate and give the impression the USA are some third world country.\n\nI guess this is what happens when budgets that are sorely needed for maintenance and reparations of dam infrastructure get rerouted to some inane “War on Terror”, and when most of your military force that could help domestically are abroad trying to force a deluded vision of a new world order down the throat of foreign countries.\n\nThis whole situation is very upsetting, and I feel sorry for the people of New Orleans and neighbouring areas. They don’t deserve this farce of an administration (although it’s quite possible most of them voted it into power).\n\n"
    },
    {
      "time": " 2.Sep.2005 2.56am",
      "content": "I couldn’t more completely agree with Yves. This is insane. As a Journalist, I’m reading all these stories from collegues and hearing all the tales and my mind just keeps going back to the reasons why America is supposed to be so great. Our citizens are so great. Our political infrastructure is so great. Where is all that now? Congress passes a $10B AID bill. Great, wonderful, but why wasn’t the National Guard all over the area the next day? Because they’re all off training for Iraq. I have several friends in the National Guard. They are just now leaving to drop supplies. Drop supplies from 10,000 ft. I cannot fathom what it’s like to be down there on the streets. It will be interesting to see how this develops.\n\nPoliticians for you: [click here.](http://web.archive.org/web/20080312104649/http:/movies.crooksandliars.com/Anderson-Cooper-Landrieu-Katrina.mov)\n\n"
    },
    {
      "time": " 2.Sep.2005 3.55am",
      "content": "I agree. And we don’t have much national gaurd left because no one wants to get shipped off to a resource war. All these mistakes are compounding as the dollar drops in value. Seems as though we drift into the perfect storm drunk on cheap gas and Jesus while living on borrowed money. This is one national hangover I’m not looking forward to.\n\n"
    },
    {
      "time": " 2.Sep.2005 5.11am",
      "content": "The dykes weren’t strong enough.  \nBut will even Holland’s defences be sufficient, the rate climate change is proceeding?  \nIf the democratic governments were prudent about the security of their countries against environmental threat, they would be legislating draconian measures to wean us off the carbon economy.\n\nBut the democratic system isn’t working in Canada and the UK (two countries I’m familiar with). Sure, the scientists have done their job, identifying the problem of global warming, and the media has done its job, publicizing it, and citizen activists have done their job, forming Green parties with comprehensive platforms and running a sufficient number of candidates to form a government, if voted for.\n\nCitizens have the option to vote Green, but they don’t. Most people want larger cars, bigger houses, air miles, food miles, and flat-panel TV screens, ASAP, and they feel pride in buying, owning, and consuming this CO2 generating stuff, not shame. Citizens consider the security of their material possessions, and their own safety, as social problems, not environmental ones, so they’ll vote for right-wing and neo-liberal law-and-order parties, not greens who would curtail their indulgencies.\n\nGreens should change their strategy from “Do the right thing” to “Only we can protect you and your property from violent assault and destruction”.\n\n"
    },
    {
      "time": " 2.Sep.2005 5.28am",
      "content": "Yes its good to point out the problems and point fingers, but, do it after supporting relief efforts of the people most effected NOW! I can tell you it isn’t the rich either, they evacuated days before, these people couldn’t evacuate, they are leaving most of them walking, why because they couldn’t afford a car and there isn’t mass transit like in NYC.\n\n"
    },
    {
      "time": " 2.Sep.2005 6.21am",
      "content": "The failure of the levies is a failure of democracy, as Nick says. Winston Churchill said that ’democracy is the worst system of government except for all the others that have been tried.’\n\nInvesting in the levies was not glamorous, and no monied constituency or large voting block was hollering for it. So the Presidents and congresses did not fund strengthening the levies, in spite of the fact that for thirty years the engineers were warning disaster and begging for funds to do the job they knew was necessary. Of course, we might have had responsible leadership, but we didn’t.\n\n"
    },
    {
      "time": " 2.Sep.2005 7.27am",
      "content": "I can see, (from the fact that many of you don’t know what you’re talking about), that you watch the news :-|. If you are unfamiliar with the entire history of this tragedy, from the centuries old devil-may-care altitude that founded New Orleans, to the MANDATORY evacuation ahead of the storm...call 1-800-HELP-NOW if you want to, but I don’t think finger pointing, (even at you;), will help.\n\n"
    },
    {
      "time": " 2.Sep.2005 7.51am",
      "content": "Well, the news is all we have, don’t we? ;-) I try to get my information from a couple of different sources, hoping that my point of view won’t be too one-sided.\n\nMandatory evacuation might be a little more difficult for the poor and disenfranchised, and those are the ones that are stuck in a toxic pool of chemicals, waste and dead bodies.\n\nStill, just 2 days in Bush says that the police should stop trying to save and rescue, and to concentrate on looters. David (Earls, not Berlow ;-) wrote something about “dedicated to those who value life over production” in the back of our booklet. Nuff said.\n\n"
    },
    {
      "time": " 2.Sep.2005 8.04am",
      "content": "This is happening for one simple reason: the trapped people are poor, and  \nand the system treats them as collateral. In fact, fewer people on welfare  \nafter this, they figure.\n\n\\> the democratic system isn’t working in Canada and the UK\n\nDemocracy is inherently unworkable.  \nIts main function has become a covert operative for Capitalism.  \nVoting is for peons.\n\nDavid: the trick is not to listen to US news.\n\nhhp\n\n"
    },
    {
      "time": " 2.Sep.2005 8.48am",
      "content": "Oh now Hrant, don’t be so cynical. Its main function is and always was as a covert operative for the rich/powerful in general. ;)\n\n"
    },
    {
      "time": " 2.Sep.2005 8.55am",
      "content": "\\> the democratic system isn’t working in Canada and the UK\n\nI meant in so far as dealing with climate change, and getting greens in power. It works very well in many other aspects, but unfortunately none of them are ultimately as significant as the future of weather.\n\n"
    },
    {
      "time": " 2.Sep.2005 9.14am",
      "content": "\\>I don’t think finger pointing... will help.\n\nMy hope that we will in future spend money based more on need and less on politics my be foolish, but I think it is important to recognize that the government messed up big time by ignoring the repeated warnings from technical people that an avoidable tragedy was in the making.\n\nIf journalists had the priority of reporting on these warnings, and listening to the technical people who know what they are talking about, something might also happen. But journalists label such people ’wonks’ and ’nerds’ and don’t pay attention to them until the dam breaks...\n\nBut at this point, I agree, give money.\n\n"
    },
    {
      "time": " 2.Sep.2005 9.27am",
      "content": "The government did exactly what it thought was needed, and I doubt  \nany regret is registering. The larger the entity, the more that’s true.\n\nhhp\n\n"
    },
    {
      "time": " 2.Sep.2005 11.27am",
      "content": "[http://www.aiga.org/content.cfm?ContentAlias=reliefeffort](http://web.archive.org/web/20080312104649/http:/www.aiga.org/content.cfm?ContentAlias=reliefeffort \"http://www.aiga.org/content.cfm?ContentAlias=reliefeffort\")\n\n"
    },
    {
      "time": " 2.Sep.2005 2.01pm",
      "content": "Listen, the point isn’t weither democracy works, the point isn’t weither the Bush adminstration blew it, the point is trying to save the disinfranchiced who will die if action isn’t taken. A chemical refinerary blast occured this morning and in alot of those cities have wooden buildings. The cities will burn down and desease will provail. And you have to note this is a K storm before September (I never remembered a K storm having occured this early if ever) and there are at least 2 major storms building in the Atlantic. There are 2 months of major hurrican storms possible.\n\n"
    },
    {
      "time": " 2.Sep.2005 5.54pm",
      "content": "Help should definitely be given. The problem is, where is it going, and how can it be guaranteed that it is truly going to the most needy people? I think people should be angry, there should be finger pointing, it certainly wakes people up to some prevailing issues here in America that have been constantly ignored.\n\n"
    },
    {
      "time": " 3.Sep.2005 5.50am",
      "content": "“Still, just 2 days in...” counting is that hard?  \n” the trapped people are poor, and and the system treats them as collateral”  \nEnough Hot air, thanks : ) Hey y’all... ever seen a 3rd world country with 10,000, mostly middle class white volunteer emergency workers stressed to the max, but still going back out to save and supply more people? Could anyone in the world evacuate 40,000 patients from the hospitals of a drowned city? Put finger in mouth, bite hard and wait for the congressional report. :) 1-800-help-now.\n\n"
    },
    {
      "time": " 3.Sep.2005 1.49pm",
      "content": "Doing things like Fleurons of Hope raises some money for those in need and becomes a visual reminder that we should do better next time. It also aids in that powerless feeling we can succumb to. Private action is no guarantee that whatever powers that be will take leadership in doing better though. People have to take it on themselves to “do better” but my understanding is that thousands of people went to the Gulf area to volunteer to help but were turned away by authorities because they just didn’t know what to do with the volunteers. I don’t know of any country with any form of government that has a great track record in handling major catastrophes. Sometimes we are just humbled by mother nature and we lose a bit of our misplaced sense of power and control. We each have to contribute in whatever way we can to help those in great need right now. After the Gulf victims have been returned to some meager semblance of life, we can raise hell with the powers that be (after all, Bush did cut his 5 week vacation a couple of days short to buzz the Gulf area and let us know it was a disaster down there).\n\nChrisL\n\n"
    },
    {
      "time": " 3.Sep.2005 4.43pm",
      "content": "Will sound hard and maybe cynical but... when the irresponsible and dangerous US government decide to invest it’s massive financial ressources in the development of it’s people and of greener energies instead of it’s army, then maybe giving money to help will be relevant.\n\nAnd, if I remember, US is not a third world country. Many more people die each day in “developping countries” than will die in the whole Katrina crisis. Think about that too.\n\nMaking a font to gather a few thousand. Comon, let’s be serious. Just write a check. Do we absolutely need some gizmo in return?\n\n"
    },
    {
      "time": " 3.Sep.2005 6.30pm",
      "content": "If you give to the Red Cross, that’ll help the Red Cross, and that’s great. I am starting to think, though, that nothing will help the poor people in New Orleans if the government wants them dead. There are armed guards on the bridge, telling anyone who tries to leave New Orleans on foot that they’re not allowed to go. They’re also keeping the Red Cross out of the city.\n\nBut, you know what, in the big picture, there is something that creative people can do, and how much money it raises, if any, is ancillary. Make something in memory of a city that had some of the most unique, vibrant, and above all _artistic_ history in the United States, to help keep alive what it gave us and make people remember where it came from.\n\n"
    },
    {
      "time": " 3.Sep.2005 9.33pm",
      "content": "George Bush causes any and all problems. ?\n\n"
    },
    {
      "time": " 4.Sep.2005 5.15am",
      "content": "Well, not him personally, as he obviously is a mere hand-puppet. No one believes he is actually running the country, innit? :-)\n\nI’ve watched the news on CNN (pro-administration), BBC and Holland (European supporters of the USA), and Belgium (very critical of the Bush administration). The opinions were unanimous, and let’s say they were not exactly in favour of how the administration is handling this situation.\n\nAgreed, it is an arduous task evacuating tens of thousands people out of a drowned city, but at day five you could expect _some_ help to have reached the victims. I’ve seen harrowing images, and if you’ll alow me to be very cynical here, I haven’t noticed any “middle class white” _victims_. Kudos to the people helping out relentlessly — and I’m certainly not attacking them — but the people stranded there are indeed all African Americans, Hispanics, elderly, sick and poor, the ones that obviously couldn’t get out by themselves or didn’t have anywhere to go to. :-(\n\n"
    },
    {
      "time": " 4.Sep.2005 7.01pm",
      "content": "People in the US expect too much, they expect everything in ten minutes or less. It is expected that the governement will take care of each and every person in need and nobody has to do anything for themself. When things aren’t ’quick enough’ fingers just start pointing.\n\nWhat about Tulane? They hired their own security force and private helicopters. When the storm was upon them, they deployed the force and evacuated all the students and faculty to safety. Now they’re rescuing the people from the hospital next door.\n\nDid anyone watch the weather? Evacuate the area when it looks like hell is breaking loose, there were 4 nurses from a hospital who just left and walked from New Orleans to Baton Rouge ON FOOT because they knew it was time to leave. If you have nowhere to go...then I guess you deal with the consequences, after all you chose to live in a city on the coast where you dig two feet down and there’s water.\n\nSnap your fingers and demand help all you will but, you know what...most of this is volunteer work. The troops have to be summoned....meaning they must call each individual reservist and ask if they will help...some might not be able to, others might. Then all supplies must be put together and ships/airplanes loaded and manned before anyhting can start to happen. And finally they must make the trip from around the country to New Orleans area for relief. When you’re living in an area barraged by hurricane after hurricane each year you must take that risk or be NAIVE to think that nothing will happen. Don’t sit on your porch and watch it come raining down on you, thinking ’i’m ok, the government will save me’ Do something, in the end everyone is responsible for themselves. I guess I don’t have much sympathy, because I’m not sympathetic to a lot of the American population and the way they think. You know what though....Bush was voted in and that’s the end of the story. Bash on him all you want, but seriously it’s not going to do a single thing.\n\nDon’t even know if it’s worth posting, there’s a thread like this in just about every forum and everyone’s just pointing fingers as well.\n\nBack on topic, I think any kind of relief effort would be nice if you’d like to take your time to do so. Volunteering is the ultimate defense to finger pointing.\n\n"
    },
    {
      "time": " 4.Sep.2005 7.30pm",
      "content": "Your opinions are one thing (and I see them as apologism for dog-eat-dog Capitalism) but characterizing Americans as people who expect their government to do everything for them is the opposite of the truth. In no other first-world country do people tend to take the responsability of personal failure in life on their own shoulders, ignoring the fact that so many other governments do so much more to help the less fortunate (damn shame that leaves them with less money to build fancy bombs and spend 1 billion dollars on **not** fixing a foam problem on a trophy space program). And in no other country that I know of do people not expect much from their government because they think that’s the way it should be; in countries where people expect to be ignored by their government it’s because they **admit** their government sucks... Italy for example has a crappy government too (and it’s not about Bush or Berlusconi, the whole systems are bribery-infested profit-taking whorehouses) but the fact that they realize it puts them that much closer to one day possibly overcoming it.\n\nhhp\n\n"
    },
    {
      "time": " 4.Sep.2005 7.51pm",
      "content": "Interpret them as you will, everyone else expressed their own so I figured I’d express mine. I could care less if you agree or don’t. I’m not arguing with you. I see it a certain way and in the end don’t really care, because I’m looking out for myself and the people I love or am close to.\n\n"
    },
    {
      "time": " 4.Sep.2005 8.13pm",
      "content": "Well, we each strike some balance between satisfying our own desires versus serving the needs of society (local and global). The point is that the particular balance you seem to be advocating, and the balance encouraged -more like enforced- by the current zeitgeist in the US (and its most formal state, the US government) is simply not sustainable. At best, it’s wishful thinking; at worst, it’s criminal. And really, the absolute very least you should do is expect people to complain about the rape, murder and theft. When you act like you’re actually doing them a favor or something, that only increases their resolve to defeat you, or at least to slap you awake from your drunken pillaging.\n\nhhp\n\n"
    },
    {
      "time": " 4.Sep.2005 8.50pm",
      "content": "Fair enough, I guess I have a bigger problem with people trying to convince me of certain ’facts’ when they have no idea what they’re talking about. I’m not really all that interested in politics, but in this case I’ve just been irritated to the point by people that I had to say something (nobody here, more people in my real life interactions). I guess what I’m getting at is the speed at which people expect things to happen is unrealistic. I’m not trying to say that people shouldn’t be helped. I believe that things are being done as fast as possible, I know a reserve soldier who has been in the process of shipping out since the hurricane, but as I said it takes time. He won’t actually leave for another day or two because of logistics, not because they’re screwing around or don’t care.\n\n"
    },
    {
      "time": " 4.Sep.2005 11.38pm",
      "content": "I think the Bush administration caused the Hurricane so they could send in the military so their popularity polls would go up for saving so many people.\n\n"
    },
    {
      "time": " 5.Sep.2005 3.48am",
      "content": "The latest figures have upwards to 20,000 dead.\n\n"
    },
    {
      "time": " 5.Sep.2005 6.01am",
      "content": "“you chose to live in a city on the coast where you dig two feet down and there’s water.”  \nactually it’s not on a “coast”, and when the French started digging they found recently buried trees, and topsoil...You don’t find water when you dig in a delta, it finds you if you stay long enough.\n\n“I think the Bush administration caused the Hurricane so they could send in the military”  \n:-) you think big, like f15s and b52s flying in rapid circles, herding and corralling a 400 mile wide behemoth to the perfect spot, brilliant, you’re hired.\n\nIt looks like there “could” have been a misrepresented levee survey and then “they” just waited, while budgets were cut and the gulf loop changed to hot. But knowing N’ Owlins’, we will never make the connection between that survey and the beneficiaries. Nev’r.\n\n” I haven’t noticed any “middle class white” victims”  \nNearly every scene has middle class white victims either in front of or behind the camera, or they’ve gone off right away to look for more survivors...please adjust you brain-eye connection, you can practice this by seeing the white space in and around type. :)\n\n"
    },
    {
      "time": " 5.Sep.2005 11.31pm",
      "content": "A resource for those in the creatve industry recently displaced by the on-going situation in New Orleans and the surrounding region...\n\n[http://www.displaceddesigner.com/](http://web.archive.org/web/20080312104649/http:/www.displaceddesigner.com/ \"http://www.displaceddesigner.com/\")\n\n"
    },
    {
      "time": " 6.Sep.2005 7.25pm",
      "content": "I’ve been pondering the response to the disaster in Louisiana.\n\nI think there is an understandable amazement among many people, both within the USA and abroad, that the _the world’s only superpower_ seems so woefully unprepared for this disaster at both the local and national levels. David is quite right to point out that now the relief and rescue effort is actually under way some remarkable things are being achieved — things that many other countries would not be be able to achieve —, but it is reasonable to ask why it took so long. And there is a perfectly reasonable expectation that the _richest nation on the planet_ should be able to handle this situation much better than it has: there is no shortage of material resources, so inevitably it looks like a massive political failure.\n\nWhen millions of people around the world made donations to help the victims of the South Asian tsunami, it was with the knowledge that most of the countries affected were desperately poor by comparison to the western industrialised nations, and that there were neither the material resources nor infrastructure to provide adequate relief without massive international assistance. Quite simply, no one expected the governments of those countries to be able to cope, especially since the effect of the tsunami was so wide spread and the death toll so high. While the tragedy of what is happening in New Orleans and surrounding areas is terrible — I’ve made a donation to the American Red Cross, which seems the most direct means to support the immediate relief effort\\* —, it is localised and taking place against a backdrop of a country with a per capita GDP more than ten times larger than that of most of the nations affected by the tsunami. The USA should be able to help itself. Rather than wondering whether or not Americans expect too much or too little from their government, anyone might reasonably ask what the heck any government is supposed to be for if not to help its own citizens at such times?\n\nI’m glad to be able to make personal donations to organisations like the Red Cross, but such private charitable assistance doesn’t let governments off the hook for caring for their citizens.  \n\\_\\_\\_\n\n\\* [http://www.redcross.org/donate/donate.html](http://web.archive.org/web/20080312104649/http:/www.redcross.org/donate/donate.html \"http://www.redcross.org/donate/donate.html\")\n\n"
    },
    {
      "time": " 7.Sep.2005 4.36am",
      "content": "John you are right about the US SHOULD be able to help without aid. The reality is the US government will allocate more money to purchase one F15 jet fighter than to lift a finger to help the poor. My thinking is the relief effort led by the government is to get the oil refineries back up and running. For this reason its even more important that we support organizations that actually get the help to those who need it. The Red Cross for one.\n\n"
    },
    {
      "time": " 7.Sep.2005 11.41am",
      "content": "Paul Krugman put it very well in the New York Times a couple of days ago:\n\n_...the federal government’s lethal ineptitude ... was a consequence of ideological hostility to the very idea of using government to serve the public good. For 25 years the right has been denigrating the public sector, telling us that government is always the problem, not the solution. Why should we be surprised that when we needed a government solution, it wasn’t forthcoming?_\n\nIdeologically driven decisions, whether left or right — whether Stalinist collectivised agriculture or capitalist failure to invest in public infrastructure —, tend to kill large numbers of people.\n\n"
    },
    {
      "time": " 7.Sep.2005 12.16pm",
      "content": "Krugman’s observation is on target, but there is another important factor, which is that our current President is one of the most incompetent screw-ups in American history. This is beginning to dawn even on Republicans, way too late. :(\n\n"
    },
    {
      "time": " 7.Sep.2005 12.19pm",
      "content": "If any of you happen to know how to control air traffic without electrical power, the FAA would like to talk to you.\n\n"
    },
    {
      "time": " 7.Sep.2005 2.08pm",
      "content": "Now the geniuses in the CDC have released data that even when the flood waters go down the combination of sewage and dead bodies will contaminate most of the buildings (if not all) making them uninhabitable, ever. Basicly they have to let it burn down and start over. Also all the water pumped back into the lake (name?) is full of the toxic contaminates released including a huge amount of lead. So the lake is being poisoned as well.\n\n"
    },
    {
      "time": " 7.Sep.2005 2.19pm",
      "content": "\\> they have to let it burn down\n\nThere are people who would love to take care of that.  \nBut I think they’d require the inhabitants back in first.\n\nhhp\n\n"
    },
    {
      "time": " 7.Sep.2005 2.40pm",
      "content": "_Krugman’s observation is on target, but there is another important factor, which is that our current President is one of the most incompetent screw-ups in American history._\n\nWell, I actually edited the opening of Krugman’s first sentence when I quoted it because I wanted to focus on his point regarding the ideological factors. He actually wrote: _But the federal government’s lethal ineptitude wasn’t just a consequence of Mr. Bush’s personal inadequacy; it was a consequence of ideological hostility..._.\n\nThe two, of course, go hand in hand. Krugman goes on to discuss Bush’s appointment of Joseph Allbaugh as head of the Federal Emergency Management Agency (inappropriately subsumed under the Dept. of Homeland Security, as if every emergency were going to be a terrorist attack). Allbaugh is one of Bush’s political cronies, whose main activity after taking over FEMA was to scale back its preparedness programs in order to cut costs. Allbaugh was succeeded in the post by Michael Brown, whose only qualification for the job seems to be having been Allbaugh’s college roommate. He lost his previous job organising horse shows.\n\nSince the policy is to undermine effective government in favour of the private sector, ineptitude in public office actually becomes a kind of strategy.\n\n"
    },
    {
      "time": " 7.Sep.2005 2.54pm",
      "content": "Now there is an “O” storm in the Carribean headed (they think) for Florida and Alabama. That is what Katrina was supposed to do too. What I’m afraid of, as we send relief to stricken Lousianna, another letter storm comes and batters an area where the National Guard has weakened itself with the relief efford. This is like a evil natural chess game. What if this “O” storm turns out to be an Andrew the federal government will be reeling for the rest of the members terms.\n\n"
    },
    {
      "time": " 7.Sep.2005 2.55pm",
      "content": "\\> ineptitude in public office actually becomes a kind of strategy.\n\nIndeed. That’s why those who blame individuals are either being ignorant or have a hidden agenda. Which however doesn’t mean that people who refuse to blame individuals are necessarily any better - in fact usually they’re worse.\n\nAnd more importantly: if the two farm animals we’re supposed to choose between have ineptitude as a feature, what does that say about Democracy?\n\n\\> the National Guard has weakened itself\n\n[http://www.theonion.com/content/node/40305](http://web.archive.org/web/20080312104649/http:/www.theonion.com/content/node/40305 \"http://www.theonion.com/content/node/40305\")\n\nhhp\n\n"
    },
    {
      "time": " 7.Sep.2005 3.44pm",
      "content": "I think one of the most interesting developments is this quote from within the Bush family by none other than dear old “Barb”:\n\n“And so many of the people in the arena here, you know, were underprivileged anyway, so this is working very well for them.”\n\nThis statement to me, is part of the underlying problem that has yet to be addressed. She says this statement as if she really doesn’t get it, and as if she is totally unconnected. Part of the larger problem as John Hudson and others have pointed out are years of issues that have continued to pile up over the years.\n\nThe issue that this comment speaks to is the fact that 30-40% of the population of New Orleans was already poverty striken. For the wealthiest industrialized nation in the world (and one of the largest cities in the United States) that statistic is INEXCUSABLE.\n\nWe live in a country where many cities are divided by poverty and race. This particularly gets my goat because my hometown of Cincinnati, Ohio (a very segregated city) socio-economic standing is almost literally Black and White.\n\nThe survival of the fittest attitudes I’ve seen expressed I often find naive and dismissive. You’ll find very few people who have actually gone hungry share this viewpoint. My point is this: no one wants to be poor, and when there is such a disproportionate number of people who are in an allegedly wealthy nation, its time to access what the problem is.\n\nFirst and foremost we are human beings, the government and politicians need to start reflecting that. This isn’t just the problem of the citizens of the Gulf, its everyone’s problem. If you think this isn’t your problem, then you’re part of it.\n\n"
    },
    {
      "time": " 7.Sep.2005 5.57pm",
      "content": "_...what does that say about Democracy?_\n\nThat it is corruptible — but then so are other systems of government —, and that it reflects the social, economic and cultural mores of the society (as it did in classical Athens, republican Rome, and has on the Isle of Man for some 1,200 years). In other words, having a democracy does not automatically produce a majority population of well informed and civil minded democrats. If many of the cultural forces in your country are running counter to that end, you can’t expect your democracy to function very well. The necessary relationship between effective democracy and the institutions of society that are needed to inculcate democratic social values should be obvious. Indeed, they are obvious, which is why they are deliberately targeted by forces that wish to undermine or exert control over the democratic process. The problems of democracy in the USA are the problems of a system that is not strong enough to counter the interests of capital, and unfortunately the US constitution seems to have been designed to put institutional brakes on democratic development, so US democracy is ill equiped to respond to the much more dynamic forces of wealth and power that have developed in that country.\n\n"
    },
    {
      "time": " 7.Sep.2005 6.16pm",
      "content": "\\> having a democracy does not automatically produce a majority  \n\\> population of well informed and civil minded democrats.\n\nThe thing is, nothing does. Which is why relying on that  \nis dumb. Correction: not dumb, but Good For Business.\n\n\\> The problems of democracy in the USA ...\n\n... are the problems that are being exported  \nfaster than truly civilized people can tame it.\n\nhhp\n\n"
    },
    {
      "time": " 7.Sep.2005 11.10pm",
      "content": "Has this been linked yet?\n\nWilliam Drenttel, Design Observer  \nKatrina: Designer News & Resources Notice  \n [http://www.designobserver.com/archives/005977.html#more](http://web.archive.org/web/20080312104649/http:/www.designobserver.com/archives/005977.html#more \"http://www.designobserver.com/archives/005977.html#more\")\n\n"
    },
    {
      "time": " 8.Sep.2005 9.04am",
      "content": "More evidence that, no matter how good or bad a country is, voting is dumb:  \n [http://news.bbc.co.uk/2/hi/programmes/from\\_our\\_own\\_correspondent/4223148...](http://web.archive.org/web/20080312104649/http:/news.bbc.co.uk/2/hi/programmes/from_our_own_correspondent/4223148.stm \"http://news.bbc.co.uk/2/hi/programmes/from\\_our\\_own\\_correspondent/4223148.stm\")\n\nhhp\n\n"
    },
    {
      "time": " 8.Sep.2005 9.25am",
      "content": "\\>More evidence\n\nReally, Hrant, your bizarre interpretation of evidence amazes me. Norway is one of the few countries with oil wealth who have not squandered it, and they are democratic. I believe that every single undemocratic oil county has obscene inequality of income, with the government hoarding the wealth. This includes Saudi Arabia, which is an undemocratic monarchy, a form of government beloved by you.\n\nSo you think democracy has nothing to do with the fact that Norway and Britian have been more responsible with their oil wealth?\n\nThe evidence is clear that the governments which are most cruel and “indecent” and oppressive to their people are undemocratic.\n\nAs I wrote above, the failure to defend New Orleans against flooding is a failure of democracy. Democracy is very far from a cure-all, and full of failures. But without it governments are much worse.\n\n"
    },
    {
      "time": " 8.Sep.2005 9.26am",
      "content": "“Let them eat cake” is even royally dumber.\n\nChrisL\n\n"
    },
    {
      "time": " 8.Sep.2005 9.40am",
      "content": "I attribute Norway’s success to other things (like being out of the way). To me the key thing in that story isn’t that Norway is successful (bunches of democratic countries are not\\*, and many non-democratic countries are doing much better) it’s that success does not alleviate the idiocy of Democracy. Everything is really great there, but people are still voting for change. Britain, I consider a failing state, and historically responsible for much of the current misery on this planet. It is not remotely a good example for the world.\n\n\\* Think of your apartheid homeland for one.\n\nYou know what’s bizarre? That people refuse to admit that the world  \nis going to hell faster than it ever did, at the hands of Democracy.\n\n“Let them eat cake”? Oh yes, “give them pizza and give them Nintendo  \nwars and they’ll just keep getting fatter and dumber” is much better.\n\nhhp\n\n"
    },
    {
      "time": " 8.Sep.2005 10.07am",
      "content": "Regarding the poverty rate in the US:\n\nWhen I was in college, my German professor spoke of a German colleague who said she was amazed the first time she saw a homeless person sleeping on the street of an American city. In Germany, this would not happen. The authorities would take that person somewhere where they would be taken care of. (So she said at the time. It sounds accurate, cos I’ve never seen a homeless person in Germany.)\n\nIn the US, local government officials generally cannot arrest someone without suspicion of a crime being committed. A person cannot be institutionalized without being a danger to himself or others. Simply muttering to oneself and living in disarray is not enough to force a person to get help. In other Western nations, it is. Homeless advocates in the US routinely defend the “freedom” of the homeless to do as they wish as long as there is no violent or property crime. And that is the order of things here.\n\nFreedom still trumps security... sadly, freedom without a personal sense of responsibility can and will destroy what’s left of our culture from within: drugs, illegitimacy, domestic violence, pederasty, and the television programs, movies and popular music that celebrate and glamorize them. Why would anyone willing to walk out on the very child he conceived give a crap about some stranger’s house being flooded?\n\nThere is also much more religious and private charity in the US in proportion to government services when compared with other nations, and these private charities are generally vastly more efficient in their spending. They can spend less and still help more people. Other countries are better at using government to solve these problems. (Er, except unemployment.) My theory is that the more homogeneous a culture, the more effective its government programs can be. American culture is vastly fragmented (a fact generally ignored by self-annointed cultural critics who think we all watch Oprah and NASCAR) and seems to be getting moreso. That’s unavoidable in a country this size. Whether that means privatization or moving more power back to states I’ll let someone else argue.\n\nPlenty of specific individuals are responsible for the failures both after and (more importantly) before the hurricane. Again, I’ll let others argue who they are and in what order. In the meantime, many of us have some checks to write.\n\n"
    },
    {
      "time": " 8.Sep.2005 12.59pm",
      "content": "There seems to be a void of leadership in the New Orleans crisis. Leaders locally were looking for the lead from Washington and FEMA is being run by lawyers not known to act quickly. Mayor Bloomberg chimmed in that if an emergency like a huricane hit NYC he would force an evacuation immediately even if the police had to go house to house. He sites the law that allows the police to take the homeless off the streets when the temperature goes below 32º. People don’t always act in their best self interests. I don’t think this tragedy has anything to do with the form of government, there are lousy leaders in all forms of governments..\n\n"
    },
    {
      "time": " 14.Sep.2005 5.31pm",
      "content": "More evidence that voting does not work:  \n [http://news.bbc.co.uk/2/hi/europe/4247158.stm](http://web.archive.org/web/20080312104649/http:/news.bbc.co.uk/2/hi/europe/4247158.stm \"http://news.bbc.co.uk/2/hi/europe/4247158.stm\")\n\nAs far as I’m concerned, we tried Democracy, and it didn’t work. Plus it makes perfect sense why/that it didn’t. Give it up, people - for the sake of your grandchildren.\n\nhhp\n\n"
    },
    {
      "time": " 14.Sep.2005 8.20pm",
      "content": "Hrant, is the fault lying in democracy or with political systems parading «as democracy»?\n\nUSA, like many other countries, seem to have gotten rid of a royalty only to replace it later with a post-bourgeoisie host of business lobies. Democracy in it’s pure form is the «power to the people», not «the people to the powerful».\n\nThe fault is only manifest in the system because it’s lead by immature people. Men and women who are in part there to help and in part because they crave power and social status. Any system can fail under that. Anything, will fail or only partly succeed in these conditions (a political system, a project, a business, a relationship, ... a life).\n\nBut, maybe we should stick to our topic of choice... typography?\n\n"
    },
    {
      "time": " 15.Sep.2005 9.34am",
      "content": "aaaaaaa m e n .\n\n"
    }
  ]
}
