{
  "id": "14948",
  "title": "Chapter 28 - Optima....",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "i just read chapter 28 of [Anatomy of a Typeface](http://web.archive.org/web/20071017181222/http:/typophile.com/wiki/Anatomy%252Bof%252Ba%252BTypeface) last night...the chapter dealing with [Optima](http://web.archive.org/web/20071017181222/http:/typophile.com/wiki/Optima) and the Humanist san serif faces....it was really sad. at least the end of the chapter was very sad where they cite H. Zapf’s response to seeing Dwiggins’ attempt at an idea of a humanist san serif nearly like Zapf’s Optima. what hit home was the little picture of him sitting in a chair outside drawing. smoking a pipe.\n\nWho says typography is all technicalities...\n\nw|m\n\n [‹ Font size and em square](http://web.archive.org/web/20071017181222/http:/typophile.com/node/14929 \"Go to previous forum topic\") [Typefaces from 1950's advertising - what was used then? ›](http://web.archive.org/web/20071017181222/http:/typophile.com/node/14964 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071017181222/http://typophile.com/user/4552\" title=\"View user profile.\">Will Miller</a>",
  "time": "<br>",
  "uid": "4552",
  "comments": [
    {
      "time": " 1.Sep.2005 8.16am",
      "content": "Something quite interesting in that chapter (if my memory serves) is the implication that Optima’s characteristic extasis\\* was in fact a result of fighting technical limitations! Pretty much dilutes any possible “genius” element in it...\n\n\\* Opposite of entasis; coined by Cynthia Batty (when she was still Hollandsworth).\n\nhhp\n\n"
    },
    {
      "time": " 1.Sep.2005 8.26am",
      "content": "Legato shows extasis - no?\n\n"
    },
    {
      "time": " 1.Sep.2005 9.10am",
      "content": "\\>nearly like Zapf’s Optima\n\nTo my eyes, Dwiggens’s interesting effort at a humanist sans bears little resemblance to Optima, other than the fact that it uses greater thick-thin contrast than in the past with sans serifs—and in the manner of seriffed fonts. That is the only ’anticipation’. Dwiggens’s caps are not shown in ’Anatomy’, so there may be more resemblance with them. The caps of Stellar light, which ’Anatomy’ reproduces, have classical proportions and look more like Optima’s caps (without the tapered waist); Zapf was probably familiar with these.\n\nThe lower case of Dwiggens, which is shown in ’Anatomy’ is narrow, whereas Optima is wide; the thick-thin contrast of the joins of the bowls and branches to the stems is much greater than the gentle modulation of Optima. And there are little suggestions of serifs on some of the strokes, but not the tapered waist that is characteristic of Optima, and whose sources in the 16th century and antiquity Zapf acknowledges.\n\nThe way the tapered waist, gentle modulation and wide lower case goes together has an unforgettable unity and harmony of form that marks a great typeface and a unique creation.\n\nHrant, I don’t see anything in ’Anatomy’ about technical limitations being responsible for the tapered-waist sans; the inspiration was from the classical and antiquity sources. The brilliant handling of the idea and the creation of the lower case is Zapf’s genius at work.\n\n"
    },
    {
      "time": " 1.Sep.2005 9.24am",
      "content": "\\> a great typeface and a unique creation.\n\nWith quite poor readability, even for a sans; too wide, too gray.  \nA distinctly superior effort in that genre is Pascal - sadly still  \nnot digitized, although it’s in the capable hands of Neufville.\n\nAs for the thing about the technical fight, I guess I’d have  \nto spend time finding it, but maybe Will -having just read  \nthe chapter- could find it faster?\n\nhhp\n\n"
    },
    {
      "time": " 1.Sep.2005 10.48am",
      "content": "\\>poor readability, even for a sans; too wide, too gray\n\nOptima is great, but a bit of a ’diva’. As the thread on matching serifs with it brought out, it is difficult to match, except with Zapf’s own faces. In smaller text the regular weight is too grey, but ’Optima Nova’ seems to have corrected that. My feeling is that its circular bowls in the lower case militate against it working well in smaller text, or large amounts of text. But among sans it is more readable than grotesques, though less so than the newer humanist sans.\n\nIts limitations are real, but so is its greatness.\n\n"
    },
    {
      "time": " 2.Sep.2005 6.53am",
      "content": "Anatomy states “...the curved lines of the stems of each letter result from technical considerations fo type manufacturing rather than purely esthetic considerations.”\n\nas for the Optima capitals: “The capitals of Optima...follow the proportions of the Trajan Column inscriptions...”\n\nw|m\n\n"
    },
    {
      "time": " 2.Sep.2005 7.42am",
      "content": "\\>curved stems\n\nI have seen somewhere in a longer account of the development of Optima a photo of the models that Zapf says inspired Optima, and they do have tapered stems. The inspiration for the idea of tapers was not technical but aesthetic, based on ancient models. Zapf means in that quote, I think, that the drawing of the taper was constrained by the demands of production of metal type. Some of the curves in Optima Nova have been changed—perhaps he wanted to do this in the first place, but couldn’t because of the demands of metal type.\n\n"
    },
    {
      "time": " 2.Sep.2005 7.57am",
      "content": "I think Anatomy is more correct than William.\n\nhhp\n\n"
    },
    {
      "time": " 2.Sep.2005 8.18am",
      "content": "\\>more correct than William\n\nAnatomy’s quote of Zapf is accurate, I believe. What is incorrect is your interpretation of it.\n\n[Here](http://web.archive.org/web/20071017181222/http:/www.linotype.com/6-1808-6/optimanova.html) is a photocopy of the bank notes on which Zapf first drew the letters he saw in the Santa Croce church. He had no other paper and was so excited that he drew on the bank notes! You will see that the tapers are there. This was obviously before he drew his own version, Optima, and before he discussed manufacturing problems with the punchcutter and then with Linotype.\n\nThis is consistent with my reading of the quote, above, and refutes your view that the tapers in Optima—and more generally its beauty—is a result of technical limitations.\n\nBy the way, I noticed in looking at the Linotype site that the ’condensed’ version of Optima Nova just kills the beauty of Optima—so the wide lower case is an essential part of the look of the original.\n\nAddition: here in the attached PDF article on the linked site is more on the technical limitations and their role:\n\n“One distinctive design feature that gives Optima much of its elegance is the slight curve of the character strokes. While shaping this subtlety in fonts for hot metal and photocomposition was somewhat problematic, other characteristics Zapf intended for the original display design had to be dramatically compromised because of the technical limitations of text typesetting equipment. In Optima nova all of the letterforms have been reshaped as Zapf initially intended.”\n\nThe article goes on to talk about the problem of the 18 unit system and spacing problems.\n\n"
    },
    {
      "time": " 2.Sep.2005 8.31am",
      "content": "I don’t see how I’m misinterpreting that quote - it seems pretty straightforward.\n\nAs for the sketches, I would note that: it’s actually quite hard to get a solid rectangular stem when quickly sketching; and as every type designer knows the end-results (and all the iterations in between) are rarely very similar to the initial effort.\n\nThat said, I do suspect that the bowing **became** an aesthetic device once Zapf and company realized its appeal. This type of thing also being a characteristic of type development.\n\n\\> the wide lower case is an essential part of the look of the original.\n\nSure. But it’s also bad for reading.\n\nhhp\n\n"
    },
    {
      "time": " 2.Sep.2005 8.39am",
      "content": "\\>it’s actually quite hard to get a solid rectangular stem\n\nGive it up, Hrant, you are just dead wrong about the taper being the \\*result\\* of technical limitations. The drawings on the notes disprove your reading. The idea that Zapf would have problems drawing a rectangular stem is laughable. He is one of the world’s greatest masters in drawing letters, and in calligraphy. (For an example of his calligraphy see the square below my name.)\n\nNotice that on one side of the bank note are the Caps from the church. On the other side, below he is already drawing Optima, with the lower case. And drawn very well, some close to the final.\n\n"
    },
    {
      "time": " 2.Sep.2005 8.41am",
      "content": "I’d disagree that the taper was a technical issue.\n\nI’d also add that Optima Condensed seems wrong to me. A nice idea to enlarge the family, but I don’t think Optima should be condensed. Similar to the horrible idea of Trajan condensed. Just sad.\n\n"
    },
    {
      "time": " 2.Sep.2005 8.45am",
      "content": "Hey, you wrote “I don’t see anything in ‘Anatomy’ about technical limitations being responsible for the tapered-waist sans”, and you were shown to be wrong. Now you’re flailing post-rationalizations. But really, my view about the genesis of the bowing is actually more moderate and tentative than that quote asserts! For one thing, it’s possible Zapf was just spinning a story there.\n\nhhp\n\n"
    },
    {
      "time": " 2.Sep.2005 9.03am",
      "content": "\\>you were shown to be wrong\n\nOnly if one assumes that you could not possibly misunderstand the ’Anatomy’ quote, which in fact you do. The evidence I have cited shows clearly that Zapf drew the tapers long before he had discussions of the technical problems of production. The correct reading of the quote is not that he invented the tapers because of technical limitations, but rather that he couldn’t draw the tapers exactly as he wanted because of technical limitations.\n\nYour response to the clear evidence I cite is that Zapf must have been sloppy in drawing! This, given how excited he was about that letters he saw, and that he is a master of drawing letters, is ridiculous.\n\nAs the evidence is here, I will just leave it for others to judge.\n\n"
    },
    {
      "time": " 2.Sep.2005 9.16am",
      "content": "\\> he couldn’t draw the tapers exactly as  \n\\> he wanted because of technical limitations.\n\nYes, that correlates perfectly with “the curved lines of the stems of  \neach letter **result** from technical considerations”. If you’re from Mars.\n\nBut again, I’m not saying it was 100% one way or another (I’m a big believer in Gray anyway). On the other hand there clearly is something fishy in the compound of Zapf’s statements and actions, and that’s certainly not my doing.\n\nAnd something else: I detect a measure of anger at the suggestion that technique had a role to play and it wasn’t just Zapf’s creative/expressive genius at play. But a true craftsman sees technical issues as part of the beauty of Design, in fact exponentially more beautiful that mere pretty formal shapes. Zapf himself is a big believer in technique. And maybe that caused him to post-rationalize the genesis of the bowing in a certain direction?\n\nhhp\n\n"
    },
    {
      "time": " 2.Sep.2005 9.20am",
      "content": "_Dwiggens’s caps are not shown in ‘Anatomy’, so there may be more resemblance with them._\n\ni was able to look at what exists of dwiggin’s experimental sans at [RIT's](http://web.archive.org/web/20071017181222/http:/typophile.com/wiki/RIT) Cary Collection. I don’t think that there ever were any caps drawn... FYI.\n\n"
    },
    {
      "time": " 2.Sep.2005 9.27am",
      "content": "By ’the curved lines of the stems of each letter result from technical considerations’ Zapf meant that the way the curves were drawn was influenced by technical considerations, not that the concept of making tapered stems came from technical considerations—that come from the Santa Croce letters, as the drawing shows. Your reading is possible, but it just isn’t right, given the evidence. Both the drawing and the quotes above support my reading, not yours.\n\n\\>measure of anger at the suggestion that technique had a role to play\n\nI agree that technical constraints are key in the design process. You are criticising some straw man, not me.\n\n"
    },
    {
      "time": " 2.Sep.2005 9.30am",
      "content": "\\> Zapf meant that\n\nYes, I’m sure you’re him.\n\nhhp\n\n"
    },
    {
      "time": " 2.Sep.2005 11.22am",
      "content": "Will,\n\nYou might also find interesting a test or experiment Matthew Carter did in the 60’s in which he started with a nice renaissance roman and removed the serifs, to see what could be done. He was not at all happy with the immediate result, but continued redrawing it until an interesting, and more modern alphabet resulted. I saw this project mentioned in The monograph for the show “Typographically Speaking: The Art of Matthew Carter”, from Princeton Architectural Press.\n\nI saw Mr. Carter at TypeCon and mentioned this project, and he surprisingly didn’t remember it. It seems to be an interesting idea that can be approached many ways, and has been approached by several designers. Gudrun Zapf von Hesse made a similar type (Christiana) with more angled stress than Optima. It might be interesting to thoroughly trace the interest in this kind of modulated sans, or serifless roman. How to classify them is another endless thread.\n\nI’m working on a design for a serifless roman for text, which I hope to be able to preview here in the next few months.\n\n"
    },
    {
      "time": " 2.Sep.2005 2.56pm",
      "content": "carl,\n\nwas this book the one you saw Matthew Carter’s project mentioned in?  \n [http://www.amazon.com/exec/obidos/tg/detail/-/1568984278/103-6183903-797...](http://web.archive.org/web/20071017181222/http:/www.amazon.com/exec/obidos/tg/detail/-/1568984278/103-6183903-7975042?v=glance \"http://www.amazon.com/exec/obidos/tg/detail/-/1568984278/103-6183903-7975042?v=glance\")\n\nthe project does sound interesting, or at least the idea has merit as a jumping point. i’d be interested to read more about this and look forward to seeing your serifless roman\n\nw|m\n\n"
    },
    {
      "time": " 2.Sep.2005 3.33pm",
      "content": "That’s the book. An excellent value at the Amazon price!\n\n"
    },
    {
      "time": " 2.Sep.2005 3.47pm",
      "content": "Stellar (1929) is not a well-known face, and as a result Optima (1958), which follows in its footsteps, gets a certain amount of credit for innovative design which perhaps belongs to Stellar.\n\nHermann Zapf was, as the publicity says, inspired by Renaissance stone-carved lettering, but I assume that he, August Rosenberger, and others at Linotype would have been aware of Stellar, learned from it, and positioned the design of Optima accordingly.\n\nThe classical, humanist quality of Stellar’s regular weight is not so well conveyed in its bold, and it lacks an italic. (This lack of range may well have accounted for its obscure status.) So Optima, with its clever sloped roman “italic”, and full, well matched family, has proved a far more useful typeface in a wide variety of situations.\n\n"
    },
    {
      "time": " 3.Sep.2005 4.44pm",
      "content": "Can any of the type scholars hereabouts give a “creation date” of Wolpe’s Albertus as compared to Zapf’s Optima? I have always thought there were a lot of similarities between those…\n\nAlso to consider is the fact that calligraphy done with a reed pen has a lot of the characteristics of Optima etal. And the reed pen being one of the oldest writing utensils (feel free to add your own conclusions) …\n\nAnd on another note: I have always understood that the digital version of Optima was uncomparable with the lead version. And that the recent Optima Next’s intention intended to “repair” those differences. Does this mean that L’Oreal (and not to mention 80% of all pharma companies) will update all their packaging and advertising (and where do I apply for that job?)? ;-)\n\n"
    },
    {
      "time": " 4.Sep.2005 2.55am",
      "content": "[This](http://web.archive.org/web/20071017181222/http:/www.linotype.com/28/albertus-family.html?PHPSESSID=c58964cec735acc00b63f5c164cb8cb8) from the Linotype site gives a date of 1932-40, the technique of cutting bronze relief letters seems to have influenced the design. I can see your point about the similarities and the crossing of classical seriffed with a sans serif seems to have inspired both. I like Albertus capitals that have been recently used for some road signs in London (especially around [the Type Museum](http://web.archive.org/web/20071017181222/http:/www.typemuseum.org/museum.htm), which holds a lot of Wolpe’s library, incidentally).  \nTim\n\n"
    },
    {
      "time": " 4.Sep.2005 7.10am",
      "content": "Speaking of Wolpe’s legacy. I very much admire his **Pegasus**. I have almost no information on that design, and saw only a couple of examples of its use in print. Can anyone on this list help? Any links, showings and/or references would be appreciated.\n\n"
    },
    {
      "time": " 4.Sep.2005 7.24am",
      "content": "I have a copy of “Berthold Wolpe, A Retrospective Survey” and in it is a sample of the 16 point Pegasus in a setting of Genesis. If this is of interest to you Maxim, I’ll arrange to get you a copy.\n\nJames\n\n"
    },
    {
      "time": " 4.Sep.2005 7.39am",
      "content": "\\> _If this is of interest to you_\n\nThanks in advance, James.\n\n"
    },
    {
      "time": " 4.Sep.2005 8.16am",
      "content": "Bert,\n\nWe released versions of four of the original weights of Albertus plus added two weights during the mid 1980s while I was at Agfa-Compugraphic (now Monotype Imaging).\n\nHere is part of the copy I pulled together for the specimen release:\n\n_The early 1930s commemorative plaques of calligrapher and type designer Berthold Wolpe were highly regarded. These bronze inscriptions with their hard-angled, chiseled type were noticed with interest by the publishing world. As a result, Wolpe was soon commissioned_ [by Stanley Morison, Monotype] _to produce an all capital letter typeface for book titling based upon his bronze works. By 1940, the family was expanded to include four complete faces._\n\nHere is a link to [Wolpe’s own description](http://web.archive.org/) of the development of Albertus.\n\n"
    },
    {
      "time": " 5.Sep.2005 3.44pm",
      "content": "Thanks Norbert,\n\nI’m gonna crosslink that with the info in the Optima Type Specimen I have lying somewhere around, but my guts tell me that Herman Z was pulling air raid duties in the Hitler Jugend at the time Berthold W was working on the typeface family.\n\nSo who was influenced by who(m)?\n\nBTW. There’s just one reason why I watch all those Law & Order series… And off course my full first name is Albertus. (Germanic: He who gives light — but I need a flashlight!)\n\n"
    },
    {
      "time": " 5.Sep.2005 7.57pm",
      "content": "Then of course you know that Norbert means _bright light in the north_ or northern light. Guess us “berts” need sunglasses in order to look at each other.\n\n"
    },
    {
      "time": " 6.Sep.2005 9.45am",
      "content": "An odd coincidence: In the same monograph I mention above, there is a showing of a version of Pegasus that Carter worked on in 1982 for Linotype. The original was done by Wolpe in 1937. Pegasus is a very interesting design; it looks very exciting for display, and possibly also quite nice in text. Delightful figures. For true utility, certain letters might be candidates for Hrant’s remix challenge, however.\n\n"
    },
    {
      "time": " 6.Sep.2005 9.49am",
      "content": "So where can we see this winged wonder?  \nA scan, please? “Fair use” and all that.\n\nhhp\n\n"
    },
    {
      "time": " 6.Sep.2005 9.55am",
      "content": "Carl, as you are working on a roman with flairs instead of serifs, and I believe you were intending it for signage, you might also be interested in looking at [Keith Tam’s Arrival](http://web.archive.org/web/20071017181222/http:/vllg.com/TypeInitiative/Arrival/mudTyper+Weights/), if you haven’t already.\n\n"
    },
    {
      "time": " 6.Sep.2005 10.29am",
      "content": "Thanks, William,\n\nI have seen Arrival, in various iterations, before it Arrived at the Village.\n\nI’m actually not working on that design. It was more of a sketch of what I feel is a direction for a high-legibility signage face; a suggestion for reducing ambiguity.\n\nI will try to get a picture of the Pegasus; I’m a little frazzled this week.\n\n"
    }
  ]
}
