{
  "id": "14966",
  "title": "Offsetting italic to fit with roman",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I am designing italics to fit with a roman, and I am having trouble knowing where to place the glyphs so that the word space looks right either side of a bit of italics in line with roman.\n\nSuppose I have a slanted rectangle glyph, as tall as the x height. If I set the sidebearings such that the baseline part of the glyph is central in the set width, then this glyph will look displaced to the right relative to upright glyphs, due to the rightward slant. So I offset the glyph to the left, such that the top sticks out to the right as much as the bottom sticks out to the left. I can then apply the same offset to all glyphs. The problem is, this simple formula does not work for all glyphs. For example, italic capitals can be modelled as a slanted rectangle as tall as the cap height, so these need more offset than the x height rectangle. Ascenders and descenders in the lower case have a similar effect, I think. Since the italics must be correctly spaced within themselves, the same offset must be applied to all italic glyphs, so a compromise of some kind is needed.\n\nIs there some standard formula for working out the offset from the italic angle and the vertical proportions (x height, ascender, cap height, etc), or is there some recommended test to help adjust the offset by eye?\n\n",
  "author": "Glyn Adgie",
  "time": "2 Sep 2005 — 1:16am",
  "uid": "7509",
  "comments": [
    {
      "time": "2 Sep 2005 — 8:39am",
      "content": "Hello, Glyn. You might find some information in this [thread](http://web.archive.org/web/20141121192534/http:/typophile.com/node/13743) about drawing true italics.\n\n"
    },
    {
      "time": "2 Sep 2005 — 10:54am",
      "content": "Thanks, Tiffany. I followed that thread when it was first introduced, and it does indeed contain a great deal of useful technical stuff about optical corrections required when creating obliqued shapes, with a good sprinkling of debate about whether italics should adopt a cursive style compared to the roman, and so on.\n\nThat said, I have just re-read all the comments, and the particular problem I am looking at now did not appear to be addressed. I am just thinking that this is another one of those 'gotchas' that type design appears to be full of, and that, given the long history of type design, it was no doubt sorted out centuries ago by someone far more clever than I am.\n\n"
    },
    {
      "time": "2 Sep 2005 — 12:41pm",
      "content": "You also have to consider punctuation. You'll often need to have italic text followed immediately be upright punctuation, like a comma or period, etc. With that in mind, I'd say the spacing at the baseline is probably more important.\n\n"
    },
    {
      "time": "3 Sep 2005 — 7:24am",
      "content": "What I've always done is to shift the italic left so that the point midway between the baseline and the x-height of the roman and italic align, like this:  \n`\n_________________ x-height\n.....|.../\n.....|../\n.....|./\n.....|/\n.....|\n..../|\n.../.|\n../..|\n./...| _________ baseline\n`\n\nThere's really no way to make every combination between roman and italic fit perfectly. Lowercase-to-lowercase would seem to be the most common situation, so that's why I do it this way.\n\nPunctuation is not really a problem except in a situation where you have roman followed by italic punctuation in which case the punctuation will be a bit too close. The reverse situation is probably more common--italic followed by roman punctuation. In that case, the punctuation will be spaced a little loose, which I think is okay. In any case, the rule I learned years ago about typesetting is that, with rare exceptions, punctuation should match the style that precedes it.\n\n"
    },
    {
      "time": "3 Sep 2005 — 1:46pm",
      "content": "Mark's approach is similar to mine. I tend to go for about 60% of x-height instead of the midpoint, to allow for ascenders.\n\nT\n\n"
    },
    {
      "time": "3 Sep 2005 — 9:15pm",
      "content": "Thanks, Mark and Thomas. Well, at least it looks like there is no deep magic here to be worried about.\n\n"
    },
    {
      "time": "5 Sep 2005 — 5:14am",
      "content": "Since the beginning of my experience, I've been taught to center the italic H with about the same interserif spacing as the Roman, and then offset the italic l.c. (left) to fit the caps. This works for all fonts. There is another theory that I'm in the midst of debunking where you center the italic l.c. and space the caps where they fall, but this does not always work, resulting in a l.c. that's too far to the right amongst Roman and letter(s) with extreme right kerns falling into stuff.\n\n"
    },
    {
      "time": "5 Sep 2005 — 5:17am",
      "content": "\"with extreme right kerns falling into stuff.\" ...that you cannot correct for lack of interfont kerning (longhorn 8.5).\n\n"
    },
    {
      "time": "5 Sep 2005 — 9:42am",
      "content": "\\> the same interserif spacing\n\nI don't get that.\n\nhhp\n\n"
    },
    {
      "time": "5 Sep 2005 — 2:31pm",
      "content": "David, I agree with Hrant. I find it difficult to apply what you said to getting italic words and phrases to sit well within roman, as a part of the design of a typeface. What if there are no serifs?\n\n"
    },
    {
      "time": "5 Sep 2005 — 3:10pm",
      "content": "I set both roman and italic sidebearings measuring from the stem/bowl at a fixed height a little more than halfway up the x-height. I use the same height for both styles, and this ensures that along a visual line through the middle of the x-height all glyphs are proportionally spaced relative to each other.\n\nSee illustration: [http://www.tiro.com/John/RomanItalicSpacing.gif](http://web.archive.org/web/20141121192534/http:/www.tiro.com/John/RomanItalicSpacing.gif \"http://www.tiro.com/John/RomanItalicSpacing.gif\")\n\n"
    },
    {
      "time": "5 Sep 2005 — 3:30pm",
      "content": "Glyn, it's not that I disagree with David,  \nit's that I don't understand what he meant...  \nI guess you do? Somebody please explain!! :-)\n\nhhp\n\n"
    },
    {
      "time": "5 Sep 2005 — 11:44pm",
      "content": "Hrant, I thought David might be talking about some other aspect of spacing italics, e.g. letter spacing as related to the shape and placement of the l.c. serifs, or maybe some typesetting adjustment. But, rather than assume something like that, it would obviously be better for David to explain what he meant.\n\n"
    },
    {
      "time": "6 Sep 2005 — 4:38am",
      "content": "\"the same interserif spacing as the Roman\"\n\nThe interserif space (i.e. the space between the serifs of two adjacent H's), should be about the same, or slightly less than the Roman...if there are no serifs, well, then the space between italic H's should be slightly less than the roman space between H's...\n\nThere're two things: getting the basic H space, (and n space), fromRoman to Italic, and determining how and which way to offset either the upper, or lowercase, or both. I space the Uppers as I've described, and offset the lowers to the left...\n\nThe fundamental principle is rooted in the following: you really do want to center the Roman by itself, don't you?, you really cannot effectively offset into the word space, can you, and you can't control any interfont spacing, thus: if the italic caps are not centered between romans, they never will be...and that is the basic need because the l.c. can only look bad if too far right...and this you can see a lot of these daze.\n\n"
    },
    {
      "time": "6 Sep 2005 — 6:00am",
      "content": "Thanks, David. Am I right in thinking that the interserif space idea refers to letter spacing within the italics, to make the italic letter spacing match that of the roman? That is another problem from the italic offset, I think, though it is also interesting, as the different lower case serif shapes and placements in roman and italics give rise to different spacings to the main stems, and it is typically only in the capitals that the serifs are the same in italic and roman.\n\nLooking at the offset point, I gather that you would place the alignment line (as shown in John's attachment) at half of the cap height, so an italic 'H' would be centered between two roman 'Hs'. Your alignment line is therefore higher than that suggested by Mark, Thomas, and John, which is a bit above half the x height. I would have thought that lower case words and phrases embedded in roman sentences (the most common case?) would look displaced too far to the left with your choice of offset.\n\n"
    },
    {
      "time": "6 Sep 2005 — 6:25am",
      "content": "Glyn, I don't think you've translated the 'Berlownese,' as John Hudson calls it, correctly. The italic H will have the same or slightly less space between the serifs--and stems, as these are the same shape on both sides of the H. The italic H should also be centered between the side bearings, if I understand him correctly. But the n will be offset to the left of center between its side bearings in order to center between two H's. This will put the n somewhere in the neighborhood of where Mark and John will put it according to their rules. But it may be different from font to font, according to the design.\n\nThe rest of the italics may be spaced relative to the italic H and n. Did I get it right, David?\n\np.s. Just testing with an italic I am working on now, David's method made the side bearings of the italic n equal with the guideline at 63% of the x-height--about the same as Thomas's method, for this particular design, anyway\n\n"
    },
    {
      "time": "6 Sep 2005 — 7:21am",
      "content": "Thanks, William. From my point of view, Thomas's method was the easiest for me to understand, as it conforms to the way I was thinking about this problem. In the case of an italic I am working on, I have a bit of difficulty with David's method, as I have not designed any italic capitals yet. I will do at least the 'H', and see what happens.\n\n"
    },
    {
      "time": "6 Sep 2005 — 11:03am",
      "content": "\\> ‘Berlownese,’ as John Hudson calls it\n\nI'm curious, where/when has John used that expression?\n\nhhp\n\n"
    },
    {
      "time": "6 Sep 2005 — 11:30am",
      "content": "On Typophile, this summer sometime. Meaning, I take it, DB's patented verbal brew, dispensed in brief snippets of equal parts insight, wit, and obscurity.\n\nPersonally, I'd like more Berownese on typophile. Share your type wisdom, David--we'll figure it out.\n\n"
    },
    {
      "time": "6 Sep 2005 — 7:51pm",
      "content": "Sorry, William, I don't recall ever using the term 'Berlownese', and a search of Typophile doesn't produce any result. I may have made some reference to David's distinctive epistolary style, though: it often requires slow and careful reading and some lateral thinking, but is worth the effort.\n\n"
    },
    {
      "time": "6 Sep 2005 — 8:01pm",
      "content": "I hadn't before considered the roman-italic spacing question in the terms David suggests, but I can see the sense in beginning with spacing the italic H so that it centres between roman Hs. As David says, if you use any other approach, the italic H will always be offset to the left or right (unless the design happens to have very short caps, in which case one might get close to a centered H following my recommendation or Thomas'). The problem I have with this approach, though, is that if you do centre the H, you end up with the lowercase offset to the left. When a word is set in italics within roman text -- or in roman within italic text --, I like the space before and after the word to be equal. Following David's recommendation, an italic word drifts to the left. Also, depending on the design, the italic letters may noticeably protrude into a left margin defined by roman letters above and below. For me, the whole question is really what aspect of mixed text setting you wish to compromise.\n\nAn illustration to these thoughts is online at: [http://www.tiro.com/John/RomanItalicSpacing2.gif](http://web.archive.org/web/20141121192534/http:/www.tiro.com/John/RomanItalicSpacing2.gif \"http://www.tiro.com/John/RomanItalicSpacing2.gif\")\n\n"
    },
    {
      "time": "6 Sep 2005 — 8:02pm",
      "content": "I don't remember encountering the term before either. Although I  \nconfess to not reading absolutely everything for over a year now.\n\nDavid's style: as long as he's willing to expound on particularly  \ncontorted passages, we can get the best of both worlds. :-)\n\nOn the other hand:  \n\\> a search of Typophile doesn’t produce any result.\n\nWell yes, it doesn't produce **any** results, not even this thread! :-/\n\nhhp\n\n"
    },
    {
      "time": "7 Sep 2005 — 7:47am",
      "content": "I consider the roman and italic spacing method I use as OMEGA tested: In 1992, just previous to my having deciding I'd seen everything, a client came and told me they were going to set headlines made of alternating Roman and Italic letters (in a Transitional typeface). The spacing method I've described was Norbertequesly old by then, but it worked in what I think we could agree was perhaps the most extreme \"useful\" case. I.E. mixed words of 12 or 13 degree italics would be more extreme but not likely to be tasty on the eyes. I absolutely know of other methods well enough to tell you when they Could be used (quite often), and when they Will fail (rarely). With enough experience you can use any number of methods because you know what to look out for...in the mean time, any complaints about the FB, Bitstream or Linotype libraries? I'm all ears.\n\nAlso, \"Berownese\" should always contain some kind of nut, otherwise, they're just lumps of chocolate, which is okay, but after a while you crave something c'runchy.\n\n"
    },
    {
      "time": "7 Sep 2005 — 8:13am",
      "content": "\\>don’t recall ever using the term\n\nMaybe you wrote 'Berlow speak' or the like. In any case, I enjoy 'Berownese'--with my misspelling even better--with or without nuts.\n\n"
    },
    {
      "time": "7 Sep 2005 — 10:02am",
      "content": "Sometimes you feel like a nut . . .\n\nChrisL\n\n"
    }
  ]
}
