{
  "id": "14960",
  "title": "Help Stamp out Zero Response",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Because we had a recent hiccup in Forum accessibility, I browsed the topic areas (I generally link to ’ [tracker](http://web.archive.org/web/20080115101909/http:/typophile.com/tracker)’) to note any topics that requested response and had “0” (zero, naught, nada) replies.\n\nI was thinking back to a former member who became indignant and “ [terminated his membership](http://web.archive.org/web/20080115101909/http:/typophile.com/node/14249)” from Typophile because no one replied to his request for critique. (Please, I don’t want to open old wounds, I’m just looking forward.)\n\nI think members who frequent the Forum should try and be aware of any direct requests for assistance or critique older than two to three days. I know we can’t have the answers to everyone’s questions, but at least one member should make an attempt or at least acknowledge the post.\n\nI think it’s a courtesy to those who are willing to become members and post topics or questions. Besides, it’s good for Karma.\n\n—————————————————————  \nYes, I’m old, but I’m a softy too!\n\n [‹ Unicase](http://web.archive.org/web/20080115101909/http:/typophile.com/node/15035 \"Go to previous forum topic\") [New Orleans ›](http://web.archive.org/web/20080115101909/http:/typophile.com/node/14941 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080115101909/http://typophile.com/user/7764\" title=\"View user profile.\">Norbert Florendo</a>",
  "time": "<br>",
  "uid": "7764",
  "comments": [
    {
      "time": " 1.Sep.2005 2.01pm",
      "content": "You have a good point!\n\nBut... Sometime a question doesn’t deserve a response. This doesn’t happen much but I thought I would quibble.\n\nAlso, sometime nobody has a clue what the answer is & it isn’t a matter of clarification being needed. I’ll ask for clarification sometimes. And then there is a response.\n\nSometimes the subject just isn’t interesting to folks around here. That seems fair.\n\nSometimes the heading is so vague as to make me unwilling to take the time.\n\nSo I agree but with some caveats. Ah! - and the bliss of being responded to is yours!\n\n;-)\n\n"
    },
    {
      "time": " 1.Sep.2005 2.06pm",
      "content": "Eben is right when people post requests about type IDs without reading the FAQ. I think Yves hair is the way it is because of that.\n\n"
    },
    {
      "time": " 1.Sep.2005 2.50pm",
      "content": "Eben,\n\n\\> Agree, sometimes (but few) a topic doesn’t deserve a response  \n&nbsp; &nbsp; — Reply: _Cripes! You don’t deserve a response!_  \n\\> Agree, sometimes someone asks for clarification  \n&nbsp; &nbsp; — Reply: _What the hell are you asking for!_  \n\\> Agree, sometimes there is absolutely no interest in the topic  \n&nbsp; &nbsp; — Reply: _Dude, this is really lame._  \n\\> Agree, sometime the headings are too vague to evoke interest  \n&nbsp; &nbsp; — Reply: (none, zero, nada)\n\nI leave it to Forum members follow up on requests or not.\n\n———————————————  \nYes, I’m old, but I hear you!\n\n"
    },
    {
      "time": " 1.Sep.2005 3.02pm",
      "content": "Actually, I think the new functionality of displaying the number of reads of any given thread is a vast improvement in that respect. For the Type Identification Board for example this means that even if there hasn’t been a reply yet, the poster can see by the number of reads how many people have visited the thread and at least taken a look at the posted sample.\n\n"
    },
    {
      "time": " 1.Sep.2005 7.15pm",
      "content": "Yves, Thats a great point!\n\nNorbert. Really I was agreeing with you in general. I do think it’s a tad unrealistic to think that we will all feel that we must responnd to all posts or something. But I don’t think that’s what your suggesting exactly. You just want us to be on the look out for orphaned threads right?\n\n\\> Cripes! You don’t deserve a response! etc.\n\nCripes? That’s wonderful! I haven’t seen that in a long time. But the rest is a bit heavy handed - no? Anyway I’ll take it with a grain of salt...\n\n"
    },
    {
      "time": " 1.Sep.2005 7.55pm",
      "content": "Yup. Just be on the lookout. There’s no real need to respond to absolutely everyone... Jimminy Cricket, gosh-darn it!\n\n"
    },
    {
      "time": " 1.Sep.2005 8.51pm",
      "content": "Is there a way to be updated via email of posts to a thread that one has already posted on? I was loving that back in the ’old days’, it was much easier to participate in a discussion that way.\n\n—————————————————————  \nYes, I’m young but soon I’ll be out of fashion!\n\n"
    },
    {
      "time": " 2.Sep.2005 12.41am",
      "content": "Last thing I heard e-mail notification might come back to the Type Identification Board were it’s sorely needed — I mean, when was the last one minute ID!? :-D\n\nRSS functionality for the rest of Typophile will get upgraded in order to notify of new posts within threads.\n\n"
    },
    {
      "time": " 2.Sep.2005 1.22am",
      "content": "_I mean, when was the last one minute ID!? :-D_  \n\\< brag \\> I’m sure i had a couple last week \\< /brag \\>\n\nand if email gets instated for type ID, i want it for the crit section as well!!!\n\n...okay, [i guess it was two mins](http://web.archive.org/web/20080115101909/http:/typophile.com/node/14830), drat!\n\n"
    },
    {
      "time": " 2.Sep.2005 2.52am",
      "content": ":-P\n\n"
    },
    {
      "time": " 2.Sep.2005 7.54am",
      "content": "Revive email delivery for **everything** please!!\n\nhhp\n\n"
    },
    {
      "time": " 4.Sep.2005 5.21am",
      "content": "Talk to the people in charge. I’m just the guy keeping the Type ID Board clean. :-P\n\n"
    },
    {
      "time": " 5.Sep.2005 8.58pm",
      "content": "Norbert\n\nOne of the problems for me in responding is that I can’t get into the site most of the time. I just get Document Done and there is nothing on the screen. Plus this bouncing around nonsense, even as I type, just pisses me off. I didn’t think Typophile was broke before the switchover. Sure is now. An old saying in the US, “if it ain’t broke, don’t fix it.” I suppose I’m supposed to post this in the proper forum. Which I would if I could.\n\nGerald\n\n"
    },
    {
      "time": " 6.Sep.2005 7.55am",
      "content": "Gerald, what OS do you use? What Browser?\n\n"
    },
    {
      "time": " 9.Sep.2005 12.04am",
      "content": "Eben\n\nI’m back, and I see nothing has changed.\n\nIn regard to your question, why should it matter?\n\nI was talking to a fellow a little while back, well known for several books on logos and typography, well respected and with a lot to offer, and he lameted how backward he felt in regard to the net because he just couldn’t keep up with the unnecessary software changes.\n\nDude, yeah, let’s impress the kids. They’ve got so much to friggin contribute. Hey, I really cannot in anyway say that this beta has anything more to offer than the previous Typophile. In fact, it has far less to offer, and it, quick frankly, doesn’t friggin work for shit.\n\nGerald\n\n"
    },
    {
      "time": " 9.Sep.2005 1.34am",
      "content": "What about the wiki? That’s got a lot to offer. And of course, the new typophile’s got bugs. But the old typophile went down A LOT. And when it was down, it went down for days. They new typophile has only really been “down” once since the relaunch (for a whole weekend sadly, a few weeks ago).\n\n"
    },
    {
      "time": " 9.Sep.2005 7.29am",
      "content": "Without a functional equivalent to the old emailed posts, the  \nnew Typophile is indeed less useful overall. With it, it will rock.\n\nhhp\n\n"
    },
    {
      "time": " 9.Sep.2005 8.04pm",
      "content": "Dan\n\nThis is pretty cool. There is no type showing up in the box as I type.\n\nBut I have figured out that I can see it if I preview and correct.\n\nAt any rate, I’ve always thought that wiki’s were just “bad” information that folks tend to accept as “good” information.\n\nIf that is the whole point of the beta, at the expense of the previous features, there sure isn’t much to offer here. Especially since you cannot effectively tract messages any longer. I thought that was pretty cool.\n\nI keep hearing when “it gets fixed” everything will be so fine. How long has this beta been up? Isn’t beta usually pre-public release?\n\nGerald\n\n"
    },
    {
      "time": " 10.Sep.2005 9.13am",
      "content": "Gerald, the reason I asked what browser you were using is that it can make a difference. A big difference.\n\nIs it a pain to have to update stuff all the time? sure! I hate it too. But if you want to be on the internet you have to realize that standards change. Or you could not use it. It’s up to you. I have one hint for you: Firefox.\n\nThe wiki is cool & if you think it’s got bad info - go in & correct it!\n\nAnd as regards the new typophile - it is better in some ways & worse in others. But tracking Your Threads is \\*easy now\\*. You just have to look for the link when you first come in. I would like the links I use the most to be at the top & bottom of every page. I need to load 2 pages to get where I want to go as it is. With links to recent posts & my posts on everypage I would not need to do that. I would like the option to have a thread be a long page instead on breaking it into 2+ pages too. Still, I am happy Typophile is here. It blows the pants off lists.\n\nI understand your being frustrated by tech - but now it’s time to grow up & act like a big boy. Either play nice and stop throwing feces or get sent to your room.\n\nHrant - the RSS is not cutting it for you? You are using that right? If so, what is missing? I stated to use RSS but I didn’t like my reader & I haven’t gotten another one yet so I admit being in the dark on that a bit.\n\n"
    },
    {
      "time": " 10.Sep.2005 9.31am",
      "content": "The RSS currently only alerts you to new threads. Basically, it’s useless (unless you’re extremely selective about what you read on Typophile).\n\nI’ve been using the Tracker, which is quite wasteful in terms of the overhead of repeatedly navigating over stuff you’ve already seen (and not being able to bypass certain sections, like ID in my case), but for now it’s the only way to not miss anything [unwittingly].\n\nhhp\n\n"
    },
    {
      "time": " 10.Sep.2005 9.34am",
      "content": "Right. It’s new threads- Oh, maybe you want the Rss to tell you if you have a new response to \\*your\\* threads or to tagged threads or something like that?\n\n"
    },
    {
      "time": " 10.Sep.2005 9.38am",
      "content": "I want to see all the posts (except in certain sections),  \nand choose what not to read. The old system allowed that.\n\nhhp\n\n"
    },
    {
      "time": " 10.Sep.2005 2.01pm",
      "content": "Oh, I see - so if it isn’t a brand new thread it isn’t listed on the RSS. Or put another way - new posts to existing threads don’t show up on the RSS. I get it. ( unless thats wrong )\n\nI agree with you about the tracker but some UI changes could fix at least 30% of the problems there. Still, it would be nice to have a RSS of all new postings and or subsections. I might be a pig for having this attitude, but I have to admit that the type id thing while quite impressive isn’t something I like to read a lot.\n\n"
    },
    {
      "time": " 10.Sep.2005 6.56pm",
      "content": "Eben\n\nThanks for your parental advice. Perhaps you can provide me with one further tidbit. How do I resign from Typophile?\n\nGerald\n\n"
    },
    {
      "time": " 10.Sep.2005 7.02pm",
      "content": "Boys, boys. Gerald is being grumpy, that’s all. People of all ages can do that. On the other hand, he’s also forgetting that Typophile is free, which makes complaining a lot less appealing! :-)\n\nhhp\n\n"
    },
    {
      "time": " 10.Sep.2005 7.23pm",
      "content": "Free or not Hrant, how actually do you get off the list? Can’t find the unsubscribe anywhere. Is one doomed to be a member of Typophile for eternity? Eben is not my problem here, he’s just a little prick, I’m a big boy. But this is really a major headache for me, and by the way, the only bad “tech” experience I am having on the net, and being a member, because of my compulsive nature, just causes me to self-punish myself on occasion, which, in my old age, I have learned to control by the “just quit” method.\n\nGerald\n\n"
    },
    {
      "time": " 10.Sep.2005 7.44pm",
      "content": "Gerald, really my parental riff was meant to be silly/funny. If it didn’t feel that way then I apologize. Basically I just wanted you to keep in mind some of us are not having the technical problems you are having & there is probably a solution if you can muster the patience. I have afeeling that if you asked for help resolving your issues you would get lots of it. And I wanted you to know that I thought you were not being fair to Typophile because it is as Hrant remninds us - free.\n\nPersonally I don’t see what is wrong with somebody signing up if they like Typophile - or leaving if they don’t. Or being grumpy. Whatever. It’s for them to decide. If folks want to try influence Gerald or the next impatient person- feel free. I won’t think less of you. Gerald, I am also totally happy with the idea of your staying. I have no desire to push you out either. I think you are very probably not giving Typophile a fair chance but - it’s your bag. Dowhatchalike. Typewhereyoulike.\n\nIf you are willing to answer a question or three before you go: Do you like Listservs better? What environment do you like better? Or do they all suck?\n\nHrant do you know Gerald?\n\n"
    },
    {
      "time": " 10.Sep.2005 8.19pm",
      "content": "Gerald, there should be a “log out” thing at the top-right.\n\nEben, Gerald was (is?) my letterpress teacher. I’d even  \npresume to think he’s a friend. I like you too though.\n\nhhp\n\n"
    },
    {
      "time": " 10.Sep.2005 10.51pm",
      "content": "Thanks!\n\nSo - all the more reason to try to help him stick around. No? Looking over his other posts he seemed pretty contented. Does he know that alot of us have had problems too? I guess that would not matter.\n\nI am up for attempting a little tech support - but your closer to him than I. By 2,300+ miles. :-)\n\nHere are some ideas:\n\n• Make sure his Plug-ins are up to date. That is my #1 guess.\n\n• Toss out the typophile cookies, he might not know how to do this so a little phone coaching or hands on might help. He will need to remember his password if it getting inserted automaticaly now.\n\n• Then ( or maybe first ) try a different browser. Like Firefox.\n\n•&nbsp;This is a little far fetched but I guess you could try a new account.\n\n• Also, he could see if Joe or Jared have any ideas.\n\nAnd now the thread is well & truely off topic. Oh well.\n\n"
    },
    {
      "time": " 11.Sep.2005 7.27am",
      "content": "⇒ _And now the thread is well & truely off topic._\n\nThanks, Eben, for pulling the thread back to topic.  \nThe topic may have run its course anyway since a greater need regarding browser management vs. Typophile beta errors was raised.\n\nActually issues such as Gerald’s should be directed either to the [**Bug Report Thread**](http://web.archive.org/web/20080115101909/http:/typophile.com/node/12063) or to a new topic area for Tech Assistance.\n\n————————————————————-  \n“Yes, I’m old!” is getting pretty old!\n\n"
    },
    {
      "time": " 12.Sep.2005 10.11am",
      "content": "BTW Eben, the posting errors of before are gone (although to me at least those were just a minor nuisance) but the much more disruptive full collapses of the system (usually over the weekends, as before) are still here...\n\nhhp\n\n"
    },
    {
      "time": " 12.Sep.2005 10.33am",
      "content": "Yes, the system does all kinds of wacky things. For instance when I show up I used to be recognized. Now I am not - but when I click into the forums then I am recognized. Sometimes I can post & sometimes not. I am sure it’s being worked on. And even if it isn’t - it’s still free.\n\nDid you even try to help Gerald?\n\n"
    },
    {
      "time": " 12.Sep.2005 10.43am",
      "content": "Help Gerald do what? Troubleshoot his system? Or troubleshoot Typophile? :-)\n\nhhp\n\n"
    },
    {
      "time": " 15.Sep.2005 12.17am",
      "content": "Eben\n\nPlease accept my apologies as well. I reading through this all you seem quite sincere and I certainly misjudged you.\n\nActually I am fairly computer literate. I was doing informational retrieval of online databases back in 1976. Worked with proprietary analog typesetting systems in the early 1980s. Was involved with the Mac platform since about 1989. So when I hear the question, “what is your browser,” I reach for my Taurus 9mm.\n\nAt any rate, I looked through the thread on problems with the beta and I now realize I am hardly the only one with problems and that this is somewhat of a misguided and unique hell hole—and in saying that, I do like Typophile or I would not even waste my time being critical. Hrant’s thing about “free” is a bit of nonsense though, most of the web is free, that’s why most of us are here, um, especially Hrant. :—)\n\nThere are some serious problems here and they actually need to be addressed by the owners and not solved by the members. I would suggest that the list “loyalists” start to come to terms with that. This might be a voluntary altruistic effort on the part of the owners (whoever they actually may be) but I do believe money is accepted at certain categories and when you do that you do have to deliver.\n\nIf I can’t get into the site half the time and it causes me problems the other half, looks like I will have to accept that, until, of course, it just becomes a pointless exercise.\n\nIf it’s a problem with my browser by the way, that’s Typophile’s problem, not mine.\n\nGerald\n\n"
    },
    {
      "time": " 15.Sep.2005 8.24am",
      "content": "Welcome back Gerald!\n\nI can’t say I agree with everything you wrote just now - but then there would be no point in having typophile if we all agreeed about everything - or knew everything.\n\n\\> If it’s a problem with my browser by the way, that’s Typophile’s problem, not mine.\n\nIf you are still using a 2.0 browser then I could not agree - that would be just asking for trouble - but chances are that your not using that old of a browser. Personally if I had to access Typophile with a specific browser then I would probably do that. But that is an extreme kind of attitude & I see your point about web sites needing to work with a wide range of browsers.\n\nAnyway - welcome back!\n\n"
    },
    {
      "time": " 15.Sep.2005 11.04am",
      "content": "Email notification is further down the list of improvements. The ability to flag a thread as one you’re interested in to “watch” is closer to being developed. At this point our focus is on fixing bugs and on getting the old content (courses, articles, projects) back online.\n\nAs far as browser support, that is a given. We’re committed to supporting current (within reason!) browsers. I’m talking about IE for Windows, Safari for Mac and Firefox for both.\n\n"
    }
  ]
}
