{
  "id": "14984",
  "title": "Antecedent Typeface - Need Help Please",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Antecedent was developed over the past year for my MA degree at Surrey Institute of art and design. The family consists of two sets, one for the screen and one for the print. The idea was to tweak the design but maintain the characteristics of the design so both would be seen as one typeface. The most significant change would be the xHeight and tracking.\n\nI would greatly appreciate any feedback anyone has to give on the ideas I have set forth as well as the design itself. I am looking for feedback for my Critical Exposition class this term. I have set up a temporary site with the theory and background information for this design at [http://www.e3type.com](http://web.archive.org/web/20150124143144/http:/www.e3type.com/ \"http://www.e3type.com\")\n\nThanks,  \nJim\n\n| Attachment | Size |\n| --- | --- |\n| [File](http://web.archive.org/web/20150124143144/http:/typophile.com/files/drupal_25) | 8.63 KB |\n| [File](http://web.archive.org/web/20150124143144/http:/typophile.com/files/drupal_32) | 14.24 KB |\n\n",
  "author": "monsieurpardee",
  "time": "5 Sep 2005 — 3:14am",
  "uid": "5582",
  "comments": [
    {
      "time": "5 Sep 2005 — 11:09am",
      "content": "I think the idea is smart, as it aknowledges the \"fatal\" limits of WYSIWYG.\n\nI'd like to see:  \n- the screen cut mapped to the grid better; it's too blurry.  \n- the details in the print cut; a much larger sample please.\n\nhhp\n\n"
    },
    {
      "time": "5 Sep 2005 — 1:11pm",
      "content": "I really like the typeafce you have created and think you are on to something great with this. It is very easy to read and shows a very distinct style that many typefaces lack.\n\n"
    },
    {
      "time": "5 Sep 2005 — 1:19pm",
      "content": "Hello,  \nThanks for the reply. I have uploaded a larger image. If it would help, I could upload the typeface itself for you to check. I have designed three weights for each screen and print.  \nJim\n\n"
    }
  ]
}
