{
  "id": "1500",
  "title": "Archive through September 30, 2003",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "if you didn't already see this on a bunch of other sites...   \n   \n [www.wired.com/news/mac/0,2125,60597,00.html](http://web.archive.org/web/20131017074746/http:/www.wired.com/news/mac/0%2C2125%2C60597%2C00.html)   \n   \nthe petition to stop it   \n   \n [www.petitiononline.com/mod\\_perl/signed.cgi?stopugly](http://web.archive.org/web/20131017074746/http:/www.petitiononline.com/mod_perl/signed.cgi?stopugly)\n\n",
  "author": "beejay",
  "time": "26 Sep 2003 — 11:45am",
  "uid": "1014",
  "comments": [
    {
      "time": "26 Sep 2003 — 11:54am",
      "content": "So much for Apple pretending to be graphically sophisticated all these years.   \nITC Garamond Obese Squished my bunghole. Not to mention Myriad.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Sep 2003 — 1:28pm",
      "content": "the petitions, that's a pretty funny online trend...hey that sucks...   \nhey, let's start an online petition...   \n   \n ![:-)](http://web.archive.org/web/20131017074746im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nWhere were these designers when Quiznos redesigned?\n\n"
    },
    {
      "time": "26 Sep 2003 — 1:46pm",
      "content": "I'm with Joseph, Apple's just trying to lead the way.   \nhopefully, no one would argue that their execution is   \nperfect (what's with the weird swooshy line?), but, they   \nare keeping with the look of their industrial design.   \n   \n\"Where were these designers when Quiznos   \nredesigned?\"   \n   \nprobably on the design team.\n\n"
    },
    {
      "time": "26 Sep 2003 — 1:53pm",
      "content": "\\> All they've done is a color change   \n   \nYeah, to _chrome_. Oh, I'm sorry, _titanium_. That makes all the difference. Like calling a 60s leopard print cheetah instead. And don't forget the requisite swoosh! :-/   \n   \nhhp\n\n"
    },
    {
      "time": "26 Sep 2003 — 2:56pm",
      "content": "Hrant, I agree with you. They use hype instead of substance. There is no way it should have taken them so long to develop a Unix based operating system. The old OS at best was buggy. You watch they will come out with gold penquins for there next innovation.\n\n"
    },
    {
      "time": "26 Sep 2003 — 4:33pm",
      "content": "\"So much for Apple pretending to be graphically sophisticated all these years.\"   \n   \nI could not agree more.   \n   \nI think it is the perfect mascot for a heard of clones -- I mean apple users.   \n   \nMaybe pump up the inner bevel and toss a drop shadow on it.   \n   \nI just have this deeply rooted belief that the majority of apple users are lazy/stupid.   \nI know that\n\n"
    },
    {
      "time": "26 Sep 2003 — 6:14pm",
      "content": "Ths change begs the question where does Apple go from chrome? Neon? Rust?   \n   \n:D\n\n"
    },
    {
      "time": "26 Sep 2003 — 6:23pm",
      "content": "\\> the majority of apple users are lazy/stupid.   \n   \nI haven't seen any numbers on that :-) but certainly the mouse having one button is very disconcerting.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Sep 2003 — 7:54pm",
      "content": "A one-button mouse is for people with half a brain.   \n   \nThe only TV that I watch is F-1 races on Speedvision, so \"unfortunately\" I haven't seen any Apple commercials. As for print ads, I never look at them for more than enough time for me to realize they're ads.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Sep 2003 — 8:25pm",
      "content": "\\> The only TV that I watch is F-1 races on Speedvision,   \n   \nHHP, really? I knew I always liked you ![:-)](http://web.archive.org/web/20131017074746im_/http:/www.typophile.com/forums/clipart/happy.gif). Thats about all I can make time for anymore. It seems that F1 is nearly unknown here in the states.   \n   \nI'm a mclaren/Kimmi fan myslef. Sunday!   \n   \nLast race was a little boring though, seemed like flashbacks from last years Shumacher masacre.   \n   \nAt least now I know there is more than one person out there judging the kerning on some of these car graphics. ;)\n\n"
    },
    {
      "time": "27 Sep 2003 — 3:29pm",
      "content": "\\> I'm a mclaren/Kimmi fan myslef.   \n   \nWow! I've been a McLaren fan since I started watching as an adult ('86), and have come within a few feet of Senna. I've also had a little chat with Hakkinen when he was still a test driver waiting for the team to finally get rid of that retard Michael Andretti. I have Mika's autograph, and those of Prost\\* and Wendlinger too. The last race was a total dozer - but tomorrow's will rock!   \n   \n\\* But I never liked him, even though he's half Armenian. You know what's hillarious? I made him autograph the back of a Senna sticker without him realizing! :-\\>   \n   \nI've been to six races total, two of them in Phoenix (you probably went to those, eh?), and you're right, it's not big in the US. It's probably not rigged enough (even with the safety car bull).   \n   \nChicky, if you ever manage to get to an actual F1 race\\* it's hard not to get emotionally attached, and make a point to watch every race at least live on TV for the rest of your life.   \n   \n\\* Except not Montecarlo, unless you're rich: the general admission there puts you on boulders like a mile away! You can't even tell the teammates apart without binoculars. Although the atmosphere there is unique.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Sep 2003 — 3:33pm",
      "content": "Oh, I forgot: Kimi the Iceman all the way!!   \nI can't tell you how much those brutish tifosi piss me off.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Sep 2003 — 6:05pm",
      "content": "\\> A one-button mouse is for people with half a brain.   \n  \nHmm. I'd like to see some numbers on that Hrant. ![](http://web.archive.org/web/20131017074746im_/http:/www.typophile.com/forums/clipart/wink.gif)   \n   \nObviously it is a matter of preference. I personally use a Wacom table for everything. Double click, control click, it's all in the pen. If you don't like the one button mouse, it's easy enough to swap it out.   \n   \nAs far as graphics, I find OS X to be very eye friendly. XP seems very heavy handed and ungainly. Like Joseph, I believe \"Play School\" comes to mind.   \n   \nBut in the end, to each their own.\n\n"
    },
    {
      "time": "27 Sep 2003 — 8:49pm",
      "content": "XP is basically the same as all windows have been, it's just a little flashier. I quite like the XP start menu myself.   \n   \nThe only thing that I really like about OSX is that the interface is all postscript and vectors, which means, of course, that it looks good at any size. XP still relies on bitmaps for everything.\n\n"
    },
    {
      "time": "27 Sep 2003 — 10:38pm",
      "content": "\\> Obviously it is a matter of preference.   \n   \nIt's more a matter of human ergonomics versus wannabe minimalism.   \n   \nMany functions are done with the second button (as you seem to realize with your tablet), but most Mac users stick with the default. You have all those fingers, why force people to reach for a key with the other hand? The answer in this case is simple: it's easier to sell the stuff to people (especially all the insecure ones -the \"rest of us\" as Apple calls them- that are afraid of computers), nevermind that they'll suffer in the long term, once they graduate beyond retard mode. Except by then they have little idea of what's on the \"other side\", and they've spent so much money that guilt precludes regret.   \n   \n\\> XP seems very heavy handed and ungainly.   \n   \nIt's not as \"pretty\" I guess, but in the end they're both ugly to me - but one of them admits it, and doesn't mind much. It's what's inside that counts - and as much as I loathe MS, XP does work very well. From what I know the newer MacOSes (unlike the previous ones) work well also, but the fact that they pretend to be visually sophisticated is annoying. It's all the same stale Sexy Robot crap.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Sep 2003 — 3:35am",
      "content": "\\> It's more a matter of human ergonomics versus wannabe minimalism.   \n   \nHrant: you make XP sound downright intuitive! My experience with it is anything but. And branding Mac users \"retards\" will not win friends and influence people. If you want to use all your digits, simply hold down the control key when you click with a one button mouse. It performs the same function as right click. You are clearly ignorant of the platform but are more than willing to trash it.   \n   \nI am not a mac elitist and would rather not debate the whole issue because frankly, it's dull. But I will state again: It is a matter of preference.\n\n"
    },
    {
      "time": "28 Sep 2003 — 8:07am",
      "content": "Hmm. So what do Windows users use their left hand for? ;-)   \n   \nSeriously, I've got a three-button mouse (with scroll wheel) on my Mac. The scroll wheel is the thing I most appreciate. I can never remember what the middle button is programmed to do, and it takes relatively difficult contortions to press it anyway (probably a connection there). The right button is nice, but control-click is just as easy. Sometimes I accidentally hit the left button while holding down the right button, a mistake that can't happen with a one-button mouse. In general, I find the multi-button mouse a bit less comfortable to use since you have to hold it with the thumb and two fingers instead of the thumb and three fingers, and the remaining two fingers must be more precisely placed. But I'm totally hooked on that scroll wheel.   \n   \nThe idea that a one-button mouse is for those with half a brain is ridiculous. If anything, it would engage both right and left sides of the brain more fully, since you need both hands for certain mouse operations. I'm not saying it's necessarilly better, but it's not necessarilly worse, either. Just different approaches with advantages and disadvantages on both sides.\n\n"
    },
    {
      "time": "28 Sep 2003 — 8:16am",
      "content": "AT this time, I feel OSX and XP are both pretty ugly. I have switched from Mac to PC when Apple was still Steve-Job-less and never looked back, but the new OSX-Look would have driven me away for sure. And even on XP, you can't really like the look unless you switch off a lot of effects, hack the bootscreen, change the icons, the colours and basically make th system look the way you want it. On Win2000 I used WinBlinds to customize the look, on XP I just hacked it a bit and that is quite enough. The simpler the better. I argue that an Operating System for professionals (not the Home-versions, mind) should be as lean and efficient and most of all customizable as possible. XP and OSX are overloaded.   \n   \nHrant -- the logi Mouses do work on Mac. The MX 700 is the best mouse available at the moment. While the one-button-g4-Mouse looks great, it just isn't any good at all, except maybe writing letters. The only worse mouse was that awful idiotic round iMac Mouse :-D.\n\n"
    },
    {
      "time": "28 Sep 2003 — 8:44am",
      "content": "\\> branding Mac users \"retards\"   \n   \nI did no such thing. What I said was:   \n1) People just starting out with computers are in \"retard mode\" (but most of them graduate).   \n2) Apple takes advantage of fear of seeming retarded to make sales.   \n   \n\\> simply hold down the control key   \n   \nWhich I already alluded to in my post.   \nBut you call that intuitive?! It's plain bad design.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Sep 2003 — 9:39am",
      "content": "I'm not talking about the OSes themselves - like I said (or tried to say), they both mostly suck. My complaint is with the companies behind them, specifically Apple in this case. It's annoying that they portray themselves as visually and \"intuitively\" sophisticated, while in reality it all looks childish, and is typographically wannabe.   \n   \nIt's what's inside that counts, and there both OSes are about the same. I just wish people would stop salivating over superficial crap, which is what Apple concentrates more on to sell their wares. While they were worried about getting the right sheen on their titanium toys, they failed to apply ClearType technology which they invented!   \n   \nhhp\n\n"
    },
    {
      "time": "28 Sep 2003 — 11:58am",
      "content": "I don't care which OS people use. I was talking about mice (or is it mouses?).   \n   \n_\\> simply hold down the control key   \n  \nWhich I already alluded to in my post.   \nBut you call that intuitive?! It's plain bad design._   \n     \n  \nIt isn't any less intuitive than the right click. Both are learned behaviors. Both behaviors become second nature in a short time and the method you aren't familiar with will always seem counterintuitive.   \n   \nIn my experience with the one-button mouse, my left hand was already poised over the shift, option, and command keys anyway, ready to modify whatever the right hand was doing with the mouse, so adding the control key into the mix to activate contextual menus was no big deal.   \n   \nIt took me a couple of weeks to get used to having a right mouse button and \"unlearning\" the control-click behavior to get to the point where I didn't need to think about it. I had expected a big productivity boost, but, when it comes down to it, I can't do anything that I couldn't do before (except maybe propping up my head with my left hand while sifting through tedious discussion forum threads).   \n   \nMy basic point is that the one button mouse system is not as brain-dead as some people seem to think. In terms of usability, the two approaches are not that different.   \n   \nNow, the scroll wheel is another story...\n\n"
    },
    {
      "time": "28 Sep 2003 — 2:12pm",
      "content": "\\> That's Capitalism for you.   \n   \nExactly.   \nIt's anti-Culture.   \n   \n\\> I was talking about mice (or is it mouses?).   \n   \n(I call them \"mouses\": it provides a distinction from the actual animal, for which I use \"mice\".)   \n   \nAnd I was talking about the thinking behind a company that encourages one-button mouses. It's not about which OS is better, is about MS and Apple being the same bastards, with the former at least not pretending to be otherwise as an engrained deception strategy!   \n   \n\\> It isn't any less intuitive than the right click.   \n   \nMark, come on. Your brand loyalty seems to be skewing your judgment.   \n   \nYou use the second button (or the control-click) only when you're pointing at something _with the mouse_. It's ergonomically wasteful (and counter-intuitive) to force the use of the other hand when there's a finger right there waiting for something to do. Don't forget that reliance on the keyboard is _exactly_ what the Mac is supposed to be against! It's an ironic farce, applied in the interest of getting insecure potential buyers to plunk down the money.   \n   \n\\> It took me a couple of weeks to get used to having a right   \n\\> mouse button and \"unlearning\" the control-click behavior   \n   \nAh, but as a rule \"upgrading\" is much easier than \"downgrading\" - now if you tried going back you'd realize what I'm talking about! It's just like going to a mouse without a wheel after using one with: pure torture!   \n   \n\\> I had expected a big productivity boost   \n   \nI wouldn't expect anything huge, but when speed counts (which very much does in my book), the second button (not to mention the invaluable wheel!) does matter. My mouse has a third button that I've programmed to do a \"minimize all\", and it makes a big cumulative difference in usability to somebody who multi-tasks a lot.   \n   \nBTW, I have a question: do all Mac keyboards have control keys on both sides?   \n   \n\\> except maybe propping up my head   \n   \nWhich I actually do a lot myself - it seems to help me think better when I'm reading onscreen. I also like to snack and drink with my left hand, and it would be stupid to have to put everything down just to press a key for half a second. Admit it dude: it's bad design.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Sep 2003 — 2:27pm",
      "content": "Hrant is right. The Mx 700 has 8 Buttons plus the absolute essential Mousewheel, and they are ALL important and Logi managed to make them all ergonomical and easy and intuitive to work with as well as fully programable. When I work as a lecturer in a design school, I sometimes have to work with the one-button-G4-mouse and it is terrible even for the simple task of surfing the web. It's just nicer to be able to surf with right hand only, using mouse buttons for back and forward or scrolling with the wheel, while you can drink a nice cup of coffee with the left hand :-).\n\n"
    },
    {
      "time": "28 Sep 2003 — 2:51pm",
      "content": "_\\> except maybe propping up my head   \n  \nWhich I actually do a lot myself - it seems to help me think better when I'm reading onscreen. I also like to snack and drink with my left hand, and it would be stupid to have to put everything down just to press a key for half a second. Admit it dude: it's bad design._   \n     \n   \nAh, _now_ I see. The two-button mouse encourages sloth and consumption! ;-D   \n   \nOn old (pre-flat screen) iMacs and most Mac laptops, the control and option keys are only on the left side. All Mac keyboards have the shift and command key on both sides.   \n   \nI still don't think the one-button mouse is a worse design. Both kinds of mouse have advantages and disadvantages and I'm not convinced that one is an overwhelmingly better solution than the other.   \n   \nThe scroll wheel, on the other hand, lets you do something with a flick of the finger that would otherwise require moving the mouse to a different screen location (involving greater hand-eye coodination) and clicking or dragging interface elements.\n\n"
    },
    {
      "time": "28 Sep 2003 — 3:14pm",
      "content": "I will admit that Apple's recent mouse designs have been bad. The round one was the worst, but the current lozenge-shaped one isn't too good either. My favorite was the pre-iMac tear-drop-shaped mouse. It was comfortable and responsive. The recent ones are nice to look at, but there is definitely too much geometry and not enough ergonometry.\n\n"
    },
    {
      "time": "28 Sep 2003 — 3:34pm",
      "content": "\\>\\>The right button is nice, but control-click is just as easy   \n   \nBut what do Mac users use in place of the Windows control-click?   \n   \n\\>\\>F1 is interesting   \nOh come on.   \nHrant, you can't berate Mac's for being all hype and no substance, then sing the praises of F1. (That's motor racing with hardly any overtaking - most races are won and lost on the speed of tyre/fuel stops).   \nHave a look at some motorcycle racing - its like F1, except that its exciting.   \nEven try Speedway - 4 bikes, 4 laps. The bikes run on alcohol and only go about 70-80 mph, BUT, they have no brakes - its great. The course is oval and most of it is in the corners, so the riders lean into the bend, with one foot on the floor, requiring them to wear thick metal plates in their left shoes - mental.   \nThere's also a thing called ice speedway, which is the same but, yes on ice. This means that the bikes have to have big spikes in the tyres - just don't fall off...\n\n"
    },
    {
      "time": "28 Sep 2003 — 4:21pm",
      "content": "\\> until I read this very last paragraph   \n   \nHow Belgian is _that_?! Food and drink go straight to your soul! :-)   \n   \n\\> only on the left side   \n   \nAha! Left-handers are therefore even more disadvantaged by a one-button mouse.   \n   \n\\> The scroll wheel, on the other hand ....   \n   \nWhich scrolly mouse has one button?...   \n   \nThe best mouse I've ever used was the \"pregnant badger\" model on my Amiga3000: a big dome with two large flat buttons flush to the pad.   \n   \n\\> motor racing with hardly any overtaking   \n   \nDid you watch today's race?!   \nI like bikes too, but it seems too much like Nascar, too much simple drafting-and-passing.   \nI don't find F-1 superficial - it's technique and skill pushed to the limit. I love it.   \n   \nBut my most favorite sport is street luge.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Sep 2003 — 6:08pm",
      "content": "Being a lefty I found my left hand was too stiff and precise to control a mouse. So I started mouseing with my right hand and never looked back.   \n   \nTrust me, flipping the mouse and pad to the left side got really old after about 3 seconds.   \n   \nBy the way, this thread reminds me of another situation I think parallels this discussion.   \n   \nAfter years of wearing glasses, I finally decided to give contacts a try and let me tell you they have as many drawbacks as their older cousin does for as many reasons as I've been influenced to switch. Reading all the dialog about Mac vs PS made me think about my current situation.   \n   \nI feel as attached to my old glasses as I do to a Classic Mac OS or Fontographer. . .   \n   \nSince FLAB is the future, so is OSX and contact lenses. . .   \n   \nSo let me state for the record while I am adjusting to three significant transitions in my life (digital and analog) there is no better or worse, just more options to frustrate yourself with.   \n   \nStuart :D\n\n"
    },
    {
      "time": "28 Sep 2003 — 6:21pm",
      "content": "I'd love to see a\n\n"
    },
    {
      "time": "28 Sep 2003 — 7:04pm",
      "content": "_Which scrolly mouse has one button?..._    \n  \nNone that I know of. As I said, I'm using a multi-button mouse with a scroll wheel. The scroll wheel is the thing I miss when I use a regular Mac mouse, not the extra buttons. I wouldn't mind a one-button mouse with a scroll wheel. Even better would be if I could also use it to scroll horizontally. It's really annoying when I get to one of those oddball sites that scrolls horizontally and I have to scroll using the scroll bar. ;-)   \n   \nInterestingly, Apple recently got a patent for a mouse with a dial on it that can scroll both directions. [http://www.macobserver.com/columns/devilsadvocate/2003/20030425.shtml](http://web.archive.org/web/20131017074746/http:/www.macobserver.com/columns/devilsadvocate/2003/20030425.shtml)   \n   \nMy complaints with Apple's current lozenge-shaped mouse are that the click is too stiff (even at the lowest setting), the top end of the mouse where you click is too large (at least for me--I have smaller than average hands), and it's trickier to pickup and move the mouse in the middle of a drag operation since nearly the whole mouse is a button. Plus, it doesn't have a scroll wheel. :-)\n\n"
    },
    {
      "time": "29 Sep 2003 — 10:27am",
      "content": "\\> oddball sites that scrolls horizontally   \n   \n:-\\>   \n   \nBTW, I just stumbled onto what I think _must_ be the most horizontal site on the web:   \n [http://www.letterpress.ch/VERSTYPO/TYPOGIFDER](http://web.archive.org/web/20131017074746/http:/www.letterpress.ch/VERSTYPO/TYPOGIFDER)   \n   \nhhp\n\n"
    },
    {
      "time": "29 Sep 2003 — 12:22pm",
      "content": "Wow. In a case like that, a horizontal scroll wheel wouldn't be much use to me anyway. With unusually long (or wide) pages, I tend to use the keyboard for scrolling (option+arrow keys to jump a screenful at a time). I find the scroll wheel works best for smaller, less continuous amounts. For going through pages and pages of stuff, it gets rather inefficient.   \n   \nOne thing you may have noticed on that MacObserver page is that not all Mac users are happy with the one-button mouse. But, as you yourself have often pointed out, people don't always know what's best for them. ;-)\n\n"
    },
    {
      "time": "29 Sep 2003 — 12:43pm",
      "content": "Platforms aside, I think someone else said it pretty well: \"You hire a carpenter, not a hammer.\"   \n   \nBoth platforms have their niches, diversity breeds strengh.\n\n"
    },
    {
      "time": "29 Sep 2003 — 2:38pm",
      "content": "Kyle, let's just hope for a minor miracle in Japan... But at least it was a great race to watch. BTW, Chris, you were right about Montoya falling apart under the pressure.   \n   \nBut did you see how empty the grandstands were?! Pisses me off royally. Potentially the most exciting and important race in _years_, and people stay home to watch Friends reruns or something.   \n   \nhhp\n\n"
    },
    {
      "time": "29 Sep 2003 — 3:05pm",
      "content": "HHP the only racing I follow is what I like to do in my spare time, bicycle racing. Dan\n\n"
    },
    {
      "time": "29 Sep 2003 — 5:14pm",
      "content": "\\>Yeah, to chrome. Oh, I'm sorry, titanium.   \n  \nActually Steve Jobs color is aluminum.\n\n"
    },
    {
      "time": "29 Sep 2003 — 5:28pm",
      "content": "\\>I'm a mclaren/Kimmi...   \n   \n Quite telling you cheer a calm Finn with a Mercedes over ferrari. Great analogy of my perception comparing the PC world to Mac.\n\n"
    },
    {
      "time": "29 Sep 2003 — 5:31pm",
      "content": "\\>So much for Apple pretending to be graphically ...   \n   \nYou\n\n"
    },
    {
      "time": "29 Sep 2003 — 6:59pm",
      "content": "hhp: GREAT race. Really a good race. Know we just have to hope Kimi can pull off 1st the next two. ![:-)](http://web.archive.org/web/20131017074746im_/http:/www.typophile.com/forums/clipart/happy.gif) Otherwise its MS's race all over again.\n\n"
    },
    {
      "time": "29 Sep 2003 — 7:03pm",
      "content": "\\> Interestingly, Apple recently got a patent for a mouse with a dial on it that can scroll both directions.   \n   \nI actually have had a MS mouse for some time that does this, by pressing left and right on the scroll wheel. It also has a scroll wheel click (which I have setup to minimize all windows) and two small buttons at thumb level for back/forward operation. Im quite fond of it. It also is wireless and optical.   \n   \nOhh, and it gives a great hand job... errr. I mean. ![:-)](http://web.archive.org/web/20131017074746im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nhildebrant.\n\n"
    },
    {
      "time": "29 Sep 2003 — 8:08pm",
      "content": "\\> what is it about ITC Garamond Obese that squishes you so?   \n   \nIt's a triple whammy: violation of the Garamond (Jannon) original; dysfunctionally large x-height; and dysfunctionally narrow forms. Look at the excruciating imbalance in the \"to\" pair for example.   \n   \n\\> Or Myriad?   \n   \nMyriad is too widely used and generic to serve as a corporate face.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Sep 2003 — 12:39am",
      "content": "\\>\\>   \n\\>\\>The right button is nice, but control-click is just as easy   \nBut what do Mac users use in place of the Windows control-click?   \n   \nAnyone?\n\n"
    },
    {
      "time": "30 Sep 2003 — 7:22am",
      "content": "Windows has (typically) 2 mouse buttons, as well as control, shift and alt keys.   \n   \nAfter left-click, and double-click, right-click is probably the next most common windows trigger.   \n(Double-right click is a much underused feature!)   \n   \nAfter that, there are control-click, and shift-click.   \nTypically, in a list of options, control-click will multi-select non-consecutive items, while shift-click will select all the items between two selections.   \nThese have other uses, in non-list situations. For example, in many graphics apps, where click replaces a selection with a new selection, control-click removes from the original selection, and shift-click adds to it.   \nNow you come to mention it, alt-click isn't used much (and maybe Macs have an alt key too), so maybe the equivalents are:   \n**Windows**   \nLeft-click   \nRight-click   \nControl-click   \nShift-click   \nAlt-click   \n   \n   \n**Mac**   \nLeft-click   \nControl-click   \nOption-click   \nShift-click   \n???   \nBut what about the command(?) key on Macs.?   \nWhat does that do?\n\n"
    },
    {
      "time": "30 Sep 2003 — 8:31am",
      "content": " **What can chrome do for you?**   \n   \nLike many, I've long been enamoured of Apple's industrial design, UI, advertising, et al. They are one of the few companies in any sector that consistently realizes the potential of design as a differentiator. You can buy a dell for 1/3 to 1/4 of what a Apple desktop will cost you, but who wants to look at it -- on or off! Apple gets the design = value equation like few others.   \n   \nThat said, they seem to have joined the ranks of the great unwashed in their race to create the puffiest logo.   \n   \n ![Uglies](http://web.archive.org/web/20131017074746im_/http:/www.typophile.com/forums/messages/4100/17363.jpg)   \n   \nWe should have seen it coming with the proliferation of glowing, pulsing jelly bean buttons, drop shadows, liquid animations, I guess. Design at Apple is now treading a dangerous line between innovation and novelty. This new logo can only be seen as the latter. It's an indulgence of Apple's new material fetish and has nothing to do with design, communication, or signalling any kind of real or positive change. It's insecure, trendy, and destined share the fate of Disney's Tomorrowland.\n\n"
    },
    {
      "time": "30 Sep 2003 — 8:39am",
      "content": "for the Mac, \\<command click\\> is used for non-   \nconsecutive selection (but, shift serves this function in   \nthe Classic Finder). \\<option click\\> serves various useful   \nfunctions depending on the application, but in the   \nFinder it allows you to close the preceding window as   \nyou open the next. \\<control click\\> is the equivalent of   \nWindows right-click. \\<shift click\\> allows for non-   \nconsecutive selection in the finder and consecutive   \nselection elsewhere (why this happened, I don't know).   \n   \nthe \\<option\\> key on Mac keyboards is the equivalent of   \n\\<alt\\>, and on some keyboards (possibly all now) it   \nactually says \\<alt\\> in smaller type.\n\n"
    },
    {
      "time": "30 Sep 2003 — 8:44am",
      "content": "\\> design = value   \n   \nSure, but when looks take precedence over content, that's bad news. Just like a dumb blond[e].   \n   \n--   \n   \nInteresting side note:   \nPutting something in angled brackets makes it disappear from the Typophile emailed post!   \n   \nhhp\n\n"
    },
    {
      "time": "30 Sep 2003 — 8:50am",
      "content": "\"Design at Apple is now treading a dangerous line   \nbetween innovation and novelty. This new logo can   \nonly be seen as the latter.\"   \n   \nthey've been doing this ever since the iMac -- one of   \nthe biggest hits in PC market history. I personally don't   \nlike it, but the slobering masses, who don't know a   \nmicrochip from a hard disk, eat it up. and, masses are   \nthe key in the global economy.   \n   \nwe're looking for quality hardware, plain and simple,   \nright? as long as that partially eaten apple is still   \npresent (whatever color or dimensionality it may take   \non), we have reasonable assurance we'll get it. quality   \nwill likely slide as Apple pursues the larger body of   \nusers out there, but they aren't likely to leave behind   \nthe design community just yet.\n\n"
    },
    {
      "time": "26 Sep 2003 — 1:18pm",
      "content": "All they've done is a color change on what they have. My   \nprediction is that it will live in software only - as with the   \ncurrent OS interface featuring a glossy, blue logo. (That   \npetition is silly. 322 signatures.)   \n   \nI think it's great to watch Apple lead industrial design.   \nCheck out the new [LaCie drives](http://web.archive.org/web/20131017074746/http:/www.lacie.com/) designed by Porsche   \ndesign. There is no mistaking the G5 inspiration. (I'm not   \nsaying LaCie is copying Apple... Who could blame them for   \ndumping their beige plastic for buttery metal.)\n\n"
    },
    {
      "time": "26 Sep 2003 — 5:29pm",
      "content": "Is this going to turn into a Mac vs. PC flame war? Not   \neverybody can use a Mac. Just like not everybody can drive   \na Mercedes.   \n   \nLazy? Clones? Stupid? Come on... use some material/data/facts.   \n   \nSurely you're not arguing that Windows is innovative or   \ngood design. The Windows XP interface looks like it was   \ndeveloped by the kids in a Duplo play session (over-sized   \nbuttons, loud primary colors. I usually respect the work   \nFrog Design does but XP is ugly and bloated.   \n   \nYour turn.\n\n"
    },
    {
      "time": "26 Sep 2003 — 7:00pm",
      "content": "one button is fun. laser makes it usable anywhere. great for three-four handed tasks \\<[:-}   \nBTW, is this just G4 envy? It's the new commercial, right?\n\n"
    }
  ]
}
