{
  "id": "15001",
  "title": "Nick Cooke",
  "forum": "Home",
  "tags": [
    "Designer",
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20150201230722/http:/typophile.com/wiki/Indices) : [Designers](http://web.archive.org/web/20150201230722/http:/typophile.com/wiki/Designers) : Nick Cooke**\n\nNick Cooke started his typographic journey as a lettering artist, in London, in 1982, crafting type by hand for book jackets. Working with David Cox (the great nephew of Eric Gill) was for him an apprenticeship into acquiring an appreciation of letterforms and proportions.\n\nInvolved in the digital type eversince computers made it to the mainline, he began to experiment with designing complete typefaces using Fontographer. His first type family 'Penguin', developed while working for Prima magazine, was accepted by Fontshop International in 1995. His second type family, an one-off script font 'ITC Dartangnon' was produced in a similar manner at his next place of employment.\n\nHis independent career started soon after, as Fontworks UK started comissioning him custom typefaces for their clients. Later on, following his suggestion, they were more than happy to market his proprietary designs under the G-Type Foundry name. So, he started the [G-Type](http://web.archive.org/web/20150201230722/http:/www.g-type.com/) foundry in 1999 to develop innovative and original - but most importantly, usable typefaces.\n\nNick Cooke is still doing comissioned work for Fontworks UK as well as custom type and lettering for his own clients.\n\nCreation Dates:\n\nFF Penguin - 1995  \nITC Dartangnon - 1998\n\nG-Type fonts  \nGeetype - 1999  \nGizmo - 1999  \nHouschka Family - 1999  \nNubian Family - 1999  \nDigitalis - 2000  \nAccent Graphic Family - 2001  \nPrecious Sans - 2001  \nPrecious Serif - 2002  \nAmulet- 2002  \nChevin - 2003  \nSovereign Family - 2004\n\nCustom work  \nVauxhall (UK) type family  \nWhich? magazine type family Serif and Sans (Consumers' Association, UK)  \nRAC typeface\n\nWe can see G-Type fonts used in:  \n- national newspapers (Mail on Sunday)  \n- magazines (New Woman, Garden Answers, Cycling Weekly, Test Drive, F1 Racing, Brazilian Cosmopolitan, Home Entertainment)  \n- album sleeves (Peter Gabriel)  \n- supermarket signage (Tesco)  \n- corporate identity programmes (Royal Mail, SKF)  \n- branding (Scottish Power, Cadbury-Schweppes, Birmingham Selfridges)  \n- packaging (Marks & Spencer chocolate bars, Jockey shorts, Pretty Polly)  \n- advertising (MacDonalds, Thameslink trains)  \n- TV ads (Lynx deodourant).\n\nThis wide usage of his typefaces by major UK clients in publishing, retail, and branding is a testament to their versatility and quality.\n\n",
  "author": "george",
  "time": "6 Sep 2005 — 7:08am",
  "uid": "1104",
  "comments": [

  ]
}
