{
  "id": "15010",
  "title": "Antares",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "I'd be highly interested in hearing thoughts about this fascinating animal:  \n [http://www.dutchtypelibrary.nl/PDF/M504/DTL%20Antares\\_preview.pdf](http://web.archive.org/web/20130818191652/http:/www.dutchtypelibrary.nl/PDF/M504/DTL%20Antares_preview.pdf \"http://www.dutchtypelibrary.nl/PDF/M504/DTL%20Antares\\_preview.pdf\")\n\nhhp\n\n",
  "author": "hrant",
  "time": "6 Sep 2005 — 9:04pm",
  "uid": "1250",
  "comments": [
    {
      "time": "7 Sep 2005 — 2:31am",
      "content": "Erhard Kaiser has been in the trade for quite a long time now and sometimes this shows up in his designs. The trapping, not always completely consistent, has almost become a part of his hand. Therefore it is quite difficult to remove, but it does not bother me that much actually, especially considering the overall very high quality of Erhard’s designs. There is not much trapping in DTL Antares, but perhaps we will suppress it somewhat more before the typeface is officially released.\n\nTo give you an idea how meticulously DTL Antares was developed, I have placed a small PDF at [http://www.dutchtypelibrary.nl/PDF/Temp/Antares/DTLAntares\\_develop.pdf](http://web.archive.org/web/20130818191652/http:/www.dutchtypelibrary.nl/PDF/Temp/Antares/DTLAntares_develop.pdf \"http://www.dutchtypelibrary.nl/PDF/Temp/Antares/DTLAntares\\_develop.pdf\"). It shows for instance the first version, which was rounder with a lower contrast and the former and final versions with the high contrast.\n\n"
    },
    {
      "time": "7 Sep 2005 — 7:28am",
      "content": "Fascinating PDF on the development of the face, thanks.\n\nMy feeling is that the earlier version, more round with less contrast, would be better for text, but I am just guessing. The final version is extremely consistent and well thought out and beautifully executed. I don't warm to it, though this may be a matter of personal taste.\n\n"
    },
    {
      "time": "7 Sep 2005 — 9:50am",
      "content": "Insight into font development is always highly welcome - thank you!\n\nThe earlier more round version is indeed more appealing when looking at large glyphs; but this is a text face, and I have a strong hunch that the final version is more \"true\" to what needed to be done. And this ties in to my view that a true text face needs a certain subtle ugliness to really click.\n\nhhp\n\n"
    },
    {
      "time": "28 Sep 2005 — 5:31pm",
      "content": "This is really fascinating, Frank. It seems that he had similar problems as I did when trying to \"figure out\" a typeface of this construction. It is really hard, for instance, to make it seem like certain glyphs don't fall over to the left.\n\nPersonally I think the first version feels more like a text face, the high-contrast final version is not as nice. Still hard to tell without seeing text blocks of both side-by-side! I found the italics were also very tricky, almost unworkable. Still, it is very interesting to see the development, side by side, thanks!\n\n"
    },
    {
      "time": "30 Oct 2005 — 4:06am",
      "content": "Prokyon looks like something I'd have done to Gill Sans models ten years ago. The difference is these types are very well drawn, but it seems to me such radical stylistic choices seriously limit their applicability.  \nIt seems to me they become quickly very tiring on the eye.  \nThe lc a of the Italic is even more problematic than the one in my own Ottomat. It's like the one in Dax Italic.\n\nI say these things because, being DTL releases, I guessed they may have been thought as text-aimed. Or are they meant more as display types?\n\nPlease, Hrant, note I used the term \"display types\". I happily see how I've changed (and still changing).\n\n"
    },
    {
      "time": "30 Oct 2005 — 4:08am",
      "content": "Hrant wrote: \"And this ties in to my view that a true text face needs a certain subtle ugliness to really click.\"\n\nYes, a certain degree of irregularity. But this is not the main issue here, it seems to me.\n\n"
    },
    {
      "time": "30 Oct 2005 — 9:00am",
      "content": "Welcome to the Dark Side.\n\nhhp\n\n"
    }
  ]
}
