{
  "id": "15041",
  "title": "Expressing yourself with nonexpressive type",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Proxy Magazine — Adobe vol.1 no.4:\n\nMaybe it’s a paradox, but Lucille Tenazas doesn’t see it that way. As the principal of San Francisco’s Tenazas Design and founding chair of the graduate program in design at the California College of the Arts (formerly CCAC), she has long been known for her innovative typography. But rarely does she reach for anything but the most common classical typefaces.\n\n“I think that the less expressive a typeface is, the more creative a designer can be with it.”\n\n“ If you have a strong image you can use it to recontextualize the type and give it a character all its own.”\n\nTenazas’s award-winning work tends to do just that: juxtapose a powerful image with a meaningful arrangement  \nof type. By using subtle contrasts between serif and sans serif, as well as weight, she turns what’s sometimes considered bland type into powerful statements.\n\nI believe that the test of a good designer is how well he or she deals with type,” she says.  \n“ Good typography should be intuitive and structural at the same time.”\n\n| Attachment | Size |\n| --- | --- |\n| [design.jpg](http://web.archive.org/web/20081012032123/http:/typophile.com/files/design.jpg) | 93.33 KB |\n| [design1.jpg](http://web.archive.org/web/20081012032123/http:/typophile.com/files/design1.jpg) | 81.4 KB |\n| [design2.jpg](http://web.archive.org/web/20081012032123/http:/typophile.com/files/design2.jpg) | 89.71 KB |\n\n [‹ Quark re-brand](http://web.archive.org/web/20081012032123/http:/typophile.com/node/15064 \"Go to previous forum topic\") [Idle in neutral ›](http://web.archive.org/web/20081012032123/http:/typophile.com/node/15113 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012032123/http://typophile.com/user/8867\" title=\"View user profile.\">david hamuel</a>",
  "time": "<br>",
  "uid": "8867",
  "comments": [
    {
      "time": " 8.Sep.2005 4.04pm",
      "content": "The “design” of a typeface is only one of the many elements considered in typography.  \nA “good” typeface does not equal good typography, and a “bad” typeface needn’t produce bad typography. — Typography 101.\n\n————————————————————-  \nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 8.Sep.2005 6.44pm",
      "content": "\\> “I think that the less expressive a typeface is,  \n\\> the more creative a designer can be with it.”\n\nWhat she really means is: “I don’t understand the real power of type, and I’m  \ntoo lazy to learn, so I’d rather just express myself the way it’s easiest for me.”\n\nhhp\n\n"
    },
    {
      "time": " 8.Sep.2005 7.02pm",
      "content": "Or perhaps she does know the power of type? The laziest thing a person can do is pick a typeface from a large library and assume they are now done. The power of the type will take over and do your job for you. Not. Anyone who has labored over a typographic design can tell you that lazy is not even possible. Only lazy typographers throw there font library at a job. That is easy as hell.\n\nChrisL\n\n"
    },
    {
      "time": " 8.Sep.2005 7.27pm",
      "content": "There are indeed different types of lazy. And it’s possible she’s not lazy. But the alternatives are distinctly worse. I was being gentle.\n\nhhp\n\n"
    },
    {
      "time": " 9.Sep.2005 12.39am",
      "content": " **Personally I feel ever so relieved every time a designer manages to overcome his urge to** express himself **through type.**\n\nƒ\n\n"
    },
    {
      "time": " 9.Sep.2005 5.38am",
      "content": "Fredo is right. The type is used to solve a communication problem brought to the designer by a client. The type should help “express” the solution to that problem, not the psyche of the designer who uses it.\n\nChrisL\n\n"
    },
    {
      "time": " 9.Sep.2005 5.57am",
      "content": "Hrant, I don’t think she does not understand the real power of type.\n\n“The type is used to solve a communication problem brought to the designer by a client. The type should help “express” the solution to that problem, not the psyche of the designer who uses it.”\n\nChris, True. See the sample of her work.\n\n"
    },
    {
      "time": " 9.Sep.2005 7.04am",
      "content": "Chris Lozos articulates a fundamental principle of design—though I hear often enough that clients don’t correctly understand their own problems.\n\nHowever there is too much good design of all styles—with expressive type and with neutral type, with an element of personal expression and with an anonymous style—to be dogmatic about one approach being ’best’.\n\nFor a start, the length of work is a big factor. Too much artistic expressiveness in a lengthy text will seriously detract form the content of the author. But in a poster that tries to influence the viewer at a glance, expressive approaches may well get the better solutions.\n\n"
    },
    {
      "time": " 9.Sep.2005 7.25am",
      "content": "\\> _See the sample of her work._\n\nAre there other samples available for viewing?  \nThe _REVELATORY LANDSCAPES_ is sorta bland, n’est pas?\n\nIMHO, Ilene Strizver’s [horizon line](http://web.archive.org/web/20081012032123/http:/www.thetypestudio.com/TypeRulessubs/typerulesREV.html) is fully integrated into the typography of the book cover and not so “incidental” in feeling as Ms. Tenazas’s. I’m not knocking Tenazas’s book cover design, it just doesn’t look revelatory to me.\n\n————————————————————-  \nYes, I’m old, but I’m back in style!\n\n"
    },
    {
      "time": " 9.Sep.2005 7.32am",
      "content": "Are there other samples available for viewing?\n\nYes. I’ll post soon.\n\n"
    },
    {
      "time": " 9.Sep.2005 7.38am",
      "content": "\\> overcome his urge to express himself through type.\n\nOr express himself at all, through type or anything else. But that’s a different issue. No matter how talented/skilled a designer is in a certain niche (often merely a result of arbitrary self-imposed limitations) we cannot ignore the negative implications of shunning fonts beyond a small “classic” set. Furthermore, type is the point of Typophile, so that issue is what needs the most focus here.\n\nhhp\n\n"
    },
    {
      "time": " 9.Sep.2005 7.43am",
      "content": "Is there such a thing as nonexpressive type?\n\n"
    },
    {
      "time": " 9.Sep.2005 7.47am",
      "content": "\\> _we cannot ignore the negative implications of shunning fonts beyond a small “classic” set_\n\nIs this another slam against Vignelli again, Hrant?\n\n—————————————————————————-  \nYes, I’m old, but I know a slam when I see one!\n\n"
    },
    {
      "time": " 9.Sep.2005 7.50am",
      "content": "\\> Is there such a thing as nonexpressive type?\n\nStage direction:  \n_Norbert stares into the void with no expression on his face_\n\n————————————————————-  \nYes, I’m old, but I’m expressionless!\n\n"
    },
    {
      "time": " 9.Sep.2005 7.51am",
      "content": "It’s Tenazas’s turn - no cutting in line!\n\nI really don’t get it, not on Typophile. Admire certain skills all you want, but if one assumes correctly that all of us here appreciate the value of expression in fonts, variety, and <cite>new</cite> fonts, there is a serious problem with Vignelli, Tenazas, et alia. Admit it, move on.\n\nhhp\n\n"
    },
    {
      "time": " 9.Sep.2005 7.53am",
      "content": "”...though I hear often enough that clients don’t correctly understand their own problems.”\n\nTrue William. Part of a good designers job is to help the client “see the problem” and articulate it with delineation of audience, purpose, message, and desired action. (Paul Rand was a master at this.) Design is about problem solving. This includes far more non-visual work than people not in the design field understand. It is hard sometimes to convince a client that comes to you holding something and says, “Make me one of these” that “one of those” doesn’t solve his problem. The easiest part of being a designer is when you are just doing the design. The rest is the real work.\n\nChrisL\n\n"
    },
    {
      "time": " 9.Sep.2005 8.12am",
      "content": "My readng of that quote is: A) a cautionary statement to budding designers, and B) an articulation of _focus_ in a design piece: if the type calls for less attention, the other elements will receive that attention (or have to pick up the slack), and therefore the “more creative” the designer can be/has to be with other elements.\n\nAlso, she’s expressing her own take on the design process. I don’t think one or the other is ’better’ because I’ve seen and appreciated examples of both. It’s the _knowing_ about these visual balances and trade-offs that seems most important to me.\n\nJust becuase I have a deep appreciation for variety in type design doesn’t mean I won’t use Helvetica or Garamond to keep the type toned down next to an image that does the job. This is, of course, coming from a graphic designer, not a type designer.\n\n"
    },
    {
      "time": " 9.Sep.2005 8.35am",
      "content": "It could be she’s encouraging other designers to not let trendy fonts make design decisions for them?\n\n"
    },
    {
      "time": " 9.Sep.2005 8.42am",
      "content": "\\> the other elements will receive that attention\n\nNot necessarily.\n\nhhp\n\n"
    },
    {
      "time": " 9.Sep.2005 8.57am",
      "content": "I still think we as a community should be highlighting exemplary work in both type design and typography. There are way too many samples of mediocre pieces that tend to justify themselves by way of explanation.\n\nIf we lower the bar then how are we to inspire or build an appreciation of type in others. The exceptional can still be subtle, just not ho-hum!\n\n"
    },
    {
      "time": " 9.Sep.2005 9.00am",
      "content": "Or hey, what about this?\n\n“The less expressive a graphic designer is, the  \nmore creative a user can be with the content.”\n\nOr even:\n\n“The less expressive an author is, the more  \ncreative a reader can be with his life.”\n\nMisguided, one and all.\n\nhhp\n\n"
    },
    {
      "time": " 9.Sep.2005 9.38am",
      "content": "Basic typography courses often start students off with exercises that force them to do a lot of things with one or two boring typefaces (stilted Bodonis, Times, Helvetica). At that stage, it’s useful for them to learn how to use type. Later, after one has presumably learned how to use it and has control over the type, the designer can indeed do a lot of things with type that even the type designer might not have imagined, and not all bad, either.\n\nStill, one arrives at a threshold with a certain typeface where there isn’t anything else you can get out of it. Certain Bodoni cuts dry up and fade off the page with a certain amount of use. They look empty, weak, or at best, like throwbacks or imitations of 70’s ads. At that point I would indeed urge a conservative designer to crack open the internet and discover the world of new powerful typefaces. But I don’t think it’s categorically weak or unimaginative for a designer to want to see how much they can get out of a certain established face. I just hope that they don’t hobble themselves by being dogmatic about it and refusing to look around. The internet itself is the most obvious example.\n\n"
    },
    {
      "time": " 9.Sep.2005 9.42am",
      "content": "”Yes, I’m old, but I’m expressionless!”\n\nRight. And I’m invisible.\n\nMaybe expressionless type is like transparent design, too convinced of its own existence to be real.\n\n"
    },
    {
      "time": " 9.Sep.2005 9.54am",
      "content": "Carl:  \nAnd one would assume that Tenazas is somewhat  \nbeyond being a basic student of typography...\n\nJames, you’re so right that expression is unavoidable (which is certainly great, although only if it’s not made a fetish). Warde/Morison were full of it. And anybody who thinks Helvetica is neutral needs to stick to just seeing Barbarella over and over again. On the other hand, some fonts are certainly more expressive than others.\n\nhhp\n\n"
    },
    {
      "time": " 9.Sep.2005 9.59am",
      "content": "Imposing certain limitations for the sake of creative exploration is understandable and commendable.\n\nPicasso’s limited palette for his “Blue” period, and [Piet Mondrian](http://web.archive.org/web/20081012032123/http:/www.moma.org/collection/browse_results.php?criteria=O%3AAD%3AE%3A4057&page_number=5&template_id=1&sort_order=1) restricting himself to verticals, horizontals and primary colors pushed personal and creative “boundaries” but neither of them declared their exploration to be the _be all and end all_ of creativity.\n\nSo IMHO: _Limitation good... exclusion bad!_\n\n"
    },
    {
      "time": " 9.Sep.2005 10.16am",
      "content": "”On the other hand, some fonts are certainly more expressive than others.“\n\nAnd expressive of different things.\n\nNorbert makes good points. It is the limitations an artist chooses that define the artist. Recently I was at a Dan Flavin show where the progress of his art could be seen in the refinement of his limitations. No one claims that Flavin is better because he uses ready made materials.\n\nWe are reacting to the idea that the design is better for limiting itself to classic faces, when the point is that good design can be built with classic and/or contemparary faces.\n\n"
    },
    {
      "time": " 9.Sep.2005 10.18am",
      "content": "I think I’m allowing for the possibility that Tenazas is a conservative designer, who chooses a minimal palette. She seems fully in control of the type she’s using, and a separate issue for any designer is which typefaces they choose. A really good designer can get mediocre and poorly-made typefaces to look better than they are. A good designer can get more freshness out of stale type. But I think the designer who masters typography and then ignores all but 4 type designs is not really making the most of type.\n\nIn the best of worlds, the designer uses expression to enhance the editorial message (not their own ego), and I don’t think this can be fully realized using only Bodoni and News Gothic. But it’s important to discern between skilled typography that seems boring, and inept typography.\n\nI think Tenazas is skilled but dogmatic. There’s a passive-aggressive voice in her work that refuses to really let go of the “expressiveness” of seemingly inexpressive type. It’s maybe not paradoxical but dishonest.\n\n"
    },
    {
      "time": " 9.Sep.2005 10.27am",
      "content": "\\>Limitation good… exclusion bad!\n\nPretty good for an old guy. Goes in ’best quotes from Typophile’.\n\n——\n\nI was born before Norbert, but I’m young!\n\n"
    },
    {
      "time": " 9.Sep.2005 10.40am",
      "content": "I recall a period in the 60s when there was a hot new type that became “in” every few months. There was a time when every head was set in Cooper Black. That ad had to be great because it was set in Cooper. This is what I used to call the “Typeface of the Month Club” period. Everyone was “discovering” the in face and all the ad agency account reps were throwing type names around like they would save the world from nuclear holocaust. About 75% of the ads were pure crap because all they did was use the “cool font”.  \nYou can fail at design both by excluding all but the same blessed few types or you can fail by using a new one every month. It is about the skill, knowledge, and talent of the designer, not how big or small his toolbox is. The world is a big place, there is room for everyones way of working. There is no need to point and chastise those who don’t do it your way. Do your own work and do it well. Discussing differences in work habits is fine but putting down others for not doing it your way is more dogmatic than confining yourself to a few trusted types. So, how many types did Garamond, Caslon, and Gutenburg use?  \nChrisL\n\n"
    },
    {
      "time": " 9.Sep.2005 10.53am",
      "content": "Well said, Carl.  \nTo me, her choice of typefaces is extremely expressive — expressive of a contempt for contemporary type design. I take it personally.\n\nHowever, if that’s the way she wants to design, that’s cool, that’s her prerogative. But I can’t help the way I feel about it, having dedicated my career to making new typefaces.\n\n"
    },
    {
      "time": " 9.Sep.2005 11.23am",
      "content": "\\> _About 75% of the ads were pure crap because all they did was use the “cool font”._\n\nSo true, Chris.  \nBut aahhhh... it was great “type marketing” which really hit it’s zenith between the mid-seventies to mid-eighties. [Aaron Burns](http://web.archive.org/web/20081012032123/http:/typophile.com/wiki/Aaron%252BBurns) of ITC and [Mike Parker](http://web.archive.org/web/20081012032123/http:/typophile.com/wiki/Mike%252BParker) of Linotype were two maestros of making fonts fashionable. This has less to do with the current topic thread, but stimulating markets to purchase fonts and building huge libraries of typeface went hand-in-hand with the _Hardware Wars_ between Linotype, Monotype, Berthold and Compugraphic.\n\nThe metal that had to be sold was in the form of high-end proprietary typesetting equipment, and if it couldn’t output the hottest and biggest selection of type then sales suffered badly.\n\nAnother topic for another day.\n\n"
    },
    {
      "time": " 9.Sep.2005 12.56pm",
      "content": "Hrant is also right that not managing to choose type in a sensitive way is disfuctional. It just is.\n\nBut it is also true that alot of graphic design tries to ride on the font choice to a degree which is excessive. Even if the the example is extreme it is getting at a reasonable point. The idea of showing that you can do strong work with a more limited set of fonts is a good one. Limiting choices in graphic design is sometimes a good way of getting focus on a problem.\n\nThe biggest problem I see with the text is the idea that certain fonts are ’classic’. Our society is all too ready to create ’classics’. The idea of Classic Rock & Classic Fonts are both ideas borne of an impetus to bland insensitive lazy reductivism. It will be ’classic punk’ & eventually ’classic vegis’ next. I think I’ll choose my own ’classics’ if at all.\n\n"
    },
    {
      "time": " 9.Sep.2005 12.57pm",
      "content": "Start that topic Norbert! I want to hear more about it.\n\n"
    },
    {
      "time": " 9.Sep.2005 2.07pm",
      "content": "How about classic avante garde? or even better, classic futurism :-)  \nOh God, it is oh so last year.\n\nChrisL\n\n"
    },
    {
      "time": " 9.Sep.2005 4.16pm",
      "content": "Limitation good… exclusion bad!  \nPretty good for an old guy. Goes in ‘best quotes from Typophile’.  \n——  \nI was born before Norbert, but I’m young!\n\n**I pretty much agree. Where do I sign up for the** Gerontophile **forums?**\n\nƒ\n\n"
    },
    {
      "time": " 9.Sep.2005 6.19pm",
      "content": "Someone told me where I could sign up for Gerontophile but at my age, I forget easily :-)\n\nChrisL\n\n"
    },
    {
      "time": " 10.Sep.2005 2.53am",
      "content": "Perhaps I’m just not cultured enough, but it looks to me like she’s not as good at what she does as she is at describing what she’s done, making up arty-sounding reasons for each aspect of whatever dull layered thing she threw together.\n\n“I needed to choose a typeface with ascenders and descenders for an undulating look.” Wow, now the type choice makes sense, because Helvetica has ascenders _and_ descenders. It’s perfect. Lucky that such a face existed, because you can’t get that rise-and-fall effect from, you know...Shotgun, for example. Next she’ll explain why it was so important that the book cover be rectangular. The parallel sides and four 90-degree corners, you see, symbolize structure.\n\n"
    },
    {
      "time": " 10.Sep.2005 7.16am",
      "content": "Brilliant\n\n"
    },
    {
      "time": " 10.Sep.2005 8.43am",
      "content": "ha! Cerulean! You slay me. Wonderful.\n\n:-)\n\n"
    },
    {
      "time": " 10.Sep.2005 9.07am",
      "content": "Let me quasi-quote.\n\nPart of a good designer’s job is to help the client to “see [invent] the problem” and articulate it with delineation of audience [the designer’s ego], purpose [get rich, fast], message [newspeak], and desired action [jump up and down].\n\nI’d say she’s pretty good.\n\n"
    },
    {
      "time": " 10.Sep.2005 10.10am",
      "content": "”...I’d say she’s pretty good....”\n\nLOL! Good one Sergei :-)\n\nChrisL\n\n"
    },
    {
      "time": " 11.Sep.2005 5.16am",
      "content": "I think type is many things. I also think people are of many minds. So, when you get many things and many minds on the open plains...you get many things on many people’s minds. Sometimes, they herd together and sometimes they wander off, and then there is all the stuff in between. Who is to say what’s good without a complete definition of WHAT the what is? E.G. “Is there such a thing as nonexpressive type?” , I should hope nearly all text types used for reading more than a few ppgs would be so...;)\n\n"
    },
    {
      "time": " 11.Sep.2005 11.13pm",
      "content": "While everybody’s got a right to their own opinion, I get a little bored with the I only use “these typefaces” kind of attitude that many so-called “great” designers say. I’m a designer as well and I find that to be a bit limiting and too “comfortable.” That’d be like Matisse saying, you know red and blue really work for me, so I don’t see any reason to use any other colors.\n\nOr more simply put, its like eating grilled cheese for dinner every night. I mean, I like grilled cheese, but DODGAMN! I’d put twelve gauge to my head before I’d eat it everyday!\n\n"
    },
    {
      "time": " 12.Sep.2005 4.21am",
      "content": " **What’s with this whole** Confederacy of the dunces **vibe?  \nSaying one typeface equals one expression is downgrading the potential of type. To explore that potential takes time, hard work and talent.**\n\nIf You’re looking for a working **metaphor involving Matisse let me tell You, it is not the amount of colours that will do the trick. Rather, take a look again at his paintings. How many different** styles **do You see?**\n\nƒ\n\n"
    },
    {
      "time": " 12.Sep.2005 6.59am",
      "content": "When Matisse was too ill to do anything else, he was limited to what his weary hands and a pair of scissors would allow. His color palette was only a few colors of stock paper. With these limitations, he made some very incredible work. The same man, in good health and with all the abilities intact, previously had also made some very incredible work using a full range of tools. A talented person can do fabulous work however he works. Once again, it is not the tools, it is the person using them who makes the difference.\n\nChrisL\n\n"
    },
    {
      "time": " 12.Sep.2005 10.02am",
      "content": "\\> Saying one typeface equals one expression  \n\\> is downgrading the potential of type.\n\n1) Nobody said that. Except maybe Tenazas, Vignelli, and others with blinders on, chasing a stale carrot.  \n2) That’s still not as bad as limiting expression outright.\n\nTerry, the Matisse metaphor is right on. I was actually thinking of comparing this to artificial and impoverishing limitations on color choice as well!\n\nChris, the implication of what you’re saying is that Tenazas is handicapped. I agree.\n\nSome of you continue to:  \n1) confuse talent/skill in one area with narrow-mindedness/lethargy in another.  \nAnd/Or  \n2) have an allergic reaction to dissent.\n\nhhp\n\n"
    },
    {
      "time": " 13.Sep.2005 10.36am",
      "content": " **Heh... The more the merrier. The more colours You use – the funnier. And better! It’s... kind of romantic. It’s the stuff You pave the road to hell with.**\n\nNot exactly sharing some esoteric information here, but limiting the palette is of course not limiting expression, quite the opposite.\n\nImagine Pere Mañach, Picasso’s art dealer in the early 1900:s. <cite> Mmmmkey Pablooo, I see. A bluey-dewey. The last one You showed me was, um, kinda blue. The one before was, well, also pretty blue. And the one before – Yeah – blue. Ever thought about using the full power of an unlimited palette? It would so much improve the power of your expression. At least add some green and orange and – ooh – I love California blue. AND maybe some... burgundy? Pleeease? They would sell like mad! Instead of these miserable malnourished monochrome clowns¿! Eh, I can’t wait for your rose period...</cite>\n\nƒ\n\n"
    },
    {
      "time": " 13.Sep.2005 10.49am",
      "content": "\\> It’s… kind of romantic.\n\nYes, romance is bad, bad - it does lead straight to hell.  \nMuch better to wear a straightjacket and put on blinders.  \nBoth black of course: having to choose an actual color  \nwhen getting dressed is way too stressful.\n\nWhat leads straight to hell (in fact it’s doing  \nit right now, globally) is the lust for Control.\n\n\\> limiting the palette is of course not limiting expression, quite the opposite.\n\nIt depends why you limit it (and noting here that the parallel between painting and typography can’t be taken very far). The evidence is that Tenazas, Vignelli and their ilk probably mostly do it for one reason: they simply can’t handle more.\n\nhhp\n\n"
    },
    {
      "time": " 13.Sep.2005 10.59am",
      "content": "Yes, Matisse (BTW- my personal hero)... yes, Picasso... and yes, Piet Mondiran for showing the unlimited potential of limitation.\n\nBut aahhhhh... [**Robert Motherwell**](http://web.archive.org/web/20081012032123/http:/www.guggenheimcollection.org/site/artist_work_lg_116_1.html)!  \nA chiro-notanic minimalist of monumental proportion.\n\nI loved him before I met him, and even more so afterwards. I had the pleasure of being his canvas stretching grunt for two consecutive summers while in college. And let me tell you, constructing and streching 8′ x 10′ canvases ain’t easy.\n\n——————————————————————————-  \nYes, I’m old, but the people I’ve met!\n\n"
    },
    {
      "time": " 13.Sep.2005 12.36pm",
      "content": "I so love Motherwell’s work! The trouble here is you hit on the “rainbow-everything-please” crouds worst nightmare—not only FEW colors but just BLACK!  \nNow if that Motherwell guy wasn’t such a wuss and could actually handle color, he could have been famous, even could have sold “Sofa-Sized” oils on TV!\n\nToo bad Ansel Adams was such a colorless guy too, he might have made it as a photographer.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Sep.2005 12.37pm",
      "content": "Come to think of it, most typography was just black too! Too bad.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Sep.2005 12.57pm",
      "content": "Typographer General’s Warning: Comparing Type and Art too closely is known to cause mental confusion and may complicate gestation of intelligent design.\n\n\\> most typography was just black too! Too bad.\n\nYou’re not kidding.  \nOnce typography truly grasps Gray Power, then it will mature.\n\nhhp\n\n"
    },
    {
      "time": " 13.Sep.2005 1.35pm",
      "content": "Hey... I think I qualify for Gray Power! though not quite mature.\n\nChris,  \nMotherwell was not adverse to using color, just not a whole lot at the same time:  \n [Blue Elergy](http://web.archive.org/web/20081012032123/http:/www.allposters.com/-sp/Blue-elegy-1981_i339356_.htm)  \n [Mexican Night](http://web.archive.org/web/20081012032123/http:/www.allposters.com/-sp/Mexican-night-1979_i339354_.htm)\n\n——————————————————————————————  \nYes, I’m not too old for the Gray Panthers!\n\n"
    },
    {
      "time": " 13.Sep.2005 2.02pm",
      "content": "“Motherwell was not adverse to using color, just not a whole lot at the same time”\n\nI know, and he used it well. I just think his black stuff was, well, ballsey :-)  \n [http://www.guggenheimcollection.org/site/artist\\_work\\_lg\\_116\\_1.html](http://web.archive.org/web/20081012032123/http:/www.guggenheimcollection.org/site/artist_work_lg_116_1.html \"http://www.guggenheimcollection.org/site/artist\\_work\\_lg\\_116\\_1.html\")\n\nChrisL\n\n"
    },
    {
      "time": " 13.Sep.2005 3.10pm",
      "content": "“I think that the less expressive a typeface is, the more creative a designer can be with it.”\n\n“He [Piet Zwart] said that the simpler and more geometric the character, the more useful he found it”—Lewis Blackwell, 20th Century Type.\n\nThis may be a slight diversion, but it always cracks me up when a designer puffs their chest and utters something as solemn as this, when a little bit of reading reaveals many similar utterances throughout history. Ah, the old guys…\n\n"
    },
    {
      "time": " 13.Sep.2005 3.24pm",
      "content": "but is there really such a thing as “nonexpressive type”? i mean even helvetica and futura have a lot of character that is their own.\n\n"
    },
    {
      "time": " 13.Sep.2005 3.47pm",
      "content": " **Take it from one who enjoyed a brief and not necessarily successful stint in amateur theater – If You have a strong concept, You don’t want the typeface – unless it’s a vital part of the Big Idea –** to steal the focus. **Therefore designers that are visually and conceptually talented but slightly typographically challenged tend to prefer the generic so-called less expressive typefaces (a mis-nomer, agreed, because there is no such blablabla). But it’s because they have stood the test of time and been used for so many different purposes, their shapes don’t exclude anyone. And it can still be really great communication art. Anyway, that’s my conclusion.  \nThat said, I’ve just looked at Lucille Tenazas things and couldn’t care much for it. Oh, well...**\n\nƒ\n\n"
    },
    {
      "time": " 13.Sep.2005 5.18pm",
      "content": "One mention of Matisse and look what I’ve done! Shame on me!\n\nI find a few of the older designers who like the tight grid structures (or grid structures that are repeated throughout much of their work) have this sort of idea. See: Massimo Vignelli and Willi Kunz.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI may be YOUNG, but I love OLD dead artists!\n\n"
    },
    {
      "time": " 13.Sep.2005 5.21pm",
      "content": "I’ll tell Willi next time I see him :-)\n\nChrisL\n\n"
    }
  ]
}
