{
  "id": "15047",
  "title": "Press Release: Ascender Corporation Expands Typographic Staff",
  "forum": "Home",
  "tags": [

  ],
  "content": " **PRESS RELEASE**  \nAscender Corporation Expands Typographic Staff\n\nELK GROVE VILLAGE, IL - September 8, 2005 - Ascender Corporation today announced the hiring of Jim Ford to its type design and development staff to address its growing customer base and workload.\n\n“Ascender creates very complex fonts for a wide variety of customers, for use in everything from multilingual corporate branding to small mobile phone screens,” said Ira Mirochnick, President of Ascender Corporation. “We were impressed with Jim’s design talents, technical skills and enthusiasm, as they are qualities that mesh with our type development team.”\n\nJim Ford is a recent Graphic Design graduate of Columbia College in Chicago, Illinois. He started the VersaType type foundry to publish his own fonts, and performed a variety of freelance design before coming to Ascender. “I am thrilled to join the Ascender team, as they have a well-earned reputation for creating some of the most popular fonts in use today” said Mr. Ford. “I love the design and technical challenges of producing typefaces and also that Ascender is involved with so many leading companies.”\n\nAbout Ascender Corporation  \nAscender Corporation is a provider of advanced font products specializing in font design, development and licensing. Ascender’s founders are font industry experts, and have been involved in developing some of the most important and influential fonts used in computers, phones and printers. Ascender provides multilingual, custom font development for enterprises and hardware & software developers. Ascender also provides high quality fonts for immediate download from the Ascender Font Store website. With a passion for type and typographic problem solving Ascender has extensive knowledge of font software engineering, Unicode® and world language support.\n\nContact:  \nBill Davis  \nAscender Corporation  \n25 Northwest Point Blvd, Suite 975  \nElk Grove Village, IL 60007 USA  \nPhone: (847) 357 0730 ext. 10  \nFax: (847) 357 0731  \n [http://www.ascendercorp.com](http://web.archive.org/web/20060329211820/http:/www.ascendercorp.com/)\n\nTrademarks: Ascender is a trademark of Ascender Corporation which may be registered in the US Patent and Trademark office and certain other jurisdictions.\n\n",
  "author": "Miss Tiffany : 8 September, 2005 - 9:30pm",
  "time": "",
  "uid": null,
  "comments": [

  ]
}
