{
  "id": "15054",
  "title": "Law Firm Logo - Student needs help/advice",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi guys.\n\nI have to design a logo and brochure for an law firm which practices in commercial law.\n\nIt has to represent confidence, professionalism, and quality.\n\nThese are the ideas I have produced so far.\n\n(the ones with the stars are the ones I like best)\n\nAny advice anyone culd give me would be appriciated. And I don't expect to have design made more me (i would hate that), but I would like some help on making an original and powerful logo.\n\nThank You :)\n\n| Attachment | Size |\n| --- | --- |\n| [logo roughs3..jpg](http://web.archive.org/web/20120226072559/http:/typophile.com/files/logo%20roughs3..jpg) | 72.65 KB |\n\n",
  "author": "<a href=\"/web/20120226072559/http://typophile.com/user/9184\" title=\"View user profile.\">3dsnail</a>",
  "time": "<br>",
  "uid": "9184",
  "comments": [
    {
      "time": "",
      "content": "Hmm… you haven't seem to have attached your image. If you click on the word \"edit\" above your post, you should be able to go back in and attach the file.\n\n"
    },
    {
      "time": "",
      "content": "ok, should work now. sorry about that folks\n\n"
    },
    {
      "time": "",
      "content": "It looks like you are going for a type treatment, but instead of playing with type variations, you're just randomly putting boxes and lines all over the place.\n\nGet rid of those for now, and focus on the type. See what you can come up with just with some different type treatments.\n\nAnd do NOT use a gavel or scales of justice...unless you want the logo to look like the logo that 90% of all legal related businesses have.\n\nAlso, what is SW and Computer Law?\n\n"
    },
    {
      "time": "",
      "content": "I would avoid using a typeface that doesn't have genuine small caps. I would also avoid making any play with © copyright symbols. At the moment I am drawn to the sans version (not that it particularly strong and the rule is out of position, but the perception that serif equals professional/quality need not be true). My first thought on the name is that it gives you the opportunity to work with it, using the white areas of type, embossing, for example which might be a direction worth exploring.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "You have the same problem most new designers have, you have to set tiered levels of importance to your graphic elements. What you have now doesn't communicate anything that is dominate or subordinate. I also agree SW and Computer Law needs explaination. Remember good communication isn't about design for design sake.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the comments. I am finding it ard to focus on what is being asked of me.  \nThe name of the company is White SW Computer Law.  \nI believe a modern font is the way to go, personally. But the ones I want to use you have to buy. Which I think isn't worth it if it's for school.  \nYou are right about the law icons I have been exploring with. It's cheesy. But I did want to explore other areas.  \nThe \"type treatment\" (i'm still not familiar with the lingo yet, so I hope I used it right) are basicly what other law firms have as thier logo.  \nAnd the boxes and lines serve a purpose, but I understand it may not communicate as well as I had hoped.  \nI would like to make something unqiue/original yet still communicate professional, confidence, and experience.  \nAny ideas of where to look for inspiration, or maybe a better way to think about the problem? I can tell right now I'm thinking inside the aquare.\n\nCheers\n\n"
    },
    {
      "time": "",
      "content": "I did a google search for White Computer Law which revealed [this](http://web.archive.org/web/20120226072559/http:/www.computerlaw.com.au/index.html), which is a clear indication as to why they need a new logo, or anything really. But it does indicate that you can drop the SW (which seems to stand for Steve White) so you are left with White, Computer Law with a clear hierarchy.  \nTo get out of the square think about what a logo should achieve. For example, you might believe its primary task is to differentiate/identify it from competitors. Therefore, looking at the competition is only a tool, you don't have a client to deal with (who may say \"we want a logo that looks like Browns Law Firm\" or that \"Times Roman is the only font we will use\"), so you have a free hand. White is the unique feature of the name, so you could think about white objects that communicate the qualities that you are after for example an egg or a square (these are instant subjective choices, yours might/should be better), or how to represent white using colours that you can print. You may decide that you only want a type treatment for the logo, but rather than just typing out different fonts try sketching layouts and then go through type catalogues to pick a font that has the qualities you want and will work well with your layout. It is sometimes difficult to sit in front of a computer and put down ideas quickly, erasing sections, re-drawing etc, the time lapse tends to slow your speed of thought. If when you have finished sketching and chosen a font that you really want to use you can always e-mail the foundry and ask if they can help you. Alternatively buying a font need not be a huge expense and if you have chosen well, you will use it more than once, think of it as an investment.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "WOW. I love you :)\n\nI think that is the perfect response. I have already read what you have said a few times so it sinks in. Theres a few really good hints there which I think I'll be using from now on. nad you helped push me in the right direction, I think.\n\nThank you, thank you, thank you so much timd.  \nI am very greatful. And thanks also for going to the trouble of checking out the site. I think thats very cool of you :)\n\nCheers, and Ill be adding my new designs once they're done\n\n"
    },
    {
      "time": "",
      "content": "Thank you,  \nGood luck with your project.  \nTim\n\n"
    }
  ]
}
