{
  "id": "15050",
  "title": "IRC CHATROOM about Fonts and Typography",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "IRC CHATROOM about Fonts, Type and Typography for Designers!\n\nJOIN US AT IRC EFNET SERVER #FONTS\n\nYou need an IRC Client then choose for example this servers:\n\nefnet.xs4all.nl  \nefnet.cs.hut.fi  \nany other efnet servers will work too!\n\nOur room is called:  \n#fonts\n\nSee you there maybe…\n\nBest,\n\nfonta\\_de\n\n",
  "author": "FONTA_DE",
  "time": "9 Sep 2005 — 5:00am",
  "uid": "9182",
  "comments": [
    {
      "time": "9 Sep 2005 — 5:37am",
      "content": "finaly :)\n\n"
    },
    {
      "time": "11 Sep 2005 — 6:28am",
      "content": "Great :)\n\n"
    },
    {
      "time": "28 Oct 2005 — 11:21am",
      "content": "I just went there but there's not much going on. Personally I don't see why a chatchannel is neccesary, but that's just my opinion. You never know who is hanging around there. My fear would be to get in contact with someone I can't verify in the right context.  \nI think Typophile is a good place to get to know the right people and than, if both see the need for it, exchange an ICQ, MSN, .MAC or any other account. With the right software you can than also join a multi-user conversation.\n\nBest regards,  \n®ené\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20150220004624/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*\n\n"
    },
    {
      "time": "4 Aug 2007 — 10:25am",
      "content": "Can anyone e-mail me a gillsans for PC please??\n\n"
    },
    {
      "time": "4 Aug 2007 — 10:38am",
      "content": "Strange thread to choose for this. Strange forum also, I guess.  \n: )  \nSince I'm sure you'd prefer a legal version, a set of Gill Sans (MT) has been bundled with MS Office for some time.\n\n"
    },
    {
      "time": "4 Aug 2007 — 3:04pm",
      "content": "_Can anyone e-mail me a gillsans for PC please?_\n\nSimo,\n\nAre you aware of the caliber of persons that are on this site? Many of them are professionals, and not just professionals -- but type designers, ex-typographers, designers, etc.\n\nWe have people here who make their livelihood from designing typefaces and/or setting type or designing layouts for clients. They have worked hard, and they own their own fonts. They have bought them and can use them for the necessary jobs in front of them.\n\nWhat you are asking someone here to do is abet you in stealing. I think not!\n\n"
    },
    {
      "time": "4 Aug 2007 — 3:31pm",
      "content": "Some one e-mail me some gold dubloons, and a parot, and some rum. For MAC. Please?\n\n"
    },
    {
      "time": "4 Aug 2007 — 8:43pm",
      "content": "efnet ... brings back memories. But like others, I don't see a real need for real-time chatting with the person who happens to be online at the time. I find threaded messages like this forum to meet my needs.\n\n"
    }
  ]
}
