{
  "id": "15066",
  "title": "Please, Your Opinions On Apparel Confection Company Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello, I’m new to Typophile, I’ve been reading this forum and found great comments and ideas, great professionals around. I would like to know if you could help me with some ideas about a logo I’m designing for a client.\n\nThe company name is “Neo Trends”, it’s the merge of 3 textile companies (all of them from Peru), the new company (also in Peru), is dedicated to making apparel for different clothing brands in Peru and USA markets.\n\nThe company now wants to expand its operations with the new brand, they are not a clothing brand, they make clothing for other brands (directly or via brokers), they need the logo to express they are a solid company, that they can fulfill and deliver on time, that their work is high quality and they are forward thinking.\n\nI have come with some initial ideas, some of them I like the most, some of them I just draw and after looking at them I thought “ouch, that’s ugly”, but I included them so I can get more feedback from the client (although I’m not sure this was a good idea after all, he has liked one of the ideas I hate :) )\n\nI’m also in a situation when the client thinks that he “will know which one is the correct logo once he sees it”, I’m worried about this because I could be making lots of logos until I get the “correct” logo, so far my client feedback hasn’t been so good, just comments like “I like # 5 but you could work more on it”, “# 7 is interesting”, very basic feedback as you see.\n\nA quick note: they make any kind of clothing, not only t-shirts, but t-shirts is a great part of their business.\n\nI would love to know your comments about dealing with undecided clients and what you think about these logo ideas:\n\n[logos v2](http://web.archive.org/web/20060524213155/http:/www.ventanazul.com/~clientsection/neotrends/neotrends/logos-5.gif)\n\n[logos v3](http://web.archive.org/web/20060524213155/http:/www.ventanazul.com/~clientsection/neotrends/neotrends/logos-6.gif)\n\n[logos v4](http://web.archive.org/web/20060524213155/http:/www.ventanazul.com/~clientsection/neotrends/neotrends/logos-7.gif)\n\n[logos v5](http://web.archive.org/web/20060524213155/http:/www.ventanazul.com/~clientsection/neotrends/neotrends/logos-8.gif)\n\n(I’m not including logos v1, they were very basic ideas and most of them were discarded by myself)\n\nThank you very much!\n\n",
  "author": "<a href=\"user/9134\" title=\"View user profile.\">alexis</a>",
  "time": "<br>",
  "uid": "9134",
  "comments": [
    {
      "time": " 9 September, 2005 - 5:34pm",
      "content": "Hi,\n\nI don’t design type or logos, but I am involved in aspects of cover design, so here’s my opinion:  \nI liked a couple of the ones in logos V3 — #2 and #4. I quite liked the triangle shape of #2 – to me it shows direction and stability. #4 reminds me of a needle and thread and also provides direction.\n\nI emphatically dislike the arched dotted lines in logos V4.\n\nSeveral in logos V5 I liked: #3, 6, 7. Numbers 6 and 7 make me think of a bolt of fabric, and also show direction and movement. The angle or skew on #1 and 2 of V5 don’t seem as effective, and overall I think I wouldn’t separate “neo” from “trends”…  \nSo, I’m voting for #2 in V3 or #6 or 7 in V5.\n\nKristina\n\n"
    },
    {
      "time": " 9 September, 2005 - 9:12pm",
      "content": "Hi Kristina, thank you very much for your very helpful comments.\n\nI agree the words “neo” and “trends” work better together, the company name uses an space between them and I’m not quite sure as to how treat them in the logo, in some versions I put the words together and used bold or other value for “neo” but I’m not sure if that allows the viewer to recognize an space. I’m open to any suggestion about that point.\n\nI do like the triangle shape but I’m not sure how to relate it to the logo brief, or could I be so abstract and just focus in direction and stability?\n\nDirection is a very important part of this design, Neo Trends, as I said before, has put together 3 companies and they intend to enter new markets and use new strategies to grow their business, they are taking a new direction indeed.\n\nThis business depends a lot in delivery times, if some brand needs to launch their summer season on a particular date the company in charge of making the clothing must be able to deliver on time and with good quality, trust is also very important and the logo should present a reliable company.\n\nI’m not an expert in type, my focus is in web oriented design, so I would love to know (besides your opinions about the logos) what you think about my font selections or if you would suggest any other fonts.\n\nThank you very much for your help.\n\nAlexis Bellido\n\n"
    },
    {
      "time": " 9 September, 2005 - 11:27pm",
      "content": "Hey, i like some of your logos. Im a student so I wont bother to say which ones. Just an idea, but you may want to look at scissors or a needle, measuring tape (or whateva its called). Personally I think the equipment would reflect the job that they do.  \nJust an idea…\n\nCheers\n\n"
    },
    {
      "time": " 10 September, 2005 - 4:56am",
      "content": "I like the logos in v5 best, especially #6. In #7, ‘trends’ is too close to the nice fibers/threads for my taste. Also, if you put the two words into two lines, I am not sure if alignment to the right is the best option (at least if you use an italic or slanted typeface, where the combination of ‘o’ and ‘s’ at the ends of the lines makes the logo look as if it would tilt to the right in the next second).  \nJust another thought: Perhaps you could extend the fibers part on the left to give it more direction and to include a triangular shape symbolizing the 3 companies?\n\n"
    },
    {
      "time": " 10 September, 2005 - 9:41am",
      "content": "I like V7 #3 and #4.\n\nFor V7 #3, I like how everything is contained in a black shape. It feesls stable and complete. But I think that the dashed line (I am guessing that it’s stitching) should be closer to “neo trends.” In #3, it’s way too far away, and looks as if it wants to escape. It should be closer, like it is in #4.\n\nI very much like V8 #7. The waves look like fabric, texture, fibers, and move in unison. It feels approachable and still pretty stable. Go with the logo that’s all black. #8, where it’s grey and black is too much.\n\n"
    },
    {
      "time": " 10 September, 2005 - 1:45pm",
      "content": "Hi, thank you for your replies, I’m also liking the v5 #6 anf #7 ideas.\n\nI would like to get some more feedback from other members and then I will talk to my client.\n\nWhat do you think about the undecided client issue?, the problem of “I will know the logo I like when I see it”, to give you some idea, one of the ideas the client liked most was v3 #5 which I really think I didn’t have to include, I don’t see any meaning on it.\n\nRegards!\n\nAlexis Bellido\n\n"
    },
    {
      "time": " 10 September, 2005 - 5:22pm",
      "content": "Hmm, just thinking about your client situation…\n\nSometimes I put myself into trouble by showing a client too many versions. They don’t know what to choose!\n\nEven though your client claims that he will “know it when he sees it,” I feel as if that is just a thinly veiled way of saying “I don’t know what I want.”\n\nWhen clients are undecided, they sometimes have a tendency of doing the mix-and-match with your versions. You know, they want you to use this part of V1, that part of V3, and combine with V8—totally destroying your concepts.\n\nIf you are still having trouble with a pesky client, perhaps show them one or two and revise as needed.\n\n"
    },
    {
      "time": " 10 September, 2005 - 6:08pm",
      "content": "I’d say the most interesting are in v5. However, I think the shape is hindering the organic nature of what could potentially become your logomark.\n\nI would explore the movement of shapes you have more. Forget about the type, for now, and explore. Keep textiles and fabrics in your mind as you do. The way a fabric drapes or a weave catches light.\n\nOnce you have some solid textile studies — what I see them as — you can then consider how type should or shouldn’t interact with it.\n\nI like v5-2 — the textile study — the mostl.\n\n"
    },
    {
      "time": " 11 September, 2005 - 3:23am",
      "content": "You mention the three into one which may be combined with the textile/weaving images that could be refined into a distinctive image, bearing in mind the [woolmark](http://web.archive.org/web/20060524213155/http:/www.mlm.com.au/work/miniwoolmark/index.html) logo as a direction to be avoided.  \nThe problem with a client who ‘knows what they want when they see it’ is a situation that may be resolved by showing/verbalising a single (not necessarily resolved) concept.  \nIt is often the case that a client cannot visualise a concept even when presented by runouts, so if you reinforce your presentation with a paragraph or two explaining your thinking and show their logo in use on stationery, packaging, vans, clothing (if applicable) etc. Help the client become confident about the logo.  \nTim\n\n"
    },
    {
      "time": " 11 September, 2005 - 4:34am",
      "content": "What will help you with direction is look at the end use of the logo, labels, signage even print applications. As yourself how will it be used will it be stiched into clothing or only screened on labels. End use will dictate how intricate or simple your mark will have to be. One company I’ve delt with as a customer Is Road Runners Sport. In the beginning they had the full name and a bird (Road Runner) as their mark. Over time they have dropped the bird logo and the full name and are now RRS and sometimes a big R with Road KOed out of it with Runner below it.\n\n"
    },
    {
      "time": " 11 September, 2005 - 9:53am",
      "content": "Hello everybody, thanks for your comments, great ideas.\n\nI will study some fabric photos to see how I can play with that concept further.\n\nI will also prepare a revision including just the 3 or 4 ideas you have helped me to find and will show to the client.\n\nIf you have any other suggestion I will be glad to know about it.\n\nHave a great day!\n\nAlexis Bellido\n\n"
    },
    {
      "time": " 11 September, 2005 - 6:37pm",
      "content": "please dont use scissors or measuring tape. Too obvious…\n\n"
    },
    {
      "time": " 11 September, 2005 - 10:41pm",
      "content": "I agree that you should do away with the typography for now.  \nBy settling on it early, you have put a constraintive and limiting element into all the concepts.\n\nAnd as someone else mentioned, don’t show too many versions to the client - especially the ones you couldn’t bear to have to work up into final treatments. Pick three that you can “defend” with a thorough rationale that describes why they are the best solutions.\n\ngood luck\n\npd\n\n"
    }
  ]
}
