{
  "id": "1506",
  "title": "The 27th Letter",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hi,   \n   \nI am new to this board.. well posting wise.. (my first post!) but i've been reading it alot over the past few months.   \n   \nanyways,   \n   \n   \n   \ncurrently im taking typography 1 at my college. its alot of fun, our current project is to design a 27th letter of the alphabet using a provided face. of all faces I was given times new roman! haha! anyways, I wanted to see what people thought about this, or any suggestions. I am still learning about type, and i figured this place could help me out. we have to render these in ink at 2.5 x height, 5 times, replacing the created character with a letter in a 5 letter word.   \n   \nmy current concerns pertain to the descender on my letter. should it be the same distance down as the 'j' ? or should it be smaller? personal preference? i was looking at the face, and i guess i could argue that it was meant to be a unique form in the alphabet like the loop on the 'g' my professor brought this up in critique tonight.   \n ![Kerned example](http://web.archive.org/web/20131106064838im_/http:/www.typophile.com/forums/messages/29/17783.gif)   \n   \nThanks!\n\n",
  "author": "drewheffron",
  "time": "2 Oct 2003 — 11:09pm",
  "uid": "2403",
  "comments": [
    {
      "time": "3 Oct 2003 — 9:41am",
      "content": "Hi Drew,   \n   \nLet me be honest. I think the length of your decender is the   \nleast of your problems! Sorry...   \n   \nAs a start at curing your letter of it's maladies, let me point   \nyou to Jonathan Hoefler's course at typeophile that looks at   \nthe very assignment you've got: [Type Design 110](http://web.archive.org/web/20131106064838/http:/typophile.com/courses.html)   \n   \nHonestly, first check out what he's saying. What are the   \ncharacteristics of times roman? Given that, is the basic   \nstucture of the \"letter\" consistent with Times? How could it   \nbe more Times-like in structure? Where is there evidence of   \na pen? What angle is it held at? As a result, where are the   \nthick parts? Where are the thin parts? Where are the serifs?   \nWhere does times roman break it's own rules?   \n   \nYour glyph needs all these questions to be asked. Take a   \nlook, and if you're still at a loss, I'll give you more specific,   \npractical pointers.   \n   \nLooking forward to seeing the fruit of your studies!\n\n"
    }
  ]
}
