{
  "id": "15109",
  "title": "Self-Identity",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Howdy,\n\nAfter much sketching, doodling and mucking about, I’ve narrowed down my pesonal logo to two options. I’d really appreciate it if I could get your opinions on em!\n\nFYI: I’m a graphic design student, graduating this semester. This ID will be on my business cards and resume until I’m gainfully employed - and those items will be designed around whatever logo I go with. Keep in mind these are preliminary computer comps and the colors are (somewhat) arbitrary at this point.\n\nMy own personal thoughts, : I like the top one a lot but fear it may not seem very exciting; and I also worry if everyone will read it correctly. The second one I like; but, fear it may be too whimsicle and gimmicky.\n\nShare your thoughts – good, bad, or ugly.\n\nCheers!\n\n| Attachment | Size |\n| --- | --- |\n| [File](http://web.archive.org/web/20080118114705/http:/typophile.com/files/drupal_42) | 45.67 KB |\n| [CB\\_s2.jpg](http://web.archive.org/web/20080118114705/http:/typophile.com/files/CB_s2.jpg) | 19.02 KB |\n| [CB\\_s4.jpg](http://web.archive.org/web/20080118114705/http:/typophile.com/files/CB_s4.jpg) | 58.18 KB |\n\n [‹ Logo for a house mucis organization](http://web.archive.org/web/20080118114705/http:/www.typophile.com/node/15190 \"Go to previous forum topic\") [Techno/House club logo ›](http://web.archive.org/web/20080118114705/http:/www.typophile.com/node/15099 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080118114705/http://www.typophile.com/user/7357\" title=\"View user profile.\">chadbrewer</a>",
  "time": "<br>",
  "uid": "7357",
  "comments": [
    {
      "time": " 13.Sep.2005 10.45am",
      "content": "I see the second as a warning sign, spectacles ahead, kissing snakes, (mainly because of the yellow diamond, I think), while the first has potential, it needs some work to it. Trying a B with uneven bowls might work and trying to get the shapes at top and bottom of the B to relate as serifs to the C or try a ball terminal on the C, the counter also needs work. I think it does read fairly instantly and it is a mark that is going to appear with your name, as to whether it is exciting, does it need to be? More important that it is well created and shows a good appreciation of letterforms, after all you are not going to need to use it for long, hopefully.  \nGood luck on the job seeking.  \nTim\n\n"
    },
    {
      "time": " 13.Sep.2005 5.09pm",
      "content": "I was no longer able to view the jpeg I had attached, so I attached another - don’t know if others were having the same problem.\n\nSo click on the bottom link (I couldn’t get the first one to delete)\n\n"
    },
    {
      "time": " 13.Sep.2005 5.13pm",
      "content": "Thanks for the feedback Tim. The second one was intended to look like a road sign. That’s cool that you saw so many other things in it.\n\nI could play around with the first one a bit, based on your suggestions, just one question: what do you mean by “the counter needs work”? Since, in the logo the entire letter “C” is the counter...\n\nCheers!\n\n"
    },
    {
      "time": " 13.Sep.2005 5.17pm",
      "content": "Chad, are you seeing the original JPG as being a black box? That is what I am getting, and have run into this in a couple of other threads. Seem to be some strange bug, we are looking into it. I imagine you also didn’t name the file “drupal?”\n\n"
    },
    {
      "time": " 13.Sep.2005 5.25pm",
      "content": "I was getting an error message, and no- it wasn’t named drupal.\n\nI exported the jpg from Illustrator - if that has anything to do with it… that particular feature never seems to work right.\n\n"
    },
    {
      "time": " 13.Sep.2005 5.28pm",
      "content": "Stephen mentioned in another thread that it could be perhaps due to the file being in CMYK.\n\n"
    },
    {
      "time": " 13.Sep.2005 7.09pm",
      "content": "just a word of advice...i’m always very dismissive of resume’s, letterhead and business cards that bear the mark of the person. 95% of other designers i work/worked with feel the same way. why? i think it’s usually because they are bad and due to the fact they are poorly designed and not well thought out, it shows even more the designer is unfamiliar with symbols, shapes and letterforms. these are usually two letters of someone’s name combined in some juxtaposed way creating one unified shape. i’d much much much rather see time and effort put into organizing information well on a page such as your letterhead and/or business card than a symbol that is usually non-representative of you as a person or you as a designer.\n\nto sum up your design skills, your talent, your past 2 or 4 years and your personality into one mark is a tough job. coming from someone who sees portfolios and resumes on a semi-frequent basis, stick to your design of your collateral. leave the identity branding to the corporations and let your design skills represent you.\n\nmy 2 cents...if you really want some feedback on what youve posted, let me know via email or a post here and i’ll help out where i can. i would just recommend staying away from this route\n\nw|m\n\n"
    },
    {
      "time": " 14.Sep.2005 2.09am",
      "content": "\\>just one question: what do you mean by “the counter needs work”? Since, in the logo the entire letter “C” is the counter…\n\nYes, that could have done with more explanation I mean the open counter of the C especially on the left looks cramped, either extending it left beyond the B or taking the right hand of the C further right into the B might be a solution.\n\nWill makes a good point about the quality having to be tip top and the layout will have to reflect that otherwise the reader will get a bad first impression.\n\nTim\n\n"
    },
    {
      "time": " 14.Sep.2005 4.06am",
      "content": "The bottom one reads ab or qb not cb\n\n"
    },
    {
      "time": " 16.Sep.2005 10.37am",
      "content": "will miller - just had this conversation on another forum, on another site, where everyone who had ever been in a position to hire designers agreed completely.\n\nset your name in a nice clean face, and lay everything else out expertly. even if you are going for a job in the xtreme sports industry.\n\n"
    },
    {
      "time": " 16.Sep.2005 6.42pm",
      "content": "Do you have a link to that conversation? I’m feeling pretty conflicted on this now...\n\nI updated a few variations for anyone who’s interested. I personally like the bottom left one the best.\n\nCheers!\n\n"
    },
    {
      "time": " 17.Sep.2005 4.14am",
      "content": "New ones read better I like the upper right version, but tweek the size of the C. It may be perfect but take a look at making it smaller.\n\n"
    },
    {
      "time": " 18.Sep.2005 2.04am",
      "content": "The lower two are beginning to dilute the letter shapes, I would concentrate on the upper versions, at the moment the C seems better drawn than the B which reduces the overall effectiveness of the logo.  \nTim\n\n"
    },
    {
      "time": " 21.Sep.2005 12.54pm",
      "content": "thanks all for the feedback! I’m going to scrap the self-id, and concentrate on a nicely designed resume/business card.\n\nI recently looked through a ton of previous grads’ resumes; and I can see what you mean.\n\nCheers!\n\n"
    }
  ]
}
