{
  "id": "15101",
  "title": "Typographic Painting",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "Here is my first typographic painting.\n\n-Spraypaint and acrylic on canvas (9” x 12”).\n\n| Attachment | Size |\n| --- | --- |\n| [File](http://web.archive.org/web/20090724092537/http:/typophile.com/files/drupal_41) | 153.57 KB |\n\n",
  "author": "<a href=\"/web/20090724092537/http://typophile.com/user/7350\" title=\"View user profile.\">Jason Alejandro</a>",
  "time": "<br>",
  "uid": "7350",
  "comments": [
    {
      "time": " 12.Sep.2005 10.10am",
      "content": "Tasteful, nice.\n\nhhp\n\n"
    },
    {
      "time": " 12.Sep.2005 10.52am",
      "content": "Thanks hrant...actually, it’s my first painting, ever.\n\nBy the way, i’m using your metagram in testing my first type design.\n\n"
    },
    {
      "time": " 13.Sep.2005 12.15pm",
      "content": "um...you can let me know what you think. Please.\n\n"
    },
    {
      "time": " 13.Sep.2005 12.54pm",
      "content": "I think it’s simple and boring.\n\n"
    },
    {
      "time": " 13.Sep.2005 1.03pm",
      "content": "Jason could you try another painting using ink on rice paper. Chinese/Japanese calligraphy is outrageous. You have to balance the speed of the strokes and the dryness/wetness of the brush. Plus you have to lift the brush off the paper after a stroke. Its much more diffucult than acrylics and will teach you much more about how a character is formed.\n\n"
    },
    {
      "time": " 13.Sep.2005 9.07pm",
      "content": "Dan, thanks for the suggestion. What type of ink would be preferable?\n\n"
    },
    {
      "time": " 13.Sep.2005 9.13pm",
      "content": "\\> will teach you much more about how a character is formed.\n\nHow it **used to be** formed. I like Eastern calligraphy too, but I think Jason  \nis on a more rarified -hence more interesting- path: <cite>typographic</cite> painting.  \nThe sort of art a type person would relish/buy.\n\nhhp\n\n"
    },
    {
      "time": " 13.Sep.2005 9.13pm",
      "content": "sergej, is there someway it can become more appealing, maybe even exciting?\n\n"
    },
    {
      "time": " 14.Sep.2005 10.29am",
      "content": "Hi Jason. It’s hard to tell exactly what’s going on with the surface of your painting, but you might try the following:\n\nActually paint the white. It looks like a white canvas with a black fleuron. In painting, it’s important to spend as much time on the background as the foreground. The edge of the fleuron should be made by an actual edge between the figure and ground, where black paint meets white. Not by black paint on top of white. Franz Klein was great at this sort of thing. This might speak to Hrant’s concept of ’notan’ even. Or, perhaps, Noordzij’s ’front’.\n\nFrom the photo, it looks like the typography (the _what_) is winning our over the painting (the _how_). Seems like there should be more of a balance between the two. This could be due in part to the spray paint, which is rather dead and doesn’t make for a very painterly surface.\n\nYou might try to mix your black instead of using black out of the tube. Pthalo blue and Alizarin crimson make a nice ’black’. Really it’s a deep transparent purple, but you can layer it into a very rich black. Also, Payne’s Grey mixed with similarly deep hues can make a decent black. Same goes for white. Don’t use Titanium white from the tube — throw some Ochre into it (just a bit) or it’ll always be chalky and cold.\n\nMake it bigger if possible. The gesture of the fleuron will probably be enormously helped by a larger scale.\n\nI hate to tell people to look at this and that painter, but you might be interested in the work of Christopher Wool.\n\nCheers.\n\n"
    },
    {
      "time": " 14.Sep.2005 1.19pm",
      "content": "Jason if you want to try ink painting using rice paper try Indian Ink (Black)\n\n"
    },
    {
      "time": " 14.Sep.2005 1.54pm",
      "content": "\\> try Indian Ink (Black)\n\n....without shellac.\n\nIndia Inks are composed of carbon black particels for rich, dark color, water and latex or shellac for a binder.\n\nShellac can ruin your nib/brush — if you don’t wash it right away with warm water. But really wash!\n\n"
    },
    {
      "time": " 14.Sep.2005 2.22pm",
      "content": "In a word, no.\n\nThat shouldn’t stop you, though. You could, for instance, make it an exercise doing a whole series and placing the pictures into frames. What happens if you invert the colours?\n\n"
    },
    {
      "time": " 14.Sep.2005 3.48pm",
      "content": "I am trying to find online samples of Hermann Zapf’s paintings, his series of Magic Squares and quotations of Lao-Tzu and Plato for your viewing pleasure.\n\nHere are several images from [_The Alphabet As Art_](http://web.archive.org/web/20090724092537/http:/www.uml.edu/Dept/Art/exhibits/alphagallery.html) exhibit, 2003 at University of Massachusetts, Lowell.\n\nTim Girvin’s [_Alphabetica_](http://web.archive.org/web/20090724092537/http:/www.girvin.com/spot/index.htm#) (scroll down to bottom of page then launch link)\n\nHere is Thomas Ingmire’s [_Gallery_](http://web.archive.org/web/20090724092537/http:/www.thomasingmire.com/gallery/index.html) of art inspired by letterforms.\n\n"
    },
    {
      "time": " 14.Sep.2005 3.55pm",
      "content": "I know this as all photography, so not directly related, but I though I would share anyway.\n\n[http://www.pbase.com/abbarich/the\\_alphabet](http://web.archive.org/web/20090724092537/http:/www.pbase.com/abbarich/the_alphabet \"http://www.pbase.com/abbarich/the\\_alphabet\")  \n [http://www.pbase.com/abbarich/coloured\\_alphabet](http://web.archive.org/web/20090724092537/http:/www.pbase.com/abbarich/coloured_alphabet \"http://www.pbase.com/abbarich/coloured\\_alphabet\")\n\n"
    },
    {
      "time": " 14.Sep.2005 9.06pm",
      "content": "Are you projecting the form and painting it from a projection or are you drawing the form first? Is it based on a specimen you have from someplace?\n\nI think it could be much more interesting if it weren’t a fleuron, but that’s just me.\n\n"
    },
    {
      "time": " 14.Sep.2005 9.17pm",
      "content": "I was thinking that the ultimate typographic painting would be  \nof a serif (but not one of those prissy asymmetrical ones please).\n\nhhp\n\n"
    },
    {
      "time": " 15.Sep.2005 9.10am",
      "content": "\\> _the ultimate typographic painting would be of a serif_\n\nActually, Hrant, that would be more of an ultimate _type design_ painting because it focuses on a particular aspect of a character — a detail.\n\nFor me, a [typographic painting](http://web.archive.org/web/20090724092537/http:/www.nga.gov/feature/pollock/painting1.shtm) would encompass contrast, balance, juxtaposition of minute repetitive elements within the confines of the canvas or page size. IMHO you need not recognize minutia since it is the overall affect that is critical.\n\n"
    },
    {
      "time": " 15.Sep.2005 9.16am",
      "content": "I see your point. Although I’m sure you agree that “minutia” such  \nas serifs certainly do help determine “overall effect” in a huge way.  \nI guess they’re like ants: one goes unnoticed, but generally they’re  \npresent in one place in the thousands and can ruin a Bauhaus picnic! :-)\n\nhhp\n\n"
    },
    {
      "time": " 15.Sep.2005 9.38am",
      "content": "Yes, I agree with you... to the typographer, minutia is critical to the overall affect. To the average reader it is (or should be) invisible.\n\nThat’s why we wrestle over not only WHAT face to use, but WHICH vendor’s cut suits the purpose best. You know, the micro-infinitesimal differences that typophiles argue over.\n\n"
    },
    {
      "time": " 15.Sep.2005 12.32pm",
      "content": "I do plan to use letters and parts of letters for my final work(s). The fleuron was really more exploratory since I’m not sure what mediums to use yet and also because I’ve never painted before. Also, I do intend to make the scale quite larger.\n\n"
    },
    {
      "time": " 15.Sep.2005 2.24pm",
      "content": "Hey, just have fun with it and show us the results. =)\n\n"
    },
    {
      "time": " 18.Oct.2005 2.48pm",
      "content": "Adding to Nathan Matteson’s suggestion to really make this as much about the _painting_ as the subject, I enthusiastically point you toward one of my favorite artists — Ed Ruscha.\n\n[http://www.beatmuseum.org/ruscha/edruscha.html](http://web.archive.org/web/20090724092537/http:/www.beatmuseum.org/ruscha/edruscha.html \"http://www.beatmuseum.org/ruscha/edruscha.html\")\n\n[http://www.nga.gov/feature/ruscha/ruscha01.htm](http://web.archive.org/web/20090724092537/http:/www.nga.gov/feature/ruscha/ruscha01.htm \"http://www.nga.gov/feature/ruscha/ruscha01.htm\")\n\n[http://www.tfaoi.com/aa/2aa/2aa51.htm](http://web.archive.org/web/20090724092537/http:/www.tfaoi.com/aa/2aa/2aa51.htm \"http://www.tfaoi.com/aa/2aa/2aa51.htm\")\n\n[http://www.barbarakrakowgallery.com/contentmgr/showdetails.php/id/352](http://web.archive.org/web/20090724092537/http:/www.barbarakrakowgallery.com/contentmgr/showdetails.php/id/352 \"http://www.barbarakrakowgallery.com/contentmgr/showdetails.php/id/352\")\n\n[http://www.artnet.com/artist/553156/FineArtThumbnails.asp](http://web.archive.org/web/20090724092537/http:/www.artnet.com/artist/553156/FineArtThumbnails.asp \"http://www.artnet.com/artist/553156/FineArtThumbnails.asp\")\n\nA simple Google Image search yields good results, also.\n\nHard to tell on some of these thumbnails, but in person his works are quite engaging in their surface and technique (not all are painted — some are prints).\n\nGranted, your intent appears to be different than Ruscha’s, but it’s still an excellent point of reference.\n\n"
    }
  ]
}
