{
  "id": "15123",
  "title": "Ragged-right on 8.5x11; to indent or leave extra leading?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Greetings, everyone.\n\nI have been lurking around Typophile for quite some time.\n\nA number of you seem enlightened when it comes to typography, not just font design. I’ve read some interesting (often quite heated) discussions.\n\nMy question has to do with paragraphs that occur in essays and reports on an 8.5x11 page. My right and left margins are 1.55 inches, top and bottom are an inch. Font is 11 pt. Palatino (Adobe’s Palatino LTstd.) Leading is fixed at 16 points. Indent is 18 points (should be 16, but I prefer a little more emphasis.) Line length is 12-13 words (less than 6 inches.) Text is ranged left, ragged right (I find justified text abhorrent.) Gentle hyphenation where necessary. There’s nothing like a soft, soothing rag!\n\nSo, would it be better to indent paragraphs, or simply leave a white space between paragraphs, calculated at half the leading (8 points or so)? I’ve always gone for the “block paragraph” look, but recently I’ve gotten the impression that it is poor form. I’m willing to change in the name of correct typography.\n\nI’d appreciate any advice.\n\n [‹ Meaning of Eurofurence font](http://web.archive.org/web/20071121084326/http:/www.typophile.com/node/15308 \"Go to previous forum topic\") [How to make small caps in FontLab? ›](http://web.archive.org/web/20071121084326/http:/www.typophile.com/node/14228 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071121084326/http://www.typophile.com/user/9249\" title=\"View user profile.\">Palatine</a>",
  "time": "<br>",
  "uid": "9249",
  "comments": [
    {
      "time": " 14.Sep.2005 8.00am",
      "content": "Maybe this should be moved into Design?\n\n"
    },
    {
      "time": " 14.Sep.2005 8.33am",
      "content": "According to Bringhurst, Elements of Typographic Style, the ideal line length (measure) is 66 lower case characters—2 1/2 lower case alphabets. The big problem with letter sized paper is that usually the measure is too long, as it sounds like it is in your case. A line over 75 or 80 characters is not good for continuous reading, even with additional leading, as you have done.\n\nI think this is an extremely important feature of readable typography. Check on this and fix it if need be.\n\n"
    },
    {
      "time": " 14.Sep.2005 8.41am",
      "content": "you can always move your own posts around if you edit your initial post and select a different topic area and save the changes. i’ll move this for you this time, tho.\n\n"
    },
    {
      "time": " 14.Sep.2005 9.27am",
      "content": "Thanks Paul, I appreciate it!\n\nWilliam:\n\nI’ll fix it, thank you. Does the characters per line measure include blank spaces (spaces between words)?\n\nWhat about indenting vs. leading to indicate a new paragraph?\n\n"
    },
    {
      "time": " 14.Sep.2005 9.48am",
      "content": "There is no rule on indenting vs space between paragraphs. One way of dealing with the excessive measure is to have a wide left margin and put subheads in it. Another is to have two columns. Whatever you do will affect your decision on indents.\n\nThe most important first question is who is the audience, and what do you want to accomplish. If this is school reports, then the main thing will be to relate to teacher’s expectations or requirments. If it is published, it depends on the material and the readership. The goal of the work takes the lead in determining typography.\n\nIf you haven’t read Bringhurst, do get a copy. It will give you an immense amount of useful information.\n\n"
    },
    {
      "time": " 14.Sep.2005 10.33am",
      "content": "It’s a formal historical essay. Formatting requirements are fairly flexible, so I’m free to experiment, within reason.\n\nMargins, left and right, are now 1.75 inches, so lines are now 5 inches wide or so. There is an improvement in readability, certainly, but the way the text sits looks a bit odd with those generous margins. Perhaps the body text looks to long now because top and bottom margins are still one inch.\n\nStill, it reads faster. The rag makes it warmer and more inviting, too.\n\nThank you kindly for your help so far.  \nI just placed an order for Bringhurst’s book at my local bookstore. I look forward to reading it. Typophiles are raving about it.\n\n"
    },
    {
      "time": " 14.Sep.2005 7.48pm",
      "content": "If your measure is too long you can also step up your typesize a bit or use a wider font.\n\nIf your measure is long you need to increase your leading to assist the reader in locating the beginning of the next line.\n\nFor continuous formal text in a traditional vein, I think paragraph indents are better. Block paragraphs slow down the flow a bit because each one is more of a new beginning.\n\n"
    },
    {
      "time": " 14.Sep.2005 9.40pm",
      "content": "Palatine, don’t be afraid of wide margins, they usually make type easier to read. Try having a widest right margin, this will give your letter page more balance.\n\nBlock paragraphs suit best in a text where there is going to be analysis of the parts of a text or where you need a clear segmentation o where only parts of the text are going to be read.\n\nHéctor\n\n"
    },
    {
      "time": " 15.Sep.2005 5.18am",
      "content": "Thank you for the replies.\n\nIndeed, the wide margins make the text more readable, inviting, and allows it to “breathe.”\n\nBy increasing the bottom margin a bit, the body text looks less narrow and more balanced.\n\n"
    },
    {
      "time": " 15.Sep.2005 1.08pm",
      "content": "I have never been a fan of indented paragraphs. They’re outdated, in my opinion, and were only really necessary on manual typewriters. Working digitally, we have so many more beautiful options at our disposal to signify paragraph breaks.\n\n"
    },
    {
      "time": " 15.Sep.2005 2.00pm",
      "content": "Chuck, what are these beautiful options at your disposal? Going back to the original topic, this is for essays and reports, so interesting arty bits might distract the reader from the important content.\n\n"
    },
    {
      "time": " 15.Sep.2005 2.17pm",
      "content": "\\>were only really necessary on manual typewriters.\n\nNo. Indented paragraphs are very old, long before the typewriter. They are an excellent way to mark paragraphs, and in my opinion you should only depart from this standard when you have a good reason to. The standard indents are, according to Bringhurst, one en, one em and one ’lead’ meaning that if the text is 10/12 the indent is 12 points.\n\nBringhurst notes that spaces between paragraphs are standard in business letters, and can be OK in short business materials because they suggest “precision crispness and speed. ...In longer sequences, they may seem soulless and uninviting.”\n\n"
    },
    {
      "time": " 15.Sep.2005 3.26pm",
      "content": "Yes, I’ve seen that indent rule: indent matches the leading.\n\nJan Tschichold, Bringhurst, and I think even Eric Gill are all in favour of it.\n\nIt’s intersting that an indent of that length doesn’t really stand out on the page. Sure, you know it’s there, but it doesn’t draw the eye to it. In fact, if the last line of the paragraph runs to nearly the full measure, you might miss the indent at first glance, until of course your eyes get there during the course of reading. It’s a very unobtrusive way to signal a new paragraph.\n\nPerhaps some people simply prefer the clarity and crispness of block paragraphs. Eah paragraph is a separate, logical unit. I find that block paragraphs that are separated by half the leading and no more are more pleasing.\n\nStill, I’m beginning to feel that indenting is a warmer and more inviting method. This time, the margins and comfortable leading provide the breathing room, and not the white space between paragraphs. Although one usually ends up with some white space anyway, since the last line of a paragraph doesn’t usually run the full measure.\n\n"
    },
    {
      "time": " 15.Sep.2005 4.53pm",
      "content": "\\> Indented paragraphs are very old, long before the typewriter.\n\nBut you’re glossing over the fact their genesis was in fact a “mistake”! They were empty spaces reserved for rubrication/illuimination, but often left unused (sometimes because of deadlines, sometimes because of different[ly priced] editions). That said, I do agree they’re less bad than flush paragraphs; you’d have to have a particularly nasty strain of the Modernism virus to prefer <cite>that</cite>.\n\n—\n\n“More beautiful option”? Well, yes, although nothing to do with digital: the portly but practical Pilcrow! And what’s really nice about it is that you can use it right in the middle of a “physical” paragraph block to mark a separate “conceptual” paragraph (like on my site), often saving space and gaining elegance.\n\nhhp\n\n"
    },
    {
      "time": " 16.Sep.2005 6.41am",
      "content": "I prefer the indented paragraph as well (not the first in a chapter/section). I would suggest that an em is too narrow an indent for your measure. I understand your abhorrence of justified text but an indented first line which falls short could look weak or centred, I believe that in order for your text to be a familiar experience\\* to the audience you might need to look at justified. Pilcrows in flowing text are an alternative but probably too great a distraction to an audience outside the typographic realm.  \n\\* after all most books are justified.  \nTim\n\n"
    },
    {
      "time": " 23.Sep.2005 5.28am",
      "content": "...You can guarantee that non-type-savvy readers would think pilcrows in the middle of flowing text were themselves some kind of mistake.  \n(I once had to spend ages explaining to colleagues what a section sign was... And that “errata” was a plural, come to that... I guess I was in the wrong business...)\n\nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 23.Sep.2005 6.31am",
      "content": "Apropos, the pilcrows in Gill’s Essay On Typography are beautiful. His whole essay is very well set. It’s a pleasure to read.\n\nUnfortunately, it’s difficult to find. I had to place an order for it at my local Chapter’s/Indigo.\n\n"
    }
  ]
}
