{
  "id": "1512",
  "title": "Paying for fonts when designing logos?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Can anybody tell me if when designing a logo - does the company that the logo is for have to buy a copy of the typeface used in it's design? Or, is it just the designer who should have purchased the typeface initially?\n\n",
  "author": "ness",
  "time": "3 Oct 2003 — 9:30am",
  "uid": "2406",
  "comments": [
    {
      "time": "3 Oct 2003 — 1:05pm",
      "content": "When making the proposal on the logo include all your out of pocket costs including typefaces. If its type converted to line art its one thing but if the client wants multiple users to be able type the logo as a typeface they will have to buy a multiple user licence for that face. Don't give away your work and let the client know: you can't bake a cake without flour and you can't create his/hers logo without type.\n\n"
    },
    {
      "time": "4 Oct 2003 — 2:49pm",
      "content": "We build the cost of purchasing any typefaces used in the design (logo, print work, signage and interactive) into the job and pass those on to the client.   \n   \nIf the client needs their own license for the ongoing use of a font (i.e for a newsletter template or text settings for correspondence) we will usually negotiate the license for them but we generally ask the client to purchase the font directly.   \n   \nIn the case of a logo/logotype, I also try to contact the type designer when the project is done so they can see what we did with their work (especially since the type used in logos is usually modified significantly). This is more a curtesy than anything, and it's fun to get feedback.\n\n"
    },
    {
      "time": "4 Oct 2003 — 3:53pm",
      "content": "I also build the cost of any typefaces purchased into the price of a job. If a client needs the font for any additional usage I will purchased what they need for them or direct them to where they can purchase their own copy.   \n   \nJeff Fisher   \nEngineer of Creative Identity   \n   \nJeff Fisher LogoMotives   \n [http://www.jfisherlogomotives.com](http://web.archive.org/web/20131017095242/http:/www.jfisherlogomotives.com/)\n\n"
    },
    {
      "time": "5 Oct 2003 — 9:08pm",
      "content": "\\>\\> you can't bake a cake without flour and   \nyou can't create his/hers logo without (purchasing)   \na type(face). (parentheticals added within context I think)   \n   \nsure you can and plenty do.   \n   \n^ create your own type from scratch   \n(every logo designer should know \\*how\\* to do this.)   \n^ sketch and digitize   \n^ use ink, brush, pen, bamboo, other media   \n   \ndon't want to link to the Jay Wilkinson logo/TM thread,   \nbut many of his points are strong. Rolling out an existing   \ntypeface should be an option, but not necessarily a robotic   \nsolution all of the time.   \n   \n   \nbj\n\n"
    },
    {
      "time": "11 Oct 2003 — 1:23pm",
      "content": "I agree. There are too many 'typed out' logos. I think   \nthere are a lot of designers out there who are too afraid of   \ntype design to try. I know a bunch who couldn't render a   \nletter to save their lives. (Oh no, my beziers are lumpy!).   \nGiven, I am still trying to perfect this art, but I think there   \nshould be a little more emphasis on drawing type in design   \nschools. I don't think people realize how powerfully unique   \nletter forms establish identity.   \n   \nI always smile when people ask what font I used for a logo   \nand I can say, 'No font, it's custom'. Sometimes even   \nclients are impressed. If nothing else, it makes you feel   \nmacho in a nerdy designer kind of way.   \n   \nThe worst are logos done in script fonts that are supposed   \nto look handwritten. It's even worse when they repeat   \ncharacters without using alternates or ligatures. I have a   \nhard time justifying 'hand-written' fonts anyway, let alone   \nin a logo. If you want to look like calligraphy, hire a   \ncalligrapher, or learn to draw yourself.   \n   \nIt's true that it's easier to make deadlines and budgets   \nwith fonts, though. And we've all been there...\n\n"
    },
    {
      "time": "11 Oct 2003 — 11:14pm",
      "content": "It's true that it's a time thing, too, and sometimes   \nan existing typeface is the perfect solution.   \n   \nWith the Typophile   \nT-shirt designs, I was encouraged to see Custom Type   \nand Lettering, or reworkings of existing type.   \n   \nspeaking of Custom...Dylan, way to go man!   \nYour site is up and looking fine. I'm ready for   \nthe KoolAid.   \n   \n [http://www.customartco.com/](http://web.archive.org/web/20131017095242/http:/www.customartco.com/)\n\n"
    },
    {
      "time": "12 Oct 2003 — 6:23am",
      "content": "I've been teaching a digital lettering course, and my students who all said they were \"very comfortable\" in Adobe Illustrator at the begininng of the course, are realizing that rendering original work with bezier tools is a lot different than what they are use to doing in AI.   \n   \nbj states that every designer should know how to do this, and I agree, but not every design student has been taught how, so I wonder how many designers know how to handle a bezier.\n\n"
    },
    {
      "time": "14 Oct 2003 — 5:14pm",
      "content": "\\> When designing a logo - does the company that the logo   \n\\> is for have to buy a copy of the typeface used in it's   \n\\> design?   \n   \nNo. But the designer, should have a proper license.\n\n"
    }
  ]
}
