{
  "id": "15148",
  "title": "Grid Systems and Modular Scales",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello,  \nfirst post here. Looks like a nice place.  \nI just finished the reading of Robert Bringhurst's \"The elements of typographic style\". Chapter 8, about shaping the page, was fascinating. I really enjoyed grid systems theories. However, I keep on wondering about modular scales.  \nIs anyone knowledgeable enough to give me a little run down on how to create one?  \nWhy doesn't the Half Pica Modular Scale contains the number 52?\n\nthanks in advance :)\n\n",
  "author": "<a href=\"/web/20111024202640/http://www.typophile.com/user/9264\" title=\"View user profile.\">jjshell</a>",
  "time": "<br>",
  "uid": "9264",
  "comments": [
    {
      "time": "",
      "content": "I don't have the answer to this, but shouldn't this be in the Design section?\n\n"
    },
    {
      "time": "",
      "content": "It doesn't contain 52 because it is a Fibonacci scale, the sum of the two preceding numbers equals the next number, therefore in the scale (21+34=55). The ratio 1:_phi_ 1.61803 (the ratio of the Golden Section) when rounded up to whole numbers applied to, for example, 5 gives 5 x 1.61803 = 8 so that page size/text block would be 5 x 8. By working backwards and forwards applying the formula of the preceding two numbers equal the next number gives a scale 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89...  \nTim\n\n"
    },
    {
      "time": "",
      "content": "hello tim,  \nthanks for your reply. you seem to be a very knowledgeable person. I am not a designer, I'm just interested in grid systems and modular scale after reading a few books by Le Corbusier.\n\nDo you have a copy of “The elements of typographic style”? I am still wondering why, in his example of a page shaped with a modular scale, the author used the measure 52 for one of the page side since this number doesn't appear in the half pica modular scale. Could you maybe shed some lights on this?\n\n:)\n\n"
    },
    {
      "time": "",
      "content": "I only _seem_ to be knowledgeable.  \nI apologise for not replying yesterday, I didn't have the book with me at work. The illustration you refer to gains its dimensions from the text block and the margins, so for the height you have 5+42+8=55picas, while the width is 5+42+5=52picas, the margins using the modular scale.\n\nThe key to all grids though is later in the chapter – section 8.8 improvisations & adjustments, writers will not comply with your grid all the time and the text is more important than the design. The fact is that grids only serve as guides and the pages will nearly always benefit from a good eye.  \nTim\n\n"
    }
  ]
}
