{
  "id": "1514",
  "title": "Adobe Logic {Upgrading to Adobe CS}",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Nick, for my further understanding, if you (as a type designer) could afford to \"dump\" your fonts onto students (who in turn would then know your fonts names and foundry name) would you? I'm just trying to grasp this concept, this dumping as a bad thing.   \n   \nIs Adobe then the enemy to small foundries because they can afford to get students used to their name and their type?\n\n [‹ Definition of Terrorism](http://web.archive.org/web/20070911195143/http:/typophile.com/node/1685 \"Go to previous forum topic\") [Am i too late?! ›](http://web.archive.org/web/20070911195143/http:/typophile.com/node/1701 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911195143/http://typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": "<br>",
  "uid": "108",
  "comments": [
    {
      "time": " 8.Oct.2003 2.36pm",
      "content": "I don 't think the type Adobe offers these days is really an enemy for other foundries. Most of the better foundries, big or small, have found their niche. From Emigre, FSI, Lucasfonts, Thirstype, Lineto and and and we have come to expect a certain brand, a certain flavour of typefaces. Adobe doesn't offer anything even close to Meta or Dax or Scala or Priori or CourierSans or TazIII or Thesis or Giacomo. They (and Linotype) have all the classics and you will turn to one of them for Trade Gothic or Helvetica or whatever, but by dumping Adobe-Style-Fonts Adobe thus only hurts itself. ALl in all, having fonts to experiment with will make some folks notice that typography is just as important a tool as photography or illustration is (maybe even notice that it is MORE important, actually) and they will want more. More Adobe, sure, but in the long run also some of stuff from the other foundries, and after a while even more stuff from these small and larger independents, as their product is not technically better but sometimes aesthetically more unique than what Adobe offer.   \n   \nIn some way, bundling fonts with their product Adobe is like a drug peddler offering cannabis to High School kids in order to maybe selling some more MJ later-on. If I were a dealer of pure hardcore Crystal Meth, I wouldn't worry about THAT at all... they're just doing free work for you.\n\n"
    },
    {
      "time": " 8.Oct.2003 6.07pm",
      "content": "\\>Most of the better foundries, big or small, have found their niche   \n   \nAnd a niche is a small place.   \n   \nThere is a potential marketplace of millions of software app users who aren't buying fonts, because they don't need to.   \n   \nThese are the people now making their living as graphic designers, a 25-fold increase since 1985, when PostScript was introduced. (Figure from Adobe's \"Inside the Publishing Revolution\")   \n   \nThe type culture we have has been homogenized by the massive giveaway of fonts:   \n   \n\\*System Fonts (Apple, Microsoft)   \n\\*Web fonts (Microsoft Core Web TrueType)   \n\\*Software application fonts (bundled with Adobe products)   \n   \nIn each of these cases, fonts are necessary to make the do-hickey function, so that is why they have been provided.   \n   \nThe end result is a dumbed-down font culture dominated by retro (no royalty fees), and utilitarian fonts.   \n   \nAdobe killled the goose that laid the golden egg, in the early 90s. At that time (according to \"Inside the Publishing Revolution\") there was a boom in font sales, so they probably didn't think that bundling scores of typefaces on Illustrator and Photoshop CDs would make much difference. (But they're still doing it with the CS.)   \n   \nThe mostly-tawdry fonts they gave away (so as not to pay royalty fees) really infected font culture. I mean, that was the 1990s, did we really need to be defined by Gill Sans (1930) or Serpentine (1970)? Serpentine fulfilled the need for a techno/sporty typeface, so most typographers used it because it was on hand, rather than supporting contemporary type designers who provided the genuine article.   \n   \nTiffany, I would say that the dominant position of Adobe is indeed a \"bad thing\" for font culture as a whole, because in so many instances, institutions and companies go for the big Adobe package, of undisputed value, rather than opting for something more contemorary and diverse.   \n   \nHD, history doesn't support your argument that free fonts now results in a desire for better, more exotic fonts later. We've had a decade of font giveaways. But just look at what's on the street, and what's on the best-seller list at Myfonts.com -- it's all classic mid-20th century sans serifs that people are buying, not 21st century typefaces from contemporary designers.   \n   \nWhat is it with the ubiquity of Trade Gothic and Helvetica? Why do the majority of typographers have such an aversion to the work of contemporary type designers? Can you imagine the same situation in music (all the songs 50 years old)?   \n   \nIt's a little too easy to say that fonts are not a consumer product, and that designers' tastes are naturally conservative. I would say that the present day utilitarian, stagnant aesthetic is a direct result of the giveaways by the software giants.\n\n"
    },
    {
      "time": " 8.Oct.2003 6.35pm",
      "content": "Has anyone actually used the Corel line of products? I always see other designers bashing the product line, but I can't say that I've evern met anyone that's actually tried out the product. I've also seen good reviews of their products as of late.   \n   \nHaving been a Macromedia guy for a long time, and slowly becoming pissed off at the company (sloppy, bloated, bug-ridden upgrades) I thought I'd venture into the underdog crowd to see what's out there.   \n   \nAs for the font issue, yea, I understand that type designers would be upset, but I don't think Adobe cares. They're in the business of selling software. If bundled fonts help sell the product, why not?\n\n"
    },
    {
      "time": " 8.Oct.2003 8.10pm",
      "content": "\\>As for the font issue, yea, I understand that type designers would be upset, but I don't think Adobe cares. They're in the business of selling software. If bundled fonts help sell the product, why not?   \n   \nThis is not just a type designer issue. The concern is a broader cultural one.   \n   \n\"We had been chosen, for better or worse, as primary influencers of an industry with 500 years of tradition, aesthetics, and values. We now had the responsibility to the industry to do the right thing. It became our goal to build a company whose culture and values reflected that responsibility\"   \n-- John Warnock & Chuck Geschke, Foreword, Inside the Publishing Revolution, Peachpit Press, 2003   \n   \nThe right thing to do now would be for Adobe to divest its foundry business.\n\n"
    },
    {
      "time": " 8.Oct.2003 8.23pm",
      "content": "Nick da man.   \n   \nA publicly owned company has no cultural obligations.   \n   \nhhp\n\n"
    },
    {
      "time": " 8.Oct.2003 8.24pm",
      "content": "First, I simply want to remind people of the historical order of events in the evolution of font pricing. Microsoft put serious downward pressure on font prices with their mass market \"TrueType font packs\" for Windows. Corel was then bundling hundreds of fonts with CorelDraw. Adobe then started bundling large numbers of fonts with Adobe Illustrator, and that number increased as a direct result of the ongoing battle in the drawing program market. Bitstream's licensing of over 500 good quality fonts to Corel (partly replacing much inferior ones from Corel) was a key move in this ongoing struggle.   \n   \nIn recent years, as I've mentioned previously, there has been a dramatic \\*decrease\\* in the number of fonts Adobe bundles with applications. I'm sorry if that conflicts with anybody's world view.   \n   \nI don't mind sharing that this occurred for two main reasons. One is that we are aware of the effect on the market for retail fonts, which is after all biggest on the demand for our own fonts. Another is that the competitive pressure has eased (although Corel has increased their their bundled fonts until they had over 1000 fonts, they no longer have very large market share).   \n   \nSecond, I will simply point out that Adobe has a history of maintaining retail prices, despite continuous undercutting from other foundries who we cross-license with, such as Agfa Monotype.   \n   \nI am in no way trying to suggest that Adobe's corporate behavior in font bundling and pricing is saintly or better than everyone else's. But painting Adobe as the primary actor in the decline of demand for fonts is absurd.   \n   \nContrariwise, in terms of change in the status quo, Adobe has done more than any other single company to maintain or improve the situation in the last few years. Dramatically reducing our numbers of bundled fonts, and trying to move the industry to a new format are both moves that should help increase the demand for fonts.   \n   \nFinally, I understand that this whole area of discussion is a sensitive and personal issue for many of those involved in the discussion - myself included. Unfortuantely, I am starting to think the insult level may be getting too high for me to continue participating in this discussion. \"Tawdry\"?! No matter how bad I think some foundry's designs are, that's language I would not use to discuss people's work in a public forum, and certainly not in discussion with people from that company.   \n   \nT\n\n"
    },
    {
      "time": " 8.Oct.2003 8.28pm",
      "content": "Daniel:   \n   \nI'm afraid, as you suspected, I can't comment on unannounced future plans for an Adobe product. On those occasions when I do roll out previews or the like, it has been okayed by key people in a number of roles in the company.   \n   \nSorry,   \n   \nT\n\n"
    },
    {
      "time": " 8.Oct.2003 8.33pm",
      "content": "\"Tawdry\" is too strong?! Sheesh, that makes half my entire vocabulary taboo. (I hope \"taboo\" is OK.)   \n   \nhhp\n\n"
    },
    {
      "time": " 8.Oct.2003 8.48pm",
      "content": "Nick:   \n   \nI don't see how separating Adobe's foundry business from its applications would help the problems you see one bit. Being separate companies hasn't stopped OS vendors and other application vendors from licensing and bundling hundreds (or in one case, over 1000) fonts from many other foundries. Adobe has largely chosen not to do such licensing, despite frequent approaches. Similarly, Adobe has pretty much completely avoided doing knock-offs of other people's work, despite internal and external pressures.   \n   \nIndeed, if Adobe's foundry business was separated out, there might be \\*more\\* such licensing, or knockoffs. The newly separated foundry would be faced with the same short-term financial pressures as other foundries. The only thing to stop it would be the owner's personal ethics. Past experience has clearly demonstrated that when faced with bankruptcy and laying off all their employees, some foundries have been willing to at least temporarily set aside those principles in order to save their business and their employees' livelihoods. That's pretty understandable, but an unfortunate choice to have to make.   \n   \nBeing part of a bigger software company has insulated Adobe's type group from those pressures. I don't think that's a bad thing; I think it has been good for Adobe type and the type industry.   \n   \nIn a key related issue, OpenType would be nowhere near critical mass, and might not have typographic sophistication for western languages, without Adobe's corporate backing. In order to make a fundamental shift like this, it is extremely helpful to have both fonts and applications owned by a single player, so they can make the commitment and avoid a chicken and egg problem. Not having this is one of the reasons GX failed, and AAT is failing.   \n   \nT\n\n"
    },
    {
      "time": " 8.Oct.2003 8.57pm",
      "content": "Why did MM fail?   \n   \nhhp\n\n"
    },
    {
      "time": " 8.Oct.2003 9.45pm",
      "content": "\\>There is a potential marketplace of millions of \\>software app users who aren't buying fonts, \\>because they don't need to.   \n   \nNick, it won't happen. No word-User is gonna buy a font package for 299 Dollar. Every amateur I know is happy with Freeware or Corel-bundled trashfonts and even so has the absolute talent of picking the most awful overused clich\n\n"
    },
    {
      "time": " 8.Oct.2003 11.35pm",
      "content": "Actually, the MM \\*fonts\\* sold well, but our research showed that most users only used the default instances and never made custom instances. For them, we would have made their lives easier if we sold them separate fonts with nice clear names.   \n   \nWhere MM failed was in the Adobe type group not realizing that they needed to put huge amounts of energy into evangelizing the applications and UI people. So it was a failure of \\*internal\\* marketing. We foolishly thought we could just build a better mousetrap. But the reality was quite different.   \n   \nAs far as the effects on the font market, MMs were not helpful. It was difficult to explain the value proposition to customers. \"Yes, I know there are only two font files, but they recombobulate into a couple of dozen fonts, so that's what you should pay for!\" That was not a line that went over very easily, and was not seriously pursued for long. So they were not sold by Adobe at prices that came anywhere near reflecting the work that went into them.   \n   \nThat being said, Adobe's type group learned a lot from the MM experience. We knew that with OpenType we would have to work our rear ends off to explain the benefits to our own application people, and market it heavily internally. We did exactly that, with the result that we had more support for specific features of OpenType when the first fonts shipped, than we got for MM fonts in ten years. We learned from our mistake, and I think it's pretty clear now that OpenType is being successful as a result.   \n   \nOn a similar vein, whatever problems there were with output or compatibility of MMs in the professional publishing industry appear to have largely been exaggerated and issues of unreasoning leftover prejudice from very early problems (much like the anti-TrueType sentiment). However, unlike TrueType, I can't be completely sure that's true....   \n   \nThe reason that I don't know is that Adobe did not handle it well. So, to do better with OpenType (one of my small contributions to the OpenType strategy) we said, let's track this stuff as best we can, document every single significant problem we know of, and make it a public document: the OpenType readme. Then if people say \"but I hear this font format doesn't work with SuperPublisher\" we can look and say \"well, there was this one problem with SuperPublisher 3 and earlier, but here's the workaround, and in any case there's no problem in SuperPublisher 4 and later.\"   \n   \nAnyway, there were a bunch of reasons MMs didn't make it. But we're aware of those reasons, and trying to avoid every one of them with OpenType.   \n   \nFinally, it's true that the advanced features of OpenType for western languages are pretty much an Adobe-only game right now. But this will change within a couple of years. Juergen Kurz (Tim Gill's replacement at Quark) told me at Seybold that QuarkXPress 7 will support both Unicode and OpenType layout goodness. Good for them, and it's about time they at least went to Unicode. There is another \\*huge\\* non-Adobe application just starting to plan OpenType support right now; I'm supposed to be meeting with the product manager in a week or two to discuss it. (But that one is confidential.)   \n   \nI am sure we won't give Quark the kind of direct help we do with other type foundries, but along with everybody else, we're helping answer their constant questions about OpenType layout and how to build an OpenType text engine on the OpenType mailing list, and I offered to send them a copy of Font Folio OpenType Edition for testing purposes when I was talking with Juergen.   \n   \nToo bad we're so evil. ![:-)](http://web.archive.org/web/20070911195143im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nT\n\n"
    },
    {
      "time": " 9.Oct.2003 12.31am",
      "content": "\\>Actually, the MM \\*fonts\\* sold well,   \nGood to hear, I loved that format and was quite saddened to see it fade away. Luc(as) de Groot recently wrote to me, tnat he still uses the MM technique sometimes to create fonts and interpolations.   \n   \n\\>problems there were with output   \nNever really had any, but it was unpractical. If an outputter demanded open files with fonts, it was a pain to collect them all. With PDF, I've done a couple of MM jobs, no problem at all. I still use all MMs I bought and like them a lot. I think a mix of on-the-spot-MM in InDesign embedded within OTF would be pretty nice.   \n   \n\\>anti-TrueType sentiment   \nThat probably stems from the fact that TT is the No-1 shareware format, and those fonts aren't always well-hinted or even well-built. TTF is superb for some things, not so good when it comes to actually outputting PS code, although even that works pretty good today. What bothered me more was another Beta/VHS/Video2000 War.   \n   \nSuperPublisher sounds like a neat program. Good to hear that Adobe is finally cxoming up with good catchy names for their warez.   \n   \n\\>pretty much an Adobe-only game   \nAnd I think Adobe can live with that quite well, as it gives InDesign an edge over Quark. And after years of suffering with Splendid-Isolation-XPress, I think that anything making them sweat is good indeed. Good to hear that they finally come around. When Macromedia and Microsoft also support Pro-OTF, all is well. All in all I think, so far it went pretty smoothly from TT/T1 to OTF. I'd only wish there were more Pro-Fonts. And that the online shop had a very clear differentiation between regular OTF and Pro-OTf (but I haven't looked there in quite a while, so maybe that is the case now...)\n\n"
    },
    {
      "time": " 9.Oct.2003 4.38am",
      "content": "If you think Corel is an option to Adobe then listen to my tale. I got a great offer through NAPP for Corel Painter 8 and I sprung for it since that is how I was trained in school (as a painter) I got the application and in the manual under every caption under the pictures I saw the deadly error of sloppiness they didn't include the printer font or didn't open it or didn't imbed it with the PDF. But the point is they rushed the product to market and were sloppy. Who checked the manual? I am a member of a Corel Painter site and we have a wish list (of improvements) and its over 100 requests in how many months (not many), its bad enough that the product manager Rick Champaign is going to release Painter 8.1 at the end of the month addressing 20 issues with painter, so sad.\n\n"
    },
    {
      "time": " 9.Oct.2003 7.32am",
      "content": "Thomas, that's probably the fullest and most decent answer about MM I've ever heard - thanks.   \n   \n\\> So they were not sold by Adobe at prices that   \n\\> came anywhere near reflecting the work that   \n\\> went into them.   \n   \nExactly.   \nAnd this comes back to what I myself have always thought about MM: they needed to be priced much higher, because it's a specialist tool. You would have made far fewer sales, but at least the power users would have made it worthwhile. And it would have given \"regular\" users something to look up to.   \n   \nSo why were they sold for so cheap? I think it's because corporations these days aren't very interested in making a little bit of money over time - their shareholders want that yaght, and they want it _now_. So the consumer was optimistically seen as being typographically highly sophisticated, while -as your research shows- some of them might buy the stuff because they think it'll make them better, but few of them will actually use the high-end features. Like smallcaps.   \n   \nI think too much was expected of the consumer, hence MM, and it wasn't the cash cow Adobe required.   \n   \nhhp\n\n"
    },
    {
      "time": " 9.Oct.2003 9.01am",
      "content": "\\> A Trabant and a Ferrari are both cars and will get you from A to B   \n   \nI once got a ride in Luc[as] de Groot's Trabant, during ATypI-Leipzig. I think it wouldn't have been as nice in a Ferrari. For one thing, a Ferrari doesn't have a boombox on the back seats doing stereo duties. Many Ferraris don't even have back seats.   \n   \nhhp\n\n"
    },
    {
      "time": " 9.Oct.2003 9.07am",
      "content": "Nick (post #71)   \n   \nI agree with you, I agree that perhaps design has been homogenized by the fonts that have been bundled with the different software apps. But, I can't agree that it is any specific foundries fault. It is the fault of the designer's and agencies and studios that use these bundled fonts. After all, the fonts were \"dumped\" on them. They don't have to use them.   \n   \nI refuse to believe that more designers, whom appreciate the fonts that are bundled, don't also buy other type. Maybe I have too much hope and too much faith in the design world.   \n   \nAnd this brings me to ...   \n   \nNick, your talk about Helvetica at ATypI was great. Yes, you have dampened my spirits by making me admit that their is a bit of an helvetica problem. It is a sad state of affairs and the finger should be pointed at designers (dumpees) and not the software companies (dumpers).   \n   \nDoesn't it come down to education (yet again). Educating the corporations and the masses. Nick, your Helvetica talk should be printed in Forbes or something like that. Educate the guys at the top. Wouldn't that be interesting. Get the suits saying things like, \"helvetica sucks, I want Brown!!\"\n\n"
    },
    {
      "time": " 9.Oct.2003 9.10am",
      "content": "Right now, one can freeze-dry MM instances into Type 1 using $550 FontLab or $99 TransType. One can also have a FontLab .vfb file that contains both MM axes and OT features; it can generate freeze-dried MM instances as .otfs.   \n   \nSo what if Pyrus, Letterror or somesuch could license a tool that allowed a font vendor to distribute an executable that takes MM .vfb data and outputs some user-defined instance along those continuous axes? Expert users could rightly pay a premium for such a capability that would give them the best of both worlds. You still might not have the automatic optical scaling in apps that some people seem to want, but at least the end-user could select precisely what values along each axis he or she wants. The code already exists, it would essentially be FontLab with a narrowly restricted UI.   \n   \nThen some MM enthusiast could buy some hyper-exclusive instance-generator version of a font. Call it something like \"Minion Supreme.\" No MM format needed. Might that be a reasonable compromise?\n\n"
    },
    {
      "time": " 9.Oct.2003 9.14am",
      "content": "I know this isn't really appropriate, but hey. I just want to say that reading the word \"recombobulate\" cheered up my day (on several levels) ![:-)](http://web.archive.org/web/20070911195143im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 9.Oct.2003 9.26am",
      "content": "Print shops also tended to be wary of MMs, similar to their suspicion of TrueType -- a legacy suspicion from a time when many RIPS choked on TT. When MMs first appeared on the scene, most printers refused to accept them, so I steered clear of them altogether, reserving MM and TT for desktop-production jobs only.   \n   \nPrintshops are often the \"lowest common denominator\" that defines the parameters of a job. That makes sense in theory, except that printers also tend to be the most conservative and slowest to accept changes in technology. Hence, any new technology has to be sold to the production end of the chain if it's going to be taken up by the design end. (I think that also explains why a lot of designers are hesitant to give up Quark for the vastly superior InDesign.)\n\n"
    },
    {
      "time": " 9.Oct.2003 9.36am",
      "content": "Well in most Latin America Corel is the Graphics Industry Standard (Photoshop is for picture edition), and of course there are some things you can\n\n"
    },
    {
      "time": " 9.Oct.2003 9.37am",
      "content": "Thomas:   \nYou are a gentleman, AND you like Cambazola. Whatever else may be said about Adobe, I appreciate you candor and civility while dodging flaming arrows... and your taste in cheese.   \n   \nEveryone:   \nIt seems to me there are 3 sources that can really influence perceptions about type: 1.software applications (who bundles what and how), 2.schools of design education, 3.industry award annuals. We've been talking about 1 at length in this thread. We've talked about 2 at some length in other threads. Number 3:   \n   \nAward annuals are sources of inspiration, places to take the pulse of the creative community, reflecting trends but also setting trends. They are browsed and studied time and again by young creatives. In school I was taught to value quality, classic type. I think (as has been mentioned) the quality fonts bundled with design software reinforced this, and established Adobe as a place that I could trust for decent fonts. However, I wasn't made aware of any of the alternative sources for quality 21st century fonts. It wasn't until I started feverishly pouring over design annuals looking for the x-factor :-) for my layouts that I got a taste for Emigre and FSI etc. The crazy thing is, Communication Arts, the gold standard annual in most US shops, has no type credits whatsoever! Mention the type! You want to raise awareness in the young creative community? Put it in lights next to Cahan Associates, Goodby, Duffy whomever.   \nAnd while you're at it, write an article about type once in a while. Every non-annual issue CA includes a spotlight on a photographer, an illustrator, a design/ad agency. They show fresh talent in each of these areas. How about fresh type?\n\n"
    },
    {
      "time": " 9.Oct.2003 9.50am",
      "content": "Thomas, HD:   \n   \nThe \"market of millions\" I refer to is professional graphic designers using Type 1 fonts on Mac computers, in Photoshop, Illustrator, and XPress, for print.   \n   \nFreeware, shareware, piracy, Corel, Bitstream, and pre-installed fonts are not the issue.   \n   \nThe fact is, the mainstream of graphic designers have gotten the bulk of their quality design fonts for free, since Illustrator and Photoshop were shipped on CD, starting around 1992. The bulk of these fonts have not been contemporary, or classic. And this has been reflected in the often tawdry appearance of type culture.   \n   \nI've been upgrading Photoshop and Illustrator for a dozen years, and acquired a wealth of fonts in the process. Some of them are classic (eg Adobe Garamond and Berthold Bodoni, with expert sets), but most are, if not tawdry, then pretty wack. When I'm on the street and see widespread indiscriminate use of certain ITC fonts that I acquired free with Adobe upgrades, it's too bad that the typographers involved didn't buy their fonts instead. Perhaps they would have chosen something contemporary, more expressive of where we're at today, more supportive of today's type designers.   \n   \nHowever, they may have bought an old sans serif face that \"the customers want\" or \"just seem right\". This present day conservatism is a complex issue, but is connected to the dominance of media by a small number of corporations.   \n   \nI'm not painting Adobe as evil, it's a progressive company with amazing products, and its employees have the best of intentions.   \n   \nWould the Microsoft-Adobe initiative on OpenType have happened if Adobe didn't have a type division? I don't know. However, if Adobe didn't have a foundry, perhaps I would have been making OT fonts for several years with Adobe Fontographer!   \n   \nI never could make MM fonts satisfactorily with Fontographer, few could, and the consequent lack of typeface diversity dealt the biggest blow to the format.   \n   \nAdobe Fontographer -- Bring it on!\n\n"
    },
    {
      "time": " 9.Oct.2003 10.08am",
      "content": "\\>there are 3 sources that can really influence perceptions about type   \n   \nRandy, I would also add #4, the \"metaculture\" of b2b trade promotions. It seems that every piece I get from a stock library or paper company, or invitation to a conference, or call for entries, is set in Trade gothic, Helvetica, etc. (boring old utilitarian sans faces).\n\n"
    },
    {
      "time": " 9.Oct.2003 10.21am",
      "content": "\\>annuals are a crucial place   \nAgreed., I really like that the TDC is at least giving a BIT of information. Could still be more, but maybe that isnot the prime thing to do in a annual award catalogue...   \n   \n\\>3 sources that can really influence perceptions \\>about type   \nI think ther are many more, but asadly most foundries lack the financial means to really do a string kind of marketing push for their product.\n\n"
    },
    {
      "time": " 9.Oct.2003 11.01am",
      "content": "If anyone is going to get it, TDC should. If only they had more heft and a broader reach (mom & pop shops across the globe\n\n"
    },
    {
      "time": " 9.Oct.2003 11.14am",
      "content": "\\>Do they mention the photographer? Yep. \\>Illustrator. Yep. Type. Rarely.   \nSays a ot about the sorry state of typography as a whole, imo.   \n   \nWould ANY company use the same stock-photo the direct competition uses. No... but the same typeface, no problem. Would any larger company say No to paying some thousand dollars for exclusive non-stock photography? Sure, they do so all the time, even if they use the pix only once or twice. But paying the same kind of money for a customized typeface they can use for YEARS... no effing way.   \n   \nIt' still very much an invisible artform. Everybody reads, but no one notices. Maybe that would make Tschichold happy... maybe it's time to change that. And even when people notice, as with Carson, he fast as lightnig is dubbed a graphic artist, NOT someone who works as a typographer... that would be so mundane. :-D.\n\n"
    },
    {
      "time": " 9.Oct.2003 11.29am",
      "content": "A good discussion of the commodification/devaluation of type. And Mr. Phinney: \"There's no big money to be made in type\"? At Veer, we respectfully disagree. What is lacking is a commitment to marketing them, to believing in them. When we put type samples on paper and show them to qualified customers, they sell. Yes, perhaps on the backs of stock photographs (which comprise the bulk of our catalog) - but they sell, surprisingly well.   \n   \nSpeaking of stock photography: does anyone else find it ironic that, despite the same conditions and challenges facing type design (i.e., widespread availability of free, inferior product; widespread access to the technology - compare the digital camera to Fontographer!; bundling with applications, etc.) the prices of stock photography continue to rise (driven by Getty, Corbis, Digital Vision, et al), while type prices continue to fall? There is nothing more to this than type producers (or their parent companies - consider behemoths like Letraset, Agfa, and Adobe - which have much bigger fish to fry, and have somewhat neglected their type businesses) losing the corporate will to maintain a pricing strategy.   \n   \nWe are constantly advising our type vendors to keep prices high, and not sell themselves short, because they \\*do\\* sell if they're fresh, usable designs.   \n   \nJon Parker   \nVeer\n\n"
    },
    {
      "time": " 9.Oct.2003 11.29am",
      "content": "A good discussion of the commodification/devaluation of type. And Mr. Phinney: \"There's no big money to be made in type\"? At Veer, we respectfully disagree. What is lacking is a commitment to marketing them, to believing in them. When we put type samples on paper and show them to qualified customers, they sell. Yes, perhaps on the backs of stock photographs (which comprise the bulk of our catalog) - but they sell, surprisingly well.   \n   \nSpeaking of stock photography: does anyone else find it ironic that, despite the same conditions and challenges facing type design (i.e., widespread availability of free, inferior product; widespread access to the technology - compare the digital camera to Fontographer!; bundling with applications, etc.) the prices of stock photography continue to rise (driven by Getty, Corbis, Digital Vision, et al), while type prices continue to fall? There is nothing more to this than type producers (or their parent companies - consider behemoths like Letraset, Agfa, and Adobe - which have much bigger fish to fry, and have somewhat neglected their type businesses) losing the corporate will to maintain a pricing strategy.   \n   \nWe are constantly advising our type vendors to keep prices high, and not sell themselves short, because they \\*do\\* sell if they're fresh, usable designs.   \n   \nJon Parker   \nVeer\n\n"
    },
    {
      "time": " 9.Oct.2003 11.36am",
      "content": "_...sadly most foundries lack the financial means to really do a string kind of marketing push for their product._   \n   \nThese kinds of content policy changes wouldn't cost foundries a dime (well maybe the cost of posting a letter). It wouldn't hurt if some letters from real type heavyweights were included, particularly if they used the word crisis alot. I'm probably also naive. Who will be our Cesar Chavez?   \n   \nIt seems to be about influencing our largest audience (the design community) using the currency most valuable to them (the programs they use daily, and the annuals they read nightly... and Nick's #4 truckload of DM arriving in between).   \n   \nRandy   \n   \nEdited: _When we put type samples on paper and show them to qualified customers, they sell._   \nWe cross posted. Method #4 exactly. \\*How\\* you show them is the key. People look to DM for ideas and inspiration just like annuals. If they're seeing helvetica, that will be myfonts top seller. If they see fresh new stuff from foundries they've never heard of, presented in inspiring ways, with the option to purchase right there (ala Veer DM). Schwing!\n\n"
    },
    {
      "time": " 9.Oct.2003 12.00pm",
      "content": "re: Veer   \n   \nThe question that nags at me is, How many regular type buyers\\*   \nare there worldwide?   \n   \nJon or Grant,   \n   \nI was floored to hear that Veer sends out 400,000 catalogs...   \ndid I hear that correctly?\\*\\*   \n   \nis that worldwide, North America only?   \n   \nHow does that compare to Image Club in its heyday?   \n   \nFrom what I remember reading, Emigre and P22 had mailing lists   \nthat were in the 30,000 neighborhood   \n   \nbj   \n   \n\\* Buyers is maybe not the best term. But by regular type buyers   \nI mean \"designers\" who obtain a legal license to more than one font   \nper year...This would leave out hobbyists who license a Battlestar   \nGalactica font, or the people licensing specialized non-industry fonts,   \nsuch as scrapbook fonts.   \n   \n\\*\\*the number comes from a TypeCon panel discussion.   \nDid I hear that right? Maybe I was just lacking sleep?\n\n"
    },
    {
      "time": " 9.Oct.2003 12.14pm",
      "content": "Yes, thanks Thomas for your candor.   \n   \n\\_\\_\\_\\_   \nRe: Bundling   \nAdobe is a software company that sells and bundles fonts.   \nAgfa is a hardware company that sells fonts. Does Agfa   \nbundle them with their hardware? (That's an honest   \nquestion, does anyone know the answer?)   \n   \n\\_\\_\\_\\_   \nRandy, your issue no. 3 is astute and it deserves another   \nthread. I also think it's bigger than Communication Arts.   \n   \nOver a year ago we (Typophile) were approached about a   \npossible feature in a major design magazine. After sending   \nthe author lots of written descriptions and screen shots,   \n(fodder for the article) the editors couldn't understand that   \nTypophile was not a foundry. In the end the editors   \ndumped the feature citing, essentially, that type doesn't sell   \ndesign mags. They seemed to believe type isn't sexy   \nenough when you run it next to illustration or photography.   \n   \nSome rags get it (Print, Critique). Some don't.\n\n"
    },
    {
      "time": " 9.Oct.2003 12.20pm",
      "content": "AGFA -- Many years ago, when (the company for which I work) acquired an AGFA we were also given X-amount of dollars to spend on type. So, in a way, I guess that was a bundled deal, but I got to choose what type I wanted.   \n   \nSEXY -- Type is sexy. I can't believe that happened. I mean, I can, but sheesh!!\n\n"
    },
    {
      "time": " 9.Oct.2003 12.25pm",
      "content": "_The question that nags at me is, How many regular type buyers are there worldwide?_   \n   \n\\*Regular\\* buyers is a tough call - I couldn't guess.   \n  \n_I was floored to hear that Veer sends out 400,000 catalogs... did I hear that correctly?\\*\\* is that worldwide, North America only? How does that compare to Image Club in its heyday?_   \n  \nI can't share specifics, but let's say its more than Image Club in its heyday but significantly less than EyeWire in its heyday.   \n   \nOf course, EyeWire's heyday coincided with the dot-com bubble - even the name now rings of the era! (Little did I know...)\n\n"
    },
    {
      "time": " 9.Oct.2003 12.36pm",
      "content": "Hector, I just got back from a Adobe CS seminar and CS does kick some serious butt. For one thing the color and type engines are the same for Illustrator, InDesign and Photoshop. Also the PDF intergration between the applications is amazing. You can place movie files in InDesign and export them as PDFs and the PDFs support layers.\n\n"
    },
    {
      "time": " 9.Oct.2003 12.39pm",
      "content": "Jon: When I said there was no big money to be made in type, I meant that in two ways....   \n   \nFirst, in a relative sense. In the software industry, which I consider type to be a part of, a major product earns 100s of millions of dollars a year. The entire type industry doesn't pull in that kind of money, and I doubt it every will. I'm not saying there's no money to be made in type, but you could put all the type revenue in the world together and not come close to the revenue of any one of the top half dozen publishing/graphics applications.   \n   \nSecond, in an absolute sense, there are very very few people alive today (if any) who have made themselves filthy rich by creating and/or selling fonts. A few of us are lucky enough to earn a pretty comfortable living, but even we are the minority. It's as if you had the acting profession without major studios and blockbusters.   \n   \nNow that being said, I have no doubt that Adobe could increase its type revenue (and to a lesser degree profits) substantially by devoting more resources to marketing. I doubt there's anybody in the type group here who doesn't wish that we moved in that direction. But the same factors that insulate us from certain financial pressures give us other areas of emphasis.   \n   \nOn the other hand, I would think that's something other foundries would be happy about. Except for those of you who get royalties from Adobe, would you \\*like\\* it if Adobe spent another $5+ million a year on marketing Adobe fonts?   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " 9.Oct.2003 12.42pm",
      "content": "John B: Yes, such a tool would be technically feasible, and we have at least talked about it here at Adobe (though that's about it).   \n   \nDavid E: Thanks! I like \"recombobulate,\" although apparently not as much as \"wonky\".... ![:-)](http://web.archive.org/web/20070911195143im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nT\n\n"
    },
    {
      "time": " 9.Oct.2003 12.59pm",
      "content": "I really wonder why Sans are always in top ten in Foundries. One of the invisible answer is perhaps that Sans families are bigger, and this help them to became dominant in sales figures?   \n   \n   \n(Thomas, interesting this info about Quark Xpress 7 and Unicode ![:-O](http://web.archive.org/web/20070911195143im_/http:/www.typophile.com/forums/clipart/proud.gif)penType support.)\n\n"
    },
    {
      "time": " 9.Oct.2003 1.01pm",
      "content": "_...a major product earns 100s of millions of dollars a year. The entire type industry doesn't pull in that kind of money, and I doubt it every will._   \n   \nYou're absolutely right. I have difficulty thinking in numbers that large! When you said \"Big money\", I was thinking of the potential revenues (e.g., $99 faces) versus what they actually are ($19/shareware/free) - where we feel there is a huge gap. This gap is \"big money\" to type designers, and struggling foundries, and distributors like us - but wouldn't accumulate to anything approaching application software profits.   \n   \n_It's as if you had the acting profession without major studios and blockbusters._   \n   \nAn apt analogy.   \n   \nI understand Adobe's \"follow the money\" approach - it's just good business. So the discussion is not really about \"tiny type groups within large software companies\", but about niche technologies/products being lost in corporate conglomerates - an inherent problem of free-market capitalism.   \n   \n_Would you \\*like\\* it if Adobe spent another $5+ million a year on marketing Adobe fonts?_   \n   \nHmm, perhaps not. But I could recommend a good company to outsource some of that expenditure to... ;-)   \n   \nThanks Thomas.   \n   \n- Jon Parker\n\n"
    },
    {
      "time": " 9.Oct.2003 1.15pm",
      "content": "\\> Does Agfa bundle them with their hardware?   \n   \nNot that I've seen. I used to sell pre-press equipment (don't ask...) including Agfa imagesetters, and back then at least you had to pay for the fonts separately. I think the reason is that Agfa hardware is high-end, and high-end customers are harder to dupe with buckets of free fonts.   \n   \n\\> I really wonder why Sans are always in top ten in Foundries.   \n   \nProbably Modernism/Minimalism.   \n   \nhhp\n\n"
    },
    {
      "time": " 9.Oct.2003 2.40pm",
      "content": "In France, circa 1995, it was usual to give away a Agfa font collection to conclude an Imagesetter sale (Source from Agfa sales people at the time).\n\n"
    },
    {
      "time": " 9.Oct.2003 9.57pm",
      "content": "_I really wonder why Sans are always in top ten in Foundries?_   \n   \nI suspect it is because of the way in which sans types are used in design: in heads and subheads, they contribute more to the immediate visual impact of a design than the text face, so a greater number and variety of sans types are necessary to maintain freshness in design. This encourages designers to keep buying new sans types, while they can generally get by with a smaller number of serif text faces.\n\n"
    },
    {
      "time": " 10.Oct.2003 12.00am",
      "content": "John,   \n   \n\".. so a greater number and variety of sans types are necessary to maintain freshness in design.\"   \n   \nHmmm, \"necessary\". I don't think so.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": " 10.Oct.2003 12.49am",
      "content": "Well, not necessary in the way that food is necessary, and not fresh in the way that air is fresh ![:-)](http://web.archive.org/web/20070911195143im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nFrom the perspective of much contemporary design practice, though, in which type and layout contribute to 'brand identity', immediate visual distinction is very important. Sans serif types contribute more obviously to such distinction because there are used larger, are set apart from text in headings, subheadings, etc. and are more likely to appear in colour. You can set the text of half a dozen different publications in the same serif text face, and can still visually distinguish them by using six different sans serif types. If you use the same sans type for all six, you will not obtain the same degree of visual distinction by varying the text face. Another way of putting this is that sans types are made and used to be noticed, while serif types are more often doing that crystal goblet thing.\n\n"
    },
    {
      "time": " 10.Oct.2003 1.15am",
      "content": "_\\> Juergen Kurz (Tim Gill's replacement at Quark) told   \nme at Seybold that QuarkXPress 7 will support both   \nUnicode and OpenType layout goodness._      \n   \nQuarkXPress 7? ![](http://web.archive.org/web/20070911195143im_/http:/www.typophile.com/forums/clipart/rofl.gif) When? In 2014?   \n   \nSorry, really couldn't help myself. Promises promises.   \nWhat a joke. ![:-)](http://web.archive.org/web/20070911195143im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 10.Oct.2003 1.33am",
      "content": "(John, thanks for your view. I think we already know that aspect but its not the only one. I just tried to pointed another aspect, and sorry to not to have been enough clear)\n\n"
    },
    {
      "time": " 10.Oct.2003 1.41am",
      "content": "John,   \n   \nDoes this mean plastic cups are more attractive than crystal goblets?   \n   \nCrystal Goblets, even by Beatrice Warde's definition stands out. Would you think not?   \n   \nDo I need Open Type to get these smiley faces. I think I could use one of them right here ( ).   \n   \nBut your point is well taken.   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": " 10.Oct.2003 2.48am",
      "content": "Speaking for myself, I always have the feeling that, while here are basically 10 preferred fonts for me, I try to give every new job or client a unique typeface, I had a situation where I had two clients with FFLetterGothic and almost died of boredom, especially as it is a somewhat limited typeface. I think you can do lots of jobs with, say, just ONE typeface -- Helvetica has proven that and Garamond would be another example :-) -- but I prefer to find something special for every client. So I'm really happy with having more and more sans and nowadays also more modern serifs that are all quite legible and clean but also have little details that differntiate them. The client rather often even does not notice this at all, but to me it makes a heck of a difference in the\n\n"
    },
    {
      "time": " 10.Oct.2003 7.46am",
      "content": "What can be really annoying for me (as type designer) is if all people on this earth who use Din all the time, have your level of expertise in type selection. That very worrying ;)   \n   \n   \n...   \nWhat I mean is that I don't think others users of Din have any type references at all. And a good wish to don't, all the time, use the same Din whatsoever the job they have to do.\n\n"
    },
    {
      "time": " 10.Oct.2003 12.48pm",
      "content": "Yes, JF, the myth is that the maestro plays the tin whistle better than the street-corner busker.\n\n"
    }
  ]
}
