{
  "id": "15165",
  "title": "Newsletter Logo Critique",
  "forum": "Design",
  "tags": [

  ],
  "content": "I recently designed a logo for an on-campus publication that will be circulated twice a semester to all the teachers at my school. The name for the publication is The Spotlight and for now it will be distributed in print with an online version coming in a few months. The audience is college professors and the focus of the newsletter is to inform them about how they can incorporate technology in their teaching. My school is fairly small and as a result so is the audience.\n\nAt this point in the logo design I’m not at liberty to make any major revisions. Still, I would like to make the best logo possible and so would appreciate your comments (even if they require major revision).\n\nOur first edition is going to print this Monday, so time is short. My main concern before the first printing is the kerning, particularly between the “li.” I originally had them touching, but I thought that reduced legibility too much. What do you think?\n\nAs a side note, print design is still quite foreign to me, so can anyone point me to some good tips or guidelines for designing newsletters and magazines? My typographic skill, while still on a beginner’s level, is fairly solid. I’ve read [Robert Bringhurst](http://web.archive.org/wiki/Robert%20Bringhurst)’s book, which taught me a lot, but are there any resources (particularly on the web) that focus more specifically on designing for newsletters, magazines, newspapers, etc.?\n\nThanks so much. I’m looking forward to your input.\n\n| Attachment | Size |\n| --- | --- |\n| [spotlight.png](http://web.archive.org/web/20060524213246/http:/typophile.com/files/spotlight.png) | 5.71 KB |\n\n",
  "author": "<a href=\"user/6256\" title=\"View user profile.\">Peter G.</a>",
  "time": "<br>",
  "uid": "6256",
  "comments": [
    {
      "time": " 16 September, 2005 - 1:53am",
      "content": "I would suggest some enlightenment, as your logo (it’s designed to bring the light of technology, eh?) looks a little bit too dogmatic, narrow, solidly dark and black to my eyes.\n\n"
    },
    {
      "time": " 16 September, 2005 - 4:32am",
      "content": "Sorry Peter, that has that early 70’s look when they kerned everything so tight they turned god into dog. As Stephen said it looks very dark and black and that might be because of the lack of breathing room between the characters. I seriously doubt the type designer ever imagined his/her work should have the characters crashed together like that. Its a good start, but a start.\n\n"
    },
    {
      "time": " 16 September, 2005 - 10:05am",
      "content": "No apologies necessary, Dan. That’s exactly the kind of help I need.\n\nHow’s [this](http://web.archive.org/web/20060524213246/http:/www.gurrydesign.com/misc/typophile_spotlight02.png \"view Logo #2\")? Still too dark?\n\n"
    },
    {
      "time": " 16 September, 2005 - 1:35pm",
      "content": "That is a world better. I think it works well for your newsletter. I think it will be well accepted. Good job\n\n"
    },
    {
      "time": " 20 September, 2005 - 5:21am",
      "content": "Peter-  \nI don’t know if this will be helpful or not, but a website I think is pretty good, particularly for those new to design or who make it just a small portion of their job is [Ideabook.](http://web.archive.org/web/20060524213246/http:/www.ideabook.com/) It’s put together by a designer named Chuck Green. Navigate through the site and you’ll find some great tips on clean, organized and thoughtful newsletter design, logo design, etc.  \nBest of luck.\n\n"
    },
    {
      "time": " 20 September, 2005 - 12:53pm",
      "content": "Thanks, Chuck, I’ll check it out.\n\n"
    }
  ]
}
