{
  "id": "15170",
  "title": "Linotype Free Font Management",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have been away for a bit, but haven’t seen this posted yet- sorry if it has been. This seems like a decent program- very nice for free!\n\n[http://www.linotype.com/fontexplorerX](http://web.archive.org/web/20080906132341/http:/www.linotype.com/fontexplorerX \"http://www.linotype.com/fontexplorerX\")\n\nOne fun note- the OSX version is 4.9mb the PC version is 148mb.\n\nR.K\n\n [‹ Roll Call: HOW Design Conference in Las Vegas](http://web.archive.org/web/20080906132341/http:/typophile.com/node/20425 \"Go to previous forum topic\") [Saul Bass and Associates (Book) ›](http://web.archive.org/web/20080906132341/http:/typophile.com/node/19564 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906132341/http://typophile.com/user/3513\" title=\"View user profile.\">rob keller</a>",
  "time": "<br>",
  "uid": "3513",
  "comments": [
    {
      "time": " 16.Sep.2005 6.44am",
      "content": "rob, see this: [http://typophile.com/node/15124](http://web.archive.org/web/20080906132341/http:/typophile.com/node/15124 \"http://typophile.com/node/15124\")\n\n"
    },
    {
      "time": " 16.Sep.2005 10.23am",
      "content": "nice, yeah I totally didn’t see that. Thanks, sorry for the repost.\n\nR.K\n\n"
    },
    {
      "time": " 16.Sep.2005 10.32am",
      "content": "Rob,\n\nThat’s the old PC version that is huge... the old Mac version is about the same size.\n\n"
    },
    {
      "time": " 17.Sep.2005 12.38am",
      "content": "The only similarity between the old FontExplorer and the new FontExplorer X is the name. FontExplorer X is not a new version of FontExplorer, but rather a new product.\n\nFontExplorer is an interactive to to help find specific Linotype fonts. FontExplorer X is a Font Management Application, with an integrated store feature. I know the name and the download size differences can be a little confusing :(\n\n"
    },
    {
      "time": " 17.Sep.2005 7.05pm",
      "content": "_The only similarity between the old FontExplorer and the new FontExplorer X is the name. FontExplorer X is not a new version of FontExplorer, but rather a new product._\n\nthat’s confusing... why didn’t they just call it iFonts? ;^P\n\n"
    },
    {
      "time": " 19.Sep.2005 8.30am",
      "content": "Font management in OS X has been a real sore spot for me and mt small creative studio. I have tried every solution out there, with limited success. I discovered and installed FontExplorer X yesterday morning. What a find! It is feature-packed, stable —and WORKS!\n\nI have noticed one problem, and I have emailed Linotype regarding this. I’m wondering if there is a cap on the number of fonts that can reside in the FontExplorer X library? My Library indicates 7742 font files and I’m seeing some Suitcase-like behavior (gasp!) from some of my imported sets. In the Preview pane I’m seeing a lot of “Not Available” messages being displayed. Interestingly enough, the frequency of these messages INCREASES as I view sets that have been added most recently. All of my fonts are organized by foundry, alphabetically, and were added to FontExplorer in order (Adobe, Bitstream, Emigre, FontFont, Linotype, etc). The LAST set, named Various, shows ALL of the fonts as “Not Avaialble.” The next set up, URW, shows MOST of them as being unavailable. This continues up the sets list until about midway. This leads me to believe that FontExplorer, at some point, has become unable to store any more font previews.\n\nI am assuming that it does indeed STORE previews rather than generating them on the fly; I can’t think of any other reason why it would be unable to show previews with such a pattern. Removing the last several sets, then re-importing one of the problem sets results in most of the previously “Not Available” previews in the set previewing just fine, which seems to support this assumption. From what I can determine, this behavior begins to become prevelant at around the 4500 to 5000 font file mark.\n\nCan anyone else with a large Library confirm this behavior?\n\n"
    },
    {
      "time": " 21.Sep.2005 5.50pm",
      "content": "TIP: I re-imported my sets with no other apps running or using system resources and had much better results. Let FontExplorer X do it’s thing and go do something else while it’s doing it. Worked for me.\n\nC\n\n"
    },
    {
      "time": " 21.Sep.2005 8.00pm",
      "content": "“I know the name and the download size differences can be a little confusing :(“\n\nThen why doesn’t Linotype ’know this’ and do something?\n\n"
    },
    {
      "time": " 22.Sep.2005 10.28pm",
      "content": "I don’t think that is that confusing, it is just the difference between Macs and PCs. It certainly isn’t always the case, but often times the PC version of an app is considerably larger.\n\nr.k\n\nI ♥ Macs\n\n"
    },
    {
      "time": " 2.Jun.2006 12.47pm",
      "content": "Anyone know when this comes out for windows?  \nIs this better than The Font Thing? (so far the best i’ve found for windows) Quick and enough features. If so what are the benefits of this over the Font Thing?\n\n"
    },
    {
      "time": " 2.Jun.2006 1.29pm",
      "content": "I have no knowledge of Windows but I will say that I’ve been using it in a production environment for 2 months or so and it has responded to my situation better than Font Agent Pro or Suitcase…\n\npeace\n\n"
    },
    {
      "time": " 2.Jun.2006 1.35pm",
      "content": "The font thing really sucks compared to FEX. However, FEX isn’t currently available for Windows. One big disadvantage of TheFontThing is that you can’t preview anything other that TTF fonts. I suspect FEX will do much better in this regard.\n\n"
    },
    {
      "time": " 2.Jun.2006 4.05pm",
      "content": "ahh thanks. Guess i will just have to wait for FEX.\n\n"
    },
    {
      "time": " 2.Jun.2006 4.37pm",
      "content": "you and me both. i’m afraid it could be a long wait, though )^;\n\n"
    },
    {
      "time": " 2.Jun.2006 5.25pm",
      "content": "Unfortunately, it will still take awhile for the Windows version. Rest assured that it is being worked on. Sorry I can’t bring better news :(\n\n"
    }
  ]
}
