{
  "id": "15190",
  "title": "Logo for a house mucis organization",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello everybody.\n\nCould you please tell me your opionions and critiques about this logo?  \nIt is made for a Bulgarian organization, which is focused on house music.  \nTheir site has a forum, a lot of information about parties and articles about the mucis.  \nYou could say that they are sort of lika a serious fan club...  \nI decided that this is (so far) my best idea for this project, but I am interested to know your opinions as well.\n\nIn a general outline of a house (word-play), I’ve drawn a prespective view of a music speaker, in order to establish a connection with the music. On the other panel of the speaker I’ve drawn the bold letter “H”, to “suggest” the name of the “House” music.  \nThe logo has to be both serious to a certain degree, and fun. This is why I’ve used triangular element as well as a square.\n\nThank you in advance for your help!  \nCheers.\n\n| Attachment | Size |\n| --- | --- |\n| [Houselogos[engl].jpg](http://web.archive.org/web/20080408045555/http:/typophile.com/files/Houselogos%5Bengl%5D.jpg) | 51.06 KB |\n\n [‹ Questioning existing ID for my business](http://web.archive.org/web/20080408045555/http:/typophile.com/node/15365 \"Go to previous forum topic\") [Self-Identity ›](http://web.archive.org/web/20080408045555/http:/typophile.com/node/15109 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080408045555/http://typophile.com/user/9302\" title=\"View user profile.\">Dimmy</a>",
  "time": "<br>",
  "uid": "9302",
  "comments": [
    {
      "time": " 17.Sep.2005 9.13am",
      "content": "That looks good. It is doing everything you said it should do. The fusion of a house shape and the perspective of the speakers works well, and it feels both a little fun and serious.\n\nThe only thing that bugs me is the concentric rings for the speakers in your black and white version. The line weights are so thin and so close together that it creates a lot of tension. This is especially true for the top group of circles.\n\nThe tension doesn’t happen in your color version because 1) you have less rings, 2) the line weight is heavier, and 3) it is grey instead of stark black and white.\n\nMaybe use less circles in your black and white version?\n\n"
    },
    {
      "time": " 17.Sep.2005 10.07am",
      "content": "Thank you for your time, bluealgae!\n\nYes, the detail might be a little too much in the speaker part.  \nI will try to simplyfy the detail, withou losing the “shape” of the speakers. This way in the black and white version as specialy, I’ll elminate the problem with the thin lines close to each other...  \nThank you for your advice :)\n\n"
    },
    {
      "time": " 18.Sep.2005 1.50am",
      "content": "They are working well, the cone perspective of the speakers needs a bit of work, at the moment they look a bit like flat circles on the side rather than indented. I get the feeling that you should try 3 point perspective, the sides are parallel at the moment if the bottom narrowed, you could get a more monumental feeling.  \nTim\n\n"
    },
    {
      "time": " 18.Sep.2005 4.41am",
      "content": "The speakers currently make the shape look like a box camera. Loose the circle shapes that make them look like lenses. I also suggest testing the logo in its smallest size you will use it and see if the speakers hold up as speakers.\n\n"
    },
    {
      "time": " 21.Sep.2005 11.09am",
      "content": "Thank you all for your time.\n\nI took advantage of your advices, and here are the changes I’ve made.  \nI personaly like it better now.\n\n[http://i13.photobucket.com/albums/a269/ByteSize/Logov2.jpg](http://web.archive.org/web/20080408045555/http:/i13.photobucket.com/albums/a269/ByteSize/Logov2.jpg \"http://i13.photobucket.com/albums/a269/ByteSize/Logov2.jpg\")\n\ntimd, I did try a 3 point prospective, but the house siluet started to look more like a tribal hut :)\n\nC&C are welcome :)\n\n"
    },
    {
      "time": " 21.Sep.2005 2.21pm",
      "content": "My only comment is the mark gets lost in smaller sizes. Try using just the name and the speaker circles that you modified. Nice stuff\n\n"
    },
    {
      "time": " 22.Sep.2005 2.50am",
      "content": "A good improvement, the speakers are much clearer, it might be my monitor but the grey is looking overall very dark, you might want to introduce more contrast in the tints. And the stroke on the right of the H isn’t reflected on the left (the leading edge), I think on the colour version you could do without the stroke. Definitely almost there.\n\nA tribal hut would definitely lose impact:)\n\nTim\n\n"
    },
    {
      "time": " 22.Sep.2005 12.33pm",
      "content": "Thanks for the advices.  \nI’ll deffinetly look into them, and I will post the next update (hopefuly) soon, if I’m not to busy with some other projects ...\n\nI have one question though.  \ndan weaver, what do you mean by “the mark gets lost”?  \nDo you mean that the details are lost?  \nAnd also: Do you suggest that I should use the “old” (the once from version one) cyrcles instead, in the smaller versions of the logo?\n\n"
    }
  ]
}
