{
  "id": "15218",
  "title": "Baskerville",
  "forum": "Design",
  "tags": [

  ],
  "content": "ohnland says at Mon, 2005-09-19 06:50:  \nI want a good Baskerville and am undecided between [Storm](http://web.archive.org/web/20071211090225/http:/www.typophile.com/wiki/Storm%252BType%252BFoundry)’s John Baskerville and [Fountain](http://web.archive.org/web/20071211090225/http:/www.typophile.com/wiki/Fountain)’s 1757. I am tilted toward Storm, as it does not botyher with bold, which I never use, and purports to be close to the original. Any thoughts?\n\n [‹ How to make small caps in FontLab?](http://web.archive.org/web/20071211090225/http:/www.typophile.com/node/14228 \"Go to previous forum topic\") [How to copy tables in InDesign? ›](http://web.archive.org/web/20071211090225/http:/www.typophile.com/node/15283 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071211090225/http://www.typophile.com/user/9327\" title=\"View user profile.\">johnland</a>",
  "time": "<br>",
  "uid": "9327",
  "comments": [
    {
      "time": " 19.Sep.2005 8.24am",
      "content": "[http://www.typophile.com/node/14322](http://web.archive.org/web/20071211090225/http:/www.typophile.com/node/14322 \"http://www.typophile.com/node/14322\")\n\nThis earlier discussion might help  \nTim\n\n"
    },
    {
      "time": " 19.Sep.2005 9.44am",
      "content": "Thanks Tim  \nI had seen this discussion, but not really interested in New Baskerville.\n\n"
    },
    {
      "time": " 19.Sep.2005 9.46am",
      "content": "One thing I’ve recently realized about Fountain’s version is that it has the only really good “g”\\*: it’s the most robust, functional form; and I actually think it’s what JB probably intended.\n\n\\* So far...\n\nhhp\n\n"
    },
    {
      "time": " 19.Sep.2005 11.21am",
      "content": "Thanks, Brant, I’ll go for it. Actually, I am pleased you say this, as the Storm version comes packaged with the bold variants (as one package). If you want smallcaps, you have to buy a whole other package. Fountain just has roman, italc, smallcaps. As I don’t like bold variants, but want smallcaps, this suits me fine\n\n"
    },
    {
      "time": " 19.Sep.2005 11.34am",
      "content": "That’s Shram to you. ;-)\n\nhhp\n\n"
    },
    {
      "time": " 19.Sep.2005 11.36am",
      "content": "Does this mean that I can call you Shram from now on Hrant?\n\nAnd I’m surprised that you didn’t recommend [Mrs Eaves](http://web.archive.org/web/20071211090225/http:/www.typophile.com/wiki/Mrs%252BEaves). ;-D\n\n"
    },
    {
      "time": " 19.Sep.2005 11.43am",
      "content": "BTW, it just hit me that if you double that  \n“r” it means “I peed” in (Eastern) Armenian!\n\nAnd man do I wish somebody would respace that chick.\n\nhhp\n\n"
    },
    {
      "time": " 19.Sep.2005 1.31pm",
      "content": "Mrs Eaves is not really a Baskerville, more a play on Baskerville. Also, it makes eye-wrenching reading for any body of text,other than a short one. No, I go with Fountain\n\n"
    },
    {
      "time": " 19.Sep.2005 1.35pm",
      "content": "John, Dan was actually teasing, since he knows I feel the same as you apparently do about Mrs Eaves... I mean the font. Never met the lady. Although I have to doubt she was as loose.\n\nhhp\n\n"
    },
    {
      "time": " 20.Sep.2005 2.27am",
      "content": "Oh, seems I have a lot to learn about the idiom around here! my street cred is clearly 0 !!\n\n"
    },
    {
      "time": " 20.Sep.2005 8.36am",
      "content": "John, if you have time, would you mind posting a text setting PDF sample of Baskerville 1757? I’d really like to print a sample and check it out — even compare it to Storm’s (which you have to admit is pretty damn awesome...)\n\n"
    },
    {
      "time": " 21.Sep.2005 1.03am",
      "content": "Addison\n\nThis is the link. Unlike Storm, there isn’t a pdf - well, I can’t find it - but this text setting gives some idea. I bought the Fountain and think it excellent. I am impressed with its simplicity and that it does not come with anachronistic bold variants - which I hate anyway! It has great ligatures, too.\n\nI would like to know what you think of it.\n\n[http://www.fountain.nu/catalogue/baskerville1757.asp](http://web.archive.org/web/20071211090225/http:/www.fountain.nu/catalogue/baskerville1757.asp \"http://www.fountain.nu/catalogue/baskerville1757.asp\")\n\n"
    },
    {
      "time": " 21.Sep.2005 6.03am",
      "content": "Addison\n\nI should also say that I havent work out to post an attacment or file to the site - can see others have, and that the pdf converter I tried did not keep the font as Baskerville, so if you can guide me on both counts, I will, of course post a pdf for you.\n\n"
    },
    {
      "time": " 21.Sep.2005 7.47am",
      "content": "The PDF creation depends on what software you’re using (Quark, InDesign, etc...). As far as uploading, I’m not sure how to do it since the site changed — I’ll have to look myself.\n\nI’ve been keeping up with Lars Bergquist (the designer of Baskerville 1757) for a while — his historical motivations keep me interested in his work. Bergquist’s Baskerville seems a little stiff compared to Storm’s, but besides the small showing in Indie Fonts 1, I haven’t seen a printed sample of Baskerville 1757. I’ve seen Storm’s version in a printed specimen and it’s beautiful — that’s why I’d like to compare the two.\n\n"
    },
    {
      "time": " 21.Sep.2005 7.56am",
      "content": "But to me stiffness is an integral part of Baskerville.\n\nhhp\n\n"
    },
    {
      "time": " 21.Sep.2005 8.10am",
      "content": "You may be right, Hrant — honestly, I’ve only seen reproductions of the original Baskerville in books. It may also be the digital designer’s influence. All of Storm’s work seems to have an organic quality — no straight lines and such.\n\n"
    },
    {
      "time": " 21.Sep.2005 8.24am",
      "content": "Here’s an “assembled” [Baskerville comparison](http://web.archive.org/web/20071211090225/http:/www.addisonhall.com/images/baskerville-comparison.gif) for anyone interested.\n\n"
    },
    {
      "time": " 21.Sep.2005 11.53am",
      "content": "How did you do the upload? Do tell!\n\nAlso, I do agree with you about the stiffness, but also with Hrant that that is part of the Baskerville. That is never the end of the story: it’s also a matter of interpretation. We are no longer in 1757. I’m starting to think period v modern instruments in classical music. The same argument?\n\nNevertheless, I do like the Fountain. it’s immensely readable and, despite that stiffness - surely part of the appeal of Bodoni, for example? - a great face.\n\nBut still, do have a look at the new Bembo Book, my ideal Old face!\n\n"
    },
    {
      "time": " 21.Sep.2005 12.13pm",
      "content": "Good point, John (and Hrant) — I may have to get Fountain’s Baskerville and try it out for myself.\n\nI had to upload the image to my own web server. I’m still not sure how attachments work on the new forum.\n\n"
    },
    {
      "time": " 21.Sep.2005 1.00pm",
      "content": "\\> surely part of the appeal of Bodoni, for example?\n\nIn fact Giambatista Bodoni embarked on his  \nown typographic innovation due precisely to  \nexposure to JB’s stuff.\n\nhhp\n\n"
    },
    {
      "time": " 21.Sep.2005 3.16pm",
      "content": "“I want a good Baskerville...”\n\nSo, what’s it for?\n\n"
    },
    {
      "time": " 22.Sep.2005 3.38am",
      "content": "I bought the Fountain - as implied by my answer to the flip suggestion I might Mrs Eaves - it is for text work, and feeling the lack of a classic typeface in my collection!\n\n"
    },
    {
      "time": " 22.Sep.2005 3.42am",
      "content": "Hrant,\n\nWould like your view on three faces.\n\n1) Sabon Next. I have a pdf of this and its also on typography book.It looks very, very good to me.\n\n2) Plantin. A good workhorse and inifinitely preferable to Times, but which version?\n\n3) I love Weiss, yet nobody ever seems to mention it as a favourite. Why not? Is it just me?\n\n"
    },
    {
      "time": " 22.Sep.2005 4.51am",
      "content": "Are they really selling the whole familly of Baskerville 1757 for $79?\n\n"
    },
    {
      "time": " 22.Sep.2005 5.18am",
      "content": "actually, it’s $69 whe you get to the checkout, but you the whole family comprises:  \nroman  \nitalic  \nsmallcaps  \nligatures of roman and italic.\n\n"
    },
    {
      "time": " 22.Sep.2005 5.41am",
      "content": "Is this really cheap or is it standard price in the industry? — sorry for the stupid questions, I am new to all this!\n\n"
    },
    {
      "time": " 22.Sep.2005 6.52am",
      "content": "Sounds rather inexpensive for a quality Baskerville. Seems like a good find, though. Baskerville 1757 is a great face.\n\nInteresting comparison:\n\nBaskerville 1757 family for $69.  \nTEFF Trinite family for $3500 (USD), or roughly 3000 Euros.\n\nOf course, you get more with Trinite, but even a single weight will cost you plenty.\n\nCongrats on the Baskerville 1757, by the way. I might just buy that as well. It would be a nice addition to my collection.\n\n"
    },
    {
      "time": " 22.Sep.2005 7.06am",
      "content": "I think it is quite cheap. But some excellent fonts are. Look at the new LTC Caslon, which I much prefer to Adobe, or the (Goudy) LTC Garamont or Deepdene. Also great value is the new LTC Goudy Oldstyle\n\n"
    },
    {
      "time": " 22.Sep.2005 7.18am",
      "content": "All of Lars Bergquist’s fonts are reasonably priced. His work is distributed through [Fountain](http://web.archive.org/web/20071211090225/http:/www.fountain.com/), [PSY/OPS](http://web.archive.org/web/20071211090225/http:/www.psyops.com/), and [The Type Quarry](http://web.archive.org/web/20071211090225/http:/www.typequarry.com/). Here’s his [listing from Identifont](http://web.archive.org/web/20071211090225/http:/www.identifont.com/show?5KB).\n\nI’ve used the [Mountaineer Kit](http://web.archive.org/web/20071211090225/http:/www.fountain.nu/catalogue/mountaineer_kit.asp) for a couple of small pieces — it’s good stuff.\n\n"
    },
    {
      "time": " 22.Sep.2005 7.57am",
      "content": "Great links to cheap-_ish_ fonts. Have you got anymore? I am about to do some font shopping.\n\n"
    },
    {
      "time": " 22.Sep.2005 8.15am",
      "content": "I wouldn’t call them cheap, but two other foundries I like that offer great quality fonts at reasonable prices are [Mark Simonson](http://web.archive.org/web/20071211090225/http:/www.ms-studio.com/) and [DSType](http://web.archive.org/web/20071211090225/http:/www.dstype.com/). I’m sure there are others, but these are two I like.\n\nAs John stated above, the new Lanston stuff from P22 are great values as well.\n\n"
    },
    {
      "time": " 22.Sep.2005 9.10am",
      "content": "\\> Would like your view on three faces.\n\nPlease:  \n1) New thread.  \n2) Ask everybody.\n\nhhp\n\n"
    }
  ]
}
