{
  "id": "15215",
  "title": "Adobe Paragraph Composer",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nIn InDesign there are two options in the justification window; adobe paragraph composer and adobe single-line compser.  \nMy guide books recommands me to use the first one but it doesn't tell me why. I don't like to be told what to do if I don't understand why I am doing it. Can you guys tell me what this is all about?\n\nCheers\n\n",
  "author": "sebsan",
  "time": "19 Sep 2005 — 2:43am",
  "uid": "8785",
  "comments": [
    {
      "time": "19 Sep 2005 — 2:55am",
      "content": "As I understand it, the single-line composer does the best it can justifying each line. Having done that, it then justifies the next line to the best _it_ can be given what has gone before, and so forth.\n\nBut better spacing overall can often be achieved by considering the paragraph as a whole. For instance, the \"best\" justification for line 1 (considered alone) may lead to very bad breaks for lines 2 and 3. It may be that by having a slightly worse break for line 1, you can have much better breaks for lines 2 and 3, and the overall effect will be better. The paragraph composer does that: it looks at the paragraph as a whole and, as it were, notices \"If I break this line here I get terrible spacing later; maybe it would be better to break it there instead, and improve the spacing of later lines.\"\n\nThe advice to use the paragraph composer generally is therefore sound: overall it should result in better (more intelligently) justified text.\n\n"
    },
    {
      "time": "19 Sep 2005 — 3:42am",
      "content": "Thanks Paul, that was very clear.\n\n"
    },
    {
      "time": "23 Sep 2005 — 5:19am",
      "content": "So doesn't that raise the (maybe silly) question: what's the point of having the single-line composer?\n\nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "23 Sep 2005 — 6:08am",
      "content": "Indeed Dave, indeed! Maybe worth a new thread since this one is getting old.\n\n"
    },
    {
      "time": "23 Sep 2005 — 10:03am",
      "content": "<cite>what’s the point of having the single-line composer?</cite>\n\n1. It's faster. In this day of 2GHz+ processors, that's _really_ unlikely to matter much.\n\n2. The results are a bit more predictable when you're editing text. In particular, when you make an edit at the very end of the paragraph, it won't change much at all. The whole-paragraph option could easily reflow the whole thing. If one were using InDesign to key in large pieces of text (as opposed to importing them from elsewhere), that could be distracting.\n\nSo, bottom line, for the vast majority of users, there's no good reason at all. But software developers _love_ leaving in options as opposed to making up their mind about what's the best thing to do.\n\n"
    },
    {
      "time": "23 Sep 2005 — 10:10am",
      "content": "It seems to me though that software is <cite>always</cite> pushing the hardware's limits (maybe due to a lazy attitude towards code optimization, and/or guided by a desire for eventual/perpetual upgrade fees...) and I can think of two recent example: InDesign's somewhat brutish (but necessary, performace-wise) use of a bilinear algorirthm for optical spacing, instead of a smooth (ideally quadratic, or maybe parabolic?) curve; and MS forsaking vertical hinting in CT (until Longhorn/Vista).\n\nhhp\n\n"
    },
    {
      "time": "23 Sep 2005 — 5:30pm",
      "content": "Actually, I use the single-line composer a fair bit. For finicky layout problems, the last thing I want is to be fighting with a computer that is making decisions for me. Single line composer is really useful when I need to make a course description fit onto a certain number of lines. With paragraph composer on it often ignores the discretionary hyphens I want it to use; it's difficult to force the paragraph composer to do what you want. So when it's important that I squeeze that last word onto the line above, I'll try the single line composer.\n\nKristina.\n\n"
    },
    {
      "time": "24 Sep 2005 — 12:52am",
      "content": "Thanks Kristina, thats useful information. I was always battling with discretionary hyphens and word squeezing. Now I know wht to do.  \nCheers\n\n"
    }
  ]
}
