{
  "id": "15223",
  "title": "How do designers keep track of the IP they license?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "During Tiffany Wardle's talk on font EULAs (ATypI TypeTech, Sep 15) I mentioned a diagram I'd come across showing how one organization deals with the intellectual property they used in a single project. It's not about font licenses, but shows how tricky it can be to keep track of what you're allowed to do with the stuff you license. I've now received permission to show the diagram to others:\n\n[http://www.lorp.org/font-eula/uk\\_flood\\_map\\_ip\\_hierarchy.png](http://web.archive.org/web/20131014001444/http:/www.lorp.org/font-eula/uk_flood_map_ip_hierarchy.png \"http://www.lorp.org/font-eula/uk\\_flood\\_map\\_ip\\_hierarchy.png\")\n\nSteve Coupe, the presenter of the talk during which this slide was shown, commented how keeping track of the IP was too complex just to \"keep in your head\". I'd be interested to hear people's comments on how this may relate to organizations and individual graphic designers licensing type.\n\nThe project the diagram refers to is the UK Flood Map, an interactive map on the website of the UK Environment Agency:\n\n[http://www.environment-agency.gov.uk/subjects/flood/826674/829803/?versi...](http://web.archive.org/web/20131014001444/http:/www.environment-agency.gov.uk/subjects/flood/826674/829803/?version=1&lang=_e \"http://www.environment-agency.gov.uk/subjects/flood/826674/829803/?version=1&lang=\\_e\")\n\nClick on Flood Map to see if you're at risk!\n\n-- Laurence\n\n| Attachment | Size |\n| --- | --- |\n| [uk\\_flood\\_map\\_ip\\_hierarchy.png](http://web.archive.org/web/20131014001444/http:/typophile.com/files/uk_flood_map_ip_hierarchy.png) | 346.2 KB |\n\n",
  "author": "lorp",
  "time": "19 Sep 2005 — 8:58am",
  "uid": "2073",
  "comments": [
    {
      "time": "19 Sep 2005 — 4:47pm",
      "content": "Laurence, that is very scary. I assume that given time those that must can read that map without too much difficulty. However, the key is the getting of the time. Anyone new to that system must hate it.\n\nAre you keen to make a sample image for EULAs? Do you think something this complicated is really necessary? I'd really like to see what you are thinking, or maybe how you think this type of chart would translate over to keeping track of IP.\n\n"
    },
    {
      "time": "20 Sep 2005 — 1:30am",
      "content": "The idea is not to have one of these diagrams per EULA. The diagram shows how the UKEA kept track of IP in one web project. Each box represents a license agreement. The arrows show how the restrictions cascade down to the final systems:  \n\\* the red Flood Map box (that's the main web project)  \n\\* the yellow NaFRA 2004 Foodline Database box  \n\\* the yellow NaFRA 2004 Postcode Database box  \n\\* the yellow Flood Watch Areas box.\n\nI'll see if I can make an example diagram for a real-sounding design project, which will make more sense and perhaps be less scary!\n\n"
    },
    {
      "time": "23 Sep 2005 — 12:29pm",
      "content": "thanks, lorp. -- i like the idea of taking the graph from my aricle a step further. do you think it oversimplifies? i realize the graph and your chart are to different things. could they integrate somehow?\n\n"
    },
    {
      "time": "31 Oct 2005 — 8:16am",
      "content": "Thanks lorp, I remember you mentioning this diagram. Is this unusual practise for this field, or would we expect, say GoogleEarth to have a similar diagram?\n\nI know that the company I word for (e-learning for galleries, museums, libraries and archives) has a nightmare tracking licence dependencies.\n\nIf there was a standard interface for EULA properties, independant of what the object the license covers, that would be neat :) Then the property files could just be throw into a folder together and we could let a program map the relationships for us.\n\n"
    }
  ]
}
