{
  "id": "15231",
  "title": "Village announce two newest members: Sibylle Hagmann and Hugo d'Alte.",
  "forum": "Home",
  "tags": [

  ],
  "content": "Hi!  \nit is with great pride and pleasure that we announce two new members of our family: Sibylle Hagmann of Kontour, and Hugo d’Alte, whose work is now being published by Thirstype.\n\n/  \nSibylle Hagmann is the tenth member of the Village co-op; she is a graphic and type designer and design educator born in Switzerland, educated in California, and living in Houston Texas with her husband and children. Sibylle is best known to the world for her Cholla typeface; she was also asked to participate in the University of Minnesota’s “Twin Cities” type competition.\n\nOdile will be the first type family released under the Kontour label, and it is an amazing and beautiful piece of work; a contemporary serif design with intriguing interior lines and angles. You can see a preview of the type at the Kontour page of vllg.com: http://vllg.com/Kontour/Odile/Example+About/\n\n/  \nHugo d’Alte has joined Thirstype’s ranks with his fantastic Kaas typeface, a geometric blackletter covering extended Latin, Cyrillic, and Hebrew. The face blends post-modern irony with genuine historical dilligence. The huge OpenType glyph table contains titling capitals, “latin” and geometric numerals, and a pan-European collection of accents. http://vllg.com/Thirstype/Kaas/mudTyper+Weights/\n\nHugo is even more peripatetic than Sibylle: Born in Portugal, educated at KABK in the Netherlands, and living with his wife and baby boy Gustavo in Helsinki Finland. (This makes Hugo the travel champion of Village.)\n\n/  \nWelcome to Sibylle and Hugo.\n\n//  \nYes, that’s our ad in “Eye” #57.\n\n///  \nDuring September, we’re giving $2 from every sale to the American Red Cross to assist in Hurricane Katrina relief. Please help us help.\n\n////  \nComing soon: Village t-shirts! We have sold out of our first run of ts, created especially for TypeCon in July, so we’re making some more. Please drop us a line if you might be interested. (We use American Apparel sweatshop-free ts in mens’ and womens’ styles.)\n\n/////  \nOnly 51 weeks until ATypI 2006 in Lisbon Portugal. Join Mario Feliciano (and many of us) in his beautiful city to talk about Typographical Journeys.\n\nThanks for reading.  \nVillage\n\n/ / / / / / / / / / / / /\n\n[http://vllg.com/](http://web.archive.org/web/20060329210659/http:/vllg.com/)\n\n1.646.654.1506 / phone + fax  \n1.917.547.3826 / alternate phone\n\n168 Second Ave #253 / New York NY 10003 USA\n\n/ / / / / / / / / / / / /\n\n",
  "author": "Miss Tiffany : 19 September, 2005 - 10:49pm",
  "time": "",
  "uid": null,
  "comments": [

  ]
}
