{
  "id": "15234",
  "title": "(x) classic serif face from Peter Saville piece - Bembo {Yves}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Thanks for any help, its from a Saville piece, beautiful font.\n\n| Attachment | Size |\n| --- | --- |\n| [font.jpg](http://web.archive.org/web/20101015090026/http:/typophile.com/files/font_10.jpg) | 193.76 KB |\n\n",
  "author": "<a href=\"/web/20101015090026/http://typophile.com/user/1394\" title=\"View user profile.\">david_leonard</a>",
  "time": "<br>",
  "uid": "1394",
  "comments": [
    {
      "time": "",
      "content": "The very classic, very classy Bembo.\n\n"
    },
    {
      "time": "",
      "content": "Bembo has just been re-done by Robin Nicholas for Monotype - called Bembo Book. It is a huge improvement on what was a poor digitization.. Looks terrific\n\n"
    },
    {
      "time": "",
      "content": "Look at the lower case g in the sample it doesnt have the Bembo closed loop. We are looking at a mutant Bembo here perhaps its Bemberville\n\n"
    },
    {
      "time": "",
      "content": "Thanks everyone.\n\n"
    },
    {
      "time": "",
      "content": "A famous Italian scholar and Cardinal, b. of a noble family at Venice, 20 May, 1470; d. at Rome, 18 January, 1547. He was the son of Bernardo Bembo, whose enthusiasm for Italian literature led him to raise a monument to Dante at Ravenna. His early education was received at Florence. He afterwards studied Greek under Lascaris at Messina and philosophy under Pomponazzo at Padua. After spending some time at the court of Ferrara, where he met Lucrezia Borgia, with whom he maintained a Platonic friendship for many years, he went in 1506 to Urbino, where he became the leading figure among the brilliant group of men of wit and culture gathered about the court. In 1512 he accompanied his intimate friend, Giuliano de' Medici, to Rome, where a short time afterwards he was appointed secretary to Pope Leo X. He remained at Rome for eight years, enjoying the society of many distinguished men and loved and admired by all who knew him. There he became enamoured of the beautiful Morosina. It was at her urgent solicitation that Bembo, in 1520, on the death of Leo X, withdrew from public affairs and retired with his health impaired by severe sickness to Padua, where he lived in ease and elegance, devoting himself to literary pursuits and the society of his learned friends. Here he collected an extensive library and formed a rich museum of medals and antiquities. His Paduan retreat became the gathering-place of all the most cultured and most scholarly men in Italy. In 1529 he accepted the office of historiographer of the republic of Venice, and shortly afterwards was appointed librarian of St. Mark's. In 1539 Pope Paul III recalled him to Rome and conferred on him the cardinal's hat. From the time of Bembo's ecclesiastical preferment there was a marked change in his conduct. Heretofore his life had been anything but edifying — in fact it had been more pagan than Christian. But now he renounced the study of the classics and applied himself chiefly to the study of the Fathers and the Holy Scriptures. Two years after he was raised to the cardinalate, he was made Bishop of Gubbio, and still later he received the Bishopric of Bergamo. He died more admired and lamented than any man of letters of his time and was buried not far from Pope Leo in the Church of the Minerva.\n\nBembo was a thorough master of elegant diction. He possessed beyond any contemporary the formal perfection of style, both in Latin and Italian, demanded by the age in which he lived. In his Latin writings it was his aim to imitate as closely as possible the style of Cicero. His letters were masterpieces of Latin style and of the art of letter-writing. He is said to have passed his compositions through numerous portfolios, revising them in each one of them. Bembo's works include a history of Venice, poems, dialogues, criticisms and letters. The most important are: \"Rerum Veneticarum Libri XII\" (1551), a history of Venice covering the period from 1487 to 1513, originally published in Latin, but afterwards translated by the author into Italian; \"Gli Asolani\" (Venice, 1505), a dialogue in Italian on Platonic love, composed in imitation of Cicero's Tusculan Disputations, and dedicated to Lucrezia Borgia; \"Le Prose\", a short treatise on the Italian language; \"Le Rime\" (Venice, 1530); \"Carmina\" (Venice, 1533), a collection of Latin poems; and several volumes of letters, written in Latin. Besides these original works he edited the Italian poems of Petrarch, printed by Aldus (1501), and the \"Terze rime\" of Dante (1502). His collected works were published at Venice in four volumes in 1729.\n\n"
    }
  ]
}
