{
  "id": "15252",
  "title": "The Letterheads Ltd",
  "forum": "Design",
  "tags": [

  ],
  "content": "Kia ora folks. It has been a long and gruelling process, but my business partner and I have formed a graphic design company right here in New Zealand, called The Letterheads. (We are aware of the existence of [these people](http://web.archive.org/web/20060524213301/http:/www.letterhead.com/), and even enquired about the purchase of the domain name. However, US $20,000 is a bit too much)\n\n[So here is our website](http://web.archive.org/web/20060524213301/http:/www.theletterheads.co.nz/). We would be very appreciative of your criticism!\n\nKa kite.  \nKris.\n\n",
  "author": "<a href=\"user/1519\" title=\"View user profile.\">kris</a>",
  "time": "<br>",
  "uid": "1519",
  "comments": [
    {
      "time": " 20 September, 2005 - 9:17pm",
      "content": "I like it - a lot! Fresh, spirited, competent. Kudos.\n\nhhp\n\n"
    },
    {
      "time": " 20 September, 2005 - 9:37pm",
      "content": "Strong color palette.\n\nWhere’s your rss feed?\n\n"
    },
    {
      "time": " 20 September, 2005 - 10:09pm",
      "content": "Now **that’s** a nice change from tiny type.\n\nWay to go guys, and good luck in your new venture.\n\nJon\n\n"
    },
    {
      "time": " 21 September, 2005 - 6:49am",
      "content": "Beautiful. Ever so faintly reminiscent of Typophile.com.\n\nYour colour choice is excellent.\n\n"
    },
    {
      "time": " 21 September, 2005 - 9:34am",
      "content": "I am astonished how well Verdana works with Quadraat Sans – good work!\n\n"
    },
    {
      "time": " 21 September, 2005 - 10:13am",
      "content": "Refreshing and inviting. But I do have a concern about about the focus of the site. If your purpose is to advertise your graphic design, not your (wonderful) type, then the designs rather than your type should be more up front. Currently your portfolio of graphic design work is two layers deep in a drop down box that isn’t even labeled ‘portfolio’. I think the portfolio would be better moved up in the visual and information design hierarchy.\n\n"
    },
    {
      "time": " 21 September, 2005 - 2:11pm",
      "content": "Wow, thanks guys! We are tuly appreciative of your comments. I would get an rss feed up and running, but I don’t really know how nor do I have that much to say. I struggle enough with the darn css to get the rss going!\n\nThanks for the structural insight, William. There has been mention of one other user who missed it entirely, which is a glaringly obvious mistake in our design. Hopefully it will be rectified soon.\n\n"
    }
  ]
}
