{
  "id": "15269",
  "title": "Old Emerson Typeface",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm looking for everything/anything on the  \nEmerson face (originally made in the 1930s).\n\nhhp\n\n",
  "author": "hrant",
  "time": "21 Sep 2005 — 1:24pm",
  "uid": "1250",
  "comments": [
    {
      "time": "21 Sep 2005 — 2:24pm",
      "content": "Hrant:  \nYou've read Blumenthal's _Typographic Years_, right?\n\nFWIW, there's a small showing in _An Atlas of Typeforms_ (Sutton and Bartram).\n\nI suppose you want something a bit more definitive.\n\n"
    },
    {
      "time": "22 Sep 2005 — 9:29am",
      "content": "\\> You’ve read Blumenthal’s Typographic Years, right?\n\n{Blush}  \nBut UCLA has it, so I'll get it soon.\n\nI saw the Atlas thing, plus the Jaspert entry. There's also something in Consuegra's \"American Type Design and Designers\". Since Atlas says it's an \"original\" design, I don't know if I'll find what I'm looking for: Blumenthal's possible inspirations for that amazing \"a\" and the hybrid numerals (the earliest example I've found so far - ATF Garamond's are way too mild to count for me).\n\nhhp\n\n"
    },
    {
      "time": "22 Sep 2005 — 1:49pm",
      "content": "Actually, there's not all that much about the design itself in _Typographic Years_, but there are a few examples of it in use.\n\n"
    },
    {
      "time": "23 Sep 2005 — 12:00am",
      "content": "There's also a chapter on Spiral / Emerson in [American Proprietary Typefaces](http://web.archive.org/web/20131016195335/http:/typophile.com/wiki/American%20Proprietary%20Typefaces). Recommended.\n\n"
    },
    {
      "time": "23 Sep 2005 — 12:09am",
      "content": "Does it say anything about what might have inspired Blumenthal?\n\nhhp\n\n"
    },
    {
      "time": "23 Sep 2005 — 10:55am",
      "content": "Hrant\n\nBeatrice Warde (with additions by John Dreyfus in 1984) did an analysis of the various Monotype text typefaces in, I think, the Monotype Recorder (1960s?). I have a copy of Monotype Composition Faces that was put out by Harold Berliner's Typefoundry that, as far as I can understand it, replicates the Warde work.\n\nIt gives a bit of information about the origins, history, and use of the various faces, showing text settings using a page from The Crystal Goblet as a template. Each page has a sidebar of microtypographic showings (likely the Dreyfus contribution).\n\nEmerson is included. To quote, \"one of a number of 20th-century faces which have been designed especially to meet the demands of modern printing processes and paper surfaces.\" This was a concern promoted by Warde in her later writings. There were a number of her studies, published in fugitive sources, that have never been compiled.\n\nGerald\n\n"
    },
    {
      "time": "23 Sep 2005 — 10:59am",
      "content": "Thanks Gerald.  \nDo any of those sources provide particularly good/complete print samples?\n\nhhp\n\n"
    },
    {
      "time": "23 Sep 2005 — 7:30pm",
      "content": "Hrant\n\nI've got a specimen of it that shows the full character set in 10 pt plus text settings in 8, 10, 11, 12, 14, 18, and display setting in 24. According to the sheet the Monotype version is number 320, issued in 1935. It was originally cut by Bauer in 1930 as Spiral. There was an article on Emerson in Signature by Reynolds Stone.\n\nI might have others but this was readily at hand.\n\nGerald\n\n"
    },
    {
      "time": "23 Sep 2005 — 8:07pm",
      "content": "Emerson is used to set one of the articles in _Books and Printing: A Treasury for Typophiles._\n\n"
    },
    {
      "time": "23 Sep 2005 — 10:38pm",
      "content": "Gerald, more great info - thanks.  \nDo you have a scanner? And time? :-) Or if it's not between semesters right now could I come by your class, borrow it, and bring it back? Basically I'm wondering if there are other glyphs beside the \"a\" that are both so fine and so unique. And the other thing is the derivation of the numerals - I wonder if that Signature article says anything about that, or any possible derivation of the font in general; I've been trying to track down the first case of hybrid numerals for a while now...\n\nJohn, another thing to pick up from UCLA then - thanks.\n\nhhp\n\n"
    },
    {
      "time": "24 Sep 2005 — 5:09pm",
      "content": "Hrant\n\nNo problem if you want to borrow what I have. Let me know if you will be coming by on a Tuesday night and I will bring them along.\n\nGerald\n\n"
    },
    {
      "time": "24 Sep 2005 — 8:42pm",
      "content": "Hrant\n\nThe reprinted quote from Stone\n\n\"The intention seems to have been to make the type suitable for photogravure reproduction. This involved a thickening of thin strokes and a blunting of the serifs and all terminals. The designer further seems to have aimed at producing a reasonably light face, fairly condensed, and at the same time one which avoided the rigidity of a modern face and preserved some of the virtues of the classic renaissance types.\"\n\nAny typos are my own!!!\n\nThe figures are as you say.\n\nThere is a foundry in Switzerland, which bought up the Berliner stuff, so they do have the mats.\n\nGerald\n\n"
    },
    {
      "time": "24 Sep 2005 — 9:05pm",
      "content": "Gerald, continued thanks.  \nI'll probably come in this Tuesday.\n\nhhp\n\n"
    },
    {
      "time": "29 Sep 2005 — 6:34pm",
      "content": "So thanks to Gerald I got a good specimen of Monotype Emerson.  \nHere's the charset at 10 point:\n\n[http://www.themicrofoundry.com/other/Emerson.gif](http://web.archive.org/web/20131016195335/http:/www.themicrofoundry.com/other/Emerson.gif \"http://www.themicrofoundry.com/other/Emerson.gif\")\n\nNothing as exhilarating as the \"a\", but the \"AE\" has a feature I think is as nice as it is rare: the middle stem <cite>slightly</cite> tilted leftward. And the \"U\", although not very uncommon, is rare enough to single out for praise. Negatives: a descending \"J\" but a non-descending -if decent- \"Q\"; although in the Italic the \"Q\" is exactly the sort I like. Another thing about the Italic is that Monotype's typical uniwidth (generally called \"duplexed\") approach has NOT been applied - which however makes me wonder why it still looks a bit brutish. The smallcaps are too small to me (although the main caps are too big).\n\nThe numerals (as I mentioned above, but it's worth mentioning again) are hybrid (and I just noticed, monowidth too) which is pleasantly surprising to see as far back as the 1930s. I wonder if Blumenthal was in fact the first...\n\nhhp\n\n"
    },
    {
      "time": "30 Sep 2005 — 5:13pm",
      "content": "Apparently I can't even keep track of my own stuff: I had previously found an older example of hybrid numerals, done towards the end of the 19th century by Phelps, Dalton & Company (AKA Dickinson) and even discussed the find here on Typophile. Oh well.\n\nhhp\n\n"
    },
    {
      "time": "5 Oct 2005 — 3:04pm",
      "content": "Hrant\n\nEver since you put out a call for information about the Spiral/Emerson type of Joseph Blumenthal I've been racking my brain to try and recall where I have an article by JB on the entire process of making both the types.\n\nEach time I come across a pile of paper, books, etc. I think I've found it. No luck.\n\nI recall that the account was very personal, covering the early days of his sketching the design, and mentioning that since he was newly married, he had no money to fund the project.\n\nIt seems to me that the article was in a copy of The Colophon, but I can't be certain. Can't swear that I will ever find it, but I'm on the lookout for it.\n\nHave you looked into the early editions of this publication?\n\nJim\n\n"
    },
    {
      "time": "5 Oct 2005 — 3:09pm",
      "content": "Sorry for the rack inducement. :-)\n\nThat article sounds tantalizing. Maybe its contents ended up in his \"Typographic Years\"? I'll be getting my hands on that soon. Colophon: if you're firm on that lead I can scour the collection that UCLA has.\n\nAnd certainly, if one must get married, one  \nshould spend the big money [shortly] beforehand.\n\nhhp\n\n"
    },
    {
      "time": "3 Nov 2005 — 6:54pm",
      "content": "So I got my hands on \"Typographic Years\". First: it's really  \nquite well set, in Monotype Baskerville - very sharp, sans any  \nletterpress fetish. Anyway. There's a chapter on Emerson, and  \nit's pretty interesting, but: not much on its origins, although  \nhe does say he traced over enlargements of Jenson, Baskerville  \nand Bodoni, if only to familiarize himself more with classics;  \nand nothing on the hybrid numerals. But the book does reveal  \nthat the punches, matrices, proofs etc. of the original version  \nof the design (Spiral) are at RIT's Carey... It also mentions  \nthat Victor Hammer thought it was the best Roman in town.  \nOh, and that he made virtually no money from it. But I think  \nit's a really nice design, worth reviving much more than  \nGaramond yet again (although with a new Italic).\n\nBTW, John, I got the Bennett book you mentioned as well.  \nIsn't the chapter set in Emerson so utterly convincing?\n\nhhp\n\n"
    },
    {
      "time": "2 Feb 2008 — 2:22am",
      "content": "I am also getting interested in this face but more in the version called Spiral that existed before Monotype adapted it. Does anybody have a suggestion?\n\n"
    },
    {
      "time": "2 Feb 2008 — 6:24am",
      "content": "No suggestions, but very handsome and distinctive -- well worth the effort of interpreting for digital type, I'd think.\n\n"
    },
    {
      "time": "2 Feb 2008 — 7:05am",
      "content": "Eben --\n\nI'm pretty sure that Blumenthal's papers went to the Dartmouth College Library. I don't know if the collection has been indexed.\n\nAs mentioned in Hrant's last post, the APHA article says that the original Spiral materials were given to the Cary Collection at RIT. Jerry Kelly would also be a good resource.\n\nI can try to drum up some contacts for you. Maybe you (we?) can get over there and hunt something down during TypeCon week in nearby Buffalo. ;-)\n\nI'll respond to your e-mail separately.\n\n-- K.\n\n"
    },
    {
      "time": "23 Jan 2010 — 3:45am",
      "content": "Does anyone know how to get in contact with Jerry Kelly? His Nonpareil website won't let me see the pdf and the contact e-mail is rejecting.\n\n"
    },
    {
      "time": "23 Jan 2010 — 4:25am",
      "content": "Ben --\n\nJerry’s partner in Nonpareil handles the licensing. I’ll see if I can dig up a different e-mail for her. And I’ll contact you offline with the PDF as well.\n\n"
    },
    {
      "time": "23 Jan 2010 — 4:34am",
      "content": "Super, that's kind Kent, thank you.\n\n"
    },
    {
      "time": "23 Jan 2010 — 8:53am",
      "content": "I hadn't seen that Nonpareil stuff. What a horrible digitization  \nof Emerson (or actually Spiral). Somebody get them to pull it.\n\nhhp\n\n"
    },
    {
      "time": "23 Jan 2010 — 5:15pm",
      "content": "\\> Somebody get them to pull it.\n\nA Google search let me find the website and get their PDF specimen. It does seem like the x-height line isn't even, although I saw that with some examples of the \"real\" Emerson as well. Other than that flaw, which should be easily correctable if it is real, the digital version did not look terrible to me - and I'm glad one exists.\n\nLooking more closely, and using the \"test drive\" feature of their site, it seems that the problem is really with only one letter: the lowercase z. It is too low, and is tilted so that the right side is even lower. The \"real\" Emerson from Monotype appears to have a characteristic like that in the lowercase z as well, but not so pronounced.\n\n"
    },
    {
      "time": "23 Jan 2010 — 6:18pm",
      "content": "Zoom in to the foot of the \"i\".\n\nhhp\n\n"
    },
    {
      "time": "23 Jan 2010 — 6:00pm",
      "content": "\\> Zoom in to the foot of the \"i\".\n\nI see that the two serifs on either side are not equal in length. However, that seems to be true for most of the other lowercase letters as well; it seems to have been intentionally done to give flow or directionality to the letters.\n\nThus, the serifs on the right-hand vertical of the \"h\" are similar to those of the \"i\", while those on the base of the \"f\" and \"r\" point in the other direction.\n\n"
    },
    {
      "time": "23 Jan 2010 — 6:18pm",
      "content": "Sorry, I meant the \"i\" in the display cut.  \nBut in the text cut, check out the \"U\"...\n\nhhp\n\n"
    },
    {
      "time": "23 Jan 2010 — 8:49pm",
      "content": "I'm still not entirely certain what you may be wishing me to look for, as the samples of the real Emerson that I've seen weren't at a large enough scale for me to compare them with this.\n\nHowever, the curve at the bottom of the U in the text version does seem to change abruptly, I will admit.\n\nIn the case of i in the display version, the counter on the left-hand serif at the bottom does seem to have a problem - where the others are smooth curves, this one seems to depart from the vertical earlier, and change to a straight line leaning against the vertical - which then rejoins the normal serif after a bend with a smaller radius of curvature.\n\n"
    },
    {
      "time": "24 Jan 2010 — 8:44am",
      "content": "Yeah, I got in touch with them and they've fixed the pdf link now. They could do with some optimisation to get their website on Google's radar. I've been researching Emerson all week and they hadn't come up at all. But the whole site is Flash.\n\nThe lowercase /x/ and /y/ in the display cut have similarly unsmooth serif joins. I'm hoping to find out how the digitisation project was handled.\n\n"
    },
    {
      "time": "24 Jan 2010 — 8:55am",
      "content": "It looks like FontLab did it...\n\nhhp\n\n"
    },
    {
      "time": "27 Feb 2010 — 3:49am",
      "content": "Hrant, I got a new scan from my friend at Wells College, and overlaid it on the scan you had, noting a few differences, particularly the descender of italic g. (The darker scan was the one you sent me.) Some of the differences of course could just be ink spread but I think the Wells specimen has stronger serifs and terminals. I haven't yet got exact details of the source (and whether it could be the foundry version).\n\n ![](http://web.archive.org/web/20131016195335im_/http:/typophile.com/files/Emerson_5936.gif)\n  \nAlso I gather there's some 14pt metal Emerson knocking around there so I've asked for some macro photos.  \nIf you'd like me to e-mail this new scan I'd be happy to. I'm pretty happy about the quality. :) \n"
    },
    {
      "time": "27 Feb 2010 — 6:12am",
      "content": "Stronger serifs and terminals could indicate fresher type. Monotype would typically be cast fresh for each setting, but long runs might get more worn toward the end. Handset foundry type would be more likely to exhibit affects of wear and tear, depending upon the printer’s practices.\n\nI can’t explain the smaller shorter g of the Wells specimen. I don’t think Monotype was in the habit of making short/long-descender versions. That was more a Linotype practice, due to certain constraints.\n\n"
    },
    {
      "time": "27 Feb 2010 — 7:49am",
      "content": "Like Kent said, the softer serifs are probably just a wearing of the metal. BTW, Monotype fonts were sometimes cast as sorts for hand-setting, and being much softer than foundry would wear down much faster in such cases.\n\nThe only real difference is indeed the \"g\". Since the earlier Spiral didn't even have an Italic (correct?) the only explanation I can think of is that they set the \"g\" a point or two larger than the rest!\n\nhhp\n\n"
    },
    {
      "time": "26 May 2010 — 8:09pm",
      "content": "I was at Wells last summer and got to take a monotype class from Mike Bixler. But I also picked up a copy of Victor Hammer and the Wells College Press which has this passage at the end of the book:\n\nSpiral Type, 14 point Roman, approximately 200 pounds. Donated to Victor Hammer by Joseph Blumenthal.\\*\n\n\\* This is most likely the only existing Spiral Foundry Type in existence as only 1000 pounds was cast. Blumenthal gave 200 pounds to Hammer and eventually melted down the remaining 800 pounds. That Wells has this much Spiral and the original Emerson type is a tribute to the devotion of Father Thomas J. Collar, a printer who live in Aurora, and friend of Victor Hammer. This type was pied in the many moves and nearly totally lost. Father Collar spend countless hours setting the pied type back on its feet and tying and wrapping it so that it could be easily relayed and used. Without his almost heroic effort, this type would certainly be lost forever.\n\nI suppose I should have used it in the specimen book I printed there. But presumably that's the foundry version then. I have a picture of the front of the California cases that say Spiral, but that's not so interesting.\n\n"
    },
    {
      "time": "27 May 2010 — 1:42am",
      "content": "Wow, that's really exciting! I'm going to get in touch with my friend; she mentioned Mike Bixler so I'm now really wondering what the source of her scan was!\n\n"
    },
    {
      "time": "28 May 2010 — 11:01pm",
      "content": "I remember there was a thread about identifying a typeface in an encyclopedia by Golden Books in which the Emerson typeface was discussed extensively. However, while the search feature of this site seems to be working again, it did not turn up that thread.\n\nThankfully, Google stepped into the breach:\n\n[http://typophile.com/node/66413](http://web.archive.org/web/20131016195335/http:/typophile.com/node/66413 \"http://typophile.com/node/66413\")\n\n"
    },
    {
      "time": "31 Dec 2010 — 4:48am",
      "content": "More: [Spiral & Emerson: An Interview with Joseph Blumenthal](http://web.archive.org/web/20131016195335/http:/typocurious.com/the-spiral-emerson-types-an-interview-with-joseph-blumenthal/).\n\n"
    },
    {
      "time": "1 Jan 2011 — 8:17pm",
      "content": "I've created a page on Wikipedia for Emerson. It's a bit concise, so feel free to edit or let me know any suggestions and I'll amend.  \n [Emerson (typeface)](http://web.archive.org/web/20131016195335/http:/en.wikipedia.org/wiki/Emerson_%28typeface%29)\n\n"
    },
    {
      "time": "1 Jan 2011 — 10:10pm",
      "content": "Interesting Wikipedia article.\n\nThe first use of Emerson - or perhaps Spiral - was in publishing a private-press edition of Ralph Waldo Emerson's essay Nature, in 1935, but that had been published before (in 1908, and perhaps earlier). Somehow, I think, the wording should be made explicit on this point, to avoid leading people to think that the font was first used for the initial publication of that work.\n\nSpeaking of Wikipedia articles, there is a beautiful and detailed article entitled \"Linotype Machine\". But there was only a paragraph describing how Monotype machines work in one of the articles about the history of the Monotype corporation. I created an article, but it's far from complete, entitled \"Monotype system\", if this news might reach anyone interested in doing it properly!\n\n"
    },
    {
      "time": "2 Jan 2011 — 2:44am",
      "content": "Thanks, I've amended that, hopefully it's clearer now?\n\n"
    },
    {
      "time": "10 Jan 2011 — 3:16pm",
      "content": "That Typocurious interview is quite revealing - thanks for sharing!\n\nIt's interesting how Blumenthal was in such denial about the pivotal positive role that Hoell played... To me Emerson would have been lukewarm at best without Hoell's contribution.\n\nhhp\n\n"
    },
    {
      "time": "19 Feb 2012 — 2:24pm",
      "content": "I've finally had the chance to look at a scan Dan Rhatigan sent through to me a while ago, from the MT archives. I don't feel I can post it here, but I've compared the original foundry version with the MT version.\n\nMy observations of the changes:\n\n- Overall the MT face is lighter. Odd perhaps, wouldn't both versions have used the same kinds of ink in the presses?\n- Round letters (CDOQ especially) are considerably lighter.\n- HMNPS were made narrower. (To fit the 18-unit system?)\n- Terminals on CGS were trimmed down.\n- Lowercase extenders were brought in.\n- Arched counters on m and n were raised. Similar with the a. Crossbars of f and t thinned.\n- Zero was changed from round to narrow form (still oldstyle, both have same modulation). \n\nI think the last is the only stylistic change, the other adaptations seem to have been made for practical reasons.\n\nI'm afraid my observations are sadly not quantified due to the low-ish resolution images I have, but I'm hoping to make some high resolution scans fairly soon, and see what else the MT archives hold.\n\n"
    },
    {
      "time": "20 Feb 2012 — 5:08am",
      "content": "<cite> &gt; Overall the MT face is lighter. Odd perhaps, wouldn't both versions have used the same kinds of ink in the presses? </cite>\n\nMy guess (only a wild-ass guess) is that perhaps because hot metal is softer than foundry, the anticipation was that the type might wear slightly over any moderately long run (for books, for example) and gain as a result.\n\n(It’s a stretch, and I have no evidence or direct experience, but that was my first thought upon reading your observation.)\n\n"
    },
    {
      "time": "20 Feb 2012 — 12:39pm",
      "content": "Ben, I don't remember all the details from the correspondence about Monotype's cut of Emerson, but I at least remember that there was discussion about the weight, and trials printed to compare the foundry cut against ours. You can correct me if you come and look through the files, but IIRC it was a conscious decision to get at a weight that seemed more in line with other text faces in the library.\n\n[Here's a scan of the comparison setting](http://web.archive.org/web/20131016195335/http:/ultrasparky.tumblr.com/post/17964873656/comparison-of-foundry-vs-monotype-cuts-of-emerson)\n\n"
    },
    {
      "time": "20 Feb 2012 — 1:15pm",
      "content": "Ha, there's the man! Thanks for chiming in, Dan. I did wonder if it was something to do with Monotype's house style.\n\n"
    }
  ]
}
