{
  "id": "1527",
  "title": "Font Education: It's not just students",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I just received my invitation to enter the \"American Corporate Identity 20\" contest. In reading the fine print for entries: \"You may enter a 35mm slide, or a Macintosh .eps file along with the hard copy of the logo. Be sure to include any logo fonts on the disk, so the logo can print properly.\"   \n   \nDo the rest of you read that as I do? I read it as: \"Send us all the fonts associated with your logo.\" Although, it could be they are specifically talking about a font that contains the logo. In any case, turning the fonts to outline in an eps file would eliminate the problem.\n\n",
  "author": "grid",
  "time": "5 Oct 2003 — 5:07pm",
  "uid": "2142",
  "comments": [
    {
      "time": "6 Oct 2003 — 8:41am",
      "content": "Uh, flashback to the early '90s? Maybe nobody has re-read the fine print for 10 years.\n\n"
    },
    {
      "time": "6 Oct 2003 — 8:52am",
      "content": "Bill I would do what you suggest. Turn your fonts to outlines. I'm suprised they even want an eps. Why not a high quality GIF or JPEG, just thinking out-load. Dan\n\n"
    },
    {
      "time": "6 Oct 2003 — 9:51am",
      "content": "The .eps format works well with QuarkXPress (and InDesign and PageMaker), which I expect they're using for production. GIFs and JPEGs do not provide the scaling flexibility that a vector format does. I would think a PDF file would be a smarter, and legal, workflow.   \n   \nMy point had more to do with a rather large organization asking designers to violate their type licenses, and most probably will without thinking about it. We do love to see our names in lights ![:-)](http://web.archive.org/web/20131108050857im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "6 Oct 2003 — 1:02pm",
      "content": "But Bill why would you ask for final art before picking a winner. They just need to have a mention that if you win you must provide camera ready artwork. Sounds like a classic cart before the horse. Maybe the rules are really old and haven't been updated in a long time.\n\n"
    },
    {
      "time": "6 Oct 2003 — 1:34pm",
      "content": "\\>\\> I'm suprised they even want an eps.   \nWhy not a high quality GIF or JPEG, just thinking out loud. Dan   \n   \nHuh?!! What?!!!\n\n"
    },
    {
      "time": "6 Oct 2003 — 2:19pm",
      "content": "My guess is, that they do these award books on the cheap. It takes less time and effort to produce if all the entries come in with camera-ready artwork. That way, the only winners you need to contact are people who provided files that were not adequately pre-flighted.\n\n"
    },
    {
      "time": "6 Oct 2003 — 2:59pm",
      "content": "\\>\\> I'm surprised they even want an eps.   \nWhy not a high-quality GIF or JPEG?   \nJust thinking out loud. Dan   \n   \nvector vs. raster...i won't even go there.\n\n"
    },
    {
      "time": "6 Oct 2003 — 3:37pm",
      "content": "bj some logos are raster and some are vector does that explain it for you or do I have to draw a diagram\n\n"
    },
    {
      "time": "6 Oct 2003 — 4:18pm",
      "content": "YES.\n\n"
    },
    {
      "time": "6 Oct 2003 — 4:40pm",
      "content": "YES, as in that explains it for me.   \n   \nnow let me ask you a question.   \nIn your opinion, what percentage of   \ncorporate identity logos are created in raster, and what   \npercentage in vector?\n\n"
    },
    {
      "time": "6 Oct 2003 — 11:48pm",
      "content": "Mr. Weaver. Please forgive me for my rudeness earlier today.   \nI don't wish to spar; it's not my idea of fun.   \n   \nLife is short.   \n   \nI'll leave this one alone.   \n   \napologies.   \n   \nbj\n\n"
    },
    {
      "time": "7 Oct 2003 — 2:18am",
      "content": "\\>\\>Why not a high quality GIF or JPEG   \n   \nOK, I don't want to spar either, and I agree that raster works better than vector in some cases, but I don't think there is such a thing as a high quality gif or jpeg.   \n(Well maybe that's an over-simplification, but you would need quite specific circumstances for either of these to provide as good quality as tif of png, and they could not provide better quality).   \nThe problems are that gif is an 8 bit format which means that you can only have 256 colours in your image. That can be OK for some logos, but in general, the kind of logo that would be OK as a gif would be better as a vector.   \nThe problem with jpgs is the compression thing - you have no control over the mess that the compression algorithm makes of your work.   \n   \nWhere quality is the criteria, use tifs, unless you need alpha channel transparency, when you should use pngs.   \n   \n=====   \nI've just re-read all that, and it sounds dictatorial - that's not how it was intended. I'm not claiming to be the world's leading authority on this, just offering my opinion.\n\n"
    },
    {
      "time": "6 Oct 2003 — 8:51am",
      "content": "Bills, it seems they need to change their specs. Someone should send them the line, \"change all of your type to outlines\".\n\n"
    }
  ]
}
