{
  "id": "1528",
  "title": "Long S",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "A grad student friend of mine is looking for faces with a long s as part of the character set. i'm at a loss, other then Lucida Grande. Any suggestions?\n\n",
  "author": "benkiel",
  "time": "5 Oct 2003 — 5:17pm",
  "uid": "1370",
  "comments": [
    {
      "time": "5 Oct 2003 — 6:31pm",
      "content": "[Broadsheet](http://web.archive.org/web/20150414063230/http:/www.oldfonts.com/broadsheet.html) has it, if I recall correctly.\n\n"
    },
    {
      "time": "5 Oct 2003 — 11:08pm",
      "content": "Ben,   \n   \n [http://www.lanstontype.com/CaslonFountEight.html](http://web.archive.org/web/20150414063230/http:/www.lanstontype.com/CaslonFountEight.html)   \n [http://www.lanstontype.com/CaslonGiampa.html](http://web.archive.org/web/20150414063230/http:/www.lanstontype.com/CaslonGiampa.html)   \n [http://www.lanstontype.com/CaslonNo337.html](http://web.archive.org/web/20150414063230/http:/www.lanstontype.com/CaslonNo337.html)   \n [http://www.lanstontype.com/CaslonATF.html](http://web.archive.org/web/20150414063230/http:/www.lanstontype.com/CaslonATF.html)   \n   \nThis font is complete with long S and Swash Italic. There are 17 fonts in total.   \n   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": "6 Oct 2003 — 12:10am",
      "content": "Le Monde Livre Classic, Sabon Next LT\n\n"
    },
    {
      "time": "6 Oct 2003 — 4:10am",
      "content": "Jean,   \n   \nSabon? Somehow I can't imagine. For some reason it does not sound suitable!   \n   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": "6 Oct 2003 — 9:10am",
      "content": "Adobe Caflon Pro.   \n   \nOn a related note, Thomas Phinney previewed new OpenType fupport features in Illuftrator Next at the recent ATypI conference, but there is ftill no \"hiftorical\" mode.\n\n"
    },
    {
      "time": "6 Oct 2003 — 10:21am",
      "content": "Nick, sunny.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Oct 2003 — 2:51pm",
      "content": "The Micro&#383;oft core fonts have the long s in them too.   \n   \nWords like Ca&#383;lon and Illu&#383;trator and hi&#383;torical can be spelled without u&#383;ing an f.   \n   \nheh\n\n"
    },
    {
      "time": "6 Oct 2003 — 2:52pm",
      "content": "Aww crap, the board didn't parse the characters!\n\n"
    },
    {
      "time": "6 Oct 2003 — 7:01pm",
      "content": "Thanks all, especially Nick for the humor, I've passed on your suggestions to my friend.\n\n"
    },
    {
      "time": "6 Oct 2003 — 9:51pm",
      "content": "Tiffany,   \n   \nIt was a question I have since answered. It would be suitable for Sabon to have a long s.   \n   \n   \nGerald Giamp   \nLanston Type Company\n\n"
    },
    {
      "time": "7 Oct 2003 — 8:22am",
      "content": "Well, long s seems to work in Sabon Next:   \n ![longs](http://web.archive.org/web/20150414063230im_/http:/www.typophile.com/forums/messages/4100/18095.gif)\n\n"
    },
    {
      "time": "7 Oct 2003 — 8:33am",
      "content": "Jean,   \n   \nI must say I am glad I asked the question. Very nice.   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": "7 Oct 2003 — 1:31pm",
      "content": "Jean,   \n   \nhow Sabon Next activates the long s and its ligatures? hist & hlig feature?   \n   \nHow does the application / feature code \"knows\" on which situation the long s should be set or not?   \n   \nExample: the German words \"besser\" & \"Lesbarkeit\"   \nwith long s: \"b e long\\_ss\\_ligature e r\" but Lesbarkeit with normal s\n\n"
    },
    {
      "time": "8 Oct 2003 — 2:05am",
      "content": "well, if the family was OpenType, yes, there is some way to active long s depending of the language restrictions. Le Monde Livre Classic OT (OT done by John Hudson to demonstrate some OT features back in 2001) use this fonction.   \n   \nSabon Next LT to date still only PostScript and TrueType. But all glyphs have been designed to built a future OT version. Its up to Linotype to do it I think.\n\n"
    },
    {
      "time": "8 Oct 2003 — 11:18am",
      "content": "The use of the long s in German, like several other aspects of German typography, is pretty much impossible to automate without a dictionary. It is possible with OpenType to provide basic contextual handling of the long s, and to use Language System tags to vary the handling for different typographic traditions, but German has too many lexically-determined exceptions to a general rule.\n\n"
    },
    {
      "time": "8 Oct 2003 — 12:42pm",
      "content": "John,   \n   \ndo you suggest to use hlig and hist feature for long\\_s but to make an exception for German? How about Dutch?   \n   \nAny other exception?\n\n"
    },
    {
      "time": "8 Oct 2003 — 9:31pm",
      "content": "I think the \\<hlig\\> feature may be redundant. If a user wants the long s, he probably wants the ligatures associated with it that are appropriate for his language, so I would use the \\<hist\\> feature to substitute the long s, using contextual lookups for those languages that have rules about where the substitution may occur, and then the \\<liga\\> feature for any ligatures. The only reason I can think of for the \\<hlig\\> feature is if you wanted users to be able to turn the long s ligatures off without affecting other ligatures. Frankly, though, I don't expect to see the \\<hlig\\> feature supported any time soon, at least not with its own UI function, which is what it would need to make it at all useful.   \n   \nI don't know what all the rules are for the long s in German, so I can't say what would be the best way to approach this.\n\n"
    },
    {
      "time": "8 Oct 2003 — 9:39pm",
      "content": "If an app has a German spell-checker, couldn't it figure out where to use a \"long s\" correctly?   \n   \nhhp\n\n"
    },
    {
      "time": "8 Oct 2003 — 10:39pm",
      "content": "Spell-checkers are character-based and don't know anything about glyph-level processing. Theoretically, a dictionary-driven German typesetting system could be developed -- John Butler and I have mused about this in the past --, but nothing even close exists, to my knowledge.\n\n"
    },
    {
      "time": "8 Oct 2003 — 11:42pm",
      "content": "I have to agree with John that the long-s ligatures belong in either 'liga' or 'dlig' and there's no need for a separate 'hlig' feature.   \n   \nThat's the one downside of having spec'd a whole ton of features before building fonts and apps to support them. We made a couple of mistakes. That was one of them. (Also, anybody remember the 'crcy' currency feature? Ewww.)   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "9 Oct 2003 — 2:41am",
      "content": "Thomas,   \n   \ndo you thing long\\_s is not an historic thing? Or should we use the dlig instead of hlig?   \n   \nhlig is not supported by InDesign2. In one of my last procejts I have used both hlig & dlig with the same code.\n\n"
    },
    {
      "time": "9 Oct 2003 — 8:28am",
      "content": "I don't know if Sabon has the f\\_j ligature. I am wondering if Open Type has included it.   \n   \nJust a question. I have seen many fonts without.   \n   \n ![f_j ligature illustration](http://web.archive.org/web/20150414063230im_/http:/www.typophile.com/forums/messages/4100/18245.gif)   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": "9 Oct 2003 — 10:06am",
      "content": "Gerald:   \n   \nThese are two separate questions. OpenType is capable of any arbitrary ligature a type designer cares to create. However, I don't know if Sabon has the f\\_j ligature. Some Adobe fonts have it, but far from all.   \n   \nAndreas:   \n   \nSure, the long\\_s is a historic thing. So use the 'hist' feature if you like to get the glyph in there. But once you've got it in text, there's no need for a \\*special\\* ligature feature with it. Any long\\_s ligatures you either want on by default (liga), or off by default (dlig).   \n   \nPut another way, if every substitution feature were to need a separate corresponding ligature feature, we'd need an amazingly large number of ligature features.   \n   \nBut luckily for us, features are cumulative. Whether it's swashes or small caps or historical forms, they can interact with the main ligature features (liga, dlig, clig) to create just about any combination effect needed.   \n   \nT\n\n"
    },
    {
      "time": "9 Oct 2003 — 11:32pm",
      "content": "Thomas,   \n   \n   \nYour words,   \n.\\>\\>\\>\\>\\>   \nThese are two separate questions. OpenType is capable of any arbitrary ligature a type designer cares to create. However, I don't know if Sabon has the f\\_j ligature. Some Adobe fonts have it, but far from all.   \n\\>\\>\\>\\>\\>   \n   \nI am not that easy to brush off.   \n   \nSabon, having an historical base \"may\" predate the development of j and was still just a consonant value for the i. But I am merely guessing. Also one must consider the \"mother tongue\" issue of the type face and I do not believe that combination would ever get inked. There will be some in this forum familiar with the language to explain that. I am all for\n\n"
    },
    {
      "time": "10 Oct 2003 — 12:55am",
      "content": "_Will they still be using the old method for ligatures where the spell checkers give gobbly gook? That the \"disadvantages\" are still the \"same as ever\"._   \n   \nNo. Ligatures in OT fonts are automatically substituted at the _glyph_ processing level: spell-checking is performed at the _character_ processing level. [This article](http://web.archive.org/web/20150414063230/http:/www.microsoft.com/typography/developers/opentype/default.htm) might answer more of your questions about OpenType.\n\n"
    },
    {
      "time": "10 Oct 2003 — 1:30am",
      "content": "John,   \n   \nThank you. This is helpful.   \n   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "11 Oct 2003 — 9:12am",
      "content": "I have been poking around the Open Type features, also I got a mysterious letter. Maybe there is something to it.   \n   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "23 Oct 2003 — 6:20am",
      "content": "I am new to this list and have only one specific interest which concerns the 'long s'. I hope someone can help.   \n   \n\"1791: John Bell, U.K. printer, abandons the \"long s\" (the \"s\" that looks like an \"f\")\"   \n\\>   \n\\> I was interested in the spelling rules that existed at the time writers used the 'long s'.   \n\\> I have been reading old documents from various archives and I have seen many examples of the 'long s'.   \n   \n\\> Example: \". . . and to ship myfelf upon the firft Veffel or Ship . . .\"   \n\\>   \n\\> Can anyone refer me to any spelling rules that would explain when the 'f' was substituted for 's'.   \n\\>   \n\\> Lawrence C. Erwin,   \n\\> Toronto\n\n"
    },
    {
      "time": "23 Oct 2003 — 12:08pm",
      "content": "The orthographic rules for long s vary from language to language. In English, the typical rule is as follows:   \n   \nlong s : beginning of a word; mid-word; first s in a double   \n   \nshort s : end of a word, second s in a double   \n   \nfo fend mifsals to fifters in fouth-eaft Afia\n\n"
    },
    {
      "time": "23 Oct 2003 — 12:39pm",
      "content": "Thank you John Hudson. That was the information I needed.\n\n"
    },
    {
      "time": "28 Oct 2003 — 8:30am",
      "content": "\\>1791: John Bell, U.K. printer, abandons the \"long s\"   \n   \nBut why? From a practical point of view, according to the orthography of the day, there would have been many more long s's in a tray, so economically, it would have made more sense to rationalize by abandoning the short s.   \n   \nAnd from the reader's point of view, it would have been less of shock.   \n   \nBut perhaps they wanted drastic change.   \n   \nDid a standards committee of the era recommend a compromise, medium-length s, to replace both?   \n   \nFigures changed from old-style to lining, but were there other proposed orthographic changes during that revolutionary era, that didn't catch on? (I'm thinking of glyph shapes, including punctuation, rather than phonetic systems such as Pitman's, which was 1830s, I think).\n\n"
    },
    {
      "time": "6 Oct 2003 — 9:02am",
      "content": "Gerald -- Why doesn't it sound suitable?\n\n"
    }
  ]
}
