{
  "id": "15283",
  "title": "How to copy tables in InDesign?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,\n\nI was wondering what were the options to copy tables from Words to InDesign. A simple _copy-paste_ doesn’t seem to work for me. I loose the grid in the process.  \nIt works fine when I import or _place_ the Words document in InDesign, but that is not a good solution for the job I have to do since the Words documents I receive from my client contain hundreds of tables. Unless I recompile the data and place one table per Words document which would take months.\n\n [‹ Baskerville](http://web.archive.org/web/20071111145641/http:/www.typophile.com/node/15218 \"Go to previous forum topic\") [Type Specimen Theme... What would you choose? ›](http://web.archive.org/web/20071111145641/http:/www.typophile.com/node/15254 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071111145641/http://www.typophile.com/user/8785\" title=\"View user profile.\">sebsan</a>",
  "time": "<br>",
  "uid": "8785",
  "comments": [
    {
      "time": " 22.Sep.2005 8.37am",
      "content": "Sebsan:\n\nYou have to make sure only the table (no extra returns before or after) is selected before you cut-and-paste, otherwise it gets hashed. Importing the file often works better.\n\nAdobe has an excellent forum for InDy help, both mac and PC:\n\n[http://www.adobeforums.com/cgi-bin/webx?14@@.ee6b330](http://web.archive.org/web/20071111145641/http:/www.adobeforums.com/cgi-bin/webx?14@@.ee6b330 \"http://www.adobeforums.com/cgi-bin/webx?14@@.ee6b330\")\n\nAlthough it’s listed as “user-to-user”, many Adobe wizards hang out there.\n\nEDIT: just re-read your post, & realize that you tried to “place”; not enough coffee yet this morning ... although sometimes it works best to place into a “scratch” file, then you cut-and-paste within InDy, not between 2 applications.\n\n"
    },
    {
      "time": " 22.Sep.2005 8.47am",
      "content": "I like the the “scratch” file idea!  \nthanks and go easy on the coffee.\n\n"
    }
  ]
}
