{
  "id": "15281",
  "title": "FontLab 5 released for Windows",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "We have finally managed to kick FontLab Studio 5 (at least the Windows version) out of the nest. Cool new stuff includes:\n\n- _ **Autotrace** _ is now included in the product. No need to go outside Fontlab to trace glyphs.  \n - Many new _ **printing and proofing** _ features, making it easy to get printouts at all stages of the font production process.  \n - _ **RoboFab** _ python library is now included in FontLab. Users get access to the Universal Font Object (.ufo) XML font format and to a bunch of improved python resources.  \n - New, improved _ **metrics window** _ incorporates a powerful new table that makes class-based kerning a snap and has a multi-line and context-based preview window so users can see how spacing and kerning will actually look in text without having to generate the whole font and print out samples.  \n - Support for _ **Unicode 3.2 and 4.0** _ means that users have access to virtually every character in Unicode.\n\nThe new price is US$649 and upgrades from FL4.6 go for US$99. A Macintosh version is also in the works and will enter beta testing shortly.\n\nMore details available at:  \n [http://www.fontlab.com/The-News/Announcements/FontLab-Studio-5-for-Windo...](http://web.archive.org/web/20071211191009/http:/www.fontlab.com/The-News/Announcements/FontLab-Studio-5-for-Windows/ \"http://www.fontlab.com/The-News/Announcements/FontLab-Studio-5-for-Windows/\")\n\nRegards,  \nTed Harrison  \nFontlab Ltd.\n\n [‹ Names for the descenders of the letter 'g'?](http://web.archive.org/web/20071211191009/http:/typophile.com/node/15364 \"Go to previous forum topic\") [Good deal for good fonts ›](http://web.archive.org/web/20071211191009/http:/typophile.com/node/15294 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071211191009/http://typophile.com/user/1878\" title=\"View user profile.\">tharrson</a>",
  "time": "<br>",
  "uid": "1878",
  "comments": [
    {
      "time": " 21.Sep.2005 9.29pm",
      "content": "Cool.  \nQuestion: Will the $99 upgrade from 4.6 always be available?\n\nhhp\n\n"
    },
    {
      "time": " 22.Sep.2005 2.32am",
      "content": "After a couple of minutes playing with Studio 5, i have to congratulate and thank the development team for this piece of software. Outstanding... it has improved my life.\n\nmiles\n\n[www.newlyn.com](http://web.archive.org/web/20071211191009/http:/www.newlyn.com/ \"www.newlyn.com\")\n\n"
    },
    {
      "time": " 22.Sep.2005 6.08am",
      "content": "“A Macintosh version is also in the works and will enter beta testing shortly.”\n\nPlease let it be soon?\n\nChrisL\n\n"
    },
    {
      "time": " 22.Sep.2005 10.13am",
      "content": "\\> i have to congratulate and thank the development team for this piece of software. Outstanding…\n\nCan you tell us about the improved Bézier drawing tools? What about the nodes (curve, corner, tangent) — easy to change like FOG?\n\n"
    },
    {
      "time": " 24.Sep.2005 3.49am",
      "content": "yes, those nodes are great (can’t compare with FOG, never used it), however i didn’t have a problem with them before.  \nmy favourite bits are the preview, metrics, and printing features.\n\n"
    },
    {
      "time": " 24.Sep.2005 10.25am",
      "content": "Thanks Miles.\n\nAnyone, anybody with FL Studio 5 & FOG?\n\n"
    },
    {
      "time": " 24.Sep.2005 10.38am",
      "content": "i have FOG, but never could get used to it. Perhaps it’s because i downloaded the FLab demo first and learned my way around font software in it. I prefer letter drawing in FLab even to drawing in Illustrator. I’m addicted to FLS5 and dunno if i could ever go back to FLab 4. It’s that good, IMO.\n\n"
    },
    {
      "time": " 24.Sep.2005 10.55am",
      "content": "Paul, can you draw anykind of point and then change it (using the menu bar)? what about Clean Up Paths or Optimize?\n\n"
    },
    {
      "time": " 24.Sep.2005 12.40pm",
      "content": "Download the demo yourself and check it out:  \n [http://www.fontlab.com/Font-tools/FontLab-Studio/](http://web.archive.org/web/20071211191009/http:/www.fontlab.com/Font-tools/FontLab-Studio/ \"http://www.fontlab.com/Font-tools/FontLab-Studio/\")\n\n"
    },
    {
      "time": " 24.Sep.2005 12.42pm",
      "content": "I have mac. thank you anyway.\n\n"
    },
    {
      "time": " 24.Sep.2005 7.39pm",
      "content": "_Can you draw anykind of point and then change it (using the menu bar)?_\n\nYou mean change the kind of point you just made, or change the next kind of point you will make? If the latter, you can switch between different kinds of new points using either the toolbar of keyboard shortcuts. If you have already, for instance, made a corner point, and decide you want it to be a tangent you can covert the line on one side of it to a curve by alt+clicking on it, and then convert the point by double clicking on it. You don’t need to change tools during this operation: the operations available are contextual based on where you click.\n\n"
    },
    {
      "time": " 24.Sep.2005 8.03pm",
      "content": "\\> You mean change the kind of point you just made\n\nYes. And even if you draw a circle; you go to Menu \\> Points \\> Curve/Corner/Tangent. am i clear?\n\n"
    },
    {
      "time": " 25.Sep.2005 10.33am",
      "content": "If you’ve drawn a circle, you can only toggle between curve or corner point (by double-clicking on the node). You can’t have a tangent point unless there is a straight line on one side of the point and a curve on the other. The double-clicking is contextual: if you have a corner point with curves on either side, double-clicking on it will make it a curve point. If you have a corner point with a curve on one side and a straight line on the other side, double-clicking will make it a tangent. If you have a corner point with a straight line on both sides, double-clicking won’t do anything, since there is no curve element to define a curve or tangent. So point type is dependent on adjacent line type, which is how it should be I think.\n\n"
    }
  ]
}
