{
  "id": "15289",
  "title": "Motion Project - Robert Kennedy speech",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am designing and animating the speech Robert Kennedy gave in Indianapolis the night Martin Luther King was assassinated. The speech is somewhat impromptu and very moving.\n\nYou can read it and hear it at:  \n [http://www.americanrhetoric.com/speeches/robertkennedyonmartinlutherking...](http://web.archive.org/web/20140805050849/http:/www.americanrhetoric.com/speeches/robertkennedyonmartinlutherking.html \"http://www.americanrhetoric.com/speeches/robertkennedyonmartinlutherking.html\")\n\nI would like to hear some opinions on what typeface comes to mind when you hear this speech. I'm looking for a somewhat sad serif that captures this mood. I'd be interested in hearing what everybody has to say. Thanks!\n\n",
  "author": "scott_reinhard",
  "time": "22 Sep 2005 — 10:57am",
  "uid": "4368",
  "comments": [
    {
      "time": "22 Sep 2005 — 11:11am",
      "content": "I'll go with Benguiat (Book) — the serifs are reminiscent of knife tips, rose thorns, danger...\n\nThe reason:\n\n\"it's perhaps well to ask what kind of a nation we are and what direction we want to move in. you can be filled with bitterness, and with hatred, and a desire for revenge.\n\nWe can move in that direction as a country, in greater polarization -- black people amongst blacks, and white amongst whites, filled with hatred toward one another.\"\n\n"
    },
    {
      "time": "22 Sep 2005 — 11:36am",
      "content": "I don't know exactly why, and I'm not in fact certain it would be a good choice, but I immediately thought of Meridien.\n\nhhp\n\n"
    },
    {
      "time": "22 Sep 2005 — 12:10pm",
      "content": "No, not daggers. That he is urging people to avoid vengeance and instead \"to tame the savageness of man and make gentle the life of this world\".\n\nI think you want something formal and dignified like Perpetua. Also how you are using it? Are you scrolling it or what? If in short chunks, it might work with caps in Perpetua, Trajan or the new Garda from Village.com. This is how the Gettysberg address in engraved in the Lincoln memorial, and it is very effective. Optima caps will also work.\n\n"
    },
    {
      "time": "22 Sep 2005 — 2:39pm",
      "content": "As of right now I am trying different solutions to how the type will appear on screen. The method though will be appropriate to the content hopefully. Different parts of the speech seem to warrant different treatments (i.e. the poem, as opposed to the announcement of MLK's assassination.) I don't plan on using all-caps for this since it will be a longer passage with a good amount of reading. I think your suggestions so far are excellent, Meridien and Perpetua are very formal, yet have good character to them. Thanks.\n\n"
    },
    {
      "time": "22 Sep 2005 — 3:54pm",
      "content": "The new Optima Next's display cut might work really well. For a motion/video piece though you do have to worry about excessive stroke contrast (typical of serif faces). BTW, considering the Aeschylus/Greek action in there, something with a Greek reference (Skia?) might be cool.\n\nHere's another idea, one that might leverage David's useful -if problematic- instinct: have two fonts, a main one that's sad/rational, and another vicious one which you would use for \"vengence\" etc. This type of thing can be just the ticket for a motion piece.\n\nSomething like this pair:  \n [http://themicrofoundry.com/f\\_cristaal.html](http://web.archive.org/web/20140805050849/http:/themicrofoundry.com/f_cristaal.html \"http://themicrofoundry.com/f\\_cristaal.html\") \\_  \n [http://themicrofoundry.com/f\\_brutaal.html](http://web.archive.org/web/20140805050849/http:/themicrofoundry.com/f_brutaal.html \"http://themicrofoundry.com/f\\_brutaal.html\") \\_  \nNote that the three Daam personas are uniwidth, which means you could have an animation where a word in a line morphs from one font to another without affecting the setting.\n\nhhp\n\n"
    },
    {
      "time": "22 Sep 2005 — 7:39pm",
      "content": "I truly feel that using different treatments would work best on several levels.\n\nFor one, changing typefaces and size, shooting static text, panning segments, etc., would do a lot to relieve the tedium of reading straight text, no matter how compelling the words.\n\nConsider how Pablo Ferro mixed several modes of reading text, and how the reader focus is maintained is the opening credits of [**_To Die For_**](http://web.archive.org/web/20140805050849/http:/www.pabloferro.com/portfolio_content90.htm#) (viewable as QuickTime movie).\n\nI know the subject matter and film mood is all together different, but before you watch the clip TURN OFF the soundtrack. That will allow you to see how Pablo works the images on the screen. Also, you will know what mixing methods can mean as you get towards the middle of the clip.\n\nI won't reveal anymore since the clip will \"speak\" for itself. It would require more work than just using title text, but who said doing great work was easy.\n\n"
    },
    {
      "time": "22 Sep 2005 — 7:51pm",
      "content": "Are you doing only text and the voice? If so, I like Hrant's and Norbert's idea of changing typefaces for different parts. I'm afraid that the 'dagger' faces, like Hrant's might be too much, except maybe for a few words like 'violence', etc.\n\nYou might use a newspaper face with some stuff as headlines and other as text. David Berlow's new Truth face might be just the thing. You can see his motion intro at the Fontbureau.com site. There are two motion intros to new typefaces, so if you get the other one, just refresh. So you could do the heavy weights for 'headline' information, the lighter weights for other parts, and a classic titling face for the poetry and the more poetic parts.\n\nIf you are going to used photos also, then probably the type will have to take a back seat, except maybe for the poetic passages which you could do in all type.\n\nThis sounds like quite a challenge but it could be really wonderful--great idea. Let us see the result!\n\n"
    },
    {
      "time": "25 Sep 2005 — 10:41am",
      "content": "If I may, could I ask the same question but in a sans serif? I appreciate your help—I've been thinking that a serif may not work as well in a motion piece. Visual clarity may be lost.\n\n"
    },
    {
      "time": "25 Sep 2005 — 5:23pm",
      "content": "\\> I’m looking for a somewhat sad serif that captures this mood\n\nI don't think that you need sad serif or sad sans; you're talking about something that is sad. The main thing is your clip. What do you have?\n\n"
    },
    {
      "time": "25 Sep 2005 — 5:39pm",
      "content": "I'm slightly confused by this post, what are you referring to when you speak of my clip?\n\nTo clarify, what I'm searching for doesn't itself look \"sad\", but is appropriate to work with the mood of this speech. The piece will be about 95% type, so type selection I feel will play a vital role here.\n\n"
    },
    {
      "time": "25 Sep 2005 — 8:03pm",
      "content": "\\> I am designing and animating....\n\nWhat kind of animation? motion? (software?)\n\n"
    },
    {
      "time": "26 Sep 2005 — 7:27am",
      "content": "Dante is in fashion, aside from being quite good.\n\n"
    }
  ]
}
