{
  "id": "15312",
  "title": "the great i.t. for the chopping block",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "hello  \nthis is my eeemm typeface called \" the great i.t.\",  \nbecause it is derived from a logo i made for the world famous  \nelectronic music group. i.e., a friends project. this logo is attached, as well.\n\nthe forms are very simple,and very thin,  \nso it is like the basic idea and form half finished:  \nuppercase letters have an exoskeleton, lowercase letters a endoskeleton,...\n\ni hope for input, i need to hear what you typophiles think about my great i.t.  \ni am prepared for all kind of support,  \nand rotten tomatoes, as well.\n\n| Attachment | Size |\n| --- | --- |\n| [it-logo.gif](http://web.archive.org/web/20150419062440/http:/typophile.com/files/it-logo.gif) | 2.55 KB |\n| [thegreatit\\_specimen.pdf](http://web.archive.org/web/20150419062440/http:/typophile.com/files/thegreatit_specimen.pdf) | 44.57 KB |\n\n",
  "author": "agitprop",
  "time": "23 Sep 2005 — 11:28am",
  "uid": "2290",
  "comments": [
    {
      "time": "23 Sep 2005 — 12:20pm",
      "content": "I think what makes it original is what you removed -- The idea of reverse traps -- why did you remove those?\n\n"
    },
    {
      "time": "23 Sep 2005 — 1:28pm",
      "content": "reverse traps?  \nyou mean those triangels?  \ni am planning to add those, as the second cut...  \nbefore i do this, i like to find good shapes.\n\n"
    },
    {
      "time": "29 Sep 2005 — 3:33pm",
      "content": "hello?  \nanything else?  \nsee i am not very happy with the sketch so far.  \ni would be happy about input,  \nsince i can´t see how to go on now.  \nthanks\n\n"
    },
    {
      "time": "14 Oct 2005 — 5:55pm",
      "content": "David,  \nI think you have to decide between making all the glyphs the same width or the same stem width. The E look very wide and the V and W look tiny and lost. You might want to limit diagonals to one or 2 angles. You might also use 2 different line weights, one to define the left side and one to define the right. This may not work either. I am just trying to figure a way for glyphs to differentiate more.  \nYou have tried a very tough problem but when you solve it, the result will look quite simple. Keep at it. Perhaps try some unusual grids to base it on.  \nI think Tiff is right about the triangles. They were helpful in differentiating glyphs as well as giving it a very unique look.\n\nChrisL\n\n"
    }
  ]
}
