{
  "id": "15319",
  "title": "Canterra Logo design",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello,\n\nI made this yesterday. Its kinda Goofy, but I am somewhat happy with it. Any advice out there on how to improve it?\n\nThanks,\n\n-Charles Borges de Oliveira\n\n| Attachment | Size |\n| --- | --- |\n| [finished logo.jpg](http://web.archive.org/web/20080103045555/http:/typophile.com/files/finished%20logo.jpg) | 81.31 KB |\n\n [‹ Jackie Blue](http://web.archive.org/web/20080103045555/http:/typophile.com/node/15564 \"Go to previous forum topic\") [script logo ›](http://web.archive.org/web/20080103045555/http:/typophile.com/node/15526 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080103045555/http://typophile.com/user/1657\" title=\"View user profile.\">Charles_Borges_...</a>",
  "time": "<br>",
  "uid": "1657",
  "comments": [
    {
      "time": " 23.Sep.2005 8.38pm",
      "content": "Hi.\n\nUsually when I make a logo design, there is a fair amount of research involved (depending on my background knowledge of the subject).  \nCould you, please, give us a short summary about the client/product?  \nThanks in advance :)\n\n"
    },
    {
      "time": " 25.Sep.2005 12.12am",
      "content": "The RRs feel just a touch dark. if I squint and look at them, they seem a little too dark. You might wish to lighten them a touch. Don’t take my word for gold. Maybe somone else could back me up here?\n\nOtherwise, I like the overall impression. Of course, I can only judge this on its technical merit.\n\n"
    },
    {
      "time": " 25.Sep.2005 9.58pm",
      "content": "I really like it.. Vintage, Share, Classy.. _( I may second that I dont know what / who this is for and the reasons behind it.. And, I dont quite understand why the ’t’, the ’r’s and the ’a’ are lowercase, but beside that, I really think its nice’n’lovely.. :)_\n\nDav, [formlos](http://web.archive.org/web/20080103045555/http:/www.formlos.net/)\n\n"
    },
    {
      "time": " 25.Sep.2005 10.07pm",
      "content": "I would make all of it (except the “C”) lowercase - you’d  \njust have to get a bit clever with the first “a” though.\n\nhhp\n\n"
    },
    {
      "time": " 26.Sep.2005 10.17am",
      "content": "Hello,\n\nThis logo is actually for a housing community. It reminds me of a 70’s Pub. I drew it Upper and Lowercase just to be different, I guess. Kyle, You’re right, when doing the squint test, the r’s do have a little more weight and mass to them. Thanks for pointing it out.\n\n-Charles Borges de Oliveira\n\n"
    },
    {
      "time": " 26.Sep.2005 12.17pm",
      "content": "I will disagree with Hrant. I don’t think it is important to have a unified case. As lon as the color and legibility are in place, it shouldnt be an issue. It gives it a little more character.\n\n"
    },
    {
      "time": " 26.Sep.2005 12.28pm",
      "content": "Mainly I worry that it might be seen as two parts, “CAN” and “terra”.  \nThe “E” helps, but if the mixed-case is kept maybe the “N” should go lc.\n\nhhp\n\n"
    },
    {
      "time": " 12.Oct.2005 3.08pm",
      "content": "I think your logo is very nice! I love logos in which the word itself is set in such a singular way that it becomes a unigue trademark and requires no additional symbol. I especially like the way the descender on the “t” and the bottom of the cap “C” follow the curve of the baseline. Mind sharing how you went about shaping the letters? Did you set the type on a curved line, convert it to outlines and then shape and redraw the “C” and the “t”?\n\n"
    },
    {
      "time": " 12.Oct.2005 4.02pm",
      "content": "Sure,\n\nI drew the logo with a pencil. Then I scanned the logo and traced it in Illustrator CS. Thanks for the kind words :)\n\n-Chuck\n\n"
    }
  ]
}
