{
  "id": "15351",
  "title": "Site design by theft",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Original: [http://www.macromedia.com](http://web.archive.org/web/20080908101404/http:/www.macromedia.com/ \"http://www.macromedia.com\")\n\nRip off: [http://www.motorbiketraining.net/](http://web.archive.org/web/20080908101404/http:/www.motorbiketraining.net/ \"http://www.motorbiketraining.net/\")\n\nI’m sure this is a non-profit’s way of saving money, but it’s always a bummer to see stuff this blatant.\n\n [‹ Typographical Flourishes](http://web.archive.org/web/20080908101404/http:/typophile.com/node/15435 \"Go to previous forum topic\") [Beauchamp: Pronounced “Rip-off” ›](http://web.archive.org/web/20080908101404/http:/typophile.com/node/15455 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080908101404/http://typophile.com/user/1160\" title=\"View user profile.\">Joe Pemberton</a>",
  "time": "<br>",
  "uid": "1160",
  "comments": [
    {
      "time": " 25.Sep.2005 2.44pm",
      "content": "Are you talking about the buttons across the top of the sites? I figured they were just part of a template or something. But web design, in general, is pretty rife with “code-copying.” It’s the nature of the medium, I think.\n\n"
    },
    {
      "time": " 26.Sep.2005 6.48am",
      "content": "_Go n’eiri an bothar leat.  \nMay the road rise to meet you._    \nThis is when it gets painful on a bike.\n\nBut it really doesn’t follow that one site copied the other just because it has a gradated background and dropdown menus, it looks pretty generic to me.\n\nTim\n\n"
    },
    {
      "time": " 26.Sep.2005 1.43pm",
      "content": "I agree with timid. There is a definite difference betrween being inspired by, and stealing, a design. This example is clearly not theft in any sense. It is VERY common in the design world to look to other’s work for inspiration. For good designers, this usually sparks avenues of ideas that lead to a finished product that bears little or no resemblance to the work that gave them their inspiration. For less experienced designers, it may lead to solutions like the example you show above, but it still isn’t theft.\n\nWhat does equate to theft, for me, is direct copying, with very subtle changes. I once was browsing an HTML template site that sells prepared site templates (don’t ask!), and what I saw there appalled me. They had directly copied the site of a well-known Florida-based interactive design firm, changing only the headline copy. What’s worse, they were selling it as their own work. Of course I promptly emailed the firm regarding this.\n\n"
    },
    {
      "time": " 26.Sep.2005 1.49pm",
      "content": "I haven’t got a current copy, but is it possible that the motor bike site was made with some kind of Macromedia Dreamweaver template?\n\n"
    },
    {
      "time": " 26.Sep.2005 1.59pm",
      "content": "I agree with Joe. There’s too many similarities to attribute it simply to inspiration. This is more than inspiration, since almost every design element on the Macromedia site was copied. There’s the navigation, sub navigation, placement of logo, rounded corners, and gradient background.\n\nIf you only used a couple of these elements in your own design and developed it further, that’d be fine... but when you take all of the design elements including the color scheme, I’d say that’s theft even if you don’t copy the code.\n\n"
    },
    {
      "time": " 28.Sep.2005 9.44am",
      "content": "Yeah, it’s almost as if Macromedia sells some product that enables rapid web design, and uses this product on their own site. The nerve of these Macromedia customers - using the product they paid for for its intended purpose!\n\n:-)\n\n"
    },
    {
      "time": " 29.Sep.2005 10.26pm",
      "content": "i agree w/jp. thievery.  \nSTEP, while i was getting it for free, had a nice article about design theft in their july/august issue.\n\nOne quote to get the brain goin:\n\n“Creations patterned after others’ work are clearly not plagiarism if, like in footnoted writing, the original that they are modeled after is declared.”\n\nAlso..as the STEP article brings up...  \nIs it Quotation? Appropriation? Homage? Parody?  \nThe bike site doesn’t fall under any of those categories.\n\nWhat if the client had said, “We want this to look like that Macromedia site.” Would you do it?\n\n"
    },
    {
      "time": " 1.Oct.2005 8.24pm",
      "content": "In other developments, [typeworkshop](http://web.archive.org/web/20080908101404/http:/www.typeworkshop.com/index.php) = [underware](http://web.archive.org/web/20080908101404/http:/www.underware.nl/site2/index.php3)?\n\n"
    },
    {
      "time": " 1.Oct.2005 9.10pm",
      "content": "Typeworkshop IS Underware.  \nYou are alowed to rip off yourself :-)\n\n"
    },
    {
      "time": " 2.Oct.2005 2.22am",
      "content": "I still don’t agree that Macromedia’s site is so distinctive that a designer couldn’t create something that looks very similar without seeing the original. The blocks of information are laid out in a logical way; name, contact details, content menus, content, against a neutral gradated background with embossed menu bar.  \nTim\n\n"
    },
    {
      "time": " 2.Oct.2005 7.26am",
      "content": "OMG this is going to bankrupt Macromedia!!\n\n"
    },
    {
      "time": " 2.Oct.2005 12.08pm",
      "content": "Yes, I find that I rip myself off constantly.\n\npd\n\n"
    },
    {
      "time": " 2.Oct.2005 4.39pm",
      "content": "_Typeworkshop IS Underware.  \nYou are alowed to rip off yourself :-)_\n\nWell, you learn something new every day!\n\n"
    },
    {
      "time": " 2.Oct.2005 7.35pm",
      "content": "i’ve been cracking my head to wonder wether is there any similarities between typeworkshop & underware for a while too! lol.. yup, its a learning process. ;-)\n\n"
    }
  ]
}
