{
  "id": "15367",
  "title": "New Type Term",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "So once in a while I see the need for a new term in type design (yeah, like \"bouma\") generally to make discussion easier/clearer. This time it actually came to me as a result of reading a passage in Dreyfus's \"Type specimen facsimiles\" - so actually maybe this term was in fact used by people before - but I'd never seen it before, and it's sorely needed.\n\n[Depth](http://web.archive.org/web/20131017023403/http:/typophile.com/wiki/Depth): the degree of extenderness of a typeface. So for example Mrs Eaves is somewhat deep, while ITC Cheltenham is very shallow. We often need to say things like \"the x-height is too generous\", but that's too clunky. So instead you could say \"it's too shallow\". You could even say things like \"the depth is good, but too high\", meaning that the x-height is fine but the ascenders are too long compared to the descenders.\n\nWhat do you guys think? Unless somebody convinces me otherwise I think I'm going to start using the term right now, probably with a little wiki to refer to. I just hope it doesn't take as long as bouma to engrain - that took a lot of work, and I'm not font-young any more.\n\nhhp\n\n",
  "author": "hrant",
  "time": "26 Sep 2005 — 9:37am",
  "uid": "1250",
  "comments": [
    {
      "time": "26 Sep 2005 — 10:45am",
      "content": "I like the concept, Hrant, So let's hash out the usage and definition.\n\n<cite>Depth: the degree of extenderness of a typeface</cite>  \nI think that \"extenderness\" is a difficult word to define another term by.\n\nI propose: \"Depth: The degree of difference between a typeface's x-height and its extenders.\"\n\nThen we can define \"Deep: A large degree of difference between a typeface's x-height and its extenders\" and \"Shallow: A lesser degree of difference between a typeface's x-height and its extenders.\"\n\nMy only trouble with using these terms is that \"shallow\" is related to less and \"deep\" is related to more but a \"shallow\" typeface would have a greater x-height. I do get the \"deepness\" of mrs eaves when I look at it, but when I call it \"deep\" it feels contradictory.\n\nSo then I wonder if the term is necessary, considering that it kind of boils down to deep=lesser x-height and shallow=more and depth=relative x-height. Let's see more potential usage and then, if necessary, look for other potential analogies.\n\n"
    },
    {
      "time": "26 Sep 2005 — 10:47am",
      "content": "Do you mean depth as a font is extended or condensed (horizontal depth) or do you mean Xheight is big or small? I don't mind a term which helps but I would hate to see a term which would cause more confusion.\n\nChrisL\n\n"
    },
    {
      "time": "26 Sep 2005 — 11:37am",
      "content": "Interesting. I'm not aware of any other terms that have the same meaning, and I agree that a term would be useful.\n\nIs _depth_ similar to [color](http://web.archive.org/web/20131017023403/http:/typophile.com/wiki/color) in that it's a pretty obscure reference? It's not immediately clear what it means, whereas x-height and word space are much more descriptive. But, I realize it's more difficult to get a concise word if something like depth is describing relationships and relative sizes.\n\nChris (DezCom) has a good point. We're so used to seeing \"extended\" in terms of weight or horizintal width.\n\n"
    },
    {
      "time": "26 Sep 2005 — 12:13pm",
      "content": "Hrant, can you give us the full quote(s) from Dreyfus, showing how _he_ uses the term? The term depth seems to make a lot of sense when talking about descenders, but I don't really understand the other ways in which you are trying to use it.\n\n"
    },
    {
      "time": "26 Sep 2005 — 12:33pm",
      "content": "just a clarical note, because i needed to reread his original post to get it, Hrant's definition is based on his term \"extende **r** ness\" which initially reads as \"extende **d** ness.\" Extenders being the ascenders and descenders, of course.\n\nedit: extender is not his term, rather adding the ness is unusual.\n\n"
    },
    {
      "time": "26 Sep 2005 — 12:39pm",
      "content": "John, I first thought he was talking about descenders too, plus I was getting sleepy (watching the Brazil race in the background late at night; after lap 5 it was pretty boring - congrats to the Spaniard though) so I re-read it twice:\n\n\"  \nThe Types of Baskerville, 1754\n\nIn England the continuing vogue of Caslon's types maintained the  \ntraditional proportions, and the Great Primer and Pica Roman and\\*  \nItalic ... are hardly more than tentative departures from the  \ntraditional relations of depth and width. It is an important fact,  \nhowever that his descenders (g, p, q, etc.) are shorter than Caslon's.  \n\"\n\n\\* A good place to use an ampersand, I say.\n\nThat last bit especially -in the context of \"hardly more than tentative departures from ...\"- makes me think he didn't mean [just] descenders.\n\nBut anyway, I'm not saying he used the term the way I'm proposing we should - it was more of a terminological inspiration.\n\nMore soon.\n\nhhp\n\n"
    },
    {
      "time": "26 Sep 2005 — 12:54pm",
      "content": "Which is DEEP, the extender or the xheight? If the extender, why not just tall or short extenders? If xheight, why not large or small xheight? If we want to give a ratio to be more precise, typically not something like 3-5-2 (3 being ascender, 5 being xheight and 2 being decender. [or 5-5-5 for a \"tall\" script?]. I am borrowing this from calligraphy where heights were in \"pens\"--stroke widths. We could also use UPM.\n\nChrisL\n\n"
    },
    {
      "time": "26 Sep 2005 — 1:41pm",
      "content": "How is bouma clearer term than word shape?\n\nBouma is a national park in Fiji.\n\n"
    },
    {
      "time": "26 Sep 2005 — 1:52pm",
      "content": "\\> How is bouma clearer term than word shape?\n\n1) It's shorter.  \n2) It doesn't have the word \"word\" in it. A bouma is not necessarily a whole word. We don't read whole words, nor do we read only individual letters - we read clusters of letters, which are sometimes whole words (when short, frequent and distinctive enough) and sometimes single letters (when/where the fovea provides total clarity). So it's clearer because it's [much] more accurate.  \n3) It avoids all the old (lost) baggage - it's a clean break from all the confusion, misinformation and \"customization\" to ones ideological preferences that circulates as valid theory. \"Serifs are like train tracks.\" Riiight.\n\nAnd Fiji works for me too.\n\nhhp\n\n"
    },
    {
      "time": "26 Sep 2005 — 2:41pm",
      "content": "\\> “Depth: The degree of difference between a typeface’s x-height and its extenders.”\n\nMore like the <cite>proportion</cite> between the various vertical measures.  \nEssentially between the x-height and the rest though, yes.\n\n\\> My only trouble with using these terms is that “shallow” is related  \n\\> to less and “deep” is related to more but a “shallow” typeface would  \n\\> have a greater x-height.\n\nBut it's not about the x-height, it's about the <cite>variation</cite>. Like how a gentle water wave is shallow.\n\n\\> Do you mean depth as a font is extended or condensed (horizontal  \n\\> depth) or do you mean Xheight is big or small?\n\nNo, strictly vertical.\n\n\\> I don’t mind a term which helps but I would hate  \n\\> to see a term which would cause more confusion.\n\nBelieve me, I don't like frilly, redundant terminology either. Maybe it was too much calling it \"sorely needed\", but it's still better than the clunky stuff we have now. As for potential confusion, I think there's less than with \"color\", and except for impression depth in letterpress, or maybe the \"neck\" of metal sorts (which are outside the context of our particular \"2D\" world) I can't think of what else it could be taken for.\n\n\\> Is depth similar to color in that it’s a pretty obscure reference?\n\nThat's an interesting terminological parallel, in that you sort of have to look beyond the obvious to understand them. Well, I'd say right now it's much more obscure than \"color\"! :-) But if you mean it can't ever become non-obscure, I have to agree.\n\n\\> If we want to give a ratio to be more precise\n\nI think quantification can often impede good discussion.\n\n--\n\nA good example of the usefulness of \"depth\" can be seen here:  \n [http://typophile.com/node/15369](http://web.archive.org/web/20131017023403/http:/typophile.com/node/15369 \"http://typophile.com/node/15369\") \\_  \nI would have had to write a whole long phrase instead.\n\nSo you could say for example:  \n\"Electra is too deep to be a good news face.\"\n\nAnd a type geek could critique Bernhard Modern\\* thus:  \n\" **Man** that depth is huge and high.\"  \n:-)\n\n\\* [http://www.myfonts.com/fonts/ef/bernhard-modern-b/reg/charmap.html](http://web.archive.org/web/20131017023403/http:/www.myfonts.com/fonts/ef/bernhard-modern-b/reg/charmap.html \"http://www.myfonts.com/fonts/ef/bernhard-modern-b/reg/charmap.html\")\n\nhhp\n\n"
    },
    {
      "time": "26 Sep 2005 — 3:05pm",
      "content": "Dreyfus seems to be using depth in the same way that I would use height ('hardly more than tentative departures from the traditional relations of height and width'), which is why I don't think it is a good term for what you are talking about, which is length of extenders relative to x-height. Better not to repurpose existing terminology.\n\nI think what you want needs to include the notion of extent, because it is extent beyond the x-height that you are describing. And since this is both ascending and descending I don't think 'depth' makes any sense. Personally, I think I'll probably stick with describing typefaces as having long or short extenders. This seems to me both efficient and precise.\n\n"
    },
    {
      "time": "26 Sep 2005 — 3:18pm",
      "content": "You really think he had a problem just using \"height\" when he meant it?\n\n\\> Better not to repurpose existing terminology.\n\nI agree. But his use of \"depth\" there is hardy common.  \nAlso, using \"short\" and \"long\" to describe both ascenders and descenders I think is better than \"tall/short\" for the former and \"deep/?\" for the latter.\n\n\\> having long or short extenders\n\nYou know, that would indeed be ideal. But too many times I've read descriptions which treat the elements like extenders and x-height outside the critical context of the em square, sort of like it's still all physical - and I think that's an instinctive thing that's hard to overcome. Like this example:\n\n\"  \nAn aspect of Baskerville type that I intended to retain is that of overall openness and lightness. To achieve this while reducing contrast, I have given the lowercase characters a wider proportion. In order to avoid increasing the set-width, I reduced the x-height, relative to the cap height.  \n\"  \nSheesh.\n\nSo maybe like my point #3 in defence of \"bouma\" above,  \nwe need a clean break? Dunno - maybe not in this case.\n\nhhp\n\n"
    },
    {
      "time": "26 Sep 2005 — 3:44pm",
      "content": "I really like your wave analogy, and I think it might work. Amplitude seems to give the right idea but unfortunately does not have the easy descriptors deep and shallow, maybe nautically it'd be choppy and smooth. I do, however, have a good understanding of depth in that context.\n\n"
    },
    {
      "time": "26 Sep 2005 — 3:49pm",
      "content": "Chris, what's UPM?\n\nI think it's fine to keep using the language of (long or short) extenders, but I also like the idea of having a simpler way to refer to vertical proportions.\n\nWhat about something like _nad ratios_ (= _n:ad ratio_ or _n:a:d ratio_, where _n_ = the height from baseline of neutral characters; _a_ = the height from baseline of characters with ascending components; _d_ = the depth below baseline of characters with descending components)\n\nBernard Modern has a steep n:ad ratio. Classical n:a:d ratios are proportionate. How do WAD's legibility series fonts come out?\n\n"
    },
    {
      "time": "26 Sep 2005 — 4:42pm",
      "content": "Hrant, have you gotten to see the essay from the latest Interrobang about \"A New Typometry\"? It proposes terms and quantifiables for such features as xheight/ascender ratios. It does go a lot farther than adding a term to existing vocab, though.\n\n"
    },
    {
      "time": "26 Sep 2005 — 8:15pm",
      "content": "If that is the case, than letter cluster is a better term. It defines what it is in normal english, and does not rely on jargon to obsucre its meaning.\n\nLetter cluster --- Yes\n\nBouma ---- a national park in Fiji\n\nThank you!\n\n"
    },
    {
      "time": "26 Sep 2005 — 9:49pm",
      "content": "It's not just a letter cluster. It's the basic unit of reading, that gets \"deciphered\" in a certain way, based on semantic context, frequency and distinctiveness. Using \"letter cluster\" is more confusing, because it's too vague, too open to personal interpretation, and has too much baggage. Also, the concept of bouma is relevant to writing systems that that don't even have letters (like Chinese). Like any useful term, it's shorthand and an abstraction. Do you call a car a \"combustion engine driven civilian transport\"?\n\nhhp\n\n"
    },
    {
      "time": "26 Sep 2005 — 11:01pm",
      "content": "\\> choppy and smooth\n\nOoooh. Like a \"choppy depth\" would be if a font's x-height varried erratically. So for example John might point out that \"the depth of the first Greek types is much choppier than in later designs.\"\n\nPeter, I think \"something-ratio\" would indeed work. I don't know about \"n:a:d\" though - sounds like a Matthew Broderick movie...\n\nCarl, is that Jorge de Buen's thing? I've read an earlier paper by him on the subject. Extremely useful work - I hope it gets the airtime it deserves. Where can I get a copy of the latest Interrobang?, I mean: ?!\n\nhhp\n\n"
    },
    {
      "time": "27 Sep 2005 — 5:12am",
      "content": "James, I agree with Hrant. Bouma expresses that the letter cluster forms a unity, or 'bounded map'--as I like to say--, of visual particulars at a specific grain of vision. A bounded map with an object-like consistency for vision. To discuss perceptual processing in reading effectively it is useful to have such a term.\n\n"
    },
    {
      "time": "27 Sep 2005 — 5:28am",
      "content": "I think the term bouma is just some over-intellectuallized mumbo-jumbo. But hey, if it makes you feel smarter, go ahead and use it. The fact that it only seems to exist in discussions on on-line communities lead by Hrant may say something about the term.\n\n"
    },
    {
      "time": "27 Sep 2005 — 6:10am",
      "content": "Ene,\n\nUPM means \"Units Per M\" typically 1000. I meant to use the same system Font design software uses to describe xheight ascent and descent.\n\nChrisL\n\n"
    },
    {
      "time": "27 Sep 2005 — 7:02am",
      "content": "James, in studies of perceptual processing in reading the question of the perceptual unit is fundamental. This is acknowledged in every domain-relevant study. Why should a term which brings such discussion to a head be dismissed as over-intellectualized mumbo-jumbo.\n\nIs it that discussions of perceptual processing in reading don't interest you, or that you find them hard to sort your way through, or that you don't see the connection with what you do?\n\nI would think type-involved people would welcome and encourage exploration of perceptual processing in reading at the level at which they are pursue at in the psychological and cognitive scientific literature. I don't think I feel smarter, and it's not for everyone, but I do think sustained exploration-- with bouma-concept in hand--has given me a better understanding of why, among other things, strategic construction of letterforms, a well-motivated and consistent contrast scheme, and 'space-craft'--typographical obsessions all--matter.\n\nYou proposed a more accessible term, but it doesn't cover the same ground.\n\n"
    },
    {
      "time": "28 Sep 2005 — 4:08am",
      "content": "James,\n\n\\> I think the term bouma is just some over-intellectuallized mumbo-jumbo\n\nSpot on. If 'bouma' is different from 'word shape' perhaps Hrant should submit a better wiki entry for it than \"see word shape\"\n\nAs for the rest of the thread – Why use the word depth to describe something that, in a strict sense, has no depth? It can only serve to confuse, and this thread is testament to that.\n\nTypography has enough obscure terminology as it is, adding more for the sake of amusing a small clique of hrantophiles just makes the whole subject less accessible to everyone.\n\n"
    },
    {
      "time": "28 Sep 2005 — 6:50am",
      "content": "\"over-intellectuallized mumbo-jumbo\"  \n\"self-agrandizing rubbish [...]\"  \n\"for the sake of amusing a small clique of hrantophiles\"\n\nI can only see this as a resistance to wanting to discuss the mechanics of perceptual processing in reading at an appropriate level of terminological care. In today's usage, 'word shape' refers either to 1) envelope structure or 2) the raw pattern of meutral, ascending and descending characters. As I tried to say in my Thessaloniki 2004 presentation, this is too crude a notion of word shape. There is a lot it leaves out. And it's ommissions are part of the reason the ascendancy of a parallel letter recognition model of word recognition could take hold. (I don't think such a model is fully up to the task of providing support for what type involved practitioners see as important in type design and typographic practice.) Other candidates, like 'total word form' or 'distinct word image' are as open as 'word shape' to 'inadequate formalizations'.\n\nEither we need an expanded notion of 'word shape', or a new term. For those of us who read Taylor and Taylor's _Psychology of Reading_ and Peter Saenger's _Space Between Words_, 'bouma shape' provided an relevant candidate for a new term which could include the internal form of the word contained within the envelope and created by a word's unique pattern of positive and negative shapes at the level of stems and crossbars , angular components and counters. A denser notion of wordshape if you will.\n\nPerhaps you do not like the term 'bouma' or 'bouma shape' or you do not see it as a necessary _typographical_ term. (If you think of it as 'a bounded map of visual particulars at the internal form, both black and white, level' the term becomes transparent to a meaning: bouma becomes a truncated form of 'bounded map', as well as a tribute to a pivotal psychologist of reading.) So I think, that in discussions of perceptual processing in reading it has a use, or at least that what it's introduction into the discussion tries to acheive is important.\n\n"
    },
    {
      "time": "28 Sep 2005 — 8:11am",
      "content": "For the record, with the initiation of Forrest, I once edited a wiki entry for \"bouma\" to a decent state - but then it disappeared. Coupled with the brittle reliability of the wiki section, I'd really rather spend the time discussing things. Terminology can sometimes get in the way as much as help anyway.\n\n\\> has no depth?\n\nThink beyond the plane.\n\n\\> for the sake of amusing a small clique of hrantophiles\n\nThere is no court, and I'm not a jester.\n\n\\> less accessible to everyone.\n\nNo, only to those who are afraid.\n\nhhp\n\n"
    },
    {
      "time": "28 Sep 2005 — 9:07am",
      "content": "\\> It’s not just a letter cluster. It’s the basic unit of reading, that gets “deciphered” in a certain way, based on semantic context, frequency and distinctiveness\n\n\\> How is bouma clearer term than word shape?\n\n\\>1) It’s shorter.  \n2) It doesn’t have the word “word” in it. A bouma is **not necessarily a whole word**. We don’t read whole words, nor do we read only individual letters - we read clusters of letters, which are sometimes whole words (when short, frequent and distinctive enough) and sometimes single letters (when/where the fovea provides total clarity). So it’s clearer because it’s [much] more accurate.\n\n\\> Bouma expresses that the letter cluster forms a unity, or ‘bounded map’—as I like to say—, of visual particulars at a specific grain of vision\n\n\\>While the paleographer's principle focus has been on the classification of individual letter forms, the student of the history of reading in the medieval West is primarily concerned with the evolution of the word shape, and the letter forms are important only to the degree that they play a role in determining that shape. Thus, the adoption of miniscule, that is, lowercase letters, as a book script is significant for the historian of reading insofar as it contributed, in conjunction with word separation, to giving **each word** a distinct image. Modern psychologists call this image the Bouma shape.\n\nPaul Saenger, Space Between Words. The Origins of Silent Reading 18-19.\n\nProblems:\n\n1) - the question of which is the clearer term out of word shape/bouma is irrelevant if those terms are describing two different things (as hrant insists they are).\n\n2) - People's definitions of bouma are contradictory, and this coupled with the fact that the term itself is not self explanatory doesn't make \"discussion easier/clearer\".\n\n3) A concise and straightforward definition would help make clear the difference from 'word shape'. At the moment the most that can be gleaned from this thread is that bouma is concerned with groups of shapes that may or may not be whole words, it isn't the same as word shape, it includes \"visual particulars\", and semantics, frequency and distinctiveness are all involved somehow.\n\nHow much clearer do you need?\n\n"
    },
    {
      "time": "28 Sep 2005 — 9:26am",
      "content": "\\> if those terms are describing two different things\n\nBut they're not. They're trying to descibe the main element of how we recognize visible language - they just disagree with what it is. But since we don't read whole words (except when they happen to be boumas) the term \"word shape\" is bad.\n\n\\> People’s definitions of bouma are contradictory\n\n1) And those for \"word shape\" are not?  \n2) Nobody should expect perfection. Humans -and their languages- are fuzzy and dynamic.  \n3) It's a lot less contradictory than a bunch of other type terms that nobody complains about, that almost everybody merrily uses - like \"color\"!\n\nIf you'd like a good idea of what a bouma is, please read my article in TYPO #13. It's freely accessible online.\n\nhhp\n\n"
    },
    {
      "time": "28 Sep 2005 — 10:40am",
      "content": "Hrant, your 1) 2) and 3) are dodges. Technical terms should strive for precision and and univocality of reference. Neither of these things are fully attainable. Precision is never absolute and univocality--meaning one and only one thin--is hard to sustain, because a theory is always a construction site. But that's no excuse for ambiguity and unsharpness.\n\nI think it's regretable that there isn't greater agreement between myself and Hrant on how to apply the term, given it's pedigree. A word is a concrete thing. A bouma is an abstraction. I would say our reading of familiar words is bouma-based, that is, based on processing them as perceptual units or wholes according to their internal figural compositon (their internal figural composition encompassing the black (stems, bowls, angular components) and the white (counters, between letter shapes, abscences of closure). The significance of this might become apparent if we consider that most theories of reading construct fluent reading as involving some form of internal spelling or phonological computation from independantly identified parts (letters) at every fixational juncture.\n\n"
    },
    {
      "time": "28 Sep 2005 — 10:50am",
      "content": "\\> Precision is never absolute and univocality\n\nHow is that not a dodge if my stuff is?  \nBut I certainly agree that we need to clarify things.\n\n\\> there isn’t greater agreement\n\nIf we disagree on exactly how people read, that's one thing. But if we agree enough -specifically here that the unit of reading is a cluster of letters- then we can both use \"bouma\" just fine. Kinda like you're doing right now!\n\nBut really, no two people will ever agree 100% what a term means (even if it's technical). You might sometimes approach such totality, and that becomes total for practical purposes, but it's still not Perfect. Which of course is wonderful.\n\nhhp\n\n"
    },
    {
      "time": "28 Sep 2005 — 11:06am",
      "content": "\"How is that not a dodge if my stuff is?\"\n\nBecause you seemed to be arguing for fuzzyness and making an apology for contradictoryness.\n\n"
    },
    {
      "time": "28 Sep 2005 — 11:15am",
      "content": "Does a hyena apologize for his smell?\n\nhhp\n\n"
    },
    {
      "time": "28 Sep 2005 — 11:36am",
      "content": "So you were making an apology for contradictoryness?\n\n"
    },
    {
      "time": "28 Sep 2005 — 11:53am",
      "content": "\"...most theories of reading construct fluent reading as involving some form of internal spelling or phonological computation from independantly identified parts...\"\n\nA perfect example of this is my misread of Hrant's first post. I read \"Extendedness\" where he had written \"Extenderness\". My internal dictionary came up with the more familiar word to me.\n\nChrisL\n\n"
    },
    {
      "time": "28 Sep 2005 — 12:01pm",
      "content": "An exceptional instance of such... expectedness :-) happened to me on the ATypI list a while back: replying to a post by John Hudson, Fiona Ross wrote [something like] \"my view is apposite to John's\". I read that as \"opposite\", which has the... opposite meaning to \"apposite\"! This, even though: it was in Courier, a highly deliberatively-read face; the difference was in the initial letter, the most distinctive part of a word/bouma; and I knew that Fiona generally <cite>agrees</cite> with John, and has very rarely disagreed with him in public. It took a couple of lines to realize something was fishy, and I had to start from the beginning.\n\nhhp\n\n"
    },
    {
      "time": "28 Sep 2005 — 2:48pm",
      "content": "\\> the term “word shape” is bad\n\nI think this is obvious too. As a descriptive term it's a kind of endless self refferential ride you can't get off of. 'Bouma' is better because like 'typographic color' it is abstract enough to take on definition & clarity over time. Even if it is so vague on initail contact that it means nothing - like a new word for some novel kind of food on the menu - eventually we find out what the word means and sometimes the specificity is utterly worthwhile. Once Ramen, Tamale or Yqem may not have meant much to you chances are today you know what some of these things are - and I think you would not prefer to see them described as noodles, Fried stuffed pepper, or Dessert wine. Why? because they are inadequite descriptions. English is a great language in part because it takes on new words so readily. You can resist if you want but the tide of english is against you.\n\nComing up with a term we all like for the relationship of asceder/descender sizes either together - or for my money seprately - or better still one for each & then one for the combination for a total of three - is a fine & worthwhile thing to do! I would guess that ready acceptance will be easier if the terms suggested are closer to common english like 'arm' & 'bowl' & less initially obscure like 'bouma'. But even if they are initially opaque, I say let's have them!\n\nI think that one of the reasons that easy desription may be hard & an opaque sounding term inevitable is the relationship of the structures to our bodies. We mostly all have arms like on a 'T'. Foot the same way. We don't have asceder-like or descender-like shapes unless you count our heads or genitals or legs. These shapes are centered or occcur in pairs, and our recognition of them requires that the be centered or paired. Asceders & descenders don't match well.\n\nPersonally I don't hate the term depth, but I would preffer to retain it exclusively for offset impression where it fits absolutely.\n\nThe idea of ratios seems nice but it doesn't lend itself to the use that Hrant described. Where you could substitute one of three possible observations readily fot x-height in a sentance like this: \"That font has a large 'x-height' \". That's the goal we should be shooting for: easy use.\n\n"
    },
    {
      "time": "28 Sep 2005 — 3:01pm",
      "content": "Hmmm, what about \"armature\" instead of \"depth\"? Because -in Latin at least- the extenders are like things coming out of a central part (the x-height).\n\nhhp\n\n"
    },
    {
      "time": "28 Sep 2005 — 3:59pm",
      "content": "Armature is certainly the kind of word that I would like ideally speaking. In that it is a part of existing english. And it is really very descriptive!\n\nThe thing about armature is that I associate it with a kind of supporting understructure. Like steel in a skyscraper or bones in your body. Armature would be a good term to describe the centerline of a font shape. Not seen- but part of a theoretical analysis of the understructure of a font. Like at the base of an engraved letter.\n\nI am still trying to make sure I am fully grasping the idea you want the term to express or I would maybe suggest a term too. I need to re-read the thread at least once more.\n\n"
    },
    {
      "time": "28 Sep 2005 — 4:52pm",
      "content": "Eben, I like your riff on terms a lot. And I like to shave myself with Occam's razor. But seriously (and at the risk of irking those who dislike terminological play or exploration), something like nad-ratio is no less descriptive and easy to use than x-height (when you know the code) than nad-ratio is more puzzling than x-height (when you don't, and encounter it for the first time). \"This font is generous and proportionate in the horizontal plane, has large x-heights for it's assigned point sizes, but it has a pinched nad-ratio in the vertical plane, making it unsuitable for extended texts because the cue value of the extenders is compromised and frequently eclipsed but the salience of the counters.\" (I'm not saying nad-ratio is the term you're after, Hrant, but I do prefer it to depth or armature)\n\n"
    },
    {
      "time": "28 Sep 2005 — 10:29pm",
      "content": "Thanks Peter!\n\nThis may be less succesful but here it goes.\n\nThe key idea being worked up here has everything to do with **relative** difference in size of ascenders & descenders to an x height. The differences are actually relative in two ways.\n\nOne - obviously - relative to x height (or maybe some other chosen measure too?)\n\nTwo - As defined by as we like to say 'our eye'. This is of course the relative perception of looking good, balanced, or whatever terrm we choose. I think this second kind is actually more juicy and more relavant.\n\nBecause in both cases a relative/subjective nature is being invoked rather than a rational/measured/precise sense, I suggest we try out the term the term 'divergence'. We could also use the term dis/proportional for a all the font's relative sizes. Maybe we do already...\n\nDivergence in plain english means separation of one thing from the other - to 'diverge from a path' means to leave the path and choose another. It also means departure from a norm; or a deviation. It's this second sense that interests me.\n\nLooking back again, the focus of the terms 'deep' and 'shallow' is on depth - just the vertical. The idea being described is not really about the vertical but instead relative verticality or height - or I would argue that more precisely we are talking about a degree of vertical compared to a loose idea of what is 'normal' or perhaps typical. Some people are still alergic to 'normal'...\n\nSo for example we could say 'I think these ascenders are divergent from the x height' - meaning they are biger or smaller than I expected given the x height. Or ' I think this font is divergent from it's own x height' meaning that the asceders & descenders are too long or short. Or if the term is really accepted then we could just say 'this font is divergent'.\n\nIf that's fine, then by my self imposed standards I aught to find a way of of indicating the degree of divergence & maybe a way of indicating if it is descender or ascender or both.\n\nUsing a term like Divergent implies that we should be able to say the opposite - that the font ascenders are proportionate to it's X height. Hmm That the font 'Conforms'?\n\nI do still like body references in type - they seem more traslatable & intuitive - so for overly tall ascender maybe I could say it 'reaches' and for too short we could say it 'crouches'.\n\nwhaddaya think?\n\n"
    },
    {
      "time": "28 Sep 2005 — 11:39pm",
      "content": "_and I knew that Fiona generally agrees with John..._\n\nAs I think I said at the time, it would be more accurate to say that I generally agree with Fiona.\n\n"
    },
    {
      "time": "28 Sep 2005 — 11:48pm",
      "content": "I tend not to use the term bouma very often, but not because I think there is anything wrong with the term itself. I think Hrant usually begs the question when he uses it, because he assumes that it is phenomenologically central to the reading process, while I'm not willing to commit to that. My definition of bouma, or bouma shape, would be something like 'a subcategory of letter cluster recognised as a unit during reading', which is what I understand Hrant to be saying. So in terms of distinguishing this kind of letter cluster from other kinds of letter clusters -- distinguished, that is, by its supposed role in reading --, I think having a distinct term is useful.\n\nExactly what the role of such letter clusters is in reading remains inconclusive.\n\n"
    },
    {
      "time": "29 Sep 2005 — 11:11am",
      "content": "Eben, relativism is in fact exactly why I shy away from John's -otherwise plenty adequate- \"long/short ascenders/descenders\" scheme: many people -even seasoned type designers- seem to tend to think of the extenders as coming out of an x-height <cite>that's fixed in size</cite>. So for example they might say \"Mrs Eaves has long extenders\" instead of \"the ratio of extenders to x-height in Mrs Eaves is high\". Considering that everything has to fit in the EM (things like Zapfino excepted) the latter is a much more useful way to think about things, but it's not \"natural\", and it's cumbersome. I think we can hope to remove at least the second of these problems with something like \"depth\" or whatever.\n\n\\> it would be more accurate to say that I generally agree with Fiona.\n\nDunno - you make more posts!\n\nhhp\n\n"
    },
    {
      "time": "29 Sep 2005 — 1:33pm",
      "content": "_...you make more posts!_\n\nYes, but she knows a lot more than I do. :)\n\n"
    },
    {
      "time": "29 Sep 2005 — 1:41pm",
      "content": "Hrant, when people talk about a typeface having long extenders, they usually mean 'relative to the x-height', and I don't think people do think of the latter as being fixed in size. Actually, the ascender height and descender depth are much more likely to be fixed in size, relative to the body (types cast small on the body, like Perpetua, are unusual). So this is why the observation that a typeface has a small x-height is actually more common than the observation that it has long extenders.\n\nThere is another thing to take into account when describing a face as having long extenders, and that is cap height. When I think of long extenders, I think not only of a relatively small x-height, but of tall ascenders that extend well beyond the height of the caps.\n\n"
    },
    {
      "time": "29 Sep 2005 — 2:04pm",
      "content": "\\> There is another thing to take into account\n\nThats a good point - a very good one. But would you try to get the term to describe this? I guess that you could say for instance that it's reaching beyond cap height...\n\nBut my question is in general do you agree that the visual judgement of being too this or that is the thing thats important/useful to associate the term with?\n\nPut another way I am suggesting that it's already easy to say 'the asceder goes beyond the cap'. It's directly observable, and we have the language already really. But Hrant's 'too deep' or my 'reaching' are more of an unprovable point of view, a characterization or a judgement call. And we don't have an easy way of saying this kind of thing yet.\n\n"
    },
    {
      "time": "29 Sep 2005 — 3:02pm",
      "content": "I am quite comfortable with John's way of addressing questions of description in the vertical plane of type. Characterizations like too deep or too shallow might be useful, but are indeed judgement calls and we need an axis of reference to make them understandable (and quantification to make then testable). That axis of reference can either be spelled out in longhand or implied (as John suggests) or it can be specified in a cryptic shorthand: n:a(x):d = 1:1:1 / n:a(b):d = 1:2:1 / n:a(b)+d = 1:3 / n:e(xb or n) = 1:1 (can you guess what 'x', 'e(xb or n)' and 'b' represent?)\n\nI doubt if one plain language term will do the job cleanly. But we could meningfully say an n:e(xb or n) ratio of 1:1 or thereabouts is too shallow or too steep or just right for easy readability at a conventional text size and no leading.\n\nSo if we want quantification, and sometimes we do, we will have to talk ratios. Here in longhand and a different order are several of the options coded above, plus a bonus one inspired by John's post:  \n1) neutral : ascent (relative to the baseline) + descent (relative to the baseline)  \n2) neutral : ascent (relative to the x-height) : descent (relative to the baseline)  \n3) neutral : cap height : ascent (relative to the baseline)  \n4) neutral : extender extent (beyond baseline for descenders / beyond x-height for ascenders or relative to (but not including) the x-height of n) This one only works if the 'a' extent and 'd' extent are the same.  \nThese seem to give the clearest picture of the height parameters of the font.\n\n"
    },
    {
      "time": "29 Sep 2005 — 3:16pm",
      "content": "\\> they usually mean ‘relative to the x-height’\n\nSome of them, yes. Not all of them. And no matter what people <cite>mean</cite>, somebody -especially a \"beginner\"- listening can't read minds so is quite likely to get confused, simply because the terminology is confused. Good terminology does help us think more clearly - I believe it even ends up guiding thought.\n\n\\> this is why the observation that a typeface has a small x-height is actually  \n\\> more common than the observation that it has long extenders.\n\nIt seems far-fetched that this a result of the relativism of the vertical proportions within the EM. It seems much more likely that this is due simply to the fact that Latin is very strongly x-height-centric, and that's what people see and base expression on.\n\n\\> cap height\n\nCovering that would be nice too. But since lc is 95% of text, I'd rather work on this first. :-) As you can see, this is hard enough already!\n\n\\> Characterizations like too deep or too shallow  \n\\> might be useful, but are indeed judgement calls\n\nSo is \"long/short ascenders/descenders\" though.\n\nhhp\n\n"
    },
    {
      "time": "29 Sep 2005 — 7:02pm",
      "content": "_It seems far-fetched that this a result of the relativism of the vertical proportions within the EM. It seems much more likely that this is due simply to the fact that Latin is very strongly x-height-centric, and that’s what people see and base expression on._\n\nBut the reason they see x-heights as relatively smaller or larger is precisely because the ascender and descender are normally scaled to reach close to the extent of the UPM body height. This is the cause of the difference in x-height between on face and another at the same nominal point size. If we typically spec'd type size in terms of x-height, so that types would have the same x-height at the same nominal size, then I think people would be more inclined to talk about long or short extenders. But so long as we are sizing type by body height, which most often corresponds quite closely to the overall ascender+descender height, relative x-height will be the more obvious element of comparison.\n\n"
    },
    {
      "time": "29 Sep 2005 — 7:09pm",
      "content": "\\> the reason they see x-heights as relatively smaller or larger\n\nI guess I'm not sure they do. I think maybe they only -or generally- see an absolute difference, when two fonts with very different x-heights are put next to each other (and of course when a given font is set at very different point sizes). I think the relativism (or abstraction) which is the important thing for <cite>makers</cite> of type (as well as the more sophisticated users of type) gets \"over-ruled\" by the absolutism that I suspect laymen prefer - probably because that's what human nature prefers. Which is fine for them - but causes us communication problems.\n\nhhp\n\n"
    },
    {
      "time": "30 Sep 2005 — 11:02am",
      "content": "The term \"depth\" is still the main issue for me. I think it would make more sense if we were to use terms like \"reach\" and \"drop\". Ascenders reach and descenders drop. You could then compare Futura with say Helvetica and say Futura has more \"reach\" than Helvetica. You could also say a cursive face had enough reach and drop to allow for flourishes. Screen friendly fonts like Georgia and Verdana have very little reach. The obvious reflection of this is to say ample xheight. This renders the same picture but changes the focus of description on the xheight rather than ascender/descenders. For instance, if I wanted to say that Verdana did not have enough drop for a double bowls g, it would be more descriptive than to say Verdana had too much xheight for a double bowl g.\n\nChrisL\n\n"
    }
  ]
}
