{
  "id": "15365",
  "title": "Questioning existing ID for my business",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "When I struck out on my own earlier this year, I was forced to rapidly create a business card and logo to drum up new business. I have since tried to base my other materials on that card (well, other materials being my website and invoices) and I'm now considering revising and putting more thought into my needs -- I'm a one-man studio working in print, logo, and interactive design.\n\nAnyway, here are samples of my current business card and invoice, as well as [my website](http://web.archive.org/web/20131023070631/http:/addisonhalldesign.com/). I'd like other professional opinions as to whether or not I should proceed with changing or live with what I have. Any and all suggestions are welcome. Thanks.\n\n| Attachment | Size |\n| --- | --- |\n| [AHD-id-samples.gif](http://web.archive.org/web/20131023070631/http:/typophile.com/files/AHD-id-samples.gif) | 21.88 KB |\n\n",
  "author": "Addison Hall",
  "time": "26 Sep 2005 — 8:14am",
  "uid": "8005",
  "comments": [
    {
      "time": "26 Sep 2005 — 8:52am",
      "content": "I really like what you have ... the print identity is nicely complemented by the online presence. You've created a wonderful feeling of trust and professionalism, through the efficient use of type, image, and color. (And solid verbiage.)\n\nI really like your logowork, most of all the fenceworks logo. :)\n\nThe only thing that stood out was the picture of yourself, and the inclusion of your child. I have two kids so I understand the pride of being a father. But in my very humble opinion, I don't think that you need a kid picture. To me, it makes it seem like you are juggling design while changing diapers. And maybe you are. Some clients might like that, others may not. I'm sure others have a differing opinion on this. Anyway, that is my only quibble in what is an otherwise fantastic print/online combo. Congrats!\n\n"
    },
    {
      "time": "26 Sep 2005 — 9:13am",
      "content": "Thanks, BJ -- that's exactly the kind of feedback I need. I appreciate the compliments!\n\nI agree about the photograph -- I had honestly forgotten about it (it was previously me and my dog...). The family photos should probably be restricted to my personal site.\n\n"
    }
  ]
}
