{
  "id": "15379",
  "title": "(x) grunge script - Abigail (similar to Polonaise) {Yves, Mark S}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Does anyone recognize the font on this lovely artwork - sarcasm.\n\nThank you.\n\n| Attachment | Size |\n| --- | --- |\n| [erganza.jpg](http://web.archive.org/web/20141114002439/http:/typophile.com/files/erganza.jpg) | 25.67 KB |\n\n",
  "author": "evan",
  "time": "27 Sep 2005 — 7:31am",
  "uid": "5948",
  "comments": [
    {
      "time": "27 Sep 2005 — 7:36am",
      "content": "What a coincidence -- up to yesterday I hadn't seen this typeface ever before. This is Abigail Regular, a TrueType font as found on Microsoft Windows operating systems. The copyright notice reads \"© 1996 enStep Inc.\".\n\n"
    },
    {
      "time": "27 Sep 2005 — 7:37am",
      "content": "Looks like a (perhaps intentionally) poor autotrace of [Polonaise](http://web.archive.org/web/20141114002439/http:/www.myfonts.com/fonts/urw/polonaise/urw-d-bold/testdrive.html?s=Trees+enganza&p=72).\n\n"
    },
    {
      "time": "27 Sep 2005 — 7:39am",
      "content": "Well, the version reads \"Altsys Metamorphosis\". Where does this _come_ from?\n\n"
    },
    {
      "time": "27 Sep 2005 — 7:40am",
      "content": "how funny, i have this listed (in a dover book) as Chopin Script. I was sure there had to be some kind of digital version, because it's all over Beck's new album, Guero. Thanks for pointing out Polonaise, Mark!\n\n"
    },
    {
      "time": "27 Sep 2005 — 7:46am",
      "content": "Chopin is most likely the source for Polonaise (note the name). Polonaise is one of Phil Martin's. At least half of the fonts he produced were based on existing fonts, usually with some alteration in the design.\n\nSo, more likely, it is an autotrace of Chopin. (Dover type book + autotrace = crap font, the source of many a free font.)\n\n"
    },
    {
      "time": "27 Sep 2005 — 7:46am",
      "content": "And look what [Canada Type](http://web.archive.org/web/20141114002439/http:/www.myfonts.com/fonts/canadatype/heathen/heathen/testdrive.html?s=Trees+erganza&p=72) did to it! Popular style, I say.\n\n"
    },
    {
      "time": "27 Sep 2005 — 7:49am",
      "content": "You guys are great, you never cease to amaze me how you not only find a font, but some other variation on it as well as the occasional history behind it. I hope someday to be this good.\n\n"
    },
    {
      "time": "27 Sep 2005 — 7:54am",
      "content": "_And look what Canada Type did to it!_\n\nI see two fonts in there. Not sure what the second one is. (Font + font = grunge font. \\*sigh\\*)\n\n"
    },
    {
      "time": "30 Dec 2005 — 10:36am",
      "content": "I have been trying to figure this one out - and would appreciate your help.\n\nPhil Martin is no longer with us (he unfortunately passed away on October 4, 2005) but he did do the original drawings for Polonaise back in 1977 - and actually published a front cover in it... verifying the time he made it.\n\nThere is a font going around for free named Chopin. I opened it in Fontographer and found it to be dot for dot, line for line and exact replica of the FontShop font named Polonaise.\n\nOne interesting fact I found was from Phil Martin's site - his notes on the face:  \n\"My German distributor sent me a few words in script, urging that it be developed into a typeface. My assistant, George Brian did most of the work to bring it to completion. Turned out woman lettering artist in Stockholm, Sweden who had hand-lettered chapter titles for a book, was furious to find she had inspired a typeface. George and I felt she should have taken it as a compliment.\"\n\nNow I opened up Dieter's version also in Fontographer - and it is a different set up - more like a scan of the face and retooled - so an original \"drawing\" and not a switch.\n\nI have been having a private discussion with someone as to the validity of Chopin.\n\nDieter has no claims - even his \"copyright\" says the year 2000.  \nChopin has no copyright - just the word \"Diogene\" while  \nPolonaise has: copyright 1999 by Fontshop\n\nand I don't know what year URW copyrighted it...\n\nAny one with any thoughts, sugestions, comments?\n\n"
    },
    {
      "time": "30 Dec 2005 — 1:54pm",
      "content": "I did not know Phil had died. Now I know why I have not heard from him for so long. :-(\n\nI'm among several designers who agreed a couple of years ago to digitize those of his fonts which hadn't yet been digitized. So far I've release one family--Grad, the last typeface design he did, originally for his personal use. I'm still working on two other families--Fotura (to be renamed Frizbo) and Bagatelle.\n\nRegarding Polonaise, you have more information than I do about it. I was just speculating in my comments (above).\n\nThe story I heard (from Phil, I seem to recall) is that most of his fonts that have been digitized were done by a font pirate in the early nineties. The pirate was shut down and URW ended up with the fonts and added them to their library. Phil contacted URW and informed them that the fonts were his designs and they paid him royalties on them from then on. (This is from memory, so some of this may not be entirely accurate.)\n\n"
    },
    {
      "time": "1 Jan 2006 — 9:35am",
      "content": "the story has some basis in truth\n\nIn the early 90s - an ex-typographer had retired to Florida. He receive  \npemission from Photolettering, Inc. to digitize some of their fonts.  \nThey thought he (I don't know his name, sorry) was doing it for his  \nown personal use -- however, he marketed about 100 Photolettering  \nfonts (ie. Advertising Gothic, Algonguin, Angelface, Bonaparte, Lennox,  \nMurray Hill, Vogue Didot, etc. - I think to buy the set back then was  \n$100.) I remember asking Cosmos (salesperson at Photolettering) how  \nit had happened. He assured me they were duped - thought they were  \nhelping a down and out typographer - and were trying to do something  \nto halt the sale. Don't know if they ever did... and now, they are out  \nof business too...\n\nSo if I understand you - it looks like Chopin was the digitized version  \nthey ended up at URW as Polonaise... and for which URW has paid  \na fee to have it.\n\nI always thought it was clever to rename Polonaiase to Chopin - for  \nwhere else would we know a Polonaise from?\n\nThank you.\n\n"
    },
    {
      "time": "1 Jan 2006 — 10:01am",
      "content": "Polonaise and the others were given the correct names by the unknown pirate when they were digitized. I believe Chopin was the name given to a pirate film font (pre-digital). There are a few of these in the Dover books. Some of the pirated versions of Phil Martin's fonts had similarly clever or \"funny\" names: Jolly Roger renamed Happy Jack, Introspect renamed Looking Glass, Threadgill renamed Twistfin, etc.\n\n"
    }
  ]
}
