{
  "id": "15394",
  "title": "Serif to compliment Helvetica Neue Medium Extended",
  "forum": "Design",
  "tags": [

  ],
  "content": "Can anyone suggest a good compliment for Helvetica Neue Medium Extended. The use will be in small to medium doses of copy in a brochure and workbooks (fill-in-the-blank type). I need at least a book and bold weight with italics and prefer to have small caps if possible. Any thoughts would be greatly appreciated. Thank you in advance.\n\n",
  "author": "<a href=\"/web/20111224061910/http://typophile.com/user/8857\" title=\"View user profile.\">sirmon</a>",
  "time": "<br>",
  "uid": "8857",
  "comments": [
    {
      "time": "",
      "content": "Are you looking for a fairly modern-looking serif, or something with a bit more flair?\n\n"
    },
    {
      "time": "",
      "content": "Is there a Times Medium Extended? :-/\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "oh you took my joke, hrant.\n\n"
    },
    {
      "time": "",
      "content": "Minion and Minion Italic... works great with Helvetica Neue Medium.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the replies.\n\nI actually proposed Minion on the first comps. Unfortunately, the client wants something \"snazzy\" and \"modern\". I have looked at Eidetic Neo, but some of the letterforms in the italic set are hard to get used for some of the people I am trying to please. You know, they want a contemporary classic serif-sans-serif in a dainty heavy weight. Everything looks like Times to them so there's probably not much use in scouring the earth looking for the perfect serif face to compliment the \"invisible\" Helvetica.\n\nAnyway, thanks for all the help.\n\n"
    },
    {
      "time": "",
      "content": "What about something that is old but is gorgeously modern in its details? Vendôme? (suggestion borrowed from stewf posted in the other thread)\n\n"
    },
    {
      "time": "",
      "content": "Although making Helvetica physically invisible would complement your project :-)\n\nChrisL\n\n"
    }
  ]
}
