{
  "id": "15411",
  "title": "Typotheque: Indian Summer News",
  "forum": "Home",
  "tags": [

  ],
  "content": "- - - - - - - - - - - - - - - - - - - - -  \nBACK-UP T-SHIRT  \nInspired by a true story (accident where I lost three months of work,  \nincluding all of ready to be released Fedra Sans), this t-shirt should serve  \nas a reminder to do your regular back-up of your computer.\n\nDesign of the t-shirt is conveniently flipped so you are confronted with the  \nmessage every time you see yourself in a mirror. In addition, female t-shirt  \nis also reversed (inside-out) to emphasize the effect.  \n [http://www.typotheque.com/tshirts/back\\_up/](http://web.archive.org/web/20060329210632/http:/www.typotheque.com/tshirts/back_up/)\n\n- - - - - - - - - - - - - - - - - - - - -  \nSPRING T-SHIRT  \nSpring t-shirt presents a collection of flowers, grasses and herbs found on  \nthe way to work on one spring day. This t-shirt brings a piece of nature to  \nyour home or work. Be part of the nature.  \n [http://www.typotheque.com/tshirts/spring\\_t-shirt/](http://web.archive.org/web/20060329210632/http:/www.typotheque.com/tshirts/spring_t-shirt/)\n\n- - - - - - - - - - - - - - - - - - - - -  \nDOT DOT DOT 10  \nFinally available is a new issue of Dot Dot Dot magazine, published by our  \npartner company. DDDX is a montage of articles drawn from issues 2—9. This  \nis not a retrospective act, more a logical next step; a slight return in  \nresponse to the self-righteous statement of intent on the cover of issue 1;  \na reply to ourselves after five years’ trial & error.  \n [http://www.typotheque.com/books/DDD10](http://web.archive.org/web/20060329210632/http:/www.typotheque.com/books/DDD10)\n\n- - - - - - - - - - - - - - - - - - - - -  \nRSS FEED  \nIf you would like to stay in touch, and get all news from Typotheque (not  \njust an irregular digest such this email newsletter), you can now subscribe  \nto our RSS news feed. In RSS we publish for example preview of new fonts,  \nnew articles, and other smaller news.  \n [feed://www.typotheque.com/rss](http://web.archive.org/web/20060329210632/http:/www.typotheque.com/rss)\n\n- - - - - - - - - - - - - - - - - - - - -\n\n",
  "author": "Miss Tiffany : 28 September, 2005 - 11:27am",
  "time": "",
  "uid": null,
  "comments": [

  ]
}
