{
  "id": "15434",
  "title": "Linotype Font Explorer X fc2 released",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I just came across this on versiontracker: Linotype released the second final candidate of its FontExplorer X font management tool.  \nSee [http://www.linotype.com/fontexplorerX](http://web.archive.org/web/20130516043414/http:/www.linotype.com/fontexplorerX)\n\n",
  "author": "Stephan Kurz",
  "time": "29 Sep 2005 — 9:16am",
  "uid": "8415",
  "comments": [
    {
      "time": "29 Sep 2005 — 10:42am",
      "content": "You can also specify updates through Font Explorer's Preferences:\n\nFont Explorer X \\> Preferences \\> Update \\> Check for Update (hourly, daily, weekly, monthly). No 'manual labor' involved in this app.\n\n\\<comic\\_book\\_guy\\> Best Font Manager Ever!\\</comic\\_book\\_guy\\>\n\n"
    },
    {
      "time": "9 Oct 2005 — 4:12pm",
      "content": "so.....who's happy with Font Explorer X......?\n\n"
    },
    {
      "time": "11 Oct 2005 — 2:52am",
      "content": "I tried it for a day (release 1) and it didn't get along with the widgets-engine, I guess, because these were crashing like mad on me. Also there were issues with auto-activation in Illustrator CS2 (FEX pointed to missing fonts but didn't auto-activate them, even though they were in the database).  \nI'll try FEX again as soon as there's a final release, because it looks quite promising. Until then I'm using FontAgentPro (that has been ok for me, at least a world better than Suitcase).\n\n"
    },
    {
      "time": "11 Oct 2005 — 8:40am",
      "content": "I am having some issues with auto-activation. It tells me the fonts are missing, but they're in the library.?\n\n"
    },
    {
      "time": "12 Oct 2005 — 5:18am",
      "content": "Dating back to OS 7 and Quark 3.x I have been frustrated by dealing with font magement issues, but felt I had to use them because i didn't want to always be rebooting the computer or quiting and restarting all open application just to make use of the fonts. After hassles using Font Book, Suitcase and Font Agent for OSX I have scraped font management utilities alltogether with no hit to productivity -- just the opposite, in fact.\n\nThis is because unlike OS9 and earlier, System X and all the application I use (from adobe CS to Quark 6.x to the lowly textedit) seem more than happy to activate and make available, on-the-fly, any font(s) added to any of the ...\\>library\\>fonts folders. This is akin to dumping fonts in the system folder\\>fonts folder from OS9, with the exception being the on-the-fly, no-reboot, no-quit-&-reopen needed.\n\nBut what about custom font sets, the ability to turn fonts on and off, and the need for a searchable database you ask? Well, I have found that any font(s) in ...\\>library\\>fonts folder can be nested inside other folders and still will be activated. So I can drop a folder named \"design\\_job\\_1\" which contains 2 other folders named \"font\\_family\\_1\" and \"font\\_family\\_2\", each of which have several individual font files, into the ...\\>library\\>fonts folder and all the enclosed fonts, at any nested level, will become active yet stay happily in their enclosing folders.\n\nThis meanas that when I want to \"deactivate\" that custom set, I open the \\>library\\>fonts folder find that custom folder, remove it, and voila! the fonts become inactive/unavailable within seconds.\n\nThis is all made even easier by simply option-dragging (copying) the fonts or font folders you want activated to the \\>library\\>fonts folder to begin with. That way your master collection of fonts which you probaly spent 3 summers organizing stays unaltered - becuse you're simply using it as a searchable database (thanks to the little search window in the upper right of the finder window) and then copying from it.\n\nThe last step in making this work smoothly is to simply drag the fonts folder you want to be activating and deactivating from into the sidebar of a finder window. This will make an drag-n-dropable alias of it that will be persistent in all finder windows from then on.\n\nNow, the only time I fire up one of the old management apps now is if i need to do a lot of on-screen previewing (which I try to avoid anyway in favor of looking at printed specimen book & catalogs)\n\nI really didn't think this would be faster, but I swear it is.\n\n"
    },
    {
      "time": "12 Oct 2005 — 8:24am",
      "content": "I think you're right, neumann.\n\nI tried using Font Reserve with the early versions of OSX and had nothing but problems. In desperation, I started doing exactly what you describe. I worked this way until Font Book came out, and now Font Explorer X. FEX seems the best yet, but you make me wonder again if these utilities are worth the trouble.\n\n(Everyone forgets that the original reason Suitcase was created was to overcome the 256 font limit on Macs. That limitation has never existed with OSX.)\n\n"
    },
    {
      "time": "12 Oct 2005 — 8:27am",
      "content": "Instead of Font Book, I think Apple should have made it so you could preview fonts in the Finder, similar to what happens in Windows when you double-click on a font file.\n\n"
    },
    {
      "time": "1 Nov 2005 — 12:18pm",
      "content": "fc3 is out now.\n\nunfortunately the \"Conflicts\" button is now gone. :(\n\n"
    }
  ]
}
