{
  "id": "15439",
  "title": "Do you Use Kagi? Do you like it?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Do you Use Kagi? Do you like it? I am interested in hearing the point of view of both buyers & sellers.\n\nIf anyone wants to chime in on the vitrues or lack threof of paypal or myfont or even having a store custom made I would like to hear about that too.\n\nThanks!\n\n",
  "author": "ebensorkin",
  "time": "29 Sep 2005 — 3:25pm",
  "uid": "2942",
  "comments": [
    {
      "time": "30 Sep 2005 — 11:55am",
      "content": "Cannot remember what I was licensing when I used Kagi to pay, but I don't remember having any problems.\n\n"
    },
    {
      "time": "30 Sep 2005 — 1:56pm",
      "content": "Thanks, Tiffany! I have been looking at Kagi to sell fonts & I am not done yet. I have had good experiences as a buyer...\n\nI also know Fountain ( yay fountain! ) uses them maybe I will try to contact them directly and see what they say.\n\nI still have lots of reasearch to do...\n\n"
    },
    {
      "time": "30 Sep 2005 — 2:24pm",
      "content": "I have purchased with Kagi with no problems.\n\nChrisL\n\n"
    },
    {
      "time": "30 Sep 2005 — 7:02pm",
      "content": "So far what I am seeing is 10% cut on your price - or so - it varies depnding on volume etc. The do offer direct download for no extra charge (sweet!) if you host your own files. Or it's 2% more if they host the files for you.\n\nThe main thing I want to understand is how fraud & disputes are dealt with. I have a pal with an online store & Chase wanted to hit him with charges ( multi thousands... ) for multiple failed fraud attempts on the credit card system.\n\nHow do most foundrys deal with a dispute about a font?\n\nI'll post more as I learn more.\n\n"
    },
    {
      "time": "4 Oct 2005 — 7:14am",
      "content": "10% or 12% is a steep cut. If you can implement your own cart and then choose a payment processor with a lower take (like PayPal or 2Checkout), you'll increase your profit and be better prepared to expand in the future.\n\nDownloadable software is considered a high risk product when it comes to fraud. The best thing to do is contact a potential processor and ask them what their procedure is for handling fraud and chargebacks...\n\n"
    },
    {
      "time": "7 Oct 2005 — 9:10am",
      "content": "Having looked into it a bit more- both Pay Pal & Kagi have to agree to credit card company terms - which means charging you a fee for any returns & allowing returns pretty much no matter what - especially if it is the first time. You can decide not to sell to that individual afterwards if you want - but thats about it as far as recourse. The companies are not happy to admit this to you - but when pressed the do eventaully admit it. So basically all risk as far as fraud is on \\*you\\* if you sell this way. I had a good talk with a Kagi person about it & they do try to prevent it in various ways but really the risk remains with you the seller. So be preparred for that reality.\n\nObviously if you have your own system & deal directly with credit cards - or you \\*might\\* be able to do something differently. I am now set up with pay pal ( & just did some business! yay! ) and I hope to be set up with Kagi soon too.\n\nOne of these days I may even get on myFonts.com - who knows.\n\n"
    },
    {
      "time": "22 Oct 2005 — 2:32am",
      "content": "I'm just starting selling some fonts ( [www.archivetype.com](http://web.archive.org/web/20131014124527/http:/www.archivetype.com/ \"www.archivetype.com\")) via Kagi. The set-up proces was pretty easy. There's some techie stuff though, mainly some pieces of HTML code to insert into your site code, but it's not to complicated. Even a tech chalenged person like me managed to do it with help of their support team. It helps having a friend who knows some more of HTML though. Since I'm not a US citizen it was hard to obtain a merchant accout to work with one of the usual card processors and Kagi was ideal for me from this standpoint as well. So far so good. I'll be able to tell you more when things will start going.\n\n"
    },
    {
      "time": "23 Dec 2005 — 4:11am",
      "content": "we used to use kagi, absolutely no problems, easy to set up and they are prompt with payments. plus they dont charge any fee other than the ones from your sales. only problem is their shopping cart system, you cant do any kind of 'add to cart' button, when people want to buy your fonts they have to go to a screen with a list of all of your products which the buyer has to tick the ones they want. it can get confusing if you have a lot of stuff to sell and also looks a little bit amateur. we moved onto a shopping cart system using 2co and mal's e-commerce which is still not as flexible as it could be, but means we dont have to do any complex programming, just scripts and html code. its also a bit more expensive. dealing with credit cards directly yourself is also an expensive option and only worth pursuing if you intend selling fonts full time. so i would not reccommend that. however if you just have a few fonts then kagi is a good option.\n\n"
    },
    {
      "time": "23 Dec 2005 — 6:38am",
      "content": "Thanks Jonathan!\n\n"
    },
    {
      "time": "28 Dec 2005 — 5:26pm",
      "content": "_10% or 12% is a steep cut_\n\nNot if you factor in the fees required to set up and maintain a merchant account, plus the liability for chargebacks. And LOTS of people HATE Paypal. However, WorldPay may be an option worth considering...\n\n"
    }
  ]
}
