{
  "id": "15448",
  "title": "Stationery system: asymmetrical leading question",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi all, it's been a long time since I last posted on Typophile, but at least I lurk here regularly whenever I have time.\n\nI am currently working on a stationery system redesign, and obsessing on a typographic detail.  \nIn setting type on a main single column, it makes sense to divide it in logical blocks with vertical space, like this:\n\naddress block  \n(more than one line)\n\nphone  \nfax number\n\ne-mail address  \nwebsite URL\n\nI am wondering if the best solution is to separate the paragraphs with hard returns but keeping the leading constant, or opt for vertical space lines with reduced leading. For example: let's say my text blocks are set at 8/10 pt, but my space lines have only a leading of 6pt.  \nIs the asymmetrical leading a faux pas in this case? I wouldn't think so, since it's not running text, and the column certainly looks more compact than with the other solution. Is there a rationale in deciding how much to reduce leading, like dividing it by half maybe?  \nI could provide my own screenshots, but I found an example of asymmetrical leading in a stationery system here also:\n\n[University of Nottingham stationery](http://web.archive.org/web/20131014124622/http:/www.irisassociates.com/notts_dev/stationery_examples.html)  \n(the business card link is probably the best one to see what I am talking about, on the right column)\n\nWhat is your opinion on this? Would you separate blocks with simple hard returns instead?  \nThank you all for your answers.\n\n",
  "author": "paolo",
  "time": "30 Sep 2005 — 11:19am",
  "uid": "922",
  "comments": [
    {
      "time": "30 Sep 2005 — 12:12pm",
      "content": "I personally do it a lot. If it looks ok, then it must be ok. Changing the leading in a proportional increment is a good practice in running text but in this case I would agree with anything that works.\n\nHéctor\n\n"
    },
    {
      "time": "30 Sep 2005 — 12:40pm",
      "content": "As long as you keep the spacing consistant throughout the stationary design it shouldn't be a problem.\n\n"
    },
    {
      "time": "30 Sep 2005 — 3:38pm",
      "content": "I agree with rs\\_donsata -- If it looks good, it's good.\n\n"
    },
    {
      "time": "30 Sep 2005 — 8:25pm",
      "content": "I really think that the guide has to be the appearance other than any set spacing rule in cases where it isn't running text, but rather separate groupings of information. It must make sense optically instead of numerically, in other words. With a business card, where several related but distinctly different groupings of information have to be conveyed, I don't even think that the driving concern should be consistency. The goal is to move the reader through the info at the pace YOU intend.\n\n"
    },
    {
      "time": "1 Oct 2005 — 4:06am",
      "content": "With the blocks that you suggest, the space between numerals and email address might appear more due to the absence of descenders on aligning numerals, unless like the link you provided you have an uppercase postcode. If the last line of the address contains upper and lower case you could work on a percentage of leading, you could, for example, specify half line space after address block and third line space after the numerals. However, because aligning numerals are the same height you could also consider greater leading for the two lines of numerals.  \nTim\n\n"
    },
    {
      "time": "1 Oct 2005 — 9:47am",
      "content": "Thank you all for your imput.  \nActually, the column of text has 5 blocks total, all consisting of two lines: so it is symmetrical already.  \nTim, I have to confess that I am doing something a little against the rules: I am using old-style numerals, even though it's not running text. Would that be a mortal typographic sin in a stationery system?  \nI know you're supposed to use lining figures when you stack lines of numbers, but I am using small caps in two blocks, and I hate the way lining figures look with them (I have T and F for telephone and fax in small caps, plus IVA and CF in the last block also, which are the Italian equivalent of VAT numbers). The CF line is actually a mix of numbers and letters, and I think small caps + old style figure look great in this case.  \nSo, with 10 lines of text stacked in blocks of 2, the column is quite tall: I like the way it looks with line spaces of reduced leading instead of simple hard returns. It adds a certain variety, and the column looks much more compact.  \nI think I'll opt for that solution, reducing the leading by half in all the space lines since my numbers do have ascenders and descenders.\n\n"
    },
    {
      "time": "2 Oct 2005 — 2:11am",
      "content": "There are no \"rules\" about using aligning and non-aligning, as earlier posts have said _if it looks good, it is good_, essentially you are trying to present your client's information in a useful\\* and attractive way. Personally I prefer the look of old style numerals.\n\n\\*by useful I mean that the recipients of the letter/business card can pick out the details they might need.\n\nTim\n\n"
    }
  ]
}
