{
  "id": "15447",
  "title": "Counterspace?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Anyone know who’s in charge of [Counterspace](http://web.archive.org/web/20071212184401/http:/counterspace.motivo.com/) ( [http://counterspace.motivo.com](http://web.archive.org/web/20071212184401/http:/counterspace.motivo.com/ \"http://counterspace.motivo.com\"))? The site seems to be down right now, just as we’ve reached the “Intro to Typography” portion of the class I teach. I’ve meant for a while to contact the Counterspace folks to see if I could host a mirror of the site as I know it goes down from time to time. It’s a great site for my students, but I’m at a bit of loss at the moment as I’ve directed them to use Counterspace as a study tool and, well, it’s suddenly unavailable.\n\nSo, back to my question. Anyone know who runs Counterspace?\n\nJason\n\n [‹ Your thoughts please.](http://web.archive.org/web/20071212184401/http:/www.typophile.com/node/20708 \"Go to previous forum topic\") [Sun Microsystems logo ›](http://web.archive.org/web/20071212184401/http:/www.typophile.com/node/20684 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071212184401/http://www.typophile.com/user/3771\" title=\"View user profile.\">jason</a>",
  "time": "<br>",
  "uid": "3771",
  "comments": [
    {
      "time": " 30.Sep.2005 10.46am",
      "content": "Jason, [Type Culture](http://web.archive.org/web/20071212184401/http:/www.typeculture.com/academic_resource/research_directory/) has a research area with loads of great information. Could be useful while Counterspace is down.\n\n"
    },
    {
      "time": " 30.Sep.2005 11.03am",
      "content": "Miss Tiffany,\n\nThanks for the link. I took a quick look the Type Culture links page will be really helpful. I’ve passed the URL on to my class listserv so they can all start exploring. Thanks again.\n\n"
    },
    {
      "time": " 17.Nov.2005 7.06pm",
      "content": "I believe the Counterspace site you are looking for is located at:  \n [http://www.counterspace.us/typography](http://web.archive.org/web/20071212184401/http:/www.counterspace.us/typography \"http://www.counterspace.us/typography\")\n\n(former designer at Studiomotiv/Motivo)\n\n"
    },
    {
      "time": " 20.Nov.2005 11.08pm",
      "content": "Can’t thank you enough esdc, I’ve been trying and trying the old address and it was driving me nuts. Again, thanks. I can push my students that way now (with only another week or two left in the term, they need all the help they can get)...\n\n"
    },
    {
      "time": " 15.Jun.2006 7.39pm",
      "content": "hello,\n\nmy name is brett yancy collins and I created counterspace a number of years ago. I have moved it to a new server at my company counterspace. I would be glad to hear any and all thoughts about the site. I am currently rethinking and redesigning the site to update it after 10 years. phew seems like a long time ago.\n\nThanks for the interest\n\nbrett\n\n"
    },
    {
      "time": " 16.Jun.2006 4.40am",
      "content": "The classification explanations are wrong in relation to their headings. (The actual explanations are right but, for example, the transitional explanation comes under the title ’slab serif’). One error in the sans serif classification where you seem to imply that sans serifs didn’t exist untill the Bauhaus.\n\nThe site in general looks good and useful, but I don’t like the into. But that is not just your intro as i hate all flash intros.\n\nPhil\n\n"
    }
  ]
}
