{
  "id": "15453",
  "title": "typeface testing",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi there, I'm about to reinvest in a printer for testing typefaces. Both in small size bodytext and bigger size design testing.\n\nDoes anybody have any good advices about printer type, postscript (software) rip, testing methodes etc. How do I simultate ex. offset book printing?\n\nThanks\n\nNicolaj Bak\n\n",
  "author": "nicolaj",
  "time": "1 Oct 2005 — 1:21pm",
  "uid": "2143",
  "comments": [
    {
      "time": "1 Oct 2005 — 1:32pm",
      "content": "2400 dpi for serious small text work.  \nPostscript preferable.\n\nhhp\n\n"
    },
    {
      "time": "1 Oct 2005 — 1:49pm",
      "content": "Thanks hhp, does any desktop printer print 2400 dpi? and what about software rips for mac osX, does they actually work - do you have any experiences with this (printer type, rip) ???\n\nNicolaj\n\n"
    },
    {
      "time": "1 Oct 2005 — 1:51pm",
      "content": "What is the least expensive way to get that? I have been looking into it & it seems like we are talking about a Xante. I have also found a Ricoh that might be okay at 1200 dpi with PS but it is hard to find a retailer that has them. Not that Xantes are so easy to find either...\n\nFrom the xante site:\n\nAccel-a-Writer 4G Printer [$2,285.99 ( lowest price I have found so far )]  \nAccel-a-Writer 4G provides the highest resolution available of any printer in its class - up to 2400 x 2400 dpi. The Accel-a-Writer 4G printer is an outstanding graphics printer that delivers superior halftones up to 150 lpi, oversized output, .....\n\nAW1200 Printer - [$1385 ( lowest price I have found so far)]  \nThe new AW1200 excels in output up to 11\" x 17\" and printing at 1200 x 1200 dpi.\n\nHas anybody found a good source for a used ricoh or xante? I would like to spend sub $1000 if possible!\n\nHrant, What do you have? You use a PC right?\n\n-e.\n\n"
    },
    {
      "time": "1 Oct 2005 — 1:58pm",
      "content": "It seems that this Xantes printers prints up to A3+. I could easyly do with A4 - must be cheaper ..?\n\nNicolaj\n\n"
    },
    {
      "time": "7 Oct 2005 — 1:37pm",
      "content": "Everybody seems to agree that if you can go Xante - it's best. Most laser printers these days are inexpensive or expensive 600x600 1200x600 or 2400x600. There are some 1200x1200 too but usually there is a missing feature - real postscript instead of emulation of some kind. HP seems useless for our purposes unless ( is it true? ) you can just use a PDF format to get around the issue. Maybe even then.\n\nAssuming you want real Postscript not emulation & 1200x1200dpi, don't care about color or duplexing & cannot affort a Xante - here is what I have found as altrenates. Prices are suggested retail from the company sites not retailers actual prices.\n\n--------  \nXerox Phaser 4500 ( PS3 & true 1200x1200dpi )  \n25ppm\n\n4500 - $899.00 - usb only  \n4500n - $999.00 - with ethernet\n\ncost per page: 1.3 cents based 5% coverage  \nworks with mac & pc: yes\n\n--------  \nOki: B6200 ( PS3 & true 1200x1200dpi )  \n25ppm\n\nB6200 $524.99  \nB6200n $681.99 - with ethernet  \ncost per page: 2 cents  \nworks with mac & pc: yes\n\n--------  \nMinolta: PagePro 9100 N ( PS3\\* & true 1200x1200dpi )  \n 35ppm\n\nPagePro 9100 N\n\n\\* I am still working on finding out if this or other minolta printers have real postcript. So no prices on this one yet\n\n"
    },
    {
      "time": "7 Oct 2005 — 1:49pm",
      "content": "Yes, I'm on Windows. But anyway my printer is cheese-factor-5...  \nI go to a bureau and get veloxes whenever it's show time.\n\nEben, thanks for the legwork! I might get one of those soon.  \nOh, and cool jack-o-lantern.\n\nhhp\n\n"
    },
    {
      "time": "7 Oct 2005 — 6:19pm",
      "content": "I am still hoping to hear something interesting from Xante too - so hang in there. RE: the pumpkin - Thanks! I had fun making them last year & it seemed like the right sort of season...\n\n"
    },
    {
      "time": "7 Oct 2005 — 6:20pm",
      "content": "Oh, and Lexmark - NO real postscript in ANY of their current line of printers. They use 100% emulation.\n\n"
    },
    {
      "time": "7 Oct 2005 — 6:21pm",
      "content": "What is a Velox? This aught to get my post #s up.... :-p\n\n"
    },
    {
      "time": "7 Oct 2005 — 6:51pm",
      "content": "We bought the Xanté AW 1200 a few years ago, and have been very happy with it.\n\nHowever, 1200 dpi is not an accurate representation of type (especially if it is being used for looking at finer details)! Even at 1200 dpi, fonts look fatter than they should. We did a comparison of the results from an imagesetter at 2400 dpi and our printouts, and the difference was huge (we had posted scans of the two samples on the old typophile, but I can't find it).\n\nJust to say, if you are working on type, and if you don't want surprises (like seeing the final printed 500 page book and finding everything too LIGHT for easy reading!), you should in my opinion look only for 2400x2400.\n\nOr make a velox, as Hrant suggest, before finalising your first pages (any excellent idea, in fact).\n\n- Robert\n\n"
    },
    {
      "time": "7 Oct 2005 — 7:04pm",
      "content": "A velox is like a heavy and glossy printout - almost like your typical photo paper, but not that thick, and not grainy. The way my place does it is they make regular imagesetter film, then they burn (?) velox copies from that, and each velox costs like $7. Another way is to run an imagesetter with \"paper\" instead of film, but a lot of bureaus don't like that because it involves swapping cartridges in their imagesetter; and if you want multiple copies of something without running an imagesetter repeatedly it's better to go from film instead of \"paper\". What I don't know though is exactly how they make veloxes from the film...\n\n--\n\nRobert, I'd like to see your comparisons - could you possibly find them?\n\nhhp\n\n"
    },
    {
      "time": "7 Oct 2005 — 8:04pm",
      "content": "I think I did a search on this topic via google & pointed at Typophile - and saw those images. If I find them again I will link to the info. We still can't post inline images or I would grab the images & post 'em.\n\nSince 2400x2400 costs 2k+ I think I will trake this velox thing seriously - especially for text faces!\n\nHow is a \\*high end\\* inkjet with fancy paper in comparison to velox or 2400x2400 on a xante? That is probably $3 a sheet & can be done at home or in the studio! The reson I wanted to get a laser printer was to get get me 90% there. If the last 10% can be acheived using fancy paper & a HP designjet that does 2400x2400 on photo film or something... That might be a good way to have your cake & eat it too!\n\nAnybody tried that?\n\n"
    },
    {
      "time": "7 Oct 2005 — 8:19pm",
      "content": "I personally don't trust ink[jets].\n\nBTW, I can think of a way to save money on a high-end printer: simply <cite>learn</cite> to gauge what a face will <cite>really</cite> look like based on what a 600 dpi laser printer does to it... Probably easier said than done though. By extension, one could do a one-time comparison using hi-res (2400 dpi) scans of a velox and one's own printer, measure the difference, and use a custom precisely-lighter weight of the face for proofing on the lo-res printer...\n\nhhp\n\n"
    },
    {
      "time": "7 Oct 2005 — 9:41pm",
      "content": "I got my Xante AW 1200 for under $1000 from a dealer who had it sitting on his shelves for some time. Note you that can adjust the density of print on the AW 1200 and that the 'light' setting will get you close to the image setter on paper, but it will still be a little heavy. But the AW 1200 is not a substitute for proofing from the image setter, I think. The 2400 dpi printers may be, but I don't know.\n\n"
    },
    {
      "time": "9 Oct 2005 — 8:32am",
      "content": "If you want to use an Inkjet, you will have to get a RIP in order to get printouts that are half-way acceptable.\n\nAlso, it is about 3 dollars a page IF the printer doesn't splotch or streak, or do any of the number of other things Inkjets tend to do. Then, the cost for a single page goes way up!\n\nOur inkjet was 2400x2400, and we had a rip, but we pretty much stopped using it once we got the AW 1200. Even though the AW1200 is only 1200 dpi and monochromatic, it wasted less of our time and was generally less stressful.\n\nHere is a cached link through Google of the previous descusion of this issue  \n [http://72.14.207.104/search?q=cache:w7vtwhUFY-AJ:www.typophile.com/forum...](http://web.archive.org/web/20120603123049/http:/72.14.207.104/search?q=cache:w7vtwhUFY-AJ:www.typophile.com/forums/messages/4101/13289.html%3F1075071667+AW1200+Typophile&hl=en \"http://72.14.207.104/search?q=cache:w7vtwhUFY-AJ:www.typophile.com/forums/messages/4101/13289.html%3F1075071667+AW1200+Typophile&hl=en\")\n\nI have the pictures, but is it possible to post them?\n\n- Robert\n\n"
    },
    {
      "time": "9 Oct 2005 — 8:34am",
      "content": "[Link here](http://web.archive.org/web/20120603123049/http:/72.14.207.104/search?q=cache:w7vtwhUFY-AJ:www.typophile.com/forums/messages/4101/13289.html%3F1075071667+AW1200+Typophile&hl=en)\n\n"
    },
    {
      "time": "11 Oct 2005 — 2:56pm",
      "content": "BTW - here is what I found available direct from Xante today October 11th 2005\n\nThese are refurbs: 4g 256mb ram 2400x2400dpi $3395.00\n\nthere are some 1200x1200dpi models too. This is a large format printer. 128 MB $2078.25, 64 MB $1865.75\n\nThere is also the 1200x1200 dpi AW 1200. It goes for $995 new\n\nIt's also semi large format. Check the web site for other specs & so on.\n\nI am on the fence again. Maybe Hrant's Velox solution is best!\n\n"
    },
    {
      "time": "13 Oct 2005 — 5:13pm",
      "content": "As other said look for a 2400 dpi postscript printer. Preferably a black & white instead of a color one. It will give you a better output. Other suggestion, send your file to a printing shop, it will print your file really close of «reality».\n\n"
    },
    {
      "time": "14 Oct 2005 — 8:43am",
      "content": "hee hee. I had been thinking something like that for a while. I wonder what that might cost... Of course then you get into what paper you are printing on... What press is being used and thousands of other subtle variables. But your right. That is reality.\n\nOf course if you are designing a face for newsprint or other rough/poor paper then this kind of test is the ONLY way.\n\nBut if your standard output is going to be on fairly smooth paper a velox or 2400x2400 xante seems like it might be pretty good. They might be too perfect!\n\nOh, pie in the sky...\n\n"
    },
    {
      "time": "17 Oct 2005 — 8:11pm",
      "content": "How much does an imagesetter cost? What if someone on these boards were to buy one, and sell printouts to thos who wanted tight test prints?\n\n"
    },
    {
      "time": "17 Oct 2005 — 8:33pm",
      "content": "Great idea.\n\nAnother potential collaborative effort:  \nThe Design Magazine Scout Squad: Each person in a group is assigned a single magazine to scour each month, and report back with a short review, so the others are alerted to anything that might interest them without wasting too much time.\n\nhhp\n\n"
    },
    {
      "time": "18 Oct 2005 — 6:54am",
      "content": "Imagesetters will get cheaper as they are replaced by Computer-to-Plate technology. However, be aware that, for film or velox output, you need not only the imagesetter but a processor as well. Then you have the problem of chemical recycling (silver can be recovered from the fixer) and disposal (used litho developer is really nasty stuff, and most municipalities frown on your pouring it doen the drain).\n\nHrant, inkjets are as reliable as the RIP that drives them. In the shop I work in, we employ a Delta ROOM (RIP Once, Output Many) system to drive CPT for plates and generate proofs with a high-end Epson inkjet. The same file that prints the plates prints the proofs (although proofs are printed composite, while plates are separated) and, with the slight exception of some PMS colors which simply CANNOT be accurately rendered in CMYK (nor, for that matter, in CMYK + Light Cyan + Light Magenta), the proofs match the finished printed product extremely well. And the inkjet has the added advantage of not having to deal with toxic byproducts.\n\n"
    },
    {
      "time": "18 Oct 2005 — 9:02am",
      "content": "RIPs are expensive software however, and the ink for inkjets is too. The question is ( probably ) how many sheets will you print in testing. 1,000 or 10,000 or more? The closer you get to 10,000 the more the xante is going to look good on a pure cost basis. Plus the laser option prints faster.\n\nHowever, It would be interesting to compare a RIP/inkjet generated letter at high rez to a printed letter & laser printed letters. It is possible (maybe) that the RIP letter would somehow resemble the ouffset printed letter more closely than the laser letter...\n\nMaybe we could arrange a test. We could compare an offset letter from an existing offset printed job ( to reduce cost!) with the output from an HP deskjet with RIP, a xante & maybe Nick's Epson. First, we need a volunteer with a some offset printed work to share/show...\n\n"
    },
    {
      "time": "18 Oct 2005 — 9:53am",
      "content": "Let's do it, yes!\n\nhhp\n\n"
    },
    {
      "time": "18 Oct 2005 — 10:53am",
      "content": "We should maybe get specific about what we want to see offset. Helvetica might, for instance, be a less than ideal test subject. Also what point size range. Hrant, I expect that this kind of specificity would be your forte - no? Also, Do you have a velox & a printed example that we could start with? Maybe of Patria?\n\n"
    },
    {
      "time": "18 Oct 2005 — 11:01am",
      "content": "My problem is my scanner: only 600 optical. :-(  \nIf you can recruit Raph (sorry, Raph :-) he's got a really good scanner.\n\nhhp\n\n"
    },
    {
      "time": "18 Oct 2005 — 11:12am",
      "content": "A couple of comments:\n\n1. I am moderately happy with my Minolta 9100. The biggest issue has been the reliablility of the toner cartridge. I have yet to have toner cartridge that does not fail and do something strange like print ghost images etc well before the cartridge is empty. Fortunately, Minolta has been awesome with their support. They fedex me new cartridges overnight when I call them. Free. I am now on cartridge number 4. The current one has worked flawlessly for the last 4 months. Print quality works for me at this stage of my business.\n\n2. There is looking at type, and then there is LOOKING at type. Don't discount the amount of training your eyes require to need the difference between 600/1200/2400. Yes, you can obviously see there is darkening. But I think 1200 is good enough to see proportion issues, modulation irregularities etc. Or at the very least to see that something is not quite right with a letter. From there you can go in and play detective at larger sizes.\n\nI supect that 1200 is sufficient for the vast majority of \\*designers\\* on this site. Myself included. To make the jump to 2400 I think you either need to have extra cash laying around, or derive a large part of your income from designing text typefaces so you can justify the business expense, and know what you're looking at.\n\nR\n\n"
    },
    {
      "time": "18 Oct 2005 — 11:20am",
      "content": "\\> 1200 is good enough to see ...\n\nInteresting.  \nCould you put your finger on how 600 fails for that?\n\nhhp\n\n"
    },
    {
      "time": "18 Oct 2005 — 11:23am",
      "content": "Or you are just curious about the issue... and want to be able to check something in future. Your right it is a narrow audience. But some of us here \\*are\\* that audience.\n\nI think for a type designer the difference between 600 & 1200 is huge. Also, while you can look at type blown up to large sizes to see shapes in the abstract - it really isn't the same as seeing it properly when it is small on paper. You are trying to evaluate subjective experience - and that can't be done if you are not having the experience. If you are interested I will explain further.\n\nThe Minolta 9100 uses PS emulation doesn't it? They sent me a nice test print. I have to admit it looks dandy. Too bad about the cartriges! I remember it having a sweet price point. But the lack of real postscript seems damning to me. Maybe I am being to ivory tower. Would you be willing to print & send/scan something for us so we can judge?\n\n"
    },
    {
      "time": "20 Oct 2005 — 10:20am",
      "content": "BTW\n\nI also found this\n\nxerox 4500N ( N=ethernet network )  \ntrue ps  \nstandard paper 8.5x11 only  \n1200x1200 dpi  \n$999 , or + $329 3 years on-site service  \nI am having a printed sheet sent to me because reviews say the quality is iffy. Then again, were they using the PS?\n\n"
    },
    {
      "time": "20 Oct 2005 — 10:23am",
      "content": "Whoops! It's emulation. Not real PS. Oh well.\n\n"
    },
    {
      "time": "20 Oct 2005 — 10:29am",
      "content": "Whoops again it's real.\n\n[http://www.office.xerox.com/perl-bin/product.pl?product=4500&page=spec](http://web.archive.org/web/20120603123049/http:/www.office.xerox.com/perl-bin/product.pl?product=4500&page=spec \"http://www.office.xerox.com/perl-bin/product.pl?product=4500&page=spec\")\n\n"
    },
    {
      "time": "20 Oct 2005 — 10:49am",
      "content": "<cite>Your right it is a narrow audience. But some of us here *are* that audience.</cite>  \nFair enough. It seems clear that a Xante or getting outputs from a service bureau is best for you. It becomes an ecomonic issue to decide which.\n\n<cite>The Minolta 9100 uses PS emulation doesn’t it? </cite>  \nYes. I think so.\n\n<cite>Would you be willing to print &amp; send/scan something for us so we can judge?</cite>  \nYes. I'll post something in a few minutes.\n\n<cite>Could you put your finger on how 600 fails for that?</cite>  \nNo. I don't have a 600 dpi printer. But I suspect even 600 is good enough to see if the bone structure of a text face is good. At least 75% of a good text face is bone structure. Is the trap in the v too small? Fagedaboudit.\n\nHakim's Razor strikes again: Only design text typefaces for laser printers! QED.\n\nR\n\n"
    },
    {
      "time": "20 Oct 2005 — 10:57am",
      "content": "\\> Only design text typefaces for laser printers!\n\nYou really think so?  \nDesign for the market that cares least about fonts?\n\nhhp\n\n"
    },
    {
      "time": "20 Oct 2005 — 11:20am",
      "content": "Does anybody have a test doc they like to use? I was thinking of sending a PDF from underware or something...\n\n"
    },
    {
      "time": "20 Oct 2005 — 11:52am",
      "content": "Hrant: That was a joke.\n\nOk. Here is a sample. I was actually a little surprised at how close the color was. The trade off is that outline fidelity goes down due to the dithering at the edges (i think that's dithering). I have no idea how printers are hinted. This is a pdf printed out of Preview on a mac, on ultra bright white supersmooth laser paper. The print sample is on uncoated stock (hey! give the laser a chance :-) It is 9pt, which I think is pushing is quite a lot for a laser.\n\nI accidentally removed the background on the prints, and realized one level of undo too late that I shouldn't have.  \nNote: my scanner is crap so take all of this with a grain of salt, though I did use the same sharpen level for the two 9pt scans.\n\n[http://www.aquatoad.com/typophile/print\\_sample.jpg](http://web.archive.org/web/20120603123049/http:/www.aquatoad.com/typophile/print_sample.jpg \"http://www.aquatoad.com/typophile/print\\_sample.jpg\")\n\nR\n\n"
    },
    {
      "time": "20 Oct 2005 — 12:03pm",
      "content": "\\> Hrant: That was a joke.\n\nOh. On the other hand there is such a thing as over-designing.\n\n\\> [http://www.aquatoad.com/typophile/print\\_sample.jpg](http://web.archive.org/web/20120603123049/http:/www.aquatoad.com/typophile/print_sample.jpg \"http://www.aquatoad.com/typophile/print\\_sample.jpg\")\n\nThat half-bitting should not be happening, I'm pretty sure.  \nMaybe that's a flaw of PS-emulation?\n\nhhp\n\n"
    },
    {
      "time": "20 Oct 2005 — 12:08pm",
      "content": "There are a number of true Postscript imagesetters for sale on eBay at this very moment, some -- slightly outdated but still serviceable -- going for a song. Big problem: most are local pickup only; bigger problem: they take up a fair amount of room and have special electrical requirements; biggest problem: the processor byproduct issue mentioned earlier.\n\nMost imagesetters today output between 2400 & 3000 dpi (my boss's Heidelberg does 2540) and it is noticeably different from the output from our 1200 dpi Xante Accel-a-writer (used for intermediate/in-house proofs), though not as dramatically different from the Epson output (4800 dpi).\n\n"
    },
    {
      "time": "20 Oct 2005 — 1:58pm",
      "content": "I have been using a Minolta QMS Pagepro 1250E. It claims true 1200 dpi, and for the most part I think it is ok. I have [uploaded a scan of it's output vs offset for comparison](http://web.archive.org/web/20120603123049/http:/www.klim.co.nz/images/misc/Laser-vs-Offset.jpg), using Pontifex at 9.4 and 6.5 pt. It is rather interesting, as the width is the same, but the overall height of the type from the laser is greater. I don't know what this means, perhaps my scanner is decalibrated. For the record, the scanner is 1200 dpi optical, and all images have been sharpened the same amount.\n\nkris.\n\n"
    },
    {
      "time": "20 Oct 2005 — 2:40pm",
      "content": "Kris,  \nYour samples show the typical laser problem. The laser stuff is darker with a bit more rounding at the joins. Yours is better than most though.\n\nChrisL\n\n"
    },
    {
      "time": "20 Oct 2005 — 6:48pm",
      "content": "Yeah, it is good enough for the time bean. I wonder if there is a way to counteract it? I have also noticed that when I look at the laser vs offset, there is only a \\*slight\\* optical darkening, so it is pretty darn close. I reckon a 2400 dpi machine would be suitable for most purposes.\n\n"
    },
    {
      "time": "20 Oct 2005 — 7:03pm",
      "content": "I think it is the nature of toner to spread and smear. 2400 shoul;d help for most things but Linotronic is the only real option for absolute detail. And damn expensive too :-)\n\nChrisL\n\n"
    },
    {
      "time": "20 Oct 2005 — 7:24pm",
      "content": "One could argue that Linotronic, or any ot that image setter stuff is not accurate, and maybe a high-resolution laser print (2400dpi) is a better indication of how a type will image in an offest litho environment. Perfectly imaged photo repro is hardly the same as plate-blanket-paper image transfer.\n\nOne could!\n\n"
    },
    {
      "time": "20 Oct 2005 — 7:37pm",
      "content": "One could argue quite successfully, and I imagine that one has the 2400dpi laser device mentioned elsewhere, and one finds that rather adequate!?\n\n"
    },
    {
      "time": "22 Oct 2005 — 11:46pm",
      "content": "_My problem is my scanner: only 600 optical. :-(  \nIf you can recruit Raph (sorry, Raph :-) he’s got a really good scanner._\n\nHrant,\n\nI hardly use my 1200 dpi scanner since I got a digital camera.\n\nI adapted my 35mm copy stand with lights to take my digital camera.  \nThe detail and sharpness is better than I got with the scanner. Also I am also no longer limited to the size of the scanner glass.\n\ngln\n\n"
    },
    {
      "time": "23 Oct 2005 — 6:12am",
      "content": "\"One could argue that Linotronic, or any ot that image setter stuff is not accurate, and maybe a high-resolution laser print (2400dpi) is a better indication of how a type will image in an offest litho environment. Perfectly imaged photo repro is hardly the same as plate-blanket-paper image transfer.\"\n\nNo, offset printing is not the same as Lino output but neither is Laser printing. Most laser printers add more weight to horizontals than to verticals and toner blotting is not the same as inkspread on press. Offset printing does not add as much weight overall as toner either. Inkspread varies with many factors, human and mechanical. I only argue that Lino shows you what is in your postscript file and eliminates the other variables. There is no substitute for offset printing but who can afford it as a test method.  \nI don't have a 2400 dpi printer so I don't know how much better it is. I sure would like to get an Asanté though, it has got to be better than my HP. Big bucks problem again :-)\n\nChrisL\n\n"
    },
    {
      "time": "23 Oct 2005 — 9:08am",
      "content": "Hi guys,\n\nI haved an imagesetter and processor that I can use for testing. I can even put paper instead of film (if they still sell the paper). The only problem is that it is PS1 and it sometimes gives errors. I am hoping to get a PS3 RIP for it in the near future.\n\nIf the final offset print will be on coated paper, the imagesetter output is very close. But even on an uncoated paper, imagesetter output is much closer than laser.\n\n"
    },
    {
      "time": "23 Oct 2005 — 9:29am",
      "content": "Gerald, I can actually get over 2000dpi with my mid-range (if old) digital camera. But: I have to use a tripod and careful lighting; and only the tiny middle part is fully in focus.\n\nLevon, maybe people should send you and somebody with a 1200/2400 laser some PDFs, pay for mailing all the outputs to Gerald, and then we can see some serious comparisons?\n\nhhp\n\n"
    },
    {
      "time": "23 Oct 2005 — 11:53pm",
      "content": "I recommend making friends with a printer and asking them to run small tests of your types in the off-cut areas of print jobs for other clients. This is the only cheap way to do real press proofing of fonts in development.\n\n"
    },
    {
      "time": "24 Oct 2005 — 10:10am",
      "content": "There is another way: give/sell a beta copy of your font to the right person. I have Patria on both high-gloss and newsprint thanks to that (and I even made money from it).\n\nhhp\n\n"
    }
  ]
}
