{
  "id": "15466",
  "title": "What is it about Canadians and Type Design?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "There must be something in the water in Canada. It seems there are far more people involved in type design who are from Canada than the size of their population would support. Maybe long winters make people glyph skilled? Other than the Netherlands, I can't think of a single country with more type centrics per capita.  \nI wonder if all Canadians on Typophile would tell us what they think is common to their life that brings out the talent and inclination to pursue design type? Whatever the reason, I am glad it happens :-)\n\nChrisL\n\n",
  "author": "dezcom",
  "time": "3 Oct 2005 — 6:06am",
  "uid": "3135",
  "comments": [
    {
      "time": "3 Oct 2005 — 9:25am",
      "content": "What is it about Canadians, period.\n\nhhp\n\n"
    },
    {
      "time": "3 Oct 2005 — 10:09am",
      "content": "For the October issue of the magazine I write for, I interviewed a calligrapher,  \nAlice Young : [www.calligraphy.ca](http://web.archive.org/web/20140307094623/http:/www.calligraphy.ca/ \"www.calligraphy.ca\") - [www.islandmagic2007.com](http://web.archive.org/web/20140307094623/http:/www.islandmagic2007.com/ \"www.islandmagic2007.com\") .\n\nBest,  \nAS\n\n"
    },
    {
      "time": "3 Oct 2005 — 11:20am",
      "content": "Alessandro,  \nPerhaps it is the lovely scenery then?\n\nGood to hear from you,\n\nChrisL\n\n"
    },
    {
      "time": "3 Oct 2005 — 11:36am",
      "content": "What is it about Canadians, period.\n\nWe ask the same question about Americans.\n\nThe Canadian Government doesn't treat the water with flourides, but with glyphlets, and the fronts that control the weather here originate in Hattem, The Netherlands. Our bullets are typographic, and our pentagons are used to structure page geometry. The frost on the windowpanes here crystallizes according to a bezier logic, but if it is really cold the serifs snap off.\n\n"
    },
    {
      "time": "3 Oct 2005 — 9:08pm",
      "content": "_...can’t think of a single country with more type centrics per capita._\n\nSome of us live in [Vansterdam](http://web.archive.org/web/20140307094623/http:/www.vansterdamtravel.com/), which can influence your outlook on a few things. Canadian [Marshall McLuhan](http://web.archive.org/web/20140307094623/http:/en.wikipedia.org/wiki/Marshall_McLuhan) wrote a whole book about our [Gutenburg Galaxy: The Making of Typographic Man](http://web.archive.org/web/20140307094623/http:/en.wikipedia.org/wiki/The_Gutenberg_Galaxy:_The_Making_of_Typographic_Man), and many of us can blame [Veer](http://web.archive.org/www.veer.com).\n\nAs for _...Candians period:_ Like [Trudeau](http://web.archive.org/web/20140307094623/http:/en.wikipedia.org/wiki/Pierre_Elliot_Trudeau) said about Americans: \"Living next to you is in some ways like sleeping with an elephant. No matter how friendly and even-tempered is the beast, if I can call it that, one is affected by every twitch and grunt.\" So a lot of us define ourselves in contrast to Americans.\n\nJon\n\n"
    },
    {
      "time": "3 Oct 2005 — 9:20pm",
      "content": "What is it about Canadians, period.\n\nYeah, like universal health care– what's up with that? Freakin' communists... ;)\n\n"
    },
    {
      "time": "3 Oct 2005 — 9:36pm",
      "content": "Speak of the devil(s):  \n [http://news.bbc.co.uk/2/hi/business/4306936.stm](http://web.archive.org/web/20140307094623/http:/news.bbc.co.uk/2/hi/business/4306936.stm \"http://news.bbc.co.uk/2/hi/business/4306936.stm\")\n\nhhp\n\n"
    },
    {
      "time": "3 Oct 2005 — 9:57pm",
      "content": "Another amusing pastime is seeing how many of the most famous American comedians of the last 25 years are actually Canadian. It's like, \\>50% - really weird.\n\nT\n\n"
    },
    {
      "time": "3 Oct 2005 — 10:12pm",
      "content": "<cite>Speak of the devil(s):<br>\nhttp://news.bbc.co.uk/2/hi/business/4306936.stm</cite>\n\nInteresting that there are 3 Canadian cities in the top 10.\n\npd\n\n"
    },
    {
      "time": "3 Oct 2005 — 11:40pm",
      "content": "I'd like to think it has something to do with a certain embarrassment in watching George Bush make our neighbours to the south look really, really bad; and by that I mean that his (and, by unfortunate proxy, their) seemingly imperative need to draw as much attention as possible; and by that I mean that up here there is a century-long drive to define Canadian as not-American and thus, maybe, there is a desire to be less conspicuous; and by that I mean that we either fool or berate ourselves into thinking that by being less conspicuous we're more humble, more restrained, more 'dignified,' and all of these, I think, are key characteristics of decent typography. We also tend to see isolation and lack of recognition as romantic, which also fits well. If the goal of good typography is to be understated, Canada's a great place to do it from.\n\n(The fact that I've been hesitating to hit the \"Post comment\" button for the past 10 minutes and have re-read the above paragraph about 20 times, wondering if it's too obnoxious, also speaks to this attempt at decorum, and this kind of obsessive-compulsive behaviour is probably also common in the type-inclined.)\n\n"
    },
    {
      "time": "3 Oct 2005 — 11:46pm",
      "content": "just out of curiosity — why do you think that \"Other than the Netherlands, I can’t think of a single country with more type centrics per capita.\"\n\nand why \" It seems there are far more people involved in type design who are from Canada than the size of their population would support.\"\n\n"
    },
    {
      "time": "4 Oct 2005 — 7:32am",
      "content": "I grew up in a bilingual city, Montréal, which is also the home to many immigrant communities. (A secondary school trip to the Northwest Territories allowed me to hear and see the Inuktitut language.) As a result I was surrounded by language, both spoken and written, and when I worked at a typesetting bureau, I was taught how to set French, which is not how one sets English. So I understood that type is not an inflexible system of marks, but is a living thing.\n\nSo, that's my theory. You get yourself a humble multi-lingual country, throw in some long winters for good measure, and you get \"slow-makers\", people who take their time on long-term projects, like writing novels and making typefaces.\n\n"
    },
    {
      "time": "4 Oct 2005 — 8:23am",
      "content": "I'm not entirely convinced by this. I have a feeling that we'll find the US still has more active type designer per capita than any other country. Perhaps Yuri or Adam can provide us with the proportion of FontLab sales by country - or is that a bad way of measuring this?\n\nIt’s a shame there was no report for Canada in this year’s ATypI country delegate report.\n\nSi\n\nATypI country delegate for the USA\n\n"
    },
    {
      "time": "4 Oct 2005 — 8:35am",
      "content": "_humble_\n\nheh. ;^P\n\n"
    },
    {
      "time": "4 Oct 2005 — 8:45am",
      "content": "<cite>Another amusing pastime is seeing how many of the most famous American comedians of the last 25 years are actually Canadian. It’s like, &gt;50% - really weird.</cite>\n\nIndeed, though I found when I lived there, that Canadian comedy (television comedies, mostly) were terribly <cite>un-</cite>funny. Perhaps it is due to my odd sense of humor, but I couldn't stand to watch Canadian shows, however they do allow bad words after bedtime, so I'll give them credit for that.\n\n"
    },
    {
      "time": "4 Oct 2005 — 8:57am",
      "content": " **If every funny person has left Canada for the US it does make sense.**\n\nƒ\n\n"
    },
    {
      "time": "4 Oct 2005 — 9:06am",
      "content": "Yee  \nha\n\nanother\n\nwe  \nrule  \nyou  \nsuck\n\nno  \nyou  \nsuck\n\nno  \nyou  \nsuck  \nand  \nhere's  \nwhy\n\nthread.\n\n"
    },
    {
      "time": "4 Oct 2005 — 9:09am",
      "content": "Jason, good stuff.\n\n\\> not how one sets English.\n\nHow so?\n\nCertainly, living in a multi-cultural society, or better yet a multi-scipt one (I had three) opens your eyes much more to the undercurrents of Shape.\n\n\\> the US still has more active type designer per capita\n\nYou really think so, more than the Netherlands?\n\nZara, what about British humo[u]r?\n\nhhp\n\n"
    },
    {
      "time": "4 Oct 2005 — 10:58am",
      "content": "\\> You really think so, more than the Netherlands?\n\nLooking at the numbers The Netherlands population is about 16 million, the US about 293 million - so for every active Dutch type designer you'd need 19 active US type designers - that might be pushing it. But I would not be surprised if Yuri has sold more than 19 times the number of FL licenses to US residents than Dutch residents. 'spose it just depends on the definitions you pick.\n\nFWIW Canada's popualtion of 32.5 million is about 1/9 of the US.\n\nSi\n\n"
    },
    {
      "time": "4 Oct 2005 — 11:15am",
      "content": "_Indeed, though I found when I lived there, that Canadian comedy (television comedies, mostly) were terribly un-funny_\n\nObviously, you never watched [The Red Green Show](http://web.archive.org/web/20140307094623/http:/www.redgreen.com/)...\n\n"
    },
    {
      "time": "4 Oct 2005 — 12:04pm",
      "content": "Hello Chris Lozos, thanks.\n\nYeah, I'm after a period, I moved to Turkey.  \nI will copy a piece of the interview.\n\n\\*\\*\\*\n\nI live in a place that is green and wild: rural Vancouver  \nIsland, British Columbia, Canada. It is one of those  \nplaces where civilization is just touching wilderness, so  \nmy home is surrounded by tall cedar and hemlock forests,  \nrocks, mosses and wildlife. My house is small, with a  \nlarge natural garden frequented by various types of  \nanimals - but ruled by my dog and cat!\n\nDespite its remote location, Vancouver Island is rich with  \nart and culture. The First Nations in this area have a rich  \nartistic heritage, and there are many totems and carvings.\n\nI am a graphic designer at Suburbia Advertising in  \nVictoria, BC, a small, upscale advertising agency  \nemploying fourteen people, and specializing in retail  \nadvertising. My background includes seven years of working  \nat larger international ad agencies in Toronto, Canada. Not  \nsurprisingly, I love working with type!\n\nLike many kids, I doodled on my schoolbooks, and even  \nthough drawing was one of my favorite pastimes, I always  \ndoodled letters rather than drawings, on my books. (Alex,  \ndo you know what doodling is?! Strange word, no?)\n\nI remember clearly the moment I first encountered 'real'  \nink… I was probably about thirteen, sitting at my brothers  \ndrafting table. He had an ink pen meant for sketching, and  \nI picked it up and started drawing letters. I remember  \nwatching the dark liquid become animated – so unlike the  \nballpoint pens and markers I was used to. I was entranced.  \nNot long after that, I bought my first calligraphy set and  \nmy goal that summer was to spend one hour each day  \npracticing.\n\nMy life since then has included long periods where I put  \ncalligraphy aside, in favor of my work - design and  \ntypography, but something keeps pulling me back to  \ncalligraphy. The magazine \"Letter Arts Review has been  \ninspirational and key to my picking up the pen again, many  \ntimes. Over the years I have watched calligraphy grow and  \nevolve on it's pages. Also, when I was younger, I knew I  \nwould do more calligraphy when I was older – what a  \nsurprise!, I'm older now! :)\n\n\\*\\*\\*\n\nBest,  \nAS\n\n"
    },
    {
      "time": "4 Oct 2005 — 12:37pm",
      "content": "\"I have a feeling that we’ll find the US still has more active type designer per capita than any other country.\"\n\nNah, I don't think we'll find that's true. If we used \"per capita\" by its most frequent meaning it would not be true. The United States is a huge country and consists of many different states (regions). In a country so large there are differing mentalities and opinions that are often regional. Being a guy from the Mid-West who has lived on the East Coast and now the West Coast these places could all be different countries. New York City has more in common with London than it does with West Virginia.\n\nNow, if we were to use the per capita definition and apply it by state we might be on to something. But considering how concentrated the American population is on the extreme coasts I don't think it'd be accurate to use \"per capita\" in the U.S. I'd be willing to bet money that there are less than 7 type designers in South Dakota.\n\nEven in New York City I personally know of maybe two people who design typography. Groups of college friends deciding to start a type foundry together doesn't happen here in the U.S. very often, but I hear about it all the time in Europe.\n\nI think the U.S. has a basic lack of respect for the arts and design. There's too much of a \"get a real job mentality\" that persists here. If that weren't true, there would be more Ph.D. art and design programs as well as a Master's and Undergraduate type design programs.\n\nJust 'cuz I like drawing, don't mean I'm dumb.\n\n"
    },
    {
      "time": "4 Oct 2005 — 12:57pm",
      "content": "See this google battle.\n\n[http://www.googlebattle.com/index.php?domain=South+Dakota+typography&dom...](http://web.archive.org/web/20140307094623/http:/www.googlebattle.com/index.php?domain=South+Dakota+typography&domain2=Netherlands+typography&submit=Go%21 \"http://www.googlebattle.com/index.php?domain=South+Dakota+typography&domain2=Netherlands+typography&submit=Go%21\")\n\nalthough the Netherlands beats South Dakota 2:1 the population of The Netherlands is almost twenty times that of South Dakota. Per capita South Dakota is ten times more typographic than the NL.\n\nSomewhat more seriously if you define a type designer as someone who has designed a font from scratch, either as a custom (non retail) design, a retail design, or created a freeware or shareware font in say the last five years I'd guess that you could easily find over 2000 US residents who would qualify. Could you find 100 Dutch or 200 Canadians? Possibly in the case of the Dutch but Canada, I doubt it.\n\nI think the US economy/education system encourages activities like type-design - I know there are plenty of part-time/hobbyist type designers out there (maybe they need a distraction from their day jobs or school work) and there are plenty of jack-of-all-trades graphic designers who are forced to dabble in type design with respect to paying projects.\n\nSi\n\n"
    },
    {
      "time": "4 Oct 2005 — 1:54pm",
      "content": "I'm not so sure about all of this, but I think more than Canada, there is definitely something in the water in the area around the Netherlands and Scandinavia. Not only type design, but design in general. Melding utilitarianism of what could be called modernism with the warmth and quaintness of another era long since forgotten.\n\nComparing is a dangerous thing. Better to simply appreciate that the world is made up of a wonderful variety which makes friendly competition spawn the desire for growth and improvement of self.\n\n"
    },
    {
      "time": "4 Oct 2005 — 3:18pm",
      "content": "<cite>Comparing is a dangerous thing. Better to simply appreciate that the world is made up of a wonderful variety which makes friendly competition spawn the desire for growth and improvement of self.</cite>\n\nNow <cite>that</cite> is a very Canadian attitude. I agree wholeheartedly.\n\nUp with Canada! (but not so far up that some other country might think that we are claiming to be better than anyone else... verily, even though we may think we have the best society on earth, we wouldn't want to make anyone feel bad about their own countries.) :)\n\npd\n\n"
    },
    {
      "time": "4 Oct 2005 — 4:43pm",
      "content": "Gee, I thought I was appreciating other parts of the world. I didn't mean to start people thinking it was a Canada vs the U.S thing. I didn't even mention the U.S. I was just attempting to compliment Canada on having such a positive affect on type design. My straw poll was just my experience on Typophile and the people I met at TypeCon. I don't think very highly of Bush either but he doesn't even know how to spell typography let alone affect it.  \nI was kinda hoping for more stories like Chester's humorous yet acurate post above. Chester, thanks for having a sense of humor. You probably need it on cold Winter nights when your hard disk dies and you lose all of your work--at least you can swear in a couple of languages :-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Oct 2005 — 7:41pm",
      "content": "Chris, the winter was the reason I left Montréal for London. (Actually, it wasn't. Who needs an excuse to move to London?) In all events, I, like many of my fellow Canadians, did some time abroad. I am now based in New York, another place with winter.\n\n"
    },
    {
      "time": "5 Oct 2005 — 7:30am",
      "content": "Jason:\n\nYou wrote \"(...) there is a century-long drive to define Canadian as not-American\"\n\nAre they pushing the country off the continent? I'll stay tuned to see how they finally manage to do it. ; )\n\n-An american colleague (from México)\n\n"
    },
    {
      "time": "5 Oct 2005 — 7:54am",
      "content": "The Winters in Pittsburgh Pennsylvania helped me decide to move to northern Virginia 30 years ago. I would imagine the Canadian Winters to be even longer.\n\nChrisL\n\n"
    },
    {
      "time": "5 Oct 2005 — 9:44am",
      "content": "Canadians do have a sense of humour, if different in some ways from other parts of the world.\n\nWinter in my part of Canada doesn't get cold until mid November and ends about mid February with the first blooming daffodils. I cringe when my fellow BCers make this statement in the presence of eastern Canadians, but in this case it seemed justified. The temperature here rarely drops colder than about 25 degrees Farenheit. That covers the Canadian Winter.\n\nRegarding whether or not Canada has a greater amount of type designers per sackful than the rest of the world: who cares?\n\nI believe that all of us involved in type design, whether in Zanzibar or Spuzzum, are drawn to it by its grace, truth and beauty.\n\nAnd now for a Canadian joke . . .\n\nJim\n\n"
    },
    {
      "time": "5 Oct 2005 — 10:25am",
      "content": "I had never really thought about there being lots of Canadians involved in type, but perhaps because there is so little sense of community. I see Jim Rimmer from time to time, and Ross Mills of course, but apart from that I'm more likely to meet other Canadian type designers at conferences in Europe than I am to meet them at home. Nick Shinn lives so far away he might as well be in another country. If I want to play the western alienation card, I could say that he _is_ in another country.\n\n"
    },
    {
      "time": "5 Oct 2005 — 10:46am",
      "content": "\"... but perhaps because there is so little sense of community.\"\n\nPerhaps that is part of it all. Type design seems a rather solitary endeavor where people work in solitude and meet occasionally at conferences. I met more Canadians at TypeCon (Nick Shinn among them) than Americans and it was held in NYC.\n\nJim, I'll have to visit western Canada during Winter but I won't squeal on you about the mild Winters to any of the eastern Canadians :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Oct 2005 — 10:48am",
      "content": "John, maybe ATypI should organize geographic chapters?\n\nhhp\n\n"
    },
    {
      "time": "5 Oct 2005 — 11:48am",
      "content": "The ATypI country delegate program allows for multiple country delegates, so you could easily have one in Western Canada and one in Eastern Canada, you could even have one for northern Canada perhaps representing the minority scripts used by the original Canadian communities. As mentioned earlier there was no Canadian delegate report this year, but I don't know if there's a current delegate or not.\n\nHaving said that you need the volunteers. We have two US delegates, unfortunately both located in the same town. Hopefully in my report I represented the whole country by asking various US-based type people to review and contribute to my report.\n\nSi\n\n"
    },
    {
      "time": "5 Oct 2005 — 11:55am",
      "content": "Mosh, I was of course speaking ideologically (culturally, on the other hand, we're sucked right in to all that US hoopla and flash, but we seem to like to think we \"know better\"). As for geography, there's been a looming threat for decades of a giant earthquake swallowing Vancouver Island (where I live), so perhaps there is a collective mentality trying to move away from \"America\"?\n\nRegarding type design & typography, I think the point many up here would touch on is that romantic sense of isolation, wide open space, blah, blah; that is, finding somewhere quiet to focus on the work. Bringhurst seems a good example, tucked away in the trees of the Gulf Islands sculpting away on his laptop.\n\n"
    },
    {
      "time": "5 Oct 2005 — 12:30pm",
      "content": "Simon, is MS a US state, or a country? :-)\n\nHermitism: to me, it's for artists, not craftsmen.\n\nhhp\n\n"
    },
    {
      "time": "5 Oct 2005 — 1:03pm",
      "content": "\\>Simon, is MS a US state, or a country? :-)\n\nIt was certainly nice to be invited to contribute an MS report. I hope I gave appropriate credit to other technology companies who are innovating in the type and type technology space. I think Henrik had included non country reports in the past, and I hope his replacements do the same. I agree with those on the ATypI list that there should be room for delegates representing internationally used scripts and writing systems (eg Arabic & Cyrillic) but I think finding volunteers prepared to put in the effort will be hard.\n\n"
    },
    {
      "time": "5 Oct 2005 — 1:15pm",
      "content": "Chris: Please look me up if you ever get to the west coast. Wear flip flops.\n\nJohn: You are right, there aren't many type designers here. Ted Staunton works away at it in Surrey, and that's about it as far as I know. Maybe there are heaps of type designers in Winnipeg, Toronto and Montreal.\n\nJim\n\n"
    },
    {
      "time": "5 Oct 2005 — 1:18pm",
      "content": "\"...Wear flip flops.\"\n\nLOL!\n\nI sure will Jim:-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Oct 2005 — 2:35pm",
      "content": "Hey if you regionalize the type designers, maybe there is a type sports league to be formed. I could see the Canadian west coast team vs. the Canadian east coast team in a game of glyphs (what ever that is). Maybe you could even wear helmets with cute glyphs on them.\n\n"
    },
    {
      "time": "5 Oct 2005 — 3:07pm",
      "content": "Glyph Hockey?\n\n:-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Oct 2005 — 3:10pm",
      "content": "Golf\n\n"
    },
    {
      "time": "5 Oct 2005 — 3:14pm",
      "content": "Another idea for a typographic game show (like at TypeCon): Name That Font! The host reads a short description, then asks the participants how few glyphs then can name the font in. \"Tiffany, I can name that font in... one glyph!\" Would be a nice change from the classic type quizzes.\n\nhhp\n\n"
    },
    {
      "time": "5 Oct 2005 — 3:18pm",
      "content": "a typographic game show:\n\nGlyph of Fortune\n\n"
    },
    {
      "time": "5 Oct 2005 — 3:18pm",
      "content": "Canadians are physical types, something like Glyph hockey makes sense to me. Hey that was a two line pass! (Pro hockey starts its season tonight)\n\n"
    },
    {
      "time": "5 Oct 2005 — 3:21pm",
      "content": "Off topic, dave did you back up your computer, its already the 5th.\n\n"
    },
    {
      "time": "5 Oct 2005 — 4:03pm",
      "content": "Someone should start a thread on typographic gameshows - \"Iron Font\" would be my choice, with Kent Lew being the host.\n\nSi\n\n"
    },
    {
      "time": "6 Oct 2005 — 7:22pm",
      "content": "I've gotta say this place is my first interaction with a community of typographers, but then I don't get out much. I've never met a typographer in Montreal, or in person.  \nI stumbled on this (possibly following a link someone posted here) [http://www.porchez.com/ateliertypo/?c=atelier+uqam](http://web.archive.org/web/20140307094623/http:/www.porchez.com/ateliertypo/?c=atelier+uqam \"http://www.porchez.com/ateliertypo/?c=atelier+uqam\")  \nand was stunned. I didn't know such things existed at UQAM. (Perhaps because I've had my head stuck in Concordia for too long... hmm. I wonder if ConU does stuff like this, too?)\n\nAs for winters, you Islanders, I'll post pictures of Montreal's massive snow banks and the fun I have parking my car (or shovelling it out) every morning... but it's better than 6 months of rain any day. You know You're in Montreal when the inside of your nose freezes and sticks together.\n\nKristina\n\n"
    },
    {
      "time": "7 Oct 2005 — 12:03am",
      "content": "What about them, ellipsis... You are what you eat, right? Then forget McDo. Great minds comes from ... well, you guessed it. Large tempests that grow in the south seas, make their way slowly to the great white north, but not before leaving most of the useless particles behind them. What is left is of great advantage to the people of Canada, since type designers will benefit from what grows from the land. It is fair to say that it has to be a gift from the heavens. In the summer, (yes, there is summer over there) the country that is known to have igloos for shelter instead of houses as most south bordeans that could not pinpoint it on a globe are lead to believe, those icy blocks have a tendency to get a little softy, but winter wise are as hard as rock, just like metal typefaces. So then, creativity that comes from the land of the ice cubes is apparently a natural gift, enough to make jealousy grow in the world around them. PERIOD.\n\n"
    },
    {
      "time": "7 Oct 2005 — 3:11am",
      "content": "I don't know about the water, but I do know that the Belgian Luc Devroye who teaches at McGill University in Montreal, and to whom I look frequently for links to many many type sites as well as commentary, has probably inspired a few to become type designers, type geeks, whatever. Luc is at [http://jeff.cs.mcgill.ca/~luc/fonts.html](http://web.archive.org/web/20140307094623/http:/jeff.cs.mcgill.ca/~luc/fonts.html \"http://jeff.cs.mcgill.ca/~luc/fonts.html\")\n\n"
    }
  ]
}
