{
  "id": "15460",
  "title": "walbaum text for magazine?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am redesigning a fashion magazine where the display faces are Didone/Moderne. For a while I was considering Melior as a body face but it’s simply too limited (not Open Type, not enough weights, OSF etc.) I fell in love with Storm’s Walbaum Text but as I’m setting it, the color starts to appear very dark, almost inelegant, on the page. I’m worried about going so counter-trend as most consumer mags are light. Can anyone think of a similar face with lighter color?\n\n| Attachment | Size |\n| --- | --- |\n| [File](http://web.archive.org/web/20081013172809/http:/typophile.com/files/drupal_50) | 75.24 KB |\n\n [‹ Quotes from Type Designers](http://web.archive.org/web/20081013172809/http:/typophile.com/node/15463 \"Go to previous forum topic\") [Type requirements for a broad sheet ›](http://web.archive.org/web/20081013172809/http:/typophile.com/node/15450 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013172809/http://typophile.com/user/9015\" title=\"View user profile.\">asmith</a>",
  "time": "<br>",
  "uid": "9015",
  "comments": [
    {
      "time": " 2.Oct.2005 6.21am",
      "content": "I love Walbaum in small servings. I’m afraid that I would feel intimidated by the full text set in it. You might try something that will open the page up a little more.\n\n"
    },
    {
      "time": " 2.Oct.2005 6.44am",
      "content": "Walbaum is great for text setting. It has been used for such in Germany for over 150 years. Stateside, WIRED magazine uses (used?) a customized version of it, made by Matthew Carter.\n\nMaybe you can lighten up the text by adding more leading? Or you could try another Walbaum digitization, like [Linotype’s](http://web.archive.org/web/20081013172809/http:/www.linotype.com/1594/walbaum-family.html) or [Monotype’s](http://web.archive.org/web/20081013172809/http:/www.myfonts.com/fonts/agfa/walbaum-mt/) (Monotype’s certainly looks light—from the preview—to me; maybe it’d work?).\n\n"
    },
    {
      "time": " 2.Oct.2005 6.44am",
      "content": "Didone = Didot + Bodoni, as you know, Mr. Smith.  \nI have couple of links for you, I would dare, good taste, ask some women, sometimes men.  \n [http://www.fmrspa.it/](http://web.archive.org/web/20081013172809/http:/www.fmrspa.it/ \"http://www.fmrspa.it/\")  \n [http://www.designboom.com/portrait/fmr.html](http://web.archive.org/web/20081013172809/http:/www.designboom.com/portrait/fmr.html \"http://www.designboom.com/portrait/fmr.html\")\n\nRegards,  \nAS\n\n"
    },
    {
      "time": " 2.Oct.2005 8.18am",
      "content": "I was redesigning a magazine a few years ago, and I worked up some prototypes using several different text and display faces. When I showed them to the client, he said he didn’t want to discuss them with me for a few days, but instead would take the boards with him and get back to me. I asked why he didn’t want to at least give me some preliminary thoughts, and he said, “I want to take them to my mother and have her read through them. She’s 70. If she can’t read it, it’s no good to me.”  \nI’ll never forget that response, because it was so honest and so practical.  \nWalbaum has been used for a hundred years (I suppose it’s closer to 200), and it’s a beautiful face. But I’d work up some dummies with something more legible, such as Perpetua (with a good amount of leading) or even Palatino, just to compare. I don’t know. You said you were looking for suggestions.\n\n"
    },
    {
      "time": " 2.Oct.2005 8.34am",
      "content": "You know what- I don’t know how but I must have missed your mention of the Display being Didone Moderne. Walbaum might work if you bumped the pt by a half or so and increased the leading, although its real strength, in my opinion, is as a headline face.\n\n"
    },
    {
      "time": " 2.Oct.2005 8.52am",
      "content": "FF Acanthus is lovely, although not Opentype—and if Storm’s Walbaum is too dark for you, you’d probably find the text weight of Acanthus too dark as well.\n\nOurType’s Arnhem Blonde is another great face, and it is Opentype.\n\nAdobe’s Kepler is mighty useful, and very full featured. It would be hard to go wrong with it.\n\nDTL’s Paradox is pretty cool. I believe all the DTL faces are now supplied in OT.\n\n"
    },
    {
      "time": " 2.Oct.2005 10.31am",
      "content": "Check out Walburn, Nick Shinn’s adaptation of Walbaum. There’s a light text weight that might be useful.\n\n[http://www.shinntype.com/](http://web.archive.org/web/20081013172809/http:/www.shinntype.com/ \"http://www.shinntype.com/\")\n\n[http://www.myfonts.com/fonts/shinn/walburn/](http://web.archive.org/web/20081013172809/http:/www.myfonts.com/fonts/shinn/walburn/ \"http://www.myfonts.com/fonts/shinn/walburn/\")\n\n"
    },
    {
      "time": " 2.Oct.2005 11.55am",
      "content": "Take a look at our [Alfon](http://web.archive.org/web/20081013172809/http:/www.terminaldesign.com/retail_specimen.php?ID=1191&viewFam=1). Not a Waldbaum, but a modern that has been used by several magazines. And it is OpenType.\n\n"
    },
    {
      "time": " 3.Oct.2005 3.37am",
      "content": "Excellent feedback everyone. Thanks very much. At first blush, Alfon has all the right features (I wish it had a closed loop ’g’.) I will definitely consider it.\n\n"
    },
    {
      "time": " 3.Oct.2005 9.23am",
      "content": "\\> I wish it had a closed loop ‘g’.\n\nHeyyy, a Freestyle Remix Challenge, anyone?\n\nhhp\n\n"
    },
    {
      "time": " 3.Oct.2005 11.24am",
      "content": "\\>Heyyy, a Freestyle Remix Challenge, anyone?\n\nOuais! I’m really intersted Hrant, do you start this 4th challenge?\n\n"
    },
    {
      "time": " 3.Oct.2005 8.41pm",
      "content": "Before we try that, I’d like to see the alternates  \nthat I suspect James himself made for the “g”...\n\nhhp\n\n"
    },
    {
      "time": " 4.Oct.2005 6.42am",
      "content": "The original design of Alfon began with a closed loop g. But it migrated to its present form. (through many alternates) Changing that character does change the entire feel of the face, so I’d rather not go there. If you absolutely feel Alfon works for your project, drop me a line about a custom version, but first I’d try it “as is”. It really works well as magazine text.\n\nHaving spent the first 12 or so years of my career in magazines, I keep the needs of magazine AD’s in my head whenever I design a type family.\n\nJames\n\n"
    },
    {
      "time": " 4.Oct.2005 8.52am",
      "content": "Nice of you to offer an alternative. But why not  \nalso show it/them here, for the sake of education?\n\nhhp\n\n"
    },
    {
      "time": " 4.Oct.2005 9.36am",
      "content": "Showing them would require me to still have them. I tend to discard glyph variations once I settle on what I decide is the final. Sometimes they live on in another design, but a cascade of 12 or 15 variations of a lowercase g tend to either be discarded, or filed away never to be found. Just as well, the closed bowl g I would draw today as an alternate would most likely be very different than the one I drew 2 or 3 years ago.  \nI know that some designers tend to save everything, but I’m usually pretty liberal with the delete key.\n\n"
    },
    {
      "time": " 6.Oct.2005 6.39pm",
      "content": "I have used Font Bureau’s Village or M. Carter’s Miller for text faces in the magazines I have redesigned. We have tested many among reader demographics and they have always had good responses.\n\n"
    }
  ]
}
