{
  "id": "15492",
  "title": "Custom Script font designer needed",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "One of my clients is wanting to have her handwriting converted to a font but this is not something I do. I would just need a basic set. If anyone is interested please let me know rates and timeline. You may write to me directly at [amanda@wraycodesign.com](mailto:amanda@wraycodesign.com) and/or post examples here.\n\n [‹ Type 3 Beowolf, Beosans](http://web.archive.org/web/20080121184022/http:/www.typophile.com/node/15903 \"Go to previous forum topic\") [May 24 ›](http://web.archive.org/web/20080121184022/http:/www.typophile.com/node/4825 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080121184022/http://www.typophile.com/user/8501\" title=\"View user profile.\">wrayco</a>",
  "time": "<br>",
  "uid": "8501",
  "comments": [
    {
      "time": " 5.Oct.2005 1.06pm",
      "content": "[http://www.vletter.com/](http://web.archive.org/web/20080121184022/http:/www.vletter.com/ \"http://www.vletter.com/\")\n\nSi\n\n"
    },
    {
      "time": " 5.Oct.2005 1.09pm",
      "content": "This looks like a place to start, but boy could they use some page design...yikes. Do you know if anyone who has used them?\n\n"
    },
    {
      "time": " 5.Oct.2005 1.22pm",
      "content": "Amanda,  \nI could be wrong but I think there may be some humor meant by Si’s post.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Oct.2005 1.26pm",
      "content": "No, it’s serious - and there are a few such outfits in business.  \nBut the quality is... what you’d expect I guess.\n\nhhp\n\n"
    },
    {
      "time": " 5.Oct.2005 1.50pm",
      "content": "I was kind of semi-serious. These chaps seem to be best of a ’bad’ bunch. One thing they’ve offered for a while is contextual OpenType fonts which does put them a cut above the rest. I had them convert a friends handwriting as a wedding gift a few years back and the result seemed pretty fair (for $99) - to the extent that whenever I get handwritten cards from her I catch myself thinking ’I know that font’.\n\nWe also licensed a few fonts for them for use in localized Flash based help tutorials for German and Italian Tablet PC - we needed handwriting that looked authentic for these countries. Again fonts were okay and usable in these tutorials.\n\nWe’ve also been badgering them for a while on fixing validator errors in their fonts so quality may have improved.\n\nAn alternative might be the cut-down FontLab product (can’t recall the name), or of course a real designer, but I can’t help but think that life’s too short for talented people to be working on stuff like this ;-)\n\nOh one more if you have access to a Tablet PC... [http://www.microsoft.com/windowsxp/downloads/powertoys/tabletpc.mspx](http://web.archive.org/web/20080121184022/http:/www.microsoft.com/windowsxp/downloads/powertoys/tabletpc.mspx \"http://www.microsoft.com/windowsxp/downloads/powertoys/tabletpc.mspx\") scroll down to “My Font Tool for Tablet PC” Results are not exactly good but it’s free.\n\nSi\n\n"
    },
    {
      "time": " 5.Oct.2005 1.52pm",
      "content": "and there’s always Chank’s [Go Font Yourself.](http://web.archive.org/web/20080121184022/http:/chank.com/gofontyourself/index.php)\n\n"
    },
    {
      "time": " 5.Oct.2005 1.56pm",
      "content": "How about [Fontshop’s “Handfont”?](http://web.archive.org/web/20080121184022/http:/www.fontshop.com/products/handfont.cfm) I have a feeling that they might do a at least a slightly-better-than-totally-terrible job.\n\n"
    },
    {
      "time": " 5.Oct.2005 2.00pm",
      "content": "The Chank reference raises a good point. Watch the license/rules/smallprint as the company/person creating the font may retain rights to the font - which might cause a problem for your client.\n\nAs I recall with VLetter the font you get back is covered by a license (so you can’t share it with all your mates) but VLetter can’t use it elsewhere without your permission.\n\nCheers, Si\n\n"
    },
    {
      "time": " 12.Oct.2005 9.48am",
      "content": "Vletter in the news...\n\nFather’s beautiful handwriting remains as a living legacy  \n [http://jamestownnews.womacknewspapers.com/articles/2005/10/12/news/local...](http://web.archive.org/web/20080121184022/http:/jamestownnews.womacknewspapers.com/articles/2005/10/12/news/local/news09.txt \"http://jamestownnews.womacknewspapers.com/articles/2005/10/12/news/local/news09.txt\")\n\nSi\n\n"
    },
    {
      "time": " 12.Oct.2005 4.36pm",
      "content": "Vletter, yes, that is the old Signature Software company. They  \nstarted out by placing ads in airline magazines for 100 dollar custom  \nhandwriting jobs. Thousands of business guys fell for it.  \nSo, I decided to check it out and shelled out 100 dollars.  \nI opened the PostScript font (which is no doubt illegal—hence my  \nimmense pleasure), and saw that each character was represented four  \ntimes. Each time the font was called upon to produce that character,  \nit would take the next one, rotating through the four glyphs.  \nThat, in my opinion, is not “context sensitive”. It is not in the  \nspirit of OpenType ligatures, for example. The sales hype  \nthat accompanied this was just incredible—they called it “magic”.  \nMaybe they could have changed between 1999 and now, but the samples  \non their web page (look at “subsystems”) seem to indicate that  \nthey are still rotating through their glyphs. Any decent computer  \nscience graduate can do infinitely better than that.  \nIt is disappointing to see that Microsoft is aligning itself  \nwith such a company.\n\nCreating real-looking handwriting is \\*very very\\* difficult. No one  \nhas done it to date—it is one of those enormous challenges ahead  \nof us—I have dabbled in it myself, but had to give up because  \nI needed to do other things to make a living. Lots of things  \nare important: ductus, stress, style of pen, inertia (and thus,  \ndifferential equations), connectivity, ligatures, and so forth.  \nThe best attempt I had was when I wrote 1600 glyphs with an  \nelectronic pen, including all the pairs and triples of characters  \nthat were most common in Shakespeare’s work. But it’s not enough—  \nthere is no program on earth (yet) that can really “learn” how  \na writer moves his/her hand. Most experts in this area work in  \nElectrical Engineering departments, by the way—they are familiar  \nwith signal processing and related things. Anyway, it’s going  \nto take another decade at least to get something decent.  \nVletter is just a temporary cure for the cold.\n\nAll the best to everyone,\n\nLuc\n\n"
    },
    {
      "time": " 12.Oct.2005 5.00pm",
      "content": "Hi Luc,\n\n\\>Vletter, yes, that is the old Signature Software company.\n\nYes they changed their name - apparently there were four or five other companies using the same name - it’s kind of snappy.\n\n\\> opened the PostScript font\n\nMight be more sensible to open the OpenType font in FL and take a gander at their OTL tables.\n\n\\>which is no doubt illegal\n\n...in the name of scientific study and research I’m sure no one would object.\n\n\\>hence my immense pleasure\n\n...now that’s a little bit sad ;-)\n\n\\>Any decent computer science graduate can do infinitely better than that.\n\n...and mass produce thousands of fonts for less than $100 each? I wonder why they’ve not bothered? I think I pointed out that the font I had made was not top quality, but I didn’t feel cheated out of my $100. You get what you pay for.\n\n\\>It is disappointing to see that Microsoft is aligning itself with such a company.\n\nIf by aligning you mean “licensing a couple of fonts for a Flash demo and nagging them to fix their bad fonts” then you’d be right.\n\nI’d agree that making 100% convincing handwriting is probably impossible. Most of the people on this list can spot fake handwriting a mile off. But looking at the wide-spread use of VLetter’s fonts and other handwriting fonts in direct-mail, advertising etc., seems as if you can fool most of the people most of the time.\n\nI assume the electrical engineers are not in the direct-mail biz. Why are they interested in this? What’s the application of this work?\n\nCheers, Si\n\n"
    },
    {
      "time": " 30.Oct.2005 4.02pm",
      "content": "In the news today. Reporter gives Fontifier a spin...\n\n[http://www.nj.com/business/ledger/index.ssf?/base/business-1/11306515182...](http://web.archive.org/web/20080121184022/http:/www.nj.com/business/ledger/index.ssf?/base/business-1/1130651518203840.xml&coll=1 \"http://www.nj.com/business/ledger/index.ssf?/base/business-1/1130651518203840.xml&coll=1\")\n\nCheer, Si\n\n"
    },
    {
      "time": " 31.Oct.2005 5.49am",
      "content": "It might be worthing getting in touch with Alphabet Soup. They have done some nice custom script jobs in the past. [http://www.alphabet-soup.co.uk/](http://web.archive.org/web/20080121184022/http:/www.alphabet-soup.co.uk/ \"http://www.alphabet-soup.co.uk/\")\n\n"
    }
  ]
}
