{
  "id": "15491",
  "title": "Pronunciation question",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Long-time lurker, first-time poster...\n\nHaving lived most of my life thus far in isolation from type fiends, and getting most of my typographical education from books, I'm stuck on a few names that I just have no idea which way to pronounce. Help a brother out?\n\nThe ones I'm confused on are:  \nFrutiger  \nDeepdene  \nGaramond  \nTschichold\n\nI'm sure there are others, but for some reason I can't recall them off the top of my head right now.\n\nThanks,  \nJim\n\n",
  "author": "<a href=\"/web/20120305230833/http://typophile.com/user/8114\" title=\"View user profile.\">jazzsammich</a>",
  "time": "<br>",
  "uid": "8114",
  "comments": [
    {
      "time": "",
      "content": "- Frutiger -- _FROOT-te-gurr_\n- Deepdene --\n- Garamond -- _GAH-rah-mond_\n- Tschichold -- I could say it, but you'll laugh\n\nSome [pronunciation guidance](http://web.archive.org/web/20120305230833/http:/typophile.com/node/15211) on this thread.\n\n"
    },
    {
      "time": "",
      "content": "It would be good to have a typowiki entry with definitive answers to the many pronounciation questions which come up.\n\nHere's my go at these.\n\nFrutiger - 'Froot-i-gehr' (ehr = air) pronounced as in German, not French (not 'froot-i-zhay')\n\nDeepdene 'deep - deen'\n\nGaramond - in English 'Gair-uh-mond'; in french?\n\nTschichold 'Chih - chold' first chi as in chick second ch is as in JS Bach. That's German. Alternate for English makes the second ch an english 'sh' chih - shold.\n\nHow am I doing? Please correct.\n\n"
    },
    {
      "time": "",
      "content": "_Yahn Tchick-cold_ is how I've pronounced it.  \n_GAH-ra-mond_ ... hmmm, must be picking up the Boston accent.  \nPahk the cah at Hahvud Yahd, while Castro is still in Cuber.\n\n"
    },
    {
      "time": "",
      "content": "Actually, German pronunciation would also sound the 'd' in Tschichold like at 't', I believe. German and French speakers, we need your help--or those who know for sure, or both.\n\n"
    },
    {
      "time": "",
      "content": "william, you're doing quite well with \"tschichold\". i dont have a micro here, otherwhise i'd record it so you could listen (im swiss, thus having no problem pronouncing swiss names :))\n\n- the fru in frutiger could be pronounced like the beginning of (japanese) \"fujiama\" or something, just with an r in between. frujiama.. :D  \nthen, \"tiger\" isnt pronounced like the animal, but:  \n- the \"t\" like in semanTics (a strong t)  \n- iger probably like \"digger\", but without the double g.. so less strong g..\n\ngaramond in french would be gar like in \"garanty\" but the a like in car, then again an a like in car. in \"mond\", you wont pronounce the \"d\", so probably the mon in \"monthly\" would fit, but stretch the \"on\" ALOT. on probably makes about a third of the length of the whole word when pronouncing..\n\nwhen i finally get a headset for using skype, i will make recordings of all the german and french names in typography (helvetica neue, univers, garamond, frutiger, tschichold, joseph müller-brockmann, etc..).\n\nEDIT: the D in tschichold will SURELY not be pronounced like a t, its a soft ending.\n\n"
    },
    {
      "time": "",
      "content": "Thanks 'kesh'.\n\nOn how to do a non-English 'r' I just say forget about it, as it sounds too foreign in English. (Also the American r is different from the English r, and on top of that the English often drop the r entirely.)\n\nThis raises the whole issue of how accurate to a foreign language you should be in English. For example the English go for an English pronounciation of 'Quixote,' but Americans approximate the Spanish. English make a sort of pathetic stab at the French way of saying 'ant' in restaurant, whereas the Americans end it with an 'ont' as in 'font'.\n\nThanks on the d in Tshichold.\n\n'iger' in Frutiger cannot be like digger in German - or French - because the sound of er in father or digger doesn't exist in either German or French.\n\nOh, and on the ond in Garamond, if French drop the d they must nasalize with the distinctive french 'on', no? --so 'gah - rah - MON', with the nasalized 'on'\n\n"
    },
    {
      "time": "",
      "content": "As always it depends most of all on whose <cite>ear</cite> it is.  \nCommunication is a two-way street, even if one  \nparty is totally silent.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "yeah, the \"on\" is quite nasalized (does this word exist? :))\n\nthe \"iger\"/digger-thing is correct, believe me. swiss german is like very old german in many ways, and when speaking, we use LOTS of ä, ö and ü, and mixed versions of äe and so on - there's no correct way of writing swiss german, thus no correct way of speaking it. but a swiss person would pronounce the \"er\" in frutiger like \"är\" or sometimes \"ör\" (corresponding to their accents of swiss german), as in digger.. (and after all, frutiger is a swiss, so using the swiss pronounciation is more correct than the \"high german\" (thats what we swiss call the \"german german\"))\n\nfor sure this is not exactly the same sound - but its pretty near. i will for sure upload samples of sounds when i get a headset in the next days.\n\n:)\n\n"
    },
    {
      "time": "",
      "content": "\\>whose ear it is\n\nA linguist will be able to be very accurate using the phonetic alphabet. Then what to do in a language without those phonemes and a different rhythmic pattern is a decision.\n\nI guess the best we can do for a 'typowiki' is to say what is wrong, and approximate what it can be in English.\n\nBy the way, listening to Jean Francois Porchez on Type Radio I learned that he pronounces the 'z', which I wouldn't have guessed.\n\n"
    },
    {
      "time": "",
      "content": "as said, i could make recordings, but there would have to be a way to host them on typophile.. im not sure if i would want to host that on my own webspace (uncontrollable traffic, etc..)\n\n"
    },
    {
      "time": "",
      "content": "\\>the “iger”/digger-thing is correct\n\nOh lord, here comes the English/American differences, and now the particular swiss dialect vs high german etc. It looks like there is no end of this.\n\n"
    },
    {
      "time": "",
      "content": "William, I meant that one should accomodate pronunciation depending on the \"target\". For example I will use the French pronunciation of \"Garamond\" when talking to a French person (I mean even when using English) but would not do that with somebody unfamiliar with French, because that would create a distortion (that of snobism, which isn't there in my case) in the communication. Unless I'm trying to intellectually intimidate a non-Frenchie, then the nasal action will come thick and fast! :-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> one should accomodate pronunciation\n\nMakes sense, Hrant. So I guess the question here is what pronounciation to use assuming that the listener doesn't know the native tongue of the person with the foreign name. Evidently, it is some kind of modified version of the foreign pronounciation.\n\n"
    },
    {
      "time": "",
      "content": "Its getting close to Halloween why don't we just summon up the ghosts of the afore mentioned and ask them to pronounce their names as they like them to be called. Any gypsey type types here?\n\n"
    },
    {
      "time": "",
      "content": "There are some slight intonation differences I've heard with pronouncing _Frutiger_ but they are all relatively close.\n\nI had the pleasure of meeting Adrian Frutiger at the banquet held in his honor when he received the TDC Medal in 1987. (I'm trying to recall which Forum members might have been there... maybe Maxim Zhukov, David Berlow, Allan Haley).\n\nMost eveyone there said _FROO-te-gurr_ (close to \"digger\") or _Froo-tee-ghair_ which was closer to what I heard typographers and designer in Switzerland pronounce.\n\n"
    },
    {
      "time": "",
      "content": "As for pronunciation of proper names, I will always try to pronounce it the way person or people who were close to that person would say it. As for people in history, it's really is a guessing game.\n\nWas Beatrice Warde called _BEE-tris_ or _BEE-a-tris_?\n\nI never had the opportunity to meet Herb Lubalin. I had mostly heard it as _\"Loo-BAL-in\"_, but Ed Benguiat would always say _LOOB-a-lynn_... so I still don't know how Herb actually pronounced his name.\n\nFunny though, Ephram Benguiat always answers to _BEN-ghat_ (like \"hat\"). But when we were on a speakers tour of Spain, they knew him well and treated him as a hero -- since in Spain his family name is moreno and is pronounced _Ben-gee-yaht_ (\"gee\" with a hard \"g\").\n\n"
    },
    {
      "time": "",
      "content": "How is Licko (as in Zuzana) pronounced? Bringhurst's book spells her name with accents, but most other sources I've seen, don't. I've been assuming something like \"lits-ko\" but would like confirmation!\n\nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "",
      "content": "It's LITCH-ko, although in native Slovakian the  \ninflection might be on the second syllable, dunno.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I honestly want to know how to say this one, and never have spoken it out loud, but pronounced it as _SK-yold_ in my mind.\n\n[Skjald](http://web.archive.org/web/20120305230833/http:/www.myfonts.com/fonts/agfa/atskjald/)\n\n-----------------------------------------  \nYes, I'm old, but I'm back in skjyle!\n\n"
    },
    {
      "time": "",
      "content": "Thanks Hrant.\n\n"
    },
    {
      "time": "",
      "content": "norbert: normally, as i know it, as this is a nordic name, the a would be pronounced as a like in car, but a bit shorter.\n\nsk-yald\n\nand the l pronounced in a nordic way :) if you know the german word wald ( heres a music file: [http://dict.leo.org/le?14785321](http://web.archive.org/web/20120305230833/http:/dict.leo.org/le?14785321 \"http://dict.leo.org/le?14785321\") , i hope the link works) , the last part, \"ald\", should be pronounced pretty similar.\n\n"
    }
  ]
}
