{
  "id": "15501",
  "title": "Text box height, page layout, point size.",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m working in InDesign, and have a couple of layout questions (maybe newbie-ish).\n\nWe want the baseline of the last line of text on each page to arrive at the same point. We’re doing this visually with a guide on the master text page. We absolutely don’t want to align to grid because we like to squeeze up lines of text. Our leading is 10pt. Does it make sense for me to say that if I want to have 66 lines of type on each page that my text box should be 660 points high? Granted, there are headers which are occasionally 14pt leading, etc, and those pages we’ll have to fiddle with to get the baselines to sit right. But if it’s a page of straight text with 10pt leading throughout, I shouldn’t have to do any adjusting, right?\n\nNow, if I change the “align first line of text” setting so that it aligns on cap height, does this affect my above calculations?\n\nDoes anyone have a good suggestion for getting the top line of text and the bottom line of text to align to the same spot on every page?\n\nNext, How crazy is it for us to be doing what’s called “feathering” (I think) and adjusting leading to 9.8 and 9.7 or 9.65 for whole paragraphs in order to squeeze extra lines onto a page?\n\nThanks everyone,  \nKristina\n\n [‹ Extending a typeface (and the kitchen sink)](http://web.archive.org/web/20080720141710/http:/typophile.com/node/15521 \"Go to previous forum topic\") [looking for angular scripts ›](http://web.archive.org/web/20080720141710/http:/typophile.com/node/15524 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080720141710/http://typophile.com/user/9151\" title=\"View user profile.\">Kristina Drake</a>",
  "time": "<br>",
  "uid": "9151",
  "comments": [
    {
      "time": " 7.Oct.2005 6.44am",
      "content": "Kristina Drake,\n\nif your leading is 10 pt for the body text it should remain 10 pt  \nin my opinion, what you can do is to treat the spacing of the last 2/3  \nlines of the paragraph(s) you need to fit.  \nHaving complex headers, I would suggest to put them in their own box  \nand drag/move only the top part of the body text box.\n\nRegards,  \nAS\n\n"
    },
    {
      "time": " 7.Oct.2005 10.23am",
      "content": "Kristina, if you don’t have paragraph spacing than your calculations are right. for headers you can use a 6pt space before, so the header will take a 2-line space.\n\nI must say that this is not a good way of setting type, but I do not know what your project is.\n\n"
    },
    {
      "time": " 7.Oct.2005 6.11pm",
      "content": "“I must say that this is not a good way of setting type”\n\nWhat is a good way? Is there a normal way and/or procees for setting up a book layout and setting type? (Maybe you could direct me to a resource/link (not Adobe’s website) so I don’t take up too much of your time.)\n\nThe reason I asked is our main text box size (when there’s only one text box per page spanning top to bottom margin) seems randomly chosen. As a result, the text box height was 658.578pts or something like that. And we were spending a ridiculous amount of time trying to get the last line of type to sit at exactly the right point. I thought perhaps changing the text box height to 660pts might make things easier.\n\nYes, the main headers are in separate text boxes, but other subheaders are not.\n\nThe Academic Calendar is roughly 600 pages long. There are several sections of straight text, page layout is fairly complex — Section headers, mast heads, a main body that alternates from full width text to double columns for course descriptions and rules separating subsections. It gets updated every year and we make the updates straight into the ID files.\n\nJust trying to find the best way to set things up — having converted from WP 5.0 last year, we’re not in Kansas anymore...\n\nThanks, I appreciate even the confirmation that this is not the right way to go about it!\n\nKristina\n\n"
    },
    {
      "time": " 8.Oct.2005 1.20am",
      "content": "Kristina, when you say 10pt leading, at what size are you setting the font in?\n\n"
    },
    {
      "time": " 8.Oct.2005 2.04am",
      "content": "The most important thing is the font. What is your font?\n\n"
    },
    {
      "time": " 8.Oct.2005 8.59am",
      "content": "9pt arial narrow. The leading is 10. I know it should be 9/11 or 8/10.  \nYou can see it here:  \n [http://registrar.concordia.ca/calendar/pdf/sec31.pdf](http://web.archive.org/web/20080720141710/http:/registrar.concordia.ca/calendar/pdf/sec31.pdf \"http://registrar.concordia.ca/calendar/pdf/sec31.pdf\")\n\nI don’t think I could get away with upping the leading to 11pt without adding too many extra pages.\n\nHowever, I don’t see how the font size could cause a problem with getting the last line’s baseline to sit at the right place as long as the font size is not greater than the leading. Maybe my understanding of this is completely off?\n\nI’m researching changing the typeface, too, but for this year that’s how it has to stay... (I’d started a different thread elsewhere about that. Hrant gave me a suggestion about typeface, which I’m looking into.)\n\nThanks for your help.  \nK.\n\n"
    },
    {
      "time": " 8.Oct.2005 9.20am",
      "content": "If I understand that the pdf you reference is the project you are discussing, it appears that the reason your bottom line of text fails to align at the exact position on every page is due to the fractional spaces that appear to be used between the rule dividers and paragraphs.\n\nIf these spaces were all the same as the leading of the text (10pt?), than the bottom line of text would have to fall in the exact position page-to-page. Provide there were the same number of lines on each page.\n\nOr am I missing something?\n\n"
    },
    {
      "time": " 8.Oct.2005 10.43am",
      "content": "Kristina, do read Bringhurst’s ’Elements of Typographic Style’, if you haven’t already. It will give you a wealth of ideas. I think you can make this waaay better. (Another useful book is Felici’s ’Complete Manual of Typography.’)\n\nTo start with, the ’all Arial’ is, I’m afraid, a horror to me as it is one of the hardest to read as text. If you did a mix of something like Scala for text and Scala sans for titles it would immediately be 100% better, but there are many, many other choices that would work better than (gag me with a spoon) Arial as text. Also take care that you have enough leading, even if you have to make the body size of the type smaller.\n\nYou say you absolutely don’t want to align to the grid. Well my (non expert) opinion is that you absolutely need to align to the grid. If you have to, you can do a finer grid, so that you have double the number of lines as the body size. That way you can do half (or one and a half) spacing between elements. But then the next half space brings you back to the grid and aligning with a lot of text on the opposite page.\n\nBut whatever you do having a clean alignment is a key making the whole thing look good. In particular, having the facing pages end on different lines looks bad. Having the lines on facing pages align looks better if possible, and means you have less problems of show-through as the lines of type will align back-to-back. In this kind of thing it may not be possible, but having a finer grid that it aligns to will make the whole look better. You can also align the first line of paragraphs to the grid, and keep to the grid that way.\n\nThis kind of work is some of the most typographically demanding there is, and having a good grid and keeping to it is a key to making the whole thing work. Squashing the lines of type vertically in irregular ways just disorients the reader, and makes the catalogue hard to read—and your whole point is to help the reader.\n\nTo be blunt, this is like a ’before’ in a before and after comparison. It is great that you want to work with this. If you absorb the ideas of Bringhurst and get an idea of what different typefaces can do, you will be really delighted with the improvements you can make.\n\n[Ps this should be moved to the ’critique/typography’ section.]\n\n"
    },
    {
      "time": " 8.Oct.2005 3.08pm",
      "content": "William,  \nThat was helpful. I would never have thought of a finer grid. I had assumed it had to match the leading. I will experiment with that on Tuesday. I will also get myself a copy of Bringhurst ASAP.\n\nI hate the arial, too. Believe me, I have to proof the monster, so probably read it more than anyone.\n\nIn my own defense, I’m the assistant editor (with no training in typography) and I inherited this design. The book has looked like this for over 10 years. I’d like it to change, but I work with people who strongly resist any kind of change. You have given me some strong points to back up my case when I approach the other editor and my boss.\n\nTerminaldesign,  \nYes, the spacing around the rules is different. There is fractional leading in the paragraphs because we have squeezed text onto the page and are also adjusting to get the last baseline to a certain (arbitrary) point.\n\nI think William’s suggestion may do the trick.\n\nI’m not sure how I’ll control orphans and widows. But I’ll fiddle first.\n\nThank you, that was very helpful and enlightening. I knew the typography wasn’t good, but I didn’t realize it was that bad... :) That’s ok. (Off to buy a copy of Bringhurst now...)\n\nK.\n\n"
    },
    {
      "time": " 8.Oct.2005 7.27pm",
      "content": "Kristina, you are very gracious. I think it is wonderful that you are sensitive to the issues, and want to have a go at it. All the best.\n\nOne thing that will be very helpful, I would think, is to get a hold of many other similar catalogues and see what you like best. This might help convince the resistant parties also.\n\n"
    }
  ]
}
