{
  "id": "15502",
  "title": "(x) Blackletter in The Knickerbocker Press book (1914) - Psalter Gotisch {David H}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi,\n\nCan anyone help me identify this mystery font. It was used for page headers in a book published by The Knickerbocker Press in 1914. Any help would be greatly appreciated.\n\nRobert\n\n| Attachment | Size |\n| --- | --- |\n| [chapter2.gif](http://web.archive.org/web/20140412135934/http:/typophile.com/files/chapter2.gif) | 27.8 KB |\n\n",
  "author": "hbrand",
  "time": "6 Oct 2005 — 9:23pm",
  "uid": "9596",
  "comments": [
    {
      "time": "2 Aug 2012 — 1:42pm",
      "content": "[Edit]\n\n"
    },
    {
      "time": "7 Oct 2005 — 3:37am",
      "content": "I think Robert is looking for a more precise answer. ;^)\n\nWhere are our blackletter specialists when we need them?\n\n"
    },
    {
      "time": "7 Oct 2005 — 8:41am",
      "content": "yes, exactly...I have been searching Blackletter fonts but haven't had any luck yet. I am republishing an old text and can, of course, use scanned versions, but I'd prefer to utilize the crispness of a font.\n\nThanks again,\n\nRobert\n\n"
    },
    {
      "time": "7 Oct 2005 — 8:43am",
      "content": "No exact match here (which I doubt you'll get nearly a century later), but it appears to be a variation on the old typeface Tudor Text - the only digitization of which I'm aware is [Minim](http://web.archive.org/web/20140412135934/http:/www.moorstation.org/typoasis/designers/lloyd/blackjewels/index.htm) by Paul Lloyd.\n\n"
    },
    {
      "time": "7 Oct 2005 — 8:51am",
      "content": "This is Psalter Text\n\nedit: or Psalter Gotisch. By Benjamin Krebs Nachf (Nachfolger - successors) Frankfurt A.M.\n\n"
    },
    {
      "time": "7 Oct 2005 — 9:09am",
      "content": "Ah. The short showing of Psalter Text in the Solotype Catalog has a single story 'a', but, otherwise, does seem to match up better. I know of no digital version of that typeface, though. Do you, David?\n\n"
    },
    {
      "time": "7 Oct 2005 — 9:13am",
      "content": "Mike, I edited my post. digital? no. yet... and the numerals by Solotype are not the original\n\n"
    },
    {
      "time": "7 Oct 2005 — 1:04pm",
      "content": "I found Psalter Text digitally. See it on the 4th line down on [this page](http://web.archive.org/web/20140412135934/http:/www.romana-hamburg.de/fraktur5.htm) of Gerhard Helzel's extensive collection of Fraktur fonts.\n\nHe seems to be saying there that Mediaeval Gotisch by Flinsch and Psalter Gotisch by Krebs were the same typeface. Does that sound right, David?\n\nI communicated with Herr Helzel not long ago (about the otherwise undigitized [Derby](http://web.archive.org/web/20140412135934/http:/www.romana-hamburg.de/antiqua.htm)). He prefers that the indicated amount in Euros be mailed to him, after which he will e-mail the font(s).\n\n"
    },
    {
      "time": "7 Oct 2005 — 2:17pm",
      "content": "Ah ha. And you can add another name: Tudor Text (that is to say, we're talking about England...Henry VII, Elizabeth I; long time before Psalter Text - 1890)\n\n"
    },
    {
      "time": "7 Oct 2005 — 2:37pm",
      "content": "I see. Thanks for the information.\n\n"
    },
    {
      "time": "7 Oct 2005 — 2:47pm",
      "content": "Great...the Psalter Gotisch seems to be the correct font. Thanks!! Now I need ascertain whether he has a digital version. Hopefully he responds to his email.\n\nGood work guys!!\n\n"
    },
    {
      "time": "7 Oct 2005 — 4:51pm",
      "content": "Robert - everything Herr Helzel shows you is a digital font. He indicates the availability of Mac and PC, Truetype or PS. And, from my own recent experience, he does respond to e-mail (the same day in my case).\n\nI just returned from a trip to the bank to obtain the needed Euros. What beautiful currency!\n\n"
    },
    {
      "time": "11 Oct 2005 — 9:45am",
      "content": "Robert - any digital (and good one)?\n\n"
    },
    {
      "time": "24 Feb 2006 — 10:11am",
      "content": "Excellent!! Thank you all. Psalter Gotisch seems to be the font and I received a Mac version from the German dude! His payment method is a tad strange but fortunately I had a friend there in Europe who could wire him the money.\n\nThanks again,  \nRobert\n\n"
    }
  ]
}
