{
  "id": "15518",
  "title": "Typophile Server Bugs",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Jared Benson](http://web.archive.org/web/20081203130305/http:/www.typophile.com/user/3 \"View user profile.\") : 7.Oct.2005 8.48am \n\nWe have determined the source of the server bugs that have caused our recent downtime. We’re working closely with our host to remedy this for the future. We apologize if you’ve been suffering withdrawal during the last few days. We’ll post an update once an agreement is reached but ask for your understanding while we work some these out.\n\nThanks-\n\nJared\n\n",
  "author": "<a href=\"http://web.archive.org/web/20081203130305/http:/www.typophile.com/user/3\" title=\"View user profile.\">Jared Benson</a>",
  "time": ": 7.Oct.2005 8.48am",
  "uid": "3",
  "comments": [
    {
      "time": " 9.Oct.2005 11.54am",
      "content": "I seem to have problems with access without a reasonable motive. My lon in works good, but I’ve some “access denied” messages all the time.\n\nThanx\n\n"
    },
    {
      "time": " 11.Oct.2005 12.33am",
      "content": "Those “access denied” messages are exactly what’s been caused by those server bugs, Sandro. As Jared said, they’re working on squishing them to oblivion. ;^)\n\n"
    },
    {
      "time": " 21.Oct.2005 8.51am",
      "content": "What topics need to be covered in a first year typography class? How many classes of typography should design students be put through?\n\nI have noticed that a lot of designers who teach typography focus on designing with letterforms and not really explain how to develop more practical things such as designing traffic tickets or math formulae.\n\nShould these kind of projects be included in a beginning type class or should another class be developed to cover things like tables, math, train schedules, and phonebooks?\n\nAt what point should a type student try his hand at designing a typeface?\n\n"
    },
    {
      "time": " 21.Oct.2005 8.58am",
      "content": "\\> _What topics need to be covered in a first year typography class? How many classes of typography should design students be put through?_\n\nMr. Glover, you may have inadvertently posted your question to this topic thread which is “Typophile Server Bugs.”\n\nIf you browse through the various topics on this site, you will notice that your question about teaching typography is of great concern to this community. Please join these discussions as your input is greatly appreciated.\n\n"
    },
    {
      "time": " 21.Oct.2005 9.03am",
      "content": "Thanks! I’m sorry about that!\n\n"
    }
  ]
}
