{
  "id": "15510",
  "title": "Typographic Easter Eggs",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": " **As inspiration back when I was a student, I printed every glyph from** Hoefler Text **at a fairly big size. Looking through them, I discovered the then** Hoefler Type Foundry **logo mirrored in one of the letter slots, as I assumed a wink to previous printing techniques.**\n\nI’m curious if any of You have designed or found hidden logos, licence numbers, messages or any such like in your work or others, subversive or not.\n\nAlso, with OpenType and coding the possibilities of hiding things that suddenly, like a Trojan horse. I don’t know how to code obviously, but imagine if someone wants to write <cite>NELSON MANDELA MUST DIE</cite> and contextual ligatures turns it into <cite>I WANT TO HUG KOALA BEARS</cite>.\n\nAny thoughts?\n\nƒ\n\n [‹ BCA: Birthdate Collection Agency](http://web.archive.org/web/20080519014521/http:/www.typophile.com/node/14372 \"Go to previous forum topic\") [Kerning - difference between optical and metric? ›](http://web.archive.org/web/20080519014521/http:/www.typophile.com/node/20792 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080519014521/http://www.typophile.com/user/7230\" title=\"View user profile.\">fredo</a>",
  "time": "<br>",
  "uid": "7230",
  "comments": [
    {
      "time": " 7.Oct.2005 5.13am",
      "content": "I have not seen any easter eggs in type but I raelly like your contextual alternates idea. What if someone writes “weapons of mass destruction” and it comes out “Bad intel”?\n\nChrisL\n\n"
    },
    {
      "time": " 7.Oct.2005 7.32am",
      "content": "If you are running MacOS X, try setting the word “Zapfino” in Zapfino using TextEdit. It’s most fun if you do it one letter at a time.\n\nI have heard of OT fonts with similar easter eggs. I think Underware’s Bello is one of them, but I don’t have the font and don’t remember what it did.\n\nEdit: Go to the Type Tester on the Underware site ( [http://www.underware.nl/site2/index.php3?id1=bello&id2=testbello](http://web.archive.org/web/20080519014521/http:/www.underware.nl/site2/index.php3?id1=bello&id2=testbello \"http://www.underware.nl/site2/index.php3?id1=bello&id2=testbello\")) and type “Underware”. It’s possible this only works in the Type Tester.\n\n"
    },
    {
      "time": " 7.Oct.2005 7.35am",
      "content": "Also, the Apple logo character is often replaced by something else. Since the Apple logo is trademarked, only Apple is legally entitled to include it. I usually put a picture of an apple there in the style of the font. Some foundries put their logo there.\n\n"
    },
    {
      "time": " 7.Oct.2005 8.31am",
      "content": "i thought it’d be fun to throw easter eggs in OT fonts, but you can’t really hide anything in a glyph pallette... so they wouldn’t be like DVD easter eggs where you hafta stumble upon them or know how to access them. kinda kills the fun of it...\n\n"
    },
    {
      "time": " 7.Oct.2005 9.14am",
      "content": "When I give out beta versions of my fonts I put small markers (not full chars though) to differentiate who got what, just in case I have to do some damage-control detective work...\n\nhhp\n\n"
    },
    {
      "time": " 7.Oct.2005 10.56am",
      "content": "Paul - you’d be surprised how many people still don’t know about the glyph palette. I think it’s hidden enough.\n\n"
    },
    {
      "time": " 7.Oct.2005 1.54pm",
      "content": "Stephen, Adobe makes the glyph pallet very clear in InDesign and Illustrator. I wouldn’t use an Open Type font without referencing the glyph pallet if I was creating a logo.\n\n"
    },
    {
      "time": " 7.Oct.2005 3.03pm",
      "content": "Oh, I wouldn’t either. It’s always open on my workspace. But you and I are more informed than most. I’ve clued in a lot of very bright people about the Glyph Palette who were formerly struggling to find font extras. It’s still a fairly new concept to oldschoolers.\n\n"
    },
    {
      "time": " 9.Oct.2005 1.03pm",
      "content": "fredo,  \nnot sure if you’ve seen my project [TypeTalk fonts](http://web.archive.org/web/20080519014521/http:/www.typetalkfonts.com/typetalk_demo.html)...new fonts coming soon...hopefully...\n\nFrederik de Bleser pointed me to this experimental typeface called [Defontisation](http://web.archive.org/web/20080519014521/http:/lahti.grafitron.com/Dennis) from the Lahti Deisgn workshop in Finland.\n\n"
    },
    {
      "time": " 10.Oct.2005 10.52pm",
      "content": "Could you just break the easter egg up into multiple individually incoherent glyphs which make sense when properly combined via contextual features? (Along with decoys?)\n\n"
    },
    {
      "time": " 11.Oct.2005 8.54am",
      "content": " **Ah, yes, Amy. I’ve seen your project, liked it and spent many a minute on trying to outswear myself. It brings out the most unsettling use of language just to sort of ’crack’ the system.**\n\nƒ\n\n"
    },
    {
      "time": " 11.Oct.2005 11.36am",
      "content": "Amy’s types are great!\n\nThis Larabie font does something similar [http://www.typodermic.com/fonts/51.html](http://web.archive.org/web/20080519014521/http:/www.typodermic.com/fonts/51.html \"http://www.typodermic.com/fonts/51.html\")\n\nTom Phinney posted some source code to the OpenType List that supports this type of font behavior replacing bad words.\n\nI recall seeing an OpenType font by Geraldine Wade c.1996 which replaced animal names with pics of the animals - eg. “unicorn” with a pic of a unicorn. I’m sure there were similar fonts in GX and related technology pre-dating this.\n\nCheers, Si\n\n"
    },
    {
      "time": " 19.Jun.2006 1.03pm",
      "content": "\\> _i thought it’d be fun to throw easter eggs in OT fonts, but you can’t really hide anything in a glyph pallette… so they wouldn’t be like DVD easter eggs where you hafta stumble upon them or know how to access them. kinda kills the fun of it…_\n\nNot if the substitution is many-to-many, something like:  \n`sub r o m a by a m o r;`\n\nBTW, has anyone seen what Lucas hides in his fonts? I have :)\n\n"
    },
    {
      "time": " 19.Jun.2006 5.55pm",
      "content": "No, are they only his OTF fonts? all my Lucas fonts are type 1.\n\nChrisL\n\n"
    },
    {
      "time": " 20.Jun.2006 3.49am",
      "content": "this glyph shipped with Times New Roman at one point in time, I dont think it does anymore :-(\n\n ![](http://web.archive.org/web/20080519014521im_/http:/www.typophile.com/files/egg_4192.PNG)\n\n"
    },
    {
      "time": " 20.Jun.2006 6.52am",
      "content": "For those that don’t know Mike he’s the one on the far right.\n\n"
    }
  ]
}
