{
  "id": "15546",
  "title": "Manuscript Type",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am hoping somebody may be able to help me find a Latin font to be used for reproducing a historical manuscript style.  \nThere are fonts of simular look, which I did considering using such as San Marco and American Uncials but these do not have character sets large enough to include the Latin alphabet, only English characters\n\nI am unsure if this should have been in the type id section or not, but here is an image of what kind of characters I am after. It really needs to include the Latin alphabet to produce something simular but at the same time a well-designed typeface for body copy simular to the picture.\n\nI would also be interested to know if a font exists based off Gothic and old Germanic language text, Seripitio Continua which is when no white spaces were used. I believe Visigothic Bishop Wulfila devised these. And was used in the 4th century in manuscripts like the Codex Argenteus before monks converted the manuscripts to Greek or Latin.\n\nThank you for your assistance  \nKirk\n\n| Attachment | Size |\n| --- | --- |\n| [File](http://web.archive.org/web/20060329191816/http:/typophile.com/files/drupal_63) | 388.25 KB |\n\n",
  "author": "K1RK",
  "time": "9 October, 2005 - 10:10pm",
  "uid": "8606",
  "comments": [
    {
      "time": " 11 October, 2005 - 12:07am",
      "content": "Kirk, American Uncial and San Marco have more than just the glyphs needed for the English language in their character sets.\n\n[Here](http://web.archive.org/web/20060329191816/http:/www.linotype.com/35055672/americanuncialregular-charactermap.html?materialnr=35055672&PHPSESSID=80fd5a5706bf01e0f59fc78b2eb610dc&page=3-1-2) is a link to the character set pages for American Uncial (or at least the Mac PS version… PC PS and PC TrueType versions are also available). Use the drop down menu to get at all of the supplemental Latin glyphs. American Uncial can set all Western European languages, but a CE version is not for sale yet. Are you looking for a CE version? I might be able to direct you in the right direction for that.\n\nDitto San Marco ( [http://www.linotype.com/1439/sanmarco-family.html](http://web.archive.org/web/20060329191816/http:/www.linotype.com/1439/sanmarco-family.html)). San Marco even has DFR (Deutsche Fraktur, with a long-s) versions available, plus a separate Cyrillic font. Are you sure that the glyphs you need aren’t in here? Again, if you are looking for CE, please let me know. I don’t have any links to show, but we could discuss the matter.\n\nI would also be interested to know if a font exists based off Gothic and old Germanic language text, Seripitio Continua which is when no white spaces were used. I believe Visigothic Bishop Wulfila devised these. And was used in the 4th century in manuscripts like the Codex Argenteus before monks converted the manuscripts to Greek or Latin.\n\nI don’t know of any fonts that would meet this exactly. But I’ll go look if you let me know what sort of special glyphs you need.\n\nCheers,  \nDan\n\n"
    }
  ]
}
