{
  "id": "15544",
  "title": "Show and tell - your letterpress collection (or other curiosities)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "As the title says, would be most interested in seeing what priceless collections of old [wood](http://web.archive.org/web/20130218100116/http:/typophile.com/wiki/woodtype) or metal type, or maybe original ink designs, or antique [letterpress](http://web.archive.org/web/20130218100116/http:/typophile.com/wiki/letterpress) posters, presses or whatever everyone has...\n\n(I guess this as well my interest in type generally, is sparked partly by a recent trip to Puglia in Italy - I was surprised to find an old fashioned print workshop seemed to be a standard fixture in every town. I nipped into one (I think in Lecce) and was shown around by the elderly owner who showed me all his letterpress stuff, at first I thought he kept it fo posterity -- but he explained it was all very much still in use for wedding stationery and church festival posters. To be honest he seemed a little bemused by my interest...anyway I digress)\n\nShow us what you've got!\n\n",
  "author": "elliot100",
  "time": "9 Oct 2005 — 4:54pm",
  "uid": "7181",
  "comments": [
    {
      "time": "9 Oct 2005 — 6:00pm",
      "content": "if i had a set of original metal type, i would string the letters of my name together as a necklace and wear it as a typographer bling bling.\n\n"
    },
    {
      "time": "9 Oct 2005 — 6:48pm",
      "content": "eliot100\n\nThere are a good many letterpress folks still in operation, more and more actually, though most of the newer entrys are using the photopolymer plate process.\n\nI still have about four cabinets of medium- to larger-sized metal typefaces for use in broadsides and poster work as well as a very prestine collection of Klingspor's Claudius Fraktur and an extraordinarily large run of Ludwig & Mayer's Dominante (which, as far as I know, has never been digitized).\n\nGerald  \n [http://BielerPress.blogspot.com](http://web.archive.org/web/20130218100116/http:/bielerpress.blogspot.com/ \"http://BielerPress.blogspot.com\")  \n [http://groups.yahoo.com/group/PPLetterpress](http://web.archive.org/web/20130218100116/http:/groups.yahoo.com/group/PPLetterpress \"http://groups.yahoo.com/group/PPLetterpress\")\n\n"
    },
    {
      "time": "10 Oct 2005 — 5:49pm",
      "content": "Hmmm... I've never put together a catalogue of the various type and print samples and paraphenalia stashed in my cave.\n\n- I know I have a small collection of wood types in various sizes of only a few characters.\n- A few metal type specimen books, mostly from type shops in NYC.\n- A factory boxed sort of special characters from ACME Type Foundry, Chicago (a gift from Joffre LeFevre/Aboutype).\n- Several Hamilton California type cases.\n- A broadside and some specimens of Bodoni printed from the type in the Plantin-Moretus Museum, Antwerpen, as well as a few bookplates and maps.\n- Several books from small private presses, including _Gulliver's Travels_, with illustrations and decorations by W.A. Dwiggins, from The Peter Pauper Press.\n\nPlus a whole bunch of other books, specimens, odds & ends basically collecting dust.\n\n"
    },
    {
      "time": "10 Oct 2005 — 6:29pm",
      "content": "After some fifty-odd years of collecting effects for my printshop/foundry I've got more stuff than I can list, but one part of the collection that interest most visitors is the shelf unit holding about sixty suites of Monotype Giant Caster matrices.\n\nThese are what most people in the \"private press\" area of interest would find to be ugly typefaces: Bodoni Bold and Italic, Jefferson Gothic, Onyx, Goudy Handtooled, Brush Script, Valiant, Franklin Gothic etc. Okay, even I think Goudy Handtooled is a little on the homely side.\n\nA few days ago I had another art college class visit. The instructor zeroed in on the Brush Script and fell in love with the mats, showing them to his class. This box of Brush Script contains the rare Th and tt logotypes along with two or three others. The mats are all in the large size range of 42 to 72 point, and are punched aluminum.\n\nI've been wanting to do a sample casting of as many of them as I can to include in a little autobigraphy (ego, ego) I am writing and printing. This seems to me to be a good reason to drag them out and put them on the Super Caster, since they haven't been cast into for many many years.\n\nOne other oddity is a suite of about a dozen engraved brass mats which are large condensed figures: 10, 20, 30, etc. These are engraved in reverse into a checkered background. They look like they were custom engraved for use in horse racing betting slips or something like that. anyone ever seen this kind of thing???\n\nI did have one nifty font of woodtype a few years back; a very odd size of 51 picas. I've never seen such an unusual size before or since. They went on to be donated to an art school some years back. The school dumped the type along with all of the little printshop about four years ago. Dumb buggers.\n\nI've got a box of miscellaneous Giant Caster mats containing a set of figures of Bodoni Black Condensed in 120 point. These were intended to be cast \"sideways\" on the mold of the Giant Caster. They won't fit on the Super Caster so I keep them as a curiosity.\n\nJim\n\n"
    },
    {
      "time": "10 Oct 2005 — 7:55pm",
      "content": "I have just one face, but it's loverly, and not available digitally: Pascal,  \nin 60 (some sorts damaged), 48 (needs cleaning) and 30 (slightly worn).\n\nI also have a very large (12 x 16 inch) photo-  \npolymer printing base, which has yet to used...\n\nhhp\n\n"
    },
    {
      "time": "10 Oct 2005 — 11:00pm",
      "content": "although my personal collection is sparse nowadays, i was head letterpress printer at boxcar press for two years. we had a fair amount of wood and metal type (and had access to all of syracuse university's metal - original goudy stuff).. we printed almost exclusively from polymer, though. all way up to 22 x 30 inch bases on heidelberg cylinder letterpress presses. good times.\n\n"
    },
    {
      "time": "5 Aug 2012 — 8:52am",
      "content": "[Edit]\n\n"
    },
    {
      "time": "11 Oct 2005 — 1:22am",
      "content": "Very interesting!\n\nReally must go to St Brides. Wish I'd seen the conference details in advance, I could be there right now...\n\nAll this physical craft a \\*very\\* long way from the process our printers employ : upload as PDF at 6pm, automated prepress, straight to plate, often out the door at 2am to get to the airport -- I'm in-house at a big financial firm.\n\n"
    },
    {
      "time": "11 Oct 2005 — 2:24am",
      "content": "Elliot,  \nTry the [Type Museum](http://web.archive.org/web/20130218100116/http:/www.typemuseum.org/intro.cfm) in Stockwell, they are based around Monotype but have collections from many, now defunct, foundries, and do demonstrations of punch and matrix making and casting. I was given a souvenir of the Lord's Prayer cast on a pica em block, which they used as a demonstration of their abilities (unfortunately I've never had the opportunity to print from it or take a satisfactory picture).  \nTim\n\n"
    },
    {
      "time": "11 Oct 2005 — 1:41pm",
      "content": "hello everybody!\n\nI'm proud and honoured to say that I own the word 'Bodoni'tided up in a typographer's cord given to me be himself, and also a lowercase 'g' of I believe to be a genuine 36pt Bauer Bodoni metal type specimen, and some others I´ve found, 12pt garamond monotype original (the fake garamond, jannon, we should call it...) and some others of Times 9pt I believe and still a gill sans italic monotype specimen (12pt?). I'd love to have some more.... who knows...  \nUnfortunately I don´t have a camera good enough to take decent pictures to show.... sorry.\n\nIn Portugal there's Printing museum near Oporto, which I advise to take a look. Unfortunately, it's portuguese..... :(  \n [http://www.imultimedia.pt/museuvirtpress/port/frame1.html](http://web.archive.org/web/20130218100116/http:/www.imultimedia.pt/museuvirtpress/port/frame1.html \"http://www.imultimedia.pt/museuvirtpress/port/frame1.html\")\n\n"
    },
    {
      "time": "12 Oct 2005 — 4:05pm",
      "content": "From the type shop at UIC:\n\n[![WoodType2](http://web.archive.org/web/20130218100116im_/http:/static.flickr.com/24/51970372_d1232df147_o.jpg)](http://web.archive.org/web/20130218100116/http:/www.flickr.com/photos/1saac/51970372/ \"Photo Sharing\")\n\n[![Futura](http://web.archive.org/web/20130218100116im_/http:/static.flickr.com/26/51970371_f84ae20d99_o.jpg)](http://web.archive.org/web/20130218100116/http:/www.flickr.com/photos/1saac/51970371/ \"Photo Sharing\")\n\n[![Furniture](http://web.archive.org/web/20130218100116im_/http:/static.flickr.com/29/51970370_e8512cabc6_o.jpg)](http://web.archive.org/web/20130218100116/http:/www.flickr.com/photos/1saac/51970370/ \"Photo Sharing\")\n\n[![WoodType](http://web.archive.org/web/20130218100116im_/http:/static.flickr.com/30/51970369_b3fa0883e7_o.jpg)](http://web.archive.org/web/20130218100116/http:/www.flickr.com/photos/1saac/51970369/ \"Photo Sharing\")\n\n[![CooperNs](http://web.archive.org/web/20130218100116im_/http:/static.flickr.com/24/51970368_b3ea09d53a_o.jpg)](http://web.archive.org/web/20130218100116/http:/www.flickr.com/photos/1saac/51970368/ \"Photo Sharing\")\n\n[![MU0008](http://web.archive.org/web/20130218100116im_/http:/static.flickr.com/21/25726859_6990b621e1.jpg)](http://web.archive.org/web/20130218100116/http:/www.flickr.com/photos/1saac/25726859/ \"Photo Sharing\")\n\n[![MU0007](http://web.archive.org/web/20130218100116im_/http:/static.flickr.com/21/25726858_1525d52175.jpg)](http://web.archive.org/web/20130218100116/http:/www.flickr.com/photos/1saac/25726858/ \"Photo Sharing\")\n\n"
    },
    {
      "time": "12 Oct 2005 — 4:08pm",
      "content": "Oops, not used to the \"new\" Typophile. I guess just go to my flickr page to see the type pics. The stuff in the set titled Mu Meson was done with some rickety old wood type and some background patterns that were revealed to me after there was a flood under the sink.\n\n[http://www.flickr.com/photos/1saac/](http://web.archive.org/web/20130218100116/http:/www.flickr.com/photos/1saac/ \"http://www.flickr.com/photos/1saac/\")\n\n"
    },
    {
      "time": "18 Sep 2006 — 8:02am",
      "content": " ![](http://web.archive.org/web/20130218100116im_/http:/typophile.com/files/1_6420.jpg)\n\nI want to send a warm welcome to everyone loving letterpress and who is interested to visit my \"Preußisches Bleisatz-Magazin\" virtually found at [http://www.bleisetzer.de](http://web.archive.org/web/20130218100116/http:/www.bleisetzer.de/ \"http://www.bleisetzer.de\")\n\nBest wishes to all the letterpress friends worldwide.\n\nGeorg\n\n"
    },
    {
      "time": "23 Oct 2006 — 7:31am",
      "content": "Just for fun.\n\n ![](http://web.archive.org/web/20130218100116im_/http:/typophile.com/files/1_5875.jpg)\n\n"
    },
    {
      "time": "23 Oct 2006 — 8:40am",
      "content": "Excuse the lousy pic - I just bought this yesterday. It's not metal type exactly - for one thing the letters are etched rather than raised and for another, they read right, not reverse, but I thought they were great. There are 2 each of the lowercase, no caps.\n\nIf anybody has any thoughts about what these might have been used for I'd be interested...\n\n ![](http://web.archive.org/web/20130218100116im_/http:/typophile.com/files/type_3469.jpg)\n\n"
    },
    {
      "time": "23 Oct 2006 — 8:46am",
      "content": "Maybe doing rubbings with paper over them?\n\nhhp\n\n"
    },
    {
      "time": "23 Oct 2006 — 9:12am",
      "content": "You mean frottage? (a word which has a delightful 'other' meaning as well)\n\n"
    },
    {
      "time": "23 Oct 2006 — 9:20am",
      "content": "I was only aware of the delightful meaning;)\n\nMaybe they are to help schoolchildren with forming their letters, using a stylus to follow the channels, I notice that many characters have high and low joining strokes.  \nTim\n\n"
    },
    {
      "time": "23 Oct 2006 — 9:22am",
      "content": "Wild guess but given the constant, indented line and right-reading, was wondering if they were guides to be traced with a pantograph, maybe to drive some sort of engraving tool?\n\n"
    },
    {
      "time": "23 Oct 2006 — 9:32am",
      "content": "Je frotte avec l'alphabet - mais pourquoi pas!\n\nI think Elliot has it.\n\nhhp\n\n"
    },
    {
      "time": "23 Oct 2006 — 9:45am",
      "content": "Good thinking Elliot, what size are the characters Patty?  \nTim\n\n"
    },
    {
      "time": "23 Oct 2006 — 10:19am",
      "content": "The x-height is 3/4\"; the f (the tallest character) is about 3\".\n\nI noticed the double joining strokes too - which lends more credence to Elliot's idea.\n\nI think they are lead - to be safe I'm washing my hands after I touch them.\n\n"
    }
  ]
}
