{
  "id": "15555",
  "title": "Walker Art Center's New Graphic Identity",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "What is everybodys view on the WAC identity:\n\n[http://www.processtypefoundry.com/about/press\\_walker.html](http://web.archive.org/web/20060209094123/http:/www.processtypefoundry.com/about/press_walker.html)\n\nVery brave indeed, looking forward to seeing it applied to exhibition posters. Not sure how flexible its actually going to be.\n\n",
  "author": "marc",
  "time": "11 October, 2005 - 5:22am",
  "uid": "5925",
  "comments": [
    {
      "time": " 11 October, 2005 - 8:31am",
      "content": "Nice to see that they worked with local talent! I suppose they stretched the original type system as far as they could and wanted a new direction.\n\n"
    },
    {
      "time": " 11 October, 2005 - 8:54am",
      "content": "Go Eric!\n\nBTW, all these years of talking up the Walker face (and it deserves it) but I never knew it wasn’t actually used much to its intended extent. I had to hear it from an article on the internet.\n\nhhp\n\n"
    },
    {
      "time": " 11 October, 2005 - 12:56pm",
      "content": "Can you point me in the direction of any relevent discussion. I’m writing about gallery identities at the moment.\n\nCheers\n\n"
    },
    {
      "time": " 11 October, 2005 - 1:18pm",
      "content": "Interesting post on [Be A Design Group](http://web.archive.org/web/20060209094123/http:/www.beadesigngroup.com/blog/archives/2005/09/minneapoliss_walker_art_center_1.html)…\n\n"
    },
    {
      "time": " 11 October, 2005 - 1:31pm",
      "content": "The original Walker font is used mainly as a logo these days, which as I’ve noted before, is too bad because the font is great - even just as a straight ahead sans without the add-ons.\n\n\\> wasn’t actually used much to its intended extent  \nThis is pretty fair. During the mid to late 90s the font got a major workout and was often used in very elaborate ways - sometimes all serif styles used at once etc. Tastes change though. Eventually the font was used mostly as a stripped down sans for internal museum publications and the monthly calendar. Since the designers work with individual curators or directors of programs, the idea of a one size fits all font grew a little thin. Modern dance events soon looked just like film events and on down. So the font was only shortly used for everything and maybe never completely. It’s hard to say, the output from the studio is pretty amazing so tracking it is next to impossible.\n\nAll that said, the Walker font is still around, just not as loudly. As for the new one, I just engineered it. The design is not mine.\n\n"
    },
    {
      "time": " 11 October, 2005 - 1:36pm",
      "content": "And one more time, the design and identity is not mine - though the link above would imply otherwise.\n\n"
    }
  ]
}
