{
  "id": "15556",
  "title": "ITC Avant Garde Gothic Pro Release",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Remember this thread back in August about Avant Garde ligatures? [http://typophile.com/node/14530](http://web.archive.org/web/20131013230134/http:/typophile.com/node/14530 \"http://typophile.com/node/14530\")\n\nITC have just released ITC Avant Garde Gothic Pro which appears to contain lots of ligatures. Not sure if its comprehensive but have a look at this pdf:\n\n[http://www.itcfonts.com/fonts/pdfs/AGPro.pdf](http://web.archive.org/web/20131013230134/http:/www.itcfonts.com/fonts/pdfs/AGPro.pdf \"http://www.itcfonts.com/fonts/pdfs/AGPro.pdf\")\n\n",
  "author": "Nick Job",
  "time": "11 Oct 2005 — 5:58am",
  "uid": "8008",
  "comments": [
    {
      "time": "11 Oct 2005 — 7:17am",
      "content": "Yes, but you also need to look at Mark Simonson's article [_Ain’t What ITC Used to Be_](http://web.archive.org/web/20131013230134/http:/typographi.com/001029.php) posted at Typographica's Forum before you go running off to buy the fonts.\n\n"
    },
    {
      "time": "11 Oct 2005 — 12:46pm",
      "content": "I'm sure ITC will provide a free replacement italic once they make one, so is there any reason to boycott the product? ;-)\n\nHas anyone contacted Allan about it?\n\nCheers, Si\n\n"
    },
    {
      "time": "11 Oct 2005 — 1:13pm",
      "content": "\\> _I’m sure ITC will provide a free replacement italic once they make one_\n\nI expect to see Allan Haley tonight and will ask him about the slant vs. true oblique cut issue. It just might be that all of the advertising and specimen samples are incorrect and that the fonts are just fine.\n\nEither way, it's a little issue of quality assurance and customer expectations. I used to work for the very same person Allan reports to now.\n\n"
    },
    {
      "time": "11 Oct 2005 — 1:20pm",
      "content": "Great, I hope it goes well.\n\nCheers, Si\n\n"
    },
    {
      "time": "11 Oct 2005 — 8:30pm",
      "content": "I'm back from my meeting with next year's TypeCon planning committee with Tamye Riggs and Allan Haley.\n\nI had the chance to take Allan aside and show him the posts on ITC Avant Garde Gothic found on Typographica's forum.\n\nAllan said that Monotype Imaging had discussed the oblique versions for a long time, and in the end, it came down to two main considerations:\n\n1- They felt that the Adobe versions of AGG Oblique had become the _de facto_ standard, thus the Pro version would be consistent; and\n\n2- Developmental expenses.\n\nOK, that's fair enough. How many designers are still setting with digitized versions of the 1977 release. But why did Adobe decide on slanted versions in the first place? Any insights anybody?\n\n(BTW -- Allan's comments to me was his sincere explanation of reasons for corporate decisions and should not be considered as an \"official statement\" by Monotype Imaging on the issue.)\n\n"
    },
    {
      "time": "11 Oct 2005 — 9:11pm",
      "content": "That's roughly what I suspected. That they deliberately _didn't_ use the original oblique is interesting, but disappointing.\n\nAs far as the part about Adobe using a slanted version to begin with, that was their standard method in the early days with all sans serifs. No doubt it saved memory in the early PostScript laser printers and imagesetters and was considered a neat and practical compromise.\n\nOn the other hand, it is ITC's design. Why should they follow Adobe's lead on what it should look like? Like I said in my Typographica post, ain't what ITC used to be.\n\n"
    },
    {
      "time": "12 Oct 2005 — 10:02am",
      "content": "I guess we should remember that Adobe set the naming convention rules here for re-issues.\n\nOn the one hand part of the reason for adding 'std' and 'pro' to font names was to reinforce the \"no guarantee of backwards compatibility\" message - so ITC could have broken with the past on a pro font.\n\nHowever in reality the re-issued Adobe fonts are mostly mergings of the existing Type 1 fonts with only a few extensions. So ITC's treatment of AG really isn't any different from the Adobe re-issues.\n\nFortunately Adobe has extended the rules of the game with Garamond Premier Pro, which leaves the door open for a \"Premier Pro AG\" at some point in the future. :-)\n\n"
    },
    {
      "time": "12 Oct 2005 — 11:09am",
      "content": "_Fortunately Adobe has extended the rules of the game with Garamond Premier Pro, which leaves the door open for a “Premier Pro AG” at some point in the future. :-)_\n\nWell, never mind then. :-)\n\n"
    },
    {
      "time": "12 Oct 2005 — 12:53pm",
      "content": "Be careful when you say \"AG\", some lawyers in Chicago may think you are infringing on a copyrighted name:-)\n\nChrisL\n\n"
    },
    {
      "time": "12 Oct 2005 — 4:12pm",
      "content": "You're right. My careless abreviation was a clear mistake, an akzidenz wating to happen, if you will ;-)\n\n"
    },
    {
      "time": "13 Oct 2005 — 5:33am",
      "content": "That was a grotesk way to put it Si.  \n:-)\n\nChrisL\n\n"
    },
    {
      "time": "15 Oct 2005 — 4:02pm",
      "content": "Just noticed a nice set of images attached to the Slanted.de thread on Avant Garde - [http://www.slanted.de/573#comments](http://web.archive.org/web/20131013230134/http:/www.slanted.de/573#comments \"http://www.slanted.de/573#comments\") - the school bus instructions are particularly nice. Si\n\n"
    },
    {
      "time": "22 Oct 2005 — 1:47pm",
      "content": "Mark wrote:\n\n\"As far as the part about Adobe using a slanted version to begin with, that was their standard method in the early days with all sans serifs. No doubt it saved memory in the early PostScript laser printers and imagesetters and was considered a neat and practical compromise.\"\n\nThis is absolutely dead on. Remember, ITC Avant Garde was one of the original 35 PostScript Type 1 fonts.\n\nSi wrote:\n\n\"On the one hand part of the reason for adding ‘std’ and ‘pro’ to font names was to reinforce the “no guarantee of backwards compatibility” message - so ITC could have broken with the past on a pro font.\"\n\nVery true.\n\n\"However in reality the re-issued Adobe fonts are mostly mergings of the existing Type 1 fonts with only a few extensions. So ITC’s treatment of AG really isn’t any different from the Adobe re-issues.\"\n\nIf you look at the entire Adobe Type Library, this is true. But every typeface with \"Pro\" in the name had its character set extended. And if you look at Adobe Originals, most of them got reworked, many of them extensively. Notably for this discussion, Cronos Pro got the italic completely redone. Adobe Garamond, Minion, Myriad and many others got some revisions. We treated our real flagship typefaces with great care.\n\nAmusingly, our OpenType \"Standard\" version of ITC Avant Garde is based on the Avant Garde MM outlines, rather than the single-master outlines. So we were already not worrying about matching the old one that most people know.\n\nThat being said, these things are a lot of work, and as digital type users were already used to the mechanically slanted obliques for ITC Avant Garde (which Adobe popularized), I can understand why ITC/Monotype didn't want to spend the substantial work to redraw them.\n\nSi also wrote:\n\n\"Fortunately Adobe has extended the rules of the game with Garamond Premier Pro, which leaves the door open for a “Premier Pro AG” at some point in the future. :-)\"\n\nHuh? Please understand that Garamond Premier Pro has exactly three things in common with Adobe Garamond: it's a Robert Slimbach design, a revival of Garamont's romans and Granjon's italics, and it's an Adobe Original. But it is a completely different design, and otherwise unrelated to Adobe Garamond - not an updated version of it in any way.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "22 Oct 2005 — 1:58pm",
      "content": "\"...But it is a completely different design, and otherwise unrelated to Adobe Garamond\"\n\nand quite a good one.\n\nChrisL\n\n"
    },
    {
      "time": "22 Oct 2005 — 5:01pm",
      "content": "In my humble opinion, ITC shouldn't have been so shy. With OT they could've offered both oblique and italic. I will wait for Veronika (E+F) to add more goodies to their version and upgrade. :^P\n\n"
    },
    {
      "time": "22 Oct 2005 — 5:23pm",
      "content": "My tongue-in-cheek point about Garamond Premier Pro was that Adobe has set a new standard, above Pro. I don't seriously expect people to start taking the word \"Premier\" and tagging \\> Pro designs with it, but you never know. This could get like credit cards, how about..\n\nHelvetica Platinum  \nGaramond Titanium Titling Pro  \nPalatino Plutonium Pro Plus\n\nCheers, Si\n\n"
    },
    {
      "time": "26 Oct 2005 — 3:30am",
      "content": "Avant Garde Gothic Extra Premiere Pro Ultimate 2005 Deluxe Edition  \n(Sans True Italics)\n\n"
    }
  ]
}
