{
  "id": "15564",
  "title": "Jackie Blue",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hey there everyone,  \nI’m finishing up this identity piece and figured I’d ask for some feedback. I’m pretty happy with where I am with it, but opinions can always help push the design. The logo is for a restaurant/deli/wine bar that is more than casual and less than fine. It’s sort of in the middle for 25-55 year-olds who like fabulous food and even better wine. So, what do you think?\n\n| Attachment | Size |\n| --- | --- |\n| [JBR-Logo.gif](http://web.archive.org/web/20060522104828/http:/typophile.com/files/JBR-Logo.gif) | 4.08 KB |\n\n",
  "author": "<a href=\"user/7395\" title=\"View user profile.\">vigorgraphics</a>",
  "time": "<br>",
  "uid": "7395",
  "comments": [
    {
      "time": " 11 October, 2005 - 11:28am",
      "content": "I like it but It doesn’t all quite tie together as a unit for me yet. It feels like the elements might float away independently at any moment… That’s my 1st reaction.\n\n"
    },
    {
      "time": " 11 October, 2005 - 11:50am",
      "content": "I like very the visual idea and the wine glass. It must be very seldom green wine that will be drinked at your bar. :o) I miss space between two words a bit. And I would do smaller space between “l” and “u” of Blue. And I think the wine glass must have wider foot without topple down even the wine is pushed like in your illustration. Top glass area could be drawn bigger, because you lose details at  \nsmall resolution.  \nThe line under Jackie Blue is another story. I miss right orientation to the big line. “BAR” must be directed to “e” or it is unclean, “MODERN” to left site of “a”. I think such wide spacing troebles reading especially setted in capital letter and more than 2 words. Less spacing but bigger font would do more sense, because it  \nproduces good contrast in combination with top line.\n\n"
    },
    {
      "time": " 11 October, 2005 - 12:26pm",
      "content": "I really like the illustration itself, but, I think the wine glass might make it read ‘JackYe Blue’ rather than ‘Jackie Blue’.. _( Another thing thats currently not really working, for me, may be the ‘J’ and the ‘B’, which seem odd, or maybe just out of place.. )_\n\nDav, [formlos](http://web.archive.org/web/20060522104828/http:/www.formlos.net/)\n\n"
    },
    {
      "time": " 11 October, 2005 - 12:39pm",
      "content": "Yea, like Dav says “JackYe Blue” I find your other work in portfolio goes the same way: mark arrison, that have strong tendence to be readed as “mark oarrison”. I understand, that it`s a shame to loose so nice visual idea, but clearness is first.  \nOk, I shut up with my “K” :o)\n\n"
    },
    {
      "time": " 11 October, 2005 - 1:35pm",
      "content": "The B in Blue seems heaver that the J in Jacky I know its probably the font but you might add a .125 stroke to the J. The spacing in the L U in Blue isn’t right, its floating. The tagline is lost. Its very weak visually and its weak copy wise. A Deli here is where you buy a bagel, nothing upscale or modern. The words Modern and American are throw aways and not needed.\n\nMy last rant is why is every logo letterspaced? Can’t a logo be designed with type without it floating all over the place?\n\n"
    },
    {
      "time": " 12 October, 2005 - 12:08am",
      "content": "First impression: I really like the logo - my reservation is the large ‘B’ of ‘Blue’, it breaks things up a bit, forcing the strapline too far away from ‘Jackie Blue’. Why not keep the ‘b’ the same weight & size as the rest of the title? I was grabbed by the wine glass, It’s appealing, but maybe a deep red would be a better choice of colour. Also, my first impresssion was to read the glass as an ‘i’, so I didn’t mind that aspect of it. I would darken up the strapline a bit also, it might get lost quite easily.\n\nIt looks classy - in my opinion, the only time you see wine swirled around like it’s done in your logo is when connoisseurs are having a sniff of it!\n\nDan - I think it’s just you! I like the letterspacing, I like the way it brings the logo together as a unit. There’s enough fluidity in the illustration, the type tightens the logo up nicely.\n\nSi\n\n"
    },
    {
      "time": " 12 October, 2005 - 11:57am",
      "content": "This is an odd way of putting this but - How masculine do you want this to be? Looking again I find that it feels maybe too femme. Like a soap or powder. If you thicken the verticals on the name I think that floaty feeling will go away & the name will start to feel more even. I know you have modeled the thickness of the verticals on the wine glass - but maybe print one out & take a pencil to it & see if you like it. I don’t care about the tag line saying deli. People are willing to suspend disbelief for a restaurant… The tag does seem a little light & hard to read. Do you really need it?\n\n"
    },
    {
      "time": " 12 October, 2005 - 6:12pm",
      "content": "Let me apologize about the tagline. I didn’t mean to have that on there. Not my words, not my idea, but they’re married to it. You know how it goes.\n\nThank you all very much for the comments and suggestions. I took a lot of them into consideration. I also ran it by some people in their target audience.\n\nI need to let you all know about the area I’m dealing with so you can see how this logo fits into the general scheme of things. The area is a small city with a 4 block long restaurant row. The restaurants are okay, but always packed. Some of the places are cool during the week. The weekends are hell though. They’re full of horny old guys trying to pick up girls half their age. Testosterone is never in shortage here.\n\nThe main goal of this restaurant is to be modern, stylish, refined but approachable. The food is going to be amazing and not pricey. They want to accentuate taste and quality. They also want to stand out from the norm.\n\nThe logoscape here is full of cheesy, redundancies. A lot of red and orange. A lot of royal blue. These colors are very new and really say what needs to be said.\n\nFor the type…They insisted on a sans-serif. I moved forward with the Berthhold Akzindenz Grotesk as my basis because of its modern qualities. It also has an uppity feel because of the tall letterforms.\n\nI did decide to close up some of the space. I worked the letterforms a bit more to be better kerned and consistent. The wine glass I reworked a bit as well to make sure it was an “I” form more than a “Y” form. I think this is a step in the right direction.\n\nYou can see the changes here:  \n [http://www.vigorgraphics.net/clients/JBR-LogoPMS.gif](http://web.archive.org/web/20060522104828/http:/www.vigorgraphics.net/clients/JBR-LogoPMS.gif)\n\nI did find out today that they may want to move away from the wine glass completely. I’m a bit disheartened, but hopefully I can sell the design on them during the next meeting.\n\nIn the meantime, more comments?\n\nJoseph Szala  \nVigor Graphic Design, LLC.  \n [www.vigorgraphics.net](http://web.archive.org/web/20060522104828/http:/www.vigorgraphics.net/)\n\n"
    },
    {
      "time": " 12 October, 2005 - 7:00pm",
      "content": "It seems tighter & better to me. BTW - What does the color say? ‘Not what you expect’ or something like that? If so I could live with it maybe. It is pretty provocative. I do wonder what vibe they want to send. It might be they don’t want to be a wine bar… That would be a good reason to loose the glass. Remember the design is in service to the restaurant - not the other way round.\n\n"
    },
    {
      "time": " 13 October, 2005 - 1:35am",
      "content": "It`s better. The foot of glass is 3D, but top area 2D? I would prefer whole 2D or 3D must be visible and not a bit. After that it`s look unstable at such small foot and with long shaft. After that I would take it to the visual line with “B”. If you won`t have red wine, what about with.. “blue curacao” [rus: blja horosho!] instead of “green mile”? :o) It would speak best with logo message.\n\n"
    },
    {
      "time": " 13 October, 2005 - 5:41am",
      "content": "You still have a problem with the L U spacing. The L by its nature creates a visual hole. Move the UE a touch to the left.\n\nI can understand they might not want to emphsise the wine bar with a visual, but thats where they will make most of their profit. Bars here don’t make any money on their food. It could be an argument to keep your wine glass graphic.\n\n"
    },
    {
      "time": " 13 October, 2005 - 7:46am",
      "content": "Good news! They loved it!\n\nI’m going to work on the 2D/3D thing. That’s a great point. I will also work with the LU too. Great direction and suggestions all of you. Thank you so much.\n\nJoseph Szala  \nVigor Graphic Design, LLC.  \n [www.vigorgraphics.net](http://web.archive.org/web/20060522104828/http:/www.vigorgraphics.net/)\n\n"
    }
  ]
}
