{
  "id": "15570",
  "title": "Consist",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "Trying to pack big font nuance into a teenie-tiny footprint—using grays, of course. A lot of these characters wouldn't work for me at this size, using traditional pixel building techniques.\n\nThe grays, however, allow me to put together a character set that looks more sophisticated than usual. Perhaps not 'book' sophisticated, but at least headed in that direction.\n\nI don't think I used very many grays. Either five, or six, I think.\n\nAny thoughts? Does the UC Y raise anyone's hackles? I was having trouble with it, so I borrowed from the UC J.\n\n| Attachment | Size |\n| --- | --- |\n| [consist.gif](http://web.archive.org/web/20150123233912/http:/typophile.com/files/consist.gif) | 1.45 KB |\n| [consist-complete.gif](http://web.archive.org/web/20150123233912/http:/typophile.com/files/consist-complete.gif) | 3.7 KB |\n| [consist-complete-r1.gif](http://web.archive.org/web/20150123233912/http:/typophile.com/files/consist-complete-r1.gif) | 3.7 KB |\n| [consist-complete-r2.gif](http://web.archive.org/web/20150123233912/http:/typophile.com/files/consist-complete-r2.gif) | 6.76 KB |\n| [consistFamily.png](http://web.archive.org/web/20150123233912/http:/typophile.com/files/consistFamily.png) | 10.86 KB |\n\n",
  "author": "tyleryoung",
  "time": "11 Oct 2005 — 4:50pm",
  "uid": "2139",
  "comments": [
    {
      "time": "11 Oct 2005 — 6:32pm",
      "content": "Looks good to me!\n\nChrisL\n\n"
    },
    {
      "time": "11 Oct 2005 — 8:27pm",
      "content": "Never one to pass up the chance to make things smaller, I've tweaked the original set, and gained a 5px verion and a smallcaps version. Plus I tweaked the lc w to match the UC W.\n\n"
    },
    {
      "time": "12 Oct 2005 — 12:40am",
      "content": "A few more tweaks to the w's and v's in the 5px version.\n\n"
    },
    {
      "time": "13 Oct 2005 — 8:42pm",
      "content": "Added a bold version to all three...\n\nChris, thanks for stepping up to the plate and offering me some feedback!\n\nTyler\n\n"
    },
    {
      "time": "13 Oct 2005 — 8:54pm",
      "content": "I like it a lot, it reminds me of futura which I also like a lot. What would be the use of sucha small screen face?\n\nHéctor\n\n"
    },
    {
      "time": "13 Oct 2005 — 11:33pm",
      "content": "Yah, I guess it does look a lot like Futura. The reality is, I began this set from experimenting with the diagonals in the UC M. Then came the rest of the set. The thing is, with grays, it's more difficult keep from infringing on other pixel designers' work, because a lot of character set variations over the years (in the pixel font world) came from the creative ways different designers would represent curvature and diagonals.\n\nThe short of it is, the letters were defined by the pixels you left out, as much as they were by the pixels you put in.\n\nNow, everything is different in the grayscape. Building small characters actually fills in all of the traditional 'holes' that designers used in the past. Further, the 'nuance' of how a designer might use grays, or the patterns of grays, to build a character's features, are much more subtle at a glance than before.\n\nSo, the reason this font ended up looking like Futura, was that I had several cool-looking characters that I wanted to build a font out of, but wanted to avoid 'aping' other designer's character sets. In this particular case, I was really trying to distance myself from Susan Kare's work. At this pixel size, her work is really definative. There are other designers, like Craig Kroeger, who have some pretty amazing character sets too, and I wanted to stay away from all of them the best I could.\n\nSo, I really focused on character widths and the shaping of the tiny curves with different grays, all while trying to create a set that had some of the more classic proportions found in traditional typography.\n\nA good example of this kind of classic look in a pixel font, in my opinion, is Quadratis, by Miguel Hernandez.\n\nAs for the purpose of such a small font: why, it may be used anywhere stylish typography is valued. As accent text on websites; see speakup. As navigation buttons and widgets; see slideshow pro. As small titles and subtitles on blog entries; see shaun inman. And of course, as small, sophisticated typefaces in hand-held devices and cell phones.\n\nThanks for your comments, Héctor. I really appreciate it.\n\nTyler\n\n"
    },
    {
      "time": "28 Oct 2005 — 12:29pm",
      "content": "I have a soft spot for this feeling in type too. In some ways the M feels a little overblown but that could be character too. It does seem to stand out especially much because it looks like it is more generously spaced than the other glyphs. But I like it!\n\n"
    },
    {
      "time": "14 Dec 2005 — 3:25pm",
      "content": "Here is the finished font family, all built in FL, rather than mocks in PS.\n\nSee the 'consistFamily' file at the end of the attachment list above.\n\n-tyler\n\n"
    },
    {
      "time": "14 Dec 2005 — 4:40pm",
      "content": "It's amazing. Congradulations. If so I wonder if it might not be a good idea to add one more larger size too. I know micro is the reason you made it - but think of the enhanced uses! Cheers.\n\n"
    },
    {
      "time": "14 Dec 2005 — 4:55pm",
      "content": "I second Eben's request for a couple of larger sizes.\n\nChrisL\n\n"
    },
    {
      "time": "15 Dec 2005 — 1:57am",
      "content": "Yah, I agree that a few larger sizes would be fun to make. Especially the one-pixel-wide designs. The larger the point-size and the thinner the pixel font, the more unique the style.\n\nWe all have Mr. Hernandez to thank for that design lesson, in my opinion.\n\nThanks for your support guys, I really appreciate it.\n\n-teewhy\n\n"
    }
  ]
}
