{
  "id": "15575",
  "title": "Cimex Bold",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "My employer recently got themselves a new logo ( [gif here](http://web.archive.org/web/20150415062429/http:/www.cimex.com/images/logo.gif)) and while I had no input on that (it was designed before my time here), I've been asked to design a companion display face -- for use in the company magazine etc.\n\nMy first draft is attached, I'm not sure about:\n\n- The '2' -- mainly the bowl at the top.\n- The 's' -- apart from the fact that it looks as though it's falling backwards, I can't bring myself to make it wholly geometric (and thus very thin), but it looks flattened otherwise. Any suggestions?\n\nAny comments on these glyphs, or anything else about the face, would be most appreciated everybody.\n\nThanks.\n\n| Attachment | Size |\n| --- | --- |\n| [cimexbold\\_version1.pdf](http://web.archive.org/web/20150415062429/http:/typophile.com/files/cimexbold_version1.pdf) | 7.84 KB |\n\n",
  "author": "Jordan Harper",
  "time": "12 Oct 2005 — 4:02am",
  "uid": "2278",
  "comments": [
    {
      "time": "15 Oct 2005 — 1:45am",
      "content": "I may sound _( too )_ harsh again, but what about just 'slightly' customizing _( a, b, g, m, n, q, r, y )_ 'Century Gothic' instead of building a 'new' custom typeface, from scratch.? :) _( Because the logo itself sure could be based on 'Century Gothic'.. )_\n\nOtherwise I may add that I quite like it, but it still looks a bit uneven.. _( Especially where the curves 'meet' the stems.. And you are right about the 's', it may seem too narrow and it doesnt really fit in there.. )_\n\nDav, [formlos](http://web.archive.org/web/20150415062429/http:/www.formlos.net/)\n\n"
    },
    {
      "time": "17 Oct 2005 — 2:41am",
      "content": "Thanks for the reply Dav (and 'too harsh' should not be in the vocabularly of a critic!).\n\nWhy not just customise a cut of CG? Well, aside from the dubious ethics ;), mainly because I didn't want to just build a customised century gothic. I even forced myself to not look at any samples of it while designing this :)\n\nI wanted to create something with a _little_ originality (and I think a number of letterforms in cimex bold -- including those you mentioned and more -- are distinct enough from CG to make this more than just a customised version of it). In addition, I'm also building a cursive (with no oblique-ing) version that I think will definitely add something unique.\n\n---\n\nI've never been entirely sure (on a technical level) what the best way of sorting out the curve--\\>straight transition in a geometric typeface is. Any pointers would be most appreciated.\n\nAnd I'm still totally stumped about how to handle a geometric 's' without making it absurdly thin or too flat. I'm at the point of thinking of going for something completely radical, like a descender ...\n\n"
    },
    {
      "time": "17 Oct 2005 — 2:46am",
      "content": "_Hmm.._ I am not sure about the 'dubious ethics', but if the typeface itself is \\* just \\* a corporate one, and not ment for ( re ) sale.?\n\nDav, [formlos](http://web.archive.org/web/20150415062429/http:/www.formlos.net/)\n\n"
    },
    {
      "time": "21 Oct 2005 — 12:57pm",
      "content": "I think Leslie Cabarga's book \"The Logo, Font and Lettering Bible\" may answer some of your questions...\n\n[http://www.amazon.com/exec/obidos/tg/detail/-/1581804369/qid=1129924757/...](http://web.archive.org/web/20150415062429/http:/www.amazon.com/exec/obidos/tg/detail/-/1581804369/qid=1129924757/sr=8-1/ref=pd_bbs_1/104-9001472-0247917?v=glance&s=books&n=507846 \"http://www.amazon.com/exec/obidos/tg/detail/-/1581804369/qid=1129924757/sr=8-1/ref=pd\\_bbs\\_1/104-9001472-0247917?v=glance&s=books&n=507846\")\n\n"
    },
    {
      "time": "21 Oct 2005 — 1:40pm",
      "content": "Well, and then there is the question of if you would want to dilute the brand by using a font for text or headlines that too similar too the logo's own face. I think that what you are on track to do is bad marketing practice. Which is a pain in the a\\*\\* thing to say if that meant that I thought you should abandon your font. But I don't. I think it's a cool project. So I suggest\n\nYou make a font that relates too the logo but isn't \\*so\\* close. Then it might be wonderful. But what you are making right now does seem way too close to me.\n\nIt might be good for inspiration for your new font in faces which use a really round looking O.\n\nWhat about Mark Simonson's Proxima Nova? [http://www.ms-studio.com/FontSales/proximanova.html](http://web.archive.org/web/20150415062429/http:/www.ms-studio.com/FontSales/proximanova.html \"http://www.ms-studio.com/FontSales/proximanova.html\")\n\nWhat about a Gil Sans?\n\nNow to be a real buzzkill: you could use the fonts I mentioned. But that would be less fun I suppose. Proxima Nova is awefully nice....\n\n"
    }
  ]
}
