{
  "id": "15586",
  "title": "Frutiger and kepler for art book",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am in the process of making a book about my father’s art. Some of his art has some reminiscence of renaissance while other more contemporary. Poetry and conveying of feelings are key elements. Hence my goal is to use fontfaces that share some of these characteristics. So far I have,after research both on this forum and other places,ended up with the following:\n\nEssay 8 pages:  \nMain heading Frutiger Lt Std (45 Light 18 pt)  \nCaption headings Frutiger Lt Std (45 Light 12 pt)  \nBody text Kepler Std (Light 11 pt)\n\nI am most worried about the Kepler because it doesn’t seem to be much used, for instance it is not on Linotype body text recommendation list. I want to be a little different, but still very reader friendly. Also I feel Kepler Std Regular is a bit too black and heavy, however the light version is maybe too light (especially the top of letters a, c and o almost fades away). My desktop printer is very good (Canon i9100) so that should not be a problem.\n\nDoes my Frutiger/Kepler combo make sense or I am doing something very wrong here?\n\nExample page from essay: [example page (pdf)](http://web.archive.org/web/20071222004911/http:/talemuseum.com/temp/essay.pdf)\n\n3 artwork examples:  \n [Art 1](http://web.archive.org/web/20071222004911/http:/talemuseum.com/temp/contemp.jpg)  \n [Art 2](http://web.archive.org/web/20071222004911/http:/talemuseum.com/temp/drawing.jpg)  \n [Art 3](http://web.archive.org/web/20071222004911/http:/talemuseum.com/temp/watercolor.jpg)\n\n [‹ Question: 1/2](http://web.archive.org/web/20071222004911/http:/typophile.com/node/15618 \"Go to previous forum topic\") [Converting Japanese fonts to paths ›](http://web.archive.org/web/20071222004911/http:/typophile.com/node/15574 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071222004911/http://typophile.com/user/9626\" title=\"View user profile.\">osveta</a>",
  "time": "<br>",
  "uid": "9626",
  "comments": [
    {
      "time": " 12.Oct.2005 12.03pm",
      "content": "“I am most worried about the Kepler because it doesn’t seem to be much used, for instance it is not on Linotype body text recommendation list.”\n\nKepler has size variants specially designed for text, by Robert Slimbach of Adobe. Linotype’s list is drawn from Linotype’s library exclusively. It is also a very small and conservative selection of faces for text. Certain faces in their list are not really appropriate for extended reading. For instance Metro, Helvetica, and Bell Gothic were never intended for extended reading, and do not perform well in that setting. The list has almost no value except as a sales tool for Linotype.\n\nIn the US, designers follow extremely conservative conventions for the use of text type. New designs, often better engineered for extended reading, are passed over in favor of the safe classics like Garamond and Times. Times itself was designed for letterpress and was not carefully adapted for digital imaging. It is less than comfortable to read at small sizes.\n\nAs long as you are using the text versions of Kepler (or any other design), you should have no problems. An additional benefit is that your documents will have some visual distinction, as the use of newer text designs is still so rare. Please take a look at some new text typefaces; you may discover that they perform better and offer greater flexibility and range than older faces that seem more safe:\n\nKepler  \nWarnock  \nFF Clifford  \nHoefler Text  \nMinion  \nBembo Book  \nChaparral  \nMercury  \nFreight  \nMiller  \nPoynter  \nPrensa  \nWhitman  \nProforma  \nAbsara  \nMaiola  \nParable  \nQuadraat  \nDolly  \nMerlo\n\n"
    },
    {
      "time": " 12.Oct.2005 1.12pm",
      "content": "Thanks for replying. I did not know Linotype was that conservative.\n\n“New designs, often better engineered for extended reading, are passed over in favor of the safe classics like Garamond and Times.”  \nI tried Garamond(Adobe Garamond Pro), but found it too “old”looking. Warnock was a bit round for my taste. I want somewhat fresh look.\n\nAny input on Kepler Std regular versus Kepler Std light?  \nI like Light the best, but am worried that it is too light(legible)?\n\nAlso, I get the impression that many tweak the leading settings. Do you often go wrong on auto leading(InDesign CS)?\n\nSorry if my questions are elementary:)\n\n"
    },
    {
      "time": " 12.Oct.2005 4.28pm",
      "content": "I think reading this would be more pleasant if the type were 10 or 10.3 points, with a point more leading, and if you selected the “Caption” optical size. That variant probably has looser letterspacing built into it, so you would gain clarity from that. The Light weight might still be a problem; depending on the audience for your book, and on the printing technology, consider using the regular weight as well. For the ultimate test, ask a 70-year-old to read it.\n\nI don’t mean Linotype is conservative per se, but their list reflects their motive to sell their own fonts. It isn’t a good general guide, as it omits so many useful typefaces.\n\n"
    },
    {
      "time": " 12.Oct.2005 4.45pm",
      "content": "My take on the combination is with the text, it could use more leading. The leading would create a better gray balance on the page.\n\n"
    },
    {
      "time": " 12.Oct.2005 5.37pm",
      "content": "Extremely helpful, thank you both. I will definitely try out your suggestions!\n\n"
    },
    {
      "time": " 12.Oct.2005 5.45pm",
      "content": ".\n\n"
    }
  ]
}
