{
  "id": "15582",
  "title": "Was Hrant caught sleeping again?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Contrats, Yves!\n\nCurrent Prolific Posters stats:\n\nBald Condensed: 55  \nhrant: 53  \ndezcom: 40\n\n",
  "author": "<a href=\"/web/20100728075704/http://typophile.com/user/7764\" title=\"View user profile.\">Norbert Florendo</a>",
  "time": "<br>",
  "uid": "7764",
  "comments": [
    {
      "time": "",
      "content": "Finally, you slugs.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "What's the prize?\n\n"
    },
    {
      "time": "",
      "content": "\\> _Finally, you slugs._\n\nI thought I caught you sleeping once before. ¦-)\n\n"
    },
    {
      "time": "",
      "content": "True, Yves is one of only two members of the Florendo Nocturnal Typodiscourse Club. Actually, Tiffany is also a suspected member, although the conditions of her membership -namely pouncing between redesigns- need to be cleared up... amongst yourselves.\n\nThe prize? The crushing weight of perpetual expectation of course.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_The prize? The crushing weight of perpetual expectation of course._\n\nLOL\n\nYves did you get a shirt at TypeCon? That would be a fitting prize.\n\n"
    },
    {
      "time": "",
      "content": "what?! hrant sleeps???\n\n"
    },
    {
      "time": "",
      "content": "Instead of a shirt, Yves should get one of those posters found plastered about in Helsinki during AtypI :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Norbert,\n\nI still think you were successful before.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Hey, I missed that! Right now Hrant leads by one post. :^P\n\n"
    },
    {
      "time": "",
      "content": "Actually, now we're ex aequo at 60 posts each! ;^)\n\n"
    },
    {
      "time": "",
      "content": "Whoa, and now I'm leading again!? How's that possible? It keeps changing all the time!\n\n:^D\n\n"
    },
    {
      "time": "",
      "content": "Yves is neck-and-neck again. Can he pull it out or will Hrant wake up in time to not go down as 2nd best 2 days in a row!\n\n:-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Bald Condensed: 64  \nhrant: 64  \ndezcom: 60  \nNorbert Florendo: 51\n\nChris, you can do it! You too, Norbert\n\n"
    },
    {
      "time": "",
      "content": "A milestone in online discussion: I drop to THIRD.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant,\n\nthe relief of years of pressure must feel wonderful.  \nAll I can say is that you are now going for quality of remark and not quantity.\n\nFor me, I'm still suggesting that people should dress like Eric Gill (Sans underwear) for Halloween.\n\n\\> _You too, Norbert_  \nBeen there, done that. I caught him sleeping once before.\n\n"
    },
    {
      "time": "",
      "content": "With this comment I will equal my age in posts. God, that is scary:-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> you are now going for quality of remark and not quantity.\n\nHuh. I was pretty sure I've been going for one-liners.\n\nWhich makes me point out: we should be looking at total ASCII, not number  \nof posts. Then Peter would probably come on top. Or maybe Alessandro...\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Alessando would make it on one post alone :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "News Flash: The Era of The Waffle was short-lived, with  \na Greek-American designer-philosopher clawing into first...\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I'll have waffles for breakfast, and souvlaki  \nfor lunch, please. We'll see how dinner goes.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Gee, I was hoping for a Babaganoush or at least some Schwarma:-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I had to quickly do a screen-shot of the frequent posters box for posterity during my brief stint at the top because I know Hrant is a west coaster and will be up later than me :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Chris,\n\nThat's because west is best, and people like east the least. ;-)\n\n"
    },
    {
      "time": "",
      "content": "Hrant,  \nA way for you to add insult to injury would be for you to add posts by commenting on my new \"Align\" typeface here in the Sans Serf Critique area :-)\n\n[http://typophile.com/node/15626](http://web.archive.org/web/20100728075704/http:/typophile.com/node/15626 \"http://typophile.com/node/15626\")\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "The West can rest when the East contests your best guess will test this mess:-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I think it should be mentioned that Hrant has been very busy this past week on the ATypI members discussion list, so that may explain his failure to maintain his usual lead on the Typophile pack.\n\n"
    },
    {
      "time": "",
      "content": "I know, he has been busy deleting the automated posts from an out-of-the-office lister :-)\n\nHrant is well below his usual 100+ posts, otherwise we bottom dwellers wouldn't stand a chance. I know my 15 minutes of fame is up :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "A- **HA**! Take THAT, Zorba!!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Yasou!  \nI had my 3 days and now it is time to fade back into oblivion :-)\n\nThe strain of being on top was too much for me ;-0\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Consider it a blessing that you dropped to second place, Chris.\n\nI think someone was just about to create an OBEY DEZCOM campaign using your icon :∨)\n\n"
    },
    {
      "time": "",
      "content": "\"I think someone was just about to create an OBEY DEZCOM campaign using your icon :∨)\"\n\nMy kids never obeyed me, why would anyone else :-)\n\nNorbert, I'll show your comment to my wife, I am sure she will get a BIG kick out of it :-\\<\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Well Hrant, I now have reached Dalmation status:-)\n\nI never in life ever thought I would get to 101 posts. You surpass this number almost daily for 5 years!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Hrant,  \nThis will make 125 and my last post for the night. The floor is yours :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Well then, let's finish the day perfectly tied! :-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Amazing\n\n- Hrant, Chris, Yves, Mark, Eben and the most prolific Typophile members -\n\nI'am impressed.\n\n"
    },
    {
      "time": "",
      "content": "Oups!\n\n...And I appreciate all your crit and advice and the time you give to Typophile. Thanks to all of you, Typophile members.\n\n"
    },
    {
      "time": "",
      "content": "It seems the Marathon runner now has an insurmountable lead...\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Lasse Viren moves in for the challenge! Or was it that Greek guy a couple of millenniums ago during the Peloponnesian War? :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\"Say Good Night Gracie!\"\n\nChrisL\n\n ![](http://web.archive.org/web/20100728075704im_/http:/typophile.com/files/BurnsAllen.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Little historical mix-up  \n_What we call a marathon today derives its name from an event that involved the runner Pheidippides, who ran 260 kilometres from Athens to Sparta in two days. He did this to announce the Persian landing at Marathon in 490 BC, and to request Sparta's help to beat off the enemy._ (No sniggering.)  \nThe Peloponnesian war 431 - 404 BC Athens vs Sparta  \nTim\n\n"
    },
    {
      "time": "",
      "content": "\"...He did this to announce the Persian landing at Marathon in 490 BC\"\n\nWell that pulled the rug out from under me :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "[http://news.bbc.co.uk/2/hi/europe/4298146.stm](http://web.archive.org/web/20100728075704/http:/news.bbc.co.uk/2/hi/europe/4298146.stm \"http://news.bbc.co.uk/2/hi/europe/4298146.stm\")\n\nAnd interestingly, I've been mistaken for Persian many times.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "And I have been mistaken for a guy needing a rug many times :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Good Night Gracie\n\n"
    },
    {
      "time": "",
      "content": "LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Chris most people won't get the joke.\n\n"
    },
    {
      "time": "",
      "content": "\"And goodnight Mrs. Callabash, wherever you are.\"  \n----------------------------------------------------  \nYes, I'm old, but so's the shnozola (Hachachacha!)\n\n"
    },
    {
      "time": "",
      "content": "Inka, dinka dink, ka dinka dinka dinka doo!, I'got a million a' dem!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\"most people won’t get the joke\" unless they smoke cigars :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\"BANG ZOOM! To dah MOON Alice!\n\nChrisL\n\n ![](http://web.archive.org/web/20100728075704im_/http:/typophile.com/files/honeymooner2.jpeg)\n\n"
    },
    {
      "time": "",
      "content": "\\> _unless they smoke cigars_\n\nThat just burns me up. :-o\n\n"
    },
    {
      "time": "",
      "content": "By George! I think he's got it! }:-/\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "_Hell has frozen over!_  \n20 November, 2005 - 11:55am  \nTop typophiles in the last 10 days:\n\ndezcom: 213  \nMiss Tiffany: 80  \nMark Simonson: 62  \nsim: 58  \nNorbert Florendo: 55  \nBald Condensed: 43  \ndavid hamuel: 40  \nDavid Bailey: 38  \nformlos: 37  \n**hrant: 35**\n\nGee... I hope Hrant hasn't abandoned us. He must be very busy distributing \"Obey Hrant\" posters again. Hurry back!\n\n"
    },
    {
      "time": "",
      "content": "My guess would be he is spending more time with his 5-year-old son--and rightly so.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "He's been very quiet everywhere. No sign of him on the ATypI member list either. Anyone know him well enough to phone and ask if he's okay?\n\n"
    },
    {
      "time": "",
      "content": "I don't have his phone number but I'll email him.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I believe he is in the process of moving. I must admit, though, it was something to log in and see his name nowhere near the top.\n\n"
    },
    {
      "time": "",
      "content": "I'm anxious about Hrant, since one year, it's the first time he is'nt in the most prolific posters Is somebody is able to talk with him?\n\n"
    },
    {
      "time": "",
      "content": "He has not answered my email but Steve may be right. I remeber him saying he could not look up something in Bringhurst because his books were packed up.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Well I'm in the middle of moving too, and all my books are packed, but do you see me slacking? :)\n\n"
    },
    {
      "time": "",
      "content": "That's what I think.\n\n"
    },
    {
      "time": "",
      "content": "\"Well I’m in the middle of moving too, and all my books are packed, but do you see me slacking? :)\"\n\nI don't know John, things have been pretty quiet on AtypI lately. The most exciting thing there is people whining about paying their annual dues. :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\>if he’s okay?\n\nOh dear, I hope I haven't scared off the poor sensitive fellow...\n\n"
    },
    {
      "time": "",
      "content": "Good grief, I just looked and saw myself up there on the list...guess I've been enjoying my time here as well!\n\n"
    },
    {
      "time": "",
      "content": "Oh Noooo!, David bumped off Hrant! :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Thanks for worrying. We moved house\\* and I'm typing this standing up in the alleged garage. But the whole thing is a ploy to drop off the prolific posters list(s) so I can reforge my identity and do a surprise ASCII blitzkrieg on all you slouches (except Chris \"The 200 Club\" Souvlakozos over there).\n\n\\* Man, some of you are really paying attention. I'm the one who should worry...\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Thanks for checking in, Hrant.  \nMeanwhile it will take a long time before anyone can top Chris' posting record of \"dezcom: 219\".\n\nMeanwhile, you owe us a self-portrait of yourself via the [**South Park character generator**](http://web.archive.org/web/20100728075704/http:/typophile.com/node/16261).\n\n"
    },
    {
      "time": "",
      "content": "\"Wrong Again finger-and-toe-counting breath\"\n\nOn Friday, November 18th, my total was 230 posts:\n\n ![](http://web.archive.org/web/20100728075704im_/http:/typophile.com/files/nov18-2005.gif)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Hrant,\n\nWhere'd you move to? Still in the LA area?\n\n"
    },
    {
      "time": "",
      "content": "He moved to Bouma Hills :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Chris,\n\nThat's funny. He sure didn't move to Tarzana. ;-)\n\n"
    },
    {
      "time": "",
      "content": "I actually like Tarzana - I mean the font. Except for the \"Q\".\n\nAnyway, I only moved about 1/2 a mile actually.  \nBut driving the stuff is never the hard part...\n\nAnd for the record dearies, my all-time high  \nfor posts in one day on a single list (Typo-L) is a  \nlittle over 70... Although that was in my yute.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "hhp good to hear you are healthy and just busy.\n\n"
    },
    {
      "time": "",
      "content": "I'm a comin' after ya... you loosely-wrapped gyros!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant's had his double espresso. No more sleep until he's past 100 posts!\n\n"
    },
    {
      "time": "",
      "content": "Guess I better have a double Greek coffee then :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Hrant sneaks up riding his stealth Armenian rocket poster and closes the gap. He anjticipates, \"TODAY WILL BE THE DAY I RESUME MY THRONE!!!\"  \n:-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "But that's mostly because you guys have been slacking.  \nI know because I'm <cite>still</cite> stuck keeping page 9 of the tracker at bay!\n\nThat said, with this post I did indeed [re]take  \nthe lead... but the antimony is bittersweet. :-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "just found this thread now, and i had to crack up at paul d hunt saying\n\n_what?! hrant sleeps???_\n\nCheers, Hrant! Keep on posting! :-)\n\n"
    },
    {
      "time": "",
      "content": "Oh No! The mad Armenian Posting Machine has surged into the lead once more! Spurned on by anticipation of many sleepless nights to come--following the soon-to-be-born newest Parpazian baby. :-)\n\nChrisL\n\nHrant,  \nLet us know when that fatal call comes from your wife, \"I think it's time dear.\" I just hope that your baby does not grow up to be a Modernist Chirographer :-)\n\n"
    },
    {
      "time": "",
      "content": "Chris is lazy, Chris is lazy… (think of a grade school chant)\n\n"
    },
    {
      "time": "",
      "content": "<cite>the soon-to-be-born newest Parpazian baby</cite>\n\nAw, she has your bouma, dear!\n\n"
    },
    {
      "time": "",
      "content": "Not that anybody needs to care, but since I've sort  \nof unwittingly established a precedent of expectation  \nover the years, revealing the following might be useful:\n\nFor the forseeable future I'm not going to be able to look  \nover every thread. I will certainly follow threads that I've  \nposted in (thanks to the \"my recent posts\" tracker) and will  \nregularly scan the tracker for potentially interesting threads,  \nbut please don't expect to fling things like \"hey Hrant what do  \nyou think?\" or \"hah, that sounds like hhp's dog\" randomly in  \nthe air and promptly get my once-typical Pavlovian reaction.  \nSo: you're not at all rid of me, but my ears are much busier now.\n\nAnd if you happen to be feeling inadvisably kind and you run  \ninto a thread that you think I'd be interested in, and maybe  \nit has a misleading title, my email server is always open.  \nThank you thank you. As you were.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\"...promptly get my once-typical Pavlovian reaction.\"\n\nor is that Pavpasian reaction :-)\n\nHrant,  \nWe know you have a much higher calling now being papa. You may have to learn to be a one-armed typist now for your email. The sweet smell of baby skin is your treasure. Sleep well my friend when you can.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "But Chris why would you let Mis Tiffany take your throne. Isn't you who is slacking?\n\n"
    },
    {
      "time": "",
      "content": "The throne weighs heavy.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Please! Keep the throne.\n\nSheesh.\n\nI hate that tracker. :^/\n\n"
    },
    {
      "time": "",
      "content": "Chris that sounds like a line out of the Lord of the Rings\n\n"
    },
    {
      "time": "",
      "content": "\"...sounds like a line out of the Lord of the Rings\"\n\nWell, maybe without the special effects.\n\nChrisL\n\n"
    }
  ]
}
