{
  "id": "15628",
  "title": "FF Meta vs Lexus Opti",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Dear Typohiles,\n\nWe have been working with a UK Insurance company over the last couple years assisting them with their new brand. Up until last week, they had more or less decided that they were going to implement FF Meta on a corporate wide basis. One of their Marketing team was then sent a TrueType font called Lexus Opti. We compared Lexus Opti with FF Meta, and the resemblance bewtween the two typefaces was uncanny. Now I became very suspicious that someone had just basically saved Meta and renamed it as Lexus Opti and passed it off as their own design!\n\nI have since learnt that Opti fonts are in fact valid commercial fonts, but they have not been updated in the last 15 years, and would not be supported.\n\nI need to come up with some further argument points for our customer, not to go with Lexus, but  \nembrace FF Meta.\n\nCan anyone please help me with this, with regards to the technical unsuitability of the Opti fonts and provide a history of this range of Opti typefaces.\n\nLook forward to hearing from you\n\nKind regards  \nNeil  \nTerrapin Solutions\n\n",
  "author": "schaffs",
  "time": "14 Oct 2005 — 3:18am",
  "uid": "1502",
  "comments": [
    {
      "time": "14 Oct 2005 — 7:12am",
      "content": "_\\> I have since learnt that Opti fonts are in fact valid commercial fonts_\n\nLet's say \"valid commercial font\" is a stretchable concept, when one considers  \ntheir collection consists largely of rip-offs and pirated designs. I suppose you don't buy your Rolex watch from a suspicious street vendor neither. :^)\n\n"
    },
    {
      "time": "14 Oct 2005 — 7:19am",
      "content": "Could you join a link for the Lexus Opti typface you're talking about?\n\n"
    },
    {
      "time": "14 Oct 2005 — 7:54am",
      "content": "Is is ok to attach a zip file containing the font?\n\n"
    },
    {
      "time": "14 Oct 2005 — 7:58am",
      "content": "That would likely be a bad idea. Wouldn't want to give the makers an excuse to come after Typophile.\n\n"
    },
    {
      "time": "14 Oct 2005 — 8:29am",
      "content": "Not a zip file, It would be a bad idea as sii wrote. A link to know where to buy this typeface.\n\n"
    },
    {
      "time": "14 Oct 2005 — 8:34am",
      "content": "To be perfectly honest, i've searched the web, and cannot find anywhere that sells it, no mention whatsoever. I'm away on holiday now until 24/10, so think I will leave it until then, but in the meantime, if anyone can add any more arguments it would be much appreciated, and i'll pick it up on my return.\n\nThanks to all for your input so far.\n\nNeil\n\n"
    },
    {
      "time": "14 Oct 2005 — 8:45am",
      "content": "_i’ve searched the web, and cannot find anywhere that sells it_\n\nwell that should settle it then, shouldn't it? if you can't purchase the font, then you wouldn't want to use it for corporate branding. at least that's _my_ line of thinking.\n\n"
    },
    {
      "time": "14 Oct 2005 — 9:03am",
      "content": "\\> they have not been updated in the last 15 years\n\nHow old is Meta?\n\nhhp\n\n"
    },
    {
      "time": "14 Oct 2005 — 9:06am",
      "content": "The wiki is your friend... 'early nineties' :-)\n\n[http://typophile.com/wiki/FF%20Meta](http://web.archive.org/web/20150321172508/http:/typophile.com/wiki/FF%20Meta \"http://typophile.com/wiki/FF%20Meta\")\n\n"
    },
    {
      "time": "14 Oct 2005 — 12:12pm",
      "content": "Lexus Opti is probably FF Meta, just renamed. Meta is the corporate font for the Lexus brand, and about 18 months ago i made special kerning pairs on behalf of the agency's art director in LA. I suppose they paid a license to FSI which gives them the right to rename the font. It does not, however, give anyone the right to sell the font under this new name. The copy you have is thus a double rip-off: someone stole it from Lexus or their agency who have signed a contract which only licenses it to them. So Lexus could get sued by FSI, and whoever copied the font could be sued both by Lexus and by FSI.\n\nAnyway: how could you even consider using a font for business whose legal provenance you cannot ensure? “One of their Marketing team was then sent a TrueType font” - what sort of procurement is that? Tell you client to stay away from illegal software, as it’ll cost them. Especially now that i know about it.\n\n"
    },
    {
      "time": "14 Oct 2005 — 12:17pm",
      "content": "\"The wiki is your friend… ‘early nineties’ :-)\"\n\nMeta was first designed for the German Post Office in 1985 and called PT55, and then redigitized for my design company, MetaDesign, in 1990 and named thus. Check my blog at [www.spiekermann.com](http://web.archive.org/web/20150321172508/http:/www.spiekermann.com/ \"www.spiekermann.com\") for an article on the excat history. That makes it 20 years.\n\n"
    },
    {
      "time": "14 Oct 2005 — 12:20pm",
      "content": "Go Erik!!! :-)\n\n"
    },
    {
      "time": "14 Oct 2005 — 12:27pm",
      "content": "\"Go Erik!!! :-)\"\n\nthank you, and thanks to Jürgen Siebert for alerting me to this thread.\n\nI am surprised – nay: apalled – at the lack of initiative by some of the designers out there. How difficult can it be in the age of Google or myfonts.com to find out the name of the original designer? And then write to me directly to get proper facts rather than all sorts of hearsay? Not all type designers are dead and you don’t even have to go to the library or the bookshelf, like I have to when I do my research for the upcoming new edition of the FontBook. It is so easy to find at least the first traces, but you cannot rely onn the web entirely, not even on wiki. There’s too much copy-and-pasting going on. And mistakes are just as easily copied as true facts. Get a lead, then do you own fact checking. Never rely on the first source that comes along. Even Myfonts.com just publishes what they come by, and that is not necessarily always true. Nobody can double- and treble check all the 30,000 plus fonts out there, but at least we try.\n\n"
    },
    {
      "time": "14 Oct 2005 — 12:46pm",
      "content": "\\> Lexus could get sued by FSI\n\nI'm curious, are you sure?  \nDoes the contract say they're responsible for third-party piracy?  \nThat seems like a contract nobody would [knowingly] sign.\n\n\\> I am surprised – nay: apalled – at the lack  \n\\> of initiative by some of the designers\n\nFrankly, I would instead commend Neil for worrying  \nabout it and asking - most designers wouldn't bother. :-/\n\nAnd apparently Typophile worked for him! :-)  \nThanks to you and Jürgen too.\n\nhhp\n\n"
    },
    {
      "time": "14 Oct 2005 — 1:23pm",
      "content": "Great to see the Wiki entry updated so quickly.\n\n[http://typophile.com/wiki/FF%20Meta](http://web.archive.org/web/20150321172508/http:/typophile.com/wiki/FF%20Meta \"http://typophile.com/wiki/FF%20Meta\")\n\n"
    },
    {
      "time": "14 Oct 2005 — 1:33pm",
      "content": "I hate to say it but most people in the business world don't know anything about intellectial property and whats worse, they don't care. I site P22's Cezanne and Starbucks. How long did that take to get resolved? Thus the legal profession is still in business. Erik should be pissed off.\n\n"
    },
    {
      "time": "14 Oct 2005 — 1:49pm",
      "content": "Totally. Just not at Neil I hope.\n\nhhp\n\n"
    },
    {
      "time": "14 Oct 2005 — 2:31pm",
      "content": "Neil was asking for good arguments to encourage his people to NOT use the cheapo font. I think its fabulous that Erik can give him immediate feedback in such strident language. Our type team keeps trying to fight the good fight here at MegaCorporation, but we often run into just exactly what Neil is running into from people way higher on the corporate totem pole than us minions.\n\nIn fact, I just got a job in from a not-to-be-named outside vendor that used OPTIDianna, which is a rip-off of Elsner+Flakes Ballantines faces. We were able to stop that one in its tracks. We ordered Ballantines for ourselves and forced our vendor to do the same. Score one for the font police.\n\nkristin\n\nP.S.: there IS a website that has an order form to purchase these font on-line or via phone but I'm not posting the URL here!\n\n"
    },
    {
      "time": "14 Oct 2005 — 10:06pm",
      "content": "<cite>P.S.: there IS a website that has an order form to purchase these font on-line or via phone but I’m not posting the URL here!</cite>\n\nOh... but you simply _must_ Google them.\n\nYou'll laugh. You'll cry. You'll kiss $399.95 goodbye for the \"Compact Disc Type Library Volume 1\", featuring \"400 Unlocked Type Faces\" that are \"Ready-to-go. No phone calls.\"\n\nAlso, be sure to read \"The Truth About Packaged Digitized Fonts\" which expounds upon the prevalence of font piracy...\n\n<cite>\"Highly visible in the font market today are businesses that package very poor quality fonts. Fonts which are gathered from various sources and offered at prices so low that a prudent person should realize that something is wrong.\"</cite>\n\n$399.95 for _how many_ \"Unlocked Type Faces\"?\n\n"
    },
    {
      "time": "15 Oct 2005 — 4:32am",
      "content": "_How many times have you heard someone say \"the desk top publishing quality will get better as time goes on,\" or \"it's good enough.\" The facts are that it won't get better and the output will always be \"good enough\" until educated type consumers learn to avoid the opportunists, and stop short of being tricked into buying inferior products._  \nGoogle can be such fun can't it?  \nTim\n\n"
    },
    {
      "time": "15 Oct 2005 — 9:07am",
      "content": "I wonder if Toyota can go after the font maker based on use of the Lexus trademark?\n\nWhen Nike started making a line of \"Verdana\" ladies golf gloves\\* and bags, out of interest I asked our TM people if it was kosher. I was advised that as an unrelated product there wasn't much we could do.\n\nBut this seems different - McDonalds shot down at least one McFont with nastygram letters, I'm sure Lexus could do the same thing.\n\n\\* [http://www.dickssportinggoods.com/sm-nike-verdana-golf-glove-women--pi-1...](http://web.archive.org/web/20150321172508/http:/www.dickssportinggoods.com/sm-nike-verdana-golf-glove-women--pi-1858868.html \"http://www.dickssportinggoods.com/sm-nike-verdana-golf-glove-women--pi-1858868.html\")\n\n"
    },
    {
      "time": "21 Oct 2005 — 9:16am",
      "content": "A big thankyou for all those who responded, having just returned from holiday, I can see this has been a hot topic. I will esnure that this information is conveyed to our customer.\n\nKind regards  \nNeil\n\n"
    },
    {
      "time": "25 Oct 2005 — 6:31am",
      "content": "_OPTIDianna, which is a rip-off of Elsner+Flakes Ballantines faces_\n\nFunny. They _appear_ to be the remnants of an old compnay that used to do type casting here in Chicago. One of the presses I ocassionally work on has some Monotype-cast handset that I think came from them.\n\nWhile the 18-point Lydian we have is the worst casting of a typeface I think I've ever seen, I'm a bit shocked that these folks would be engaged in the seedy underbelly of font piracy. I guess Chicago's gone to the dogs.\n\n"
    },
    {
      "time": "3 Nov 2005 — 7:33am",
      "content": "Hello Typophiles,\n\nWell I have some good news. After conveying the information to customer, they have now placed an order for a 5000 seat license for four weights of FF Meta. This really is such a great forum, and am so pleased that I posted the orginal message.\n\nI would like to personally thank everyone especially Erik, and Hrant (for protecting me) and all the rest for their input.\n\nKind regards  \nNeil\n\n"
    },
    {
      "time": "3 Nov 2005 — 7:51am",
      "content": "Cha-chinggggg.  \nI think some donation (by whoever) to Typophile is in order.\n\nhhp\n\n"
    },
    {
      "time": "3 Nov 2005 — 7:56am",
      "content": "_Funny. They appear to be the remnants of an old compnay that used to do type casting here in Chicago._\n\nThat company has a legacy of font piracy going way back before digital type. \"Type Films of Chicago,\" part of the same company, offered a huge library of duplicated and renamed (\"similar to\") film fonts which they sold to type houses. If you look at one of their old catalogs, you can even spot a character here and there that is backwards or upside down or the wrong weight. The originators of some fonts did this to determine who, among their customers, were pirates.\n\n"
    },
    {
      "time": "15 Aug 2009 — 1:21pm",
      "content": "Don't know if adding to this four years later makes sense, but I just came upon it, and Mark's on the mark. I used to work a few doors down from OptiFonts (officially Type Films of Chicago) when their office was downtown (later moved to Chicago suburb, still operating at the second location many years later, if not still now). They sold everything from metal to film to digital fonts back then, virtually all pirated. One story I heard decades ago was how they went about pirating Headliners fonts, discovered by employees of the local Headliners franchise (The Chicago Franchise Co.). They'd order headlines set as if they were a legitimate type shop customer. One day, while setting one of the fonts stored as single character films, they realized they had used EVERY character and alternate. So they (Opti) were cut off, generally to try to continue as another customer, in Chicago or elsewhere.\n\nAs to their digital copies, many are quite badly constructed fonts, rescanned and renamed to get around lax US legal restrictions. Regardless of how they LOOK, open in a font editor and see that most characters have dozens to hundreds of extra points in their outlines, some so bad they'll crash hi res RIPs. If you're unfamiliar with the original, the underlying outline drawing is probably the best way to determine, barring exact digital dupes, whether you're dealing with a pirate or an original foundry or designer. And in the case of OptiFonts, another giveaway for some is to be suspicious of font names of locations or stuff related to India & S. Asia.\n\n"
    }
  ]
}
