{
  "id": "15626",
  "title": "Align Sans--a bit on the square roundaboutly",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Here is one of the new type families I have been working on for the past few months. It started out as a display face but I pushed towards the text face side. There are 3 weights in the posted PDF: light, regular and bold. There are small caps and oldstyle figures as well as all the CE glyphs. See if you can tell what I have \"almost\" done.  \nAny help would be greatly appreciated. I really benefitted from my first font here last year and am hoping the comments will be as fruitful this time.\n\nRegards,\n\nChrisL\n\n| Attachment | Size |\n| --- | --- |\n| [Align\\_postTpfle.pdf](http://web.archive.org/web/20150123031539/http:/typophile.com/files/Align_postTpfle.pdf) | 87.1 KB |\n| [Align\\_AltGTpfle.pdf](http://web.archive.org/web/20150123031539/http:/typophile.com/files/Align_AltGTpfle.pdf) | 49.93 KB |\n| [Gadget\\_Magazine.pdf](http://web.archive.org/web/20150123031539/http:/typophile.com/files/Gadget_Magazine.pdf) | 148.46 KB |\n| [Gadget\\_MagUpdate.pdf](http://web.archive.org/web/20150123031539/http:/typophile.com/files/Gadget_MagUpdate.pdf) | 377.83 KB |\n| [paulTerrific.pdf](http://web.archive.org/web/20150123031539/http:/typophile.com/files/paulTerrific.pdf) | 37.99 KB |\n| [Align\\_3weightAlign.pdf](http://web.archive.org/web/20150123031539/http:/typophile.com/files/Align_3weightAlign.pdf) | 56.93 KB |\n\n",
  "author": "dezcom",
  "time": "13 Oct 2005 — 6:10pm",
  "uid": "3135",
  "comments": [
    {
      "time": "13 Oct 2005 — 9:08pm",
      "content": "I see a lot of potential in this font as a display face for magazines and even corporate identity altough it's clear this is not a face for setting extended amounts of text.\n\nI like a lot it's technical appearance, the light weight is specially sexy. Ligatures, punctuation and special characters look terrific.\n\nI can't really help you with my crits because this is such a good work so congratulations.\n\nHéctor\n\n"
    },
    {
      "time": "13 Oct 2005 — 9:14pm",
      "content": "Ok, I have one... the upper case S looks like a bended clip, like it's too open. Also the lower right leg of the & (the diagonal) seems like isn't firmly stepping on the baseline.\n\nHéctor\n\n"
    },
    {
      "time": "14 Oct 2005 — 12:35am",
      "content": "Chris, I like it! But I agree with Héctor about display/text… the face is too \"regular\" to work in text. Everything has an even, repetitous rhythm. To work in text, a face needs to be more irregular, if you get what I mean.\n\nI don't have much critique for you. Like Héctor says, I would try to bring it to market soon.\n\nHere's a request: how about a single-storey g? You always seem to make such peculiar g's. I would like an alternate if I were to use this face.\n\n"
    },
    {
      "time": "14 Oct 2005 — 6:19am",
      "content": "Héctor and Dan, thanks for your kind words and helpful suggestions. I will give them a try. Thanks to your encouragement, I am hoping to submit it to foundries soon.\n\nThe first version I drew was the light caps and small caps. I was looking for a squarish face for smallcaps and couldn’t find what I wanted so I started designing my own. I did a few characters in Adobe Illustrator for a simple heading on the job I was working on. I then brought it to FontLab to extend. I did two kinds of Lights, this one which is very regular and squared with equal proportions and another (which I will post soon as a separate face) in classic Roman proportions and much rounder. The lowercase in both was an afterthought at the time. I then did the bold and went back and forth with the light a few times before starting the regular. I did a “medium” too but it needs work.  \nDan, I will try an alternate single-story g which should be quite easy to add. What bothers you about my double-bowl g? I know it is a bit out of mainstream but what else is troubling to you?  \nHéctor, I will look at the S and & again to see if I can fix them a bit. I understand what you mean about long text. I would not intend this face for a novel. You and Dan are right It is a more corporate or technical face.\n\nHas anyone figured out what I “almost” did yet? A hint is in the name and is somewhat apparent on pages 5, 6, & 7 of my PDF.\n\nChrisL\n\n"
    },
    {
      "time": "14 Oct 2005 — 6:27am",
      "content": "you \"almost\" made the charwidths the same for all three weights! very cool. great concept. so explain the \"almost\" part, please.\n\n"
    },
    {
      "time": "14 Oct 2005 — 6:42am",
      "content": "\"you “almost” made the charwidths the same for all three weights!\"\n\nDead on Paul!\n\nThe \"almost\" is that I did not do it intentionally. It just happened. I am a very \"optical\" kind of guy and just judge everything by eye. When I did each weight, I did the metrics as I felt would be best for the way it looks. I didn't even notice how similar the fit was until I printed the above PDF! Now that I see it, I think I will try to push the \"almost\" a bit more and see if it works. This \"Align\" concept would be a good way to insure fit in text when you were adding bold or light in the copy and then changed your mind. You would not have to worry about reflow! I am sure someone else must have thought of this before though.\n\nChrisL\n\n"
    },
    {
      "time": "14 Oct 2005 — 6:47am",
      "content": "_I am sure someone else must have thought of this before though._\n\nThis is not a new concept, but i think most families that employ this use them for maybe only a small range of weights (2-3 max?) I recently did this for the light and regular weights of [LTC Cloister](http://web.archive.org/web/20150123031539/http:/www.p22.com/lanston/products/cloister.html). To see this carried out through a whole range of weights from light to bold (and maybe even black) would be really tricky and something to be proud of, i would think. The big trick is to make sure that none of the designs are overly compromised due to spacing restrictions...\n\n"
    },
    {
      "time": "14 Oct 2005 — 6:50am",
      "content": "_\\>Dan, I will try an alternate single-story g which should be quite easy to add. What bothers you about my double-bowl g? I know it is a bit out of mainstream but what else is troubling to you?_\n\nI guess that I just don't like it. Maybe its a mainstream thing, but I just think that it is wierd. And in display sizes, you can't look away (you can sort of get away with things in text, I guess). Please don't hate me :(\n\n"
    },
    {
      "time": "14 Oct 2005 — 6:52am",
      "content": "_\\>most families that employ this use them for maybe only a small range of weights (2-3 max?)_\n\nThe reason for this is that, on an old [Linotype Machine](http://web.archive.org/web/20150123031539/http:/typophile.com/wiki/Linotype%20Machine) matrix, you could have two different fonts. But the characters had to have the smae width. The Roman would either be duplexed with the Italic, or with the Bold. This is why Times Bold looks so cramped.\n\nSometimes, a newspaper Serif face would be duplexed with a Sans. This sort of thing can still be seen in some digital faces, like [Compatil](http://web.archive.org/web/20150123031539/http:/typophile.com/wiki/Compatil).\n\n"
    },
    {
      "time": "14 Oct 2005 — 7:18am",
      "content": "\"Please don’t hate me :(\"\n\nDan,  \nDon't sweat it. I have thick enough skin. When I ask for a crit, I don't expect everyone to just say good things. We are all colleagues here just trying to help eachother do better work.\n\nChrisL\n\n"
    },
    {
      "time": "14 Oct 2005 — 7:53am",
      "content": "I actually like the g a lot, it goes very well with the technical style of the face.\n\nHéctor\n\n"
    },
    {
      "time": "14 Oct 2005 — 7:54am",
      "content": "i think the g is great, but i'm always for alternates.\n\n"
    },
    {
      "time": "14 Oct 2005 — 11:01am",
      "content": "Thanks guys. I'll add the alternate g tonight. It never hurts to give the user options.\n\nChrisL\n\n"
    },
    {
      "time": "14 Oct 2005 — 1:31pm",
      "content": "On P8 of the pdf, your u/c V is different (so is the small caps l/c version) in the Regular from the other two weights. In the light and bold the cap V looks backwards to me (especially in view of the l/c v). I think I prefer the regular weight cap V which means maybe the u/c A should be a rotational version of the V in terms of the curve at the top being on the other side.\n\nDid you ever try an M with sloping sides as per W?\n\nDo you want me to go now?\n\n"
    },
    {
      "time": "14 Oct 2005 — 1:46pm",
      "content": "Should the terminals on the S and s slope the other way (like the f, j and the ear on the g?) Do you need to slope the terminals on the z too?\n\nThe C and c look a bit narrow.\n\nTerminals on E, F, H, G, (maybe K), P and R all look like they are sloping the wrong way, mainly because the A seems to be setting the rule and I think the A is back-to-front.\n\nNow shall I go?\n\n"
    },
    {
      "time": "14 Oct 2005 — 2:31pm",
      "content": "Nick, Please Don't go! :-)\n\nThe V on the regular version is correct. The other weights I meant to flip but forgot. The rule is set by the lc v and the others should match it. Only the regular does so.  \nI tried both the diagonal M and the squared W and found both too jarring so I went back to the conventional straight M.  \nThe s fits neighboring characters better slopped the way I have done it. I tried the other way and the stroke just didn't pull around enough.  \nI fought with the 2 c's many times. When the size is small the narrower way works; when the type is large, the wider c seems better. It was more of a color issue and I found I just had to compromise.  \nI don't understand your comment about the slopes on the EFGKPR terminals. They all slope the same way. Perhaps you mean it goes against the calligraphic flat pen angle model? The slope direction I gave it gives a bit more air to the lower counter as opposed to the upper making the vertical balance better to my eyes. I didn't feel that the flat pen model had a bearing on such a non-calligraphic face. I just used positive to negative space reasoning (dare I say Notan:-) The angle cuts help reduce dark spots at the joins. This face was intended as more of a tech/corporate as opposed to a warm humanistic face. I think that traditional type and calligraphy savvy users would probably agree with you on that though.\n\nThanks Nick for taking the time and care to comment and by all means stay :-)\n\nChrisL\n\n"
    },
    {
      "time": "14 Oct 2005 — 3:11pm",
      "content": "Well, I guess I'm going to sound like a broken record, but I think it looks nice Chris. I think its nearly ready for submission as well. I think it looks nice as a display face, but as has been stated before it probably won't work for text.\n\nChris, I agree with Dan. I don't like the \"g\" either. You do seem to make weird 'g\"s. Sometimes conventional is appropriate. I disagree about the mainstream comment though, because right now two story \"g\"s seem to be all the rage in sans serif faces.\n\nGood show, Chris— two months?...you must not have been sleeping. :)\n\n"
    },
    {
      "time": "14 Oct 2005 — 3:16pm",
      "content": "Another thought: Maybe the terminals on the S and s should do the same as those on the C, G and c?\n\n"
    },
    {
      "time": "14 Oct 2005 — 5:41pm",
      "content": "\"Maybe the terminals on the S and s should do the same as those on the C, G and c?\"\n\nThat sounds like a possibility. I will give it a shot Nick.\n\n\"...You do seem to make weird ‘g's\"  \nGuilty as charged Terry :-)\n\n\"... two months?…you must not have been sleeping. :)\"\n\nI got so charged up after meeting all of you at TypeCon that I got a burst of energy. I am sure I will crash shortly. Last year I worked on Leporello (my other weird g face) from April until January and then did nothing until coming back from New York this summer.  \nI am really a slow piker compared to James Montalbano at TerminalDesign though. He can really crank it out quick and it's damn good too!\n\nChrisL\n\n"
    },
    {
      "time": "14 Oct 2005 — 8:08pm",
      "content": "Nice going Chris. I like the numerals especially. They are more round than the letters though.\n\nI am wondering if you can find a better solution for the crotches of the diagonals. They don't seem to totally in harmony with the cut joins on the connections of the branches.\n\nCheck on whether the a,g,e, and s would be better narrowerer. The curved leg on the K, k looks a little out of place. Should the 'cut' on the 'a' be at the top of the bowl instead of the bottom?\n\nI'm going to be away from the internet for a while, but good luck with this; it's promising.\n\n"
    },
    {
      "time": "15 Oct 2005 — 9:41am",
      "content": "I have made the alternate g suggested by Dan and Terry and the s and S suggested by Nick. I amtrying to figure out how to post a second PDF and I will as soon as I do.\n\nChrisL\n\n"
    },
    {
      "time": "15 Oct 2005 — 9:45am",
      "content": "Ahh, now I get it, you edit at the tp in the black bar, good :-)\n\nSee new attachment.\n\nChrisL\n\nPS: I included the VERY SPECIAL OpenType Feature code for the alt g in the PDF for Dan and Terry's benefit :-)\n\n"
    },
    {
      "time": "15 Oct 2005 — 1:55pm",
      "content": "William,  \nI'll look at the joins you spoke of.\n\nThe numerals were made roundwer to helf differentiate them from letters.\n\nChrisL\n\n"
    },
    {
      "time": "16 Oct 2005 — 12:45am",
      "content": "Chris, can we see the alt characters in display size? I really see this as being a good marketable magazine display face. Lemme see it big!\n\n"
    },
    {
      "time": "16 Oct 2005 — 6:42am",
      "content": "Terry,  \nAs Paula Scherr says, \"Make it Bigger\" :-)  \nI will post one later today. I guess I thought 18pt was display.\n\nBTW: You didn't respond to my OpenType Feature Joke?\n\nChrisL\n\n"
    },
    {
      "time": "16 Oct 2005 — 6:28pm",
      "content": "I have just uploaded a dummy title/contents page from a fictitious high-tech magazine which I call Gadgets&Gizmo. There are several VERY famous authors who have written articles so pay particular attention to the bylines.\n\nChrisL\n\nPS: Does anybody want to comment on my \"Feature\" code in my second post? Dan?\n\n"
    },
    {
      "time": "16 Oct 2005 — 8:27pm",
      "content": "Oh my god! This font face is terribly sexy man! I must have it...\n\nI like better the text with no alternates, but it's good to have choices.\n\nI've got another suggestion: the tail of the Q is too shy for my taste, maybe you could make it squared.\n\nHéctor\n\n"
    },
    {
      "time": "16 Oct 2005 — 9:18pm",
      "content": "Chris, I guess I missed the joke. I also wanted to see the alt characters big. I wanted to see the alt \"g\" in that example.\n\nChris, your original \"g\" is growing on me though... I'd still like to see the other in context. Paula Scher and I writing an article together, ha! :) That would be interesting! (For me at least.) :)\n\n"
    },
    {
      "time": "16 Oct 2005 — 9:35pm",
      "content": "I'm lovin' that alt g.\n\n"
    },
    {
      "time": "17 Oct 2005 — 4:57am",
      "content": "Thank-you all!\n\nHector, As soon as I find a foundry, it will be available. Glad to have you as a first customer :-)\n\nDan, I am glad to be able to make the g whizz :-)\n\nTerry, Have you ever scripted Opentype features in FontLab? If not, it might be hard to understand the joke. What I had written in the 2nd PDF was the contextual alternates feature script where the glyph \"g\" was substituted for the glyph \"g.alt\" when the context was Dan and you as users. This of course is not possible, but it was a fun joke to code anyway:-) Sorry no one got it. :-(  \nI will redo the magazine page using the alts tonight and post it.\n\nChrisL\n\n"
    },
    {
      "time": "17 Oct 2005 — 6:33am",
      "content": "just curious... are the alts the same width as the letters they replace? that'd be interesting to be in keeping with your \"align\" theme. just an idea...\n\n"
    },
    {
      "time": "17 Oct 2005 — 7:07am",
      "content": ":..are the alts the same width as the letters they replace?\"\n\nThe S and s is the same width but the g is a bit narrower. It takes a bit more space to fit the double bowled g. William suggested that I make it (and the \"a\") narrower anyway. The problem comes at smaller sizes. The g and a look too dark and tight when narrowed. At larger sizes, they can be narrowed without any problem. I will tinker some more and see what I can do with it.\n\nChrisL\n\n"
    },
    {
      "time": "17 Oct 2005 — 7:53pm",
      "content": "Doesn't FF Balance have the same widths throughout the four weights? That might be one to look at if you want to pursue it.\n\n"
    },
    {
      "time": "17 Oct 2005 — 8:05pm",
      "content": "Uniwidth is a great feature, but it tends to exert too much pressure (on the \"natural\" widths of the black bodies) on the outlying reaches of color. In the first version of Patria for example all four weights were uniwidth, but I couldn't get the Light to be tight enough without making the letterforms too wide and I couldn't get the Bold to be loose enough without making the letterforms too narrow. A good solution I arrived at was to leave the Regular and Demi uniwidth, but make the Light/Bold spaced tighter/looser by a fixed amount (tracking +/-10) thus giving the user an easy way to force uniwidth if desired.\n\nhhp\n\n"
    },
    {
      "time": "18 Oct 2005 — 6:08am",
      "content": "\"...tighter/looser by a fixed amount (tracking +/-10) thus giving the user an easy way to force uniwidth if desired.\"\n\nSounds like a good solution Hrant. As long as you let your users know how it worked. Perhaps a \"read me\" note was bundled with it?\n\n\"Doesn’t FF Balance have the same widths throughout the four weights?\"  \nKris, I'll take a look at it, thanks.\n\nChrisL\n\n"
    },
    {
      "time": "19 Oct 2005 — 6:13pm",
      "content": "I have just added an updated PDF of my fake magazine. I redid the initial page using the alts and added 2 more pages with BIG type to satisfy Terry:-)  \nThe last 2 pages are the same except the final page uses the alts.\n\nChrisL\n\n"
    },
    {
      "time": "20 Oct 2005 — 10:18am",
      "content": "did you get your \"rri\" problem sorted out? can you show us how you're coding this and maybe we can help.\n\nif you want two alternate r's before the i, there are a couple ways you could do this\n\nfeature calt { # contextual alternate  \nsub r' r [i j] by r.alt;  \nr' [i j] by r.alt;  \n} calt;\n\nor\n\nfeature calt { # contextual alternate  \nsub r' [i j] by r.alt;  \nsub r' r.alt by r.alt;  \n} calt;\n\ni'm not sure if one of these is preferred over the other, but it it were me, i think i'd pick the first. hope this helps...\n\n"
    },
    {
      "time": "20 Oct 2005 — 2:48pm",
      "content": "Paul,  \nYours is one permutation that I did not try. I tried (individually):\n\nsub rr’ [i j] by r.alt;  \nsub r'r’ [i j] by r.alt;  \nsub r'r\" [i j] by r.alt;\n\nThanks Paul, Let me give yours a try\n\nChrisL\n\n"
    },
    {
      "time": "20 Oct 2005 — 3:37pm",
      "content": "Paul,  \nI just tried your script. The first one works GREAT!!!  \nSee my most recent attached PDF file above called \"PaulTerrific.pdf\"\n\nTHANKS!!!\n\nChrisL\n\n ![](http://web.archive.org/web/20150123031539im_/http:/typophile.com/files/thanksCowboy.jpg)\n\n"
    },
    {
      "time": "21 Oct 2005 — 7:47pm",
      "content": "I have worked on the metrics to equalize the 3 weights so that they truly \"Align\" so I posted above a new 2-page PDF showing a column of text in each weight in both lower case and small caps. The file is named Align\\_3weightAlign.pdf\n\nChrisL\n\n"
    },
    {
      "time": "21 Oct 2005 — 11:57pm",
      "content": "It seems as if a rectangle dot for the 'i' glyph would be more appropriate. Or possibly a dimond dot?\n\n"
    },
    {
      "time": "22 Oct 2005 — 7:08am",
      "content": "\"It seems as if a rectangle dot for the ‘i’ glyph would be more appropriate. Or possibly a dimond dot?\"\n\nHi Kyle, thanks for the input. I actually started out with a square dot and felt it was too similar to the rest. Since all the strokes are so rectalinear, i thought it would be good to oppose them with a \"Dot-Line\" treatment (kinda' Morse Code :-). As the weights get bolder, you may notice that the dots get more square. I needed to hold the weight within the narrow space so that was my compromise.\n\nChrisL\n\n"
    },
    {
      "time": "22 Oct 2005 — 4:03pm",
      "content": "OK Terry,  \nHere is a TASTE of BIGGER! You will have to download the PDF to get the FULL affect :-)\n\nChrisL\n\n ![](http://web.archive.org/web/20150123031539im_/http:/typophile.com/files/BIGgizmos.jpg)\n\n"
    },
    {
      "time": "25 Oct 2005 — 8:29am",
      "content": "I like the alt g, I just think the hook should be a little shorter under the bowl. (Man, am I picky!) I'm so used to the original \"g\" now it really doesn't make me any difference. :) Good show!\n\n"
    },
    {
      "time": "25 Oct 2005 — 11:03am",
      "content": "\"I’m so used to the original “g” now it really doesn’t make me any difference. \"\n\nThis is what happens with type, when you first see something odd to you, you get an itch for what you are used to. Then you get used to it and say, \"G-whizz, I wonder what all the fuss is about!\"  \n:-)\n\nChrisL\n\n"
    },
    {
      "time": "25 Oct 2005 — 1:00pm",
      "content": "But that's when the pertinence of a novelty moves \"down\" from the  \nconscious to the subconscious layer - never simply disappearing.\n\nhhp\n\n"
    },
    {
      "time": "25 Oct 2005 — 2:21pm",
      "content": "\"But that’s when the pertinence of a novelty moves “down” from the  \nconscious to the subconscious layer - never simply disappearing.\"\n\nI don't mean that it disappears. I think it just takes its place in your personal reference of acceptable syntax. It seems what is happening in this rapidly exploding world of new fonts every day is that our vision of acceptable syntax is growing much more quickly than ever possible before. This is a good thing.\n\nChrisL\n\n"
    },
    {
      "time": "25 Oct 2005 — 2:31pm",
      "content": "\\> it just takes its place in your personal reference of acceptable syntax.\n\nBut what it does to our subconscious is:  \n1) Subvisible.  \n2) Not necessarily good.  \n3) Beyond our control.\n\nWe are neither programmable chips nor imaginary ethereal beings.\n\nhhp\n\n"
    },
    {
      "time": "25 Oct 2005 — 5:23pm",
      "content": "Well Hrant, and who tells our subconscious which is the \"standard model\"? I think that a \"g\" like this one or like the one in Quadraat are not that odd.\n\nHéctor\n\n"
    },
    {
      "time": "25 Oct 2005 — 5:28pm",
      "content": "\\> who tells our subconscious which is the “standard model”?\n\nNow that's a good question.\n\n\\> ... not that odd.\n\nI didn't say they were.\n\nhhp\n\n"
    }
  ]
}
