{
  "id": "15647",
  "title": "the high price of type",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Typophile community -- please help me defend your craft!\n\nRecently, in a local group of designers, a hot debate arose. (It should be noted that many of these are freelancers with small business clients.)\n\nTo make a long story short, there was much complaining about the high price of font licenses. Praise of using freebie fonts over expensive foundry fonts and under the table file sharing seemed to be the norm in this group. There was speculation as to \"how hard is it really to make a font\" (which was more-so in respect to digitizing one of the 'classics' rather than designing an entirely new typeface.)\n\nAs a graphic designer, this discussion really bothered me. However, I found I had no concrete ammo to back my side of the argument -- which is, you pay for _quality_ and a lot more goes into type design than one would think. But not being a type designer, I couldn't say for sure how many hours it might take to \"redraw Caslon\" or why Adobe and ITC charge hundreds of dollars for font family licenses.\n\nNext time this topic comes up, I want to be prepared. Any info is greatly appreciated.\n\n",
  "author": "engelhardt",
  "time": "14 Oct 2005 — 12:46pm",
  "uid": "9720",
  "comments": [
    {
      "time": "14 Oct 2005 — 12:50pm",
      "content": "I think most people would have to try to make/finish a font -not to  \nmention get people to buy it- to realize that prices are actually LOW.\n\nhhp\n\n"
    },
    {
      "time": "14 Oct 2005 — 12:58pm",
      "content": "do you/they know any freebie plumber? car? house?\n\n"
    },
    {
      "time": "14 Oct 2005 — 1:05pm",
      "content": "They also cited not being able to convince clients to pay for the purchase of a new font if a freebie (or previously purchased) one is available -- even if it is lesser quality or not as appropriate for the design.\n\n"
    },
    {
      "time": "14 Oct 2005 — 1:06pm",
      "content": "My friend Mike explains to a client about the cost of a logo: \"It took 20 years experience to create this logo.\" Its not how long it takes to create the glyphs (physically) its the \"x\" years of experience to get to the point where you can create the glyphs.\n\n"
    },
    {
      "time": "14 Oct 2005 — 1:10pm",
      "content": "Using fonts with quality spacing and a full compliment of extras can save the graphic designer time -- huge amounts of time in a text heavy project like a magazine, newsletter, or book. That means a lower cost for the client and a quicker turnaround. In the long run, good fonts pay for themselves.\n\n"
    },
    {
      "time": "14 Oct 2005 — 1:11pm",
      "content": "As I told my mother-in-law (non-designer): a bulk of the work that goes into a good text face is not the letters, but the spaces between them. If you never think about the spacing of the type, then the designer did a good job. Ask them how hard it is, really, to draw and design a logo. I mean, the client gives them most of the answers and the logo's so simple.\n\nRight?\n\nOf course not. As for the hours involved: people I've spoken two can spend 8 hours on a few characters. Seriously, I surprised that working professional designers are even debating this. Do they not know what it's like to have people completely undervalue and hard-to-explain process? Any font's cost can be built into a job, or over the course of multiple jobs if they dont' want to charge outright.\n\nSeriously, those people need to grow up. Do they steal their photography too?\n\n"
    },
    {
      "time": "14 Oct 2005 — 1:14pm",
      "content": "I've made it a policy to _always_ be up front about fonts and how much they cost. I only look to freebee fonts if I need something that's very visual/novelty/display oriented. They're shooting themselves in the foot if they lead off with \"Well, this font that costs $300 is great, but if you want I can find a free one that's not as good\". Sounds like the problem is client relationship management and managing expectations.\n\nYou get what you pay for.\n\n"
    },
    {
      "time": "14 Oct 2005 — 1:29pm",
      "content": "\\>Recently, in a local group of designers, a hot debate arose.\n\n...was this online, or in a meet-up type environment? I'd like to think it was in the basement of an old-school printers office in the industrial part of St Louis, where designers meet once a month to drink whisky, smoke smuggled-in Cubans etc., But I'm likely wrong.\n\nReason I ask is that you'd likely be able to find a local type designer to come in and give a talk on what it takes to design a font. That would serve to educate the graphic designers as to the process, and might even lead to custom work for the type designer.\n\nCheers, Si\n\n"
    },
    {
      "time": "14 Oct 2005 — 1:51pm",
      "content": "This comes up with me \\*all the time\\* when I'm teaching typography. After suffering the same inarticulate frustrations as you, I end up getting into some rather arcane details re the time spent with kerning pairs, hinting (which I am practically making up as i go along), bezier curves and all sorts of shit that they're too young to know, but with which they are quite impressed.\n\nOne of the things i do is show them some screen captures from FontLab of the character sets and outlines of free fonts vs. a good commercial font. I tell them how many free fonts contain incomplete character sets, and how many of them are quickly and roughly autotraced, and i zoom in on the horrors of hundreds of twisted bezier points. Then I show them some breathtaking outlines from e.g. Ross Mills' Plantagenet and go on and on about how much time it takes to make that perfect, and how when you print these at large sizes you can see the beauty of the curves blah blah blah.\n\nI also warn them that poorly constructed fonts can cause Postscript errors (which may not even be true), acne and heart disease.\n\nI also encourage them, if they must use free fonts (and poor wee students always do), to go to good font designers' sites (of which i provide them a list), and try some of the free fonts they have on offereing which are either \"teasers\" or sometimes abandoned projects, but bound to be better constructed than what they might find at zang-o-fonts or whereverthehell they're picking up this shit.\n\nHow truthful any of this is undoubtedly debatable, but I too would appreciate a little more weaponry in this crusade of explanation.\n\nIncredibly, a student recently noted the poor spacing in the free font they used for a headline, and the time they spent to fix it.\n\n-marian\n\n"
    },
    {
      "time": "14 Oct 2005 — 2:00pm",
      "content": "What is a current hourly rate for plumbing?  \nWhat is a current hourly rate for graphic design?  \nWhat is a current hourly rate for flipping burgers?  \nWhat is a current hourly rate for typeface design?\n\nGuess what order the hourly rate would be in with the highest on top?\n\nThe above order is about right.\n\nChrisL\n\n"
    },
    {
      "time": "14 Oct 2005 — 2:08pm",
      "content": "\\> spend 8 hours on a few characters.\n\nOr **one** character. That in fact has been the top end of time-per-glyph  \nsince the coldmetal days. And it's been my average on Maral and Mana-16.\n\nhhp\n\n"
    },
    {
      "time": "14 Oct 2005 — 2:19pm",
      "content": " **Quoting sii:**  \n<cite>…was this online, or in a meet-up type environment? I’d like to think it was in the basement of an old-school printers office in the industrial part of St Louis, where designers meet once a month to drink whisky, smoke smuggled-in Cubans etc., But I’m likely wrong.</cite>\n\nOh, geez. I'm likely to get my butt kicked out of my little local group now, aren't I?\n\nTo answer the question: both. It was an on-line discussion in preparation for a meet-up which hasn't happened yet. But no dark smokey rooms -- just the coffee bar at Borders in posh West County. (Though whisky would be a great addition!)\n\nHm... I think there would be a lot of value in finding a 'guest expert' on the topic. Unfortunately, I don't know any local type designers, which is why I turned to Typophile.\n\n"
    },
    {
      "time": "14 Oct 2005 — 2:28pm",
      "content": "If free fonts are so great, why are they complaining at all?\n\nI look at it this way. A sheet of Letraset dry transfer lettering cost about $6.00 in 1980. That's about $15.25 in 2005 dollars. A digital font typically costs about twice that. Let's compare value:\n\nUseful life  \n&nbsp;&nbsp;&nbsp;Sheet of Letraset: Useless as soon as you run out of a character you need.  \n&nbsp;&nbsp;&nbsp;Digital font: Indefinite as long there is operating system support; never run out\n\nFlexibility  \n&nbsp;&nbsp;&nbsp;Sheet of Letraset: Limited to one size; can be enlarged or reduced with generational loss  \n&nbsp;&nbsp;&nbsp;Digital font: Infinitely scalable with no loss of quality\n\nCharacter set  \n&nbsp;&nbsp;&nbsp;Sheet of Letraset: 100 or so characters, depending on font; larger number means you run out of individual characters sooner  \n&nbsp;&nbsp;&nbsp;Digital font: Over 200\n\nAvailability  \n&nbsp;&nbsp;&nbsp;Sheet of Letraset: About 400 fonts in 1980; popular fonts were often on back order at dealers  \n&nbsp;&nbsp;&nbsp;Digital font: Over 30,000 commercial fonts in 2005; fonts can be downloaded and used minutes after purchase and are never out of stock\n\nEase of use  \n&nbsp;&nbsp;&nbsp;Sheet of Letraset: Spacing and alignment depend on skill of user; slow process  \n&nbsp;&nbsp;&nbsp;Digital font: Spacing and alignment are automatic; as fast as typing\n\nSpecial effects  \n&nbsp;&nbsp;&nbsp;Sheet of Letraset: Dependent on mechanical manipulation or special photographic equipment  \n&nbsp;&nbsp;&nbsp;Digital font: Unlimited digital effects and manipulation possible\n\nBack in 1980, designers happily paid for sheets of Letraset, even with its numerous practical limitations. We're talking cheap designers for the most part. If you had a budget, you sent out for type at a much higher price.\n\nFor about twice that price (taking into account inflation), digital type is many times more than twice the value.\n\nPerhaps it's not fair to compare digital fonts to Letraset sheets. What about fonts for typesetting machines in 1980? First, you need a typesetting machine, which was $5,000-$10,000 for a low-end model ($12,500-$25,000 in 2005 dollars). A font for a low-end typesetting machine was roughly $75 (and you usually had to buy them four at a time because of the way the machines worked) which is about $190 in 2005 dollars.\n\nNo matter how you look at it, digital fonts are a better value than any previous format, even at twice the typical price. True, the development costs are lower, too, but it still takes considerable time and effort to create a good quality font. In any case, it's not the development costs that determine the price people are willing to pay.\n\nThe availability of free fonts is the only reason people are complaining about the price. If they can't tell the difference, what's the problem? They should just use the free ones. If they can tell the difference, then it should be obvioius why good fonts are not free.\n\n"
    },
    {
      "time": "14 Oct 2005 — 2:34pm",
      "content": "True story:\n\nI was asked to typeset a job for a major organization; not design it, just set it. I finish the 175 pages of text, using the freeware grunge typewriter font they've provided for heads and subs. The body is set in Times.\n\nAnd now, they say, we need it set in French. Ok, I say, but wait: there's no extended characters in this font. \"What can we do? The English is already set.\"\n\nA day is lost, then I edit the font, adding the accents needed to set French, and I bill them for the work.\n\nIf they had begun with say, FF Trixie Plain, it would have cost them $40, and they would have something better than my hacked together accents.\n\n"
    },
    {
      "time": "14 Oct 2005 — 2:44pm",
      "content": "Good thing it was only French. If it had been CE, you would have had a much bigger job.  \nPenny wise and pound foolish is the sad state we live in.\n\nGee, I can get a butcher to do my gall bladder surgury. He charges by the pound. Those damn surgeons charge WAY too much. I'll bet I can even get a kid learning to be a butcher to cut me open for free? Maybe I will just hang out in East St Louis bars and some thug will just cut me open right then and there with no appointment needed and no forms to fill out?\n\nChrisL\n\n"
    },
    {
      "time": "14 Oct 2005 — 3:21pm",
      "content": "Another way to look at it:\n\nIf font prices were too high, not enough people would be willing pay them and the commercial foundries would go out of business.\n\n"
    },
    {
      "time": "14 Oct 2005 — 3:41pm",
      "content": "There is no converting a designer who would quibble about the price of a font be it digital or metal. There is no need to rationalize about the many many hours and days that go into the fitting of a font, or into the kerning pairs of same.\n\nMy respose is that here is no longer anything in this world that is cheap that is also any good. There are cheap and free fonts out there for those who put no more value on a good tye design than they do a bad one; so the bad ones are there for the bottom feeders to use.\n\nThis whole \"how cheap can I get it?\" attitude has discouraged me to the point that I don't care if I ever design digital font again.\n\nIf this seems whiney: tough! I've had it with people who claim to appreciate type nearly to distraction but won't drop a few bucks to use it. I have had students approach me with packages of more than 1000 fonts that they got for $29.95. They are invariably crappy work.\n\nAnd now I don't know if I can post this or not, but here goes . . .\n\nJim\n\n"
    },
    {
      "time": "14 Oct 2005 — 3:50pm",
      "content": "Bonafide graphic designers should definitely be slapped around for even suggesting such a thing, but the student problem is an ongoing issue. They have not yet learned to tell the difference between \\*\\*\\*\\* Times Roman and Galliard, let alone the subtleties in spacing and kerning. They can't even spot fake bolds or italics, and when I demonstrate the evils of squishing and squashing type they look at each other like \"I can't see the difference, can you see the difference?\". Jesus H. Christ! Explaining what you get from a \"good\" font is a hard sell, and believe me the \"why, in \\*my\\* day ...\" argument doesn't cut it with them.\n\nI send them to sites like this, and wherever useful discussions about type are taking place (and i will probably send them to this thread), and mostly they just think we're all \\*\\*\\*\\* mad (when my teaching succeeds, they join the madness).\n\nTo be honest, in some ways perhaps the most compelling argument for budding, fashion-conscious designers might be that \"The more expensive a typeface is, the more exclusive it is. It's like Armani or Valentino.\" Shit. That, they would understand.\n\n[I see this is a clean, family-oriented forum, sans swearing. Jus' testing that out.]  \n-marian\n\n"
    },
    {
      "time": "14 Oct 2005 — 3:53pm",
      "content": "Not a Christian forum tho'. Interesting.  \n-marian\n\n"
    },
    {
      "time": "14 Oct 2005 — 3:53pm",
      "content": "engelhardt,\n\nI go through this everyday as a design student. Having taken the oppurtunity to design my first face this year I understand the blood, sweat, and tears that are poured into a type design. Not only am I surrounded by students who think I'm the crazy one, because I pay for fonts that they pass around to each other, but also teachers that do the same thing in the professional world. I'm actually launching a \"Say NO to font piracy\" campaign at school.\n\n"
    },
    {
      "time": "14 Oct 2005 — 3:56pm",
      "content": "They would not be speculating how hard it is to make a font if they were not using poorly crafted freebies in the first place.\n\nHow much do these freelancers charge for their services? How do their hourly rates average out? Now, how long would it take for them to create the fonts they are using? It's going to be far more than any font licensing fee.\n\n"
    },
    {
      "time": "14 Oct 2005 — 3:56pm",
      "content": "\\> there is no longer anything in this world  \n\\> that is cheap that is also any good.\n\nGood point, although I wouldn't say \"world\". Just outside \"civilization\" there's a real world where you can find good cheap stuff now and again. Like my favorite falafel joint (in 'Aaisha Bakkaar, Beirut) or the custom backgammon set woodcarvers in Yerevan.\n\nhhp\n\n"
    },
    {
      "time": "14 Oct 2005 — 4:04pm",
      "content": "There you go again, Hrant... always with the falafel and backgammon.\n\nBut that brings up a good point. Even in within the font market, prices are different. I've found that Londoners tend to jack up their prices. Minnesotan prices are perhaps more affordable. (a generalization) But cost of living does come into play, even in font design.\n\nHmmm... another topic altogether? \"Global Economics and the Rising Costs of Digital Fonts\"?\n\n"
    },
    {
      "time": "14 Oct 2005 — 4:12pm",
      "content": "In fact I'm a believer in having different pricing depending on the <cite>customer</cite>.\n\nhhp\n\n"
    },
    {
      "time": "14 Oct 2005 — 4:18pm",
      "content": "i say if they want to use true \"free fonts,\" let them. but file sharing is just wrong. how do you think they'd like it if _their_ clients stiffed them for their design services?\n\n"
    },
    {
      "time": "14 Oct 2005 — 6:06pm",
      "content": "\"how do you think they’d like it if their clients stiffed them for their design services?\"\n\nThe trouble is, that it is a lot harder to \"share\" a logo design. After all, type is just a bunch of letters.  \nIt was lot tougher to \"share\" in the hot metal days. In those days you would at least get a hernia for your efforts :-)\n\nChrisL\n\n"
    },
    {
      "time": "14 Oct 2005 — 6:22pm",
      "content": "I sense a shakeout in design. What we need though is a demand for good design. I suspect those that can't afford a font or sell one to a client for that matter won't be around long. Myself included. I have some lame clients and their image blows because they wouldn't have it any other way. I just try to transition to better clients and assume that those that can't see to take advantage of what I can do can't last asl long as me. Those clients get cheap or free type, I'm sorry to say. Theft is just that though, and designers do get ripped off as well.\n\n"
    },
    {
      "time": "14 Oct 2005 — 6:30pm",
      "content": "The shake out is in progress. Design is the new acting. Many more students than jobs. You want fries with that?\n\n"
    },
    {
      "time": "14 Oct 2005 — 7:10pm",
      "content": "Do Lauren's fellow St Louis designers fall into this boat? By attending the meet-up aren't they trying to rise above this? They're seeking the knowledge, even if they're not yet true believers. Are they worth reaching out to?\n\nIs there not a font preacher in the area who can reach out to the unencoded? Can I get an amen?\n\n"
    },
    {
      "time": "14 Oct 2005 — 9:35pm",
      "content": "_[I see this is a clean, family-oriented forum, sans swearing. Jus’ testing that out.]_\n\nWhat the fuсk you talkin'bout?\n\nHomographic swearing: another reason to love Unicode. :)\n\n"
    },
    {
      "time": "14 Oct 2005 — 11:10pm",
      "content": "John -- hahah, I was actually thinking about doing the same thing... then I scroll down and see your post. ;)\n\n"
    },
    {
      "time": "14 Oct 2005 — 11:32pm",
      "content": "I'd steer clear of a tent revival, but I also promised myself to steer clear of intoxicated cussing fits on Typophile. (It's embarrassing to wake up to the day after.)\n\nUntil the 'unencoded' are typographically smothered by their excessive font library or are finally enlightened by some mystical, personal encounter with good type design, I'd say leave them on their prodigal paths. We learn best by our mistakes. Lord knows we've all had to use some pathetic ones. Made me want to design my own.\n\n"
    },
    {
      "time": "15 Oct 2005 — 1:07am",
      "content": "Just pick up the nearest bottle to hand & swing, Swing like you never swung before in your life. Then smile the smile of the just & the righteous. A bit too much Nick Cave I suppose...\n\n"
    },
    {
      "time": "15 Oct 2005 — 4:15am",
      "content": "<cite>What is a current hourly rate for flipping burgers?<br>\nWhat is a current hourly rate for typeface design</cite>\n\nSorry, friends, you are missing the point. Do you ever consider how long it took a musician to write a song? Or Picasso to paint a picture? If it was all based on hourly rates, all books, songs, photographs and certainly fonts would be free once the originator had his investment in time and materials back (plus marketing & distribution expenses). Those items would thus only cost the price of production like printing and CD-copying etc.\n\nOf course this is rubbish. Things are worth what they contribute. A song or a painting only  \ncontribute happiness, culture, esthetic pleasure, but we’re willing to pay for them. (Leaving aside speculation like the art business here) If a designer uses paper, he needs to buy it. Same for inks, pens and other materials. A font costs between 29 and 49 dollars, but you can use it over and over (thanks, Mark, for the Letraset comparison), and it generates wealth for the client and the designer. It makes a piece more desirable, more legible, more functional. If we didn’t need more type, there wouldn’t be any. And if clients don’t want to have 49 dollars added to the bill, they’re not clients, but leeches.\n\nThe only problem I see is the risk of buying a family for, say, 100 dollars and not getting to use it. For a small studio, that can quickly add a few hundred a months in speculative font expenses. So, if you’re a bona fide designer and have a record of paying proper licenses and also getting you clients to pay for theirs (that’s where the money is for type designers), talk to you favourite font supplier. They may give you an open CD with a lot of fonts on it plus a contract. That’ll state that you agree to buy a license once any of these fonts ever get used in earnest, i.e. in a publication in whatever medium. If you honour the trust invested in you, you’ll get to use thousands of fonts for you presentations, for your own experiments and research, but you only get to pay for them once you get paid. We all know that we only use the fonts we have on our hard drives, at least until we know what we want, typographically speaking. That’s why some of us would even consider looking at freebies.\n\nAnd finally: my rule of thumb is 100 hours per weight. So an average family these days with 12 weights (some of which, like small caps, may be less work) would take you at least 800 hours, i.e. 20 business weeks or 12 normal designer weeks. It takes a lot of 100 dollar sales (of which designer normally get around 20% if they don’t do their own distribution) to pay for that time, even at modest rates. And out of the 30,000 or so fonts I am just editing for the new FontBook, not even 5% ever pay their designers that investment back.\n\n"
    },
    {
      "time": "15 Oct 2005 — 4:17am",
      "content": "<cite>The trouble is, that it is a lot harder to “share” a logo design</cite>\n\nAnd as Quark found out, it is usually spotted quickly.\n\n"
    },
    {
      "time": "15 Oct 2005 — 6:07am",
      "content": "Erik,  \n\"not even 5% ever pay their designers that investment back.\"\n\nThat was exactly my point when I compared hourly rates of burger-flippers to Glyph-grinders. The title of the tread is \"The High Price of Type\" and the sub-question was \"what is so hard about designing it anyway\".  \nThe \"Leeches\" you spoke of don't care any more about \"what they [typefaces] contribute\" than they do about \"hourly rates...\". A vulture is a vulture, feeding on decay.  \nThe sad truth is that most small, beginning design offices have to put up with all manners of clients to survive. It is a rare designer who gets to pick and choose clients. I am glad to see that your suggestion about \"open disk\" will at least allow them to pick and choose type by merit rather than if they already own it. This is a win-win situation for foundries as well as graphic design offices. The less-than-stellar clients may not recognize the value no matter how you phrase it but at least the designer can feel they did the best job they could with the design.  \nBravo Eric, I hope other font houses will follow your lead on this.\n\nChrisL\n\n"
    },
    {
      "time": "15 Oct 2005 — 7:26am",
      "content": "I think a valid point is the fact that sometimes you buy a font and don't get to use it. During two projects I recently bought Bryant and Delicato and it turned out both didn't work for the respective jobs. Notbecause the clients disliked them but because once used in the real document, I didn't like the final look. It just didn't fit, it wasn't what I thought it’d look like. So... While I figure that maybe I'll get to use them some day, it still was pretty frustrating, and again I found that you can't judge a font by looking at it online, be it PDF or even a typesetter-tool. The only way to judge it is to work with it on a job, print some stuff and SEE first-hand if it works in context.\n\nApart from that, I don't think fonts are too expensive. While the collector in me wants to have them all, to have maximum choice, and while as a small bureau it's indeed a factor that you cannot just buy a new typeface for some low-budget-jobs, no maztter how much you'd like to, I still almost never feel ripped off by most foundries. There are exceptions, such as TEFF, but all in all, I think there is a large collection of fonts that are available and at 200-400 € for a family don't feel overpriced at all. Especially if they're OTF.\n\nHD Schellnack\n\n"
    },
    {
      "time": "15 Oct 2005 — 8:45am",
      "content": "First of all -- **thank you** everyone for your insight! This has become a great discussion.\n\nSecondly -- I feel somewhat compelled to defend my fellow St Louis designers who sparked this conversation. I'd hate you to think we're all a bunch of uneducated, font-pirating, middle-American back-woods hacks. There are a lot of talented people in this group, which is all the more reason why this debate got under my skin.\n\nThat said... someone on the \"other side\" of the argument brought up this point:\n\n<cite>If fonts were more affordable (in this case, it was implied that would mean just a few dollars per typeface/weight), they would sell to more people. Therefore, type designers would make more money by selling at a higher volume. This theory suggests that they are the ones taking money away from themselves by making their product too exclusive.</cite>\n\nWhat do the industry insiders think of this theory?\n\nAlso, the question came up of why \"classic,\" \"public domain\" typefaces (like Garamond, Caslon, etc) are still charged at a premium price when the original designers are now long-dead. (Well... _I_ know that _someone_ had to digitize that font -- but for argument's sake, there's the question that was posed).\n\n"
    },
    {
      "time": "15 Oct 2005 — 9:51am",
      "content": "The more volume argument has limitations. There is a finite market for fonts. This is not a broad consumer market. What would happen is the number of sales would double but the amount of money the font designer gets would drop to 20% of what they get now. My argument is that fonts are already very cheap and have come down a lot in recent years. The amount of piracy has increased though so there is no gain for the type designer.\n\nChrisL\n\n"
    },
    {
      "time": "15 Oct 2005 — 10:07am",
      "content": "\\> Also, the question came up of why “classic,” “public domain” typefaces (like Garamond, Caslon, etc) are still charged at a premium price when the original designers are now long-dead.\n\nStating the obvious. In a way doing a high-quality revival of a typeface where a lot of competition already exists is harder than doing an original design. You have to bring something new to the table. That might include going back to original source material and doing a truer version, or it might mean adding weights, styles that didn't exist originally, or it might mean adding bells and whistles that the competition doesn't have. Compare old Adobe Garamond v Adobe Garamond Premier Pro and on glyph count along I bet the new version is better value for money - and the OpenType features makes it much more powerful.\n\n"
    },
    {
      "time": "15 Oct 2005 — 11:48am",
      "content": "\\>In a way doing a high-quality revival of a typeface where a lot of competition already exists is harder than doing an original design.\n\nFull reply:\n\nI have to disagree with the philosophy you're expressing, which measures the value of design in quantitative terms, thereby supporting the price-carpers: If a font is going to be valued for the number of features it contains, and the user get similar high-quality features free with bundled InDesign/Mac/MS fonts, than any price is going to seem too expensive.\n\nIt is a mistake to value a restyling of a classic as much as an original design.  \nCertainly, it can take as much work to do a revival as an original, but that begs the question of the value of the kind of work involved -- it suggests that original design is undervalued in relation to production work and revivals.\n\nHow to overcome the perception that computer designed work is not worth much because it's mere technical grunt labor? Or stuff any kid could do with the right software? Not by apologetically rationalizing prices, explaining all the skilled technical effort involved, because you can always get that kind of labor cheaper, or diluted to nothing in a multi-national's commodity.\n\nIf you must, charge a premium price for giving an old whore a facelift, with all the OpenType deelybobs, but also demand top dollar for a staggering new work of genius even if it's only available in good old Type 1.\n\nShort version;\n\nPay up, it's f\\*\\*\\*\\*\\*\\* brilliant.\n\n"
    },
    {
      "time": "15 Oct 2005 — 1:51pm",
      "content": "Nick,  \nI really like the short version:-)\n\nChrisL\n\n"
    },
    {
      "time": "15 Oct 2005 — 3:09pm",
      "content": "Nick, is your marketing strategy working?\n\nI just wonder if the outreach/education work people like SoTA, the TDC, the Type Club of Toronto, the Typographic Circle etc., do make their host cities (Toronto, London, NYC) better places to sell type - it seems as if you feel these efforts are a waste of time.\n\n"
    },
    {
      "time": "15 Oct 2005 — 3:15pm",
      "content": "The line that divides Whores from Ladies is  \nnot age, but whether it's for Display or Text.\n\nhhp\n\n"
    },
    {
      "time": "15 Oct 2005 — 3:28pm",
      "content": "I am not sure if this point has already been raised, but maybe the issue isn't the cost of fonts, but that so many are available free packaged with software.\n\nIt seems to me that people complain about the cost of fonts because they assume they are free, like Comic Sans, Times and Arial.\n\nComic Sans, Times and Arial are NOT free, but because they are bundeled in with the cost of the software, that is the impression designers (and lay man) have.\n\nBut this attitude of not wanting to pay for fonts is typical of designers (especially the small, freelance types, of which I am one). They also don't like to pay for photo and illustration rights, nor software. If computers were clonable, you can bet freelance designers would be copying them too!\n\nWhy? Becasue it is terribly hard to make money as a small, freelance designer.\n\nBut what these individuals don't think about, is what this attitude is doing to the design industry! By not supporting the rest of the industry, these desigers will some day find themselves all alone, trying to defend the cost of design in front of their client, when the client is asking why his secretary can't do the same job with Office and some free MS Fonts...\n\nIn a way, the cost of fonts helps give a designer a reason to charge a real price for his work. And the designers appreciation of the finer points of a well-designed font is what makes him worth the money.\n\n"
    },
    {
      "time": "15 Oct 2005 — 3:37pm",
      "content": "I noticed there was a comment on sometimes buying fonts and not using them in the end.\n\nI have had this frustrstaing exepriece on occasion (most recently with H&FJ's Gotham, imagine!). It happens, but I have never regreted it.\n\nWe have gotten into the habit of adding about 150$ to our price estimates for buying a font, even if we won't necessarily use it for the project. That way, we are able to exapnd our font library without feeling that we are cutting into our overhead, and the more contracts we have, the more fonts we can buy! (We don't indicate that we will be buying a font to the client, it is an internal thing, if you will)\n\n"
    },
    {
      "time": "15 Oct 2005 — 4:01pm",
      "content": "_ut this attitude of not wanting to pay for fonts is typical of designers..._\n\nThen let them draw their own letterforms, do their own spacing and kerning, take their own photos, draw their own illustrations and if they want to keep saving, they should build their own computers and write their own sofware while their at it! If they had to do these things, do you think they'd bitch about having to pay $39 for a font???\n\n"
    },
    {
      "time": "15 Oct 2005 — 4:24pm",
      "content": "<cite>If fonts were more affordable (in this case, it was implied that would mean just a few dollars per typeface/weight), they would sell to more people</cite>\n\nPeople who use this argument cannot possible make a living as designers themselves. Do they only charge whatever they need by dividing your living expenses into the hours you can work? And forget about new equipment, software, rent, the times you do not work? Designers who sell through publishers get 20% from the retail price, the rest is spent on marketing (who do you think pays for websites, booklets, support, OT conversions etc?), production, retail discounts (that’s usually 50%), and – mainly – those fonts that never sell or hardly. Like everywhere else, 80% of revenue comes from 20% of the products, but everybody wants to be able to choose from thousands of them.\n\nAnd why should revival fonts be any cheaper than new ones? Are books by Shakespeare any cheaper than those by contemporary authors? Book publishers also make their money with a few bestsellers which support all the unknown names. Would we want to do without these? And only have Helvetica, Garamond, Bodoni and a few others? Those could be cheap, because there is no license to pay and no advertising to make them known. The same designers who complain about 29 dollars for a font would be the first ones to complain about lack of choice. I knew a system like that once: it was across the Wall here in Berlin and called East Germany. As a designer, you were told what to design and when, what typefaces to use, what paper to print on and how much you could charge. And if the state didn’t think you fitted in as a designer, they would send you into a factory. For those who liked a non-risk life, this was great. The others ran away into the West or took to the streets until the Wall came down.\n\n"
    },
    {
      "time": "15 Oct 2005 — 10:06pm",
      "content": "One thing that does bother me though (aside from not knowing John's fancy tricks for swearing online), is the aspect of not being able to test-drive before buying a font.\n\nYes, most websites have some sort of preview/tester/engine thingy, but all the ones i have seen will test only a few words at a large-ish size. Great if you're thinking of using it for display but most of the time I'm buying for text usage, and I can't tell you the number of times I've bought a font thinking it was exactly what I was looking for, only to find that set as text, it's not giving the flavour I had in mind. Buying fonts you never use really is upsetting. That, I have to admit, is a major deterrent for me buying fonts. (Do I resort to piracy? No, I just use the same ones over and over and over.)\n\n-marian\n\n"
    },
    {
      "time": "15 Oct 2005 — 11:55pm",
      "content": "_Design is the new acting. Many more students than jobs. You want fries with that?_  \nThat is my reality, and many other people I know.\n\n"
    }
  ]
}
