{
  "id": "15676",
  "title": "A Lurker's First Face",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hello. I've been lurking here for a while, and having recently decided to post replies, I've finally decided to post a font of my own. This one is approximately an Aldine, with a certain Palatino/Aldus influence, in roman and italic. The spacing is a work in progress and I haven't even begun to hint it, but the letter forms are complete enough for a decent critique. It's a text face, and it seems to work well in small sizes and on-screen. All comments are welcome. Thanks.\n\n| Attachment | Size |\n| --- | --- |\n| [lurker.pdf](http://web.archive.org/web/20150417082502/http:/typophile.com/files/lurker.pdf) | 20.65 KB |\n\n",
  "author": "jafo",
  "time": "16 Oct 2005 — 7:52am",
  "uid": "7370",
  "comments": [
    {
      "time": "16 Oct 2005 — 9:40am",
      "content": "pretty good for a first attempt, i must say. i think the most major concern is that a majority of characters feel out of balance: either they feel they are leaning back or leaning forward. I think some of this has to do with the modeling on your bowls of your round letters. some of this has to do with slightly wonky proportions. For exmaple, the b and p seem to have a forward and upward thrust on the bowl, whereas the c, d, e and q feel like they're being pulled back and toward the bottom of the letter. the f is a little shy for my tastes. the g has great potential! the tail of the g could be smoothed out a bit and maybe beef up that ear just a bit, and it'll be killer! h, i, j, l and m look good, but the k is out of whack. the m may be a bit too wide. did you make it with a doubled n? the arm of the r seems like it's going to snap off. the s is not so smooth. t, u, v, w, x: look good. the tail of the y is another week spot. give it a bit of oomph. and i'd completely start over on that z.  \nnow for the caps: the A is leaning backward. the C and G have a bad underbite. I'd rework the proportions on the E: the top bar is too much shorter than the bottom for my liking. the tail of the J is out of control! i'd tame it down just a bit. the leg of the K seems very weak. the M is not right. see how there's more white space under the left portion? try to even those out. the tail of the Q could be more elegant. the S definately leaning forward and again, not so smooth. the T looks too narrow to my eye. the arms of the Y seem imbalanced. and i guess i just don't like that Z form... the accents seem to be a bit sickly. make the accent/grave beefier, but maybe not so long. your dieresis and probably the dots on the i and j could all be bigger. and make that tilde sexy, tell it to eat something!  \nanyhow, i hope that helps without being discouraging. of course i should give a disclaimer that all advice from me should be taken with a healthy dose of salt. feel free to use or ignore any of the above suggestions to your own detriment. but honestly, i think this is a solid start with some great potential. keep up the good work!\n\n"
    },
    {
      "time": "16 Oct 2005 — 7:05pm",
      "content": "Quick response: Thanks for the encouragement and critique, and yeah, you're pretty much right... darn bdpq just refuse to play nice. Much to think about and do...\n\n"
    },
    {
      "time": "26 Oct 2005 — 7:16pm",
      "content": "Hi Jafo,  \nI think this is already both original and aesthetically coherent. No doubt you're working on it at the moment, and also going for a paler, more elegant look than I am with my own Aldine face\\*, but it might be worth bearing in mind that one tends to underestimate how much of each letter's area its smaller elements, and indeed serifs, have to occupy if it is to represent one's intentions at text sizes.\n\nI would also add to what Paul has said that the a, though nicely modelled on the bowl, might be a little too wide for this style. Perhaps the s too? f and especially t could want stronger bars to carry the eye along, and x is cross-eyed: you could extend the serifs outwards. Some caps, like G, are rather narrow for the expansive lowercase. V and W lean left pretty hard. And is there some Frutiger here as well as Griffo and Zapf, in the zippy c and f?  \nThis should be both lovely and usable when it's finished.\n\nGeorge\n\n\\*the New Improved Mamillius (q.v.)\n\n"
    },
    {
      "time": "27 Oct 2005 — 7:58am",
      "content": "Hey Mike,\n\nI disagree about bdpq. Those letters have the most vitality in your alphabet. They need not be mechanical copies of each other. Instead, consider how other round elements could harmonize with them. Can you remove the straight segment in the bowls of hmnu? Make the curves fuller?\n\nLook at all your diagonals; lowercase kvwy especially. Your round and vertical shapes (n,o) have much more contrast than they do. The k especially looks scrambled. Diagonals are very tricky; they look heavy when they are the exact same weight as verticals, but they can look too light if you take too much weight off. W will be most difficult to match in visual (not mechanical) weight.\n\nUnfortunately the slanted top right feature on the lowercase vertical stems is very apparent. It seems to be a straight segment. Please examine whether this has any purpose in your design. If you intend for this face to be useful onscreen and in small sizes, try to examine how certain elements might snag the reader's eye (loop of g, heavy horizontals of EF, excessive tail of J), and how some features need to be stronger to maintain texture (outstrokes of ceC, tails of RK). Especially for onscreen use, consider whch elements do not rasterize well.\n\nSpacing is intrinsic to a successful typeface, but primarily I think you need to focus on getting control of your lettershapes. Do not think about hinting at all until you have gone through the steps to harmonize the outlines, spaced it, and eventually kerned it, in that order. You're doing well. Please post updates.\n\n"
    }
  ]
}
