{
  "id": "15696",
  "title": "T-shirt Company Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’ve been trying to come up with a logo for a T-shirt company called “Asembl,” and this is what I got after some trial and error. What do you guys think? Comments and suggestions for improvement would be much appreciated; as I’m sure this could use a lot of work.\n\n| Attachment | Size |\n| --- | --- |\n| [Asembl.JPG](http://web.archive.org/web/20060522104852/http:/typophile.com/files/Asembl.JPG) | 53.76 KB |\n\n",
  "author": "<a href=\"user/9136\" title=\"View user profile.\">Kumakikai</a>",
  "time": "<br>",
  "uid": "9136",
  "comments": [
    {
      "time": " 17 October, 2005 - 1:44pm",
      "content": "Hm.  \nAll I can say is the ‘S’ looks too much like a ‘g’ — I can’t get my mind past that to give further commentary. My brain just keeps asking, “But what does _agembl_ mean?”\n\n"
    },
    {
      "time": " 17 October, 2005 - 2:23pm",
      "content": "The logo doesn`t work as unit. It`s only union of elements.  \nIt`s something on weak sign, that disturb. I would orient to  \nclarity and legibility. Eyes needs much time to entcode this  \nformation.\n\n"
    },
    {
      "time": " 17 October, 2005 - 3:48pm",
      "content": "I also think that the logo in not effective. It forces the eye to jump back and forth from place to place. Logos should do just the opposite: Lead the viewer to focus and remain focused on your design until it becomes imprinted on the brain. Your design creates confusion, not order! Simplify!!!!!  \nD~\n\n"
    },
    {
      "time": " 17 October, 2005 - 3:51pm",
      "content": "Do you think it’s possible to keep the large “S” by possibly changing the shape/size or removing the connection to the “a,” or should I nix it entirely?\n\n"
    },
    {
      "time": " 17 October, 2005 - 4:12pm",
      "content": "Are you trying to impress someone or are you really trying to communicate something. As it stands its design for design sake. It has no focus, no direction. As someone suggested it is a made-up word with no meaning and no other communications to explain it. Is it a place? Is it a time? I have no idea. Explain the concept and what its goal is and you will be on your way to a good graphic design.\n\n"
    },
    {
      "time": " 17 October, 2005 - 9:59pm",
      "content": "It’s a shortened form of the word “Assemble,” which was chosen because the company was formed by a few friends who er, “assembled” to form this idea. Kind of lame, but who am I to say?\n\nI think you’re right though—it doesn’t have any particular focus. I think I’ve got to go back to the drawing board on this one.\n\n"
    }
  ]
}
