{
  "id": "15692",
  "title": "Dyslexia",
  "forum": "Design",
  "tags": [

  ],
  "content": "hi people...\n\ni am currently researching dyslexia, and the ways in which typography can contribute to helping dyslexics read with more clarity.\n\ndoes anyone know of any good sites or projects of a similar nature?\n\ni have seen the basics, bda etc... but am looking for some info from designers or typographers with knowledge of this particular topic.\n\n[www.unitprodesign.com](http://web.archive.org/web/20120226072605/http:/www.unitprodesign.com/ \"www.unitprodesign.com\") shows an interesting reasearch based project, but there doesn't seem to be a typeface along with it!\n\nall help is greatfully welcomed.\n\njohn b.\n\n",
  "author": "<a href=\"/web/20120226072605/http://www.typophile.com/user/9747\" title=\"View user profile.\">john b</a>",
  "time": "<br>",
  "uid": "9747",
  "comments": [
    {
      "time": "",
      "content": "Have you seen [this](http://web.archive.org/web/20120226072605/http:/www.readregular.com/english/intro.html)? It's a typeface specially designed to help dyslexics read. The theory is that the letterforms are asymmetrical making it easier for word / character recognition.\n\n"
    },
    {
      "time": "",
      "content": "In your research you've probably discovered that Dyslexia is a blanket term for a diverse range of reading issues. Although the approach used in Read Regular or other specific typefaces might help some of these readers, proving so would be very difficult.\n\nSi\n\n"
    },
    {
      "time": "",
      "content": "We did have some discussion on reading disorders, low vision, dyslexia, in a [previous thread](http://web.archive.org/web/20120226072605/http:/typophile.com/node/14660) with some useful links.\n\nAs Simon mentioned, Dyslexia is a \"blanket\" term. Here an extract from my post to the above mentioned thread:\n\n\"I believe your mention of learning disabilities (inclusive of dyslexia, dyscalculia, dysgraphia, dyspraxia, and visual processing disorder) involves a completely different area of research not fully dependent on character recognition itself.\n\nBy no means do I understand the issues related to such disorders, but one of my business partners is heavily involved with [Edvocacy.org](http://web.archive.org/web/20120226072605/http:/www.edvocacy.org/prob2.htm), a not-for-profit organization dedicated to establishing a national early recognition program for children with dyslexia. (Visit the link and take the little decoding test to give you a sense of what dyslexic readers go through.)\n\nMy wife also happens to work for [The Landmark School](http://web.archive.org/web/20120226072605/http:/www.landmarkoutreach.org/res_e_faq.htm) which is one of the best known private educational facilities for children with reading and learning disorders. Of what I know of their mission is that they are training the students to decode and reprocess information encountered in their daily lives.\"\n\n"
    },
    {
      "time": "",
      "content": "Apparently there is less dyslexia in Italy, attributed to fewer phonemes and fewer alternate phonemes for the same glyph.\n\nSpelling reform is surely a more fruitful area of research than typography.\n\nBut I don't think you have to do it for everyone. Perhaps just a variety of alternate \"logicalized\" spelling systems for the different kinds of dyslexia, and a software program to translate.\n\nHowever, I do believe that \"non-transformable\" glyph shapes are inherently more legible than those which can be transformed into other characters simply by rotating or flipping. Which gives serifed type the advantage.\n\n"
    },
    {
      "time": "",
      "content": "Luciano Perondi has participated in some very interesting recent experiments concerning the relative readability, and the nature of the difference in readability, between Italian and English. The findings concerning the relative ease/difficulty of reading \"non-words\" for example are worth paying attention to.\n\n\\> Spelling reform is surely a more fruitful  \n\\> area of research than typography.\n\nAt first glance, yes. But when you realize that typography can be improved through the subconscious channel, while spelling reform can't, and only a good king can carry through conscious reform, and we don't got many good kings now, then spelling reform is pretty hopeless. :-(\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> then spelling reform is pretty hopeless. :-(\n\nEd Rondthaler's antiquated presentation on spelling reform at TypeCon was indeed full of pathos.\n\n"
    },
    {
      "time": "",
      "content": "There is no lack of people exploring, investigating, inventing and proposing reform in spelling and [writing systems](http://web.archive.org/web/20120226072605/http:/www.typophile.com/wiki/writing%20systems).\n\nJust for an interesting perspective on many current and older attempts at spelling reform, alphabet reform, new and invented writing systems can be explored on:\n\n[Omniglot -- Guide to Written Languages](http://web.archive.org/web/20120226072605/http:/www.omniglot.com/)  \nA dizzying array of [abjads](http://web.archive.org/web/20120226072605/http:/www.typophile.com/wiki/abjads), [alphabets](http://web.archive.org/web/20120226072605/http:/www.typophile.com/wiki/alphabets), [syllabic alphabets](http://web.archive.org/web/20120226072605/http:/www.typophile.com/wiki/syllabic%20alphabets), [con-scripts](http://web.archive.org/web/20120226072605/http:/www.typophile.com/wiki/con-scripts), etc., and even including Matt Groening's [Alien Alphabet for Futurama](http://web.archive.org/web/20120226072605/http:/www.omniglot.com/writing/futurama.htm)\n\n[Bradbury Thompson](http://web.archive.org/web/20120226072605/http:/www.typophile.com/wiki/Bradbury%20Thompson) [_Alphabet 26_.](http://web.archive.org/web/20120226072605/http:/www.pbtweb.com/alpha26/alpha.htm)\n\n[Neographies](http://web.archive.org/web/20120226072605/http:/www.langmaker.com/neographies.htm) (new or invented writing systems)\n\n[Writing Systems Links](http://web.archive.org/web/20120226072605/http:/www.omniglot.com/links/writing.htm) from Omniglot\n\nThere are just too many people inventing and designing glyphs for all sorts of reasons. As a typographer, I just might experiment with one of the con-lang (constructed language) glyph systems, since one aspect of typography is really about arranging glyphs.\n\n"
    },
    {
      "time": "",
      "content": "Hey, it's wiki time!\n\nAnd don't forget Cassandre's Peignot.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Mais oui, Peignot absolument.\n\np.s.\\> Excuseer me, maar wat een \"wiki\" is?\n\n"
    },
    {
      "time": "",
      "content": "Hey, don't use that language with ME! ;-)  \nNo, really, I don't know that one.\n\nMake a wiki, dude.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I think Luc de Groot has been involved in some research on dyslexia in type design. I remember him mentioning it in a class in Potsdam, where I studied.\n\n"
    },
    {
      "time": "",
      "content": "Is Norbert afflicted by dyswikia or wikiphobia?\n\nSi\n\n"
    },
    {
      "time": "",
      "content": "Another newspaper article on Read Reg...\n\n[http://www.theage.com.au/news/education-news/facing-up-to-a-different-ty...](http://web.archive.org/web/20120226072605/http:/www.theage.com.au/news/education-news/facing-up-to-a-different-type-of-disorder/2005/10/29/1130400370461.html \"http://www.theage.com.au/news/education-news/facing-up-to-a-different-type-of-disorder/2005/10/29/1130400370461.html\")\n\n"
    },
    {
      "time": "",
      "content": "John, I'm wondering if Gerrit Noordzij's [_Das Kind und die Schrift_](http://web.archive.org/web/20120226072605/http:/www.letterror.com/noordzij/stuff/Kind%20und%20Schrift.pdf) can be of use.\n\nUnderlying some of my conclusions about perceptual processing in reading are a few studies by Gad Geiger and Jerome Lettvin relating lateral masking and dyslexia. I wonder what you and your partner might think of them, and if they might spark some ideas.  \nhere (see page 18 especially):  \n [http://courses.csail.mit.edu/6.803/geiger1992.pdf](http://web.archive.org/web/20120226072605/http:/courses.csail.mit.edu/6.803/geiger1992.pdf \"http://courses.csail.mit.edu/6.803/geiger1992.pdf\")\n\nand here:  \n [http://courses.csail.mit.edu/6.803/geiger-lettvin2000.pdf](http://web.archive.org/web/20120226072605/http:/courses.csail.mit.edu/6.803/geiger-lettvin2000.pdf \"http://courses.csail.mit.edu/6.803/geiger-lettvin2000.pdf\").\n\n"
    }
  ]
}
