{
  "id": "15698",
  "title": "Is God Dead? Is Type Dead? (top forty magazine covers survey)",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "This press release just came across the wire...\n\n[http://home.businesswire.com/portal/site/google/index.jsp?ndmViewId=news...](http://web.archive.org/web/20100131032022/http:/home.businesswire.com/portal/site/google/index.jsp?ndmViewId=news_view&newsId=20051017005201&newsLang=en \"http://home.businesswire.com/portal/site/google/index.jsp?ndmViewId=news\\_view&newsId=20051017005201&newsLang=en\")\n\nOf the top 40 magazine covers two are purely typographic...\n\n8. Esquire - October 1966 - \"Oh my God - we hit a little girl.\"  \n12. Time - April 8, 1966 - \"Is God Dead?\"\n\n...interestingly both date from 1966.\n\nImages here - [http://nile.doceus.com/editorial/top40covers.htm](http://web.archive.org/web/20100131032022/http:/nile.doceus.com/editorial/top40covers.htm \"http://nile.doceus.com/editorial/top40covers.htm\") (updated link 10/20/05)\n\nCheers, Si\n\n",
  "author": "<a href=\"/web/20100131032022/http://typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": "",
      "content": "I'll leave dietic resuscitation to the clergy and their politician friends. Unless they dumb down the population to the point no one can read, type lives!\n\n"
    },
    {
      "time": "",
      "content": "God will have to write an obituary or answer for herself.  \nType lives, it just goes on unappreciated. We live in a time when type enjoys the greatest availability, the greatest amount of choice, the most functionality, and by far the cheapest prices in history. Type isn't even a carcinogenic and doesn't cause global warming.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Type lives and even makes icon faces\n\n"
    },
    {
      "time": "",
      "content": "\"Type lives and even makes icon faces\"\n\n:-)\n\nDan, it is supposed to be a \"type\" face :-D\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Great link, Si. I'd forgotten just how great [this cover](http://web.archive.org/web/20100131032022/http:/nile.doceus.com/editorial/40-40-images/16%20-%20The%20Economist%209-10-94.jpg) was. The offended letters to the editor in the next issue were also highly entertaining. (Yes, I read _The Economist_ for the humour.)\n\n"
    },
    {
      "time": "",
      "content": "Was that a one-hump or a two-hump camel?\n\nSorry, I had to beat Chris to it!\n\n"
    },
    {
      "time": "",
      "content": "Great link\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "\"Sorry, I had to beat Chris to it!\"\n\nLOL!!!\n\nGood thing it had not eaten recently. Then it would have been humpty-dumpty :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Of the top 40 magazine. Heehee. What about the great cover \"Mozart : The Mysteries That Lie Behind His Genius\" - Newsweek - Lettering by John Stevens\n\n"
    },
    {
      "time": "",
      "content": "Looks like the image page [http://www.magazine.org/editorial/13730.cfm](http://web.archive.org/web/20100131032022/http:/www.magazine.org/editorial/13730.cfm \"http://www.magazine.org/editorial/13730.cfm\") has been pulled. I'll look for a mirror.\n\nSi\n\n"
    },
    {
      "time": "",
      "content": "yes, let us know when you do sii, i'll be anxious to see it.\n\n"
    },
    {
      "time": "",
      "content": "Here's 17 of the covers - [http://lpe.ajc.com/gallery/view/living/1005/magcover/](http://web.archive.org/web/20100131032022/http:/lpe.ajc.com/gallery/view/living/1005/magcover/ \"http://lpe.ajc.com/gallery/view/living/1005/magcover/\")\n\nLooks like the hi-res is still on the mag.org site (for now at least) -\n\n[http://www.magazine.org/editorial/40-40-images/12%20-%20Time%204-8-66.jpg](http://web.archive.org/web/20100131032022/http:/www.magazine.org/editorial/40-40-images/12%20-%20Time%204-8-66.jpg \"http://www.magazine.org/editorial/40-40-images/12%20-%20Time%204-8-66.jpg\")\n\n[http://www.magazine.org/editorial/40-40-images/8%20-%20Esquire%2010-66.jpg](http://web.archive.org/web/20100131032022/http:/www.magazine.org/editorial/40-40-images/8%20-%20Esquire%2010-66.jpg \"http://www.magazine.org/editorial/40-40-images/8%20-%20Esquire%2010-66.jpg\")\n\nSi\n\n"
    },
    {
      "time": "",
      "content": "Thanks Simon!\n\nOf the two type-only covers, one has the absolute most incorrect font choice. I guess style generally overpowers content (in magazines).\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "The typography isn't what got the award, it was the concept.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "The concept of using Bodoni to set \"Oh my God - we hit a little girl.\" got an award. Enough said.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "The concept of THE WORDS “Oh my God - we hit a little girl.” The typeface did not play a role (even though it should have).\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> The typeface did not play a role\n\n?  \nHow could it possibly avoid playing one?\n\n--\n\nWhy make new fonts?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "What exactly do you find inappropriate about the font choice? It's not like they used Hobo or Palace Script. What would you have chosen?\n\n"
    },
    {
      "time": "",
      "content": "Come on, it's too clinical to set an exclamation of remorse for killing a child. What would I have used? I'd have to take into account font availability in 1966... Maybe something Czech - which ITC in fact had access to.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "ITC was formed in 1970. Why would a Czech font be more appropriate? And what does ITC have to do with anything anyway?\n\nFor what it's worth, the cover line was a quote taken from a lengthy article in that issue that followed an infantry unit from basic training to active combat in Vietnam. The war was in its early stages at the time and the idea that U.S. soldiers were killing little girls was pretty shocking to Americans at the time. This was two years before My Lai. (Source: The Art of Advertising, George Lois on Mass Communication, 1977.)\n\nIt doesn't say in the book I got this info from why Lois chose Bodoni. I suspect that he wanted something that looked sober and factual, and perhaps a face that looked like what the articles were set in. (They usually used Franklin Gothic on the cover.)\n\nBy the way, the three Esquire covers that made the top ten were all designed by George Lois. He practically set the standard of what a good magazine cover is.\n\n"
    },
    {
      "time": "",
      "content": "I think the old Czech style has a raw, fauve feel that suits war, and this type of thing in particular, much better.\n\nSorry about not know the ITC timeline. But my connection was simply that they had access to Czech faces, so it's not like a US designer couldn't get any. Maybe it was different in 1966, but still: Bodoni?! Even just Franklin Gothic itself would have been much better.\n\n\\> the idea that U.S. soldiers were killing little  \n\\> girls was pretty shocking to Americans at the time.\n\nAnd Bodoni hasn't been \"shocking\" for centuries.\n\n\\> It doesn’t say in the book I got this info from why Lois chose Bodoni.\n\nProbably the same reason most people choose Bodoni.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_\\> It doesn’t say in the book I got this info from why Lois chose Bodoni.  \nProbably the same reason most people choose Bodoni._\n\nOh, I doubt that. Lois was a stickler for typography. It may be that Bodoni doesn't have the same connotations now as it did then. Tastes change. Mostly, I think you just don't like Bodoni. :-)\n\n"
    },
    {
      "time": "",
      "content": "As G W Ovink, I think it's an admirable letter for a death notice.  \nWhich is not the same thing as an unintented killing however.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Fontblog to the rescue, with all the covers...\n\n[http://www.fontblog.de/C1133814189/E2040281936/index.html](http://web.archive.org/web/20100131032022/http:/www.fontblog.de/C1133814189/E2040281936/index.html \"http://www.fontblog.de/C1133814189/E2040281936/index.html\")\n\nAnd they're back on the mag.org site too...\n\n[http://nile.doceus.com/editorial/top40covers.htm](http://web.archive.org/web/20100131032022/http:/nile.doceus.com/editorial/top40covers.htm \"http://nile.doceus.com/editorial/top40covers.htm\")\n\nYay!\n\n"
    },
    {
      "time": "",
      "content": "Link with image enlargement option:\n\n[http://thomas.evans.free.fr/Top%2040%20magazine%20covers%20of%20the%20pa...](http://web.archive.org/web/20100131032022/http:/thomas.evans.free.fr/Top%2040%20magazine%20covers%20of%20the%20past%2040%20years/13730.cfm.htm \"http://thomas.evans.free.fr/Top%2040%20magazine%20covers%20of%20the%20past%2040%20years/13730.cfm.htm\")\n\n(Heading should be Top 40 \"American\" covers etc.)\n\n"
    },
    {
      "time": "",
      "content": "(Never mind. Deleted.)\n\n"
    },
    {
      "time": "",
      "content": "1966 was a very different time, not only in typography and magazine design, but in life in the U.S. This was the first time in American history that major media were asking very tough questions of our government. As Mark indicates, this was a shock to America. We were killing babies. I graduated from college in 1966 and was soon after \"absorbed\" into the military. The following year, I was sent to Viet Nam. I was stationed a few mile from My Lai when the massacre happened and heard about it from some nearby soldiers. I was there for the Tet offensive of 1968 and sent home the day Martin Luther King was shot. The world had changed greatly in 2 years. I was called a baby killer and spat upon after arriving back in the States. This never would have happened 2 years earlier.  \nSorry, back to type.  \nLois probably chose a \"normal\" type to contrast this most \"un-normal\" act. It looked like a normal quote pulled from a magazine and just ripped your guts out for that reason. The land of Ozzie and Harriet, Father Knows Best, and Lassie were jolted out of their Hollywood dream by the stark, naked, unembellished truth of war.  \nSorry again, back to type.  \nType was not an \"instant gratification sport\" like it is today. You had limited choices for tight deadlines like a weekly news magazine. Mostly, like I said before, it wasn't about the typeface. Things are not always about type. I wish they were, that would be much simpler a world. Children don't die because of a typeface.  \nSorry again. I can't get back to type just now.  \nChrisL\n\n"
    },
    {
      "time": "",
      "content": "_Lois probably chose a “normal” type to contrast this most “un-normal” act. It looked like a normal quote pulled from a magazine and just ripped your guts out for that reason._\n\nChris, I think you nailed it. To have set the headline in something more literal would have given away the punch line, so to speak.\n\n"
    },
    {
      "time": "",
      "content": "(Mark, what did you write/delete?!)\n\n\\> Lois probably chose a “normal” type to contrast\n\nOK, that COULD make sense.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_(Mark, what did you write/delete?!)_\n\nSomething I (luckily) realized was completely stupid as soon as I posted it. Thank goodness we can delete our own posts.\n\n"
    },
    {
      "time": "",
      "content": "Op/Ed piece [here](http://web.archive.org/web/20100131032022/http:/www.nydailynews.com/news/ideas_opinions/story/358212p-305251c.html) got me thinking.\n\nIn the coming months we'll probably see one or more typographic, or at least typonumeric, US magazine covers when the 2000th US soldier dies in Iraq. I'm guessing '2000' white on black. Which font\\* would you use?\n\nCheers, Si\n\n\\*As this isn't a real world exercise you don't need to limit your choices to Font Bureau fonts.\n\n"
    },
    {
      "time": "",
      "content": "\"...US magazine covers when the 2000th US soldier dies in Iraq. I’m guessing ‘2000’ white on black. Which font\\* would you use?\"\n\nLet's see--what was that font used on all the Bush/Cheny bumper stickers?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> Which font\\* would you use?\n\nIs there one that looks like oil slicks?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I remember the font name now: \"Bad Intel Gothic\" from the WMD Foundry.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "The W 2000 bumper sticker idea is clever, although I don't think there was an [official Bush/Cheney sticker](http://web.archive.org/web/20100131032022/http:/cgi.ebay.com/ws/eBayISAPI.dll?ViewItem&item=6216245549&ssPageName=ADME:B:EF:US:1) that had the year.\n\nSticking with the rules the type would be reversed out of the black oil - that might look good. But that might confuse the readers as oil might equate more to gas prices than the casualties of war.\n\n"
    },
    {
      "time": "",
      "content": "Red oil then?  \nFont: Amplitude.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Might work, especially with the ultra - although only the 2 has the oil traps.\n\n ![](http://web.archive.org/web/20100131032022im_/http:/typophile.com/files/2000b.gif)\n\n"
    },
    {
      "time": "",
      "content": "\\> only the 2 has oil traps.\n\n:-\\>  \nYou could \"angularize\" two opposing corners in the counter of the zero\\*. And I would use an extended weight (at a smaller size as a result) if there is one.\n\n\\* And then maybe the same for the top-right of the top counter of the 2.\n\nAbout the red though: not solid, but a subtle swirly texture. Like a quagmire.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>And I would use an extended weight (at a smaller size as a result) if there is one.\n\nYes full set of wides... [http://www.myfonts.com/fonts/fontbureau/amplitude/](http://web.archive.org/web/20100131032022/http:/www.myfonts.com/fonts/fontbureau/amplitude/ \"http://www.myfonts.com/fonts/fontbureau/amplitude/\")\n\n"
    },
    {
      "time": "",
      "content": "And the headline could read:\n\n2000 Dead, brought to you by the States in Red.\n\nChrisL\n\n ![](http://web.archive.org/web/20100131032022im_/http:/typophile.com/files/redstates.jpg)\n\n"
    },
    {
      "time": "",
      "content": "\"Would you rather be Red or Dead?\"\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Hmmm, I just downloaded Flash8 (on Firefox/Win-XP) and tried to insert a GIF, but no go. Help?\n\n(My filename had \"++\" in it - could that be the problem?)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Anyway, just so this isn't clogging my desktop:\n\n[http://www.themicrofoundry.com/other/2000++.gif](http://web.archive.org/web/20100131032022/http:/www.themicrofoundry.com/other/2000++.gif \"http://www.themicrofoundry.com/other/2000++.gif\")\n\nStill missing the 'mire though.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant,  \nMaybe you mean to use one of those signs like McDonalds uses: Over 1,000,000,000,000,000 Sold\"\n\nYou might have a better word in mind for \"sold\" though :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Or have one of those scrolly LED setups showing the barrels-per-deaths quotient.\n\n[http://www.theonion.com/content/node/34132](http://web.archive.org/web/20100131032022/http:/www.theonion.com/content/node/34132 \"http://www.theonion.com/content/node/34132\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Gotta love the Onion, they are a barrel of laughs :-)\n\nChrisL\n\nor is that a Bushal basquet of laughs?\n\n"
    },
    {
      "time": "",
      "content": "I just love how the networks chose red for the Republicans. Now we can say that Bush is the new Red Menace.\n\n"
    },
    {
      "time": "",
      "content": "\"Now we can say that Bush is the new Red Menace\"\n\nOr was it the red ink the U.S. Gov went into since the W administration?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "The art director in me would do it as an odometer.\n\n"
    },
    {
      "time": "",
      "content": "That was my thought too, alternately as a stock ticker, or in the style of scrolling text you see at the bottom of the screen on Fox News.\n\n"
    },
    {
      "time": "",
      "content": "Round up at \"Under Consideration\"\n\n[http://www.underconsideration.com/speakup/archives/002449.html](http://web.archive.org/web/20100131032022/http:/www.underconsideration.com/speakup/archives/002449.html \"http://www.underconsideration.com/speakup/archives/002449.html\")\n\n"
    },
    {
      "time": "",
      "content": "Closing the loop on the 2000 milestone tangent - NewsDesigner.com on newspaper coverage...\n\n[http://www.newsdesigner.com/archives/002390.php](http://web.archive.org/web/20100131032022/http:/www.newsdesigner.com/archives/002390.php \"http://www.newsdesigner.com/archives/002390.php\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks Si. This is an appropriate theme considering Veteran's day is coming soon.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "For the type only cover, I'm reminded of what Bob Gill (Pentagram founder) had to say in his 1970s How-To book on graphic design (titled \"Forget everything you know about graphic design\"?), which was that the more interesting the copy is, the less creative treatment it needs. I think he gave the example of \"Cure for cancer discovered\" needing no creative spin. That philosophy was implemented by George Lois.\n\nThe layout style Lois used for \"Oh my God..\" was an ad headline style of the '60s, whereby it looked like it was a text setting, blown up big -- Upper and lower case, flush left. Very informal and conversational, like the ad copy of the time. (However, they did nuance the setting for scale by tightening it up a lot.)\n\nAt that time, Bodoni was appreciated as an un-fancy font (and is to this day by Massimo Vignelli et al), due to its rationalized geometric structure. Used real big in headlines, the serifs are like slab serifs, and the few funky idiosyncracies like the kink in the y's tail serve to roughen up the geometric logic of its overall construction, accentuating the \"this is a scrap, enlarged\" idea.\n\nCarl Ally countered Helmut Krone's \"We Try harder\" ads for Avis, which had body text set in something like 24 pt Perpetua Bold, with similar \"big type' ads for Hertz, set in Bodoni Bold. Although they were working with typositor types, the idea was that those guys were blowing up fine text types to headline size and using them as massive \"text\" weapons. This effect of typographic scale can be appreciated more when you hold the magazine, rather than see it in a reproduction.\n\nLois had done type-only headline ads (eg. \"John, is Billy Coughing, Get him some medicine,\" again on a black background), and I don't think he drew a distinction in technique between the ads and editorial. It's all about the Big Idea. His Esquire covers used the same creative vocabulary as his ads. In \"My God..\", you have a headline and body copy, with an asymmetric use of plenty of \"white\" space. It is the ruthless minimalism, coupled with an exact positioning and balance of elements, which makes this a masterpiece. And the Big Idea. If Andy Warhol put the language of popular, commercial culture in the art gallery, George Lois put conceptual art on the street.\n\nBTW, Lois had served in the Korean War.\n\n"
    },
    {
      "time": "",
      "content": "I'm interested that Cheney has sacrificed his chief of staff to the leak of the CIA agent. The editorials today point to him leaking the info to discreate anyone against the war on Iraq. Thus the congressional hearing today challenging the reasons for the war.\n\n"
    },
    {
      "time": "",
      "content": "_It doesn’t say in the book I got this info from why Lois chose Bodoni. I suspect that he wanted something that looked sober and factual, and perhaps a face that looked like what the articles were set in. (They usually used Franklin Gothic on the cover.)_\n\nBy the way, the three Esquire covers that made the top ten were all designed by George Lois. He practically set the standard of what a good magazine cover is.\n\nFWIW, one of the first jobs the young George Lois had as a CBS staff designer, working under William Golden, was to redesign all the characters of Bodoni – Didot Bodoni as they called it – as the CBS corporate face. And he complained – jokingly – about how demanding Golden was. Bodoni does the job perfectly on the Esquire cover. Lois: big ego, but brilliant indeed.\n\n"
    },
    {
      "time": "",
      "content": "\\> the more interesting the copy is, the less creative treatment it needs.\n\nTrue. But a more creative treatment can still only help (although by \"creative\" I certainly don't mean obvious or mannered).\n\n\\> At that time, Bodoni was appreciated as an un-fancy font\n\nEven assuming we can know that, and it's true, it remains that a font also has an effect on people irrespective of what they <cite>think</cite> it's evoking.\n\n\\> the kink in the y’s tail\n\nThat's actually a text-level effect, [generally] misplaced in the display realm.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I need to figure out the font used for the \"Is God Dead?\" Time cover. I know it is some deviation of Bodoni, but the question mark doesn't seem to match up with any version on my system here. What the font is not helping either. Help!\n\n"
    },
    {
      "time": "",
      "content": "It's not any typeface I recognize. I think it's probably hand lettered, which wouldn't have been unusual--even for something so plain--in 1966.\n\n"
    },
    {
      "time": "",
      "content": "Silly geese, it's not Bodoni, it's [Godoni](http://web.archive.org/). Mike Parker 'n I have been diggin' deep on this, and it looks like his _real_ name was Biambattista Godoni, but history, (and then Monotype), transposed it to make him seem less like a fossil to the 19th market.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "\"...to make him seem less like a fossil to the 19th market.\"\n\nThat's a scream :-)\n\nChrisL\n\n"
    }
  ]
}
