{
  "id": "15703",
  "title": "Overused Topic",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have done a brief list of the most overused typefaces in extended text (as in books and magazines) and would like to see if I'm not mistaken, I would like to have comments from people in different countries and I am specially interested in latin american people comments as well.\n\nArial  \nBaskerville  \nCaslon  \nCentury  \nGaramond (in it's diverse advocations)  \nHelvetica  \nMinion  \nOptima  \nPalatino  \nTimes New Roman  \nUnivers\n\nThanks!\n\n",
  "author": "<a href=\"/web/20120105004908/http://typophile.com/user/1530\" title=\"View user profile.\">rs_donsata</a>",
  "time": "<br>",
  "uid": "1530",
  "comments": [
    {
      "time": "",
      "content": "I would guess its because these typefaces are imbeded with online and word processing programs. Why would you invest in another font if these fonts can get the job done? I think its about economy and need. Is it more important to style words or is it more important to convey ideas in an easily recognizable way.\n\n"
    },
    {
      "time": "",
      "content": "I suppose a single use of a bad typeface would constitute overuse. Billions of documents that use a good typeface would likely constitute popularity.\n\n"
    },
    {
      "time": "",
      "content": "Some facts about the list:\n\n\\* 4 of these faces are sans serif  \n\\* 6 of these faces were designed during the second  \n half of the XX century  \n\\* Only 1 of these faces was originally intended for  \n digital setting  \n\\* 6 of these faces were designed by Englsh speakers  \n\\* 3 of these faces were designed by French speakers  \n\\* Only 2 of these faces were designed by German speakers  \n\\* One of these faces was originally intended for magazine setting  \n\\* One of these faces was originally intended for newspaper setting  \n\\* One of these faces was originally intended for display settings  \n\\* Three of these faces bear the name of their creators\n\nSo, do you agree with the list? or is any overused face missing?\n\nDo you know any other facts about the faces in the list?  \nHéctor\n\n"
    },
    {
      "time": "",
      "content": "Except for the first on the list -- which is overused probably because of its arm in arm relationship with pcs, as DW pointed out, I think it's a list of some pretty good faces. That's most likely why they turn up so often.\n\n"
    },
    {
      "time": "",
      "content": "Maybe I'm not using the right word... (sorry not native english speaker) by Overused I would mean the most used, not neccesarrily a bad connotation I wanted to give.\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "This is an \"informal\" list without any empirical credence.\n\nFrankly, what use in anything less than a statistical survey of popular magazines, newspapers, websites and books, by circulation/readership/hits. All else is just guesswork and opinion.\n\nI believe Meynell did a survey of typeface usage in the UK in the 1950s, counting newspaper ads, but I don't know of any other similarly thorough surveys.\n\n"
    },
    {
      "time": "",
      "content": "?  \nIt's ALL \"guesswork and opinion\" anyway! :-)  \nIn those magazine articles you write, do you rely heavily on empiricism?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Well Nick, I'm just guessing and want some type fonded people to help me guess. Thanks for the reference but 50 years ago is not useful.\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "There was this study - looked at PDF's of newspaper front pages...\n\n[http://www.ascendercorp.com/pr/pr2004\\_11\\_09.html](http://web.archive.org/web/20120105004908/http:/www.ascendercorp.com/pr/pr2004_11_09.html \"http://www.ascendercorp.com/pr/pr2004\\_11\\_09.html\")\n\nSi\n\n"
    },
    {
      "time": "",
      "content": "\\> I have done a brief list of the most overused typefaces in extended text\n\nIMO - the right word is misuse; misused typefaces in extended text.\n\n"
    },
    {
      "time": "",
      "content": "\\>by Overused I would mean the most used, not neccesarrily a bad connotation\n\nThe phrase should be \"most popular\" or using sports terminology \"winningest\".\n\n\"Times New Roman is the winningest typeface of all of newspaper fonts of all time.\"\n\nCheers, Si\n\nPS and its a real word - [http://www.yourdictionary.com/ahd/w/w0179000.html](http://web.archive.org/web/20120105004908/http:/www.yourdictionary.com/ahd/w/w0179000.html \"http://www.yourdictionary.com/ahd/w/w0179000.html\") - who knew? ;-)\n\n"
    },
    {
      "time": "",
      "content": "But Simon, the Ascender data was derived from Newseum, which only includes papers that voluntarily submit PDFs of their front pages, thus skewing the results towards the visually savvy (i.e. less likely to use common fonts).\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "True, the survey was not perfect. Only looking at the front page may have discounted some fonts primarily used in the subsections. They also only looked at the top-selling 100 newspapers in the US - so it's US centric and only covers the most popular papers.\n\n"
    },
    {
      "time": "",
      "content": "just thought i should add one more to your list. i'm not going to site a survey or anything, but i see this typeface all the time on everything from televison news graphics, to the signage on the walls of my gym, to anything that wants to seem masculine.\n\ni don't know if it belongs on the same list as Optima or Caslon, but everywhere i turn i see this damn typeface! it drives me nuts...\n\n...it's just so lame.\n\n[bank gothic](http://web.archive.org/web/20120105004908/http:/www.myfonts.com/search?search%5Btext%5D=bank+gothic)\n\n--------------  \nnc\n\n"
    },
    {
      "time": "",
      "content": "I am not so sure that it's the font's fault per se. It is used poorly. But I understand the sentiment.\n\n"
    },
    {
      "time": "",
      "content": "Bank Gothic kinda falls into the Eurostile Microgramma mould. I think it dates back to the \"Readily available as presstype or vinyl lettering\" kind of thing. Like Eben says, it was poor usage.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "This isn't going to sound good to my fellow type designers but sometimes even bad type has it's uses - depending on what you want to say & how you want to say it. Context is king.\n\n"
    },
    {
      "time": "",
      "content": "Remember most Personal Computer users are not designers but are given a bunch of fonts and think they are cleaver using different fonts (often badly) but its not their fault. If it comes with an application they will probably use them. The concept of purchasing licences for fonts is never explained, not when they buy the computer or the software. Bank Gothic isn't the culprit, its the people who decided to include it with the computer/software.\n\n"
    },
    {
      "time": "",
      "content": "So are you blaming Steve Jobs? Hasn't he done some good too, like inventing the iPod and the internet? ;-)\n\n[http://news-service.stanford.edu/news/2005/june15/jobs-061505](http://web.archive.org/web/20120105004908/http:/news-service.stanford.edu/news/2005/june15/jobs-061505 \"http://news-service.stanford.edu/news/2005/june15/jobs-061505\")\n\n\"But ten years later, when we were designing the first Macintosh computer, it all came back to me. And we designed it all into the Mac. It was the first computer with beautiful typography. If I had never dropped in on that single course in college, the Mac would have never had multiple typefaces or proportionally spaced fonts. And since Windows just copied the Mac, _its likely that no personal computer would have them_.\"\n\n...although I think \"licensed TrueType from Apple\" is nicer (and more accurate) than \"just copied.\"\n\n"
    },
    {
      "time": "",
      "content": "I'm not blaming anyone but you have a responsibility to explain the reason for free fonts (avaible on computers using software) and that has never been done. I don't care if its the computer designers or the software designers. Your communications skills are lacking in lieu of making sales.\n\n"
    },
    {
      "time": "",
      "content": "\\> Windows just copied the Mac\n\nRegardless of verasity\\* I think he is referring to the mac GUI & overall approach - not anything to do with true type...\n\n\\* I think this isn't the pace to hash out old win/mac wars.\n\n"
    },
    {
      "time": "",
      "content": "\\> I think this isn’t the pace to hash out old win/mac wars.\n\nSorry that wasn't my intention, I just thought the cause and effect relationships outlined by Mr Jobs was interesting and related to the over-used/popular fonts thread.\n\n\\> but you have a responsibility to explain the reason for free fonts (avaible on computers using software) and that has never been done.\n\nActually I explained this in Thessa' last year.\n\nSi\n\n"
    },
    {
      "time": "",
      "content": "GUI: Apple copied Xerox.  \nIt's just that Xerox never had a charlatan evangelist handy.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Xerox was letting the the GUI die on the drawing boards at Xerox Park. If Apple had not borrowed the concept, we may never have seen it out of Xerox.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "But Jobs is still an accomplished historical revisionist.\n\nAnd good typography? Not for over a decade now, sorry.  \nOh, and ITC Garamond Condensed?! Gag me with a spline.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Simon, sorry - I didn't mean to come down on you. Not at all. I Just wanted to head off the bad old thing at the pass using skepticism. But I failed. Oh well. I draw the line at attempting to censor.\n\nPlay on...\n\n"
    },
    {
      "time": "",
      "content": "No need to apologize – looks like the thread has gone off on a tangent and I’m to blame :-(\n\nI do think we’d still have seen proportional digital fonts on computers, even if the Mac had not been invented. But the typographic world would likely be somewhat different than it is now. So I don't think Steve can take full credit for bundled fonts.\n\n"
    },
    {
      "time": "",
      "content": "i think there are many interesting points being made. perhaps y'all should start a new thread.\n\ni think we should be talking about the list of overused typefaces that rs\\_donsata was kind enough to compile. i think it would also be interesting if people would share their thoughts on which typefaces are most overused, and maybe why people use the same 30 typefaces when there are thousands out there?\n\nperhaps a good typeface is a rare thing. or maybe people just don't like to take risks.  \ni don't know.\n\nthoughts?\n\n::nc\n\nps  \nstay on track!\n\npps  \ni think i should get back to work now!  \n ; )\n\n"
    },
    {
      "time": "",
      "content": "i see clarendon every few days now, it grew quite popular (at least over here in switzerland). used in very different contexts (ads, hiphop-flyers, a whole magazine (headlines), etc.).\n\n"
    },
    {
      "time": "",
      "content": "I don't mind if the discussion has taken a new twist, I'm glad my post could trigger a new topic.\n\nI guess the few suggestions is a sign of an acceptable accuracy on the list so go ahead. Clarendon and Bank Gothic are certainly overused altough they are not faces for setting extended text.\n\nI'm actually tired of avant garde, it comes with corel draw (which is by far the most used software for vectors and simple layouts here)  \nand is in the top of the font menu. However nothing makes me feel more sick than seeing Arial everywhere and in everything: two thirds of the people involved in graphics here don't even know of the existence of Helvetica, they would say \"oh Helvetica, it looks like an Arial rip off\".\n\nOn the other hand I have always been accostumed to the PC GUI and can't even get a program to run in mac (I learned briefly in a job I had but then I forgot).\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "\\>In those magazine articles you write, do you rely heavily on empiricism?\n\nI don't have a research budget, so really all that's objectively available to \"prove\" that a trend is happening is information on font sales from a few distributors.\n\nThe AIGA \"top 50 books\" named the typefaces. That's a competition and would tell you more about the judges' taste, perhaps, but interesting.\n\nI don't see why it wouldn't be possible to do a statistical survey of type use. In Canada one could start with the book Canadian Advertising Rates and Data, which lists audited circulation of publications. Then you'd go to a magazine store and check the top 100 and see what their text types were. Same thing for newspapers.\n\nBook Sales: pretty straightforward too.  \nHarry Potter and DaVinci Code would give you the \"most read\" fonts.  \nBerkeley Old Style in Harry Potter, innit?  \nSo \"most read\" is not necessarily \"most used font \" or \"most licenses sold\".\n\nOn the internet, it would perhaps be possible to devise a crawler that sought out the most visited sites and checked what fonts they used.\n\nI suspect that the most read faces, measured in characters multiplied by readers, would be internet \"core\" fonts. It would be interesting to compare that with newspaper text faces.\n\n"
    },
    {
      "time": "",
      "content": "\\> all that’s objectively available to “prove” that a trend is  \n\\> happening is information on font sales from a few distributors.\n\nSo did you ask them for the numbers?  \n(I'm not saying you absolutely should have - see below.)\n\n\\> I don’t see why it wouldn’t be possible to do a statistical survey of type use.\n\nWho said it wouldn't? My own point was that the absense of such numbers should not preclude talking about it anyway.\n\nBut yes, it's certainly highly interesting stuff.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>the absence of such numbers should not preclude talking about it anyway.\n\nI just thought, as did several others, that the question was not phrased quite right, and suggested a tangential topic, \"where's the hard data on font usage?\"\n\nHector, following up on the sentiment you nailed in your most recent post, my answer to the question \"Which fonts get in your face and p\\*ss you off?\" my reply is,\n\n- \"Bundled fonts.\"\n\n"
    },
    {
      "time": "",
      "content": "\\> the question was not phrased quite right,  \n\\> and suggested a tangential topic\n\nNo, your original reaction was clearly much more negative.\n\n\\> “Which fonts get in your face and p\\*ss you off?”\n\nFor me, it's display fonts that pretend they could be text fonts.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "OK, I confess, I thought the question was a waste of time.\n\nBut if you want to gossip about which fonts are most popular, don't let me stop you.\n\n"
    },
    {
      "time": "",
      "content": "\\> I thought the question was a waste of time.\n\nBut I thought you were a fan of opinion and not of empiricism. And \"gossip\", really? Maybe you think helping out in the critique forum is \"gossip\" too, since there's no Proof that that \"g\" could be better or whatnot...\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> “Which fonts get in your face and p\\*ss you off?”\n\nRip-offs.\n\nTo a lesser extent by far, fonts that have hundreds of weights that are so close together you can't see a difference but you can't buy an assortment with a smaller, more sensible set.  \nI would much rather see fonts by usage (text, caption, subhead, display) than an endless range of weights.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Chris, That's an interesting point.\n\n"
    },
    {
      "time": "",
      "content": "\\>To a lesser extent by far, fonts that have hundreds of weights that are so close together you can’t see a difference but you can’t buy an assortment with a smaller, more sensible set.\n\nYou’d never use adjacent weights on a page, you’d pick weights that are separated by several intermediates. I remember Luc(de) Groot making this point very eloquently at Fuse 94 when talking about Thesis.\n\nThe other use for two closely weighted styles would be when reversing out some text white on black and wanting the visual weight to match the black on white. Example being [FF Transit](http://web.archive.org/web/20120105004908/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories_search=font_name_search&searchstr=transit&image.x=22&image.y=8) \"Front\" and \"Back\"\n\nBut not being able to pick and choose the fonts you need seems a bit wrong. Got any examples of this all or nothing bundling practice?\n\nCheers, Si\n\n"
    }
  ]
}
