{
  "id": "15728",
  "title": "Critique question...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’am member of Typophile for less than on year and I’ve noticed something.\n\nAm I alone, but I have the feeling that since the new site typophile is on-line, the Critique section is less frequented?\n\nWhat do you think of it?\n\n",
  "author": "sim",
  "time": "18 October, 2005 - 4:27pm",
  "uid": "5264",
  "comments": [
    {
      "time": " 18 October, 2005 - 4:38pm",
      "content": "I think you are right. There was a thread on this a while back, perhaps you can still find it?  \nMy thinking was that the latest post does not show up in the Forums page so people assume there are no posts. There were other theories as well.\n\nChrisL\n\n"
    },
    {
      "time": " 18 October, 2005 - 4:45pm",
      "content": "No inline images.\n\n"
    },
    {
      "time": " 18 October, 2005 - 4:50pm",
      "content": "My suggestion, as probably yours deszom, would be to add the latest post in the Forum section in the Last Post section.\n\n"
    },
    {
      "time": " 18 October, 2005 - 5:00pm",
      "content": "Andre,  \nHere is the old thread:  \n [http://typophile.com/node/14429](http://web.archive.org/web/20060209211320/http:/typophile.com/node/14429)\n\nIt was called “Why no recent poster on Critique forum?”\n\nChrisL\n\n"
    },
    {
      "time": " 18 October, 2005 - 5:33pm",
      "content": "I had a thread like that a while back (shortly after the re-launch) where I tried to get people to spend less time elsewhere (like the composition/typography crits) and more time on typeface crits. Most people agreed (including some who rarely agree with me) but here we are still…\n\nhhp\n\n"
    },
    {
      "time": " 18 October, 2005 - 6:04pm",
      "content": "So, what’s the problem?\n\nPresentation, Interest, what else?\n\n"
    },
    {
      "time": " 18 October, 2005 - 7:09pm",
      "content": "I think presentation. I often forget to look there because I am drawn by the new material in the other threads as shown on the front page. So, I think Chris is right.\n\n"
    },
    {
      "time": " 19 October, 2005 - 5:30am",
      "content": "Is there typophile member who knows where can we or to which can us send our suggestions to give to the Critique section a better visibility?\n\n"
    },
    {
      "time": " 19 October, 2005 - 5:32am",
      "content": "You might try the “bug” thread?  \nMaybe Joe Pemberton or Tiffany?\n\nChrisL\n\n"
    },
    {
      "time": " 19 October, 2005 - 5:51am",
      "content": "Well, I’m sort of charged with manning the critique forum. So let me have it!\n\nSite design things, like getting new posts to show up on the forum page, should be sent to Jared & Joe, who administrate Typophile. Moderators like Tiffany, Paul, Yves, Stephen, etc. and I mostly just “moderate.”\n\n"
    },
    {
      "time": " 19 October, 2005 - 5:53am",
      "content": "BTW, I read Typephile via the Tracker page ( [http://typophile.com/tracker](http://web.archive.org/web/20060209211320/http:/typophile.com/tracker)) not the forum page. This way, I see each thread that has a new post. I stil can’t always tell whether or not something is a critique, but I recommend using Typophile through this angle. It is the best way not to miss a beat (according to the current site design…)\n\n"
    },
    {
      "time": " 19 October, 2005 - 6:05am",
      "content": "So, does it mean, because of the struture of Typophile that it is impossible to add the latest post on for the Critique section on the Forum page?\n\n"
    },
    {
      "time": " 19 October, 2005 - 6:14am",
      "content": "Dan,  \nI have tried the Tracker. It has problems too. The left column instead of repeating “Forum Topic” again and again, should show WHICH forum the post was from. That way if someone was looking for Critiques posts, they could look down the column and find them. Even better if you could sort by forum so a user could group the things he/she was interested in.  \nThe tracker could also list the name of the recent poster with the time. This would help you decide if you want to read it. For instance; if I was the last poster to a thread but can’t keep track of exactly how many minutes/hours/days ago that was, I don’t want to reread my own post. If my post was addressed to specific people as a question, I would look to see if those people had answered.  \nI have also tried the “my Threads” listing which sorts in some bizarre way. Instead of putting the most recent post at the top, it sorts by when you first visited that thread so you have to scroll your life away to check everything.  \nI am sorry. I know this sounded ranty. I don’t mean to dump on our bunch of very fine people who volunteer their time to make this site work. Please don’t take any of my spewing personally. I know you are all doing the best you an with the time and resources you have to work with.\n\nChrisL\n\n"
    },
    {
      "time": " 19 October, 2005 - 6:30am",
      "content": "_\\>So, does it mean, because of the struture of Typophile that it is impossible to add the latest post on for the Critique section on the Forum page?_\n\nI can’t speak about Typophile’s structure. The answer to your question could be yes, but I don’t know.\n\n"
    },
    {
      "time": " 19 October, 2005 - 8:47am",
      "content": "\\> should show WHICH forum the post was from.\n\nYes yes please!\n\n\\> sorts in some bizarre way.\n\nI’ve discovered that if you go through your profile instead of the tracker, the sorting is as one would expect.\n\nhhp\n\n"
    },
    {
      "time": " 19 October, 2005 - 9:18am",
      "content": "\\> if you go through your profile instead …\n\nHmmm, Well, I could swear it USED to. :-/\n\nhhp\n\n"
    },
    {
      "time": " 19 October, 2005 - 9:30am",
      "content": "I’ve suggested that, Chris, to Jared and at this time to the tech (or so I understood it) can’t do what we want. I’m sure Christian plays with this all the time as I saw him tinkering with Typophile at TypeCon during his spare time.\n\nThe tracker would be more useful if we knew from which area the threads originate, but, instead of wishing, perhaps, at this present time, we should visit as many threads as the tracker spits at us and watch for the critique area if that is what we need to do.\n\n"
    },
    {
      "time": " 19 October, 2005 - 9:37am",
      "content": "Thanks Tiff, I appreciate your efforts as well as all the rest of the people like Christian who work behind the scenes for no pay and little thanks.\n\nChrisL\n\n"
    },
    {
      "time": " 22 October, 2005 - 6:57pm",
      "content": "I love critique, I will try to go there in days to come and spend some time. I think it is very important!\n\n"
    }
  ]
}
