{
  "id": "15729",
  "title": "Online portfolio",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I avoided creating webpages with zeal, but something (ok, a freelancing dry spell) inspired me to swallow my fears and put up an electronic portfolio. I'm primarily a book designer, and the concept of designing text for a screen gives me instantaneous hives. Anyway, what do you ladies and gents think of it. The website itself is very simple, most of the content is in the pdf portfolio.\n\n[http://www.garyrobbins.net](http://web.archive.org/web/20150425045606/http:/www.garyrobbins.net/ \"http://www.garyrobbins.net\")\n\n",
  "author": "grobbins",
  "time": "18 Oct 2005 — 11:48pm",
  "uid": "9770",
  "comments": [
    {
      "time": "19 Oct 2005 — 12:30am",
      "content": "Very attractive and easy to use, although I'm not sure the format is the best use of space for something to be viewed on screen it is distinctive. My slight criticisms are that you should probably make more of your contact details (turn them the right way round and the title of Metamorphoses) on your portfolio and include them on the website.  \nTim\n\n"
    },
    {
      "time": "19 Oct 2005 — 12:42am",
      "content": "Hello, I wanted to tell you something but I took a screenshot and made  \ncouple of quick changes : [http://tinypic.com/erg3fp.jpg](http://web.archive.org/web/20150425045606/http:/tinypic.com/erg3fp.jpg \"http://tinypic.com/erg3fp.jpg\")  \nI agree with Mr. Daly, you should put the contact data and consider the  \nreal estate of the screen.\n\nGood works, regards,  \nAS\n\n"
    },
    {
      "time": "19 Oct 2005 — 1:27am",
      "content": "You're absolutely right. I made the big \"Gary Robbins\" an email link, but that's not implicit I suppose.\n\nThanks!\n\n"
    },
    {
      "time": "19 Oct 2005 — 1:33am",
      "content": "Alessandro-\n\nWhile I like your design I have a bracket fetish, so....\n\nBut extending the background to avoid the unseemly white edges of too-big browser windows--why didn't I think of that?\n\n"
    },
    {
      "time": "19 Oct 2005 — 8:54am",
      "content": "What do you mean with \"bracket fetish\" ?  \nThat is not my design, it is my criticism.  \nSincerely, good luck.\n\nAS\n\n"
    },
    {
      "time": "19 Oct 2005 — 1:39pm",
      "content": "While I understand completely your reluctance to work with HTML, it seems to me you're missing an opportunity. Book design is all details work, each book brining with it a variety of challenges and leaps of understated risk, and so is web work. Every project has limitations: small budget, letterpress and so few type choices, stock, binding, etc. Same with web. And it seems to me you're cheating a bit. If you're going to go online, you should either produce or have produced for you something that speaks to your work and abilities. I guess what I'm saying is that an attempt to make HTML work seems important. One big graphic sliced up with a couple of links tacked on ain't no web page, and a glance at your code proves it. I don't mean to be a jerk here, but extending the edges of your graphic (for example) isn't really the issue. The issue (in this case) is integrating your graphic into the web page so that there is no distinction between the graphic and the background, regardless of how big or hi-res the viewer's monitor is. That same issue, I think, extends to the site as a whole.\n\nAll that aside, you've got some great work in the portfolio. I just think the site should reflect and exemplify that work, not just provide a link to it.\n\n"
    },
    {
      "time": "19 Oct 2005 — 3:03pm",
      "content": "I agree with jason - there is no reason you cannot offer the info both ways. Of course the PDF is higher rez -but I think folks know this & accept it. The Web is not evil - it is limited in some ways but it is stronger in some ways too. Not offering the info on web pages too means that cut yourself off from many of these important advantages.\n\n"
    },
    {
      "time": "19 Oct 2005 — 3:03pm",
      "content": "Oh! And nice work!\n\n"
    },
    {
      "time": "19 Oct 2005 — 4:28pm",
      "content": "I understand what you're saying, and its exactly what was keeping me away from html in the first place. I knew how to code in college (I went to design school at the height of internet fervor, when it seemed we were taken on weekly field trips to the offices of Razorfish to see what we were working towards--ahem) but I hated every minute of it and promptly forgot it. Its just not for me. I can't afford to hire a web designer who knows how to code. I know that a glance at my code (and by the way, how dare you!) makes me seem an incompetent web designer. I don't want to be hired to do web design anyway. Maybe the issue is that a web portfolio for a book designer is just a bad idea if it will turn people off. I had been sneaking my business cards into the books I designed at bookstores as a means of self promotion but I decided that lacked a certain amount of tact. But please explain further how I've cheated, and how what I've cobbled together isn't, in fact, a web page. Do you have to be a master to play the game?\n\n"
    },
    {
      "time": "19 Oct 2005 — 5:23pm",
      "content": "I don't think you have to be a master by any means to get 90% of the benefit from a web site. All the razorfish style hoopla aside I think that :\n\n- Contact info is important. If you have just one page you should perhaps put at least a phone # on it. The first page of a web site is a little like a business card. It aught to meet at least that level of helpfulness.\n\n- Searchability ( google etc) is important. You can do this better via web pages than PDFs even if google is PDF friendly to a point.\n\n- Control is important. The web is great because it lets you take ( & offer ) one small small bite of info at a time which means that the visitor can control what & when they get their info. Certainly better than they can in a PDF. So break up your content into relevant parts!\n\n- Navigation is important. Navigation is the needed complement to breaking up content.\n\n- Speed is important. PDFs are great but they are data heavy. Letting someone get a taste of your stuff before you make them get the PDF is nicer. Some people will roll their eyes & wonder - 'how big will this be?' Speed gives them a taste - and as nice as your stuff is they will HAVE to have your PDF.\n\nI actually think you could make web pages that are nearly identical to your PDF ( visually ) and add in a contact page ( or put that info on the 1st page ) and you would be almost golden. The main task would be to design the navigation so it doesn't interfere. But this is not impossible. Then the last thing would be to deal with your meta tags & descriptions ( different for each page ) and you will be quite well off. 90%!\n\nLastly, I think the \\*content\\* of your site will quickly make it clear you are not a web designer - so that you can have as nice a site as you want without provoking that worry. And if you get inquiries you can pass them on to your web designer - no?\n\n"
    },
    {
      "time": "19 Oct 2005 — 7:35pm",
      "content": "Good points, all. Back to the drawing board.\n\nps-wouldn't it be cool if making a website were as easy as making a pdf? Or book for that matter!\n\n"
    },
    {
      "time": "20 Oct 2005 — 12:18am",
      "content": "While I know there's a certain disdain, likely warranted, for web design/development, I'm always surprised by designers'/typographers' aversion to code. When I was first learning HTML, way back in 1997, the only route was to look at others' code and stare at it until the patterns emerged, and then to write a whole pile of it until something, anything, worked (in at least one browser on one platform, for starters). After many, many nights sitting up late and training my fingers to hit the angle-bracket keys it started to make sense. That process is the same one I go through every time I start a new book project, except instead of staring at code, I'm staring at a blank document in InDesign (or a blank sheet of paper). Format, text measure, margins, proportion, type size, leading, all of these are code, all the points and picas and glyphs; it's a matter of deciphering the blank space and finding the code to make it sing. This is what I meant by a missed opportunity. You hate code, fine. But in returning to it and grinding out a site, in going through that process, you're likely to bring something new to your book work. I'm excited these days by these kinds of challenges, even when they suck intensely in the moment. I know they're going to pay off, because the process is the payoff. All I'm suggesting is that you get away from ImageReady and dive in there. Carve out a means of presenting your work on-line by exploring the process of presenting your work on-line.\n\n"
    },
    {
      "time": "20 Oct 2005 — 1:24am",
      "content": "Sorry for butting in late to the discussion.\n\nI don't think the original design is entirely HTML un-friendly. It even seems to have the navigation built into it with the skills listed on the wooden board.\n\nIf I were to approach this, I would set out the content in a very simple HTML document (with no tables!):\n\n\\<div id=\"content\"\\>\n\n\\<h1 id=\"name\"\\>Gary Robbins\\</h1\\>\n\n\\<ul id=\"menu\"\\>  \n\\<li id=\"gd\"\\>\\<a href-\"#\"\\>Graphic Design\\</a\\>\\</li\\>  \n\\<li id=\"bd\"\\>\\<a href-\"#\"\\>Book Design\\</a\\>\\</li\\>  \n\\<li id=\"bb\"\\>\\<a href-\"#\"\\>Bookbinding\\</a\\>\\</li\\>  \n\\</ul\\>\n\n\\<p id=\"dowload\"\\>Please download: \\<a href-\"#\"\\>Portfolio\\</a\\> \\<a href-\"#\"\\>Resume\\</a\\>\n\n\\</div\\>\n\nThen with CSS I would put your image as the background image of the 'content' div and position the other elements over the appropriate parts of the image. Then I would hide the HTML elements so the links are still in the correct place and Google can read it all. Which should bring us back to where we started but with an accessible site.\n\nOh, and I'd center the content div and add a background image to fill the white space if that is what was wanted.\n\nErr, anyway, I've probably gone on too much now anyway, I just wanted to point out that the HTML itself can be really simple if it isn't muddied with tables.\n\nI hope that is some help,\n\nCheers,\n\nEd.\n\n"
    },
    {
      "time": "20 Oct 2005 — 9:36pm",
      "content": "Sorry Gary I have to agree with Jason, a single page with 3 links is hardly a web site, it gives me the impression of an unfinished temporary solution.\n\nAre you sure you can not&nbsp;afford a web monkey to build it for you? If you supply all the design elements and keep the layout simple it could be built in a couple of days at minimum cost.\n\nIf you dare build it yourself&nbsp;English designer Daniel Eatock invites people to use the template and code from his site:  \n [http://www.danieleatock.com/aboutthissite.html](http://web.archive.org/web/20150425045606/http:/www.danieleatock.com/aboutthissite.html \"http://www.danieleatock.com/aboutthissite.html\")\n\nAnyway, apart from all that, your work is very good.\n\n"
    },
    {
      "time": "3 Nov 2005 — 2:41am",
      "content": "You can use a program like Freeway Pro to piece together a website. I did mine - [www.stephenkelman.co.uk](http://web.archive.org/web/20150425045606/http:/www.stephenkelman.co.uk/ \"www.stephenkelman.co.uk\") which was not that much work. The next website I put together will be more competent (once you get on the learning curve you realise the creative possibilities of interaction). I work as a print designer, but when I was going for interviews having a reasonable website is certainly a big plus point.\n\nIn other words, it's well worth the 2 weeks work\n\n"
    },
    {
      "time": "22 Dec 2005 — 2:16pm",
      "content": "Your portfolio is great! I especially like your \"What is Activism?\" poster. Parson Products seems like something fun to flip through. I like the 2 books in 1 type thing.\n\nI agree that there should be more on the site itself. Like edeverett suggested the list on the board is a very logical point to insert navigation. In fact, I thought that was the navigation. I was dissapointed when I found out there were no other links.\n\nI say you should take the idea/presentation of your portfolio and translate it to the web. I'd take the wooden background and make it the background for your site and learn how to make a div tag in css for the description. Even if you just have one sample link/image in each of the categories it would be better.\n\nThat may seem daunting but there are plenty of resources to help you.\n\nCheck out:  \nw3c.org  \ncsszengarden.org  \noswd.org\n\n"
    },
    {
      "time": "21 Aug 2013 — 1:21am",
      "content": "Make more of the get in touch contact area and not really sure the format is the best use of the space. but over all it is pretty memorable and does the trick.\n\n"
    }
  ]
}
