{
  "id": "15727",
  "title": "Touchy Kerning",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m facing some uncertainty with this one and was looking for a little clear sighted feedback. I’m working with the kerning on this logo/masthead for a magazine. The pair in question is the “ro”. I want to keep the letters apart for the sake of readability, but it throws the kerning off.\n\nIn the two examples, the top version is fitted, the bottom version is not. Which do you prefer?\n\nThanks\n\n",
  "author": "<a href=\"/web/20090531082720/http://typophile.com/user/3457\" title=\"View user profile.\">Bouch</a>",
  "time": "<br>",
  "uid": "3457",
  "comments": [
    {
      "time": " 18.Oct.2005 3.19pm",
      "content": "\\> In the two examples....\n\nwhere?\n\n"
    },
    {
      "time": " 18.Oct.2005 5.02pm",
      "content": "Crud, the attachment didn’t attach. How about this:\n\n[Kerning Example](http://web.archive.org/web/20090531082720/http:/www.winzeler.com/temporary/nosotroskern.jpg)\n\n"
    },
    {
      "time": " 18.Oct.2005 6.35pm",
      "content": "You might try redrawing the ear of the r so that when it touches, it still reads. Slope the vertical of the ear back a bit?\n\nChrisL\n\n"
    },
    {
      "time": " 18.Oct.2005 6.44pm",
      "content": "Hell, don’t stop at redrawing the r. Redraw the whole thing and make it perfect. Logo design is NOT typesetting.\n\nJames\n\n"
    },
    {
      "time": " 19.Oct.2005 5.31am",
      "content": "For my taste all of it is too tight. Its a heavy face and could use the air around the characters. At least give it a look.\n\n"
    },
    {
      "time": " 19.Oct.2005 6.01am",
      "content": "Ok. I think I’ll go for opening things up a bit and working on the r. This is for a bilingual Latino magazine. Nosotros means Us. The closeness of the letters was intentional – to represent unity and togetherness, so I don’t want to lose that completely. Unfortunately, the budget on this is spent so I don’t have much more time to put into it.\n\nThanks\n\n"
    },
    {
      "time": " 19.Oct.2005 3.30pm",
      "content": "But do you really think the average reader will get the association of tight type (ie 70’s style) and unity? I don’t think so. You are reading to much into the design and name. Doesn’t anyone do focus groups anymore? Designers aren’t necessarly in touch with the end users of publications or any other communication.\n\n"
    },
    {
      "time": " 20.Oct.2005 5.44pm",
      "content": "With this particular word, there are too many solid-fitting character combinations to make tightening up an open combo the best solution for even colour. The way to go is to open up elsewhere, or do something radical, like a flying ear to the r.\n\n"
    },
    {
      "time": " 20.Oct.2005 8.43pm",
      "content": "I agree with Dan on this. It is too tight and given that the communication is a bilingual word play, you do lose legibility too much and it starts to look too contrived. You are reading too much into it.\n\nBut I don’t entirely agree on the veracity of focus testing - we’re constantly burdened by this - as interpretations can also be expectations by the target audience.\n\n"
    },
    {
      "time": " 20.Oct.2005 9.03pm",
      "content": "If I can voice an opinion, I’d say that it’s impossible to put too much emphasis on audience perception. It becomes an issue of “who is meant to read this?” Grafitti type is uncomfortable for me on a personal and aesthecic level. But if I’m designing for an audience that it particularly speaks to, as a designer — a communicator — I have to consider how I will best communicate the concept.  \nDesigners can easily fall into the trap of designing for designers instead of designing for readers. Listen to DanW when he says to pay attention to focus groups and other indicators to gauge how our work is, in FACT, being perceived.\n\n"
    },
    {
      "time": " 21.Oct.2005 10.50am",
      "content": "Thanks for all your comments. Maybe I am reading too much into it. Not sure. For this project, there is no focus group. All I have to go on is my own research, which is far from adequate, and what the clients tells us. Not being Latino myself what else do I have to go on?  \nWhat do you do when your given something to design and not given enough background? You’ve got to come up with a concept somehow or else your just shooting in the dark.\n\nI did open everything up a bit and altered the r. [Seems ok now.](http://web.archive.org/web/20090531082720/http:/www.winzeler.com/temporary/nosotroskern2.jpg)\n\n"
    },
    {
      "time": " 21.Oct.2005 11.09am",
      "content": "What if you created a metaligature\\* of “o” and “u” and used it where the asterisk is in “nosotr\\*s” (with the “\\*s” in orange)?\n\n\\* [http://typophile.com/node/14040](http://web.archive.org/web/20090531082720/http:/typophile.com/node/14040 \"http://typophile.com/node/14040\")\n\nhhp\n\n"
    },
    {
      "time": " 21.Oct.2005 11.24am",
      "content": "I have a couple of questions. Why is the u in us not Upper case? Like this\n\nNosotros(palmtree)US\n\nAlso why is the palm tree the color of Nosotros & not Us or a third color or a blend?\n\nI am not saying this should be the case but I found when I looked at the design these questions poped to mind right away. I also realize you were only talking about the r&o and didn’t ask about the design in general so ignore this if you want.\n\nFinally ( and ignore this too if you like) I think you should perhaps\n\n- pull the arm of the r back a little the closeness doesn’t look right to me and interferes with reading the text smoothly.  \n- Add some weight to the terminal ends of the s - they look weak in the context of a logo and  \n- add some weight to the Terminal ends of the N.\n\nWhat if you has some yellow light hitting the palm tree? Like the light was coming from the right side...\n\n"
    }
  ]
}
