{
  "id": "15731",
  "title": "Mixing Akzidenz with Helvetica?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "What would be the typographic ramifications of using Akzidenz Bold for headlines and Helvetica Neue Light for text?\n\nFurthermore, what would be the licensing ramifications of creating a custom font to be “distributed” corporation-wide, with a tighter tracked/kerned version of Akzidenz Bold and calling it, say, “Corporation X Headline” and mixing it with Helvetica Light as-is and calling it, say, “Corporation X Text”?\n\n [‹ Who first invented a pixelfont? History of pixelfonts?](http://web.archive.org/web/20070806185826/http:/typophile.com/node/15751 \"Go to previous forum topic\") [the high price of type ›](http://web.archive.org/web/20070806185826/http:/typophile.com/node/15647 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070806185826/http://typophile.com/user/750\" title=\"View user profile.\">formsubstance</a>",
  "time": "<br>",
  "uid": "750",
  "comments": [
    {
      "time": " 19.Oct.2005 5.36am",
      "content": "”...what would be the licensing ramifications of creating a custom font to be “distributed” corporation-wide, with a tighter tracked/kerned version of Akzidenz...”\n\nAnything involving Berthold fonts will probably launch a law suit from Chicago. You could always ask them or consult a lawyer but they have a litigious history in recent years.\n\nChrisL\n\n"
    },
    {
      "time": " 19.Oct.2005 5.54am",
      "content": "Changing anything in a font, even its name, often requires a special license, depending on the foundry. This would be necessary for Helvetica. I don’t know Berthold’s EULA stipulations.\n\n"
    },
    {
      "time": " 19.Oct.2005 6.54am",
      "content": "It looks like Berthold is set up to help you with this. See [http://www.bertholdtypes.com/purchase/licensing.html](http://web.archive.org/web/20070806185826/http:/www.bertholdtypes.com/purchase/licensing.html \"http://www.bertholdtypes.com/purchase/licensing.html\")\n\nPer Font Corporate licenses...\n\nOne Site US $3,750.00 / EUR 3.750,00 per font style  \nOne Country US $5,000.00 / EUR 5.000,00 per font style  \nWorldwide US $7,500.00 / EUR 7.500,00 per font style\n\nThey also suggest contacting them directly for custom licenses.\n\nI’m pretty sure the current Linotype license does not allow renaming (as this dilutes trademark protection) and I’d guess Berthold has a similar position. Any name change would need to be negotiated with the IP’s owner - eg “Helvetica Neue for Company X” might be allowed.\n\nHope this helps. Si\n\n"
    },
    {
      "time": " 19.Oct.2005 8.27am",
      "content": "If you buy from Linotype directly, or from FontShop, you can’t modify the font without special permission:\n\n“2.4 Modifying the Font Software is prohibited, even in the event that it is necessary for fulfilling personal design requirements. If the licensee wants to make modifications, consent and permission has to be obtained from Linotype Library GmbH. Non-compliance with this provision voids any and all support rights and warranties granted by Linotype Library GmbH and represents a violation and breach of this license agreement.  \nFurthermore, if the licensee or a third party or parties effect modifications to the Font Software despite the prohibition against such modifications, Linotype Library GmbH becomes the owner of that modified data.  \nSpecifically, it is prohibited to change or modify the Font/Trademark names used as identifying tags in the Font Software in any form or manner. If such changes or modifications become necessary, prior written consent has to be obtained from Linotype Library GmbH.”  \nSee [this page.](http://web.archive.org/web/20070806185826/http:/www.linotype.com/1710/licenseagreement-folder.html?PHPSESSID=414c21404c4f1e292f6270336592fc10)\n\nBut...\n\nIf you buy from Myfonts, the EULA offered states:  \n“2.4 You may modify the Font-Software to satisfy your design requirements. Such modifications are in every respect subject to this Font-Software License Agreement.”  \nSee [this page.](http://web.archive.org/web/20070806185826/http:/www.myfonts.com/viewlicense?id=8)\n\nIf you buy Helvetica Neue from Adobe, it’s hard to say. The EULA states:  \n“14.7.4 You may convert and install the font software into another format for use in other environments, subject to the following conditions: A computer on which the converted font software is used or installed will be considered as one of your Permitted Number of Computers. Use of the font software you have converted will be pursuant to all the terms and conditions of this agreement. Such converted font software may be used only for your own customary internal business or personal use and may not be distributed or transferred for any purpose, except in accordance with Section 4.4 of this agreement.”\n\nMake of all this what you will. Caveat emptor!\n\n"
    },
    {
      "time": " 19.Oct.2005 9.16am",
      "content": "The Linotype EULA at MyFonts is out of date. Unfortunately, the more restrictive license is the most current.\n\n"
    },
    {
      "time": " 19.Oct.2005 9.27am",
      "content": "Stephen:  \nNevertheless, if one buys from Myfonts, one is purchasing under the conditions offered. No one could expect a buyer to shop around for less favourable terms. If Linotype allows sales at Myfont, they must abide by the terms offered. The buyer clearly doesn’t make an agreement that he hasn’t even been shown.\n\nThat’s why it pays to shop around: as I say, if you buy from Adobe, you can convert to other formats, if you buy from Linotype, or, I believe, FontShop, you can’t.\n\nAs we’ve been over repeatedly, unless the initial agreement stipulates that future amendments are allowed, the agreement made is the agreement made.\n\nUnless, of course, you are suggesting that Adobe and MyFonts don’t have the authority to sell Linotype fonts.\n\n"
    },
    {
      "time": " 19.Oct.2005 9.32am",
      "content": "Stephen is correct. If you go looking for loopholes all you will find are out-of-date EULAs. MyFonts is aware of this and are working toward correcting it.\n\nThe best line of action would be to either set up a style sheet for the client including a necessary tracking amount or work with the foundry to customise the font for you and your client.\n\n"
    },
    {
      "time": " 19.Oct.2005 9.38am",
      "content": "I wouldn’t mix Akzidenz with Helvetica. Overall, Helvetica is a rounder shape and less strict in its details. You will only muddy the overall look by using two typefaces that seem so extrinsically the same but in reality are intrinsically different.\n\n"
    },
    {
      "time": " 19.Oct.2005 9.43am",
      "content": "I’d agree with Tiffany (on the licensing issues) talking to the vendors is really the only way to go. But unless you’ve backed yourself into a corner on these particular typefaces you might want to look for alternatives available from independent type designers who may be able to offer more flexibility.\n\nFor corporate use ’document embedding’ rights, sharing with partners (ad agencies, sign makers etc.,) further modification rights, format conversion rights, etc., are perhaps more important than price.\n\nCheers, Si\n\n"
    },
    {
      "time": " 19.Oct.2005 9.48am",
      "content": "\\> a tighter tracked/kerned version of Akzidenz Bold\n\nSo you want to transfer Helvetica’s major flaw to Akzidenz as well?\n\nhhp\n\n"
    },
    {
      "time": " 19.Oct.2005 9.55am",
      "content": "Tiffany:  \nI don’t understand. Are you saying that if a buyer purchases a font from Myfont or Adobe, his licence isn’t valid?\n\nAre you saying that the terms offered at Adobe, which clearly allow format conversion for fonts purchased there, aren’t valid? If that were the case, I think buyers would have genuine cause for complaint.\n\nAre you suggesting Myfonts is knowingly offering invalid sales terms?  \nHow can the buyer be expected to guess this?\n\nAs you know, this is a bit of a bugbear with me. I repeat: an agreement is an agreement. If foundries want to change the terms of their agreements, they can, but once it’s made, it’s made. One can’t be expected to abide by an agreement one didn’t make.\n\nImagine a judge listening to this:\n\n“Your honour, we expect the buyer to abide by the agreement we have here in our drawer, not the one we showed him, and that he signed!”\n\n"
    },
    {
      "time": " 19.Oct.2005 9.59am",
      "content": "John. I know it is completely lame. I don’t think it is MyFonts fault. I think the foundries should be more pro-active in making sure that any vendor who sells their fonts has the current EULA. I don’t think it is up to the designer to keep track. However, in this instance, as we have made it known, I think the designer should act responsibly.\n\nI’ll but Laurence and see if he can’t share his point of view.\n\n"
    },
    {
      "time": " 19.Oct.2005 10.09am",
      "content": "Tiffany, the point isn’t that it’s lame or not, the point is that if you’re a stickler for legalistics, you have to accept that this is something that simply won’t hold up in court. Unless the intent is to intimidate with an army of lawyers with nasty letters, in spite of a full awareness of the frivolity of it.\n\nhhp\n\n"
    },
    {
      "time": " 19.Oct.2005 10.15am",
      "content": "Ok, fair enough. The chances of a foundry coming after you are slim unless it is something huge and public anyway. But, if someone tells me that something is wrong I will think twice before doing it.\n\n"
    },
    {
      "time": " 19.Oct.2005 10.18am",
      "content": "What’s wrong is a possible\\* conflict between two font houses, which is clearly not the responsability of the buyer. It is neither legally not morally necessary for a buyer to treat a font house like some charity case and go out of his way to help them figure things out, and probably end up with the rawest deal.\n\n\\* In fact we don’t what they’re thinking - maybe it’s intentional?\n\nhhp\n\n"
    },
    {
      "time": " 19.Oct.2005 10.19am",
      "content": "Tiffany:  \nThe designer IS acting responsibly in securing the best legitimate terms on offer for his client. It would be very irresponsible to knowingly lead a client into an unfavourable agreement in order to, to what?, be nice to the foundry?\n\nIf the foundries can’t get around to updating their EULA, that’s really not any one else’s fault.\n\nAgain, imagine a contractor talking to a homeowner:  \n“I found the lumber you need on sale for half price, but I decided to let you pay full price, because I want to stay on good terms with my supplier. It just didn’t seem fair.”\n\n"
    },
    {
      "time": " 19.Oct.2005 10.20am",
      "content": "\\> Furthermore, what would be the licensing ramifications of creating a custom font...\n\nThis is not right. Bad idea! Why to do that?\n\n"
    },
    {
      "time": " 19.Oct.2005 10.32am",
      "content": "“Charity case” — I didn’t say that.\n\n“be nice to the foundry” — You know what. I suppose I am not the norm. I understand both sides and still want the best for the foundries. As someone who is aware of this I do what I can to make sure foundries are aware of these discrepancies. If you find a loophole, great, use it. I was just offering my point of view anyway.\n\nThere are soooooooooooooooooooo many typefaces out there. Instead of freaking out over a EULA, simply use a different typeface.\n\n"
    },
    {
      "time": " 19.Oct.2005 10.34am",
      "content": "In this specific case looking for loopholes or looking at the least restrictive license available from a reseller is the wrong approach. Even if the corporation is tiny, the fact that they want to distribute customized versions of the fonts should dictate that they work with the font owner directly. Even if they find a loophole that lets them do this, what happens when they want to do something that’s definitely not allowed? What do they do when they need another 500 licenses and the old EULA has gone away?\n\nLooking for the best deal or EULA is a good approach for personal or limited use, but it doesn’t always scale at the corporate level.\n\nSo again find myself on the same page as Tiffany. If the vendor is not offering you the licensing rights you need negotiate with them, and if you make no progress go elsewhere. Problems occur when designers back themselves into a corner on font choice and the vendor isn’t flexible - this was the case with my company. Until recently a company using Verdana as their corporate font had limited legal options if they needed a Type 1 version or a modified character or three.\n\n"
    },
    {
      "time": " 19.Oct.2005 10.48am",
      "content": "It’s true that the best terms might differ depending on the circumstances, but I simply don’t understand how shopping for the best terms constitutes a “loophole”, i.e.:” an ambiguity or inadequacy in the law or a set of rules”. The EULAs aren’t ambiguous (well, or at least that’s not the issue), just different.\n\n"
    },
    {
      "time": " 19.Oct.2005 11.13am",
      "content": "I agree with Tiffany. Just use a different typeface. BTW, not long ago I faced the same issue:\n\nA company contacted me to design fonts. They told me that they have samples. They didn’t email me samples, but fonts! They wanted me to change here-&-there, change the names...\n\nI said no!!! and yes — only if I draw from zero.\n\nSo no matter what is the EULA SHMULA — can’t afford a custom? use a different typeface!!!\n\n"
    },
    {
      "time": " 19.Oct.2005 12.28pm",
      "content": "The Linotype EULA on MyFonts corresponds with the current arrangement between MyFonts and Linotype. Of course, since customers agree to this particular text, it governs the usage of Linotype fonts purchased from MyFonts.\n\n"
    },
    {
      "time": " 19.Oct.2005 12.43pm",
      "content": "Thanks for that, Laurence.\n\n"
    },
    {
      "time": " 19.Oct.2005 1.03pm",
      "content": "“maybe it’s intentional?”\n\nConfirmed.\n\nhhp\n\n"
    },
    {
      "time": " 19.Oct.2005 2.17pm",
      "content": "Here’s a response to your first question:  \nHelvetica Neue LIGHT for text? How cruel! Is this a government document?\n\n; )\n\nI have had the most difficulty lately trying to read books set in light weights of Helvetica, and I’m not that old. The problem is twofold: Helvetica (as offered digitally) is spaced more for display than for text. Any use of any weight of Helvetica below 12 point requires some positive tracking; letters bleed together, destroying letter and word recognition. Also, Helvetica’s lettershapes push the boundary of ambiguity, meaning, a, e, s, all look the same, rn = m, and in English, you don’t want that kind of confusion. The deadly regularity of the strokes combined with the tight spacing makes for a singularly unreadable mess. Consider using a better-spaced type to start with, like Akzidenz Grotesk! Its proportions and spacing make it much more comfortable to read, though smaller sizes might require additional tracking.\n\nI’m sorry, the problem is threefold: Why a light weigh for text? It’s stylish, I’m well aware, but is it readable? How much text is there? What size are you setting all this text? Could you consider a different style of sans, a Humanist, for example, to make reading easier and gain some economy of space in the bargain? Are you stuck with AG and Helvetica? Several families of [Sans](http://web.archive.org/web/20070806185826/http:/www.fonts.com/FindFonts/detail.htm?query=mundo&pid=403346&page_id=20513&grab_id=0) offer a variety of weights for text and display and are more suited for extended reading. I wouldn’t recommend any light weight for text sizes.\n\nNow back to regularly scheduled EULA discussion.\n\n"
    },
    {
      "time": " 19.Oct.2005 2.35pm",
      "content": "“maybe it’s intentional?”\n\nPerhaps related to the Bitstream Linotype partnership?  \n [http://www.bitstream.com/corporate/news/press\\_2003/type\\_030718\\_linotypep...](http://web.archive.org/web/20070806185826/http:/www.bitstream.com/corporate/news/press_2003/type_030718_linotypepartner.html \"http://www.bitstream.com/corporate/news/press\\_2003/type\\_030718\\_linotypepartner.html\")\n\nBut as we’ve seen it certainly causes confusion for the few people who read the EULAs.\n\n"
    },
    {
      "time": " 19.Oct.2005 6.02pm",
      "content": "I can see using a light weight for sections of text but a whole book—perhaps a software manual where you need lots of variation to seperate the different levels of text. Helvetica would not be my choice but that is just me.\n\nChrisL\n\n"
    },
    {
      "time": " 19.Oct.2005 9.50pm",
      "content": "Once I used Akzidenz and they said to me, “We don’t use Helvetica here.”\n\nI’m still not over it.\n\n"
    }
  ]
}
