{
  "id": "15743",
  "title": "Cali Nonprofit Org Logo Design",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello TypeGurus -\n\nI am relatively new to this site and have been looking through some of the logo critiques and thought some of you may be able to lend your expertise to a project I am working on for the California Clean Money Campaign. The CCMC is an organization that is working towards removing private campaign contributions with public funding - here is their website and as you can see, their very long, quite plain, current logo, on the top left.\n\n[http://www.caclean.org/](http://web.archive.org/web/20131023142315/http:/www.caclean.org/ \"http://www.caclean.org/\")\n\nBasically they are looking for something this is \"inspiring\". Unfortunately we couldn't go with things like \"taking the pricetag out of politics\" since this kind of messaging is not as successful as voter empowerment etc. (Move beyond corruption to voter centric messages, voters want a government that helps all voters, government that is honest, open accountable..etc.) although I thought it made a great logo.\n\nWe are now at this point (Please see graphic) - which for the logo to resemble a ballot. I am trying to come up with some type of graphic for yet other versions. Keeping in mind, \"clean money\", or campaign finance reform, for honest, open government, fairness in elections, accountability and control...... so it's a lot of abstract ideas combined with a very long name.....\n\nThe first two designs were loved by the staff, but rejected by about half of the board members because the horizontal layout reminded them too much of a movie ticket. Hence the vertical versions underneath. Any thoughts, ideas, comments, suggestions, resources would be much appreciated! (please let me know if there's more background information needed...)\n\nThanks! Michelle\n\nP.S. I added two more older versions that were rejected. (RejectPrice.jpg & Reject2.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [CCMC.jpg](http://web.archive.org/web/20131023142315/http:/typophile.com/files/CCMC.jpg) | 521.26 KB |\n| [RejectPrice.jpg](http://web.archive.org/web/20131023142315/http:/typophile.com/files/RejectPrice.jpg) | 68.07 KB |\n| [Reject2.jpg](http://web.archive.org/web/20131023142315/http:/typophile.com/files/Reject2.jpg) | 79.45 KB |\n\n",
  "author": "xebede",
  "time": "19 Oct 2005 — 10:02pm",
  "uid": "9471",
  "comments": [
    {
      "time": "20 Oct 2005 — 5:42pm",
      "content": "What about a friendly mascot? A likeable dog who protect money against \"dirty money fox\". More Emotion! Less typografic formation, that must be encoded by viewer with energy. The poster in the bottom is best of all, especially legibillity, but it lacks of emotionaly relationship to compain. Typografically I wish more \"cleaner\" type. Yours has a \"used\" look.\n\n"
    },
    {
      "time": "20 Oct 2005 — 8:21pm",
      "content": "I think the big blocky type in bright colors all in caps are effective in capturing reader's attention, but when I first saw it, I thought it looked like it was trying too hard. It looked like one of those furniture ads, \"EVERYTHING MUST GO\".\n\nMaybe some lowercase text would help...\n\n-Andrew Welfle\n\n"
    },
    {
      "time": "21 Oct 2005 — 5:46am",
      "content": "Your graphics aren't serious enough for a serious subject. Loose the cartoon elements and make it a statement. It should be all type. It should just say VOTE for California Clean Money Campaign. Make vote the most important element. Don't trivialize this important drive by adding cute elements.\n\n"
    },
    {
      "time": "23 Oct 2005 — 1:00pm",
      "content": "Thanks for all of your feedback - It will definately help to get the wheels turning in an entirely different direction...\n\n"
    },
    {
      "time": "27 Oct 2005 — 11:43am",
      "content": "Too much for a logo, although would be fun for a poster. Do some word listing as to what inspires people in politics. I mean, I think we're all looking for fair, true democracy but contributions are definitely affecting that in a horrible way. So how do you visually portray the true meaning of democracy without going into a cheesy cliche? For you to decide, but my comments may spark something. Good shot, just not for an identity. Keep it up!\n\nJoseph Szala  \nVigor Graphic Design, LLC.  \n [www.vigorgraphics.net](http://web.archive.org/web/20131023142315/http:/www.vigorgraphics.net/ \"www.vigorgraphics.net\")\n\n"
    },
    {
      "time": "28 Oct 2005 — 10:19am",
      "content": "I find that the message is too easily idetified with Politics. I know that sounds rediculous since it \\*is\\* politics. But hear me out - the issue is that you want to break with politics as usual and give power back to ordinary folks. Your visual langauge/graphic approach says the opposite. It says: \"This is politics - as you usually ( visually ) see it\". When I looked at this I thought - \"Run away, this is the usual boring political lies' just before I started to read.\n\nI think that like me, anybody who is sick of politics as usual will look the other way before you have had a chance to get your message's foot in the door.\n\nI think you aught to use a newer fresher opproach to type. One that is less 'political looking'.\n\nI think Dan is right. Simpler would be better too. This hurts my eyes. You can get attention without being an eyesore. It is both possible & desirable. And not just for the reader - for your end result too.\n\nJust my 2 cents.\n\n"
    },
    {
      "time": "29 Oct 2005 — 10:22am",
      "content": "Hi guys,  \nI posted two more rounds of logos that were rejected, in batches previous to the ballot concept, I originally posted. One of which was a pricetag concept that I thought worked perfectly to communicate the concept of the organization very quickly & effectively, while also speaking to the politically unenthused. However, as I mentioned earlier, the messaging is not as successful when speaking about corruption in politics - although it is the second most successful, it is NOT the first. Therefore the need to commuicate \"honest, open government, fairness in elections, accountability and control……\" which I can only visualize right now by seeing the white house busted open with a can opener and letting the contents spew out...or just making it entirely see through, like wonder woman's invisible jet...however, I'm sure we could all agree that both of these ideas are not very functional logo concepts. Therefore the kick back to voting in the 50s or when the times \"seemed\" a little less corrupt then they are now - which is why the concept emerged for the ballot ticket, however old-school looking... I guess I failed to mention this - and perhaps my logo does not communicate this well...and looks more like a sale sign at a money laundering store (also another concept that needs to be avoided in the logo)\n\nThe second (much older) rejected logo - well that one we just sort of glossed over, since we moved onto the ballot concept, however I thought I'd share it with you, since it is a bit of a cleaner approach.\n\nHowever, my point being as a jaded as I am, (and only 11 years a voter), a logo that is less political looking is WAS my goal as well, which I have fervently expressed, however, definitely not the goal of an organization, that is political in every way what-so-ever. It's kind of like asking Apple to stop advertising the ipod.... Hence my dilemma.\n\nSo I just saw that almost 300 folks have looked at this and only you brave five have taken a whack at it. Hopefully my next two rejected batches will inspire more folks to window shop as well as join in this critique.\n\nbut I do think that stripping things down is the next step....especially when a fellow design colleague exclaims that the logo design hurts their eyes, and is an eyesore, youch!\n\n"
    },
    {
      "time": "29 Oct 2005 — 7:15pm",
      "content": "Michelle, I think the price tags come the closest to realizing your intended message. That lookes like a potentially strong direction to me. And the typography hits just about the note I was interested in. Strong, legible, interesting, and approachable! I wonder what it would look like with the tag's string making a dollar sign... I wonder what a dollar sign at the bottom & a politics on top and a hand pulling the two apart with explainitory text below would look like. What about cutting tag ($) off a jacket labeled politics. There are more ways to work on this for sure. Do you think you could rework this concept in some form - or is it really dead?\n\nI am sorry if my language about the political style example was too sharp. Just the result of writing too quickly. And; of course I meant that the graphic might hurt the eyes not your own good self. Cetainly as a fall back it was probably a safe one. I might have done the same thing myself. It is only the luxury of being a 3rd party that lets me be so forthright.\n\nI have worked for political orgs and I know what you mean whaen you say they are as political as can be. That is the tricky business of a designer of course - getting the client to stop asking themselves what they think they are & to start thinking about what will WORK for the business or organizational goals. Sometime folk are more attached to being something than to getting something done. As the Apple advertising the ipod seems to be working I would have to argue it's not an apt anology.\n\nHaving a 300 to 5 ratio is I think pretty common on typophile. It may be exagerated in this case by the topic being political. Some folks here might not agree with the goal of your camapaign. But I do.\n\nLastly I wonder if there is some way of phrasing things so that it isn't against something but rather for something else. Thats the old trick the right-wing uses all time - being for some clever but all too ephemistic idea. That and targeted character assasination. Well we can do that too! But in this case I think it's being for something that might work best. What would say are you campaigning for? \"An equal playing field in political expression\"? Maybe there is a better way of putting it.\n\n"
    },
    {
      "time": "30 Oct 2005 — 5:26am",
      "content": "The problem is by using visual gimmics you set the tone of the organization as not serious and your intended message might be lost. If the leaders of the organization don't agree then I hope the best for them. Its not unusal here that the only people who can run for public office and win are billionaires who spend millions of their own money to get elected (Mike Bloomberg), mayor of New York City. The New Jersey governors race, two billionaires spending millions on their campaigns. The average person who would try to rely on public funding doesn't have a chance.\n\n"
    },
    {
      "time": "30 Oct 2005 — 7:39pm",
      "content": "\\> The problem is by using visual gimmics you set the tone of the organization as not serious and your intended message might be lost.\n\nI can agree with that Dan. Lots of seemingly stupid/silly/unserious looking visual communication is HIGHLY effective. The question is what will work best. The goal of this org is to mobilize a populace. As many folks as possible stuffy isn't gonna cut it. Popular is micky mouse. Pikachu. Michelin man. Actually maybe a cartoon mascot is just what they need. Like Smokey the Bear.\n\nAlso Michelle, surely campaigns like this exist in other states and or countries. Have you researched their campaign images? There might be low hanging fruit out there.\n\n"
    },
    {
      "time": "31 Oct 2005 — 4:58pm",
      "content": "Hey Eben, Your ideas are good food for thought, the pulling apart concepts are very interesting. However as much as I think it is successful, the pricetag/money concept is something I have insisted on, yet have been told to dump, since they don't want to focus on the money out of politics issue, and I feel if I keep on pushing the issue I won't be listening to my client....\n\nDon't worry about the comments - it's good to get your hair ruffled once in awhile! :}\n\nHmmm, very interesting, \"An equal playing field in politial expression\" is definitely a good way of putting it or \"Leveling the playing field of politics\"... another analogy that doesn't involve speaking about money but communicates the goal of the organization in a very succint way....while bringing up new visual options.  \nThank you!\n\nOh yes,, I have looked at other orgs logos doing similar work and there's not too much going on....for example:\n\n[http://www.publicampaign.org/](http://web.archive.org/web/20131023142315/http:/www.publicampaign.org/ \"http://www.publicampaign.org/\")  \n [http://www.vote-smart.org/index.htm](http://web.archive.org/web/20131023142315/http:/www.vote-smart.org/index.htm \"http://www.vote-smart.org/index.htm\")  \n [http://www.citizen.org/](http://web.archive.org/web/20131023142315/http:/www.citizen.org/ \"http://www.citizen.org/\")\n\nI guess a Mr. Clean but for politics would be a good cartoon logo... Perhaps I will look into using the look and feel for cleaning products - but that definitely is all about using loud color and is not subtle or \"serious\" looking at all. In terms of the seriousness of a logo, the Tivo icon is not serious, but as a user of Tivo, I certainly don't think the company doesn't take themselves seriously because they have a logo that has a smily face on it with antennas. It's just to make someone who is threatened about technology feel comforted and appeased by a silly, cute little tv-guy...\n\n"
    }
  ]
}
