{
  "id": "1576",
  "title": "Emigre #63 [Scenic: The Acid Gospel Experience]",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "ANNOUNCING:   \n   \nEmigre #63   \nScenic: The Acid Gospel Experience   \n   \nWith this issue we turn once again to a long-time Emigre   \ncollaborator. This time, however, we hope to expose a different   \ndimension of his work.   \nBruce Licher is known mostly for his unique music packaging   \ndesigns (See Emigre 16 and 55). His hand-printed letterpress   \ncovers have earned him two Grammy award nominations and have   \nbeen featured in major design magazines and exhibitions   \naround the world.   \nLesser known (particularly to graphic designers), but just   \nas distinctive, are Licher's ventures into music with his band   \nScenic. For years Licher has integrated design and music, and   \nwe are eager to share with you the aural dimension of his work.   \nIn collaboration with Independent Project Records & Press, we   \nare proud to announce the premiere release of \"The Acid Gospel   \nExperience,\" Bruce Licher's new Scenic CD. This is the fourth   \nand also concluding release in a series of audible Emigre issues.   \nAccompanying the CD is Emigre magazine #63, whose content was   \nlargely determined by Scenic's evocative music. This time, we   \ninvited three artists to each select or create work underscoring   \nthe theme of landscape. Designer/illustrator Charles Wilkin,   \nphotographer Jason Fulford and painter Shelley Hoyt provide the   \nimages.   \nAlso, Zuzana Licko presents her first new typeface design in   \nnearly two years. Fairplex, a sixteen font family, has been   \na long time in the making. It was inspired by features found   \nin models ranging from the San Francisco Giants logo to Garamond.   \nWith tapered serifs that become more distinct and decorative   \nas size and weight increases, and an overall low contrast,   \nFairplex is designed to function as both an animated headline   \nfont and highly practical text face. We're subjecting it to   \nits first road test in the packaging and design of this issue   \nof Emigre magazine.   \nPublication date: August 10, 2002. Price $7.95.   \n   \nTo download a sample MP3 track from the new Scenic CD go to:   \n [http://www.emigre.com/EMag.html](http://web.archive.org/web/20131017181446/http:/www.emigre.com/EMag.html)   \n   \nThe subscription deadline for issue 63 is August 1, 2002.   \n   \n   \n--------------------------------------------------------------   \nPlease note: due to the high demand for our magazine, Emigre   \nhas changed its free subscription qualification; only   \ncustomers who regularly order Emigre products will receive a   \nfree subscription. For a minimum purchase of $39, a free   \n4-issue subscription will be automatically entered into   \nyour account (limited to one subscription per customer, U.S.   \nonly.) Or, you can simply buy a 4-issue U.S. subscription for   \n$16.00 at:   \n   \n [http://www.emigre.com/EMaSu.php](http://web.archive.org/web/20131017181446/http:/www.emigre.com/EMaSu.php)\n\n",
  "author": "Jared Benson",
  "time": "24 Jul 2002 — 10:45am",
  "uid": "3",
  "comments": [

  ]
}
