{
  "id": "15760",
  "title": "Fight: freebie fonts & font-pirating",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "how to fight with the whole thing so called freebie fonts? font-pirating?\n\nideas? solutions? actions?\n\n",
  "author": "david h",
  "time": "20 Oct 2005 — 10:32am",
  "uid": "8867",
  "comments": [
    {
      "time": "20 Oct 2005 — 10:57am",
      "content": "Ignore it and keep producing.\n\n"
    },
    {
      "time": "20 Oct 2005 — 10:58am",
      "content": "Ok. I over-simplify. But innovation leads old technology as useless. Thinking that way, new type makes the old type useless.\n\n"
    },
    {
      "time": "20 Oct 2005 — 10:58am",
      "content": "You go girl.\n\nhhp\n\n"
    },
    {
      "time": "20 Oct 2005 — 11:00am",
      "content": "David:\n\nExactly why do you feel the need to fight the whole freebie fonts?  \nI think we should fight people who insist on using \"bad\" type. Not the ones that actually are making something positive, like FREE fonts.\n\nNow, font-pirating... that's just like downloading music or movies from the web... It's a crime so some people avoid it... and some people keep on doing it...\n\nThe real question in issue (I think):  \n**What should we do to promote excelence in Typography?**\n\n- Educate the \"clients\"?\n- Promote professional Ethics?\n- Promote better education in schools so students/future professionals are better aware about the bennefits of using non-pirate Type designed by professionals alike?\n\nCheers,  \nPedro\n\n——  \n [www.typeforge.net](http://web.archive.org/web/20140128082209/http:/www.typeforge.net/)\n\n"
    },
    {
      "time": "20 Oct 2005 — 11:16am",
      "content": "_The real question in issue (I think):  \nWhat should we do to promote excelence in Typography?_\n\nRight on. This is exactly correct.\n\nMies van der Rohe said once that it was very important to be FOR something, rather than against something else. Great maxim, I think.\n\n"
    },
    {
      "time": "20 Oct 2005 — 11:20am",
      "content": "\\> The real question in issue (I think):  \nWhat should we do to promote excelence in Typography?\n\nok. you're right.\n\n"
    },
    {
      "time": "20 Oct 2005 — 11:32am",
      "content": "Totally and completely agree.\n\n"
    },
    {
      "time": "20 Oct 2005 — 11:47am",
      "content": "\\> _Promote better education in schools_\n\nI completely agree with tuning in students to font, type usage and certain issues regarding fidelity/quality and licensing in the same manner students are taught software programs.\n\nBy students, I used to think graphic design pre-grads, but now I think if there is anyway we could influence teachers as early as third-grade (about 8-9 years old when children first develop an understanding of ethics) would be a great influence as students mature.\n\nSince ALL users of computers and electronic communication devices are USERs and potential authors, designers, developers, etc., then there is no reason to narrow \"type sense\" to students of the visual arts. EVERY user uses type whether they are aware of it or not, and ANY user can decide to install fonts to the system, meaning they are in some way selective.\n\nPerhaps \"font selection\" should even become part of the Language programs (in USA we call it \"English class\") since all students will use computers to submit written assignments.\n\nThat is the main reason I am a strong proponent of expanding Typophile's [_Typographic Education_](http://web.archive.org/web/20140128082209/http:/typophile.com/forum/16) topic area and hopefully a resurrected _Projects_ area would at least centralize instructive material for visitors, educators and lurkers.\n\n"
    },
    {
      "time": "20 Oct 2005 — 11:57am",
      "content": "One of the things that can be done to promote excellence in typography is to let aspiring font designers learn by doing, which I believe I am entitled to say, as someone who produced somewhere in the neighborhood of 200 despicable freebie fonts. There are a lot of accomplished musicians who started out in pretty miserable garage bands, but they got to be where they are now by practice, practice, practice. Designing GOOD fonts is no different.\n\nYes, a lot of freebie fonts are utter crap; a lot of my early efforts were utter crap. They evolved into respectable semi-crap and, eventually -- with professional guidance and practice, practice, practice -- they evolved beyond crap (at least, that's my story). There are also a lot of freeware fonts that are quite good. So, the freeware vs. \"commercial\" argument doesn't wash.\n\nAs a former freeware fonter, I can also attest to the fact that there are a LOT of cheap bastards out there who will NEVER pay for a font, no matter how much they like it. There are even people out there who believe that, because you make freeware fonts, you are their presonal fontmaking slave: some of the requests that I have received in the past would boggle the mind with their brazen greed, sense of entitlement and utter cluelessness. So, let the jerks have their crap...they're not going to change their ways. And the pirates are going to keep on stealing until they get caught (and taken out into a back alley and have the snot beaten out of them)...that, unfortunately, is life.\n\nPromoting excellence in typography on a global scale is, most likely, a hopeless mission, if for no other reason than Thomas Aquinas' 700-year-old observation: _de gustibus non disputandum est_...that is, matters of taste cannot be argued or, in more modern terms, there's no accounting for people's taste. Within the circles of professional type designers and graphic designers, there are forums, exhibitions, etc., where what is regarded as excellence is recognized and rewarded, but it ain't gonna happen within the general populace, at least not until reality TV, hip-hop fashion and Regis Philbin disappear.\n\n"
    },
    {
      "time": "20 Oct 2005 — 12:07pm",
      "content": "\\> _Promoting excellence in typography on a global scale is, most likely, a hopeless mission_\n\nYes, I do agree, but in my opinion promoting a global _awareness_ of typefaces is a feasible endeavor.\n\nMy 4 year old granddaughter is starting to spell her name on the PC. Children are probably more attuned visually than their parents. Do you realize that by the time many children reach the first grade, they would have had a year or two of computer interaction.\n\n"
    },
    {
      "time": "20 Oct 2005 — 12:19pm",
      "content": "Forgive me, but I may be pushing this from another perspective.\n\nIn my earlier incarnation I promoted font sales by producing both marketing and educational material on type styles and type usage. Not all the purchasers of fonts had a real sense of typographic excellence, but they still wanted the fonts (the true meaning of font) because they were either _in style_ or they were convinced that it would somehow improve their output.\n\nYou will have a much easier time selling fonts in the future if the general public became more aware of style differences. The general consumer market is already convinced that one brand of jeans or sneakers is actually _better_ than another less expensive brand.\n\nI would eventually like to help improve the marketability and usage of fonts on both consumer and expert user markets, as that's what I did in the past for Agfa-Compugraphic.\n\n"
    },
    {
      "time": "20 Oct 2005 — 1:33pm",
      "content": "A useful lesson for all type users (and many type designers) might come from the very name of this thread: We oppose font pirates, whether they offer pirated fonts for sale or giveaway. These days, plenty of pirates sell plenty of crappy fonts with impunity. To whom?...\n\nWe approve of talented, honest designers who develop quality fonts and share them, whether by selling or giving them away. There are some very good free fonts out there. So it's not necessarily free vs. commercial. It is based in ethics and in quality. High-quality font houses might reasonably offer a free font in an effort to entice buyers. The freebie collectors will visit their sites, grab the freebies, and disappear, fixated on the next free item. But it seems sensible to consider free fonts as part of the market for fonts. Other marketing techniques we see all around are variations on \"free\" fonts: bundling with applications, bundling with printers, bundling with each other, adding value and providing incentive.\n\nIn all this, we still find that the general public is almost completely oblivious to the provenance of typefaces. Fonts are just on their computer, or downloaded from the web. They just apppear. Nobody \"works\" at making fonts, they just happen. So no wonder people would shell out full price for crappy ripoff fonts without having any idea what options they have in terms of quality. No wonder so many refuse to pay for something as well-crafted as Minion or Gotham. All fonts are the same.\n\nThat ignorance, obliviousness, is what we really oppose. The options in the market exist as they always have. But Norbert has an important point: All computer users are potentially active, not passive users of type now. That is radically new. So many new people dealing with type selection, size, weight, leading, letterspacing, not to mention common mistreatments of type like stretching and sloping, grunge-ifying, and other \"special effects\". All those people who might very well like to know more about type use..... As Norbert says, a more widespread awareness of type use and type manufacture would go a long way to helping the type industry in terms of perceived value.\n\n"
    },
    {
      "time": "20 Oct 2005 — 5:39pm",
      "content": "I'm not going to complain about the font business, because I think it's doing quite well for a lot of people.\n\nBut on a matter of principle, it seems to me that the biggest free-font bad guys are Adobe, Apple, and Microsoft, with their font-bundling.\n\nThere's no way that those it impacts most, independent foundries, can do anything about it.\n\nAfter all, it's the EU versus Microsft in a court battle that's lasting years (over software bundling - stuff like Real Player), with 100s of millions$ at stake, but fonts are not part of the case. Because it's only fonts.\n\nSo, in answer to \"how to fight\", words of wisdom from Gord Downie, \"Do you think that you're right, because I won't fight?\"\n\n"
    },
    {
      "time": "20 Oct 2005 — 6:03pm",
      "content": "\" we could influence teachers as early as third-grade (about 8-9 years old when children first develop an understanding of ethics)\"\n\nI also want to throw in that even age 6, when kids are really picking up reading and writing, can a good time to start making them aware of typography. They are so focused on individual letters and on trying to reproduce them that it can be a great age to plant the idea that type can be beautiful, and that people put a lot of effort into making it that way.\n\nI've watched my daughter try to perfect a certain kind of lowercase a, and have had her ask me why a letter can be the same letter but have a very different appearance.\n\nEven in my son's daycare, when the educator reads a story to the kids she points out who the author is and who the illustrator is, highlighting the idea that someone's creative work went into producing the book. Perhaps a similar kind of awareness (ok, perhaps not to 4 year olds) could be promoted for type.\n\nK.\n\nThat said, I just bought my first type. I bought Parable. :)\n\n"
    },
    {
      "time": "20 Oct 2005 — 6:31pm",
      "content": "Targeting university-level students by forcing them to take a course on actual type design would really raise the awareness level amongst designers coming fresh out of university I'd think. A course where they would be led them through the process of designing both a text and a display face including an extended set of glyphs with proper ligatures, accents for multiple languages, etc.\n\nWhile some students would find this to be a very unique experience giving them more insight into an often overlooked aspect of design, I'm sure others would find it excruciating having to flesh out just the basic letters that make up an English alphabet.\n\nIn both cases having gone through the process of type design, they'd probably have a better appreciation for what goes into an expert set with proper metrics and extended glyphs and, ideally, more respect for those who dedicate their lives to creating type.\n\nMaybe most universities do offer such courses, but I do know that mine (sadly) doesn't.\n\nT\n\n"
    },
    {
      "time": "21 Oct 2005 — 8:51am",
      "content": "There are really two main issues at hand here.\n\n1- Among current (and future) type specifiers (those who actively select typefaces for print or on-screen usage), is there a way to guide them towards font purchases that would improve sales for mid-to-small type foundries.\n\n2- Within the gerenal PC/Mac user base, is there a way to \"entice\" a percentage into occasional font purchases.\n\nSince this topic thread is mostly about loss of potential font sales (which is often the only means of revenue for type designers and font developers) due to \"freebies\" and pirated versions, the purpose of \"type education\" is to help improve font purchases. I hope most of you know that I am a true proponent of improving typographic awareness in graphic design professionals, but \"educating\" the consumer is another matter entirely.\n\nIf we could separate education for better type usage, and the marketing of fonts to a growing user base, we can begin to assess current situations and propose solutions for one or the other, or both. In terms of marketing, converting a small percentage of the user base could mean significant increases in font sales.\n\nThe problem would then be (as in all markets) who will get market share.\n\n"
    },
    {
      "time": "23 Oct 2005 — 7:48am",
      "content": "Type design friendly organizations en toto could sponsor an award/annual something like the paper companies do. Entries for the award would have to show usage of typefaces that were not bundled or free and released within the past 3 years.  \nPaper companies have stipulations for entry such as \"Letterhead design using 'Brand-X' paper,\" In our case, there would be no brand or designer limitation, only that the face be new, commercially available, and purchased.\n\nChrisL\n\n"
    },
    {
      "time": "23 Oct 2005 — 9:08am",
      "content": "Chris, you've brought up a significant point regarding current type marketing and paper companies.\n\nNo type foundry or distributor today places the same significance on producing printed samples, specimens, promotional literature, etc. as when type was mated with high-end typesetting equipment, hot or cold.  \nAs a result, designers are no longer stimulated or inspired by seeing PRINTED examples of exquite or radical typography.\n\nThat's why \"old timers\" are so reluctant to discard any of the printed pieces they own... once it's gone there will never be another.\n\nOn-screen or PDF review of typefaces is quite another visual experience plus so readily available, making every sample \"commonplace.\"\n\nToday, only printing and paper companies continue producing exemplary printed works in order to market their product or service. Paper and printing costs today (and postage for direct mail) have become prohibitive for the budgets of most type foundries. But for printing and paper manufacturers it's their bread & butter.\n\nThere may be great merit in looking to the print and paper industries for continuance of exemplary samples of typography in print. I know this is an open forum, so in some ways I personally feel devising actual plans should not be for public view. Just my opinion.\n\n"
    },
    {
      "time": "24 Oct 2005 — 12:29am",
      "content": "It may be a bit premature to start teaching children about the ethics of an economic system they don't know exists. They have to know the basics of buying and selling before they can really understand how that applies to intellectual property. That said, I agree with Norbert's suggestion that good type design should be part of the language program. Many students in English classes (or whatever else) need to be instructed in the basics of good typography before they start using paper and ink on awful-looking reports. For example:  \nIn my highschool composition class, there was one girl who turned in a paper hand-written with a yellow highlighter. The teacher told her it was illegible, and that the paper was supposed to be typed anyway. (I could get into the issue of poor penmanship, but that would probably make me sound older than I am). So she typed and printed the paper, set in Papyrus, and with the very same yellow.  \nThis may not have anything to do with the problem of type piracy, but for the sake of promoting good design, there are other things to deal with first. Students need to know what makes a font appropriate for a particular use, and most don't care about anything beyond that. I dare say most will never buy a font in their entire lives. They'll stick with bundled fonts, and there's not much to do about that.  \nI'd also like to add that as a college student, I wouldn't like being forced to take another class. It's one that I would likely take anyway if it were offered, but I'd like to have the choice. I'm not in a situation in which I can afford to buy fonts—that's why I make my own—and additional costs for classes aren't going to convince me to spend more.\n\nYes, I'm one of those cheap bastards who will never pay for a font (well, not for a while). Sorry.\n\n"
    }
  ]
}
