{
  "id": "15773",
  "title": "Who designed 'Old English'?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Can anybody give me info about ’Monotype Old English’ designer/s?  \nIn the book ’Treasures of the British Library’ I’ve found a certain similar features in the english approach to black letter.  \nWas Old English inspired in some particular manuscript or sample?\n\nThanks in advance.\n\nRamiro E.  \n [http://www.re-type.com/notaweblog/](http://web.archive.org/web/20071118040539/http:/www.re-type.com/notaweblog/ \"http://www.re-type.com/notaweblog/\")\n\n [‹ Where would I place a logo into the keyboard?](http://web.archive.org/web/20071118040539/http:/typophile.com/node/15811 \"Go to previous forum topic\") [Fight: freebie fonts & font-pirating ›](http://web.archive.org/web/20071118040539/http:/typophile.com/node/15760 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071118040539/http://typophile.com/user/1137\" title=\"View user profile.\">RamiroE</a>",
  "time": "<br>",
  "uid": "1137",
  "comments": [
    {
      "time": " 21.Oct.2005 7.42am",
      "content": "Dan Reynolds can probably give you the real story since he is a real blackletter admirer. From what my feeble memory tells me, Olde English was derived from blackletter manuscript. I don’t know if there was a particular manuscript or just the genre. Dan will know though.\n\nChrisL\n\n"
    },
    {
      "time": " 21.Oct.2005 7.56am",
      "content": "Each country in Europe had its own distinctive scripts, including its own blackletter, before type was invented. Typefaces grew out of these as typefounding arose in each country. Monotype Old English was probably based generally on Caslon’s blackletter types.\n\n"
    },
    {
      "time": " 21.Oct.2005 8.01am",
      "content": "Robert Norton wrote that it was Monotype’s version of Cloister Black credited to Morris Fuller Benton and Joseph W. Phinney (Tom’s dad?)\n\n[http://www.myfonts.com/search?search%5Btext%5D=old+english](http://web.archive.org/web/20071118040539/http:/www.myfonts.com/search?search%5Btext%5D=old+english \"http://www.myfonts.com/search?search%5Btext%5D=old+english\")  \n [http://www.myfonts.com/search?search%5Btext%5D=cloister+black](http://web.archive.org/web/20071118040539/http:/www.myfonts.com/search?search%5Btext%5D=cloister+black \"http://www.myfonts.com/search?search%5Btext%5D=cloister+black\")\n\n"
    },
    {
      "time": " 21.Oct.2005 8.02am",
      "content": "Mark, with all due respect, I know that already. I’m looking for deeper and specific information about ’Old English’. Thanks.\n\n"
    },
    {
      "time": " 21.Oct.2005 8.06am",
      "content": "In that case: Cloister Black was probably based generally on Caslon’s blackletter types.\n\n(edit: this was in response to Si’s message)\n\n"
    },
    {
      "time": " 21.Oct.2005 8.09am",
      "content": "_Mark, with all respect, I know that already. I’m looking for deeper and specific information about ‘Old English’. Thanks._\n\nOh, okay. I thought you were wondering about the general style.\n\n"
    },
    {
      "time": " 21.Oct.2005 8.15am",
      "content": "Ramiro, Mark’s background info is important - I think you’ll find that as a generic design / revivial this cut will be credited to the Monotype Drawing Office, and not an individual. Have you contacted Monotype directly? If not I’d start with the UK office.\n\nCheers, Si\n\n"
    },
    {
      "time": " 21.Oct.2005 9.11am",
      "content": "\\> Tom’s dad?\n\nA distant uncle, if I remember correctly.  \nAnd I think he can trace his surname back  \nto Plymouth Rock or something.\n\nhhp\n\n"
    },
    {
      "time": " 21.Oct.2005 9.56am",
      "content": "I can trace my surname back to a sponge-diving village in Greece, two whole generations :-)\n\nChrisL\n\n"
    },
    {
      "time": " 21.Oct.2005 10.29am",
      "content": "\\>A distant uncle\n\nThanks it’s coming back to me now - I knew there was some connection.\n\n"
    },
    {
      "time": " 21.Oct.2005 2.55pm",
      "content": "I don’t know who designed Monotype’s Old English. Someone in England or the states, though. Have you tried contacting Monotype directly? My bet is that it is an old Stephenson Blake, Caslon, or some other English foundry type.\n\n“Old English” is English Textura. Its roots go back to Wynken de Worde. Most of the fonts that we think of as “Old English” though are are ca. 1820s American lettering designs, or ca. 1890 English, late/Victorian historicist creations. I don’t always consider them “real” blackletters… but that is just my opinion!\n\n"
    },
    {
      "time": " 21.Oct.2005 4.34pm",
      "content": "The Early Gothic script had evolved into angular known as Textura Quadrata (Old English\\* & Black Letter) and Textura Prescisus (Black Letter) — used for both secular & religious book text.\n\nSamples: - 13th century Windmill Psalter  \n - The Metz Pontifical\n\n\\* “Old English, if it means anything, indicates that this letter was also used in England during Gothic times. As an amusing commentary it may be mentioned that the Gothic letter, in its own time, was known as ’littera moderna’ — A. Nesbitt\n\n"
    },
    {
      "time": " 21.Oct.2005 7.52pm",
      "content": "I don’t know about the relationship between Monotype Old English and Cloister Black.\n\nI do know that Cloister Black was a 1904 ATF design variously credited to Morris Fuller Bention or Joseph W. Phinney (though sources for the latter are stronger). It is a very similar but arguably inferior adaptation of Caslon Text (which I will not presume was necessarily a true Caslon face - c.f. Caslon Antique, a Caslon in name only for sales purposes).\n\nI also see that Mac McGrew shows that there was a Monotype metal version of Cloister Black. This confuses me, because AFAIK cross-licensing was not normally done back then between ATF and the automation companies (Mono, Lino).\n\nBrief geneological note: Both Joseph W. Phinney (1848-1934) and I are descended from John Phinney (1638-1718?) whose father John Finney arrived in America around 1638-39, along with his mother. John Jr married Mary Rogers, whose family had come over on the Mayflower. The patrinomial lineage can only be traced back to the 1500s, in Lenton, Nottinghamshire, England (a small village just outside Nottingham).\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 22.Oct.2005 9.21am",
      "content": "Thank everybody for the information.  \nI just wrote a little column about beer labels and lettering. In spanish, sorry.  \n [http://www.re-type.com/notaweblog/](http://web.archive.org/web/20071118040539/http:/www.re-type.com/notaweblog/ \"http://www.re-type.com/notaweblog/\")\n\n"
    },
    {
      "time": " 22.Oct.2005 9.42am",
      "content": "Wow! Beautiful to look at, even if I can’t read it.\n\n"
    },
    {
      "time": " 22.Oct.2005 9.51am",
      "content": "Second that, a great site. With a babelfish translation it seems quite easy to follow.\n\n"
    },
    {
      "time": " 24.Oct.2005 2.37am",
      "content": "One more thing: according to one mail I’ve received from a professor...\n\n’The interesting thing about ’Old English’ as a style is that it is French — Caslon’s ’Black’ is a close copy of French textura gothic types of the early 16th century, which were cast in England from imported French matrices.’\n\n"
    }
  ]
}
