{
  "id": "15777",
  "title": "What is worth knowing and when?",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "What topics need to be covered in a first year typography class? How many classes of typography should design students be put through?\n\nI have noticed that a lot of designers who teach typography focus on designing with letterforms and not really explain how to develop more practical things such as designing traffic tickets or math formulae.\n\nShould these kind of projects be included in a beginning type class or should another class be developed to cover things like tables, math, train schedules, and phonebooks?\n\nAt what point should a type student try his hand at designing a typeface?\n\n",
  "author": "1dglover",
  "time": "21 Oct 2005 — 9:08am",
  "uid": "8120",
  "comments": [
    {
      "time": "21 Oct 2005 — 9:34am",
      "content": "\\> _Should these kind of projects be included in a beginning type class or should another class be developed to cover things like tables, math, train schedules, and phonebooks?_\n\nThere are actually so few classes truly dedicated to typography, so most become general guidelines for type usage.\n\nOut of practicality, graphic design students today are caught in a barrage of various topics, techniques and disciplines regarding design, software programs, pre-production methods, and so on, so in reality no single area of knowledge is \"complete.\"\n\nI do apologize that I must divert my attention to something else at the moment, but I will revisit the topic again. Others in this forum are currently involved with the same issues you are raising.\n\n"
    },
    {
      "time": "21 Oct 2005 — 10:15am",
      "content": "I would say there is a fine line in between good saturation and over-saturation for first year students. It is a critical year as they aren't hardened helvetica lovers yet.\n\nThe wiki has tons of links to useful information for your daily browsing pleasure:  \n [http://typophile.com/wiki/Indices](http://web.archive.org/web/20150417083906/http:/typophile.com/wiki/Indices \"http://typophile.com/wiki/Indices\") -- Specifically look at BLOGS and BOOKS.\n\n"
    },
    {
      "time": "21 Oct 2005 — 10:20am",
      "content": "A millennium ago when I was in design school, we did typography projects including order forms, Annual Report tables, charts as well as the usual page layout stuff. This was before computers so it was a different world without the instant feed back postscript gives you.  \nToday, it is rare to see young designers fresh out of school who can set decent running text without bad rag or hyphenation gone mad. I wish design schools would begin teaching the practical parts of typography including tables and subhead series so that kids getting out of school would have a marketable skill to help them get in the door. Employers want to hire people who can hit the ground running. All the typographic skills are NEEDED on the ground. The fun typographic play is sweet and also needed but don't forget the meat and potatoes to go with that desert.\n\nChrisL\n\n"
    },
    {
      "time": "21 Oct 2005 — 11:43am",
      "content": "i hate to say it, but choice is the problem.\n\ni always thought it would be useful to create an assignment where the student is only allowed to use Courier to create a complex layout that incudes headlines, subheads, body text, captions and couple of charts and tables (or whatever). this would force the student to excercise the skill to arrange the type so that it works.\n\nthe idea is to remove the font from the equation, therby placing an emphasis on  \n\"working it\". the absence of a good typeface of one's own choice would also allow a student to understand why it is important to work with a good font family (with good spacing!), and some of the problems one might run into when the type palette is limited.\n\nthis might actually lead to \"damn, i wish i had those small caps!\" or other interesting discussions that stem from these types of limitations.\n\nin general, i think a possible solution might have to do with eliminating some of the overwhelming choice that students have today in order to let them focus on some of the basics.\n\n---------  \n::nc\n\n"
    },
    {
      "time": "21 Oct 2005 — 12:32pm",
      "content": "Type measuring is a must. I still find some designers who measure type in milimeters or who doesn't measure type at all.\n\nHéctor\n\n"
    },
    {
      "time": "21 Oct 2005 — 5:11pm",
      "content": "In the first type class I ever took, the very first assignment was kerning. I had to cut out the individual letters in a word and manually space them out. The assignment kind of drove some people up the wall because we knew nothing about type at the time and this introduction felt really technical and mundane.\n\nBut the assignments that followed were more creative and focused on letterforms. I think it was at this time that people began to like type. Simultaneously in other classes, there were assignments that had practical application and used a lot of type in things like tables and brochures. I think the mix of the two classes together made a lightbulb go off for many people, and they really began to understand type. This duality seems to work, so yes, I think there should be another class to cover all the practical bases.\n\n"
    },
    {
      "time": "25 Oct 2005 — 2:00pm",
      "content": "\\> _how to develop more practical things such as designing traffic tickets or math formulae._\n\nI have started to jot down some of the \"ponderings\" that came to mind after thinking over this topic thread and have found that for me, developing a \"keen\" vision for letterforms and the ability to self-evaluate one's work will open the door to finding practical solutions using type. Finding ways to bring students through this threshold is the real question at hand.\n\nI've spun of another topic on [more ponderings on type education](http://web.archive.org/web/20150417083906/http:/typophile.com/node/15844).\n\n"
    },
    {
      "time": "20 Feb 2006 — 3:25am",
      "content": "I accidently posted in the wrong thread, disregard. :)\n\n"
    },
    {
      "time": "22 Apr 2006 — 5:43am",
      "content": "One thing that is no longer taught is charachter counts, this was a must in a pre-postscript environment. Most type houses carried specimens that had guages at the bottom of the page for copy to be set at size/pica length. Size, leading, line length, headlines all had to be thought out first. Too small a font size and your copy just stopped, to large and even worse you had overruns. It is incredibly difficult and time consuming to do, so many designers had knowledge of a few fonts and used them, compared to now where most designers use whatever and never get to know a font.\n\nI used set type for a famous designer years ago, and upon a chance meeting he said \"they (his design support staff) don't even know what leading is and I do not have the time to fight them…\"\n\nRodi\n\n"
    },
    {
      "time": "22 Apr 2006 — 6:48am",
      "content": "\\> _Size, leading, line length, headlines all had to be thought out first._\n\nYes, totally agreed. In pre-Postscript days (or more acurately, Pre-Desktop Publishing days), type-specing and copyfitting were both costly (if you sent out for typesetting) and time consuming (even if you had your own typesetting equipment). This necessitated accurate pre-planning and preparation of layouts as they went into production.\n\nA lot of calculation AND visualization took place. With the use of type specimen sheets, character count tables, type gauges and a calculator, designers/typographers had to completely envision the end result prior to full production. \"Seeing\" the end result of typesetting prior to the actual hard-copy developed awareness and sensitivity to type, what it was and had it had to be used.\n\nType selection and copyfitting via \"menu-options\" allows for a great amount of \"fudging-around\" and often leads to responses like, \"_Hmmm, it all fits and looks fine enough._\" or \"_If I open the line spacing by another point, the copy will fit the page.\"_\n\nIf building a page or project can be quickly and efficiently done, the need for designers to be versed in the _Black Arts_ (an old print term that has completely lost its meaning) is very little.\n\nAlso, I don't believe final output is being as closely scrutinized by as many project team members either. In our shop the copywriter, typographer and creative manager had to sign-off on all typesetting prior to printing.\n\n"
    }
  ]
}
