{
  "id": "15781",
  "title": "Cleartype fonts and kerning",
  "forum": "Design",
  "tags": [

  ],
  "content": "I have the cleartype fonts that will be available in Windows Vista, thta is, Calibri, Constantia, Corbel, etc.\n\nThey are freely available as OpenType fonts based on Truetype outlines.\n\nThey have no kerning, in thay they are listed in Typograf as having no kerning, and trying to kern them in MS Word 2003 has no effect.\n\nSome characters look kerned, some don’t, or is there some kind of auto-kerning inherent in Cleartype technoogy (that is, the fonts are already kerned)? Several versions I have of them have no kerning. Weird.\n\n [‹ Dax Compact vs. Condensed](http://web.archive.org/web/20080924105545/http:/www.typophile.com/node/16097 \"Go to previous forum topic\") [some thoughts on a business card(update) ›](http://web.archive.org/web/20080924105545/http:/www.typophile.com/node/16004 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080924105545/http://www.typophile.com/user/9249\" title=\"View user profile.\">Palatine</a>",
  "time": "<br>",
  "uid": "9249",
  "comments": [
    {
      "time": " 21.Oct.2005 6.42pm",
      "content": "\\> I have the cleartype fonts...\n\nhow?\n\n"
    },
    {
      "time": " 21.Oct.2005 6.57pm",
      "content": "I downloaded them. They are avilable on certain sites around the web. Free.\n\n"
    },
    {
      "time": " 21.Oct.2005 7.15pm",
      "content": "Christian,\n\nI don’t think Microsoft has officially released them, so those are probably leaked copies, i.e. warez. But Simon should know for sure.\n\n"
    },
    {
      "time": " 21.Oct.2005 7.17pm",
      "content": "These are definitely not supposed to be available for download. Nor, I believe, will they be even when Longhorn is made available ... or is it now called Avalon. If I were you I would delete them off of your system and forget about them.\n\n"
    },
    {
      "time": " 21.Oct.2005 7.25pm",
      "content": "Hi,\n\nPre-release versions of the fonts are included in the Windows Vista beta version distributed to many beta testers around the world. A few sites (through ignorance or mischief) zipped up the fonts and posted them for download. We’ve been quite successful at having some of these removed, and are working on the others. As anyone who’s had their stuff posted on the web will know it’s an uphill battle to get it taken down.\n\nChristian, if you can forward me the site address ( [simonda@microsoft.com](mailto:simonda@microsoft.com)) we’ll get in touch and ask them to take the fonts down.\n\nOh, and the CT Collection fonts in the Windows Vista Beta have OpenType kerning - not old-style TTF kerning.\n\nMany thanks, Si\n\n"
    },
    {
      "time": " 22.Oct.2005 9.08pm",
      "content": "No problem, I’d be happy to forward the site address(es). It seems that not only are these leaked fonts warez, but they’re also useless because they’re unkerned.\n\nThanks for the heads-up everyone.\n\n"
    },
    {
      "time": " 22.Oct.2005 9.16pm",
      "content": "What’s this difference between old-style and OT kerning again?\n\nAnd it seems strange that somebody would  \nend up distributing a handicapped version.\n\nhhp\n\n"
    },
    {
      "time": " 22.Oct.2005 9.22pm",
      "content": "Here you go...\n\nThe TrueType ’kern’ table - [http://www.microsoft.com/typography/otspec/kern.htm](http://web.archive.org/web/20080924105545/http:/www.microsoft.com/typography/otspec/kern.htm \"http://www.microsoft.com/typography/otspec/kern.htm\")\n\nOpenType Kerning -  \n [http://www.microsoft.com/typography/otspec/features\\_ko.htm#kern](http://web.archive.org/web/20080924105545/http:/www.microsoft.com/typography/otspec/features_ko.htm#kern \"http://www.microsoft.com/typography/otspec/features\\_ko.htm#kern\")\n\nCheers, Si\n\n"
    },
    {
      "time": " 22.Oct.2005 9.30pm",
      "content": "Hrant:\n\nSome people simply don’t know any better. I’d wager that these same individuals don’t know what kerning is.\n\nsii:\n\nThank you.\n\n"
    },
    {
      "time": " 22.Oct.2005 9.55pm",
      "content": "Thanks a LOT for adding to my reading list, Simon... ;-)\n\n\\> Some people simply don’t know any better.\n\nBut isn’t it <cite>harder</cite> to actually make unkerned versions?  \nIt doesn’t seem to make sense.\n\nhhp\n\n"
    },
    {
      "time": " 28.Oct.2005 5.05am",
      "content": "Most people might think this is a simple topic: cleartype fonts should have kerning. I think that’s okay for print. But my understanding of CT \\*today” is that the rasterizer does not care much for horizontal hints, right!? Now for a brief detour: Most type designers I know are of the opinion that if \\*one\\* thing goes wrong with a text face, pffffft goeth the quality. Well, if you’re not spacing meticulously (at screen resolutions), what good are unhinted kerning pairs added to said mix? Hmmmmm?\n\n"
    },
    {
      "time": " 28.Oct.2005 8.28am",
      "content": "This is true for a font designed for screen reading, where likely environments are web browsers, which don’t tend to apply kerning, and Word processors which don’t apply it by default - some apps mess up the spacing regardless trying to render a page wysiwyg.\n\n"
    },
    {
      "time": " 28.Oct.2005 9.56am",
      "content": "Simon said “Oh, and the CT Collection fonts in the Windows Vista Beta have OpenType kerning - not old-style TTF kerning.”\n\nWhat happens when I generate a OTF Font from Fontlab? Does it traslate any kerning data into OTF format? If not, what happens when you include kerning data in a CFF OTF font ( what Fontlab makes) and then add OTF kerning data? Are the applied only seperately? Or could you get them applied together resulting in a double kern? What environments apply OTF kerning - Just Vista/Longhorn? Does this mean you have to have different OTF for mac & windows? I thought we were meant to have a unified format here...\n\n"
    },
    {
      "time": " 28.Oct.2005 2.03pm",
      "content": "I do not know what FontLab does by default.\n\nWe provide a tool ’kern to volt’ that converts the TT ’kern’ table to OpenType kerning. I don’t know if FL has similar functionality.\n\nApps and OS’s decide what to use, I don’t think it matters if you include both. Clever apps and OS’s should likely use OT first and ’kern’ if there’s no OT. I assume this is what InDesign does?\n\nI do not know if the ART team plan to include a ’kern’ table in the ClearType Collection fonts, I’ve not asked them about it.\n\nSorry if this isn’t helpful.\n\n"
    },
    {
      "time": " 28.Oct.2005 2.26pm",
      "content": "No, It’s helpful. Thanks. But yes, I want to know more. I’ll ask the fontlab folks. Do you know anything about CFF OTF?\n\n"
    },
    {
      "time": " 28.Oct.2005 2.27pm",
      "content": "Maybe Thomas Phinney knows... I bet he does.\n\n"
    },
    {
      "time": " 28.Oct.2005 2.40pm",
      "content": "So, the main differences between ’kern’ table (old fashioned) kerning and GPOS kern feature kerning are:\n\n1) the latter supports class-based kerning and the former does not  \n2) the OpenType spec says that OpenType CFF fonts only use the latter\n\nFontLab will generate either or both types of kerning, for OpenType fonts with either TT or CFF outlines. The mysteries of when it generates which are determined by preference settings in FontLab. In FontLab Studio 5, it’s under Tools \\> Options \\> Generating OpenType & TrueType \\> Kerning. They refer to the kern table (the old stuff) and the kern feature (the new stuff).\n\nI hope that helps!\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 28.Oct.2005 2.44pm",
      "content": "Thanks Thomas - I should ask Adam this, but - Do you know what fontlab 4.6 ( mac ) does with the Kerning data in a CFF OTF? Also, as far as you know it is only possible to generate a font with one or the other & hence there is no chance of overlapping instructions. Correct?\n\n"
    },
    {
      "time": " 28.Oct.2005 8.14pm",
      "content": "I think we do get value from Kerning onscreen when we use ClearType, particularly when we render with sub-pixel positioning. Actually this was the original design intent for the ClearType fonts. I have some experience in this, as we included some device kerning in Palatino Linotype for onscreen black and white rendering. In the monochrome world the value of Kerning onscreen for normal text sizes was less obvious. You might get away with a To kern for instance, but lowercase kern pairs were problematic, as you have to move 1 whole pixel to kern the letter pair, which is often way too much. In ClearType we have greater accuracy when placing the glyphs onscreen, and so the adjustment of the Kern value, is less than a pixel, which although not optimal still adds value in my opinion. Have a look at the enclosed screen shot, the font is Constantia, designed by John Hudson, at 10, 12, 14 point. We can of course debate the details, and some will say yes but it’s not perfect, on the other hand I see more value having the kerning working, than not.\n\nThe current plan with regard to the CT fonts is to ship with OpenType Kerning tables only\n\nmike\n\n ![](http://web.archive.org/web/20080924105545im_/http:/www.typophile.com/files/CTKern.gif)\n\n"
    },
    {
      "time": " 30.Oct.2005 8.31pm",
      "content": "Eben asked:\n\n“Do you know what fontlab 4.6 ( mac ) does with the Kerning data in a CFF OTF?”\n\nIt’s like FL 5 in that it depends on your settings. I would check the exact mechanism, but I recently deleted 4.6 (Win) from my laptop to free up some space (I’m on FLS5).\n\n“Also, as far as you know it is only possible to generate a font with one or the other & hence there is no chance of overlapping instructions. Correct?”\n\nIt is physically possible to have both in a font, and I have seen fonts that had both. I can’t remember if it is easy or difficult to have that happen with FontLab.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 31.Oct.2005 2.21am",
      "content": "In both OT PS (.otf) and OT TT (.ttf) there can be two kinds of kerning: OpenType “kern feature” kerning (which may employ classes or and/or plain pairs) and old-style “kern table” kerning (which only uses plain pairs). However, the relation between the types of kerning differs between the PS/TT flavors.\n\nPrincipally, new-style OpenType Layout-aware applications (Adobe CS, Windows Vista WPF, Mellel etc.) use the OpenType “kern feature” kerning only in both flavors. If a font is an OT TT font and the old-style “kern table” is present, then old-style OpenType Layout-non-aware applications (Word, Quark, Flash etc.) will show the kerning specified in the table but if the old-style “kern table” is not present in the font, there will be no kerning. If a font is OT PS and the old-style “kern table” is present, old-style applications will show the kerning in the table, but — and here is the difference — if the old-style “kern table” is not present, the Adobe font driver (ATM, Windows 2000/XP built-in, Mac OS X built-in) will automatically convert the Western subset of the OpenType kerning into old-style kerning on the fly, so you will always get kerning for Western characters.\n\nIn FontLab Studio 5, you can explicitly decide (in Options / Generating OpenType & TrueType / Kerning) whether the font (either OT PS or OT TT) should or should not contain the OpenType “kern feature” and/or the old-style “kern table”. In FontLab 4.6, OT PS fonts will never contain the “kern table” while OT TT fonts will always contain it.\n\nAdam\n\n"
    },
    {
      "time": " 6.Nov.2005 4.25am",
      "content": "“In both OT PS (.otf) and OT TT (.ttf) there can be two kinds of kerning:”\n\nNeither of them are rounded within the designer’s control?? Oh well.\n\nI guess anyone who wants to make kerning pairs for ClearType Fonts, (assuming that ClearType is in fact for the screen as I used to be sure of), the kerns should be “grouped” in value, (the same way stems, heights, counters and all the other features of well bred screen fonts are, lacking in minute details so that nothing leaves the rounding rails ;)), Then when the kern pairs are rounded out of your control, kerning will not “fall apart” in the process and diminish the spacing quality further. This, e.g. would mean that if you have To=-28, Ta=-32, Tw=-36 and Tı=-14, Tu=-18 and Tw=-20, the first three’d be better at -32, and the last three’d be better at -16, CLEAR!?)\n\nAND HEY! Don’t you dare forget the “rT” kerning pairs out there. :)\n\n"
    },
    {
      "time": " 6.Nov.2005 5.13pm",
      "content": "I missed this thread when it started, so will just add a few belated notes on the kerning in the ClearType collection because it was sort of interesting. As Si and Mike note, the fonts all contain OpenType Layout GPOS kern feature kerning, rather than a ’kern’ table. At one stage, we considered including both, the latter with a subset of kern pairs for the benefit of applications that don’t handle GPOS kerning, but Luc de Groot reported various bugs he’d found in software encountering fonts with both the GPOS and old kern table kerning, so we have not pursued this option.\n\nThe OTL tables for all fonts were written using VOLT, not FontLab, for a couple of reasons. Firstly, all the fonts contain lookup types not supported by the FDK/FontLab code. Secondly, Microsoft wanted VOLT files for source management.\n\nWhen we began the project, I had already made some fonts using VOLT, and was concerned that it is far from an ideal tool for developing kerning data. There is no way to preview strings of more than two glyphs in the pair adjustment GPOS user interface. So Paul Linnerud from the Advanced Reading Technologies team and I designed a process to convert kern pair data from an AFM file into VOLT lookup syntax. This would enable the designers to do their kerning in FontLab (or FontStudio in Luc’s case), and then convert to VOLT source data. At the same time as Paul and I were working on this, I mentioned to Sergey Malkin at MS Typography that we were looking for a kerning converter. To my surprise and joy, Sergey very quickly delivered a small tool, kern2volt, which was much simpler than the complex syntax conversion I was working on with Paul and produced a smaller, more effiecient lookup. The kern2volt tool examines a kern table and produces an efficient GPOS lookup with classes based on shared values. In the end, we used this tool for all the ClearType fonts. It is now available for download from the VOLT user community on MSN.\n\nDuring this process, Luc and his associates in Berlin were busy working on their own kerning conversion method, which took a third approach involving writing VOLT glyph groups to match FontLab kern classes and then writing corresponding kern lookups. We used Luc’s VOLT kern sources made in this way for the early test versions of his Calibri fonts, but discovered a bug in the TT rasteriser in the earlier versions of InDesign that caused the font not to render correctly. This was already fixed in the more recent versions of InDesign, but we decided to convert Luc’s kerning data using the same kern2volt procedure as we had the other fonts in the collection.\n\n"
    }
  ]
}
