{
  "id": "15780",
  "title": "2-point type at ATypI Helsinki",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anyone remember a specimen in the ATypI type gallery (long hallway) that showed an experimental set of size-specific designs for type to be used at extremely small sizes (2-6 point)? It is a very intriguing exploration of optical effects for legibility, and would be useful to track in our discussions of that topic. It was on the left wall as you walked toward the big auditorium, closer to the entrance. I seem to recall it had a name like fovea or cornea, something to do with the eye.... Not Retina, I know of that already. Memories?\n\n",
  "author": "crossgrove",
  "time": "21 Oct 2005 — 3:44pm",
  "uid": "2263",
  "comments": [
    {
      "time": "21 Oct 2005 — 4:21pm",
      "content": "I wasn't there, but I know it's Minuscule:  \n [http://www.tdc.org/news/2005Results/Minuscule.html](http://web.archive.org/web/20131018163056/http:/www.tdc.org/news/2005Results/Minuscule.html \"http://www.tdc.org/news/2005Results/Minuscule.html\")\n\nhhp\n\n"
    },
    {
      "time": "24 Oct 2005 — 10:42am",
      "content": "That's the one. Have you seen the smaller variants? It's necessary to see them in print.\n\n"
    },
    {
      "time": "24 Oct 2005 — 11:03am",
      "content": "I've seen Javal's original stuff (in print). But I've been  \ntrying to get a sample of Minuscule, so far with no luck...\n\nFYI, there was a Typografische Monatsblatter article about it.\n\nhhp\n\n"
    },
    {
      "time": "24 Oct 2005 — 6:26pm",
      "content": "How very interesting. Do you have any images of Javal's work?\n\n"
    },
    {
      "time": "24 Oct 2005 — 7:19pm",
      "content": "Gobs.  \n [http://typophile.com/node/1331](http://web.archive.org/web/20131018163056/http:/typophile.com/node/1331 \"http://typophile.com/node/1331\") \\_  \n(Note the \"ghost\" posts, now purged, by anonymous participants.)\n\nhhp\n\n"
    },
    {
      "time": "24 Oct 2005 — 9:08pm",
      "content": "Ahh, thanks mate. Ghost writers? I wonder what their vision is like.\n\n"
    }
  ]
}
