{
  "id": "15795",
  "title": "Can a romantic italian and a baroque english share the same room?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "\"I'm a editorial designer and would really appreciate the opinion of the bright minds in the forum (everyone invited). I'm seeking for ideas and opinions on allusive typography. I'm creating a book on the history of ballet and thought about using a Typeface from the Romantic period. So I chose Bodoni, an Italian Type with Romantic characteritics. This would be for the body of the text. Then I was really thinking in using titles in Baskerville, even though it's a Baroque and English Typeface. You see, to my eyes they would match but I'm thinking if my boss would find it too bold.\n\nThanks for your time and priceless thoughts.\"  \n---\n\nThis problem isn't in fact mine, hence the quotes. I'm just a begginer in the art of the Typefaces helping a colleague who isn't confortable with Forums in English... not that I'm any better.\n\nThanks!\n\nL.R. :\\>\n\n",
  "author": "Lucien Raven",
  "time": "22 Oct 2005 — 4:49pm",
  "uid": "9699",
  "comments": [
    {
      "time": "22 Oct 2005 — 5:11pm",
      "content": "I would suggest not using those two together. Baskerville is just as sparkly as Bodoni, however with all of the bracketing in the serifs the flavors will clash and cause indigestion. If you are able to license more of one or the other:\n\n[ITC Bodoni 12](http://web.archive.org/web/20131019003910/http:/www.myfonts.com/fonts/itc/bodoni-twelve/) for text + [ITC Bodoni 72](http://web.archive.org/web/20131019003910/http:/www.myfonts.com/fonts/linotype/itc-bodoni-seventytwo/) for titling\n\nOR\n\nScrap Baskerville altogether and check out Joshua Darden's [Freight Big](http://web.archive.org/web/20131019003910/http:/www.joshuadarden.com/shop/fbig.php) for display + [Freight Text](http://web.archive.org/web/20131019003910/http:/www.joshuadarden.com/shop/ftext.php) for text.\n\n"
    },
    {
      "time": "22 Oct 2005 — 6:43pm",
      "content": "Freight is quite lovely, especially the delicious italic.\n\nChrisL\n\n"
    },
    {
      "time": "22 Oct 2005 — 7:56pm",
      "content": "I really can't tell if Bodoni and Baskerville go together. HOWEVER, it's notable that Giambattista was inspired directly by John's work in making his stuff. He even embarked on a trip to see Baskerville in person, but got sick along the way and gave up.\n\nBTW, I would much rather see Bodoni for the titles and Baskerville for the text; the other way around would be the main cause of indigestion in my view.\n\nhhp\n\n"
    },
    {
      "time": "22 Oct 2005 — 8:00pm",
      "content": "Just because Bodoni was inspired by Baskerville doesn't mean they work well together. Hrant, you are muddying the water. This is a design question, not a history question. :^P\n\nBodoni may have been inspired, but he strayed and created something of his own. As well, I think that the court at Parma was more interested in what the Didot family was doing and that may have had more to do with where Bodoni ended up.\n\n(I really need my notes from your lectures, James.)\n\n"
    },
    {
      "time": "22 Oct 2005 — 8:45pm",
      "content": "Tiffany, I've noticed that you get testy every time Bodoni's originality is qualified (not <cite>questioned</cite> - that's not what I'm doing). BTW, the Didots were almost as inspired by Baskerville as Giambattista.\n\nhhp\n\n"
    },
    {
      "time": "22 Oct 2005 — 9:02pm",
      "content": "Sorry, Hrant. I don't mean to be testy. Call it Italian pride.\n\nDon't you think that they were more inspired by the entirety of the work he was doing as opposed to his typefaces, per se? I mean Baskervilled was exploring the new paper that could hold the sharper serif. Perhaps they, Bodoni and Didot, were more interested in that fact than the typefaces. Yes, I'm speculating. But it seems to me they had in their minds something different which would take advantage of the advances which Baskerville was making in paper technology.\n\nI don't remember the story. So, I could be wrong, but it seems to me that either Bodoni went on a trip toward meeting Baskerville or one of the Didots. But, they became sick and had to return. This ring any bells?\n\n"
    },
    {
      "time": "22 Oct 2005 — 9:12pm",
      "content": "I certainly agree that Baskerville's stunning effect was due to the combination of type, paper, ink, hot-pressing, etc. But did Bodoni and the Didots propagate/amplify the innovation in anything besides the type?\n\n\\> I don’t remember the story.\n\nYou're repressing the memory. ;-)  \nIt was Bodoni. He was in awe of Baskerville, and decided to go to him. He got sick on the way, before he even left Italy. Who knows what might [not] have happened if he had made it?\n\nhhp\n\n"
    },
    {
      "time": "22 Oct 2005 — 9:16pm",
      "content": "No. I think they just took what Baskerville was doing one step further by eliminating most/all bracketing in the serif. One could say that Baskerville was playing it safe and the Didots and Bodoni wanted to see how far they could get away without bracketing. Maybe?\n\n"
    },
    {
      "time": "22 Oct 2005 — 9:19pm",
      "content": "\\> Baskerville was playing it safe\n\nI think relative to his society he was actually much more bullish.  \nNote how he was ostracized by his peers, while the continentals were not.\n\nTo be fair though, I do think:  \n1) Bodoni was inspired by the Didots as well.  \n2) The Didots were strongly inspired by the RdR.\n\nhhp\n\n"
    },
    {
      "time": "23 Oct 2005 — 4:52pm",
      "content": "I can say I have a lot to digest and learn.\n\nThanks Miss Tiffany, ChrisL, Hrant!\n\nThis is my first post on this forum and I can say it's a nice welcome seeing all these replies.\n\nL.R. :\\>\n\n"
    },
    {
      "time": "24 Oct 2005 — 7:50am",
      "content": "Just my personal thoughts, but I wouldn't suggest placing two serifed faces together on a design for the simple fact that they are too close (design-wise) to one another. There wouldn't be enough constrast between the two faces to look intentional. Both faces, in my opinion, are gorgeous and you could achieve that traditional, romantic, classical look that it seems you are going for, but placing them together would look like a mistake. Perhaps using different weights of the same font, i.e. regular with an italic, or just using a serif with a clean, sophisticated sans serif. One that comes to mind is Helvetica Nueue.\n\n"
    },
    {
      "time": "24 Oct 2005 — 12:41pm",
      "content": "I did the opposite once on a letterpress (Baskerville with Bodoni italics), merely because of the availability of type in the shop I was in. FWIW, I must say that I didn't care for it much.\n\n"
    },
    {
      "time": "24 Oct 2005 — 3:50pm",
      "content": "Ideas for one or the other design: Pair it with a more ostentatious cut of the same face; for instance use Stormtype's John Baskerville text with Fry's Baskerville for display, or use ITC Bodoni text and display cuts together, or use Bodoni for display with a nice text cut of Walbaum. In any case there is too much clash between Bodoni and Baskerville to use them together. Don't mix 2 serif designs, and for that matter don't mix 2 sans designs.\n\n"
    },
    {
      "time": "24 Oct 2005 — 5:38pm",
      "content": "Thanks ls3designs, matteson, crossgrove. Your opinions are really appreciated.\n\nI'd like to put some of my thoughts here too, but please, bare in mind that I may say some really newbie-dumbish things.\n\nConsidering it's a book about the history of ballet, which inevitably will be associated with 'classics' (music, art, whatever), I can understand the choice for a romantic type... and serifs.\n\nMixing serif with sans-serif seem a little like breaking the 'classic' mood of the book.\n\nI always associated sans-serif with realist, modernist and post.\n\nMaybe I'm too stuck with Robert Bringhurst saying something like a perfect type would be 'invisible'... would just 'honor the text'.\n\nI don't know, maybe serif and sans would bring too much attention to the type... a little too much.\n\nI'm not arguing, complaining, accusing or anything like that... I'm just trying to broad my mind... a little.\n\nThanks again for all your opinions.\n\nL.R. :\\>\n\n"
    },
    {
      "time": "24 Oct 2005 — 8:25pm",
      "content": "My view, Lucien, is that the Bringhurst/Noordzij view of Bodoni as a typographic Romantic, his forms whimsically calligraphic, is not only unhelpful but willfully paradoxical. Firstly, Bodoni's mature letterforms are duller than all contemporary forms excepting the Didots'. One need only examine any competent writing or engraving of the period to confirm this. Secondly, the larval Bodoni followed first the slaphead clumsiness of the rationalist, deist (not Baroque) Baskerville, who, unable to make type himself, could not learn even to judge it: his lc a is too fat, and his patronising disparagement of Caslon absurd. Thirdly, Bodoni cut punches for specific uses, making his work more like lettering than our ideal of infinitely combinable type. That his text sizes were not so specifically varied is irrelevant, because Bodoni famously sought only magnificence and knew nothing of sweetness in the mass. His texts were faulty and his whitespace unfunctional; he was not a typographer so much as a graphic designer. This matters because Romanticism is, when successful, the mode of the mobile consciousness, and the progessing sentence: the paragraph, or book, rather than the title page. Bodoni cared more for titles than for text. The most genuinely Romantic type designs are those like Deepdene, the letters of which are perhaps too dramatic taken individually, but which combine to very subtle effect.\n\nGeorge\n\n"
    },
    {
      "time": "24 Oct 2005 — 9:04pm",
      "content": "Good post.\n\nAlthough your points against Baskerville are suspect: maybe his \"a\" was a bit chunky\\*, but there are worse things; and Caslon was indeed a hack. The only real problem in Baskerville's type is that the italic is completely botched - and nobody has managed to really make it work... yet.\n\n\\* The \"a\" in the Monotype revival being unfairly horsey.\n\n--\n\nBTW, your \"g\" needs a slightly stronger ear.  \nBut your vertical proportions look super.\n\nhhp\n\n"
    },
    {
      "time": "25 Oct 2005 — 6:38am",
      "content": "Baskerville's italic is indeed pretty pointless, his spaced italic caps doubly so. But it's the gradual loss of understanding of relative proportions within a font from Baskerville to Bodoni that really saddens me, along with the ascendancy of high contrast presswork. Fournier's type is much better, but I don't know whether there's a good digital Fournier out there. Is there?\n\nI've thickened the ear on g - thanks - and there are more letters in need of criticism, should anyone wish to turn the tables on my intemperance, [here](http://web.archive.org/web/20131019003910/http:/typophile.com/node/15249)\n\nGeorge\n\n"
    },
    {
      "time": "25 Oct 2005 — 11:23am",
      "content": "Note: Baskerville's types are neo-classical, not baroque, so are one step closer to the romantic types than a true baroque type would be.\n\n"
    },
    {
      "time": "28 Oct 2005 — 3:30pm",
      "content": "In my humble...Whatever, Baskerville and Bodoni are, and no matter who got sick, if used at grossly different sizes, like ¡24 and 9.6!, and as long as they are \"proper\" \"text\" and \"display\" versions, and as long as there's practically nothing else but dancers, they should be FINE together. Brilliant even, sans and dance not being terribly appeti zing.\n\n"
    },
    {
      "time": "28 Oct 2005 — 5:49pm",
      "content": "=^D\n\nWell, if you say so, David, then I'll stand corrected. This one time.\n\n"
    },
    {
      "time": "28 Oct 2005 — 6:54pm",
      "content": "As David says, proper text and display versions, but it would also be good to have some idea that connects the two.\n\nFor instance, Holiday magazine in the 1950s used to have heads in Bauer Bodoni, and text in Times, both of which had a similar quality of contrast and sharpness.\n\nSo a way of making the combo work might be to match up different versions of the text Bodoni and display Baskerville, and see if any interesting relationships appear. Of course that does depend on having printed specimens -- the FontBook is useful. And I don't know if you have any particular cuts of the two faces you're committed to working with, Lucien.\n\n"
    },
    {
      "time": "29 Oct 2005 — 6:14pm",
      "content": "I really like Hrant's idea of using the Bodoni (a display cut, of course) for titling. But I'm not sure what the text should be. You could experiment a bit with some different faces, and you could always come back to Bodoni for text. Then again, you may want to try something French for a book on the history of ballet. Seems appropriate, but I do like Bodoni for this kind of project.\n\n"
    }
  ]
}
