{
  "id": "15798",
  "title": "early days...",
  "forum": "Script / Handwriting / Graffiti",
  "tags": [
    "Script / Handwriting / Graffiti"
  ],
  "content": "Hi all  \nHave been working on this script for the past few weeks, so it's still very early days. Alot of the weights are still inconsistent and the descenders have not made up their minds yet...  \nWould really appreciate any comments or suggestions...  \nThis is attempt 1.5 at designing type (the first was a very confused lowercase which never made it even close to font lab)\n\nThanks in advance\n\n| Attachment | Size |\n| --- | --- |\n| [black2310.pdf](http://web.archive.org/web/20150419021256/http:/typophile.com/files/black2310.pdf) | 158.25 KB |\n\n",
  "author": "Eileen",
  "time": "23 Oct 2005 — 1:42am",
  "uid": "9820",
  "comments": [
    {
      "time": "23 Oct 2005 — 3:31am",
      "content": "Looks pretty. Careful that you don't get too close to Ronna Penner's [Blackjack](http://web.archive.org/web/20150419021256/http:/www.myfonts.com/fonts/typadelic/black-jack/?refby=typographica).\n\n"
    },
    {
      "time": "23 Oct 2005 — 3:41am",
      "content": "The work Black is a bizarre coincidence. It's not the name of my typeface, simply that the B was the most resolved of my caps..\n\n"
    },
    {
      "time": "23 Oct 2005 — 7:28am",
      "content": "It is hard for me to tell as a typeface without seeing text. I wonder if you may need to revist the outlines when you start spacing. The lc \"i\" in particular is an often used letter. I wonder how it would feel in text? It may get lost both because of slope and size.  \nYou also have to decide if you are going the route of brush lettering, with its more regular forms, or a more random handwriting look. You seem to be somewhere between right now.\n\nChrisL\n\n"
    },
    {
      "time": "24 Oct 2005 — 10:12am",
      "content": "The first thing that you need to deal with is the angle - e.g. y, u, r, v\n\n"
    },
    {
      "time": "24 Oct 2005 — 1:46pm",
      "content": "Cousins? [http://www.typadelic.com/blackjack.html](http://web.archive.org/web/20150419021256/http:/www.typadelic.com/blackjack.html \"http://www.typadelic.com/blackjack.html\")\n\n"
    },
    {
      "time": "24 Oct 2005 — 2:28pm",
      "content": "Mmmm, I love Mac's as well! Especially Copperhop, that is a real beaut! Seriously, you should approach Colenso bbdo in Akl, they might be interested in this sort of thing, as they 'do' the Mac's design.\n\n"
    },
    {
      "time": "24 Oct 2005 — 7:14pm",
      "content": "Kris, the type is indeed for Mac's..  \nStephen and Miss Tiffany, I have seen Black Jack before but in all honesty, I don't think they are that similar. Will be easier to see in context, so will try to post an update soonish..  \nThanks for the comments.\n\n"
    },
    {
      "time": "25 Oct 2005 — 3:22pm",
      "content": "What a good guess on my part! Do you have a pdf with the outlines, not rasterized? Are they getting you to digitise the lettering that they use already? Will the final be opentype, with lots of neat alternates and such?\n\nkris.\n\n"
    },
    {
      "time": "8 Jan 2007 — 5:18pm",
      "content": "hey :)  \nhope you get this.  \nI stumbled across your typeface and thought it'd be interesting to get back in contact as I am now also a Design student and have done typograpy papers  \nDo you remember me?\n\nMisty\n\n"
    }
  ]
}
