{
  "id": "15790",
  "title": "ACL /",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello,\n\nI am developing a CI programme for an asset management consultancy, who are young, smart and aggressive (in a good way) guys. Their clients are somewhat elderly CEOs and CFOs of major banks and investment fonds - and this is where the challenge lies. I want to achieve some kind of traditional and yet \"contemporary\" look. The whole branding should push the personal and intimate (in a good way) side, while the team itself pushes the technical side.\n\nI am bit stuck with the choice of the typefaces, though I think the Hermes/Absara tandem could work. Here is the letter in not-so-modern color scheme:  \n [http://www.xtati.com/\\_misc/temp/L\\_acl\\_hermes\\_absara1.pdf](http://web.archive.org/web/20131108212814/http:/www.xtati.com/_misc/temp/L_acl_hermes_absara1.pdf \"http://www.xtati.com/\\_misc/temp/L\\_acl\\_hermes\\_absara1.pdf\")\n\nHere is the same letter with lively colors:  \n [http://www.xtati.com/\\_misc/temp/L\\_acl\\_hermes\\_absara1a.pdf](http://web.archive.org/web/20131108212814/http:/www.xtati.com/_misc/temp/L_acl_hermes_absara1a.pdf \"http://www.xtati.com/\\_misc/temp/L\\_acl\\_hermes\\_absara1a.pdf\")\n\nAnd here is the \"face and type\" I was working with all the way down to this point before trying to adopt \"early 20 century kind of thing\":  \n [http://www.xtati.com/\\_misc/temp/I\\_acl\\_face\\_eureka.pdf](http://web.archive.org/web/20131108212814/http:/www.xtati.com/_misc/temp/I_acl_face_eureka.pdf \"http://www.xtati.com/\\_misc/temp/I\\_acl\\_face\\_eureka.pdf\")\n\nI am looking at all this way too long now and need a punch (in a good way).\n\nThanks for all the comments.\n\n",
  "author": "popovich",
  "time": "22 Oct 2005 — 12:00pm",
  "uid": "1788",
  "comments": [
    {
      "time": "23 Oct 2005 — 7:51am",
      "content": "Hello,\n\nit is late afternoon of the next day, and after 24 reads no one wanted to comment? Is the thing that boring or mediocre, that nobody bothers to say \"go home and read some books\"? :)\n\nI just need a second pair of eyes on this. If you please...\n\n"
    },
    {
      "time": "23 Oct 2005 — 11:59am",
      "content": "The face thing doesn't work for me. He looks disappointed, and it's unclear what a disembodied floating head has to do with money management.\n\nAs for the typeface and document design, I think Absara is fine, if that's what you like, but perhaps set a bit bigger. The not-so-modern color scheme is easier on the eyes, so I'd go with that one.\n\nThe \"Postfach\" design aspect also has me somewhat confused, putting groups of numbers and addresses into discrete semi-boxes. My eyes are drawn to the addresses, not the content of the letter. (Also if the Swift field is real, try setting the letters in small caps; it'll go better with the hanging numerals.)\n\n"
    },
    {
      "time": "23 Oct 2005 — 12:30pm",
      "content": "Thanks for the comments. I was going to delete the thread, as no one paid any attention to it at all. :/\n\n<cite>He looks disappointed,...</cite>  \nDoes he? The first thing the client said was \"he looks concentrated and wise\".\n\n<cite>... and it’s unclear what a disembodied floating head has to do with money management</cite>  \nWell, this is supposed to be the face of Thomas Aquinas, and the company uses part of his name as well. The face itself has probably nothing to do with money management, but was meant to show the human side of the business.\n\nHere is an update variant. The \"problem\" here is the wordmark. It is too funky to go with the face and the whole _gestalt_, but this is what the client wants to see: a modified \"A\" missing the bar referencing the greek/latin \"A\". I've modified it even more — this detail needs fine-tuning for sure. The face still misses the body, though. Done in one colour.\n\n[http://www.xtati.com/\\_misc/temp/L\\_acl\\_absara1.pdf](http://web.archive.org/web/20131108212814/http:/www.xtati.com/_misc/temp/L_acl_absara1.pdf \"http://www.xtati.com/\\_misc/temp/L\\_acl\\_absara1.pdf\")\n\n"
    },
    {
      "time": "23 Oct 2005 — 5:22pm",
      "content": "<cite>The first thing the client said was “he looks concentrated and wise”.</cite>\n\nLOL! The client is of course always right. Thank you for the explanation of the head, though. It makes sense once you see it, but I wonder if everyone will get it. C'est la vie.\n\n<cite>The “problem” here is the wordmark. It is too funky to go with the face and the whole gestalt, but this is what the client wants to see: a modified “A” missing the bar referencing the greek/latin “A”. I’ve modified it even more — this detail needs fine-tuning for sure.</cite>\n\nI don't understand the missing bar part. (Yes, I understand the literal meaning of it!) Could you elaborate?\n\nMust the wordmark be sans? If so, I would go for something with a bit more entasis (of which there are an increasing number).\n\n"
    },
    {
      "time": "23 Oct 2005 — 5:38pm",
      "content": "\\> “he looks concentrated and wise”.\n\nWell, constipated, maybe, but... wait, you said <cite>concentrated</cite>, sorry... ;-)\n\nSeriously, more important than what your client thinks is what your client's clients think. And I'm having a tough time seeing something positive in that expression. Banking? Looks like a French banker accused of fraud, and trying to decide whether to stick with his lawyers or take the next flight to Guiana. \"Mais alors, quoi faire en face de ces CHIENS?!\"\n\nI think the problem is 95% that eyebrow.\n\nhhp\n\n"
    },
    {
      "time": "23 Oct 2005 — 6:35pm",
      "content": "The face concept bothers me alltogether. It is too specific to be symbolic but too abstract to be a specific person. It reminds me of ads in the 1800's for wonder-cure medicines as in \"Dr Doolittle's Cure All Elixor\". I don't think this gives a sense of trust.\n\nChrisL\n\n"
    },
    {
      "time": "24 Oct 2005 — 12:20am",
      "content": "morning!\n\napart from a good laugh, I can't say I see the same you see guys. Especially, when you use metaphors, relating to constipation or conspiration. But I do see your point — the face doesn't express what it should, or even worse, it expresses something what it shouldn't. My problem is — I can't draw.  \nI also do not want to drop the concept — I see it as a different starting point for one of the trizillion companies dealing with money management. Hey, and it doesn't use swoosh or \"$\" sign!\n\nWhich of these two faces seems more appropriate to you, dezcom? One is more symbolic, the other one is more direct.\n\n[http://www.xtati.com/\\_misc/temp/2\\_faces\\_type.pdf](http://web.archive.org/web/20131108212814/http:/www.xtati.com/_misc/temp/2_faces_type.pdf \"http://www.xtati.com/\\_misc/temp/2\\_faces\\_type.pdf\")\n\nWhat is with that eyebrow, Hrant? Can you describe the problem on the technical level? Too wide? Too dark? Too sharp?\n\nSteve, I mean this — one of the variants of the initial proposal (a wordmark):  \n [http://www.xtati.com/\\_misc/temp/2\\_faces\\_type.pdf](http://web.archive.org/web/20131108212814/http:/www.xtati.com/_misc/temp/2_faces_type.pdf \"http://www.xtati.com/\\_misc/temp/2\\_faces\\_type.pdf\")\n\nand I don't know how to persuade them, that one should use either a wordmark or a symbol, but not both simultaniously. :/ One of the partners sees the reference to ancient greeks, which makes him comfortable with the idea of leaving out a bar in \"A\".\n\nCheers.\n\n"
    },
    {
      "time": "24 Oct 2005 — 5:33am",
      "content": "Investigate a conserative serif typeface and loose the head concept. I don't want my investments to be treated casually. I want predictable returns on investment. Contempory is fine with the newest consumer goods not with financial investments.\n\n"
    },
    {
      "time": "24 Oct 2005 — 5:54am",
      "content": "I agree with the others. The guy looks pissed. And not in a good way. Your client may like it, but I'm not sure they're seeing the potential downside here: sending out letters to their clients with a pissed-off guy on the top.\n\nSince you're referencing Thomas Aquinas, I'd guess you're drawing from [this image](http://web.archive.org/web/20131108212814/http:/www.smom-za.org/images/thomas_aquinas.jpg). Well, he still looks pissed off to me. How about [this one](http://web.archive.org/web/20131108212814/http:/www.pacifier.com/~belisle/images/aquinas.jpg) instead? The deeper, larger shadows would make a stronger mark that doesn't look quite so angry. Also, do a [Google Image Search](http://web.archive.org/web/20131108212814/http:/images.google.com/) for 'WPA'. You'll see some really strong examples of burly, determined workers drawn by skilled illustrators in a strong, meaningful style. Russian posters are another good source for excellent stylized drawings of determined faces. Also, try searching Ludwig Hohlwein. Be careful, he did some work for the Nazis, but his paintings of the human face are stunning in their simplicity, contrast, and impact. Check out [this poster for a German brewer](http://web.archive.org/web/20131108212814/http:/www.idesirevintageposters.com/graphicdesignimage29.html).\n\nMy specific issue with your illustration is that it doesn't feel solid enough. The lines are curvy but don't describe strong forms in the face. Half of the head is a huge black shadow, then the features are thin, small details. The face needs more visual unity and clarity. Notice the thickness of the strokes and the strong straight lines in Hohlwein's work. Your face mark needs this kind of refinement, and I think your client will like the strength of the illustration style. You can get that aggressive feeling without an aggressive expression.\n\n"
    },
    {
      "time": "24 Oct 2005 — 6:50am",
      "content": "Some of the problems with the face stem from the execution. The eyes should sit approximately at the centre of an oval like [this](http://web.archive.org/web/20131108212814/http:/www.portrait-artist.org/basics/step-by-step.html). The jawline and the back of the head are also wrong. On the type side I am unclear why there should be a larger margin to the right than left and why the margins of the letter don't follow those of the rules at top and bottom and why the address and subject text blocks don't have a relationship to the text.  \nTim\n\n"
    },
    {
      "time": "24 Oct 2005 — 8:07am",
      "content": "Chris, you were right. [This](http://web.archive.org/web/20131108212814/http:/www.smom-za.org/images/thomas_aquinas.jpg) was the image I was redrawing from, that's right, and he doesn't look even a bit pissed off to me. I mean, this is not just me or the client, but my colleague as well (who has nothing to do with graphics) who doesn't see the pissed side... I don't see dissappointment or grieveness or fraud in his face. I try, and I can't!\n\nBeing \\*no\\* illustrator and having no graphic or art education whatsoever it's hard for me to do a strong, rightly proportioned face from scratch. Not all russians drink vodka literwise and can draw wicked propaganda posters. :) Herr Hohlwein makes use of shades and colors (though with a great skill), but the same technique is not transfarable for a logo 100% (as far as I understand). I try to use just one color for the shades, which is, I guess, where I fail.\n\nAnyway, before you think, I don't want to hear that this is bad-bad-bad, I stop. No, really, I do need input, but I want to explain where I am standing and why.\n\nOk. So I need a better executed face. I need a better proportioned letterhead [http://www.xtati.com/\\_misc/temp/L\\_acl\\_absara2.pdf](http://web.archive.org/web/20131108212814/http:/www.xtati.com/_misc/temp/L_acl_absara2.pdf \"http://www.xtati.com/\\_misc/temp/L\\_acl\\_absara2.pdf\") , and... Well, any comments on /\\quin thing? Any suggestion on the typeface? My other choices were Slimbach and Century.\n\nPlease, comment more.\n\nCheers,  \nA\n\n"
    },
    {
      "time": "24 Oct 2005 — 10:18am",
      "content": "If I sounded frustrated or unadequate, that's because I cannot drop the face and have little time to fine-tune it. If anybody can give some more constructive critique, I will appreciate it a lot.\n\n"
    },
    {
      "time": "24 Oct 2005 — 10:31am",
      "content": "\\> What is with that eyebrow, Hrant?\n\nIt is/was too twisty - like the guy is perplexed/frantic.\n\n\\> [http://www.smom-za.org/images/thomas\\_aquinas.jpg](http://web.archive.org/web/20131108212814/http:/www.smom-za.org/images/thomas_aquinas.jpg \"http://www.smom-za.org/images/thomas\\_aquinas.jpg\")\n\nThis actually doesn't look pissed to me. He has  \na hint of a smirk in his mouth (like the Mona Lisa).  \nIt looks like he's thinking \"you make that move and  \nit's checkmate in three, bud\". But still, not exactly  \nsuitable for anything to do with banking (except maybe  \nhostile takeovers).\n\nhhp\n\n"
    },
    {
      "time": "24 Oct 2005 — 10:36am",
      "content": "Okay. Cool. At least I see a direction to dig.  \nThe guys are consultants, this is a B2B thing. The company actually sells software for forecasting the results of whatever, they do not take my money and invest them. :) So the checkmate thing actually suites okay (as far as I see it).\n\nAny comments on stationary? Wordmark?\n\n"
    },
    {
      "time": "24 Oct 2005 — 11:07am",
      "content": "Now that you have the balance corrected it is an improvement, I wonder if the wordmark is too small in relation to the face and the text. I think, however, that the fonts that you have used are work well. Areas to work on the face are; an indent where the cheek meets the temple near the left eye, extend the top of the head (imagine that the halo in your source is worn like a cap on the back of the head), tighten up the jaw so he looks less jowly, include part of the neck at the back and possibly the ear as highlights. If you take your source file and convert it to cmyk, cut the magenta channel and paste it into a greyscale file, then increase brightness and contrast it will give you a better base to work from, try printing it out as large as you can while still clearly seeing the details and then tracing over the face then scan your trace and draw from that it might make life easier for you.  \nTim\n\n"
    },
    {
      "time": "24 Oct 2005 — 1:30pm",
      "content": "okay, before you kill me, mind that I am unarmed.  \n [http://xtati.com/\\_misc/temp/aq.gif](http://web.archive.org/web/20131108212814/http:/xtati.com/_misc/temp/aq.gif \"http://xtati.com/\\_misc/temp/aq.gif\")\n\n+ more white on the left side (is 1): haven't managed to make him nicer;  \n- still very curvy eyebrown, but it should stay like this, or the face looses the character altogether;  \n+ ear, neck highlights;  \n- looks older and fatter (is 1);\n\nMy objective was not to replicate the face of the saint. It all happened pretty accidently with this very face. I found this specimen to fit the goal better that the others, and, as I am no illustrator, I tried to redraw it and make it unique. Failed, I guess.\n\n"
    },
    {
      "time": "24 Oct 2005 — 1:37pm",
      "content": "The top swoop of shadow on his forehead and the wrinkled brow of his left eye lose me. It just makes things look too flat. Otherwise, the first is a significant improvement of the drawing.\n\n"
    },
    {
      "time": "24 Oct 2005 — 3:17pm",
      "content": "I just don't think your target audience will get the illustration. You are asking to much from your audience. Its like an inside joke. Think about who you are trying to communicate to.\n\n"
    },
    {
      "time": "24 Oct 2005 — 3:23pm",
      "content": "I don't think they'll be any converting him. Either he or the client is sold on this despite how much we don't find it appropriate.\n\n"
    },
    {
      "time": "24 Oct 2005 — 11:53pm",
      "content": "As Kenny Rogers once said...  \n\"You got to know when to hold ’em, know when to fold ’em,  \nknow when to walk away and know when to run.\"\n\nAre you sure there are no other symbols or images that could represent Thomas Aquinas.  \n(apart from his head)\n\n[http://wwwhome.cs.utwente.nl/~jagersaa/Stamps/Aquinas.jpg](http://web.archive.org/web/20131108212814/http:/wwwhome.cs.utwente.nl/~jagersaa/Stamps/Aquinas.jpg \"http://wwwhome.cs.utwente.nl/~jagersaa/Stamps/Aquinas.jpg\")\n\n"
    },
    {
      "time": "25 Oct 2005 — 2:24am",
      "content": "What is it, Dan, that you think I am asking from the audience, which it is not supposed to get anyway?..\n\n-----------------  \nIt's either I don't communicate it right or you are trying to tell me something I don't get or the whole thing is being looked at somehow queer. I want to repeat again that I am not trying to replicate Aquinas face, I am not trying to hint directly on his persona, I am not trying to follow the traces of his face with an utmost accuracy either ( [this](http://web.archive.org/web/20131108212814/http:/wwwhome.cs.utwente.nl/~jagersaa/Stamps/Aquinas.jpg), being a good illustration, would be a catastrophy in my case). I just took a base face and was working from it further. I cannot stress this enough, but my goal is not to achieve any resemblance with Thomas Aquinas whatsoever...\n\nI am not sure if I should translate the whole initial presentation I did into English to show you how far from \"dropping the face\" we are, but I may asure you, this wasn't the only proposal the client has seen. There were three absolutely different kinds of the mark: two different types of a sign (including this face) and a wordmark. [Here](http://web.archive.org/web/20131108212814/http:/www.xtati.com/_misc/temp/aq_init.gif) is what it looked like in the initial presentation. And even in this poor execution it was instantly the winner. As you probably see now, it is not the execution or the quality of work by now, that has sold itself, it's the idea. Why? Because in this B2B branch the generic company is nothing new and nothing old — there are thousands of small firms, doing this and that having three dots, swoosh, pc screen or whatever as there mark and thousands are coming next year. This is a face-to-face _geschäft_, the marketing will not be based on an extensive ad campaigns or guerilla promotions, but people faces, word of mouth, private talks. This is why \"a face\" and not something else.\n\nFinally, knowing the guys way too long and way too well, I am sure that they know what they are doing (how about naming themselves Blahblah _Lounge_ GmbH and being as far from club and restaurant business as from the furniture production?) — they know their clientele better than we do altogether.  \n-----------------\n\nThat said, I would like to encourage more comments on the execution of the mark (rather than the concept of the mark) and the stationary items, posted so far.\n\nCheers,  \nA\n\n"
    },
    {
      "time": "25 Oct 2005 — 4:53am",
      "content": "Hi,\n\nI think the first face on the last .gif you posted is a clear improvement. The details in the mouth and nose are the way to go. However, if I look at it too long the dark side of the face becomes a kind of “ [balaklava](http://web.archive.org/web/20131108212814/http:/www.planetcnc.com/features/commandandcomedy/revolution/Balaklava.jpg)”. Maybe it needs bits of light in the right side, at least to loose the flatness. Sorry if what I say is not clear.\n\nSeb\n\n"
    },
    {
      "time": "25 Oct 2005 — 5:57am",
      "content": "\"the first\": you mean the \"traced\" picture or the \"is 1\" picture?\n\nI am actually looking for an illustrator to do this one for me. I'll pay, not a fortune, but ... we can discuss this, if someone is interested. Money transfer. My word. Any interest anyone? my email: human[]xtati.com\n\nThanks!\n\nps. I've discussed this case with someone, who told me that a profil could look better here... Hm! Might try this out.\n\n"
    },
    {
      "time": "25 Oct 2005 — 6:31am",
      "content": "Hi Alexey,\n\ngenerally very fine work. Fein vom makro-ästhetischen Gesichtspunkt gesehen. I would refine the contour of the mark, because it`s a bit unclean at some places by big zoom. I think it would be looks well with gold (money!) embossing on thick \"naturweiß\" or champagne paper. The other idea is... is it truly right way to communicate business with \"american trash-texture\" style in our Germany? That`s the question. But if your customer like it, who`s care? In Germany it´s looks rare.\n\nPS: Bist du Freelancer?\n\n"
    },
    {
      "time": "25 Oct 2005 — 6:47am",
      "content": "Hey Wadim!\n\nNo, I am not a freelancer as such, but I do some freelance work from time to time. I was actually going to offer embossing to the client; and yes, on a champagne paper :) Paper Union's \"Conqueror Weiss\" or something in that direction$ a diamond white 100gm (or even more) stock would also do the job.\n\nI am really leaving my part of the illustration at this point and looking for someone more professional to do the face.\n\nCheers,  \nA\n\n"
    },
    {
      "time": "25 Oct 2005 — 7:47am",
      "content": "Alexey,\n\nprobably it could be interesting for you:\n\n[http://www.beinert.net/portfolio/brochure/09-meditation.html](http://web.archive.org/web/20131108212814/http:/www.beinert.net/portfolio/brochure/09-meditation.html \"http://www.beinert.net/portfolio/brochure/09-meditation.html\")  \n [http://213.188.131.250/design/abel/abelmanual/1\\_1\\_logo.html](http://web.archive.org/web/20131108212814/http:/213.188.131.250/design/abel/abelmanual/1_1_logo.html \"http://213.188.131.250/design/abel/abelmanual/1\\_1\\_logo.html\")\n\nI don`t belive your really need an illustrator for this kind  \nof work, because you have already done most of this head(ache).  \nJust refine with less points in contour:\n\n[http://www.kahlkopf.com/files/refine.gif](http://web.archive.org/web/20131108212814/http:/www.kahlkopf.com/files/refine.gif \"http://www.kahlkopf.com/files/refine.gif\")\n\nI can understand you thoughts about illustration. That the reason  \nwhy I still not started with fox geraldy sign for my customer:\n\n[http://www.christinefuchs.com](http://web.archive.org/web/20131108212814/http:/www.christinefuchs.com/ \"http://www.christinefuchs.com\")\n\nPS: Do you have ICQ? I would speak gladly with you.  \nMy ICQ: 118170422\n\n"
    },
    {
      "time": "25 Oct 2005 — 12:37pm",
      "content": "With your traced sample I think you are getting somewhere, I had a thought that you could do without the hairline, which is looking a bit like a beret, and most of the shadow on the forehead and concentrate on the main distinguishing features of the face (eyes, nose, mouth) and tighten up the jawline a little. You would end up with a mark that doesn't link so strongly to the portrait that you took for your reference, while still keeping a contemplative icon which works in one colour. I admit I hadn't realised until I saw that postcard that Aquinas was called Aquin in German so the inference that the portrait is him will be present so I don't think you should go too far from the features that you have already drawn.  \nTim\n\n"
    },
    {
      "time": "25 Oct 2005 — 1:54pm",
      "content": "Tim,\n\nthank you for taking your time and bothering with me.  \nHere is a small update of what has happened so far. I've found a guy, who is more skilled in illustration than I am, who has drawn the face from scratch again. Well, of course he traced it first and after tweaking it and losing some details [this](http://web.archive.org/web/20131108212814/http:/xtati.com/_misc/temp/Untitled-7.gif) is were we are tonight.  \n1 - is traced by me, actually not yesterday, but what I was using as a reference of some sort and dropped later, as it was too photographic for me.  \n2 - is an updated version of mine, with the geometry of the face tweaked a bit. and though the illustrator wouldn't want to work with it and has tried on his own, I was trying to develop this face further. Have I succeded? Okay, maybe the shady side is way too shady, but has the face moved closer to the right geometry/proportions? I admit, it looks scared a bit, but I am sure I can remove that emotion. :)  \n3 - this is what the illustrator did so far. I am not utterly happy with it, but I see, that we can do something nice with it. Maybe rounding the lower part of the image and losing some more details (while making other details more expressive).\n\nWhat d'you think now?\n\n"
    },
    {
      "time": "25 Oct 2005 — 4:58pm",
      "content": "Sorry Popovich, I am confused at what you are trying to achieve here;\n\nPopovich wrote:  \n\"Well, this is supposed to be the face of Thomas Aquinas, and the company uses part of his name as well.\"\n\nPopovich wrote:  \n\" I cannot stress this enough, but my goal is not to achieve any resemblance with Thomas Aquinas whatsoever…\"\n\n"
    },
    {
      "time": "25 Oct 2005 — 11:22pm",
      "content": "Alexey, the work of illustrator is defenitely better than yours. It`s hard to listen, but it`s so. On his work you can see the right epoch! The new chin and facebone is perfect... it`s from the same epoch.  \nI would pay for it. Old looks like fantomas, sorry, even the old cap! And your updated version remember me at Aslan Mashadov. When you study the faces of different epoch you will find out that they was different.  \nGood job. Illustration is neverending lerning process.\n\n"
    },
    {
      "time": "26 Oct 2005 — 1:30am",
      "content": "Jem,\n\nI may have expressed myself not exact enough. I was saying that though the face is supposed to be that of Aquin (the guy has lived in 13th century, there are roughly 4 different faces to chose from), the face should not get close to the master image (I don't need a photographic resemblance, I need a symbol). It should be \"probably Aquin\", and definitely not Lincoln, Che Guevara or Bush.\n\nAs for the illustration: it needs more stylizing yet. And there is still a pile of work before we have a good profil...\n\n"
    },
    {
      "time": "26 Oct 2005 — 4:19am",
      "content": "While the illustrator's work is showing the face of Aquinas (based on a portrait that was not necessarily that accurate in the first place), it is more \"monkish\" than I would think is required for your client\\*, the cowl and hat add to that, I think that the area of face you chose for your image 1 is probably better in that it works with your modern wordmark (although I would drop the hat altogether for the monkish reason above). If your illustrator concentrated on that area and refined some of the finer details (small shade marks by the eyes and left nostril) so that they would print at small size I think you would be in a better position.  \nTim\n\n\\*I might be totally wrong about that\n\n"
    },
    {
      "time": "26 Oct 2005 — 7:20am",
      "content": "I prefer the new hat as it looks more like a hat than hair (the original designs had a look of a Hitler-esque side parting).\n\nI dont think a 'monkish' look is so much of a bad thing either as helps push the traditional and honest aspect to the company, whilst the style of which it is drawn can bee seen as the contemporary look you're striving for. It's certainly going in the right direction as far as I'm concerned. Keep us updated.\n\n"
    },
    {
      "time": "26 Oct 2005 — 12:51pm",
      "content": "update:\n\nhere is the progress for today - [the faces](http://web.archive.org/web/20131108212814/http:/xtati.com/_misc/temp/Untitled-74.gif) from the illustrator and me. okay, I haven't learnt to draw the face properly, but I was using all my skills to copy it from the _most probably_ anatomically correct face of the artist. Which one seems more appropriate?\n\nI've answered that question for myself and have used mine (I'm really stubborn sometimes and may even appear rude for that matter, but normally I am nice, really :) ). Here are the two variants of the letterhead: [traditional](http://web.archive.org/web/20131108212814/http:/xtati.com/_misc/temp/L_acl_scala_absara_1.pdf) and [overdone](http://web.archive.org/web/20131108212814/http:/xtati.com/_misc/temp/L_acl_scala_absara_2.pdf). The non-traditional variant has its drawbacks (like visual disbalance and total domination of the face), but I think I could find a solution to that (tinting it upto 50% or less could do the job). I just wanted to try out two radically different appearances.\n\nI also dropped the greek _lambda_ used as _A_ — it was getting way too complicated. I also tried Scala Sans for the wordmark.\n\nAny thoughts?\n\nps. Alright, if you magnify the letterhead upto trillion percent, you'll notice some bad curves in the face, especially where the dark part meets the light part. I am aware of that - it will be fixed later.\n\npps. I am glad I've turned to you, guys, before showing it off to the client....\n\n"
    },
    {
      "time": "26 Oct 2005 — 1:22pm",
      "content": "The one drawn by the illustrator seems closer to the 'thinking man' concept. Yours, while a ton better than when you first drew it, still feels a little off to me.\n\n"
    },
    {
      "time": "26 Oct 2005 — 1:31pm",
      "content": "I think they both look like a John Cleese character.\n\nhhp\n\n"
    },
    {
      "time": "26 Oct 2005 — 2:12pm",
      "content": "He looks like he has a comb-over. I would say loose the face altogether. The \"I'm an old white guy\" theme just doesn't sell, and in this instance comes off kind of creepy.\n\n"
    },
    {
      "time": "26 Oct 2005 — 3:40pm",
      "content": "I think you need to include the shoulders as per the illustrators version,  \notherwise he could be mistaken for a decapitated head.\n\nThis may not be helpful, but maybe an alternate view of his face is an option?  \nCropping in on the face will avoid the floating/decapitated head connotation.  \neg.\n\n ![](http://web.archive.org/web/20131108212814im_/http:/typophile.com/files/Face.jpg)\n\n(I just wanted to show off my new 'insert image' skills)\n\n"
    },
    {
      "time": "26 Oct 2005 — 4:09pm",
      "content": "I'm afraid have to agree with 'hrant' and 'Christian robertson' in that there's definitely some sort of moustacheoed comb over hair-stylage going on that affects your illustration. I know it's not supposed to look exactly like Thomas Aquinas, but I'm sure it's not spposed to look like Hitler or John Cleese either.\n\nWhat happened to the ones the illustator drew with the proper hat?\n\nKeep plugging away mate - you'll get there!\n\n"
    },
    {
      "time": "27 Oct 2005 — 9:54am",
      "content": "hi everyone,\n\nbefore this thread goes into history, I am going to post the last (I hope) update on this topic. I want to thank timd for helping my out here a lot, also per email. One of the concepts without the hat is his vision of the face. And everyone, who contributed to the process - thanks a lot. If I sometimes have sounded rude or harsh - sorry for that, it wasn't meant to be so.\n\n[The all faces of Thomas Aquinas](http://web.archive.org/web/20131108212814/http:/xtati.com/_misc/temp/aq_all_faces.gif). The lighter areas, particularly of the \"no-hat\" face are most probably not to be used in that way. But if the face will be embossed, than using this outline would help.\n\n+\n\n[Three variants of the logo](http://web.archive.org/web/20131108212814/http:/xtati.com/_misc/temp/aq_ways.gif) (the last being hinted on by the illustrator, meaning that this is much more in style with the image, as any of two others, esp. because of the type treatment — this is the point, which I am totally negative of. Proove me wrong, if you think Trajan-like thing could work).\n\nI am going to bed early today. To get fresh before the presentation tomorrow. But I am still an hour or two here... and I am all ears...\n\nCheers,  \nAlexey\n\n"
    }
  ]
}
