{
  "id": "15799",
  "title": "My company's logo [critique]",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello all,\n\nI have been a lurker on these forums for a while now. Its a great ressource for everybody involved in type. My name is David Pache, Im a multimedia designer in Switzerland. Its time I get my company, Dache, off the ground. I do identities, newmedia, illustrations and webdesign. After months and months of research (finding your own logo is one of the hardest things to do) I beleave I have found it.\n\nI created the name that goes with my logo using the same shapes and dimensions. I would really like some crits and comments from you if you would be so kind. Id appreciate it.\n\nThanks.\n\nRegards,  \nDavid Pache\n\n[www.dache.ch](http://web.archive.org/web/20120228130626/http:/www.dache.ch/ \"www.dache.ch\")\n\n| Attachment | Size |\n| --- | --- |\n| [dachelogotyp.png](http://web.archive.org/web/20120228130626/http:/typophile.com/files/dachelogotyp.png) | 19.5 KB |\n\n",
  "author": "<a href=\"/web/20120228130626/http://www.typophile.com/user/9823\" title=\"View user profile.\">dache</a>",
  "time": "<br>",
  "uid": "9823",
  "comments": [
    {
      "time": "",
      "content": "I like it but it reminds me of something...Dyson ( [www.dyson.com](http://web.archive.org/web/20120228130626/http:/www.dyson.com/ \"www.dyson.com\"))\n\n"
    },
    {
      "time": "",
      "content": "I get a seed germination or leaf image out of it. I am trying to see the relationship to your kind of work?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Thankyou for the comments so far.  \nAlthough Dyson has a nice logo, I was going for something more...mathematical.  \nA leaf you say? Thats the first time I've been told this, very interesting. My idea was rather based around the webdesign aspect of my company, .com's and so forth, thus the yellow dot.\n\nRegards,  \nDavid Pache\n\n"
    },
    {
      "time": "",
      "content": "Hi David ... the graphic seems a bit large in relation to the type, and the elements seem to butt, direction-wise.\n\nThe actual type seems a bit thin — the 'h' seems a smidgen wide (lots of counterspace), and the shape of the 'a' needs a cleaner join where the vertical stem meets the rightmost part of the bowl, imho.\n\nAlso, this is something to be aware of.\n\n[http://www.theregister.co.uk/2005/09/14/new\\_quark\\_logo/](http://web.archive.org/web/20120228130626/http:/www.theregister.co.uk/2005/09/14/new_quark_logo/ \"http://www.theregister.co.uk/2005/09/14/new\\_quark\\_logo/\")\n\nbj\n\n"
    },
    {
      "time": "",
      "content": "That's what I tought : [http://www.quark.com/](http://web.archive.org/web/20120228130626/http:/www.quark.com/ \"http://www.quark.com/\")\n\n"
    },
    {
      "time": "",
      "content": "it looks like an eye to me...\n\nnc\n\n"
    },
    {
      "time": "",
      "content": "Thankyou bjharvey exactly what Im looking for I will look into this. I really needed to get this kind of crits before going to print.\n\nWhat can I say about the quark logo, mine was made first. September 2nd to be exact, a little over a week before quark relaunched their logo :/  \nAs long as Im not seen as a copy cat, I dont have a problem. That said would be nice if the scotish art council would deal with it.\n\nRegards,  \nDavid Pache\n\n"
    },
    {
      "time": "",
      "content": "It's really cool although it maybe similar to some other thing out there...What is the logo referencing anyway, or is it supposed too? I also think the kink in the \"d\" takes the overall scheme a bit too far.\n\n“Hey, Keep San Antonio Lame!”\n\n"
    },
    {
      "time": "",
      "content": "If it were me, I would avoid this shape at this angle and proportion. It's been beat up the last few years, especially with the recent Quark and Scottish Arts Council debate. Also, 99% (or more) of the folks on the street won't know that you created yours a week before the new Quark launch.\n\nI would encourage you to rethink this logo.\n\nCheers,\n\nDylan\n\n"
    },
    {
      "time": "",
      "content": "If it were me, I would avoid this shape at this angle and proportion, too. There are other good examples od \"D\" possible. I stand for the same problem to create own \"K\". So do much research the market of \"d\" for example at: [http://www.brandsoftheworld.com](http://web.archive.org/web/20120228130626/http:/www.brandsoftheworld.com/ \"http://www.brandsoftheworld.com\") to create something unique.\n\n"
    },
    {
      "time": "",
      "content": "The mark is to big compared to the type. I looks like a symbol for a gas company tilted right. I'm a designer and can't figure out what its supposed to mean. Its not bad it just has no meaning (to me), so its art for art sake. Thats not bad, you are an artist, but as a clear communication business symbol its weak.\n\n"
    },
    {
      "time": "",
      "content": "The mark is probably doing what you want: it looks contemporary and kind of technology-ish, it's dynamic, it's familiar but not completely so, etc. However, if you want to really make an impact in people's minds, this isn't the mark for you. No one's going to say: \"Remember the guy with the grey and orange logo? The one that looks kind of like Quark's?\" Your mark reminds me of other things, rather than sparking something unique in my mind. However, having a site of content up for people to associate with your logo will help overcome that.\n\nAgain, the logo isn't necessarily wrong or bad (it fits some of your goals, is pretty well crafted, and has a consistent visual theme), but I just don't think it's giving you the mileage you deserve from a personal logo. It feels too 'already seen it' to me. If you're going to take the time and effort to design a mark, and not just a nice logotype, then you should probably push it past this into something even more unique.\n\nAs for the type forms, I'd like to see some larger examples of the characters. The 'e' and the curve-to-straight transitions on the 'd' don't look smooth enough to me, but that may just be the anti-aliasing at that size. Also, I agree with bj's assessment. The type feels too thin next to the mark. Perhaps its stroke weight should match the outer rule, rather than the inner one.\n\n"
    },
    {
      "time": "",
      "content": "I based the size of the graphic mostly on the yellow dot so that its size is the same as in my websites dot ch.  \nI guess I could use a font that a profesionnal typograph has created (I was thinking Frutiger) but I really like my shape, its a little tough to \"surrender\" it because some large company has something similar, after me. My logo has multiple meanings for me. I am thinking about using a circular shape instead though. Or rotate it some, but then it will look like a raindrop.  \nI've thought about it, but I wonder what you guys think. Is Quark really all that known by people who arent in the visual department anyway?\n\nRegards,  \nDavid Pache\n\n"
    },
    {
      "time": "",
      "content": "Excuse me, double post.\n\n"
    },
    {
      "time": "",
      "content": "You've likely tried this, but I'd like it to look up instead of down.\n\nCould be too cartoonish like this (attached).\n\nI would also like to see a heavier font inkeeping with with thickness of the graphic.\n\nGood luck.\n\npd\n\n"
    },
    {
      "time": "",
      "content": "sorry - thought i had attached something...\n\nTried again - no luck.\n\nWill email.\n\npd\n\n"
    },
    {
      "time": "",
      "content": "I did try many variantes but nothing quite like this. I like it, reminds me of the egyptian god horus. Thankyou for mailing me, I appreciate it very much. This is what it looks like.\n\n[http://www.dache.ch/files.png](http://web.archive.org/web/20120228130626/http:/www.dache.ch/files.png \"http://www.dache.ch/files.png\")\n\nRegards,  \nDavid Pache\n\n"
    },
    {
      "time": "",
      "content": "I like that more. It's got a bit of personality, now that it reads a little like a creature with an eye. Perhaps the bowl of the 'd' in 'dache' should be the same size and weight as the mark now?\n\n"
    },
    {
      "time": "",
      "content": "sperm on steroids about to pummel an egg.\n\n"
    },
    {
      "time": "",
      "content": "Adnix you have to admit that was mean\n\n"
    },
    {
      "time": "",
      "content": "David, here are my comments... I think the icon is appealing, but people will inevitably ask \"what does it mean\". This is a problem, because logos shouldn't explain, but identify. With generic shapes like this the more likely it is to remind someone of something they've seen before. The icon will have different meanings to different people, and some may have a negative reaction to it, sperm, egg, etc. Personally I don't think it is strong enough or distinctive enough to stand alone and your application of it, and use of type, will make all the difference. This is a piece of your overall identity, and once you have some of the other \"pieces\" in place you'll be better able to judge whether this is working or not. Best of luck, it is always hardest to do your own identity. Mine has been \"coming soon\" for 5 years!\n\n"
    },
    {
      "time": "",
      "content": "Someone mentioned it earlier, but the similarity to the Quark mark, and the surrounding brouhaha accompanied by it, is unfortunate (though I'm sure unintended.).\n\n"
    },
    {
      "time": "",
      "content": "Thankyou gentlemen, all of you. I needed this, honnest crits with no holding back is what helped me from almost make a rather large mistake. I've found a new source of motivation for this logo and it can only be better the second time round. Excuse me if I came off a little stubborn. Anyways, the only thing I am keeping is the colors, which I feel transmet my style if you will in its best way. Now its onto finding the perfect typographic solution for my name (Im thinking about Frutiger, good choice?), and once that is done, a new logo.\n\nI'm going back to the drawing board and its thanks to you guys.\n\nRegards,  \nDavid Pache\n\n"
    },
    {
      "time": "",
      "content": "Frutiger - certainly\n\npd\n\n"
    },
    {
      "time": "",
      "content": "I have to say the squircle element has been beat up to no end. I should know. I've been using it for the last three years and then quark and bunch others decided to use the shape. Now I'm stuck in a place where I can't just change my whole identity because of it. Now I hate it. Lovely. Oh well, such is life. I would definitely hit that drawing board and realy push out something innovative for your personal logo. Good Luck!\n\nJoseph Szala  \nVigor Graphic Design, LLC.  \n [www.vigorgraphics.net](http://web.archive.org/web/20120228130626/http:/www.vigorgraphics.net/ \"www.vigorgraphics.net\")\n\n"
    },
    {
      "time": "",
      "content": "Thankyou both. Im also trying to find something swiss without going to the clichés because it is something that does work relatively well, the new problem is finding a swiss graphic that appeals to both people here and in other countries.\n\nRegards,  \nDavid Pache\n\n"
    },
    {
      "time": "",
      "content": "Im thinking of going in this direction. Im not a type expert but I think using frutiger is a \"safer\" choice. Maybe I should modify it. Comments and crits on the logo would be appreciated, thanks.\n\n[http://www.dache.ch/dachenew](http://web.archive.org/web/20120228130626/http:/www.dache.ch/dachenew \"http://www.dache.ch/dachenew\")\n\nRegards,  \nDavid Pache\n\nedit : [img]tags dont work here?\n\n"
    },
    {
      "time": "",
      "content": "I really like your new design... I'm a sucker for the Swiss look. Naturally, I'd say Helvetica (but I know I'm going to take flack for that) it would just sit so nicely; the graphic mark is interesting, so I'd look for a typeface that doesn't compete for attention with it - hence I'm not too keen on the custom typeface. I know you might think that Helvetica would be a cliché... but I think it's made for your project.\n\nI think that the type and the logo need to balance up more; the logo is solid and compact, I think a typeface that reflects that characteristic would work really well, if you decide against Helvetica. I'm unsure about Frutiger because the logo is very geometric, to me the curves of the Frutiger typeface stand out.\n\nThat's my 2 pence!\n\nSi\n\n"
    },
    {
      "time": "",
      "content": "I also prefer the new way for your logo the mix of “d+” it's a good way to choose. The typeface as to be review to get a better fit with your new square look, though. May be FF DIN or something.\n\nGood improvement.\n\nAndré\n\n"
    },
    {
      "time": "",
      "content": "Thankyou for the comments. I will try those fonts mentionned. Will post to show later.\n\nRegards,  \nDavid\n\n"
    },
    {
      "time": "",
      "content": "I tried some typefaces. I think the first one.\n\n ![](http://web.archive.org/web/20120228130626im_/http:/typophile.com/files/typechoice.png)\n\nRegards,  \nDavid\n\n"
    },
    {
      "time": "",
      "content": "They look good... I think the middle 2 (Helvetica & Franklin Gothic) are my favourites. I'd be tempted to try a heavier weight of each of these (maybe a medium or bold). I like the idea of DIN (it's one of my favourite faces), but I think it looks too condensed next to such a strong, rigid graphic.\n\nReally like the graphic, by the way.\n\nSi\n\n"
    },
    {
      "time": "",
      "content": "Din is the only one I think works. It has the look you are going for the most. Franklin Gothic and Helvetica look soft (the \"A\" curls at the bottom of the stem). Din goes straight down which matches the square icon. Univers doesn't look as good as Din.\n\n"
    },
    {
      "time": "",
      "content": "DIN fit well, that's what I think to, but I'll try to increase the size and may be change the weight or the typeface height. So, some others sketches to do. Finally, is “dache.ch” could be closer to the logo?\n\nYou've done a great job.\n\nAndré\n\n"
    },
    {
      "time": "",
      "content": "Thanks guys. I decided to use DIN for the moment on a temporary site : [http://www.dache.ch/temp/](http://web.archive.org/web/20120228130626/http:/www.dache.ch/temp/ \"http://www.dache.ch/temp/\") if anyone is interested. Im going to tweak its size etc. over the next week so that on the 16th I can have my business cards printed and ready for the christmas party.\n\nRegards,  \nDavid\n\n"
    },
    {
      "time": "",
      "content": "I really like how this one turned out and I would like to congratulate you on your newly found identity.. :) A simple, minimal, swiss looking :) and still classy symbol.. _( I also think your temporary site is nicely done.. )_\n\nConsidering the type I may be one of those few that dont recommend using 'DIN'..  \n_( I cant stand seeing it used, any more.. :)_ But I do think even 'Helvetica' would work well and maybe better than 'DIN'..\n\nDav\n\n_I am a whiz kid, I love my swiss grid™..  \n( Now give me a biscuit.. :)_\n\n"
    },
    {
      "time": "",
      "content": "Thanks a lot formlos.  \nI brainstormed with some friends who are all in visual arts, I think helvetica will be the final choice. Im getting there!\n\nRegards,  \nDavid\n\n"
    }
  ]
}
