{
  "id": "15824",
  "title": "Why you like type.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m interested in writing something to go along with my senior project (typeface) and I love type. But I don’t know why. Other than maybe my personal draw to functionalism. ( but that’s not long enough)\n\nOr, maybe ideas how to isolate and verbalize my thoughts?\n\nI’d like to hear from whoever is up for it.\n\nThX\n\n [‹ FF Info Specimen](http://web.archive.org/web/20080706080110/http:/www.typophile.com/node/16339 \"Go to previous forum topic\") [Type and Design things to see in Cuba ›](http://web.archive.org/web/20080706080110/http:/www.typophile.com/node/16476 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706080110/http://www.typophile.com/user/6194\" title=\"View user profile.\">Eric_West</a>",
  "time": "<br>",
  "uid": "6194",
  "comments": [
    {
      "time": " 24.Oct.2005 11.48am",
      "content": "I think a lot of people love type because it combines creativity with analysis. A font is a personal little machine.\n\nhhp\n\n"
    },
    {
      "time": " 24.Oct.2005 11.55am",
      "content": "...because it’s better than having to find a real job.\n\n"
    },
    {
      "time": " 24.Oct.2005 12.02pm",
      "content": "…because it looks so pretty. Just like some other things with curves in them…\n\n"
    },
    {
      "time": " 24.Oct.2005 12.33pm",
      "content": "I was drawn to typography by a long road of literary study & writing mixed with some fine arts background, which eventually led to the combination of these in approaching the letterforms I’d been studying for years as text. This, anyway, is what brought me to publishing, and publishing to book design, and book design to typography and type.\n\nThis has been the professional route anyway. Just as important, however, has been the personal process. Hrant will likely grunt at this, but it strikes me as no surprise that I’ve been drawn into this stuff as a profession as well as an interest. I say this because, well, I’m not all that sociable. I prefer to work from home, or, better yet, from the small cabin I live in during the summer. I prefer to work slowly on a project that is painstaking in its demands, yet quiet in its result. There is a huge sense of accomplishment when I finish a project I’ve worked on for months, yet a large part of my approach is to remove myself from the project as much as possible. I like the relative annonymity. The internet, of course, has made this much easier in terms of working with/for clients, but my laptop also allows me to work from that little cabin, or anywhere else.\n\nI suppose what I’m attempting to get at is that while graphic designers tend to be quite social, trendy, hipster types, typographers & type designers tend to be a bit withdrawn & quiet (I know, a gross generalization). At least for me anyway, as much as my aesthetic & formal training led me here, it was my personality that pushed me to pursue the finer and more understated points.\n\n"
    },
    {
      "time": " 24.Oct.2005 12.35pm",
      "content": "...because of the making of books, there is no end.\n\n"
    },
    {
      "time": " 24.Oct.2005 12.38pm",
      "content": "One of my favorite quotes about type (and one reason why I like it). Regiomontanus in 1475, from Carter’s _A View of Early Typography_, pp. 40—41.\n\n<cite>In the workshop an astrarium is kept in continual motion: a thing marvellous to behold; and other instruments are being made for observing the heavens, as well as appliances for everyday use, whose names it would be tedious to recite. Last of all it has been decided to practise the wonderful art of making printing type for lasting records, and may God prosper it! Once that is mastered, though the workman die soon after, death will have no bitterness for him, knowing as he will that he has left to posterity a gift to save them for ever after from want of books.</cite>\n\n"
    },
    {
      "time": " 24.Oct.2005 12.39pm",
      "content": "... because type forces my thoughts and words to be made visual.  \n... because i love contrast.  \n... because there is nothing more beautiful than the curves of a letter.\n\n"
    },
    {
      "time": " 24.Oct.2005 12.56pm",
      "content": "Type is an integral part of my visual palette. But whereas the common observer can generally recognize and relate to the imagery of photos, illustration, color, graphic shapes — type remain the most subtle element yet strongest in influence.\n\nType is a micro-study visible to only a few... it’s almost magical what can be done with it and even though I’m an expert, it never ceases to amaze me.\n\n"
    },
    {
      "time": " 24.Oct.2005 1.02pm",
      "content": "Jason, I grunt in hermit-like agreement.\n\nhhp\n\n"
    },
    {
      "time": " 24.Oct.2005 1.12pm",
      "content": "there is much fulfillment knowing that this [seemingly] obscure craft has been shared by people throughout the ages.\n\nthe principles of ledgibility that we apply to this craft have been understood and developed by a range of people including those who painted hyroglyphics on papyrus, and by others who carved roman inscriptions into stone.\n\nin this day and age, with so many other things rendered obsolete, typogrpahy will continue to thrive, taking on many new forms.\n\n—————  \nnc\n\n"
    },
    {
      "time": " 24.Oct.2005 1.44pm",
      "content": "Eric, by the way, everytime I see your thumbnail I walk around giggling for hours. It speaks (well, screams) directly to the seeming inability to walk away from the glowing box in front of me even for the basics of food & sleep. Given opportunity (and I give it plenty), this love of all things type eventually leads to pixel-driven psychosis on an almost daily basis.\n\n"
    },
    {
      "time": " 24.Oct.2005 2.37pm",
      "content": "Why not? I don’t want to think about it too much—it might be ruined if I do. I like it. It gives me pleasure. Is this good enough for you? It is for me.\n\n"
    },
    {
      "time": " 24.Oct.2005 3.41pm",
      "content": "Like furniture, type is the ultimate intersection of form and function.\n\n"
    },
    {
      "time": " 24.Oct.2005 4.14pm",
      "content": "My story, which I am sticking to, is that type imbues static words on a page (screen, poster, blimp...what have you) with an attitude, with or without a capital A.\n\n"
    },
    {
      "time": " 24.Oct.2005 5.58pm",
      "content": "Because it serves the preservation of ideas and helps hold back the barbarous darkness.\n\n"
    },
    {
      "time": " 24.Oct.2005 6.17pm",
      "content": "My father was a sign painter. (In today’s jargon, he would be called a “graphic artist”). At an early age I became fascinated by a dusty book of font samples in our living room cabinet, which my father rarely used. While other kids were enthralled by comic books, I spent many hours thumbing through the magical font book. My fascination, for typography continues today, though I regret that my technical knowledge of typography is limited.  \nType is an exercise in graceful minimalism: One can convey a seemingly unlimited range of feelings with just a simple character. No need for epic poems, convoluted essays, or other literary esoterica: One can say it all with a single letter, or for that matter, a single “pen stroke.”... Japanese calligraphy for the Western world... Beauty, horror, fear, romance... the entire lexicon of human emotions expressed in an effortless and elegant art!  \nD~\n\n"
    },
    {
      "time": " 24.Oct.2005 6.29pm",
      "content": "Designing type is the ultimate exercise in symbol design. We all “know” what the form of a letter is supposed to be but finding that essence again and again is the true test. We make an old set of symbols and yet make them new again.\n\nChrisL\n\n"
    },
    {
      "time": " 24.Oct.2005 8.55pm",
      "content": "Thanks everyone so far, tell your friends to come post!\n\n"
    },
    {
      "time": " 25.Oct.2005 3.22am",
      "content": "I need to rewatch the opening dialouge from the Kubrick’s Lolita where James Mason (Humbert Humbert) is reading out his list of reasons he’s about to shoot Peter Seller’s (Clare Quilty) character.\n\n<cite>… because type forces my thoughts and words to be made visual.<br>\n… because i love contrast.<br>\n… because there is nothing more beautiful than the curves of a letter.</cite>\n\n"
    },
    {
      "time": " 25.Oct.2005 8.47am",
      "content": "Since I enjoy drawing, type just gives me an excuse to draw other type of shapes.\n\n"
    },
    {
      "time": " 25.Oct.2005 9.10am",
      "content": "... Because I’m obsessive compulsive and anal retentive.\n\n"
    },
    {
      "time": " 25.Oct.2005 9.14am",
      "content": "Because it makes me the coolest designer on the town... oh and the chicks.\n\nHéctor\n\n"
    },
    {
      "time": " 25.Oct.2005 9.16am",
      "content": "”...… oh and the chicks.”\n\nHéctor,.  \nReally :-)\n\nChrisL\n\n"
    },
    {
      "time": " 25.Oct.2005 9.26am",
      "content": "because the letters of the alphabet are old friends, and i like to see them look good.\n\n"
    },
    {
      "time": " 25.Oct.2005 11.26am",
      "content": "For me it’s the endless variety of form, texture, and expression that can be derived from such a small set of basic shapes and practical limitations.\n\n"
    },
    {
      "time": " 25.Oct.2005 2.00pm",
      "content": "Mark, is it ok to use it as my answer? :)\n\nThe fact is, in graphic design there is a constant demand for novelty. Using typefaces in ways they were not intended is one way to achieve that. Once somebody does it, it gets noticed by other designers who copy the idea. Eventually, the idea becomes so widespread, that the novelty wears off and the cycle starts again with some other idea.\n\nand as Brad Holland said: Variety allows me creative freedom\n\n"
    },
    {
      "time": " 25.Oct.2005 9.01pm",
      "content": "I like type because I know it—albeit to a miniscule extent compared to the regulars here. And the more I know it, the more I like it. A little over a year ago, when I started to teach typography and really started to think about and look at the letterforms more than I had in years, was when I fell in love with type all over again, and I surprised myself by becoming strangely passionate about the damned stuff and wanting only one thing from the class: for them to look at it and love it too. I’m a type proselytizer.\n\nFor me it’s kindof a game (noticing details in setting, errors, oddities, identifying faces), and kindof a friendship (recognizing faces, but not triumphantly: familiarly instead, like recognizing a voice) and definitely a pleasure in relative arcana.\n\nI think typophiles are incredibly weird and scary, but I am jealous that they are closer to type than I am, know it better and love it more.\n\n-marian\n\n"
    },
    {
      "time": " 25.Oct.2005 9.02pm",
      "content": "Oh, and Eric, I too can’t stop watching your animated pic. I watch it over and over and over. It always makes me laugh.\n\n-marian\n\n"
    },
    {
      "time": " 25.Oct.2005 10.38pm",
      "content": "Marian,\n\nBTW, I was pointed to YOUR work via Grant Hutchinson’s flickr stream, the lettering you designed for the ’creatives care’ shirt is amazing.\n\nedit: forgot the apostrophe !\n\nps. - it was late\n\n"
    },
    {
      "time": " 26.Oct.2005 7.36am",
      "content": "\\> Grant Hutchinsons\n\nEric, Hutchinson.\n\n"
    },
    {
      "time": " 26.Oct.2005 10.12am",
      "content": "Thanks! Maybe I like type because I can do groovy shit and say things at the same time.\n\n-marian\n\n"
    },
    {
      "time": " 26.Oct.2005 10.13am",
      "content": "(sigh) OK, “groovy _stuff_”  \n(I mean really, why is this?)\n\n-marian\n\n"
    },
    {
      "time": " 26.Oct.2005 2.26pm",
      "content": "beautiful proportions, it can set a tone for what you want to say, it enchances the message (if well used). I feel like a smartass during the act of type selection for a project but usually end up feeling like a jerk because my type library is pathetic (along my knowledge of type that is). But I love when talented folks use it, it can be soo beautiful. Its facinating too in the respect that it also closely ties in to cultures ... and thats all i can muster ...\n\n"
    },
    {
      "time": " 27.Oct.2005 7.02am",
      "content": "-For me it tells me a lot about the history of society.\n\n-Because it always had wicked technologies that were interesting, from flicks of metal to binary code.\n\n-because putting points on outlines in a dim lit room was better than spending 8 hours a day, by yourself, processing 50 rolls of news film and printing 60-100 news prints in red lit darkness.\n\n"
    },
    {
      "time": " 27.Oct.2005 8.27pm",
      "content": "Vince, at last I know something more painstacking than type design, God bless digital photo.\n\nHéctor\n\n"
    },
    {
      "time": " 28.Oct.2005 2.04am",
      "content": "I love type just because then I can be a part of typophile with all you nutters...\n\n:o)\n\n"
    },
    {
      "time": " 28.Oct.2005 5.29am",
      "content": "I love digital photography. Spotting black and white photos was a real pain especially working for someone else who didn’t clean their negatives. Spotting a digital photo or scan is easy.\n\nI love printing and darkroom but hated doing it as a job where your doing 100 prints a day and having to hit it the first time. You get real good at looking at the density of a negative but it gets a bit boring.\n\nBut in the fashion world the stylists hate digital photography since the photographers shoot too many photos too quickly. It doesn’t give them time to prepare the clothes for the next shoot.\n\nI find shooting 10 shots on film you are more careful but you can experiment a lot more and it’s cheaper in the end with digital. Most of my clients need digital images for the web and many castings ask for .jpgs and not 8x10 or A4 prints. Only the print media require hard copy usually but some like my Nivea job asked for a high res image for a 2 mitre print.\n\n"
    },
    {
      "time": " 31.Oct.2005 9.06pm",
      "content": "the amazing details behind all the fonts that we have today, placing them in a design for some known or visible reasons are pretty much fulfilling.\n\nand its a pretty obscure, but someone has to do it right?!\n\n"
    },
    {
      "time": " 2.Nov.2005 11.17am",
      "content": "Eic\n\nYour animated pic is sheer film festival quality. I love it.\n\nJim\n\n"
    },
    {
      "time": " 2.Nov.2005 12.30pm",
      "content": "How can you not love type when there is so much of it to hate!?\n\n"
    },
    {
      "time": " 22.Nov.2005 3.09pm",
      "content": "There can be no history without writing.  \nIt is known that the first language ever to be ’written’ was pictographic, but then the process and the abstract made it a complex of symbols. Then the symbol returns to the image, but this time, in your mind...  \nHave you ever thought about the way “typography” is linked with the abilities of the human being?  \nAs I usually say, “typography is the witness, the scream, the silence, the blank and the colourful” and why? Because it grew with us. It was there when history passed. It has the essence of the time where it was drawn or written. It represents the beliefs, the beautiful, the truth and the lie. Have you noticed the power within it? It is the most beautiful and complex mélange of history, art and communication.  \nBy choosing the typeface, your giving it personality. By choosing the weight you’re augmenting or silencing speech. You are making it clear, or confusing it. You are playing and conjugating social and aesthetic codes that can please or hurt. And not everyone can decode it. As it has been said before, it is also a cycle. It reinvents itself, still, it has always been the same for centuries.  \nIt’s not cast in wood or metal anymore, but the form and countershape is still the result. It helps the reader to understand text almost like an icon: by showing the analogy between the shape of the images that you conceive by reading, and the shapes of the letters.  \nThe way text is set gives it speed, tone. I believe that when text is set it has a personality of its own. It is a living being that lives in history, passes from reader to reader, it is understood and pictured. It is the witness of its environment.  \nThat is why it is so rich. That is why it invokes such responsability and attention. It is easy to be lost, to get frustrated when you’re setting text. It always seems that it isn’t good enough to match the meaning. Although time cannot touch it because it in away that it can only give a social context to place it in, time is simultaneously what mutates it.  \nIt’s a quest. A passion and an obssession.\n\n"
    },
    {
      "time": " 26.Nov.2005 1.06pm",
      "content": "I love type for the same reason that I try to be articulate and good humored. Also because type won’t go away until people stop talking to each other.\n\n"
    },
    {
      "time": " 26.Nov.2005 1.14pm",
      "content": "For as much as I’ve tried, I still can’t sing. But my type keeps getting better, so I’m sticking to that.\n\n"
    },
    {
      "time": " 28.Nov.2005 1.54am",
      "content": "Letterforms dance on the boundaries between tangible and intangible.\n\nThe fascination starts young, seeing letters made solid on Sesame Street. Here are these people holding a shape made of plastic or something, and they tell you it’s an “A” and it’s in a lot of the words you say. Even at such a young age, this raises all sorts of philosophical questions: Is that really what comes out of your mouth when you talk? Why can’t you see it? Are the ones printed on a page only _pictures_ of “A”? Does “A” exist? Such ideas tripped up Plato.\n\nDouglas Hofstadter has said that the essence of the study of artificial intelligence is in the question, “What is the letter A?” This is because symbols are crazy shapeshifters. Set an “A” each in Stop and LCD and ask yourself, what do these two things have in common? Almost nothing... except a _lot of context_ that lets you recognize both as if they were the same thing. A precise, inclusive definition of the shape of a letter can never be more definitive than “May contain one or more of the following...” Yet we recognize them so easily that typography is practically an invisible art.\n\nSo we’ve got these almost paradoxically malleable things that wouldn’t exist without us. We can imbue into them other intangibles, like moods, by playing with them the right way. Testing the boundaries of what is and isn’t an “A”, and what makes a _better_ “A”, is a lot like testing the boundaries of one’s own identity. It’s a puzzle with no hard rules but with concrete results. It’s magic, and it’s fun.\n\n"
    },
    {
      "time": " 28.Nov.2005 3.51am",
      "content": "(Among other things here already said I’d like to add) Because taking care of the details with love is like saying ’Thank you’ to our Creator (pretty religious today I am) :)\n\n"
    },
    {
      "time": " 28.Nov.2005 4.17am",
      "content": "Because it offers you storage for books:)  \n [http://www.set26.ch/offen.html](http://web.archive.org/web/20080706080110/http:/www.set26.ch/offen.html \"http://www.set26.ch/offen.html\")\n\nTim\n\n"
    },
    {
      "time": " 28.Nov.2005 5.34am",
      "content": "...because there is something awfully compelling about being the practitioner of a craft with such rich and varied traditions.\n\n...because few creative careers reward the patient and virtuous soul.\n\n"
    }
  ]
}
