{
  "id": "15823",
  "title": "What? Yet another blog?",
  "forum": "Grant Hutchinson's blog",
  "tags": [

  ],
  "content": "I already occupy enough places to ramble amidst the ether without filling up this page as well. However, for a bite-sized review of what I'm all about, try [this](http://web.archive.org/web/20131014235855/http:/typophile.com/wiki/Grant%20Hutchinson) for starters.\n\n",
  "author": "Grant Hutchinson",
  "time": "24 Oct 2005 — 11:42am",
  "uid": "1011",
  "comments": [
    {
      "time": "4 Oct 2007 — 10:17am",
      "content": "Grant: I'm just down the road in Whitefish Montana. Have been searching for Basilea font in digital/postscript form for use on my Mac. I used it years ago on a Typositor and have a printed font character showing in an old typographers catalog, from which I can scan and convert to a font via Fontographer, which I've never used, but may try on my old Mac G3 OS 8.6. But it'd be easier to just get the darn font from someone. Any suggestions? THX RK\n\n"
    },
    {
      "time": "4 Oct 2007 — 12:07pm",
      "content": "Grant...I've followed your blogs for years but had no idea you had a portfolio of typefaces of your own making. Cool!\n\n"
    },
    {
      "time": "4 Oct 2007 — 2:59pm",
      "content": "Don't worry about getting all blogged down, Grant :-)\n\nChrisL\n\n"
    },
    {
      "time": "23 Oct 2007 — 10:31am",
      "content": " **@richk** Send me an email via the contact link above. I should be able to scrounge up an old version of Basilea from my Image Club archives. I may even have the original Fontographer source file handy.\n\n**@aluminum** Thanks. I really should build out a page showing off those old designs and filling in a bit of the background and history. Every face tells a story, right?\n\n**@dezcom** What? Me worry?\n\n"
    },
    {
      "time": "23 Oct 2007 — 11:11am",
      "content": " ![](http://web.archive.org/web/20131014235855im_/http:/typophile.com/files/alfred_6433.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "16 Nov 2007 — 4:32am",
      "content": "Hi  \nI too am looking for Basilea. It was used in the Logo for the charity I do some work for... The designer of the logo dropped off the radar years ago and there are only bitmap versions of the logo left... not so useful when I've been asked to make a poster-sized version!  \nThis is definitely the most hopeful lead I've found so far... I could buy Alexon, but Basilea would be better. Grant I'm pressing that contact button...  \nCheers  \nPhil\n\n"
    }
  ]
}
