{
  "id": "15821",
  "title": "Opinions on forum software",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "This logo is for use on a software system that focuses on bringing different groups together and enabling them to form a consensus opinion about some topic. The software allows groups to post opinions in essay form, with each group member voting on which essay best describes their position. Through constant feedback between groups, a consensus is reached. In theory.\n\nI’ve used the idea of a venn-diagram, where two sides are presented and join in the middle, establishing a common ground, or a common voice. The name itself doesn’t mean anything, it’s just some unspecific title that’s friendly and unobtrusive. I guess. Stupid name if you ask me, especially since this software is targeted at government agencies and corporate committees. If I go into detail with it I will not stop.\n\nThoughts on concept, form, and color are more than welcome!\n\n| Attachment | Size |\n| --- | --- |\n| [jodi.gif](http://web.archive.org/web/20060522200219/http:/typophile.com/files/jodi.gif) | 5.29 KB |\n| [jodi\\_2.gif](http://web.archive.org/web/20060522200219/http:/typophile.com/files/jodi_2.gif) | 8.03 KB |\n| [jodi\\_3.gif](http://web.archive.org/web/20060522200219/http:/typophile.com/files/jodi_3.gif) | 9.05 KB |\n\n",
  "author": "<a href=\"user/2739\" title=\"View user profile.\">whoisdan</a>",
  "time": "<br>",
  "uid": "2739",
  "comments": [
    {
      "time": " 24 October, 2005 - 12:05pm",
      "content": "The concept itself is nice. I like the venn reference and the discussion aspect comes into play nicely with the word balloons. The balloon over the J looks a bit disjointed and improperly spaced to me, but the one over the I looks fine.\n\nThe only issue I have is the color. I’d opt for more saturation. Lively discussion and a lively mark. Your Starcom work is a good example of what I would envision, but to an extreme extent. That might be a little too much for a government agency targeted piece of software.\n\n"
    },
    {
      "time": " 24 October, 2005 - 12:28pm",
      "content": "I like the balloon concept very much! But I also find the colors to be unattractive. They remind me of camouflage, but considering the mood of the government these days, it might be a match made in heaven!  \nD~\n\n"
    },
    {
      "time": " 24 October, 2005 - 12:45pm",
      "content": "Ah, you’ve uncovered my biggest weakness: Color!\n\nI produced a couple one with red+blue=purple and yellow+blue=green and they weren’t working very well. The current colors are adjusted from a client-provided spec. Lemme see what I can do with the colors.\n\nGood catch with the balloon over the “j”. I’ll fix that.\n\n"
    },
    {
      "time": " 24 October, 2005 - 12:59pm",
      "content": "Color’s my biggest foe too. How about a split complimentary scheme based on a more saturated version of your first blue color?\n\n"
    },
    {
      "time": " 24 October, 2005 - 1:53pm",
      "content": "I like it. I might move the balloons around to find the best relationship. Maybe one can be a bit bigger than the other. Are you feeling pretty close to done or do you want a type crit too?\n\n"
    },
    {
      "time": " 24 October, 2005 - 2:06pm",
      "content": "I do like the colors, but not for this project. The problem is that if you consider that your software is about conversation you probably want to think of positive colors. These colors as they are seem depressing.\n\n"
    },
    {
      "time": " 24 October, 2005 - 2:51pm",
      "content": "I’m with Tiffany. Save those colors for another project. I like both, but the word balloon one seems more interesting/meaningful.\n\nThe ‘j’ feels weird to me. I want it to connect, but then it might be too close/confusing. However, adding space may make it feel disconnected. Perhaps the ‘o’ and ‘d’ need to be pulled apart a bit? It’s also possible your solution represents a happy medium.\n\nAlso, try bringing the word baloons down a bit closer to the words. Or perhaps the lefthand one should just feel a bit more connected to the ‘j’.\n\n"
    },
    {
      "time": " 24 October, 2005 - 3:04pm",
      "content": "Revised GIF is up top in first post.\n\nI adjusted the left bubble and its relationship with the “j”. I also eliminated the color bundles and tried it out with one color and 50% of that color. I think it’s much clearer this way, but I am trying a 2-color solution as well.\n\nThat said, I am completely open to criticism on form, type, color, concept. I’m using Dolly Bold, in case you’re keeping track at home.\n\nThe adjusted bubbles might clear up the weirdness of the unattached “j” a little, but I’ve been staring at this thing so long I don’t know anymore.\n\nThanks for the help, by the way!\n\n"
    },
    {
      "time": " 24 October, 2005 - 5:25pm",
      "content": "Do you mind if I take a visual hack at it?\n\n"
    },
    {
      "time": " 25 October, 2005 - 7:57am",
      "content": "Yeah, I’d rather you not do that. But I will have a revision up at some point today. Thanks!\n\n"
    },
    {
      "time": " 25 October, 2005 - 8:12am",
      "content": "It’s better, tighter now.\n\nThe blue seems a bit pale, but I’m not seeing it in context, so take that with a grain of salt.\n\nIs there a specific reason for getting rid of the dots on the letters? It might serve your purpose more overtly to leave them on (reading like conversing people).\n\n"
    },
    {
      "time": " 25 October, 2005 - 8:33am",
      "content": "Balloonss are better. The implied conversation of the other is not obvious enough.\n\nI do think the colors could be happier.\n\n"
    },
    {
      "time": " 25 October, 2005 - 9:39am",
      "content": "What if the the jo & di where not speaking but being spoken - What if you had a logo of two voice ballooons but the the type inside. That would be visually simpler and would ‘read’ faster. I would also encourage you to let one of the balloons be more obviously larger than the other. The sizes seem a little too equivacal to me now. And what about the b/w version? It seems like any logo worth the name needs to work well in b/w. I think a logo that has to do with speaking aught to have a warmer tone overall. What about basic corporate black & red ( with b/w too) ?\n\n"
    },
    {
      "time": " 25 October, 2005 - 9:58am",
      "content": "the j and i could have connected descenders that loop around top to create a head. Their dots then look like eyes and the o and d would look like nostrils. I drew it up, but it is less evident than the current scheme and a lot more whimsical. There are a lot of possibilities with this.\n\n"
    },
    {
      "time": " 25 October, 2005 - 10:53am",
      "content": "Ray, that sounds really fun, but also terrifying. :-)\n\nDan, I also wonder if you could get a third ballon in. Not a whole ballon but just a suggestion to make the balloons mean ‘many’ rather than two.\n\n"
    },
    {
      "time": " 25 October, 2005 - 11:06am",
      "content": "“…but also terrifying.”\n\nWell, Halloween IS right around the corner, heh.\n\n"
    },
    {
      "time": " 26 October, 2005 - 3:30pm",
      "content": "New GIF in original post.\n\nAlright. Had to make some decisions. Client also had some input. I wanted to see what the talk-bubbles would look like with dots on the j and i, and client wanted non-bold type and a direction that used circles instead of letterforms for venn-diagrams.\n\nI prefer the new talk-bubble one, #1 because it allows the type to breath and doesn’t have an overpowering visual weight.\n\nI hate #3 and #4, especially #4, but I’m scared that it’ll get chosen because he’s got his mind set on it. Any ideas about making #3 and #4 better?\n\nMain things to consider still: This is corporate-committee software, clients espouses venn-diagrams, and these are final directions.\n\nThanks!\n\n"
    },
    {
      "time": " 26 October, 2005 - 8:31pm",
      "content": "I think #2 is your top pick & you have shown it works nicely in b/w!\n\nI think the #1 reason 3& 4 can’t be viable is the MasterCard Logo. If they get litigious this could get ugly.\n\nSee?\n\n ![](http://web.archive.org/files/am1_a.gif)\n\n ![](http://web.archive.org/files/am1_c.gif)\n\n ![](http://web.archive.org/files/jodie.gif)\n\nBut legal issues aside jodi is a small brand & masercard a big one and you dont want to raise any brand confusion in your solution. So for both reasons I would counsel your client to avoid that particular direction.\n\nWhat if you had 3 or 4 or 5 voice ballons? And inside the nexus it said ‘jodi’? The triangle shaped voice sources could all draw down to some common point below or in the middle or you could arrange them like flower petals with the radii comming from tthe outside.\n\nThat would maybe position jodi as consensus in a way that isn’t suggested by the current arrangment of parts. Can two people have a consensus? Don’t they just agree?\n\n"
    },
    {
      "time": " 27 October, 2005 - 6:41am",
      "content": "I read the combined counters of 3 and 4 as Jooli.  \nOf 1 and 2 I find the speech bubbles look  \na) a little like bird’s heads pecking at the dots, have you tried using a curved “speech arrow”?  \nor  \nb) more like storm clouds, you could try using a stroke instead of a fill so that it doesn’t dominate the text too much  \nI like the use of Dolly but I find the od combination a little tight.  \nTim\n\n"
    }
  ]
}
