{
  "id": "15842",
  "title": "Bell Gothic, what a strange beast...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I came across a previous thread that mentioned the typeface Bell Gothic, and wanted to discuss a couple things with you fine and wonderful people.\n\nAs a young designer, Bell Gothic has intrigued me for its functionality and history, as it was designed primarily for small print and legibility. But I’m starting to see this face more and more in corporate identity systems (the company I am employed at included). I’ve seen it used on anything from the new FBI Anti-Piracy label on CDs, to American Express television advertising and collateral.\n\nI guess my question and invitation for discussion is, what do YOU as a designer think/feel when you see a typeface being used against its primary creation function? (IE: A face designed for small sizes being used for display type, etc).\n\nAnd on a side note, does anyone else think the uppercase “I”, when set in black, looks awkward? What was the motivation on keeping those serifs so thin???(See attached)\n\n| Attachment | Size |\n| --- | --- |\n| [caps.png](http://web.archive.org/web/20140719005448/http:/typophile.com/files/caps.png) | 2.06 KB |\n\n",
  "author": "jlusby",
  "time": "25 Oct 2005 — 12:21pm",
  "uid": "9858",
  "comments": [
    {
      "time": "25 Oct 2005 — 1:30pm",
      "content": "Intent: very tricky question! Almost requires a book.\n\nBTW, that \"I\" is a mistake. Anybody who tells you  \notherwise is a hopeless Bell Gothic apologist.\n\nhhp\n\n"
    },
    {
      "time": "25 Oct 2005 — 1:30pm",
      "content": "As a type designer, I may have a certain idea how a font might be or even should be used. I long ago learned that designers will do whatever they want anyway, often exceeding my expectations, doing things with my fonts that I would not. (I thought Felt Tip Roman should only be used about the size of actual handwriting, that it wouldn't look right at headline sizes. Silly me.)\n\nThe fact is, in graphic design there is a constant demand for novelty. Using typefaces in ways they were not intended is one way to achieve that. Once somebody does it, it gets noticed by other designers who copy the idea. Eventually, the idea becomes so widespread, that the novelty wears off and the cycle starts again with some other idea.\n\n"
    },
    {
      "time": "26 Oct 2005 — 5:40am",
      "content": "\\_Texas Monthly\\_ uses Bell Centennial not only at the intended small sizes, but also as a headline face, to a neat effect:\n\n[http://www.usaplasticsurgery.com/media/texas\\_monthly\\_cover\\_feb\\_2005.jpg](http://web.archive.org/web/20140719005448/http:/www.usaplasticsurgery.com/media/texas_monthly_cover_feb_2005.jpg \"http://www.usaplasticsurgery.com/media/texas\\_monthly\\_cover\\_feb\\_2005.jpg\")\n\nThose ink traps are mighty tasty -- to this non-designer's eyes, anyway. It's definitely something different to a lot of the other sans options they could have gone with.\n\n"
    },
    {
      "time": "26 Oct 2005 — 7:46am",
      "content": "First off, thank you everyone for the responses…but one in particular sparked an interest for further discussion…  \n  \n**RE: Mark Simonson  \nThe fact is, in graphic design there is a constant demand for novelty. Using typefaces in ways they were not intended is one way to achieve that.**\n\nIn response to this, where, as designers and critics, do we draw the line? I feel like from so many sources, whether it be former some of my art directors or the wonderful [http://www.spiekermann.com/iblog/](http://web.archive.org/web/20140719005448/http:/www.spiekermann.com/iblog/ \"http://www.spiekermann.com/iblog/\"), I've been trained and told to respect and follow rules and guidelines.\n\nWill people use typefaces without regards to its “rules?” Perhaps. But is that wrong or right? Even if one does create novelty? Isn’t disregarding its previous intention and function incorrect or “disrespectful” to a certain extent?\n\nJust giving food for thought and discussion…\n\n"
    },
    {
      "time": "10 Jul 2013 — 2:53am",
      "content": "I'm thinking about using Bell Gothic in a logo for a laser company, this being a nod to AT&T's Bell Laboratories laser history.\n\n"
    }
  ]
}
