{
  "id": "15841",
  "title": "Reliable, Capable Printer in NYC",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m working on an identity package for my full-time employer that requires something more than online business card factories can provide. I’m also getting fed up with some of the copy shops we use for a lot of our other materials who either assume I don’t know what I’m talking about, don’t pay attention to the quality, or don’t have the capabilities I need.\n\nI’m looking for a printer that can take direction but also offer it, and can do solid offset printing for a reasonable price. I’m not looking to do anything crazy or unusual, but I’m specing stock and inks, etc. and want a conscientious printer. Any other capabilities (Indigo, low-run color copy, etc.) are a bonus.\n\nI know almost nothing about printers in the NYC area and any help/advice would be great. Even a resource for or list of decent printers would be great, as there are so many to wade through and I can’t afford for this project to come out half-baked. Many thanks in advance.\n\n",
  "author": "<a href=\"user/2172\" title=\"View user profile.\">Chris Rugen</a>",
  "time": "<br>",
  "uid": "2172",
  "comments": [
    {
      "time": " 25 October, 2005 - 1:19pm",
      "content": "Tanagraphics is a good press in NYC. I could probably “wrassle” you up a list of few others.\n\n"
    },
    {
      "time": " 25 October, 2005 - 2:11pm",
      "content": "Look at GreenDot if they are still around. I’ve not worked with them but used them for bids and liked the people.\n\n"
    },
    {
      "time": " 27 October, 2005 - 3:01pm",
      "content": "Chris the problem with printers in NYC is they aren’t printers, they are print brokers. You need to find a print broker that you trust and your print jobs will be handled in places as close as 26th Street Manhattan and an hours drive in New Jersey and even a flight to Atlanta. Your print broker will have enough contacts to keep the quality and the cost in line for your job. Altag Press was a print broker I used for years, but I’ve used others and got good results.\n\n"
    },
    {
      "time": " 31 October, 2005 - 1:47pm",
      "content": "Hey, sorry. I drifted a bit from this topic. Thanks so much, all three of you. I’m going to look into all three options. I think the print broker angle might make the most sense. I’ll let you know what happens.\n\n"
    },
    {
      "time": " 15 March, 2006 - 7:36pm",
      "content": "Update: Jupiterboy, I ended up going with Greendot. They are _great_ and I’ve already done a bunch of work with them. Thanks again!\n\nI recommend Greendot to all.\n\n"
    }
  ]
}
