{
  "id": "15844",
  "title": "More ponderings on type education",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "When you stop and think about it, it is quite a challenge to determine what would be most useful to graphic design students in two or four year programs. History, theory, instruction on production techniques, practice (problem solving) and critique is the basic curriculum of study. Somewhere thrown into the mix is some attention to \"type usage.\"\n\nBy necessity, educating graphic design students today is trying to compensate for the loss of several professions that supported the graphic arts in the past. Designers no longer send out copy to typesetting shops, no longer have professional typographers and proofers comb over every detail of copy output, and no longer have the benefit of \"on the job\" training by seasoned professionals of past trades. In other words, graphic designers are now required to fend for themselves.\n\nSo in educating design students, how do we help them to jump back-and-forth from \"high design aesthetics\" to down-and-dirty production? Personally, I don't think having students practice producing finished samples in a wide range of applications is very fruitful. Besides, students have a hard enough time just finishing work on their current assignments. I feel we need to embue novice designers with the skills and abilities required to face any design challenge in our ever changing landscape of communication and visual experience. The question now is what are those unique and necessary skills, and can they even be taught.\n\nI have been pondering the question of \"what do I have (skill, knowledge, experience, ability, etc.) that ultimately helps me to face and solve a design problem or produce a finished piece?\" (in print or on screen). Also, how, when and where did I acquire or refined these skills and abilities? Was it through training (school or job)? Was it through sheer experience from years of work? Was it an \"awareness\" or \"understanding\" that developed through self-learning or \"apprenticeship\"?\n\n**\"SEEING\" & Second Sight**  \n\"_Seeing_\" is the ability to take in the pure visual experience of an in-progress or finished piece. This \"pure vision\" is devoid of content, context, association or conceptualization. It's _nada, rien, nichts_ in the mind and all it the _eye_. Once you can see in this manner, you can then step back and make assessments of the total piece and its individual components.\n\nThis is how one can see the color and texture of type, discover what is present in the negative shapes, and see the overall balance and visual dynamics of the piece. You will be able to look at type without seeing words or letters. Once you've done this, then you can start making adjustments, select another head or text face, reshape the massing of text, and so on. If you don't or can't take this perspective, you are then just _fussing and fiddling_ with the piece.\n\n\"_Second Sight_\" is the ability to envision the piece in its final state. Part of this ability is an understanding of each aspect of production and the impact or effect they have. If you are designing a six-color piece in CYMK, one spot color and spot gloss varnish on dull coated stock, you can't have any sense of the completed piece without successful envisioning of the end result. The further and further away designers get from the final completed piece, the less capable they become in making both critical and refined design decisions.\n\n**\"The proof is in the pudding\"**  \nNo matter how well you have visually and technically examined each stage of prepress on a project, the only thing that really matters is the end result. If you have corrected the \"color\" and kerning of every text block off your laser printer without ever following-up on each step of production phase up and to the final press sheets, then don't be shocked by the end results.\n\nWhen a designer is able to \"see\" the work, envision the printed piece, make a full critical assessment of the final project and then carry the experience forward, then that designer is ready to face most any project head on.\n\nOK, now how do we develop a course of study, projects, assignment or exercises that can help students to develop and refine these abilities?\n\n",
  "author": "Norbert Florendo",
  "time": "25 Oct 2005 — 1:48pm",
  "uid": "7764",
  "comments": [
    {
      "time": "6 Dec 2005 — 5:20pm",
      "content": "Just saw this thread...\n\n\"seeing\" -- I think this is the function of experience, combined with education, talent, etc. Can't be directly taught, evolves over time.  \n\"proof is in the pudding\" -- no argument here either, but again you're talking about the end result.\n\nI'm currently teaching typography to design students, mainly sophomores and juniors. I try to mix a combination of technical foundation skills, aesthetic sensitivity-teaching, and conceptual assignments -- but can't do it all in one semester by any means. So it comes down to what I think is most critical, given previous student learning and the particulars of how departments structure their classes and curriculums.\n\nRecently I spoke with another typography teacher who pointed out that the pitfall of an overly structured curriculum (all sans serif the first semester, no-justification-only-FL/RR kind of orthodoxy) can be stifling for student growth. But I came out of that appreciating the many kinds of typographic aesthetics, if only through partial resistance.\n\n**My 2 cents**  \nI vote for technical skills, combined with aesthetics training first. What is leading? Why do you need to control it a point or often fraction at a time for the appearance and function of text type? What are serifs (in some types) and counters in roman typefaces? How do they work? What happens when you change the scale of type from text to display? How does white space interact with typographic layout, etc. I think exercises that teach these, and how to both visualize and execute them are basic Type I kinds of assignments.\n\nI'm also guilty this semester of not critiquing composition weak spots as much as I might like, in emphasizing grid or page formats for multipage or system applications. It's a trade-off, but in this case they're learning communication, by synthesizing/formalizing their work on the computer so they can present and explaining their ideas to others. That's obviously design, when it's practiced well; and sometimes incomplete gibberish when understood poorly.\n\n"
    },
    {
      "time": "6 Dec 2005 — 6:04pm",
      "content": "Thanks for pondering along with me, Peter.  \nI was started feeling that I was sitting all alone in this end of the topic forum.\n\n\\> _ **My 2 cents**  \nI vote for technical skills, combined with aesthetics training first._\n\nYou have a valid point there. If anything else, student graphic designers should be taught basic mechanics of typesetting (a long lost term). I also believe aesthetics evolve.\n\nMy question is: what training, exercises, etc. can help accelerate sensitivity to type and improve typographic skills? It's this plus other questions, experiences and comments from design educators we can exchange at this forum. Maybe some good will come of this.\n\n"
    },
    {
      "time": "12 Dec 2005 — 1:58pm",
      "content": "Norbert, you _are_ all alone :-)\n\nAs far as actual exercises, I've described a part of one assignment I've given in The Education of a Typographer, under Teaching Typography (compiled by Claire Hartten), and have another I've revised with Ilene Strizver for her forthcoming edition of Type Rules!. The first is an exploration of forms and counterforms (for the design of a 2- or 3-letter monogram), the second is an investigation of readability in terms of typeface, pt. size and line length.\n\nIn another discussion, I suggested the following (more advanced assignment):  \n- Can you compare a display design like Big Caslon by Matthew Carter with Carol Twombly's Adobe Caslon, or consider ITC Founders Caslon by Justin Howes and Ed Benguiat's ITC Caslon 224? What are the differences among the designs in terms of letter shapes, rhythm or proportion, stress, and stroke contrast? Where do they borrow from Caslon's types and what do they add or reinterpret? And for what purposes, such as tight setting or lengthly text?\n\nPutting aside typeface design, how might you teach typographic layout? I know some teachers encourage their students to choose the text and format, while others determine both the words and the page size for first semester classes. How might you critique their work, and to what desired result? Are the exercises of Weingart or Hiebert valuable or too personal for students to learn from other teachers?\n\n"
    },
    {
      "time": "12 Dec 2005 — 5:42pm",
      "content": "I studied with Hiebert for 3 years while he was teaching at CMU (1963-1966) and had a 2 week typography class with Weingart and Hiebert together in 1988.  \nI found their teaching to be excellent and their assignments quite valuable.  \nWhen I was a young student at CMU, it took a month to understand what Hiebert was talking about but after I learned enough Basle-Speak, I began to understand. Hiebert, at the time, was an awe-struck disciple of Ruder and Hofmann. When I saw him again in the late 80s, he had become much more himself. I would say that without a doubt, he was the most influential person for me not only in my design education, but in my design career.\n\nChrisL\n\n"
    },
    {
      "time": "20 Feb 2006 — 3:30am",
      "content": "I'm reviving an old thread here. :)\n\nI just completed a 3-yr degree two years ago (Bachelor of Design (Visual Communication)), there was only one typography course, aptly named \"Typography\". I was astounded to find out that it was <cite>an elective</cite> and that many of the design students hadn’t chosen it.\n\nThe course consisted of;\n\n**Typography basics** ~ Anatomy of a typeface, classification and a quick history of typography.\n\n**Typesetting** ~ (most of it by hand) The lecturer was rather old fashioned so we were forced to draw layout mockups by hand (widths by pica measurement). We had to work out how many characters the copy consisted of and use a type specimen sheet accordingly to work out how many characters would fit on a line. We also had to kern/lead by hand which was very time consuming.\n\n**Type design** ~ We had to design an intricate floral initial letter. We were also given the option to digitise it in Illustrator.\n\n**Research** ~ Select a type designer and research the typefaces he/she designed.\n\nThis course went on for only 13 weeks. Do you think this is sufficent education for a graduating graphic designer?\n\nI think this raises some questions as I know many graphic design degrees in Australia lists typography as an elective course.\n\n"
    },
    {
      "time": "22 Mar 2006 — 8:40pm",
      "content": "_This course went on for only 13 weeks. Do you think this is sufficent education...?_ and  \n_...I know many graphic design degrees in Australia lists typography as an elective course._\n\nTo put a positive spin on it, some training in typography is better than none...\n\nTypography as an elective sounds a bit ridiculous for training professionals, but there are plenty of courses that combine type with graphic design. My guess would be that accrediting organizations in various countries have struggled with this, and probably decided to leave it up to the specialists or the institutions. I don't know Australia's system for insuring that a Bachelor's degree has some basis in the area it claims.\n\nFWIW, walking through one of the larger bookstores in NYC and seeing some of typography books gave me a contrary thought: with all these well-intentioned books on typographic design, why is there so much poor type? Maybe it's not the fault of the publishers or the schools???\n\n"
    },
    {
      "time": "23 Mar 2006 — 5:31am",
      "content": "\"Maybe it’s not the fault of the publishers or the schools???\"\n\nI would speculate that much of the bad type we see is not done by trained designers. When Desktop Publishing came in 20 years ago, the typesetting craftsman began to be replaced by some folks who learned how to use PageMaker and Quark (but didn't understand typography). Many \"Three Day Wonder\" software courses are available today so I am sure the old typesetting craft with real masters of type are being priced out of the \"faster/cheaper\" labor market to this day.\n\nChrisL\n\n"
    },
    {
      "time": "23 Mar 2006 — 5:57am",
      "content": "Chris, you’re probably right. Although I haven't been long enough to reasonably judge a decrease in quality typography, today I received three brochures in the mail and they all looked like they were designed in Microsoft Word, set in Arial, and/or Times New Roman.\n\nI'll put in some more thought later after I've recovered. :^)\n\n"
    },
    {
      "time": "23 Mar 2006 — 6:01am",
      "content": "\\> <cite>Many “Three Day Wonder” software courses are available today so I am sure the old typesetting craft with real masters of type are being priced out of the “faster/cheaper” labor market to this day.</cite>\n\nPerhaps we need \"educate\" the market (clients) about the benefits of good typography so the \"right\" people are hired.\n\n"
    },
    {
      "time": "7 Aug 2008 — 3:32am",
      "content": "I'm in a design school RIGHT now, just entered my specialization- w have 2 years of foundation, and 2 and a half years of specialization in design. Last year, in foundation studies, we did a basic course in type and layout. It consisted primarily of understanding, what different types feel like. Can Jokerman be used for the caption of a picture that has a serene tree in it? Things like that. It included taking a quote, and using one typeface, whatever layout we please, as long as the type and the layout re-enforced what the quote meant.\n\nThis semester is completely to type. We just finished 3 weeks of classical type, we created makeshift quill pens, and wrote with reed pens, the quill pens, wrote in rustica, serifs and created a san serif font, wrote in our vernacular scripts (India is a treasure grove of scripts), and developed a matching typeface (to our san-serif) in our vernacular script. It was all about developing sensitivity to detail, and at the same time understanding how it works at a macro level. In our next (present) course, from what I hear, we'll be developing a book of typefaces. I'm not sure what the output is.\n\nSo far, it seems good! If anyone's interested in getting a sneak peek of the final presentation for last week's course on letterform design, it's up on my blog!\n\n"
    },
    {
      "time": "6 Oct 2009 — 3:59pm",
      "content": "The typography class at Arizona State University was well done. The first two years were heavy on typography. They started with making a square, rectangle, triangle, and circle of black. Each shape was designed to find optical correctness.\n\nWe also carved lead pencils into chiselled tips and drew lines the first year and the roman alphabet the following year. We made improvements within the context of a form of lorem Ibsom. The letters were organized I H A B E R and so on lending an organization to the design of the alphabet. Designing each letter, space, and kerning. We also designed rustica, uncial, Phoenician, and Greek letters. We were instructed and guided in the design process to make them optically correct. We learned to use the broad tipped pen.\n\nWe designed san serif letters as well with plaka, ruling pens, and brushes.\n\nThese studies are directly out of Swiss practice. My instructors had all worked with Weingart, Armin Hoffman, and such. They also came out of RISD. Rob Roy Kelly taught at ASU until he passed away R.I.P. He gave severe critiques in class with good point. My schools education designed with his strong pedogogical influence:  \n [http://www.rit.edu/library/archives/rkelly/html/03\\_ped/ped\\_tea1.html](http://web.archive.org/web/20150417090319/http:/www.rit.edu/library/archives/rkelly/html/03_ped/ped_tea1.html \"http://www.rit.edu/library/archives/rkelly/html/03\\_ped/ped\\_tea1.html\")\n\nIf a typographer's education does not have these skills they are definately at a loss.\n\nWe had two classes on graphic design history, a design history class, and constant references to typographic history, ideas, and personas in class. We had several classes where we did research of 30 designers.\n\nWe spent Junior year reading Robert B.'s phenomenal book and taking quizes on it every week. We also read Tufte's works and books on information design and the design process. Our projects were inspired by these works.\n\nRetrospectively, these studies were definately the most essential studies.\n\nWe learned color correction, how to get your screen and printed results to match, and prepress practices. We did more than this. I am listing things as I recall them.\n\nI am amazed at what we covered in 4 years. At the end of it I only had one website design class. I feel that was rather unfortunate in our times. There is only so much time in a day. Believe me, we used it too! I had no free time during those four years. It was intense.\n\n"
    },
    {
      "time": "15 Oct 2009 — 11:38am",
      "content": "Bringhurst, R. (2004). _The Elements of Typographic Style_. Point Roberts,WA: Hartley & Marks.\n\n"
    }
  ]
}
