{
  "id": "15856",
  "title": "(x) Looking for Aquiline {Yves}",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "I know this isn't quite an ID request but I need to show someone what t26's Aquiline looks like and they don't have it on the website. Can anyone help?\n\nThanks  \nClare\n\n",
  "author": "clare.holmes",
  "time": "26 Oct 2005 — 2:13am",
  "uid": "5385",
  "comments": [
    {
      "time": "26 Oct 2005 — 2:35am",
      "content": "Found this:\n\n<cite>Aquiline and Aquiline Extra Bold, made by Expert Software, has been discontinued and is no longer available for purchase. The company went out of business in 2001.</cite>\n\nAlso, it gets mentioned in the [T-26 FAQ](http://web.archive.org/web/20120730212056/http:/www.t26.com/about/help.php):\n\n<cite><strong>Whatever happened to that old, scripty Jim Marcus font \"Aquiline\"?</strong><br>\nI think I saw Aquiline sitting on a bench in Wicker Park asking underage passersby for a tissue. It won't be coming back to T26, and for this we are deeply sorry. Dirty vagrants are such fun with all their worn-out jokes and tired sob stories about bus fare by which they tug at your purse strings! But hey... let bygones be bygones.</cite>\n\n"
    },
    {
      "time": "26 Oct 2005 — 3:02am",
      "content": "Dave Nalle of Scriptorium made a copy but I'm not inclined to look for it.\n\n"
    },
    {
      "time": "26 Oct 2005 — 4:28am",
      "content": "There is an Aquiline Two available [here](http://web.archive.org/web/20120730212056/http:/moorstation.org/typoasis/pirates/index.htm) which at first glance on screen looks similar to the original. I hope this isn't genuine piracy here, expect it'll get moderated if it is.  \nTim\n\n"
    },
    {
      "time": "26 Oct 2005 — 5:02am",
      "content": "That's what I've been discussing with Stephen, and we haven't come to a conclusion yet, due to lack of hard facts... :^/\n\n"
    },
    {
      "time": "29 Jul 2011 — 12:48pm",
      "content": "And this?  \n [http://www.t26.com/fonts/982-Aquiline-Master](http://web.archive.org/web/20120730212056/http:/www.t26.com/fonts/982-Aquiline-Master \"http://www.t26.com/fonts/982-Aquiline-Master\")\n\n"
    },
    {
      "time": "29 Jul 2011 — 1:04pm",
      "content": "And this???  \n [http://new.myfonts.com/fonts/grouptype/aquiline/](http://web.archive.org/web/20120730212056/http:/new.myfonts.com/fonts/grouptype/aquiline/ \"http://new.myfonts.com/fonts/grouptype/aquiline/\")\n\nLooks like Aquiline is now everyone’s property.\n\n"
    },
    {
      "time": "2 Jan 2012 — 2:42am",
      "content": "Just for reference, our font Allegheny does bear some resemblance to Aquiline, but is not the same. Having seen and liked Aquiline I set out to design a similar font, likely following a process not much different from how Aquiline itself was designed, using samples of 17th century calligraphy in a similar style (see our Orford font) and rendering a rougher and more casual variation, admittedly aping some of the character variations in Aquiline, while adding other unique variations.\n\nThere is no point in ripping off a font when you can reimagine it and hopefully make it better, or at least more to your personal taste.\n\nDave\n\n"
    }
  ]
}
