{
  "id": "15851",
  "title": "Lancôme Typography Redux",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "French cosmetics house Lancôme has in my ’naïve’ view some very fine typography, amongst generally strong competition in the fashion/luxury field. Do you agree? Though I am but a tyro typophile (tyrophile?), I much admire the light, flowing handlettered type they introduced last year, but what first caught my eye was the main Lancôme logotype typically writ large (and backlit) in department stores. The overall impression is elegant, refined, balanced. Not overtly feminine, but certainly refined, discerning. Why? The letters are on the thin side, classically proportioned, firmly geometric, high contrast strokes, diminuitive serifs. But I am still at a loss. What separates this sophisticated style from the gamut of Roman inscription faces, or the modern Bodoni and its variants? Any and all comments welcome. I certainly can’t put my finger on it myself.\n\nI understand that the Lancôme letters are hand designed – not an existing digital type – as many traditional logotypes are. Also, a while back, hrant responded to a previous Lancôme thread of mine with:  \nThat style [the logotype] is called Elzevir. It started around the middle of the 19th century in France (as a reaction to Didone typography), and was taken up around the turn of the century by US foundries, where it was sometimes called De Vinne. There are some digital versions of the American stuff, but the original French stuff is harder to find. Our J P Knox has been working one on though:  \n [http://typophile.com/node/7596](http://web.archive.org/web/20090912041156/http:/typophile.com/node/7596 \"http://typophile.com/node/7596\")\n\nI tried to follow up the ‘Elzevir’ lead with Google, but with little success, as you might imagine. I find the net close to useless for anything a little obscure/difficult.\n\nA while back, somebody also commented on the forum that Desgrippes Associates digitized the original Lancôme face, but in the process “lost” the original logotype. Is this true? As regards other aspects of Lancôme’s type “system”, the subtitled “PARIS” below the ‘Lancôme’ would appear to be Trade Gothic Extended, or similar, according to another comtributor. Trade Gothic certainly seems a good match.\n\nAlso, Christophe Badani of Typophrage in 2004 finished work on a handwritten type for Lancôme – in two weights – Light and Ultra Light. The Ultra Light has an Ultra Light Alternative.  \n [http://www.typophage.com/fr/custom\\_fonts/lancome/lancome1.html](http://web.archive.org/web/20090912041156/http:/www.typophage.com/fr/custom_fonts/lancome/lancome1.html \"http://www.typophage.com/fr/custom\\_fonts/lancome/lancome1.html\")  \n [http://www.typophage.com/fr/custom\\_fonts/lancome/lancome2.html](http://web.archive.org/web/20090912041156/http:/www.typophage.com/fr/custom_fonts/lancome/lancome2.html \"http://www.typophage.com/fr/custom\\_fonts/lancome/lancome2.html\")  \nThis face is very elegant, and manages to look hand lettered rather than a font. As you can see on one page, this is perhaps to the clever use of alternatives. The effect is quite compelling, in any case.\n\nRegards,  \nDavid Perkins\n\n| Attachment | Size |\n| --- | --- |\n| [lancome.gif](http://web.archive.org/web/20090912041156/http:/typophile.com/files/lancome.gif) | 3.24 KB |\n\n",
  "author": "<a href=\"/web/20090912041156/http://typophile.com/user/8650\" title=\"View user profile.\">davidperkins</a>",
  "time": "<br>",
  "uid": "8650",
  "comments": [
    {
      "time": " 26.Oct.2005 2.19am",
      "content": "I would actually think, that “PARIS” is set in [Engraver’s Gothic](http://web.archive.org/web/20090912041156/http:/www.myfonts.com/fonts/bitstream/engravers-gothic/) (SC; there is no lc for this face anyway).\n\n"
    }
  ]
}
