{
  "id": "15864",
  "title": "Restaurant & Lounge Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi,\n\nI want your opinion on a logo one of our designers did for a new trendy restaurant & lounge. It’s called Marmalade and the logo is supposed to have a natural, sexy feel.\n\nThanks,\n\nEd\n\n| Attachment | Size |\n| --- | --- |\n| [marmalade.jpg](http://web.archive.org/web/20060522200231/http:/typophile.com/files/marmalade_2.jpg) | 42.08 KB |\n\n",
  "author": "<a href=\"user/7501\" title=\"View user profile.\">vivirenet</a>",
  "time": "<br>",
  "uid": "7501",
  "comments": [
    {
      "time": " 26 October, 2005 - 9:50am",
      "content": "I cannot see the images… so I am trying to post it again.\n\nEd\n\n"
    },
    {
      "time": " 26 October, 2005 - 10:38am",
      "content": "I love the typography. It’s extremely lovely. The squeezy juicy thing is a great idea, but something’s not quite right. First thing I thought of was the Cingular Wireless symbol. Maybe it’s the 3-D illustrative effect of the mark that’s making it not adhere to the style the type sets forth.\n\nAlso, marmalade is more gel-like not so much juice. This may be something to think about.\n\nI think it needs worked further, it’s a great path and direction though, keep pushing or should i say squeezing.\n\nJoseph Szala  \nVigor Graphic Design, LLC.  \n [www.vigorgraphics.net](http://web.archive.org/web/20060522200231/http:/www.vigorgraphics.net/)\n\n"
    },
    {
      "time": " 26 October, 2005 - 10:39am",
      "content": "Hmmmm, i’m not sure about ‘sexy’. I think it reminds me too much of a kids birthday party with yellow and orange ballons. I dont think it has that sophistication you would probably desire in a restaurant logo.\n\nIt also reminds me of the tongue from the Rolling Stones ‘forty licks’, and the little ‘balloons’ give a feeling of ‘lip smackin’ tastyness which (though does tie in with food) seems to convey the wrong message. It’s more fast food than ‘sexy natural’.\n\nI dont have any problems with the type, though changing the image may affect this.\n\nHope this helps?\n\n"
    },
    {
      "time": " 26 October, 2005 - 11:12am",
      "content": "Ed, your highlights are (quite literally) all over the place. You must have a different light source for every form. I like the big type, but am not wild about the all-caps face; seems a little too airport-signage-perfect for this context. And you might want to add just a hair’s space in the “rm” pair. c\n\n"
    },
    {
      "time": " 26 October, 2005 - 1:35pm",
      "content": "Try an orange.\n\n"
    },
    {
      "time": " 28 October, 2005 - 11:21am",
      "content": "What kind of food will the serve? This logo makes me think They will serve fries & stuff that goes with it. I like the energy of this but it seems more popular than trendy. Also, what kind of trendy?\n\n"
    }
  ]
}
