{
  "id": "15869",
  "title": "Creating an Oblique... (What's not to skew?)",
  "forum": "Design",
  "tags": [

  ],
  "content": "When you’re creating a conciously designed Oblique, what glyphs should remain in the upright style?\n\n [‹ Type in Space/Architecture](http://web.archive.org/web/20080906160226/http:/typophile.com/node/16259 \"Go to previous forum topic\") [Filling an image with type? ›](http://web.archive.org/web/20080906160226/http:/typophile.com/node/15855 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906160226/http://typophile.com/user/7929\" title=\"View user profile.\">silas</a>",
  "time": "<br>",
  "uid": "7929",
  "comments": [
    {
      "time": " 26.Oct.2005 2.48pm",
      "content": "Is this a trick question?\n\n"
    },
    {
      "time": " 26.Oct.2005 2.52pm",
      "content": "The period?\n\n"
    },
    {
      "time": " 26.Oct.2005 2.54pm",
      "content": "=^\\>\n\n"
    },
    {
      "time": " 26.Oct.2005 3.00pm",
      "content": "At least a round one. ;-)\n\n"
    },
    {
      "time": " 26.Oct.2005 3.06pm",
      "content": "No, it’s not a riddle. I was just wondering what everyone’s preferences are.\n\nI see that some designs retain a few upright math symbols such as the addition, equal, and greater/lesser than, but then the numerals are skewed. I skew those symbols.\n\nI keep the copyright and registered symbols upright, but then I skew my trademark glyph. Any graphical elements such as bullets or bonus ornaments stay the same as well. I’m on the fence when it comes to paragraph/linebreak marks.\n\n"
    },
    {
      "time": " 26.Oct.2005 3.06pm",
      "content": "I wonder if there’s a riddle in there somewhere though.\n\n"
    },
    {
      "time": " 26.Oct.2005 3.12pm",
      "content": "Ah, yes... round periods I keep.\n\nOh, and I adjust the sidebearings for the glyphs that I don’t skew.\n\n"
    },
    {
      "time": " 26.Oct.2005 3.28pm",
      "content": "Silas,\n\nMakes perfect sense. Maybe also keep the @ sign the same unless it’s directly related to lc A.\n\n"
    },
    {
      "time": " 26.Oct.2005 3.50pm",
      "content": "If you’re doing an oblique, rather than an italic, why not skew everything?  \nApart from the fact that it’s extra work, of course.\n\n"
    },
    {
      "time": " 26.Oct.2005 4.00pm",
      "content": "Uh, dah, what the... Man! I forgot what I was going to say. Ah, skew it!\n\n:-)\n\nChrisL\n\n"
    },
    {
      "time": " 26.Oct.2005 4.31pm",
      "content": "I skew everything (with optical compensation, of course) except for the ® and © and a few others. Recently, I started skewing the R and C within the circle, though.\n\n"
    },
    {
      "time": " 26.Oct.2005 5.51pm",
      "content": "Some years ago I had this idea that numerals shouldn’t be slanted. And not really because the math symbols often aren’t, more because of “ideological” reasons... I ran this by Evert B in Leipzig, and he said he thought there was some merit to the idea. When I finish Harrier for real (as a stand-alone design) I might do that.\n\nhhp\n\n"
    },
    {
      "time": " 27.Oct.2005 4.39am",
      "content": "Circular forms are optional, but most of the time they are not skewed, (particularly in sans).  \nSince Asterisk, daggers and ppg are not normally happy in italic, or it don’t matter, Reference symbols are optional. Math is a no-no as far as I’m concerned. Everything else gets skewed.\n\n"
    },
    {
      "time": " 27.Oct.2005 7.24am",
      "content": "Doesn’t Bringhurst mention something about keeping ({[]}) unslanted...?  \nAnd I suppose you wouldnt want to faff with | or ¦, surely?\n\n———————  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 27.Oct.2005 10.03am",
      "content": "There’s a difference in fit between an oblique sans and a serifed italic. The italic lower-case serifs cause most of these glyphs to occupy a more vertical space — thereby making a “roman” parenthesis a better fit (except before f, j, p and after d, f, l). So really, vertical (roman) parentheses in serifed italics is a good idea, although kerning them with the problem characters mentioned is required, and throughout the font also.\n\n"
    },
    {
      "time": " 27.Oct.2005 10.30am",
      "content": "I think this business of slanting or not slanting math characters and such goes back to the fact that many of these were not part of normal fonts in metal type. They were extra sorts which were purchased separately and could be used with any font. Linotype, for instance, had only one or two versions of each, none of them slanted. The idea that these should all follow the design of a particular font is a fairly recent idea.\n\n"
    },
    {
      "time": " 27.Oct.2005 10.38am",
      "content": "The math issue seems to me to revolve around usage. I am not a math person so I can’t answer but I wonder what situations might occur when setting math where italic is helpful? Maybe there is no real use for it. Maybe just when setting primes in italic to distinguish them from the original referant?\n\nChrisL\n\n"
    }
  ]
}
