{
  "id": "15878",
  "title": "Unicoder Latin v1.0 Released",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20070808225455/http:/typophile.com/user/108 \"View user profile.\") : 27.Oct.2005 8.01am \n\n—  \n**Unicoder Latin v1.0 Released**  \n—  \n_Idstein, October 27 2005 - Frank Jonen - Illustration & Typography today released Unicoder Latin, an innovative helper application for podcasters, bloggers and code wranglers who deal with Unicode characters on a daily basis._\n\nUnicoder Latin is a stand-alone application to be used to check on a character when you need it. Whether you are an avid blogger, maintain shownotes for your podcast or use mark-up software like skEdit, Hyper Edit, BBEdit or the built-in code view of your web design application, Unicoder Latin can help speed up your production.\n\nUnicoder Latin was originally a private tool Frank Jonen wrote for quick access to characters encoded in the Unicode Transformation Format 8 (UTF-8) for use in HTML documents intended for audiences with writing systems other than the Latin script, like Arabic, Hebrew or Kanji.\n\n_System requirements are:_  \nMac OS X 10.3.9 and up\n\n_Pricing and Availability:_  \nUnicoder Latin is available for immediate download at an introductionary price of $9,99 for the single user license at [frankjonen.com/products](http://web.archive.org/) till November 15th, after this date the price for the single user license will be $12,99.\n\n—  \n_Frank Jonen - Illustration & Typography is a leading design studio for PhotoFont and LiveFont design and development solutions for broadcast and film media. Giving a home to both, interface design solutions for web and desktop applications and typography and type design solutions, Jonen focuses on the usability of content and ease-of-use of applications harnessing web standards as a foundation for web projects and a natural love of letter-forms for all things type._\n\n",
  "author": "<a href=\"http://web.archive.org/web/20070808225455/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 27.Oct.2005 8.01am",
  "uid": "108",
  "comments": [

  ]
}
