{
  "id": "15883",
  "title": "Valor",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Greetings, all. Thought I'd post some samples of the display face I am currently working on to get some feedback. At this point I have the basic letterforms with various possible alternates, figures and basic punctuation. There is also only basic spacing and no kerning.\n\nThanks in advance for taking a look and letting me know what you think.\n\n| Attachment | Size |\n| --- | --- |\n| [charset1.pdf](http://web.archive.org/web/20150419074524/http:/typophile.com/files/charset1.pdf) | 31.59 KB |\n| [ValorSpec1.pdf](http://web.archive.org/web/20150419074524/http:/typophile.com/files/ValorSpec1.pdf) | 25.67 KB |\n\n",
  "author": "timotheus",
  "time": "27 Oct 2005 — 11:14am",
  "uid": "5658",
  "comments": [
    {
      "time": "28 Oct 2005 — 7:01pm",
      "content": "This would look interesting in very tight settings, for wordmarks or titles, with the serifs overlapping.\n\n"
    },
    {
      "time": "29 Oct 2005 — 9:43am",
      "content": "OK, this is my first contribution to \"critique\", and I'm feeling self-consious ... mostly because this font is so much better than anything I've done. But I want to contribute, because I'm hoping to use this forum one day.\n\nFirst off, I really like the face, and think it's very successful. My only comment is that I did a stutter-step when I read \"sunshine\" because of the similarity of the \"h\" and the \"n\". No idea what the solution is, because of the no-ascenders-no-descenders (semi-unicase?) design.\n\nThe only other thing that drew my eye is the dot on the \"i\". It stands out a bit; can it be reduced a little, or rounded off a hair?\n\nOK, I've made my comments, and I am ashamed: I feel like such an ogre, blasting someone's hard work.\n\nJay\n\n"
    },
    {
      "time": "29 Oct 2005 — 12:17pm",
      "content": "Nick, it's good to see you're joining in to the crits now.\n\nhhp\n\n"
    },
    {
      "time": "29 Oct 2005 — 2:37pm",
      "content": "Thanks for the feedback, folks.\n\nAnd no worries, Jay, I am looking for honest reactions here. You make a good point on both the lower-case h and the i; I'll give them some consideration.\n\n"
    },
    {
      "time": "30 Oct 2005 — 11:06am",
      "content": "Tim,  \nVery nice concept. I'll bet some heavy metal bands will be happy to see this.  \nIs it meant to be unicase?\n\nChrisL\n\n"
    },
    {
      "time": "31 Oct 2005 — 6:01pm",
      "content": "Yes, it is meant to be unicase with several alternates. One thing I'm still pondering is whether to have the lowercase be exactly the same glyphs as the uppercase or to include a set of alternates there. I might also use the \"stylistic sets\" for the alternates.\n\n"
    },
    {
      "time": "28 Nov 2005 — 11:27pm",
      "content": "One thing that you could possibly try out is to decrease the width on tail below the Q, especially since your serifs are so fine, it makes the Q stand out a little.\n\n"
    }
  ]
}
