{
  "id": "15881",
  "title": "Manquechapac",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is a latinamerican fusion rock band. From Santiago de Chile.  \nI use the andean mountains rocks and texture. I think it is near to be finished, but i need some suggestions, specially on space or contrast..  \nCan you help me on this and share some opinions?\n\n[http://photos1.blogger.com/blogger/2017/1635/1600/Manque.gif](http://web.archive.org/web/20131108190658/http:/photos1.blogger.com/blogger/2017/1635/1600/Manque.gif \"http://photos1.blogger.com/blogger/2017/1635/1600/Manque.gif\")\n\nBest,\n\nmh.\n\n",
  "author": "Miguel Hernandez",
  "time": "27 Oct 2005 — 9:51am",
  "uid": "1109",
  "comments": [
    {
      "time": "27 Oct 2005 — 9:56am",
      "content": "the link doesn't work.\n\nedit: now I see it...\n\n"
    },
    {
      "time": "27 Oct 2005 — 10:01am",
      "content": "I still can't see it. We have inline images now ( with flash 8 installed ) CAn anybody post the image to the page?\n\n"
    },
    {
      "time": "27 Oct 2005 — 10:02am",
      "content": "Checkout here, in my blog:\n\n[http://chilediseno.blogspot.com](http://web.archive.org/web/20131108190658/http:/chilediseno.blogspot.com/ \"http://chilediseno.blogspot.com\")\n\nBest,\n\nmh.\n\n"
    },
    {
      "time": "27 Oct 2005 — 10:09am",
      "content": "here it is for all to see.\n\n ![](http://web.archive.org/web/20131108190658im_/http:/typophile.com/files/Manque.gif)\n\n"
    },
    {
      "time": "27 Oct 2005 — 10:17am",
      "content": "Here is my impression. Over all it seems really strong. Here are my suggestions for maybe improving it. Really, I don't know that they will:\n\n•&nbsp;Maybe make the N a little wider.  \n• I like the Q but I wonder what more could be done with it. It is a huge graphic opportunity  \n• The ch - I wonder if the top of the c might bend down a little to help it read as a 'c' a bit more.  \n• Maybe let the 1st M be a little bigger and let it be spaced a little farther from the 'a'.  \n• What if the C on the inside was a bit rounder?\n\nSweet work!\n\n"
    },
    {
      "time": "27 Oct 2005 — 10:22am",
      "content": "Hey, this is pretty nice. Very balanced, in a dynamic way.\n\nThe only thing I would change is make the \"N\" not look like an \"Ñ\".\n\nhhp\n\n"
    },
    {
      "time": "27 Oct 2005 — 10:28am",
      "content": "I like this. I agree with Hrant, I'd only correct the N. The accent needs to read a little better than that.\n\n"
    },
    {
      "time": "27 Oct 2005 — 10:30am",
      "content": "Actually, the thing is that there isn't an accent...\n\nhhp\n\n"
    },
    {
      "time": "27 Oct 2005 — 10:46am",
      "content": "On the page he links to it has an accent.\n\n\"Mañquechapac\"\n\n"
    },
    {
      "time": "27 Oct 2005 — 10:51am",
      "content": "Oh. That link doesn't work for me; and the thread title has an \"n\".  \nWell, OK, then it's fine. :-) But you can have an \"ñ\" like that  \nwithout a vowel following? I guess if you're a rock band you can.\n\nhhp\n\n"
    },
    {
      "time": "28 Dec 2005 — 12:45pm",
      "content": "Hola! Here is an Update:\n\n[http://www.chiledesign.cl/](http://web.archive.org/web/20131108190658/http:/www.chiledesign.cl/ \"http://www.chiledesign.cl/\")\n\nThank you for your feedback,\n\nmh.\n\n"
    },
    {
      "time": "28 Dec 2005 — 2:39pm",
      "content": "i like the letterforms better in this new variant, because they're 'funkier'. i think the cursive elements to the 'm', 'k', 'c', and 'a' all lend to increased tension within the graphic.\n\nbecause elements of the letterforms are at odds with one another, but not overtly so, this new version feels more dynamic to me.\n\nbut what's with the completely different spelling of the name? is it intended to be phonetic?\n\n"
    },
    {
      "time": "29 Dec 2005 — 6:32am",
      "content": "The spelling change is a bit odd, but I also like the 'chunkier-ness' of the second variation. Foating the tilde accent helps as well. The only nitpik I have is that the 'Q' seems to be a bit too dominant.\n\n"
    },
    {
      "time": "11 Jan 2006 — 12:31am",
      "content": "The new one is good too but the 1st thing I thought of was what if the A shapes were lc 'a'. I bet it would be streonger & more legible that way. Peronally I like the dominant Q. I don't know why. Maybe because it's funky.\n\n"
    }
  ]
}
