{
  "id": "15906",
  "title": "Warren Chappell's Eichenauer",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Warren Chappell designed a font called Eichenauer (for Gustav Eichenauer, who cut the type in lead) in 1955, but it was never manufactured and released. To this day, I don't think there has been a digital version, either.\n\nI would very much like to do a digital version of this type, but I am not sure how to pursue this. First of all, we're talking about something from the 1950s rather than the 1650s, so there is a question of legal rights. Does someone hold the rights to the design? If so, how can I find out? Can I proceed anyway? Second, I would like to work from original materials as much as possible. A proof from the type is reproduced in Chappell's _Short History of the Printed Word_, so I figure I can contact the original publisher (Knopf) for more information. Any other ideas?\n\nI'd appreciate any insights on this. Thanks.\n\n",
  "author": "timotheus",
  "time": "28 Oct 2005 — 12:26pm",
  "uid": "5658",
  "comments": [
    {
      "time": "29 Oct 2005 — 2:52am",
      "content": "Tim, I'm going to say (cautiously, at first) that you can probably go ahead on this one.\n\nCan you upload a scan from your specimen, so that we can see what these letters look like? I'm only vaguely familiar with Chappell's oeuvre, and don't know Eichenauer.\n\nHere's the deal, as far as I can say (and I am not a lawyer!). It sounds like you are saying that Gustav Eichenauer commissioned this design, no? If he commissioned it, and not a foundry, then only two groups could possibly have rights to the face—Chappell's or Eichenauer's descendants. This is unlikely, but possible via a myriad of channels.\n\nIf this was done for a foundry, then the successor foundry of that foundry could theoretically have a trademark on the name \"Eichenauer,\" but most likely no protection on its design.\n\n"
    },
    {
      "time": "29 Oct 2005 — 5:06am",
      "content": "Thanks for your feedback, Dan.\n\nEichenauer was a punchcutter who worked for Koch at least during the 1930s. I am not sure of the arrangements, but it looks like both Koch and Eichenauer worked for the Klingspor foundry. Warren Chappell studied under Koch in 1931-32, but I don't know where he was during the 1950s. I think by this time he had his own studio and concentrated more on illustration and book design. Chappell's Lydian and Trajanus came, I believe, in the late 1930s and early 1940s. Linotype has a digital version of Trajanus now. It might be a good idea to contact them, I suppose.\n\nAnyway, I have attached a scan from the book, _A Short History of the Printed Word_.\n\n ![](http://web.archive.org/web/20150123220403im_/http:/typophile.com/files/gs770.gif)\n\n"
    },
    {
      "time": "29 Oct 2005 — 10:03am",
      "content": "Klingspor was absorbed by D. Stempel AG during the early 1950s. It is possible that Eichenauer would have continued working for them (but I doubt it).\n\nD. Stempel AG became part of Linotype in 1985. I work at Linotype now. A bunch of the people I work for used to work at Stempel, they might know about this. I can get back to you on Tuesday.\n\n"
    },
    {
      "time": "29 Oct 2005 — 2:38pm",
      "content": "That's very generous of you, Dan. Thank you!\n\n"
    },
    {
      "time": "29 Oct 2005 — 3:07pm",
      "content": "Love those umlauts.  \nIt's occurred to me, via a thread elsewhere, that it would be possible to do a language-specific \"contextual alternates\" OpenType substitution, so that those accented glyphs, which don't blend with other accented characters in, for instance Swedish, would be the ones used in German.  \nDoes that make sense, and I wonder what the code would be?\n\n"
    },
    {
      "time": "29 Oct 2005 — 3:13pm",
      "content": "Nick that would be great, but I believe I remember Thomas Phinney saying elsewhere that the language substitution feature isn't supported by any application!\n\n"
    },
    {
      "time": "29 Oct 2005 — 3:13pm",
      "content": "Sure, except language tags are yet to be supported AFAIK.\n\nhhp\n\n"
    },
    {
      "time": "29 Oct 2005 — 5:56pm",
      "content": "I was already thinking of doing them as some form of alternate substitution. It's a shame the language-based approach isn't supported. It will still be cool as a stylistic set or something, too.\n\n"
    },
    {
      "time": "29 Oct 2005 — 8:26pm",
      "content": "I would consider assigning these umlaut forms as titling variants using the layout feature. They would look best at larger sizes and, especially, in all-caps settings. At text sizes, I think they would not be sufficiently clear.\n\n"
    },
    {
      "time": "30 Oct 2005 — 2:59am",
      "content": "These \"odd\" uppercase umlauts were quite the norm for German metal type (Futura had them too, for instance). I have a feeling that the German typefounders may have sized the type on their body a bit differently, and so they didn't have enough room for umlauts above the letters (?). Does anyone have any old German metal sorts?\n\n"
    },
    {
      "time": "30 Oct 2005 — 3:01am",
      "content": "In other words, could that have been a technological thing, and not necessarily an aesthetic solution?\n\nEither way, building in alternates is a good idea, I think. German's are used to seeing such letters (even if less so now). So it doesn't come across as foreign or odd, the way that it might for native readers of other languages.\n\n"
    },
    {
      "time": "30 Oct 2005 — 8:42am",
      "content": "\\>titling variants using the layout feature\n\nIs that the feature \"titl\", listed as \"Titling Alternates\" in the InDesign OpenType palette?\n\nThat's a great idea, John!  \nTypographers could also use the feature for text setting, if they thought the glyphs were suitable.  \nIt would also be possible for foundries to include the cap German double-S in such an alternates set, as well as other Germanisms such as the \"tz\" ligature (see Eichenauer above) and the \"ch\" where the characters are practically touching. Do these uses require special contextual consideration, eg for Wortfugen?\n\nIt would be good if a German type designer could put together a standard set of specs for such an OpenType feature. It's the kind of thing I would love to include in my OT fonts.\n\nOn second thoughts, not standard, but it would be nice to have a list of the alternate glyphs and where they might be applicable, so non-German type designers could be better informed about what was appropriate to include in their fonts, and how to do it.\n\n"
    },
    {
      "time": "30 Oct 2005 — 9:40am",
      "content": "Despite what a few German type designer might tell you, there is no cap German double-S. The capital form of ß is SS. Some type designers throughout history (but really just a small few) and the GDR (the communist German Democratic Republic) have experimented with changing this, but it never really caught on (thankfully).\n\nMany German computer users do not know this, so you see typographic errors like \"MAßNAHME\" alot. This makes me cringe the same way that fake small caps or wrong quotes do. The best thing to do would be to set OpenType setting properly, so that when caps-lock is on, and the user presses the \"ß\" key, they get \"SS\" automatically.\n\nI like seeing special \"ch\" \"ck\" and \"tz\" ligatures, but they fell out of use in German typesetting decades ago.\\* We can bring them back through OpenType now, but I have a feeling that the ligatures would look odd and dated to the average reader.\n\n\\*The exception here is Blackletter faces. Even though many contemporary digital blackletter faces do not have these ligatures included, they should. Although the \"rules\" for setting Antiqua type changed over the past few decades, they did not for blackletter. It is just that blackletter is hardly ever set, and no one seems to care about it anymore. But any type designer who designs a blackletter font should include all of the historical glyphs in it, I think, because anyone who is actually likely to license a blackletter font is probably going to be more inclined to want to set it properly.\n\nBut even blackletter doesn't use the capital double-s ;-)\n\n"
    },
    {
      "time": "30 Oct 2005 — 9:43am",
      "content": "For those of you who want to read up on the capital double-s debate (and it is a debate, even if only about 10 or 20 people are debating), here are some links (mostly in German, sorry):\n\n[Erik Spiekermann weighs in (against) on his blog](http://web.archive.org/web/20150123220403/http:/www.spiekermann.com/iblog/C1097932338/E20050813174246/index.html)  \n [typeFORUM is mad because the Unicode Consortium said \"no\" to a capital double-s](http://web.archive.org/web/20150123220403/http:/www.typeforum.de/modules.php?op=modload&name=News&file=article&sid=302&mode=&order=0)  \n [Gerrit van Aaken, German design blogger extraordinaire, summarizes the arguments](http://web.archive.org/web/20150123220403/http:/praegnanz.de/weblog/631/heies-thema-versal-)  \n [What the German Wikipedia entry says](http://web.archive.org/web/20150123220403/http:/de.wikipedia.org/wiki/Scharfes_s)\n\n"
    },
    {
      "time": "30 Oct 2005 — 9:50am",
      "content": "\\> the German typefounders may have sized the type on their body a bit differently\n\nIn fact most <cite>all-caps</cite> (AKA \"Titling\") metal fonts, whether made in Germany or virtually anywhere else, used up the entire em height (for sensical reasons). The one decidedly German difference in vertical proportions has to do with the descender length.\n\n\\> “MAßNAHME” ... makes me cringe the same  \n\\> way that fake small caps or wrong quotes do.\n\nThe former is certainly much worse, come on.\n\nhhp\n\n"
    },
    {
      "time": "30 Oct 2005 — 9:52am",
      "content": "\\>there is no cap German double-S.\n\nThere was a thread about this on Typophile last year, but I can't find it.  \nIt seemed to me that there was a convincing argument for a cap double-S, for words where three S's appear in succession. Besides, in the sample shown, the typographic design problem had been solved, and the novelty value was marvellous.\n\nThere was once no English double-U.\n\n"
    },
    {
      "time": "30 Oct 2005 — 9:56am",
      "content": "I wouldn't mind seeing a cap SS, although I admit  \nnot having put very much thought into it (yet).\n\n\\> the typographic design problem had been solved\n\nTo me only the A-umlaut is OK.  \nThe U-umlaut is particularly distracting.\n\nhhp\n\n"
    },
    {
      "time": "30 Oct 2005 — 10:05am",
      "content": "The reason that German can now set three s's in a row has to do with the new writing rules that were completed (sort of) in 1998, and which went into effect (sort of) in August.\n\nAlthough I like many of the reforms, they are almost all contoversial. And I suspect that many of them will change. Three letters in a row does not make linguistic sense, even in German. \"Schlossstrasse\" (Castle Street) may be the proper way to type today,\\* but that doesn't mean that it is good. Making a capital double-S in my opinion would just be a cop-out way of standardizing too many other peoples' mistakes. I'm sorry if I sound a bit harsh here, but I really dislike this whole capital double-S idea, and I applaud the Unicode Consortium for pointing out that it has no sufficient base in German language, history, or tradition.\n\n\\*In the past, Schlossstrasse would have been spelled Schlosstrasse, Schloßstraße, or even Schloszstrasze. Today, a sensitive typographer would put in a space between those two words—which is fully within his right as a designer—and set it as two words: Schloss Strasse (or Schloss Straße… or even Schloss Str.).\n\nGosh, this gets me boiling… sorry :(\n\n"
    },
    {
      "time": "30 Oct 2005 — 10:37am",
      "content": "\\> does not make linguistic sense\n\nI don't think you mean \"linguistic\", do you? One could argue that it's visually bad (both for Display and Text, although in different ways), but by the same argument so are <cite>doubled</cite> letters! My attraction to ligatures is known, and I think doubles should be the first thing we fix.\n\nhhp\n\n"
    },
    {
      "time": "30 Oct 2005 — 7:22pm",
      "content": "Dan Reynolds writes:  \n\\> Tim, I’m going to say that you can probably go  \n\\> ahead on this one.\n\nReally? On what basis?\n\n\\> only two groups could possibly have rights to  \n\\> the face—Chappell’s or Eichenauer’s descendants.  \n\\> This is unlikely\n\nWhy are you saying that this is unlikely?\n\n\\> but most likely no protection on its design.\n\nNo, no, no, no. Even though the \\*U.S.\\* copyright office does not consider typeface designs to be copyrightable does not mean that typeface designs are not protected by other legislations. Many European legal systems have copyright protections that do not exclude typeface designs, i.e. in most cases typeface designs are copyrighted by law. In general, copyright protects works 70 years after the author's death. Chappell died in 1991, for God's sake! Of course it is unlikely that somebody will actually file a lawsuit if you do the digital version of the font (because it's an expensive undertaking), but this does not mean that such doing is legal.\n\nIn addition, there are professional ethical standards that should be followed. In the 20th century, companies have been pirating designs from each other, but these were different times and different technologies. This does not mean that such poor ethics should be continued in this century. I strongly believe that the ethical standards of this profession should be \\*no lesser than\\* the legal standards. That means that typefaces designed by people who died 70 years ago or later should not be released without a license from the descendants.\n\nIf a previously unknown book by Raymond Chandler is discovered today, does it mean that anybody can publish it only because the author died in 1959? Most certainly not, and this also includes translations into other languages (something that can be seen as an analogy to typeface digitizations). Why should it be different with typefaces?\n\nThough I realize that you are speaking on your own behalf Dan, it is surprising to me that a person working for Linotype, \"The home of the originals\", presents such disturbingly \"relaxed\" views. Hermann Zapf designed Palatino in the 1950s, roughly at the same time as Warren Chappell did Eichenauer. Are you suggesting that it is ethically OK for \\*anybody\\* to publish a digitization of Palatino (under a different name perhaps)? Or is the difference that Mr Zapf is alive and can defend his rights, while Mr Chappell cannot?\n\nNick Shinn writes:  \n\\> Love those umlauts.\n\nNote however that the umlauts are viewed as \"antiquated\" by today's German readers. So it would be unwise to put them as default forms for the German language. I think what you could and should do, however, is map them as titling and stylistic alternates. I suggest mapping them to several features: \"titl\", \"salt\" and \"ss01\". Give the glyphs meaningful names by adding a suffix to the basename. When picking the right suffix, I recommend using OpenType Layout feature name tag that you think best represents the nature of the glyphs.\n\nIf you agree that the primary role of these glyphs is \"titling alternates\", I suggest using the suffix \"titl\" (like the analogical feature name). So, the glyph names would be \"Adieresis.titl\", \"Odieresis.titl\", \"Udieresis.titl\".\n\nThe code would be:\n\nfeature titl {  \n lookup titl\\_dieresis {  \n sub Adieresis by Adieresis.titl;  \n sub Odieresis by Odieresis.titl;  \n sub Udieresis by Udieresis.titl;  \n } titl\\_dieresis;  \n} titl;\n\nfeature ss01 {  \n lookup titl\\_dieresis;  \n} ss01;\n\nfeature salt {  \n lookup titl\\_dieresis;  \n} salt;\n\nNote that in the example above, the subsequent features (ss01, salt) refer to a lookup defined previously in the titl feature. You can do such things whenever you need to perform the same lookup in several features. Just define your lookup in the first occurance, and refer to its name in subsequent occurancies.\n\nAs for ligatures \"ch\" and \"tz\", they should be placed in the \"dlig\" feature (discretionary ligatures) and perhaps \"hlig\" as well (historical ligatures), but not \"liga\" (standard ligatures). The practice of setting German digraphs tighter (ch, ck, st, tz etc.) has been phased out in German typesetting some 20-30 years ago. You are right Nick that setting these ligatures requires linguistic sensitivity for compound words so the ligatures need to be activated by the user's discretion -- unless one wants to implement an entire German spelling dictionary inside of an OpenType font.\n\nHrant writes:  \n\\> Sure, except language tags are yet to be supported\n\nWhich does not mean that OpenType fonts that are released today should not use them. While I said that it would be unwise to use a language-specific \"locl\" feature in this particular case, it still makes sense to define it in other cases where a different glyph than the default one is the preferred form for a particular language.\n\nNick also writes:  \n\\> There was once no English double-U.\n\nI'm with you on this Nick. The capital double-S is a patch but not a real solution.\n\nDan Reynolds writes:  \n\\> Three letters in a row does not make linguistic sense, even in German.\n\nYou are very wrong on this Dan.\n\n\\> “Schlossstrasse” (Castle Street) may be the proper way to type today,\n\nIt is \\*not\\* the proper way to type today. \"Schlossstraße\" is the proper way to type today.\n\nIn fact, the new ß-ss rule introduced in the recent spelling reform is one of the few VERY logical changes. In German, there are two vowel lengths: short and long. While in Czech the long vowels are marked by placing an acute over the vowel letter and in Finnish they are marked by just doubling the vowel letter, the Germans chose a slightly awkward system: to mark the short vowel by doubling the following consonant letter.\n\nThe system works like this -- in a simplified manner:\n\n1. \"mott\", \"motte\": a double consonant letter always means that the preceding single vowel is short;  \n2. \"moht\", \"mohte\": a \"h\" following a vowel letter always means that the preceding single vowel is long;  \n3. \"mote\": a single consonant letter followed by another vowel within the same stem always means that the preceding single vowel is long  \n4. \"mot\": a single consonant letter at the end of a stem or followed by a different consonant means that the preceding single vowel is likely to be long but it can also be short.\n\nIt's similar in English but it's more consequently implemented in German. In the last case, whenever you see a single consonant, it is a strong indication that the vowel is long, although e.g. \"Kap\" is pronounced with a short [a]. Yet for sure, \"Kape\" would have a long [a:] (as if it were \"Kahpe\") and \"Kappe\" would have a short [a]. As I said, it's not 100% logical but it is pretty logical.\n\nWhile the principle used to work very well with most consonants, the \"s\" posed a problem in the old spelling. While the letter \"s\" always means \"a single consonant letter\" (in the terms of the rules outlined above), and the letters \"ss\" always mean \"a double consonant letter\", the letter \"ß\" used to be ambiguous. Though historically a ligature of two \"s\"-es, it used to stand for \"a signle consonant letter\" or \"a double consonant letter\" in various cases. In other words, whenever you saw a \"ß\" in the text, you had no idea whether the preceding vowel should be pronounced long or short unless you memorized the actual word's pronounciation. The mispronounciation of vowels followed by an \"s\" or \"ß\" used to be the most common mistake made by foreigners learning German (and I know hundreds of them), and it used to pose the biggest problem for myself as well.\n\nSo it used to be that in \"Floß\" the [o:] was long but in \"Fluß\" the [u] was short, in \"Gruß\" the [u:] was long but in \"Muß\" the [u] was short. The recent German spelling reform greatly simplified this: in all cases where \"ß\" followed a short vowel, it was replaced by \"ss\". This means that \"ß\" now always represents \"a single consonant letter\" -- which is good because graphically, it is \\*one\\* letter.\n\nTherefore, the former \"Floß\" is written \"Floß\" (and pronounced \"[flo:s]), but the former \"Fluß\" is written \"Fluss\" (and pronounced [flus]). The former \"Gruß\" is written \"Gruß\" (and pronounced [flu:s]) but the former \"Muß\" is written \"Muss\" (and pronounced [mus]). (Of course, German \"u\" is always an [u] sound, short or long, and never a [yu] or [a] or whatever). In other words: whenever you see a \"ss\", you can be \\*sure\\* that the preceding vowel is short, while whenever you see \"ß\", you can be \\*sure\\* that the preceding vowel is long. Since the \"castle street\" is made out of two words: \"Schloss\" (with a short [o]) and \"Straße\" (with a long [a:]), it is written \"Schlossstraße\" and not \"Schlossstrasse\" as Dan suggests. \"Schlossstrasse\" would be pronounced with a short [a].\n\n\\> Today, a sensitive typographer would put in a space between those two words—which is  \n\\> fully within his right as a designer—and set it as two words: Schloss Strasse  \n\\> (or Schloss Straße… or even Schloss Str.).\n\nThis is complete humbug Dan, you should get back to learning German. Compound words are still written as compound words. In some cases, you might put a \\*hyphen\\* between the two (Schloss-Straße) but you never write a noun preceded by a noun in apposition as two separate words.\n\nOK, now let's get to the \"triple consonants problem\". Let's look at an example where a compound word is made out of two words in which the first word ends with a double consonant and the second word starts with an identical single consonant. E.g. \"ship ride\" in German would be a compound word made of the word \"Schiff\" (ship, [shif]) and \"Fahrt\" (ride, [fa:rt]). In old spelling, in the compound word one of the three identical consecutive consonants had to disappear. So when you add \"Schiff\"+\"fahrt\", you had to write \"Schiffahrt\" instead of \"Schifffahrt\".\n\nBut given the principles I outlined above, this was confusing. When you pronounce \"Schifffahrt\", you need to pronounce a short \"i\" followed by two phonetically distinct \"f\" sounds: [shif-fa:rt]. But when you look at the word \"Schiffahrt\", you might either mispronounce it as [shi:f-fa:rt] or, even worse, [shif-a:rt]. Because one \"f\" was missing. In the new spelling, this situation is simplified: the third consonant letter does not disappear anymore, so \"Schiff\"+\"fahrt\" = \"Schifffahrt\".\n\nWe're slowly approaching the \"capital ß problem\". As I explained above, the [o:] in \"Floß\" is long but the [u] in \"Fluss\" is short, the [u] in \"Muss\" is short and the [u:] in \"Gruß\" is long. That's logical and evident. But this handy distinction is lost when we see it in all-caps: \"FLOSS\", \"FLUSS\", \"MUSS\", \"GRUSS\". This spelling suggests that all the vowels in these words are short. Of course, it's mostly possible to deduct the correct pronounciation since you usually know the mixed-case spelling. But what about people's names? \"Hosskammer\" is [hoskamer] and \"Hoßkammer\" is [ho:skamer]. But in all-caps, you only see \"HOSSKAMMER\". You not only don't know what the correct pronounciation of the name is, you also don't know if it's \"Hosskammer\" or \"Hoßkammer\" in mixed-case writing. Since much of lettering on grave stones is all-uppercase, this presents a typical problem.\n\nThe German reader knows that \"ß\" is a single letter which is different from the single letter \"s\" and from the double letter \"ss\". The letter \"ß\" is not interchangable with the others, performs different functions. With the new spelling, the use of \"ß\" has been made even more clear and consistent.\n\nSome might say that the uppercase writing of \"ß\" is two uppercase letters \"S\", i.e. \"SS\". I believe this is an inadequate depiction of the issue. The fact is that the uppercase letter \"ß\" currently looks like two letters \"S\". Although not present in the Unicode Standard, I like to think of it as a functionally separate letter that happens to share the form with the uppercase depiction of \"ss\".\n\nThe problem of writing \"RUßPARTIKEL\" is not that the uppercase form of \"ß\" must look like \"SS\". No. The problem of such writing is that people put a lowercase letter in the middle of an all-uppercase text. Because \"ß\" is a lowercase letter. The uppercase form of \"ß\" may in most cases look like \"SS\" but...\n\nYes, then comes the \"but\". I don't see why a type designer should not distinguish the uppercase form of \"ß\" from two subsequent uppercase forms of \"s\". In most cases they may look like \"SS\" but a type designer could intelligently and carefully design forms that add some differentiation.\n\nThe letter \"ß\" has grown historically out of a ligature of the long \"s\" (which looked like an f without the bar\\*) and the short, final \"s\" (which looked like a small version of the uppercase \"S\"). The long-s form is gone now, and there never was a distinct uppercase form of the long-s. Therefore, I believe that deriving the uppercase form of \"ß\" from the lowercase form is wrong and will not find acceptance among readers. I think the solution should be sought in forms that involve the ligation of two uppercase \"S\" letters, employ diacritic characters, or both.\n\n\\*) In fact, it's the other way around. The letter \"f\" is a long-s with bar.\n\n'nuff for today. I'm on a modem connection and need to log out!\n\nAdam\n\n"
    },
    {
      "time": "30 Oct 2005 — 7:45pm",
      "content": "I wrote:  \n\\> The former “Gruß” is written “Gruß” (and pronounced [flu:s])\n\nOf course, it's pronounced [gru:s], not [flu:s] :)\n\nA.\n\n"
    },
    {
      "time": "30 Oct 2005 — 8:51pm",
      "content": "\\> Or is the difference that Mr Zapf is alive and  \n\\> can defend his rights, while Mr Chappell cannot?\n\nSadly, this is in fact a \"standard\" protocol.\n\n\\> I’m on a modem connection and need to log out!\n\n?  \nThis, after writing your longest post in recent memory?! :-)\n\n--\n\nSo, non-standard, non-shmandard, let's see  \nsome competent structures for a cap \"SS\".\n\nhhp\n\n"
    },
    {
      "time": "30 Oct 2005 — 9:37pm",
      "content": "Thank you, Adam.\n\n"
    },
    {
      "time": "30 Oct 2005 — 9:42pm",
      "content": "Great info Adam, which I will make use of. Thanks!  \n\\*\\*\\*  \nOn a related note, I used the german double-s in my unicase type, Panoptica, where it joined other lower-case forms (a, e, m, n, y) amongst predominantly upper- and common-case forms.\n\n"
    },
    {
      "time": "30 Oct 2005 — 10:24pm",
      "content": "_Many European legal systems have copyright protections that do not exclude typeface designs, i.e. in most cases typeface designs are copyrighted by law. In general, copyright protects works 70 years after the author’s death._\n\nAdam, I do have a question for you here. What copyright statutes apply to typeface designs in Europe, other than the German design patent? Isn't the German design patent only valid for 25 years after registration? And shouldn't registration occur within 6 months of publishing?\n\nIf typeface designs (not the code underneath) can be copyrighted for 70 years after their author's death, I'd be delighted. Please enlighten me further!\n\nOf course, unpublished work (like this typeface in question?) is just as copyrightable as published work. But is it likely that anyone ever registered this typeface with any authorities? Can registration occur after death? If no such registration ever took place, can it have any legal protection? Consulting living designers or their descendants is always the ethical thing to do. But I would like to know the legal details, as law and ethics do not always overlap, no?\n\n"
    },
    {
      "time": "30 Oct 2005 — 11:02pm",
      "content": "Dan,\n\nIn the European Union, copyright is an unregistered right (unlike patents, registered designs or trade marks). Copyright comes into effect immediately, as soon as something that can be protected is created and fixed in some way, e.g. on paper, on film, via sound recording, as an electronic record on the internet etc.\n\nAs you can draw from the UK Patent Office's description ( [http://www.patent.gov.uk/copy/definition.htm](http://web.archive.org/web/20150123220403/http:/www.patent.gov.uk/copy/definition.htm \"http://www.patent.gov.uk/copy/definition.htm\") ), copyrightable works include original artistic works (paintings, engravings, photographs, sculptures, collages, works of architecture, technical drawings, diagrams, maps, logos), published editions of works (the typographical arrangement of a publication) and other expressions of human creativity.\n\nIn order to to get copyright protection, a work needs to be the result of independent intellectual effort. The UK Patent office gives the example: technical descriptions, catalogues and engineering drawings are all examples of material that qualifies for copyright protection, whatever the subject matter. Previously in some legislations, the material needed to have novelty or aesthetic value but this is no longer the case. So altogether, copyright -- at least in the European Union -- offers broad non-bureaucratic protection for all sorts of intellectual efforts.\n\nCopyright does not enumerate the kinds of works in any way. Since this does not \\*exclude\\* typeface designs in anyway, it includes them. There is no need for any special legislation that offers explicit protection for typeface designs, just like there is no special legislation that explicitly protects literary translations, web graphics or photographic collages.\n\nIn Germany, the situation is a bit peculiar since there is the \"Schriftzeichengesetz\" (\"typeface law\") which offers explicit specific \"industrial\" type of protection for typeface designs. I have spoken to lawyers who explained to me that this law, however, does not automatically exclude typeface designs from general copyright protection but instead, offers additional explicit protection -- which, as such, requires fees and registration. International copyright treaties, esp. the Berne convention, rule that when a work gains copyright protection in one country, the same protection must be awarded in other countries as well that are sides of the treaty.\n\nSince there is no reason why copyright should not protect typeface designs in the UK, Spain, France or Poland, according to the Berne convention these designs are also copyrighted in Germany -- despite the existence of the Schriftzeichengesetz.\n\nThe Schriftzeichengesetz was a by-product of the Vienna convention that was an effort of ATypI and WIPO in the 1970s. Since the copyright protection was pretty weak back then, ATypI pushed for special legislation. The convention was signed but never went into effect because only two countries ratified it. Germany was the only country that actually implemented the convention in form of the Schriftzeichengesetz.\n\nOf course, as with any work, the issue whether a \\*particular work\\* is copyrightable can be definitely answered only in court, if one side of a conflict claims that a material is copyrighted and the other side challenges that by claiming that the work does not fulfil the criteria of copyright protection (e.g. it's not a result of an individual intellectual effort).\n\nI'm not aware of any court decisions in Europe that would declare that typeface designs are not copyrightable (it's different in the U.S.). On the other hand, I know of court trials in Poland that ruled that typeface designs have explicit copyright protection.\n\nThe issue of the digital font code is completely different. Fonts are protected in the U.S. as software programs, and in other legislations either as software programs or databases. In some countries, databases have a special legal protection while in others they're protected by general copyright.\n\nAltogether, both typeface designs and digital fonts enjoy automatic free protection in EU countries. While typeface designs may not have protection in the U.S., one can always sue a distributor in a certain country where the protection applies. As a result, for example, pirated typeface designs can be banned from sales in the European Union while it will be still possible to sell them in the U.S.\n\nBut as I said, in general, typeface designs \\*are\\* protected by copyright.\n\nBest,  \nAdam\n\n"
    },
    {
      "time": "30 Oct 2005 — 11:12pm",
      "content": "Dan,\n\nI just remembered that 4 years ago, Linotype won a case in the UK against GST, a publishing company. GST were selling fonts produced by Brendel that included rip-off designs of many Linotype faces (the digital fonts were not produced from Linotype data though.) Based on the UK copyright law, the court found that the \\*designs\\* sold by GST infringed Linotype's rights:  \n [http://www.linotype.com/13762/19\\_09\\_01-doc.html](http://web.archive.org/web/20150123220403/http:/www.linotype.com/13762/19_09_01-doc.html \"http://www.linotype.com/13762/19\\_09\\_01-doc.html\")\n\nAdam\n\n"
    },
    {
      "time": "31 Oct 2005 — 12:58am",
      "content": "Exactly, Adam. But none of these fonts were older than 25 (Neue Helvetica was from the 1980s, Arcadia, Herculanum, and Duc de Berry are c. 1990). I know that this protection exists, but I don't know what additional protections exist—it would great to be able to point to another European statute and say, \"see, typeface designs are explicitly mentioned,\" because in the US, they are explicitly not eligible (except in rare circumstances, I guess). Can you help me?\n\n_On the other hand, I know of court trials in Poland that ruled that typeface designs have explicit copyright protection._\n\nGreat!\n\n"
    },
    {
      "time": "31 Oct 2005 — 2:41am",
      "content": "Dan,\n\nthe thing with copyright is that you cannot make a generalized statement \"copyright protects typeface designs\" just like you cannot say \"copyright protects music\". Music, literary works or graphic creations -- including typeface designs -- are protected by copyright as long as they fulfil the criteria: individuality and originality. This is not a simple question -- many Ph.D. theses have been written on copyrightability criteria. The bottom line is: whenever there is a conflict, a court must decide in an individual case whether something is or is not protected. This is as true for typeface designs as for musical pieces.\n\nThe U.S. law works completely different from European law so forget about any comparisons :)\n\nBest,  \nAdam\n\n"
    },
    {
      "time": "31 Oct 2005 — 2:49am",
      "content": "Tim: Gustav Eichenauer never worked for Stempel. Chappell's Eichenauer design was never produced. The image you posted from Chappell's book is the only image of it my \"Stempel source\" has ever seen. (He said it reminded him of Weiss Antiqua…).\n\nFurthermore, I have heard from my source that Chappell was sort of a consultant to D. Stempel AG for about three years during the 1950s. But aside from a few typefaces that were later converted to Linotype use, the relationship did not seem to be so fruitful.\n\nSo, Eichenauer does not seem to be a Stempel design. This means that you should follow personal tracks now rather than foundry tracks. Adam offers valid ethical input above.\n\nI'm sure that you should be able to track down Chappell's heirs. I don't know about them, personally. House Industries, with their Neutraface types, have set an excellent example for how a foundry can market a deceased designer's work. They licensed the Neutra name from his family. Maybe something similar could be done here?\n\nGustav Eichenauer was very old already by the 1950s. He lost a son during WWII. I don't have any more personal info on him, but I suspect that any copyright on the face was probably kept by Chappell anyway, since the type was never produced or published.\n\n(Is this sufficient enough feedback, Adam? Would you recommend further ethical steps, or discourage pursuing this design althogether?)\n\n"
    },
    {
      "time": "31 Oct 2005 — 3:47am",
      "content": "I definitely would not discourage pursuing the design -- on the contrary! I would try to locate Warren Chappell's heirs and offer them a percentage of the potential revenue from the font. It would be an appropriate way to pay tribute to Mr Chappell.\n\nWarren Chappell's \"A Short History of the Printed Word\", was published by Hartley & Marks ( [http://www.hartleyandmarks.com/order\\_info.htm](http://web.archive.org/web/20150123220403/http:/www.hartleyandmarks.com/order_info.htm \"http://www.hartleyandmarks.com/order\\_info.htm\") ) and I imagine that the publishing house has an address to which they are sending the checks. So tracking the appropriate person should actually be rather easy -- just give Hartley & Marks a call.\n\nRegards,  \nAdam\n\n"
    },
    {
      "time": "31 Oct 2005 — 6:20am",
      "content": "Wow! Thanks for the wealth of information and ideas, Adam, Dan and everyone else.\n\nI have already emailed Hartley & Marks, who published the updated edition. I also discovered a collection of Alfred A. Knopf records at the University of Texas in Austin ( [http://www.hrc.utexas.edu/research/fa/knopf.html](http://web.archive.org/web/20150123220403/http:/www.hrc.utexas.edu/research/fa/knopf.html)). Since Knopf was the original publisher (and Chappell designed many books for them), there may be some good material here. I wonder if I should also try to contact Robert Bringhurst, who did the Hartley & Marks edition.\n\nI have wanted to do this font for years, actually, and am now very determined to pursue it. I will post updates on my progress.\n\n"
    },
    {
      "time": "31 Oct 2005 — 8:26am",
      "content": "Another language-specific \"Titling Alternates\" feature:\n\nCapitals without accents.\n\nThis would be useful for all-cap display settings where they tend to get in the way. I believe that this is a style used in many languages, including French and Greek.\n\n(Of course, the characters already exist in the font, but what the feature would do is enable typographers to use copy keyed with accented characters, and not have to re-key it to get the effect.)\n\n"
    },
    {
      "time": "31 Oct 2005 — 8:36am",
      "content": "Actually, in most languages with accented caps it's incorrect to omit them\\*. Including French. And including Canadian French, I presume. I mean, sure us type designers need to serve the user's needs, but when a certain class of user wants something dumb I think it's better to spend the effort on something besides encouraging linguistic impoverishment.\n\n\\* The reason it has happened has to do merely with saving money.\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 8:47am",
      "content": "_Actually, in most languages with accented caps, it’s incorrect to omit them. Including French. And including Canadian French, I presume._\n\nCorrect. A lot of French people will tell you that they don't use accents in all-caps, but this is a remnant practice dating from typewriters that didn't have keys for uppercase accents. In quality French publishing, caps have always had their accents.\n\nGreek is a different matter, and all accents except the dialytika a correctly dropped in all-caps settings. Since this involves some contextual funkiness, I recommend using the feature for Greek all-caps and smallcaps accent handling. If users do decide that they want the accents on the caps, they can turn off the feature.\n\n"
    },
    {
      "time": "31 Oct 2005 — 9:30am",
      "content": "\\> In quality French publishing, caps have always had their accents.\n\nParis Match magazine (a quality French publication) in the 1960s had an interesting approach to accents in all cap setting. The face was Didot, and acute, grave, and circumflex were all represented by a horizontal line (same weight as the hairline) tightly above the letter. This was obviously not \"dumb\", but a carefully considered piece of typography.\n\n"
    },
    {
      "time": "31 Oct 2005 — 9:46am",
      "content": "The shape of accents is a visual/typographic choice, while the <cite>omission</cite> of them is more of a linguistic error - so not the same thing.\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 10:11am",
      "content": "\\>this is a remnant practice dating from typewriters that didn’t have keys for uppercase accents\n\nYes, certainly there are issues of technology and expediency invloved in accent-dropping.  \nBut it is also true that there are typographic reasons. In all cap settings, accents are visually over-obtrusive, and get in the way in many kinds of layout.\n\nI think the Greeks have it right: you don't need accents in all cap setting, because if the reader requires legibility help, the setting should be in U&lc anyway. It seems to me that the retention of accents in all-caps that one finds in practice (eg Canadian French) is the work of attentive editors: I applaud them for their attention to detail, but would suggest that the rules may be eased in certain layout circumstances.\n\n"
    },
    {
      "time": "31 Oct 2005 — 10:24am",
      "content": "There certainly is room for \"creative spelling\" in any script, for various reasons (and not all of them merely visual). As long as one knows what rules one is breaking, instead of pretending there are no rules because one thinks it's pretty.\n\nAlso, in the case of the scan Tim showed, I would say that making the umlauts tuck in should preferably have been accompanied by the \"Q\" and \"J\" not having descenders. (Which reinforces the point that that at least was a technological issue much more than an aesthetic one.)\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 11:01am",
      "content": "\\>the “Q” and “J” not having descenders.\n\nGood point. That's particularly useful for drop caps.\n\n"
    },
    {
      "time": "31 Oct 2005 — 8:25pm",
      "content": "I imagine that [Hartley & Marks] has an address to which they are sending the checks\n\nHa ha ha ha ha ha ha ha ha ha hahhhh...\n\n-marian\n\n"
    },
    {
      "time": "1 Nov 2005 — 7:31am",
      "content": "Hmmm.... Maybe a stylistic set for drop cap alternates?\n\n"
    },
    {
      "time": "1 Nov 2005 — 10:36am",
      "content": "I have just learned from an executive at Hartley & Marks that they have no information or material to help me. He also is fairly certain that Lydia Chappell (Warren's wife) is \"in a state of dementia\" or dead. Sad news.\n\nSo now I have e-mailed Knopf, and I am looking into the special collection of Knopf materials at the University of Texas in Austin.\n\n"
    },
    {
      "time": "2 Nov 2005 — 12:21am",
      "content": "_This was obviously not “dumb”, but a carefully considered piece of typography._\n\nAffectation is the word I would have used. By 'quality French publishing', I meant book publishers, generally following the typographic norms promulgated by the Imprimerie nationale.\n\n"
    },
    {
      "time": "2 Nov 2005 — 7:50am",
      "content": "I wouldn't call it an affectation.  \nIts raison d'etre derives from the requirements of the typographic layout, not from a linguistic authority.  \nWhile it's true that commercial forces are apt to occasionally run roughshod over \"proper\" orthography, the converse of this is a streak of snobbery towards \"trade\" amongst the academic preservers of the flame. It's been that way from Hansard to Updike to Kinross.  \nHistory decides which \"affectations\" become adopted as part of the canon.\n\n"
    },
    {
      "time": "2 Nov 2005 — 7:56am",
      "content": "\\> the converse of this is ...\n\nNot necessarily. Although I think you've nailed the two main schools quite well, there is in fact (at least) a third way, which I myself follow: avoid artistic affectation, but treat authority with healthy disrespect; I feel this allows one to help other people mark real progress. In effect, the two main schools are both superficial, self-serving and cozy, while I think we can aim for a deeper harmony in the things we make to serve others.\n\nhhp\n\n"
    },
    {
      "time": "2 Nov 2005 — 10:12am",
      "content": "_History decides which “affectations” become adopted as part of the canon._\n\nI have a collection of grammars for various languages, many of them dating from the 16th-18th century, and I'd be inclined to argue, based on their content, that most decisions about orthographic practice have been made by grammarians, not by typographers. On the subject of Greek accents, which we have touched on here and spoken of at greater length elsewhere, you will find entire volumes devoted to nothing but their correct placement.\n\nWhen a magazine art director decides that 'the requirements of the typographic layout' demand possible ambiguation of text, it seems to me that his is looking at the whole thing backwards. Since when has typographic layout involved 'requirements' that override the integrity of the text? I don't think there are any such requirements, and if one creates such requirements in a layout then it isn't a very good piece of design, no matter how lovely it might look. If you have to abuse the text in order to typeset it, there is a problem.\n\nBut let's assume for a moment that your dictum is correct. It seems to me that history has plainly not accepted as canonical the typographic affectation of Paris Match in the 1960s. No one does this now, and I doubt if anyone else did it then: it was and remains idiosyncratic and hence, I argue, an affectation.\n\n"
    },
    {
      "time": "2 Nov 2005 — 10:34am",
      "content": "\\> it isn’t a very good piece of design, no matter how lovely it might look.\n\nExactly.\n\nhhp\n\n"
    },
    {
      "time": "2 Nov 2005 — 10:47am",
      "content": "\\>possible ambiguation of text\n\nWe're talking about a few words in a headline.  \nMissing accents isn't going to befuddle the readers.\n\n\\>affectation\n\nYes, it is an affectation, but you had used that word in contrast to \"carefully considered piece of typography\". On reflection, it is both.\n\nAs to whether history is made by grammarians or typographers, the face-off that comes to mind is the competition for the best reformed Polish accents that occurred in the 18th century (as recounted by Adam Twardoch). As I recall, the authorities asked a writer, a scientist, and a typographer to propose the best scheme, and the typographer won.\n\n"
    },
    {
      "time": "2 Nov 2005 — 10:52am",
      "content": "\\>it isn’t a very good piece of design, no matter how lovely it might look.\n\nYou theorists crack me up.  \nYou don't even have to see what something looks like, and on principle you know whether it's good or bad design?!\n\n"
    }
  ]
}
