{
  "id": "15919",
  "title": "For a novel",
  "forum": "Design",
  "tags": [

  ],
  "content": "I need to design a novel. It’s hardboiled detective fiction, contemporary, with a strong nostalgic tinge but not retro in way that’s arch or jokey. It is also a bit quirky, not straight-ahead tough guy standard fare. Literary. I want something strong and lean but with that hint of suppleness even whimsy. I am looking at Filosofia but see that people have their doubts about it as a text face, though using InDesign it looks pretty good.\n\n",
  "author": "<a href=\"user/9920\" title=\"View user profile.\">mbcohen</a>",
  "time": "<br>",
  "uid": "9920",
  "comments": [
    {
      "time": " 29 October, 2005 - 9:20am",
      "content": "Malachi,\n\nThis is not typeface recommendation, but have you seen Stephen King’s latest book? I love the retro feel of the cover! And this is also King’s first detective novel.\n\n ![](http://web.archive.org/files/0843955848.01._SCLZZZZZZZ_.jpeg)\n\n"
    },
    {
      "time": " 29 October, 2005 - 11:11am",
      "content": "I’m thinking a news face by Schwartz.\n\nhhp\n\n"
    },
    {
      "time": " 29 October, 2005 - 12:32pm",
      "content": "What about [Paperback](http://web.archive.org/web/20060507204116/http:/www.houseind.com/index.php?page=showfont&id=171&subpage=viewfontspecimens) ?\n\n"
    },
    {
      "time": " 29 October, 2005 - 10:15pm",
      "content": "I was looking at some news faces but they’re a bit sobersided. Paperback’s closer to what I had in mind, but I’m not sure if it works with my budget.\n\nThanks for the feedback, all. There are actually several pulp revival presses operating right now… one is even putting those great “mapback” covers on their paperbacks.\n\n"
    },
    {
      "time": " 30 October, 2005 - 9:53am",
      "content": "Something like Zocalo is much less “sober”  \nthan Paperback, which is extremely staid.\n\nhhp\n\n"
    },
    {
      "time": " 5 November, 2005 - 11:08pm",
      "content": "Just a personal take on this, but both Filosofia and Zocalo seem a little pinched to me for hard-boiled detective fiction. I think of that genre as looser than that, and I would look at wider faces with a smaller number of characters per pica. And I would stay away from faces that have a big thick/thin contrast (these hard-boiled guys are heavy, right?). Sorry I don’t have a specific suggestion (something like a Caslon maybe?).\n\n"
    }
  ]
}
