{
  "id": "15929",
  "title": "Unicase typeface (school project)",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hi,\n\nI am designing a unicase typeface for my Typography class. It is called ‘Cutting Edge’ for now—hopefully I'll come up with something less cheesy down the road.\n\nI was hoping to get some critique and feedback; general comments regarding aesthetics, which letters work and which don't, which of the two versions you prefer, and any other sage advice the type pros of this forum might have for me.\n\nVersion 1 has been built from two basic shapes, a square (denoting a “pixel”), and a triangle (“half a pixel”). Version 2 evolved from the first, with an additional rounded shape to smooth things out. Even though it shares certain characteristics with pixel fonts, they are both intended as display fonts (set at 24 points or larger). Mainly because there is no such thing as half a pixel but also because legibility suffers at small point sizes.\n\nThe spacing and kerning are arbitrary for now. Any comments are welcome.\n\nEdit: Attached pixel-version.pdf (November 13)\n\n| Attachment | Size |\n| --- | --- |\n| [type-sample.gif](http://web.archive.org/web/20150417125336/http:/typophile.com/files/type-sample.gif) | 23.6 KB |\n| [pixel-version.pdf](http://web.archive.org/web/20150417125336/http:/typophile.com/files/pixel-version.pdf) | 43.18 KB |\n\n",
  "author": "zalmoxe",
  "time": "30 Oct 2005 — 11:04am",
  "uid": "9340",
  "comments": [
    {
      "time": "30 Oct 2005 — 11:46am",
      "content": "\\> I am designing a unicase typeface for my Typography class.\n\nDid your teacher say why?\n\nhhp\n\n"
    },
    {
      "time": "30 Oct 2005 — 11:55am",
      "content": "Hi Hrant,\n\nDo you mean why a unicase as opposed to a upper/lower case typeface?\n\nI believe the main reason stated was because we have a pretty tight project deadline, and a dual-case would require exponentially more time to complete.\n\n"
    },
    {
      "time": "30 Oct 2005 — 12:56pm",
      "content": "Well, to me, if one is concerned about not wasting time, a unicase font is the last thing one should make! An all-caps assignment would have been much better. I'm bitching because I think unicase is generally an affectation; and in the context of teaching students, it might even confuse their necessary education about the difference between the two cases.\n\nhhp\n\n"
    },
    {
      "time": "30 Oct 2005 — 3:26pm",
      "content": "I see your point and agree with you to some extent. Though one could also argue that a unicase gives students the freedom to explore both cases of the alphabet in the pre-production process, rather than limit them to the upper case as you suggested.\n\nAnyhow, far be it for me to defend or contend the decisions of the faculty, I am just a student (who is looking for some feedback on his font =).\n\nThough personally I rather like unicase fonts. And, I may be going on a wild tangent here, but with the continued advancement of the internet and associated technologies (such as e-mail, forums, online games and chatrooms) in which words are rarely capitalized anymore (and even punctuation is often ignored) the stage seems to be perfectly set for a unicase revival! Or maybe just the elimination of the upper case, who knows.\n\n"
    },
    {
      "time": "30 Oct 2005 — 6:30pm",
      "content": "Certainly, no matter what I or you think, you're still stuck with doing this! :-)\n\n\\> the internet ... in which words are rarely capitalized anymore\n\nThat's a good point. And a good angle, for your design. So maybe make a unicase font that's screen-friendly; maybe a pixelfont and/or maybe monospaced (like Nick Shinn's Panoptica, one of the very few unicase fonts that I actually like).\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 8:11am",
      "content": "Thanks for the props, Hrant.\n\nI might be partly responsible for this, as Zal is in Toronto.  \nYes, time had something to do with it.  \nThere are so many things for a design student to learn these days, and the first year I taught Type 4 (type design+poster+animation) in the York/Sheridan B.Des (in Toronto) some students had difficulty finishing all the characters. I thought that making the font unicase would both cut down production time, and provide a valuable background -- both depth of historical evolution, and the full scope of alphabetic forms.\n\nIn fact, by doing a unicase project -- research and development -- students gain a good understanding of why the two cases are the way they are. And it really focuses them on approaching typeface from the point of view of structure and pure form rather than style.\n\n"
    },
    {
      "time": "31 Oct 2005 — 8:26am",
      "content": "\\> by doing a unicase project — research and development — students  \n\\> gain a good understanding of why the two cases are the way they are.\n\nThat seems to imply that unicase fonts are inherently intractable,  \nexcept for modish display work... With which I agree of course. :-)\n\nTo me, finishing a font is great, but since it's about education and  \nnot production, I think it's better to lay a more sensical foundation.\n\n\\> it really focuses them on approaching typeface from the  \n\\> point of view of structure and pure form rather than style.\n\nIt seems instead to subvert structure to style.  \nAnd to me pure form and style are really the same.\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 8:45am",
      "content": "Xal, please ignore Hrant. He is always trying to pick a fight with me.\n\nYour typeface looks great -- in alphabetic sequence.  \nBut it's hard to know how well a font works unless you see it at work in a layout.\n\n"
    },
    {
      "time": "31 Oct 2005 — 8:57am",
      "content": "Zal, please don't ignore Nick. He will be giving you a grade.  \n(And, to be fair, he makes nice display fonts.)\n\nI don't pick fights. I simply don't look the other way unless I owe the person something. What I do do is point out flaws, especially if it helps influentiable students see better. People, especially on Typophile, and especially students, persistently thank me for helping them. I don't know why one of your students who asks something on Typophile should be assumed to be unhelpable by me.\n\nUnicase fonts are one of the least useful things both to learners and users. It's beyond me how it can make sense to start a beginner on one, and it feels like I have no choice but to frantically wave the red flag.\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 9:22am",
      "content": "\\>He will be giving you a grade.\n\nI'm not teaching the course at the moment.\n\n\\>I don’t know why one of your students who asks something on Typophile should be assumed to be unhelpable by me.\n\nZal, Hrant Papazian is well known on the internet for his strong, frequent opinions and theories on typography. However, as with all internet experts, if you are to trust their opinions (rather than just be swayed by their arguments and polemic) you should also check out their credibility. Professionally speaking, a CV is a good place to start. For designers, you can ask \"do I like their work?\".\n\n"
    },
    {
      "time": "31 Oct 2005 — 9:28am",
      "content": "\\> internet expert\n\nWrong on both.\n\n\\> For designers, you can ask “do I like their work?”.\n\nNo, that's for artists.  \nFor designers, you should ask: do users find their work useful?\n\n(Poor Zal...)\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 9:40am",
      "content": "\\>No, that’s for artists.\n\nNo, if we're going to compare art with design, the relevant distinction is functionality (design) vs. meaning (art). Both art and design can be liked/disliked.\n\nOpinion is a personality thing, so what you feel about someone's work is a good way to see where they're coming from.\n\n"
    },
    {
      "time": "31 Oct 2005 — 9:44am",
      "content": "Art is not about meaning, it's about expression. Personal expression which is only certain to be relevant to the expressor, and not necessarily users.\n\n\\> what you feel about someone’s work is a  \n\\> good way to see where they’re coming from.\n\nOnly on the surface (towards Display). When it comes to Design (towards Text), feeling doesn't get you very far, and quite often will take you in a misguided direction. Feeling is certainly not unimportant in design, but demote thought/function, and you stray into selfish artistry.\n\nTo decide if a designer is useful or not, you have to think.\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 10:58am",
      "content": "I'm thinking, what has this guy done to be dissing my text faces and the course I helped design?\n\nWhat are his educational qualifications in art, design, linguistics or typography?  \nWhich companies has he worked for, learning the ropes?  \nWhat published research has he done at which institutions?  \nWho are his clients?  \nWhat fonts has his foundry published?\n\n"
    },
    {
      "time": "31 Oct 2005 — 11:18am",
      "content": "Since you've predetermined that I'm a clueless idiot who should be ignored by everybody concerning anything, the answers to those questions (most of which are known to people who matter to me, such as the Art Center College of Design) are likely to be abused by you. Your own degrees in Fine Fart mean virtually nothing to me - and I'm not alone; more important in Design are things like your apparent ignorance of the rules of French orthography concerning caps (which I corrected this morning), and your persistence in calling your daughter George (read: Eunoia-Text a text face).\n\nJust because I think you don't know what makes a text face (or what makes for good type education) doesn't justify the blinding rage of your bruised ego.\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 12:39pm",
      "content": "Hrant, it's not about me.  \nWhy don't you publish a professional CV?  \nOr is it a bit modest for a guy your age?\n\n\\>your apparent ignorance of the rules of French orthography concerning caps (which I corrected this morning)\n\nHrant, you are a little man who builds himself up by attacking people of real accomplishment and beating them in arguments by using slimeball ad hominen arguments, twisting their words.\n\nFor instance, you did not correct me on French orthography.  \nI said, in reference to accent-free all caps, and the provision of a \"titling alternates\" feature, that \"this is a style used in many languages\". I did not say it is the only style, which was apparent within the context of titling alternates, however, in order to puff yourself up, you say you have corrected me.\n\nWhy don't you get a real education, a real job, do some real research, or really publish some fonts?  \nWalk the talk, man. Really.\n\nSorry, Zal, I can't get this parasite off my back.  \nHowever, let's see your font in a text setting, and maybe we can discuss that and get this thread on a more pleasant tack.\n\n"
    },
    {
      "time": "31 Oct 2005 — 5:42pm",
      "content": "\\> Your typeface looks great — in alphabetic sequence.  \n\\> But it’s hard to know how well a font works unless  \n\\> you see it at work in a layout.\n\nThanks for the comments, Nick. I haven't finished working on the spacing and kerning yet, I will post a PDF with the font in a layout once that is done.\n\nAnd yep, this is for Type 4. I had no idea you were part of the faculty at York/Sheridan or that you designed the course. Incidentally, one of the fonts I chose to discuss during the research portion of the course was Panoptica. Small world!\n\n\\> maybe make a unicase font that’s screen-friendly;  \n\\> maybe a pixelfont and/or maybe monospaced\n\nThanks for the advice, hrant. In retrospect, a monospace font would've been a lot of fun. Unfortunately I don't think I can make it work at this point unless I re-create all the characters from scratch (which there isn't time for anymore). Screen-friendliness is lacking as well. I'll keep your suggestions in mind for a future typeface.\n\n"
    },
    {
      "time": "31 Oct 2005 — 8:08pm",
      "content": "\\> or that you designed the course.\n\nIt was mostly in place before I joined. Darren Wilson, Sandra Gabriele, and Zab Hobart all contributed at the early stage, as did David Scadding. And it continues to evolve. The unicase idea was mine, although it occurred during a planning meeting I had with Sandra and Zab at Zab's studio, so it was kind of a group idea. It's certainly produced some astonishing results.\n\nFunnily, after the unicase concept had been introduced, it occurred to me that I hadn't actually designed such a face myself. With that in the back of my mind, when Christian Bok asked me to recommend a monowidth typeface for setting his poem \"Diamonds\", I thought, hey, I could design one, and make it unicase too. Hence Panoptica.\n\nI'll keep an eye open for your PDF.\n\n"
    },
    {
      "time": "31 Oct 2005 — 9:05pm",
      "content": "\\> The unicase idea was mine  \n\\> I hadn’t actually designed such a face myself.\n\nIt was in fact clear to me in advance: the type students of Toronto owe the wonderful opportunity to throw off their grasp of the proper relationship of the Latin UC and lc to your long-time idol, Licko. It's quite ironic that you make better fonts than her, but you still look up to her; probably because she's more stylish than you, and that's your ultimate goal in [design] life.\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 9:37pm",
      "content": "It's not about me, Hrant.  \nWhen's the Micro Foundry going to publish that 2-point typeface?\n\n"
    },
    {
      "time": "31 Oct 2005 — 9:48pm",
      "content": "\\> It’s not about me, Hrant.\n\nPLEASE tell me you've adopted this mantra to replace the Emigre hogwash one.\n\n\\> When’s the Micro Foundry going to publish that 2-point typeface?\n\nUnfortunately, not nearly as soon as you publish your next 2-bit one.\n\nhhp\n\n"
    },
    {
      "time": "1 Nov 2005 — 8:12am",
      "content": "Building versus bantering...\n\nNick, I've seen your body of work. I've bought a chunk of it (Brown, Handsome Nib, Preface, Worldwide) and use it year 'round. I also appreciate your opinion more than others on this site, as it's often served with grace. You talk it...and you walk it. You're building, in more ways than one.\n\nHrant, I've been trolling this forum for a few years and it's clear that you enjoy banter over building. And banter would be the kindest description. Over time, I've made a point to ignore your posts more often than not, as they seem to be a platform for spewing academic babble. I've learned so much from the fine minds that populate this site. However, the knowledge you bring to the forum is heavily soaked in smugness and pretenstion. Put another way, I never get the impression that you offer your knowledge to help. Instead, you're just wanting to be heard.\n\nIf you can, Hrant, try to objectively hear the tone of your own voice in these forums. Ask — and be willing to listen to — how others perceive you. Until then, I'll continue to enjoy the Typophile veterans who are walking through, building up, and genuinely contributing to a community of folks interested in typography.\n\n"
    },
    {
      "time": "1 Nov 2005 — 10:09am",
      "content": "\\> I never get the impression that you offer your knowledge to help.\n\nWhile over the years maybe a hundred people have come forth, unprovoked, to tell me the opposite. Who is right? Are all those people idiots? Have I used my guile to manipulate people to listen to me? Ask yourself: do I tell people what they want to hear? Come on. Or maybe people like Nick are the ones with the golden tongue, effectively fabricating from their abilities in one area of design (display fonts, artistry, whatever) an apparent understanding in another area, which however they don't have? Each of us is good at different things. Nick is not my superset.\n\nOr maybe is it possible that individual differences make a person like somebody or not on a personal level, and thereby think he's wise or full of it? Is it a coincidence that the bulk of people who think I'm a clueless idiot also disagree with me on things outside type, notably politics?\\* Is it a coincidence that the bulk of these people are middle-aged Anglo males? I'm not necessarily saying there's anything wrong with that group - what I'm asking is that you open your eyes to how humans actually decide who to believe: based on emotion, more than logic - emotions deriving from their personal experience and circumstances, for which they -and certainly I- are largely not responsible. We are from different places, and that's not anybody's fault. THIS is the key to tolerance.\n\n\\* Are you the Randy who was a US Marine?\n\nTo understand [what you think of] other people, look inside. To grow, discipline yourself to ignore what you don't like about somebody, and take what's useful. That's what I do with Nick.\n\nhhp\n\n"
    },
    {
      "time": "1 Nov 2005 — 10:58am",
      "content": "\\> Have I used my guile to manipulate people to listen to me?\n\nI wouldn't call it guile, Hrant.\n\n\\> Ask yourself: do I tell people what they want to hear?\n\nI asked myself, and the answer was no. You're missing the point. The tone of the majority of your replies within this forum has this air of superiority. Smugness. But you can't see it. And when someone (me, Nick, whoever) calls you on it, you (predictably) make a long-winded reply. Long-winded, so what. The problem isn't being a windbag. That's a harmless trait, overall. It's the fact that you're soaked in superiority, and when that gets you cornered, you toss the post-modern rhetoric grenade. Handy!\n\nWalk vs. Talk? Point: Shinn\n\n"
    },
    {
      "time": "1 Nov 2005 — 11:03am",
      "content": "\\> To grow, discipline yourself to ignore what you don’t like about somebody, and take what’s useful. That’s what I do with Nick.\n\nAnd that's what I'm trying to do with you when I'm at Typophile. It's just so damn hard to step around your ego.\n\nBy the way, no, I'm not Randy the former Marine. I'm Dylan, the former Marine who didn't vote for Bush.\n\n"
    },
    {
      "time": "1 Nov 2005 — 11:12am",
      "content": "1) I'm sorry for the tone. I certainly don't feel superior <cite>overall</cite> (just in some areas, over some people; like in readability, over Nick), and I try to always point out that I have a lot to learn from everybody, including Nick - you think I wouldn't like to make display fonts as accomplished as his? Nick on the other hand equates me with a \"parasite\" who should be totally ignored - this in the face of a lot of evidence that many people think the opposite... I mean, what proportion of the type crowd does he think are idiots? But you don't mind Nick's vicious egotripping, because I think you feel a kinship with him (at least much more than you do with me). Ask yourself if you have your objectivity under control.  \n2) You're missing my main point.\n\nWalk the talk? Or is it pull the load? Different people like different things, Dylan. Some people are more into practice, others more into theory. The important thing is to not dismiss either outright - and I think you're doing that to theory. It's a classic battle, but the only way to grow is to realize you can't win/lose. Maybe that concept is alien to your upbringing - which would be, again, largely not your fault - but admitting a problem is the first step. This is not \"mumbo-jumbo\", it's life.\n\nAnd \"Dylan\", sorry. But you voted, right?\n\nhhp\n\n"
    },
    {
      "time": "1 Nov 2005 — 11:15am",
      "content": "Let me see, I'm a Green Party member, and marched against the Iraq invasion, so that must mean Hrant's one of them thar gas guzzling Republicans.\n\nBTW, I'm amazed at Hrant's condescending, advisory tone towards Dylan (reminds me of a similar experience). You dare to criticize Hrant? -- you must have a personality defect, try to grow!\n\n"
    },
    {
      "time": "1 Nov 2005 — 11:19am",
      "content": "Must there be only one reason to dislike me? You can't stand  \nme for a reason besides politics: I doubt you as an artist.\n\nhhp\n\n"
    },
    {
      "time": "1 Nov 2005 — 11:32am",
      "content": "\\> \"Different people like different things, Dylan. Some people are more into practice, others more into theory. The important thing is to not dismiss either outright - and I think you’re doing that to theory.\"\n\nI'll give you that. Point taken. Point: Hrant.\n\n\\> \"...but the only way to grow is to realize you can’t win/lose.\"\n\nAnother post-modern grenade, my friend. Easy to toss. Much more difficult to clean up the mess it makes. The concept of no win/no lose wasn't alien to my upbringing. However, I saw, firsthand and from both sides, that there are absolutes. People do win. And lose. Period. Growth comes from how you deal with an acknowledged win or a loss. (opens can of worms): I think the U.S. has become weaker because of post-modern thinking. Little League baseball that doesn't keep score, for example. Whaaa? You've got to be kidding me. Or Iraq... (worms spilling everywhere now). I think we \"win\" with money, not guts. What happens when the money runs out?\n\nAnd yes, I voted. And continue to vote with my wallet, all year long.\n\nCheers.\n\n"
    },
    {
      "time": "1 Nov 2005 — 12:41pm",
      "content": "\\> I think the U.S. has become weaker because of post-modern thinking.\n\nAgreed. But because of other things too. Anyway, it's a good thing you an I are powerless (at least I think so) which means we're less responsible for the mess. :-/\n\n\\> continue to vote with my wallet\n\nThat can be effective. But what about stuff that can't be bought - how do you encourage/discourage that? Maybe just by praising it, in public, often.\n\nhhp\n\n"
    },
    {
      "time": "2 Nov 2005 — 8:46pm",
      "content": "ooh, I feel so much more enlightened!  \nNow I do not know a whole lot about politics,but i like the unicase typeface,but the name could be better-maybe 'fired up theory buff'  \n.....could work...\n\n"
    },
    {
      "time": "3 Nov 2005 — 5:50am",
      "content": "Yeah, let's get back to the task at hand...\n\nZal:\n\nI dig unicase typefaces. So keep us posted on your progress.\n\n"
    },
    {
      "time": "13 Nov 2005 — 2:11pm",
      "content": "I attached a PDF of the font in a text setting to the original post (file name is pixel-version.pdf).\n\nLet me know what you think.\n\n"
    },
    {
      "time": "25 Nov 2005 — 5:20pm",
      "content": "Am I seriously going to have to be the [only] person to crit this?  \nSome people really feel zilch in the way of responsability I guess.\n\nhhp\n\n"
    },
    {
      "time": "26 Nov 2005 — 2:35am",
      "content": "I like it so far… the top serif on the C is really wicked.\n\nBut the \"flow\" of the face is off. Words like \"WILL\" and \"MAKE\" look ok, but because of your angle play, \"YOUR\" looks more like \"Y\" \"OUR\" and in \"BLEED\", only \"EED\" feel like one cohesive unit.\n\nMust a work be a cohesive unit? How do prefixes, suffixes, or German-like compound words play here? This leads into Hrant's Bouma theories I guess… nothing should incite him to comment more than Bouma term-dropping!\n\nDon't worry Hrant, more people'll post here ;-)\n\n"
    },
    {
      "time": "10 Dec 2005 — 11:42am",
      "content": "\\> I’ll keep an eye open for your PDF.\n\nYou were saying, Dan?\n\nhhp\n\n"
    },
    {
      "time": "10 Dec 2005 — 1:47pm",
      "content": "That \"one big diagonal slice\" element that is the premise of the face isn't quite fulfilled by K and X, letters which one would expect to feature them most.\n\n"
    },
    {
      "time": "9 Jul 2010 — 2:56am",
      "content": "How did I miss such an action packed thread back in the day? They don't make 'em like they used to, I tell ya. If you're a font historian, look no further: you've found the ultimate Hrant/Nick showdown thread.\n\n"
    }
  ]
}
