{
  "id": "15924",
  "title": "Client management",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi,\n\nI am looking for a design forum about “client management”. I read too many forums about formal aspect of design and how things should look. It’s often a good read, like many of the topics about typography on this forum. But being right or let’s say —educated— about design doesn’t mean that you can sell your “educated design” to your clients. I often find myself struggling to explain to my clients why I think their brochure should be designed one way instead of another.  \nAny suggestion?\n\nCheers\n\nSeb\n\n [‹ Fruitful Cyrillic Ambivalence](http://web.archive.org/web/20080906160702/http:/typophile.com/node/15996 \"Go to previous forum topic\") [Is God Dead? Is Type Dead? (top forty magazine covers survey) ›](http://web.archive.org/web/20080906160702/http:/typophile.com/node/15698 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906160702/http://typophile.com/user/8785\" title=\"View user profile.\">sebsan</a>",
  "time": "<br>",
  "uid": "8785",
  "comments": [
    {
      "time": " 30.Oct.2005 10.27am",
      "content": "Would you trust a plumber to repair your car’s brakes? Would you trust an auto repairman to remove your wisdom teeth? Would you trust a dentist to fly a 747? Professionals are professionals for a reason: they know their business and/or trade. So, why trust an accountant to design a brochure?\n\n"
    },
    {
      "time": " 30.Oct.2005 12.38pm",
      "content": "Hi Oldnick,\n\nI have the impression that you misunderstand my thread. I, as a graphic designer find it sometimes difficult to justify a design solution to my clients. I don’t beleive in telling them that they should trust me simply on the basis that I am graphic designer. That would not only be percieved as arrogant it’s also not true. My clients should trust me because I can demonstrate why my solutions are better than that of an accountant turned designer. This is the reality of our business today. The Design God may strike me for saying this but an accountant turned designer could actualy pull a convincing design and sell it better that I. Today anyone can put text on a page and trust InDesign to do the hard work for you. Technicaly that’s enough to convice a client to work with you. But what happens when the client wants the his logo pink because his wife likes pink. That’s a problem no plumber or a 747 pilot has to face in his job.\n\n"
    },
    {
      "time": " 31.Oct.2005 2.34am",
      "content": "I know your struggle...\n\nOften it comes down to trust. Does your client trust you to make the correct decisions about their company.  \nA good start is to read this excellent book: [http://www.amazon.com/exec/obidos/tg/detail/-/1581153244/qid=1130754455/...](http://web.archive.org/web/20080906160702/http:/www.amazon.com/exec/obidos/tg/detail/-/1581153244/qid=1130754455/sr=8-1/ref=sr_8_xs_ap_i1_xgl14/102-6575909-3256946?v=glance&s=books&n=507846 \"http://www.amazon.com/exec/obidos/tg/detail/-/1581153244/qid=1130754455/sr=8-1/ref=sr\\_8\\_xs\\_ap\\_i1\\_xgl14/102-6575909-3256946?v=glance&s=books&n=507846\")\n\nBasically it’s about turning the often subjective likes-not likes of design and make it objective. Begin with rough sketches, describing the different concepts, get a sign off and continue on in a step by step process...\n\nBack it up with research about the target group, the competitors etc. Then you can say he doesn’t want to have pink as his main competitor use pink and that he does not want to be mixed up...\n\nthen it’s not what you like, or what s/he likes but what s/es client needs.\n\nOf-course, there is always exceptions. But you can always ask in the very beginning if there is anything to avoid or embrace, designwise.\n\n/fredde\n\n"
    },
    {
      "time": " 1.Nov.2005 8.23am",
      "content": "Sebastien,\n\nIn regards to your search for Forums that address “client management” I have from time to time found interesting articles that raise issues concerning _client, peer and self-critique_ in the [_Design Observer_](http://web.archive.org/web/20080906160702/http:/www.designobserver.com/).\n\nAdrian Shaughnessy’s article, [_Can you make the type bigger?_](http://web.archive.org/web/20080906160702/http:/www.designobserver.com/archives/006599.html) talks specifically to the love-hate and “I’m smarter than you are” relationship between designer and client, and the business of doing business.\n\nOn another level entirely is Rick Poynor’s article [_Where Are the Design Critics?_](http://web.archive.org/web/20080906160702/http:/www.designobserver.com/archives/006477.html) in which he observes the absence of _oppositional criticism_ and the values that critique currently serves:\n\n<dl>\n<dt>\n</dt>\n<dd>It [Design] is one of the ways in which capitalism is most obviously expressed, and never more so than today when design is widely regarded as a miracle ingredient with the power to seduce the consumer and vanquish less design-conscious competitors. </dd>\n\n</dl>\n"
    },
    {
      "time": " 2.Nov.2005 10.06am",
      "content": "I am surprised that there is so little about the business side of design out there. You either have the self-help book written by a self-made multimillion dollar designer or you find some derogatory posts on blogs about how stupid clients can be. You only have to check [clientcopia](http://web.archive.org/web/20080906160702/http:/www.clientcopia.com/) and you’ll have an idea of the level of frustration the design industry feels about his _clientèle_.  \n_Can you make the type bigger?_—and I stress here that they are rarely asking to make the type better— is the kind of thing we hear everyday from our clients, unfortunatly there is very little in the way to educate designers on how to respond intelligently to that kind of requests. However, we have unumerable, blogs, forums, books etc. about making type better. So why as an industry that posseses the tools to communicate very effectively do we not address this problem more frankly. With all the designers working around the globe there must be enough knowledge about client management to fill hundreds of blogs et al.\n\nI know what I will ask Santa\n\n"
    }
  ]
}
