{
  "id": "15942",
  "title": "Body Text w. Futura",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hi all, a buddy of mine here at our office is working on a redesign of one of our small mags (small as in small format...roughly 9\"x5\") he was thinking of trying out variations of futura for headlines (thin to thick) but could not settle on a good solution for a body text. he asked me and i couldn't think of anything suitable off the top of my head so i'd like a little help. anyone have some good suggestions?\n\nbest  \n-will\n\n",
  "author": "Will Miller",
  "time": "31 Oct 2005 — 7:39am",
  "uid": "4552",
  "comments": [
    {
      "time": "31 Oct 2005 — 7:50am",
      "content": "For a consistently old-fashioned look, Bodoni or Century, which were Futura's traditional companions.\n\n"
    },
    {
      "time": "31 Oct 2005 — 8:23am",
      "content": "Something a bit rigid, but structurally oldstyle.\n\nBut no Bodoni for text please (unless it's about sadomasochism).\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 1:24pm",
      "content": "Will how are you going to use the Futura? Initial cap and lower case or all caps. I think the color of the text will be important depending on the weight of Futura you are thinking of.\n\n"
    },
    {
      "time": "31 Oct 2005 — 2:11pm",
      "content": "\\>But no Bodoni for text please\n\nThis recommendation based on Hrant's vast experience in designing editorial publications :-)\n\n"
    },
    {
      "time": "31 Oct 2005 — 2:58pm",
      "content": "That smiley is about as authentic as Worldwide.\n\nNot using Bodoni for more than a paragraph at a time is a no-brainer.  \nExcept for somebody from the Use Whatever Erects Your Artistic Nipples school.\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 3:22pm",
      "content": "\\>Except for somebody...\n\nIt's not about me, Hrant, it's about you.  \nDesigned any publications recently?  \nHow many font licences you sold this month?\n\n"
    },
    {
      "time": "31 Oct 2005 — 3:27pm",
      "content": "The small mag sounds more like a brochure, of sorts. I would guess some Bodoni-esque typefaces would work.\n\nI'll disagree with you, Hrant. Bodoni for books is awful, but for some magazine work it can be interesting and good.\n\n"
    },
    {
      "time": "31 Oct 2005 — 3:36pm",
      "content": "No, it's about craft.  \n(And as if I'm the only person who thinks Bodoni is anti-text...)\n\nOne thing about me though: I'm not enough of an egomaniacal bigot to think that somebody is inferior to me because he does different things. And something about you: artistes cannot tolerate criticism; once you doubt them, they either cut their ear off, or they try to cut yours.\n\nTo me, society at large doesn't really need a  \nfailed-artist-turned-designer-faking-usefulness,  \nexcept maybe to sell more crap to dumb consumers.\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 3:41pm",
      "content": "Ah. C'mon. I am just trying to diffuse the anger. Right. You aren't the only person who thinks Bodoni is a bad choice for text. And we are just giving our opinions. And it is all about subjectivity.\n\nI think Bodoni has been used successfully in smaller magazines, brochures and corporate annuals. However, a version such as Bauer Bodoni would NOT be a good version for anything but display. You do need to find a version, such as ITC 12, that has had the contrast minimized.\n\n"
    },
    {
      "time": "31 Oct 2005 — 4:02pm",
      "content": "\\>the anger\n\nI'm not angry. I'm happy.  \nI've been the brunt of Hrant's ad hominem attacks for two years now, and I've decided to change my strategy from defending myself against his homophobic accusations of my being an \"artiste\", and give him a taste of his own medicine. It feels better than soaking up the punches.\n\nSo, he thinks my suggestion of Bodoni is \"sadomasochistic\"? I won't defend my suggestion, rather, I'm asking why anyone would take any notice of what a loudmouth with such a skimpy CV has to say.\n\n"
    },
    {
      "time": "31 Oct 2005 — 5:52pm",
      "content": "\\> I’ve decided to change my strategy\n\nStrategy? What's most pathetic is that you think this is some kind of head-butting match, something you can win or lose. How typical, interested much more in digging a deeper trench and hoarding more gold, rather than growing, coexisting, <cite>tolerating</cite>. This explains how you named the Eunoia-AllegedlyForText thread, as well as specific remarks you've made in the past. Well, to me, this is not a head-butting match, because I for one am oblivious to your head! Striking you down is a waste of my time; what I'm trying to do instead is learn and teach, exposing phoney craft along the way. So it's not you, it's your ideas.\n\nBut of course this wonderful insight into your head does explain quite well why Tiffany's \"Bodoni for books is awful\" goes Unpunished. Fairness and a spine are not requirements for painting pretty fonts.\n\nThe good news? Now that you think you're acting like me (boggles the mind...) maybe you'll stop your charactersitc <cite>incessant</cite> bitchy, whiny hissy-fits about being attacked. That's really your worst trait.\n\n\\> It feels better\n\nTo an artiste, the Most Important Thing.\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 7:49pm",
      "content": "Hrant, it's not about me any more.  \nTell us about you.  \nWhen is the internet type design \"expert\" actually going to publish some fonts, rather than just criticize other people's?  \nWhen are you going to do your own research into reading theory, rather than just conjuring up your bouma fantasies out of thin air?\n\n"
    },
    {
      "time": "31 Oct 2005 — 8:01pm",
      "content": "Hi Will,\n\nJust how much text is being set on a page? Is it a relatively long line? I ask because if the line length is short and the text reads in bite-sized chunks why not use Futura throughout? Heavy and light. Depending on how its used it could be all right.\n\nIf it's not in small parts and needs to read longer, then a stiff serif would be a good choice like maybe Storm's [Walbaum](http://web.archive.org/web/20130505174335/http:/www.stormtype.com/walbaum.html) or maybe [Pentagraf](http://web.archive.org/web/20130505174335/http:/www.stormtype.com/pentagraf.html)?\n\nHope there's something here to hang your hat on.\n\nJon\n\n"
    },
    {
      "time": "31 Oct 2005 — 8:08pm",
      "content": "I'll be interested to see some other answers to this question as I get asked it now and then by students and I'm always stumped. What goes with Futura? Ummm ... nothing?\n\n-marian\n\n"
    },
    {
      "time": "31 Oct 2005 — 9:22pm",
      "content": "_Bodoni is a bad choice for text_\n\nAs if there was only one Bodoni! We’ve been setting a magazine in Filosofia, Zuzana Licko’s Bodoni, very successfully for a dozen or so issues. And I am the first one to complain about type being too small, too contrasty and too tightly tracked. ITC’s Bodoni is ok as long as you use the smaller sizes, and if it wasn’t for other reasons, I’d use GG Lange’s Bodoni Old Face which is warmer and less contrasty than Monotype’s and most other Bodonis. Futura actually goes well with most other serif faces, as long as the x-height doesn’t approach ITC levels from the 70s. Futura – if tracked enough – makes for even, well-balanced and quiet lines, so the text to go with it simply needs to avoid looking too constructed and mechanical. In other words: no ITC Garamond, no Didot, no Bauer Bodoni. Then again, one wouldn’t use any of these for text anyway.\n\n"
    },
    {
      "time": "31 Oct 2005 — 9:30pm",
      "content": "You can also use Bodoni and Futura the other way round: it's an interesting effect to match the weight of Futura text to the weight of the serifs in Bodoni: Bauer Bodoni for larger heads, Lange's Bodoni (Berthold) for medium size, say the headings in a sidebar.\n\n"
    },
    {
      "time": "31 Oct 2005 — 10:04pm",
      "content": "Nick, I've been publishing -in fact selling- fonts since 1982. Only bitmap ones at first (although in Armenian and Arabic, the latter being pretty hard to pull off on an 8x8 grid), but both bitmap and outline fonts since 1987. You can't spend 10 minutes in any heavily-Armenian-populated area (including Toronto) without running into one of my fonts. Yes, my reach is not very broad (yet) but in my niche I'm everywhere. I have won a couple of awards (and I can smell another coming very soon), have been asked to speak at 7 or 8 international type conferences (some of them paid), have given talks in colleges, have 3 open invitations to speak around the world (about anything I find suitable), and have had articles published in various magazines. I will be teaching a type design course at the Art Center starting January. I've done font work for Disney, UCLA, Liverpool University, Agfa, the Israel Postal Authority, Ikea, and many smaller outfits. And I manage to sell <cite>betas</cite> of my fonts for up to $250. As for readability research, although I haven't run my own lab tests or anything, I've been amalgamating the results and thoughts of dozens and dozens of researchers and pundits for 7 years, to the point that people pay me (one time over $1500) to talk about it.\n\nSo it simply doesn't add up that I'm a clueless idiot that everybody should ignore about everything - face it. Just because we disagree doesn't mean one of us is an idiot. And then realize why you keep insisting I'm a clueless idiot: your ego is hurt, and you're at a loss as to how to control me (the uncontrollability of an inexpensive, global discussion forum being something quite unnerving to people who are used to controlling the \"internal artistic consistency\" of their work for years, insularly) so you lash out and thump your chest. Well, you can't control me. And any \"strategy\" to subdue me can never work, come on. It makes you feel better? That's sick - even I give you more credit than that. If this debacle is any single person's fault, and if it's any single person's loss, to me it's clearly yours. Not because I'm a perfect person (not even close) but simply because the onus is on you to get a hold of yourself, to <cite>tolerate</cite> - just like I tolerate you. I have not once complained about your manners or attacks - only your content.\n\nAnyway, coming back to your alpha-male obsession with accomplishments: I think all of that (including my stuff above) is secondary; your own propensity to sell pretty display fonts is secondary. What really matters to me (and many other people) is a humble respect for the craft and its progress; not with expressing myself and milking anything and everything for my own material or egocentric benefit. To me type is in large part about readability, and Nick, you don't know jack about readability. How could you, being a believer in the Emigre mantra? You can only make text fonts by a combination of mimickry and dumb luck (and you're not alone). Which isn't so bad - I know and admire numerous people who make good display fonts, even better than you. The difference is they admit that they're making display fonts. And most of them realize they're not god's gift to type. You don't manage to do either. You think you're hot stuff. Puhleeze. You're just middle of the pack, and moreover you're stuck in a rut because you think you've arrived; at least I know -as I said in my Daidala interview\\*- that I haven't really done anything notable yet, which means I have a world of growth left.\n\n\\* [http://www.daidala.com/25apr2004.html](http://web.archive.org/web/20130505174335/http:/www.daidala.com/25apr2004.html \"http://www.daidala.com/25apr2004.html\")\n\nAs the Eunoia-Text thread proved, no amount of gentle coaxing -even by people who often agree with you and see nothing at all wrong with the space between your ears- that you shouldn't call your daughter George seems to work. And my attempts to slap you awake haven't worked either. No amount of anything is making you see the huge gaping hole in your type knowledge. Just because you fool some people into thinking you know what you're doing in the realm of text is only helpful to your pocketbook and ego; not really to other people. And to me, Design is about other people.\n\nCulture isn't about making and selling fashion items.  \nAnd what's not about you, Nick, is Craft.\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2005 — 10:14pm",
      "content": "\\> As if there was only one Bodoni!\n\nThat's a very good point. And Tiffany (with her \"You do need to find a version, such as ITC 12, that has had the contrast minimized\") alluded to that too. What I wonder about though is the \"essence\" of Bodoni, and if optically corrected version with reduced stroke contrast are still Bodoni... And who decides? I wonder about a test like this: put three settings at let's say 10 point: Times, ITC Bodoni-6, and ITC Bodoni-72. Ask people which one, and also which two, is/are Bodoni. What answers would you get, from what type of people? My hunch is that the more you ask people who matter (people proportionally distant from type designers) the more the Bodoni-6 looks closer to Times than to \"Bodoni\"...\n\nSo I think that scale actually throws off our attempts to apply a consistent style, at least to some extent. The more readable you want to make the smaller sizes of a \"stylish\" design, the more you're going to have to act pragmatically, to the point of dumping a big chunk of the style. There is a threshold between Display and Text, and since the former is where conscious deliberation of style and formation of perceptions of style happens, while in the latter the participation of style undergoes neutering, it's pretty unclear to me what something like \"Bodoni\" actually means in text sizes.\n\n\\> one wouldn’t use any of these for text anyway.\n\nNick, what say you?\n\nhhp\n\n"
    },
    {
      "time": "1 Nov 2005 — 4:17am",
      "content": "FWIW, Bodoni Old Fashion URW looks pretty good and \\_very\\_ close to Berthold's Bodoni Old Face.\n\n"
    },
    {
      "time": "1 Nov 2005 — 7:31am",
      "content": "I don't know that I'm adding anything new, but I was recently reading some text set in a Bodoni with very thin serifs (I'm sure several here could ID it by foundry on sight but not I). I was reminded of the very technical term “sparkle” used in another thread by Tiffany. The contrast diverted my attention away from the letter shapes and the text was scintillating, and I don't mean refreshing.\n\nFor Futura, I would look at versions of Walbaum or maybe Walburn and see if you could come to a good solution.\n\n"
    },
    {
      "time": "1 Nov 2005 — 8:05am",
      "content": "\\>Nick, you don’t know jack about readability\n\nHrant, here you go again, up to your old tricks.  \nThe ad hominem argument -- not just stating your own case, but making your point by personally discrediting anyone who disagrees. I won't tolerate that. You're entitled to your opinions, but not to bolster them by dissing other people. For two years I've been discussing things on Typophile fair and square, and keeping a \"stiff upper lip\" in the face of your personal slights, but no more.\n\nI don't have to defend my personality or work against your fantastic portrayals of them, suffice it to say that I worked full-time as an art director for 20 years and now make my living from type design. One of my text types is read by millions of people \"Worldwide\" in their daily newspapers. So the facts would indicate that I know something about readability, without being egotistical.\n\nYou're an Internet blowhard. You have no formal education or professional job experience related to typography or design. You have a little hobby business making Armenian fonts. Oh, and you've read some stuff about readability. God help your Art Center students.\n\nI don't take this \"alpha-male\" approach with anyone else, but as you've repeatedly challenged my masculinity with your homophobic \"artiste\" jibes about pretty display fonts, what the \\*\\*\\*\\* do you expect?\n\n\\>Nick, what say you?\n\nWith regards to Bodoni, you're talking your usual theoretical mumbo-jumbo.  \nHere you are in a thread with working typographers who own licences to various versions of Bodoni and have used them for text matter in paying jobs, thereby seeing how the spec they made on screen works in print, and you're saying \"it’s pretty unclear to me what something like “Bodoni” actually means...\" Amen.\n\n"
    },
    {
      "time": "1 Nov 2005 — 10:01am",
      "content": "\\> One of my text types is read by millions of  \n\\> people “Worldwide” in their daily newspapers.\n\nLike I said, this counts for little.  \nEven to you: please remind us what you think about certain Adobe and MS fonts...\n\n\\> You have a little hobby business making Armenian fonts.\n\nRight. All those clients I mention just can't get enough of Armenian fonts.  \nYour ego is causing your blinders to become increasingly larger.\n\n\\> God help your Art Center students.\n\nWhile he seems to have failed your poor unicase martyrs...\n\n\\> With regards to Bodoni, you’re talking ...\n\nI was referring to things Tiffany and Erik said that I <cite>know</cite> you disagree with.  \nYou're dodging. And you know it.\n\n--\n\nYour ignorance of the effect of scale on the adaptation of a style falls within the gaping hole in your understanding that I mentioned. And it's no surprise, considering your ill-named daughter.\n\nhhp\n\n"
    },
    {
      "time": "1 Nov 2005 — 10:05am",
      "content": "\\*wearing moderator hat\\*\n\npleas refrain from making personal attacks and insults. if you want to discuss issues, discuss issues. but enough barbs and name-calling. thank you.\n\n"
    },
    {
      "time": "1 Nov 2005 — 10:12am",
      "content": "\\> I won’t tolerate that.\n\nHow?\n\nhhp\n\n"
    },
    {
      "time": "1 Nov 2005 — 11:00am",
      "content": "Shut up Hrant, didn't you hear what the man said?\n\n"
    },
    {
      "time": "1 Nov 2005 — 11:05am",
      "content": "So do I have to say \\*wearing moderator hat\\* to get your attention? Boy, I really should find a new forum.\n\n"
    },
    {
      "time": "1 Nov 2005 — 11:20am",
      "content": "How was that an attack or an insult?  \nWhat's going on in the background?\n\nhhp\n\n"
    },
    {
      "time": "1 Nov 2005 — 11:34am",
      "content": "\\>Boy, I really should find a new forum.\n\nSorry Tiffany. I've done that, and spent some time away from Typophile, but I missed it, and figured, why should I let Hrant drive me away?\n\n"
    },
    {
      "time": "1 Nov 2005 — 11:54am",
      "content": "Ah no. :^D That isn't what I meant. I just don't want to have to \\*wear my moderator hat\\* to get the mass to have some class. :^D\n\n"
    },
    {
      "time": "1 Nov 2005 — 12:39pm",
      "content": "\\> why should I let Hrant drive me away?\n\nWhich is <cite>exactly</cite> what I've been telling you for ages.  \nAnd it's really not just you and I: other people have  \nbeen telling other people the same thing. It's just  \nhard to actually do it.\n\nhhp\n\n"
    },
    {
      "time": "1 Nov 2005 — 1:43pm",
      "content": "Will - what is your small mag's content? Is it long (number of pages) and lots of full text-pages, or do you have photos interspersed? If there's lots of text, I like to read [Whitman](http://web.archive.org/web/20130505174335/http:/www.fontbureau.com/fonts/Whitman), but I can imagine it looking silly with a thin Futura.\n\n"
    },
    {
      "time": "1 Nov 2005 — 2:47pm",
      "content": "Will can you post a current page (jpg please) and lets see how the space works on a page. It might help in giving direction.\n\n"
    },
    {
      "time": "2 Nov 2005 — 11:52am",
      "content": "I think typophile is one of best design forums, which is not only a forum .. it really have rich resources more than any place here, because honstly people here are profissional and they have very solid background about what they are speaking. So I have to be honest with all of you that I expect some kind of deplomatic, understanding and FORGIVNESS. Because we are all here to help this community happen and make people love typography. Just want to shoot a small advice for Will Miller, why don't you make one page of your magazine, then try every suggested font in this forum. And I have to ask you what about using platinio as text in such small pages?\n\n"
    },
    {
      "time": "9 Jul 2010 — 3:21am",
      "content": "I can't decide of this was the greatest Nick/Hrant battle or all time. Like a 3rd movie sequel. It has the right elements but is too self referential and loses the immediacy of the older films. I think this is the best one here: [http://typophile.com/node/15929](http://web.archive.org/web/20130505174335/http:/typophile.com/node/15929 \"http://typophile.com/node/15929\")\n\n"
    },
    {
      "time": "9 Jul 2010 — 11:08am",
      "content": "Ray, are you stirring the pot, or smoking it?\n\n"
    },
    {
      "time": "9 Jul 2010 — 7:43pm",
      "content": "Ray, you know, personally there was a very educating thread with an exchange between Nick and Hrant on a mostly (most of the time) factual level about the modernist fonts Bodoni and printing in the 19th century.\n\nIt was interesting, with different arguments on what people where used to see, what was modern back then, about what book printers said, wrote and used, about which element influences the readability of modern faces, if it were the contrast or the shape of the letters, and how then a similar shape is with less contrast. It was very interesting and I think three pages long.\n\nThat thread is much more worthy to look at and to continue the discussion, than this one were bad blood was spilled everywhere...\n\n[http://typophile.com/node/65216?page=1](http://web.archive.org/web/20130505174335/http:/typophile.com/node/65216?page=1)\n\n"
    },
    {
      "time": "9 Jul 2010 — 7:58pm",
      "content": "@flooce that doesn't sound exciting but thank you.\n\nI missed this action the first time around because I visited so infrequently.  \nI googled site:typophile.com hrant shinn\n\nIt must have been hard to deal with at the time but as a spectator, reading them all in one sitting it's entertaining stuff and of some historical significance, I think. I don't mean to tease. There were two Nick/Hrant battlethreads that were so epic that I just could help but applaud the spectacle of it all. If Typophile is boxing then this thread is the ear-getting-bitten-off one.\n\n"
    }
  ]
}
