{
  "id": "15969",
  "title": "Photofont Start for Mac and Windows",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20070808143133/http:/typophile.com/user/108 \"View user profile.\") : 1.Nov.2005 8.11am \n\n· · · · · · · · · · · · · · · · · · · ·  \n**Free plugins for Photoshop released!**  \n· · · · · · · · · · · · · · · · · · · ·  \nFor Immediate Release  \nOctober 30, 2005  \nContact: Ted Harrison  \nFontlab Ltd.  \n136 E 8th St., Port Angeles WA 98362, USA  \nTel: +1 (509) 272-3260  \ncontact[at]fontlab[dot]com\n\nPort Angeles, WA, USA – October 30, 2005.\n\nFontlab Ltd. announces the release of **[Photofont Start](http://web.archive.org/web/20070808143133/http:/www.fontlab.com/photofont/)** for Mac and Windows.\n\nPhotofont Start is a free plugin that allows any graphic designer to use photofonts in Adobe Photoshop and compatible applications for Mac OS and Windows. Photofont™ is an exciting new technology that allows users to create and use full-color bitmap type with transparency.\n\n“Photofont opens completely new dimensions in the field of typography that was until now dominated by black-and-white type. Imagine computer letters with true calligraphic expression, visible brush strokes and paper structure. This is now possible with Photofont. And the best of all, the plugin is free,” said Ted Harrison, President of Fontlab Ltd.\n\nThe ability to create photofonts has been available for some time for users of BitFonter, Fontlab Ltd.’s professional bitmap font editor. Now, with the new free Photofont Start plugin, these designs can be easily used in the most popular bitmap-editing applications: Adobe Photoshop, Corel Painter, Macromedia Fireworks and compatible applications that accept Photoshop plugins on both Mac OS and Windows. The Photofont file format specification is based on open standards like XML and PNG and is publicly available. For more information visit the Photofont Start page at **[http://www.fontlab.com/photofont/](http://web.archive.org/web/20070808143133/http:/www.fontlab.com/photofont/)**\n\n",
  "author": "<a href=\"http://web.archive.org/web/20070808143133/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 1.Nov.2005 8.11am",
  "uid": "108",
  "comments": [

  ]
}
