{
  "id": "15966",
  "title": "Planet typography",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "From A to Z... all the letters are on [Planet typography](http://web.archive.org/web/20131014111329/http:/www.planet-typography.com/).\n\n[Planet typography](http://web.archive.org/web/20131014111329/http:/www.planet-typography.com/) is a portal dedicated to typefaces and typography which proposes a comprehensive directory of links, a webzine which introduces the most famous contemporary type designers (in the October issue, Jonathan Hoefler, designer of Hoefler text), a typographic manual, a bookshop and a section dedicated to the freeware creation.\n\nThe site was launched in 1999 and is edited by a typo addict (but who does not work in the graphic design industry). Its target is to educate type users (all of us who have a computer) to the art of type creation and to vulgarize its unknown art.\n\nA new version has been launched in October.\n\nURL: [www.planet-typography.com](http://web.archive.org/web/20131014111329/http:/www.planet-typography.com/)\n\n| Attachment | Size |\n| --- | --- |\n| [planet-typo.jpg](http://web.archive.org/web/20131014111329/http:/typophile.com/files/planet-typo.jpg) | 9.88 KB |\n\n",
  "author": "Typook",
  "time": "1 Nov 2005 — 4:14am",
  "uid": "9441",
  "comments": [
    {
      "time": "1 Nov 2005 — 4:43am",
      "content": "FWIW, on your Foundries page, you might want to correct the spelling of  \n_Independant_ to **Independent** , which is the way it appears in the dictionary.\n\n"
    },
    {
      "time": "1 Nov 2005 — 7:22am",
      "content": "Thank you Mr. Loubet del Bayle, I will visit the site in the next weeks.  \nYou might want to rethink the top right grey part of the home page,  \nin my opinion it is weak, and also the part of the 'g' loop in the logo is too fat,  \nmore visible against the white background. Regarding the color-rollover  \nfor Magazine, Manual, &c., I would do the opposite since I cannot read the links.  \nAlso what is the purpose of attaching an image in that size here ?\n\nRegards,  \nAS\n\n"
    }
  ]
}
