{
  "id": "1597",
  "title": "ATM deluxe",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello,   \nIm hoping someone could help me.   \nI have an ibook with system 9 & 10.   \nI have upgraded alot of programs and now my ATM does not seem to be compatible because whilst it opens on system 9 my new programs such as indesign open on system 10. Is there anyway I can fix this so what fonts i turn on or off will work with the programs that open in system 10 or do i have to get ATM deluxe for system 10?   \n   \nThanks in advance,   \nDavid.\n\n [‹ Get Gill Sans Free](http://web.archive.org/web/20080310054709/http:/www.typophile.com/node/1599 \"Go to previous forum topic\") [Hello, Could anyone help me please? ›](http://web.archive.org/web/20080310054709/http:/www.typophile.com/node/1374 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080310054709/http://www.typophile.com/user/1394\" title=\"View user profile.\">david_leonard</a>",
  "time": "<br>",
  "uid": "1394",
  "comments": [
    {
      "time": " 11.Oct.2003 8.08pm",
      "content": "ATM Deluxe is simply not available for OS X. If you are needing a font management utility for use under OS X, you will have to have to purchase Extensis SuitCase, MasterJuggler, or FontAgent Pro from Insider Software. Or else wait under later this month and upgrade to OS X 10.3 (Panther) and use Apple's own Font Book.\n\n"
    },
    {
      "time": " 11.Oct.2003 8.11pm",
      "content": "Here are some pointers:   \n   \n [http://www.extensis.com/suitcase/](http://web.archive.org/web/20080310054709/http:/www.extensis.com/suitcase/)   \n [http://www.alsoft.com/MasterJuggler/](http://web.archive.org/web/20080310054709/http:/www.alsoft.com/MasterJuggler/)   \n [http://www.insidersoftware.com/products/fontagentpro/](http://web.archive.org/web/20080310054709/http:/www.insidersoftware.com/products/fontagentpro/)   \n [http://www.apple.com/macosx/features/fontbook/](http://web.archive.org/web/20080310054709/http:/www.apple.com/macosx/features/fontbook/)   \n   \nYou'll also do yourself a favour by reading over the information that Apple has prepared on its website reagarding using and managing fonst under OS X.   \n   \n [http://www.apple.com/creative/fonts/](http://web.archive.org/web/20080310054709/http:/www.apple.com/creative/fonts/)\n\n"
    },
    {
      "time": " 12.Oct.2003 11.26am",
      "content": "Thanks alot for your help Grant,   \n   \nIm downloading the pdf now from apple.com,   \nthanks again,   \ndavid.\n\n"
    },
    {
      "time": " 13.Oct.2003 5.37am",
      "content": "Panther is released on October 24th. And get rid of OS 9, its so poor compared to OS 10. anything.\n\n"
    },
    {
      "time": " 13.Oct.2003 11.37am",
      "content": "\\> _And get rid of OS 9, its so poor compared to OS 10_   \n   \nMore stable? Yes. Better memory management? Yes. Faster? Most application processes - yes. Finder actions, file management, application launching - decidedly no.   \n   \nAlthough Panther has improved many of the Finder and file management-related issues I had with Jaguar, I miss using 9pt Geneva in my list views, among other aesthetic bits.   \n   \nAnd you'll have to pry my Classic-running Claris Emailer from my cold dead hands...   \n   \nOh, and for those who have yet to switch to FontLab from Fontographer - the point is mootish.   \n   \nBack to the subject of this thread: even with Font Book and the recent revisions to SuitCase and the other font management utilities, there is no way in heck that OS X even comes close to OS 9 for handling large libraries of typefaces. Font/DA Mover feels more advanced at times.\n\n"
    },
    {
      "time": " 13.Oct.2003 12.08pm",
      "content": "Grant, Font Agent Pro truly is comparable to ATM Deluxe -- and this is coming from someone who really mourned the loss of ATMD and cursed the available options for many months. In fact, Font Agent Pro has some niceties that ATMD didn't.   \n   \nAgree about some of the Finder functions, though. It pisses me off that I can't navigate Open/Save dialogues by keyboard as easily as I could in OS 9. Grrrrr.\n\n"
    },
    {
      "time": " 13.Oct.2003 1.19pm",
      "content": "Meredith, I'll agree that FAP is the least crappy of the bunch, and does offer some nice controls over font libraries - but my main peeve is that it is still less than stable when handling over a couple hundred suitcases full of fonts. Our creative team at [Veer](http://web.archive.org/web/20080310054709/http:/www.veer.com/) uses FAP, and it works for the most part - but it's no ATMD.\n\n"
    },
    {
      "time": " 13.Oct.2003 2.09pm",
      "content": "Interesting that Veer uses FAP -- good choice. Do y'all have any trouble with running Photoshop while FAP is running, or is it just me?   \n   \nI'll admit, I was (and remain) mystified by Adobe's decision to dump ATMD. Why, why, why?   \n   \nThomas?\n\n"
    },
    {
      "time": " 13.Oct.2003 7.03pm",
      "content": "Maybe it had something to do with the PostScript rasterizer being native to OSX.\n\n"
    },
    {
      "time": " 13.Oct.2003 7.07pm",
      "content": "James, that would explain dropping ATM Lite, but the need for good font-management capabilities remains.\n\n"
    },
    {
      "time": " 13.Oct.2003 7.55pm",
      "content": "No trouble specific to Photoshop, just general sporadic FAP crashing while browsing faces or freezing when adding voluminous amounts of new fonts. Again, it's one of those software stability issues I have with OS X. Sure, it doesn't being the whole system down a la OS 9, but why are these programs crashing in the first place? Keep in mind that we are juggling 13 medium to large type libraries at Veer, with a total font count of well over 5,000. That does not include system fonts. Quiet frankly, I don't think any of the OS X-based solutions are ever tested with that many resources.\n\n"
    },
    {
      "time": " 14.Oct.2003 5.08am",
      "content": "I've tried them all and to me MasterJuggler comes closest to the ATM DeLux feel. No auto-activation (like DeLuxe) but with full UniCode support. (unlike DeLuxe).   \n   \nAlso like DeLuxe, MJ does not have to be running to keep fonts activated.   \n   \nSo having found MJ I have stopped looking for a font management utility.   \n   \nI used to be a fan of FAP, but with lots of fonts installed it did strange things like refusing to activate the roman weight of a font family. FAP is also a bear in the startup, and the shutdown taking minutes to completely boot or quit.\n\n"
    }
  ]
}
