{
  "id": "15979",
  "title": "Accidental Similarity",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "After I finished and selected this sketch as my main proposal for a client I started feeling like I have seen this somewhere else before, then after a short time I remembered:\n\n ![](http://web.archive.org/web/20131020080420im_/http:/typophile.com/files/Santander.gif)\n\nBad luck or subconscius memory? Is this sketch useless? (mine is the second one)\n\n",
  "author": "rs_donsata",
  "time": "1 Nov 2005 — 3:40pm",
  "uid": "1530",
  "comments": [
    {
      "time": "1 Nov 2005 — 6:08pm",
      "content": "Héctor,\n\nMany years ago I developed an identity system for one of the city hospitals in Salem, Massachusetts (so old I no longer have a sample). I decided to use a stylized graphic of a flying dove since in the city's official seal there is a dove with olive branch.\n\n ![](http://web.archive.org/web/20131020080420im_/http:/typophile.com/files/Salem_Seal.gif)\n  \nSeveral years after this, I noticed the new logo developed for Dove Soap as well as several other logos using graphics very similar to mine.  \n\n ![](http://web.archive.org/web/20131020080420im_/http:/typophile.com/files/dovesoap.jpg)\n\n ![](http://web.archive.org/web/20131020080420im_/http:/typophile.com/files/dove2.jpg)\n\n ![](http://web.archive.org/web/20131020080420im_/http:/typophile.com/files/dove3.jpg)\n  \nMy point is this: there are many things, flora or fauna in the real world that have significant symbolic meanings. Birds, dove, hawk, lion, snake, rose, clouds, fire, eyes, hands, and so on. Your use of a flame, torch, fire, etc. is bound to be similar to other identity systems whether you were inspired directly by them or not, and IMHO your treatment of the flame does not come close enough for the two logos to be confused. \n\nPersonally, I would stick with the direction on the graphic you are taking. You may only want to consider a variation on the typeface that would be less similar theirs.\n\n"
    },
    {
      "time": "1 Nov 2005 — 7:13pm",
      "content": "Well thanks Norbert, I'll actually try some sans serifs, that's a good idea.\n\nHéctor\n\n"
    },
    {
      "time": "1 Nov 2005 — 7:48pm",
      "content": "Héctor,\n\nI don't mean to be presumptuous about altering your design, but this treatment of the uppercase \"I\" came to mind. Perhaps you also thought of this but found it too obvious to be unique. Just a thought, but the typeface still needs to be changed.\n\n ![](http://web.archive.org/web/20131020080420im_/http:/typophile.com/files/innova2.gif)\n\n"
    },
    {
      "time": "2 Nov 2005 — 12:48pm",
      "content": "That's a good suggestion and unicase roman letters always are good attention grabbers. I'll be experimenting with other typefaces and treatments. I just like so much how Quadraat works on this that I'm not so satisfied with what I have tried so far.\n\nHéctor\n\n"
    },
    {
      "time": "3 Nov 2005 — 3:29pm",
      "content": "A slab serif might work too.  \nWhat I like about your original design is that the flame part can eventually be used seperately. I think a sans or a slab would be best for thr type.\n\nChrisL\n\n"
    },
    {
      "time": "5 Nov 2005 — 11:30am",
      "content": "Thanks a lot for the input, I made a sketch with syntax but it didn't work so well so I presented my original idea.\n\nAfter the first revision this is going to be the direction we are going after so there's no need to worry anymore:\n\n ![](http://web.archive.org/web/20131020080420im_/http:/typophile.com/files/Propuestas.gif)\n\nHéctor\n\n"
    },
    {
      "time": "5 Nov 2005 — 12:06pm",
      "content": "Careful about ARCO Gasoline logo though:\n\n ![](http://web.archive.org/web/20131020080420im_/http:/typophile.com/files/ARCO-Gas.gif)\n\nChrisL\n\n"
    },
    {
      "time": "6 Nov 2005 — 5:49pm",
      "content": "Ohhh.... ·\\*`=?%$· jajaja\n\nIt's ok... out of the marketplace, out of the category, not known in here (and likely will never be), out of question.\n\nHéctor\n\n"
    }
  ]
}
