{
  "id": "15982",
  "title": "Greek All Caps",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "As has been suggested by [John Hudson](http://web.archive.org/web/20140911210557/http:/www.typophile.com/wiki/John%20Hudson), it would be useful to provide an all-cap setting for [Greek](http://web.archive.org/web/20140911210557/http:/www.typophile.com/wiki/Greek) which removes all accents (which is standard practice). And he has suggested [Titling Alternates](http://web.archive.org/web/20140911210557/http:/www.typophile.com/wiki/titl) as the feature.\n\nIt seems straightforward, except for the wrinkle of \"double-glyph\" characters such as \"RoughAlpha-iota\": I need three extra alternates to handle this situation, Alpha-Iota, Eta-Iota, and Omega-Iota, right?\n\n",
  "author": "Nick Shinn",
  "time": "1 Nov 2005 — 9:00pm",
  "uid": "2021",
  "comments": [
    {
      "time": "2 Nov 2005 — 12:30am",
      "content": "Nick, that wasn't what I suggested using the Titling Alternates for. For removing the accents from Greek all-caps settings, I use the COntextual Alternates (calt) feature, and map directly to the corresponding unaccented glyphs. The contextual substitution is a two-stage process:\n\nWhere a tonos or oxia falls on the first vowel of a two-vowel combination that can be read as a diphthong, I change the second vowel to add a dialytika over it. Then I remove all accents except the dialytika. I do this for both all-caps and smallcaps.\n\nBy using the Contextual Alternates feature, I ensure that this behaviour is active by default -- which it should be, as it is the grammatical norm --, but allow users to turn the accents back on if they want them by turning off the feature.\n\n"
    },
    {
      "time": "2 Nov 2005 — 12:02pm",
      "content": "\\>Where a tonos or oxia falls on the first vowel of a two-vowel combination that can be read as a diphthong, I change the second vowel to add a dialytika over it. Then I remove all accents except the dialytika.\n\nI'm afraid I don't understand that. Sorry for being a bit slow on the uptake, but could you spell it out a bit more? Thanks!\n\n"
    },
    {
      "time": "2 Nov 2005 — 2:48pm",
      "content": "Okay, you have a word like ρωμέικα. The Greek letter sequence ει is usually pronounced as a diphthong, but the presence of the tonos on the ε indicates that the two vowels are pronounced separately with the accent on the ε. The rule is that if the accent is on the whole diphthong then the tonos falls on the second vowel, so:\n\nει = unaccented diphthong  \nεί = accented diphthong  \nέι = non-diphthong, accent on the ε  \nεΐ = non-diphthong, accent on the ι\n\nIf you want to set the word in all-caps, a simple case conversion will produce ΡΩΜΈΙΚΑ, which is incorrect because the accent mark should be dropped from the Έ in an all-caps setting. So you need to contextually swap the unaccent Ε glyph for Έ when preceded by another uppercase letter. In VOLT parlance:\n\nEpsilontonos -\\> Epsilon  \n‹uppercase group› |\n\nHowever, this will result in ΡΩΜΕΙΚΑ, which is also incorrect because you have lost the indication that the E and Ι are to be separately pronounced, so _before_ you perform the substitution of Ε for Έ you need to insert a dialytika over the Ι. For this, you used the tonos on the Έ as a context trigger:\n\nIota -\\> Iotadieresis  \n‹Epsilontonos› |\n\nThis results in ΡΩΜΈΪΚΑ. _Now_ you perform your second substitution to remove the tonos from Έ when preceded by another uppercase letter, and you are left with ΡΩΜΕΪΚΑ, which is correct.\n\nThere are seven Greek diphthongs, and the above rules apply to all of them during case mapping (and also smallcaps): αι ει οι υι αυ ευ ου\n\nSo your first lookup goes like this:\n\nIota -\\> Iotadieresis  \nupsilon -\\> upsilondieresis  \n‹uppercase with tonos/oxia group› |\n\nand your second one goes like this:\n\nAlphatonos -\\> Alpha  \nEpsilontonos -\\> Epsilon  \nEtatonos -\\> Eta  \n%... etc. for all accents except dialytika  \n‹uppercase group› |\n\nPerhaps someone else can express these lookups in FontLab/FDK syntax?\n\n"
    },
    {
      "time": "3 Nov 2005 — 6:57pm",
      "content": "One of our Greek colleagues was kind enough to point out that in the orthographies of some Greek dialects ηυ and ωυ are also diphthongs and would follow the same rules in casing as those I've described. Examples she gives include Ionic νηῦς, corresponding to the Attic ναῦς, and New Ionic ὡυτός corresponding to the Attic αὐτός.\n\n"
    },
    {
      "time": "3 Nov 2005 — 8:31pm",
      "content": "Thanks so much John, I think I should be able to figure this out in FontLab, but it will take me a few days as I haven't finished all my glyphs yet.\n\n"
    },
    {
      "time": "29 Dec 2005 — 4:18pm",
      "content": "OK, I've studied this topic some more, and have a few questions for John, and Thomas.  \nI haven't actually tried any implementation, so this is still theoretical.\n\n1. John, why handle Greek all-caps with the Contextual Alternates feature and not \"Case\"? Wouldn't Case perform the same function more logically? (As I understand it, the \"case\" feature is not activated during \"shift+character\" keystrokes, but only by \"command-shift-k\", or from a typographic menu.)\n\n2. John, as your second substitution removes the accents on caps following another cap, what happens to the initial capital letter of an all-caps word? Surely that should lose its accent(s) too, only being accented in titlecase setting?\n\n3. Thomas: I've been looking at the \"all caps\" behavior of InDesign, applied to Polytonic Greek, and there are quite a few lower-case accented characters which it has no effect upon. What's the reason for that?\n\n"
    },
    {
      "time": "29 Dec 2005 — 7:17pm",
      "content": "1. I originally considered using 'case' for Greek all-caps, but after discussing it with Paul Nelson at MS I decided against it. The 'case' feature is intended for what are typographical niceties but optional, e.g. specially aligning punctuation. The 'case' feature is not widely implemented, and in Adobe's UI at least it is tied to a particular display function, not to the presence of strings of uppercase letters. You want the Greek capping behaviour to be on by default, and it is context specific, so 'calt' is both more desirable and more appropriate.\n\n2. Yes. You want the context to include before and after cap context.\n\n3. Thomas may have a more specific answer, but my guess is that polytonic Greek casing is not supported in InDesign yet. Which lowercase accented characters are not affected?\n\n"
    },
    {
      "time": "29 Dec 2005 — 7:53pm",
      "content": "_You want the Greek capping behaviour to be on by default, and it is context specific, so ‘calt’ is both more desirable and more appropriate._\n\nYes, I get it now.\n\n_...context to include before and after cap context._\n\nOK, that's smart. I was originally thinking if it were being done with the \"case\" feature, it could just be a straight substitution: characters with accents replaced by corresponding accent-less glyphs. But with that behaviour in an always-on \"calt\" feature, you'd never be able to set a single accented cap for titlecase!\n\n_Which lowercase accented characters are not affected?_\n\nI haven't checked them all methodically; while InDesign (in my set-up, at least) appears to capitalize nearly all of the Polytonic characters, it seems to have gaps, for instance vowels with perispomeni.\n\n"
    },
    {
      "time": "29 Dec 2005 — 8:05pm",
      "content": "_..vowels with perispomeni._\n\n...and no breathing. Perhaps InD doesn't capitalize these because it recognizes that accented capitals should only appear at the begining of words (although it applies capitalization indiscriminately), and such characters would always have a breathing in that position?\n\n"
    },
    {
      "time": "31 Dec 2005 — 12:55am",
      "content": "Just to clarify a little further, just in case anyone is confused, when I say that the context should include both preceding and following capitals, I mean two separate contexts, not a dual context. It should be obvious...\n\nRegarding the casing issue in InDesign, I'll investigate this. Most Greek casing is fairly straightforward: the only tricky bit is the lowercase diacritics for which there are no corresponding uppercase, e.g. iota with both accent and dialytika.\n\n"
    },
    {
      "time": "31 Dec 2005 — 1:18am",
      "content": "Okay, I've taken a look at what InDesign is doing. The lowercase letters that it is failing to case convert to uppercase are those for which there are no standard polytonic uppercase equivalents. These are diacritics that only have lowercase forms in the orthography. That said, though, I don't think what InDesign does in case mapping is ideal: these characters should not be left as lowercase, rather, they should be converted to appropriate unaccented uppercase characters. Of course, in the case of a character-level conversion, this process cannot be reversed, but that is often the way with special casing (the German eszett is another example of non-reversible case mapping). The attached image shows which Greek lowercase letters are converted by InDesign and which are not.\n\n ![](http://web.archive.org/web/20140911210557im_/http:/typophile.com/files/IDGreekCasing.gif)\n\n"
    },
    {
      "time": "31 Dec 2005 — 11:39am",
      "content": "_...these characters should not be left as lowercase, rather, they should be converted to appropriate unaccented uppercase characters._\n\nThis can't be done as a third lookup in the \"calt\" feature, because the obvious context triggers (preceded by or followed by an unaccented cap) would result in unwanted capitalizations in U&lc settings, in situations where the problem character follows an unaccented initial cap, or is the last letter in a word.\n\nTherefore, it looks like the \"case\" feature is the solution, so why not use it for the whole feature?\n\n"
    },
    {
      "time": "31 Dec 2005 — 2:19pm",
      "content": "I'm not talking about glyph-level display conversions for casing, Nick. It is the application's job to look after case conversion at the character-level, whether actually affecting the backing text string or in a buffered display state. You shouldn't have to do any messing around in glyph lookups to achieve correct case mapping: this is all standard Unicode text processing stuff that applications are supposed to handle correctly. Unfortunately, a lot of applications support normal character casing, but do not support all or any of the Unicode Special Casing mappings. Greek has both conditional and unconditional special mappings, and applications need to handle these. You can review the special mappings for Greek characters in the [SpecialCasing.txt](http://web.archive.org/web/20140911210557/http:/www.unicode.org/Public/4.1.0/ucd/SpecialCasing.txt) file that is part of the Unicode Standard.\n\nIn the case of the lowercase alpha with perispomeni the Special Casing rule is\n\n1FB6; 1FB6; 0391 0342; 0391 0342; # GREEK SMALL LETTER ALPHA WITH PERISPOMENI\n\nwhich indicates that for uppercase and titlecase, the correct character mapping is to two characters: uppercase Alpha and the combining perispomeni character. This is actually a bit more complex a mapping than I was anticipating, and encourages me to view the Unicode polytonic encoding as a kind of compromise between the standard orthography (encoded as precomposed diacritics) and the occasional need to encode and display non-standard combinations. That is, it is not usual to have an uppercase Alpha with perispomeni since this is contrary to spelling rules according to the standardised polytonic system, therefore this diacritic is not encoded because there is little need for the typical font, text processing system, etc. to support it and to do so would be a burden. On the other hand, what should be the proper encoding and what should be the default behaviour _if_ a user wishes to have this diacritic in a document. This is a matter of interest to me because my major polytonic clients are scholars who may be dealing with manuscript sources that pre-date the standardisation of the polytonic system or who may even have a need to encode scribal errors in ancient documents, so I need to implement robust glyph solutions for unusual things. The Unicode Standard indicates that the correct, unconditional mapping of the lowercase ᾶ is to the unaccented uppercase Α (U+0391) and the combining perispomeni character ͂ (U+0342). Presuming that the application gets this right, the question for font developers is how should this be handled at the glyph, and the options are the same as for any base + combining mark sequence. The sequence can be mapped to a precomposed glyph in the 'ccmp' feature, or it can be handled using dynamic mark positioning ('mark' feature). My general preference is mark positioning, because it is most flexible and does not require me to second-guess every possible combination that users may wish to encode and display. However, the case of Greek capitals is complicated by the fact that the mark is placed before, to the left of the letter rather than above it, and this requires not only positioning of the mark but also a lookup that contextually increases the advance width of the base letter to make room for the mark. This is doable, and still the best fallback solution for unanticipated sequences, but I think it would be a good idea to include precomposed glyphs to render uppercase diacritic sequences resulting from Unicode Special Casing rules, mapped in the 'ccmp' feature.\n\nNow Adobe have been cruising along for many years not including combining mark characters in their fonts -- except those I've made for them :) -- and not supporting either 'ccmp' or 'mark' in the primary versions of their applications (these features are supported in the Middle East versions). I can understand the lagging application support, even though it is regretable, but it seems to me particularly ill-planned not to support combining mark characters in their fonts _at least for those instances in which Unicode casing rules demand them._ In general, combining mark support has not been necessary for most the script and language combinations that comprise Adobe's historical font market, but as soon as you decide to support a language that had Special Casing rules that involve combining marks, you really should be including appropriate glyphs and cmap entries in your fonts. Even if InDesign is updated to support correct Special Casing for polytonic Greek, fonts like Garamond Premier Pro will still be unable to provide even crude support due to the absence of support for U+0342 and other combining mark accents.\n\n"
    },
    {
      "time": "31 Dec 2005 — 6:07pm",
      "content": "_You shouldn’t have to do any messing around in glyph lookups to achieve correct case mapping_\n\nThink of it as an in-font \"bug fix\". What's the harm in that?\n\n_Even if InDesign is updated to support correct Special Casing for polytonic Greek, fonts like Garamond Premier Pro will still be unable to provide even crude support due to the absence of support for U+0342 and other combining mark accents._\n\nWhat I am proposing is to fix the \"non all-capping\" of those problem characters, in the \"Case\" feature of my polytonic fonts, so that All Caps is diacritically correct in InDesign -- at least for the standard range of polytonic accented characters. Of course, it's not ideal for Adobe or Microsoft to do that kind of hacking, but it's not inappropriate for an independent foundry. It provides a font feature not presently avaialable, and when the apps are updated to do a more comprehensive All Capping, my font will still work just as well (providing I get it right in the first place!).\n\n_You want the Greek capping behaviour to be on by default_\n\nI don't think I do. That's automatic grammar-correction; it means that if a writer makes a deliberate grammatical mistake, the software will correct his/her keystroke and substitute a different character to the one typed. Sure, it can be turned off by un-checking contextual alternates, but that's the kind of default software behavior I detest. Like when MS Entourage won't let me begin a sentence with a lower-case letter.\n\nIf you configure de-accenting of an all-cap setting as part of contextual alts, you're relying on \"All Caps\" formatting anyway, because the only other way to get an all-cap setting is to \"hard-set\" it, typing letter by letter using the shift key.\n\nThe only difficulty I can think of: if capitalization of the problem characters were made a \"case\" feature, then all-cap text formatted in InDesign might lose such capitalization if exported into another app that didn't support the \"case\" feature, but would perhaps keep the rest of any all-cap formatting.\n\n"
    },
    {
      "time": "31 Dec 2005 — 9:03pm",
      "content": "What's the harm? Well, if an application is doing what it should, your lookups will simply be ignored, since character level case conversion will happen before any glyph processing, so the input glyphs for your 'bug fix' will have disappeared. But I think you are making a mistake in relying on 'case' feature implementation because there is going to be a world of difference between how Adobe are doing this -- the whole 'All Caps' display formatting of what remains lowercase text is bizarre -- and how other major app developers are likely to implement it. Adobe have hidden access to this feature, but have linked it to a formatting function, meaning that it cannot be applied to actual all caps text unless the user, counter-intuitively, selects that all caps text and says he wants it displayed as, um, all caps. Who is going to do that if the text is already in all caps? [For once in my life, I am tempted to use an interrobang.] I don't think the Adobe implementation of the 'case' feature is a very good one, and you shouldn't expect it to be followed by other app or system developers. A better one would apply the feature heuristically whenever sequences of uppercase characters occured, in which case you are back to a feature that is on by default, just like 'calt'. As I say, I originally thought of using 'case' for de-accenting Greek, but I switched to 'calt' on Paul Nelson's recommendation; when the people who will be implementing OpenType Layout for the world's most widely used software recommend something to me, I pay attention. Sometimes I disagree with the recommendation, and do my best to get it changed, but in this case the argument for 'calt' is very sound: it is the logical choice for what is, after all, a contextual alternates substitution.\n\nConsider: in the case of your 'bug fix' to provide upper case display for those lowercase Greek letters than require special casing, it would make sense for this to be done in the 'case' feature since the lookup is not contextual. It seems to me that if you want to do this -- and I'm not encouraging it -- you should follow the Unicode Special Casing rules for the results. So the lookup mapping for e.g. ᾶ should correspond to however you intend that a sequence of uppercase Alpha and the combining perispomeni character should be displayed. If this is as a single glyph, then this glyph should be included in the font and mapped from ᾶ in the 'case' feature lookup. Okay, so the 'case' feature is now providing special casing at the glyph level to make up for deficiencies in applications, and is producing accented capitals for corresponding lowercase diacritics: all the more reason for you to want the de-accenting of all caps to happen someplace other than in the 'case' feature, since you presumably want the presence/absence of accents to be controllable by the user independently of the apparent case conversion. This isn't possible if you are relying on the same feature for both.\n\n"
    },
    {
      "time": "31 Dec 2005 — 9:17pm",
      "content": "_Of course, it’s not ideal for Adobe or Microsoft to do that kind of hacking, but it’s not inappropriate for an independent foundry._\n\nConsidering that Special Casing rules are a part of the Unicode Standard that neither Microsoft or Adobe have managed to yet implement correctly, I'm not sure what they would consider 'ideal'. :)\n\n"
    },
    {
      "time": "1 Jan 2006 — 9:40pm",
      "content": "_Of course, it’s not ideal for Adobe or Microsoft to do that kind of hacking, but it’s not inappropriate for an independent foundry._\n\nWhat I meant was that it would be better for Adobe or Microsoft to add the functionality we're discussing by improving an application or operating system, rather than doing it through a font -- which is something an independent foundry can do, as we're always rolling with the elephant anyway.\n\n_Adobe have hidden access to this feature, but have linked it to a formatting function, meaning that it cannot be applied to actual all caps text unless the user, counter-intuitively, selects that all caps text and says he wants it displayed as, um, all caps. Who is going to do that if the text is already in all caps?_\n\nThat's true for the non-alphabetic typographic features of \"case\", but not for the issue here. Applying \"All Caps\" to Greek capitals is redundant in practice; if the text is all-caps to begin with, it has been \"hard-keyed\" with the appropriate non-accented cap characters, so \"All Caps\" will only be applied to U&lc text.\n\nHowever, I take your general point about the lack of feature clarity. There is a similar situation in the InDesign UI concerning things like the small caps command, where there is no indication whether the result is true or faux.\n\nI can guess why this has been done -- to shorten the menu and make things more transparent for non-OT-savvy users. That can be a good UI principle, but IMHO it would be better here to have a dedicated OpenType menu palette which lists all the features in a font by name. After all, other palettes such as color aren't dumbed down, so why expert typography?\n\n_I don’t think the Adobe implementation of the ‘case’ feature is a very good one, and you shouldn’t expect it to be followed by other app or system developers._\n\nEven though my font development is Mac and Adobe-centric (my graphic design background), your suggestion makes sense -- I am swayed by the lack of clarity surrounding Adobe's \"case\" command. Having said that, I am a lapsed Quark devotee, and am eagerly anticipating the XPress OpenType UI; but even if it is impeccable, I will still keep to using InDesign as the primary \"application target\" for my fonts.\n\n_...If this is as a single glyph, then this glyph should be included in the font and mapped ... in the ‘case’ feature lookup._\n\nI'll just map the problem lc accented characters directly to their non-accented cap versions, that way I won't have to create another 21 pre-composed glyphs.\n\n\\*\\*\\*\n\nSo: I'll implement Greek all-caps as a \"calt\" feature, and put the \"bug-fix\" in the \"case\" feature. I'll post my FontLab code once I have it figured out.\n\nThanks, John.\n\n"
    },
    {
      "time": "2 Jan 2006 — 8:12am",
      "content": "_I’ll just map the problem lc accented characters directly to their non-accented cap versions, that way I won’t have to create another 21 pre-composed glyphs._\n\nThe application is failing to correctly map some lowercase letters to uppercase letters with combining marks, as specified in the Unicode Standard Special Casing rules, so you are going to use glyph processing to map them, also incorrectly according to the standard, to unaccented uppercase glyphs and only when this bizarre lowercase-as-uppercase display function in InDesign is activated. If the user actually selects to change the text case, your lookup will have no effect.\n\nYou can't correctly support polytonic Greek without also supporting combining mark characters. If InDesign were to implement Special Casing support, Adobe's own polytonic Greek fonts would be unable to display the results (you'd get .notdef glyphs for the missing combining mark accents). So the first thing you should do is include the combining mark characters for all Greek accents and breathing marks. Then you should add those additional precomposed glyphs (unless you want to use the dynamic mark positioning approach, in which case you'll have to abandone FontLab for OTL development), and add 'ccmp' feature mappings for the base + combining mark sequences to these precomposed glyphs (to support correct Unicode special casing when it occurs). That is the only correct way to support polytonic Greek casing in all its potentialities.\n\n"
    },
    {
      "time": "2 Jan 2006 — 12:37pm",
      "content": "_That is the only correct way to support polytonic Greek casing in all its potentialities._\n\nI would like to be able to do things correctly, but I am also practically inclined.  \nI have as yet sold no Greek fonts and have no OEM contracts to design such; David Lemon of Adobe and Gerry Leonidas of Reading have persuaded me that there is a demand for Polytonic Greek, and despite my appraisal of the Greek market as commercially unpromising (a mere 25 million there, same size as Canada, plus assorted Greek scholars worldwide -- Cyrillic is a much larger market with less font complexity), I have plunged in and am attempting to do the right thing. But it keeps getting deeper and deeper!\n\nBeing practically inclined, I prefer to work from a functioning model, rather than principle, which would require a greater commitment to being a programmer (VOLT, Python scripting) than I am presently comfortable with. I have based my Greek character set on Minion and Gentium.\n\n_You can’t correctly support polytonic Greek without also supporting combining mark characters._\n\nHaven't I done that if I follow the Minion character set?\n\n_...you should add those additional precomposed glyphs_\n\nSo Greek all-caps would then work correctly in non-Adobe applications that don't use the \"case\" feature, such as perhaps the \"Lower Case to Caps\" command in MS Word? Does Word for Greek correctly implement this in Polytonic? I'm assuming it will, given your involvement with the ClearType project -- and the implication is that Adobe's Polytonic Greek fonts will have a \".notdef\" glyph behaviour.\n\n"
    },
    {
      "time": "2 Jan 2006 — 6:48pm",
      "content": "_But it keeps getting deeper and deeper!_\n\n[Yes](http://web.archive.org/web/20140911210557/http:/ptolemy.tlg.uci.edu/~opoudjis/unicode/unicode.html). [This website is an incredibly good resource for understanding Greek text encoding and display issues.]\n\n_I have based my Greek character set on Minion and Gentium._\n\nThen you should also limit yourself to what those fonts provide, which is support for standardised polytonic text. Anything beyond that is getting into things that are very unlikely to occur in the texts that most users will be working with, the sort of things that only my scholarly clients working with ancient manuscript sources are going to care about. If I were you, I would follow what Adobe has done with Garamond Premier Pro (not Minion Pro), and don't worry about trying to circumvent limitations in application casing support for characters that are not usually uppercased.\n\n'calt' feature support for de-accenting is a good idea, though, and something I would like to see standard in all polytonic Greek fonts.\n\n_Haven’t I done that if I follow the Minion character set?_\n\nNo. None of the Adobe fonts support combining marks for Greek. This is why they will break if Adobe does Special Case conversion correctly or, indeed, if people start normalising Greek text with full decomposition, as Unicode recommends.\n\n_So Greek all-caps would then work correctly in non-Adobe applications that don’t use the “case” feature, such as perhaps the “Lower Case to Caps” command in MS Word?_\n\nYes, if\n\na) the application applies Unicode Special Casing rules to map the unicameral lowercase diacritics to sequences of unaccented caps + combining marks, and\n\nb) if the font used has glyphs mapped for those combining marks and some mechanism to display the results in an acceptable way.\n\nAt the moment, Word (2003) is not correctly casing polytonic Greek at all. I am not beta testing Office 12, so do not know if this has been corrected or whether it now includes Special Casing support. It is the sort of thing that MS should be doing, and are capable of doing within their existing text processing architecture, I believe, based on what they are doing with complex character-level operations for other scripts.\n\nGentium does support Greek combining mark characters (U+0300–U+0301, U+0304, U+0306, U+0313—U+0314, U+0342–U+0345), so I would recommend following Victor in this regard rather than Adobe. However, Gentium does not have 'calt' support for de-accenting, while I believe the final version of Garamond Premier Pro got this right (I don't have the release version, only an earlier beta in which this was not working correctly).\n\nLater this month, I'll have a test version of SBL Greek ready, and can send it to you. It is pretty thorough in its polytonic coverage, including archaic letters and ancient and mediaeval editorial marks. I will break my glyph list down into different priority levels and post that information.\n\nThe MS CLearType fonts do not support polytonic, alas. There wasn't enough money in the phase one budget. I'm hoping this support will be added in a future update.\n\n"
    },
    {
      "time": "2 Jan 2006 — 8:41pm",
      "content": "_...and can send it to you_\n\nThat would be much appreciated.\n\nIn the meantime I'll figure out what the Font lab feature code is (with the extra 21 composite characters) and post it later on.\n\n"
    },
    {
      "time": "29 May 2006 — 10:48am",
      "content": "Based on the above discussion, I had a look at the substitution coding required for Polytonic, and it turned out to be more complicated than I had expected, requiring quite a bit of grammatical know-how to figure out what to do in multiple-vowel sequences.\n\nSo I've decided to limit the Greek case feature to monotonic.  \nEven there, I suspect that the feature is somewhat redundant, given the way monotonic is generally written.\n\nMy FontLab code:\n\nCLASSES\n\nUCtonos: Alphatonos Epsilontonos Etatonos Iotatonos Upsilontonos Omicrontonos Omegatonos\n\nUCnotonos: Alpha Epsilon Eta Iota Upsilon Omicron Omega\n\nFEATURE CODE  \nfeature case {  \n sub Iota by iota;  \n sub @UCtonos iota' by Iotadieresis;  \n sub iota by Iota;  \n sub Upsilon by upsilon;  \n sub @UCtonos upsilon' by Upsilondieresis;  \n sub upsilon by Upsilon;  \n sub @UCtonos by @UCnotonos;  \n} case;\n\n(This omits other parts of the case feature.)\n\n"
    },
    {
      "time": "20 Mar 2007 — 6:14pm",
      "content": "\\> _Okay, you have a word like ρωμέικα. [...]  \nThere are seven Greek diphthongs, and the above rules apply to all of them during case mapping (and also smallcaps): αι ει οι υι αυ ευ ου [...]  \nPerhaps someone else can express these lookups in FontLab/FDK syntax?_\n\nHere it goes:\n\n`feature calt {\n# First substitution that transforms ΡΩΜΈΙΚΑ into ΡΩΜΈΪΚΑ\n## for diphthongs αι ει οι υι\nsub [Alphatonos Epsilontonos Omicrontonos Upsilontonos] Iota' by Iotadieresis;\n## for diphthongs αυ ευ ου\nsub [Alphatonos Epsilontonos Omicrontonos] Upsilon' by Upsilondieresis;`\n\n`# Second substitution that transforms ΡΩΜΈΪΚΑ into ΡΩΜΕΪΚΑ\n## for diphthongs αι ει οι υι\nsub [Alphatonos Epsilontonos Omicrontonos Upsilontonos]' Iotadieresis by [Alpha Epsilon Omicron Upsilon];\n## for diphthongs αυ ευ ου\nsub [Alphatonos Epsilontonos Omicrontonos]' Upsilondieresis by [Alpha Epsilon Omicron];\n} calt;`\n\n"
    },
    {
      "time": "21 Mar 2007 — 12:14am",
      "content": "I just tried that in InDesign (CS1) and it didn't work.\n\n(I should add that my bit of code above works in case, but not in calt, with the same error as yours.)\n\n"
    },
    {
      "time": "21 Mar 2007 — 3:20am",
      "content": "You're right Nick, that code is flawed, sorry about that.  \n[Note to self: double-check before posting!!]\n\nThe good news is, it can be fixed easily. We'll just have to put each pair of substitutions in a separate lookup (which makes perfect sense!!). So here's the CORRECT VERSION of the code (tried in FontLab and it works):\n\n`feature calt {`\n\n`lookup ONE {\nsub [Alphatonos Epsilontonos Omicrontonos Upsilontonos] Iota' by Iotadieresis;\nsub [Alphatonos Epsilontonos Omicrontonos] Upsilon' by Upsilondieresis;\n} ONE;`\n\n`lookup TWO {\nsub [Alphatonos Epsilontonos Omicrontonos Upsilontonos]' Iotadieresis by [Alpha Epsilon Omicron Upsilon];\nsub [Alphatonos Epsilontonos Omicrontonos]' Upsilondieresis by [Alpha Epsilon Omicron];\n} TWO;`\n\n`} calt;`\n\nIt ought to work in InDesign now. Let us know. Thanks!\n\n"
    },
    {
      "time": "21 Mar 2007 — 4:47am",
      "content": "Miguel,  \nAren't you up a bit early for the west coast?  \nPerhaps you are up late, I should have said.\n\nChrisL\n\n"
    },
    {
      "time": "23 Mar 2007 — 10:10am",
      "content": "_It ought to work in InDesign now._\n\nNot yet.\n\n\\*\\*\n\nThere is another problematic \"monotonic\" character: upsilondieresistonos.\n\nSo this line of code would need to be added:\n\nsub upsilondieresistonos by Upsilondieresis;\n\nCLASSES  \nUCtonos: Alphatonos Epsilontonos Etatonos Iotatonos Upsilontonos Omicrontonos Omegatonos  \nUCnotonos: Alpha Epsilon Eta Iota Upsilon Omicron Omega\n\nFEATURE CODE\n\nfeature case {  \nsub Iota by iota;  \nsub @UCtonos iota’ by Iotadieresis;  \nsub iota by Iota;  \nsub Upsilon by upsilon;  \nsub @UCtonos upsilon’ by Upsilondieresis;  \nsub upsilon by Upsilon;  \nsub @UCtonos by @UCnotonos;  \nsub upsilondieresistonos by Upsilondieresis;  \n} case;\n\nYes, it should be in the \"calt\" feature, but this code works in \"case\" in InDesign, but not in \"calt\". Best I can do so far.\n\n"
    },
    {
      "time": "23 Mar 2007 — 11:12am",
      "content": "\\> _this code works in “case” in InDesign, but not in “calt”._\n\nHow are you ordering the features?  \nDo you have \"Contextual Alternates\" turned on? (Sorry, just a sanity check)\n\nThe only code I would put in 'case' is,\n\n`feature case {\nsub iotadieresistonos by Iotadieresis;\nsub upsilondieresistonos by Upsilondieresis;\n} case;`\n\nas these are the 2 monotonic Greek characters that are not capitalized by InDesign, when one applies \"All Caps\".\n\nThen I would order the features like this:  \n`case\ncalt`\n\nBTW, your code is affecting more than the 7 diphthongs. Etatonos, Iotatonos and Omegatonos shouldn't be part of your classes, for example.\n\n"
    },
    {
      "time": "23 Mar 2007 — 12:54pm",
      "content": "\\> The only code I would put in ‘case’ is,  \n\\> feature case {  \n\\> sub iotadieresistonos by Iotadieresis;  \n\\> sub upsilondieresistonos by Upsilondieresis;  \n\\> } case;  \n\\> as these are the 2 monotonic Greek characters  \n\\> that are not capitalized by InDesign, when one  \n\\> applies “All Caps”.\n\nMiguel,\n\nthis recommendation reads like you’re suggesting that OpenType features should be devised to acommodate for peculiarities of specific versions of specific applications. I would appreciate some clarification on this.\n\nRegards,  \nAdam\n\n"
    },
    {
      "time": "23 Mar 2007 — 1:11pm",
      "content": "This seems to be working OK now.\n\nCLASSES\n\n@UCtonos:  \nAlphatonos Epsilontonos Etatonos Iotatonos Upsilontonos Omicrontonos Omegatonos\n\n@UCnotonos:  \nAlpha Epsilon Eta Iota Upsilon Omicron Omega\n\n@GrCaps:  \nAlpha Beta Gamma uni0394 Delta Epsilon Zeta Eta Theta Iota Kappa Lambda Mu Nu Xi Omicron Pi Rho Sigma Tau Upsilon Phi Chi Psi Omega uni2126\n\nFEATURE CODE\n\nfeature calt {\n\nlookup ONE {  \nsub [Alphatonos Epsilontonos Omicrontonos Omegatonos] Iota' by Iotadieresis;  \nsub [Alphatonos Epsilontonos Omicrontonos Omegatonos] Upsilon' by Upsilondieresis;  \n} ONE;\n\nlookup TWO {  \nsub @UCtonos' @GrCaps by @UCnotonos;  \nsub @GrCaps @UCtonos' by @UCnotonos;  \n} TWO;\n\n} calt;\n\n"
    },
    {
      "time": "23 Mar 2007 — 2:10pm",
      "content": "_I would appreciate some clarification on this._\n\nYou'd think that the way to solve it would be to put the two odd characters in \"calt\", not \"case\", like so:\n\nsub @GrCaps iotadieresistonos' by Iotadieresis;  \nsub @GrCaps upsilondieresistonos' by Upsilondieresis;\n\nThat works in FontLab preview, but not in InDesign.  \nMust be some quirk of the casing mechanism.\n\nSo unless someone can come up with a way of making it work in \"calt\", the best practice is to put the two characters \"ignored\" by InD casing into the Case feature.\n\n"
    },
    {
      "time": "23 Mar 2007 — 5:26pm",
      "content": "\\> _this recommendation reads like you’re suggesting that OpenType features should be devised to acommodate for peculiarities of specific versions of specific applications. I would appreciate some clarification on this._\n\nI'm simply trying to help Nick to achieve what he wants. It doesn't mean I recommend it.  \n(If you play with Arno Pro in InDesign CS2, you'll see that nothing happens when you apply \"All Caps\" to ΐ [U+0390] or ΰ [U+03B0])\n\n"
    }
  ]
}
