{
  "id": "15980",
  "title": "Flock This!",
  "forum": "Miss Tiffany's blog",
  "tags": [

  ],
  "content": "I would normally not resort to such childish titles -- forgive me -- but it seemed worth it this time.\n\nFor those of you who don't want to pay for Ecto -- I did and really like it -- check out [Flock](http://web.archive.org/web/20131020171753/http:/www.flock.com/). It has -- among its plentiful promises of playtime -- a blogging tool. Yipee!\n\n",
  "author": "Miss Tiffany",
  "time": "2 Nov 2005 — 1:33am",
  "uid": "108",
  "comments": [
    {
      "time": "1 Nov 2005 — 6:25pm",
      "content": "Can you tell us more about this? The site itself is pretty vague to my 1 minute perusal...\n\nAlso you link is broken but maybe this will work\n\n[http://www.flock.com/](http://web.archive.org/web/20131020171753/http:/www.flock.com/ \"http://www.flock.com/\")\n\n"
    },
    {
      "time": "1 Nov 2005 — 7:31pm",
      "content": "Thanks Tiff. I already bought Ecto. But what the Flock, I'm game:-)\n\nChrisL\n\nPS: Check out Vince's Photoshop Tiff file at the bottom:  \n [http://typophile.com/node/15898#comment](http://web.archive.org/web/20131020171753/http:/typophile.com/node/15898#comment \"http://typophile.com/node/15898#comment\")\n\n"
    },
    {
      "time": "1 Nov 2005 — 8:59pm",
      "content": "Thanks for the heads up on both counts. Ecto's handy little \"smarten quotes\" features bugged up my link. Quel Bizarre! Speaking of bizarre, that picture of me is very scary.\n\nFlock could be where browsers are headed. It is really slow on my machine at work, but then again I'm running on an antique 400MHz.\n\n"
    },
    {
      "time": "2 Nov 2005 — 1:10am",
      "content": "how come I can't make a blog. I was an Uppercase member in version 1.0 and told that the memberships are not on since version 2.0 and never heard anything else.\n\nThen my membership date was reset to 0. so it is actually incorrect. why can you lot blog?\n\n"
    },
    {
      "time": "2 Nov 2005 — 5:19am",
      "content": "Vince,  \nWhat software are you using to set it up?\n\nChrisL\n\n"
    },
    {
      "time": "2 Nov 2005 — 7:51am",
      "content": "Window Xp, IE 6.0 or Firefox  \nsfuckhite' OSX Safari\n\n"
    }
  ]
}
