{
  "id": "15995",
  "title": "Towards an Opentype User's Guide, What to add?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "There is an interesting part of thread [http://typophile.com/node/15724](http://web.archive.org/web/20060409220708/http:/typophile.com/node/15724) people should see. (Look at the end where Mark posts his plans for his fonts and where Karsten has posted his little manual.)  \nI wonder if we all put our collective heads together, we could develop the primary needs for an Opentype guide/manual which type designers could post with their fonts. There are a great many Opentype bells and whistles which go unused just for lack of knowledge.  \nI am hoping this will end up as a document aimed at graphic designers and typographers who use type in more sophisticated ways than the typical word processor folks but not so geeky that people get lost or turned off by it.\n\nThe floor is open …\n\nChrisL\n\n",
  "author": "<a href=\"user/3135\" title=\"View user profile.\">dezcom</a>",
  "time": "<br>",
  "uid": "3135",
  "comments": [
    {
      "time": " 2 November, 2005 - 11:27am",
      "content": "I should add that it is aimed at users of type, not designers of type.\n\nChrisL\n\n"
    },
    {
      "time": " 2 November, 2005 - 11:52am",
      "content": "Here are some starter questions a user might have if there were Q&A sections:  \n1. How do I access fractions in my OpenType font? Will it build non-standard fractions for me?  \n2. What is the best way to get to Alternate characters?  \n3. Are lining figures always the default?  \n4. There are some discretionary ligatures that I want but others that I don’t. Can I do this?  \n5. Explain the contextual alternate process?  \n6. ?\n\nChrisL\n\n"
    },
    {
      "time": " 2 November, 2005 - 12:06pm",
      "content": "The Adobe OpenType readme seems to cover most of this - are we re-inventing the wheel here?\n\nCheers, Si\n\n"
    },
    {
      "time": " 2 November, 2005 - 12:14pm",
      "content": "Yes, I think the Adobe documentation is pretty good for the typical Latin typography font.\n\nSome fonts require pretty individualistic documentation. The user manual for the latest version of SBL Hebrew is 22 pages long.\n\n"
    },
    {
      "time": " 2 November, 2005 - 1:25pm",
      "content": "I’ll never joke again.\n\nThe Adobe OT Guide should be regarded as the standard document for OT users (and I refer to it too). Moreover, OT fonts should stick to the basic features and their functionality. So users can develop a feeling of familiarity with OpenType in general. Using terminology consistently would help too, think of “Std” or “Pro”, as would more standardized OT-feature interfaces.\n\nMy sole point in the other thread was Stylistic Set features which may differ in every font. Btw, it is an advantage that this is so.\n\nAs to the “starter question” however, you are right. I think that \\*if\\* a font differs from the (quasi)standard, this should be mentioned, so users know what they will get.  \nLike, are proportional osf & currency symbols the default ones? Prebuilt fractions only or arbitrary fractions? What does calt do? Even, what does the character set look like? Pro can mean quite different things from foundry to foundry - even if the term is applied correctly.  \nThis is not an encouragement to divert from (quasi)standards, but to make known if this is the case.\n\n"
    },
    {
      "time": " 2 November, 2005 - 1:47pm",
      "content": "“The Adobe OpenType readme seems to cover most of this”  \nThe Adobe readme is good but not what I was talking about and not intended as a replacement. Also, users don’t read it. You have to bundle it with fonts to have a prayer. Also, it is Adobe’s. Would other foundries want to send you to Adobe’s type site or bundle Adobe literature with their own fonts? I doubt it.  \nThe premiss for my question is: Why do so few people seem to know about the features of the fonts that they purchase? What would help in that area? Would this not help add to the feeling of VALUE in typefaces that go the extra mile?  \nI am thinking about something that would be modified for every new typeface that would be BUNDLED with the typeface and explain its individual features. It would be Chinese menu style with assortments of mix and match text blocks that type designers and foundries could customize on a case by case basis.  \nLook at Karsten’s “manual”. It is a start.\n\nChrisL\n\n"
    },
    {
      "time": " 2 November, 2005 - 3:48pm",
      "content": "“This is not an encouragement to divert from (quasi)standards, but to make known if this is the case.”\n\nBrilliant!\n\nWhat he said.\n\nI am just trying to “make it known”.\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 8:39am",
      "content": "I guess if I am going to mention Karsten’s link, I should at least provide it:  \n [http://www.kltf.de/downloads/KLTFTiptoeManual.pdf](http://web.archive.org/web/20060409220708/http:/www.kltf.de/downloads/KLTFTiptoeManual.pdf)\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 8:56am",
      "content": "I should also post a link to OpenType feature a lá Typotheique:  \n [http://www.typotheque.com/static/opentype\\_features/](http://web.archive.org/web/20060409220708/http:/www.typotheque.com/static/opentype_features/)\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 12:01pm",
      "content": "I thought I would popst some other resourse links. Feel free to join in and add yours:\n\nAdobe Features: [http://studio.adobe.com/us/type/main.jsp?xhtml=opentype/main#feat](http://web.archive.org/web/20060409220708/http:/studio.adobe.com/us/type/main.jsp?xhtml=opentype/main#feat)\n\nAdobe read me: [http://store.adobe.com/type/browser/OTReadMe.html](http://web.archive.org/web/20060409220708/http:/store.adobe.com/type/browser/OTReadMe.html)\n\nAdobe Q&A: [http://studio.adobe.com/us/type/main.jsp?xhtml=opentype/qna](http://web.archive.org/web/20060409220708/http:/studio.adobe.com/us/type/main.jsp?xhtml=opentype/qna)\n\nEastman article: [http://media.studio.adobe.com/pdfs/en\\_US/studio/type/opentype/CA-Aug02.pdf](http://web.archive.org/web/20060409220708/http:/media.studio.adobe.com/pdfs/en_US/studio/type/opentype/CA-Aug02.pdf)\n\nCreative Pro: [http://media.studio.adobe.com/pdfs/en\\_US/studio/type/opentype/CA-Aug02.pdf](http://web.archive.org/web/20060409220708/http:/media.studio.adobe.com/pdfs/en_US/studio/type/opentype/CA-Aug02.pdf)\n\nMicrosoft standards: [http://www.microsoft.com/typography/developers/fdsspec/overview.aspx](http://web.archive.org/web/20060409220708/http:/www.microsoft.com/typography/developers/fdsspec/overview.aspx)\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 12:10pm",
      "content": "Dez, why not a wiki entry with all this stuff? I think that would be useful (too).\n\n"
    },
    {
      "time": " 3 November, 2005 - 12:14pm",
      "content": "Tiff,  \nI was kinda hoping to drum up some interest first. Seems like no takers so far :-\n\n"
    },
    {
      "time": " 3 November, 2005 - 12:16pm",
      "content": "You can always move it.\n\n"
    },
    {
      "time": " 3 November, 2005 - 12:18pm",
      "content": "“You can always move it.”  \nHow do I do that?\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 12:35pm",
      "content": "Thanks Tiff!\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 1:43pm",
      "content": "Some more links:\n\n[www.kltf.de/downloads/OpenTypeResources-kltf.pdf](http://web.archive.org/web/20060409220708/http:/www.kltf.de/downloads/OpenTypeResources-kltf.pdf)\n\n(It will be updated from time to time,  \nthough I try to keep it concise.)\n\n"
    },
    {
      "time": " 3 November, 2005 - 1:49pm",
      "content": "Thanks Karsten!\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 1:49pm",
      "content": "Here is P22s take:  \n [http://www.p22.com/support/Opentype.html](http://web.archive.org/web/20060409220708/http:/www.p22.com/support/Opentype.html)\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 1:51pm",
      "content": "Here’s my “dream tool”. Think of it from the point of view of end-user usability, as interactive, not a static pdf.\n\nAt the moment, the best gizmo to check out the features of an OT font is the OpenType Preview panel in FontLab.\n\nDown the left are the buttons for the features (although the names could be spelled out in full).  \nThere are two large fields where you can enter text.  \nThe top one (“source”) shows the font plain, the bottom one (“result”) shows it with the OT feature activated by selecting a button at left.\n\nThis gizmo could be “loaded” for a particular font, so that the default text string for each feature shows the glyphs (or some of them) where the feature is present.\n\nIt’s awkward to put your new OT font through its paces in InDesign, because the OT menu is buried, and because some InD commands, such as small caps, don’t tell you whether the feature is true OT or not, (At least, that’s how it is on CS 1 — I have just licensed some fonts to an outfit running Quark 3.5 on Mac OS 9.1, which suggests to me that a stand-alone OT previewer that comes with the font would be preferable to relying on graphics applications for demonstrating font features.)\n\nI’ve suggested to several font distributors that this would be a good tool to have online. I wish I had the know-how and resources to implement something like this.\n\n"
    },
    {
      "time": " 3 November, 2005 - 1:51pm",
      "content": "MyFonts has a section as well:\n\n[http://www.myfonts.com/info/opentype/](http://web.archive.org/web/20060409220708/http:/www.myfonts.com/info/opentype/)\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 1:57pm",
      "content": "Unicode from the horses mouth:\n\n[http://www.unicode.org/glossary/index.html](http://web.archive.org/web/20060409220708/http:/www.unicode.org/glossary/index.html)\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 1:58pm",
      "content": "“Here’s my “dream tool”. Think of it from the point of view of end-user usability, as interactive, not a static pdf”\n\nTerrific Nick!\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 2:00pm",
      "content": "House Industries’ Ed Interlock test drive on their website implements (at least) the contextual substitution feature. I think the Letterror guys helped them implement it using Python on the server. Underware has a similar thing for their Bello test drive.\n\n[http://www.houseind.com/index.php?page=showfont&id=150&subpage=lettersetter](http://web.archive.org/web/20060409220708/http:/www.houseind.com/index.php?page=showfont&id=150&subpage=lettersetter)\n\n[http://www.underware.nl/site2/index.php3?id1=bello&id2=testbello](http://web.archive.org/web/20060409220708/http:/www.underware.nl/site2/index.php3?id1=bello&id2=testbello)\n\n"
    },
    {
      "time": " 3 November, 2005 - 2:02pm",
      "content": "Thanks Mark for hangin’ out your Underware :-)\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 2:10pm",
      "content": "Those are very nice. Especially Underware’s.\n\n"
    },
    {
      "time": " 3 November, 2005 - 3:19pm",
      "content": "Karsten’s PDF has a very good list of sources.\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 3:36pm",
      "content": "Hello Nick! Underware’s tester seems to be close to  \nwhat you want. (I have not recognized it before.)\n\nThe idea is really good take alone for “educational”  \npurposes: the before/after or with/without offers  \nkind of first hand experience of what OT features  \nare.  \nWould be a nice addition to any font management  \n/ font purchase application.\n\nMost of all, it shows what you’ll \\*miss\\* if you use  \nthe wrong software. ;-)\n\n"
    },
    {
      "time": " 3 November, 2005 - 4:15pm",
      "content": "“Most of all, it shows what you’ll \\*miss\\* if you use  \nthe wrong software. ;-)”\n\nHmmm, Seems to be a hint in there somewhere;-\\>\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 4:23pm",
      "content": "I passed Nick’s dream tool spec over to Filip Fortes ( [http://fortes.com/daily](http://web.archive.org/web/20060409220708/http:/fortes.com/daily)) - I think it would be easy to create such a tool using Avalon - check out some of the XAML code posted on his blog.\n\nSi\n\n"
    },
    {
      "time": " 3 November, 2005 - 4:38pm",
      "content": "Very cool Si!  \nI think you and Nick are on to something with enough pizzzazz to actually get used!\n\nChrisL\n\n ![](http://web.archive.org/system/files?file=numbersub.gif)\n\n"
    },
    {
      "time": " 3 November, 2005 - 5:14pm",
      "content": "This sounds a little like the Multiple Master Tool that ATM came with; it showed as many axes as a font had, with sliders to select instances from what was actually available. That convention of letting the utility flex to fit the design’s feature set would be cool.\n\nKnowing that OT font features may vary from one design to another, maybe this tool could accomodate some starter text that the type designer specifies, which will show the features individually and in combination. If the design has a lot of swash, or ligatures, or specific goodies, that could be part of the starter text. I have a few features planned for an upcoming release which, when used together, multiply the options. I’d like to illustrate those combinable features from the start as well. How to display this elegantly? I agree the separate feature buttons are good, and the before/after split screen is a must. Maybe the tool’s default is to start up with all the compatible features on, and the user can switch them off at their discretion.\n\nI have to say, I think it would be so very nice if this tool was open-source or made freely available to all foundries; it will benefit smaller foundries the most. Could be a free download from everyone’s website. Think iTunes here….\n\n"
    },
    {
      "time": " 3 November, 2005 - 5:35pm",
      "content": "Carl,  \nIt should be Open-source indeed. This would be a marketing tool anyone could use and would benefit the entire industry. At last, we could demonstrate the VALUE added in good type design.  \nI hope you will share your progress with us all here and that we all will do the same.\n\nChrisL\n\n"
    },
    {
      "time": " 3 November, 2005 - 7:15pm",
      "content": "A feature like that would fit perfectly into a font management utility like FontExplorer. They’ve already got the iTunes thing going for it. Of course, there’s no reason why something like this couldn’t be a standalone app (i.el, open-source or whatever).\n\n"
    },
    {
      "time": " 3 November, 2005 - 10:17pm",
      "content": "Thanks Si.  \nYes, Karsten, Underware have got it up and running, with a few features.\n\n"
    },
    {
      "time": " 4 November, 2005 - 3:16pm",
      "content": "“Underware have got it up and running, with a few features”\n\nYes, it now has an expanding pouch :-)\n\nChrisL\n\n ![](http://web.archive.org/system/files?file=whitytighty.jpg)\n\n"
    },
    {
      "time": " 4 November, 2005 - 3:53pm",
      "content": "“At the moment, the best gizmo to check out the features of an OT font is the OpenType Preview panel in FontLab.”\n\nThe normal user, fortunately, has the glyph palette of ID with a pull down menu to show all the those characters native to the various features… Remind me to remind them to roam.\n\nAt least that’s the best we can do until the “other shoe drops”…(thought bubble: I wonder if MS apps.’l be using the same list of feature names as Adobe?, and when…)\n\n"
    },
    {
      "time": " 5 November, 2005 - 6:46am",
      "content": "Though the glyph palette only shows the relevant glyphs, but not how the feature works.\n\n“(thought bubble: I wonder if MS apps.’l be using the same list of feature names as Adobe?, and when…)”\n\nThis is one point.  \nAnother is if applying same features will deliver the same results. ;-)\n\n"
    },
    {
      "time": " 5 November, 2005 - 7:11am",
      "content": "Adobe and Microsoft worked on the standard together. Adobe seems to have done the heavy lifting in the implementation arena. One would hope that the nature of their collaborative venture would induce Microsoft to play ball by the same rules. That is not to say that Microsoft has never interpreted standards their own way before but in this case, I can’t see why they wouldn’t stay with Adobe on this since the work is already done.\n\nChrisL\n\n"
    },
    {
      "time": " 5 November, 2005 - 7:28am",
      "content": "_Adobe seems to have done the heavy lifting in the implementation arena._\n\nWell, i’m not sure that’s so fair to say. I don’t know about using foreign languaes in Adobe apps much, but if you’re using devanagri in word, it’s amazing to watch all the automatic ligatures pop into place. it seems to me that adobe has implemented feature support for typographic features fairly quickly. i think microsoft has been for several years developing language support for its apps. i assume that the next release of windows and office products will have greater implementation of OT features both language and typographic, at least i hope they do…\n\n"
    },
    {
      "time": " 5 November, 2005 - 8:30am",
      "content": "Paul,  \nI was refering to the design/publishing part—the high-end user. This of course is Adobe’s main customer base. I didn’t mean that Microsoft was sitting on their hands. I aplaud their language support e4fforts as well.\n\nChrisL\n\n"
    },
    {
      "time": " 5 November, 2005 - 8:32am",
      "content": "i luv the fonetik spelling uv e4ffort. ;^P\n\n"
    },
    {
      "time": " 5 November, 2005 - 8:39am",
      "content": "I forgot to leave off the “ff” though:-)\n\nChrisL\n\n"
    }
  ]
}
