{
  "id": "1599",
  "title": "Get Gill Sans Free",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Oh my god, this person has no idea.   \n   \nIn order to allow the user to view her site the way she intended, she offers the fonts she's used to anyone who wants them for free....clueless!   \n   \n [http://www.mynameiskate.com/](http://web.archive.org/web/20120415131147/http:/www.mynameiskate.com/)\n\n",
  "author": "union",
  "time": "11 Oct 2003 — 5:43pm",
  "uid": "614",
  "comments": [
    {
      "time": "11 Oct 2003 — 8:36pm",
      "content": "What about the Mac users? Will they not be able to see the site as she intended?   \n:D\n\n"
    },
    {
      "time": "11 Oct 2003 — 10:01pm",
      "content": "I've just sent her an email. I suggested if she took 'em down right away I wouldn't say anything to Monotype....   \n   \nAmazing that she's so clueless, seeing as she works in tech support and used to do DTP.   \n   \nT\n\n"
    },
    {
      "time": "12 Oct 2003 — 3:15pm",
      "content": "OKay, I'm sorry, but are we going to become the font police all the sudden?   \n   \nSure, she shouldn't be doing it, but come on. Sending a letter suggesting her to take them down is fine, but threatining to call Monotype on her, isn't that going a little too far?   \n   \n   \nYou can put your monotype email addresses back in your rolodex anyway, considering she's taken them down.\n\n"
    },
    {
      "time": "12 Oct 2003 — 4:29pm",
      "content": "I thought it was kinda cute.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Oct 2003 — 7:07pm",
      "content": "Chris:   \n   \nNormally if I found a web site illegally distributing pirated fonts, I would simply inform the relevant foundry or foundries, and let them deal with it. As far as I'm concerned, I'm doing her a big favor by simply sending her a private email. It is a lot less intimidating than getting a letter from a lawyer, which is what many larger foundries do as their first step.   \n   \nNobody is making YOU fight crime. But you can take a hike if you are suggesting that there's something wrong with me suggesting obeying the law in such a gentle fashion with people who threaten the livelihoods of me and my colleagues who make typefaces.   \n   \nT\n\n"
    },
    {
      "time": "12 Oct 2003 — 7:16pm",
      "content": "\\> you can take a hike   \n   \nPlease desist from using such highly offensive language, otherwise I'll have   \nto stop ignoring the fact that you're not ignoring all my posts to Typophile... ;-\\>   \n   \nhhp\n\n"
    },
    {
      "time": "12 Oct 2003 — 8:56pm",
      "content": "Thomas, considering that her site is a measly little personal site, and that it hasn't been updated in several months, I question the fact that her and her two files are seriously impinging on your livelihood or anyone else's for that matter. We're probably the most traffic she's gotten this past year.   \n   \nAlso, I did not say there was anything wrong with you; please reread my original statement before taking things to the level of ad hominem.   \n   \nNow that being said, I could see it if she had tens or hundreds of fonts and was advertising \"FREE FONTS HERE\", but she wasn't. To threaten to call Monotype on her for two files is not doing her a favour. Threats for anything are obscene, especially if you come out with one your first time up to bat.\n\n"
    },
    {
      "time": "12 Oct 2003 — 11:49pm",
      "content": "I disagree with your final analysis, Chris. I think the full potential ramifications of distributing fonts illegally should be plainly stated up front. This is not a threat, it is a warning of legal culpability, and it should be delivered 'your first time up to bat'. Stringing someone along in a protracted negotiation about their offering of someone else's property without warning them in no uncertain terms of the consequences of their actions is not doing them any favours. While you're faffing around trying to be nice, someone else might have already alerted Monotype, without benefit of a warning.\n\n"
    },
    {
      "time": "13 Oct 2003 — 1:26am",
      "content": "Well Tomas gets my vote on that one. He is too kind.   \n   \nIf that little misfit gives a beer for a typo I figure Tomas should get a life time supply of this groggy stuff.   \n   \n [http://www.pyramidbrew.com/beer/beerguide.php](http://web.archive.org/web/20120415131147/http:/www.pyramidbrew.com/beer/beerguide.php)   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "13 Oct 2003 — 1:31am",
      "content": "I guess he gets another one of those brewskies because I spelled Thomas wrong?   \n   \nSorry, back to the coffee pot.   \n   \nGerald\n\n"
    },
    {
      "time": "13 Oct 2003 — 2:30am",
      "content": "Her site may be a small personal site, but it came up number 3 in a google search on something fonts related I was after.   \n   \nI am keen to go get together a possie and hit some proper font pirates, Limewire anyone?\n\n"
    },
    {
      "time": "13 Oct 2003 — 6:49am",
      "content": "Jim, I'm sure the RIAA would love to have you on board...\n\n"
    },
    {
      "time": "13 Oct 2003 — 8:00am",
      "content": "haha... I think there is huge difference between riping off Madonna with her millions and ripping of Atomic Media a small foundry who as far as I know don't have millions. (see Limewire)   \n   \nA friend of mine who runs a big London design agency asked me why I started Union, when 'no one buys fonts anymore'....\n\n"
    },
    {
      "time": "13 Oct 2003 — 8:32am",
      "content": "Related anecdote:   \nA friend of mine was emailed to not use his band name by someone who claimed that they got it first and used it in recordings, etc. The guy worked/ works at BMG, and felt the need to draft a threatening legal letter.   \n   \nAs a result, my friend, feeling unduly threatened, responded in a harsh, unappreciative tone and it turned into a (verbal) fight. Ultimately, it wasn't even an issue, as the band had already parted ways, but the whole thing could have been resolved nicely had the guy just said, \"You know, I have a band with the same name. Are you guys still together? Because we are, and we want to use the name we've recorded under since 19XX.\" He presumed that there would be a fight, rather than presuming that they could talk like adults and come to an understanding.   \n   \nI'm interested to see if she'll respond, and if so, how she'll respond.\n\n"
    },
    {
      "time": "13 Oct 2003 — 11:07am",
      "content": "\"A friend of mine who runs a big London design agency asked me why I started Union, when 'no one buys fonts anymore'....\"   \n   \nThat's a very valid question.   \n   \nDon't get me wrong...stealing is stealing, but the reality is the digital age has changed things while the business side is still finding it tough to accept that fact and react appropriately.\n\n"
    },
    {
      "time": "13 Oct 2003 — 11:27am",
      "content": "Chris its interesting that you wanted to resolve the dispute acting as one adult talking to another. I'm a recreational bicycle racer and when I have to deal with cars that have road rage, I do a few things, if are swearing at me I either wave to them and say \"have a nice day\" or if I can catch them at a light I remind them I'm an adult and lets talk as adults or I pretend not to know english and thank them for their insults (I look German), you know what the reaction usually is, they get even madder, because they can't get you into an emotional state. Dan\n\n"
    },
    {
      "time": "13 Oct 2003 — 11:39am",
      "content": "When I get into a shoving match in traffic and eventually get my way, I smile and wave thank you, as if they graciously let me go ahead first. Man does that piss them off!   \n   \nhhp\n\n"
    },
    {
      "time": "13 Oct 2003 — 12:12pm",
      "content": "Yeah, the 'have a nice day' response is great (speaking generally, since I'm not a bicyclist). The people who leap to agressive/ obnoxious responses often want you to validate their choice by responding in kind. The look on their face when they realize they're powerless to push you is great.\n\n"
    },
    {
      "time": "13 Oct 2003 — 12:17pm",
      "content": "In Paris you don't get the chance to say 'have a nice day'. They run you over first, ask questions later. Mind you, I was nearly run over by a cyclist once. He ended up throwing his bike at me.   \n   \nM.\n\n"
    },
    {
      "time": "13 Oct 2003 — 12:23pm",
      "content": "There's this story about an Armenian poet from the turn of the [previous] century who was a Stoic. He got in a carriage accident in Constantinople, and the other guy ended up twisting his arm to the breaking point. He says: \"Please don't break my arm - I need it to write.\"   \n   \nhhp\n\n"
    },
    {
      "time": "13 Oct 2003 — 1:03pm",
      "content": "\\>thank them for their insults   \n   \nChrist, you guys make me wish I was a nicer fella while cycling. But here in Chicago, the [motorists just kill you](http://web.archive.org/web/20120415131147/http:/www.chicagocriticalmass.org/mcbride_main.html). Then the cyclist kill the pedestrians (can't find a link to _that_ wonderful story). I suppose it works like the food chain...\n\n"
    },
    {
      "time": "13 Oct 2003 — 1:44pm",
      "content": "i don't understand the Monotype threat issue. As said, it wasn't hard to say \"hey, it's forbidden to do this, you know, if a dork see it, he could be mean\". Or a font value moralisation i could understand too.   \nDelation. Nice thing. Make me think of other ages.\n\n"
    },
    {
      "time": "13 Oct 2003 — 2:36pm",
      "content": "Nathan, the most dangerous place to ride a bike in the US is Florida. A woman plowed into a group of 40 cyclists in Fla killing 20+ her defense: I didn't see them. The Manhattan cycling scene is huge. My club Century Road Club Association is the largest club in the country and the oldest. Most of the riding here is on a Rte 9W that goes north to Canada. Go figure\n\n"
    },
    {
      "time": "13 Oct 2003 — 2:52pm",
      "content": "Maybe there should be a \"Typographers who cycle\" thread...   \n   \n\\>Rte 9W that goes north to Canada   \n   \nLast summer I rode to Toronto and I must say that cycling in Canada was some of the best I've had. I may well move to the Great White North one day - but luckily I _never_ plan on relocating to Florida.   \n   \nSorry for continually fecking up this thread Jim :-/\n\n"
    },
    {
      "time": "13 Oct 2003 — 5:03pm",
      "content": "Florida is okay, just don't move where the retirees are.   \n   \nThere aren't many in Orlando, but down in Boca, Ft. Lauderdale, etc...that's where you have to watch out.   \n   \nBoca Raton: where jews and canadians go to die.\n\n"
    },
    {
      "time": "13 Oct 2003 — 8:11pm",
      "content": "_A woman plowed into a group of 40 cyclists in Fla killing 20+ her defense: I didn't see them._   \n   \nWhen was this? I didn't hear about it, and couldn't find any information online. Can you direct me to a news story?\n\n"
    },
    {
      "time": "14 Oct 2003 — 6:11am",
      "content": "John that article was last year sometime, In NYC metro area we loose about 2 people to cars a year. The motorists are almost never charged. The reason, its the I didn't see them defense. Its a really small percentage being the couple of thousand riders in Manhattan alone. Dan\n\n"
    },
    {
      "time": "11 Oct 2003 — 11:16pm",
      "content": "Jim, you should warn us before linking to sites like this.   \nOne should pluck before photographing their face that   \nclose.\n\n"
    }
  ]
}
