{
  "id": "16004",
  "title": "some thoughts on a business card(update)",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hey, here is a revised set. Im liking the back monogram and am thinking of using this on the front,what do you guys think of lines i added?(to the front )  \nAnd as for a picture of the jewelry,i dont have any sorry,but i can tell you its very busy with a collection of different shells,im trying to emphasise the hand made quality of it but also put it into a professional context,so that is why i thought of hadriano because it is a sturdy type face but the 'a' still has character. So i thought that the packaging and card should complement the jewllery without mimicking its visual aspects.  \nI hope this makes sense!?  \n-Al  \n/edit/ Hey i have posted a new card still final touches to be made but i have added colour,i should have explained earlier that this is for a family friend,and the card u see is the front and the back,i also have made some stickers which will be used on lime green/light blue packaging,and there is a price tag sticker there too but its a bit wierd(the paua shell)  \nAnd the whole punch idea is good,but i think its alittle time consuming,but gave me some ideas as to showing the product through it as these cards and stickers will be placed on or with the neclaces,earings e.t.c.  \nthanks alot for all of the helpful input,its been better than bad its good.  \nAl (as in Alistair-a guy) :)  \nps is it 'jewellery' or' jewelry'....?\n\n| Attachment | Size |\n| --- | --- |\n| [kt\\_businesscard copy.jpg](http://web.archive.org/web/20131018070543/http:/typophile.com/files/kt_businesscard%20copy.jpg) | 40.24 KB |\n| [kt\\_businesscard.pdf](http://web.archive.org/web/20131018070543/http:/typophile.com/files/kt_businesscard.pdf) | 348.73 KB |\n| [kt\\_card copy.jpg](http://web.archive.org/web/20131018070543/http:/typophile.com/files/kt_card%20copy.jpg) | 80.72 KB |\n\n",
  "author": "guncry",
  "time": "2 Nov 2005 — 2:00pm",
  "uid": "9952",
  "comments": [
    {
      "time": "2 Nov 2005 — 2:15pm",
      "content": "A few things. One: When you post a communication you shouldn't sound like a hip hop rapper. Please use proper sentences. Two: that is an expensive card, a full bleed card, plus it paints you into a corner it terms of other communications. Their is no flexibility with that design. Three: In the future being a web designer please post your images in web frendly formats like jpg and gif.\n\n"
    },
    {
      "time": "2 Nov 2005 — 2:33pm",
      "content": "thats good ,thanks Dan i noticed others had posted stuff in pdf format thats why i did it,but i will take note for next time.  \ni agree with the fact that there is no flexability with the design, but by 'full bleed' where you refering to the fact it has photos on the back?\n\nhi ho hi ho its back to the drawing board i go\n\n"
    },
    {
      "time": "2 Nov 2005 — 2:33pm",
      "content": "I know we have been down this road before, Dan, but I (and many others) prefer a PDF. It makes it so much easier to inspect details. So alow me to 'axe' number three.\n\n"
    },
    {
      "time": "2 Nov 2005 — 2:35pm",
      "content": "I'm not sure why a full bleed card would 'make a card expensive' either.\n\n"
    },
    {
      "time": "2 Nov 2005 — 2:40pm",
      "content": "Kyle, I started in production before design and I know a lot about printing. That bleed card if its for more than one person will push printing costs up at least 10% and in this economy thats a lot.\n\n"
    },
    {
      "time": "2 Nov 2005 — 2:53pm",
      "content": "I quite like the arrangements of the dots, maybe you could get a bit more mileage out of that. As for the typography, the 4th example (Castellar?) doesn't seem appropriate (Not that I've read the brief). For some reason I'm drawn to the second option (not sure what the font is) but would prefer to see the tagline in Avenir-Light as per 3rd example.\n\nAlso, you might want to resonsider the contact details, I can appreciate the contrast that you're trying for with the san/serif used next to each other, but it doesn't seem to be working.\n\nThats my 2 cents worth.\n\nShaun\n\n"
    },
    {
      "time": "2 Nov 2005 — 2:54pm",
      "content": "It depends on the print shop you use. The shop I work for doesn't charge any more for bleeds.\n\n"
    },
    {
      "time": "2 Nov 2005 — 2:58pm",
      "content": "In context I like the breathing holes. Without reading what they were the card makes no sense.\n\n"
    },
    {
      "time": "2 Nov 2005 — 2:58pm",
      "content": "I also haven't come across extra charge for bleed, a lot of places that I've dealt with request it. I'm guessing, but if the client is wanting 4 colour anyway cost might be an issue?\n\n"
    },
    {
      "time": "2 Nov 2005 — 3:00pm",
      "content": "Agreed, the holes are a clever play, very recognisable in New Zealand.\n\n"
    },
    {
      "time": "2 Nov 2005 — 3:04pm",
      "content": "thanks shaun,yeah its Castellar and i dont much like that either,i was originally going for the second one(the type is hadriano light).But it didnt seem to look as clean,what i might do is shrink the top line and replace the tagline with avenir light as you suggested. im gonna spend some more time on the basics first.\n\ncheers  \nAl\n\n"
    },
    {
      "time": "2 Nov 2005 — 3:10pm",
      "content": "I'd love to see some of the jewelry. I would think the jewelry would act as precedent for the design and further for the typeface.\n\n"
    },
    {
      "time": "2 Nov 2005 — 3:16pm",
      "content": "Among those I like the first one (on the top) but take care of the space before the colons and the spacing of \"Email\" and the @ sign is shifted up, and I don't like the back, do you need the back of the card, though I like the monogram (but not in a circle).\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "2 Nov 2005 — 3:37pm",
      "content": "you guys are great!(and girls)  \nthanks for the help.\n\n"
    },
    {
      "time": "2 Nov 2005 — 5:05pm",
      "content": "Looking good, I prefer the second version for the simplicity of the graphic, and still am leaning toward Hadriano - but the kerning needs to be altered to balance out the spacing between the letters as it appears uneven.  \nGood Work\n\n"
    },
    {
      "time": "2 Nov 2005 — 11:45pm",
      "content": "Well, I think as you are a jewel designer you are the best one who knows which fonts to use. But I will tell you how I think your card would look better for me.  \nat backgrounds I like first one at top. I would prefer to make \"K\" darker than the illustration in its background, you may even make it black, so you can balance with the huge white space more. You may try also to resize that jewel illustration to make it bigger and make part of it as if it is out of the card { it is just a suggestion here }.\n\nFor the front face, I disagree with the illustration at first card at top, circles over darkbackground can have many meanings, something like stars or globes in sky, may be?  \nthe one at bottom which contains same circles with one line is a nice gemotrical abstract for jewellery, it tells me that you are simple and modern. You still base your jewels on circle shape only, why not a polligrame or triangel also, or any shape which is entitled to jewels? if you want circles only because it is related to your style, or any reason I think your name should have to change the idea of writing your name with normal font, you may go to some display font which has a cirlce gemotric basic.. I suggest here an idea: what about making letters of your name as jewels and make the line pass them instead of passing some circles? that may require the name to be bigger in scale, and require a new, less effortive, and better orgnized layout.\n\nI would recommend the text to change in some parts to be like: Tel. Mob. E-mail/Email/email. + \"New Zeland designer jewellery\" that way and in italic. It will be fine if you use a serif font for it either. And I recommend to be sure of leading between lines because the spaces between lines aren't look equal for me in your information area.\n\n"
    },
    {
      "time": "3 Nov 2005 — 7:20am",
      "content": "I think it looks great, and I\"m talking about the .jpg you posted.I think you could look at the type, but I think you're pretty close. I would work on the informational type that is now in the sans serif, either make it flush with the other information or move it enough so it isn't \"almost\" flush. I don't know if you're going to hole punch the holes or not, but that would be a nice touch. The lines are great. Don't show photos of the product on the business card. Keep in ambiguous enough that it doesn't get outdated. I wouldn't change too much on this, it's clean, simple and elegant. How about instead of black doing a metallic silver or bronze? Overall, a great job.\n\n"
    },
    {
      "time": "3 Nov 2005 — 12:33pm",
      "content": "I would rather sound like a hip hop rapper than be someone who doesn't know the difference between their and there (as in \"their is no flexibility in that design\"). Just my opinion...\n\n"
    },
    {
      "time": "3 Nov 2005 — 4:19pm",
      "content": "I think the first example (the black card with the more free-flowing beads) is MUCH more evocative and enticing. The beads in the form of the necklace (the gray version) seems forced and predictable.\n\n"
    },
    {
      "time": "3 Nov 2005 — 7:47pm",
      "content": "i wish i was a hip hop rapper,like one of those 'hip hops' that is also a 'rapper'.  \n...yo\n\n"
    },
    {
      "time": "3 Nov 2005 — 7:54pm",
      "content": "I once rapped my hip on the corner of a table. Yow! Yo.\n\n"
    },
    {
      "time": "3 Nov 2005 — 8:11pm",
      "content": "word\n\n"
    },
    {
      "time": "5 Nov 2005 — 10:32pm",
      "content": "Why should we be friendly to the web? Shouldn't the web be friendly to its users? Maybe you should think of that too...when you’re designing your websites.\n\nNow guncry, I think the front and the back are at odds. One side is static and the other is dynamic. One of the versions you produced looked more like a topography map than the desired jewel chain. I think to use a different font for “New Zealand designer jewelry” is a bad idea, keep consistent, and legible. Check it…\n\n“Hey, Keep San Antonio Lame!”\n\n ![](http://web.archive.org/web/20131018070543im_/http:/typophile.com/files/kt_businesscard2.jpg)\n\n"
    },
    {
      "time": "5 Nov 2005 — 10:33pm",
      "content": " ![](http://web.archive.org/web/20131018070543im_/http:/typophile.com/files/kt_businesscard2.jpg)\n\n"
    },
    {
      "time": "6 Nov 2005 — 2:47am",
      "content": "Jewellery is correct, Jewelry is an American spelling. I think the KT ligature could do with some more work to make it more convincing. I like the paua shell shape, it could even be used for the business card.  \nTim\n\n"
    }
  ]
}
