{
  "id": "16002",
  "title": "bad quality fonts in freehandmx",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hey there,i was wondering if anyone has run into this problem before and whether ya'll know how to fix it.  \nMy fonts are all edgy and pixelated within freehand so it is a nightmare trying to get it looking nice,the only way i can check it is by creating a pdf and viewing it in Acrobat.I have fiddled with the preview modes in freehand and also looked at the minimum readability thing in my system preferences.  \nbah! any help would be greatly appreciated.  \n-Al\n\n| Attachment | Size |\n| --- | --- |\n| [crap.jpg](http://web.archive.org/web/20131014223916/http:/typophile.com/files/crap.jpg) | 70.61 KB |\n\n",
  "author": "guncry",
  "time": "2 Nov 2005 — 12:28pm",
  "uid": "9952",
  "comments": [
    {
      "time": "2 Nov 2005 — 12:40pm",
      "content": "This could be stating the obvious, but it looks like you have anti-aliasing turned off.\n\n"
    },
    {
      "time": "2 Nov 2005 — 12:40pm",
      "content": "Do you have ATM running? What is your OS setup?\n\n"
    },
    {
      "time": "2 Nov 2005 — 12:41pm",
      "content": "Or that.\n\n"
    },
    {
      "time": "2 Nov 2005 — 12:45pm",
      "content": "no i tried that,see the circles are good quality but not the text.  \nThanks though,i bet it is something simple like that.\n\n"
    },
    {
      "time": "2 Nov 2005 — 12:48pm",
      "content": "I used to have that problem, switching to Illustrator seemed to fix it.\n\n"
    },
    {
      "time": "2 Nov 2005 — 12:55pm",
      "content": "mmmm  \ni just opened it in freehand ten and put it in flash anti alias mode and they just disapear,so im thinking it has something to do with the fonts not being cool and linking up properly with 'suitcase'.  \n:( i love macs.\n\ni drule u rool\n\n"
    },
    {
      "time": "2 Nov 2005 — 12:58pm",
      "content": "yeh if i had illustrator i would, freehand is a goner but its all i have,and yeah my fonts are activated in suitcase. Im gonna play the fiddle furiously if i dont figure this out.\n\n"
    },
    {
      "time": "2 Nov 2005 — 1:02pm",
      "content": "have i done this right, i have dropped the fonts i want into my 'library\\>fonts' folder and then copied them into my suitcase from there....?\n\n"
    },
    {
      "time": "2 Nov 2005 — 1:07pm",
      "content": "What type of fonts are in use? TT, Type1, OT? I used to notice that either my TT or Type1 fonts looked jagged on screen (this hasn't been the case for a long time, so I can't remember which rendered jagged). (I wonder if that had something to do with ATM, which I used to use until it became unnecessary.)\n\nAlso, I believe it's possible to anti-alias a vector object (the circles) but still have anti-aliasing turned off for text, so that may still be at issue. However, I'm also speaking from ignorance; I gave Freehand a shot about 4 years ago and came right back home to Illustrator. Haven't touched that hand since.\n\n"
    },
    {
      "time": "2 Nov 2005 — 1:19pm",
      "content": "Aviner 1  \nHadriano  \nserifa  \nUtopia  \nI have checked the preferences and anti alias is turned on. Its just these fonts my system fonts like times new roman are fine,so i gather there is something iffy goin on with how the fonts are connecting up,which if so ,sucks cos there aint jack i can do about it.  \noh the calamity\n\n"
    },
    {
      "time": "2 Nov 2005 — 2:49pm",
      "content": "it looks like you're missing the postscript pieces, so only the bitmaps are displaying.\n\n"
    },
    {
      "time": "2 Nov 2005 — 7:40pm",
      "content": "But, if that were the case, he wouldn't be able to get a nice pdf preview, and apparently he is.\n\n"
    },
    {
      "time": "2 Nov 2005 — 7:49pm",
      "content": "that's true. I forgot the PDFs looked good.\n\n"
    },
    {
      "time": "3 Nov 2005 — 8:56am",
      "content": "see if the printed looks good or not. Also convert your types to paths before you print.\n\n"
    },
    {
      "time": "3 Nov 2005 — 8:59am",
      "content": "Seems to me you need to talk to the companies from who you licensed the type.\n\nSo you have copied them into your user fonts folder but are also loading them into suitcase? If that is the case it could be a conflict problem.\n\n"
    }
  ]
}
