{
  "id": "1601",
  "title": "Open Type Conversion",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Yo... is there any way to conver type one and true type fonts to the open type format?   \n   \nand chill...\n\n",
  "author": "anonymous",
  "time": "26 Jul 2002 — 12:08pm",
  "uid": "1203",
  "comments": [
    {
      "time": "28 Jul 2002 — 2:46pm",
      "content": "Another advantage is power: OT fonts can have fancy features like automatic ligation, and this type of thing actually enables the elegant typesetting of many non-Latin languages.   \n   \nA third advantage (the main reason for the existence of OT?) is that you can charge more for it, even if you used to sell a non-OT version...   \n   \nhhp\n\n"
    },
    {
      "time": "28 Jul 2002 — 3:54pm",
      "content": "exactly hrant,   \n   \nand that`s why I have asked if he develops some fonts. Think a raw conversation of an existing type one font gives no benefit. So if you made an otf font - use the possibilities. But developing / testing of the feature code data is \"something up form the road\" of a today's type designers work flow. :-)   \n   \nIf a otf font have more benefit - its ok to charge more - most of the Adobe pro fonts including more than four standard type one fonts in one otf build.   \n   \nThe \"power\"... him, maybe in the future - for now also InDesign 2.0 have no full access to the current otf specifications.   \n   \nIn most applications also the kern feature of an otf type is ignored - so a type one font is more usable.\n\n"
    },
    {
      "time": "29 Jul 2002 — 3:19am",
      "content": "Hrant, I think you are being oversimplistic with the OT cost issue. Yes, I am sure _some_ will use it as an excuse to inflate prices, but there are others who will use the technology to further typographic design rather than further their own selfish ends.   \n   \nNo doubt it will be left to the indys to lead the way - take Jeremey Tankard's new Aspect family as a prime example of using OT innovatively, and without apparent price inflation.   \n   \nDont condemn an entire technology, condemn companies that misuse that technology. For example, Thomas Phinney of Adobe, speaking at TypeCon2002, did little to reassure people (well, me) that it was nothing more than an excuse for his department to milk a (designer) cash cow. LAck of upgrade options were squirmed around in a way that made me feel decidedly uncomfortable, not only for the transparent spin but also the technological innaccuracies.   \n   \nI am sure that many of the larger, more \"serious\" families created by Adobe _will_ make reasonable use of the technology, but I doubt that converting the entire library over to OT by the end of the Autumn will herald a new era in typography.   \n   \nConcentrate your efforts on those that deserve it, Hrant ![:)](http://web.archive.org/web/20150419173514im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "29 Jul 2002 — 4:27am",
      "content": "I agree with your sentiments, David. It's not the technology, it's who uses it and for what.   \n   \nRegarding Adobe, however, I think the form of their greed may be slightly different than you imply. I believe the primary motivation for converting the entire library to OTF is to actively court Microsoft's corporate Windows market. OTF is cross-platform compatible, so big companies should no longer be afraid to buy lots of fonts. (And while they're at it, they can buy copies of PageMaker for all their employees, and then they won't need to hire designers anymore.)\n\n"
    },
    {
      "time": "29 Jul 2002 — 7:31am",
      "content": "David, you have a point, but I \\*love\\* OT - I'm not in the least condemning it. Heck, Adobe might even be excused for their \"cleverness\" considering the poor state of the font market.   \n   \nBut business is business, and the reality is that the same identical font with no extra features (in fact with a somewhat higher technological barrier!) can sell for a bit more under the guise of OT. The same way that Toyota changes the bodywork on their Camry, calls it a Lexus something-or-other, and doubles the price; the same with Audi using VW \"essentials\": the much-touted TT is just a really fancy Bug. Some people take advantage of this business reality, others have more scruples.   \n   \nIn fact, historically font houses have always looked for (and maybe even sometimes concocted, or at least helped concoct) new formats to resell their core value (sets of letterforms) to a saturated market. Many of these fonts we're using have been around for hundreds of years, and we're constantly having to re-pay for them... It's the price of technology I guess - it has a life of its own, with a ravenous apetite that must be fed.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Sep 2002 — 11:04pm",
      "content": "Adobe has a whole bunch of motivations for creating OpenType fonts. Trying to make disproportionately more money relative to the work that goes in or the value users get is not among those motives, though.   \n   \nI understand David Earls' concern about upgrade issues. It's true that we don't have a great story there (though Font Folio owners/buyers will be in good shape).   \n   \nThat aside, we are working very hard to make our OpenType fonts highly worthwhile, both by making good fonts, and by helping the rest of Adobe develop applications that support them. In particular, the final set of \"converted\" fonts will include a lot of fonts that look a lot like \"Pro\" fonts in terms of typographic features, from having merged Expert and supplemental fonts. However, these are still considered \"Standard\" fonts by Adobe, as they have only the basic language support and lack the additional custom characters and fine tuning of Pro fonts. I think they will make a great value, and in general they are actually quite a bit cheaper than buying the separate Type 1 fonts would be.   \n   \nOn top of that, there are the intro prices on each new set of OpenType fonts, at about 1/3 off the regular price. I don't see that as a grab for money on Adobe's part.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "28 Jul 2002 — 2:35pm",
      "content": "You can use the adobe fdk to build otf fonts - but its nothing for a quick step. FontLab 4 also saves otf type but its generation provides not the full features of the current adobe fdk build.   \n   \nWhy you want convert type one fonts to otf? Do you developing any fonts? I mean If you don`t developing any fonts - the only advantage of an otf font is (only with correct conversation) you can use it on every computer system / application what provides otf support. Not much at the moment - think InDesign 2.0 is the only one with an acceptable support.\n\n"
    }
  ]
}
