{
  "id": "16015",
  "title": "Suitcase slow, Fontbook unstable, ATM dead... What comes next?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Dear typophiles,\n\nI would like to ask for some suggestions about font management tools for Mac OS X. It might sound rude for someone but I find Suitcase slow (not to mention its constant intension to freeze), Fontbook quite useless (If I deactivate the font I would like to have it deactivated, right?). I've also heard that Adobe canceled ATM's further development.\n\nDo you have any other suggestions?\n\nThanks,\n\nMatjaz\n\nBTW  \nHas anyone experienced Linotype FontExplorer X already?\n\n",
  "author": "tomzl",
  "time": "3 Nov 2005 — 3:11am",
  "uid": "1932",
  "comments": [
    {
      "time": "3 Nov 2005 — 5:49am",
      "content": "Have you tried Font Agent. I don't like the fact that there is a (font activator) daemon running at all times but it hasn't crashed on me yet. I use it in conjunction with \"Font Doctor\"\n\n"
    },
    {
      "time": "3 Nov 2005 — 6:13am",
      "content": "Linotype FontExplorer X is running on both my work and home macs. i had a few problems with earlier versions but this latest release is hard to beat -- stable, FAST, and free. give it a try. you will like!\n\n"
    },
    {
      "time": "3 Nov 2005 — 6:35am",
      "content": "Yeah, I've used FontAgent Pro and FontExplorer X. They both are nice. Go with FE X if price is an issue.\n\n"
    },
    {
      "time": "3 Nov 2005 — 7:35am",
      "content": "I have been using Suitcase for years. Since the day Font Explored X came out I never looked back.\n\nThe only problem I have with Font Explorer X is that it doesn't seem to like Quark. Which is fine with my, because I don't like Quark either.\n\n"
    },
    {
      "time": "7 Nov 2005 — 4:53am",
      "content": "Thank you very much. I've just installed FontExplorer X and it seems that it is really hard to beat. Wonderful.\n\nThanks again.\n\nMatjaz\n\n"
    },
    {
      "time": "7 Nov 2005 — 11:14am",
      "content": "=^D That's funny, Guerella.\n\n--\n\nI've recently switched to FontExplorer also and I have to say that so far I really do like it.\n\n"
    }
  ]
}
