{
  "id": "16037",
  "title": "Now how cool is that?",
  "forum": "Bald Condensed's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20150326043859im_/http:/typophile.com/files/Booklet_200.jpg)\n\nIt carries number 200 of 200.\n\nIts title page sports 11 signatures from type designers ranging from young up-and-comers to type celebrities: Stefan Hattenbach, Jean François Porchez, Tomáš Brousil, Nick Shinn, {ths}, Rian Hughes, Randy Jones, Mark Simonson, Peter Bil’ak, Eduardo Manso and David Berlow.\n\nIt has traveled to New York and all over Europe, from cold Helsinki to sunny Barcelona via The Netherlands, Germany, the Czech Republic and England.\n\nIt is going to be auctioned to benefit both the SOTA and ATypI organisations.\n\nWe made it for the community, and we're going to give back to the community.\n\nSoon...\n\n",
  "author": "Bald Condensed",
  "time": "4 Nov 2005 — 4:06am",
  "uid": "110",
  "comments": [
    {
      "time": "4 Nov 2005 — 7:20am",
      "content": "Brilliant, brilliant.\n\nhhp\n\n"
    },
    {
      "time": "10 Nov 2005 — 12:01am",
      "content": "Very cool Yves.\n\n"
    },
    {
      "time": "14 Dec 2005 — 3:06pm",
      "content": "And before you know it, early next week is early next month. Blame it on a massive [name change operation](http://web.archive.org/web/20150326043859/http:/www.magelaan.be/) which included a corporate style system, a corporate brochure and a new website on top of all the other work I had to do last month.\n\n[The auction](http://web.archive.org/web/20150326043859/http:/cgi.benl.ebay.be/ws/eBayISAPI.dll?ViewItem&item=6589225869) just started and ends on Christmas Eve. Don't procrastinate! ;^)\n\n"
    },
    {
      "time": "14 Dec 2005 — 3:17pm",
      "content": "I have one of those! Good luck on the bidding though! See you at TypeCon 2006, Yves!\n\n"
    },
    {
      "time": "14 Dec 2005 — 4:07pm",
      "content": "Is there a version of the auction in English? My knowledge of German is limited to words ending in wurst:-)\n\nChrisL\n\n"
    },
    {
      "time": "14 Dec 2005 — 4:20pm",
      "content": "That would be Dutch, my friend. Just fill in a high amount of money whatever it says... ;^)\n\nI'll see what I can do about translating the relevant topics. I wanted to sign in on an English-language eBay but got redirected every time I added my address. :^/\n\n"
    },
    {
      "time": "14 Dec 2005 — 4:29pm",
      "content": "My knowledge of Dutch is well, less than limited :-/\n\n ![](http://web.archive.org/web/20150326043859im_/http:/typophile.com/files/dutchboy.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "14 Dec 2005 — 4:58pm",
      "content": "I was thinking the same thing Chris, I'd feel more comfortable bidding where I can read the auction. :-D\n\n"
    },
    {
      "time": "14 Dec 2005 — 5:07pm",
      "content": "I have never been on ebay before so I don't even know how it works in English.\n\nChrisL\n\n"
    },
    {
      "time": "14 Dec 2005 — 5:10pm",
      "content": "They did have auctions in the stone age, no? Same thing, just online. Only everyone bids but then waits till the very last second (literally) to put in their, hopefully, winning bid.\n\n"
    },
    {
      "time": "23 Dec 2005 — 1:04am",
      "content": "For whoever needs a translation to place a bid:\n\nOn the main item page, right to the picture, **Huidig bod:** means _Current bid_. Right underneath the current bid amount, the button says **Bod plaatsen \\>** which means _Place bid_. Click it.\n\nOn the next page, in the right hand column, fill in your **Gebruikersnaam** _(User name)_ and **Wachtwoord** _(Password)_ and log in by clicking the button **Veilig inloggen \\>**.  \n(If you are not yet registered to eBay, I suggest you do that on the English-language website. That'll save you a lot of trouble.)\n\nOn the next page, you can place your bid where it says **Je maximumbod:** _(Your maximum bid)_ and then click the button **Doorgaan \\>** to continue.\n\nOn the next page you confirm your bid by clicking the button **Bod bevestigen**.\n\nGood luck -- you've got one day and 14 hours left.\n\n"
    },
    {
      "time": "23 Dec 2005 — 7:46am",
      "content": "Danka Yves :-)\n\nChrisL\n\n"
    }
  ]
}
