{
  "id": "16039",
  "title": "Typographer.org booklet - No. 200, signed by the designers",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "As I announced previously, David and I wanted to do something special with #200 of the [TypeCon2005 booklet](http://web.archive.org/web/20061116082830/http:/typographi.com/001024.php). Well, just yesterday I found it in my mail, after it had travelled all over Europe\\* — together with #000 and #001 — collecting the last signatures.\n\nYup, this extremely limited copy of the booklet not only sports the magical number 200 of 200, but its title page is signed by all the type designers who participated in this project. The list ranges from young up-and-comers to card carrying type design celebrities: Stefan Hattenbach, Jean François Porchez, Tomáš Brousil, Nick Shinn, {ths}, Rian Hughes, Randy Jones, Mark Simonson, Peter Bil’ak, Eduardo Manso and David Berlow.\n\nSo, David and I _are_ keeping the equally signed #000 and #001 for ourselves — heh, we’re not _that_ crazy —, but number 200 will be auctioned to the highest bidder. Even better, we decided that the money raised by this auction will be split in half and donated to both the SOTA and ATypI organisations. We might occasionally rail against capitalism running amok and corporate greed on Typographer.org, but at least we put our money where our mouth is. We made this booklet for the community, and now we’re giving back to the community. I hope this will be sufficient incentive to bid generously.\n\nI will add more details in this thread soon. For now, check this out…\n\n ![](http://web.archive.org/files/Booklet_200.jpg)\n  \n\\* Yes indeed, although we shipped it in a protective envelope, sandwiched between two pieces of cardboard, the corners are ever so slightly worn. But I feel this only adds to its charm. You can actually _see_ it has been places. ;^) \n",
  "author": "<a href=\"user/110\" title=\"View user profile.\">Bald Condensed</a>",
  "time": "<br>",
  "uid": "110",
  "comments": [
    {
      "time": " 4 November, 2005 - 7:01am",
      "content": "Gosh darn! mine isn’t SIGNED! Guess I’ll have to bid on this one :-)\n\nChrisL\n\n"
    },
    {
      "time": " 4 November, 2005 - 8:16am",
      "content": "Yours _is_ signed… by David and me! Are we not good enough for you? :’-(\n\n;-)\n\n"
    },
    {
      "time": " 4 November, 2005 - 8:48am",
      "content": "“…Are we not good enough for you?”\n\nWell then I guess you wouldn’t mind trading mine for your 001 copy with all the other names signed too? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 4 November, 2005 - 11:33am",
      "content": "Har har har. Nice try Chris… :^D\n\nI wanna see a substantial amount of hard cash on both SOTA’s and ATypI’s bank accounts before this baby changes owners.\n\n"
    },
    {
      "time": " 4 November, 2005 - 12:01pm",
      "content": "You must know how extremely wealthy us type nerds tend to be :-)\n\nChrisL\n\n"
    },
    {
      "time": " 4 November, 2005 - 5:27pm",
      "content": "So where do we bid?\n\n"
    },
    {
      "time": " 5 November, 2005 - 12:47pm",
      "content": "Early next week, I guess on eBay. Please bear with me, I’m new to this online bidding stuff. Anybody has any brilliant suggestions? I can’t seem to get hold of my partner in crime David who’s moving house.\n\n"
    },
    {
      "time": " 5 November, 2005 - 12:58pm",
      "content": "I have never been to ebay or had any auction experience.\n\nChrisL\n\n"
    },
    {
      "time": " 5 November, 2005 - 3:28pm",
      "content": "Make sure the auction closes on a weekday, around 10AM on the  \nUS west coast: that way you get as many people as possible.\n\nhhp\n\n"
    },
    {
      "time": " 5 November, 2005 - 4:27pm",
      "content": "I’ve just been discussing this with David — he finally showed up on iChat — and we can’t decide what to do, so we’ll leave it up to you guys’n’gals.\n\nDo you prefer eBay or sealed bids through a web form? eBay auctions tend to escalate, which could help make more money, but sealed bids give people the opportunity to bid what they _really_ think it’s worth. Let us know.\n\n"
    },
    {
      "time": " 5 November, 2005 - 5:13pm",
      "content": "I would favour eBay. Obviously, as vice-president of ATypI, I have a vested interest in seeing the bidding escalate. :)\n\nThank you very much for this initiative, Yves and David. I’m notified the ATypI board and secretariat about this. Once you have the auction set up, I’ll put a news item on the ATypI website and the member discussion list.\n\n"
    },
    {
      "time": " 6 November, 2005 - 11:05pm",
      "content": "Yves, it’s so exciting to hear about these fully signed rare copies. I really appreciate your and David’s generosity in donating proceeds to SOTA and ATypI - thank you so much. I have notified the SOTA board as well, and once the auction is live, I can post to the TypeCon email news list. I look forward to the auction - it’s bound to be a nail-biter.\n\n"
    },
    {
      "time": " 14 December, 2005 - 4:05pm",
      "content": "And before you know it, early next week is early next month. Blame it on a massive [name change operation](http://web.archive.org/web/20061116082830/http:/www.magelaan.be/) which included a corporate style system, a corporate brochure and a new website on top of all the other work I had to do last month.\n\n[The auction](http://web.archive.org/web/20061116082830/http:/cgi.benl.ebay.be/ws/eBayISAPI.dll?ViewItem&item=6589225869) just started and ends on Christmas Eve. Don’t procrastinate! ;^)\n\n"
    },
    {
      "time": " 23 December, 2005 - 2:06am",
      "content": "If anyone needs a translation of the Dutch-language eBay pages, here it is:\n\nOn the main item page, right to the picture, **Huidig bod:** means _Current bid_. Right underneath the current bid amount, the button says **Bod plaatsen \\>** which means _Place bid_. Click it.\n\nOn the next page, in the right hand column, fill in your **Gebruikersnaam** _(User name)_ and **Wachtwoord** _(Password)_ and log in by clicking the button **Veilig inloggen \\>**.  \n(If you are not yet registered to eBay, I suggest you do that on the English-language website. That’ll save you a lot of trouble.)\n\nOn the next page, you can place your bid where it says **Je maximumbod:** _(Your maximum bid)_ and then click the button **Doorgaan \\>** to continue.\n\nOn the next page you confirm your bid by clicking the button **Bod bevestigen**.\n\nGood luck — you’ve got one day and 14 hours left.\n\n"
    },
    {
      "time": " 23 December, 2005 - 8:43am",
      "content": "Thanks Yves!\n\nChrisL\n\n"
    }
  ]
}
