{
  "id": "16031",
  "title": "Webdesign company logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello everyone,\n\nThe attached logo is being designed for a webdesign company. I decided to go with Eurostile because it has a bold outgoing feel to it. I really would like to keep the logo simple and bold. I’m also curious if anyone has any better suggestions for a font, both for the company name and what is located under it “Consulting, design, development”. Colors are still undecided, first and foremost I want to peg the logo design.\n\nCritique away\n\nThanks,  \nRay Macari\n\n| Attachment | Size |\n| --- | --- |\n| [macari-logo.gif](http://web.archive.org/web/20080415205234/http:/typophile.com/files/macari-logo.gif) | 9.55 KB |\n| [macari-logo2.gif](http://web.archive.org/web/20080415205234/http:/typophile.com/files/macari-logo2.gif) | 5.52 KB |\n\n [‹ Business Card for the Inbetween Life](http://web.archive.org/web/20080415205234/http:/www.typophile.com/node/16051 \"Go to previous forum topic\") [Accidental Similarity ›](http://web.archive.org/web/20080415205234/http:/www.typophile.com/node/15979 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080415205234/http://www.typophile.com/user/9984\" title=\"View user profile.\">Ray Macari</a>",
  "time": "<br>",
  "uid": "9984",
  "comments": [
    {
      "time": " 3.Nov.2005 4.47pm",
      "content": "When you say ’web design’ you mean exactly?\n\n"
    },
    {
      "time": " 4.Nov.2005 4.05am",
      "content": "I like number 2. Number 1 doesn’t work the designer of the typeface never designed it to have the characters crash into one another. With number 3 the shadow effect will be lost in small sizes and makes the type look cramped.\n\n"
    },
    {
      "time": " 4.Nov.2005 8.50am",
      "content": "Yep, I’m with Dan on that front: Number 2 works best, but that doesn’t mean it can’t be improved more. Must admit, I don’t have any immediate suggestions, but if you or anyone else comes up with anything I’d be glad to offer my opinion....!\n\n"
    },
    {
      "time": " 4.Nov.2005 9.18am",
      "content": "Dan and WhitePepper thank you for the input. My main concern was if the kerning would be to extreme in the first logo. So its helpful to know that it is indeed a bit to extreme for the eurostile font. I resized the logo for the webpage and it seems that the text below “macari” becomes hard to read at a smaller font size so im thinking that eurostile demi would suit “Consulting, design, development better. Also i’ve posted where i was originally going with the logo but it ended up looking a lot like macromedia. Anyone think so?\n\nEben, I should have elaborated more. Basically our services will include web design and development. Application development, site design and site redesign fall under those categories. We will also offer Web Hosting Solutions.\n\n"
    },
    {
      "time": " 4.Nov.2005 9.23am",
      "content": "Re-reading my comment I realize I am being unclear. I guess I am asking : ’why this idea?’ Maybe you have good reasons but .... so far I can’t tell.\n\nTo my eyes this idea could be for almost anything. Okay, not a bank or a lawyer, but an Italian furniture company? Sure! Or 90 other things.\n\nActually that’s what I looks like to me. Without reading the text I would think Italian furniture company started in the 50’s or 60’s. It doesn’t read as ’web’ or ’design’ to me. Not at all. In fact it embraces a dated kind of industrial modernism.\n\nI suggest you define what you want this mark to do & say & then set out to hit that mark. Otherwise you just doodling. Maybe you have already done that & this design is more deliberate ( & coy ) than I think it is... But so far I would doubt it.\n\nI think you have more work to do.\n\n"
    },
    {
      "time": " 4.Nov.2005 9.30am",
      "content": "Your post came in just before mine - and you have started answer some of my questions already! So, it sounds like you will be a total solutions shop which in my mind leans more on the technical than the creative. What I mean is that the buyer could decide to use any of your services but if you do it all it will be the technical side that the client will be more concerned about. So you logo aught to reasure I think.\n\nBut maybe you want to emphasize ’design’ over technical services. Do you?\n\nGiven what you have said so far I think the logo design isn’t suited to your business goals yet. I would explore some more. Can you expand on your purpose a bit more? How do you want your clients to see you?\n\n"
    },
    {
      "time": " 5.Nov.2005 6.15am",
      "content": "The idea behind the first logo was to keep it simple and bold to appeal to larger crowd. I totally see what you’re saying about how when you first see the logo it doesn’t really relay exactly what we do. What you talked about in your second post in the thread has been what was bothering me about the logo. The average person wont know what Macari is, and that could be a problem.\n\nI talked with my partner after I sent him another logo that I had worked on previous for our project and we both seemed to agree that it sent a better message.\n\nDo you think this logo works better? I believed from the get go that macari media sounded good. The a’s repeat and it looks pleasing to the eye. The idea behind the five squares that they have a technical feel to them but also contain a design feel. They also create an “m” and guide the eye. I’d like to go from there. Do you think it works better and if so what can be done to improve it?\n\nthanks for the critique Eben\n\n ![](http://web.archive.org/web/20080415205234im_/http:/www.typophile.com/files/macarimedia.gif)\n\n"
    },
    {
      "time": " 5.Nov.2005 9.12am",
      "content": "This logo seems updated by at least 20 years and does suggest what you do better but I could not recommend using it. It’s parts are not united into a coherent whole. And it feels typical of the early 90’s dot com era - not current sensibilities. But ultimately to suggest a direction I would still ask you to answer some more of my speculative questions about your intent.\n\n"
    },
    {
      "time": " 5.Nov.2005 9.53am",
      "content": "“But maybe you want to emphasize ‘design’ over technical services. Do you?”\n\nI think technical services will overpower the creative aspect. And I want the client to see the company as a “total solution shop” so I guess the idea is to mix good design with a logo that has a technical feel to it.\n\nI do think the last logo that I posted will work if its touched up. Font and symbol will be reworked and from there I think i’ll have something.\n\n"
    },
    {
      "time": " 5.Nov.2005 10.19pm",
      "content": "Maybe so, I still suggest that you formally declare what you want the mark to do for you & how you want to be seen by your clients. If only for business reasons. When you print this stuff it’s an investment. Make it worthwhile.\n\n"
    },
    {
      "time": " 5.Nov.2005 10.50pm",
      "content": "A few thoughts try a more approchable sans face. Akzidenz Grotesk Extended Bold comes to mind. In your latest version I like the squares if you make them part of the over all web site idenity. Echo them on each page or make a grid from them. MacariMedia could be a software developer so you do have to make it clear what you do. It might not be the job of the logo. You might have to have a bullet points of what you do or a paragraph of copy with the logo for the near future until your idenity is established. As it is, it is lost.\n\n"
    },
    {
      "time": " 6.Nov.2005 2.14am",
      "content": "Given your business, I would say that it echoes the [Macromedia](http://web.archive.org/web/20080415205234/http:/www.macromedia.com/macromedia/style_guide/logos/macromedia/) logo too closely, in terms of pallette, lowercase type and form. I think you would be better served avoiding anything that directly (or subconciously) relates your business to a software giant.  \nTim\n\n"
    },
    {
      "time": " 6.Nov.2005 11.12am",
      "content": "Macari media does sound more like a design/multimedia/ad company than a techically profcient one to me. What about just ’Macari’. If you are good enough at what you do then your fame will precede you anyway. Also, then you are free to be what you become - the best laid plans of mice & men & all that sort of thing.\n\nThis idea is the cheese I admit, but you could put an m in an @ sign...\n\nAnyway.\n\nThere are 1000’s of good ideas and a few great ones. Like I said. Keep going. A decent identity won’t sell anyone but it can grease the hinges...\n\nAnd, if you sell ’design’ at all you need to look the part!\n\n"
    },
    {
      "time": " 6.Nov.2005 6.25pm",
      "content": "yeah i agree with timd\n\n"
    },
    {
      "time": " 7.Nov.2005 5.58am",
      "content": "All this talk has definitely got the ball rolling again. Im reworking solutions to font and refining the current symbol. We’re definitely going with Macari Media. The symbol and font choice will determine how people see the company. Also I do agree that how the logo is does somewhat resemble macaromedia but by changing the weight and/or color of media or macari it does help to keep Macari Media from reading as one word. I guess it could also be Macari space Media as well so i’ll have to consider this.\n\nDan: Akzidenz Grotesk Extended Bold does look a bit more welcoming. I was also looking around at t26.com and found a few choices there. Much of the webpage layout is done and I actually did start using the symbol throughout the webpage and it works well so I’ll likely keep that part of the logo.\n\n"
    },
    {
      "time": " 7.Nov.2005 6.43am",
      "content": "As you are going with Macari Media try a double MM symbol (not in an egyptian:).  \nTim\n\n"
    }
  ]
}
