{
  "id": "16049",
  "title": "Computer Pro Rescue",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "The goal of this logo is to attract customers of all ages for computer repairs.\n\n| Attachment | Size |\n| --- | --- |\n| [Bryant font.gif](http://web.archive.org/web/20131023140313/http:/typophile.com/files/Bryant%20font.gif) | 7.26 KB |\n\n",
  "author": "signs79",
  "time": "4 Nov 2005 — 12:58pm",
  "uid": "2214",
  "comments": [
    {
      "time": "4 Nov 2005 — 1:02pm",
      "content": "I am favoring Bryant.\n\n"
    },
    {
      "time": "4 Nov 2005 — 1:15pm",
      "content": "well. who knew. they all sorta work. now my least favorite is avenir. bryant does seem to work the best. aaux isn't as bad as i thought it would be, but it is too big and i think needs a little more letterspace.\n\n"
    },
    {
      "time": "4 Nov 2005 — 1:43pm",
      "content": "I'm with Miss Tiffany on this one. Nice mark, by the way.\n\n"
    },
    {
      "time": "4 Nov 2005 — 1:48pm",
      "content": "Thanks!!\n\nI think I may buy bryant. I will sleep on it.\n\nBy the way- is that the TBS font. Amazing how a font can look so much like VAG (which I hate) and look so cutting edge. Mmmmm.\n\n"
    },
    {
      "time": "4 Nov 2005 — 2:46pm",
      "content": "Could you provide some background on the marketing about the company. Who is the audience? What does the company want to accomplish.\n\n"
    },
    {
      "time": "7 Nov 2005 — 10:01am",
      "content": "I have updated the logo on the first post with newly purchased Bryant font. I put an alternative using dots between the words.\n\n"
    },
    {
      "time": "10 Nov 2005 — 6:53am",
      "content": "I prefer the undotted one because the gaps created by them play havoc with your kerning, that said the rp and or seem a bit tight.  \nTim\n\n"
    },
    {
      "time": "15 Nov 2005 — 12:52am",
      "content": "Very nice logo indeed. timd's point is well taken; nevertheless I prefer the first effort (the one with the pseudo dot notation) because it separates the three parts of the name, making the name as a whole easier to assimilate/understand/remember. After all, sad though it may be, most non-designers don't spend a lot of time gazing at a mark. Read quickly, even with the color alternation, the company name is a bit of a blur. So I would say that the dots serve to make the mark \"stickier\" for most people while also being a bit of a nod to any networking geeks who happen to be passing by.\n\n"
    },
    {
      "time": "15 Nov 2005 — 7:50am",
      "content": "Very nice mark/icon. The type, to me, is just sitting there. It seems like it needs a little extra something, without competing with the mark. What that is, I'm not sure.\n\n"
    },
    {
      "time": "20 Nov 2005 — 3:37pm",
      "content": "You should take into consideration that a lot of people might expect the company's website to appear if they type \"computer.pro.rescue\" into their web browsers.\n\n"
    }
  ]
}
