{
  "id": "16045",
  "title": "FontLab Studio 5 for OS X",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello everyone. I’m getting ready to purchase FontLab but I would love to hold off if Studio 5 is coming any time soon for OS X. Anyone know of any dates as to the release, if soon at all?\n\n [‹ Suitcase slow, Fontbook unstable, ATM dead... What comes next?](http://web.archive.org/web/20080829115051/http:/www.typophile.com/node/16015 \"Go to previous forum topic\") [Long question about MAC-PC/Type1-TrueType file conflicts ›](http://web.archive.org/web/20080829115051/http:/www.typophile.com/node/16033 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080829115051/http://www.typophile.com/user/4439\" title=\"View user profile.\">chronicle</a>",
  "time": "<br>",
  "uid": "4439",
  "comments": [
    {
      "time": " 4.Nov.2005 6.42am",
      "content": "onthere website they say they are working hard to finish it the end of the year.  \nbut you never know, they promised it much earlier. I am desperatly waiting too.  \nHubert\n\n"
    },
    {
      "time": " 4.Nov.2005 6.51am",
      "content": "Ted Harrison of FontLab has said they plan to release it before the end of the year; It’s true they’ve been “working on it” for a long time, but I suspect this is a good estimate, since they have released the PC version.\n\n"
    },
    {
      "time": " 4.Nov.2005 7.08am",
      "content": "I asked Adam when it would be released a few weeks back and he replied in his best comic manner “When it is ready:-)”\n\nChrisL\n\n"
    },
    {
      "time": " 4.Nov.2005 7.13am",
      "content": "The first beta of the Mac version is in the testers’ hands. It’s pretty tight for the most part, but there are a lot of problems which Yuri, Cyril, and crew will need to fix before release.\n\n"
    },
    {
      "time": " 4.Nov.2005 7.51am",
      "content": "Chester,  \nBut I think Schmelvetica is a masterpiece :-)\n\nChrisL\n\n"
    },
    {
      "time": " 4.Nov.2005 7.59am",
      "content": "Chris, I think you mean “monsterpiece”. The term “juvenilia” comes to mind...\n\n"
    },
    {
      "time": " 4.Nov.2005 8.17am",
      "content": "but it was such fun!\n\nChrisL\n\n"
    },
    {
      "time": " 4.Nov.2005 1.29pm",
      "content": "Well, I guess I can wait another month or so for v.5.\n\n"
    },
    {
      "time": " 5.Nov.2005 5.12am",
      "content": "FontLab Studio 5 for Mac is under serious development and is currently in beta test. I can assure everybody that the development cycle will take much less than that of FontLab Studio 5 for Windows. During the development of the Windows version we have been actively planning and adding new features and basically shaping the application. The functionality of Studio 5 is ready with the Windows version and our developers now are working hard on getting the same functionality to the Mac version. So the testing that is currently under way is about “does everything work as planned” and not about “what could we add here”.\n\nIndeed, our plan is to release FontLab Studio 5 for Mac in December.\n\nRegards,  \nAdam\n\n"
    },
    {
      "time": " 5.Nov.2005 5.24am",
      "content": "Let’s hear it for tax year 2005!\n\n"
    },
    {
      "time": " 5.Nov.2005 7.43am",
      "content": "Let’s hear it for the “Adam’s Family!”, “Adam’s Family!”, “Adam’s Family!”, ...\n\nChrisL\n\n ![](http://web.archive.org/web/20080829115051im_/http:/www.typophile.com/files/addams.jpg)\n\n"
    },
    {
      "time": " 5.Nov.2005 8.23am",
      "content": "Chris, don’t make me wish they didn’t bring back image posting. :-)\n\n"
    },
    {
      "time": " 5.Nov.2005 8.32am",
      "content": "“Chris, don’t make me wish they didn’t bring back image posting. :-)”\n\nLOL! Yes, just seeing Norbert post a picture of me is a deal-breaker right there—that was far scarrier than the Addams family:-)\n\nChrisL\n\n"
    },
    {
      "time": " 6.Nov.2005 12.36pm",
      "content": "\\>Chris, don’t make me wish they didn’t bring back image posting. :-)\n\nBut how do you do that?  \nAnd what’s the background colour?\n\n"
    },
    {
      "time": " 6.Nov.2005 1.50pm",
      "content": "Nick—See Christian’s post about the newly reinstated image posting facility:\n\n[http://typophile.com/node/15783](http://web.archive.org/web/20080829115051/http:/typophile.com/node/15783 \"http://typophile.com/node/15783\")\n\nThe background color on Typophile (if that’s what you mean) is #efefef. Rather than use the background color when I post an image (it could change any time, you know), I use either a gif or png with a transparent background. png’s are the best because the transparency can be gradual. Vis:\n\n ![](http://web.archive.org/web/20080829115051im_/http:/www.typophile.com/files/sb.png)\n\n"
    },
    {
      "time": " 6.Nov.2005 3.50pm",
      "content": "Wow, Mark! Is that a Strongbad jack-o-latern, and did you make it?\n\n"
    },
    {
      "time": " 6.Nov.2005 5.18pm",
      "content": "Thanks Mark!\n\n"
    },
    {
      "time": " 6.Nov.2005 7.50pm",
      "content": "Yes and yes. It was from last year. We had very few trick-or-treaters for some reason.\n\n"
    }
  ]
}
