{
  "id": "16051",
  "title": "Business Card for the Inbetween Life",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Introductions all around:  \nHello, I’ve been a lurker once removed for a while, now. My spouse is a frequent poster, Chris Rugen, and I’m nosy, so I’ve given the site a look. I’ve been working on a business card for my new professional incarnation.\n\nBackground:  \nI am currently an interior designer for IKEA.  \nI used to be a freelance set designer and scenic artist (plenty of lettering).  \nI am now taking classes in graphic and web design, so I can start forcing Chris to split his fees when I help him on a project. :)  \nI have a terminally crafty streak and I’m trying to play that up.\n\nI used the typefaces Nasty, CA Aires, European Pi, and CA After Midnight Sale Junk. Once I have better mastery of Illustrator, I have dreams of switching out the image of the stylized woman and tossing my own silhouette in there.\n\nHere it is:\n\n ![](http://web.archive.org/web/20080908005853im_/http:/www.typophile.com/files/buscard_webOCT2005.jpg)\n  \nComments and suggestions welcome.\n [‹ Font suggestions & logo critique](http://web.archive.org/web/20080908005853/http:/www.typophile.com/node/16068 \"Go to previous forum topic\") [Webdesign company logo ›](http://web.archive.org/web/20080908005853/http:/www.typophile.com/node/16031 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080908005853/http://www.typophile.com/user/9993\" title=\"View user profile.\">AlisaK</a>",
  "time": "<br>",
  "uid": "9993",
  "comments": [
    {
      "time": " 4.Nov.2005 2.50pm",
      "content": "I like the card it has a wonderful retro feel. I’m not convinced about the word Artisan. Why not just Designer or Artist\n\n"
    },
    {
      "time": " 4.Nov.2005 5.19pm",
      "content": "I don’t think this is a business card, I do think it’s a personal introduction card.\n\nThere nothing about the card the says business, and for that matter nothing about the card says design, ( actual word “design” noted ).\n\nTo me it looks like it’s all about ALISA, which is ok by me.\n\nHiroshige\n\n"
    },
    {
      "time": " 4.Nov.2005 8.34pm",
      "content": "I would be interested in seeing the grid you are working with.\n\nSometimes grunge can be nice. What would make this better is if the grunge could be bound to something a little more organized. A strict grid might accomplis this. Or possibly some ’cleaner’ elements.\n\nRepeating the A in the grunge font is a bit too much of a good thing. It kills the impact of the type treatment for the name.\n\nLoose the silhouette, it accomplishes nothing — in fact it is actually confusing.\n\nDevelop a (more visible) grid. Allow it to dictate your elements size and placement. Introduce, or change some of the elements to something more organized or ’clean.’ Be prepared to to have a solid explaination for the moniker ’design artisan.’\n\nOhh, and welcome to Typophile. ;)\n\n"
    },
    {
      "time": " 4.Nov.2005 10.42pm",
      "content": "I don’t see anything wrong with this per se - It’s cheeky & fun and the word ’artisans says ( to me) that you also want to good work & that your serious about that. The split seems to be:\n\nnot serious about yourself / serious about your work.\n\nIf I was offering you this design I would want to be clear about what you want the card to do for you. If you wanted to appear to be more serious yourself, which other folks seem to be suggesting you should and which I am not so sure about yet, then yes you would have to be more grid-y or something. Given the exuberence of the card I have a hard time imagining that could be your intent. Still, I don’t really know because you haven’t said - yet.\n\n"
    },
    {
      "time": " 4.Nov.2005 10.42pm",
      "content": "Oh, & yes, welcome!\n\n"
    },
    {
      "time": " 5.Nov.2005 6.10am",
      "content": "Ha ha! Yes - Welcome indeed! I think Hiroshige makes a good point in that the card doesnt give off a sense of ’design’. To me, I see something more like ’vintage clothing’ or ’antiques’ (possibly the background ’A’ making me think this).\n\nI expect the design is monotone for a reason, and there is nothing wrong with that at all, but could maybe small splash of colour help lift it?\n\n"
    },
    {
      "time": " 5.Nov.2005 8.48am",
      "content": "David makes good points. I agree with his observations about the feeling of the card. It does feel vintage clothing-ish. To put a less fine point on it, it feels casual.\n\n"
    },
    {
      "time": " 5.Nov.2005 10.37am",
      "content": "I think that something this pretty and ornate needs to be two-sided. Have you thought about mimicking your pattern effects on the back?\n\n"
    },
    {
      "time": " 6.Nov.2005 2.28am",
      "content": "I like the grungy look but I am concerned that your name is not that clear, maybe you could try Great Circus, also by Eduardo Recife. From a technical point of view having equal tight margins can be a challenge for printers. The dot in your e-mail address is lost, while many might anticipate it there will always be somebody frustrated.  \nGood luck splitting those fees.  \nTim\n\n"
    },
    {
      "time": " 6.Nov.2005 8.38am",
      "content": "Alisa,  \nI think you somehow need to indicate what area(s) of design you will be doing business in. That may mean a tagline, e.g., “Design to set the stage for home or business” or simply stating “Set and Interior Design with Whimsy.”\n\nBTW, I met Chris in New York at TypeCon, he seems like a nice guy for someone from Philly:-) Tell him I said hello.\n\nChrisL\n\n"
    },
    {
      "time": " 6.Nov.2005 9.03am",
      "content": "_I am now taking classes in graphic and web design, so I can start forcing Chris to split his fees when I help him on a project. :)_\n\nWow, what an idea! If my girlfriend ever did that, though, I don’t think I’d ever make a profit again :(\n\n"
    },
    {
      "time": " 6.Nov.2005 11.05am",
      "content": "Looking again I think with the existing design I would think you were an interior designer, before I read the words. But the impression would still be there.\n\n"
    },
    {
      "time": " 6.Nov.2005 3.18pm",
      "content": "Thank you all for giving one of my first official print designs a look-see. I would like to address some of the comments you’ve made.\n\nthe term Design Artisan  \nI struggled with this term as well. My reasoning is that I am, at the moment, inbetween professional directions. If I hand this card out to someone, I would like it to be able to emphasize to my potential client or contact that I am in a sense, a creative Jack-of-all-Trades. I work with a variety of media, and consider myself more of a craftsperson, than a designer or an artist.\n\nInformality (business vs. introduction)  \nI want my potential client to be under no illusions as to the feeling of the product they will be getting: something with thought behind it, a hand crafted feel to the work, and perhaps a more playful approach than they might otherwise find. I do understand that this may limit my potential clientele.\n\nA Grid  \nHonestly I have very little experience with grids (alright, no experience). I found your comments very interesting, and because of your post, I nagged Chris into giving me a quick introduction to the baseline and layout grid. I do think that the small amount of information in the actual card makes a grid unnecessary. The work I have done, thus far, has tended towards an optically placed collage. I look forward to exploring the grid as a tool and an integral part of my design work. Thanks for the advice.\n\nProduction  \nThis card design stemmed from my decision to jump head first into Illustrator with almost no knowledge of the program. My purpose was to make a card that would suite my immediate needs for introduction, which I think this design achieves for the short term. I printed them on pre-punched card stock that can only be printed on one side. I hope to experiment with a double sided design some point in the future. Great point, thanks.\n\nI am amazingly busy with a combination of classes, work, and some small print projects for my synagogue’s annual auction, but I fully plan on trying out some of your suggestions (Great Circus, a simpler composition, a descriptor for my “title”, a more methodical grid, double sided comp). Well, lots to explore. I’ll be sure to post what I come up with, but it may be a while.\n\np.s. you know I heard somewhere that Philly is the new Brooklyn... so don’t knock it (thank goodness that’s a boldfaced lie)\n\n"
    },
    {
      "time": " 6.Nov.2005 3.27pm",
      "content": "_Wow, what an idea! If my girlfriend ever did that, though, I don’t think I’d ever make a profit again :(_\n\nDing :)\n\n"
    },
    {
      "time": " 7.Nov.2005 7.23am",
      "content": "Hi Chris! I told Alisa all about our time hanging out. Don’t worry, she won’t judge you too harshly. ;) But seriously, I had a good time talking with you and sampling some of the local cuisine. Perhaps if you’re in Boston next year I’ll have a font to show you, as well.\n\nDan, I just wish there was a way I could convince the client to let me _double_ my fees...\n\nAlisa’s design aesthetic and problem-solving sensibility is well reflected in her card, and that’s why we’re starting to collaborate more formally. We balance each other out. I’m more methodical, gridded, type-centric, etc. She’s a burst of visual and creative activity, but always with a purpose and a concept. It’s pretty cool.\n\n(OK, I’m done bragging about my wife.)\n\nAll of the comments here are great and have fed creative debate between the two of us about her cards. That’s why I love Typophile.\n\n"
    },
    {
      "time": " 7.Nov.2005 8.04am",
      "content": "“Perhaps if you’re in Boston next year I’ll have a font to show you, as well”\n\nChris, I am hoping to attend and would be delighted to see your type design. Tell Alisa that I am from Pittsburgh, the “New Cleveland” :-)\n\nChrisL\n\n"
    }
  ]
}
