{
  "id": "16058",
  "title": "Adobe Systems",
  "forum": "Home",
  "tags": [
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20150205003524/http:/typophile.com/wiki/Indices) : [Foundries](http://web.archive.org/web/20150205003524/http:/typophile.com/wiki/Foundries) : Adobe Systems**\n\nAdobe Systems, founded in 1982, invented the PostScript page description language and then later various graphics software. As part of that, they invented the [Type 1](http://web.archive.org/web/20150205003524/http:/typophile.com/wiki/Type%201) font format, the first scalable outline format usable on multiple vendors' output devices.\n\nAdobe initially licensed most of its typefaces from [Monotype](http://web.archive.org/web/20150205003524/http:/typophile.com/wiki/Monotype), [ITC](http://web.archive.org/web/20150205003524/http:/typophile.com/wiki/ITC) and [Linotype](http://web.archive.org/web/20150205003524/http:/typophile.com/wiki/Linotype). Later it began a program of \"Adobe Originals,\" initially led by [Sumner Stone](http://web.archive.org/web/20150205003524/http:/typophile.com/wiki/Sumner%20Stone). The two famous full-time type designers for Adobe have been [Carol Twombly](http://web.archive.org/web/20150205003524/http:/typophile.com/wiki/Carol%20Twombly) and [Robert Slimbach](http://web.archive.org/web/20150205003524/http:/typophile.com/wiki/Robert%20Slimbach), although many other Adobe staffers have designed one or two typefaces.\n\nIn the early 1990s, Adobe invented the \"multiple master\" flavor of Type 1 fonts, with interesting axis-based capabilities. In the late 1990s, Adobe moved away from Type 1 and multiple master fonts to collaborate with Microsoft on the development of the [OpenType](http://web.archive.org/web/20150205003524/http:/typophile.com/wiki/OpenType) font format.\n\nAt the same time, Adobe's output of original designs slowed, and in the 2000s it became just a trickle. This was due both to cutbacks in font development staff and funding, and also to the increasing size and complexity of the typefaces Adobe produced, in terms of multilingual coverage and typographic features.\n\nDespite being at the cutting edge of type technology, Adobe's type designs have generally been regarded as fairly conservative by the type community (despite a brief foray of adventurousness in the late 1990s). However, arguably this has kept Adobe typefaces from suffering from the \"flavor of the month\" phenomenon of passing popularity.\n\nwebsite  \n [http://www.adobe.com/type](http://web.archive.org/web/20150205003524/http:/www.adobe.com/type \"http://www.adobe.com/type\")\n\n",
  "author": "Miguel Sousa",
  "time": "4 Nov 2005 — 11:04pm",
  "uid": "1844",
  "comments": [

  ]
}
