{
  "id": "16052",
  "title": "Estimated Symbol",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Can anyone tell me what keys access the Estimated Symbol in an opentype font?\n\nJohn\n\n",
  "author": "sullivanj",
  "time": "4 Nov 2005 — 1:54pm",
  "uid": "6155",
  "comments": [
    {
      "time": "4 Nov 2005 — 1:58pm",
      "content": "In Windows ALT+8494\n\n"
    },
    {
      "time": "4 Nov 2005 — 2:03pm",
      "content": "\"ALT+8494\"\n\nReally?! Man, you had better have all your fingers and no arthritis for that one!\n\nChrisL\n\n"
    },
    {
      "time": "4 Nov 2005 — 2:04pm",
      "content": "Thanks for your help Simon. I forgot to mention I am on a Mac.\n\nAnyone know the key command for the Estimated Symbol (funny-looking European e) on a Mac?\n\n"
    },
    {
      "time": "4 Nov 2005 — 2:09pm",
      "content": "google it.\n\n"
    },
    {
      "time": "4 Nov 2005 — 2:14pm",
      "content": "\\>Really?! Man, you had better have all your fingers and no arthritis for that one!\n\nIt's worse as you need to use the numeric keypad to type the number - so if you have a laptop - ouch. An alternative in Office apps is to type the Unicode code point 212E and then hit ALT X and it converts it into the character.\n\n\\>I forgot to mention I am on a Mac.\n\nI'd be interested in how you get to it on the Mac - esp. if they let you do it in less than five/six keystrokes - that would be clever.\n\n"
    },
    {
      "time": "4 Nov 2005 — 2:15pm",
      "content": "I don't think there is a way to type it on a Mac. If you are running OS X, you can use the Character Palette (which can be enabled via the International control panel) to insert it. Note, this only will work in more recent applications. If you have the Adobe CS apps, you can use the Glyph palette in a similar way. Vis: ℮\n\n"
    },
    {
      "time": "4 Nov 2005 — 2:21pm",
      "content": "\"you can use the Character Palette\"\n\nBetter that than playing fifty-finger Yoga like the Windows command Si posted.\n\nChrisL\n\n"
    },
    {
      "time": "4 Nov 2005 — 2:30pm",
      "content": "Don't be mean. Windows has had a character palette a lot longer than the Mac has.\n\n"
    },
    {
      "time": "4 Nov 2005 — 2:40pm",
      "content": "Please No! not another Mac/PC pisssing contest:-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Nov 2005 — 2:42pm",
      "content": "Thanks Mark,  \nI will give that a go in AICS.\n\nJohn S\n\n"
    },
    {
      "time": "4 Nov 2005 — 3:07pm",
      "content": "_Please No! not another Mac/PC pisssing contest:-)_\n\nWait--I'm a Mac guy! Who's side do you think I'm on, anyway? :-) Different 'strokes for different folks...\n\n"
    },
    {
      "time": "4 Nov 2005 — 4:35pm",
      "content": "The chap specifically asked \"what keys\" - saying CharMap wouldn't have answered the question.\n\nI wasn't trying to be clever or start something! Honest!\n\nSi\n\n"
    },
    {
      "time": "4 Nov 2005 — 5:19pm",
      "content": "Sullivan J, you can also just copy the estimated symbol from Mark's post, or this one: ℮  \nThen go and paste it in your CS app, and switch the font. Note that very few fonts will have the symbol; only certain OpenType fonts contain it. The System fonts should have it, for example.\n\nI agree with Si: Let's please avoid another salvo in the Mac v Windows war. They're both good. They're both bad. They're both wonderful. They're both frustrating. They're both imperfect, because only Allah is perfect...\n\n"
    },
    {
      "time": "4 Nov 2005 — 5:45pm",
      "content": "All of Adobe's OpenType fonts have the estimated symbol, fwiw. (Well, not counting dingbat/pi fonts.)\n\nT\n\n"
    },
    {
      "time": "5 Nov 2005 — 12:00am",
      "content": "Si,\n\nSome widescreen laptops have a numererical keypad, like my HP. :-)\n\n"
    },
    {
      "time": "5 Nov 2005 — 8:56am",
      "content": "\\> Some widescreen laptops have a numererical keypad, like my HP. :-)\n\nPlease, please we shouldn't be using this forum to promote particular brands ;-)\n\nSi\n\n"
    },
    {
      "time": "6 Nov 2005 — 12:03am",
      "content": "Si,\n\nGood point, who is it that you work for again? ;-)\n\nThere's probably other manufacturers that have laptops with numeric keypads; this was a deciding factor when I was shopping around.\n\n"
    },
    {
      "time": "6 Nov 2005 — 10:02am",
      "content": "Thanks for your help guys. Finally got the estimated symbol after copying and pasting from your post here.\n\nJohn S\n\n"
    },
    {
      "time": "20 Jun 2013 — 7:49am",
      "content": "I've had the same frustration since upgrading to OSX 10.8.4. I copied the symbol from a Wikipedia website and paste it into my documents as needed: ≈  \nFrom my own keyboard, best substitute I've found is the isomorphism symbol, a single wavy line over an equal sign that can be accomplished in the font 'Symbol\" by striking the @ sign (capital 2). Second option is the equivalent symbol, a single wavy line on the capital key under your esc key upper left on your keyboard.\n\n"
    },
    {
      "time": "20 Jun 2013 — 7:57am",
      "content": "You could always create a text substitution shortcut for ℮:\n\n ![](http://web.archive.org/web/20150406023548im_/http:/typophile.com/files/shortcut_4145.jpg)\n\n"
    }
  ]
}
