{
  "id": "16064",
  "title": "I am stuck with this",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "Hi,\n\nI am trying a little exercice which is harder than I thought, I am not a typographer and I guess that shows.  \nWhat should I do to improve this logotype.\n\nThanks\n\n| Attachment | Size |\n| --- | --- |\n| [lunch01.gif](http://web.archive.org/web/20080704154553/http:/typophile.com/files/lunch01.gif) | 6.7 KB |\n| [lunch02.gif](http://web.archive.org/web/20080704154553/http:/typophile.com/files/lunch02.gif) | 6.71 KB |\n\n [‹ Experiments with Ambigrams](http://web.archive.org/web/20080704154553/http:/www.typophile.com/node/16212 \"Go to previous forum topic\") [Please critique booklet ›](http://web.archive.org/web/20080704154553/http:/www.typophile.com/node/16019 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080704154553/http://www.typophile.com/user/8785\" title=\"View user profile.\">sebsan</a>",
  "time": "<br>",
  "uid": "8785",
  "comments": [
    {
      "time": " 5.Nov.2005 8.14am",
      "content": "At the very least, I would make the flourishes less bold than the strokes that define the characters. How much less is a judgement call—enough that the word stands out sufficiently.\n\n"
    },
    {
      "time": " 5.Nov.2005 8.26am",
      "content": "I will go with Mark, the word looks imprisoned in all of that. Ask yourself what the flourish is attempting to accomplish, then make adjustments to that end.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Nov.2005 2.50pm",
      "content": "What about this? Better balanced?\n\n[lunch](http://web.archive.org/web/20080704154553/http:/www.lunchdesign.be/img/lunch03.gif)\n\nI’ve noticed that it is stronger (simple) shape in the counter-forms that give a better result to the florish. This is a good little exercise, I am learning a lot.\n\n"
    },
    {
      "time": " 5.Nov.2005 2.52pm",
      "content": "Much better!!! Quite nice!  \nD~\n\n"
    },
    {
      "time": " 5.Nov.2005 11.19pm",
      "content": "In most calligraphy, if the pen is not changing direction, there will not be a weight difference, because you keep the pen at the same angle throughout. For example, the longest portion of the L changes from very thin to fairly thick, but since you are barely changing direction this wouldn’t happen.\n\nAlso the thick/thin parts of the strokes are not occuring in the correct part of the loops. Similar loop formations will look the same - the bottom left loop in the L and the lowest loop in the logo should be nearly identical in that regard.\n\nIt might help to trace your logo with a calligraphy pen to see where the thickest parts should be and how the inner and outer shapes relate.\n\nThe logo as a whole looks very fun. Will this be going on a menu or is it just for practice?\n\n"
    },
    {
      "time": " 6.Nov.2005 2.10am",
      "content": "Hi,\n\nIt’s just an exercise, my graphic design office is called Lunch Design.\n\nI understand that I don’t respect the thin and thick strokes that would naturaly occur with a pen, I am cheating to get more supple result, is that a big NO, NO?\n\n"
    },
    {
      "time": " 6.Nov.2005 6.56am",
      "content": "Does this look more natural?\n\n[lunch](http://web.archive.org/web/20080704154553/http:/www.lunchdesign.be/img/lunch04.gif)\n\n"
    },
    {
      "time": " 6.Nov.2005 7.51am",
      "content": "That looks much better. The modulation of the thick and thin in the flourishes was off in the earlier versions. You seem to have got the right rhythm going in the newest one, and the curves look more natural.\n\n"
    },
    {
      "time": " 6.Nov.2005 8.54am",
      "content": "\\> if the pen is not changing direction\n\nHow often is this actually the case? I think this is an  \nillusion to project an impression of constance. Even in  \nmy beginning calligraphy class we had to change the  \nangle of the pen sometimes, like to prevent the “N”  \nfrom being monkey-butt-ugly.\n\nhhp\n\n"
    },
    {
      "time": " 6.Nov.2005 9.48am",
      "content": "A broad nib calligraphy pen is not the only way to draw letters, either. There is considerably more flexibility with a brush or quill pen, for example. This style appears most like a brush script to me. Ultimately, it’s a question of balance, rhythm and flow.\n\n"
    },
    {
      "time": " 6.Nov.2005 10.23am",
      "content": "Much better, but still - too heavy; mostly the orange area.\n\n ![](http://web.archive.org/web/20080704154553im_/http:/www.typophile.com/files/Untitled-1.png)\n\n"
    },
    {
      "time": " 6.Nov.2005 10.30am",
      "content": "\\> enough that the word stands out sufficiently.\n\nsee/study from the old masters:\n\n ![](http://web.archive.org/web/20080704154553im_/http:/www.typophile.com/files/Untitled-2.png)\n\n"
    },
    {
      "time": " 6.Nov.2005 11.21am",
      "content": "Good advice.\n\n"
    },
    {
      "time": " 6.Nov.2005 12.01pm",
      "content": "Thanks, I really appreciate your advice. This little—huge now—exercise is taking all my time and it makes my realise what a hard job it is to draw type.\n\n"
    },
    {
      "time": " 6.Nov.2005 12.17pm",
      "content": "As you know, piano playing needs a lot of practice. So the same - just practice.\n\n"
    },
    {
      "time": " 6.Nov.2005 1.50pm",
      "content": "Latest improvements. The type and the flourish don’t seem to match?!\n\n[lunch](http://web.archive.org/web/20080704154553/http:/www.lunchdesign.be/img/lunch07.gif)\n\nI quit for tonight or I am going to go coucou. By the way Mark, I really enjoy your articles about anachronistic type in movies. Very funy!\n\n"
    },
    {
      "time": " 6.Nov.2005 2.19pm",
      "content": "Thanks. It’s a sickness, I know, but at least some good comes out of it.\n\nRe: Lunch—I liked the previous one better.\n\n"
    },
    {
      "time": " 6.Nov.2005 2.32pm",
      "content": "Don’t kill yourself. Wait a day or two; try another one; and try another one without the “pretzel” (the h)\n\n"
    },
    {
      "time": " 6.Nov.2005 9.21pm",
      "content": "Pen direction would be “from point a to point b”; pen angle would be what angle you are holding the pen. In general, or I guess in basic calligraphy anyways, you would keep these fairly consistent. From a speedball book on italic:\n\n“The pen...is usually held between 30º and 40º for the miniscules and 25º for the capitals. The letters slant 5º to 7º to the baseline. Steepen the pen angle on the bold diagonal strokes to achieve a more even weight.”\n\nThe letters are definitely brush-based so perhaps experimenting with a brush is a better suggestion.\n\nSebsan..just leave it to us to take the fun out of calligraphy. :)\n\n"
    },
    {
      "time": " 7.Nov.2005 8.35am",
      "content": "Sebsan, I like the improvements you’ve made so far. However, I miss the teardrop terminals.\n\n"
    },
    {
      "time": " 7.Nov.2005 11.53am",
      "content": "Frankly, I fear this is becoming committee-designed!\n\nFlip back from the latest sample to the first. The first one has a lot of juice, playfulness, and the weight distribution on the swashes really is fine (This coming from an inveterate calligrapher). In the later versions all the fun is being canceled out and logical-ized. For a logo, it can be very lively and messy; see some of Ed Benguiat’s early copperplate confections. The only thing I would change about the original is to find a way to balance the density of the decorative strokes around Lunch in the middle. There could be more ornament to the left of L, less density above and more below. Otherwise I think it is very distinctive. Underware does things like this with hand lettering, and it can be very pleasing, without being undecipherable.\n\n"
    },
    {
      "time": " 7.Nov.2005 1.15pm",
      "content": "Hey Carl,\n\nYou’re right, I have maybe followed people’s advice a little too close. I guess the first one had something really fresh about it and I lost it in the last one. I will look into it a make sure I go back to that juicy spontanious swashes I had originaly drawn.\n\nThanks\n\n"
    },
    {
      "time": " 7.Nov.2005 1.54pm",
      "content": "This is maybe counter-intuitive but what about making the swashes even thinker/juicier? That would be contrast too.\n\n"
    },
    {
      "time": " 7.Nov.2005 5.08pm",
      "content": "\\> Frankly, I fear this is becoming committee-designed!\n\n?\n\n\\> The first one has a lot of juice, playfulness, and the weight distribution on the swashes really is fine\n\n??\n\n\\> For a logo, it can be very lively and messy\n\n???\n\n"
    },
    {
      "time": " 7.Nov.2005 11.25pm",
      "content": "I would go for the second one. It has a bit more symmetry; the swashes enclose the whole design, and it is more balanced. Closer to what david shows with “Honor”.\n\nYou still need to contrast between the swashes and the letters, and Eben’s concept may work. It will be something “un-expectable” but ...\n\n"
    },
    {
      "time": " 9.Nov.2005 4.16am",
      "content": "Hi im new here\n\ni dont think the logo will stand for more then a year,  \nthis flowers look too trendy , and if you’d like it to stand  \nfor long, i would suggest that you listen to  \nthe ppl who talked about the thick and the thin.\n\n"
    },
    {
      "time": " 9.Nov.2005 12.38pm",
      "content": "Hey g\\_u\\_y\\_t,\n\nThis is not a logo, it’s practise. It doesn’t have to stand the test of time. I was hoping to get criticism on its formal aspect. Hopefuly, that way I can learn a bit about caligraphy and type.\n\n"
    }
  ]
}
