{
  "id": "16068",
  "title": "Font suggestions & logo critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello,  \nI've been a reader for quite some time, first time poster, however.  \nAnyway, I'm seeking feedback/critique/suggestions on this logo I'm creating for an industrial machine company in New England.  \nThey are looking for something that says \"patriotic\" and \"old New England\".  \nI'm pretty happy with my work-in-progress, although I'm not quite sold on the font yet.  \nI've been a working designer for about 5 years, but I'm the first to admit typography is not my forte, although I am facinated with it, hense my interest in the Typophile site.  \nI guess what I'm looking for is \"that perfect font\" (hey, who isn't?!) to fit this situation. As I mentioned, it needs to say \"old New England\". Yet it also needs to be condensed, or at least very narrow, as I'm happy with the proportions of the flag to the type as it is now.  \nMaybe my chosen font is okay? If so, feel free to say that as well!  \nAs a point of interest, the flag I've created is basically a combination of the \"unofficial\" New England flags of the revolutionary period and our current US flag.  \nPlease feel free to comment on the logo in general as well.  \nThanks alot for your help!  \nGreg\n\n| Attachment | Size |\n| --- | --- |\n| [NEM.gif](http://web.archive.org/web/20111225034203/http:/typophile.com/files/NEM.gif) | 5.9 KB |\n\n",
  "author": "<a href=\"/web/20111225034203/http://typophile.com/user/10004\" title=\"View user profile.\">gpepin</a>",
  "time": "<br>",
  "uid": "10004",
  "comments": [
    {
      "time": "",
      "content": "ok im just gonna start with commenting in general...i dont know why but \"They are looking for something that says “patriotic” and “old New England” ...seems like you have got that with the colours and all,and i initially thought the logo would be a bit more like a coat of arms?what you have got works but it feels too wide,because you have to balance out the flag pole 'L',i would get the flag separte from the L make it bigger and then place it behind  \n\"New England  \nMachinary\"  \ntry it out ,also what about cogs that change into stars in a circle around that text?(like the really old american flag u guys use to have.)  \nanyway thats my thoughts,better i left something than nothing i guess.(looking at the 60 people who read and didnt say anything)  \nand as for the font,sorry i have no clue there...old english?!..see no clue.\n\n"
    },
    {
      "time": "",
      "content": "I am sold on the flag idea. what about just having a type that suggest New England (maybe look at the Boston press for ideas) and make something with it that suggest the robustness of the machines.\n\n"
    },
    {
      "time": "",
      "content": "I think he means he isn't sold on the flag.\n\nI think he is right that you might try some more ideas out. How about taking a circle of stars ( very betsy ross you know ) & making it look embossed like it was in iron? Actually, what kind of machine work do they do? Maybe that should be hinted at in the logo too.\n\n"
    },
    {
      "time": "",
      "content": "You're right Eben! Can't believe I wrote the opposite of what I wanted to say.\n\n"
    },
    {
      "time": "",
      "content": "This is another case of going to the computer rather than using a pen on a napkin. To much excution and not enough thought. Eben's thought on the Betsy Ross flag could be right on. The thirteen colonies and all. Try something simple like the name on three lines within the thirteen stars. The type doesn't say New England to me and I've lived most of my life in Connecticut. Try this do some research, do a google search. Find old New England symbols like Eagles with the flag.\n\nOn a side note you should listen to Stan Freberg Presents The United States of America. Track 9 would make you crack up Betsy Ross and The Flag \"Everybody Wants to be an Art Director\"\n\n"
    },
    {
      "time": "",
      "content": "Hey, Sebastien, it's easy to do. But it's easy to fix also.\n\nUnder your posts it says\n\n'edit | reply'.\n\nIf you want to click on 'edit' and you can change/correct what you said, correct spelling, add to what you said, etc.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "Alternate type suggestion, if still needed.: ' [Bureau Grotesque](http://web.archive.org/web/20111225034203/http:/www.fontbureau.com/fonts/BureauGrotesque)'..\n\nDav, [formlos](http://web.archive.org/web/20111225034203/http:/www.formlos.net/)\n\n"
    },
    {
      "time": "",
      "content": "Thanks Eben, I think I will leave like that for chronology.\n\nCheers\n\n"
    },
    {
      "time": "",
      "content": "Thanks formlos; just the kind of suggestion I'm hoping for. This is a down and dirty job, and I'm not going to be spending a lot more time developing new concepts, although the ideas, suggestions and feedback I've received thus far are appreciated... particularly Dan's theory about hitting the computer without enough up-front work... you're right! But, as I mentioned, down and dirty.  \nI'm still hoping for a few more font suggestions, but the Grotesque seems interesting, and usable.\n\n"
    },
    {
      "time": "",
      "content": "Track 08 0:50  \nthis will play in I Tunes and maybe some other formats.\n\n"
    },
    {
      "time": "",
      "content": "To Dan :\n\nWhatchu tawkin about Willis?\n\n"
    },
    {
      "time": "",
      "content": "Eben George Washington is complaining to Betsy Ross about the design of the American flag. The same colors as the British flag and whats with the stars when I asked for pokadots. I'll see if I can find a printed transcript of the tune.\n\n"
    },
    {
      "time": "",
      "content": "Freberg is a riot. Somewhere in the dusty bowels of my basement is a 33 1/3 LP of the same thing Dan is talking about. It was one of the first comedy \"albums\" that I bought as a youth.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Dan, Was that an attempt to link to the track? That would have made sense!\n\n"
    },
    {
      "time": "",
      "content": "What about some wood type? [A myfonts.com search](http://web.archive.org/web/20111225034203/http:/www.myfonts.com/search?search%5Btext%5D=wood+type) yields some interesting results. It has a slab serify, old world commerce, condensed look with lots of character but not too much. There will be a lot of Wild West-ish fonts, but you'll probably find something with enough strength and character to stand up and stand out.\n\nAlso, another tack is going for the more American revolution, late 18th century historical look, but that might not give you the muscle and condensed look you need.\n\n"
    },
    {
      "time": "",
      "content": "Eben It was an attempt to link to the track but failed miserably. It is a funny album and is about 40 years old.\n\n"
    },
    {
      "time": "",
      "content": "Dan, thanks for attempting it!\n\n"
    },
    {
      "time": "",
      "content": "Chris remember to: Take an Indian to lunch today… and: \"What do you mean you cooked the Turkey\"\n\n"
    },
    {
      "time": "",
      "content": "Eben, Tim you should like this song\n\nSong: Everyone Wants to Be An Art Director\n\nSung by: Betsy Ross and George Washington\n\nLook at the colors you chose!  \nThe best you could do, I suppose--  \nA peppermint stripe on royal blue,  \nThe same as the British colors, too,  \nNow how will we tell whose side is who?  \nLook at the colors you chose!\n\nWhy couldn't it have been puce?  \nLavender over chartreuse?  \nOr possibly some exotic shade--  \nDelicate orange, mauve or jade  \nInstead of the choice that has been made?  \nWhy couldn't it have been possibly cinnamon?\n\nEverybody wants to be an art director,  \nEverybody wants to call the shots.  \nEverybody wants to be a flag dissector,  \nChanging all my stars to polka-dots.  \nEverybody thinks that they're the final word on  \nWhat is strictly \"out\" and what is \"in!\"  \nHow would you like a flag that features  \n”Fleur-de-lys” on ochre corregated TIN?\n\nGeorge Washington: I’d like it. How soon can you make one up?\n\nBetsy Ross: Come on, there’s your flag. Take it or leave it.\n\nGeorge Washington: Alright. Say, what’s this little ticket here that just fell out, “Inspected by Number 28?”\n\nBetsy Ross: That’s me.\n\nGeorge Washington: Oh, yeah.\n\nBetsy Ross: You want it on a hanger?\n\nGeorge Washington: No, I’ll just run it up the flagpole, see if anybody salutes.\n\nBetsy Ross: Okay.\n\nGeorge Washington: I guess it’s better than “Don’t Tread on Me.”\n\nBetsy Ross: Certainly. Besides, a hundred years from now, what the heck difference will it make?\n\nGeorge Washington: I guess you’re right. (goes out the door) Come on, men!\n\n"
    },
    {
      "time": "",
      "content": "Sweet!\n\n"
    }
  ]
}
