{
  "id": "16083",
  "title": "African fonts",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,  \ni'm a journalist and i'm going to work in a french panafrican satyrical magazine. As i'm going to be involved in the editing, i'm wanting to give suggestions about typography. As it is now, it's poor, and hasn't any relation to Africa — times for text, and standart uninteresting fonts for titling.  \nSo i'm interested about any fonts related to Africa all of you know. By this, i mean two things:  \n— fonts by african designers, or people with african roots, even without an \"African look\"  \n— fonts inspired by Africa, with somewhat of an Africa feeling. Here's the African look.\n\nI have looked on google and not find much interesting things, and on here, which drove me to Building lettres but as for now, the site is empty.\n\nThanks for any help.\n\n",
  "author": "ponofob",
  "time": "6 Nov 2005 — 10:38am",
  "uid": "1804",
  "comments": [
    {
      "time": "6 Nov 2005 — 10:52am",
      "content": "This book is pretty good - [http://www.markbattypublisher.com/servlet/book\\_view?number=9](http://web.archive.org/web/20141015225046/http:/www.markbattypublisher.com/servlet/book_view?number=9 \"http://www.markbattypublisher.com/servlet/book\\_view?number=9\")\n\nLists a number of African type designers. As I recall the Building Letters Issue 1 CD has a few fonts from African designers perhaps someone here will have have a pointer to somewhere you can still get the magazine.\n\n"
    },
    {
      "time": "6 Nov 2005 — 11:04am",
      "content": "This books looks indeed interesting, i read about that guy while searching on my topic, but it seems to be essencially about african alphabets, in non-latin writting, while i'm searching latin fonts.  \nI d'like to get the first issue of BLetters, but i wait for someone to tell me how.\n\nSomething else : i need text fonts, not only display one. That's important.\n\ni think that using egyptian fonts might be an interesting thing; using something african by its classificvation. Algerians interest me less, as i think they don't fit well a newspaper.\n\n"
    },
    {
      "time": "6 Nov 2005 — 11:21am",
      "content": "My copy of the book is in the Office, but I've got a feeling it goes beyond the historic scripts, but I may well be blurring Building Letters 1 and Afrikan Alphabets in my own mind.\n\nWould your readers associate \"Egyptian\" and \"Algerian\" style types with Africa? Even if these styles had African origins they've been assimilated into everyday global use.\n\n"
    },
    {
      "time": "6 Nov 2005 — 11:31am",
      "content": "I don't think the readers would realise the links, but my idea is to gather elements of typographic design that rely on an african identity, even if it's not obvious. It's more about searching something true, and coherent, than to make it totally obvious. I'll be fine with using a serif type which doesn't look african at all but which was made by a designer from Africa.\n\n"
    },
    {
      "time": "6 Nov 2005 — 11:47am",
      "content": "Building Letters, you could try contacting Jim Richardson, who organized it, and used to be a frequent Typophiler.\n\nI designed the Worldwide typeface in 1999, for the Worldwoman project, which has mainly used it for AfricaWoman. [http://www.africawoman.net](http://web.archive.org/web/20141015225046/http:/www.africawoman.net/ \"http://www.africawoman.net\")  \nThe face is also used by several South African papers, such as the Sowetan, and Sunday Times (both Jo'burg) and Weekend Post (Port Elizabeth).\n\nSo although it's a Century adaptation by someone who's never been to Africa, it has a bit of provenance.\n\n"
    },
    {
      "time": "6 Nov 2005 — 11:53am",
      "content": "Wayback machine has some archived content from the BL site...\n\n[http://web.archive.org/web/20040208180402/http://buildingletters.org/](http://web.archive.org/web/20141015225046/http:/web.archive.org/web/20040208180402/http:/buildingletters.org/ \"http://web.archive.org/web/20040208180402/http://buildingletters.org/\")\n\nSi\n\n"
    },
    {
      "time": "6 Nov 2005 — 4:52pm",
      "content": "Will you need to be able handle text in African languages, or only in English or other European languages? If so, this may dictate what fonts will be useful, since many African languages use letters and diacritics that are not part of European character sets.\n\n"
    },
    {
      "time": "6 Nov 2005 — 6:49pm",
      "content": "\\> Egyptian\n\nThat style really says nothing about Egypt. And anyway  \nEgypt is arguably the least African country in Africa! :-/\n\nI might instead look to the fauve, \"naturalist\" style of  \ntype coming out of South America the past few years,  \nand Eastern Europe the past few decades.\n\n--\n\nBut really, it will be quite hard to find a typeface that evokes Africa in both a subtle enough way to really work for text, and a strong enough way to actually matter. I have a feeling you need a custom font - second time tonight I'm recommending that! :-/\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2005 — 7:59pm",
      "content": "Brode Vosloo is a South African type designer (Shoe repairs).\n\n"
    },
    {
      "time": "6 Nov 2005 — 8:02pm",
      "content": "And it seems he even has a Typophile membership!\n\nAlso: there's those I-Jusi guys (once featured in  \nBaseline, I think) - they might have ideas/leads.\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2005 — 9:13pm",
      "content": "You're right Hrant, but i don't know, the oldness, mecanical and rough feeling of Egyptiennes fits Africa in my view, better, anyway, than any other serif. The name is more a pretext than anything else. I'm looking Storm's Farao... And Peter Bruhn one.  \nThe paper survive with difficulties, it hasn't any ads so there is no room for a custom type. Alas. That would be indeed the good idea.  \nNick, that could have been nice, but if so many papers use it...  \nJohn, the language is french only.  \nAbout M. Vosloo, i saw some nice display types, but taht doesn't resolve my n° 1 problem: text. And a display sans usable for short text.  \nIt is not easy...\n\n"
    },
    {
      "time": "6 Nov 2005 — 9:28pm",
      "content": "\\> the language is french only.\n\nThat gives me an idea. Maybe use a font that conveys what Africa <cite>used</cite> to be about: colonialism. Not anything to celebrate, certainly, but a central part of its reality nonetheless. So I might suggest a face typical of mid-to-late-19th-century France, like a Latine or an Elzevir: those styles can have a nice, bittersweet air of nostalgia for a time when imperialism was motivated by sort of a romantic chauvinism (\"we need to force them become like us, for their own good\") more than by the mere crass, brutal materialism of today.\n\nSee this:  \n [http://typophile.com/node/7596](http://web.archive.org/web/20141015225046/http:/typophile.com/node/7596 \"http://typophile.com/node/7596\")\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2005 — 9:37pm",
      "content": "Oh, and National Geographic recently had a really  \ngood Africa issue: [http://typophile.com/node/14848](http://web.archive.org/web/20141015225046/http:/typophile.com/node/14848 \"http://typophile.com/node/14848\") \\_  \nIt might give you a lot of ideas.\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2005 — 10:14am",
      "content": "The colonial idea is quite nice, but as the paper is satyrical, badmouthing (intelligently) as much about African leaders as about ex-colonialists, so i'm not sure it would be the better idea.  \nThe thing is complex : i don't want to use african clichee, with tribe symbols etc, but i still search something about African identity.\n\n"
    },
    {
      "time": "10 Nov 2005 — 10:06pm",
      "content": "You could try asking Chaz Maviyane-Davies at the Massachusetts College of Art in Boston.  \n [http://maviyane.com/](http://web.archive.org/web/20141015225046/http:/maviyane.com/ \"http://maviyane.com/\")\n\nor the Swikiri forums:  \n [http://www.swikiri.com/](http://web.archive.org/web/20141015225046/http:/www.swikiri.com/ \"http://www.swikiri.com/\")\n\n"
    },
    {
      "time": "11 Nov 2005 — 4:42pm",
      "content": "Thanks !  \nFor the moment and the next issues, i have accepted the fact i will not be able to use, as i've still not found, \"african\" fonts, (for text i mean; the few display faces i have been able to see didn't really please me or didn't fit the whole thing) but if theses people can help me to find something interesting for the next months, that would be nice.\n\n"
    },
    {
      "time": "16 Nov 2005 — 3:10pm",
      "content": "if i remember right, brode vosloo was a founder of sacred nipple, which no longer seems to exist. the south african foundry focused specifically on so-called vernacular african design and typography; see [Gross Akzident F\\*cked](http://web.archive.org/web/20141015225046/http:/typeindex.org/font.php?id_font=87).\n\ni also seem to remember seeing a post or two from him here, back in my lurking days.\n\n"
    }
  ]
}
