{
  "id": "16098",
  "title": "Checkout this new display font (on study yet, off course)",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hi there!!!\n\nSome of you may remember a typeface I posted for critique about two years ago ( [http://typophile.com/node/722](http://web.archive.org/web/20150423163456/http:/typophile.com/node/722 \"http://typophile.com/node/722\") )\n\nI'm beginning a new font, base on the upper A of that old attempt.\n\nI guess the reason I couldn't finish that first one was because the form of the characters were too unusual, and togheter, they didn't match and were too uneven.\n\nOn my new shoot, I'm thinking about making more usual forms, and having the \"opened and fresh look\" only on some single characters...like A a g (for now)\n\nAnyway... this is my first roughs on the computer:\n\nWhat do you think?\n\nthks a lot!!\n\n| Attachment | Size |\n| --- | --- |\n| [After\\_02.gif](http://web.archive.org/web/20150423163456/http:/typophile.com/files/After_02.gif) | 7.44 KB |\n\n",
  "author": "haag",
  "time": "7 Nov 2005 — 3:57am",
  "uid": "2079",
  "comments": [
    {
      "time": "7 Nov 2005 — 11:17am",
      "content": "Interesting. Using the idea of gestalt to complete the form. The smaller you preview it the more complete the shapes become. Keep going.\n\n"
    },
    {
      "time": "9 Nov 2005 — 9:59am",
      "content": "Hi!!\n\nI've worked more on the g as suggested by Rafael Neder, a brazilian colleague on other forum.\n\nHere is a PDF to help you take a closer look...\n\nMiss Tiffany, thks, this gestald effect is indeed interesting: as the smaller we preview, more complete the shapes will be. On this PDF I have previewed various sizes to check this out easily. Thks for your comment again.\n\n[http://www.focodesign.art.br/bytype/after\\_03.pdf](http://web.archive.org/web/20150423163456/http:/www.focodesign.art.br/bytype/after_03.pdf \"http://www.focodesign.art.br/bytype/after\\_03.pdf\")\n\n\"see\" ya guys\n\n"
    },
    {
      "time": "9 Nov 2005 — 2:50pm",
      "content": "For now, there is only one glyph who disturbing me. The g looks too me a double storey, did you try the one storey one? Other suggestion for the g is may be reduce the size of the bowl that seems to be to close of the o. Also the angle of the lower «storey» give an oblique aspect to the g.\n\nGood work,keep going.\n\n"
    },
    {
      "time": "22 Nov 2005 — 2:28am",
      "content": "Thanks Sim, I will try the single storey g. It may fit well on this font.\n\nSee, I've heard (and proved this in practice) that typedesign is 10% inspirarion (designing the concept) and 90% transpiration (the hard work on extending the concept over the entire font). Keeping this is mind, before I start designing the rest of the characters, I've made another version of n o a h, with shapes more fluid, really display like. You can compare this new version with the old one on this pdf ( [www.focodesign.art.br/bytype/After\\_03\\_04.pdf](http://web.archive.org/web/20150423163456/http:/www.focodesign.art.br/bytype/After_03_04.pdf \"www.focodesign.art.br/bytype/After\\_03\\_04.pdf\") )\n\nLooking at a distance now, version 3 lowercases seem too rounded and \"correct\", like a text font lower characters. They don't seem to match the wildness of the cap A.  \nVersion 4 have some straight angles and fits better with the cap A (my reference for inspiration).\n\nI'm stuck on this doubt...\n\nWhat do you think? I would reaaally appreciate everyones opinion...\n\nthks  \nFabio\n\n"
    },
    {
      "time": "22 Nov 2005 — 2:31am",
      "content": "Maybe those lowercases can become a text version of this display typeface?\n\n"
    },
    {
      "time": "22 Nov 2005 — 8:57am",
      "content": "Sorry, on my PDF, by mistake I have inverted the labels \"Version 3\" and \"Version 4\"...\n\n"
    },
    {
      "time": "25 Nov 2005 — 11:19am",
      "content": "I don't know for other folks but the second pdf (after\\_03\\_04) doesn't work to me.\n\n"
    },
    {
      "time": "26 Nov 2005 — 5:57am",
      "content": "Sim, thanks for asking... maybe that's why I didn't get any feedback by now... : )\n\nAnyway, the PDF openned fine t me. So I'm post a high-res GIF...\n\nHere: [www.focodesign.art.br/bytype/After\\_03\\_04.gif](http://web.archive.org/web/20150423163456/http:/www.focodesign.art.br/bytype/After_03_04.gif \"www.focodesign.art.br/bytype/After\\_03\\_04.gif\")\n\n"
    },
    {
      "time": "26 Nov 2005 — 8:56am",
      "content": "Haag, your second attempt works well, but are you able to prepare a pdf file instead of gif file. I'm not sure if the ragged edge is a part of your typeface thats what the gif file give on screen. You could also insert a gif file in your post and add a pdf file in link.\n\nPersonnaly I prefere the version 4, the round curve of that forth version has a better look to me. Keep going and keep up in touch of your next develpment.\n\nBTW, is there a something new on the diplay typeface you talking about on your introduction?\n\n"
    },
    {
      "time": "26 Nov 2005 — 9:37am",
      "content": "Hi Sim!\n\nAbout that 4th version you appreciated most... don't you think it is too similar as Dax, wich is beeing too used? Those lowercases have the same principles. And, since this my attempt is to project a display face, that needs to \"call attention to itself\" I guess it needs to differenciate as much as it can. I think the cut angles mixed wth some curve ones gives the characters a more particular feeling and contrast.  \nBut I will for sure keep those characters for further development later.\n\nHere is a new PDF (I hope this one works... please tell if it doesn't) and also a GIF:\n\n[www.focodesign.art.br/bytype/After\\_06.pdf](http://web.archive.org/web/20150423163456/http:/www.focodesign.art.br/bytype/After_06.pdf \"www.focodesign.art.br/bytype/After\\_06.pdf\")  \n [www.focodesign.art.br/bytype/After\\_06.gif](http://web.archive.org/web/20150423163456/http:/www.focodesign.art.br/bytype/After_06.gif \"www.focodesign.art.br/bytype/After\\_06.gif\")\n\n\"see\" ya!\n\n"
    },
    {
      "time": "26 Nov 2005 — 9:41am",
      "content": "Oh I forgot, Sim, about that old typeface you asked, it is on hold... I actually thinking about using to concept of those uppercases on this new one we're discussing.\n\n"
    }
  ]
}
