{
  "id": "16090",
  "title": "Organizing your font files",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "We mostly have much more fonts than we normally need, I’m no exception. Thus I was organizing my font files by splitting then apart in categories so I could enable just the kind of font I would like to work with.\n\nAfter a while I became confused.\n\nI really don’t know how to divide then. I don’t know whether to usa the habitual font categorizations or create my own system based on their usage rather then on their “academic” category.\n\nParticularly I would like to split then in some kind of formal categorization but, since I’m not an expert, sometimes it get’s tricky to tell a Slab Serif font from an Transitional, for example.\n\nSo, I really would like to hear from you guys how do you deal with font files organization.\n\n [‹ John Hudson](http://web.archive.org/web/20080103050515/http:/typophile.com/node/9158 \"Go to previous forum topic\") [Six degrees of separation - Le Monde redesign ›](http://web.archive.org/web/20080103050515/http:/typophile.com/node/16071 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080103050515/http://typophile.com/user/6318\" title=\"View user profile.\">souljacker</a>",
  "time": "<br>",
  "uid": "6318",
  "comments": [
    {
      "time": " 6.Nov.2005 7.19pm",
      "content": "If you use Linotype’s new (and free) Font Explorer X (Mac only so far), you can make as many categories as you like, and the same font can be in more than one category. Other font management tools have this capability as well.\n\nThere is an old type specimen catalog that was put out by Phil’s Photo (now known as Phil’s Fonts) around 1980. It had what I thought was a very helpful way of categorizing its fonts. Here are the categories:\n\nEvenly weighted sans serifs  \nThick and thin sans serifs  \nBracketed serifs  \nRuled serifs [e.g., Bodoni]  \nSpur serifs  \nSoft serifs  \nSquare serifs  \nExtra light  \nUltra bold  \nCondensed  \nItalics  \nScripts  \nInline/Outline/Contour/Shaded  \nOrnate  \nRustic\n\nThe actual categories they used are not important. The thing is to come up with categories that are meaningful to you and to allow the same font to be listed in more than one category. If you limit each font to only one category, you will never come up with a usable system. This limited idea probably goes back to font catalogs or reference books in which each font could only be listed once to save space or money, so they had to decide which one of possibly several categories a font could fall under.\n\n"
    },
    {
      "time": " 6.Nov.2005 7.24pm",
      "content": "Nice listing Mark! Thanks!\n\nChrisL\n\n"
    },
    {
      "time": " 7.Nov.2005 6.18am",
      "content": "I use sub groups from the Vox’s  \n [http://www.bilkent.edu.tr/~segalini/vox13.jpg](http://web.archive.org/web/20080103050515/http:/www.bilkent.edu.tr/~segalini/vox13.jpg \"http://www.bilkent.edu.tr/~segalini/vox13.jpg\")  \n01. Humanistic  \n02. Antique Roman  \n03. Transitional  \n04. Modern Roman  \n05. New Transitional  \n06. Egyptian  \n07. Linear Geometric  \n08. Linear Grotesque  \n09. Linear Neogrotesque  \n10. Linear Humanistic  \n11. Stone Carved  \n12. Calligraphic  \n13. Stylized\n\nRegards,  \nAS\n\n"
    },
    {
      "time": " 7.Nov.2005 10.46am",
      "content": "Thank you very much guys. Mark’s scheme looks best to my profile, since I cannot aways tell one kind of font from another.\n\nIt would be cool to hear more from others also.\n\nThanks again.\n\n"
    },
    {
      "time": " 7.Nov.2005 12.12pm",
      "content": "I group mine by foundry, and that is all. I know what I have, and it saves me bothering with catagories which are totally arbitrary anyway.\n\nIt’s just the vibe of the thing.\n\nKris.\n\n"
    },
    {
      "time": " 7.Nov.2005 7.55pm",
      "content": "If you know what you have, go with kris’ idea.\n\nGroup your fonts by foundry and/or designer. Take Martin Majoor. In my Martin Majoor folder I’d have the Scala collection, Nexus collection, Seria, and so forth. When I think of Martin Majoor, I think of clean, amazingly legible, humanist slab-serifs with perfectly suited, accompanying sans faces.\n\nThese days we are blessed with plenty of serif faces with an accompanying sans. They are designed to work together, so you might as well keep them together under the designer’s name.\n\n"
    },
    {
      "time": " 8.Nov.2005 8.37am",
      "content": "There has been an interesting thread on this topic back on March 2005,  \nI remember that because of the unusual Borges list by Mr. John Hudson :  \n [http://www.typophile.com/node/9757](http://web.archive.org/web/20080103050515/http:/www.typophile.com/node/9757 \"http://www.typophile.com/node/9757\")\n\nRegards,  \nAS\n\n"
    },
    {
      "time": " 8.Nov.2005 8.46am",
      "content": "I organize mine by foundry.  \nIn Font Explorer I have smart sets set up for different categories.\n\nWorks pretty good for me.\n\n"
    },
    {
      "time": " 8.Nov.2005 9.19am",
      "content": "I group by foundry as well. I will have to work my way up from newb status though before I venture into smart sets.\n\n"
    }
  ]
}
