{
  "id": "16105",
  "title": "The @ character in metal typesetting",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I have a fantasy of having my own business card made with metal letterpress on fine cotton paper. I don't know that much about hot metal typesetting. In fact, I had the idea yesterday and I began looking for more information today. I already found a printer that still owns a Linotype machine, but I haven't contacted him yet.\n\nThe problem is : my business card will include an e-mail address...\n\nWhat will happen with the @ character ? This character has been around for many many years before we started using it in e-mail addresses. But was it part of the regular metal letter repertoire ?\n\nAh ! The joy of mixing old and new technologies !\n\n",
  "author": "cedilla",
  "time": "7 Nov 2005 — 9:41am",
  "uid": "2763",
  "comments": [
    {
      "time": "7 Nov 2005 — 9:47am",
      "content": "Since this is Design, I would first ask: is this fetishism  \ngoing to have a certain intended effect on the user?\n\nThe \"at\" sign: older fonts tend to have it too high, and  \nusually too large\\* to work well for email. Certainly the  \neasiest solution is to use an \"at\" sign from a smaller size,  \nand lead it on top to lower/fit it. A more sophisticated way  \nis to go with photopolymer letterpress, which lets you print  \nvirtually anything you can make on your computer (but it  \ncosts a lot more).\n\n\\* And sometimes even slanted.\n\nhhp\n\n"
    },
    {
      "time": "7 Nov 2005 — 10:16am",
      "content": "In metal type, the @ symbol was a sort which you bought separately from fonts. Linotype had only one or two designs. Same with ATF and others, I suspect. The practice of designing it to match the design of a font is fairly recent.\n\n"
    },
    {
      "time": "7 Nov 2005 — 10:26am",
      "content": "I have set e-mail addresses in metal, with fonts that didn't have an ampersand sort, before. What I did (and I stole this idea from someone else at RISD at the time…) was to set the address so:\n\nname (a) e-mail.com\n\nMaybe not the most spectacular solution, but it works.\n\n"
    },
    {
      "time": "7 Nov 2005 — 10:27am",
      "content": "[http://www.connare.com/matrix.htm](http://web.archive.org/web/20131018031744/http:/www.connare.com/matrix.htm \"http://www.connare.com/matrix.htm\")\n\nThis 'at' starts to appears in the Monotype pattern C (book and news) matrix case. English-standard character set with the 'per' character.  \nsee:  \nLegros and Grant, Typographical Printing-Surfaces: The Technology and Mechanism of their production. London: Longmans, Green and Co., 1916. pp. 393, 397.\n\nAs far as my memory goes it was appearing in largely American sorts at the begining of the last century. It was commonly used in commerce.  \n(hence the full name of 'at cost').  \nsorry about the grey text on the site I changed my css style file since I made this htm.\n\n"
    },
    {
      "time": "7 Nov 2005 — 10:40am",
      "content": "Does the \"per\" have a unicode designation?\n\n"
    },
    {
      "time": "7 Nov 2005 — 11:38am",
      "content": "That's good news ! Thanks everyone. I understand the @ was a standard symbol. I just hope my printer has it! And the ( a ) solution is very cute and interesting. I love it.\n\nhrant, I'm not sure i understand your question (english being my second language) Do you mean \"what is the purpose/concept of using this kind of printing on a business card ?\".\n\nIt's about putting emphasis on fine details. And a crafted and unique business card would reflect the delicate and sensitive side of the human being. I see business cards like this: it's a little part of someone, given to someone else. It is highly personnal!\n\nAnd I have to admit it's very interesting to use such an old technique in a modern way.\n\n"
    },
    {
      "time": "7 Nov 2005 — 12:05pm",
      "content": "I see a lot of good things about letterpress. But I also see  \na certain widespread fetishism (like using day-glo inks and  \nslamming the type through overpriced paper) which I think  \nis not part of healthy design; your use of \"fantasy\" raises a  \nwarning flag in my head - like when a Famous Type Designer  \nsays he made an upright italic because he always wanted to...\n\nThat said, fine detail and good craft most certainly are healthy! :-)\n\nhhp\n\n"
    },
    {
      "time": "7 Nov 2005 — 12:51pm",
      "content": "\\>fetishism\n\nLetterpress, engraving, embossing, foil stamping, die cuts;  \nspot color inks, special paper stock;\n\nNow that so many people with DTP have access to \"professional\" graphics software and colour printers, it's good for graphic designers to maintain the more varied production techniques of the profession. It sets them apart and provides media richness. It's not fetishism. Part of the high tech world is the high touch counterflow.\n\n"
    },
    {
      "time": "7 Nov 2005 — 12:55pm",
      "content": "Variety is great - so is trying to set yourself apart.  \nBut abusing letterpress because it makes your nipples  \nfeel all funny isn't Design.\n\nhhp\n\n"
    },
    {
      "time": "7 Nov 2005 — 1:26pm",
      "content": "The thing is : in the past, I suggested letterpress to a couple clients, but they never seem to take it seriously (because of the cost / production time / etc.). I guess it doesn't fit their needs. And I don't blame them.\n\nIn this case, I am the client and I am the designer. I could make a super nice and super detailed offset business card, to achieve the same result with the same concept. And it would perfectly fit my personality and make a good impression.\n\nBut I have many options in front of me. And I can choose to go with letterpress, offset, screen-printing, etc. But using an old process to make something new out of it is really part of my design approach. It does represent me as a person and as a professional.\n\nIs it nostalgia ? Maybe.  \nIs it fetishism ? Probably.\n\nWhy not professionalism ?\n\n"
    },
    {
      "time": "7 Nov 2005 — 1:38pm",
      "content": "\\> using an old process to make something new out  \n\\> of it is really part of my design approach.\n\nThen it sounds perfect! :-)\n\nWhat becomes challenging is how to make the  \nresults convey that without simply appearing  \ngratuitously retro. For example, I would think  \nabout what subbing something like \"(a)\" would  \ndo to the message: does it make it look older,  \naffected, what?\n\nhhp\n\n"
    },
    {
      "time": "7 Nov 2005 — 4:38pm",
      "content": "I think the thing to do here would be to take Hrant's suggestion and go with polymer. I say this not only because it removes the issue of finding a metal face with @, but more importantly because of what Hrant has been talking about in terms of distinguishing between affectation and purpose/message.\n\nI've seen some extremely effective letterpress business cards and, to my mind, what made them stand out was the combination of old-school detail (quality paper, understated design, solid setting [kerning, etc.], good inking, firm but not killer impression) with new-school technology and design. That is, the easiest way to avoid the impression of preciousness with letterpress is to avoid using the standard faces that everyone who has a press has in hot or cold metal, and the best way to do that is to design & set your copy in polymer with a relatively distinctive digital font. (Unless, of course, you're into cutting, punching and casting your own type.)\n\nThis, it seems to me, would best convey your mandate/goal of \"using an old process to make something new\".\n\n"
    },
    {
      "time": "8 Nov 2005 — 12:05am",
      "content": "\\>Does the “per” have a unicode designation?\n\nThe 'per' Unicode is [uni214C](http://web.archive.org/web/20131018031744/http:/www.unicode.org/charts/PDF/U2100.pdf)\n\n"
    },
    {
      "time": "8 Nov 2005 — 7:36am",
      "content": "Hrant / Jason : your comments about (photo)polymer is very interesting. But I honestly don't know anything about this.\n\nI suppose that not every typeface (in small size) will give a good result. We'll have to make some tests.\n\nI'll try to find some info about polymer on the internet. But it would be great if one of you could put it in the Typowiki !\n\n"
    },
    {
      "time": "8 Nov 2005 — 7:46am",
      "content": "There are shops where you take your digital file and they make this thin reliefed plate for you. You put this plate on a special backing (mine is a 12\"x16\" from Patmag) which raises the surface to type-high. The rest is the same as printing with movable type.\n\n\\> I suppose that not every typeface (in small size) will give a good result.\n\nIndeed, when you use a digital font (anywhere, not just in letterpress) you either have to choose one with optical scaling for small sizes, or you have to do things like choose a demi weight, track it looser, etc. to get it decent. In metal fonts (except for the really bad ones) this was sort of done inherently.\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2005 — 10:34am",
      "content": "A basic text for polymer is Gerald Lange's _Printing Digital Type on the Hand-Operated Flatbed Cylinder Press_, info on which you can find [here](http://web.archive.org/web/20131018031744/http:/bielerpress.blogspot.com/2005/07/printing-digital-type-3rd-edition.html). Gerald's [Bieler Press](http://web.archive.org/web/20131018031744/http:/bielerpress.blogspot.com/) also provides photopolymer plate processing, as does [Boxcar Press](http://web.archive.org/web/20131018031744/http:/www.boxcarpress.com/) (these are just two examples).\n\n"
    },
    {
      "time": "8 Nov 2005 — 6:01pm",
      "content": "\\>Is it nostalgia? Yep.  \n\\>Is it fetishism? Nope.\n\nDesires that are out of the 'run of the mill' must be budgeted for. Several years ago I came across a graphic designer here in New Zealand who was on a similar mission (their own design on their own business card), except that they really, really wanted gravure printing, rather than letterpress. Their reasons for this were all about the craft and quality, although at that time there were still viable letterpress options here. Finally they realised that because there were no longer any 'jobbing' gravure presses in New Zealand, they would have to get the job printed in Australia. Needless to say, this just blew the budget right out of the water...\n\nUltimately they settled on a very ordinary offset job on some nice stock and left it at that.\n\nIf you are looking for further romanticism about traditional letterpress there is [this lovely record](http://web.archive.org/web/20131018031744/http:/www.typeculture.com/academic_resource/movies/) on Mark Jamra's TypeCulture site, which includes John Kristensens observation that 'letterpress will die...'\n\nBut I would listen closely to what Hrant and Jason are telling you about digital photopolymer letterpress. It sounds like for what you want, it's the way to go, as long as your typesetting reflects the medium it's intended for.\n\nUsual setting for @ (whether offset or letterpress); as Hrant says, the @ should be a couple of points smaller than the surrounding text, and baseline shifted so that it optically centres between baseline and x height.\n\n"
    },
    {
      "time": "9 Nov 2005 — 7:15am",
      "content": "Thanks for all the comments and suggestions. I'm trying to find a printer able to do photopolymer letterpress. It's pretty rare.\n\nI'm also curious about the cost of photopolymer vs. metal letterpress. We'll see...\n\n"
    },
    {
      "time": "9 Nov 2005 — 7:42am",
      "content": "The cost for the plate should be around 50 cents to a dollar (US) per square inch. But there's a big ($100-$1000, depending on size and magnetization) one-time cost for a back (unless the place you'll be printing has them available for use), although a business-card-size Patmag is pretty cheap.\n\nhhp\n\n"
    },
    {
      "time": "10 Nov 2005 — 5:27pm",
      "content": "I've had remarkably good success making photopolymer plates from Boxcar Press ( [http://www.boxcarpress.com/](http://web.archive.org/web/20131018031744/http:/www.boxcarpress.com/ \"http://www.boxcarpress.com/\")) I bought the boxcar base, which is made from machined aluminum and gridded for alignment of the plates which come with a reusable adhesive backing. The base is a bit of an investment, and I'd only recommend it if a) you are going to be doing more of this in the future or b) you need to do something larger than about 5 X 5 (just to retain flatness of the type surface) The people at Boxcar Press are very helpful and have a section on their site which answers a lot of questions. The ability to pair digital typography with letterpress printing opens so many interesting avenues. Good luck\n\n"
    },
    {
      "time": "10 Nov 2005 — 7:08pm",
      "content": "\\> larger than about 5 X 5\n\nFrom what I understand, even without a magnetized back or an adhesive-  \nbacked plate you can manage larger sizes, by using a spray-on adhesive.\n\nhhp\n\n"
    },
    {
      "time": "15 Nov 2005 — 1:08am",
      "content": "I can't recall any at sign in metal that was appropriate. We always had to fit a small point size in the line, adjust the baseline, and with, preferably a semi-bold or bold face version to optimize it. Much, much easier with digital baseline and sizing adjustments (and a font-editing program if you need the weight) to make it look appropriate. I think Bringhurst has something to say about the proper fitting of the at sign. As I recall he is at odds with adjusting it to near the x-height. I think this is wrong. Don't have a copy near hand so can't verify his suggestion. Best at sign I have ever seen is the alternate in Journal.\n\nGerald\n\n"
    },
    {
      "time": "27 Oct 2006 — 2:52pm",
      "content": "Yes, I know its an old thread.  \nBut may be you are interested to see that @ signs for letterpress are easy to order and very cheap, too:\n\n ![](http://web.archive.org/web/20131018031744im_/http:/typophile.com/files/1_5616.jpg)\n\nPrices per @ sign:  \n6 p to 12 p - 1,30 EUR  \n14 p to 30 p - 2,00 EUR  \n48 p - 6,05 EUR  \n60 p to 72 p - 8,30 EUR  \n84 - 96 p - 10,60 EUR  \n(p = size in Didot p)  \nPlus shipping costs.\n\nCan be delivered in anglo-american height of 23,32 mm  \n(Don't tell it satya ;-)\n\nIts a standard product.  \nIf someone is interested..\n\nGeorg\n\n"
    },
    {
      "time": "27 Oct 2006 — 2:54pm",
      "content": "You have a caster?\n\nhhp\n\n"
    },
    {
      "time": "27 Oct 2006 — 4:06pm",
      "content": "hrant, I am dealer of the follow-up companies D. Stempel, Frankfurt and Bauersche Giesserei, Barcelona. And I offer.. well, will be at least 300 used lead letter fonts in my online-shop. One of the products are the @ signs. Its more a giveway for customers.\n\nGeorg\n\n"
    },
    {
      "time": "1 Feb 2007 — 10:54am",
      "content": "This is an old thread but I was following a link. . .\n\n<cite> A more sophisticated way is to go with photopolymer letterpress,</cite>\n\nHrant, do you really believe this?\n\nmjb\n\n"
    },
    {
      "time": "1 Feb 2007 — 11:04am",
      "content": "Enough to have done my own business cards that way.  \n [http://typophile.com/node/21340](http://web.archive.org/web/20131018031744/http:/typophile.com/node/21340 \"http://typophile.com/node/21340\")\n\nLetterpress still has real value (although not the sensationalistic way it's almost always used today). But actual typographic production in metal is finished: it only has an educational value now (although a huge one), and way too many arbitrary constraints, flaws and anachronisms (like the typical too-high \"@\").\n\nhhp\n\n"
    },
    {
      "time": "1 Feb 2007 — 11:11am",
      "content": "This is not to say that the digital fonts we have are a superset of the whole spectrum of metal type; there are certainly metal fonts (like Palatino\\*) which have yet to get comparable digital versions (and probably most never will); and the convenience of scaling digital type has become a weapon turned against its users due a general ignorance of the criticality of optical scaling; but that's outside the issue of the technologies. There are a great many superb digital fonts out there now, and we can always do a better job reviving the metal ones.\n\n\\* [http://typophile.com/node/30833](http://web.archive.org/web/20131018031744/http:/typophile.com/node/30833 \"http://typophile.com/node/30833\")\n\nhhp\n\n"
    },
    {
      "time": "1 Feb 2007 — 12:00pm",
      "content": "You paint with a broad brush.\n\nIt may be finished as a means of generating an illustrative greeting card line, or as a strictly commercial endeavor that kowtows to the whims of designers unable to accept the limitations of the process, however, it has a peerless place for a certain class of printing.\n\nThere will always be those who respond to finer things, done well with attention to detail, using traditional methods, and those who don't recognize the difference.\n\nFor example, one can go to The Bombay Company and buy a plastic and white metal \"Tiffany\" lamp. Despite what the sales person tells you, that doesn't mean it's actually \"Tiffany\" stained glass, thoughtfully designed and hand produced. By the same token, relief printing produced exclusively from plates (\"platepress\") isn't actually \"letterpress\". Yes clearly it's printing. Just not what it purports to be, or you believe it is. But for some, plastic and the illusion of something finer is satisfactory.\n\nWith regard to alleged constraints, flaws and anachronisms: black and white photography must be dead too since digital needn't concern itself with pesky silver grain and light sensitive paper and chemicals and whatnot. It's all just so much trouble what with the skills and equipment required.\n\nWhy learn to play the violin when you can make the same sounds with a synthysizer? No one will know the difference on playback. . .\n\nThe \"too high\" @ sign is only an issue in the hands of the unskilled or unaware. I've not had that problem. Generally speaking: 2pt sizes smaller and shim with brass and copper thins to base align the \"a\". Simple.\n\nI scrolled down to your card. I'm happy you're happy with it. It's not my style.\n\nmjb\n\n"
    }
  ]
}
