{
  "id": "16114",
  "title": "Speaking of redesigns...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The St. Louis Post-Dispatch (newspaper) recently went through a redesign. It felt uncomfortable to me from the start, and the more I thought about it, I believe it's because they chose [Amplitude](http://web.archive.org/web/20150123062300/http:/www.myfonts.com/fonts/fontbureau/amplitude/) for the headline/display face. This choice seems very inappropriate to me, and I was wondering if anyone else had a thought about the face.  \nExamining the letters, you can see that crotches and apexes are heavily notched, which I take as an attempt to keep them from \"closing up\" at text settings. This works well when you're using a face like this at 12pt or below, but strikes me as clumsy and out of place as a display face.\n\nAnyone else out there using Amplitude? Other thoughts on the subject?\n\n[http://www.newsdesigner.com/archives/002255.php](http://web.archive.org/web/20150123062300/http:/www.newsdesigner.com/archives/002255.php \"http://www.newsdesigner.com/archives/002255.php\")\n\n",
  "author": "ChuckGroth",
  "time": "7 Nov 2005 — 10:20pm",
  "uid": "9273",
  "comments": [
    {
      "time": "8 Nov 2005 — 2:36am",
      "content": "Sure, it's a tad unusual, but I don't find Amplitude clumsy at all. At large sizes the ink traps serve as the distinctive feature of a headline face. The general structure of Amp is so sound, it works just fine. It's been used to great effect as a headliner in many magazines over the last few years, but it's wonderful to see it in a newspaper. Completely livens it up.\n\n"
    },
    {
      "time": "8 Nov 2005 — 4:31am",
      "content": "That's an interesting view. But to my eye, especially at 72pt and above, those ink traps look like someone went at it with an x-acto. Like I said, they are really functional at text sizes, but strike me as awkward.\n\n"
    },
    {
      "time": "8 Nov 2005 — 5:27am",
      "content": "You can read comments about Amplitude by its designer, Christian Schwartz, here:\n\n[http://orangeitalic.com/amplitude.shtml](http://web.archive.org/web/20150123062300/http:/orangeitalic.com/amplitude.shtml \"http://orangeitalic.com/amplitude.shtml\")\n\nWhether it works or not is debatable, but the paper is not using the face in a way that wasn't intended by its designer.\n\n"
    },
    {
      "time": "8 Nov 2005 — 5:32am",
      "content": "You're right, of course. Schwartz set out to design a face for text and display use.\n\n"
    },
    {
      "time": "8 Nov 2005 — 7:40am",
      "content": "Amplitude is very aggressive, to the point of violence.  \nHere's an example of what I think is one if its best uses:\n\n ![](http://web.archive.org/web/20150123062300im_/http:/typophile.com/files/murder.jpg)\n\nIt's from a tabloid magazine story about that Aruba chick.\n\nI think Amplitude is great (even though to me the trapping is  \ntoo variable) but there is a valid question as to its suitability  \nfor a mainstream newspaper. What is the [intended] character  \nof the St. Louis Post-Dispatch?\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2005 — 8:21am",
      "content": "The Post-Dispatch is the main newspaper in here. Not a tabloid (though there may be some in the community who disagree). Having just moved to StL shortly before the re-design of the paper, I don't know much about its history or previous design.\n\n\\> <cite>Amplitude is very aggressive, to the point of violence.</cite>\n\nInteresting... St Louis _is_ known to have a relatively high crime rate. Perhaps a subliminal influence on type selection? Maybe that's why it feels inappropriate to Chuck -- it's sending the wrong message about the city.\n\n"
    },
    {
      "time": "8 Nov 2005 — 9:40am",
      "content": "IMHO\n\nAmplitude gives youth to an otherwise out-of-date medium. The newspapers have to re-invent themselves to keep advertisers interested. Without the advertising dollar, newspapers will die.\n\n"
    },
    {
      "time": "8 Nov 2005 — 9:49am",
      "content": "Does that mean news can/should never hope to [try to] be neutral?\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2005 — 10:05am",
      "content": "No. I don't think so. I would hope that the design of a newspaper doesn't tarnish or force the hand of honest and/or neutral news.\n\n"
    },
    {
      "time": "8 Nov 2005 — 10:08am",
      "content": "i think Hrant means independant about ads. And it's indeed a real problem...\n\n"
    },
    {
      "time": "8 Nov 2005 — 10:35am",
      "content": "Amplitude may follow in the footsteps of Griffith Gothic, another face with \"pre-emptive\" text features, which became very popular as a news headline face.\n\n"
    },
    {
      "time": "8 Nov 2005 — 10:52am",
      "content": "FWIW, there will probably be an Amplitude Smooth one day.\n\n"
    },
    {
      "time": "8 Nov 2005 — 11:43am",
      "content": "\\> I would hope that the design of a newspaper  \n\\> doesn’t tarnish or force the hand\n\nWell, maybe not anything as forceful as those two things, but  \ndoes type have no role in directing the perceptions of readers?\n\n\\> independant about ads.\n\nWell, that's not what I meant directly, but it's certainly  \nrelated: if a newspaper uses sensationalist typography  \nto sell itself more, does that not affect the integrity of  \nthe news? Does the TV reporter with the prominent  \ncleavage\\* help or hinder?\n\n\\* Alluding to Amplitude's traps.\n\n\\> Griffith Gothic, another face with “pre-emptive” text  \n\\> features, which became very popular as a news headline face.\n\nThe problem of course is that text and headlines are  \ndifferent, and traps can only be decorative in large  \nsizes (which is hard to pull off).\n\n\\> there will probably be an Amplitude Smooth\n\nHuh. Good sales move, I guess.\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2005 — 12:46pm",
      "content": "I'm not so sure that the use of Amplitude implies anything. How do you read it, Hrant? I suppose the use of a sans with that much character could imply that the newspaper is liberal. I don't think the use of Amplitude is sensationalistic at all though.\n\n"
    },
    {
      "time": "8 Nov 2005 — 12:54pm",
      "content": "\\> I’m not so sure that the use of Amplitude implies anything.\n\nBut you just said \"Amplitude gives youth\"...\n\nLet's back up a little bit:  \nDoes a type style ever imply anything?\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2005 — 1:00pm",
      "content": "Hmm. Ok. I'm obviously waffling.  \nYes. A typeface can imply all sorts of things.  \nSo. Yes. Using Amplitude implies something more modern.  \nErgo. Possibly youthful. Or. Liberal, maybe.\n\nMaybe I shouldn't be posting today. My head is obviously fuzzy.\n\n"
    },
    {
      "time": "8 Nov 2005 — 1:07pm",
      "content": "\\> A typeface can imply all sorts of things.\n\nIncluding stuff contrary to news journalism.\n\n\\> Maybe I shouldn’t be posting today.\n\nNaaah.\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2005 — 1:09pm",
      "content": "\\>\\> A typeface can imply all sorts of things.\n\n\\> Including stuff contrary to news journalism.\n\nYes. I suppose I can see this.  \nSo, can I assume you think Amplitude is more appropriate for sensationalistic journalism?\n\n"
    },
    {
      "time": "8 Nov 2005 — 1:16pm",
      "content": "I think:  \n1) whatever character it <cite>does</cite> have, it's probably too much here.  \n2) it's best for something... incisive; edgy and a bit unpredictable.\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2005 — 2:44pm",
      "content": "\\>2) it’s best for something… incisive; edgy and a bit unpredictable.\n\nLike EXTREME news reporting?\n\n"
    },
    {
      "time": "8 Nov 2005 — 3:06pm",
      "content": "Yeah, like this:  \n [http://www.amazon.com/exec/obidos/tg/detail/-/0767905768/102-5438870-697...](http://web.archive.org/web/20150123062300/http:/www.amazon.com/exec/obidos/tg/detail/-/0767905768/102-5438870-6971315?v=glance \"http://www.amazon.com/exec/obidos/tg/detail/-/0767905768/102-5438870-6971315?v=glance\")\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2005 — 5:29pm",
      "content": "No type is ever neutral. There is always some kind of message put across. The more visually litterate you are the more effectiev that message is & because we are all bombarded by non-stop media we arte all increasingly saavy. But Culture plays a role too. And even sub & sub sub culture etc.\n\nOf course journalism can never be neutral either. The best it can do is wear it's stripes. This does not contradict the idea that there is such a thing is jornalistic integrity. Likewise, admitting that all type has style & sends messages does not mean that there is no such thing as design integrity.\n\nPersonally I think Amplitude says 'action', as in fast paced. It also has a whiff of the dot.com about it. And I think it is a banker's face ( finance ) more than a neo-con or liberal one.\n\n"
    },
    {
      "time": "8 Nov 2005 — 5:31pm",
      "content": "This is what I was looking for, and frankly, what I'm not sure went on in the newsroom at the P-D. What's the typeface say? In what voice does it say it? Who, in the end, are we talking to?  \nI don't aim to dis the face Amplitude -- I've already said what I think are real strengths of the font. I think I wanted to open up a conversation about newspaper design. I don't believe it's an out-of-date medium. And I'm not convinced it needs to reinvent itself. I DO believe that a publication has to know itself, speak with its own voice and go from there.\n\n"
    },
    {
      "time": "8 Nov 2005 — 5:34pm",
      "content": "\\> No type is ever neutral.\n\nAgreed. But some:  \n1) are less neutral than others.  \n2) have an atmosphere opposed to the content and/or delivery.\n\nAnd yes, journalism, like anything else a human does, can never be  \ntotally neutral either. But there's a difference between accepting  \na subjectivity that comes sort of <cite>in spite</cite> of the journalist, versus  \ngood ol'-fashioned manipulation. This being interestingly parallel to  \nthe role of Art in type design: it's best applied unwittingly, not forced.\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2005 — 5:37pm",
      "content": "I also do not believe that a newpaper's role is or should be a neutral one. Look at the great newspaper men -- Hearst, Pulitzer, etc... these guys had OPINIONS and used their publications as vehicles for those opinions. It wasn't wrong; it was necessary and responsible. A problem today is that newspapers are so afraid of offending advertising dollars and sensibilities that they want to be everything to everyone, which is a losing proposition any way you look at it.\n\n"
    },
    {
      "time": "8 Nov 2005 — 6:01pm",
      "content": "People who like forming their own opinions (as opposed to being  \ntold what to think by magnates, and yes, advertisers too) prefer  \nnews sources (like the BBC website) that still value the elusive  \nbut admirable quality of journalistic integrity: the bravery to  \nreport something irrespective of what effect doing so might have.\n\nHaving opinions is great. But so is being a diligent messenger,  \nand having faith that impartiality is a key to mankind's health.\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2005 — 8:50pm",
      "content": "\\> People who like forming their own opinions etc.\n\nAgreed. Really!\n\nBut that doesn't mean that it's ever possible to shed a point of view completely. The only way to persue that calling journalistically speaking is to admit that you have a point of view & own it. Typographically speaking even Helvetica ( or Ariel ) or really pick any typeface you think is 'Neutral' has a history,cultural associations and most of all assumptions built into it.\n\nI am not giving a US neo-con style license to shirk duty here a la Fox news. Instead I am saying there is a more precise kind of duty. Admitting imperfection doesn't imply a license to go wild.\n\nBut to keep the post semi relevant - I have to admit that while I agree with Chuck about Amplitude being maybe a bit beyond where news headlines are concerned. On the other hand Tif's point about making the paper more hip might be a good one too. Certainly the headlines will grab the eye more than they would with some other face. But it might hurt the eyes after a while.\n\nOddly her idea that Amplitude is hip, seems in total contrast to her statement \"I’m not so sure that the use of Amplitude implies anything.\" I can't agree with that idea. A face like that definitely means more than the average news/headline face. It has too much flavor to not mean anything. Tif, what did you mean when you said this?\n\n"
    },
    {
      "time": "8 Nov 2005 — 9:44pm",
      "content": "I see on re-reading I aught not to be giving you heck Tif. Sorry.\n\n"
    },
    {
      "time": "9 Nov 2005 — 4:49am",
      "content": "\"No type is ever neutral\"\n\n: ) I like that notion, but I think Franklin Gothic, and this could easily be \"just me\", is the neutralest, if not the neutral typeface of all time. As for the St. Louis Amplitude thing, I'm sorry the character is too, characteristic. We have offered news oriented types without much Pizazz for years.\n\n"
    },
    {
      "time": "9 Nov 2005 — 7:31am",
      "content": "To me FF Kievit is the most neutral. Overall. For now.\n\nhhp\n\n"
    },
    {
      "time": "9 Nov 2005 — 8:54am",
      "content": "Eben.  \nI admitted to waffling a bit yesterday.\n\n"
    },
    {
      "time": "9 Nov 2005 — 9:07am",
      "content": "\\> just me\n\nEven if you belong to a majority view today that will shift over time. After all in 1450 the most 'neutral' face in Germany would have been a textura - no? To me that suggests that what we mean by 'neutral' is something beyond what seems to be aesthetically implied by the term. Or a set of something else/s.\n\nI think what are referring to when we say neutral is a combination of ubiquity or lack of cultural novelty which is a question of use, a typicality of glyph shapes which is a question of form & finally (maybe) visual simplicity in the design of the gyphs themselves. I think that their importance is really in that order. When David is saying Pizzaz, I wonder which of these three he means.\n\nWhat I am not convinced of is whether seeking a 'neutral' face is a goal worth having at per se since to my mind the idea of 'neutrality' obscures as much as it reveals.\n\nMaybe thinking about the character and associations of the face is better, along with it's history, it's technical qualities, it's fit with the length of text and so on. All of which is a way to consider a face's fit with the intent. Rather than say 'Neutral' perhaps we should say we don't want to draw attentiuon to the face or something more specific or precise.\n\n\\> F Kievit is the most neutral\n\nTo me FF Kievit has a distictly European feel about it.\n\n"
    },
    {
      "time": "9 Nov 2005 — 9:13am",
      "content": "Tiffany. Yes. I too admitted error. No doubt I will again!\n\n:-D\n\nWhat do you think about this anti-neutral rant of mine?\n\n"
    },
    {
      "time": "9 Nov 2005 — 9:42am",
      "content": "Neutrality, by its nature, is in a grey area. The use of AG and later Helvetica and Univers, was described as being neutral. At the time (50's-60s) perhaps it was so to some degree. Today, we look back and affix the dreaded \"Modernist\" label to it. Times Roman kinda sorta was for a while but got the DTP label. It may be more possible to assume only temporary neutrality status to a face. Several years back, their were very few choices in type and the \"standard\" faces got used because that is what the printer had. There was no intent to make the typeface the carrier of the message beyond readability. Readers didn't read anything into a face on a cognitive level. Readers accepted type as just \"normal\" and therefore not meant to convey. Newspaper headlines for the \"Attack on Pearl Harbor\", \"Marilyn Marries DiMaggio\", or \"Yankees Win World Series\" were all set in the same type. There was no purposive attempt to color the message with the type. To that end, we could say the type was neutral. Today, we look back at those same vintage headlines and perhaps see \"Old News Style\" or some such label.  \nToday, there are so many type choices and you can search them and purchase them instantly. There is no such thing as \"This is what the printer had mats for.\" We SEE many more types in use and EXPECT to see meaning hinted at by choice of font. There is no time for a type to become \"normal\" because it is replaced by the next one so soon.\n\nChrisL\n\n"
    },
    {
      "time": "9 Nov 2005 — 9:51am",
      "content": "\\> There was no intent to make the typeface the carrier of the message beyond readability.\n\nLack of choice has been one important determinant, but when  \npeople have had a choice, specifically between two styles that  \nare seen as equally readable, then something else unavoidably  \ncomes into play: feeling, based in some part on the particular  \n\"atmosphere\" of a typestyle.\n\n\\> Readers didn’t read anything into a face on a cognitive level.\n\nI think this is impossible (at least in the subconscious).\n\nhhp\n\n"
    },
    {
      "time": "18 Nov 2005 — 7:44pm",
      "content": "[Amplitude Headline](http://web.archive.org/) (the \"smooth\" I mentioned)\n\n"
    },
    {
      "time": "18 Nov 2005 — 8:32pm",
      "content": "Stewf, it seems this link is broken.\n\n"
    },
    {
      "time": "18 Nov 2005 — 11:37pm",
      "content": "Here\n\n[http://www.orangeitalic.com/amphead.shtml](http://web.archive.org/web/20150123062300/http:/www.orangeitalic.com/amphead.shtml \"http://www.orangeitalic.com/amphead.shtml\")\n\nthis works.\n\n"
    },
    {
      "time": "19 Nov 2005 — 8:39pm",
      "content": "Tfhe Amplitude Headline is a much better choice for larger set display. Oddly, I don't think the Post-Dispatch uses it for display type -- or at least not consistently. I'm looking at the masthead for the \"Lifestyle\" section, set in what looks like 108pt, and the inktraps look silly.\n\n"
    }
  ]
}
