{
  "id": "16126",
  "title": "Union availability?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Does anyone know where I can access Union (as seen at [praegnanz.de](http://web.archive.org/web/20131014115652/http:/praegnanz.de/essays/391/union)) which is a free analogue to FF Olsen? Anyone know of quality Olsen alternatives (preferably free)?\n\n",
  "author": "masonchumpia",
  "time": "8 Nov 2005 — 3:14pm",
  "uid": "9094",
  "comments": [
    {
      "time": "8 Nov 2005 — 3:18pm",
      "content": "We prefer to encourage paying for the real things.\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2005 — 3:55pm",
      "content": "Yes, I would say that \"FF Olsen\" is the best analogue of \"FF Olsen\". In my circle, the word \"analogue\" is pronounced \"rip-off\".\n\nAnd who is this gooooooorgeous Gerrit van Aaken? I wish I understood German! He's sooooo dreeeeeeammmy...\n\n"
    },
    {
      "time": "8 Nov 2005 — 4:03pm",
      "content": "It was my understanding (according to Vitaly Friedman's [25 Best License-Free Quality Fonts](http://web.archive.org/web/20131014115652/http:/www.alvit.de/blog/article/20-best-license-free-official-fonts)) that Union was available for free from the Danish Ministry of Education. However, upon following the link provided, there seems to be no discernable download available and unfortunately my Dutch is a bit rusty, so I can't really make heads or tails of the page I'm directed to.\n\nI figured that as long as it's license-free, I may as well take advantage of it. I would've preferred getting some useful information, but thanks for the snide comment anyway, hrant.\n\n"
    },
    {
      "time": "8 Nov 2005 — 4:16pm",
      "content": "\\> Union was available for free\n\nWhich is fine. But your apparent desire to avoid paying for  \nFF Olson at all costs (pardon the pun) can't be expected to  \ngo over well in a place like this. Also: getting something  \nfrom a source that most certainly <cite>has</cite> paid for it, and for  \nthe ability to distribute it, is way different than simply  \nfinding a free imitation. At the very least, it would en-  \ncourage more such font commissions.\n\nSo my objection wasn't to your attempt to find Union.  \nSnide? You prefer Chester's reaction? Or maybe you'd  \nprefer the reaction of the many font fuhrers in our  \nfield, who might have you blacklisted for even asking  \nsuch a thing. I was actually being quite gentle.\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2005 — 4:39pm",
      "content": "as i speak german, i can give you a bit of help. gerrit writes essays about fonts, named \"type of the day\". mostly they're free fonts (i mean really free, no ripoffs or something), and he always writes something about the law-aspect of it. how you may use it and not, etc.\n\nunion was built by Morten Rostgaard Olsen who also designed - right, you guessed it - FF Olsen. this was a \"spin-off\" designed (or released?) for the danish ministry of culture.\n\napparently, this ministry had this font as a download on its page, with the EULA only in danish. so he assumed it was free (yes, i know.. he shouldnt..). then, someone got him an english version of this eula, and there is the sentence \"these fonts may be used in projects related with the danish ministry of culture. for other uses, please contact M.R. Olsen. Adress: [...]\".\n\nafter a while, the site was updated and there was just a notice to contact mr. olsen directly if you would want to use it.\n\n"
    },
    {
      "time": "8 Nov 2005 — 4:48pm",
      "content": "Chester's reply was posted very close to mine and I didn't notice it. Personally, I wouldn't place much value in the judgment from any such masturbatory clique that would immediately blacklist me for asking an honest question, but that is really beside the point now. Thanks for a more meaningful response.\n\nEDIT: Thanks for clearing it up, kesh!\n\n"
    },
    {
      "time": "8 Nov 2005 — 5:03pm",
      "content": "\\> I wouldn’t place much value in the judgment from any such masturbatory  \n\\> clique that would immediately blacklist me for asking an honest question\n\nMe neither. Which is exactly why you should try to pay  \nattention to the more reasonable amongst us; as well as  \nreward the efforts of type designers, somehow.\n\nhhp\n\n"
    },
    {
      "time": "9 Nov 2005 — 3:03am",
      "content": "well hrant, but you cant just say everybody who uses freely available fonts is a bad guy. not all clients are ready to pay for fonts - not all projects can be reason to buy new fonts (often i do small jobs for like 50$ - how should a font fit into this budget?). if there is a free (and worth!) alternative, i think people should be able to use it.\n\n"
    },
    {
      "time": "9 Nov 2005 — 7:26am",
      "content": "\\> you cant just say everybody who uses freely available fonts is a bad guy.\n\nI didn't say that. But:  \n1) Most budgets do have room.  \n2) Using imitations is bad.\n\nhhp\n\n"
    },
    {
      "time": "9 Nov 2005 — 8:05am",
      "content": "well, then you gotta decide where the line is between imitiation and a \"real\" font.. and i think thats no easy job (but im sure you have at least an opinion about this :)) .\n\n"
    },
    {
      "time": "9 Nov 2005 — 8:35am",
      "content": "\\> thats no easy job\n\nThat is so true.  \nWe each have to decide on our own I guess.\n\nhhp\n\n"
    },
    {
      "time": "9 Nov 2005 — 8:42am",
      "content": "one reality is that you simply do not need to license new type for every project. it is possible to use the same group of well chosen (and properly licensed) type families for many projects. any designer who thinks they can't possibly do this needs to stop and start again.\n\nit is understandable, however, that one might want to experiment. that said, it shouldn't be at the expense of the type designers.\n\nthe best thing you can do is allot a certain amount of money in a given time period specifically for licensing type. make a list of fonts you would like to -- albeit slowly -- license. budgeting is key. (if not you'll end up like me, so much type and very little credit.)\n\nmason, if you think hrant was mean, be glad that yves or myself didn't answer the call first. =^\\> in the grand scheme of things, typefaces aren't expensive. sure, there are foundries whose type i can but covet from afar as i'll never have (well perhaps someday) a budget for them. but think of it this way:\n\nif you started a logo project for a client. and they suddenly disappeared after only haven given you a deposit and yet weeks later you see a truck driving down the road with one of your ideas for them on it. how would you feel? typefaces are less expensive than logos.\n\nwe are in a business that requires certain tools. yes, we have to pay rent and buy food and pay utilities. but we chose our career and so we chose the expenses that go along with it.\n\n"
    },
    {
      "time": "18 Mar 2006 — 10:35am",
      "content": "I'd wager many people here (like myself) are \\*not\\* professionals who can write things off on their taxes, or bill a customer. So anything quality that is (legally) free is definitely of interest to people who don't want to \"steal\" fonts, and don't have a lot of money. I keep seeing your attitude in different threads, and finally had to say something.\n\n"
    },
    {
      "time": "18 Mar 2006 — 1:23pm",
      "content": "My attitude?\n\n"
    },
    {
      "time": "18 Mar 2006 — 1:33pm",
      "content": "I'm sorry...that was meant as a reply to a post by hrant where he was putting down someone who was asking about a font they thought was free. I guess I don't know how to make the part I am replying to appear. I'll try copy/paste next time. (I'm new here)\n\n"
    },
    {
      "time": "18 Mar 2006 — 2:16pm",
      "content": "No. That's OK. :^) I was just making sure. I know I can be a brat from time to time. (Which is never my intent unless I'm teasing someone and then it is completely my intent.)\n\n"
    },
    {
      "time": "19 Mar 2006 — 12:07pm",
      "content": "\"...unless I’m teasing someone and then it is completely my intent.\"\n\nLOL!!!\n\nNot bad for a brat :-)\n\nChrisL\n\n"
    },
    {
      "time": "20 Mar 2006 — 8:07pm",
      "content": "Know that my \"attitude\" concerning this sort of  \nthing is one of the more gentle you'll encounter.\n\nhhp\n\n"
    },
    {
      "time": "21 Mar 2006 — 12:06pm",
      "content": "Sorry to hear that. It shows a dogged close-mindedness to certain realities. A sort of Chicken Little attitude; as if people who aren't professionals, don't have much money, but like to stay legal, are going to bring you to ruin by being interested in a free quality font.  \nLighten up. You'll live longer.\n\nAlthough I have to admit I am starting to wonder if living longer is all Jack LaLanne cracked up to be.\n\n"
    },
    {
      "time": "21 Mar 2006 — 1:02pm",
      "content": "Admitting reality is one thing, having preferences is another.  \nBTW, I was going to ask <cite>you</cite> to lighten up! :-/\n\nhhp\n\n"
    },
    {
      "time": "21 Mar 2006 — 1:30pm",
      "content": "\\> BTW, I was going to ask you to lighten up! :-/\n\nThat is my intended course of action, thank you.  \n: )\n\n"
    }
  ]
}
