{
  "id": "16122",
  "title": "Logo for Wedding Accessories/Favors Company",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I was working on a set of trademarks for a small wedding accessories and favors company. This is what looks like the final round and I was hoping for some comments.\n\n [‹ express delivery company logo](http://web.archive.org/web/20070806224411/http:/typophile.com/node/16302 \"Go to previous forum topic\") [Logo critique for business book publishing startup ›](http://web.archive.org/web/20070806224411/http:/typophile.com/node/16246 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070806224411/http://typophile.com/user/10029\" title=\"View user profile.\">cio</a>",
  "time": "<br>",
  "uid": "10029",
  "comments": [
    {
      "time": " 8.Nov.2005 9.44am",
      "content": "I guess it didn’t post the first time, here it is:\n\n ![](http://web.archive.org/web/20070806224411im_/http:/typophile.com/files/eelogo.gif)\n\n"
    },
    {
      "time": " 8.Nov.2005 9.48am",
      "content": "I’d rather see the two “e”s facing each other,  \nforming a heart. Now they look like a guy  \nwith glasses and a moustache! :-)\n\nhhp\n\n"
    },
    {
      "time": " 8.Nov.2005 10.00am",
      "content": "i like the bow. i didn’t see a guy with a moustache.\n\n"
    },
    {
      "time": " 8.Nov.2005 10.09am",
      "content": "Thats so funny! i never thought if it that way...originally, it looked more like this:\n\n ![](http://web.archive.org/web/20070806224411im_/http:/typophile.com/files/eelogo-02.gif)\n  \nWhen I was told that the two “e”s hinted at a bow, I thought it might be nice to make it literal.\n"
    },
    {
      "time": " 8.Nov.2005 10.12am",
      "content": "I also like the bow (of the first option), but I can’t help being immediately drawn to the word “vents” at the end of the logotype. I think there’s almost _too much_ difference in style and color between the bow and the type. I don’t read the bow as part of the name, just a symbol stuck inside it: **expressiv** }{ **vents**\n\n"
    },
    {
      "time": " 8.Nov.2005 11.33am",
      "content": "\\> a guy with glasses and a moustache!\n\nNow I know exactly what I was seeing: the  \nCaptain Biggles character in Monty Python.  \nOr did he not have a handlebar moustache?\n\nhhp\n\n"
    },
    {
      "time": " 8.Nov.2005 11.42am",
      "content": "“\\> a guy with glasses and a moustache!”\n\nI resemble that remark :-)\n\nChrisL\n\n"
    },
    {
      "time": " 8.Nov.2005 12.02pm",
      "content": "I really want to keep the ribbon/bow as an element in the design...any ideas on how not to make it look so moustache-ey?\n\n"
    },
    {
      "time": " 8.Nov.2005 12.11pm",
      "content": "Make them look more like “e”s, or make it asymmetrical.\n\nhhp\n\n"
    },
    {
      "time": " 8.Nov.2005 12.30pm",
      "content": "Thanks for the suggestions...I’ll see what I can do\n\n"
    },
    {
      "time": " 8.Nov.2005 1.54pm",
      "content": "as someone who is actually in the wedding industry, i think that the first combo design is the best design. the key for me is to make the logo stand out because this industry is so heavily saturated with imagery. the e’s that make the ribbon make it unique. i would not change it.\n\n"
    },
    {
      "time": " 8.Nov.2005 2.05pm",
      "content": "Certainly, don’t change it just because of me!  \nBut you might still want to play with the stroke  \nweight distribution.\n\nhhp\n\n"
    },
    {
      "time": " 8.Nov.2005 2.23pm",
      "content": "I was working on a set of trademarks for a small wedding accessories and favors company\n\nIs the word **expressive-events** is suppose to be print on the object? If so, I don’t want to break the work you’ve already done, but I find the word is too wide for the object _(small wedding accessories)_ is gone to be printed on.\n\n"
    },
    {
      "time": " 9.Nov.2005 4.45am",
      "content": "You could look at creating the bow from just one of the e’s and keep the other for events. This might be one place you could start from  \n [http://www.myfonts.com/fonts/linotype/poetica/supp-lowercase-endings-i/](http://web.archive.org/web/20070806224411/http:/www.myfonts.com/fonts/linotype/poetica/supp-lowercase-endings-i/ \"http://www.myfonts.com/fonts/linotype/poetica/supp-lowercase-endings-i/\")\n\nTim\n\n"
    },
    {
      "time": " 12.Nov.2005 8.37pm",
      "content": "Here is a new version, i changed one of the e’s to a different typeface and brought the kerning between the symbol e and the “vents” to make it look more like one word. Whaddya think?\n\n ![](http://web.archive.org/web/20070806224411im_/http:/typophile.com/files/eelogo_round2.gif)\n\n"
    },
    {
      "time": " 14.Nov.2005 5.43am",
      "content": "The lowercase ’e’s in the bow feel a bit disturbing to me now, not so much the right-reading one (I like that one a lot), but the reversed one. Also, I’m not so sure your type should have so much letterspace. If you want to make the overall impression lighter, go with a lighter face or an italic. Letterspaced lowercase disrupts the word shape and the relationship of the letters, hurting the viewer’s ability to get a quick read.\n\nYou probably don’t have to make the fact that the bow is made lowercase ’e’s so direct. I recommend separating the two and just setting some good easy-to-read type and allowing for the ’Ah ha!’ moment with the flower mark. Or, you could add the reversed pink ’e’ to the brown initial ’e’ in both expressive and in events...might work.\n\nHave you tried italic type?\n\n"
    },
    {
      "time": " 14.Nov.2005 10.53am",
      "content": "Cio,\n\nYou’ve found a clever way to use the two e(s) as a bow. I prefer the original as it seems a little less “worked over”. I wonder if you really need it in the name also. If you simply chose a nice typeface and then used the mark alongside or elsewhere I think it would be stronger.\n\nI also don’t think you need the pink underscore, especially at that weight. What if you make it thinner and hand-drawn to tie-in with the hand quality of the mark?\n\n"
    },
    {
      "time": " 15.Nov.2005 2.32pm",
      "content": "Thank you all for your comments so far...I have found them very insightful.\n\nChris, I had tried italic type (in the very early stages of the design), I found that including the symbol along with the italic type didnt work as well. The client and I had agreed that the symbol should be able to be part of the logo itself but be easily separated from the logotype in order to be used as an icon or watermark on some materials. That is part of the criteria that I must work the design around, but if you have any other suggestions I would be happy to hear them.\n\nMiss Tiffany, I will try a version with the pink underscore at a lighter weight and one that is more hand-drawn as well. Thank you for the suggestion.\n\n"
    }
  ]
}
