{
  "id": "16123",
  "title": "No Glyph Palette in Photoshop CS",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Why no glyph palette in Photoshop CS or CS2? I thought Adobe was all about consistifying their suite.\n\nI know PS is not supposed to be a type-centric app, but trying to access OpenType\\* features without the glyph palette is a pain in the pooper. No one wants to trial-and-error all the contextual/stylistic/swash options in the Character fly menu.\n\n\\* Adobe's ballyhooed format!\n\n",
  "author": "Stephen Coles",
  "time": "8 Nov 2005 — 12:52pm",
  "uid": "103",
  "comments": [
    {
      "time": "8 Nov 2005 — 2:14pm",
      "content": "See this:\n\n[http://www.typophile.com/node/9939](http://web.archive.org/web/20140806021858/http:/www.typophile.com/node/9939 \"http://www.typophile.com/node/9939\")\n\n"
    },
    {
      "time": "8 Nov 2005 — 2:37pm",
      "content": "Thanks Mark. Shoulda known it's been griped about before. The responses don't make me feel any better tho.\n\n"
    },
    {
      "time": "8 Nov 2005 — 3:51pm",
      "content": "Because the OT-handling was so different - some might say \"unique\" - in each of the CS2 app, I did screen grabs and posted them on our site:  \n [http://vllg.com/files/cs2/](http://web.archive.org/web/20140806021858/http:/vllg.com/files/cs2/ \"http://vllg.com/files/cs2/\")\n\nOne hopes that CS3 will see the Adobe engineers speaking to each other and sharing their toys.\n\n"
    },
    {
      "time": "8 Nov 2005 — 4:43pm",
      "content": "I'd actually forgotten about that discussion, but found it in a round about way. I thought maybe possibly someone had written a plugin for Photoshop to give it a Glyph palette. That page was one of the first links that popped up on Google.\n\n"
    },
    {
      "time": "8 Nov 2005 — 8:15pm",
      "content": "Please note that if you want a glyph palette in Photoshop, you should request it in the appropriate place: [http://www.adobe.com/support/feature.html](http://web.archive.org/web/20140806021858/http:/www.adobe.com/support/feature.html \"http://www.adobe.com/support/feature.html\")\n\nUse the same form to ask for more consistent UI, or whatever it is that's bugging you.\n\nWe really do notice the number of user requests for these sorts of things.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "9 Nov 2005 — 1:30am",
      "content": "Thomas,\n\nDo you know if there's any plans of introducing a \"magic button\" to Illustrator that will create logos for you? Many clients already seem to believe that something similar exists. ;-)\n\n"
    },
    {
      "time": "9 Nov 2005 — 4:17am",
      "content": "Thank you Tomas! I voted and I hope every single person here does too!\n\n"
    },
    {
      "time": "9 Nov 2005 — 7:27am",
      "content": "I vo[mi]ted.\n\nhhp\n\n"
    },
    {
      "time": "9 Nov 2005 — 9:27am",
      "content": "Me too.\n\n"
    },
    {
      "time": "10 Sep 2010 — 9:43am",
      "content": "I use Windows character map. Press the windows key + R, type 'charmap' and blam you've got all the glyphs.\n\n"
    },
    {
      "time": "10 Sep 2010 — 10:04am",
      "content": "Welcome to typophile, assume you found this 5yr old thread via search. Unfortunately these are not the same thing. Charmap shows mapped glyphs. The Adobe glyph palettes show Unicode encoded glyphs and unmapped OpenType alternates.\n\n"
    },
    {
      "time": "10 Sep 2010 — 1:12pm",
      "content": "Just in case this thread gets revived in 2015:\n\nIt's 2010 and CS5 has been out for a couple o'months. Now I _know_ there is no Glyphs panel in Photoshop CS4, but what about CS5?\n\n"
    },
    {
      "time": "10 Sep 2010 — 1:23pm",
      "content": "Nope. The implementation and user interface for OpenType fonts has barely changed in any of the CS apps since OpenType support was added to each. The most significant change I've noticed in CS5 is that Illustrator now (correctly) has Contextual Alternates on by default, which I consider a bug fix, not a new feature.\n\n"
    },
    {
      "time": "10 Sep 2010 — 1:51pm",
      "content": "Here's the old thread... [http://typophile.com/node/32683](http://web.archive.org/web/20140806021858/http:/typophile.com/node/32683 \"http://typophile.com/node/32683\")\n\n"
    }
  ]
}
