{
  "id": "16130",
  "title": "Typographic exercise / challenge...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This is pure indulgence, but over the past few days I've come across a couple of aphorisms that have both, for whatever reason, struck home. They couldn't be more different, and this got me thinking. Would it be possible to set both in the same face and still serve the spirit of each? So, a challenge of sorts. I'm curious to see what those with too much time on their hands might come up with to set the following:\n\n1  \nY'know what your problem is?  \nYou're stupid.\n\n2  \nHow long will we continue to draw in our colouring books  \nan image of god that makes us sad.\n\n",
  "author": "jason",
  "time": "8 Nov 2005 — 11:33pm",
  "uid": "3771",
  "comments": [
    {
      "time": "9 Nov 2005 — 5:45am",
      "content": "\\> _set both in the same face_\n\nJason, do you mean simply set both in the same typeface,  \nor use the same face but with some creative typography?\n\n"
    },
    {
      "time": "9 Nov 2005 — 6:26am",
      "content": "If you are going to use the same tone of the voice for both of them  \nI suppose the anwer is yes.\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "9 Nov 2005 — 7:28am",
      "content": "Is those two aphorisms are only a typeface question?\n\n"
    },
    {
      "time": "9 Nov 2005 — 11:26am",
      "content": "My idea was that each aphorism seems to require a very different approach (different type, different typography), and this made me curious about if it would be possible to serve both/each using the same type and the same typographic treatment. The obvious rookie approach would likely be to reach to Comic Sans for the first and some tacky script for the second, but attempting to use either of those styles for both aphorisms would clearly fail miserably. I suppose I was curious to see if anyone would take up the challenge, and if so what they might come up with.\n\nNorbert, your second line is of course relative. How much is \"some creative typography\"? A little is often a lot. As I mentioned, this is a very indulgent post, so I don't want to limit anything. (We already tend to impose all kinds of restraint on ourselves anyway.)\n\nThe [small press](http://web.archive.org/web/20131106072853/http:/www.greenboathouse.com/) I run had, for a while, a project on our website that we called \" [Variant](http://web.archive.org/web/20131106072853/http:/www.greenboathouse.com/variant/index.htm).\" The idea was that we would find a quotation and post it on our website, then invite poets to write something exploring that quotation. From the submissions we would pick 5 that approached the passage in an interesting way and post those to the site, with a single submission being produced as a broadsheet which we distributed to all of those who submitted, as well as sending copies to our subscription list. What made this interesting was seeing how a wide variety of folks would interpret/interpolate the same quotation into very different poems. I suppose I was thinking along the same lines here in that I was curious to see how a range of typographers would approach two very different statements with the challenge being to use only one typeface to set both.\n\n"
    },
    {
      "time": "9 Nov 2005 — 12:00pm",
      "content": "This reminds me of Experimental Jetset's theory of Helvetica.\n\nIf I had the time I'd give it a shot.\n\n"
    },
    {
      "time": "9 Nov 2005 — 12:26pm",
      "content": "Here is mine:\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/fetteFrac.gif)\n\nChrisL\n\n"
    },
    {
      "time": "9 Nov 2005 — 12:28pm",
      "content": "Hey, clever.\n\nhhp\n\n"
    },
    {
      "time": "9 Nov 2005 — 12:58pm",
      "content": "There are several solutions that I can immediately think of because namely, if you take the \"design\" of a face out of the equation, the reader's mind will fill in the inflection.\n\nCheap trick and not necessarily creative by any means, but it works.\n\nIn the illustration below, by emulating a handwritten note, the reader directly connects to an individual writer's notes or correspondence and adds an inflection to the text.\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/dmato-text.gif)\n  \nLassigue Dmato Designed by: Jim Marcus of T-26 \n"
    },
    {
      "time": "9 Nov 2005 — 1:51pm",
      "content": "Odd... a blackletter typeface was my first instinct as well. I wonder why that is?\n\n"
    },
    {
      "time": "9 Nov 2005 — 2:07pm",
      "content": "Because blackletter is both cholo and religious/literary.\n\nBut this is really lucky. Generally, I don't  \nsee how Jason's exercise could really work.  \nWhich however does teach us about type.\n\nhhp\n\n"
    },
    {
      "time": "9 Nov 2005 — 2:31pm",
      "content": " ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/txt.jpg)\n  \nThis is a font I made this week in couple hours. I am an absolute novice at type design. Hence the circles and squares. \n"
    },
    {
      "time": "9 Nov 2005 — 2:44pm",
      "content": "My first thought was Fractur as a Nazi \"you are stupid\" and as a blackletter typical bible text. I liked the confrontation of Christ and antichrist. After seeing the text on the page, I thought it better suited to the problem as stated to use a bible/manuscript style for both but as a cartoon dialogue between opposite sides. Hence my solution.\n\nChrisL\n\n"
    },
    {
      "time": "9 Nov 2005 — 3:00pm",
      "content": "\\> I liked the confrontation of Christ and antichrist.\n\nOn the other hand, cholos are often strong catholics.\n\nhhp\n\n"
    },
    {
      "time": "9 Nov 2005 — 3:53pm",
      "content": "I have to admit that once again I agree with Hrant; that is, I don't see how this can really work, which is why I threw it out to see if anyone could prove me wrong.\n\nNorbert's take on this issue seems quite sound, both in theory and in his example. I'm not a fan of Lassigue Dmato, but it addresses the issues at play in this problem. I'd be curious to see it in Dear Sarah. That said, the more I look at Norbert's graphic the more each seems to work.\n\nI'd been imagining these aphorisms both as t-shirts, and as broadsheets, further complicating things insofar as the first doesn't \"deserve\" a broadsheet, nor does the latter \"deserve\" to be on a t-shirt. My thought was that only a relatively neutral type would allow all of these things at once: 2 very different messages produced on 2 very different mediums. That relatively neutral type, however, still needs a bit of personality to give each statement tone and character. Norbert's does just that.\n\nHopefully a few others will take up the call as well.\n\n"
    },
    {
      "time": "9 Nov 2005 — 5:49pm",
      "content": "The reason I feel the sample below works is for the very same reason that the \"design\" of the face actually becomes a visual trigger to the reader, again filling in the inflection of the \"anonymous individual\" who typed the text.\n\nI think the trick again is to make the reader imagine the voice of the writer. Handwritten and typewritten text (not word processing) puts the reader closer in contact with the writer's voice.\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/text-challenge2.gif)\n  \nP22 Typewriter designed by Richard Kegler  \nDesign owned by: IHOF \n"
    },
    {
      "time": "9 Nov 2005 — 8:28pm",
      "content": "I was interested in the idea of combining the two texts into a single text, yet still distinguishing them. Editorially, it struck me, as it seems to have struck Chris, that the two texts can be posed as a dialogue.\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/stupid.gif)\n\n"
    },
    {
      "time": "9 Nov 2005 — 11:39pm",
      "content": "Norbert, once again your logic is very sound, and, again, it seems to work in practice. I'm glad, now, that I threw this out there as you've raised some important points about connecting the reader with an annonymous voice.\n\nJohn, I'd steered clear of bringing the two into conversation, but you're right about there being a dialogue going on here (perhaps that's why these two stuck with me last week). The voice(s) of a contemporary mind cynically seeking \"wisdom\"? Maybe. My goodness, am I exposing myself through this thread?\n\nBack to business: the interlacing of the two is a nice idea, and the tight leading adds a sense of tension, but the giant \"STUPID\" in the background feels a bit domineering and messy, despite it being camouflaged. I think the exchange between the two statements already makes the point presented in your design. And then there's the absent period at the end, and a whole lotta drop-shadowin' goin' on. But there's definitely something interesting going on there.\n\nMuch gratitude to those who have given this a shot so far.\n\n"
    },
    {
      "time": "10 Nov 2005 — 6:07am",
      "content": "Personal question\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/What.gif)\n\n"
    },
    {
      "time": "10 Nov 2005 — 6:20am",
      "content": "That's a good concept André. I wish everything in red was a cleaner sentence verbally though. Maybe if the text in red just said: \"Your problem is...colouring an image of god...\" and the rest was black?\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2005 — 6:46am",
      "content": "I thouht about this sentence too, but I'd want to have a red colour on each line.  \nHere your suggestion Chris.\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/What_no2b.gif)\n\n"
    },
    {
      "time": "10 Nov 2005 — 8:22am",
      "content": "One reason why Chris' example works well is that he placed the text within the context of conversation by using cartoon balloons.\n\nThe next level of visual triggers that would improve the inflection tone of the text would be to give a face to the speaker:\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/sistine.jpg)\n  \n-\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/man-dog.jpg)\n\nI know that these don't comply with your ground rules for the excercise, Jason, but I started to push the question concerning text, typography, image and how they can effect tone and inflection. Plus it was FUN =-)\n\n"
    },
    {
      "time": "10 Nov 2005 — 8:29am",
      "content": "Norbert -- your Sistine Chapel version is hilarious!\n\n"
    },
    {
      "time": "10 Nov 2005 — 8:34am",
      "content": "Norbert, those are really hilarious!\n\n"
    },
    {
      "time": "10 Nov 2005 — 8:54am",
      "content": " ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/excersize2.jpg)\n\n"
    },
    {
      "time": "10 Nov 2005 — 9:22am",
      "content": "Isn't there a question mark missing from \"How long....\"?\n\n"
    },
    {
      "time": "10 Nov 2005 — 10:22am",
      "content": "^Yes.\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/Type.gif)\n\n"
    },
    {
      "time": "10 Nov 2005 — 10:40am",
      "content": "James!  \nThat is f\\*\\*\\*\\*\\*' brilliant!\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2005 — 11:21am",
      "content": "Yes... way, way, WAY COOL treatment, James.\n\n------------------------------------------------------------------------------------  \nYes, once I was a type _god_, but now I'm plain _stupid_ & happy!\n\n"
    },
    {
      "time": "10 Nov 2005 — 11:28am",
      "content": "_the interlacing of the two is a nice idea, and the tight leading adds a sense of tension, but the giant “STUPID” in the background feels a bit domineering and messy_\n\nYes, I agree. I wanted something in the background to add to the polyphony of voices, but the STUPID doesn't work as I had hoped. I'd set myself a time limit of ten minutes, though.\n\n"
    },
    {
      "time": "10 Nov 2005 — 11:29am",
      "content": "It was to easy...\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/What_no3.gif)\n\n"
    },
    {
      "time": "10 Nov 2005 — 11:33am",
      "content": "John,  \nThere is still good dialogue going on between the 2 voices. The big word \"stupid\" interupts it in a way that is confusing. Perhaps the more straightforward approach would be enough?\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2005 — 11:35am",
      "content": "I see the synergy working here as we learn from eachother. That is way better now André!\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2005 — 11:49am",
      "content": "I was getting a bit worried there for a minute as Norbert & Chris started throwing chimps around, but some great developments here as the concept is further explored.\n\nThe angle taken by James & pushed further by André is coming back around to the conflict that drew my attention to these two statements in the first place, a sort of internal battle between the two. However, the proximity of the two aphorisms in André's has removed the \"primary\" dialogue (that is, two separate statements) and instead focused on the \"supplementary\" commentary (in white). That supplement is very powerful in the last incarnation, but a bit of lead between the two would retain the first level of distinction.\n\n"
    },
    {
      "time": "10 Nov 2005 — 12:47pm",
      "content": "Sorry to knock youoff track Jason; some straight lines are hard to resist. I'll stop the monkey-shines :-)\n\nBack on task:  \nBelow is a McLuhanized version where the medium takes over the message:\n\nChrisL\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/Type-TelgrmComp2.png)\n\n"
    },
    {
      "time": "10 Nov 2005 — 1:08pm",
      "content": "Chris... please [STOP] and I'll stop monkeying around as well ;)\n\n"
    },
    {
      "time": "10 Nov 2005 — 3:04pm",
      "content": " ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/stupidsad.gif)\n  \nI know the commission for this project said that the phrases couldn't be more different, but to me they both seemed like something you'd see written on a 16-year-old girl's school folder. \n"
    },
    {
      "time": "10 Nov 2005 — 3:16pm",
      "content": "This thread is getting way cooler than I would've ever expected.\n\nhhp\n\n"
    },
    {
      "time": "10 Nov 2005 — 4:33pm",
      "content": "I'd like to see some smileys over the “i” instead of the fat dot.\n\nAnd a VanHalen logo.\n\n"
    },
    {
      "time": "10 Nov 2005 — 4:37pm",
      "content": "\"’I'd like to see some smileys over the “i” instead of the fat dot.\"\n\nYou should also add the word \"like\" liberally before every adjective and adverb too if you want that bopper feel:\n\n\"Dude, do you like know what your like pahroblem like is? Dude! You are like oh so stupid I could like hurl!\"\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2005 — 4:53pm",
      "content": "Oh jeez. It's, like, all gone to hell.  \nThat \"sad\" image is rapidly becoming self-reflexively ironic.\n\n"
    },
    {
      "time": "10 Nov 2005 — 6:03pm",
      "content": "\"That “sad” image is rapidly becoming self-reflexively ironic.\"\n\nSplen it tu mi Lutci?\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2005 — 6:13pm",
      "content": "Greyscale colouring of god (or whatever):\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/imageofgod.png)\n\n"
    },
    {
      "time": "10 Nov 2005 — 7:39pm",
      "content": "\\> _Oh jeez. It’s, like, all gone to hell._\n\nDon't get discouraged, Jason. You must admit that many rose to a challenge you yourself thought difficult. You must take the wheat with the chafe, throw it up in the air and let the wind separate what's good from what's not.\n\nAnyway, what other bunch of whacked eccentrics have you had more fun with and learned (and taught, thank you for your astute evaluations).\n\nLet the games resume! Creativity needs a little elbow room.\n\n"
    },
    {
      "time": "10 Nov 2005 — 11:07pm",
      "content": "Absolutely Norbert, not discouraged at all; this has been entertaining and edifying, and humbling as well. There was something serious, or, let's say sincere in my attraction to both of the aphorisms, and in the play between the two which began to reveal itself through this process. Earnest and/or playful, which has been reflected back in the various approaches.\n\nAnd then suddenly I felt rather foolish as this exercise revealed a 16-year-old-school-girl. Ack! Wha? Really? Well, yeah, I suppose so. At first eliason's take set me off, but that's just ego. It was an effective rendering, which was, after all, the challenge. That personality had been there all along in the content, of course, and eliason just tapped into it. The grasping of the latter statement next to the arrogance/ignorance of the former. Pure 16-year-old.\n\nNot to get all dramatic & squishy here, but this thread has been like a community coming together to explore an individual koan. Well, no, it _has_ been a community coming together to explore an individual koan. It's great. Intriguing and suprising and faultering and humbling. And through typography? Go figure. Great stuff.\n\nps. Ah, look, at least in my browser the above copy not only ends two lines with \"community\" but begins two lines with \"coming together to explore an individual koan.\" A typesetter's nightmare!\n\n"
    },
    {
      "time": "11 Nov 2005 — 2:03am",
      "content": "Hi everyone,  \nI'm new around here and I thought this post was very interesting and fun. Anyway I wanted get my hands dirty and join in.\n\nBoth line are strong. I love some of the examples above, so i thought I'd have a go.\n\nAlec\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/line.JPG)\n\n"
    },
    {
      "time": "11 Nov 2005 — 4:33am",
      "content": "Alec,\n\nYour approach looks as if it were an official inscription. It makes the statement appear to come from a Society (with reverence) as opposed to individuals. This is the first example to push it in that direction. Well done too!\n\nChrisL\n\n"
    },
    {
      "time": "11 Nov 2005 — 5:58am",
      "content": "John Hudson and Alec's post made me think of the following insriptional idea:  \n(I used my own work-in-progress font \"Now\"  \n [http://typophile.com/node/16147#comment-94901](http://web.archive.org/web/20131106072853/http:/typophile.com/node/16147#comment-94901 \"http://typophile.com/node/16147#comment-94901\")\n\nChrisL\n\n ![](http://web.archive.org/web/20131106072853im_/http:/typophile.com/files/shadow%20sad%20SM.jpg)\n\n"
    },
    {
      "time": "11 Nov 2005 — 7:00am",
      "content": "This is a bit large, and I'm not sure how to display in line, so:  \n [www.enneson.com/public\\_downloads/pe/stupid.gif](http://web.archive.org/web/20131106072853/http:/www.enneson.com/public_downloads/pe/stupid.gif \"www.enneson.com/public\\_downloads/pe/stupid.gif\")\n\n"
    },
    {
      "time": "11 Nov 2005 — 7:10am",
      "content": "whoops, forgot the:  \nin our colouring books\n\nwill rework when I have more time\n\n"
    },
    {
      "time": "11 Nov 2005 — 8:22am",
      "content": "Against my better judgement. Note: I've posted this offsite because it is not pretty. I won’t offer any big explanation either. Let it be.\n\n[http://i6.photobucket.com/albums/y234/jupiterboy/PB160014.jpg](http://web.archive.org/web/20131106072853/http:/i6.photobucket.com/albums/y234/jupiterboy/PB160014.jpg \"http://i6.photobucket.com/albums/y234/jupiterboy/PB160014.jpg\")\n\n"
    }
  ]
}
