{
  "id": "16147",
  "title": "NOW--The Sans of Time (Taken Lightly for Now)",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "\"Now\" is the \"other\" face I have been working on since Typecon (I alluded to it in my posting of \"Align\")  \nI started it with the capitals, trying to achieve classical Roman proportions in a light monoline sans serif. I then did the small caps since I like to use caps and small caps together in heads and subheads. The caps, with or without small caps, might be usable as inscriptions when used alone but my intention from the start was for the lower case to be a text face. The proportions of the lowercase follow Roman as well.  \nFor Now, I have only done the Light weight. The other weights will follow.  \nBelow is a quicky GIF and I have also attached a PDF showing text sizes down to 6 point in several languages (English, German, French, Italian, Czech, and Polish.)  \nOTF features include ligs, small caps, oldstyle figures, and fractions built from the nom/denom.  \nThe Now name and Time concept come out of the use of classical proportions in the context of present-day sans serif.\n\nPlease let me know what you think.\n\nChrisL\n\n ![](http://web.archive.org/web/20150123031946im_/http:/typophile.com/files/Now-sansoftime.gif)\n\nI have posted version Latvian text . See bottom PDF:\n\n| Attachment | Size |\n| --- | --- |\n| [Now\\_postTpfle.pdf](http://web.archive.org/web/20150123031946/http:/typophile.com/files/Now_postTpfle.pdf) | 139.15 KB |\n| [Now\\_postTpfle2.pdf](http://web.archive.org/web/20150123031946/http:/typophile.com/files/Now_postTpfle2.pdf) | 140.78 KB |\n| [Now\\_postTpfle3.pdf](http://web.archive.org/web/20150123031946/http:/typophile.com/files/Now_postTpfle3.pdf) | 89.44 KB |\n| [Now\\_postTpfle4.pdf](http://web.archive.org/web/20150123031946/http:/typophile.com/files/Now_postTpfle4.pdf) | 70.04 KB |\n| [Now\\_postTpfle5.pdf](http://web.archive.org/web/20150123031946/http:/typophile.com/files/Now_postTpfle5.pdf) | 142.46 KB |\n| [Now\\_postTpfle6.pdf](http://web.archive.org/web/20150123031946/http:/typophile.com/files/Now_postTpfle6.pdf) | 91.15 KB |\n| [latvian\\_un\\_text.pdf](http://web.archive.org/web/20150123031946/http:/typophile.com/files/latvian_un_text.pdf) | 34.3 KB |\n\n",
  "author": "dezcom",
  "time": "9 Nov 2005 — 6:34pm",
  "uid": "3135",
  "comments": [
    {
      "time": "9 Nov 2005 — 6:39pm",
      "content": "Oh, and Dan Reynolds--there is another one of my wierd \"g\"s to dreive you nuts :-)\n\nChrisL\n\n"
    },
    {
      "time": "9 Nov 2005 — 8:03pm",
      "content": "nice.\n\ng -- a little to high  \nM -- a little to wide. visually seems too big, hmm wide? or tall? maybe to the point where it is going to go into the splits. the SC version works for me so i'm guessing it is just too wide.  \nR -- leg is sticking out too far or the bowl is too shy\n\nmore?\n\n"
    },
    {
      "time": "9 Nov 2005 — 8:05pm",
      "content": "3 -- leaning too far to the right in both lining and ranging figs  \nri -- that combo is going to cause you problems  \nti -- nice lig. do we get an option without the dot?\n\n"
    },
    {
      "time": "10 Nov 2005 — 1:34am",
      "content": "Hehhe… I think that this is your most \"mainstream\" g to date. I'd like to see it in text again after you make Tiffany's improvement. Also, its left sidebearing might do with more space.\n\nI'd widen the lowercase r… it looks really small and narrow.\n\nThe bowl of your OsF 5 is too big for my taste. I'd lower its \"waist\" a bit, making that a little smaller.\n\n"
    },
    {
      "time": "10 Nov 2005 — 7:52am",
      "content": "Tiff,  \nThanks for your help! I will look, at the M. I think it is the points on top but it tricks me at different sizes. What about the W?  \nYes, for you, a dotless lig :-)  \nThe \"ri\" has always been my nemisis. I ended up doing an calt r in \"Align\" just to get around that issue. I may have to do the same for \"Now\".  \nMaybe bothe the R and P bowel are shy? I'll putz with it.  \nI'll try not to wizz by the g too much :-)\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2005 — 7:55am",
      "content": "Dan,  \nOh no! not a mainstream g? :-)  \nThe r battle still rages. I narrowed it to reduce the whole under the arm. If I ever fix the ri problem Tiff mentioned, I will be half way home.\n\nI see what you mean about the 5.\n\nThanks for your help!\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2005 — 7:58am",
      "content": "Tiff,  \nRegarding the 3. I can't see the lean right? Is it the combination the 3 is next to or am I just a blind old geezer:-) I'll look atit again tomorrow when I am not so close to it.\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2005 — 8:18am",
      "content": "Chris,\n\n3 (lining and ranging) -- the top bowl seems to be too far to the left. OR the entire shape is skewed to far to the left.\n\nW -- in the word NOW the O looks too small, being surrounded by all of those spikes. maybe the W is too wide as well. Does it hang lower than the O?\n\n"
    },
    {
      "time": "10 Nov 2005 — 10:08am",
      "content": "The caps are like Futura with slightly squarer curves, but I don't see that idea playing out in the lower case. Perhaps if you went to a single-story a and g.\n\nIf you're going to put a serif on the \"i\", why not on the cap \"I\"?\n\n"
    },
    {
      "time": "10 Nov 2005 — 2:28pm",
      "content": "Nick,  \nThanks for taking a peek!\n\nI didn't want it to be like Futura. I was avoiding the geometric quality. I wanted a more humanist approach but not a revival or even an attempt at an inspiration from another face. I could add monocular alt a and g for those who might want it though. Mostly, I have always wanted a monoline sans that had a Roman feel and that is the impetus I had to begin the project. Futura is too Bau Haus to fit the bill.\n\nI thought about the cap \"I\" but when I tried it seriffed, it looked too foreign to the rest of the caps. The lc \"L\" has hooked exit stroke. Maybe a seriffed cap \"I\" would get confused with that as well?\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2005 — 2:29pm",
      "content": "Tiff,  \nI'll try another shot at the 3 and M and W.\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2005 — 4:43pm",
      "content": "On another note--I should mention that the OTF frac code was learned from my thread here:  \n [http://typophile.com/node/16043](http://web.archive.org/web/20150123031946/http:/typophile.com/node/16043 \"http://typophile.com/node/16043\")\n\nand MANY THANKS TO ALL WHO CONTRIBUTED!\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2005 — 8:53pm",
      "content": "I have made the changes Tiff, Dan, and Nick suggested:  \nFixed M & W (depointed and reduced width;  \nadded dotles ti  \nlowered and respaced g  \nmessed with r and ri  \nunsloped 3s  \nreduces bowl of 5  \nCreated alternate g & a.  \nTinkered a bit with other stuff\n\nThere is a newPDF above at top post ^  \nChrisL\n\n ![](http://web.archive.org/web/20150123031946im_/http:/typophile.com/files/nitty%20gritty%20now.jpg)\n\n"
    },
    {
      "time": "10 Nov 2005 — 9:01pm",
      "content": "I see I should also have done a dotless fi and ffi while I was at it. Also, the right sidebearing of the r needs to be widened, dratts--too tired to fix it tonight. Besides, by tomorrow, you guys will have more to say :-)\n\nChrisL\n\n"
    },
    {
      "time": "11 Nov 2005 — 4:47am",
      "content": "I see now when I corrected the cap M that I didn't readjust the left sidebearing properly; and that \"LT\" could use some kerning.  \n:-\\<\n\nChrisL\n\n"
    },
    {
      "time": "11 Nov 2005 — 8:40am",
      "content": "In order to show the inscriptional possibility, I am posting this image mimicking a brushed metal museum sign.\n\nChrisL\n\n ![](http://web.archive.org/web/20150123031946im_/http:/typophile.com/files/MUSEUM_Sm.jpg)\n\n"
    },
    {
      "time": "11 Nov 2005 — 9:41am",
      "content": "Chris, better not fixed. I still see the 3 as being skewed in comparison to the other figs.\n\nNow that I've looked the PDF the f looks a little strange to me as well. It is really the only glyph that you've narrowed the tip. I am not talking change it completely. I can see that overall it works with the design. I could be wrong.\n\nThe M and W are fixed. Nice work.\n\nI like your mock-up.\n\nDid I mention that I love that U?\n\n"
    },
    {
      "time": "11 Nov 2005 — 10:43am",
      "content": "Thanks Tiff!\n\nI kept narrowing the f because it looked dark at small sizes (especially the ff ligs). This may be my laser printer. I will have to get a Lino one of these days to see what is what.\n\nI am still having trouble seeing the tilt to the right on the 3s both you and Dan Reynolds see. To me it seems tilted the other direction--maybe I need a few beers or at least a Mexican coffee to be able to see straight (or is it crooked:-)\n\nChrisL\n\nI like \"U\" too :-)  \nor is that U2?\n\n"
    },
    {
      "time": "11 Nov 2005 — 11:07am",
      "content": "I'm still seeing \"that was then\" Futura in the caps -- the basic proportions, the varying letterwidths in particular. Details like the U kink and subtle off-perpendicular joints don't change that.\n\nThe lower case is more \"this is now\" with semi-condensed, even-width forms.\n\nBut really, those aren't \"era\" features, but basic proportions. Renner mixed classic caps with neo lower case, but synthesized them with a corresponding variance of letter-width, and a uniformity of curve shape.\n\n"
    },
    {
      "time": "11 Nov 2005 — 11:08am",
      "content": ":^P\n\nI didn't mean to say the f is too narrow. I meant the top slow curve is, perhaps, a little to thinned. This is in comparison to all of the other glyphs which you don't seem to use this much gradual thinning on.\n\n"
    },
    {
      "time": "11 Nov 2005 — 11:17am",
      "content": "Hi Chris,\n\nThis design is very attractive. I think you are on to something very nice with the caps. Really, everything looks good, but I think the direction you started with is very strong and should be honored.\n\nLowercase is very nice, but consider matching the lc proportions more to the caps. They can be wider, looser, and still work in small sizes; in fact the additional air might improve readability. Please consider trying out some wider versions of abcdehkmnopqruyz. If this sounds inappropriate or uncomfortable, see Legacy Sans lowercase. I only suggest it to keep the majestic lapidary feel of the caps throughout. Right now, the lc looks like a different design than the caps.\n\nI think that your r is suffering from too much attention. I agree with Dan, it is too narrow. The issue of ambiguity will never go away completely, not in a clean, lapidary sans like this. See the r of Skia for an idea. It needs to have more width to be recognizable in text. if ri combos are bothersome, consider removing the spur from the i (and j). This convention from \"info sans\" designs seems foreign and mundane in such a stately design. i already has a dot keeping it unambiguous, and your l is differentiated, so maybe the ri combo problems are just a mirage. Try it with a simplified i and r. A ti ligature isn't a good enough reason to keep a feature that is interfering with basic combinations.\n\nI think your digital sign mock-up is a good illustration of the potential for this design. I want some of this for my house numbers! It's a very pleasing, open, architectural look and I think it is possible to carry that through into the lowercase. See Stellar, Legacy Sans, and Metro for some alternative approaches. Bo Berndal tried something similar with Naniara a while back; see if he solved any of the problems you are facing now.\n\nI like your U a lot too. It does seem a smidge pointy; maybe the lower right join could be brought up just a hair, making the angle less sharp. I would then try to soften the same feature of G. That area looks so square in the context of the rest of the caps.\n\nI think if you re-shape the f and j hooks to be more like arches, they will harmonize better. I know you've built a lot of ligatures already, but I find these 2 letters don't fit as well. j, f, r, and even t look a little like they are being starved. The caps and other lc are so graceful and open; keep this throughout.\n\nAll my comments are intended to help you eliminate inappropriate or stiff features, because I think the caps are so beautiful and strong, it's a very worthwhile direction to follow. I think it's got great potential. Getting the lc might be difficult, but I know you are not looking for something easy, or else you would be playing Nintendo. I don't know if anyone has done a lapidary sans with such stately caps, and matched it well with lowercase. Be the first!\n\nVery exciting work! Please keep us posted.\n\n"
    },
    {
      "time": "11 Nov 2005 — 12:15pm",
      "content": "Carl,  \nThanks for taking the time to comment so thoroughly!  \nThe lower case started out wider and looser a few weeks ago. Since then, as the tinkering continued, it tightened up to correct holes in the color.  \nI think you might be right about the ri. It is the horizontal of the i which crashes into the r. I will try one straight up. The ti lig was put in to correct a similar failing in the t next to i. I did not start off with the ti lig in mind and am not married to it so if it goes, I won't cry:-)  \nThe join of the U was up higher before but tended to get lost so I pulled it down some. I will take another look at it.  \nI am a bit confused by your comment: \"but I find these 2 letters don’t fit as well. j, f, r, and even t look a little like they are being starved.\" You mention 2 letters but name three. Did you mean the 3 letters in combination with each other?  \nI will also take a look at the faces you mentioned as examples!\n\nThanks for your help!\n\nChrisL\n\n"
    },
    {
      "time": "11 Nov 2005 — 12:22pm",
      "content": "\"I didn’t mean to say the f is too narrow. I meant the top slow curve is, perhaps, a little to thinned.\"\n\nThat's what I thought you meant.\n\n\"...better not fixed. I still see the 3 as being skewed in comparison to the other figs.\"\n\nStrangely, I see the 3s as skewed too much to the left instead of the right.  \nI am attaching a GIF which has \"Now\" at the top followed by a few other fonts. The red lines on the first showing of the 3s indicate how my eyes see the lean. The other fonts pictured look more sloped to the right than my \"Now\" does to me. Am I misunderstanding you or am I really in need of new glasses?\n\n ![](http://web.archive.org/web/20150123031946im_/http:/typophile.com/files/333.gif)\n\nChrisL\n\n"
    },
    {
      "time": "11 Nov 2005 — 12:25pm",
      "content": "Nick,\n\nI wiil take a closer look at Futura to see what you mean. I have yet to lay the 2 side-by-side but maybe that will help me \"see the light\" :-)\n\nChrisL\n\n"
    },
    {
      "time": "11 Nov 2005 — 12:31pm",
      "content": "That small caps is working really well for me.\n\nThe wide M is ok, not a problem. I visually match the open top of the M to the beautiful U.\n\nThe lc “r” and “i” together are blending maybe too much. Already addressed.\n\n"
    },
    {
      "time": "11 Nov 2005 — 1:39pm",
      "content": "I am posting a GIF file comparing several light sans faces in caps and lc. \"Now\" and Futura are in black while the rest are grey. I am looking at not only proportions, but how geometric (or not) the faces are. I threw in Trajan as a comparison to classical and Dax as straight out contemporary sans.  \nNick is right about the likeness of the curves holding Futura together. Futura's proportions are by far the most extreme--even more so than Trajan. I do feel that what makes the curves hold as family is their geometric nature though. Now that I look at the \"M\" I made for \"Now\", it does look a lot like the Futura \"M\" as noted by Nick.  \n\"Now\" does appear to be closer to classical Roman titles to me than Futura does though. That is not by any means a fault in Futura. It is perfect the way that it is. I am just noting the comparison as a non-qualitative observation.  \nAt any rate, take a look and see what you all see in the comparison without my bias :-)\n\nChrisL\n\n ![](http://web.archive.org/web/20150123031946im_/http:/typophile.com/files/compare_Now.gif)\n\n"
    },
    {
      "time": "11 Nov 2005 — 1:45pm",
      "content": "If I see anything, I see Gill more than I see Futura. Even then I don't really see it. I'd forget about these comparisons and fix your 3.\n\n=^D\n\n"
    },
    {
      "time": "11 Nov 2005 — 1:51pm",
      "content": "\"I’d forget about these comparisons and fix your 3.\"\n\nDoh! :-)\n\nChrisL\n\n"
    },
    {
      "time": "11 Nov 2005 — 5:23pm",
      "content": "Chris,\n\nI think it's fine to look at so many other faces. I assumed you would do that anyway. One thing I find so intriguing and pleasant about your design is that it has some of the proportions of something grand like Trajan, while also having some of the serene quality of a monoline geometric sans. blending those styles is an interesting experiment. I think Metro, as mentioned before, is a good example of that kind of synthesis, and I recall also a titling face Jonathan Hoefler made (Topaz) that has some of this too. I believe that Thomas Finney's yet-unreleased design is also intended to harness some of the simplicity of Futura while offering more humanist flexibility. Maybe he would give us a peek?....\n\nI do also think the 3 looks tilted. ;D\n\n"
    },
    {
      "time": "11 Nov 2005 — 7:02pm",
      "content": "\"I do also think the 3 looks tilted. ;D\"\n\nBut which way? to me it tilts left, to Tiffany it tilts right. I have always trusted my eyes but ifeel like I am tapping a red tipped cane while someone in the darkness yells out to me, \"more to the left\".\n\nChrisL\n\n"
    },
    {
      "time": "11 Nov 2005 — 7:15pm",
      "content": "Carl,  \nI make it a point not to look at other typefaces (particularly ones of the same ilk) so that I don't get that image burned into my mind and just repeat it. Now that I am far enough along and my type has its own voice, I can look at the older members of the choir without accidentally singing in their key.  \n\"One thing I find so intriguing and pleasant about your design is that it has some of the proportions of something grand like Trajan, while also having some of the serene quality of a monoline geometric sans.\"  \nThat was exactly my intention except for the geometric part. There are no regular or compass-made curves.  \nAs I tried to say in the first post (but not as poetically as you said), \"I started it with the capitals, trying to achieve classical Roman proportions in a light monoline sans serif. \"\n\nI think Thomas Phinney's sans is a geometric. I don't think Adobe would let him post it here before it's released by them. I am sure it will have major cool OTF features though. Thomas is a code writing monster machine:-)\n\nChrisL\n\n"
    },
    {
      "time": "12 Nov 2005 — 2:11pm",
      "content": "I have posted another PDF with changes. As per Nick and Carl, I changed the i removing the arm. I also changed all the f ligs and adjusted the top arm as per Tiff.  \nI redid the r to more fit the rest and now the ri looks more palatable.  \nTIF—\\>I tilted the 3s MORE to the left (even though it pains me to see it that way).\n\nLet me know how it looks now :-)\n\nChrisL\n\n"
    },
    {
      "time": "12 Nov 2005 — 2:29pm",
      "content": "I really love your typeface Chris. The only glyphs I'd work on would be the lower case r, because I find it has too much inside curve causing problem with the i. Did you try something shorter?\n\nGreat typeface.\n\na\n\n"
    },
    {
      "time": "12 Nov 2005 — 2:39pm",
      "content": "\"Did you try something shorter?\"\n\nTHANKS André! You make me blush with pride:-)\n\nAbout the r--I just made it longer in response to some comments above. I was hoping I had corrected the \"ri\" problem :-/  \nWhich sample PDF did you look at? The most recent is the third one (bottom).\n\nChrisL\n\n"
    },
    {
      "time": "12 Nov 2005 — 3:17pm",
      "content": "Carl,  \nI just looked at Topaz for the first time. I didn't realize that it existed. It does appear to be in the same vein as \"Now\" :-\\<\n\nChrisL\n\n"
    },
    {
      "time": "12 Nov 2005 — 5:20pm",
      "content": "Oh dear. I did say, \"right\". I meant, of course, left.\n\nfi -- is it too wide?  \nffl -- is the second f too flat?  \nffi -- ditto  \ni -- not sure  \nj -- not sure\n\n3 -- still wrong. my bad. see image. The gray designates your 3 and the black is how much I might correct it.\n\n ![](http://web.archive.org/web/20150123031946im_/http:/typophile.com/files/lozos-3.gif)\n\nAs for Topaz. I hadn't noticed that until it was pointed out. There are some major differences, not least of which is you are giving us a lowercase. Keep going.\n\n"
    },
    {
      "time": "12 Nov 2005 — 5:53pm",
      "content": "¬ Which sample PDF did you look at? The most recent is the third one (bottom).\n\nI effectively look at the second one for the r. The third one is greatly improve.\n\n"
    },
    {
      "time": "12 Nov 2005 — 6:00pm",
      "content": "I'd say the 3 from Miss Tiffany is in the way a 3 is suppose to, but Chris before to throw away your 3 I'd wait. I find he give to the typeface a saucy look. Especially int the OSF number.\n\n"
    },
    {
      "time": "12 Nov 2005 — 6:21pm",
      "content": "Tiff,  \n\"3 — still wrong. my bad. see image. The gray designates your 3 and the black is how much I might correct it.\"\n\nNow I feel sane again! I thought I was going bonkers! I have been making it worse instead of better. Now I feel MUCH better about it :-)\n\nChrisL\n\n"
    },
    {
      "time": "12 Nov 2005 — 6:22pm",
      "content": "André,\n\nThanks, you set my mind at ease :-)\n\nChrisL\n\n"
    },
    {
      "time": "12 Nov 2005 — 7:19pm",
      "content": "While I am fixing my 3s, I will post a JPG of another museum sign I faked:\n\nChrisL\n\n ![](http://web.archive.org/web/20150123031946im_/http:/typophile.com/files/museum%20etch.jpg)\n\n"
    },
    {
      "time": "12 Nov 2005 — 7:25pm",
      "content": "It's coming along very well, Dez ol' boy.  \nI do like the figures in both forms, and I agree with André with not throwing out the \"3\" just yet. It looks more \"normal\" when straightened, but there is something of unique potential that I see in the tipped figure, especially in the old style \"3\".\n\nIt may be worth a few more refinements, and I don't believe it is just in it's axis. Set it aside for a while (as you always have the option of a straightened version).\n\n"
    },
    {
      "time": "12 Nov 2005 — 7:28pm",
      "content": "Thanks Norbert, you've got my number :-)\n\nChrisL\n\n"
    },
    {
      "time": "13 Nov 2005 — 10:26am",
      "content": "THREE! THREE! THREE! THREE!\n\nI \"fixed\" the 3s (I hope) and putzed with the ligs as per Tiff.  \nThe new and improved PDF is posted at the top.\n\nChrisL\n\n"
    },
    {
      "time": "13 Nov 2005 — 11:37am",
      "content": "Here is a SPECIAL address for Tiffany:-)\n\nChrisL\n\n ![](http://web.archive.org/web/20150123031946im_/http:/typophile.com/files/333streetFlat.jpg)\n\n"
    },
    {
      "time": "13 Nov 2005 — 12:09pm",
      "content": "Chris,\n\nI think your new face is coming along very nicely. The overall look and spacing is looking good. The only suggestions I can think of making have to do with picky details.\n\nI would do the top of the f more like the top of the a. There is something unbalanced about it to my eye. The a doesn't have the problem.\n\nThere are some other terminal strokes that have a similar problem, such as the tail of the y and l.\n\nThe ends of the stroke on the s would look better to me if they were perpendicular to the angle of the stroke, rather than oblique to it. More like the top right of the S. (I would change the bottom of the S in the same way.)\n\nOverall, there are some inconsistencies in the stroke terminals--some are perpendicular to the stroke angle, some are oblique, some are perpendicular to the baseline. There's nothing wrong with having some variety, but it seems a bit arbitrary to me.\n\nI can see why you are putting that little bend in the i and j, but I think it will call unnecessary attention to itself at display sizes.\n\nThe absence of the lefthand stroke on the f and t bugs me, but I if you feel it is important to the design, don't change it. Putting the strokes in would make it look more \"normal\" which may or may not be what you want.\n\nI think you ti ligature needs the i dot.\n\nThe curves at the bottoms of the l and t need some work. I would try to make them flow more smoothly around the curve.\n\nAll for now. More later if I think of anything else.\n\n"
    },
    {
      "time": "13 Nov 2005 — 12:20pm",
      "content": "As I already wrote on an other thread, typeface design is a personal feeling. I like what you've done with the new 3 Chris, but I still feel good with the previous one. The final choice will be yours and I'm sure it's gone a be a good choice.\n\nCongratulations!\n\n"
    },
    {
      "time": "13 Nov 2005 — 12:42pm",
      "content": "Thanks Mark and André!\n\nMark, I will take a closer look at the terminals. I think you are right about the dot in the ti lig. I very much appreciate your \"expert\" eye.  \nAndré, I am glad the 3 appeals to you. It was driving me crazy :-)  \nThank you both for the encouragement!\n\nChrisL\n\n"
    },
    {
      "time": "13 Nov 2005 — 4:13pm",
      "content": "Mark, See my last PDF. It is new.  \nI have made all the changes you suggested except for adding the left bar on the f.  \nI redid all the terminals to make them perpendicular to the stroke; I made the f, t, y, and j curve like the top of the a. I therefore had to redo all my ligs to match.\n\nI think you were right about all. It is a definite improvement. Let me know what you think?\n\nChrisL\n\n"
    },
    {
      "time": "13 Nov 2005 — 5:04pm",
      "content": "Looks good. I'll post again if I think of any other ideas.\n\n_I therefore had to redo all my ligs to match._\n\nA general tip: Don't rush to fill your character set. You can save time down the road by putting off the building of glyphs which have identical or similar character parts as late as possible. At first, you may think a certain form is perfect and ready to start building related glyphs, but later you may well have a better idea. If you have replicated the form over many glyphs, it means lots of extra work. It's always a judgement call. I am always tempted to jump ahead to see how things are going to pan out, so I can relate.\n\n"
    }
  ]
}
