{
  "id": "16185",
  "title": "Font for guitar letterhead",
  "forum": "Design",
  "tags": [

  ],
  "content": "I need a new font for our corporate letterhead contact details. Here’s the logo:\n\n ![](http://web.archive.org/web/20081203235533im_/http:/typophile.com/files/logo_fortypophile.jpg)\n\nBoth the graphic and the name Alembic need to stay the same (though I think they are too close and crowded looking in the picture above). Our old letterhead is very 80’s: a gradient strip on the left with the line art and contact details reversed. The font was Futura.\n\nThis time, we’ll be using the full color logo, a return to our original ID. I need a font that is classy, since we are a high end guitar maker. But it shouldn’t be harsh, since our product is handmade and sensual. Any suggestions of specific fonts or general styles that would fit the bill?\n\n [‹ Improving on the classics](http://web.archive.org/web/20081203235533/http:/typophile.com/node/16250 \"Go to previous forum topic\") [Urgent - Problem with P. Bruhn's Mayo ›](http://web.archive.org/web/20081203235533/http:/typophile.com/node/16197 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203235533/http://typophile.com/user/2127\" title=\"View user profile.\">mica</a>",
  "time": "<br>",
  "uid": "2127",
  "comments": [
    {
      "time": " 10.Nov.2005 7.04pm",
      "content": "Bodoni\n\nChrisL\n\n"
    },
    {
      "time": " 10.Nov.2005 8.13pm",
      "content": "Hmm. You need a sans that isn’t pretentious or stuffy. What about Font Bureau’s Agenda?\n\n"
    },
    {
      "time": " 10.Nov.2005 8.14pm",
      "content": "A lambic? Now I’m thirsty!\n\nA couple of things come to mind:\n\nCeleste  \nBernhard Modern  \nCastellar  \nVeljovic\n\n"
    },
    {
      "time": " 11.Nov.2005 8.28am",
      "content": "Are there other typefaces you’re currently using on other print materials (brochures, etc.) that would work? It’s always good to have a selection of approved typefaces to use on all your materials, the letterhead is one piece within your overall identity, so consider faces that will work on a wide range of materials, not just the letterhead. Sounds like there may not be a corporate guidelines book for you to follow, so now is your chance to start establishing those guidelines.\n\nBy the way, have you seen this?  \n [http://www.psyops.com/html/spec\\_alembic.html](http://web.archive.org/web/20081203235533/http:/www.psyops.com/html/spec_alembic.html \"http://www.psyops.com/html/spec\\_alembic.html\")\n\n"
    },
    {
      "time": " 11.Nov.2005 8.31am",
      "content": "If the word ’Alembic’ as has been shown is to be kept I really think any decorative, including a serif font, is wrong.\n\n"
    },
    {
      "time": " 11.Nov.2005 10.34am",
      "content": "Alembic is such a well-known name in the high-end market too! (Stanley Clarke and Mark King; two very influential electric bassists.)\n\nI agree whole-heartedly with Tiffany. I think the companion font should be a sans serif, but with some hand-made feeling. Nothing too neutral or crazy.\n\nHere’s a couple of nice ones which we distribute.  \nKarsten Luecke’s “Tiptoe” \\_ [http://vllg.com/KLTF/Tiptoe/mudTyper+Weights/](http://web.archive.org/web/20081203235533/http:/vllg.com/KLTF/Tiptoe/mudTyper+Weights/ \"http://vllg.com/KLTF/Tiptoe/mudTyper+Weights/\")  \nMário Feliciano’s “Stella” \\_ [http://vllg.com/Feliciano/Stella/mudTyper+Weights/](http://web.archive.org/web/20081203235533/http:/vllg.com/Feliciano/Stella/mudTyper+Weights/ \"http://vllg.com/Feliciano/Stella/mudTyper+Weights/\")\n\nAnd I would also encourage looking at František Štorm’s collection:  \n [http://www.stormtype.com/sebastian.html](http://web.archive.org/web/20081203235533/http:/www.stormtype.com/sebastian.html \"http://www.stormtype.com/sebastian.html\")  \n [http://www.stormtype.com/zepp.html](http://web.archive.org/web/20081203235533/http:/www.stormtype.com/zepp.html \"http://www.stormtype.com/zepp.html\")  \n [http://www.stormtype.com/dynag.html](http://web.archive.org/web/20081203235533/http:/www.stormtype.com/dynag.html \"http://www.stormtype.com/dynag.html\")  \n [http://www.stormtype.com/jsans.html](http://web.archive.org/web/20081203235533/http:/www.stormtype.com/jsans.html \"http://www.stormtype.com/jsans.html\")  \n [http://www.stormtype.com/metron.html](http://web.archive.org/web/20081203235533/http:/www.stormtype.com/metron.html \"http://www.stormtype.com/metron.html\")  \n [http://www.stormtype.com/solpera.html](http://web.archive.org/web/20081203235533/http:/www.stormtype.com/solpera.html \"http://www.stormtype.com/solpera.html\")\n\nSpalted type...\n\n"
    },
    {
      "time": " 11.Nov.2005 10.48am",
      "content": "Barnbrook (Virus) is in the alchemical zone.  \nPriori has those symbolic lower case characters (n = 3 sides of a square) that have a vibe with Boyle’s elemental symbols (17th C), which Futura connects with also. Ancient and modern at once.\n\n"
    },
    {
      "time": " 11.Nov.2005 2.10pm",
      "content": "My opinion is that this begs for No font but one from handwork.\n\n"
    },
    {
      "time": " 11.Nov.2005 2.20pm",
      "content": "Take a look at Tarzanna and Vista from Emigre. I think Tarzanna might work better because it has a small x height. What you need is something that allows the elaborate logo to dominate and is quietly in the background. I would suggest what ever you use to either add a PMS gray for the type or a tint of black.\n\n"
    },
    {
      "time": " 14.Nov.2005 9.55pm",
      "content": "Wow, thanks for the great suggestions everyone. This is not an easy job for me, and the help is really welcome.\n\nChris, we use a variety of fonts for the brochures, website, etc, and you’re absolutely right for the need for guidelines, and so I start on the simple part of letterhead and business cards, which are the first items I’ll actually produce. Right now I’m enjoying things as different as Tankard’s Alchemy and Simonson’s Grad. I use Minion for our owner’s manuals.\n\nTiffany, I do agree that it needs to be almost anti-decorative, or least only very subtle. All the serif fonts I tried weren’t looking quite right.\n\nChester, your list of suggestions produced quite a suprise in Solpera - it’s now on my short list with Stella. Spalted type? Heh, that won’t last for many impressions. Lignum vitæ, now you’re talking.\n\nNick and Dan, I think I’m not brave enough for Emigre. I _want_ to like them, but then there’s always some design aspect I don’t seem to understand.\n\nHere’s the worst thing: our address.\n\n3005 Wiljan Ct.  \nSanta Rosa, CA 95407\n\n“Wiljan” was made up by the developer of the buildings on our street. It combines all the goodness of “William” with the beauty of “Janet” and smashes them into one ugly word.\n\nIt’s likely the paper will be a sort of parchment-like antique color, because that’s what my mom wants and she is the boss. In that case, the type will be set in a nice woody brown tone. I’m still evaluating papers, each part helps form the whole, and all aspects influence the others.\n\n"
    }
  ]
}
