{
  "id": "16198",
  "title": "multi-printer license?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I am a beginner to the world of typography and have what seems to be a rather basic question about typeface purchasing. Carter and Cone's licensing agreement (for ITC Galliard CC) includes the following paragraph:\n\n\"The Software is licensed for use on a single output device such as a laser printer, film recorder, high-resolution typesetting device, or other such imaging device. If you need to use the Software on more than one output device, you need to upgrade to a multi-printer license.\"\n\nCan anyone elucidate this for me? How can they expect a user to utilize a single printing device? (Note that I'm attempting to purchase a typeface for the first time and am hesitant to spend the money being unsure of what I'm getting.)\n\n",
  "author": "louis",
  "time": "11 Nov 2005 — 5:38pm",
  "uid": "10103",
  "comments": [
    {
      "time": "11 Nov 2005 — 5:51pm",
      "content": "Welcome to the world of EULAs (End User License Agreements). It's a hot topic here, as a search of this forum will reveal. See [The End User's Manifesto.](http://web.archive.org/web/20131014001421/http:/typophile.com/node/14264)\n\nEvery font foundry is free to set their own terms of use, and the font user is free to accept them, negotiate with the vendor, or look elsewhere for their fonts.\n\nThe terms offered by this licensing agreement seem pretty clear to me, but it's possible that if you contact Carter and Cone you could obtain different terms, or you might find that a multi-printer license is within your means. Certainly a license for Galliard CC is a worthwhile purchase, if you can obtain it on terms you can live with.\n\n"
    },
    {
      "time": "11 Nov 2005 — 6:13pm",
      "content": "What does it mean to be licensed for use in a single output device? On the surface it appears to mean that, upon installation, I have permission to print with a prescribed printer and no other. This can't be true, can it?\n\nWhat if, for instance, I replace my printer or I wish to have my documents professionally printed? I must really be in the dark on this.\n\n"
    },
    {
      "time": "11 Nov 2005 — 8:29pm",
      "content": "I don't think you'd have to worry if you replaced your printer, but it is quite common for foundries to require that outside agencies have their own license for fonts you want them to print.\n\nSome foundries allow you to supply fonts to an outside agency if the fonts are only used to output your work, but that's rather unusual. Many, but certainly not all, foundries will allow you to make a PDF for output.\n\nAgain, the simple fact is that the EULAs can say whatever the foundry wishes...they can require you to only use their fonts to promote dental hygiene if they wish: it's their prerogative. (Within the limits of the law.) It's up to you to read and understand the EULA before you buy. If you don't like the terms, or you don't understand them, by all means contact the foundry.\n\nDifferent foundries have different terms, and you should take those terms into consideration when buying. It even happens that the same font can be offered on different terms from different vendors.\n\n"
    },
    {
      "time": "12 Nov 2005 — 7:05am",
      "content": "Frankly, I think this particular wording is a hangover from Ye Olden Days, when font outlines had to be loaded onto the output device (like to old Compugraphic photosetters). With all the newfangled contraptions available today, the outlines are downloaded to the printer when you send the job and, in a typical printshop workflow, that might mean sending it to a laser printer for rough proofing, then a color laser for intermediate proofing, a color plotter for final proofing, and a film or CTP imagesetter for final output. Foundries should perhaps _read_ their own EULAs and adjust them accordingly to reflect working realities, consarn it.\n\n"
    },
    {
      "time": "12 Nov 2005 — 7:50am",
      "content": "I agree that the one output device restrictions seems very, well, very restrictive, and I've never been clear what it really means in practice.\n\nIf I have 2 printers, e.g. an inkjet and a laser printer, and they're both connected to my computer, well, yes, it seems clear that a \"single output device\" EULA would see me buying a second license.\n\nBut, as Louis has pointed out, surely I don't need to buy a new license when I replace my printer.\n\nWell, what about if I decide I'll never print Galliard on my inkjet, only on my laser. Surely that's okay, right?\n\nNow I'm on a slippery slope: can I change my mind, and say I'll only use it on the inkjet starting tomorrow? Would it be okay if I unplugged one printer when I was using the other?\n\nClearly it takes no time at all for the situation to become absurd. So, the best thing really is to contact the foundry and ask for different terms, and hope they rewrite their EULA, if not for everyone, at least for you.\n\n"
    },
    {
      "time": "12 Nov 2005 — 8:29am",
      "content": "\\>With all the newfangled contraptions available today, the outlines are downloaded to the printer when you send the job\n\nFor a lot of output devices (such as ink-jets) the whole page is rendered as a graphic which is sent to the printer - the fonts never get downloaded to the printer. In fact a lot of these printers have very small memory buffers so couldn't hold a font even if you wanted them to.\n\nSi\n\n"
    },
    {
      "time": "12 Nov 2005 — 9:42am",
      "content": "\\> a lot of these printers have very small memory buffers\n\nSmaller than a font?!\n\nhhp\n\n"
    },
    {
      "time": "12 Nov 2005 — 10:52am",
      "content": "Oldnick was right. I just got a reply from Cherie Cone wherein she stated that Fontshop's C&C license is a tad on the ancient side. She forwarded me C&C's current EULA. The critical section appears below:\n\n\"The Software is licensed for use on a single central processing unit (CPU). If you need to use the Software on more than one such device, you need to upgrade to a multi-user license.\"\n\nThat is, \"single output device\" should now read \"single central processing unit\".\n\nNow that that's clear, and it seems to be a rather common restriction, I assume that I am permitted to install the font on any one computer at a given time. That is, surely I may install the font on an infinte number of PCs provided that I've removed it from the previous unit(s), correct?\n\nIf I am to print through outside sources, which I am now presuming to be legal, am I correct to assume that the font need not be installed on such PCs in order to print my work? Is it possible to re-work documents on PCs without the font installed? (I presume it is not.)\n\n"
    },
    {
      "time": "12 Nov 2005 — 12:23pm",
      "content": "That's good to know that C&C were able to help you.\n\nConcerning outside printing: as I said before, PDFs are often permitted for this purpose, and have advantages of their own. Does the C&C EULA make mention of them?\n\n"
    },
    {
      "time": "12 Nov 2005 — 2:21pm",
      "content": "They didn't mention PDFs specifically but they did prohibit embedding which, I assume, applies to PDFs.\n\nAre you implying that outside printing won't be possible unless it's in a PDF format? Won't it be possible to utilize the font in, say, Microsoft Word and then print it as a Word document?\n\n"
    },
    {
      "time": "12 Nov 2005 — 3:15pm",
      "content": "To print a Word doc, the outside party would have to have their own copy of the font.\n\n"
    },
    {
      "time": "12 Nov 2005 — 3:31pm",
      "content": "There must be a myriad of ways of getting around this (I hope). Are there any typical solutions?\n\nPerhaps there's a way to convert the entire page into a graphic and thereby bypass the need for a font in the foreign PC?\n\n"
    },
    {
      "time": "12 Nov 2005 — 4:55pm",
      "content": "nice convo so far all.\n\nfirst. louis, could you please e-mail C&C's EULA to me? i collect them. thanks.  \ntypegirl-at-mac-dot-com\n\nsecond. you would be taking advantage of the foundry if you did use your line of thinking in regards to using, uninstalling, reinstalling, using, uninstalling, on many different computers. that is not what the license means.\n\nthird. if C&C state they do not allow embedding, you are correct to assume that this means PDFs (among other things).\n\nyou should email them again and specifically ask about your concern. explain to them that you only want to be able to give service bureaus the PDF. is that right?\n\n"
    },
    {
      "time": "12 Nov 2005 — 6:53pm",
      "content": "This all seems much too complicated. All that I want to do is obtain a distinctive and particularly excellent font for use when writing academic papers, letters, and laying out academic presentations. Am I making it more difficult than it actually is?\n\nI'm beginning to wonder for whom it is actually advantageous to purchase new fonts, insofar as there is so much red tape.\n\nPerhaps font acquisition is only useful for professional graphic designers, publishers and the like. . .\n\n"
    },
    {
      "time": "12 Nov 2005 — 7:18pm",
      "content": "If that's the impression you're getting then we're doing something wrong.\n\nI repeat:  \nWe need a human document in parallel to the EULA.  \nIt doesn't need to be legally binding.  \nIt needs to be sincere.\n\nhhp\n\n"
    },
    {
      "time": "12 Nov 2005 — 8:14pm",
      "content": "I don't necessarily think you should give up on C&C, but if they won't allow embedding there are lots of other fonts producers to look at that do: Adobe, the FontFont selections at Fontshop, OurType, and many others.\n\n"
    },
    {
      "time": "15 Nov 2005 — 11:28am",
      "content": "Louis,\n\nPlease do not be discouraged. As you can see, these EULA restrictions require further refinement and explanation for all. I do suggest you contact Cherie Cone again and explain your intended use. You are obviously not the type of person to harm Carter and Cone's business by your font usage. Surely Cherie will see that embedding is a vital part of the publishing workflow now, and will have some way to satisfy all your usage needs without excess expense or hoop-jumping.\n\nOne reason I suggest resolving this with C+C is that you will be getting the most authoritative, complete, and useful version of Galliard that can be had; it's a little like having your shoes handmade custom for you. Get all the parts; the small caps of Galliard are splendid.\n\n"
    },
    {
      "time": "15 Nov 2005 — 12:36pm",
      "content": "Louis,  \nI agree with Crossgrove; if you contact C+C (again) and tell them what your intended use is, hey should be willing to offer you a personalised EULA.\n\nAs has been stated elsewhere on this site, many EULAs have been written and re-written to deal with particular circumstances, like say: A purchaser buys a font license, she then embeds particular phrases set in the font in PDFs which she sells for profit. As a result, she is eating into potential sales of the font. (This is purely hypothetical.) The foundry would likely, and understandably, respond with a knee jerk: banning all embedding.\n\nThe result of this protectionism is that honest people are made to feel like potential criminals, and are restricted in the use of the fonts. All because of a few bad apples.\n\nI salute you for wanting to legally license \"Galliard\" because it is a great typeface, and you want to raise the visual quality of your documents.  \nc\n\n"
    }
  ]
}
