{
  "id": "16207",
  "title": "Gangster Font?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm old enough that when I hear the word \"gangster,\" I immediately think of Al Capone. However, my young client is thinking in terms of \"Hip-Hop Gangsta' Rap.\" When you all stop lauging, can you recommend an interesting logo font for a small record company specializing in Gangsta' Rap? (Oh yes, I should mention that it's specifically Cholo Gangsta' Rap).... Blackletter fonts that resemble tattoos are the most obvious choice, but is there anything else out there that might be a more interesting alternative? I'm certain this forum is loaded with gang members, so I eagerly await your response!  \nThanks one and all!  \nDK~\n\n",
  "author": "Da Kine",
  "time": "12 Nov 2005 — 11:13am",
  "uid": "9426",
  "comments": [
    {
      "time": "12 Nov 2005 — 11:21am",
      "content": "A good blackletter thread - [http://typophile.com/node/9921](http://web.archive.org/web/20150130042810/http:/typophile.com/node/9921 \"http://typophile.com/node/9921\")\n\n"
    },
    {
      "time": "12 Nov 2005 — 12:32pm",
      "content": "' [Capone](http://web.archive.org/web/20150130042810/http:/www.caketype.com/typefaces/type_cap.html)', by Pieter van Rosmalen.. :)\n\n_( Hmm.. A custom created, handdrawn, well, a 'tagged' tag may work well for such a logo type.. Think ' [Owned](http://web.archive.org/web/20150130042810/http:/www.typodermic.com/fonts/49.html)', ' [Human Rase](http://web.archive.org/web/20150130042810/http:/www.myfonts.com/fonts/highground/human-rase/)' or ' [Kickshaw](http://web.archive.org/web/20150130042810/http:/www.pizzadude.dk/kickshaw.php)'.. )_\n\nDav, [formlos](http://web.archive.org/web/20150130042810/http:/www.formlos.net/)\n\n"
    },
    {
      "time": "12 Nov 2005 — 2:02pm",
      "content": "Or you could do the unthinkable & go cute. There is something about the unxpected that is so 'in your face'.\n\nOn the other hand custom blackletter is the Mexican halmark - especially now. Have you seen the posts on the topic. I have seen some wonderful icecream carts...\n\nA really swoosty blackletter might be cool. A blackletter with funk. Think Bass and a tiny bit of trebble...\n\n"
    },
    {
      "time": "12 Nov 2005 — 2:33pm",
      "content": "I think the graffiti fonts are probably best but I don't know which would be right for \"Cholo\" (whatever that is).\n\nActually, I do belong to a gang! It is the Zipper Club--a bunch of old geezers who have had heart bypass surgery or CABG to those in the know. :-) To us \"The Hood\" is that piece of cloth they cover the rest of you with while they crack open your chest;-)\n\nChrisL\n\n"
    },
    {
      "time": "12 Nov 2005 — 4:41pm",
      "content": "Thanks all for the suggestions and the laughs! I actually thought about going the \"unthinkable cute\" route, but my client wants to use a pit bull as part of the logo. Apparently, we are all witnesses to the death of cuteness. Sigh...  \nDK~\n\n"
    },
    {
      "time": "12 Nov 2005 — 9:56pm",
      "content": "Well, if you already have the pitbull, then it might be the right time to go cute, pink and stylish... big slap in the face. Is like you put the pitbull in the arms of Cholo's girlfriend, or even worse, in the ones of his mum!.\n\n"
    },
    {
      "time": "13 Nov 2005 — 5:32pm",
      "content": "Sweeeeet! I like it.\n\n"
    },
    {
      "time": "14 Nov 2005 — 4:18am",
      "content": "Although Dolly is a bulldog, it might make a nice face for a pitbull as well. Dolly is an Underware font.\n\n"
    },
    {
      "time": "14 Nov 2005 — 5:01am",
      "content": "What about something closer to pinstriping? A thin brush script? (see letterheadfonts)  \nEDIT: [http://letterheadfonts.com/contributors/chuckdavis/stanfordscript.shtml](http://web.archive.org/web/20150130042810/http:/letterheadfonts.com/contributors/chuckdavis/stanfordscript.shtml \"http://letterheadfonts.com/contributors/chuckdavis/stanfordscript.shtml\")\n\nYou might be able to make P22 Posada/DayoftheDead work?\n\nR\n\n"
    },
    {
      "time": "15 Nov 2005 — 1:26pm",
      "content": "hey DK, post your logo when it's done. we want to see what you decide! :)\n\n"
    }
  ]
}
