{
  "id": "16203",
  "title": "akzidenz grotesk - looking for a match",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hello,\n\ni´m searching for a good font to accompany an akzidenz grotesk logo. i had \"ag book bq\" in mind but would rather use something a bit more different to that... any ideas wellcome! the purpose is to use the font for longer texts as in contracts and agreements so that legibility is quite important...\n\ncurious, lina\n\n",
  "author": "Lina",
  "time": "12 Nov 2005 — 3:29am",
  "uid": "10106",
  "comments": [
    {
      "time": "12 Nov 2005 — 3:58am",
      "content": "I think you can use any serif typeface that's generally considered good for text. Nothing in this vast class of fonts should clash with AG, even in this sticky list. ;)\n\n"
    },
    {
      "time": "12 Nov 2005 — 6:29am",
      "content": "hello thanks for your reply!\n\n\"... any serif typeface that’s generally considered good for text...\"\n\nso what could that be?  \n- minion  \n- thesis  \n- proforma  \n- garamont\n\ni´m a bit reluctant to use serif since it might obstruct my intention to make the whole work look a tad 60´s architectural or so... but i might be on the wrong track anyway... is there something like a typical 60´s constructed serif? mmmh?\n\n, lina\n\n"
    },
    {
      "time": "12 Nov 2005 — 8:44am",
      "content": "In the sixties, they might have used News Gothic (or Trade Gothic) for text. Frequently, the face used for display may not have been readily available, so they would use something relatively similar for smaller sizes. (This suggestion is based on an actual example--the original cover the the book 2001 A Space Odyssey.)\n\nIf you want it to look \"'60s architectural\" I would stick with sans serifs.\n\n"
    },
    {
      "time": "12 Nov 2005 — 9:45am",
      "content": "thats a cool hint, mark, since i´m a great fan of trade gothic and of 2001!!! :)  \nmy concern was that i would not like fonts that are to similar with the aforementioned akzidenz, (that is ag book...) but yeah i might give tg a try!\n\n, lina\n\n"
    },
    {
      "time": "12 Nov 2005 — 1:40pm",
      "content": "They used to mix fonts in ways that would now be considered odd, mostly out of practical necessity. I forgot to mention that the largest type (the title) on that cover was Futura Bold. I think when there is a difference in scale you can get away with type combinations that would not work if they were the same size or close to the same size.\n\n"
    },
    {
      "time": "13 Nov 2005 — 1:52am",
      "content": "I used to work at a university whose style guide sans-serif was AG and whose serif face was Zapf's Melior. So...what do you think of Melior? I'm not sure I apporove of the combination, I just thought I would throw it in.\n\n"
    },
    {
      "time": "15 Nov 2005 — 8:48am",
      "content": "Clarendon would be a default maybe.\n\nBelizio might make a nice pair.  \n [http://www.fontbureau.com/fonts/Belizio](http://web.archive.org/web/20141009102638/http:/www.fontbureau.com/fonts/Belizio \"http://www.fontbureau.com/fonts/Belizio\")\n\n"
    },
    {
      "time": "16 Nov 2005 — 12:42am",
      "content": "yeah thanks! belizio is really nice! good match. i started using \"ff elementa\" but i guess belizio is even better...!\n\ncheers, lina\n\n"
    }
  ]
}
