{
  "id": "16221",
  "title": "Marder Luse Foundry",
  "forum": "Home",
  "tags": [
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20150204224920/http:/typophile.com/wiki/Indices) : [Foundries](http://web.archive.org/web/20150204224920/http:/typophile.com/wiki/Foundries) : Marder Luse Foundry**\n\nIn 1855 the Chicago Type Foundry and Printer's Warehouse was established by C. G. Sheffield as branch of White's New York foundry. This was the first foundry in Chicago and was owned by the Elihu White family who also owned Farmer Little Co. In 1863 and enterprising young man, John Marder, bookkeeper for the company, along with his father in law and David Scofield who was also an employee purchased the foundry. The new company provided type, electrotypes, stereotypes and printer's supplies. After several partners came and went in the firm, Marder teamed with his old friend A. P. Luse and in 1869 it became Marder, Luse & Company with 70 employees.\n\nThe Great Chicago Fire of 1871 destroyed everything but the business ledgers. Marder put his house up for sale and with the proceeds, plus the insurance money, began rebuilding the company. In April of 1872 Marder Luse reopened with the largest force of machinists and matrix fitters in the west. The new home was a five story brick building with a fire proof vault for matrices and punches. Marder had also seized the rebuilding as an opportunity to begin working on a system of uniform type bodies similar to the Didot's in France. In 1879 the firm began selling type and material using the American system of Interchangeable type bodies, or the American Point system.\n\nA. P. Luse died in 1891 and in 1892 the foundry was sold to the [American Type Founders](http://web.archive.org/web/20150204224920/http:/typophile.com/wiki/American%20Type%20Founders) or ATF with Marder becoming the Western general manager for the new combine.\n\n",
  "author": "gthompson",
  "time": "13 Nov 2005 — 2:41pm",
  "uid": "4883",
  "comments": [

  ]
}
