{
  "id": "16259",
  "title": "Type in Space/Architecture",
  "forum": "Design",
  "tags": [

  ],
  "content": "Looking for some suggestions... We're working on an exhibit where the use of type, primarily on a large scale, is used within the space. Architects are already producing final drawings for the buildings we are working with, and we would like to incorporate interesting typographic elements on the buildings and inside the actual exhibit. Could be engravings, projections, wrought iron letters, etc. Just thought I'd mine this resource to see if anyone knew of folks doing interesting work in this area. One possible example we thought of is [Jenny Holzer](http://web.archive.org/web/20111230234528/http:/images.google.com/images?q=jenny+holzer&hl=en&lr=&sa=N&tab=ii&oi=imagest).\n\nThanks!\n\n",
  "author": "<a href=\"/web/20111230234528/http://typophile.com/user/7075\" title=\"View user profile.\">hellojon</a>",
  "time": "<br>",
  "uid": "7075",
  "comments": [
    {
      "time": "",
      "content": "Or maybe there are particular books that I'm not aware of that display typography within these types of environments...\n\n"
    },
    {
      "time": "",
      "content": "See that:\n\n[http://typophile.com/node/16176](http://web.archive.org/web/20111230234528/http:/typophile.com/node/16176 \"http://typophile.com/node/16176\")\n\n"
    },
    {
      "time": "",
      "content": "[Paula Scher](http://web.archive.org/web/20111230234528/http:/www.aiga.org/content.cfm?contentalias=paulascher) of [Pentagram NYC](http://web.archive.org/web/20111230234528/http:/www.pentagram.com/) has done some stunning large-scale environmental typography. Her work might be a good source of inspiration. I remember attending a lecture she gave, where she showed slides of her work for the New Jersey Performing Arts Center and the New 42nd Street Studios. Just the scale of the projects alone was impressive.\n\n"
    },
    {
      "time": "",
      "content": "[http://www.hillmancurtis.com/hc\\_web/film\\_video/source/scher.php](http://web.archive.org/web/20111230234528/http:/www.hillmancurtis.com/hc_web/film_video/source/scher.php \"http://www.hillmancurtis.com/hc\\_web/film\\_video/source/scher.php\")\n\nin this video, paula scher talks a bit about her designs. i dont have time to review it right now, just check it out.\n\n"
    },
    {
      "time": "",
      "content": "[Wales Millennium Centre](http://web.archive.org/web/20111230234528/http:/www.wmc.org.uk/index.cfm?alias=building) has been discussed here but the page is not found when following the google search.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "maybe also check out the work \"Integral Ruedi Baur\" did for \"Cité internationale universitaire de Paris\".\n\n"
    },
    {
      "time": "",
      "content": "<cite>Paula Scher of Pentagram NYC has done some stunning large-scale environmental typography. Her work might be a good source of inspiration. I remember attending a lecture she gave, where she showed slides of her work for the New Jersey Performing Arts Center and the New 42nd Street Studios. Just the scale of the projects alone was impressive.</cite>  \nI second this motion, her presentation at TypeCon was impressive.\n\n"
    },
    {
      "time": "",
      "content": "[http://www.publiclettering.org.uk/](http://web.archive.org/web/20111230234528/http:/www.publiclettering.org.uk/ \"http://www.publiclettering.org.uk/\")\n\n"
    },
    {
      "time": "",
      "content": "the hillman curtis movie is great... thanks. it is amazing how big some of that type is! i just missed her presentation at typecon.\n\nand suggestions for books? concerning environmental graphics/typography?\n\nthanks for the help...\n\n"
    },
    {
      "time": "",
      "content": "Hello,\n\nLast year, I wrote my MA dissertation on environmental typography... I went through some classic books regarding this subject:\n\nAlan Bartram, Lettering in Architecture (1975)  \nNicolete Grey, \"Lettering on Buildings\" (1960)  \nLe Corbusier, \"Le Modulor\" (1954) {note that Le Corbusier in the beginning of the book describes typography as architecture}\n\nsome essays by Umberto Eco (1972): \"A componential analysis of the architectural sign/ column\"; in the book “Signs symbols and Architecture” by Broadbent/ Runt/ Jencks.  \n“Function and sign, the semiotics of architecture”\n\nand a recent one: P.Baines & C. Dixon \"Signs: Lettering in the environment\" (2003)\n\n"
    },
    {
      "time": "",
      "content": "Yasou Spyros!\n\nWelcome to Typophile!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Geia hara Chris and all,\n\nI am visiting typophile for 3 years now, but I just decided it's time to participate. I don´t know much the features of the blog, but I will learn, hopefully,\n\n...see you around...\n\n"
    },
    {
      "time": "",
      "content": "check out the architecture group called \"morphosis\" and  \n\"frank gehry.\" Tehy have used Type in design...\n\nAlso Zaha Hadid often designs building that look like the letter \"z\", as in Zaaahhhhaaaaa!!!!\n\n“Hey, Keep San Antonio Lame!”\n\n"
    },
    {
      "time": "",
      "content": "I also am looking at a simalar topic for my major project. I am looking at when type becomes art and the cross-pollination of other design disciplines with typography. Enviromental graphics is a great area to look at with the ideas of type in spaces , Vince Frost has some really interesting work which has some relation to these topics.\n\n"
    },
    {
      "time": "",
      "content": "I also like the idea of form vrs function, quite the modernist veiw but thinking about the art of the letters in typography and discarding types function for reading,instead looking at type beyond is original intention\n\n"
    },
    {
      "time": "",
      "content": "Nakheel properties in the United Arab Emirates launched a man made island project in the shape of a palm tree. The project expanded to becoming 3 different palm islands...one of which is characterized by the use of Arabic calligraphy to create islands on the water. Fascinating use of typography/calligraphy in architecture.\n\n[http://www.thepalm.ae/developments.aspx?sectionid=4&developmentid=1](http://web.archive.org/web/20111230234528/http:/www.thepalm.ae/developments.aspx?sectionid=4&developmentid=1 \"http://www.thepalm.ae/developments.aspx?sectionid=4&developmentid=1\")\n\nButheina\n\n"
    }
  ]
}
