{
  "id": "16250",
  "title": "Improving on the classics",
  "forum": "Design",
  "tags": [

  ],
  "content": "Came across this in an event guide. The “h” and “g” redesigns are personal favorites.\n\n ![](http://web.archive.org/web/20080409024912im_/http:/www.typophile.com/files/scan.JPG)\n\n [‹ Please, Please help identify font! THANK YOU!](http://web.archive.org/web/20080409024912/http:/www.typophile.com/node/16262 \"Go to previous forum topic\") [Font for guitar letterhead ›](http://web.archive.org/web/20080409024912/http:/www.typophile.com/node/16185 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080409024912/http://www.typophile.com/user/10032\" title=\"View user profile.\">minardi</a>",
  "time": "<br>",
  "uid": "10032",
  "comments": [
    {
      "time": " 14.Nov.2005 7.53pm",
      "content": "The lowercase characters are just Monotype Corsiva (a.k.a. the Zapf Chancery stand-in) rotated backwards a few degrees. It looks like the “ng” was rotated as a unit. The ampersand is Times New Roman. The two S’s appear to be Garamond, stretched a bit horizontally.\n\nThis is not what _I_ would call fine typography. An interesting amateur effort, though. (Sorry for the dismissive tone, but that’s my honest opinion.)\n\n"
    },
    {
      "time": " 14.Nov.2005 8.02pm",
      "content": "Sorry Mark, I forgot to add the “sarcasm emoticon”. Impressive detective skills, though. I only got as far as (slightly squished) Monotype Corsiva.\n\nThis was in a guide for an event I attended with my girlfriend’s family — who thought I was kind of nuts for going off about “crimes against type” for several minutes.\n\n"
    },
    {
      "time": " 14.Nov.2005 8.33pm",
      "content": "Haha I missed the sarcasm too. Understood now though! Squished type is all too common. ::shudder::\n\n"
    },
    {
      "time": " 15.Nov.2005 5.26am",
      "content": "_Sorry Mark, I forgot to add the “sarcasm emoticon”._\n\nThat’s a relief. I thought it was hideous and I was starting to feel sorry for you. You’re new here, so I wasn’t quite sure you weren’t serious. People sometimes do think such things are cool.\n\nIt’s difficult to convey a sense of humor online. In person (or even on the phone), people can (usually) tell you’re kidding. I resort to emoticons more often than I’d like. They are useful in a dumb kind of way.\n\n"
    },
    {
      "time": " 15.Nov.2005 5.56am",
      "content": "“I resort to emoticons more often than I’d like. They are useful in a dumb kind of way.”\n\nI feel the same way Mark, If we didn’t use them people would have a longer double take before getting the joke. The downside is, some people would perhaps be hurt or insulted so I err on the “dumb” (most of the time).\n\nChrisL\n\n"
    },
    {
      "time": " 15.Nov.2005 8.25am",
      "content": "Perhaps we need a new system of “emoticons that don’t suck”. I occasionally think of using existing ones, but then for some reason feel like a 14-year-old... and then there’s the occasional and unwanted addition of jittery graphical icons. (shudder emoticon)\n\n"
    },
    {
      "time": " 15.Nov.2005 9.06am",
      "content": "[:=+I\n\nSome of them make me feel like a blockhead. I hate the automatic GIF variety which interject themselves without being asked.\n\nChrisL\n\n"
    }
  ]
}
