{
  "id": "16252",
  "title": "Sabon Next... Anyone send me a few letters...??",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey...\n\nI need a sample of sabon next Regular...\n\nIf anyone has this font could you send me a file containing a few letters, or an outline of the letters so i can use them for a project i am currently doing...??\n\nIt it so i can compare it to Sabon and Garamond fonts to analyse the few differences...\n\nThe letters i would like are:-\n\nA, E, G, Q, R...\n\nand\n\na, e, g, q, r...\n\nThankyou for your help...\n\nNick\n\n",
  "author": "<a href=\"/web/20100228161420/http://typophile.com/user/9681\" title=\"View user profile.\">Nickmulley</a>",
  "time": "<br>",
  "uid": "9681",
  "comments": [
    {
      "time": "",
      "content": "why not [http://www.myfonts.com/fonts/linotype/sabon/](http://web.archive.org/web/20100228161420/http:/www.myfonts.com/fonts/linotype/sabon/ \"http://www.myfonts.com/fonts/linotype/sabon/\") or [http://www.myfonts.com/fonts/agfa/sabon/](http://web.archive.org/web/20100228161420/http:/www.myfonts.com/fonts/agfa/sabon/ \"http://www.myfonts.com/fonts/agfa/sabon/\")  \n?\n\n"
    },
    {
      "time": "",
      "content": "Which kind of project. Could you elabore a bit more?\n\n"
    },
    {
      "time": "",
      "content": "It is a project on the font sabon... history of jan tschichold, and to explore the font itself in detail, and show how it has evolved in its forms...\n\nI have checked the site above, and the image is too poor for me o create a decent enough outline in illustrator... thanks tho...\n\nSo yeah, need to be large examples of the letters i need... i have all Sabon fonts and Garamond fonts... Just not Sabon Next...\n\nThanks Nick\n\n"
    },
    {
      "time": "",
      "content": "You could contact Linotype and request a printed sample book (they exist, I've got one) and then scan it hi-res.\n\n"
    },
    {
      "time": "",
      "content": "Nick, create an Illustrator file with the text you'd like, post a link, and perhaps some kind soul with the font will put it into the file, and \"create outlines\" for you. That way you will avoid licensing issues.\n\n"
    },
    {
      "time": "",
      "content": "If you only want to analyze the differences in letter forms and such, I will gladly type those letters out in Word, at large sizes, take a screenshot, and send it to you. I have Sabon Next.\n\nWould this be acceptable? If so, how large should the letters be? 48 pt? 72 pt?\n\nHow about in .pdf format? Or does it have to be via Illustrator (which I don't have)?\n\n"
    },
    {
      "time": "",
      "content": "pdf is fine...\n\n72 would be great, bigger would be better...\n\nA, a, E, e, F, f, G, g, Q, q, R, r...\n\nCan i have it in roman font... And ill try and work with that...\n\ncheders nick\n\n"
    },
    {
      "time": "",
      "content": "i'm sure you could preview the font with font explorer x, if you care to download it...\n\n"
    },
    {
      "time": "",
      "content": "isnt that just to preview ur own fonts??\n\n"
    },
    {
      "time": "",
      "content": "<cite>isnt that just to preview ur own fonts?</cite>\n\nNope. Go to the store and you can preview any font purchase with whatever characters that please you in any size. This seems like a good suggestion Paul!\n\n"
    },
    {
      "time": "",
      "content": "Ive tried that, and although i can view all fonts, and print the screen... i can only then live trace the font to get a half decent image...\n\nThe best result for me would be for someone to 'create outlines' in illustrator... i need a very accurate trace you see...\n\nIf this is not possible then not to worry, ill have go some other way around it...\n\nnick\n\n"
    },
    {
      "time": "",
      "content": "You can use FontExplorer X to preview any font in the Linotype Font Store. That includes Sabon, Sabon Next, and six different Garamonds (including ITC Garamond…).\n\nYou can make the sample text any size you like. You can drag and drop the generated images (or left click \"Export Image\") to your desktop: they can be save in any image-based media format (bmp, jpeg, gif, etc.). You can't get at the outlines through the program, though.\n\nThe string will be wider than what appears in your preview window if the type is that big… so no matter what, you should get your whole string that way.\n\n"
    },
    {
      "time": "",
      "content": "You could buy it if you only need one version, 20 bucks and I'm sure you'd be able to use it in the future!\n\n"
    },
    {
      "time": "",
      "content": "linotype doent have explorer x for windows, only mac...\n\nSo i havent got version x...\n\nYeah i know i could buy it, but i have all of sabon, all garamond types, granjon types...\n\nThey are good enough for me... Yet another sabon is just greedy....!!\n\nNick\n\n"
    },
    {
      "time": "",
      "content": "Nick, check your PMs.\n\n"
    },
    {
      "time": "",
      "content": "yeah cool its [nick@nmulley.freeserve.co.uk](mailto:nick@nmulley.freeserve.co.uk)...\n\nthe larger the better\n\nnick\n\n"
    },
    {
      "time": "",
      "content": "I'll send you the pdf, plus image files which I have magnified.\n\nHope that will suffice.\n\nEnjoy.\n\n"
    },
    {
      "time": "",
      "content": "thanks guys\n\n"
    },
    {
      "time": "",
      "content": "FYI: I e-mailed Linotype about FontExplorer for Windows and they said they hope to have it ready by the beginning of next year.\n\n"
    },
    {
      "time": "",
      "content": "At risk of having Hrant nail me to the wall. Or anyone else for that matter. I'd just be curious if this sort of thing violates the EULA. AND How do other type designers feel about this sort of thing?\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100228161420im_/http:/typophile.com/files/by-george-nail.gif)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I didnt think there was anything wrong with it, as i cant us the font as a type... Just an image... like the samples i can get off from linotype themselves, just larger...\n\nTo me it is just a picture image, there would be nothing i counld do with it...\n\nthis is how a lot of people get around this problem, at the end of the day it just the same as me drawing the font to the exact specs, no-one can do anything about it, AFAIK...\n\nNick\n\n"
    },
    {
      "time": "",
      "content": "i was uncomfortable about this too, tiff, so i asked dan what he thought. maybe he'll talk to his peeps at linotype and let us know how they feel about this kind of behavior. personally, if it were a my font, i don't think i'd consider this \"fair use.\" but that's just me...\n\n"
    },
    {
      "time": "",
      "content": "I guess I would equate it to a friend who has bought a stock image and they make a copy for you, BUT instead of high res, it's screen res. no good for print. I'm not too knowledgeable about the whole EULA for fonts, even though I sat in on part of the forum at TypeCon this year.\n\n"
    },
    {
      "time": "",
      "content": "NicK:\n\nDon't worry, there's nothing really wrong with this. The worst you can do is extract the font from the pdf, but then you'd lose all the kerning information. I doubt you have the knowlwdge to do this, or that you'd even bother to try.\n\nI think everyone on these boards is understanding enough to know what you're using the files for.\n\nEnjoy, and I hope your project goes well!\n\n"
    },
    {
      "time": "",
      "content": "I suppose I was curious about this as the rumors of what will be happening at House soon might come along with a EULA stipulating the fact that you won't be able to share. That's all.\n\n"
    },
    {
      "time": "",
      "content": "Share what?\n\n"
    },
    {
      "time": "",
      "content": "The typefaces. According to rumor you will be buying/licensing these new typefaces in a similar fashion to how it was done pre-desktop publishing -- ergo, by the letter/word -- and so I am assuming the license will stipulate that you cannot even share one glyph. I'm excited to see how they do it actually. It will surely shake things up in the display typeface world.\n\n"
    },
    {
      "time": "",
      "content": "i think they're planning on doing this with the plinc library. they'll be using [letterror](http://web.archive.org/web/20100228161420/http:/typophile.com/wiki/letterror)'s [lettersetter](http://web.archive.org/web/20100228161420/http:/typophile.com/wiki/lettersetter) technology (i believe). These will be more than just fonts, they'll be complex lettering most likey composed by layering several fonts. an interesting aside, i just put [http://photolettering.com/](http://web.archive.org/web/20100228161420/http:/photolettering.com/ \"http://photolettering.com/\") into my browser and was surprised there was actually something there... could it be?\n\n"
    },
    {
      "time": "",
      "content": "\"i just put [http://photolettering.com/](http://web.archive.org/web/20100228161420/http:/photolettering.com/ \"http://photolettering.com/\") into my browser and was surprised there was actually something there…\"\n\nThere is about as much there as in my site :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "So, Chris, are you saying it's a site for sore eyes? :-)\n\n"
    },
    {
      "time": "",
      "content": "More like a sight for a seeing eye dog:-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> I’d just be curious if this sort of thing violates the EULA.\n\nI most certainly hope so. (Because it would demonstrate yet again  \nthe unviability -at the individual human level- of the EULA concept).\n\nBTW, I wouldn't use nails... but a chisel. ;-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>unviability ... of the EULA concept\n\nWhat's the alternative?\n\n"
    },
    {
      "time": "",
      "content": "As I've said before, the alternative is to have a parallel document that simply communicates the desires of the font maker to the buyer. It does not make any demands. It does not threaten. It treats the person bothering to read it as what he is: a friend. For example it might say \"please let me know if you'd like modify the font\", or \"if you give the font to a service bureau to print your files, please ask them to delete it afterwards\". I know it sounds strange, but it makes more <cite>human</cite> sense than any form of EULA ever can.\n\nBut you don't just not have a EULA, because you need it to keep nasties (usually large corporations) at bay (even though the bigger lawyer army still wins). However, you also don't try to make it \"kind\" - that's hopeless. Conclusion? You make a second document, and one that simply <cite>communicates</cite>.\n\nI just need to find a name for the thing... :-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Have you developed such a beast for your own font sales? Or do you have a prototype that you could share?\n\nTest Pilot Collective's EULA (at least, one I came across a couple years ago), although I don't think it made Tiffany's list, had some of what you like in it, in particular the polite, user-friendly langauge.\n\n"
    },
    {
      "time": "",
      "content": "\\> Have you developed such a beast for your own font sales?\n\nBeast? Compared to a EULA?!\n\nAnyway, I really firmed up the idea a month or two ago, so I have yet to make a tangible instance of it. On the other hand, since day one (some time in the early 80s) I've communicated persistently and openly with my customers so they know what I prefer. In fact I did exactly that about an hour ago.\n\n\\> had some of what you like in it\n\nAnd it's great to see such pragmatism and kindness.  \nBut it can't work in the context of what a EULA must be.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\"I just need to find a name for the thing… :-)\"\n\nEulajazz--Music to your ears, the plain talk for real people (Lawyers excluded).\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\>\\> [http://photolettering.com/](http://web.archive.org/web/20100228161420/http:/photolettering.com/ \"http://photolettering.com/\")\n\nPaul,\n\nI think you're right about that, I saw House Industries at the presentation/talk they gave at the Apple store in LA today (it was really interesting, they also previewed some of their new fonts). They showed a mock-up of the Photo Lettering store where you'll be able to set words in some of the old film fonts and buy it.\n\n"
    }
  ]
}
