{
  "id": "16265",
  "title": "The Art of The Correct Body Copy Typeface Choice",
  "forum": "Design",
  "tags": [

  ],
  "content": "I understand that this is an art in itself, but as a budding/young designer in love with type I would like to understand this rather important subject. I comprehend styles of type and what serif/sans/script evoke but how does one go about choosing a type face for body copy? My curiosity makes me want to try new faces but I'm not sure where to go. I have access to a studio font library at school of about 1000 faces so I will be able to experiment without having to buy them just for this purpose.\n\nWhat I'm looking for is your opinions/experience in this subject matter. Maybe this is too broad of a question, but I think it's worth a shot asking anyways! I'm just looking to expand my knowledge and this is the best place I could think of to ask this.\n\n-Dave\n\n",
  "author": "<a href=\"/web/20100228003545/http://www.typophile.com/user/8451\" title=\"View user profile.\">dave bailey</a>",
  "time": "<br>",
  "uid": "8451",
  "comments": [
    {
      "time": "",
      "content": "I found this interesting.\n\n[http://www.bamagazine.com/ne7raPLand.asp](http://web.archive.org/web/20100228003545/http:/www.bamagazine.com/ne7raPLand.asp \"http://www.bamagazine.com/ne7raPLand.asp\")\n\n"
    },
    {
      "time": "",
      "content": "The answer is right here: I will be able to experiment...\n\n"
    },
    {
      "time": "",
      "content": "Awesome, this and any kind of personal opinion is exactly what I was looking for. I'm gonna read this now!\n\nEdit: I figured that experiementation would play a role, David. This is an acceptable solution for me, but I'm just wondering what kind of habits or process of elimination might be necessary. Surely one can't just click through all their text faces for each project saying 'hmm is this right?' there's got to be a more intelligent way of choosing! Maybe I need to research typefaces more?\n\n"
    },
    {
      "time": "",
      "content": "Try and match the text to the type. I was looking at a book my wife worked on, designed by a well known book designer. The text was about Anselm Kiefer. The art deals with several mystical systems including the Sefer Hechaloth, alchemy, etc. Keifer uses lead in his works, and references alchemy often. The designer chose Fournier, a digital face based on the types of Pierre Simon Fournier. Fournier, as it turns out, was also an alchemist.\n\nThe best approach is to read the text, and find good type that has some synergy with the text. I often find by approaching a book design this way, I become convinced that there is only one face to set the text in. With this decision made, the page and text block geometry will flow based on the needs of the type.\n\n"
    },
    {
      "time": "",
      "content": "_but how does one go about choosing a type face for body copy?_\n\nyou really should get a copy of [The Elements of Typographic Style](http://web.archive.org/web/20100228003545/http:/www.typophile.com/wiki/Elements%2520of%2520Typographic%2520Style) by [Bringhurst](http://web.archive.org/web/20100228003545/http:/www.typophile.com/wiki/Robert%2520Bringhurst). It really is the typographer's bible (IMHO). I think I need to re-read it one of these days soon...\n\n"
    },
    {
      "time": "",
      "content": "See that:\n\n[http://www.will-harris.com/esperfonto/](http://web.archive.org/web/20100228003545/http:/www.will-harris.com/esperfonto/ \"http://www.will-harris.com/esperfonto/\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks Paul, I'll add this to my xmas wish list along with the Logo Font & Lettering Bible and the 2nd edition of John Langdon's Wordplay. I don't have any material wants this year, but a jump start to my design library would be a good idea!\n\nEdit: Good link, David. Thanks!\n\n"
    },
    {
      "time": "",
      "content": "My solution to not knowing how to choose: typeset everything: directions, lists, letters, notes, signs, stories, cards, etc. Use faces you know of, but aren't familiar with, particularly the text faces. Use all of the type you have as much as you can.\n\nSeeing fonts in use, particularly when there's no pressure will help you familiarize yourself with the quirks and kinks of fonts which may all 'look the same' in the font specimen books or FontExplorer. It's helped me get a general sense of what to expect from different historical classes and cuts without the stress of messing up a client job.\n\n"
    },
    {
      "time": "",
      "content": "I agree with Chris, observing those who have gone before -- those whom we know to know what they are doing -- is a great way to learn.\n\n"
    },
    {
      "time": "",
      "content": "That Before and After thing has come up before on Typophile, and was roundly and justifiably hacked to shreds.\n\n\\*\\*\\*\n\nBringhurst's first point: \"Typography exisits to honor content\".  \nReading the text, parallels will emerge between what the writer is saying, and similar thoughts that have been expressed by typographers and type designers in their medium.  \nIn advertising, there is often strategy provided for the art director concerning tone and manner, which will suggest particular typographic treatments.  \nAnd of course, you can always swipe what's hot (and put a personal spin on it).\n\n"
    },
    {
      "time": "",
      "content": "From a strictly personal view, and it's nothing I've ever taught about, I am a strong proponent/believer in \"looking, seeing and experimenting.\"\n\nIt's one thing to start as a novice designer and trying to arrive at a balance of conventional text with heads. To some degree there is a lot of latitude before you start going over the deep end. Following sound advice will keep you and your work safe, since after all, most of us needed to earn a living right off the bat.\n\nWhile you are still in school or starting out at your first design job, never lose an opportunity to look closely at anything that catches your eye. Stop and examine what might be unique, different, engaging or even plain stupid about the piece. It may seem like nothing at first, but after a while your eye will start discerning things at play that seemed invisible before.\n\nLook at old stuff, new stuff, books printed with metal type, books and magazines printed during the 60s to mid 80s which most likely would have been set on phototypesetting equipment.\n\nStart carrying around a lupe (or small magnifier) and don't be afraid to put your nose literally on the page. Hold stuff at arms length upside down and squint to break text down into blocks of gray. Eventually you'll start \"seeing\" type at many levels; as texture, its color, fluidness and rhythm or a staccato and fragmented look.\n\nCombinations of characters in a word or line might seem too heavy or too light or the overall block of text though evenly spaced may seem too weak or too strong in juxtaposition to the rest of the design. By training your eye and improving your typographic awareness, you can begin to make type determinations for yourself. You will \"feel it\" if the page looks off or if the tone of the type contradicts the tone of the content.\n\nOnce you can make these determinations for yourself, you can (if you want) truly start experimenting, because now if something doesn't work, you have a better sense of what to do. It's like being a composer or a chef, because great typography is more soul than science.\n\n"
    },
    {
      "time": "",
      "content": "Awesome and very sensible reply Norbert! Thanks!\n\n"
    },
    {
      "time": "",
      "content": "i guess each of us have our own ideas of how it works. i tought of sharing a little too. :D im no veteran designer but for me its a combination of maths, intuition, rationality & not forgetting lots of fun. There are a set of rules that i follow strictly at times (eg, grid) but at the same times, when a certain assingment that requires a \"customised procedure\", i wouldn't hesitate to use quirky fonts for a cooporate typeface. so i guess thats pretty much pending on yourself and of course the assingment itself. thats just my opinion. :)\n\n"
    },
    {
      "time": "",
      "content": "I look a lot at type specimen sheets. If they're not available take a few typefaces and set some body copy and print it out, different point sizes, line lengths, leading, etc. Often a typeface looks good in a certain situation, buy may not work for your particular project. Also, one thing I'm bad about, is relying on my screen. Bad idea. You really do need to have a high-res laser printer to get an accurate idea of how the type will look on a finished piece. Also, get familiar with a handful of typefaces for body copy, and stick with them for a while. You can always be more creative with your headings, subheads and other graphics, but body copy is for reading. There's nothing worse than a bad font for body copy (well maybe some things are worse...)\n\n"
    },
    {
      "time": "",
      "content": "I find that my love for type translates into me finding myself reading about type more often. Not just skimming forums or looking at annuals, but reading about the history of type, the lives of type designers...the \"zeitgeist\" i suppose.  \nIt takes months, years, but eventually you'll find that the choice of typefaces will stem as much from intuition as from careful research. I'm not trying to make a blanket statement here; this says nothing about printing/media/cost restrictions, etc.  \nIn a way its about personal taste, too. If you like Goudy or Gill, and its appropriate...why not?\n\n"
    },
    {
      "time": "",
      "content": "I'm with Paul, anyone relatively new to typography and eager to learn needs to have a copy of Bringhurst's _Elements..._ I often say about that book that I wish I'd never read it, so that I could read it again for the first time. It single-handedly exploded my interest in typography. And once you're done with that book, simply hit the bibliography at the back as a guide to other books to take a look at.\n\nThe thing with Brighurst is that he does a very good job of outlining what to look for in a font; not just if you \"like\" it, but what a good font needs to have in its arsenal.\n\nI have a small handful of fonts that I rely on for body copy, and each was selected first and foremost on what it has in its toolbox. To me it starts with OpenType. If I'm going to invest in a body font, I want something with an extensive glyph palette, well drawn diacritics, full Greek and Cyrillic support, small caps, all 4 number sets, a healthy selection of ligatures, all the basic math symbols, true fractions, superiors, inferiors, maybe some useful ornaments, etc. To investigate this stuff, you'll need to dig up full type specimens of the font (usually a PDF that has the entire glyph palette as well as some sample settings at various sizes, etc.). My point is it doesn't do you any good to choose a font you \"like\" only to discover it's missing a pile of glyphs you need. Better to compile a list of fonts that have what you need, then use that list to determine which will best serve the book you're setting.\n\nPerhaps the hardest part about choosing a body font is getting out of the way. Not \"What font should I set the book in?\", but \"What font does the book want to be set in?\" And to answer that question you need to know something about the history of type and typography (Bringhurst) and something about the book you're setting (read it).\n\n"
    },
    {
      "time": "",
      "content": "_I’ll add this to my xmas wish list along with..._\n\ni'd recommend putting the whole [triumvirate](http://web.archive.org/web/20100228003545/http:/www.typophile.com/wiki/triumvirate) on that list. ;^D\n\n"
    },
    {
      "time": "",
      "content": "Two interesting articles for download -- after purchase -- on Amazon:\n\nThe rhetoric of typography: The persona of typeface and text. (Applied Research). : An article from: Technical Communication -- Eva R. Brumberger\n\nThe rhetoric of typography: The awareness and impact of typeface appropriateness. (Applied Research). : An article from: Technical Communication -- Eva R. Brumberger  \nFormat: HTML\n\n"
    },
    {
      "time": "",
      "content": "Two tangential comments: (a) I'd agree with Jason on OpenType: if the possibility is there for a nice extensive character set, that's what you want your font to have in this day and age. So annoying to suddenly find you've got to swap out to some other font just to set a section mark or a barred-l. (btw, am involved in a difference of opinion with out typesetters over their inability to set a £ in Bliss because \"the pound symbol was not available in the bliss font\"... eh? what kind of version are they using?!?)  \n(b) Someone mentioned the 2nd edn. of John Langdon's \"Wordplay\". I recently bought a copy of this: is it just me, or are half the pictures poorly reproduced (like the bitmap header of an EPS or something?) And random bold characters littered through the text? The author must be livid.\n\n-----------------  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "",
      "content": "I'll be sure to upate my collection wishlist. This has been very informative and it looks as if I'll have some good reading ahead of me. Maybe I should read up on Open Type too, as I sort of have an idea of what it is but no solid knowledge.\n\nDTW: I mentioned this, just because he's my professor and I work closely with him on many of his commissioned ambigrams. I hope the print quality is not as shoddy as you seem to be saying. :(\n\n"
    },
    {
      "time": "",
      "content": "\"Two interesting articles for download\"\n\nTiff,  \nThanks for the tip. I just bought them from Amazon.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "For those who have not yet experienced the amazing beauty of a simple block of justified text -- (even as a low-res pixelated mediocre scanned image).\n\n ![](http://web.archive.org/web/20100228003545im_/http:/typophile.com/files/Rogers_Odyssey.gif)\n\n_The Odyssey of Homer_, 1932.  \nBruce Rogers (1870-1957), book designer.\n\n"
    },
    {
      "time": "",
      "content": "<cite>\"you really should get a copy of The Elements of Typographic Style by Bringhurst. It really is the typographer’s bible (IMHO). I think I need to re-read it one of these days soon…\"</cite>\n\nPaul d hunt\n\nIt is as well in Hermann Zapf's opinion so I can't either disagree ;)\n\n<cite>\"I whish to see this book become th Typographers' Byble.\"<br>\nHermann Zapf</cite>\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "Ok, I have not really read well the posts in this thread but anyway this link may help you:\n\n[http://www.textism.com/textfaces/](http://web.archive.org/web/20100228003545/http:/www.textism.com/textfaces/ \"http://www.textism.com/textfaces/\")\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "Norbert,  \nThat is fabulous composition! The evenness of color is amazing and only ONE hyphen!  \nThat really was an odyssey!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Hector: Another interesting read! Thanks!\n\n<cite>Norbert,<br>\nThat is fabulous composition! The evenness of color is amazing and only ONE hyphen!<br>\nThat really was an odyssey!<br>\nChrisL</cite>\n\nAgreed!\n\n"
    },
    {
      "time": "",
      "content": "I have never seen before a book made by Bruce Rogers and now I see why is his work so praised.\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "Not bad, Bruce, but there are a few things we'd do differently today:\n\n1. No double spacing before capitals  \n2. Kern Y-e  \n3. No space before colon and semi-colon  \n4. Final period could hang a bit -- to balance the hanging serif on the initial.\n\nLetterpress Centaur was a good choice for a fine edition of a classic (particularly if you had designed it yourself), with big text size, a wide measure, and plenty of leading -- it makes it look like the typeface has expansive extenders, rather than a tiny x-height.\n\n"
    },
    {
      "time": "",
      "content": "Nick, I agree with you about the limitations on Centaur--it needs large size and letter press to look great. But I wonder about the extra space before sentences (not capitals generally). Might this not add some pleasant openness to the page, and serve as a better marker for sentences?\n\nAnd am I right in thinking that it is still standard in French typography to have extra space before sentences and before colons and semicolons? Or is this just in the French Microsoft Word?\n\n"
    },
    {
      "time": "",
      "content": "William, I agree about the extra space.  \nThere was a thread on this, which advanced several theories as to why extra sentence space might be useful. But I don't think it was mentioned that it might have anything to do with the size of the capitals, which seems to be pertinent here.\n\nEven in English, some typographers hair-space their colons (part of Jason's standards, I seem to recall). And it's also something that type designers can build into a font, by giving colons a generous left sidebearing.\n\nI'm not surprised the annoyingly prescriptive Word adds colon space in French.\n\n"
    },
    {
      "time": "",
      "content": "<cite>1. No double spacing before capitals<br>\n2. Kern Y-e<br>\n3. No space before colon and semi-colon<br>\n4. Final period could hang a bit — to balance the hanging serif on the initial.</cite>\n\nI was taught all of these methods in my recent Typography classes. So I'd have to agree.\n\n"
    },
    {
      "time": "",
      "content": "\"For those who have not yet experienced the amazing beauty of... \"\n\n....65 characters across, Exactly!\n\n"
    },
    {
      "time": "",
      "content": "Well, a full word space before colon/semicolon might  \nbe French habit. But a little space before them (and  \nbefore exclamation & question as well as some other  \npunctuation marks) was common in Germany, GB, USA  \n(I have no actual proofs for other countries) too!\n\nIf this was forgotten because it troubled the average  \ntypewriter and text editor, typographers should  \nknow better.\n\nI have some samples, some of them not that old, in  \n [www.kltf.de/downloads/SpacingIssues-kltf.pdf](http://web.archive.org/web/20100228003545/http:/www.kltf.de/downloads/SpacingIssues-kltf.pdf \"www.kltf.de/downloads/SpacingIssues-kltf.pdf\")\n\nMy assumption is that while especially in GB and  \nUSA (and Germany) the spaces were abandoned  \nentirely, in France they were exaggerated -- which  \nwere the two possibilities which technology allowed.  \nIt may be an interesting subject for a more careful  \nstudy.\n\nKarsten\n\n"
    },
    {
      "time": "",
      "content": "I'd also be interested to know more about the history of the spacing of punctuation, if anyone out there can enlighten me.\n\nLooking at the samples in Harry Carter's 'A View of Early Typography', I see early examples with spaces before the period and comma also. The commas, colons and semicolens seem equally spaced on either side. Some also have the periods equally spaced, and others with greater than a word space before sentences.\n\nI have the book that revived Caslon, Mrs. Willoughby's Diary, and it affects earlies styles. It has hair or thin spaces before the colon and semicolon, but not the comma and period. It has greater than a word space before sentences.\n\nFor me the question of whether to have a hair space before the colon and semicolon is just a matter of convention--I don't see a big advantage in it.\n\nBut I find the extra space before sentences (but not a double space, as in typewriter styles) kind of nice as a marker for the sentences and putting a little air in the text block. Am I nuts to think of making the period with extra space to the right, so that sentences will have more space after them? Then for initials like K.D. Lang I could maybe have some contextual substitution of a cap followed by a period that would have less space.\n\nDoes this make any sense to you all? Or just a bad idea?\n\nedit: Just thought of another way to do this. A period followed by two spaces would be contextually substituted by a period followed by a word space plus a hair space, or such. Will this work? It would give people an option of the greater inter-sentence space, without imposing it.\n\n"
    },
    {
      "time": "",
      "content": "\\>&nbsp;_I’d also be interested to know more about the history of the spacing of punctuation_\n\nI don't know much about this, but I believe that (in Britain) the post-war move towards using less space around punctuation marks was strongly influenced by Jan Tchischold during his reign at Penguin. He imposed company-wide printing standards that mandated what is nowadays the usual punctuation spacing, supplanting the printers' house styles (which typically added space around colons, and extra space between sentences).\n\nI think I learnt this from Ruari McLean's book _Jan Tschichold: A Life in Typography_.  \n( [This book](http://web.archive.org/web/20100228003545/http:/www.penguincollectorssociety.org/pubs.htm#typo) also looks potentially relevant, but I haven't read it.)\n\n"
    },
    {
      "time": "",
      "content": "I have the Tschichold biography, and just checked the 'Penguin Composition Rules', p. 80.\n\nIn fact he says in them: \"If this can be done on the keyboard, put thin spaces before question marks, exclamation marks, colons, and semicolons.\"\n\nSo the change must come after his reign at Penguin.\n\n"
    },
    {
      "time": "",
      "content": "\"So the change must come after his reign at Penguin.\" or after Batman :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\"I have the Tschichold biography, and just checked the ‘Penguin Composition Rules’, p. 80.\"\n\nYes. What Tschichold was against was too much space following a full stop. ;-)\n\n\"... I see early examples with spaces before the period and comma also. The commas, colons and semicolens seem equally spaced on either side. Some also have the periods equally spaced, and others with greater than a word space before sentences.\"\n\nI have the Fedra booklet before me right now and see that Peter Bilak's typefaces do exactly this -- i.e. space , ; . : generously. And it looks pretty good, especially in the serif. The spaced period and comma are less obtrusive than I would have imagined.\n\n\"Just thought of another way to do this. A period followed by two spaces would be contextually substituted by a period followed by a word space plus a hair space, or such.\"\n\n(You could create an alternate space and substitute by this if space is preceded by a period. As feature, either calt, or if this is reserved for other things, one of the a Stylistic Set features.)\n\nIn the long run however, these spacing issues should be dealt with on application level, not font level. Spacing is part of the typographer's job, and only on the level of the application he could easily create some settings which will apply to every font in use.\n\n"
    },
    {
      "time": "",
      "content": "\\>You could create an alternate space and substitute by this if space is preceded by a period.\n\nThe problem with this approach is that it will space abbreviations and initials with extra space in the middle of a sentence: \"J. Carter Brown and Time Inc. have sued the newspaper.\" So there needs to be a way to insert the extra space in a discressionary way. Checking, I see there are keyboard shortcuts in InDesign--and I assume Quark--for this,so it seems that there is no point in putting this into a font.\n\n"
    },
    {
      "time": "",
      "content": "\\>&nbsp;_In fact he says in them: “If this can be done on the keyboard, put thin spaces before question marks, exclamation marks, colons, and semicolons.”_\n\nThanks for the correction.\n\nBut surely it is still plausible to see _Penguin Composition Rules_ as an important step – even the most important step – on the road to the spacing we see today?  \nI can only find one pre-Tschichold penguin in my bookcase: the 1940 printing of _Romeo and Juliet_. In that, there's a full word space before every colon and question mark, and an entire _em_ after a question mark. Using a thin space before and a word space after is very restrained indeed, by comparison.\n\n(The way you tell TeX not to put extra space after a full stop is to issue the command `\\frenchspacing`. That seems especially bizarre in light of the suggestion that the extra space is _more_ prevalent in France.)\n\n"
    },
    {
      "time": "",
      "content": "{Caveat: I've read almost none of this thread. Sorry.}\n\nDavid, what I would point out is this: ideally, you first need to understand how people read; not perfectly, but understand it as much as you can. This will help you grasp for example what vertical proportions are better for what tasks. That said, it's entirely possible to fake it without grasping much about readability at all, thanks to the great (if necessarily regressive) precendent that's been established. In fact most people take the faking route. :-/\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_(b) Someone mentioned the 2nd edn. of John Langdon’s “Wordplay”. I recently bought a copy of this: is it just me, or are half the pictures poorly reproduced (like the bitmap header of an EPS or something?) And random bold characters littered through the text? The author must be livid._\n\nI saw a copy of this at the weekend and it is shocking that the proofs were signed off, it certainly looks like screen representations were used for some of the pictures. Heads should roll or at least be rotated 180º.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "<cite>I saw a copy of this at the weekend and it is shocking that the proofs were signed off, it certainly looks like screen representations were used for some of the pictures. Heads should roll or at least be rotated 180º.<br>\nTim</cite>\n\nI'm guessing that this is only the book released in England. Both complaints I've heard have been located there, I know John published two versions...it's very likely that he didn't have direct contact or printed samples of the book that was printed over seas. I'll have to report back in once I see the US version.\n\n"
    }
  ]
}
