{
  "id": "16287",
  "title": "Hoefler Text Ornament",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I am currently working on designing a book of poetry and photographs. The author and I have been discussing using a small illustration or ornament to mark the end of each poem and we would like it to reflect the central theme of the work: time. The text will be set in Hoefler Text, so I'd like the illustration to work well in conjunction with this typeface. I've attached two PDF's (page view and detail) of my idea and would appreciate your comments/suggestions. I'm not a type designer, so I feel like I'm a bit over my head on this one...\n\nIn addition to any comments on this particular ornament I'm designing, I would love to hear more about how (or even why!) type designers go about designing ornaments for their typefaces? I've had a look at some of the Hoefler Text ornaments, but I don't really understand their unifying characteristics. Is there anything in particular that I should be looking out for?\n\nCheers,  \nScott\n\n| Attachment | Size |\n| --- | --- |\n| [hoefler\\_text\\_ornament\\_page.pdf](http://web.archive.org/web/20130823175049/http:/typophile.com/files/hoefler_text_ornament_page.pdf) | 182.18 KB |\n| [hoefler\\_text\\_ornament\\_detail.pdf](http://web.archive.org/web/20130823175049/http:/typophile.com/files/hoefler_text_ornament_detail.pdf) | 33.64 KB |\n\n",
  "author": "scottish",
  "time": "16 Nov 2005 — 5:06pm",
  "uid": "4385",
  "comments": [
    {
      "time": "18 Nov 2005 — 6:52am",
      "content": "The ornament seems ambiguous to me, it could be half an orange, a moon, etc. The weight of the strokes could also be a problem, they seem too varied to work with the text at twelve point, I also think that the execution of the clock face needs to be refined.  \nI think you should investigate other methods to represent time, maybe with a less three dimensional appearance, hourglasses (there is one in Hoefler Ornaments) and sundials come to mind or a more conventional representation of a clock face. Hoefler Ornaments contain traditional items and styles, hedera – the ivy and plant-based ones, the printer's fist – pointing hand, sun and moon and fleur de lys.  \nTim\n\n"
    },
    {
      "time": "28 Nov 2005 — 1:17pm",
      "content": "Thanks for your comments Tim. The ambiguity in the ornament was intentional; we were trying to suggest a few different ideas of time, so I don't mind if the ornament takes on a few different meanings, as long as they are related to the overall theme. I would really appreciate it if you could elaborate on why the variation in the strokes doesn't work with the type. The existing Hoefler text ornaments seem to vary quite a bit when it comes to stroke width, overall colour, etc. That's what I find confusing about the design of ornaments. How closely should they reflect the characteristics of the typeface?\n\nCheers,  \nScott\n\n"
    },
    {
      "time": "28 Nov 2005 — 1:47pm",
      "content": "An example of Hoefler Text ornaments...\n\n ![](http://web.archive.org/web/20130823175049im_/http:/typophile.com/files/hoefler_orn.jpg)\n\n"
    },
    {
      "time": "3 Dec 2005 — 2:56am",
      "content": "Scott,  \nI was trying to say that the variation of the strokes in the ornament might not represent too well at twelve points high, some being so fine they will be difficult to print/see at a small size, some of the clock face details will also be difficult to print. So it was a more technical criticism in that respect.  \nLooking at the Hoefler Text Ornaments, I would suggest that you wouldn't use the more detailed ornaments (sun, moon, ship etc.) or the incised uppercase hedera at the same point size as the lowercase flourishes and hedera. Whereas the incised flourishes could be used at the same point size as the lowercase flourishes. Of course, the option for using that many ornaments will not come along often.  \nAs to how closely they should reflect characteristics of the text, I think that is a question that you can only answer by trying different sorts, sizes, position and proximity of ornament in conjunction with a piece of text, experiment, bearing in mind the effects of printing will have on text and ornament. However, I wish in the case of Hoefler's ornaments, that those flourishes weren't simply reflected, but that the emphasis of thick and thins were kept in the style of the text face.  \nGetting back to your design, bearing in mind that the present lack of images means I am relying on my memory, my first reaction was that it was an orange, which I take it wasn't the intention, it seems to me that a clearer representation of time would achieve your ends better than any ambiguity.  \nTim\n\n"
    },
    {
      "time": "10 Dec 2008 — 6:22pm",
      "content": "I got here looking for 'ornaments in texts' via Google and I would like to receive your opinion about marking the end of a little paragraph on a poster for a psychoanalytic conference.\n\nI like one of the 'Hoefler's ornaments' you listed above but I do not know if to omit the period before the ornament, or if to leave the period and place the ornament in the next line (as Scottish above).\n\nThank you for your help.\n\n-Ponchosquealº\n\n ![](http://web.archive.org/web/20130823175049im_/http:/typophile.com/files/Aldo-Hipo_5813.jpg)\n\n ![](http://web.archive.org/web/20130823175049im_/http:/typophile.com/files/poster-detail_5469.jpg)\n\n"
    },
    {
      "time": "11 Dec 2008 — 9:26am",
      "content": "Poncho, it's not a good idea to hijack a thread. However, in response to your question, I don't think the ornament in your poster adds anything at all. I would simply omit it.\n\n"
    },
    {
      "time": "11 Dec 2008 — 3:33pm",
      "content": "That ornament looks like a mistake. And why would you use a pointed-pen ornament inline with a typeface that mimics letters inscribed in stone?\n\n"
    },
    {
      "time": "11 Dec 2008 — 9:13pm",
      "content": "I'm sorry. I didn't feel like 'hijacking' the thread. Anyway thank you for your help Speter.  \nThank you for taking the time to response James.\n\nMy apologies to the offended.\n\n"
    }
  ]
}
