{
  "id": "16293",
  "title": "Franko Luin (1941–2005)",
  "forum": "Home",
  "tags": [

  ],
  "content": "It is with great sadness that Linotype announces the death of Swedish type designer Franko Luin. For the last decade, Franko Luin’s Omnibus Library has served as a solid pillar of Linotype’s font collection.\n\nBorn to Slovenian parents in Trieste, Italy, in 1941, Frank Luin immigrated to Sweden in 1961. He died in Tyresö on September 15, 2005, at the age of 64.\n\nAfter studying at the Grafiska Institutet during the 1960s, Franko Luin spent two decades honing his skills as a print designer for Ericsson before branching out on his own. He spent much of the 1990s perusing two passions: multimedia and typeface design. In 1996, he founded his own typographic studio, Omnibus Typografi. That same year, Linotype began distributing his fonts, which rank among the 20th Century’s most remarkable digital revivals of classic typefaces like Caslon, Baskerville, and Bodoni. Although he played a withdrawn role in the international community of type designers, his work is sure to remain an inspiration for decades. In addition to this visual legacy, Franko Luin was proactive as an influence on future generations of designers, for instance he engagingly led a course in Web Typography at the Berghs School of Communication in Stockholm.\n\nA third passion of Franko Luin’s was Esperanto, which he began learning at age 15. His involvement in Esperanto organizations even acted as an inspiration for his design work—he named a type family after the language in 1993.\n\nMore information about Franko Luin and his typefaces is available at  \n [www.linotype.com/7-1527-7/frankoluin.html](http://web.archive.org/web/20070105104135/http:/www.linotype.com/7-1527-7/frankoluin.html) and at [www.omnibus.se](http://web.archive.org/web/20070105104135/http:/www.omnibus.se/).\n\n",
  "author": "<a href=\"user/1085\" title=\"View user profile.\">dan_reynolds</a>",
  "time": "",
  "uid": null,
  "comments": [

  ]
}
