{
  "id": "16302",
  "title": "express delivery company logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,  \nAlthought I am reading your posts for a year, this is my first post.  \nI'm working on a logo for a delivery express company named Kangaroo.The company has several activities: expressdelivery, expressdistribution, directmail, floralexpress.  \nI was asked for a redesign of their logo. What do u think? The type is a modified version of erasltc. Here are the 2 proposals and the old logo too. I prefer kangaroo.gif.  \nThank you very much.\n\n| Attachment | Size |\n| --- | --- |\n| [kangaroo2.gif](http://web.archive.org/web/20150418210659/http:/typophile.com/files/kangaroo2.gif) | 14.93 KB |\n| [old-logo.gif](http://web.archive.org/web/20150418210659/http:/typophile.com/files/old-logo.gif) | 22.78 KB |\n\n",
  "author": "alexbucur",
  "time": "17 Nov 2005 — 6:42am",
  "uid": "5143",
  "comments": [
    {
      "time": "17 Nov 2005 — 6:43am",
      "content": " ![](http://web.archive.org/web/20150418210659im_/http:/typophile.com/files/kangaroo.gif)\n\n"
    },
    {
      "time": "17 Nov 2005 — 7:48am",
      "content": "I love where you're going with the most recent upload, but I am bothered by the line weight of the kangaroos silhouette. It feels too thick around the ears/head. I would definately stay on this track, but finesse the kangaroo a bit more.\n\nThe typography is very nice, but I would definately keep \"express\" at the bottom. And again, I see what you are working at with the dual \"oo\"s at the end, but they need a little more work.\n\nBut its definately in the right direction, no doubt. Keep at it!!!\n\n"
    },
    {
      "time": "17 Nov 2005 — 8:55am",
      "content": "I like the 1st of the two better. I wonder if you aught to take the bottom text 'express' & reverse it out in white inside a swash like the kangaroo is made from. The letters for express will need to be much bolder. The Kangaroo could be bolder too. The legibility of the letters in kangaroo is getting a bit compromised. I would shore that up.\n\n"
    },
    {
      "time": "17 Nov 2005 — 2:42pm",
      "content": "My take on the look is you really need to discuss this with the ad agency and the marketing department. Its a cute look but the marketing of this business probably needs a bigger picture view. Think of Geico, they created a cute Geko to act as the image of the company. This is a situation where they can either be major players or the little guy.\n\n"
    },
    {
      "time": "18 Nov 2005 — 12:41am",
      "content": "Thank u for your comments, jlusby u're right, I should work more on the kangaroo and the double \"o\". I will try also to see how it looks the other version but the client likes more the grey one.  \nDan, can u be more specific on geico, i didn't understand u very well.  \nThank You.\n\n"
    },
    {
      "time": "18 Nov 2005 — 3:51am",
      "content": "Of course I find new logo idea well. The old was well working too. Often you you must not to redesign logo global but rather improve. Example of such redesign is german railway by Kurt Weidemann. Comparison of old kangaroo logo could be also [http://www.lupach.de](http://web.archive.org/web/20150418210659/http:/www.lupach.de/ \"http://www.lupach.de\") I have created for my customer. It`s not stylish, but well understandable by target groups. So I would improve impact of experess and comprehensibility in new version.\n\n"
    },
    {
      "time": "18 Nov 2005 — 4:19am",
      "content": "Geico is an auto insurance company and their idenity is a geko. You might do a google search for their site.\n\n"
    },
    {
      "time": "6 Jan 2013 — 10:10am",
      "content": "john \\*\\*\\*\\*\n\n"
    }
  ]
}
