{
  "id": "16304",
  "title": "Caslon tabular Old style numerals",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’ve been using Adobe Caslon Pro and noticed that the old style figures have these almost perfectly round 0’s. Is this specific to Caslon? What’s the history behind this glyph? I rather like it.\n\nI should note that I am but a humble undergrand student…so if this is obvious…be gentle.\n\n| Attachment | Size |\n| --- | --- |\n| [tabular.gif](http://web.archive.org/system/files?file=tabular.gif) | 814 bytes |\n\n",
  "author": "csr",
  "time": "17 November, 2005 - 8:54am",
  "uid": "3630",
  "comments": [
    {
      "time": " 17 November, 2005 - 9:14am",
      "content": "this is a fairly typical form of the oldstyle zero. it is often seen as a unmodulated circular shape to distinguish it from the lowercase letter o.\n\n"
    },
    {
      "time": " 17 November, 2005 - 9:24am",
      "content": "thanks paul.  \nincidentally, are there any non-old style faces that use this same technique to differentiate between zero and lowercaseo o?\n\n"
    },
    {
      "time": " 17 November, 2005 - 9:24am",
      "content": "According to Walter Tracy, ‘Letters of Credit,’ the round 0 in old style numerals follows scribal tradition, which was done to avoid confusion with the letter o.\n\nIncidently, as is usual in type design, what looks geometrical isn’t. In Adobe Caslon old style 0 the inner circle is an oval, and consequently the vertical arches are fatter than the horizontal ones.\n\n"
    },
    {
      "time": " 17 November, 2005 - 10:41am",
      "content": "\\>non-old style faces\n\nI’m not sure whether you’d call Scala old-style (although its default figures are old-style), but it has this feature — even in the sans.\n\n"
    },
    {
      "time": " 17 November, 2005 - 11:18am",
      "content": "On the roundness, I seem to recall something in Smeijers’ Counterpunch about 0 being traditionally cut using a drill (not a counterpunch) so that it truly was a perfect circle. I don’t know whether, apart from the typographical convenience of distinguishing 0 and o, there was also some sort of almost mystical attraction to using a perfect circle to represent zero.\n\nI really like the circular and monoline 0, but I think I’m in a minority. The current fashion at least seems to be to use some other device to distinguish oldstyle 0 and o.\n\n"
    },
    {
      "time": " 17 November, 2005 - 12:46pm",
      "content": "Fournier is that way I believe. It always startles me a bit when I see it.\n\n"
    },
    {
      "time": " 17 November, 2005 - 1:59pm",
      "content": "I’ve never liked that figure. I’m trying to think of any typefaces which use this historical model that I do like. I can’t. Hmm.\n\n"
    },
    {
      "time": " 17 November, 2005 - 2:03pm",
      "content": "The circular zero always looks like a hollow bullett or a degree sign to me and never seems to resolve itself as part of the type forms to me. This is purely a personal opinion but it does drive me nuts everytime I see it.\n\nChrisL\n\n"
    },
    {
      "time": " 17 November, 2005 - 2:28pm",
      "content": "I do find the oldstyle zero rather distracting when it shows up on almost every page of a book. On smaller documents, however, i feel that it can often be the thing that livens up the page.  \nI also like dashed zeros. Not enough typefaces have that.\n\n"
    },
    {
      "time": " 17 November, 2005 - 3:29pm",
      "content": "\\>I’m trying to think of any typefaces which use this historical model that I do like.\n\nThis one, Georgia—102 304 506 70809?\n\nJust checked not on screen and the 0 in Georgia is modulated when its not on screen. The hinting must make it look more uniform here on Typophile. But it looks pretty good on screen.\n\n"
    },
    {
      "time": " 17 November, 2005 - 3:32pm",
      "content": "Ah. I was referring to the perfectly circular.\n\n"
    },
    {
      "time": " 17 November, 2005 - 3:34pm",
      "content": "I was correcting my post when you responded. What do you think of the screen Georgia? Not perfectly circular—it looks a bit squared out—but then neither is Adobe Caslon, in a different way.\n\n"
    },
    {
      "time": " 17 November, 2005 - 5:04pm",
      "content": "Perfectly round on the screen is a lot togher to do. When you are at one or two pixel stroke width, there isn’t much you can do to create a round curve.\n\nChrisL\n\n"
    },
    {
      "time": " 18 November, 2005 - 5:40pm",
      "content": "Although it is very historical, I too find the perfectly circular zero-contrast oldstyle zero very distracting in most typefaces.\n\nT\n\n"
    },
    {
      "time": " 18 November, 2005 - 7:15pm",
      "content": "“…I too find the perfectly circular zero-contrast oldstyle zero very distracting…”\n\n ![](http://web.archive.org/files/bullseye.gif)\n\nChrisL\n\n"
    },
    {
      "time": " 18 November, 2005 - 9:44pm",
      "content": "Well, Chris, what can I say? You’re right on target.\n\n"
    },
    {
      "time": " 18 November, 2005 - 10:14pm",
      "content": "I like circular zeros, but they must have enough weight to fit the color of the face which many circular zeros lack.\n\nHéctor\n\n"
    },
    {
      "time": " 19 November, 2005 - 3:20am",
      "content": "I agree with Héctor here. Sometimes the weight is too light. But for it to work, the zero also must be not really uniform, but only appear to be so on first glance. Adobe Caslon—and the originals of William Caslon—are not uniform circles, but just give the impression of being so.\n\nThe ‘bulls eye’ ring, as Chris illustrates with his usual humor, is disturbing. To me the on-screen version of Georgia’s 0, which looks circular, also works, as you can see in the following. Zero: 0; and oh: o. Alternating in a row: 0o0o0o\n\n"
    },
    {
      "time": " 19 November, 2005 - 8:47am",
      "content": "Another technique to distingush lower-case zero from a lower-case o is what Hermann Zapf did with AMS Euler. He made the zero slightly egg shaped. Admittedly, Euler isn’t a text face, but I think the idea has merit.\n\n"
    }
  ]
}
