{
  "id": "16313",
  "title": "font study : reference material",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello,\n\nI recently recieved my frist assignment for my typography class at school, we have to make a study about about an font of our choice.\n\nI have chosen the \"Sabon\" by Jan Tschichold. I have gathered alot of information about Tschichold and the Sabon itself (including the Sabon Next).\n\nAnd now i'm a little stuck so how do i go from here? I have no idea how someone should explain the special features/highlights of this particular font. I wanted to ask my teacher but he's a little hard to get hold of, he did show us some great books about/from \"Bram de Does\" that gave my some idea how to handle this sort of thing but i could not take those home with me.\n\nSo do you have any kind of reference material that i can use, any help is appreciated.\n\n(I'm new to this forum so i don't know if i'm posting this in the right category.)\n\n.pixr\n\n",
  "author": "<a href=\"/web/20100225214518/http://www.typophile.com/user/10144\" title=\"View user profile.\">kj_kooijman</a>",
  "time": "<br>",
  "uid": "10144",
  "comments": [
    {
      "time": "",
      "content": "Since I doubt that many people who frequent these forums are psychic, we have no way of reading your teacher's mind. If you're stumped, ASK THE TEACHER for a little guidance; I am told, by not a few friends of mine who ARE teachers, that they don't mind doing this...in fact, it's one of the reasons they got into teaching.\n\nAnd, incidentally, in the process, YOU will be doing your homework, instead of us...\n\n"
    },
    {
      "time": "",
      "content": "Seems like that is the font of choice these days:  \n [http://typophile.com/node/16252](http://web.archive.org/web/20100225214518/http:/typophile.com/node/16252 \"http://typophile.com/node/16252\")\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "you are a graphic design student? if yes  \nthen,after all the theoretical study u made on the font  \nnow u need to show it,what special about the font  \nhow u can use it,explore the practical side of the font  \nby design,composition, good for text,what kind of text  \nnews paper,magazine,headlines,what it function by its form.  \nmaybe also alternative use of it,show show show,while ur a student  \nit better to shoot everywhere and with time ull learn to aim the right target.\n\n"
    },
    {
      "time": "",
      "content": "thanks for the reply's, i understand your comments.\n\ni probably was not clear enough with what i was looking for, i really meant how does something look like that visually, so layout wise...\n\ni did some extra \"googleling\" and come up with some nice idea's so i'm gonna work with that for the moment.\n\n"
    },
    {
      "time": "",
      "content": ".pixr,  \nIt is a pity that you have been met with such hostility in a typographic forum. This should be a place where ideas and information can be shared without people making puerile comments. Forum users should say nothing if they have only sarcasm and contempt for those that wish to learn. It would seem that some people have a somewhat elevated and misguided opinion of themselves.\n\nA good starting point for looking at the charcteristics of type would be Making Digital Type Look Good by Bob Gordon. Good luck with your project.\n\n"
    },
    {
      "time": "",
      "content": "T Bones...\n\nYou may well consider it puerile to have no patience for those who would have others do their homework assignments for them; some of us, on the other hand, consider the request itself puerile. School work should be preparation for \"real life\" and, in \"real life,\" one is not always afforded the opportunity of asking others to do one's heavy lifting.\n\nAlso, the proper relative pronoun for referring to people is \"who,\" not \"that\"...\"those **that** wish to learn\" should be, in fact, \"those **who** wish to learn.\"\n\n"
    },
    {
      "time": "",
      "content": "Oldnick  \nThe point I was making was that it is simply better to say nothing than to make spiteful comments. Whilst you feel there is no point in performing other's heavy lifting, there's no reason to discourage those asking for a little help.\n\nAlso, this topic is not about grammar. However, **you** should know that whilst \" **who**\" is the more commonly used relative pronoun, \" **that**\" is also permissible.\n\n"
    },
    {
      "time": "",
      "content": "T Bones,\n\nAgreed, the subject is not grammar but, since you felt compelled to lecture me on manners, I thought that the schoolmarm ethic should be answered in kind, and a lecture on grammar was therefore appropriate. **That** as a generic relative pronoun is permissible for slackers and, apparently, Brits; as proper English is taught in graduate programs in English Language and Literature here is the Colonies, **who** is the proper pronoun to use when the antecedent is persons, **which** is the proper pronoun to use when the antecedent is things. Also, **others** , when used as a possessive pronoun, takes an apostrophe; **his, hers, yours, ours** and **its** do not.\n\n"
    },
    {
      "time": "",
      "content": "Hello .pixr,\n\nI am not sure -- isn't there a PDF of the Sabon  \nNext brochure on the Linotype website? (Dan?)\n\nThe one whom I'd recommend as truely exemplary  \nas regards \"writing about type\" is Max Caflisch  \n(he was a collegue of Tschichold by the way).  \nHe analysed many typefaces for the Swiss magazine  \n\"Typographische Monatsblätter / Revue suisse  \nde l'imprimerie / Swiss Typographic Magazine\",  \nhowever, in German ...\n\nThen, John Dreyfus. Maybe you can get hold of  \na copy of \"Into Print. Selected Writings\" (British  \nLibrary, 1994). It's about type history mainly,  \nand contains articles about Baskerville &c.\n\nAnecdotes about his own types (which I find  \nfunny and interesting) are in Frederic W Goudy's  \n\"Goudy's Type Designs. His Story and his  \nSpecimens\" (The Myriade Press, 1978; also as  \nTypophile Chap Books XIII-XIV, \"A Half Century  \nof Type Design\").\n\nIf you can get hold of a copy, B.H. Newdigate's  \n\"Book Production Notes\" (Tabard Private Press,  \n1986), mostly about typography, but also with  \ncritical notes on typefaces.\n\nGood luck,  \nKarsten\n\n"
    },
    {
      "time": "",
      "content": "i did not mean to start a riot between forum members, so sorry for that.... i guess.\n\n@T Bones, thank you for the support and the book tip.\n\n@k.l, there is a PDF at linotype with background information about Tschichold, but i don't think there is a download able PDF of the Sabon Next brochure. I did read somewhere that there is a good booklet handed out during the presentation in 2002, but i have not been able to find it (online). Nonetheless i would like to thank you for the book suggestions, i will surely look into those.\n\n"
    },
    {
      "time": "",
      "content": "oldnick/.pixr\n\nWOW! What an education!!! I tend to agree with T Bones, believing that that that that that guy said (punctuate that!) was perfectly acceptable. Language is constantly evolving (at least outside of America where it seems they still teach English with Victorian grammar books)......pixr, you keep using these type of forums to learn and move on. Some people like to help others and peer learning is one of the best ways of doing that. Don't get dragged down by those who (or is it \"that\"?) would have you believe that learning is about falling flat on your face. It can often be about helping others NOT to come unstuck.\n\nGood luck with the project.\n\nNick, is that \"in\" the colonies?\n\n"
    },
    {
      "time": "",
      "content": "I'll just chime in to say that Sabon is a really good choice for analysis... especially if you delve into the technical aspects, like how it was made to conform to the then-triumvirate of typesetting technologies. In fact an entire essay could be written on the seemingly innocent question: \"Why is the Sabon 'a' so wide?\" BTW, I know there's some great Sabon stuff in the Typophile archives, with scans from rare magazine articles and such.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_Nick, is that “in” the colonies?_\n\nYes, indeed it is; good grammar and bad typing are not, it seems, mutually exclusive. And you may agree with T Bones about sloppy reflexive pronouns...it's your prerogative, but I don't agree, nor do the ghosts of my English professors (yes, several of them are now dead).\n\nAnd I must also disagree with you when you say that learning should not be about falling flat on your face. I have heard it said that an expert is a person who has made very mistake which can be made within a limited field of interest; hence, expertise is gained from constant and continuing face-falling. And, due to a certain perversity in human nature, learning from others' mistakes (especially those of our elders) is no substitute for learning from our own. Try; Crash; Burn; Learn; Repeat as Needed...a crazy little thing called Life.\n\n"
    },
    {
      "time": "",
      "content": "Nick,\n\nMy comment wasn't that learning SHOULDN'T BE about falling flat on your face, but rather that it DOESN'T HAVE TO BE about that. If someone has the common sense, savvy, presence of mind and, it may be argued, humility, to ask for help that will avoid such an incident, then surely they deserve to receive that help.\n\nI agree with you in that falling flat on your face surely DOES teach you something, but it's by no means the best and only way to make progress.\n\nWhile I didn't want to make an issue of the grammar aspect, I will just say Nick, that perhaps you should be aware that the language of your professors died along with them. Prescriptivism is no longer the order of the day.\n\nRegards\n\nPaolo\n\n"
    },
    {
      "time": "",
      "content": "\\>Prescriptivism is no longer the order of the day.\n\nI assure you that editors and those who hire for literate occupations do prescribe. Such things as mixing up \"your\" and \"you're\" (pretty common on Typophile, alas) marks you as relatively less literate. Your writing is likely to be dismissed as a result.\n\nAlso writing without capital letters, as guyt does, will gain you readers who are irritated that you can't bother to help them typographically. Perhaps brief instant messages to friends are an exception. In general, though, proper use of caps is considerate to your reader, and writing in only lower case a misguided attempt at informality.\n\n"
    },
    {
      "time": "",
      "content": "Amen, William.\n\nIf writing is undertaken in order to communicate, the greater the precision of the language, the greater the chance that communication will, in fact, occur. This linkage between precision and efficacy of thought-conveyance is precisely why rules are necessary.\n\nIf your thoughts are sloppy or you have no intention of being understood, then, by all means, use sloppy language. Yanumsane?\n\n"
    },
    {
      "time": "",
      "content": "\"(pretty common on Typophile, alas) marks you as relatively less literate. Your writing is likely to be dismissed as a result.\"\n\nWilliam,  \nThis may be true in publishing but when someone here online bangs out a post quickly, there will be more errors than when they are writing with more resultive a purpose. I am sure all of my posts are just rittled with typos and spelling errors. I don't feel too bad about it. Speed kills in writing as well as in driving a car. The difference is what is lost on a Typophile post is nothing compared to a car accident.\n\nI am always willing to forgive typing errors in online forums and certainly never give a second thought to strange construction due to the home language of the writer. If I don't understand a post, I'll just ask for clarification. I asuume everyone else here will do the same when my writing or typing is off the mark. I am probably one of the worst offenders on Typophile when it comes to spelling and typing so I have no right to look downward at others.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\>I am always willing to forgive typing errors in online forums and certainly never give a second thought to strange construction due to the home language of the writer.\n\nBeing a big offender myself on spelling, I am also quite willing to forgive such mistakes. Also my hat is off to those who are bravely struggling with the English language, and I am happy to struggle to understand and to help.\n\nBut typing in lower-case only is a decision, not a matter of speed--except perhaps in instant messages. Similarly, using \"your\" instead of \"you're\" is most often not a typing mistake. It's also not a great sin in on-line dialogue, but my point was that billygoat's claim that \"prescriptivism is no longer the order of the day\" is seriously misleading to students.\n\nYou will NEVER find John Hudson or Nick Shinn, very articulate and literate Englishmen, making such mistakes as confusing your and you're. On Typophile it is almost always young Americans still in school or recently out of school who make such mistakes. After they learn by hard knocks that such mistakes stigmatize them, they wise up. Billygoat's advice will just delay their learning the facts of life, and subject them to humiliation or set-backs in their careers.\n\n"
    },
    {
      "time": "",
      "content": "Gosh William, I thought you would pick up my purposive spelling error above--\"rittled vs riddled\" :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\>I thought you would pick up my purposive spelling error\n\nI did--I enjoyed your humor. Hey, I'm easy going on these things.\n\nOk, I admit the no-caps thing bugs me, particularly coming from typographers.\n\nBut a lot of other people aren't so easy going, and young people can really get hurt if they don't know this.\n\n"
    },
    {
      "time": "",
      "content": "\\> You will NEVER find John Hudson or Nick Shinn,  \n\\> very articulate and literate Englishmen\n\nI don't like the sound of that (as much as I think their command of  \nEnglish is fine). Plus it's false. Plus Nick doesn't like to be... oh forget it.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>asuume  \nChris,  \nI thought this was your purposive error.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Tim,  \nisn't that ahhhsuum? :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\"Ok, I admit the no-caps thing bugs me\"\n\nSo you are not an e e cummings kind'a guy :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Is that ahhhsuum as in shock and ahhhh?\n\n"
    },
    {
      "time": "",
      "content": "\"as in shock and ahhhh?\"\n\nYou must have had some bad intel on that:-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\>not an e e cummings kind’a guy :-)\n\nActually I like e e cummings. He all his choices in typography are to serve his poetry, and he makes it work for him. Sometimes it's a bit precious, but often it works well. Doing the no caps thing in your letters, on or off line is a different thing. To me it comes across as a misguided attempt to be friendly or trendy (or both) by being informal. In reality, it just makes your text harder to read.\n\n"
    },
    {
      "time": "",
      "content": "\"He ???? all his choices in typography\"\n\nFill in the blank?\n\nChrisL  \n--Gotta love catching a real writing pro in the act of omission :-)\n\n"
    },
    {
      "time": "",
      "content": "Hey, the joy of Typophile is that you can take a break from work, smile a bit, learn a bit, and shoot some BS back without too much strain. Sometimes the BS is a little more incoherent than others.\n\nThat should have been: \"All his choices in typography\" The 'He' should have been cut but wasn't--leaving stuff behind in revision is where I usually screw up.\n\n"
    },
    {
      "time": "",
      "content": "\"leaving stuff behind in revision is where I usually screw up\"\n\nSo you ARE a revisionist :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\>NEVER\n\nYou can keep up appearences now that its possible to fix you're mistakes on Typophile now that you can go back and edit them. Dude.\n\n"
    },
    {
      "time": "",
      "content": "\\>go back and edit them\n\nYeah, I was tempted to fix my screwed up post above. Then I could have protested what is Chris talking about. But that would be wrong, as Nixon used to say :-)\n\nedit: just noticed the you're for your. And now the 'appearences.' And the run-on sentence! Wow. They don't call you Old Nick for nothing :-)\n\n"
    },
    {
      "time": "",
      "content": "\"They don’t call you Old Nick for nothing\"\n\nCaught it in the nick of time :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I agree.\n\nYour write Mr Berkson. Maybee its the those who teach that need to be remindead that prescriptivism destroys creativity.\n\n"
    },
    {
      "time": "",
      "content": "\\>Maybee its the those who teach that need to be remindead that prescriptivism destroys creativity.\n\nTeachers don't help their students' creativity by failing to warn them when they make grammatical mistakes that will stigmatize them as ignorant.\n\nI don't think that knowing rules--such as rules of grammar or of typography--is a hinderance to creativity. Teaching the rules, their strengths and weaknesses, and when they can be bent or broken should be the goal--not either \"do whatever you want the public be damned\" or blind obedience to rules.\n\n"
    },
    {
      "time": "",
      "content": "Once again I totally agree with sir.\n\nKnowing the rules - or what are deemed to be the rules - puts one in a position of power, because only then does one know when and how to bend or break them.\n\nThe point I was trying to make was that blind obedience - or blind instruction - makes creative slaves, not creative masters.\n\nThe original issue in all of this was helping others to achieve that goal, and NOT to leave them floundering. So let's do just that, eh?  \nCrikey guv'nor, it's nearly Christmas. Can't you spare a little charity for a poor boy wiv a little project to support? Find it in yer 'eart sir, I beg yer.\n\nYours SINcerely\n\nCaesar Augustus Plantagenet\n\n"
    },
    {
      "time": "",
      "content": "\\>Can’t you spare a little charity\n\nKnowing the subject is the first requirement for a teacher.  \nKindness is the second.  \nWillingness to correct is the third.\n\nAll three should be present. I hope I wasn't unkind, but I felt you saying that if teachers correct their students' mistakes, they will stifle their creativity. The challenge of being a good teacher is to both encourage and correct. To do one without the other is much easier, but far less helpful to students.\n\nHave a happy Christmas.\n\n"
    },
    {
      "time": "",
      "content": "I think the primary attribute of a [really good] teacher is being a student.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>Willingness to correct\n\nIn practicum work, I prefer the opposite.  \nRather than look for faults and say fix them, look for possibilities and say follow these.  \nThe faults will fall away.\n\n"
    },
    {
      "time": "",
      "content": "_\\>I think the primary attribute of a [really good] teacher is being a student._\n\nWell said.\n\nReally good teachers are very confident (so the students can trust them to be right) and yet very humble (so they keep on learning).\n\nI've come across a few of them in my life and I hope to become one someday.\n\n"
    },
    {
      "time": "",
      "content": "\\>Rather than look for faults and say fix them, look for possibilities and say follow these.  \nThe faults will fall away.\n\nNick, are you saying that you do not communicate to students, however tactfully, what designs or design directions you think are better or worse? In other words, that you make no judgments?\n\n"
    },
    {
      "time": "",
      "content": "Socrates had a way of getting his students to arrive at the (his) solution themselves by having a logical dialogue which made his truths to be self evident.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\>of getting his students to arrive at the (his) solution themselves\n\nThose who have studied Socrates' dialogues and method in depth I believe agree that Socrates give a lot information and direction. His questions were most often not open-ended, but very directive--a way of building an argument. Also you have to recognize that Plato was writing the whole thing and made his 'Socrates' win as a character in his play. It is clear that Socrates had strong views and argued for them, however clever he was at disarming opposition.\n\nOne question is whether a teacher should communicate judgment about what is better and worse practice in his or her field. The other is what is the best way to communicate that.\n\n"
    },
    {
      "time": "",
      "content": "My favorite (and often used) line in Plato's Republic is \"Yes Socrates, I agree\"\n\nI fully understand that Plato uses Socrates as a hero character and gives him the best lines. I often used the Socratic method when I taught. It is much harder when you have to do it on the fly and you can't write the dialogue ahead of time. My goal as a teacher was not to use it to \"win a point\" but to get the student to analyze and support his/her own actions. My point was not to teach them to make a good design but to teach them to teach themselves how to do it and, most importantly, how to communicate their reasoning to their some-day clients.  \nI use my own take on the Socratic method both when I interview a client about a new project and when I present my design solution for it. I often quote back what the client said at our first meeting and try to show how I addressed those concerns in the design solution. I am not a salesman though. My aim is to solve the clients problem and prove to them how I did it. I have no interest in dog-and-pony-show lip service.\n\n\"...whether a teacher should communicate judgment about what is better and worse... \"\n\nI never tried to make an outright judgment even though that is what several of my students wanted me to do. I took the longer route and had the student extract their own judgment. To me, this is more valuable for their future when there is no one to guide them.  \n\"...teach a man to fish...\"\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> Socrates had a way of ...\n\nOf course it didn't hurt that they were all from the same village...  \nDon't try that on the internet! :-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> Socrates had a way of …\n\nThis is much like superhero comic books or their TV shows. Things have not changed much in 3,000 years :-)\n\n\"they were all from the same village\"  \nThe same one as Hilary Clinton?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Now I don't agree. Knowing the subject has very little to do with being a good teacher.\n\nOnce again I WASN'T saying that correcting students' mistakes stifled their creativity; they're your words. What I was saying, and this goes for the being a good teacher thing too, is that rigid application of subject knowledge, however good that knowledge may be, does not necessarily lead to good learning on the behalf of the students.\n\nThe challenge of being a good teacher is opening the students' minds and empowering them to think for themselves, not simply to pass on the thinking of others.\n\nSeason's Greeting to you too.\n\n"
    },
    {
      "time": "",
      "content": ".pixr,\n\nBeing a fellow student I am surprised your tutor didn't give you some idea of a place where to start other than using the web? Without meaning to be patronising have you tried your library and mulled over books?\n\nI'm in the third (and sadly last) year of my BA (in Graphic arts) and I fell foul of asking for help on here. Google is great, the internet is great and the majority of people who post here I admire however I learnt a hard lesson from a select group and in my very English way poked two fingers up to forums, the web and went and burrowed in my universities library.\n\nTo my horror I actually started to read (again!) and so renewed my love of books and letterpress and the hands on aspect of type. Ask as many questions as you like but make mistakes and learn from them.\n\nRebecca\n\n"
    },
    {
      "time": "",
      "content": "\\>rigid application of subject knowledge, however good that knowledge may be, does not necessarily lead to good learning on the behalf of the students.\n\nOk, we're in agreement. Getting students to think for themselves is certainly a prime goal. So is conveying to them the wisdom and skills acquired by past generations. Part of this is a matter of what is better and worse in a given field.\n\nFor example, if a student of Chris showed him a typographic solution that failed to visually reflect the heirarchy of ideas in the text, and so failed to served the client's desire to communicate effectively to readers, he would, I guess, suggest that the student seek new and varied solutions to better meet the clients needs. This is more effective teaching than saying 'you idiot, you got it wrong', but it is teaching standards and past knowledge none the less.\n\nWhat I don't like is the idea that teachers don't have anything to teach, and that they are just facilitators. Billygoat you seem to advocate this view when you say \"Knowing the subject has very little to do with being a good teacher.\"\n\nTo take an extreme example, I don't want the teachers of my heart surgeon, if I ever need one, to not know and teach what kind of surgery works to cure people, and to correct the skills of their trainees before they do surgery themselves. And then my surgeon would just creatively figure out his own method for cutting me open. No thanks.\n\nNow I know graphic design is not open heart surgery, but there is a large body of knowledge and standards, and students are going to do a better job if they know it. And they are less likely to learn it if their teachers are ignorant. Because there are a number of valid graphic solutions to any design problem, doesn't mean that some of the solutions are much worse and some much better. I'm sure that Chris Lozos and Nick Shinn, who are masters in their craft, would communicate that knowledge very effectively. And some very wonderful and kind facilitator who knew nothing about graphic design would do a much worse job.\n\n"
    },
    {
      "time": "",
      "content": "Ok,\n\nI guess everyone agrees that a great teacher knows a lot about his subject AND knows how to communicate it.\n\n"
    },
    {
      "time": "",
      "content": "\\>In other words, that you make no judgments?\n\nI hate giving grades, but it's a requirement of the job.  \nIt's worst when you have a really good year, and you can't give them all A's.\n\n"
    },
    {
      "time": "",
      "content": "I think of giving grades as just another form of communication.\n\nBut yeah, if a school forbids giving an entire class an A, that sucks. On the other hand, if they don't forbid it, but it just means you do need to defend your decision, then it's a cop-out just to give a B to some people.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I think we have to make a difference between correcting a student on factual material and conceptual material. If a student makes an error in arithmetic, spelling, anatomy, law or safe medical practice, this is one thing. But \"It Ain't Necessarily So,\" There is even wiggle room here. I would not change the title of \"Porgy and Bess\" songs (\"Bess You Is My Woman Now,\") because they speak more correctly using wrong grammar.  \nEven typographical rules (Goudy and Spiekerman not withstanding) concerning illicit acts with sheep. The crux of the matter is doing it well. Steph Geisbuller, April Grieman, and Willi Kunz letterspaced lowercase quite well. I am glad nobody slapped their wrists with a ruler for doing it.  \nWhen dealing with conceptual material with a student, I think the less iron-fast rules the better. Every rule of today was at some point an exception in the conceptual arena. This is where dialogue and true enquiry are the best tools for teaching and learning.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Do you guys (teachers and/or students) think that there are some specific qualities a design teacher should have?\n\n"
    },
    {
      "time": "",
      "content": "Barbara,  \nI don't think there is one set of attributes which would work as a litmus test. I think you have to take the sum total of the person and balance there good and bad aspects (we ALL have both). If the sum is positive to you, fine. The sum may also differ from student to student. Some students want to be told the gospel and feel lost without strict direction. Some want a devil's advocate to push them to their heights. Some want a gentle source of encouragement to give them a sense of self worth. There are several other general patterns that students want in a teacher as well as mix and match from all.  \nI have had several different teachers with differing styles and personalities. Most were good in spite of their failings. Some were bad even though they had strengths. The only common denominator I can think of is that all the good ones have an honest desire to further the knowledge and skills of their students. The bad ones tended towards self fulfillment over the needs of their students.  \nI can't be more specific than that. I would only say give each teacher you have a fair chance but don't be afraid to challenge them when you don't see where they are taking you.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "William....you have a heart???\n\nGlad to see that you backed off equating surgery with graphic design...BUT, if your surgeon one day runs up against something that his/her sage professors and medical text books failed to cover?\n\nYou seem to like putting words in people's mouths...I didn't say anything about teachers not having anything to teach. That would mean anyone who can draw could be a graphic designer. Anyone qualified to teach should, one hopes, have something valuable they can pass on to students. If they are unable to teach, however, - and a qualification doesn't necessarily mean that they can - then much of that knowledge is not transmitted effectively. Some of the best teachers -and this may apply particularly to the design world - may not hold any form of recognised qualification.\n\nWhat I really want to know is where did Oldnick disappear to? He started the ball rolling. Perhaps he's really Saint Nick, getting ready to mount up behind Rudolf?\n\n"
    },
    {
      "time": "",
      "content": "Barbara,\n\nGood communication skills and the energy and passion for what your teaching otherwise it is pointless to try to convey information to a third party.\n\nThe course I am on is so open wide every aspect of graphics arts and design is catered for and as you progress you can choose to fine tune your skills (in my case typography) or remain a general all rounder. You are then assigned a tutor who can cater to your needs.\n\nMy tutor often says that he will not teach us, thats not what he does, he likes to draw things out of us, as we explore our creativity and develop our own skills, so he'll set briefs that help us do that and then only as we have started to develop has he given us guidelines to follow. For example I am making a book within a book, The outer book will hold two or three words that have the same three letters in the end, the three letters will sit in the inner book so as you turn the pages it becomes a puzzle to match the letters to their endings. ( It's hard to explain but when I show it you'll see what I mean!)  \nI had never made a book before so once I showed interest in it my tutor suggested areas to look at, bespoke printers and binders, the etiquette of 'high' book creation and so forth.\n\nI know as a person that to sit and read from a text book or be spoken at on 'this is how this is kerned' would of killed my passion for type years ago. The way in which I've been taught has made me so hungry for more that though it is not a traditional way to be taught it has helped me develop my creativity more than I've realised.\n\n"
    },
    {
      "time": "",
      "content": "beccabob,  \n<cite>&gt;My tutor often says that he will not teach us, thats not what he does, he likes to draw things out of us, as we explore our creativity and develop our own skills...I know as a person that to sit and read from a text book or be spoken at on ‘this is how this is kerned’ would of killed my passion for type years ago.<cite></cite></cite>\n\nWhat instruction do you receive from tutors regarding the technical aspects of typography? Also, if you've never read or been told how to kern, what was your method of learning?\n\n"
    },
    {
      "time": "",
      "content": "\\>William….you have a heart???\n\nBillygoat, I was disagreeing with your views. You seem to think this is cruel. I don't. I don't think that your disagreeing with me is cruel either--though though I think that your 'humor' about my being heartless is rude. I think that respectful debate, including between teacher and student, helps everyone--including the teacher--to learn.\n\n\\>You seem to like putting words in people’s mouths…I didn’t say anything about teachers not having anything to teach.\n\nYou said “Knowing the subject has very little to do with being a good teacher.” To me your statement clearly implies that whether the teachers have knowledge and skill to pass on is not that important, just their skills as a facilitator to the student learning on his own or her own. That view I think is mistaken, and my point was that if it is mistaken--as you seem now to agree--then so is your quoted statement.\n\n\\>I hate giving grades, but it’s a requirement of the job.\n\nNick, when I asked about judgments, I wasn't referring to grading, but to your making judgments of students' work, and communicating your judgment, however tactfully.\n\nThe excellent style guide you post at your site [www.shinntype.com](http://web.archive.org/web/20100225214518/http:/www.shinntype.com/ \"www.shinntype.com\") , called 'Diggin It', is an example of the kind of typographic knowledge I trust you pass on to your graphic design students. And I would think that when they violate the guidelines, you would get them to think about whether they made the work worse or better--and if you think that is clear that their sample is the worse for it, I hope you would tactfully indicate why you think so, and suggest directions for improvement.\n\nThis kind of tactful pointing out of where work needs strengthening is exactly the kind of thing that Matthew Carter, John Downer and Akira Kobayashi did at TypeCon in their critique of typefaces in progress. I think they were being helpful to those who brought their work, not cruel. Even though it is true that the person bringing work needs some toughness to welcome and learn from a critique.\n\nYour views on Typophile are manifold and sharply put. I would hope that you communicate these interesting insights to your students--without expecting them to agree with everything you say. These are all your professional, experienced judgments and will help your students develop their own skills and tastes--which will not fully agree with yours or mine, hopefully.\n\nThe nature of visual design is that all guidelines on occasion have reasons to be broken. But they shouldn't be broken without a reason, because then worse work results. An example of this approach is, I believe, Ellen Lupton's 'Thinking With Type: A Critical Guide for Designers, Writers, Editors, & Students'. Note the word 'Critical' she is not a heartless and arrogant dictator, but she does give judgments and guidelines, which I what I think good teachers--of which she is clearly one--do.\n\nps. I just read Chris Lozos' comment on how different students are best helped by different styles of teaching. Wise, and beautifully put. Thanks, Chris.\n\nI would just add that while it is true that both sides can adapt, different people will always have different teaching and learning styles. So teachers and students both need some understanding and tolerance of differing styles if they are to have good teacher-student relations, and effective teaching and learning.\n\n"
    },
    {
      "time": "",
      "content": "T Bones,\n\nWe have had lectures on how to apply type, but they prefer you to go away and try to set it without any guides. When you come to show your example, my tutor has then shown me where the errors are and how to correct them. I've found this a better way of learning, it is more of a one on one support, fine tuning aspects that if in a larger class I would not of been able to of grasped. Thats not to say I haven't read books on type, I have, but the hands on approach, to me anyway, has taught me much more than reading books (which I still use as a reference I might add!)\n\nIt helps that my tutor is a brilliant typographer and to stop him from repeating himself he has handed out sheets on aspects of type and book making. There are only fourteen in our type group and each person has such varied requirements, some design and create fonts, others write, others set type. I have taught myself through trial and error how to get the rules right in order to break them and then had my tutor check what I've done. Maybe I'm naive but I like to think that you have a knack for type and appreciation of language instilled in you already :-)\n\nThe same aspect however applies for the other groups within my course, illustrators, information graphics and advertising, animation, script writers, printers - are all asigned individual tutors who are experienced within their field to help you develop your skills, you set your own briefs to help nourish your ideas and they help you learn the technical parts along the way. Thus making you develop confidence in your ability and to also give you a practical aspect of the industry.\n\n"
    },
    {
      "time": "",
      "content": "William, William, William,\n\nPlease don't be so thin-skinned old chap. It was only a little ol' joke. Humourous banter! I'm more than happy for people to disagree with me. So please don't think I was getting at you, or that I felt your comments were cruel (SOB! SOB! - Don't worry about me William, you just get on with your life.....I'll be just fine...)\n\nOnce again though my overseas friend, you have misappropriated my words.....naughty boy! I clarified the point in my subsequent piece when I said that ability to teach is a thing apart from subject knowledge, not that it ISN'T important. Hope that clarifies things.\n\nYour comments to Nick regarding his judgements developing a student's style and tastes, and not passing on your own is more or less exactly what I wanted to get at. Well done that man! World Peace...there you are....a little dialogue and everything's rosy!\n\n'Ci sentiamo presto' as we say in sunny Sicily!\n\n"
    },
    {
      "time": "",
      "content": "\\>naughty boy!\n\nSo to summarize, Billygoat, you know that you haven't changed your position, but have been completely consistent. And you also know that it is fine to make personal jokes at other people's expense, and they are spoil sports if they complain about it. Have a nice day.\n\n"
    },
    {
      "time": "",
      "content": "William, don't be so biblical. Really.\n\nBut yeah, a teacher should know the subject. Duh.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>a teacher should know the subject. Duh.\n\nHrant, Rousseau's views have been extremely influential in education. He argued at times (he wasn't consistent, but this is the influential bit) that people are all born wise and supertalented and will develop beautifully if only we get rid of adults messing them up. The main consequence of Rousseau's view is that teachers should get out of the way. That a teacher should know his subject is, as you say a big 'Duh', but this very influential view in education contradicts this obvious fact.\n\nI think Rousseau's influence has created very confused thinking about education, such as some of that in this thread. This confused thinking doesn't help teachers to do their job, and results in a lot of self-deception about what they are doing--that they are not giving direction when in fact they are all the time. So when I read “prescriptivism destroys creativity “ and “Knowing the subject has very little to do with being a good teacher” I hear again for the n'th time the same confused ideas about teaching.\n\nI think that clarity about the real teaching process--not polluted by Rousseau's wrong ideas--helps people understand what they are really doing as teachers, and that clarity of purpose can only help them be better teachers.\n\n"
    },
    {
      "time": "",
      "content": "JJR has said: \"When God made me, he threw away the mold.\"  \nTo which my brother is fond of adding: \"It's a damn shame he wasn't still in it.\"\n\nThat said, JJR's views on Religion are right on.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "All of my _ **best teachers** _ (high school through college), with the exception of one, had no formal training to be educators. This is no longer possible in today's educational systems, since for the most part, masters degrees are required for educators.\n\nThe questions now are:  \n - Why do I consider them the \"best\" of my teachers?  \n - What did they teach me?\n\nMy judgement of these teachers is not based on conventional educational standards, but on how my very being was affected, even years after classes ended. In fact, two of my best teachers in college I truly detested until after time I started to realize what I had learned.\n\nSo my opinion on what makes a _great_ teacher is based less on what is taught (or even the subject for that matter) and more on how well a student's higher functions are nurtured.\n\nTeachers who have the ability to un-clog minds and kindle the flames of creative and original thought are generally kicked out of conventional educational institutions. And since much of the criteria for educational programs are outcome based (_how much has Johnny learned from the first to the last class_) much of what can be taught is whittled down to simple pragmatics and recombination.\n\nMy best teachers gave me sleepless nights, either because I couldn't see or understand the solution, or because I was so incredibly stimulated my eyes wouldn't shut.\n\nMy best teachers taught me how to throw away the extraneous and get to the heart of the situation or problem; how to dismiss conventional answers and to discover the essential meaning; and above all -- not to be afraid of seeing things differently.\n\nI owe an immense debt to my teachers, mentors and companions on the road of learning. This is chiefly why I re-emerged from my cave, in hopes of sharing and giving back to this community. This is why I encourage exploration in developing new excercises and programs for graphic designers.\n\nMy fear is that we've abandoned these students because we've become confused on what to teach:  \nSomething that can be tested at the end of the school year?  \nor something that awakens new vision and untapped skills?\n\n"
    },
    {
      "time": "",
      "content": "William...really....\n\nI do hope you asked Santa for a sense of humour for Christmas!\n\nIt really wasn't my intention to upset your sensibilty......please accept my humblest apologies.\n\nAND ...NO ...I HAVEN'T CHANGED MY OPINION! Or are you now putting thoughts into my mind as well as words into my mouth. You really must break the habit!\n\nNow... try and stay with it......good knowledge does not (necessarily) = great teacher. Repeat. Okay. That's what Billygoat originally thought, thinks and says now and has intended all along.\n\nMy sense of humour is not intended to wound William. I'm trying to keep it light, not personal...not my style...Forgiven?\n\n"
    },
    {
      "time": "",
      "content": "\\>Forgiven?\n\nOf course. Peace.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the answers, guys.\n\nI graduated recently from a design school (ESDI, in Brazil), where I've had some really amazing teachers (in many different ways).\n\nI hope to teach there someday — in a distant future, of course... — and the things you've said made me want that even more.\n\n:-)\n\n"
    },
    {
      "time": "",
      "content": "\"...made me want that even more\"\n\nThat is already a good start.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\" In fact, two of my best teachers in college I truly detested until after time I started to realize what I had learned.\"\n\nThis is something I wanted to mention as well. Even though you may be frustrated to the point of anger with a teacher at first, it doesn't mean that the Eureka affect won't set in later. I also had two teachers who affected me in this way. The first one I had as a Freshman. I had come from a tough inner-city public high school where just not carrying a knife would get you a passing grade. After graduation, I was lucky enough to get a scholrship to a prestigious University. In high school, I was king of the hill and sailed through with ease. When I went to college, my new teacher had to dislodge me from my excess of unfounded confidence. It took me six months to realize what a great thing he had done for me. I didn't get what I wanted but I got what I needed.  \nIn my junior year, I encountered a teacher whom I didn't understand (neither did the whole class). It took three months for his terminology and concepts to make sense to me. Once it did I took a quantum leap. To this day, I think of this teacher as my greatest influence.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Norbert, right on.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>when they violate the guidelines\n\nThe biggest problem I have had with students, in relation to the finer points of typography, is not that they violate guidelines, but that guidelines exist in a different universe. There is a certain mentality that wants to set everything in Arial to whatever default the layout software has.\n\n"
    },
    {
      "time": "",
      "content": "\"There is a certain mentality that wants to set everything in Arial to whatever default the layout software has.\"\n\nThis is similar to the Quantum Mechanics Uncertainty Principle. Some students avoid uncertainty on principle and default to Arial because it is easy :-)  \n(Hiesenberg is rolling over in his grave now).\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Or Univers 55, if you're in my school...\n\n"
    },
    {
      "time": "",
      "content": "Well I never use Arial as I hate it, I tend to use Sabon or futura or on very rare occasions Gill Sans light.\n\n"
    }
  ]
}
