{
  "id": "16312",
  "title": "logo for a contemporary art museum",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "hello everybody!\n\ni have to create a logo (and afterwards the whole cd / styleguide) for a contemporary art museum… (university-project)\n\nfor now, i ended up with this logo…\n\nany comment / critic would be appreciated!\n\nbesides of that, which fonts would go well with the din and would also be suitable for a cont. art museum (usage: letterhead, etc.. / “normal” textfont)?\n\n ![](http://web.archive.org/files/arte_e_tempo.jpg)\n\n",
  "author": "<a href=\"user/7166\" title=\"View user profile.\">mst0192</a>",
  "time": "<br>",
  "uid": "7166",
  "comments": [
    {
      "time": " 17 November, 2005 - 2:58pm",
      "content": "from these images i would imagine “instituto de arte contemporanea” will lose legibility at small sizes.  \ni like the way the diagonals create a cornered border around the word tempo.  \noptically the blue on black makes the black look brown. maybe thats just my monitor/bad eyes.\n\n"
    },
    {
      "time": " 17 November, 2005 - 3:13pm",
      "content": "\\>makes the black look brown\n\ngood idea! i think that it might look nice if the black were switched to brown…\n\n(probably shouldn’t be thinking too much about color quite yet)\n\nnot sure if its just the size that i am viewing on screen, but it seems like the letters are crunched together.\n\n———————  \nnc\n\n"
    },
    {
      "time": " 17 November, 2005 - 3:53pm",
      "content": "i am not sure about the color. i just picked a random “fresh” color ;)\n\n<cite><br>\nnot sure if its just the size that i am viewing on screen, but it seems like the letters are crunched together.<br>\n</cite>\n\nyou mean in general or the kerning (which isn’t done)?\n\n"
    },
    {
      "time": " 17 November, 2005 - 3:57pm",
      "content": "<cite>from these images i would imagine “instituto de arte contemporanea” will lose legibility at small sizes. </cite>\n\nthats true.. i think thats also because of the condensed font.. but if i give this “subtitle” to much room, it gets to much attention in comparision to the name of the museum.  \ni thought i can remove the subtitle when the logo is printed in small sizes… bad idea?\n\n"
    },
    {
      "time": " 17 November, 2005 - 4:02pm",
      "content": "if this is a school project…then i think removing the subtitle could be a simple way to handle this. but i’m sure you can typographically address this with some work.\n\n"
    },
    {
      "time": " 17 November, 2005 - 4:05pm",
      "content": "I would look at the identities of many contemporary art museums to see what is being done. Consider what is typical, and how far you can move from that comfort area without going too far.\n\nI would look at more than DIN for type, and consider not using a mark.\n\n"
    },
    {
      "time": " 17 November, 2005 - 4:32pm",
      "content": "i did a research. result was that the majority use a sans serif (mostly helvetica, din, trade gothic). without or with a mark (which often relates to the architecture of the building)\n\ni like for example the logo of the expo hannover (the moiree “bubble”, which is always changing)… i think for something like a contemporary art museum, a dynamic (i mean always transforming) logo would be perfect..\n\ni didn’t want to limit myself, by not using a mark. if i use one, i think it has to be symbolic (communicating the aspect of change and dynamic).\n\nthe only thing i know is that the museum has more or less 8 subareas…\n\nexposition, moving exposition, moving library, show, conference, cinema, theater, projection\n\nmaybe i can do something with this… that these eight parts are somehow visible in the logo…\n\n"
    },
    {
      "time": " 17 November, 2005 - 5:44pm",
      "content": "could someone please close the \\<em\\> tag? I’m getting seasick.\n\n"
    },
    {
      "time": " 17 November, 2005 - 6:58pm",
      "content": "fixed\n\n"
    },
    {
      "time": " 18 November, 2005 - 4:27am",
      "content": "I find typo something unbalanced in wight in relation to sign. Why bold?  \nI smell some spain-pixel typography style, that don`t work with abstract content well. The rythm of sign could vary I think. I have one already premade logo for contemporary museum for sale, that definitely contemporary museumlike and that can be adapted for needs.\n\n"
    },
    {
      "time": " 18 November, 2005 - 8:28am",
      "content": "You sound convinced. Good luck with the project.\n\n"
    },
    {
      "time": " 18 November, 2005 - 1:15pm",
      "content": "<cite>I smell some spain-pixel typography style<cite></cite></cite>\n\n…almost impossible… maybe you smell poor austrian typographic education ;)\n\n<cite>I have one already premade logo for contemporary museum for sale<cite></cite></cite>\n\nthanks, but by buying a premade logo, the learning effect would be zero. and on the other side.. why in the hell should I buy my homework? :)\n\n"
    },
    {
      "time": " 18 November, 2005 - 2:01pm",
      "content": "Does australian typography have real definite style?  \nOf course bulky font to bring fat animal or terra texture in it. :o)\n\nOk, for homework you don`t need prepared logo. It`s for business, if somebody want to avoid the headache for moderate bucks. It exactly modern art museum in european look.\n\n"
    },
    {
      "time": " 18 November, 2005 - 5:29pm",
      "content": "i just wanted to say that i am maybe not that experienced in choosing “the perfect font”…\n\nand to reduce your confusion a little bit; i am austrian (not australian) and the logo is for a portuguese museum\n\n"
    },
    {
      "time": " 19 November, 2005 - 1:55am",
      "content": "Slightly ‘Off Topic’, but funny.: Even the Germans are mixing up Austria and Australia, lately.? _Niiice.. :)_\n\n_( And, Michael there even is a small, still quite underground ‘Type Design Culture’ scene in Austria, and a quite amazing one in Portugal :), if you are thinking about choosing a ‘local’ typeface, and / or type designer, to go along with your identity.. )_\n\nDav, [formlos](http://web.archive.org/web/20060522200655/http:/www.formlos.net/)\n\n"
    },
    {
      "time": " 19 November, 2005 - 6:50am",
      "content": "What is the difference between austrian and australian typographic education? I can understand differences between swiss, sweden, german, russian, etc. typography. But what the hell is typical austrian typographic education? Can you explain me? Fontshop bringt neue Schrift raus: FF Heider. Spass :o)\n\nTypographically it smells spain, but sign is like “Stadtwerke Wasserversorgung”, sorry. What about to work in one style for type and sign?\n\n"
    },
    {
      "time": " 19 November, 2005 - 7:17am",
      "content": "Wadim, Are you talkin’ about typographic education, typography or type design.? Its not about the typographical, educational differences between Austria and Australia.. I just find it kinda funny that many people still seem to mix up those two countries.. Even those living in neighbouring countries.. :) _( And, As there are differences between Swiss and German typography, there sure are differences between Austrian and Australian typography.. )_\n\nJaa, lustig.. Der Typ heisst uebrigens ‘Haider’, aber lassen wir das.. _Der hat fuer Oesterreich schon genug ‘getan’.. :(_\n\n_\\* Once more, I am sorry, again, for getting even more ‘Off Topic’.._\n\nDav, [formlos](http://web.archive.org/web/20060522200655/http:/www.formlos.net/)\n\n"
    },
    {
      "time": " 19 November, 2005 - 7:24am",
      "content": "as far as i know, there is no typical typographic education in austria. i just wanted to say that my typographic skills are kind of poor and that there was no aim in creating the “spanish smell”.\n\nthats a good hint.. if it looks like “wasserversorgung”, i have to change this..\n\n"
    },
    {
      "time": " 19 November, 2005 - 7:30am",
      "content": "yes, i know there are some good type designers in portugal.\n\ni would love to choose a “local” typeface, but the problem is that my budget for this is ZERO.\n\n"
    },
    {
      "time": " 19 November, 2005 - 8:04am",
      "content": "Hmm.. I took a look at this work, Dav`s site and http://www.gued.at  \nand now I must say, you all guys have similar typestyle tends to bold-pixelated look at small sizes. Specific culture environment.\n\nMicha: http://www.dafont.com  \nfor “local” typeface.\n\n"
    },
    {
      "time": " 19 November, 2005 - 6:04pm",
      "content": "This design doesn’t look contemporary to me. It looks very 60’s/70’s industrial/corporate. I like your idea of using the 8 sublevels of the museum.\n\nThere should be a concept behind your design, don’t just try and do something that looks “cool”. I hope I don’t sound harsh here, we all have a tendency to get caught up in executing without a strategy first.\n\nDive in to what the museum is about and develop your concept out of that. You will have to explain your design, and why you arrived at your solution, so you should have a good idea behind it. You may have done a lot of this thinking already, but to me this design doesn’t feel contemporary.\n\nOne final thought - if most museums are using sans-serif, maybe a contemporary museum would break away from that and try something new to set itself apart? Best of luck on your project.\n\n"
    }
  ]
}
