{
  "id": "16328",
  "title": "fonts designed in flash? or perhaps a flash-like tool?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am currently using fontLab, and after painstakingly creating 5 glyphs for my first Arabic font (and first font overall) I can't help but wonder, is there an easier way?  \nI'm a flash designer, and im wondering, since flash is vector based, and so is fontlab, is there perhaps someway of designing the glyphs in flash and then importing them into fontLab?  \nI'm guessing not, but I honestly think the flash method of creating outlines (using the line tool) is much more user friendly than the method in fontLab, though that's probably a biased point of view (since I've been using flash for close on 6 years now and just started with fontLabs).  \nSo, to get to the point, is there an easier way to design glyphs?  \nEven if I were somehow able to import a bitmap and have it in the background just to use as a guide, that would be helpful.  \nSo, if anyone knows of such a method, sharing would be appreciated.  \nThanks\n\n",
  "author": "irf2k",
  "time": "18 Nov 2005 — 7:56am",
  "uid": "10168",
  "comments": [
    {
      "time": "18 Nov 2005 — 10:04am",
      "content": "yes there is away  \neps files'or illustrator files  \nalso freehand eps files good.\n\n"
    },
    {
      "time": "18 Nov 2005 — 10:27am",
      "content": "I think this is well covered (including gotchas) in LFLFast.\n\nIllustrator wrong way p28  \nIllustrator right way p29\n\nSi\n\n"
    },
    {
      "time": "18 Nov 2005 — 11:10pm",
      "content": "Fontlab allows you to import EPS files (_menu_ Glyph —\\> Import from EPS...).\n\nHowever, I just tried to import an EPS 3.0 file generated with Flash MX 2004,  \nbut it didn't work as expected — Fontlab imported some paths, but these  \nlooked like an explosion of the shapes I had drawn :^/\n\nSo, you can still use Flash to draw your glyphs, but you'll have to use Illustrator  \nfor an intermediate step. This consists of opening the EPS or AI file generated  \nwith Flash, and saving it in a format that Fontlab understands. In alternative,  \nafter opening the files, you can Copy/Paste the paths from Illustrator directly  \ninto Fontlab.\n\nIt's all documented here: [Using Illustrator to draw typefaces](http://web.archive.org/web/20141031203158/http:/groups.msn.com/FontLab/tipsandtricks.msnw?action=get_message&mview=0&ID_Message=2675)\n\n"
    },
    {
      "time": "19 Nov 2005 — 3:27am",
      "content": "wow, thnx a lot...it really helped (the glyphs are looking a lot better now)...  \njust a question though...by finding the glyph drawing methods in fontlab somewhat cumbersome, am i the norm or the exception?  \ni mean, its a great software, but if its so widely used, why don't they make the glyph designer easier for the user? or is there some advantage to the method they use that a beginner like me hasn't noticed yet?\n\n"
    },
    {
      "time": "19 Nov 2005 — 11:58am",
      "content": "I resisted drawing directly in FontLab for a long time, but once you get used to it, you realize it is particularly suited to drawing glyphs, and working directly in the program makes development go much faster.\n\nI used to draw in Illustrator and copy and paste into Fontographer. However, this method is not so straightforward with FontLab, a factor which kept me from moving up to FontLab for years. Now that I have become accustomed to (frankly, enamored of) FontLab's drawing tools, I can work much faster than I used to, mainly because there are fewer steps involved. The productivity gains were well worth the couple of weeks or so it took me to get used to using its tools.\n\nThere are font designers who work in Illustrator (or other drawing programs), but among those who do it for a living, I think it's the exception.\n\n"
    }
  ]
}
