{
  "id": "16353",
  "title": "critique on a logo for a students association",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "hello,\n\nThis is my first post. I’ve been playing with this logo for a few weeks. This is for the students study association of the Faculty of Creative and Performing Arts. The first logo was horible, so I offerd to change it. Here you can see what the current logo is.\n\n[http://www.kunstenenwetenschappen.nl/index.php3?m=32&c=33&garb=0.1448401...](http://web.archive.org/web/20131108143651/http:/www.kunstenenwetenschappen.nl/index.php3?m=32&c=33&garb=0.1448401879036696&session= \"http://www.kunstenenwetenschappen.nl/index.php3?m=32&c=33&garb=0.1448401879036696&session=\")\n\nSomething is wrong with the eye and I don't know what. I tried to but the pupil in the middle, but that didn't work.\n\nI have also made a .pdf so you can look how I think the logo can work as a letterhead.\n\nAny help or critique is appreciated\n\nThanks\n\n| Attachment | Size |\n| --- | --- |\n| [logo.gif](http://web.archive.org/web/20131108143651/http:/typophile.com/files/logo_7.gif) | 3.59 KB |\n| [LogoDena.jpg](http://web.archive.org/web/20131108143651/http:/typophile.com/files/LogoDena.jpg) | 43.18 KB |\n\n",
  "author": "canus",
  "time": "20 Nov 2005 — 5:09pm",
  "uid": "8433",
  "comments": [
    {
      "time": "20 Nov 2005 — 6:01pm",
      "content": "Try curving the cornea of the eye, and lightening the weight of the diagonal strokes above and below the eye. I think the heavy strokes are overwhelming the eye.\n\n"
    },
    {
      "time": "20 Nov 2005 — 11:33pm",
      "content": "Although my last [post](http://web.archive.org/web/20131108143651/http:/typophile.com/node/16248) to this sort of thread seems to have killed it, I'm going to give this a shot. I often say to my students that design should answer questions, not raise them. Yet this design leaves me with all kinds of questions. First off, what is the actual logo getting at? I mean this very simply; I don't know what you're getting at. I know a bit about Dionysus, a bit about Apollo, but I have no idea what the vector shapes are trying to tell me. What's the pupil about? Why the left pointing triangle? Why a combined shape that resembles a rotated star of David? Why such a harsh contrast between the stoke thicknesses? Why centred over the ampersand? Question, question, question...\n\nAlso, Lithos is too easy for the font. It's the Copperplate Gothic or Trajan of Greek; both great fonts, but used to death for quite a while now.\n\nAgain, I might be out of the loop, but I just don't know what this logo is getting at, and therefore it seems a bit weak.\n\n"
    },
    {
      "time": "21 Nov 2005 — 2:20am",
      "content": "Thank you both for the criticism and suggestions.\n\nMaybe shouldn't have used the difference in weight of the strokes.\n\nI took the greek capital letter α and δ. I looked for the for a couple of weeks and one of my idea's was that when they where combined they look a little like an eye. The α looked more like an eye than the δ. It symbolized looking (for me) at the arts.\n\nThe name of the association was chosen because of the term in art history.\n\nI hoped to avoid a star of david, because it was turned and the strokes where of different weights (to draw attention to the α and δ).\n\nI chose for Lithos because of the greek connection it has and because it is a playful typeface, but can still be used on official documents (the Faculty and the entire university use 'minion') and I have a license for it.\n\nMost of the people (I could only test it on 2 , recognized the α and δ, but one was a board-member and one was the head of communications. So they might have been bias and the first person I told about the design of the logo and a few days later he saw it (he has a good memory).\n\nI shall try playing with the weight at first and the contemplate if the meaning is clear enough.\n\nThanks you both for your reaction and I will post changes soon.\n\nI like logo 2. I slimed it down, but i think it is still clear wich letters are ment.\n\nlogo 3 and 4 I have tried to change the shape a little to prevent the davidsstar connection.\n\n"
    },
    {
      "time": "21 Nov 2005 — 6:48am",
      "content": "What about...\n\n ![](http://web.archive.org/web/20131108143651im_/http:/typophile.com/files/DA.gif)\n\n...A and D being the same shape but rotated 90° and the 'logo' above at 45°\n\n"
    },
    {
      "time": "21 Nov 2005 — 6:50am",
      "content": "(I'm sure the purists will be queuing up to string me up.)\n\n"
    },
    {
      "time": "21 Nov 2005 — 6:51am",
      "content": "_Apollo popularly (e.g., in literary criticism) represents harmony, order, and reason - characteristics contrasted by those of Dionysus, god of wine, who popularly represents emotion and chaos. The contrast between the roles of these gods is reflected in the adjectives Apollonian and Dionysian. However, Greeks thought of the two qualities as complementary: the two gods are brothers, and when Apollo at winter left for Hyperborea he would leave the Delphi Oracle to Dionysus._ from Wikipedia  \nI would suggest that Alpha is always going to be confused with A, which would then result in Delta being seen as a triangle. I recommend that you either pursue your eye using the lowercase forms, or take a different approach, the quote from wikipedia gives a direction you could take of contrasting yet complementary areas.  \nTim\n\n"
    },
    {
      "time": "22 Nov 2005 — 3:05am",
      "content": "Thank you both for your comments and ideas.\n\nI will concentrate on the eye. I had a meeting yesterday and the people of the board where rather cryptic about what they really thought. But your ideas are quite helpful.  \n\\_\\_\\_\\_\\_\\_\\_\n\nThanks to everyone who has helped me. The definite logo is as is posted above.\n\n"
    }
  ]
}
