{
  "id": "16364",
  "title": "Spewing the new AT&T logo",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "SBC/AT&T’s new identity is announced...\n\n[http://www.usatoday.com/tech/news/techpolicy/business/2005-11-20-cingula...](http://web.archive.org/web/20081005112914/http:/www.usatoday.com/tech/news/techpolicy/business/2005-11-20-cingular-att_x.htm \"http://www.usatoday.com/tech/news/techpolicy/business/2005-11-20-cingular-att\\_x.htm\")\n\n[http://www.sbc.com/Common/files/sig/att\\_horiz\\_color\\_sml.jpg](http://web.archive.org/web/20081005112914/http:/www.sbc.com/Common/files/sig/att_horiz_color_sml.jpg \"http://www.sbc.com/Common/files/sig/att\\_horiz\\_color\\_sml.jpg\")\n\nDiscuss... or just go vomit alone.\n\nMy favorite part is where “He says marketing people finally convinced him that the new look was more evocative of the Internet generation: ’They tell me it’s more trendy and modern.’”\n\n [‹ screen type](http://web.archive.org/web/20081005112914/http:/typophile.com/node/16451 \"Go to previous forum topic\") [hey i'm new here ›](http://web.archive.org/web/20081005112914/http:/typophile.com/node/16449 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081005112914/http://typophile.com/user/7929\" title=\"View user profile.\">silas</a>",
  "time": "<br>",
  "uid": "7929",
  "comments": [
    {
      "time": " 21.Nov.2005 9.48am",
      "content": "There’s more from the horse’s mouth...\n\n[http://www.sbc.com/gen/press-room?pid=4800&cdvn=news&newsarticleid=21908](http://web.archive.org/web/20081005112914/http:/www.sbc.com/gen/press-room?pid=4800&cdvn=news&newsarticleid=21908 \"http://www.sbc.com/gen/press-room?pid=4800&cdvn=news&newsarticleid=21908\")\n\n[http://www.sbc.com/gen/press-room?pid=7521](http://web.archive.org/web/20081005112914/http:/www.sbc.com/gen/press-room?pid=7521 \"http://www.sbc.com/gen/press-room?pid=7521\")\n\nSome fun little timeline charts...\n\n[http://www.sbc.com/Common/files/pdf/logo\\_evolution\\_factsheet.pdf](http://web.archive.org/web/20081005112914/http:/www.sbc.com/Common/files/pdf/logo_evolution_factsheet.pdf \"http://www.sbc.com/Common/files/pdf/logo\\_evolution\\_factsheet.pdf\")\n\n[http://www.sbc.com/Common/files/pdf/brand\\_evolution.pdf](http://web.archive.org/web/20081005112914/http:/www.sbc.com/Common/files/pdf/brand_evolution.pdf \"http://www.sbc.com/Common/files/pdf/brand\\_evolution.pdf\")\n\n"
    },
    {
      "time": " 21.Nov.2005 9.48am",
      "content": "they should have just put a swash around the whole thing and called it a day…\n\n; )\n\nnc\n\n"
    },
    {
      "time": " 21.Nov.2005 9.49am",
      "content": "Ahh, yes, “if in doubt Brand about”\n\nTrendy says it all (inserting finger down throat)\n\nChrisL\n\n"
    },
    {
      "time": " 21.Nov.2005 9.58am",
      "content": "Nice beach ball. Luky me, I won’t be seeing it much here in the North Europe.\n\nmc\n\n"
    },
    {
      "time": " 21.Nov.2005 10.04am",
      "content": "“beach ball”\n\nBeach Ball madam? Why that can’t possibly be a beach ball—Christmas Tree ornament maybe though :-)\n\nChrisL\n\n"
    },
    {
      "time": " 21.Nov.2005 10.14am",
      "content": "Christmas Tree ornament..\n\nYes, why not! Very seasonal. ;^)\n\nJust saw the first Christmas tree in the neighbourhood today, a few of those would look just fine in it.\n\n"
    },
    {
      "time": " 21.Nov.2005 10.17am",
      "content": "”...a few of those would look just fine in it.”\n\nwith out a shadow of a doubt :-)\n\nChrisL\n\n ![](http://web.archive.org/web/20081005112914im_/http:/typophile.com/files/atntorn.jpg)\n\n"
    },
    {
      "time": " 21.Nov.2005 10.24am",
      "content": "gross :-/ I do like Nextel/Sprint’s new identity though!\n\n"
    },
    {
      "time": " 21.Nov.2005 10.28am",
      "content": "Christmas ornament aside, doesn’t anyone else think the type is wonky? I can’t put a finger on it, but something is wickedly icky about the ’a’ and the ampersand.\n\n"
    },
    {
      "time": " 21.Nov.2005 10.28am",
      "content": "i second the Nextel/Sprint ID.\n\n————-  \nnc\n\n"
    },
    {
      "time": " 21.Nov.2005 10.29am",
      "content": "Chris-  \nLOL!!!  \n————-  \nnc\n\n"
    },
    {
      "time": " 21.Nov.2005 10.42am",
      "content": "Growing up, I always thought “AT&T” really said “ATAT.” I figured it must have been in reference to the oh-so-wicked [AT-AT](http://web.archive.org/web/20081005112914/http:/highlights.ultimatedvd.org/starwars/movie_stills/episode-5/AT-AT005.jpg) (aka Imperial Walkers) in Empire Strikes Back.\n\n"
    },
    {
      "time": " 21.Nov.2005 10.49am",
      "content": "yes... the entire NEXTEL/Sprint job is great... love the tv ads too... dry but not stale. Glad they kept the black/yellow. That really caught me with NEXTEL.\n\n"
    },
    {
      "time": " 21.Nov.2005 10.57am",
      "content": "<cite>doesn’t anyone else think the type is wonky? I can’t put a finger on it, but something is wickedly icky about the ‘a’ and the ampersand.</cite>\n\nTotally wonky. With all the ’humanist sans’ happening these days, there sure are a whole lot of wonky curves to go around. I still cringe at Trebuchet.\n\n"
    },
    {
      "time": " 21.Nov.2005 10.58am",
      "content": "There’s a banner on a building across from where I work in Times Square that’s literally 20 stories tall, an ad for Sprint/Nextel and I enjoy it every time I look at it!\n\n"
    },
    {
      "time": " 21.Nov.2005 11.12am",
      "content": "“Growing up, I always thought “AT&T” really said “ATAT.” I figured it must have been in reference to the oh-so-wicked AT-AT (aka Imperial Walkers) in Empire Strikes Back.”\n\nGrowing up, I always thought AT&T stood for ” A Tin-can & Tin-can”  \nas in Tin-canTelephone :-)\n\nAhhh, generation differences :-)\n\nChrisL\n\n"
    },
    {
      "time": " 21.Nov.2005 12.00pm",
      "content": "Some\\* referred to the old AT&T globe as the “Death Star” so the AT-AT reference would have worked for them...\n\n\\*http://catb.org/~esr/jargon/html/D/Death-Star.html  \n<cite>This usage was particularly common among partisans of BSD Unix in the 1980s, who tended to regard the AT&amp;T versions as inferior and AT&amp;T as a bad guy.</cite>\n\n"
    },
    {
      "time": " 21.Nov.2005 12.03pm",
      "content": "May the Force be with you.\n\nChrisL\n\n"
    },
    {
      "time": " 21.Nov.2005 12.04pm",
      "content": "always...\n\n"
    },
    {
      "time": " 21.Nov.2005 12.27pm",
      "content": "I would have done better for half the money...\n\nHéctor\n\n"
    },
    {
      "time": " 21.Nov.2005 1.07pm",
      "content": "I’m not from where you’s fulla’s are, and I clearly have less emotional attachment to a Telco’s logo. But it is worse, so much more! I think the USATODAY write up says it all:\n\n“AT&T’s logo has been rejiggered to give it a 3-D effect.”\n\nImagine adressing a boardroom full of powersuits and selling it with that line! The actual pitch and the USATODAY write-up would be hilarious to read side by side.\n\n“He says the pint-sized letters, reminiscent of alphabet soup, were a tough sell internally”\n\nMan, they are really hacking in to it. Those journo’s know bullshit when they see it…\n\n"
    },
    {
      "time": " 21.Nov.2005 1.13pm",
      "content": "In 2-D I don’t mind it as much.\n\n ![](http://web.archive.org/web/20081005112914im_/http:/typophile.com/files/att_1color.gif)\n\nIt still has problems (the type, that ’a’ gives me the willies), but that 3-D Sphere of Mesmerizing Technology Swirls is just silly. They should have stuck with the uppercase type. No reason to stop. They’re just losing some of the ’burned-in-the-mind’ features of the old one.\n\n"
    },
    {
      "time": " 21.Nov.2005 1.33pm",
      "content": "NYT says it’s Avenir - Yikes!\n\n[http://www.nytimes.com/2005/11/21/business/21logo.html?oref=login](http://web.archive.org/web/20081005112914/http:/www.nytimes.com/2005/11/21/business/21logo.html?oref=login \"http://www.nytimes.com/2005/11/21/business/21logo.html?oref=login\")\n\n"
    },
    {
      "time": " 21.Nov.2005 1.39pm",
      "content": "It looks like they did something funny to it, or it’s not Linotype’s cut.\n\n"
    },
    {
      "time": " 21.Nov.2005 1.50pm",
      "content": "\\>It looks like they did something funny to it,\n\nyes that’s why I said “yikes!” No disrespect to Avenir.\n\n\\>or it’s not Linotype’s cut.\n\nI think Linotype own the TM so no other cut could use the name.\n\nI think Cingular’s brand is all Avenir, which makes the choice all the more/less interesting.\n\n ![](http://web.archive.org/web/20081005112914im_/http:/typophile.com/files/avenir.png)\n\n"
    },
    {
      "time": " 21.Nov.2005 2.01pm",
      "content": "It is but a veneer of Avenir.\n\nI love “Refreshing the brand”. It is kind of like changing the Kitty-litter in reverse—it didn’t used to stink but now it does.\n\nChrisL\n\n"
    },
    {
      "time": " 21.Nov.2005 5.26pm",
      "content": "<cite>I love “Refreshing the brand”. It is kind of like changing the Kitty-litter in reverse—it didn’t used to stink but now it does.</cite>\n\nhahaha! :D!\n\n"
    },
    {
      "time": " 21.Nov.2005 5.57pm",
      "content": "\\>“AT&T’s logo has been rejiggered to give it a 3-D effect.”\n\nDamn those Photoshop filters.  \nBut hey, way to go, UPS.\n\n\\>I would have done better for half the money…\n\nIt depends how stern a stuff you are made of, Hector.  \nJust how many corporate meetings and are you prepared to sit through, how many powerpoint rationales are you willing to give, before your brain turns to mush? Could you make it different, but kind of the same? Sure, give me the money, you want progressive conservative? — no problem!\n\n"
    },
    {
      "time": " 21.Nov.2005 6.07pm",
      "content": "Ok, trying to look for something good...  \nIt appears that maybe they are going to try to change over everything at once... ? That would be good. No “two logos at once” like UPS is \\*still\\* doing.\n\n"
    },
    {
      "time": " 21.Nov.2005 6.41pm",
      "content": "I’m surprised at the lack of craftsmanship on a lot of corporate rebrandings lately. The lines in the globe look like they’re tilting counterclockwise, and they just look poorly drawn. I won’t even mention the type. It looks like a cross between Avenir and Conduit.\n\n"
    },
    {
      "time": " 21.Nov.2005 7.13pm",
      "content": "\\>I’m surprised at the lack of craftsmanship\n\nDesign wanna be like art.\n\n"
    },
    {
      "time": " 21.Nov.2005 7.42pm",
      "content": "I don’t think this is lack of good designers, as much as it is influence of the corporate higher ups and what they think is good. I see this at work sometimes (RCA Records) on the American Idol and other things that Clive Davis gets his hands on. The ADs just give up and let him do what he wants with the artwork because it’s a never ending battle on certain artists.\n\n"
    },
    {
      "time": " 21.Nov.2005 9.46pm",
      "content": "I wouldn’t give Clive Davis all the credit for that beast. Although I am well aware of the trials of a designer and the steps they have to take — blind-fold firmly on — sometimes the market is what drives graphics.\n\n"
    },
    {
      "time": " 21.Nov.2005 10.26pm",
      "content": "Have we figured out what type face this is? Is it a tweaked version of avenier? Looks like maybe a little bit of edge rounding and the like.\n\n"
    },
    {
      "time": " 21.Nov.2005 10.49pm",
      "content": "Tiffany: Sorry I wasn’t clear...I didn’t mean Clive had anything to do with the AT&T logo. I was just stating personal experience with an end product that was less than satisfactory to what original designs/options were presented.\n\n"
    },
    {
      "time": " 22.Nov.2005 5.03am",
      "content": "\\> Christmas ornament aside, doesn’t anyone else think the type is  \n\\> wonky? I can’t put a finger on it, but something is wickedly icky  \n\\> about the ‘a’ and the ampersand.\n\nSurely the t’s are the offending characters?  \n(as well as the crazy 3D bauble globe thing - agree with Chris R that 2D is best).\n\nI kinda liked the bell.\n\n ![](http://web.archive.org/web/20081005112914im_/http:/typophile.com/files/Bell.gif)\n\n"
    },
    {
      "time": " 22.Nov.2005 5.09am",
      "content": "Adrian Frutiger would be very disappointed to see that described as Avenir.\n\n"
    },
    {
      "time": " 22.Nov.2005 5.18am",
      "content": "Everyone liked the bell except for the anrtitrust folks who made Ma Bell get a C section. All the baby Bells were like Burnham Wood come to Dunsanane.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Nov.2005 5.46am",
      "content": "Yeah, but if they bring the bell back they can have the “ill communication” again. Though the new bell would probably be 3D as well, and have an animated clapper or something.\n\n“The clapper represents the cutomer and we are the bell. We get to make a nice sound and you get banged around by our undersides.”\n\nI’ve actually been soliciting non-designer opinions on my site, to see what less finicky viewers think of the new one.\n\n"
    },
    {
      "time": " 22.Nov.2005 6.48am",
      "content": "\\>I’ve actually been soliciting non-designer opinions on my site\n\nlinkie?\n\nSi\n\n"
    },
    {
      "time": " 22.Nov.2005 8.35am",
      "content": "Ok...When UPS rebranded, I was nowhere NEAR this offended.\n\n"
    },
    {
      "time": " 22.Nov.2005 12.28pm",
      "content": "Why is the globe looking down and to the left? It looks like the logo is hanging its head in shame, as should everyone involved in this process. Does anyone know who did this one?\n\n"
    },
    {
      "time": " 22.Nov.2005 12.29pm",
      "content": "I’d qualify it as FUGLY.\n\n"
    },
    {
      "time": " 22.Nov.2005 1.11pm",
      "content": "Miss Tiffany!!! That is unladylike language—but as true as true can be :-)\n\nChrisL\n\n"
    },
    {
      "time": " 22.Nov.2005 1.57pm",
      "content": "\\> <cite>Does anyone know who did this one?</cite>\n\n[Interbrand](http://web.archive.org/web/20081005112914/http:/www.interbrand.com/)\n\nThere’s quite a lengthy discussion of this logo going on over [at Speak Up](http://web.archive.org/web/20081005112914/http:/www.underconsideration.com/speakup/archives/002478.html#002478) also.\n\n"
    },
    {
      "time": " 22.Nov.2005 1.59pm",
      "content": "My problem with the look is it looks like a plate at a fancy resturant with a T-Bone steak and Ice Cream. They don’t work together. Either at&t or the globe need to be smaller. They compete for the same space with no feeling of priority. My worst fear is it looks cheap. That isn’t what you want to project when you are providing service.\n\n"
    },
    {
      "time": " 22.Nov.2005 2.24pm",
      "content": "“My worst fear is it looks cheap.”\n\nIt looks like they got it from one of those “Your own logo for $25!” web sites.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Nov.2005 2.34pm",
      "content": "It really does Chris. I think they felt compelled to get to market. Why is it that companies don’t test there logos at focus groups anymore? A few weeks of testing would of told them what the consumers thought were weak points about their choices.\n\n"
    },
    {
      "time": " 22.Nov.2005 2.40pm",
      "content": "Maybe the suits were afraid they would be told they were wrong?\n\nChrisL\n\n"
    },
    {
      "time": " 22.Nov.2005 2.50pm",
      "content": "I have an AT&T metal snow flake xmas thing from the 80’s from a former girl friend... circa 1986.. I’ll dig it out when we put up the tree.\n\n"
    },
    {
      "time": " 22.Nov.2005 2.54pm",
      "content": "I did a corprate idenity for a local bank that took over a year and it cost over 300 thousand dollars including a graphics manual. It didn’t take 3 months for the branches to violate it. They never consulted the branches on what there needs were. No testing, no feedback. This is bad business at its best.\n\n"
    },
    {
      "time": " 22.Nov.2005 3.02pm",
      "content": "I worked for the Westinghouse Corporate Design Center when Paul Rand was on retainer by them. The CEO was VERY supportive so the circle W identity was adhered to. After Burnham left, things went downhill. It all starts at the top.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Nov.2005 3.23pm",
      "content": "I really find this one unbelievable. This must be the product of corporate bumbling and servile designers. Depressing.\n\n"
    },
    {
      "time": " 22.Nov.2005 8.57pm",
      "content": "or corporate servilitude and a bumbling designer.\n\n"
    },
    {
      "time": " 23.Nov.2005 5.29am",
      "content": "I can’t help but think of Continental Airlines.\n\n"
    },
    {
      "time": " 23.Nov.2005 8.17am",
      "content": "The real sad part is less about changing AT&T. To me the sad part is losing the Cingular brand mark. Cingular had successfully created a brand avatar that was so much more than a logo. Maybe the “jack” as they called it was a bit too trite, but it had some life to it. This is in the same vein as TiVo, only Cingular executed it better.\n\n"
    },
    {
      "time": " 23.Nov.2005 9.47am",
      "content": "I agree with Joe about Cingular. To me the logo, the sensitive use of Avenir and the orange color have been a really strong and attractive identity.\n\nBy contrast Verizon’s new name and especially logo were pitiful. The reputation of their phone service was better though, at least on the East coast.\n\n"
    },
    {
      "time": " 23.Nov.2005 10.00am",
      "content": "VSA did the original cingular mark and type which I thought was nice. Then the logo got hi\\*jacked\\* and turned into the 3D \\*person\\*. Then they added the speech bubbles. Then with the AT&T merger, they changed the colors to orange and blue with bubbles and 3D.\n\nAll that to say Cingular was long gone. To be fair I do think they made the right choice about which was the stronger brand: AT&T.\n\nI don’t really care for sniping at corporate redesigns. I’m as big of a fan of good design as anyone else. But consider the UPS moves that got talked to death. They have done a beautiful job implementing their new logo IMHO. The put up the bucks to gradiate the tails of every aiplane and patch on every shirt. AT&T will throw enough money at the implementation of this new design that it will also work. This is true of the Verizon abomination. The logo sucks but the brand is strong because of the dollars spent putting it in front of our noses.\n\nR\n\n"
    },
    {
      "time": " 23.Nov.2005 1.34pm",
      "content": "What UPS has done to shoot themselves in the foot is the policy of not delivering packages to apartments. In Manhattan you have to come to the lobby to sign for a package. The problem with that is I’m paying a premium for UPS service and they don’t deliver. It would be like an expensive resturant charging you top dollars and asking you to go to the kitchen to get your meal and wine. All the packaging and image creating won’t create a good consumer experience. I will NEVER use UPS again.\n\n"
    },
    {
      "time": " 23.Nov.2005 5.43pm",
      "content": "<cite>What UPS has done to shoot themselves in the foot is the policy of not delivering packages to apartments. In Manhattan you have to come to the lobby to sign for a package. The problem with that is I’m paying a premium for UPS service and they don’t deliver. It would be like an expensive resturant charging you top dollars and asking you to go to the kitchen to get your meal and wine. All the packaging and image creating won’t create a good consumer experience. I will NEVER use UPS again.</cite>\n\nAgreed. I try to use FedEx whenever I need reliable shipping done.\n\n"
    },
    {
      "time": " 23.Nov.2005 5.46pm",
      "content": "UPS is a shadow of their former selves:-)\n\nChrisL\n\n"
    },
    {
      "time": " 23.Nov.2005 6.47pm",
      "content": "I just knew this would turn into a UPS thread.\n\nI’m sorta sad that the little Cingular guy is leaving, but his orange was sooo 2002 anyway. Perhaps they sent him on a mission to recover the discarded UPS ’package’.\n\n"
    },
    {
      "time": " 24.Nov.2005 9.10am",
      "content": "this logo is as lame a “redesign” as i’ve seen.  \nif Chermayeff & Geismar were dead, they’d be rolling in their graves. as it is, they’re probably thinking “why couldn’t we have bid on this job?”\n\n"
    },
    {
      "time": " 24.Nov.2005 9.16am",
      "content": "but i feel the same way about the sprint/nextel lay-down. “logo design is HARD! can’t we just go with this and get on with making another 27 billion...?”\n\n"
    },
    {
      "time": " 25.Nov.2005 8.57am",
      "content": "The old ampersand was great. Do you remember the ads they ran (about a year ago probably)? The new logotype retains the most memorable features of the mark, but throws out the best typographic feature.\n\nAnd I like the new Sprint mark a lot. It has a nice sense of motion and balance. It also plays off their pin drop motif without hitting you over the head with it. I regard Sprints new work as some of the best ID work on that scale (with that much nationwide presence).\n\n"
    },
    {
      "time": " 26.Nov.2005 9.46am",
      "content": "The new logo is fine, I’d rather have it on my bill than any of it’s stone age predecessors.\n\n"
    },
    {
      "time": " 26.Nov.2005 9.48am",
      "content": "“I’d rather have it on my bill than any of it’s stone age predecessors.”\n\nand so you will :-)\n\nChrisL\n\n"
    },
    {
      "time": " 26.Nov.2005 9.55am",
      "content": "I might, if I were a customer, but I’d prefer Skype.\n\n"
    }
  ]
}
