{
  "id": "16372",
  "title": "Strokes in Fontlab",
  "forum": "Build",
  "tags": [

  ],
  "content": "Why isn´t there a plain stroke tool in Fontlab?  \nThis is quite basic, still it´s missing. The “make parallel path” just isn´t good enough…  \nDo I have to go to Illustrator when making a hairline weight?\n\n",
  "author": "<a href=\"user/3070\" title=\"View user profile.\">Toby</a>",
  "time": "<br>",
  "uid": "3070",
  "comments": [
    {
      "time": " 21 November, 2005 - 1:24pm",
      "content": "go to outline\\>expand strokes. however, this gives pretty poor results, you might want to make your hairline weight in Illy anyway…\n\n"
    },
    {
      "time": " 21 November, 2005 - 1:33pm",
      "content": "“you might want to make your hairline weight in Illy anyway…”\n\nBut correct them in FL afterwards.\n\nChrisL\n\n"
    },
    {
      "time": " 21 November, 2005 - 1:45pm",
      "content": "That’s what I did for [Remington Typewriter](http://web.archive.org/web/20060519211747/http:/www.p22.com/lanston/products/remington.html). I drew the skeleton strokes in FLab, pasted them into an Illustrator template where 1pt=1unit, expanded my strokes, pasted them back into FLab and finished tweaking the outlines there. It was a bit of a pain, but that was the best method for my preferences.\n\n"
    },
    {
      "time": " 21 November, 2005 - 2:04pm",
      "content": "Yeah, I guess making the skeleton in FL, then pasting to Illy, convert to outlines, then back again, is the best way. Strange though, maybe something for the next version of FL…?\n\n"
    },
    {
      "time": " 21 November, 2005 - 2:08pm",
      "content": "_Why isn´t there a plain stroke tool in Fontlab?_\n\nStrokes as such are not supported in any widely used font formats. The old Adobe Type 3 format allowed it (plus anything else that PostScript can do), but that format has been obsolete for over ten years. Fontographer can produce Type 3 fonts (including strokes), but you need an ancient computer and OS to use them.\n\n"
    },
    {
      "time": " 21 November, 2005 - 9:04pm",
      "content": "\\>Do I have to go to Illustrator\n\nIf I have any serious stroke expansion to do, I work in Fontographer, which has a brilliant “Expand Stroke” tool.\n\n"
    },
    {
      "time": " 22 November, 2005 - 1:00am",
      "content": "I know strokes would cause trouble when exporting the font , but a simple (automatic) convert to outlines-operation would easily fix this..\n\n"
    }
  ]
}
