{
  "id": "16383",
  "title": "What's in your analogue type design toolkit?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "If you put together a reasonably inexpensive non-electronic type design kit, what would be in it?\n\nHere's mine:  \nSanford Design Ebony Layout Pencils  \nAlvin Brass Bullet Pencil Sharpener  \nSanford Higgins Waterproof Black Magic Ink  \nRapidograph pen set (I use Mars): .3, .6, and 1.2  \nGeneral's Pen Holder (and a selection of pen tips)  \nAlvin French Curves (set of 3)  \n9x12\" Acid free 65 lb white sketch paper (spiral pad)  \n9x12\" Tracing paper pad  \n16\" cork-backed ruler  \nerasing shield  \nSharpie twin tip marker (black)  \nred, black and non-repro blue prismacolor pencils  \nand BIC Crystal Ball Point pen (black)\n\n",
  "author": "minardi",
  "time": "22 Nov 2005 — 7:43am",
  "uid": "10032",
  "comments": [
    {
      "time": "22 Nov 2005 — 8:09am",
      "content": "Since most of the Type Design happens nowadays on screen, I guess some spinning mices who provide energy for the monitor, or in general just the nib and the ink.\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "22 Nov 2005 — 8:20am",
      "content": "There was a thread exactly like this last year. Maybe if you search the archives, you will find it?\n\nHere are some links but there is one more that I cannot find:\n\n[http://typophile.com/node/8889](http://web.archive.org/web/20150420033120/http:/typophile.com/node/8889 \"http://typophile.com/node/8889\")\n\n[http://typophile.com/node/4822](http://web.archive.org/web/20150420033120/http:/typophile.com/node/4822 \"http://typophile.com/node/4822\")\n\n[http://typophile.com/node/16025](http://web.archive.org/web/20150420033120/http:/typophile.com/node/16025 \"http://typophile.com/node/16025\")\n\nChrisL\n\n"
    },
    {
      "time": "22 Nov 2005 — 8:48am",
      "content": "Geez, it's been so long since I've done any real handwork, it's hard to remember, but...\n\nI was seriously into Rapidographs, with a complete range from 6x0 (about a gnat's eyelash in width) to 6 (used about a half bottle of ink for every twenty feet ruled); two Rapidograph ruling compasses (a small drop compass, which handled radii down to a sixteenth of an inch, and a large, far more precise one with worm-gear adjustment that could tackle radii to about four inches); a free-flowing India ink (whose name I cannot recall, but decidedly necessary for very fine-point pens); and Linekote illustration board. Both Rapidograph compasses had leadholder inserts, so you could use non-repro blue lead to plan your work, then swap out the appropriate penpoint to work your plan.\n\nAnother handy tool was white mylar tape for corrections and adding traps. The mylar version was much thinner than regular white tape (fewer problems with shadows), and a lot tougher (you could cut VERY tiny slivers for traps). And, of course, a whole slew of Alvin templates often came in handy.\n\n"
    },
    {
      "time": "22 Nov 2005 — 8:53am",
      "content": "Currently, I'm working on a revival of Comic Sans. So, I've pretty much just got a couple boxes of sharpies and a ream of 20# bond from Kinkos.\n\n"
    },
    {
      "time": "22 Nov 2005 — 8:59am",
      "content": "_a revival of Comic Sans_\n\n\\>^P\n\n"
    },
    {
      "time": "22 Nov 2005 — 9:03am",
      "content": "Oh, and Mt. Dew. Lots and lots of Mt. Dew.\n\n"
    },
    {
      "time": "22 Nov 2005 — 9:34am",
      "content": "Ah ah, Mr. Lozos, I didn't remember my carrot picture.  \nThis forum is so amusing and useful. Thanks, regards, AS\n\n"
    },
    {
      "time": "22 Nov 2005 — 10:11am",
      "content": "I don't do a lot of actual typeform design off the computer, but I do tend to make prepatory studies of stroke and contrast patterns using different writing implements and techniques. The most useful addition to my analogue toolkit this year has been an Osmiroid copperplate nib. This is a discontinued item, but I found a couple on eBay. It is, as far as I know, the only split-nib attachment available for a cartridge pen, and it much more convenient than getting out the pot of ink and my various old nibs and holders.\n\n"
    },
    {
      "time": "22 Nov 2005 — 10:32am",
      "content": "Hrm... didn't realize there were identical threads on this. The thought for this post occurred to me when I recently had to buy a collection of art supplies for a sick friend, and was faced with buying a cheap but comprehensive collection of tools at the art supply store. Kind of a \"desert island drawing tool kit.\"\n\nMaybe a more interesting question is \"does anyone use any anachronistic drawing tools?\" Things like extinct lettering pens, obscure types of pencils, or [these](http://web.archive.org/web/20150420033120/http:/www.cthruruler.com/prod_img/ALG-1.jpg)\n\n"
    },
    {
      "time": "22 Nov 2005 — 10:47am",
      "content": "How about pencils, erasers and paper? If you need to make final art, add rubylith and x-acto knife.\n\n"
    },
    {
      "time": "22 Nov 2005 — 12:05pm",
      "content": "I just get myself some good graphite pencils, HB usually and a pad of paper. Nothing fancy...I do have a lot of other supplies from my design classes but these are the staples.\n\n"
    },
    {
      "time": "22 Nov 2005 — 1:58pm",
      "content": "When I'm not working at my computer, I like working with any of these, depending on what I'm doing:\n\nPilot Precise Extra Fine Roller Ball Pen  \nNo. 2 Pencil  \nFaber-Castell 9000 Pencil Set (for more serious drawing)  \nFaber-Castell Magic Rub Eraser  \nPilot Razor Point  \nYellow legal pad (I love doodling on these things more than anything for some reason)  \nBienfang 10x10 gridded paper  \nGaebel steel 18\" ruler  \nVarious sized plastic triangles  \nDrafting tape  \nX-acto knife and blades  \nMechanical pencil (no favorite brand right now, so long as it has an eraser and uses .05 HB leads)  \nVarious drawing paper sketch books  \nCheap little note pads (I always carry one of these)  \nVidalon Translucent Vellum pad  \nElectric pencil sharpener\n\nAfter watching the movie \"Crumb\" a couple of years ago, I noticed he uses a \"2\" Rapidograph pen for most of his work. I got all nostalgic and went out and got one. I used it for a couple of weeks, carried it around for a couple of months and now the damn thing is sitting with my other pens full of dry ink. Oh well.\n\nI still like using pencils and paper, but I would never go back to producing finished lettering art with ink and pens. I actually used a ruling pen for a little while before I discovered Rapidographs. Ruling pens were heartbreakers. I also used to use a lot of red Zipatone instead of ink for filling in large areas. Plus a ton of ellipse and circle templates and french curves. (What do they call french curves in France? Des courbes? I guess if we were still using them here, some people would be calling them \"freedom curves.\" :-P )\n\nOh, and I still have the T-square I bought in college. Nowadays, I am most likely to use it to retrieve our cat's toys from under furniture.\n\n"
    },
    {
      "time": "22 Nov 2005 — 2:29pm",
      "content": "Bestine and Beer Float--Drink it and you will be able to flush your Rapidograph clean (along with your innards) :-)  \nChrisL\n\n"
    },
    {
      "time": "22 Nov 2005 — 2:38pm",
      "content": "Bestine was nasty stuff, I'd rather have Turkey at least this week\n\n"
    },
    {
      "time": "22 Nov 2005 — 2:47pm",
      "content": "Bestine had NO colesterol and NO carbs (part of your heart healthy diet).\n\nChrisL\n\n"
    },
    {
      "time": "22 Nov 2005 — 3:52pm",
      "content": "_After watching the movie “Crumb” a couple of years ago, I noticed he uses a “2” Rapidograph pen for most of his work. I got all nostalgic and went out and got one. I used it for a couple of weeks, carried it around for a couple of months and now the damn thing is sitting with my other pens full of dry ink. Oh well._\n\nThat's the reason that an **ultrasonic cleaner** was also an essential tool in the analog days. The chemistry profs at the college I worked at eons ago said \"old soapy water\" greatly increased the efficacy of the cavitation produced by an ultrasonic cleaner, and made it more effective. However, I was never sure whether or not that meant that you had to add old soap to new water, or that you added new soap to new water and let it age. Vintage two-and-a-half months ago: a very good year?\n\n"
    },
    {
      "time": "22 Nov 2005 — 4:05pm",
      "content": "#1 rapidograph, yellow legal pad graph paper in 1/8 inch grid (although i can't find it any longer!), onionskin, no. 1 pencils and that's it.\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20150420033120/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "22 Nov 2005 — 5:18pm",
      "content": "It's not like I couldn't clean it. I may get it going again some time. However, it made me realize that I've moved on since my Rapidograph days.\n\n"
    },
    {
      "time": "22 Nov 2005 — 6:03pm",
      "content": "I have all that stuff, but it's gathering dust as I haven't used artwork in type design for a long time. I still sketch ideas, \"thinking with the wrist\", but any old pen on the back of an envelope will do.\n\n"
    },
    {
      "time": "22 Nov 2005 — 6:36pm",
      "content": "Bloc Rhodia No 19  \n [http://www.catalogue-clairefontaine.com/blocs.php?id=134&idam=4&click=2&...](http://web.archive.org/web/20150420033120/http:/www.catalogue-clairefontaine.com/blocs.php?id=134&idam=4&click=2&idama=28&cle=0 \"http://www.catalogue-clairefontaine.com/blocs.php?id=134&idam=4&click=2&idama=28&cle=0\")\n\nKoh-I-Noor Progresso woodless graphite  \n [http://www.chartpak.com/kohinoor/7finearts/progresso.html](http://web.archive.org/web/20150420033120/http:/www.chartpak.com/kohinoor/7finearts/progresso.html \"http://www.chartpak.com/kohinoor/7finearts/progresso.html\")\n\nPeet's Major Dickason's Blend  \n [http://peets.com/shop/coffee\\_detail.asp?id=118&cid=100](http://web.archive.org/web/20150420033120/http:/peets.com/shop/coffee_detail.asp?id=118&cid=100 \"http://peets.com/shop/coffee\\_detail.asp?id=118&cid=100\")\n\n"
    },
    {
      "time": "22 Nov 2005 — 11:09pm",
      "content": "Dear god this is the last straw. I am seriously concerned at my level of interest in this thread. My collection of tools & instruments in variously carefully collected holders & cabinets has been a secret pleasure for years, and now you people are actually exchanging such secret pleasures in a public forum. I can't take it. Stop it, STOP IT.\n\nps. I remember my first Progresso woodless pencil, and love them still. If only the coating didn't peel I'd know true bliss.\n\npps. No, I am not participating in this sick indulgence. I'm not. I WILL NOT.\n\n"
    },
    {
      "time": "23 Nov 2005 — 9:09am",
      "content": "Jason,  \nI've never had a pencil peel on me. Maybe they've improved the formula? Time to head back to your local Koh-I-Noor distributor...  \nc\n\n"
    },
    {
      "time": "23 Nov 2005 — 9:17am",
      "content": "Ahhh, that hardened steel feel of the Alteneder ruling pen laying perfect hairlines down on Strathmore single-ply. The spin of the drop-bow as I fling it through its paces drawing hundreds of small circles on a map illustration; five layers of amberlith with hand cut trapping separating shades of color...Those were the days my friend I hoped they'd never end---NOT!!!\n\nChrisL\n\n"
    },
    {
      "time": "23 Nov 2005 — 7:52pm",
      "content": "To be fair, the only things I use from the original list with regularity are the sketchbook, pencil/sharpener, metal ruler, and the bic pen. I used to be into pilot razor points, but when I had one explode on me I switched to staedtler triplus fineliners.\n\nThe rapidographs and steel pens are 1/2 tool fetishism (gearism?), and 1/2 practical. Something about using tools like this forces you to consider the marks you make on paper. There is a deliberation to each penstroke... but then, at the same time the carefulness can sometimes kill the spontenaity of sketches. I also like the quality of the india on paper. It doesn't bleed like felt tips, is completely opaque, and (depending on technique) doesn't make indents on the paper.\n\nThe most obscure tool I actually use is a \"Wrico lettering pen\" (#6), but it's messy, and I find that I spend more time with preparation and clean-up then I do with drawing.\n\n"
    },
    {
      "time": "24 Nov 2005 — 7:32pm",
      "content": "Lately it consists of:  \n Koh-I-Noor technical pencils, 2H and 4H leads  \n Koh-I-Noor Rapidomatic pencil  \n Sanford Uniball ExtraFine pen  \n Sharpie ExtraFine  \n Sharpie Fine  \n Prismacolor Black marker with Fine and Broad tips  \n Prismacolor markers, various colors  \n Pilot SuperColor Fine in black  \n Marvy Uchica Calligraphy marker  \n Kuretake Calligraphy marker  \n Bienfang Parchment paper  \n Bienfang Satin Design paper\n\nI quit using Rapidograph pens over a decade ago, hated the things. I still occasionally use calligraphy pens, but Iike the feel of the marker better. Still looking for a really black marker though. Quit using french and ships curves for the most part.  \nThe Bienfang paper is okay, but I had a noname tracing paper I got at Favor Ruhl in Chicago. It was between the parchment and satin design in weight, nice surface and very strong. Favor Ruhl went under sometime between 75-80 I think and my brother and I bought all we could get our hands on. The manufacturer quit making tracing paper and I used up the last of it about two years ago.\n\nGeorge\n\nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "24 Nov 2005 — 10:13pm",
      "content": "I saw Amberlith and Rubylith in posts by Carl and ChrisL, so I thought I'd mention my indispensible tool.\n\nThe stencil knife. Just a piece of 3mm stainless steel rod about eight inches long, ground flat at one end and sharpened at about 45°.\n\nThe great advantage when hand-cutting is the ability to rotate the blade as you cut, when held almost vertically between forefinger and thumb.\n\nI don't cut much by hand these days, but still use it all the time to weed out computer-cut ruby and self-adhesive vinyl.\n\nNothing to do with typography, I'm afraid, but I'm just a crude screen printer and sign maker really!\n\nRichard\n\n"
    },
    {
      "time": "25 Nov 2005 — 2:12am",
      "content": "ballpoint pen and some paper. any kind.\n\n"
    },
    {
      "time": "25 Nov 2005 — 8:26am",
      "content": "18\" x 24\" drawing pad  \n1/2 inch watercolor brush  \nPencils ( w/sharpener)  \nErasers  \nPelikan Black & White Plaka  \n2 Winsor Newton University #5 brushes  \nIncline drafting board  \nwhite bond paper  \ntracing paper  \n#11 Xacto  \nT-square  \nRuler  \nScotch Tape  \nSmall Photocopier\n\n"
    },
    {
      "time": "3 Dec 2005 — 10:38am",
      "content": "Vellum paper, with a movable fine grid sheet underneath.  \nA mechanical pencil with a hard lead.  \nA mechanical pencil with a soft lead.  \nStaedtler \"Mars Plastic\" eraser(s).  \nA relatively straight ruler.  \nLapsang Souchong.\n\nhhp\n\n"
    },
    {
      "time": "3 Dec 2005 — 11:46am",
      "content": "256 potatos, an Xacto knike, and an inkpad :-)\n\nChrisL\n\n"
    },
    {
      "time": "3 Dec 2005 — 6:38pm",
      "content": "Chris, you're right! I guess I did design a typeface much earlier than I had recalled...\n\n"
    },
    {
      "time": "3 Dec 2005 — 6:51pm",
      "content": "#16 crow quill pen point and india ink were wonderful for finished art, but I'm glad I don't use them anymore.\n\n"
    },
    {
      "time": "3 Dec 2005 — 9:47pm",
      "content": "Steve,  \nWas it called \"Spud Light\"? :-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Dec 2005 — 7:56am",
      "content": "I think it was Potatohead Sans.\n\n"
    },
    {
      "time": "4 Dec 2005 — 7:57am",
      "content": "CRT monitor\n\n"
    },
    {
      "time": "4 Dec 2005 — 9:33am",
      "content": "Funny!\n\nhhp\n\n"
    },
    {
      "time": "4 Dec 2005 — 9:40am",
      "content": "Peter, how did you design the \"i\"s? Mine were kind of plucky so they didn't leave a big impression :-)\n\nChrisL\n\n"
    },
    {
      "time": "27 Nov 2008 — 7:09am",
      "content": "A hammer, some nails, Old Grandad and safety glasses.\n\nCheers!\n\n"
    },
    {
      "time": "27 Nov 2008 — 7:22am",
      "content": "Plastic buckets of colored pencils and markers. They make drawing letters way more entertaining.\n\n"
    },
    {
      "time": "27 Nov 2008 — 9:58am",
      "content": "I still pull out my 2mm clutch pencils from time to time. I have leads ranging from 4B to 8H for those things, along with a few colors like non-diazo blue. It's hard to find new leads that aren't outrageously expensive, but fortunately I have a pretty good stockpile.\n\n"
    },
    {
      "time": "27 Nov 2008 — 10:23am",
      "content": "I've just been toying around with:\n\n-0.5mm mechanical pencil  \n-Pilot Fineliner  \n-Rapidograph 0.3\n\nI am certainly pre-amateur at doing type by hand but when it comes to working out type signatures that's what I use, any paper that's big enough.\n\n"
    },
    {
      "time": "27 Nov 2008 — 10:24am",
      "content": "2mm pencils have replaced all of my other graphite pencils at this point, I buy them in different brands and colors so I can keep different leads ready to go. The leads are expensive, but like steel nibs, can often be found in bulk as designers and draftsmen of the 1970s appear to have purchased enough to last through 2099.\n\n"
    }
  ]
}
