{
  "id": "16395",
  "title": "Survey: justified or rag-right?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Do you prefer a well-set right rag, or a well-set justified page (body copy, long tracts of text)?\n\nGive reasons, if you can. I usually prefer a nice rag, but I've been improving my ability to set justified type as of late, so I find myself torn between the two styles.\n\n",
  "author": "Palatine",
  "time": "22 Nov 2005 — 3:13pm",
  "uid": "9249",
  "comments": [
    {
      "time": "22 Nov 2005 — 4:01pm",
      "content": "It all depends on...\n\n- first and foremost, the column width;\n- the overall layout;\n- the number of runarounds you're dealing with; andli\\>\n- the typeface being used.\n\nToo narrow a column width can create rivers of white space and/or excessive hyphenation if you justify. If it makes sense within the context of the layout to set ragged right, do so, although ragged left is far more common and, in most cases, more readable. In regard to runarounds, see the first observation. And, IMHO, some typefaces just don't look good justified.\n\n"
    },
    {
      "time": "22 Nov 2005 — 4:03pm",
      "content": "I try to take the subject matter, typeface, whole aesthetic into account before I choose ragged or just. The legibility should be the key factor for my decision. That said, I _prefer_ ragged.\n\n"
    },
    {
      "time": "22 Nov 2005 — 4:12pm",
      "content": "[http://www.hyphenpress.co.uk/titles/unjustified\\_text/index.html](http://web.archive.org/web/20131015171854/http:/www.hyphenpress.co.uk/titles/unjustified_text/index.html \"http://www.hyphenpress.co.uk/titles/unjustified\\_text/index.html\")\n\n"
    },
    {
      "time": "22 Nov 2005 — 4:13pm",
      "content": "\\> It all depends on…\n\nSurely the language of the text should come high up on the list too?\n\nAlso the presence of a hyphenation dictionary - ie there not being one for the Web is a problem for justified Web pages regardless of column width.\n\nSi\n\n"
    },
    {
      "time": "22 Nov 2005 — 4:40pm",
      "content": "I prefer rag right. Although justified is nice on occasion. Most of the time I try to make it easier for the poor bastard who actually has to read it.\n\nkris.\n\n"
    },
    {
      "time": "22 Nov 2005 — 4:51pm",
      "content": "The design and the goal of the project I work on determine if I justified or not the text. A nice rag text is also nice as a nice justified text. The hardest work is to make both nice.\n\n"
    },
    {
      "time": "22 Nov 2005 — 5:23pm",
      "content": "Oldnick:\n\nYou mentioned that \"some typefaces just don't look good justified.\"\n\nWould you please offer a few examples?\n\n"
    },
    {
      "time": "22 Nov 2005 — 5:39pm",
      "content": "I like well justified text blocks but will use a rag whenever it is more apropriate than justification.\n\nHéctor\n\n"
    },
    {
      "time": "22 Nov 2005 — 6:06pm",
      "content": "I believe the superior spacing of rag-right always outweighs any modest aesthetic benefit of justified, and I'm glad the world of print is slowly beginning to recognize that.\n\n"
    },
    {
      "time": "22 Nov 2005 — 6:20pm",
      "content": "It's all good.\n\n"
    },
    {
      "time": "22 Nov 2005 — 8:51pm",
      "content": "Some of the fine art printers at the turn of the last century made full-justify a beautiful thing. But, this doesn't mean it is appropriate for anything else.\n\n"
    },
    {
      "time": "25 Nov 2005 — 3:06pm",
      "content": "Despite Si's accurate observation about the lack of proper hyphenation tools, I prefer \"justified\" for use on the web because most sites are still built with tables of one sort or another. Most pages, just like the one you are viewing now are simply combinations of rectangles and squares. The rectangular look of justified text, to my eye anyway, works nicely with rectangular/perpendicular page structure. I suppose that since justified text on the web appears infrequently, few share my opinion!  \nDK~\n\n"
    },
    {
      "time": "25 Nov 2005 — 5:01pm",
      "content": "_You mentioned that “some typefaces just don’t look good justified.”_\n\nWould you please offer a few examples?\n\nScripts, whether formal or chancery...\n\n"
    },
    {
      "time": "25 Nov 2005 — 8:39pm",
      "content": "Da Kine - Putting aside aesthetics for a moment, do you really find justified text more _readable_? Most do not, _especially_ without hyphenation. Thus the logical lack of justified text on the web.\n\n"
    },
    {
      "time": "26 Nov 2005 — 12:00am",
      "content": "Stephen I find rags a bit distractive, but certainly sans serif faces often look better on rags since they are much more sensitive to spacing.\n\nHéctor\n\n"
    },
    {
      "time": "26 Nov 2005 — 3:46am",
      "content": "\\>superior spacing of rag-right always outweighs any modest aesthetic benefit of justified\n\nSo far as I can see, almost all books and newspapers are justified. My hunch is that sticking to this is not just a matter of conservatism, but that justified text unifies text blocks. With the text blocks unified, the sub-heads and other navigational signals stand out more.\n\nAnother possibility is that the consistent ending location of the line makes it easier for the eye to plan and know when to jump to the next line.\n\nSo it may well be that the stubborn preference for justified text has a basis in readability, and not just aesthetics and habit.\n\nNo doubt the ragged right has more consistent spacing, but with longer lines, as in a book, I personally don't find the spacing of justified lines with hyphenation present any problem as far as readablity. (Hyphenation itself can sometimes slow you down, particularly if there is a lot of it, or across page or column breaks.)\n\nSo it may be that ragged right, at least at longer measures, is more of an aesthetic choice, and the justified more functional.--The opposite of what most here are arguing.\n\nI most often see ragged right in shorter material, such as advertising, where navigation is handled by large spacing and placement, something not so possible in books and newspaper columns, crowded with text.\n\nI don't know whether my hypothesis on the functionality of justified text is correct, but I'd be interested to hear others' views.\n\n"
    },
    {
      "time": "26 Nov 2005 — 7:48am",
      "content": "Stephen-  \nTo my ragged eyes, I don't really sense any significant readability issues in rag vs. justified. \"Of course, how many people actually read the text on websites anyway,\" he said, in a half-heartedly joking sort of way.  \nDK~\n\n"
    },
    {
      "time": "26 Nov 2005 — 9:54am",
      "content": "Worthy of a mention: a combination.  \nThese two examples are taken from c.1840 and c1980.  \nThe idea is that you start off with rag right, and then justify lines which are fairly close to the full measure.\n\n ![](http://web.archive.org/web/20131015171854im_/http:/typophile.com/files/punchCU.jpg)\n  \n\n ![](http://web.archive.org/web/20131015171854im_/http:/typophile.com/files/viking2.jpg)\n  \n\n ![](http://web.archive.org/web/20131015171854im_/http:/typophile.com/files/viking.jpg)\n\n"
    },
    {
      "time": "26 Nov 2005 — 9:29pm",
      "content": "As far as printed matter is concerned, my feeling is that the justification method has only to do with the aesthetic requirements of the text and the physical requirements of the media.\n\nOn the web, however, I would only justify all lines with very short passages where the spacing rendered by various browsers can be somewhat predictable. Here's hoping for better justification controls such as glyph scaling in future implementations of CSS.\n\n"
    },
    {
      "time": "26 Nov 2005 — 10:37pm",
      "content": "\\>Scripts, whether formal or chancery…\n\nI think the monks did a pretty good job of fully justifying using these scripts.\n\nSi\n\n"
    },
    {
      "time": "26 Nov 2005 — 11:44pm",
      "content": "Si - Remember, they were handwritten, not type.\n\n"
    },
    {
      "time": "27 Nov 2005 — 6:55am",
      "content": "Monotype’s original Gill Sans has such loose spacing that using it justified (especially with those horrendous American defaults of Quark’s, eg letterspacing) renders it almost unreadable.\n\n"
    },
    {
      "time": "27 Nov 2005 — 7:07am",
      "content": "bert,\n\nInteresting you should mention letterspacing. If I understand correctly, some DTP software such as Quark or InDesign, goes further than simply varying the spacing between words when justifying text, but also makes subtle changes to the actual spaces between letters. Is anyone else bothered by this?\n\nI have very little experience with Quark/InDesign, so I might be misunderstanding the idea.\n\n"
    },
    {
      "time": "27 Nov 2005 — 8:19am",
      "content": "\"...but also makes subtle changes to the actual spaces between letters....\"\n\nYes, but you have control over it.\n\nChrisL\n\n"
    },
    {
      "time": "27 Nov 2005 — 11:32am",
      "content": "<cite>I think the monks did a pretty good job of fully justifying using these scripts.</cite>\n\nThat's true, but monks would vary the width of glyphs as necessary, in addition to adjusting word and letterspacing. While InDesign's glyph scaling works well for the most part, it usually fails with scripts.\n\n"
    },
    {
      "time": "27 Nov 2005 — 11:57am",
      "content": "Good point William, justified text blocks do give the text the uniformity required for navigational elements to stand out without loosing the subtlety that simple spacing can give.\n\nPlus justified text tends to be more economycal than ragged text.\n\nHéctor\n\n"
    },
    {
      "time": "27 Nov 2005 — 5:59pm",
      "content": "\"Plus justified text tends to be more economycal than ragged text.\"\n\nThat is not really true. It is just an illusion. By adjusting your H&J settings consistantly between rag and justified (except for the justify command of course), you will see the same economy in both. It is actually easier to get more economy out of ragged right text. I have done experiments with my students on this several years ago when I was still teaching.\n\nChrisL\n\n"
    },
    {
      "time": "27 Nov 2005 — 7:10pm",
      "content": "Well, if you adjust spacing in a rag, then you are loosing the main benefit of a rag which is consistent spacing.\n\nHéctor\n\n"
    },
    {
      "time": "28 Nov 2005 — 3:17am",
      "content": "I find that right-ragged text often doesn't work\\* with a paragraph indent so it requires extra leading between paragraphs, and if this is on a two – or more – column grid the space needs to be at least half line space (so that occasionally, at least, the baselines align), ideally the space would be a full line space (on multi-column layouts) so you end up using more space with ragged-right, than you would with justified, indented pargraphs.  \n\\* and reduces the attractiveness of one straight side\n\n\\>monks would vary the width of glyphs as necessary  \nSo did Guttenberg\n\nTim\n\n"
    },
    {
      "time": "28 Nov 2005 — 10:39am",
      "content": "Most newspapers here (in Brazil) use justified text poorly. It may be easier to read and it may unify the text, but it is so badly done that I long for some raggged text every now and then...\n\nah... the beauty of a well-spaced justified text...\n\n"
    },
    {
      "time": "28 Nov 2005 — 2:14pm",
      "content": "I like rag right. This is probably the result of too much exposure to poorly done Justified texts but practically speaking it seems safer/more pleasant for the reader to Rag.\n\nJustification often seems to come about not as a result of desire to serve a reader but because of a twitchy, nervous, oldfashioned, english major-y or just plain compulsive book quoting client who can't be bothered to actually look at something and then trust the evidence of their own eyes. 'It say here that...'\n\nIn general rag seems more serious/less fluffy to me.\n\nI fully believe Justification can be done well, I have been startled by the realization I have been reading well justified text more than once.\n\nBut I don't trust most folks to do it well. Rag right is so practical!\n\nOf course sometimes text has to be Justified because of embdeded cultural reasons or just because you are busy mocking somebody's style to make a point. So intent has a role too.\n\n"
    },
    {
      "time": "6 Dec 2005 — 9:21am",
      "content": "Full justification is Modernist mayhem. Yes, sometimes it works, but all things being equal, rag-right -when done right mind you- is better, simply because it respects the word space (which is much more important than what space is left over at the end of a line). The Ancient Greeks did it very well.\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2005 — 9:44am",
      "content": "\\>Modernist mayhem\n\nLike Guttenberg, Jenson etc., etc.?\n\nAnd is there any evidence that small variations in word spacing slow down reading?\n\n"
    },
    {
      "time": "6 Dec 2005 — 10:19am",
      "content": "Justification avoids the \"interference\" of having shapes and coinicidences occur at the right column edge, which can be a distraction, as the reader will interpret these as potentially significant. And indeed they may be, as statistically a short line tends to indicate a paragraph end.\n\nBy shapes, I mean, for instance, a succession of lines each of which is shorter than the previous, followed by the opposite, creating a concave indent.  \nBy coincidences, I mean, for instance, two lines at full measure, followed by two much shorter lines of equal length.\n\nOf course, these ragged phenomena can be removed by artfully adjusting where word-breaks occur, but that's extra work.\n\n\\*\\*\\*\n\nIt should also be noted that symmetry is aesthetically pleasing, deriving perhaps from the most fundamental level of sexual attraction. Recent research correlating physical symmetry of people's faces against the attractiveness of their pheromones discovered that symmetrical people smell sexier. Or was it that asymmetrical people wash less? Scary stuff.\n\n"
    },
    {
      "time": "6 Dec 2005 — 10:52am",
      "content": "\\> Like Guttenberg, Jenson etc., etc.?\n\nOh yes, all kinds of stuff, since the Romans in fact,  \nwho were the first to really cultivate Modernism.\n\n\\> And is there any evidence that small  \n\\> variations in word spacing slow down reading?\n\nEmpirical evidence? Maybe a little bit, but probably not enough, and not nearly good enough. But considering the model of reading that makes most sense, there's very good reason to believe that varying word spaces hurts a fair amount.\n\nAnd I don't know what \"small\" is here. In fact many justified settings result in spaces that are bigger than some of the [short] words, so not small by any measure.\n\n\\> that’s extra work.\n\nYes. Or: justification is lazy. :-)\n\n\\> symmetry is aesthetically pleasing\n\nBut I think there's a severe limit to that in  \nthe realm of immersion (the subconscious).  \nAlso, variance can be just as pleasing.\n\nBut yes, the correlations to our physical reality  \nare very fascinating, and I feel extremely relevant.\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2005 — 11:07am",
      "content": "Once Hrant has decided to misuse a word, at least he is consistent in his misuse and will not be swayed from it :) Of course, the irony in this case is that 'asymetric typography' and the rejection of justification was the rallying cry and most obvious characteristic of modernist typography.\n\nI often set text ragged-right and then, once all the text is flowed, turn on justification to see how it looks. If it looks good, i.e. even and without significant detriment to word spacing, I keep it justified, otherwise I go back to ragged-right. I don't have an ideological preference for either, but generally agree with those old monks: a nicely square text block is a happy thing, and if you can achieve it without disrupting the appropriate evenness of the word spacing (bearing in mind that we obviously have a tolerance for some variation in word spacing) then it seems merely stylistic not to. As a matter of style, there are certain kinds of texts that I would be inclined to set ragged-right: most correspondence, for example. As a matter of function, type at low resolution such as on websites usually benefits from being ragged-right simply because the pixel grid is too crude to preserve decent word spacing in justified settings.\n\n"
    },
    {
      "time": "6 Dec 2005 — 11:19am",
      "content": "\\> Once Hrant has decided to misuse a word ...\n\nI'm just trying to correct your guys's too-narrow usage! :-)\n\n\\> ‘asymetric typography’ and the rejection of justification  \n\\> was the rallying cry and most obvious characteristic of  \n\\> modernist typography.\n\nI think the most obvious characteristic was Das Grid.  \nAnd don't blame me if their lust to blindly counter  \nprecedent caused them to violate their own ideas!\n\nLittle boys playing.\n\n\\> If it looks good, i.e. even and without significant detriment to word spacing\n\nThe problem is that mere formal aesthetics is no measure of the deeper functionality required; just looking at a gray block says nothing [useful] about what's inside it, about what happens when you actually try to access the content.\n\nAnd when you say \"we obviously have a tolerance for some variation in word spacing\", I would say that sure, we have huge tolerance. We can even read long columns of NotCaslon with a single word on each line. But what is GOOD?\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2005 — 11:24am",
      "content": "\\>the rallying cry and most obvious characteristic of modernist typography.\n\nActually, the initial phase in the 20s and 30s was all justified. As in El Lissitzky's \"Isms of Art\".  \nVery ordered in a de Stijl kind of grid.\n\nHowever, the postwar International Style was all about the rag.\n\n"
    },
    {
      "time": "6 Dec 2005 — 11:51am",
      "content": "Based on carefully weighing (or weighing carefully?) the merits of rag vs. justified, I'll quote Master Gill:\n\n\"Even spacing is of more importance typographically than equal length.  \nEven spacing is a great assistance to easy reading, hence its pleasantness, for the eye is not vexed by the roughness, jerkiness, restlessness and spottiness which uneven spacing entails, \\*even if such things be reduced to a minimum by careful setting.\\*\"\n\nWhile there are some applications for fully-justified text, we might all be better off reading a nice rag.\n\n"
    },
    {
      "time": "6 Dec 2005 — 12:06pm",
      "content": "Gill was da man.\n\nBTW, I'm not opposed to some word-space variation, sometimes.  \nAs long as: it's very small; it's greater than the default, not less;  \nand it helps do something useful, like avoid a given hyphenation,  \nor maybe even make a way-too-short line a bit longer. I just think  \nvarying word-space to enforce a pretty line at the end is dumb.\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2005 — 12:19pm",
      "content": "It's deceptive, hrant, it really is.\n\nI've been reading justified text for most of my life, without ever really noticing it. I've read some ragged-right text, but mostly my own work. It's only now that I'm noticing how much faster and more comfortably I can get through tracts of ragged-right text. Now that I'm paying attention to this weighty subject, I feel cheated. My reading was actually slowed down, and for years on end, through no fault of my own.\n\nI'm horrified to learn that for the better part of my life I've been startlingly less efficient than I could have been.\n\n;-)\n\n"
    },
    {
      "time": "6 Dec 2005 — 12:41pm",
      "content": "My take on justified vs rag type is about industry as much as asthetics. With most of the banks I've had as clients, don't allow hypenation and if you can hypenate a block of copy you better not justify the copy. The other consideration is a good editor. If your copy is creating rivers in your justified text your copywriter or editor should be able to make edits to make the layout work. So (in my opinion) its not a either or but a product of a creative team.\n\n"
    },
    {
      "time": "6 Dec 2005 — 12:57pm",
      "content": "The trick to dealing with rivers: reduce leading.\n\n\\*\\*\\*\n\nFor all those proponents of rag-right:  \nWhy is it that the two most-read forms of publication, newspapers and novels, employ justification? Not only that, but newspapers have always had far too narrow columns for optimum word spacing. But just try and design a newspaper with a rag-right column, and you will be taken for an idiot by both publisher and readers.\n\n"
    },
    {
      "time": "6 Dec 2005 — 1:03pm",
      "content": "Nick isn't that because justified type takes up less space. But I haven't seen a justified newspaper article where there isn't a bad river somewhere due to either word spacing and narrow margin. I still think a creative team would solve the problem.\n\n"
    },
    {
      "time": "6 Dec 2005 — 1:04pm",
      "content": "\\> The trick to dealing with rivers: reduce leading.\n\nInteresting strategy: destroy readability (by making word spaces appear larger than the leading, and reducing reliable line-returns to boot) so people won't realize the problem is the damn Modernist gray square.\n\n\"Even Color, Ohmmm, Even Color, That Is Always The  \nGoal, Ohmmm\" chanted the big-chested but dim blonde.\n\n\\> Why is it that the two most-read forms of publication,  \n\\> newspapers and novels, employ justification?\n\nR[e-r]ead the first thing I wrote in this thread.\n\n\\> you will be taken for an idiot by both publisher and readers.\n\nI didn't realize we were discussing popularity.\n\n--\n\nDan, I agree that teamwork helps a lot; but when the writer is really good at his job, you don't want prettiness messing up the content. When the writer sucks, sure, change his wording to make things less ugly. But that's not the point.\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2005 — 2:03pm",
      "content": "\"isn’t that because justified type takes up less space\"\n\nBut it doesn't. All it does is take the space that would be at the end of a line in rag and spread it out among the word and letterspaces in that line. There is no saving.\n\nChrisL\n\n"
    },
    {
      "time": "6 Dec 2005 — 2:06pm",
      "content": "\"chanted the big-chested but dim blonde\"\n\nmale or female?\n\n"
    },
    {
      "time": "6 Dec 2005 — 2:07pm",
      "content": "The reason most newspapers use justified composition is that they have been doing it that way for ever and are quite used to it and don't ever think about changing. It has nothing to do with Modernism, space-saving, or readability, it is just habit.\n\nChrisL\n\n"
    },
    {
      "time": "6 Dec 2005 — 2:10pm",
      "content": "More importantly:  \n\\> you will be taken for an idiot by both publisher and readers.\n\nYou really think readers would notice, much less have a strong reaction? Readers do react to change, but without considering if the change is good or bad. It's like a knee-jerk reaction, best smiled at and ignored. It's what's happening to readers <cite>in spite of them</cite> that's useful to consider.\n\nBut as for publishers, yes they do grasp the details. The thing is  \nthey might as well shouldn't, since they don't grasp the foundation.\n\n\\> male or female?\n\nI did put an \"e\".  \nBut only because big breasts on a man are... unfashionable.\n\n\\> It has nothing to do with Modernism, space-saving, or readability, it is just habit.\n\nBut I think it's a habit borne of Modernism.\n\nAnd media which are traditionally rag-right could be said to be that way due to a combination of: smart individuals in those fields; and dumb luck.\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2005 — 2:24pm",
      "content": "\"I did put an “e”.  \nBut only because big breasts on a man are… unfashionable.\n\nyou also said chested not breasted  \nmy point is:  \nI'm not amused, and I don't see the need for this kind of thing.\n\n"
    }
  ]
}
