{
  "id": "16390",
  "title": "Prison Tattoo Font-",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "In my never-ending quest to entertain you all, can anyone shed some light on what this font might be? This style of lettering is fairly typical of prison tattoo work. (Obviously, since it's a prison tattoo, it's definitely hand-lettered!!!) But perhaps you could suggest something that's reasonably close to it. Perhaps some of you forum members who are currently behind bars might have a unique insight!  \nThanks, DK~\n\n ![](http://web.archive.org/web/20100312102239im_/http:/typophile.com/files/tattoo.jpg)\n\n",
  "author": "<a href=\"/web/20100312102239/http://typophile.com/user/9426\" title=\"View user profile.\">Da Kine</a>",
  "time": "<br>",
  "uid": "9426",
  "comments": [
    {
      "time": "",
      "content": "\\> Perhaps some of you forum members who are currently behind bars might have a unique insight!\n\nchocolate bar good for you?\n\n"
    },
    {
      "time": "",
      "content": ":^D\n\nThis is hand-lettered.\n\n"
    },
    {
      "time": "",
      "content": "I've watched Ed Benguiat scratch out incredible word doodles in psuedo Edwardian Script using just a ballpoint pen without even spilling his beer!\n\nBoth Tom Carnase and Tony Di Spigna weild mighty quills penning impromtu ornate scripts as well. The beauty of these pieces are that the flourishes are integrated within the characters and words used, which is virtually impossible to create using a type font.\n\nYou can get close using the swirly [ITC Edwardian Script](http://web.archive.org/web/20100312102239/http:/www.myfonts.com/fonts/linotype/itc-edwardian-script/edwardian-scr-itc/index.html).\n\n"
    },
    {
      "time": "",
      "content": "I've always heard that font catalogues are especially favored items inside prison walls, to give tattoo artists a richer typographic library to choose from.\n\n"
    },
    {
      "time": "",
      "content": "Hey, Jared, I'll trade you my old Expertype catalog for a pack of Camels... I'm in cellblock 8.\n\n"
    },
    {
      "time": "",
      "content": "Hmmm... ITC Edwardian Script will probably work if I can get the warden to rough it up a tad!  \nDK~\n\n"
    },
    {
      "time": "",
      "content": "Norbert-  \nMy father, a sign painter by trade, also had a similar talent for effortlessly cranking out graceful script... To watch him do this with a sloppy, wet watercolor brush was quite impressive. Alas, I did not inherit his talent, so digital typography is a fortuitous path for me!  \nDK~\n\n"
    },
    {
      "time": "",
      "content": "Maybe way off here, but Mário Feliciano's [Escrita](http://web.archive.org/web/20100312102239/http:/www.myfonts.com/fonts/t26/escrita/principal/) has a hand-drawn-swash look. It also includes [two fonts](http://web.archive.org/web/20100312102239/http:/www.myfonts.com/fonts/t26/escrita/) for first and last characters.\n\nRob Leuschke's [Carattere](http://web.archive.org/web/20100312102239/http:/www.myfonts.com/fonts/gideon/carattere/regular/) is less rough, but still looks hand drawn.\n\n"
    },
    {
      "time": "",
      "content": "Mike F-  \nThanks much... Escrita might be the one!  \nDK~\n\n"
    }
  ]
}
