{
  "id": "16430",
  "title": "(x) Variation of Helvetica? - Berthold Akzidenz-Grotesk {Yves}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hey . Im new here so be nice ;)\n\nIve narrowed this font down to be a varation of helvetica neue. but look at the letter R and 2 they do not match up.\n\nIve tried the font identificatoor at myfonts.com/whatthefont without luck.\n\nyou guyz are my last hope.\n\n| Attachment | Size |\n| --- | --- |\n| [id2.jpg](http://web.archive.org/web/20110812145229/http:/typophile.com/files/id2.jpg) | 25.48 KB |\n\n",
  "author": "<a href=\"/web/20110812145229/http://typophile.com/user/10287\" title=\"View user profile.\">insearchof</a>",
  "time": "<br>",
  "uid": "10287",
  "comments": [
    {
      "time": "",
      "content": "This is [Berthold Akzidenz-Grotesk](http://web.archive.org/web/20110812145229/http:/www.philsfonts.com/showing.html?sku=BQ901990X1P1&start=1), a precursor to Helvetica and IMHO a much nicer typeface.\n\n"
    },
    {
      "time": "",
      "content": "_\\> Hey . Im new here so be nice ;)_\n\nHey, we _are_ nice! What makes you say that? :^)\n\n"
    },
    {
      "time": "",
      "content": "BTW For a contemporary reworking of the same model take a look at [Christian Schwartz](http://web.archive.org/web/20110812145229/http:/typophile.com/wiki/Christian%20Schwartz)' delightful [FF Bau](http://web.archive.org/web/20110812145229/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=FF.11312.0.0).\n\n"
    },
    {
      "time": "",
      "content": "oh man. ive used that font so many times.  \nthis imbarsing.\n\nwhatever i can do to repay you. Name it. within limits ofcourse.\n\n"
    },
    {
      "time": "",
      "content": "Yves just demands that you use alternate faces to Helvetica ;o)\n\n"
    },
    {
      "time": "",
      "content": "You got it, David.\n\n"
    },
    {
      "time": "",
      "content": "_\\> Whatever I can do to repay you. Name it. Within limits of course._\n\nI could do with a 25th and 26th hour to each day till December 3rd pretty badly. Anything you can arrange? ;^)\n\nDavid, you're dead on. My take on Helvetica is if you're gonna use it you'd better have a _damn_ good reason. :^/\n\n"
    },
    {
      "time": "",
      "content": "I remember your shirt from TypeCon, and think about it every time I have to use it at work <cite>just</cite> because it's in the Artist Font Set. :-/\n\n"
    },
    {
      "time": "",
      "content": "found another varition that i aslo could use its from my personal stash:\n\nAkkurat designed by Laurenz Brunner.\n\npeace.\n\nabout that extra hour. it canot be arranged but if u ever need a font or summin then i can help.\n\n"
    },
    {
      "time": "",
      "content": "_\\>if u ever need a font or summin then i can help._\n\nI have to warn you there's a very strict policy about that on Typophile. No font piracy allowed here -- you can't do anything that violates the End User License Agreement. So no swapping or giving away fonts.\n\n"
    },
    {
      "time": "",
      "content": "haha as if you would ever need one, Yves...I'm sure your collection is huge! (and growing all the time)\n\n"
    },
    {
      "time": "",
      "content": "Actually it isn't huge at all. I do have a Bitstream Collection on CD-ROM, but for the rest it's a hand-picked compact selection. As my independent design business is pretty low-scale, I can't really go wild on licensing type unfortunately. Furthermore I finally did the right thing a couple of years ago and removed all and any fonts that weren't duly licensed (we're not talking libraries here, just a couple of families that I had \"lying about\"). Apart from the odd family that I need to finish something at home for my daytime job and that gets deleted after the job is done, my computer is clean.\n\nI do get type for my reviews on an occasional basis, but I take great care to remove all files after the review has been published or even earlier if the review license stipulates so (for example Typothèque review licenses are limited to 7 days).\n\n"
    },
    {
      "time": "",
      "content": "Ah, yeah I forgot about this...the fact that your review licenses are only short term. If that wasn't the case then I would be right! :o) There's a few faces I'd love to have but can't afford right now, specifically the faces of the Underware crew. I'll just have to wait till I get in a paid design position/out of school!\n\n"
    },
    {
      "time": "",
      "content": "I was talking about freefonts ofcourse. But common that speech about your clean pc. \"chough cough\"\n\nIf you said u have alot of typedesign and that if you use it for a client then you purchase the font. then i would belive you.\n\nthats what i do anyway. I mean if i didnt have the font in the firstplace i wouldnt know if it would work with the poster my cliented wanted designed. that way the original typedesigner would get nothing.\n\nSo pay for what you use thats my philosphy.\n\nbut sure i wont share any fonts with users here. ofcourse . And i understand why we cant. it would be chaos if we did . and it would be the general understanding that people dont pay for fonts bc they are free.\n\nand thats not gd.\n\n"
    },
    {
      "time": "",
      "content": "<cite>I was talking about freefonts ofcourse. But common that speech about your clean pc. “chough cough”</cite>\n\nYou obviously don't know who you're talking to here. There was even an interview with Yves at TypeCon this year on Type Radio where they asked him about his type collection. There is no reason why he would lie about cleaning his computer of faces that he hadn't properly licensed...end of story.\n\nYou'll find that this community is pretty tight knit and a lot of the members know each other in real life, have met through the board or have become friends through typography conferences such as TypeCon and ATypI. This is not a place to come in and throw your weight around when you are unaware of who you are talking to. The respect and massive knowledge base of the users, of which many are professionals in the field of design or type design, here is what brings us together...there's no need to try and discredit the other designers/typophiles here. This is my opinion anyways and I know you're new so I think this is a good way to inform you for your future stay here at Typophile! If you write coherently too, it helps us understand.\n\n"
    },
    {
      "time": "",
      "content": "Yeah its nice to shed light on this subject. But my point about if you have fonts you use them more is valid. atleast in my case and my design friends.\n\nExample:\n\nI had a client that i did some identity redesign for and i gave them 2 examples of fonts to use. dax wide and prokyon. Overused fonts i know, but they usualy impress clients. so i told them the price tag of the two. and i said if you want me to use this in your design you have to pay for the license of eighter one. Then i showed them the same identity design with another free font and they got the point.\n\nWhat happened here. well 2 things basicly. the fontdesigner got payed and i futhered my design career.\n\nIf i didnt have thouse fonts installed id never know if they would work on just that design. would I?\n\nId like your take on this sistuation. david and bald condensed.\n\nOh yeah. i bet David is american. Sounds like it.\n\nYours in faith insearchof\n\n"
    },
    {
      "time": "",
      "content": "\\> you can’t do anything that violates the End User License Agreement.\n\nI wouldn't go that far. After all, font houses don't have the monopoly on ethics (in fact historically their record has been pretty poor, as Yves himself will point out).\n\nBut yeah, don't share fonts.\n\nhhp\n\n"
    }
  ]
}
