{
  "id": "16439",
  "title": "Proyecto DEMO",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everybody\n\nI and a friend are gathering a bunch of chilean and some select international group (Matthew Carter, Milton Glaser, Nick Shinn, Underware, Gerard Unger, Gabriel Martinez Meave, Eduardo Omine, Akira Kobayashi, Xavier Dupre, Christian Schwartz, Andreu Balius, and more) to participate un PROYECTO DEMO.\n\nIs the first DEMO and for this first time qe are celebrating the font \"Australis\" by Francisco Gálvez, the same one that won the MORISAWA contest on 2002.\n\nwe have allready 136 designers, and everyone is making a 13x15 cms artwork to publish on a 16x16cms book in 2 colors, we want to show in a short future all the works in the DEMO website [www.proyectodemo.cl](http://web.archive.org/web/20150419081913/http:/www.proyectodemo.cl/ \"www.proyectodemo.cl\"), i will anounce it when it reafy.\n\nbye\n\nCristian Gonzalez Saiz\n\n| Attachment | Size |\n| --- | --- |\n| [DEMO.jpg](http://web.archive.org/web/20150419081913/http:/typophile.com/files/DEMO.jpg) | 55.8 KB |\n\n",
  "author": "cgonzalez",
  "time": "25 Nov 2005 — 6:26am",
  "uid": "659",
  "comments": [
    {
      "time": "25 Nov 2005 — 7:29am",
      "content": "The book have an extensive critique of Alejandro Lo Celso, (Matthew Carter recognition in the same Morisawa contest), and 12 pages from Francisco Galvez developing the complete \"Australis\" with all the variants. (bold, italic, small caps, and swash italic).\n\nall the texts of the book will be translated to english.\n\nCG\n\n"
    },
    {
      "time": "3 Dec 2005 — 9:49am",
      "content": "This sounds pretty interesting!  \nAlthough I don't actually get exactly what it is...  \nYou have 136 designers making layouts with Australis?!\n\nAnd about when is it coming out?\n\nhhp\n\n"
    },
    {
      "time": "28 Dec 2005 — 10:17am",
      "content": "When (and where) is the party? : D\n\n"
    },
    {
      "time": "21 Apr 2006 — 9:30am",
      "content": "Cristian, please contact me (eduardo at omine dot net). I've tried to contact you through your personal profile and also through your proyectodemo.cl email account, with no success.\n\n-- [omine.net](http://web.archive.org/web/20150419081913/http:/www.omine.net/)\n\n"
    }
  ]
}
