{
  "id": "16447",
  "title": "RUBIK'S CUBE BOOK",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hello there,  \n I've been working on a project for school. I've taken the Rubiks Cube and the History of the project and created alittle booklet. I would really appreciate any advice or constructive criticism.  \nI've enclosed a PDF of the book.\n\nthanks!!\n\n| Attachment | Size |\n| --- | --- |\n| [RUBIKS CUBE\\_r4.pdf](http://web.archive.org/web/20121128173827/http:/typophile.com/files/RUBIKS%20CUBE_r4.pdf) | 78.16 KB |\n\n",
  "author": "wandar",
  "time": "25 Nov 2005 — 8:41pm",
  "uid": "742",
  "comments": [
    {
      "time": "26 Nov 2005 — 3:12am",
      "content": "I think you could try using only the Rotis family for your book, it has something to do with Math too. The text which is now inside the ‘I’ in the cover looks like in a “refugee” place, you can consider a tiny line of text under the square compostion; regarding this, as I can see you did for the ‘C’, the same thing needs to be applied on “B, S’ because of their round shapes, so it is enough you move the ‘E’ to the left a little bit. I like the cube apostrophe. The opening page also needs work, maybe you want “By Mary Bellis” to be on the right, for sure your book should start on page 3, the one you or the software called page 4 on your spread.\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "26 Nov 2005 — 6:03pm",
      "content": "Thanks for your comments.  \nAny more would be appreciated.\n\n"
    },
    {
      "time": "27 Nov 2005 — 4:12am",
      "content": "You are welcome. I could write you more if you feel like to change and post a revised version of your work.\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "27 Nov 2005 — 11:06am",
      "content": "I would really appreciate it. A revised book would be great to look at and study.  \nOnce again, thank you.\n\n"
    },
    {
      "time": "27 Nov 2005 — 11:06am",
      "content": "anymore criticism would really help.\n\n"
    },
    {
      "time": "27 Nov 2005 — 11:10am",
      "content": "I was thinking of applying this book to the product and packaging.  \nI would redesign the existing packaging and, this booklet (alot smaller, maybe alittle larger then the actual cube) would be like an insert. I would have to edit the text alittle and maybe include some world records that i found online. Maybe even have a page where the customer would enter the time that they attempted to solve the cube.\n\nThis would give a purpose for the book.\n\nThanks alot for all your comments.\n\n"
    },
    {
      "time": "27 Nov 2005 — 12:38pm",
      "content": "A page where the customer would enter the cube solving time would lead your book toward those publications called \"Activity Book\", so it is a good design idea. You can also check my handout on \"Games & Learning\" :  \n [http://www.bilkent.edu.tr/~segalini/Games\\_and\\_Learning.pdf](http://web.archive.org/web/20121128173827/http:/www.bilkent.edu.tr/~segalini/Games_and_Learning.pdf \"http://www.bilkent.edu.tr/~segalini/Games\\_and\\_Learning.pdf\")\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "27 Nov 2005 — 12:55pm",
      "content": "I've download and will look through it.\n\n"
    },
    {
      "time": "27 Nov 2005 — 3:03pm",
      "content": "Where's the little bear?\n\n(Check your grid, baselines don't appear to be aligned.)\n\n"
    },
    {
      "time": "28 Nov 2005 — 8:03am",
      "content": "Here is mine : [http://www.bilkent.edu.tr/~segalini/stuff/Lino.jpg](http://web.archive.org/web/20121128173827/http:/www.bilkent.edu.tr/~segalini/stuff/Lino.jpg \"http://www.bilkent.edu.tr/~segalini/stuff/Lino.jpg\")  \nLino lives with me in the East Campus but that picture was taken  \nin our apartment in Rome, he seems to miss it.\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "28 Nov 2005 — 8:20am",
      "content": "Alessandro’s Cub doesn’t look puzzled at all.\n\n"
    },
    {
      "time": "28 Nov 2005 — 11:51am",
      "content": "If we are typophile, you should use the right accents for the hungarian word:  \nBűvös Kocka  \n(i hope you will see them right)\n\nNice job anyway\n\n"
    },
    {
      "time": "28 Nov 2005 — 12:52pm",
      "content": "Right. I found a page, [http://www.vttoth.com/buvkocka.htm](http://web.archive.org/web/20121128173827/http:/www.vttoth.com/buvkocka.htm \"http://www.vttoth.com/buvkocka.htm\") -  \nand do you know this friend of mine Mr. Nyikos Gergely ? [http://www.spidron.hu/](http://web.archive.org/web/20121128173827/http:/www.spidron.hu/ \"http://www.spidron.hu/\")\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "28 Nov 2005 — 1:15pm",
      "content": "Actually, I'm about to visit spidron's exhibtion in Budapest dear Alessandro!\n\nBTW what makes you think i'm a Mr.?\n\n"
    },
    {
      "time": "28 Nov 2005 — 2:55pm",
      "content": "Sorry, I thought of the story of Santa Claus you know the tale of St. Nicholas,  \na bishop who lived in Turkey during the fourth century.  \nPlease say hello to Dániel if you meet him !\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "28 Nov 2005 — 8:23pm",
      "content": "love this project of yours. I would love to see those combinations that just get under your skin.like when everything's matched up except for one peice.. also kinda cool to see it in mid-turn. can the typography find a way to be 3dimensional, a little enigmatic? peeled? (homage the cheaters). maybe throw in overtly 'geeky' typefaces.\n\nwaay cool. cheers!\n\n"
    },
    {
      "time": "29 Nov 2005 — 7:57am",
      "content": "Thanks!!!  \nConcentrating on also the packaging and including this booklet ( in a smaller size). It will utimately contain a brie history, world records and a page for the consumer to write and keep track of their attempts.\n\nThanks for all the suggestions. I appreciate it.\n\n"
    }
  ]
}
