{
  "id": "16445",
  "title": "Car company logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "hello! First time poster...long time lurker!\n\n[http://img123.imageshack.us/img123/5489/logocolors2tf.jpg](http://web.archive.org/web/20140905074208/http:/img123.imageshack.us/img123/5489/logocolors2tf.jpg \"http://img123.imageshack.us/img123/5489/logocolors2tf.jpg\")\n\nClass project. Logo is for a new (made up) hybrid car company. The name unity shows the mingling of the gas and electric power of the cars. The type is something i drew and then scanned and cleaned up in illustrator. This is my first logo/identity that ive done!\n\nAny suggestions/coments/critique/ripping me a new one/ are welcome! I want to learn and get better! Thanks for your time!\n\n",
  "author": "nebrow",
  "time": "25 Nov 2005 — 4:03pm",
  "uid": "10308",
  "comments": [
    {
      "time": "25 Nov 2005 — 4:34pm",
      "content": "There's something off in the transitions from staight to curve in the actual logo, and in the logotype the I and T are too dark. The TY connection is also a bit awkward, and the bowl of the Y feels a bit odd as well. I'm not completely sold on the type, but the logo itself is a strong start. However, at a small size the logo (on its own) may begin to look like an @ glyph. For a first shot at an identity design this is strong work.\n\n"
    },
    {
      "time": "27 Nov 2005 — 4:18am",
      "content": "You might also make the N taller. The curved N looks shorter that the other characters although mechanially correct. This is a case where you have to compensate optically.\n\n"
    },
    {
      "time": "27 Nov 2005 — 7:59pm",
      "content": "Try to give more breathing room around each logo when presenting them like that. But other than that, nice start. One thing- I'm bugged by the hole between the I and the T.\n\n"
    },
    {
      "time": "27 Nov 2005 — 8:12pm",
      "content": "Like the above statements I feel that you need to refine the logotype before you start trying to present it with a mark as a brand. Good start though, heed the suggestions you get here. :)\n\n"
    },
    {
      "time": "27 Nov 2005 — 8:12pm",
      "content": "Like the above statements I feel that you need to refine the logotype before you start trying to present it with a mark as a brand. Good start though, heed the suggestions you get here. :)\n\n"
    },
    {
      "time": "30 Nov 2005 — 1:12am",
      "content": "Nice work nebrow I really like the way you conceptualized the overall theme of the brand, however I wanted to share two quick opinions I have from a purely psychological point of view.\n\nFirstly, I am not completely sold on the idea of using an oblique typeface for the branding of a car manufacturer. Aside from Range Rover I can't think of many automotive brands that make use of oblique typefaces. You really need to consider the characteristics of the cars the company would be selling. Perhaps if the cars were really fast you could use a heavily italicized typeface to insinuate speed but the typeface you're using is neither here nor there. Personally I think the type would be stronger if it wasn't oblique.\n\nSecondly the colours you're using are too bright and cheerful. I do understand that the manufacturer is supposed to produce hybrid cars but right now it feels more like you're creating something for a candy company rather than a car manufacturer. While green, orange and blue are great colours for the theme you could try picking chromatic grays of those hues.\n\nAs Jason said as a first attempt the logo is quite impressive, and shows loads of potential. Keep working on it and you should have quite a strong identity by the end.\n\n-mmilo\n\n"
    },
    {
      "time": "12 Dec 2005 — 6:23pm",
      "content": "Agreed with above as well. I'm also getting a Hurricane feeling from the icon. I'm certain the cyclical nature of the icon is to show renewal, just getting 'tropical storm warning' from it.\n\nIf there were a way to break up the symmetry just a bit?\n\n-Jac\n\nPronounced by saying 'Jake' without conjuring imagery of lumberjacks or mans best friend.\n\n"
    }
  ]
}
