{
  "id": "16474",
  "title": "Modestly-priced alternatives to DTL and Enschedé Font Foundry fonts?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi. First-time poster here.\n\nI'm not a designer or typographer, just someone who would like his personal correspondence to have a some style. I'm looking for a high-quality serif and am an admirer of Enschedé Font Foundry fonts like Collis and Trinité and DTL fonts like Albertina. The problem with these, as many of you know, is that they are priced in the stratosphere, way out of the price range of the casual user like me.\n\nI'm looking for something with a similar no-nonsense, high-quality look but priced no higher than around $300.00 for the family. So far, I've seen a few things I like such as [Dolly](http://web.archive.org/web/20120103162913/http:/www.underware.nl/site2/index.php3?id1=dolly&id2=overview) [Underware], [Dederon Serif](http://web.archive.org/web/20120103162913/http:/www.suitcasetype.com/page.php?lmut=en&section=font&font=dederon%20Serif%20Std%20OT) [Suitcase Type Foundry], and especially [Andulka Pro](http://web.archive.org/web/20120103162913/http:/www.stormtype.com/andulka.html) [StormType Foundry] but I'd like to make sure I'm not overlooking anything before I part with my pennies.\n\nAny others that should be on my radar?\n\nDRR\n\n",
  "author": "<a href=\"/web/20120103162913/http://typophile.com/user/10238\" title=\"View user profile.\">DRR</a>",
  "time": "<br>",
  "uid": "10238",
  "comments": [
    {
      "time": "",
      "content": "Well, so many kinds of serifs to choose from . . .\n\nYou won't go wrong with StormType. Check out their Open Library collection. John Baskerville and Andulka Pro are very well done. Their Open Library seems reasonably priced and contains everything you'll ever need.\n\nScala (and Scala Sans) from FontFont (designed by Martin majoor) is one of the most versatile font families out there. The serif is warm, inviting, and eminently readable.\n\nFF Quadraat and Quadraat Sans were desgined by Fred Smeijers, a designer for Enschede (I think), and it is available from FontFont. Another Dutch masterpiece that seems affordable.\n\nTo be honest, I'm more impressed with StormType and FontFont wares than those offered by Enschede or DTL.\n\nIn fact, here's a list of my top 12 favourite serifs (in no particular order.) You're bound to find something you like here:\n\nScala (FontFont)  \nJoanna MT std. (Adobe)  \nAndulka (StormType)  \nPalatino LT std. (Adobe)  \nNexus (FontFont)  \nParango (FontFont)  \nDante MT std. (Adobe)  \nJohn Baskerville (StormType)  \nJannon (StormType)  \nQuadraat (FontFont)  \nWarnock Pro (Adobe)  \nRegent II (StormType)\n\nHonourable mention (exceedingly beautiful and well-crafted, but a bit overwhelming for long tracts of text):\n\nRequiem (Hoefler & Frere-Jones)  \nRialto (DF Type)\n\n"
    },
    {
      "time": "",
      "content": "Monotype has a decent [Albertina](http://web.archive.org/web/20120103162913/http:/www.fontshop.com/showfont.cfm?fid=M.100709.0.0). $225 for 18 styles.\n\nAs for Dutch stuff, I am a big fan of Gerard Unger's [Hollander](http://web.archive.org/web/20120103162913/http:/www.fontshop.com/showfont.cfm?fid=M.100709.0.0), [Oranda](http://web.archive.org/web/20120103162913/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=oranda), and [Swift](http://web.archive.org/web/20120103162913/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=swift).  \nAlso, Fred Smeijers' [Fresco](http://web.archive.org/web/20120103162913/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=fresco) and [FF Quadraat](http://web.archive.org/web/20120103162913/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=quadraat).\n\n"
    },
    {
      "time": "",
      "content": "May I also ask why the TEFF fonts are so highly priced?\n\n"
    },
    {
      "time": "",
      "content": "I haven't heard an official statement, but I assume TEFF feels their fonts are priced what they are worth. Like The Foundry of UK, they are seeking a certain segment of the market. Think Mercedes vs. Chevrolet.\n\n"
    },
    {
      "time": "",
      "content": "I have the Enschede's specimen and sample for Collis which is a very unique typeface: It is very good looking and a workhorse face which comes with such refinements as a complementary font with specially accendet caps for tight leading.\n\nVery few condensed faces do good jobs in extended settings, but Collis is the only of this kind which I know to be excelent. If I had a chance I would buy it.\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "The fonts I listed are all of superb quality, make no mistake, and are generally aknowledged as such by the typeface community. Although they are not cheap, they are quite comparable to TEFF faces both in breadth of application and letterform quality. The real difference is, is that they are more affordable.\n\nThe work that went into StormType's John Baskerville, for instance, easily rivals the most extensive (and expensive) TEFF font family. Scala (along with its sans partner) is another example: you'd be hard=pressed to find a more legible, versatile typeface that is still interesting without being distracting.\n\nI'm not saying you shouldn't own Trinite or Renard (the latter of which is probably their only face, aside from Lexicon, that is comfortable to read in long tracts of text), but rather that TEFF prices their fonts with a particular market in mind, and not necessarily according to how much work/effort went into producing it. It is neither right or wrong, just a way of doing business.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the recommendations. I've seen most of these already but there were a couple mentioned that I'll look into before making a final decision.\n\nI had seen the Monotype Albertina and wondered what difference, if any other than price, there is between this and the DTL version. Any insight on this?\n\n"
    },
    {
      "time": "",
      "content": "I have Monotype's Albertina. Looking at the PDF samples of DTL Albertina, I can discern no difference between them. Maybe I'm not very discerning.\n\nAnother recommendation: OurType's Arnhem. ( [www.ourtype.be](http://web.archive.org/web/20120103162913/http:/www.ourtype.be/ \"www.ourtype.be\"))\n\n"
    },
    {
      "time": "",
      "content": "Apropos, very interesting:\n\n[http://www.daidala.com/20jun2002.html](http://web.archive.org/web/20120103162913/http:/www.daidala.com/20jun2002.html \"http://www.daidala.com/20jun2002.html\")\n\n"
    },
    {
      "time": "",
      "content": "Quadraat was originally designed to be the house font of  \nsome Dutch studio or something. But when it didn't work  \nout, it became a retail FontFont font.... font... font.. font.\n\nBTW, are DTL Albertina & MT Albertina, and  \nDTL Haarlemmer & MT Haarlemmer really identical?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I believe the 2 Haarlemmers are actually identical, which is very odd, but DTL actually took on re-drawing Albertina for digital release, so that version might be considered more definitive. I've heard some say the earlier digital Albertina was too thin and washed-out, so it might please the letterpress hardliners.\n\nThe TEFF faces I'd really like to be able to afford are Lexicon and Trinité. They perform so amazingly in text.\n\n"
    },
    {
      "time": "",
      "content": "Update: I have discovered that Monotype and DTL collaborated on the digital revivals of both Albertina and Haarlemmer. Frank Blokland oversaw both projects. Both were originally developed by Monotype, and DTL did the production, so that would explain their release by both companies. Both are considered definitive, as Blokland was able to return to the designers' original drawings, which were considerably altered to fit Monotype's unit system when produced originally.\n\n"
    },
    {
      "time": "",
      "content": "Thanks Carl. Seems you've got the big price advantage on that one!\n\n"
    },
    {
      "time": "",
      "content": "Following this thread, I would just like to add a general recommendation for Undeware's Dolly, an excellent text font, and one which is not overly expensive. If one is looking for a very inexpensive text font, why not try [http://www.stormtype.com/free.html](http://web.archive.org/web/20120103162913/http:/www.stormtype.com/free.html \"http://www.stormtype.com/free.html\"), and test their Lido. I echo the general feeling that TEFF fonts are incredibly expensive, however it really is a case of market strategy. I believe for example that Cambridge University Press bought licenses for Trinty: in the right hands, this will surely enhance the quality of their typesetting. However for small and/or independent design studios, it is almost impossible to offer one's self such luxuries. Might anyone know whether MT Haarlemmer will be available from philsfonts or similar vendors ?\n\n"
    },
    {
      "time": "",
      "content": "[Haarlemmer](http://web.archive.org/web/20120103162913/http:/www.fontshop.com/showfont.cfm?fid=M.108924.0.0) at FontShop.\n\n"
    },
    {
      "time": "",
      "content": "I almost forgot I found out about [Cartier](http://web.archive.org/web/20120103162913/http:/www.myfonts.com/fonts/agfa/cartier-book/regular/) in another thread. It looks like Collis a lot.\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "Note: Cartier was (originally) designed when Christoph Noordzij was 10.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Thanks indeed, Stephen.\n\n"
    },
    {
      "time": "",
      "content": "Maybe Delicato or Tarocco could do the trick?\n\n[Http://www.macrhino.com](http://www.macrhino.com \"Http://www.macrhino.com\")\n\n"
    }
  ]
}
