{
  "id": "16483",
  "title": "Gentium: Current version re-released under the SIL Open Font License",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20070808225715/http:/typophile.com/user/7006 \"View user profile.\") : 28.Nov.2005 6.46am \n\nDear friends of Gentium,\n\nWe’re thrilled to announce that we have re-released Gentium under a  \nfree/open-source license - the SIL Open Font License (OFL). This will  \ngive  \nmuch greater freedom to everyone using the fonts, and allow for easier  \ninclusion in free, open-source and commercial software packages.\n\nThe only changes we’ve made in addition to the licensing change were a  \ncouple of bug fixes releated to PostScript glyph names and to the  \nreported  \nitalic angle.\n\nAll of this can be found at\n\n[http://scripts.sil.org/gentium](http://web.archive.org/web/20070808225715/http:/scripts.sil.org/gentium \"http://scripts.sil.org/gentium\")\n\nWe know that many of you have been waiting for eons for Bold and Bold  \nItalic, more ancient Greek letters (like the digamma), etc. We have  \nbeen  \nworking on these (very sporadically) over the last couple of years, but  \nthey’re not ready yet. We hope to have a greatly improved set of  \nRegular and  \nItalic out mid next year, and then work on completing the additional  \nweights.\n\nIn the meantime, if the lack of one letter is hindering you, the OFL  \nnow  \ngives you the freedom to change the fonts, and even distribute modified  \nversions - with some conditions. We also warmly welcome your  \nsubmissions of  \nwork to be included in the main Gentium project. See the Status page on  \nthe  \nweb site for details.\n\nThanks for your continued interest in Gentium.\n\nVictor Gaultney  \nGentium /at/ sil.org\n\n",
  "author": "<a href=\"http://web.archive.org/web/20070808225715/http:/typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 28.Nov.2005 6.46am",
  "uid": "7006",
  "comments": [

  ]
}
