{
  "id": "1650",
  "title": "Cobalt Data Business Card Design",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Ok, here we are. To say I am having trouble formulating any half way good ideas on this project would be an understatment.   \n   \n [http://www.kylehildebrant.com/downloads/cd\\_business\\_card.pdf](http://web.archive.org/web/20131017074500/http:/www.kylehildebrant.com/downloads/cd_business_card.pdf)   \n   \nIf you reference this thread: [http://www.typophile.com/forums/messages/4100/16215.html?1063976534](http://web.archive.org/web/20131017074500/http:/www.typophile.com/forums/messages/4100/16215.html?1063976534)   \n   \nYou might have a little beter understanding of the logo and such.   \n   \nKeep in mind that the colors in the .PDF came out quite washed out (the joys of illustrator), if you reference the PMS, you might get a more accurate feel for the colors.   \n   \nSuggestions Please!!!   \n   \nHildebrant.\n\n",
  "author": "Hildebrant",
  "time": "15 Oct 2003 — 12:05am",
  "uid": "1286",
  "comments": [
    {
      "time": "15 Oct 2003 — 12:50am",
      "content": "Kyle - main problem, imho, is the little digital doodads   \nthat you created. For lack of a better description,   \nthey are like little digital sperm rising up, ready   \nto overthrow Cobalt Data.   \n   \nI think what you have looks better standing alone.   \n   \nIf the client insists on another element...   \n   \nYou might check with a stock-image provider and type   \nin words such as \"database\" \"network\" \"digital\" etc.   \nWith such a raster element you could have a background   \nthat uses a diffusion dither approach with a subtle   \n5- to 10-percent tint variant.   \n(bitmap tiffs are color-changeable when placed in Illustrator)   \n   \nanother idea to try is to use those little doodads   \nwithin the letters of Cobalt Data as digital connectors...   \ni'm guessing it'll probably be over the top in a comic   \nbook kinda way, but it might be worth exploring...if   \nthe client wants to you to go there.   \n   \nbj\n\n"
    },
    {
      "time": "15 Oct 2003 — 9:39am",
      "content": "\\> they are like little digital sperm rising up   \n   \nHaha, I never saw that. I see how they could be construde as such, especially by one such as yourself. ;)   \n   \nI hate doing this \"techy\" type design. I'm so bad in this arena, the tech thing just does nothing for me.   \n   \nhildebrant.\n\n"
    },
    {
      "time": "16 Oct 2003 — 8:53am",
      "content": "Looks great to me.   \nI agree with bj about that \"sperm thing\".   \nI would take it out completely. Will look cleaner   \nand will give more emphasis to the logo.   \nAnd center the logo optically not mathematically.   \n(just move it up a little) Look like it is falling domn now.\n\n"
    }
  ]
}
