{
  "id": "16512",
  "title": "Book release: \"The Work of Ismar David\"",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": " **_The Work of Ismar David_ is a showcase of graphic design, book arts, and architectural design**  \nA key RIT graphic arts collection is celebrated in a new book.\n\nIsmar David (1910–1996), an artist of extraordinary range and ability, mastered a variety of media during the course of his long career in Berlin, Jerusalem, and New York. In tribute to his achievements, RIT Cary Graphic Arts Press has now published _The Work of Ismar David_—the first comprehensive volume on the designer’s oeuvre—that includes vivid reproductions of his book and type design, illustration, calligraphy, and architectural adornment. Content for the book was selected from the extensive Ismar David Archive, held in the [Melbert B. Cary Jr. Graphic Arts Collection](http://web.archive.org/web/20150124113051/http:/typophile.com/wiki/Melbert%20B.%20Cary%20Jr.%20Graphic%20Arts%20Collection) at Rochester Institute of Technology ( [RIT](http://web.archive.org/web/20150124113051/http:/typophile.com/wiki/RIT)).\n\nAcclaimed typographer [Hermann Zapf](http://web.archive.org/web/20150124113051/http:/typophile.com/wiki/Hermann%20Zapf) has written, “The work of Ismar David can always be identified by his characteristic style. . . His expressive drawings, with their undulating linear quality and unusual construction, show his elegant style in every detail.” The book features over 150 examples of his work, often embellished with beautiful lettering and calligraphy, which David executed for private commissions and corporate clients alike. Of special note are showings of his major typeface design, “David Hebrew,” originally issued in the 1950s by the Intertype and Stempel type foundries.\n\n_The Work of Ismar David_ includes an extensive color plate section, as well as an authoritative biographical sketch of the artist, written by Helen Brandshaft. The book concludes with a selected list of American architectural sites containing David’s work, and a meticulous 15-page bibliography of his known book projects. Research for the book was carried out at the Cary Graphic Arts Collection, which holds numerous important Design Archives. To download a finding aid to the contents of the Cary Collection’s Ismar David Archive, visit: [http://library.rit.edu/cary/CCpages/CCAids.html](http://web.archive.org/web/20150124113051/http:/library.rit.edu/cary/CCpages/CCAids.html \"http://library.rit.edu/cary/CCpages/CCAids.html\") .\n\n_The Work of Ismar David_  \nSelected by Helen Brandshaft, edited by David Pankow  \nRIT Cary Graphic Arts Press, 2005  \nPaperback, 160 pages; color ill., 8 x 11 in.  \nISBN 0-9759651-2-3, $29.95  \nOrder from [http://library.rit.edu/cary/carypress.html](http://web.archive.org/web/20150124113051/http:/library.rit.edu/cary/carypress.html \"http://library.rit.edu/cary/carypress.html\")\n\nHelen Brandshaft collaborated on several design projects with Ismar David—among them are editions of The Family Haggadah for Passover, and The Book of Jonah. She runs the Shunammite Press in New York City.\n\nDavid Pankow is the curator of the Melbert B. Cary, Jr. Graphic Arts Collection, and currently edits the scholarly journal, Printing History, published by the American Printing History Association. He is also a professor in the RIT School of Print Media.\n\nRIT Cary Graphic Arts Press is the publication arm of the Melbert B. Cary, Jr. Graphic Arts Collection at Rochester Institute of Technology, a renowned resource for those studying printing history, bookbinding, typography, papermaking, calligraphy, and book illustration processes.\n\n ![](http://web.archive.org/web/20150124113051im_/http:/typophile.com/files/DavidCoverLG.jpg)\n\n",
  "author": "marnie",
  "time": "29 Nov 2005 — 8:33am",
  "uid": "6115",
  "comments": [

  ]
}
