{
  "id": "1653",
  "title": "Which typeface to use for Bodoni term paper?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello Gang,   \n   \nI'm going to be writing a 1,500 word term paper on Biambattista Bodoni. I've thought about setting the type in Bodoni but the contrast of the typeface dazzles the eyes. What would be an appropriate typeface for a text about Bodoni? What would be an appropriate style for designing the page? thanks.\n\n",
  "author": "clearbolt",
  "time": "15 Oct 2003 — 6:23am",
  "uid": "2418",
  "comments": [
    {
      "time": "15 Oct 2003 — 6:51am",
      "content": "I'm not sure as I never used it, but I think ITC Bodoni 12 (or even 6) would be a good choice.\n\n"
    },
    {
      "time": "15 Oct 2003 — 7:17am",
      "content": "[http://www.typophile.com/forums/messages/30/13805.html](http://web.archive.org/web/20131019052212/http:/www.typophile.com/forums/messages/30/13805.html)   \n   \nor try filosofia   \n [http://www.emigre.com/EFfeature.php?di=97](http://web.archive.org/web/20131019052212/http:/www.emigre.com/EFfeature.php?di=97)\n\n"
    },
    {
      "time": "15 Oct 2003 — 11:04am",
      "content": "my original idea was to NOT use bodoni. are these versions of bodoni optomized for use in body copy? i have ITC bodoni but it doesnt look too great when i set an entire paper with it. too much contrast in the letters! is there another typeface that i could use that wont be irrelevant to Bodoni himself?\n\n"
    },
    {
      "time": "15 Oct 2003 — 11:12am",
      "content": "What about a Didot? ;-\\>   \n   \nActually, some Bodonis (like the ITC - but make sure you use the \"12\" version, or maybe even the \"6\" at like 10 point) work OK for short text. But if you wanted a highly readable font that's related, try a Baskerville: that was Giambatista's original inspiration.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Oct 2003 — 11:37am",
      "content": "While I was researching those funky Deberny fonts (see the Javal thread), I read up on all the \"transitional\" material I have handy, and I think all of them (or at least those that go into any depth about Bodoni) mention that he was basically enamored with Baskerville's work. He even tried to make a trip to Britain to meet him in person, but fell ill along the way. My references would include Lawson's \"Anatomy\" for example.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Oct 2003 — 12:23pm",
      "content": "I believe Meggs mentions the same sort of thing in his _History of Graphic Design_. Shortly prior to his moving to Parma.   \n   \n[erm, that's _Bodoni's_ moving to Parma - not Meggs.]\n\n"
    },
    {
      "time": "15 Oct 2003 — 12:28pm",
      "content": "I don't have my copy of Lawson here, but Hrant's mention of it reminds me of [Bulmer](http://web.archive.org/web/20131019052212/http:/www.adobe.com/type/browser/P/P_1307.jhtml). Any chance that'd work?\n\n"
    },
    {
      "time": "15 Oct 2003 — 6:29pm",
      "content": "I really think you should have another look at ITC Bodoni 12 and 6. Just make sure it's well leaded on a reasonable measure.\n\n"
    },
    {
      "time": "15 Oct 2003 — 9:42pm",
      "content": "thanks for that. itc bodoni 6 looks really nice. i think ill look into buyin it.\n\n"
    },
    {
      "time": "30 Mar 2004 — 6:36am",
      "content": "Did you ever try Linotype Gianotten? It's designed for text in smaller sizes and has a far lower contrast. The light version even has Small Caps! Antonio Pace created Gianotten in 1999. The Milana Citta is a modified version for the house style of the city of Milan.   \nsee [www.linotype.com](http://web.archive.org/web/20131019052212/http:/www.linotype.com/) or [www.myfonts.com](http://web.archive.org/web/20131019052212/http:/www.myfonts.com/)\n\n"
    },
    {
      "time": "15 Oct 2003 — 11:21am",
      "content": "Hrant, I'd need my notes from James Mosley's lectures, but I am pretty sure you are not right about Giambattista's inspiration. What is your source for that information?\n\n"
    },
    {
      "time": "29 Mar 2004 — 6:56pm",
      "content": "can u send some information or history about bodoni typeface to me?   \nthank you very much!!\n\n"
    }
  ]
}
