{
  "id": "16531",
  "title": "Usage of Ligatures in Corporate Font and Business Letters?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hey members and professionals,\n\ni have a general question regarding ligatures. i know ligatures from books, usually used when it’s long text. for ME ligatures have an old-style look and feel. nice, but i wouldn’t use it in business letters etc.\n\nwe purchased the font kievit to use as corporate font.  \nnow my client wanted to know how to use the ligature. i proposed not to use the ligatures, because of what i’ve already written.  \nmy clients opinion is that it gives a sophisticated feeling.  \nwe both asked ourself, is it just a matter of personal and subjective feeling? and why not use it everywhere?\n\nsorry i am still a design student…\n\nWHEN DO YOU USE ligautres? would you use them for a company which does marketing, design and communications?\n\nopinions greatly appreciated :-)\n\na.\n\n",
  "author": "annanina80",
  "time": "29 November, 2005 - 11:08pm",
  "uid": "9884",
  "comments": [
    {
      "time": " 29 November, 2005 - 11:42pm",
      "content": "I agree with your first impulse. I’m not experienced with FF Kievit, but if the ligatures are too noticable, the addition of them could come off looking strange in places like faxes and letters.\n\nIn general, I would say inclusion depends on the face and instance. For example, Kennerly “fi” ligature would be fine — maybe even preferable to none, but “st” (overhand swoop connection) would be a bit strange.\n\nHrm… if your client needs help with using specialized characters, maybe they should steer clear anyway.\n\n"
    },
    {
      "time": " 29 November, 2005 - 11:51pm",
      "content": "I’ll tend to agree, but in the end, it’s the client who decides. Hopefully you are a persuasive person.\n\n"
    },
    {
      "time": " 30 November, 2005 - 12:16am",
      "content": "I’d generally agree with the two above. While “fi” “ff” etc might be subtle enough to not be noticable, something pronounced and unexpected might be completely distracting. One might spend time pondering the ligature and miss the point of the text completely..\n\nor maybe that’s just me. hm\n\n"
    },
    {
      "time": " 30 November, 2005 - 7:21am",
      "content": "Considering that the standard <cite>f</cite> ligatures are meant to improve legibility, I see no problem with using them. In most good fonts, the reader will not even notice a standard ligature, which are meant to be quiet and unassuming. To me, <cite>not</cite> using the <cite>fi</cite> usually adds unnecessary weight and offsets the color balance of the page.\n\nOf course, I would stay away from the discretionary (ct, st, etc.) ligatures in almost every business setting.\n\n"
    },
    {
      "time": " 30 November, 2005 - 7:25am",
      "content": "<cite>but in the end, it’s the client who decides.</cite>\n\nThat all depends on how much they’re paying you! I find few things more pleasurable than firing a cheap client who doesn’t trust my judgement. ;-)\n\n"
    },
    {
      "time": " 30 November, 2005 - 8:50pm",
      "content": "Hmmm… you may have a point, if you don’t need money i guess.\n\n"
    },
    {
      "time": " 1 December, 2005 - 1:19am",
      "content": "_…a cheap client…_\n\nA cheap client doens’t really help much if you need money…\n\n"
    }
  ]
}
