{
  "id": "16534",
  "title": "Type Games",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "I developed three interactive games to help teach typography as a part of my Master's thesis in digital design. I would love to hear any feedback you may have. Also, let me know if you are using them in your classroom. Check them out at: [http://www.typehype.net](http://web.archive.org/web/20150417042756/http:/www.typehype.net/ \"http://www.typehype.net\")\n\nRegards,  \nJeanne\n\n",
  "author": "komprehensive",
  "time": "30 Nov 2005 — 5:08am",
  "uid": "10377",
  "comments": [
    {
      "time": "30 Nov 2005 — 6:38am",
      "content": "I'll check it out. The first exercise I've always thought of in terms of flashcards. Always thought that would make a great teaching aid.\n\n"
    },
    {
      "time": "30 Nov 2005 — 11:09am",
      "content": "Hi Jeanne,\n\nthanks for the link to your games, and welcome to the forum.\n\nI guess I didn't shoot down the bad kerning pairs fast enough (YOU LOSE!) ;-(\n\nA few of us have brought the topic of educational games in previous threads. Here's the one on [If Typography was (were) a video game](http://web.archive.org/web/20150417042756/http:/typophile.com/node/14515).\n\nI would love to hear more of your thoughts concerning what students may be able to pick up with a game that they don't seem to be getting in class. Maybe \"game\" isn't really the proper term... interactive tools for learning is longer but more accurate.\n\n"
    },
    {
      "time": "30 Nov 2005 — 7:13pm",
      "content": "Hi Norbert,\n\nInteresting that the \"If Typography was a video game\" discuss appeared two days after my thesis defense. I should have started that discussion back in January.\n\nThe topic of whether education games can really be effective in teaching typography is untested and why I developed these. After developing these, I am interested in whether anyone has used or is willing to use [www.typehype.net](http://web.archive.org/web/20150417042756/http:/www.typehype.net/ \"www.typehype.net\") in the classroom. I want to measure the level of success. I feel that for game-based learning to be truely effective, each game must have clearly defined learning objective(s).  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Problem Statement**  \nCollege undergraduate communication design students are producing deficient typography. These deficiencies are specifically related to the rapid identification of typeface design and inplemenation of kerning and proper typographic punctuation.\n\n**Root Cause Analysis**  \nSince the computer has been integrated into design education, there has been more of an emphasis on software competency than that of letterform structure and typographical nuances. The design industry has pressured educators to mold students who are technically adept by raising the entry-level job requirements. In addition, typography was taught mainly through lecture and hand skills however this methodology does not attract current design students due to the expanse of technology in existence today.\n\n**Needs Analysis**  \nDue to college undergraduate communication design student’s technological capabilities and its saturation upon their social lives, design education would benefit by incorporating an alternative teaching methodology that appeals to the student’s learning and life styles.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nMy intention of applying game-base learning was sparked by analyzing the habits of the 18-22 design student population. These individuals are \"plugged in\" 24/7. The games are to increase their knowledge on a more subminal level. Each style of game was chosen due to its addictive quality...come on who doesn't love a little Tetris or Bejeweled. All of the rewards in my games are used to help the user play the games better by reiterating guidelines of \"good\" typography.\n\nI would love it if my students (...or anyone else's) would take a break from their design projects and play a little \"Serif\" or \"Faceoff\" to take their mind off things. I hate to say it but...edutainment may be part of the future.\n\n"
    },
    {
      "time": "1 Dec 2005 — 12:22pm",
      "content": "This forum is one of the best places to post your ideas, suggestions, requests, etc., except that the Typographic Education topic area is not as visited as most other areas.\n\nHopefully we can change that, with individuals like yourself, that contribute and want to improve tools and methods of type/typographic education and training.\n\nIt's still early in the planning stages for the next TypeCon in 2006, but we hope to develop a viable program for Type Education.\n\n"
    },
    {
      "time": "1 Dec 2005 — 2:10pm",
      "content": "I love edutainment - it's just had to pull off well, to strike the needed balance between gaminess and learning. But I think you're doing pretty good, overall. Some comments:\n\nFace Off: Too slow-paced. Put a count-down. Or maybe even a way for the grid to \"regrow\", increasingly quickly, so you could actually lose (if it fills up again). Which means you might have to start with the top row empty. BTW, the little \"Font Library\" sidebar thing is cool.\n\nSerif: Fine, except it's hard to judge good/bad kerning at such lo-res. You might turn it into a (quickly-changing) sequence of larger settings instead?\n\nType Invaders: Looks cool! And those daggers are great. The thing is though, although the instructions contain great education, the game itself is just Space Invaders; it would be much better to put \"educational decisions\" in the actual game as well. Lastly, a small thing: that pixelfont is too blurry.\n\nAnother thing: it's taking too long just to bring up the \"Loading...\" messages.\n\nAnyway, I hope I don't seem to negative, because  \nI think you're doing a really good thing here.  \nSo please make more! :-)\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2005 — 5:05pm",
      "content": "hhp,\n\nI appreciate your feeback. This is what I am looking for.\n\nThanks.  \nJeanne\n\n"
    },
    {
      "time": "8 Mar 2009 — 8:52pm",
      "content": "I once designed a version of [Memory](http://web.archive.org/web/20150417042756/http:/www.amazon.com/Hasbro-Original-Memory/dp/B00000IWDD), only instead of pictures, I used letter a's from different fonts. That went over pretty well, but then again, we were all freaks. I can't wait 'till I have kids.\n\n"
    },
    {
      "time": "9 Mar 2009 — 6:47am",
      "content": "Sorry Double Post\n\n"
    },
    {
      "time": "9 Mar 2009 — 6:42am",
      "content": "1. One more game for Ligatures will make the site Komprehensive!  \n2. Similar games (3+1) games in Arabic will make the site even more Komprehensive!  \n [http://www.arabictypography.com/movie1.htm](http://web.archive.org/web/20150417042756/http:/www.arabictypography.com/movie1.htm \"http://www.arabictypography.com/movie1.htm\")  \n3. Thanks with Flowers\n\n"
    }
  ]
}
