{
  "id": "16550",
  "title": "Cyrillic: equivalence of upper and lower case ?!",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "The serifed [Cyrillic](http://web.archive.org/web/20140701122915/http:/www.typophile.com/wiki/Cyrillic) alphabet uses many Latin forms, several of which are the same in both upper and lower case, but styled differently, with different kinds of serif -- for instance c has a straight serif in upper case, a ball in the lower.\n\nHowever, Cyrillic-only characters are generally \"serifed\" the same way in both upper and lower case.\n\nThere have been some departures from this orthodoxy, in particular [Vladimir Yefimov](http://web.archive.org/web/20140701122915/http:/www.typophile.com/wiki/Vladimir%20Yefimov)'s \" [Kis](http://web.archive.org/web/20140701122915/http:/www.typophile.com/wiki/Kis)\" typeface, where the upper case K form has a straight top right arm and serif, but a curved-with-ball form in the lower case.\n\nSo I'm wondering, if I were to design a Cyrillic extension in a traditional (Western) genre, and introduce subtle differences between upper and lower case serif treatment, would indigenous readers think:\n\n- damn foreigner doesn't know what he's doing  \n- that's cool, just like Yefimov  \n- didn't notice, as long as it reads smoothly, not an issue\n\nAlso, what has been the reaction to Yefimov's Kis? Is it considered a quaint anomaly, or as a provocative new direction?\n\n",
  "author": "Nick Shinn",
  "time": "1 Dec 2005 — 9:56am",
  "uid": "2021",
  "comments": [
    {
      "time": "1 Dec 2005 — 12:36pm",
      "content": "_for instance c has a straight serif in upper case, a ball in the lower_\n\nThis is no more true than it would be if you said the same thing about Latin typefaces: it is true of some typefaces in some particular styles, but it cannot be made a general statement about the script.\n\nYefimov's Kis is hardly 'a provocative new direction': it is an historical re-imagining of Peter the Great's Civil Type, considering how it might have looked if the model for the reform had been based on the best Dutch types of the day rather than some rather mediocre specimens. I recommend Vladimir's essay in _Language Culture Type_, which explains the whole context for his Kis type.\n\nIt is important to understand what details in Cyrillic letterforms are appropriate to which styles and why. There is a tendency for beginners dealing with the script to cut and paste ideas things they've seen in various different Cyrillic types without understanding the stylistic relationships. This results in hodge-podge designs in which, to make a Latin comparison, the ball terminal from a Bodoniesque romantic type gets stuck in the middle of a Jensonesque renaissance design. Done deliberately, it might be made to work as some kind of post-modernist exercise, but it is usually done in ignorance.\n\nThese comments, of course, apply to any script: they all have their own histories and stylistic evolutions and periods. Sometimes, these styles coordinate very closely to parallel developments in the Latin script, but sometimes not.\n\n"
    },
    {
      "time": "1 Dec 2005 — 2:08pm",
      "content": "Thanks John. I'm familiar with Yefimov's essay, and noted how he described starting off with the usual matching details in K for upper and lower case, and then changed them to be different. This is what prompted me to consider that his \"historical reimagining\" might be novel.\n\nSo my question stands, do Russians consider his historical reimagining to be quaint, a travesty, post-modern, or not worth bothering about?\n\n"
    },
    {
      "time": "1 Dec 2005 — 2:34pm",
      "content": "I can't add anything intelligent to this conversation, except to quote Gary Munch, _Ya, Arrr!_ =)\n\n(He was talking about the tendency to think the Cyrillic Ya is the same as the Latin R, but flipped.)\n\nThe question of cultural sensitivity is an interesting one. Whenever I tell a Russian that I speak (barely) the language I'm usually met with first a twinge of suspicion and then of pleasant surprise. (\"You mean you were offered something other than French, Spanish or German in high school?\") It's almost always a pleasant interaction, the fact that someone would go out of their way to seek out their language and learn about the culture.\n\nI bet designing Cyrillic would be welcomed -- \"Hey, somebody is interested in my culture, that's cool.\" And even if you make some mistakes you'll at least have learned it better.\n\n"
    },
    {
      "time": "1 Dec 2005 — 2:54pm",
      "content": "\"Equivalent of U&lc\" was what I thought Nick meant at first read. My error brings to mind a related question--My daughter took 4 years of Russian in high school. Somewhere along the way, she titled one of her papers (typed in Cyrillic) in U&lc. Her native Russian teacher informed her that this was never done and that she had to change the title to all caps. Is this the norm or just the individual preference of my daughter's teacher?\n\nChrisL\n\n"
    },
    {
      "time": "1 Dec 2005 — 3:25pm",
      "content": "_do Russians consider his_ [Yefimov's] _historical reimagining to be quaint, a travesty, post-modern, or not worth bothering about?_\n\nI do not consider the treatment of the u.c. **К** and the l.c. **к** in Kis BT any of the above. Cannot speak for all Russians, though.\n\nIn fact, the use of two differently-styled terminals in those letters' arms (in the same typeface) is by no means Yefimov's invention, or discovery. Check, for example, two typefaces designed by Pavel Kuzanyan -- [_Kuzanyan_](http://web.archive.org/web/20140701122915/http:/www.paratype.ru/ru/library/newstyles.asp?fontcode=PT_KZN) (1959/2001) and [_Neva_](http://web.archive.org/web/20140701122915/http:/www.paratype.ru/ru/library/newstyles.asp?fontcode=PT_NEV) (1970/2002). By the way, some style details of both Kuzanyan's designs can be traced, at least in part, to the same source as Yefimov's _Kis BT_--the Civil Type of Peter the Great, and the early Cyrillics of the post-Petrine period. There should be more examples of a similar treatment of those glyphs.\n\nThe [larger size](http://web.archive.org/web/20140701122915/http:/www.fonts.ru/E-ZINE/issue04/pictures/peter_5.gif) of Civil Type featured **К** and **к** with the flat top serifs. The arms of the **К** and **к** in the [medium-size](http://web.archive.org/web/20140701122915/http:/www.fonts.ru/E-ZINE/issue04/pictures/peter_6.gif) Civil Type terminate in ball finials.\n\nI feel, the title of this thread calls for some kind of terminal punctuation. Maybe a question mark. Or a question mark _and_ an exclamation point. Thusly: _Cyrillic: equivalence of upper and lower case [?!]_. Square brackets are optional...\n\n"
    },
    {
      "time": "1 Dec 2005 — 3:32pm",
      "content": "_Is this_ [headings in all caps] _the norm or just the individual preference of my daughter’s teacher?_\n\nThis sounds like a typing convention to me. Remember, not too long ago using all caps for headings was standard, in all languages/scripts that use upper and lower case characters (English, for one).\n\n"
    },
    {
      "time": "1 Dec 2005 — 5:24pm",
      "content": "\"This sounds like a typing convention to me.\"\n\nThanks Maxim. I thought so after seeing some other Russian typography. I will tell my daughter :-)\n\nChrisL\n\n"
    },
    {
      "time": "1 Dec 2005 — 8:31pm",
      "content": "\\>The larger size of Civil Type featured К and к with the flat top serifs. The arms of the К and к in the medium-size Civil Type terminate in ball finials.\n\nIn my experiments with Cyrillic so far, that seems to produce the best color for each case.\n\n"
    },
    {
      "time": "2 Dec 2005 — 3:36am",
      "content": "_In my experiments with Cyrillic so far, that seems to produce the best color for each case._\n\nWhich?\n\n"
    },
    {
      "time": "2 Dec 2005 — 5:32am",
      "content": "I think it's an \"x-height thing\" and is independent of script,  \ni.e.i.m.h.o. that ball-ed k would be for better for reading.\n\n"
    },
    {
      "time": "2 Dec 2005 — 9:11am",
      "content": "\\>Which?\n\nI agree, David, the balls have it for text.\n\nAs my Cyrillic is an extension to a Latin face in the didone genre, it already has a fair sprinkling of balled terminals in the lower case. In this genre, the only upper case Latin balled character is the J; it seems that balls detract from the austere dignity of the capitals.\n\nWith the exception of the Y (cyrillic U) and El, Yefimov has no balled terminals in his Kis upper case, yet in the lower case in addition to the latin y and c, he has put balls on el (as in UC), and zhe, k, and ze (different from UC).\n\nThis is unlike Cyrillic didones such as ITC Bodoni, and Yefimov's earlier Didona, where there is case-consistency for balled-terminal characters\n\nAlthough the Kis typeface is not a didone, I'm liking the way it works, and thinking that it is the route to go. I might even go further in this general direction, and put flourished descenders on lower-case tse and shcha, but \"tick\" descenders on their UC counterparts.  \nWould that be too \"hodge-podge\", Maxim?\n\nI'm also considering varying the shape of de and el, making them isosceles in the lower case, and right-leaning in the UC. But that might be a bit much.\n\nBTW, studying Bodoni's Manuale (Octavo CD) for a decision from the master is pretty futile, as GB riffs through umpteen variations in different sizes, with nothing definitive. However, it is extremely enlightening, as one gets to assess options, and see how they work in context. Manuale = Laboratorio.\n\n"
    },
    {
      "time": "2 Dec 2005 — 4:54pm",
      "content": "\\> _my Cyrillic is an extension to a Latin face in the didone genre_  \n\\> _Although the Kis typeface is not a didone, I’m liking the way it works, and thinking that it is the route to go_\n\nYour logic defies me. Why is it \"the route to go\"? In what way the features of Kis, a Baroque typeface, could be applicable to a neoclassical design? Nick, I am not being dogmatic or pedantic: of course, exceptions exist. I just don't get it.\n\n\\> _I might even go further in this general direction, and_ [...]  \n\\> _Would that be too “hodge-podge”, Maxim?_\n\nYes.\n\n\\> _I’m also considering varying the shape of de and el, making them isosceles in the lower case, and right-leaning in the UC. But that might be a bit much._\n\nWithout doubt... The isosceles pattern in the construction of the **Д** , **д** , **Л** and **л** is more inherent in the Old-Style designs. And the right-triangle scheme is used in most classical Moderns of the 19th century. It's like the two patterns of the capital **M** : the one with the slanted sides works better in Old Styles, and the one with the vertical sides looks at home in Moderns.\n\nAs to Bodoni's own Cyrillics, you are right, there is not much definitive to them. They feel, and were, rather tentative. Russian typefaces of 1810s–1850s look like more valuable models. Of the ParaType library [_Elizabeth_](http://web.archive.org/web/20140701122915/http:/www.paratype.com/asearch/ptdescription.asp?page=descr&fcode=PT_ELZ) and [_ITC Bodoni 72_](http://web.archive.org/web/20140701122915/http:/www.paratype.com/pstore/default.asp?search=ITC+Bodoni+72&fcode=PT_B72) seem to offer good references in designing a Cyrillic didone if you want it authentic and credible.\n\n"
    },
    {
      "time": "3 Dec 2005 — 5:16pm",
      "content": "I'm confused by this reference to \"the isosceles pattern\" for something that's not a triangle. Wouldn't \"the trapezoid pattern\" be a more accurate/useful way to refer to it, seeing as it has four sides? (sometimes one of them is virtual, when it's an open shape)\n\nT\n\n"
    },
    {
      "time": "3 Dec 2005 — 5:58pm",
      "content": "Thomas, I understand \"isosceles\" to refer to the angles at the base, not the triangularity of the top. If one were being super-precise, one would refer to the shape Maxim is describing as an [isosceles trapezoid](http://web.archive.org/web/20140701122915/http:/mathworld.wolfram.com/IsoscelesTrapezoid.html). Similarly, the other common style would be technically a \"right trapezoid\" rather than a \"right triangle,\" but the usage is uncommon enough that \"right triangle scheme\" is probably the clearest way to describe it.\n\n"
    },
    {
      "time": "3 Dec 2005 — 7:32pm",
      "content": "The trapezoid pattern in the construction of the **Д** , **д** , **Л** and **л** is a later development. In Russian typefaces of the first half of the 19th century ( [Selivanovsky's](http://web.archive.org/web/20140701122915/http:/www.whitemouse.ru/font/img/61_1.gif), [Semen's](http://web.archive.org/web/20140701122915/http:/b.alt.udsu.ru/mirror/_rus/www.hi-edu.ru/e-books/AK/images/0033-021.jpg) and others) the right-triangle, _not_ the trapezoid pattern was used.\n\n"
    },
    {
      "time": "3 Dec 2005 — 11:50pm",
      "content": "\\>\\> I might ... put flourished descenders on lower-case tse and shcha, but “tick” descenders on their UC counterparts.  \nWould that be too “hodge-podge”, Maxim?\n\n\\>Yes.\n\nYou're giving me mixed advice, Maxim.  \nFirst you say don't do that, and then you recommend a typeface, Elizabeth, which has exactly that feature!\n\nAnyway, thanks for introducing me to the beautiful Elizabeth, and straightening me out about the appropriate structure for de and el. I had tried all three variants -- isosceles, right triangle, and trapezoid -- and wasn't happy with the way any of them were behaving. So I redoubled my efforts with the right triangle, and now the characters look fine. The right triangle really does harmonize with the didone style.\n\n\\>In what way the features of Kis, a Baroque typeface, could be applicable to a neoclassical design?\n\nIt's the idea that Cyrillic characters can have slightly different treatments in upper and lower case. I've since discovered that this idea exists in the Elizabeth (swash descenders on lower case tse and shcha, but not on the caps) and Bodoni 72 (round terminal on lower case k, straight on upper case K).\n\nI like the idea that there should be such a differentiation between upper and lower case, with the lower case having rounder, fuller details, and the upper case being more severe and austere. No doubt this is because I am used to it in the Latin script. It is also a feature of Greek, and even some Cyrillic character forms, such as Be. So, I have discovered precedents in period Didone typefaces, and I have collected them together and used then in my Cyrillic. Perhaps my taste in this matter could be considered as designing with a Latin accent.\n\nI will post an example when \"Insert image\" is working again.\n\n"
    },
    {
      "time": "4 Dec 2005 — 8:00am",
      "content": "\\> _You’re giving me mixed advice, Maxim_.\n\nI am very sorry for the confusion. I should have made it clearer that my referring to the design of Elizabeth was mostly in conjunction with the construction pattern of the **Д** , **д** , **Л** and **л**. I did not mean to say that _everything_ in the typefaces I referred to is perfect (just have a look at the very so-so figures in Elizabeth).\n\nI consider the inconsistency in the treatment of hanging terminals (of the **Ц** / **ц** and **Щ** / **щ** ) a _peculiarity_ of Elizabeth's design, that may be seen, alternatively, as either charming, or quirky, or annoying, etc., but not necessarily archetypal, exemplary, and commendable.\n\n\\> _Cyrillic characters can have slightly different treatments in upper and lower case_. [...] _I like the idea that there should be such a differentiation between upper and lower case_, [...]. _No doubt this is because I am used to it in the Latin script_.\n\nNo, Nick, it's not just your personal taste, or your background. The diversification of the upper- and lower-case glyphs (the subject of this thread, b.t.w.) happens to be one of the central issues in Cyrillic type design. It presents most challenge to both the beginners, and the experienced designers. As you've already noticed, the difference in the treatment of the u.- and l.c. glyphs ranges from obvious to very complex and subtle. That relationship varies, and takes different forms, depending on the style of the typeface. Its resolution requires substantial analytical skills, knowledge and sensitivity. This is why the mix-and-match approach, referred to by John Hudson (above), is by no means a solution.\n\nGood luck\n\n_ps_: Have you tried the small caps yet? :)\n\n"
    },
    {
      "time": "4 Dec 2005 — 9:18am",
      "content": "\"ps: Have you tried the small caps yet? :)\"\n\nLOL!!! That is your best ever Maxim :-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Dec 2005 — 1:22pm",
      "content": "Maxim,\n\nThanks for reminding me of this other shape, which I had completely forgotten, and for providing links. Images are always helpful.\n\nOf course, it is not an iscosceles triangle - an isosceles triangle as (at least) two equal sides. So no right angle triangle can be an isosceles triangle. So the isosceles form would be the one where the two vertical-ish sides of the letter are equal (and at equal angles) and the base is different.\n\nSo, I'll just call it a right-angle triangle with a vertical right side, and note that there are three basic forms of the letter, and we'll all be clear....\n\nT\n\n"
    },
    {
      "time": "4 Dec 2005 — 2:51pm",
      "content": "Phew... And now when we're all clear on the three basic forms of the **Д** , **д** , **Л** and **л**. Thomas, the right[-angled] triangle is not just \"that other shape\". It is most important for developing a classy, authentic-looking Cyrillic didone, and more. Please note that that pattern was also used in Russian sans- and [slab](http://web.archive.org/web/20140701122915/http:/b.alt.udsu.ru/mirror/_rus/www.hi-edu.ru/e-books/AK/images/0040-051.jpg)-serifs of the same period, and even in [decorative](http://web.archive.org/web/20140701122915/http:/b.alt.udsu.ru/mirror/_rus/www.hi-edu.ru/e-books/AK/images/0040-050.jpg) designs.\n\n"
    },
    {
      "time": "4 Dec 2005 — 3:14pm",
      "content": "\\>... the mix-and-match approach ... is by no means a solution.\n\nI'm afraid I'll have to differ with you on that philosophical point.  \nI agree that skill, knowledge and sensitivity are important, but don't see why they should preclude a \"mix and match\" design strategy.\n\nIf one has a design theme that is assembled from elements in a mix of typefaces, it should be possible to match them together (with appropriate massaging) and get them working in a way that produces good text colour. That is always the goal. And if these elements have already appeared in historical sources, that gives them provenance and authenticity. If they are thematically associated (rather than being a peculiarity, as the hanging terminals in Elizabeth may be) then they become meaningful and significant, rather than haphazard.\n\nHere's how my theory plays out:\n\n ![](http://web.archive.org/web/20140701122915im_/http:/typophile.com/files/Russ2.jpg)\n\nAnd in more depth, a pdf:  \n [Albany Cyrillic sample](http://web.archive.org/web/20140701122915/http:/www.shinntype.com/UN_Poly3.pdf)\n\n\\>ps: Have you tried the small caps yet? :)\n\nMany a true word is spoken in jest.  \nWhile some in the West think that the Cyrillic lower case already looks like small caps, this applies more to the roman than the italic. It's worth bearing in mind that one of the best uses in the West of small caps is in layouts where they are contrasted with italic upper and lower case. The idea being that the roman lower case is common, so if you want, say, a distinguished title page or contents page, then you avoid roman lower case and use just caps, small caps, and italics.\n\nSo, Cyrillic small caps, to be used as a contrast face to Cyrillic italic? Yeah, I'll do it.\n\n"
    },
    {
      "time": "4 Dec 2005 — 9:55pm",
      "content": "_And if these elements have already appeared in historical sources, that gives them provenance and authenticity._\n\nBut they appear in a stylistic context, and their authenticity is linked to that context. Once you change the context, by mixing and matching forms that are normative to different contexts, you lose some of the authenticity and, yes, end up with a hodge-podge of mismatched shapes. The typical forms of the major stylistic groupings tend to be the way they are for a reason, usually found in the ductus or stroke model of the style and consistent across the letters. This is true of pretty much any script, and is why it looks odd to mix romantic and renaissance forms in the same Cyrillic typeface. Perhaps not as odd nor as culturally alien as mixing ruq'ah and nasta'liq forms in an Arabic typeface, but odd nonetheless and certainly not authentic. Authenticity cannot be gained simply by using a bunch of details from existing Cyrillic typefaces without understanding why a particular shape has been used in one place but not in another.\n\nApart from any other criticisms of the mix-n-match approach, it simply isn't necessary: there is plenty of scope for new, original and much needed Cyrillic type designs that observe the characteristics of the major styles, and if you want to create a new style there are better ways to approach the challenge than copying and pasting bits of other styles.\n\n"
    },
    {
      "time": "5 Dec 2005 — 12:03am",
      "content": "...it looks odd to mix romantic and renaissance forms in the same Cyrillic typeface.\n\nThat's not what I'm proposing.  \nThe descender I'm putting on tse and shcha is no different in form than the ascender of the be -- they have the same ductus. It's a \"tilde\" shape, and it's also found in the centre of the Cyrillic \"E\"s. It also relates to the leg of Zhe, Ka and Ya.\n\nIt bothers me that in many Cyrillic faces, the top of the \"be\" sticks out like a sore thumb, its shape not represented elsewhere in the lower case, not even echoed. To me, this is a design flaw. That is one reason I have decided to put matching descenders on Albany's tse and shcha, to keep that poor lonely be's ascender company, waving around in the extender zone. When I first considered doing this, I had seen it in Yefimov's Kis, and was later pleased to discover that it was also in a bona fide Didone face, Elizabeth. No matter that Maxim considers this feature to be peculiar, it is still authentic.\n\nI've seen enough 19th century Cyrillic fonts by now to realize that there was considerable leeway in interpretation -- and still is. Yefimov's recent Didona, for instance, has the 'wrong\" kind of de and el shape, trapezoidal. But I don't think it looks odd, he manages to pull it off, on the strength of extreme fat-face attitude.\n\n\\>better ways to approach the challenge than copying and pasting bits of other styles.\n\nAbsolutely. I always make all my glyphs from scratch, by eye, and never pirate points or trace over scans.\n\n[Small tse alternate tails (pdf).](http://web.archive.org/web/20140701122915/http:/www.shinntype.com/tails.pdf)\n\n"
    },
    {
      "time": "5 Dec 2005 — 10:33am",
      "content": "Maxim,\n\nHey, it was only \"this other shape\" relative to the two I was thinking of - I went on to say that there were three basic shapes. That being said, the Didone space is not one that interests me much right now.\n\nAll,\n\nHrant pointed out to me that (of course - d'oh!) there is a shape that is both a right-angle triangle and an isosceles triangle. You cam make it quite easily by taking a square and cutting it in half along a diagonal from corner to corner. Of course, the base of this shape would seem to be far too large for a de/el, so this is purely an geometry issue rather than a practical one for the letters in question.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "5 Dec 2005 — 12:02pm",
      "content": "Thomas,\n\nQED :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Dec 2005 — 12:07pm",
      "content": "Regarding the flourished descender on the ц and щ, I disagree with the assessment in your PDF that the spike is the 'normal' form. The flourish form is perfectly acceptable in certain styles, as you've discovered. Where we disagree is about the relationship of the upper- and lowercase forms when this flourished descender is used. Normally it would be used for both cases, not just the lowercase, leaving only Д/д and Џ/џ with the spike form. [Note, by the way, that Џ/џ may have an lacrymal shape instead of a spike, i.e. wider at the bottom than at the top.]\n\nI find the upper arms on your ж and к to be stiff and strange: it would be better to follow the Scotch form and bend these arms so that the hairline is close to vertical.\n\nThere are some nice things in the Albany design, but the proportions and weights of several letters need work. The bowls of the Ф and Ч should be squarer. Nick, I really recommend hiring Maxim to go through a review process on at least one Cyrillic design: even if you end up rejecting most of his recommendations regarding design characteristics, you will learn a lot about fine tuning the proportion of Cyrillic letters relative to each other.\n\n"
    },
    {
      "time": "5 Dec 2005 — 12:53pm",
      "content": "\\>Where we disagree is about the relationship of the upper- and lowercase forms when this flourished descender is used.\n\nRight. I don't see why it has to be consistent between the cases, and it's here that I'm breaking with precedent. I realize that this is a face in an historic genre, but people today use old type in new ways, and this is particularly so of capitals. Two instances; first is drop caps, and second is the tightly leaded layout (with negative leading sometimes). In these, descenders on capitals are problematic, they get in the way. Not a problem in the 19th century, with an open, letterspaced approach to all-cap settings.\n\n\\>I find the upper arms on your ж and к to be stiff and strange:\n\nThey started out bent, but I found the effect was too fussy in text, which is why I straightened them out, which fixed the problem.\n\n\\>The bowls of the Ф and Ч should be squarer.\n\nThanks, I'll try that.\n\n\\>I really recommend hiring Maxim.\n\nSorry, I already blew my Greek/Cyrillic development budget buying \"Language Culture Type\" :-)\n\n"
    },
    {
      "time": "5 Dec 2005 — 7:30pm",
      "content": "\\> _Yefimov’s recent Didona, for instance, has the ‘wrong’ kind of de and el shape, trapezoidal._\n\nThere is nothing wrong--or even 'wrong'--with the way the **Д** , **д** , **Л** and **л** are treated in [Didona](http://web.archive.org/web/20140701122915/http:/image3.myfonts.com/textimage/92/92ea87dddf80e490d35ec0c22f66a666.png). Didona belongs to a younger generation of Moderns--the Victorian designs of the second part of the 19th century (that subcategory of _didones_ also includes [Monotype Modern](http://web.archive.org/web/20140701122915/http:/www.linotype.com/1250/monotypemodern-family.html), [Bruce No.11, a.k.a. BT DeVinne)](http://web.archive.org/web/20140701122915/http:/www.myfonts.com/fonts/bitstream/de-vinne), [Stephenson Blake's Modern No.20](http://web.archive.org/web/20140701122915/http:/www.myfonts.com/fonts/agfa/atmodern-twenty), and other similar designs). B.t.w., it looks like Nick's Albany can be classified as a Victorian Modern.\n\nAs I already mentioned, the [triangular](http://web.archive.org/web/20140701122915/http:/www.hi-edu.ru/e-books/AK/images/0033-040.jpg) pattern in the construction of the **Д** , **д** , **Л** and **л** is typical for the [_early_ neoclassical](http://web.archive.org/web/20140701122915/http:/www.hi-edu.ru/e-books/AK/images/0039-039.jpg) Russian typefaces that originated in the 18th century, and fully developed in the first half of the 19th century. The serif terminal of the diagonal stroke in the **Л** and **л** was abandoned, and replaced with the bulbous finial.\n\nAround 1850s the diagonal stroke in the **Д** , **д** , **Л** and **л** started shifting off the stem, and sagging. That evolution gave birth a new construction patter, trapezoid. That scheme became very popular. With time, the angle of the diagonal got steeper, the difference in length between the top and the bottom sides decreased. Taken to the extreme in some designs, that pattern imparted to the **Д** , **д** , **Л** and **л** a totally degenerate, almost [rectangular shape](http://web.archive.org/web/20140701122915/http:/image3.myfonts.com/textimage/ae/ae1e70efc91160e68d09a8fc82f72533.png).\n\n"
    },
    {
      "time": "5 Dec 2005 — 8:40pm",
      "content": "\\>Albany can be classified as a Victorian Modern.\n\nIt's a quite literal digitization of a face I found in a book published in Albany, New York State, in 1869. I think it's by George Bruce. I term this style of face, with the extreme stroke contrast, huge serifs, and tiny aperture, \"Scotch modern\", to distinguish it from the more restrained didone faces of Didot, Bodoni, and Walbaum. (Font Bureau calls it \"Old Modern\".) While it originated in Britain prior to the Victorian era, it had its largest popularity in the USA in the second half of the 19th century, and well into the 20th.\n\nThe book I have is a scientific work, so it has a pretty full character representation -- but no Greek or Cyrillic.\n\nSo, back to the drawing board (metaphorically speaking), and a bit more trapezoidal.\n\n"
    },
    {
      "time": "6 Dec 2005 — 11:47am",
      "content": "\\>Didona belongs to a younger generation of Moderns—the Victorian designs of the second part of the 19th century\n\nI think you are wrong on this Maxim.  \nIt's named Didona, and is closely related to the Didot faces of the early 19th century.  \nFormally, Didona lacks the \"closed aperture/big serif' quality of the later Victorian or \"Scotch modern\" -- in this example note the small aperture to the interior space of the E in Modern 20, and the \"pot hook\" serif on the a.\n\n ![](http://web.archive.org/web/20140701122915im_/http:/typophile.com/files/Didonas.jpg)\n\nThe De structure of Didona had been used by Yefimov before, in his version of ITC Fat Face, where it is a necessity, as there is no room for a diagonal. (The same circumstance led to the interesting lambdas in Dimitris Arvanitis's Modula Tall.)\n\nI'm not discounting your general theory of the evolution of the De shape -- but I suspect the evolution was not completely linear and all-encompassing. Despite my profound ignorance of Cyrillic type history, I would expect there to have been more variance in display faces, and during particularly experimental eras of history, as in the West.\n\n"
    },
    {
      "time": "6 Dec 2005 — 5:10pm",
      "content": "Aside from the issue of correct and faithful rendition of the revival, is there anything Nick is doing with his so called \"mix and match\" that hinders reading or that would be objectionable if this were not a revival and simply Nick's own new design?  \nI am trying to separate a few things: the nature of the Cyrillic script; the nature of the modern didone style; the nature of any typeface to feel like a system unto itself; and the nature of a given typeface as a well usable tool for reading.\n\nChrisL\n\n"
    },
    {
      "time": "6 Dec 2005 — 6:06pm",
      "content": "(OT)\n\nNo wonder Nick and I argue so much - we have a totally different aesthetic sense, too! :)\n\nThis late 19th century American take on the Didone style is something I have long loathed. In my mind, it's like the final degradation of the Didone (which I wasn't much into in the first place), riding it into the ground and driving every remaining ounce of legibility and taste from it. Or something like that.\n\nThat being said, I of course recognize that this is largely a matter of personal taste. Nothing wrong [cringe] with Nick doing a revival here. Nope.\n\n[time to go hide]\n\n"
    },
    {
      "time": "6 Dec 2005 — 6:35pm",
      "content": "\\>Nick and I argue so much\n\nHey, it's Typophile. And at least we don't get personal.  \nBut really, I enjoyed collaborating with you on our TypeCon workshop, I thought that went pretty smoothly. We both have a committment to OpenType, since the time you helped me out with my article on it a few years ago.\n\nYou know I am a contrarian.  \nI've had my fill of the 20th century, the incunabula, William Morris, the usual suspects.  \nSo what is there now to amuse my jaded palate?  \nOf course, the one genre that everybody else hates, the Scotch modern!\n\n"
    },
    {
      "time": "6 Dec 2005 — 7:23pm",
      "content": "\"But really, I enjoyed collaborating with you on our TypeCon workshop,\"\n\nAs a student in that workshop I might add that both of your efforts made it quite worthwhile for those of us sittin' in the shadows learnin' stuff.\n\nChrisL\n\n"
    }
  ]
}
