{
  "id": "16563",
  "title": "how to file a copyright registration for a font?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Do you have recent experience doing copyright registrations for fonts with the US Copyright Office?\n\nSome specific questions:\n\nThe Copyright Office wants the source code of the font deposited. That's easy to understand for a C++ program, but what do they expect to see as \"source code\" for a font created using Fontographer (so glad it's available for OS X finally)? Or FontLab?\n\nIf I create a font in Fontographer, and distribute a TrueType font that I generated using Fontographer, does the Copyright Office want the .fog file? Or the .ttf file? Or something else entirely? The .fog file seems like it's basically the \"source code\", though it's utterly unreadable if I just open it in a text editor.\n\nThere's a cryptic sentence on a few sites about the Copyright Office being reluctant to accept registrations of fonts created using Fontographer -- has anyone actually run into that?\n\nFinally, for a dingbat font where I want the copyright registration to also protect the selection and arrangement of non-alphabetic glyphs (the a slot is filled by a diamond, the b slot is filled by a horse), do you have any experience with the Copyright Office accepting or rejecting language to that effect on the registration form?\n\nI've just spent most of the last day looking for answers to these questions unsuccessfully on the web and in books. Any advice would be very welcome!\n\n",
  "author": "kindestcut",
  "time": "1 Dec 2005 — 7:57pm",
  "uid": "10411",
  "comments": [
    {
      "time": "1 Dec 2005 — 8:43pm",
      "content": "We use a TTFDUMP to dump the font data to a text file and send the first ten and last ten pages to the (c) office. Don't know how about the forms - our legal people take care of that for us.\n\nWith respect to glyph order - got a feeling that might be a design patent thing not a (c) thing as we've not done that in a while.\n\n"
    },
    {
      "time": "1 Dec 2005 — 8:58pm",
      "content": "I don't know about your last question.\n\nFor Type 1 fonts, IIRC, what Adobe used to file with the copyright office was a dump of an unencrypted version of a PFA file.\n\nFor OpenType CFF fonts or CFF fonts, one could dump tables of the compiled font, in order, using a tool such as TTX.\n\nIn all cases, one only needs to submit the first 25 pages and last 25 pages. More details are on the copyright office's site. (or is it 10 and 10 like Microsoft? I could be misremembering.)\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "2 Dec 2005 — 3:37am",
      "content": "It's first and last 25 pages now, according to Circular 61 at the Copyright Office ( [www.loc.gov](http://web.archive.org/web/20131014111235/http:/www.loc.gov/ \"www.loc.gov\")). Their info is pretty good about traditional software, but hard to apply to fonts. This is helping a lot, thank you!\n\n"
    },
    {
      "time": "2 Dec 2005 — 7:06am",
      "content": "Cool, thanks for the tip on number of pages. I'll confirm with our attorney.\n\nCheers, Si\n\n"
    }
  ]
}
