{
  "id": "16571",
  "title": "Introduction to Typesetting??",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am a recent Graphic Design graduate and went to an interview for a Production Assistant at an educational publishing company. The job would involve typesetting long documents, books and study materials in Quark or InDesign.\n\nI have not \"typeset\" long documents before and the thought of having to read and typeset a 600 page book in a couple of days seems daunting..\n\nDoes anyone have any advice for me about typsetting in general, or know of any good websites/books which would help me get a head start if i do get the job??\n\nThe other people in the publishing department have not come from a design background, so I was slightly confused. I think of typesetting as a creative job is it not? They have said this isn't a design job.\n\nAny advice would be appreciated,\n\n",
  "author": "newbie_chez",
  "time": "2 Dec 2005 — 9:33am",
  "uid": "1477",
  "comments": [
    {
      "time": "2 Dec 2005 — 9:40am",
      "content": "Books on the whole aren't scary. Not for me anyway. One of the keys in book typography -- and there are others here far more expert than I -- is style sheets. Style sheets are a time savor. I've only done a handful of books, but style sheets helped immensely.\n\nI'll go drag around and see if I can't find you some useful books besides the [triumvirate](http://web.archive.org/web/20131018214131/http:/www.typophile.com/wiki/triumvirate).\n\n"
    },
    {
      "time": "2 Dec 2005 — 9:49am",
      "content": "\\> <cite>I think of typesetting as a creative job is it not? They have said this isn’t a design job.</cite>\n\nNot knowing the specific job description, this is just an assumption based on previous experience:\n\nYou would ONLY be responsible for typesetting -- that is, flowing copy, making sure it looks right, attention to the details, etc. Most likely someone else (the designer) will have already done the basic layout, chosen typefaces and possibly even set up style sheets before the job gets to you. Based on the designer's template of a couple of pages, your task is to finish the job for the remaining 600 pages of the book.\n\nNonetheless, it would be great practical experience!\n\n"
    },
    {
      "time": "2 Dec 2005 — 9:49am",
      "content": "Hi Tiffany,\n\nThe interviewer mentioned I would be using templates which will help ease me into the process!\n\nOne thing about typesetting long documents, would you spend as much time reading/proofing them as you would read a normal book?\n\n"
    },
    {
      "time": "2 Dec 2005 — 9:52am",
      "content": "You see the text differently, I think. My client likes the fact that I notice fiddly details and actually depends upon me to surface read the text as I check for the details. However, if you have an editor and a designer over you already, they probably won't ask you to do that so you will most likely not read the text short of finding breaks or things such as that.\n\n"
    },
    {
      "time": "2 Dec 2005 — 9:56am",
      "content": "Engelhardt,\n\nYes I think you are right - I did ask them if this was a design job, and they said No, more of an \"artworker\", hmm..\n\nBased on experience, is it also a typesetter's job to proof read a very long document?\n\nAs part of my interview I was given a proof reading and spelling test. Since I am a design and not an English graduate it kind of worries me that I may miss some grammatical mistakes etc!\n\nOther than my concerns I hope I get the job, it definitely would be great practical experience!\n\n"
    },
    {
      "time": "2 Dec 2005 — 10:05am",
      "content": "How rude. I didn't say hello in return. Sorry, Cheryl.\n\nIf you want to dig in and get serious there are several books out there that are good resource. Starting with, perhaps, [Designing Books: Practice and Theory](http://web.archive.org/web/20131018214131/http:/www.amazon.com/gp/product/0907259081/qid=1133546853/sr=1-5/ref=sr_1_5/103-8856371-3383808?s=books&v=glance&n=283155). As well, on the same page there are links to a few others.\n\nNo matter where you are involved, it sounds like it will be a good experience. Good luck!\n\n"
    },
    {
      "time": "2 Dec 2005 — 12:52pm",
      "content": "Seems to me you need to ask a few specific questions of the potential employer. How can you know what you're expected to do if you don't ask?\n\nThat said, in my experience it's not so much that the typesetter is proof-reading for spelling and grammar (the publisher will have their own house-style that will have to be followed, and that's more or less the project-editor's duty), but that you'll be expected to find and fix typographical errors, such as double-spaces after periods, use of proper diacritics where necessary, house-style defined use of hyphen/en-dash/em-dash, implementation of small-caps for acronyms, etc. But there is also the primary task of a typesetter, being to control the page-flow and keep widows and orphans at bay, and to create smooth word spacing through careful use of hyphenation and justification. None of this is necessarily \"design,\" but all of it (and much more) is book typography & typesetting.\n\nIF someone else has designed the layout and stylesheets it sounds like you're being shifted from your own background and into an entirely different field. These days, it seems, designers are typesetting their own projects, which just makes sense to me, but that doesn't sound like what you're being asked to do.\n\nIf you don't have any training in typography and typesetting it would make me nervous that they're thinking of hiring you for the job. I don't mean that as a slag to you, it's just that if they're hiring someone with no experience that says to me they're not all that keen on having the job done well, and that sort of situation isn't good for anyone.\n\nAs above, definitely look at the [_triumvirate_](http://web.archive.org/web/20131018214131/http:/www.typophile.com/wiki/triumvirate), especially Bringhurst's book (but give yourself some real time to digest this very dense volume). Many of us around here have read that book and many others many, many times and still have much to learn. It seems to me that only after reading something like Bringhurst can you determine if typesetting holds any real interest for you. Not to mention that in many ways, book typography is the opposite of graphic design: in the latter your job is to dupe the reader, in the former it is to be of service to the reader.\n\nSo, get reading, and that will help you ask your potential employers the right questions.\n\nps. A while back I started putting together a sort of [_checklist_](http://web.archive.org/web/20131018214131/http:/www.greenboathouse.com/dewinetz/pdf/book-typography-checklist.pdf) for book typography. It stalled and I still have much to add to it, but it might be useful for you. Keep in mind that this list is made up of my personal tastes which may differ from yours and others, and also that this particular list includes spacing suggestions specifically for Adobe Minion Pro, which I use quite often in book work. I post it here simply as a reference, not as a set of rules, and my list is absolutely no substitute for Bringhurst _et al_.\n\n"
    },
    {
      "time": "2 Dec 2005 — 2:11pm",
      "content": "Cheryl,  \nFirst, welcome to Typophile!\n\nRegarding proof reading. It seems more logical that they are asking you to proofread for completeness (no lost text), correctness of typgraphic style (all the correct style sheets are used on the given text), and good color and fit (no widows and orphans, good H&J. etc.). I don't think you will \"read\" the book, just scan for formatting.\n\nChrisL\n\n"
    },
    {
      "time": "2 Dec 2005 — 4:38pm",
      "content": "= The Chicago Manual of Style\n\n= British Standards Institution: www(.)bsonline.bsi-global.com/server/index.jsp\n\n= Methods of Book Design - Hugh Willamson\n\n= On Book Design - Richard Hendel\n\n= The Thames and Hudson Manual of Typography - Ruri McLean\n\n= The Complete Manual of Typography - James Felici\n\nMore?\n\n"
    },
    {
      "time": "2 Dec 2005 — 8:12pm",
      "content": "I have never typeset a whole book until the last week... It's a demanding job, specially for eyes (my poor eyes), but I enjoyed it.\n\nIt took me four whole days to typeset this 176 pages book (included drawing 9 charts and diagrams), kinda slow I guess but it was my first time with this kind of task (and also my first time with Indesign).\n\nAs this book is being paid by a public scolarship there was no money for a proofreader or style corrector, so I tried to point out as many ortographic and gramatical errors as I could with a pencil on the first proof I sent but I must admit I didn't read the whole thing, I had not enough time and it was a specialized text with lots of jargon so as mentioned by others I visually scanned every page twice looking for open lines, short lines, orphans widows, badly hypentated words, three hypens on a row, wrong dashes, double periods after question marks etc...\n\nAfter I got the corrected proof I scanned it again and spoted a couple of extra mistakes.\n\nI also had to make some decisions like substituting bold words with italics, turning some quoutes into indented italic text blocks, etc...\n\nI really had a bad time with one of the authors because he insisted so much in keeping periods after question marks and elipsis and also keeping bold words in the text. I had to show him recommendations against bold and the rules about periods on the \"Manual de Diseño Editorial\".\n\nI liked this job, I also wish there was a way to make it less stressful.\n\nHéctor\n\n"
    },
    {
      "time": "3 Dec 2005 — 8:02am",
      "content": "Hi all,\n\nThank you so much for your different insights and advice. I would say I have a basic grounding in typography from university, although this would be the first time I'd be setting very long documents.\n\nIt also makes me a little nervous that they are thinking of hiring a graduate for the job. I asked my agent at the recruitment agency about this, and she said they want to get someone less experienced to train them up, rather than an experienced designer as it would cost them more! I was also informed that after interviewing a few other designers they didn't get the job because they were too adventurous, and they want someone who is happy to do rather classic book designs.\n\nIn a way I think this might be the best way for me to learn. Someone once told me I have to learn the rules before I can break them!\n\n"
    },
    {
      "time": "3 Dec 2005 — 9:45am",
      "content": "That's ok, but I would be very nervous if someone wanted me to typeset 600 pages in two days... is someone in here capable of such?\n\nHéctor\n\n"
    },
    {
      "time": "3 Dec 2005 — 11:45am",
      "content": "I'm with Héctor, even Cheryl's mention of four days for a 176 page book surprised me (including 9 custom drawn charts and diagrams, that's crazy). While I've done rush jobs in a week, I won't take such projects on anymore because they always end up a disappointment. My old man always said \"if you're not gonna do the job right, do something else,\" so these days (when I can afford to) I decline the rush contracts and seek other projects.\n\nAnd Cheryl, your attitude to this opportunity does sound well suited to the job; that is, seeing your goal as learning the rules (there are lots of them to learn).\n\nAs for suggestions in addition to the [_triumvirate_](http://web.archive.org/web/20131018214131/http:/www.typophile.com/wiki/triumvirate), I echo David's mention of Richard Hendel's _On Book Design_, and Felici's _The Complete Manual of Typography_, as well as Tiff's reference to Hochuli & Kinross' _Designing Books: Practice and Theory_. I found all 3 of these very informative the first time I came across them.\n\n"
    },
    {
      "time": "3 Dec 2005 — 2:53pm",
      "content": "Well I am definitely going to try swotting up with those book recommendations. I will let you know if I get the job!\n\nJust wondering if anyone is reading this, do you work on a freelance basis (taking on a number of different projects) or have a permanent designer/typographer job?\n\n"
    },
    {
      "time": "3 Dec 2005 — 8:49pm",
      "content": "jason,\n\nthanks for that checklist!  \nsometimes it is not so easy to quickly find answers to my questions in the bringhurst book. your checklist has saved me quite a bit of time.\n\n"
    },
    {
      "time": "3 Dec 2005 — 9:52pm",
      "content": "Cheryl,\n\nI do both.\n\nChrisL\n\n"
    },
    {
      "time": "4 Dec 2005 — 8:41am",
      "content": "Cheryl,\n\nI am self employed, mainly kind of a sub-contractor for advertising agencies ang printers, but I do have a few customers of my own. I've done the typesetting for some doctoral dissertations (including charts etc) and annual reports, and I'm sure I couldn't do 600 pages in just a couple of days. i don't usually read the text properly, if it's long, but rather scan for possible problems. There is usually at least one other person to proof-read it, in case I miss something.\n\nAs Miss Tiffany wrote, style sheets are the key here. It takes a bit of time to do the settings for them but they save a lot of time in the long run. If you have the choice, I'd choose InDesing to work with.\n\n"
    },
    {
      "time": "4 Dec 2005 — 6:15pm",
      "content": "Hi there\n\nI just finished up a year of educational publishing as a freelancer (40 books for a variety clients) and I can think of several companies that are looking to hire recent graduates for this kind of work. Just from what you've said I expect that you'll probably only have to flow in text and style it, and in that case 600 pages in a few days is not as scary as it sounds. When I was starting out ten years ago I used to freelance at a place where we would do books like that over the weekend. You'll get really fast and you'll learn how to set up a document in a way that's good for your sanity. It's a great way to learn the mechanical side of the design business.\n\nStyle sheets, master pages, and characters are key. Especially the difference between a hard return and a soft return and a tab. You're going to run into a lot of manuscripts where editorial uses multiple tabs for a soft return and hard returns to break a line.\n\nGood luck! I hope you get the job, and that you keep looking for design opportunities while you're there.\n\n"
    },
    {
      "time": "7 Dec 2005 — 9:34am",
      "content": "Hi all,\n\nI am really pleased to say I got the job! Very excited. I am going to read the triumvirate and other suggestions, and also get into using InDesign! I mainly used Quark at university, I guess it is time to move over to InDesign for good :D\n\nThanks again for your advice, much appreciated!\n\n\\(~\\_~)/ yay!\n\n"
    },
    {
      "time": "7 Dec 2005 — 9:43am",
      "content": "Congratulations, Cheryl!\n\n"
    },
    {
      "time": "8 Dec 2005 — 4:51pm",
      "content": "Congratulations.\n\nWelcome to the world of book typesetting. This is what I've been doing for the past 10 years or so, and I find it immensely gratifying.\n\nYou will cultivate a tremendous attention to and respect for detail. You will often - and sometimes (but not often) mistakenly - assume that attention to a level of detail invisible to most eyes is more important than the holistic book. Should you begin thinking in these absolutes, unable to find a balance between detail and consistency, just remember that detail is consistency, and get back to work.\n\nMake sure you have the largest and brightest monitor possible. I recommend a 23 or 30 inch Apple studio display. It will become one of your closest friends.\n\nDo not attempt to depend on a 1-button mouse. Get a 3-button Microsoft optical mouse or a Microsoft trackball with at least 3 buttons.\n\nRead every Indesign manual / book you can acquire, and learn how to automate the application through stylesheets, macros and Applescript. This will save you untold hours of effort. Refuse to work with Quark or anything else - although Framemaker is acceptable, sometimes.\n\nKeep the Thames & Hudson, the Chicago, MLA, Bringhurst, the AP and the GPO style manuals on your desk at all times and - if you must loan them out - keep backup copies for yourself.\n\nInvest in a good dictionary and a better thesaurus. \"Copyeditor\" may not be in your job description, but a good book typesetter is relied on to settle all arguments of style and usage, even among technical writers. Believe me; I work for two dozen trained writers, and they all look to me and the other typesetter here for answers to questions so arcane that Strunk & White would tremble. Even if you don't have the answer, you must always talk a good game.\n\nStart out working at enormous magnification. I can read through a 140 page book, a line at a time, and edit as I go in one 7.5 hour shift. But it may take you a few years to get there. That's OK.\n\nIf you wear glasses, get a special prescription for use with the monitor you do most of your day to day on.\n\nTry not to start smoking, and don't keep liquor in your desk. These are the fatal flaws of otherwise great typesetters.\n\nAnd to answer your question on reading vs. typesetting:\n\nI typically read 100 pages before in bed every night, in the 45 minutes I read before turning out my lamp. In optimal working conditions, and assuming very well-written and carefully edited copy, an already-finalized template (as if there were such a thing!) and an empty bladder, I may be able to typeset no more than 40 pages in the same amount of time. And I think I'm pretty fast; I think there's at least some connection between typing speed and thinking-while-reading-carefully speed, and I type a bit under 150 wpm.\n\nBest wishes and please to come to us with problems or questions.\n\nYours\n\nJoshua\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20131018214131/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "8 Dec 2005 — 8:41pm",
      "content": "Joshua, lots of interesting info, thanks!\n\n"
    },
    {
      "time": "11 Dec 2005 — 4:11am",
      "content": "Yes, I agree. What wonderful words of advice, Joshua! Thank you.\n\nI am sure I will find the world of typesetting as gratifying as you do. I have ordered a couple of books on InDesign and have started reading The Complete Manual Of Typography to get a head start.\n\nBy the way I cannot believe you type so fast at around 150 wpm! WoW!  \nI have done many secretarial jobs and still manage at only 65 :)\n\n"
    }
  ]
}
