{
  "id": "16580",
  "title": "Typographically well designed sites?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Request:\n\nI’m looking for typographically driven sites as a source of inspiration for a project I have lined up in the new year. I’m not necessarily looking for sites on typography, but sites that make interesting use of type and typography built into the interface. This might include portfolio sites for type designers, type foundries, or book designers, etc., but also sites for non-typographic subjects that use type in an interesting way. I know this is very vague, but after visiting my regular list of web inspiration showcases I’m getting tired of frilly graphic design & fancy-schmancy Flash/CSS bragging and am looking to absorb some understated and clean layouts that use type and typographic principles and “iconography” well.\n\n [‹ Need specification document for TTF font..](http://web.archive.org/web/20070911194722/http:/typophile.com/node/16533 \"Go to previous forum topic\") [Typographic Comic. ›](http://web.archive.org/web/20070911194722/http:/typophile.com/node/16510 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911194722/http://typophile.com/user/3771\" title=\"View user profile.\">jason</a>",
  "time": "<br>",
  "uid": "3771",
  "comments": [
    {
      "time": " 3.Dec.2005 12.30am",
      "content": "[Coudal.com](http://web.archive.org/web/20070911194722/http:/www.coudal.com/) - who made Times Bold look new.\n\n"
    },
    {
      "time": " 3.Dec.2005 4.21am",
      "content": "Well, because of my lack of web sofware knowledge I am doing my actual site in MacOS TextEdit 1.4. Partly due to the lack of (learning) time, the idea of using simple hyper-text came to me time ago, I do need clear information design, therefore I do need typography.  \nAnyhow the credit goes to Matthew Carter and Susan Kare. Feedbacks appreciated.  \n [http://www.bilkent.edu.tr/~segalini/](http://web.archive.org/web/20070911194722/http:/www.bilkent.edu.tr/~segalini/ \"http://www.bilkent.edu.tr/~segalini/\")\n\nRegards,  \nAS\n\n"
    },
    {
      "time": " 3.Dec.2005 7.16am",
      "content": "[Textdrive](http://web.archive.org/web/20070911194722/http:/www.textdrive.com/), my web host, just redesigned — very nice grid and use of “html” text. One of the big people behind it, [Dean Allen](http://web.archive.org/web/20070911194722/http:/www.textism.com/), used to be (and may still be...) a book designer.\n\n"
    },
    {
      "time": " 3.Dec.2005 7.39am",
      "content": "Also see [Mark Boulton’s site](http://web.archive.org/web/20070911194722/http:/www.markboulton.co.uk/) — he has some insightful typography articles, too. Several come to mind...\n\n"
    },
    {
      "time": " 3.Dec.2005 11.29am",
      "content": "Thanks for the suggestions so far, but it does appear I was too vague in my first post. I think of those listed so far, [Boulton](http://web.archive.org/web/20070911194722/http:/www.markboulton.co.uk/)’s site is closest to what I was getting at, yet that site, and others (like Dean’s [Textism](http://web.archive.org/web/20070911194722/http:/www.textism.com/) and [Cardigan](http://web.archive.org/web/20070911194722/http:/www.cardigan.com/)) are great examples of well written CSS, and while [solid and valid CSS](http://web.archive.org/web/20070911194722/http:/www.alistapart.com/) for content is of course part of my quest, I’m actually looking more for interesting use of type and typographic principle in the interface itself; think 1998-2002 when designers weren’t quite so XHTML/CSS Standards-driven and were doing interesting things graphically with type. (I’m not, of course, saying XHTML/CSS Standards should be disregarded, just that they’ve become the goal rather than the tools.)\n\nWhile I’m all for massive restraint and understatement in my book work, the internet is its own animal and should, I think, utilize it’s wide range of opportunity, rather than attempt to simulate newspaper/magazine/book layout & design. I’m not suggesting websites should revert to the visual chaos of graphic pomp so popular not so long ago, but the current trend to pure CSS text in sleek perfect columns on white backgrounds is beginning to bore me to sleep. So, with that rant in place, any other suggestions?\n\n"
    },
    {
      "time": " 3.Dec.2005 11.54am",
      "content": "Don’t know if it’s the kind of thing you’re after, but [OurType](http://web.archive.org/web/20070911194722/http:/www.ourtype.be/) does some nice things with Flash ...\n\nR\n\n"
    },
    {
      "time": " 3.Dec.2005 12.26pm",
      "content": "Hi Robert, yeah, that’s the sort of thing I had in mind. OurType’s site was in the back of my mind, but thanks for bringing it to the front again. While I’m no Flash programmer, the mixture of HTML text and graphic text on this site is the sort of thing I’m looking for to get my kettle boiling. Not “fancy,” but typographcially/visually interesting.\n\n(Of course, another example would be the Flash generated background text in the Typophile entry page. This is what I mean by incorporating type into the interface.)\n\n"
    },
    {
      "time": " 3.Dec.2005 12.53pm",
      "content": "[http://daringfireball.net](http://web.archive.org/web/20070911194722/http:/daringfireball.net/ \"http://daringfireball.net\")  \nunobtrusive and elegant site\n\n"
    },
    {
      "time": " 3.Dec.2005 1.07pm",
      "content": "Here is a page you might like to check: [http://www.csszengarden.com](http://web.archive.org/web/20070911194722/http:/www.csszengarden.com/ \"http://www.csszengarden.com\")\n\nRegards,  \nAS\n\n"
    },
    {
      "time": " 3.Dec.2005 1.09pm",
      "content": "[http://www.sandstromdesign.com/](http://web.archive.org/web/20070911194722/http:/www.sandstromdesign.com/ \"http://www.sandstromdesign.com/\")\n\nI like the simple things.\n\n"
    },
    {
      "time": " 3.Dec.2005 2.06pm",
      "content": "Addison: Dean Allen is a much better writer than he is a designer.  \nJason: Still not sure what you mean. Give us some examples.\n\n"
    },
    {
      "time": " 3.Dec.2005 4.40pm",
      "content": "If I may...\n\n[http://www.vllg.com/](http://web.archive.org/web/20070911194722/http:/www.vllg.com/ \"http://www.vllg.com/\")  \n [http://www.pentagram.com/](http://web.archive.org/web/20070911194722/http:/www.pentagram.com/ \"http://www.pentagram.com/\")  \n [http://www.rigsbydesign.com/](http://web.archive.org/web/20070911194722/http:/www.rigsbydesign.com/ \"http://www.rigsbydesign.com/\")  \n [http://www.samatamason.com/](http://web.archive.org/web/20070911194722/http:/www.samatamason.com/ \"http://www.samatamason.com/\")  \n [http://www.secondstory.com/](http://web.archive.org/web/20070911194722/http:/www.secondstory.com/ \"http://www.secondstory.com/\")  \n [http://www.domineydesign.com/previous/](http://web.archive.org/web/20070911194722/http:/www.domineydesign.com/previous/ \"http://www.domineydesign.com/previous/\")\n\nMany more, but it’s Saturday...\n\n"
    },
    {
      "time": " 3.Dec.2005 4.45pm",
      "content": "As above, the “focus” of the last few sites posted are still content oriented; that is, the priority is clean, simple XHTML copy styled with CSS. No offence to those who have posted, but Alessandro’s first link is sort of the exact opposite of what I’m getting at (no graphic interface at all) and Gary’s sandstorm link is sort of a binary of that (all graphic).\n\nStephen, I wish I could supply a few examples, but that’s exactly my dilemma: I don’t have any examples. The closest thing I’ve seen to what I have in mind is the [OurType](http://web.archive.org/web/20070911194722/http:/www.ourtype.be/) site, where type is both the content and the graphic interface. That, I suppose, is what I’m looking for: a combination of form and content based-on / created-with type.\n\nThanks to everyone who has posted suggestions so far. I’m hoping my rambling might click for someone out there who knows better than I do what I have in mind.\n\n"
    },
    {
      "time": " 4.Dec.2005 8.43am",
      "content": "jason- I couldn’t agree more with your above posting: websites seem to be becoming more and more boring as the web supposedly “matures.” It seems as if the gurus of the internet have decided that boredom is a global requirement. It’s only appropriate that websites are composed of “pages,” because in general the web is simply a static book in an electronic medium. It’s interesting that on the GoLive and Dreamweaver forums used by web designers, that the slightest mention of Flash, other animation, or God forbid, sound, (i.e. anything other than the standard CSS based static and silent designs), draw a response which practically condemns the innocent poster to Abu Gharib prison. Most of the internet: YAWN....ZZZZZZZZZZZZZZZZZZZZZZ...YAWN... Tis’ a shame!  \nDK~\n\n"
    },
    {
      "time": " 4.Dec.2005 1.34pm",
      "content": "Mr. Jason Dewinetz,  \nsince Dennis Brody talks about ‘appropriacy’, if I may ask, what is your project about? I want to ask also because I guess there is no similar idea in the web as the one you have in mind. Ideas demand change. By definition, the application of an idea means that something different will take place in the universe.  \nI don’t take any offense, I am rather glad my site is the exact opposite of what you are looking for, and because I do not waste my time with thoughts about “being even,” I, from now on, think in terms of my overall strategy and I am willing to sacrifice temporary loss in local skirmishes for the advancement of the long term goals.  \nObject-oriented programming is the leading software&nbsp;development technique today——but the logic of object-oriented&nbsp;programming was developed by philosophers like Plato, Aristotle&nbsp;and Porphyry. If you can master the concepts, you can master&nbsp;the details. Many philosophers are surprised to discover that high-tech jobs are often philosophically rewarding as well as financially rewarding. If you love metaphysics, for instance, you’ve great future as a software designer: a large software system is just an enormous conceptual structure, not unlike a great metaphysical system.\n\nRegards, and good luck for your project(s).  \nAS\n\n"
    },
    {
      "time": " 4.Dec.2005 5.24pm",
      "content": "In addition to Second Story, another firm that produces documentary-type work is [Terra Incognita](http://web.archive.org/web/20070911194722/http:/www.terraincognita.com/). Their work is definitely hybrid (if not all Flash) and technically excellent. Most of their projects remind me of what CD-ROMs used to be — and the typopgraphy is usually very well executed.\n\nAnother site I used to love was the Potlatch Paper site that Pentagram produced. It’s no longer up, but [here’s a screenshot](http://web.archive.org/web/20070911194722/http:/www.pentagram.com/en/portfolio-interactive-7.htm).\n\nA couple of others that come to mind are [Hicks Design](http://web.archive.org/web/20070911194722/http:/www.hicksdesign.co.uk/) and [Jared Christensen](http://web.archive.org/web/20070911194722/http:/www.jaredigital.com/). I’ll post more as I think of them...\n\n"
    },
    {
      "time": " 4.Dec.2005 11.44pm",
      "content": "Alessandro,\n\nI’ll take your post gratefully at face value in that you’ve not taken offense to my comments, which had nothing to do with accomplishment or even taste, but simply with objective. My remark as to “opposites” had only to do with setting up a binary: not of “good” and “bad,” but instead “this” and not “that.” The problem, of course, is that I have no “this” to hold up as example.\n\nAs you mention, “appropriacy” is indeed the topic at issue, in that I’m searching for inspiration in order to help me determine the appropriate approach to a project on the horizon, and that project is to present the topic of typography in the medium of a website. To my mind, this hasn’t been done to its potential, and so obviously that’s my goal. I have no illusions about accomplishing that goal, but it’s a goal regardless. To add to this task is the fact that I’ve brought it up here, in a community of well-educated and experienced typographers, which exposes me to all kinds of “pressure.” But that’s rather beside the point. I have a project in mind and I’m seeking input/guidance. This puts me in a position to be critically judged if/when the project comes to light, and I’m grateful for the opportunity. Maybe I’ll crash and burn, who knows. But each project is a challenge and boils down to this: accept the consequences and do, or fear the consequences and do nothing. So I’ll do, with the help of others’ advice, and if it all comes to crap, well, then I’ve discovered one more route to crap which I can perhaps avoid in the future.\n\nI also appreciate your comments on the philosophical connection to technical work. Mathematicians have long discussed the spiritual/philosophical component of their efforts, and it seems to me that the same inhabits this sort of thing as well: _connection_. I tell my students all the time that there’s little more exciting than watching as they grow into code, to find the pattern in the chaos and suddenly “see” what they’re doing. To see the connectedness of every character they type (be it literary or technical). This is trivial, of course, as metaphor, but it is not, of course, simply a metaphor. A broken HTML link to a CSS stylesheet crumbles a website. The wrong word in a delicate simile crumbles a poem. A broken link from practical every-day action to some sense of larger order or system crumbles a life. This is the dilemma. It’s not a matter of designing a website. It’s finding the appropriate method to express an experience. Lofty as all get-out, and pretentious to boot, but it’s what we all do every day, if we do what we do without fear of the consequences.\n\n"
    },
    {
      "time": " 5.Dec.2005 1.09am",
      "content": "Hey check out the following link. It showcases “Devnagari” script.\n\n[http://staff.ncst.ernet.in/1/1/rkjoshi/](http://web.archive.org/web/20070911194722/http:/staff.ncst.ernet.in/1/1/rkjoshi/ \"http://staff.ncst.ernet.in/1/1/rkjoshi/\")  \n [http://staff.ncst.ernet.in/1/1/rkjoshi/rk-main.html](http://web.archive.org/web/20070911194722/http:/staff.ncst.ernet.in/1/1/rkjoshi/rk-main.html \"http://staff.ncst.ernet.in/1/1/rkjoshi/rk-main.html\")\n\nThis may not be what you are looking for however just thought of sharing.\n\n"
    },
    {
      "time": " 5.Dec.2005 5.56am",
      "content": "Here’s another nice one — [the personal site of Isaac Tobin](http://web.archive.org/web/20070911194722/http:/www.isaactobin.com/).\n\n"
    },
    {
      "time": " 5.Dec.2005 7.25am",
      "content": "Mr. Jason Dewinetz, I appreaciate thanks.\n\nSeems that “appropriacy” as a word applied to “Design/Aesthetics” was discussed for the first time in Plato’s “Ippia Maggiore” (“Hippias Major”), a dialogue between Socrate and Ippia, where the case of having a wooden spoon or a golden spoon was one of the topics.\n\nRegards,  \nAS\n\n"
    },
    {
      "time": " 5.Dec.2005 7.47am",
      "content": "Jason, don’t be so dismissive of CSS. There is a current shift away from Flash and toward CSS for very significant reasons. I’m amazed by the work of Cameron Moll based on his clever typographic solutions using CSS.\n\nTake a look at his site, [http://www.cameronmoll.com](http://web.archive.org/web/20070911194722/http:/www.cameronmoll.com/ \"http://www.cameronmoll.com\"), and notice the initial caps in Edwardian Script. He’s accomplished that with CSS. While the content of his site is not solely focused on type, it is a significant display of superior typography on the web — primarily due to wicked mastery of CSS.\n\nAnd don’t overlook web-type-daddy-master Mark Simonson:  \n [http://www.ms-studio.com/FontSales/coquette.html](http://web.archive.org/web/20070911194722/http:/www.ms-studio.com/FontSales/coquette.html \"http://www.ms-studio.com/FontSales/coquette.html\")  \nHe uses a little of everything based on creating the best solution — smart.\n\n"
    },
    {
      "time": " 5.Dec.2005 9.38am",
      "content": "What about something like [http://www.lineto.com/](http://web.archive.org/web/20070911194722/http:/www.lineto.com/) - similar to OurType, by being able to buy fonts etc, but has a bit more to it by way of rendering typefaces on the fly and still looking good, which isn’t the case most of the time.\n\n"
    },
    {
      "time": " 5.Dec.2005 10.42am",
      "content": "BlueStreak, I’m not dismissing CSS at all, and use it extensively. What I’m hoping to avoid, however, is the focus on CSS as the end goal. What I see a lot lately is the dismissing of everything _but_ CSS. It’s the new kid on the block (not so new anymore, really) and so lots of folks are jumping to be the purest of the pure, and it’s getting a bit tired. Cameron’s site has some nice qualities, but to me they’re found in the site’s textures and depth-of-field (amazing what a simple drop-shadow can do to make the “page” pop off the background). The typography there seems well done, but ironically I find it a bit over-done, a bit busy at times (there’s a lot of emphasizing going on in the main column, and that side bar needs some leading, etc.).\n\nAs for this thread, the OurType site is still the closest to what I had in mind, but all of the other suggestions have been helpful in the search for points of reference. It’s not at all that I’m planning to design a site that looks anything at all like OurType, but simply that I’ve been most inspired by that site so far. That site, more than the others, has got my motor runnin’. I’d love to comment on some of the other suggestions, but I have a pile of term-projects to mark and I’ve put them off long enough.\n\nSo, thanks to everyone for their input. Hopefully this thread will continue, but I may not be able to respond for a few days.\n\nAlessandro, thanks for the Plato reference, I’m eager to take a look.\n\n"
    },
    {
      "time": " 5.Dec.2005 11.59am",
      "content": "I think what happens is that initially a site design might involve a graphic designer and be more visually rich but after a while, site maintenance becomes the devil and the master. It is just a royal pain to upkeep the old style tables and Flash sites. CSS is a better solution (at least for now). I much prefer a site where I can quickly find what I want and that is up-to-date in information to one that is glitz and eye-candy. Larger sites use CMS just to handle upkeep. They are most often put together by folks who are more akin to engineers than to graphics types. Their sites work and pages get rebuilt on the fly but they usually don’t have the pizazz you might be looking for.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Dec.2005 12.27pm",
      "content": "One other — [Punchcut](http://web.archive.org/web/20070911194722/http:/punchcut.com/).\n\n"
    },
    {
      "time": " 5.Dec.2005 12.38pm",
      "content": "When I want to see what others are doing. I visit [styleboost.com](http://web.archive.org/web/20070911194722/http:/www.styleboost.com/).\n\n"
    },
    {
      "time": " 5.Dec.2005 3.40pm",
      "content": "Thanks Tiff, some great work there. I tend head to [CSS Import](http://web.archive.org/web/20070911194722/http:/www.cssimport.com/) from time to time, partially to avoid too much Flash, but the stuff I’ve glanced at from Styleboost is very impressive and inspiring, in particular (so far) Tiziana Haug’s site.\n\n"
    },
    {
      "time": " 6.Dec.2005 12.11am",
      "content": "A good friend of mine who approaches web design with outright contempt for web design. No flash or CSS here:\n\n[http://www.followthroughdesign.com/](http://web.archive.org/web/20070911194722/http:/www.followthroughdesign.com/ \"http://www.followthroughdesign.com/\")\n\nNot commercial at all, but it has warmth and a sense of adventure that I seldom feel from flash or php/sql database driven sites.\n\n"
    },
    {
      "time": " 6.Dec.2005 9.49am",
      "content": "I got this today, I thought it was a great post for in here, ah ah, still Italian I am.\n\nFrom:&nbsp;Chriss Fletcher \\<7marcy@about.com\\>  \nSubject:&nbsp;Learn to build simple and clean websites that can bring in the dough...  \nDate: Dec 6, 2005, at 7:24 PM  \nTo: Alessandro Segalini\n\nGrab Microsoft Windows XP Pro and Microsoft Office XP Pro at lowest price ever. $89.95 only.  \nYou never find the same software at such a cheap price anywhere else.  \nIts just Great Product at Great Price.  \nOnce in a lifetime offer.  \nGrab it now or you’ll be the looser.\n\n"
    },
    {
      "time": " 6.Dec.2005 12.07pm",
      "content": "Yes, it’s Flash, but it is also typographically driven.\n\n[http://www.firstbornmultimedia.com](http://web.archive.org/web/20070911194722/http:/www.firstbornmultimedia.com/ \"http://www.firstbornmultimedia.com\")\n\n"
    },
    {
      "time": " 6.Dec.2005 2.16pm",
      "content": "It seems like designers often throw out the basics when designing for the screen. Contrast goes a long way. I’m talking about contrast of size! Which is why Coudal is a great looking blog-style site. One of the best examples of contrast is [Ourtype](http://web.archive.org/web/20070911194722/http:/ourtype.be/).\n\nStep users down into your site. The reason every site looks like a blog these days is because they’re very flat (one template)... Blogs have no template hierarchy that indicates to users that they’re at the top level (directory level or landing page level), versus the deepest levels (articles, content, etc.)\n\nOur site is need of a refresh, but I think what it does well is give users a sense of how deep they are by not only the amount of links and text, but through the presentation of the content. The other thing I’m happy with about it is the variety of templates that come through. That variety is also missed in most flat blog-style sites.\n\nLevel 1: [http://www.punchcut.com/company/](http://web.archive.org/web/20070911194722/http:/www.punchcut.com/company/ \"http://www.punchcut.com/company/\")\n\nLevel 2: [http://www.punchcut.com/experience/solutions.php](http://web.archive.org/web/20070911194722/http:/www.punchcut.com/experience/solutions.php \"http://www.punchcut.com/experience/solutions.php\")\n\nLevel 3: [http://www.punchcut.com/company/partners.php](http://web.archive.org/web/20070911194722/http:/www.punchcut.com/company/partners.php \"http://www.punchcut.com/company/partners.php\")\n\n"
    },
    {
      "time": " 6.Dec.2005 2.29pm",
      "content": "Michael, no need to caveat with “yes, it’s Flash but...” it isn’t 1999 anymore. =)\n\n"
    },
    {
      "time": " 6.Dec.2005 4.50pm",
      "content": "minardi-  \nYour friend’s site at followthroughdesign is truly a breath of fresh air. Too bad sites like that are so few and far between! Thanks for the URL!  \nDK~\n\n"
    },
    {
      "time": " 6.Dec.2005 7.59pm",
      "content": "No problem DK... I completely agree. It’s a shame that tools as interesting as Mambo, MT, wordpress and the like produce such drab and predictable user interfaces. The tradeoffs for interactivity, I guess.\n\nAnyone ever use the [denim program](http://web.archive.org/web/20070911194722/http:/dub.washington.edu/denim/) for website sketching?\n\n[Here’s an example of a denim generated site](http://web.archive.org/web/20070911194722/http:/dub.washington.edu/denim/denim_daily_files/page149.html)\n\nOutsider art for sure, but it facilitates mapping of more immediate and spontaneous user experiences.\n\n"
    },
    {
      "time": " 6.Dec.2005 9.28pm",
      "content": "minardi’s buddy, here. He told me he had given me a plug, with a positive response (thanks, Da Kine,) and I decided to read the works. So, Jason, don’t know what your project is, but if you haven’t checked out my cheap graphic design mini-site:  \n [http://www.followthroughdesign.com/cheap.html](http://web.archive.org/web/20070911194722/http:/www.followthroughdesign.com/cheap.html \"http://www.followthroughdesign.com/cheap.html\")  \nmaybe we can work something out. Low, low, non-AIGA rates!  \nsee you all later.\n\n"
    },
    {
      "time": " 8.Dec.2005 12.00pm",
      "content": "[Another site filled with inspirational (and clickable) goodness.](http://web.archive.org/web/20070911194722/http:/screenspire.com/)\n\n"
    }
  ]
}
