{
  "id": "16602",
  "title": "The history of Palatino™",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "It seems to me that the versions of Palatino™ we see today are slightly... how should I put it... \"dumbed down\" from the one I remember seeing as a kid. This would be only about 25-30 years ago. The version I liked seemed to resemble Michelangleo a little bit, but of course had a lowercase version.\n\nSome of its features as I remember...\n\n• the lowercase e had a much more pronounced diagonal cutoff at its corner  \n• the gooseneck on the numeral 1 was much more pronounced  \n• the thin parts of the zero were roughly diagonal from each other; the zero in the present Palatino™ has its thin parts almost vertical from each other\n\nI'm sure there were more differences, but... am I imagining things here? Can anyone shed some light on this?\n\nBy the way... I love this site. I thought I was the only one around that obsessed about this stuff!\n\nMike\n\n",
  "author": "smirkiston",
  "time": "4 Dec 2005 — 8:03pm",
  "uid": "10321",
  "comments": [
    {
      "time": "4 Dec 2005 — 10:44pm",
      "content": "You can read something here:  \n [http://cg.scs.carleton.ca/~luc/palatino2.html](http://web.archive.org/web/20150227105442/http:/cg.scs.carleton.ca/~luc/palatino2.html \"http://cg.scs.carleton.ca/~luc/palatino2.html\")\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "5 Dec 2005 — 9:52am",
      "content": "Linotype just released Palatino nova which essentially brings back the old Palatino flair.\n\nAdam\n\n"
    },
    {
      "time": "5 Dec 2005 — 9:56am",
      "content": "Yes, please look at Palatino nova at the Linotype website: [http://www.linotype.com/109932/palatinonova-family.html](http://web.archive.org/web/20150227105442/http:/www.linotype.com/109932/palatinonova-family.html \"http://www.linotype.com/109932/palatinonova-family.html\")\n\nThe Medium or Bold weights might have a bit of the the \"Michelangelo with Lowercase\" feeling you were looking for. Also, Michelangelo itself has been revived as part of the Palatino nova family. It is call [Palatino nova Titling](http://web.archive.org/web/20150227105442/http:/www.linotype.com/109974/palatinonovatitling-font.html).\n\n"
    },
    {
      "time": "5 Dec 2005 — 10:01am",
      "content": "Dan, what about Palatino Sans?\n\nCheers, Si\n\n"
    },
    {
      "time": "5 Dec 2005 — 10:28am",
      "content": "Palatino Sans and Palatino Sans Informal are two families that complement Palatino nova perfectly, and which I hope will cause quite a stir. But they are not finished yet, and they will be released later.\n\nI think that this is because Hermann Zapf sees Palatino nova as a family in and of itself… it is his definitive reworking of the entire Palatino family. D. Stempel AG advertised all of the Palatino products (Palatino, Aldus, Michelangelo, Sistina) as a complete, interrelated family, but subsequent conversions were never treated that way (i.e., Palatino Linotype is great, but there is no Aldus whose metrics match Palatino Linotype's exactly, nor a Sistina, Michelangelo, etc.). All of the faces within Palatino nova are interchangeable… that hasn't been easy to get in print since the days of handset type.\n\nPalatino Sans & Palatino Sans Informal will be just as mixable and interchangeable, but aren't part of the Palatino nova family in the simplest sense. Sorry to disappoint ;-)\n\n"
    },
    {
      "time": "5 Dec 2005 — 10:42am",
      "content": "Glad to hear the sans is still be worked on. I'm sure you'll let us know when it's about to hit the streets.\n\nCheers, Si\n\n"
    },
    {
      "time": "5 Dec 2005 — 11:34am",
      "content": "I am looking forward to seeing Palatino Sans. Years ago, Mike Parker related the story of Adrian Frutiger commenting on Zapf's sans serif designs 'Hermann ist nicht ein Groteskermann. Ich bin ein Groteskermann.' I've no idea if this is true, but it's a great story.\n\n"
    },
    {
      "time": "5 Dec 2005 — 11:37am",
      "content": "Mike,\n\nMore to your question: Since Palatino was designed for metal setting in the 40's, it was manufactured in several sizes. Larger cuts, intended for display sizes, would probably have had the features you remember. The digital version available for years was based on drawings for a smaller size, hence the apparent coarseness. Even the original metal type at small sizes differs greatly from the first digital version (I'm looking at one of the first metal settings, Pen and Graver). I don't think Linotype is including any different size variants in the new release. I must disagree with Adam, I think some of the 'flair' of Palatino's display cuts has been lost. Proportions, shapes, details, and color are all different, but some of this may be format conversion issues.\n\nDan, any idea if other sizes of Palatino (besides Michelangelo and Sistina) might be revived?\n\n"
    },
    {
      "time": "5 Dec 2005 — 11:43am",
      "content": "‘Hermann ist nicht ein Groteskermann. Ich bin ein Groteskermann.’\n\nSounds like \"Jack Kennedy was a friend of mine. You are no Jack Kennedy!\" :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Dec 2005 — 12:49pm",
      "content": "_\\>Dan, any idea if other sizes of Palatino (besides Michelangelo and Sistina) might be revived?_\n\nNo, Carl, I don't think so. Michelangelo and Sistina were uniquely-designed members of the overarching Palatino family… they weren't optical revisions for display printing… some of the letters differ radically in ways that don't seem to bear a direct relation to size and legibility… they are meant to harmonize perfectly with Palatino text settings, but not be Palatino text (only larger).\n\nBut even taking this into account, I disgaree that Palatino nova doesn't cover size well. It doesn't have the dizzying array of variants found in Warnock, but it covers the bases that most designers will probably need. Aldus nova is particularly suited to book text (about 8–10 points). Palatino nova Regular is a great all-around Roman, which does quite well in 10–12 points. Palatino nova Medium can also be set small too, depending on printing conditions and needs. Palatino nova Light is good for display purposes, as is Palatino nova Titling (which should be used big), and Palatino nova Imperial, which can be used big as well, but works great in smaller display sizes where Titling might come out too light.\n\nHermann Zapf is certainly not a stranger to legibility techniques used in metal composition sizing… I'm sure that he and Akira took optimal size performance into account in this version. The old \"flair\" of Palatino is certainly present in Palatino nova, it goes back to the original idea of Palatino, which was compromised in conversions to hot-metal and photo-typesetting machines.\n\n"
    },
    {
      "time": "5 Dec 2005 — 2:31pm",
      "content": "The differences I remember, and see checking the luc site and comparing are the right-leaning A and the S and s that are unique--obviously influenced by black letter S. Also pointed out at the luc site are the lack of serif on p and q. also the jpq are shorter than the g. In the original digital version, and also the Optima Nova, the A and Ss are made more 'normal.' serifs given to the pq and EF; and the g also seems somewhat redrawn. Altogether the original has more 'moxie', though the revised version may well work better in text. It is a pity that the new version doesn't at least have the original characters as alternates, for display purposes.\n\nAlso, I don't know if the original Michaelangelo and Sistina had the right leaning A and the quasi black letter S, but I am curious.\n\nHow much was this Zapf? I ask because I can't believe that he wanted the condensed version of Optima that is part of Optima Nova. It really is disappointing, and I am surprised that he approved it.\n\nI am interested to see the sans, especially because of my pet theory that the best sans and the best serifs never come from the same hand. I'd be very happy to be refuted. In any case, coming from Zapf--if it really is from him!--it is bound to be very interesting, however successful.\n\n"
    },
    {
      "time": "5 Dec 2005 — 3:02pm",
      "content": "William, Optima nova, Palatino nova, and the upcoming Palatino Sans & Sans Informal are from Hermann Zapf. Akira collaborates with him, in a way similar to how August Rosenberger collaborated. But the results are Zapf, believe it or not.\n\n"
    },
    {
      "time": "5 Dec 2005 — 3:18pm",
      "content": "If you say so, I believe it Dan. I still don't think that Optima Condensed was a good idea, and I remember when this came up on typophile Tiffany was of the same opinion--only stronger.\n\n"
    },
    {
      "time": "5 Dec 2005 — 3:30pm",
      "content": "That's OK. I can respect that not everyone likes each revision. Optima nova's Italics and Small Caps are quite radical departures, but that is while I like them, personally (it is also why I like Frutiger Next's Italic… but that wasn't really drawn by Frutiger the way that Zapf's new revisions are from Zapf… but that's another matter!). I hope that I can be so flexible and free-thinking at such an advanced age… if I ever make it there!\n\n"
    },
    {
      "time": "5 Dec 2005 — 4:37pm",
      "content": "From what I have seen so far, I think the Palatino Nova is a fine achievement, and I would be very happy to have it in my personal type collection.\n\nThat being said, I agree with the comments that it does not seem to capture the \"moxie\" or flavorfulness of the original metal type, even the 10-12 point versions. There are a number of specific details that spring to mind, but the shape of the serif on the lowercase \"a\" is one of the things that bothers me the most, in comparison to the metal version.\n\nNonetheless, it is a great typeface, and I'm sure it's a better piece of work than anything I'll ever do. :/\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "5 Dec 2005 — 5:00pm",
      "content": "\\> great typeface\n\nOh, yeah, forgot to mention that. It's really wonderful that Zapf has been able to put one of the great typefaces designed in the 20th century into the digital form he wanted. I want it too!\n\n"
    },
    {
      "time": "5 Dec 2005 — 5:01pm",
      "content": "\\> _‘Hermann ist nicht ein Groteskermann. Ich bin ein Groteskermann.’_\n\nOnly the first part of that quote are Frutiger's true words. John, that was actually I who told you of my exchange with him at the _Type 90_ conference in Oxford, where both his Avenir and Zapf's URW Grotesk were shown and promoted.\n\n"
    },
    {
      "time": "5 Dec 2005 — 5:13pm",
      "content": "I had seen Palatino nova before, and while the new revisions certainly work well with each other, they seem to me to be... I think I'll use the word \"sanitized.\" Even more sanitized than the versions common today. There's certainly nothing wrong with these more recent versions, but I think the older versions had so much more character.\n\nOh yeah, and the nova numeral 1 looks goofy. Just my two cents!\n\nMike\n\n"
    },
    {
      "time": "6 Dec 2005 — 12:21am",
      "content": "Ah, thanks for the refresher, Maxim. I was trying to remember who told me the story, and thought it was probably Mike since he was the first person I could put in the context of telling the story who knows both Zapf and Frutiger. Of course it was you.\n\n"
    },
    {
      "time": "6 Dec 2005 — 3:39pm",
      "content": "_Frutiger Next’s Italic… but that wasn’t really drawn by Frutiger the way that Zapf’s new revisions are from Zapf…_\n\nDan, can you elaborate on this?\n\n"
    },
    {
      "time": "6 Dec 2005 — 9:40pm",
      "content": "Sergej, a team of inhouse designers at Linotype several years ago developed Frutiger Next. Adrian Frutiger drew a few new characters for them (like the new ß, quite different from the ß in Frutiger), but the true italic glyphs (a,e,g, etc.) came from the other designers' hands/heads. As you must know, almost every typeface Adrian Frutiger has designed makes use of obliques instead of italics, so Frutiger Next is an interesting exercise in that regard. Frutiger Next also includes condensed styles, which had been asked for by designers for about a decade.\n\nHermann Zapf is much more hands-on and active. Even at 87, he comes into the office regularly to work with Akira on the whatever projects they happen to be working on at the moment. He seems to be in excellent health.\n\n"
    },
    {
      "time": "7 Dec 2005 — 10:11am",
      "content": "The \"nova\" series are corrections of what was originally dumbed down to meet the type 1 requirements, right? When the TT version of Palatino was to be made for Apple, the outlines as supplied by Linotype were the type one versions. I noticed, so Herman was hired to review them before we hinted them. Thus the Apple Palatino, if it still exists, stands corrected.\n\n"
    },
    {
      "time": "7 Dec 2005 — 10:27am",
      "content": "\"...which had been asked for by designers for about a decade.\"\n\nCloser to 2 decades Dan--at least I was since I had the wish.\n\nChrisL\n\n"
    },
    {
      "time": "7 Dec 2005 — 4:55pm",
      "content": "Thank you for your reply, Dan.\n\n"
    },
    {
      "time": "15 Dec 2005 — 9:25am",
      "content": "To me the biggest flaw in digital Palatinos in comparison  \nto the original is the neutered \"t\". Does the Nova fix this?\n\nPalatino Sans: I saw a glimpse at TC2004, and it's nothing short of amazing.\n\n\\> ‘Hermann ist nicht ein Groteskermann. Ich bin ein Groteskermann.’\n\nSo wazzat mean?\n\n\\> Akira collaborates with him\n\nI tend to give more credit to Kobayashi. But I admit I'm not an insider.\n\n\\> The “nova” series are corrections of what was originally  \n\\> dumbed down to meet the type 1 requirements, right?\n\nI think it might be a little more than that (if not much).  \nSee for example the new \"a\" in the new Optima.\n\nhhp\n\n"
    },
    {
      "time": "15 Dec 2005 — 9:31am",
      "content": "So then how does the current Palatino LT std. (in OpenType) offered by Adobe stand with all of you? It might be modified from the original, but it is by all accounts a fine text typeface.\n\n"
    },
    {
      "time": "15 Dec 2005 — 9:56am",
      "content": "\\>So wazzat mean?\n\n\"Hermann is not a 'sans' man. I am a 'sans' man.\" Frutiger I read somewhere doesn't regard Optima as a sans, because in his view a true sans is not stressed--with thick-thin contrast etc.\n\n"
    },
    {
      "time": "15 Dec 2005 — 10:03am",
      "content": "\\> Frutiger I read somewhere doesn’t regard Optima as a  \n\\> sans, because in his view a true sans is not stressed\n\nThat doesn't make sense.\n\nhhp\n\n"
    },
    {
      "time": "15 Dec 2005 — 10:19am",
      "content": "What William means is that a \"true\" sans (in the sense he describes) does not have thicker/thinner parts to it. Optima acts almost like a serif face (but without actual serifs) because it has these features.\n\n"
    },
    {
      "time": "15 Dec 2005 — 10:26am",
      "content": "And what I mean is that such a distinction causes more harm than good. Optima is in fact less of a sans than most sans, but that's not because it has stroke contrast, it's because it has flares. It would actually be better if Frutiger called is a \"true sans\" rather than adopting this misleading distinction.\n\nhhp\n\n"
    },
    {
      "time": "15 Dec 2005 — 10:30am",
      "content": "Perhaps by \"stress\", William also meant \"flares\", or is this pushing it too far?\n\nIn any case, Optima has no serifs, yet it has flares.\n\n"
    },
    {
      "time": "15 Dec 2005 — 10:42am",
      "content": "Hrant, honestly I don't remember exactly what Frutiger said in the article I read, but I do remember distinctly that he didn't think that Optima was a sans, and that it had something to do with it not being monoline enough--or in any case not the flares alone. That's why it stuck in my memory, though obviously not clearly enough. Frutiger's history of the sans, on the linotype site, goes into his views, but doesn't discuss Optima--which reflects his view that it is not a sans.\n\n"
    },
    {
      "time": "16 Dec 2005 — 4:58pm",
      "content": "Maxim above used that same quote in German. My guess is that Frutiger was not thoughtfully coming up with a descrptive definition of what a sans was or wasn't, he was just responding off the top of his head to someone's question. You will have to ask Maxim about the context of the discussion.\n\nChrisL\n\n"
    }
  ]
}
