{
  "id": "16600",
  "title": "Blacklettter is Everywhere",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "How come nobody ever talks about Blackletter? It is absolutely everywhere. Advertisers are using it like it is going out of style and clothing designers are using Blackletters as if they are logos.\n\nI asked Armin at Under Consideration if he should revisit a blog he did in April on the poularity of Blackletter. He responded by saying, “Blackletter is at its peak on mainstream, it can, sadly, only go downhill from here. It became too trendy for its own good.”\n\nHow can a typeface that is over 500 years old be considered going downhill?!!\n\nWhy is Blackletter so popular right now? Where did this stronghold on popular culture come from? And don’t tell me that the Germans are the influence.\n\n",
  "author": "Marco Polo",
  "time": "4 Dec 2005 — 6:36pm",
  "uid": "10459",
  "comments": [
    {
      "time": "4 Dec 2005 — 7:20pm",
      "content": "_How can a typeface that is over 500 years old be considered going downhill?!!_\n\n[Blackletter](http://web.archive.org/web/20130822113731/http:/typophile.com/wiki/Blackletter) is not a \"typeface,\" but a whole family of scripts. Some styles are more popular than others, with the [textura](http://web.archive.org/web/20130822113731/http:/typophile.com/wiki/textura) variety being the forerunner and maybe [fraktur](http://web.archive.org/web/20130822113731/http:/typophile.com/wiki/fraktur) coming in at second place, but a lot of blackletter is still fairly obscure, imo.\n\nMaybe blackletter is so popular now for the same reason that other scripts are: i think it's a backlash against the \"techno\" style: whereas evertything used to be cool if it were futuristic and seemingly made by machine, people now want to be able to feel the influence of the human hand in their design. Of course, scientific studies could prove all my ramblings above are just bunk, but that's my gut reaction.\n\n"
    },
    {
      "time": "4 Dec 2005 — 9:48pm",
      "content": "\\> How come nobody ever talks about Blackletter?\n\nTry this site's search feature - 130 threads that discuss blackletter.\n\nCheers, Si\n\n"
    },
    {
      "time": "5 Dec 2005 — 7:49am",
      "content": "There will always be work for which Blackletter is appropriate. That said, I think its popularity has proven to be cyclical over the years.\n\n"
    },
    {
      "time": "5 Dec 2005 — 8:14am",
      "content": "Peter Bain talks about Blackletter\n\n[http://www.typocircle.co.uk/events/blackletter.live](http://web.archive.org/web/20130822113731/http:/www.typocircle.co.uk/events/blackletter.live \"http://www.typocircle.co.uk/events/blackletter.live\")\n\np.s. some typocircle people have a black tshirt shirt with blackletter on the back.\n\n"
    },
    {
      "time": "5 Dec 2005 — 6:14pm",
      "content": "Thanks for the mention, Vince. And who drew the 3rd Tuesday titling  \nfor the Typo Circle...?  \n [http://www.typocircle.co.uk/index.live](http://web.archive.org/web/20130822113731/http:/www.typocircle.co.uk/index.live \"http://www.typocircle.co.uk/index.live\")\n\nArmin Vit may be right about the peaking of hipness...  \ndesigners ought to use blackletter typefaces and lettering  \nfor the same reasons they choose decorative italics, or  \nblocky sans: 'cause they look good or corporate or festive or evil or...\n\n"
    },
    {
      "time": "5 Dec 2005 — 6:16pm",
      "content": "<cite>And who drew the 3rd Tuesday titling<br>\nfor the Typo Circle…?</cite>\n\nlooks to me like Fette Fraktur, the typeface that is.\n\n"
    },
    {
      "time": "6 Dec 2005 — 6:42am",
      "content": "Nope. It's not type.\n\n"
    },
    {
      "time": "6 Dec 2005 — 7:10am",
      "content": "Dan Reynolds talks about blackletter and we also have a blackletter design critique area here on Typophile.\n\nChrisL\n\n"
    },
    {
      "time": "6 Dec 2005 — 10:35am",
      "content": "Yeah, Chris is right. I actually think that we talk about blackletter quite a lot. I know that blackletter is all over the place now, but I don't think its a new fad… I think that fad has been running more or less pretty strong since about 1991. You might as well go and ask Miles Newlyn why he drew Savage Black… maybe the \"trend\" is even older… Didn't Licko start Totally Gothic is in 1988?\n\nWhatever the cause for the blackletter fad is, it certainly is \\*not\\* the Germans. German designers won't touch the stuff with a ten-foot pole. This is US driven, primarily, although the stuff can be seen all over North, Central, and South America, plus the UK and some of continental Europe.\n\n"
    },
    {
      "time": "13 Dec 2005 — 10:54am",
      "content": "John Butler knows a lot about blackletter too.  \nHe has even started a dedicated section here:  \n [http://typophile.com/forum/11](http://web.archive.org/web/20130822113731/http:/typophile.com/forum/11 \"http://typophile.com/forum/11\") \\_  \nBut something is wrong with it - it's missing  \nmost of the content! Please fix it guys.\n\nIf blackletter is indeed a fading fad now, maybe that means it's high time to take it deeper?\\* Also, I hope the Germans jump in - they should in fact be leading the movement.\n\n\\* [http://www.themicrofoundry.com/ss\\_fraktur1.html](http://web.archive.org/web/20130822113731/http:/www.themicrofoundry.com/ss_fraktur1.html \"http://www.themicrofoundry.com/ss\\_fraktur1.html\")\n\nhhp\n\n"
    },
    {
      "time": "13 Dec 2005 — 11:10am",
      "content": "Just to clarify one thing... My quote above was preceded by \"Blackletter has made its way to an [Ashlee Simpson](http://web.archive.org/web/20130822113731/http:/www.amazon.com/exec/obidos/ASIN/B000B66PD4/uc-20/) CD cover.\" It was within the context of this [discussion](http://web.archive.org/web/20130822113731/http:/www.underconsideration.com/speakup/archives/002273.html) – blackletter typography in mainstream. Hence, the rest of my comment.\n\n"
    },
    {
      "time": "13 Dec 2005 — 11:45am",
      "content": "I saw an interview on MuchMusic (Canada's MTV) about 10 years ago, I think it was with a metal band from Sao Paulo. Anyway, the guy said Blackletter was like Europe's ethnic thing, now that the Latin had become globalized.\n\nThat's the same way the Siberian (?) throat singer who did \"Levee breaks\" said that Led Zeppelin was, from his perspective, world music. Or Memphis Minnie at least.\n\nSo blackletter is historic, ethnic, gothic (in every sense).\n\nThe present vogue is not necessarily nasty gangsta/satanic/ethnic/historicist though, a lot of it is pure formality, to do with the fabulous flourishes. Go Marian! (Same vibe as Spencerian flourishing.)\n\nIt's such a rich vein, capable of holding so many meanings.\n\n"
    }
  ]
}
