{
  "id": "16620",
  "title": "Time for a website for free font development?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Quite a number of things are happening now in the world of free fonts. I've been tossing around ideas in my head for a website to foster the development of fonts to be released under licenses compatible with free software distribution (as opposed to merely \"freeware\" fonts, which is much less interesting). In this post, I will set down my vision for what such a site might look like.\n\nI'm posting this on typophile so I can get feedback from the typographic community, and am also inviting people from the free software world to weigh in, as well. As such, there will probably be some introductions to be made, and I won't be surprised if some controversy erupts as well.\n\n**What's been happening?**\n\nFor those of you who have been following the free font scene closely, this will be old news, but there's been quite a lot of activity I want to briefly summarize.\n\n- The TeX User Group [Development Fund](http://web.archive.org/web/20150330082249/http:/tug.org/tc/devfund/) has sponsored the completion of two font projects: Hrant's Baskerville TMF, and my Inconsolata.\n- SIL has released [Gentium](http://web.archive.org/web/20150330082249/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=Gentium), an attractive font with good multilingual support, under their new OFL license.\n- The Creative Commons project has hired [Jon Phillips](http://web.archive.org/web/20150330082249/http:/creativecommons.org/about/people#53), someone with a longtime interest in both free software (notably, the Inkscape project) and graphic design.\n- The tools available in the free software world have been steadily improving. For example, [FontForge](http://web.archive.org/web/20150330082249/http:/fontforge.sourceforge.net/), while nowhere nearly as polished as FontLab or Fontographer, has matured to the point where it is definitely usable for creating real fonts.\n\nAll of these developments bode well for the future of free fonts.\n\n**What would a free font site do?**\n\nWhile there is a lot of activity, and much in the way of existing infrastructure (including typophile itself), there are several holes that I believe a new site could fill.\n\nFirst and foremost, there is currently no site that presents free fonts well. There is nothing for free fonts like the trial setting features of online font shops. Doing something like the mudTyper at [vllg.com](http://web.archive.org/web/20150330082249/http:/www.vllg.com/fonts/) would be very exciting, and, since the fonts are free, there needn't be any stipple background or other such encumbrances.\n\nA person looking for good free fonts pretty much has to go digging, and that means sorting through a great deal of crap. The various \"thousands of free fonts\" sites don't do much to help with that.\n\nIndeed, the major theme for my ideal site would be quality. Not just abundance (millions of fonts!) or freeness, but quality. When a person posts a really good font, it should be celebrated, which of course will also help motivate people to contribute.\n\nI think an emphasis on quality would be a benefit to the entire font community. There are very, very few top-quality free fonts, and I'm sure this will continue to be the case for a long time. People who are looking for quality can always choose to pay for it. My ideal site would gently encourage people to buy fonts if they find no free font that meets their needs, with an emphasis on independent foundries. Note that this philosophy is fairly different that of many free software proponents, the most radical of whom encourage people to use no non-free software at all.\n\nMany, if not most, developers of free fonts will be people who are not yet very skilled at the craft of font design, but are trying to learn. My ideal site would invite people to post their work, and provide critique, encouragement, and feedback. This role of the proposed site overlaps the critique forums on typophile considerably, and so should perhaps not be separate. I am continually impressed by the level of discussion on the typophile forums. The [Cyrillic uc/lc discussion](http://web.archive.org/web/20150330082249/http:/typophile.com/node/16550) is an excellent recent example of the kind of feedback that would be incredibly useful to aspiring, as well as experienced, font developers.\n\n**Fine-grained collaboration**\n\nOne of the great strengths of the free approach is the way it enables collaboration. If I see something I want to improve, there are as few barriers as possible standing in my way. Similarly, I don't have to commit to a huge project to make an improvement. I can improve a Wiki page in as small a way as correcting a single spelling typo, something that might take ten seconds.\n\nI believe this approach to fine-grained collaboration can also work well in the context of font development. We already see something much like it with people extending existing fonts to cover more scripts, sometimes (as in the [freefont](http://web.archive.org/web/20150330082249/http:/www.nongnu.org/freefont/) project) but not always above-board. Another tantalizing glimpse at how fine-grained collaboration might work is the new 'g' for Matrix from the [Freestyle Remix Challenge](http://web.archive.org/web/20150330082249/http:/www.typophile.com/node/14378) thread.\n\nFine-grained collaboration can also be good for pedagogy. The craft of font design has intimidatingly many facets. Learners may well find it easier to start with just one aspect, such as diacritics or creation of small caps. Someone else might decide to tackle spacing (which, as we know, is one of the major stumbling blocks for beginners). Again, an improvement may be as minor as a single tweak to a kern pair or side bearing, but with a large and active user community, these improvements would add up.\n\nThere are concrete ways in which a font development website can foster such fine-grained collaboration. Primarily, it can treat a font as something like a Wiki or version-controlled repository. If there are multiple versions of the same glyph, it should present the variants to the user, and ask for a vote. To be really ambitious, the site could dynamically synthesize an .otf file based on choices entered on the Web form (on the backend, this would be relatively easy to achieve using the batch scripting capabilities of FontForge).\n\n**Other resources**\n\nThe Creative Commons philosophy includes tending to the body of public domain work in existence, and making it readily available. Fortunately, due to the relatively long lifetimes of fonts as creative works, we have a fantastic array of public domain materials available. I've put a small archive of scans from ATF specimen books [online](http://web.archive.org/web/20150330082249/http:/levien.com/type/) (and TUG is generously [hosting](http://web.archive.org/web/20150330082249/http:/tug.org/levienfonts/) the multigigabyte raw archive of 2400 dpi scans). If there is interest, there is plenty more where that came from. Among other things, my older son can be hired to do some scanning. My experience is that digitizing classics drawn by long-dead masters is a great learning experience.\n\nThe world of free fonts is intimately connected to the world of free software tools for publishing. Of these, TeX is the great granddaddy of them all, and is still actively used, primarily for mathematics work. One of the reasons why TeX rocks out for math is that it natively supports optical scaling, so subscripts and superscripts don't look spindly and anemic like they do in almost all other math systems. I'd love to see more optically scaled fonts available besides Computer Modern, a fairly poor face by typography standards.\n\nThere are also a number of free GUI page layout projects in the works, of which [Scribus](http://web.archive.org/web/20150330082249/http:/www.scribus.org.uk/) is probably the most polished. They're constantly improving their support for OpenType and typographic refinements. A number of good things could come from collaboration with this project, not the least of which is a set of kick-ass good default style sheets.\n\nI have to remain a bit vague and secretive about this because I've been too busy to file the patent yet, but I expect some cool things to happen in the space of free tools for drawing fonts in the next few months. These tools, I think, will be especially useful to amateurs who have not climbed the arduous learning curve of drawing well with Beziers.\n\n**Summary**\n\nMy ideal site would encourage development of fonts for distribution under free software licenses. It would emphasize quality, especially aspiring font designers who want to learn to do better work. It would foster fine-grained collaboration, so that fonts can be improved incrementally, both in quality and in script coverage.\n\nBuilding such a site will require a nontrivial amount of resources. Much as it appeals to me, I'm nowhere near in a position to be able to launch it myself. However, there may well be enough tappable energy to make it happen. Certainly, there are lots of people and organizations with an interest in free fonts.\n\nIs a site along the lines I've presented worthwhile? Would you participate as a developer? As a user? Which organizations, if any, are prepared to throw their weight behind such a project? Who might be willing to put their own time into its development?\n\n",
  "author": "raph",
  "time": "5 Dec 2005 — 3:11pm",
  "uid": "4406",
  "comments": [
    {
      "time": "5 Dec 2005 — 6:30pm",
      "content": "Raph, great idea. It would be a great way to educate people about the time, effort and skill that goes into creating a truly usable typeface as well. They will come for the free fonts, but will learn something along the way. Also, since you will be appealing both to typophiles and to the general public, including graphic designers such as myself, it will be important that the site have visual appeal, and shouldn't bombard people with technical jargon right off the bat.\n\n"
    },
    {
      "time": "6 Dec 2005 — 1:52am",
      "content": "\"Indeed, the major theme for my ideal site would be quality. Not just abundance (millions of fonts!) or freeness, but quality.\"\n\nRaph, how do you see this quality being maintained and not overwhelmed by the masses of low quality free fonts, and the people who want them, that affect most of the other free font sites?\n\nWould there be some sort of editorial control and by who?\n\nCould there be a 'core collection' for the site with a submission/selection process like a commercial foundry?\n\nI look forward to seeing how this develops,\n\nEd.\n\n"
    },
    {
      "time": "6 Dec 2005 — 5:32am",
      "content": "Somehow related:\n\n- [25 Best License-Free Quality Fonts](http://web.archive.org/web/20150330082249/http:/www.alvit.de/blog/article/20-best-license-free-official-fonts)\n- [Typeforge](http://web.archive.org/web/20150330082249/http:/www.typeforge.net/)\n\n"
    },
    {
      "time": "6 Dec 2005 — 3:36pm",
      "content": "mike: Thanks for those links. I didn't know about typeforge, and that site may well fill in many of the gaps I've tried to identify in my post.\n\nedeverett: Those are good questions. There are a number of ways, I think, to achieve some kind of editorial control. Primarily, you need some kind of rating system, and possibly a way to identify the most trustworthy opinions. As it turns out, my last public-interest site, [Advogato](http://web.archive.org/web/20150330082249/http:/advogato.org/) was all about that :)\n\n"
    },
    {
      "time": "6 Dec 2005 — 4:21pm",
      "content": "I think it's a great idea, of course. Unfortunately, like Raph, I can't devote significant time to actually creating a site. I can offer space on tug.org, although I admit the server configuration is rather barebones, since I don't do much for tug. I'm also happy to pay for a domain name and do dns, although that is the least of the problems, I realize. If there's other things TUG might be able to do to help, I'm open to suggestions.\n\nRegarding existing free fonts, I'd just like to mention the [fonts page on tug.org](http://web.archive.org/web/20150330082249/http:/tug.org/fonts/), which I wrote to try to consolidate information about free and semifree fonts with TeX support.\n\nAlso, some people may be interested to know that George Williams wrote an [article on FontForge](http://web.archive.org/web/20150330082249/http:/tug.org/TUGboat/Articles/tb24-3/williams.pdf) which was published in [TUGboat](http://web.archive.org/web/20150330082249/http:/tug.org/TUGboat).\n\nIncidentally, if anyone is interested in working on Raph's huge scan collection which we've uploaded to tug.org, let me know. Just creating index files for all those many, many images would be a great start in making them more accessible.\n\nFinally, I should mention that the support for Hrant, Raph and others comes almost entirely from individual member donations. Memberships and donations are what keep TUG going, so if you have any interest, please consider [supporting TUG](http://web.archive.org/web/20150330082249/http:/tug.org/join.html). (end of commercial; sorry :)\n\nHappy designing,  \nKarl (current TUG president)\n\n"
    },
    {
      "time": "6 Dec 2005 — 5:46pm",
      "content": "I think the existence of the [SIL Open Font License](http://web.archive.org/web/20150330082249/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=OFL) is really important to this. I know it was mentioned in passing, but it's really important to have a model for this.\n\nFWIW, we've had an Adobe lawyer look over the Open Font License and give feedback. Overall it was pretty good.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "7 Dec 2005 — 6:28pm",
      "content": "I don't know, Raph, I really don't know ...\n\nI had a similar idea slash ambition slash dream, or whatever you wonna call it, back in the year 2000. It failed. I don't want to discourage you, though. It might or might not work, depending on where and when. The only way to find out is to do it.\n\nI'm looking forward to play with your curves.\n\nPs. How many people in the free software community do you know who can say something intelligent about typeface design?\n\n"
    },
    {
      "time": "10 Dec 2005 — 11:25pm",
      "content": "Ralph,\n\nyou could also mention [http://www.nongnu.org/freefont/](http://web.archive.org/web/20150330082249/http:/www.nongnu.org/freefont/ \"http://www.nongnu.org/freefont/\") .\n\nA.\n\n"
    },
    {
      "time": "11 Dec 2005 — 1:34pm",
      "content": "The problem with doing things for free is that the goodwill and vitality of the originators only lasts so long before burnout.\n\nTo check out this proposition, I just went to FontLeech, and things are pretty dead there.\n\nIt's hard enough to keep coming up with new stuff even if it's your job.\n\nPerhaps the \"perpetuum mobile\" feature of your site is what you will be patenting, Raph, but I wonder what makes you think this will have legs?\n\n"
    },
    {
      "time": "11 Dec 2005 — 4:07pm",
      "content": "_The problem with doing things for free is that the goodwill and vitality of the originators only lasts so long before burnout._\n\nAs a person who has released over 200 free fonts, I would have to agree with Nick's assessment, especially since there are so many unprincipled low-lifes ought there who will steal free work and re-sell it. All the proposed website would do is provide them with more product, And there are clueless morons out there who believe that, since you give your work away, you must be Santa Claus or, at the very least, their personal font monkey, and they can make special requests of you which, of course, you will gladly fulfill. The proposed website would then enlarge the pool of personal font monkeys.\n\nIf the objective is to create a forum in which neophytes can present their work and have it critiqued, then you want to re-invent the wheel: this website does that. If the objective is to create a clearinghouse where the cheap bastards of the world can come and glom onto free stuff, wham-bam-thank-you-ma'am, that's been done, too.\n\n"
    },
    {
      "time": "11 Dec 2005 — 10:41pm",
      "content": "Adam: I did mention freefont at nongnu, but only in passing.\n\nNick and Nick: thanks for your words of skepticism. I knew I could count on you guys. And thanks for not flaming. Seriously.\n\nA big part of the reason why I posted this in the first place was to gauge the level of interest. Since it seems to be lukewarm at best, and because there are a bunch of people out there doing similar things, it's very unlikely that I'm going to do anything about launching such a site myself. The other people who are trying to get free font development projects going can read this thread and hopefully will get something useful from it.\n\n"
    },
    {
      "time": "12 Dec 2005 — 1:57am",
      "content": "If I understand this correctly I think what Raph is pushing for is significantly different than the 'old' model for releasing free fonts.\n\nOpensource development of software has had a huge success in many areas, most obviously on the internet. This site I believe runs on Drupal, Apache and MySql (?) All of these have been developed as open source for many years without being bled dry by the 'cheap bastards'. **Perhaps there should be more discussion of how the opensource model fits typeface development.**\n\nOne of the biggest challenges to fonts being opensourced is perhaps that _typefaces_ as opposed to fonts are primarily a visual design. Visual designs are traditionally more personal and have a stronger emotional hold on their creators than 'invisible' software. I know this would true of myself—while I'm very attracted to the ideas, when I've been thinking about Raph suggestions, the 'designer' side of me has been saying 'but would you really let anyone do anything with _your_ creation?'. Do designers have too big of an ego for this work? (This is a serious question, speaking as a start-up designer with a (probably misguided) ego/pride in my work.)\n\nHow do other opensource communities support their main contributers? I understand that it can be through commercial sponsorship, this seems to happening to some degree allready with type design. Sometimes it is through 'kudos', people starting out can make a name for themselves if they contribute good work, which could then lead to work on commercial projects. If there was a 'professionally' run organisation for promoting quality opensource fonts could this serve as a launch pad for talented novice type designers? Sometimes the originators of the software sell additional services or extensions to people who are already using their work, perhaps it could lead to work creating custom versions of the fonts?\n\nAre any of these senarios realistic? I've only really just dabbled in both opensource software and type design, so I'm not really able to offer much besides questions.\n\nIt would be fantastic to have a high quality website to point people to when they realise Times New Roman isn't the only typeface and want to learn about and use high quality type, where they aren't intimidated by (the justifiable) £££ price tags. If there could be some sort of centralised 'opensource foundry' to present, promote and distribute the _good_ opensource fonts, I'd hope it would quickly find it's place along side commercial foundries, not competing with them.\n\nEd.\n\n"
    },
    {
      "time": "13 Dec 2005 — 6:56pm",
      "content": "I've wanted a Free/Libra Font portal for some time now. A few years ago I tried to get a bunch of fonts donated to the [Gnome](http://web.archive.org/web/20150330082249/http:/www.gnome.org/) project; we did get Bitstream Vera, and we had offers of quite a few more, but I felt that we needed to do rather more.\n\nI wanted to see the font chooser display font copyright information (or at least the comment field from fonts) and extract URIs from it for a \"visit the Font Web Site\" button... and maybe also a \"Get more fonts' button that would take you to a font portal.\n\nI don't think there is a good business model for Free fonts right now. It's not at all the same as Free software, partly because the work/percieved-value ratio is very different, and of course also because people outside the graphic design and art communities tend not to value type and design.\n\nAs we start to get more software on the GNU/Linux[tm] platform that caters to designers (e.g. inkscape), perhaps we'll start to attract some more people who will create demand for more polished fonts and font software. I don't just mean FontForge and other tools for font designers: try _installing_ a font on Linux sone day! Often you can drag it into `~/.fonts/` but there's no good user interface for inspecting an uninstalled font, nor a way to deactivate a font without removing it.\n\nSo I think we need some more infrastructure. I think what's needed is a combination of raising awareness of typography (this is why I gave a talk on typography at Guadec, for example, explaining how a large part of typography and graphic design involves the human perception system and not just arbitrary \"creative\" decisions that engineers often despise),and at the same time as raising awareness, providing tools.\n\nA portal site for users of Free software should not, I think, exclude links to commercial fonts, since, as I said, I don't believe we have a business model for open source font designers to make a living and pay for food and clean socks. Commercial sponsors of typefaces (e.g. La Monde) generally don't want the fonts being freely distributed and weakening their brand.\n\nI did speak with Richard Stallman about a GNU Font Licence and/or font portal some time ago, and he sounded at least reasonably positive. Today I think the SIL Open Font Licence (er, License) would probably be very satisfactory.\n\n--  \n [Ankh on the Web](http://web.archive.org/web/20150330082249/http:/www.holoweb.net/%7Eliam/)  \n [Words and pictures from old books](http://web.archive.org/web/20150330082249/http:/fromoldbooks.org/)\n\n"
    },
    {
      "time": "14 Dec 2005 — 2:12am",
      "content": "I don't consider Bitstream Vera family free in the Stallmanian sense because I never saw source files for it. Has anyone been able to acquire them?\n\nRaph, you say some people out there are doing similar things. Who are they?\n\n"
    },
    {
      "time": "5 Jan 2006 — 3:41pm",
      "content": "Karl (or Raph),\n\nI can probably also offer hosting space for images; if they are in the public domain, I can also put them on [fromoldbooks.org](http://web.archive.org/web/20150330082249/http:/fromoldbooks.org/) probably with some metadata and searching ability. The down side is that the Web pages have Google ads on them, which currently pay my share of the hosting fees. How many scans are there, and how much space?\n\nLiam\n\n--  \nAnkh on the Web: [http://www.holoweb.net/~liam/](http://web.archive.org/web/20150330082249/http:/www.holoweb.net/~liam/)  \nWords and pictures from old books: [http://fromoldbooks.org/](http://web.archive.org/web/20150330082249/http:/fromoldbooks.org/ \"http://fromoldbooks.org/\")\n\n"
    },
    {
      "time": "6 Jan 2006 — 7:03am",
      "content": "To clarify, are we talking about a web site to promote free fonts (of which there are dozens already) or are we talking more about creating a forum for open source type projects?\n\n"
    },
    {
      "time": "12 Jan 2006 — 11:15am",
      "content": ".\n\n"
    },
    {
      "time": "14 Dec 2006 — 5:01am",
      "content": "raph — Great idea. What happened? Do you (or others) still have plans for a platform (website) that (a) is a handsomely styled and logically structured download archive for free high quality fonts, with advanced testing tools (acting as an Open Foundry); (b) is a discussion and collaboration forum to allow teams of developers to design, critique, edit, code, build, update and manage free fonts?\n\nAs for the quality benchmarking, I think user voting is but one approach, certainly valid, on the condition that votes by accredited users should have more weight. Additionally, and not in the least, there should be a set of minimum quality requirements, such as the file format (e.g. Type 1 being low, OpenType high grade), encoding (mapping), number of glyphs and multilingual support (i.e. extended glyph sets), the availability of small caps, oldstyle figures and ligatures, a minimum set of layout features &c. A grade of sets is also possible, ranking Standard to More-than-Pro fonts.\n\nIf you still have plans, you can count on me. I'd happily post OpenType feature code, help with designing glyphs, and supply documentation regarding historical, traditional use of type.\n\n"
    },
    {
      "time": "16 Feb 2007 — 7:43am",
      "content": "_raph — Great idea. What happened?_\n\nI have been very busy, and am unsure if we have bumped into each other on this topic in another thread.\n\nAt this time Raph and I are working, and openly accepting all other interested individuals, to a project called Typosium. This is designed to be a wiki-like factbase for font releases, a magazine focusing on reviews and analysis, and, while not a font host, an integrated place where you can get to the free or proprietary product. I am specifically bringing over an interactive user/expert paradigm from another media-related project.\n\nTyposium Manifesto  \n [http://typosium.org/deptofplanning/index.php?topic=2.0](http://web.archive.org/web/20150330082249/http:/typosium.org/deptofplanning/index.php?topic=2.0 \"http://typosium.org/deptofplanning/index.php?topic=2.0\")\n\nCurrently, we are discussing organizational structure, and how to create a standard for the editorial content.\n\n"
    },
    {
      "time": "16 Feb 2007 — 9:08am",
      "content": "i think raph has been spending his time [here](http://web.archive.org/web/20150330082249/http:/lists.freedesktop.org/archives/openfontlibrary/), but i might be wrong...\n\n"
    },
    {
      "time": "16 Feb 2007 — 9:58am",
      "content": "Open Font Library . Org and Typosium pose two different and probably compatible solutions to what this thread discusses. I don't see Typosium as a repository for Free fonts, or OFLibrary as a newscenter. However, I think that they can benefit each other, and will each do a better job by not trying to do the other's. I believe Raph is interested and participating in both, but not for the same reasons.\n\n"
    },
    {
      "time": "16 Feb 2007 — 11:48am",
      "content": "\\> Typosium Manifesto\n\nI'm likin' it.\n\nhhp\n\n"
    },
    {
      "time": "16 Feb 2007 — 2:12pm",
      "content": "I think both OFLib and Typosium have the potential to grow into sites that support many of the aims in my original post, but neither of them are anywhere near yet. I'm dabbling in both in the hopes of moving them along. If both end up succeeding within their niches, as Choz outlines, so much the better!\n\n"
    },
    {
      "time": "17 Feb 2007 — 10:04pm",
      "content": "Free Fonts + Free Tools?!  \n [http://milafat.online.fr/arfonts/](http://web.archive.org/web/20150330082249/http:/milafat.online.fr/arfonts/ \"http://milafat.online.fr/arfonts/\")\n\n"
    },
    {
      "time": "17 Feb 2007 — 11:28pm",
      "content": "_I’m likin’ it._\n\nExcellent. I know it is vaporware at this point, but I'm motivated because it is exactly the type of site I would love to have in my bookmark short list, but can't find yet. I welcome you to come throw your 2¢ in, as I imagine you will have constructive ideas before and after launch, particularly based on your familiarity with widely divergent type styles and type culture. Well, that and I encourage everyone to join.\n\n_Free Fonts + Free Tools?!_\n\nTho' I'm limited to a machine translation, which is particularly weak in converting that script, I don't think those are free like \"freedom\". That is what the OFLib, Free Software Foundation, and such are all about. A lot of confusion exists in the free software community because common English uses free to mean \"gratis\" or \"liberty\". In this case those in the movement are referring to the freedom of concepts like math and logic, and thusly, programs. And for now that is interpreted as releasing type under special licenses, like the OFL, GPL or such.\n\n"
    },
    {
      "time": "18 Apr 2007 — 10:41pm",
      "content": "This is an awesome idea. I would be willing to lend as many resources as I can offer. Which is not a lot at this point, but I'm willing to do everything I can.\n\n"
    },
    {
      "time": "9 Jul 2010 — 10:56am",
      "content": "A HIGHLY interesting thread! :) Something like this is precisely what I was seeking info about when I joined this site.\n\nToo bad nothing came of this particular project, but perhaps some kind soul could list all of the very best resources for Open Source Fonts and development?\n\n"
    },
    {
      "time": "9 Jul 2010 — 11:29am",
      "content": "Well, something did come of it... [http://code.google.com/webfonts](http://web.archive.org/web/20150330082249/http:/code.google.com/webfonts \"http://code.google.com/webfonts\") :-)\n\n"
    },
    {
      "time": "18 Nov 2014 — 3:18am",
      "content": "That's good. I also like to contribute in it. Go through the link [http://www.intelliswift.com/drupal-development-services](http://web.archive.org/web/20150330082249/http:/www.intelliswift.com/drupal-development-services \"http://www.intelliswift.com/drupal-development-services\") They are expertise in this.\n\n"
    }
  ]
}
