{
  "id": "16621",
  "title": "Recommend a custom typographer / letterer?",
  "forum": "Design",
  "tags": [

  ],
  "content": "My agency would like to explore creating a custom typeface for a logo (instead of the traditional type/bug combo.)\n\nCan anyone recommend a good letterer or typographer with a nice contemporary but refined style? This is in the pharmaceutical industry, so it can’t be too “crazy”, and standard calligraphy is not the right direction.\n\nThanks,  \nR\n\n [‹ Protest type](http://web.archive.org/web/20081119133354/http:/typophile.com/node/16471 \"Go to previous forum topic\") [Cyrillic: equivalence of upper and lower case ?! ›](http://web.archive.org/web/20081119133354/http:/typophile.com/node/16550 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081119133354/http://typophile.com/user/10421\" title=\"View user profile.\">rsinclair</a>",
  "time": "<br>",
  "uid": "10421",
  "comments": [
    {
      "time": " 5.Dec.2005 5.17pm",
      "content": "[Mark Simonson](http://web.archive.org/web/20081119133354/http:/www.ms-studio.com/)\n\n"
    },
    {
      "time": " 5.Dec.2005 5.21pm",
      "content": "Ray Cruz - [http://www.myfonts.com/person/cruz/ray/](http://web.archive.org/web/20081119133354/http:/www.myfonts.com/person/cruz/ray/ \"http://www.myfonts.com/person/cruz/ray/\")\n\nSi\n\n"
    },
    {
      "time": " 6.Dec.2005 3.32pm",
      "content": "Just wanting to clarify, since you used typographer, lettering, custom typeface and logo all together:\n\nLettering: Hand-written or hand-drawn lettering for reproduction, can be used for titles, logos. signs, etc. Unique, distinct word-shapes or swashes make it impossible to reconstruct using type.  \nTypographer: Uses type, arranges typographic elements, lays out pages, knows typefaces.  \nCustom typeface: Type Designer makes new or modified typeface for use on computers by custom client.  \nLogo: Identity mark for product or company.\n\nSo, what is it you are looking for again? Clearly you don’t want calligraphy. Do you want an alphabet you can use again and again? A single piece of lettering for a logo? One piece in your portfolio (CustomVue) uses custom lettering in a logo. Maybe that is what you are referring to.\n\nA lettering artist like Jill Bell or Michael Clark can do custom hand lettering and logos for reproduction, and both have also made several useful typefaces. Michael and Jill also both do calligraphy.... Then there’s Rob Leuschke.\n\nHope this helps!\n\n"
    },
    {
      "time": " 7.Dec.2005 3.54am",
      "content": "If you like, [Koziupa](http://web.archive.org/web/20081119133354/http:/www.sudtipos.com/koziupa.html) and [Paul](http://web.archive.org/web/20081119133354/http:/www.sudtipos.com/fonts2.htm) could help you with the work too. Feel free to mail me.  \nBest\n\n"
    }
  ]
}
