{
  "id": "16639",
  "title": "The beginnings of a design for a swanky resturant",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm designing a logo for a local resturant for class (the One Caroline St. Bistro). The place is somewhat swanky, its old-style hip, like 1920's blues hip with a very formal quality. I thought for the logo I could design a typeface based off of european posters and magazine hand-lettered type from the 1920s/30s. People like Toulouse Lautrec and others. So I settled on takeing a lot of reference from the first cover to Simplicissimus (which is in the attached image). My typeface keeps coming out very childlike however, and I'm not sure if I should be trying to make it more formal or if the attempt at giving it straight lines is whats ruining its charecter. I've only really done one other typeface so I'm still very new at this, any ideas would be appreciated.\n\nalso, I didn't know where to put this because technically it's only a typeface I'm asking about, but It's really for a logo... I settled on here because I think after I get this sorted out I'll post the rest of it (the full logo) to be critiqued here.\n\n| Attachment | Size |\n| --- | --- |\n| [simpli.jpg](http://web.archive.org/web/20131024045505/http:/typophile.com/files/simpli.jpg) | 61.87 KB |\n\n",
  "author": "Zach Gage",
  "time": "6 Dec 2005 — 11:43am",
  "uid": "10126",
  "comments": [
    {
      "time": "6 Dec 2005 — 12:09pm",
      "content": "It might help to add letter spacing.\n\n"
    },
    {
      "time": "6 Dec 2005 — 12:11pm",
      "content": "Letterspacing and variation are what you need...it looks too perfect right now. Draw it out by hand and then trace that...you'll get better results for sure.\n\n"
    },
    {
      "time": "6 Dec 2005 — 12:13pm",
      "content": "The original example was bad hand-written lettering. Yours is \\*bad but the medium is different, which is why you're getting a different feeling from it. Bad vector doesn't equal bad hand-lettering. If you want that that vernacular feel, try designing in the medium of the original.\n\n\\* If \"bad\" is what you're going for that's not a bad thing. =)\n\n"
    },
    {
      "time": "6 Dec 2005 — 12:32pm",
      "content": "Yeah I think you are all correct... I guess handwritten doesnt transfer to vectors as much as I had hoped. My ability with a marker leaves much to be desired but ill give it a shot.\n\nthanks\n\n"
    },
    {
      "time": "6 Dec 2005 — 1:47pm",
      "content": "Zach,\n\nWhy don't you study a book like \"All American Ads of the 20's\" ( [http://www.amazon.com/gp/product/3822825115/103-9609069-8070254?v=glance...](http://web.archive.org/web/20131024045505/http:/www.amazon.com/gp/product/3822825115/103-9609069-8070254?v=glance&n=283155 \"http://www.amazon.com/gp/product/3822825115/103-9609069-8070254?v=glance&n=283155\"))  \nand find better looking typestyles. I have seen better deco handlettered logos. That might inspire you to pick up a pencil.\n\n"
    },
    {
      "time": "6 Dec 2005 — 2:02pm",
      "content": "Print out what you've done, and then trace over the letters giving the outlines some of that roughness. If you like the proportions of the letters you can use that as a template.\n\n"
    },
    {
      "time": "6 Dec 2005 — 2:08pm",
      "content": "Zach, I'll just add my voice to the others. Your concept has a strong base, but the spirit of the lettering is lost by using the boundaries set by a vector drawing program. You might (or might not) find inspiration in seeing how others have translated the spirit of that time into letters [here](http://web.archive.org/web/20131024045505/http:/www.myfonts.com/search?search%5Btext%5D=toulouse).\n\n"
    },
    {
      "time": "6 Dec 2005 — 2:09pm",
      "content": "oops. Meant to also say that there is great beauty in imperfection.\n\n"
    },
    {
      "time": "7 Dec 2005 — 3:58am",
      "content": "Just a quick observation the o that you have used to create your logo is a 0 (zero).  \nTim\n\n"
    },
    {
      "time": "7 Dec 2005 — 5:00am",
      "content": "What about drawing it in through a graphical tablet? It'll give you the imperfections you need while keeping it as a vector; it'll then allow you to trace a hand-drawn version.\n\nIt's a fine line between cool and naff - it needs imperfection to give it character. Also, duplicate characters (the N, E and O) should have differing glyphs second time around.\n\nAs for the wider picture, it might be nice to keep everything else formal except your logotype; it would allow you to get away with such a quirky logo, if it's kept in check by using relatively formal bounds (i.e. flat colour, conservative/minimal typography and so on).\n\nIt takes some bottle to do something so different, nice one!\n\n"
    },
    {
      "time": "7 Dec 2005 — 8:41am",
      "content": "This is exciting. I'm working on a similar problem right now, and all these replies are inspiring. It has a lot of promise--nice work!  \nNo one else has mentioned this but, it seems to me that the taller cap in Simplicissimus helps to balance the extended 'i' dot. Before you go crazy making these imperfectly perfect, make sure you have the composition nailed down.\n\n"
    },
    {
      "time": "7 Dec 2005 — 10:05am",
      "content": "There's something off about your mix of sharp corners and rounded corners. Definitely don't repeat characters precisely for the logo itself -- hand-trace the repeated characters twice. And when you hand-trace, compromise a bit on the corners in both directions to soften that contrast.\n\n"
    },
    {
      "time": "7 Dec 2005 — 11:44am",
      "content": "I guess I am missing how funky feaux hand lettering translates into \"swanky\"? It looks more like a modest bistro kind of look.\n\nChrisL\n\n"
    },
    {
      "time": "7 Dec 2005 — 11:50am",
      "content": "\"My ability with a marker leaves much to be desired\"\n\nDon't use a marker, use paint and brush just like they did originally.  \nThe swell and swoop of brush work comes naturally with a brush. Give it a try.\n\nChrisL\n\n"
    },
    {
      "time": "8 Dec 2005 — 3:58pm",
      "content": "Oh wow so many responses haha.  \nmiss tiffany: that helped a lot, I've been looking for fontfaces inspired by lautrec and couldn't find any. Tablets and hand tracing are actually an interesting idea. I'd thought of a tablet but hadn't gotten around to trying it, tracing by hand might work even better.\n\nas for brushes, haha if im worse with something beyond a marker it's certainly a brush. I should try it though. Perhaps this weekend now that I actually have time.\n\nAs I was running out of time before the initial critique some classmates suggested I attempt to modify an existing font to get the feel I wanted so I changed Antique Olive - Black and ended up with this:\n\n[http://www.stfj.net/misc/oneCarolineD1.jpg](http://web.archive.org/web/20131024045505/http:/www.stfj.net/misc/oneCarolineD1.jpg \"http://www.stfj.net/misc/oneCarolineD1.jpg\")\n\nThe letters seemed to be working a bit better, but it still feels too childlike as a whole for me. I'd like to make it more bluesish. People in class suggested I make the pianno more organic in a lautrec style to try and contrast it with the letters and make it more formal that way. So recently ive been trying to come up with a way to display the piano in the right organic way, which i haven't found yet.\n\n"
    },
    {
      "time": "9 Dec 2005 — 8:07am",
      "content": "That seems to be working better. I'm starting to feel the Saul Bass ala Night of the Iguana mood.  \n [http://www.movieposter.com/poster/MPW-6807/Night\\_Of\\_The\\_Iguana.html](http://web.archive.org/web/20131024045505/http:/www.movieposter.com/poster/MPW-6807/Night_Of_The_Iguana.html \"http://www.movieposter.com/poster/MPW-6807/Night\\_Of\\_The\\_Iguana.html\")\n\nWork with the type, but consider isolating the iconic elements of the paino and giving it the same treatment as the type. Maybe focus on the keys more, less on the legs etc. and loosen it up, like the type.\n\n"
    },
    {
      "time": "9 Dec 2005 — 2:05pm",
      "content": "I like the new version but look at P22 Daddy-O. A little funker more 50's style. Its definately more fun\n\n"
    },
    {
      "time": "9 Dec 2005 — 6:04pm",
      "content": "I guess it was a Bistro after all.\n\nChrisL\n\n"
    },
    {
      "time": "9 Dec 2005 — 10:34pm",
      "content": "I'm not a logo designer but I like your last logo very much:  \n [http://www.stfj.net/misc/oneCarolineD1.jpg](http://web.archive.org/web/20131024045505/http:/www.stfj.net/misc/oneCarolineD1.jpg \"http://www.stfj.net/misc/oneCarolineD1.jpg\")\n\ngood job!\n\n"
    },
    {
      "time": "9 Dec 2005 — 11:10pm",
      "content": "Looked at Daddy-O, I like how it feels. Might be slightly too funky (upper case R's, T's and lower case A's, but i could modify them.\n\nI think tomorrow I'm going to put a lot of work into it, so I should have something new to show in 24 hours.\n\njupiterboy, you're right, i was starting to feel the saul bass thing too, and I like the idea of fooling with just the iconic keys and not the whole piano.\n\nmatomatic , good call on the upper cap on the S's in simplicissimus, I think i might extend the cap of the C in caroline, I hadn't noticed the cap in the S, i was more looking at how the font was unique in it's having fatter horizontals, and thin stems (as opposed to most fonts I see). What sort of project are you working on? (if you dont mind me asking)\n\nmamouri, thanks.\n\n"
    },
    {
      "time": "14 Dec 2005 — 10:00pm",
      "content": "So heres my third attempt\n\n[http://www.stfj.net/misc/oneCarolineD2.jpg](http://web.archive.org/web/20131024045505/http:/www.stfj.net/misc/oneCarolineD2.jpg \"http://www.stfj.net/misc/oneCarolineD2.jpg\")\n\n"
    },
    {
      "time": "15 Dec 2005 — 3:21am",
      "content": "Wow, I find the third attempet a great improvement. The piano has found its position in a subtle but clear way, I like that a lot. And the bistro feeling is there, definetly.\n\nHowever I think you could work more on the lettering. On the whole it stills differ a little from the feel of the piano keys - the stroke in the drawing seems more natural, maybe because the \"imperfections\" are smaller and more numerous. You could try to give some of that feeling to the letters.\n\nThe straight vertical lines on the counters of the o in \"one\" and \"caroline\" are distracting, I think. They don't fit. In fact, I think you should try to avoid long vertical or horizontal lines. Break them up in small parts, or make them subtly into curves and diagonals.\n\nAlso, if you want to go for the \"hands on\" approach, you could try buying some heavy paper and cutting out the letters with scissors and/or an X-acto knife. And before doing, be sure to jump into some ice-cold water for that extra-shaky effect ;)\n\n"
    },
    {
      "time": "15 Dec 2005 — 11:20am",
      "content": "That's looking convincing to me. Good job. I won't pick the letters apart, but the line under the “st” looks like it just got out of church, where the rest looks like it just finished a hard Saturday night. Congrats.\n\n"
    },
    {
      "time": "16 Dec 2005 — 6:47am",
      "content": "The Piano keys bother me since there is two groups of three black keys next to each other ond the right.  \nI would also feel more comfortable if the keys started from key C. I think real piano keys start from \"A\", but that does not look good. (now you start from \"F\")\n\n"
    },
    {
      "time": "18 Dec 2005 — 3:08am",
      "content": "My problem with the piano keys is they look like teeth. I would explore putting the type into the shape of a baby grand piano.\n\n"
    },
    {
      "time": "21 Dec 2005 — 6:04am",
      "content": "Wow, that third one really nails it. There are adjustments to be made, but overall it's dead-on. I actually like the toothy feel of the keys.\n\n"
    },
    {
      "time": "27 Dec 2005 — 7:39am",
      "content": "Takes me back to the days of designing logos via cutting rubylith. I agree that #3 nails it. The irregular keyboard (both in style, and odd black-key placement) actually add some personality, IMHO.\n\n"
    },
    {
      "time": "27 Dec 2005 — 7:40am",
      "content": "In fact, I'd maybe consider leaving in the 'extra' black key. For those in-the-know, it WILL stick out, but I'm thinking that could be a good thing. Another mental hook to keep the logo in their minds.\n\n"
    },
    {
      "time": "27 Dec 2005 — 7:41am",
      "content": "Oh, and one final comment. Perhaps put the 'st' on the second line rather than the third. I tend to read it as 'Saint Bistro' right now.\n\n"
    },
    {
      "time": "27 Dec 2005 — 9:20am",
      "content": "Holy cow, in 2 quick revisions you've fleshed out the concept so beautifully it completely took me off guard. I personally think it's an excellent execution, there are a few little niggle details here and there that need adjustment but that just comes down to fine tuning.\n\nI'll agree with some of the others about the piano keys, to me the strokes seem to be a little too wavy. Making them slighlty more angular would enhance the Saul Bass look and compliment the letters more. All in all amazing work, I'm dying to hear what your lectureres have to say.\n\n-mmilo\n\n"
    },
    {
      "time": "27 Dec 2005 — 4:23pm",
      "content": "Please do fix the extra black key though? It just makes it look less than professional.\n\nChrisL\n\n"
    },
    {
      "time": "29 Dec 2005 — 10:48pm",
      "content": "re: keys look like teeth\n\nwhen I saw this (and had the same thought) I thought that is was a good thing, since this is for a restaurant after all.\n\nhungry!\n\n"
    },
    {
      "time": "29 Dec 2005 — 10:49pm",
      "content": "also, the line under ST is too straight.\n\nthis is looking good man.\n\n"
    }
  ]
}
