{
  "id": "16679",
  "title": "Please critique.... first attempt at a logo / brand",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Man, do I have respect for you guys who can do this every day. I can’t tell you how long stuff like this takes me...\n\nAnyways, I’d love some feedback on this, it’s for a very small business. The bags that are being made are handbags / purses... thus the straps and the bottom of the graphic.\n\nI like this type of font, but not necessarily sold on this font in particular... any free alternatives that would be better?\n\n| Attachment | Size |\n| --- | --- |\n| [logo2 copy.jpg](http://web.archive.org/web/20071217232457/http:/typophile.com/files/logo2%20copy.jpg) | 71.08 KB |\n\n [‹ My company's logo [critique]](http://web.archive.org/web/20071217232457/http:/www.typophile.com/node/15799 \"Go to previous forum topic\") [Would appreciate som critique on this logo ›](http://web.archive.org/web/20071217232457/http:/www.typophile.com/node/16686 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071217232457/http://www.typophile.com/user/10509\" title=\"View user profile.\">papalarge</a>",
  "time": "<br>",
  "uid": "10509",
  "comments": [
    {
      "time": " 7.Dec.2005 7.19pm",
      "content": "I might try using Tankard’s Shire types to  \ncreate a dark text body for the bag... body.\n\nhhp\n\n"
    },
    {
      "time": " 7.Dec.2005 11.20pm",
      "content": "Darker text would be an improvement. Eras is very 80’s. Your logo looks computer generated. I would hand draw the strap and possibly the font. It doesn’t have to be too complex, but it should be more illustrative.\n\n"
    },
    {
      "time": " 8.Dec.2005 1.05am",
      "content": "Yeah, it’s kinda sterile now. Shire would be pretty cool. But what kind of bags are they? Are they really different or what? The personality of the bags should come through in the type/design, Maybe you should getsomebody to do a complex interlocking line drawing with the name ’woven’ into the shape of the bag. But it should depend on what you want to say.\n\n"
    },
    {
      "time": " 8.Dec.2005 3.22am",
      "content": "If you stick to that design and to the computer generated look, try different weights of the lines surrounding “by”. Apart from that, the uc D in Design is sticking out too far to the left of the bottom black part compared to the N on the right. The D is also slanted too much if you want to keep the lines parallel.\n\n"
    },
    {
      "time": " 8.Dec.2005 5.46am",
      "content": "You don’t have to go totally hand-drawn, the Ordning & Reda identity has always appealed to me...\n\n[http://www.ordning-reda.com/](http://web.archive.org/web/20071217232457/http:/www.ordning-reda.com/ \"http://www.ordning-reda.com/\")\n\n"
    },
    {
      "time": " 8.Dec.2005 6.50am",
      "content": "Hm... I realize you’re in California, but being in St Louis, all I see is the [Arch](http://web.archive.org/web/20071217232457/http:/www.bluffton.edu/~sullivanm/stlsaar/vert.jpg)! (Which is on 65% of small business logos around here).\n\nBut if your main market isn’t St Louis, you’re probably fine. :)\n\n"
    },
    {
      "time": " 8.Dec.2005 9.00am",
      "content": "the first glance made me think of Peter Bruhn’s [Eric Sans](http://web.archive.org/web/20071217232457/http:/www.veer.com/products/typedetail.aspx?image=FOT0000058)\n\nit’s not free but you probably don’t want to use a free font for an identity.\n\n———————————-  \nnc\n\n"
    },
    {
      "time": " 8.Dec.2005 2.54pm",
      "content": "My problem is not with the design but with the marketing. You have to have a name with a label or it has no substance. As it stands now it has no creadibility. Its like saying: A baseball team by design (the baseball meetings were this week). Its never a baseball team by design, its the Yankees, the Red Sox etc. You need to establish a brand or you will fail, because its too generic.\n\n"
    },
    {
      "time": " 8.Dec.2005 4.45pm",
      "content": "Appreciate all of the replies...\n\nEben Sorkin - My design is a little sterile. The bags are made with a sewing machine, and are made of canvas, with different style fabrics woven together. Attached is an example of one bag...\n\n ![](http://web.archive.org/web/20071217232457im_/http:/www.typophile.com/files/sampleBag.jpg)\n\nDan Weaver - Agree with you about the marketing... but the name’s already chosen. So I wouldn’t have any input in that aspect of it. I’m just hoping to make the best of what this company already has.\n\nCannon46 - good ideas... are hand-drawn logos very common? What are some examples I could look at for direction?\n\nStephan Kurz - thanks for the detailed feedback. If I stick with this current design, I’ll definitely make the changes you mentioned.\n\n"
    },
    {
      "time": " 8.Dec.2005 5.17pm",
      "content": "Hand drawn logos are really common - Coca-cola was done by hand. But logos that look as if they were hand drawn because they look rough are less common. Still, less common could mean stading out. Fashion has a large # of hand drawn logos because signatures are used a great deal. Given the picture I think something funky & hand drawn is a good match to your bag’s feeling. There is alot of variety & expressiveness in hand drawing. Think about how you want the stroke to feel. Think or thin? Elegant or rough?\n\n"
    },
    {
      "time": " 9.Dec.2005 3.38am",
      "content": "Looking at the type of bag you sell, your current logo really doesn’t make the most of their features. They look colourful, lively, textured and alive. If you could create a logo (even with the name ’Bags by Design’) with this type of feel, it would serve as a great advertisment!\n\n"
    },
    {
      "time": " 9.Dec.2005 1.46pm",
      "content": "I agree.\n\n"
    }
  ]
}
