{
  "id": "16686",
  "title": "Would appreciate som critique on this logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi  \nwaddaya think? It's for my own company. There's something that bugs me about the 'E', but i can't put finger on it.\n\n| Attachment | Size |\n| --- | --- |\n| [bd\\_logo.gif](http://web.archive.org/web/20131021020930/http:/typophile.com/files/bd_logo.gif) | 5.24 KB |\n| [bd\\_logo\\_2.gif](http://web.archive.org/web/20131021020930/http:/typophile.com/files/bd_logo_2.gif) | 4.91 KB |\n| [bd\\_logo\\_3.gif](http://web.archive.org/web/20131021020930/http:/typophile.com/files/bd_logo_3.gif) | 5.12 KB |\n\n",
  "author": "alexfjelldal",
  "time": "8 Dec 2005 — 7:52am",
  "uid": "5430",
  "comments": [
    {
      "time": "8 Dec 2005 — 8:11am",
      "content": "looks cool. here's my two cents:\n\nthe S looks like it needs to be heavier and wider at the bottom. your E seems upside-down and the inside stroke is a little thin. The B is looking a little small (could be a bit wider). to make it more balanced, you might want to match the counters of the B to the those of the O,D,N, and G.\n\na good resource (that someone recently told me about) is:\n\n[type basics](http://web.archive.org/web/20131021020930/http:/typeworkshop.com/index.php?id1=type-basics)\n\n--------------\n\nnc\n\n"
    },
    {
      "time": "8 Dec 2005 — 9:12am",
      "content": "Just my two cents...\n\nI kinda like the upside-down E... but what would happen if you made the middle stroke as long as or longer than the top and bottom strokes?\n\n"
    },
    {
      "time": "8 Dec 2005 — 2:44pm",
      "content": "Its boring. Mark Simonson has an article in general forums about \"a cleaver use of a g\" You might look at that article and see if it stimulates you to try something creative.\n\n"
    },
    {
      "time": "8 Dec 2005 — 4:08pm",
      "content": "You might try making your N less wide. It distracts me.\n\nDan - That's pretyy heavy eh? I would agree that it isn't Sooooo distictive as yet. A nifty G might be a good way to fix that.\n\n"
    },
    {
      "time": "8 Dec 2005 — 4:14pm",
      "content": "Flip that B! And while the miniscule \"N\" is unique and all, it doesn't make a ton of sense. It's not a \"traditional\" unicase with that majuscule \"E\".\n\n"
    },
    {
      "time": "8 Dec 2005 — 11:37pm",
      "content": "Thanks a lot! I have to finish our christmas card, then i'll work on the logo again. I'll post a new version during the weekend.\n\nAs for boring – don't worry, the logo as a whole isn't finished yet. The obnoxious parts are in the works.\n\n"
    },
    {
      "time": "9 Dec 2005 — 3:14am",
      "content": "Here's a revised version. i made the the middle stroke of the 'e' and the n's stems a bit fatter. i also made the b wider and its counters a bit bigger. what do you think? (I put the attachments in the first post in this discussion, as i couldn't figure out how to put it in this one)\n\n"
    },
    {
      "time": "9 Dec 2005 — 1:33pm",
      "content": "Under the text box there is a link to 'insert image' \\*if\\* your have the latest version of flash (8?) installed. It works. See?\n\n ![](http://web.archive.org/web/20131021020930im_/http:/typophile.com/files/flipdot.jpg)\n\nI think it's getting better. The N does not distrart as much now. BTW Why Bison? Your letter shapes remind me of Jeremy tankard's stuff. Intentional? But his n is set in a more modern feeling face. Your B E and N seem to be pulling in differfent directions. What are you getting at with this combination? It seems hodge-podgy. But maybe I don't get it. Can you explain?\n\n"
    }
  ]
}
