{
  "id": "16697",
  "title": "HERMA – newly created font open for critique",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "hey everybody,\n\nwe've developed a new corporate font for a german firm called HERMA. it's already out and being used, and seems to work fine. (so there aren't any changes to be made, really.)\n\nstill we'd love for whoever is interested to give an open an honest critique. don't hold back, feel free to mention anything on your mind. cheers,\n\ncurtze\n\n| Attachment | Size |\n| --- | --- |\n| [HERMA\\_Sans.pdf](http://web.archive.org/web/20150123143822/http:/typophile.com/files/HERMA_Sans.pdf) | 66.58 KB |\n\n",
  "author": "curtze",
  "time": "8 Dec 2005 — 10:45am",
  "uid": "10524",
  "comments": [
    {
      "time": "8 Dec 2005 — 10:50am",
      "content": "The Black weight is interesting, but the Regular looks a lot like Verdana.\n\n-- [omine.net](http://web.archive.org/web/20150123143822/http:/www.omine.net/)\n\n"
    },
    {
      "time": "8 Dec 2005 — 11:09am",
      "content": "I see Verdana as well. Although, your typeface could look like a lot worse. Did you reference Verdana as you designed this? It almost seems like a normalized -- not for screen -- verison of Verdana.\n\n"
    },
    {
      "time": "8 Dec 2005 — 11:47am",
      "content": "I see what you mean, it looks to be a bit more condensed and tighter fit Verdana. The lc m gives the illusion that the left and right half are not the same width?\n\nChrisL\n\n"
    },
    {
      "time": "8 Dec 2005 — 11:52am",
      "content": "I like the overall feel of the type, even though it indeed seems like a slightly narrower, slightly heavier Verdana. The shapes of the bowl though, and the way they connect to the stems is beautiful and a subtle way of showing its own face.  \nToo bad it doesn't have a proper, real, italic. That together with small caps and old style figures would really finish it off.\n\nLook after Goodness & Truth  \n& Beauty will look after itself\n\n"
    },
    {
      "time": "8 Dec 2005 — 12:00pm",
      "content": "There are some problems with terminal angles which are especially pronounced in the heavier weights. Also, some glyphs have balance issues; the \"8\" looks like it's about to fall over to the left.\n\nLooking very closely, there are some weight problems in the curves in all weights of \"S\", \"s\", and \"ß\". Also, the \"perfection of construction\" of the \"V-Y\" and \"v-y\" isn't helping those letters; the interior angles should be a little be greater to visually equalise the stroke weights. The X and x seem to be horizontally and vertically flipped, so the letters appear top heavy.\n\nOn the last page, check out the big \"can\" in the second line. Besides the right side of the \"c\" needing some fine-tuning, it also needs a little less sidebearing.\n\nHope I don't sound too harsh. This is pretty nice work, but there are some issues which stand between Herma and greatness.\n\n"
    },
    {
      "time": "8 Dec 2005 — 12:44pm",
      "content": "thanks for your input. overall, without making any excuses, we had little time and even less experience, when we churned the thing out. i wonder whether the client would be open for a revised version after a year or so...\n\nregarding the verdana: yes, there was some inspiration there. i feel the verdana is actually a very nice font at small sizes, the larger it gets the more it looses its beauty. and the task for HERMA was to create a single font that works both large size and large amounts of copy.\n\ni had noticed the balance issue on the 8, but had found no elegant way to correct that. some of the other details you mentioned i honestly hadn't noticed as being grave. for me the type was part of the overall corporate design package, and i was worried about the overall feel. now that it's out, i wish i had spent a little more time \"tweaking\".\n\ngo ahead - keep criticising!\n\n"
    },
    {
      "time": "8 Dec 2005 — 1:34pm",
      "content": "Curtze, thanks for taking my critique in the manner in which it was intended. This type has potential, and for a fresh creation by designers with little experience, it is very good indeed.\n\nDid you start with any font's outlines, or was everything drawn \"from scratch\"?\n\n"
    },
    {
      "time": "8 Dec 2005 — 2:43pm",
      "content": "»Did you start with any font’s outlines, or was everything drawn “from scratch”?«\n\ninitially i wanted to merely find a good type for the corporate design, and started playing around with the verdana shapes to get some idea of what i was looking for. i knew i wanted a less generic character but a similar feel with body type.\n\ni also had a good look at nuri and faceplate, but neither qualified as corporate font. and of course thesis sans is always good to use. so overall i can't really say i worked from scratch, and i did no drawing on paper at all.\n\ncheers,  \ncurtze\n\n"
    },
    {
      "time": "15 Dec 2005 — 10:02pm",
      "content": "Pretty decent. Just needs some polish,  \nsomething a \"dedicated\" type designer  \nwould be best at.\n\n\\> large amounts of copy.\n\nFYI, no can do, with a sans.\n\nhhp\n\n"
    }
  ]
}
