{
  "id": "16696",
  "title": "Bringing Bringhurst to the Web",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://webtypography.net/](http://web.archive.org/web/20090707082659/http:/webtypography.net/ \"http://webtypography.net/\")\n\n[via [Daring Fireball](http://web.archive.org/web/20090707082659/http:/daringfireball.net/).]\n\n",
  "author": "<a href=\"/web/20090707082659/http://www.typophile.com/user/1043\" title=\"View user profile.\">Mark Simonson</a>",
  "time": "<br>",
  "uid": "1043",
  "comments": [
    {
      "time": " 8.Dec.2005 10.37am",
      "content": "A worthy project, but let me start in best Typophile fashion by nit-picking the typography of the site.\n\nFor starters, fake small caps???\n\n"
    },
    {
      "time": " 8.Dec.2005 11.03am",
      "content": "Heh, I noticed that, too. Unfortunately, real small caps are impossible in web typography (so far). I would have used a slightly larger size. On my browser (Safari), his small caps are smaller than the lowercase x-height. Feh.\n\n"
    },
    {
      "time": " 8.Dec.2005 11.54am",
      "content": "There are at least a couple orphans lying around -adding a non breaking space usually will sort that out online, but is this really a fair use of the book?\n\nDoes simply adding ’applied to the web’ really allow you to lift a whole book and republish the structure and contents online? It seems to push boundaries of inspiration...\n\nWhat else can we expect next? Ways of Seeing - Online?\n\n"
    },
    {
      "time": " 8.Dec.2005 12.02pm",
      "content": "\\>It seems to push boundaries of inspiration…\n\nGood point.  \nI suspect that legally (for written work, if not for visual) it depends on the ratio of quoted material to new material. And here there seems to be a lot more commenting than swiping. However, it does seem to trade heavily on the status of the original. But if it is not a commercial work? I wonder what academic commentaries (on non-public domain work) do?\n\n"
    },
    {
      "time": " 8.Dec.2005 12.08pm",
      "content": "Yeesh, no small task, and quite likely an impossible situation. Huge potential to end up looking bad unless the person setting the site up has iron-clad CSS experience. For example, here are screenshots of the TOC in FF1.5 and IE6 (both PC). First off, why Flash for the graphic text at top left? Something wrong with a good old GIF or JPG? Then there’s the serious mess up in formatting the TOC entries in IE. Yikes. Perhaps the site is still in very early beta, but, well, hmm...\n\n ![](http://web.archive.org/web/20090707082659im_/http:/www.typophile.com/files/ets4web.gif)\n\n"
    },
    {
      "time": " 8.Dec.2005 1.15pm",
      "content": "I thought the piece on justification and hyphenation might have mentioned the shy as an option. Its odd that despite saying outright ’don’t justify text on the web’, his own clearleft site does just that...\n\n\\>But if it is not a commercial work?\n\nWith prior knowledge of clearleft, i was already imagining this republished as book, ala DOM Scripting, with the complimentary conference ala d.Construct, as per recent form.\n\nIt is odd that typography is not even listed as an interest in his bio... Talent borrow, genius steals?\n\n"
    },
    {
      "time": " 8.Dec.2005 1.17pm",
      "content": "\\> <cite>First off, why Flash for the graphic text at top left?</cite>\n\n(Not that I’m any kind of expert on the subject, but...)  \nI would assume he’s making use of [sIFR](http://web.archive.org/web/20090707082659/http:/www.mikeindustries.com/sifr/).\n\n"
    },
    {
      "time": " 8.Dec.2005 3.44pm",
      "content": "Thanks for that Lauren, good to learn of new things in this area. That said, it still seems like overkill to me; graphics on that site are page headings, not on-the-fly content, and as page headings they could use a bit more attention than trusting any text-to-graphic translator to account for tracking/kerning/etc.\n\n"
    },
    {
      "time": " 8.Dec.2005 10.06pm",
      "content": "It’s a worthy effort. Thanks for the link.\n\n(Re: sIFR. Typophile uses a method similar to sIFR, without the over-complication or use of JavaScript.)\n\n"
    },
    {
      "time": " 10.Dec.2005 3.35am",
      "content": "Cool project, looks like mostly good (like educating and/or entertaining the Great Unwashed) would come out of it. What’s not to like?\n\n"
    },
    {
      "time": " 10.Dec.2005 5.06am",
      "content": "Mark Simonson writes:  \n\\> Unfortunately, real small caps are impossible  \n\\> in web typography (so far).\n\nWhat? With [GlyphGate](http://web.archive.org/web/20090707082659/http:/www.typophile.com/wiki/GlyphGate), small caps have been possible for the last 4 years or so.\n\nA.\n\n"
    },
    {
      "time": " 10.Dec.2005 2.39pm",
      "content": "Wow.  \nHow come it’s not better known or established?  \nShouldn’t we be seeing more kerning and small caps on web sites?\n\n"
    },
    {
      "time": " 10.Dec.2005 4.36pm",
      "content": "I guess em2 solutions, the vendor of GlyphGate, is better at software development than it is at marketing. It’s a beautiful technology. It comes with an optional browser plugin. When the user installs it, he can get arbitrary designed-specified fonts (as “embedded fonts”) on any browser: Opera, Firefox, Safari, IE. Without the plugin, IE/Win users get embedded fonts while users of other browsers get either plain text set in a standard fonts or text rendered into bitmaps — all depending on how the designer sets up his own GlyphGate configuration.\n\nIt even supports hyphenation on the web if the browser principally supports it. E.g. you can set it up the way that IE/Win users get hyphenated full-justified text while users of other browsers get left-aligned unhyphenated text.\n\nIt’s just so much better than anything that the script kiddies with their funny Flash applets have ever come up.\n\nA.\n\n"
    }
  ]
}
