{
  "id": "167",
  "title": "Bible faces",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "\\>in such a violent and problematic world, such things aren't the main drama ?   \n   \nYou need to study more history. The world has been drenched in blood over religious differences.   \n   \nBeing casually tactless about religion - which is the subject here - shows a lack of understanding. Be insulting, or be tactful, but know that the impact of your words on other people will be different than among your friends.\n\n",
  "author": "William Berkson",
  "time": "Fri, 2003-05-23 11:41",
  "uid": "1551",
  "comments": [
    {
      "time": " Fri, 2003-05-23 11:57",
      "content": "I'm not sure the better way to share point of view is the patronizing way. I know that religious questions have made wars, some of the worse, and still do. This is the point where the question of christiannity is different. After centuries, in the occidental world, there is hopefully no more wars related to christiannity. Knowing history, i think, is also knowing differences between different times. And the question is not to be insulting, even with friends. Making fun of something, parodying something, isn't insulting it. Not at all. Is \"The life of Brian\" an insult upon christiannity?\n\n"
    },
    {
      "time": " Fri, 2003-05-23 12:24",
      "content": "\\>After centuries, in the occidental world, there is hopefully no more wars related to christiannity.   \n   \nWrong. I apologize for being patronizing, but your youth is written all over your comments.   \n   \nRight now radical Islamists are urging murder of \"Jews and Crusaders.\" And my President, who doesn't have the excuse of youth, started to talk ignorantly about a 'crusade'(derived from the word 'cross') against terrorism.   \n   \nNow is not the time to be tactless about religion.\n\n"
    },
    {
      "time": " Fri, 2003-05-23 12:35",
      "content": "Radical islamists don't do a war related to christiannity but islam. Christiannity is one of the \"other\", not the cause. And, even if the charming president of the US speaks about religion things, all that he does hasn't any relation with christiannity nor any other religion. Anyway, none of it all as any relation with making fun of christiannity. If we begin by mingling unrelated questions, it won't help a safe talk about it. \"Your youth is written all over your comments\" : i found it really beautiful.\n\n"
    },
    {
      "time": " Fri, 2003-05-23 13:53",
      "content": "_And blasphemy is only such if the person who do it is religious. Someone not believing in the holiyness of something doesn't make a blasphemy, it's only logical._   \n   \nI disagree. Although blasphemy by a believer is surely a more serious affair because it presupposes knowledge of sinful nature of the act, even blasphemy carried out by an unbeliever carries with it the sin of scandal. Remember, you don't have to believe in sin in order to commit sin.   \n   \nIf you recognise that something might be considered blasphemous by a believer but do it anyway you are demonstrating an understanding of the sin of blasphemy and deliberate intent. It doesn't matter whether you believe in what is blasphemed: you understand the objective conditions for blasphemy. The very large number of people without any religious belief who exclaim 'Oh God!' or 'Jesus Christ!' when angry, frustrated, etc. are commiting the objective \\*act\\* of blaspheming.\n\n"
    },
    {
      "time": " Fri, 2003-05-23 14:37",
      "content": "Well; i guess i should never have said that. None was related to the fact of having made fun of christiannity, at least.\n\n"
    },
    {
      "time": " Fri, 2003-05-23 15:18",
      "content": "\\>Making fun of something, parodying something, isn't insulting it.   \n   \nWhat you don't seem to get is that many Christians are indeed offended by much in the media that disparages Christianity. Just because they aren't in your corner of the world, doesn't mean that they aren't everywhere. I can assure you that many are in the US, and that group includes our President, who is a serious Christian.   \n   \nReligious anger, including Christian anger, is very dangerous. That is what I am saying you are naive and mistaken about. Not only Northern Ireland, but also Serbia are recent examples, still festering.   \n   \nAh yes, youth is beautiful. But naivite can be dangerous.\n\n"
    },
    {
      "time": " Fri, 2003-05-23 16:41",
      "content": "In Northern Ireland, religion is invoked in rhetoric and the divisions are broadly drawn along religious lines, but the conflict of the past thirty years is largely due to social and economic inequality, and the 20th century political history of Irish independence is more important than the longer religious history. In many respects, the situation in Northern Ireland is similar to that of apartheid in South Africa, only the systemic inequality is between Protestants (mainly Presbyterian and unionist) and Catholics (largely, but not exclusively, republican), rather than between whites and blacks. The religious aspect of the conflict comes through most obviously on the Unionist side, in the rhetoric of anti-Catholic bigots like Ian Paisley, and the violence of the mobs that terrorise Catholic neighbourhoods during 'marches' simply because they are Catholic. As far as I know, no one on the 'Catholic side' ever describes their struggle as one against Protestantism: it is a political and civil rights struggle, not a religious war.\n\n"
    },
    {
      "time": " Fri, 2003-05-23 17:01",
      "content": "Tiffany, If you are worried about inadvertently offending someone with the use of the 'cross' on the cover, why not employ something as equally iconic or representative for advertising and design? Or would this substitution still be rergarded as blasphemous? crumbs. One could go around in ever diminishing circles with your advertising/design bible! I would quite like to know how you are going to resolve it. And I would like to know why you are choosing to represent advertising/design in a biblical format, cos it looks pretty or the blatant irony?\n\n"
    },
    {
      "time": " Fri, 2003-05-23 17:40",
      "content": "It's a pity that I've left no more time in this interesting discussion, and in a few hours I have to leave for a seminar in book typography.   \nSo please excuse short words (and bad english):   \n   \nGuillaume: I myself estimate separation between church and state a high good. But it's a way of respectable citizenship to respect the beliefs of others. You are right: Christians shouldn't care that kind of things - and in most cases I don't, sometimes I can join laughing. But not everyone is superior to making fun of something - and you should care of the weak. At least because their anger is dangerous for the state and for generous christians too.   \n   \nWilliam: I can't look at Tanyas design that critical. Only the reference to the cross is problematic for me. It could be taken away without changing the \"bible style\". But here in Germany (and I think in Europe) a lot of people are wearing little golden crosses as jewellry, and sometimes definitely not in a possible meaning of gods blessing - christians had to learn to make differences in the meaning and be generous (though of course some few christians name that blasphemy). I havent been in USA: What about cross-jewellry in the USA?   \nThe \"Macintosh bible\" is more problematic for me. It's not only sacred symbols. \"Bible\" is for christians a sacred concept. If you take it to name such a profane thing - the association of \"holy scripture\" to a computer Manual - then in my eyes there is maybe more possible (!) blasphemy as in an inadequate use of the cross. (But don't misunderstand me: I can use that books without heartaches, I only think it's inadequate and I'm concerned about the way too much power, computers get in our world.)   \n   \nJohn: I don't know too much about Northern Ireland, but the things I know (that it's not at first a religious conflict) make me think you are right (\"anti-catholic bigots\"). And when I see/hear of that marches I'm ashamed of that   \ndoing in the name of protestantism. And I can't understand that it's still allowed by the government.   \n   \non the jewish/islamic topic: I think, if an Israeli would take the Talmud design an transfer it to a profane context - the problem is all the same. If we did it across cultural lines   \na) it wouldn't be understandable   \nb) other meanings would run along, for example a ridiculous attitude of the majority to the religious minority.\n\n"
    },
    {
      "time": " Fri, 2003-05-23 17:42",
      "content": "_But here in Germany (and I think in Europe) a lot of people are wearing little golden crosses as jewellry, and sometimes definitely not in a possible meaning of gods blessing - christians had to learn to make differences in the meaning and be generous (though of course some few christians name that blasphemy). I havent been in USA: What about cross-jewellry in the USA?_   \n   \nHuge, both in its popularity and the size of the crosses. In Germany they may be wearing 'little golden crosses as jewellery', but over here they're wearing gigantic pectoral crosses and crucifixes on heavy chains, sometimes more than one at a time. As well as metal crosses, bejewelled ones are also popular.\n\n"
    },
    {
      "time": " Fri, 2003-05-23 23:51",
      "content": "By 'over here' I mean North America in general, and not just the USA.\n\n"
    },
    {
      "time": " Sat, 2003-05-24 21:23",
      "content": "Michael Schlierbach said _\"The use of the cross on the cover could - if I think twice - bother me a little. Could it be that religious importance is applied to design and advertising ?\\* I for example don't like books named as \"bible\" if they aren't\",_   \n   \nI was a little worried about the cross, but I had imagined like you said naming something something when its obviously not - tacky by any means. but I also thought that the symbol (a cross) was pretty universal and well in a way, allowed to be used, worn and displayed.   \n   \nre points made by everyone else: It was not my intention whatsoever to mock, make fun of, or disrespect religions. No where inside or out was I going to have any textual/graphical content that related to bibles or religion specifically in any cheeky or humourous ways. This is why I really wanted to get the fonts correct - so that I wasn't \"mocking\" I simply wished to **borrow** the look and feel of a bible for this book's layout.   \n   \nI had thought that perhaps is was risky - I mean we borrow design elements from everywhere else, but you don't see religious design elements influencing other areas very much at all and its all so beautifully done...It seems that only artists are allowed to use religious elements but when its graphic designer - we're locked out enless we are laying out a bible I guess. Its too bad it always stays within religious material and people get all worked up when its borrowed for something outside that realm.   \n   \nWilliam Berkson said   \n_The issue is using symbols that are sacred to some in a way that negates their sacred symbolism._   \n   \nI don't see how my use of a cross negates at all. Its 2 seperate messages - you see the cross first before you read the text - and the text does not make mention to religion. I didn't \"de-face\" it. Anyone who would be swayed to think that seeing my cross means anything less than a cross and their beleif (if they had) because it has a title mentioning 2003 awards inside it should visit their church immediately if the're that easlily influenced.   \n   \nk - back to reading the rest of this.\n\n"
    },
    {
      "time": " Sat, 2003-05-24 22:32",
      "content": "kris sowersby: I wish I could have resolved it or even had the chance to, but the issue has been layed to rest by mr. art director. probably for best now that I see everything going on in this thread now.   \n   \nYou had also asked: _And I would like to know why you are choosing to represent advertising/design in a biblical format, cos it looks pretty or the blatant irony?_    \n   \nOh boy, well I'm pretty sure this is going to open up a whole new can of worms and everyone going to scream at me. here goes:   \n   \nThe entire concept that I had developed started out with the theme \"15minutes\" opened to all the area firms to submit a concept for rolling out the campaign.   \n   \nHere's where it gets funny. I really wanted to submit something, the bosses weren't really into it. At one point over lunch art director was laughing to himself and mumbled out the idea. He said imagine a picture of a prostitute - that's all we need. and the title \"15 minutes\". we laughed for a bit discussing the idea of how this year we've basically been prostituting our artform, become corporate whores and all sorts of stuff.   \n   \nAnyway: that night I decided forget the bosses, I'm going to submit something for us anyway. I got dressed up, got a friend to take some shots of me leaning into a car and such. came up with the tag line saying: \"its been a tough year,...we've all had to pull a few tricks\" threw it all together that night deciding that the prostitution swing of it would be for the call for entry, y'no in saying hey guys, we know its tough - but come on and show us what you've got anyway.   \n   \nThen further into the night I realized I could make this a full \"realization\" type of concept. I mocked up an escort card for \"the hooker in the poster\" - as a random giveaway with info about the awards and where to get more info. Certain emails targetting specific diciplines of design were sent out as notes from \"the hooker in the poster\" The tickets were actually keys with a \"hotel tag\" packaged in the envelop with the keys.. a note written on a cocktail napkin saying \"meet me at ...and a kiss mark. During the Awards Night presentation the emcees would make remarks about how it was that they came here for an 'appointment' The banners and decorations all \"look but don't touch\" and \"tisk tisk\" shame on you for being here kind of thing. y'no people being persuaded that easily and commenting on how it is that sex still sells. - coming full circle in comparison to our industry. making things look appealing to our targets, being able to help clients get more money stuff like that. The venue was going to be at motel. And what do you find at a motel? when your going to meet a prostitute the one item in that room that could make you think twice might be that bedside table - you know there's a bible in there. so the awards booklet - with all the winners was going to be layed out like as such. but that's not given out until the end of the night, after all the anticipation - its a take home and reference book.   \n   \nI had a much more eloquent rationale before but that's the general gist of it. I think   \n   \nSo, anywho a couple weeks later - much to my surprise that night I had gone to the event about who won the campaign - they called our company name. Whopps!   \n   \nI went in the next morning to tell the bosses what I'd done. hey guys, I kind'a submitted that idea just for fun, but we kind'a won the campaign too - so umm we kind'a havt'a do it now I guess?   \n   \nIts pretty mcuh been my responsibility because they didn't want to participate in the beginning. So going along, going along, everythings worked out wonderfully...I'm starting the layout of the book and all of a sudden the bosses take notice of how doing all this is fun and benefitial I start involving them a little more and ask for input - seems he has opinions about it all now. everything else has been produced and sent out - this is the last piece. LAST. and its back to the drawing board.   \n   \nthe end\n\n"
    },
    {
      "time": " Sun, 2003-05-25 01:10",
      "content": "Ahh, thanks Mr Pemberton, I must have been a little dither-brained.   \n   \nTanya, (sorry about the name mixup) I have an enormous grin splitting my face in two because that is one of the most wickedly funny ideas I have heard in a long time! Ten thousand bravo's and cheers!\n\n"
    },
    {
      "time": " Sun, 2003-05-25 07:54",
      "content": "\\>Only the reference to the cross is problematic for me.   \n   \nThat is what I was saying as well. The word 'bible' I believe just means 'book' in Greek, so it doesn't have any sacred meaning in itself. You have to say 'Holy Bible' or something like that to be clear.   \n   \n\\>\"the hooker in the poster\" - as a random giveaway   \n   \nOops. I didn't realize you were having a festival of bad taste. In that case, the cross fits right in. The degradation of women as amusing, Christianity as amusing. I don't think that ridiculing bad taste by even worse taste is a good idea, but maybe your intended audience will like it.   \n   \n\\>If we did it across cultural lines   \n   \nI'm afraid that you are overlooking the fact that in our world everything public is across cultural lines. There are plenty of Muslims living in Europe and the US and a fair number of Jews in France and England and North America. As well as Hindus, Buddhists, etc. And some of them are designers.   \n   \nWhatever the reasons that some of Christian heritage wear the cross, I can assure you that for non-Christians it is never a neutral symbol, or a symbol merely of religion in general. It is a specifically Christian symbol, and resonates with whatever good and bad feelings one has about Christianity.   \n   \nFYI The layout of a page of Talmud - a central text with commentaries upon commentaries wrapped around it - doesn't have any religious sanctity associated with it. Nor, I think would the formats of printed bibles - 2 columns, drop caps etc. I don't see anything offensive about using either layout in another context.\n\n"
    },
    {
      "time": " Sun, 2003-05-25 10:02",
      "content": "William Berkson said   \n_Oops. I didn't realize you were having a festival of bad taste. In that case, the cross fits right in. The degradation of women as amusing, Christianity as amusing. I don't think that ridiculing bad taste by even worse taste is a good idea, but maybe your intended audience will like it._   \n   \nYou know about 10% of the people who received all the stuff thought it was horrible. I thought that was great that it made them upset, made them think a bit at least. The other 90% thought it was wonderful - and it still isin't over.   \n   \ndegradation of women?! who said women? first off no where have I layed a line saying prostitution is bad, wrong, disgusting, I used myself as a model, again - I prostituted MYSELF for the campaign. don't you understand the tag line? There's me dressed up in nylons and a short skirt. \"its been a tough year, we've all had to pull a few tricks\" Its not that far off an idea. Many designers are taking side jobs, many designers are doing wotever they can to win that RFP. In any sector \"in bed with the client\" is a regular comment. All these things can be suggested by my campaign - but they AREN'T. I put an image with a tag line and title - its up to the recipient to figure out what they want that to mean. I didn't shout any opinions whatsoever.   \n   \nYour quick to judge whats bad taste and all you know is that I've used a symbol from the prostitution industry. What your really saying is that prostitution is in poor taste not my campaign. Am I to ignore industry's that exist simply because they might not be the holiest? I'm simply making a correlation between the first, dare I say honest, and quintesential form of advertising (prostitution) and our industry today. Take for fact that what you see is what you get unlike how we might use animals to sell phones, kids to sell food, ect. ect. but now your saying using sex they way they might to sell sex is poor taste, oh yes they are awful awful people? I can't beleive what they do?, their industry is in bad taste? Get over yourself. In fact one could view it as a nod to the ladies of the night and its simple and everlasting existance. I'm acknowledging the ideas that are common between their industry and ours - if you've come to the conculsion thats in bad taste I suggest you open your mind a little and take note of what you do for a living. You are no more holier than thou. A prostitute was used as a symbol, you should be able to see that the concept was actually relating to issues & ethics, no opinions, no statements made - simply what goes on today and that I left it up to the recipients to discuss. Moreover I'm poking fun at OUR industry, other industry's were used in very matter of fact ways.   \n   \nwould it have been better had I done some kind'a designery eye-candy in some chic style, spring colours, with black turtleneck wearing glamour models sporting the lastest titanium notebooks? Is that concept in better taste for and ad/design awards?   \n   \nsomehow I guess the industry over here sees through all that - for some reason they picked this campaign, I really didn't expect it but perhaps discussion is valued moreso then a purdy looking campaign that gets your attention but says crap all.\n\n"
    },
    {
      "time": " Sun, 2003-05-25 11:17",
      "content": "If one really wants to nitpick, the use of the Latin alphabet to represent just about any major modern language is inseperably tied to Christianity. Most all public and private education, scholarship and history in the Western world can be traced back to monasteries. (And yes, much of it can be traced back further to classical times.) Every time you write down what year it is, every time you write anything at all in the Latin alphabet, you are drawing upon (among other things) Christian history.   \n   \nWhether this demands any sense of reverence or caution obviously depends on what you believe, and you're certainly not going to offend anyone by merely communicating.   \n   \nTanya, I understand and appreciate the message you're trying to convey, but don't expect every Christian to laugh off the casual appropriation of their symbols, regardless of what they're used for.\n\n"
    },
    {
      "time": " Sun, 2003-05-25 11:24",
      "content": "_but over here they're wearing gigantic pectoral crosses and crucifixes on heavy chains, sometimes more than one at a time. As well as metal crosses, bejewelled ones are also popular._   \n   \nThere are Goths in Vancouver?\n\n"
    },
    {
      "time": " Sun, 2003-05-25 12:24",
      "content": "John your right - and if this project had of gone ahead I probably would have removed the cross. I could have represented the look and feel of a bible just as well without it I'm sure. I was unsure myself and heard it once by Michael that it irked him - so it would have been taken off. Its not that big of a deal or an element that's detrimental to the design. What I showed was simply my first comp.   \n   \nregardless of the cross - mentions of it being in bad taste are what are getting me going here. If anything its a reminder of their faith and beleifs. I don't see how using the look and feel of a bible is laughable or humourous and why any Christian should think so. What is I think in bad taste might be if I had a cross in Neon lights perched on top of the building - but unlike what some churches do to get your attention my use of the cross I thought elegant and respectful. I could have highlighted what was cheesy or silly of some congregations in my concept, I could have tied in the offers to the church and how they could get salvation, but that's bad taste, not honest representation.   \n   \nanyway - I don't think this has anything more to do with typography.\n\n"
    },
    {
      "time": " Sun, 2003-05-25 14:48",
      "content": "\\>anyway - I don't think this has anything more to do with typography.   \n   \nI think it has to do with questions of how designers use their skills, though more with symbolism than typography.   \n   \nWhat I don't like about some 'satires' is that they often can't make up their mind about whether they just admire what they are satarizing or actually want to change something.   \n   \nI admire that you have the guts to be satirical. I guess the question is how does your viewpoint affect designers - in other words, what is the message you want to convey about how designers should act? If you are clear about this, I think both the design and the taste issues will be clear.   \n   \nI think that Christian and anti-Christian art can be in good taste or bad taste, and there is a lot in both categories. It is partly a question of honesty.   \n   \nQuestions of taste are complicated and interesting, at least to me.\n\n"
    },
    {
      "time": " Mon, 2003-05-26 11:12",
      "content": "_There are Goths in Vancouver?_   \n   \nThere are, but the current fad seems to be more widely spread. Part of it appears connected to some rap subsubculture of gold chains and shell suits.\n\n"
    },
    {
      "time": " Mon, 2003-05-26 11:27",
      "content": "_You know about 10% of the people who received all the stuff thought it was horrible. I thought that was great that it made them upset, made them think a bit at least._   \n   \nI always find this justification disturbing: the idea that offending people = making them think.   \n   \nIn my experience, people may be offended for two reasons: because they are prejudiced and are thus offended without needing to think about why they are offended or what is offensive, or because they have already thought very carefully about what they believe and so recognise something that is offensive. In the first case, causing offense is no more likely to make a prejudiced person think than anything else (although there may be virtue in offending the bigoted, especially if important principles--e.g. civil rights--are at stake). In the second case, the person is already thinking. Again, in my experience, when 10% of people are offended by something, most of them are offended because the thing is offensive to what they think: the thing itself does not 'make them think a bit at least'. They have already thought and come to the conclusion that some things are morally, aesthetically or intellectually offensive (often all three). Typically, it is the 90% who are not thinking, who accept everything without question, and so cannot even imagine why something might be offensive.\n\n"
    },
    {
      "time": " Mon, 2003-05-26 15:09",
      "content": "I hear that at soc.religion.christianity, religious discussions routinely break out in debates about typography! ;)   \n   \nPaul\n\n"
    },
    {
      "time": " Tue, 2003-05-27 05:34",
      "content": "Let me digress from the philosophistication:   \n   \nHi Tanya,   \nDon't know where this project is in development now, but wanted to add suggestions about the pdf layouts way up the thread. I think these could make all the difference for your project.   \n   \n1) Consider adding verse numbers every one or two lines throughout the text.   \n   \n2) Perhaps a chapter number at the top, though this will probably interfere with your drop cap. (The drop cap is defaulting in the pdf -- or was it adobe sans? :-)   \n   \n3) For the credits: most Bibles have some cross referencing system. Maybe format the credits to look like that? I've seen three versions of cross referencing: a) small column of text between your two body columns b) below the right column of text. c) below both columns of text.   \n   \n4) Do gold foil for the text on the cover. I know the budget is non-existant, but this will make it scream Bible.   \n   \n5) In a perfect world you would bind in a scarlet ribbon for a bookmarker. In a fallen world, just placing a length of trimmed ribbon would add to the Bibleocity.   \n   \nregards,   \nRandy\n\n"
    },
    {
      "time": " Tue, 2003-05-27 08:56",
      "content": "Hehe. You could also have apparatus critici at the bottom of the page noting variant readings in different manuscripts.\n\n"
    },
    {
      "time": " Tue, 2003-05-27 11:46",
      "content": "John Hudson: ok your twisting words here,..you mentioned that \"maybe the intended audience will like it\" I was simply giving you that answer..that 90% did. 10% didn't. No one said they were specifically offended. One comment that sticks out was where a firm was upset because it wasn't anywhere near suggestive of a black tie affair, red carpets, grand hotels venues and the rest of the snobbery they were hoping for. I thought about dropping a prestigious looking metallic filter on the type... for maybe 3 seconds.   \n   \nSure it would have been \"nice\" to pretend our awards were the next nobel prizes, but really now, back to reality.   \n   \nIf anyone files a civil rights complaint with me for producing the campaign I'll letcha know. Until then I'll let my morals, ethics, wits guide me, and my art director, client, committee, and voting public can tell me what works for them -   \n   \nIt was simply an idea I had, that I didn't think was wrong,...what am I to do? Survey the entire planet before I let them have the concept?   \n   \nI wasn't too thrilled with the campaign BC'ers had for their awards - how'd it go? oh yes, \"What would you give to get an award...\"and an image of a woman offering a child up inside a van?   \n   \nIt was the biggest surprise to me that it was chosen. It was a joke that we submitted - a joke that I guess hit a chord with the dim-witted industry out here. 10% of which your welcome to call upon to discuss how stupid the collateral was.   \n   \nJoe: \\<i\\>However,   \nwe're not fine artists, we're a graphic communicators --   \nrepresenting and communicating on the behalf of others.   \nThat comes with a responsibility fine artists aren't bound to.\\</i\\>   \n   \nYes, thanks I'm aware, the \"others\" did choose to have my concept represent and communicate for them - via committee, & public vote. That vote was open to all area industry professionals.   \n   \nI didn't impose this campaign upon anyone.\n\n"
    },
    {
      "time": " Tue, 2003-05-27 16:34",
      "content": "_ok your twisting words here,..you mentioned that \"maybe the intended audience will like it\" I was simply giving you that answer..that 90% did. 10% didn't._   \n   \nI don't recall saying anything about the intended audience liking it. I think you were responding to William Berkson.   \n   \nI don't think I was twisting words. I was simply picking up on what you said regarding 10% of people being _upset_. That was the word you used, 'upset', and in the context of the discussion I took that to mean 'offended', since the discussion was about whether some design ideas might be offensive. You said that you were glad these people were upset because your design 'made them think a bit at least'. I was simply querying this all too common notion that upsetting people = making them think. I really don't much care whether anyone was offended or upset by the imagery of prostitution or simply disappointed not to be able to have an excuse to put on a tux. I just don't see the presumed connection between being upset, for whatever reason, and being made to think a bit. As it happens, I think your prostitution idea is quite witty -- not in the best of taste, but nor are lots of other clever, amusing things --, I just don't think the people who were upset by it were necessarily provoked by it. Many of the things that upset or even offend me are simply tedious and banal and anything but thought provoking.\n\n"
    },
    {
      "time": " Tue, 2003-05-27 16:52",
      "content": "Double post, three weeks later. :-)\n\n"
    },
    {
      "time": " Tue, 2003-05-27 19:32",
      "content": "\\>their industry is in bad taste? Get over yourself.   \n   \nI don't think your personal attacks are called for. I agree with John Hudson that your concept is witty and not in the best taste.   \n   \nI suspect that I think it is worse taste than John does. Here are my reasons. According to the National Organization for Women, there are around the world one million girls every year snatched or sold into prostitution. In North America the sex industry I have read is full of pimps who drug and beat their girls to keep them in line, and take most of their money. Around the world, many are infected with AIDS.   \n   \nIn prostitutes, you are talking about a class of people who are some of the most oppressed and miserable in the world. I just think the fact of this misery means that they are not a good topic of humor or wit. It falls flat on me. Is the sex industry 'awful, awful' - yes it looks that way to me.   \n   \nAnd yes, I do think it is degrading to give sex for money, and that sex is beautiful and even sacred in a good marriage.   \n   \nI may be wrong in my views, but I don't see how it makes me worthy of the contempt you heep on me.\n\n"
    },
    {
      "time": " Tue, 2003-05-27 21:47",
      "content": "Sorry William - when I'm being attacked for no apparent reason I tend to reply. I asked for ideas for fonts guys, nothing more.   \n   \nThis is turning into a strange debate about gender roles when it was never, ever, ever suggested in my campaign.   \n   \nI suspect if I had had a pimp in the ad instead of a prostitute it would have been the same argument? What if I had found a male friend at 3am that night and used him as the model for a prostitute would that have been the same argument?   \n   \nProstitution is NOT the theme of this campaign, your really taking off on a tangent. By your standards we might as well never have a gangster character in an ad piece - cause well - they kill people, skip politicians too or any gov. figure - cause they all lie.   \n   \nI guess the Garry Marshall's movie 'Pretty Woman', Milk Money, Risky Business, Ron Howard's Nightshift, Elizabeth Taylor in Eight, Nick Cage's Leaving Las Vegas was all pretty poor taste too. they had prostitutes in them.   \n   \nFurthermore, what your describing has nothing to do with my campaign. I simply havn't gone anywhere near illustrating the horrors that can happen in my campaign. Its just a character I'm associating with.   \n   \nBut if I'm going to argue we can point out that sex work does not encourage the demeaning of women. Poverty demeans women, and by jumping right off on that neo-Victorian bandwagon your displaying a condescending belief that prostitutes don't know what they're doing and need somebody with more education to protect them. While some may, other women actually choose the profession. In fact many well-off North, South American, European, Asian and a whole gamut of women choose the profession over their medical practice, law degrees. We could argue issues of economic equality, affirmative action, and sexual liberation...but please not my having a \"character\" in an ad piece.   \n   \nWould it help if I said the prostitute in my ad chose her profession and she's not beaten, dosen't do drugs, and has no pimp to report to. In fact she's having a good time? I did after all volunteer and give consent to myself to use the picture.   \n   \nTo rival your association plug there's also the _\"President�s Interagency Council on Women\", which is co-chaired by Hillary Rodham Clinton, which urges the adoption of a definition of prostitution that would, based on the so-called \"need\" for women to have control over their own bodies, call \"voluntary\" prostitution a legitimate form of labor._    \n   \nyou can look it up and see what they say...   \n   \nIn any case I'm no expert on the subject, nor do I even agree with some sex trade practices. I know horrors have happened - we simply don't see eye to eye\n\n"
    },
    {
      "time": " Tue, 2003-05-27 23:14",
      "content": "_But if I'm going to argue we can point out that sex work does not encourage the demeaning of women. Poverty demeans women, and by jumping right off on that neo-Victorian bandwagon your displaying a condescending belief that prostitutes don't know what they're doing and need somebody with more education to protect them. While some may, other women actually choose the profession._   \n   \nI know this is a popular view today, but this sad article tells a different story, and I don't think anyone can accuse _The Guardian_ of being on a 'neo-Victorian bandwagon':   \n   \n [http://www.guardian.co.uk/comment/story/0,3604,952285,00.html](http://web.archive.org/web/20050516050417/http:/www.guardian.co.uk/comment/story/0%2C3604%2C952285%2C00.html)   \n   \nVoluntary prostitution of the kind you describe is very much the minority and, as Liz Kelly, director of the child and women's abuse study unit at London Metropolitan University, even those women who 'choose the way of life ... talk of the terrible damage it did them, once they get out of it'. The unfortunate truth is that most 'sex trade workers' are slaves of one kind of another: financially, physically or by addicition.   \n   \nAs you say, this is turning into a strange debate. I'm ready to go back to typography.\n\n"
    },
    {
      "time": " Wed, 2003-05-28 06:08",
      "content": "\\>when I'm being attacked for no apparent reason I tend to reply   \n   \nTanya, I didn't attack you, and I did initially make appropriate typeface proposals. After you made clear your proposal I criticised it as in bad taste, and explained why. I never attacked you personally, only your proposal. There is a difference.   \n   \nI think that tough criticism of works in progress is productive, and personal criticism counter-productive.\n\n"
    },
    {
      "time": " Wed, 2003-05-28 09:37",
      "content": "Tanya, you rule.   \n   \n\\> ITC Weidemann   \n   \nBut what a homely lc \"g\"! :-/   \n   \n\\> Ask yourself, would you consider making your project look like the Qu'ran or the Talmud?   \n   \nIt's not so simple. Nothing is equal, certainly not to an individual. Political correctness is for politicians (and look where they're taking us) - real people have real opinions, and there are very few good reasons to hide them. Selling more of your crappy product (I don't mean you, Tanya) is not one.   \n   \nAs for using a cross, I think it's just peachy, except in terms of possibly being too self-important. It has to _deserve_ it - although certainly not because Christianity is such a respectable religion - I'm a Christian (on some level), but I don't think it's so hot. I myself use it simply as a device against assimilation, since we Armenians have our own branch.   \n   \n\\> What about cross-jewellry in the USA?   \n   \nWell, middle-eastern-looking Christians have developed decidedly stronger necks since S-11...   \n   \n\\> the use of the Latin alphabet to represent just about any major modern language is inseperably tied to Christianity.   \n   \nThis is so obviously incorrect.   \n   \n\\> I was simply querying this all too common notion that upsetting people = making them think.   \n   \nWell, emotion is indeed a great trigger for thought.   \n   \n\\> most 'sex trade workers' are slaves of one kind of another   \n   \nYou mean unlike the rest of us? :-/   \n   \nProstitution is an integral part of society, and I'm not talking specifically about the sexual variety. And some people are prostitutes to their faith, or themselves.   \n   \nhhp\n\n"
    },
    {
      "time": " Mon, 2003-06-02 22:01",
      "content": "I wrote: _the use of the Latin alphabet to represent just about any major modern language is inseperably tied to Christianity._   \n   \nHrant replied: _This is so obviously incorrect._   \n   \nAaack, you're right. I'm so sorry. The correct spelling is \"inseparably.\"\n\n"
    },
    {
      "time": " Mon, 2003-06-02 22:07",
      "content": "Quick Reminder:   \nYou celebrate Christmas on the wrong date because of the people who invented the Latin alphabet!   \n   \nhhp\n\n"
    },
    {
      "time": " Tue, 2003-06-03 07:17",
      "content": "\\>tied to Christianity.   \nThe uppercase letters are pre-Christian. The lower case - Carolingian miniscule - was developed by Christian scribes. It isn't either-or but both-and. When the decision was made in the renaissance to mix the two alphabets, Carolingian miniscule was used as the closest in look and feel to the true Roman letters. To me black letter is much more tied in spirit to Christianity, in particular to Gothic Churches.   \n   \n\\>Prostitution is an integral part of society, and I'm not talking specifically about the sexual variety.   \n   \nThe metaphor has been overused to death. Metaphorical and real prostitution are two very different things. That is what got me so exercised about Tanya's campaign.   \n   \nI just saw on TV, though, that there in a program in which 15 women are competing for 1 man, but the man is not told that the actual prize for 'winning' is not the man, but one million dollars. This is so many orders of magnitude worse than anything in Tanya's campaign that I feel a little sheepish about having called her on the relatively minor violation of taste involved in her campaign.\n\n"
    },
    {
      "time": " Tue, 2003-06-03 08:29",
      "content": "Your Western-ness is written all over your comments.   \nGet over the primacy of the physical realm - it's an illusion.   \n   \nhhp\n\n"
    },
    {
      "time": " Tue, 2003-06-03 13:40",
      "content": "_Get over the primacy of the physical realm - it's an illusion._   \n   \nThis pretty much sums up my investment strategy during the late 90s. I'm not so keen on it these days.\n\n"
    }
  ]
}
