{
  "id": "16707",
  "title": "tell me what you think of my first typeface",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "i'm another one of those City College of San Francisco type design students who have been posting on the forum. this too is my first typeface. it's also my first time postingon Typophile.  \nthis is a work in progress, originally inspired by type styles from the 50s and 60s...but it seems to have evolved into something more personal, which is okay but unexpected. it definitely still needs work on the spacing so i'm well aware of that. some of letterforms need to be tweaked and adjusted as well. also, there's actually \\*more\\* consistency in the letters currently than i was originally shooting for and now i'm thinking about loosening it up a little.  \nso i would love some feedback from people on anything about this typeface.\n\nthanks. jill.\n\n| Attachment | Size |\n| --- | --- |\n| [twiggy spec.pdf](http://web.archive.org/web/20150419075425/http:/typophile.com/files/twiggy%20spec.pdf) | 30.3 KB |\n\n",
  "author": "jillM",
  "time": "8 Dec 2005 — 7:34pm",
  "uid": "10529",
  "comments": [
    {
      "time": "8 Dec 2005 — 8:33pm",
      "content": "I think your m won't fly when you start seting stuff in this. It somehow lacks 'm'ness. The verticals in P & several other letters seem overly thin where your O is quite a bit thicker. This face has the quality of a doodle - so it feels really casual. Thats fine but I think it would be nicer & more versitale with a little more consistancy of stroke. I agree you can loosen it up but not randomly. It should be done to create distictiveness between letters and to help you recognize letters. Your numbers have this quality. They have more vivacity and are easier to recognize than your letters. If you can get more of the number feeling into the letters they will get better.\n\n"
    },
    {
      "time": "8 Dec 2005 — 11:11pm",
      "content": "City College of SF has a type design program? Or a regular class? Who teaches it?\n\nCurious T\n\n"
    },
    {
      "time": "9 Dec 2005 — 11:26am",
      "content": "Very lively and fun. I disagree with Eben about the m, but in the capitals there is definitely a weight discrepancy between the straights and the rounds. And your capital M stands out as rather uptight; loosen it up and get it to join the party. I think your asterisk ought to be wilder too; try it with five or six of those slightly bifurcated triangular terminals instead of the rounded.\n\n"
    },
    {
      "time": "9 Dec 2005 — 1:43pm",
      "content": "Thomas -\n\nWe have 2 new classes at CCSF: [GRPH 151 Lettering and Type](http://web.archive.org/web/20150419075425/http:/www.ccsf.edu/Catalog/Art/grphcors.html#GRPH%20151) and [GRPH 152 Digital Font Creation](http://web.archive.org/web/20150419075425/http:/www.ccsf.edu/Catalog/Art/grphcors.html#GRPH%20152) -- not really a program. I teach 'em.\n\n- Amy\n\n"
    },
    {
      "time": "9 Dec 2005 — 6:31pm",
      "content": "thank you all for your feedback, much appreciated. i definitely agree with the comments about inconsistency (and the uptight M) and will be working on that some more. i don't think that i want all of the letters sitting neatly on the baseline. that's part of what i meant when i said i wanted to loosen it up. i just need to think about how to approach that. my intention has been to design a really playful font. so i'm trying to find a balance between that and a sense of order and consistency for a useable design.\n\njill\n\n"
    },
    {
      "time": "10 Dec 2005 — 1:05am",
      "content": "Are you lookinag at any othe classic playful fonts? Nick Shinn's uber classic FF Fontesque?\n\n[http://www.shinntype.com/](http://web.archive.org/web/20150419075425/http:/www.shinntype.com/ \"http://www.shinntype.com/\")\n\n"
    },
    {
      "time": "11 Dec 2005 — 4:41pm",
      "content": "i have been looking at other fonts and Fontesque is actually a favorite of mine. i wasn't familiar with Shinn's website though so thanks for the link. i've looked at P22 and Font Diner fonts as well. as this is my first font, i'm a little overwhelmed by all the details that are involved in designing one. i'm always struggling between developing and expressing the essence of the indivual letterforms and working within the constraints of having to establish and maintain a consistently through the whole alphabet. the process is really interesting.\n\n"
    },
    {
      "time": "11 Dec 2005 — 10:05pm",
      "content": "Are you designing the glyphs individially or in the context of other letters? In the first case you might design them abcdefg in the second case you would put the a in words & design the word with special interest in the a like 'bat' 'vat' 'saavy' 'maintain'. I suggest that you re-rough your ideas in the context of words - the second route. It is as important to design the white spaces between words as it is to design the black. By designing in the context of words you will see the consequence of your design descisions and realize that you are really designing words - but in parts.\n\n"
    },
    {
      "time": "11 Dec 2005 — 10:17pm",
      "content": "good points. thanks for the advice.\n\n"
    },
    {
      "time": "19 Dec 2005 — 1:07pm",
      "content": "This is worth doing.\n\nThe one thing I would recommend is to consider the funky weight distribution very precisely, by taking into account frequent letter adjacencies in actual text. In fact as a general rule the more irregular a design the more it should worry about linguistic data. See for example the development of Excoffon's Mistral, where the vertical position of glyphs was determined through the analysis of French.\n\nhhp\n\n"
    }
  ]
}
