{
  "id": "1671",
  "title": "Business card",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hi, I'm designing my own business card.   \n   \nwhich one does work better?, futura (1) or avant garde(2).   \nWhat other font (with the same feeling) would you advice me to use?   \nHow would you improve the design? I would like to give an impression of elegance and simplicity.   \ngrafics below the logo in the second one is there to remind the design of my website. would you use it or not?   \nthks in advance.   \ngreg ![two versions of my business card](http://web.archive.org/web/20131018151125im_/http:/www.typophile.com/forums/messages/4100/18686.jpg)\n\n",
  "author": "__",
  "time": "16 Oct 2003 — 3:19am",
  "uid": "2465",
  "comments": [
    {
      "time": "16 Oct 2003 — 3:43am",
      "content": "Futura works much better, but the Caps do need more spacing and you should kern the letters manually. Nobel and especially Neutraface would be less-overused alternatives.   \nBtw, I'm not sure the way you have something in every corner really looks elegant or simple.\n\n"
    },
    {
      "time": "16 Oct 2003 — 4:12am",
      "content": "thk you for that, i saw nobel and i really like it.   \nsorry but i'm not used with typographers language, do you mean uppercase letters need more spacing? and (very sorry about that)by kern manually do you mean that I sould work the spaces between each letters? thks again\n\n"
    },
    {
      "time": "16 Oct 2003 — 4:46am",
      "content": "yup, kerning is the term used when the spacing between type caracters is adjusted to get consistent and even letter spacing.\n\n"
    },
    {
      "time": "16 Oct 2003 — 5:11am",
      "content": "HD, Neutraface is an excellent suggestion. Give it a unique look. Greg I don't follow the logo/monogram on the lower left. I can make out the G and thats it. Dan\n\n"
    },
    {
      "time": "16 Oct 2003 — 5:20am",
      "content": "Greg... don't get me wrong, but on your businesscard it says\n\n"
    },
    {
      "time": "16 Oct 2003 — 5:39am",
      "content": "hd, i was excpecting that reaction. and I understand it. actually I never studied graphics or design. let's say I studied everything i know by myself, but never digged enough the filed of typography (badbad i know). I expect from this forum to learn more about it. You can judge if I can call me a designer or not by surfing my website.   \n...\n\n"
    },
    {
      "time": "16 Oct 2003 — 5:43am",
      "content": "daniel, the logo is \"GWK\". I'm still looking for Neutraface but can't find it, any link? thks.\n\n"
    },
    {
      "time": "16 Oct 2003 — 6:17am",
      "content": "neutraface   \n [http://houseind.com/house.php?kit=NEUTRAFACE-FO](http://web.archive.org/web/20131018151125/http:/houseind.com/house.php?kit=NEUTRAFACE-FO)   \n   \nhad a look at your site. why not use a detail of the dome/weathervane image as a background for your card, nicely cropped?\n\n"
    },
    {
      "time": "16 Oct 2003 — 6:37am",
      "content": "well, regarding those legibility issues, I'm also starting a new logo for a webdesign company called GWS and the concept is very simmilar. I don't mind that the logo can't really output the GWS on the first look (this is a topic on it's own). I tend to understand this kind of logos as a brand, a symbol... what can you read on this,   \n(no way the angles & thickness are finals, just a sketch):   \n   \n ![](http://web.archive.org/web/20131018151125im_/http:/www.typophile.com/forums/messages/4100/18699.gif)\n\n"
    },
    {
      "time": "16 Oct 2003 — 6:43am",
      "content": "thks geraintf for the link. actually I was thinking about using a background image in the business card. still got to try it.\n\n"
    },
    {
      "time": "16 Oct 2003 — 6:54am",
      "content": "thks geraintf for the link. actually I was thinking about using a background image in the business card. still got to try this   \n   \nAndriano, I like where you're going with your logo, however at first glance i read QUE.   \nThe W really makes me think an \"U\" maybe because of the horizontal line going on the right below the \"S\".   \nI think the way the middle line of the \"S\" ends (going up) doesn't help the legibility of an \"S\" but seems more an \"E\".   \n... but I think you're on the right way.\n\n"
    },
    {
      "time": "16 Oct 2003 — 9:19am",
      "content": "I understand branding, but unless you are Coca Cola or IBM and can spend millions of dollars on branding you should keep it a bit simpler. Remember in this world of the internet the attention span is about 3 seconds.\n\n"
    },
    {
      "time": "16 Oct 2003 — 9:23am",
      "content": "I have one other thought Greg, instead of printing your logo either blind emboss it or a heated stamp on a paper with a linen finish, very classy.\n\n"
    }
  ]
}
