{
  "id": "16714",
  "title": "Depot another Sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi all,\n\nI've been working on [this](http://web.archive.org/web/20150123140030/http:/homepage.ntlworld.com/c.dickinson40/Depot.pdf), for a while now.  \nI know it's another sans and that doesn't go down too well, but I've come this far and I wanted to try and get it finished, so any advise or crit would be greatly appreicated.\n\n",
  "author": "coop",
  "time": "9 Dec 2005 — 10:04am",
  "uid": "5642",
  "comments": [
    {
      "time": "9 Dec 2005 — 11:26am",
      "content": "Regard to the Regular, the horizontal bar of 'A' looks too low to me, 'C' 'G' little bit too wide, I`d drag the right points of the leg of 'R' some units to the right (nice 'k'). I would avoid 'T' 'W' oblique part, same for bottom right 'Z', '7' and lc '2'. The descender od 'q' could be little bit longer if you cut it that way, or match 'p'/'q' - same for 'b'/'d'. The looping for '8' seems interrupted, '5' '7' too thin in the horizontal parts. '$' is wrong, '€' is wrong, vertical bar of '¢' too thin. 'C,R' in '®,©' need to be bolder and your design.\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "9 Dec 2005 — 11:51am",
      "content": "AS\n\nThanks for your concise crit.\n\nI'm particularly interested in people opinions on the spacing, I keep changing my mind on it being to loose or too tight.\n\nS.\n\n"
    },
    {
      "time": "10 Dec 2005 — 4:34am",
      "content": "Overall I really like the way you've drawn your Depot. I'd have some crit for some glyph, but it's personal and you've the final answer.  \nM and W: middle join seem too short to me)  \nh, n m: the join between the stems and the curve seems to low compare to the p, b, d and q  \nr: the join of the curve and the stem is not smooth.\n\nThe left sidebearing of some letters have to be review: u r b(see words «curve» or «but» for instance).  \nGood work\n\nAndré\n\n"
    },
    {
      "time": "10 Dec 2005 — 8:18am",
      "content": "thanks for the input sim, how do you feel about the over all spacing ?\n\n"
    },
    {
      "time": "10 Dec 2005 — 8:35am",
      "content": "Overall it's good, but I wonder if it would good to increase a bit the space, especially in the light version.\n\n"
    }
  ]
}
