{
  "id": "16727",
  "title": "Logo for a training company",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am the first stages of a logo design for a Dutch company which goes under the name Provokatief. As you might guess, this means provocative. In Dutch this is normally spelled with a c, but the client feels that using a k is provocative in itself. I tend to agree.\n\nThe company sells trainings for high-end managers, and it's methods are rather unorthodox. In the briefing we concluded a masculine, corporate logo was a good choice, but to do this with a twist. This seems a good choice for the market this company reaches; which also dictates that the logo should not be very illustrative or ornate, rather simple and direct.\n\nIn the attached file you find four options. Bear in mind these are sketches; although I worked them out in illustrator, they are far from refined. These four are my favorites among the thirty or so ideas I have our second meeting about. I have used magenta as a second color, which is slightly provocative in this market, but of course this choice is arbitrary in this stage of the development.\n\nI would like your feedback on these four. My problem is to find a right balance between the corporate feel and the provocative twist. Too corporate doesn't make the company stand out, too provocative alienates the corporate market it still has to reach.\n\nAlso typographical feedback is welcome - I've used Univers, Futura and Eurostile here, but there might be less wellknown fonts that bring across the same feel.\n\n| Attachment | Size |\n| --- | --- |\n| [provokatief.pdf](http://web.archive.org/web/20131018030807/http:/typophile.com/files/provokatief.pdf) | 26.49 KB |\n\n",
  "author": "BartvanderGriendt",
  "time": "10 Dec 2005 — 2:14am",
  "uid": "3455",
  "comments": [
    {
      "time": "10 Dec 2005 — 5:32am",
      "content": "Sorry, Thats not related to the original post, but to the reply of 'wdq154226'.. Not to sound too harsh, but.: [All you post on Typophile](http://web.archive.org/web/20131018030807/http:/typophile.com/user/10513/track) is this.: 'thank you for your entry, its very great' and a link to a random site you are 'promoting' and spamming for.? I think you may want to consider stopping these or at least posting replies related to the original post..\n\nDav\n\n"
    },
    {
      "time": "10 Dec 2005 — 5:37am",
      "content": "Now in relation to the original post and request.. I dont think any of the shown ideas and sketches are very 'provocative'.. Some of them may look nice, but none of these would really provoke, someone.. Not me, at least.. _( Maybe they shouldnt be too provocative, like you stated in the original post.. I think you may have to think about bordering, or even finding the crossing line, between corporate and provocative 'enough'.. But, I like the slight 'roughness' / 'rawness' of the 3rd one.. )_\n\nWhat about trying and concentrating on the positive 'effects' these trainings will have on the 'high end managers', but also on the provoking 'raw' feeling of the word 'provokatief'.? _( Maybe try one with setting the word 'PROvokatief', with emphasis on the positive 'PRO' part, in a slightly worn out and maybe even slightly grungy, but still legible typeface.? )_\n\nDav\n\n"
    },
    {
      "time": "10 Dec 2005 — 6:03am",
      "content": "I have more feeling for the first—the most convincing. I would work the contrast, maybe mixing styles and pulling in a K (or other letter) from another face. You might find a mix could do what the color contrast accomplishes.\n\n"
    },
    {
      "time": "12 Dec 2005 — 7:18am",
      "content": "I think #1 and #3 have the most potential right now. A agree with James though, that perhaps #1 could benefit from more contrast between the word and the 'k'.\n\nThe concept behind #3 of \"turning your world upside-down\" says the most, but the relationship of the mark and the type doesn't do much for me.\n\nThe one with the exclaimation point -- #2 -- reads more like two different words:  \nProv katief ... which just leads my eye to read the girl's name \"Katie\" inside the words.\n\n"
    },
    {
      "time": "12 Dec 2005 — 8:45am",
      "content": "Yes #1 is the one, but it needs some work to turn it into something more distinctive.\n\nHéctor\n\n"
    },
    {
      "time": "12 Dec 2005 — 9:50am",
      "content": "Number 1 without a doubt. The reverse k draws the eye immediately and provokes reaction, as you want to achieve.\n\nMaybe try the whole wordmark in single colour (magenta?). The k sticks out enough due to it being reversed; you don't need to single it out using vivid colour to emphasise it - it breaks up the word. This might be just me, but I'd like to read it and during the process of reading have the k jump out (and you'd 'get it'). If it's hitting you smack bang in the face then you read the k immediately before trying to read the wordmark.\n\nwdq154226 - thanks, I've been looking for a ratchet buckle (?)\n\n"
    },
    {
      "time": "12 Dec 2005 — 10:00am",
      "content": "Thanks so much for looking into it. I agree on the first being the most potential. It is the most self contained one. I agree with Duckworth about making the whole wordmark unicolor; as it is now the k stands out in three ways: orientation, color and the spelling. Two might be more than enough.\n\nStrange enough this was one of the rare cases my first idea turned out to be the most potential. Doesn't happen often. :-)\n\nI'll get back to you all after meeting the client - for which i have some more ammunition now.\n\nThanks, again.\n\n"
    }
  ]
}
