{
  "id": "16748",
  "title": "serial number on US dollar bills",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "What font is on US bills serial ? or any similar font that looks like it ?\n\n ![](http://web.archive.org/web/20150227204210im_/http:/typophile.com/files/numberfont.jpg)\n\n",
  "author": "zzzz",
  "time": "11 Dec 2005 — 11:27pm",
  "uid": "10574",
  "comments": [
    {
      "time": "11 Dec 2005 — 11:50pm",
      "content": "The exact font is probably not all that easy to come by, but it's certainly in the tradition of \"crash numbering\". Psy/ops has a good revival:\n\n[http://www.psyops.com/html/library\\_crash.html](http://web.archive.org/web/20150227204210/http:/www.psyops.com/html/library_crash.html \"http://www.psyops.com/html/library\\_crash.html\")\n\n"
    },
    {
      "time": "11 Dec 2005 — 11:53pm",
      "content": "It probably comes from a machine that doesn't use digital type, but [Letter Gothic](http://web.archive.org/web/20150227204210/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontpackage&startrow=1&records=&currpage=1&totalrecords=4&displayfontid=LH.120930.0.0&fontRendererText=DL+80312+B) is close.\n\n"
    },
    {
      "time": "12 Dec 2005 — 5:45am",
      "content": "Ooh, I like that Crash Numbering set, and it's free!\n\n"
    },
    {
      "time": "12 Dec 2005 — 8:49am",
      "content": "_Ooh, I like that Crash Numbering set, and it’s free!_\n\nIt's brill, innit? I love it too.\n\n"
    },
    {
      "time": "12 Dec 2005 — 11:36am",
      "content": "Nobody else thinking what I'm thinking? This guy might get in trouble with the Secret Service...\n\n"
    },
    {
      "time": "12 Dec 2005 — 11:51am",
      "content": "Nah.. How could he.. :)\n\n_Coming soon to a typography related web platform near you.:_  \n'Forging Money', The Typophile Guide To Successfully Imitating Common International Currencies..\n\nDav\n\n"
    },
    {
      "time": "14 Dec 2005 — 6:38pm",
      "content": "I downloaded crashnumbering before post its close but still not it.\n\nGonna search for original in fontlab.\n\nAnd don't feds have anything better to do then search forums for people who might ask whats that fonts name ?  \nbesides i'm using it for sig and its have nothing to do with ph@ke m0ney.\n\nthnx anyway.\n\n"
    },
    {
      "time": "18 Dec 2005 — 1:59am",
      "content": "_I downloaded Crash Numbering before posting it's close but still not it._\n\nHasn't it occured to you that the money making people _might_'ve used a font that's not simply available as a commercial typeface. Yaknow, like, to make forging money a _little_ harder. ;^)\n\n_And don’t feds have anything better to do then search forums for people who might ask what's that font's name ?_\n\nDude, you wouldn't know what we've been asked to identify in the past: type on passports, identity cards from various countries, bank cheques, credit cards, all kinds of serial numbers... It _does_ leave you wondering what all these people need that information for. You'll have to excuse us for getting a little suspicious whenever we get such a request. Especially when the person requesting that infomation decides to stay anonymous and signs up as \"zzzz\"... No offense. :^)\n\n"
    },
    {
      "time": "18 Dec 2005 — 3:12am",
      "content": "Today it was announced by the Bush administration that it will continue to spy on Americans that they thought might be associated with terrorist origanizations. If they thought you were trying to forge money they might just throw you in jail as a terrorist sympothizer.\n\n"
    },
    {
      "time": "28 Dec 2005 — 12:45pm",
      "content": "And not just any jail either, but the best Romania can offer.\n\nhhp\n\n"
    },
    {
      "time": "28 Dec 2005 — 1:31pm",
      "content": "You are right Hrant it could be any hidey-hole in the world and they would throw away the key. This is about getting anyone aganinst the administration policy to run and hide knowing they will be spied upon.\n\n"
    },
    {
      "time": "22 Jan 2013 — 7:44pm",
      "content": ".\n\n"
    }
  ]
}
