{
  "id": "16754",
  "title": "Any good Rules?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I just subscribed to \"typophile.com\" and I'm in the middle of de-codifiying the whole font creation thing (being still a student) I have been looking into a number of commercial books for guidelines but none of them offeer some basic rules of the trade like standard optical corrections that each letter needs, kerning specifications... my typography teacher has a do-it-you-self style that is good to begin with but not of much use any more....\n\nIf you had to name one book that kind of sums the whole thing up, which would that be?\n\nAny other web sites that might offer guide lines?\n\nPlus does any one know wich fonts Nat West uses?\n\n",
  "author": "<a href=\"/web/20110429005045/http://typophile.com/user/10566\" title=\"View user profile.\">MickM</a>",
  "time": "<br>",
  "uid": "10566",
  "comments": [
    {
      "time": "",
      "content": "[THIS](http://web.archive.org/web/20110429005045/http:/www.typeworkshop.com/index.php?id1=type-basics) is a good place to get started.\n\n"
    },
    {
      "time": "",
      "content": "NatWest (UK bank) fonts are proprietary, I recall using them for a freelance project for them many years ago.\n\n"
    },
    {
      "time": "",
      "content": "Yes the Natwest font is a propriety custome font made by Dalton Maag... along time ago...\n\n"
    },
    {
      "time": "",
      "content": "I thought it was by The Foundry (Quay/Sacks).\n\n"
    },
    {
      "time": "",
      "content": "[http://www.dama.arachsys.com/clients/index.live](http://web.archive.org/web/20110429005045/http:/www.dama.arachsys.com/clients/index.live \"http://www.dama.arachsys.com/clients/index.live\")\n\nI think this isn't on the live page but is on the old page....\n\n"
    },
    {
      "time": "",
      "content": "They both seem reluctant to claim credit.  \nOne would expect Dalton Maag to trumpet it a bit more if they had designed it.  \nBut given The Foundry's \"light\" presence on the Internet, only showing their retail fonts, I'm inclined to think it's theirs. Plus, it doesn't seem like the kind of thing DM would do.\n\n"
    },
    {
      "time": "",
      "content": "Just pulled the fonts from the project archive and two of the files have these copyright lines (others appear to have this info missing):\n\n\"Copyright © 1993 Wolff Olins, designed by David Quay Design, co-designed and digitised by Dalton•Maag\"\n\n\"© 1993 Wolff Olins, designed by F. Sack and D. Quay, digitised by Bruno Maag\"\n\n"
    },
    {
      "time": "",
      "content": "Thanks gyus, eh, back to a good book about designing fonts???\n\n"
    },
    {
      "time": "",
      "content": "i don't know that there is an authoritative, all-inclusive tome on this subject, but there are some resources that will help you get started. I'd check out [Leslie Cabarga](http://web.archive.org/web/20110429005045/http:/typophile.com/wiki/Leslie%20Cabarga)'s [Logo, Font & Lettering Bible](http://web.archive.org/web/20110429005045/http:/typophile.com/wiki/logo_font_and_lettering_bible).  \nAlso check out [Drawing\\_How-To](http://web.archive.org/web/20110429005045/http:/typophile.com/wiki/Drawing_How-To) for links to resources on the web.\n\n"
    },
    {
      "time": "",
      "content": " **\"Schriftschreiben/schriftzeichnen\"** by Eugen Nerdinger (sic!) and Lisa Beck. Very thorough book an the anatomy of the western alphabet, and it distinguishes between writing and drawing letters. In german, though, and i think it's out of print. i was able to buy my copy on a german online 2nd hand bookstore.\n\n"
    },
    {
      "time": "",
      "content": "Thanks a lot... I have actually heard about it... Is it out in English? Where do you think I could find it?\n\nWorst case scenario could you print a couple of pages and send them via mail (I know I'm asking for a lot but I am really interested to see how technically deep can one go about formulating rules in Typography)\n\nThanks again.\n\n"
    },
    {
      "time": "",
      "content": "no idea if its available in english. try [http://www.antbo.de/](http://web.archive.org/web/20110429005045/http:/www.antbo.de/ \"http://www.antbo.de/\") for 2nd hand books. i searched for six months or so before i found it, so be patient ;)\n\n"
    },
    {
      "time": "",
      "content": "here's one: [http://www.antiqbook.nl/boox/beg/M6682.shtml](http://web.archive.org/web/20110429005045/http:/www.antiqbook.nl/boox/beg/M6682.shtml \"http://www.antiqbook.nl/boox/beg/M6682.shtml\")\n\n"
    },
    {
      "time": "",
      "content": "check out [www.choosebooks.com](http://web.archive.org/web/20110429005045/http:/www.choosebooks.com/ \"www.choosebooks.com\") - 2nd hand books, also from german/swiss sources. well, there were three sources - the one in switzerland is just gone :) sorry, the book sounded good, so i just bought it.\n\n"
    },
    {
      "time": "",
      "content": "Karen Cheng's imminent \"Designing Type\" <cite>seems</cite> to be worth a serious look too.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "These two [books](http://web.archive.org/web/20110429005045/http:/www.delphipress.com/) by Doyald Young seem to be good.\n\nAlso have a look at TypeCulture's [Academic Resources](http://web.archive.org/web/20110429005045/http:/www.typeculture.com/academic_resource/); the section Articles and Essays also covers spacing and related matters.\n\n"
    },
    {
      "time": "",
      "content": "This one is really good.  \n [Hildegard Korger - Handbook of Type and Lettering](http://web.archive.org/web/20110429005045/http:/www.amazon.com/Handbook-Type-Lettering-Hildegard-Korger/dp/0830618341/ref=sr_1_1/002-0235342-4476056?ie=UTF8&s=books&qid=1173638373&sr=8-1)\n\n"
    },
    {
      "time": "",
      "content": "I can recommend Karen Cheng’s 'designing type'. Nice visual reference with many pointers to details that you can research further on your own. A beginners bible.\n\n"
    }
  ]
}
