{
  "id": "16753",
  "title": "Fonts for those with learning difficulties/autism",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Anybody know if there have been any studies into type which best assists those with learning difficulties or autism? Font suggestions welcome.\n\n",
  "author": "joe graham_typespec",
  "time": "12 Dec 2005 — 4:50am",
  "uid": "1503",
  "comments": [
    {
      "time": "12 Dec 2005 — 11:10am",
      "content": "I'm not sure if Sue Walker has covered anything in regards to what you are requesting, but you might take a look at Sue's work: [http://www.kidstype.org/](http://web.archive.org/web/20150218044734/http:/www.kidstype.org/ \"http://www.kidstype.org/\")\n\n"
    },
    {
      "time": "12 Dec 2005 — 11:46am",
      "content": "Joe,  \nMy son is Autistic. He is 17 years old now. There is a very broad spectrum of deficiencies in Autism. Many of them are sensory. My son was 4 before he had any language and was late in reading as well. For him, there did not seem to be a problem with letter formation and typefaces except he did always prefer Sans Serif faces though. He would always change defaults on programs away from Times to Helvetica or Arial. This was not because he liked the fonts in particular. When I asked him about it, he just said, \"The extra things stuck on the letters [serifs] were too loud.\" To this day, he will not type his homework in a serif face. Understand that this is just my son and not a scientific survey.\n\nI have not seen any studies that spell out type preferences for Autistic children but I do know that many such kids begin with sign language as my son did.\n\nLet me know if you find anything more about type and Autism.\n\nChrisL\n\n"
    },
    {
      "time": "15 Dec 2005 — 2:47am",
      "content": "Many thanks for the insight Chris, much appreciated. If it's OK with you I'd like to forward your comments to our client.\n\nTiffany, I'll take a look at kidstype imminently.\n\nThanks to you both\n\nJ\n\n"
    },
    {
      "time": "15 Dec 2005 — 3:11am",
      "content": "You are welcome Joe. You may forward my comments but be sure your client understands that this is a single individual and may not be indicative of Autistic children as a whole. There is a broad range of differences among people in the Autism spectrum.  \nAlthough my son prefers to write in sans serif faces, he reads seriffed faces now with no problem and without comment.\n\nChrisL\n\n"
    },
    {
      "time": "15 Dec 2005 — 3:38pm",
      "content": "You are welcome, Joe. Please do share your progress with us. Education is a continual thing.\n\n"
    }
  ]
}
