{
  "id": "16765",
  "title": "altern@ive @ signs",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nOne of the glyphs that's giving me trouble in Inconsolata (see [critique thread](http://web.archive.org/web/20131012190516/http:/typophile.com/node/16444) for more discussion there) is the beloved at-sign. The problem is, of course, that in the classical shape there are four vertical stems that need to be squeezed into the width of the glyph. In most fonts, you can make the @ wide to accommodate all those strokes, but in a monospace font that is not an option.\n\nThere are a number of 3-stem variants, notably that of [Courier](http://web.archive.org/web/20131012190516/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&startrow=1&records=20&currpage=1&totalrecords=22&searchby=&searchID=&searchletter=&searchstr=courier&font_categories_checkbox=font_name_search&fontRendererText=altern%40tive+%40) and [Letter Gothic](http://web.archive.org/web/20131012190516/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&startrow=1&records=20&currpage=1&totalrecords=29&searchby=&searchID=&searchletter=&searchstr=letter+gothic&font_categories_checkbox=font_name_search&fontRendererText=altern%40tive+%40), but I find them kinda plain, and I feel that the central bowl lacks a-nature.\n\nI sketched a bunch of 3-stem variants, and this is the one I liked best.\n\n ![](http://web.archive.org/web/20131012190516im_/http:/typophile.com/files/ats.png)\n\nSince I haven't seen this particular variant before, my big worry is that it's too strange, and will stand out when people see it. Any opinions?\n\n",
  "author": "raph",
  "time": "12 Dec 2005 — 12:50pm",
  "uid": "4406",
  "comments": [
    {
      "time": "12 Dec 2005 — 1:10pm",
      "content": "Hi Ralph,\n\nI'm also working on a monospaced typeface and designed the @-sign this way:\n\n ![](http://web.archive.org/web/20131012190516im_/http:/typophile.com/files/at.gif)\n  \nMy typeface is more grotesk than yours, but perhaps it will work for your typeface.\n\nPieter\n\n"
    },
    {
      "time": "12 Dec 2005 — 1:12pm",
      "content": "I remember John H has designed a charming -and recognizable- mono @.\n\nAlso: the inside not only doesn't really need to be an \"a\", it shouldn't.\n\nhhp\n\n"
    },
    {
      "time": "12 Dec 2005 — 1:49pm",
      "content": "hrant: ok, I'll take the bait. Why shouldn't the central loop be recognizable as an 'a'?\n\nI had a couple of more stylized, not-quite-so-a versions in my sketches, of which this one was the most flowing.\n\n ![](http://web.archive.org/web/20131012190516im_/http:/typophile.com/files/at3.png)\n\nP.S. Browsing through some of the @ interpretations at myfonts, I felt honorable mention should go to [Cannabis](http://web.archive.org/web/20131012190516/http:/www.myfonts.com/fonts/sylvestre/cannabis/).\n\n"
    },
    {
      "time": "12 Dec 2005 — 1:55pm",
      "content": "\\> Why shouldn’t the central loop be recognizable as an ‘a’?\n\nBecause its decipherment suffers from it.  \nEssentially, the @ is not an \"a\" with a circle around it; it's an @.\n\nBTW, I think your second one there is great.\n\n\\> honorable mention should go to Cannabis.\n\nDude, psychedelic dude.\n\nhhp\n\n"
    },
    {
      "time": "12 Dec 2005 — 2:19pm",
      "content": "Raph, you might find inspiration in [other names for @](http://web.archive.org/web/20131012190516/http:/www.webopedia.com/DidYouKnow/Internet/2002/HistoryofAtSign.asp), such as snail, strudel, ear, monkey's tail, etc.\n\n"
    },
    {
      "time": "12 Dec 2005 — 5:02pm",
      "content": "A suggestion borrowing from the excellent letterforms already in Inconsolata:\n\n[http://dsandler.org/outgoing/inconsolata-specimen.pdf](http://web.archive.org/web/20131012190516/http:/dsandler.org/outgoing/inconsolata-specimen.pdf \"http://dsandler.org/outgoing/inconsolata-specimen.pdf\")\n\nWhile less interesting than your proposed 3-stem version, I think this has a little more left-to-right balance, and better matches the overall weight and color of the other full-height characters.\n\n"
    },
    {
      "time": "12 Dec 2005 — 5:04pm",
      "content": "Nice - but do dump the stem foot at the bottom-right.\n\nhhp\n\n"
    },
    {
      "time": "12 Dec 2005 — 5:28pm",
      "content": "Oh, well. I kind of liked that detail.\n\nHere are a few variants:\n\n[http://dsandler.org/outgoing/inconsolata-evolution.pdf](http://web.archive.org/web/20131012190516/http:/dsandler.org/outgoing/inconsolata-evolution.pdf \"http://dsandler.org/outgoing/inconsolata-evolution.pdf\")\n\n"
    },
    {
      "time": "12 Dec 2005 — 5:33pm",
      "content": "Stuart,\n\nI like #1. Also something between #1 and #2 might work.\n\n"
    },
    {
      "time": "14 Dec 2005 — 4:49am",
      "content": "Does any one have objection to an uppercase @?\n\n"
    },
    {
      "time": "14 Dec 2005 — 5:27am",
      "content": "_Does any one have objection to an uppercase @?_\n\nI do, although it would be ok as an alternate.\n\nRaph, have you tried a lower @, one with the \"a\" on the baseline (or thereabouts). I know that this is a newer trend, but I think it reads more legibly… when the @ was first packaged inside fonts, it was used significantly less often than it is now… overall-line legibility was less of an issue then, I guess.\n\n"
    },
    {
      "time": "14 Dec 2005 — 8:46am",
      "content": "David, you mean as the default form? Maybe you mean for a mono design in particular? Because I think I remember you once opposing the idea as useless, during a discussion on the ATypI list. I remember saying in its defense (if only as an alternate) that Mercedes often uses all-caps settings for URLs and such, and you replying something like: \"They make great cars - let's leave it at that.\" :-)\n\nhhp\n\n"
    },
    {
      "time": "14 Dec 2005 — 1:37pm",
      "content": "Raph, here's the sort of 'strudel' or 'snail' idea for the @ sign.\n\n--Oops, can't get the image to load.\n\n ![](http://web.archive.org/web/20131012190516im_/http:/typophile.com/files/new%20at%20signs%20copy.jpg)\n\n"
    },
    {
      "time": "14 Dec 2005 — 2:09pm",
      "content": "Thanks for all the comments. Here's the one I've decided on, for now anyway. It's most similar to Dan Sandler's.\n\n ![](http://web.archive.org/web/20131012190516im_/http:/typophile.com/files/at4.png)\n\nDan Reynolds asked: _Raph, have you tried a lower @, one with the “a” on the baseline...?_, and Pieter posted an example.\n\nYes, I considered this form, but decided against it because the chirality (direction of spiral) felt wrong. This font is intended primarily for code listings, and so gross similarity to traditional forms is important. So, not too surprisingly, I chose one not too dissimilar from the Courier precedent. It's kinda conservative, but maybe one of these more exotic proposals will find its way into an arty future font.\n\nUppercase @? This sounds strangely like the [proposal](http://web.archive.org/web/20131012190516/http:/std.dkuug.dk/jtc1/sc2/WG2/docs/n2888.pdf) for uppercase ß, but imho with less justification. We don't have uppercase $%&\\*, and the role of @ isn't that different.\n\n"
    },
    {
      "time": "14 Dec 2005 — 2:22pm",
      "content": "Your decision seems warranted within the subject matter, I did like the second variant in your second post, and of course Cannabis' variant!\n\n"
    },
    {
      "time": "14 Dec 2005 — 2:26pm",
      "content": "Raph, your final form is similar to what I did in the NetTerm console font, but in that case I was trying to match an existing bitmap font at a particular size.\n\nLuc(as) de Groot included a variant form in his Consolas monospaced font for MS, and a smallcap variant in his Calibri face.\n\n ![](http://web.archive.org/web/20131012190516im_/http:/typophile.com/files/@.gif)\n\n"
    },
    {
      "time": "14 Dec 2005 — 3:15pm",
      "content": "William, there is something really nice about your strudel.\n\n"
    },
    {
      "time": "14 Dec 2005 — 3:38pm",
      "content": "Oh, I see it has to be a gif, not jpeg; now I get them to load. And you've already decided. Anyway fyi here are the concepts. One is a bit like one of John's.\n\n ![](http://web.archive.org/web/20131012190516im_/http:/typophile.com/files/alternate-ats.gif)\n\n"
    },
    {
      "time": "14 Dec 2005 — 4:19pm",
      "content": "William, I see both the JPEG and GIF images. The reason you can't see the first one is that it is a CMYK JPEG and not all browsers will display those. If you had used an RGB JPEG, you would be able to see it in your browser.\n\n"
    },
    {
      "time": "14 Dec 2005 — 5:12pm",
      "content": "Mmm CMYK is a no, no for the web although I do see the first image as well (Safari 2.0 here)\n\n"
    },
    {
      "time": "14 Dec 2005 — 7:21pm",
      "content": "Thanks, Mark. Now I know how to do the images so everyone can see them.\n\nI stuck the trial characters into a string of Myriad letters. The idea I was testing is that the right kind of spiral, even though it is out of character with the alphabet--like the &--will still read as an 'at' sign in context, and will \"color\" better than the @ sign.\n\n--I notice that in Myriad they make the @ much thinner than the strokes of the letters, I guess because of color problems. Also true for Georgia, here on screen--is this general? Of course, if the idea of a spiral is sound, how to draw it appropriately will depend on the font.\n\n"
    },
    {
      "time": "15 Dec 2005 — 5:28am",
      "content": "\"David, you mean as the default form?\"  \nI thought this would be a short thread.  \nI know now that people take their ats seriously.  \nUnless there is a rock solid reason, (usually associated with an undereducated cleint)  \nI'd always make them italic.\n\n"
    },
    {
      "time": "15 Dec 2005 — 6:19am",
      "content": "\\>I know now that people take their ats seriously.\n\nThe reasons I think that it would be good to have an alternative form of the @ sign are: 1. It always looks to me out of place, like a 'wrong font' character stuck in the middle of a line. 2. If it were only in price lists, that would be OK, but now because of e-mail addresses it is not only on the internet, but in print on business cards, stationary, in books, magazines and newspapers. I don't know if there is a good solution along the lines of a spiral, but a more harmonious form than what we have would be an advance.\n\nAlso because it is relatively new for e-mail, people would be more likely to accept an alternative, if it looked good. This might be an exception to the general rule that type design is inherently a conservative art.\n\n"
    },
    {
      "time": "16 Dec 2005 — 1:35pm",
      "content": "I'd just sqeeze it. Problem solved.\n\n"
    }
  ]
}
