{
  "id": "16762",
  "title": "Trends for 2006",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello. First time poster here. Just curious to see what opinions and forecasts are floating around here in regards to typographic trends to look out for in the coming year. Any insight?\n\n [‹ Hubert Jocham Design?](http://web.archive.org/web/20080825145300/http:/typophile.com/node/29265 \"Go to previous forum topic\") [Announcement: Open Day for postgraduate programmes at Reading ›](http://web.archive.org/web/20080825145300/http:/typophile.com/node/29258 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080825145300/http://typophile.com/user/10579\" title=\"View user profile.\">andpue</a>",
  "time": "<br>",
  "uid": "10579",
  "comments": [
    {
      "time": " 12.Dec.2005 12.49pm",
      "content": "I think we are going to see lots of Arial and Comic sans the coming year.\n\n(sorry, couldn’t resist :)\n\n"
    },
    {
      "time": " 12.Dec.2005 2.25pm",
      "content": "Are you talking about trends in the use of type (graphic design) or type design?\n\nI’m a graphic designer, judging from the top selling font lists I’ve seen on myfonts, veer and t-26, scripts are a big seller. I think there is always room for unique display types, and is something I look for personally.\n\n"
    },
    {
      "time": " 12.Dec.2005 2.38pm",
      "content": "Half gut feel and half educated guess:\n\nI believe we are in for a big change in the way typefaces are made available to the graphic design market.\n\nAlso, we are still waiting for the shakeout/changes by Adobe on Macromedia product line.\n\n"
    },
    {
      "time": " 12.Dec.2005 3.08pm",
      "content": "I don’t think anything earthshaking will happen in 2006. Typography will evolve at its current rate. My only gut feeling is that type designers will more-and-more sell their own wares.\n\nChrisL\n\n"
    },
    {
      "time": " 12.Dec.2005 3.11pm",
      "content": "Towards the end of 2006 we’ll be seeing more and more of the new Windows Vista fonts. You won’t have to use Arial any longer!\n\n"
    },
    {
      "time": " 12.Dec.2005 3.35pm",
      "content": "\\>we are in for a big change in the way typefaces are made available to the graphic design market.\n\nWhat new way did you have in mind?\n\n"
    },
    {
      "time": " 12.Dec.2005 3.42pm",
      "content": "Modern Times: The Age of the Machine.\n\n"
    },
    {
      "time": " 12.Dec.2005 3.52pm",
      "content": "“\\>we are in for a big change in the way typefaces are made available to the graphic design market.”\n\nI think he means they will be available on iPods and designers will have Cellebrity Designer “Playlists” :-)\n\nChrisL\n\n"
    },
    {
      "time": " 12.Dec.2005 5.50pm",
      "content": "Educated guesses:\n\nMore bundling of font packages aimed at non-professional markets (like the [Ascender Creativity Font Pack](http://web.archive.org/web/20080825145300/http:/typophile.com/node/15111) for only $19.99) which will in fact degrade the per font perceived value within new markets we potentially could sell to.\n\nMore font bundling within software packages aimed at non-print professional and consumer markets (web, video, digital imaging).\n\nMore font bundling within multi-software packages (like Adobe CS2. Surprise, surprise... I got fonts I never had or installed before).\n\nGut feel:\n\nI just have a feeling that [TypeExpertise.com](http://web.archive.org/web/20080825145300/http:/typophile.com/node/16326) wants to do more than just create a “universal type classification” system based on touchy-feely search criteria. Why the hell go through all that effort unless you want to start selling fonts to non-type oriented markets.\n\nAnd there are other distribution modes in development and on the drawing board for getting old and new markets to use more type.\n\n"
    },
    {
      "time": " 12.Dec.2005 6.39pm",
      "content": "I agree entirely that the method of distributing type will change drastically sometime in the nearish future, and I am also looking forward to the day when Arial packs it’s bags - but to clarify my initial intent, I am more interested on usage to come. Am I out of line by saying Trade Gothic is reaching overuse? Thoughts?\n\n"
    },
    {
      "time": " 12.Dec.2005 7.26pm",
      "content": "More Avant Garde Alternates? haha\n\n"
    },
    {
      "time": " 12.Dec.2005 8.37pm",
      "content": "Hopefully distressed faces will go away. You know the ones I mean...\n\nBalonius Funk\n\n"
    },
    {
      "time": " 12.Dec.2005 9.33pm",
      "content": "R.I.P. grunge. I’ll miss you.\n\n ![](http://web.archive.org/web/20080825145300im_/http:/typophile.com/files/grungey.gif)\n\n"
    },
    {
      "time": " 12.Dec.2005 10.57pm",
      "content": "1) Art fonts...\n\n2) The newest technology and how you use it is always big.\n\nRob\n\n"
    },
    {
      "time": " 12.Dec.2005 11.24pm",
      "content": "Maybe more fonts that designed with specific pt sizes in mind.\n\n"
    },
    {
      "time": " 13.Dec.2005 5.52am",
      "content": "Aquatoad Design is forcasting a big year for PMS 1665U. Grunge will not dissappear in 2006. It will gain strength and make landfall with reknewed vigor online (this time at standards compliant force). In other news, 2006 marks the beginnining of a rennaissance period for illustrators. The fledgling trend of funky handlettered headlines continues. Century and Clarendon will make a strong showing as lowercase a’s with monster tails abound.\n\n"
    },
    {
      "time": " 13.Dec.2005 6.17am",
      "content": "Yo Randy, you are, like, Nostradomus man!  \nYou just left out the “World coming to an end” part :-)\n\nChrisL\n\n"
    },
    {
      "time": " 13.Dec.2005 6.18am",
      "content": "Lauri,\n\nLovin your grunge EULAgy man:-)\n\nChrisL\n\n"
    },
    {
      "time": " 13.Dec.2005 6.26am",
      "content": "I think the highlight of 2006 will be Mark Simonson’s release of Courier Flair.\n\n"
    },
    {
      "time": " 13.Dec.2005 6.28am",
      "content": "\\>More bundling of font packages aimed at non-professional markets (like the Ascender Creativity Font Pack for only $19.99) which will in fact degrade the per font perceived value within new markets we potentially could sell to.\n\nHmm. The Ascender pack it seems includes two of four weights of Font Bureau’s Eagle, and one of three weights of Mark Simonson’s Coquette. Perhaps what is going on—and will continue to—is a segmentation of the market, with fonts aimed for the professional market being very full families and Open Type features—with correspondingly higher prices. And then the bundling of selected weights as a marketing tool. Adobe seems to be different here, as their bundling is aimed at enhancing the value of their production software, which nobody else producing fonts has to sell.\n\n"
    },
    {
      "time": " 13.Dec.2005 6.29am",
      "content": "“I think the highlight of 2006 will be Mark Simonson’s release of Courier Flair.”\n\nIs that the one with swash caps and flourishes? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 13.Dec.2005 7.06am",
      "content": "Aquatoad Design is forcasting that the world will come to an end. Possibly in 2006 (PMS 433U). But, maybe not (PMS 2905U).\n\n"
    },
    {
      "time": " 13.Dec.2005 7.20am",
      "content": "LOL!\n\nChrisL\n\n"
    },
    {
      "time": " 13.Dec.2005 10.41am",
      "content": "_I think the highlight of 2006 will be Mark Simonson’s release of Courier Flair._\n\nActually, it will probably be my release of Courier Flair, or something that could pass for it: an as-yet-unnamed face based on an old MacKellar, Smiths and Jordan classic called, somehat prosaically, “Lightline Italic.” Look for it in January 2006.\n\nAnd Aquatoad has it all wrong: the world will not end in 2006. However, be forewarned that the Mayan calendar ends rather abruptly in 2012...\n\n"
    },
    {
      "time": " 13.Dec.2005 11.06am",
      "content": "<cite>However, be forewarned that the Mayan calendar ends rather abruptly in 2012…</cite>  \nI was thinking the same..\n\n"
    },
    {
      "time": " 13.Dec.2005 11.08am",
      "content": "“However, be forewarned that the Mayan calendar ends rather abruptly in 2012…”\n\nThat was the Mayan version of Y2K :-)\n\nChrisL\n\n"
    },
    {
      "time": " 13.Dec.2005 11.51am",
      "content": "— I think we are going to see lots of Arial and Comic sans the coming year.\n\nSo I should just ride out the wave and not re-design my bl\\*\\*dy publication because it’ll come back into typographical style? ;)  \nMaybe I should just quit. \\*sigh\\*\n\nKristina\n\n"
    },
    {
      "time": " 13.Dec.2005 12.09pm",
      "content": "“Arial!, you’ve been to the surface again, haven’t you!?”\n\n ![](http://web.archive.org/web/20080825145300im_/http:/typophile.com/files/kingtriton.JPG)\n\n"
    },
    {
      "time": " 13.Dec.2005 12.21pm",
      "content": "So Mark, are you going to Courier Flair?\n\n"
    },
    {
      "time": " 13.Dec.2005 2.17pm",
      "content": "Acually a while ago they predicted magenta would be the next orange & it pretty much was. That is of course over now. Does anybody know what colors are actually being circulated as the next big direction? I see ink spots & drips going out. The huge use of those stylistic tropes by comedy central & apple ipod ads are rapidly making them passe.\n\nIn my dreams: lots of odd japanese greens in blue green & yellow green & green brown that we never see. With some pink bits. But that could be because winter is so deep here in Alaska.\n\nOf couse the next big thing in type will be flipdot fonts.\n\n"
    },
    {
      "time": " 13.Dec.2005 2.20pm",
      "content": "...but typographers will be left out in the cold - they will be made by graphic designers to work in flash & by plug ins for motion graphic packages. Fontlab will introduce a fancy version of photofont ( v3) that makes animated bitmap fonts but it will already be too late.\n\n"
    },
    {
      "time": " 13.Dec.2005 2.53pm",
      "content": "I think Mark’s Courier Flair will replace Helvetica/Arial as the web standard. (I can’t wait for Mark’s comments)\n\n"
    },
    {
      "time": " 13.Dec.2005 3.27pm",
      "content": "_Will happen in 2006:_ More grubby fonts will come bubbling up through MyFonts and more people will buy them. The best seller list will become uglier than ever. This can only be a good thing for the industry. Some snobby type designers will thumb their noses at the great unwashed buying “type”. (And they’ll pronounce “type” with just enough emphasis to make it clear to everyone that they are smart enough to call it type, and not fonts). Other companies will seize the opportunity and make wads of cash a-la Wal-Mart. In short, the markets for non-professionals will continue to expand. At the same time, professional users will become even more addicted to OpenType features, and continue to pay a premium for beautiful work, driving sales and encouraging creativity in type design like it’s never been possible in the past.\n\n_Wishful thinking:_ Software makers will realize that hard coding a control panel into each application for each OpenType feature is ridiculous. They will simply implement an engine to read the available features out of the font, and allow the users to turn them on or off. People setting type without the help of Adobe’s multiline composer will either finally go completely insane spacing by hand in Quark or will actually die of old age. Everyone else will finally dump Quark for Microsoft Word, and not know the difference.\n\n_Will happen in in the future but not necessarily in 2006:_ Adobe will become all powerful and start to atrophy, though it won’t be completely obvious to everyone. Then, after a few years, Adobe will have become a blubbering glutton, unable to move under it’s own weight, gobbling 10,000 calories a day of fried food. Since nothing has changed inside their software in years (though a lot more code will be added to top of the pile), open source apps will finally have copied every piece of functionality in each app. Smaller, smarter companies will invent new paradigms that promise to revolutionize the industry. They will, of course, be purchased and dismantled immediately. Finally, Adobe will start to crumble from within, as all empires do, with pressure from the barbarian tribes (open source) and the next round of smart, nimble companies will carve them to pieces creating a lot more work for open source to copy.\n\n"
    },
    {
      "time": " 13.Dec.2005 4.20pm",
      "content": "_Courier Flair_\n\nIt was a joke! Still, if you think there would be a demand... :-)\n\n"
    },
    {
      "time": " 13.Dec.2005 4.46pm",
      "content": "Christian, well said — and very funny.\n\n"
    },
    {
      "time": " 13.Dec.2005 5.00pm",
      "content": "_Courier Flair_\n\nIt was a joke! Still, if you think there would be a demand… :-)\n\nWell, I wasn’t kidding...\n\n ![](http://web.archive.org/web/20080825145300im_/http:/typophile.com/files/msj_lli.gif)\n\n"
    },
    {
      "time": " 13.Dec.2005 5.34pm",
      "content": "Gee, Nick, that’s a completely different thing than what I did.\n\nFor those who missed it the first time around:\n\n ![](http://web.archive.org/web/20080825145300im_/http:/typophile.com/files/courierflair.gif)\n\nIf that doesn’t make you feel even a little bit woozy, don’t be surprised if I don’t come to you for typographic advice. :-)\n\n"
    },
    {
      "time": " 13.Dec.2005 5.50pm",
      "content": "C’mon Mark, you are not getting off the hook that easy—where is the swash OTF and contextual ending strokes? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 13.Dec.2005 6.28pm",
      "content": "Well, it wouldn’t be the first time I made a font on a lark that turned out to have a market.\n\n"
    },
    {
      "time": " 13.Dec.2005 6.52pm",
      "content": "That is far better than doing a font that you thought DID have a market and it turned out to be a lark! I’ll bet the Flair pen company would like it.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Dec.2005 7.15pm",
      "content": "_That is far better than doing a font that you thought DID have a market and it turned out to be a lark!_\n\nSadly, that scenario is much more common.\n\n"
    },
    {
      "time": " 13.Dec.2005 11.13pm",
      "content": "Hey man, Courier flair already happened in the form of a custom face for Martha Stewart Living. Okay, so I’m only half joking...\n\nAt an AIGA talk with Jonathan and Tobias in SF this past summer Jonathan described the creative direction for a new face that MSL wanted. The AD wanted to start with an existing face but weren’t sure what it was. It turned out the face they were talking about was Courier. The new typeface carries a cousin-like resemblance, but is actually a very nice take on an old typewriter face. (Of course there isn’t a lot of flair, unless you count some nice ball terminals.)\n\n"
    },
    {
      "time": " 14.Dec.2005 2.57am",
      "content": "In 2006 Hrant will release his Baskerville. Raph will make his curves a real alternative. I won’t be doing much typography-wise.\n\n"
    },
    {
      "time": " 14.Dec.2005 4.17am",
      "content": "Sorry about the joke Mark, but I couldn’t resist. I detest flair faces because a lot of designers don’t know how to use them descreetly. Its like the Avant Garde alternatives.\n\n"
    },
    {
      "time": " 14.Dec.2005 5.41am",
      "content": "Sergej,  \nLOL!!! That was your best ever!\n\nChrisL\n\n"
    },
    {
      "time": " 14.Dec.2005 9.18am",
      "content": "i’m suspecting that scripts and OT fonts that reproduce the handlettered look will fare well in 2006. sans faces will remain a staple of the top font sales at [MyFonts](http://web.archive.org/web/20080825145300/http:/www.myfonts.com/bestsellers.html), with Interstate eclipsing Frutitger mid July, but it won’t be able to knock Helvetica out of the #1 sans spot.\n\n"
    },
    {
      "time": " 14.Dec.2005 1.43pm",
      "content": "Sergej, not only will Hrant release his Baskerville but it will have worse kerning pairs than Mrs. Eaves. Paul Helvetica is doomed to Courier Flair.\n\n"
    },
    {
      "time": " 14.Dec.2005 2.39pm",
      "content": "When I laugh at the jokes, that I’m finally getting from hanging around here I sometimes think to myself ’Am I seriously laughing at typography jokes?’ and then I just keep browsing looking for more gems.\n\nSeriously though, enough with the handwriting typefaces, if that’s the look you want then just write it by hand. I know there are some beautiful script/handwriting examples out there but I guess I don’t understand why all these people are coming out of the woodwork with their first type face attempt being a handwriting face?\n\n/continues off in search of more jokes\n\n"
    },
    {
      "time": " 14.Dec.2005 2.50pm",
      "content": "oh, i didn’t mean scrawl handwriting, but stuff that looks like it’s been handlettered by a lettering master.\n\n"
    },
    {
      "time": " 14.Dec.2005 3.02pm",
      "content": "More Ed Benguiat Reviving! Give me Plinc! or give me death.\n\n"
    },
    {
      "time": " 14.Dec.2005 5.16pm",
      "content": "<cite>oh, i didn’t mean scrawl handwriting, but stuff that looks like it’s been handlettered by a lettering master.</cite>  \nOh! Here, here! My neighbor’s dad has been hand lettering signs and vehicles/pinstriping for over 50 years and his work is amazing. I’m totally down with that style. :-D\n\n"
    },
    {
      "time": " 14.Dec.2005 10.57pm",
      "content": " **2006**\n\nTypecon in July will be even hotter than it was in New York. But hotter in which ways? You better go and find out!\n\nVeer will be bought by Getty and Getty will be bought by Corbis and Corbis in turn by Macrodobia.\n\nMacrodobia will announce that it’s getting back to its roots by making mud homes in the desert. These eco-friendly dwellings will be renamed Flashmud and be entirely made out of recycled PDF and straw.\n\nMicrosoft will continue to gain cool points with the Xbox 360 even though the aptly named _Halo 3: Guess What, Another Mysterious Ring in Space!_ will flop. The franchise will drive itself into the ground with a Halo live-action movie that only makes records by doing worse than _Hulk_ in box office receipts.\n\nSomebody in North America will buy a game for their PSP.\n\n"
    },
    {
      "time": " 15.Dec.2005 3.19am",
      "content": "FontLab Studio 5 will be ported to the Blackberry. Type designers will be seen on subways everywhere all thumbs making kerning pairs en route to their day jobs\n\nChrisL\n\n"
    },
    {
      "time": " 16.Dec.2005 1.27am",
      "content": "Looks like Chalkboard died a quick death in 2005. It was a new born but I’ve never seen it ever used. Poor little bastard child.\n\n"
    },
    {
      "time": " 16.Dec.2005 7.27am",
      "content": "“Chalkboard died a quick death ...I’ve never seen it ever used.”\n\nMaybe because it gets erased too quickly:-)\n\nChrisL\n\n"
    },
    {
      "time": " 16.Dec.2005 8.25am",
      "content": "Re.: Joes ’2006’.:\n\nAldus / AltSys will, well, return and re release TLTFKAFH _( [The Lovely Thing Formerly Known As FreeHand](http://web.archive.org/web/20080825145300/http:/www.freehandsource.com/_frames/_misc/_history/fh_version_history.html) )_, now named ’Aldus Blatt’ _( ’ [Hedera](http://web.archive.org/web/20080825145300/http:/www.typophile.com/node/13058)’, which also translates to ’Aldus Page’ / ’Aldus Leaf’, as well.. :)_..\n\n_And I may even be pretty thankful for it.. :)_\n\nDav\n\n"
    },
    {
      "time": " 16.Dec.2005 11.35am",
      "content": "To see the future you must consult with the spirit world. I have asked the [Mystic Font](http://web.archive.org/web/20080825145300/http:/www.p22.com/ihof/mysticfont.html) some questions based on predictions already made here. The fonts has been pretty good in the past, but the [answers this time](http://web.archive.org/web/20080825145300/http:/www.p22.com/mysticpredicts.pdf) seem dubious.\n\n"
    },
    {
      "time": " 16.Dec.2005 11.42am",
      "content": "Brilliant Richard!!! :-)\n\nChrisL\n\n"
    },
    {
      "time": " 16.Dec.2005 12.36pm",
      "content": "_In other news, 2006 marks the beginnining of a rennaissance period for illustrators. The fledgling trend of funky handlettered headlines continues._\n\nI wish! Randy, if that’s true you’ll be my new god.\n\n"
    },
    {
      "time": " 16.Dec.2005 12.39pm",
      "content": "_not only will Hrant release his Baskerville but it will have worse kerning pairs than Mrs. Eaves._\n\nLOL!\n\n"
    },
    {
      "time": " 16.Dec.2005 12.49pm",
      "content": "Terry,  \nJudging by your new avatar, you are not in a holiday mood?\n\nChrisL\n\n"
    },
    {
      "time": " 16.Dec.2005 1.02pm",
      "content": "Remember Chris Terry turned blue when he was a south park character. But shouldn’t he have Norbert glasses?\n\n"
    },
    {
      "time": " 16.Dec.2005 1.08pm",
      "content": "Chris, that avatar is from his new website, which you must go see.\n\n"
    },
    {
      "time": " 16.Dec.2005 1.25pm",
      "content": "_Judging by your new avatar, you are not in a holiday mood?_\n\nOn the contrary, I love Christmas. But let’s not forget it is cold outside! :)\n\n"
    },
    {
      "time": " 16.Dec.2005 1.40pm",
      "content": "“Ive got to go” “but baby its cold outside” Terry I bet you didn’t miss the last three days in NYC average 19º F. Finally broke today mid 40’s.\n\n"
    },
    {
      "time": " 16.Dec.2005 2.01pm",
      "content": "2006? the stock, gold, and commodities markets crash. Money becomes useless, making software the new currency. Fonts become the small change, like pennies, nickles and quarters, handed about on keychain USB drives shaped like like the letters they contain. Kerning becomes obsolete, along with hints and uniform formats as counterfit coins proliferate. The number of type designers skyrockets into the billions, so The Netherlands is renamed Shriftijdonia and extended, with the purchase of the top half of Mt. Saint Helens, 200k into the north sea to make room. 07? don’t ask ;)\n\n"
    },
    {
      "time": " 16.Dec.2005 2.53pm",
      "content": "The geniuses that proposed the memorial (that can’t work due to enviromental concerns) and the first WTC that is faitaly flawed will eventually have to admit it. Mayor Bloomberg will take the project over and make it work. Since 9/11 nothing, I repeat nothing has happened at that site and it sickens me everytime I pass it. 2006 is just 2 weeks away.\n\n"
    },
    {
      "time": " 16.Dec.2005 6.47pm",
      "content": "In 2006 ,Helvetica Flair will resurface and destroy the newly incubated Courier Flair.\n\nSorry Mark.\n\n"
    },
    {
      "time": " 17.Dec.2005 7.50am",
      "content": "in 2006, [Schmelvetica](http://web.archive.org/web/20080825145300/http:/www.identifont.com/show?1FG) will finally reach its promise and unseat its semi-namesake from the top of the “Most Overused” list. Chester won’t know whether to cringe or cheer :-)\n\nChrisL\n\n"
    },
    {
      "time": " 17.Dec.2005 8.01am",
      "content": "Geez, people! Talk about going off on a tangent. Is this some kind of contest with the winner being one with the lamest, geekiest joke?\n\nI was serious about Hrant, and Raph, and me. I don’t know how realistic my prediction is, but I am hopeful. Because you know what? Because I do believe in people,  \nespecially in people like Hrant,  \nespecially on a winter day like this,  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;especially when my boss lets me go home earlier,  \nespecially when it’s quiet outside  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;and I have food in the fridge  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;and my body doesn’t hurt,  \nespecially when I don’t read Typophile  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;or today’s newspaper  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;or my own diary,  \nespecially when I have time to write a silly poem  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;and a letter to a dear friend,  \nespecially on a winter day like this,  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I do believe in people,  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;especially in people like Hrant.\n\n"
    },
    {
      "time": " 27.Dec.2005 8.54pm",
      "content": "Cool and funny stuff guys!\n\nMy sole prediction (historically I’ve made too  \nmany) is that fancy bitmap fonts will go big.\n\n\\> Does anybody know what colors are actually  \n\\> being circulated as the next big direction?\n\nAny color as long as it’s notan.\n\n\\> it will have worse kerning pairs than Mrs. Eaves.\n\nSheesh, I’m not prepared to put THAT much effort into it.\n\nhhp\n\n"
    },
    {
      "time": " 28.Dec.2005 6.20am",
      "content": "“Is this some kind of contest with the winner being one with the lamest, geekiest joke?”\n\nGosh, I sure hope so or I have really wasted mucho ascii characters on this thread :-)\n\nChrisL\n\n"
    },
    {
      "time": " 1.Nov.2006 9.00am",
      "content": "_In 2006 Hrant will release his Baskerville. Raph will make his curves a real alternative._\n\nHrant, Raph, you’ve got two months... \\>^P\n\n"
    },
    {
      "time": " 3.Nov.2006 3.04am",
      "content": "anyone working on Comic flair?\n\n"
    }
  ]
}
