{
  "id": "16766",
  "title": "12 products in 12 months of 2005: FontLab Studio 5 for Mac OS X released",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Fontlab Ltd. is proud to announce the release of the 12th (!) product this year. After TransType SE 2.5 for Mac and Windows, TransType Pro 3.0 for Mac and Windows, FogLamp for Mac and Windows, Photofont Start for Mac and Windows, Sigmaker 2 for Mac, Fontographer 4.7 for Mac and FontLab Studio 5 for Windows, we have just released FontLab Studio 5 for Mac, the long-awaited next-generation professional font editor for Mac OS X.\n\nCome and see:  \n [http://www.fontlab.com/The-News/Announcements/FontLab-Studio-5/](http://web.archive.org/web/20150223155944/http:/www.fontlab.com/The-News/Announcements/FontLab-Studio-5/ \"http://www.fontlab.com/The-News/Announcements/FontLab-Studio-5/\")\n\nAs Yuri Yarmola just put it: \"What a crazy year!\"\n\nBest,  \nAdam Twardoch  \nFontlab Ltd.\n\n",
  "author": "twardoch",
  "time": "12 Dec 2005 — 2:29pm",
  "uid": "1133",
  "comments": [
    {
      "time": "12 Dec 2005 — 2:51pm",
      "content": "Very nice!\n\n"
    },
    {
      "time": "12 Dec 2005 — 4:05pm",
      "content": "Geez Adam, I already bought it! :-)\n\nThanks for all your good work and for being a good sport about my friendly jibes about when the Mac version would be available. I asked if would be available by Christmas. You didn't answer then but you did it!\n\nI downloaded it within seconds of your post after seeing Miss Tiffany's announcement. As soon as the serial numbers arrive, I will take it for a spin.\n\nChrisL\n\n"
    },
    {
      "time": "12 Dec 2005 — 4:44pm",
      "content": "Just got my serial numbers. That was way faster than the couple of hours your web site said it would take!\n\nThanks FL Gang!\n\n ![](http://web.archive.org/web/20150223155944im_/http:/typophile.com/files/FL5macscrn.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "12 Dec 2005 — 4:45pm",
      "content": "I have it! Really good!\n\nBTW what about printed user manual?\n\n"
    },
    {
      "time": "12 Dec 2005 — 5:01pm",
      "content": "David,\n\nthe printed user manual will be available soon from OnDemandManuals.com.\n\nAdam\n\n"
    },
    {
      "time": "12 Dec 2005 — 5:05pm",
      "content": "where's the color (nodes - no more green, red) ; and the nodes - too small; any way to change that?\n\nedit: Thank you Adam.\n\nanother question:  \nwhere's: Tools \\> Transform --\\> Select an action:\n\n"
    },
    {
      "time": "12 Dec 2005 — 5:17pm",
      "content": "Check the Glyph window page in Preferences.\n\n"
    },
    {
      "time": "12 Dec 2005 — 5:18pm",
      "content": "_Very nice!_\n\n...except for FogLamp, which --at $79.00--is somewhat of a rip...\n\n"
    },
    {
      "time": "12 Dec 2005 — 5:41pm",
      "content": "Thanks Yuri\n\nedit: false alarm. I see the ' Tools \\> Transform —\\> Select an action:'\n\n"
    },
    {
      "time": "13 Dec 2005 — 7:14am",
      "content": "Congratulations and thank you Yuri and the FontLab team for bringing this great new tool to us Mac users.\n\nI do have one comment about a new feature which was (I believe) based on a [suggestion of mine](http://web.archive.org/web/20150223155944/http:/72.14.203.104/search?q=cache:5wpiqxCvH-gJ:www.typophile.com/forums/messages/4101/10995.html%3F1088700935+site:typophile.com+resedit&hl=en&client=safari)...the \"neighbors\" feature.\n\nWould it be possible to make it just a bit more interactive?\n\nAs it is, the \"neighbors\" are loaded when FontLab starts up from the file \"neighbors.txt\". If you want to see different neighbors next to a glyph, it seems that you must quit FontLab, alter the text file, and start FontLab up again. However, I did discover an undocumented feature (at least it's not mentioned in the manual): Control-clicking on a neighbor and choosing \"Choose...\" from the pop-up menu opens a \"Choose neighbor\" dialog box. Wonderful, except this choice only applies to the right-hand neighbor. There does not seem to be any way to choose a different left-hand neighbor.\n\nThere ought to be an easy way to choose neighbors as you are working. The undocumented \"Choose neighbor\" function is close. Ideally, there would be two text fields at the top of the Glyph window or on a palette in which you could type the names of the two neighbors.\n\nThe separate text file is a nice idea, but having a different semi-permanent pair of neighbors for every glyph is not really how I imagined something like this would work. For me, it would be better if there was a global pair of neighbors which remained the same as I go from glyph to glyph, especially if they could easily be changed as I worked. An external list could be used the same way as the metrics strings, where you can choose them from a pop-up menu.\n\nAnyway, this is not to diminish what a big step forward this new version represents, but I hope you think about my suggestion. There is a lot to like about this release. I've already purchased and installed the upgrade.\n\n"
    },
    {
      "time": "13 Dec 2005 — 8:08am",
      "content": "In Win version you can also drag-drop glyphs from FW onto right or left neighbors. But I need to check if it is implemented on Mac the same way :-)\n\n"
    },
    {
      "time": "13 Dec 2005 — 8:19am",
      "content": "support++\n\nBtw, this is important info for all beta testers: you have to remove this file before installing release:  \n/user/library/application support/fonlab/studio5/workspaces/currentworkspace.rc\n\nAlso you cannot import any saved workspaces or preference files, due to some bug (fixed in late beta versions) .rc files and preferences files are not compatible with the release version.\n\nsupport--\n\n"
    },
    {
      "time": "13 Dec 2005 — 9:05am",
      "content": "_In Win version you can also drag-drop glyphs from FW onto right or left neighbors. But I need to check if it is implemented on Mac the same way :-)_\n\nBrilliant! Yes, it does work on the Mac version, too. That's a big help. Thanks!\n\nBut also think about the global neighbors idea if you would. Maybe it could just be a check box somewhere that makes the current pair persist as you move through the glyphs.\n\n"
    },
    {
      "time": "13 Dec 2005 — 9:53am",
      "content": "I've got one, and maybe I'm missing something when it comes to \"Customize\" but...  \nIs there a keystroke, or a way to make one, that will open a new metrics window?\n\n"
    },
    {
      "time": "13 Dec 2005 — 10:04am",
      "content": "...and I have a problem with 'Import \\> EPS' (AI CS2)\n\n"
    },
    {
      "time": "13 Dec 2005 — 10:23am",
      "content": "open new metrics window: there is no standard shortcut, but you can easily add one using the Customize feature.\n\nimport EPS: it should be AI8 EPS. If it will not read it, send me one.\n\n"
    },
    {
      "time": "13 Dec 2005 — 10:27am",
      "content": "Working fine with AI8 EPS. Thanks Yuri.\n\n"
    },
    {
      "time": "13 Dec 2005 — 12:39pm",
      "content": "Yuri -\n\nOk, got it. It was just a little sticky at first. Thanks\n\n"
    },
    {
      "time": "13 Dec 2005 — 4:41pm",
      "content": "\\> you must quit FontLab, alter the text file,  \n\\> and start FontLab up again\n\nEntering and leaving Preferences should do the trick as well (if you modify the neighbors.txt file externally). Otherwise, just drag-and-drop onto the neighbor.\n\nAdam\n\n"
    },
    {
      "time": "13 Dec 2005 — 5:25pm",
      "content": "You left out the part where I said \"it seems that...\" :-)\n\nThanks for the tip, Adam. I'll try that.\n\n"
    },
    {
      "time": "13 Dec 2005 — 6:19pm",
      "content": "\\> You left out the part where I said “it seems that…”\n\n:) In my last eight years of using FontLab, I learned that there are things in it that were not dreamt of...\n\nWhen Yuri does his presentations, I always watch him carefully. Sometimes, he presses an akward keyboard combination and -- ta da -- a top secret feature is revealed that I never knew it existed.\n\nI can't promise it, but I'll try to make sure that Fontlab Ltd. don't have \\_undocumented\\_ features! :)\n\nAdam\n\n"
    },
    {
      "time": "13 Dec 2005 — 8:59pm",
      "content": "I still keep hoping that if I stumble across the occult key combination I will activate the interactive, voice activated 'design my typeface for me'. I have not found it yet. Maybe you need to be double jointed.\n\n"
    },
    {
      "time": "14 Dec 2005 — 5:31am",
      "content": "John: FYI, Letterror just announced a new python plugin, Robointern. It is a voice activated \"design my typeface for me\" feature in .ufo format. You draw 10 signature glyphs, then say: \"make it so, number one\" and it spits out the Devanagari companion font.\n\n"
    },
    {
      "time": "14 Dec 2005 — 5:56am",
      "content": "Randy,  \nSounds like a one trick pony to me :-)\n\nChrisL\n\n"
    },
    {
      "time": "14 Dec 2005 — 11:14am",
      "content": "This is probably not the correct time and place for this kind of question, but could someone explain what has happend to the Zoom feature under the View menu? I was using Command-+/- to zoom in and out. I guess I should RTFM some more, but I'm not finding it.  \nDo other users simply not zoom around as much as me, or do they have another way of doing it? There's not magnifying glass tool, is there?\n\n"
    },
    {
      "time": "14 Dec 2005 — 12:38pm",
      "content": "Try Command-spacebar with plus or minus or command -spacebar and drag a rectangle.\n\nChrisL\n\n"
    },
    {
      "time": "14 Dec 2005 — 12:49pm",
      "content": "The z and x keys by themselves allow for zoom in and out, and they function while you are using other tools. Easily one of the best features of FontLab, and it has been around forever.\n\nJames\n\n"
    },
    {
      "time": "14 Dec 2005 — 12:58pm",
      "content": "I use both.  \nYou can customize \"Command -\" and \"Command +\" into the FLS5.\n\n"
    },
    {
      "time": "14 Dec 2005 — 1:17pm",
      "content": "Eric, the Command+ wasn't working on my Mac for some reason. Either way, it's good that I asked because I didn't know about the Command-Spacebar. Thanks a lot. Again, I'm sure this stuff is in the manual... I think I once saw a single page with most of the useful FL keyboard shortcuts, but now I can't recall what happened to it.\n\n"
    },
    {
      "time": "14 Dec 2005 — 2:02pm",
      "content": "Since shortcuts in FLS are customizable, we don't have single table which lists all shortcuts (in FL 4.6 they were listed in separate tech note). Instead, Customize dialog box has Print option :-)\n\n"
    },
    {
      "time": "14 Dec 2005 — 2:04pm",
      "content": "Speaking of Command-Spacebar (another zoom I use all the time) has anyone noticed that just pressing Command brings up the Magic Wand? Kind of a problem because unless you hit the Command-Spacebar just right, you may end up with the Wand. Additionally, after doing the initial zoom-in with Command-Spacebar the magnifier will turn into the Wand even though the keys haven't been released yet. Is there a way to Customize away the Wand from this key? It's already mapped to the 4 key so this seems redundant.\n\n"
    },
    {
      "time": "14 Dec 2005 — 11:44pm",
      "content": "Adam and/or Yuri,\n\nDo you happen to know when TypeTool will be updated? Thanks!\n\n"
    },
    {
      "time": "15 Dec 2005 — 1:34am",
      "content": "\\> Do you happen to know when TypeTool will be updated?\n\nWhen it is ready ;)\n\nA.\n\n"
    },
    {
      "time": "15 Dec 2005 — 3:23am",
      "content": "\"When it is ready ;)\"\n\nHmmmm, that sounds familiar :-)\n\nChrisL\n\n"
    },
    {
      "time": "15 Dec 2005 — 9:31am",
      "content": "Is there an update planned for FLS 5 for Mac?  \nMan, this thing is buggy.\n\n"
    },
    {
      "time": "15 Dec 2005 — 10:49am",
      "content": "Adam,\n\nThanks, that means you're working on it? :-)\n\n"
    },
    {
      "time": "15 Dec 2005 — 11:19am",
      "content": "Selecting a point and right clicking, under various mice and various typefaces, will cause FLS 5 to crash each time. Is this happening to anyone else?\n\n"
    },
    {
      "time": "15 Dec 2005 — 11:54am",
      "content": "Right clicking on a point seems to be working okay for me.\n\n"
    },
    {
      "time": "15 Dec 2005 — 1:27pm",
      "content": "\\>Selecting a point and right clicking, under various mice and various typefaces, will cause FLS 5 to crash each time. Is this happening to anyone else?\n\nTry to kill preferences and .rc file (as suggested in one of my messages above).\n\n"
    },
    {
      "time": "15 Dec 2005 — 1:28pm",
      "content": "Btw, we are working on 5.0.1 update and hope to have it released before end of the year.\n\n"
    },
    {
      "time": "16 Dec 2005 — 8:34am",
      "content": "\\> Try to kill preferences and .rc file (as suggested in one of my messages above).\n\nThis works. Thanks Yuri.\n\nI've got another one. Is there a way to open the font window without it appearing so wide each time? After it's open you can right click and select Width but is there a way to have it open as in 4.6 (roughly 16 cells)?\n\n"
    },
    {
      "time": "16 Dec 2005 — 9:05am",
      "content": "I've been trying to continue working on an in-progress face using FLS5 Mac. I must admit that it is frustrating. It is such a huge change in interface from 4.6 that it is like a completely new program to learn. Mostly, I just can't find things without a search. I bought 4.6 about a year and a half ago and quickly learned it well enough out of the box to design a multi-lingual type family in 5 weights and italic. I am having more trouble with the transition from 4.6 to 5.0 than I did starting off on 4.6 cold. Is this just my post sedation induced stupidity or does any other Mac user who was not a beta tester have problems too?\n\nI would be curious to know from FL developers what rationale they used to overhaul the interface?\n\nA simple example: in 4.6 I could select a point and hit delete and the point and the 2 line segments on either side would be deleted. In FLS5, when I do the same only the points go away as if I had used the eraser tool on them in 4.6. Where is the eraser tool? How do I now delete line segments? Why is this better?\n\nChrisL\n\n"
    },
    {
      "time": "16 Dec 2005 — 9:17am",
      "content": "I'm having a tough time too, but I'm hanging in there... mostly.  \nI'v been in FLS5 for a few hours each day all week before I get frustrated and switch back to 4.6.\n\nAside from the giant font window I mentioned above, the layers are bugging me. If I copy something from the outline layer, switch to the mask and hit paste I get nothing. You have to click on the actual glyph window that's now the layer. Yikes. Same goes for vice versa.\n\nAdditionally, I swear some key strokes have to be hit twice before they work. Simple things like Select All. All this said, I'm still hanging in there, mostly...\n\n"
    },
    {
      "time": "16 Dec 2005 — 11:05am",
      "content": "Hello Chris,  \nyou can go back to the old delete function in the preferences/Glyph window/advanced/edit/delete command breaks conture. I could not live without it. Do you know where the arrows are to go to next and previous characters?  \nHubert\n\n"
    },
    {
      "time": "16 Dec 2005 — 11:47am",
      "content": "\"Do you know where the arrows are to go to next and previous characters?\"\n\nNope, and I don't know where the \"font info\" button is either.\n\nThanks for the deletion tip you found buried 5 levels deep in preferences. :-)\n\nChrisL\n\n"
    },
    {
      "time": "16 Dec 2005 — 12:44pm",
      "content": "Font Info button -- click into the little button top-right of the Glyph Window (right above the vertical scrollbar), then the Glyph Window's toolbar looks like in FL4.6. (I find the new bottom toolbar more logical though. I don't know the shortcut, but this may be another option to access it.)\n\nSame for the Metrics/Kerning Panel -- there's everything to \"simulate\" the FL4.6 interface. E.g. try the three buttons to the right of this window's top toolbar.\n\nIt's worth consulting the manual. It may have some pages more, but is better than the former one. Also, it has very useful technical background information, like the information on unicode or recommendations for naming fonts, even many links to specifications.\n\nIt took me quite a while to get accustomed to FLS5 too. Moreover, I used it first on a WinXP PC -- and the last Windows I touched was 3.1. That was rather horrific at first.  \nHowever, once you got it, you would not want to return to FL4.6, just as I never dreamed of going back from FL4.6 to Fontographer, or from OS X to OS 9, or from InDesign to PageMaker ... It's different worlds.\n\nKarsten\n\n"
    },
    {
      "time": "16 Dec 2005 — 1:03pm",
      "content": "Thanks Karsten, I'll try to persevere. It is just hard to take the productivity drop :-)\n\nChrisL\n\nPS: I never dreamed of going back to Quark either :-)\n\n"
    },
    {
      "time": "16 Dec 2005 — 2:48pm",
      "content": "Adam Twardoch referred to this PDF in another thread:  \n [http://www.twardoch.com/download/unicode2005\\_fontlab5.pdf](http://web.archive.org/web/20150223155944/http:/www.twardoch.com/download/unicode2005_fontlab5.pdf)  \nAside from information in condensed form, p17 shows Lucas de Groot's one-image manual for the Metrics/Kerning Panel. Very useful.\n\nAbout kerning in FLS5, see Adam Twardoch's posts to this recent thread:  \n [http://typophile.com/node/16413](http://web.archive.org/web/20150223155944/http:/typophile.com/node/16413)  \nEspecially the description of three kerning modes -- search for \"there are three kerning modes\".\n\nFor those who use it, this is about installing RoboFab with FLS5 Mac:  \n [http://just.letterror.com/ltrwiki/RoboFab\\_2fFontLabStudio5?](http://web.archive.org/web/20150223155944/http:/just.letterror.com/ltrwiki/RoboFab_2fFontLabStudio5)\n\nOh yes, it is dangerous to update anything if you have to finish something in time.  \nBut it seems that both versions can be installed at the same time (I hope I don't tell nonsense), so you can draw and finish a job in FL4.6, and play with FLS5 at night or use it for generating fonts which is much easier than with FL4.6 -- and by the way find that FLS5 is much better. :)\n\n"
    },
    {
      "time": "16 Dec 2005 — 3:13pm",
      "content": "Karsten,  \nTHANK YOU! You addressed many of my most urgent concerns in your last 2 posts! I am sure others will also benefit from your taking the time to post.\n\nYou are a true gentleman and a scholar:-)\n\nChrisL\n\n"
    },
    {
      "time": "16 Dec 2005 — 3:33pm",
      "content": "_Do you know where the arrows are to go to next and previous characters?_\n\ncomma and period (i believe)\n\n"
    }
  ]
}
