{
  "id": "16775",
  "title": "personal monogram / logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi everybody -  \nThis is my first time posting here. Right now, I’m working on a personal mark that I can use on my resume, business card, online portfolio, etc. I want it to be very distinctive and have lots of character without it becoming too stylized to the point where it is considered trendy/kitch. I ended up using only my initials (EB). If people could gimme some critiquing, it would be much appreciated. I am new to this site, but have been reading other posts and noticed a good amount of valuable constructive criticism.  \nThanks,  \nEric\n\n| Attachment | Size |\n| --- | --- |\n| [iconnew.gif](http://web.archive.org/web/20080118114720/http:/typophile.com/files/iconnew.gif) | 1.05 KB |\n\n [‹ Boat Club Logo](http://web.archive.org/web/20080118114720/http:/www.typophile.com/node/16782 \"Go to previous forum topic\") [Car company logo ›](http://web.archive.org/web/20080118114720/http:/www.typophile.com/node/16445 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080118114720/http://www.typophile.com/user/10572\" title=\"View user profile.\">e_roc</a>",
  "time": "<br>",
  "uid": "10572",
  "comments": [
    {
      "time": " 13.Dec.2005 12.58am",
      "content": "I really like the e part. The B could use more work, I think.\n\n"
    },
    {
      "time": " 13.Dec.2005 4.12am",
      "content": "I agree with Kevin, the e is great. Why not just go with the e alone?\n\n"
    },
    {
      "time": " 13.Dec.2005 8.42am",
      "content": "Honestly, the ’b’ part was an afterthought, and looking at it now, it looks like one. After making the ’e,’ I reversed it out in a red square and then decided to cut the corners. I was more going for something that implied the shape of a ’b’ rather than an actual ’b’. I think I still want to do something with the red square, but I’m not sure what. Any suggestions?\n\n"
    },
    {
      "time": " 13.Dec.2005 9.06am",
      "content": "How about the ’e’ in the red square? It makes the stylised ’e’ look more like a marque when it’s encompassed by the square and it gives it more punch. The ’e’ is so nice on its own that the nicks out of the square to make the ’b’ just interfere with the ’e’. I know it’s a simple solution, but I think that’s just what it needs - the ’e’ is interesting in itself, has relevance and looks ’designed’.\n\n"
    },
    {
      "time": " 13.Dec.2005 7.33pm",
      "content": "I wonder what would happen if you rounded the clipped edges of the B/square. It might imply the letter B without distracting too much from the nice simplicity of the e.\n\nI’m not sure though, I’m always hesitant to round corners on anything given its trendy nature. At least there would be a specific reason besides “It looks cool.”\n\n"
    }
  ]
}
