{
  "id": "16791",
  "title": "'dents' in a letterform - what's the proper name?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi all,\n\nI am writing a logo and brand guidelines and I cannot remember the proper name for the 'dent' in a letterform.  \nFor example the letter 'k'. I have looked on the web and can't seem to locate it.\n\nIf anyone can help, I'd really appreciate it.\n\nThanks,  \nT.\n\n",
  "author": "Tee",
  "time": "14 Dec 2005 — 5:02am",
  "uid": "10620",
  "comments": [
    {
      "time": "14 Dec 2005 — 5:31am",
      "content": "The angle?\n\nCould that join inside the k be refered to as the shoulder?\n\nSometime the angle inside the letter v (where the two legs meet) is called the crotch.\n\n"
    },
    {
      "time": "14 Dec 2005 — 5:34am",
      "content": "Or do you mean trapping?\n\n"
    },
    {
      "time": "14 Dec 2005 — 6:21am",
      "content": "[Trapping](http://web.archive.org/web/20131014025536/http:/typophile.com/wiki/Trapping) is when you over compensate for printing errors and fill-ins with your design (ok, that is oversimplifying things a bit…), like in [Bell Centennial Bold Listing](http://web.archive.org/web/20131014025536/http:/www.myfonts.com/fonts/linotype/bell-centennial/bold-listing/). it isn't the term for the general joins within a letter, which I believe is what Tanya is asking for.\n\n"
    },
    {
      "time": "14 Dec 2005 — 6:30am",
      "content": "\"is when you over compensate for printing errors\"  \nit is only \"overcompensation\" when you over do it.\n\nTo me, trapping is also a way to open visual space at small sizes--even if ther was no ink plugging going on. Angle joins of M, W, and N are examples of glyphs that might need it. The bolder the weight, the more likely the need will arise.\n\nChrisL\n\n"
    },
    {
      "time": "14 Dec 2005 — 11:02am",
      "content": "Do you mean the negative space between the arm and the leg of the 'k'? Maybe a sort of counter? or maybe it doesn't have a name\n\n"
    },
    {
      "time": "14 Dec 2005 — 12:40pm",
      "content": "A crotch or a groin where the arm and leg join.  \nTrapping is likely to be confused with the same term in reproduction for print, I think inktrap or cutaway would avoid confusion.  \nConfusion reigns.  \nTim\n\n"
    },
    {
      "time": "14 Dec 2005 — 1:27pm",
      "content": "Thanks Tim, inktrap is indeed what I wanted to say.\n\n"
    },
    {
      "time": "14 Dec 2005 — 1:53pm",
      "content": "But since Chris is right that traps fight optical effects  \nat small sizes and not just ink gain, \"inktrap\" is more  \nmisleading than any momentary and rare confusion with  \nthe print production term. Many terms are overloaded,  \nbut sometimes that's not the worst thing that could  \nhappen to them.\n\nTanya, I really have no idea what she means.  \nThe \"k\" is not a typically/prominently trapped  \nletter, but neither does it seem to have any  \npart that looks like a \"dent\"...\n\nhhp\n\n"
    },
    {
      "time": "16 Dec 2005 — 5:23am",
      "content": "Hi all,\n\nThank you (s) for your replies. I think 'crotch' best describes it. The sentence goes something like this:  \n'The x-height in slogan/tagline should never be taller than the 'crotch' in the letter 'k' within the logo.' This will then be supported by an illustration.  \nSounds better than saying 'indent' or angle if you know what I mean?\n\nThanks again,  \nT.\n\n"
    },
    {
      "time": "16 Dec 2005 — 5:31am",
      "content": "You could say \"join.\" It's not standard type jargon, but it's descriptive.\n\n"
    },
    {
      "time": "16 Dec 2005 — 7:49am",
      "content": "Join sounds less painful as a word image than crotch does, even though it is a perfect description. Groin is another as in \"Groin Vault\" architecturally.\n\nChrisL\n\n"
    },
    {
      "time": "16 Dec 2005 — 8:11am",
      "content": "not technical, but: elbow  \nmore technical: upper diagonal / lower diagonal join\n\n"
    },
    {
      "time": "16 Dec 2005 — 9:27am",
      "content": "I like the 'crotch' description...scandalous!\n\n"
    },
    {
      "time": "16 Dec 2005 — 9:38am",
      "content": "Specific to the letters \"k\" and \"K\" the upper diagonal is called the \"arm\" and the lower diagonal is called the \"leg\".\n\nSo I guess the crotch would be somewhere between the arm and leg. ;-)\n\n"
    },
    {
      "time": "16 Dec 2005 — 9:51am",
      "content": "Exactly my thinking, Norbert!\n\n"
    },
    {
      "time": "16 Dec 2005 — 10:06am",
      "content": "What about \"chevron\"?\n\n\\> the upper diagonal is called the “arm” and ...\n\nSometimes they're both called \"arm\"s.\n\nBTW guys, don't forget, the inside of the \"v\"\\* is sometimes called a \"cleavage\". :-)\n\n\\* Or better, the inside of a Greek Upsilon!\n\nhhp\n\n"
    },
    {
      "time": "16 Dec 2005 — 1:07pm",
      "content": "You got a leg up on that one Norbert:-)\n\nChrisL\n\n"
    },
    {
      "time": "16 Dec 2005 — 1:24pm",
      "content": "That would almost make a great typographic calendar. Sex and characters. One month could be K or k and V and so on.\n\n"
    },
    {
      "time": "16 Dec 2005 — 2:02pm",
      "content": "\\> <cite>Sex and characters. </cite>\n\nI've always thought 'Q' to be a rather sexy one. :)\n\n"
    },
    {
      "time": "16 Dec 2005 — 2:16pm",
      "content": "\"I’ve always thought ‘Q’ to be a rather sexy one.\"  \nThat is what Miss Moneypenny thought before she met 007.  \nThen he started F ing around and she went bach to sipping on T. :-)\n\nChrisL\n\n"
    },
    {
      "time": "16 Dec 2005 — 3:01pm",
      "content": "This calendar has more potential than I thought. Poor Miss Moneypenny she never got what she wanted, maybe in the next bond when they are in the old age home.\n\n"
    },
    {
      "time": "16 Dec 2005 — 3:26pm",
      "content": "Dialogue heard from the old age home:\n\n\"James dear, did Q make all of your equipment or is some of it, shall we say, all your own?\"\n\n\"Why Money penny! What ever do you mean?\"\n\n\"I mean your walker is parked in my spot James and I wanted to know if it was you I should blame or Q dear.\"\n\n\"Thank God! At first I thought you were talking about my [PPK](http://web.archive.org/web/20131014025536/http:/world.guns.ru/handguns/hg13-e.htm)\"\n\nChrisL\n\n"
    }
  ]
}
