{
  "id": "16807",
  "title": "arabic diacratic marks",
  "forum": "Build",
  "tags": [

  ],
  "content": "I am currently creating my own arabic font (for personal use). So far I have created all glyph variants and ligatures. The next step before I move on to Microsoft VOLT is to create the diacratic marks. I have already created 1 glyph for each individual diacratic mark (’fatha’, ’kasra’, ’damma’, etc.), but the problem is, the position of the glyph will depend on the letter it appears above (for example, the ’fatha’ that appears on the letter ’alif’ will be much higher than the ’fatha’ that appears on the letter ’baa’ and also more to the left). My question is, do I have to create a different glyph variant for each position of the diacratic mark, or is there some way to specify the position of the mark in Microsoft VOLT?  \nIn other words, do I need 1 glyph of the diacratic mark ’fatha’ (and can I then change the position in VOLT) or do I need to create a specific one for each letter?  \nThanks  \nI. Jamal\n\n [‹ Best software](http://web.archive.org/web/20071214061758/http:/www.typophile.com/node/19953 \"Go to previous forum topic\") [David Kindersley on Spacing ›](http://web.archive.org/web/20071214061758/http:/www.typophile.com/node/19789 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071214061758/http://www.typophile.com/user/10168\" title=\"View user profile.\">irf2k</a>",
  "time": "<br>",
  "uid": "10168",
  "comments": [
    {
      "time": " 15.Dec.2005 8.23am",
      "content": "There are spaces within the font to allow for complete characters \\*with\\* the diacritics. I’m not familiar with the Microsoft VOLT software, but try opening an existing Arabic font in the editor and you should be able to see the characters and where they should go.\n\nI’ve been wanting to create an Arabic face for some time now. I’d be interested to see how yours progresses.\n\nTheodore\n\n"
    },
    {
      "time": " 15.Dec.2005 8.42am",
      "content": "You only need one glyph per mark. In VOLT, you set up the Mark Positioning and Mark-to-Mark features, using anchor attachment lookups. The trick is to position all your marks carefully in their own glyph space so that, for example, all above marks can be positioned on a letter using the same anchor attachment point. Within the VOLT glyph positioning window, you should lock the position of all second elements (marks), and then drag the marks into position above or below each letter, using the x and y offset values for the first element (base) to fine tune the positioning.\n\nMarks need to be classified as such in the VOLT glyph edit window (this sets their GDEF category).\n\nYour ligature substitution lookups should be set to ignore marks, so that the ligatures will form regardless of whether there is a mark on one or more of the letters. In the VOLT glyph edit window you need to identify ligatures as such and correctly record the number of components. So, for instance, the lam\\_alif ligature has two components.\n\nOnce this is done, in the glyph positioning window you can make a mark-to-ligature lookup, and position the marks independently for each component of the ligature.\n\nYou will find a lot of good information in the archives of the VOLT user community on MSN. You can also download the VOLT supplementary files, which include a model Arabic OT font that you can open in VOLT and examine.\n\n"
    },
    {
      "time": " 15.Dec.2005 10.55am",
      "content": "phew...that makes it alot easier...I thought I would have to create a a different mark for the letters of different widths and heights...  \nWell, time to learn how to use VOLT.  \nThanks for the info.\n\n"
    },
    {
      "time": " 19.May.2006 11.45pm",
      "content": "Is your Volting still progressing?  \nHope you will find these 2 sites more encouraging than discouraging:  \n [http://www.nonosoft.jifisa.net/download.php](http://web.archive.org/web/20071214061758/http:/www.nonosoft.jifisa.net/download.php \"http://www.nonosoft.jifisa.net/download.php\")  \n [http://qurankareem.info/a/OthmanyFonts.zip](http://web.archive.org/web/20071214061758/http:/qurankareem.info/a/OthmanyFonts.zip \"http://qurankareem.info/a/OthmanyFonts.zip\")  \n [http://qurankareem.info/a/othmanyQuran.zip](http://web.archive.org/web/20071214061758/http:/qurankareem.info/a/othmanyQuran.zip \"http://qurankareem.info/a/othmanyQuran.zip\")  \nHappy Volting\n\n"
    }
  ]
}
