{
  "id": "16817",
  "title": "The 'magic' of type-design.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "In light of recent events...I have been asking myself a question. That maybe someone would give their 2 cents.\n\n1. How is the character of a new type ’extrapolated’ from it’s purpose.\n\nHow lets say, a text type for a newspaper vs. a text type for a historical novel vs. a text type for a contemporary design journal.\n\nThanks\n\nedit: How a types’ character is derived from it’s usage. Like, JFP designed a type for whatever use, what is the driving creative force/philosophy behind what shapes the letters take.\n\n [‹ Berlin.](http://web.archive.org/web/20081011164533/http:/typophile.com/node/16903 \"Go to previous forum topic\") [typographic holiday gift? ›](http://web.archive.org/web/20081011164533/http:/typophile.com/node/16618 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081011164533/http://typophile.com/user/6194\" title=\"View user profile.\">Eric_West</a>",
  "time": "<br>",
  "uid": "6194",
  "comments": [
    {
      "time": " 15.Dec.2005 11.50am",
      "content": "Can you elaborate more? I don’t seem to understand you question :(\n\n"
    },
    {
      "time": " 15.Dec.2005 12.09pm",
      "content": "Based on the stock it is intended to be printed on?  \nSorry just as foggy as Dan on the question.  \nTim\n\n"
    },
    {
      "time": " 15.Dec.2005 12.11pm",
      "content": "Or why the type takes the form it takes. Which usage has a bearing on.\n\n"
    },
    {
      "time": " 15.Dec.2005 12.15pm",
      "content": "esthetics\\*\n\n"
    },
    {
      "time": " 15.Dec.2005 12.18pm",
      "content": "By editing my message i seem to have erased all of it.\n\nI’ll make a second attempt.\n\nAre you talking cultural esthetics or type usability?\n\n"
    },
    {
      "time": " 15.Dec.2005 12.28pm",
      "content": "**Why does it take a certain form?  \nWhat is the thought before the form?**    \nAre you talking basic human estethics or usability here?\n\nI’m talking about something I havn’t seen very often here, at least personally. Not stock, Julian, welcome to typophile. You are closer to what I’m asking. Because usability for text type is narrowly defined, just, I guess cultural esthetics.\n\nIt’s not purely cosmetic is it? Making where the shapes come from more than surface.\n\n"
    },
    {
      "time": " 15.Dec.2005 12.42pm",
      "content": "What’s the feeling? Modern or Antique? When you say modern, do you mean Neo-Classicist, Moderist, Post-Modern, or Contemporary.\n\nAntique: do you want old fashioned or just old? French, English, or Dutch. Or Venetian?\n\nHumanist or Geometric? That feeling determines the axis, to some degree, and a lot of other aesthetic traits.\n\nIf your college is a Catholic University, it would need different type that a large State Institution or a small liberal powerhouse. Just an example.\n\nThe Republicans and the Democrats should use separate typefaces. They actually do, but for the right reasons?\n\nRudi Bauer asked Peter Bilak to “deprotestant-ize” Univers. Bilak drew Fedra.\n\nThin, cheap, rougher paper needs thicker stems, less thins, and sturdy serifs. And open counters that won’t fill in. Big glossy coffee table books can be printed in Didot without any problems—because no one is going to read that text anyway.\n\nAesthetic choices are often ground in historical habits—and sometimes for good reason.\n\nWho do you want to be as a designer? What do you want to make? (Surely you don’t just want to reiterate the past!) This is more important to ask yourself first, rather than what sort of letterforms you happen to like.\n\nAm I getting in the right direction?\n\n"
    },
    {
      "time": " 15.Dec.2005 1.28pm",
      "content": "Interesting question, Eric. Is it about the design process, or how people use type?\n\nFor the first, I might say it depends on the design goals. In one instance the designer might be concerned about historical precedent/aesthetics, whereas in another the same person might be designing for the limitations of a particular mode of reproduction (like newsprint, video subtitles, etc.) You could go further in addressing the culture, age, gender etc. of the audience.\n\nFor the second instance, I think it’s difficult to say how character (the character of characters?) can be derived from usage, in that you can’t predict how people will use it. A face that is bundled with windows 95 will take on a different meaning than one that is sold at fontshop. When designers start using a corporate typeface in a different way for techno flyers all of a sudden the meaning shifts.\n\n"
    },
    {
      "time": " 15.Dec.2005 1.46pm",
      "content": "I think that Eric’s question was about how or why typefaces intended for similar media or usage (newspaper, magazine, book, signage, book, etc.)get to have a similar character.\n\nMaybe half of it is tradition or convention (you know a book face has to look like a book face) and half of it is the technical constraints of different uses.\n\nHéctor\n\n"
    },
    {
      "time": " 15.Dec.2005 1.59pm",
      "content": "\\> Like, JFP designed a type for whatever use, what is the driving creative force/philosophy behind what shapes the letters take.\n\n“I have great difficulties designing fonts without a function or a brief. I cannot create new form just for the pleasure of it, it’s more the reverse; the functions make me want to search for new forms....\n\n....Type design is an intellectual rather than a manual job, the tools don’t directly influence the forms, it’s more to do with what your brain, your own culture and influences, your reading, brings to the work that make the difference.”\n\nJFP, “Designing Typefaces”\\* - David Earls, page 62\n\n\\*$25.20 - Amazon, 50 used & new from $17.39 :)\n\n"
    },
    {
      "time": " 15.Dec.2005 2.43pm",
      "content": "I would say that you have to establish design criteria just like you would for a logo, Part of the criteria is Audience, Purpose, Message. The other part involves delivery method and all its accompanying variables (paper, press quality, speed of production, skill of technicians, equipment, etc.). I once set up a matrix with all the perceived variable. (perceived because you are not always right). This was many years ago (pre digital) and I don’t know how much of it is useful today or even if I can find it. If you are doing this as part of your senior thesis, you might want to create your own matrix. It is a good learning experience.  \nEven if you are just designing a type for your own sake, you should still define the criteria. This is what I was talking about (and so was Nick) in my critique of your roman face here. You establish the criteria; you address them in writing and decide the best approach to begin your design. You end up with a design brief that becomes your own plan of attack. Look at each variable and decide how to accommodate it. Compare a low unit cost phonebook for an aged audience printed on on absorbent paper to a prestigious university illustrated technical journal aimed at graduate students printed on dull-coated stock. What do you need to do differently to attack these two products? All of these variables translate into differences of stroke weight, contrast, x-height, metrics, trapping, character, character set, OTF features, etc. So far, we have not even touched on aesthetic things like “style”. To me, if you solve all of the functional variables first, so much will be resolved that aesthetics or “style will be mostly taken care of already.  \nBeyond this, you have your own design concept to evolve out of the problem. Personally. I am not one to look at other similar work first and imitate from the masters. I prefer to just apply my own decision making, experience, tenacity, and concept building skills directly. This may not be the fastest way or give you the comfort of knowing you did it like JFP or Frutiger but it gives you your own design. That is why I do it—I am not interested in doing revivals or homages to great designers of the past (I leave that to others who have that desire and personality). You have to ask yourself why YOU want to be a type designer. My answer probably does not work for you or anyone else. I make no judgments on other designers who choose a different path. The World should allow for each of us in our own way. You do have to determine what YOUR own way is though. This is not a “My way or the Highway” thing either. Take advantage of dialogue with colleagues; accept criticism and address it openly even if you feel disagreement with it. You may find your colleague is right or you may find a way to bolster your own reasoning by virtue of the dialogue with him/her. Either way you win.\n\nI am sorry to be so long winded. I tend to blather when I am not sure what the question is. What I do sense is that you are searching as much for the QUESTION within YOURSELF as you are for an answer. Perhaps you are afraid it entails more work than the time remaining or you feel inadequacy to solve it. HAVE NO FEAR! You are a student; this is normal; you will do it in time! Just put your shoulder to the wind and start pushing. It gets easier when you keep moving (objects in motion tend to stay in motion; objects at rest tend to stay at rest).\n\nChrisL\n\n"
    },
    {
      "time": " 15.Dec.2005 2.49pm",
      "content": "I forgot to say, There is No Magic, just work :-)\n\nChrisL\n\n"
    },
    {
      "time": " 15.Dec.2005 6.14pm",
      "content": "Thanks Chris,\n\nI knew the first crit would be tough. And it shows I’ve learned very little. It isn’t just something you sit down to do like painting or sculpture. I’m going to do what Nick suggested in his last post, get it all in a setting, see how it all fits, and then make it better.\n\nI have to sit down and really decide what this needs to be. I think I can salvage it. Have a lot to think about. I had heard that type is designed for a purpose, with intent, I just didn’t realize the gravity it carried. Why I want to design type.\n\nDon’t apologize for blathering. Your blathering is more helpfull than anything I could do myself.\n\np.s.- Would you happen to have a sample design brief I could look at? I don’t even know where to begin. I’ve never even seen a design brief. And once I decide, whatever it is for, how do I determine the criteria i should follow?\n\nThanks Again\n\nEric\n\n"
    },
    {
      "time": " 15.Dec.2005 9.40pm",
      "content": "Great post Chris. I have been stuck with a thesis on type design for a year and a half. At first I wanted to finish a type design for book setting... Now I’m intending to establish a criterion on which to base a type design as the final stage of my thesis.\n\nThis is partly because I want to finish in the next 6 months but also because I want to focus on the theorical stage which I consider crucial to the succes of the project (it is about designing a typeface to answer the characteristics of spanish and spanish texts).\n\nSo I didn’t know what could be the final product of this thesis until you mentioned this thing about setting a Matrix to ponder all the involved variables.\n\nThanks\n\nHéctor\n\n"
    },
    {
      "time": " 16.Dec.2005 9.21am",
      "content": "The worst typeface design brief I’ve ever been given is ’We want a display face, something swashy but contemporary’. The nightmare of such a brief is that it is both vague and entirely concerned with stylistics. About the only solid thing to latch my teeth onto was the fact that they wanted it to look good in a particular rendering environment.\n\nThe best sort of briefs have some significant limitation in them, such as being readable at 9pt on cheap newsprint. These kinds of limitations give you something to engage with immediately, rather than floundering around for weeks or months trying to design something lovely ex nihilo. But of course, this is just the beginning: if someone asks me to design a newspaper face, the result is going to be different from asking JFP to design a newspaper face, even if the technical requirements and limitations are the same.\n\n"
    },
    {
      "time": " 16.Dec.2005 9.31am",
      "content": "” if someone asks me to design a newspaper face, the result is going to be different from asking JFP to design a newspaper face, even if the technical requirements and limitations are the same.”\n\nGreat point John, that is the GOOD PART. That is why there is more than one designer in the world. That is why we design. When Eric is done “boxing with his brief”, he will find HIS way—then JFP and you had better watch out :-)\n\nChrisL\n\n"
    },
    {
      "time": " 16.Dec.2005 10.08am",
      "content": "Thank you all. I think John hit my question on the head. ’...the result is going to be different from asking JFP to... “\n\nOnce the technical requirements and limitations are covered, is it stylistic after that?\n\n"
    },
    {
      "time": " 16.Dec.2005 11.44am",
      "content": "“Once the technical requirements and limitations are covered, is it stylistic after that?”\n\nOnce they are, the stylistic issue will become self-evident.\n\nChrisL\n\n"
    },
    {
      "time": " 16.Dec.2005 12.22pm",
      "content": "Seems pretty magical to me.\n\n"
    },
    {
      "time": " 16.Dec.2005 12.44pm",
      "content": "I like the bit where your eye pops out and yo-yos around before flying off.\n\n"
    },
    {
      "time": " 16.Dec.2005 9.49pm",
      "content": "_Once the technical requirements and limitations are covered, is it stylistic after that?_\n\nIt is a mix of things, both personal and cultural, and these don’t come after ’the technical requirements and limitations are covered’: they are part of the way in which you approach those requirements and limitations. Even in the case of a typeface like Microsoft’s Tahoma UI font, which had some of the strictest technical requirements and limitations of any recent typeface, the requirements and limitations are not entirely determinative. So what you get is Matthew Carter’s response to those requirements and limitations, based on his many years of experience and the ideas he has developed about type for specific kinds of environments.\n\nAnd the mix itself is quite particular. JFP is a distinctly French type designer, and his types are full of references to various aspects of French text and display typography and lettering from several centuries: he belongs to and furthers a national typographic tradition. On the other hand, I don’t think I am a distinctly Canadian type designer, and for me national tradition is much less obvious or important.\n\n"
    },
    {
      "time": " 16.Dec.2005 10.55pm",
      "content": "\\>a text type for a newspaper\n\nI usually develop my prototype against a variety of successful news faces such as Utopia, Nimrod, and News 706, comparing performance in a narrow justified column, all with the same specs.\n\nThen making chages, and compare again. And so on.\n\nIt’s really brutal, because I’m trying to match or better their character count without looking too small or too condensed or too vertical or too contrasty or not contrasty enough, and without entangled extenders or ambiguous character combinations.\n\nYou could start with any typeface and adapt it to those criteria, by a process of trial and error, call it design.\n\nOnce you’ve done one, you start to think and draw more non-verbally. Call it experience, or perhaps magic.\n\n"
    },
    {
      "time": " 18.Dec.2005 9.48pm",
      "content": "Ok,\n\nAfter much (painful) consideration I’ve decide to start over. I believe that with a purpose in mind, I will find it much easier to focus on what I need to do and not just salvaging a re-hash. I’ve also done some thinking as to why I want to do this (type).\n\nHere is my new objective: Comments welcome.\n\nA type for a new magazine on Contemporary Architecture.  \nA serif version for text, sans for headlines. Humanist..\n\nSo, if anyone has thoughts, Criteria for type on nice matte magazine pages, maybe ID magazine quality paper. Not cheepo newsprint. Much appreciated.\n\nEric\n\n"
    },
    {
      "time": " 18.Dec.2005 10.52pm",
      "content": "HUMANIST SANS  \n1. Draw skeleton shapes with pencil.  \n2. Scan and place in template/mask layer  \n3. Manually trace path using bezier pen tool  \n4. Expand stroke/Make parallel path  \n5. Adjust glyph shapes, and sidebearings based on character juxtapositions in Metrics window  \n6. Add stroke contrast\n\n"
    },
    {
      "time": " 19.Dec.2005 7.26am",
      "content": "So,\n\nDraw them in the shapes you want, like the left or the one on the right? Confused about skeleton shapes.\n\n ![](http://web.archive.org/web/20081011164533im_/http:/typophile.com/files/skel.jpg)\n\nI only ask because I tried expanding trokes with a drawing like the one on the right, didn’t seem to do much for me.\n\n"
    },
    {
      "time": " 19.Dec.2005 10.36am",
      "content": "On the right. Skeleton, not outline.\n\n\\>didn’t seem to do much for me.\n\nYou’re still hung up on the individual glyphs. Type is about the way the letter shapes interact with each other — and of course this is more evident in a sans, where there is less entertainment at the glyph level.\n\n"
    },
    {
      "time": " 20.Dec.2005 12.36pm",
      "content": "Like this?\n\n ![](http://web.archive.org/web/20081011164533im_/http:/typophile.com/files/eric.png)\n\n"
    },
    {
      "time": " 20.Dec.2005 2.14pm",
      "content": "I understand, I think, what the point of this is. But once I get all my proportions worked out and start adding contrast, Am I letting Fontlab dictate form? At what point do the individual characters form?\n\n"
    },
    {
      "time": " 20.Dec.2005 2.35pm",
      "content": "For a text face, it would be better to start with the lower case.  \nTry and get a lighter touch happening.  \nDo some words, or a succession of “a”s, and choose the best.\n\n"
    },
    {
      "time": " 2.Jan.2006 12.59pm",
      "content": "Some hurried things:\n\nThe magic is there, but it is not conjured - it just happens.\n\nFor a text face, start with the boring stuff, like “n” and “o”.  \nFor a display face, the opposite, like “g” and “Q”.\n\nBeware of actually drawing out “skeletons” - that will point you  \ndirectly away from good notan. Think instead about boundaries.\n\nThe intended usage of a face (like news versus novels) is directly  \nlinked to the font’s vertical proportions, color, width, spacing, etc.  \nClosely observe fonts that work in their mediums to guide your  \nown travels.\n\nFor a text face, express personal aesthetics only in spite of yourself.\n\nhhp\n\n"
    },
    {
      "time": " 2.Jan.2006 1.41pm",
      "content": "sorry if the following post is useless to you, im not really sure about it. i havent slept in about 30 hours, so please bear with me :)\n\nconcerning drawing letters im not as far as most people commenting here. but i have to say that my feeling is that you just dont haven’t done the mechanical, the handwork needed to get the lettershapes into your brain. im drawing and constructing and drawing a, b, c or whatever letter i like that day again and again. sometimes i try to match a font i already know and sometimes i just make fun stuff (a hairline-serif lowercase letter with fat slab serifs for example). this gave me a lot of knowledge about where the traps are in typedesign and where you normaly need to work a little bit longer on - for me, the hard lc-letters mostly are a and s.\n\nright now, im struggling with the uppercase-letters of a display-sans im designing. its curvy, its round, but at the same time it still holds a lot of the “normal” features of sans-faces. now, my job is to match each letter to each other so that they work together while still maintain their speciality (its a display-face after all). i didnt have a brief, i started with an idea for two letters. i refined, drew a few other letters. refined them again, changing the whole contrast in the end and redrawing all letters again. then expanded the character-set, and then started with the uppercase... where i am now :)\n\nits hard, but its good.\n\n————\n\nim not sure if im right in saying you’re not experienced enough to do this - but a text-font is a HARD job and needs some experienced hands and eyes to get done.\n\n"
    }
  ]
}
