{
  "id": "16812",
  "title": "Oversized quotation mark",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm designing a book with a lot of long quotes from speeches. I wondered if i should place an oversized, pale quotation mark on the beginning of each font, tpo make it more obvious that it's actually a \"spoken word quote\". but there's something in my brain stem that tells me this could look really tacky. What do you guys think?\n\n ![](http://web.archive.org/web/20140910084802im_/http:/typophile.com/files/quote.gif)\n\n",
  "author": "alexfjelldal",
  "time": "15 Dec 2005 — 8:31am",
  "uid": "5430",
  "comments": [
    {
      "time": "15 Dec 2005 — 8:48am",
      "content": "I think I like it, and, I think it may even work well.. :)\n\nDav\n\n"
    },
    {
      "time": "15 Dec 2005 — 8:55am",
      "content": "Not bad. Two things:\n\n1. It may look less tacky with a different font. The heavy modern can be comic.  \n2. It's backwards to me. Use an opening quote.\n\n"
    },
    {
      "time": "15 Dec 2005 — 9:00am",
      "content": "I've seen this several times in brochures, where customer testimonials are inserted into the text. It can work well. Might even be better in your case, where the quotations are longer stretches of text.\n\nOne thing to note on your sample though... the mark you're using is a closing quotation mark and you have it at the beginning of your text. Was this intentional? Seems counter-intuitive to me.\n\n_Edit: Stephen beat me to that one!_\n\n"
    },
    {
      "time": "15 Dec 2005 — 10:47am",
      "content": "Not all languages use the same quotation marks. The opening quotes for some languages, such as German, are \"low-9\" quotes. They are paired with the raised 6-shaped quotes on the right (which are the same as the English-style opening quotes). See the [Wikipedia article](http://web.archive.org/web/20140910084802/http:/en.wikipedia.org/wiki/Quotation_mark). I know they use these in Icelandic, so I'm guessing this is the convention in Norwegian as well.\n\n"
    },
    {
      "time": "15 Dec 2005 — 10:49am",
      "content": "Gotcha! Besserwissers! ;)\n\nDear Stephen and Engel, I would bet that the text in Mr. Fjelldal’s book is Norwegian, Danish or Icelandic. I assume that just like in Finnish and Swedish, the opening quote looks just like the closing quote, which led to your mild errors. So go on, Alex.\n\nYour majesty, your royal highness, dear guests and… No?\n\nEdit: I guess I should recheck the conversation before posting…\n\n"
    },
    {
      "time": "15 Dec 2005 — 11:14am",
      "content": "Very interesting! That Wikipedia page has lots of great info. Thank you for correcting me, Alexander and Lari.\n\nObviously, I haven't done much non-English work! I knew other languages/cultures had different marks for quotations (ie. chevrons, corner brackets). But I didn't realize there were others that used the same style marks in a different configuration.\n\nWell then, Alexander (Fjelldal), carry on!\n\n"
    },
    {
      "time": "15 Dec 2005 — 11:15am",
      "content": "It's entirely a personal æsthetic call. I don't like big type greyed-back as you have done, but that should not stop you from doing it. I relate this kind of visual to early hack DTP - DeskTop Publishing - along with screened full-colour photos behind pages of text.\n\n"
    },
    {
      "time": "15 Dec 2005 — 11:16am",
      "content": "Him, it looks nice but also very web/blog like. For a serious book maybe not enough neutral or timeless?\n\nBTW, for a German reader these are opening marks.\n\n-- [astype.de](http://web.archive.org/web/20140910084802/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "15 Dec 2005 — 1:27pm",
      "content": "If you use over sized quotes investigate printing them about 10% tint of gray or of the PMS color you choose. Why pull attention away from the actual quote?\n\n"
    },
    {
      "time": "15 Dec 2005 — 3:33pm",
      "content": "I'm on the fence. I've seen this in bad textbook design, though, so maybe I'm off on a bad foot. Second Dan on the light screen or PMS, although a trap to the PMS could make a mess. Look at the line screen as well. If it is high and you think the printer can do a light tone screen do it. What's the paper?\n\n"
    },
    {
      "time": "15 Dec 2005 — 5:09pm",
      "content": "\\> That Wikipedia page has lots of great info.\n\nI never saw _single angle quotes_--U+2039 (8249) and U+203A (8250)--used in French. In German, yes, but not in French. Are there any examples one could point at? I'd be much obliged.\n\n"
    },
    {
      "time": "16 Dec 2005 — 1:19am",
      "content": "Man, this forum is so great! thanks for all the answers. for the record: the first lines say \"Your majesty, your royal highness, dear guests and honorable fellow members of parliament\". That's 3 points out of 4 for you, Grotesque.\n\nI think the problem with the quotation mark i've used, is that it's too round and comic, and i don't want people to see '66' or'99'. anyone got a tip for a ' **«**' i could use?\n\n"
    },
    {
      "time": "16 Dec 2005 — 1:57am",
      "content": "anyway, the '99' quote is the first one in norwegian.\n\n"
    },
    {
      "time": "16 Dec 2005 — 7:22am",
      "content": "please post a larger sample so we can see the character of the text. We will be better equiped to give a suggestion on the quotes.\n\nR\n\n"
    },
    {
      "time": "26 Dec 2005 — 9:04am",
      "content": "I might consider using guillemets for all the languages.  \nAnd if/where you use English quotes, consider making  \nthem what I call \"rationalist\": horizontally-flipped-99 for  \nthe opening ones, and 99 for the closing. I think that works  \nbetter for display, generally.\n\nhhp\n\n"
    }
  ]
}
