{
  "id": "16810",
  "title": "The evolution of the alphabet",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[Nifty animation documenting the evolution of the current Latin alphabet](http://web.archive.org/web/20071211191024/http:/janpeters.net/pics/stuff/alphabet.gif)\n\n_(As seen on other [blogs](http://web.archive.org/web/20071211191024/http:/www.boingboing.net/2005/12/12/alphabet_evolution_a.html) and [design-related sites](http://web.archive.org/web/20071211191024/http:/www.designobserver.com/archives/009187.html), but you may have missed it!)_\n\nI’m no historian, but I was curious about the accuracy of this thing. Can anyone verify it (or find mistakes)? If it’s correct, it could be a great teaching tool.\n\n [‹ Double-spacing after periods](http://web.archive.org/web/20071211191024/http:/typophile.com/node/3466 \"Go to previous forum topic\") [Typographic tattoos anyone? ›](http://web.archive.org/web/20071211191024/http:/typophile.com/node/16802 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071211191024/http://typophile.com/user/9720\" title=\"View user profile.\">engelhardt</a>",
  "time": "<br>",
  "uid": "9720",
  "comments": [
    {
      "time": " 15.Dec.2005 7.49am",
      "content": "The later stages, showing the moving and introduction of new letters in the Latin script, are quite good. The early Phoenician -\\> Greek -\\> Etruscan development is a bit over simplified, but no worse than one finds in most non-specialist books on the alphabet. What is missing is the range of variation in letterforms in the early Greek. And the whole notion of ’Phoenician’ is problematic, since what it really is is an ancient Canaanite alphabet that was used by lots of different semitic peoples and languages. It just happens that the Greeks got it from the Phoenicians, and this has led to the myth that the Phoenicians invented the alphabet.\n\n"
    },
    {
      "time": " 15.Dec.2005 10.30am",
      "content": "There are some other problems, too. According to this little animation, the U is a variant of the V, and not the other way around. By the same token, the I shouldn’t slide over to fill the empty slot, but rather a new slot should open for the J.\n\nAnd “Some European Additions” to describe the Eth and a handful of accented letters is really simplistic, and seems to indicate that accents are an afterthought, and with no clear date of adoption.\n\n"
    },
    {
      "time": " 15.Dec.2005 10.54am",
      "content": "[http://www.wam.umd.edu/~rfradkin/latin.html](http://web.archive.org/web/20071211191024/http:/www.wam.umd.edu/~rfradkin/latin.html \"http://www.wam.umd.edu/~rfradkin/latin.html\")\n\n[wam.umd.edu/~rfradkin/alphapage.html]\n\n"
    },
    {
      "time": " 15.Dec.2005 11.07am",
      "content": "That GIF sure gets around! It’s like the Paris Hilton of Latin Alphabet Evolution GIFs!\n\n"
    },
    {
      "time": " 15.Dec.2005 11.41am",
      "content": "It’s interesting that the 16th century spelling reformer Trissino proposed three reforms, adding characters to distinguish between u and v, i and j, and short and long o. He printed works demonstrating these reforms, including using the Greek omega for the long o. Two of these innovations were eventually universally adopted by the 17th century. And the other, well, if a butterfly had flapped its wings in Japan ... we might have an omega in the Latin alphabet today. (And no “w”?!)\n\n"
    },
    {
      "time": " 15.Dec.2005 11.54am",
      "content": "I figured it must have been simplified. I remember a few rather long, dry lectures in design school about the history of letterforms, so I had a hunch that a cute animated GIF wasn’t going to capture it all.\n\n(And _thank you_ to Alessandro for pointing to the proper origin of the piece! Professor Fradkin has several other ’evolutions’ on that page also, for those who are curious.)\n\n"
    }
  ]
}
