{
  "id": "16837",
  "title": "Best font for...",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am working on the layout for a magazine about the Montreal music scene, called The Montreal Chord. The magazine covers everything local, from new start-ups to established acts, and shows and festivals. It also has a liberal editorial line and some serious news features. The layout uses very tightly set Century Gothic for Section Names and headlines. The editorial pages have a serious black and white design, whereas the rest adds colours and vibrant pictures. The magazine really focusses on great pictures, and the clean, modern layout accentuate this.\n\nI am now trying to decide on a good font for body text... I don't know whether to use Century Gothic all the way through, or to use a different font. If I choose to go with a different one, I would be looking for something a little retro, reminiscent of the days of 8-tracks and the October Crisis. Any suggestions?\n\n",
  "author": "<a href=\"/web/20100116165149/http://typophile.com/user/10658\" title=\"View user profile.\">Giordano</a>",
  "time": "<br>",
  "uid": "10658",
  "comments": [
    {
      "time": "",
      "content": "I definitely would NOT use century gothic for body copy, but I am a big fan of legibility, and I don't consider body copy the appropiate place to get overly creative, or \"designy.\" There's plenty of opportunity to get more expressive with the headlines, subheads, pull quotes, etc... There are a lot of good serif typefaces that could work with century gothic. There should be other threads on this site that would cover magazine body copy. Sounds like a great project, good luck with it...\n\n"
    },
    {
      "time": "",
      "content": "\\>October Crisis.\n\nI hate to tell you this, but the authentic 1970 type would be Times Roman.  \nFor a more underground look, Selectric Univers, pasted galleys, and rules done by Rapidograph.\n\n"
    },
    {
      "time": "",
      "content": "Mr. Shinn, what triggered your use of \"hate\"--where can I read more about your opinions on Times Roman ?  \nMr. Black consider using ITC Novarese, nicely arrogant with the italic thought to keep roman caps.\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "",
      "content": "It's always interesting when someone wants a \"retro\" look from the 60s -- 80s as most of the target audience have no frame of presonal reference.\n\nI think you are thinking about a \"softer, nicer\" version of retro underground scene, and as Nick said, in reality were often brutally frugal on use of quality prepress material, with re-sized xerox images for paste-ups, hack & slash headlines, et al.\n\nIf you mean \"Mr. Black\" of early Rolling Stone magazine, he was hardly considered underground since he was previously art director for New York Times Sunday magazine, and a lover of historic metal typefaces.  \n(edit: my mistake, NY Times was after Rolling Stone, per his bio _\"He did a brief stint at a Texas ad agency (oddly, but importantly, he is contemptuous of commercial corporate design), went out to Los Angeles and another underground newspaper, and then to Rolling Stone, where he became one of the principal creators of the Rolling Stone look -- taking the underground mainstream.\"_)\n\n ![](http://web.archive.org/web/20100116165149im_/http:/typophile.com/files/RollingStonecover1.jpg)\n\nFor a little reference, here is a link to Wikipedia on [60s underground magazines](http://web.archive.org/web/20100116165149/http:/en.wikipedia.org/wiki/Underground_press#The_underground_press_in_the_United_States_and_Canada) from America and Canada.\n\n ![](http://web.archive.org/web/20100116165149im_/http:/typophile.com/files/TheOther1.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Thanks for your suggestions. I'd just like to clarify. I'm not necessarily looking for something \"underground\". Rather, I want something mainstream that hearkens back to that era (even if it was only recently created). Just if you had anything in mind with that general Gestalt: a little retro, and a little different, but not really obvious. I'm more looking for something that will add to the overall image, while not being particularly ostentatious. As Chris said, body text isn't the place to get overly creative.\n\nAny more suggestions?\n\n"
    },
    {
      "time": "",
      "content": "\\>what triggered your use of “hate”\n\nIt's a figure of speech. Meaning, \"I don't want to disappoint you, but...\"\n\nThe retro genre relies on \"false\" or mythical cultural memories, so what today evokes a past era may in fact have nothing to do with that era, or, as in the case of Times, not be exclusively specific to that era.\n\n"
    },
    {
      "time": "",
      "content": "Well, here are a couple of contemporary typeface families designed by Montrealers:\n\n[http://vllg.com/Thirstype/Oz/mudTyper+Weights/](http://web.archive.org/web/20100116165149/http:/vllg.com/Thirstype/Oz/mudTyper+Weights/ \"http://vllg.com/Thirstype/Oz/mudTyper+Weights/\")\n\n[http://vllg.com/Village/GalaxiePolaris/mudTyper+Weights/](http://web.archive.org/web/20100116165149/http:/vllg.com/Village/GalaxiePolaris/mudTyper+Weights/ \"http://vllg.com/Village/GalaxiePolaris/mudTyper+Weights/\")\n\n"
    },
    {
      "time": "",
      "content": "\\>The retro genre relies on “false” or mythical cultural memories, so what today evokes a past era may in fact have nothing to do with that era, or, as in the case of Times, not be exclusively specific to that era.\n\nExactly. Any ideas?\n\nChester, thanks for those suggestions. I like them both very much.\n\n"
    },
    {
      "time": "",
      "content": "From #2 AG, 1968\n\n ![](http://web.archive.org/web/20100116165149im_/http:/typophile.com/files/AG.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Wow! What great calligraphy! You don't see that in magazines anymore.\n\nIt even fits the theme… they use this used-to-often-by-religion-in-the-anglo-american-sector simplified style of blackletter because it talks metaphorically about crucifixion, etc…\n\n"
    },
    {
      "time": "",
      "content": "The next spead has a crucifiction illustration by Robert Ziering. Not the sort of type you would expect from a pub like Avant Garde. This same issue features a set of Day-Glo serigraphs ”The Marilyn Monroe Trip by Bert Stern”, just to add some context.\n\nI’ve never found an attribution for the type, though I’m sure it is known.\n\n"
    },
    {
      "time": "",
      "content": "Thanks Giordano. The two families I suggested were designed with history in mind.\n\nOz is an hommage to and reflection of the work of Oz Cooper; channeling Cooper Black (and the rest of the Cooper family) in a contemporary way, and \"constructed\" as we are able to do with digital technology.\n\nPolaris is an unabashed capital-M Modernist family in the mould of Helvetica, Univers, and Akzidenz Grotesk which inspired those types.\n\nSome of the lesser priests of Modernism descended upon Montreal from Switzerland and Germany in the run-up to the 1976 Olympics, meanwhile Oz Cooper's work has always appealed to Montrealers, with our love-hate relationship with American corporations and popular communications. We embraced internationalism and the International Style, but couldn't help ourselves from mixing it up with some sweaty funky expressionism.\n\n"
    },
    {
      "time": "",
      "content": "\"Some of the lesser priests of Modernism descended upon Montreal from Switzerland and Germany in the run-up to the 1976 Olympics,\"\n\nThere was another migration there during the Expo 10 years earlier.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\>Exactly. Any ideas?\n\nFor something that would be a 1970 authentic Canadian magazine text face, but not a type that is still widely used, I would recommend Bookman. It has a heft that would hold its own against the Century Gothic, and they are a good match history and style-wise. As a Linotype face, it has the period-but-modern feature of equal-width roman and italic. It also had some cachet as a display face at that time, especially the Italic with swash.\n\nOf my own faces, I would recommend [Worldwide,](http://web.archive.org/web/20100116165149/http:/www.myfonts.com/fonts/shinn/worldwide) a Century revival, with the large x-height coming into vogue in the early '70s.\n\n"
    },
    {
      "time": "",
      "content": "One font that isn't at all historically relevant is Century Gothic. I mean, it's a knockoff of one typeface (Futura) adapted to fit the metrics of another (Avant Garde). I don't think Century Gothic existed until the early 90s.\n\nOh, and the thought of setting Century Gothic extra tightly is a bit disturbing. I mean, first use Century Gothic, and then set it tightly!? Did the person who came up with that have a personal grudge against legibility or something? Did legibility kill their parents and leave them an orphan? It must have been something pretty intense to go that far in revenge.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Drop the goth and go Cheltenham!\n\n"
    },
    {
      "time": "",
      "content": "Mr. Shinn, I thought so indeed, what triggered your use of “I don’t want to disappoint you”—why he could be disappointed ? Where can I read more about your opinions on Times Roman ?\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "",
      "content": "\\>Where can I read more about your opinions on Times Roman ?\n\nThis is from an article I wrote, \"The Perfect Set\".\n\n ![](http://web.archive.org/web/20100116165149im_/http:/typophile.com/files/Times.jpg)\n\n"
    },
    {
      "time": "",
      "content": "\\>what triggered your use of “I don’t want to disappoint you”—why he could be disappointed ?\n\nHe might be disappointed if he expected something more \"retro\" and/or exotic than the ubiquitous Times.\n\n"
    },
    {
      "time": "",
      "content": "Thanks again for all your suggestions, everyone. Nick, I really like Worldwide, and I will seriously consider it.\n\n“One font that ... early 90s.\n\n“Oh, and the thought of setting ... revenge.”\n\nI'm not looking for \"historically relevant\". Historical relevance is relevant to the past, not the present (thus the name...), and the magazine is not for consumption in 1972 but 2006. I only want to recall this city's glory days, which has nothing to do with being true to them. The point is to re-examine the past, not re-create it.\n\nAs for legibility, who cares? It's a magazine, not a textbook. There is always a tradeoff between style and legibility, and as I mentioned in my original post, the image sought is stylish and graphic (therefore treating headlines as graphics rather than words makes sense).\n\n\"Some of the lesser priests of Modernism descended upon Montreal from Switzerland and Germany in the run-up to the 1976 Olympics,\"  \n\"There was another migration there during the Expo 10 years earlier.\"\n\nThat would explain why every single public sign is set in Helvetica (I'm serious—every single one).\n\nEDIT: When I said \"... to recall the city's glory days\", I actually meant to recall the most dramatic and interesting (culturally and politically) period in the city's history. The Glory Days (the 60s) were pretty Toronto-esque (i.e. cookie-cutter North American city, not to offend any uptight white-bread vieille-souche anglo-saxon loyalists :P)\n\n"
    },
    {
      "time": "",
      "content": "\\>One font that isn’t at all historically relevant is Century Gothic.\n\nHeadliners International (the typositor foundry), who prefaced all their font names with \"neo\", did small x-height versions of most classic faces, including \"Neo Mini Futura\".\n\nI would also expect there to be big x-height \"Futuras\" from other photo-lettering foundries, going back to the 1960s.\n\nBut you're right Thomas, it's not a very classy face; however, that may be its appeal here.  \nSimilarly for the tight headline setting, I'd have to see it in context to form an opinion.\n\n"
    },
    {
      "time": "",
      "content": "Which tool would they have used to create the calligraphy on the page showed above? A brush?\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "It could be a reed or bamboo but is probably a brush.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Just in case anyone is interested, in the end I'm going with Cartier Book, by Monotype, based on lettering created by Carl Dair for the 1969 Montreal Trade Fair and as a \"truly Canadian typeface\" to mark the centenary of Canadian Confederation. You can see it here:\n\n[http://www.fonts.com/findfonts/detail.htm?pid=261337&grab\\_id=0&page\\_id=5...](http://web.archive.org/web/20100116165149/http:/www.fonts.com/findfonts/detail.htm?pid=261337&grab_id=0&page_id=5813&query=cartier%20book \"http://www.fonts.com/findfonts/detail.htm?pid=261337&grab\\_id=0&page\\_id=5813&query=cartier%20book\")\n\n"
    },
    {
      "time": "",
      "content": "Of course. Good choice.\n\n"
    },
    {
      "time": "",
      "content": "The similarity between [Cartier](http://web.archive.org/web/20100116165149/http:/www.myfonts.com/fonts/agfa/cartier-book/regular/) and Enschede's [Collis](http://web.archive.org/web/20100116165149/http:/www.teff.nl/fonts/collis/collis.html) is outstanding, fortunately prices are quite different.\n\nThis could be a nice substitute, altough maybe the overall quality will not be the same, the face looks promising, Giordano, please show us some layouts with the face when you have some.\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "Well Hector, while I'm much too patriotic to admit that that over-priced eurotrash is nicer than the \"first\" Canadian typeface, I will say, and this is <cite>completely</cite> off the record, that that <cite>is</cite> a lovely ampersand...\n\n"
    },
    {
      "time": "",
      "content": "Hooray for Cartier and Carl Dair. Good choice Giordano. Good on you for the CanCon.\n\n"
    }
  ]
}
