{
  "id": "16830",
  "title": "PhD Thesis Typography in LaTeX",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "I'm currently writing up my PhD thesis in LaTeX, and I'm trying to get away from the almost clichéd, boring academic look that always makes my eyes glaze over; I've tried to develop an interesting style for the layout. I'd like to know if you think that the overall style works or if there are any aspects that could be improved:\n\n[Click for PDF extract (ignore the half-written content!)](http://web.archive.org/web/20111216182145/http:/www.cis.strath.ac.uk/~jg/extr.pdf)\n\nThanks\n\n",
  "author": "<a href=\"/web/20111216182145/http://typophile.com/user/10440\" title=\"View user profile.\">Entirety</a>",
  "time": "<br>",
  "uid": "10440",
  "comments": [
    {
      "time": "",
      "content": "You used LaTeX?\n\nif you have the time, try ConTeXt ( [http://www.pragma-ade.com/](http://web.archive.org/web/20111216182145/http:/www.pragma-ade.com/ \"http://www.pragma-ade.com/\"))\n\nedit:  \nIt is easier to create an entirely \"new\" layout with ConTeXt with simple commands, as opposed using billions of LaTeX packages or confusing LaTeX parameters, to achive the same effect\n\n"
    },
    {
      "time": "",
      "content": "The header is slightly messy with a few packages, but there's not a great deal going on. The only confusing LaTeX parameter is one that I found that puts the section numbers in the margin.\n\nThank you for the suggestion. ConTeXt does looks interesting, but I think that I've spent too long customising my document for LaTeX to want to do a u-turn now on the style I've created. Maybe for future work though.\n\n"
    },
    {
      "time": "",
      "content": "Overall, I think your layout is good, nice and clean. I would probably move the page numbers down to the lower right hand corner (for right hand pages, left corner for left pages), or maybe put them up above, with the page title? That would give you a bit more room at the bottom of the page. I think some \"fresher\" type choices would help a lot. Are you using Futura and Times? I did notice that the Futura you used is not a true small caps (don't know if there's a Futura that has true small caps...) So, that is one thing that looks odd to me, because the \"small cap\" characters are thinner. I think there are a number of other people that have asked for type suggestions for their thesis, just do a search and you'll find some good options...\n\n"
    },
    {
      "time": "",
      "content": "Thanks for showing, I have time for saying I would use all caps (or SC) in the same size for \"XECUTING A PLAN\", or just the first word \"XECUTING\" then lc.  \nYou could also check Redlers.com.\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "",
      "content": "One of the problems is the very specific guidelines that are laid down for the layout. There must be a 40mm margin at the bottom of the page, so that space looks very odd if the page number isn't there. I've tried moving the page number to the bottom-right, but I feel that it looks unbalanced - pages must be printed right-side only, and there are no left pages to balance it out.\n\nIt's actually Avante Garde Demi, not Futura. You're right though, the small caps do look a bit odd now you mention it. I'll try to either find a typeface with true small caps or use normal text. Getting typefaces (other than the default) to work in LaTeX is not an easy task though, hence the use of Times (as opposed to Computer Modern). If you do happen to have any suggestions for typefaces for body text in a technical document then let me know.\n\n"
    },
    {
      "time": "",
      "content": "I've made some changes because of the recommendations and have a new revision. I've changed from Times to Charter, and I think it's an improvement:\n\n[2nd revision PDF](http://web.archive.org/web/20111216182145/http:/www.cis.strath.ac.uk/~jg/extr2.pdf)\n\n"
    },
    {
      "time": "",
      "content": "I like Charter better. I wouldn't do italic and all caps (up top). I would do either or, unless it's mandated. I think once you change the Avanted Garde to something will true small caps you'll be looking much better.\n\n"
    },
    {
      "time": "",
      "content": "There lies much work in customizing a LaTeX document to that extent. One question, though: Why are the headers so far to the right – why not stick to the margin of the main text? Perhaps they would also look clearer if they wouldn't be using CAPS. I think the fancyhdr package or something similar offers options for that.  \nRegarding the page number issue: an empty page on the left side when the thesis is printed and bound may also balance a non-centered pagemark.  \nThe overall appearance is clear and much better than average layouts for academic stuff I have seen so far. Good luck!\n\n"
    },
    {
      "time": "",
      "content": "Thank you for all the very helpful suggestions. Definitely worth a mention in the acknowledgements section.\n\n**Header**\n\n- I have no ides why it was so far to the right, but I've corrected it. Well spotted...\n- I've changed it to normal caps (all caps and italic is default). I agree entirely about it not looking too clear as it was, and I feel that the new revision is better.\n\n**Headings**\n\n- I'm blown if I can figure out how to get LaTeX to use proper small caps. I've got a proper small caps TTF file here, but can't figure out how to convert it, even using online tutorials. I think I'm happy with the current version though.\n\n**Page Number**\n\n- I shall have to experiment with this to see what works best. It's difficult to visualise it bound when I don't even posess a hardcopy yet.\n\n[Latest Revision, Version 3](http://web.archive.org/web/20111216182145/http:/www.cis.strath.ac.uk/~jg/extr3.pdf) (PDF)\n\nJonathan\n\n"
    },
    {
      "time": "",
      "content": "[http://tug.ctan.org/tex-archive/fonts/fpl/](http://web.archive.org/web/20111216182145/http:/tug.ctan.org/tex-archive/fonts/fpl/ \"http://tug.ctan.org/tex-archive/fonts/fpl/\")\n\n"
    },
    {
      "time": "",
      "content": "_I’m blown if I can figure out how to get LaTeX to use proper small caps._\n\nIf you can get a copy of Alan Hoenig's book _TeX Unbound_ from the library, take a look at section 7.8.4. It's pretty easy to do, once you've figured out how to!\n\n(If you're fortunate enough to be using a Mac, [XeTeX](http://web.archive.org/web/20111216182145/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&id=xetex) makes it delightfully easy to use ordinary fonts.)\n\n"
    },
    {
      "time": "",
      "content": "To start a new paragraph, you have both extra space and indentation. You should probably pick one or the other.\n\nGenerally, for typography in a thesis, it's a heck of a lot better than the usual. Nice work.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Alessandro, I took a look at URW Palladio after your suggestion but I was really looking for a sans-serif typeface. Thanks for the link though, useful information if I change my mind.\n\nThank you Thomas for the tip about the paragraphs - I will experiment and see what works best. Also glad to hear that I'm doing something right. Now to get the content finished! 100,000 words is never easy...\n\nBest wishes,\n\nJonathan\n\n"
    },
    {
      "time": "",
      "content": "Still better! Converting and preparing fonts for use with LaTeX is not the easiest thing to do, although you could use fontinst from the command line (depending on your TeX distribution). The crucial point in using correct small caps are the .map and .fd files for the fonts you are using. But the Avantgarde Demi that is published with teTeX does not have proper small caps (see adobe.map somewhere in your TeX tree). So probably it's best to stick to the current status.  \nOne thing that I personally would reconsider is using a line under the header. Perhaps it would be enough to have the Header typeset in a different font style and size than the main text. Do you need the rule? Using the fancyhdr package that would be: `\\pagestyle{fancy}\n\\renewcommand{\\headrulewidth}{0pt}`  \nAd hardcopy: Take a printout of your sample pages and stick it into a similar PhD thesis from the next university library to get an impression! ;)  \nGood luck!\n\n"
    },
    {
      "time": "",
      "content": "Yes, I've now come to hate LaTeX and installing fonts. It really does not seem the most intuitive thing for LaTeX non-experts like me. I have tried several guides on how to convert a TTF file to use in LaTeX, but I get halfway through and then something doesn't work, or a file is not created or something else. It seems that many of the guides (and the tools) were written many years ago, and are no longer applicable. Another factor is that I don't have write access to the systemwide TeX tree (and haven't really got the time to figure out how to do a custom one and adapt the guides to install into it). I would probably go mad if I were to persue it further... Suffice it to say that I'm actually growing more fond of it in normal caps now.\n\nI'll experiment and try it without the header rule. I actually added it because I preferred it with an older version that I had - Maybe things have changed now though after all the helpful advice I've received.\n\nThanks,\n\nJonathan\n\n"
    },
    {
      "time": "",
      "content": "I have made some further adjustments (taking into account all of your suggestions) and also centered the chapter title while I was at it. I think that this way it flows nicely into the quotation beneath:  \n [Revision 4 (Chapter 4 extract)](http://web.archive.org/web/20111216182145/http:/www.cis.strath.ac.uk/~jg/extr4.pdf)  \n [Revision 4 (Chapter 6 extract)](http://web.archive.org/web/20111216182145/http:/www.cis.strath.ac.uk/~jg/extr4b.pdf)\n\nAnd if you are interested, a comparison to see how far it's come from the defaults of LaTeX:  \n [Revision 0.1 (Chapter 6 extract)](http://web.archive.org/web/20111216182145/http:/www.cis.strath.ac.uk/~jg/extr-old.pdf)\n\nI'm still not sure about omitting the header underline, but I am by no means an expert in typography. In fact, the header is not required at all for the thesis, but I added it because it the page looked very plain in v0.1.\n\nJonathan\n\n"
    },
    {
      "time": "",
      "content": "Nice!  \nSpeaking aside: That is exactly what LaTeX has been made for - as the software handles everything for you typographically, you can really concentrate on the content and don't have to worry about anything else! ;)\n\n"
    },
    {
      "time": "",
      "content": "I'm now coming to the end of my thesis writeup and I thought I'd give you an update on how the design is coming along. It's evolved a lot in the past few months, hopefully for the better. The latest version can be seen below:\n\n- [Revision 5](http://web.archive.org/web/20111216182145/http:/www.cis.strath.ac.uk/~jg/thesis/extract-chapter6-tp.pdf)\n- [Table of Contents](http://web.archive.org/web/20111216182145/http:/www.cis.strath.ac.uk/~jg/thesis/toc-tp.pdf)\n\nI've given up on trying to get a new typeface for the headings. I had planned on using [Humanist 521](http://web.archive.org/web/20111216182145/http:/www.myfonts.com/fonts/bitstream/humanist-521/) in LaTeX, but I spent about 15 hours in total trying to get it to work and just could not do it. I've read so many guides and tried so many scripts and have not found a method that works.\n\nIf there are any comments on these new revisions then I'd be very interested in hearing them. The generous help I've had so far has been superb, and definitely deserves a mention in the acknowledgements section of my thesis.\n\nOnce again, many thanks for your help,\n\nJonathan\n\n"
    },
    {
      "time": "",
      "content": "I think you're pretty much there. The only comment I have concerns your figures; specifically, the text on the figures. I'm not certain how they were created, but it appears that they may have been scaled to different degrees. For example, the caption \"occurrences\" in figure 6.2 is significantly smaller than the fonts in figure 6.4.\n\nFrom examining your pdf file, it looks like you're usiing a DVI-\\> PS-\\> PDF workflow, so I'll guess you're using .eps files for the figures. You might want to check out the PSfrag package, which allows you to easily replace the text in your figures with LaTeX-generated text. It's an easy way to make the fonts in the figures consistent with each other. You can find PSfrag [here](http://web.archive.org/web/20111216182145/http:/www.ctan.org/tex-archive/macros/latex/contrib/psfrag).\n\nSteven\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the comments Steven. I see what you mean about the text sizes in the figures. It's not easy though as the EPS files have had the text converted to curves; it would mean re-saving all of the figures with text included and then replacing them using PSFrag as you suggest -- all of which would take quite a while as there are about 60 figures in total. I haven't quite got the sizes of the figures finalised yet anyway, but I will at least try to make them at a little more consistent when I go for the final version.\n\nJonathan\n\n"
    },
    {
      "time": "",
      "content": "Well done, it looks great. The greyish large chapter numbers in the TOC fit well with the italics of the chapters, and the line is a good solution to separate the italics and regular text there.\n\n"
    }
  ]
}
