{
  "id": "16849",
  "title": "Music Venue",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi!\n\nI’m a design student and as a school assignment I have to create a logo for a music venue.  \nI am very new to logodesign, so I hope someone in here can help me with some usefull critique.\n\n[View logos version 0](http://web.archive.org/web/20080316200941/http:/www.visual-astma.dk/blam.gif)\n\nKind Regards  \nMorten\n\n [‹ Deejay logo](http://web.archive.org/web/20080316200941/http:/www.typophile.com/node/16159 \"Go to previous forum topic\") [The beginnings of a design for a swanky resturant ›](http://web.archive.org/web/20080316200941/http:/www.typophile.com/node/16639 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080316200941/http://www.typophile.com/user/10666\" title=\"View user profile.\">mr.morton</a>",
  "time": "<br>",
  "uid": "10666",
  "comments": [
    {
      "time": " 17.Dec.2005 4.23am",
      "content": "I’d say: round the edges\n\n"
    },
    {
      "time": " 17.Dec.2005 5.55am",
      "content": "This is a nice use/creation of blank space, however, it seems to me that the sound seems to be coming out of the character rather than going to, partly because there is only one set of waves.  \nIt is always worth considering possible uses a logo might be put to, for example, a music venue might have clothing and other merchandise alongside the main purpose of promoting the venue on posters, flyers and online – and when used on some items it will have to work with band/record label/sponsors logos/images, to do this it will need a strong presence, and be easy to pick out. To that end it is best to create a logo that works in one colour first and then develop it.  \nTim\n\n"
    },
    {
      "time": " 17.Dec.2005 6.19am",
      "content": "Timd, Excellent point i will work on it in one color, and when i am satisfied with the form in one color I will experiment with colours.\n\nwill be playing around with round corners in black.\n\n:-)\n\n"
    },
    {
      "time": " 17.Dec.2005 9.38am",
      "content": "Ok, i made a simpler sound wave thing and made er version with round corners. But i still not satisfied with the logo, something is just wrong, can’t say what is wrong with it though.\n\n[Anyway here are version 0.3](http://web.archive.org/web/20080316200941/http:/www.visual-astma.dk/blam2.gif)\n\n"
    },
    {
      "time": " 18.Dec.2005 2.44am",
      "content": "The A is weak and comes out of nowhere compared to the other characters. It has no balance. You’d be better off just using an A from the font and making a symbol that goes with the type and could stand alone as a symbol. This is forced. Get away from the computer grab a marker and some paper and scribble. Then put the scribbles down go for a long walk come back and scribble again. Repeat this program until you get something that works.\n\n"
    },
    {
      "time": " 18.Dec.2005 6.00pm",
      "content": "hey there mr.m. i’d concur with dan. the A to me is a bit clunky. something about the height of the horizontals maybe? and the weight of the diagonal? mmmmm. p’haps it’s the way the A mirrors the N on either side of the E, but not quite? I like the little speaker waves idea, but don’t be afraid to drop it for a while and work on other ideas. The A looks like a radio transmitter which is cool, but it’s a music venue, not a station right?  \np.s. what sort of music venue?\n\n"
    },
    {
      "time": " 23.Dec.2005 8.06am",
      "content": "Hi...\n\nOki, so i been working on the logo and just to get away my previous idea/style. I agree with you the A was just not working and the soundwaves is just too much like radiowaves.  \nSo I killed my darling and have been doodling away, and suddenly this came through (maybe just a new darling waiting to get killed).\n\n[result](http://web.archive.org/web/20080316200941/http:/www.visual-astma.dk/blam4.gif)  \ni made an example of how it could be used on a  \n [cover for a program](http://web.archive.org/web/20080316200941/http:/www.visual-astma.dk/cover.pdf)\n\nI kinda like it, but is it too woodstock/70’s. I want to make a modern/neutral logo now I am just confused! :-)\n\nBy the way the place mainly plays mainstream rock, pop and folk.\n\nAny comments anyone?\n\nOh and if there is any doubts about what the name is, it is: Skråen\n\n"
    },
    {
      "time": " 23.Dec.2005 8.13am",
      "content": "What are the ’r’ and ’o’ doing in there if it’s not part of the name? I had no idea what it said till I went back to your original logo to only find that two of the letters weren’t even supposed to be read?\n\n"
    },
    {
      "time": " 23.Dec.2005 9.06am",
      "content": "Morten, I think this has character and presence. It has the required difference to stand in competition with other logos. The s and e look tilted which I feel is unecessary if that is the case. For the purposes of use and cleanliness the outline needs some work to remove some of the nicks and small bumps which are a) not going to reproduce at small size use and b) detract from the overall shape.\n\nDavid, I’m afraid you have misread the original logo for the r and the o is a diacritic å frequently used in scandanavian languages.\n\nTim\n\n"
    },
    {
      "time": " 23.Dec.2005 9.12am",
      "content": "Ah, I see it now. I’m not familiar with many foreign language marks, sorry for the mis-read. Nix my entire comment.\n\n"
    },
    {
      "time": " 26.Dec.2005 8.39am",
      "content": "oki, so I cleaned the outline alittle and tweaked the s and the e.\n\n[The cleaner version](http://web.archive.org/web/20080316200941/http:/www.visual-astma.dk/blam5.gif)\n\nHappy hollydays....\n\nKind regards  \nMorten\n\n"
    },
    {
      "time": " 26.Dec.2005 1.31pm",
      "content": "I like this. I suggest moving the ring to the left a bit so that it’s balanced on the a.\n\n"
    },
    {
      "time": " 27.Dec.2005 8.38am",
      "content": "Ohhh - I uploaded a wrong version!\n\n[The cleaner right version](http://web.archive.org/web/20080316200941/http:/www.visual-astma.dk/blam5.gif)\n\n"
    },
    {
      "time": " 27.Dec.2005 9.29am",
      "content": "Very nice indeed, when set against the dark background it pops out beautifully. I would follow cerulean’s advice however I would move the a, e & n ever so slightly to the right instead so as not to upset the r that’s resting on top of the k’s serif.\n\n-mmilo\n\n"
    },
    {
      "time": " 27.Dec.2005 11.20am",
      "content": "mmilo - I think you are right!!\n\n[The almost final version](http://web.archive.org/web/20080316200941/http:/www.visual-astma.dk/blam6.gif)\n\nI will now take a break from the logo and contrate on the other design related to the identity.\n\nComments are of cause very welcome - and i want to thank everyone who helped me.\n\nMorten\n\n"
    },
    {
      "time": " 27.Dec.2005 1.10pm",
      "content": "Its a very pretty graphic but I hope you don’t think anyone can read it. Maybe it doesn’t have to be read, just recognized, like a white person striding for go, and a red hand for stop when crossing an avenue.\n\n"
    },
    {
      "time": " 30.Dec.2005 2.25am",
      "content": "I prefer the top one, because it is a simpler form it works better for me, the extra white keyline is too much. I think that you will have to amend the keyline that enters the lower open counter of the s and the spaces between the sk and kr for the smaller use at least. I would also look at a simpler line at the bottom, probably only deviating from horizontal in the a.  \nTim\n\n"
    }
  ]
}
