{
  "id": "16854",
  "title": "Mac Type 1 fonts to Windows True Type",
  "forum": "Build",
  "tags": [

  ],
  "content": "I’m not sure if this topic has been addressed already and I apologize if it’s a repeat issue, but I am currently working for a textbook publisher who’s now working a paperless workflow. We are currently using InDesign/InCopy on a server-based client with files generated outside the company (our studio) in InDesign using Mac Type 1 fonts. Our PDFs are generated through a PC server that we cannot change to an X-Serve at the moment. We have converted the fonts using TransType Pro 3.0.2 to Windows True Type as well Windows Open Type in hopes to find a medium for the cross-platforms to see the fonts in the files. Currently, when a file is opened on a Windows machine, it states the fonts are missing. Is there a way to have InDesign PC recognize the TTF or OTF versions of the Mac Type 1 fonts in the file?\n\nAny and all insight you can provide is greatly appreciated.\n\n~Saritza\n\n [‹ 12 products in 12 months of 2005: FontLab Studio 5 for Mac OS X released](http://web.archive.org/web/20071121102028/http:/www.typophile.com/node/16766 \"Go to previous forum topic\") [AFM support for Multibyte characters. ›](http://web.archive.org/web/20071121102028/http:/www.typophile.com/node/16657 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071121102028/http://www.typophile.com/user/10175\" title=\"View user profile.\">saritza.hernandez</a>",
  "time": "<br>",
  "uid": "10175",
  "comments": [
    {
      "time": " 17.Dec.2005 1.27pm",
      "content": "I believe not. (But I might be wrong)  \nAlthough the fonts will have the same name — considering the convertion between formats was successful —, InDesign flags the difference in font formats (see image below).\n\n ![](http://web.archive.org/web/20071121102028im_/http:/www.typophile.com/files/indy_fonts.png)\n\n"
    },
    {
      "time": " 17.Dec.2005 2.20pm",
      "content": "That’s what I feared. If the PC user selects to change the font to it’s PC format then saves it. Will the Mac user that picks up the file in the next step have to change the format again and so on?\n\n~Saritza\n\n"
    },
    {
      "time": " 17.Dec.2005 4.03pm",
      "content": "Saritza:\n\nWhen I wrote ’font formats’ I was referring to the trio: TrueType, Type1 and OpenType.  \nNotice that I didn’t make any remarks to PC or Mac (although the font files might not be interchangeable between both platforms, in some cases).\n\nSo, what I would suggest is: decide which font format you want/can use (TT, T1 or OT), and then generate the font files, in that format, for both platforms.\n\nI believe that, once you have the same font (same format, but not necessarily the same files) installed in both platforms, PC and Mac, InDesign will not alert that the fonts are missing.\n\nNotes:  \n1. If you decide to go OT, the same files can be used in both platforms.  \n2. If you decide to go TT, you just need to generate the files for the PC (extension .ttf). These can then be used on the Mac (only OS X).  \n3. If you decide to go T1, that’s probably not the best choice, as the format has been phased out » [Read about it](http://web.archive.org/web/20071121102028/http:/blogs.adobe.com/typblography/2005/10/phasing_out_typ.html)\n\nMiguel\n\n"
    },
    {
      "time": " 17.Dec.2005 9.25pm",
      "content": "I have had success opening the same InDesign file on both Mac and Windows machines when using the same CFF-flavoured OpenType font on both computers.\n\n"
    }
  ]
}
