{
  "id": "16856",
  "title": "Understanding BezierMaster",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi,\n\nIn BezierMaster, what is the purpose of the two red double-squared boxes in the Character Edit Window? I notice that their size is apparently fixed, even if one scales the actual glyph. If the answer to this is in the documentation, I apologize for missing it-)\n\nRelated question: Is there any word on when DTL FM 2.5 will be released? The website says Summer 2005 which just \\_cannot\\_ be right-)\n\nI'm still trying to understand what makes DTL FM so special (and expensive) compared to Studio5. What am I not getting?\n\nThnx for your patience with all my \"green\" questions!\n\nBest  \nIdris\n\n",
  "author": "ishamid",
  "time": "17 Dec 2005 — 3:03pm",
  "uid": "10590",
  "comments": [
    {
      "time": "17 Dec 2005 — 3:53pm",
      "content": "Try to search the forum for FontMaster  \n [http://typophile.com/node/10476](http://web.archive.org/web/20131026012222/http:/typophile.com/node/10476 \"http://typophile.com/node/10476\")\n\nIf you follow Mr. Bloklands track, you will find his posts mostly FontMaster & DTL related.\n\n[http://typophile.com/user/1688/track](http://web.archive.org/web/20131026012222/http:/typophile.com/user/1688/track \"http://typophile.com/user/1688/track\")\n\n-- [astype.de](http://web.archive.org/web/20131026012222/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "22 Dec 2005 — 3:57am",
      "content": "The LSB/RSB boxes in the Character Edit windows of DTL Bezier- and IkarusMaster just indicate the character width and are an alternative (coming from the Ikarus system) for the LSB/RSB lines, which in current versions of DTL Bezier- and IkarusMaster also can be found in the Config menu. In the new 2.5 edition of DTL FontMaster, which was originally scheduled for summer 2005 and which will probably now be released February 2006 (yes, it takes always more time than expected), the content of the Config. menu has been enhanced and moved to ‘Preferences…’, where everybody expects it to be.\n\nEspecially the Bezier and Ikarus editors have been enhanced a lot in version 2.5 of FM. The interface has been improved, including new icons. The drawing capabilities of the editors can’t be much better than they are now. Also fonts can now directly be imported and subsequently exported in all current font formats, without the need of DataMaster.\n\nWhat makes FM so special, is the way it handles glyph, naming and metrics information and above all the powerful batch support for font production. The latter makes it for instance possible to easily exchange data between glyph databases, and to check and generate fonts in batch with a highly professional and very controllable and reliable output. Generating full featured OpenType fonts can’t be made much easier than it is in FM, because of the interaction between the Character Layout files and the Features files. For the Features files the Adobe syntax is fully used and more experienced users can easily create, edit and enhance Features files.\n\nDTL Contour- and DataMaster are batch programs. The same functionality, but now only applicable for a single BE or IK glyph database at the time, has now been built in DTL Bezier- and IkarusMaster. The price of the editors will not be changed, so for less than Euro 400,- these powerful programs will become quite affordable. The same functionality can by the way be found in the new and free Lite editions of both editors, with exception of the possibility to generate TrueType and OpenType fonts and a limited support (up to 256 glyphs maximum instead of the current 65000) of BE and IK databases.\n\nVersion 2.5 of DTL FontMaster will be the last one available for Mac OS 9 / Classic besides, of course, the Window version. Edition 3.0 is targeted for Mac OS X and Windows. Probably there will some kind of an update program for the OS 9 users.\n\n"
    }
  ]
}
