{
  "id": "16850",
  "title": "Drive Failing --\\> Can't Copy Files",
  "forum": "Build",
  "tags": [

  ],
  "content": "Dear Friends,\n\nI know this is the OS X forums, but I trust you with most things so I thought I’d ask about my most recent catastrophe.\n\nI won’t go into the nasty details, but at this point in time I find myself unable to copy files from my second internal drive. I’ve tried Apple’s Disk Utility and it won’t perform the repair. I’ve tried starting up from DiskWarrior and it won’t run either — DW stops when it is on step 5 (directory). I’m going to go back to the office and try running Disk Utility from the TIger startup CD later.\n\nI was talking to a friend last night who said it is likely the main area — don’t recall what he called it — has been damaged. He loaned me an external drive to try and copy to it.\n\nIf the drive ist kaputt, I am kaputt. Why are lessons learned only after you have to learn them? If I can get the files that is my worry. I will buy another drive if this one is beyond repair. All projects, fonts and itunes are on this drive. Boy. I’m scared. Suggestions?\n\n [‹ How to lighten the weight of a hand lettered typeface?](http://web.archive.org/web/20080608074858/http:/typophile.com/node/16909 \"Go to previous forum topic\") [FontLab Studio 5 - multiple layers - how to ›](http://web.archive.org/web/20080608074858/http:/typophile.com/node/16902 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080608074858/http://typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": "<br>",
  "uid": "108",
  "comments": [
    {
      "time": " 17.Dec.2005 7.15am",
      "content": "I don’t have any particular insight as to what is happening with your drive, but I would recommend you go to the Discussions section in Apple’s support pages:\n\n[http://discussions.apple.com/index.jspa](http://web.archive.org/web/20080608074858/http:/discussions.apple.com/index.jspa \"http://discussions.apple.com/index.jspa\")\n\nI’m not sure which topic area would be most appropriate in your case, but I’ve had good luck there. It has replaced MacFixit as my resource of first resort when I have Mac troubles.\n\n(I had a drive completely fail last summer. Luckily, it was mostly used for sporadic backups, but it was a wake-up call for me. I now have an automatic system in place that backs up my most-used drives daily, archives weekly. Word to the wise.)\n\n"
    },
    {
      "time": " 17.Dec.2005 7.20am",
      "content": "Thanks, Mark. I’m actually digging around there as well.\n\n"
    },
    {
      "time": " 17.Dec.2005 7.40am",
      "content": "Tiff,  \nWhat a dreadful Christmas dilemma!  \nI have had good luck with DiskWarrior in the past. If this fails, there are places that can often recover data from a failed drive. Do you live near an Apple store? My daughter had her kaput drive data salvaged by an Apple tech. There are other places besides Apple that do the same. If you can remove your drive and bring/ship it to one of them they may be your salvation.\n\nBest of luck to you,\n\nChrisL\n\n[http://www.alsoft.com/DiskWarrior/](http://web.archive.org/web/20080608074858/http:/www.alsoft.com/DiskWarrior/ \"http://www.alsoft.com/DiskWarrior/\")\n\n"
    },
    {
      "time": " 17.Dec.2005 9.05am",
      "content": "[http://www.typotheque.com/site/tshirt.php?id=17](http://web.archive.org/web/20080608074858/http:/www.typotheque.com/site/tshirt.php?id=17 \"http://www.typotheque.com/site/tshirt.php?id=17\")\n\n"
    },
    {
      "time": " 17.Dec.2005 9.23am",
      "content": "\\> I’ve tried Apple’s Disk Utility and it won’t perform the repair.\n\nRepair vs. Verify : try first the verify option - check for and report problem. Very important: you don’t want always to fix the problems, since by doing so may cause more problems!!!\n\n\\> I’ve tried starting up from DiskWarrior and it won’t run either — DW stops when it is on step 5 (directory).\n\nusually when DW stops on step 5 there’s a little message : “speed inhibited by disk malfunction” - did you see that?\n\nthere’s no doubt that you have corrupted file(s). the directory is the main component that First Aid checks; and the directory contains the info where every file is located.\n\n"
    },
    {
      "time": " 17.Dec.2005 10.29am",
      "content": "Yes, David, I saw “speed inhibited by disk malfunction”.\n\nI verified first and received:\n\n ![](http://web.archive.org/web/20080608074858im_/http:/typophile.com/files/Verify.png)\n\nSo. Being stupid, I’m guessing, I repaired:\n\n ![](http://web.archive.org/web/20080608074858im_/http:/typophile.com/files/Repair.png)\n\nI am waiting for someone to come into the office to help me put my drives back into their original box. I’m assuming, now anyway, that this is the problem as it is when the problems started. I had no idea that I couldn’t do this and now will do two of the following:\n\n1. Never just move drives from computer to computer.  \n2. Purchase an external drive to which I can do periodic archiving of my files.\n\n"
    },
    {
      "time": " 17.Dec.2005 11.40am",
      "content": "“Keys out of order”\n\nThis is a major hard drive directory problem. Disk First Aid cannot repair this problem; and DW - can, but no guarantee.\n\n\\> So. Being stupid, I’m guessing, I repaired\n\nwell, I won’t say that since your aim is to fix the problem. However, this is good idea to back up the files.\n\nand let us know what your guy fixed or not.\n\n"
    },
    {
      "time": " 17.Dec.2005 12.00pm",
      "content": "About the B-tree ( Apple document ):\n\nThe B-tree (part of the disk directory) has become damaged and cannot be repaired by Disk First Aid.\n\nWhen Disk First Aid reports that the thread for a file is missing and it cannot repair it, this means that it is unable to reconcile the entry for the file in the directory (catalog B-tree) with the location of the file on the volume. This indication can be triggered by the following:  \nThe file in question may have become damaged and cannot be repaired.  \nThe catalog B-tree may have become damaged and cannot be repaired.  \nAn earlier version of Disk First Aid (which cannot repair volumes currently in use as the startup disk) is being used to try to repair the startup volume. Try booting from another volume such as a System Install CD, and run Disk First Aid from the CD.\n\n"
    },
    {
      "time": " 17.Dec.2005 12.28pm",
      "content": "Sounds like a dreadful calamity. Why don’t you visit [http://snarkish.com](http://web.archive.org/web/20080608074858/http:/snarkish.com/ \"http://snarkish.com\") where David Ramsey, Apple hardware guru (used to work there and wrote for MacWeek for years) hangs out. He is generous with his advice and usually clever.\n\n(Snarkish is the independent replacement for the former Mac forums on CompuServe, though snarkish also includes a bunch of other stuff.)\n\nBest of luck to you.\n\n—Kathleen\n\n"
    },
    {
      "time": " 17.Dec.2005 1.14pm",
      "content": "Thanks to you both.\n\nUPDATE: I was able to mount the drive on my old CPU and the files are successfully copying to another machine now. Even something as simple as opening and InDesign file — which I couldn’t do on the new CPU — is now working fine.\n\nNot to confuse:\n\nOLD CPU —\\> NEW CPU = All hell broke loose on OS9 drive, but OSX drive was happy.  \nNEW CPU —\\> OLD CPU = Could copy. Proceeeded to move all files to a 3rd computer.\n\nSo, worse case scenario. I have to re-install software on Monday.\n\n\\*fingers crossed\\*\n\n"
    },
    {
      "time": " 17.Dec.2005 1.50pm",
      "content": "Glad to hear things are looking better for you Tiff.\n\nChrisL\n\n"
    },
    {
      "time": " 18.Dec.2005 1.05pm",
      "content": "Tiffany, good luck.\n\nWhile your problem seems to be resolved, I thought I would share a relevant personal story. My PowerBook 12” died a few months ago while still under warranty, so I took it to the Apple Store. I couldn’t get to the files on it, no matter what I tried, and neither Disk Utility nor Disk Warrior would allow me to start the computer.\n\nThe clever bloke at the Apple Store was able to mount my PB as a FireWire disk and through Terminal he was able to pull files off of the hard drive and copy them into the hard drive of the host computer.\n\nSo. When Disk Utility and Disk Warrior fails, go and find yourself who’s handy in Terminal.\n\n"
    },
    {
      "time": " 19.Dec.2005 9.08am",
      "content": "Chester - what was the problem?  \nTiffany - how’s the Mac?\n\n"
    },
    {
      "time": " 19.Dec.2005 9.33am",
      "content": "Chester, thank you for that suggestion. Now we have it here on Typophile and hopefully searchable forever. My boyfriend did something similar when his laptop failed. I never arrived at the point thankfully.\n\nDavid, I’m copying all my files back to my newly erased secondary drive. If all is well then I can actually start working again. If not, I might have to reinstall the system. If I didn’t use classic — every blue moon or so — then I’d not need to reinstall anything. I also have to tell FontExplorer where the fonts are and iTunes where the music is ... other than that all is good ... so far.\n\nIt was nice to know I could at least share my pain with you all. What would I do without this community?\n\n"
    },
    {
      "time": " 19.Dec.2005 9.34am",
      "content": "Forgot to mention that I purchased an external drive and will be archiving to it from today forward. Phew!\n\n"
    },
    {
      "time": " 19.Dec.2005 12.50pm",
      "content": "You know, this should have been a blog entry. I apologize.\n\n—\n\nUpdate. Erased the drive. Copied files. Errors started all over again. Ran DiskWarrior. Failed to replace. Ran DiskWarrior again. Kernal Panic. Left for photoshoot. Had brainstorm. Use cables which connect drives from my old G4/400. Disk verified. Disk repaired. DiskWarrior ran successfully. Startup with option key saw the secondary drive as OS 9.\n\n\\*fingers crossed\\*\n\n"
    },
    {
      "time": " 19.Dec.2005 12.57pm",
      "content": "A bad cable could very well be the problem. You don’t happen to have a cat, do you?\n\n"
    },
    {
      "time": " 19.Dec.2005 1.33pm",
      "content": "<cite>You don’t happen to have a cat, do you?</cite>\n\nCat in the box? (computer) :-D\n\n"
    },
    {
      "time": " 19.Dec.2005 1.36pm",
      "content": "No animals allowed in this office (building). Besides, I don’t like cats. I’m not a cat person. Cats don’t like me either though, so it is fair. Did you have problems because of cats, Mark?\n\n"
    },
    {
      "time": " 19.Dec.2005 1.43pm",
      "content": "Mounting the drive over firewire is neither drastic, nor does it (in my experience) require Terminal.  \nYou just string the firewire cable between two macs, unplug all your other firewire doodads and geegaws, make sure the functioning mac is already on, then boot the bad mac while holding down your ’T’ key. It should mount on the good mac as a drive, and you can access files just as you would any other mounted drive.  \nIt’s saved my bacon a couple times, and is far from a last resort—it’s one of the first things I do.\n\n"
    },
    {
      "time": " 19.Dec.2005 1.50pm",
      "content": "David, to answer your question: There was a bad block on the hard disk, which was obviously there for a long time, but which was not a problem until I installed Tiger from scratch. In this situation, the only way to get to the files on the hard disk were using Terminal. (Trust me Matomatic, the PB would NOT mount, so only through Terminal could the supergeek at the Apple Store get to the contents.)\n\n"
    },
    {
      "time": " 19.Dec.2005 1.54pm",
      "content": "We had a cat a long time ago that had a jones for computer cables. We just got a new cat recently (after my daughter pressured us for about two years). So far, he does not seem very interested in computer cables (unless you dangle them in front of him). I have mixed feelings about having a cat in the house. He can be fun to have around, but it’s not unlike having a squirrel living in your house.\n\n"
    },
    {
      "time": " 20.Dec.2005 1.58pm",
      "content": "If ever anyone is at the end of the line, a drive can be sealed in plastic bags and frozen. Often the drive will temporarilly return to life, possibly long enough for files to be removed.\n\n"
    },
    {
      "time": " 20.Dec.2005 2.08pm",
      "content": "I’m allergic to cats so I won’t ever have that problem thankfully!\n\n"
    }
  ]
}
