{
  "id": "16852",
  "title": "Society of Typographic Arts",
  "forum": "Home",
  "tags": [
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20131011125324/http:/typophile.com/wiki/Indices) : [Organizations](http://web.archive.org/web/20131011125324/http:/typophile.com/wiki/Organizations) : Society of Typographic Arts**\n\nThe Society of Typographic Arts (STA) is a Chicago based design organization originally started in 1927. It was the Chicago branch of the AIGA until it left that organization to become the STA. The STA sponsored an annual competition, the 100 show as well as several publications. They were also one of the organizations that founded ICOGRADA and hosted the 1978 conference. In 1989 the organization broadened its focus to include other areas of design and became the now defunct American Center for Design (ACD).\n\nIn 1990 some former members of the STA restarted the organization as the New STA with a primary focus on local and regional design issues. It holds an annual design conference and has sponsored a series of informal presentations by designers ,and events having to do with Chicago's design history. For the seventy-fifth anniversary three simultaneous exhibits were held: \"Fifty Years of Graphic Design in Chicago 1927-1977,\" \"Fifty Years of Chicago Graphic Design (1941-1991),\" and \"Seventy-Five Years of Graphic Design in Chicago.\" Images from those exhibits were later incorporated into an online archive.\n\nWebsite: [http://sta.3st.com/main.php](http://web.archive.org/web/20131011125324/http:/sta.3st.com/main.php \"http://sta.3st.com/main.php\")\n\nChicago Design Archive website: [http://www.chicagodesignarchive.org](http://web.archive.org/web/20131011125324/http:/www.chicagodesignarchive.org/ \"http://www.chicagodesignarchive.org\")\n\nBooks published by the STA:\n\nThe Book of Oz Cooper, 1949  \nTrademarks USA, 1964  \nFifty Years of Graphic Design in Chicago, 1977  \nHerman Zapf and His Design Philosophy, 1987\n\n",
  "author": "gthompson",
  "time": "17 Dec 2005 — 11:10am",
  "uid": "4883",
  "comments": [

  ]
}
