{
  "id": "16860",
  "title": "Legal Issue",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello all,\n\nI hope this is in the right section. I have a legal issue. I designed three letters in the creation of a logo for a video production company. Yesterday I received by email a contract to sign were I state that the work is mine and I used nobody else’s font. Fine until here. Then I reread the contract and note it’s mostly about the typeface, so I asked a colleague of mine who is a polygraph to research the letters and see if it’s no other logo already and we found one :(  \nIt’s a free font that can’t be used commercially. The problem is not really there, it’s that the creator could say I ripped his work and send me to court. The logo will be very mediatised. (If we could refrain from saying the mark in this thread it would be cool, not really wanting a Google search to turn up this thread)  \nPerhaps it’s the contract that worries me here, lines like: I certify that this logo is my original design and not a copy of an existing logo or font or typeface.  \nI’m not sure to sign, as in a way I do feel it is a copy or variant of Levi Halmos' work.\n\nI will put his three characters next to mine to show you the comparison. Edit: This isn’t a good example as I think there is a lighter version.  \nI also added the construction which is mathematically very simple, anyone could do it and that is also worrying.\n\nI have no idea what to do now. Perhaps refuse the contract.  \nYour help would really be appreciated.\n\nThanks.\n\nRegards,  \nDavid Pache\n\n",
  "author": "dache",
  "time": "18 Dec 2005 — 2:16am",
  "uid": "9823",
  "comments": [
    {
      "time": "18 Dec 2005 — 2:50am",
      "content": "Well, you're in a bind. Honestly, the road that I would suggest here is, well, honesty. Don't ever sign a contract that might ever get you into trouble, ever. Contracts are made for lawyers and judges. If your client gets mad, there is a good chance you'll meet them both. And lawyers and judges will only look at the letter of the law, so to speak. If your client spends real money putting this logo into the media, and then thinks that you violated the contract, then you could be liable for severe damage fees.\n\nOn the other hand, playing the Devil's advocate, I doubt that anyone in the legal system cares much about the way three letters look. Do your letters look different from any others? What happens when you overlay them with the original? Is it an exact match? If not, you must have done _something_ to them…\n\nAlas, this is a matter which could be litigated back and forth. I wouldn't want uncertainty for that long. If I were you, I would hire a real lawyer (at least briefly), who is an expert on copyright and intellectual property law. That lawyer could do a real search for you, and give you a more definitive answer. If you got the go ahead from them, then—by all means—make sure that your client copyrights and registers their logo as a trademark. Copyright Registration and Trademarking are very important elements of the law, and sometimes all that can save an image.\n\nAs one of the moderators here, I really need to stress that this kind of question is sort of inappropriate for Typophile. I don't mean that it is a bad question—in fact, it is a very good question—but this is not a legal forum. Lawyers do not post and read here. Here you will get the advice and opinions of other designers. These may console or distress you, but they won't really help you solve the legal questions raised… sorry.\n\n"
    },
    {
      "time": "18 Dec 2005 — 3:55am",
      "content": "In regard to the issue, well I can not give any advice, nor do I want to, but there are more than one font out there made in the same style.\n\nIf it was me, and I drew from scratch a set of characters that were similar to another, well, too bad, no legal problems. The style shown is one that is very easy to duplicate, even by accident, and this similarity of design is very common.  \n+\n\n"
    },
    {
      "time": "18 Dec 2005 — 5:02am",
      "content": "\"Well, you’re in a bind. \"  \nActually Not, my good moderator... The world's legal systems have made it almost impossible to COPYRIGHT the DESIGN of a typeface. This was done to, among other things, make it so when people like you steal forms, users, like large corporations, don't get raked over the coals for it. In the eyes of the law, you are in the same position now, as if you had bought the font (hinthint). You've used the letters of a font in someone's logo and that is just plain legal.\n\n"
    },
    {
      "time": "18 Dec 2005 — 5:18am",
      "content": "_You’ve used the letters of a font in someone’s logo and that is just plain legal._\n\nI don't think that it is legal if the client and their contract expect the designer to have drawn the letters himself.\n\nDavid (Berlow), my concern is exactly the contract. If the designer signs a contract that says, in effect, \"I swear that all of this work is entirely mine, not influenced by any other,\" he _will_ be in a bind if the client decides to think otherwise down the line. What is to prevent the client from him them if they feel like it? Even if he has the \"legal\" high ground here, the designer might not be able to match wits with the client's legal fees, and could thereby lose the case and be liable for whatever damages the client might seek.\n\nDavid (Pache) seems to be working in Switzerland. I'm not a lawyer, I don't live in Switzerland, and I don't know a thing about Swiss law. But this seems to me to be a question of contract law first, and maybe only second about copyright law.\n\nIt isn't my liability at stake, David (Berlow), it's the poster's. What would you do, David (Below)?\n\nSorry about the whole last-name-in-parentheses thing… it seems to be the easiest way to differentiate between David Pache and David Berlow :(\n\n"
    },
    {
      "time": "18 Dec 2005 — 6:30am",
      "content": "I drew some letters like that 10 years ago. Do I get sue somebody? And some students of mine have drawn letters like that as well. Who is stealing from who?\n\n"
    },
    {
      "time": "18 Dec 2005 — 6:31am",
      "content": "If you drew the letters, you drew the letters. Sign the contract. Unless of course you didn't draw the letters.\n\n"
    },
    {
      "time": "19 Dec 2005 — 5:15am",
      "content": "Dan: “I swear that all of this work is entirely mine, not influenced by any other,” I think there is a real contract, why are you writing one?\n\nDache:  \n\"I designed three letters in the creation of a logo for a video production company. Yesterday I received by email a contract to sign were I state that the work is mine and I used nobody else’s font.\"\n\n...if the first sentence is true, and you made or know who and how was made the logo, and can positively prove that your letters are used, then: \"I have a legal issue\" is false. (period)\n\nThe company for whom you design the LOGO, should make the decision if and how they want to search to make sure no other \"Video Production Company\" or a substantially similar business, with the same initials, or name, or one substantially similar, that ALSO uses the same font(!), or one substantially similar, made a logo, just, , , like, , , this.\n\nThe existing font, is utterly not an issue, assuming that the following: \"to research the letters and see if it’s no other logo already and we found one :( It’s a free font that can’t be used commercially.\"\n\n...is confused, as it seems a search was done for a logo, and \"free font\" was found...which is hard to understand.\n\n"
    },
    {
      "time": "19 Dec 2005 — 5:23am",
      "content": "ok.\n\n"
    },
    {
      "time": "19 Dec 2005 — 6:06am",
      "content": "If YOU DREW the forms and DID NOT use someone else's font, then whether or not someone else has a similar letterform in his or her font is immaterial; the work IS yours.\n\n"
    },
    {
      "time": "19 Dec 2005 — 6:32am",
      "content": "Ok thankyou all for your comments. Basicly what oldnick said is what I was wondering. I was just being cautious as I was not sure about the copyright laws. Its mostly due to the client. Sorry if this is in the wrong forum.\n\nRegards,  \nDavid Pache\n\n"
    }
  ]
}
