{
  "id": "16872",
  "title": "William Caslon IV",
  "forum": "Home",
  "tags": [
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20141129205920/http:/www.typophile.com/wiki/Indices) : [Designers](http://web.archive.org/web/20141129205920/http:/www.typophile.com/wiki/Designers) : William Caslon IV**\n\nWilliam Caslon IV is best known as the designer of the first sans serif typeface, though sans serif lettering had existed for some time. He was the great grandson of the original [William Caslon](http://web.archive.org/web/20141129205920/http:/www.typophile.com/wiki/William%20Caslon), son of [William Caslon III](http://web.archive.org/web/20141129205920/http:/www.typophile.com/wiki/William%20Caslon%20III) who had purchased the [Joseph Jackson](http://web.archive.org/web/20141129205920/http:/www.typophile.com/wiki/Joseph%20Jackson) foundry in 1792 creating a second Caslon foundry. William IV took over the business in 1807 and was evidently very creative. He invented two part matrices for casting large letters and a method of casting wedge shaped letters for cylinder printing.\n\nIn 1816 William IV issued a specimen book that showed a single line of upper case sans serif letters labeled \"2 Line English Egyptian\" or about 28 points in size. Though Egyptian has come to refer to slab serif types only, it originally referred to all monotone or monoline stroke types. It is not known why he cut the sans, whether it was cut for a client or as an experiment, but there was no interest in it and several years would pass before more sans serif types appeared.\n\nIn 1819 William IV sold the foundry to Blake, Garnett & Co., which was formed specifically to purchase the company. They moved the company from London to Sheffield, England where it flourished and eventually became the Stephenson Blake foundry. William IV concentrated on developing a coal-gas system for lighting.\n\n",
  "author": "gthompson",
  "time": "18 Dec 2005 — 8:58am",
  "uid": "4883",
  "comments": [

  ]
}
