{
  "id": "16876",
  "title": "Agnoti",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hello all\n\nThis forum has inspired me a lot. I have started making this font, agnoti. I have never made an entire typeface before but I am ambitious. Its missing some letters, the ones where I cannot find a nice solution. As I have said I've never made a font before and this is purely for my own pleasure and a good learning experiance.\n\nedit: \\*updated\\*\n\nId really like replies, comments, crits or ideas so that I can finish the font. Thanks for your time. I have attached a pdf(570 KB) and a png.\n\nBest regards,  \nDavid Pache\n\n| Attachment | Size |\n| --- | --- |\n| [agnoti2.pdf](http://web.archive.org/web/20150417080846/http:/typophile.com/files/agnoti2.pdf) | 563 KB |\n| [agnoti3.png](http://web.archive.org/web/20150417080846/http:/typophile.com/files/agnoti3.png) | 36.42 KB |\n\n",
  "author": "dache",
  "time": "18 Dec 2005 — 12:17pm",
  "uid": "9823",
  "comments": [
    {
      "time": "23 Dec 2005 — 12:04am",
      "content": " ![](http://web.archive.org/web/20150417080846im_/http:/typophile.com/files/merry.png)\n\n"
    },
    {
      "time": "23 Dec 2005 — 4:14am",
      "content": "What's your motivation behind this font's design? At first glance, the letters seem grunge-y and piecemeal. After that, they don't seem to have too much to do with each other But the sharp angle on the up-stroke of the m looks professional! I'm so confused :(\n\n"
    },
    {
      "time": "23 Dec 2005 — 1:10pm",
      "content": "Thanks for the reply :)  \nWell my idea for this font is to have some kind of classical type look. I was thinking about crusaders and medievel times while drawing the letters. I assume this is completely another style, but this was my inspiration : [http://digidol.llgc.org.uk/METS/LLH00001/frames?div=3&subdiv=0&locale=en...](http://web.archive.org/web/20150417080846/http:/digidol.llgc.org.uk/METS/LLH00001/frames?div=3&subdiv=0&locale=en&mode=reference \"http://digidol.llgc.org.uk/METS/LLH00001/frames?div=3&subdiv=0&locale=en&mode=reference\")\n\nRegards,  \nDavid\n\n"
    },
    {
      "time": "29 Dec 2005 — 1:00am",
      "content": "David, I think that you should think more about the way broad-nibbed pens write on paper, as that is how letters were written in the middle ages (letters were also painted with a brush, or carved into stone, etc. but those were more for decoration than for reading). I'm not saying that you should necessarially copy calligraphic styles, or start writing by hand yourself, but do at least try to think about the tool and its style a bit more. Your \"m\" is getting there, the top curve on the \"a\" is a neat idea but needs a better transition, but the \"s\" is impossible, etc.\n\n"
    },
    {
      "time": "30 Dec 2005 — 7:00am",
      "content": "Thankyou Dan. I will do exactly that.  \nYeah, I hate the s with a passion. Im going to review the way I drew them and also make it have cleaner lines. I appreciate the input very much.\n\nRegards,  \nDavid\n\nedit : hehe I noticed I have entered the swiss font scene, cool :)\n\n"
    },
    {
      "time": "9 Jan 2006 — 9:03am",
      "content": "I would say tame -but don't purge- the irregularity.  \nAnd you might look at Carter's Alisal for ideas:  \n [http://www.myfonts.com/fonts/agfa/alisal/](http://web.archive.org/web/20150417080846/http:/www.myfonts.com/fonts/agfa/alisal/ \"http://www.myfonts.com/fonts/agfa/alisal/\")\n\nhhp\n\n"
    },
    {
      "time": "24 Mar 2006 — 11:47am",
      "content": "Hi, it has been some time.\n\nThankyou for the link for inspiration hrant, I appreciate it.  \nHere is an update, there are still problems but Im liking how the \"a\" turned out.  \nI have tried to implement all comments received. How do you think its turning out with this direction?\n\n[http://www.dache.ch/agnoti2.png](http://web.archive.org/web/20150417080846/http:/www.dache.ch/agnoti2.png \"http://www.dache.ch/agnoti2.png\")\n\nThanks\n\nRegards,  \nDavid\n\n"
    },
    {
      "time": "24 Mar 2006 — 1:17pm",
      "content": "Before I could say a lot, I would have to see more sample than this. But I'd say that for the kind of font it is, it's coming along well. I'd work on having a consistent color throughout: for example, the o is some lighter than the n, and the eye of the g is even lighter. You can have a serif with somewhat random stress and still have all the characters the same color. Check out [http://www.shinntype.com/](http://web.archive.org/web/20150417080846/http:/www.shinntype.com/ \"http://www.shinntype.com/\") Nick Shinn's work, in particular Oneleigh. The tail of your g is interesting, and I haven't decided whether or not I like it. Maybe (maybe) it could come a bit farther right, but I'll let you decide. I think my lack of confidence in criticisms is due to not being able to see in more context how the letters turn out to work together. So... put up more sample.\n\nNathanael\n\n"
    },
    {
      "time": "25 Mar 2006 — 8:07am",
      "content": "Thanks Nathanael, I see what you mean about the the color so I've tried to improve on that. Here is another sample.\n\n[http://dache.ch/agnoti3.png](http://web.archive.org/web/20150417080846/http:/dache.ch/agnoti3.png \"http://dache.ch/agnoti3.png\")\n\n[http://dache.ch/agnoti4.png](http://web.archive.org/web/20150417080846/http:/dache.ch/agnoti4.png \"http://dache.ch/agnoti4.png\")\n\nRegards,  \nDavid\n\n"
    },
    {
      "time": "26 Mar 2006 — 6:26pm",
      "content": "What I really meant was could you post a PDF with, like, a few lines or so of running text, or maybe a pangram. You know, show off all your character set. I think the color is getting better. I have to say I kind of liked it when it was a little more jagged. I also like the old e. The w,v,y could do with some flaring on the thin strokes. Overall, I think the concept behind this gives you a lot of freedom to just do whatever... as long as you make sure it looks good. I think you could do more with faceting, like you did with the n,m,h,u: do it on the a, maybe the b,d,p,q, possibly even the s and o. (But with this concept, avoid monotony too.) Some letters are still bolder than others. I wish some other people would come here and critique this (and while we're at it, my font too), so you could get advice from more than just me. One last thing I'd say is work on making them all look like they're related: for example, the s doesn't look like it even knows the rest of the font. (For a good s, I'd think maybe Lydian.) The middle serif on the k is totally unrelated. Okay, so pretty soon I'll just be rambling, so I'll stop typing.\n\n"
    },
    {
      "time": "27 Mar 2006 — 9:13am",
      "content": "Thanks again for being so helpful Nathanael, I really appreciate your aid. To make all the letters look like they belong together seems to be the hardest task for me, but Im slowly but surely getting there. As I said earlier, my s is probably the worst character to draw for me (it works better when its rotated 180 degrees!) but Im working on it everyday. I will check out that s you mentionned.  \nIt has really evolved since last year. I do attach some nostaligie to the hard, jagged edges but the soft curved look it has now feels more appropriate for the kind of learning curve I have set myself. Honestly though, too much freedom is a bad thing ( for example the k ).  \nWell anyway, I attached the pdf which has a few missing letters still.  \nSorry for not making proper sentences with spaces but I just cannot find an easy way to get my illustrator made characters into an easy to use font file. Will learn soon :) Also I may leave this font to settle down in my head for a moment, try some other style in the meantime.  \nThanks for looking.\n\n[http://dache.ch/agnoti3.pdf](http://web.archive.org/web/20150417080846/http:/dache.ch/agnoti3.pdf \"http://dache.ch/agnoti3.pdf\")\n\n ![](http://web.archive.org/web/20150417080846im_/http:/typophile.com/files/agnoti3pdf.png)\n\nRegards,  \nDavid\n\n"
    },
    {
      "time": "27 Mar 2006 — 1:43pm",
      "content": "That's what I'm talking about. What I really want is for more people to come here and comment on this. I'm afraid that if I make any mistakes here, it all falls down on you, and keep in mind that I haven't done any expert studies into type design--I just go by what looks good, and I'm self-taught (though by looking at fonts drawn by the experts)--and I'm still just 17, so there's that. All that said, with this larger sample I think I get a better idea of what you're trying to do, and it gives some of your decisions a rationale. The s doesn't actually look as bad as I thought (though it still needs something), and in regards to it working better when rotated 180°, one could say that about Weiss's s too, but then it loses the charm. I think the tail of the g does need to come right at least a little, and I stand by what I said about the flaring in the w,v,y. Also the f is out of character--too Baskerville. Centaur could be a good inspiration for some of the font. I look forward to whatever else you come up with as you take a sabbatical from Agnoti. I also wish someone <cite>else</cite> would come over here and look this over.\n\n"
    },
    {
      "time": "27 Mar 2006 — 3:23pm",
      "content": "This looks interesting, especially how it works in small size.\n\nIs this optical slant to the left done intentionally? I think it would get more dynamically if you slant it 1-2° degrees to the right (not visible, only minimal change!). Especially b d f h k l m n t have a hangover to the left at the moment...  \nI don't like the upper arm of the \"k\". It's stunted.\n\nSebilar\n\n"
    },
    {
      "time": "30 Mar 2006 — 3:27am",
      "content": "I understand what you mean about being afraid to make mistakes, but I really appreciate your help Number3Pencils. For what Im working on now, please see below.  \nSebilar, I will try that. It certainly isnt something I did intentionally. The k will be revamped, but later on.\n\nIm not sure if this project merits a new thread, so Ill just post it here for the moment. Im working on the letter \"a\" uniquely. I must have drawn over 200 \"a\"'s in my sketchbook over the past months. I was wondering if anyone also attempted the experiment among you? Its quite a challenge to come up with an original idea when you hit the the 100's :)  \nIm working on vectorising them all now, and plan to make many more for perhaps a greater project, who knows, its too early to say. These are by far not the best of the growing collection but the first 18.\n\n ![](http://web.archive.org/web/20150417080846im_/http:/typophile.com/files/aaa.png)\n  \n [http://dache.ch/aaa.pdf](http://web.archive.org/web/20150417080846/http:/dache.ch/aaa.pdf \"http://dache.ch/aaa.pdf\")\n\nThanks for your comments.\n\nRegards,  \nDavid\n\n"
    },
    {
      "time": "22 May 2006 — 12:00pm",
      "content": "Good evening everyone.\n\nI have gone onto learning FontLab Studio. I did a quick typeset ( which took about 3 hours to do) and used it as my no risk try every button study. Its great when you see your very own characters appear as you're typing them for the first time.  \nSo here is my first try with the software, the font has a huge number of errors, its ugly in most parts and isnt easy to read but I will clean it up over time. It may turn out to be just for titles or something. Is it ok if I use the same thread? It is based on my old 5 letter logo.  \n [http://typophile.com/node/15799](http://web.archive.org/)\n\n ![](http://web.archive.org/web/20150417080846im_/http:/typophile.com/files/rosti_3458.png)\n\nSo this evening, I added my agnoti characters in, did some kerning and just gave it a try. Work in progress, but its getting there.\n\n ![](http://web.archive.org/web/20150417080846im_/http:/typophile.com/files/agnoti5_4282.png)\n\nThanks for your comments.\n\nRegards,  \nDavid\n\n"
    },
    {
      "time": "22 May 2006 — 6:27pm",
      "content": "I love the funky g in agnoti. The hanging part has a thick section that doesn't match up with the set on a glance, but the shape is fun.\n\nI love the k too. All-in-all, a very nice looking offering for your first complete font.\n\n"
    }
  ]
}
