{
  "id": "16884",
  "title": "Variation of stress between characters in Caslon",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello fellow typophiles,\n\nI was reading about Caslon in _Anatomy of a Typeface_ and while looking at some samples I noticed that his lowercase o has a very vertical stress, while other letters such as p/q/d/b/e have a diagonal stress. This seems to change a little from size to size; in some the o stress is more vertical in others more diagonal.\n\nI know that typefaces from earlier centuries had varying stress, but as far as I knew they varied inside a certain range, being always more or less diagonal.\n\nI'm sure this must be something very obvious and common to most of you... but I just noticed it, and I'm left wondering if this is something characteristic of and/or first done by Caslon. My few books on type unfortunately don't bring this up clearly.\n\nBelow is a partial view of the sample I'm looking at. It's the Two Lines English from the 1763 specimen book, p 173 in _Anatomy_.\n\nThanks a lot for your help/opinions/insights/etc!\n\n ![](http://web.archive.org/web/20131221004423im_/http:/typophile.com/files/caslontwoline2.jpg)\n\n",
  "author": "gabrielhl",
  "time": "19 Dec 2005 — 6:46am",
  "uid": "5081",
  "comments": [
    {
      "time": "19 Dec 2005 — 6:55am",
      "content": "Plantin was already doing that in the 16th century.\n\n"
    },
    {
      "time": "19 Dec 2005 — 7:06am",
      "content": "Thanks Mark. I suspected it might have been influence from Dutch types, of which I know, unfortunately, almost nothing. While I'm saving money for _Dutch Type_, I'll look for types cut for Plantin... I know there was some work by Granjon and Van de Keere, but I'm sure I'll find more. Once again, thanks.\n\nEDIT: Wait, wait - did you mean Plantin did the stress variation or the vertical o? I just re-read my first post and it wasn't so clear. What I want to know is if the almost-vertical-stress lowercase o is a Caslon-first thing or if it was common during his time.\n\n"
    },
    {
      "time": "19 Dec 2005 — 12:12pm",
      "content": "There's also the Granjon o whose stress is very vertical in spite of the clearly angled stress of the other round letters. See Galliard for a recent example.\n\n"
    },
    {
      "time": "19 Dec 2005 — 1:14pm",
      "content": "Here's an experiment. I cut Jenson's p at 45 degrees, and copied and rotated the top right part to make an \"o\".\n\nIn comparison with his actual o, the composited o has the same outside shape -- quite round. The inside is where the angle of stress difference is apparent.\n\nHaving read Fred Smeijers' \"Counterpunch\", I would hazard that the same punch was used for the outside of the letters.\n\nInterestingly, the inside-outside variance may be relevant to the \"Legato principle\".\n\n ![](http://web.archive.org/web/20131221004423im_/http:/typophile.com/files/Theo.jpg)\n\n"
    },
    {
      "time": "19 Dec 2005 — 2:06pm",
      "content": "Carl: Thanks. That's the kind of \"precedent\" that I'm after. I'll look into Granjon, both in Galliard and 16th century stuff.\n\nNick: So you're saying there was a punch for the outside form, too, not just for the counter? Shaped like a half o cut at 45 degrees? That's very interesting... I recently got Counterpunch but haven't had a chance to read it thoroughly.\n\nOnce again thank you all for your answers!\n\n"
    },
    {
      "time": "19 Dec 2005 — 2:47pm",
      "content": "\\>Nick: So you’re saying there was a punch for the outside form, too,\n\nEr, I don't know, just a guess. As Smeijers says, there's a lot of supposing about how the old type was made. I've long been fascinated with Jenson's curved forms.\n\n"
    },
    {
      "time": "20 Dec 2005 — 1:06pm",
      "content": "\"there was a punch for the outside form, too,\"\n\nI don't think so, there are some mechanical problems, but I'm betting they tried on sundays when de master was away.\n\n"
    },
    {
      "time": "20 Dec 2005 — 6:54pm",
      "content": "I'm sure they tried everything they could think of (including all our best ideas, as Goudy observed), but David is right: you can't really use a counterpunch to remove the outside metal at the end of the shank. The term counter punch has a dual meaning -- a punch for punching punches and a punch for punching counters -- but only one use. You use the counterpunch once, at the beginning of the punch cutting process, and it pushes the metal in and outwards, creating the recessed counter. Then you work in from the outside with gravers to define the outer edges of the letter. You can't use a punch for the latter because if a) you have already sunky the counter, the second punch will distort the counter by pushing the metal inward, and if b) you punch the outer shape first, you will distort that when you come to sink the counter.\n\n"
    },
    {
      "time": "20 Dec 2005 — 7:49pm",
      "content": "From the experienting I've done in hand punch and patrix cutting, I know that a counterpunch is used for specifically that purpose: punching the counter. I've read that most times the hole created by the counterpunch is not final, but that the resulting hole is further modelled by the engraver. Also it's possible to use the same counter punch to punch b,d,p,q.\n\nPaul Duensing told me some years back that counter punches were saved up and even used to punch letters for typefaces that they were not specifically fashioned for in the first place.\n\nThere were apparently some meticulous punchcutters who made their counterpunches to come up to the finished line, but I would think the effort would drive one crazy. Since a counter punch is a taper (conus) the deeper the counterpunch is driven into the punch steel, the bigger the hole is at the face, and when the punch is faced down on the oilstone to remove the swell, the hole becomes even bigger.\n\nMy understanding of the counterpunch is that it gives one a comfortable hole in the punch blank in which to get the graver into.\n\nSome punchcutters would not use the counterpunch, but simply made a small hole with a hand drill and cut from there. I believe it was in Germany that the counter was simply gouged out of the steel by hand with grim determination.\n\nThere is no punch for the outer from of the letter. As John says this is hand cut around the punched counter by the punchcutter.\n\nWhen Dan Carr of Ashuelot New Hampsire visted me during the Vancouver ATypI he picked up a steel blank off my bench and wangled away at the end of it with one of my gravers and after a few seconds showed me the little hole he had drilled and said happily: \"there, we have a counter happening already\". (The man is an incurable optimist).\n\nIf you look up Dan on the internet you can read about his cutting of the \"Parmenides\" punches and his involvement with Bringhurst and Peter Koch in the printing of \"Fragments of Parmenides\".\n\nI believe Dan is the premier punchcutter in North America, if not the world since the closing of the Imprimeri Nationale in Paris.\n\nSorry for the long post.\n\nJim\n\n"
    },
    {
      "time": "20 Dec 2005 — 8:00pm",
      "content": "EDIT: I wrote this post at the same time Jim Rimmer was writing his. So I'm just leaving my speculation here even though Jim and John pretty much clarified everything...\n\nWhat if it were possible to take this deformation into consideration?\n\nIf the counter is struck first, followed by the outside shape, the latter would remain the same troughout the different letters, while different deformations sustained by the counters could be fixed with gravers...\n\nNot that I know anything about punch-cutting... so I don't really think that what I said could work, the counter probably would deform beyond repair...\n\n"
    },
    {
      "time": "20 Dec 2005 — 9:43pm",
      "content": "_I believe it was in Germany that the counter was simply gouged out of the steel by hand with grim determination._\n\nFrance, I think. This was the method employed at the Imprimerie royale/nationale. I am the very proud owner of Christian Paput's graver, which he kindly donated to the ATypI fundraising auction in Vancouver. It sits on my desk beside my computer -- or, rather, it will again once I get that particular box unpacked. Paput used it, among other things, to cut replacement punches for Garamond's original types at the Imprimerie nationale. Now how cool is that!\n\n"
    },
    {
      "time": "20 Dec 2005 — 10:27pm",
      "content": "David, John, Jim:\n\nI don't question your knowledge and reasoning.  \nBut at the same time I am reluctant to doubt what I see -- the similarity of the outside of the 'o' and 'p' curves, which I became aware of while working on my Jenson revival.  \nSo there are two possible conclusions to be drawn, if Jenson did not use a common \"punch\" for these.  \nFirstly, he may have used some kind of a template to duplicate the shape.  \nSecondly, and the one I am most taken with, is that it's merely a virtuoso display of craftsmanship.\n\n ![](http://web.archive.org/web/20131221004423im_/http:/typophile.com/files/Theo2.jpg)\n\n"
    },
    {
      "time": "21 Dec 2005 — 10:35am",
      "content": "Nick\n\nI know this hard to accept, but that accuracy between the outside of the o and the p would have been the result of just plain skill and eye judgement. It's not hard to believe this if one considers that a Dutchman once cut a set of punches for capitals 2 points in height.\n\nThere is no punch for the outline of the character. The counter was punched and the outside then filed and gravered to the judgement and satisfaction of the punchcutter. A letter was placed on the punch blank in many different ways: The dimensions of the letter were scribed lightly on the polished face of the punch using a small bras gauge, which created guidelines (we do the same thing in FOG). The letter was then either drawn on the punch with a grease paint and brush or a pencil, or on a piece of paper which was glued to the punch blank. Another way, used by Dann Carr in cutting Parmenides was to paste the finished paper image on the punch and then stab through the paper with avery fine hardened steel point creating a \"connect the dots\" guide. You can see from this that the image laid on the punch is subject to a lot of interpretation and eye judgment by the punchcutter. If I recall his description correcly, Dann's letters were finshed and accurate computer type printouts. Folowing this rough guide the letter comes about slowly but accuratley.\n\nI have read that there is such a thing as a counter-counterpunch. This was where the counterpunch was so complex that it was necessary to punch it and then file the rest of the metal away to create the counter punch. I forget what I was told about this process other than that is was in the case of very complex letters: comstocks etc.\n\nIf you consider what wonderful finish and uniformity came out of Stempel and Enschede; all the results of handcut punches you can understand that there is no problem in achieving something as uniform as the letter shapes in question.\n\nI am certainly not the world expert on the subject of punchcutting, but practicality tells me that I am more or less correct on this.\n\nI had a young man come to visit me from Chicago to spend five days exploring the different ways of cutting type. I think he was a little taken aback when I handed him a punch blank and a handful of tools and suggested he whittle out a letter. He surprised himself after about a day, when he discoverd that from a 1/4\" square of steel he had cut away all the metal and had a letter. I think his words were: \"I can't believe I made this out of nothing. At first it seemed like it's impossible.\"\n\nWhat I am trying to express is that a letter comes about on the steel in a slow and controlled way. There is no such thing as a screwed up punch if you slip. you simply face it down and once the mistake is erased you start over. It's possible to smoke proof your progress and make adjustments in weight, stress of curve etc. as the puhch progresses.\n\nA read of Legros/Grant and Simone Fournier might be interesting to anyone searching out the history of typecutting.\n\nA few times a year People come here to try their hand at it for no other reason than to touch the past in a small way and to feel a connection with the way our craft came into being. Anyone is welcome, and I seem always to find the time.\n\nThere are two puchcutters still active in the US.: Dan Carr and Stanley Nelson (once of the Smithsonian). I have fallen out of contact with Stan, but he can be reached by going through the American Typecasting Fellowship which can be found on the Internet.\n\nStan is probably the most knowledgeable historian/practitioner of the craft, and he's nice.\n\nJim\n\n"
    },
    {
      "time": "21 Dec 2005 — 11:36am",
      "content": "_I know this hard to accept,_\n\nOn the contrary, and this is why I have long believed that many of the idiosyncracies in Jenson's type which are generally assumed to be the result of uneven workmanship and crude technology are in fact quite intentional design features.\n\n"
    },
    {
      "time": "21 Dec 2005 — 2:18pm",
      "content": "Robert Bringhurst's 1985 _Shovels, Shoes and the Slow Rotation of Letters: A Feuilleton in Honour of John Dreyfus_ handles stress variation at some length, specifically in relation to Mannerist and proto-Baroque letters of the later sixteenth century, starting with Robert Granjon.\n\nIf I remember correctly from my background research to Henk Krijger's Raffia Intials, Mannerist writing masters from Spain describe or show in their writing books sets of majuscules with varying stress. That is, there is in the writing of this era often rotation between different strokes in one and the same letter (rather than within a particular stroke).\n\n"
    },
    {
      "time": "3 Jan 2006 — 12:18pm",
      "content": "Gabriel, if you want to see a <cite>really</cite> strange \"o\" check out Fleischmann, especially his #65 - now that's funky. And where F'man's results can't be attributed to sloppiness, Caslon's can (although he was great in other ways - like his italic \"Q\" is unsurpassed in optical scaling prowess). On the other hand, I wouldn't attribute the singular stress in Caslon's \"o\" to his sloppiness - more likely it's Rationalism creeping in: it's a structurally symmetrical shape (unlike something like the \"p\") so it can be seen as crying out for symmetry of stroke too.\n\nAs others have said: counterpunches don't work on the outsides; and some people never used them anyway. Furthermore, Caslon being a former metal engraver I would guess he did it all by hand; plus he was pretty sloppy so not knowing more I would guess that he used only the graver. Did I mention Caslon was sloppy? ;-)\n\nBTW, did Howes leave behind any good documentation of Caslon's methods?\n\n\"Legato principle\": it's quite hard to imagine that back then, and especially with Jenson, chirography could be challenged with such an advanced notion. There's no reason to doubt that Evert was the first to think of that (or at least implement it). All time periods have some invention after all. It's just harder to accept it when it is (or, sadly, was) a contemporary, a peer.\n\n\\> the result of just plain skill and eye judgement.\n\nYup.\n\n\\> This was the method employed at the Imprimerie royale/nationale.\n\nActually, the IN doesn't use couterpunches simply because 99% of their punchcutting involves replacing lost/damaged/missing sorts, so the pure graver is the only real option. I'm not sure that French punchcutting was historically anti-counterpunch... although avoiding the counterpunch based solely on principle is indeed typically French in its romanticism. :-)\n\n\\> ... the counterpunch is driven into the punch  \n\\> steel, the bigger the hole is at the face\n\nWhich was a trick used to make the larger sizes of a font actually!\n\nOne last thing: a roundish \"o\" is good for readability.\n\nhhp\n\n"
    },
    {
      "time": "3 Jan 2006 — 12:50pm",
      "content": "<cite>more likely it’s Rationalism creeping in: it’s a structurally<br>\nsymmetrical shape (unlike something like the “p”) so it can be seen<br>\nas crying out for symmetry of stroke too.</cite>\n\nI thought of \"Rationalism creeping in\" at first too, and that's why I wanted to be sure if it had been done before. I think Caslon might have had some Rationalist influence, but Granjon... and if Caslon was sloppy, well, Granjon definetly wasn't. However, the stress in Granjon's \"o\" is not vertical, it's slightly slanted and with Granjon I would bet he knew what he was doing.\n\nIn fact, about the \"Legato effect\" (which I don't really understand), when I first saw [this graphic](http://web.archive.org/web/20131221004423/http:/www.evertbloemsma.nl/legato/about_legato/about_legato_images/legato_helv_axis.gif) from the FF Legato site, the varying stress reminded me immediately of Mannerist type.\n\nRight now I think more like the second part of what Hrant said - a mental \"o\" is a circle, and if you're not emulating a calligraphic model, it's very tempting to make the letter symmetrical, since it will look balanced (as a single letter).\n\n"
    },
    {
      "time": "3 Jan 2006 — 2:19pm",
      "content": "\\> the varying stress reminded me immediately of Mannerist type.\n\nI think it's a natural phenomenon to see things we're familiar with in something essentially new, too new to easily grasp. Without Evert's elaborations, who knows what I myself would have seen in Legato. And even with his elaborations some people still see what they \"expect\" - for example people who prefer chirographic type see the pen it in, even though its very foundation is anti (or at least non) chirographic!\n\nLegato's blacks are [partly] shaped by a \"linkage\" between its whites.  \nThis is new.\n\n\\> it will look balanced (as a single letter).\n\nAnd we know that a font is not a bunch of single letters...  \nBUT, there's an interesting positive consequence to making  \nsome features of some letters (maybe the stress in the \"o\")  \nintentionally -and carefully- different: better readability,  \nthrough divergence (or dissimilitude, as John I think likes  \nto call it). BTW, I've become pretty convinced (if partly  \nfor a lack of any alternate explanation) that this is what  \nF'man was doing. But I have to doubt that Caslon was.\n\nhhp\n\n"
    },
    {
      "time": "3 Jan 2006 — 4:04pm",
      "content": "I find it a bit humourous to think that Caslon would work on making a letter individually good, because it seems to conflict with Updike's explanation about how the letters aren't individually good but the overall aspect is.  \nBut I suppose he was saying the finish of Caslon's punch-cutting wasn't so good, whereas the \"o\" stress is more of a \"design decision\".\n\n"
    },
    {
      "time": "3 Jan 2006 — 4:46pm",
      "content": "\\> the finish of Caslon’s punch-cutting wasn’t so good,  \n\\> whereas the “o” stress is more of a “design decision”.\n\nExactly. Which is why I suggested sloppiness can't explain it.\n\nIt would be nice to figure out if Caslon was simply mimicking yet  \nanother feature from Dutch type or if it was his idea (or maybe a  \nconcept acquired from elsewhere).\n\nhhp\n\n"
    },
    {
      "time": "3 Jan 2006 — 5:57pm",
      "content": "<cite>It would be nice to figure out if Caslon was simply mimicking yet another feature from Dutch type or if it was his idea (or maybe a<br>\nconcept acquired from elsewhere).</cite>\n\nYou mean for the \"o\"? I suspect it was done before. In Bringhurst's \"Painting with Ink & Steel\" (Serif #3), Míklos Kis (1685) and Jean Jannon (1620) romans have almost vertical. And in Serif #2, Granjon's Ascendonica's o seems pretty vertical-stress too.\n\nThe only way to assume Caslon obtained it from Dutch sources would be to investigate common Dutch type used in early 18th century England, and see if something like that can be found. Maybe there were \"almost-vertical\" ones and he straightened it up to vertical.\n\nOne thing I wonder with the Caslon vertical \"o\" is if it had influence on Baskerville's vertical axis. In the Milton preface he praises Caslon, but at that time could one be British, involved with type, and _not_ praise Caslon? I suppose the RdR (and Fournier?) would have been a much more direct influence, since it had a full-scale rationalist axis.\n\n"
    },
    {
      "time": "3 Jan 2006 — 7:05pm",
      "content": "Good points. BTW, I ascribe Baskerville's public praise  \nof Caslon to good ol' English propriety, nothing more.\n\nhhp\n\n"
    },
    {
      "time": "3 Jan 2006 — 7:45pm",
      "content": "Praise may be totally sincere and more than mere propriety while still acknowledging that what was appropriate to the baroque sensibility is not appropriate to the neo-classical tastes. Baskerville wanted to create a new style that would be appropriate to the kind of books he wanted to publish, and which would also show off the advances he had made in presswork and paper finishing. Just because Caslon's types were not suitable for his purposes doesn't mean he didn't genuinely admire them. British neo-classicism lacked the revolutionary edge of the French, and was quite happy to co-exist with the past so long as it wasn't gothic :)\n\nRegarding the rationalised o, which as Gabriel notes predates Caslon by a long time, I suspect this form develops from the relative difficulty of getting an o with a sloped axis to look quite right. This is something I encountered early in my own type design work, and one which still causes a lot of problems. The lowercase o is a tricky letter, and giving it a vertical axis is one of the ways of making it easier. At the time I first started trying to draw outlines for this letter, many years ago now, I went to look at a lot of old types to try to figure out how to do it; what I discovered was that a lot of old types had o's with vertical axes. Aha, I thought, I'm not the only person who finds this letter difficult.\n\n"
    },
    {
      "time": "4 Jan 2006 — 4:00am",
      "content": "Oh, I didn't really mean to say that Baskerville didn't admire Caslon, just that his praising didn't necessarily imply he might have had any inspiration from W.C.\n\n"
    },
    {
      "time": "26 Jan 2006 — 12:17pm",
      "content": "Fascinating stuff. I'd love to spend a few months getting down a dirty engraving metal. I'm sure I'd go nuts, but it'd be tremendously helpful.\n\nIt tickled me to hear of your struggles with the o, John! I feel that little bit less bad, now ;)\n\nTechnicalities of production aside (if that's even possible), what are your opinions on the idealogical implications of varying stresses?\n\n"
    },
    {
      "time": "27 Jan 2006 — 9:10am",
      "content": "_what are your opinions on the idealogical implications of varying stresses?_\n\nPeople who vary stress are clearly reactionary agents of counter revolutionary forces and enemies of the state. They should be shot.\n\nSeriously, I don't know what 'ideological' means in this context. Varied stress is a characteristic of some particular styles of lettering and type. One could say ideological purity demands that one should never vary stress in a neo-classical typeface, but that's just a weird way of saying that it wouldn't be neo-classical if one did.\n\n"
    }
  ]
}
