{
  "id": "16881",
  "title": "Circa C and Numerals",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello\n\nI have just discovered the site. What a great resource. Anyway..  \nJust wondering whats the preferred way of setting c. ?  \nIm using text figures. Is it a lowercase c or a latin small c?  \nI read in a book that its better if you use text figures with  \nlower case and titling figures with upper case.  \nShould the c. be the same size as the numerals?  \nIs this the general rule that everyone uses?  \nI have seen some books with titling numerals with lowercase,  \nand to be honest it looks odd. Some of the books are well designed  \nsome of them not (these are the ones I don't trust)\n\nD.\n\n",
  "author": "dwynn",
  "time": "19 Dec 2005 — 5:26am",
  "uid": "10684",
  "comments": [
    {
      "time": "19 Dec 2005 — 5:43am",
      "content": "Whatever looks best to your eye will work; small cap c with oldstyle numbers is only one of many possibilities. The only hard, fast rule is that should be NO period following the c\n\n"
    },
    {
      "time": "19 Dec 2005 — 6:16am",
      "content": "I would stick with a lowercase c. (with a period) especially if you have e.g. and i.e. in the document.  \nTim\n\n"
    },
    {
      "time": "19 Dec 2005 — 6:49am",
      "content": "It will be used on picture labels for an major art gallery.  \nAnyone recall what they use on labels at other galleries with regards to circa?\n\nD.\n\n"
    },
    {
      "time": "19 Dec 2005 — 10:00am",
      "content": "_I would stick with a lowercase c. (with a period) especially if you have e.g. and i.e. in the document._\n\nTim, you're welcome to do it your way; however, _The Chicago Manual of Style_ recommends: \"Common Latin abbreviations such as 'etc,' 'eg,' 'ie,' are set in roman type without punctuation.\" This includes **c** for **circa** ; **c.** is commonly used as an abbreviation for **century**. So, \"circa 16th century\" would translate as \"c 16th c.\" Or not...\n\n"
    },
    {
      "time": "19 Dec 2005 — 10:43am",
      "content": "Perhaps one of the reasons that the \"no period\" version doesn't look as logical as it used to is that we come across a lot of mixed alpha-numeric \"words\" these days, eg (ha!) in passwords.\n\nHowever, as the abbreviation for software versions is \" v4.3\" rather than v.4.3, and being a minimalist, I would stick with Chicago.\n\nAlso, Bringhurst is in the tradition of \"anti-unnecessary marks\", which he characterizes as filling text with grapeshot (or something similar, can't remember exactly).\n\n"
    },
    {
      "time": "19 Dec 2005 — 10:49am",
      "content": "On the Chicago Manual of Style website they use \"e.g.\" and \"i.e.\" with periods in the question on this page about using the two abbreviations:\n\n[http://www.press.uchicago.edu/Misc/Chicago/cmosfaq/cmosfaq.Abbreviations...](http://web.archive.org/web/20140709161154/http:/www.press.uchicago.edu/Misc/Chicago/cmosfaq/cmosfaq.Abbreviations.html \"http://www.press.uchicago.edu/Misc/Chicago/cmosfaq/cmosfaq.Abbreviations.html\")\n\nAs far as I can tell, omitting the periods is a fairly recent British convention.\n\n"
    },
    {
      "time": "19 Dec 2005 — 11:02am",
      "content": "In CMS, possibly, however I would use punctuation for etc. e.g. i.e., the abbreviation for century commonly used in UK is C. The Oxford house style and Hart's Rules suggest any abbreviation that has the first and last letter needn't be punctuated whereas any other lowercase abbreviation should be.\n\nc. 16th C (or c. C16) is how I would set circa 16th century.\n\n{edit Bringhurst's quote is \"birdshot and wormholes\"}\n\nTim\n\n"
    },
    {
      "time": "19 Dec 2005 — 11:12am",
      "content": "\\>“birdshot and wormholes”\n\nRight. Birdshot is a bit off as a simile, but I suppose flyturds isn't really RB's style.\n\n"
    },
    {
      "time": "19 Dec 2005 — 3:39pm",
      "content": "_the abbreviation for century commonly used in UK is C. The Oxford house style and Hart’s Rules suggest any abbreviation that has the first and last letter needn’t be punctuated whereas any other lowercase abbreviation should be._\n\nGood point...where you ARE dictates how you format. The Brits have their own ideas about the proper use of single and double quotes (as do the Germans and the French and...)\n\n"
    }
  ]
}
