{
  "id": "16887",
  "title": "educational research logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "here's a logo that I'm working on for an educational research company. still need to decide on colors, so a one-color version is attached... any comments would be appreciated. original logo can be found here: [http://www.systemic.com/op/images/SRLogo\\_trans.gif](http://web.archive.org/web/20131020083846/http:/www.systemic.com/op/images/SRLogo_trans.gif \"http://www.systemic.com/op/images/SRLogo\\_trans.gif\")\n\n| Attachment | Size |\n| --- | --- |\n| [SR-book.gif](http://web.archive.org/web/20131020083846/http:/typophile.com/files/SR-book.gif) | 5.44 KB |\n\n",
  "author": "mgalv",
  "time": "19 Dec 2005 — 10:25am",
  "uid": "2240",
  "comments": [
    {
      "time": "19 Dec 2005 — 12:48pm",
      "content": "Love the graphic but the type/graphic relationship needs to be changed. Explore either making the graphic or the type smaller. Right now they are both fighting for the same attention. Your type is boring and I hate the negative leading. That y is almost crashing the R. You are another person who needs to get away from the computer and free up your creativity and sketch. Work on relationships.\n\n"
    },
    {
      "time": "19 Dec 2005 — 2:01pm",
      "content": "I agree with dan about the obviously computer made quality of the b/w image. I have to admit it basically works on some level - but it could be better. Much better.\n\nRedraw the book/graduation hat by hand. Then some life will return to the core logo element. While your at it draw it again many times to make sure your making the best one you can. But... maybe not\n\nAt some level I don't know that I would use that book/gradhat idea because it is so potentially ambigous. It's like the classic visal illusion young lady/old lady-crone image in that you have to resolve the image either one way or the other. As a hat or as a book. Not both. I am not sure that that effect - while effective - is a good one to have at the core of a company identity. It seems to say you can be academic or research but not both at once - which is effectively the opposite of what the company does. It DOES do both. And that is the point.\n\nAnd Dan is right about the negative tracking on the font. Some fonts can handle it better than others & this one can't it seems. I also don't think it makes a strong statement for you. It's too nothing in particular. I think a type face needs to contribute meaning to the logo. So in short I suggest that you try something else. Or maybe explain what you want the font to be saying & why.\n\n"
    }
  ]
}
