{
  "id": "16883",
  "title": "Cy Twombly",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "anyone get his stuff? i just don’t get it. why is he in the finest museums in the world?\n\nutter crap:\n\n[http://www.georgetown.edu/faculty/irvinem/visualarts/Image-Library/Twombly/cy-twombly-crossing.jpg](http://web.archive.org/web/20051221035038/http:/www.georgetown.edu/faculty/irvinem/visualarts/Image-Library/Twombly/cy-twombly-crossing.jpg)\n\n[http://www.painterskeys.com/clickbacks/images/woa/112604\\_cy\\_twombly.jpg](http://web.archive.org/web/20051221035038/http:/www.painterskeys.com/clickbacks/images/woa/112604_cy_twombly.jpg)\n\n",
  "author": "nycersalife",
  "time": "19 December, 2005 - 7:10am",
  "uid": "8034",
  "comments": [
    {
      "time": " 19 December, 2005 - 7:52am",
      "content": "Looked at some of his work at the Menil recently. I don’t get paid for art opinions, so I won’t offer any. I will say my sceptic alarm goes off any time I see someone isolate one artists and say something as provacative as utter crap. IMO, art institutions sell the spell to the public that individuals are worth celebrating in out culture. The specifics about whether this or that artist should be in the collection, or even respected, to me are secondary.\n\nI’ll say this. I was very surprised at his use of legible text and historical themes.\n\n"
    },
    {
      "time": " 19 December, 2005 - 7:56am",
      "content": "I think it’s ashame we have to call people artists because they call themselves one. I know it’s all art, whether or not it’s ‘good’. Uggg.\n\n"
    },
    {
      "time": " 19 December, 2005 - 8:10am",
      "content": "Any relation between Cy and Carol? It’s not exactly a common name, and visual talent does seem to run in families.\n\n"
    },
    {
      "time": " 19 December, 2005 - 8:24am",
      "content": "As I regard an artist being someone who dares to present himself to the audience like no one else does, Cy Twombly is an artist. Oh yes.  \nWhether I like his work or not, I think that’s out of the question.\n\nI just don’t get him.\n\n"
    },
    {
      "time": " 19 December, 2005 - 9:06am",
      "content": "Not a clear answer, but mine, and you might find [get] something:  \n“why is he in the finest museums in the world?”  \nFor the same reason this man is not: [http://troyheadrick.com/statement.htm](http://web.archive.org/web/20051221035038/http:/troyheadrick.com/statement.htm)\n\n“I know it’s all art, whether or not it’s ‘good’”  \nThis was a part of a text I just happened to read yesterday, by Einstein, your assumption reminded it to me - “The abolition of war will demand distasteful limitations to national sovereignty. But what perhaps impedes understanding of the situation more than anything else is that the term mankind feels vague and abstract. People… can scarcely bring themselves to grasp that they, individually, and those whom they love are in imminent danger of perishing agonizingly. And so they hope that perhaps war may be allowed to continue… this hope is illusory.”\n\nRegards,  \nAS\n\n"
    },
    {
      "time": " 19 December, 2005 - 9:18am",
      "content": "I don’t get it either, maybe that’s the point.\n\nI do, however, get lee walton. The man is amazing.\n\n[http://www.leewalton.com/drawings/index.html](http://web.archive.org/web/20051221035038/http:/www.leewalton.com/drawings/index.html)\n\n"
    },
    {
      "time": " 19 December, 2005 - 10:39am",
      "content": "why don’t they just put kindergartener’s stuff in though?\n\nhe has his own museum in houston. someone must see talent. i just don’t get it\n\n"
    },
    {
      "time": " 19 December, 2005 - 10:43am",
      "content": "Art does not need to justify itself. It exists because it was created, not because it is needed.\\* I, personally, don’t enjoy his work. These two images which you have chosen do strike me as not being art. To each there own.\n\n\\*Although I, personally, enjoy/need beautiful art. There is nothing as peaceful as walking through a museum filled with art which I appreciate.\n\n"
    },
    {
      "time": " 19 December, 2005 - 10:55am",
      "content": "\\>anyone get his stuff? i just don’t get it. why is he in the finest museums in the world?\n\nIf you want to understand, rather than just knee-jerk, study Jackson Pollock, and how he put American painting on the map.\n\nCy is of a similar vintage. But art has moved a long way since abstract expressionism, there have been many generations of “charlatans” since!\n\nIt might be fairer to experience the actual work too, rather than a pixel simulacrum, although you might still have the same reaction.\n\n"
    },
    {
      "time": " 19 December, 2005 - 11:24am",
      "content": "I saw the Pollock’s exhibition in Venice couple of years ago and the thing I remember most is the picture of his atelier, printed big size on the wall, stunning. I also tried to understand how he could achieve the control of the drops, but I am sure I didn’t get it because I used the brain only.  \nThere is nothing as peaceful as walking through a museum filled with forests which I appreciate, thanks Miss Tiffany !\n\nRegards,  \nAS\n\n"
    },
    {
      "time": " 19 December, 2005 - 11:25am",
      "content": "I agree with Nick, but I also agree with the sentiment that a rose by any other name would smell as sweet. And vice versa.\n\nArt and I have parted ways a bit recently. I find myself looking more and more outside of established art institutions for art that moves/impresses me.\n\n"
    },
    {
      "time": " 19 December, 2005 - 12:49pm",
      "content": "Not until I saw “Eight Blue Poles” in the flesh on a museum wall did I appreciate Pollock’s work.\n\nChrisL\n\n"
    },
    {
      "time": " 19 December, 2005 - 1:02pm",
      "content": "I’d not seen any of Cy Twombly’s work, as far as I know, until I checked out the links at the top of this thread. I actually quite like the second example, and I’m not an automatic fan of abstract expressionism. This work interests me, because it has some of the same visual quality as David Jones’ (figurative) paintings (see [this](http://web.archive.org/web/20051221035038/http:/collection.britishcouncil.org/html/work/workimage.aspx?imageId=4241) for example). I wonder to what degree Twombly might be responding, in an asbtract way, to the observations of optical perspective, foveal and parafoveal vision that inform Jones’ paintings? Or maybe they simply had a similar colour palette. Either way, Twombly’s work is of interest to me, so thanks, ironically, for bringing it to my attention.\n\n"
    },
    {
      "time": " 19 December, 2005 - 1:14pm",
      "content": "Oh, and when you know that [this](http://web.archive.org/web/20051221035038/http:/www.artchive.com/artchive/t/twombly/twombly_leda.jpg) is entitled _Leda and the Swan_ it makes a whole lot of sense and is alternately funny as an art history joke and disturbing as an image of sexual violence. I’d go so far as to disagree with the assessment of this as abstract expressionism: this is figurative painting, albeit of an extreme expressionist kind.\n\n"
    },
    {
      "time": " 19 December, 2005 - 1:18pm",
      "content": "\\>the observations of optical perspective, foveal and parafoveal vision that inform Jones’ paintings\n\nLike a lot of British and American artists of his generation (early and mid 20thC) Jones was engaged with modernism, but not to the extent of “European” modernism. In other words, those Brit artists tended to abstraction, because it was contemporary and modern, but were never able to let go of representation. That’s what makes Pollock so seminal, in the way that one (and the critics and Life magazine who built the myth) can see his work moving from pictorial representation, through “psychological,” kind of surrealist doodling, on to action painting.\n\n"
    },
    {
      "time": " 19 December, 2005 - 1:22pm",
      "content": "Your last post John, that’s interesting, in that it connects the Leda piece to that era of “psychological doodles” of Pollock’s that I referred to. The relationship to surrealism is in connecting with the subconscious. Then Pollock hot-wired to his instincts with action painting.\n\n"
    },
    {
      "time": " 19 December, 2005 - 1:23pm",
      "content": "This article has a nice introduction and discussion of the art of Cy Twombly:\n\n[Cy Twombly: The man who made an art out of doodles.](http://web.archive.org/web/20051221035038/http:/www.slate.com/id/2116180/)\n\n"
    },
    {
      "time": " 19 December, 2005 - 1:23pm",
      "content": "This article has a nice introduction and discussion of the art of Cy Twombly:\n\n[Cy Twombly: The man who made an art out of doodles.](http://web.archive.org/web/20051221035038/http:/www.slate.com/id/2116180/)\n\n"
    },
    {
      "time": " 19 December, 2005 - 1:36pm",
      "content": "\\> <cite>why is he in the finest museums in the world?</cite>\n\nWell, I think the last few comments by Mr Shinn and Mr Hudson answer the question very well.\n\nArt, like so many things, does not exist inside a bubble. You cannot take the visual out of its context. Historical significance, titling, intent all flesh-out the meaning of a piece. Whether or not you personally respond to the aesthetic has no bearing on the “greatness” of an artwork.\n\nAnd to the point of other, “better” artists who have no critical acclaim or popular recognition… art is a business as well, unfortunately. A big part of playing the game is who you know.\n\nMost artists, I would venture, aren’t in it for the fame and fortune anyway. Rather, they are driven by personal passion to express themselves creatively.\n\n"
    },
    {
      "time": " 19 December, 2005 - 2:20pm",
      "content": "Twombly’s stuff has to reach you in the right context. I know I was fascinated with his work halfway through my second year of art school, tired of fiddling with the “illusion of light”, perspective, color theory and other optical tricks. It actually steered me in the direction of graphic design. Flat and linguistic.\n\nIt’s always a downer to disregard work in a museum on the basis that it looks like a 5-year-old made it. One’s understanding may be better served asking _why_ it looks like a 5-year-old made it.\n\n"
    },
    {
      "time": " 19 December, 2005 - 2:37pm",
      "content": "I’m all for art by 5-year olds.  \nA few years ago, I saw what I considered one of the best art exhibits ever. It was of Christmas/seasonal images by school children from Etobicoke (a Toronot suburb), shown at the City Hall.\n\nThe moral is: parents, make sure your infants work with archival-quality materials.\n\nAs Paul Klee said, he had been trying all his adult life to try and paint like a child again.\n\n"
    },
    {
      "time": " 19 December, 2005 - 2:43pm",
      "content": "Cheers to that Nick… but what about the elephants?\n\n[http://www.novica.com/art/elephant\\_art/index.cfm?c=345&l=6](http://web.archive.org/web/20051221035038/http:/www.novica.com/art/elephant_art/index.cfm?c=345&l=6)\n\n"
    },
    {
      "time": " 19 December, 2005 - 2:49pm",
      "content": "Klee isn’t the only. It is a well worn path leading back to the lost skills of a child. Similar quest for the primitive. That idea of purity in origination.\n\nBe in the air  \nbut not the air  \nbe in the no air\n\n"
    },
    {
      "time": " 19 December, 2005 - 3:03pm",
      "content": "\\> <cite>I will say my sceptic alarm goes off any time I see someone isolate one artist and say something as provacative as utter crap.</cite>\n\nI forgot to add that I agree whole-heartedly with James on that.\n\nTo offer a subjective judgement (and a harsh one at that) with no critical analysis to support the statement is quite the cop out. Sure, everyone is entitled to their own opinion. However, if you are going to offer it as fodder for debate, back it up with something substantial, please.\n\nOtherwise you’re just asking for a classic “_Is not! / Is too!_” pissing match. There’s more than enough of that in the world already.\n\n"
    },
    {
      "time": " 19 December, 2005 - 6:38pm",
      "content": "Alessandro,\n\nRegarding Pollock, I read this in [Wired Magazine](http://web.archive.org/web/20051221035038/http:/www.wired.com/wired/archive/13.12/rembrandt.html?pg=1&topic=rembrandt&topic_set=) (pp. 2-3):\n\n<cite>“After scanning Pollock’s works and analyzing them at increasingly fine magnifications, Taylor found fractals - the naturally occurring geometric patterns, like the branches of a tree, that repeat over and over at every level of magnification… In one experiment, he rigged about 40 people with motion sensors and asked them to flick, spatter, and pour paint à la Pollock. But contrary to the my-kid-could-do-that sentiment often triggered by abstract art, nobody could fake the fractals. ‘When you move your body to a posture where you are right on the edge of your balance, your motion becomes fractal,’ Taylor says. Pollock refined his technique over his career, increasing the fractal structure of the paintings… A subconscious perception of the fractal quality may explain Pollock’s popularity.”</cite>\n\nVery interesting stuff… read about Rembrandt too!\n\n"
    },
    {
      "time": " 19 December, 2005 - 7:05pm",
      "content": "for all you wanna be artists, I liked this a lot\n\n[http://weblogs.asp.net/alex\\_papadimoulis/](http://web.archive.org/web/20051221035038/http:/weblogs.asp.net/alex_papadimoulis/)\n\nok seriously though, that fractal stuff …cmon!!\n\n"
    },
    {
      "time": " 19 December, 2005 - 7:20pm",
      "content": "_Like a lot of British and American artists of his generation (early and mid 20thC) Jones was engaged with modernism, but not to the extent of “European” modernism. In other words, those Brit artists tended to abstraction, because it was contemporary and modern, but were never able to let go of representation._\n\nI suppose this might be true of many British artists of his generation, but it is a misinterpretation of Jones. I’ve read just about everything he ever wrote, and there is little interest in modernism and certainly no attraction to anything for being ‘contemporary and modern’. His ‘theoretical’ engagement, insofar as he had one, was with the neo-Thomist aesthetics of Jacques Maritain, which he first encountered and discussed while part of the Pepler/Gill community at Ditchling.\n\n"
    },
    {
      "time": " 19 December, 2005 - 10:03pm",
      "content": "\\>there is little interest in modernism\n\nJohn, Jones was part of the UK art scene in the mid 20th century.  \nArt is a language of its own, apart from any one artist’s theories, motivations, or self-awareness. He wouldn’t have painted like that at any other time (and have recieved the status and recogntion he did).\n\nAn artist painting like that before the Great War would have been thought too foreign, and after the mid 1960s, too old-fashioned. So he was involved with the modernisation of British art, in getting it from naturalistic representation to abstraction, pop art, minimalism, conceptual, etc.\n\nWhen I say that he was contemporary and modern, I’m saying that he was a man of his time, of his own culture. He was engaged with modernism, recognized as such as one of the dozen or so painters profiled in the series “Penguin Modern Artists” in the 1940s. If you had shown his paintings to anyone in Britain from the 30s to the 60s, they would have said “that’s modern art”.\n\nI think I’m agreeing with you, in so far as I’m saying “not to the extent of European Modernism”, and you’re saying “in so far as he had one”\n\nIt’s interesting, speaking of Neo-Thomism, that Neo-Platonism, a philosophical movement in France in the late 19th century, was very influential to many avant-garde artists, leading von Doesburg to Neo-Plasticism, and the break with representation.\n\n"
    },
    {
      "time": " 20 December, 2005 - 1:20am",
      "content": "The point I want to make about Jones is that he was not a good fit with ‘his own culture’. Yes, his art belongs to the modern moment, but his concerns are frequently at odds with most of his contemporaries. I have no difficulty calling him a modern artist, but that seems to me to be a different thing from modernist. I also think that his way of painting was quite unique, in many ways the visual equivalent to his way of writing. And of course he was one of very few people in history to have made a signficant impact in both the visual arts and literature, and this dual activity also set him apart from most of his artistic contemporaries.\n\n"
    },
    {
      "time": " 20 December, 2005 - 4:35am",
      "content": "I found it interesting to see a discussion of Cy Twombly on a forum about typography and related subjects. I guess if one finds letters or words in anything visual it is fit for discussion here. Firstly, every artist in every time is “modern.” The usage of the word “modern” to suggest something which is new is an invention particular to our time, i.e., the 20th century. Modern has come to mean new, but one might argue that every artist who has ever created work in any period was “modern” in that period. One might also argue that every artist whose work is not modern or “dated” is of an earlier period, like David Jones. He might have been modern in his time, but he is old stuf now, but still a fascinating painter. Secondly, we are all of us here of our own time, therefore “modern.” We are communicating in cyberspace - very modern. I don’t go to museums or art galleries to see work in which I am not interested. But the fact that Twombly has provoked this interest in what is ordinarily a forum for talk about type suggests in fact that “art” which may appear to be extremely irritating to some, or “crap”, is of such modern character that it can stimulate such animated discussion. Perhaps that too is a part of what “modern” art has, the power to stimulate discussion.\n\n"
    },
    {
      "time": " 20 December, 2005 - 4:49am",
      "content": "Just an addenda to my previous comment, something Marcel Duchamp said along the lines of art not being known if it isn’t in the public eye. Great art created in the darkest part of the world, if not “known” is nothing. It is neither good nor bad, it is simply not public. If not public, or, in this case, in a museum or talked about in cyberspace, how can it be of any worth? Isn’t that a part of the package of “modern”, the publicity?\n\n"
    },
    {
      "time": " 20 December, 2005 - 6:31am",
      "content": "From the _Slate_ visual essay: “To be meaningless without being disallowed to be […] might be an apt description of Twombly’s work,” etc.\n\nIt’s what the pieces **represent** , piece after piece, **as** frictive **actions** vis à vis, or relative to, or against the western socio-cultural intstitution of high art—-it’s norms, fascinations, priorities—and the expectations and norm concepts of the general public of art that makes them important.\n\n‘Meaningless’ in referential or self-referential (abstract expressionist) terms is different from meaningless in ‘action-representation’ terms.\n\nRogue efforts in type design and typography must be evaluated along similar lines, according to what they represent as actions within a type-cultural milieu.\n\n ![](http://web.archive.org/system/files?file=)\n\n ![](http://web.archive.org/system/files?file=)\n\n ![](http://web.archive.org/system/files?file=)\n\n ![](http://web.archive.org/system/files?file=)\n\n ![](http://web.archive.org/system/files?file=)\n\n"
    },
    {
      "time": " 20 December, 2005 - 10:00am",
      "content": "Twombly uses classical mythological themes and legible text as well. I think if you read him as an after-the-fact product of the New York school you miss the point. Check his sculpture, and later works with the Day-Glo colors. Not so easy to sum up. You can see an artist with real chops and the ability to nail composition and color that gets tired of his own schtick and works into a more adventuresome direction. Most assumptions made about him are easily debunked by observing his work.\n\n"
    },
    {
      "time": " 20 December, 2005 - 1:46pm",
      "content": "_Modern has come to mean new, but one might argue that every artist who has ever created work in any period was “modern” in that period.”_\n\nThat wasn’t the case with some of David Jones’ contemporaries.  \nThere was a notorious incident at the Royal Academy (London) annual banquet in 1949 when its president, Alfred Munnings (a magnificent painter, BTW), flanked by celebrity dauber Winston Churchill, used the oportunity to thoroughly diss Modernism, going so far as to say that if he met Picasso in the street, he would join with Winnie in putting the boot in.\n\nAt that time, in Britain, that was the majority sentiment. Polarization between modernism and traditionalism as media spectacle. They’re still at it, ennit?\n\n"
    },
    {
      "time": " 20 December, 2005 - 6:46pm",
      "content": "Not sure if nyceralife is still around or not.\n\nSomeone (I think Nick, but I can’t be bothered to read back through) brought up Pollock. There’s a fairly common dialogue throughout modern (read: 20th century) painting regarding the battle of image vs. text. That’s the filter through which a lot of folks understand Pollock’s work. I have to admit it’s the only way I can understand and/or appreciate his work.\n\nAs a bad paraphrase: (1) Modern is that which is without ornament, decoration, or extraneous matter; (2) literary narrative is extraneous to the painted image; (3) the representational(y painted) object is necessarily endowed with narrative; (4) therefore it must be destroyed.\n\nGet pissed.\n\nIMHO, this history is the only context within which to understand Twombly’s work. _As painting_ anyway. Pollock (and some of the other Abstract Expressionists) did a swell job of getting narrative/literature/’the word’ out of the modern image. And now some folks feel it’s time for it to creep back in. Just like modern architecture failed the populace, therefore it’s time to bring other models back into play (which is why so many skyscrapers have to wear party hats shaped like ancient Greek pediments).\n\nTwombly isn’t kow-towing to the Pollock crew by showing that the textual has no place in painting. Nor is he refuting that stance. His work tries to find a place where both modes of communication co-exist. Either everything cancels out and he becomes Sigmar Polke — or the sum is greater than the parts in ways that we plebians can’t comprehend. He’s the modern post-modern.\n\nSo, painting-wise Twombly’s work is highly significant. Otherwise, you’re probably right: it’s nothing but utter crap.\n\n"
    }
  ]
}
