{
  "id": "16894",
  "title": "NOW Bold--The Sans of Time Moves to the DARK SIDE",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Continuing the saga of NOW and following on the heels of [NOW Light](http://web.archive.org/web/20150123031719/http:/typophile.com/node/16147) comes the first sequel \"NOW Bold--The Dark Side Menace!\"\n\nAttached below is a PDF from Dec. 27. I corrected superior and inferior numbers and a few other characters. The fractions now build out of OTF.\n\nComments are welcomed from one and all (See the white glyphs come over--to the Dark Side)\n\nChrisL\n\n ![](http://web.archive.org/web/20150123031719im_/http:/typophile.com/files/now-dark-side.gif)\n\nSee last PDF called \"NOW\\_boldnLight2-22a.pdf\" for latest changes as of 2-21-06  \nMade corrections based on William Berkson's suggestions.\n\n| Attachment | Size |\n| --- | --- |\n| [NOW bold Spanish-Portuguese.pdf](http://web.archive.org/web/20150123031719/http:/typophile.com/files/NOW%20bold%20Spanish-Portuguese.pdf) | 50.46 KB |\n| [Now\\_BoldTpfle12-27-05.pdf](http://web.archive.org/web/20150123031719/http:/typophile.com/files/Now_BoldTpfle12-27-05.pdf) | 98.98 KB |\n| [NOW\\_boldnLight2-22a.pdf](http://web.archive.org/web/20150123031719/http:/typophile.com/files/NOW_boldnLight2-22a.pdf) | 77.37 KB |\n\n",
  "author": "dezcom",
  "time": "19 Dec 2005 — 6:46pm",
  "uid": "3135",
  "comments": [
    {
      "time": "19 Dec 2005 — 7:05pm",
      "content": "There are a few lines of NOW light mixed in with the bold on a few pages but I intend to do a regular and a medium weight as well. The Medium (or Demibold) will no doubt be a better match for the light weight. The Bold will be more suited to set with the regular when it is done.\n\nChrisL\n\n"
    },
    {
      "time": "19 Dec 2005 — 7:51pm",
      "content": "Chris, my first impression...this could be wrong. It looks like you used FontLab's autobold feature. Personally, I'd like to see more stroke contrast. Your thins could go thinner. It'll also increase the legibility particularly in positive contrast.\n\nYou get a thumbs up for even having a small caps in a sans serif face. I can't tell you how much I wish more sans faces had them.\n\n"
    },
    {
      "time": "19 Dec 2005 — 8:05pm",
      "content": "Thanks Terry! I have been fighting with the contrast for weeks. The hard part about doing a family is that you have to make total family allowances even if some of the weights are not as successful as others. I purposely made this bold more bold than its needs to be so that I had a fair extreme for the MM transition. By the way, I started with the FL Bold technique and soon after dumped it because it was so bad.  \nSince I am trying for the appearance of a monoline family, I did not push the contrast as much as if I were doing a bold alone. My guess is that I will have to revisit this bold version after I do the in-between weights. There are things you have to do to keep extremes of a Multiple Master face compatible so that you don't just get a mash of junk for each instance.\n\nI always do Small Caps. I like to give the user plenty of options.\n\nThanks for your help! Keep coming back and check on my progress.\n\nChrisL\n\n"
    },
    {
      "time": "19 Dec 2005 — 9:10pm",
      "content": "I know NOW will never compete with Trajan for movie Titles but here is one that seems to fit the darker side of NOW:\n\n ![](http://web.archive.org/web/20150123031719im_/http:/typophile.com/files/Spaceballs-NOW.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "19 Dec 2005 — 9:13pm",
      "content": "Haha, you're always ready with a good joke even if it is to bump your own thread...a productive bump at that!\n\n"
    },
    {
      "time": "19 Dec 2005 — 9:16pm",
      "content": "\"...even if it is to bump your own thread…\"\n\nWhat's a person to do :-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Dec 2005 — 9:19pm",
      "content": "<cite>What's a person to do :-)</cite>\n\nLaugh at your jokes and then be compelled to critique your work. :-D\n\n"
    },
    {
      "time": "19 Dec 2005 — 9:22pm",
      "content": "Star studded answer David :-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Dec 2005 — 9:27pm",
      "content": "I would lend you my critique but I'm too green in such field and wouldn't be able to give you any solid advice. I'll just do the laughing and watch your creation blossom.\n\n"
    },
    {
      "time": "19 Dec 2005 — 9:30pm",
      "content": "\"I’m too green in such field and wouldn’t be able to give you any solid advice.\"\n\nYou still have 2 eyes right? Fear not.\n\nChrisL\n\n"
    },
    {
      "time": "19 Dec 2005 — 9:59pm",
      "content": "Do you have alternate lc 'g's or are you just testing to see which one works better? The contrast between the light and bold are pretty outrageous, but that's no help really, just thinking out loud. Not much to say sorry!\n\nI like your humor...'ottowoman empire'...haha!\n\n"
    },
    {
      "time": "19 Dec 2005 — 10:14pm",
      "content": "I'm very impressed, Chris.  \nThe balance of stem weights across case and style is something you do nicely.\n\nA few minor things stand out.  \nThe 1 seems a bit too pointy on top, compared to the general feel of the face (the OSF version is better).  \nThe 4, too, is a bit pointy on the left.  \nThe waist of the Oldstyle 3 seems a bit high.\n\nI'm not sure you need f-ligatures.\n\nYour accents could sit lower on the lower case -- the way they align at the top is disconcerting in the slavic, especially when the UC accents are so close. Maybe try the \"bottom alignment\" strategy.\n\nThe l-slash slash could be more discrete.  \n(Your ogoneks rock, dude -- that fine stroke detail is not amiss.)\n\nThe O-slashes too -- I think the slash only needs to protrude a little, and be even on each side.\n\n\\*\\*\\*\n\nIt's a good bold weight, but I'm puzzled why you wouldn't do the Extra Bold first, as the more extreme end of your weight axis. I seem to recall that your other sans face had a very heavy bold.\n\n"
    },
    {
      "time": "20 Dec 2005 — 8:23am",
      "content": "Thanks Nick!  \nYou are right, I'll fix the ones and fours (and the dreaded 3:-).  \nI don't know that I need the f-ligs either but I thought I would put them in because they are \"expected\" to be part of an OTF family (the user can just turn them off I guess). Also, since this is an axis weight, I thought it best to include them to generate the middle instances.  \nI'll pull the lc diacritics down some as you suggest.  \nWhen you say \"l-slash more discreet\" do you mean the slash is too long or too bold?  \nMy O slashes are not done yet. I did not even mean to post them. You are quite right, they look way over-the-top as they are now.  \nRegarding using the Extra-bold or Black as the axis--my experience with Leporello taught me that there is a \"hump\" in the weight range after which different corrections are required (the vertical sides of curves need to be more vertical, more points, and trapping is needed). I fully in tend to do a black weight but will do it after the others are done. I am hoping this will save me time correcting the middle weights. This is my plan but I might be wrong. I'll let you know either way.  \nChrisL\n\n"
    },
    {
      "time": "20 Dec 2005 — 8:31am",
      "content": "Thanks David!\n\nYou are right, the single bowl a and g are alternates. There are folks who prefer them so I just put them in.\n\nRegarding the big jump to the bold--as I said in my second post above, \" The Medium (or Demibold) will no doubt be a better match for the light weight. The Bold will be more suited to set with the regular when it is done.\"\n\nBesides being a fun joke, OTTOWOMAN is a good test word for the T T lig and for kerning. I love it when humor has a purpose as well :-)\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2005 — 9:09am",
      "content": "I am still being very impressed with the whole thing! I think Terry's comments about contrast are right. I think having just a little bit more contrast despite the monoline nature here & there would add some sparkle that I find desirable ( and probably increased legibility ) - especially in bold weights. 'Now light' has a distictive flavour that I miss in the bold. It's as if the font is getting watery in the bold. No matter what you decide about the main forms re: contrast, I really want to encourage you to look at the diacritical marks. This part is me going out on a limb because I am utterly new to the issue - but thats said - my admittedly inexperienced eye seems to prefer more contrast in diacritial marks \\*especially\\*. I think that this is because they need to communicate well in a smaller space than a full letter or something like that.\n\nA probably minor point. On page 4 of the PDF the word 'Woman' appears & the spacing between W and O is really apalling. I am guessing that this is because the kerning isn't done or maybe even started.\n\n"
    },
    {
      "time": "20 Dec 2005 — 9:20am",
      "content": "Chris, I like it, but you need to work more on the spacing:\n\n\"very\" check ry\n\n\"fat\" \"italic\" \"display\" some letter pairs (ta, fa, la) seem to be too tight.\n\n\"Alphabets\" ts seems tight\n\n\"punch\" the space in this word seems to be looser than the average.\n\nThe hypen seems a bit high and heavy, punctuation in general seems a bit heavy but maybe it's a matter of taste.\n\n¿How many weights do you intend to do?\n\nHéctor\n\n"
    },
    {
      "time": "20 Dec 2005 — 9:27am",
      "content": "S --\\> only falling ever-so-slightly to the right\n\nI think the old style 4 appears to be stabbing the 3 in the back. I agree that the waist on the lining 3 seems too high, especially if you look at it next to the lining 4.\n\nThe cedilla below the G (and maybe the R) seems off. I think it is the anal person in me that wants it to have an even space in between.\n\nThe @ seems way to big and bold.\n\n"
    },
    {
      "time": "20 Dec 2005 — 9:27am",
      "content": "Thanks Eben!\n\nI'll take another look at the diacritics and the contrast.  \nThe kerning is \"leftover\" kerning from the Light version so I definitely need to redo it for the bold. The WO compared to the OM definitely needs a visit.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2005 — 9:38am",
      "content": "Thanks Héctor!\n\nI am at that phase where I am deciding what is a kerning issue and what is a sidebearing issue. This always makes me revisit the glyph shapes as well. I will take a hard look at the spacing issues you identified.  \nThe punctuation is up in the air and needs a review, thanks for pointing out the hyphen height. I may need to do a feature for cap vs lc hyphens.\n\nI plan to add an extra-light, a regular, a medium, and a black to the weights I have. I then will do italics for all the weights. I may also do a \"Signage variation\" with larger x-height and more width.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2005 — 9:44am",
      "content": "Thanks Tiff!\n\nAhhh, the \"S\", thank god it is not the \"3\" this time :-) I'll take a look at it.\n\n\"4 stabbing 3\" that will add to the murder rate around here :-) That goes along with Nick's post about pointiness in the 4.\n\nAbout the cedilla, which way is it off?\n\nYou are right. The @ sign needs a major fix.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2005 — 10:21am",
      "content": "Chris,  \nYou really make an excellent first impression with your Now bold. I'd make some remark though.  \nThe \\* and the @ seems to bold compare to the entire typface, espacially for the @ which one could be less large.  \nThe top left part of the e, just beside of the left side near the middle, seems to have a broken curve.  \nThe florin: the inside of the top and the bottom would be better if you use something like your actual f or even the Sterling Pound. Also, the middle bar seems to thick.  \nthe two g are really nice.  \nThe U caps give a great look to your Now.  \nDon't you find the tail of the Q seems to much on the right side  \nThe caps G : may be the stems could be less high.  \nthe ø : I think he is to bold, especially the slant bar.  \nOverall, I really like it. Great work.  \nAndré\n\n"
    },
    {
      "time": "20 Dec 2005 — 10:31am",
      "content": "\\>When you say “l-slash more discreet” do you mean the slash is too long or too bold?\n\nI think it sticks out too much.  \nIn my experience, the l slash does not have to be such a demonstrative accent as the others, and I think the reason for this is that no other accent appears in the middle of the \"l\", whereas other accents appear in positions that are common to more than one.  \nSo for the l-slash, all you have to do is offer the indication that \"there is an accent here\", and not be concerned with showing exactly what its form is. Perhaps rotate it a little counter-clockwise.\n\n"
    },
    {
      "time": "20 Dec 2005 — 10:42am",
      "content": "Bottom right part of 'G' looks too straight to me, tail of 'Q' maybe a bit too long, top left white of 'S' radius doesn't flow like the stylistic approach in 'C' or '?'; 'Z' maybe too trapeze, two extra little edges in 'OE', bottom left (two negatives) 'a' stops my eye, 't' too sharp or 'f' not enough sharp like the nose of (loop) 'g'; '4' looks the lighter among lc figures.  \nOttowomen Empire, lol.\n\nRegards,  \nAS\n\n"
    },
    {
      "time": "20 Dec 2005 — 10:51am",
      "content": "This may be what Tiffany and Nick referred to earlier:\n\n ![](http://web.archive.org/web/20150123031719im_/http:/typophile.com/files/psycho4%20Stabbing3.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2005 — 11:04am",
      "content": "Thanks Andre!\n\nI'll take a closer look at the curve on the e. Right now it seems like the top right point of the lower stroke needs to be slightly more left.  \nThe florin and @ definitely need work.  \nThere was another mention of the tail of the Q. This is a sure sign that it needs a trim.  \nI'll pull down the stem of the G some and fix the o slashes.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2005 — 11:05am",
      "content": "Thanks for the l slash tip Nick, I'll take your advice.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2005 — 11:10am",
      "content": "Thanks Alessandro!\n\nI am not sure what you mean by \"top left white of ‘S’ radius doesn’t flow like the stylistic approach in ‘C’ or ‘?’\"? What is meant by stylistic?\n\nAre you saying I should remove the indents where the OE overlap and make it a smooth line?\n\n\"‘a’ stops my eye, ‘t’ too sharp or ‘f’ not enough sharp like the nose of (loop) ‘g’; ‘4’ looks the lighter among lc figures.\"--I'll take a look at those.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2005 — 12:21pm",
      "content": "Good work Chris,\n\ni am not an expert, but as you said to someone else I do have two eyes,  \nso I will tell you what I saw at first glance, although Nick pointed it out too.\n\nTo me the f-liggs seems too forced and trap too much of my attention,  \nspecially in the fl & ff combinations. I am not sure you need them.  \nI would also say the one stroke a has something to be reconsidered...  \nand that capital Q goes a little wild.\n\nBut, apart from that, congratulations, it looks awesome to me.\n\nGio\n\n"
    },
    {
      "time": "20 Dec 2005 — 1:09pm",
      "content": "Thanks Giovanni!\n\nI'll add your votes on the ligs and the Q to the others--there seems to be a pattern here :-)\n\nI don't know what you mean about the alt \"a\" though? Do you mean I should dump it or make it the primary?\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2005 — 4:25pm",
      "content": "I don't pretend to know Giovanni's mind, but I wonder if it isn't the curve at the top of the a where it goes from horizontal to vertical - I was thinking the transition from thin to thick might be more gradual. But maybe not too.\n\nI have had a hard time figuring how much of what little there is to ask you about is just unfinnished interletter spacing issues rather than letter shape issues. Of course really the two things relate to each other. But I wonder if some seemingly rough areas will smooth out when you do more spacing and some seemingly finnished shapes will turn out to be less done than they seemed at first. I am curious about how you see this. Do you think about it this way - or some other way?\n\n"
    },
    {
      "time": "20 Dec 2005 — 4:42pm",
      "content": "Eben,  \nI go back and forth between interletter spacing and glyph refinement. I don't think either is ever done. I don't just draw glyphs and then just do metrics. Sometimes what looks to me like a kerning issue works out to be an adjustment to the outlines of a few glyphs. What I find helpful is looking at multiple neighbor combinations. Some of the pages in my PDF are just permutations of letter combinations.  \nI don't have very fixed methods and patterns of working. I don't base judgments on theories others have come up with. I pretty much just use my eyes. The trick is not to get too rigid. This may not work for other people. It also may not work for a revival where you are trying to get inside the head of the original designer. Everyone needs to find what works best for them.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2005 — 7:31pm",
      "content": "\"I don’t pretend to know Giovanni’s mind, but I wonder if it isn’t the curve at the top of the a where it goes from horizontal to vertical - I was thinking the transition from thin to thick might be more gradual\"\n\nGreat explanaition. I guess we are both focusing on the same part of that alt a.  \nAgain, not sure you need it, but designwise, i think it is to heavy on the top left curve,  \nmaking to prominent in the top part which makes it unstable... (if this has any sens to you...)\n\nJust an opinion.\n\nGio\n\n"
    },
    {
      "time": "20 Dec 2005 — 7:43pm",
      "content": "Giovanni,  \nI think I understand you now. I will take a closer look at it.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2005 — 9:22pm",
      "content": "May the schwartz be with you on this new weight, Chris.\n\n"
    },
    {
      "time": "20 Dec 2005 — 11:22pm",
      "content": "\\> works best for them\n\nThanks for your explanation both of your working methods in general and your perspective on your font at this point in it's development.\n\nCheers!\n\n"
    },
    {
      "time": "21 Dec 2005 — 6:25am",
      "content": " ![](http://web.archive.org/web/20150123031719im_/http:/typophile.com/files/faoschwartz.gif)\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2005 — 9:48am",
      "content": "Greetings again,\n\nI have just posted a new PDF (number 02 at the top).  \nI think I have addressed everyones suggestions and tinkered a bit more.\n\nLet me know what you think.\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2005 — 12:01pm",
      "content": "Chris,  \nYou work hard and fast.\n\nI don't want to do your job, but I still see the problem with the upper left side of the lc e, although it could be only me. I still found some shrinking in that part of the e. Here a sample of what I would want to say.\n\n ![](http://web.archive.org/web/20150123031719im_/http:/typophile.com/files/e_Now.gif)\n\nYou choose to have a comma different of the apostrophe but I think the comma is a bit to high especially when the comma comes just after the t or the l.\n\nI notice you've made a lots of touch up. Some glyphs (florin,@ for instance) are really nicest in this new version. Good work\n\n"
    },
    {
      "time": "21 Dec 2005 — 12:16pm",
      "content": "Thanks André,  \nAre you seeing it that way at text sizes or just when large? I was concerned with the counter of the e feeling too constricted at text sizes and opened it up to compensate. I do some things in text faces that I would not need to do in display.\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2005 — 12:37pm",
      "content": "First impressions:\n\nThe shape of the W seems a bit much somehow. Partly it is because it seems darker than the other letters. But also I wonder if it has to be quite so wide. There are lots of ways to shift the M around, middle point heights, angles of the sides... I don't presume to say what to do about it.\n\nThe right sidebearing on the lc t seems to need to be wider, the lc c too maybe - but less so. The lc l when you get a 'la' seems tight whereas the lt & le seem good. ca is too tight. ta too. ac seems fine. I wonder if the tail on the l is sligtly too long at this weight. In the word typphile and ultra and biblio it looks fine. But in the word display or black it seems like a problem albeit a minor one. The combo 'fo' seem stoo tight & nf not tight enough. ( from the word information ). re seems tight. ti seems just a little tight. stre is great. jm is a bit loose. tn is tight. tv too.\n\nI don't know if this helps. I have not been exhaustive, that for sure! I am curious if it looks this way to you too.\n\n"
    },
    {
      "time": "21 Dec 2005 — 12:41pm",
      "content": "Eben,  \nIt seems you have been noticing some kerning pairs rather than side bearings. Everything you mentioned as too tight was a kerning pair. Thanks for the info. I'll take another look.\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2005 — 12:49pm",
      "content": "\\>Are you seeing it that way at text sizes or just when large?\n\nI saw that at text size the first time I saw the e. That's why I enlarge it to check what happened there.\n\n"
    },
    {
      "time": "21 Dec 2005 — 1:02pm",
      "content": "\\>kerning pairs\n\nProbably so! Except maybe for the c. The right sidebearing on that seems always to be a tadger bit tight. Being inexperienced it's interesting but tricky to look at this. What do you think about my comment about the lc l? uc M? Anything to it or do you disagree? Overall the main thing I still notice is a slightly irregular rhythm. Otherwise it seems like a pleasingly quirky sans!\n\n"
    },
    {
      "time": "21 Dec 2005 — 2:56pm",
      "content": "I really like this dez! It's got great potential.\n\nI think I might echo another comment here, but the bottom right of the G seems like it doesn't want to be at such an extreme angle. If you could make that angle similar to the one in the U, I think it would really look great.\n\nTiny nitpicking aside... I can see lots of uses for this one when it's perfect! Good job!\n\n"
    },
    {
      "time": "21 Dec 2005 — 3:26pm",
      "content": "Thanks Mike!\n\nI should say \"Howdy neighbor\" too since you are about 15 miles west of me here in Falls Church :-)\n\nBTW, I'll check out the G.\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2005 — 3:53pm",
      "content": "Dez, could you give us some text, Spanish maybe, that we'll see the cedilla on the R G and r g ?\n\n"
    },
    {
      "time": "21 Dec 2005 — 4:31pm",
      "content": "I'll look for something Tiff.\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2005 — 4:41pm",
      "content": "Tiff,  \nIsn't that mostly a French mark?  \nIf you have a loink to some text, I'll use that or email it to me.\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2005 — 5:24pm",
      "content": "Tiff,  \nI just posted a French only PDF but there are very few cedillas.\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2005 — 5:51pm",
      "content": "Tiff,  \nSpanish had slim pickens but Portuguese seems more like it. See the 4th PDF.\n\nChrisL\n\n"
    }
  ]
}
