{
  "id": "16898",
  "title": "Underware Dolly: opinions?",
  "forum": "Design",
  "tags": [

  ],
  "content": "What does everyone think of [Dolly](http://web.archive.org/web/20080111030757/http:/typophile.com/wiki/Dolly) by [Underware](http://web.archive.org/web/20080111030757/http:/typophile.com/wiki/Underware): [http://www.myfonts.com/fonts/underware/dolly/](http://web.archive.org/web/20080111030757/http:/www.myfonts.com/fonts/underware/dolly/ \"http://www.myfonts.com/fonts/underware/dolly/\")\n\nIt looks like a very legible, general purpose font. It has a certain warmth and charm that are tugging at my pocketbook. It’s a rather high-contrast face, which might take some getting used to, although that might do my readers a favour.\n\nFor some reason this face doesn’t get alot of attention. Or maybe I haven’t been around the font scene long enough.\n\nSupposing I do buy this doggy in the window, can anyone suggest a good sans for this?\n\n [‹ Yet another Van Doesburg?](http://web.archive.org/web/20080111030757/http:/typophile.com/node/17368 \"Go to previous forum topic\") [Sans Serif vs. Serif ›](http://web.archive.org/web/20080111030757/http:/typophile.com/node/6137 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080111030757/http://typophile.com/user/9249\" title=\"View user profile.\">Palatine</a>",
  "time": "<br>",
  "uid": "9249",
  "comments": [
    {
      "time": " 20.Dec.2005 8.37am",
      "content": "Check the crit thread/logo and i.d. and look for small gallery mark post.\n\nI’m going this direction with a small university gallery, largely because they need something good for wall text. Here’s my short take on Dolly. It is very legible but also really versatile. The SC has a little different flavor than the Roman. The ital a little different than the roman. The bold, very sweet, but again the range of possible uses is very large.\n\nI’ve paired it with Formata, which has a very different x-height but fills in for tiny text etc. I’m using the combination to provide different looks for different shows, but all within this marriage of the two families. Working well so far. I have some super rough examples posted in the mentioned thread that will give you some idea.\n\n[http://typophile.com/node/16675](http://web.archive.org/web/20080111030757/http:/typophile.com/node/16675 \"http://typophile.com/node/16675\")\n\nCheers\n\n"
    },
    {
      "time": " 20.Dec.2005 8.58am",
      "content": "jupiterboy:\n\nThat was incredibly helpful. Thank you!\n\nI never thought I could wamr up to such a dark typeface. Dolly seems to be darker than other faces. But that doesn’t seem to detract from the detail.\n\nHave you noticed this as well?\n\n"
    },
    {
      "time": " 20.Dec.2005 9.04am",
      "content": "Yes. I like a little less contrast so I’m looking at a Black 7U (K with a little 877 silver) for ink. The darkness of both Dolly and Fomata take a lighter ink in a lovely way. Compare the lower case “t”s of both bolds and you will see the similar genes. Dolly is a crazy mixed drink that somehow doesn’t get you drunk at all. Sturdy and a little schizo, but not in a frightening way.\n\n"
    },
    {
      "time": " 20.Dec.2005 10.52am",
      "content": "Christian,\n\nI’m very surprised to see you describe Dolly as high-contrast. It seems quite the opposite to me. Maybe you were referring to its dark color. I can’t see why it would take getting used to; it’s so warm, humanistic and readable. Maybe you’ve been using sparkly, light faces lately?\n\nThe darkness of Dolly makes it very useful in small sizes and difficult situations. Notice Underware describe Dolly as “A Book Typeface with Flourishes”. So you could expect it to be very durable in small sizes, for extended reading, and it has the right amount of style to be used in magazines.\n\nI must say I think pairing it with Formata is inspired. For alternatives try Underware’s own Auto, or Quadraat Sans, which also is animated like Dolly.\n\n"
    },
    {
      "time": " 20.Dec.2005 11.44am",
      "content": "I’m stumbling over the terminology here. I mean that Dolly is a relatively dark face (and therefore low contrast.)\n\nI’m simply used to using lighter faces, like Joanna.\n\nIn any case, I’m sold on Dolly.\n\n"
    },
    {
      "time": " 20.Dec.2005 12.36pm",
      "content": "If you can get your hands on Indie Fonts 2 it has samples of Dolly printed\n\n"
    },
    {
      "time": " 20.Dec.2005 1.06pm",
      "content": "They will also send you the booklet with a full version of the face for $14.00.\n\n"
    },
    {
      "time": " 21.Dec.2005 7.22am",
      "content": "A little bit of reading for Dolly enthusiasts:\n\n[http://www.creativepro.com/story/feature/21831.html?origin=story](http://web.archive.org/web/20080111030757/http:/www.creativepro.com/story/feature/21831.html?origin=story \"http://www.creativepro.com/story/feature/21831.html?origin=story\")\n\n"
    },
    {
      "time": " 21.Dec.2005 8.47am",
      "content": "I tried to use dolly recently but the client balked because of the fluorishes. It was too lively for him. I think that liveliness is the key to successful or unsuccessful use of it. That said, I think it’s a great font.\n\n"
    },
    {
      "time": " 21.Dec.2005 3.05pm",
      "content": "After printing out the Dolly pdf offered by Underware, this little gem is set to become my main text font for dissertations, reports, etc.\n\nUnfortunately, the small caps don’t come in an italic or bold weight. Perhaps the typical “book face” doesn’t employ those weights, so that might be the reason. No bold-italic, either. And the ligatures are only available separately, upon request.\n\nI can live with all this, though. ;)\n\n"
    },
    {
      "time": " 21.Dec.2005 9.01pm",
      "content": "Dolly is also used in the last issue of [Font](http://web.archive.org/web/20080111030757/http:/www.fontshop.com/virtual/newsletters/font004/). It’s nice. It’s got some good vitality in that it’s not too predictable, but it doesn’t get tired either (like many display faces posing as text faces might become.)\n\nWe set Dolly and [Auto](http://web.archive.org/web/20080111030757/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&startrow=1&records=20&currpage=1&totalrecords=20&searchby=&searchID=&searchletter=&searchstr=auto&font_categories_checkbox=font_name_search&fontRendererText=Hello+Palatine) together and they played nicely together.\n\n"
    },
    {
      "time": " 21.Dec.2005 9.08pm",
      "content": "<cite>Dolly is also used in the last issue of Font. It’s nice. It’s got some good vitality in that it’s not too predictable, but it doesn’t get tired either (like many display faces posing as text faces might become.)<br>\nWe set Dolly and Auto together and they played nicely together.</cite>\n\nI’m fairly certain I picked up a copy of this at TypeCon2005, no? I just registered to get future issues though! Thanks for the link, Joe. I’m a huge fan of Underware’s typefaces after meeting the guys and seeing their work this summer in NYC.\n\n"
    },
    {
      "time": " 22.Dec.2005 10.53am",
      "content": "Christian,\n\nSee [this](http://web.archive.org/web/20080111030757/http:/typophile.com/wiki/Contrast) wiki node for a nice definition of contrast in the context of typography.\n\nDarkness is an appropriate term for the effect you describe. Some faces (digital Centaur, ITC Garamond) appear lighter and some (Dante, FF Clifford) look darker. It’s one of many factors affecting the appearance and readability of a typeface. Poke around in the wiki for more.\n\nThere is always some disagreement about the necessity for bold italic and for small caps with Italic faces. I think opinions typically differ between graphic designers and book designers.\n\n"
    },
    {
      "time": " 22.Dec.2005 11.24am",
      "content": "Haven’t had the chance to play around with it, but Dederon looks a lot like Dolly.  \nHas anyone compared the two in depth?\n\n[http://www.suitcasetype.com/page.php?lmut=en&section=font&font=dederon%2...](http://web.archive.org/web/20080111030757/http:/www.suitcasetype.com/page.php?lmut=en&section=font&font=dederon%20Serif \"http://www.suitcasetype.com/page.php?lmut=en&section=font&font=dederon%20Serif\")\n\n"
    },
    {
      "time": " 22.Dec.2005 1.02pm",
      "content": "crossgrove:\n\nIt seems that “contrast” in the sense of type has more to do with thick/thin, rather than simply darkness/light.\n\nIf one were to thicken up Joanna, for instance, it would look more like Dolly or whatever metal type. “Dark” and “light” seem to be less accurate terms, since they can also refer to the shade of ink being used. You don’t actaully darken a font, but rather, make it thicker so it appears heavier on the page.\n\nAm I making sense now? ;)\n\n"
    },
    {
      "time": " 22.Dec.2005 3.03pm",
      "content": "Well,....\n\nYou’ve grasped the typographic meaning of contrast completely. Didot is high-contrast, Helvetica is extremely low-contrast.\n\nEven if you’re using a yellow ink, Clifford is still darker than Centaur, because it was digitized and spaced that way. It doesn’t refer to a literal gray value. You could easily compare 2 different weights of the same design in terms of their darkness. “The light weight is too light on the page, the Bold is too dark”. The term would be qualified by what you are using it to describe.\n\nA dark tale could be printed on dark paper with a dark typeface in a dark ink, by a pressman in a dark mood, at a dark time in history. In this scenario dark refers to everything, but in different ways. None of these describe making type look thicker or darker on paper. Letterpress printing always carries the possibility of a darker or lighter impression (yet another variable), which can affect the look of the page, independently of the typeface or ink chosen.\n\nNo need to avoid a term like dark, as long as it refers to something specific. For better or worse, typography and type design are full of arcane terminology, and some of it is not intuitive or logical at all. Continue at your own peril.... ; D\n\n"
    },
    {
      "time": " 23.Dec.2005 8.47am",
      "content": "Dolly’s great. I’ve got a tryout license and I love it. I’ve come very close to being able to license it for a job, but budget did not allow.\n\nIt defies traditional book type with its brush-like softness, but it still works well. Perhaps not for a literary work, but in other contexts, I think it holds up for blocks of text. I’m sometimes wary of book face for broader client work because they lack the range of weights that are often called for outside of highly controlled projects, but I’ve spec’ed Whitman (another book face) as a corporate font and had no problems so far.\n\nAnyway, I support your choice. It’s a great family.\n\n"
    },
    {
      "time": " 24.Dec.2005 3.33pm",
      "content": "Haven’t had the chance to play around with it, but Dederon looks a lot like Dolly. Has anyone compared the two in depth?\n\nI’ve noticed that similarity as well and hinted at it in my review of Dederon for the TypeCon2005 booklet. Other people have talked to me about it, but I haven’t had the chance to really compare the two. Maybe an idea for a future Bald Condensed column.\n\n"
    },
    {
      "time": " 24.Dec.2005 9.30pm",
      "content": "“Bald Condensed” . . . that’s a very clever nickname. Especially if it’s a descriptive term. ;)\n\n"
    },
    {
      "time": " 25.Dec.2005 12.15pm",
      "content": "Yup, Yves is a thin bald guy but he can dance :-)\n\nChrisL\n\n"
    },
    {
      "time": " 25.Dec.2005 3.14pm",
      "content": "I’m still sad I missed that, Chris.\n\n"
    },
    {
      "time": " 25.Dec.2005 7.51pm",
      "content": "David,  \nIf you make it to Typecon, I am sure you will Yves in action :-)\n\nChrisL\n\n"
    },
    {
      "time": " 25.Dec.2005 8.47pm",
      "content": "I was at TypeCon 2005 but didn’t attend the party because I had plans with friends in Manhattan that same night.\n\n"
    },
    {
      "time": " 5.Jan.2006 11.28am",
      "content": "Dolly actually got a lot of attention back when it was released - and I think it deserved it. For one thing it was highly accomplished coming from a brand new group of people. But I guess you’re right that it has receded maybe more than one would expect. Maybe because it’s too “happy” for these dark times.\n\nhhp\n\n"
    },
    {
      "time": " 5.Jan.2006 11.44am",
      "content": "The little Korean dog named Dolly - the font’s mascot, is certainly a happy element of this font’s story. I like that sort of thing: symbolism, metaphor, some personal details about the design process, and a fun backstory.\n\nIn any case, Dolly’s a joy to use. It has alot of warmth and character.\n\n"
    },
    {
      "time": " 16.Jan.2006 12.18pm",
      "content": "Does anyone else find the font’s small caps a bit spacious?\n\n"
    },
    {
      "time": " 16.Jan.2006 3.14pm",
      "content": "Spacious as in too wide, or as in over-spaced?\n\n"
    },
    {
      "time": " 17.Jan.2006 7.25am",
      "content": "Overspaced.\n\nBy the way, you find Dolly appropriate for thesis work; but most academics use Latex or (shiver) word processors. I just have to wonder how they’ll get lining figures for footnotes and tabular material - they would have to change evey single number to small caps to get to them.\n\n"
    },
    {
      "time": " 17.Jan.2006 8.59am",
      "content": "Dolly **is** gorgeous.\n\nI think one problem it faced when released is the super-family. People are spoiled now with huge families and forget that they often don’t always need a super-family for the job. So when they see that Dolly comprises only 4 fonts they don’t think — I’m obviously generalizing a little — that this great little family can do all the work they need.\n\n"
    },
    {
      "time": " 17.Jan.2006 10.42am",
      "content": "“People are spoiled now ...they don’t think ... that this great little family can do all the work they need.”\n\nCan you give an example? What can Dolly do that people don’t realize?\n\nI’ve found Dolly to be an eminently usable text font,  \nbut it can’t do all the work I need. The lining figures, for example, leave something to be desired.\n\n"
    },
    {
      "time": " 18.Jan.2006 9.17pm",
      "content": "I was making a leap of a guess across a large gap. :^/ Most [book] typography before our time of the superfamily, was managed with small families. I was generalizing and trying to make the point that even though Dolly isn’t a superfamily it can still perform.\n\n"
    }
  ]
}
