{
  "id": "16893",
  "title": "(x) Two handwritten scripts - Marydale, (probably) custom {Stephen, Mike Y}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I am looking for help on these two fonts, trying to determine what they are:\n\n ![](http://web.archive.org/web/20140825003120im_/http:/typophile.com/files/ScriptFonts.jpg)\n\n",
  "author": "TinyCrumb",
  "time": "19 Dec 2005 — 4:55pm",
  "uid": "10237",
  "comments": [
    {
      "time": "19 Dec 2005 — 5:40pm",
      "content": "1. [Marydale](http://web.archive.org/web/20140825003120/http:/typequarry.com/type.html?sku=016)\n\n"
    },
    {
      "time": "20 Dec 2005 — 8:06am",
      "content": "Thanks! Anyone have any ideas on #2?\n\n"
    },
    {
      "time": "20 Dec 2005 — 8:49am",
      "content": "I searched through the 24 pages of [Script Font ID Guide, Part 11 (Everyday handprinted scripts)](http://web.archive.org/web/20140825003120/http:/bowfinprintworks.com/Script11Pg1.html) and could not find an exact match. Two fonts: Irv (pg 4) and Dlnfont (pg 10) were fairly similar, but that was the best I could find.\n\nThis topic is in our FAQ, I think, and basically it says that these kinds of fonts are too easy and cheap to make, so that examples you see (especially for commercial uses) are very likely custom fonts. Your best bet is to find one with a similar feel, and use that, because you may never find the exact font you saw.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "20 Dec 2005 — 11:02am",
      "content": "I searched through Mike's pages last night as well (the 24 above-mentioned pages plus the 8 of the everyday handwriting), and I didn't see it there either. Nor did I find in on dafont, the place I usually spot free fonts.\n\n"
    },
    {
      "time": "20 Dec 2005 — 11:34am",
      "content": "The bank could have had it hand-drawn and digitized for them.\n\nI've been wondering about the Macy's script font (ubiquitous during the Chrismukkah shop till you drop blitz)\n\n[http://www1.macys.com/?bhcp=1](http://web.archive.org/web/20140825003120/http:/www1.macys.com/?bhcp=1 \"http://www1.macys.com/?bhcp=1\")\n\nI'm guessing it's open t ype since some of the characters match and some don't.\n\n(yes, I know I should start a new thread but I'm too lazy)\n\n"
    },
    {
      "time": "20 Dec 2005 — 12:57pm",
      "content": "Patty - No need to apologize. Tacking onto this thread makes sense because it's a directly related ID. Fonts that look like natural handwriting while maintaining legibility are always useful. Here are a few in the style of that Macy's font:\n\n[FF Market](http://web.archive.org/web/20140825003120/http:/www.fontshop.com/showfont.cfm?fid=FF.10462.0.0)  \n [ITC Schuss Hand](http://web.archive.org/web/20140825003120/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=schuss)  \n [Freehand 575](http://web.archive.org/web/20140825003120/http:/www.fontshop.com/showfont.cfm?fid=BT.107586.0.0)  \n [Handsome](http://web.archive.org/web/20140825003120/http:/www.fontshop.com/showfont.cfm?fid=NS.120661.0.0)  \n [Caflisch Script](http://web.archive.org/web/20140825003120/http:/www.fontshop.com/showfont.cfm?fid=LH.114161.0.0)  \n [Brisa](http://web.archive.org/web/20140825003120/http:/www.veer.com/partner/link.aspx?i=1048&c=4&p=products/typedetail.aspx?image=UMT0000027)\n\n"
    },
    {
      "time": "20 Dec 2005 — 2:44pm",
      "content": "Thanks Stephen. I'm not actually looking to ID the font as much as to understand how it works - characters repeat sometimes and then don't at other times but it is definitely a font, not handwriting. I have not played with open type, is that how it works? That there are alternate characters and ligatures?\n\nSorry if I wasn't clear in my earlier post and thanks for the font suggestions.\n\n"
    },
    {
      "time": "20 Dec 2005 — 4:02pm",
      "content": "You can read more about the Macy's \"Way To Shop\" campaign [here](http://web.archive.org/web/20140825003120/http:/www.fds.com/pressroom/macyseast/media/releases.asp?id=157).\n\nmy favorite part:  \n_\"We discovered that the Macy’s core customer shops with her own rules, strategies and definition of success. The new tagline, Way to Shop recognizes her shopping acumen, congratulates her on a job well done, and makes Macy's the shopping destination for all her needs.\"_\n\ncreepy...I find these types of campaigns so fascinating: how handwriting fonts authenticate Big Company's \"aura\" of a human touch...\n\nbut I digress...\n\n"
    },
    {
      "time": "20 Dec 2005 — 5:24pm",
      "content": "Federated renamed our local Bon Marche chain to Bon Macy's and then to just plain Macy's. Before the final switch they were using a nice, apparently customized, version of Trebuchet, now it's all Myriad - if I wanted to go to an Apple store I'd... ;-)\n\nAlso got harassed by one of their elves for taking pictures in \"Holiday lane\" last year - not a fun experience.\n\nSi\n\n"
    },
    {
      "time": "3 Jan 2006 — 3:00pm",
      "content": "Two more:\n\n[Filzerhand](http://web.archive.org/web/20140825003120/http:/www.fontshop.com/showfont.cfm?fid=EF.119161.0.1)  \n [Feltpen](http://web.archive.org/web/20140825003120/http:/www.fontshop.com/showfont.cfm?fid=LH.102883.0.0)\n\n"
    },
    {
      "time": "4 Jan 2006 — 7:36am",
      "content": "Patty, I'm curious about your Macy's font question, because the only script use I've seen is simply the 'way to shop' phrase. Have you seen this script used with more variety of words and letters? (I couldn't find anything else on the web page link you gave).\n\nAs for your question about how OpenType handles contextual substitutions, the answer seems to be in certain tables that are part of the font files. (This conclusion was inferred from some Google searches using words like 'OpenType, glyphs, contextual and tables). Here is a [Microsoft tutorial on the subject of OpenType files](http://web.archive.org/web/20140825003120/http:/www.microsoft.com/typography/otspec/otff.htm) that is probably way more than you wanted, but it talks about the various tables that are used, including ones controlling glyph substitution. These are what the designers must 'program' in order to define when certain glyphs are used. See [this article about the programming of the 1400 glyphs in House's Ed Interlock](http://web.archive.org/web/20140825003120/http:/www.talleming.com/pages/work/programming/openType/edInterlock/) as an example of what must be done as part of the design of a complex OpenType font\n\n- Mike Yanega\n\n"
    },
    {
      "time": "4 Jan 2006 — 9:48am",
      "content": "It is used like crazy in their print ads, which were totally unavoidable last month in the Times. Some of the characters match up, some don't, there are individualized ligatures and stuff. It may have been customized from someone's handwriting but since it was used for so many different words/phrases it must have been made into a font.\n\nThat Microsoft article is greek to me, but I had read about Ed Interlock before, and seen enough about Open Type to think this might be how they got that script to work.\n\nRe Amy's comment, yes, I've noticed the same thing a lot lately, in Chase banks for example. It's the font equivalent of that soothing voice in the customer service phone trees: Your call is important to us...\n\n"
    },
    {
      "time": "11 Jan 2006 — 12:40pm",
      "content": "Amy, in a proper world, such marketing hogwash  \nwould result in people boycotting the business and a  \npublic \"virtual flogging\". They're basically saying  \n\"shop here if you're a spineless moron.\" But people  \nseem to spend money to hear more of it! :-/ And then  \nthey want these same people to elect governments.  \nI wonder fukking why.\n\nhhp\n\n"
    }
  ]
}
