{
  "id": "16910",
  "title": "Which font to choose?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have to do a work about a typeface. The work consists of a small book about the typeface and the designer. My problem is, that I have to choose from a selection of typefaces where I (A) find the the typeface boring, or (B) I don’t find any background information.\n\nSome of the “better” typefaces from this list:\n\nFutura  \nGill Sans  \nUnivers  \nMeta\n\nAvantgarde Gothic  \nAmerican Typewriter  \nCity  \nChicken Plain  \nOCR-A  \nTrixie\n\nI would love to do a work about OCR-A (can be interesting in terms of graphics), but i can’t find anything about it...  \nWhich typefaces would you consider interesting to work on? And in case you have any information about any of these typefaces (beside of links to websites), please let me know..\n\nThanks in advance, Michi\n\n [‹ Don't shoot me!](http://web.archive.org/web/20081015142711/http:/www.typophile.com/node/17187 \"Go to previous forum topic\") [Looking for a font for my website.. ›](http://web.archive.org/web/20081015142711/http:/www.typophile.com/node/17204 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081015142711/http://www.typophile.com/user/7166\" title=\"View user profile.\">mst0192</a>",
  "time": "<br>",
  "uid": "7166",
  "comments": [
    {
      "time": " 20.Dec.2005 7.39pm",
      "content": "Jesus,\n\nAre you sure you do not find none interesting?  \nCosider Meta. Amazing font from an incredible designer.  \nNot talking about Futura, I mean, Paul Renner and geometric fonts,  \nmore histoy to dive in than ... whatever. Fascinating subject of study\n\nForget Avant Garde, too many posting on typophiles.  \nI love City, maybe because slab serif drive me crazzy\n\nUniverse and Gill Sans... well great fonts and tons of info everywhere.  \nCame on make a choice you like! theres great stuff in your list,  \nand then start your research and you will be surprised how much info you find...\n\nlet us now your choice if other than OCR-A\n\nG.\n\n"
    },
    {
      "time": " 20.Dec.2005 7.54pm",
      "content": "Yeah, I know... I want to avoid the fonts from the “upper” list.. the fonts from the upper list are the fonts where it should be easy to find much info.. but I would prefer to pick one from the lower.. the city would be my second choice..  \nDon’t worry, if I don’t find anything about the fonts from the lower list, i will pick meta.\n\n"
    },
    {
      "time": " 20.Dec.2005 8.13pm",
      "content": "Pick a font where the designer is still alive and is willing to talk to you about their work - I’d go with Sparky’s Chicken - it’s a klassic!\n\n"
    },
    {
      "time": " 20.Dec.2005 9.06pm",
      "content": "that’s what i had in mind too.. you mentioned sparky’s(??) chicken.. regarding my sheet, it’s a font from david carson and betsy kopshina, made 1994.. but i can’t find it online.\n\n"
    },
    {
      "time": " 20.Dec.2005 9.24pm",
      "content": "Maybe - but this was the Chicken I was thinking of...\n\n[http://www.microsoft.com/typography/links/news.aspx?NID=1334](http://web.archive.org/web/20081015142711/http:/www.microsoft.com/typography/links/news.aspx?NID=1334 \"http://www.microsoft.com/typography/links/news.aspx?NID=1334\")\n\nCheers, Si\n\n"
    },
    {
      "time": " 20.Dec.2005 9.49pm",
      "content": "no.. thats the wrong one.. it looks more like a trashy, handdrawn typewriter face.. (with filled bowls)\n\n"
    },
    {
      "time": " 20.Dec.2005 10.49pm",
      "content": "I would go for Avant Garde, Herb Lubalin is a great character to talk about and you can discuss the different incarnations of Avant Garde as well as it’s role in the magazine.\n\nHéctor\n\n"
    },
    {
      "time": " 21.Dec.2005 3.13am",
      "content": "[http://www.identifont.com/show?SR](http://web.archive.org/web/20081015142711/http:/www.identifont.com/show?SR \"http://www.identifont.com/show?SR\")\n\n[http://www.recogniform.com/ocra.htm](http://web.archive.org/web/20081015142711/http:/www.recogniform.com/ocra.htm \"http://www.recogniform.com/ocra.htm\")\n\n[http://homepages.cwi.nl/~dik/english/codes/charrec.html](http://web.archive.org/web/20081015142711/http:/homepages.cwi.nl/~dik/english/codes/charrec.html \"http://homepages.cwi.nl/~dik/english/codes/charrec.html\")\n\n"
    },
    {
      "time": " 1.Jan.2006 4.01pm",
      "content": "I decided to do the work about Avant Garde.\n\nWhile I found some examples where you can see the font in use (Travis CDs, Adidas Logo, etc.), I am still searching for pages of the magazine (for which the font was made) and general information about Lubalin...\n\nI looked through some typography books, but I didn’t find anything beside of his biography..\n\nIf you have any information which could be usefull, please let me know..\n\nThanks,  \nMichi\n\n"
    },
    {
      "time": " 1.Jan.2006 4.16pm",
      "content": "[http://81.64.51.158/web-herb-lubalin/index.html](http://web.archive.org/web/20081015142711/http:/81.64.51.158/web-herb-lubalin/index.html \"http://81.64.51.158/web-herb-lubalin/index.html\")\n\nHéctor\n\n"
    },
    {
      "time": " 1.Jan.2006 5.41pm",
      "content": "Of all the typefaces you could have chosen on the list you showed us, ITC Avant Garde Gothic is currently the most controverial and misrepresented type design whose true origin is masked behind myth and “marketing spin”. In other words, most of what you will find “published” on AGG has been “glamorized” in order to continually remarket a typeface that was never meant to be a typeface.\n\nIf you search Typophile and Typographica (typographi.com) you will find conflicting viewpoints on both the expansion of the type family and even the viability of its usefulness. Unless you are willing to really dig behind all the bullsh\\*t, your project will just be dumped into a cesspool of criticism.\n\nBesides basic research, if you could interview some of Lubalin’s contemporaries and get some yet undisclosed background on how the design really evolved from the magazine’s cover to a full upper and lowercase type family released by ITC, then that would really be a story to tell.\n\n"
    },
    {
      "time": " 1.Jan.2006 8.06pm",
      "content": "Actually, considering Avant Garde Gothic made its debut on Ralph Ginzburg’s magazine in January of 1968, we should be calling it Après Garde Gothic by now.\n\n ![](http://web.archive.org/web/20081015142711im_/http:/www.typophile.com/files/avant2_mag.jpg)\n  \n_Avant Garde #2 March 1968 - Marilyn Monroe Cover._\n"
    },
    {
      "time": " 2.Jan.2006 12.31pm",
      "content": "great link, héctor! exactly what I am looking for..\n\n"
    },
    {
      "time": " 2.Jan.2006 1.07pm",
      "content": "I agree with you in all points..\n\nI think there was a statement which said that the only good application of the font was at the logo itself..\n\nBesides that the typeface is unusable for copy text, it has also a very restricted use as display/headline face (i hope you know what I am trying to say with my bad english ;))\n\nFor the work i have to do, the most important thing is that I choose a font which is interesting to talk about (and what could be a better choice than a controversal typeface like this).\n\nI am interested why people still buy a typeface like this nowadays - and there have to be many people because otherwise the foundries wouldn’t republish/update the typeface.\n\nWhere do you see the Avantgarde Gothic in use (except of works which deal with the late 60ies / early 70ies / spaceage, etc.)? Have you seen the typeface in contemporary publications?  \nI would be interested in getting to know in which situations / for which projects you would consider this typeface..\n\nThanks for all your input so far,  \nMichi\n\n"
    },
    {
      "time": " 2.Jan.2006 2.06pm",
      "content": "— HBO has used it several times last year —\n\n ![](http://web.archive.org/web/20081015142711im_/http:/www.typophile.com/files/AGG_hbo.jpg)\n\n— Prominently used on [New Zealand’s banknote](http://web.archive.org/web/20081015142711/http:/typophile.com/node/10174).\n\n— Yet another [article on AGG](http://web.archive.org/web/20081015142711/http:/www.graphic-design.com/Type/Avant/).\n\n— Comments (started by [Mark Simonson on Typographica](http://web.archive.org/web/20081015142711/http:/typographi.com/001029.php)) on ITC’s recent release of Avant Garde Gothic Pro.\n\n"
    },
    {
      "time": " 2.Jan.2006 2.13pm",
      "content": "The older stuff is still much nicer:\n\n ![](http://web.archive.org/web/20081015142711im_/http:/www.typophile.com/files/picassogravure2AGG.jpg)\n  \n\n ![](http://web.archive.org/web/20081015142711im_/http:/www.typophile.com/files/2AvanteGardeAfro.jpg)\n\nChrisL\n\n"
    },
    {
      "time": " 2.Jan.2006 2.20pm",
      "content": "_I am interested why people still buy a typeface like this nowadays_\n\n1. It is evocative, and they like nostalgia.  \n2. They can’t be bothered to work with new faces, finding it easier to slip into proven cliches.  \n3. It’s fun to play with the alternates.  \n4. It’s rewarding to take a classic for a spin - at least once.  \n5. They bought the hype, and hope some of the Lubalin glamour will rub off. Let’s face it, type designers (with the exception of one or two rock stars) are a dull bunch.\n\n"
    },
    {
      "time": " 2.Jan.2006 2.27pm",
      "content": "“Let’s face it, type designers (with the exception of one or two rock stars) are a dull bunch.”\n\nLOL!!! Ah, the truth hurts :-)\n\nChrisL\n\n ![](http://web.archive.org/web/20081015142711im_/http:/www.typophile.com/files/rock-star-type.jpg)\n\n"
    },
    {
      "time": " 2.Jan.2006 7.02pm",
      "content": "Sorry about staying with Trajan. Much to my surprise, that is what the original “ [Rock Star](http://web.archive.org/web/20081015142711/http:/rockstarmovie.warnerbros.com/index_noflash.html)” movie used. :-)\n\nChrisL\n\n"
    },
    {
      "time": " 3.Jan.2006 1.05pm",
      "content": "Just call me Slowhand.\n\n"
    },
    {
      "time": " 3.Jan.2006 3.34pm",
      "content": "“Just call me Slowhand”\n\nYou go Eric and I’ll just start Clappin :-)\n\nChrisL\n\n"
    },
    {
      "time": " 11.Jan.2006 10.26am",
      "content": "Lawson’s opening phrase of page 209 comes to mind.\n\nMichael, forget AG (the both of them). OCR-A would  \nbe an interesting choice. There’s tons about it, like  \nin serious journals such as Visible Language.\n\nAnd here’s some tantalizing trivia about it:  \nNewlyn’s Missionary was based on it! Strange  \nbut true. Maybe you could address the two as  \n“sensible-twin/crazy-twin” fonts. Teacher will  \nlike that for sure.\n\nhhp\n\n"
    }
  ]
}
