{
  "id": "16933",
  "title": "Missing character in Storm Open Type character set?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am considering Storm Open Library for purchase and was looking through their character sets, as no font is of any use to me unless it has characters with Baltic diacriticals. It surprised me to see that the sample of Jannon character set @ [http://www.pismolijna.cz/pdf/JBWset.pdf](http://web.archive.org/web/20061116085700/http:/www.pismolijna.cz/pdf/JBWset.pdf) (page 17) included characters with almost any diacriticals, except Z with the “upside down roof” (sorry, I have no idea for the correct term in English, but it looks like \\/ over the character), which is quite common even in simple font sets. Is it a mistake or it really isn’t there (I really need that char, so it would blow away all my true drooling over the CD :D) ?  \n Edit: other character sets presented there don’t have the aforementioned char as well.\n\n",
  "author": "<a href=\"user/1909\" title=\"View user profile.\">mncz</a>",
  "time": "<br>",
  "uid": "1909",
  "comments": [
    {
      "time": " 22 December, 2005 - 7:02am",
      "content": "The easiest and probably the best way to clear this would be to contact František Štorm himself, me thinks.? :)\n\nDav\n\n"
    },
    {
      "time": " 22 December, 2005 - 7:09am",
      "content": "How?\n\n"
    },
    {
      "time": " 22 December, 2005 - 7:28am",
      "content": "[stormtype@iol.cz](mailto:stormtype@iol.cz)\n\nThere you are.\n\nFranta Storm will also be happy to send you a free sample poster. Simply send them an e-mail requesting it. See here:\n\n[http://www.stormtype.com/free.html](http://web.archive.org/web/20061116085700/http:/www.stormtype.com/free.html)\n\n"
    },
    {
      "time": " 22 December, 2005 - 7:32am",
      "content": "\\> How?\n\nyou can travel, but email first:\n\n[mail@stormtype.com](mailto:mail@stormtype.com)\n\n"
    },
    {
      "time": " 22 December, 2005 - 7:33am",
      "content": "mncz, the accent you refer to is the “caron”, and the Scaron and Zcaron (upper- and lowercase) are standard in the ISO 8859-1 character set, although many Western European and American designers didn’t design these glyphs - and the Lslash, Thorn, and Eth - because they were inaccessible with English-langauge keyboards.\n\nAll of which to say: it could be that Mr Štorm has indeed included these basic characters in his fonts, but there was an oversight - aka “mistake” - when generating the glyph tables for the Štormtype site.\n\nAnd I second Fav’s suggestion that you contact Mr Štorm directly. From the site:\n\n© Storm Type Foundry  \nSpalova 23, 162 00 Praha 6\n\nSales Dept.: (11.00 - 18.00 GMT)  \ntel.: +420 736 540 575, 233 337 511,  \nfax: +420 233 337 890,  \n [stormtype@iol.cz](mailto:stormtype@iol.cz)\n\nTechnical support: (13.00 - 21.00 GMT)  \ntel.: +420 602 692 001,  \n [mail@stormtype.com](mailto:mail@stormtype.com)\n\nStorm Type Foundry is a registered trademark.\n\n"
    },
    {
      "time": " 22 December, 2005 - 4:03pm",
      "content": "I have Storm’s Jannon, and my version certainly includes the Zcaron. I checked Sebastian, Serapion, Regent and Walbaum, and they all have it too.\n\n"
    },
    {
      "time": " 23 December, 2005 - 5:35am",
      "content": "Thank you all so much :)). You made my day.\n\n"
    }
  ]
}
