{
  "id": "16938",
  "title": "Should the wiki entry for \"Designers\" be changed to \"People\"?",
  "forum": "Home",
  "tags": [

  ],
  "content": "Yes\n\n 39% (15 votes)\n\nNo\n\n 26% (10 votes)\n\nI don't care\n\n 34% (13 votes)\n\n Total votes: 38 \n\n",
  "author": "paul d hunt",
  "time": "22 Dec 2005 — 2:59pm",
  "uid": "7006",
  "comments": [
    {
      "time": "29 Dec 2005 — 12:41pm",
      "content": "Should \"Designers\" be changed to:\n\n\\_\\_ People\n\n\\_\\_ Lovable Disney Characters\n\n\\_\\_ Inept Lab Assistants named \"Igor\"\n\n--------------------------------------------  \nPaul... just tell us when to stop!\n\n"
    },
    {
      "time": "29 Dec 2005 — 12:27pm",
      "content": "Thank Goodness!  \nBut maybe this is more Abbey Normal?  \nChrisL\n\n ![](http://web.archive.org/web/20130903083945im_/http:/typophile.com/files/IgorABNormal.jpg)\n\n"
    },
    {
      "time": "29 Dec 2005 — 12:15pm",
      "content": "_I am used to your goofy side...  \nThat is why I didn’t recognize you._\n\n ![](http://web.archive.org/web/20130903083945im_/http:/typophile.com/files/goof.JPG)\n\nDon't worry... I'm still the same ol' lovable goofy self.\n\n"
    },
    {
      "time": "29 Dec 2005 — 11:53am",
      "content": "\"Ay Carumba! I waz hoping it waz “above” the normal!\"\n\nI didn't mean that it wasn't nice normal. It is typographically above the normal. I meant it was not showing your comedic self and instead showed your professional self. That is why I didn't recognize you.\n\nChrisL\n\n"
    },
    {
      "time": "29 Dec 2005 — 10:18am",
      "content": "_Your new avatar is, well, normal?_\n\nAy Carumba! I waz hoping it waz \"above\" the normal!  \nBack to the drawing board. :-(\n\n"
    },
    {
      "time": "29 Dec 2005 — 10:05am",
      "content": "Norbert!\n\nI didn't recognize you! Your new avatar is, well, normal? I am used to your goofy side instead of your \"normal\" side :-)\n\nChrisL\n\n"
    },
    {
      "time": "29 Dec 2005 — 9:33am",
      "content": "[Bezier Wrangler](http://web.archive.org/web/20130903083945/http:/typophile.com/wiki/Bezier%20Wrangler)\n\nGlad you finally added the definition in Typowiki.\n\nPeople were wondering what the heck that was at the end of movie credits. ;-)\n\n ![](http://web.archive.org/web/20130903083945im_/http:/typophile.com/files/time-machine2.png)\n\n"
    },
    {
      "time": "29 Dec 2005 — 8:26am",
      "content": "\"and speaking of keeping the wikiup…\"\n\nChrisL\n\n ![](http://web.archive.org/web/20130903083945im_/http:/typophile.com/files/wikiup.jpg)\n\n"
    },
    {
      "time": "29 Dec 2005 — 7:56am",
      "content": "you guys are too much! i love your proposed categories, nick. i'm not sure i'll jump on 'em tho. and speaking of keeping the wikiup...\n\n[Bezier Wrangler](http://web.archive.org/web/20130903083945/http:/typophile.com/wiki/Bezier%20Wrangler)\n\n"
    },
    {
      "time": "29 Dec 2005 — 6:49am",
      "content": "\"...Paul is sort of the wiki-Godfather\"\n\nChrisL\n\n ![](http://web.archive.org/web/20130903083945im_/http:/typophile.com/files/brando-wiki.gif)\n\n"
    },
    {
      "time": "29 Dec 2005 — 12:56am",
      "content": "_If people agree, then I’ll start doing it. I’d like to see the category be a full-fledged research bibliography._\n\nGeorge, please do start it yourself. The WIKI is entirely self-run. There is no \"editorial panel\" or such a thing (although Paul is sort of the wiki-Godfather). It thrives only on individual contributions. The more you \"cross-link\" in your posts, the more likely other authors will likely be to catch the interest…\n\n"
    },
    {
      "time": "28 Dec 2005 — 5:50pm",
      "content": "May I suggest the following categories:\n\n- **Creationists** (in deference to Nick Shinn)  \nThose who conjure up type designs out of nothing, citing no precedents and recognizing no influences;\n- **Intelligent Designers**  \nThose who posit that typeface design is far too complex a process to have happened accidentally, so _somebody_ must have been responsible for the design (although _precisely_ who may remain a matter of theological, philosophical or epistemological debate); and\n- **Evolutionists**  \nThose who acknowledge the design contributions of type designers who came before them, and _adapt_ those designs so that they live on in a new (digital) format (Paul Hunt's Bezier Wranglers?)\n\n_Then_, we could get the courts involved, and let them determine which approach is the superior one...\n\n"
    },
    {
      "time": "23 Dec 2005 — 1:41pm",
      "content": "Well, if no one agrees about the bibliographic thing then I'll shut up about it. But I will make sure there's at least a full name for every author.\n\nIf people agree, then I'll start doing it. I'd like to see the category be a full-fledged research bibliography.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "23 Dec 2005 — 10:29am",
      "content": "_I think the “Books” category should be more bibliographic._\n\ngeorge, the great thing about the wiki is that if you feel you can improve upon it, you can!\n\nIn this particular instance, I wanted to get others' opinions before i made any changes.\n\n"
    },
    {
      "time": "23 Dec 2005 — 10:25am",
      "content": "I think the question should be how the subcategories are handled. Obviously there would be a tremendous amount of duplication if there are separate sub-lists. If there were a method of tagging each entry with appropriate subcategories that would be preferable. I'm assuming there is / would be a way of searching so the user could make their own list, and allow for overlap in the search. I've been putting things in and haven't really used it for that yet.\n\nAnd there's the issue of who is using it. I find my students use Wiki a lot, but my colleagues don't. So I'm not in favor of anything that makes it harder for students to find things, but in favor of anything that makes it more informative.\n\nI also think the list should include everyone involved in type including authors, scholars, librarians, and archivists: Nicolette Gray, Robin Kinross, H.D.L. Vervliet, etc.\n\nI think the \"Books\" category should be more bibliographic.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "23 Dec 2005 — 7:37am",
      "content": "\" maybe there should be a “People” category and then it should be broken down by subcategories such as designer, programmer, etc.\"\n\nExactly what I was hoping for Paul.\n\nChrisL\n\n"
    },
    {
      "time": "23 Dec 2005 — 7:33am",
      "content": "i guess it would be helpful to have lists of all types of people, eh? maybe there should be a \"People\" category and then it should be broken down by subcategories such as designer, programmer, etc.\n\n"
    },
    {
      "time": "22 Dec 2005 — 9:20pm",
      "content": "\\> and the programmer/techie types would be at the top :-)\n\nYes! ;-)\n\n"
    },
    {
      "time": "22 Dec 2005 — 8:55pm",
      "content": "\"I see you’ve listed these in order of status ;-)\"\n\nNah, type designer would be at the bottom and the programmer/techie types would be at the top :-)\n\nChrisL\n\n"
    },
    {
      "time": "22 Dec 2005 — 8:53pm",
      "content": "I guess the point to me is, what are we using the listing for? I was thinking, if I want to find out who designs type, I would go to one list. If I want to find out who in in the type foundry business, I go to another list. With their \"one size fits all\" thing, I would have to read every bio in the list. If it works like a database, you can sort by or search by a field and have just those come up. You can also have multiple listings in the case of Zapf and others.  \nI would have trouble figuring out how I would be listed. I have designed a few type families but have yet to bring them to market. I have been a graphic designer, art director, production manager for a printer, design teacher as well as shoe salesman and steelworker :-)\n\nChrisL\n\n"
    },
    {
      "time": "22 Dec 2005 — 6:46pm",
      "content": "Although I understand the practical point of having \"Type Designers\" as a separate category, I tend to prefer the \"People\" category because it kinds of put everyone on the same level.\n\n"
    },
    {
      "time": "22 Dec 2005 — 6:34pm",
      "content": "I agree with Norbert.\n\nRichard\n\n"
    },
    {
      "time": "22 Dec 2005 — 6:08pm",
      "content": "If anything, you should consider the Typowiki as a growing resource for all things typographic and type related, and as a resource it should be accessible and understandable to visitors.\n\nPersonally, I see no need for many sub-classifications, since for the most part, people involved with type are often multi-disciplined. How many time would you enter Hermann Zapf? Type designer, type educator, typographer, calligrapher, graphic designer (he has done it), husband, etc.?\n\nWhat I do see lacking in our \"Designers\" section are people who have made significant contributions to the futherment of type in aesthetics, education, scholarly-research, marketing, etc., yet have never designed an actual typeface.\n\nThe majority of individuals listed in the \"Designers\" category are actual type designers, a few punchcutters, and a scattering of \"typophiles\" such as [Roger Black](http://web.archive.org/web/20130903083945/http:/www.fontbureau.com/people/RogerBlack), who I don't recall ever actually designed a typeface despite his incredible contribution to the world of type.\n\nLikewise, a person like Aaron Burns (I \"Typowikied\" him but can't find it) should be listed, but not under \"Designers.\"\n\nSo if anything, I see two basic and clear catergories:\n\n- **Type Designers**  \nIndividuals who have a typeface(s) attributed to their design, along with any other of their type related activities.\n\nand\n\n- **Typophiles** (for lack of a better all inclusive definition)  \nWhich is for individuals who have NOT actually designed a typeface, but have made significant contributions to the world of type.\n\nJust my humble opinion.\n\n"
    },
    {
      "time": "22 Dec 2005 — 5:30pm",
      "content": "Getting too specific about this is going to be a horrror show, no offense. This task is like trying to come up with a genre for a band between a few hundred different people. Nobody will agree on the same one. I think it's better to just leave it at one general section.\n\n"
    },
    {
      "time": "22 Dec 2005 — 5:28pm",
      "content": "If it isn't going to make you crazy then divide all you like!\n\n"
    },
    {
      "time": "22 Dec 2005 — 4:28pm",
      "content": "It doesn't make much sense at the moment.  \nThere are several \"type designers\" listed who have never designed a typeface, but do adaptations of other people's designs.  \nThis is rather like calling a person who does an arrangement of someone else's tune a composer.  \nBut I've already flogged that hobby-horse to death, so I voted \"don't care.\"\n\n"
    },
    {
      "time": "22 Dec 2005 — 4:07pm",
      "content": "Yeah, those poor \"foundry 'persons'\"  \n(sigh…)  \n;-)\n\n"
    },
    {
      "time": "22 Dec 2005 — 4:03pm",
      "content": "Chris,\n\nI see you've listed these in order of status ;-)\n\nSi\n\n"
    },
    {
      "time": "22 Dec 2005 — 3:26pm",
      "content": "I would like to see the list sorted by kinds of stuff:\n\nGraphic Designer  \nType Designer  \nTypographer  \nProgrammer/techie  \nEditor/Publisher  \nArt Director  \nPrinter  \nFoundry \"person\"\n\nChrisL\n\n"
    },
    {
      "time": "22 Dec 2005 — 3:20pm",
      "content": "I am conflicted about it -okay thats overtsating the case - I want there to be both categories because specificty is helpful in a reference. But it seems like it would be a lot of work to have the the larger list & the smaller list too. I am assuming all 'Designers' go in 'People'. And saying 'designer' seems like a potentailly arbitrary cut off. How would you apply the term?\n\nSo I need a 4th radio button - \"What does it mean when I choose 'yes' or 'no'.\"\n\nI don't care takes care of itself.\n\n"
    }
  ]
}
