{
  "id": "16947",
  "title": "Re-learning handwriting",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I feel that 10 years of almost exclusively computer-based writing have reduced what is left of my handwriting to an illegible and clumsy mess and quite frankly, I have had enough of it. I think I need to learn handwriting anew, from scratch, as it were, until I like what I see when I write by hand once again and until I (and of course everyone else) can decipher it as well. Does anyone have links to websites and books on handwriting/calligraphy etc. that might be of use in my quest?\n\n",
  "author": "refusenik",
  "time": "23 Dec 2005 — 7:49am",
  "uid": "2509",
  "comments": [
    {
      "time": "23 Dec 2005 — 8:25am",
      "content": "Hey, if you're going to re-learn, do it with a little [style](http://web.archive.org/web/20141021163527/http:/www.zanerian.com/).\n\n"
    },
    {
      "time": "23 Dec 2005 — 10:01am",
      "content": "Check out Dwiggins' handwriting, it's the most beautiful printing (not cursive) I've ever seen. If I were at home I'd post an image from WAD to RR, but I'm not and won't be for a week. Maybe someone else could help.\n\n"
    },
    {
      "time": "23 Dec 2005 — 11:30am",
      "content": "[http://www.2020site.org/writing/index.html](http://web.archive.org/web/20141021163527/http:/www.2020site.org/writing/index.html \"http://www.2020site.org/writing/index.html\")\n\nThis site is a nice starting point. Very nice capitals, if you ask me.\n\nI've done the same thing as you, btw. It's well worth to remember that this is very much a project that you can teach yourself without any instruction, if need be. Just sit down, rethink your letters, practice a lot and repeat.\n\nThe real problems come when trying to write your new handwriting quickly, something I haven't yet managed.\n\n"
    },
    {
      "time": "23 Dec 2005 — 12:03pm",
      "content": "After studying these lessons\n\n[http://briem.ismennt.is/4/4.1.1a/4.1.1.1.quick.htm](http://web.archive.org/web/20141021163527/http:/briem.ismennt.is/4/4.1.1a/4.1.1.1.quick.htm \"http://briem.ismennt.is/4/4.1.1a/4.1.1.1.quick.htm\")\n\nI am no longer the only person that can read my handwriting. Also,  \njust taking a moment before I place pen to paper to remind myself that  \nI can't write as fast as I type has made a vast improvement as well.\n\n"
    },
    {
      "time": "23 Dec 2005 — 2:11pm",
      "content": "Ah, that's very helpful from all of you, thanks a lot. I think I like the Briem method the best so far. Again: Many thanks and happy holidays!\n\n"
    },
    {
      "time": "29 Dec 2005 — 7:38am",
      "content": "There are many decent books on this subject and a few excellent ones too.  \nI like The Italic Way to Beautiful Handwriting by Fred Eager because  \nit has a solid italic model and a practical \"cursive\" mode as well.  \nI'm guessing it's out of print but I've seen many used for a few  \ndollars. Be sure to check in the Craft section of your local used  \nbookstore as calligraphy (or writing in this case) usually falls into  \nthis section. Again, there are many others including the classic stuff  \nfrom Alfred Fairbank.\n\n"
    },
    {
      "time": "29 Dec 2005 — 8:55am",
      "content": "You're not alone! Talking to my brother last night--who has never had to write much of anything by hand--and he said he sometimes forgets how to make certain letters. Has to consciously stop and think, then continue writing. (He also can't spell because spell check always does it for him.) I was truly surprised, but I guess it's not that uncommon. If you don't use it you lose it...\n\nK.\n\n"
    },
    {
      "time": "29 Dec 2005 — 12:55pm",
      "content": "Sweet. I'm happy enough with [the way I print](http://web.archive.org/web/20141021163527/http:/www.soubriquet.net/exp/2005/52.php \"photo of my printing...\"), but...well, I won't even get started on my cursive. (Boo.) Thanks to refusenik for asking and everyone else for responding! (:\n\n"
    },
    {
      "time": "1 Jan 2006 — 6:41pm",
      "content": "My cursive is terrible. I mean really terrible. Thanks computer.\n\nSide note: Does anyone else have trouble distinguishing the text links in the posts here? I can barely tell the difference. They really need to be red, instead of the grayish blue they are now. Or, at least, underlined.\n\n"
    },
    {
      "time": "10 Jan 2006 — 8:54am",
      "content": "Good for you. Good handwriting is good craft.  \nJust please don't a make a font of it later on.  \nThat would be not good.\n\nhhp\n\n"
    },
    {
      "time": "10 Jan 2006 — 11:10am",
      "content": "Somewhat related to the subject, this is a fun little read: [Sweet Roman hand: Five hundred years of italic cursive script](http://web.archive.org/web/20141021163527/http:/www.amazon.com/gp/product/B0006ATALY/qid=1136920409/sr=8-2/ref=sr_8_xs_ap_i2_xgl14/104-2225355-0808721?n=507846&s=books&v=glance).\n\n_Just please don’t a make a font of it later on_  \nparty-pooper! ;)\n\n"
    },
    {
      "time": "10 Jan 2006 — 11:16am",
      "content": "Surprised that no one mentioned Kate \"Handwriting Repair\" Gladstone - famous for posting handwriting related news to Typo-L with extremely long subject lines on issues that most Typo-L'ers were not particularly interested in.\n\n[http://www.global2000.net/handwritingrepair/](http://web.archive.org/web/20141021163527/http:/www.global2000.net/handwritingrepair/ \"http://www.global2000.net/handwritingrepair/\")\n\nThe phrase \"Website repair\" springs to mind ;-)\n\nCheers, Si\n\n"
    },
    {
      "time": "10 Jan 2006 — 1:58pm",
      "content": "\\> party-pooper! ;)\n\nGuilty as charged, I know. :-/\n\nSimon: I hate you. I had finally managed to forget about Kate!\n\nhhp\n\n"
    }
  ]
}
