{
  "id": "16965",
  "title": "Mixing Bodonis",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m designing a business card and want to use a Bodoni. I love the [Bauer Bodoni sc&osf](http://web.archive.org/web/20080306071755/http:/www.myfonts.com/fonts/linotype/bauer-bodoni/roman-small-caps-and-oldstyle-figures/), but I don’t like the Bauer Bodoni roman. I do like the [Monotype Bodoni roman](http://web.archive.org/web/20080306071755/http:/www.myfonts.com/fonts/agfa/bodoni-mt/).\n\nDo you think it would be in bad taste to pair the Monotype Bodoni roman with the Bauer Bodoni osf?\n\n [‹ Similar, complimentary font to Gill Sans](http://web.archive.org/web/20080306071755/http:/www.typophile.com/node/17162 \"Go to previous forum topic\") [logo & typography ›](http://web.archive.org/web/20080306071755/http:/www.typophile.com/node/17155 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080306071755/http://www.typophile.com/user/7183\" title=\"View user profile.\">otterhound</a>",
  "time": "<br>",
  "uid": "7183",
  "comments": [
    {
      "time": " 28.Dec.2005 7.58am",
      "content": "No doubt about it  \nUsing so many Bodoni ‘s on one visiting card is always dangerous because the text tend to become heavy & difficult to read.  \nRegards\n\n"
    },
    {
      "time": " 28.Dec.2005 8.47am",
      "content": "Depending upon the pt size of the type, the serifs on the Bauer Bodoni — and eventually if too small on the Monotype Bodoni — will disappear. You might consider using [ITC Bodoni](http://web.archive.org/web/20080306071755/http:/www.myfonts.com/search?search%5Btext%5D=ITC+Bodoni), incorporating the various sizes. This would, I would guess, answer your needs and give you the options without having to mix and match from two different families.\n\n"
    },
    {
      "time": " 28.Dec.2005 9.07am",
      "content": "Berthold Bodoni is probably your best bet.  \nIt has sufficient heft for small text, and includes SC&OSF in the family.  \nFilosofia is another Bodoni revival worth considering.\n\n"
    },
    {
      "time": " 28.Dec.2005 9.20am",
      "content": "I just finished a letterhead biz card job in Berthold Bodoni 2 weeks ago. As Nick says, it has all the bits.\n\nBauer Bodoni is quite lovely but does not hold up in small sizes. I always wondered if when Bauer was digitized, it was drawn as it was for hot metal where the hairlines would build up with ink-spread. No letterpress, no ink-spread. Bauer still looks luscious as a display face though.\n\nChrisL\n\n"
    },
    {
      "time": " 28.Dec.2005 10.08am",
      "content": "_I always wondered if when Bauer was digitized, it was drawn as it was for hot metal where the hairlines would build up with ink-spread._\n\nMore likely that a larger size of the type was used as a master.  \nA reasonable decision, considering that the Bauer foundry type Bodoni was the most exquisite version of the face, so if you’re digitizing it, you keep that “brand” quality.\n\nBut enough of Bodoni. Haven’t seen him at TypeCon recently and rumor has it that he’s no longer with us.  \nWhy not check out the new-fangled way of doing things, as selected in [Our Favorite Fonts of 2005](http://web.archive.org/web/20080306071755/http:/typographi.com/) at Typographica?  \nLots of lovely new serif designs, with all the bells, whistles, gongs and glockenspiels you could ever wish for.\n\n"
    },
    {
      "time": " 28.Dec.2005 10.41am",
      "content": "“Lots of lovely new serif designs, with all the bells, whistles, gongs and glockenspiels you could ever wish for.”\n\nNice stuff indeed Nick! But no Bouzouki! :-)  \nChrisL\n\n ![](http://web.archive.org/web/20080306071755im_/http:/www.typophile.com/files/BouzoukiSm.jpg)\n\n"
    },
    {
      "time": " 1.Jan.2006 11.11am",
      "content": "“Depending upon the pt size of the type, the serifs on the Bauer Bodoni — and eventually if too small on the Monotype Bodoni — will disappear.”\n\n—- how small is too small?\n\n"
    },
    {
      "time": " 1.Jan.2006 12.34pm",
      "content": "_But no Bouzouki!_\n\nExcept for Slimbach’s new Garamond...  \n...which also has a few balalaikas, apparently.\n\n"
    },
    {
      "time": " 1.Jan.2006 3.00pm",
      "content": "Very plucky of Slimbach! Thanks for stringin’ me along Nick :-)\n\nChrisL\n\n"
    },
    {
      "time": " 9.Jan.2006 9.43pm",
      "content": "\\> want to use a Bodoni.\n\nIs that because you like it, or because it suits  \nthe business the card is for? If the latter, is it  \nthe business card of a funeral home perhaps?\n\nhhp\n\n"
    },
    {
      "time": " 10.Jan.2006 11.00am",
      "content": "I’m gonna second the Filosofia plug - I think it works really nicely at both small and larger sizes (altho large is a relative term when it comes to business cards, we’re not exactly talking about a billboard) and is a tad fresher than Bodoni which Vignelli used to death.\n\n"
    }
  ]
}
