{
  "id": "16973",
  "title": "Need Help for Corporate Identity Guide",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello typophilers\n\nI work on a corporate identity and have to make the guide.  \nSince it has to be in english and this is not my mother tongue,  \nI need to have some samples. I did a little research,  \nbut I am not satisfied. Also I realized that there is no  \nstandar terminology. For example I found those 3 descriptions:  \nlogo=symbol+signature, Mark=symbol+namestyle and mark=symbol+logotype.\n\nSo if anyone has some good examples please do let me know.\n\n",
  "author": "<a href=\"user/1058\" title=\"View user profile.\">tsoler</a>",
  "time": "<br>",
  "uid": "1058",
  "comments": [
    {
      "time": " 27 December, 2005 - 10:00am",
      "content": "[Here](http://web.archive.org/web/20060705004004/http:/www.chordiant.com/news/download/CSI_Abbr_Styleguide.pdf) is a typical corporate style guide (as found by a Google search). Unfortunately, typical style guides do not contain the breadth of typographic standards one would hope for. I would love to show you some of the comprehensive style guides my agency has done, but we’re under NDA. ;-)\n\n"
    },
    {
      "time": " 27 December, 2005 - 2:01pm",
      "content": "The last time I did a corporate ID guide it took a year for the research and another 6 months to write. The project was well over $200,000 for a small regional thrift bank. Its a major project and not something you can do as a cookie cutter approach. Each industry has different needs and different uses. Good luck with you project.\n\n"
    },
    {
      "time": " 29 December, 2005 - 8:28pm",
      "content": "I’m willing to share work with you that our firm has done, and other work I have collected. Email me, and I can help you further.\n\n"
    },
    {
      "time": " 30 December, 2005 - 10:01am",
      "content": "Try:  \n [http://www.identityworks.com/tools/guidelines\\_and\\_standards\\_manuals.htm](http://web.archive.org/web/20060705004004/http:/www.identityworks.com/tools/guidelines_and_standards_manuals.htm)\n\nHéctor\n\n"
    },
    {
      "time": " 30 December, 2005 - 12:39pm",
      "content": "Kyle, you should create a wiki entry about [Corporate ID](http://web.archive.org/wiki/Corporate%20ID) and share with all of us. :^)\n\n"
    },
    {
      "time": " 7 January, 2006 - 5:17pm",
      "content": "This is one of those things I’ve been thinking about for a long time. Of course there is never any time to write up things like this. And it’s tough when you’re the only designer at a company. Hopefully someday, after reading up on all this stuff from places like this, I’ll get to devote some time to creating standardization documents. :)\n\n"
    }
  ]
}
