{
  "id": "16982",
  "title": "optical sizes for a logo using htf didot, is it overkill?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’ve designed a logo for a company and I’m using HTF’s Bodoni. Do you think it’s overkill if I’m creating logo configurations using the correct sizes of Didot? … requiring the designer to choose the correct file for the required final size. I just finished setting all these files up and now I’m wondering if I’ve made using the logo more complicated than it’s worth.\n\nIn retrospect my typeface choice feels questionable. Think this is at odds with an important function of a good logo, working at all sizes. But maybe that’s all ok … just got some particular usage requirements which aid the goal of looking good at all sizes. [This is a pdf](http://web.archive.org/web/20060504090334/http:/www.thekyostudio.com/vallani/Vallani_logo_cd.pdf) I was going to include with the files on a CD. Then attached that CD inside of a spiral bound booklet with [these pages](http://web.archive.org/web/20060504090334/http:/www.thekyostudio.com/vallani/Vallani_logoBooklet.pdf). I’ve got some kind of weird design remorse from looking at the dang thing too much.\n\n",
  "author": "<a href=\"user/6409\" title=\"View user profile.\">davekaplan</a>",
  "time": "<br>",
  "uid": "6409",
  "comments": [
    {
      "time": " 27 December, 2005 - 1:16pm",
      "content": "The problem might be the capacity of your client to manage this brand system, if they have their own designer this should not be a problem, but if they don’t either you or some other respectable designer will be doing all of their stuff or you will have problems with people using the wrong optical size all the time.\n\nAlso you have to do a clear guide for this thing, I can´t see where you are telling which size is for which usages or size ranges. It has to be clear and simple.\n\nI find the multiple logo configurations to be more problematic than the size ranges, if you choose a wrong size it may not hurt as much as if you have a disjointed logo whose parts will be randomly used. It is very suceptible to an asistematicity.\n\nI would only go for logo configurations A-3 and C-3 and would reserve the symbol for special usages (page 9, second pdf).\n\nHéctor\n\n"
    },
    {
      "time": " 27 December, 2005 - 1:29pm",
      "content": "It’s not overkill.\n\nPre-digital, design firms would supply repro-quality logo sheets with the logo at different sizes, to be used pasted-up size-as in things like pub-set newspaper advertisements, brochures prepared by third parties, eg direct-mail specialists or retail store flyers.\n\nTop designers, working for blue-chip companies, provide standards manuals for logo usage, which are implemented in-house by “logo police”. If something like color can be a big issue for conformity, why not optical size?\n\nAn engineer would be inclined to create a “multiple master” file that displays the correct optical size of the logo, depending on its scaling in the layout/rasterizing application.\n\nBut why should such things be automated? Automation lessens the appreciation for such subtleties, because it removes the necessity for production artists to know and care about such things.\n\n"
    },
    {
      "time": " 30 December, 2005 - 4:16am",
      "content": "It might be easier to encourage proper use if you showed examples which demonstrated why you have chosen to do this, perhaps overlaying the logos at a large size so the differences are obvious.\n\nIt might also be an idea to provide templates in Quark or InDesign for some basic page/ad sizes with the correct logos in place.\n\nIn your booklet provide the file name and the minimum size it can be used, I have included that information in the file name in the past, e.g. bloggs\\_cmyk\\_55mm.eps. I would also include a pdf of the booklet on the CD with a .zip folder(s) of logos so the brand guardian/printbuyer can e-mail the information with any design brief.\n\nTim\n\n"
    },
    {
      "time": " 9 January, 2006 - 9:58am",
      "content": "It’s certainly a wonderful idea, but as Héctor implies it depends on the capacity of the user. Good design always puts itself in the context of the user - otherwise it can backfire, or at least waste your time.\n\nhhp\n\n"
    },
    {
      "time": " 13 January, 2006 - 8:49am",
      "content": "Just want to thank all of you. It was excellent feedback and very helpful.\n\nI’ve got this as the [final pdf](http://web.archive.org/web/20060504090334/http:/www.thekyostudio.com/vallani/Vallani_LogoBooklet.pdf). I think I’ll end up the primary designer for them.\n\nAs a lone designer, it’s nice to get some feedback from individuals such as yourselves. Crit from associates is definitely on the “pro” side of working at a firm or agency.\n\nMuch respect to all of you!\n\n"
    }
  ]
}
