{
  "id": "1698",
  "title": "Do you own your all your fonts?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "What is everyone's view on this? I don't like to buy a font before trying it. I don't feel bad about possessing a lot of fonts that I don't own. However, if I actually use them for a job, I would buy them or charge the client.   \n   \nThoughts?\n\n",
  "author": "planet01",
  "time": "Fri, 2003-10-17 09:05",
  "uid": "2479",
  "comments": [
    {
      "time": " Fri, 2003-10-17 09:51",
      "content": "if you use them and get paid for them, You should pay for them, not your client. Stop Stealing Sheep!\n\n"
    },
    {
      "time": " Fri, 2003-10-17 09:52",
      "content": "How do you get the fonts without buying them?   \n   \nMany years ago someone gave me a bootlegged CD full of Type 1 fonts. I still have the CD, but I don't think I'm using any of those fonts anymore. I do own all my other fonts.\n\n"
    },
    {
      "time": " Fri, 2003-10-17 09:58",
      "content": "i don't like to buy a jet before trying it. i just feel bad that i have too many of them - and no license to fly. still - i like to buy je[s]ts.   \n   \n   \nDavid Hamuel\n\n"
    },
    {
      "time": " Fri, 2003-10-17 11:07",
      "content": "You don't own any fonts: you own a license to use fonts.\n\n"
    },
    {
      "time": " Fri, 2003-10-17 12:07",
      "content": "\\>\\>You should pay for them, not your client   \n   \nIs there a difference?\n\n"
    },
    {
      "time": " Fri, 2003-10-17 15:41",
      "content": "\\>You don't own any fonts: you own a license to use fonts.   \n   \nThat's not completely true. If you made the font yourself you'd own it. If you paid someone to make a font for you the contract could be written in such a way that you'd own it.   \n   \nSi\n\n"
    },
    {
      "time": " Fri, 2003-10-17 22:41",
      "content": "Si, of course you're right that it is possible to own a font, but hopefully from the context of Josh's post I think it's pretty clear that we're talking about buying a user license.\n\n"
    },
    {
      "time": " Sat, 2003-10-18 07:55",
      "content": "\\>Do any other foundries do this for their loyal customers?   \n   \nTerminal Design has arrangements with clients to provide them with fonts under a similar scenario as Joe describes with FontFont.   \n   \nIn fact we are putting together a list of recent clients and will be approaching them with something like this as well.\n\n"
    },
    {
      "time": " Sat, 2003-10-18 14:12",
      "content": "\\>FontFont, on occasion, will make special agreements with   \ntheir trusted customers (often larger agencies) to provide   \ntheir catalogue of fonts for trial purposes. Under the   \nagreement, the agency will try them out and license them if   \nthey get used in a project.   \n   \n   \nI think this is a brilliant idea.   \nIt is a win-win situation for everyone involved.   \n   \nhildebrant.\n\n"
    },
    {
      "time": " Mon, 2003-10-20 09:31",
      "content": "you all pirate software, don't lie. (now where's the button to add a little just kidding wink face??)\n\n"
    },
    {
      "time": " Mon, 2003-10-20 12:48",
      "content": "bb1920 writes:   \nI would like to know (to everyone opposing John's work habits) how many of you own an mp3 file downloaded for free. Be Honest.   \n   \nI own an mp3 file downloaded for free. And you know what? I don't think that makes it right. Therefore, after I download an mp3, one of two things happens: either I don't like it much so I delete it, or I enjoy it so I purchase the album (or purchase the single online at the [iTunes Music Store](http://web.archive.org/web/20050516141040/http:/www.apple.com/itunes/store/)).   \n   \nThis model isn't available for most fonts (except, apparently, at FontFont and Terminal).\n\n"
    },
    {
      "time": " Mon, 2003-10-20 13:01",
      "content": "I use iTunes, I know the artist will get some royalities and its not that expensive and I don't have to deal with confusing stores and pushy personel. Plus the music industry is going after people stealing their property. During the summer here in NYC, a 12 year old girl had to pay a $2000 fine and promise to stop downloading mp3 files. She was one of the examples of what happens when you steal from powerful corporations. Maybe what the type industry needs to do is create an association with the same legal clout as the music industry.\n\n"
    },
    {
      "time": " Mon, 2003-10-20 15:49",
      "content": "\\>I felt shortchanged without getting the cover art.   \n   \nThat's what we need in the font industry: better jewel cases!   \n   \nI truly think the way to go is the \"iFont\" model. There are only 2 small hurdles:   \n   \n1) convincing designers to tell their fonts for a buck;   \n2) convincing designers to pay a buck for a font.   \n   \nThe first would require a leap of faith by font designers: cut the cost of your product by ~95%, then hope like hell you'll sell more than 20x as many.   \n   \nThe second would require a big marketing push, probably kicked off by someone in a black turtleneck.\n\n"
    },
    {
      "time": " Tue, 2003-10-21 05:57",
      "content": "Not wishing to be pious, but every single piece of software on my mac is licensed, and every single font is legit.   \n   \nHowever, I have three MP3 tracks in my entire collection that were not purchased, but thats only because they're not available to buy anymore. The moment I find them 2nd hand though...   \n   \nIncidentally, the current issue of MacUser UK has an interesting Darius cartoon strip on font piracy. I'd scan it in and post it here, but that'd be copyright infringement ;)   \n   \nUnderware's model is the future - plain and simple, trust is more likely to get positive results than spanking. That, combined with careful education in design schools.\n\n"
    },
    {
      "time": " Tue, 2003-10-21 06:10",
      "content": "So how many of you have active design practices that require you to specify type for new and existing clients on a regular basis?   \n   \nI'm not talking about staff magazine and corporate positions, but independent design practices.   \n   \nAnd of those, what commitments are you willing to make to try before you buy?   \n   \nA legal agreement should be the first step, no? Some sort of non-distribution document that is legally binding.   \n   \nWhat else. Trust is a two-way street. You are asking the foundry to trust your good intentions. What do you offer in return?   \n   \nI'm serious.   \n   \nJames\n\n"
    },
    {
      "time": " Tue, 2003-10-21 08:10",
      "content": "Tiffany, iTunes don't only come in mp3 format some of the just released stuff come in mp4 like Lizz Wright's Salt. I have no complaints about the quality of the music. Dan\n\n"
    },
    {
      "time": " Tue, 2003-10-21 08:22",
      "content": "\\> What do you offer in return?   \n   \nMoney, obviously!   \n   \nhhp\n\n"
    },
    {
      "time": " Tue, 2003-10-21 10:53",
      "content": "\\>What do you offer in return?   \n   \nRealistically, all the foundry that offers \"try before you buy\" can expect from the potential client is to accept a \"For Test Purposes Only\" licence agreement.   \n   \nHowever, as Hrant mentions, a small fee might be nice.   \n   \nSo perhaps foundries could offer a service, along the lines of \"For $x per year, you will automatically receive y number of trial fonts per year the minute they are released. Customers of this preferred plan can upgrade to a full licence for a reduced fee.\"\n\n"
    },
    {
      "time": " Tue, 2003-10-21 12:38",
      "content": "Nick are you suggesting something along the lines of what has happened in the stock photo industry? Dan\n\n"
    },
    {
      "time": " Tue, 2003-10-21 12:55",
      "content": "\\> a small fee might be nice.   \n   \nAlthough that could be a great idea, I actually didn't mean anything elaborate. What I was saying is that if you want more people to buy more fonts, trusting them gives them more motivation. The conventional pay-then-get model isn't working for enough people.   \n   \nhhp\n\n"
    },
    {
      "time": " Tue, 2003-10-21 13:54",
      "content": "\\>Nick are you suggesting something along the lines of what has happened in the stock photo industry?   \n   \nWell, I thought it was a fairly original idea, but now that you mention it, I do recall signing up for an arrangement with PhotoDisc in the mid '90s, where they would send me their new catalogs, for a fee, with CDs that contained thumbnails, and a few high-res images. But I don't think they marketed it as a \"preferred customer\" plan.\n\n"
    },
    {
      "time": " Tue, 2003-10-21 13:58",
      "content": "Nick the whole stock photo industry is going on a yearly fee basis. I think you are onto something. Dan\n\n"
    },
    {
      "time": " Tue, 2003-10-21 14:22",
      "content": "\\>_Nick the whole stock photo industry is going on a yearly fee basis._   \n   \nOh really? The whole industry Daniel? Or are you referring to just the 50,000 images for $50 crowd? It's certainly news to [us](http://web.archive.org/web/20050516141040/http:/www.veer.com/) - if it's the _whole_ industry. I'm curious as to whom are you referring to?   \n   \nThe arrangement that Nick is speaking of was (and still is in some cases) a very common practice of stock purveyors to get as much of their product in front of as many eyeballs as possible. The next step to the thumbnail discs was connecting them to the online version of the catalogue. Search. Try. Click. Buy.   \n   \nAn equivalent system for type would be quite a technological accomplishment.\n\n"
    },
    {
      "time": " Tue, 2003-10-21 14:37",
      "content": "Grant, I get a solisitation almost daily saying if I spend $250 I can download unlimited hi rez images per year. Its more than one company, I live in the US specifically Manhattan, so I shouldn't paint with that big a brush. Go to Creative Pro's site there is an example of what I'm refering to. Dan\n\n"
    },
    {
      "time": " Tue, 2003-10-21 14:46",
      "content": "I'm not sure who Daniel was referring to, Grant, but check out [http://www.ablestock.com](http://web.archive.org/web/20050516141040/http:/www.ablestock.com/) for an example of a relatively high-quality stock house using the yearly subscription model. They charge $799 per year (plus $250 for each additional user) for unlimited use of their royalty-free collection. They've got a particularly large collection of people/places/things shot on a white seamless -- handy for publication work.\n\n"
    },
    {
      "time": " Tue, 2003-10-21 14:59",
      "content": "photos.com, liquid Library, Photo Spin, Photo Objects, these are some of the few I came up with in 5 minutes. Its not an arguement just an obversation. Dan\n\n"
    },
    {
      "time": " Tue, 2003-10-21 16:00",
      "content": "I guess I was looking in different places than you were. ![:-)](http://web.archive.org/web/20050516141040im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nGetty, Corbis, Digital Vision, Stockbyte, PhotoAlto, Image Source, Image100 (most of which which we carry at Veer...) and so on, have yet to explore subscription-based supply as far as I've seen. I still think this shows that industry not moving to a single model, but is continuing to split into the high-volume discounters and the more service-oriented providers.\n\n"
    },
    {
      "time": " Tue, 2003-10-21 23:22",
      "content": "Reading this thread has been quite interesting.   \n   \n I would like to offer up an experiment conducted in 1994 (on Honesty and try before you play - or maybe it should be called pay) as part of Richard Kegler's thesis project. A font, \"Duchamp\", was created to be used within the main context of his Master's thesis, [http://www.p22.com/projects/duchamp.html](http://web.archive.org/web/20050516141040/http:/www.p22.com/projects/duchamp.html) this font was only a single minor component of this installation. This font was uploaded to AOL in December of 1993 as a shareware font - caps only, and if you used it in a commercial project or would like the lower case - $10 was charged. (Keep in mind this was the beginning of the internet as we now know it and traffic is not what it is today.) 700+ copies were downloaded by April 1994 and to date 17 \"legal\" copies have been purchased, from the original downloads, before it was pulled. The all caps version is seen even today on commercial products, in advertisements and in print.   \n   \nI am all for trusting your customer, and I continue to feel all intentions are good, but sometimes follow through falls a bit short in the end.   \n   \nWe offer the type caster on our site for all those \"try it before buying\", printable and scaleable, it reduces the \"I might buy it, if I could work with it first\".   \n   \nType designers are not like the record industry, large corporations with their fingers in the pockets of many, many artists in their stables to be able to finance the protection of their intellectual property. Type designers are independents and need to be able to create an awareness of how valuable a font can be, weither it be an identity or a campaign, they need to support each other and work together to promote a unified front - such as the record companies have done with the movie and publishing industries.   \n   \nBut on the other hand, unless an educated consumer (and we have to do the educating) licenses the fonts on their computer, and stops perpetuating the myth - \"if it is on the internet it must be free\", fonts will not have value in the eyes of people who write laws and handle intellectual property enforcement.   \n   \nSorry, for the ramble. Just my two cents worth. and for the record. I have not downloaded a single MP3 or for that matter software I have not bought then and there.\n\n"
    },
    {
      "time": " Thu, 2003-10-23 09:27",
      "content": "That's some great \"field experience\".   \n   \nI actually think 17 out of 700 isn't bad - that's about the typical telemarketing hit rate. Out of the hundreds of people who dowloaded it, how many made money from its usage? Let's be very generous and say 10%. So about 1 out of 4 people using the font to make money\\* paid for it. Maybe it's sad, but that's not bad at all!   \n   \n\\* This is a central distinction because otherwise it's mostly just a curiosity, and very few people would pay money for it - they'd just go get another \"cool\" font that's free.   \n   \nBTW, do you have a way of telling apart the all-caps and the full commercial version?   \n   \nhhp\n\n"
    },
    {
      "time": " Thu, 2003-10-23 10:51",
      "content": "-?/lN?u have a way of telling apart the all-caps and the full commercial version?   \n   \nYes, when we released Duchamp, we modified it slightly and improved upon the spacing.   \n   \nThe funny thing was when Duchamp was available commercially from August 1994-November of 1995 about 4000 copies were sold vs. the 700+ downloaded and 17 paid for.   \n   \nI think the fact it was available as a commercial product in a commercial venue, it was taken more seriously and purchased instead of traded. This is also before our product was available for download and only available as hard copy.   \n   \nWhich brings up the question, While downloading makes things easier, does it promote piracy?\n\n"
    },
    {
      "time": " Thu, 2003-10-23 10:59",
      "content": "\\> about 4000 copies were sold vs. the 700+ downloaded and 17 paid for.   \n   \nSince the sales of the full version were so much greater than even the free download version, there must have been a huge marketing ramp-up; it couldn't have been just a matter of \"perceived value\". So it's like comparing apples and oranges.   \n   \nOn the other hand, I do agree that convenience and lack of physicality sometimes translate to cheapness.   \n   \nhhp\n\n"
    },
    {
      "time": " Fri, 2003-10-24 06:11",
      "content": "Perception is a big motivator in my opinion.   \n   \nI wonder what marketing studies have been done on the modern typography market - if any at all? Is there a study on why people buy type, what value they want ...etc.?   \n   \nIt would be interesting reading. Most companies selling a product focus on the features and benifits of their product - it is cheap, easy to use and so on. But, often times a focus on the product or service misses the mark. Consumers buy for their own reasons.   \n   \nSome of this may seem obvious, but many companies have been surprised when an audit is conducted and they learn that their customers have been loyal for reasons never imagined by the company.   \n   \nBTW, I am refering to companies in general and not type foundries.   \n   \nAnyone have marketing data or reports they can share?\n\n"
    }
  ]
}
