{
  "id": "16996",
  "title": "Artistic solitude",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "So here's a question I've been mulling over -- not exclusively related to type, but I think it relates, because I think there's creativity/artistry involved in type design and typography. Just looking for other perspectives on this.\n\nI'm a writer more than an editor. I find it extremely difficult to write poetry when I've been around others. I require a lot of solitary time to get my head and creative gears tuned to language, and if I'm not alone for long enough stretches, it just ain't gonna happen. Being busy doesn't interfere, as long as I'm alone.\n\nWhat's your take? Do you feel your creative work requires solitude? If so, what do you do to make sure you get it?\n\nKristina\n\n",
  "author": "<a href=\"/web/20110120034423/http://typophile.com/user/9151\" title=\"View user profile.\">Kristina Drake</a>",
  "time": "<br>",
  "uid": "9151",
  "comments": [
    {
      "time": "",
      "content": "The short answer is yes but I will have to think about it more to give you a better answer. I have to figure out what I mean by solitude as opposed to uninterrupted time. Very good observation though.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I don't need solitude in order to design type -- or write, for that matter --, but I think other people may want to keep their distance some of the time. When I get myself into the middle of a design problem, I'm liable to get irritable and cranky until I've found my way back out again. If I have to leave off work on something part way through, I'll be distracted and ill at ease until I can get back to it. But on the other hand I'm happy working away in the middle of a noisy airport terminal, and don't mind having other people around.\n\nIt is a long time since I have written any poetry, but I suspect this would benefit more from solitude than type design or, for that matter, other forms of writing.\n\n"
    },
    {
      "time": "",
      "content": "The way I work is to work on the project for a while with all its distractions, but then take a break and a long walk with my field glasses and bird watch. What this does for me is it allows me to work on the project in the back of my mind. I find I get good results this way.\n\n"
    },
    {
      "time": "",
      "content": "Thanks guys. Trying to accommodate the hermit in me and my responsibilities to the others in my life.\n\nInteresting point, Chris. The difference between uninterrupted time and solitude.\n\nJohn, Yeah. I'm pretty good at being alone in my head in a crowded place. I do well writing in bars and busses and airports, too...It's almost easier.\n\nDan, I think that is essential, too -- Letting the back of your mind handle it for a while.  \nHmmm.\n\n"
    },
    {
      "time": "",
      "content": "A benefit today was I walked in the rain and fed the chickedees, they would land on my hand to get a peanut. The best thing was when a downy woodpecker landed on my hand and stayed for a while. She couldn't manage a peanut or even a half and she was frustrated. I will have to break up peanut halfs to at least quarters to feed the downy woodpeckers. Its all part of the creative process.\n\n"
    },
    {
      "time": "",
      "content": "I tend to get on a roll after midnight when everyone else is essentially disappearing into sleep. I'd say there's an element of solitude in that. Perhaps it's just insomnia.\n\nI think I used to write decent poetry when slobberingly drunk. Of course, my handwriting suffered greatly, adding to the mystique of interpretation. Certainly not condusive to designing type however.\n\n"
    },
    {
      "time": "",
      "content": "Too much distraction and I can't focus on my work - too much solitude and I start talking to the cats. I do my graphic design at home, in solitude and quiet, and I paint in a studio I share with two other people, one very quiet and one who talks a lot. I thought that would bother me but I actually find it nice to carry on a conversation while I paint.\n\nI need the silence when I do graphics mostly because words - either conversation or music with lyrics - interferes with my ability to focus on the type, or the content of what I'm designing.\n\n"
    },
    {
      "time": "",
      "content": "Kristina, you might be interested in Leo Chalupa's response to the 2006 Edge Annual Question: What is your dangerous idea?\n\n[http://www.edge.org/q2006/q06\\_12.html#chalupa](http://web.archive.org/web/20110120034423/http:/www.edge.org/q2006/q06_12.html#chalupa \"http://www.edge.org/q2006/q06\\_12.html#chalupa\")\n\n"
    },
    {
      "time": "",
      "content": "I used to always do my best work after 5:00, when everyone else at the agency went home for the night. (This had the added bonus of a sweet overtime check often!)\n\nNow that I work in an office alone, I don't have that same \"_solitude = extra creativity_\" thing going on, sadly. (Plus no more OT pay... I wonder if there's a connection there?)\n\n"
    },
    {
      "time": "",
      "content": "Yeah, but you can always give yourself a nice big bonus at year's end.\n\n"
    },
    {
      "time": "",
      "content": "John -- I appreciated that link. Funny, a couple of years ago I \\*did\\* spend a weekend in a silent retreat monastery. I spent more of the weekend reading than working as intended on the writing. Hadn't thought of reading being un-silent, but of course it is a dialogue of sorts.\n\nJust last week I had 4 days straight without my kids, or anyone, around. I cleaned, re-did the kids' room, started and finished a novel, and only managed to start writing in the evening of day 3. Day 4 I was going batty, and mostly moped. There goes my solitude theory. Perhaps balance is the key. Outside stimulation to trigger ideas and the time and space to think them through. (Hey, wait a minute. Virgina Woolf already covered some of that... and the money to be able to do it...) ;)\n\nSilas -- Yeah, beware the slobberingly drunk poetry. If you can decipher your writing the next morning, you have no idea why it seemed important.\n\nEngelhardt -- I'd be a horrible self-employed work-from-home person. Something about fluorescent lighting, and padded cubicle walls that makes me productive. Not to mention the exercise I get going down to the first floor to get my coffee. ;)\n\nK.\n\n"
    },
    {
      "time": "",
      "content": "\\> <cite>Yeah, but you can always give yourself a nice big bonus at year’s end.</cite>\n\nPatty -- I wish that were true, but I'm not self-employed. I'm the sole person at a satellite office in a different state from our HQ. So, I still have co-workers; they're just 400+ miles away. Brainstorming concepts via conference call is NOT fun or easy!\n\nBut on the up-side... my boss is 400+ miles away, too! :)\n\n"
    },
    {
      "time": "",
      "content": "\"But on the up-side…\"  \nYou can conference call in your boxer shorts:-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Kristina, interesting topic. I tend to agree that it's  \na matter of balance. I need my space, but when there's  \nnobody to share it with, nobody to serve, the point of  \ndesign recedes for me. Which sort of runs parallel to my  \nview that poetry for example is more about expression  \nthan communication.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_Which sort of runs parallel to my  \nview that poetry for example is more about expression  \nthan communication._\n\nIt is a bit of both and neither, and most importantly something else entirely. Poetry is linked to song, and hence to music, and like music and song it seeks direct emotional and epiphanic connection. What happens at the point of connection varies, but very often it involves a shared insight that is arrived at by the reader rather than, as in expository prose, explained to him. This could be considered a kind of communication, but it is a whole lot more powerful than most of our nattering to each other.\n\nFunnily, I've known a number of fine prose writers who wish they could do what poets do, and a number of good poets who wish they could do what composers do. I'm not sure who composers envy. Maybe angels.\n\n"
    },
    {
      "time": "",
      "content": "\\>I’m not sure who composers envy. Maybe angels.\n\nWhat a lovely thought, John.  \n(I'm a poet who wishes she could do what novelists do -- I can't think that expansively.)  \nI think you're bang on about the reader arriving at a shared insight.\n\n\\>nobody to share it with, nobody to serve, the point of  \ndesign recedes for me.\n\nTrue, Hrant. I think the same is true of writing. If you're not writing from the idea that someone else will read it -- an audience of some kind -- you're basically only \"journalling\". Yes, I write from the need to express, but the drive to connect with others is essential. (Thus my, and every writer's, vain attempts to get their work \"out there\".) Connecting provides validation.\n\nK.\n\n"
    },
    {
      "time": "",
      "content": "\\> When I get myself into the middle of a design problem, I’m liable to get irritable and cranky until I’ve found my way back out again.\n\nLOL -- John, this is too true.\n\nIndeed, I also have to agree with Kristina that being in a busy place -- cafés, parks -- often stimulates the creative juices. I went on a week long canoe trip and packed a journal with the thought that all that open space would provide lots of inspiration, but in fact, I didn't even unpack the journal or my pen the whole trip. For me, spending time away from it all usually prompts me to do nothing at all, but sit and enjoy.\n\n(Though extended breaks have their own benefits.)\n\n"
    },
    {
      "time": "",
      "content": "Poetry: I used to try in my teens. But then I realized it didn't feel right - partly because prosody seemed a barrier more than anything else. Coincidentally, I also don't like lyrics in music. Except \"token\" lyrics, like in some trance music; the banality of such lyrics -in the context of \"pure\" music- somehow seems very fitting to me. And I think it's for the same reason that I adore Soul Coughing. Hmmm, or maybe that's a contradiction... :-)\n\nTo me travel -or, more generally, getting out of one's \"normal\" environment, whatever that means- isn't for creating, it's for absorbing, for \"warehousing\" inspiration, often deep down, which will eventually bubble up. I'm still making shapes due [in part] to a trip to Bangkok many years ago.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "BTW, does anybody else like to watch TV shows in languages he doesn't understand? Is that even related? I used to watch Hispanic TV a lot... until I learned Spanish. Now I watch Korean. Which creates a great unease in wanting to learn that language: I really want to be able to read Hangul, but once I learn it there'll be even less to watch on TV! :-/ Hmmm, maybe I can learn the symbols & sounds but not the language?! I do do that with Russian and Greek already...\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "My co-worker in the cubicle next to me is polish. She has long conversations with her friends and her kids, in Polish of course. It amazes me that although I can only identify 5 or 6 words, I often know what she's talking about. OF course, I'm informed by what I know about events in her life or here at work. Still, the expression, the tone of voice say a lot.\n\nI don't watch TV at all.\n\nI do rent movies, and lately I've been choosing French movies. I get a kick out of following the English subtitles while I listen and I enjoy catching discrepancies in the translation. What gets left out and the subtle variations are often quite interesting.\n\nHrant, it's wonderful that you can dedicate yourself to learning other languages and alphabets. I have yet to get past English and French, and the feeling I'll never master either of them.\n\nK.\n\n"
    },
    {
      "time": "",
      "content": "_What gets left out and the subtle variations are often quite interesting._\n\nmy sister tells me they don't actually say \"fur pie doesn't sell\" in Amelie. I thought that was one of the funniest lines of the movie.\n\nyou know i love bollywood movies, hrant. if i had a hindi tv station you know i'd always be watching it! i tried teaching myself some [devanagari](http://web.archive.org/web/20110120034423/http:/typophile.com/wiki/devanagari) years ago, but didn't apply myself very well.  \ni want to learn enough french to order from a menu and not sound stupid.\n\n"
    },
    {
      "time": "",
      "content": "I read once that Andy Warhol used to have the TV on without the sound and the radio on, at the same time, while he worked. I guess the idea was to have image and sound, but not linked so that they would provide some sort of background noise but not distract him too much.\n\n"
    },
    {
      "time": "",
      "content": "\\> you can dedicate yourself to learning other languages\n\nMy first four languages were forced on me - the only dedication I needed for those was the desparate need -or maybe even just the automatic decision- to stay in school! Spanish is the only language I learned willingly. As for reading scripts without knowing the language, that's just plain fun.\n\nPaul, Indian musicals are nothing short of amazing - the energy and quality  \nis just... wow. And this from somebody like me who normally hates musicals.\n\nBTW, the problems with sounding native are that: it's extremely hard, and even requires some innate talent - I certainly can't manage it with French... or maybe even English; and it's all about listening, not reading, so you can't learn it from a book. TV is actually good that way, so rent French movies like Kristina does... but turn off the subtitles, at least the first time you watch a given movie - you don't need the content to distract you (and reading takes up too much bandwidth to do both well - I think there was even a study that showed you can't really do both at the same time). Learning language is incorrectly considered by most people as requiring formalism - to me it's quite the opposite - it's about letting your brain figure things out on its own, otherwise you'll never really get it. Formal instruction of language could possibly even harm true learning I think.\n\n\\> have the TV on without the sound\n\nOne exercise I like to do is watch a sitcom while consciously blocking out the laugh track: you realize how completely boring the jokes really are. Except when I told this to a friend of mine recently, he exclaimed: \"Why the hell would you want to NOT laugh?!\" He has a point.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_One exercise I like to do is watch a sitcom while consciously blocking out the laugh track: you realize how completely boring the jokes really are._\n\nWhich makes [The Office](http://web.archive.org/web/20110120034423/http:/www.amazon.com/gp/product/B0002W4P98/qid=1137112729) seem even more brilliant, since there is no laugh track. Of course, in that case, the excrutiating emotional pain and embarassment wouldn't be well served by the typical laugh track anyway. As a friend of mine said after watching the first four episodes back-to-back, 'I think I've chewed my thumb off'.\n\n"
    },
    {
      "time": "",
      "content": "\\> my sister tells me they don’t actually say “fur pie doesn’t sell” in Amelie. I thought that was one of the funniest lines of the movie.\n\nPaul, I've been working on that in the back of my mind. Fur pie would be something like tarte/gateau fourré. Fourré can mean both fur-lined and cream-filled. So a \"fur pie\" likely means a cream-filled pastry. ...\n\nK.\n\n"
    }
  ]
}
