{
  "id": "170",
  "title": "Typeface with golden proportions",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Can anyone name a typeface that follows the golden section proportions?   \n   \nThanks in advance.\n\n",
  "author": "Miguel Sousa",
  "time": "18 May 2003 — 6:43pm",
  "uid": "1844",
  "comments": [
    {
      "time": "20 May 2003 — 9:39am",
      "content": "Off the top of my head, I can't name any digital faces that follow the golden section. However, Luca Pacioli, Geofroy Tory and Albrecht D\n\n"
    },
    {
      "time": "20 May 2003 — 3:03pm",
      "content": "I'm not sure, but somewhere I read that Corporate ASF based on the golden section proportions.\n\n"
    },
    {
      "time": "20 May 2003 — 11:11pm",
      "content": "Back when ITC released their Bodoni, their _U&lc_ magazine ran a feature on what various type designers thought made a typeface 'timeless' (or was it 'classic'). I recall that Carol Twombly mentioned that the golden section had a tendency to pop up all over many of the typefaces that we consider classic. An obvious place to start looking is in the proportion of x-height to ascender or cap height.   \n   \nI don't think Carol made it clear whether this frequent occurence of the golden section in type design was due to intention or simply to a good designer's natural feel for pleasing proportions.\n\n"
    },
    {
      "time": "21 May 2003 — 12:14am",
      "content": "seems also that Zapf used the golden section for his Optima or Melior (more on his book: HZ, his design philosophy)?\n\n"
    },
    {
      "time": "21 May 2003 — 6:18am",
      "content": "I have a little booklet from Underware which shows a diagram of Dolly's proportions and explains that   \n   \n_\"De x-hoogte verhoudt zich tot de stokhoogte als de Gulden Snede; a : b = b : (a+b).\"_   \n   \nI don't know a stitch of Dutch, but I'm guessing a rough translation would be \"The relation of the x-height to the ascenders in the Golden Mean.\" Which, upon measuring, indeed it is -- approximately 1.618. The relation to the descender is not quite f, being only 1.6.   \n   \n-- K.\n\n"
    },
    {
      "time": "23 May 2003 — 10:57am",
      "content": "there is a very interesting article (pdf) related to this subject: Cahier GUTenberg 37-38   \n   \nHerman Zapf Typographie des caract\n\n"
    },
    {
      "time": "25 May 2003 — 6:50pm",
      "content": "Want to thank everyone's help. It was precious! ![:-)](http://web.archive.org/web/20131018015638im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nBtw Romesh is right! I found on the page 344 of the german book **Wo der Buchstabe das Wort f**\n\n"
    },
    {
      "time": "25 May 2003 — 9:42pm",
      "content": "On Fibonacci see   \n   \n  [http://www.textism.com/bucket/fib.html](http://web.archive.org/web/20131018015638/http:/www.textism.com/bucket/fib.html)\n\n"
    },
    {
      "time": "26 May 2003 — 12:57am",
      "content": "If anybody is interested I have written an applescript that allow polygonal shape to be scale up or down in the (leonardo da pisa) fibonaci serie.   \n   \nIt works with illustrator 10 in osX, in the past I have used it to define the thickness of some initial and logo...   \n   \nIt can also be use to build different successive generations of whorled shapes: fibonnacci whorl, whorled pentagon, etc.   \n   \nInside the script 1+sqrt5/2 = phi can be easily change to root 2, 3 or 5 series:   \n   \n [http://www3.telus.net/~martinga/goldensection.sit](http://web.archive.org/web/20131018015638/http:/www3.telus.net/~martinga/goldensection.sit)   \n   \nand if you find the subject fascinating like i do then those 2 books are very enlighting:   \n   \nfrom a mathematical mind: gnomon, from pharaohs to fractals (princeton)   \n   \nfrom a designer mind: geometry of design (princeton)\n\n"
    },
    {
      "time": "20 May 2003 — 10:29am",
      "content": "Not sure if they are golden prop material but [here are some D](http://web.archive.org/web/20131018015638/http:/www.myfonts.com/FontForums/read.php?f=5&i=491&t=488&refby=typographica)\n\n"
    },
    {
      "time": "20 May 2003 — 4:57pm",
      "content": "Download a free D\n\n"
    }
  ]
}
