{
  "id": "1702",
  "title": "Readings: Le ma",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello all!   \n   \nThis is my first post here, I'm hoping it's only the first of many more on what seems to be a REAL design virtual community.   \n   \nI've been reading a book recently that talks about the life of Claude Garamond (and many others in that era). It's a very good book (in french only for now) published in 2003, written by Anne Cuneo and called \"Le ma\n\n [‹ Asking for fonts for free](http://web.archive.org/web/20080907035014/http:/typophile.com/node/1463 \"Go to previous forum topic\") [&#34;Font Capture&#34;?! ›](http://web.archive.org/web/20080907035014/http:/typophile.com/node/1711 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907035014/http://typophile.com/user/2485\" title=\"View user profile.\">emilie</a>",
  "time": "<br>",
  "uid": "2485",
  "comments": [
    {
      "time": " 17.Oct.2003 11.49am",
      "content": "Emilie -- Thank you for the post and review of this book. I've heard of this book, and am with those whom are hoping for an English version.\n\n"
    },
    {
      "time": " 17.Oct.2003 11.55am",
      "content": "We have a copy of the book (it is set, somewhat bizarrely, in the titling weight of Ross' 1530 Garamond), but I don't know enough French to read it. I seem to recall Jean-Fran\n\n"
    },
    {
      "time": " 17.Oct.2003 12.02pm",
      "content": "By the way, people were burned for holding and refusing to repent of heretical beliefs, which were expressed in their Bible translations and in other books. The idea that somehow these people were martyrs to intellectual freedom, i.e. that they were burned because they wrote books and translated Bibles, is a modern anachronism. These people had no concept of intellectual freedom, and were just as quick to burn Catholics as Catholics had been to burn them, as seen in Calvin's Geneva.\n\n"
    },
    {
      "time": " 18.Oct.2003 3.12pm",
      "content": "Actually you're right about the book using Ross' Garamond for reasons explained in the preface. If I remember well, I recall they said it might be an exact copy of the original but it's tough to prove.   \n   \nThey're not sure if the original was actually done by Garamond himself or his master Antoine Augereau. Although they believe the italic was made by Garamond.   \n   \nAs for being burnt for translating Bibles, I meant that they didn't translate them the way the Church would have wanted them to. Of course if they had translated in a way that would please the Church, I doubt they would have been burnt.   \n   \nI agree with you the type isn't really working there. It's just another average story book and I'm not sure if using that font really helps although it's somewhat justified by the content.   \n   \nAs for the story, it's not going to give you an inner revolution (although I'm not finished) but it's one of the few stories that involve typography...and it will certainly inspire you to create a few letters. =)\n\n"
    },
    {
      "time": " 19.Oct.2003 6.31am",
      "content": "I wish I had my books in Finland. One of them had material about this very subject. The book was published in the early seventeen hundreds so rather frail. The illustrations had rather striking wood cuts. It is an\n\n"
    },
    {
      "time": " 19.Oct.2003 7.25am",
      "content": "My understanding of the people being burnt was not that it was about content so much as translating the bible from latin to a laymans language.\n\n"
    },
    {
      "time": " 19.Oct.2003 8.35am",
      "content": "(Posted from St Bride Library, London!)   \nI have this book and currently read it. Its not so bad as I imagined. Take it as a novel, no more. It give the ambiance of the century and Paris V quarter at the time. For that, it very fascinating to suddenly be with them everyday. The main voice on this book is Claude Garamond.   \n   \nI'm very disapointed by the type layout on the version I have (the French \"Stock\" publisher version), the Swiss (French too, by \"Payot\" publisher) seems better designed?\n\n"
    },
    {
      "time": " 19.Oct.2003 8.47am",
      "content": "Daniel,   \n   \nI believe you are correct. [http://www.lanstontype.com/TitlePageScribes.html](http://web.archive.org/web/20080907035014/http:/www.lanstontype.com/TitlePageScribes.html) The text dealt with the trouble from about the new printing technology. Nothing in the text itself discussed burnings or beheadings. But there had been material I had seen while researching when designing which alluded to the reluctance of the church to provide materials in laymans language. Also when I was young sermons at the Catholic Church were still only in Latin.   \n   \nI am unaware if that is still the case.\n\n"
    },
    {
      "time": " 19.Oct.2003 10.32am",
      "content": "_My understanding of the people being burnt was not that it was about content so much as translating the bible from latin to a laymans language._   \n   \nI think this is a Protestant myth, as is the idea that the Church did not encourage the 'black art' of printing. The earliest surviving objects printed from moveable type in Europe are certificates of indulgences for the Bishop of Mainz. Gutenberg's Bibles and the F-S Psalter were purchased almost exclusively by churchmen; indeed, you could argue that at the beginning the Church was the only encourager of printing. The first roman types were cut by Schweynheim and Pannartz at the _monastery_ of Subiaco, where they printed for many years before moving to Rome to be closer to their patron: the Holy See. During the spread of Protestantism, printing became all the more important to the Church, and the Council of Trent produced a huge wealth of Catholic publishing in refutation of Protestant teaching. I cannot think of a single time when the Church discouraged printing and publishing (although they certainly denounced specific products of the presses).   \n   \nI have yet to find any evidence of anyone condemned for translating scripture into vernacular languages per se. In every case, the issue was with the nature of the translation and the heretical teachings of the translator or the community to which he belonged. The Catholic response to Protestant Bible translation was not condemnation of all translation, but a substantial programme of publishing approved Catholic editions in the vernacular tongue, such as the famous Douay-Rheims English Bible which is still the translation of choice for many traditionalist Catholics.   \n   \n_Also when I was young sermons at the Catholic Church were still only in Latin._   \n   \nWhen was that? To my knowledge, homilies have never been delivered in Latin to the laity. All the readings of the traditional Mass are in Latin, but the homily is delivered in the vernacular. That is the whole point of the homily: to explain and explicate the text of the readings, which many priests repeat in vernacular at the beginning of the homily, even though most of the congregation has already read the translation in their missals.\n\n"
    },
    {
      "time": " 19.Oct.2003 2.24pm",
      "content": "\"When was that?\" When I was young, nothing other than Latin was spoken. The Priest forgot the homily and now I get to go to hell. John I was just not into getting lectured from a pompous potentate wearing a dress. I was a bad kid.   \n   \nI don't believe the church objected to the sale of the Bible to churchmen. Most of those knowing Latin would be either rulers or churchman, often one and the same. But what if you were not a churchman but just went to church? To \"the common man\" it was merely gobbly gook, still is. Just ask me!   \n   \nThe Gutenberg Bible contains the Latin version of the Hebrew Old Testament and the Greek New Testament, mainly the work of Jerome (c.342-420 AD) who translated some biblical texts from the originals and in other instances revised older Latin translations.\"   \n   \nI believe the problems John would be losing control over the masses. Endangering the Status Quo.   \n   \n.....   \n\"I cannot think of a single time when the Church discouraged printing and publishing (although they certainly denounced specific products of the presses).\"   \n.....   \n   \nJohn, the so called famous Douay-Rheims English Bible was one hundred years after the invention of printing. It simply does not cut the mustard for open source material. Considering in the first fifty years of printing there were over 2,000 different books published this feeble attempt to appease the masses is more than pathetic.   \n   \nSo what did Gods little children read in the meantime?   \n   \nThree hundred and fifty years after the Douay-Rheims English Bible I was suffering through Mass in \"Latin\". Was I supposed to wait for the second coming?   \n   \nSo what was that about? What are \"we\" not supposed to know? Well it worked because I don't have a clue.   \n   \nI think though, not to dilute the point. \"Censor by murder\" by the \"spiritually enlightened\" is a \"big turn off\".\n\n"
    },
    {
      "time": " 19.Oct.2003 4.31pm",
      "content": "[This is long, but arguably on-topic for this forum because it deals with the relationship of _text_ to religion.]   \n   \nGerald, my point about the Douay-Rheims translation was in reference to translation of the scriptures into the vernacular _not_ publishing in general. Luther translated the New Testament into German in 1521, and the Old Testament in 1534. William Tyndale's first English New Testament was produced in 1525, although the first significantly disseminated English Bible was Coverdale's 1535 edition, the first complete English Bible. The most popular and widely read Protestant Bible in English prior to the King James edition was the Geneva Bible, published in 1560. The first Douay, Catholic English edition was published in the 1580s (for the record, I am not claiming that the Douay translation is a very good one: but it is the first English translation of the complete ancient canon of scripture including the Deuterocanonical books removed by the Protestants). And yes, during that 55-60 year gap between Tyndale and Douay, the Church did resist the publication of translations in the vernacular in general; although they did not, as far as I am aware, hand over anyone to imprisonment or death anyone for translation alone, but only for the _crime_ of obstinate heresy.\\*   \n   \nOne should also understand _why_ the Church was concerned about translation of scripture into the vernacular, within the context of an opposing, specifically Protestant theology and culture of personal Bible reading. Protestants believe in a doctrine of _sola scriptura_, that everything that a man needs to know for his religious life is contained within the Bible, that he in fact needs nothing other than his Bible. This is a purely Protestant doctrine, without precedence, and we should recognise the radicalness of it in light not only to the teaching of both the Catholic and Orthodox traditions dating back to the early Church, but also of _Jewish_ tradition. The irony of this doctrine of _sola scriptura_ is that it is not supported by scripture. The Hebrew scriptures of the Tanach (the Christian Old Testament) presume the existence of both the _Torah Shebiksav_ (the written Torah) and the _Torah Sheb_\n\n"
    },
    {
      "time": " 19.Oct.2003 4.46pm",
      "content": "_John I was just not into getting lectured from a pompous potentate wearing a dress._   \n...   \n   \n_So what was that about? What are \"we\" not supposed to know? Well it worked because I don't have a clue._   \n   \nGerald, do you not see the irony of these two statements? You blame the Church for what you do not know, while declaring that even as a kid you dismissed what the Church was trying to teach you.\n\n"
    },
    {
      "time": " 19.Oct.2003 7.12pm",
      "content": "I wrote above _'the first significantly disseminated English Bible was Coverdale's 1535 edition, the first complete English Bible.'_   \n   \nI should have said the first complete Protestant English Bible, containing the Old and New Testaments as recognised by Protestants. Of course, I don't think it was actually _complete_ because it lacked the Deuterocanonical books.\n\n"
    },
    {
      "time": " 20.Oct.2003 1.23am",
      "content": "John,   \n   \nJohn it was the pompous potentate wearing the skirt that I dismissed. For reasons I think should not be discussed on the forum.   \n   \nAccusing people of going against \"Church Dogma\" when the teachings are delivered in Latin is mean spirited and sheer idiocy. Unless, which one might suspect, \"Church Dogma\" was other than the teachings of the Bible. A book the common man was \"prevented from reading\".   \n   \nBut as you can see there is some conflict in your thoughts. You say . .   \n   \n\"I think this is a Protestant myth, as is the idea that the Church did not encourage the 'black art' of printing.\"   \n......   \n   \nThen . .   \n   \n......   \n   \nThe Catholic Church already knew that personal interpretation was unacceptable, and had never taught sola scriptura, and so was unwilling to encourage private, personal reading of scripture in the vernacular because the Catholic religion is not a private, personal religion.\"   \n   \n.....   \n   \nWould this have been the Church fear. Thinking peoples?   \n   \n....   \n\"As something of an aside, it is worth noting that the burning of heretics was prescribed in secular law: heresy was a crime against society.\"   \n....   \n   \nThen . .   \n   \n....   \n   \n\"The idea that somehow these people were martyrs to intellectual freedom, i.e. that they were burned because they wrote books and translated Bibles, is a modern anachronism. These people had no concept of intellectual freedom, and were just as quick to burn Catholics as Catholics had been to burn them, as seen in Calvin's Geneva.\"   \n....   \n   \nThis is a great puzzler. Firstly how can one blame those people for not having any concept of intellectual freedom when you burn anyone excercising that concept. I think this is a clear case of \"blaming the victim\". Besides, two wrongs don't make a right!   \n   \nThe chaps instrumenting these dictums should have spent more time reading the Bible. (If only it were in mother tongue maybe they could have.) \"Thou shalt not kill!\"   \n   \nHeresy can not be so easily fobbed off as merely a civic routine. The very description of Heresy is \"strictly\" one of questioning teachings of \"Explicit Church Dogma\". The fact that the Church and state were inseparable does nothing to relieve their guilt. Accusations of the Heresy came from the Church, Heretics determined guilty by the Church, civic workers performed the work of the \"Church and state\". (Which were one and the same.)   \n   \nThat was a marriage, not a divorce.   \n   \nFurthermore, if the Church had shared the teachings in \"mother tongue\" rather than \"forever persisting in Latin\" maybe these feeble minded civic workers would have questioned the little part in the Bible about \"thou shalt not kill\". Maybe they too would have become Heretics.   \n   \n\"Church deemed Heresy\" and punishments accrued are nothing other than plain simple censorship in its most hideous form.   \n....   \nI cannot think of a single time when the Church discouraged printing and publishing (although they certainly denounced specific products of the presses).   \n.......   \n   \nI can not imagine how censorship by way of death could be anything but discouraging to those in the printing industry.   \n   \n\"Accusation of heresy was \"Church tool of Absolute Censorship\". Its' very meaning describes those that do not puppet \"the opinions\" as described by Church Dogma. They would be talking about me. I would be burned? For instance, I am against murder. In other words I believe in parts of the Bible that these people were not supposed to read.   \n   \nAnd a final question one may ask. If the Church did not discourage printing but insisted on a language that could not be read, not only that but that their text \"should not be read\" what good is the invention? For that matter, what good are their texts?   \n   \nSo just why did the Church refer to printing as the \"Black Arts\".\n\n"
    },
    {
      "time": " 20.Oct.2003 12.19pm",
      "content": "Gerald, you have completely missed the point of my long post, which was to explain the relationship of scripture to the teaching authority of the Church as understood, at the time, by everyone except Protestants. The Catholic Church was concerned about two things: unguided private reading and personal interpretation, and the shift from sacramental to scriptural prayer and worship. You keep harking back to the idea that the Church wanted to prevent people from reading specific things within the Bible, while I'm pointing out that their concern was not the content but the _action_ of personal, private Bible reading.   \n   \nI am not attempting to convince you of the truth of Catholic teaching: I am trying to clearly state what that teaching is so that the Church's attitude to private Bible reading makes sense. I'm not asking you to agree that the Church was right, only that their attitude is consistent and understandable _without buying into the conspiracy theory that there is something in the text that the Church doesn't want you to read._   \n   \nNow, there is certainly stuff in the Bible that Protestants don't want you to read, which is why they removed the Deuterocanonical books from their editions. Luther also wanted to remove the Epistle of St James, because it supports justification by works as well as faith, but couldn't get support for removing New Testament books.   \n   \n   \n_So just why did the Church refer to printing as the \"Black Arts\"._   \n   \nDid the term originate in the Church? Where and when? The term black art is used even today, in reference to anything that is understood only by initiates. At a recent Unicode conference, one of the text encoding gurus referred to digital type development as 'something of a black art'. He was not suggesting that there was anything negative, let alone diabolical, about type design, only that it was something that the majority of people don't understand very well.   \n   \n[There, I've managed to get back to type.]\n\n"
    },
    {
      "time": " 20.Oct.2003 12.44pm",
      "content": "_I can not imagine how censorship by way of death could be anything but discouraging to those in the printing industry._   \n   \nI might reply to your comment with a reformulation: I can not imagine how financing the publication of many hundreds of books could be anything but encouraging to those in the printing industry. The Church neither universally discouraged not encouraged printing: it was concerned with the product.   \n   \nI keep asking for evidence that anyone was ever sentenced to death for printing or translating per se, but none is forthcoming. I don't doubt that burning people at the stake discouraged people from printing _heretical books,_ -- that was, after all, part of the point of public execution -- but you seem to be presuming that the printing and publishing industry was itself interested in what you understand as intellectual freedom on matters of religion. This is anachronistic. The struggle to control the publishing of _books related to religion_ in the early centuries of printing was not a struggle between repression and freedom, but between competing claims of what is true, none of which had much room for what modern people think of as freedom. It is worth remembering that a great amount of liberty was allowed by the Church in the publishing of classical texts and contemporary literary texts, because these did not deal with religious truth. The Church, understandably, took an interest in books that did concern themselves with religion.\n\n"
    },
    {
      "time": " 20.Oct.2003 1.03pm",
      "content": "_If the Church did not discourage printing but insisted on a language that could not be read, not only that but that their text \"should not be read\" what good is the invention? For that matter, what good are their texts?_   \n   \nA. Latin could and can be read. Ecclesiastical Latin has the added benefit of consistent word order, making it much easier to read than classical Latin.   \n   \nB. The role of scripture in the Catholic religion is as the first and most important documentary source of truth. But the Church has _never_ embraced the Protestant view that the text in itself constitutes the fullness of truth and teaching. Whether you realise it or not, and despite your Italian background, you have picked up a Protestant view of the Bible text as a book that contains religious truth _independent of the teaching authority of the Church._ The 'good of the Church's texts' is within the Apostolic tradition of the Church, just as the good of the Jewish _Torah Shebiksav_ was within the larger, living Torah that included both that written text and the oral tradition of the _Torah Sheb_\n\n"
    },
    {
      "time": " 20.Oct.2003 1.22pm",
      "content": "John,   \n   \nYes, I certainly agree, in fact many works were financed by the church. Today I looked at a book illustrating the Gutenberg Bible. Such a sophisticated page layout. Impossible to imagine that book was the incubations of typography.   \n   \nThe birth of printing welcomed fresh intellectual pursuits, brave duels of intellectual considerations in math, optics, navigation, leading to discoveries of even, entire new worlds.   \n   \nAnything but gloomy if you think of it that way. Maybe you could just stay away from politics and print some wonderful projects.   \n   \nThe Helsinki University had a great exhibit of early religious works. Some early printing but mostly calligraphic products. Something to see for sure. Most were incredibly ornamental and well done I must say. Papers were something to pay attention to. Some were whiter than white, others were see through and shiney. The Islamic folk had some pretty vibrant inks that looked as fresh as the day they were put to paper. Helsinki is funny, these wonderful events seems to pass through with dignity, not much fanfare, but respect all the same.\n\n"
    },
    {
      "time": " 20.Oct.2003 1.31pm",
      "content": "\"independent of the teaching authority of the Church.\"   \n   \nNot really John, I just don't believe in killing people. Never read the book, it wouldn't matter if it was in Latin or not. But my son is a Priest, my cousin a Priest and two cousins are Nuns.\n\n"
    },
    {
      "time": " 20.Oct.2003 1.48pm",
      "content": "_Not really John, I just don't believe in killing people._   \n   \nNor do I, but I do think it is important to be accurate about why people are killed. When I started studying mediaeval history at University, I quickly became aware of two things: a) the potted version people receive in school is incredibly misleading and, in Britain and Canada at least, prejudiced by Protestantism, and b) every effort should be made to understand how people thought at other times, and to avoid anachronistic judgements. This does not mean that one cannot make moral judgements about the actions of people in other times and cultures, but we should try to understand why what they did made sense to them.   \n   \n_Maybe you could just stay away from politics..._   \n   \nI'm happy to stay away from politics most of the time: but religion is a different matter.   \n   \n   \nBack to books and type:   \n   \nHave you seen a copy of the Gutenberg 42-line Bible in the flesh (actually calf skin)? The page layout is taken directly from the model established by the scribes: what is really amazing -- it took my breath away when I first saw a copy at the British Library, and it is not clear from any reproduction -- is just how black the ink is and how good the impression. It is indeed hard to reckon that the first major product of this new technology was also one of its very best examples. [The slightly earlier certificates of indulgence are not so good, but still impressive considering how new the methods and materials were.]   \n   \nThere is talk of ATypI coming to Helsinki in 2005.\n\n"
    },
    {
      "time": " 20.Oct.2003 10.02pm",
      "content": "--is just how black the ink is and how good the impression.\"   \n   \nEarly inks used burned pig bones. Pig bones carbon is the finest pigment, therefore making the densest black. Very little ink is required which minimizes the previously discussed horrors of over inking. When I was young I would order these blacks from Germany. They seemed to last forever.\n\n"
    },
    {
      "time": " 20.Oct.2003 10.44pm",
      "content": "\"but religion is a different matter.\"   \n   \nAs you can see I have been surrounded by religion. The pompous potentate in the dress was my cousin. Despised him.\n\n"
    },
    {
      "time": " 21.Oct.2003 7.26am",
      "content": "From the few things that I have read on the issue, it seems to me that the most controversial kind of Protestant printing was not so much the bible itself but of pamphlets and polemics.   \nIt is important to bear in mind that the Reformation and the Counter-reformation were not only spiritual movements, but also very political. In this light, if the printing of scripture had seemed dangerous to catholics, it might be because it threatened their institutional monopoly on 'truth.' Also through the centuries the Catholic and the Orthodox creeds had amassed a whole complex of text pertaining to faith, but not part of scripture, such as the decrees of the oecumenical councils of Nicea and Chalcedon, and the writing of the church fathers-John Chrisostom. I am not a religious man myself, but I think that the reductionist activities of the Protestants brought a type of christianity that is closer and more personal, a type which I would favour being instinctively wary of religious institutions like the Vatican and, to a much lesser extent, the Patriarchate of Constantinople. Religion and Politics, in my view, should be distinct.\n\n"
    },
    {
      "time": " 21.Oct.2003 9.16am",
      "content": "_It is important to bear in mind that the Reformation and the Counter-reformation were not only spiritual movements, but also very political. In this light, if the printing of scripture had seemed dangerous to catholics, it might be because it threatened their institutional monopoly on 'truth.'_   \n   \nWhy not because they saw it as a threat to the salvation of souls that relied upon the truth of doctrine? There seems to be a common assumption today -- perhaps related to the widespread relativism in our society -- that the Church could not actually believe what it teaches and is only motivated to defend the faith in order to defend temporal, material power. Lots of people believe that nothing is true, so find it hard to grasp that the Church actually _does_ believe what it teaches. But the Church does believe, and it defends the faith because it seeks to save souls. Consider, if you genuinely believed that Christ is present in the Eucharist, and that anyone who received the Eucharist while rejecting this belief was in sin and condemning himself, wouldn't you have a responsibility to defend that belief against people writing pamphlets and polemics attacking it, for the sake of the man who comes to the sacraments?   \n   \nThe reformation and counter reformation were political as well as religious because people lived in tight, hierarchical societies, and the belief of the local secular powers determined what religious expression was permitted. Protestantism spread in Germany through convincing the political powers that the new religion was in their interest. Max Weber famously theorised that Protestantism encouraged the development of Capitalism. Amintore Fanfani presents what I think it a more convincing argument, backed up by a lot of documentary evidence, that Protestantism was encouraged by nascent Capitalists who were seeking a religion that would not impose restrictions on their ability to make money (as the Church had done throughout the Middle Ages). So, yes, it was a political struggle, but this in turn was a struggle between opposing views of society, and not simply about power.\n\n"
    },
    {
      "time": " 21.Oct.2003 11.27am",
      "content": "John,   \n   \nActually I have found some rather disturbing news. In fact it appears the beheadings were accurate as recorded in the book Nick Schwabe had gifted to me. Remember how I said I believed everything he said when I was young, and still do. I thought I would look into this.   \n   \nMy new material is in Finnish, I am told the documentation is deep, credentials impeccable, evidence volumous and recorded.   \nCountry in question Germany, as I had mentioned, year appears to be 1529, the Catholic Church had printers beheaded, books were burned, shops ransacked. Christianity \"an accusation\" was the fault of literacy of which printers were clearly blamed. Half a million Christians were exterminated by the Church. The remaining, or the ones fortunate enough to escape fled spreading Christianity in Northern Europe.   \n   \nThe Church became . . . \"Non Christian\" and immediately afterwards declared \"Proclaimed Freedom of Religion\".   \n   \nAt least they have a sense of humour!\n\n"
    },
    {
      "time": " 21.Oct.2003 11.57am",
      "content": "\"Why not because they saw it as a threat to the salvation of souls that relied upon the truth of doctrine? There seems to be a common assumption today -- perhaps related to the widespread relativism in our society -- that the Church could not actually believe what it teaches and is only motivated to defend the faith in order to defend temporal, material power.\"   \n   \nI do believe that, Catholics and Protestants sincerely believed in what it is that they were doing, and that their spiritual salvation depended on it. So you are right in stressing the importance of that fact, but, there is no way around the fact that when any system of beliefs, essentially a moral code of conduct, is institutionalised and embodied by one group of people the essence of these beliefs is very often lost. As a result these beliefs are exploited in order to protect temporal and material interests.   \nA typical example of the way this worked was the 'donation of Constantine', a lie invented to justify the primacy of the Holy See of St. Peter's over the other Patriarchates. There was no belief involved, only a political need to establish the Catholic church as a leading institution. This also shows how the monopoly of truth so long enjoyed by the Church was often employed to further temporal interests.\n\n"
    },
    {
      "time": " 21.Oct.2003 1.01pm",
      "content": "\"Church actually does believe what it teaches,\"   \n   \nThis may not be a good defense. Hitler actually believed what he did to the Jews was a \"good thing\". He expressed similar impatience with folk writing pamphlets protesting his beloved cause. Hopefully it is uneeded to discuss whether or not Hitler was a \"bad, man\". Interestingly though, the Pope, ??Pius V??? at the time of Hitler was called Hitler's Pope. He worked to further the cause of the Church at the expense of Jews, Orthdox Greeks, and moved to declare the Catholic Church \"Non Christian\". Reason, Christ was a Jew! The book is well documented, easily available, called \"Hitler\"s Pope\".   \n   \nThis history is far more recent. And no, I am not in the habit of reading material that stands against any religion. I read it at my \"Priests Son's house\" while waiting to fly to Finland.\n\n"
    },
    {
      "time": " 21.Oct.2003 1.25pm",
      "content": "This is quite interesting material. There are no nice guys. Except the printers.   \n   \nDangerous occupation. Apparantly you were in big trouble if you printed anything protesting persecution or censorship. It did not matter if you were printing religious materials at all. Just don't say anything against the Church or anything the Church had not officially approved.   \n   \nEven a theatre poster.\n\n"
    },
    {
      "time": " 21.Oct.2003 6.47pm",
      "content": "_This may not be a good defense._   \n   \nDefense of what? I wasn't intending it as a defense of anything. As I stated above, I'm not trying to convince anyone that the Church is right, I'm just trying to communicate what I understand to be the reality of the Church's position.   \n   \nRegarding John Cornwell's book _Hitler's Pope_ I recommend that you read what professional historians, including Jewish historians, have had to say about this book. It is not well-regarded. I attended a lecture on Pius XII and the Nazis, some months after it was published, by John Conway, one of the leading experts on the history of the Christian communities in Germany and occupied countries during the Nazi period (and not himself a Catholic). Professor Conway characterised _Hitler's Pope_ and a spate of similar books as very poor history both in terms of methodology and their anti-Papal agenda. The most damning criticism of the book came from Professor Richard Breitman, a Jewish historian and consultant for the working group for the restitution of Jewish property stolen by the Nazis. Among Breitman's conclusions: 'Hitler distrusted the Holy See because it hid Jews'. Meanwhile, another Jewish historian, Rabbi David Dalin, has accused John Cornwell and similar authors of historical revisionism, and reaffirms the respect and gratitude granted to Pius XII by Jews after the war: _'Pope Pacelli was righteous among the nations, who must be recognized for having protected and saved hundreds of thousands of Jews. It is difficult to imagine that so many world Jewish leaders, in such different continents, could have been mistaken or confused when it came to praising the Pope's conduct during the War. Their gratitude to Pius XII lasted a long time, and it was genuine and pro-found.'_\n\n"
    },
    {
      "time": " 21.Oct.2003 6.58pm",
      "content": "H, the donation of Constantine is an embarassment, but it is worth noting that it was produced when the Byzantine Church was challenging the primacy of Rome. Prior to that time, the primacy of Rome had been generally recognised, and had not needed justification other than what were universally regarded as such: the Petrine texts in the Gospels and the record of orthodox doctrine that persisted in Rome while the Greek church struggled with internal heresies such as monophysistism to which even its patriarchs were not immune.\n\n"
    },
    {
      "time": " 22.Oct.2003 12.21am",
      "content": "Well, I am glad to hear that \"Hitler's Pope\" may not have been accurate. I would have to know more which is unlikely because it is not even of secondary interest to me. My interest is typography and boats. But historians gather dust and their job by and large is to protect 'Status Quo\". They are basically talking heads giving yesterdays news. Almost all employed by \"some entity\".   \n   \nI remember the present Pope apologizing to the Jews for the Church regarding the last war. I had assumed it was about that.   \n   \nBut their praise for the Pope surprises me. I have heard little praise from them about \"Mussolini\" for instance. An author writing for the, I think, (Jewish League) wrote a book searching for evidence to prove Mussolini was against the Jews. The author came up dry until at such point the Germans had over run Italy, about the time of the spectacular Alps rescue. (Quite the story) From what I could make out Mussolini was clearly the only world leader that actively worked on the behalf of European Jews. The others considered it either spectator material, or a participatory sport. But still the author gave Mussolini no praise. Even though he cited tiring evidence that Mussolini was indeed a true friend of the Jewish peoples. So in the end the author seemed to be satisfied by what he found in the later days of the war. Mussolini came up clean but was \"not\" praised. The author had failed his mission.   \n   \nI believe that the author made much ado about the fact that, under extreme pressure from Hitler, Mussolini passed an act requiring Jewish peoples to declare loyalties to Italy. Such requirements are certainly not unusual especially at times of war. But duality is not acceptable citizenship in many countries in peace. Canada was far less kind to the Japanese in the last war confiscating the assets of its Japanese citizens and incarcerating them in dismal camps for the duration of the war. Only recently compensating them with a meagre 12,000. each. How many houses can you buy in Vancouver for 12,000.   \n   \nIt should be noted, since this is about typography, that Mussolini was a great believer in the powers of the press.   \n   \nThe press has had uneasy relations with religions throughout its history. Cetainly not just the Catholic Church. Protestants are not free of censorship guilt either.   \n   \nBut back to matter of the Catholic Church, early Printers and dubious schemes to appease the paper God \"Money\". \"Capatilism\" at its' lowest. It appears that if you were a very rich donating printer you could freely profit from publishing unapproved translations of the Bible, freely publish other religious materials including works on Luther. There were no obsticals spiritual or otherwise for rich \"donar heretics\".   \n   \nThis particular printer / publisher seemed to print whatever turned a \"prune\". He published 800 books. Anyone knowing the amount of work it takes to hand set a single book can appreciate how monumental that undertaking was. Those that have not hand set a book simply can not imagine. In any event he bequethed much monies to both city and Church. These buildings and lands are still enjoyed and the \"monies\" have not expired hundreds of years later. The Churches tolerance was well rewarded.   \n   \nUnfortunately most material I am finding is in Finnish. My wife has a Finnish bookstore. Gutenberg was uneasy about a new and improved currency generator. The old Indulgentia was now more prolific than ever. The Church was having Gutenberg print business class flight tickets to heaven for the already \"dead and gone to hell\".   \n   \nGutenberg was uneasy with this application of his invention. There is some thoughts his displeasure may have contributed to his financial woes.\n\n"
    },
    {
      "time": " 22.Oct.2003 10.39am",
      "content": "\"I think this is a Protestant myth,\"   \n   \nThis is the area of my personal focus. I have satisfied my curiosity. My conclusions are that the book I was given by my master was indeed based on fact. My book spoke of beheadings. Beheadings is consistent as method of executions of heretics in Germany in this period of history. It is coherant with the other material I have found including the time frames. Beheading is at variance to the original stories that initiated this discussion. However these other stories played in the back drop of other countries. As such, variance is not exactly, \"a big surprise\".   \n   \nThat John is accurate when he says that Protestants were not without their own guilt. Certainly I have confirmed that. I have vivid examples of explicit penalities imposed on Finnish printers and general guidlines for printing absolutely anything at all. The most trivial printings were absolutely scrutinized by the \"Protestant Church\" in Sweden when Finland was under their rule. Even the slightest departure came with minimum penalty of one half of one entire years income from every printer in the shop. Penalties for this printing was imposed on one specific minor scheduled printing. The singlular exemption from the rule.   \n   \nI have not looked into the penalties of any other infringments of the strictly policed printings. But I am sure that horror kept printers honest. These other printings had first to be transported to Sweden, read, approved or otherwise, changes or correction made, returned to Sweden for verification before presses were run. Nothing, except the above mentioned single exemption, was printed without the approval of the Protestant Church in Sweden.   \n   \nI believe in modern objectives of freedom of the press. Freedom of the press exceeds speculation of any merits of the alternative. And I believe that freedom of religion is a \"sacred right\". Maybe, not so wrongly, blood has spilled over these freedoms.\n\n"
    },
    {
      "time": " 22.Oct.2003 11.08am",
      "content": "_I remember the present Pope apologizing to the Jews for the Church regarding the last war._   \n   \nYou misremembered. The apology to the Jews was for various expressions of antisemitism within the Church's history, not for anything that the Holy See did during the war.   \n   \nThis has been an interesting discussion, but I can't think of much I want to add to what I've said already. The stuff about printing in Finland is fascinating, but I don't know enough to comment on it. I'll just add one comment in response to Gerald's final statement about freedom of the press and freedom of religion. In the 19th century, Pope Pius IX wrote that 'error has no rights', while at Second Vatican council confirmed liberty of belief. That these teachings are not contradictory is an interesting philosophical proposition and provides an insight into an institution that from age to age must change and yet remain constant.\n\n"
    },
    {
      "time": " 22.Oct.2003 11.39am",
      "content": "_You misremembered. The apology to the Jews was for various   \nexpressions of antisemitism within the Church's history, not for   \nanything that the Holy See did during the war._      \n   \nThe Italian [Jewish] historian Carlo Ginzburg has written an   \ninteresting essay\n\n"
    },
    {
      "time": " 22.Oct.2003 12.23pm",
      "content": "Some Jews were critical of the Pope for not going further. For myself - I am Jewish - I am profoundly grateful for it. It seems to me an important turning point in Jewish - Christian relations.\n\n"
    },
    {
      "time": " 22.Oct.2003 1.45pm",
      "content": "Rodolfo, do you know if Carlo Ginzburg's essay has been translated into English? Also, does Ginzburg make a distinction between antisemitism and anti-Judaism? The Church has been, and remains, critical of Judaism for much the same reason that it is critical of Islam, Buddhism, Hinduism, etc. That criticism has often been unnecessarily hostile in respect to Judaism, because it has been historically influenced by antisemitism, but it is also something distinct from antisemitism. Antisemitism -- hatred and mistrust of Jewish _persons_ -- is a cancer that needs to be cut out of the Church and out of all societies. Christians and Jews are always going to be critical of one another's beliefs: ignoring the Messiah when he comes and following a false Messiah are both damning charges, and they cannot be swept under the carpet without distorting both religions. What I and many other Catholics hope will follow from the Pope's apology, and from the ongoing efforts to improve Catholic-Jewish relations, is that the historical mistrust and hatred will be excised, leaving a legitimate critical discourse which proceeds with respect for those persons with whom one disagrees. It is a difficult task to both respect a person and to believe something different from them about who God is and what He has done: in the past most people found it easier to hate; nowadays many people find it easier to abandon their beliefs.\n\n"
    },
    {
      "time": " 22.Oct.2003 2.19pm",
      "content": "'Historically influenced' and 'unnecessarily hostile' are a bit mild as a description of the slaughter of Jews during the Crusades and the persecution during the Inquisition. And the continued discrimination, invective and incitement in subsequent centuries.   \n   \nI think the Pope's apology acknowledges that the Church actively did wrong. Such magnanimity is so unusual in human history that it leaves me in stunned admiration. As for respectful disagreement - Amen. Even on typophile!\n\n"
    },
    {
      "time": " 22.Oct.2003 2.45pm",
      "content": "_Rodolfo, do you know if Carlo Ginzburg's essay has   \nbeen translated into English?_      \n   \nI suppose so. The essay in question was a short coda   \nto his book\n\n"
    },
    {
      "time": " 22.Oct.2003 2.50pm",
      "content": "Found it here:   \n   \n [Wooden Eyes.](http://web.archive.org/web/20080907035014/http:/www.amazon.com/exec/obidos/tg/detail/-/0231119607/qid=1066859232/sr=1-7/ref=sr_1_7/103-6789654-5114254?v=glance&s=books)\n\n"
    },
    {
      "time": " 22.Oct.2003 5.34pm",
      "content": "_'Historically influenced' and 'unnecessarily hostile' are a bit mild as a description of the slaughter of Jews during the Crusades and the persecution during the Inquisition. And the continued discrimination, invective and incitement in subsequent centuries._   \n   \nBut those are examples of antisemitism -- and correctly acknowledged by the Pope as wrong --, and I was talking about anti-Judaism, i.e. of criticism of the Jewish religion. I agree that historically the two phenomenon are difficult to separate, especially as they influenced each other so much. But it is possible, and indeed important, to separate them philosophically in order to locate a legitimate critical, theological objection to Judaism and also to be able to condemn antisemitism thoroughly and without compromise. I certainly did not intend to be 'mild and gentle with these butchers', only to indicate how criticism of Judaism, which can be and should be respectful of Jewish persons, has been infected by antisemitism. 'Unnecessarily hostile' was intended to convey the distinction between saying 'Failure to recognise Christ as the promised Messiah is a grave error of Judaism, and this inevitably raises questions about the salvation of those who keep to this error' and saying 'Failure to recognise Christ as the Messiah is a grave error of Judaism, so all Jews are going to burn in Hell because their ancestors rejected Christ'. The latter is significantly hostile, infected by antisemitism, and the hostility is unnecessary to the critique; indeed, it is a distortion.   \n   \nBy the way, I'm not saying that the Catholic view of Judaism is completely critical. Catholics and Jews disagree about central truths -- most importantly the nature of Christ and soterology -- but they agree on much else. Ditching the antisemitism not only clarifies legitimate criticism but also will hopefully lead to better understanding of our shared roots and moral teachings. In this I hope you are right that the Pope's apology represents a turning point.   \n   \nIf I were not convinced of the divinity of Christ, I would be attracted to Judaism (although I'm mighty relieved only to be circumcised in the spirit). As it is, I'm necessarily a blasphemer to any religious Jew.\n\n"
    },
    {
      "time": " 22.Oct.2003 8.20pm",
      "content": "\\>a blasphemer to any religious Jew.   \n   \nNo, being a Christian doesn't make you a 'blasphemer' in Jewish eyes; it just makes you not a Jew.   \n   \nTechnically, in Rabbinic law to become a blasphemer you would have to curse God using the sacred Hebrew name (which nobody is certain how to pronounce), or, in some opinions, curse God using one of the substitute Hebrew names of God - which I don\n\n"
    },
    {
      "time": " 22.Oct.2003 10.40pm",
      "content": "_No, being a Christian doesn't make you a 'blasphemer' in Jewish eyes; it just makes you not a Jew._   \n   \nI suppose that's a relief, but the fact that I don't even qualify as an idolator borders on the disappointing. ![:-)](http://web.archive.org/web/20080907035014im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nThanks for the lesson, William.\n\n"
    }
  ]
}
