{
  "id": "17036",
  "title": "Designing the Uppercase B and lowecase b",
  "forum": "Design",
  "tags": [

  ],
  "content": "Your last suggestions were great not for the next letter or letters. I thought it would be better to combine the two. My explination. I am wanting to know everybodys tips,opinions, and advice on designing the uppercase B and lowercase b. Are there any problems you encounter. Suggestions on how to attack it. Things you should pay attention to. I understand the whole typeface affects it and it will be addressed but i am more concerned with just the two letters for now. Please look at it as for someone who know nothing about type design. This is for my thesis and i just wanted to see what everyone had to say before i write the chapters. Thanks alot and i look forward to you opinions.\n\n [‹ Question about a custom logotype for a poster for a theatre play](http://web.archive.org/web/20080421215024/http:/typophile.com/node/16434 \"Go to previous forum topic\") [Mathematical typesetting in Indesign CS ›](http://web.archive.org/web/20080421215024/http:/typophile.com/node/17250 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080421215024/http://typophile.com/user/9904\" title=\"View user profile.\">orso2932</a>",
  "time": "<br>",
  "uid": "9904",
  "comments": [
    {
      "time": " 1.Jan.2006 10.17am",
      "content": "Are you going to ask ask 26 different questions? Perhaps it would be best to ask if anyone has any tips for designing certain letters… then you could see what answers come our of the fray?\n\nThe lowercase b, d, p, and q are often [almost] the same form, just flipped or rotated. Then again, they are often completely different!\n\n"
    },
    {
      "time": " 1.Jan.2006 3.30pm",
      "content": "I was going to but i think you idea is probably better. Didnt think of it.\n\n"
    },
    {
      "time": " 1.Jan.2006 4.57pm",
      "content": "What other kinds of research are you doing on this? Have you read any books on the subject?\n\nChrisL\n\n"
    },
    {
      "time": " 2.Jan.2006 5.09am",
      "content": "This is a Thesis? or an Askis? Would you like us to make you coffee for a few weeks? Carry your Groceries and make your bed? Children know the meta-forms, Open you eyes and think about it and all will be revealed, Ask and it will be obscured by thousands of details you don’t need to know from people who know no more than you need to for this assignment, really, myself included.\n\n"
    },
    {
      "time": " 2.Jan.2006 5.58am",
      "content": "What is an Askis? NO i told you i am aking yall just to see if there is anything else I have information already. I have gather I would say close to 150 books on type. But i have only found about 15 on type design. Mostly the ones from people i have interviewed and other people. there just isnt much out there one the subject that isnt just pictures. Im just trying to do a good job and get as much information as i can. The problem is to get it you have to ask people for it.\n\n"
    },
    {
      "time": " 2.Jan.2006 7.04am",
      "content": "Jason, try looking in the Critique sections of this forum. Many (most?) of the problems encountered making letters show up there, and get discussed with examples. It’s a great resource.\n\nEd.\n\n"
    },
    {
      "time": " 3.Jan.2006 10.39pm",
      "content": "“The problem is to get it you have to ask people for it.”\n\nIsn’t it though? ;)\n\nJason, your posts about Letter A, Letter B and Type Design Movements sound like you are just getting started with research into your project. Is this the case? If so, I hope you are not starting out with the premise that research is a bother. Other posts you’ve made imply that this project represents an obstacle to you and little else. Given your disregard for research, reading and punctuation, how far do you expect to get? Will someone else do the writing? Read the original post you made to open your “letter B” thread. To me it carries a tone of entitlement and of disinterest, as if you are just carrying out a tiresome chore, one which you expect we will perform for you.\n\nI struggle attempting to answer your questions, because they are quite open-ended; they represent the beginning of a very arcane, detailed and subtle adventure, one you don’t sound very interested in.\n\nI’ll reply with a question: What kind of B? (Clues: Serif or Sans, Roman or Italic, formal or informal, script or.....). This may help you re-formulate your question about Type Design Movements.\n\nI reply with a question because the answer would otherwise be so layered, so packed with conditions and disclaimers, that it would quickly seem irrelevant, unintelligible, or both. Typefaces are made for particular purposes, and they are systems of interchangeable parts. Not only do the various letters influence each other, but the intended use of the typeface influences everything, down to the size of the dot on the i. Seriously. If you hope to get feedback that you can use, you may have to put more thought into your questions.\n\n"
    },
    {
      "time": " 4.Jan.2006 6.07am",
      "content": "Too answer your remarks. I am very interested in the subject that is why I picked it. The problem is finding the information. There is hardly non-on the subject of type design. There are a lot of pretty examples but nothing explaining the complications of developing the shape or face. Like the uppercase H. How you should place the bar a little higher for best optical effect. Or how when designing your n can turn into your h or two n’s get your m. Stuff like that. I have had no class on type design and out of the 150 typography books I have 8 actually talk about the science of designing a letter.\n\nLettering (Thomas Wood Stevens), Anatomy of Lettering (Russell Laker), Fonts and Logos, Logotypes and Letterforms (Doyald Young) Lettering for Advertising (Mortimer Leach), Lettering for Reproduction (David Gates), The Alphabet and Elements of Lettering (Fredrick Goudy), and Roman Lettering (LC Evetts).\n\nAll out of print. So if you know of any books on type design or places to look please tell me and I will leave you alone.\n\nI have some fascinating ones on the history but sense I was am out of town for the holiday break and could only carry a few on the plane is the reason for the type movement question. That one I was being lazy.\n\nThese others yall are suppose to be the experts. And as you can see there is not much as of books so I thought I would ask. So cut me some slack. I’m sure yall asked several people what to do when yall were trying to figure it out. Its more complicate then drawing a letter. I’m learning that everyday.\n\nAs for the open-endedness. It is open-ended. I just want you to talk about the letterform. Some things to look out for, problems you face, common frustrations or tips you have figured out. Yall have the experience not me. I don’t care if it is serif, san serif, italic, or script. I just want to know everything you are willing to give me on the letter. That is all.\n\nYOU ARE NOT WRITING MY THESIS FOR ME. I will just simply add your information with mine the I WILL WRITE IT MY SELF. If it sucks you write one, any one write one then I wouldn’t have to. I could write a meaningless one on branding like everyone else.\n\n"
    },
    {
      "time": " 4.Jan.2006 7.14am",
      "content": "[http://typophile.com/wiki/Books](http://web.archive.org/web/20080421215024/http:/typophile.com/wiki/Books \"http://typophile.com/wiki/Books\")\n\nThe wiki has some books (not all have an article attached to them yet). The problems/opportunities faced when designing letters for, for example, [Bell Centennial](http://web.archive.org/web/20080421215024/http:/www.myfonts.com/search?search%5Btext%5D=bell+centennial) are clearly different to those of [Requiem Display](http://web.archive.org/web/20080421215024/http:/www.typography.com/catalog/requiem/index.html). Perhaps you should look at a general approach to a design, what the designer would want to know before going ahead and designing, what is the purpose, maybe, then identify design decisions that have to be made from that base, rather than try to define a single method of designing a character which will always have exceptions to the ’rule’. I suspect you will have to narrow your subject in order to write a coherent thesis.  \nAlso dissecting and overlaying letterforms will show that the m is rarely two ns, this is also a useful technique when examining other letterforms.  \n_I don’t care if it is serif, san serif, italic, or script. I just want to know everything you are willing to give me on the letter._ the trouble is that there are different considerations in each case, but you are aware of the basic shapes of B and b.  \nTim\n\n"
    },
    {
      "time": " 4.Jan.2006 7.57am",
      "content": "Thanks. I am wanting to point toward non display type. Display types have very little rules to it. (I could be wrong) Just try to make it look like an A, B or C.\n\nI understand their is a difference between Roman and Italics but how big a difference is there between serif and san serif?\n\n"
    },
    {
      "time": " 4.Jan.2006 1.31pm",
      "content": "Jason,\n\nI’m not trying to get you to “leave us alone”. I just think your questions raise more questions than you are prepared for. I wonder if you have tried using abebooks.com or Amazon to find used copies of the out-of-print books you listed? Also, the resources listed in the wiki are very helpful. “Anatomy of a Typeface” by Alexander Lawson is especially good for some of your initial questions.\n\n“How big a difference is there between a Sans and a Serif”, is a question which might take 30 people 2 weeks to answer to your satisfaction. Could you rephrase this? I don’t really know where to begin. Suppose you start with a specific question about the difference between the structure of b in Jenson and in Univers, for example.\n\nEverything I know about the letter B is not likely to get you anywhere. I makes sense for you to pick an example, like a serif typeface for books, to begin with, in asking about letter design. The answers for that scenario are different than the answers for a sans for phone books, a condensed sans for highway signage, or a trendy serif face for a magazine. So, it might help you get farther if you did care if it is sans, serif, etc. Think of it as a test case which can be exlored fully, then contrasted with another test case to show the many, many exceptions to every rule.\n\nYour comment about “having to” write a thesis on the topic belies your impatience. I’m afraid there is no place where you can find all the information you need about this enormous topic. I suspect everyone who is actively designing type now has followed a very faint, very lonely, slow trail to discover what they know. Often, essential concepts like contrast or letterspacing require more experience than book knowledge to really grasp. Each book you encounter is likely to provide some bit of information you can combine with other bits to form an idea of the steps required to design a typeface, but short of actually designing a typeface, your results may be limited. This may be why it is hard to collect the information in one place. Even a book like “Designing Typefaces” by David Earls doesn’t cover everything.\n\nI encourage you to ask more specific questions, collect the replies, and see if it helps you focus your topic. You might find a subject that is just the right size, like Paul Renner’s Futura, and it’s importance in its historical context, or Bell Centennial and the specific purpose it was designed for, or the adaptation of a single metal typeface like Bembo for digital use. Or how a typefounder cut punches for the smallest size of a classic design like Garamond or Caslon, or the entire genealogical history of Helvetica, or....\n\nTo reiterate the main point, there are specific approaches to type design for each different design. There is no compendium of type design knowledge that can answer all your questions. So you may have a bit of a hunt on your hands.\n\n"
    },
    {
      "time": " 4.Jan.2006 2.02pm",
      "content": "Okay I got a question. What would be better?\n\nWhat I was going to do for my book is take each letter and explain it a bit in general. Then I was going to draw say a B and show each step from sketch to computer showing each revision and explain key points to watch out for. Sense I am a beginner myself one could see the mistakes I made.\n\nOr should I take 6 faces like Helvetica, Bodoni, Times, Garamond, Futura and Palatine or something and explain those. I am trying to write this for someone never doing it before.\n\nOne who is actively designing type now has followed a very faint, very lonely, slow trail to discover what they know.\n\nThis is my point. This is why I am asking you guys. My inpatients is not with doing the research it is in not finding it. Plus I’m quite annoyed with the “you want me to write you book for you comments” Yall are not the first ones to say it.\n\nWhy doesn’t someone write a book I would kill for one from Ed Benguit or Matthew Carter on the science of type design.\n\n"
    },
    {
      "time": " 4.Jan.2006 3.08pm",
      "content": "“Why doesn’t someone write a book I would kill for one from Ed Benguit or Matthew Carter on the science of type design.”\n\nMaybe they would disagree that it was a science to begin with?\n\nCarl’s “a very faint, very lonely, slow trail” is pretty accurate. There is no cookbook how-to typedesign-for-dummies book because it does not work that way. For me, it is all about “seeing” not just looking. “Yes Grasshopper,” it is kinda like “ [Zen and the Art of Archery](http://web.archive.org/web/20080421215024/http:/www.tribuneindia.com/2002/20020616/spectrum/art.htm)”. You use your eyes to decide where to place the horizontal of the H and every other of the millions of decisions you will have to make. Type design is a prolonged study in angst while chasing a brief moment of eureka. The path is long with no road signs to guide you. If Ed Benguiat and Matthew Carter were to follow “the path”, each would go a different way, one which befits them as individuals.  \nHaving read Leslie Cabarga’s “ [Logo, Font & Lettering Bible](http://web.archive.org/web/20080421215024/http:/www.amazon.com/gp/product/customer-reviews/1581804369/103-5504466-5358246)” does not change my mind. Leslie tells you his way but it is not a universal truth. Don’t get me wrong, read it—there are plenty of good tips in there but it is not “to kill for” and it won’t help you much with your thesis.\n\nChrisL\n\n"
    },
    {
      "time": " 4.Jan.2006 4.46pm",
      "content": "I have read it. It gave me a headache.\n\nI agree Ed and Matt would do it differently but I guarentee that they tips on how to do it or even better how not to do it.\n\nEven though it may take Zan to shoot archery but how far are you going to get if you dont know how to put the arrow on the thing. What im saying is how are you going to adjust something if you dont even know what you are looking for. Kind of looking at a needle in a hay stack with out knowing what the needle looks like.\n\n"
    },
    {
      "time": " 4.Jan.2006 4.56pm",
      "content": "I just want to tell them what to look for. I dont want to hold the pencil for them. The problem is I dont know what to look for.\n\n"
    },
    {
      "time": " 4.Jan.2006 5.35pm",
      "content": "When I started to design type, I had nothing to go by. I just started with no preconceptions and no benchmark to measure against so I was not looking for a needle, I was just “looking” with no sense of urgency or yardstick to measure by. Don’t think about “finding” it. There is nothing to find; just work and let “it” find you.  \nYes, you will get headaches by the dozen. This is part of the bargain. Once again, “Type design is a prolonged study in angst while chasing a brief moment of eureka.”\n\nChrisL\n\n"
    },
    {
      "time": " 4.Jan.2006 6.39pm",
      "content": "Hi Jason,\n\nI think your paper could be very useful. But rather than trying to paraphrase others, possibly losing something in translation, could you speak from your own experience?\n\nSuppose you start a typeface design, using feedback from the critique forums here, to help you proceed. Then, as the process moves along, you can document the steps you took. Save all your proofs. Show the first few letters, and what people said about them. Include your reactions, feelings and decisions. Include these Typophile threads, as they reveal the difficulty we all have in getting started. Other beginning type designers would be very interested in your journey.\n\nEach time something new happens (re-spacing, stem weights adjusted, serifs shortened, x-height adjusted), show new samples. It could be like a diary, with lots of illustrations. Describing type with words is as hard as describing colors, so use examples of your process.\n\nThe conclusion can be a showing of the design, and the paper can be set in the final version of the typeface. Use earlier versions of the design in early pages of your document, to demonstrate to readers how it evolved. Maybe each chapter or section has a page summarizing that week’s changes, set in that week’s version of the font.\n\nIf the entire project shows that evolution, and de-mystifies the process, then I think that would be a fantastic document. Instead of an instructional manual, it would be more like an expose or a case study. If it was all drawn from your own experience, there would be nothing factual for anyone to argue with. It would be a document of your learning experience, which others could be enlightened by.\n\nI know this is not what you intended to do, but it might turn out to be much more interesting, and you might be very glad to have your own typeface to use in future documents. The research you have done already would not be wasted, just re-purposed.\n\nI could begin right away making suggestions for your typeface project, including which letters to start with, how to space them, balancing proportions, etc. etc. I think others would gladly share along those lines. The critique forums are pretty lively.\n\nWhat do you think?\n\n"
    },
    {
      "time": " 5.Jan.2006 5.50am",
      "content": "That is similiar to what i was wanting to do. but the idea of a diary and setting the chapter in the face i like alot. I just thought a quick caption about the letters would be benifical as a jumping off point. Thanks alot. I think that would be interesting.\n\n"
    },
    {
      "time": " 5.Jan.2006 6.14am",
      "content": "Well said Carl.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Jan.2006 6.39am",
      "content": "Good idea Carl,  \nIt’ll be a slow chapter on kerning though:)  \nTim\n\n"
    },
    {
      "time": " 5.Jan.2006 7.07am",
      "content": "Didn’t I hear that Matthew Carter was quoted as saying, “Watching someone design type is like watching paint dry” ? (or words to that effect)\n\nChrisL\n\n"
    },
    {
      "time": " 5.Jan.2006 7.56am",
      "content": "You know dezcom we could always go back to you telling me how to draw the letter B.\n\n"
    },
    {
      "time": " 5.Jan.2006 7.59am",
      "content": "“You know dezcom we could always go back to you telling me how to draw the letter B.”\n\n??? What do you mean Jason?\n\nChrisL\n\n"
    },
    {
      "time": " 5.Jan.2006 10.14am",
      "content": "Didn’t I hear that Matthew Carter was quoted as saying, “Watching someone design type is like watching paint dry” ? (or words to that effect)\n\nJust having some fun Chris.\n\n"
    },
    {
      "time": " 5.Jan.2006 10.20am",
      "content": "Ya got me Jason :-)\n\nChrisL\n\n"
    },
    {
      "time": " 6.Jan.2006 6.59pm",
      "content": "Generally I agree with much of what Carl has written in response to Jason. However, I am willing to share this little gem on the design of the uppercase B. In _Carter’s Caps,_ Will Carter records that Eric Gill always told him that the lower bowl of the B should hang slightly ’like a young girl’s buttock’. Given Gill’s proclivities as discussed elsewhere on Typophile quite recently, this is not so charming as it sounds. Carter’s B is, however, a fine example of the model.\n\n"
    },
    {
      "time": " 6.Jan.2006 7.54pm",
      "content": "There are a lot of useful tips in there:\n\n[http://briem.ismennt.is/index.htm](http://web.archive.org/web/20080421215024/http:/briem.ismennt.is/index.htm \"http://briem.ismennt.is/index.htm\")\n\n[http://www.typeworkshop.com/](http://web.archive.org/web/20080421215024/http:/www.typeworkshop.com/ \"http://www.typeworkshop.com/\")\n\nJust do it and show it, then if there is any concrete trouble everyone will be pleased to help you.\n\nHéctor\n\n"
    },
    {
      "time": " 7.Jan.2006 6.49am",
      "content": "_Didn’t I hear that Matthew Carter was quoted as saying,_ “[...]”\n\n“ [Watching me work is like watching a refrigerator make ice.](http://web.archive.org/web/20080421215024/http:/www.usnews.com/usnews/culture/articles/030901/1font_2.htm)”\n\n"
    },
    {
      "time": " 7.Jan.2006 8.24am",
      "content": "Thank you Maxim! That is even better than I remembered.\n\nBy the way Maxim, I just got a copy of your (and George Sadek’s) book “Typographia polyglotta” and am very happy to have such a well done concise comparison of scripts using the same text. The background square is an excellent way to compare setting lengths throughout the range of examples. The tidy description of each script is perfect reference. I know this is old news to you, but it is fresh still to me. Thank you both for producing this book.\n\nChrisL\n\n"
    },
    {
      "time": " 7.Jan.2006 10.23am",
      "content": "Thank you for your kind words, Chris. By the way, _where_ have you got it from? People keep asking me for a copy, and I don’t know where to send them.\n\n"
    },
    {
      "time": " 7.Jan.2006 10.52am",
      "content": "_Given Gill’s proclivities..._\n\n ![](http://web.archive.org/web/20080421215024im_/http:/typophile.com/files/GillCondom.jpg)\n\n"
    },
    {
      "time": " 7.Jan.2006 11.06am",
      "content": "Maxim,  \nI did a search on Amazon for it by name that turned up 3rd-party sellers that had some copies. Mine came from ABE in Oxford UK. It came to me in a plain brown wrapper with hand written address with a hand written invoice! It was quite enjoyable for a change to get something from a single human being rather than a mega-corporate auto-digital-web-based conglomerate! I will look up the reference for you though and send it to you.\n\n[http://www.abebooks.co.uk](http://web.archive.org/web/20080421215024/http:/www.abebooks.co.uk/ \"http://www.abebooks.co.uk\")\n\nChrisL\n\n"
    },
    {
      "time": " 7.Jan.2006 11.07am",
      "content": "Nick!\n\nGillting the lilly? :-)\n\nTHAT is a SCREAM!!! You graduate summa cum laude for that one :-)\n\nChrisL\n\n"
    },
    {
      "time": " 13.Jan.2006 5.09pm",
      "content": "Doing the “A” was fun, and useful even to the people opining on it  \nI think. But asking us to go through the whole alphabet is... if not  \nungracious, too demanding. If I spilled everything here, who would  \nbother buying my eventual book?! ;-) Oh, and who would pay my  \nbills while I typed away?\n\nBut here’s something: the “B” is best when the bottom bowl is complete  \nwhile the top bowl gets truncated into it. I know that wasn’t very clear.\n\nhhp\n\n"
    }
  ]
}
