{
  "id": "17049",
  "title": "Palatino Linotype 497kb",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Why is Palatino Linotype Opentype size so large?\n\nOr is it normal for otfs to be this size?\n\n(edit: PC format)\n\n [‹ Register.com Rendered Font](http://web.archive.org/web/20081012162919/http:/www.typophile.com/node/17210 \"Go to previous forum topic\") [Don't shoot me! ›](http://web.archive.org/web/20081012162919/http:/www.typophile.com/node/17187 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012162919/http://www.typophile.com/user/10821\" title=\"View user profile.\">noftus</a>",
  "time": "<br>",
  "uid": "10821",
  "comments": [
    {
      "time": " 2.Jan.2006 3.54pm",
      "content": "[OpenType](http://web.archive.org/web/20081012162919/http:/www.typophile.com/wiki/OpenType) fonts can have many more glyphs and features than [TT](http://web.archive.org/web/20081012162919/http:/www.typophile.com/wiki/Truetype) or [T1](http://web.archive.org/web/20081012162919/http:/www.typophile.com/wiki/PostScript) fonts. Wait until [Kangi](http://web.archive.org/web/20081012162919/http:/www.typophile.com/wiki/Kangi) OT fonts start to grow!\n\nChrisL\n\n"
    },
    {
      "time": " 2.Jan.2006 5.25pm",
      "content": "1328 glyphs, hints for b/w and grayscale, OpenType layout tables for Latin, Greek and Cyrillic.\n\nSi\n\n"
    },
    {
      "time": " 2.Jan.2006 6.58pm",
      "content": "Kanji OpenType fonts have already grown, Chris. Take a look at Hiragino Mincho (bundled with Mac OS) or Kozuka Mincho Pro (Adobe, each font is over 4 MB with 15,444 glyphs).\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 2.Jan.2006 7.06pm",
      "content": "Thomas, They still have to reach the full 3,000 mark :-)\n\nChrisL\n\n"
    },
    {
      "time": " 2.Jan.2006 10.17pm",
      "content": "I disagree with the comment that  \n“Opentype fonts can have many more glyphs and features than TT or T1 fonts”.  \nI can stick thousands of glyphs in a T1 font, give each  \nof them a different name, and extract them quite  \nnicely in any PostScript document with the PostScript  \nlanguage command “glyphshow”. Hackers know this all too well,  \nand Adobe people are certainly aware of it.  \nTruetype fonts can have as many glyphs as OpenType fonts.  \nMany full-bodied kanji and Chinese fonts live quite happily  \nin truetype.\n\nAbout features: Truetype can add tables ad infinitum, just  \nlike OpenType. I am not saying that this is a good thing—  \nbut technically, the statement above is incorrect.\n\nPlease stop the rumors.\n\n"
    },
    {
      "time": " 2.Jan.2006 10.50pm",
      "content": "It is more accurate to say that OpenType fonts, because of the GSUB and GPOS layout options, are encouraging font developers to increase the number of glyphs in fonts. So against the average size of a typical font supporting a single 8-bit codepage and with somewhat less than 256 glyphs, many OpenType will be noticeably larger. Indeed, Nathan noticed it.\n\nA lot of pre-OT TrueType fonts, of course, already supported multiple codepages and had other size increasing features, but even in the TT format the vast majority of fonts from most foundries supported the same limited glyph sets as corresponding Type 1 versions of the same fonts. Yes, Type 1 fonts can contain a lot of glyphs, but few of them in fact did so, so people’s perception of ’normal’ size for fonts has been that they are quite small files, and the gathering flood of OpenType fonts is challenging that perception.\n\nA lot of clever people, especially in the TEX community, did many impressive things with Type 1 fonts, and sometimes pushed the boundaries of that format further than Adobe did themselves. But the typical Type 1 font that most users knew and perhaps loved — and which I knew as a font developer and hated — supported a single 8-bit codepage and had a correspondingly small glyph set and file size.\n\n"
    },
    {
      "time": " 3.Jan.2006 6.34am",
      "content": "\\>About features: Truetype can add tables ad infinitum, just  \n\\>like OpenType. I am not saying that this is a good thing—  \n\\>but technically, the statement above is incorrect.\n\nFor most type users, TrueType and Type 1 are conflicting “basic” font formats, the former usually found on Windows-running computers, and the latter on Macintosh OS computers. The advent of OpenType, as John Hudson notes, is less about format and more about functionality. OpenType fonts, after all, can be created/generated in either Compact Font Format (CFF) or TrueType-flavoured rendering systems.\n\nThis discussion and the links therefrom are a good primer: [http://typophile.com/node/16695](http://web.archive.org/web/20081012162919/http:/typophile.com/node/16695 \"http://typophile.com/node/16695\")\n\n\\>Please stop the rumors.\n\nThat was a rumour, but this is absolutely true: Paris Hilton is engaged to Sardinian shipping magnate Linotype Palatino, who she stole away from her good friend Nicole Richie!\n\n"
    },
    {
      "time": " 3.Jan.2006 7.52am",
      "content": "LOL!!! Chester, dynomite!\n\nChrisL\n\n"
    },
    {
      "time": " 3.Jan.2006 11.45am",
      "content": "Hi Luc.\n\n"
    },
    {
      "time": " 3.Jan.2006 12.50pm",
      "content": "_For most type users, TrueType and Type 1 are conflicting “basic” font formats, the former usually found on Windows-running computers, and the latter on Macintosh OS computers._\n\nWhich is highly ironic considering who invented the TrueType format.\n\n"
    },
    {
      "time": " 3.Jan.2006 1.19pm",
      "content": "I would qualify the claim with...\n\n_For **most type users who install fonts beyond the default selection** , TrueType and Type 1 are conflicting “basic” font formats, the former **believed to be most suitable for** Windows-running computers, and the latter **believed to be most suitable for** Macintosh OS computers **and professional printing output.** _\n\n"
    },
    {
      "time": " 10.Jan.2006 8.37pm",
      "content": "\\> hints for ... grayscale\n\n!  \nPlease tell me more!\n\nhhp\n\n"
    },
    {
      "time": " 10.Jan.2006 9.33pm",
      "content": "Mike Duggan might be able to give a better explanation if he’s around but a hinting function can ask the OS what rendering mode it’s in and apply different hints depending on the mode, eg to bulk up a diagonal stroke under regular antialiasing.\n\nIt’s little used these days, but in a more recent case the same font was used on a device that rendered to TV and to a regular monitor - in b/w mode the hints were used, but in TV mode (regular antialising in this case) the b/w hints would not be applied, giving the pure antialiased forms, undistorted by hints.\n\n"
    },
    {
      "time": " 11.Jan.2006 10.17am",
      "content": "\\> a hinting function can ask the OS what rendering mode  \n\\> it’s in and apply different hints depending on the mode\n\nYes, I remember when that capability was added to VTT.\n\nBut I had yet to learn of a font that actually uses gs  \nhinting. Which makes your “it’s little used these days”  \neven more surprising! But I guess you mean due to CT.\n\n\\> ... undistorted by hints.\n\nBut here you’re implying in gs the hints were simply  \nturned off. I thought you meant there were actual gs  \nhints in the font... Please explain!\n\nIf it’s true, what other fonts use gs hinting?  \nAnd were could I see some renderings, at like 12-16PPEM?\n\nhhp\n\n"
    },
    {
      "time": " 11.Jan.2006 11.37am",
      "content": "\\> But I guess you mean due to CT.\n\nYes\n\n\\> But here you’re implying in gs the hints were simply  \nturned off. I thought you meant there were actual gs  \nhints in the font… Please explain!\n\nSorry for the confusion - Palatino Linotype does have specific contextual GS hints. In the TV font example the function is used to turn off all hints under GS.\n\n\\> what other fonts use gs hinting?\n\nPalatino Linotype is the only one I’ve come across. Wouldn’t be surprised if Vinnie hadn’t done some custom work along these lines for DaMa.\n\n\\> And were could I see some renderings, at like 12-16PPEM?\n\nIf you don’t have easy access to WinXP send me your sample text and I’ll do some screen grabs under b/w & GS.\n\nSi\n\n"
    },
    {
      "time": " 11.Jan.2006 12.11pm",
      "content": "I’m on WinXP, and do have Palatino Linotype...  \nLemme check this puppy out...\n\nVinnie, you there?  \nShould Simon be surprised?\n\nhhp\n\n"
    },
    {
      "time": " 11.Jan.2006 3.53pm",
      "content": "at the time I did the hinting on Palatino Linotype I did do some hints for GS @ 14 point (19ppem) mostly if I remember correctly, to strengthen up some diagonals and improve some shapes in GS. Where the font was 1 pixel stems up to 17ppem we disable GS in the GASP, and hense we didnt do anything for those sizes in GS. This was just pre ClearType and it was actually my task to look into making the 1pixel stem sizes look better in GS, but ClearType took over and I never did get to it.\n\n"
    }
  ]
}
