{
  "id": "17047",
  "title": "Head-serifs on lc \"u\" - decision process?",
  "forum": "Design",
  "tags": [

  ],
  "content": "How do people decide whether to make  \nthe head-serifs on a lc “u” flat or angled?\n\nhhp\n\n [‹ The fascinating ogonek](http://web.archive.org/web/20081211152320/http:/typophile.com/node/32010 \"Go to previous forum topic\") [Your help/knowedge is needed! ›](http://web.archive.org/web/20081211152320/http:/typophile.com/node/50192 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081211152320/http://typophile.com/user/1250\" title=\"View user profile.\">hrant</a>",
  "time": "<br>",
  "uid": "1250",
  "comments": [
    {
      "time": " 2.Jan.2006 2.31pm",
      "content": "I find it depends on the overall size of serifs in the face.  \nIf the face has smallish serifs, then the u’s serifs, being one-sided, might need something extra, which a little bit above the x-height can provide.\n\n"
    },
    {
      "time": " 3.Jan.2006 3.17pm",
      "content": "Interesting point, thanks.  \nSo does that mean you [generally] prefer the flat form?\n\nAnybody else?\n\nhhp\n\n"
    },
    {
      "time": " 3.Jan.2006 4.49pm",
      "content": "Hrant, do you have studies of the u you’re working with (assuming you’re working with something)?\n\nI haven’t yet developed a serif face so I have no method or even preference, but I imagine studies would help a lot. If you could share I am sure you’d find a lot of us willing to opine :-\\>\n\nWould or should typical letter combinations that might appear have some bearing in this like Qu qu tu etc?\n\nI suspect that if the serifs were mere barbs a little curvuture would be useful as Nick suggests, but if they were slabby then going flat on the x-height would be the way to go.\n\nAnother question that is worth exploring in making a decision is just how much reference to chirography should be present in the face. I would think that the head serif would be approached by many as the entry point to the letter in handwriting and there would be a predisposition to have the serif angled.\n\nI am curious too if others have some ideas, choices or rules of thumb.\n\nJon\n\n"
    },
    {
      "time": " 4.Jan.2006 5.00am",
      "content": "A quick glance through Rookledge shows that Venetian (sloping e-bar), Angled Stress/Oblique Serifs, Vertical Stress/Oblique Serifs and (confusingly) Vertical Stress/Straight Serifs _generally_ have angled serifs, while Abrupt Contrast/Straight Serifs (Didone etc) and Slab Serif have straight serifs. Of course there are exceptions and there are some that have different angles, different sizes/types (full and half) of serif and some have a chirographic lefthand serif. My general preference is angled followed by less angled (or flat) serif.  \nI suppose it really depends on the type of serif and stress.  \nTim\n\n"
    },
    {
      "time": " 4.Jan.2006 6.55pm",
      "content": "The trick with the u is that the serif on the righthand stem is the only letter-internal x-height serif off a straight stem. If your design has strong triangular serifs at the x-height, you’ll find that, if the basic serif model established by the lowercase i is applied to the righthand stem of the u it will dominate the interior space of the letter too much. I believe this is why the u often has more horizontal serifs than other letters: you adjust the righthand serif so that it leaves the counter nice and open, and then you have to adjust the lefthand serif to harmonise, otherwise the letter looks really weird. This graphic shows the adjustment in my SBL BibLit typeface.\n\n ![](http://web.archive.org/web/20081211152320im_/http:/typophile.com/files/iu.gif)\n\n"
    },
    {
      "time": " 4.Jan.2006 7.07pm",
      "content": "Another interesting note about the terminals of the lowercase u is that although the lower right terminal typically follows the more formal shape employed on the d, rather than the more cursive ’flick’ often found on the lowercase a, the latter form is much better for attaching the ogonek in a convincing way.\n\n ![](http://web.archive.org/web/20081211152320im_/http:/typophile.com/files/uuog.gif)\n\n"
    },
    {
      "time": " 4.Jan.2006 7.35pm",
      "content": "John,\n\nThose are some neat examples. Like I stated earlier, I have never drawn a serif face, so I’ve never studied that kind of subtle difference, and I’m sure it’s not something that I would ’just notice either’. Very instructive. Thanks. The ogonek thing is so far off my radar at present that I just sat here going, “Man oh man, that’s pretty cool.” It is a convincing comparison.\n\nJon\n\n"
    },
    {
      "time": " 4.Jan.2006 9.49pm",
      "content": "If you look carefully at the optical scaling of (real) Centaur, you’ll see that the left head-serif has a much steeper angle in the smaller sizes than in the larger. What I don’t know is whether there is some real reason for it, or whether it’s somewhat arbitrary, perhaps because they were using different drawings at different times during the typeface’s development. I haven’t studied any other optical scaling families carefully enough to know whether this is a pattern in the same way as, say, opening the counter of ’a’ and ’e’.\n\n"
    },
    {
      "time": " 8.Oct.2008 2.00pm",
      "content": "John, I guess forgot to say: thanks for the interesting insight!\n\nhhp\n\n"
    }
  ]
}
