{
  "id": "17045",
  "title": "Traditonal book design",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’ve been searching the web to find the traditional page order that books used to follow, like having a bastard title page, pre lims etc... but for the life of me I can’t find the order. Does anyone know the order of traditional book design or could you please point me in the right direction?\n\nAny help is greatly appreciated.\n\nBec\n\n [‹ Font with horizontal accents](http://web.archive.org/web/20080502182953/http:/typophile.com/node/17145 \"Go to previous forum topic\") [Making things bold ›](http://web.archive.org/web/20080502182953/http:/typophile.com/node/17180 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080502182953/http://typophile.com/user/4930\" title=\"View user profile.\">beccabob</a>",
  "time": "<br>",
  "uid": "4930",
  "comments": [
    {
      "time": " 2.Jan.2006 3.03pm",
      "content": "“Front Matter” in Chapter 1 of the Chicago Manual of Style?\n\nMarjorie Skillin’s _Words into Type_ has the following list for front matter (somewhat abbreviated).\n\ni Bastard title  \nii Card page (books by same author), imprimatur, series title, or blank  \n- Frontispiece (usually unnumbered)  \niii Title page  \niv Copyright page  \nv Dedication  \nvi Blank  \nvii TOC  \nviii TOC (continued) or List of illustrations  \nix List of illustrations or Acknowledgements  \nx continued, or blank  \nxi Editor’s preface  \nxii continued, or blank  \nxiii Author’s preface  \nxiv continued, or blank  \nxv Foreword or Introduction  \nxvi continued, or blank\n\nThe card page, frontispiece, and copyright page are always on left-handed pages. Other sections appear, or at least begin, on right-handed pages.\n\n"
    },
    {
      "time": " 2.Jan.2006 3.08pm",
      "content": "Thank you very much for you help :)\n\n"
    },
    {
      "time": " 5.Jan.2006 10.01am",
      "content": "We like to call the “bastard title” the half-title. It’s more polite.\n\nThe copyright traditionally is supposed to go on the back side of the title page (that is, page iv) but it can also be the very last page of the book. It can’t go anywhere else as far as I know.\n\nThe rules about contents pages and openers always beginning on the recto (right hand page) are pretty loose these days, especially in illustrated book publishing. You can certainly design the table of contents to run across a spread.\n\n"
    },
    {
      "time": " 5.Jan.2006 1.27pm",
      "content": "Thanks,\n\nI’ve designed a book within a book, which is to say that I have a larger book that surrounds a smaller book. I’ve been making a puzzle book using words that end with another word so for example ’Smoking’ or ’carriage’.\n\nThe second part of the word is set in the inner book with the outer book representing the first part of the word. I’ve printed the words onto various types of paper to work with layering and seeing other words appear through layers of tracing paper and accetate, thicker card and paper with texture, each paper or print being relevant to the word and it’s meaning. It’s been a nightmare pagenating (sp?) it all and then I realised I’d forgotten the prelims and so now I’m putting them in.\n\nI only knew the half title page as a bastard title page as that is what I’ve been taught, half title is much more polite I agree :)\n\n"
    },
    {
      "time": " 12.Jan.2006 10.27am",
      "content": "\\> We like to call the “bastard title” the half-title.\n\nReminds me of Morison’s insistence that one of the reasons JvK’s Cancellaresca Bastarda failed in the market was that people were mistakenly pronouncing the “s” in the second word, while it should be silent. As if it were an Argentinian font.\n\nhhp\n\n"
    },
    {
      "time": " 16.Jan.2006 4.31pm",
      "content": "Does anyone know a place on the web that has example of hermann zapf or Frederic W. Goudy book traditional page/cover designs. or anyones traditional page/cover designs\n\nthank you  \nsf\n\n"
    }
  ]
}
