{
  "id": "17048",
  "title": "Logo Critique (Flyer Distribution Company)",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "hi all, working at the attached logo for a flyer distribution company. can't say i'm happy with it right now. one thing  \nis the spacing in \"flyer\"... what do you think? thanks: lars\n\n| Attachment | Size |\n| --- | --- |\n| [f2g.gif](http://web.archive.org/web/20150416024407/http:/typophile.com/files/f2g.gif) | 10.78 KB |\n\n",
  "author": "lars",
  "time": "2 Jan 2006 — 2:29pm",
  "uid": "2145",
  "comments": [
    {
      "time": "2 Jan 2006 — 4:17pm",
      "content": "I think it is very nice. the colors choosen are not perhaps the best choice if this is for nightclubs, but ideal if this is for general businesses. Where is business oriented?\n\n"
    },
    {
      "time": "2 Jan 2006 — 4:19pm",
      "content": "One added comment... why singular and not plural (flyer vs. flyers) ?\n\n"
    },
    {
      "time": "2 Jan 2006 — 4:24pm",
      "content": "the company distributes flyers to \"display\" at bars, shops and also clubs, but it's for an \"overall\" audience (not party orientated). well my mothers tongue aint english, would you say \"flyers2go\" instead of \"flyer2go\"? the idea behind the name is that you have that displays in a bar, restaurant or so and take that flyers if you like one (same like gocard, but for \"regular\" flyer distribution not just free postcard style flyers). thanks: lars\n\n"
    },
    {
      "time": "3 Jan 2006 — 7:24am",
      "content": "Also, it is traditionally spelled \"_fl **i** ers_\" (with an 'i'), though in recent years \"_fl **y** ers_\" has become an accepted spelling variation.\n\n"
    },
    {
      "time": "3 Jan 2006 — 2:09pm",
      "content": "i guess it's more \"common\" here in germany to say it like that (flyer2go), flyers2go \"sounds wrong\" because of the german genitive usage... can't explain that in english. sorry :) ... so? no one else on the design itself?\n\n"
    },
    {
      "time": "4 Jan 2006 — 1:53am",
      "content": "it somehow doesn't read nicely, it feels more like to seperate entities. the 2 doesn't seem to connect naturally to the GO. it might be because of the capitals in GO - have you tried lower case letters?\n\ni'm also not sure about whether the individual elements really add up to a logo. maybe putting the entire type onto the cards would help giving it a stronger overall shape / contour.\n\noverall it's a good starting point, but it's not good enough for the viewer to feel that it \"absolutely has to be that way, no alternative.\" (know what i mean?)\n\n"
    },
    {
      "time": "4 Jan 2006 — 2:07am",
      "content": "yep, i had 3 version. one on a single line and one where all elements are \"on\" the cards. i'll think about it and post a new version. thanks thomas.\n\n"
    },
    {
      "time": "11 Jan 2006 — 10:29am",
      "content": "The tilt-back of the \"f\" and the beard of the \"G\" are distracting.  \nI would make all the terminal shears match the slant angle.  \nPDF, for some spacing and other micro crit?\n\nhhp\n\n"
    },
    {
      "time": "11 Jan 2006 — 1:41pm",
      "content": "I like it. Not sure about the second card being transparent though. It's too subtle -- I think the difference in lightness is enough.\n\n"
    },
    {
      "time": "12 Jan 2006 — 10:26am",
      "content": "...also the problem with the connection between '2' and 'GO' (mentioned by curtze) might be solved if the '2' were to be placed extending into the white space of the 'O'.\n\n"
    }
  ]
}
