{
  "id": "17052",
  "title": "Relishing Requiem",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[Requiem](http://web.archive.org/web/20141015225051/http:/www.typography.com/catalog/requiem/ \"View it from H&FJ\") seems to have become to books what Trajan is to movies: it's used everywhere. There's no shortage of [examples](http://web.archive.org/web/20141015225051/http:/www.amazon.com/gp/product/1581346735) [[1](http://web.archive.org/web/20141015225051/http:/www.amazon.com/gp/product/1581345801), [2](http://web.archive.org/web/20141015225051/http:/www.amazon.com/gp/product/0375412018/), [3](http://web.archive.org/web/20141015225051/http:/www.amazon.com/gp/product/0393317552), [4](http://web.archive.org/web/20141015225051/http:/www.amazon.com/gp/product/0195149173), [5](http://web.archive.org/web/20141015225051/http:/www.amazon.com/gp/product/1581347510)] and the typeface seems especially popular with Christian publishers. But I'm not complaining. I love Requiem and I can't get enough of it. But I'd like to hear what you think. Are you tired of seeing it on books? Have some examples of where Requiem is used well and where it's not?\n\nI personally can't get enough of the capital \"R\" and \"Y.\"\n\n",
  "author": "Peter G.",
  "time": "2 Jan 2006 — 7:49pm",
  "uid": "6256",
  "comments": [
    {
      "time": "2 Jan 2006 — 9:05pm",
      "content": "I'm always disappointed to see Requiem used only on the covers of books. When it started appearing on every second shelf at Chapters, I started looking inside the books but, alas, almost all of them were set in Minion. I don't think I've ever seen the text weight of Requiem actually used for the content of a book. It is as if book designers took one look at the lovely light display caps, and promptly forgot that there was anything more to the family.\n\n"
    },
    {
      "time": "3 Jan 2006 — 2:59am",
      "content": "That's my biggest disappointment with books, really. Only recently I found a book that was also set in Dolly, not just on the cover. Most of the time, the cover promises, but the inside pages don't follow suit.\n\n"
    },
    {
      "time": "3 Jan 2006 — 5:40am",
      "content": "Actually, a while ago [I came across a great book set in Requiem](http://web.archive.org/web/20141015225051/http:/currentconfig.com/archives/000101.html). It's called _[Cloud Atlas](http://web.archive.org/web/20141015225051/http:/www.amazon.com/gp/product/0375507256/qid=1136296000/)_ and it's a great read. David Mitchell's a very skilled writer.\n\nAs for movies, it was recently used in _[The Exorcism of Emily Rose](http://web.archive.org/web/20141015225051/http:/currentconfig.com/archives/000128.html)_ although it was applied a tad inconsistently. Guess what it was replaced with...\n\n"
    },
    {
      "time": "3 Jan 2006 — 7:46am",
      "content": "Requiem is used for illustrated books quite a bit, more than for novels. I first encountered it when Joel Avirom used it for [\"The White House\"](http://web.archive.org/web/20141015225051/http:/www.abbeville.com/products/Product0789206242.htm) some years ago.\n\nBTW, as art director for that book I got to tour the 2nd floor of the white house (not open to the public) including the Lincoln bedroom, Clinton's private office, and the last remnant of Jackie Kennedy's redecoration, a small, frenzied little blue and white room.\n\n"
    },
    {
      "time": "3 Jan 2006 — 12:02pm",
      "content": "_...especially popular with Christian publishers_\n\nI was going to say it must be the name, but then remembered that Ma(n)son is also popular for religious themes.\n\n"
    },
    {
      "time": "3 Jan 2006 — 12:07pm",
      "content": "Maybe also the name...?\n\n"
    },
    {
      "time": "3 Jan 2006 — 12:08pm",
      "content": "I think that often publishers use a different designers for covers than for interiors of books. I doubt if one sees the other's work even.\n\nChrisL\n\n"
    },
    {
      "time": "3 Jan 2006 — 12:44pm",
      "content": "I think Chris must be right. I only have a handful of books where the title page of the book is set in the same typeface as the cover. It seems odd to me that publishers would use two designers. It creates discontinuity in the book's design, but I assume they do it to save money. Of course they also redesign the cover at times to make the book look newer.\n\n"
    },
    {
      "time": "3 Jan 2006 — 12:48pm",
      "content": "When it comes to novels in particular, it's such a different skill set and also so time consuming, it makes more sense from a time/management perspective, too. Though I'd be interested to see a series of books designed entirely by one person/group to see if there's a greater unity to them.\n\n"
    },
    {
      "time": "3 Jan 2006 — 12:51pm",
      "content": "I'm in publishing and it's true that imprints that publish largely fiction and trade non-fiction tend to have separate departments for covers and interiors; however I have never understood why the two can't communicate better. It's disconcerting when they don't mesh.\n\nI work in illustrated books (art books, cookbooks, photo books, travel, etc) and in that sort of publishing it is much more the norm for the same designer to do the entire book, soup to nuts. Unless it's a buy-in from a foreign publisher in which case they often just slap a new jacket on it.\n\n"
    },
    {
      "time": "3 Jan 2006 — 1:03pm",
      "content": "The reason for separate designers with books is the cover designers are only concerned with POP. Once the book is sold it isn't always a priority that the interior content even be related to the cover. As a song in Caberet says \"Money makes the world go round…\"\n\n"
    },
    {
      "time": "3 Jan 2006 — 1:17pm",
      "content": "Sure, but that is still no excuse. It's unfortunate too that designers don't have a little more fun with the interiors. Not at the expense of legibility, but for the title page, chapter openers, etc.\n\n"
    },
    {
      "time": "3 Jan 2006 — 3:38pm",
      "content": "Patty is right. There would be some great things happen but it might cost the publisher a few cents more so it won't happen :-\\<\n\nChrisL\n\n"
    },
    {
      "time": "3 Jan 2006 — 8:14pm",
      "content": "_It seems odd to me that publishers would use two designers_\n\nNot really.  \nThe cover design is all about marketing and the book as product -- a complex business concerning how it is positioned. I've done some cover design work for a publisher which has at least a dozen categories of fiction, and much time was spent positioning the book with regards to the author's prominence in the marketplace, and nailing the exact genre. You have to know how big to make the author's name in relation to the title -- that kind of stuff is crucial! I was paid a good freelance dollar, but the interior of the books were handled in-house, less expensively.\n\nCompared to all that, the design of the interior is not such an issue.\n\nNow, if the book buyer is a browser in a bookstore, who picks up the book and makes a purchasing decision based on the thing in their hands, that would put more emphasis on the interior, but that's nowhere near as important as getting the browser to even pick the book up in the first place. And if they're buying it from Amazon....\n\n"
    },
    {
      "time": "3 Jan 2006 — 8:29pm",
      "content": "Point taken: you can judge a book by its cover, especially in the age of Amazon.\n\nI guess coming from an illustrated book background I like to feel like the whole book is mine, rather than open it and recoil in horror (as I have many times when I've designed only the cover).\n\n"
    },
    {
      "time": "4 Jan 2006 — 1:02am",
      "content": "Over here, when it comes to fiction, book interiors are always designed by a different person than the cover. While various freelance and in-house designers and fine artists are hired to do the covers, most often an entire group of books have similar interiors. It saves a lot of expenses and serves other two purposes: to promote recognizability of the publishing house and to create a feeling that the next book the buyer is looking at has the same qualities, as the one before that looked quite the same. Unfortunately, that sometimes results into great incompatibility between the inside and outside of the book. And yes, the best book designs here are, more often than not, spoofs of foreign examples.\n\n"
    },
    {
      "time": "4 Jan 2006 — 3:38pm",
      "content": "It would be great if book sellers (particularly online) would include a 'quality of typesetting' line or section. It might help between editions...\n\n...yeah, right.\n\n"
    },
    {
      "time": "4 Jan 2006 — 6:02pm",
      "content": "So now that we're on the topic of Requiem, it's been opined that it isn't really suited for book-setting - that is, long tracts of text. Too much \"sparkle\" or something.\n\nThen you look at Dolly, for instance, which was designed with the hot-metal tradition in mind - ideal for books.\n\nRequiem seems to be a rather high-contrast face, but I still like it for long text just the same. It's a truly beautiful face.\n\n"
    },
    {
      "time": "4 Jan 2006 — 7:35pm",
      "content": "While I understand the publishing practice of shopping-out covers to experienced designers while fumbling horribly with the interiors in-house (which is not to say I think this is a good idea in any way, shape or form -- interiors just don't get the respect/attention they should/deserve), what boggles me is that I've found resistence to connecting the two participants to discuss their design(s). I have a couple of clients where the conventional situation is reversed (the publisher's production manager is also a designer and so handles the covers, while shopping the interiors out). I (freelance) design primarily interiors and time and time again I've found a brick wall at publishers' production departments when I ask to see what the cover designer's up to, or suggest I touch base with the cover designer to pass along a sketch of the titlepage I'm working on. Again, I understand that covers \"need\" to be all flash and eye-candy, but it just seems like screaming common sense that the cover and title page should at least use the same display type. This is one of a handful of things that simply makes my head hurt in commercial book design. Don't get me wrong, I love my clients and the freedom they give me to do my job, but in many instances I'd almost appreciate less freedom so that we could both better serve the book.\n\nLuckily I also run a small press of my own so that I can design books from top to bottom as cohesive/organic objects, from materials, to type, to design.\n\n"
    },
    {
      "time": "4 Jan 2006 — 8:28pm",
      "content": "I agree completely. The interiors of fiction and trade nonfiction take so little time to produce that there is no reason on earth that at least the title page can't be designed late in the game to reflect the cover treatment.\n\nI was once hired to design only the interior of a cookbook. I asked to see the cover and they told me it didn't have to match. After I had produced a set of samples they decided I was right after all, they should match, so they sent me the cover, which was hideous. I redesigned the interior to match, reluctantly. Then when I got the finished book they had redesigned the cover (still hideous) and it no longer matched the interior I had done. Unbelievably frustrating.\n\n"
    },
    {
      "time": "5 Jan 2006 — 3:23pm",
      "content": "Jason (and anyone else in the publishing industry):\n\nI read a significant amount of books from the same small group of publishers and most of them don't apply some type-basics in their interiors such as ligatures, and not indenting the first line after a heading. Would it help for me to write them a letter about how I'd like to see some better typography in their books? Would the input of a single customer make a difference? If I was nice about it, of course.\n\n"
    },
    {
      "time": "5 Jan 2006 — 5:03pm",
      "content": "It is mindboggling how much bad typesetting you see out there. I've worked with editors and designers who don't even know what a ligature is. This is a product of the Mac age - now designers are expected to be typesetters as well - when that used to be a specialty. They never learn proper rules regarding H&Js, expert collections, small caps, ligatures, fractions, etc.\n\nI don't know that a letter would make that much difference but it doesn't hurt to try - address it to the art director.\n\n"
    },
    {
      "time": "5 Jan 2006 — 7:02pm",
      "content": "Thanks for the offer Peter, but I'm lucky enough to work with clients who do actually understand that interior design involves more than just flowing the content. I had a contract a couple of years ago to design & set a collection of letters. The pay was lousey but it was a book/author I felt strongly about so spent a good amount of time developing the design and sent in a set of comps. What I got back essentially amounted to \"we know this is how the book should be done, but it's not what the editor had in mind.\" And what did the editor have in mind? Thinner margins, smaller type, less leading. That is, make it cheaper to print. That, in a nutshell, is the mentality of many publishers, and as publishing is a business, I suppose it should be. However, I'm lucky to have a few steady clients who want well designed & set books, and because I've had the opportunity to design a few of them, my portfolio has been fairly successful at bringing in more of the same kind of work.\n\nAs for that contract a few years ago, I turned it down and haven't worked with the publisher since.\n\n"
    },
    {
      "time": "6 Jan 2006 — 8:23am",
      "content": "Thank you everyone for your very nice comments about Requiem!\n\nI've also noticed that the fonts get used far more often in large sizes than in small, which almost makes me regret the winter I spent creating proper optical sizes for the family. The strangest part of this is that half of the display settings I see use the Requiem Text master, not the Display or Fine tunings that were specially made for large sizes. I don't know whether designers are proofing their work only casually, or whether the \"Text/Display/Fine\" nomenclature isn't sufficiently intuitive; right now I'm struggling to finish a book that uses Requiem Display for its chapter headings, Requiem Text for its cover (?), and Requiem Fine for its text (!?), choices that I can't imagine were made intentionally. Any chance that those hairline serifs made for 48pt would be readable at 11pt is wholly obliterated by the choice of stock: the book uses a bright white stock with a heavy gloss coating, making the whole enterprise really unbearable!\n\nRegarding the insides and outsides of books, my experience is consistent with all of yours: within the publishing industry, there's an entrenched division between these two departments. Years ago, when Barbara de Wilde was at Knopf, she asked me to design a typeface specifically for the work of William Maxwell, as Knopf was preparing to publish a collection of his short stories. We spent some time writing a colophon, which described the typeface in both historical and cultural terms, and how it was that we came up with a design that we hoped would be sympathetic with Maxwell's writing. The book came out, the cover was lovely, and Barbara was thoughtful enough to include a \"Typeface design by\" credit on the inside flap. And inside, ran the colophon:\n\n<cite>A NOTE ON THE TYPE</cite>\n\n<cite>This book was set in Janson, a redrawing of type cast from matrices long thought to have been made by the Dutchman Anton Janson, who was a practicing type founder in Leipzig during the years 1668-87...</cite>\n\n"
    },
    {
      "time": "6 Jan 2006 — 12:00pm",
      "content": "_...half of the display settings I see use the Requiem Text master,_\n\nDisplay styles are great for most purely typographic settings, but it may be that some of these uses have the type surprinted over images, where the designer felt that a stronger presence was necessary.\n\nThere is also the in-store situation to consider -- a publisher I've done work for has bookstore shelving set up in his office, so he can place prototype cover designs in a retail setting, and see how they fare from the other side of the room. He is also concerned that small images of the book cover, in his trade catalog and online, should show well. There is a marketing merit to this approach, but I've found that it skews my design work to be horsier than I would ideally prefer -- my benchmark being holding the book.\n\n"
    },
    {
      "time": "6 Jan 2006 — 12:18pm",
      "content": "\"Bang, bang, Maxwell's silver hammer...\" changed to Janson's pewter mallet :-)\n\nChrisL\n\n"
    },
    {
      "time": "6 Jan 2006 — 7:51pm",
      "content": "Jonathan, I've noticed similarly odd choices elsewhere. I think some graphic designers/art directors are attracted to the more robust forms of smaller optical weights for display/headline size, partially because they're taught to make headlines pop and have weight, as opposed to unity and grace.\n\nAt least that's my theory. I suppose we designers just want to do it our own way, original intent be damned.\n\n"
    }
  ]
}
