{
  "id": "1705",
  "title": "UPM value VS Glyph Details",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Greetings,   \n   \nI am trying to make a Type1 Logo Font, with FontLab 4.6 on Mac OS X.   \n   \nTo get the best possible result (details), I am using a UPM value of 5000. If I could, I would go even higher. Does this makes sense or am I off track. Is there a limit on UPM value one can use? At a value of 1000, the shapes gets distorted while at 5000, this is almost perfect.   \n   \nIn Suitcase (OS X) I just can't see the glyph I assigned to the letter \"B\". Is there an easy way to generate this Type1 font for Mac?   \n   \nWhat would be the most important parameters to use (in FontLab -- Font Info), to make sure it works OK?   \n   \nKind Regards,   \n   \nYves\n\n",
  "author": "yves_malouin",
  "time": "17 Oct 2003 — 2:21pm",
  "uid": "2484",
  "comments": [
    {
      "time": "18 Oct 2003 — 6:45am",
      "content": "FWIU no matter what UPM you use in the design space, once you make a Type1 font it is converted to a 1000 UPM so by working at 5000, you will introduce rounding errors.   \n   \nIf the logo is that detailed that 1000 UPM wokspace make it distorted, it may be best to keep in in an importable eps format.   \n   \nOr make a TrueType version of the logo, working at 2048 and with FontLab you can hint the Bejeezes out of it to control its small size rendering.   \n   \nJames\n\n"
    },
    {
      "time": "18 Oct 2003 — 10:15am",
      "content": "Huh. That's an unfortunate limitation. The Type 1 format itself supports arbitrary UPM values (though 1000 is what people almost universally use).   \n   \nT\n\n"
    },
    {
      "time": "18 Oct 2003 — 11:12am",
      "content": "So maybe I'm wrong. I've just always found that font deitors export Type1 at 1000 upm. Is there a work around.\n\n"
    },
    {
      "time": "18 Oct 2003 — 11:27am",
      "content": "I have a logo font here, that I created a while back when I was on Mac OS 9.2 or 8.5. Never had troubles with it until I moved to OS X. I was using it principaly for my invoices in FileMaker. I would then output the FileMaker invoice to a PDF file, where my Logo Font was embedded. This, gave a more interesting finish than importing an eps in FileMaker. It was a question of antialiasing. I did many tests and never succeeded to import a vector graphic in FileMaker that would output as vectors. It seems it always convert the file to a pict.   \n   \nSince I moved to OS X, that font is not working anymore and I don't understand why. Wish someone could explain me why.   \n   \nTo make a test, I just opened in FontLab 4.6 this working Type 1 LogoFont (the PS file) I created a while back, and in the Info, the UPM shows to be 5882.   \n   \nI have the feeling that something has changed in OS X and I don't know what and why...?   \n   \nWhat I liked, and that was sort of usefull, is the negative kerning, where the combination of different keys was giving me the possibility to use a mask underneath the logo, and to color differently each parts, depending on the visual application.   \n   \nIf anyone interested... give me a ring and I'll send you the LogoFont to check.   \n   \nI feel I have been struggling with this issue since too long now. I discovered this forum yesterday and said to myself: \"If no one has the answer here... you will never have any\".   \n  \nThis forum seems to be the good place to ask for help.   \n   \nKind Regards,   \n   \nYves\n\n"
    },
    {
      "time": "18 Oct 2003 — 11:28am",
      "content": "Actually, this was reported as a bug to the FontLab folks a while back. I just tested it in FontLab 4.6.1 and it seems to work fine!   \n   \nI took Myriad Pro Italic, set the em square to 2200, didn't scale the glyphs, and exported as a (renamed) Type 1. The resulting font behaves as I would expect.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "18 Oct 2003 — 11:31am",
      "content": "Hello Thomas,   \n   \nAre you on Mac OS X ?   \nYou tested it on Mac OS X ?   \n   \nYves\n\n"
    },
    {
      "time": "18 Oct 2003 — 11:39am",
      "content": "I don't think this is realted to OS X, but to the tool itself....   \n   \nT\n\n"
    },
    {
      "time": "18 Oct 2003 — 1:31pm",
      "content": "Here I post a Type 1 -- LogoFont -- UPM 5882 -- I created for a customer to ease the visual identity usage for PDF files.   \n   \nDownload for testing:\n\n<!--attachment: Atlante_Mac-18835.zip*attachment_icon.gif*application/zip*104.0*Atlante%2dLogoFont%2dForTestsOnly*Atlante_Mac%2ezip --><!--attachment: Atlante_Mac-18835.zip*attachment_icon.gif*application/zip*104.0*Atlante%2dLogoFont%2dForTestsOnly*Atlante_Mac%2ezip -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131103161532im_/http:/www.typophile.com/forums/icons/attachment_icon.gif\" align=\"left\" alt=\"application/zip\">Atlante-LogoFont-ForTestsOnly<br><a href=\"http://web.archive.org/web/20131103161532/http:/www.typophile.com/forums/messages/4101/Atlante_Mac-18835.zip\" target=\"_blank\"><b>Atlante_Mac.zip</b></a> (104.0 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nI created it in 2001 with FontLab 3.1.   \nNever had trouble using it, before the move to OS X and Suitcase 10.   \n   \nI used to be able to use it in FreeHand but now in FreeHand MX... no way. Samething in FileMaker. Can't use it. It shows up as bitmap, and when trying to convert it to paths in FreeHand, it seems it can't find the PS file even if it is located in the same folder as the suitcase file.   \n   \nQuestions, Questions, Questions...   \n   \nThere seems to be some Gremlins under the OS X hood.   \n   \nRegards,   \n   \nYves\n\n"
    },
    {
      "time": "18 Oct 2003 — 11:41pm",
      "content": "Nope, I'm not on OS X myself. Sorry for missing this point earlier. So two questions:   \n   \n- does the tool support making such fonts?   \n- do they work in OS X?   \n   \nIf they don't work in OS X, that would be an OS X bug. It would not be the first significant OS X problem that causes perfectly good fonts to not work. ![:-(](http://web.archive.org/web/20131103161532im_/http:/www.typophile.com/forums/clipart/sad.gif)   \n   \nT\n\n"
    },
    {
      "time": "25 Oct 2003 — 6:12am",
      "content": "You may try re-generating your font in FontLab 4.6 or 4.6.1 (as it is released).   \nAdam\n\n"
    },
    {
      "time": "25 Oct 2003 — 1:22pm",
      "content": "Years ago, when I first tried making Type 1 fonts with arbitrary UPM values, I did find that some PS emulations in printers gagged on anything other than 1000. Not sure whether this would be a live issue.\n\n"
    }
  ]
}
