{
  "id": "17054",
  "title": "Allyson",
  "forum": "Script / Handwriting / Graffiti",
  "tags": [
    "Script / Handwriting / Graffiti"
  ],
  "content": "Named for my lovely sister. This is a revival of an old [BB&S](http://web.archive.org/web/20150123045021/http:/typophile.com/wiki/barnhart_brothers_and_spindler) face called Hazel Script. Still in it's early stages, i need some feedback. I'm afraid some of the connections are still wonky? If anyone has any advice, please share!\n\n ![](http://web.archive.org/web/20150123045021im_/http:/typophile.com/files/Annc.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [Annc.pdf](http://web.archive.org/web/20150123045021/http:/typophile.com/files/Annc.pdf) | 13.98 KB |\n| [AllysonPro.pdf](http://web.archive.org/web/20150123045021/http:/typophile.com/files/AllysonPro.pdf) | 27.1 KB |\n| [AllyCmuxu.pdf](http://web.archive.org/web/20150123045021/http:/typophile.com/files/AllyCmuxu.pdf) | 25.8 KB |\n\n",
  "author": "paul d hunt",
  "time": "3 Jan 2006 — 7:23am",
  "uid": "7006",
  "comments": [
    {
      "time": "3 Jan 2006 — 9:14am",
      "content": "Reminds me to old penmanship writing lesson books. The lower p and r looking very accient. Some glyphs would look better on word beginnings and endings without their connection stroke. The upper case N sems to be broken. Maybe you can enhance the design if you try to write like some would write today, trying to catch this penman style. - So you have two designs, the 1900 and the 2000 version. :-) The connections look ok, since this is an adaption of handwriting for metal. Using Opentype features could give a closer impression of hand writing.\n\ntry to search for some of these little lesson books for more inspiration: C. C. Lister's Progressive Penmanship\n\n-- [astype.de](http://web.archive.org/web/20150123045021/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "5 Jan 2006 — 4:11pm",
      "content": "You asked for it. :^P\n\nm / n / h / p -- At first I did not enjoy the sharp final curve. It has grown on me, but I did read the /m/ and /n/ as /nc/ and /nc/ the first time around.\n\n/or/ -- the connecting stroke in between these to characters seems a little flat\n\n/he/ -- there is a little bump happening from the exit on the /h/ and the entry on the /e/ -- looking again the same problem occurs with /de/ so I would guess the problem is with the /e/\n\n/Re/ -- the connection seems a little stiff\n\n/t/ -- entry stroke seems stiff\n\nOverall color -- very nice. I could say that some of the letters could use a little more of that filling in that letters such as the /f/ has. The caps all have it and I really like it. This feels like copperplate engraving and it is gorgeous. I freak out a little when letters are so thin and often call them spindly and without spine, but this ultra-refined, even haute couture-esque.\n\nOh well. I will say it anyway. I love this. I just wish the lowercase had a little more of the same \"filled-in\" or \"cut too deep\" spots.\n\n"
    },
    {
      "time": "5 Jan 2006 — 4:12pm",
      "content": "Oh and I expect more weights and a bazillion alternates. :^P\n\nWhen I say weights I mean the filled-in bits get fatter, and the contrast increases. Not the overall letter gets fatter.\n\n"
    },
    {
      "time": "5 Jan 2006 — 4:14pm",
      "content": "/di/ -- same problem as /de/\n\n"
    },
    {
      "time": "5 Jan 2006 — 4:29pm",
      "content": "yay! thanks for your input, tiff. i think helps so much to have a fresh pair of eyes check things out for me sometimes. i'll take the things you noticed to heart and make the required changes. thanks again. critiques are still welcome...\n\n"
    },
    {
      "time": "16 Mar 2006 — 8:15am",
      "content": "hmmm... well if anyone cares to take a look, i've expanded this one quite a bit. New attachment to initial message called \"Allyson Pro\" shows all the bells and whistles... well not ALL.\n\nalso, i've almost completed a cyrillic component to go along with this one. does anyone think it would be worthwhile to finish that up as well?\n\n"
    },
    {
      "time": "16 Mar 2006 — 8:35am",
      "content": "Cyrillic?\n\nWhy are you worried about pirates? Posting a PDF or in general?\n\n"
    },
    {
      "time": "16 Mar 2006 — 9:19am",
      "content": "heh. i edited my post above so as not to sound so bitter and cynical. i'm afraid you read my old post before i had a chance to censure myself. \\>^P\n\n"
    },
    {
      "time": "16 Mar 2006 — 10:03am",
      "content": "Yes, Paul, finish the Cyrillic! This script would probably be very wonderful applied to those glyph forms.\n\n"
    },
    {
      "time": "17 Mar 2006 — 12:37pm",
      "content": "Well... apparently just to humor Miss Tiff and myself...\n\n ![](http://web.archive.org/web/20150123045021im_/http:/typophile.com/files/Zhestokiy.gif)\n  \nIf you want a closer look, PDF 3 gives a more detailed look at the cyrillics. Oh, and yes, that second line is a real word. It means \"Self-defrosting\" and it's so much fun to say! _(Samorazmorazhivayushchiysya)_\n"
    },
    {
      "time": "17 Mar 2006 — 2:24pm",
      "content": "So you need Maxim and Adam's attention for this one...\n\n"
    },
    {
      "time": "17 Mar 2006 — 2:25pm",
      "content": "I knew it would look gorgeous.\n\n"
    },
    {
      "time": "22 Mar 2006 — 12:37pm",
      "content": "I think it is one of the prettiest script fonts I've ever seen.  \n(based on the AllysonPro.pdf)\n\n"
    },
    {
      "time": "22 Mar 2006 — 1:54pm",
      "content": "why thank you.\n\n\\*me blushing\\*\n\n"
    },
    {
      "time": "10 Apr 2006 — 7:32am",
      "content": "now available through [IHOF](http://web.archive.org/web/20150123045021/http:/typophile.com/wiki/IHOF):\n\n[http://p22.com/ihof/allyson.html](http://web.archive.org/web/20150123045021/http:/p22.com/ihof/allyson.html \"http://p22.com/ihof/allyson.html\")\n\n"
    },
    {
      "time": "10 Apr 2006 — 7:49am",
      "content": "[http://p22.com/ihof/allyson.html](http://web.archive.org/web/20150123045021/http:/p22.com/ihof/allyson.html \"http://p22.com/ihof/allyson.html\") tells me there are 900 glyphs in the pro version. Excuse my limited experience, but can those be accessed in the alt + method? If so, is there a .pdf table that details it?\n\nOr only through certain programs that are set up for it?\n\nMy character viewer only has 256 characters. Are there character viewers that go beyond that?\n\n"
    },
    {
      "time": "10 Apr 2006 — 7:54am",
      "content": "The pro set comes with The OT font and all glyphs can be accessed through the glyph pallette in InDesign and Illustrator. The regular version of the font and an \"Xtras\" font is also supplied in the pro set to make some features more accessible for users of programs such as word or photoshop, or whatever. These can be input by the alt method. No pdf documentation yet, but that's a very good idea. I should get on that...\n\n"
    },
    {
      "time": "10 Apr 2006 — 8:32am",
      "content": "Font Player, [FontExplorer X](http://web.archive.org/web/20150123045021/http:/typophile.com/wiki/FontExplorer%20X), which is free but currently only available for MacOS X, will show you all of the characters in a font.\n\nPaul, you've got faces comin' out left and right!\n\n"
    },
    {
      "time": "10 Apr 2006 — 10:20am",
      "content": "By company policy I am bound to PC. But I have learned to live with my jealousy.\n\n"
    },
    {
      "time": "10 Apr 2006 — 10:29am",
      "content": "You could say, that Paul is two-faced. =^P (Had to try to beat Chris to this one.)\n\n"
    },
    {
      "time": "5 Jul 2006 — 9:06am",
      "content": "interesting... i found a Ukrainian discussion of this, too bad i don't understand what's being discussed. Anyone care to translate? :^p  \n [http://community.livejournal.com/ua\\_typography/57396.html](http://web.archive.org/web/20150123045021/http:/community.livejournal.com/ua_typography/57396.html \"http://community.livejournal.com/ua\\_typography/57396.html\")\n\n"
    },
    {
      "time": "8 Jul 2006 — 2:05pm",
      "content": "They're loving it. Two problems mentioned with transition from latin\n\n- \"C\" reads as cyrillic \"B\" (V)  \n- Lowercase \"б\" (b) needs correction\n\n"
    }
  ]
}
