{
  "id": "17068",
  "title": "text face w/ matrix script bold headlines",
  "forum": "Design",
  "tags": [

  ],
  "content": "I'm in bit of a conundrum over a project due tomorrow morning, and my usual procrastination adrenaline isn't giving me any good ideas. Any suggestions for what text face would look good with Matrix Script Bold as the headline font? Thanks!\n\n",
  "author": "<a href=\"/web/20110524040544/http://typophile.com/user/10069\" title=\"View user profile.\">FeeltheKern</a>",
  "time": "<br>",
  "uid": "10069",
  "comments": [
    {
      "time": "",
      "content": "What about ' [Matrix](http://web.archive.org/web/20110524040544/http:/www.emigre.com/EF.php?fid=105)' itself ? :)\n\nDav\n\n"
    },
    {
      "time": "",
      "content": "You read my mind, Dav, I was gonna suggest the same.\n\n"
    },
    {
      "time": "",
      "content": "Yes, but do sub in Kris's actually-usable \"g\" from here:  \n [http://typophile.com/node/14378](http://web.archive.org/web/20110524040544/http:/typophile.com/node/14378 \"http://typophile.com/node/14378\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I think the real challenge is to find an Emigre font that doesn't have at least one character you want to redesign! No offense to anybody but try the \"a\" in Priori, the \"k\" in Dalliance, the list goes on and on. It's so frustrating.\n\n"
    },
    {
      "time": "",
      "content": "Oooh. I love the \\_k\\_ in Dalliance.\n\n"
    },
    {
      "time": "",
      "content": "Actually, I think Eidectic Neo would work with Matrix Script.\n\n"
    },
    {
      "time": "",
      "content": "Patricia, Stephen once said [almost] exactly the same thing:  \n [http://www.typophile.com/node/14346](http://web.archive.org/web/20110524040544/http:/www.typophile.com/node/14346 \"http://www.typophile.com/node/14346\")\n\nTo me, Eidetic was actually Emigre's first (and still only?) real text font.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Nah. I disagree, Hrant. If you think Eidetic works as text then Tribute qualifies as a text font. Vendetta too. Fairplex might. Mrs. Eaves sorta. Eidetic has some characters that really leave me cold. I would only use it as a display font.\n\n[Edit: Generally, Eidetic isn't my cup of tea. That's all.]\n\n"
    },
    {
      "time": "",
      "content": "I think Filosofia is a great text font. Mrs. Eaves would but it's too wide for most uses. I'm not nuts about Eidetic either, but I like Tribute. Somehow the poopy glyphs work for me there.\n\nTry getting a client to go for the \"k\" in Dalliance\n\n"
    },
    {
      "time": "",
      "content": "Right. I forgot about Filosofia.\n\n"
    },
    {
      "time": "",
      "content": "I don't love Eidetic. But I try to put my personal tastes  \naside when it comes to judging if a font is texty or not.\n\nTribute: I agree, it's a text face. Note that I put a  \nquestion mark after \"still only\" - basically because I  \nhaven't been following Emigre recently. I remember  \nwhen Eidetic came out I thought it was their first real  \ntext face - so I stand by that. Tribute's \"g\" was suspect  \nto me when I first saw it, but then I saw the issue of  \nthe magazine where it was used, and realized it's fine.  \nSo I'm sorry, I forgot to remember Tribute.\n\nVendetta: Out of context I agree that it <cite>can</cite> be a  \ntext face. But it has a \"fatal\" problem in that respect:  \nits central feature -the facetness- can only really click  \nwith optical masters. Lacking optical masters, that feature  \nbasically kills it as a well-rounded text font: if you set it  \nat more than one size, it becomes more than one face.  \nExcoffon knew this, which is why -even with the  \navailability of the pantograph- he decided to make  \nMistral's roughness inversely proportional to size.\n\nThe others: no.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I have tried to use Vendetta for text and always end up using something else instead.\n\nHrant, why not Filosofia? Just curious...\n\nEdit: I should add that I'd use Eidetic in a heartbeat over Fairplex. They struck out with that one in my book.\n\n"
    },
    {
      "time": "",
      "content": "Filosofia is a Didone, and its high contrast coupled with  \nthe vertical axis and the high regularity put it outside  \nwhat I class as a text face. With some ink bleed at small  \nsizes it would have a better chance, but its proportions  \nare too dainty for small text.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Fairplex was a bad suggestion. It is more a display/headline/advertising text font. Filosofia is a Didone, but a very warm and warn one. Again, though, not completely well suited for reading. I once saw a cookbook done with Vendetta and it was lovely. I think Vendetta might be a tad thin, but if you use the Medium weight and can afford a larger point size it is nice.\n\n"
    },
    {
      "time": "",
      "content": "\\> if you use the Medium weight and can afford a larger point size it is nice.\n\nIn fact Vendetta's vertical proportions are quite refreshing that way.\n\nhhp\n\n"
    }
  ]
}
