{
  "id": "17067",
  "title": "Photo Typesetting ... resource?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi all, I’m about to start teaching typography again and one of the things i’ve never been able to find a simple resource for is something that explains, or preferrably shows the process of photo typesetting. I try to explain it to my students, how we used to have fonts on strips of film (and later, small cards) like negatives, and how these were mounted on drums, and the drums spun around really fast as light shot through the negatives for each letterform, exposing it at the correct size onto photographic paper.\n\nWell, naturally, it’s bewildering, and I’ve long wished that there were a little movie, much like the numerous little movies there are out there showing metal type setting, lead casting, etc.\n\nDoes anyone know of something like this on the web, or ... ???\n\n [‹ Pre-computer era data graphics](http://web.archive.org/web/20080908101553/http:/typophile.com/node/17151 \"Go to previous forum topic\") [Frustrating fun with letters ›](http://web.archive.org/web/20080908101553/http:/typophile.com/node/17112 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080908101553/http://typophile.com/user/9691\" title=\"View user profile.\">marian bantjes</a>",
  "time": "<br>",
  "uid": "9691",
  "comments": [
    {
      "time": " 3.Jan.2006 5.09pm",
      "content": "There’s this by Peter Bain on display phototypesetting:\n\n[http://stbride.org/friends/conference/hiddentypography/phototype.html](http://web.archive.org/web/20080908101553/http:/stbride.org/friends/conference/hiddentypography/phototype.html \"http://stbride.org/friends/conference/hiddentypography/phototype.html\")\n\n"
    },
    {
      "time": " 3.Jan.2006 9.22pm",
      "content": "Hey Mark!  \nDidn’t you [write an article](http://web.archive.org/web/20080908101553/http:/www.marksimonson.com/article/105/lego-the-type-designers-friend) about using Legos to use an old VGC Typositor film font?\n\n"
    },
    {
      "time": " 3.Jan.2006 9.27pm",
      "content": "[Pics of VGC Typositor and film font](http://web.archive.org/web/20080908101553/http:/www.incipit.com/linkrefs2.html).\n\n"
    },
    {
      "time": " 3.Jan.2006 9.31pm",
      "content": " ![](http://web.archive.org/web/20080908101553im_/http:/typophile.com/files/compu1.gif)\n\nCompugraphic CompuWriter IV, with filmstrip and width cartridge cabinet on the left.\n\nOh, yeah... I forgot all about the [**Staromat**](http://web.archive.org/web/20080908101553/http:/www.pismolijna.cz/staromat.html) I also used to set headlines, but you had to use it in a darkroom like a photo enlarger.\n\nHey, and here’s a detailed diagram of the [VGC Phototypositor](http://web.archive.org/web/20080908101553/http:/bellsouthpwp2.net/b/c/bcarberry/tp.html).\n\n"
    },
    {
      "time": " 4.Jan.2006 8.37am",
      "content": "FWIW, Marian, you might try contacting the Museum of Printing in North Andover, [www.museumofprinting.org](http://web.archive.org/web/20080908101553/http:/www.museumofprinting.org/ \"www.museumofprinting.org\"), to see if there are any period films from the original manufacturers (that could be converted). I’m guessing they might still exist. Frank Romano wrote a good capsule history of phototypesetting from the North American perspective in Printing History, the APHA journal, Number 46 (Volume 23, No. 2) 2003, as an eyewitness.\n\nIf you haven’t come across it already, download this article by Andrew Boag, on Monotype’s photosetting equipment, written for the Printing History Society, the graphics will help. [www.letterpress.ch/APINET/IMMPDF/MONOPHOTO/PHS\\_journal.pdf](http://web.archive.org/web/20080908101553/http:/www.letterpress.ch/APINET/IMMPDF/MONOPHOTO/PHS_journal.pdf \"www.letterpress.ch/APINET/IMMPDF/MONOPHOTO/PHS\\_journal.pdf\")\n\n"
    },
    {
      "time": " 4.Jan.2006 9.54am",
      "content": "[http://www.designingwithtype.com/resources\\_book6.html](http://web.archive.org/web/20080908101553/http:/www.designingwithtype.com/resources_book6.html \"http://www.designingwithtype.com/resources\\_book6.html\")\n\n ![](http://web.archive.org/web/20080908101553im_/http:/typophile.com/files/PhotoType.jpg)\n\nChrisL\n\n"
    },
    {
      "time": " 4.Jan.2006 12.09pm",
      "content": "Hi all, Thanks so much for this. And I will indeed contact the museum of printing, thanks phil, as well as read your aticle (thanks mark), and the pics Norbert!\n\nIt’s funny to me how every time i try to explain any typesetting technology to students how mindblowingly laborious it all seems. I worked with a Linotronic 3000(??), among other things, and it always amazed me.\n\n-marian\n\n"
    },
    {
      "time": " 4.Jan.2006 1.51pm",
      "content": "Glad to be helpful...Phil Baines (no relation, different spelling) & Andrew Haslam’s _Type & Typography_ also has great illustrations of phototype artifacts, besides being an interesting textbook.\n\nGood luck with your class.\n\n"
    },
    {
      "time": " 4.Jan.2006 2.16pm",
      "content": "_...how mindblowingly laborious it all seems._\n\nBut just imagine going back in time and explaining to design students of 20 years ago how their future counterparts would have to sit at benches in sterile laboratories all day looking at computer screens, with a keyboard in front of them, preparing for a career as a digital drone.\n\n"
    },
    {
      "time": " 4.Jan.2006 2.41pm",
      "content": "_preparing for a career as a digital drone._\n\nFor those who can remember...  \n**JANUARY 23, 1884**\n\n ![](http://web.archive.org/web/20080908101553im_/http:/typophile.com/files/Apple1984ad.jpg)\n\nApple Computer, Inc. introduces the world’s first user-friendly, Macintosh personal computer. Its dramatic, Orwellian,1984-inspired Super Bowl TV ad introduces the product as a world smashing alternative to Big Brother’s grip on workers in dull grey drone attire... APPLE — PLEASE SAVE US!\n\n ![](http://web.archive.org/web/20080908101553im_/http:/typophile.com/files/Apple84hammer.jpg)\n\nMaybe the attire has changed... but the drones live on.\n\nFYI —\n\n ![](http://web.archive.org/web/20080908101553im_/http:/typophile.com/files/lisa300.jpg)\n  \nBefore there was the Macintosh, there was the Apple Lisa as the first desktop publishing front end. I worked on the Lisa for about a year at Compugraphic before the Cg’s top management decided the hippies at Apple were crazy and that we would not support them in font development. The rest is history... and so is Cg.\n"
    },
    {
      "time": " 4.Jan.2006 2.51pm",
      "content": "Boy that was some commercial in 1884 the trouble was watching it on the soon to be invented radio. But the real question is who played in the 1984 Super Bowl and who cares.\n\n"
    },
    {
      "time": " 4.Jan.2006 3.05pm",
      "content": "Norbert, don’t forget about the infamous CgScript that management said would replace PostScript.\n\n"
    },
    {
      "time": " 4.Jan.2006 3.18pm",
      "content": "Norbert I remember the yellow Lisa at Cg in the downstairs hall outside the server room and Advanced Tec (?). Now I remember you and Howard Berman. I have an old Apple rainbow label for a disk somewere and I think and Intellifont large disk somewhere. I just remember the VT100 and the ’private data’ that never made it to replace Postscrpt. I almost bought a Lisa from Cg when they were trying to sell them of with imagesetters.\n\n"
    },
    {
      "time": " 4.Jan.2006 3.43pm",
      "content": "Isn’t interesting how technology changes, I read an article about how Adobe can introduce a new version of their programs every 18 months. It seems they have programers work all day and then send the work over to India at the start of their work day. It makes programing a 24 hour a day process as they pass the work back and forth.\n\n"
    },
    {
      "time": " 4.Jan.2006 4.34pm",
      "content": "Perhaps one of the upsides of ye olde typesetting technology (pre-desktop publishing days) was that, generally, the people who produced typeset type actually knew what the f\\*\\*k they were doing...\n\n"
    },
    {
      "time": " 4.Jan.2006 4.50pm",
      "content": "I remember seeing a Lisa in a Compugraphic showroom around 1984. They had some sample output from the combo system. It didn’t look very promising. Lots of squashed/slanted type and fairly crude translation of QuickDraw graphics to hi-res output, seemingly using shapes built from individual characters tiled together or something.\n\nI thought the Lisa was really something when I first read about it. At $10,000, it was too expensive to imagine actually owning one. It made the Mac, at $2500, seem very reasonably priced. I bought one exactly a month after they were introduced.\n\nAround the same time I got my first Mac, I ordered a Compugraphic MCS digital typesetting system for us to use at MPR. It replaced an aging Compugraphic Editwriter II phototypesetter (one with a spinning drum like Marian describes above). Not long after that, I left with my Mac to start freelancing, using it for comps and stuff. The LaserWriter/Linotronic/PostScript thing hadn’t happened yet.\n\n"
    },
    {
      "time": " 4.Jan.2006 4.59pm",
      "content": "_CgScript_ — Yikes, Joffre, you haven’t forgotten (though I did).\n\n_Intellifont... Now I remember you and Howard Berman._  \nVince, the problem in those days was that everyone used to call me Howard, and they would call Howard — Norbert. No doubt you remember the names, but could you tell one from the other (not that anyone cared ;-( ).\n\n ![](http://web.archive.org/web/20080908101553im_/http:/typophile.com/files/nf_2.jpg)\nNorbert  \n\n ![](http://web.archive.org/web/20080908101553im_/http:/typophile.com/files/nf_4.jpg)\nHoward\n"
    },
    {
      "time": " 4.Jan.2006 5.21pm",
      "content": "Gee, when Norbert first met Vincent, it must have gone like this:\n\n ![](http://web.archive.org/web/20080908101553im_/http:/typophile.com/files/Vincent-Cosell.gif)\n\nChrisL\n\n"
    },
    {
      "time": " 4.Jan.2006 5.49pm",
      "content": "Oh, I don’t think I have ever met Norbert. That would be Dan (possibly). The showroom I was referring to was in Bloomington, Minnesota. Norbert would have been in Wilmington, Massachusetts, right?\n\n"
    },
    {
      "time": " 4.Jan.2006 6.03pm",
      "content": "How’s that Mark, better? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 4.Jan.2006 6.15pm",
      "content": "Right. I meant Vince, not Dan. I could edit that out, but I don’t want to risk disrupting the space-time continuum any further.\n\n"
    },
    {
      "time": " 5.Jan.2006 4.47am",
      "content": "LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": " 5.Jan.2006 7.13am",
      "content": "Yes I could tell Norbert from Howard Berman. Howard talked too fast and ran too much and you 2 were the original Mac heads but he with the bowed legs.\n\nThe Cg; Norbert and I worked at was at ’building 90’ in Wilmington MA. Cg was dotted all around the area.\n\nHoward was a bit upset when Agfa bought Cg and went on a bit about Bayer and there experiments during WWII.\n\nHe and I worked very close on the first TrueType fonts.\n\nI think you left about this time and you probably don’t remember the Agfa PostScript desktop printer that sold for $10,000 and use to clog up with paper every 50 sheets.\n\n"
    },
    {
      "time": " 5.Jan.2006 7.40am",
      "content": "_you 2 were the original Mac heads but he with the bowed legs._\n\nSo that’s why you would always look at my legs before saying, “Hi Norbert.” ;-)\n\nI started at Compugraphic in 1981 through the Agfa acquisition, through the time Bayer wanted to gain name recognition in the USA again, then back to just plain Agfa. I left in 1994 because I became increasingly interested in the new multimedia, interactive program development and the beginning stages of the graphical Internet (it was all text messaging prior to that).\n\nThe “high-end” type and imagesetting equipment were beginning to slow down in sales, and the Type Division (Font Technologies) was able to produce and sell fonts independently of Agfa front end devices. It was basically a rush to convert our outline library to PostScript, TrueType, etc. and at that time Linotype seemed to have had market lead. (A direct result of Apple partnering with Linotype for fonts after Agfa-Cg abandoned them because of the Lisa fiasco.)\n\nBut eventually “Font Technologies Division” prevailed and is now Monotype Imaging.\n\n"
    },
    {
      "time": " 5.Jan.2006 9.02am",
      "content": "Well, i think i’ve just been one-upped in the antiquated technologies department, several times over. I came into this in the last days of our Compugraphic machine, and a year later we got some PCs (yes, IBM XTs). For years I typeset in a v. little-known program called XyWrite: all manual coding, but which had certain features I miss to this day.\n\npreparing for a career as a digital drone.\n\nBelieve me, when I start looking at the details of getting anything onto press, from the 15th Century right up to the present, sometimes it’s hard to imagine it’s worth it.\n\n-marian\n\n"
    },
    {
      "time": " 5.Jan.2006 11.03am",
      "content": "Does anyone remember when Intertype and British Monotype both took the metal melting pots off their casting machines and substituted a camera. It was really cumbersome and silly, but they were trying to salvage the ir vested interest in the machine, and the did work pretty well.\n\nI have a brochure here somewhere put out by the Monotype Corporation of England showing the caster conversion.\n\nJim\n\n"
    },
    {
      "time": " 5.Jan.2006 11.16am",
      "content": "You might check somewhere within these [chronicles by Lawrence W. Wallis](http://web.archive.org/web/20080908101553/http:/www.letterpress.ch/SPIPCASTER/article.php3?id_article=14) in which I have found little tidbits from time to time.\n\n"
    },
    {
      "time": " 5.Jan.2006 12.30pm",
      "content": "\\>Marian\\< PCs (yes, IBM XTs). For years I typeset in a v. little-known program called XyWrite:\n\nwe use to use an IBM XT to write disks for Intellifont from Digital mainframes. Test them in DOS then run print tests on an HP laserjet II..I think I wrote my first CV in XyWrite.\n\nNorbert I left Agfa in ’93 to go to Microsoft. It’s funny to find out that alot of people are still there. It weirds me out when I think of it.\n\nThe best thing I remember was there was a room bigger than a london flat that held positive and negative film versions of all typefaces in little grey trays. These positives were scanned on a drum scanner and used in the 8000 series of digital typesetters. The digital format was vector graphics and made the contours out of straight lines, even on curves. Then for the 9000 series they scanned them again and used two shifts of 40-50 people to convert these into Ikarus (line and arc) outlines. Then there was ’Type 3’ unhinted PostScript. CgScript I think was Type 3 wasn’t it?\n\nI made a series of Intellifont fonts that were for the HP Deskwriter for the Mac.\n\nThen there was Homogonized Outlines!!! HP Deskwriter fonts and PostScript.\n\nThe first TrueType fonts we tested were lighter than the PostScript fonts. Almost a different weight like a light to a regular. Early Postscript was very heavy. The marketing people were confused.\n\n"
    },
    {
      "time": " 5.Jan.2006 1.49pm",
      "content": "Another name from the past! Does anyone keep up with Howard Berman? His baby must be in grad school by now.\n\nIf you speak to him, do say hi!\n\n(I almost bought a used Lisa too, but in late 1983 heard a rumor about the Mac, so waited and bought that instead, then waited about 3 years before it really worked for design and type.)\n\n—Kathleen\n\n"
    },
    {
      "time": " 5.Jan.2006 2.22pm",
      "content": "I had kept in touch with Howard Berman for a while, even did some freelance work for the company he went to, ColorAge. Though I stay in close touch with many ex-Cg-Agfa people, no one has heard from Howard for a while. I’ll let you know if he shows up at the Agfa reunions that we run from time to time.\n\n"
    },
    {
      "time": " 5.Jan.2006 2.55pm",
      "content": "They should have a Cg reunion. I know tons of people who have worked for Cg and are now either on their own, at Microsoft, or Apple or many other places.\n\nI have to now dig up a drawing I did for the sales group once. I hope I can find it.\n\n"
    },
    {
      "time": " 5.Jan.2006 5.32pm",
      "content": "Oh I’m excited that someone else knew XyWrite. I typeset the promo material for Robert Bringhurst’s Elements in it ... One of those tumbles of letterforms down a page (or wait, maybe that was an Alcuin Society poster .. I forget), done non-wysiwyg.\n\nThen we had a programmer who wrote some kind of script to get XyWrite to talk to the image setters. We also had programmed tables for adjusting kerning pairs. These would produce paper tapes, which were then loaded into the image setter for each font.\n\noh. the joy.\n\n-marian\n\n"
    },
    {
      "time": " 6.Jan.2006 5.50am",
      "content": "“XyWrite” was the 1irst application to compose a postscript authored color magazine with custom fonts!\n\nWhen people talk about computer phototypesetters, the thing that comes to my mind is always the Smell(s) and the little grinding noises that meant bad things were happening. Also, there are a lot of links ’n things here I just can’t follow, but computer controlled phototypesetting was a rather short-lived, (by type stds.) transitional technology between metal, and computers, (seeing as some users skipped it completely for text). It was pretty ugly from preparation of fonts to alignment accuracy. Spinning drums, I’d think are not so exciting as some other things about phototypography. Manual setting of display type lasted a long time, (80 yrs?) allowed amazing quality, and anyone with 1/2-a-type-brain, some film, ink and a knife could make a font as good as anyone else...it was arguably the first really democratic font format since...(place argument here). So, I think the best educative source on photo type, or at least something that’d grab the imagination of young and hopefully susceptible typographically minds would be the massive twin volume photolettering specimen books, (though either volume would do), (see House, maybe).\n\n...2” x 48” pdf with an alphabet on it. output to film. a light proof em plaque. a dark room...smells.\n\n"
    },
    {
      "time": " 6.Jan.2006 6.36am",
      "content": " ![](http://web.archive.org/web/20080908101553im_/http:/typophile.com/files/Cg_lupe.jpg)\n  \nNothing like and old Cg lupe and a bit of Comic Sans and Trebuchet in the local Wimbledon magazine. The weirdos use Treb as the text copy.\n"
    },
    {
      "time": " 6.Jan.2006 9.12am",
      "content": "…2” x 48” pdf with an alphabet on it. output to film. a light proof em plaque. a dark room…smells.\n\nNow you’re onto something. Certainly a simulation of the font, and then perhaps galleys ... too bad i can’t capture the smells, or the sound. Coupled with some pics, some details, some memories ... I’m done!  \nBut really, I always did find those spinning drums fascinating ... and the flickering light.\n\n-marian\n\n"
    },
    {
      "time": " 6.Jan.2006 9.18am",
      "content": "\\>a dark room smells.\n\nwell the smell was from the fixer. I use to work for a newspaper and spend about 4-5 hours in a photo darkroom then had lunch and another 4 hours in the darkroom. It didn’t smell you just start hating the sun and it was a bit difficult to drive home.\n\n"
    },
    {
      "time": " 6.Jan.2006 9.28am",
      "content": "\\> _But really, I always did find those spinning drums fascinating_\n\nYeah but how about...  \n- the sound of a filmstrip clip letting go and your font thrashing into shreds at 100+ revolutions per second!  \n- the sound of your photopaper galley (with 2 hours of typesetting) getting jammed into an accordian wad during processing!  \n- the tearing sounds of photopaper wound too tightly in the paper cassette holder!  \n- the 2000 decible lambasting you get from your boss when the newspaper ad insertion deadline for photo-pasteups past an hour ago!\n\n"
    },
    {
      "time": " 6.Jan.2006 9.53am",
      "content": "_When people talk about computer phototypesetters, the thing that comes to my mind is always the Smell(s) and the little grinding noises that meant bad things were happening._\n\nSome things never change. Even in digital typesetting, a grinding noise is still a reliable indication that something bad is happening. Most likely that your hard drive is crashing.\n\n"
    },
    {
      "time": " 6.Jan.2006 10.11am",
      "content": "I like the smell of fixer and photo paper better than laser toner and it makes me sick just thinking of it.\n\nThe old DEC (LN-01) laser printers at Cg use to sometimes burn a line through the paper.. it was wicked pissa when it happened.\n\n"
    },
    {
      "time": " 6.Jan.2006 10.23am",
      "content": "Wicked Pissa! Vince, are you from Massachusetts? I haven’t heard that since I was in high school.\n\n"
    },
    {
      "time": " 6.Jan.2006 12.01pm",
      "content": "I am going down to Naraganset and have a [Cabinet](http://web.archive.org/web/20080908101553/http:/bated.org/archives/000027.html) :-)\n\nChrisL\n\n"
    },
    {
      "time": " 6.Jan.2006 4.12pm",
      "content": "yes born in Boston and played baseball for Milford High , Milford Legion and town team and I think Brian Cossgrove was in my class.\n\nand they use to call a beer a ’ganset’ for a Naraganset at the packee that you should not say in the UK.\n\n"
    },
    {
      "time": " 6.Jan.2006 5.24pm",
      "content": "Ahhh, “Ganset n’ quohogs! :-)\n\nChrisL\n\n"
    },
    {
      "time": " 7.Jan.2006 3.05am",
      "content": "Quahog Clam - ’Mercenaria mercenaria’ - according to ’Rich Stein’s Seafood’ book. Always thought it was a slang word. Also thought Scampi wasn’t a real seafood creature but of course they are like little lobsters or cray fish.\n\n"
    },
    {
      "time": " 7.Jan.2006 1.53pm",
      "content": "Need to ID this font.  \n Thanks Wille\n\n_\\*moderator’s note: moved type id request to:  \n [http://typophile.com/node/17135](http://web.archive.org/web/20080908101553/http:/typophile.com/node/17135 \"http://typophile.com/node/17135\") {pdh}\\*_\n\n"
    },
    {
      "time": " 7.Jan.2006 3.09pm",
      "content": "Wille,  \nTake it to the type ID forum instead of trying to hyjack another thread, ok?\n\nChrisL\n\n"
    },
    {
      "time": " 7.Jan.2006 9.39pm",
      "content": "_- the sound of a filmstrip clip letting go and your font thrashing into shreds at 100+ revolutions per second!_\n\nThis never happened to me, although we did once set an entire book with the wrong font on the position for the old style numbers, so that all numerals (except page numbers, which were, i guess, in another font) came out as some garbled mess; no-one noticed, and the book got printed that way. That was fun.\n\n_- the sound of your photopaper galley (with 2 hours of typesetting) getting jammed into an accordian wad during processing!_\n\nwhich you’d then have to unjam by picking at it with the top end of a pica ruler.\n\nor the dreaded realization that the the paper that went into the processor never came out the other side and was therefor wrapped around one of the rollers, drenched in chemicals.\n\n-marian\n\n"
    }
  ]
}
