{
  "id": "17069",
  "title": "Type Design Movements",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I know this is a kind of dumb question but can someone tell me all the different type movements? Thanks.\n\n",
  "author": "<a href=\"user/9904\" title=\"View user profile.\">orso2932</a>",
  "time": "<br>",
  "uid": "9904",
  "comments": [
    {
      "time": " 3 January, 2006 - 7:24pm",
      "content": "I had alphabet soup this evening for dinner. I’ll let you know how that goes. :)  \n(My apologies, I couldn’t resist— someone more knowledgable will certainly help you soon.)\n\n"
    },
    {
      "time": " 3 January, 2006 - 10:10pm",
      "content": "Hi Jason,\n\nI’m not sure what you mean by “movements”… could you explain what you mean. Do you mean culturally… as in Humanist, Modernist, Bauhaus, Art Deco????\n\n"
    },
    {
      "time": " 4 January, 2006 - 7:08am",
      "content": "yes humanist, modernist, art nouveau, art deco.\n\n"
    },
    {
      "time": " 4 January, 2006 - 11:23am",
      "content": "Arts and Crafts  \nConstructivists  \nDeconstruction\n\nChrisL\n\n"
    },
    {
      "time": " 11 January, 2006 - 3:24pm",
      "content": "Check out Lawson’s Anatomy.\n\nhhp\n\n"
    },
    {
      "time": " 12 January, 2006 - 8:21am",
      "content": "Hi there.  \ndoes anybody know the font used on the typo-berlin website ( [www.typo-berlin.de](http://web.archive.org/web/20060628172814/http:/www.typo-berlin.de/))?\n\n"
    },
    {
      "time": " 12 January, 2006 - 12:05pm",
      "content": "“does anybody know the font used on the typo-berlin website ( [www.typo-berlin.de](http://web.archive.org/web/20060628172814/http:/www.typo-berlin.de/))?”\n\nAnna,\n\nPlease post your request to the “Type Identification” forum where you will get a quick response?\n\nChrisL\n\n"
    },
    {
      "time": " 12 January, 2006 - 12:14pm",
      "content": "Such as the private press (late XIX and early XX century) and grunge (90’s) movements? It’s what came to my mind.\n\nHéctor\n\n"
    },
    {
      "time": " 12 January, 2006 - 1:08pm",
      "content": "Another way to categorize type trends would be by technology.  \nNew technologies and new design genres have always gone hand in hand.\n\nFor example, Baskerville’s letterforms, his smooth paper, extra black ink, and austere layouts.  \nIt was similar in a way to neoclassical architecture, such as Nash’s terraces, where the structural material (brick or stone) was covered with white stucco, to create the perfect surface — just as Baskerville had obliterated the wove. No trace of process or hint of human scale, a machine finish — the opposite of arts and crafts. So the physical style that is termed Neoclassical may just as well be called Mechanist or Scientism (another meaning for these words).\n\nRight now, there’s the OpenType movement.\n\nSpeaking of Scientism (in the established sense), that’s another contemporary movement, headquartered at Microsoft.\n\n"
    },
    {
      "time": " 12 January, 2006 - 1:20pm",
      "content": "I think Didone is more “Scientist”. Baskerville has a notable humanist streak - not “mechanical” at all. The exhibition of quality (probably JB’s prime motivation) isn’t necessarily reductionist at all.\n\nhhp\n\n"
    }
  ]
}
