{
  "id": "1707",
  "title": "Roadway Typography",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Just a general question:   \n   \nI was in a pub the other night sitting next to an old photograph of Chicago's Lake Shore Drive from the late 1920s. The words on the roadway (not the signage) read from top-to-bottom. It seems these days it always reads from bottom-to-top (at least in the States). Anybody know when/why\\* this changed occurred?   \n   \n\\*I'm assuming it's because bottom-to-top is how you encounter the words while driving, but was there some sort of research, government committee, etc.\n\n",
  "author": "matteson",
  "time": "17 Oct 2003 — 5:13pm",
  "uid": "1026",
  "comments": [
    {
      "time": "17 Oct 2003 — 7:27pm",
      "content": "Maybe it has to do with how fast you're going over the stuff?   \n   \nhhp\n\n"
    },
    {
      "time": "17 Oct 2003 — 8:43pm",
      "content": "I don't think I've ever seen a highway sign reading from bottom to top.\n\n"
    },
    {
      "time": "17 Oct 2003 — 9:38pm",
      "content": "\\>(not the signage)\n\n"
    },
    {
      "time": "18 Oct 2003 — 11:46am",
      "content": "Yeah, not the signage. The words on the actual road. Like:   \n   \nLANE   \nBIKE   \n   \nor   \n   \nPED-X   \nDOWN   \nSLOW\n\n"
    },
    {
      "time": "3 Aug 2012 — 10:37am",
      "content": "...\n\n"
    },
    {
      "time": "18 Oct 2003 — 1:08pm",
      "content": "\\>how fast you're going over the stuff   \n   \nBecause it's also in bike lanes, I don't think that's it. I mean, I ride pretty fast some mornings when I'm running late, but not _that_ fast ;-)   \n   \n\\>It works either way.   \n   \nIt does work 'functionally' both ways, but grammatically it only works the one way.   \n   \nAnyhow, I just found it curious. I had assumed that it had always been bottom-to-top.\n\n"
    },
    {
      "time": "18 Oct 2003 — 4:23pm",
      "content": "Nevermind, I'm blind.   \n   \nI don't think I've ever seen signs on the road like that either, but I never really pay attention. The only ones I can actually remember right now are the ones that say SCHOOL, but they're only one line.\n\n"
    },
    {
      "time": "19 Oct 2003 — 7:36am",
      "content": "The signs in Manhattan that are on the road do read Lane Bike, and Xing Ped. I think its because of the speed the cars go. A side note I can ride my bike faster across town than a car can go, but what the cars do is go as fast as they can between red lights. Why, I have no idea.\n\n"
    }
  ]
}
