{
  "id": "17087",
  "title": "Signage - extra letter tracking or not?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi - I'm designing a signage system using ITC Officina Serif Bold. At large point sizes I always like to pull the tracking in as it looks much tighter (at least on headlines in print publications).\n\nHowever - in the UK - all signage needs to be brought in line with new legislation that makes environmental design more accessible for the visually impaired. This means that the recommendation from the relevant bodies is to increase line spacing and tracking where possible. I have seen many signage systems that don't conform to this, which in my view look better (but then I'm not visually impaired).\n\nI'd be grateful to hear anyone's thoughts on the matter.\n\n",
  "author": "<a href=\"/web/20101117164858/http://typophile.com/user/10247\" title=\"View user profile.\">hungryghost</a>",
  "time": "<br>",
  "uid": "10247",
  "comments": [
    {
      "time": "",
      "content": "_the recommendation from the relevant bodies_\n\nThese would be the same people who put recorded voices in the elevators (lifts) of parking garages, to let visually impaired drivers know which floor they're on. Who are now proposing the visual equivalent of everybody being shouted at all the time, for the benefit of an impaired minority.\n\nBut seriously, I think that this problem is being tackled the wrong way.  \nRather than have bureaucratically-imposed physical standards, there should be a professional standard requiring licensed environmental designers. That would give some professional respect, and leeway for intelligent interpretation, with the onus on the professional licensing body to maintain standards, not a government bureaucracy.\n\nAnd it would mean that the professional would have to study and understand the issue in depth, rather than just follow ugly guidelines verbatim.\n\n"
    },
    {
      "time": "",
      "content": "\\> <cite>These would be the same people who put recorded voices in the elevators (lifts) of parking garages, to let visually impaired drivers know which floor they’re on.</cite>\n\n\"Visually impaired drivers\" ... what a disturbing thought! Let's just hope it's the _passengers_ who are impaired in this scenario.\n\n"
    },
    {
      "time": "",
      "content": "\"Look Better\" may be diametrically opposed to \"more legible\", since \"Looks better\" is so subjective. Designers always see things in detail. The standard you are referring to considers that generally, from a distance, signage is much more legible when contrast is high, letterforms are robust and clear, and line and letter spacing is generous. These criteria are the result of testing by viewers of various ages, from various functional distances.\n\n"
    },
    {
      "time": "",
      "content": "You should make your signs at the size they will be used. Create different versions with different letterspacing options. Put them on a wall and walk back and take a look. All design should be evaluated in its proper context. Making a decision on some assumption will most likely be the wrong decision.\n\nMost regulations cover letter height and stroke width but rarely consider letterspace. When we were doing the Clearview research, we were amazed how much letterspacing mattered.\n\n"
    },
    {
      "time": "",
      "content": "Hello there,\n\nwhich legislation is this? I'm curious because I'm also working on a signage project in the uk.\n\nI'd say it's difficult to have hard and fast rules, particularly about spacing. They never quite meet the case at hand. Every design problem needs to be thought through proplerly on a case by case basis. For example, the size of a lot of the signs I work on is dictated by the height of the ceiling (signs can't hang too low). This puts a limit on vertical (line) spacing. This in turn effects word- and letterspacing. At the same time, the type has to be a certain size to be read from (and be credible from) a certain distance. The overall effect of large, tight(ish) text is that the typography is quite dense, but because of limits imposed by architecture rather than typography.\n\nSo, I suppose I'm saying, look at the limits imposed by the job itself first, before trying to deal with more (usually quite arbitrary) externally imposed limits.\n\nSome practical thoughts: is your signage illuminated? Is it dark text on light, or light on dark? How much space do you have?\n\n"
    },
    {
      "time": "",
      "content": "_Let’s just hope it’s the passengers who are impaired in this scenario._\n\nMy point being that standards are followed _blindly_ even when they make no sense. If the standard says that elevators should have a voice prompt, that is implemented even when it is absurd, eg in a parking garage where the visually impaired would never be in an elevator by themselves.\n\n_“Looks better” is so subjective._\n\nNo more so than \"reads better\".  \nIt all depends on who's doing the reading.  \nType spec'd for the visually impaired will read worse for the normally-sighted.\n\n"
    },
    {
      "time": "",
      "content": "A few years ago, they added a second set of elevator buttons at about 2 and a half feet off the floor in each elevator in our building. This was so that people in wheel chairs could read and press the buttons more easily. A few years later, the removed the higher set of buttons meant for everyone else in the human race. (I assume there must have either been a cost or malfunction issue with having 2 sets). I have 2 bad knees which makes bending painful for me so now I can't see the buttons down there at thigh level. I am only 62 but there are plenty more folks older than I am who have even more trouble with the subterranean buttons. I wonder what blind people do trying to figure out where the bloody buttons are?  \nMy point is, there are ADA laws requiring button placement for the wheelchair population but none for the so called \"normal\" user. Since you can't get sued or fined for taking the needs of the majority population to heart, they are just ignored.  \nI am very much in favor of access for the handicapped but I am also in favor of access for everyone else too! Somewhere trained professionals need to be allowed to figure out the best way to deal with all of this because the politicians sure will screw it up if left to their own devices.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\"“Looks better” is so subjective.  \nNo more so than “reads better”.  \nIt all depends on who’s doing the reading.  \nType spec’d for the visually impaired will read worse for the normally-sighted.\"\n\nNick, where are you getting this? Are you saying that Clearview is hampering the comprehension of people with very good vision, or designers? Sounds like an assumption you're making....\n\n"
    },
    {
      "time": "",
      "content": "_Are you saying that Clearview is hampering the comprehension of people with very good vision, or designers?_\n\nNo. Clearview was optimized for drivers, I believe, and drivers have to pass an eye test, so are not visually impaired.\n\nMy local council in Norwich put out a magazine for taxpayers, with text set in 14 pt sans serif, to make it more accessible for those with poor vision. Not much of a read for the rest of us, however.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the replies. In answer to typofoto - I got the info from the book 'Sign Design Guide' by Peter Barker and June Fraser. There's some info in there relating to the Disability Discrimination Act 1995. Glad to see there's no hard and fast rules, so I will interpret them liberally!\n\n"
    },
    {
      "time": "",
      "content": "\\> implemented even when it is absurd, eg in a parking garage where  \n\\> the visually impaired would never be in an elevator by themselves.\n\nYou don't know that.\n\n\\>\\> “Looks better” is so subjective.  \n\\> No more so than “reads better”.\n\nIncorrect. There's a difference between subjective and variable.\n\n\\> I am very much in favor of access for the handicapped  \n\\> but I am also in favor of access for everyone else too!\n\nThis I agree with 100%. Like how too much readability  \nresearch is directed at dyslexics. The problem is in  \nlarge part the script itself, but far be it from people  \nto actually admit that, much less do anything about it.\n\nhhp\n\n"
    }
  ]
}
