{
  "id": "17086",
  "title": "Harmonizing font names on MS Word Mac/Windows",
  "forum": "Build",
  "tags": [

  ],
  "content": "I have 8 OT fonts that have been divided into two 4 font families to work in non OT applications. (Regular, Bold, Italic, Bold Italic) On the Windows side they appear as expected, two Family names in the font menu, and style linked correctly. On the Mac side the 4 roman font appear in the menu under their Full Names. I have followed [Adam’s naming advice](http://web.archive.org/web/20081027182852/http:/groups.msn.com/fontlab/tipsandtricks.msnw?action=get_message&mview=0&ID_Message=2843), but cannot get the WIndows style naming to appear on the Mac.\n\nSuggestions?\n\nJames\n\n [‹ Mac OS 9.2 - little issue: Alias](http://web.archive.org/web/20081027182852/http:/typophile.com/node/17122 \"Go to previous forum topic\") [OpenType problem ›](http://web.archive.org/web/20081027182852/http:/typophile.com/node/17117 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081027182852/http://typophile.com/user/1947\" title=\"View user profile.\">terminaldesign</a>",
  "time": "<br>",
  "uid": "1947",
  "comments": [
    {
      "time": " 4.Jan.2006 11.01am",
      "content": "I find that having something explained in a step-by-step manner (or a chart) is not as useful as having a proven example of what one is attempting. So for you here, that would ideally be eight separate screen-shots of the first two pages of FontLab’s Font Info.\n\nFor your problem James, I haven’t done what you’re attempting, so my only advice (if you haven’t already done this) is to make sure that you’re not using any font management tools. I just drag successive new versions of fonts into my “user\\>Nick\\>library\\>fonts\\>” folder, after I have trashed the previous version, and don’t have any font management software installed (except FontBook).\n\n"
    },
    {
      "time": " 4.Jan.2006 1.54pm",
      "content": "I check fonts both ways, with a font manager and without. There is no difference in how these behave in MS Word on the Mac.\n\n"
    },
    {
      "time": " 4.Jan.2006 5.49pm",
      "content": "I have found MSWord Mac to be rather screwy when it comes to OpenType fonts. Maybe the port to Mac is not as clean as the original Windows version? Maybe next years rev will be better.  \nHow do your fonts work in InD Mac? If they have the same problem there, you are probably seeing something you need to fix on your font. If they work great in InD Mac, it might be an issue with Word.\n\nStay far away from Suitcase though. It never seems to really erase a previous version of a font.\n\nChrisL\n\n"
    },
    {
      "time": " 4.Jan.2006 7.21pm",
      "content": "The OpenType names work fine on both platforms. It is the “Short Names” that i am trying to harmonize. It seems that MS Word/Windows uses the Menu Name and MSWord/Mac uses the Full Name or some permutaion of it. SInce the client requires similar naming on both Mac and Windows in Word, my search continues.\n\n"
    },
    {
      "time": " 4.Jan.2006 7.51pm",
      "content": "James, have you given any of these fonts a Mac Name (second panel in FL 4.6)? This is the name used in non-OT aware apps in like MS Word/Mac. The name must not be longer than 29 characters or it will not appear in MS Word/Mac font menus. Normally, all members of OT families appear in MS Word/Mac (assuming their Mac Names are not too long). MS Word/Win only shows the roman (plain) member of each family. It sounds like some of your OT font Mac Names are too long for MS Word/Mac, so they are not all showing up.\n\n(I am not sure what happens if you leave the Mac Name blank. I think the system will get it by combining the Family Name and Style Name (OT names panel) but I am not sure. I don’t ever leave it blank.)\n\n"
    },
    {
      "time": " 5.Jan.2006 5.18am",
      "content": "Mark, If you click the little “auto” diamond thing in FontLab, won’t it fill that in for you? I am not saying the whatever “auto” puts there is right for the name (I have bad luck with auto stuff), I just mean will it not be blank?\n\nChrisL\n\n"
    },
    {
      "time": " 5.Jan.2006 5.49am",
      "content": "The little diamond thing just combines the other two fields. In doing so, it can make a name that is too long, so you need to check it afterwards and edit the name to make it shorter if necessary. I plan this stuff out ahead of time in an Excel worksheet, coming up with a naming scheme where none go over the 29 character limit.\n\n"
    },
    {
      "time": " 5.Jan.2006 6.09am",
      "content": "Thanks Mark, you have confirmed my suspitions about automatic stuff in general. Now you know why I always drive a stick shift and still use a Nikon FM2 camera:-)\n\nOn a more serious note, thanks for the tip in the 29 character limit! I was not aware of that until you enlightened me.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Jan.2006 11.46am",
      "content": "James, what do other font families look like in the Mac Word menu? Is the use of the full name rather than family name consistent? Or are there fonts that behave as you are hoping yours will? I’m wondering whether this is a font naming issue or an application issue, and I don’t have a Mac on which to test this myself.\n\n"
    },
    {
      "time": " 5.Jan.2006 12.35pm",
      "content": "John, It appears that the use of full name rather than the family name is the consistent behavior and most likely an application issue. My client may have to live with the inconsistency.\n\n"
    },
    {
      "time": " 5.Jan.2006 3.03pm",
      "content": "And it appears that there is really no cross-platform compatibility between MS Word Mac/Windows, at least I cant get it going. The fact that the Windows side looks at Family Name, and the Mac side looks at Full Name. Very disappointing!\n\nI suppose you could create font Family names that are really Full Names ie. MyFontName-Book etc. Make everything regular with no style linking, but it seems like a long way to go to get two sides of the same application to talk to itself.\n\n"
    },
    {
      "time": " 5.Jan.2006 3.40pm",
      "content": "Well I’ve been at it all afternoon, and I finally cracked it! The names are not harmonized, but I’ve got it to be cross-platform.\n\n"
    },
    {
      "time": " 5.Jan.2006 3.47pm",
      "content": "The names are now harmonized as well.\n\n"
    },
    {
      "time": " 5.Jan.2006 3.55pm",
      "content": "mind sharing what you found?\n\n"
    },
    {
      "time": " 5.Jan.2006 6.25pm",
      "content": "And does style linking still work?\n\n"
    },
    {
      "time": " 5.Jan.2006 6.28pm",
      "content": "Not at all. It is rather a simple solution, but I have always misunderstood the Mac Names field in the OpenType Names panel in FontLab. Mark Simonson’s comments made me realize that that particular field had no relationship to OT (I always thought it did). Since MS Word reads The “short” Family name along with the style, I just made sure that Mac Names field was filled in with the exact same info. That coupled with Adam’s naming tips and everything works fine. More of a relief than a breakthrough. Thanks for the insight Mark.\n\n"
    },
    {
      "time": " 5.Jan.2006 6.29pm",
      "content": "Yes style linking still works.\n\n"
    },
    {
      "time": " 6.Jan.2006 12.03pm",
      "content": "That makes sense. This field in the OpenType Names panel relates to name table ID 18:\n\n`Compatible Full (Macintosh only); On the Macintosh, the menu name is constructed using the FOND resource. This usually matches the Full Name. If you want the name of the font to appear differently than the Full Name, you can insert the Compatible Full Name in ID 18.`\n\nIt is OpenType related insofar as it was added in the OT specification, and was not previously part of the TT spec.\n\n"
    }
  ]
}
