{
  "id": "171",
  "title": "Lowering underlines in InDesign",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "i'm wondering if anybody knows how to lower underlines in InDesign so they don't cut through the descenders?   \n   \nif you do, your help is appreciated.\n\n",
  "author": "timmy",
  "time": "18 May 2003 — 6:50pm",
  "uid": "656",
  "comments": [
    {
      "time": "18 May 2003 — 7:50pm",
      "content": "I'm pretty sure it ain't possible.   \n   \nYou can, of course, draw one yourself, but it won't flow. I tried pasting one in and kerning back over it, but that wasn't happening either.   \n   \nOne solution would be to not underline the offending descenders, as in this <u>exam</u>p<u>le</u>.   \n   \nOf course, I'll add that probably the reason you can't adjust underline preferences in InDesign (they're stuck at one-half point as well) is that underlines just aren't that pretty. I'll just assume that somebody is putting a gun to your head and insisting you use them. It has happened to me.\n\n"
    },
    {
      "time": "19 May 2003 — 10:06am",
      "content": "It might be a little more work, but you could use the \"rule\" feature. You would then be able to control distance and weight of the line. Set up a character style based on your preferences.   \n   \n ![:-)](http://web.archive.org/web/20150326031219im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "19 May 2003 — 10:36am",
      "content": "Huh? Do you mean paragraph rules? I can't find a \"rule\" property or command at a character level.\n\n"
    },
    {
      "time": "19 May 2003 — 8:31pm",
      "content": "True, rules are paragraph options, but they can be tweaked and offset to function as underlines if that was truly desired. See the attached screenshot.   \n   \nPlease note that I am not actually suggesting such an insidious hack. The rule would neither flow with text nor linespacing change. I'm merely pointed out that it's possible as a stopgap solution.   \n   \nYour specific suggestions above were exactly what I was alluding to. You eloquently clarified my apparently flippant comments before. I am determined to express myself more gracefully from now on in this forum.   \n   \n ![:-)](http://web.archive.org/web/20150326031219im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n ![a paragraph rule as an underline](http://web.archive.org/web/20150326031219im_/http:/www.typophile.com/forums/messages/4100/10971.gif)\n\n"
    },
    {
      "time": "22 May 2003 — 6:05pm",
      "content": "i'm typesetting a peotry journal, so much fun, and the underlines stay. thanks everybody for the advice, i think i'll look into paragraph rules it just might do the trick.\n\n"
    },
    {
      "time": "22 May 2003 — 10:05pm",
      "content": "We used underlines in a brochure for a play at Schauspielhaus Bochum last year, as the text piece was a mock-up 70s style student/university- style. Bad Letter Gothic, Bad Letterspacing, too much text, awful image inserts and of course the inevitable underlining of whatever text the author deems important. Funny as hell, I still wonder who got the gag at all :-)... but other than that and apart from other cool visual ideas to be done with it, underlining should be taboo in regular typesetting...\n\n"
    },
    {
      "time": "19 May 2003 — 10:44am",
      "content": "Yeah, I thought about rules too, but I'm, pretty sure they   \nare available only at the paragraph level. If you're   \nunderlining entire lines it's just the solution you're looking   \nfor. But for single words within lines rules aren't going to do it.\n\n"
    },
    {
      "time": "19 May 2003 — 10:47am",
      "content": "BTW, if you're using underlines for emphasis you might   \nconsider using italics, small caps, or bold instead.\n\n"
    },
    {
      "time": "22 May 2003 — 9:57pm",
      "content": "Some brief, but recent, historical context: underlines came   \nabout because typewriters didn't have italics or bold for   \nemphasis.   \n   \nNow that we have italics and bold readily available,   \nunderlines just remain a leftover convention; an   \nunnecessary homage to a time without an alternative.   \n   \nAnd it kills me that the web relies so heavily on these.   \nDown with underlines!   \n   \n(I'm sure someone can point out a good use for them,   \nbut at the moment I can't think of one.)\n\n"
    }
  ]
}
