{
  "id": "17107",
  "title": "Naming Issues - Type 1 Mac",
  "forum": "Build",
  "tags": [

  ],
  "content": "More naming issues! I’m generating type one fonts for a family with eight styles. These styles are not your standard reg, ital, bold, bold ital etc. They are as follows.\n\nRegular OSF  \nRegular Tab  \nItalic  \nBold  \nSmallcaps  \nDisplay Caps  \nInline Caps  \nOrnaments\n\nQuestions:\n\n1. How do I make them show up in this order in the Adobe Apps?\n\n2. Should I:  \na) make two suitcases of 4 styles each, and mark them reg, ital, bold, bold ital even though they are not?  \nb) Or should I make individual suitcases for each of the odd ones (ie smallcaps, ornament, display, inline etc) calling them “regular”? Does it matter?\n\n3. Ignoring Dezcom’s warning, I try to test with Suitcase X1 also. Suitcase is telling me that all the weights are the same font and will only activate one style (this is with a 2b settup)?\n\nAny thoughts would be appreciated.\n\nRandy\n\n [‹ Opentype: replacement and positioning of sups, sinf, numr, dnom doing the Adobe way?](http://web.archive.org/web/20080502182954/http:/typophile.com/node/17139 \"Go to previous forum topic\") [Caret Positionining for Ligatures doesn't work? ›](http://web.archive.org/web/20080502182954/http:/typophile.com/node/17134 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080502182954/http://typophile.com/user/7783\" title=\"View user profile.\">Randy</a>",
  "time": "<br>",
  "uid": "7783",
  "comments": [
    {
      "time": " 5.Jan.2006 1.43pm",
      "content": "Generate OTFs instead of Type 1 (identical functionality, smaller file size, cross platform). Use the OpenType prefered sub family names, which are recognised by Adobe apps. Note that you cannot directly control the ordering of sub-family names in the Adobe menus: the ordering is controlled by weight class and then alphabetised.\n\n"
    },
    {
      "time": " 5.Jan.2006 2.52pm",
      "content": "Thanks for your reply John.  \nRe: Ordering in the menu  \nHelpful info! Is there any reason why I shouldn’t asign different “weights” to the different styles even though they are not different weights per se (such as setting the ornaments to “Ultra Black” to put them at the bottom)?\n\nRe: Open Type  \nI know that open type is better in so many ways, but I am supplying to a foundry that offers T1 Fonts. So I’m stuck with finding a T1 solution.\n\nWhen making a suitcase, FL gives 4 “locations” to add styles Reg, Italic, Bold, and Bold Italic. You can put as many fonts in each slot as you want. Does it matter where you put what? Say I’ve labeled my ornaments “Ultra Black” to get them at the bottom of the list, is there any reason I shouldn’t stick them in with the regular in the regular slot? Should I just chuck them all in the regular slot?\n\nThanks,  \nRandy\n\n"
    },
    {
      "time": " 5.Jan.2006 3.33pm",
      "content": "does this mean Eason is right around the proverbial corner, Randy? \\*rubbing hands together\\*\n\n"
    },
    {
      "time": " 5.Jan.2006 4.00pm",
      "content": "Paul “Font Sleuth” Hunt\n\n"
    },
    {
      "time": " 5.Jan.2006 6.24pm",
      "content": "I’m afraid I can’t help you with the suitcase questions. I always let someone else take care of Mac Type 1 fonts, even when we produced them. Windows Type 1 files were enough of a headache, without trying to make sense of the Mac packaging stuff.\n\n_Is there any reason why I shouldn’t asign different “weights” to the different styles even though they are not different weights per se_\n\nApart from the fact that lying is a sin? :) I can’ think of a reason off-hand, but I would ask Tom Phinney since he’ll have a better idea of exactly what Adobe is doing in its menus and what the issues might be. Also, I can’t remember exactly how weight works in Type 1 fonts: in TT and OT, the weight class is set as a number value in the OS/2 table, which means you can assign weights that do not correspond to style names (very handy for the kind of thing you want to do).\n\n"
    },
    {
      "time": " 6.Jan.2006 5.43am",
      "content": "Randy, I’m afraid I can’t help with your specific question, as I’ve never bothered with trying to get styles to appear in a specific order.\n\nI’ve always made Type 1 suitcases correspond to retail packages — that makes sense for font management, whether it’s being done by distributors or end users. So if this typeface will be sold as one package, I would make it one suitcase.\n\nSuitcase contents don’t have to be style-linked.\n\n\\*\\*\\*\n\nI have a couple of comments about your family.\n\nFirstly, if you are offering a choice of figure styles for the Regular, what is the figure style for the Italic and Bold? Why is there no corresponding choice? This is a question that end users would wonder upon seeing the menu contents — they may not have support material such as PDFs or printed specimens available which would let them know, and besides, shouldn’t it be evident from the menu?\n\nSecondly, your family, which will nonetheless provide a lot of “expert” typographic functionality, is missing the very basic Bold Italic. If this typeface is to be a success in the publishing market (magazines, newspapers), for which it seems suited (thanks to gumshoe PH for the tip), then a bold italic is very important. The reason is that art directors would then have the ability to specify sidebar text as bold face, and keep editors, who wish to italicize occasional words according to their style guide, happy.\n\n"
    },
    {
      "time": " 7.Jan.2006 2.41pm",
      "content": "Nick, thanks for your opinion.\n\nI’ve just finished up new sets of numerals for italic and bold. Users will now have OSF and Tab accross the text styles. I’m also exlopring a bold italic.\n\nRandy\n\n"
    },
    {
      "time": " 7.Jan.2006 3.38pm",
      "content": "so yer not sold on making OT versions? that’s too bad. if you change yer mind, contact me: I’d love to help, if you need any.\n\n"
    },
    {
      "time": " 9.Jan.2006 4.28am",
      "content": "_Is there any reason why I shouldn’t asign different “weights” to the different styles even though they are not different weights per se (such as setting the ornaments to “Ultra Black” to put them at the bottom)?_\n\nIn case it applies, beware of the [Bizarre weight/kerning behaviour in Quark 6.5 for Windows](http://web.archive.org/web/20080502182954/http:/groups.msn.com/fontlab/bugsproblems.msnw?action=get_message&mview=0&ID_Message=4748)\n\n"
    },
    {
      "time": " 9.Jan.2006 7.34am",
      "content": "Miguel: Thanks for the info  \nPaul: I never said no OT.  \nOne foot in front of the other.\n\nRandy\n\n"
    }
  ]
}
