{
  "id": "17111",
  "title": "Happy hand-printed style wedding invitation font, dot over \"i\" open right",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Making an audio CD of my cousin’s wedding, I thought it would be fun to have the liner font match her wedding invitation… any ideas about this happy font? Thanks in advance!\n\n| Attachment | Size |\n| --- | --- |\n| [JMsample2.gif](http://web.archive.org/system/files?file=JMsample2.gif) | 82.09 KB |\n\n",
  "author": "MikeInMass",
  "time": "5 January, 2006 - 11:43pm",
  "uid": "10874",
  "comments": [
    {
      "time": " 6 January, 2006 - 6:51am",
      "content": "Hi Mike,  \nYou have a nice idea, but you picked a very tough kind of font to want to match. As it says in our FAQ pages, there are literally thousands of these hand-printed lettering fonts, and they are so easy and cheap to make that a stationer who makes invitations could have made their own one-of-a-kind fonts with printing samples of anyone on their staff.\n\nI looked through 300 fonts in the one widely-circulated CD of handwritten fonts like this, and found many similar fonts in terms of the weight and verticality, and even letterforms, but none with the cute dot on the ‘i’. I also scanned the [Fontgarden](http://web.archive.org/web/20060111010354/http:/www.fontgarden.com/gallery/gallery.htm) collection of free fonts — no joy for identical match, but plenty of ‘happy’ fonts. [DaFont’s handwritten fonts](http://web.archive.org/web/20060111010354/http:/www.dafont.com/en/theme.php?cat=603) have 20 pages of free hand-lettered fonts, and my [Script Font ID Guide, Part 11](http://web.archive.org/web/20060111010354/http:/bowfinprintworks.com/Script11Pg1.html) shows about 24 pages of everyday hand-printed fonts. Have a look at any or all of those sites and see if you see something that you think has the same sort of feeling — I think there are many — and go with something you can put your hands on.\n\nThey’ll get the idea.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 6 January, 2006 - 3:35pm",
      "content": "You might be best off asking the bride about her invitation design. (Or if this is a surprise gift, ask her mother or maid-of-honor, or a close friend/relative who was involved in the planning.)\n\nIf it’s something they did themselves, she should be able to give you the name of the typeface.\n\nOtherwise, the company she ordered them from could have it listed in their catalog. However, some of those stationery/card companies have their own proprietary typefaces … so you might be out of luck.\n\nMike Yanega certainly has great advice for finding a similar font, though.\n\n"
    }
  ]
}
