{
  "id": "1711",
  "title": "\"Font Capture\"?!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Something pretty scary just happened. I was having trouble printing a Word document, so I went to Restart (I'm on WinXP-Home). It was taking unusually long, and then out pops a window saying that the \"Font Capture\" task was having trouble quitting. Whatduhellisthatabout?!   \n   \nI've long had this inkling that things have been poking into my computer for a while now, but this is the first time something so explicit (not to mention font-centric) has happened.   \n   \n----   \n   \nBTW, \"readjust\". No relation to the above. But think about it.   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "Sat, 2003-10-18 17:01",
  "uid": "1250",
  "comments": [
    {
      "time": " Sat, 2003-10-18 18:37",
      "content": "Hrant, do you happen to use a Lexmark printer? They mention something called Font Capture in the technical specifications for certain printer configurations. Thus quoth:\n\n> **Font Capture**   \n> Fonts can be captured dynamically and saved to hard disk or flash memory in the printer. A captured font appears as a printer resident font. If many fonts are used in jobs that are printed, capturing fonts and saving them in the printer will decrease network traffic on busy networks.  \n [http://www.lexmark.com/AP/PH/solutions/simmipds\\_twc.html](http://web.archive.org/web/20050525000622/http:/www.lexmark.com/AP/PH/solutions/simmipds_twc.html)\n"
    },
    {
      "time": " Sat, 2003-10-18 18:39",
      "content": "Yes, it _is_ a Lexmark! Thanks Grant - that'll make me sleep better...   \n   \nhhp\n\n"
    },
    {
      "time": " Sat, 2003-10-18 18:46",
      "content": "You're welcome.   \n   \n... this reminds me of when I was doing bits and pieces of tech support at Image Club when Mac System 7 was first released. Some machines were prone to throwing generic 'Type 1' errors when older applications were not playing nicely with the new OS. The error window would come up on screen, freezing everything, and without supplying any additional information - descriptive or otherwise - to explain what had happened. Since Image Club was selling and supporting _type one PostScript_ fonts in our font library, naturally customers who experienced this error message wanted to know why the fonts we sold them were causing their system to crash. Heh.\n\n"
    },
    {
      "time": " Sat, 2003-10-18 20:53",
      "content": "Hrant, upgrade to XP Pro. Home is a POS as far as security is concerned.   \n   \nIf you're concerned about things floating around on computer, get AdAware, it's a free download and it detects spyware. Should be at [www.lavasoft.de](http://web.archive.org/web/20050525000622/http:/www.lavasoft.de/).   \n   \nAlso, if you're on broadband, definitely recommended to get a firewall. [www.zonelabs.com](http://web.archive.org/web/20050525000622/http:/www.zonelabs.com/) has ZoneAlarm, another freebie, which is really good. Plus it tells you when any programme tries to get access to the internet and allows you to take action to stop it.   \n   \nIf you don't have one, get a virus scanner as well. I recommend Norton's Antivirus (just the Antivirus, none of the other crap they sell). It's pretty good at detecting vira, and it also is able to find new vira that aren't listed in it's definitions files through several scanning algorithms.\n\n"
    },
    {
      "time": " Sun, 2003-10-19 08:17",
      "content": "\\>XP Pro   \n\\>get a firewall   \n   \nNot sure if the Home version has this, but the Pro version has a pretty good firewall out of the box. I think my computer at work was the only one not be fecked up by the 'blaster' worm the other month - and I'm sure it's because I'm the only one who uses the firewall.   \n   \nThough I'm sure there are better firewalls out there.\n\n"
    },
    {
      "time": " Sun, 2003-10-19 13:19",
      "content": "The home version has the firewall too, but I always turn it off and put ZA on.\n\n"
    },
    {
      "time": " Sun, 2003-10-19 14:12",
      "content": "Does anyone find it rather humorous that Hrant's situation has managed to somehow devolve from one of simply recognizing a background printer utility that came with his Lexmark to that of an Windows OS upgrade, a fresh firewall installation, and the need for a third-party tool to intercept potential malware?   \n   \nI love my Macs.\n\n"
    },
    {
      "time": " Sun, 2003-10-19 20:42",
      "content": "Yes, let us completely forget the fact that if Macs were a big enough of a target that all that information would still apply.   \n   \nThe only reason it doesn't is because you and your Mac hold less than 10 percent of all total computers in use and are not worth the time for anyone to write vira for.\n\n"
    },
    {
      "time": " Sun, 2003-10-19 21:04",
      "content": "The statement that a platform is _\"...worth the time for anyone to write vira for\"_ humours my \\<10% market share to no end. If we build a security hole, they will come...   \n   \nAh, but we must move on to other, more typographic, topics.\n\n"
    },
    {
      "time": " Sun, 2003-10-19 21:47",
      "content": "Grant, by that logic the best way to avoid computer viruses is simply to not use computers... :-)   \n   \nhhp\n\n"
    },
    {
      "time": " Mon, 2003-10-20 06:52",
      "content": "BTW, do you guys get viruses so frequently?   \nI can't remember the last time I got one here,   \nit was a long time ago.   \n   \n----   \n   \n\\> \"readjust\".   \n   \n?\n\n"
    },
    {
      "time": " Mon, 2003-10-20 07:48",
      "content": "By that same token, I suppose that by living in a bubble, one would never get sick either. And how boring that would be. Although, the occasional computer-free day is often very enjoyable.\n\n"
    },
    {
      "time": " Mon, 2003-10-20 07:55",
      "content": "\\>_BTW, do you guys get viruses so frequently?_   \n\\>_I can't remember the last time I got one here,_   \n\\>_it was a long time ago._   \n   \n1994. nVir B variant on floppy. Nuked it with [Disinfectant](http://web.archive.org/web/20050525000622/http:/charlotte.at.northwestern.edu/jln/ftp/index.ssi).\n\n"
    },
    {
      "time": " Mon, 2003-10-20 07:59",
      "content": "The last virus I got was that Chernobyl one (W95.CIH), back in 1997. Back then I was using a 486 with 16 mb of RAM, if I started an antivirus program, I couldn't do anything else on the computer.   \nI find it odd that so many people get those attachment viruses. I never got any... I don't even get spam now!\n\n"
    },
    {
      "time": " Mon, 2003-10-20 11:16",
      "content": "Chris:   \n   \nWhile market share is an issue, the reality is that it is simply \\*easier\\* to write viruses that take advantage of the Windows OS.   \n   \nA quick google search points out one of many quotes:   \n   \n\\>Microsoft programs vulnerable to viruses   \n\\>   \n\\>By Will Rodger, USATODAY.com   \n\\>For even though Microsoft has produced the world's most popular operating   \n\\>system, its ease of use and the staggering number of features integrated   \n\\>into Windows and the Office applications has left the world's dominant   \n\\>computing platform uniquely vulnerable to a plague of troubles.   \n   \nA few weeks ago I was attempting to eradicate a start up application on one of my windows machines. My brother, and PC tech, stated, \"well, the start up item could be anywhere on your machine...there isn't a specific place that start up items have to exist\".   \n   \nThings like that is why people that write virii prefer Windows ;o)\n\n"
    },
    {
      "time": " Mon, 2003-10-20 11:53",
      "content": "Anonymous, why so angry, I use a Mac and thats because thats what the industry here in Manhattan uses for graphics. It could be called anything as far as I'm concerned because its just a tool. I can't comment on PC vs Mac, because I've never used a PC. Chill, I still use pen on paper for ideas first and the only computer needed is my brain. Dan\n\n"
    },
    {
      "time": " Mon, 2003-10-20 13:09",
      "content": "I use Macs, PCs, and Linux. Most OS debates are pointless because they consist of comments like yours, Anonymous. That doesn't mean one can't have an intelligent, interesting, and productive debate of the merits and drawbacks of each OS. These are the tools we use, afterall.\n\n"
    },
    {
      "time": " Mon, 2003-10-20 13:12",
      "content": "Daniel, he's not angry - just bored. Anyone who is posting anonymously regarding a Mac vs PC discussion is obviously providing nothing of substance to the debate except flame-bait. Ignore him and he'll go away.\n\n"
    },
    {
      "time": " Mon, 2003-10-20 13:17",
      "content": "The Mac vs PC debate is not only old. It's futile and pointless.   \nDe gustibus non disputandum est.\n\n"
    },
    {
      "time": " Mon, 2003-10-20 13:21",
      "content": "Thank you Grant, I will. I hate spending any energy on negative people. Dan\n\n"
    },
    {
      "time": " Mon, 2003-10-20 14:33",
      "content": "I have no problem with Macs, hell I wouldn't mind getting one one day. I use them, and I also use PCs, but Grant's comment that he doesn't have to worry about anything like that because he has a mac just ticked me off.   \n   \nYou do NOT have to have a security hole to have a virus. Some vira do take advantage of security holes, but the vast majority of vira are ones that the user has to install themselves (unknowningly of course) and they're the ones you have to watch out for. You get an email from a friend saying they've included a screensaver of cutesy little kittens so you decide to try it yourself and bam...you've just installed a virus that wipes out your windows directory the next time you start the computer.   \n   \nIf Macs were the leading computer used today, the windows users would be probably be laughing at them for getting vira all the time.   \n   \nVirus users go after the biggest target. Why shoot for the can when you can hit the barn much easier? Which isn't to say, of course, that people don't shoot for the can, because there ARE Mac vira out there. You just don't hear about them as often because it's the PC vira that get all the news.\n\n"
    },
    {
      "time": " Wed, 2003-10-22 07:28",
      "content": "Hey.   \n   \nAs of late, I (and I suspect I'm not alone) have started to feel a little, errr..., \"uncool\" if I don't get virus emails. Since most of the recent ones spread by email address books, the more virii you get, the more address books you're in.   \n   \nOf course it really probably has a lot more to do with the tech-savvyness of your peers I s'pose, but...   \n   \nComputer viruses have made for some interesting changes. I remember when I was working for a Seattle dot-com, the notices the IT department would tape all over the place whenever there was a new viral outbreak. A cyber-quarantine.   \n   \nDavid Roughs\n\n"
    },
    {
      "time": " Wed, 2003-10-22 07:50",
      "content": "\\>_but Grant's comment that he doesn't have to_   \n\\>_worry about anything like that because he has_   \n\\>_a mac just ticked me off._   \n  \nI'm sorry you felt that way, as I didn't mean to tick anyone off. I believed I was simply stating the obvious. I really don't worry about anything. Yes, I run anti-viral software - but I can't remember the last time anything ever triggered a warning. And I'm not operating is some sterile, non-networked environment. My home Mac has a public IP address and is wide open on several ports. Other than spam, I have never had a single infection or breach. I feel secure running a Macs. I feel vulnerable every time I touch a Windows box and I wonder if I'm going to be able to boot up tomorrow.   \n   \n\\>_...because there ARE Mac vira out there._   \n\\>_You just don't hear about them as often_   \n\\>_because it's the PC vira that get all the news._   \n   \nTrue. But you also don't hear about them, because they're pretty much non-existent at this point in the game (other than Microsoft-borne macro vira, but that's another issue altogether) or else they're harmless, benign annoyances.   \n   \nOf course, this is my own opinion based on 25 years of personal experience with multiple computing platforms. I'll completely accept the fact that other's milage may vary.\n\n"
    },
    {
      "time": " Wed, 2003-10-22 09:09",
      "content": "\\> I feel vulnerable every time I touch a Windows box and   \n\\> I wonder if I'm going to be able to boot up tomorrow.   \n   \nGrant, I think a lot of that is in your head - which is pretty normal for any human!   \n   \nI've been on a couple of Windows laptops (Win98, then WinXP) with a broadband connection for about three years now, with no firewall and no anti-virus software (and no backup). I do admit to feeling a bit vulnerable (maybe that keeps me alive? I hate insurance for example - like that guy in Deliverance), but the fact is nothing has happened yet (yes, I know \"yet\" might be the operative word here :-), and if there _is_ a virus it's not doing anything damaging. I take some basic precautions (like not using MS Outlook, and never running emailed executables, or accepting downloads from strange sites), but I'm no recluse, so I'm sure I'm some kind of target to some people. So basically it's not that bad.   \n   \nhhp\n\n"
    },
    {
      "time": " Wed, 2003-10-22 10:10",
      "content": "\\>_Grant, I think a lot of that is in your head_   \n\\>_- which is pretty normal for any human!_   \n  \nMy wife keeps telling me that life is 99% mental.   \n   \nAnd I'll admit that my bias is showing.\n\n"
    },
    {
      "time": " Wed, 2003-10-22 10:13",
      "content": "\\> My wife keeps telling me that life is 99% mental.   \n   \nI guess that's better than \"I have a headache\". ;-\\>   \n   \nhhp\n\n"
    },
    {
      "time": " Wed, 2003-10-22 13:39",
      "content": "I'm not upset that you don't have to worry about vira, I'm just upset at the general \"We're better than you are\" attitude of most Mac users. Windows users have the attitude too, but for Mac users it generally borders on Martyrism and it's just one of those things that get to me.   \n   \nI usually play devils advocate when it comes to Mac v. PC discussions, but when having them with \"hard core\" Mac heads it's everything I can do not to want to ram their heads into a wall (not that I wanted to do that with Grant, but that argument is one of the biggest, and to me illogical, of them and is usually guaranteed to get my ire up).\n\n"
    },
    {
      "time": " Wed, 2003-10-22 18:42",
      "content": "'I'm just upset at the general \"We're better than you are\" attitude of most Mac users.'   \n   \nOh, but we are. But why should this upset you?   \n   \nGerald\n\n"
    },
    {
      "time": " Wed, 2003-10-22 21:04",
      "content": "...\n\n"
    }
  ]
}
