{
  "id": "17127",
  "title": "please critique my font guide",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi, I am writing a guide for high-school students on how to select fonts for writing yearbook publications.\n\nWhile I'm pretty sure I have the basics downpat, I'd like to make sure it is as 'correct' as possible.\n\nSuggestions for improvements are appreciated. Thanks for your time.\n\n=====  \nThere are no absolutely right or wrong ways to choose which fonts to use for your yearbook. Font selection is a very subjective matter, but there are however a few accepted guidelines which can help you make the right choices.\n\n**Body Text**  \nSerif fonts are ideal for body text as the serifs aid readability by helping the eye move from one letter to the next, connecting individual shapes to form whole words. Certain sans-serif fonts are also suited to body text as they are also ‘word’ friendly.\n\nA good body text font is not difficult or tiring to read for long sentences and paragraphs. It should blend with the yearbook theme, not distract the reader, and convey an appropriate tone.\n\n**Headings**  \nSans-serif fonts are often used for headings as they often convey more personality than old-style serif fonts. Script and novelty based fonts are also ideal for short headings where ornamental features can be appreciated sparingly. Over-using a novelty font can backfire and it tends to look quite tacky.\n\n**Point size**  \nBody text should be set between 9 to 12 points. This is the optimum size to aid readability. Bigger text sizes tend to make it harder to read as the eye gets tired from travelling further distances to read the same amount of text. Heading text sizes should be proportionate to the accompanying body text.\n\n**Capitalisation Patterns**  \nALL CAPS can look very serious and dramatically reduces readability. The major headings in this boook are in all-caps, but have been italicised the speed and modernise the flow.\n\n**Common fonts**  \nIf you are looking to make your yearbook stand out, it is recommended you avoid using the common fonts found on most computers such as Times New Roman and Arial. These fonts are familiar to many people and can introduce the ‘same old’ syndrome. It is worth the time to search and download new fonts from the Internet.\n\n=====  \n(The text in the above guide is written in Expressway 10pt)  \n( [http://www.myfonts.com/fonts/typodermic/expressway/](http://web.archive.org/web/20101205002131/http:/www.myfonts.com/fonts/typodermic/expressway/ \"http://www.myfonts.com/fonts/typodermic/expressway/\"))\n\n",
  "author": "<a href=\"/web/20101205002131/http://typophile.com/user/10821\" title=\"View user profile.\">noftus</a>",
  "time": "<br>",
  "uid": "10821",
  "comments": [
    {
      "time": "",
      "content": "I might also add that more than about 35 characters per line can get hard to read, and also suggest at least 2-3 points of leading for body copy. Italics are hard to read for long passages too.\n\nAnd there is nothing wrong with using serif fonts for headlines.\n\n"
    },
    {
      "time": "",
      "content": "Another thing to warn against is putting text on top of pictures; if designers really feel they must do it, they should choose bold fonts without \"hairline\" details.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Sans-serif fonts are often used for headings as they often convey more personality than old-style serif fonts.</cite>\n\nI would have leaned towards the exact opposite as far as conveying personality (there are a lot of oldstyle serif typefaces with tons of personality). But really, \"conveying personality\" is more dependent on the font rather than its category. That is, Arial (sans) and Times (serif) are both pretty bland, but Syntax (sans) and Warnock (serif) both have considerable personality.\n\nT\n\n"
    },
    {
      "time": "",
      "content": "You should add a note about sticking to maybe a two typeface combo...or three at the most for the entire book. Develop a system so it all works together and doesn't have a random feel to it.\n\n"
    },
    {
      "time": "",
      "content": "Encouraging the use of fonts dowloaded from the internet might lead to the sort of zany typography you are discouraging. You warn about novelty fonts in the Headings paragraph, but most of what high school students are likely to find online will be just that.\n\n"
    },
    {
      "time": "",
      "content": "Patty, roughly about 60 to 66 characters per line is considered the ideal line lenght. I think it was a type mistake wasn't it?\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "Expressway is based on Ray Larabie's first road signage font, Blue Highway. Expressway is very tightly fitted and as such not well-suited to text, but you can remedy that by applying a bit of letter spacing, say around .2pt to .6pt should give more readable results and be nicer to \"look\" at (as distinct from reading).\n\n_...what high school students are likely to find online..._  \nwhat high school students are likely to find online **for free**.\n\n_...connecting individual shapes to form whole words..._  \nconnecting individual letters to form positive word pictures (bouma)\n\n_It should blend with the yearbook theme, not distract the reader, and convey an appropriate tone._  \nIt should blend with the yearbook theme, conveying an appropriate tone and not distract the reader.\n\n_ALL CAPS can look very serious and dramatically reduces readability_  \nALL CAPS can look too formal and dramatically **reduce** readability\n\n_The major headings in this boook are in all-caps, but have been italicised the speed and modernise the flow._  \nThat may be a perceived quality, one you are projecting or assigning to italic typography rather than an inherent effect. I'm not sure that italicization speeds up reading (if that's what you mean). \"Modernise the flow\" is ambiguous. Readers may not follow what you mean there. Instead of italicized all-caps consider regular smallcaps; smallcaps tend to be a bit more readable and user-friendly than all-caps.\n\nOther sans serif candidates: Formata, Frutiger, Myriad (see Frutiger), Brown Gothic, Vera Sans, Officina, Gill Sans, Humanist 531.\n\nA great alternative to neutral sans serifs for body matter is Bitstream's Chianti. Very readable. Also consider Formata for body text. Syntax is hard to beat tho, embodying all the good humanist traits of the classic book romans in a sans.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "_Serif fonts are ideal for body text as the serifs aid readability by helping the eye move from one letter to the next,_\n\nIs this a measured fact or just what we've always assumed?\n\n_Sans-serif fonts are often used for headings as they often convey more personality than old-style serif fonts._\n\nWhether or not a face has serifs or not is independant from its ability to convey more or less personality.\n\n_It is worth the time to search and download new fonts from the Internet._\n\nI'd maybe add search, PURCHASE, and download... ;o)\n\nAnd then maybe list out a small list of quality free fonts if that's their only option.\n\nAlso, I'd talk about other (more?) important aspects...column widths, leading, white space, etc.\n\n"
    },
    {
      "time": "",
      "content": "I would not say that serif fonts are more readable but that they are more comfortable to read in long texts.\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "Héctor, you may be making a semantic argument there. Are \"comfortable to read\" and \"readability\" the same thing, or just different ways of defining readability? Ease or comfort of reading is integral to readability in the sense that fonts that are \"comfortable to read\" are inherently more readable.\n\nI'm not making a 1 = 1 argument, but I think your view is semantic to some extent, rather than describing a practical difference. So I suppose the next question to ask is whether \"comfortable to read\" can be equated with \"readability\".\n\n_Is this a measured fact or just what we’ve always assumed?_\n\nThe idea of serifs \"aiding readability by helping the eye move from one letter to the next\" is an innacurate description how people read. In reality we read words, not letters. We read by cognitive recognition of individual word shapes. The eye does not move from one letter to the next; it takes in word shapes whole and the brain recognizes those shapes with its very sophisticated and specialized shape recognition faculty.\n\nIt is a measured fact from studies by Jarval that seriffed fonts are more readable than sans serifs. Roman type has been proven faster to read, causing fewer backwards saccades (reversions in which the eye jumps back to re-read portions of text, caused by either an ambiguous word shape or an unfamiliar one. Unfamiliar word forms are deciphered letter-by-letter). Hrant Papazian documented the whole phenomenon of how we read in his essay _Improving the Tool_.\n\nThe scientific analysis of readability and how we read needs to be balanced against the role of cognitive perception in reading. This was discussed a bit on this thread:  \n [http://typophile.com/node/9736](http://web.archive.org/web/20101205002131/http:/typophile.com/node/9736 \"http://typophile.com/node/9736\")\n\nBy the way, we're drifting off topic with this discussion of readability :^) I don't mind tho if you guys want to continue. The discussion of the font guide has run its course.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Wow thanks for all this everyone - i'm more than satisfied, and have taken it all onboard and implemented appropriate changes.\n\nThis typophile forum is truly amazing.\n\n"
    },
    {
      "time": "",
      "content": "_...they are more comfortable to read in long texts.  \n...seriffed fonts are more readable than sans serifs._\n\nReal typographers don't generalize, they specify.\n\n"
    },
    {
      "time": "",
      "content": "Mention that alignment can also aid/hinder.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Nick, is \"more\" the ambiguous word? I don't know of any percentage figures for serifs v.s sans.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "James, statistical comparison of sans with serif is meaningless.  \nIt's like saying men are stronger than women.  \nEverybody knows they are, but there are always subsets of either group which reverse the distinction.\n\nBean counting is one way of thinking, design is another.  \nIn fact, design is more a way of doing.  \nAs design is both practice and theory, proponents of each aspect are always laying greater claim to control. Well, more usually it's the boffins who don't actually do it who are trying to wrest control from the human hand, and systematize and automate the process into a chore suitable for drones and bots.\n\nWith this philosophy, we can look forward to a brave new world in which every consumer has their optimum typographic setting, based on their demographic classification. Bit recursive, eh?\n\nNathan is right to call his project a Guide, not Rules.  \nBut rather than design from learned principle, it is better to learn from practice.  \nThe best way for a neophyte to get it right is by copying exemplary models.  \nif you try to duplicate the word-count and general appearance of a piece of setting that you admire, using a similar (or even the same) font, you will get a much better understanding of the way that typographic parameters work, and interact, than piecing things together from guidelines. You will develop a feeling for type.\n\nTypographic design is better a process of induction, not deduction.\n\n"
    },
    {
      "time": "",
      "content": "James:\n\nThanks for that post. Do you have more info on that specific study?\n\nI've also read that reseach has shown that 'people read best what they're most familiar with' and that the serif = easier to read may simply have to do with that's what most people read (paperbacks, newspapers, etc.) Either way, it's a valid result, even if perhaps self-fulfilling prophecy.\n\n(also, great post, Nick.)\n\n"
    },
    {
      "time": "",
      "content": "Nick, I wasn't sure if you meant we were generalizing or specializing; I get the drift of what you said (at first) now. Thanks for expanding.\n\n_statistical comparison of sans with serif is meaningless_\n\nYep, like apples and oranges, or pot versus kettle. I'm skeptical of statistics from having used them in ads to manipulate markets and consumers. Statistics are often made up by people determined to prove what they believe to be reality by throwing a blanket over everything. Qualitative analysis carries relevance and import from the perception of readers. Perception and reader experience is what counts. Testing and stats describe what was tested, and sometimes tell us more about the experiment itself. _The act of observing_ always biases the result.\n\n_Bean counting is one way of thinking, design is another.  \nIn fact, design is more a way of doing._\n\nAre you familiar with Edward De Bono's _Thinking for the New Millenium_? The key phrase he drummed up for that book is:\n\n**\"Design a way forward\"**\n\nThe book argues that empirical, rational judgement systems that served us in past centuries are outmoded because of the rapid rate of change we live with now, and to survive and compete in our Crave New World we have to shed the judgement-based rationale in deference to \"designing a way forward\". Solutions to problems that worked yesterday might not work tomorrow, so we need to be a lot more flexible in how we solve problems, designing as we go instead of relying on legacy methods. He doesn't specifically say that the proliferation computers is responsible for the rapid rate of change, but it isn't hard to see that parallel of cause and effect.\n\nWriters and designers have been designing answers to problems all this time; to us it comes naturally. When I write, I design by arranging words to impose structure. Structure and design makes writing comprehensible.\n\nI decided a while ago that the fonts we design in years to come may need to incorporate flexibility as an operating principal to allow a font's features and components to adapt to subject matter whose rules for grammar, orthography etc, might be different from the time the font was designed. In short, fonts and alphabets might need to respond to changes imposed by the cultural environment. Fonts might have to adapt and reconfigure themselves in response.\n\nIts a pretty abstract concept and hard to describe. I hope you can grasp what I'm driving at.\n\n_Bit recursive, eh?_\n\nIt's a backwards-looking model that resembles socialism and is really oppressive. Modernism gone mad. No thanks.\n\n_Typographic design is better a process of induction, not deduction._\n\nIt is _neccessary_ to absorb from successful models...and it helps to be flexible; adopt, and be prepared to adapt.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Darrel, research by Jarval and others is referenced in Hrant's _Improving the Tool_ essay, published in Gunnar Swanson's book [Graphic Design & Reading](http://web.archive.org/web/20101205002131/http:/www.gunnarswanson.com/GDandR/GDandR_Book.html). Great reading if you're serious about graphic design and communication or type design, or both.\n\nYou could ask Hrant nicely about getting hold of just his _Tool_ essay. Touch wood.\n\n_I’ve also read that reseach has shown that ‘people read best what they’re most familiar with_\n\nI don't know that that was from research. I think you mean Zuzana Licko's statement \"We read most what we read best\". By that she meant that alphabets and fonts are only readable or comprehensible at all because we're familiar with the letter forms. Russians who only read stuff written in the Cyrillic script read Cyrillic best because that's all they've ever read, and since they're not familiar with the Latin alphabet they hardly ever read text set in Latin---because they can't. Their brain's shape cognition cortex is axon-modelled to recognize Cyrillic forms.\n\n_...easier to read may simply have to do with that’s what most people read (paperbacks, newspapers, etc.)_\n\nYou recognize best what you already know. But that's a perception that can change, and reader experience points to certain typefaces being easier to read than others---provided the reader is acclimatized to them.\n\n_...also, great post, Nick._\n\nNick is the fount of articulation, the voice of experience.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Nathan (noftus), I think it’s great that you are trying to give students suggestions and guidelines for the design and production of their yearbook.\n\nThis is especially a fine opportunity to instill basics of design and typography even if they are not art students, since inevitably they will find themselves in front of a PC or Mac creating a presentation of one kind or another in the future.\n\nFor the most part, virtually every student today is familiar with computers, and many of them have probably selected typefaces for heads and body text via menu options for their school, community and personal projects.\n\nSchool yearbook publishers already provide some great tips and FAQs for students who are involved with designing and producing their school yearbook. I feel there is no need to replicate what is readily available to students online.\n\nI do agree with you strongly about giving them direction as teacher/advisor to student as you are intending to do, because most anyone at anytime can search for info on the Internet, but as a teacher, only you can see if they understand.\n\nAlso, when you are satisfied with your yearbook guide, it would be great if you could post it as a topic in the [Typographic Education](http://web.archive.org/web/20101205002131/http:/typophile.com/forum/16) area of Typophile for other teachers and students to review.\n\n**_Visit these sites with your students_:**\n\n[**Type & Graphics FAQ  \nTaylor Publishing** ](http://web.archive.org/web/20101205002131/http:/www.taylorpub.com/Education/typeandgraphics.aspx)  \nGenerally helpful and contains a few of the tips that you intend to include in your Guide. Some of the terminology is geared for general public (not actual graphic arts or type terms used) but it’s presented with high school students and yearbooks in mind. The FAQ even goes into drop caps and specialty typefaces. Slightly dated since they only reference PostScript type fonts, but that’s where you can update your students.\n\n[**2005 InDesign Design Contest winners**](http://web.archive.org/web/20101205002131/http:/www.jostens.com/yearbook/adobe_contest_winners.asp)  \nLetting students know that taking time to do a job well doesn’t always hit the mark. Letting them see what their contemporaries produced in the previous year might help to set a higher visual standard for their own yearbook. Josten, Inc., runs an annual contest (with prizes) recognizing 15 middle school and high school students for their creativity.\n\nIn addition to the advice you have received by others on Typophile, here are a few suggestions:\n\n**Font vs. Typeface**  \nThis is a personal pet peeve of mine, as I hate to see the word _typeface_ disappear completely as a term.\n\n**Typefaces** are designed visually. They are selected, set and positioned on a page for visual balance and impact; typefaces are used to organize, display and augment the textual content.\n\n**Fonts** are required in order to access the typefaces with a particular complement of characters or glyphs. Fonts are acquired, loaded and selected for use within particular devices (PC, Mac, mechanical or digital sign plotters, video games, cell phones, etc.).\n\nIf we don’t preserve these distinctions, communications such as this can sound a little ridiculous:\n\n_I’d like to use Adobe Garamond for text, but there are no old style numerals. Should I select another typeface or should I load another font?_\n\nSo far, for personal computers, not ALL fonts contain EVERY available character designed for a given typefaces. A single typeface can also be available in numerous font formats (OpenType, TrueType, PostScript, etc.) and purchasing a single font does not automatically give you license to use any characters, weights, styles, font format, for loading on any device not explicitly contained on that font and as stipulated by the EULA (End User License Agreement).  \nYes, I know this is very complex, and it may not be an actual entry used in your guide, but unless we (educators, design professionals, and the type industry) try to educate ALL type font users about this, the type industry may no longer exist as we know it.\n\n**Ragged right vs Justified columns**  \nYou’ll find this topic hotly debated. Let it be sufficient to advise students that if they decide to use flush left and right justified columns, they should be aware of word spacing inconsistencies, that line spacing/leading becomes more critical, that there will be line width and hyphenation issues, etc.\n\n**Serif vs Sans Serif**  \nPersonally, I feel that this is less of an issue since most yearbooks do not have extensive amounts of text matter. They are more like periodicals, and more like _People_ magazine than _The New England Journal of Medicine_. Text within individual sections of a yearbook tend to run only a few spreads with lots of graphics or photos. In that light, sections can be treated with some uniqueness, like some magazines, and use of sans or serifs becomes less ominous a decision… just so long as students understand type guidelines are not universal, but apply more to specific usage and context. Magazines, novels, yearbooks, advertising, etc. are all very different applications.\n\nThere are some interesting examples of yearbook spreads in the [Jostens Contest winners](http://web.archive.org/web/20101205002131/http:/www.jostens.com/yearbook/adobe_contest_winners.asp%E2%80%9D).\n\n**Text vs Display and Specialty/Novelty Typefaces**  \nRemembering that your students may not be graphic design majors (if so… then they shouldn’t graduate if the don’t know what to do), but including some of the suggestions offered by Forum members would be very useful. To simplify understanding for non-visually oriented students, it might be sufficient to explain key differences between reading multiple lines of text, captions and running copy than reading a few words contained in headlines and titles. Specialty and novelty typefaces are not to be completely avoided, but they are very much like hot chili sauce, sugar or vinegar. Used very sparingly they can spice up, sweeten or add a little tang to layouts, and a little too much use can be very unappetizing.\n\n**My Personal Reflections on Yearbooks**  \nI went to a “brainy” all boys high school, where we tried to be professional and very “grown up”. I just browsed through my own high school’s yearbook and I must say it looks very dull, overly academic, too symmetrical, non-dynamic, uninviting to read and the team sports sections were treated identically as the faculty and academic studies sections. Sad, but maybe that was actually a reflection of the student body… dull and too academic.\n\nI compared it to my wife’s high school yearbook (she went to a co-ed Catholic school). The layouts are terrible, use of type inconsistent and visually painful to typophiles, but somehow their energy, fun and idealism shows through. Still an ugly publication, but enjoyable to flip through.\n\nI’m not advocating visual pollution, but a yearbook should be a reflection of who the students are and not who they want to be. Because years (and decades) later, when you sit down to reminisce the second half of your teenage years, the yearbook will be your touchstone. It will be the only high school yearbook a graduating class will ever have. Encourage them to make it an intimate and personal document of their collective experiences. In the end, that will be far more significant than what typeface they used for heads.\n\n"
    },
    {
      "time": "",
      "content": "Good stuff - and a commendable effort.\n\nYou should add something about vertical proportions: for text,  \nthe bigger the x-height the better the font is for small text;  \nand a too-big x-height impedes readability at average sizes.\n\nAlso: italics actually has lower readability.\n\n\\> Real typographers don’t generalize, they specify.\n\n<cite>Humans</cite> generalize.\n\n\\> Everybody knows they are\n\nNot even close.\n\nIgnore theory = rehash precedent AND/OR navel-gaze.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Perhaps it might be worth while listing the fonts of those bundled with Windows, Word or Mac OS that are best for text: Palatino Linotype and Monotype Garamond, for instance.\n\n"
    },
    {
      "time": "",
      "content": "Is this the place where us old farts can reminisce about typing yearbook copy on a standard monospace typewriter and adding spaces between words and/or letters to achieve justified columns?\n\nI would suggest that you add something about how distracting it is to use too many different typefaces on a page. David mentioned using two or three faces, but I think your message should be stronger. Using 20 or more typefaces on a page is one of the most common mistakes made by novice typesetters.\n\nDoes anyone still have a link to the NYC menu that \"empties the type drawer\"? It's a great example of what not to do.\n\n"
    },
    {
      "time": "",
      "content": "I'd be very surprised if that menu beats this:  \n [http://www.themicrofoundry.com/other/typorgy.jpg](http://web.archive.org/web/20101205002131/http:/www.themicrofoundry.com/other/typorgy.jpg \"http://www.themicrofoundry.com/other/typorgy.jpg\")\n\nIt's so \"good\" that Caroline Archer used it  \nduring the recent thing she did for the BBC.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Woot, what a great thread. Noftus any chance you want to make a pdf doc summarizing all this that I can give to my sisters' school? In fact their is some highschool yearbook conference in Frisco that I think is annual. If this gets made I could email them and hopefully spread the wealth!\n\nIf you don't have time I might be able to do it. I mean I could get it done, but my expertise is limited to what I've read here so I would like to leave it to greater minds to create it.\n\n"
    },
    {
      "time": "",
      "content": "Here's the guide that I ended up writing:  \n [http://rockstarmemoirs.com/year12/stylebook/eStylebook2006.pdf](http://web.archive.org/web/20101205002131/http:/rockstarmemoirs.com/year12/stylebook/eStylebook2006.pdf \"http://rockstarmemoirs.com/year12/stylebook/eStylebook2006.pdf\")\n\nThe font guide is on page 57.\n\nIt's specific to Australian Year 12 grade yearbooks, which are different to US school ones.  \n [http://en.wikipedia.org/wiki/Yearbook#Australia](http://web.archive.org/web/20101205002131/http:/en.wikipedia.org/wiki/Yearbook#Australia \"http://en.wikipedia.org/wiki/Yearbook#Australia\")\n\nAs a side note, since this post I've gone to run workshops at several high schools, and always talk about fonts. Many aware 13 year old kids quite surprisingly, actually do recognise that Arial and Times New Roman \"suck\", are too common, and cry out for alternatives. It's amazingly pleasing.\n\n"
    }
  ]
}
