{
  "id": "17126",
  "title": "Irony mark punctuation",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Kevin Larson at MS as come up with a solution for those of us prone to irony — the irony mark! I can’t wait to start putting it in fonts.\n\n[http://blogs.msdn.com/fontblog/archive/2006/01.aspx](http://web.archive.org/web/20070911200520/http:/blogs.msdn.com/fontblog/archive/2006/01.aspx \"http://blogs.msdn.com/fontblog/archive/2006/01.aspx\")\n\nGeorge\n\nI felt bad because I had no shoes until I met a man who had no Bodoni\n\n [‹ Barnhart Brothers ampersand problem](http://web.archive.org/web/20070911200520/http:/typophile.com/node/17299 \"Go to previous forum topic\") [Do you have any Resolutions for the New Year? ›](http://web.archive.org/web/20070911200520/http:/typophile.com/node/17029 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911200520/http://typophile.com/user/4883\" title=\"View user profile.\">gthompson</a>",
  "time": "<br>",
  "uid": "4883",
  "comments": [
    {
      "time": " 6.Jan.2006 6.37pm",
      "content": "I made a comment to the blog, but it hasn’t shown up yet. Based on the suggested form illustrated, I suggested that the Arabic question mark character could be used in English text to indicate irony, perhaps prompting the Arabs to use the European question mark for the same purpose `؟`\n\nMisunderstood irony is, after all, a kind of bidirectional confusion of intent and intepretation.\n\n"
    },
    {
      "time": " 6.Jan.2006 7.08pm",
      "content": "More comment on the KevLar post...\n\n[http://blogs.msdn.com/michkap/archive/2006/01/06/509784.aspx](http://web.archive.org/web/20070911200520/http:/blogs.msdn.com/michkap/archive/2006/01/06/509784.aspx \"http://blogs.msdn.com/michkap/archive/2006/01/06/509784.aspx\")\n\n"
    },
    {
      "time": " 6.Jan.2006 8.17pm",
      "content": "So can the U+061f ARABIC QUESTION MARK be used for this or should there be a proposal to the Unicode Consortium for another ID (irony mark here)\n\nGeorge\n\nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 6.Jan.2006 8.39pm",
      "content": "No, using the Arabic question mark, except in humour and without warranty of results, is not a good idea, as I tried to suggest in my comment to Kevin’s piece and as Michael Kaplan notes in his own blog response. Characters have directionality properties, and these can cause all sorts of behaviour depending on their own directionality, the directionality and relative directional strength of adjacent characters, and directionality of the document or paragraph. You wouldn’t want to introduce an ’irony’ mark in the middle of some English text and have subsequent text ordered to the left of the mark. It is a relatively unlikely outcome, but the possibility exists.\n\nAnother concern would be that some applications try to get clever with mirroring Arabic punctuation, which is a real headache already because no one seems to agree on how this should be done correctly. What happens, for example, if you hit the [ key when an Arabic keyboard driver is active when typing in Arabic, are you indicating that you want a left bracket or are you indicating that you want an opening bracket, which in Arabic would by a right bracket? I’ve seen both interpretations, and I can imagine similar confusion about the ? key arising if people start using both Arabic and European question marks in the same language.\n\n"
    },
    {
      "time": " 7.Jan.2006 1.30pm",
      "content": "i think the proper punctuation mark for irony in most cases is the period.\n\n"
    },
    {
      "time": " 13.Jan.2006 4.58pm",
      "content": "The founder (or something) of the Baltimore Sun  \nadvocated using backslanted text to mark irony.\n\nI think the h-flipped question mark isn’t a bad idea.\n\nPaul, good one.\n\nhhp\n\n"
    },
    {
      "time": " 14.Jan.2006 2.22am",
      "content": "OK, Hrant, I’ve got to get my Baltimore pride on…\n\nThat was [H.L. Mencken](http://web.archive.org/web/20070911200520/http:/en.wikipedia.org/wiki/Mencken) (after whom JFP named the new typefaces for the Baltimore Sun). Mencken wasn’t the paper’s founder (the paper dates back to at least the early 1800s). He was an editor during the first half of the 20th century, and was one of the centuries most influential american writers and journalists.\n\nHe suggested the irony slant be added to the Linotype machine’s (?) offering of faces, because he saw Americans as being incapable of understanding humor.\n\n"
    }
  ]
}
