{
  "id": "17133",
  "title": "New Kodak Logo",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Feels like a lot of companies new years resolutions were to rebrand themselfs. Kodak is newest one that has done just that.\n\n\"In another break with the past, Eastman Kodak Co. is introducing a new corporate logo designed to help the company forge a new image as a cutting-edge, 21st century innovator.\n\nKodak's new corporate symbol retains the company's distinctive red and yellow colors, but does away with the boxes that have contained the word \"Kodak\" for the past 70 years.\"\n\nI think the new logo doesn't say anything about the company. They left out the red box which was the the only original thing they had going for them. I don't know about this one, what do you guys think?\n\n| Attachment | Size |\n| --- | --- |\n| [kodak.jpg](http://web.archive.org/web/20120415120125/http:/typophile.com/files/kodak.jpg) | 46.59 KB |\n\n",
  "author": "fsamuel",
  "time": "7 Jan 2006 — 1:10pm",
  "uid": "10646",
  "comments": [
    {
      "time": "7 Jan 2006 — 1:17pm",
      "content": "to me: unbelievable. how can a company discard a good, well-known sign for something as non-distinct (and typographically mediocre) as the new sign.\n\na refinement of their old logo would have done a far better job.\n\n"
    },
    {
      "time": "7 Jan 2006 — 1:33pm",
      "content": "True, curtze. This is even worse than the other recent rebrandings (UPS, AT&T, Intel) because they shed what was distinct and recognizable in their mark for a very generic symbol.\n\n"
    },
    {
      "time": "7 Jan 2006 — 3:07pm",
      "content": "I think Kodak is running scared. The film and processing business made billions for them but they are bit players in the new digital world. Photo CDs are old hat with web sources dominating the stock image market. Where is their niche? They don't know. They don't have a new vision to go to so they make a nondescript logo which distances them from their past but gives them no future. Rebranding is fine if you have something to rebrand to. What is Kodak's go-to spot in the market? I sure don't know. Does anyone else see where they can travel?\n\nChrisL\n\n"
    },
    {
      "time": "7 Jan 2006 — 3:20pm",
      "content": "Watch'em all burn.\n\n"
    },
    {
      "time": "7 Jan 2006 — 4:35pm",
      "content": "I think they will keep fighting for some time. But I agree this re-brand does look like a mistake for the reasons mentioned. Of course there is aple room for another re-brand to correct this problem. Think of the Prudential re-brand. They steped back from the brink. Kodak can too.\n\n"
    },
    {
      "time": "7 Jan 2006 — 4:53pm",
      "content": "Kodak will be OK.  \nThey could give away digital cameras, and still make money on selling the batteries for them.  \n(They realized that the distribution logisitcs of batteries are the same as film rolls quite some time ago.)  \nThey also own Leaf, which was the first high-end pro digital camera.  \nThey may not be the dominant force that they once were, but they have diversified, and there will always be a residual market for film, just as there is for vinyl.  \nOh, and yeah, the new logo is a bit weak.  \nFunny how big ole companies will ditch a longstanding logo just as it's coming back into style, replacing it with something that's just going out of fashion!\n\n"
    },
    {
      "time": "7 Jan 2006 — 5:43pm",
      "content": "Wasn't Leaf the high-end scanner maker a few years back? 80s?\n\nI love your \"batteries\" analogy with film Nick :-)\n\nChrisL\n\n"
    },
    {
      "time": "7 Jan 2006 — 8:21pm",
      "content": "A bit weak? Mr.Shinn, you have a gift for understatement.\n\n"
    },
    {
      "time": "8 Jan 2006 — 10:08am",
      "content": "Very strange. Re-branding for re-branding's sake I think. Also, apart from the bizarre finial on the 'a', I find their previous logo distinctly more contemporary.\n\n"
    },
    {
      "time": "8 Jan 2006 — 5:08pm",
      "content": "Of course this is a bad mark because they have no swoop or swirl or swoosh.\n\nAnd it's not blue.\n\nHow the heck can you rebrand without a swoosh and no blue?\n\nShoulda asked me:\n\n ![](http://web.archive.org/web/20120415120125im_/http:/typophile.com/files/kodak_spoof.gif)\n\nMy design is better because it has swooshes (2 of them for double the effective rebranding capacity). Massive rebrand blueness. Arial, which is a font that everybody has on their computer, so now even the CEO can make his/her own advertising designs and have the corporate font for free! Poor spacing and kerning for added communications smoothness and finesse. Also a cool new tag line that's all about the future. And clicking.\n\nJon\n\n"
    },
    {
      "time": "8 Jan 2006 — 5:25pm",
      "content": "I'm buying stock tomorrow. Good job.\n\n"
    },
    {
      "time": "8 Jan 2006 — 5:26pm",
      "content": "I like this tagline even better: <cite>We're all about the future. And clicking.</cite>\n\n"
    },
    {
      "time": "8 Jan 2006 — 8:47pm",
      "content": "In my opinion, part of the reason these corporate rebrands are failing is that they are giving in to design by committee. I attribute this to all of the branding firms or internal designers who are just trying to make money and please the client instead of putting forth strong opinions. I believe all of these rebrands would turn out stronger if they had a singular designer like Paul Rand who could really sell the company on a strong idea and not take no for an answer. Maybe I'm being nostalgic, but it seems to me like money is the motivator these days and not soul or quality. Just a quick drunk thought...\n\n"
    },
    {
      "time": "9 Jan 2006 — 7:04am",
      "content": "More discussion on this new logo and some direct-from-the-design-team insight (in the comments) at [Speak Up](http://web.archive.org/web/20120415120125/http:/www.underconsideration.com/speakup/archives/002512.html#002512).\n\nNote: The yellow bars are not actually part of the logo. It's just the wordmark.\n\n"
    },
    {
      "time": "9 Jan 2006 — 8:41am",
      "content": "From the \"Speakup\" link:  \n\"From the only press release so far on the change: This new look moves the Kodak name out of the traditional yellow box; giving it a more contemporary design, a streamlined rounded look and distinctive letters. This introduction is the latest step in the company’s broad brand transformation effort, which reflects the multi-industry, digital imaging leader Kodak has become.\"\n\nI think that \"digital imaging leader Kodak has become\" is a bit overstated if not wishful thinking. Names like Canon, Adobe, and Epson (among others) come to mind way before Kodak.  \nChrisL\n\n"
    },
    {
      "time": "9 Jan 2006 — 11:25am",
      "content": "I thought that by purchasing CREO Kodak became a leader overnight. I think that the new wordmark refers to the CREO logo (which looks strangely familiar to me... [intel?](http://web.archive.org/web/20120415120125/http:/intel.com/))\n\n ![](http://web.archive.org/web/20120415120125im_/http:/typophile.com/files/graf_creo.gif)\n\n"
    },
    {
      "time": "9 Jan 2006 — 11:32am",
      "content": "If not intel...perhaps close to the new UPS brand? that 'r' seems like it would fit...\n\n"
    },
    {
      "time": "9 Jan 2006 — 1:00pm",
      "content": "the \"d\" looks like an old roll of film from the end\n\n"
    },
    {
      "time": "10 Jan 2006 — 1:06am",
      "content": "Kodak definitely needs an update... they got into the digital game late, believing, like many photographers 8 years ago that digital couldn't hold the quality of film. They built their empire on cheap distribution of film and film processing (paper) and kiosks. Old, old and um, old.\n\nThe photography companies that are players now are the ones coming from either the quality camera optics realm, like Nikon or Canon or the ones that have always been more in the consumer technology realm, Sony and Panasonic. Look at the top cameras for consumers and HP is in the game, which nobody could've guessed 5 years ago.\n\nKodak is trying pretty hard to turn into a digital company, and the old image is the last thing to go. I hope the rebrand works for them.\n\n"
    },
    {
      "time": "10 Jan 2006 — 4:35am",
      "content": "I noticed that no one's really commented on the typographic design of the new logo.\n\nTo me, the odd shape of the d-a combination, especially with the round bottom of the d, makes this new logo look like it says \"Koolak.\"\n\nBecause the red \"K\" box was so strong I'm surprised it wasn't worked in to logo as some form of wordmark, or even as a stylized leading K.\n\nBranding is all about those swooshes and arrows, though I suppose in this case a stylized K arrow would have been pointing backwards..!\n\n"
    },
    {
      "time": "10 Jan 2006 — 5:31am",
      "content": "Gary, it is so weak overall that it's really not worth it to go in details. Even I wonder what they were thinking when doing this rebrand. They used to be a respectable company with a lot of history and it seems that they have discarded it all virtually overnight....\n\n"
    },
    {
      "time": "10 Jan 2006 — 7:49am",
      "content": "It would seem as if the days of designing marks of significance are past.\n\nIn a few years, all corporate logos will be nothing but a series meaningless motion gestures and hack alterations of great typefaces.\n\n"
    },
    {
      "time": "10 Jan 2006 — 7:53am",
      "content": "\\>Look at the top cameras for consumers and HP is in the game, which nobody could’ve guessed 5 years ago.\n\nOff-topic, but who 5 years ago would have guessed that Nokia would be the #1 supplier of cameras world-wide? I'd guess that 99.6% of pics taken from mobile phones don't ever get printed - that kind of leaves Kodak in the dark (room).\n\nHere's a related logo that really needs a make-over...  \n [http://www.tonystrading.co.uk/galleries/annuals/kojak.htm](http://web.archive.org/web/20120415120125/http:/www.tonystrading.co.uk/galleries/annuals/kojak.htm \"http://www.tonystrading.co.uk/galleries/annuals/kojak.htm\")\n\n"
    },
    {
      "time": "10 Jan 2006 — 8:06am",
      "content": "Interesting that here people are very negative about the new logo, while at Speak Up they are positive or at least trying to be. The a looks bad to me as well.\n\n"
    },
    {
      "time": "10 Jan 2006 — 8:22am",
      "content": "\\> <cite>Interesting that here people are very negative about the new logo, while at Speak Up they are positive or at least trying to be.</cite>\n\nI wonder if that has to do with the fact that Allen Hori of Ogilvy & Mather’s Brand Integration Group (design team responsible for the new logo) is part of the discussion.\n\nIt's easy to harshly criticize when the designer is nameless/faceless (or at least, not in the same room). However, some at Speak Up seems to understand a bit of tact goes a long way when you're discussing a design directly with the person who created it.\n\n"
    },
    {
      "time": "10 Jan 2006 — 8:35am",
      "content": "\"Kodak is trying pretty hard to turn into a digital company, and the old image is the last thing to go. I hope the rebrand works for them.\"\n\nI don't know what \"trying pretty hard\" means but a rebrand should have something new in the business model to reflect, not just a hope that if you \"Look like a Duck\" people will assume that you can quack. The problem is the new logo looks like it was made by a quack.  \nMy philosophical 2 cents worth (or 2 points worth):  \n1. Rebrand if you must but have something tangible going on in your company worthy of a second look. (Not just a smoke-and-mirrors job!)  \n2. When you redesign a logo, make it at least as good as the one you are replacing. A brand is a precious thing to waste.\n\nI wish Kodak well with repositioning themselves and becoming a viable player but the logo just plain ain't makin' it.\n\nChrisL\n\n"
    },
    {
      "time": "10 Jan 2006 — 11:11am",
      "content": "\\>a bit of tact goes a long way when you’re discussing a design directly with the person who created it.\n\nOk, since we're not there, I'll be tactless. Could the series of bad logos we're seeing have something to do with the designers being graphic artists rather than type designers,and not really being used to doing type design? It seems to me that you would might get much better logos out of an accomplished type designer, or someone who has done a lot of logo work specifically. Just asking.\n\n"
    },
    {
      "time": "10 Jan 2006 — 11:31am",
      "content": "William - Although type design is a related art - it isn't what's missing. Graphic design is just a broad term. It can mean 100 things. People who specialize in the design of 'identity' ( and obviously who need to be typographically sensitive) are what's required. Not type gurus. Marketing is about more than getting your 'kern on' or getting the bezier 'just so'. A whole lot more. I agree with the folks who said design by committee. Anytime a logo has this much indistinctiveness I always assume a committee had the last word.\n\n"
    },
    {
      "time": "10 Jan 2006 — 11:32am",
      "content": "\\>a bit of tact goes a long way when you’re discussing a design directly with the person who created it.\n\n...and most important: to see what they rejected.\n\n\\> ...or someone who has done a lot of logo work specifically.Just asking.\n\nAllen Hori is a well known creative director, talented guy... so I don't know what to say/answer...\n\n"
    },
    {
      "time": "10 Jan 2006 — 11:35am",
      "content": "Identity Design is collaboration so Allen Hori can't be held \\*completely\\* responsible.\n\n"
    },
    {
      "time": "10 Jan 2006 — 11:52am",
      "content": "Strategically, the mark needed a refresh, and I am sure that Kodak will back this up with new packaging, POS signage, etc. to round out the whole brand. I am disappointed by the loss of the iconic K.\n\nI am very interested in seeing a critique of the letterforms. My first impression is that the a is wrong (too heavy at the bottom) and that the bottom right of curve on the d is wrong (the curve into the straight stroke is abrupt). Perhaps the form is correct, but that the beziers needed to be handled by a professional.\n\n"
    },
    {
      "time": "10 Jan 2006 — 12:45pm",
      "content": "\\>the beziers needed to be handled by a professional\n\nI don't think the biggest problem here is one of concept--although I don't particularly think the 'Bauhaus' style type is particularly forward looking, which it seems is what they wanted.\n\nThe problem is, as Joe gently (but deadly!) indicates, is that it is badly drawn. Do any of the experienced type designers here think the a, and d too, are well drawn? If someone has posted this to one of the critique forms, I'm sure people would jump on the break in the a and d--\"Is it round or a corner? Make up your mind don't be wishy washy...\"\n\nCan you imagine if Doyald Young or Jim Parkinson or Mark Simonson were given this general concept, that they would produce these letters? No way.\n\n"
    },
    {
      "time": "10 Jan 2006 — 1:16pm",
      "content": "William - you make a good point here. The thing you have to keep in mind is that distictiveness & memorability can run counter to what is classically good and certainly orthodox type design. Making a company name/logo take slightly longer to resolve can aid in it's memorability a very desirable feature - but the distictiveness has to be done well. And it hasn't been done well in this case I think.\n\nBy making the a into an upsidedown e ( as I read it ) they were looking to slow down the eye & make is easier to recall the shape later. Same thing with the vague looking d. I think there was a method to the madness.\n\n\\> the bottom right of curve on the d is wrong\n\nBut I also think the variation was poorly judged. I agree with Gary that the logo almost reads as 'Koolak' now. I think that the abruptness of the curve as Joe says, makes it misread.\n\nI have seen the logo a bit larger & more clearly now & it is better that way - but the basic problem set is the same. Moreover it needs to work well at low rez! Especially now.\n\n"
    },
    {
      "time": "10 Jan 2006 — 2:13pm",
      "content": "I'm not a big fan of the 'd' or the 'a'. Overall character weight seems to vary too. I think the kerning is about the best feature of this new logo. As far as why are all these new logos like intel looking so bad, I think a lot of it is design by committee. Another big part is probably design on computer. When clients sees preliminary marks, they often want to add color. If the mark doesn't work in black and white, it's just not working.\n\n"
    },
    {
      "time": "10 Jan 2006 — 2:37pm",
      "content": "I think it could have been mod'd a little bit, just enough to give it some digitalness. Somebody needs to write a book about these hacks responsible for ruining the classics.\n\n"
    },
    {
      "time": "10 Jan 2006 — 4:32pm",
      "content": "_In a few years, all corporate logos will be nothing but a series meaningless motion gestures and hack alterations of great typefaces._\n\nAnd gradients. Lots of gradients. And let's not forget drop shadows...very classy.\n\n[www.ups.com](http://web.archive.org/web/20120415120125/http:/www.ups.com/ \"www.ups.com\")\n\n"
    },
    {
      "time": "10 Jan 2006 — 4:47pm",
      "content": "As someone pointed out before, I also feel as if the age of concept driven design is quickly becoming a thing of the past. The group think mentality involved in design can really kill a brilliant concept. I've seen it time and time again. Slick, slick, slick, and modern (or what is perceived as modern) are all these companies seem to want.\n\nWhere's the integrity in design nowadays? People who actually believed in a concept and not just a paycheck? I'll take a Paul Rand logo any day of the week over this \"shyte\". Though I must admit, if any company needs a rebrand its IBM...certainly not timeless. [www.ibm.com](http://web.archive.org/web/20120415120125/http:/www.ibm.com/ \"www.ibm.com\")\n\n...although someone will probably just use FF Dax or FF Din and make it all lowercase.\n\n"
    },
    {
      "time": "10 Jan 2006 — 6:35pm",
      "content": "I would love to see an ibm logo that was drawn by hand. Maybe in ink. That would be VERY cool.\n\n"
    },
    {
      "time": "10 Jan 2006 — 6:59pm",
      "content": "\"I would love to see an ibm logo that was drawn by hand. Maybe in ink.\"\n\nIt was. Paul Rand drew it by hand. It was just the way things were done then.\n\nChrisL\n\n"
    },
    {
      "time": "10 Jan 2006 — 9:39pm",
      "content": "\\> It was. Paul Rand drew it by hand. It was just the way things were done then.\n\nTrue, this was several years before Steve Jobs invented digital typography ;-)\n\nSeriously though, I'm sure sure one of the original ink drawings would be on display or available for viewing at the IBM museum.\n\n"
    },
    {
      "time": "11 Jan 2006 — 12:37am",
      "content": "I guess Ikarus flew too close to the Sun then to predate Jobs & Co, :-)\n\nChrisL\n\n"
    },
    {
      "time": "11 Jan 2006 — 8:07am",
      "content": "re; the ink I see your point. But I meant a casual almost gestural ibm. Something that felt natural and handmade and unpremeditated.\n\n"
    },
    {
      "time": "11 Jan 2006 — 10:48am",
      "content": "But would that say future? Or computers?\n\n"
    },
    {
      "time": "11 Jan 2006 — 10:55am",
      "content": "RE IBM - this linkie just posted to the ATypI list...\n\n[http://www-03.ibm.com/ibm/history/exhibits/logo/logo\\_1.html](http://web.archive.org/web/20120415120125/http:/www-03.ibm.com/ibm/history/exhibits/logo/logo_1.html \"http://www-03.ibm.com/ibm/history/exhibits/logo/logo\\_1.html\")\n\n...by longtime IBM font guy Jeff Engelman.\n\nSi\n\n"
    },
    {
      "time": "11 Jan 2006 — 2:35pm",
      "content": "Si,  \nYour link brings back old memories. While I was attending Carnegie Mellon (1962-1966), I studied with and worked part-time for Ken Hiebert. He was doing freelance work for Paul Rand at the time and worked on the product graphics for the System 360. I just did some grunt production work. We also did some work for Rand for Westinghouse. I actually did some design work (washing machine product graphics) for them.\n\nChrisL\n\n"
    },
    {
      "time": "11 Jan 2006 — 2:58pm",
      "content": "Those were the days when all the best logos had balls!\n\n[http://blogs.msdn.com/larryosterman/archive/2005/07/14/438777.aspx](http://web.archive.org/web/20120415120125/http:/blogs.msdn.com/larryosterman/archive/2005/07/14/438777.aspx \"http://blogs.msdn.com/larryosterman/archive/2005/07/14/438777.aspx\")\n\nSi\n\n"
    },
    {
      "time": "11 Jan 2006 — 4:12pm",
      "content": "\"Those were the days when all the best logos had balls!\"\n\nYup, and the Westinghouse circle W had three of them :-)\n\nChrisL\n\n ![](http://web.archive.org/web/20120415120125im_/http:/typophile.com/files/WESTINGHOUSE_logo.gif)\n\n"
    },
    {
      "time": "12 Jan 2006 — 12:10am",
      "content": "\\> But would that say future? Or computers?\n\nNow, I think it could. computers are sold less on the basis of their being technology now than on the basis that they do something for us. Service/results vs. Mhz. I think that trend will continue. A handwritten ibm logo would encoumpass that warmer point of view. Plus then they could be WARMER in feeling than Apple which would really be interesting. But they don't sell consumer devices anymore so thats that.\n\nThe three balls of westing house was the first logo I looked at & said to myself - 'that sucks'. Now I see why it might have been effective from a pure academic point of view. But on a gut level I have always & still hate it.\n\n"
    },
    {
      "time": "12 Jan 2006 — 7:43am",
      "content": "It seems to me somehow \"weak\" or something. At best, a mediocre effort and I'm not personally sure I like either the \"d\" or \"a\" as they look like they'll be dated in only a decade (or less?). It isn't to my mind either strong enough or modern enough for the 21st century. And not really expressive enough about Kodak's future goals/desires. One of those logos you'll look at a few years hence and say to yourself \"Oh yeah, that's so 2006.\"\n\nI was never a huge fan of their previous logo (6.5/10 maybe?) but this one works even less for me. My $0.02 anyway.\n\nDaveyJJ \\<-- WidgetMonkey\n\n"
    },
    {
      "time": "12 Jan 2006 — 10:57am",
      "content": "\"they look like they’ll be dated in only a decade (or less?). \"\n\nWe call that \"Built in obsolescence\". This is the trouble with designing a logo based on current \"style\" rather than communications need. A well designed logo should last for many years. The hardest part about a new logo is the time it takes for your audience to make the new association. If you think about the CocaCola logo (which I feel is pretty awful but would not change), you have brand identity that is extremely strong and shouldn't be tampered with. A few years back, they did a new \"Coke\" swoosh logo which was an abysmal failure but not because it looked bad. It looked fine enough. It failed because it screwed up the existing brand identity and the customers were really bent out of shape about it. Now CocaCola is not in any sort of midlife crisis like Kodak and have nothing to gain.  \nBack to \"Built in obsolescence\". IMHO, there are SOME marketing/Branding firms about who would love to sell you a new logo or Brand even if you don't need one or even if it might do more harm than good.  \nA couple of years ago Nike flirted with dumping the “Swoosh” in favor of plain lowercase italic serif type. I don’t know who got the bright idea that Nike had a branding problem that required jerking the most successful logo on Earth and replacing it with ho-hum nuttin’ but I am glad to see they went back to the swoosh shortly there after. Ya see, the Swoosh was not “obsolete,” it was just “built in”\n\nChrisL\n\n"
    }
  ]
}
