{
  "id": "17131",
  "title": "Nike uses Insider for Annual Report 2005",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Nike uses [Insider Regular Roman](http://web.archive.org/web/20131015071201/http:/www.characters.nl/) as textfont for their Annual Report 2005.  \n [Download](http://web.archive.org/web/20131015071201/http:/www.nike.com/nikebiz/investors/annual_report/ar_05/docs/2005_annual_report.pdf) the Annual Report 2005 from Nike directly as pdf and see for yourself. Or download it from [Characters Font Foundry](http://web.archive.org/web/20131015071201/http:/www.characters.nl/downloads/2005_annual_report.pdf).\n\nToo bad they didn't ask me for the Insider Regular Roman LF, because the Insider Regular Roman they bought has old style figures. I have a font ready with lining figures that they could use immediately. In stead they used Helvetica for all the numbers! My god, they must love Insider, otherwise who else would go through all this trouble to change ALL the numbers into another font? ;-)  \nI tried contacting the designer at Nike, but without any luck.\n\nIf anyone comes across a printed sample, I'd love to have one. You find my [address](http://web.archive.org/web/20131015071201/http:/www.characters.nl/) on the website. Please send me a copy.\n\nThis is the old thread about Insider: [http://typophile.com/node/4094](http://web.archive.org/web/20131015071201/http:/typophile.com/node/4094 \"http://typophile.com/node/4094\")\n\nBest regards,  \n®ené Verkaart\n\nCharacters Font Foundry { Typography to express yourself }  \nBecome an **Insider** yourself. It's Really Simple: [http://www.characters.nl/rss/rss.xml](http://web.archive.org/web/20131015071201/http:/www.characters.nl/rss/rss.xml \"http://www.characters.nl/rss/rss.xml\")\n\n| Attachment | Size |\n| --- | --- |\n| [nike.jpg](http://web.archive.org/web/20131015071201/http:/typophile.com/files/nike.jpg) | 21.71 KB |\n\n",
  "author": "Rene Verkaart",
  "time": "7 Jan 2006 — 11:09am",
  "uid": "1946",
  "comments": [
    {
      "time": "8 Jan 2006 — 12:32am",
      "content": "Congratulations Rene! Our love for type started the same way (making comics)!\n\n"
    },
    {
      "time": "9 Jan 2006 — 6:33am",
      "content": "Congratulations. That's a pretty big \"feather in your cap.\"\n\n"
    },
    {
      "time": "11 Jan 2006 — 6:44am",
      "content": "\\> otherwise who else would go through all this trouble to change ALL the numbers into another font? ;-)\n\nBean counters!\n\n$20 says the accountants made them switch.\n\n"
    },
    {
      "time": "11 Jan 2006 — 8:45am",
      "content": "Congrats René. As for the numerals: There are SEC (Securities & Exchange Commission) rules regarding the typesetting of financial statements, with very specific uses of indents, thickness of underlines, etc. And tabular figures are called for to make clear and perfectly-aligning financial tables. The Oldstyle versus Lining issue was probably a factor, but not as much as the Proportional versus Tabular.\n\n"
    },
    {
      "time": "11 Jan 2006 — 11:45am",
      "content": "Interesting, do you have a pointer to those specs? May come in handy in helping convince people here to support OT better.\n\nCheers, Si\n\n"
    },
    {
      "time": "11 Jan 2006 — 1:10pm",
      "content": "Si, I can't put my hands to any document of regulations, but I'm sure they're out there on the internets. (When I was a graphic designer, I worked on a trio of annual reports, and all attempts at typographic styling in the financials section were completely shot down by the client due to the SEC requirements. When I then went and looked at other annuals, I noticed that all of the financials were typeset exactly the same way.)\n\nSo, make sure that your typefaces have tabular figures, and that the width is the same in all weights. And include figurespace (uni2007) and figuredash (uni2012) in your fonts.\n\nBy the way, 2006 is the Unicode index of the six-per-em space. Happy six-per-em space year, everyone.\n\n"
    },
    {
      "time": "17 Jan 2006 — 3:18pm",
      "content": "Big score, dude.\n\n\\> I have a font ready with lining figures that they could use  \n\\> immediately. In stead they used Helvetica for all the numbers!\n\nTypical.\n\nhhp\n\n"
    },
    {
      "time": "7 Feb 2006 — 2:39pm",
      "content": "Hi guys,\n\nI did some annuals in my time as a graphic designer, but never heard about this regulation. I would be interested to find out more about this.  \nI know that numbers should be tabular, what makes also sence to me. But that SEC regulation is new to me.\n\nIf anyone finds more about it, please post it.\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20131015071201/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*  \n [http://www.characters.nl/rss/rss.xml](http://web.archive.org/web/20131015071201/http:/www.characters.nl/rss/rss.xml \"http://www.characters.nl/rss/rss.xml\")\n\n"
    }
  ]
}
